{
  "id": 3064,
  "mediaId": 2518,
  "date": "2022-01-30",
  "headline": "NOT REAL NEWS: A look at what didn't happen this week",
  "image": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/200526412_200526412-8313a06fd7104b878b958e26534a7b3a_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676",
  "link": "https://www.arkansasonline.com/news/2022/jan/30/not-real-news-a-look-at-what-didnt-happen-this/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "John Swartzberg, a clinical professor of infectious diseases and vaccinology at the University of California, Berkeley, told the AP variants are more likely to emerge in unvaccinated populations because the virus replicates better in people who aren't vaccinated, giving it a better chance of evolving.",
    "Video and image don't show trucks or Mennonite buggies going to Canada protest\nCLAIM: A video shows trucks traveling from South Carolina to Ottawa to protest COVID-19 mandates for cross-border drivers, and an image shows Mennonites in horse-drawn buggies traveling to the same protest.",
    "During a panel discussion Monday hosted by Republican Sen. Ron Johnson, of Wisconsin, Dr. Robert Malone, a frequent critic of the COVID-19 vaccines, suggested mass vaccination will produce new variants of the virus, and the vaccines increase the infectiousness of the omicron variant.",
    "Meanwhile, the image of horse-drawn buggies depicts members of the religious order headed to church -- a common sight outside the Waterloo region in Ontario, where it was captured -- and is not related to the protest, said Graham, a sports photographer based in Canada.",
    "\"We have data from the U.K., Switzerland, Canada, Ireland, Chile, from Israel, from South Africa all of them show the effectiveness of vaccination in terms of decreasing hospitalization and some of them show effectiveness in the omicron period as well,\" she said.",
    "Dr. Peter McCullough, a Dallas cardiologist and vaccine critic who spoke at the conference, said the Centers for Disease Control and Prevention is conducting academic fraud and COVID-19 vaccines are not effective at preventing hospitalization from COVID-19.",
    "\"**HUGE BREAKING NEWS** -- Wisconsin Assembly Votes to Withdraw Its 10 Electors for Joe Biden in 2020 Election -- VIDEO,\" read a Tuesday headline from The Gateway Pundit, a conservative website that has spread numerous election- related conspiracy theories.",
    "According to the World Health Organization, evidence shows the COVID-19 vaccines remain effective at preventing severe disease, hospitalization and death against all variants of SARS-CoV-2 virus, including omicron, although data on omicron is still early.",
    "While it's possible for new variants to emerge alongside mass vaccination, infections in unvaccinated people pose a greater overall risk, John Mittler, an associate professor of microbiology at the University of Washington School of Medicine, told the AP.",
    "Steineke is right there's no constitutional or statutory authority to take back the state's electors in an election that already has been certified, according to Kenneth Mayer, a political science professor at the University of Wisconsin in Madison.",
    "\"If we continue to pursue universal vaccination, the high probability is that what we will continue to see is the evolution of additional escape mutants that are increasingly infectious and may well become more pathogenic,\" Malone said.",
    "The AP reported on an analysis from South Africa in December that found those who had two doses of the Pfizer- BioNTech COVID-19 vaccine had 70 percent protection against hospitalization from COVID-19 during the country's omicron surge.",
    "Though Republican state Rep. Timothy Ramthun last week introduced a resolution to reclaim the state's presidential electors, no one voted on it and the Assembly's rules committee chair has said he will shut the resolution down.",
    "THE FACTS: Experts said they have seen no credible evidence to support the claim COVID-19 vaccines are making the omicron variant more infectious, or the vaccines will increase the likelihood of new variants.",
    "Both false claims circulated online as truck drivers began heading to Ottawa, Canada, this week to protest a new Canadian mandate requiring truckers entering the country to be fully vaccinated as of Jan. 15.",
    "It has \"nothing to do\" with the protest in Canada and was taken during a \"Truck Convoy for Special Olympics\" event in August 2021, said Michele Bryant, vice president of compliance at Bottomley Enterprises.",
    "And an image of horse-drawn buggies traveling on a snowy road shows Old Order Mennonites going to church Jan. 16 outside the Waterloo region in Ontario, photographer Michelle Graham confirmed to the AP.",
    "Social media users are sharing video clips of a COVID-19 discussion panel held Monday by Sen. Ron Johnson, a Republican representing Wisconsin, leading to the spread of false information about vaccines.",
    "When comparing vaccinated versus unvaccinated people, he said, \"consistently across all countries\" that report data, vaccinated people have lower hospitalization rates than those who are not immunized.",
    "-- The Associated Press\nCOVID-19 vaccines do not cause new variants\nCLAIM: COVID-19 vaccines are facilitating omicron's infectiousness and mass vaccination might spur the development of new mutations.",
    "The UK Health Security Agency released data earlier this month that found after three months of receiving the third dose, those 65 and older had 90 percent protection against hospitalization.",
    "Wisconsin Assembly did not vote to withdraw Biden electors\nCLAIM: The Wisconsin Assembly voted this week to withdraw its 10 electoral votes for President Joe Biden in the 2020 election.",
    "Dr. David Dowdy, an infectious disease epidemiologist at Johns Hopkins Bloomberg School of Public Health, said globally, people who are vaccinated have lower rates of hospitalization.",
    "A video of a truck convoy on a highway shows trucks during a Special Olympics South Carolina event last year, said an official for a trucking company whose owner posted the video.",
    "Here are the facts:\nCOVID-19 vaccines lower hospitalizations across the board, not just in the US\nCLAIM: Vaccines only reduce hospitalizations in the U.S., not in other countries.",
    "But the claims are false, according to epidemiology and vaccinology experts, who said vaccine-induced immunity actually decreases the chances new forms of the virus will spread.",
    "Thousands of social media users shared the article or similar claims, including Kari Lake, a 2022 gubernatorial candidate in Arizona endorsed by former President Donald Trump.",
    "In response to the AP's request for comment, Malone wrote in an email, \"Right now, I am getting so many emails that I just don't have time to personally respond to them all.",
    "He also falsely claimed the U.S. is the only country reporting a decline in hospitalizations from the vaccines while South Africa, the United Kingdom and Israel are not.",
    "Biden beat former President Donald Trump in Wisconsin by about 20,000 votes, and there's no evidence of widespread fraud in the 2020 election in Wisconsin or elsewhere.",
    "But the truck video, posted Jan. 22 on TikTok by Mitchell Bottomley, the owner of the South Carolina trucking company Bottomley Enterprises, is being misrepresented.",
    "Those with two doses of the COVID-19 vaccine had 70 percent protection from hospitalization after three months of receiving the vaccine and 50 percent at six months.",
    "The Gateway Pundit later changed its headline to claim the Assembly voted \"to advance\" a resolution that would reclaim the state's electors -- which is also false.",
    "Data from multiple countries has demonstrated the vaccines are effective, said Dr. Wafaa El-Sadr, director of ICAP, a global health center at Columbia University.",
    "Chris Beyrer, a professor of epidemiology at Johns Hopkins Bloomberg School of Public Health, confirmed in an email to the AP Malone's claims were false.",
    "\"I took it and a full series of shots from that morning, as seen on my website and various social media platforms,\" said Graham in an email to the AP.",
    "Social media users shared the video and image as alleged proof people from different locations were uniting to join the \"freedom convoy.\"",
    "THE FACTS: COVID-19 vaccines, with or without a booster dose, have been shown to reduce rates of hospitalization in several countries.",
    "Of the claim the vaccines make omicron more infectious, Swartzberg said, \"I've seen no evidence to suggest, much less indicate that.\"",
    "His legislative assistant, Erin Yager, said the representative stands by his position the resolution was constitutional.",
    "Rep. Jim Steineke, the Assembly's majority leader and rules committee chair, tweeted to dispel the false claim Tuesday.",
    "THE FACTS: No such vote took place, nor would it be possible within the law for Wisconsin to recall its 2020 electors.",
    "\"The big picture is that vaccination reduces the amount of virus circulating in the body,\" Mittler wrote in an email.",
    "\"An unvaccinated person produces so much more virus so there's a much greater chance of a variant being produced.\"",
    "Steineke, a Republican, explained in his tweet Ramthun introduced a resolution to withdraw the state's electors.",
    "On Friday, the CDC published a report finding COVID-19 vaccine booster shots are preventing hospitalizations.",
    "\"Omicron is not only resistant to the vaccine but its infectivity seems to be facilitated by the vaccine.\"",
    "In a separate tweet Tuesday, Steineke explained Ramthun's proposal was illegal and he wouldn't advance it.",
    "-- Associated Press writers Fichera in Philadelphia and Arijeta Lajka in New York contributed this report.",
    "Because it was a \"privileged\" resolution, the Assembly's rules required it to be referred to committee.",
    "Experts, including the nonpartisan Wisconsin Legislative Council, have come to the same conclusion.",
    "The U.S. has imposed the same requirement on truckers crossing the border in the other direction.",
    "The report detailed how the third shot provided 90 percent protection against hospitalization.",
    "A roundup of some of the most popular but completely untrue stories and visuals of the week.",
    "Israel, South Africa and England have shown similar results on preventing hospitalizations.",
    "\"The net effect of the vaccine is to reduce the total number of cells that get infected.\"",
    "A video clip of Malone's comments has circulated widely on social media and on blogs.",
    "Graham took the photo Jan. 16 and posted it to social media the following day.",
    "Neither Lake nor The Gateway Pundit responded to emailed requests for comment.",
    "None of these are legit, even though they were shared widely on social media.",
    "-- Associated Press writer Ali Swenson in New York contributed this report.",
    "-- Associated Press writer Josh Kelety in Phoenix contributed this report.",
    "The resolution was sent to the rules committee, which Steineke chairs.",
    "McCullough did not respond to a request for comment via email.",
    "I apologize, but I just don't have enough hours in the day.\"",
    "Publicly available data contradicts McCullough's claims.",
    "The U.S. is not the only country seeing these results.",
    "\"Zero relation to any political protest or movement.",
    "The Associated Press checked them out.",
    "THE FACTS: Neither claim is true.",
    "Ramthun did not comment.",
    "Just going to church.\""
  ]
}