{
  "id": 3414,
  "mediaId": 2642,
  "date": "2022-02-03",
  "headline": "[VIDEO] Polish Immigrants Make Food For Freedom Truckers “We Come From Communism, We Want a Free Country”",
  "image": "https://waynedupree.com/wp-content/uploads/2022/02/Polish-women-01.jpg",
  "link": "https://waynedupree.com/2022/02/polish-immigrants-freedom-truckers/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Missy Crane",
  "authorUrl": "https://waynedupree.com/author/missycrane/",
  "termIds": [
    0
  ],
  "sentences": [
    "And the reason they did it was that they wanted to show their support for the truckers because they know what it’s like to live under communism, and they want to “feed freedom.”\n100 Percent Fed Up reported that thousands of Canadians have already come out in support of these truckers and what they stand for, lining the streets and highways to cheer on the convoy.",
    "And when they come out and show their support like these amazing women did, it really destroys the narrative that people like Justin Trudeau spread, making the Freedom Truckers and supporters out to be monsters and “insurrectionists.”",
    "I mean, this is unbelievable during communism times we were able and free to go to the church… I really can’t take it anymore.”\nYou can watch the video below:\nLooks like the truckers are going to be here for a long time!",
    "Among all of the support the truckers are getting, some of the most impactful support came from a group of Polish women, who were interviewed by Laura Lynn Tyler Thompson, former co-host of The 700 Club Canada.",
    "Pulling up with trucks and crates filled with 1,550 Polish sausages, paczkis (polish donuts), and bread, these women came prepared to feed as many truckers as possible with all their delicious food.",
    "They packed their truck full of delicious baked goods like bread and pastries and other Polish delights like kielbasa and headed to downtown Ottawa.",
    "When asked by Thompson why they brought all of this food, one of the women, Bernadette, replied,\n“Because we stand behind them.",
    "A group of Polish female immigrants made the trek to Ottawa with a truck full of food so they could feed the #FreedomTuckers.",
    "There’s nobody who knows and understands what tyranny truly is, more than the people who actually lived through it.",
    "pic.twitter.com/6O3j6lJTcc\n— Laura Lynn Tyler Thompson (@LauraLynnTT) February 2, 2022\nThis is amazing.",
    "We are being told to stay at home, we’re told not to go to the restaurant, not to go to the church!",
    "We come from [a] communist country, and we came here because we didn’t want to have oppression.",
    "We wanted to live in the free country, and for the last two years, we’re living like prisoners.",
    "Men and women trucking food across the country to feed Canada‘s heroes.",
    "It’s amazing."
  ]
}