{
  "id": 4141,
  "mediaId": 8476,
  "date": "2022-01-24",
  "headline": "The Daily Agenda: Don't Sue Us, We'll Sue You First",
  "image": "https://media2.fdncms.com/tucsonweekly/imager/u/slideshow/31877296/sinemaside-800.jpg",
  "link": "https://www.tucsonweekly.com/TheRange/archives/2022/01/24/the-daily-agenda-dont-sue-us-well-sue-you-first",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Leingang and Hank Stephenson",
  "authorUrl": "https://www.tucsonweekly.com/author/rachel-leingang-and-hank-stephenson",
  "termIds": [
    0
  ],
  "sentences": [
    "In a statement, Ducey described the Biden administration as holding hostage congressionally approved funds and trying to “bully Arizona into complying with this power-grabbing move.”\nHe got some backup from Arizona’s Republican representatives in Congress, who wrote Yellen a sternly worded letter calling attempts to take the money back “federal overreach.”\nWhile the bonuses to schools that don’t implement mask mandates have been wildly popular (even among ineligible schools), the voucher programs have been far less popular.",
    "Ducey has drawn the ire of the Treasury for several programs he has created with federal American Rescue Plan Act money: one offering money to schools that don’t implement mask mandates, another offering money to parents who want to take their kids out of schools with mask mandates and a third (which the feds have not yet challenged) paying parents to move their kids from schools that close because of COVID-19 outbreaks.",
    "Alex Gulotta, director of All Voting is Local, pointed back to Townsend’s behavior in a contentious 2020 hearing, when she threatened to have police detain anyone who disrupted a meeting on election legislation by calling the bills “racist.”\nAt House Elections, Kelly Townsend, the chair, referenced Eddie Farnsworth in Senate Judiciary last week saying: \"nobody can impugn anyone on the dais.\"",
    "In other Election 2020 news, the pressure campaign on Attorney General Mark Brnovich continues, and the Arizona Oath Keeper facing seditious conspiracy charges is considered a “serious danger.”\nFun times at the COVID-19 corral: The omicron surge could, thankfully, be starting its descent, though declining from wildly high still leaves our case numbers really high.",
    "And they’ll focus their lobbying efforts not on fighting in a committee with a preordained outcome, but on speaking directly with moderate Republicans who can kill the legislation in the sharply divided Senate and House, though Gulotta didn’t want to name those moderate Republicans for fear of making them the target of “bullying” in the Senate.",
    "“I don’t think anyone should subject themselves to the kind of abuse that advocates were subjected to two years ago.”\nWhile the groups are still deciding whether they’re going to engage with the House Government and Elections Committee — the House committee in charge of election law changes — Gulotta said Townsend’s committee is a lost cause.",
    "https://t.co/lWR2CJwa25\n— Tim Steller (@senyorreporter) January 22, 2022\nThe calendar just stopped in 2020: Disgraced hair-dye user Rudy Guiliani and other Trump campaign operatives helped orchestrate the fake elector slates in seven states, including Arizona, as part of their efforts to overturn the election results, CNN reports.",
    "@marthamaccallum @FoxNews pic.twitter.com/sBl5isKsL3\n— Doug Ducey (@dougducey) January 21, 2022\nBut as the Republic’s Stacey Barchenger reports, ARPA directed Secretary of the Treasury Janet Yellen to issue rules to carry out the law — and her rules say money cannot be used to undermine “efforts to stop the spread of COVID-19.\"",
    "New judge, same result\nYou could buy several governors for this price: There’s no incumbent for either political party in this year’s gubernatorial race, so the millions keep on flowin’ into the field of candidates on both sides, the Republic’s Stacey Barchenger reports.",
    "— Dillon Rosenblatt (@DillonReedRose) February 18, 2020\n“The people who believe there are bamboo fibers embedded in the ballots because they came from outside the country or other racist and fantastic conspiracy theories, we're not going to change their mind,” he said.",
    "And the big lingering problem of the school funding cliff remains:\nThe more water, the better: The Biden infrastructure plan brings more than $18 million into Arizona to help with water projects for rural and Indigenous communities, the Republic’s Cami Parrish writes.",
    "And the idea of desalination causes concerns over environmental impacts, costs and energy, with critics saying Ducey’s proposal (which isn’t really a proposal for desalination only or directly) goes “too far too fast,” the Arizona Daily Star’s Tony Davis reports.",
    "Doug Ducey shot back at the U.S. Department of Treasury with a preemptive-strike lawsuit after the feds again threatened to claw back federal anti-COVID-19 funds that Ducey has been holding over schools as a way to fight mask mandates and COVID-related closures.",
    "You can put this blurb in Duda’s performance review: The Arizona Independent Redistricting Commission certified final maps on Friday, sending them to the Secretary of State’s Office for the final step, the Arizona Mirror’s Jeremy Duda reports.",
    "As some of Arizona’s most conspiratorial lawmakers set their sights on a host of election law changes in the Senate Government Committee today, a dozen¹ voting rights groups that are staples at the Capitol are boycotting the committee.",
    "In the wake of the death of a cinematographer on a set in New Mexico last year, the city added the ban on live ammunition and put the requirements into new language in their filming permits, the Daily Star’s Nicole Ludden reports.",
    "The threat was a promise: After threatening to sue following the Arizona Corporation Commission’s cut to the company’s profits, Arizona Public Service did, indeed, sue in two different courts, the Republic’s Ryan Randazzo reports.",
    "Instead, he’s entering into a game of legal chicken with the Department of Treasury, putting more than $2 billion of desperately needed anti-COVID funds on the line as Arizonans are again getting pummeled by the virus.",
    "Tucson media continues to dominate the guv’s office: Tucson journalist Lorraine Rivera, the host of “Arizona 360” on Arizona Public Media, will join the Ducey administration as director of the Southern Arizona office.",
    "“We're hoping that there are enough legislators in the middle that these bills won't pass — and that's the most effective way to do this.”“Many of these bills have a disproportionate impact on communities of color.",
    ": The Arizona Democratic Party censured its perpetual-thorn-in-side, U.S. Sen. Kyrsten Sinema, this weekend over her support for the filibuster, which is holding up all kinds of Democratic policies in Congress.",
    "Meanwhile, in Cochise County, the Board of Supervisors turned down nearly $2 million because of a host of concerns you’ve read on your grandparents’ Facebook pages, the Daily Star’s Tim Steller writes.",
    "The groups say it’s not worth putting their people in danger of contracting COVID-19 just to be demeaned by the committee chair, Republican Sen. Kelly Townsend, as she spouts election conspiracies.",
    "Count all the syllables on your hand like we did: We’re sick of writing about all the Cyber Ninjas/Arizona Senate attempts to deny the public its records, so here are the latest updates as a haiku.",
    "Must’ve been quite the test: Peoria’s fire chief allowed an employee to bank about $30,000 in 12 weeks to study for an exam instead of working his regular job, the Republic’s Wyatt Myskow reports.",
    "The Treasury has repeatedly warned that the first two programs aren’t what the anti-COVID funding is for, and they’ve threatened to take the money back if Ducey doesn’t stop spending it like that.",
    "In the lawsuit, Ducey and his lawyers argue that the Treasury Department’s new rules on acceptable uses of the funds usurp the more lax restrictions Congress laid out in the spending package.",
    "More significantly, the department has threatened to withhold the next round of ARPA cash from Arizona, totaling more than $2 billion, if Ducey doesn’t change or eliminate the program.",
    "Ducey v. Biden feels like a Senate run precursor ... Voting rights groups ditch Townsend's committee ... And Sinema hopes this keeps the McCain comparisons coming.",
    "After being censured by Arizona Democrats, @SenatorSinema will enjoy the comparisons to John McCain, who was censured by the state GOP and still won easily.",
    "And it’s spreading rapidly through Maricopa County’s jails, where already strained staffing levels now are worse, Phoenix New Times’ Katya Schwenk reports.",
    "Budget bonanza: Ducey’s budget proposes more money for prisons than ever, despite lower numbers of inmates, the Republic’s Jimmy Jenkins reports.",
    "Rather than show up to Townsend’s dog and pony show, Gulotta said the groups will take to TV, radio, print, social media and community meetings.",
    "Bill bonanza: Now that Arizona Legislature is in full swing, bills fly around the Capitol nonstop, so we’ll just round them all up here.",
    "Republican lawmakers don’t want schools to pay dues to the Arizona School Boards Association, a local version of a national movement.",
    "She made it into SNL’s Weekend Update again, with the cast joking about her shaking hands with Republicans after her vote last week.",
    "A censure, in itself, is solely a symbolic measure, but it speaks to underlying schisms Sinema will face with her base of support.",
    "President Biden needs to stay in his federal lane and let Arizona's parents and families make the best decisions for their kids.",
    "Welcome: Arizona-based journalist Fernanda Santos launches her own newsletter on Substack today, which makes us colleagues.",
    "Wait til the Legislature hears about this: When crews film in Tucson, they won’t be allowed to use live ammunition.",
    "You can sign up for free, sure, but you can also start paying because it directly supports two local journalists.",
    "And so far, GOP candidate Kari Lake and Dem candidate Marco Lopez are burning through their hauls at high rates.",
    "The Friday approval came after a heated, accusatory meeting last week that ended abruptly without approved maps.",
    "The Arizona Agenda is a political newsletter by independent journalists Rachel Leingang and Hank Stephenson.",
    "And Ducey could simply use state funds to pay for the programs, which have cost less than $200 million.",
    "And your dentist could start giving you Botox and fillers (you probably didn’t know that was coming).",
    "College students could carry concealed weapons on campus, renewing an endless debate over this issue.",
    "And if anybody calls them \"racist\" there will be one warning and after that they will be removed.",
    "The Arizona version of the Texas anti-abortion law gets introduced (you knew it was coming).",
    "The fire chief retired after being placed on paid leave while the matter was investigated.",
    "Treat yourself: It’s unclaimed property auction time at the Arizona Department of Revenue.",
    "But she could just as easily end up like Jeff Flake — politically homeless and thrown out.",
    "(Give it up to Duda for offering the most consistent and thorough coverage of the IRC!)",
    "A personal goal: Oh, to be a “tiny, sap-sucking insect” gnawing down on an aspen tree.",
    "We won’t turn down $8 or $80 in the form of your paid subscriptions, either.",
    "That’s racist, and Sen. Townsend doesn’t want to hear that,” Gulotta said.",
    "Doug Ducey for it (who insists he’s still not running for U.S. Senate).",
    "Don’t forget about the flu, either, the flu would like to remind you.",
    "What’s a censure among friends who will primary you in 2024?",
    "We, on the other hand, would not turn down $2 million.",
    "Arizona could have competitive electricity markets.",
    "(Each line is a different story about the records.)",
    "Find more of their reporting on Substack.",
    "She replaces Becky Freeman.",
    "There are DPS agents here.",
    "She got praise from Gov.",
    "Good point.",
    "Gov."
  ]
}