{
  "id": 487,
  "mediaId": 2748,
  "date": "2022-02-22",
  "headline": "Border Crisis Can't Wait Three More Years For A New Administration To Fix: Russ Vought",
  "image": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2022-02/Russ-Vought-700x420.jpg?itok=dUVDq11d",
  "link": "https://www.zerohedge.com/political/border-crisis-cant-wait-three-more-years-new-administration-fix-russ-vought",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Durden",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The responsibility is now on the governor of Arizona and the governor of Texas to be able to say: we’re going to articulate that legally; we have this responsibility as Commanders-in-Chief of our state to be able to give rules of engagement to our National Guards or the Department of Public Safety or the sheriffs and say, interdict and remove individuals back to Mexico, and to be able to stop the flow of illegal immigration as a result,” Vought said.",
    "Last week, when asked by 12News KPNX, Ducey tried to dodge the question first, then he responded, “I think you ought to read the opinion in full … It doesn’t even mention the National Guard.”\nHowever, Brnovich’s opinion did say the National Guard is the state’s militia, and the governor is “commander-in-chief.”\nSome analysts and attorneys have challenged Brnovich’s opinion.",
    "Authored by Harry Lee and Steve Lance via THe Epoch Times,\nThe situation at the southern border has been so bad that it can’t wait three more years for a new administration to step in, and border states have the constitutional authority to defend themselves, according to Russ Vought, former director of the Office of Management and Budget under the Trump administration.",
    "“And so from the standpoint of where we are, as a country, we’re no longer in a position where the country can just wait three years to have a potential for a new administration to come in into power.”\nIn the calendar year 2021, the southern border had over two million encounters, according to data from Customs and Border Protection (CBP).",
    "“even if Governor Doug Ducey does not do this in Arizona, the candidates who are running to replace him are committing themselves to this position.”\nAt least one Republican gubernatorial candidate in Arizona, Kari Lake, called for an interstate compact that would declare the states are under “invasion” and secure the border.",
    "“We got to use these governors to be able to say: what is the maximum that the Constitution allows for them to do?”\nHomeland Security Secretary Alejandro Mayorkas has repeatedly said that the border is closed, “do not come.”\n“We look back at the Constitution, say, what did the founders mean when they looked at an invasion.",
    "Vought said his organization called on the border governors late last year to exercise such authorities, and it’s the fruition of their work that triggered Arizona Attorney General Mark Brnovich to issue a legal opinion (pdf) last week stating that states have such authority.",
    "“We have a real crisis along our border: record apprehensions; the drug cartels are basically in operational control of our border; massive amounts of drugs are coming across the southern border,” Vought said in an interview with NTD’s “Capitol Report” program on Feb. 12.",
    "Former President Donald Trump and Kari Lake, whom Trump is supporting in Arizona’s gubernatorial race, speak during a rally at the Canyon Moon Ranch festival grounds in Florence, Arizona, on Jan. 15, 2022.",
    "And then once those two states [do it], those are two of the three big areas for illegal immigration, that puts a lot of pressure on the other two states that are led by Democrat governors,” Vought said.",
    "And we’ve said that constitutes an invasion that the Constitution then says there are self-help provisions to allow them to defend their people and keep them safe,” Vought said.",
    "The Founders were quite clear that the invasion clause is, as James Madison put it, an operation of the military,” David Bier of the Cato Institute told 12News KPNX.",
    "That doesn’t include the number of “gotaways”—those who Border Patrol detects but doesn’t capture—but The Epoch Times has been told it was about 600,000 for 2021.",
    "“Our view is that over time, this is something that will have a domino effect.”\nThe Epoch Times has contacted the Department of Homeland Security for comment.",
    "(Screenshot via The Epoch Times)\nCBP has reported a 1,066 percent increase in fentanyl seized in south Texas ports during the fiscal year 2021.",
    "It was bandits, gangs, large groups of people that it was hard to get a handle on from a security standpoint.",
    "Vought founded a non-profit organization named the Center for Renewing America after he left office in 2021.",
    "(Robyn Beck/AFP via Getty Images)\n“Our view is that come next year, this will happen in Arizona.",
    "And our view is if it happens in Arizona, it’s going to put massive pressure on Texas to do it.",
    "“The idea that he is representing the Founders’ view on this issue is totally incorrect.",
    "Vought believed that governors have such authority, but he acknowledged that Texas Gov.",
    "Russ Vought in an interview with NTD's \"Capitol Report\" broadcast on Feb. 12, 2022.",
    "Lake is leading among Republican candidates for the primary in a January poll.",
    "Due to term limits, Ducey has served two terms and can’t run for reelection.",
    "The two governors’ offices haven’t responded to a request for comment.",
    "“This administration has an ideologically open-border policy.",
    "“I think we’re winning this debate,” Vought told NTD.",
    "Doug Ducey have been unwilling to do it so far.",
    "They refuse to execute the law,” Vought said.",
    "It wasn’t just foreign nation-states.",
    "Greg Abbott and Arizona Gov."
  ]
}