{
  "id": 5675,
  "mediaId": 2574,
  "date": "2022-04-14",
  "headline": "Trump-Backed Kari Lake Knocked Doors for Obama, Former Colleague Says",
  "image": "https://freebeacon.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-09-at-10.54.31-AM-e1625842513529.png",
  "link": "https://freebeacon.com/elections/trump-backed-kari-lake-knocked-doors-for-obama-former-colleague-says/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Collin Anderson",
  "authorUrl": "https://freebeacon.com/author/collin-anderson/",
  "termIds": [
    2027,
    2706,
    5802,
    5702,
    2765,
    4325,
    511,
    6292,
    5949
  ],
  "sentences": [
    "In a 2016 Facebook post, Lake said it was \"impossible\" to implement Trump's \"plan to deport 11 million immigrants\" and argued that the United States should instead allow illegal immigrants to \"legally\" reside in the country as they await citizenship.",
    "The former colleague, who requested anonymity to speak freely, confirmed that the conversation with Babeu took place and said the allegation about Lake's work for Obama emerged in the Fox 10 newsroom after Lake announced her candidacy for governor.",
    "The allegation that Lake knocked on doors for a Democratic presidential candidate is at odds with her rhetoric on the campaign trail, where Lake has positioned herself as the \"only conservative, America First Trump Republican in the race.\"",
    "Last month, Lake's longtime Fox 10 Phoenix colleague told former Pinal County sheriff Paul Babeu (R.) that Lake \"went door to door canvassing for Barack Obama\" during her time at the network, Babeu told the Washington Free Beacon.",
    "It is not, however, surprising given her past political activity—the Free Beacon reported last year that Lake in 2004 made her first ever political contribution to then-Democratic presidential candidate John Kerry.",
    "She now professes her \"love\" for the former president, says Trump should be put on Mount Rushmore, and promises to \"send National Guard Troops to the border\" to deport \"illegal aliens invading Arizona.\"",
    "Kari Lake—the self-proclaimed \"only conservative\" in the race for Arizona governor—volunteered to knock doors for the Obama campaign while she worked as a news anchor, according to a former colleague.",
    "A veteran Arizona Democratic operative who was working in the state in 2008 identified Angelo as one of the party's most committed volunteers at the time and said Angelo and Lake were \"best friends.\"",
    "Trump's support has propelled Lake to the front of a crowded Republican primary field, which includes land developer Karrin Taylor Robson and former Republican congressman Matt Salmon.",
    "Lake worked to sidestep criticism of her past financial support for Democrats first by blaming the donations made in her name on her ex-husband, which would be illegal.",
    "In addition to her campaign donations to Democrats, Lake has pushed for liberal immigration policies such as amnesty and criticized former president Donald Trump.",
    "According to Lake's former colleague, Lake campaigned for Obama with Stephanie Angelo, who in 2008 was married to a different Fox 10 colleague, Troy Hayden.",
    "According to a Wednesday OH Predictive Insights poll, Lake leads the race with 29 percent support to Taylor Robson's 22 percent and Salmon's 11 percent.",
    "One year later, Lake blasted Trump's infamous Charlottesville press conference as \"a real $hit$how\" and said Trump showed \"absolutely no self control.\"",
    "Lake left her job as a Fox 10 anchor in March 2021, citing her disapproval of the \"obvious bias\" and \"liberal ideology\" in mainstream media.",
    "Lake's alleged behavior doesn't just contradict her rhetoric—network policy bars employees from campaigning for political candidates.",
    "If the allegations are true, Lake appears to have embodied the media behavior she now says forced her to quit the industry.",
    "(Lake's 2008 donation to Obama came shortly after National Journal ranked the Illinois Democrat the most liberal senator.)",
    "Hayden declined to comment, as Fox 10 employees are barred from discussing Lake's candidacy with outside media outlets.",
    "On the campaign trail, she regularly attacks the \"biased media\" for working to tip the scales in Democrats' favor.",
    "Four years later, in 2008, Lake registered as a Democrat and contributed to Obama's first presidential campaign.",
    "\"Look at Ronald Reagan,\" Lake told one interviewer who pressed her on her donations to Democrats.",
    "Her Republican campaign has shocked coworkers given her political activity while at the network.",
    "Lake also says the Democratic Party has grown more radical since she supported Kerry and Obama.",
    "Neither Lake's campaign nor Angelo returned a request for comment.",
    "Lake landed Trump's endorsement nonetheless.",
    "She then said she evolved politically.",
    "What's the problem with it?\"",
    "\"He was a former Democrat."
  ]
}