{
  "id": 6124,
  "mediaId": 8367,
  "date": "2022-04-11",
  "headline": "Do candidates who scream 'border invasion' really want an America without immigrants?",
  "image": "https://www.gannett-cdn.com/-mm-/9b14b5a0c1f4ce6aec0a2aeacfc4f7aeee85a788/c=0-48-3883-2242/local/-/media/2017/01/19/Phoenix/Phoenix/636204288292262126-farm-workers.jpg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/elviadiaz/2022/04/11/border-invasion-try-living-america-without-immigrants/7273289001/",
  "mediaOutlet": "Mesa Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elvia Díaz",
  "authorUrl": "https://www.azcentral.com/staff/2647952001/elvia-daz/",
  "termIds": [
    3005,
    2706,
    5930,
    5949,
    6026,
    6383,
    6678
  ],
  "sentences": [
    "There aren't enough immigrants to do our dirty work\nThe gap in immigrants, CBS News reports, “is especially being felt in low-paying industries, such as leisure and hospitality, food services retail, and health care.”\nImmigrants aren’t just farmworkers, cooks or maids.",
    "But to these folks, all of us are simply “border invaders.”\nArizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "I often wish a “Day Without a Mexican” – the 2004 film when Mexicans mysteriously disappear, leaving California without maids, construction workers, cooks, policemen and teachers – would actually become a reality now.",
    "Republicans keep pressing a 'border invasion'\nJust imagine for a second granting the Republicans – all those “patriots” screaming “border invasion” – their wish to live in their fantasy country of just white people.",
    "OK. Maybe all these folks are really that deranged and haven’t paid attention to new reports estimating the U.S. workforce has two million fewer immigrants than if immigration had continued at pre-pandemic levels.",
    "The Make America Great White Again crowd will keep pounding their “border invasion” tune through Election Day while enjoying the fruit of immigrant labor.",
    "No immigrants to grow and harvest their food, mown their lawns, clean their toilets, babysit their kids, or cook and serve their restaurant meals.",
    "The Make America Great Again leaders and their foot soldiers know this country would go hungry, get filthy and get messy without immigrants.",
    "Maybe Kari Lake, the former newscaster and Republican governor wannabe, is that deranged to believe in Making America White Again.",
    "Maybe Blake Masters and Jim Lamon and all other Republicans running for office this year do want America without immigrants.",
    "Oh, how I wish these people would have their wish of not just “A Day Without a Mexican,” but an America without immigrants.",
    "Or all other Republicans calling on President Biden not to end Title 42, saying the “border invasion” would get worse?",
    "Doug Ducey, the Arizona Republican governor who has for years promoted and fostered trade with Mexico?",
    "The folks screaming “border invasion” don’t really want immigrants gone – legal or not.",
    "In that fantasy world, the “white patriots” will have to do everything for themselves.",
    "Only then will they truly appreciate the richness of immigrant labor and culture.",
    "Some of us are journalists, lawyers, teachers, engineers and scientists.",
    "Elvia Díaz is an editorial columnist for The Republic and azcentral.",
    "No matter the alarm bells from immigration experts and economists.",
    "Reach her at 602-444-8606 or elvia.diaz@arizonarepublic.com.",
    "Maybe Arizona Attorney General Mark Brnovich, too.",
    "I’m sure some “patriots” want that fantasy world.",
    "No immigrants to pick up their dirty laundry.",
    "Or Senate Minority Leader Mitch McConnell?",
    "Because they need us and they know it.",
    "That would be a glorious day indeed.",
    "Follow her on Twitter, @elviadiaz1.",
    "And not just in California.",
    "And not just Mexicans.",
    "But not just a day.",
    "But do all of them?",
    "But what about Gov.",
    "Or Texas Gov.",
    "Greg Abbott?",
    "Why?"
  ]
}