{
  "id": 7675,
  "mediaId": 2642,
  "date": "2022-04-05",
  "headline": "[VIDEO] President Trump’s Candidate for MI Secretary of State is a GOP SUPERSTAR In The Making",
  "image": "https://waynedupree.com/wp-content/uploads/2022/04/MI-Sec-Of-State-Kristina-01.jpg",
  "link": "https://waynedupree.com/2022/04/mi-sec-of-state-kristina/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sophie O’Hara",
  "authorUrl": "https://waynedupree.com/author/sophieohara/",
  "termIds": [
    2765,
    2706,
    2088,
    392,
    6386
  ],
  "sentences": [
    "MORE NEWS: [VIDEO] “So Bizarre,” Americans React to Giant “Teleprompter” Joe Uses On His WH Set\nI love her message because it’s so true – she’s calling out Whitmer and her team of female shrews, who have driven Michigan into the ground.",
    "Kristina said these women, including the current secretary of state, are not even “Democrats.” They’re radical elites who treat the good people of Michigan like filthy unwashed peasants.",
    "But there’s another woman, who you may not have heard a lot about yet, but she’s so electric and wonderful, I have a feeling you’ll be hearing a lot more about her in the months to come.",
    "pic.twitter.com/sKLnIwkcXM\n— Liz Harrington (@realLizUSA) April 4, 2022\nNow, THIS is the type of America First candidate we need to have in a position like secretary of state.",
    "Her name is Kristinia Karamo, and she’s President Trump’s pick for Michigan’s secretary of state… and what a pick she is!",
    "Kari Lake is one of my favorites, she’s running for governor of Arizona, and she’ll do a stellar job.",
    "We got a chance to meet Kristina at President Trump’s recent Michigan rally.",
    "President Trump has backed some amazing America First candidates for 2022.",
    "You can watch the video below:\n“Who do these people think they are?",
    "This woman is remarkable and has “superstar” written all over her.",
    "Kristina asks, “Who do these people think they are?",
    "Nobody will pull off cheating under her watch.",
    "They work for us.” @KristinaKaramo ??????",
    "Dem elites have forgotten their place.",
    "We need a lot more like Kristina.",
    "She brought the house down!",
    "They work for us!”\nAmen."
  ]
}