{
  "id": 7726,
  "mediaId": 8428,
  "date": "2022-04-05",
  "headline": "Kari Lake calls for decertification of Wisconsin and Arizona",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/04/2HFDYRX-scaled-e1649173200681.jpg",
  "link": "https://www.rsbnetwork.com/news/kari-lake-calls-for-decertification-of-wisconsin-and-arizona/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Frudd",
  "authorUrl": "https://www.rsbnetwork.com/author/timothy-frudd/",
  "termIds": [
    4097,
    4065,
    2765,
    2706,
    1852,
    1586,
    1126,
    5949,
    6292,
    6729
  ],
  "sentences": [
    "In the video, Gregg Phillips, a member of the state’s Assembly Committee on Campaigns and Elections, explained, “We believe that 7 percent of the mail-in ballots… were cast as a result of trafficking.” This percentage amounts to 137,551 votes trafficked in a state where just over 20,000 votes decided the presidential election.",
    "There was major fraud and the people are seeing it.”\nPresident Donald Trump’s spokeswoman, Liz Harrington, shared a video on Twitter last Thursday, revealing a disturbing amount of voter fraud in Wisconsin’s 2020 presidential election.",
    "Photo credit: Alamy\nArizona gubernatorial candidate Kari Lake demanded Monday that both Wisconsin and Arizona decertify the results of the 2020 presidential election based on recently unearthed voter fraud evidence.",
    "Wisconsin Assembly Speaker Robin Vos recently acknowledged widespread voter fraud in the 2020 election; however, he has argued that the state legislature lacks the power to decertify the election.",
    "And Arizona.” Lake’s bold declaration on Twitter is one of many recent Republican rallying cries to decertify the results of the 2020 election based on factual evidence.",
    "According to the image shared by political activist Adam Dommeyer, 37 Wisconsin counties, about 51 percent of the state, want the 2020 election flipped.",
    "Kari Lake’s call to decertify the election results in Wisconsin and Arizona could soon become a reality if lawmakers act on the evidence.",
    "Trump countered with Special Counsel Michael Gableman’s investigation, which has already found enough evidence to reverse the results.",
    "Along with her statement, Lake shared a graphic showing Wisconsin counties that have demanded the election be decertified.",
    "Arizona is another key state that has seen continued evidence pouring out of election audits and investigations.",
    "Last week, Arizona State Senator Sonny Borrelli said, “Over 733,000 ballots are unaccounted for” in Arizona.",
    "Dommeyer tweeted, “Things are getting very serious in Wisconsin right now to decertify the 2020 election.",
    "Kari Lake posted on Twitter, “Decertify Wisconsin now."
  ]
}