{
  "id": 9638,
  "mediaId": 2520,
  "date": "2022-03-20",
  "headline": "Kari Lake goes on the attack and Karrin Taylor Robson must be ... pleased",
  "image": "https://www.gannett-cdn.com/presto/2022/01/16/PPHX/a2a47d3f-a904-4103-a103-f97ed47c320f-TrumpRally_01152022_AT_029.JPG?crop=2499,1406,x0,y126&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/03/20/kari-lakes-attack-karrin-taylor-robson-shows-shes-worried/7114206001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    5884,
    2706,
    4887,
    3704,
    3401,
    3471,
    2765,
    5949,
    6678
  ],
  "sentences": [
    "Sorry, Karrin!”\nThat comment came after Trump’s latest complaint about Attorney General Mark Brnovich – “When is the Attorney General of Arizona going to rule on all of the Election Fraud and large-scale Election Irregularities that wait before him?” – and his lauding of Lake for making the “Fraudulent 2020 election” the centerpiece of her campaign.",
    "But in the course of human history what we have in America is something special, something that we don’t always fully appreciate and so that one has been an inspiration to me as well.”\nAny self respecting journalist – something Lake claims to have been for decades – would have known that to use only a portion of that quote would be dishonest.",
    "“This is both the issue of the day and the Crime of the Century.”\nThese tirades say a lot about ... Lake\nActually, the only poll I’ve seen in which Lake leads by much of anything that approaches “massive” is Data Orbital, which is run by the son of Lake’s campaign treasurer.",
    "We’ve got a history that none of us are, you know, all that proud of.”\nI’ll stop here for the Lake Nation to revive from its collective full-on faint at the notion that there might, might, be something in our country’s history that was not so Yankee Doodle Dandy.",
    "Ed Robson, a 1954 graduate of the school and a then-member of the college’s hockey team, donated $12 million toward its construction, allowing the hockey team a place to play its games on campus this year for the first time in the history of the program.",
    "Robson even once pronounced herself “proud” of having supported the 2020 election of state Sen. Wendy Rogers, whose antisemitic comments and cozy relationship with white nationalists have made her a national rock star on the far right.",
    "“This is the greatest country on Earth.”\nTaylor Robson is hardly a gold digger\nWhen ABC 15’s Garrett Archer suggested on Friday that Robson must be gaining on Lake in the polls to prompt such an attack, Lake’s reply was classic Trump.",
    "Robson wants to surge troops to the border, use state laws to arrest immigrants as trespassers, finish the wall and revoke state funding from sanctuary cities – never mind that sanctuary cities can’t legally exist in Arizona.",
    "I’m guessing Robson must be gaining ground on Lake who, after a fast start that allowed her to race to the head of the pack last summer, has been unable to gain much distance in the Republican campaign for Arizona governor.",
    "And you’re sounding desperate.”\nYet, even after Robson offered up the full one-minute-and-13-second quote that provided the context of her remark about our nation's history, Lake again tweeted out the six-second hit clip.",
    "Our Girls deserve better.”\nAnd again …\n“Arizona doesn’t need a Governor who will pander to this insanity.”\nEd Robson Arena is the new sports arena at Colorado College, a private liberal arts college in Colorado Springs.",
    "Since late last week, Lake has been lunging into Robson, clearly hoping to cut her off at the pass with a rather astonishing demonstration of her intellect, political skill and general all-around classiness.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "“Hey, @Karrin4Arizona – why does your stadium (Robson Arena in Colorado) allow Men into the Ladies Room?” she tweeted, along with a picture of a sign that said “Female-Indentifying Restroom”.",
    "Kari Lake mounts a Trump-like attack\nLike this Thursday tweet, in which Lake channeled her inner Donald Trump and announced to the world that Karrin Taylor Robson pretty much hates America.",
    "She comes from a longtime Arizona family of conservative Republicans and has served on the Board of Regents and a variety of other economic and philanthropic organizations.",
    "She’s a businesswoman who has been a Republican precinct committeeman for nearly three decades, one who raised more than $1 million for Donald Trump’s re-election campaign.",
    "“A) Socialist NY Rep @AOC\n“B) My Democrat Opponent @katiehobbs\n“C) My Primary “Republican” Opponent @Karrin4Arizona\n“If you picked one of the Democrats, you’d be wrong.",
    "The fact that she has the money to introduce herself apparently has torqued off Lake, whose campaign is fueled more by anger than a healthy campaign treasury.",
    "Sad!”\nAttached to the tweet was six seconds of an interview in which Robson did, indeed, say those words: “Even though we have lots of challenges.",
    "What Karrin Taylor Robson actually said\nRobson, during the interview, was talking about books and mentioned “If You Can Keep It,” by Eric Metaxas.",
    "If he did, I’m not sure what that says about his wife or about her ability to lead the state of Arizona for the next four or eight years.",
    "Then I’ll offer the full quote of what it is that Robson actually said before Lake twisted it into something ugly and wildly inaccurate.",
    "I just think it’s disgusting that an open-borders, Ducey-clone RINO is trying to buy the election with her 95-yr-old husband’s millions.",
    "Robson even took to Twitter to call out Lake for questioning her patriotism, adding “I love this country and everything it stands for.",
    "Their border security plans are similar\nLake says Robson supports “open borders” yet their border security plans are pretty similar.",
    "Opinion: Kari Lake goes on a weekend tirade against Karrin Taylor Robson, stooping low in her bid to become Arizona's next governor.",
    "But unlike a certain ex-news anchor who came into the race a household name, Robson is not well known across the state.",
    "And the people of Arizona deserve to know about it.”\nSo now, Robson’s not just anti-American but a gold digger, too?",
    "It’s true that Robson, a 50-something candidate, married a rich older man, developer Ed Robson, who is now 91.",
    "“GUESS WHO SAID IT: ‘We [America] have a history that none of us are all that proud of,’ ” Lake tweeted.",
    "New poll numbers by other, more independent pollsters should be out any time now.",
    "“She is leading by massive numbers over her weak RINO competitors,” Trump said.",
    "I’m not sure if Ed Robson had any say in the signage for the arena’s bathrooms.",
    "“It doesn’t matter how much of her husband’s money she spends,” Lake tweeted.",
    "But it, and her entire weekend tirade, sure tells me a lot about Kari Lake.",
    "Which is probably why Friday found Lake coming after Robson yet again.",
    "If you’re Karrin Taylor Robson, you should probably be walking on air.",
    "We’ve got a history that none of us are, you know, all that proud of.",
    "“Arizona does not want another Open-Borders, Globalist RINO.",
    "Which is possibly why Lake was at it yet again on Saturday.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "Kari Lake went on a rather remarkable tear this weekend.",
    "If you’re Matt Salmon, you should probably be depressed.",
    "“It’s about the beauty of this country,” she said.",
    "“I am proud to be an American,” Lake said.",
    "“Even though we have lots of challenges.",
    "And a dreaded Republican In Name Only?",
    "I hope you and Ed will get this fixed.",
    "“Why play into the Left’s delusions?",
    "But she’s hardly a bimbo or a RINO.",
    "“Nah."
  ]
}