{
  "id": 10211,
  "mediaId": 8251,
  "date": "2022-03-30",
  "headline": "Arizona firma proyecto de ley restringiendo a atletas transexuales y cirugías",
  "image": "https://media.12news.com/assets/KPNX/images/f286cb48-b8a3-4be1-b112-20335aeef955/f286cb48-b8a3-4be1-b112-20335aeef955_1140x641.jpg",
  "link": "https://www.12news.com/article/syndication/spanish/arizona-firma-proyecto-de-ley-restringiendo-a-atletas-transexuales-y-cirugias/75-5c6de8f6-5a9d-45db-8c6c-ba7a2c0f9656",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Esta legislatura es sentido común y tiene como objetivo directo abordar esos dos problemas específicamente, mientras que asegura que los individuos transgénero reciben la misma dignidad, respeto y amabilidad que cualquier otro individuo en nuestra sociedad”, dijo Ducey en una declaración.",
    "Eso debe incluir a estudiantes de la comunidad LGBTQ que son quienes sabemos los que sufren el impacto de estas leyes que mandan el mensaje que ese grupo de estudiantes, ya vulnerable, no es bien recibido en nuestras comunidades”, agregó Terán.",
    "1165 requiere que todas las escuelas de Arizona, y cualquier escuela privada que compita en su contra, a que claramente designen los equipos de deportes interescolares basados en el sexo biológico de los estudiantes que participan.",
    "Doug Ducey y los republicanos en la legislatura están intentando decir que están protegiendo a los niños, mientras que al mismo ritmo de la pluma están activamente lastimando a los niños más vulnerables de Arizona”.",
    "PHOENIX — El gobernador Doug Ducey firmó una legislatura prohibiendo jóvenes transgénero que se sometan a cirugías de cambio de sexo y jovencitas transgénero que compitan en actividades atléticas en las escuelas.",
    "“Esta propuesta para mi es sobre biología”, dijo la representante republicana Shawnna Bolick, quien participo en un equipo mixto en 1980, pero no pudo integrarse al equipo de hombres de la preparatoria.",
    "Algunos críticos de la propuesta de ley cuestionan si el proyecto de ley realmente resuelve el problema debido a que pocos atletas transgénero participan en los deportes en las escuelas de Arizona.",
    "La presidenta de ADP, Raquel Terán publicó un comunicado:\n“Estos ataques inconstitucionales sobre el aborto y ataques inhumanos a nuestros niños transgénero no es lo que Arizona quiere.",
    "El Partido Demócrata de Arizona dijo que los demócratas están en total oposición mientras que los republicanos en la legislatura todos botaron a favor de pasar la ley.",
    "Y más importante, los votantes de Arizona recordarán este día en noviembre, y recordarán quien luchó por su libertad y quien trabajó para quitársela”.",
    "Pero el gobernador dijo que nuevas leyes son necesarias para mantener imparcialidad y proteger a los niños de someterse a una operación irreversible.",
    "“Los demócratas tienen una visión de un Arizona con un sistema de educación publica fuerte, uno que funciona para todos los estudiantes de Arizona.",
    "Desde el 2016, alrededor de 16 atletas transgénero han recibido una excepción para participar en equipos que se alinean con su identidad de género.",
    "“En mi opinión, no es justo que permitan que quienes biológicamente son varones competan en los deportes con quienes biológicamente son hembras”.",
    "\"Mientras que los políticos republicanos, como Ducey continúan impulsando su agenda anti-elección y agenda transfóbica con los arizonenses.",
    "Una de las propuestas de ley que firmó el gobernador Doug Ducey prohíbe las cirugías de reasignación sexual a jóvenes de Arizona.",
    "Los demócratas previamente habían denunciado la legislación, llamándola deshumana hacia los jóvenes transgénero e innecesaria.",
    "Los demócratas continuarán defendiendo las leyes constitucionales de todos los arizonenses.",
    "Son 16 atletas de los 170,000 en el estado, según la Asociación Interescolar de Arizona.",
    "1138 retrasa una operación de cambio de sexo que es irreversible hasta la edad de 18.",
    "La propuesta del Senado S.B.",
    "La propuesta de ley S.B."
  ]
}