{
  "id": 8938,
  "mediaId": 2822,
  "date": "2022-03-24",
  "headline": "Arizona GOP votes to restrict transgender sports, surgeries",
  "image": "",
  "link": "https://tucson.com/ap/sports/arizona-gop-votes-to-restrict-transgender-sports-surgeries/article_ea19811e-759b-526f-88e9-9919da8b3890.html",
  "mediaOutlet": "tucson.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JONATHAN J. COOPER - Associated Press",
  "authorUrl": "",
  "termIds": [
    2915,
    2099,
    1901,
    1698,
    1126,
    99,
    5949,
    6241,
    6515
  ],
  "sentences": [
    "PHOENIX (AP) — The Arizona Legislature passed bills Thursday to prohibit gender reassignment surgery for minors and ban transgender athletes from playing on girls sports teams, joining a growing list of Republican-controlled states attempting to restrict transgender rights as they gain more visibility in culture and society.",
    "Since 2017, about 16 trans athletes have received waivers to play on teams that align with their gender identities out of about 170,000 school-based athletes in the state, according to the Arizona Interscholastic Association.",
    "“In my opinion, its unfair to allow biological males to compete with biological girls sports.”\nCritics said the legislation dehumanizes trans youth to address an issue that hasn’t been a problem.",
    "“This bill is creating a pointless and harmful solution to a non-existent issue,” Skyler Morrison, a 13-year-old transgender girl, told lawmakers during a committee hearing earlier this month.",
    "“It’s obvious this bill is just an excuse to discriminate against transgender girls.”\nRepublicans around the country have leaned into culture war issues including transgender rights.",
    "“This bill to me is all about biology,” said Republican Rep. Shawnna Bolick, who said she played on a coed team in the 1980s but could not have made the high school boys team.",
    "Republicans have said blocking transgender players from girls sports teams would protect the integrity of women’s sports, fearing that trans athletes would have an advantage.",
    "The bill originally would have banned all such care for minors but was scaled back to restrict only irreversible procedures, such as surgeries related to gender reassignment.",
    "Similar legislation passed the Idaho House earlier this month but died in the Senate, where some Republicans said they were concerned about restricting parental rights.",
    "“We’re talking about our kids, who are already going to be taking the proper steps with their parents to be able to be who they are,” said Democratic Rep. Andres Cano.",
    "Many point to the transgender collegiate swimmer Lia Thomas, who won an individual title at the NCAA Women’s Division I Swimming and Diving Championship last week.",
    "Similar legislation passed the Idaho House earlier this month but it died in the Senate amid concerns from some Republicans about restricting parental rights.",
    "The debate and vote on the transgender sports legislation came the same morning the House considered and passed a ban on abortions after 15-week gestation.",
    "But the issue has become front-and-center in Republican-led statehouses since Idaho lawmakers passed the nation’s first sports participation law in 2020.",
    "Two GOP governors this week bucked conservatives in their party and vetoed bills in Indiana and Utah requiring trans girls to play on boys sports teams.",
    "The bill originally would have banned all gender-affirming care, including hormone therapies and puberty blockers but was scaled back in the Senate.",
    "“We’re talking about legislating bullying against children who are already struggling just to get by,” said Democratic Rep. Kelli Butler.",
    "Supporters of the Arizona bill said it would prevent children from making permanent decisions that they might later come to regret.",
    "Republican Rep. John Kavanagh compared the vote to the Legislature’s unanimous decision in years past to ban genital mutilation.",
    "It is horrific.”\nCritics said the decision should be left to parents, their children and the health care team caring for them.",
    "Arizona is one of 20 states that have considered legislation to restrict gender-affirming health care.",
    "This material may not be published, broadcast, rewritten or redistributed without permission.",
    "“We should stand the same way today because this is mutilation of children,” Kavanagh said.",
    "Until two years ago, no state had passed a law regulating gender-designated youth sports.",
    "They said surgeries are only performed after extensive care and therapy.",
    "It’s now blocked in court, along with another in West Virginia.",
    "Republicans said little during debates on all three bills.",
    "Doug Ducey has not said whether he will sign either bill.",
    "But there are few trans athletes in Arizona schools.",
    "Copyright 2022 The Associated Press.",
    "All rights reserved.",
    "“It is irreversible.",
    "fighting back tears.",
    "Republican Gov."
  ]
}