{
  "id": 9731,
  "mediaId": 6428,
  "date": "2022-03-24",
  "headline": "'All About Biology': AZ Legislature Votes to Protect Girls' Sports and Block Sex-Change Surgeries on Kids",
  "image": "https://www1.cbn.com/sites/default/files/media/slider/images/transgendersportsterrymiller_hdv_0.jpg",
  "link": "https://www1.cbn.com/cbnnews/us/2022/march/all-about-biology-az-legislature-votes-to-restrict-transgender-sports-and-sex-change-surgeries-on-children",
  "mediaOutlet": "CBN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Benjamin Gill",
  "authorUrl": "https://www1.cbn.com/profiles/gill-benjamin",
  "termIds": [
    1698,
    4905,
    2915,
    1126,
    5949,
    6241,
    6684
  ],
  "sentences": [
    "“In my opinion, it's unfair to allow biological males to compete with biological girls' sports.”\nOn the other side, Democratic Rep. Kelli Butler said, “We’re talking about legislating bullying against children who are already struggling just to get by.”\nMultiple states have stepped up to defend the rights of female athletes in recent years since Idaho lawmakers passed the nation’s first sports participation law in 2020.",
    "More recently the dominance of transgender collegiate swimmer Lia Thomas has escalated the debate once again in states across the U.S.\nThomas, who had failed to win while competing as a male collegiate swimmer, changed to a female presentation and was then allowed to join the women's swimming team at the University of Pennsylvania.",
    "The debate about transgender athletes has been raging for years, with little girls taking a stand in court for their rights after being forced to race against track athletes who were born male.",
    "It is horrific.”\nArizona's bill does not ban hormone therapies and puberty blockers, just surgeries on children who might come to regret the irreversible decision once they've reached maturity.",
    "The Arizona legislature voted on Thursday to prohibit sex-change surgeries on children and to ban transgender athletes who were born male from playing on girls' sports teams.",
    "Earlier this week, GOP governors in Indiana and Utah vetoed similar bills that were intended to protect the rights of women and girls who are athletes.",
    "No Irreversible Sex-Change Surgeries for Kids\nArizona is one of 20 states that have considered legislation to restrict gender-altering health care.",
    "Thomas went on to dominate women's swimming, recently winning an individual title at the NCAA Women’s Division I Swimming Championship last week.",
    "Then, President Biden signed a controversial executive order which critics said \"erased\" the rights of girls in favor of transgender rights.",
    "“This bill to me is all about biology,” said Republican Rep. Shawnna Bolick.",
    "The state's new bill would restrict sex-change surgeries on children.",
    "Republican Rep. John Kavanagh said, \"This is mutilation of children.",
    "Doug Ducey has not said if he will sign either of the bills.",
    "Courts have blocked Idaho's law and others.",
    "It is irreversible.",
    "Republican Gov."
  ]
}