{
  "id": 478,
  "mediaId": 6526,
  "date": "2022-04-20",
  "headline": "Lisa Scheller raises 10 times more than Kevin Dellicker in Republican primary for 7th District, but both lag far behind Susan Wild in fundraising",
  "image": "https://www.mcall.com/resizer/vtEVfGQx1Ww4KXpQ9TTtIQr4zdE=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/XQAKW2JBPBCFHNOBBX3YFMFKMA.png",
  "link": "https://www.mcall.com/news/elections/mc-nws-election-congress-campaign-finance-wild-scheller-dellicker-20220420-tkjuavdeivd7ndvytrcft7pvqy-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lindsay Weber",
  "authorUrl": "https://www.mcall.com/lindsay-weber-staff.html#nt=byline",
  "termIds": [
    1764,
    2201,
    3595,
    3797,
    297,
    305,
    878,
    1163,
    5239
  ],
  "sentences": [
    "As a result of the constitutionally mandated redistricting process, Pennsylvania’s 7th District shifted to include all of conservative Carbon County and no longer includes most of Monroe County except for parts of Eldred, Polk and Ross townships.",
    "She’s received $134,000 in PAC contributions, including $10,000 last year from the Value in Electing Women PAC, which aims to elect Republican women, and $10,000 from both the Majority Committee PAC and the Eye of the Tiger PAC this year.",
    "In January, Bill Bachenberg was among 14 people subpoenaed by the House Jan. 6 committee who, according to the committee, falsely claimed to be electors for former President Donald Trump in the 2020 election.",
    "Lehigh Valley Sporting Clays has hosted several rallies in support of Republican candidates for office and has been visited by national conservative figures like Donald Trump Jr. and Texas Sen. Ted Cruz.",
    "The biggest committee donors to Wild’s campaign this year include the Democratic Congressional Campaign Committee with $25,900 and the New Democrat Coalition Action Fund, which donated $12,200 this year.",
    "Prominent Lehigh Valley conservatives Bill and Laura Bachenberg, who own Lehigh Valley Sporting Clays in Coplay, donated $3,000 and $2,900, respectively, to Dellicker’s campaign last year.",
    "Kevin Dellicker, a veteran and owner of business services company Dellicker Strategies, raised $32,450 in the first quarter of 2022 and had $109,000 in his most recent finance report.",
    "A Republican candidate for Pennsylvania’s 7th District raised more than 10 times her GOP opponent, but both hopefuls trail Democratic Congresswoman Susan Wild in fundraising numbers.",
    "Lisa Scheller, chairperson and CEO of Silberline Manufacturing, had over $1.2 million on hand at the end of March and raised $352939.55 in the first three months of 2022.",
    "He received one $5,000 donation last year from the Supporting Electing American Leaders PAC, which donates to veteran Republican candidates.",
    "She’s also received donations from House politicians, including $4,000 from House Minority Whip Steve Scalise, a Republican from Louisiana.",
    "Of the 409 individual contributions Scheller has received for her campaign so far this year, 203 were from donors outside of Pennsylvania.",
    "Scheller secured the Republican nomination for Congress in 2020 but lost to Wild in the November election that year.",
    "The media could not be loaded, either because the server or network failed or because the format is not supported.",
    "Nearly $400,000 in Scheller’s campaign contributions came through WinRed, a Republican online fundraising service.",
    "She received 2,946 individual contributions this year, of which 1,894 came from addresses outside of Pennsylvania.",
    "Wild had $2.35 million in the bank, of which nearly $888,000 came in during the first three months of the year.",
    "Scheller has spent $707,00 throughout the course of her campaign and $175,000 since the beginning of the year.",
    "Election forecasts on Cook Political Report and 270toWin rate the race a toss-up, with Wild slightly favored.",
    "She received 110 donations from political committees, of which 95 came from committees based out of state.",
    "Of the committee contributions Scheller received this year, 31 of 37 are based outside of Pennsylvania.",
    "Pennsylvania’s 7th Congressional District is considered competitive in the 2022 election.",
    "Dellicker has not received donations from any PACs or the Republican Party this year.",
    "Wild is running unopposed in the Democratic primary.",
    "This is a modal window."
  ]
}