[
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Two Washington State House Republicans who voted to impeach Trump, Rep. Dan Newhouse and Rep. <span class='selected-term'>Jaime Herrera Beutler</span>, who has a Trump-endorsed primary challenger, are also seeking reelection on August 2.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP",
    "sentiment": "0"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Jaime Herrera Beutler</span>\nThe six-term Washington state lawmaker faces several primary challengers, including the Trump-backed Joe Kent.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically",
    "sentiment": "0"
  },
  {
    "id": 2247,
    "mediaId": 195,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Republican women's group Maggie's List has thrown its support behind Rep. <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.) as part of its latest round of endorsements first obtained by The Hill on Wednesday.",
    "author": "Julia Manchester",
    "title": "GOP women's group endorses Herrera Beutler in primary race",
    "sentiment": "0.154"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "Against Rep. <span class='selected-term'>Jaime Herrera Beutler</span>, he's backed Army veteran Joe Kent.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries",
    "sentiment": "0"
  },
  {
    "id": 1,
    "mediaId": 151,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Throughout the summer, Reps. Peter Meijer (R-Mich.), Dan Newhouse (R-Wash.) and <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.)  all of whom voted to impeach Trump  will face more conservative opponents backed by the former president.",
    "author": "",
    "title": "Are you going to cave? GOP primaries pit fighters against governing wing",
    "sentiment": "0"
  },
  {
    "id": 1715,
    "mediaId": 98,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "We need to move on to solving problems for citizens,? said Rep. <span class='selected-term'>Jaime Herrera Beutler</span>, the Republican facing a primary challenge from Kent.",
    "author": "DAVID KLEPPER and JEFF AMY",
    "title": "GOP works to get out the vote after calling elections rigged",
    "sentiment": "0"
  },
  {
    "id": 1725,
    "mediaId": 1576,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "We need to move on to solving problems for citizens,? said Rep. <span class='selected-term'>Jaime Herrera Beutler</span>, the Republican from southwest Washington state facing a primary challenge this year from Kent.",
    "author": "",
    "title": "GOP works to get out the vote after calling elections rigged",
    "sentiment": "-0.317"
  }
]