[
  {
    "id": 84,
    "mediaId": 43,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "So far, Trump has endorsed primary opponents for at least five of them, including Gonzalez (who's retiring), Reps. Liz Cheney of Wyoming, <span class='selected-term'>Jaime Herrera Beutler</span> of Washington, and Peter Meijer and Fred Upton of Michigan, who serve neighboring districts on the west side of the state.",
    "author": "",
    "title": "Ten House Republicans voted to impeach Trump. Some then fell silent while others spoke up"
  },
  {
    "id": 85,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Representatives <span class='selected-term'>Jaime Herrera Beutler</span> of Washington, Peter Meijer of Michigan and Fred Upton of Michigan have Trump-endorsed primary challengers on their heels and uncertain political futures.",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Jaime Herrera Beutler</span>\nThe six-term Washington state lawmaker faces several primary challengers, including the Trump-backed Joe Kent.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 68,
    "mediaId": 163,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Scalise gave money in September to at least three House members who voted to impeach Trump: Peter Meijer of Michigan and <span class='selected-term'>Jaime Herrera Beutler</span> of Washington state - who are both facing Trump-endorsed challengers - as well as David Valadao of California.",
    "author": "Alexandra Ulmer",
    "title": "Republican U.S. lawmakers funnel money to colleagues who crossed Trump"
  },
  {
    "id": 64,
    "mediaId": 124,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "And in Washington state, Rep. <span class='selected-term'>Jaime Herrera Beutler</span> out-raised her Trump-backed opponent, Joe Kent, bringing in about $422,000 compared to his roughly $297,000 during that same period.",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul"
  },
  {
    "id": 690,
    "mediaId": 129,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Joe Kent, a Trump-backed Army Special Forces veteran prolific on social media and conservative talk shows, appeared to come closer to matching the fund-raising totals of his opponent, Representative <span class='selected-term'>Jaime Herrera Beutler</span> of Washington, but still trailed her in both quarterly hauls and cash on hand.",
    "author": "",
    "title": "Republicans Who Voted to Impeach Trump Out-Raised Primary Rivals"
  },
  {
    "id": 2247,
    "mediaId": 195,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Republican women's group Maggie's List has thrown its support behind Rep. <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.) as part of its latest round of endorsements first obtained by The Hill on Wednesday.",
    "author": "Julia Manchester",
    "title": "GOP women's group endorses Herrera Beutler in primary race"
  },
  {
    "id": 61,
    "mediaId": 165,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "Joe Kent, the Army Special Forces veteran running to unseat Rep. <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.), also couldn't match the incumbent's haul, although the that the gap is narrower ($297,000 for Kent and $422,000 for Butler in the fourth quarter) than some of the other races, perhaps due to his frequent appearances throughout right-wing media, including Steve Bannon's podcast.",
    "author": "William Vaillancourt",
    "title": "Republicans Who Voted to Impeach Trump Are Fundraising Laps Around Their MAGA Primary Opponents"
  },
  {
    "id": 2243,
    "mediaId": 593,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "\"We need to have a full immigration moratorium,\" said Trump-endorsed Joe Kent, an Army veteran running in a Washington state primary against U.S. Representative <span class='selected-term'>Jaime Herrera Beutler</span>.",
    "author": "Ted Hesson and Alexandra Ulmer",
    "title": "U.S. Republicans Try To Out-Trump Each Other With Tough Border Rhetoric Ahead Of Election"
  },
  {
    "id": 57,
    "mediaId": 238,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.) has also drawn a Trump-backed challenger, political neophyte Joe Kent.",
    "author": "",
    "title": "Opinion: Republicans who voted to impeach Trump might be in less peril than people think"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "Against Rep. <span class='selected-term'>Jaime Herrera Beutler</span>, he's backed Army veteran Joe Kent.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "There was probably a time when it made sense to have someone like Kevin McCarthy, but we need new leadership in the House,? said Joe Kent, a square-jawed former Special Forces officer who is trying to unseat Representative <span class='selected-term'>Jaime Herrera Beutler</span> in Washington, one of 10 Republicans who voted to impeach Mr. Trump after the Capitol attack.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 38,
    "mediaId": 237,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "That's nothing new  same thing happened last time.?\nTrump has come out against GOP Reps. Nancy Mace and Tom Rice of South Carolina, <span class='selected-term'>Jaime Herrera Beutler</span> of Washington, and Peter Meijer of Michigan, among others.",
    "author": "Juliegrace Brufke",
    "title": "Kevin McCarthy not worried about Trump endorsements in GOP primaries"
  },
  {
    "id": 295,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "McCarthy noted he is backing the other incumbents such as Rep. <span class='selected-term'>Jaime Herrera Beutler</span>, who is facing a Trump-backed primary challenger in Washington state, and Rep. David Valadao, a fellow California Republican and close McCarthy ally.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Army veteran Joe Kent got the Trump nod in a primary against Rep. <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.).",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 2217,
    "mediaId": 376,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "Races rated Solid Democratic\n1st District (Suzan DelBene, D)\n2nd District (Rick Larsen, D)\n6th District (Derek Kilmer, D)\n7th District (Pramila Jayapal, D)\n9th District (Adam Smith, D)\n10th District (Marilyn Strickland, D)\nRaces rated Solid Republican\n3rd District (<span class='selected-term'>Jaime Herrera Beutler</span>, R)\n4th District (Dan Newhouse, R)\n5th District (Cathy McMorris Rodgers, R)\nNathan L. Gonzales is an elections analyst for CQ Roll Call.",
    "author": "",
    "title": "New lines, interesting races in Washington state"
  },
  {
    "id": 11,
    "mediaId": 376,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "In Washington state, Rep. <span class='selected-term'>Jaime Herrera Beutler</span> raised $605,000, while Trump-backed former Green Beret Joe Kent raised $457,000.",
    "author": "Herb Jackson",
    "title": "Trump targets outraise challengers, unlike some other incumbents"
  }
]