[
  {
    "id": 64,
    "mediaId": 124,
    "date": "2022-00-02",
    "sentence": "And in Washington state, Rep. <span class='selected-term'>Jaime Herrera Beutler</span> out-raised her Trump-backed opponent, Joe Kent, bringing in about $422,000 compared to his roughly $297,000 during that same period.",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul",
    "sentiment": "0"
  },
  {
    "id": 690,
    "mediaId": 129,
    "date": "2022-00-02",
    "sentence": "Joe Kent, a Trump-backed Army Special Forces veteran prolific on social media and conservative talk shows, appeared to come closer to matching the fund-raising totals of his opponent, Representative <span class='selected-term'>Jaime Herrera Beutler</span> of Washington, but still trailed her in both quarterly hauls and cash on hand.",
    "author": "",
    "title": "Republicans Who Voted to Impeach Trump Out-Raised Primary Rivals",
    "sentiment": "0.0"
  },
  {
    "id": 2247,
    "mediaId": 195,
    "date": "2022-00-02",
    "sentence": "Republican women's group Maggie's List has thrown its support behind Rep. <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.) as part of its latest round of endorsements first obtained by The Hill on Wednesday.",
    "author": "Julia Manchester",
    "title": "GOP women's group endorses Herrera Beutler in primary race",
    "sentiment": "0.154"
  },
  {
    "id": 61,
    "mediaId": 165,
    "date": "2022-00-03",
    "sentence": "Joe Kent, the Army Special Forces veteran running to unseat Rep. <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.), also couldn't match the incumbent's haul, although the that the gap is narrower ($297,000 for Kent and $422,000 for Butler in the fourth quarter) than some of the other races, perhaps due to his frequent appearances throughout right-wing media, including Steve Bannon's podcast.",
    "author": "William Vaillancourt",
    "title": "Republicans Who Voted to Impeach Trump Are Fundraising Laps Around Their MAGA Primary Opponents",
    "sentiment": "0.0"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "2022-00-05",
    "sentence": "Army veteran Joe Kent got the Trump nod in a primary against Rep. <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.).",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump",
    "sentiment": "0.0"
  },
  {
    "id": 25,
    "mediaId": 233,
    "date": "2022-00-05",
    "sentence": "Trump has also vowed revenge on the other GOP impeachment supporters: Rep. Tom Rice of South Carolina, <span class='selected-term'>Jaime Herrera Beutler</span> of Washington, Dan Newhouse of Washington, Peter Meijer of Michigan and David Valadao of California.",
    "author": "David Jackson",
    "title": "Rep. Fred Upton - another Donald Trump Republican impeacher - announces his retirement",
    "sentiment": "0.0"
  },
  {
    "id": 85,
    "mediaId": 129,
    "date": "2022-00-05",
    "sentence": "Representatives <span class='selected-term'>Jaime Herrera Beutler</span> of Washington, Peter Meijer of Michigan and Fred Upton of Michigan have Trump-endorsed primary challengers on their heels and uncertain political futures.",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6",
    "sentiment": "0"
  },
  {
    "id": 21,
    "mediaId": 120,
    "date": "2022-00-06",
    "sentence": "Recommended\nAs for the who's next? question, these are the other six members of the GOP's Impeachment 10 (in alphabetical order):\nWashington's <span class='selected-term'>Jaime Herrera Beutler</span> is running for re-election in a district in which her local Republican Party formally censured her for holding Trump accountable.",
    "author": "Steve Benen",
    "title": "What members of the House GOP's Impeachment 10 have in common",
    "sentiment": "-0.386"
  },
  {
    "id": 2217,
    "mediaId": 376,
    "date": "2022-00-12",
    "sentence": "Races rated Solid Democratic\n1st District (Suzan DelBene, D)\n2nd District (Rick Larsen, D)\n6th District (Derek Kilmer, D)\n7th District (Pramila Jayapal, D)\n9th District (Adam Smith, D)\n10th District (Marilyn Strickland, D)\nRaces rated Solid Republican\n3rd District (<span class='selected-term'>Jaime Herrera Beutler</span>, R)\n4th District (Dan Newhouse, R)\n5th District (Cathy McMorris Rodgers, R)\nNathan L. Gonzales is an elections analyst for CQ Roll Call.",
    "author": "",
    "title": "New lines, interesting races in Washington state",
    "sentiment": "0"
  },
  {
    "id": 76,
    "mediaId": 120,
    "date": "2022-00-17",
    "sentence": "As for the rest of the contingent  Washington's <span class='selected-term'>Jaime Herrera Beutler</span>, Wyoming's Liz Cheney, Michigan's Peter Meijer, Washington's Dan Newhouse, South Carolina's Tom Rice, and California's David Valadao  each appear to be running for re-election this year.",
    "author": "Steve Benen",
    "title": "Another GOP member of the Impeachment 10 heads for the exits",
    "sentiment": "0.0"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "2022-00-18",
    "sentence": "Rep. <span class='selected-term'>Jaime Herrera Beutler</span>\nThe six-term Washington state lawmaker faces several primary challengers, including the Trump-backed Joe Kent.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically",
    "sentiment": "0.0"
  }
]