[
  {
    "id": 2,
    "mediaId": 163,
    "date": "2022-00-01",
    "sentence": "* Versus U.S. Representative <span class='selected-term'>Jaime Herrera Beutler</span>\n* Aug 2 Republican primary for Washington's 3rd congressional district\nFormer special forces officer Joe Kent has campaigned with far right U.S. representative Matt Gaetz of Florida and told Oregon Public Broadcasting he held a social media strategy call with white nationalist Nicholas Fuentes, though he said he disagreed with Fuentes' \"ethno-nationalism.\"",
    "author": "Reuters",
    "title": "Factbox: Trump's endorsement power faces test in key elections",
    "sentiment": "0.0"
  },
  {
    "id": 1777,
    "mediaId": 129,
    "date": "2022-00-04",
    "sentence": "But with his eye on supporting candidates Trump has attacked, Hogan has headlined  or will headline  fund-raisers for lawmakers like Senator Lisa Murkowski, Republican of Alaska, who voted to convict Trump on an impeachment charge; Representative <span class='selected-term'>Jaime Herrera Beutler</span>, Republican of Washington, who voted to impeach Trump; and Kemp, whom Trump has slammed as very weak.?\nHogan's advocacy organization has begun running ads for Representative David Valadao, Republican of California, who also voted to impeach Trump after Jan. 6.",
    "author": "",
    "title": "The Maryland governor, a rare Republican who speaks out publicly against Donald Trump, is trying to defend G.O.P. lawmakers targeted by the former president.",
    "sentiment": "0.0"
  },
  {
    "id": 1715,
    "mediaId": 98,
    "date": "2022-00-06",
    "sentence": "We need to move on to solving problems for citizens,? said Rep. <span class='selected-term'>Jaime Herrera Beutler</span>, the Republican facing a primary challenge from Kent.",
    "author": "DAVID KLEPPER and JEFF AMY",
    "title": "GOP works to get out the vote after calling elections rigged",
    "sentiment": "0"
  },
  {
    "id": 1725,
    "mediaId": 1576,
    "date": "2022-00-06",
    "sentence": "We need to move on to solving problems for citizens,? said Rep. <span class='selected-term'>Jaime Herrera Beutler</span>, the Republican from southwest Washington state facing a primary challenge this year from Kent.",
    "author": "",
    "title": "GOP works to get out the vote after calling elections rigged",
    "sentiment": "-0.317"
  },
  {
    "id": 3301,
    "mediaId": 238,
    "date": "2022-00-13",
    "sentence": "A former Army Special Forces officer, Kent is running to replace Rep. <span class='selected-term'>Jaime Herrera Beutler</span> (Wash.), one of 10 Republicans who voted to impeach Trump in the House.",
    "author": "Josh Dawsey",
    "title": "More Republicans are working to undermine Trump endorsements",
    "sentiment": "-0.798"
  },
  {
    "id": 295,
    "mediaId": 33,
    "date": "2022-00-24",
    "sentence": "McCarthy noted he is backing the other incumbents such as Rep. <span class='selected-term'>Jaime Herrera Beutler</span>, who is facing a Trump-backed primary challenger in Washington state, and Rep. David Valadao, a fellow California Republican and close McCarthy ally.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'",
    "sentiment": "-0.542"
  }
]