[
  {
    "id": 2236,
    "mediaId": 151,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "Wins by some of the candidates challenging GOP members who voted to impeach Trump last year, like Reps. <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.) and Dan Newhouse (R-Wash.), could pad the numbers even more.",
    "author": "",
    "title": "The primary foreshadowing the future of the GOP"
  },
  {
    "id": 186,
    "mediaId": 129,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "He's not a real big digital guy, so we had printouts,? said Joe Kent, who has since won Mr. Trump's backing for his effort to unseat Representative <span class='selected-term'>Jaime Herrera Beutler</span> of Washington, one of the 10 Republican impeachment votes.",
    "author": "",
    "title": "Mar-a-Lago Machine: Trump as a Modern-Day Party Boss"
  },
  {
    "id": 2214,
    "mediaId": 21,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Kent is running in a primary challenge against Republican Rep. <span class='selected-term'>Jaime Herrera Beutler</span> of Washington, who was one of 10 House Republicans to vote for Trump's second impeachment.",
    "author": "Jake Lahut",
    "title": "Republican candidates seeking Trump's endorsement need to show him 'printouts' with 'big' fonts: 'He's not a real big digital guy'"
  },
  {
    "id": 1,
    "mediaId": 151,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Throughout the summer, Reps. Peter Meijer (R-Mich.), Dan Newhouse (R-Wash.) and <span class='selected-term'>Jaime Herrera Beutler</span> (R-Wash.)  all of whom voted to impeach Trump  will face more conservative opponents backed by the former president.",
    "author": "",
    "title": "Are you going to cave? GOP primaries pit fighters against governing wing"
  },
  {
    "id": 3375,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "), Tom Rice (S.C.), Dan Newhouse (Wash.), <span class='selected-term'>Jaime Herrera Beutler</span> (Wash.), David G. Valadao (Calif.), and Peter Meijer (Mich.) are running for reelection and facing tough primary challenges.",
    "author": "",
    "title": "Senate primaries to watch"
  }
]