[
  {
    "id": 4533,
    "mediaId": 2746,
    "date": "2022-01-13",
    "sentence": "She is among 10 guest speakers — a roster that includes Arizona Republican Reps. Andy Biggs, Paul Gosar and <span class='selected-term'>Debbie Lesko</span> — along with Ms. Ward, Alveda King and Mike Lindell, CEO of My Pillow.",
    "author": "Jennifer Harper",
    "title": "Trump rally brings joy, high-profile guests to Arizona Republicans"
  },
  {
    "id": 3620,
    "mediaId": 2520,
    "date": "2022-01-21",
    "sentence": "And the Grand Canyon's State slate of Republican representatives — U.S. Reps. David Schweikert, <span class='selected-term'>Debbie Lesko</span>, Paul Gosar and Andy Biggs — chimed in a day later.",
    "author": "Stacey Barchenger",
    "title": "Gov. Ducey sues Biden administration over funding tied to COVID-19 mandates and Arizona schools"
  },
  {
    "id": 4239,
    "mediaId": 2522,
    "date": "2022-01-26",
    "sentence": "— Congresswoman <span class='selected-term'>Debbie Lesko</span> (@RepDLesko) January 25, 2022\nTexas Senator Ted Cruz wrote on Twitter, “The Biden-Harris Administration is rolling out the red carpet for illegal aliens.”\nThe Biden-Harris Administration is rolling out the red carpet for illegal aliens.",
    "author": "Chris Donaldson",
    "title": "Shocking video shows mostly adult male illegals released and then taken to TX airport"
  },
  {
    "id": 1859,
    "mediaId": 2520,
    "date": "2022-02-10",
    "sentence": "\"As federal regulators make major decisions about companies doing business here in the U.S., they should fully understand the national security implications.”\nThe Ministry of Foreign Affairs and of the People’s Republic of China held a news conference Monday during which spokesperson Zhao Lijan said that the China-related measures in the America COMPETES Act are “steeped in Cold War mentality.”\nRepublican Reps. Andy Biggs, Paul Gosar, <span class='selected-term'>Debbie Lesko</span> and Dave Schweikert of Arizona on Friday voted against the passage of the COMPETES Act while Stanton and fellow Democratic Reps. Tom O’Halleran, Ann Kirkpatrick, Raúl Grijalva and Ruben Gallego voted for it.",
    "author": "Cami Parrish",
    "title": "Stanton legislation aims to curb China influence on US markets"
  },
  {
    "id": 10985,
    "mediaId": 2520,
    "date": "2022-03-15",
    "sentence": "\"Congresswoman <span class='selected-term'>Debbie Lesko</span> is a Conservative Warrior for the people of Arizona,\" Trump said in a written statement from his Save America political action committee.",
    "author": "Ronald J. Hansen",
    "title": "Rep. Debbie Lesko gets Trump's endorsement in bid for another term"
  },
  {
    "id": 7375,
    "mediaId": 2520,
    "date": "2022-04-01",
    "sentence": "Here are the major candidates for the U.S. House of Representatives in Arizona's new 8th Congressional District:\nRepublicans:\n<span class='selected-term'>Debbie Lesko</span>\nDebbie Lesko became the 8th Congressional District's representative in 2018.",
    "author": "Melissa Estrada",
    "title": "Here are the candidates running in Arizona's new 8th Congressional District"
  },
  {
    "id": 5867,
    "mediaId": 2550,
    "date": "2022-04-20",
    "sentence": "There are right-wing politicians using extremist talking points to attack Democrats on immigration and the southern border, and then there’s <span class='selected-term'>Debbie Lesko</span>.",
    "author": "",
    "title": "There are lies about migrants and the border, and then there's Arizona Rep. Debbie Lesko"
  },
  {
    "id": 5743,
    "mediaId": 2738,
    "date": "2022-04-20",
    "sentence": "Well, both of them have been distracted with Boebert tweeting about masks and Ted fretting about Mickey and Pluto getting it on, so House Freedom Caucus member Rep. <span class='selected-term'>Debbie Lesko</span> (R-AZ) stepped in and fill the void.",
    "author": "Kimberly Ricci",
    "title": "Rep. Debbie Lesko Gave Lauren Boebert A Run For Her Mockery With A Claim About Migrants That’s Being Dragged Hard"
  },
  {
    "id": 5886,
    "mediaId": 2547,
    "date": "2022-04-20",
    "sentence": "And you wonder why Ron DeSantis, Greg Abbott, and others are so keen to burn math textbooks...\nArizona's Republican Congresswoman <span class='selected-term'>Debbie Lesko</span> said on Twitter that Border Patrol agents had arrested a billion people at the U.S.-Mexico border over the past six months—wrongly adding three zeros to the correct number of a million people.",
    "author": "Ed Scarce",
    "title": "AZ Rep Bashed On Twitter, Says A Billion Migrants Apprehended At Border"
  }
]