[
  {
    "id": 3883,
    "mediaId": 2822,
    "date": "2022-01-20",
    "sentence": "Rep. <span class='selected-term'>Reginald Bolding</span>, D-Laveen, said it isn't that simple.",
    "author": "Howard Fischer Capitol Media Services",
    "title": "House panel votes 6-4 to restrict racism lessons in Arizona schools"
  },
  {
    "id": 3825,
    "mediaId": 2605,
    "date": "2022-01-24",
    "sentence": "In Arizona, the leader of House Democrats, <span class='selected-term'>Reginald Bolding</span>, is one of several candidates running against Finchem for secretary of state in an open-seat contest.",
    "author": "",
    "title": "Column: If you think 2020 chaos was bad, imagine if Trump was put in charge of elections"
  },
  {
    "id": 3715,
    "mediaId": 2520,
    "date": "2022-01-27",
    "sentence": "The action came after Ethan Schmidt, founder of a group called the Antimaskers Club, confronted a masked House Minority Leader <span class='selected-term'>Reginald Bolding</span>, who is Black, and repeatedly asked why he was wearing a \"slave muzzle.\"",
    "author": "Mary Jo Pitzl",
    "title": "Anti-mask activist banned from Arizona Capitol after harassing Democratic leader with racial slur"
  },
  {
    "id": 3635,
    "mediaId": 8475,
    "date": "2022-01-27",
    "sentence": "House Minority Leader <span class='selected-term'>Reginald Bolding</span>, D-Phoenix, predicted that if his Republican colleagues got the power to reject election results, they’d do so based simply on which results they liked or didn’t like.",
    "author": "Jeremy Duda",
    "title": "Newest Arizona GOP election proposal would allow lawmakers to reject election results"
  },
  {
    "id": 3640,
    "mediaId": 8475,
    "date": "2022-01-27",
    "sentence": "“House Bill 2238, I think, is probably one of the most problematic pieces of legislation we've seen thus far,” state Representative <span class='selected-term'>Reginald Bolding</span>, D-Phoenix, said.",
    "author": "Michael McDaniel",
    "title": "Voting restrictions advance in Arizona statehouse"
  },
  {
    "id": 4153,
    "mediaId": 2664,
    "date": "2022-01-27",
    "sentence": "This blatant racism has no place in the people\\u2019s House.https://twitter.com/az_rww/status/1486469600267038720\\u00a0\\u2026\n— <span class='selected-term'>Reginald Bolding</span> (@Reginald Bolding) 1643239415\nA spokesperson for House Speaker Rusty Bowers confirmed that Schmitt is now barred from the premises: \"The abhorrent and reprehensible behavior demonstrated by this individual toward our members, staff, and the public will not be tolerated.\"",
    "author": "Matthew Chapman",
    "title": "Notorious Trump supporter banned from the Arizona House after he films himself harassing lawmakers"
  },
  {
    "id": 2765,
    "mediaId": 2664,
    "date": "2022-01-28",
    "sentence": "House Minority Leader <span class='selected-term'>Reginald Bolding</span>, D-Phoenix, predicted that if his Republican colleagues got the power to reject election results, they’d do so based simply on which results they liked or didn’t like.",
    "author": "Jeremy Duda",
    "title": "New 'terrifying' GOP proposal in Arizona would allow lawmakers to reject election results"
  },
  {
    "id": 3400,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "\"This bill is probably one of the biggest threats that we have seen here to our democracy,\" Arizona House Minority Leader <span class='selected-term'>Reginald Bolding</span>, a Democrat, said in an interview with Salon.",
    "author": "",
    "title": "Arizona bills embrace Trump conspiracy theories — could allow GOP to reject election results"
  },
  {
    "id": 2859,
    "mediaId": 2888,
    "date": "2022-01-31",
    "sentence": "“This bill is probably one of the biggest threats that we have seen here to our democracy,” Arizona House Minority Leader <span class='selected-term'>Reginald Bolding</span>, a Democrat, said in an interview with Salon.",
    "author": "Igor Derysh",
    "title": "AZ Republicans Introduce Bill Allowing Legislature to “Reject” Election Results"
  },
  {
    "id": 2740,
    "mediaId": 8475,
    "date": "2022-02-03",
    "sentence": "Gulotta and State Rep. <span class='selected-term'>Reginald Bolding</span> Jr., D-Laveen, agreed with Richer that election deniers spreading conspiracy theories and winning government offices are threatening election integrity and breaking their constituents’ trust in the election system.",
    "author": "Camila Pedrosa",
    "title": "Despite lingering claims, election officials hope to put 2020 in the past"
  },
  {
    "id": 1820,
    "mediaId": 2664,
    "date": "2022-02-04",
    "sentence": "Rep. <span class='selected-term'>Reginald Bolding</span>, the top Democrat in the House, praised the Republican speaker for halting the bill while slamming Fillmore for comparing it to a lynching.",
    "author": "Sky Palma",
    "title": "AZ Republican says death of his bill allowing lawmakers to reject election results was akin to 'lynching'"
  },
  {
    "id": 2436,
    "mediaId": 8345,
    "date": "2022-02-08",
    "sentence": "“That is critical, and it will also increase accountability across the state.”\nThe new bill comes after similar proposals from Democratic Minority Leader <span class='selected-term'>Reginald Bolding</span> failed to advance over several legislative sessions.",
    "author": "Associated Press",
    "title": "Arizona Legislature bill would mandate outside probes of police shootings"
  },
  {
    "id": 366,
    "mediaId": 2584,
    "date": "2022-02-21",
    "sentence": "“Someone who wants to dismantle, disrupt and completely destroy democracy is running to be our state’s top election officer,” said <span class='selected-term'>Reginald Bolding</span>, the Democratic minority leader in the Arizona House who is running against Finchem in the secretary of state race.",
    "author": "Ed Pilkington",
    "title": "‘This should terrify the nation’: the Trump ally seeking to run Arizona’s elections"
  },
  {
    "id": 125,
    "mediaId": 2664,
    "date": "2022-02-21",
    "sentence": "Should he prevail over his Democratic challenger, <span class='selected-term'>Reginald Bolding</span>, the minority leader in the Arizona State House of Representatives, Finchem would become the most powerful figure in Arizona’s elections.",
    "author": "Brandon Gage",
    "title": "Donald Trump loyalist running for Arizona secretary of state is a right-wing plot to end democracy"
  },
  {
    "id": 19,
    "mediaId": 2512,
    "date": "2022-02-21",
    "sentence": "Should he prevail over his Democratic challenger, <span class='selected-term'>Reginald Bolding</span>, the minority leader in the Arizona State House of Representatives, Finchem would become the most powerful figure in Arizona’s elections.",
    "author": "Brandon Gage",
    "title": "Donald Trump loyalist running for Arizona secretary of state is a right-wing plot to end democracy"
  },
  {
    "id": 689,
    "mediaId": 2748,
    "date": "2022-02-22",
    "sentence": "Arizona state Rep. <span class='selected-term'>Reginald Bolding</span>, the Democrat who is running against Finchem, said his opponent’s candidacy “should terrify not just Arizona, but the entire nation,” according to the U.K.’s Guardian.",
    "author": "STATION GOSSIP",
    "title": "AZ Rep Turns to Voters for Help as Pelosi's Goons Drag Him to DC for Interrogation Over Jan. 6"
  },
  {
    "id": 17356,
    "mediaId": 2520,
    "date": "2022-03-01",
    "sentence": "House Democrats also weighed in, with party leader <span class='selected-term'>Reginald Bolding</span>, D-Laveen, saying Rogers should resign.",
    "author": "Stacey Barchenger",
    "title": "Arizona Sen. Wendy Rogers censured by Senate after calling for public hangings, attacking Ukraine's president"
  },
  {
    "id": 15552,
    "mediaId": 8475,
    "date": "2022-03-08",
    "sentence": "Previously, House Minority Leader <span class='selected-term'>Reginald Bolding</span> brought up concerns with the bill during a hearing in a House Government and Elections Committee on Jan. 26.",
    "author": "Gloria Gomez",
    "title": "GOP bills to restrict some voter registrations clear Arizona Senate committee"
  },
  {
    "id": 15948,
    "mediaId": 8476,
    "date": "2022-03-09",
    "sentence": "Previously, House Minority Leader <span class='selected-term'>Reginald Bolding</span> brought up concerns with the bill during a hearing in a House Government and Elections Committee on Jan. 26.",
    "author": "Gloria Gomez",
    "title": "GOP Bills to Restrict Some Voter Registrations Clear Senate Committee"
  },
  {
    "id": 15545,
    "mediaId": 8475,
    "date": "2022-03-11",
    "sentence": "House Minority Leader <span class='selected-term'>Reginald Bolding</span>, D-Phoenix, called the lawsuit against Prop.",
    "author": "Jeremy Duda",
    "title": "State judge rules Arizona's voter-approved Invest in Education Act is unconstitutional"
  },
  {
    "id": 13454,
    "mediaId": 8475,
    "date": "2022-03-17",
    "sentence": "Rep. <span class='selected-term'>Reginald Bolding</span>, the House minority leader, said he believes that the entire purpose of the repeal plan is to avert the November vote.",
    "author": "Jeremy Duda",
    "title": "Special Arizona legislative session expected for plan to 'repeal-and-accelerate' tax cut package"
  },
  {
    "id": 10684,
    "mediaId": 6509,
    "date": "2022-04-01",
    "sentence": "The top Democrat in the state House, Rep. <span class='selected-term'>Reginald Bolding</span>, called Wednesday “probably one of the darkest days we've seen in the history of Arizona.\"",
    "author": "Bob Christie",
    "title": "Arizona Governor Won't Say Transgender People Exist When Talking New Law Limiting Their Rights"
  },
  {
    "id": 9838,
    "mediaId": 2523,
    "date": "2022-04-01",
    "sentence": "Meanwhile, the top Democrat in the state House, Rep. <span class='selected-term'>Reginald Bolding</span>, called Wednesday \"probably one of the darkest days we've seen in the history of Arizona.\"",
    "author": "",
    "title": "Arizona governor won't say transgender people exist"
  },
  {
    "id": 5642,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "House members not returning:\nJasmine Blackwater-Nygren, D-Teec Nos Pos\nWalter Blackman, R-Snowflake (running for Congress in Congressional District 2)\n<span class='selected-term'>Reginald Bolding</span>, D-Laveen (running for secretary of state)\nShawnna Bolick, R-Phoenix, (running for secretary of state)\nKelli Butler, D-Paradise Valley\nRegina Cobb, R-Kingman\nAndrea Dalessandro, D-Green Valley\nMark Finchem, R-Oro Valley (running for secretary of state)\nDaniel Hernandez, D-Tucson (running for Congress in Congressional District 6)\nJennifer Jermaine, D-Chandler (running for justice of the peace – San Marcos)\nRobert Meza, D-Phoenix (running for Justice of the Peace – West Mesa)\nPamela Powers Hannley, D-Tucson\nMichell Udall, R-Mesa (running for state superintendent of public instruction)\nJeff Weninger, R-Chandler (running for treasurer)\nSenate members not returning:\nSean Bowie, D-Phoenix\nPaul Boyer, R-Glendale\nKaren Fann, R-Prescott\nRick Gray, R-Sun City\nLisa Otondo, D-Yuma\nMartin Quezada, D-Glendale (running for treasurer)\nRebecca Rios, D-Phoenix (running for justice of the peace - South Mountain)\nVictoria Steele, D-Tucson\nFor the state's complete list of qualifying legislative candidates, go to https://apps.arizona.vote/electioninfo/elections/2022-primary-election/legislative/2520/32/0.",
    "author": "Ray Stern",
    "title": "2022 elections: Here's who is running in significant — and dramatic — races at the Arizona Legislature"
  },
  {
    "id": 6792,
    "mediaId": 8345,
    "date": "2022-04-12",
    "sentence": "Democratic Rep. <span class='selected-term'>Reginald Bolding</span>, the minority leader, said creating more “flexibility” for aspiring mid-career professionals to step into the classroom to address the teacher shortage won't help.",
    "author": "",
    "title": "Arizona Legislature moving to add new teacher certification paths"
  },
  {
    "id": 6876,
    "mediaId": 8350,
    "date": "2022-04-12",
    "sentence": "Democratic Rep. <span class='selected-term'>Reginald Bolding</span>, the minority leader, said creating more “flexibility” for aspiring mid-career professionals to step into the classroom to address the teacher shortage won’t help.",
    "author": "ASSOCIATED PRESS",
    "title": "Arizona Legislature considers adding new teacher certification paths"
  }
]