[
  {
    "id": 3883,
    "mediaId": 2822,
    "date": "2022-01-20",
    "sentence": "Rep. <span class='selected-term'>Reginald Bolding</span>, D-Laveen, said it isn't that simple.",
    "author": "Howard Fischer Capitol Media Services",
    "title": "House panel votes 6-4 to restrict racism lessons in Arizona schools"
  },
  {
    "id": 3400,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "\"This bill is probably one of the biggest threats that we have seen here to our democracy,\" Arizona House Minority Leader <span class='selected-term'>Reginald Bolding</span>, a Democrat, said in an interview with Salon.",
    "author": "",
    "title": "Arizona bills embrace Trump conspiracy theories — could allow GOP to reject election results"
  },
  {
    "id": 2740,
    "mediaId": 8475,
    "date": "2022-02-03",
    "sentence": "Gulotta and State Rep. <span class='selected-term'>Reginald Bolding</span> Jr., D-Laveen, agreed with Richer that election deniers spreading conspiracy theories and winning government offices are threatening election integrity and breaking their constituents’ trust in the election system.",
    "author": "Camila Pedrosa",
    "title": "Despite lingering claims, election officials hope to put 2020 in the past"
  },
  {
    "id": 2436,
    "mediaId": 8345,
    "date": "2022-02-08",
    "sentence": "“That is critical, and it will also increase accountability across the state.”\nThe new bill comes after similar proposals from Democratic Minority Leader <span class='selected-term'>Reginald Bolding</span> failed to advance over several legislative sessions.",
    "author": "Associated Press",
    "title": "Arizona Legislature bill would mandate outside probes of police shootings"
  },
  {
    "id": 366,
    "mediaId": 2584,
    "date": "2022-02-21",
    "sentence": "“Someone who wants to dismantle, disrupt and completely destroy democracy is running to be our state’s top election officer,” said <span class='selected-term'>Reginald Bolding</span>, the Democratic minority leader in the Arizona House who is running against Finchem in the secretary of state race.",
    "author": "Ed Pilkington",
    "title": "‘This should terrify the nation’: the Trump ally seeking to run Arizona’s elections"
  },
  {
    "id": 16997,
    "mediaId": 8345,
    "date": "2022-03-03",
    "sentence": "But because his district was given the number of a heavily Democratic one represented by Minority Leader <span class='selected-term'>Reginald Bolding</span> with far fewer GOP voters, he only needs to collect the 291 Republican signatures needed in that district, which is actually miles away.",
    "author": "",
    "title": "Arizona Legislature rushes to fix candidate signature glitch"
  },
  {
    "id": 6792,
    "mediaId": 8345,
    "date": "2022-04-12",
    "sentence": "Democratic Rep. <span class='selected-term'>Reginald Bolding</span>, the minority leader, said creating more “flexibility” for aspiring mid-career professionals to step into the classroom to address the teacher shortage won't help.",
    "author": "",
    "title": "Arizona Legislature moving to add new teacher certification paths"
  },
  {
    "id": 6876,
    "mediaId": 8350,
    "date": "2022-04-12",
    "sentence": "Democratic Rep. <span class='selected-term'>Reginald Bolding</span>, the minority leader, said creating more “flexibility” for aspiring mid-career professionals to step into the classroom to address the teacher shortage won’t help.",
    "author": "ASSOCIATED PRESS",
    "title": "Arizona Legislature considers adding new teacher certification paths"
  }
]