[
  {
    "id": 4492,
    "mediaId": 2590,
    "date": "2022-01-14",
    "sentence": "Gonzalez, who announced his decision in November, was facing a primary challenge from Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "Daniel Marans",
    "title": "Third Republican Who Voted To Impeach Trump Now Retiring"
  },
  {
    "id": 4091,
    "mediaId": 8496,
    "date": "2022-01-18",
    "sentence": "Sykes will likely face off against <span class='selected-term'>Max Miller</span>, who worked in the White House as an aide to former President Trump, for the right to represent the 13th Congressional District.",
    "author": "",
    "title": "Former Ohio House Democratic Leader Emilia Sykes announces run for Congress"
  },
  {
    "id": 4245,
    "mediaId": 8494,
    "date": "2022-01-19",
    "sentence": "The 35-year-old Akron Democrat’s announcement Tuesday sets up a likely faceoff in Ohio’s potentially newly competitive 13th Congressional District against former President Donald Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "Amanda Rabinowitz",
    "title": "Morning Headlines: Cleveland’s COVID testing site to close; Akron Rep. Emilia Sykes announces run for Congress"
  },
  {
    "id": 3563,
    "mediaId": 2658,
    "date": "2022-01-20",
    "sentence": "He made his first endorsement of a primary challenger to one of the 10 GOP House members who crossed him on impeachment — former and favored aide <span class='selected-term'>Max Miller</span> against incumbent Anthony Gonzalez (R-Ohio).",
    "author": "",
    "title": ""
  },
  {
    "id": 3240,
    "mediaId": 2551,
    "date": "2022-01-27",
    "sentence": "He wrote for everyone from Tommy Cooper to Kenny Everett, was a warm-up man on TV shows as far different as Morecambe & Wise and Monty Python, and shared a drink with stars from music hall legend <span class='selected-term'>Max Miller</span> to Edinburgh Fringe newcomers.",
    "author": "Christopher Stevens for the Daily Mail",
    "title": "The man who made Britain chuckle for six decades: As Barry Cryer, who wrote gags for all the comedy greats, dies at 86, CHRISTOPHER STEVENS looks back on a lifetime of laughs"
  },
  {
    "id": 2916,
    "mediaId": 8358,
    "date": "2022-01-29",
    "sentence": "All A Honor Roll\nSixth-graders: Owen Armstrong, Mallory Blackburn, Willow Derstine, Levin Essinger, Megan Follas, Camryn Fruchey, Chloe Hanefeld, Zaeda Hermiller, Klaira Hohenbrink, Micah Lemley, Alexis Mummert, Ezra Nygaard, Elizabeth Phillips, Isabella Recker, Lane Rossman, Ethan Smith, Joe Spencer\nSeventh-graders: Damien Criblez, Coby Dailey, Karden Geiser, Avery Hobensack, Daphne Johnston, Chase Kelly, Emmitt Kidd, Kate Klinger, Nora Matthews, Greta Myers, Owen Shoemaker, Gracie Warren\nEighth-graders: Madison Beasley, Ethan Blount, Lauren Bowers, Aubrey Burkholder, Keith Burkholder, Grace Conley, Grady Coonfare, Javen Crawfis, Karleigh Davis, Calvin Derstine, Maize Digby, Jenna Downey, Kynzie Ewing, Luke Ginther, Emily Granger, Elizabeth Hartzler, Allison Herrmann, Ethan Hoffman, Elizabeth Honse, Elijah Jones, Isaiah Kohli, Liliana Liberato, Nicholas Lovett, Alayna Mueller, Hudson Phillips, Macy Schaadt, Blaize Schwarz, Elizabeth Suter, Blair Utendorf\nFreshmen: Brody Anderson, Levi Antrim, Raelyn Clinger, Asa Clingerman, Kaleigh Coffman, Faith Combs, Hannah Creeger, Caleb Davis, Marek Donaldson, Quinn Eachus, Camron East, June Essinger, Rebecca Estell, Karlee Geesaman, Emma Green, Carter Hohenbrink, Grace Lemley, Ava McCamery, Gabriel Meza, Brooklyn Moser, Chayse Rodabuagh, Braylin Scherger, Jordan Schweingruber, Zoe Shank, Avery Smith, Logan Smith, Kara Snyder, Avery Talavinia, Mackay Tuttle, Gracie Yarnell\nSophomores: Theodore Andreas, Ella Armstrong, Jessica Boop, Brooke Camper, Milo Combs, Caitlyn Couch, Gideon Evans, Ashley Fleece, Daniel Fredritz, Morgan Fruchey, Jacob Granger, Benjamin Hartzler, Jasmine Hasting, Olivia Hobensack, Alyssa Hoffman, Adanna Johnstone, Liam Jordan, Marley Kindle, Leah Klinger, Alivia Lambert, Ethan Nickel, Macie Nieman, Amairi Painter, Ian Rieman, Isabella Stechschulte, Emma Stricklen, Tesa Stricklen, Kaelin Weissling, Bella Wingate, John-Paul Yoder\nJuniors: Landon Armstrong, Sabina Clingerman, Jaden Coonfare, Kameron Coughlan, Hannah Davis, Samuel Derstine, Allison Diller, Riley Eachus, Justin Good, Nolan Hoffman, Amy Jebsen, Aiden Koontz, Abbie Lemley, Olivia Matthews, Landon Novak, Erik Nygaard, Makayla Schweingruber, Samantha Scoles, Olivia Smallcombe, Carson Soper, Alyssa Speicher, Lauren Speicher, Brianna Taber, Elijah Wenger\nSeniors: Haelyn Bischoff, Nicole Boyle, Sophie Bricker, Caitlin Dailey, Roric Dunifon, Libby Frazier, Jessica Goodman, Lauren Gray, Trent Howard, Anna Knauss, Ellana Krupp, Kenneth Lovett, Ian Martz, Reagan Mittendorf, Kylie Monday, Ellie Nickel, Eli Okuley, Kiera Rieman, Nathan Schaadt, Skyler Scoles, Luke Shadle, Jude Spallinger, Kylie Stackhouse, Ava Whitaker, Addy Wright\nA/B Honor Roll\nSixth-graders: Adelyn Althaus, Landin Bible, Charlize Boblitt, Avery Boehm, Peighton Bowers, Owen Brauen, Payton Camper, Austin Conley, Jacob Dawson, Xandra Gatchel, Lane Ginther, Tala Gipson, Taylin Goldman, Lainey Grandey, Ronald Kauffman, Keyrsten Kleman, Hunter Kloeppel, Emmerson Lee, Kennedy Longworth, <span class='selected-term'>Max Miller</span>, Kelsey Mohr, Myah Montgomery, Alexander Nance, Serenity O’Connell, Noah Pratt, Natalie Richards, Ella Roby, Chesney Rodabaugh, Lyla Schneck, Brooks Schwarz, Braxton Smallwood, Adrean Sprunger, Jessa Swank, Ainsley Ulrey, Aiden Weaver, Adalee Weaver, Kaylynn Wheeler, Carli Wise, Jubilee Wolford, Peyton Worcester\nSeventh-graders: Willow Angel, Austin Blue, Ellie Bogart, Ariana Bowling, Charlotte Burkholder, Elijah Drewyore, Declan Dunifon, Ethan Fifer, Adam Fritsch, Katherine Gratz, Blayne Hill, Roselove Jebsen, Henry Jordan, Laney Kiene, Eli Lehman, Dylan Lewis, Karlie Lora, Parker Lovell, Benjamin Lovett, Evangeline McBrien, Braydon McClure, Brady Montgomery, Haelee Rayle, Rebekah Rehm, Addison Schweingruber, Kenedeye Scoles, Leah Shadle, Mason Shank, Nathan Speicher, Wilson Steiner, Tate Steinmetz, Aaron Ungashick\nEighth-graders: Brooklynn Bible, Claire Blackburn, Aubrey Clevidence, Oliver Combs, Vanessa Cross, Lillian Dagani, Lauren Dearth, Isabella Ellerbrock, Braylon Goings, Evan Grothause, Makenna Mohr, Jaicelyn Morris, Adrian Murray, Brooklyn Nance, Hannah Nieman, Elijah Nye, Madison Omlor, Claire Phillips, Micah Rehm, Aubrey Rieman, Joziah Salazar, Landon Sehlhorst, Ali Shilling, Ava Smallcombe, Kendall Stackhouse, Yasmin Teixeira, Avery Ulrey, Kaydrie Wehrly, Kain Wright\nFreshmen: Elijah Diffin, Levi Fenzl, Maia Gearing, Ayla Grandey, Evan Speicher, Danielle Cross, Terron Boblitt, Adalie Hanefeld, Lena Brown, Micah Fultz, Luke Jebsen, Genesis Ochoa, Kally Cotter, Halie Bretz, Emma Miller, Savana Missler, Matthew Piehl, Alliyah Shisler, Noah Bricker, Leo Gearing, Cody Garmatter, Cora Koontz, Sydney Motter, Hailey Ballinger, Carson Kruse, Austin Scherger, Alexis Wheeler, Branson Hilty, Landen Worcester, Wyatt Dailey, Genna Gatchel, Ethan Kohli, Jackson Brauen\nSophomores: Carly Hannan, Gavin Bogart, Malaya McBrien, Cole Bowers, Riley Greer, Avery Kinn, Nathan Taylor, Carsen Weaver, Lauren Bassett, Alissa Beck, Rylee Geesaman, Carly Setzer, Braeden Jordan, Garret Bogart, Tyler Cupples, Taylor Follas, Kaylee Kinsinger, Jacob Lehman, Kaelyn Hart, Shylee Kaufman, Marco Eiden, Olivia Siferd, Cole Burkholder\nJuniors: Alaina Grothause, Karson Hauenstein, Jasmine Whitlow, Addie Businger, Levi Graham, Gavin Kruse, Isaiah Mikesell, Jonah Rehm, Dyllan Worcester, Amber Gladwell, Jack Hohenbrink, Marissa Thompson, Ehan Oglesbee, Landon Shutler, Riley Verb, Kendal Giesige, Julia Mehaffie, Wyatt Lovell, Jasi Crawfis, Eden Antrim, Logan Combs, Thayne Kleman, Aubrey Edwards\nSeniors: Ella Miller, Trey Boblitt, Jonah Brown, Ethan Beach, Hannah Fenzl, Jenna Goodman, Sofia Goodwin, Caden Habegger, Dylan Hohenbrink, Ethan Bogart, Emily Hardy, Maeve Donaldson, Steven Neely, Lauren Swartzlander, Riley Busch, Jordyn Garmatter, Delaney Maple, Olivia Parker, Bryan Zimmerman, Landyn Fleharty, Cara Young, Carter Dailey, Nathan Meyer, Madison Sampson, Wesley Brauen, Ella Cunningham\nThis entry was tagged Making the Grades.",
    "author": "",
    "title": "Bluffton honor roll"
  },
  {
    "id": 3500,
    "mediaId": 2606,
    "date": "2022-02-03",
    "sentence": "Joshua <span class='selected-term'>Max Miller</span>, 40, is charged with 11 felonies including sexual assault of a child under 14, lewdness with a child, and child abuse neglect.",
    "author": "Glenn Puit",
    "title": "Former corrections, parole officer charged with sexual assault of child"
  },
  {
    "id": 2623,
    "mediaId": 2551,
    "date": "2022-02-04",
    "sentence": "They've also subpoenaed Jeffrey Clark, a former DOJ official, former Trump advisors Stephen Miller and <span class='selected-term'>Max Miller</span>, former White House deputy press secretary Judd Deere, former White House chief of staff Mark Meadows and former White House Press Secretary Kayleigh McEnany, among others.",
    "author": "Morgan Phillips",
    "title": "GOP Rep. Jim Jordan spoke to Trump on the phone for 10 minutes on January 6, new White House records reveal"
  },
  {
    "id": 2636,
    "mediaId": 2551,
    "date": "2022-02-07",
    "sentence": "Back in the 1950s, it banned the music-hall comedian <span class='selected-term'>Max Miller</span> and his song Let's Have A Ride On Your Bicycle, due to its 'outrageous' lyrics:\nAfter the ride I began to perspire\nIt wasn't the ride, I'd been pumping her tyre\nInnocent days.",
    "author": "Christopher Hart For The Daily Mail",
    "title": "What a joke! Jimmy Carr's crass attempt to challenge cancel culture with his Holocaust 'gag' will actually only strengthen it, writes CHRISTOPHER HART"
  },
  {
    "id": 2002,
    "mediaId": 8484,
    "date": "2022-02-07",
    "sentence": "Back in the 1950s, it banned the music-hall comedian <span class='selected-term'>Max Miller</span> and his song Let's Have A Ride On Your Bicycle, due to its 'outrageous' lyrics:\nAfter the ride I began to perspire\nIt wasn't the ride, I'd been pumping her tyre\nInnocent days.",
    "author": "Christopher Hart For The Daily Mail",
    "title": "What a joke! Jimmy Carr's crass attempt to challenge cancel culture with his Holocaust 'gag' will actually only strengthen it, writes CHRISTOPHER HART"
  },
  {
    "id": 2522,
    "mediaId": 2551,
    "date": "2022-02-08",
    "sentence": "Back in the 1950s, it banned the music-hall comedian <span class='selected-term'>Max Miller</span> and his song Let's Have A Ride On Your Bicycle, due to its 'outrageous' lyrics:\nAfter the ride I began to perspire\nIt wasn't the ride, I'd been pumping her tyre\nInnocent days.",
    "author": "James Gant For Mailonline",
    "title": "Ofcom chief demands to regulate Netflix over Jimmy Carr Gypsy joke: Pressure piles on US streaming giant as 16,000 sign petition calling for comic's show to be removed while theatres are urged to CANCEL his upcoming comedy gigs"
  },
  {
    "id": 2037,
    "mediaId": 2594,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Peony Hirwani",
    "title": "Rihanna praised for donating food and clothes to homeless veterans in Los Angeles"
  },
  {
    "id": 1041,
    "mediaId": 2643,
    "date": "2022-02-14",
    "sentence": "",
    "author": "Patricia McKnight",
    "title": "Trump May Bypass Big Names Mandel, Vance in Ohio Race for Unknown Dolan"
  },
  {
    "id": 1465,
    "mediaId": 5308,
    "date": "2022-02-17",
    "sentence": "Now, the former president is currently supporting his former White House aide <span class='selected-term'>Max Miller</span> in a House campaign even though Miller’s ex-girlfriend, fellow former White House staffer Stephanie Grisham, accused him of physically and emotionally abusing her.",
    "author": "Cameron Joseph",
    "title": "Trump endorsed a congressional candidate accused of abusing her stepdaughter."
  },
  {
    "id": 14908,
    "mediaId": 2859,
    "date": "2022-02-18",
    "sentence": "4A boys state tournament\nDay 1\nAt UVU\nTeam scores\nMountain Crest, 156\nBear River, 135.5\nSnow Canyon,133\nRidgeline, 111\nHurricane, 87.5\nPine View, 77\nGreen Canyon, 68\nDesert Hills, 57\nSaturday’s semifinals\nAsher Farr, Snow Canyon vs. Parker Revis, Hurricane\nDaxton Bingham, Bear River vs. Zach Halligan, Mountain Crest\n113\nCarter Nelson, Mountain Crest vs. <span class='selected-term'>Max Miller</span>, Bear River\nKayden Ward, Bear River vs. Kaden Guymon, Snow Canyon\n120\nEaston Evans, Mountain Crest vs. Payton Marx, Pine View\nJaren Marx, Pine View vs. Edgar Renteria, Snow Canyon\n126\nLuke Schroeder, Mountain Crest vs. Ty Hawkes, Bear River\nSeth Armstrong, Hurricane vs. Kayden Madsen, Crimson Cliffs\n132\nNathaniel Fordham, Desert Hills vs. Ben Jackman, Hurricane\nCooper Redd, Logan vs. Lincoln Lofthouse, Mountain Crest\n138\nCaleb Bundy, Pine View vs. Mikah Murphy, Hurricane\nTy Winward, Ridgeline vs. Kade Croft, Sky View\n144\nTerrell Lee, Mountain Crest vs. Cooper Anderson, Cedar City\nZach Gunderson, Bear River vs. Brenden Smith, Snow Canyon\n150\nJace McBride, Mountain Crest vs. Dustin Douglas, Bear River\nTristyn Dennett, Hurricane vs. Brayden Jones, Snow Canyon\n157\nKeagan Boyce, Desert Hills vs. Sam Pirtle, Ridgeline\nTegun Cu Whitehead, Snow Canyon vs. Nic Baum, Crimson Cliffs\n165\nRockwell Jones, Snow Canyon vs. Teddy Larson, Pine View\nOwen Munk, Ridgeline vs. Dontay McMurtrey, Mountain Crest\n175\nBrock Guthrie, Mountain Crest vs. Cash Carlisle, Dixie\nRiver Smith, Bear River vs. Phoenix Oliver, Snow Canyon\n190\nEldon Milton, Crimson Cliffs vs. Kaeson Burn, Bear River\nRonan Melani, Ridgeline vs. Luke Blake, Green Canyon\n215\nWill Wheatley, Green Canyon vs.",
    "author": "James Edward",
    "title": "High school wrestling: Mountain Crest boys and girls lead after opening day of 4A state tournament"
  },
  {
    "id": 14804,
    "mediaId": 2859,
    "date": "2022-02-19",
    "sentence": "",
    "author": "David Anderson",
    "title": "High school boys wrestling: Mountain Crest returns to the top of the 4A heap"
  },
  {
    "id": 651,
    "mediaId": 2630,
    "date": "2022-02-22",
    "sentence": "“It’s like Magapalooza One.”\nThe list of candidates scheduled to attend include: Katie Arrington, candidate for South Carolina’s 1st Congressional District; Ted Budd, candidate for U.S. Senate in North Carolina; Loren Culp, candidate for Washington state's 4th Congressional District; Russell Fry, candidate for South Carolina’s 7th Congressional District; John Gibbs, a former Housing and Urban Development official under Trump running to represent Michigan’s 3rd Congressional District; Harriet Hageman, candidate for Wyoming’s only congressional district; Adam Laxalt, candidate for U.S. Senate in Nevada; <span class='selected-term'>Max Miller</span>, the former Trump White House aide and candidate for Ohio’s 13th Congressional District; Morgan Ortagus, a former State Department spokeswoman running to represent Tennessee’s 5th Congressional District; Kelly Tshibaka, candidate for U.S. Senate in Alaska; Derrick Van Orden, candidate for Wisconsin’s 3rd Congressional District; Herschel Walker, candidate for U.S. Senate in Georgia; Ryan Zinke, the former Interior Secretary running in Montana’s only congressional district.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores"
  },
  {
    "id": 57,
    "mediaId": 2550,
    "date": "2022-02-22",
    "sentence": "",
    "author": "",
    "title": "Who's who: A rolling guide to the targets of the Jan. 6 committee"
  },
  {
    "id": 628,
    "mediaId": 2676,
    "date": "2022-02-24",
    "sentence": "One thing he was right about was that Biden's weakness would invite Putin's aggression,\" agreed former Trump advisor and Ohio congressional candidate <span class='selected-term'>Max Miller</span>.",
    "author": "Kathryn Joyce",
    "title": "CPAC opens and immediately devolves into GOP dissent over Ukraine"
  },
  {
    "id": 868,
    "mediaId": 2580,
    "date": "2022-02-24",
    "sentence": "), and <span class='selected-term'>Max Miller</span> (Ohio), according to Punchbowl.",
    "author": "",
    "title": "Trump holds GOP candidate forum at Mar-a-Lago"
  },
  {
    "id": 231,
    "mediaId": 2641,
    "date": "2022-02-24",
    "sentence": "Others in attendance included Senate candidates Herschel Walker of Georgia, Eric Greitens of Missouri, as well as House candidates Morgan Ortagus of Tennessee, Harriet Hageman of Wyoming, and <span class='selected-term'>Max Miller</span> of Ohio.",
    "author": "Theodore Bunker",
    "title": "Trump Hosts GOP Candidate Forum at Mar-a-Lago Resort"
  },
  {
    "id": 362,
    "mediaId": 2564,
    "date": "2022-02-25",
    "sentence": "And some of Trump's chosen candidates were there as well - including <span class='selected-term'>Max Miller</span> of Ohio, who is vying to replace the retiring GOP Rep. Anthony Gonzalez, an impeachment backer, and Kelly Tshibaka, taking on Republican Sen. Lisa Murkowski, who said Trump should be convicted for inciting an insurrection.",
    "author": "",
    "title": "EXCLUSIVE: Trump gets his game face on: Ex-President plays golf at his West Palm Beach course ahead of his CPAC speech on Saturday night after tearing into Biden's response to Putin's Ukraine invasion"
  },
  {
    "id": 69,
    "mediaId": 2664,
    "date": "2022-02-25",
    "sentence": "One thing he was right about was that Biden's weakness would invite Putin's aggression,\" agreed former Trump advisor and Ohio congressional candidate <span class='selected-term'>Max Miller</span>.",
    "author": "Kathryn Joyce",
    "title": "CPAC opens and immediately devolves into GOP dissent over Ukraine"
  },
  {
    "id": 790,
    "mediaId": 2530,
    "date": "2022-02-25",
    "sentence": "A wide range of conservatives gave 10- to 20–minute speeches, including Charlie Kirk and Rep. Andy Biggs, and multiple Republican candidates running for Congress, including <span class='selected-term'>Max Miller</span>, Cory Mills, and Mark Walker.",
    "author": "Kadia Goba",
    "title": "The Russian Invasion Of Ukraine Barely Came Up At The First Day Of CPAC"
  },
  {
    "id": 103,
    "mediaId": 2584,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Luke Buckmaster",
    "title": "Dog skulls, choof tea and amputation: here’s what the new Mad Max book doesn’t tell you"
  },
  {
    "id": 132,
    "mediaId": 6676,
    "date": "2022-02-26",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "CPAC attendees showing interest in DeSantis for presidential run"
  },
  {
    "id": 12635,
    "mediaId": 2564,
    "date": "2022-02-26",
    "sentence": "And some of Trump's chosen candidates were there as well - including <span class='selected-term'>Max Miller</span> of Ohio, who is vying to replace the retiring GOP Rep. Anthony Gonzalez, an impeachment backer, and Kelly Tshibaka, taking on Republican Sen. Lisa Murkowski, who said Trump should be convicted for inciting an insurrection.",
    "author": "",
    "title": "Trump blasts Biden over Putin's invasion of Ukraine"
  },
  {
    "id": 12617,
    "mediaId": 2564,
    "date": "2022-02-26",
    "sentence": "And some of Trump's chosen candidates were there as well - including <span class='selected-term'>Max Miller</span> of Ohio, who is vying to replace the retiring GOP Rep. Anthony Gonzalez, an impeachment backer, and Kelly Tshibaka, taking on Republican Sen. Lisa Murkowski, who said Trump should be convicted for inciting an insurrection.",
    "author": "Rob Crilly",
    "title": "'What the hell is going on?' Donald Trump demands an audit of Mark Zuckerberg's $417m election donations as he reheats claim of 2020 fraud in CPAC address"
  },
  {
    "id": 478,
    "mediaId": 8491,
    "date": "2022-02-26",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "CPAC attendees showing interest in DeSantis for presidential run"
  },
  {
    "id": 13254,
    "mediaId": 2573,
    "date": "2022-02-27",
    "sentence": "EXCLUSIVE: ORLANDO, Fla.—Ohio GOP congressional candidate and former Trump administration official <span class='selected-term'>Max Miller</span> said Russian President Vladimir Putin saw \"weak leadership\" from President Biden ahead of launching a multi-front war in Ukraine, which he said emboldened him to invade.",
    "author": "Brooke Singman",
    "title": "Ohio congressional candidate Max Miller says Putin saw 'weak leadership' from Biden before invading Ukraine"
  },
  {
    "id": 13176,
    "mediaId": 2748,
    "date": "2022-02-27",
    "sentence": "And some of Trump's chosen candidates were there as well - including <span class='selected-term'>Max Miller</span> of Ohio, who is vying to replace the retiring GOP Rep. Anthony Gonzalez, an impeachment backer, and Kelly Tshibaka, taking on Republican Sen. Lisa Murkowski, who said Trump should be convicted for inciting an insurrection.",
    "author": "",
    "title": "'The real problem is that our leaders are dumb': Trump blasts Biden over Putin's invasion of Ukraine boasting that it wouldn't have happened on his watch - as he teases a 2024 run"
  },
  {
    "id": 13119,
    "mediaId": 8428,
    "date": "2022-03-01",
    "sentence": "Additionally, candidates who do not yet hold public office attended, including Georgia congressional candidate Herschel Walker and Ohio congressional candidate <span class='selected-term'>Max Miller</span>.",
    "author": "Summer Lane",
    "title": "Trump holds event for GOP candidates at Mar-a-Lago"
  },
  {
    "id": 12474,
    "mediaId": 8322,
    "date": "2022-03-01",
    "sentence": "",
    "author": "Rebeccah Heinrichs",
    "title": "Putin's nuclear threats in Ukraine war – here's how US, allies must respond"
  },
  {
    "id": 17443,
    "mediaId": 8465,
    "date": "2022-03-03",
    "sentence": "She was born on January 12, 1964, in Van Wert the daughter of <span class='selected-term'>Max Miller</span> and Janet Ann (Bell) Bennett, who both preceded her in death.",
    "author": "",
    "title": "Eunice Yvonne Bernhardt"
  },
  {
    "id": 11239,
    "mediaId": 2551,
    "date": "2022-03-09",
    "sentence": "+10\nView gallery\nStephanie Grisham considered warning Melania Trump about the 'unusual interest' President Donald Trump was taking in a young, attractive female staffer\nGrisham dated <span class='selected-term'>Max Miller</span>, a Trump loyalist who is running for Congress in Ohio, but the two broke up.",
    "author": "",
    "title": "Stephanie Grisham reveals her gay son said he was 'ashamed' she worked for Trump's White House"
  },
  {
    "id": 11545,
    "mediaId": 4008,
    "date": "2022-03-18",
    "sentence": "",
    "author": "Callum Crumlish",
    "title": "Mel Gibson won Mad Max role after vicious fistfight - 'Not pretty'"
  },
  {
    "id": 11063,
    "mediaId": 2540,
    "date": "2022-03-18",
    "sentence": "Katrina Pierson, a prominent campaign spokesperson who was part of a West Wing meeting leading up to January 6 has met with the committee, as has <span class='selected-term'>Max Miller</span> a former White House and campaign official who is now running for Congress.",
    "author": "Gloria Borger",
    "title": "Jan. 6 committee plans to use key video evidence and hire a writer to build a compelling narrative for the public"
  },
  {
    "id": 9767,
    "mediaId": 6598,
    "date": "2022-03-21",
    "sentence": "In Ohio, a former Trump White House aide, <span class='selected-term'>Max Miller</span>, challenged Representative Anthony Gonzalez after Mr. Gonzalez voted to impeach Mr. Trump, helping to push the incumbent into retirement.",
    "author": "",
    "title": "Ex-Wife of Eric Greitens, Senate Candidate in Missouri, Accuses Him of Abuse"
  },
  {
    "id": 9476,
    "mediaId": 2752,
    "date": "2022-03-22",
    "sentence": "Or <span class='selected-term'>Max Miller</span>, a congressional candidate in Ohio, who White House comms flack Stephanie Grisham alleges abused her during their relationship.",
    "author": "Liz Dye",
    "title": "MO Senate Candidate Eric Greitens Is Somehow Even More Trash Than We Knew"
  },
  {
    "id": 9670,
    "mediaId": 2909,
    "date": "2022-03-25",
    "sentence": "",
    "author": "Deneen Borelli",
    "title": "Biden Blunders on the World Stage"
  },
  {
    "id": 7756,
    "mediaId": 2629,
    "date": "2022-04-02",
    "sentence": "The former president has enthusiastically endorsed other candidates credibly accused of similar offenses, including Herschel Walker in Georgia and <span class='selected-term'>Max Miller</span> in Ohio.",
    "author": "Joe Conason",
    "title": "The 'Soft On Crime' Party? It's Not The Democrats"
  },
  {
    "id": 7707,
    "mediaId": 2537,
    "date": "2022-04-03",
    "sentence": "Substitutes: Daniel Martin (Valenzuela); Isaac Atanga (Flanagan); Andrew Akindele (Kamdem); <span class='selected-term'>Max Miller</span>; David Garcia (Markanich).",
    "author": "Pat Brennan",
    "title": "FC Cincinnati 2 defeats Toronto FC II for first-ever MLS NEXT Pro win"
  },
  {
    "id": 7759,
    "mediaId": 2570,
    "date": "2022-04-03",
    "sentence": "A former Trump White House staffer now running for Congress in Ohio, <span class='selected-term'>Max Miller</span>, was at Mar-a-Lago again this week, according to posts on social media.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: MyPillow CEO Covered Some Travel Expenses For Kristi Noem’s PAC"
  },
  {
    "id": 7354,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish Country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "JULIE CARR SMYTH - Associated Press",
    "title": "Ohio Rep. Bob Gibbs retires abruptly, blames fight over maps"
  },
  {
    "id": 7681,
    "mediaId": 2883,
    "date": "2022-04-06",
    "sentence": "Gibbs, first elected during the GOP wave of 2010, remains on the May 3 primary ballot against former Trump administration aide <span class='selected-term'>Max Miller</span> in the 7th District.",
    "author": "Kate Ackley",
    "title": "Another House Republican facing a Trump-backed challenger retires"
  },
  {
    "id": 7581,
    "mediaId": 2514,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish Country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "",
    "title": "Ohio Rep. Bob Gibbs retires abruptly, blames fight over maps"
  },
  {
    "id": 7946,
    "mediaId": 2630,
    "date": "2022-04-06",
    "sentence": "But Gibbs' most significant obstacle to a seventh term was former Trump White House and campaign aide <span class='selected-term'>Max Miller</span>, one of several other candidates who filed for the May 3 primary.",
    "author": "",
    "title": "Rep. Bob Gibbs of Ohio, facing Trump-backed challenger, announces retirement"
  },
  {
    "id": 7586,
    "mediaId": 2560,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish Country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Rep. Bob Gibbs retires abruptly, blames fight over maps"
  },
  {
    "id": 7866,
    "mediaId": 2540,
    "date": "2022-04-06",
    "sentence": "To that end, after considerable deliberation, I have decided to not seek re-election this year.”\nGibbs was also facing <span class='selected-term'>Max Miller</span>, a former aide to former President Donald Trump, in the Republican primary.",
    "author": "Clare Foran and Melissa Holzberg DePalo",
    "title": "Ohio GOP lawmaker announces retirement citing redistricting ‘circus’"
  },
  {
    "id": 7490,
    "mediaId": 2584,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish country exits a primary race in north-eastern Ohio that, under new temporary maps, would have put him up against the Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "Associated Press",
    "title": "Republican congressman Bob Gibbs retires, blaming redistricting ‘circus’"
  },
  {
    "id": 7619,
    "mediaId": 2636,
    "date": "2022-04-06",
    "sentence": "— <span class='selected-term'>Max Miller</span> (@MaxMillerOH) April 6, 2022\nThe court is planning to hold a hearing on the new congressional map sometime after the May 3 primary, and is hearing challenges to a fourth set of state legislative maps.",
    "author": "",
    "title": "Bob Gibbs, House Republican Facing Primary Challenge in Ohio, Will Retire"
  },
  {
    "id": 7516,
    "mediaId": 2658,
    "date": "2022-04-06",
    "sentence": "",
    "author": "",
    "title": "Ohio Republican Bob Gibbs to retire amid redistricting chaos"
  },
  {
    "id": 7760,
    "mediaId": 2687,
    "date": "2022-04-06",
    "sentence": "Around 12 percent of his old district remained in the new one.”\n“Gibbs also faced primary challenges from several candidates including <span class='selected-term'>Max Miller</span>, a well-funded former White House aide to ex-President Donald Trump.”\nSave to Favorites",
    "author": "Taegan Goddard",
    "title": "GOP Lawmaker to Retire Rather Than Face Primary"
  },
  {
    "id": 7476,
    "mediaId": 2550,
    "date": "2022-04-06",
    "sentence": "The six-term congressman’s abrupt retirement leaves former Trump aide <span class='selected-term'>Max Miller</span> as the frontrunner to claim a seat in the Canton area and Akron suburbs that Trump would have carried 54-45.",
    "author": "",
    "title": "bid after new map leaves him in tough primary vs."
  },
  {
    "id": 7871,
    "mediaId": 2728,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish Country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Rep. Bob Gibbs retires abruptly, blames fight over maps"
  },
  {
    "id": 7723,
    "mediaId": 2557,
    "date": "2022-04-06",
    "sentence": "— <span class='selected-term'>Max Miller</span> (@MaxMillerOH) April 6, 2022\nFormer President Donald Trump released the following statement on Gibbs’ retirement:\n“I want to congratulate Congressman Bob Gibbs of Ohio on a wonderful and accomplished career.",
    "author": "DML News App",
    "title": "BREAKING: Republican Rep announces retirement, slams redistricting ‘circus’ [Trump responds]"
  },
  {
    "id": 7948,
    "mediaId": 2562,
    "date": "2022-04-06",
    "sentence": "Trump initially supported former aide <span class='selected-term'>Max Miller</span> in the 16th District to challenge Rep. Anthony Gonzalez, R-Ohio, voted to impeach Trump in the wake of the Jan. 6, 2021, attack on the Capitol.",
    "author": "NationalWatch",
    "title": "Ohio GOP Rep. Gibbs Announces Retirement"
  },
  {
    "id": 7791,
    "mediaId": 8484,
    "date": "2022-04-06",
    "sentence": "+6\nView gallery\nRep. Bob Gibbs, a pro-Trump Republican, has represented Ohio's 7th Congressional District since 2013 and has served in Congress since 2011\n+6\nView gallery\nLast month a newly-redrawn version of Ohio's district map made ex-Trump staffer <span class='selected-term'>Max Miller</span>, who had been challenging anti-Trump Republican Rep. Anthony Gonzalez in the May 3 primary, switch to Gibbs' territory\nHe thanked his supporters as well as family and friends, stating he was 'eternally grateful' for his time at the US Capitol.",
    "author": "Elizabeth Elkind",
    "title": "Republican Rep. Bob Gibbs announces he will RETIRE before the midterms and clears the way for Stephanie Grisham's Trump-backed ex-boyfriend to win the GOP primary"
  },
  {
    "id": 7747,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Gibbs’ expected primary opponent is <span class='selected-term'>Max Miller</span>, a former aide to Donald Trump.",
    "author": "Jazz Shaw",
    "title": "Ohio Republican announces retirement over redistricting"
  },
  {
    "id": 7690,
    "mediaId": 2641,
    "date": "2022-04-06",
    "sentence": "Trump initially supported former aide <span class='selected-term'>Max Miller</span> in the 16th District to challenge Rep. Anthony Gonzalez, R-Ohio, voted to impeach Trump in the wake of the Jan. 6, 2021, attack on the Capitol.",
    "author": "Charlie McCarthy",
    "title": "Ohio GOP Rep. Gibbs Announces Retirement"
  },
  {
    "id": 8384,
    "mediaId": 8363,
    "date": "2022-04-06",
    "sentence": "Gibbs faces four challengers in GOP primary, including one backed by Donald Trump\nBefore he announced his retirement, Gibbs faced four Republican primary challengers, including <span class='selected-term'>Max Miller</span> who has been endorsed by former President Donald Trump.",
    "author": "Robert Wang",
    "title": "Ohio Congressman Bob Gibbs drops out of crowded Republican primary, announces retirement"
  },
  {
    "id": 8676,
    "mediaId": 8379,
    "date": "2022-04-06",
    "sentence": "Gibbs announced in November that he planned to run for reelection, but the six-term congressman released a statement Wednesday morning saying the slow-moving redistricting “circus” he blames on the court led him to the “difficult decision” to “not seek re-election this year.”\n“It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins,” Gibbs wrote, “especially in the Seventh Congressional District where almost 90 percent of the electorate is new and nearly two thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District.”\nThe redrawn, Republican-favoring district would have pitted Gibbs against GOP primary candidates that include <span class='selected-term'>Max Miller</span>, a former White House and campaign aide to Donald Trump who the former president has already endorsed.",
    "author": "Ben Orner",
    "title": "Ohio’s Bob Gibbs, citing redistricting ‘circus,’ is retiring from Congress"
  },
  {
    "id": 8677,
    "mediaId": 8485,
    "date": "2022-04-06",
    "sentence": "Take a listen to learn more about Gibbs frustration with mapping, his time in Congress, and the role <span class='selected-term'>Max Miller</span> played in his decision to retire.",
    "author": "",
    "title": "Congressman Bob Gibbs Explains Decision to Retire"
  },
  {
    "id": 8500,
    "mediaId": 8491,
    "date": "2022-04-06",
    "sentence": "Gibbs announced in November that he planned to run for reelection, but the six-term congressman released a statement Wednesday morning saying the slow-moving redistricting “circus” he blames on the court led him to the “difficult decision” to “not seek re-election this year.”\n“It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins,” Gibbs wrote, “especially in the Seventh Congressional District where almost 90 percent of the electorate is new and nearly two thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District.”\nThe redrawn, Republican-favoring district would have pitted Gibbs against GOP primary candidates that include <span class='selected-term'>Max Miller</span>, a former White House and campaign aide to Donald Trump who the former president has already endorsed.",
    "author": "Ben Orner",
    "title": "Ohio’s Bob Gibbs, citing redistricting ‘circus,’ is retiring from Congress"
  },
  {
    "id": 8517,
    "mediaId": 8496,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish Country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "",
    "title": "Ohio Rep. Bob Gibbs retires abruptly, blames fight over maps"
  },
  {
    "id": 8711,
    "mediaId": 8384,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "Associated Press",
    "title": "Ohio Rep. Bob Gibbs retires abruptly, blames fight over maps"
  },
  {
    "id": 8740,
    "mediaId": 8480,
    "date": "2022-04-06",
    "sentence": "Gibbs announced in November that he planned to run for reelection, but the six-term congressman released a statement Wednesday morning saying the slow-moving redistricting “circus” he blames on the court led him to the “difficult decision” to “not seek re-election this year.”\n“It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins,” Gibbs wrote, “especially in the Seventh Congressional District where almost 90 percent of the electorate is new and nearly two thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District.”\nThe redrawn, Republican-favoring district would have pitted Gibbs against GOP primary candidates that include <span class='selected-term'>Max Miller</span>, a former White House and campaign aide to Donald Trump who the former president has already endorsed.",
    "author": "Ben Orner",
    "title": "Ohio’s Bob Gibbs, citing redistricting ‘circus,’ is retiring from Congress"
  },
  {
    "id": 8417,
    "mediaId": 8289,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish Country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "Portsmouth Daily Times",
    "title": "Ohio Rep. Bob Gibbs retires abruptly, blames fight over maps"
  },
  {
    "id": 8747,
    "mediaId": 8494,
    "date": "2022-04-06",
    "sentence": "The current new Congressional map drew Gibbs into a primary with <span class='selected-term'>Max Miller</span>, a former aide in the Trump White House.",
    "author": "Nick Castele",
    "title": "GOP Rep. Bob Gibbs announces retirement, calls Ohio’s redistricting fight a 'circus'"
  },
  {
    "id": 8728,
    "mediaId": 8371,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "Associated Press",
    "title": "Ohio Rep. Bob Gibbs retires abruptly, blames fight over maps"
  },
  {
    "id": 8298,
    "mediaId": 8358,
    "date": "2022-04-06",
    "sentence": "The six-term congressman from Amish Country exits a primary race in northeast Ohio that, under new temporary maps, would have put him up against Trump-backed Republican <span class='selected-term'>Max Miller</span>.",
    "author": "",
    "title": "Ohio Rep. Bob Gibbs retires abruptly"
  },
  {
    "id": 7152,
    "mediaId": 2919,
    "date": "2022-04-06",
    "sentence": "If he had not exited the primary race, Gibbs would have went up against Trump-backed challenger <span class='selected-term'>Max Miller</span>, who was an aide to the former president.",
    "author": "Kaylyn Hlavaty",
    "title": "Ohio Rep. Bob Gibbs announces retirement over 'circus' of Ohio's unresolved congressional maps"
  },
  {
    "id": 7458,
    "mediaId": 6656,
    "date": "2022-04-06",
    "sentence": "Gibbs faced primary challenges from multiple candidates including <span class='selected-term'>Max Miller</span>, who served as a White House aide to former President Donald Trump.",
    "author": "Daniel Uria",
    "title": "Ohio Rep. Bob Gibbs announces retirement citing redistricting 'circus'"
  },
  {
    "id": 8865,
    "mediaId": 8494,
    "date": "2022-04-07",
    "sentence": "The current new Congressional map drew Gibbs into a primary with <span class='selected-term'>Max Miller</span>, a former aide in the Trump White House.",
    "author": "Amy Eddings",
    "title": "Morning Headlines: Cleveland moves to expunge 4,000 low-level marijuana offenses...and more stories"
  },
  {
    "id": 5279,
    "mediaId": 2562,
    "date": "2022-04-10",
    "sentence": "Six-termer Gibbs, a strong conservative who almost always supported Trump, nonetheless opted out of re-election when a new redistricting plan placed him in the same district as <span class='selected-term'>Max Miller</span>, former Trump White House staffer and scion of a wealthy real estate family in Cleveland.",
    "author": "NationalWatch",
    "title": "‘Trump Factor’ Key Reason For Republican Retirements From House"
  },
  {
    "id": 5299,
    "mediaId": 2641,
    "date": "2022-04-10",
    "sentence": "Six-termer Gibbs, a strong conservative who almost always supported Trump, nonetheless opted out of re-election when a new redistricting plan placed him in the same district as <span class='selected-term'>Max Miller</span>, former Trump White House staffer and scion of a wealthy real estate family in Cleveland.",
    "author": "John Gizzi",
    "title": "'Trump Factor' Key Reason for Republican Retirements From House"
  },
  {
    "id": 5967,
    "mediaId": 2699,
    "date": "2022-04-11",
    "sentence": "Other Trump administration departees like former White House press secretary Sarah Huckabee Sanders and Trump aide <span class='selected-term'>Max Miller</span> are running for office in their respective home states, betting that their former boss will lift them up among the faithful.",
    "author": "Ursula Perano",
    "title": "Trump Cabinet ‘Grifter’ With CA Home Is All In on Montana Run"
  },
  {
    "id": 6089,
    "mediaId": 2672,
    "date": "2022-04-13",
    "sentence": "Here’s <span class='selected-term'>Max Miller</span>, a former Trump aide running for the Ohio U.S. House seat left vacant by retiring Republican Rep. Anthony Gonzalez, talking about using “a rifle to protect our country.”\nThe Trump impeachment-vote revenge tour continues on.",
    "author": "Ryan Bort",
    "title": "The Real Reason Republicans Are Loading Their 2022 Campaign Ads With Guns"
  },
  {
    "id": 5593,
    "mediaId": 2594,
    "date": "2022-04-13",
    "sentence": "Trump will headline an evening rally at the Delaware County Fairgrounds in Delaware, north of Columbus, on April 23 — certainly to stump for U.S. House candidate <span class='selected-term'>Max Miller</span>, his pick for the 7th Congressional District, and perhaps for U.S. Senate or governor choices he is yet to make.",
    "author": "Via AP news wire",
    "title": "Trump returning to Ohio for GOP rally ahead of May 3 primary"
  },
  {
    "id": 5904,
    "mediaId": 2562,
    "date": "2022-04-13",
    "sentence": "Trump will headline an evening rally at the Delaware County Fairgrounds in Delaware, north of Columbus, on April 23 — certainly to stump for U.S. House candidate <span class='selected-term'>Max Miller</span>, his pick for the 7th Congressional District, and perhaps for his U.S. Senate or governor choices he has yet to announce.",
    "author": "NationalWatch",
    "title": "Trump Returning to Ohio for GOP Rally Ahead of May 3 Primary"
  },
  {
    "id": 6118,
    "mediaId": 2557,
    "date": "2022-04-13",
    "sentence": "In another race in Ohio, Republican <span class='selected-term'>Max Miller</span> is running for U.S. Congress in the state’s 7th District, and has been endorsed by Trump.",
    "author": "DML News App",
    "title": "NEWS ALERT: Trump announces location of next ‘Save America’ rally"
  },
  {
    "id": 6329,
    "mediaId": 8331,
    "date": "2022-04-13",
    "sentence": "Trump last visited Ohio in June 2021 to stump for his former aide and congressional candidate <span class='selected-term'>Max Miller</span>.",
    "author": "Haley BeMiller",
    "title": "Former President Donald Trump to visit Delaware County ahead of May primary"
  },
  {
    "id": 6400,
    "mediaId": 8323,
    "date": "2022-04-13",
    "sentence": "He’ll certainly stump for U.S. House candidate <span class='selected-term'>Max Miller</span>, his pick for the 7th Congressional District, and perhaps for U.S. Senate or governor choices he’s yet to make.",
    "author": "",
    "title": "Trump returns to Ohio for GOP rally ahead of May 3 primary"
  },
  {
    "id": 6492,
    "mediaId": 8371,
    "date": "2022-04-13",
    "sentence": "Trump will headline an evening rally at the Delaware County Fairgrounds in Delaware, north of Columbus, on April 23 — certainly to stump for U.S. House candidate <span class='selected-term'>Max Miller</span>, his pick for the 7th Congressional District, and perhaps for U.S. Senate or governor choices he is yet to make.",
    "author": "Associated Press",
    "title": "Trump returning to Ohio for GOP rally ahead of May 3 primary"
  },
  {
    "id": 6470,
    "mediaId": 8384,
    "date": "2022-04-13",
    "sentence": "Trump will headline an evening rally at the Delaware County Fairgrounds in Delaware, north of Columbus, on April 23 — certainly to stump for U.S. House candidate <span class='selected-term'>Max Miller</span>, his pick for the 7th Congressional District, and perhaps for U.S. Senate or governor choices he is yet to make.",
    "author": "Associated Press",
    "title": "Trump returning to Ohio for GOP rally ahead of May 3 primary"
  },
  {
    "id": 6267,
    "mediaId": 8494,
    "date": "2022-04-13",
    "sentence": "He'll stump for U.S. House candidate <span class='selected-term'>Max Miller</span>, his pick for the 7th Congressional District, and perhaps for U.S. Senate or governor choices he's yet to make.",
    "author": "Associated Press",
    "title": "Trump will hold a rally near Columbus ahead of the May 3 primary"
  },
  {
    "id": 6291,
    "mediaId": 8497,
    "date": "2022-04-13",
    "sentence": "Trump will headline an evening rally at the Delaware County Fairgrounds in Delaware, north of Columbus, on April 23 - certainly to stump for U.S. House candidate <span class='selected-term'>Max Miller</span>, his pick for the 7th Congressional District, and perhaps for U.S. Senate or governor choices he is yet to make.",
    "author": "The Associated Press",
    "title": "Trump returning to Ohio for GOP rally ahead of May 3 primary"
  },
  {
    "id": 6695,
    "mediaId": 8323,
    "date": "2022-04-14",
    "sentence": "He’ll certainly stump for U.S. House candidate <span class='selected-term'>Max Miller</span>, his pick for the 7th Congressional District, and perhaps for U.S. Senate or governor choices he’s yet to make.",
    "author": "Associated Press",
    "title": "Donald Trump returning to Ohio for GOP rally ahead of May 3 primary"
  },
  {
    "id": 5459,
    "mediaId": 2658,
    "date": "2022-04-14",
    "sentence": "During a late March fundraiser for Ohio GOP congressional candidate <span class='selected-term'>Max Miller</span>, two donors and vocal supporters of Mandel put the hard-sell on Trump about endorsing him, according to a person who attended.",
    "author": "",
    "title": "Ohio Republicans gang up to stop Vance endorsement"
  },
  {
    "id": 5454,
    "mediaId": 2649,
    "date": "2022-04-18",
    "sentence": "California Republican House candidate Scott Baugh, Georgia Republican House candidate Rich McCormick, former Trump aide and Ohio Republican House candidate <span class='selected-term'>Max Miller</span> and Rep. Alex Mooney (R-W.V.",
    "author": "William Gavin",
    "title": "Conservative super PAC spends millions boosting Republican congressional candidates"
  },
  {
    "id": 5883,
    "mediaId": 4045,
    "date": "2022-04-21",
    "sentence": "",
    "author": "Tony Messenger",
    "title": "Messenger: Roberts, Greitens can't escape abuse allegations while running for office"
  },
  {
    "id": 4932,
    "mediaId": 8313,
    "date": "2022-04-22",
    "sentence": "(tie) Jared Kraus, junior, Seven Hills – 3\nQuinn Benner, senior, Mariemont – 3\n<span class='selected-term'>Max Miller</span>, senior, Mariemont – 3\n7.",
    "author": "Scott Springer",
    "title": "Who are Greater Cincinnati's high school baseball statistical leaders, April 22?"
  },
  {
    "id": 5000,
    "mediaId": 2578,
    "date": "2022-04-23",
    "sentence": "Rally starts at 7 pm and people are here early pic.twitter.com/wfwjf5N2Pi\n— Jo Ingles (@joingles) April 23, 2022\nSeveral Trump-endorsed candidates delivered remarks to the MAGA crowd this afternoon including J. D. Vance and <span class='selected-term'>Max Miller</span>.",
    "author": "Jim Hoft",
    "title": "THOUSANDS Line Up in Delaware County Ohio to See President Trump at 7 PM — MASSIVE LINES – MASSIVE ENERGY! (Photos – Video)"
  },
  {
    "id": 4710,
    "mediaId": 8428,
    "date": "2022-04-24",
    "sentence": "",
    "author": "Grace Saldana",
    "title": "FULL VIDEO: Candidates give remarks at President Trump rally in Delaware, Ohio on 4/23/22"
  }
]