[
  {
    "id": 57,
    "mediaId": 2550,
    "date": "2022-02-22",
    "sentence": "",
    "author": "",
    "title": "Who's who: A rolling guide to the targets of the Jan. 6 committee"
  },
  {
    "id": 69,
    "mediaId": 2664,
    "date": "2022-02-25",
    "sentence": "One thing he was right about was that Biden's weakness would invite Putin's aggression,\" agreed former Trump advisor and Ohio congressional candidate <span class='selected-term'>Max Miller</span>.",
    "author": "Kathryn Joyce",
    "title": "CPAC opens and immediately devolves into GOP dissent over Ukraine"
  },
  {
    "id": 13176,
    "mediaId": 2748,
    "date": "2022-02-27",
    "sentence": "And some of Trump's chosen candidates were there as well - including <span class='selected-term'>Max Miller</span> of Ohio, who is vying to replace the retiring GOP Rep. Anthony Gonzalez, an impeachment backer, and Kelly Tshibaka, taking on Republican Sen. Lisa Murkowski, who said Trump should be convicted for inciting an insurrection.",
    "author": "",
    "title": "'The real problem is that our leaders are dumb': Trump blasts Biden over Putin's invasion of Ukraine boasting that it wouldn't have happened on his watch - as he teases a 2024 run"
  },
  {
    "id": 12474,
    "mediaId": 8322,
    "date": "2022-03-01",
    "sentence": "",
    "author": "Rebeccah Heinrichs",
    "title": "Putin's nuclear threats in Ukraine war – here's how US, allies must respond"
  },
  {
    "id": 9670,
    "mediaId": 2909,
    "date": "2022-03-25",
    "sentence": "",
    "author": "Deneen Borelli",
    "title": "Biden Blunders on the World Stage"
  },
  {
    "id": 7723,
    "mediaId": 2557,
    "date": "2022-04-06",
    "sentence": "— <span class='selected-term'>Max Miller</span> (@MaxMillerOH) April 6, 2022\nFormer President Donald Trump released the following statement on Gibbs’ retirement:\n“I want to congratulate Congressman Bob Gibbs of Ohio on a wonderful and accomplished career.",
    "author": "DML News App",
    "title": "BREAKING: Republican Rep announces retirement, slams redistricting ‘circus’ [Trump responds]"
  },
  {
    "id": 7458,
    "mediaId": 6656,
    "date": "2022-04-06",
    "sentence": "Gibbs faced primary challenges from multiple candidates including <span class='selected-term'>Max Miller</span>, who served as a White House aide to former President Donald Trump.",
    "author": "Daniel Uria",
    "title": "Ohio Rep. Bob Gibbs announces retirement citing redistricting 'circus'"
  }
]