{
  "id": 1016,
  "mediaId": 2822,
  "date": "2022-04-05",
  "headline": "Court: Arizona Attorney General can challenge ASU hotel deal",
  "image": "https://bloximages.chicago2.vip.townnews.com/tucson.com/content/tncms/assets/v3/editorial/1/c8/1c85a690-3761-11ec-a7fa-4b2065ae3537/5f3f059c83c67.image.jpg?crop=1200%2C675%2C0%2C241&resize=1120%2C630&order=crop%2Cresize",
  "link": "https://tucson.com/news/local/education/college/court-to-allow-arizona-attorney-general-to-challenge-asu-hotel-deal/article_f31afd42-b509-11ec-bb71-13070da32e90.html",
  "mediaOutlet": "tucson.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Howard Fischer Capitol Media Services",
  "authorUrl": "",
  "termIds": [
    1947,
    2725,
    3508,
    84,
    774,
    5245
  ],
  "sentences": [
    "In a 2019 report, Auditor General Lindsey Perry said the Board of Regents has been leasing out property for commercial use without proper oversight and with only limited transparency, creating a “risk of inappropriate use of public resources.”\nThe report found a lack of written guidance for real estate policies, “increasing the risk of not ensuring that use of its property benefits Arizona and the universities.” That includes any sort of guidance on how the board should document the economic and tax impacts of its policies.",
    "And Lyndel Manson, who chairs the Board of Regents, pointed out that the justices affirmed lower court rulings that the land where the hotel is being built “is and has long been tax-exempt state land.”\nManson also said that the hotel will benefit the university and mentioned that Omni will pay an estimated $120 million in rent.",
    "It makes it illegal for public agencies to “make any donation or grant, by subsidy or otherwise, to any individual, association or corporation.”\nBrnovich pointed out that ASU is paying $19.5 million to build the conference center even though the contract allows the school to use it without paying rent just seven days a year.",
    "And the attorney general said the school agreed to pay about $30 million to construct a 1,200-spot parking garage but will “gift” Omni 275 of the spots that the hotel gets to use exclusively and keep the revenue from the spaces, a move he contends is giving away the equivalent of $8 million.",
    "And what that means, according to Perry, is that the board “risks approving commercial lease agreements that allow a public resource to be used primary for private benefit.”\nJohn Arnold, the board’s executive director, said at the time there were new policies that address those issues.",
    "Brnovich did not wait too long before filing suit against the Board of Regents over an agreement to building a 330-room Omni hotel and a 30,000-square-foot conference center on land owned by Arizona State University, the Arizona Supreme Court said Tuesday.",
    "He called the deal “a model for future partnerships to advance community and higher education interests for the state of Arizona.”\nIt isn’t just Brnovich and the courts who have been looking into how Arizona universities make leases for commercial use.",
    "“It represents an economic development win for the city, an operational asset to the university and the sort of entrepreneurial focus state leaders and the Board of Regents have called upon our public universities to have,” he said.",
    "At the core of the lawsuit is the 2018 agreement between the regents and Omni to construct a new hotel, convention center and parking lot on land that ASU owns on the southeast corner of Mill Avenue and University Drive.",
    "Both the trial judge and the state Court of Appeals tossed the claim, concluding that Brnovich had waited too long because state laws generally say such claims need to be brought within a year.",
    "But she did not address the question the justices said needs to be resolved, like whether it was a good deal or whether the financial arrangement actually amounts to an illegal gift.",
    "“From the very beginning, we said this lawsuit is about protecting hardworking Arizonans by ensuring that taxpayer funds are not used for private business deals,” Brnovich said.",
    "Manson said the regents continue to insist those claims are “meritless.” And ASU President Michael Crow, in his own statement, said he believes the deal will pass legal muster.",
    "PHOENIX — Arizona Attorney General Mark Brnovich is going to get a chance to challenge a deal that he says illegally gives away taxpayer funds to benefit a private company.",
    "Closely related to the Gift Clause is the question of whether the lease portion of the deal is not for the “benefit of the state’’ but instead for the benefit of Omni.",
    "That deal gives Omni the option to lease the hotel and conference center property for 60 years and purchase the land at the end of that lease for a nominal fee.",
    "It also could alter or upend other arrangements that state universities have where they approve commercial leases of public property to private entities.",
    "Justice John Lopez, writing for the unanimous court, said state law gives Brnovich up to five years to pursue any claims of misspending of public funds.",
    "The justices said Brnovich was basing his claim on a provision in the Arizona Constitution which makes it illegal to transfer property to evade taxes.",
    "In prepared statements, each side claimed victory, focusing on the points they won and ignoring where the justices found fault with their arguments.",
    "But Lopez said there is a separate statute that gives the attorney general up to five years to file suit to recover illegally paid public monies.",
    "But Perry said her staff found those new policies wanting, missing things like how to determine if lease rental rates reflect fair market value.",
    "But in this case, they said, there was no such evasion as the land, owned by the regents, never was taxable in the first place.",
    "But Crow acknowledged that what the courts ultimately decide will have implications far beyond this specific arrangement.",
    "The other is the nature of the deal itself, and whether it violates the Gift Clause of the Arizona Constitution.",
    "And Manson also glossed over the fact that the $120 million she cites as a benefit is to be paid over 60 years.",
    "But that does not address the fact that the justices did not actually conclude the deal was illegal.",
    "What the courts ultimately decide, however, likely could affect more than this particular deal.",
    "That means Omni would not pay property taxes that otherwise would be due during the least term.",
    "And here the Supreme Court concluded that Brnovich has the authority to pursue those claims.",
    "The first is that because the property is owned by the regents, it is tax exempt.",
    "Construction is currently underway with a planned opening next spring.",
    "And that, he wrote, gives Brnovich a chance to have his day in court.",
    "Until now, however, Brnovich has been unable to even make his case.",
    "Instead, it sends the case back to a trial judge to hear evidence.",
    "But the decision does not mean that the deal is illegal.",
    "Brnovich argued there are two basic problems with that.",
    "That argument didn’t wash with the Supreme Court.",
    "That, however, is only part of the issue."
  ]
}