{
  "id": 1067,
  "mediaId": 2664,
  "date": "2022-04-04",
  "headline": "Arizona is leading the way on new anti-democratic laws fueled by Republican election lies",
  "image": "https://www.rawstory.com/media-library/arizona-gop-gov-doug-ducey.jpg?id=27835368&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/arizona-is-leading-the-way-on-new-anti-democratic-laws-fueled-by-republican-election-lies/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anushka Sarkar",
  "authorUrl": "https://www.rawstory.com/u/anushkasarkar-arizonamirror",
  "termIds": [
    1951,
    2201,
    2321,
    2405,
    80,
    878,
    4830,
    5245
  ],
  "sentences": [
    "The fact remains that these right-wingers have been further enabled by the likes of Donald Trump and Arizona Attorney General Mark Brnovich, both of whom spread the false gospel of Trump’s “Big Lie.”\nWith the U.S. Senate’s failure to pass voting rights legislation earlier this year, the voting rights fight has come to Arizona.",
    "At Fann’s behest, the Senate hired a small, unknown (and biased) firm out of Florida to “audit” 2.1 million ballots, and pro-Trump donors raised a whopping $5.7 million dollars to pay for this partisan, biased attempt to discredit Joe Biden’s victory.",
    "As our most recent presidential election proved, when every eligible voter is able to freely participate in our democracy, democracy thrives and we begin to see political power redistributed from a handful of wealthy, white elites to the 99 percent.",
    "That is why Arizonans, and Americans across the country, must urgently contact their elected representatives in their state legislatures and in Congress to tell them to protect our freedom to vote freely and fairly.",
    "Since 2020, Republicans in the Arizona legislature have been abusing their power to set up future efforts to overturn election results while the rest of the state is busy working to recover from the pandemic.",
    "Americans must not look away from what is happening in Arizona—all of us, from Phoenix to New York City, must heed Arizona’s warnings to ardently defend the freedom to vote in every city, county and state.",
    "As we witnessed first-hand in Arizona in 2020, fringe right-wing activists increasingly show up at polling sites in Black, Latino, and Native neighborhoods to intimidate voters without cause or authority.",
    "In Arizona, more than 80 percent of votes are regularly cast by mail-in ballot (with an estimated 89% doing so in 2020), and voting by mail has become increasingly popular in marginalized communities.",
    "Our freedom to vote is at risk in Arizona and across the nation, but a growing movement of voting rights advocates will not give up on the fight to protect our sacred right to vote and our democracy.",
    "Arizona Senate President Karen Fann, a big-time Trump supporter, used the power of her gavel to call for a partisan review of ballots in Maricopa County, the sixth largest county in the nation.",
    "As right-wing legislators are restricting access to the ballot for millions across the country, the nation’s most severe attack on our sacred freedom to vote is happening right here in Arizona.",
    "Because of that, there has been a slow but steady transformation in who holds power in Arizona — as the 2020 election showed, more everyday citizens are turning out and casting their ballots.",
    "It goes without saying that these right-wing attacks on the freedom to vote hurt Black, Latino, Native, senior, and disabled Arizonans most — and that is no accident.",
    "This increased turnout, thanks to mail-in voting, has made Arizona’s local and state governments increasingly representative of the true majority of eligible voters.",
    "Doug Ducey signed House Bill 2492, a bill that could potentially purge hundreds of thousands of Arizonans from the voter rolls and deny them the right to vote.",
    "This bill is one of several anti-democracy bills being pushed into law by Republican lawmakers in Arizona — and this phenomenon is neither new nor surprising.",
    "Fringe right-wing activists showed up and formed a 75-foot line outside of these polling sites to check ballots and scare off voters, without authority.",
    "Arizona Mirror is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "But in the wild, wild West, there were rumblings from the Arizona Republican Party about plans to undermine the legitimate election results.",
    "The tides of power are slowly shifting toward those of us who should have held it all along—isn’t that progress worth fighting for?",
    "But, it also means opponents of a fair and free democracy in Arizona are mobilizing quickly to reverse this progress.",
    "The 2020 election marked the highest voter turnout in American history, thanks in no small part to mail-in voting.",
    "Thanks to vote-by-mail, more senior, disabled, and working-class voters can cast their ballots freely and fairly.",
    "In 2020, communities from across Arizona exercised their right to vote and elected Joe Biden and Kamala Harris.",
    "To secure their grip on power, against the tides shifting democratically toward everyday citizens.",
    "Contact Editor Jim Small for questions: info@azmirror.com.",
    "Arizona has long been a battleground for democracy.",
    "Arizona Mirror maintains editorial independence.",
    "Follow Arizona Mirror on Facebook and Twitter.",
    "We are on the front lines.",
    "Last week, Gov.",
    "Why?"
  ]
}