{
  "id": 1099,
  "mediaId": 2644,
  "date": "2022-04-04",
  "headline": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/newspress-collage-21770873-1649088260350.png?w=1024",
  "link": "https://nypost.com/2022/04/04/gop-led-states-sue-to-stop-bidens-cdc-from-scrapping-title-42-border-policy/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Moore",
  "authorUrl": "",
  "termIds": [
    2201,
    2725,
    2936,
    3975,
    4624,
    200,
    878,
    5371
  ],
  "sentences": [
    "The suit from the three states noted that while the administration wants to revoke Title 42, it has “not seen fit elsewhere to act upon these improvements” in the pandemic situation by lifting mask mandates on domestic airline travel, loosening or repealing vaccination mandates, or ending what the AGs call a “relentless campaign” to discharge members of the military seeking religious exemptions for vaccine requirements.",
    "“?After considering current public health conditions and an increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC Director has determined that an Order suspending the right to introduce migrants into the United States is no longer necessary?,” the CDC said in its Friday announcement that the policy would be scrapped.",
    "“This suit challenges an imminent, man-made, self-inflicted calamity: the abrupt elimination of the only safety valve preventing this Administration’s disastrous border policies from devolving into an unmitigated chaos and catastrophe,” the GOP attorneys general of Arizona, Louisiana and Missouri wrote in the filing.",
    "Reps. Henry Cuellar and Vincente Gonzalez — both Texas Democrats — and a dozen Republican lawmakers from the Lone Star State wrote to Homeland Security Secretary Alejandro Mayorkas and Health and Human Services Secretary Xavier Becerra March 29 after reports first circulated that the end of Title 42 was imminent.",
    "The lawsuit also claims the CDC’s termination of Title 42 is illegal both because it violates the “notice-and-comments requirements” contained in the federal Administrative Procedure Act, and because it is “arbitrary and capricious” by failing to take into account how it will affect the states.",
    "Three GOP-led states have gone to court in a bid to stop the Biden administration from lifting the Trump-era Title 42 policy, claiming that ending the health order would cause a “self-inflicted calamity” ?by unleashing a surge of illegal immigration at the southern border.",
    "The ?Biden administration’s announced halt to Title 42 expulsions comes as hundreds of migrants travel north through Mexico, raising fears that a wave of up to 170,000 people might converge on the US border this spring, traditionally the peak period for crossings.",
    "The Centers for Disease Control and Prevention announced Friday that it would end the policy allowing border officials to expel migrants who attempt to enter the US from a country where a communicable disease — such as COVID-19 — is present, effective May 23.",
    "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General Mark Brnovich ?told ?”?Fox & Friends” Monday.",
    "“We understand that this legal authority is temporary and tied to the COVID-19 public health emergency, but DHS appears unprepared to handle a likely unprecedented increase in apprehensions along the southwest border,” ?the Texans wrote in the letter.",
    "Republican and Democratic lawmakers have called on the Biden administration to rethink halting the order because they fear the administration is unprepared for the onslaught of migration it would unleash.",
    "Under the Trump administration, 83% of migrant encounters at the border led to expulsions, compared to just 55% under the Biden administration, the DC-based nonprofit think tank said.?",
    "Kyrsten Sinema and Mark Kelly, both Democrats from Arizona, and Sen. Joe Manchin, a Democrat from West Virginia, also wrote letters last week expressing similar concerns.",
    "?”I’m doing everything I can to hold the Biden administration accountable and stop them from destroying our southern border?,” he added.",
    "Title 42 was introduced in March 2020 as the Trump administration dealt with the onset of the coronavirus pandemic in the US.",
    "Title 42 has been used to remove migrants more than 1.7 million times, according to the Migrant Policy Institute.",
    "?seemingly the only COVID-19-based restriction the Administration sees fit to end?,” the filing says.",
    "?”?The Title 42 Revocation thus stands as a radical outlier?",
    "The suit was filed on Sunday in federal court in Louisiana.",
    "Sens.",
    "?—?",
    "?",
    "?"
  ]
}