{
  "id": 1157,
  "mediaId": 2664,
  "date": "2022-04-01",
  "headline": "Here's how the far right is trying to seize control of the environmentalist movement",
  "image": "https://www.rawstory.com/media-library/photography-of-tall-trees-at-daytime.jpg?id=28166603&width=1200&coordinates=0%2C408%2C0%2C408&height=600",
  "link": "https://www.rawstory.com/right-wing-environmentalism/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    2717,
    2725,
    3340,
    4079,
    984
  ],
  "sentences": [
    "On Friday, NPR delved into how the far-right has become dominant in certain sectors of the environmentalist movement to form \"eco-fascism\" — a counterintuitive proposition, as environmentalism has been commonly associated with left-wing activism and its opponents conservative elements of big business.",
    "Even some pro-Trump politicians are using environmental justifications for their agenda, like Arizona Attorney General and Senate candidate Mark Brnovich, who has argued for the former president's border wall plan as a means of preventing migrants from leaving trash in the desert.",
    "As the report noted, some right-wing domestic terrorists have cited environmental grievances for years — one of the most prominent being the gunman who traveled to El Paso, Texas and committed a deadly mass shooting at a shopping center in 2019.",
    "Nor is any of this new, noted the report: according to Yale professor David Taylor, the early environmentalist movement in America used the preservation of natural beauty as a justification for expelling Native American tribes.",
    "And to preserve them, Native people must be removed, the lands taken from them and put under federal or state protection ... so this is where the language of preservation really crosses over into this narrative of exclusion.'\"",
    "\"On the podcast 'The People's Square,' a musician who goes by Stormking described his vision for a far-right reclamation of environmentalism,\" reported Ari Shapiro, Matt Ozug, and Casey Morell.",
    "\"'We see a taking of Native American lands to turn into park spaces that are described as empty, untouched by human hands, pristine, to be protected,' Taylor said.",
    "\"'Right-wing environmentalism in this country is mostly — especially in more modern times — an untried attack vector,' Stormking said.",
    "In fact, he argued, some white environmental activists contrasted the beauty of nature with \"race-mixing\" in U.S. cities of the time.",
    "\"The problem is visible now – and there is time to address it, but the longer people wait, the harder it's going to be.\"",
    "\"The decimation of the environment is creating a massive burden for future generations,\" he wrote in his manifesto.",
    "\"In that way, the threat of eco-fascism has something in common with climate change itself,\" concluded the report.",
    "'Environmental leaders are very, very at fault for setting up this narrative around, you know, untouched spaces.",
    "\"If we can get rid of enough people, then our way of life can be more sustainable.\"",
    "'And it has legs, in my opinion.'\"",
    "Stories Chosen For You"
  ]
}