{
  "id": 1193,
  "mediaId": 2557,
  "date": "2022-04-04",
  "headline": "NEWS ALERT: Three GOP states sue over end of Title 42",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1309145314-e1617899591278-1.jpg",
  "link": "https://dennismichaellynch.com/news-alert-three-gop-states-sue-over-end-of-title-42/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2104,
    2725,
    3975,
    200,
    404,
    878,
    5159
  ],
  "sentences": [
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by TheHill.com:\nThree states on Monday sued the Biden administration over its plans to rescind Title 42, a Trump-era order that allows the U.S. to rapidly expel migrants who have crossed the border to seek asylum.",
    "— Eric Schmitt (@Eric_Schmitt) April 4, 2022\nIt begins: Republican officials in Arizona, Louisiana and Missouri over the weekend filed a lawsuit against the Biden administration’s plan to wind down Title 42 by May 23, asking a federal judge to block the termination of the Trump-era border expulsions.",
    "The article goes on to state the following:\nThe suit seeks to block the lifting of Title 42 by arguing the Centers for Disease Control and Prevention (CDC), which issued the order, violated the Administrative Procedures Act by failing to allow for a comment period on its revocation.",
    "“I’m doing everything I can to hold the Biden administration accountable and stop them from destroying our southern border.”\nLink to the new lawsuit by Arizona, Louisiana and Missouri:https://t.co/xyQjKsHk7p\n— Camilo Montoya-Galvez (@camiloreports) April 4, 2022\n?",
    "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General Mark Brnovich told Fox News on Monday.",
    "“This suit challenges an imminent, man-made, self-inflicted calamity: the abrupt elimination of the only safety valve preventing this administration’s disastrous border policies from devolving into an unmitigated catastrophe,” the complaint read.",
    "?BREAKING: Missouri, Arizona, and Louisiana have just filed a lawsuit against the Biden Administration for rescinding Title 42 amidst one of the worst border crises in decades.",
    "Missouri, Arizona and Louisiana filed the suit after the Biden administration on Friday announced it would lift the order on May 23.",
    "pic.twitter.com/YuBJkcQO73\n— Camilo Montoya-Galvez (@camiloreports) April 4, 2022\nListen to the latest daily DML podcasts below!",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "To get more information about this article, please visit TheHill.com.",
    "Then please share."
  ]
}