{
  "id": 1210,
  "mediaId": 2658,
  "date": "2022-04-09",
  "headline": "Republicans see CDC’s policy change as ‘massive political loser for Democrats’",
  "image": "https://static.politico.com/49/f4/4bf50ff24ca99846b0c31bd732f4/election-2022-texas-abbott-82213.jpg",
  "link": "https://www.politico.com/news/2022/04/09/cdc-policy-change-political-loser-democrats-00024219",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1907,
    3885,
    4119,
    4474,
    4777,
    305,
    878,
    1171,
    5351
  ],
  "sentences": [
    "… The fact that we’re seeing a growing chorus of border state Democrats and Republicans speaking up more and more forcefully tells me such a plan is not currently in place.”\nDemocratic lawmakers, public health experts and immigration advocates have long argued that the policy is illegal and does nothing to stop the spread of Covid-19.",
    "The announcement coincided with the Biden administration’s plea to Congress for billions more to bolster Covid-19 testing, vaccine supplies and therapeutics, as well as their warnings that the highly transmissible Omicron subvariant BA.2 is spreading fast within the U.S. — a mixed message Republicans were quick to highlight.",
    "“With the flood of illegal drugs like fentanyl and increased human trafficking and smuggling coming across the border, every state is affected by the Biden Administration’s porous border and lax border policies.”\nOn Thursday, Texas Attorney General Ken Paxton announced he also plans to challenge the CDC order under the APA.",
    "| Eric Gay/AP Photo\nBy Alice Miranda Ollstein and Krista Mahr\n 04/09/2022 07:01 AM EDT\nRepublicans are pouncing on the Biden administration’s recent decision to scrap a Trump-era pandemic border policy, launching a multi-pronged attack against Democrats in Congress, in the courts and on the campaign trail.",
    "The effort speaks to a broad belief among Republicans that the Title 42 decision can focus voters’ attention on one of Democrats’ longstanding political vulnerabilities — immigration — and help them secure statehouses, take back control of Congress and stifle the president’s agenda over the next two years.",
    "Christopher Hajec, director of litigation at the Immigration Reform Law Institute in Washington, D.C., and outside counsel for the state of Texas in the case, told POLITICO the administration’s decision to end Title 42 is “arbitrary and capricious” and runs counter to its other Covid mitigation mandates.",
    "And late last week, several Democrats from swing states, many of them running for reelection this November, joined with Republicans on a bill that would keep the restriction in place until at least 60 days after the federal government terminates the national emergency declaration for Covid-19.",
    "In the House, dozens of Republicans led by the conservative Freedom Caucus took to the floor on Wednesday to demand a vote to reinstate Title 42, arguing doing so would “protect all Americans from Biden’s border crisis.” Other Republicans are demanding oversight hearings.",
    "It is, they say, an anti-immigration measure that strips migrants of their right under international law to apply for asylum in the U.S. Over 1.7 million migrants have been expelled under the order since it was enacted in 2020, the vast majority under President Joe Biden.",
    "Republicans’ national campaign arms, as part of their strategy to take back the House and Senate in November’s midterms, have signaled a new push to highlight the policy in their outreach to voters, particularly in swing states and districts near the U.S.-Mexico border.",
    "Senate Republicans on Tuesday blocked $10 billion in Covid aid from moving forward until they’re guaranteed a vote on an amendment that would reinstate Title 42 — a move Democrats leaders are keen to avoid as it would highlight divisions in their caucus over the issue.",
    "“The best way to get the cases back up is to let in huge numbers of people.”\nArguing that a federal pandemic mitigation measure should remain in place is a departure for all four attorneys general, who have sued the Biden administration over vaccine and mask mandates.",
    "Lawmakers and Republican strategists are openly discussing tying the policy change to a range of other concerns voters associate with the border, from the smuggling of fentanyl and other drugs to violent crime to the spread of communicable diseases besides Covid.",
    "“They attack President Biden on the border and on immigration saying that he’s doing nothing, then they turn around with the repeal of Title 42 and say that he needs to restore what he was doing because it was working,” said Rep. Veronica Escobar (D-Texas).",
    "On April 3, the Republican attorneys general of Arizona, Missouri and Louisiana sued the Biden administration for ending the order, alleging that it violated the Administrative Procedure Act by failing to conduct the required comment and notice process.",
    "“They cannot have it both ways.”\nBut some Democratic strategists fear the White House — in pledging to end the policy in May — is handing Republicans an easy talking point ahead of a historically tough election for the president’s party.",
    "Earlier this month, three Republican attorneys general filed a lawsuit arguing it’s illegal for the administration to rescind the CDC’s Title 42 policy, which allows for the expulsion of migrants to stop the spread of Covid-19.",
    "The CDC announced on April 1 that it would stop expelling migrants on May 23, saying that allowing them into the U.S. immigration system no longer poses a threat to Americans’ health as Covid-19 cases and hospitalizations drop.",
    "A recent Morning Consult-POLITICO poll shows that 56 percent of all voters disagreed with Biden’s decision to sunset the policy, making it his least popular policy decision to date, according to Morning Consult’s tracking.",
    "“Republicans, who have openly opposed public health measures like mask mandates, are clearly in favor of Title 42 because they view it as an immigration restriction.”\nThe GOP is also pressing the issue in federal court.",
    "“It’s utterly insane that the administration claims to be concerned about Covid at the same time they’ve decided to throw open the doors to illegal aliens who are Covid positive,” Sen. Ted Cruz (R-Texas) told POLITICO.",
    "“The lack of policy details is causing big political challenges for our party,” said John LaBombard, a political strategist at ROKK Solutions and recent senior staffer to Sen. Kyrsten Sinema (D-Ariz.).",
    "They argued lifting the order threatens states with the costs of a potential surge in migration and called it “plainly at war” with the government’s other Covid-19 protocols.",
    "Really, no matter where you are, this touches on the safety issues that independent voters list as one of their top concerns.”\nThe issue has also rocked Capitol Hill.",
    "“I’m sure [Democrats] don’t want to vote on it because it may make a difference on whether they’re a senator or not in the future,” said Sen. Mike Braun (R-Ind.",
    "Circuit ruled that it is illegal for the administration to use Title 42 to expel migrant families back to places where they might face persecution and torture.",
    "If the CDC is mandated to continue Title 42 by another court, the ACLU, which represented the families in the D.C. case, has said it will fight that decision.",
    "“When I heard that the administration was going to stop Title 42, my first thought was, ‘When you’re in a hole, stop digging,’” said GOP pollster Whit Ayres.",
    "And in places like Colorado, where we have a lot of House and Senate races, there’s been a lot of debate over fentanyl sentencing, so we can link it to that.",
    "Many Democrats argue that these are bad-faith attacks that are holding up key Covid aid while hundreds of Americans still die every day from the virus.",
    "“This is a massive political loser for Democrats,” said Zack Roday, a Virginia-based GOP strategist who works on campaigns around the country.",
    "“The administration has a real opportunity to ensure that when Title 42 is lifted there is a plan in place that’s more than lip service.",
    "Among their arguments was that the administration failed to evaluate the impact on states if there’s a surge in border crossings.",
    "No matter the outcome, GOP strategists say the Republican campaign reflects what voters want and will ramp up in the weeks ahead.",
    "Both Missouri Attorney General Eric Schmitt and Arizona Attorney General Mark Brnovich are running for the Senate in November.",
    "“In border states we have an opportunity to talk about it in a localized way because it’s so relevant to those communities.",
    "“It makes no sense.”\nSen. Bob Menendez, who has been calling for the end of Title 42, says such attacks are disingenuous.",
    "), who supports the additional Covid money, agreed with Braun’s assessment, calling Title 42 “kryptonite” for Democrats.",
    "Even a year ago, when Joe Biden had majority job approval, his approval on immigration was somewhere around 40 percent.",
    "Amid the stalemate, the chamber punted consideration of the critical funding until after Congress’ two-week recess.",
    "“The CDC has relaxed multiple pandemic orders in the past few months,” he said in a statement to POLITICO.",
    "If the courts rule in favor of the states in either case, it could set off a complicated legal battle.",
    "The policy change has also shot to the forefront in individual campaigns, including Texas Gov.",
    "The policy change has shot to the forefront in individual campaigns, including Texas Gov.",
    "), one of the lawmakers demanding the amendment vote in exchange for approving Covid aid.",
    "Louisiana Attorney General Jeff Landry’s office did not respond to requests for comment.",
    "Greg Abbott’s attempt to beat back a challenge from former Rep. Beto O’Rourke.",
    "Greg Abbott’s attempt to beat back a challenge from former Rep. Beto O’Rourke.",
    "“Every state is now a border state,” Schmitt said in a statement to POLITICO.",
    "“The administration is incredibly vulnerable on the whole immigration issue.",
    "“The numbers of people coming in are going to be staggering,” Hajec said.",
    "Last month, the U.S. Court of Appeals for the D.C.",
    "This latest step throws fuel on the fire.”",
    "Brnovich declined to comment.",
    "Sen. Roy Blunt (R-Mo."
  ]
}