{
  "id": 1364,
  "mediaId": 2790,
  "date": "2022-04-01",
  "headline": "The far-right and environmentalism overlap is bigger than you think — and growing",
  "image": "https://media.npr.org/assets/img/2022/04/01/gettyimages-1074282038-edit_wide-f769a8da454e9cd82c2690690307b01cda77a4d1.jpg?s=1400",
  "link": "https://www.npr.org/2022/04/01/1089990539/climate-change-politics",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Casey Morell",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"We need to be educating our base about these dystopian ideas and the scapegoating that's being put upon Black, indigenous and people of color and working-class communities, such that they're able to identify these messages that may sound like they're environmental, but we need to be able to discern that they're actually very racist,\" Hopkins said.",
    "The history of the environmental movement is colored by white supremacy\nDorceta Taylor is a professor at Yale University and author of The Rise of the American Conservation Movement: Power, Privilege, and Environmental Protection.",
    "\"I wish people like, you know, the environmentalists cared half as much about human beings and what's going on in Arizona as they do, or they supposedly do, about plant and wildlife, Brnovich said in an interview with KTAR News.",
    "And to preserve them, Native people must be removed, the lands taken from them and put under federal or state protection ... so this is where the language of preservation really crosses over into this narrative of exclusion.\"",
    "Taylor read the notes and diaries of early American environmentalists and learned that the movement to preserve natural spaces in the U.S. was partly motivated by a backlash against the racial mixing of American cities.",
    "At first glance, the modern environmental movement and the far-right movement – including anti-immigrant and white supremacist groups – might appear to be on opposing sides of the political ideology spectrum.",
    "When environmentalism and right-wing politics align\nOn the podcast \"The People's Square,\" a musician who goes by Stormking described his vision for a far-right reclamation of environmentalism.",
    "It's common to come across people who say they believe in the environmental movement and the racial justice movement, but don't believe the movements have anything to do with each other.",
    "Because as climate change increases, more people will go looking for some narrative to address their fears of collapse, says Professor Emerita Betsy Hartmann of Hampshire College.",
    "\"The idea that natural purity translates into racial or national purity – that was one that was very central to the Nazis' environmental discourse of blood and soil,\" Taylor said.",
    "\"We know that there's information out there that says that every time someone crosses the border, they're leaving between six and eight pounds of trash in the desert,\" he said.",
    "\"We see a taking of Native American lands to turn into park spaces that are described as empty, untouched by human hands, pristine, to be protected,\" Taylor said.",
    "\"It was very much based on this idea of nature as a violent competitive and ultimately very hierarchical domain where, you know, white Europeans were at the top.",
    "\"As climate change kind of turns up the heat, there's going to be all sorts of new kinds of political contestations around these issues,\" Alex Amend said.",
    "We're actively going to do the responsible thing and begin to address it,\" said Hop Hopkins, the Sierra Club's director of organizational transformation.",
    "\"If you have this apocalyptic doomsday view of climate change, the far-right can use that doomsday view to its own strategic advantage,\" Hartmann said.",
    "He claimed that the Biden administration's decision to stop building the border wall was a violation of the National Environmental Policy Act.",
    "The word \"ecology\" was even coined by a German scientist, Ernst Haeckel, who also contributed to the Nazis' ideas about a hierarchy of races.",
    "Organizations are confronting their exclusionary pasts\nThe connections between environmentalism and xenophobia in the U.S. are long and deep.",
    "He titled that manifesto, \"An Inconvenient Truth,\" which was also the name of Al Gore's Oscar-winning 2006 documentary about climate change.",
    "Environmental politics are not always left-leaning\nThis strain of anti-immigrant environmentalism may be growing today — but it isn't new.",
    "\"Right-wing environmentalism in this country is mostly – especially in more modern times – an untried attack vector,\" Stormking said.",
    "Researchers say this intersection between the far-right and environmentalism is bigger than many people realize – and it's growing.",
    "In the 90s when Taylor started reading books about the environmental movement, he stumbled upon some ideas that seemed very wrong.",
    "In recent years, some prominent groups, including the Sierra Club, have begun to publicly confront their own exclusionary history.",
    "In fact, in 1998 and again in 2004, anti-immigrant factions tried to stage a hostile takeover of the Sierra Club's national board.",
    "They failed, but the organization learned a lesson from those experiences — you can't just ignore these ideas or wish them away.",
    "Conservative leaders – from Rush Limbaugh to former President Donald Trump – have certainly denied climate change in the past.",
    "Taylor was kind of horrified to learn that in some ways, the environmental movement was founded on ideas of white supremacy.",
    "The problem is visible now – and there is time to address it, but the longer people wait, the harder it's going to be.",
    "\"And this discomfort around racially mixed neighborhoods infuses the discourse of those early conservation leaders.\"",
    "Brnovich argued that because migrants leave trash in the desert, a border wall is needed to protect the environment.",
    "\"White elites, especially white male elites, wanted to leave the spaces where there was racial mixing,\" she said.",
    "\"Environmental leaders are very, very at fault for setting up this narrative around, you know, untouched spaces.",
    "Mainstream environmental organizations take the opposite view — that a wall will harm ecosystems on the border.",
    "\"There is this earlier very nativist, exclusionary and racist history of environmental thought,\" Taylor said.",
    "In the 20th century, the group embraced racist ideas that overpopulation was the root of environmental harm.",
    "\"The decimation of the environment is creating a massive burden for future generations,\" the shooter wrote.",
    "Taylor's research helped reveal parts of American environmental history that had not been widely known.",
    "In El Paso, Texas, in 2019, a mass shooter killed more than 20 people and wounded more than 20 others.",
    "\"Attack vector\" is an apt choice of words because this ideology has been used in literal attacks.",
    "Last July, Arizona Attorney General Mark Brnovich filed a lawsuit against the federal government.",
    "Anti-immigrant environmental arguments pop up in more official places too – like court filings.",
    "And that brings up another misconception — that environmental politics are always left-leaning.",
    "But today, a different argument is becoming more common on the conservative political fringe.",
    "In that way, the threat of eco-fascism has something in common with climate change itself.",
    "That work goes beyond identifying the racism and bigotry in the environmental movement.",
    "And two that environmental politics are always going to be left-leaning,\" Amend said.",
    "\"If we can get rid of enough people, then our way of life can be more sustainable.\"",
    "He says once you start to look at this overlap, you find two big misconceptions.",
    "The truth is, eco-fascism has a long history, both in the U.S. and in Europe.",
    "It also means articulating a vision that can compete with eco-fascism.",
    "Amend used to track hate groups at the Southern Poverty Law Center.",
    "\"We're not just going to pretend that the problem's not happening.",
    "Blair Taylor is a researcher at the Institute for Social Ecology.",
    "That disbelief is why Hopkins said he does the work he does.",
    "He said even the Nazis saw themselves as environmentalists.",
    "\"One that the right is always a climate denialist movement.",
    "So that's been rediscovered, I think, by the alt-right.\"",
    "A federal judge ultimately tossed out Brnovich's case.",
    "The organization went through its own transformation.",
    "This history applies to the United States, too.",
    "He told authorities he was targeting Mexicans.",
    "These days he researches eco-fascism.",
    "\"That trash is a threat to wildlife.",
    "It's a threat to natural habitats.\"",
    "\"And it has legs, in my opinion.\"",
    "He also left behind a manifesto.",
    "But overlap does exist."
  ]
}