{
  "id": 1397,
  "mediaId": 2553,
  "date": "2022-04-04",
  "headline": "‘Pushing Back’: GOP States File Lawsuit Against Biden Administration’s End Of Title 42 Border Policy",
  "image": "https://dw-wp-production.imgix.net/2022/04/Untitled-design-21-copy-6.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/pushing-back-gop-states-file-lawsuit-against-biden-administrations-end-of-title-42-border-policy",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dillon Burroughs",
  "authorUrl": "https://www.dailywire.com/author/dillon-burroughs",
  "termIds": [
    0
  ],
  "sentences": [
    "Such crimes disproportionately afflict illegal aliens, and these crimes (and other crimes committed by illegal aliens) impose irreparable law-enforcement and criminal-justice costs on Missouri.”\nThe Centers for Disease Control and Prevention (CDC) announced on Friday that it will terminate the Title 42 public health policy that allows border officials to turn away migrants because of the COVID-19 pandemic.",
    "“After considering current public health conditions and an increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC Director has determined that an Order suspending the right to introduce migrants into the United States is no longer necessary,” the CDC said in a statement on Friday.",
    "Missouri has been a leader in pushing back on the Biden Administration’s failure at the border, and we filed suit against the cancellation of the ‘Remain in Mexico’ Policy and also filed suit to force the Biden Administration to build the Southwest border wall.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "Missouri Attorney General Eric Schmitt, Arizona Attorney General Mark Brnovich, and Louisiana Attorney General Jeff Landry are suing the Biden Administration for ending Title 42 during the worst border crisis in decades.",
    "“The U.S. Department of Homeland Security, (DHS), estimates getting rid of Title 42 will result in as many as 18,000 migrants per day – which could mean 540,000 migrants in a single month,” Schmitt wrote.",
    "The three leaders argue that the end of the policy will create an unprecedented surge at the southern border and overwhelm law enforcement agencies and non-governmental organizations.",
    "“Time and again, the Biden Administration has failed to act to secure our Southern border and have terminated successful programs like Title 42 and the ‘Remain in Mexico’ Policy.",
    "… Missouri is also a destination state and hub for human-trafficking crimes within the United States, due to its situation at the confluence of several major interstate highways.",
    "The three Republican leaders claim the rollback of the health policy will lead to an unprecedented crisis at the southern border that will have a devastating impact nationwide.",
    "The end of the policy is scheduled to be “implemented on May 23, 2022, to enable DHS time to implement appropriate COVID-19 mitigation protocols,” according to the statement.",
    "“Today, Missouri, Arizona, and Louisiana filed suit against the Biden Administration for rescinding Title 42 amid one of the worst border crises in this country’s history.",
    "The Trump-era policy has been in effect since March 2020 to turn away thousands of migrants in an effort to reduce the spread of COVID-19.",
    "Based on recent statistics, approximately 56 out of every 1,000 unlawful aliens who enter the United States end up residing in Missouri.",
    "Title 42 is a crucial tool for controlling the influx of illegal aliens at our Southern border,” Schmidtt said in a statement on Monday.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "If the Biden Administration won’t take proactive steps to secure our border and protect our citizenry, we certainly will,” he added.",
    "The lawsuit states, “Missouri is directly and adversely affected by increases in illegal immigration at the southern border.",
    "The statement announcing the lawsuit claimed the change could lead to more than a half-million migrants per month.",
    "Become a member now and join our mission.",
    "Believe the same?"
  ]
}