{
  "id": 1430,
  "mediaId": 2591,
  "date": "2022-04-04",
  "headline": "Republican States Sue Biden to Stop End to Title 42",
  "image": "https://humanevents.com/wp-content/uploads/2021/08/iStock-889715526-1024x683.jpg",
  "link": "https://humanevents.com/2022/04/04/republican-states-sue-biden-to-stop-end-to-title-42/",
  "mediaOutlet": "humanevents.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Human Events Staff",
  "authorUrl": "https://humanevents.com/author/courtney",
  "termIds": [
    2201,
    2725,
    3975,
    878
  ],
  "sentences": [
    "The attorneys general argue that the end of the order will result in a number of higher costs for the states, including higher health care costs for illegal migrants infected with COVID-19 and “the presence of much greater numbers of paroled aliens with non-meritorious asylum claims …”\n“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” Arizona Attorney General Mark Brnovich said.",
    "Indeed, Attorneys General in Arizona, Louisiana and Missouri filed the lawsuit in the U.S. District Court Western District of Louisiana Lafayette Division, Just the News reports\nTrump activated the 1940s law around the beginning of the pandemic and while many believed the policy would eventually be deactivated, they also argue that the current administration still has no plan to address the surge of migrants at the border.",
    "“This suit challenges an imminent, man-made, self-inflicted calamity: the abrupt elimination of the only safety valve preventing this administration’s disastrous border policies from devolving into an unmitigated catastrophe,” the lawsuit reads.",
    "As previously reported by Human Events News, the Trump-era policy allowed for the rapid expulsion of migrants at the border without giving them the option to seek asylum and was used during the pandemic in efforts to keep case numbers down.",
    "Three Republican-led states on Monday announced a lawsuit against the Biden administration to prevent the end of Title 42.",
    "“It’s a ridiculously poor decision with a bad intention for border states and American communities across the country.",
    "This administration’s reckless pandering to the far Left.”"
  ]
}