{
  "id": 1593,
  "mediaId": 2664,
  "date": "2022-04-07",
  "headline": "Morning Joe hammers GOP 'freaks' still clinging to Trump's election lies",
  "image": "https://www.rawstory.com/media-library/trump-s-political-future-in-limbo-because-he-can-t-let-go-of-2020-loss.jpg?id=29651329&width=1200&coordinates=0%2C23%2C0%2C57&height=600",
  "link": "https://www.rawstory.com/morning-joe-hammers-gop-freaks-still-clinging-to-trump-s-election-lies/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    1820,
    2201,
    2725,
    3975,
    654,
    878,
    5128
  ],
  "sentences": [
    "Arizona attorney general Mark Brnovich issued a report Wednesday that found no evidence of widespread voter fraud or irregularities in Maricopa County, despite Trump's persistent pressure campaign to justify his false claims about his election loss, and the \"Morning Joe\" host said he's had enough.",
    "Federal and state officials, and multiple courts, found the election was safe and secure and President Joe Biden legitimately won, but the former president and his supporters continue believe otherwise -- even when their own efforts fall flat.",
    "The Maricopa County Republicans that ran the office were, let's just say, a little curt when some of these freaks in the legislature, these freaks running for statewide office that have all of these bizarre conspiracy theories.",
    "MSNBC's Joe Scarborough on Thursday ripped conservative \"freaks\" who continue to believe the 2020 election was stolen from Donald Trump.",
    "I've got friends who believe the most bizarre -- by the way, highly educated people -- they don't want to know the truth.",
    "\"I'm not trying to be funny here, this literally has happened time and time and time again,\" Scarborough said.",
    "\"Even Cyber Ninjas, at the end of their slanted review, ended up giving Biden more votes,\" Scarborough said.",
    "The truth is in front of them, the truth has been in front of them, yet it continues.\"",
    "Watch below:\nTrump's political future 'in limbo' because he can't let go of 2020 loss",
    "\"You are going up against people who don't want to listen to facts,\" he added.",
    "\"You have friends who believe Italians, you know, had lasers.",
    "They've looked at this time and time and time again.\"",
    "\"We have a Republican says nothing's there."
  ]
}