{
  "id": 1680,
  "mediaId": 2591,
  "date": "2022-04-08",
  "headline": "Arizona AG: ‘Serious Vulnerabilities’ in Maricopa County ‘Raise Questions’ About 2020 Election",
  "image": "https://humanevents.com/wp-content/uploads/2021/10/C9755460-0AA0-4EA0-A73C-2FA19CF58F6E-1024x520.jpeg",
  "link": "https://humanevents.com/2022/04/08/arizona-ag-serious-vulnerabilities-in-maricopa-county-raise-questions-about-2020-election/",
  "mediaOutlet": "humanevents.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Human Events Staff",
  "authorUrl": "https://humanevents.com/author/courtney",
  "termIds": [
    2405,
    2725,
    4830,
    5128
  ],
  "sentences": [
    "https://t.co/Pgogo9A7uO\nAs reported by Just the News, Brnovich cited problems including:\nelection officials having on average less than five seconds to verify early voting ballot signatures\n“multiple violations” in the handling and delivery to election offices of about 20 percent of ballots in drop boxes\nalmost $8 million in private grant money used by election officials in the vote count, donations which would now be illegal under a recently enacted law\nHe reported that he found it difficult to get county officials to cooperate with his requests for information and revealed that his office’s Election Integrity Unit “has uncovered instances of election fraud by individuals who have been or will be prosecuted for various election crimes.”\n“[F]undamentally, one of the greatest threats to election security and integrity is mail-in ballots and the handling of mail-in ballots,” Brnovich told Just the News.",
    "Arizona Attorney General Mark Brnovich released a report citing “serious vulnerabilities that must be addressed and raise questions about the 2020 election in Arizona.”\nIndeed, the report issued to the state Senate highlighted controversial management of the election in Maricopa County.",
    "Literally, the worst president in [the] history of the United States before Joe Biden — Jimmy Carter —literally said the same thing, you know, 17 years ago.",
    "In the report, delivered Wednesday to President of the Arizona state Senate Karen Fann, Brnovich found “problematic system-wide issues” with early ballots.",
    "We can report that there are problematic system-wide issues that relate to early ballot handling and verification.",
    "And it’s amazing how now the left and the Democrats don’t seem to care about election integrity.”",
    "I just dropped off our initial review of the 2020 election audit to President Fann.",
    "“And don’t just take my word for it."
  ]
}