{
  "id": 1704,
  "mediaId": 6503,
  "date": "2022-04-05",
  "headline": "GOP-Led States Sue to Prevent Biden from Canceling Immigration Rules and Pushing Wide Open Border Policy",
  "image": "",
  "link": "https://ipatriot.com/gop-led-states-sue-to-prevent-biden-from-canceling-immigration-rules-and-pushing-wide-open-border-policy/",
  "mediaOutlet": "ipatriot.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Warner Todd Huston",
  "authorUrl": "https://ipatriot.com/author/warnertoddhuston/",
  "termIds": [
    2201,
    3975,
    200,
    878,
    1146,
    5159
  ],
  "sentences": [
    "The attorneys general argue in the suit – whose plaintiffs include the Centers for Disease Control and Prevention – that the termination of the order will result in a number of higher costs for the states, including higher health care costs for illegal migrants infected with COVID-19 and “the presence of much greater numbers of paroled aliens with non-meritorious asylum claims … .”\nBiden has been under pressure from his Democrat Party to end Title 42 enforcement, particularly its most liberal wing.",
    "Per Just the News:\n“This suit challenges an imminent, man-made, self-inflicted calamity: the abrupt elimination of the only safety valve preventing this administration’s disastrous border policies from devolving into an unmitigated catastrophe,” reads the suit.",
    "“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” said Arizona Attorney General Mark Brnovich.",
    "A group of Republican-led states have joined to sue Joe Biden to stop him from ending Title 42 and essentially throwing the border wide open to be flooded by millions of illegals.",
    "On Monday, the attorneys general from Arizona, Louisiana, and Missouri filed a suit in the Lafayette Division of the U.S. District Court, Western District of Louisiana.",
    "This administration’s reckless pandering to the far Left.”\nLast week, the Biden administration announced it would be ending the application of Title 42 on May 23.",
    "Many have expected the rule to be ended as COVID recedes, conservatives fear that all it will do is open the floodgates that have been only partially closed.",
    "The suit aims to stop Biden from dumping the 1940s era law that Trump reinitiated to stop illegals from coming in and spreading the COVID virus.",
    "“It’s a ridiculously poor decision with a bad intention for border states and American communities across the country.",
    "Follow Warner Todd Huston on Facebook at: facebook.com/Warner.Todd.Huston\nTags: Commentary Illegal Aliens Joe Biden",
    "Biden has claimed that he will put other provisions in place to mitigate illegals with COVID.",
    "But, no one believes him, really."
  ]
}