{
  "id": 1755,
  "mediaId": 2664,
  "date": "2022-03-31",
  "headline": "Fake Trump electors are getting new attention from the Justice Department and a grand jury: report",
  "image": "https://www.rawstory.com/media-library/msnbcs-katy-tur-baffled-by-trump-teams-legal-antics-what-the-heck-is-rudy-giuliani-doing-being-involved-in-this.jpg?id=24810385&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/trump-fake-electors-subpoena/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    1303,
    2201,
    2422,
    2725,
    370,
    878,
    1132,
    4830,
    4984
  ],
  "sentences": [
    "\"Until recently, prosecutors were almost exclusively bringing cases against alleged rioters and some members of extremist groups accused of conspiring to disrupt the certification of the 2020 presidential election.",
    "They asked for any information about elected officials from the legislative and executive branches involved in the \"planning or execution\" of the rally, but also of the attempt to stop the Electoral College count.",
    "The Justice Department has been inundated with cases involving those who attacked the U.S. Capitol on Jan. 6, 2021, but the pro-Trump conspiracies around the 2020 election are also getting increased scrutiny.",
    "An expanded inquiry into the rally and fake electors represents a new stage of the investigation that looks into a more well-connected political circle,\" said the story.",
    "CNN.com reported Thursday that the DOJ is moving forward with the probe into those who falsified documents attempting to change electors ahead of the Jan. 6 count.",
    "Former federal prosecutor Glenn Kirschner walked through the reasons that those involved could be charged for their attempts to defraud the government.",
    "In Michigan, however, the attorney general referred the fake electors to the Justice Department, saying there was enough evidence for a federal probe.",
    "There was another subpoena that involved information about \"VIP attendees\" to the rally and those who were allowed to be closer to the stage.",
    "The Justice Department revealed in Jan. that they were looking into the referrals from the state attorneys general.",
    "Subpoenas have now been issued from the grand jury for the probe into the fake electors, the CNN report explained.",
    "There were also ties between those electors to large conservative groups like ALEC, and the Federalist Society.",
    "In Arizona, a group of fake electors used the official seal of the state of Arizona, which is against the law.",
    "Republican Attorney General Mark Brnovich, a Donald Trump ally, has refused to charge anyone in the case.",
    "Other subpoenas being issued include those who were doing higher-level organizing for the Jan. 6 rally.",
    "The same is true for the fake electors in Georgia, who were directly tied to the Trump campaign.",
    "The fake electors there revealed the marching orders came from a Trump campaign lawyer.",
    "The scheme also involved Rudy Giuliani, who was searched by the FBI last year."
  ]
}