{
  "id": 2078,
  "mediaId": 2662,
  "date": "2022-03-22",
  "headline": "President Trump Tells Arizona Attorney General Mark Brnovich To Issue Warrants In 2020 Election Fraud Case: “The Supervisors Just Won’t Release The Information—It Must Really Be Bad!”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/CF9DE23A-6B12-4165-BCA6-2125D4C74CF7.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/03/president-trump-tells-arizona-attorney-general-mark-brnovich-issue-warrants-2020-election-fraud-case-supervisors-just-wont-release-information-must-really-bad/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    2201,
    2405,
    2725,
    3267,
    584,
    1094,
    5128
  ],
  "sentences": [
    "Statement by Donald J. Trump, 45th President of the United States of America\nArizona Senate President Karen Fann is asking the exact right question about the corrupt Maricopa County Board of Supervisors, “What are they hiding now?”\nBased on the already released information regarding the Rigged and Stolen 2020 Presidential Election, including mail-in ballots without signatures and forgeries, as well as the disgusting refusal to turn over documents, now is finally the time for the Arizona Attorney General to issue warrants and take his investigation to the next level.",
    "President Trump said that “now is finally the time for the Arizona Attorney General to issue warrants and take his investigation to the next level.”\nThe Gateway Pundit reported that Maricopa County has received renewed requests for items that have been withheld from the Attorney General.",
    "President Trump released another statement yesterday blasting the Arizona Attorney General, Mark Brnovich, on his failure to prosecute the Maricopa County Supervisors for the rigged 2020 election and their ongoing failure to comply with his criminal investigation.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nWarrants for these items should have been served long ago!",
    "Maricopa County Receives Renewed Request For Records Or Information In 2020 Election Investigation – What Are They Hiding Now?",
    "The supervisors just won’t release the information—it must really be bad!",
    "The American people deserve answers, and there is no time to waste!",
    "Contact Arizona Attorney General Mark Brnovich to demand answers!"
  ]
}