{
  "id": 2341,
  "mediaId": 6551,
  "date": "2022-03-24",
  "headline": "Judge Blocks Biden's Attempt to Halt Certain ICE Deportations",
  "image": "https://www.numbersusa.com/sites/default/files/public/assets/news/Gavel162015.jpg",
  "link": "https://www.numbersusa.com/news/judge-blocks-bidens-attempt-halt-certain-ice-deportations",
  "mediaOutlet": "numbersusa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3642,
    3951,
    3975,
    645,
    1098,
    1131,
    1145,
    5371
  ],
  "sentences": [
    "Justice and our country’s well-being require it.”\nArizona AG Mark Brnovich argued that the decision was a “tremendous victory” in a statement made to the Daily Caller News Foundation, adding;\nSince assuming office, the Biden administration has undermined our immigration laws and our law enforcement agencies, while empowering dangerous cartels and criminals on both sides of the border.",
    "Southern District of Ohio Judge Michael Newman noted in his order:\nThe States sue because they believe DHS skirted Congress’s immigration enforcement mandates when it issued a policy that prioritizes certain high-risk noncitizens for apprehension and removal.",
    "Judge Newman also denied the DHS’s request to dismiss the case, deciding instead to grant a preliminary injunction on the Biden Admin.’s deportation rule, which greatly limited the work of U.S. immigration enforcement officers.",
    "A federal judge ruled earlier this week against the Biden Admin.’s attempt to halt certain criminal alien deportations made by ICE; the suit was initially brought by the Attorneys General of Arizona, Ohio, and Montana.",
    "In January 2021, DHS Acting Secretary David Pekoske ordered the department to prioritize civil immigration enforcement measures on those posing risks to national security, border security, and public safety.",
    "“will follow the court order and start following the law when it comes to deportations, particularly for those illegal aliens who have prior criminal convictions.”\nFor the complete story, please click here.",
    "At bottom, that is what this dispute is about: can the Executive displace clear congressional command in the name of resource allocation and enforcement goals?",
    "The Secretary added, “The fact an individual is a removable noncitizen therefore should not alone be the basis of an enforcement action against them.",
    "DHS Secretary Alejandro Mayorkas issued a similar memo in September 2021, encouraging “discretion” when it comes to immigration enforcement.",
    "I’m grateful for this ruling and for the partnership of Ohio and Montana as we work to reverse this catastrophic lawlessness.",
    "began to dismantle the U.S. immigration enforcement system almost immediately after the president’s inauguration.",
    "DHS contends that seemingly mandatory statutes must be read flexibly to permit efficient law enforcement.",
    "Montana AG Austin Knudsen made similar statements, adding that he hopes the Biden Admin.",
    "We will use our discretion and focus our enforcement resources in a more targeted way.",
    "Here, the answer is no.",
    "The Biden Admin."
  ]
}