{
  "id": 2400,
  "mediaId": 2721,
  "date": "2022-03-25",
  "headline": "Kamala Harris out as border czar?! This lawsuit says…",
  "image": "https://thehornnews.com/wp-content/uploads/2022/03/harris_poland-600x315-cropped.jpeg",
  "link": "https://thehornnews.com/harris-is-out-as-border-czar-this-lawsuit-says/",
  "mediaOutlet": "thehornnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1951,
    2725,
    2936,
    3975,
    4052,
    645,
    1124,
    5161
  ],
  "sentences": [
    "“I hope the Biden administration will abide by the court order and start following the law when it comes to deportations, particularly for illegal aliens who have prior criminal convictions,” Montana Attorney General Austin Knudsen said in his department’s press release.",
    "”\nRather than doing her job, Harris sits back and watches as illegal immigration skyrockets, countless people at home and abroad are victimized by drug and human trafficking, and CBP officers are left without resources or support from the Biden Administration.",
    "President Biden’s open border policies encourage illegal immigration and make it easier for the Mexican cartels to smuggle drugs into our country — drugs that eventually end up in Montana communities.”\nHarris, the border czar, has yet to comment publicly.",
    "Make no mistake – Harris’ approach is by design, and she must be stopped.”\nUltimately, the state attorneys general convinced a federal judge to issue a temporary injunction blocking the administration’s illegal immigration policies.",
    "At bottom, that is what this dispute is about: can the Executive displace clear congressional command in the name of resource allocation and enforcement goals?”\nOhio Attorney General David Yost put it more simply.",
    "“The States sue because they believe DHS skirted Congress’s immigration enforcement mandates when it issued a policy that prioritizes certain high-risk noncitizens for apprehension and removal,” the lawsuit reads.",
    "Under the new injunction, Biden’s Homeland Security Department must resume deporting criminals who have already been court-ordered to leave, Montana’s justice department said in a press release Wednesday.",
    "I’m grateful for this ruling and for the partnership of Ohio and Montana as we work to reverse this catastrophic lawlessness.”\nRep. Henry Cuellar, D-Texas, voiced support for the House’s resolution.",
    "“Since assuming office, the Biden administration has undermined our immigration laws and our law enforcement agencies, while empowering dangerous cartels and criminals on both sides of the border.",
    "Attorneys general from Ohio, Arizona, and Montana announced Thursday that they had successfully sued the Biden-Harris administration for bypassing Congress’s mandates on illegal immigration.",
    "“Instead of working for the American people, Kamala Harris has worked against us by ignoring her responsibilities as Border Czar,” Jackson said, according to Conservative Brief.",
    "In a speech at the time, she tried to address the “root causes” of immigration by telling would-be migrants, “Do not come.”\nNow she may see some drastic shakeups in her role.",
    "“This is a tremendous victory for the rule of law and the safety of our communities,” Arizona Attorney General Mark Brnovich said in a press release Tuesday.",
    "“I’ve moved on from the vice president to say, ‘OK, let’s work with the ambassadors and let’s work with the State Department.",
    "That same day, the House introduced a resolution to remove Harris as border czar presumably for this reason.",
    "“DHS contends that seemingly mandatory statutes must be read flexibly to permit efficient law enforcement.",
    "“This is a great victory for the rule of law, border security, and public safety across the country.",
    "“Bureaucrats don’t get to ‘fundamentally change’ the law,” he said in a press release Tuesday.",
    "Let’s work with the Homeland Secretary,'” Cuellar said, according to Conservative Brief.",
    "Rep. Ronny Jackson, R-Texas, introduced the resolution to remove Harris as border czar.",
    "He called for Congress to assume a greater role in crafting immigration policy.",
    "Vice President Kamala Harris assumed the role of borer czar last year.",
    "Sponsored: Deadliest Drug Ever (are you taking it?)",
    "The Horn editorial team"
  ]
}