{
  "id": 2488,
  "mediaId": 2918,
  "date": "2022-03-30",
  "headline": "CORTES: Arizona AG Brnovich Almost Prosecuted Pro-Trump Electors.",
  "image": "https://thenationalpulse.com/wp-content/uploads/TheNationalPulse.jpg",
  "link": "https://thenationalpulse.com/2022/03/30/cortes-arizona-ag-brnovich-almost-prosecuted-pro-trump-electors/",
  "mediaOutlet": "thepulse2016.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Cortes",
  "authorUrl": "https://thenationalpulse.com/author/steve-cortes/",
  "termIds": [
    0
  ],
  "sentences": [
    "They then mailed a document to the OFR on December 11th announcing that they had made their decision “under the God-given powers held by THE CITIZENS.”\nThe OFR’s director of legal affairs subsequently sent an email to Arizona Governor Doug Ducey informing him of the slate’s action; the governor’s office responded by telling the OFR that they should “not ‘accept’ or post this unofficial Certificate because, among other things, it does not meet the requirements under federal law.” The OFR simply responded with “Correct.”\nThen, on December 14th, the SCGSA sent another copy of their original declaration with one key difference: Unlike the expired date on the original document’s notary stamp, the second set’s date was valid.",
    "Lawson specifically requested that the federal agency include a formal certificate declaring the documents to be authentic, which would allow the materials to be used in a criminal prosecution\n“For the certificates to be usable at trial,” Lawson wrote, “we will need a wet signature (or original seal, if you go that route).”\nHowever, one year after Brnovich’s office secretly sought to prosecute pro-Trump presidential electors, there has been no progress on any possible charges against them.",
    "Upon receiving the second version, an assistant inspector general with the National Archives and Records Administration (NARA), which is overseen by the OFR, said that the agency should “evaluate these types of issues for criminality.”\nBrnovich’s office didn’t get involved until March of 2021, when a member of the attorney general’s fraud and special prosecution section, Todd Lawson, sent the aforementioned request for the group’s documents to the OFR.",
    "As reported by The Arizona Republic, Brnovich’s office requested information from the Office of the Federal Register (OFR) about a document they had received from one of the pro-Trump slates, a group known as the Sovereign Citizens of the Great State of Arizona (SCGSA).",
    "Given the highly questionable conduct of the election, including widespread voting by illegal migrants and violations of the 14th Amendment Equal Protection clause, several rival slates of electors formed in Arizona.",
    "But explosive new documents prove his office actively considered prosecuting pro-Trump electors in the state who rightfully questioned the dubious official results of the presidential election of 2020.",
    "Prosecutors in Brnovich’s office gave the OFR specific instructions on how to deliver the documents to Arizona so that Attorney General Brnovich could use them as evidence to prosecute the group.",
    "Disappointingly, he offered only half-hearted support for the State Senate’s audit of Maricopa County, which discovered numerous systemic irregularities in the state’s most populous county.",
    "But not Arizona Attorney General Mark Brnovich, a career politician who tries to have it both ways as he seeks the Republican nomination for the U.S. Senate seat from Arizona.",
    "The Arizona vote was among the most contentious in America, with a mere 0.3 percent, just over 10,000 votes, separating Biden and President Trump in the official tally.",
    "They then shelved the prosecution only because Brnovich decided to run for higher office, cognizant of the Trump base that largely controls Republican primaries.",
    "Both during and immediately after the election, he insisted that there were no irregularities in Arizona and that Biden had legitimately won the election.",
    "But these most recent revelations prove that his office is not just guilty of gross incompetence through inaction, through sins of omission.",
    "Even worse, his office actively worked behind the scenes to punish those who dared to criticize and question the official results.",
    "Lawyers working for Brnovich intended to collude with the federal government to bring criminal charges against pro-Trump electors.",
    "Ultimately, the Biden slate was unduly and prematurely certified by Governor Ducey, but with enormous controversy.",
    "Unfortunately, consummate insider Brnovich has flip-flopped on the issue of voter fraud and election integrity.",
    "Specifically, Brnovich clamors for Trump’s endorsement and touts himself as a pro-Trump conservative.",
    "Donald Trump and the America First movement he leads serve as clarifying forces in American politics.",
    "Most Republicans officeholders and candidates make their stances quite clear, one way or the other.",
    "Brnovich represents everything that the America First base detests about the D.C. powerbrokers.",
    "He made no effort to use the vast power of his office to investigate voter fraud in the state.",
    "Plus, he worked in the shadows against the very people that he now solicits for support.",
    "SCGSA had met on December 7th, 2020 to cast their votes in favor of President Trump.",
    "Were the actions of this citizens’ committee aggressive and unorthodox?",
    "He was an Arizona version of the feckless Bill Barr in Washington DC.",
    "Brnovich talks tough but punts on hard decisions.",
    "Arizona deserves much better.",
    "Were they criminal?",
    "Absolutely not.",
    "Yes, certainly."
  ]
}