{
  "id": 3146,
  "mediaId": 2664,
  "date": "2022-03-11",
  "headline": "GOP attorney general investigated Trump’s phony electors — but no charges have been filed: report",
  "image": "https://www.rawstory.com/media-library/donald-trump-and-mark-brnovich.jpg?id=29526510&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/donald-trump-mark-brnovich/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1941,
    2201,
    2725,
    744,
    878,
    1029,
    4830
  ],
  "sentences": [
    "\"The Arizona Attorney General’s Office sought information from the Office of the Federal Register about a document a group of Arizona Republicans sent falsely calling themselves the state’s presidential electors and that used the official state seal, according to documents released Friday.",
    "Brnovich has been criticized for leading the investigation into fraud by Trump supporters while seeking the former president's endorsement in his 2022 midterm challenge of Sen. Mark Kelly (D-AZ)/\nIn January, MSNBC's Rachel Maddow laid out a damning timeline of events:\nWatch:",
    "The request from prosecutors specified exactly how the documents needed to be delivered to the office to be useful in obtaining a conviction, according to emails released to The Arizona Republic from the Federal Register’s Office,\" the newspaper reported.",
    "The newspaper reported an email from the assistant inspector general for investigations said, \"we would really like to wrap our head around the process as we evaluate these types of issues for criminality.\"",
    "Republican Mark Brnovich took steps to investigate a phony slate of Arizona presidential electors supporting Donald Trump, according to newly released government documents.",
    "No charges have been filed against the fraudulent electors, who may have also committed a crime by illegally using the state seal."
  ]
}