{
  "id": 3501,
  "mediaId": 2752,
  "date": "2022-03-14",
  "headline": "?Maybe ?Trump’s Big Lie Will Help Mark Kelly Keep His Senate Seat After All",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNDQyNzMzMi9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY5ODAwMjY2MH0.4UX8qM50R5vUeOhDDEMjFEXX7m21YAfdFnK0LOmmMMw/img.png?width=1200&coordinates=0%2C32%2C0%2C33&height=600",
  "link": "https://www.wonkette.com/maybe-trumps-big-lie-will-help-mark-kelly-keep-his-senate-seat-after-all",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    0
  ],
  "sentences": [
    "Republican primary opponents who don’t hold elected office can say whatever crap they want to gain Trump’s favor, but Brnovich has to legally say “no.” The MAGA goons are especially pissed that Brnovich hasn’t acted on the Cyber Ninjas' so-called “findings” from its jacklegged audit of the 2020 presidential election in Maricopa County.",
    "Politico reported last week that MAGA loons have stalked Brnovich’s office for months \"holding signs with slogans relitigating the 2020 election: 'Indictments Now Fix Nov. 3,' and 'Arrest Criminal Board of Supervisors,' a reference to the Arizona officials who ratified Joe Biden’s victory 16 months ago.”\n“We’re not going away.",
    "Politico observed that under normal circumstances, Brnovich’s job would prove an asset: \"He’s one of Arizona’s highest profile elected officials, with unmatched name ID and what seems to be a standing invitation to Fox News.”\nHere’s Brnovich on Fox News ranting about illegal immigration.",
    "“I think it’s a very easy job to do, because anybody with any common sense is going to look, they’re going to take a look, and they’re going to say this was a total fraud.”\nThat won’t happen, and Trump will unleash hell on the “RINOs” who betrayed him.",
    "But any Republican primary opponent can just say what they would do and bring a more satisfactory answer to the mob.”\nRyan straight-up concedes that Trump voters are an unhinged mob, which is disturbing but a realistic assessment.",
    "It might seem hypocritical of Trump to accuse anyone of shameless self-promotion, but the comment reinforces Trump’s insane megalomania -- it’s disloyal to even exist without a total commitment to Trump and his personal ambitions.",
    "He said Brnovich \"is always on television promoting himself, but never mentions the Crime of the Century, that took place during the 2020 Presidential Election, which was Rigged and Stolen.” It was not rigged and stolen.",
    "We’re not done,” says Susan, a local activist who declined to give her last name because she distrusts the media, and who — along with her dog Hudson — have become reliable faces at the protests.",
    "Attorney General Mark Brnovich is currently the frontrunner for the GOP Senate nomination, and he's considered the party’s best chance to reclaim John McCain’s former Senate seat.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Last year, Trump claimed the “lackluster\" Brnovich is “nowhere to be found” regarding his mad quest to remain president despite losing the election.",
    "Kelly defeated professional Senate race loser Martha McSally in 2020, but he’s up for re-election in 2022 in less than ideal circumstances.",
    "According to Emily Ryan, a Republican lobbyist in Arizona, Brnovich \"desperately needs that Trump voter, however extreme they might be.",
    "He told a MAGA crowd in January:\n“I think he’s a good man, I think he’s going to do his job — we’ll find out,” Trump told the crowd.",
    "He’s terrible, but apparently not terrible enough, because he won’t use his office to prosecute people for made-up election crimes.",
    "That’s significantly better than senior Democratic Senator Kyrsten Sinema’s abysmal 39 percent approval and 48 percent disapproval.",
    "The big problem for Brnovich, however, is that he’s tangled up in Donald Trump’s Big Lie about the 2020 presidential election.",
    "Senator Mark Kelly from Arizona is considered one of the four most vulnerable Democratic incumbents in this year’s midterms.",
    "Republicans have suggested they’ll contrast do-nothing stealth Republican Sinema with Kelly, who actually gives a damn.",
    "Trump has been polite to Brnovich at recent rallies, but it’s clear he expects the attorney general to deliver for him.",
    "There’s an upcoming election this year, one Brnovich could possibly win if Trump’s stooges would just chill out.",
    "He doesn’t want to antagonize Trump and officially kill any investigation into the 2020 election.",
    "A recent poll had Kelly with 45 percent approval among Arizona voters and 44 percent disapproval.",
    "PREVIOUSLY: Mark Kelly Supports Filibuster Reform, So Don't Blame 'Arizona,' OK, KYRSTEN SINEMA?",
    "And with the extreme right of the party, Brnovich can’t legally go far enough to satisfy them.",
    "“Susan” won’t give her last name, but she’ll sell out her dog Hudson to the Deep State.",
    "President Joe Biden carried Arizona but his current approval numbers aren’t great.",
    "This is why outgoing GOP Governor Doug Ducey noped out on a Senate run this year.",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "We should feel better about Senator Kelly’s chances in November.",
    "The 2020 election is over and done, because it’s now 2022.",
    "He's also on the board of the Portland Playhouse theatre.",
    "He’s only succeeded in cowardly delaying the inevitable.",
    "Brnovich is apparently trying to slow-walk the audit.",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able.",
    "How often would you like to donate?",
    "He writes reviews for the A.V.",
    "But send him some love anyway.",
    "Go right ahead.",
    "That's you!"
  ]
}