{
  "id": 3648,
  "mediaId": 2572,
  "date": "2022-02-26",
  "headline": "SCOTUS hears GOP push to defend Trump-era public charge rule; Arizona AG calls Biden moves ‘unprecedented’",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/Supreme-Court-Public-Charge.jpg",
  "link": "https://www.foxnews.com/politics/scotus-hears-gop-push-defend-trump-era-public-charge-rule",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    2144,
    2201,
    2725,
    3951,
    3975,
    878,
    996,
    1132
  ],
  "sentences": [
    "More than a dozen Republican attorneys general, led by Arizona’s Mark Brnovich, have sought to defend the 2019 public charge rule, which broadened the definition of \"public charge\" to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period -- and included a substantial number of benefits.",
    "\"I think this once again demonstrates that the Biden administration is going to use any means necessary and do whatever they have to do to advance a far-left agenda and that's why it's so important for people like myself to be fighting to be on offense, to be pushing back against the overreaching federal government,\" he said.",
    "\"Under this proposed rule, we will return to the historical understanding of the term ‘public charge,’ and individuals will not be penalized for choosing to access the health benefits and other supplemental government services available to them,\" Homeland Security Secretary Alejandro Mayorkas said in a statement.",
    "\"I think what was made crystal clear, even from the Biden administration, is that what they did by withdrawing the public charge rule and their sneaky litigation strategy was unprecedented, and I think even the left of center justices recognized that the Department of Justice was doing something unprecedented.\"",
    "Reuters reported that liberal and conservative justices on the Supreme Court had questioned why the administration rescinded the policy in the way it did rather than using a formal rulemaking process to replace it -- raising the possibility that the administration violated the Administrative Procedures Act.",
    "The Supreme Court on Wednesday heard arguments by a coalition of Republican attorneys general who are seeking to intervene to defend the Trump-era public charge rule -- after the Biden administration dropped the legal defense of the rule, and has since sought to introduce a replacement.",
    "Those benefits included in the 2019 rule included Supplemental Security Income (SSI), cash assistance under Temporary Assistance for Needy Families (TANF), as well as most forms of Medicaid and the Supplemental Nutrition Assistance Program (SNAP), commonly known as food stamps.",
    "Under the new rule by the Biden administration, SSI, TANF, state, tribal and local cash assistance for income maintenance and \"long-term institutionalization at government expense\" would still all be considered when officials make a public charge determination.",
    "Brnovich, in an interview with Fox News, said he was pleased with how the oral arguments went in his effort to convince the justices that the Biden administration’s abandonment of the legal defense in multiple courts was unprecedented.",
    "However, the administration proposes ignoring a range of other taxpayer-funded benefits, which foreign nationals would be able to receive without it ever being held against them on green card applications.",
    "The \"public charge\" consideration is used when a legal immigrant on a temporary visa seeks permanent legal status, and officials consider whether the immigrant is likely to be reliant on welfare.",
    "However, Reuters also reported that some justices, including conservative Justice Brett Kavanaugh, noted that it is not unusual for administrations to stop defending policies that they oppose.",
    "Meanwhile, the Biden administration announced last week its own public charge rule which would roll back many of the additional benefits that the Trump administration wished to consider.",
    "This law has tripped up the Biden administration before, and was how a federal court found that the administration had unlawfully ended the Trump-era \"Remain-in-Mexico\" policy.",
    "Brnovich said that the rule itself admits that narrowing that definition will lead to increase in costs to states, something that gives them an interest in defending the rule.",
    "The Biden administration has since declared the rule not to be in line with the values of the United States and declined to defend it against legal challenges and dropped it.",
    "\"I hope the court, I think the court will do the right thing, and allow us to intervene in the case and fully defend the public charge rule,\" Brnovich told Fox News.",
    "Those include SNAP/food stamps, the Children’s Health Insurance Program (CHIP), most Medicaid benefits, housing benefits and transportation vouchers.",
    "Brnovich accused the administration of a \"strategic surrender\" and of colluding with the plaintiffs in the cases.",
    "The Republican attorneys general have requested they be allowed to step in and defend the rule.",
    "\"I am happy with our briefing and happy with what happened today in the courtroom,\" he said.",
    "It had previously been blocked from going into effect by a number of appeals courts."
  ]
}