{
  "id": 4054,
  "mediaId": 2644,
  "date": "2022-03-03",
  "headline": "Arizona GOP Gov. Ducey won’t run for Senate despite McConnell recruiting pitch",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/arizona-senate-race-comp.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/03/arizona-gop-gov-doug-ducey-wont-run-for-senate-despite-mcconnell-recruiting-pitch/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Callie Patteson",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Right now I have the job I want, and my intention is to close my years of service to Arizona with a very productive final legislative session AND to help elect Republican governors across the country in my role as chairman of the Republican Governors Association,” he added.",
    "Despite the efforts of McConnell and others, one prominent Republican was not on board with seeing Ducey run for Senate: former President Donald Trump, who has repeatedly slammed the governor as a “RINO” — Republican in name only — since the 2020 presidential election.",
    "President Biden narrowly won Arizona, becoming just the third Democratic candidate to do so since World War II, and Trump has accused Ducey of not being sufficiently supportive of his efforts to show that election fraud was responsible for the result.",
    "In the letter, Ducey described himself as more of a “boss” and an “executive” rather than a legislator and vowed he “will be actively supporting our nominee” and might make an endorsement before the state’s Aug. 2 primary.",
    "Republicans view the Arizona race as a prime opportunity to win back a Senate seat once held by the late John McCain, and McConnell (R-Ky.) led efforts to push the term-limited Ducey into the fray.",
    "Doug Ducey has formally ruled out a run for US Senate later this year, making him the third Republican governor in recent months to resist recruiting efforts by Minority Leader Mitch McConnell.",
    "Ducey’s decision not to join a crowded Republican primary field leaves state Attorney General Mark Brnovich as the favorite to face incumbent Democrat Mark Kelly in the November election.",
    "While the GOP is favored to take back control of the House of Representatives in the November election, the evenly divided Senate is viewed as a toss-up.",
    "“If you’re going to run for public office, you have to really want the job,” Ducey wrote in a letter to donors first obtained by the Arizona Republic.",
    "However, both have said they’re not interested in the Senate, surprising many pundits who viewed them as potential favorites had they run.",
    "Republicans are defending 20 of the 34 seats up for grabs, and five GOP senators have already said they won’t run for re-election.",
    "Larry Hogan to try to unseat Democrats Maggie Hassan and Chris Van Hollen, respectively.",
    "The 45th president has yet to endorse a candidate in the Senate primary.",
    "McConnell previously recruited New Hampshire Gov.",
    "Chris Sununu and Maryland Gov.",
    "Arizona Gov."
  ]
}