{
  "id": 4411,
  "mediaId": 2540,
  "date": "2022-03-03",
  "headline": "Donald Trump cuts off his nose to spite his face in Arizona",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/210527101033-donald-trump-2018-file-super-tease.jpg",
  "link": "https://www.cnn.com/2022/03/03/politics/ducey-trump-arizona-senate/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    0
  ],
  "sentences": [
    "“Right now I have the job I want, and my intention is to close my years of service to Arizona with a very productive final legislative session AND to help elect Republican governors across the country in my role as chairman of the Republican Governors Association.”\nIt’s impossible to talk about Ducey’s no-go decision without mentioning that the former President had repeatedly targeted the governor for his refusal to overturn the 2020 presidential election results in the state.",
    "At the moment, state Attorney General Mark Brnovich is probably the front-runner, but Trump has attacked Brnovich – he called the AG “lackluster” – for not being supportive enough of the sham election audit conducted in Maricopa County.",
    "“So save your time, money, and energy, Mitch!”\nThat appeared to be a reference to a New York Times report that Senate Minority Leader Mitch McConnell had been aggressively courting Ducey to take on Kelly in 2022.",
    "Given that full-court press and the fact that he is term-limited as governor, Ducey may have run if Trump either a) didn’t exist or b) wasn’t actively opposed to a Ducey Senate campaign.",
    "“These days, if you’re going to run for public office, you have to really want the job,” Ducey wrote in a letter to donors obtained by CNN.",
    "“MAGA will never accept RINO Governor Doug Ducey of Arizona running for the U.S. Senate,” Trump said last month.",
    "The Point: Trump’s attacks on Ducey are a reminder that the former President is solely focused on himself.",
    "There’s absolutely no question that Trump has made it harder for Republicans to beat Kelly in the fall.",
    "That Ducey would have been Republicans’ strongest candidate for the Senate matters not at all to him.",
    "(Former President George W. Bush was also involved in the recruitment of Ducey, the Times reported.)",
    "That doesn’t mean it won’t happen, but with Ducey’s announcement, the climb just got steeper.",
    "Doug Ducey announced he wouldn’t run against Democratic Sen. Mark Kelly in the fall.",
    "Which leaves Arizona Republicans without their strongest candidate – by a lot.",
    "CNN —\nOn Thursday, Donald Trump got his wish: Arizona GOP Gov.",
    "But Trump does exist.",
    "And Ducey is out."
  ]
}