{
  "id": 443,
  "mediaId": 2855,
  "date": "2022-04-21",
  "headline": "42 Skiddo: Is the Biden Administration Expelling Border Security?",
  "image": "",
  "link": "https://cis.org/Fishman/42-Skiddo-Biden-Administration-Expelling-Border-Security",
  "mediaOutlet": "CIS",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Fishman",
  "authorUrl": "https://cis.org/Fishman",
  "termIds": [
    2725,
    3100,
    3975,
    200,
    4890,
    5143
  ],
  "sentences": [
    "... At this point in the pandemic, the previously identified public health risk is no longer commensurate with the extraordinary measures instituted by the CDC Orders.”\n“The COVID-19 pandemic has shifted to a new phase ... due to the widespread uptake of highly effective COVID-19 vaccines, the accrual of high rates of vaccine- and infection-induced immunity at the population level, and the availability of effective therapeutics, testing, and masks or respirators.”\nBerger did note that “[i]f ... there is a substantial change in the public health situation with respect to the pandemic, such as due to new and particularly concerning ... variants, CDC could determine a new order ... is necessary.”\nSpecifically regarding the risk at congregate facilities, the basis for the original order, Berger admits that “The very nature of congregate settings increases the risk for COVID-19 outbreaks.” She argues, however, that “although there is still a risk of ... transmission in crowded congregate settings, including DHS facilities, that risk does not present a sufficiently serious danger to public health to necessitate maintaining the August Order.” Why not?",
    "during earlier phases of the pandemic by reducing the number of noncitizens held in congregate settings, other public health measures are now available to provide necessary public health protection.”\n“DHS facilities incorporate some of the recommended COVID-19 mitigation measures for congregate settings ... [and have] recently begun implementing a vaccination program for migrants.”\n“[W]idespread vaccination of federal employees and personnel in congregate settings at POE and Border Patrol stations demonstrates important progress toward the normalization of border operations.”\nShe concludes that “[e]ven if full COVID-19 vaccination cannot be assured, partial vaccination provides some level of protection against severe illness and hospitalization and helps maintain U.S. healthcare resources.”\nI am not sure that those Border Patrol officers who have to staff these facilities agree that the risk to themselves has become negligible.",
    "Section 265 of Title 42 provides that:\nWhenever the Surgeon General determines that by reason of the existence of any communicable disease in a foreign country there is serious danger of the introduction of such disease into the United States, and that this danger is so increased by the introduction of persons or property from such country that a suspension of the right to introduce such persons and property is required in the interest of the public health, the Surgeon General, in accordance with regulations approved by the President, shall have the power to prohibit, in whole or in part, the introduction of persons and property from such countries or places as he shall designate in order to avert such danger, and for such period of time as he may deem necessary for such purpose.",
    "The departments note that the number of aliens making such claims has been skyrocketing: “[T]he percentage of cases in which asylum officers found that the alien had established a credible fear — leading to the alien’s placement in full immigration proceedings ... has ... increased [from] about 77% of the time [in FY2008 to] about 89% [in FY2018].” This creates a strong “incentive for aliens without an urgent or genuine need for asylum to cross the border — in the hope of a lengthy asylum process that will enable them to remain in the United States for years, typically free from detention and with work authorization”.",
    "On March 20, 2020, the CDC director exercised his authority under § 265 to prohibit the introduction of “persons traveling from Canada or Mexico (regardless of their country of origin) who would otherwise be introduced into a congregate setting in a land Port of Entry (POE) or Border Patrol station at or near the United States borders with Canada and Mexico, into the United States.” The director requested that DHS aid in the enforcement of the order, aid that DHS is required to provide.",
    "While the introduction ... of COVID-19 ... is likely to continue to some degree, the cross-border spread of COVID-19 due to covered noncitizens does not present the serious danger to public health that it once did, given the range of mitigation measures now available.”\n“Although COVID-19 remains a concern, the readily available and less burdensome public health mitigation tools to combat the disease render [the] order unnecessary.",
    "Kyrsten Sinema, Mark Kelly, Maggie Hassan, Jon Tester, and Joe Manchin, who joined with Republican Sen. James Lankford and other Republicans to introduce a bill (S. 4036) to put obstacles in the way of termination:\n[The order] shall be lifted not earlier than 60 days after the date on which the Surgeon General provides written notification to ... Congress that such public health emergency declaration ... ha[s] been terminated.",
    "The electoral peril to Democrats might be why “[t]he not-so-conspiratorial take expressed by some [immigration] advocates is that the administration wouldn’t mind having [a federal court order the CDC to reimpose the] Title 42 [order].” And it seems to be why:\nPresident Biden's inner circle has been discussing delaying the repeal of Title 42 ... according to a source with direct knowledge of the internal discussion.",
    "Section 268 then provides that: “It shall be the duty of the [Department of Homeland Security] to aid in the enforcement of quarantine rules and regulations [including those issued pursuant to § 265].”\nThe director’s rationale was that:\n[S]uch facilities were not designed for, and are not equipped to, quarantine, isolate, or enable social distancing by persons who are or may be infected with COVID–19.",
    "The public health risks include transmission and spread of COVID–19 to CBP personnel, U.S. citizens, lawful permanent residents, and other persons in the POEs and Border Patrol stations; further transmission and spread of COVID–19 in the interior; and the increased strain that further transmission ... would put on the United States healthcare system.",
    "In October 2020, it was the CDC director himself who concluded that:\nThe faster a covered alien is returned to the country from which they entered the United States ... the lower the risk the alien poses of introducing, transmitting, or spreading COVID–19 into POEs, Border Patrol stations, other congregate settings, and the interior.",
    "Sherri Berger, the CDC’s chief of staff, explains:\n”[T]here is no longer a serious danger that the entry of covered noncitizens ... will result in the introduction, transmission, and spread of COVID-19 and ... a suspension of the introduction of [the] noncitizens is no longer required in the interest of public health.",
    "Sherri Berger, chief of staff, U.S. Centers for Disease Control and Prevention (CDC):\nCDC recognizes that the Termination of the ... [Title 42] Order will lead to an increase in the number of noncitizens [read: illegal aliens] being processed in DHS facilities which could result in overcrowding in congregate settings.",
    "Thus, as implemented, aliens subject to the prohibition on introduction would generally be immediately expelled (unless they could demonstrate that they would more likely than not be tortured upon expulsion, consistent with U.S. obligations under the Convention Against Torture [CAT]).",
    "... Not later than 30 days [after the date of notification] ... the Surgeon General, in consultation with the Secretary of Homeland Security ... shall develop and submit to ... Congress, a plan to address any possible influx of entries ... related to the termination.",
    "... From FY 2016 through FY 2018, among aliens who received a positive credible-fear determination, only ... an average of 4,021 per year ... were granted asylum (14 percent of all completed asylum cases, and about 36 percent of asylum cases decided on the merits).",
    "[O]ver the past decade, the ... percentage of aliens subject to expedited removal and referred ... for a credible-fear interview on claims of a fear of return has jumped from approximately 5 percent [about 5,000] to above 40 percent [about 97,000].",
    "As DHS and DOJ (“the departments”) explain:\n[A]liens who unlawfully enter the United States may avoid being removed on an expedited basis by making a threshold showing of a credible fear of persecution at a[n] initial screening interview.",
    "In fiscal year 2017, 44 percent of never detained aliens, 41 percent of released aliens, and 49 percent of unaccompanied alien minors ... who received removal orders received them in absentia for failing to appear.",
    "The New York Times recently reported that:\nIn a meeting last summer, officials from the [CDC] told Mr. Biden’s top aides that it was not clear there was still a public health rationale for [extending the orders].",
    "... Biden’s executive actions on immigration [have been] his most unpopular, and even when the president was enjoying favorable approval ratings early on, voters tended to disapprove of his handling of the issue.",
    "Berger argues that:\n[N]umerous ... interventions are [now] available to decrease the spread and severity of COVID-19 in these settings.”\n“While the CDC Orders ... provided an important measure [of] protect[ion] .",
    "Congress put Title 8’s requirements in place in order to provide protection to aliens fleeing persecution, but the process has been abused at an ever-accelerating pace by alien smugglers and their clients.",
    "The White House is looking for ways to buy time to avoid a massive influx of migrants ... [t]hat already endangers Democratic incumbents in states that could decide the Senate majority in November.",
    "... With the political environment now in a much more dire state for Democrats ... immigration threatens to transform the upcoming midterm elections from a defeat into a catastrophe.",
    "Sounds like exaptation to me (a term used in evolutionary biology to describe a trait that has been co-opted for a use other than the one for which natural selection has built it).",
    "Mark Brnovich, Arizona attorney general:\nWhile it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there.",
    "... [P]rivately, [WH Domestic Policy Advisor Susan] Rice and [WH Chief of Staff Ron] Klain and others were worried that lifting the restrictions would invite even more migrants.",
    "The introduction into congregate settings in land POEs and Border Patrol stations of persons from Canada or Mexico increases the already serious danger to the public health.",
    "However, they have had an extraordinarily beneficial effect on border security, resulting in 197,371 “expulsions” in FY 2020, 1,040,695 in FY 2021, and 427,034 in FY 2022.",
    "The departments’ understanding of how Title 42 would operate along the border was that DHS would not be encumbered by the flawed expedited removal/credible fear process.",
    "This increase corresponds with a sharp increase in the number, and percentage, of aliens claiming fear of persecution or torture when apprehended or encountered by DHS.",
    "A recent Morning Consult/Politico poll of registered voters found that 55 percent oppose the termination (42 percent strongly oppose), with only 34 percent in support.",
    "The departments state:\nThe United States has experienced a dramatic increase in the number of aliens encountered along or near the southern land border with Mexico.",
    "If [the] plan ... [has] not [been] submitted ... [t]he termination ... shall be delayed until ... 30 days after [the date on which such] plan is submitted.",
    "The coronavirus ... was spreading wildly throughout the country [and] it was not clear that keeping out migrants ... would do much to prevent the spread.",
    "Among independents, 52 percent oppose (37 percent strongly); and among Republicans and Democrats — 88/78 percent and 27/11 percent, respectively.",
    "It has been reported that EOIR’s immigration courts have higher failure to appear rates than any other state or federal courts in the country.",
    "... [A] large majority of the asylum claims raised by those apprehended at the southern border are ultimately determined to be without merit.",
    "[T]those aliens are often released into the interior of the United States pending adjudication of such claims by an immigration court.",
    "On April 1, 2022, CDC Director Rochelle Walensky announced that, as of May 23, she was terminating the March 20 and subsequent orders.",
    "... A full reversal of the decision to end Title 42 ... is considered by Biden officials to be far less likely than a delay.",
    "Morning Consult reports that:\n[The termination is the Biden] administration’s most unpopular decision so far.",
    "It is because they relieve DHS of having to operate in consonance with Title 8’s border processing regime.",
    "Some officials at the [CDC] resented being blamed for keeping in place what many activists [Many?!",
    "... For the immigration advocates working inside the White House, it was all maddening.",
    "Susan Rice and Ron Klain apparently have good political instincts, as do Democrat Sens.",
    "... Only a small minority of these individuals, however, are ultimately granted asylum.",
    "The order, and subsequent extensions, were implemented to safeguard the public health.",
    "In any event, why have the orders had such a dramatic effect on border security?",
    "... Once ... released, adjudications can take months or years to complete.",
    "... That was not what some in the White House wanted to hear.",
    "In any event, the termination seems broadly unpopular.",
    "On what basis did she make this decision?",
    "saw as a regressive border policy.",
    "It’s a ridiculously poor decision.",
    "How strong an incentive?",
    "How about “all”?!]",
    "[Emphasis added.]",
    "...",
    "...",
    "...",
    "...",
    "...",
    ".",
    "."
  ]
}