{
  "id": 4540,
  "mediaId": 2572,
  "date": "2022-02-21",
  "headline": "Arizona Jewish community leaders sue state over potential use of cyanide gas in executions",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/execution-thumb.jpg",
  "link": "https://www.foxnews.com/us/arizona-jewish-community-leaders-sue-state-potential-cyanide-gas-executions",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Best",
  "authorUrl": "https://www.foxnews.com/person/b/paul-best",
  "termIds": [
    2725,
    74,
    4830,
    5245,
    5361
  ],
  "sentences": [
    "\"Approximately 80 Holocaust survivors currently call our state their home and many of these survivors are horrified at being taxed to implement the same machinery of cruelty that was used to murder their loved ones,\" Tim Eckstein, chairman of the board of the Jewish Community Relations Council of Greater Phoenix, said in a statement.",
    "\"Regardless of where people stand on the matter of capital punishment, it’s clear that use of this barbaric practice is cruel and must be abolished,\" Jared Keenan, senior staff attorney with the ACLU of Arizona, said in a statement.",
    "The American Civil Liberties Union, which is representing the Jewish leaders in the lawsuit, contests that execution by lethal gas violates the Arizona Constitution's prohibition on cruel and unusual punishment.",
    "Jewish community leaders in Phoenix, Arizona, filed a lawsuit against the state to prevent the use of hydrogen cyanide in executions, the same gas that was used to kill Jews during the Holocaust.",
    "Arizona Attorney General Mark Brnovich asked the state's Supreme Court last month to set briefing schedules so that his office can file execution warrants for Frank Atwood and Clarence Dixon.",
    "The last inmate to be executed by lethal gas in the United States was Walter LaGrand, who was put to death in 1999 after being convicted of murdering a bank manager in Arizona in 1982.",
    "A Tucson Citizen reporter described at the time how cyanide pellets were dropped into acid below LaGrand's chair and the inmate began \"coughing violently\" as a mist of gas rose.",
    "The Arizona Department of Corrections refurbished its gas chamber and bought ingredients to create cyanide gas in December 2020, according to records obtained by the Guardian.",
    "Arizona ended the use of lethal gas in 1992, opting instead for lethal injection, but death row inmates convicted before that year could still be executed in a gas chamber.",
    "\"It is appalling that Arizona has chosen to use the very same chemical compound that was used by the Nazis in Auschwitz to murder more than one million people.\"",
    "Brnovich's office notes that both inmates \"may select either lethal injection or gas… because they murdered their victims before November 23, 1992.\"",
    "\"It is our solemn duty to fulfill these court-ordered sentences on behalf of the victims, their loved ones, and our communities.\"",
    "\"Justice has been a long time coming in some of the most heinous crimes committed in our state,\" Brnovich said last month.",
    "Dixon raped, strangled, and stabbed a 21-year-old Arizona State University student to death in 1978.",
    "Atwood was convicted of kidnappings and murdering an 8-year-old girl in Tucson in 1984.",
    "It took LaGrand 18 minutes to die."
  ]
}