{
  "id": 4676,
  "mediaId": 2641,
  "date": "2022-02-22",
  "headline": "Republican AGs Call for Mayorkas to Resign for Failing to Secure Border",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=ae93fc67-5f0e-4bc2-9031-840b6a286fdf&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/attorneys-general-dhs-mayorkas-resign/2022/02/22/id/1057939/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlie McCarthy",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The letter was co-signed by attorneys general from Alabama (Steve Marshall), Arizona (Mark Brnovich), Arkansas (Leslie Rutledge), Georgia (Christopher Carr), Indiana (Todd Rokita), Louisiana (Jeff Landry), Montana (Austin Knudsen), Missouri (Eric Schmidt), Oklahoma (John O’Connor), South Carolina (Alan Wilson), Texas (Ken Paxton), Utah (Sean Reyes) and West Virginia (Patrick Morrisey).",
    "\"As you publicly boast about your abject refusal to enforce the laws enacted by Congress to keep us safe, our southwest border is a disaster and our nation is on the verge of a national security crisis.\"",
    "A total of 14 Republican state attorneys general wrote to Secretary of Homeland Security Alejandro Mayorkas on Tuesday demanding his \"immediate resignation\" for failing to secure the U.S.-Mexico border.",
    "The letter also said the number of sex offenders arrested entering the country increased by 213% during the last fiscal year, and that deportations had decreased by 70% since 2020.",
    "\"[Border Patrol] seized enough fentanyl to kill every man, woman, and child in our country six times over—an increase of over 30% since before you took office,\" the letter read.",
    "Yet, since taking office, you have purposely taken repeated actions impairing the safety and security of Americans,\" the attorneys general wrote in the letter dated Tuesday.",
    "Florida Attorney General Ashley Moody sent the letter, which accused Mayorkas of \"purposely [having] taken repeated actions impairing the safety and security of Americans.\"",
    "Moody took to Twitter on Tuesday afternoon to ask Congress to act if Mayorkas and President Joe Biden refuse to secure the southern border.",
    "The letter specifically pointed to the amount of fentanyl seized at the border between the time Mayorkas took office and December 2021.",
    "If he and @JoeBiden won’t do their jobs, Congress should authorize states to deport those here illegally who commit crimes.",
    "\"It is the core function of the Department of Homeland Security to 'secure the nation from the many threats we face.'",
    "More Americans will unnecessarily die and suffer for as long as you remain as Secretary,\" the letter read.",
    "\"Americans have died because of your failure to obey the law and do your solemn duty.",
    "\"Secretary Mayorkas in office makes us less safe by the day.",
    "Let Florida Lead,” Moody tweeted.",
    "\"You must resign immediately.\""
  ]
}