{
  "id": 4882,
  "mediaId": 2540,
  "date": "2022-02-17",
  "headline": "Donald Trump may be single-handedly costing Republicans a Senate seat",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/181103123215-02-doug-ducey-file-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/17/politics/doug-decey-trump-senate/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    1923,
    1941,
    2201,
    2321,
    2725,
    3434,
    878,
    1171,
    4830
  ],
  "sentences": [
    "CNN —\nAsk any Republican strategist who their best candidate would be against Arizona Sen. Mark Kelly this November and they will all answer “Doug Ducey.”\nDucey, after all, is coming to the end of his second term as governor of that state – having won reelection in 2018 with 56% of the vote.",
    "The Point: If you ever needed evidence that Trump is focused on what’s good for him rather than what’s good for the Republican Party, all you need to do is look at what’s happening in Arizona at the moment.",
    "“So save your time, money, and energy, Mitch!”\nThat’s just the latest in a series of personal attacks Trump has directed at Ducey in the year-plus since the former president lost his reelection bid.",
    "As the New York Times noted in a piece over the weekend, Ducey has received encouragement from the likes of former President George W. Bush and Senate Minority Leader Mitch McConnell to make a bid.",
    "Because the governor has refused to a) overturn the election results in the state (where Trump lost) and b) acknowledge that there was widespread voter fraud in the state (there wasn’t).",
    "“MAGA will never accept RINO Governor Doug Ducey of Arizona running for the U.S. Senate,” said Trump earlier this week in a statement from his Save America PAC.",
    "What Trump is doing is making abundantly clear to Ducey that if he runs, he can expect an aggressive effort by the former president to keep him from winning.",
    "The nominal frontrunner is probably state Attorney General Mark Brnovich but no one – in Arizona or Washington – sees him as a top tier challenger to Kelly.",
    "All over the country Republican Senate candidates are falling all over themselves to please Trump in hopes of winning a coveted endorsement.",
    "He’d rather lose the seat with a weaker candidate than see someone who defied him on the big lie be the Republican nominee.",
    "Would Ducey willingly join a race where he knows the former president is going to be actively engaged against him?",
    "Which is a very big deal in a party that has fully surrendered to Trump and his whims.",
    "What Trump is doing then is cutting off his nose despite the Republican Party’s face.",
    "One big thing: Donald Trump is very much not on board with a Ducey candidacy.",
    "Now, here’s the problem: The current Ducey-less field is decidedly weak.",
    "Why is he so unfavorably disposed toward Ducey, you ask?",
    "What’s wrong with this scenario?"
  ]
}