{
  "id": 4902,
  "mediaId": 6676,
  "date": "2022-02-19",
  "headline": "Arizona Jewish council sues to end gas chamber executions",
  "image": "https://www.wkrg.com/wp-content/uploads/sites/49/2022/02/641103e274744974bdf0930e82784725.jpg?w=1280",
  "link": "https://www.wkrg.com/national/arizona-jewish-council-sues-to-end-gas-chamber-executions/",
  "mediaOutlet": "wkrg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Russell Falcon",
  "authorUrl": "https://www.newsnationnow.com/?post_type=profile&p=1811687",
  "termIds": [
    34,
    74,
    98,
    522,
    4830,
    5245
  ],
  "sentences": [
    "“Approximately 80 Holocaust survivors currently call our state their home and many of these survivors are horrified at being taxed to implement the same machinery of cruelty that was used to murder their loved ones,” said Tim Eckstein, chairman of the board of the JCRC of Greater Phoenix.",
    "Regardless of where people stand on the matter of capital punishment, it’s clear that use of this barbaric practice is cruel and must be abolished.”\nThe lawsuit isn’t asking for a ruling on the legality of the death penalty in general, however, only that lethal gas use be ended.",
    "“Arizona has acknowledged the horrors of cyanide gas as a method of execution and eliminated it in all but a narrow set of cases — it’s time the court eliminates the use of cyanide gas for execution once and for all,” said Jared Keenan, ACLU Arizona senior staff attorney.",
    "“It is appalling that Arizona has chosen to use the very same chemical compound that was used by the Nazis in Auschwitz to murder more than one million people.”\nThe lawsuit also requests Arizona stop using taxpayer dollars to purchase the cyanide gas Zyklon B.",
    "The lawsuit, filed on behalf of the Jewish Community Relations Council of Greater Phoenix, argues gas chamber executions fall under “cruel and unusual punishment” as forbidden in the Arizona state constitution, ACLU Arizona reports.",
    "(NEXSTAR) – The American Civil Liberties Union of Arizona has filed a lawsuit to end future gas chamber executions in the state – saying the method is unnecessarily cruel and insensitive to Holocaust survivors who live in the area.",
    "Last year, the Guardian learned via Arizona Department of Corrections documents that the state spent thousands to refurbish a gas chamber built in 1949, in addition to chemicals needed for gas.",
    "Arizona last performed a lethal gas execution in 1999, which was described by witnesses as an “agonizing and excruciating” 18-minute death, as reported by the Tucson Citizen at the time.",
    "While Arizona voters voted against lethal gas usage in 1992, the old law still applied to people who were sentenced to death before November 23, 1992.",
    "ACLU reports 17 out of 115 death row inmates in Arizona could possibly be killed using lethal gas – if they choose the method over lethal injection.",
    "Even if an inmate chooses lethal injection over lethal gas, the state is still using taxpayer money to have the gas on hand, the plaintiffs argue.",
    "You can read the entire lawsuit here: Jewish Community Relations Council of Greater Phoenix v. State of Arizona.",
    "Tucson.com reached out to Attorney Gen. Mark Brnovich but did not immediately hear back.",
    "PHOENIX, Az."
  ]
}