{
  "id": 5052,
  "mediaId": 2728,
  "date": "2022-02-23",
  "headline": "High court wades into clash over Trump-era immigration rule",
  "image": "https://images.thestar.com/ucRsqQXD6kRo-AefOTG3FFclaLk=/1280x1024/smart/filters:cb(1645654007471)/https://www.thestar.com/content/dam/thestar/news/world/us/2022/02/23/high-court-wades-into-clash-over-trump-era-immigration-rule/20220223150228-621698e6a7430ba4869d80b1jpeg.jpg",
  "link": "https://www.thestar.com/news/world/us/2022/02/23/high-court-wades-into-clash-between-biden-republican-states.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Gresko",
  "authorUrl": "",
  "termIds": [
    1463,
    1680,
    2201,
    3787,
    3975,
    4159,
    996,
    5390
  ],
  "sentences": [
    "Justice Samuel Alito said the administration had devised a strategy to quickly set aside the rule and he wasn’t “aware of a precedent where an incoming administration has done anything quite like this.”\nKagan and other justices suggested that if Arizona objected to the way the Biden administration ended the previous policy, however, it should have brought that issue to a court rather than attempting what Kagan described as a “quadruple bank shot“ strategy to intervene in other cases.",
    "At the center of the case before the justices is a federal law says that green card applicants can’t be burdens to the country or “public charges.” But the Trump administration significantly expanded the definition, saying the use of public benefits including food stamps or Medicaid could be disqualifying.",
    "The Biden administration and immigration groups have said the bigger impact of the rule was scaring immigrants, causing them to drop benefits or not enroll in them because of fears doing so could affect their applications to become legal permanent residents.",
    "Justice Elena Kagan suggested to Arizona Attorney General Mark Brnovich, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "WASHINGTON (AP) — The Supreme Court waded into a political clash Wednesday between the Biden administration and Republican-led states seeking to defend a signature Trump-era immigration rule that the new administration has abandoned.",
    "In addition to Arizona, the states involved in the case are Alabama, Arkansas, Indiana, Kansas, Louisiana, Mississippi, Missouri, Montana, Oklahoma, South Carolina, Texas and West Virginia.",
    "The question for the court is not the legality of the now defunct Trump-era rule, just whether a group of states led by Arizona should be able to pick up the legal fight over it.",
    "Kagan, for her part, did question whether the Biden administration had erred by maneuvering to quickly jettison the Trump-era rule rather than going through a longer process.",
    "Stephen Breyer, Clarence Thomas and Sonia Sotomayor were among the justices who questioned why Arizona belongs in a case that has its origins in California and Washington.",
    "The administration says that in practice, in the year the rule was in effect, it only affected about five out of some approximately 50,000 applications it was applied to.",
    "That’s what the Biden administration did with the Trump-era “public charge” rule that denied green cards to immigrants who use food stamps or other public benefits.",
    "Despite the political nature of Wednesday’s arguments, they did underscore one point of agreement between the Trump administration and the Biden administration.",
    "“I’ve seen how Los Angeles has spread, but I don’t think it’s yet spread to Arizona,” said Breyer, who last month announced his plans to retire from the court.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "Conservative and liberal Supreme Court justices acknowledged during arguments at the high court that when a new administration comes in, it can change policy.",
    "The Trump administration had criticized similar nationwide injunctions by a single judge blocking a policy nationwide, calling them unlawful.",
    "“Whoever the federal government is, there’s always going to be a state that thinks it’s done the wrong thing,“ she said.",
    "Attorney Brian Fletcher, representing the Biden administration, said that view is shared by the new administration.",
    "In the case of the public charge rule, a single federal judge in Illinois ruled to block the policy nationwide.",
    "That led to court challenges, but the Supreme Court allowed the policy to take effect while those continued.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "People stand on the steps of the U.S. Supreme Court on Friday, Feb.11, 2022, in Washington.",
    "The Biden administration rescinded the rule and has since announced new guidelines.",
    "Other justices suggested a limited right to intervene might be possible.",
    "Another issue for several of the justices: geography.",
    "The Star does not endorse these opinions."
  ]
}