{
  "id": 5057,
  "mediaId": 2636,
  "date": "2022-02-23",
  "headline": "Supreme Court Weighs Whether States May Defend a Trump Immigration Policy",
  "image": "https://static01.nyt.com/images/2022/02/23/us/politics/23dc-scotus/merlin_202727064_2838e4ea-afea-4e8e-9c1b-7b5c7a17f5d3-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/23/us/politics/supreme-court-public-charge-rule.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2144,
    2201,
    3949,
    3975,
    4159,
    996,
    5390
  ],
  "sentences": [
    "“I congratulate whoever it is in the Justice Department or the executive branch who devised this strategy and was able to implement it with military precision,” he said, adding, “I’m not aware of a precedent where an incoming administration has done anything quite like this.”\nOther justices said that it was routine for new presidential administrations to change course and that, in any event, the states were seeking to intervene in the wrong court.",
    "Helen H. Hong, a lawyer for Democratic-led states and localities that had challenged the policy in the first place, said there was “nothing the Ninth Circuit can do to restore the rule.”\nThe policy at issue in the case revised the “public charge” rule, which allows officials to deny permanent legal status, also known as a green card, to immigrants who are likely to need public assistance.",
    "Mark Brnovich, Arizona’s attorney general, urged the justices to address what he called “an unprecedented legal maneuver,” adding that “the rule saved the states collectively more than a billion dollars per year.”\nBut Brian H. Fletcher, a lawyer for the federal government, said only a handful of people were turned down for green cards under the policy.",
    "“During the year that the 2019 rule was in effect,” he said, “we know that it affected only about five of the approximately 50,000 adjustment-of-status applications to which it was applied, or about one one-hundredth of 1 percent.”\nThe arguments in the case, Arizona v. City and County of San Francisco, No.",
    "It was a “quadruple bank shot,” she said, one that seemed to include trying to intervene in the U.S. Court of Appeals for the Ninth Circuit, in San Francisco, in the hope of undoing a ruling in a federal trial court in Illinois so that the states could file a new suit in federal court in Washington.",
    "“It’s really quite a license for collusive action,” Chief Justice John G. Roberts Jr. said of the administration’s strategy, which included accepting a court ruling against the policy and opposing the states’ attempts to intervene to argue in its favor.",
    "20-1775, followed the Supreme Court’s announcement last week that it would decide whether the Biden administration can end a Trump-era immigration program that forces asylum seekers arriving at the southwestern border to await approval in Mexico.",
    "WASHINGTON — The Supreme Court heard arguments on Wednesday in a tangled dispute over whether Republican-led states may step in to defend a Trump-era immigration policy that the Biden administration has abandoned.",
    "The Trump administration’s revised rule broadened the criteria to include “noncash benefits providing for basic needs such as housing or food” used in any 12 months in a 36-month period.",
    "In the past, only substantial and sustained monetary help or long-term institutionalization counted, and fewer than 1 percent of applicants were disqualified on public-charge grounds.",
    "Relying on a nationwide ruling against the policy from the federal court in Illinois and without following administrative law procedures, the administration then revoked the policy.",
    "That is not unprecedented at all.”\nJustice Elena Kagan questioned the convoluted litigation strategy pursued by the states seeking to revive the Trump administration’s policy.",
    "Critics called the administration’s actions legal gamesmanship meant to ensure that there would be no definitive ruling on whether the old policy was lawful.",
    "At the administration’s request, the Supreme Court dismissed a separate appeal that had reached the justices, and lower federal courts took similar actions.",
    "“It’s very much not unprecedented,” Justice Brett M. Kavanaugh said, “for the government to acquiesce in an adverse judgment invalidating a rule.",
    "Some justices questioned the Biden administration’s legal maneuvers, suggesting they were aggressive, unseemly and too clever by half.",
    "The policy, a revision of the “public charge” rule, imposed a new wealth test on applicants for green cards.",
    "After President Biden took office last year, his administration decided not to defend the policy in court.",
    "But in January 2020, by a 5-to-4 vote, the Supreme Court revived the policy while appeals moved forward.",
    "The policy was challenged in lawsuits around the nation, and several federal judges blocked it.",
    "Use of two kinds of benefits in a single month counted as two months, and so on.",
    "Justice Samuel A. Alito Jr. gave a sarcastic account of what had happened.",
    "(It has since started the process to issue its own version.)"
  ]
}