{
  "id": 5112,
  "mediaId": 2746,
  "date": "2022-02-21",
  "headline": "DHS eyes more welfare for legal immigrants as Supreme Court hears challenge",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/21/charge_AP19281729764967_c0-49-3000-1799_s1200x700.jpg?4562e81a0c0b212a96f35af1eb945430c1d634e7",
  "link": "https://www.washingtontimes.com/news/2022/feb/21/dhs-eyes-more-welfare-legal-immigrants-supreme-cou/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Dinan",
  "authorUrl": "https://www.washingtontimes.com/staff/stephen-dinan/",
  "termIds": [
    2725,
    3951,
    3975,
    996,
    1131,
    4830
  ],
  "sentences": [
    "The key part of the proposal is to define “likely to become a public charge” — language from the law — as “likely to become primarily dependent on the government for subsistence.”\nHomeland Security said the 2019 rules had scared more than 2 million immigrants and family members, even those not subject to public charge rules, into avoiding benefits such as Medicaid, the federal-state health care program for the poor.",
    "The Biden administration then used the judicial rulings as a basis to terminate the Trump policy, in the words of one appeals court judge, “ensuring not only that the rule was gone faster than toilet paper in a pandemic, but that it could effectively never, ever be resurrected, even by a future administration.”\nEnter Mr. Brnovich, who asked the courts to be allowed to mount a defense of the Trump rules.",
    "Homeland Security Secretary Alejandro Mayorkas said immigrants “will not be penalized for choosing to access the health benefits and other supplemental government services available to them.”\nThe proposal, announced late last week, tries to unwind a Trump-era policy that pressured immigrants to pay their own way.",
    "The Biden administration has moved to make it more attractive for immigrants to sign up for welfare, laying down a marker just days before the Supreme Court is slated to take up the issue in a legal challenge seeking to restore stricter Trump-era rules.",
    "If the Biden administration’s “sneaky” strategy goes unchecked, Mr. Brnovich said, administrations will be able to circumvent the usual regulatory process and work with like-minded interest groups to end federal regulations they don’t like.",
    "Two decades later, the Trump administration said the law demanded a stricter approach and released a formal regulation in August 2019 that covered non-cash welfare such as food stamps, Medicaid benefits and housing assistance.",
    "The Homeland Security Department released a proposal to raise the bar for becoming a “public charge.” Joining programs such as Medicaid won’t be counted against most immigrants, it said.",
    "In Wednesday’s oral arguments, Arizona will face off against San Francisco and Santa Clara, two California jurisdictions that sued to stop the 2019 rules and won in lower courts.",
    "Arizona asked the court to take up its intervention request and the broader argument over the Trump-era rules, but the justices limited the case to the intervention issue.",
    "Immigration records from the early 1900s show that about half of would-be immigrants stopped at entry in any given year were rejected on the grounds of public charge.",
    "Immigrants found to be using those programs could be penalized in applications to become lawful permanent residents — the key stop on the path to citizenship.",
    "“While America is indeed the land of opportunity, it’s not the land of the welfare state,” Arizona Attorney General Mark Brnovich told The Washington Times.",
    "In a filing last week, though, the Justice Department informed the justices about the Homeland Security proposal to reaffirm the Clinton-era standards.",
    "Mr. Mayorkas said the rules were “not consistent with our nation’s values.”\nThe issue before the justices is whether Arizona is allowed to step in.",
    "What constitutes a “public charge” is not defined in the law, and Republican and Democratic administrations have sparred over ways to interpret it.",
    "The guidance penalized immigrants chiefly for using cash programs such as Temporary Assistance to Needy Families or Supplemental Security Income.",
    "The public charge policy is just one of several cases in which the Biden administration agrees with court challenges of Trump-era rules.",
    "The Trump-era rule was supposed to save the government about $3.8 billion a year because fewer people were signing up for benefits.",
    "The Clinton administration drafted tentative guidance in 1999 that was relatively permissive toward immigrants’ use of welfare.",
    "Congress has updated the law several times, most recently in 1996 to encourage immigrants to prove they are self-sufficient.",
    "The government said the COVID-19 pandemic highlighted the risks inherent in having fewer people with health care coverage.",
    "Solicitor General Elizabeth Prelogar will urge the justices to block Arizona from arguing when the administration won’t.",
    "Mr. Brnovich is leading the defense of the Trump-era rules because the Biden administration has refused to do so.",
    "Federal law has allowed the government to block immigrants likely to become public charges as far back as 1882.",
    "When the Biden administration took office, it sided with the challengers and declined to defend the 2019 rules.",
    "Even though it’s no longer defending the Trump-era regulation, the Biden administration will also be present.",
    "The fact that the high court took the case suggests that at least four justices have concerns.",
    "Out of more than 47,000 applications filed, just five were affected by the stiffer 2019 rules.",
    "Fears that immigrants would be blocked from adjusting their status never materialized.",
    "The Trump administration had been handling the defense but lost in lower courts.",
    "About 1.3 million didn’t sign up for food stamps, Homeland Security says.",
    "Numerous lawsuits were filed, and judges sided with the challengers.",
    "The rule was in effect from February 2020 to March 2021.",
    "That policy goes before the Supreme Court on Wednesday.",
    "The Trump administration was appealing those rulings.",
    "“It’s sue-and-settle on steroids,” he told The Times.",
    "Circuit Court of Appeals refused the request.",
    "Now the Supreme Court will decide what to do.",
    "The 9th U.S."
  ]
}