{
  "id": 5281,
  "mediaId": 6511,
  "date": "2022-02-16",
  "headline": "ACLU demanda a Arizona para impedir ejecuciones con gas usado por nazis",
  "image": "https://laopinion.com/wp-content/uploads/sites/3/2021/06/Arizona-pena-de-muerte-GettyImages-52029080.jpg?quality=80&strip=all&w=1200",
  "link": "https://laopinion.com/2022/02/16/aclu-demanda-a-arizona-para-impedir-ejecuciones-con-gas-usado-por-nazis/",
  "mediaOutlet": "LA OPINIÓN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    34,
    4830,
    5080,
    5174,
    5245
  ],
  "sentences": [
    "Foto: Archivo/MIKE FIALA / AFP / Getty Images\nLa Unión Americana de Libertades Civiles (ACLU) de Arizona, en nombre del Consejo de Relaciones con la Comunidad Judía del Gran Phoenix (JCRC) y de dos residentes de Arizona que son miembros de la comunidad judía, ha presentado una demanda contra el Departamento Correccional de Arizona (ADCRR), para tratar de evitar que usen en Arizona el gas cianuro que fue utilizado por la Alemania nazi durante el Holocausto en las ejecuciones de la pena de muerte.",
    "Te puede interesar:\n– Arizona quiere reiniciar las ejecuciones de presos con el gas utilizado por los nazis en Auschwitz\n– Piden reabrir caso de latina condenada a muerte en Texas acusada de asesinar a golpes a su hija\n– Gobernador Gavin Newsom proyecta cerrar el corredor de la muerte de la prisión estatal de San Quentin",
    "“Bajo ninguna circunstancia se debe utilizar el mismo método de ejecución utilizado para asesinar a más de un millón de personas, incluidos judíos, durante el Holocausto en la ejecución de personas en el corredor de la muerte”, dijo Jared Keenan, abogado principal de la ACLU de Arizona.",
    "El año pasado el fiscal de Arizona, Mark Brnovich, dijo que el estado reanudaría las ejecuciones de las personas en el corredor de la muerte que hayan agotado sus apelaciones, por lo que los demandantes quieren que los tribunales eliminen el uso del gas “de una vez por todas”.",
    "Alrededor de 17 de ellos fueron condenados por sus delitos antes de 1992, año en que los votantes votaron en contra del uso de gas letal para los condenados a muerte en Arizona, y estos prisioneros podrían ser ejecutados en una cámara de gas.",
    "Arizona ha estado desde el año pasado en el ojo del huracán por sus planes para restaurar la cámara de gas en la prisión de Florence, una de las primeras prisiones construidas en Arizona a principios del siglo XX, según el sitio web de ADCRR.",
    "“Arizona ha reconocido los horrores del gas cianuro como método de ejecución y lo eliminó en todos los casos, excepto en un pequeño conjunto; es hora de que la corte elimine el uso de gas cianuro para la ejecución de una vez por todas.",
    "El último preso ejecutado en una cámara de gas de Estados Unidos fue Walter LaGrand, el segundo de dos hermanos alemanes condenados a muerte por matar al director de un banco en 1982 en el sur de Arizona.",
    "Rechazo a la ejecución con gas usado por nazis\nTim Eckstein, presidente de la junta de JCRC, dijo en un comunicado que aproximadamente 80 sobrevivientes del Holocausto actualmente viven en Arizona.",
    "Según un comunicado de la ACLU, la demanda dice que el uso del gas cianuro “viola la protección contra el castigo cruel e inusual garantizada por la Constitución de Arizona”.",
    "Independientemente de la posición de la gente sobre el tema de la pena capital, está claro que el uso de esta práctica bárbara es cruel y debe abolirse”, señaló Keenan.",
    "Es terrible que Arizona haya elegido usar el mismo compuesto químico que usaron los nazis en Auschwitz para asesinar a más de un millón de personas”, señaló Eckstein.",
    "El gas cianuro es el que usaron los nazis durante la Segunda Guerra Mundial en las cámaras de gas que provocaron la muerte de millones de judíos y de otras personas.",
    "“Están horrorizados de tener que pagar impuestos para implementar la misma maquinaria de crueldad que se usó para asesinar a sus seres queridos.",
    "La primera ejecución con gas letal tuvo lugar el 6 de julio de 1934, cuando los hermanos Manuel y Fred Hernández fueron ejecutados.",
    "La prisión se construyó con una cámara de ejecución, que se encuentra sobre el corredor de la muerte.",
    "ACLU dice que hay alrededor de 115 personas actualmente en el corredor de la muerte en el estado.",
    "La esperanza es que Arizona deje de usar el gas en cualquier ejecución de la pena de muerte.",
    "Antes de 1999 hubo otras 36 ejecuciones con gas letal en Arizona.",
    "LaGrand tardó 18 minutos en morir en 1999."
  ]
}