{
  "id": 5333,
  "mediaId": 2608,
  "date": "2022-02-23",
  "headline": "Justices Say Biden Administration May Have Evaded Federal Law in Quietly Removing Trump-Era Immigration Rule",
  "image": "https://lawandcrime.com/wp-content/uploads/2021/04/GettyImages-1232482584.jpg",
  "link": "https://lawandcrime.com/supreme-court/justices-say-biden-administration-may-have-evaded-federal-law-in-quietly-removing-trump-era-immigration-rule/",
  "mediaOutlet": "lawnewz.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elura Nanos",
  "authorUrl": "https://lawandcrime.com/author/elura/",
  "termIds": [
    0
  ],
  "sentences": [
    "Calling the situation “quite unique,” Alito remarked, “I congratulate whoever it is in the Justice Department or the executive branch who devised this strategy and implemented it with military precision to effect the removal of the issue from our docket and to sidestep notice and comment rule-making, but all of that took place.” Alito added, “I’m not aware of a precedent where an incoming administration has done anything quite like this,” before asking, “Why shouldn’t intervention be allowed?”\nAs if to engage directly with Alito, Kagan interrupted, saying that the key issue is not whether the government removed the case from the Supreme Court docket, but rather that it may have evaded a critical step in rule-making.",
    "“The real issue is the evasion of notice and comment.”\n“Basically, the government bought itself a bunch of time where the rule was not in effect,” Kagan commented, before adding, “We shouldn’t be green-lighting that behavior for your administration or any other administration.”\nNot long thereafter, Chief Justice John Roberts appeared to agree, saying, “We have to think long and hard before letting any administration avoid notice and comment.”\nWhen California Deputy Solicitor General Helen Hong argued on behalf of San Francisco, Justice Kagan returned the conversation to the Biden administration’s practices.",
    "Justice Sotomayor later picked up on Kagan’s point, telling Brnovich, “I am so totally confused about why this suit is here and not either an APA suit or simply the Seventh Circuit suit.”\n“The Real Issue Is Evasion of Notice and Comment”\nJustice Stephen Breyer appeared to agree that there might be a preferable forum for Arizona’s claims, saying, “The simplest thing would be to wait for the Seventh Circuit.”\nPrincipal Deputy Solicitor General Brian Fletcher, arguing on behalf of the Department of Justice, faced a harsh evaluation of the Biden administration’s actions in this case from Justice Samuel Alito.",
    "Even if one believes there is a circumvention of APA, Kagan told Hong, “That’s not your problem, it’s their problem.” “But if one thinks that and is concerned about green-lighting that kind of government conduct,” Kagan asked Hong, “what should we do in this case?”\nCalifornia Attorney General Robert Andres Bonta told Law&Crime that the Golden State stands in “support of our immigrant communities and we look forward to continuing to advocate on their behalf.”\n“Despite what Arizona might like to suggest, there is nothing in this case that will bring back the Trump-era public charge rule,” Bonta said.",
    "“Of course, governments decide not to defend rules all the time when administrations change,” allowed Kagan, adding, “That’s not problematic.” By contrast, the justice offered, “But this other thing, which is like dismissing everything but one suit, and now we get rid of the rule without notice and comment, that’s a different thing.” Kagan continued, offering that the right method to challenge an administration’s procedural flaws would be to bring a case under the Administrative Procedure Act (APA).",
    "“The preliminary injunction didn’t run against you.” Sotomayor and Brnovich engaged in a lengthy exchange in which the justice asked, “As far as this injunction’s jurisdictional scope, it didn’t bar the enforcement or the rule in your state, correct?”\nAfter Brnovich attempted to provide an indirect answer, Sotomayor shot back: “Just answer yes or no.”\n“That is technically correct,” answered Brnovich.",
    "The Supreme Court of the United States heard oral arguments Wednesday in a case about a remnant of former President Donald Trump’s anti-immigration policies, and several justices took aim at the Biden Administration for allegedly evading the “notice and comment” requirements of the federal law known as the Administrative Procedure Act.",
    "“The rule no longer exists and numerous courts across the country have already ruled against it.”\nAttorney General Brnovich tweeted a statement prior to Wednesday’s arguments saying, “Let’s hope the rule of law wins out today.”\nWe appreciate your thoughts and prayers as the time approaches for the arguments at the U.S. Supreme Court.",
    "Court watchers routinely attributed the Trump administration’s losing record in the court to his administration running roughshod over the requirements of the Administrative Procedure Act, a more than 75-year-old law seeking to prevent arbitrary and capricious changes in government policy.",
    "“I’m Not Sure What Your Interest Is”\nThe litigation, now stylized as Arizona v. City and County of San Francisco, challenges the Biden administration’s refusal to enforce the so-called “public charge rule,” which has come before various federal courts since 2019.",
    "The “public charge rule” refers to the federal government’s authority under the Immigration and Nationality Act to deny permanent residency (or “green cards”) to immigrants who rely too heavily on public assistance for basic necessities.",
    "Arizona and other states then attempted to intervene in ongoing litigation about the rule, arguing that the Trump rule should be reinstated because the Biden Administration failed to follow procedural requirements in striking it.",
    "Violations of this rule were responsible for high-profile judicial defeats of Trump policy over the 2020 census, rescinding the Obama-era Deferred Action for Childhood Arrivals program, and suspension of the Clean Water Rule.",
    "Furthermore, Trump not only broadened the definition of “public charge,” but also gave the Department of Homeland Security extensive discretion in deciding whether an immigrant was “likely” to become a public public charge.",
    "If the Grand Canyon State obtains permission enter the case, justices signaled that the position that the Biden administration arbitrarily jettisoned his predecessor’s rule from the Federal Register could be a winning one.",
    "Although states lack legal authority to regulate immigration, the coalition of states argues that they have standing based on the increased costs they will be forced to shoulder if the Trump rule is not reinstated.",
    "Justice Elena Kagan was the first to cast direct doubt on the appropriateness of the Biden administration’s actions regarding the public charge rule — a theme that would carry throughout the day’s arguments.",
    "The case currently before the Supreme Court grew from the Biden administration’s removal of the public charge rule from the Federal Register, which was done without the usual notice-and-comment period.",
    "Multiple lawsuits challenged the Trump version of the rule, and in February 2021, the Supreme Court agreed to hear arguments in an appeal from the U.S. Court of Appeals for the Second Circuit.",
    "Elura is also a former civil prosecutor for NYC's Administration for Children's Services, the CEO of Lawyer Up, and the author of How To Talk To Your Lawyer and the Legalese-to-English series.",
    "Under the revisions, immigrants who relied on non-cash benefits such as housing vouchers, food assistance, or Medicaid could be deemed a public charge and denied green cards or citizenship.",
    "Now Arizona, along with 12 other states, is seeking permission from the high court to intervene in an appeal seeking to revive the rule in the U.S. Court of Appeals for the Ninth Circuit.",
    "pic.twitter.com/zFXxj3n1Sa\n— Mark Brnovich (@GeneralBrnovich) February 23, 2022\nAttorneys for the other parties did not immediately respond to Law&Crime’s request for comment.",
    "The Court removed the case from its docket, just as it had done with the lawsuits over other Trump-era immigration policies that the new administration refused to defend.",
    "The rule existed prior to the Trump presidency, but the Trump administration expanded its interpretation, subjecting many more individuals to its limitations.",
    "Justice Sonia Sotomayor took early control of the arguments Wednesday morning, zeroing in a potentially problematic aspect of Arizona’s request to intervene.",
    "As only Arizona’s motion to intervene is before them, the Supreme Court will not rule on whether the Biden administration flouted the APA.",
    "The Ninth Circuit refused to allow Arizona to intervene, and the Supreme Court is reviewing that decision on intervention.",
    "Should that issue reach the high court again, there would be no small degree of irony if Biden lost on those grounds.",
    "Before the court on Wednesday was a more technical issue: whether Arizona could intervene to make that argument.",
    "“The government doesn’t have to come up here and defend something that it no longer believes in,” Kagan said.",
    "“I’m not sure what your interest is,” the justice remarked to Arizona Attorney General Mark Brnovich (R).",
    "A separate challenge is also proceeding in the U.S. Court of Appeals for the Seventh Circuit.",
    "Shortly thereafter, however, the Biden administration agreed to dismiss the case.",
    "[image via Erin Schaff/Pool/AFP via Getty Images]\nHave a tip we should know?",
    "tips@lawandcrime.com\nElura is a columnist and trial analyst for Law & Crime.",
    "“Technically and otherwise,” replied the justice.",
    "Let’s hope the rule of law wins out today.",
    "Follow Elura on Twitter @elurananos"
  ]
}