{
  "id": 542,
  "mediaId": 2589,
  "date": "2022-04-22",
  "headline": "Biden to Dems: We're ending Title 42 no matter how much you complain",
  "image": "https://media.townhall.com/townhall/reu/o/2022/53/af976ade-f7c3-40a1-aee1-1ad7dbbc6faf-1110x740.jpg",
  "link": "https://hotair.com/ed-morrissey/2022/04/22/biden-to-dems-were-ending-title-42-no-matter-how-much-you-complain-n464120",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Morrissey",
  "authorUrl": "https://hotair.com/author/ed-morrissey",
  "termIds": [
    3975,
    305,
    878
  ],
  "sentences": [
    "The president is attempting to balance his long-standing promise to revoke the policy — which, under the banner of fighting the Covid pandemic, justified the immediate expulsion of migrants without due process — right as Republicans weaponize immigration before the midterms and as a growing number of Democratic senators want restrictions to remain in place for fear that the administration is not prepared for a summer surge of migrants to the border.",
    "His own party has lost confidence in Biden’s ability to manage the border crisis, which Politico acknowledges … but not before first indulging in the tired, clichéd Republicans pounce!® trope:\nFacing a growing rebellion from within the Democratic Party, the White House is standing behind its decision to end on May 23 a Trump-era deportation policy for migrants encountered at the southern border.",
    "As Arizona AG and Republican Senate candidate Mark Brnovich pointed out in its challenge, the White House and DHS hasn’t followed the Administrative Procedure Act (APA) process for the rule change, and courts take the APA very seriously:\nThe Biden administration has a pattern of unlawfully circumventing correct processes required under the Administrative Procedure Act (APA).",
    "In the first place, the Biden White House plans to appeal a ruling on mask mandates for Americans on mass-transit systems on the basis that the pandemic still makes it necessary, while Biden will claim that the emergency is over for non-Americans entering the country.",
    "The revocation of Title 42 was already unlawful as the Biden administration failed to follow the correct notice and comment procedure under the APA, and the pattern continues as DHS is unlawfully implementing the revocation early – more than a month ahead of time.",
    "Politico reports that Joe Biden will go full speed ahead on his decision to end Title 42 on the southern border, which used the pandemic to eject undocumented border-crossers rather than the normal catch-and-release policies preferred by Biden.",
    "However, news reports have indicated that the U.S. Department of Homeland Security (DHS) and its sub agencies are no longer utilizing Title 42 with migrants from the Northern Triangle countries of Guatemala, Honduras, and El Salvador.",
    "It’s curious why a legitimate policy area would be seen as “weaponized” in an election-cycle debate, unless it’s tacit admission that Democrats have screwed up so badly on the issue that it helps the GOP to discuss it at all.",
    "Ironically, despite all of the “weaponization” Politico sees, Republicans might actually save Biden’s bacon on this issue:\nBut a court injunction could end up, at least for a time, solving the Catch-22 for Biden.",
    "Rather than get ahead of it and derive some political benefit from the outcome, Biden instead wants to get the worst of both worlds by backing an unpopular policy and then fighting for it in court while losing.",
    "As Karen wrote this morning, Homeland Security Secretary Alejandro Mayorkas all but admitted that Biden and HHS have no plan to deal with the border crisis after they end Title 42 expulsions.",
    "It doesn’t take a lot of “weaponizing” for voters to wonder why they’re being forced into masking compliance when illegal immigrants are being given a pass on pandemic measures.",
    "Democrats realize now that Biden still has no plan to deal with that border crisis, which has only grown worse, except to try to keep national media from mentioning it.",
    "Earlier this month, a number of Republican-led states sued the administration to prevent the termination of Title 42, and a hearing is expected before the end of May.",
    "More to the point, though, Title 42 was one of the last tools left in dealing with the scope of the border crisis that Biden’s mismanagement created and then stoked.",
    "“The little secret here is they don’t think they’re actually going to have to end Title 42,” said an immigration advocate familiar with the White House’s thinking.",
    "This will be a disaster for Democrats with voters in the midterms, especially with Biden’s overall and immigration approval ratings plumbing the 30s or lower.",
    "The Biden administration’s APA failure is one of the major reasons a federal court threw out the CDC’s mask mandate for transit systems.",
    "That decision to end the use of the public health order known as Title 42 has placed President Joe Biden in a political bind.",
    "That collective gulp you hear comes from incumbent Democrats checking to see if it’s too late in the midterm cycle to retire.",
    "This is a case revolving around the CDC’s revocation of Title 42, which was supposed to go into effect on May 23rd.",
    "“They’re expecting to lose a lawsuit that’s going to force them to keep it in place.”\nThey almost certainly will.",
    "Biden’s doing a great job of shooting himself in the foot, and shooting his party in the foot all on his own.",
    "Democrats have a number of problems all on their own without GOP pouncing or seizing.",
    "A federal court will likely take as dim a view of this regulatory change.",
    "Is that worse than “pouncing,” and maybe slightly better than “seizing”?",
    "Republicans don’t need to weaponize this at all.",
    "Republicans “weaponize” immigration?",
    "Or is it the other way around?"
  ]
}