{
  "id": 5584,
  "mediaId": 2643,
  "date": "2022-02-02",
  "headline": "Daughter Accused of Casting Illegal 2020 Ballot on Behalf of Dead Mother",
  "image": "",
  "link": "https://www.newsweek.com/daughter-accused-casting-illegal-2020-ballot-behalf-dead-mother-1675532",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meghan Roos",
  "authorUrl": "https://www.newsweek.com/authors/meghan-roos",
  "termIds": [
    2201,
    2603,
    2725,
    1040,
    4830,
    4912,
    5128
  ],
  "sentences": [
    "Cochise County Recorder David Stevens told the Arizona Daily Independent that the ballot had not been counted because the county's voter registration system had updated its record for Sullivan to reflect her death by the time the ballot allegedly cast by Conner arrived.",
    "The indictment, dated October 25, 2021, alleged that Conner \"knowingly made a false unsworn declaration in regard to a material issue that she subscribed as true under penalty of perjury, believing it to be false\" in violation of state law.",
    "State law prohibits individuals from using \"power of attorney as a basis for any person to conduct any procedure or transaction concerning elections,\" which includes voting on behalf of someone else, according to Brnovich's office.",
    "In the case of the illegally cast ballot that Brnovich's office addressed in a Wednesday press release, a woman from Cochise County was accused of signing and casting a ballot that was intended for her mother.",
    "An Arizona woman was indicted on illegal voting and perjury charges for allegedly casting a ballot in the 2020 election on behalf of her deceased mother, Arizona Attorney General Mark Brnovich said Wednesday.",
    "But audits of vote tabulations conducted since the election, including one that concluded last fall for Arizona's Maricopa County, have found no evidence of widespread voter fraud.",
    "In the wake of the 2020 presidential race, former President Donald Trump has raised concerns about widespread voter fraud in Arizona as well as several other states.",
    "Brnovich's office alerted the public to the allegations made against Conner one day after another woman in Arizona pleaded guilty to attempted illegal voting.",
    "That individual had also been accused of casting a ballot on behalf of her deceased mother in the 2020 general election, according to Brnovich's office.",
    "The ballot was ultimately cast between October 7 and November 3, 2020, according to a copy of the indictment released by Brnovich's office.",
    "\"If you vote illegally you will be caught and prosecuted,\" Stevens said in a statement shared with the Daily Independent.",
    "Reached for comment Wednesday, the Cochise County Elections Department referred Newsweek to Stevens for comment.",
    "Sullivan died about one month before her daughter allegedly signed the early ballot, Brnovich's office said.",
    "The accused woman was identified as Krista Conner, and her mother was identified as Caroline Sullivan.",
    "The indictment charges Conner with one count each of illegal voting and perjury.",
    "\"I hope this sends a clear message not to commit felony voter fraud.\"",
    "Newsweek will update this story with any comment from Stevens."
  ]
}