{
  "id": 5644,
  "mediaId": 2746,
  "date": "2022-02-07",
  "headline": "Arizona AG rules border surge is an ‘invasion,’ state can defend itself",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/11/23/vaping_arizona_lawsuit_83263_c0-212-3840-2452_s1200x700.jpg?aa277d760cb9fb86a7fcd7766a37b9e4f7d6c3a3",
  "link": "https://www.washingtontimes.com/news/2022/feb/7/mark-brnovich-arizona-ag-rules-border-surge-invasi/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Dinan",
  "authorUrl": "https://www.washingtontimes.com/staff/stephen-dinan/",
  "termIds": [
    2321,
    2725,
    3975
  ],
  "sentences": [
    "He said the key sections are Article IV, Section 4, which requires the government to guarantee each state a republican form of government and to “protect each of them against invasion,” and Article I, Section 10, which bars states from raising armies or engaging in war “unless actually invaded.”",
    "But sheriffs on the border, and elected officials of both parties, say “crisis” undersells what they’re seeing, and some cities on the border have declared states of emergency over having to handle the massive numbers.",
    "Arizona Attorney General Mark Brnovich issued an official opinion Monday saying the surge of illegal immigrants coming across the border meets the legal definition of an “invasion” under the U.S. Constitution.",
    "It can satisfy the definition of ‘actually invaded’ and ‘invasion’ under the U.S. Constitution,” the Republican attorney general wrote in his opinion.",
    "Doug Ducey to make the actual determination, which would allow the state to “defend itself” under Article I, Section 10 of the founding document.",
    "“The on-the-ground violence and lawlessness at Arizona’s border caused by cartels and gangs is extensive, well-documented, and persistent.",
    "The president and most of his team have refused to label the record surge of people and drugs a “crisis,” much less an invasion.",
    "Mr. Brnovich‘s opinion is the latest salvo in a war of rhetoric over how bad the border has gotten under President Biden.",
    "Mr. Brnovich‘s opinion elevates the matter to one of constitutional proportions.",
    "The ruling was requested by a member of the state assembly.",
    "Mr. Brnovich‘s ruling is only on the legal situation.",
    "He said it’s up to Gov."
  ]
}