{
  "id": 5776,
  "mediaId": 2641,
  "date": "2022-02-05",
  "headline": "Arizona Attorney General, State Bar Reach Diversion Deal",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=bd35b26e-a471-43cb-8f4b-80c3db1e405f&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/bar-complaint-attorney-general-arizona-ethics/2022/02/05/id/1055620/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2725,
    3736,
    66,
    878,
    979,
    4830,
    5245
  ],
  "sentences": [
    "A letter from a bar attorney informing Hobbs of the agreement said it \"reflects the parties' intent to pursue clarity in the Rules of Professional Conduct\" but did not indicate whether Brnovich or his aides will have to comply with other terms.",
    "Former Board of Regents Chair Larry Penley filed a separate complaint alleging Brnovich violated ethical rules by suing the board, which is his client, and making disparaging comments in public about the board and university administrators.",
    "Diversion agreements allow lawyers to have complaints dismissed without sanctions after a period of time if they meet requirements such as training, mentoring, counseling or any other actions negotiated between the lawyers and the bar.",
    "Attorney General Mark Brnovich has reached an agreement with the State Bar of Arizona to resolve complaints alleging he violated ethical rules in representing Secretary of State Katie Hobbs and the Arizona Board of Regents.",
    "\"Contrary to the Attorney General’s assertion, the bar’s decision is not a vindication of the Attorney General’s conduct,\" Manson, the current Board of Regents chair, said in a statement.",
    "“This is a victory for the rule of law and a rebuke to anyone attempting to weaponize the system for regulating lawyers for their own political purposes,” Brnovich said in a statement.",
    "One suit challenges university tuition-setting and another seeks to block a development agreement for a hotel and conference center under construction at Arizona State University.",
    "In a complaint filed a month before the 2020 election, Hobbs, a Democrat, said Brnovich's office made legal arguments in election cases against her instructions.",
    "In one case, she said he represented her in trial court proceedings, then withdrew from the case, intervened and took a different position from hers on appeal.",
    "The terms of the agreement are confidential, and Brnovich's spokesperson, Katie Conner, did not respond to calls and emails seeking details.",
    "Brnovich and several lawyers working for him entered a \"diversion agreement,\" Hobbs and Board of Regents Chair Lyndel Manson said Friday.",
    "Under state law, the attorney general provides legal advice to state agencies and elected officials and represents them in court.",
    "Brnovich has portrayed the complaints as politically motivated, noting his dual role as a politician and attorney for the state.",
    "\"The State Bar is helping to prevent these ethical lapses from occurring again and that is justice,\" Hobbs said in a statement.",
    "He said in a news release that he agreed to work with the Supreme Court to clarify the ethical rules for government lawyers.",
    "She said he sometimes withdrew from cases at the 11th hour, leading her to scramble to hire outside attorneys.",
    "Brnovich, a Republican running in the crowded GOP primary for U.S. Senate, declared himself vindicated.",
    "He said they threatened the reputations and careers of lawyers working for him.",
    "This material may not be published, broadcast, rewritten or redistributed.",
    "© Copyright 2022 The Associated Press.",
    "All rights reserved.",
    "Special Links:"
  ]
}