{
  "id": 5897,
  "mediaId": 2548,
  "date": "2022-02-09",
  "headline": "Texas AG Ken Paxton Launches Investigation Into GoFundMe Over Removal Of Freedom Convoy Fundraiser",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2021/03/GettyImages-522274792-scaled-e1614615802828.jpg",
  "link": "https://dailycaller.com/2022/02/09/texas-ken-paxton-freedom-convoy-gofundme/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ailan Evans",
  "authorUrl": "https://dailycaller.com/author/Ailan+Evans",
  "termIds": [
    0
  ],
  "sentences": [
    "(RELATED: Ted Cruz Calls For FTC Probe Into GoFundMe For Shutting Down Convoy Fundraiser)\n“GoFundMe’s response to an anti-mandate, pro-liberty movement should ring alarm bells to anyone using the donation platform and, more broadly, any American wanting to protect their constitutional rights,” Paxton said in a statement.",
    "“Many Texans donated to this worthy cause.”\nSeveral other Republican state attorneys general, including West Virginia Attorney General Patrick Morrissey, Ohio Attorney General Dave Yost and Louisiana Attorney General Jeff Landry have announced their intent to investigate GoFundMe.",
    "Texas Attorney General Ken Paxton launched an investigation into crowdfunding site GoFundMe on Wednesday after the service shut down a fundraiser supporting protests against Canada’s vaccine mandates and refused to distribute donations.",
    "“I am acting to protect Texas consumers so that they know where their hard-earned money is going, rather than allowing GoFundMe to divert money to another cause without the consent of Texas citizens,” Paxton said.",
    "Paxton issued Civil Investigative Demands (CIDs) to GoFundMe on Wednesday informing the company it was under investigation and requesting it preserve documents related to its decision to shut down the fundraiser.",
    "“I will get to the bottom of this deceitful action.”\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "GoFundMe shut down the “Freedom Convoy 2022” fundraiser on Friday, citing “police reports of violence and unlawful activity” as its reason and refusing to distribute donations to organizers.",
    "Arizona Attorney General Mark Brnovich took a major step in his investigation of the company on Monday, also requesting GoFundMe preserve relevant documents.",
    "The company initially said it would donate the funds to charities, but began automatically refunding the donations after public backlash.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org."
  ]
}