{
  "id": 6017,
  "mediaId": 2550,
  "date": "2022-02-11",
  "headline": "House Republican touts 'Dignity Act' bill claiming to make path to legalization, but don't be fooled",
  "image": "https://images.dailykos.com/images/1036862/story_image/GettyImages-1319087280.jpg?1644609604",
  "link": "https://www.dailykos.com/stories/2022/2/11/2079883/-House-Republican-touts-Dignity-Act-bill-claiming-to-make-path-to-legalization-but-don-t-be-fooled?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2725,
    3267,
    3935,
    4618,
    40,
    151,
    305,
    878,
    4844,
    5371
  ],
  "sentences": [
    "“Instead of taking on those forces in her Party, she is in concert with those same forces and enables them by seeking to launder the Republican brand for select diverse districts ahead of the midterms, while seeking to blame Democrats for legislative inaction on immigration reform blocked by Republicans.”\nRELATED: GOP-led Florida House committee advances Ron DeSantis' anti-child agenda\nRELATED: House passes path to citizenship for DACA recipients, temporary status holders, and farmworkers\nThis is a short blurb about Daily Kos.",
    "Rep. Maria Elvira Salazar, far right\nA South Florida Republican has introduced an immigration bill she’s touting as “The Dignity Act.” Rep. Maria Elvira Salazar claims the legislation will “provide a dignified solution to immigrants currently living in the US.” On its surface, it would appear to make Rep. Maria Elvira Salazar a rarity of sorts, a Republican putting forward a pathway to legalization.",
    "Remember, the Biden administration has kept some of the previous administration’s worst asylum policies in place, and the GOP is still screaming “open borders.”\nReichlin-Melnick also notes another provision could likely scare away prospective applicants, rather than encouraging them to step forward to gain relief for themselves and their families.",
    "“For example, the path to citizenship is a dead end thanks to a border security ‘trigger’ that will never be met.”\nRoll Call reports that this “trigger” ensures border security “is emphasized first before any other bill measures are implemented,” including that path to legalization.",
    "“In Arizona, Mark Brnovich, the state Attorney General and a candidate for the GOP primary for U.S. Senate, called immigration into the state an ‘invasion’ in a legal opinion he issued this week justifying Arizona’s ability to send troops to the border,” America’s Voice continued.",
    "“And national Republican candidates and official party committees continue to run hard on nativist tropes and lies.”\nSalazar is pushing her ploy as the House has already passed legislation putting millions of undocumented people onto a path to legalization.",
    "“We appreciate that some House Republicans support a path to citizenship (which the American public wants), but Rep. Salazar's bill as written is seriously flawed,” noted American Immigration Council policy counsel Aaron Reichlin-Melnick.",
    "That's one example of what I meant by ‘seriously flawed.’”\nIt’s also a dead-end because Kevin McCarthy has said so, previously promising racist rag Breitbart that he’ll kill any immigration legislation should he become speaker.",
    "Experts and immigrant rights advocates note that the path to legalization in Salazar’s bill is a “dead end,” thanks to the ridiculous standards it sets—which Republicans will make sure can never be met.",
    "You know, actual “dignity.”\n“It’s not that Rep. Salazar is naive about the rest of the Republican Party and their open embrace of nativism,” America’s Voice deputy director Vanessa Cardenas said.",
    "“Unless and until McCarthy and other GOPers stop kissing the nativist ring, the Rep. Salazar bill is dead on arrival and designed for optics, not as a real proposal,” America’s Voice notes.",
    "The Dream and Promise Act, as well as the Farm Workforce Modernization Act, passed nearly a year ago under Democratic leadership and support from some GOP votes.",
    "Salazar could just push her party in both chambers to line up behind those bills, but then that would mean a realistic path to legalization.",
    "In recent weeks, both chambers of the state legislature have advanced hateful bills targeting asylum-seeking children and other migrants.",
    "The problem here is that Republicans will never, ever, especially under a Democratic administration, publicly say the border is secure.",
    "Advocates note the bill is, in reality, a re-election ploy for Salazar, who voted against the insurrectionist president’s impeachment.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "“The Salazar bill would make it a federal crime to be undocumented for more than 90 days if you're an adult.",
    "As a result, anyone who wanted to apply for the path to citizenship would be risking prison by applying.",
    "Salazar is also promoting this “Dignity” ploy as Republicans in her state are aiding Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Ron DeSantis’ despicable anti-child agenda.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "But don’t be fooled.",
    "Donate $5 monthly",
    "Please read it."
  ]
}