{
  "id": 6030,
  "mediaId": 2688,
  "date": "2022-02-02",
  "headline": "Jan. 6 Committee Subpoenas Arizona GOP Chair And Her Husband’s Phone Records",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/02/GettyImages-1330469853-scaled.jpg",
  "link": "https://talkingpointsmemo.com/news/january-6-committee-subpoenas-arizona-gop-chair-ward-phone-records?utm_source=rss&utm_medium=rss&utm_campaign=january-6-committee-subpoenas-arizona-gop-chair-ward-phone-records",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Shuham",
  "authorUrl": "https://talkingpointsmemo.com/profile/matt-shuham",
  "termIds": [
    2201,
    2338,
    2521,
    2668,
    2725,
    4564,
    80,
    878,
    4830
  ],
  "sentences": [
    "“Disclosing the phone records and metadata from the Phone Number would provide the [personal health information] of an unknown but quantifiable number of individuals seeking medical treatment from the Plaintiffs to the Committee and potentially to the public at large,” the Wards’ attorneys wrote in the complaint.",
    "“We need you to stop the counting,” Ward wrote to Maricopa County Supervisor Clint Hickman (R) just a few days after Election Day, in one of several attempts to influence Hickman and several other members of the county’s Republican-dominated Board of Supervisors, according to the Arizona Republic in July.",
    "The Jan. 6 committee subpoenaed the phone records of Arizona GOP chair Kelli Ward and her husband, Michael Ward, both of whom falsely claimed in documents that they were among the battleground state’s presidential electors in 2020.",
    "According to Politico, the Wards’ lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, the wife of Arizona Attorney General Mark Brnovich — an ally of former President Donald Trump who is running for Senate.",
    "The Republic also reported on Ward’s efforts to connect several commissioners to Sidney Powell, the pro-Trump lawyer who spread conspiracy theories about the 2020 vote and who is being sued by Doming Voting Systems.",
    "Ward was among some of the top GOP officials in the country who helped push former President Trump’s bogus claims of election fraud and sought to influence the ballot-counting process.",
    "The Wards’ complaint indicates that the committee subpoenaed T-Mobile last month for the couple’s phone records, as well as records from their company, Mole Medical Services P.C.",
    "A source familiar with the planning of the lawsuit told Politico that a lawyer for the Wards indicated that the Arizona state GOP was likely to foot legal fees for the litigants.",
    "In their complaint, the Wards argue that the subpoenas violate patient-physician privilege — both of them are osteopathic doctors who use their phones to speak with patients.",
    "They joined a lawsuit against then-Vice President Mike Pence in late December 2020 in an attempt to pressure him to not certify Biden’s electoral victory on Jan. 6, 2021.",
    "On Tuesday, the Wards sued the committee in federal court in Arizona in an effort to block their phone provider, T-Mobile, from sharing records with the panel.",
    "Additionally, Ward gleefully touted in December 2020 that Trump called her for an “update” on her party’s efforts to challenge the state’s election results.",
    "The presidential call came a day after Arizona’s Supreme Court swatted down her challenge to void then-President-elect Joe Biden’s win.",
    "Additionally, they argued that the subpoena violates their First and Fourth Amendment rights.",
    "T-Mobile said it would turn over the Wards’ records by Feb. 4, barring the Wards filing suit.",
    "The Wards were designated to be pro-Trump electors if the former president had won Arizona.",
    "The committee seeks the Wards’ phone records from Nov. 1, 2020, through Jan. 31, 2021."
  ]
}