{
  "id": 6194,
  "mediaId": 5247,
  "date": "2022-02-08",
  "headline": "Cadet Command ‘looking into’ lieutenant colonel’s tweet at SMA Grinston",
  "image": "https://www.armytimes.com/resizer/WjNc6VFtcXkdvukK0ZIs6Ci0Sdk=/1024x0/filters:format(png):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/mco/QK3HEJKEGFHQDA6FUBAGVEVNXQ.png",
  "link": "https://www.armytimes.com/news/your-army/2022/02/08/cadet-command-looking-into-lieutenant-colonels-tweet-at-sma-grinston/",
  "mediaOutlet": "Military Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Davis Winkie",
  "authorUrl": "https://www.armytimes.com/author/davis.winkie",
  "termIds": [
    0
  ],
  "sentences": [
    "Bishop expressed frustration with how the service has been handling the vaccine mandate, saying he didn’t “think [it] was that controversial” and noting that Attaway is “fully vaccinated.”\nThe attorney said he thinks a bigger issue is “a rise of unprofessionalism” over the vaccine mandate and pressure “from [Attaway’s commanding general]” after Grinston tagged him in the tweet.",
    "“Cadet Command is aware of the tweet attributed to one of our professors of military science that disagreed with the Department of the Army’s COVID-19 vaccine mandate and tagged the Sergeant Major of the Army,” said Lt. Col. Nichole Downs, a command spokesperson.",
    "The post came from a now-deleted Twitter account, @james_attaway04, in response to a tweet from Sergeant Major of the Army Michael Grinston imploring leaders across the force to read about the service’s move to separate troops who have refused the shot.",
    "According to a 2021 Texas legislative resolution congratulating Attaway on his selection for battalion command, the aviation officer has more than 20 years of service, including deployments to Iraq, Afghanistan and Kosovo.",
    "The Army command responsible for training most of the service’s officers is “looking into” a social media post purportedly made by one of its officers questioning the Army’s COVID-19 vaccine mandate.",
    "“The vaccine doesn’t stop you from getting or transmitted [sic] Covid, but we’re mandating that the most healthy population on the planet get vaccinated or be discharged?” the tweet said.",
    "Enlisted troops declining the vaccine face immediate separation action, and retirement-eligible troops and officers have until March to submit their retirement or resignation requests.",
    "The account that responded to the SMA appeared to belong to Lt. Col. James Attaway III, the head of Stephen F. Austin State University’s ROTC program.",
    "He’s also completed Ranger School, and has an Expert Infantry Badge from his time as an enlisted soldier in the 82nd Airborne Division.",
    "“The command is looking into it and will take appropriate action as required.”\nIt’s not clear what action, if any, the Army will take.",
    "Bishop confirmed that Attaway had declined battalion command and was already in the retirement process before the tweet.",
    "Matthew Bishop, who said in a phone interview that he would not “confirm or deny” that the officer had sent the tweet.",
    "“It’s time to resign....”\nGrinston responded, and tagged Cadet Command’s top general, Maj. Gen. Johnny Davis.",
    "“I’m sure [Davis] received your feedback as well?”\nIndeed he has, according to a Cadet Command spokesperson.",
    "It featured multiple photographs of the officer in his duties, as well as photographs of mail sent to him.",
    "Attaway declined comment when reached via email and provided contact information for his attorney, Capt.",
    "“Soldiers still have first amendment rights,” he added.",
    "“Thanks for your reply,” he said."
  ]
}