{
  "id": 6216,
  "mediaId": 5296,
  "date": "2022-02-09",
  "headline": "Stopping the Invasion",
  "image": "https://www.thepostemail.com/wp-content/uploads/2022/02/AZ-AG-opinion-invasion.png",
  "link": "https://www.thepostemail.com/2022/02/09/stopping-the-invasion/",
  "mediaOutlet": "thepostemail.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph DeMaio",
  "authorUrl": "https://www.thepostemail.com/?s=Joseph+DeMaio+Goof+ILLEGAL+aliens",
  "termIds": [
    0
  ],
  "sentences": [
    "Specifically, until today, the prior mission statement articulated the agency’s goals of administering “the nation’s lawful immigration system, safeguarding its integrity and promise by efficiently and fairly adjudicating requests for immigration benefits while protecting Americans, securing the homeland, and honoring our values.”\nThe new mission statement is much shorter and focuses on much different goals: “USCIS upholds America’s promise as a nation of welcome and possibility with fairness, integrity, and respect for all we serve.” Translation: “C’mon in…, the welfare’s fine.”\nNote that the goals no longer include safeguarding the integrity and promise of the nation – founded, by the way, by a bunch of White guys without whose vision, courage and dedication there would be no Republic to come to in the first place at all – but now focus on the “welcoming” nature of the country which the Goof seeks to destroy.",
    "The opinion consists of, in your humble servant’s opinion, a well-researched and persuasive argument that, because the Goofball Regime had abdicated its duty to protect one of the states of the union from invasion not by a foreign governmental power but by non-governmental drug cartels and human-trafficking agents, under the reserved powers of States in Art.",
    "Brnovich released the opinion on Monday, Feb. 7, 2022 and within a few nanoseconds, local “journalists” began blasting him and the opinion, suggesting that the situation in southern Arizona can be analogized to that on the border between Russia and Ukraine…, and is why quotation marks hug the term “journalists” in the preceding sentence.",
    "The opinion chronicles myriad instances of death, destruction and instances of an invasion, albeit not formally by Mexico, including that the invasion has “actually” taken place and that it not only continues unabated under the policies of the Goof and his minions, it is facilitated and enabled by those policies and practices.",
    "1, § 10, providing that a State may not without the consent of Congress, among other things, “engage in War, unless actually invaded, or in such imminent Danger as will not admit of delay” does not preclude Arizona, through its Governor, from itself acting in defense against the invasion.",
    "If those Democrats are comfortable remaining a part of the problem instead of becoming a part of the solution, that simply underscores their loyalty to their political cabal at the expense of the good of the Republic and the preservation of its southern border with Mexico.",
    "Why the Goof’s policies do not constitute impeachable offenses – ranging from abject malfeasance to treason to refusal to “take Care that the Laws be faithfully executed” remains opaque, but do not wait for an explanation from Oracle Psaki.",
    "It will be interesting to see what the reaction to the AG opinion is, not only in Arizona, but in other border states as well and in “midnight destination” states where the Goof has been transporting and trafficking illegal aliens.",
    "Your humble servant will refrain from again exhorting any remaining patriotic Democrat House members (or Democrat Senators) to undergo the “Reagan epiphany” described here and here.",
    "Going to war against a non-governmental foreign drug cartel or trafficking cabal does not implicate the same “foreign policy” issues which might otherwise be at issue.",
    "Had “Brandon the Clown” simply allowed “The Wall” to be completed, this conversation – and the Arizona AG opinion – might never have taken place or been required.",
    "(Feb. 9, 2022) — The Goofball Regime continues the treasonous – oh, yeah…, and unconstitutional – goal of eradicating the nation’s southern border.",
    "Significantly as well, the opinion cites Founder James Madison’s remarks during the June 16, 1788 debates in the Virginia Ratifying Convention.",
    "The treasonous void at the southern border – personally manufactured by the Goof at 1600 – is what has brought the Republic to this point.",
    "1, § 10) of the new Constitution meant that “States are restrained from making war, unless invaded or in imminent danger.",
    "This is characterized as the “State Self-Defense Clause.”\nSpecifically, the opinion argues that the language of Art.",
    "The opinion concludes that while the power of State self-defense exists, it can be invoked only by the governor.",
    "We now learn that the U.S. Customs and Immigration Service (“USCIS”) has altered its mission statement.",
    "That path takes the form of a recent legal opinion issued by Arizona Attorney General Mark Brnovich.",
    "The opinion quotes Madison confirming that the “State Self-Defense Clause” (Art.",
    "1, § 10 of the Constitution, a state may act on its own to defend itself.",
    "Senator from Arizona presently occupied by Senator Mark Kelly (D. AZ).",
    "When and how this will ultimately end is at this point anyone’s guess.",
    "Full disclosure: Mr. Brnovich is a candidate for the office of U.S.",
    "When in such danger, they are not restrained.” (Emphasis added) Id.",
    "Whether that will happen in Arizona remains to be seen.",
    "But thanks to the addled septuagenarian…, here we are.",
    "But few would dispute that it will not end well.",
    "But there may be another path opening up.",
    "Stay tuned…, this could get exciting.",
    "But I digress.",
    "at 425.",
    "Sad."
  ]
}