{
  "id": 6430,
  "mediaId": 2664,
  "date": "2022-01-24",
  "headline": "Arizona governor swears he never knew about the fake Trump electors despite Republican involvement",
  "image": "https://www.rawstory.com/media-library/trump-team-accuses-arizona-gop-governor-of-misconduct-and-blatant-corruption-after-state-certifies-bidens-victory.png?id=24488341&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/doug-ducey-missed-fake-electors/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    2201,
    2321,
    2422,
    3170,
    44,
    402,
    878,
    1029,
    4830,
    5141
  ],
  "sentences": [
    "Ducey appeared to have missed reports in Dec. 2020, Secretary of State Katie Hobbs sent a cease-and-desist letter to the so-called sovereign citizens' group saying that the state requires people to get permission to \"use, display or otherwise employ any facsimile, copy, likeness, imitation or other resemblance\" to the state seal.",
    "The Arizona Republic previously obtained text messages and other documents showing how White House officials and the Trump campaign were pushing Republican legislators to dismiss the results so that they could vote as a body to hand the election to Trump.",
    "Documents obtained by American Oversight revealed that many Republican officials in Arizona were directed by Trump's campaign advisers and lawyers over the plot to overthrow the 2020 election with forged documents.",
    "At one point, Politico's Nicholas Wu obtained a cease and desist document that the Arizona state government sent to a sovereign citizens group trying to pass off the fake document with an official seal.",
    "Dec. 14, 2020, the Arizona Republic reported on the 11 fake electors, even going so far as to quote Mesa resident Lori Osiecki, who was behind the effort.",
    "At the same time, Ducey missed that Rudy Giuliani was pushing to keep the Arizona legislature in session to stop the 2020 election, Fox said at the time.",
    "Attorney General Mark Brnovich, who is now running for U.S. Senate, is said to be investigating the 2020 election in Arizona.",
    "Doug Ducey (R-AZ) said that he had nothing to do with the fake electors from Arizona for then-President Donald Trump.",
    "According to him, he didn't even know about the fake electors until Monday morning, in 2022.",
    "Ducey has not made a statement condemning the fraudulent attempt to overthrow the election.",
    "\"I'm going to leave that to the appropriate authorities,\" he claimed.",
    "That expanded to national news, including the Fox networks.",
    "But according to Ducey, it's the first he's hearing of it.",
    "He hasn't announced any probe into the electors.",
    "The Arizona Republic reported Monday that Gov."
  ]
}