{
  "id": 6432,
  "mediaId": 2658,
  "date": "2022-01-03",
  "headline": "Campaign season starts now",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/01/03/campaign-season-starts-now-799634",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1446,
    3231,
    3739,
    3975,
    4014,
    4192,
    4649,
    4984,
    5037,
    5145
  ],
  "sentences": [
    "Brnovich, a Republican who is running for Senate, is blocking approval of the document and claiming “numerous provisions in the manual don't fit with state law and could expose election officials to criminal charges.” Hobbs, a Democrat who is running for governor, countered by saying Brnovich’s “demand would create inconsistent procedures and leave gaps in election procedures.”\nTHE SUNSHINE STATE — Early voting is underway in the Florida special election to replace the late Rep. Alcee Hastings (D-Fla.).",
    "Former state Supreme Court Justice Michael Gableman, who is leading the review, issued the subpoenas which seek “emails, logs of internet traffic, information about voting machines and data about individual voters.”\n— Only four absentee ballots were cast by dead voters in Georgia during the 2020 election, The Atlanta Journal-Constitution’s Mark Niesse reported.",
    "— The ACLU filed a federal lawsuit challenging Arkansas’ proposed state House map, alleging the new lines would “undermine the voting strength of Black Arkansans.” The lawsuit claims the map violates the Voting Rights Act of 1965 by diluting the voting power of Black voters in Central Arkansas, the Upper Delta, the Lower Delta and Southwest Arkansas.",
    "SCHOOLHOUSE ROCK — Republicans are “pressing local jurisdictions and state lawmakers to make typically sleepy school board races into politicized, partisan elections in an attempt to gain more statewide control and swing them to victory in the 2022 midterms,” POLITICO’s Andrew Atterbury and Juan Perez Jr. wrote.",
    "CODA — HEADLINE OF THE DAY — “Man who uttered ‘Let’s go Brandon’ during Biden call-in event mulls running for office” — The Washington Post\nFollow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "The Great Lakes State will likely have three battleground districts over the next decade, becoming much more hotly contested than it was in previous years after the state’s independent redistricting commission approved a new map, POLITICO’s Zach Montellaro and Ally Mutnick wrote.",
    "“We’re trying to help people wherever we can, and I’m sure we’re going to be doing a lot more of it.”\nGETTING IN — California Republican Lisa Bartlett launched a campaign against Rep. Mike Levin (D-Calif.) in CA-49, the Orange County Register’s Brooke Staggs reported.",
    "THE PROCESS — The Wisconsin state Elections Commission and municipal IT departments are the latest groups to be hit with subpoenas by Republican state lawmakers conducting a partisan review of the 2020 election, the Milwaukee Journal Sentinel’s Patrick Marley wrote.",
    "Days until the FL-20 special election: 8\nDays until the Texas primary: 57\nDays until the Indiana and Ohio primaries: 120\nDays until the general election: 309\nDays until the 2024 election: 1,037\nTop Line\nABOUT LAST WEEK — Candidates, start your engines.",
    "Democratic nominee Sheila Cherfilus-McCormick is expected to win the Jan. 11 contest against Republican Jason Mariner, Libertarian Mike ter Maat and independent candidates Jim Flynn and Leonard Serratore, Florida Politics’ Anne Geggis wrote.",
    "The first phase of a partisan review ordered by the Texas secretary of state found few “discrepancies between electronic and hand counts of ballots in a sample of voting precincts,” The Texas Tribune’s Alexa Ura and Allyson Waller reported.",
    "The center-right American Enterprise Institute is encouraging jurisdictions to put party affiliation on ballots in school board races, and conservatives have embraced education issues like critical race theory and pandemic policies.",
    "That’s the sort of compromise we’re trying to do.”\nBALLOT BATTLE — Arizona state Attorney General Mark Brnovich and Secretary of State Katie Hobbs are at odds over a new elections manual, Arizona Republic’s Mary Jo Pitzl wrote.",
    "Trump announced his endorsement by including a message from Dunleavy guaranteeing Trump has “nothing to worry about.” The former president noted his endorsement would be “null and void” if Dunleavy backed Murkowski.",
    "Spanberger is running for reelection in the district, which is now centered around Fredericksburg and no longer includes her home, the Richmond Times-Dispatch’s Mel Leonor reported.",
    "Bartlett is a term-limited member of the Orange County Board of Supervisors, and had been running for a state Senate seat until she was drawn out of the district in redistricting.",
    "We’ve got the former president going after all these really good elected Republicans, and so I’m trying to support people who I think deserve to be in office,” Hogan told Alex.",
    "— Sen. Angus King (I-Maine) backs reforming the filibuster to pass voting legislation, a shift from his previous position, the Portland Press Herald’s Colin Woodard wrote.",
    "Republicans could control nine of the state’s 13 congressional districts in a good cycle for the party, but in an unfavorable environment the number could drop to four.",
    "— Rep. Tom O’Halleran (D-Ariz.) will run for reelection in AZ-02, he announced after the state’s independent redistricting commission approved a new congressional map.",
    "Still, prominent progressives think a lesser-known progressive candidate could emerge, like Nina Turner of Ohio or former presidential candidate Marianne Williamson.",
    "King sounded optimistic in a phone call with his home state paper, saying “I think a talking filibuster with amendments is a far cry from straight up majority rule.",
    "THE MAP LINES — The Ohio state Supreme Court is expected to rule soon on the state’s new congressional map, The Columbus Dispatch’s Jessie Balmert and Anna Staver.",
    "The Virginia state Supreme Court approved a map that makes Rep. Abigail Spanberger’s district more competitive, The Richmond Times-Dispatch’s Mel Leonor reported.",
    "“We know this race will be tough, but I've never been one to back away from a tough race before, and I don't intend to now,” O’Halleran said in a statement.",
    "Presidential Big Board\nNEVER TOO EARLY — Biden should expect a left-wing challenger if he seeks reelection in 2024, POLITICO’s Holly Otterbein wrote.",
    "DROPPING OUT — Virginia Republican Taylor Keeney ended her campaign in VA-07 after new political maps were approved, The Associated Press reported.",
    "The effort is the latest Republican-backed review of the 2020 election, following the Arizona “audit” and separate efforts in Georgia and Michigan.",
    "The move comes after Davis served as a Trump campaign co-chair in Illinois during the 2020 election, The Chicago Sun-Times’ Lynn Sweet noted.",
    "If approved, the map will be valid for four years rather than 10 because it did not pass with Democratic support in the state legislature.",
    "Down the Ballot\nMIDTERM MESSAGING — Hogan is supporting Trump’s Republican enemies in the 2022 midterms, POLITICO’s Alex Isenstadt wrote.",
    "Rep. Mary Miller (R-Ill.) will run against Rep. Rodney Davis (R-Ill.) in IL-15, after her district was split in two during redistricting.",
    "In a hearing last week, the court focused on Republican mapmakers’ decision to split Hamilton County into three congressional districts.",
    "King is part of a group of lawmakers considering rules changes, POLITICO’s Laura Barrón-López and Marianne Levine reported last month.",
    "But before we jump into the new campaign season, there are a few key story lines you may have missed over the holiday break.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "Cherfilus-McCormick narrowly beat Dale Holness in the Democratic primary, and Holness has filed to run for the seat again.",
    "to challenge Biden, and think it is unlikely Rep. Alexandria Ocasio-Cortez (D-N.Y.) would run for president in two years.",
    "Mike Dunleavy, as long as Dunleavy does not endorse Sen. Lisa Murkowski (R-Alaska), The Hill’s Brad Dress reported.",
    "The lines also tee up a member-on-member primary between Democratic Reps. Haley Stevens and Andy Levin in MI-11.",
    "Meanwhile, Republicans are encouraging Army veteran John James to run in the new MI-10, Zach and Ally reported.",
    "Brian Kemp and Rep. Jaime Herrera Beutler (R-Wash.), and is considering helping others on the ballot this fall.",
    "Miller is challenging Davis from the right, launching Illinois’ second member-on-member primary of the cycle.",
    "You’ll also receive daily policy news and other intelligence you need to act on the day’s biggest stories.",
    "Larry Hogan is backing some of former President Donald Trump’s top political enemies in key midterm races.",
    "Prominent progressives say he should expect an opponent, but it’s not clear who the candidate would be.",
    "Congressional Leadership Fund polled the district in November and found James leading both incumbents.",
    "The term-limited Hogan is building his national profile ahead of a possible bid for president in 2024.",
    "Trump won the new AZ-02 by 8 points, compared to Biden’s 2-point win in O’Halleran’s current district.",
    "The review covered Harris, Dallas, Tarrant and Collin counties, and was released on New Year’s Eve.",
    "The Texas primaries are only eight weeks away, and the rest of the midterm battle isn’t far behind.",
    "Campaign season starts now\nBy STEPHANIE MURRAY\n01/03/2022 10:00 AM EST\nQuick Fix\n— Welcome to 2022.",
    "Despite ringing in 2022 over the weekend, Republicans are still looking back to the 2020 election.",
    "All four ballots were returned by family members, according to a review by election investigators.",
    "The campaign news didn’t stop over the holidays, so here are five stories you might have missed.",
    "Virginia, Oklahoma and Georgia put new congressional maps in place for the next decade.",
    "Bartlett will face Brian Maryott and Christopher Rodriguez in the Republican primary.",
    "House lawmakers are also running against one another in Georgia and West Virginia.",
    "James lost bids for Senate in 2018 and 2020, and was endorsed by Trump both times.",
    "Murkowski is facing a challenge from Trump-endorsed Republican Kelly Tshibaka.",
    "The findings debunk Trump’s claims that there was widespread fraud in 2020.",
    "Redistricting officials were busy in several states over the holiday break.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "Email me at smurray@politico.com and follow me on Twitter @stephanie_murr.",
    "It’s not clear who a Democratic primary challenger could be, however.",
    "— Is President Joe Biden ripe for a primary challenge in 2024?",
    "(So did Michigan, but we’ll get to that in a minute).",
    "The congressional landscape comes into clearer focus.",
    "Bernie Sanders (I-Vt.) or Elizabeth Warren (D-Mass.)",
    "ENDORSEMENT ALERT — Trump endorsed Alaska GOP Gov.",
    "Want to receive this newsletter every weekday?",
    "Trump quickly weighed in, endorsing Miller.",
    "Good Monday morning, and happy New Year!",
    "He hosted fundraisers for Georgia Gov.",
    "A Wisconsin review is still underway.",
    "Another member-on-member primary.",
    "Progressives do not expect Sens.",
    "Michigan map sets off dominoes.",
    "Texas audit finds few issues.",
    "Subscribe to POLITICO Pro.",
    "(More on that below).",
    "It’s officially 2022.",
    "LANDMARK LEGISLATION?",
    "— Maryland Gov.",
    "“It’s crazy."
  ]
}