{
  "id": 7095,
  "mediaId": 2656,
  "date": "2022-01-23",
  "headline": "Arizona Sues Biden Administration For Threatening to Withhold Funds Over Masks",
  "image": "https://media.townhall.com/townhall/reu/o/2018/248/3dc60f8b-30ea-4add-bd51-ec9493108ef3-1110x740.jpg",
  "link": "https://pjmedia.com/news-and-politics/rick-moran/2022/01/23/arizona-sues-biden-administration-for-threatening-to-withhold-funds-over-masks-n1551998",
  "mediaOutlet": "PJMedia",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rick Moran",
  "authorUrl": "https://pjmedia.com/columnist/rick-moran",
  "termIds": [
    0
  ],
  "sentences": [
    "“Unfortunately, members of the Biden administration have continuously ignored this fundamental principle of our great nation when proposing and enacting bureaucratic mandates and harmful regulations upon individual states.”\nThe two administrative funds that the Treasury Department objects to were created by Governor Ducey in August.",
    "In August, Ducey created two funding streams, the education plus-up grant program that gave districts funding if they did not impose mask mandates, and an educational recovery benefit, which gave families $7,000 per student if they moved their child from a district that had a mandate in place.",
    "Related: GAME-CHANGER: Arizona Families Will Now Be Able to Take Their Education Dollars Elsewhere if Schools Close—Even for a Single Day\nThe law was later declared unconstitutional by a state court but Ducey is continuing the funding anyway.",
    "Fox News:\nBrnovich published a letter Jan. 20 to Treasury Secretary Janet Yellen after Yellen threatened, on behalf of the Biden administration, to withhold funds from the state due to a difference in COVID-19 policy.",
    "The complaint argues U.S. Treasury’s final rule dictating how states can use funding went beyond the scope of the American Rescue Plan Act passed by Congress and signed by President Joe Biden in March.",
    "Last week, Treasury sent Ducey a second letter, more forcefully threatening to take back or withhold the same amount of federal funding if the governor does not make changes to the programs.",
    "The plus-up grant was allocated to 98 school districts as of October, and the recovery benefit awarded to just 93 students as of late November, according to reviews by The Arizona Republic.",
    "“The Biden administration is attempting to hold congressionally-appropriated funds hostage and is trying to bully Arizona into complying with this power-grabbing move,” Ducey said.",
    "“The governor’s office will not eliminate or change the (education) programs to conform to Treasury’s unlawful dictates,” the lawsuit states, according to the Arizona Republic.",
    "Doug Ducey has filed suit against President Biden’s administration seeking to prevent Washington from taking back federal funds because of differences in masking policies.",
    "The governor answered with a lawsuit, filed Friday in U.S. District Court, by his General Counsel Anni Foster and a team of lawyers at Snell & Wilmer LLP in Phoenix.",
    "Meanwhile, COVID-19 cases continue to surge in the Grand Canyon State, threatening to exacerbate teacher and staff shortages and drop student attendance.",
    "The Treasury Department should pull back its threats to claw back COVID relief funds simply because they don’t like the way Arizona is spending it.",
    "This effort by the Biden administration to impose a national mask mandate is silly considering his own CDC says that cloth masks are useless.",
    "The funding was contained in the American Rescue Plan and was tied to an Arizona law that prohibited COVID-19 mask mandates in schools.",
    "The governor and his aides already have said they would use state dollars to pay for the programs, should Treasury defund them.",
    "The Biden administration is threatening to take back over $160 million in federal funds unless the policy is changed.",
    "Attorney General Mark Brnovich dismissed the threat with a reminder that states still have some rights.",
    "“Madam Secretary, the states created the federal government, not the other way around,” Brnovich wrote.",
    "Arizona wants to withhold some funds from schools that require students to wear a mask.",
    "Only schools that didn’t impose mandates were eligible for the money.",
    "Arizona’s RepublicanGov."
  ]
}