{
  "id": 7233,
  "mediaId": 2896,
  "date": "2022-01-26",
  "headline": "BREAKING: Key Battleground State Passes Election Integrity Measures On Party Line Votes",
  "image": "https://100percentfedup.com/wp-content/uploads/2022/01/voting-4.jpg",
  "link": "https://100percentfedup.com/breaking-key-battleground-state-passes-election-integrity-measures-on-party-line-votes/",
  "mediaOutlet": "100percentfedup.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Despite the vitriol they have received from both the left and their colleagues on the right, a key battleground state has decided to take common sense measures to prevent further election fraud in the 2022 midterms and for future elections to come.",
    "The Arizona audit discovered evidence of over 700,000 ballot discrepancies and law violations that occurred during the 2020 Presidential Election, and the Arizona Legislature is working to secure elections in 2022 and beyond.",
    "The newly passed legislation covers recount margins, adds currency grade fraud measures to ballots, makes ballot images public records, prevents elections by mail, and fights illegal voters using the “federal only” loophole.",
    "After unprecedented election fraud happened in the 2020 election, many cowardly Republicans chose to deny it or attack their colleagues for taking completely legal and peaceful measures to oppose it.",
    "The Gateway Pundit reported on the call to action days before the Government Committee considered twelve bills, eight of which passed and will now move to the Senate floor after additional hearings.",
    "The audit is still ongoing, but The Arizona Senate delivered election-changing evidence of fraud to Arizona Attorney General Mark Brnovich four months ago.",
    "The Gateway Pundit Reports–\n\n“Seven critical election integrity bills were passed by Republicans on the Arizona Senate Government Committee Monday.",
    "On Monday, The Senate Government Committee voted yes on SB1008, SB1009, SB1012, SB1013, SB1054, SB1119, SB1120, SB1133.",
    "Many in the legislature look to recall the fraudulent 2020 Presidential and Vice Presidential Electors this session.",
    "Republicans on this committee outnumbered Democrats 4:3, and every bill passed on party lines.",
    "The remaining bills were rescheduled for the committee due to time.",
    "Arizona anxiously awaits the results of his criminal investigation.",
    "Democrats did not vote for a single election integrity measure.”",
    "Use promo code FedUp at checkout and save up to 66%.",
    "Use promo code FedUp at checkout and save up to 66%.",
    "Use promo code FedUp at checkout and save up to 66%.",
    "Use promo code FedUp at checkout and save up to 66%.",
    "Use promo code FedUp at checkout and save up to 66%.",
    "Use promo code FedUp at checkout and save up to 66%.",
    "Seven bills passed concentrated on elections.",
    "Save up to 66% on MyPillow products.",
    "Save up to 66% on MyPillow products.",
    "Save up to 66% on MyPillow products.",
    "Save up to 66% on MyPillow products.",
    "Save up to 66% on MyPillow products.",
    "Save up to 66% on MyPillow products."
  ]
}