{
  "id": 7237,
  "mediaId": 2578,
  "date": "2022-01-20",
  "headline": "WATCH: Maricopa County Violates Elections Policy In Elections Server Room – More Shady Footage Released Refutes Recent Claims Made By The County",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/63758377-DF53-4782-A505-04E72120C1CC.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/01/watch-maricopa-county-violates-elections-policy-elections-server-room-shady-footage-released-refutes-recent-claims-made-county/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "The County also attempted to refute claims that data was not deleted from the elections system and cited their policy that states, “It is County elections policy to require two people in the server room whenever someone is using the server room keyboard video monitor (KVM).”\n\nIn the video below, an employee is seen alone in the server room in violation of County elections policy.",
    "A sign in the staff break room clearly reads, “ELECTRONIC DEVICES ALLOWED IN THIS AREA ONLY.”\n\nDespite the policies in place, another elections worker can be seen in the next video using his cell phone in the server room.",
    "Arizona State Senator Wendy Rogers said, “I will be pushing for this as soon as possible.”\n\nArizona Attorney General Mark Brnovich needs to follow through on his criminal investigation into the fraudulent 2020 Election.",
    "These videos are to show the blatant disregard for any laws, rules or statutes and is a clear indicator that there is plenty of willfully negligent and potentially unscrupulous people involved in our elections.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\n\nThe Elections department shows utter disregard for its own policies.",
    "Newly released footage from Maricopa County Elections shows more disregard for policies and procedures by Elections employees and further discredits the recent County efforts to rebut election fraud claims.",
    "Arizona State Senator Sonny Borrelli says that he will vote to recall Arizona’s 2020 Presidential Electors after the Arizona audit found evidence of mass election fraud in the 2020 Election.",
    "The Gateway Pundit also reported that an election worker was seen pulling mail-in ballot envelopes out of an unlocked shred bin to both, exit the room with them, and stuff them in a drawer.",
    "Maricopa County recently released a report attempting to rebut Arizona Senate election auditors’ claims that hundreds of thousands of ballots were cast illegally in the 2020 election.",
    "We The People: Maricopa County elections department claims it is policy to have two people in the server room whenever someone is using the server room (KVM) keyboard video monitor.",
    "The Gateway Pundit recently reported on videos that show Maricopa County Elections employees using cellphones and even photographing ballots in unauthorized areas.",
    "This shady activity worries Arizona voters about the 2022 elections after the 2020 Presidential Election was stolen from President Trump.",
    "Why should we believe anything the County says when they don’t even follow their policies and procedures?",
    "The County finally admitted that ballots were cast illegally but claimed there were less than 100 cases.",
    "When walking out of the server room, he also appears to be using a cellphone in the unauthorized area.",
    "We The People AZ Alliance is exposing them for their negligence and their lies.",
    "This video clearly shows that policy means nothing to anyone at the MCTEC.",
    "He also told us about his plans to secure future elections.",
    "Contact the Arizona Attorney General’s office."
  ]
}