{
  "id": 771,
  "mediaId": 2732,
  "date": "2022-04-20",
  "headline": "Can Texas declare a border 'invasion' and return migrants to Mexico?",
  "image": "",
  "link": "https://triblive.com/news/world/can-texas-declare-a-border-invasion-and-return-migrants-to-mexico/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Los Angeles Times",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I have a sneaking suspicion maybe we’ll see that within the next week or 10 days,” McLaughlin said last week, based on “conversations I’ve had with different people that he’s going to invoke that clause.”\nMcLaughlin, who is nonpartisan but “leans Republican,” said he supports using the invasion clause because, “It’s going to give us more powers as citizens and law enforcement in our own state.”\nHe said migrants have been increasingly breaking into local ranches, damaging fences and prompting high-speed chases.",
    "Abbott — a former Texas attorney general running for a third term as governor — has stepped up border security in recent weeks and promised at border briefings to take “unprecedented actions.”\nAt a briefing in the Rio Grande Valley last week, Abbott faulted the Biden administration’s plan to lift Title 42 and said, “It has left Texas to come up with strategies to secure our border.”\n“We are going to do what is necessary to ensure we have safe and secure borders,” he said.",
    "Arizona Attorney General Mark Brnovich, a Republican running for U.S. Senate, released a legal opinion supporting the plan this year, arguing, “The violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an ‘invasion’ under the U.S. Constitution, and Arizona therefore has the power to defend itself.” Arizona Gov.",
    "But federal courts rejected the claims, ruling they were “political questions.”\nSimply because the courts didn’t decide the issue doesn’t mean a governor has the power to declare a migrant invasion and start enforcing federal immigration law, said Emily Berman, an associate professor who teaches constitutional law at the University of Houston.",
    "Greg Abbott is facing mounting pressure from far-right and former Trump administration officials to immediately declare a migrant “invasion” at the U.S.-Mexico border, under a constitutional provision that would allow local law enforcement and National Guard troops to stop migrants at the border and send them back to Mexico.",
    "“The Trump administration was actually trying to protect the state against the invasion, while the Biden administration has made it worse,” said Ken Cuccinelli, a former Homeland Security official under Trump, now a senior fellow at the Center for Renewing America and one of the plan’s main proponents.",
    "They’re just looking busy,” said Cuccinelli, a former Virginia attorney general who unsuccessfully ran for governor there in 2013, calling the operation “window dressing.”\n“There is zero evidence it has done anything to slow the flow across the border” of migrants, he said.",
    "“Until you are returning people into Mexico reliably and regularly, you will not slow the flow.”\nExpelling migrants from Texas and Arizona would probably send them toward New Mexico and California, pressuring Democratic governors in those states to act too, Cuccinelli said.",
    "She called the Arizona attorney general’s opinion in support of invoking the invasion clause “outrageous” and “beyond the pale.”\n“The administration has repeatedly acted in a racist and anti-immigrant way in order to score political points,” Huddleston said of Abbott.",
    "For Abbott, showing he’s willing to go further than other governors on border security could help him win reelection by the large margin he needs if he wants to run for president in 2024, said Mark Jones, a political science professor at Rice University in Houston.",
    "Former Trump officials at the Center for Renewing America, a conservative think tank based in Washington, are pushing Republican governors in border states to act soon to prevent those migrants from entering the U.S. and to deter others from making the journey.",
    "Officials have reached out to Arizona and Texas leaders, arguing that under the Constitution’s “invasion clause” and “states self-defense clause,” states are entitled to define what they consider an invasion and defend themselves by expelling migrants.",
    "He erected a state-funded border fence and launched Operation Lone Star, deploying more than 10,000 state troopers and guard troops to arrest and jail about 3,500 migrants on state trespassing charges at a cost of about $2 billion.",
    "The American Civil Liberties Union of Texas and other groups have requested the Justice Department investigate Operation Lone Star since December but have received no response, said Kate Huddleston, a staff attorney with the group.",
    "“It would be a stretch to think that it was up to a governor to unilaterally determine the existence of an invasion.… Even a common-sense interpretation of the word ‘invasion’ does not describe what is happening.",
    "Don McLaughlin, mayor of the south Texas city of Uvalde, said he’s been in regular contact with Abbott’s and Paxton’s offices and believes that in coming days, the governor will invoke the invasion clause.",
    "“We are going to enforce the law, even if the federal government won’t.”\nInvoking the invasion clause would be most significant in Texas, the busiest stretch of the border for illegal crossings for years.",
    "In the mid-1990s, half a dozen states, including Arizona, California and Texas, sued the federal government alleging its failure to stop illegal immigration violated the invasion clause.",
    "Already the number of migrants at the southern border increased 33% last month from February to 221,303, according to figures released Monday by U.S. Customs and Border Protection.",
    "“The more you push the envelope, the more you run the risk of Democrats using your policies to turn out more Latinos, particularly younger Latinos, in November,” Jones said.",
    "But a pandemic rule that has blocked more than 1.7 million migrants attempting to enter the U.S. — Title 42 — is scheduled to be lifted May 23 by the Biden administration.",
    "But right-wing critics — including challengers Abbott faced in a competitive primary last month — insist he hasn’t done enough to stop the flow of migrants to Texas.",
    "On Tuesday, he announced a “border strike force” agreement with 25 fellow Republican governors, including Abbott, to combat cartels and other border crime.",
    "But it also risks providing ammunition to Abbott’s opponent, former Texas Rep. Beto O’Rourke, a Democrat who would probably attack the policy as racist.",
    "That’s what an invasion looks like.”\nTexas Attorney General Ken Paxton and Abbott did not respond to requests for comment about the plan this week.",
    "Abbott and other officials have said that could cause a spike in migration, with up to 18,000 migrants arriving at the border daily.",
    "This month, Abbott bused migrants to Washington and increased security checks on traffic at the border, prompting massive delays.",
    "During the last year, Abbott has taken increasingly dramatic and costly steps to show he’s tough on border security.",
    "Several thousand migrants are waiting to claim asylum in camps just across the border from Texas’ Rio Grande Valley.",
    "It wouldn’t be the first time states used the invasion clause to confront the federal government over immigration.",
    "Texas leaders also have yet to respond publicly to the plan, but local officials say they’re considering it.",
    "But he said Abbott needs to act soon to prevent migrants from making the journey, which often takes weeks.",
    "The only deterrence that works is some commitment to stopping people from entering the country,” he said.",
    "“There’s nothing that gives the governor authority to ‘invoke’ the ‘invasion clause,’ ” Berman said.",
    "“It would be a very dangerous step for Texas to go down this path.”\nCategories: News | U.S./World",
    "Doug Ducey has demurred, stressing steps he’s already taken to secure the border.",
    "The federal government is responsible for enforcement of immigration laws.",
    "“Operation Lone Star — that sounds so cool, but it doesn’t stop anything.",
    "“You have to be delivering deterrence messaging weeks before.",
    "“I think we’re all going to be forced to make a stand.",
    "That’s 28% more migrants arriving than March 2021.",
    "Russian tanks are not rolling over the border.",
    "In Texas, I think that’s coming,” he said.",
    "HOUSTON — Texas Gov."
  ]
}