{
  "id": 796,
  "mediaId": 4024,
  "date": "2022-04-14",
  "headline": "U.S. Bioweapons expert speaks out about US biolabs in Ukraine",
  "image": "https://www.lifesitenews.com/wp-content/uploads/2022/03/lifesite-social-media-logo-and-tagline.png",
  "link": "https://www.lifesitenews.com/opinion/bioweapons-expert-speaks-out-about-us-biolabs-in-ukraine/",
  "mediaOutlet": "LifeSiteNews",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "STORY AT-A-GLANCE\nAccording to bioweapons expert Francis Boyle, Russia’s accusation that Ukraine is conducting U.S.-funded bioweapons research appears to be accurate\nIf true, everyone involved is subject to life in prison under the Biological Weapons Anti-Terrorism Act of 1989\nAccording to Boyle, the U.S. government and Pentagon have had a “comprehensive policy” to “surround Russia with biological warfare laboratories” and “preposition biological weapons” there for use against them\nThe problem with trying to make a distinction between “biodefense” and “biowarfare” is that, basically, there is none.",
    "SARS-CoV-2 may be the result of such dual-use research\nBoyle believes we can hold the culprits behind the SARS-CoV-2 bioweapon accountable by asking local prosecutors to convene a grand jury to seek the indictment of those responsible for the pandemic for murder and conspiracy to commit murder\n(LifeSiteNews) — In the video above, “InfoWars” host Owen Shroyer interviews Francis Boyle, Ph.D., a Harvard educated lawyer and bioweapons expert with a Ph.D. in political science, about the biolabs in Ukraine, which Russia claims are engaged in U.S.-funded bioweapons research.",
    "“She has a valid summary of all the evidence that has been compiled so far, involving all these individuals.”\nAnother excellent book is Robert Kennedy Jr.’s book, “The Real Anthony Fauci.” There’s also a September 2020 House Minority Intelligence Committee report that reviews the evidence available at the time on the origins of COVID-19 (“The Origins of the COVID-19 Global Pandemic, Including the Roles of the Chinese Communist Party and the World Health Organization”4).",
    "He points out that Shi Zheng-li, the famous bat coronavirus researcher at the Wuhan Institute of Virology in China, was trained at the biolab in Galveston, Texas, which is “part of U.S. biological warfare industry.”\n“[Shi Zheng-li] took a synthetic biology organism from the Wuhan BSL4, brought it over to the University of North Carolina, BSL3, and then gave it gain-of-function properties under Ralph Baric, who’s an expert on this, and his team.",
    "They’re accountable to the people of the community … I think that if we can even get one out of 400 local prosecutors to convene a grand jury and return indictments for murder and conspiracy to commit murder, this whole house of cards will collapse.”\nProsecuting the COVID conspirators\nBoyle’s plan includes a two-step plan of prosecution, one aimed at those responsible for the COVID pandemic, and another for the COVID jabs.",
    "So, I think we have all these people at least for murder and conspiracy to commit murder, and my advice is that if you have lost a loved one or a friend living in the territorial jurisdiction of any of these local prosecutors, they would have jurisdiction to convene a grand jury and seek indictments for murder and conspiracy to commit murder against all of these people.”\nBut how do we begin to identify the culprits?",
    "Depending on the state, they may go by titles such as district attorney, state attorney, prosecuting attorney or county attorney.2 In that interview, Boyle explained the plan:\n“My proposal is this: The American people, at a state, local community basis, have to go to our local prosecutors, that is states’ attorneys, district attorneys, county attorneys, any local prosecutor.",
    "But within days, Under Secretary of State for Political Affairs Victoria Nuland blew a hole in that denial by admitting before Congress that “biological research laboratories” in Ukraine have been funded and operated under the direction of the U.S., and that she was “very concerned” about the contents of those labs being used as bioweapons by the Russians.",
    "Clearly that constitutes ‘reckless endangerment of human beings,’ ‘malice aforethought.’ So, you have all the elements there for murder, and then ‘conspiracy to commit murder.’ In common law, ‘conspiracy’ is two [or more] people getting together to agree to do an unlawful act — such as the violation of my statute — or a lawful act by illegal means.",
    "Despite Nuland’s concern about the pathogens being used in warfare, the Western media have tried to claim the labs were set up to destroy bioweapons from the Soviet era, or to “secure” old Soviet bioweapons, or that they’re diagnostic labs, “health labs,” biodefense laboratories, or that they’re used for vaccine development.",
    "No such thing as ‘biodefense’\nOne of the latest explanations from a U.S. State Department spokesperson is that Ukraine has “biodefense” laboratories, which are “not biological weapons facilities.”1 The problem with making a distinction between “biodefense” and “biowarfare” is that, basically, there is none.",
    "While the U.S. has vehemently denied Russia’s accusations, Boyle says that based on what he’s discovered so far, the labs in Ukraine are all conducting biological warfare research — including ethnic-specific biological weapons — at the behest of the U.S. Pentagon, just as Russian authorities are claiming.",
    "However, we encourage reviewing this for the purpose of coming to your own well-informed conclusions about the biolabs and their relationship to the SARS-CoV-2 (COVID) bioweapons and the role of the FDC, the NIH, the CDC, the Pentagon and Dr. Anthony Fauci in these bioweapon labs, and much more.",
    "· 2 OJP.gov The Prosecution Function: Local Prosecutors and the Attorney General\n· 3 Nature Medicine 2015; 21(12): 1508–1513\n· 4 House Foreign Affairs Committee Minority Staff Report, The Origins of the COVID-19 Global Pandemic, Including the Roles of […] September 21, 2021",
    "“They kill people, and that’s why they are there.” He also points out that everyone involved is subject to life in prison under the Biological Weapons Anti-Terrorism Act of 1989, which explains the mad scramble to project these labs as something other than what they are.",
    "According to Boyle, Anglo-American Common Law has a definition for “murder” that is applicable in all states of the U.S. with the exception of Louisiana, and that is “the unlawful killing of a human being with malice aforethought.” He explained:\n“Let’s parse that down.",
    "According to Boyle, that paper is “the smoking gun on who is behind COVID-19.”\nResources\nTo aid you in these efforts, Boyle recommends reading Australian journalist Sharri Markson’s book, “What Really Happened in Wuhan?” “I think she’s got it all there,” Boyle told me.",
    "The word ‘unlawful’ — all these individuals I just mentioned from this contracted study … were involved in research, development, testing and stockpiling of biological warfare weapons in clear-cut violation of my Biological Weapons Anti-Terrorism Act of 1989.",
    "So, according to Boyle, the justification that the labs are for biodefense and health purposes is nothing but a façade for the fact that they’re conducting offensive biological warfare research with genetic research, gain-of-function and synthetic biology.",
    "According to Boyle, the U.S. government and Pentagon have had a “comprehensive policy” in place for quite some time to “surround Russia with biological warfare laboratories” and “preposition biological weapons” there for use against Russia.",
    "Boyle recommends getting organized on the local level, and going around to all your local prosecutors, demanding they convene a grand jury to seek the indictment of those responsible for COVID-19 for murder and conspiracy to commit murder.",
    "These include former NIH director Dr. Francis Collins, Fauci, Peter Daszak (president of EcoHealth Alliance), CDC director Dr. Rochelle Walensky, Ralph Baric, Ph.D., and several other named researchers at the University of North Carolina.",
    "Note From LifeSite President Steve Jalsevac: This is a crucial follow-up to a previous Mercola article, Harvard-trained lawyer wants Fauci, COVID-pushing lawmakers prosecuted for ‘conspiracy to commit murder’, published Nov. 29, 2021.",
    "As explained by Boyle, the idea behind “biodefense” research is that there might be a natural pathogen out there that can cause a pandemic, or someone might release an engineered biological weapon, that we need to prepare a cure for.",
    "[The term] ‘killing of human beings’ — I think the number of Americans who have been killed, murdered by COVID-19, is well over a million … And then, ‘with malice aforethought’ — ‘malice aforethought’ is a legal term of art.",
    "No biodefense research is purely defensive, because to do biodefense work, you’re automatically engaged in the creation of biological weapons, and all dual-use research can be used for military purposes.",
    "Boyle suggests starting the indictment list with the 15 co-authors of the 2015 paper, “SARS-Like Cluster of Circulating Bat Coronavirus Pose Threat for Human Emergence,”3 and those who funded it.",
    "They’re appointed by the president and once they’re on their bench with life tenure, they can only be removed by impeachment, which is almost impossible, and their salaries cannot be reduced.",
    "The current article includes an up-to-date interview with the renowned Dr. Francis Boyle addressing shocking claims about the US-funded biolabs in Ukraine and Russia’s accusations about them.",
    "He then went on to draft the Biological Weapons Anti-Terrorism Act, which was passed unanimously by both houses of Congress and signed into law by then-president George Bush Sr. in May 1989.",
    "Last but not least, this strategy is likely to be far more effective if you live in a jurisdiction in which the state attorney general has already filed lawsuits in the federal court system.",
    "It would take me three, four, five different class sessions to go through it all, but one element of malice of forethought is reckless endangerment of human beings and, clearly, they knew.",
    "Ever-changing narrative reveals the lies\nAs noted by Shroyer, the official narrative surrounding the Ukraine biolabs has undergone multiple iterations over the past few weeks.",
    "But to create the cure — the vaccine — they must first create that imagined threat, be it a souped-up natural pathogen through gain-of-function or a synthetic bioweapon.",
    "For example, Arizona’s attorney general has written an extensive legal opinion on why the federal government does not have jurisdiction for a vaccine mandate in Arizona.",
    "Not only do they make money on the research and creation of these biological weapons, but they also make money on the supposed cures, be they vaccines or therapeutics.",
    "We must demand accountability\nIn a 2021 interview with me, Boyle presented a roadmap for prosecuting COVID crimes and putting a stop to high-risk biological research.",
    "These are the names and addresses of the 27 state attorneys general who are suing the Biden administration over the COVID-19 vaccine mandates as of November 12, 2021.",
    "If you happen to live in one of these areas, the odds of your efforts being successful are very high, as they have already filed suit in federal court.",
    "The problem we face is we’ve come to realize that even our federal government has been captured by forces that seek to destroy the U.S. from within.",
    "LifeSite presents this for your information while noting the opinions presented by Dr. Boyle do not necessarily represent the views of LifeSite.",
    "In previous interviews, Boyle has stated he believes SARS-CoV-2 is an engineered bioweapon, and here, he again reviews some of the reasons why.",
    "It’s highly unlikely our federal authorities — including federal judges — will ever seek to enforce the Biological Weapons Anti-Terrorism Act.",
    "No biodefense research is purely defensive, because to do biodefense work, you’re automatically engaged in the creation of biological weapons.",
    "No biodefense research is purely defensive, because to do biodefense work, you’re automatically engaged in the creation of biological weapons.",
    "He points out that the United States is the only country in the world that has not abided by the law to get rid of all its biological weapons.",
    "The chair of the Harvard chemistry department, [Dr. Charles] Lieber, he was over there too, with his own lab specializing in nanotechnology.",
    "If you read the contracts and the studies, they knew … that this gain-of-function work was existentially dangerous and they did it anyway.",
    "Hopefully you can also identify individuals in your local community who are eloquent, articulate and knowledgeable about the facts.",
    "To identify your local district attorney, you can do an online search or simply look up the name up on your most recent ballot.",
    "The FDA that is approving these Frankenshots that are killing and disabling people was involved in the development of COVID-19.",
    "All of these references can be taken to your local prosecutor to seek indictments for murder and conspiracy to commit murder.",
    "Boyle may also make himself available as a consultant or expert witness in cases where a grand jury is successfully convened.",
    "Likewise, [CDC director Rochelle] Walensky, who can’t get her story straight either, she comes from Harvard Medical School.",
    "“About 95% of this biowarfare death science has been funded by Fauci, the NIAID and the NIH, since about 1984,” Boyle says.",
    "President Reagan put Dr. Anthony Fauci in charge of the U.S. biological weapons program, and he’s been at it ever since.",
    "They want to be able to rid the world of certain ethnic groups, hence the focus on DNA-based ethnic-specific weapons.",
    "Each state is hyperlinked, as some have additional information about COVID and their lawsuits on their sites.",
    "All you need to do is convince them to convene a grand jury locally, and indict these criminals for murder.",
    "In fact, he was the one who called for biowarfare legislation at the Biological Weapons Convention of 1972.",
    "When asked what the motive behind this kind of research might be, Boyle highlights two potential reasons.",
    "Harvard Medical School was involved in the development of the COVID-19 biological warfare weapon.",
    "The good news is, by focusing on locally elected prosecutors, we can work around this dilemma.",
    "The lawsuits have been filed in the 5th, 6th, 7th, 8th and 11th Circuit Courts of Appeal.",
    "To stay on topic, I will only review the prosecution of the COVID conspirators here.",
    "And Lieber had also worked for the Pentagon.”\nThe second motivating factor is money.",
    "So, all of this work is “offensive” in that it can be used for military purposes.",
    "They have been empowered by the 10th Amendment to the United States Constitution.",
    "First, he says, there’s a global “Nazi cult” that simply does not want to stop.",
    "For decades, Boyle has advocated against the development and use of bioweapons.",
    "We have a network and a cult of Nazi biowarfare death scientists,” Boyle says.",
    "The U.S. is not alone in creating dangerous biological weapons, of course.",
    "Indeed, Harvard was one of the sponsoring institutions of the Wuhan BSL4.",
    "Instead, we’ve been making more, under the guise of biodefense research.",
    "All dual use research can be used for military purposes, and often is.",
    "Boyle has taught both criminal law and international human rights law.",
    "And the last I read there were well over 400 of these in the country.",
    "They’re like God Almighty up there sitting on these federal benches.",
    "He also still practices criminal law, both prosecution and defense.",
    "Very little of this will be found in mainstream news media reports.",
    "It began with a flat denial of there being U.S. biolabs in Ukraine.",
    "They are democratically elected by the people of their community.",
    "The U.S. also has these kinds of labs in Central Asia, he says.",
    "“The British are also a part of this, the French, the Israelis.",
    "Remember, you need to connect with the prosecutors personally.",
    "These local prosecutors are not part of the federal system.",
    "An email campaign won’t get you anywhere in this scenario.",
    "“The Pentagon does not do missionary work,” he says.",
    "And, by the way, the FDA was involved in this too.",
    "The story changes depending on who’s telling it.",
    "Federal judges are not elected by anyone.",
    "Not so with state and local prosecutors.",
    "So, they’ve got us on both sides here.",
    "What drives the biowarfare industry?",
    "Boyle doesn’t buy any of it.",
    "So, look at the list below.",
    "Now think about that."
  ]
}