{
  "id": 38,
  "mediaId": 8475,
  "date": "2022-02-23",
  "headline": "Arizona Republicans close in on passage of election restrictions",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/010721_voting-arrow-sign_1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/022322_gop_election_restriction_bills/arizona-republicans-close-passage-election-restrictions/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael McDaniel",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Local\nAz House Republicans advanced bills barring same-day voter registration and reeling back COVID-era voting liberties\nShare\nTweet\nThe Arizona House voted Tuesday to advance two election reform bills that would limit the creation of emergency voting centers and prohibit same-day voter registration.",
    "\"If there is a voter who wishes to cast their vote or decide to become a voter on Election Day, we have a safe and secure system in place,\" said state Representative Judy Schwiebert, D-Phoenix.",
    "\"Genuine emergency could be something in my personal life that is going to keep me from voting on Election Day or in a normal standard,\" said state Representative Lorenzo Sierra, D-Avondale.",
    "The House later voted on its third and final read of House Bill 2237, which prohibits same-day registration for voters, arguing it's essential to protect the integrity of future elections.",
    "Now, the GOP is seeking to reel in those liberties with House Bill 2602, which attempts to narrowly define what constitutes an emergency when creating an emergency voting center.",
    "\"We don't use paper lists anymore to figure out who's registered to vote and who's eligible to vote,\" said state Representative Mitzi Epstein, D-Tempe, explaining her vote.",
    "I think that our old systems of requiring time for voter registration and various other delays were all about, do we have enough people to write it down on paper?",
    "\"I believe that our highest duty as legislators is to ensure that people indeed do have the right to vote not that we are taking that right away from them.\"",
    "Election reform has become a vital issue for Arizona Republicans who claim integrity concerns following the 2020 presidential election of Joe Biden.",
    "It was actually an idea that different members of my community had asked me to look at and wanted to make sure that their emergency was valid.",
    "HB 2237 will be sent to the state Senate for deliberations, while HB 2602 will be reviewed one final time before it goes to the Senate.",
    "The COVID-19 pandemic forced many states like Arizona to take new measures to provide options for voters to cast their ballots safely.",
    "Opponents claim the bill only allows voting during a \"genuine emergency\" or war or civil unrest, leaving some with alibis out of luck.",
    "Maricopa County investigated the authenticity of those ballots and found this month that only 37 may have been illegally cast.",
    "And if there's a reason to have an emergency voting center, there should be a reason — war, civil unrest or natural disaster.",
    "\"We were talking about emergency voting centers back in 2018,\" said state Representative Shawnna Bolick, R-Phoenix.",
    "Cyber Ninjas found Biden was lawfully elected but identified what it considered to be 53,304 questionable ballots.",
    "Do I have the ability to call for the establishment of an emergency voting center based on my genuine emergency?",
    "The bills come months after Arizona Republicans contracted the firm Cyber Ninjas to audit the election results.",
    "In 2020, emergency voting was afforded to all eligible voters in the state on the weekend before Election Day.",
    "Arizona currently does not offer same-day voter registration, though 20 other states and Washington, D.C. do.",
    "Democrats believe this bill would stand in the way of benchmarking off those voting jurisdictions.",
    "Opponents of the bill believe registration should be an uninfringed liberty, even on Election Day.",
    "The bill previously passed the House Committee on Government 7-6 on party lines.",
    "Sorry, we missed your input...\nYou must be logged in or register to comment",
    "HB 2602 passed with a verbal ‘aye’ majority, seemingly across party lines.",
    "This bill does not list who is entitled to levy such a genuine emergency.\"",
    "And therefore, to preempt, and to do this overreach is a wrong idea.\"",
    "- 30 -\nhave your say\nComments\nThere are no comments on this report.",
    "HB 2237 passed the open House session 31 to 28, on party lines.",
    "I believe that HB 2602 will address some of those concerns.\"",
    "Tell your friends to follow us on Facebook and Twitter.",
    "Well, we're not doing it that way anymore.",
    "Thanks for reading TucsonSentinel.com.",
    "\"To me, that's a genuine emergency.",
    "\"This wasn't as a result of 2020.",
    "Sorry, comments are closed.",
    "\"We have computers, hello?"
  ]
}