{
  "id": 9005,
  "mediaId": 2590,
  "date": "2022-03-23",
  "headline": "GOP Rep Proposes Law Banning Cities From Charging Home Rental Taxes",
  "image": "https://img.huffingtonpost.com/asset/623b9ee72100009bf55046d4.jpeg?cache=aL5RQdyDHB&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/shawna-bolick-dont-charge-home-rental-taxes_n_623b9e78e4b009ab93018dcc",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1698,
    392,
    1126,
    708,
    6536,
    6515
  ],
  "sentences": [
    "Republican Rep. Shawnna Bolick of Phoenix said her proposed law, added as a last minute “strike everything” amendment in the House Ways and Means Committee she chairs, would give some small relief to renters who have seen metro Phoenix rents soar from 15% to 30% — depending on size and location — in the past year.",
    "(AP Photo/Ross D. Franklin, Pool)\nvia Associated Press\nPHOENIX (AP) — Soaring rents in metro Phoenix and across the state have prompted a new proposal in the Legislature that would bar cities and towns from levying a tax on home and apartment rentals.",
    "But Bolick and other Republican backers of the legislation said cities are swimming in cash, in part because of a 2018 state law that required sales taxes to be collected on goods purchased online and because of federal coronavirus relief funds.",
    "She said cities should “learn to live within their means.”\nThe $152 million in city tax revenue is collected by individual cities, ranging from about $60 million in Phoenix last year to $1,900 collected by the small Navajo County town of Taylor.",
    "Advertisement\nBut representatives for cities say eliminating the $152 million in rental tax revenue collected by 71 of Arizona’s 91 cities would give little help for people who have seen their lease payments skyrocket.",
    "“And I respectfully think that 2% of that $330 that we’re talking about, overnight at the snap of a finger, the relief that we’re talking about is minute.”\nBut Bolick said cutting city taxes is better than nothing.",
    "Republican Rep. Shawnna Bolick of Phoenix said her proposed law would give some small relief to renters who have seen metro Phoenix rents soar from 15% to 30% — depending on size and location — in the past year.",
    "“If this bill were to pass, there are only two scenarios that a mayor and council would have to take,” said Tom Savage, a lobbyist for the League of Arizona Cities and Towns, told the committee.",
    "Democrats on the panel pushed back on Bolick’s contention that cutting off city taxes will help keep people in their homes when they’re seeing monthly rent increases in the hundreds of dollars.",
    "“That’s difficult to do for a small community that has limited ability to raise additional or new resources, especially the imposition of new taxes,” Aarons told the committee.",
    "”Obviously, it’s not a huge amount, but I think its a starting point.”\nIf the legislation is enacted, cities would be barred from collecting rental taxes starting in January.",
    "Advertisement\nPrescott falls right in the middle, with the city of about 45,000 people 100 miles (140 kilometers) north of Phoenix, collecting $2.6 million in rental taxes.",
    "With police and fire taking up a majority of the city budget and cuts there unpalatable, that means all other services would need to be cut by more than 25%.",
    "And the bill as written does not require that money to go back to the tenant, although Bolick vowed to add a provision requiring that if necessary.",
    "“There really is no other option.”\n“Both of those options impact those same renters that this bill purports to help,” Savage said in an interview.",
    "“There are larger issues at stake about a person’s take-home budget and whether they’re deciding on buying food or paying their rent,” Cano said.",
    "Savage noted that in Phoenix, which levies a 2.3% rental tax, a person who pays $1,000 in rent would see a savings of just $23.",
    "And they argued that cutting the revenue would result in cities either raising other taxes or cutting services.",
    "“If we’re trying to look at affordable housing, I think this is one small thing we can do right now” she said.",
    "Rep. Andres Cano of Tucson said a constituent told him about seeing their rent increase by $330 a month.",
    "Advertisement\nTax rates among the cities that charge the tax range from 1% to 4% of the total rent.",
    "Bolick’s proposal passed her committee Wednesday on a party-line vote with Democrats opposed.",
    "Barry Aarons, a lobbyist for Prescott, said losing that tax money would be a big hit.",
    "They are forecast to rise an additional 20% this year."
  ]
}