{
  "id": 9044,
  "mediaId": 2518,
  "date": "2022-03-24",
  "headline": "Arizona lawmakers OK 15-week abortion ban, pass bills on gender issues",
  "image": "https://wehco.media.clients.ellingtoncms.com/img/photos/2022/03/24/AP20213812407883_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676",
  "link": "https://www.arkansasonline.com/news/2022/mar/24/arizona-lawmakers-ok-15-week-abortion-ban-pass-bills-on-gender-issues/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "https://www.arkansasonline.com/staff/the-associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’m terrified that this bill would outlaw health care for a woman having a naturally occurring and tragic and horrible miscarriage and they would not be allowed to get this health care.”\nState Sen. Nancy Barto, the Republican sponsor of the bill, has said she hopes the high court upholds Mississippi’s law banning abortion after 15 weeks.",
    "PHOENIX — The Arizona Legislature on Thursday joined the growing list of Republican-led states to pass aggressive anti-abortion legislation, and also passed bills to prohibit gender reassignment surgery for minors and to ban transgender athletes from playing on girls sports teams.",
    "Since 2017, about 16 trans athletes have received waivers to play on teams that align with their gender identities out of about 170,000 school-based athletes in the state, according to the Arizona Interscholastic Association.",
    "The debate and vote on the 15-week abortion ban came the same morning that the House also debated a ban on transgender girls from playing on the high school or college sports team that aligns with their gender identity.",
    "“It’s obvious this bill is just an excuse to discriminate against transgender girls.”\nSupporters of the Arizona bill said it would prevent children from making permanent decisions that they might later come to regret.",
    "The bill explicitly says it does not overrule a state law in place for more than 100 years that would ban abortion outright if the Supreme Court overrules , the 1973 case that enshrined the right to abortion in law.",
    "“In my opinion, its unfair to allow biological males to compete with biological girls sports.”\nCritics said the legislation dehumanizes trans youth to address an issue that hasn’t been a problem.",
    "“This bill is creating a pointless and harmful solution to a non-existent issue,” Skyler Morrison, a 13-year-old transgender girl, told lawmakers during a committee hearing earlier this month.",
    "“This bill to me is all about biology,” said Republican Rep. Shawnna Bolick, who said she played on a coed team in the 1980s but could not have made the high school boys team.",
    "Republicans have said blocking transgender players from girls sports teams would protect the integrity of women’s sports, fearing that trans athletes would have an advantage.",
    "Similar legislation passed the Idaho House earlier this month but died in the Senate, where some Republicans said they were concerned about restricting parental rights.",
    "“We’re talking about our kids, who are already going to be taking the proper steps with their parents to be able to be who they are,” said Democratic Rep. Andres Cano.",
    "Many point to the transgender collegiate swimmer Lia Thomas, who won an individual title at the NCAA Women’s Division I Swimming and Diving Championship last week.",
    "The House voted on party lines to outlaw abortion after 15 weeks of pregnancy, mirroring a Mississippi law now being considered by the nation’s high court.",
    "But the issue has become front-and-center in Republican-led statehouses since Idaho lawmakers passed the nation’s first sports participation law in 2020.",
    "Two GOP governors this week bucked conservatives in their party and vetoed bills in Indiana and Utah requiring trans girls to play on boys sports teams.",
    "The bill originally would have banned all gender-affirming care, including hormone therapies and puberty blockers but was scaled back in the Senate.",
    "Doug Ducey, an abortion opponent who has signed every piece of anti-abortion legislation that has reached his desk since he took office in 2015.",
    "A bill in West Virginia failed to pass the state Senate by the time its legislative session ended earlier this month after passing the House.",
    "“We’re talking about legislating bullying against children who are already struggling just to get by,” said Democratic Rep. Kelli Butler.",
    "Republican Rep. John Kavanagh compared the vote to the Legislature’s unanimous decision in years past to ban genital mutilation.",
    "“The state has an obligation to protect life, and that is what this bill is about,” Barto said during Senate debate last month.",
    "“I am becoming more frightened by the moment by this bill,” Democratic Rep. Mitzi Epstein said during Thursday’s floor debate.",
    "It is horrific.”\nCritics said the decision should be left to parents, their children and the health care team caring for them.",
    "The Arizona 15-week abortion ban bill contains no exceptions for rape or incest or for a medical emergency.",
    "The House voted Thursday to pass a bill banning gender reassignment surgery for anyone younger than 18.",
    "Florida lawmakers have passed a similar 15-week abortion ban early this month that Republican Gov.",
    "“We should stand the same way today because this is mutilation of children,” Kavanagh said.",
    "Until two years ago, no state had passed a law regulating gender-designated youth sports.",
    "They said surgeries are only performed after extensive care and therapy.",
    "It’s now blocked in court, along with another in West Virginia.",
    "But there are few trans athletes in Arizona schools.",
    "Ducey has not said whether he will sign either bill.",
    "The bill now goes to Republican Gov.",
    "Ron DeSantis is expected to sign.",
    "fighting back tears.",
    "“It is irreversible.",
    "Sponsor Content"
  ]
}