{
  "id": 2138,
  "mediaId": 2641,
  "date": "2022-03-21",
  "headline": "Two Polls Show Close Race Between Masters, Lamon",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=ae4aae41-b330-4921-8dd7-93985d3d5cc6&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/arizona-blake-masters-jim-lamon-senate/2022/03/21/id/1062263/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Mack",
  "authorUrl": "",
  "termIds": [
    1345,
    1941,
    2201,
    2339,
    2394,
    2725,
    4595,
    1029,
    4830
  ],
  "sentences": [
    "\"These numbers are clear – Jim Lamon is moving in the right direction and is the\ncandidate most likely to win the primary as the pro-Trump, America First\nconservative,\" McLaughlin & Associates wrote in an analysis of the findings to Newsmax.",
    "Blake Masters has grabbed the lead in the Saving Arizona PAC poll, according to the Washington Examiner, while businessman Jim Lamon has doubled his support in a March McLaughlin & Associates poll, pulling into a virtual tie for the lead.",
    "Lamon's surge in the latest McLaughlin & Associates Poll has him doubling his support since December and \"the candidate with momentum and positioned to win,\" according to their analysis.",
    "Arizona Attorney General Mark Brnovich, who has been an object of former President Donald Trump's post-2020 election ire, remains in the mix, but his support has tapered off of late.",
    "The Arizona Republican primary to challenge Sen. Mark Kelly, D-Ariz., is shaping up to be a close one between a pair of America First candidates surging in two polls released Monday.",
    "\"Brnovich has nearly universal name identification, yet with his underperforming ballot share, voters are gravitating toward an alternative like Lamon,\" McLaughlin wrote in the memo.",
    "The Saving Arizona PAC poll found Lamon has a 2-point edge in campaign ad recognition as 49% of likely GOP primary voters had seen his campaign ads, compared with 47% for Masters.",
    "The McLaughlin & Associates polled 500 likely Republican primary voters Feb. 2-March 2, and the results have a margin of error of plus or minus 4.5 percentage points.",
    "The Saving Arizona PAC poll results gave Masters a slight edge in the tight three-way race at the top with the margin of error (3.46 percentage points):\nMasters:16%.",
    "''The race to take on Mark Kelly remains close,'' Republican pollster Tony Fabrizio of the polling firm Fabrizio Lee wrote in an exclusive memo to the Examiner.",
    "''The Masters message of fighting for American workers and securing our border is clearly resonating with the Republican primary voters of Arizona.''",
    "The Arizona primary is Aug. 2, and a majority of likely GOP primary voters remain undecided in the race (52%), according to Save Arizona PAC polling.",
    "The Saving Arizona PAC is largely funded by Trump-backing billionaire Peter Thiel, with whom Masters had worked as a venture capitalist.",
    "\"Secondly, among the three candidates, voters say Lamon is the strongest supporter of President Trump's America first agenda.\"",
    "\"Brnovich is moving in the wrong direction and Blake Masters, despite spending millions, is not resonating with voters.\"",
    "Lamon doubled his support among like Arizona GOP primary voters to 22%, pulling into a virtual tie with Brnovich (23%).",
    "Almost half (46%) say Lamon is a conservative in his political beliefs, better than Brnovich's 40% and Masters' 36%.",
    "In the McLaughlin poll, Lamon is now also beating a stagnant Brnovich in likely voters' \"very favorable\" view (19%).",
    "Trump has not endorsed a candidate in the primary race, so Masters and Lamon are jockeying for positioning.",
    "The Saving Arizona PAC poll was conducted March 13-14 by Fabrizio Lee among 800 likely GOP primary voters.",
    "Brnovich's support has fallen 11 points, while Masters is still in striking distance:\nBrnovich: 23%.",
    "\"Lamon has two distinct advantages that put him in the best position to win.",
    "The margin of error was plus or minus 3.46 percentage points.",
    "The filing deadline is April 4.",
    "All rights reserved.",
    "Mick McGuire: 5%.",
    "Justin Olson: 1%.",
    "© 2022 Newsmax.",
    "Special Links:",
    "Brnovich: 14%.",
    "Masters: 18%.",
    "Lamon: 22%.",
    "Lamon: 14%."
  ]
}