{
  "id": 3823,
  "mediaId": 2679,
  "date": "2022-03-03",
  "headline": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation-politics/no-senate-run-for-arizona-gov-ducey-blow-to-gop-recruiting/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STEVE PEOPLES",
  "authorUrl": "https://www.seattletimes.com/author/steve-peoples/",
  "termIds": [
    1345,
    1941,
    2201,
    2321,
    3434,
    79,
    305,
    878,
    1171,
    4830
  ],
  "sentences": [
    "Advertising\n Skip AdSkip AdSkip Ad\nArizona Republicans now look to an early August primary election to pick a nominee from a field of five leading candidates: Attorney General Mark Brnovich; businessman Blake Masters, who has aggressively courted Trump’s endorsement; Mick McGuire, former head of the Arizona National Guard; businessman Jim Lamon; and Justin Olson, a member of the state utility commission.",
    "“Right now I have the job I want,” Ducey wrote, adding that he is “fully committed to helping elect a Republican US Senator from Arizona.”\nDucey’s decision marks another significant recruiting failure for McConnell, R-Ky., and his allies, who also could not persuade popular Republican governors to enter Senate contests in New Hampshire and Maryland.",
    "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state’s high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. Mark Kelly this fall.",
    "Kelly, a retired astronaut and the husband of former Arizona Rep. Gabby Giffords, was elected in 2020 to finish the last two years of the term of the late Republican Sen. John McCain.",
    "Trump has lashed out at Ducey repeatedly for refusing to support Trump’s lies about fraud in the 2020 election and his opposition would have been a major barrier for Ducey.",
    "Ducey, who is barred by term limits from seeking a third term as governor, also notified donors of his decision in a letter, as first reported by The Arizona Republic.",
    "Ducey’s decision was confirmed Thursday by a person with direct knowledge of the conversation who spoke on the condition of anonymity to discuss the private talk.",
    "While Ducey’s move is a big disappointment for McConnell, it comes as good news for former President Donald Trump, a fierce critic of the governor.",
    "Advertising\n Skip Ad\nChris Hartline, a spokesman for the Senate GOP campaign organization, said the Senate contest in Arizona is still competitive.",
    "Ducey has won three statewide races, including a landslide in 2018 when Democrats including Sen. Kyrsten Sinema swept to power in other offices.",
    "Ducey was favored by establishment Republicans drawn to his traditional conservative focus on low taxes, limited regulation and school choice.",
    "He was the CEO of Cold Stone Creamery and oversaw its growth from a small suburban ice cream shop into a national franchise brand.",
    "As head of the Republican Governors Association, Ducey maintains strong ties to donors and influential Republican officeholders.",
    "He played down the divisive social issues that defined the tenure of his Republican predecessor, Jan Brewer.",
    "“We have great candidates running in Arizona, one of whom will beat Mark Kelly in November,” he said.",
    "His feud with Trump might have been helpful in winning over swing voters in the general election.",
    "Ducey told donors that he is temperamentally suited to executive rather than legislative office.",
    "With Ducey out of the race, it’s unclear whether Trump will endorse before the primary election.",
    "His decision to stay on the sidelines opens the door for them to get behind other candidates.",
    "___\nAssociated Press writer Jonathan J. Cooper in Phoenix contributed.",
    "After selling it, he was elected state treasurer and then governor.",
    "The governor did not mention Trump in his letter to donors.",
    "None has emerged as a clear front-runner.",
    "to this report.",
    "STEVE PEOPLES",
    "Arizona Gov."
  ]
}