{
  "id": 6099,
  "mediaId": 2522,
  "date": "2022-02-02",
  "headline": "Oregon Governor puts temporary halt on clemency for felons free-for-all after lawsuit",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2021/08/SG-YouTUbe-OreLegislativeMedia-Kate-Brown.jpg",
  "link": "https://www.bizpacreview.com/2022/02/02/oregon-governor-puts-temporary-halt-on-clemency-for-felons-free-for-all-after-lawsuit-1195438/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Frank Webster",
  "authorUrl": "https://www.bizpacreview.com/author/frank/",
  "termIds": [
    0
  ],
  "sentences": [
    "Melissa Grassl, the victim’s partner at the time, said “I just want to know why I, or any of the other victims, don’t seem to matter to the governor.”\nThe family of Dale Rost III, who was robbed and murdered two days before Christmas in 2005, is not involved in the lawsuit but they hope Brown will deny a clemency request from one of the two convicts charged in Rost III’s murder.",
    "Justin Olson, Rost’s son-in-law, said the governor’s plan to take a month off from pardoning felons is “temporarily good news.”\nLynley Rayburn, who pleaded guilty to her role in Rost’s death in 2006, submitted an application for clemency after serving roughly half of the minimum sentence on her 27.5-years-to-life sentence.",
    "“Our clients, particularly our surviving victims, feel very hopeful and view the Court’s order as a good sign that they are finally being heard and that the law will be enforced,” Monique DeSpain, another attorney at the Mannix Law Firm, told Fox News Digital Tuesday.",
    "As Fox News Digital has reported, Rayburn admitted to sneaking up the driveway of Rost in the middle of the night two days before Christmas in 2005 with her then-boyfriend Gerard “AJ” Smith.",
    "The principal interested parties are family members of murder victims who fear they will see the killers released, many of whom have served only a small percentage of 25-to-life sentences.",
    "The suit alleges that victims’ families were not notified and that Brown is abusing her authority by delegating her powers of clemency to state agencies like the Oregon Board of Parole.",
    "Kevin Mannix, attorney for some of the plaintiffs, said that a judge has ordered that state agencies and the governor respond by Feb. 16, and he scheduled a hearing for Feb. 28.",
    "Samuel Williams lost his developmentally disabled daughter, Jessica, when three teens stabbed her under Portland’s Steel Bridge, then “mutilated” her body and set it on fire.",
    "SIGN UP HERE\nOregon Governor Kate Brown has agreed to temporarily halt granting clemency for felons as she waits for a lawsuit filed against her to play out.",
    "Andrew Johnson killed his own grandmother by stabbing her in the neck and head 10 times, then he stole $2,000 and went on a shopping spree.",
    "Austin French was shot to death on Halloween 2006 by his own brother, Cayche French, who has served 14 years on a 25-to-life sentence.",
    "Oregon District Attorneys Patricia Perlow and Linn County’s Doug Marteeny are joined by the families of three murder victims.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "They then stole his car and drove around the city while using his credit and debit cards.",
    "Convicted killer Richard Alsup has served 16 years of a 25-to-life sentence.",
    "Amy Jones, Williams’ surviving daughter, is also a plaintiff in the suit.",
    "They tied up Rost while ransacking the house, then shot him as they left.",
    "He was carrying a rifle and the pair was high on crystal meth.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "He has served only seven years of a 25-to-life sentence.",
    "The public will not see it and we do not share it.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!"
  ]
}