{
  "id": 6583,
  "mediaId": 2746,
  "date": "2022-02-01",
  "headline": "Gov. Doug Ducey is GOP’s best bet in Arizona Senate race despite opposition from Trump: Poll",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/01/14/state_of_state_arizona_04718_c0-0-3600-2100_s1200x700.jpg?bd461f07e95b0f5f36779822774ec445b04d6d07",
  "link": "https://www.washingtontimes.com/news/2022/feb/1/poll-gov-ducey-gops-best-bet-arizona-senate-race-d/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    1345,
    1941,
    2201,
    2321,
    2725,
    81,
    878,
    1171,
    4830
  ],
  "sentences": [
    "“It makes a lot of sense now why Republican leadership has been actively pursuing Ducey to run in the Arizona Senate contest.”\nMr. Trump has been relentless in his criticism of Mr. Ducey since he ignored his last-minute pleas by certifying the 2020 election results weeks after Election Day.",
    "Doug Ducey of Arizona could reshuffle the Arizona Senate race if he changes course and decides to give it a go, according to a new survey of registered voters that pegged him as the best bet to oust Democratic Sen. Mark Kelly in the 2022 midterm elections.",
    "“Brnovich remains the frontrunner, but what if’s like, ‘What if Ducey decides to run?’ or, ‘what if Trump decides to endorse a candidate?’ could really change the current dynamic of the GOP Primary,” said Mike Noble, OHPI Chief of Research.",
    "The poll found state Attorney General Mark Brnovich was the preferred pick of 25% of voters among the current field of contenders in the race, followed by Michael McGuire who received 11%.",
    "Mr. Ducey, a Republican, has resisted calls to enter the primary race after coming under repeated fire from former President Trump over his refusal to tout his stolen election claims.",
    "“Ducey has been a terrible, terrible representative of your state.”\nMr. Kelly, a former astronaut, is considered one of the most vulnerable Democrats up for re-election this year.",
    "The poll shows things would change if Mr. Ducey enters the race with 35% of voters selecting them as their top choice, followed by Mr. Brnovich, 13%.",
    "He won a special election in 2020 to finish the term of the late Sen. John McCain and is now running for a full six-year term.",
    "The other contenders in that scenario are mired in single digits and the pool of undecided voters drops from 47% to 34%.",
    "The other GOP candidates — Blake McMasters, Jim Lamon, and Justin Olson — registered in the single digits.",
    "The OH Predictive Insights poll showed Mr. Kelly leading an unnamed Republican by a 42% to 38% margin.",
    "Democrats are hoping a messy GOP primary will boost Mr. Kelly‘s chances of defending the seat.",
    "At a rally in Arizona last month, Mr. Trump once again attacked the governor.",
    "“He’s not going to get my endorsement,” Mr. Trump said.",
    "Nearly half of those surveyed said they are undecided.",
    "Gov."
  ]
}