{
  "id": 165,
  "mediaId": 2621,
  "date": "2022-04-11",
  "headline": "Pennsylvania Conservatives Question Trump’s Endorsement of Dr. Oz: ‘What the Hell Was He Thinking?’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/03/GettyImages-1213155428-scaled-e1648765701930.jpg",
  "link": "https://www.mediaite.com/politics/pennsylvania-conservatives-question-trumps-endorsement-of-dr-oz-what-the-hell-was-he-thinking/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kipp Jones",
  "authorUrl": "https://www.mediaite.com/author/kipp-jones/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’d like to know who it is who lives in Pennsylvania that knows the voters well told Trump to pick Oz.”\n“I think that President Trump very, very seldom does anything that’s not thought out and doesn’t have a very reasoned and logical basis, but, for whatever reason, in this particular instance, he chose to ignore all of that and endorse Oz,” he added.",
    "When you’re in television for 18 years, that’s like a poll, that means people like you.”\nOz, whose political credentials don’t exactly align with other candidates Trump has backed in the past, is in a tight race with MAGA candidate Dave McCormick.",
    "In Selma, Trump told supporters, “I endorsed another person today, Dr. Oz in Pennsylvania.”\nThe former president called the former TV star a “good man.” Trump also commented on Oz’s nearly two-decades as a daytime TV mainstay.",
    "“It’s really tough to push that narrative.”\nCambria County, Pennsylvania Republican Committee chair Jackie Kulback told the Washington Examiner she was surprised by the endorsement.",
    "Former President Donald Trump’s endorsement of celebrity TV doctor Mehmet Oz in the Pennsylvania GOP Senate primary has some of his conservative supporters scratching their heads.",
    "A Republican Party lobbyist named Josh Novotney spoke about the surprise endorsement during an interview with the Philadelphia Inquirer.",
    "“The dynamics of this campaign was that [McCormick] was the MAGA guy and Oz was the RINO,” Novotney said.",
    "Ball said he spoke to numerous conservatives who have asked him why Trump would choose Oz over McCormick.",
    "A recent poll in the race shows McCormick leading Oz by one point, 18% to 17% with 33% undecided.",
    "“People have been calling me all day and asking, ‘What the hell was he thinking?’” he said.",
    "Perhaps few were more surprised than Washington County Republican Party chair Dave Ball.",
    "The outlet noted the endorsement of Oz stunned many in the commonwealth.",
    "“Tremendous career, and they liked him for a long time,” Trump said.",
    "“President Trump was very out of sync in picking Oz,” Ball said.",
    "Trump endorsed Oz at his rally in North Carolina on Saturday.",
    "“That’s like a poll, you know?",
    "Have a tip we should know?",
    "tips@mediaite.com"
  ]
}