{
  "id": 1767,
  "mediaId": 2934,
  "date": "2022-04-06",
  "headline": "Pro-Lamb Super PAC Misfires in Attack Ad Against Fetterman",
  "image": "https://cdn.factcheck.org/UploadedFiles/FettermanAd.png",
  "link": "https://www.factcheck.org/2022/04/pro-lamb-super-pac-misfires-in-attack-ad-against-fetterman/",
  "mediaOutlet": "FactCheck",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Farley",
  "authorUrl": "https://www.factcheck.org/author/robert-farley/",
  "termIds": [
    2542,
    3199,
    3279,
    3280,
    4777,
    221,
    305,
    883,
    1171
  ],
  "sentences": [
    "“We expect stations across the commonwealth to follow suit and pull this ad, which is full of lies.”\nAd Repeats GOP Claim\nAs for the ad’s claim that “Fetterman’s been called a silver-spoon socialist,” the small print in the ad attributes that to the “PA GOP.”\nIt’s true that in August 2018, then Pennsylvania Republican Chairman Val DiGiorgio called Fetterman, then a candidate for Pennsylvania lieutenant governor, a “silver spoon socialist,” who “advocates for the redistribution of wealth; single-payer healthcare, and free higher education for all, which would cost Pennsylvania taxpayers $20 billion in new taxes.”\nA week earlier, DiGiorgio sent an email to reporters that “called on other Democratic contenders across the ballot to explain whether they support Democratic Socialist calls for universal Medicare coverage and a $15-per-hour minimum wage, criticizing the policy positions as expensive, anti-individual and having ‘no place in an American society,'” the Morning Call reported on Aug. 21, 2018.",
    "“Anyone that examines either of our records would know that that’s just unfounded.”\nThe Fetterman campaign announced on April 5 that WPVI, an ABC affiliate in Philadelphia, had pulled the Penn Progress ad due to the false claim about Fetterman being a “self-described democratic socialist.”\n“It’s not often that an attack ad starts airing AND gets pulled from TV for being false in the very same day, but as we said earlier today, this ad from Conor Lamb’s super PAC is not only demonstrably false, it’s desperate, and frankly sad,” Joe Calvello, Fetterman campaign spokesperson, said in a press release.",
    "John Fetterman is a ‘self-described democratic socialist.’ He is not.”\nA Forbes story in February 2021 about Fetterman announcing his candidacy for the Senate also called Fetterman “a self-described democratic socialist.” But on April 6, Forbes also added a correction, stating, “This story had incorrectly identified Fetterman as a ‘democratic socialist’—he is not.”\nFetterman was asked directly in a 2016 interview with the Young Turks’ YouTube commentary show if he was a democratic socialist, and Fetterman — then the mayor of Braddock, a suburb of Pittsburgh — said he was not.",
    "The ad also claims “Fetterman’s been called a silver-spoon socialist.” He has, by the chairman of the Pennsylvania Republican Party, who also warned in 2018 that electing Lamb to the House would mean votes in favor of the Democrats’ message of “socialism.”\nFetterman, who serves as lieutenant governor of Pennsylvania, holds a double-digit lead over Lamb and state Rep. Malcolm Kenyatta in the Democratic primary for U.S. Senate in Pennsylvania, according to a recent poll from The Hill and Emerson College.",
    "While Lamb was running in a special House election in 2018, DiGiorgio said Lamb “is part of a party whose main mission seems to be socialism, sanctuary cities and single-payer health care.” DiGiorgio also told Fox News at that time that Democrats have “tried to reinvent (Lamb) to run away from their message of higher taxes, sanctuary cities and socialism.",
    "That just shouldn’t be the case in the United States of America in 2021.”\nAs for higher education, Lamb supports “President Biden’s efforts to guarantee universal preschool and two years of community college.”\nAt a forum in 2019, Fetterman was asked about debt-free or tuition-free public higher education.",
    "That’s not how you beat Republicans.” In the tweet, Lamb described himself as “a normal Democrat.”\nOne Station Pulls Ad\nWhatever one makes of Fetterman’s politics, his campaign says he does not self-identify as a democratic socialist and has never called himself one, as the super PAC ad claims.",
    "But voters know that, at the end of the day, he’s going to vote with the left-leaning leadership in Washington.”\nThe point is, whether you agree with him or not, DiGiorgio was a Republican Party official making partisan statements about Democrats.",
    "The ad from Penn Progress, a super PAC supporting Lamb that has been promoted by veteran Democratic strategist James Carville, tries to paint Fetterman as a socialist who is too big of a risk for Democrats in a general election.",
    "“I cosponsored and helped pass legislation to raise the minimum wage to $15, and index the minimum wage to inflation so there will be automatic raises in the future,” Lamb states on the “issues” page of his campaign website.",
    "Although Lamb has not attacked Fetterman in any campaign ads, he acknowledged to Politico that he was referencing Fetterman when he tweeted in November, “If you want a Senator who runs as a Socialist … I’M NOT YOUR GUY.",
    "According to a WHYY story about the forum, “Fetterman said it would be an ideal, but questioned how that could be achieved financially.”\nDiGiorgio’s concerns about Democrats’ “socialist” agenda extends to Lamb, too.",
    "A super PAC supporting Rep. Conor Lamb for U.S. Senate in Pennsylvania made two misleading claims about the Democratic front-runner, John Fetterman, one of which resulted in a Philadelphia TV station pulling the ad.",
    "Although Pennsylvania’s TV airwaves have been filled with ads from Republican candidates Mehmet Oz and Dave McCormick attacking each other, the discourse on the air had been more civilized on the Democratic side.",
    "The Fetterman campaign also pointed to an April 12, 2019, article in Politico in which Fetterman mocked a GOP-funded billboard that warned of “A MORE SOCIALIST PA,” and included photos of Democratic Gov.",
    "An NPR segment on Nov. 28, 2020, did describe Fetterman as “a self-described democratic socialist,” but a transcript of the story on the NPR website now carries a correction issued on Dec. 6, 2021.",
    "The ad claims Fetterman is “a self-described democratic socialist.” Fetterman has not described himself that way, and the NPR story cited in the ad now carries a correction.",
    "I look at, you know, ‘Can you live off $8.50 an hour?’ When you ask people that, I don’t care how conservative or how liberal they are, no one says, ‘Yes, you can.",
    "He is a critic of so-called “defunding police.” And he held a fundraiser with moderate Democratic Sen. Joe Manchin of West Virginia.",
    "And Sanders, who is a self-described democratic socialist, returned the favor when Fetterman was running for lieutenant governor.",
    "If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.",
    "I don’t label myself a democratic socialist, but I certainly ran the most progressive campaign in my race this past spring.",
    "… Yet marijuana is illegal and we have people, we have citizens of our country imprisoned for marijuana and it’s not legal.",
    "He is an advocate of legalization of marijuana, a $15 minimum wage, addressing climate change and criminal justice reform.",
    "He also has a broader definition of socialism than most Democrats, and it includes some policies that Lamb supports, too.",
    "Fetterman has been critical of Manchin and Sen. Kyrsten Sinema for blocking some of President Joe Biden’s agenda.",
    "Fetterman describes health care as a “fundamental human right,” and he has supported Medicare for All.",
    "You can support yourself and a family in that wage.’ So why do we in this country pretend that we can?",
    "And I genuinely don’t understand as an electorate why we don’t demand these things of our society.",
    "Lamb has tried to draw a distinction with Fetterman by marketing himself as a moderate Democrat.",
    "Fetterman has been a vocal and consistent proponent for a $15 minimum wage, but so has Lamb.",
    "Alcohol kills thousands of people, ruins countless families with addiction, car crashes.",
    "So maybe that might sound progressive or left, but to me that’s just basic common sense.",
    "“It’s absurd that the minimum wage has been stuck at $7.25 for more than a decade.",
    "Tom Wolf and Fetterman, then the Democratic candidate for lieutenant governor.",
    "I think, I could be wrong, but you label yourself as democratic socialist?",
    "Lamb says he wants to “protect and strengthen” the Affordable Care Act.",
    "If you are a full time minimum wage worker, you are living in poverty.",
    "Young Turks reporter, Oct. 4, 2016: And you are very progressive.",
    "We rely on grants and individual donations from people like you.",
    "It says, “This story wrongly states that Pennsylvania Lt. Gov.",
    "In 2016, Fetterman stumped for Bernie Sanders for president.",
    "Credit card donations may be made through our “Donate” page.",
    "Why are we, as a country, arguing about the climate science.",
    "Editor’s note: FactCheck.org does not accept advertising.",
    "No one argues about the science of why cell phones work.",
    "Why is [a] living wage such a controversial subject?",
    "“It was just so comical,” Fetterman told Politico.",
    "You probably have a second job just to survive.",
    "The ad cites NPR as its sources for the claim.",
    "And I don’t really consider it progressive.",
    "The Pennsylvania primaries are May 17.",
    "Please consider a donation.",
    "Marijuana legalization.",
    "This is really simple.",
    "I genuinely don’t.",
    "Climate science.",
    "Fetterman: No.",
    "Until now."
  ]
}