{
  "id": 1887,
  "mediaId": 2526,
  "date": "2022-03-25",
  "headline": "Enes Kanter Freedom: Dr. Oz Works for Turkish ‘Dictator’ Erdogan",
  "image": "https://media.breitbart.com/media/2021/03/drozjeopardy1-640x335.jpg",
  "link": "https://www.breitbart.com/sports/2022/03/25/enes-kanter-freedom-dr-oz-works-turkish-dictator-erdogan/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Bois",
  "authorUrl": "https://www.breitbart.com/author/pbois/",
  "termIds": [
    2232,
    3362,
    3923,
    1163,
    1171,
    5060,
    5239,
    5363
  ],
  "sentences": [
    "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S. senator for Pennsylvania I will only be a U.S. citizen.”\nOz called the attacks from his primary opponent, Dave McCormick, “bigoted,” likening it to when Americans rejected Jews and Catholics.",
    "People in Pennsylvania needs to understand that @DrOz is a Foreign Agent and he works for Dictator @RTErdogan\nAsk yourself, why would a Turkish citizen, who lives in Jersey and works in New York City would want to be the Senator from Pennsylvania.",
    "Oz ignited controversy last week when he said that he would possibly forgo security clearances as a United States Senator in order to maintain dual citizenship with Turkey to care for his ailing mother, who suffers from Alzheimer’s Disease.",
    "It’s completely disqualifying behavior for anyone aiming to serve in the United States Senate.”\nDuring his time at the Boston Celtics, Freedom alleged that he was “begged” by the NBA to remove his “Free Tibet” sneakers from the court.",
    "https://t.co/KhwL439Bc5\n— Enes FREEDOM (@EnesFreedom) March 16, 2022\nEnes Freedom, who was born in Switzerland but grew up in Turkey, became a U.S. citizen in 2021 after criticizing the NBA’s relationship with communist China.",
    "In response to the mounting criticism, Oz said that his dual citizenship with Turkey had become a “distraction,” adding that he will be a committed U.S. citizen if sworn in.",
    "“The bigoted attacks my opponent Dave McCormick has made against me as the child of immigrants or reminiscent of slurs made in the past about Catholics and Jews,” he said.",
    "Recently-minted U.S. citizen Enes Kanter Freedom dubbed Pennsylvania senate candidate Dr. Mehmet Oz a “foreign agent” over his dual-citizenship with Turkey.",
    "“Before the game at Madison Square Garden, two gentlemen from the NBA begged me to take the shoes off,” Freedom told the New York Post last year.",
    "Ask yourself, why would a Turkish citizen, who lives in Jersey and works in New York City would want to be the Senator from Pennsylvania.",
    "“People in Pennsylvania needs to understand that [Dr. Oz] is a Foreign Agent and he works for Dictator [Erdogan].",
    "“I can love my country and love my mom,” he said, prompting sharp criticism from his opponent, Dave McCormick.",
    "Representatives from the NBA denied to the Post that Freedom was ever censored for his sneakers.",
    "“It is a sign of McCormick’s desperate campaign that he’s resorted to this disgraceful tactic.",
    "“My dual citizenship has become a distraction in this campaign,” he said.",
    "!” Enes tweeted on Thursday.",
    "Come on People!!",
    "Come on People!"
  ]
}