{
  "id": 194,
  "mediaId": 2660,
  "date": "2022-04-19",
  "headline": "Dr. Oz misses the facts in calling GOP Senate rival McCormick liberal and supportive of Biden, China",
  "image": "https://static.politifact.com/politifact/rulings/meter-false.jpg",
  "link": "https://www.politifact.com/factchecks/2022/apr/19/mehmet-oz/dr-oz-misses-facts-calling-gop-senate-rival-mccorm/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    2201,
    2232,
    3975,
    4464,
    4578,
    4762,
    878,
    5240
  ],
  "sentences": [
    "In January, on the day he entered the Senate race, McCormick wrote an opinion column saying \"it is past time for America’s leaders to confront head-on the Chinese Communist Party (CCP), which poses the greatest economic and national security threat to the United States….I will do everything in my power to end our dependence on China, protect our communities and our jobs, counter their attempts to reshape the world in their authoritarian image, and ensure America remains the world’s unrivaled military and economic superpower.\"",
    "RELATED: No proof for Dr. Oz’s claim that Pa. GOP Senate rival Dave McCormick ‘paid for attacks’ on Trump\nRELATED: In Pa. Senate run, Dr. Oz casts self as pro-Second Amendment, but he has backed gun-control measures\nRELATED: 2022 candidates use ads vowing to be tough on China, or attacking rivals as too soft on China",
    "On his campaign website, McCormick advocates for \"moving critical supply chains out of China and bringing manufacturing jobs back home; protecting American jobs and intellectual property; sanctioning China for its crimes, including trafficking fentanyl into the U.S\"; and \"seeking reparations\" for COVID-19.",
    "One section says that during the 2008 financial crisis, McCormick said that because both the U.S. and Chinese economies had major financial interests in avoiding a global economic collapse, China was behaving like \"a responsible participant and ally\" in dealing with the financial crisis.",
    "In a review of his speeches, comments and essays, as both a public official and private citizen, the Philadelphia Inquirer reported that McCormick in the late 2000s praised China’s economic growth and touted the benefits of U.S. access to a vast, rising market.",
    "But a January Oz ad attacking McCormick on China cited a November Wall Street Journal report that said Bridgewater Associates, where McCormick was CEO, had \"raised the equivalent of $1.25 billion for its third investment fund in China.\"",
    "But McCormick has also raised concerns about the nation’s influence, writing in 2006 that \"China’s emergence as a major economic power is one of the most significant developments of the 21st century, requiring a thorough review of U.S.",
    "Besides McCormick and Oz, the major Republican candidates are commentator Kathy Barnette, real estate developer Jeff Bartos, Philadelphia attorney George Bochetto and Carla Sands, who served as Trump's ambassador to Denmark.",
    "On the campaign trail, McCormick claimed, in reference to the Afghanistan withdrawal, that \"the Biden administration’s bureaucracy and incompetence led to one of the most calamitous blunders on the world stage in history.\"",
    "The hedge fund McCormick led until January has invested heavily in China; McCormick in the late 2000s praised China’s economic growth and touted the benefits of U.S. access to the Chinese market, but also raised concerns.",
    "McCormick’s core policies include encouraging coal mining and natural gas; toughening immigration enforcement, including building Trump’s border wall; opposing vaccine mandates; and enacting voter ID requirements.",
    "In a recent TV ad, Oz touted his endorsement from former President Donald Trump as proof of his GOP credentials and then attacked his rival, Dave McCormick, as being on the opposite end of the political scale.",
    "They include Sen. Ted Cruz, R-Texas, former Trump Secretary of State Mike Pompeo, and Sarah Huckabee Sanders, the former Trump White House press secretary and current GOP candidate for Arkansas governor.",
    "The New York Times reported in January that when McCormick announced he would step down as CEO to run for the Senate, his company’s fund managed roughly $1.5 billion on behalf of Chinese investors.",
    "McCormick on his campaign website blasts Biden for the highest inflation in 40 years, for \"open border policies\" and \"foreign policy blunders,\" including the U.S. withdrawal from Afghanistan.",
    "Leaving aside questions about Oz’s own credentials as a conservative, the physician and TV personality misfired in his attempt to brand the former hedge fund CEO as liberal and pro-Biden.",
    "For example, in a speech at Peking University in Beijing in 2007, McCormick spoke about \"the huge interest each of our countries has in the continued growth and prosperity of the other.",
    "Contest could help decide Senate control\nThe Pennsylvania race is for the seat held by Republican Pat Toomey, who was first elected in 2010 and decided not to seek re-election.",
    "In a broader attack, McCormick praised Trump and claimed that Biden \"managed to squander\" low gas prices, an economic recovery and more \"inherited\" from Trump.",
    "Trump endorsed Oz, says the narrator in the 30-second spot, \"because Trump knows who the real conservative is who’s going to shake up Washington.",
    "He called for \"targeted controls\" on U.S. exports to China to prevent helping China expand its military in ways that threaten U.S. interests.",
    "McCormick’s campaign also referred us to another website paid for by the campaign that refutes what it calls lies about McCormick and China.",
    "McCormick has had some more conciliatory things to say about China in the past, but even that was tempered with comments of concern.",
    "McCormick served in senior posts in the Bush administration at the Commerce Department, the Treasury Department and the White House.",
    "On COVID-19 mandates, McCormick says that unlike Biden, he \"trusts the American people and stands for personal freedom.\"",
    "He is campaigning on standing up to China, including launching his race with a promise to end U.S. dependence on China.",
    "Dr. Mehmet Oz wants voters to know that he is the genuine conservative in the race for Pennsylvania’s U.S. Senate.",
    "Oz’s campaign did not reply to our requests for information to back the ad’s claim that McCormick is \"pro-China.\"",
    "If Your Time is short\nMcCormick served in the Bush administration and has staked out conservative positions.",
    "The Real Clear Politics polling average shows McCormick in the lead by 4.2 percentage points over Oz.",
    "But McCormick did not say China was an ally of the United States generally in other broader matters.",
    "On April 15, McCormick told Fox Business that Biden has a \"socialist agenda\" and a \"war on energy.\"",
    "McCormick’s history with China is more nuanced, but his campaign rhetoric is not friendly to China.",
    "Featured Fact-check\nAnd as far as McCormick’s campaign rhetoric goes, it has not been \"pro-China.\"",
    "McCormick’s campaign has hired former Trump White House aides Stephen Miller and Hope Hicks.",
    "McCormick also criticized Biden after he delivered his State of the Union address in March.",
    "Overall, the Nov. 8 general election race is rated as a toss-up and as \"tilts Republican.\"",
    "The outcome could help determine which party controls the Senate, now split 50-50.",
    "It’s not David McCormick, the liberal, pro-Biden, pro-China Wall Street insider.\"",
    "McCormick is not running as a liberal and has worked for a Republican president.",
    "He is married to Dina Powell, who was Trump’s deputy national security adviser.",
    "McCormick also ran a campaign ad falsely claiming that China created COVID-19.",
    "Our ruling\nOz said in an ad that McCormick is \"liberal, pro-Biden, pro-China.\"",
    "McCormick touts a conservative agenda and has been harshly critical of Biden.",
    "John Fetterman, state Rep. Malcolm Kenyatta and U.S. Rep. Conor Lamb.",
    "McCormick has a roster of conservative key backers.",
    "\"It's time to make them pay for it,\" his ad said.",
    "When China succeeds, the United States succeeds.\"",
    "The leading Democratic candidates are Lt. Gov.",
    "McCormick has been highly critical of Biden.",
    "McCormick has campaigned attacking China.",
    "The primaries are May 17.",
    "We rate this claim False.",
    "policy.\""
  ]
}