{
  "id": 215,
  "mediaId": 2621,
  "date": "2022-04-13",
  "headline": "Laura Ingraham Hits Trump and Hannity for Endorsing Dr. Oz in Senate Race: ‘It Was a Mistake’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-12-at-11.37.40-PM.jpg",
  "link": "https://www.mediaite.com/tv/laura-ingraham-hits-trump-and-hannity-for-endorsing-dr-oz-in-senate-race-it-was-a-mistake/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Luciano",
  "authorUrl": "https://www.mediaite.com/author/michael-luciano/",
  "termIds": [
    0
  ],
  "sentences": [
    "So many people want it, they make the trek to Bedminster or Mar-a-Lago–”\nThe host cut her off and asked, “Was it a mistake, Kellyanne?”\nRather than talk up her preferred candidate – McCormick – Conway praised Trump, who was on the record as being pro-abortion until he ran for president.",
    "On Tuesday’s Ingraham Angle, the Fox News host played years-old clips of Oz expressing concerns about climate change, the ability of mentally unwell people to purchase firearms, and states enacting strict anti-abortion laws.",
    "Subscribe to\nLaura Ingraham is none too pleased with Donald Trump’s endorsement of Mehmet Oz for U.S. Senate in Pennsylvania, or Sean Hannity’s for that matter.",
    "“Well, President Trump’s endorsement in these Republican primaries is a highly sought after and deeply consequential piece of political currency.",
    "“Hannity, I think, I believe endorsed Oz and I think that’s, you know, that’s probably not inconsequential for President Trump,” she said.",
    "She also accused Oz of making “rookie mistakes.”\nIngraham then noted that her Fox News colleague Sean Hannity is partial to Oz.",
    "The host welcomed former Trump adviser Kellyanne Conway to the show to discuss the endorsement.",
    "Oz is seeking the Republican nomination and hopes to replace the retiring Pat Toomey (R-PA).",
    "“Do you think the Trump endorsement of Oz was a mistake?” Ingraham asked Conway.",
    "For Ingraham, his previous positions on these issues are disqualifying.",
    "“You wouldn’t answer the question whether it was a mistake.",
    "It was a mistake to endorse Oz.”\nWatch above via Fox News.",
    "Conway has endorsed Dave McCormick in the primary.",
    "She said he had a “conversion” on the issue.",
    "I think it was a mistake to endorse Oz.",
    "Have a tip we should know?",
    "I’m not afraid to say it.",
    "Want to avoid video ads?",
    "tips@mediaite.com",
    "I’ll say it."
  ]
}