{
  "id": 2156,
  "mediaId": 2660,
  "date": "2022-03-29",
  "headline": "Dr. Oz claimed that GOP Senate rival McCormick ‘bragged’ about offshoring jobs. That lacks evidence",
  "image": "https://static.politifact.com/politifact/rulings/meter-mostly-false.jpg",
  "link": "https://www.politifact.com/factchecks/2022/mar/29/mehmet-oz/dr-oz-claimed-gop-senate-rival-mccormick-bragged-a/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    1342,
    2201,
    2232,
    4578,
    4762,
    878,
    1171,
    5239,
    5249
  ],
  "sentences": [
    "McCormick was the under secretary for export administration and headed the department’s Bureau of Industry and Security, which worked to advance U.S. national security, foreign policy and economic interests, according to a White House statement at the time.",
    "\"McCormick said his experience as a corporate CEO helping companies to move work offshore, and as a platoon leader in the Army during the first Gulf War, will serve him well in his new post,\" the article said.",
    "Featured Fact-check\nA McCormick campaign spokesperson told PolitiFact: \"Any jobs created in India or outside of the U.S. were completely separate of any decisions and organizational job layoffs in Pittsburgh.\"",
    "The article paraphrased him as saying that his work in \"helping companies to move work offshore\" and his military leadership service would help him in a new position with the U.S. Commerce Department.",
    "The other major GOP candidates include conservative commentator Kathy Barnette, real estate developer Jeff Bartos and Carla Sands, who served as President Donald Trump's ambassador to Denmark.",
    "A company spokesperson said, according to the article, that the new center would not affect the employment at the Pittsburgh headquarters, which had about 650 people after the 50 layoffs.",
    "The race for the GOP nomination for an open U.S. Senate seat in Pennsylvania has been marked by attacks exchanged between two of the leading Republicans, Dr. Mehmet Oz and Dave McCormick.",
    "Ads from Oz, the physician and talk show host, have targeted the business record of McCormick, who is the former chief executive of the Bridgewater Associates hedge fund.",
    "At the same time, text on the screen says, \"bragged about ‘helping companies to move work offshore’\" and cites as its source an Oct. 12, 2005 Tribune Review article.",
    "A few weeks after the cuts, a local news report said McCormick announced that the company would open a facility in India employing more than 100 people.",
    "Similar claims about McCormick and outsourced jobs have also been featured in TV ads launched by the Oz campaign and by a super PAC supporting Oz.",
    "It includes a clip of Oz speaking at his own campaign event, saying that he, like former President Donald Trump, \"came from outside politics.\"",
    "The Pennsylvania race is for the seat held by Republican Pat Toomey, who was first elected in 2010 and decided not to seek re-election.",
    "One Oz TV ad begins with the narrator saying: \"David McCormick fired Pennsylvanians and bragged about shipping their jobs to Asia.\"",
    "In 2003, a former Pittsburgh-based software company named FreeMarkets cut 50 Pittsburgh jobs, according to local news reports.",
    "That article was about McCormick’s appointment to a top Commerce Department post in President George W. Bush’s administration.",
    "Our ruling\nAn Oz campaign ad said McCormick \"fired Pennsylvanians and bragged about shipping their jobs to Asia.\"",
    "If Your Time is short\nA Pennsylvania firm once run by U.S. Senate candidate Dave McCormick cut 50 jobs in 2003.",
    "Oz’s ad contains an element of truth but ignores critical facts that would give a different impression.",
    "In a 2005 news article cited by Oz’s ad, McCormick does not mention the company or the job cuts.",
    "In the 2005 article cited in Oz’s ad, McCormick is not quoted about the company or the layoffs.",
    "Overall, the Nov. 8 general election race is rated as a toss-up and as \"tilts Republican.\"",
    "Oz’s campaign did not respond to our requests for information to back up the claim.",
    "The outcome could help determine which party controls the Senate, now split 50-50.",
    "The ad portrays McCormick as a Wall Street insider who \"will sell us out.\"",
    "But there’s no proof that McCormick “bragged” about offshoring the jobs.",
    "In 2003, McCormick was the CEO of a Pittsburgh company that cut 50 jobs.",
    "That same year, the company announced plans to open a center in India.",
    "That same year, the company announced plans to open a center in India.",
    "The article cited in the ad does not prove Oz’s claim.",
    "The major Democratic candidates include Lt. Gov.",
    "The article made one reference to offshoring.",
    "McCormick was the company’s CEO at the time.",
    "John Fetterman and U.S. Rep. Conor Lamb.",
    "The primaries are May 17.",
    "We rate it Mostly False."
  ]
}