{
  "id": 241,
  "mediaId": 6571,
  "date": "2022-04-11",
  "headline": "Donald Trump endorses Mehmet Oz for US Senate in Pennsylvania",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/04/11/73e45839-e921-48cc-b066-8274128dfc29/thumbnail/1200x630/f799211d3afde7fe1c4ef5ca263b1109/dr-oz.png",
  "link": "https://www.cbsnews.com/pittsburgh/news/donald-trump-endorses-mehmet-oz-senate/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Delano",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Bretz, who comes from one of the vote-rich counties in this region, says he's not surprised by Trump's endorsement but says there's lots of time for the other candidates to make their cases to the voters.",
    "In September 2001, Jon joined KDKA full time as the Money & Politics Editor and this region's only political analyst who covers national and local issues that affect hometown residents.",
    "There's a string of relationships that tie Dr. Oz to Donald Trump,\" Bill Bretz, chair of the Westmoreland County Republican Party, told KDKA political editor Jon Delano on Monday.",
    "Sean Parnell was former President Trump's first endorsed candidate for U.S. Senate before Parnell dropped out to fight for custody of his young children in a divorce battle.",
    "\"Donald Trump certainly has a big platform, so when he puts out an endorsement for somebody, it's going to make a headline, and the candidates should want to embrace that.",
    "In a statement, Trump wrote, \"Mehmet Oz will be the one most able to win the general election ... Women, in particular, are drawn to Dr. Oz for his advice and counsel ...",
    "\"I think (former) President Trump may be getting bad advice, unfortunately, and I think that the voters are going to have to decide - who do they trust,\" says Sands.",
    "\"He has advocated for positions that are exactly the opposite of what (former) President Trump has stood for during his four years in office,\" says Parnell.",
    "PITTSBURGH (KDKA) - Former President Donald Trump has endorsed Dr. Mehmet Oz for the Republican U.S. Senate nomination in next month's Pennsylvania primary.",
    "In:\nUnited States Senate\nMehmet Oz\nDonald Trump\n Jon Delano\nJon Delano is a familiar face on KDKA, having been the station's political analyst since 1994.",
    "But in a race like this, a highly contested race among several people, these endorsements can be divisive as much as they can be decisive,\" says Bretz.",
    "\"To me, it meant a lot because I was a political outsider, never intended to run for any political office,\" Parnell told KDKA's Jon Delano on Monday.",
    "In addition to Oz, the other GOP candidates include Kathy Barnette, Jeff Bartos, George Bochetto, Sean Gale, Dave McCormick and Carla Sands.",
    "Racking up endorsements - you can't replace grassroots efforts and meeting folks with endorsements and television commercials,\" says Bretz.",
    "Almost every Republican wants Donald Trump's support, and many have strong ties to the former president and his White House team.",
    "Westmoreland County Republican chair Bretz says while Trump's endorsement carries clout, voters will make up their own minds.",
    "Saying this is all about winning elections, former President Trump gave his \"complete and total endorsement\" to Mehmet Oz.",
    "With Parnell out of the race, Trump has now endorsed Oz, calling Oz the Republican most able to win the general election.",
    "\"I think the most important thing for any candidate to do is get out there and connect with as many people as possible.",
    "Likewise, he will do very well in Philadelphia and Pittsburgh, where other candidates will just not be accepted. \"",
    "I think it surprised me and most of the Republican party, specifically the base here in this state.",
    "It was a bit of a weekend surprise, and not everyone is clear about what impact it will have.",
    "KDKA reached out to all, and former Trump Ambassador Sands had this comment.",
    "But in the end, it was celebrity doctor Mehmet Oz who got Trump's support.",
    "Parnell has endorsed McCormick, who says Oz is a Republican in name only.",
    "Oz, of course, disputes that but was not available for an interview.",
    "<strong>Parnell:</strong> \"Yes, it was a little perplexing.",
    "<strong>Delano:</strong> \"Did that surprise you?\"",
    "Parnell said Trump's support meant a great deal.",
    "My phone, Jon, has been ringing off the hook.\"",
    "\"I don't know if it's a surprise necessarily.",
    "The primary is in just five weeks.",
    "Twitter Facebook",
    "Make no mistake."
  ]
}