{
  "id": 2778,
  "mediaId": 2594,
  "date": "2022-03-16",
  "headline": "Dr Oz reverses course on keeping Turkish citizenship if elected to Senate",
  "image": "https://static.independent.co.uk/2022/02/26/12/Election_2022-Pennsylvania-Senate_16597.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/senate-dr-oz-turkish-citizenship-b2037497.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Feinberg",
  "authorUrl": "https://www.independent.co.uk/author/andrew-feinberg",
  "termIds": [
    1342,
    2232,
    1092,
    1124,
    1171,
    5239,
    5363,
    5371
  ],
  "sentences": [
    "Dr Oz, who was born in Ohio and is a US citizen, but acquired dual Turkish citizenship through his parents and maintained it as an adult through service in the Turkish Army, had previously told reporters he would not renounce his Turkish citizenship even if it means he must forego the access to classified information granted to members of Congress.",
    "According to guidelines published by the Office of the Director of National Intelligence, “the fact that a US citizen is also a citizen of another country is not disqualifying without an objective showing of a conflict [with US interests] or an attempt at concealment”.",
    "Asked whether dual citizenship would prevent him from holding a security clearance, he replied: “I can love my country and love my mom” and said he would not accept a clearance if elected, according to Politics PA.",
    "Television doctor turned Republican Senate candidate Dr Mehmet Oz now says he will give up his Turkish citizenship if elected to replace Pennsylvania senator Pat Toomey in November.",
    "Dr Oz had been under fire from a primary opponent, Dave McCormick, who charged that he could not serve in the upper chamber of the US legislature if he held “dual loyalties”.",
    "Yet the question of whether Dr Oz could receive a US security clearance would be irrelevant to whether he can access classified information if elected to the Senate.",
    "\"I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S.",
    "However, Dr Oz’s prior service in the Turkish armed forces “could raise a security concern and may be disqualifying”, according to the same guidelines.",
    "But there is no prohibition on dual citizens serving in Congress, nor does dual citizenship preclude a person from holding a security clearance.",
    "He had attributed his decision to retain his Turkish citizenship to the need to care for his mother, who suffers from Alzheimer’s disease.",
    "But the former TV show host has now told Fox News that he will indeed give up his Turkish passport in order to serve in the senate.",
    "Under US law, anyone elected to Congress is deemed to be trustworthy enough to access such information if their duties demand it.",
    "“My dual citizenship has become a distraction in this campaign,\" he said.",
    "Senator for Pennsylvania I will only be a U.S. citizen”."
  ]
}