{
  "id": 3172,
  "mediaId": 2590,
  "date": "2022-03-16",
  "headline": "Mehmet Oz Says He'll Give Up Dual Citizenship If Elected To Senate",
  "image": "https://img.huffingtonpost.com/asset/6232158a240000649b96cda7.jpeg?cache=aVP79rOaAh&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/dr-oz-pennsylvania-senate-turkish-citizenship_n_623214f7e4b05c6acabbb237",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    2232,
    4289,
    1171,
    5050,
    5239,
    5363,
    5371
  ],
  "sentences": [
    "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S. senator for Pennsylvania, I will only be a U.S. citizen.”\nAdvertisement\nThe Republican candidate, who achieved fame for hosting the long-running “Dr.",
    "Oz, in turn, told Fox News the attacks on his nationality were “bigoted.”\nTo be a senator, you have to be at least 30 years old, live in the state you intend to represent at the time of the election and have been a U.S. citizen for at least nine years.",
    "Mark Pynes/The Patriot-News via Associated Press\nAfter some initial confusion about his position, Mehmet Oz said he would give up his dual Turkish citizenship if elected to the U.S. Senate in Pennsylvania.",
    "https://t.co/5BAlPcBIyV\n— Casey Contres (@ccontres) March 16, 2022\nThere’s no law against dual citizenship in Congress, but Oz’s opponents framed his status as a potential conflict of interest.",
    "Oz Show,” appeared to signal the exact opposite of this in an interview with a Pennsylvania media outlet, saying he would keep it to be able to care for this mother, who lives in Istanbul.",
    "Dual citizens have served in Congress, but some, like Sen. Ted Cruz (R-Texas), who was born in Canada, ended up renouncing their non-U.S. citizenship once it became public knowledge.",
    "Oz talked about his Turkish heritage in a 2011 interview with SJ Magazine:\n“The great thing about America is that you can hold on to whatever heritage you come from,” he explained.",
    "In a heated campaign for an open Senate seat, Oz’s opponent, Dave McCormick, called on Oz to renounce his dual citizenship and questioned why Oz didn’t serve in the U.S. military.",
    "“We celebrate the different cultures, so I had the privilege, as the son of immigrant parents, to grow up American while staying deeply in touch with my Turkish roots.",
    "I have a great deal of family back in Turkey, I lived there for a period as a boy and I served in the Turkish military, which is compulsory for dual citizenship.”",
    "Mehmet Oz, a Senate candidate who had gained fame as host of \"The Dr. Oz Show,\" hadn't previously addressed his dual U.S.-Turkish citizenship.",
    "His campaign manager denied that report, which also erroneously implied that senators receive an explicit security clearance.",
    "Lawmakers are privy to sensitive information through classified briefings, which they agree not to disclose.",
    "“My dual citizenship has become a distraction in this campaign,” Oz told Fox News on Wednesday.",
    "His parents were born in Turkey and immigrated to the United States in the 1950s.",
    "Also - you can have a dual citizenship and full security clearance in congress.",
    "I’ve asked the reporter to correct his reporting as it’s inaccurate.",
    "During medical school, he served in the Turkish army.",
    "Oz is of Turkish descent on both sides of his family.",
    "Even asking this question is ridiculous.",
    "In reality, there’s no such thing.",
    "Oz was born in Cleveland, Ohio.",
    "I was standing right there.",
    "Cruz gave his up in 2014.",
    "Dr. Oz never said this."
  ]
}