{
  "id": 3335,
  "mediaId": 6570,
  "date": "2022-03-14",
  "headline": "Dave McCormick has dropped millions into Pa.'s U.S. Senate race, but it's hard to trace where it's coming from",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/GettyImages-77549420-7-1647258728.jpg",
  "link": "https://www.post-gazette.com/news/politics-state/2022/03/14/dave-mccormick-for-us-senate-pennsylvania-donations-super-pac-finances-funding/stories/202203140012",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Tamari",
  "authorUrl": "",
  "termIds": [
    1342,
    1560,
    2201,
    3670,
    4406,
    4464,
    4762,
    1171,
    5239,
    5371
  ],
  "sentences": [
    "Because he only entered the race in January, Mr. McCormick, a former hedge fund executive seeking the Republican nomination in Pennsylvania, won’t have to publicly disclose anything about his personal finances or who’s funding his campaign until mid-April, about a month before the May 17 primary.",
    "But Mr. McCormick, until recently head of Bridgewater Associates, the world’s largest hedge fund, came to the race with his own money and a network of ultra-wealthy supporters tied to him and his wife, Goldman Sachs executive Dina Powell McCormick.",
    "That means Mr. McCormick and his allies will have had roughly three months of spending without any meaningful scrutiny of the sources of his wealth, his financial interests, or the funding pouring into his campaign.",
    "Ms. Szymanski, McCormick’s spokeswoman, said his support has come from a wide range of Republicans — citing endorsements from figures like Texas Sen. Ted Cruz and former Secretary of State Mike Pompeo.",
    "Mr. McCormick began his campaign in January so he could fulfill a request from the board of his hedge fund, Bridgewater Associates, to remain on through 2021, said campaign spokesperson Jess Szymanski.",
    "All the other major candidates in the GOP and Democratic Senate primaries have filed personal financial disclosures and multiple rounds of fund-raising reports after much earlier campaign launches.",
    "Similarly, the super PAC backing him — and slamming GOP rival Dr. Mehmet Oz on television — has revealed only a fraction of the donations powering its mammoth spending on Pennsylvania’s airwaves.",
    "Super PACs like the one spending heavily for Mr. McCormick can have a major influence on campaigns because they can accept donations of any size, in excess of the $5,800 limit to candidates.",
    "Through last week the group has spent $7.7 million on ads, on top of the $6.5 million in airtime Mr. McCormick’s campaign bought, according to the advertising tracking firm AdImpact.",
    "Just one of Mr. McCormick’s supporters, fellow hedge fund executive Kenneth Griffin, wrote a $5 million check to the pro-McCormick super PAC, accounting for much of its early haul.",
    "Reports on donations reveal what interest groups, powerful donors, and grassroots activists might be supporting them, and how much candidates are spending from their own pockets.",
    "Personal disclosure reports shed light on candidates’ personal financial interests, revealing estimates of their overall wealth, their incomes, investments, and assets.",
    "And it showed the names of some early donors backing him, including members of his wife’s family and former President Donald Trump’s Commerce Secretary Wilbur Ross.",
    "Mr. McCormick’s financial ties have already come under question due to the hedge fund’s more than $1 billion investment in China last year, while he led the outfit.",
    "Even though he was holding events, and airing more than $1 million of TV ads introducing himself in December, he only formally announced his campaign on Jan. 13.",
    "Dr. Oz’s first fund-raising report, meanwhile, revealed that roughly three-quarters of his initial support from donors came from people outside Pennsylvania.",
    "“The only special interests Dave will cater to are the people of Pennsylvania,” she said in a statement, while attacking Dr. Oz’s personal financial ties.",
    "As for what his own immense wealth looks like, he sought and received an extension for his personal disclosure in December, as candidates routinely do.",
    "Part of what makes the race unusual is the sheer amount of money being spent so early in the campaign, thanks to the candidates’ incredible wealth.",
    "Typically such heavy advertising starts later, and there’s less time between the TV wave and the reports that show who’s funding them.",
    "No campaign team in America is spending more on a single Senate race right now than David McCormick and the super PAC supporting him.",
    "(Top Democratic candidates only began advertising on TV in recent days, while some Republicans have been on the air since November).",
    "He has spent more than $8 million on TV through the end of last this week, the most of any individual candidate in the country.",
    "A super PAC supporting Dr. Oz has been dwarfed by the one backing Mr. McCormick, leaving Dr. Oz outspent on TV overall.",
    "It’s unclear how much of his campaign spending comes from his own resources, and how much has been funded by donors.",
    "They’re intended to help voters understand who might seek influence with each candidate or who backs their views.",
    "The spending blitzes have reshaped the race, public polling shows, elevating Mr. McCormick while damaging Dr. Oz.",
    "Had he launched his campaign before Dec. 31, he would have been required to file public reports sooner.",
    "The super PAC has reported a handful of donations but also won’t file its next report until mid-April.",
    "That set April deadlines for his first personal financial disclosures and campaign finance reports.",
    "He entered the race in November, so he has had to disclose his initial month of campaign donations.",
    "Dr. Oz, the celebrity surgeon, says he has spent $10 million of his own money on the campaign.",
    "He also hasn’t had to reveal details of his significant personal finances yet.",
    "It’s a similar, though not entirely parallel, situation with Dr. Oz.",
    "Mr. McCormick and his allies are following the law on disclosure.",
    "But good luck finding out where all that cash comes from.",
    "His campaign declined to comment for this story.",
    "First Published March 14, 2022, 3:30am",
    "It’s now due April 6."
  ]
}