{
  "id": 4571,
  "mediaId": 2658,
  "date": "2022-02-16",
  "headline": "To the FARA Unit, with love",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/02/16/to-the-fara-unit-with-love-00009566",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "To the FARA Unit",
  "authorUrl": "https://www.politico.com/staff/caitlin-oprysko",
  "termIds": [
    2239,
    2979,
    3301,
    3384,
    651,
    691,
    967
  ],
  "sentences": [
    "The Committee to Protect Journalists urged the department to be wary about compelling foreign-owned media outlets to register under FARA, and to be cognizant of the fact that authoritarian nations have used FARA to justify crackdowns on “legitimate news outlets around the world.”\n— Meanwhile several entities submitted anonymous comments, reflecting that “even what is essentially compliance with a U.S. regulatory regime is viewed as potentially reputation damaging because of how many regard it as a quote-unquote … mark of the beast to be known as a quote, foreign agent,” Wiggin and Dana’s Laufman said, despite FARA registrants being “engaged in lawful activities.”\nMOVING ON UP: “Meta Platforms Inc. Chief Executive Officer Mark Zuckerberg has promoted his top policy executive, Nick Clegg, to an even greater role inside the company — a move that will mean less involvement in future policy decisions for the CEO and Chief Operating Officer Sheryl Sandberg,” Bloomberg’s Kurt Wagner reports.",
    "Zuckerberg, in particular, has spent more time in recent years on issues like content moderation and regulation than he would like, according to sources familiar with his thinking,” and “would rather dedicate more time to Meta’s technology and products — areas where he is more experienced — including plans to build a new immersive version of the internet known as the metaverse, say people familiar with his thinking.”\nCLUB FOR GROWTH TARGETS LATINOS OVER BIDEN SUPREME COURT PICK: While conservative judicial groups may not be readying a scorched-earth fight to block President Joe Biden’s nominee to replace Justice Stephen Breyer on the Supreme Court, the Club for Growth is rolling out an ad blitz in Washington, D.C., and in several Latino-heavy swing states bashing Biden’s vow to nominate a Black woman for the opening.",
    "The American Council on Education asked FARA Chief Jennifer Gellie on behalf of 16 other groups representing universities to “maintain, and indeed strengthen,” the exemption within FARA for activities in furtherance of “bona fide religious, scholastic, academic and scientific pursuits or of the fine arts.” OpenSecrets, along with the Demand Progress Education Fund, offered suggestions on how DOJ should go about labeling content from foreign agents posted on digital platforms or on streaming services, and asked that the department require data to be machine readable and more easily accessible, as well as include more context in the FARA Unit’s advisory opinions.",
    "To the FARA Unit, with love\nBy CAITLIN OPRYSKO\n02/16/2022 04:34 PM EST\nPresented by\nWith Daniel Lippman\nTO THE FARA UNIT, WITH LOVE: Last Friday’s deadline for submitting recommendations to the Justice Department for its impending rulemaking on FARA regulations — the first substantial revisions to the Nazi-era statute in decades — has come and gone, and while it looked for a bit as though the comment period had inspired a lackluster interest in weighing in, the advance notice of proposed rulemaking drew a flurry of comments at the last minute, the nearly three dozen of which were finally posted to the federal register on Tuesday afternoon.",
    "— The group will run an English-language ad in Washington featuring photos of Hispanic judges, complaining that “these are qualified minority judges who aren’t being considered for the Supreme Court because they’re not Black women.” A Spanish-language ad airing in Arizona and Nevada, the home of two Senate battleground races, will feature the same message, accusing Biden of choosing “radical racial politics instead of qualified judges.” The group is spending about $65,000 on TV and $10,000 on digital ads, which come as Democrats warn the party is losing ground with Latino voters.",
    "The National Wildlife Federation wrote in to continue to protest DOJ’s ordering the conservation group to register in 2020 because of a grant it received from a Norwegian government agency, calling it “an example of what we believe to be the FARA Unit’s overly expansive interpretation of the reach of FARA, with the result that it is applied to cases where Congress never intended it to apply.”\n— Squire Patton Boggs, which operates a robust FARA business, pushed back on a potential unilateral expansion of FARA obligations to people working outside the U.S.",
    "— “Clegg was already running Meta’s global policy organization, but Zuckerberg said in a post Wednesday that he will now ‘lead our company on all our policy matters,’ including interactions with governments and how Meta will ‘make the case publicly for our products and our work.’ Clegg, who was reporting to Sandberg, is now reporting to Zuckerberg too, with the new title of president for global affairs.”\n— “Clegg’s elevated role means that Zuckerberg and Sandberg will defer to Clegg more on policy decisions.",
    "— The notice drew input from numerous corners — from the obvious sources, such as the co-chairs of the American Bar Association’s FARA Task Force and law and lobbying firms specializing in FARA or registered under the statute, to media organizations like OpenSecrets, think tanks such as the Quincy Institute, civil liberties advocacy groups, groups representing the nonprofit world and groups representing academic institutions.",
    "“I think the number of those submissions, and the nature and quality of the types of reforms people are recommending manifests a great yearning within the regulated community for greater clarity with respect to how the department administers and enforces FARA,” said David Laufman, a partner at Wiggin and Dana who submitted 12 pages’ worth of recommendations with his fellow co-chair of the ABA FARA Task Force.",
    "“The limited liability company, called 807080A, donated $100,000 on New Year’s Eve to Honor Pennsylvania Inc., which is supporting former Bridgewater CEO Dave McCormick’s effort in the race, according to a Federal Election Commission filing.”\n— “The LLC’s California address on that document is identical to the one listed on 990 tax forms for Kotick’s foundation, which is called the 803011 Foundation.",
    "— The ICNL, which warned of a trend in weaponizing FARA within the U.S. against political opponents, also signed on to a comment with groups ranging from the American Civil Liberties Union to the conservative Americans for Prosperity warning the department about infringing on activities protected by the First Amendment.",
    "The donation from the LLC to the pro-McCormick PAC likely marks the most Kotick has ever donated to a campaign or a political action committee, according to CRP data.”\nJobs Report\n— Samsung Electronics America has named Mark Lippert executive vice president and head of North America public affairs.",
    "Brandon Van Grack, a former FARA chief now at the law firm Morrison & Foerster, predicted his former colleagues will be “very pleased” with the volume of responses and their level of detail — even if they might not agree with many of the comments criticizing the statute and its enforcement.",
    "“What we've seen is that … you have this, this really kind of archaic act that was passed back in 1938 for a world that just doesn't really match the world today,” Nick Robinson, who submitted comments on behalf of the International Center for Not-for-Profit Law, said in an interview.",
    "— Former USTR Charlene Barshefsky; White House Council on Environmental Quality Chair James Connaughton; and former ITC Commissioner Jennifer Hillman have been tapped to lead the new Climate Leadership Council Center for Climate and Trade as bipartisan co-chairs.",
    "It also matches the address on FEC filings showing Kotick’s individual contributions as recently as September 2021 to various campaigns, including donations supporting Sen. Todd Young, R-Iowa and Senate Majority Leader Chuck Schumer, D-N.Y.",
    "— The details of the comments submitted offer varied perspectives on the statute and offer an array of recommendations, but pretty much every commenter appeared to agree on at least one thing: FARA is in serious need of fixes.",
    "MORE FARA COMMENT TAKEAWAYS: A good deal of the comments on DOJ’s advance notice appear to reflect growing pains as DOJ has more aggressively enforced FARA over the past half-decade, highlighting its many ambiguities.",
    "BIG DONOR ENERGY: “Activision CEO Bobby Kotick used a secret company to quietly donate to a committee backing a Republican former hedge fund chief’s U.S. Senate run in Pennsylvania,” writes CNBC’s Brian Schwartz.",
    "New Joint Fundraisers\nCOLORADO SENATE VICTORY 2022 (CO Senate Republican Nominee Fund 2022, Colorado Republican Committee, NRSC)\nNew PACs\nFair Courts America (Super PAC)\nNew Lobbying Registrations\nNone.",
    "— Laufman, who oversaw the FARA Unit at one time, said he was “heartened” by the responses, calling it “more than enough ammunition” for DOJ to work with as it works on new regulations.",
    "Danica Roem and Madison, Wis., Common Council Alder Arvina Martin as executive directors of the organization’s Virginia and Wisconsin state affiliates, respectively, per Playbook.",
    "In 2014, the Republican Governors Association, which is a 527 tax exempt group, listed a donation from a company with the same name but a different California address.",
    "He most recently led public policy for YouTube in the Asia-Pacific region, and before that worked for Boeing and was U.S. ambassador to South Korea.",
    "Both lawmakers are up for reelection in 2022.”\n— “This might not be the first time that Kotick has used this LLC to fund Republican efforts.",
    "She most recently was director of international security cooperation at Textron, and is a State Department and Tom Rooney alum.",
    "The response included at least one entity who used the department’s future rulemaking to offer itself as a cautionary tale.",
    "— Jess Moore is now senior counsel and director of government affairs and policy at GE Aviation, Playbook reports.",
    "CRP data shows that Kotick’s LLC has never been used to fund any other campaigns or political action committees.",
    "The LLC donated a combined $150,000 to the group dedicated to [elect] Republican gubernatorial candidates.",
    "— Brigid Hasson Richelieu has joined the Financial Services Forum as the senior communications manager.",
    "Catrina Rorke, a senior vice president at the group, will serve as the center’s executive director.",
    "— Hadley Chase is now director of client strategy at Rising Tide Interactive, Playbook reports.",
    "— Jeffrey Van Hove has joined EY as deputy leader of the national tax department.",
    "— Courtenay Mencini is now communications/PR manager at Google, per Playbook.",
    "She most recently was strategic communications adviser to the FBI director.",
    "— PI took a dive through organizations’ responses to DOJ’s 19-point query.",
    "She was most recently a senior public relations director at Rational 360.",
    "She previously was president of EMILY’s List, and is a Jon Tester alum.",
    "(DOJ itself did not respond to a request for comment on the comments.)",
    "— Stephanie Schriock is joining Precision Strategies as of counsel.",
    "She most recently was senior digital strategist at Aisle 518.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "He was most recently a senior adviser at Treasury.",
    "— Emerge is adding Virginia state Del.",
    "Good afternoon and welcome to PI.",
    "Send tips: coprysko@politico.com.",
    "Here are some of the highlights.",
    "New Lobbying Terminations\nNone.",
    "Follow Us"
  ]
}