{
  "id": 4749,
  "mediaId": 2702,
  "date": "2022-02-17",
  "headline": "Oz, McCormick to skip Pennsylvania Republican Senate debate",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2021/12/newsletter-oz-120121ap.jpg?w=1280",
  "link": "https://thehill.com/homenews/campaign/594806-oz-mccormick-to-skip-pennsylvania-republican-senate-debate/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    0
  ],
  "sentences": [
    "The campaign for McCormick, a former hedge fund executive, said he would skip the debate after learning that Oz, the celebrity cardiothoracic surgeon, would not be there.",
    "“Perhaps if this debate was held in Connecticut or New Jersey, Dave McCormick and Mehmet Oz would be inclined to attend and defend their records,” said Bartos.",
    "Mehmet Oz and David McCormick, the latest Republican entries into Pennsylvania’s Senate race, will skip a debate next week for the contest’s GOP contenders.",
    "They join businessman and 2018 lieutenant governor candidate Jeff Bartos, former Ambassador to Denmark Carla Sands and several others in the GOP primary.",
    "Bartos took the opportunity to hit Oz and McCormick over their debate absences, noting the extensive time each has spent outside of Pennsylvania.",
    "Both are anticipated to bring their significant personal wealth to bear in the race to boost their name identification and GOP bona fides.",
    "Oz’s campaign told The Hill it had previously informed the event organizers that he would not be attending due to a scheduling conflict.",
    "Christopher Nicholas, a Pennsylvania GOP consultant and a debate sponsor, also confirmed that the two candidates would not be attending.",
    "Oz and McCormick are the two most recent entrants in the Keystone State’s marquee Senate race to replace retiring Sen. Pat Toomey (R).",
    "“I’m looking forward to Monday’s debate, and unlike my out-of-state opponents, I will always show up for Pennsylvanians.”\nLt. Gov.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Oz participated in a recent forum at the state GOP’s winter meeting with the other candidates who had declared.",
    "Hopefully Mehmet will confirm a day and time soon,” said McCormick campaign spokesperson Jess Szymanski.",
    "Bartos, McCormick and Oz are considered to be in the primary field’s top tier.",
    "John Fetterman and Rep. Conor Lamb are running on the Democratic side.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "“Dave is looking forward to debating."
  ]
}