{
  "id": 5043,
  "mediaId": 2745,
  "date": "2022-02-15",
  "headline": "The Trailer: An L.A. billionaire's answer to 'defund the police': Run for mayor and hire more.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://palomaimages.washingtonpost.com/prod/ScreenShot2022-02-15at2.26.06PM_tstmp_1644955904.png&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/02/15/trailer-an-la-billionaire-answer-defund-police-run-mayor-hire-more/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Johnson lists nursing home deaths, unemployment fraud and “crumbling cities” as crises politicians haven't been able to solve, and asks: “Can you really think of a profession more in need of quality than government?” In a longer digital ad, Johnson rhymes that “we don't need politicians, we need statisticians.”\nDolan for Ohio, “Pencil.” Ohio state Sen. Matt Dolan has broken with the rest of the GOP field in his U.S. Senate primary by defending the results of the 2020 election and getting criticized by Donald Trump.",
    "Vicky Hartzler for Senate, “Coach.” Relatively few statewide candidates have run paid advertisements against gender ideology and transgender rights, a fact that Hartzler touches on at the start of this ad for her Senate campaign: “Some people are afraid to talk about it.” The Republican congresswoman from Missouri describes, with amazement, how University of Pennsylvania swimmer Lia Thomas competes with women, despite having been born male and competing in men's sports before her transition.",
    "It focuses on his other city council work, like expanding paid family leave for state employees and keeping a Planned Parenthood clinic “open even when Republicans tried to shut it down.”\nWith very few exceptions, Republicans have been welcoming Donald Trump's endorsement and celebrating when he comes to rally in their states; Democrats have been appearing alongside Joe Biden and saying that he remains popular with the party's base.",
    "In Minneapolis, the campaign to replace the city's police department after George Floyd's murder ended in defeat, as voters reelected the mayor who'd told protesters that he would never “defund the police.”\nThe race to lead Los Angeles is more complicated than either of those campaigns — the first open-seat race since the city's elections were merged with state and federal primaries in June, which always have higher turnout.",
    "Rep. Karen Bass (D-Calif.), who had been vetted as a potential running mate for Joe Biden, described a growing anger at city government and exhaustion with crime and homelessness — ordinary Angelenos, she said, who “just want to see these people out of their neighborhood and don’t really care what happens to them.”\nIn the recall, Democrats weren't angry enough at the state's dominant party to start voting for Republicans.",
    "State Rep. Timothy Ramthun surprised his fellow Republicans by launching a campaign for governor on Saturday, joined by MyPillow founder Mike Lindell and cheered on by supporters waving signs that read “Decertify Now!” Just weeks earlier, Ramthun had tried to bring a measure to decertify the results of the 2020 election in Wisconsin to the floor of the state assembly.",
    "“I think that’s because the convoy didn’t come.”\nRepublican politicians and activists celebrated the ongoing, evolving “freedom convoys” of Canadian truckers almost as soon as they'd started; some conservative Canadian outlets, such as Rebel News, already had large American audiences before the protests of that country's vaccine mandates began.",
    "Ramthun has been disciplined by his own party leadership over his 2020 election crusade, though conservative pro-Trump pressure has already succeeded in getting Assembly Speaker Robin Vos to approve, and extend, a separate probe into the election, exploring questions about how county officials used private election grants to turn out voters.",
    "He closes with a modified Trump line: “Without a border, we have no country.”\nGreg Casar for Congress, “A Bold Agenda for Working Families.” As a self-identified Democratic socialist, Casar has thrown in with the far left of Austin politics, including an unpopular (and losing) effort to lift the city's camping — read: homeless — ban.",
    "He has not said how much he's willing to spend on a campaign, just that he'll reject any money from “special interests.” Bass, the race's fundraising leader, had collected $2 million by the end of the most recent filing period — a figure that easily outpaced others then in the race but pales in comparison with Caruso's assets.",
    "And I can't be on that side, and I want to be clearly on the other side.”\nHis opponents didn't really focus on what party Caruso belonged to; the dividing lines in Los Angeles aren't wholly partisan — some wealthy developers are Democrats, and so are the socialists who are trying to dismantle their influence.",
    "Hugo Soto-Martinez, a labor organizer whose city council campaign claims more than 800 volunteers, said Caruso represented much of what was wrong with Los Angeles, calling him a “puppet master” for the business interests that had always run the city, who were suddenly pretending that the far left did.",
    "Altogether, the campaign based out of the home of recall proponents Siva Raj and Autumn Looijen has collected nearly $1.9 million; the campaigns to retain school board President Gabriela López, former board vice president Alison Collins and Commissioner Faauuga Moliga raised less than $90,000.",
    "The Caruso pitch is that no other candidate can truly deliver; no other candidate can be so independent; no candidate has tangled for so long with the bureaucracy he wants to roll back; and no other candidate has built an idealized vision of urban life like Caruso had at his shopping malls.",
    "One trend from 2020, of Biden losing ground with the White working-class voters who backed him after not backing Hillary Clinton in 2016, is particularly glaring here: 64 percent of White voters without college degrees say they would prefer to support candidates who don't support Biden.",
    "Other protesters accused the government of inflating or inventing the danger from covid-19 to grab power; one, roaming back and forth with a microphone attached to a speaker, told passersby that the coronavirus vaccines would infect gullible people with the AIDS virus.",
    "Republicans question how much the 2020 vote numbers say about the potential 2022 electorate; last year, the party made broad gains across Long Island, as the man Rice defeated in 2014, Bruce Blakeman, won an upset in the race for Nassau County executive.",
    "In New York, Mayor Eric Adams triumphed over more left-wing opponents in a crowded Democratic primary; in Long Island and the Philadelphia suburbs, Democrats lost seats they'd easily held in the Trump years to Republicans who called them soft on crime.",
    "“I think voters should choose their politicians,” Patel said in a video announcing the campaign, “not the other way around.”\nTwo years ago, Patel came within 3,500 votes of ousting Maloney, who prevailed after two other challengers split the vote.",
    "“Midterms are coming up, so a lot of Democratic politicians are relaxing restrictions to make people happy and win votes,” said Contessa Mendoza, who said she was self-employed and could resist the vaccine without it affecting her livelihood.",
    "“As elected officials, we must give all we have and then know when it is time to allow others to serve.”\nRice joined the House after the 2014 election, bucking the Republican tide to hold the 4th Congressional District in south Nassau County.",
    "It wasn't the sort of broad, populist display that politicians have been comfortable endorsing, and other people who walked the line and waved signs at the people working their way toward the stadium said their focus should be on hypocrisy.",
    "Just weeks after the killing of George Floyd, the city council voted to cut $150 million from the LAPD's $1.9 billion budget — the largest reduction of any city's law enforcement funding in the wake of that summer's civil rights protests.",
    "A former city councilman, Samuels backed Omar’s 2020 primary opponent, then the successful 2021 effort to move some powers from the city council — which had voted to replace the Minneapolis police department — over to Mayor Jacob Frey.",
    "There's no limit to what individual donors can give a candidate for state office in Illinois, and Pritzker, who ran the most expensive winning campaign in state history four years ago, has already put $125 million into his reelection.",
    "Attorney Suraj Patel entered the Democratic primary for New York’s 12th Congressional District, challenging Rep. Carolyn B. Maloney (D-N.Y.) for the third time, in a district whose new lines sliced out many of Patel’s best precincts.",
    "Caruso, who had talked for years about what he might do as mayor, decided to enter the race because “the city needs help now more than ever,” and because in his mind, nobody else in the field looked competent enough to deliver it.",
    "They want to have a slice of the American Dream, and they want to believe in somebody who can do that.”\nEvery Los Angeles mayoral candidate promises to cut crime and curb homelessness — and all of them are doing it again in 2022.",
    "“They've been in charge,” said Caruso, “and look where we are.”\nThe race to succeed Mayor Eric Garcetti (D), who'd taken office when crime was falling and will leave as it surges, has pulled in more than two dozen candidates.",
    "“It's such a silly distraction.” Caruso said that if elected, he'd hire 1,500 more cops for the “underfunded” Los Angeles Police Department; he'd house at least half of the city's 60,000 homeless by the end of his first year.",
    "The wealthiest and best-known candidate for mayor is running on the sort of agenda that liberal voters might have recoiled at a few years ago, and that the city's increasingly well-organized left is going all-out to stop.",
    "The developer behind some of Southern California's most glamorous shopping malls, whose recently sold megayacht had a cameo in the celebrity college admissions scandal, sees an electorate that's finally ready for him.",
    "In November, after a smash-and-grab robbery at a Nordstrom in The Grove in west Los Angeles, Caruso headed to his shopping center and blamed “weak leadership” for letting criminals think they could get away with it.",
    "That bluntness got a quick condemnation from the National LGBTQ Task Force, which is part of the point, that Hartzler is willing to risk social media censorship and accusations of intolerance from the cultural left.",
    "Nearly every precinct in the city rejected the 2021 attempt to recall Newsom, most of them by landslide margins, ignoring the GOP candidates who stumped near homeless camps and blamed local political leadership.",
    "The district remained on the House GOP’s list of targets anyway, though Bill Staniford, the only Republican who declared against Rice before her decision, had only raised around $251,000 by the end of last year.",
    "(Attendees were required to show proof of vaccination or a negative coronavirus test, and anyone over 2 years old was required to wear a mask when not eating or drinking, although that rule was widely ignored.)",
    "“I think the police jumped ahead and already shut certain things down, so they alleviated any real trouble,” said Dawn Berry, who said she was in the process of getting a religious exemption from vaccination.",
    "Democrat Laura Curran, whom Blakeman defeated, hasn't ruled out a run to replace Rice — and before the announcement, she appeared on Fox News to warn that her party was risking a “bloodbath” in November.",
    "Days before Caruso entered the race, Bass rolled out a public safety plan that would keep the LAPD at least at its current size of nearly 10,000 officers, while pushing more from their desks onto a beat.",
    "Looijen counted 142 noncitizens whom the campaign had registered to vote before today’s election, “roughly double” the number of noncitizens who’d voted in any race since the city created the option.",
    "Republicans lost the seat in 1996, and Rice, a former district attorney, usually won with margins in the mid-50s, as the GOP’s Trump-era weakness in suburbs held the party back around New York City.",
    "Aurora Mayor Richard Irvin got a $20 million boost from billionaire Ken Griffin, who'd urged the rising Republican star to run and previously pledged to do whatever it took for Irvin to beat Gov.",
    "At the rally in Kewaskum, Ramthun called the 2020 election an “assault on the Constitution and national security,” pledging to revisit the election and pursue decertification in 2023 if he won.",
    "In 2001, one-term Mayor James K. Hahn put Caruso on the Board of Police Commissioners, which he'd go on to lead, and which recruited New York police commissioner Bill Bratton to lead the LAPD.",
    "The city hasn't voted for a Republican mayor since Richard Riordan was reelected in 1997, and its electorate has moved further left since then, repelled by Donald Trump's version of the party.",
    "While Caruso planned out a campaign, the candidates already running described a city that had let too many problems fester for too long, debating just how dramatic the solutions needed to be.",
    "According to the San Francisco Chronicle’s count, around 109,800 ballots were returned by the election’s final weekend, with nearly 400,000 ballots previously sent to voters not yet returned.",
    "A chunk of that went into this 60-second Super Bowl spot, which aired in several Michigan markets, and portrays Johnson as a wizard statistician whose advice saved the American auto industry.",
    "Minneapolis public safety campaigner Don Samuels said he was considering a run against Rep. Ilhan Omar (D-Minn.) after Sahan Journal confirmed that he’d already purchased a campaign domain.",
    "“It's just not healthy.”\nPolls in San Francisco close at 8 p.m. tonight, with voters deciding whether to recall three school board members — a race you read about in The Trailer last month.",
    "But it got drenched with free media, as Super Bowl ads often do, and because McCormick is the second Republican candidate to use a euphemistic insult against President Biden in a TV ad.",
    "Perry Johnson for Governor, “Quality Guru.” Johnson, a wealthy quality management consultant, entered the GOP's primary for governor of Michigan by loaning his campaign $2.5 million.",
    "In 2018, when New York Attorney General Eric Schneiderman resigned amid allegations of sexual misconduct, Rice briefly considered a run for his job, but sought reelection instead.",
    "Rebecca Kleefisch and unsuccessful 2018 U.S. Senate candidate Kevin Nicholson had already entered the race, but Democrats were happy to go after Ramthun, with a spokesman for Gov.",
    "Some of them are credible, some of them are gadflies, and all of them describe a city in crisis — harder and more expensive to live in, with a government too sclerotic to fix it.",
    "That's okay, but you want to know that they trust them.”\nIn other cities, angst about crime and the cost of living also has changed how candidates talk and influenced who wins.",
    "Dave McCormick for U.S. Senate, “Let's Go.” This spot from the free-spending Pennsylvania Republican only ran once, during the Super Bowl, and only in one market — Pittsburgh.",
    "Rep. Kathleen Rice (D-N.Y.) announced Tuesday that she won’t seek reelection, becoming the 30th House Democrat to retire or seek another office ahead of the midterm election.",
    "But nothing he says here would be out of place in a Trump speech, such as drawing a linkage between illegal fentanyl smuggling and the Biden administration's border security.",
    "The effort to start a protest like Canada's in the United States is happening fitfully, and the first people on the ground Saturday had grievances outside the GOP mainstream.",
    "The billionaire developer, who had prepared and abandoned mayoral campaigns before, walked into the city clerk's office Friday and officially filed his candidate paperwork.",
    "A Berkeley/IGS study released Tuesday found that while most residents of Los Angeles County approve of Newsom, they disapprove of how he's handling crime and homelessness.",
    "Last spring, Justice Democrats endorsed nonprofit founder Rana Abdelhamid for the seat, in an attempt to consolidate liberal and anti-incumbent votes behind one candidate.",
    "“We’re going to have a massive superspreader event, and we’re going to relax the restrictions so that people who come from free states can take advantage of it.”\nIllinois.",
    "Hundreds of ballots have already been cast by noncitizens eligible to vote in school board races — a constituency that the recall campaign courted throughout the race.",
    "In this edition: A billionaire runs for mayor of L.A., a Long Island Democrat calls it quits, and the transgender sports fight comes to Missouri's U.S. Senate race.",
    "“I’m still running against a corporate-backed, entrenched, three-decade-long Democrat,” Abdelhamid told NY1 on Monday, making no mention of the other candidates.",
    "“The best way to prevent crime is to give people economic stability.”\nThat argument may have been more compelling to Los Angeles politicians and voters in 2020.",
    "Caruso pointed to his term on the police commission, under a Democratic mayor, to say that the force could be expanded while civil rights abuses were curtailed.",
    "“Let's go, Brandon” is repeated again and again by a crowd as images of administration failures — the border, Afghanistan, inflation — flip across the screen.",
    "Sure, he was a billionaire former Republican seeking office in a place where only Democrats win elections, but he was running against a bunch of politicians.",
    "He hadn't intended to talk to reporters at all, but he stopped in front of some cameras, and so did a left-wing activist who had been waiting to yell at him.",
    "Voting rights activist Maya Contreras entered the race a few weeks later, and would eventually — and briefly — hire a 14-year old to manage her campaign.",
    "Just 19 percent of independents say they'd prefer a Trump-supporting candidate for Congress, and just 22 percent say the same about candidates and Biden.",
    "“I appreciate Mr. Griffin's support and the thousands of other donors who have joined our campaign in the first few weeks,” Irvin said in a statement.",
    "“Whether somebody is rich or poor or Black or White or Catholic or Jewish — do you think that that really matters?” he said in an interview this week.",
    "Councilman Joe Buscaino (D) had called for “banning camping” to roust tens of thousands of homeless people out of the tents in parks and on sidewalks.",
    "“The police department was run by a federal judge because of the problems with the Rodney King beating and the way LAPD was operating,” Caruso said.",
    "But the vast majority of adults polled by CNN either don't want the candidates they vote for to side with Trump or Biden, or don't care if they do.",
    "In interviews, most of those gathered outside the stadium said they were particularly concerned that the Super Bowl would enable sex trafficking.",
    "“I have always believed that holding political office is neither destiny nor a right,” Rice said in a statement, released on her 57th birthday.",
    "Recall organizers outspent the targeted school board members throughout the race, keeping up that advantage during early and absentee voting.",
    "New York Democrats re-drew Rice’s district from one that backed Joe Biden by 13 points into one that would have voted for him by 12 points.",
    "And most of that has gone to help Moliga, who was targeted by the recall campaign but hasn't voted with López and Collins on everything.",
    "The 63-year old Caruso tapped Bearstar Strategies to build a campaign shortly after the firm helped Newsom defeat a 2021 recall attempt.",
    "“We have a revolving door of people going from the city to the county to the state and then make another loop around,” said Caruso.",
    "Ballots postmarked today but not received by the end of Tuesday will be counted, as long as they arrive in the next two weeks.",
    "Like Riordan, and billionaire Mike Bloomberg when he was mayor of New York, Caruso has pledged to take a $1 annual salary.",
    "How could California's Democratic leaders justify pandemic restrictions at schools when so many at the game were unmasked?",
    "Protesters worried, specifically, that keeping masks on children would make it easier for traffickers to evade detection.",
    "The dozens of people who headed to the intersection where ticket holders were entering SoFi Stadium hoped he was right.",
    "“It almost feels like elder abuse, with what's going on with President Biden,” Curran told Fox News host Jesse Watters.",
    "His time on the board, he said, taught him that bad leadership could “demoralize the cops,” and that he could fix that.",
    "“Our national sovereignty is at risk,” says Dolan, as an image of last year's migrant surge from Haiti runs on-screen.",
    "I'm not a real party person,” he explained, noting that he'd also donated to Democrats, including Bass and Newsom.",
    "“How many people lost their lives to LAPD violence while you were police commissioner, Rick?”\nCaruso blew it off.",
    "“He’s missing the forest for the trees,” Soto-Martinez said of Caruso's talk of hiring more police officers.",
    "But when they got there, it was clear that the billion-dollar event wasn't going to be stopped by a convoy.",
    "This, says Caruso, was part of a series of mistakes by people who didn't really know what they were doing.",
    "“We reformed the LAPD, the court released its hold on LAPD, and we dropped crime by almost 40 percent.",
    "But polling has found voter anger about both issues overwhelming views of life in Southern California.",
    "“The areas where we got the most signatures were getting highest turnout,” Looijen said Monday.",
    "Caruso, who has donated hundreds of thousands of dollars to GOP candidates, joined the exodus.",
    "“We've sent out a message that it's okay to have minor crimes without consequences,” he said.",
    "LOS ANGELES — A few minutes into his campaign for mayor, Rick Caruso got his first heckler.",
    "It eventually redirected $89 million to social services and public infrastructure repairs.",
    "Just weeks after becoming a Democrat, he's working with strategists who helped elect Gov.",
    "“He has a hard time putting a sentence together.”\nSen. Rand Paul (R-Ky.) hoped it would.",
    "And if there's a “tough on crime” lane, it's not wide open for a billionaire candidate.",
    "Gavin Newsom (D) and raised historic amounts of money for Sen. Bernie Sanders (I-Vt.).",
    "His ad for the start of the early voting period doesn't mention crime or homelessness.",
    "Patel remained confident that he had a path to victory, while Abdelhamid ignored him.",
    "And I think the fact that he's reemerging is a very scary and dangerous thing.",
    "“Women's sports are for women, not men pretending to be women,” says Hartzler.",
    "“When your car door closes just right, thank Perry Johnson,” says a narrator.",
    "Now, there may be parts of the community that will never like the police.",
    "Tony Evers (D) mocking his rally with a “disgraced pillow salesman.”",
    "“A child that's masked can't say, ‘Help me!’ or 'This isn't my dad!",
    "“I think ideology has gone out the window,” Caruso said this week.",
    "The backlash defined many of last year's closely watched races.",
    "'” said Sarah Steadman, who drove to the rally from San Diego.",
    "“People want to be safe and they want to live their lives.",
    "doesn't want a billionaire as mayor, Rick!” he shouted.",
    "“I hope they clog up cities,” he said before the game.",
    "“This is so much bigger than Brandon,” it concludes.",
    "I was against him when he was a candidate.",
    "I was against him when he was a president.",
    "They want to send their kids to school.",
    "“I've always been against Trump.",
    "They want to walk to dinner.",
    "“I've always given money.",
    "J.B. Pritzker (D).",
    "That didn’t work.",
    "Former Lt. Gov.",
    "Wisconsin.",
    "Minnesota.",
    "New York.",
    "“L.A."
  ]
}