{
  "id": 530,
  "mediaId": 2539,
  "date": "2022-04-22",
  "headline": "Pennsylvania’s GOP Senate primary draws backing from some of Wall Street’s biggest billionaires, making it one of the most expensive midterm races",
  "image": "https://image.cnbcfm.com/api/v1/image/107048966-1650467351172-AP22056538328626.jpg?v=1650467436&w=1920&h=1080",
  "link": "https://www.cnbc.com/2022/04/22/2022-elections-wall-street-billionaires-back-pennsylvania-gop-senate-primary-.html",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Schwartz",
  "authorUrl": "",
  "termIds": [
    2769,
    4581,
    4728,
    305,
    878,
    1171,
    5239
  ],
  "sentences": [
    "During the first quarter, dozens of the men’s allies and close friends — current and former Wall Street CEOs and executives — have hosted fundraisers, directed contributions to their campaigns and donated directly to the candidates and political action committees supporting their bids, according to Federal Election Commission filings, invitations to private fundraisers, and interviews with people close to both men, some of whom asked not to be named in order to speak freely.",
    "McCormick has received donations from Ray Washburne, a real estate mogul and former finance chair of the Republican National Committee; Brian Ballard, a veteran lobbyist and major fundraiser for Trump; and Christine Toretti, an oil and gas executive who was part of Trump’s transition team and his nominee for ambassador to Malta before her nomination was sent back by the Senate.",
    "AP Photos\nWall Street executives are pouring millions of dollars into the Republican primary race for Pennsylvania’s open U.S. Senate seat — where veteran physician Dr. Mehmet Oz and former Bridgewater CEO Dave McCormick lead in the polls — making the primary one of the most expensive in the 2022 midterm elections.",
    "Mike Novogratz, the CEO of Galaxy Digital and a close friend of both McCormicks, told CNBC he senses the Wall Street support comes from what he says is the belief that the former Bridgewater CEO’s policies are more “center right.” Records show he has yet to donate to McCormick’s campaign.",
    "Goldman CEO David Solomon hosted a fundraiser for the candidate in February, while John Rogers, chief of staff and secretary to Goldman’s board of directors, has been encouraging other Goldman leaders to donate to the campaign, according to people familiar with the matter.",
    "“Dave McCormick has shown he is the only one in this race who has the broad support and fundraising strength necessary to lead one of the most expensive and important Senate races in the country and keep the seat in Republican hands,” Szymanski said.",
    "Mack told CNBC he’s supporting Oz for a range of reasons, including his work in New Orleans during Hurricane Katrina and for what Mack said is his fighting spirit that he’ll bring to Washington if he becomes a senator.",
    "Goldman’s political action committee and its employees, for instance, donated a combined $1 million to Barack Obama’s campaign when he first ran for president in 2008, according to the Center for Responsive Politics.",
    "“When I heard David was considering running for the Senate, I urged him to do so as our nation will be in good hands if talented and committed individuals like him are elected to public office,” Griffin said.",
    "The race to replace retiring GOP Sen. Pat Toomey is a critical one that could help determine the balance of power in the chamber, which is evenly divided between Republicans and Democrats.",
    "American Leadership Action, the PAC solely backing Oz’s campaign, has spent over $3 million taking aim at McCormick, according to data from the nonpartisan Center for Responsive Politics.",
    "McCormick’s campaign, meanwhile, raised $11 million in the first quarter, which includes a loan of just under $7 million from the candidate, who officially entered the race in January.",
    "Blackstone CEO Steve Schwarzman gave the pro-McCormick group $500,000 in February, and Paul Singer, founder of hedge fund giant Elliot Management, donated $1 million that same month.",
    "Unlike campaign donations, which are capped at $5,800 per candidate per election cycle, donors can give an unlimited amount of money to super PACs under campaign finance rules.",
    "He pointed to McCormick’s Gulf War military service and his record in government, including roles at the Commerce and Treasury departments under then-President George W. Bush.",
    "She noted that the former Bridgewater executive has also raised $1 million from Pennsylvania donors in all 67 counties and that he has enough support to win an expensive race.",
    "Oz, as the host of “The Dr. Oz Show,” had a long and successful TV career nurtured by Oprah Winfrey, while McCormick ran Bridgewater, one of the world’s largest hedge funds.",
    "John Mack, the former CEO and chairman of Morgan Stanley, contributed $600,000 over the first two months of the year to the pro-Oz super PAC, federal election records show.",
    "The Cook Political Report marks the Senate seat as a toss-up, and a Real Clear Politics average of polls shows McCormick with an edge over Oz in the Republican primary.",
    "Rogers was also among a group of business leaders in January who co-hosted a fundraiser in New York for McCormick’s campaign, according to a copy of the invitation.",
    "Ken Griffin, the CEO of Chicago-based investment firm Citadel, has donated $7.5 million to the pro-McCormick super PAC so far, including $2.5 million in March.",
    "Both McCormick and Oz have close personal relationships with billionaire Ray Dalio, the founder of Bridgewater, who hasn’t donated to either of the campaigns.",
    "Though the campaigns don’t control how they spend their money, super PACs can raise and spend an unlimited amount of money backing their preferred nominee.",
    "Executives at Goldman have been backing McCormick’s campaign, with nearly 60 of the firm’s leaders donating directly to his operation, FEC records show.",
    "Nelson Peltz, the co-founder of investment firm Trian Partners, contributed $80,000 to the pro-Oz super PAC in the first three months of the year.",
    "More than $45 million has been spent so far on TV, radio and digital ads in the GOP primary, according to data provided by ad tracker AdImpact.",
    "Mack was known on Wall Street as “Mack the Knife” for his cost-cutting efforts and his attention to detailed efficiency at Morgan Stanley.",
    "The contest has drawn support from executives at Goldman Sachs as well as billionaire CEOs at Blackstone Group and Citadel, among others.",
    "Oz’s campaign has raised over $13 million so far, with $7.5 million in the first quarter that included a nearly $6 million loan from Oz.",
    "He continues to flounder, despite spending millions on a China-funded smear campaign,” Oz spokeswoman Brittany Yanick said in an email.",
    "“Supporting Dave is an easy call for many business execs,” Reginald Brown, a partner at the law firm Kirkland Ellis, said in an email.",
    "Oz, McCormick and Honor Pennsylvania, a super PAC backing McCormick, have each spent over $11 million on ads in the primary race.",
    "American Leadership Action, a similar super PAC backing Oz, has spent just over $3 million on advertising in the primary so far.",
    "In this 2022 photo combination shown are Republican Pennsylvania U.S. Senate candidates, Dave McCormick, left and Mehmet Oz.",
    "McCormick is viewed as a possible ally in Washington to business leaders if he were to win the general election in November.",
    "He was also part of Trump’s transition team and was one of Bush’s political fundraisers during his 2000 and 2004 campaigns.",
    "“There’s a strong sense that he won’t be a loose cannon and is ready to be a statesman in a very challenging world.”\n“Dr.",
    "Jess Szymanski, a spokeswoman for McCormick’s campaign, downplayed McCormick’s Wall Street ties in an emailed statement.",
    "Rogers donated $50,000 late last year to the pro-McCormick Honor Pennsylvania, according to election records.",
    "Oz sat on former President Donald Trump’s Council on Sports, Nutrition and Fitness before Biden dropped him.",
    "Representatives for Schwarzman, Singer, Peltz and Paulson did not respond to requests for comment.",
    "While Trump recently endorsed Oz, some of Trump’s old allies have donated to the McCormick camp.",
    "President Joe Biden saw more than $70 million from Wall Street in his run for the White House.",
    "McCormick’s wife, Dina Powell McCormick, is an executive at Wall Street giant Goldman Sachs.",
    "With connections like that, it hasn’t been difficult for either candidate to raise money.",
    "Billionaire hedge fund founder John Paulson donated $5,800 directly to Oz’s campaign.",
    "Super PACs are tools for allies to provide outside support for federal candidates.",
    "Oz also has his own friends on Wall Street and counts Trump among his supporters.",
    "Oz is a TV personality who served on the President’s Council on Fitness.",
    "Brown gave $5,800 to McCormick’s campaign in January, FEC filings show.",
    "Wall Street firms typically back candidates on both sides of the aisle.",
    "“He fights for what he believes in,” Mack told CNBC in a text message.",
    "“Wall Street is centrist,” Novogratz said in explaining the backing.",
    "A spokesperson for Goldman did not respond to requests for comment.",
    "Solomon personally gave $5,800 to McCormick’s campaign in January.",
    "Both men were incredibly well connected before entering politics.",
    "Not a hard choice for pragmatic business leaders,” Brown said.",
    "Several Wall Street billionaires seem to agree on McCormick.",
    "Oz’s campaign took the opportunity to target McCormick.",
    "“David McCormick is the ultimate establishment insider.",
    "Washburne is a heavy hitter on the campaign trail.",
    "Griffin said he encouraged McCormick to run."
  ]
}