{
  "id": 5625,
  "mediaId": 2702,
  "date": "2022-02-03",
  "headline": "Pennsylvania’s high-profile race for Senate begins to take shape",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/02/020222mm-istock-ap-matt-slocum_pa_illustration_camp_web.jpg?w=1280",
  "link": "https://thehill.com/homenews/campaign/592582-pennsylvanias-high-profile-race-for-senate-begins-to-take-shape/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    0
  ],
  "sentences": [
    "No crowd-clearing candidate has yet risen to the top in Republicans’ regional caucuses and no endorsement is anticipated to be granted at this weekend’s state party confab, but businessman Dave McCormick and former lieutenant governor candidate Jeff Bartos have emerged with the most momentum, while Mehmet Oz looks to capitalize on his celebrity status.",
    "“The race for PA senate won’t be won in Conference rooms and hotel ballrooms, it will be won in towns, big and small, across the commonwealth, and that is exactly the kind of campaign John Fetterman is running, a true 67 county campaign,” Fetterman spokesperson Joe Calvello said in a statement.",
    "“We respect the State Party process, but there’s energy and grassroots enthusiasm for Dr. Oz that’s unmatched right now in the Republican primary.”\nOther conservative candidates have continued campaigning, including commentator Kathy Barnette and former U.S.",
    "“With no endorsement, it’ll be kind of a free-for-all.”\nRepublicans in recent weeks held caucuses among regional committees of the state party where GOP officials and grassroots activists discussed whether to issue an endorsement and held straw polls.",
    "“It shows that he’s not doing well with the party insiders, but that doesn’t really translate at the polls.”\nOz’s campaign insisted it remains in a strong position, noting robust attendance at recent campaign events.",
    "On top of that, Fetterman is known to eschew the kind of backslapping that goes into winning the endorsement and did not put nearly as much of an emphasis on reaching out to committee members as Lamb.",
    "McCormick, meanwhile, held his own for a candidate who formally entered the race just last month, performing strongly in the earlier contests while winning the southwest region’s straw poll.",
    "Top contenders are beginning to emerge from crowded primary fields on both sides of Pennsylvania’s marquee Senate race even as no indisputable front-runner materializes for either party.",
    "With all that taken into account, Democratic operatives say that while last weekend’s win is impressive for Lamb, the lack of an endorsement leaves Fetterman as the early front-runner.",
    "The overwhelming consensus was that the state party should refrain from formally backing a candidate in the crowded field, but the straw polls injected some campaigns with momentum.",
    "Past candidates who won the endorsement have gone on to lose in the primary, and other candidates who have lost out the endorsement have gone on to win the nomination.",
    "“Someone’s going to have to draw first blood.”\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Taken together, the two parties’ respective primaries are evolving into more recognizable tiers but remain jump balls that could be nabbed by more than one contender.",
    "“It leaves the field very wide open,” veteran Pennsylvania GOP strategist Chris Nicholas said about the prospect that no Republican wins an endorsement this weekend.",
    "Bartos won the final caucus in the southeast region Wednesday with 34 votes, a sign of what he called “tremendous support,” while McCormick came in second with 27.",
    "Fetterman, a progressive, is viewed as the front-runner, while Lamb, a more moderate candidate, has leveraged his perceived electability in a general election.",
    "Bartos had been largely anticipated to perform well after maintaining relationships with party officials and activists from his 2018 lieutenant governor run.",
    "Bartos, who had been lagging in polling and faces a financial gap with the uber-wealthy McCormick and Oz, went on a winning streak in the early caucuses.",
    "Oz is a conservative outsider, drawing large crowds and excitement everywhere he goes,” said Brittany Yanick, the campaign’s communications director.",
    "That fell short of the two-thirds threshold needed to win the imprimatur, but put him far ahead of Fetterman, who took second place with 23 percent.",
    "“When you’re the best known, you’re leading in the polls by a significant margin and you have the most money, by definition you’re the front-runner.",
    "However, he is anticipated to remain a force given his high name recognition and willingness to invest millions of his own dollars in his campaign.",
    "And there was no state committee endorsement, so that dynamic is unchanged fundamentally,” said Pennsylvania Democratic strategist J.J. Balaban.",
    "And to win this, I think there’s going to have to be some contrasting ads, whether it’s TV or digital,” said Democratic strategist Mike Mikus.",
    "Still, lower-polling candidates like state Rep. Malcolm Kenyatta and Montgomery County Commissioner Val Arkoosh are still in contention.",
    "Oz only netted a handful of votes in the straw polls, leading to blistering articles about his early performance on the campaign trail.",
    "Meanwhile, Rep. Conor Lamb nearly clinched the votes needed for the imprimatur at a Democratic Party meeting last weekend, but Lt. Gov.",
    "And with no one candidate locking up the race, operatives predict that a staid primary will soon be marked by sharp contrasts.",
    "Lamb touted the win to Politico as a “commanding victory,” but the results are not the end-all-be-all for the lawmaker.",
    "So, winning these grassroots keeps him in the game,” said one GOP strategist with experience working in Pennsylvania.",
    "However, Lamb over the weekend won the support of 61 percent of state committee members in the nomination contest.",
    "And on top of that, caucus results have historically failed to directly translate to actual results in a primary.",
    "Ambassador to Denmark Carla Sands, but operatives said they don’t see strong paths to the nomination for them.",
    "On the Democratic side, the primary race has largely morphed into a contest between Fetterman and Lamb.",
    "But operatives say the results at the caucuses accomplished the main goals for the two campaigns.",
    "“If [Bartos] lost these caucuses after working the grassroots, then he’s got nowhere to go.",
    "Fetterman holds a consistent polling lead and a yawning fundraising advantage.",
    "“I think he punched the ticket he needed to,” Nicholas added of McCormick.",
    "That just means he’s ahead in the polls and he has the most money.",
    "Meanwhile, Oz, the celebrity cardiothoracic surgeon, struggled.",
    "“Compared to the Republicans, it’s been a fairly tame primary.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "“I don’t think it’s a warning sign at all,” Nicholas said.",
    "John Fetterman still leads in the polls.",
    "That doesn’t mean you can’t lose.",
    "“Dr."
  ]
}