{
  "id": 570,
  "mediaId": 2676,
  "date": "2022-04-11",
  "headline": "Trump fans angered by his endorsement of Dr. Oz",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/04/donald-trump-mehmet-oz-0411221.jpg",
  "link": "https://www.salon.com/2022/04/11/fans-angered-by-his-endorsement-of-dr-oz/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.salon.com/writer/jon-skolnik",
  "termIds": [
    2190,
    2201,
    2232,
    4021,
    4506,
    4537,
    878
  ],
  "sentences": [
    "Oz is the antithesis of everything that made Trump the best president of my lifetime – he's the farthest thing from America First & he'd be very bad for PA.\"\nhttps://twitter.com/SeanParnellUSA/status/1512941900013125642\nRep. Mo Brooks, R-Ala., claimed that Trump had endorsed Oz because the former president is \"surrounded himself by staff who are on [Senate Minority Leader Mitch] McConnell's payroll & hostile to the MAGA agenda.",
    "RELATED: Dr. Oz and wife thought they'd hung up — got caught raging against \"f**king girl reporter\"\n\"I have enormous respect for President Trump,\" tweeted Sean Parnell, who dropped out of the Pennsylvania Senate race in November over abuse allegations from his estranged wife.",
    "Members of the MAGA-verse are fuming over Donald Trump's endorsement of Mehmet Oz, the celebrity doctor running for U.S. Senate, claiming that Oz is a closet liberal who does not fundamentally gel with the \"America First\" agenda.",
    "The cascade of outrage came last Saturday, after Trump released an official statement backing Oz as a Senate candidate to represent the state of Pennsylvania, whose Republican senator, Pat Toomey, is resigning.",
    "Oz faces a crowded field of primary opponents, including Dave McCormick, a Republican former hedge fund executive and Republican businessman Jeff Bartos.",
    "Meanwhile, Breitbart News' Joel Pollak wrote went a step further, claiming that Trump \"could lose America First conservatives\" over the endorsement.",
    "In the past, the TV personality, who hails from the liberal elite of Hollywood, has supported abortion rights as well as the Affordable Care Act",
    "After Oz's campaign announcement, there was a significant GOP consternation over just how aligned Oz really is with the Republican agenda.",
    "\"Dr. Oz is smart, tough, and will never let you down, therefore he has my Complete and Total Endorsement,\" the former president added.",
    "According to a recent poll by The Hill Pennsylvania, McCormick is currently leading Oz by a slim margin in the Republican primary.",
    "\"I have known Dr. Oz for many years, as have many others, even if only through his very successful television show,\" Trump said.",
    "https://twitter.com/MoBrooks/status/1512958264895488001\nWant a daily wrap-up of all the news and commentary Salon has to offer?",
    "Right-wing commentator John Cardillo also joined the chorus, calling Trump's latest imprimatur a \"horrible call.\"",
    "He just put his political capital behind an anti-gun pro-abortion open borders Hollywood liberal.",
    "\"He has lived with us through the screen and has always been popular, respected and smart.\"",
    "Trump's endorsement drew an immediate wave of fury from his loyal fanbase.",
    "Everybody telling Trump who to endorse in primaries works for The Swamp.\"",
    "Among those running in the Democratic primary are Pennsylvania Lt. Gov.",
    "The Pennsylvania Senate race is set to be officially held on May 17.",
    "\"Trump's endorsement of Dr. Oz is inexcusable,\" Cardillo tweeted.",
    "Subscribe to our morning newsletter, Crash Course.",
    "John Fetterman; and U.S. Rep. Conor Lamb, D-Penn.",
    "Oz will be another Mitt Romney in the Senate.\"",
    "\"But I'm disappointed by this."
  ]
}