{
  "id": 572,
  "mediaId": 2699,
  "date": "2022-04-10",
  "headline": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2523,w_4485,x_0,y_467/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1649608700/2022-02-05T210941Z_241390843_RC2RDS9M89J3_RTRMADP_3_USA-ELECTION-PENNSYLVANIA-TRUMP_cyxrc4",
  "link": "https://www.thedailybeast.com/trumpworld-figures-go-into-meltdown-after-donald-trump-endorses-dr-oz-in-pennsylvania-senate-race?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Petrizzo",
  "authorUrl": "https://www.thedailybeast.com/author/zachary-petrizzo",
  "termIds": [
    1316,
    1342,
    1727,
    2201,
    2232,
    4021,
    4654,
    878,
    1171
  ],
  "sentences": [
    "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate Dave McCormick, who has ex-Trump administration official Hope Hicks by his side.",
    "Again.”\nBut Senate Minority Leader Mitch McConnell (R-KY) didn’t immediately jump in on backing Oz during an interview with Fox News Sunday, stating, “I think we’re in a good position to win that race regardless of who the nominee is.”\nLongtime Republican operative Roger Stone couldn’t help joining the pile-on either, writing on Telegram, “Wait?",
    "Elsewhere, Rep. Mo Brooks (R-AL), who is running for the Senate and who has split with Trump in recent over back-and-forth accusations of election interference, chalked up the Oz endorsement to weak-kneed staffers the ex-president has enlisted.",
    "(Another Trumpworld stalwart, Stephen Miller, stopped all involvement and employment with the McCormick campaign after Trump’s Oz endorsement, a source with direct knowledge of the matter told The Daily Beast after this story was published.)",
    "Lesser-known pro-Trump media personalities also stepped into the fold, including Townhall columnist Kurt Schlichter, who wrote: “It’s pretty hard for me to fully express how disappointed in Trump I am for endorsing Oz.”\n“Wait.",
    "Oz is the antithesis of everything that made Trump the best president of my lifetime.”\nThe infighting only intensified as more conservative commentators and politicos lined up to take shots at Trump’s endorsement.",
    "I was honored to have his endorsement in PA. Twice,” Sean Parnell, the former Trump-backed candidate, who dropped out of the race after an abuse allegation surfaced from his estranged ex-wife, wrote on Twitter.",
    "President [Trump] endorsed this guy?” while attaching a photo of the doctor, who rose to infamy after years of hosting a daytime television show with guests like Michelle Obama.",
    "Late Saturday evening, former President Donald Trump officially endorsed his old TV pal Dr. Mehmet Oz in the raucous Republican U.S. Senate primary race in Pennsylvania.",
    "“It’s like Donald Trump’s staff is sabotaging Trump by convincing him to make the worst possible endorsements,” conservative radio host Erick Erickson tweeted.",
    "“This endorsement could divide MAGA in the only way that matters: he could lose America First conservatives over it,” Breitbart News’ Joel Pollak wrote.",
    "While the likes of far-right radio host Stew Peters continue to take nightly jabs at Oz, the doctor has an ally in Fox News host Sean Hannity.",
    "In doing so, Trump, while speaking at a rally in North Carolina, ignited fury and ridicule among some of the loudest voices in Trumpworld.",
    "Everybody telling Trump who to endorse in primaries works for The Swamp,” said Brooks, whose Trump endorsement was recently rescinded.",
    "“This is happening because Trump’s surrounded himself by staff who are on McConnell’s payroll & hostile to the MAGA agenda.",
    "Subscribe here to get Source Material, The Daily Beast’s media newsletter, and get juicy scoops in your inbox every Monday.",
    "“I am supporting his nomination to be the Republican candidate,” Hannity said in March.",
    "Is there anything conservative about Dr. Oz?” Blaze TV’s Allie Beth Stuckey added.",
    "“I have enormous respect for President Trump.",
    "“I have known him for many, many years.”",
    "“But I’m disappointed by this.",
    "“They played him."
  ]
}