{
  "id": 6013,
  "mediaId": 2522,
  "date": "2022-02-13",
  "headline": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/02/McCormick-SG.png",
  "link": "https://www.bizpacreview.com/2022/02/13/penn-senate-candidate-to-run-lets-go-brandon-ad-during-super-bowl-to-highlight-biden-failings-1200718/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joshua Nybo",
  "authorUrl": "https://www.bizpacreview.com/author/joshua-nybo/",
  "termIds": [
    2201,
    3033,
    3670,
    3975,
    153,
    878,
    1171,
    5239
  ],
  "sentences": [
    "The frustration and anger we are feeling toward the failures of our current leadership in Washington is what motivated me to run.”\n“Whether it’s not being able to afford gas or groceries because of record-high inflation, rampant crime in our cities, a dramatic spike in the trafficking of fentanyl and human exploitation across open borders, or the disgraceful lack of accountability for the death of 13 young service members in Afghanistan – these problems were self-inflicted by Joe Biden and the extreme policies of the left.",
    "As the interview progressed, McCormick added that he was a veteran who has “fought for this country” (in the 1991 Gulf War), and that “[he] believe[s] in its greatness,” and that “Together we can turn things around by restoring common sense and strong leadership.”\nMcCormick is the former CEO of Bridgewater Associates, one of the world’s largest hedge funds, with ties to former president Donald Trump.",
    "The phrase, a cleaner version of “F*** Joe Biden,” has become a cultural icon on the right, and took off in October after an NBC reporter at NASCAR erroneously told winning driver Brandon Brown that the crowd was cheering him on, rather than expressing contempt for the president.",
    "The ad itself plays the “Brandon” chant while showing a highlight real of various headlines that point out the various failings of President Joe Biden’s administration, from inflation to Afghanistan, rising crime, and the ongoing crisis at the southern border.",
    "The Pennsylvania GOP primary has been bitterly contested, and many are watching to see who comes out on top of the pile of a large group of Republican contenders, each clamoring for the soon to be vacant seat of retiring Senator Pat Toomey.",
    "Despite this, Trump has not formally endorsed anyone in the Pennsylvania senate race, though with his fading influence as a Republican kingmaker, it may not matter much, or possibly may even help McCormick.",
    "SIGN UP HERE\nThe Super Bowl has become (in)famous for its ads, and many companies shell out huge amounts of money to run them during one of the most prime advertising slots there is.",
    "McCormick was rumored to be on the short list for a cabinet position under Trump, and his wife, Dina Powell, did in fact serve as deputy national security advisor under Trump.",
    "For an aspiring Senate candidate though, the Super Bowl presents an opportunity to share “Let’s go Brandon” with even more of the masses than before.",
    "Dave McCormick, a Pennsylvania Republican candidate for the U.S. Senate, will be running a 30 second ad this Sunday as part of his Senate campaign.",
    "Speaking to Fox News, McCormick stated, “The issues we are facing are so much bigger than ‘Brandon.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "Pennsylvanians have had enough,” McCormick continued.",
    "The public will not see it and we do not share it.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!"
  ]
}