{
  "id": 6378,
  "mediaId": 2658,
  "date": "2022-01-31",
  "headline": "The FEC reports we can’t wait to see",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/01/31/the-fec-reports-we-cant-wait-to-see-00003552",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2284,
    2321,
    2416,
    2808,
    3279,
    4030,
    305,
    372,
    875
  ],
  "sentences": [
    "And while the organization itself is nonpartisan — a press conference kicking off the weekend with NGA Chair Asa Hutchinson was full of mostly kumbaya statements about finding ways for governors to work across party lines together and with the Biden administration, and promoting a cross-country initiative on computer science education for K-12 students — both party committee chairs were game to talk about the midterms.",
    "“Key decisions for the committee are made by White House Deputy Chief of Staff Jen O'Malley Dillon, who speaks frequently with other DNC officials but only about three times a month by Zoom with Harrison,” and Harrison has primarily remained in his home state of South Carolina rather than visit donors or the DNC headquarters.",
    "CODA — HEADLINE OF THE DAY — “Justice touts achievements, tells haters to kiss Babydog’s hiney in delayed State of the State address” — Charleston Gazette-Mail\nFollow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "An analysis found “15 of the most politically active nonprofit organizations that generally align with the Democratic Party spent more than $1.5 billion in 2020 — compared to roughly $900 million spent by a comparable sample of 15 of the most politically active groups” aligned with Republicans.",
    "Greg Abbott accused Democratic opponent Beto O’Rourke, the former congressman, of violating “campaign finance reporting laws by misreporting more than $1.7 million of in-kind contributions as also being expenditures,” the Dallas Morning News’ Robert Garrett wrote.",
    "“In the process of squeezing out top prospective challengers with a show of political force, the two Democrats managed to break through a different kind of barrier to high office — longstanding perceptions about the profile of an electable statewide candidate.",
    "Presidential Big Board\nCALL TO ORDER — Members of the Democratic National Committee are taking aim at the Iowa caucuses, after the key presidential state fumbled the 2020 Democratic presidential race, POLITICO’s Elena Schneider and David Siders reported.",
    "Days until the Texas primary: 29\nDays until the CA-22 special election primary: 64\nDays until the Indiana and Ohio primaries: 93\nDays until the general election: 281\nDays until the 2024 election: 1,009\nWant to receive this newsletter every weekday?",
    "BATTLE FOR THE SENATE — Democrats Val Demings of Florida and Cheri Beasley of North Carolina cleared the Senate primary fields in their respective states by raising tons of cash and quelling fears about electability, POLITICO’s Maya King reported.",
    "Down the Ballot\nSPLIT SCREEN — The nation's governors descended on Washington's Marriott Marquis over the weekend for the National Governors Association's winter meeting, the organization's first in-person meeting since the start of the pandemic.",
    "“Any time the trajectory of the race changes so significantly by the time you get to South Carolina, it means we need to look at what’s happening,” said Yvette Lewis, chair of the Maryland state Democratic Party and a member of the committee.",
    "Republican Governors Association Chair Doug Ducey and Democratic Governors Association Chair Roy Cooper talked with POLITICO's Zach Montellaro about their midterm predictions and the role they see current and past presidents playing in it.",
    "Much of Tenney’s seat would join the swing district currently held by Democratic Rep. Antonio Delgado.”\n— A Pennsylvania judge heard arguments in the state’s redistricting case at the end of last week, Spotlight PA’s Kate Huangpu reported.",
    "— “Georgia voters were 45 times more likely to have their mail ballot applications rejected—and ultimately not vote as a result” in November’s municipal elections, compared to 2020, Mother Jones’ Ryan Little and Ari Berman reported.",
    "The DNC committee held a virtual meeting to discuss the party’s rules on Saturday and “signaled a willingness to overhaul the primary calendar ahead of 2024,” even discussing New Hampshire’s place on the primary calendar.",
    "BALLOT BATTLE — “A Pennsylvania state court on Friday struck down the law allowing any voter to cast a ballot by mail,”POLITICO’s Zach Montellaro wrote, although the decision will be appealed to the state Supreme Court.",
    "Flugrath previously served as communications strategy director for the Anti-Defamation League’s Southern Division in Atlanta, and is an alum of Florida state Agriculture Commissioner Nikki Fried’s office and campaign.",
    "The FEC reports we can’t wait to see\nBy STEPHANIE MURRAY\n01/31/2022 10:00 AM EST\nQuick Fix\n— It’s that time again: Campaign finance reports are due to the FEC today, and there are plenty of numbers we want to see.",
    "“If that same rejection rate were extrapolated to the 2020 race, more than 38,000 votes would not have been cast in a presidential contest decided by just over 11,000 votes,” according to Mother Jones’ analysis.",
    "PARTY PROBLEMS — Democratic National Committee chair Jaime Harrison is at odds with the White House, as the midterms approach and Biden’s approval rating remains underwater, NBC’s Natasha Korecki reported.",
    "“The non-endorsement is a disappointment for Conor Lamb, who has been trailing behind primary frontrunner John Fetterman, the lieutenant governor, in polls and fundraising,” Holly wrote.",
    "Kaptur’s district could become more red in redistricting, and the DCCC recently added her to its list of Frontline members, the party’s most vulnerable lawmakers running for reelection.",
    "— Pennsylvania Republican Mehmet Oz is up with a new ad attacking Dave McCormick as “China’s friend, not ours.” Oz and McCormick are two of the many Republicans running for Senate.",
    "John Bel Edwards kept quiet about the deadly arrest of Ronald Greene during his difficult reelection campaign in 2019, The Associated Press’ Jim Mustian and Jake Bleiberg wrote.",
    "State troopers had engaged in “a violent, lengthy struggle” with Greene that led to his death, but told his family and wrote in official reports he had died from a car crash.",
    "RETIREMENT WATCH — Rep. Marcy Kaptur has committed to run for reelection, even as dozens of other House Democrats announce their retirements, NBC News’ Henry Gomez reported.",
    "After losing out to Democrats quarter after quarter, House Republicans were on par with their counterparts on the other side of the aisle at the end of the third quarter.",
    "STAFFING UP — Max Flugrath joins the Georgia state Democratic Party as senior communications adviser, focusing on the race for governor and the primary between GOP Gov.",
    "THE KEYSTONE STATE — The Pennsylvania state Democratic Party declined to endorse a candidate to replace retiring Sen. Pat Toomey, POLITICO’s Holly Otterbein reported.",
    "Ted Cruz and Tim Scott will file reports that will give an insight into how they’ve been raising money, and whether they’re spending it to build campaigns-in-waiting.",
    "THE MAP LINES — Democrats could gain three congressional seats under a map proposed by Democratic state lawmakers, POLITICO New York’s Bill Mahoney wrote (for Pros).",
    "“What the governor knew, when he knew it and what he did have become questions in a federal civil rights investigation of the deadly encounter,” according to the AP.",
    "Those crazy liberals in Washington who want to cancel everyone and everything.”\n— The Club for Growth is up with a new ad attacking Alabama Republican Katie Britt.",
    "A couple of other FEC reports to watch: Georgia Democratic Reps. Lucy McBath and Carolyn Bourdeaux, and Illinois Republican Reps. Mary Miller and Rodney Davis.",
    "— Republican Governors Association Chair Doug Ducey and Democratic Governors Association Chair Roy Cooper spoke with POLITICO about their midterm predictions.",
    "The plan would account for the lost seat by “by eliminating the seat currently held by Republican Rep. Claudia Tenney, who lives in the Utica area.",
    "THE CASH DASH — House Majority PAC and its sister organization House Majority Forward raised a combined $55 million in 2021, the groups announced.",
    "Trump’s political committees will post filings for the second half of the year today, as the former president flirts with a comeback bid in 2024.",
    "— Democrats surpassed Republicans in dark money spending in the 2020 election, The New York Times’ Kenneth Vogel and Shane Goldmacher reported.",
    "Lamb had “hustled behind the scenes to capture the party’s blessing in the Senate race,” making calls and even sending campaign-style mailers.",
    "“Through storms and floods and now pandemic, I stood shoulder to shoulder with you and I've delivered help,” Rice says in the 30-second spot.",
    "DROPPING OUT — South Carolina Republican Graham Allen ended his campaign against Rep. Tom Rice, The Post and Courier’s Andy Shain reported.",
    "I refuse to allow my own pride to get in the way of fighting for what this Country needs,” Allen, a Trump ally, wrote in a Facebook post.",
    "The commercial highlight’s Flood’s “vote to extend taxpayer funded healthcare benefits to illegals” and ties him to President Joe Biden.",
    "Last quarter, not a single Trump-endorsed challenger outraised a Republican lawmaker who voted to impeach former President Donald Trump.",
    "The polls show Democrats have an enthusiasm gap against Republicans, and they’re heading into a brutal political environment this fall.",
    "— New York state lawmakers unveiled a draft congressional map on Sunday that could give Democrats three more seats in the House.",
    "Cawthorn is the youngest House lawmaker, and Masters would be the youngest Republican member of the Senate if he is elected.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "The Sixteen Thirty Fund, a group aligned with the left, received donations as large as $50 million, according to the Times.",
    "Trump’s groups brought in $82 million and had $102 million in cash on hand, according to filings posted at the end of July.",
    "Beyond fundraising totals, the reports will show who has the support of major donors — and grassroots, small-dollar donors.",
    "We’ll keep an eye on West Virginia Republican Reps. David McKinley and Alex Mooney, who are waging war over the airwaves.",
    "ENDORSEMENT ALERT — Rep. Madison Cawthorn endorsed Arizona Republican Blake Masters, who is challenging Sen. Mark Kelly.",
    "Redistricting has drawn several House lawmakers into the same districts, pitting them against one another in 2022.",
    "Republicans’ windfall has been fueled by small dollar donors, an area where Democrats used to have an advantage.",
    "A panel of judges ruled legislation that passed with bipartisan support in 2019 violated the state constitution.",
    "ON THE AIRWAVES — Rep. Jeff Fortenberry is up with a new ad attacking Republican primary opponent Mike Flood.",
    "— Nebraska Republicans Brett Lindstrom and Jim Pillen are up with new ads for their gubernatorial campaigns.",
    "You’ll also receive daily policy news and other intelligence you need to act on the day’s biggest stories.",
    "In his 30-second spot, Lindstrom emphasizes his biography and calls for a new generation of leadership.",
    "State Attorney General Josh Shapiro, a Democrat running for governor, said the ruling will be appealed.",
    "A note to campaigns: You don’t have to keep us waiting until 11:59 p.m. to put your reports online.",
    "We’ll be watching Rep. Liz Cheney versus GOP challenger Harriet Hageman, who has Trump’s support.",
    "Tom Wolf vetoed a proposal sent to him by the Republican-controlled legislature,” Huangpu wrote.",
    "Semi-annual filers also have to get their documents in today, which will cover July 1-Dec. 31.",
    "The Club is backing Rep. Mo Brooks (R-Ala.) to replace retiring Sen. Richard Shelby (R-Ala.).",
    "The ex-president’s endorsement is a test of his political power now that he’s out of office.",
    "New York, which lost a seat due to reapportionment, has 19 Democrats and eight Republicans.",
    "In the past, those perceptions have often worked against Black candidates,” Maya wrote.",
    "Campaign finance reports will be flowing into the Federal Election Commission all day.",
    "Individually, House Majority PAC ended the year with $39.1 million in cash on hand.",
    "“The state court system is set to pick the next map just days after Democratic Gov.",
    "The decision was a win for Republicans who are pushing to eliminate voting by mail.",
    "Pillen takes aim at liberals in his ad, saying: “You know what really ticks me off?",
    "So far, his backing hasn’t turbocharged fundraising for his selected candidates.",
    "Losing ground in fundraising would be another source of panic for the party.",
    "Top Line\nMONEY MOVES — Are you ready to hit the refresh button on FEC.gov?",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "Email me at smurray@politico.com and follow me on Twitter @stephanie_murr.",
    "Filings due today cover the fourth quarter, which spans Oct. 1-Dec. 31.",
    "The new ad ties Britt to Cheney, one of Trump’s top Republican enemies.",
    "But the number of Democrats could rise to 22 under the proposed map.",
    "Rice is one of the 10 House Republicans who voted to impeach Trump.",
    "Until then, here are some of the numbers we can’t wait to see.",
    "An appeal would trigger a stay of the lower court’s ruling.",
    "It’s never too early, so where does the 2024 race stand?",
    "Republicans passed new voting restrictions last year.",
    "Beyond Trump, possible 2024 candidates like Sens.",
    "Brian Kemp and former Sen. David Perdue (R-Ga.).",
    "Meanwhile, Rice is up with a new positive TV ad.",
    "Who’s on top in member-vs-member House races?",
    "NEW DETAILS — Louisiana Democratic Gov.",
    "Can Trump-endorsed candidates compete?",
    "But rest assured, we will be awake.",
    "Did Democrats get their mojo back?",
    "One candidate against RINOs.",
    "“President Trump was clear.",
    "Subscribe to POLITICO Pro.",
    "The Cooper interview.",
    "The Ducey interview.",
    "Good Monday morning.",
    "— Texas GOP Gov."
  ]
}