[
  {
    "id": 5867,
    "mediaId": 2586,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Nathan Dougherty",
    "title": "Bills Landing ‘Innovative Football Mind’ to Help QB Josh Allen: Report"
  },
  {
    "id": 3255,
    "mediaId": 2706,
    "date": "2022-03-09",
    "sentence": "Ryan <span class='selected-term'>Fitzpatrick</span> began last season as the team's starter, with Taylor Heinicke taking over after the veteran was sidelined by a hip injury.",
    "author": "Michael Middlehurst-Schwartz",
    "title": "Washington Commanders to acquire QB Carson Wentz from Indianapolis Colts in trade"
  },
  {
    "id": 3026,
    "mediaId": 2586,
    "date": "2022-03-10",
    "sentence": "Names such as Marcus Mariota and Ryan <span class='selected-term'>Fitzpatrick</span> have been linked to the Bills as possible replacements for Trubisky, but an unexpected player suddenly added himself to that list on Thursday, March 10.",
    "author": "Emily Bicks",
    "title": "Bills Could Possibly Sign QB Colin Kaepernick as Josh Allen’s Backup"
  },
  {
    "id": 3131,
    "mediaId": 2523,
    "date": "2022-03-13",
    "sentence": "Notable Free Agents\nG Brandon Scherff\nQB Ryan <span class='selected-term'>Fitzpatrick</span>\nWR Cam Sims\nWR Adam Humphries\nCB Bobby McCain\nLB Jon Bostic\nLT Cornelius Lucas\nTE Ricky Seals-Jones\nRight guard Brandon Scherff is the most notable player Washington has headed to market.",
    "author": "Kristopher Knox",
    "title": "Commanders' Last-Minute Guide to 2022 NFL Free Agency"
  },
  {
    "id": 3056,
    "mediaId": 2586,
    "date": "2022-03-15",
    "sentence": "Trubisky’s contract is in the mix with backups Case Keenum (Cleveland Browns), Jordan Love (Green Bay Packers), free agent Ryan <span class='selected-term'>Fitzpatrick</span>, and rookie contracts for Patriots’ Mac Jones and Ravens’ Lamar Jackson.",
    "author": "Allison Koehler",
    "title": "Steelers Acquisition of Ex-Bears, Bills QB Mitch Trubisky Draws Mixed Twitter Reactions"
  },
  {
    "id": 2963,
    "mediaId": 2523,
    "date": "2022-03-18",
    "sentence": "Ryan <span class='selected-term'>Fitzpatrick</span> has a history with the organization.",
    "author": "Adam Wells",
    "title": "Texans' Top QB Options in Draft, Free Agency After Deshaun Watson Trade"
  }
]