[
  {
    "id": 3801,
    "mediaId": 2551,
    "date": "2022-03-05",
    "sentence": "Menna <span class='selected-term'>Fitzpatrick</span>, Britain's other competitor in the woman's visually-impaired downhill, finished fifth in what is one of her weaker events.",
    "author": "Oliver Salt For Mailonline",
    "title": "Great Britain land first medal at the Beijing Winter Paralympics as skiing star Millie Knight defeats her demons to claim bronze in the women's visually-impaired downhill event"
  },
  {
    "id": 2782,
    "mediaId": 2594,
    "date": "2022-03-09",
    "sentence": "She cut a forlorn figure after a sluggish second run in Monday’s Super Combined slalom, where she was leapfrogged by compatriot and technical specialist Menna <span class='selected-term'>Fitzpatrick</span> – Britain’s most decorated Winter Paralympian athlete – onto the podium.",
    "author": "Will Jennings",
    "title": "‘It’s been crazy’: Brett Wild and Millie Knight frustrated by ParalympicsGB’s intense schedule"
  },
  {
    "id": 2852,
    "mediaId": 2551,
    "date": "2022-03-11",
    "sentence": "+4\nView gallery\nOn a positive day for the team, Scott Meenagh (above) achieved his best ever Paralympic finish\n+4\nView gallery\nMenna <span class='selected-term'>Fitzpatrick</span> (above) was unable to add another medal to her collection this time around\nScott Meenagh achieved the best result of his Paralympic career with sixth place in the long distance sitting biathlon while double medallist Menna Fitzpatrick was seventh in the women's giant slalom.",
    "author": "Pa Sport Staff",
    "title": "Ollie Hill creates history by winning ParalympicsGB's FIRST EVER Winter Paralympic medal in snowboarding as he earns bronze to take the nation's tally to six podium finishes in Beijing"
  },
  {
    "id": 2853,
    "mediaId": 2584,
    "date": "2022-03-11",
    "sentence": "Millie Knight of ParalympicsGB finished ninth, describing Friday’s run as “really good fun”, and Britain’s Menna <span class='selected-term'>Fitzpatrick</span> finished seventh.",
    "author": "Martin Belam",
    "title": "Winter paralympics 2022: historic bronze for GB snowboarder Ollie Hill"
  },
  {
    "id": 3151,
    "mediaId": 2594,
    "date": "2022-03-11",
    "sentence": "",
    "author": "Will Jennings",
    "title": "Snowboarder Ollie Hill blocks out social media buzz to make Winter Paralympic history"
  },
  {
    "id": 2878,
    "mediaId": 2594,
    "date": "2022-03-12",
    "sentence": "Her previous Super-G bronze was improved into a silver, her Super Combined silver was lowered to a bronze while elsewhere, <span class='selected-term'>Fitzpatrick</span> was unable to snatch a slalom podium and also failed to fire in the giant slalom, where she came second in Korea.",
    "author": "Will Jennings",
    "title": "Menna Fitzpatrick eager to cement status as Britain’s greatest Winter Paralympian"
  },
  {
    "id": 3394,
    "mediaId": 3992,
    "date": "2022-03-13",
    "sentence": "Britain's only other golds at the Winter Paralympics were won by skiers Kelly Gallagher in 2014 and Menna <span class='selected-term'>Fitzpatrick</span> in 2018.",
    "author": "",
    "title": "Winter Paralympics: Neil and Andrew Simpson to carry GB flag at closing ceremony"
  }
]