[
  {
    "id": 6324,
    "mediaId": 2637,
    "date": "2022-02-06",
    "sentence": "Andrew Putnam, who entered Sunday tied atop the leaderboard with Hoge and Hossler, only managed a 1-over 73 to tie for sixth at 14 under with Joel Dahmen (72) and England’s Matt <span class='selected-term'>Fitzpatrick</span> (68).",
    "author": "",
    "title": "Tom Hoge emerges from pack at Pebble Beach for first PGA Tour win"
  },
  {
    "id": 2750,
    "mediaId": 2572,
    "date": "2022-03-16",
    "sentence": "FIRST ON FOX NEWS: REPUBLICAN NATIONAL COMMITTEE SHATTERS FUNDRAISING RECORDS IN FEBRUARY\nThe RJC is also endorsing Republican Reps. David Schweikert of Arizona (AZ-01), David Valadao of California (CA-22), Andy Harris of Maryland (MD-01), Peter Meijer of Michigan (MI-03), Don Bacon of Nebraska (NE-02), Yvette Herrell of New Mexico (NM-02), Nicole Malliotakis of New York (NY-11), Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania (PA-01) and Nancy Mace of South Carolina (SC-01).",
    "author": "Paul Steinhauser",
    "title": "Sen. Ron Johnson tops list of Republicans endorsed by top Jewish GOP organization"
  },
  {
    "id": 3246,
    "mediaId": 2868,
    "date": "2022-03-17",
    "sentence": "Here's How\n“I don’t see earmarks being any kind of replacement for a broader climate strategy,” Ryan <span class='selected-term'>Fitzpatrick</span>, director of the climate and energy program at the climate and energy nonprofit Thirdway, told Grist.",
    "author": "",
    "title": "Why the return of earmarks could be good news for the planet"
  },
  {
    "id": 2547,
    "mediaId": 2679,
    "date": "2022-03-19",
    "sentence": "The club has mental health counselors, but Diane <span class='selected-term'>Fitzpatrick</span>, the club’s CEO, said she wished she had the money for a full-time social worker.",
    "author": "SHERYL GAY STOLBERG",
    "title": "After stumbles, Biden’s health secretary seeks a reboot"
  },
  {
    "id": 2710,
    "mediaId": 2560,
    "date": "2022-03-21",
    "sentence": "Company President Colleen <span class='selected-term'>Fitzpatrick</span> described the case as having \"the toughest technical challenges we have faced.\"",
    "author": "Carol Thompson",
    "title": "Roxanne Wood was found dead in her home in 1987. Police say they have cracked the case"
  },
  {
    "id": 1233,
    "mediaId": 2584,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Scott Murray",
    "title": "The Masters 2022: first round – as it happened"
  },
  {
    "id": 971,
    "mediaId": 2584,
    "date": "2022-04-09",
    "sentence": "",
    "author": "Scott Murray",
    "title": "The Masters 2022: third round – as it happened"
  },
  {
    "id": 879,
    "mediaId": 2584,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Scott Murray",
    "title": "Masters 2022: Scheffler wins first major as McIlroy surges to second – as it happened"
  }
]