[
  {
    "id": 3803,
    "mediaId": 2528,
    "date": "2022-03-01",
    "sentence": "Gottheimer will be speaking alongside Republican Rep. Brian <span class='selected-term'>Fitzpatrick</span> and the director of No Labels.",
    "author": "Bryan Metzger",
    "title": "Josh Gottheimer says it's 'massively unproductive' for Rashida Tlaib to give a State of the Union response even though he's also giving one"
  },
  {
    "id": 3949,
    "mediaId": 2746,
    "date": "2022-03-01",
    "sentence": "Mr. Gottheimer will deliver that “perspective” alongside Rep. Brian <span class='selected-term'>Fitzpatrick</span>, a Pennsylvania Republican, with whom he chairs the Congressional Problem Solvers Caucus.",
    "author": "Haris Alic",
    "title": "Democrats’ divisions spill into view with competing responses to Biden’s State of the Union"
  },
  {
    "id": 4255,
    "mediaId": 2619,
    "date": "2022-03-01",
    "sentence": "In addition, moderate Democratic Rep. Josh Gottheimer of New Jersey had been due to give his “perspective” immediately following the State of the Union, as he participated in an event hosted by the “No Labels,” a nonpartisan group whose stated goal is to “break the gridlock and dysfunction.”\nRepublican Rep. Brian <span class='selected-term'>Fitzpatrick</span> of Pennsyvlania also had been scheduled to take part in the No Labels event.",
    "author": "Victor Reklaitis",
    "title": "‘Biden and his party have sent us back,’ says Republican after State of the Union, as Democrats also respond to speech"
  },
  {
    "id": 4215,
    "mediaId": 2671,
    "date": "2022-03-01",
    "sentence": "Then, on Monday night, the centrist group No Labels announced that “immediately following” the speech, it would host “an unprecedented bipartisan perspective” panel featuring Democratic Rep. Josh Gottheimer of New Jersey and Republican Rep. Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, the two co-chairs of the bipartisan Problem Solvers Caucus in Congress.",
    "author": "The Right Scoop",
    "title": "THREE Democrats will be responding to Joe Biden’s SOTU address"
  }
]