[
  {
    "id": 6365,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "New Joint Fundraisers\nNittany-Buckeye Joint Committee (Reps. Brian <span class='selected-term'>Fitzpatrick</span>, Brad Wenstrup, BRINGING AMERICA TOGETHER PAC, BUILDING AND RESTORING THE AMERICAN DREAM FUND)\nWinning Red Committee (Sens.",
    "author": "",
    "title": "Pelosi aide joins theGROUP"
  },
  {
    "id": 3887,
    "mediaId": 2883,
    "date": "2022-03-01",
    "sentence": "The leader of the pack in rebuffing his party was GOP Rep. Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, one of an ever-dwindling number of members representing a perennially competitive district.",
    "author": "Niels Lesniewski\nRyan Kelly",
    "title": "Party unity vote studies underscore polarized State of the Union"
  },
  {
    "id": 3920,
    "mediaId": 2528,
    "date": "2022-03-01",
    "sentence": "Then, on Monday night, the centrist group No Labels announced that \"immediately following\" the speech, it would host \"an unprecedented bipartisan perspective\" panel featuring Democratic Rep. Josh Gottheimer of New Jersey and Republican Rep. Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, the two co-chairs of the bipartisan Problem Solvers Caucus in Congress.",
    "author": "Grace Panetta",
    "title": "3 Democratic members of Congress are giving responses to Biden's State of the Union"
  },
  {
    "id": 1114,
    "mediaId": 2526,
    "date": "2022-04-08",
    "sentence": "Now, Reps. Andy Harris (R-MD) and Brian <span class='selected-term'>Fitzpatrick</span> (R-PA) are joining a swath of House Democrats to ask Biden to extend TPS to potentially tens of thousands more Ukrainians who are arriving at the border.",
    "author": "John Binder",
    "title": "House Republicans, Democrats Beg Biden to Open U.S. Borders to Ukrainians"
  },
  {
    "id": 1229,
    "mediaId": 2526,
    "date": "2022-04-08",
    "sentence": "Golden, a swing district Democrat, said in a statement on Thursday, “The Biden Administration is not currently prepared for a large increase in border crossings.” The Maine Democrat said ending the Trump policy would be “irresponsible and could create crisis conditions that would be dangerous for both migrants coming to America and Americans themselves.”\nReps. Tom O’Halleran (D-AZ), August Pfluger (R-TX), Stephanie Murphy (D-FL), Brian <span class='selected-term'>Fitzpatrick</span> (R-PA), Chris Pappas (D-NH), Don Bacon (D-NH), Greg Stanton (D-AZ), and Maria Elvira Salazar (R-FL) cosponsored the legislation.",
    "author": "Sean Moran",
    "title": "House Democrats Push Back on Joe Biden’s Ending of Title 42"
  }
]