[
  {
    "id": 6814,
    "mediaId": 2644,
    "date": "2022-01-27",
    "sentence": "Cornerback Minkah <span class='selected-term'>Fitzpatrick</span>, a first-round pick in 2018, ripped Flores after he was traded to the Steelers in 2019.",
    "author": "Paul Schwartz",
    "title": "The questions that will make or break Brian Flores’ Giants coaching chances"
  },
  {
    "id": 5497,
    "mediaId": 4045,
    "date": "2022-02-03",
    "sentence": "Their quarterbacks were the 37-year-old retread Ryan <span class='selected-term'>Fitzpatrick</span> and the 22-year-old Josh Rosen, who already had been dumped by Arizona, the team that drafted him.",
    "author": "Mark Bradley",
    "title": "Mark Bradley: Will Brian Flores’ lawsuit lead to NFL change? Let’s hope."
  },
  {
    "id": 6042,
    "mediaId": 2586,
    "date": "2022-02-06",
    "sentence": "And that’s his play style, that’s why we love him, but a backup quarterback is very important, knowing the way he plays the game.”\nFierro noted there are some other veteran options, including former Bills quarterbacks Ryan <span class='selected-term'>Fitzpatrick</span> and Tyrod Taylor, but noted that Marcus Mariota could be an especially intriguing option given his rushing ability.",
    "author": "Nathan Dougherty",
    "title": "Bills Could Target Broncos QB to Replace Mitch Trubisky: Insider"
  },
  {
    "id": 4701,
    "mediaId": 2740,
    "date": "2022-02-22",
    "sentence": "Ryan <span class='selected-term'>Fitzpatrick</span> from Houston to the Jets for a 2016 sixth\nFitzpatrick was decent in Houston with 17 TDs and 8 INTs and a career-high 95.3 passer rating in 12 games.",
    "author": "Nat Newell",
    "title": "What can the Colts get in a trade in exchange for Carson Wentz? NFL history offers insight"
  },
  {
    "id": 3987,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Especially since this is the same city that justified the Minkah <span class='selected-term'>Fitzpatrick</span> trade by saying Fitzpatrick “counted” as a No.",
    "author": "Tim Benz",
    "title": "Tim Benz: I'm skeptical of the Aaron Rodgers story, too. But the Steelers should be doing what was reported"
  },
  {
    "id": 3175,
    "mediaId": 2586,
    "date": "2022-03-09",
    "sentence": "",
    "author": "Nathan Dougherty",
    "title": "Bills Already Feeling Impact of Blockbuster Russell Wilson Trade"
  },
  {
    "id": 3061,
    "mediaId": 2586,
    "date": "2022-03-14",
    "sentence": "Several names, including Marcus Mariota and Ryan <span class='selected-term'>Fitzpatrick</span>, have been floated in recent weeks as possible replacements for Trubisky.",
    "author": "Emily Bicks",
    "title": "Ex-Bills QB Mitch Trubisky Sends Message After Signing With Steelers"
  }
]