[
  {
    "id": 6403,
    "mediaId": 2512,
    "date": "2022-01-21",
    "sentence": "They'd reportedly hoped the dirt would be a way to convince Toomey <span class='selected-term'>Fitzpatrick</span> to support Trump's baseless claims of voter fraud which suggested that President Joe Biden's election win was illegitimate.",
    "author": "Meaghan Ellis",
    "title": "Michael Flynn's allies allegedly plotted to uncover dirt on GOP lawmakers who refused to back Trump's voter fraud claims"
  },
  {
    "id": 6991,
    "mediaId": 2630,
    "date": "2022-01-21",
    "sentence": "Joshua Stein, a philosopher who studies antisemitism, pointed out on Twitter that two representatives in the caucus are Christians from Pennsylvania, Dan Meuser and Brian <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Noah Berlatsky",
    "title": "A Christian-led caucus 'protecting' Jewish values? No thanks."
  },
  {
    "id": 6375,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "The suit alleges “the Democratic-backed map redrawing the boundaries of New Mexico’s three congressional districts for the next decade intentionally chops up Republican voting strongholds.”\n— Rhode Island Republicans claim the state’s redistricting commission violated the Open Meetings Act three dozen times, the Boston Globe’s Edward <span class='selected-term'>Fitzpatrick</span> reported.",
    "author": "",
    "title": "GOP Senate spending tops $15M in PA"
  },
  {
    "id": 5614,
    "mediaId": 2664,
    "date": "2022-02-11",
    "sentence": "Pompeo’s PAC donated $2,500 to at least three Republican congressmen — Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, Don Bacon of Nebraska and Andrew Garbarino of New York — among the 13 GOP members voting in support of the $1.2 trillion infrastructure bill.",
    "author": "Tim Carpenter",
    "title": "Pompeo's PAC spends $2.2 million as he lays the foundation for a presidential campaign"
  },
  {
    "id": 4555,
    "mediaId": 2572,
    "date": "2022-02-22",
    "sentence": "Glenn Youngkin and Attorney General Jason Miyares to Arkansas Senate candidate Sarah Huckabee Sanders and House Problem Solvers Caucus Co-Chair Brian <span class='selected-term'>Fitzpatrick</span>, R-Pa.",
    "author": "Tyler Olson",
    "title": "Pompeo endorses former State Department spokesperson Ortagus in Tennessee House race"
  },
  {
    "id": 3920,
    "mediaId": 2528,
    "date": "2022-03-01",
    "sentence": "Then, on Monday night, the centrist group No Labels announced that \"immediately following\" the speech, it would host \"an unprecedented bipartisan perspective\" panel featuring Democratic Rep. Josh Gottheimer of New Jersey and Republican Rep. Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, the two co-chairs of the bipartisan Problem Solvers Caucus in Congress.",
    "author": "Grace Panetta",
    "title": "3 Democratic members of Congress are giving responses to Biden's State of the Union"
  },
  {
    "id": 3887,
    "mediaId": 2883,
    "date": "2022-03-01",
    "sentence": "The leader of the pack in rebuffing his party was GOP Rep. Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, one of an ever-dwindling number of members representing a perennially competitive district.",
    "author": "Niels Lesniewski\nRyan Kelly",
    "title": "Party unity vote studies underscore polarized State of the Union"
  },
  {
    "id": 3942,
    "mediaId": 2745,
    "date": "2022-03-04",
    "sentence": "All speakers echoed the remarks of Rep. Brian <span class='selected-term'>Fitzpatrick</span> (R-Pa.), who praised federal workers as “dedicated and hard-working public servants that play an incredibly vital role in all of our communities and our nation.”\nHis appearance demonstrated a level of federal workforce support uncommon among his Republican partisans but one informed by his experience as a federal prosecutor and FBI agent.",
    "author": "",
    "title": "Biden has been good to federal unions. But one of the biggest ones says he needs to improve pay and benefits."
  },
  {
    "id": 3952,
    "mediaId": 2512,
    "date": "2022-03-04",
    "sentence": "You don’t want to have to talk about anything political.”\nAccording to Kathy Foulkrod, a friend told her, “I just came to tell you I had to take my Biden sign down because I was too afraid.”\nThe Democrats Politico interviewed in Clearfield County, Cadelago reports, “say party leaders need to come to terms with just how calamitous the dropoff of rural support has been.”\nCadelago writes, “The fundamental question the party needs to answer — one that gnaws at everyone from the Foulkrods and <span class='selected-term'>Fitzpatrick</span> to Biden’s advisers in Washington — is: how far can they expect to get with people who refuse even to listen?”",
    "author": "Alex Henderson",
    "title": "These pro-Biden Democrats find themselves surrounded by ‘coarse’ MAGA Republicans in small rural towns"
  },
  {
    "id": 4294,
    "mediaId": 2668,
    "date": "2022-03-04",
    "sentence": "In November 2021, WePay, a J.P. Morgan Chase-owned payment processor, informed the Missouri-based Defense of Liberty political action committee that it would stop offering its services to the organization after it planned an event featuring Donald Trump Jr. (Chase later reversed the decision, but only after “Missouri treasurer Scott <span class='selected-term'>Fitzpatrick</span> threatened to have the state stop doing business with the bank.”)\nIn 2020, Wells Fargo suspiciously closed a bank account belonging to Lauren Witzke, a 2020 Republican candidate for the Delaware Senate.",
    "author": "The Heartland Institute",
    "title": "Are Financial Institutions Using ESG Social Credit Scores to Coerce Individuals and Small Businesses?"
  },
  {
    "id": 1229,
    "mediaId": 2526,
    "date": "2022-04-08",
    "sentence": "Golden, a swing district Democrat, said in a statement on Thursday, “The Biden Administration is not currently prepared for a large increase in border crossings.” The Maine Democrat said ending the Trump policy would be “irresponsible and could create crisis conditions that would be dangerous for both migrants coming to America and Americans themselves.”\nReps. Tom O’Halleran (D-AZ), August Pfluger (R-TX), Stephanie Murphy (D-FL), Brian <span class='selected-term'>Fitzpatrick</span> (R-PA), Chris Pappas (D-NH), Don Bacon (D-NH), Greg Stanton (D-AZ), and Maria Elvira Salazar (R-FL) cosponsored the legislation.",
    "author": "Sean Moran",
    "title": "House Democrats Push Back on Joe Biden’s Ending of Title 42"
  },
  {
    "id": 946,
    "mediaId": 2572,
    "date": "2022-04-09",
    "sentence": "The Republicans on the bipartisan House legislation are Reps. Tony Gonzales of Texas, August Pfluger of Texas, Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, Don Bacon of Nebraska and Maria Elvira Salazar of Florida.",
    "author": "Marisa Schultz",
    "title": "Dem Rep. Cuellar joins bipartisan effort to block Biden's rollback of Title 42, opposes bussing migrants to DC"
  }
]