[
  {
    "id": 6658,
    "mediaId": 2732,
    "date": "2022-01-21",
    "sentence": "The Steelers’ biggest assets are a few superstar performers on defense: edge rusher T.J. Watt, defensive end Cameron Heyward and safety Minkah <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Mark Madden",
    "title": "Mark Madden: Steelers are underinvested at 3 most important positions"
  },
  {
    "id": 6974,
    "mediaId": 2732,
    "date": "2022-01-21",
    "sentence": "• Rudolph 11/4\n• Derek Carr (Las Vegas) 7/1\n• Jimmy Garoppolo (San Francisco) 15/2\n• Jameis Winston (New Orleans) 9/1\n• Kenny Pickett (Pitt) 9/1\n• Haskins 10/1\nA pair of other veterans, Kirk Cousins and Ryan <span class='selected-term'>Fitzpatrick</span>, are next at 11/1.",
    "author": "Tim Benz",
    "title": "Tim Benz: Mike Tomlin says 'all options are on the table' for a new quarterback. Let's hope he means it"
  },
  {
    "id": 3550,
    "mediaId": 2637,
    "date": "2022-03-09",
    "sentence": "Now a division foe of the Eagles, Wentz gives the Commanders a stable starter after a revolving door that has included Alex Smith, first-round pick Dwayne Haskins, Ryan <span class='selected-term'>Fitzpatrick</span> and Taylor Heinicke.",
    "author": "",
    "title": "New Commander: Washington to acquire QB Carson Wentz"
  },
  {
    "id": 3106,
    "mediaId": 2586,
    "date": "2022-03-12",
    "sentence": "“He’s started to build a <span class='selected-term'>Fitzpatrick</span>-like resume also with some Bills history,” explains Iyer.",
    "author": "DJ Siddiqi",
    "title": "Steelers Projected to Land Ex-Pro Bowl QB in Free Agency"
  },
  {
    "id": 3059,
    "mediaId": 2746,
    "date": "2022-03-14",
    "sentence": "With Turner, Washington has started six different quarterbacks: Dwayne Haskins, Kyle Allen, Alex Smith, Taylor Heinicke, Ryan <span class='selected-term'>Fitzpatrick</span> and Garrett Gilbert.",
    "author": "Matthew Paras",
    "title": "Commanders give offensive coordinator Scott Turner mutli-year extension"
  },
  {
    "id": 3061,
    "mediaId": 2586,
    "date": "2022-03-14",
    "sentence": "Several names, including Marcus Mariota and Ryan <span class='selected-term'>Fitzpatrick</span>, have been floated in recent weeks as possible replacements for Trubisky.",
    "author": "Emily Bicks",
    "title": "Ex-Bills QB Mitch Trubisky Sends Message After Signing With Steelers"
  },
  {
    "id": 1290,
    "mediaId": 2732,
    "date": "2022-04-01",
    "sentence": "And they aren’t counting on Karl Joseph to be the other safety next to Minkah <span class='selected-term'>Fitzpatrick</span>, are they?",
    "author": "Tim Benz",
    "title": "Tim Benz: Mike Tomlin's embrace of quarterback hype has many purposes"
  },
  {
    "id": 643,
    "mediaId": 2586,
    "date": "2022-04-17",
    "sentence": "#Steelers #steelersnation @steelers pic.twitter.com/5nhMVXD4i7\n— Papi (@SnakeDraftViper) March 29, 2022\nIt’s not clear what the future holds for <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Nathan Dougherty",
    "title": "Popular Former Bills QB Could Be Roethlisberger’s Replacement: Insider"
  }
]