[
  {
    "id": 5951,
    "mediaId": 2584,
    "date": "2022-02-03",
    "sentence": "She picked up her 100th ODI wicket to become the second-fastest woman to reach that milestone behind Australia legend and former teammate Cathryn <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Australian Associated Press",
    "title": "Megan Schutt hits back at ‘ironic’ England after Australia retain Women’s Ashes"
  },
  {
    "id": 6324,
    "mediaId": 2637,
    "date": "2022-02-06",
    "sentence": "Andrew Putnam, who entered Sunday tied atop the leaderboard with Hoge and Hossler, only managed a 1-over 73 to tie for sixth at 14 under with Joel Dahmen (72) and England’s Matt <span class='selected-term'>Fitzpatrick</span> (68).",
    "author": "",
    "title": "Tom Hoge emerges from pack at Pebble Beach for first PGA Tour win"
  },
  {
    "id": 4220,
    "mediaId": 3992,
    "date": "2022-03-05",
    "sentence": "",
    "author": "",
    "title": "Arnold Palmer Invitational: Viktor Hovland leads Rory McIlory by two strokes"
  },
  {
    "id": 2329,
    "mediaId": 2551,
    "date": "2022-03-22",
    "sentence": "+4\nView gallery\nEnglishman Ian Poulter (above) has work to do if he is to make it to this year’s Masters\nWith only one player from each group progressing to the weekend knockout stages, Poulter has to get past American Scottie Scheffler, twice a winner this year, and two of his Ryder Cup comrades in Tommy Fleetwood and Matt <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Derek Lawrenson for the Daily Mail",
    "title": "Ian Poulter is praying for one more match play miracle to qualify for his 17th Masters next month... with the Englishman needing to jump 17 places in the world rankings into the top 50"
  },
  {
    "id": 2226,
    "mediaId": 2594,
    "date": "2022-03-25",
    "sentence": "In a repeat of last year’s final, Horschel will face Scottie Scheffler in the last 16 after the latter twice got the better of Matt <span class='selected-term'>Fitzpatrick</span>, firstly winning their group five contest 5 and 4 to force a play-off and then making a birdie on the sixth extra hole to advance.",
    "author": "Phil Casey",
    "title": "Seamus Power books Masters debut despite defeat in final group game in Austin"
  },
  {
    "id": 562,
    "mediaId": 2712,
    "date": "2022-04-12",
    "sentence": "More should be made of England's stars, like Tommy Makinson, to promote them, says Karl <span class='selected-term'>Fitzpatrick</span>Credit: SWPIX.COM\nAnd Warrington chief executive Fitzpatrick feels Rugby Football League chiefs should be planting the stars in the public conscience.",
    "author": "Gary Carter",
    "title": "England players should be being pushed to become household names before World Cup, says Karl Fitzpatrick"
  }
]