[
  {
    "id": 6370,
    "mediaId": 2658,
    "date": "2022-01-06",
    "sentence": "Rep. Brian <span class='selected-term'>Fitzpatrick</span> (R-Pa.) isn’t sure people understand just how fragile democracy is.",
    "author": "",
    "title": "A year later, the Hill ‘is no longer the safest place'"
  },
  {
    "id": 3671,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "And No Labels “will host an unprecedented bipartisan response” from Republican Rep. Brian <span class='selected-term'>Fitzpatrick</span> and Democratic Rep. Josh Gottheimer, co-chairs of the House Problem Solvers Caucus (which creates more problems than it solves).",
    "author": "Laura Clawson",
    "title": "and the economy in first State of the Union"
  },
  {
    "id": 3756,
    "mediaId": 2746,
    "date": "2022-03-03",
    "sentence": "“[Putin], you’ve done something nobody else can do.”\nThe list also included House Problem Solvers Caucus leaders Josh Gottheimer, New Jersey Democrat, and Brian <span class='selected-term'>Fitzpatrick</span>, Pennsylvania Republican.",
    "author": "Ramsey Touchberry",
    "title": "Biden faces bipartisan pressure to ban Russian oil and ramp up U.S. production"
  },
  {
    "id": 4198,
    "mediaId": 2916,
    "date": "2022-03-03",
    "sentence": "",
    "author": "Zachary Evans",
    "title": "Manchin, Murkowski Propose Bill to Ban Imports of Russian Oil"
  },
  {
    "id": 2913,
    "mediaId": 2658,
    "date": "2022-03-17",
    "sentence": "Chuck Grassley (R-Iowa) and Amy Klobuchar (D-Minn.), Reps. Brendan Boyle (D-Pa.), Gregory Meeks (D-N.Y.), Jason Crow (D-Colo.), Brad Schneider (D-Ill.), Brian <span class='selected-term'>Fitzpatrick</span> (R-Pa.), Darrell Issa (R-Calif.), Barry Moore (R-Ala.), Danny Davis (D-Ill.) and André Carson (D-Ind.",
    "author": "",
    "title": "POLITICO Playbook: Scoop: RNC down to two 2024 convention finalists"
  },
  {
    "id": 1236,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "Among the bipartisan signatories are: Reps. Lloyd Doggett, D-Texas; Zoe Lofgren, D-Calif.; Brian <span class='selected-term'>Fitzpatrick</span>, R-Pa.; Andy Harris, R-Md.",
    "author": "Eric Mack",
    "title": "Lawmakers Call on Biden to Cut Red Tape on Ukraine Refugees"
  },
  {
    "id": 650,
    "mediaId": 3986,
    "date": "2022-04-13",
    "sentence": "The new sanctions list also excluded Foreign Affairs Committee Chairman Gregory Meeks (D-NY), House Intelligence Committee Chair Adam Schiff (D-CA), House Judiciary Chair Jerry Nadler (D-NY), Reps. Michael McCaul (R-TX), Christopher Smith (R-NJ), Joe Wilson (R-SC), Adam Kinzinger (R-IL), Brian <span class='selected-term'>Fitzpatrick</span> (R-PA) and Andy Barr (R-KY).",
    "author": "Ryan Morgan",
    "title": "Russia sanctions 398 members of Congress"
  }
]