[
  {
    "id": 6324,
    "mediaId": 2637,
    "date": "2022-02-06",
    "sentence": "Andrew Putnam, who entered Sunday tied atop the leaderboard with Hoge and Hossler, only managed a 1-over 73 to tie for sixth at 14 under with Joel Dahmen (72) and England’s Matt <span class='selected-term'>Fitzpatrick</span> (68).",
    "author": "",
    "title": "Tom Hoge emerges from pack at Pebble Beach for first PGA Tour win"
  },
  {
    "id": 4659,
    "mediaId": 2644,
    "date": "2022-02-16",
    "sentence": "Outright winner\nPatrick Cantlay (11/1): Full disclosure: I was all prepared to list Matt <span class='selected-term'>Fitzpatrick</span> as my favorite outright this week until I saw his odds (33/1) — and I wasn’t prepared for him to have a shorter number than the likes of Jordan Spieth and Sam Burns (both 40/1).",
    "author": "Jason Sobel",
    "title": "Genesis Open perfect spot for Patrick Cantlay to win again"
  },
  {
    "id": 2329,
    "mediaId": 2551,
    "date": "2022-03-22",
    "sentence": "+4\nView gallery\nEnglishman Ian Poulter (above) has work to do if he is to make it to this year’s Masters\nWith only one player from each group progressing to the weekend knockout stages, Poulter has to get past American Scottie Scheffler, twice a winner this year, and two of his Ryder Cup comrades in Tommy Fleetwood and Matt <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Derek Lawrenson for the Daily Mail",
    "title": "Ian Poulter is praying for one more match play miracle to qualify for his 17th Masters next month... with the Englishman needing to jump 17 places in the world rankings into the top 50"
  },
  {
    "id": 2269,
    "mediaId": 2518,
    "date": "2022-03-23",
    "sentence": "Over the next three days, he plays European members Ian Poulter, Tommy Fleetwood and Matt <span class='selected-term'>Fitzpatrick</span>.",
    "author": "The Associated Press",
    "title": "Match Play format feels like a Sunday"
  },
  {
    "id": 1338,
    "mediaId": 4045,
    "date": "2022-04-05",
    "sentence": "",
    "author": "The Associated Press",
    "title": "Masters Tee Times"
  },
  {
    "id": 1442,
    "mediaId": 2523,
    "date": "2022-04-05",
    "sentence": "ET: Matthew <span class='selected-term'>Fitzpatrick</span>, Brooks Koepka, Rory McIlroy\nWoods confirmed during his press conference Tuesday he's planning to play \"as of right now,\" which would be his first official appearance since November 2020, and said he's teeing it up with the intent of being in contention:\nThe Masters\nTiger Woods believes he can win a sixth Green Jacket this week.",
    "author": "Tim Daniels",
    "title": "Masters 2022 Tee Times and Pairings for Augusta National Golf Club Announced"
  },
  {
    "id": 1715,
    "mediaId": 4045,
    "date": "2022-04-06",
    "sentence": "",
    "author": "AP",
    "title": "The Masters at a glance"
  },
  {
    "id": 1102,
    "mediaId": 2732,
    "date": "2022-04-06",
    "sentence": "Key tee times: Tiger Woods, Louis Oosthuizen, Joaquin Niemann, 10:34 a.m.; Rory McIlroy, Matt <span class='selected-term'>Fitzpatrick</span>, Brooks Koepka, 2:03 p.m.; Hideki Matsuyama, Justin Thomas, James Piot, 10:45 a.m.\nTelevision: Thursday-Friday, 3-7:30 p.m. (ESPN); Saturday, 3-7 p.m. (CBS); Sunday, 2-7 p.m. (CBS).",
    "author": "Associated Press",
    "title": "The Masters at a glance"
  },
  {
    "id": 1024,
    "mediaId": 2570,
    "date": "2022-04-06",
    "sentence": "You can find the full list of participants and Thursday's pairings at Augusta National below:\nThe Masters 2022 Field, Tee Times and Pairings\nTee Time (ET) Group\n7:40 a.m. Jack Nicklaus, Gary Player, Tom Watson (Honorary Starters)\n8 a.m. Jose Maria Olazabal, J.J. Spaun\n8:11 a.m. Mike Weir, Padraig Harriington, Austin Greaser\n8:22 a.m. Larry Mize, Sepp Straka, Franceso Molinari\n8:33 a.m. Fred Couples, Garrick Higgo, Guido Migliozzi\n8:44 a.m. Vijay Singh, Ryan Palmer, Kyoung-hoon Lee\n8:55 a.m. Min Woo Lee, Hudson Swafford, Cameron Young\n9:06 a.m. Stewart Cink, Brian Harman, Harry Higgs\n9:17 a.m. Zach Johnson, Si Woo Kim, Aaron Jarvis\n9:39 a.m. Luke List, Matthew Wolff, Mackenzie Hughes\n9:50 a.m. Danny Willett, Jason Kokrak, Talor Gooch\n10:01 a.m. Max Homa, Kevin Na, Shane Lowry\n10:12 a.m. Kevin Kisner, Daniel Berger, Tommy Fleetwood\n10:23 a.m. Bryson DeChambeau, Cameron Smith, Paul Casey\n10:34 a.m. Tiger Woods, Louis Oosthuizen, Joaquin Niemann\n10:45 a.m. Hideki Matsuyama, Justin Thomas, James Piot\n10:56 a.m. Adam Schott, Scottie Scheffler, Tony Finau\n11:18 a.m. Sandy Lyle, Stewart Hagestad\n11:29 a.m. Lucas Glover, Erik Van Rooyen, Cameron Champ\n11:40 a.m. Bernhard Langer, Christiaan Bezuidenhout, Cameron Davis\n11:51 a.m. Charl Schwartzel, Robert MacIntyre, Laird Shepherd\n12:02 p.m. Gary Woodland, Justin Rose, Takumi Kanaya\n12:13 p.m. Lee Westwood, Russell Henley, Corey Conners\n12:24 p.m. Patrick Reed, Seamus Power, Lucas Herbert\n12:35 p.m. Bubba Watson, Tom Hoge, Keita Nakajima\n12:57 p.m. Marc Leishman, Webb Simpson, Sungjae Im\n1:08 p.m. Sergio Garcia, Thomas Pieters, Harold Varner III\n1:19 p.m. Abraham Ancer, Tyrrell Hatton, Sam Burns\n1:30 p.m. Dustin Johnson, Billy Horschel, Collin Morikawa\n1:41 p.m. Will Zalatoris, Patrick Cantlay, Jon Rahm\n1:52 p.m. Jordan Spieth, Viktor Hovland, Xander Schauffele\n2:03 p.m. Matthew <span class='selected-term'>Fitzpatrick</span>, Brooks Koepka, Rory McIlroy",
    "author": "Alex Kay",
    "title": "The Masters 2022: Schedule, Tee Times, Golf Odds For Tiger Woods And The Field At Augusta National"
  },
  {
    "id": 926,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Jamie Braidwood",
    "title": "Masters 2022 LIVE: Leaderboard and scores as Scottie Scheffler takes five-shot lead and Tiger Woods makes cut"
  },
  {
    "id": 1618,
    "mediaId": 4045,
    "date": "2022-04-08",
    "sentence": "",
    "author": "The Associated Press",
    "title": "Masters Tee Times"
  }
]