[
  {
    "id": 957,
    "mediaId": 2594,
    "date": "2022-04-05",
    "sentence": "Here are the tee times for round one in full:\n(All times BST)\n1pm – Jose Maria Olazabal, J.J. Spaun\n1.11pm – Mike Weir, Padraig Harrington, Austin Greaser (a)\n1:22pm – Larry Mize, Sepp Straka, Francesco Molinari\n1.33pm – Fred Couples, Garrick Higgo, Guido Migliozzi\n1.44pm – Vjay Singh, Ryan Palmer, Kyoung-hoon Lee\n1.55pm – Min Woo Lee, Hudson Swafford, Cameron Young\n2.06pm – Stewart Cink, Brian Harman, Harry Higgs\n2.17pm – Zach Johnson, Si Woo Kim, Aaron Jarvis (a)\n2.39pm – Luke List, Matthew Wolf, Mackenzie Hughes\n2.50pm – Danny Willett, Jason Kokrak, Talor Gooch\n3.01pm – Max Homa, Kevin Na, Shane Lowry\n3.12pm – Kevin Kisner, Daniel Berger and Tommy Fleetwood\n3.23pm – Bryson DeChambeau, Cameron Smith, Paul Casey\n3.34pm – Tiger Woods, Louis Oosthuizen, Joaquin Niemann\n3.45pm – Hideki Matsuyama, Justin Thomas, James Piot (a)\n3.56pm – Adam Scott, Scottie Scheffler, Tony Finau\n4.18pm – Sandy Lyle, Stewart Hagestad (a)\n4.29pm – Lucas Glover, Erik Van Rooyen, Cameron Champ\n4.40pm – Bernhard Langer, Christiaan Bezuidenhout, Cameron Davis\n4.51pm – Charl Schwartzel, Robert MacIntyre, Laird Shepard (a)\n5.02pm – Gary Woodland, Justin Rose, Takumi Kanaya\n5.13pm – Lee Westwood, Russell Henley, Corey Conners\n5.24pm – Patrick Reed, Seamus Power, Lucas Herbert\n5.35pm – Bubba Watson, Tom Hoge, Keita Nakajima (a)\n5.57pm – Marc Leishman, Webb Simpson, Sungjae Im\n6.08pm– Sergio Garcia, Thomas Pieters, Harold Varner III\n6.19pm – Abraham Ancer, Tyrrell Hatton, Sam Burns\n6.30pm – Dustin Johnson, Billy Horschel, Collin Morikawa\n6.41 p.m – Will Zalatoris, Patrick Cantlay, Jon Rahm\n6.52pm – Jordan Spieth, Viktor Hovland, Xander Schauffele\n7.03pm – Matthew <span class='selected-term'>Fitzpatrick</span>, Brooks Koepka, Rory McIlroy",
    "author": "Tom Kershaw",
    "title": "Masters 2022 tee times: Full schedule for Day 1 at Augusta including Tiger Woods and Rory McIlroy"
  },
  {
    "id": 1088,
    "mediaId": 2592,
    "date": "2022-04-06",
    "sentence": "ET Thursday when Rory McIlroy, Brooks Koepka and Matt <span class='selected-term'>Fitzpatrick</span> close out the first round.",
    "author": "Anthony Riccobono",
    "title": "Masters 2022 Tee Times, TV Schedule: How To Watch Tiger Woods, Major Golf Tournament"
  },
  {
    "id": 1282,
    "mediaId": 6656,
    "date": "2022-04-07",
    "sentence": "The final group, which features Matthew <span class='selected-term'>Fitzpatrick</span>, Brooks Koepka and Rory McIlroy, will tee off at 2:33 p.m. Thursday at Augusta.",
    "author": "Alex Butler",
    "title": "Golf legends Nicklaus, Player, Watson tee off delayed 2022 Masters"
  }
]