[
  {
    "id": 6324,
    "mediaId": 2637,
    "date": "2022-02-06",
    "sentence": "Andrew Putnam, who entered Sunday tied atop the leaderboard with Hoge and Hossler, only managed a 1-over 73 to tie for sixth at 14 under with Joel Dahmen (72) and England’s Matt <span class='selected-term'>Fitzpatrick</span> (68).",
    "author": "",
    "title": "Tom Hoge emerges from pack at Pebble Beach for first PGA Tour win"
  },
  {
    "id": 4119,
    "mediaId": 2551,
    "date": "2022-03-06",
    "sentence": "It was a day for the streetfighters, therefore, so no surprise to see Graeme McDowell shoot 69 to move up 23 places to stand alongside McIlroy, while Matt <span class='selected-term'>Fitzpatrick</span> shot 70 to be inside the top ten.",
    "author": "Derek Lawrenson Golf Correspondent At Bay Hill",
    "title": "DEREK LAWRENSON AT BAY HILL: It has been the year of the underdog at the PGA Tour this season with Talor Gooch and Billy Horschel leading the way, and Rory McIlroy, Viktor Hovland and Brit Tyrrell Hatton struggling to deliver"
  },
  {
    "id": 2828,
    "mediaId": 2606,
    "date": "2022-03-08",
    "sentence": "It feels like it’s not going to be too much for him to overcome to get a win based on the way he’s been playing.”\nMatthew <span class='selected-term'>Fitzpatrick</span>, 39-1\n“He’s running fantastic.",
    "author": "",
    "title": "Jon Rahm among best bets for PGA Tour’s Players Championship"
  },
  {
    "id": 3200,
    "mediaId": 2523,
    "date": "2022-03-12",
    "sentence": "The same goes for Matthew <span class='selected-term'>Fitzpatrick</span>, as a near-automatic putt became a challenge in the wind:\nThe elements didn't appear to cause Zach Johnson to accidentally hit the ball on a practice swing, proving that pro golfers are human after all:\nAs far as the leaderboard goes, no one currently in the top 10 (or ties) sits in the top 20 of the Official World Golf Rankings.",
    "author": "Paul Kasabian",
    "title": "Players Championship 2022: Fleetwood, Hoge Lead as Inclement Weather Suspends Round 2"
  },
  {
    "id": 2908,
    "mediaId": 2679,
    "date": "2022-03-15",
    "sentence": "… Wake Forest senior Alex <span class='selected-term'>Fitzpatrick</span>, the younger brother of Matt Fitzpatrick, is in the field.",
    "author": "The Associated Press",
    "title": "Strong field assembled for Tampa as Masters gets closer"
  },
  {
    "id": 2549,
    "mediaId": 2523,
    "date": "2022-03-20",
    "sentence": "Matt <span class='selected-term'>Fitzpatrick</span> (-14)\nT5.",
    "author": "Rob Goldberg",
    "title": "Valspar Championship 2022: Sam Burns Edges Davis Riley After 2-Hole Playoff"
  },
  {
    "id": 2382,
    "mediaId": 2637,
    "date": "2022-03-20",
    "sentence": "England’s Matthew <span class='selected-term'>Fitzpatrick</span> and American Brian Harman tied for fifth at 14 under.",
    "author": "",
    "title": "Sam Burns drains dramatic birdie to defend Valspar title in playoff"
  },
  {
    "id": 2226,
    "mediaId": 2594,
    "date": "2022-03-25",
    "sentence": "In a repeat of last year’s final, Horschel will face Scottie Scheffler in the last 16 after the latter twice got the better of Matt <span class='selected-term'>Fitzpatrick</span>, firstly winning their group five contest 5 and 4 to force a play-off and then making a birdie on the sixth extra hole to advance.",
    "author": "Phil Casey",
    "title": "Seamus Power books Masters debut despite defeat in final group game in Austin"
  },
  {
    "id": 2300,
    "mediaId": 2937,
    "date": "2022-03-27",
    "sentence": "Like I told him after, enjoy the hell out of how well you’re playing, man.”\nAs easy as Scheffler seemed to make it look on Sunday, he wouldn’t have made it to the weekend had he not won a six-hole playoff over Matthew <span class='selected-term'>Fitzpatrick</span> to escape the group stage.",
    "author": "Jon McCarthy",
    "title": "PGA TOUR: Scottie Scheffler wins match play, is new World No. 1 ... Third-place for Corey Conners ... Tiger sighting"
  },
  {
    "id": 1282,
    "mediaId": 6656,
    "date": "2022-04-07",
    "sentence": "The final group, which features Matthew <span class='selected-term'>Fitzpatrick</span>, Brooks Koepka and Rory McIlroy, will tee off at 2:33 p.m. Thursday at Augusta.",
    "author": "Alex Butler",
    "title": "Golf legends Nicklaus, Player, Watson tee off delayed 2022 Masters"
  },
  {
    "id": 255,
    "mediaId": 2540,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Ben Morse",
    "title": "Scottie Scheffler wins 2022 Masters, the first major of his career, following dominant performance"
  }
]