[
  {
    "id": 6658,
    "mediaId": 2732,
    "date": "2022-01-21",
    "sentence": "The Steelers’ biggest assets are a few superstar performers on defense: edge rusher T.J. Watt, defensive end Cameron Heyward and safety Minkah <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Mark Madden",
    "title": "Mark Madden: Steelers are underinvested at 3 most important positions"
  },
  {
    "id": 6974,
    "mediaId": 2732,
    "date": "2022-01-21",
    "sentence": "• Rudolph 11/4\n• Derek Carr (Las Vegas) 7/1\n• Jimmy Garoppolo (San Francisco) 15/2\n• Jameis Winston (New Orleans) 9/1\n• Kenny Pickett (Pitt) 9/1\n• Haskins 10/1\nA pair of other veterans, Kirk Cousins and Ryan <span class='selected-term'>Fitzpatrick</span>, are next at 11/1.",
    "author": "Tim Benz",
    "title": "Tim Benz: Mike Tomlin says 'all options are on the table' for a new quarterback. Let's hope he means it"
  },
  {
    "id": 6962,
    "mediaId": 2523,
    "date": "2022-01-27",
    "sentence": "Here's a look at some of the available signal-callers:\nFree Agency: Cam Newton, Ryan <span class='selected-term'>Fitzpatrick</span>, Andy Dalton, Jameis Winston, Teddy Bridgewater, Marcus Mariota, Mitchell Trubisky, Tyrod Taylor\n2022 NFL Draft: Kenny Pickett (Pittsburgh), Matt Corral (Ole Miss), Malik Willis (Liberty), Desmond Ridder (Cincinnati), Sam Howell (UNC)\nGiven those options, it's fair to wonder whether the Steelers could become heavily involved in the Aaron Rodgers sweepstakes if he's traded or released by the Green Bay Packers.",
    "author": "Tim Daniels",
    "title": "Steelers' Top QB Options in 2022 Free Agency, NFL Draft as Ben Roethlisberger Retires"
  },
  {
    "id": 6823,
    "mediaId": 2586,
    "date": "2022-01-27",
    "sentence": "In fact, the next oldest active quarterbacks after the 44-year-old Brady is 39-year-old Ryan <span class='selected-term'>Fitzpatrick</span> and 38-year-old Aaron Rodgers.",
    "author": "DJ Siddiqi",
    "title": "Tom Brady’s Witty Response to Ben Roethlisberger’s Retirement"
  },
  {
    "id": 6565,
    "mediaId": 2732,
    "date": "2022-01-30",
    "sentence": "Though he’s still playing a secondary role behind stars such as Watt, Heyward and safety Minkah <span class='selected-term'>Fitzpatrick</span>, his spot on the Steelers’ defense has potential to become longterm.",
    "author": "Chris Adamski",
    "title": "Alex Highsmith vows continued improvement for Steelers in ‘22"
  },
  {
    "id": 6997,
    "mediaId": 2732,
    "date": "2022-01-31",
    "sentence": "“He stepped up, really, every single week,” Steelers veteran safety Minkah <span class='selected-term'>Fitzpatrick</span> said.",
    "author": "Chris Adamski",
    "title": "Tre Norwood builds off one of best rookie seasons ever for a Steelers’ 7th-round pick"
  },
  {
    "id": 6771,
    "mediaId": 2586,
    "date": "2022-02-01",
    "sentence": "However, Schobert currently stands as the team’s fifth-highest paid player behind T.J. Watt, Cameron Heyward, Stephon Tuitt and Minkah <span class='selected-term'>Fitzpatrick</span>.",
    "author": "DJ Siddiqi",
    "title": "Steelers ‘Must Consider Cutting’ Ex-Pro Bowl Linebacker"
  },
  {
    "id": 5677,
    "mediaId": 2732,
    "date": "2022-02-05",
    "sentence": "The Steelers gave Miami their first-round pick for 2020 to acquire <span class='selected-term'>Fitzpatrick</span> after Week 2 of the 2019 season.",
    "author": "Mark Madden",
    "title": "Mark Madden's Hot Take: Instead of trading for Minkah Fitzpatrick, Steelers should have tanked in '19"
  },
  {
    "id": 5910,
    "mediaId": 2644,
    "date": "2022-02-06",
    "sentence": "“TA, he’s a great coach,” Minkah <span class='selected-term'>Fitzpatrick</span> told reporters in January.",
    "author": "Ethan Sears",
    "title": "Steelers promoting Teryl Austin to defensive coordinator after Giants interview"
  },
  {
    "id": 6015,
    "mediaId": 2732,
    "date": "2022-02-09",
    "sentence": "“He loves the game,” said free safety Minkah <span class='selected-term'>Fitzpatrick</span>, who made All-Pro in his first two seasons under Austin’s tutelage.",
    "author": "Joe Rutter",
    "title": "Steelers officially promote Teryl Austin to defensive coordinator"
  },
  {
    "id": 4796,
    "mediaId": 2586,
    "date": "2022-02-23",
    "sentence": "“[<span class='selected-term'>Fitzpatrick</span>] was asked to essentially abandon his instincts and move to a strong safety role that, in the Dolphins’ scheme, was really more of a quasi-linebacker, mashing into a pile of 300-pound linemen,” Dunne wrote.",
    "author": "Allison Koehler",
    "title": "2 Reasons Why the Brian Flores Hire Could Spell Disaster for Steelers"
  },
  {
    "id": 4748,
    "mediaId": 2707,
    "date": "2022-02-23",
    "sentence": "The move also reunites Flores with Steelers safety Minkah <span class='selected-term'>Fitzpatrick</span>, whose career has taken off in Pittsburgh since being traded from the Dolphins during Flores’ first year in Miami.",
    "author": "Tribune News Service",
    "title": "Former Dolphins coach Brian Flores finds next landing spot"
  },
  {
    "id": 4102,
    "mediaId": 2523,
    "date": "2022-03-01",
    "sentence": "With 2021 Defensive Player of the Year T.J. Watt, two-time All-Pro safety Minkah <span class='selected-term'>Fitzpatrick</span> and three-time All-Pro tackle Cameron Heyward, new coordinator Teryl Austin has cornerstone playmakers.",
    "author": "Maurice Moton",
    "title": "How Both Drafting and Trading for QBs Can Save the Future of the Steelers"
  },
  {
    "id": 3895,
    "mediaId": 2732,
    "date": "2022-03-04",
    "sentence": "“On defense, we have a monster group, I feel like you got the Defensive Player of the Year (T.J. Watt), you got Minkah <span class='selected-term'>Fitzpatrick</span>, you have myself, Stephon Tuitt, Tyson Alualu, combine that all together, that is winning success, you just got to have a quarterback.”\nHeyward’s brother, Connor, is a draft-eligible fullback/tight end prospect out of Michigan State.",
    "author": "Tim Benz",
    "title": "First Call: Antonio Brown's latest music venture; an offensive lineman that seems to have the Steelers' interest before draft"
  },
  {
    "id": 3987,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Especially since this is the same city that justified the Minkah <span class='selected-term'>Fitzpatrick</span> trade by saying Fitzpatrick “counted” as a No.",
    "author": "Tim Benz",
    "title": "Tim Benz: I'm skeptical of the Aaron Rodgers story, too. But the Steelers should be doing what was reported"
  },
  {
    "id": 3467,
    "mediaId": 6570,
    "date": "2022-03-08",
    "sentence": "If the Steelers cannot come to terms with <span class='selected-term'>Fitzpatrick</span> this summer they can tag him next year at this time and could potentially save around $3 million all while controlling his rights through the 2023 season after which another long-term deal could be discussed.",
    "author": "Ray Fittipaldo",
    "title": "What the 2022 franchise tag numbers mean for Steelers' negotiations with Minkah Fitzpatrick"
  },
  {
    "id": 3162,
    "mediaId": 2523,
    "date": "2022-03-09",
    "sentence": "At 25, he has a chance to partner Minkah <span class='selected-term'>Fitzpatrick</span> for years to come at safety, a position that is valued more in the AFC North with so many dynamic playmakers in Baltimore, Cleveland and Cincinnati.",
    "author": "Joe Tansey",
    "title": "Steelers' Top Players to Prioritize in 2022 NFL Free Agency"
  },
  {
    "id": 2936,
    "mediaId": 2586,
    "date": "2022-03-11",
    "sentence": "He is best-suited as a strong safety in a defense that plays a lot of single-high coverage,” he concludes, which in fact describes the Steelers, as All-Pro Minkah <span class='selected-term'>Fitzpatrick</span> frequently plays the single-high role.",
    "author": "Jason Zasky",
    "title": "Steelers Rumors: Tampa Bay Bucs Safety is Plan B if Terrell Edmunds Exits"
  },
  {
    "id": 3106,
    "mediaId": 2586,
    "date": "2022-03-12",
    "sentence": "“He’s started to build a <span class='selected-term'>Fitzpatrick</span>-like resume also with some Bills history,” explains Iyer.",
    "author": "DJ Siddiqi",
    "title": "Steelers Projected to Land Ex-Pro Bowl QB in Free Agency"
  },
  {
    "id": 3000,
    "mediaId": 2523,
    "date": "2022-03-13",
    "sentence": "T.J. Watt ($31.1 million), Cameron Heyward ($17.4 million), Stephon Tuitt ($14 million) and Minkah <span class='selected-term'>Fitzpatrick</span> ($10.6 million) are all key contributors on a defense that carries this roster.",
    "author": "Alex Ballentine",
    "title": "Steelers' Last-Minute Guide to 2022 NFL Free Agency"
  },
  {
    "id": 3061,
    "mediaId": 2586,
    "date": "2022-03-14",
    "sentence": "Several names, including Marcus Mariota and Ryan <span class='selected-term'>Fitzpatrick</span>, have been floated in recent weeks as possible replacements for Trubisky.",
    "author": "Emily Bicks",
    "title": "Ex-Bills QB Mitch Trubisky Sends Message After Signing With Steelers"
  },
  {
    "id": 3056,
    "mediaId": 2586,
    "date": "2022-03-15",
    "sentence": "Trubisky’s contract is in the mix with backups Case Keenum (Cleveland Browns), Jordan Love (Green Bay Packers), free agent Ryan <span class='selected-term'>Fitzpatrick</span>, and rookie contracts for Patriots’ Mac Jones and Ravens’ Lamar Jackson.",
    "author": "Allison Koehler",
    "title": "Steelers Acquisition of Ex-Bears, Bills QB Mitch Trubisky Draws Mixed Twitter Reactions"
  },
  {
    "id": 3048,
    "mediaId": 2586,
    "date": "2022-03-16",
    "sentence": "According to Spotrac, <span class='selected-term'>Fitzpatrick</span>’s market valuation is four years, $61.073 million, or an average salary of $15.268 million.",
    "author": "Allison Koehler",
    "title": "Ex-Steeler Suggests Pittsburgh Is Pursuing 3-Time All-Pro Defender"
  },
  {
    "id": 2870,
    "mediaId": 2586,
    "date": "2022-03-18",
    "sentence": "Names such as Marcus Mariota and Ryan <span class='selected-term'>Fitzpatrick</span> have been linked to the Bills as possible replacements, but no movement has been made to lock anyone in.",
    "author": "Emily Bicks",
    "title": "Ex-Bills QB Hints He’s Returning to Buffalo With Viral Tweet & IG Post"
  },
  {
    "id": 1940,
    "mediaId": 2586,
    "date": "2022-03-20",
    "sentence": "",
    "author": "Nathan Dougherty",
    "title": "Details Emerge on Team-Friendly Deal for New Bills Quarterback"
  },
  {
    "id": 2361,
    "mediaId": 2586,
    "date": "2022-03-23",
    "sentence": "According to ESPN’s Jeremy Fowler, the Steelers are interested in signing a top-tier safety to pair alongside incumbent starter Minkah <span class='selected-term'>Fitzpatrick</span>.",
    "author": "DJ Siddiqi",
    "title": "Steelers Interested in Signing 3-Time Pro Bowler: Report"
  },
  {
    "id": 2111,
    "mediaId": 2732,
    "date": "2022-03-24",
    "sentence": "Getting another potential starting safety alongside Minkah <span class='selected-term'>Fitzpatrick</span> would be nice so the Steelers can pay attention to other areas of need in the draft such as wide receiver, tackle, defensive line, inside linebacker and cornerback.",
    "author": "Tim Benz",
    "title": "First Call: 1 team may have stoked the price on Chuks Okorafor; Steelers attend another quarterback's pro day"
  },
  {
    "id": 2097,
    "mediaId": 2732,
    "date": "2022-03-25",
    "sentence": "Tanking the 2019 season after Roethlisberger got hurt instead of trading the next draft’s first-round pick for safety Minkah <span class='selected-term'>Fitzpatrick</span> to stupidly salvage .500 might have brought Justin Herbert to Pittsburgh, which would see the problem long since solved.",
    "author": "Mark Madden",
    "title": "Mark Madden: Steelers would be better served drafting a quarterback in 2023"
  },
  {
    "id": 2676,
    "mediaId": 2598,
    "date": "2022-03-29",
    "sentence": "Steelers Are Out Of The Race\nThe Steelers were rumored to be in the race for him but with Minka <span class='selected-term'>Fitzpatrick</span> due for a big extension, that won't be possible anymore:\n“Despite wishful thinking on the part of the public, they are not in financial position to sign Tyrann Mathieu because of the large extension they are prepared to give free safety Minkah Fitzpatrick, according to sources,” reported Gerry Dulac of the Pittsburgh Post-Gazette.",
    "author": "",
    "title": "NFL Rumors: Chiefs' Tyrann Mathieu In No Rush To Make Free Agency Decision"
  },
  {
    "id": 2022,
    "mediaId": 2732,
    "date": "2022-03-31",
    "sentence": "Terrell Edmunds wasn’t kept as the strong safety next to Minkah <span class='selected-term'>Fitzpatrick</span>, although he could be a cheaper option to return if the Steelers decide to avoid bringing Mathieu on board.",
    "author": "Tim Benz",
    "title": "First Call: Tyrann Mathieu says he got a call from Mike Tomlin; multiple theories on Bruce Arians' latest 'retirement'"
  },
  {
    "id": 1648,
    "mediaId": 2700,
    "date": "2022-03-31",
    "sentence": "But in Bowles’ defense, he started out 10-6 with Ryan <span class='selected-term'>Fitzpatrick</span> as his starting quarterback in 2015.",
    "author": "Tribune News Service",
    "title": "Omar Kelly: Todd Bowles needs to succeed with Buccaneers to create favorable change"
  },
  {
    "id": 1290,
    "mediaId": 2732,
    "date": "2022-04-01",
    "sentence": "And they aren’t counting on Karl Joseph to be the other safety next to Minkah <span class='selected-term'>Fitzpatrick</span>, are they?",
    "author": "Tim Benz",
    "title": "Tim Benz: Mike Tomlin's embrace of quarterback hype has many purposes"
  },
  {
    "id": 1377,
    "mediaId": 2586,
    "date": "2022-04-05",
    "sentence": "“The Steelers are still leaning on their defense to win now, and Mathieu next to Minkah <span class='selected-term'>Fitzpatrick</span> would give them one of the league’s rangiest safety pairings.”\nMathieu’s Versatility and Resume is Impressive\nThe 29-year-old Mathieu spent the past three seasons with the Kansas City Chiefs in a versatile role, playing the safety positions while also lining up as a slot cornerback.",
    "author": "DJ Siddiqi",
    "title": "Steelers Considered ‘Landing Spot’ for 3-Time Pro Bowler"
  },
  {
    "id": 1165,
    "mediaId": 2732,
    "date": "2022-04-05",
    "sentence": "• She said a contract extension for Minkah <span class='selected-term'>Fitzpatrick</span> is “very, very close to getting done.” When asked by host Andrew Fillipponi if the contract would make him the highest-paid safety in the league, Kinkhabwala said, “I expect that.”\n• On the prospect of signing ex-Kansas City safety Tyrann Mathieu, she said, “I have been told that ‘Honey Badger’ may not need quite as much money as I was told he needed a week ago.” Kinkhabwala went on to say that Mathieu believes “the idea of playing for Mike Tomlin is very enticing” and that “perhaps the monetary hopes and demands aren’t quite what they once were.”\n• Regarding current Steelers free agent safety Terrell Edmunds, Kinkhabwala says there is “still an offer on the table” for him.",
    "author": "Tim Benz",
    "title": "First Call: Multiple storylines emerge about Steelers safety position while 1 draft pick trade could impact team"
  },
  {
    "id": 1523,
    "mediaId": 6570,
    "date": "2022-04-06",
    "sentence": "The Steelers intend on changing that during the offseason, likely toward the start of training camp, when they give <span class='selected-term'>Fitzpatrick</span>, 26, a T.J. Watt-like contract that will make him one of the highest-paid players at his position.",
    "author": "",
    "title": "Gerry Dulac: Steelers want to give Minkah Fitzpatrick a big payday, but talks haven't started yet"
  },
  {
    "id": 435,
    "mediaId": 2586,
    "date": "2022-04-14",
    "sentence": "Mathieu — who is well known for his playmaking ability, having forced 13 interceptions over the past three seasons — and Steelers free safety Minkah <span class='selected-term'>Fitzpatrick</span> would form arguably the top playmaking safety duo in the league.",
    "author": "DJ Siddiqi",
    "title": "Steelers ‘Have an Interest’ in Signing Playmaking Safety"
  },
  {
    "id": 643,
    "mediaId": 2586,
    "date": "2022-04-17",
    "sentence": "#Steelers #steelersnation @steelers pic.twitter.com/5nhMVXD4i7\n— Papi (@SnakeDraftViper) March 29, 2022\nIt’s not clear what the future holds for <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Nathan Dougherty",
    "title": "Popular Former Bills QB Could Be Roethlisberger’s Replacement: Insider"
  },
  {
    "id": 567,
    "mediaId": 2586,
    "date": "2022-04-18",
    "sentence": "McCarron, Ryan <span class='selected-term'>Fitzpatrick</span> and Josh Rosen.",
    "author": "Jason Zasky",
    "title": "Former Top 10 QB Makes ‘Most Sense’ as Veteran Addition: Steelers Insider"
  },
  {
    "id": 548,
    "mediaId": 2586,
    "date": "2022-04-21",
    "sentence": "Sports analyst Andrew Fillipponi said the Pittsburgh Steelers could now add a veteran to the room and he suggested Ryan <span class='selected-term'>Fitzpatrick</span>, “I’d take a shot.”\nSo the Steelers could now sign a veteran free agent QB to fill-out their quarterback depth chart.",
    "author": "Paul A. Esden Jr.",
    "title": "Former Jets Starting QB Could Be Joining AFC Powerhouse, Says Analyst"
  },
  {
    "id": 660,
    "mediaId": 2859,
    "date": "2022-04-21",
    "sentence": "This was real progress for a struggling franchise, but days later <span class='selected-term'>Fitzpatrick</span> was told that rookie Tua Tagovailoa would be the starter so the team could evaluate their No.",
    "author": "Doug Robinson",
    "title": "Browns can’t win when they try, so why would they try to lose?"
  }
]