[
  {
    "id": 6437,
    "mediaId": 2526,
    "date": "2022-01-20",
    "sentence": "In addition to Ranking Member Turner, Reps. Turner, Wenstrup, Crawford, Stewart, Stefanik, Mullin, Kelly, LaHood, and <span class='selected-term'>Fitzpatrick</span> signed the pointed letter.",
    "author": "Hannah Bleau",
    "title": "House Intel Republicans Blast Adam Schiff: We Will ‘Not Comply’ with Your Testing Requirements"
  },
  {
    "id": 6403,
    "mediaId": 2512,
    "date": "2022-01-21",
    "sentence": "They'd reportedly hoped the dirt would be a way to convince Toomey <span class='selected-term'>Fitzpatrick</span> to support Trump's baseless claims of voter fraud which suggested that President Joe Biden's election win was illegitimate.",
    "author": "Meaghan Ellis",
    "title": "Michael Flynn's allies allegedly plotted to uncover dirt on GOP lawmakers who refused to back Trump's voter fraud claims"
  },
  {
    "id": 6375,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "The suit alleges “the Democratic-backed map redrawing the boundaries of New Mexico’s three congressional districts for the next decade intentionally chops up Republican voting strongholds.”\n— Rhode Island Republicans claim the state’s redistricting commission violated the Open Meetings Act three dozen times, the Boston Globe’s Edward <span class='selected-term'>Fitzpatrick</span> reported.",
    "author": "",
    "title": "GOP Senate spending tops $15M in PA"
  },
  {
    "id": 6799,
    "mediaId": 2641,
    "date": "2022-01-24",
    "sentence": "There are 25 House Democrats and two Republicans — Gaetz and Rep. Brian <span class='selected-term'>Fitzpatrick</span>, R-Pa. — signing on to ban stock trading in Congress.",
    "author": "Eric Mack",
    "title": "Rep. Matt Gaetz to Newsmax: Congress Trading Stocks 'Swampy, Icky'"
  },
  {
    "id": 6859,
    "mediaId": 2732,
    "date": "2022-01-24",
    "sentence": "And Republicans like suburban Philadelphia’s U.S. Rep. Brian <span class='selected-term'>Fitzpatrick</span> won districts carried by Joe Biden.",
    "author": "Christopher Borick",
    "title": "Christopher Borick: A Pa. Republican Wave — if the party can ride it"
  },
  {
    "id": 6573,
    "mediaId": 2550,
    "date": "2022-01-25",
    "sentence": "The ad hoc chairman of a watchdog group called International Coalition of Consumer Advocates, Robert <span class='selected-term'>Fitzpatrick</span>, has called the purveyors of MLMs the “Pyramid Lobby.” They not only target and almost exclusively donate to Republicans, MLMs are a large part of the conservative infrastructure.",
    "author": "",
    "title": "lies with help from the GOP and Sinema"
  },
  {
    "id": 4625,
    "mediaId": 4045,
    "date": "2022-02-22",
    "sentence": "State Treasurer Scott <span class='selected-term'>Fitzpatrick</span> and state Rep. David Gregory, R-Sunset Hills, are both competing for the GOP nomination for state auditor.",
    "author": "Kurt Erickson",
    "title": "Missouri Republicans trade jabs as race for U.S. Senate kicks off"
  },
  {
    "id": 4555,
    "mediaId": 2572,
    "date": "2022-02-22",
    "sentence": "Glenn Youngkin and Attorney General Jason Miyares to Arkansas Senate candidate Sarah Huckabee Sanders and House Problem Solvers Caucus Co-Chair Brian <span class='selected-term'>Fitzpatrick</span>, R-Pa.",
    "author": "Tyler Olson",
    "title": "Pompeo endorses former State Department spokesperson Ortagus in Tennessee House race"
  },
  {
    "id": 4215,
    "mediaId": 2671,
    "date": "2022-03-01",
    "sentence": "Then, on Monday night, the centrist group No Labels announced that “immediately following” the speech, it would host “an unprecedented bipartisan perspective” panel featuring Democratic Rep. Josh Gottheimer of New Jersey and Republican Rep. Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, the two co-chairs of the bipartisan Problem Solvers Caucus in Congress.",
    "author": "The Right Scoop",
    "title": "THREE Democrats will be responding to Joe Biden’s SOTU address"
  },
  {
    "id": 4255,
    "mediaId": 2619,
    "date": "2022-03-01",
    "sentence": "In addition, moderate Democratic Rep. Josh Gottheimer of New Jersey had been due to give his “perspective” immediately following the State of the Union, as he participated in an event hosted by the “No Labels,” a nonpartisan group whose stated goal is to “break the gridlock and dysfunction.”\nRepublican Rep. Brian <span class='selected-term'>Fitzpatrick</span> of Pennsyvlania also had been scheduled to take part in the No Labels event.",
    "author": "Victor Reklaitis",
    "title": "‘Biden and his party have sent us back,’ says Republican after State of the Union, as Democrats also respond to speech"
  },
  {
    "id": 3887,
    "mediaId": 2883,
    "date": "2022-03-01",
    "sentence": "The leader of the pack in rebuffing his party was GOP Rep. Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, one of an ever-dwindling number of members representing a perennially competitive district.",
    "author": "Niels Lesniewski\nRyan Kelly",
    "title": "Party unity vote studies underscore polarized State of the Union"
  },
  {
    "id": 3707,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "Several members were wearing scarves in either of the two colors on Ukraine’s flag, while others carried miniature flags reportedly being handed out by Rep. Brian <span class='selected-term'>Fitzpatrick</span> (R-Pa.), a co-chair of the congressional Ukraine and Ukrainian American Caucus.",
    "author": "",
    "title": "Lawmakers wear blue and yellow to State of the Union in nod to Ukraine"
  },
  {
    "id": 3952,
    "mediaId": 2512,
    "date": "2022-03-04",
    "sentence": "You don’t want to have to talk about anything political.”\nAccording to Kathy Foulkrod, a friend told her, “I just came to tell you I had to take my Biden sign down because I was too afraid.”\nThe Democrats Politico interviewed in Clearfield County, Cadelago reports, “say party leaders need to come to terms with just how calamitous the dropoff of rural support has been.”\nCadelago writes, “The fundamental question the party needs to answer — one that gnaws at everyone from the Foulkrods and <span class='selected-term'>Fitzpatrick</span> to Biden’s advisers in Washington — is: how far can they expect to get with people who refuse even to listen?”",
    "author": "Alex Henderson",
    "title": "These pro-Biden Democrats find themselves surrounded by ‘coarse’ MAGA Republicans in small rural towns"
  },
  {
    "id": 2750,
    "mediaId": 2572,
    "date": "2022-03-16",
    "sentence": "FIRST ON FOX NEWS: REPUBLICAN NATIONAL COMMITTEE SHATTERS FUNDRAISING RECORDS IN FEBRUARY\nThe RJC is also endorsing Republican Reps. David Schweikert of Arizona (AZ-01), David Valadao of California (CA-22), Andy Harris of Maryland (MD-01), Peter Meijer of Michigan (MI-03), Don Bacon of Nebraska (NE-02), Yvette Herrell of New Mexico (NM-02), Nicole Malliotakis of New York (NY-11), Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania (PA-01) and Nancy Mace of South Carolina (SC-01).",
    "author": "Paul Steinhauser",
    "title": "Sen. Ron Johnson tops list of Republicans endorsed by top Jewish GOP organization"
  },
  {
    "id": 3374,
    "mediaId": 2748,
    "date": "2022-03-17",
    "sentence": "On Wednesday’s broadcast of the Fox News Channel’s “Fox & Friends,” Rep. Brian <span class='selected-term'>Fitzpatrick</span> (R-PA) argued that it doesn’t make sense for the Biden administration to argue that Ukraine doesn’t need MiGs from Poland while also arguing that the MiGs would be provocative.",
    "author": "Blarp Blog",
    "title": "GOP Rep. Fitzpatrick: Biden Arguing MiGs Are Both Ineffective and Provocative Doesn’t Make Sense"
  },
  {
    "id": 1055,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "Rep. Brian <span class='selected-term'>Fitzpatrick</span> (R-Pa.) received $5,800 from Baskin, the most of any individual lawmaker.",
    "author": "Callie Patteson",
    "title": "Carole Baskin donated over $31K to GOP, Dem lawmakers in 2021"
  },
  {
    "id": 946,
    "mediaId": 2572,
    "date": "2022-04-09",
    "sentence": "The Republicans on the bipartisan House legislation are Reps. Tony Gonzales of Texas, August Pfluger of Texas, Brian <span class='selected-term'>Fitzpatrick</span> of Pennsylvania, Don Bacon of Nebraska and Maria Elvira Salazar of Florida.",
    "author": "Marisa Schultz",
    "title": "Dem Rep. Cuellar joins bipartisan effort to block Biden's rollback of Title 42, opposes bussing migrants to DC"
  },
  {
    "id": 305,
    "mediaId": 2696,
    "date": "2022-04-21",
    "sentence": "",
    "author": "David Epstein",
    "title": "R.I. bill would impose fines and double the taxes of those who refuse COVID-19 vaccine"
  }
]