[
  {
    "id": 4926,
    "mediaId": 2523,
    "date": "2022-02-23",
    "sentence": "Eight different quarterbacks have started games during this stretch, including last year's mix of Taylor Heinicke, Garrett Gilbert and Ryan <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Rob Goldberg",
    "title": "Terry McLaurin's New Contract with Commanders Not 'Imminent,' WAS Wants to Keep WR"
  },
  {
    "id": 4041,
    "mediaId": 2644,
    "date": "2022-03-03",
    "sentence": "Despite signing veteran journeyman Ryan <span class='selected-term'>Fitzpatrick</span> in March 2021, the quarterback was placed on injured reserve after suffering a hip subluxation in Week 1.",
    "author": "Jaclyn Hendricks",
    "title": "Commanders calling every team about a quarterback leaves some confused"
  },
  {
    "id": 4071,
    "mediaId": 2644,
    "date": "2022-03-05",
    "sentence": "Taylor Heinicke was 7-8 as Washington’s starter last season, when the initial plan to go with Ryan <span class='selected-term'>Fitzpatrick</span> backfired when the veteran suffered a season-ending injury in Week 1.",
    "author": "Ryan Dunleavy",
    "title": "Seahawks set bar for Russell Wilson trade after declining Commanders’ hefty offer"
  },
  {
    "id": 2961,
    "mediaId": 2586,
    "date": "2022-03-07",
    "sentence": "The Bills don’t have a ton of cap space, but they also know how important it is to have a backup quarterback who can win games if the hit-taking Allen suffers an injury.”\nAs for what’s in it for for the former seventh-round pick from the 2005 NFL Draft, “To make an extra $3 million, possibly without needing to play, and to go to a Super Bowl contender in a place that he loves, that’s a hard offer for <span class='selected-term'>Fitzpatrick</span> to pass up.”\nFor Allen, Fitzpatrick Is the Best ‘Chemistry-Building QB Available in Free Agency’\nRyan Fitzpatrick #14 of the Washington Football Team takes the field during training camp at the Bon Secours Washington Football Team training center park on July 29, 2021 in Richmond, Virginia.",
    "author": "Emily Bicks",
    "title": "Bills Urged to Sign Commanders QB: ‘Makes Almost Too Much Sense’"
  },
  {
    "id": 3255,
    "mediaId": 2706,
    "date": "2022-03-09",
    "sentence": "Ryan <span class='selected-term'>Fitzpatrick</span> began last season as the team's starter, with Taylor Heinicke taking over after the veteran was sidelined by a hip injury.",
    "author": "Michael Middlehurst-Schwartz",
    "title": "Washington Commanders to acquire QB Carson Wentz from Indianapolis Colts in trade"
  },
  {
    "id": 2924,
    "mediaId": 2746,
    "date": "2022-03-13",
    "sentence": "There are other moves that Washington could make to clear more space — restructuring Ereck Flowers’ $10 million contact, for example — but at the very least, Washington looks it’ll work around the margins rather than make a big splash like the team did a year ago when it signed quarterback Ryan <span class='selected-term'>Fitzpatrick</span>, cornerback William Jackson and wide receiver Curtis Samuel in the opening days of free agency.",
    "author": "Matthew Paras",
    "title": "Commanders free agency preview: McKissic a hot commodity with cap space tight"
  },
  {
    "id": 2918,
    "mediaId": 2746,
    "date": "2022-03-14",
    "sentence": "Last year, the Commanders were ultimately aggressive by signing Ryan <span class='selected-term'>Fitzpatrick</span>, William Jackson III and Curtis Samuel — but only Fitzpatrick’s deal came together on the first day.",
    "author": "Matthew Paras",
    "title": "Commanders quiet as Jaguars kick off free agency spending spree"
  },
  {
    "id": 3582,
    "mediaId": 6535,
    "date": "2022-03-16",
    "sentence": "While some of his predecessors at the position like Ryan <span class='selected-term'>Fitzpatrick</span> and Alex Smith were more charismatic and more established, respectively, Wentz confidently handled his debut at the podium.",
    "author": "Peter Hailey",
    "title": "A Pivotal Partnership Between Carson Wentz and Ron Rivera Officially Begins"
  }
]