[
  {
    "id": 6884,
    "mediaId": 2745,
    "date": "2022-01-25",
    "sentence": "That did indeed occur over the weekend, but <span class='selected-term'>Fitzpatrick</span>’s boisterous reaction was to a victory by the Buffalo Bills over the visiting New England Patriots.",
    "author": "",
    "title": "A shirtless Ryan Fitzpatrick was roaring for the Bills during playoff win over Patriots"
  },
  {
    "id": 6972,
    "mediaId": 2523,
    "date": "2022-01-31",
    "sentence": "The inability to trade for Stafford and <span class='selected-term'>Fitzpatrick</span>'s injury left Heinicke under center, and he responded by completing 65 percent of his passes for 3,419 yards, 20 touchdowns and 15 interceptions as someone who could make big plays but also struggled with consistency and turnovers.",
    "author": "Scott Polacek",
    "title": "NFL Rumors: WFT Preparing to Take 'Big Swing' at a QB During Offseason"
  },
  {
    "id": 5748,
    "mediaId": 2746,
    "date": "2022-02-06",
    "sentence": "Still, the broken-down talks ended up being a deflating moment for Washington, which settled for journeyman Ryan <span class='selected-term'>Fitzpatrick</span> before turning to Taylor Heinicke for most of the season once the former got hurt in Week 1.",
    "author": "Matthew Paras",
    "title": "Rams-Bengals a ‘What if?’ bowl for Commanders"
  },
  {
    "id": 6123,
    "mediaId": 2523,
    "date": "2022-02-09",
    "sentence": "There's likely to be at least one team that talks itself into taking a signal-caller in the top 10, but it would be surprising to see any of them be a huge upgrade over Taylor Heinicke or Ryan <span class='selected-term'>Fitzpatrick</span> in Year 1.",
    "author": "Alex Ballentine",
    "title": "Raiders' Top Hypothetical Trade Packages for Derek Carr"
  },
  {
    "id": 5131,
    "mediaId": 2523,
    "date": "2022-02-14",
    "sentence": "Ryan <span class='selected-term'>Fitzpatrick</span>, 39, of the Washington Commanders is the oldest quarterback in the league since Ben Roethlisberger retired.",
    "author": "",
    "title": "NFL Stats: Who's the oldest active NFL player in 2022?"
  },
  {
    "id": 4785,
    "mediaId": 2586,
    "date": "2022-02-23",
    "sentence": "As has been the case for years, <span class='selected-term'>Fitzpatrick</span> works best as a one-season rental, either as a top backup or emergency starter.”\nWhy Fitzpatrick Is a ‘Logical’ Option for Bucs\nFitzpatrick missed essentially the entire 2021 season after signing with Washington last offseason.",
    "author": "DJ Siddiqi",
    "title": "Buccaneers Considered ‘Logical’ Fit for 17-Year Veteran QB"
  },
  {
    "id": 4926,
    "mediaId": 2523,
    "date": "2022-02-23",
    "sentence": "Eight different quarterbacks have started games during this stretch, including last year's mix of Taylor Heinicke, Garrett Gilbert and Ryan <span class='selected-term'>Fitzpatrick</span>.",
    "author": "Rob Goldberg",
    "title": "Terry McLaurin's New Contract with Commanders Not 'Imminent,' WAS Wants to Keep WR"
  },
  {
    "id": 4041,
    "mediaId": 2644,
    "date": "2022-03-03",
    "sentence": "Despite signing veteran journeyman Ryan <span class='selected-term'>Fitzpatrick</span> in March 2021, the quarterback was placed on injured reserve after suffering a hip subluxation in Week 1.",
    "author": "Jaclyn Hendricks",
    "title": "Commanders calling every team about a quarterback leaves some confused"
  },
  {
    "id": 3880,
    "mediaId": 2732,
    "date": "2022-03-04",
    "sentence": "Washington, Carolina and Denver are still looking for quarterbacks after 2021 decisions flopped because of injuries (<span class='selected-term'>Fitzpatrick</span>’s hip in Washington) or ineffectiveness (Sam Darnold with the Panthers, Bridgewater in Denver).",
    "author": "Associated Press",
    "title": "Trade talk overshadows marginal class of QBs in free agency"
  },
  {
    "id": 4071,
    "mediaId": 2644,
    "date": "2022-03-05",
    "sentence": "Taylor Heinicke was 7-8 as Washington’s starter last season, when the initial plan to go with Ryan <span class='selected-term'>Fitzpatrick</span> backfired when the veteran suffered a season-ending injury in Week 1.",
    "author": "Ryan Dunleavy",
    "title": "Seahawks set bar for Russell Wilson trade after declining Commanders’ hefty offer"
  },
  {
    "id": 2961,
    "mediaId": 2586,
    "date": "2022-03-07",
    "sentence": "The Bills don’t have a ton of cap space, but they also know how important it is to have a backup quarterback who can win games if the hit-taking Allen suffers an injury.”\nAs for what’s in it for for the former seventh-round pick from the 2005 NFL Draft, “To make an extra $3 million, possibly without needing to play, and to go to a Super Bowl contender in a place that he loves, that’s a hard offer for <span class='selected-term'>Fitzpatrick</span> to pass up.”\nFor Allen, Fitzpatrick Is the Best ‘Chemistry-Building QB Available in Free Agency’\nRyan Fitzpatrick #14 of the Washington Football Team takes the field during training camp at the Bon Secours Washington Football Team training center park on July 29, 2021 in Richmond, Virginia.",
    "author": "Emily Bicks",
    "title": "Bills Urged to Sign Commanders QB: ‘Makes Almost Too Much Sense’"
  },
  {
    "id": 2812,
    "mediaId": 2572,
    "date": "2022-03-09",
    "sentence": "Ryan <span class='selected-term'>Fitzpatrick</span>, who the team signed at the beginning of the 2021 season, only appeared in one game after going down in Week 1 with an injury and missing the remainder of the season.",
    "author": "Ryan Gaydos",
    "title": "Commanders to acquire Carson Wentz from Colts for draft picks: report"
  },
  {
    "id": 3255,
    "mediaId": 2706,
    "date": "2022-03-09",
    "sentence": "Ryan <span class='selected-term'>Fitzpatrick</span> began last season as the team's starter, with Taylor Heinicke taking over after the veteran was sidelined by a hip injury.",
    "author": "Michael Middlehurst-Schwartz",
    "title": "Washington Commanders to acquire QB Carson Wentz from Indianapolis Colts in trade"
  },
  {
    "id": 3267,
    "mediaId": 6656,
    "date": "2022-03-09",
    "sentence": "Ryan <span class='selected-term'>Fitzpatrick</span>, Kyle Allen and Garrett Gilbert were on the roster last season, but are expected to become free agents.",
    "author": "Alex Butler",
    "title": "Colts to trade QB Carson Wentz to Commanders"
  },
  {
    "id": 3550,
    "mediaId": 2637,
    "date": "2022-03-09",
    "sentence": "Now a division foe of the Eagles, Wentz gives the Commanders a stable starter after a revolving door that has included Alex Smith, first-round pick Dwayne Haskins, Ryan <span class='selected-term'>Fitzpatrick</span> and Taylor Heinicke.",
    "author": "",
    "title": "New Commander: Washington to acquire QB Carson Wentz"
  },
  {
    "id": 3054,
    "mediaId": 2586,
    "date": "2022-03-09",
    "sentence": "Other quarterbacks rumored for consideration by the Bucs include Jimmy Garoppolo, Kirk Cousins, Teddy Bridgewater, Ryan <span class='selected-term'>Fitzpatrick</span>, and Jameis Winston.",
    "author": "Matthew Davis",
    "title": "Buccaneers Encouraged to Sign Retired Quarterback"
  },
  {
    "id": 3131,
    "mediaId": 2523,
    "date": "2022-03-13",
    "sentence": "Notable Free Agents\nG Brandon Scherff\nQB Ryan <span class='selected-term'>Fitzpatrick</span>\nWR Cam Sims\nWR Adam Humphries\nCB Bobby McCain\nLB Jon Bostic\nLT Cornelius Lucas\nTE Ricky Seals-Jones\nRight guard Brandon Scherff is the most notable player Washington has headed to market.",
    "author": "Kristopher Knox",
    "title": "Commanders' Last-Minute Guide to 2022 NFL Free Agency"
  },
  {
    "id": 2924,
    "mediaId": 2746,
    "date": "2022-03-13",
    "sentence": "There are other moves that Washington could make to clear more space — restructuring Ereck Flowers’ $10 million contact, for example — but at the very least, Washington looks it’ll work around the margins rather than make a big splash like the team did a year ago when it signed quarterback Ryan <span class='selected-term'>Fitzpatrick</span>, cornerback William Jackson and wide receiver Curtis Samuel in the opening days of free agency.",
    "author": "Matthew Paras",
    "title": "Commanders free agency preview: McKissic a hot commodity with cap space tight"
  },
  {
    "id": 2918,
    "mediaId": 2746,
    "date": "2022-03-14",
    "sentence": "Last year, the Commanders were ultimately aggressive by signing Ryan <span class='selected-term'>Fitzpatrick</span>, William Jackson III and Curtis Samuel — but only Fitzpatrick’s deal came together on the first day.",
    "author": "Matthew Paras",
    "title": "Commanders quiet as Jaguars kick off free agency spending spree"
  },
  {
    "id": 3059,
    "mediaId": 2746,
    "date": "2022-03-14",
    "sentence": "With Turner, Washington has started six different quarterbacks: Dwayne Haskins, Kyle Allen, Alex Smith, Taylor Heinicke, Ryan <span class='selected-term'>Fitzpatrick</span> and Garrett Gilbert.",
    "author": "Matthew Paras",
    "title": "Commanders give offensive coordinator Scott Turner mutli-year extension"
  },
  {
    "id": 3582,
    "mediaId": 6535,
    "date": "2022-03-16",
    "sentence": "While some of his predecessors at the position like Ryan <span class='selected-term'>Fitzpatrick</span> and Alex Smith were more charismatic and more established, respectively, Wentz confidently handled his debut at the podium.",
    "author": "Peter Hailey",
    "title": "A Pivotal Partnership Between Carson Wentz and Ron Rivera Officially Begins"
  },
  {
    "id": 1553,
    "mediaId": 2586,
    "date": "2022-04-08",
    "sentence": "",
    "author": "Nathan Dougherty",
    "title": "Bills Could Target 3x All-Pro Cornerback Thanks to New Diggs Deal"
  },
  {
    "id": 251,
    "mediaId": 2523,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Erin Walsh",
    "title": "Commanders Rumors: Carson Wentz Viewed as More Than Bridge QB Ahead of 2022 NFL Draft"
  }
]