{
  "id": 10,
  "mediaId": 43,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "The Downballot: Why House Democrats' best defense is a good offense (transcript)",
  "image": "https://images.dailykos.com/images/1045925/story_image/GettyImages-1367048464.jpg?1646669326",
  "link": "https://www.dailykos.com/story/2022/4/21/2093209/-The-Downballot-Why-House-Democrats-best-defense-is-a-good-offense-transcript",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1901,
    3087
  ],
  "sentences": [
    "Co-hosts David Nir and David Beard also investigate Ron DeSantis' turbocharged gerrymander aimed at undermining Black representation; discuss two more Republican Senate primaries where Trump endorsements have made a mess of things; call out a Democrat for running an offensive ad that risks contributing to anti-Asian hatred; and take stock of upcoming elections in France and Australia.",
    "David Beard:\nAt the same time, Le Pen went after Macron for his proposed pension reforms that would raise the retirement age to 65 in France, which has been very unpopular, and which Macron has sort of halfway walked back to talk about compromises and things like that as he realized this was really a problem for his race.",
    "And of course, all of this happened just the week after Trump endorsed Dr. Oz in the Pennsylvania Republican Senate race, to the consternation of many Republicans in Pennsylvania and otherwise who didn't want to see Oz be endorsed because he has some apostasies against a number of conservative positions.",
    "David Nir:\nOne thing I should note is that a state court judge struck down New York's congressional map sort of in a really confusing and messy opinion, partly on the grounds that it was a gerrymander, partly on the grounds of the legislature, which he said didn't have the authority to draw a new map.",
    "And the other issue Schweikert has is that he was reprimanded on the House floor in 2020 for a number of ethical issues, including misusing taxpayer dollars, violating campaign-finance reporting requirements, and several other violations of House rules, which is not something that happens very often.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy House Democrats' best defense is a good offense\nThe Downballot\nFollowShare\n0:0044:11\n15301xApr 21, 2022\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nYes, it's a tough-looking midterm, but Democrats can still go on offense!",
    "One other thing I should mention is that there is also a special election taking place on June 7th for a district that is also numbered California 22, but that is Devin Nunes' old district, the one that he vacated to go run Donald Trump's Truth Social media company into the ground.",
    "David Nir:\nSo we thought it would be a good idea if we dug deeper into each of these 10 contests to understand why we think that these Republican seats are vulnerable and why grassroots donors should consider giving their hard-earned money to help Democrats in these contests.",
    "Of course, in New York, there are additional parties such as the Conservative Party and others that share candidates so they can essentially co-endorse, which can be beneficial to certain candidates to have both, in this case, the GOP and the Conservative Party endorsement.",
    "You could certainly imagine middle-of-the-road voters who are not crazy about Trump, who might want to reward Meijer or who would vote for Meijer, but would otherwise vote for Scholten if maybe Gibbs won, but I think the race will definitely be very competitive either way.",
    "Hate crimes against Asian Americans didn't spike because Donald Trump exhorted goon squads to terrorize individual people, they spiked because people like Trump sought to demonize China as a way to deflect blame for their atrocious handling of the coronavirus pandemic.",
    "That was the issue that came up a lot in the debate that happened just on Wednesday where Macron went after Le Pen for her party's loan from a Russian bank, and really attacked her on her past contacts with Russia and support for Russia before the invasion of Ukraine.",
    "But I want to point to a Washington Post piece by Dave Weigel exploring the ad and some unnamed Democratic operatives pointed out, well, former Governor Ted Strickland, he's a Democrat and when he ran for this same Senate seat in 2016, he relied on similar messages.",
    "David Beard:\nAnd my theory during this whole long stretch of Florida back-and -forth between DeSantis and the legislature is that DeSantis has just been pushing for a maximalist GOP map the whole time and doesn't really care whether or not it gets struck down.",
    "David Beard:\nYeah, I definitely don't see him endorsing Gibbs given his real ability to stand up to the Trump wing and desire to stand up to the Trump wing that you really don't see very often amongst Republicans, even though he's very conservative otherwise.",
    "Of course, this huge GOP impasse that lasted for months and months, benefits Republicans in another way, which is we have seen courts refuse to strike down or adjust unconstitutional or flawed maps because it's supposedly too close to the election to do so.",
    "You would normally dismiss it, but because of the Trump issue, because of the fact that Valadao voted to impeach Trump and a lot of the Republican primary electorate hate that idea, there's a very real possibility that Mathys could advance in November.",
    "They aren't the only possible pickup targets for Democrats, but they are races that we feel, for a variety of reasons, represent a really good use of small-dollar donors efforts, that these are races where you'll get a good bang for the buck.",
    "David Beard:\nAnd the other factor to think about is that the primary isn't until August 2nd, so we still have months to go of Meijer and Gibbs going at each other and causing more Trump chaos in that district before a nominee is selected.",
    "David Beard:\nI guess Hines is the leading candidate, but you could easily imagine him only getting 25% of the vote or something based on Trump's endorsement and all the other candidates getting some number that adds up to their other 75%.",
    "The Downballot takes a deep dive into 10 House districts across the country where Republicans are vulnerable for a variety of reasons, whether due to redistricting, retirements, long-term demographic trends, or plain old GOP infighting.",
    "His goal is to push this so that he can go to GOP activists in Florida and across the country, because he's clearly eyeing the presidency at either 2024 or beyond, and say he did everything he could to get Florida Republicans elected.",
    "Incumbent Prime Minister Scott Morrison is going to attempt to win a fourth consecutive election for the Liberal National Coalition while Anthony Albanese will try to win back power for the Labor Party after a decade in opposition.",
    "David Beard:\nSo it's just really interesting to watch the sort of weird, almost psychological drama as Trump goes around and picks these candidates much to the upset of all these other Republicans who are involved in these races.",
    "If you really want to help Americans who've been harmed by the decline in manufacturing and the outsourcing of jobs, telling them that you're magically going to roll back the clock to a better time is just not the way to do it.",
    "Voting takes place this Sunday, the 24th of April, just two weeks after the first round and President Emmanuel Macron's lead over his challenger Marine Le Pen has expanded a bit in polling since we talked about it last week.",
    "David Beard:\nSo trying to play on Trump's idea that he doesn't want to be a loser by instead saying, \"Well, Vance is going to lose even if you endorse him, so you better endorse me because I'm going to be the winner.\"",
    "Beard and I will also be taking a deep dive into the house playing field and looking in particular at 10 Republican-held districts where Democrats have a chance to go on offense and actually pick up seats this year.",
    "It's really shocking on one level, but on the other hand, the way that we saw the Republican-run Congress bow down before Donald Trump, it's really not all that surprising to see the Florida GOP go totally supine.",
    "They didn't really make it redder if you're looking at the top lines, but they prevented it from getting bluer as it naturally would have by adding rural areas instead of consolidating it around the Omaha area.",
    "And then meanwhile, there'll be a four-way Republican primary between Weld County Commissioner Lori Saine, state Senator Barbara Kirkmeyer, Thornton Mayor Jan Kulmann, and former Army Green Beret Tyler Allcorn.",
    "North Carolina also won a new congressional district in reapportionment, but it's a little bit difficult to say which seat actually counts as the, quote-unquote, new seat because there's also the 14th District.",
    "But that district didn't end up materializing, because if you'll remember the previous version of the North Carolina map that the legislature had passed had a Republican leaning district west of Charlotte.",
    "And we will start in the eastern corner of the country on the eastern tip of Long Island in New York's 1st Congressional District, where we have an open seat because the incumbent is running for governor.",
    "Because the safer endorsement was clearly to just endorse David McCormick, who's the other leading candidate, who's a hedge fund guy, very conservative, liked by a lot of the establishment Republicans.",
    "David Beard:\nSo she had one primary opponent at the convention, but he only received 29% and didn't make the ballot, didn't petition on, which is the alternative way to get on the ballot in Colorado.",
    "In the previous decade, it had been part of the Republican gerrymander that sort of broke down in the Detroit suburbs and Democrats picked up some seats, but it really held up in Western Michigan.",
    "In a two- or three-candidate primary, it would be impossible to fall below the 30% barrier, but in an eight-candidate primary, it is very possible, particularly without really a leading candidate.",
    "David Nir:\nNow out in Colorado, we have a very different situation, one that we haven't directly addressed yet, which is that thanks to population growth, Colorado added a congressional district.",
    "So it's certainly something to watch as the campaign heats up as we go through the end of April and into May to see if the Labor Party can maintain its lead, or if it really becomes a toss up.",
    "David Beard:\nIt's frustrating many Republicans there, particularly the other candidates who have been fighting hard for Trump's endorsement: former state treasurer, Josh Mandel, most notably.",
    "State Senator Tony Vargas is the state establishment Democratic choice, but he's facing a primary challenge from mental health counselor Alicia Shelton, who has been endorsed by EMILY's List.",
    "And the winner of the Democratic primary in each case will receive all the funds, they're held in escrow, the moment that they win the nomination right after their state has the primary.",
    "Democrats were unexpectedly aggressive in many states in gerrymandering the maps in their favor, but there are also retirements and GOP primaries that are creating opportunities as well.",
    "Some court, be it the Florida state court or federal court around the Voting Rights Act, stopped him from pushing this maximalist map, and then he can blame the judges and all of that.",
    "The previous district was Trump +12, which, even though Democrats were able to win it in 2018 like you said, it's going to be really hard to have ever held onto in that configuration.",
    "Now, Biden won this seat by 13% in 2020, but it has some significant turnout issues in the midterms where turnout really drops which can really hurt Democrats, depending on the year.",
    "And even if the map passes the house as is expected and of course DeSantis signs it, those Fair District amendments still lurk and Democrats are absolutely certain to file a lawsuit.",
    "And even Senator Sherrod Brown, who previously endorsed Ryan, declined to defend the ad and said that Ryan should have introduced himself to voters with a biographical spot instead.",
    "He even made sort of a Hail Mary ahead of the endorsement when it became clear that it was happening, releasing a poll claiming that he would win for sure with Trump's endorsement.",
    "He likes not just somebody who's always been in his corner, like somebody like Josh Mandel would be, but somebody who he forced to come to heel and then sycophantically praise him.",
    "Democrats controlled the redistricting process and they made the state's lone Republican-held seatthat's the 2nd District, which is represented by Yvette Herrellconsiderably bluer.",
    "But if he fails to get this map, he can still say he did everything he could, which I think is his main goal, because he's looking out for his future more than anything else.",
    "David Nir:\nDeSantis's map completely shreds the district and turns it from a seat that Biden would've won by a 63-36 margin into a seat Trump would've won by a 57-41 margin.",
    "On the Democratic side state Representative Yadira Caraveo has essentially locked up the nomination because she won the ballot at the state convention with 71% of the vote.",
    "David Nir:\nYeah, California's top-two primary really changes the calculus here because Valadao would have to finish in third place not to wind up on the November ballot.",
    "She however has not raised much money and so she's not seen as maybe the leading candidate despite having the federal experience, having won congressional races before.",
    "And the fact of the matter is other Democrats have won Senate races in many other states throughout the Midwest, including in Ohio as well without sounding like this.",
    "And meanwhile Democrats have former DOJ attorney Hillary Scholten, who ran in 2020 against Meijer in the gerrymandered version of the seat and lost by just about 6%.",
    "Democratic Congressman Tim Ryan is running for Ohio's open Senate seat and he just launched a new ad declaring, \"We've got to take on China and be Americans first.\"",
    "We're also calling out a Democratic candidate for Senate for running an offensive, xenophobic ad, and we are previewing upcoming elections in France and Australia.",
    "And so there's sort of this tension between Trump and his sort of personal favorites and the Republican Party's desire for sort of true conservative candidates.",
    "But I think again, even if Valadao advances to November, Salas is a really great Democratic nominee and has every opportunity to go and win this Biden +13 seat.",
    "David Beard:\nGinger Sykes Torres entered more recently, but has the endorsement of Congressman Ral Grijalva who's sort of the dean of the Democrats in Arizona.",
    "David Beard:\nSo Biden won this new district by 11%, which is a big difference from how the district used to be when Trump won the district by 4% back in 2020.",
    "Florida map maker (and governor) Ron DeSantis\nIf you haven't already, please subscribe to The Downballot on Apple Podcasts or wherever you listen to podcasts.",
    "David Beard:\nValadao had been a congressman, previously lost in 2018 to a Democrat, came back to reclaim his seat in 2020, and is now running for reelection.",
    "So let's move on and talk about a trio of open seats that Republicans are either giving up or are open because they're brand new, thanks to reapportionment.",
    "David Beard:\nSo this district now includes the western part of Albuquerque, which gives it a really good, strong Democratic base that it didn't have before.",
    "David Nir:\nSo they simply said, well, the way we're going to resolve this impasse is to let DeSantis draw the map that he wants and we're going to pass it.",
    "David Nir:\nSo I would much rather spend my time on this show complaining about Republicans, but this time I'm going to register my objection to a Democrat.",
    "David Nir:\nSo even if the state Supreme Court does have a problem with this map, there is a real chance that it's still winds up getting used in November.",
    "And it also helps make sure that whoever the Democratic nominee is in each case winds up with a nice chunk of change the moment they finish their primary.",
    "David Beard:\nAnd the particularly revealing aspect is, is that China isn't even the place where most manufacturing jobs are going overseas at this point.",
    "So to point out one country over the broader situation is clearly wanting to find a villain and blame the villain as opposed to actually solving policy.",
    "David Nir:\nNow, for starters, it is an extreme GOP gerrymander that would create 20 seats carried by Donald Trump compared to just eight for Joe Biden.",
    "And he also, in redistricting, lost sort of a base area for him, which was Simi Valley, which is a pretty conservative area of the Los Angeles region.",
    "David Nir:\nMoving on to another open seat, let's talk about North Carolina's 13th Congressional District, which is in the southern suburbs of Raleigh.",
    "Salas as the main Democratic candidate is expected to advance to November, but Valadao and Mathys will be competing for that other spot on the ballot.",
    "And when we come back, Beard and I are going to be discussing the districts where Democrats have a chance to go on offense this November in the House.",
    "Even if you are going to this as a matter of bare-knuckle politics and tell Asian Americans that their concerns don't matter, Strickland got crushed.",
    "So we're going to start off with a couple of races where two Republicans who voted to impeach Donald Trump last year are facing difficult primaries.",
    "So there's going to be a lot of instances where she's going to have to reintroduce herself to voters, which sort of makes it like a semi-open seat.",
    "And the justices may be more inclined to be favorable toward DeSantis and the GOP particularly because DeSantis himself has appointed some of them.",
    "David Beard:\nTrump's endorsement of him probably would've helped him sort of sail through or would've made him, I think, a pretty strong favorite.",
    "These are generally known as the Fair Districts amendments, and they block lawmakers from drawing maps that unduly favor one party over the other.",
    "Candidates have already filed petitions to get on the ballot, but I suppose there is an outside chance that the map could change in years to come.",
    "So compared to some of the other ones we've talked about a little bit narrower, but still a Biden win, and more than his national average of 4.5.",
    "Now, in fact, Daily Kos just put together a slate of 10 races where we are asking for donations to the eventual Democratic winner of the primary.",
    "David Beard:\nSo now the un-gerrymandered map has a seat based in the Grand Rapids area that Biden would've won by 8% if it had existed in 2020.",
    "He's got some really deep roots in the district and he was pretty widely seen as the top Democratic recruit that was possible for the district.",
    "He previously announced that he was going to be running in other congressional districts closer to where he was from in Western North Carolina.",
    "Now, the professional class was more polite, essentially deflecting these concerns and saying, \"This is an effective message in the Rust Belt.",
    "But legal experts say that the language in the state constitution protecting minority voting rights is actually quite strong and quite clear.",
    "So it's a great way to get involved right now, if you're not sure about which candidate to pick in a primary with multiple Democrats running.",
    "It's not until August 2nd, so Norton has a lot of time to spend that $3 million, hitting Schweikert before the general election comes around.",
    "The primary is May 10th, so it's coming up pretty quickly and we should see which of them advances to the general election to take on Bacon.",
    "The rest of the seats that we're going to talk about all have incumbents seeking reelection and some of them were reconfigured a little bit.",
    "So it's really interesting to see this sort of division between Trump, who has these really idiosyncratic reasons for endorsing candidates.",
    "And so the two of them are going to have to fight it out for the top two primary slot alongside Garcia in the top two primary on June 7th.",
    "He's being challenged from the right by Chris Mathys who's running, again, largely on the fact that Valadao voted to impeach Donald Trump.",
    "But he is facing a primary, as you said, against John Gibbs who is a former Trump administration official that Donald Trump has endorsed.",
    "Meanwhile, on the Republican side, Republicans have unified around Nick LaLota, who is the GOP and Conservative Party-endorsed candidate.",
    "Over a decade ago, Florida voters approved amendments to the state constitution to reform redistricting and crack down on gerrymandering.",
    "We're going to be talking about the absolute mess that Trump is making of a couple more GOP Senate primaries in Ohio and Pennsylvania.",
    "It's the most Republican seat of the ones on this list, but it is an area that's trending Democratic, so we do have that going for us.",
    "DeSantis introduced his map just a few days ago and on Wednesday of this week, the state Senate passed the map on a party-line vote.",
    "The Downballot is a weekly podcast dedicated to the many elections that take place below the presidency from Senate to city council.",
    "But it's his first ad, which featured an even more amped-up version of this offensive anti-China rhetoric, that really has me upset.",
    "Our tour runs from the eastern tip of Long Island in New York all the way to sunny Southern California, with many stops in between.",
    "Apple Podcasts is sort of like the New York Times Best Seller list for podcasts and The Downballot has been shooting up the charts.",
    "David Beard:\nNow, that district was also redistricted, but it took a lot of the Republican-leaning areas that the 1st used to have.",
    "And so in a way it's open because of that, but it's so different that it's really hard to even imagine that as the successor seat.",
    "David Nir:\nThe idea that longtime loyalty to Trump is quite literally trumped by more recent obeisance to Trump is really amazing.",
    "We've talked some about Alabama Senate and Georgia governor, where he's been very involved in endorsing Republicans in primaries.",
    "So you could call the 14th the new one.? You could call the 13th the new one.? Either way, this seat does not have an incumbent.",
    "And so getting an infusion of resources all at once is extremely helpful to allow them to start the general election off strong.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "He narrowly lost a race for Maricopa County supervisor by just about 400 votes in 2020 and so is now running here in this race.",
    "So she's running in the 1st District in 2022 and she's joined by two Suffolk County legislators, Bridget Fleming and Kara Hahn.",
    "There are a lot of Republican seats this year that actually present interesting ripe targets for Democrats to potentially flip.",
    "So the idea that the problem with jobs overseas is China in particular versus American policy or trade policy is just not true.",
    "But it's really hard to imagine Chris Mathys being the right fit for this district, so that would be a big boost to Democrats.",
    "David Beard:\nYeah, it's interesting because this is almost sort of Ted Budd's old seat, but of course he's running for Senate.",
    "So it's sort of all over the place for him, but he has Trump's endorsement, which in an eight-candidate race could be enough.",
    "And as Politico wrote, \"The former president's endorsements have often added more chaos to these already contentious fights.\"",
    "Black voters are the largest proportion of residents of the district, and it's represented by a Black Democrat, Al Lawson.",
    "David Beard:\nThe election will have all 150 seats in the lower House and then 40 of the 76 seats in the Australian Senate.",
    "David Beard:\nAnd then the other major news story is that in Australia, the date for the upcoming general election was set.",
    "This is a seat that actually Democrats managed to win under its old configuration, but now presents a much juicier target.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "You can find a link to our post describing this slate and internal linking to our ActBlue page in the episode description.",
    "It was previously numbered district six, but it has been growing more and more competitive as many suburban regions have.",
    "David Nir:\nSo as I mentioned at the outset, Daily Kos put together a fundraising slate this week for all of these races.",
    "So North Carolina has a runoff only if the winner doesn't receive 30% of the vote, which doesn't usually come into play.",
    "He's not somebody like Valadao or Meijer who has sort of done some things that might appeal to Democrats or incumbents.",
    "So it may be more difficult than your average sort of Republican who tries to moderate himself to win a Biden +12 seat.",
    "And then we'll have a Democratic nominee to go after Herrell for a number of months leading up to the general election.",
    "He has a primary challenge from insurance executive Elijah Norton, who has self-funded nearly $3 million into the race.",
    "So that is a lot of money to come up against you in a primary race, particularly when you've got some new constituents.",
    "This seat has changed numbers, but it's still quite similar geographically to the seat that Valadao already represents.",
    "But you would be doing us a huge favor if you subscribed to us on Apple Podcasts and left us a five-star rating there.",
    "David Nir:\nThey also contain a provision that bars legislators from drawing maps that diminish minority voting power.",
    "David Nir:\nSo this week, we're going to talk about Democratic opportunities to go on offense in the house this year.",
    "So this is really sort of a straight top two expected to go through easily into the primary all the way to November.",
    "And if you haven't already, please like and subscribe to The Downballot and leave us a five-star rating and review.",
    "David Nir:\nFirst up, we're going to be talking about the bizarre situation unfolding with redistricting in Florida.",
    "David Beard:\nOne of the theories even that he endorsed Vance was because Vance used to be an anti-Trump Republican.",
    "He lost by 21 points and not only did he get his ass handed to him, he ran 13 points behind the top of the ticket.",
    "And then we've also got former Phoenix Suns director of membership experience Adam Metzendorf, who's also running.",
    "And so it's definitely still a very competitive seat, just slightly more Democratic than Biden's national margin.",
    "And so Congressman Mike Garcia, the incumbent, is facing a difficult challenge by trying to overcome that margin.",
    "You may recall that Democrats lost a special election in 2020 after the former Congresswoman Katie Hill resigned.",
    "So that's a big change and a really big opening for Democrats, which is probably a big reason that Zeldin bailed.",
    "There is no incumbent and it's a rather competitive seat, but Democrats are very much hoping to pick this one up.",
    "It will be really amusing if DeSantis winds up railing against his own judicial picks as liberal activist judges.",
    "David Nir:\nAnd that is what led to a spike in hatred that really the worst Americans turned into violent action.",
    "So if you're going to argue that this kind of angry demonization works, at least come up with a better example.",
    "It's been the kind of thing you see all too often when members of a minority group call out racism or bigotry.",
    "But after a protracted showdown with DeSantis, Republican lawmakers decided to abdicate their responsibility.",
    "Jobs are going overseas to a ton of different countries in a ton of different sectors for different reasons.",
    "She has a lot of the benefits of incumbency, but a lot of voters are not going to have voted for her before.",
    "David Nir:\nSo there is a realistic chance that the Supreme Court throws out at least this part of the map.",
    "There are two main Democratic candidates, state Senator Wiley Nickel and former state Senator Sam Searcy.",
    "In fact, they held it for a while with former Congressman Brad Ashford, who in fact just died this week.",
    "David Nir:\nSo we have a new map, but it comes from a totally bizarre source, and that is Republican Gov.",
    "Normally in states where the legislature is in charge of redistricting, the legislature draws new maps.",
    "David Beard:\nBut there's another Democrat running, who's also running a strong campaign, Quaye Quartey.",
    "It certainly leans somewhat to the right, but Trump only won it by about three or four points in 2020.",
    "My guess is that Trump simply likes other TV celebrities and Oz has had Trump on his show in the past.",
    "I'm going to take this now to a couple of Senate primaries that Trump has gotten himself involved in.",
    "And to get on the ballot via the state convention in Colorado, you need a minimum of 30% of the vote.",
    "I don't know if he would go actually endorse a Democrat, but maybe Gibbs will win and we'll find out.",
    "And in the decade that California's been using this system, no incumbent has ever finished in third.",
    "He would easily win this primary, but Vance very well would lose even if he got Trump's endorsement.",
    "Now, the most salient feature of DeSantis's map is the demolition of the 5th Congressional District.",
    "Now he's running here, just because it's the open seat in North Carolina that he thinks he can win.",
    "David Beard:\nThe, I think, most notable Republican candidate is Bo Hines who was endorsed by Trump.",
    "David Beard:\nAnother notable candidate is former Congresswoman Renee Ellmers, who is running again.",
    "David Beard:\nShe has one main Democratic challenger; Jay Chen is the leading Democratic candidate.",
    "So if you thought we had a bit of a cluster in Colorado, much more so here over in North Carolina.",
    "David Nir:\nCompletely separate race, completely separate candidates, completely separate district.",
    "There are some new constituents for Schweikert, so that's something for him to be thinking about.",
    "David Beard:\nBiden won this district by 6%, which is around the same margin of the old district.",
    "Le Pen is a far-right candidate, is very concerning, has a been a big fan of Russia in the past.",
    "This is represented by freshman Republican Michelle Steel in the western part of Orange County.",
    "Like we said, this one doesn't have as much change as the California race that we talked about.",
    "If you asked people, what is the number one Democratic recruit for this district, it was Salas.",
    "So he's going to do his best to defend a Biden now plus-11 seat, but it could be a tough road.",
    "It's a pretty competitive primary, and the primary is not until the end of June, on June 28th.",
    "And so we expect that this'll be a primary that goes on for a while and could get very messy.",
    "David Nir:\nAnd they, in fact, might not even wind up being their party's nominee in November.",
    "David Beard:\nSo if Meijer survives as primary that'll probably be somewhat of a tougher race.",
    "It is represented by Republican David Schweikert in the Eastern Phoenix area and its suburbs.",
    "Bacon was first elected in 2016 and he's never won more than 51% of the vote in the district.",
    "And if you want to keep the gavel out of Kevin McCarthy's hands, this is the place to start.",
    "I think it's overwhelmingly likely that we will use the map that Democrats passed this year.",
    "The most important thing to Trump was who was on TV in front of him when he was watching it.",
    "What's going to be different about electing into the Senate versus electing into the House?",
    "In the end, what makes this extra dismaying is that Ryan is selling voters a bill of goods.",
    "Why not go after greedy American corporations who are undermining American workers at home?",
    "David Nir:\nWe're halfway through this list and we are going to head back out to California.",
    "So in the district she ended up running in, it doesn't have a lot of her old constituents.",
    "The Labor Party remains in the lead in polling, but it has narrowed in the past few weeks.",
    "And now we have this very messy thing, but Trump is going to do what Trump does, I think.",
    "David Beard:\nNow, obviously if it's a good-enough Republican year, anything could happen.",
    "And you have to wonder if Meijer loses the primary, would he endorse Scholten over Gibbs?",
    "One of whom is veteran and educator, Jackie Gordon, who ran in the 2nd District in 2020.",
    "It doesn't seem like she's the one who's picking up the establishment endorsements here.",
    "David Nir:\nUsually, that's a time when campaigns have really spent a lot of their money.",
    "So why hasn't he managed to fight back, quote-unquote, against China in that whole time?",
    "Apparently, I saw that Melania Trump is also a big fan of Dr. Oz, so that couldn't hurt.",
    "Ryan's colleague, New York Congresswoman Grace Meng, demanded that he take down the ad.",
    "There's a lot of candidates who you think could win or potentially advance to a runoff.",
    "I saw one remark online saying, \"Well, the ad only mentions China, not Chinese people.",
    "David Nir:\nThe Florida Supreme Court has gotten much more conservative over the years.",
    "But if the primary does go to a runoff, we go all the way to July 26th is the runoff.",
    "So that does give some hope that this will increasingly become better for Democrats.",
    "David Beard:\nSo this is a good opportunity to try to get it, win it as an open seat.",
    "It cracked down on GOP gerrymandering using these amendments in the previous decade.",
    "I think there's no guarantee that either Vance or Oz are going to win their primary.",
    "So I'm going to wrap us up with another international election roundup really quick.",
    "David Nir:\nTo wrap up this segment, we are going to head to the American Southwest.",
    "So that would be another two months of messy Republican primary-ness in this seat.",
    "He is really gone after a very much hard-right voting record, very close to Trump.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "And just to clarify, the Liberal National Coalition is the center-right coalition.",
    "I'm Tim Ryan and I approve this message.?\nDavid Nir:\nAsian Americans were furious.",
    "David Beard:\nYes, it's a narrower, closer seat than the one we just talked about.",
    "And the first one we want to talk about is Michigan's 3rd Congressional District.",
    "They have every reason to expect a difficult time at the ballot box in November.",
    "But for a whole host of reasons, the best defense may in fact be a good offense.",
    "So it's going to be a really tough seat, but it is in a growing Democratic area.",
    "Why don't you kick us off down in Florida where we've got a new map to consider?",
    "And instead of taking them on, Washington is wasting our time on stupid fights.",
    "Vance, which is a few weeks to go until the May 3rd Republican primary in Ohio.",
    "It is quite Democratic-leaning, and it is home to a plurality of black voters.",
    "And that's compared to just a 15-12 advantage for Trump under the current map.",
    "One is Christy Smith who lost in 2020, both in the special and in the general.",
    "And then on the Republican side, Dave Schweikert is the incumbent Republican.",
    "And as you said, a slightly changed seat in the Central Valley for this year.",
    "This is something you always have to watch out for in a redistricting cycle.",
    "And then we have also got Dr. Darshan Patel running on the Democratic side.",
    "David Nir:\nSo just a little bit to the south is California's 45th District.",
    "David Nir:\nWe're going to shift to a totally different part of the country.",
    "And we're first going to talk about Arizona's First Congressional District.",
    "David Nir:\nBut it's how the map goes about doing this that is so troubling.",
    "This is a seat in north Florida that runs from Jacksonville to Tallahassee.",
    "We'll start off in France where the presidential runoff is already upon us.",
    "And of course the Labor Party is the major center-left party in Australia.",
    "David Nir:\nSo there is one other pro-impeachment Republican on this list.",
    "The probably leading candidate is Las Cruces City Councilor Gabe Vasquez.",
    "And everyone is beholden to that, particularly with the Republican Party.",
    "David Beard:\nSo it should be a really competitive, a really good target.",
    "I want to point out that Valadao currently represents the 21st District.",
    "David Beard:\nAnd as you said, Valadao may not be on the November ballot.",
    "But anyway, in this new seat, Biden won it by 2% had it existed in 2020.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Republicans engaged in a defensive gerrymander to try to protect Bacon.",
    "Garcia does have a very conservative voting record, given the district.",
    "Just pop open the Apple Podcasts app on your phone or on your desktop.",
    "David Beard:\nSo hopefully that means he'll comfortably win on Sunday.",
    "And this is also looking like another plausible target for Democrats.",
    "If you're not familiar with them, they allow you to donate right now.",
    "The Downballot comes out every Thursday everywhere you find podcasts.",
    "That's a much bluer seat that Democrats are almost a lock to pick up.",
    "And these aren't necessarily the top 10 pickup targets for Democrats.",
    "And so obviously that makes it a very good opportunity for a pickup.",
    "David Beard:\nSo it'll take a while to sort of see how that develops.",
    "David Nir:\nHillary Clinton didn't deploy this same kind of rhetoric.",
    "We will be revisiting it as soon as there is anything to report on.",
    "So it would be extra remarkable, but I really wouldn't rule it out.",
    "Now, I know we've talked about constantly, 2022 as a midterm year.",
    "He's on the Mount San Antonio Community College board of trustees.",
    "David Beard:\nAnd that's the thing that I want to mention as well.",
    "The only one to do it in that way, but has not raised much money.",
    "So she'll be the only Democratic candidate on the primary ballot.",
    "David Beard:\nLet's go ahead and get started with our weekly hits.",
    "Mathys unsuccessfully ran for office in New Mexico back in 2018.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Thanks also to our producer Cara Zelaya and editor Tim Einenkel.",
    "So it's certainly something we could see come back here in 2022.",
    "David Nir:\nLet's wrap up in the state next door in New Mexico.",
    "David Nir:\nAnd I'm David Nir, political director of Daily Kos.",
    "So we'll see how Trump reacts if they fail to come out on top.",
    "So he's somebody who was sort of forced to come down to Trump.",
    "David Nir:\nA lot of folks simply refuse to take it seriously.",
    "I'm David Beard, contributing editor for Daily Kos Elections.",
    "David Beard:\nSo a bit of a mess again on the Republican side.",
    "David Beard:\nHe's a veteran and a local official in the area.",
    "So the district has three Democrats running in the primary.",
    "So all of the candidates will appear on the ballot in June.",
    "So if Mathys wins, he's a really bad fit for this district.",
    "That could raise an interesting question after August 2nd.",
    "David Beard:\nSo Rudy Salas is the Democratic front runner.",
    "And number eight is of course open because it's brand new.",
    "A little bit more than his national margin, but not a lot.",
    "So that certainly played a big factor in this endorsement.",
    "Australia has elections every three years for their House.",
    "Trump now has a number of Senate candidates he's endorsed.",
    "So definitely keep an eye on the litigation over this map.",
    "So late last week, Trump endorsed venture capitalist J.D.",
    "It's now around 10% as things seem to have settled a bit.",
    "California's 27th District in the northern suburbs of LA.",
    "David Beard:\nAnd so otherwise it's really a free-for-all.",
    "The Democratic candidates: There's a few candidates here.",
    "David Nir:\nAnd Scholten there has the primary to herself.",
    "This is a seat held by freshman Republican Peter Meijer.",
    "You can reach us by email at thedownballot@dailykos.com.",
    "David Beard:\nBiden won this seat by 12% in its new form.",
    "Again, this is another seat where the numbering changed.",
    "David Beard:\nI think that was definitely a major factor.",
    "That's obviously, I think, the broadly preferred thing.",
    "But Steel only represents 16% of this redrawn district.",
    "David Nir:\nOne key reason, of course, is redistricting.",
    "And things have changed a lot because of redistricting.",
    "And he has been in and out of office a couple of times.",
    "David Beard:\nSo at one point he was going to run there.",
    "California of course has their top-two primary system.",
    "And the Democrats have a couple of candidates running.",
    "This is a seat that Democrats have targeted for years.",
    "And Biden won the seat by only 1% in his current form.",
    "So do you think that's why he picked him in that race?",
    "Type in The Downballot and you'll find us right there.",
    "Reprimands on the House floor are not a common thing.",
    "So that's some real oomph behind her candidacy there.",
    "This is a district that used to be numbered the 25th.",
    "And in 2020, he's mostly been self-funding this year.",
    "So it was very narrow, less than his national margin.",
    "At one point, he was going to run in the Triad area.",
    "David Beard:\nAnd his 2020 race was very competitive.",
    "This issue came up a lot and he really narrowly won.",
    "David Beard:\nHe's not seen as the true conservative.",
    "America could never be dependent on communist shine.",
    "David Beard:\nSo Biden would've won this seat by 5%.",
    "That's David Valadao in California's 22nd District.",
    "Saine is the one who qualified via the convention.",
    "Jevin Hodge is a businessman and community leader.",
    "Donate $5\nDonate $25\nDonate $15\n\nDonate $5 monthly",
    "Smack in the middle is Nebraska's Second District.",
    "Though I think the story of Oz is a bit different.",
    "And so the fact that Oz is another TV personality.",
    "And of course, Florida is a perennial swing state.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Asian American advocacy groups demanded likewise.",
    "The reaction in many quarters has been dismaying.",
    "And now they are once again trying to reclaim it.",
    "These are a very interesting fundraising vehicle.",
    "David Beard:\nPeter Meijer is the incumbent there.",
    "It is a district that's no longer gerrymandered.",
    "He was who people wanted to run against Valadao.",
    "We need to build things in Ohio by Ohio workers.",
    "He claimed that he was voting for Evan McMullin.",
    "And that's one of the reasons he endorsed Vance.",
    "David Nir:\nI think that's exactly right though.",
    "We've talked about it the past couple of weeks.",
    "So if anybody can be Valadao in 2022, it's him.",
    "The other three all petitioned onto the ballot.",
    "That ruling was stayed by the appellate courts.",
    "So just a little bit above his national margin.",
    "And again, we've got a very late primary here.",
    "David Nir:\nHe's been in Congress for 20 years.",
    "Very, very likely to elect a white Republican.",
    "He would absolutely do that if it came to it.",
    "China is out-manufacturing us left and right.",
    "This is what it takes for a Democrat to win.\"",
    "David Beard:\nLet's dive into today's episode.",
    "There were a lot of changes in Orange County.",
    "And then there's eight Republican candidates.",
    "So it's a little bit of an oddball candidate.",
    "Meijer, of course, could be a tough opponent.",
    "It's not what liberal means here in America.",
    "So this map gives the GOP a huge advantage.",
    "And he's got two Democrats challenging him.",
    "So it's very possible we see a runoff here.",
    "We'll be back next week with a new episode.",
    "David Beard:\nThat's all from us this week.",
    "He once labeled himself a never-Trump guy.",
    "And then if he gets this map, then great.",
    "David Nir:\nThat's it for our weekly hits.",
    "So all of his races have been very close.",
    "He's not from anywhere near the district.",
    "So it's a much more safe Republican seat.",
    "It had seven seats and now it has eight.",
    "Biden would've only won this seat by 6%.",
    "We've got a couple of Democrats running.",
    "But of course you can't put it past him.",
    "But he can go and talk to the activists.",
    "And the theory is that Trump likes that.",
    "They're well on their way to doing that.",
    "And the map itself is a total travesty.",
    "What are we going to be covering today?",
    "Of course, it becomes a white district.",
    "Tim Ryan:\nChina, It's definitely China.",
    "David Beard:\nHe has a couple of issues.",
    "As you said, he voted to impeach Trump.",
    "She has been raising pretty good money.",
    "This is in California's Central Valley.",
    "I would think he might just sit it out.",
    "He's a former college football player.",
    "So it's a very, very competitive seat.",
    "This is a short blurb about Daily Kos.",
    "This is held by Republican Don Bacon.",
    "And he's done some good fundraising.",
    "We are using ActBlue nominee funds.",
    "They just happen to share a number.",
    "We are going to take a short break.",
    "Some of them very well may not win.",
    "Daily Kos' House fundraising slate.",
    "We have a special request for you.",
    "Democrats control the White House.",
    "But it's still a competitive seat.",
    "The general was very, very close.",
    "But the new district is Biden +6.",
    "He's a five-term Assembly member.",
    "So those are the three Democrats.",
    "They knew each other from before.",
    "We'll have the results next week.",
    "Don't get confused with liberal.",
    "It is time for us to fight back.",
    "That's not how incitement works.",
    "So it's very open at this point.",
    "So that's coming up pretty soon.",
    "She lost by less than 400 votes.",
    "So that's coming up fairly soon.",
    "He's been in there a long time.",
    "Or maybe just sit the race out?",
    "So what's going on here, Beard?",
    "And we're going to play it now.",
    "And we'll see how it turns out.",
    "That's just absolutely massive.",
    "That's, I think, his main goal.",
    "David Beard:\nHello and welcome.",
    "David Nir:\nHere's the problem.",
    "So that's coming up on Sunday.",
    "It's in the Grand Rapids area.",
    "Some were reconfigured a lot.",
    "It's going to be on May 21st.",
    "That's a swing of 43 points.",
    "You can do that very easily.",
    "It's not obviously the same.",
    "Called Trump reprehensible.",
    "He had now-deleted tweets.",
    "He pushed it to the brink.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "The primary is June 7th.",
    "The primary is May 17th.",
    "Rhetoric really matters.",
    "It's time to fight back.",
    "So what's the problem?\"",
    "Daily Kos is different.",
    "We need to fight back.",
    "It is us versus China.",
    "David Beard:\nOh, yeah.",
    "We saw that for years.",
    "David Beard:\nExactly.",
    "It's like a win-win.",
    "A lot of candidates.",
    "David Beard:\nGreat.",
    "Let's get started.",
    "David Beard:\nYeah.",
    "He's a Reservist.",
    "David Nir:\nRight.",
    "One word, China.",
    "Left and right.",
    "Please read it.",
    "Stay with us.",
    "Ron DeSantis.",
    "He loves TV."
  ]
}