{
  "id": 14,
  "mediaId": 43,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "When it comes to protecting the House, the best defense is a good offense",
  "image": "https://images.dailykos.com/images/1043710/story_image/AP22061117824276.jpg?1646194103",
  "link": "https://www.dailykos.com/story/2022/4/19/2090472/-When-it-comes-to-protecting-the-House-the-best-defense-is-a-good-offense",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1901
  ],
  "sentences": [
    "Here's our complete target list:\nDistrict\nIncumbent\nLocation\nAZ-01\nDavid Schweikert\nEastern Phoenix and suburbs\nCA-22\nDavid Valadao\nSouthern Central Valley\nCA-27\nMike Garcia\nNorthern Los Angeles suburbs\nCA-45\nMichelle Steel\nWestern Orange County\nCO-08\nOPEN\nNorthern Denver suburbs\nNC-13\nOPEN\nSouthern Raleigh suburbs\nNE-02\nDon Bacon\nOmaha area\nNY-01\nOPEN\nEastern Long Island\nMI-03\nPeter Meijer\nGrand Rapids area\nNM-02\nYvette Herrell\nSouthern New Mexico\nIf we can win across this battleground, then we can vastly improve our odds of holding our House majority and ensuring that President Biden gets at least two more years to enact his agenda.",
    "Thanks to Republican retirements, the continued defection of suburban voters from the GOP, and unexpected Democratic successes in redistricting, there's a whole host of districts where Democrats can go on offense and flip seats from red to blue.",
    "The money collected is then given in one fell swoop to the Democratic nominee in each racegiving them, if we do our part, a huge injection of resources just as they start their general election campaigns to beat their Republican opponents.",
    "These races not only give us the chance to stick it to the GOP, they offer us greater bang for the buck, since challengers invariably don't have access to the kinds of resources that incumbents do.",
    "Primaries are still underway in these districts, but fortunately, our partners at ActBlue have made it possible for us to get involved right now via their nominee funds.",
    "These are all seats where Republicans are on defense, and they're also districts that, under the new lines, Joe Biden would have carried in 2020.",
    "These are the sorts of opportunities Daily Kos has always prioritized, and which you've always responded to with such enthusiasm.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Don't let Lauren Boebert and Marjorie Taylor Greene join the House majority\nSometimes, the best defense is a good offense.",
    "Republicans need to flip just five seats to take control, and we're defending a lot of vulnerable members.",
    "Please donate $1 now to each of these 10 races where Democrats can flip Republican seats from red to blue!",
    "We've identified 10 different races where our people-powered donations can make the most difference.",
    "Democrats are heading into a difficult midterm defending a very narrow majority in the U.S. House.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "These funds hold all donations in escrow until each state holds its primary.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Can you give $1 now to turn each of these GOP House seats blue?",
    "This is a short blurb about Daily Kos.",
    "But that's only part of the story.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}