{
  "id": 19,
  "mediaId": 157,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "GOP county conventions across Michigan face disruptions, but party touts 'enthusiasm'",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29677725&width=1200&coordinates=0%2C36%2C0%2C14&height=600",
  "link": "https://www.rawstory.com/gop-county-conventions-across-michigan-face-disruptions-but-party-touts-enthusiasm/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Roth",
  "authorUrl": "https://www.rawstory.com/u/andrewroth-michiganadvance",
  "termIds": [
    890,
    1147,
    1536,
    1819,
    1901,
    308,
    428,
    2616,
    2627,
    2769,
    2791
  ],
  "sentences": [
    "Meanwhile, our team's hard work over the past six months has earned overwhelming grassroots support in every part of the state, and last night's results clearly displayed our success.?\nAsked by Gongwer about suggestions from some Republicans that Leonard did better than expected, and that DePerno was not elected delegate in his home county, Yob reportedly responded, You are smoking crack.?\nUsually, candidates for attorney general and secretary of state would be selected at August nominating conventions, shortly after new precinct delegates were elected in the August primary.",
    "John Yob, a political consultant known for running convention campaigns who is working with DePerno, said in a statement that the county conventions were a big victory for Matt DePerno with thousands of new people showing up to participate across the state.?\nTom Leonard, a former speaker of the state House, remained optimistic about his chances despite the results of DePerno's calls.",
    "Under rules set by the Michigan Republican Party, precinct delegates elected in the August 2020 primary are given preference to become delegates to the statewide convention, but up to 15% of a county's slate of delegates can be given to people who are not precinct delegates under a hard-working Republicans? rule.",
    "Gustavo Portela, a spokesperson for the Michigan Republican Party, downplayed the rifts in a statement and said the conventions only speak to the enthusiasm on the Republican side and frustration with Democrats who are well on their way to being fired this November.?\nDisruptions and disagreements are normal.",
    "The chair of each convention is selected by the delegates, meaning that if enough delegates favored a candidate, they could elect a chair who matches their view and select to send non-elected individuals as delegates to the state convention who may be more likely to vote for their preferred candidates.",
    "While it wasn't immediately clear what impact the disruptions at the county conventions might have on the results of the statewide convention, some speculated that the endorsement convention, meant to unify the party's base, could instead further expose the rifts within the party.",
    "Nessel faced a toughly contested convention in 2018, and previously said that Maddock's endorsements were a very shocking turn of events? that show the current Republican Party don't have any processes or protocols any more.?\nI was taken aback, certainly, when she openly endorsed.",
    "So I'm sure that when I win at convention, everybody that doesn't win is going to be very upset.?\nMichigan Democrats held their own statewide endorsement convention over the weekend and endorsed Attorney General Dana Nessel and Secretary of State Jocelyn Benson for re-election.",
    "Several Republican county conventions across the state of Michigan faced disruptions and disagreements Monday night after attorney general candidate Matt DePerno, who has been endorsed by former President Donald Trump, encouraged his supporters to storm? the events.",
    "This year, however, the Republican Party opted to hold an early endorsement convention in a bid to unify the party behind candidates earlier on, giving the candidates more time to build their general election campaigns against incumbent Democrats.",
    "It is time to storm the convention.?\nIn Macomb County, the convention hall exceeded its capacity before the event began and featured hours of insults being hurled between delegates, guests and organizer, as the Advance reported.",
    "Kent County was one of several counties that did not allow media into their convention, along with Livingston County and Clinton County, despite state party rules saying that the conventions are open meetings.",
    "Delegates were selected at the county conventions, who will go on to select candidates for attorney general and secretary of state at the party's statewide endorsement convention on April 23 in Grand Rapids.",
    "Some Republicans had already questioned the fairness of the statewide endorsement convention after Michigan GOP Co-Chair Meshawn Maddock took the unusual step of endorsing candidates in contested races.",
    "And it seems like it's sort of devolving into chaos.?\nMichigan Advance is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "Jenell Leonard, the Clinton County party chair and the spouse of attorney general candidate Tom Leonard, reportedly asked a Detroit Free Press reporter to leave their convention hall before it began.",
    "But then again, this Republican Party is very different from any party I've seen, at least since I've become aware of how party politics work, in either of the major parties,? Nessel said.",
    "In Kent County, the Detroit News reported that there was a close race between Rob VerHeulen, the county party chairman, and Keith Hinkle, an ally of DePerno.",
    "Attendees of the Kent County convention were also heard booing any time U.S. Rep. Peter Meijer (R-Grand Rapids) was called on to vote, per the Detroit News.",
    "Mark Forton, who was initially selected to chair the Macomb County convention, was later ousted from the role and replaced with Eric Castiglia.",
    "Everyone that loses at convention is going to be upset by the appearance of impropriety, even if one does not manifest itself at convention.",
    "DePerno used the language on stage at a rally with former President Donald Trump, and his campaign set up a website with the same message.",
    "At the end of the day, frankly, I think it's going to backfire on her,? LaFave said following Maddock's endorsement of Karamo.",
    "Maddock endorsed DePerno in the race for attorney general, over Leonard and state Rep. Ryan Berman (R-Commerce Twp.).",
    "This party is a mess,? former state Sen. Pete Lucido said while in attendance at the Macomb County convention.",
    "Matt DePerno's misguided call to storm the convention led only to a light drizzle,? DePerno said.",
    "Michigan Democrats used a similar strategy in 2018 when seats were open due to term limits.",
    "In the race for secretary of state, Maddock endorsed Kristina Karamo over state Rep.",
    "Beau LaFave (R-Iron Mountain) and Chesterfield Township Clerk Cindy Berry.",
    "And if you're not a delegate, you still need to go to county convention.",
    "Contact Editor Susan Demas for questions: info@michiganadvance.com.",
    "And have happened in various counties across the state for years.",
    "I need every one of you to go to county conventions on April 11.",
    "Every one of you delegates, raise your hand right now.",
    "Michigan Advance maintains editorial independence.",
    "It's time we storm the convention,? DePerno said.",
    "Follow Michigan Advance on Facebook and Twitter.",
    "The playbook has been thrown out.",
    "It's nothing new,? Portela said.",
    "There's no rules."
  ]
}