{
  "id": 22,
  "mediaId": 151,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Dem moderates get choosy in midterm recruits as GOP headwinds grow",
  "image": "https://www.politico.com/dims4/default/8c01a90/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F16%2F72%2Fdddc22314bbe8c439de02e5c0649%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1176817057",
  "link": "https://www.politico.com/news/2022/04/06/moderate-democrats-midterms-00023228",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1901
  ],
  "sentences": [
    "In its first endorsements of the cycle, the Blue Dogs' political arm is prioritizing a pair of centrist candidates in California's Central Valley, in seats that President Joe Biden would have won by double digits: Assemblymember Adam Gray (D-Merced) in the sprawling 13th district and Assemblymember Rudy Salas (D-Bakersfield) just below in the 22nd district.",
    "We need a moderate to replace a moderate because those seats are not winnable by some of those folks on the further left of the spectrum of our party.?\nIt's part of a strategy that Democratic centrists believe can actually keep their hopes to keep their majority alive in November: Run the candidates similar to them.",
    "And they're planning an aggressive ground game: Groups aligned with the moderate faction are bulking up their teams and working more closely with party officials on recruitment and fundraising  all with the hopes of lifting moderates of their own mold in November.",
    "And it's a notable shift from the far more aggressive battlefield that House Democrats ran in the 2020 cycle  eyeing pickups in Arkansas, North Carolina and even Montana, before unexpectedly losing more than a dozen members, almost all of whom were moderates.",
    "Both the Blue Dogs and fellow moderates at the NewDem Action Fund are now working to contain their losses this cycle, throwing their weight behind centrists in primaries while being far more selective about which races to get involved in from the start.",
    "And Salas, too, has experience running in larger districts as a state representative: Democrats hope he can compete against one of the GOP's most vulnerable incumbents, Rep. David Valadao (R-Calif.), in a district that Biden would've won by 13 points.",
    "You need someone who can actually have a chance of helping us keep our majority,? Rep. Kurt Schrader (D-Ore.), who leads the Blue Dog Democrats' political arm this cycle  which will roll out its first slate of endorsements on Wednesday.",
    "Ahead of an election where moderates could lose dozens within their ranks, House Democratic centrists are throwing more coordinated political muscle behind moderate primary candidates they say are the most electable in tough seats.",
    "Blue Dogs are also backing Democratic candidate Ruben Ramirez in south Texas, where the attorney and Army veteran is running in a newly redrawn, much tougher seat being vacated by Rep. Vicente Gonzalez (D-Texas).",
    "Schrader said he's sensed a different tune coming from the DCCC this cycle, particularly when it comes to allowing moderates to run independently, without a party platform or predetermined message.",
    "Gray, who has been deeply involved with agriculture and water issues in California's State Assembly, will run in the newly created, largely rural district where Biden would have won by 11.4 points.",
    "To ward off a complete clobbering of their ranks, many House centrists are partnering more with the the Democratic Congressional Campaign Committee, led by Rep. Sean Maloney (D-N.Y.).",
    "So far, of the 11 endorsements made by both the Blue Dogs and the New Democrats, the vast majority are in seats where Biden would have won by double-digits.",
    "They hope more coordination on recruitment and strategy will help in their fight to hang on during a political cycle that has them at a disadvantage.",
    "And in Michigan, Democrat Hillary Scholten, an immigration attorney, is seeking a rematch against GOP Rep. Peter Meijer in a much bluer seat.",
    "Certainly we understand this is going to be a difficult cycle,? said Rep. Ami Bera (D-Calif.), a senior member of the New Democrat Coalition.",
    "The Texas incumbent, who is seeking more friendly turf in a neighboring district, has also endorsed Ramirez in the competitive primary.",
    "| Alex Wong/Getty Images\nBy Sarah Ferris\n 04/06/2022 04:31 AM EDT\nThe Democratic Blue Dogs are sharpening their teeth for the midterms.",
    "That's the easiest way to hang onto our majority is to protect our incumbents.?\nLast cycle, the ranks of the Blue Dogs were decimated.",
    "On Staten Island, for instance, former Rep. Max Rose  a former Blue Dog  is looking to unseat Republican Rep. Nicole Malliotakis .",
    "Zero out of the nine candidates they endorsed won, while eight of their incumbents lost their reelection battles.",
    "That's a shift from the past, as some battleground Democrats have had their gripes with the party campaign arm.",
    "Still, some of those would count as pick-ups for Democrats if they can win them, because of redistricting.",
    "Certainly we understand this is going to be a difficult cycle,? said Rep. Ami Bera (D-Calif.).",
    "New Democrats, which has a larger base of lawmakers, also lost a key chunk of members.",
    "It was vacated by Rep. Josh Harder (D-Calif.), who is running in another district.",
    "My experience with DCCC this cycle compared to 10 years ago is night and day.",
    "No litmus tests about what you gotta believe or say, they let you be you.",
    "Redistricting has given us some good districts to play offense in.",
    "This year could be even worse, some Democrats privately say.",
    "A handful more endorsements are likely still to come.",
    "But we're also just about incumbent protection.",
    "It's a maturity of the organization,? he added.",
    "We're going to play offense in some places.",
    "I give Sean Patrick some credit.?",
    "That's critical,? Schrader said."
  ]
}