{
  "id": 25,
  "mediaId": 233,
  "date": "d2022-04-05T17:20",
  "headline": "Rep. Fred Upton - another Donald Trump Republican impeacher - announces his retirement",
  "image": "https://www.gannett-cdn.com/presto/2022/01/28/USAT/2103b2c4-966d-4d6b-b437-eb500e83fa7f-Fred_Upton_Headshot_2021.jpg?crop=639,360,x0,y0&width=639&height=360&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/04/05/fred-upton-donald-trump-house-retirement/9468779002/",
  "sentiment": "0.0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jackson",
  "authorUrl": "https://www.usatoday.com/staff/2647924001/david-jackson/",
  "termIds": [
    1147,
    1614,
    1901,
    2005,
    2010,
    2074,
    2125,
    2214,
    2436,
    3094,
    428,
    2959
  ],
  "sentences": [
    "Ten Republican impeachment votes: OnPolitics: Republicans who voted to impeach Trump face his 2022 picks\nU.S. Rep. Liz Cheney, R-Wyoming, the highest ranking Republican to vote for impeachment, is still seeking re-election, but faces a Trump-backed challenger in an August primary.",
    "Upton followed the retirement footsteps of three other House Republicans who voted to impeach Trump and later decided opted against seeking re-election: Reps. Anthony Gonzalez of Ohio, John Katko of New York, and Adam Kinzinger of Illinois.",
    "Trump has also vowed revenge on the other GOP impeachment supporters: Rep. Tom Rice of South Carolina, Jaime Herrera Beutler of Washington, Dan Newhouse of Washington, Peter Meijer of Michigan and David Valadao of California.",
    "Rep. Fred Upton, R-Mich., one of ten House GOP members who supported impeaching Trump over the Jan. 6 insurrection, told colleagues in a floor speech that \"even the best of stories has a last chapter\" and \"this is it for me.\"",
    "Trump quickly took credit for Upton's refusal to seek re-election, while Upton supporters and other Republicans said his decision stemmed from redistricting and not the ex-president's backing of a challenger.",
    "Other Republicans said retirements had more to do with the fact that members like Upton found themselves running in new and more difficult congressional districts.",
    "\"As I reflect back, there have certainly been more highlights representing the wonderful and diverse corner of Southwest Michigan,\" Upton said.",
    "Upton's new district included another House Republican incumbent, Rep. Bill Huizenga, who had Trump's endorsement.",
    "\"These folks are truly the salt of the earth and I love em all  even a few that don't always love me!\"",
    "WASHINGTON  A fourth House Republican who voted to impeach Donald Trump is leaving Congress.",
    "Republican strategist Doug Heye said not everything in Republican politics is about Trump.",
    "In a speech to the House, Upton cited his work on jobs, the economy and COVID vaccines.",
    "\"Every 10 years, district lines change and members retire,\" Heye said.",
    "He did not mention Trump or impeachment.",
    "Trump crowed in a written statement.",
    "Others losing badly, who's next?\"",
    "\"4 down and 6 to go.",
    "\"We know this.\"",
    "\"UPTON QUITS!\""
  ]
}