{
  "id": 26,
  "mediaId": 261,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "Rep. Fred Upton announces retirement from Congress, has been in US House since 1987",
  "image": "https://www.gannett-cdn.com/media/2017/05/02/DetroitFreeP/DetroitFreePress/636293274366562613-Upton-IMG-AP-Congress-Crude-Oi-1-.JPG?crop=4897,2767,x0,y0&width=3200&height=1809&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/2022/04/05/representative-fred-upton-retirement/9468833002/",
  "sentiment": "0.0",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Todd Spangler",
  "authorUrl": "https://www.freep.com/staff/2646148001/todd-spangler/",
  "termIds": [
    1901,
    3087
  ],
  "sentences": [
    "As a member of Congress he had decided successes: In 2016, he and Rep. Diana DeGette, D-Colo., spearheaded passage of the 21st Century Cures Act, a bill that accelerated the process by which life-saving drugs could be brought to market, including the vaccines that are now used against COVID-19.",
    "While the timing came as a surprise, it was widely suspected that Upton might decide not to run for another two-year term, especially after an independent redistricting commission redrew district lines that put both he and U.S. Rep. Bill Huizenga, R-Holland Township, in the same district.",
    "Upton, 68, leaves Congress having served for six years as chairman of the powerful House Energy and Commerce Committee, a position previously held by the late Rep. John Dingell, D-Dearborn, with whom Upton was great friends despite their political differences.",
    "Even so, Upton clearly held out the possibility of running for another two-year term, his chances helped greatly by the fact that, until a few weeks ago, Trump had endorsed a little know state legislator, Rep. Steve Carra, R-Three Rivers, to run against him.",
    "An ally of the late Sen. John McCain, R-Ariz., he joined McCain on the campaign trail when he ran for president in 2008 and laughed as the presidential candidate told audiences that Upton always looked like one of the youngest people in the room.",
    "Upton has also been close to Dingell's wife, current U.S. Rep. Debbie Dingell, D-Dearborn, who spoke through tears on the House floor following Upton's announcement, calling him \"a devoted public servant... for all of Michigan and our nation.\"",
    "\"Whether it was defending the auto industry, protecting the Great Lakes, supporting our veterans or our workers, Fred Upton was always there standing shoulder to shoulder in the trenches working and fighting for our great state,\" she said.",
    "Former President Donald Trump endorsed Huizenga a few weeks ago and had vowed to try to unseat Upton after he, along with nine other Republicans, voted to impeach Trump for instigating the Jan. 6, 2021 attack on the U.S. Capitol.",
    "While he has typically voted along conservative lines, he also has shown a willingness to buck his party  such as when he voted in favor of infrastructure legislation last year that is worth billion to Michigan.",
    "In 2018, President Joe Biden, then the former vice president, gave a paid speech in west Michigan praising Upton's bipartisanship amid a reelection battle in what would otherwise be a strong year for Democrats.",
    "Then, after Trump refused to accept that he lost the 2020 election to Joe Biden  and held a rally telling people to keep fighting on the day Congress was meeting to certify the results  Upton had enough.",
    "When Trump suggested John Dingell might be in hell instead of heaven during a rally in Battle Creek, Upton  seeing how it hurt Debbie Dingell  told the president to apologize, but Trump refused.",
    "Before running for Congress in 1986, Upton worked at the Office for Management and Budget  and for former U.S. Rep. David Stockman, who was its director  during President Ronald Reagan's tenure.",
    "Critics noted Upton had voted several times to repeal the Affordable Care Act, though when Trump was president, he urged him not to press for repeal without a replacement ready to take effect.",
    "\"Fred knew well that if we are going to deliver real solutions for the American people we need to come together and listen to all perspectives no matter how complicated the issue might be.\"",
    "U.S. Rep. Fred Upton, a genial politician who worked for the Reagan administration before winning a seat in Congress in 1986, announced Tuesday he was stepping down after his current term.",
    "Gretchen Whitmer, a Democrat, issued a statement calling Upton \"a passionate advocate for the issues he cares about\" and someone who \"never hesitates to showcase his independent streak.\"",
    "Macomb County Public Works Commissioner Candice Miller, a former congresswoman who served with Upton, put out a statement saying his retirement \"is truly a great loss for Michigan.\"",
    "He also said he felt like he had done what he was sent to Congress to do and that, like the former Boy Scout he is, \"I believe in leaving the campground better than I found it.\"",
    "Speaking on the House floor, Upton said he was guided throughout his career in Congress by the idea that, \"If it's good policy for Michigan, it's good enough for all of us.\"",
    "\"And he did it all with honor, integrity, decency and as a true public servant who would always do what he believed was right regardless of the political consequences.\"",
    "Also voting to impeach was U.S. Rep. Peter Meijer, R-Grand Rapids, who is running for reelection this year despite Trump's endorsement of another candidate, John Gibbs.",
    "Huizenga, who has been in Congress since 2011, was far more measured, thanking Upton \"for his commitment, service and dedication to Michigan over the years.\"",
    "\"It's his civility in Congress that I will miss the most,\" she said, noting that even when they would disagree on issues, he could always make her laugh.",
    "\"Even the best stories have a last chapter,\" said Upton, R-St. Joseph, speaking on the House floor in a surprise announcement Tuesday morning.",
    "\"Except today,\" she added\nAmong the Michigan delegation, Upton has long been known as a friendly, even-tempered politician.",
    "\"Thanks again to the people of my district,\" he said, \"who placed their faith and confidence in me all these great years.\"",
    "He was one of 10 Republicans who voted to impeach Trump, though the Senate failed to get the votes needed to convict him.",
    "\"We could all learn something from his tenure and strive to live and lead with the values he embodies,\" she continued.",
    "A descendant of the family that founded Whirlpool, the appliance company, Upton is also the uncle of model Kate Upton.",
    "In his brief speech on the House floor, Upton thanked his family, his wife Amey and his staff, his voice breaking.",
    "But then, Trump suddenly announced his was withdrawing his endorsement of Carra and giving it to Huizenga instead.",
    "That meant there was the chance that Huizenga and Carra would split the Republican field and Upton could win.",
    "In February, he put out a TV ad saying he was \"proud of his record,\" suggesting he was mounting another run.",
    "Some county Republican groups moved to censure Upton because of the vote but he continued to stand by it.",
    "\"Fred's statesman-like legacy will be remembered both in Michigan and our nation's capital,\" he said.",
    "Upton beat former Rep. Mark Siljander in the Republican primary in 1986 en route to his first term.",
    "He routinely told any reporter who called him congressman to call him Fred instead.",
    "He also has been a driving force in fighting for automobile and pipeline safety.",
    "Sitting by himself in his office, he watched the rioters attack the Capitol.",
    "\"To him, 'bipartisan' and 'compromise' are not forbidden words,\" she said.",
    "Carra departed the race, making Upton's reelection are far tougher task.",
    "Read more onMichigan politics and sign up for ourelections newsletter.",
    "In an email after the announcement, Trump crowed, \"UPTON QUITS!",
    "But that willingness to go against his party cost him.",
    "Contact Todd Spangler attspangler@freepress.com.",
    "Follow him on Twitter@tsspangler.",
    "4 down and 6 to go.\"",
    "\"This is it for me.\"",
    "Gov."
  ]
}