{
  "id": 27,
  "mediaId": 238,
  "date": "d2022-04-05T14:21",
  "headline": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/05/gop-rep-upton-who-voted-impeach-trump-will-not-seek-reelection/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1614,
    1901,
    1983,
    2005,
    2087,
    2429,
    3094,
    146,
    428
  ],
  "sentences": [
    "On Tuesday, he cited his work on the infrastructure bill as another one of his achievements, noting that it had passed 69-30 in the Senate but then hit the rocks here in the House, barely surviving Trump's opposition despite his call for a proposal twice as expensive with no pay-fors.?\nBecause of redistricting in Michigan, a new map forced Upton into the same seat as Rep. Bill Huizenga, a pro-Trump Republican.",
    "This is it for me.?\nUpton noted that he had worked with seven presidential administrations and seven House speakers, and said that none of them would call me a rubber stamp.? Upton was for many years chairman of the House energy and commerce committee, and touted his co-sponsorship of the 21st Century Cures Act to boost medical research and ease drug approvals as one of his signature achievements.",
    "Others include Reps. John Katko (N.Y.), Adam Kinzinger (Ill.) and Anthony Gonzalez (R-Ohio), who in September cited the toxic dynamics inside our own party? as part of the reason for his decision.",
    "At a House GOP leadership news conference Tuesday, Rep. Jeff Duncan (R-S.C.) said Upton would be missed by the conference, and praised him as a leader on energy and commerce issues.",
    "Rep. Fred Upton (R-Mich.), one of 10 Republican lawmakers who voted to impeach President Donald Trump, will not seek reelection in November after more than three decades in office.",
    "He remained steadfast that it was Congress's role to hold Trump accountable and blasted the former president for having expressed no regrets? for the attack on the Capitol.",
    "Trump initially endorsed a state lawmaker who was challenging Upton in his former district, then endorsed Huizenga when it became a member-on-member race.",
    "Upton also later backed the bipartisan infrastructure bill and received death threats afterward for helping President Biden score a legislative win.",
    "Upton received blowback from much of the Republican base after voting with Democrats to impeach Trump last year over the Jan. 6, 2021, insurrection.",
    "In a statement through his political action committee, Trump appeared to both celebrate and mock Upton's decision not to run again.",
    "Of the 10 Republicans who voted to impeach Trump, Upton will become the fourth to leave Congress rather than seek reelection.",
    "So, you know, this was a decision [Upton] had to make looking at the dynamics of a member-on-member race,? Scalise said.",
    "The six other Republicans who voted to impeach Trump who are running again  including Reps. Liz Cheney (Wyo.)",
    "That history of crossing the aisle, however, grew increasingly untenable in a polarized Congress.",
    "As a former Boy Scout, I believe in leaving the campground better than one found it,? Upton said.",
    "said it was unfortunate? that redistricting had pitted Upton and Huizenga against one another.",
    "The bill was signed into law by President Barack Obama in 2016.",
    "and Peter Meijer (Mich.)  face tough primary challenges.",
    "Even the best stories have a last chapter.",
    "House Minority Whip Steve Scalise (R-La.)"
  ]
}