{
  "id": 40,
  "mediaId": 157,
  "date": "3/20/2022 12:00:00 AM",
  "headline": "Trump sicced his followers on the GOP's 'RINOs' -- and it's tearing the party apart: report",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29565925&width=1200&coordinates=0%2C11%2C0%2C36&height=600",
  "link": "https://www.rawstory.com/trump-2656995471/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1901,
    3094
  ],
  "sentences": [
    "According to a report from Politico's David Siders, Republican-on-Republican attacks have exploded since Donald Trump left office and a great part of it can be pinned on the former president's MAGA followers who are determined to drive those they believe to Republican in Name Only (RINO) from the party.",
    "When a candidate uses that today against someone, I read that as a sign of desperation, that they don't have the ability or the willingness to specify what they have a problem with, so they're trying to just engender a sense that their opponent is not committed,\" Dickey explained.",
    "\"That doesn't include the raft of RINO-focused appeals appearing on social media and in mailers  or the 'RINO Hunter' T-shirts worn by a group of far-right Republicans at a local GOP meeting in California's Orange County earlier this year, with crosshairs in place of the 'O.'\"",
    "According to the report, the term is being flung around without regard to a lawmaker's conservative background and has been applied to Trump for Rep. Liz Cheney (R-WY) as well as Trump defender Sen. Lindsey Graham (R-SC) depending on the circumstances.",
    "Noting that RINO has a long and rich history within the GOP -- once mildly used over disagreements over policy -- now the word has become a \"slur\" used to attack anyone who doesn't wholeheartedly support Trump and everything he says and does.",
    "But former President Donald Trump's frequent use of the term has given it a new life, weaponizing a description once largely reserved for party moderates and turning it into a slur to be avoided at all costs.\"",
    "But so far in 2022, candidates have already spent more than $4 million on TV ads employing RINO as an attack, in races ranging from House and Senate contests to state House races,\" the report states.",
    "\"The use of RINO has become so widespread that it can now include almost any Republican, including some of the most conservative stalwarts in the party,\" the Politico report continued. \"",
    "It's effective in part, said Jim McLaughlin, a veteran Republican pollster, because it's a phrase that 'comes out of the mouths of the voters, that comes out of the mouths of the base.'",
    "Rejection of Trump's false claims of election fraud  or worse, a vote to impeach the former president  are common threads among those targeted by the former president for the insult.\"",
    "In 2018, during the last midterm election, RINO barely registered as a mention in TV ads, according to an analysis compiled for POLITICO by the ad tracking firm AdImpact.",
    "As the Politico report notes, use of the term has exploded recently and is being by followers of Trump with their eye on ousting and replacing incumbents.",
    "According to James Dickey, the former chair of the Texas Republican Party, the term is getting overused and might be losing some of its power.",
    "According to Siders, \"In speeches, ads and on social media, it is fast becoming the defining smear of the 2022 primary campaign season: RINO.",
    "There is a sense of familiarity that is reinforced when a candidate insults 'squishy'\nRepublicans just like they do,\" Siders wrote.",
    "So is Sen. Lindsey Graham of South Carolina, former President George W. Bush and the entire Maricopa County Board of Supervisors.",
    "During just the past six months, the list of Republicans Trump has branded with the term includes Arizona Gov.",
    "GOP strategist Rory McShane agreed, telling Politico: \"You can't just say this person is a RINO.",
    "You have to explain how they've betrayed the conservative movement.?\nStories Chosen For You",
    "\"For the MAGA set, the term has become a useful shorthand to refer to the establishment.",
    "The acronym  short for Republican-In-Name-Only'  is hardly new.",
    "Republican primary voters are anesthetized to that.",
    "'Loser Liz Cheney' is a Republican-In-Name-Only.",
    "Doug Ducey and 'RINO Congressman Peter Meijer.'",
    "\"The mushrooming of the insult is measurable.",
    "I think it's become clich."
  ]
}