{
  "id": 48,
  "mediaId": 151,
  "date": "3/3/2022 12:00:00 AM",
  "headline": "Hope springs eternal on Dems' domestic dreams",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/03/03/hope-springs-eternal-on-dems-domestic-dreams-00013544",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hope springs eternal",
  "authorUrl": "https://www.politico.com/staff/katherine-tully-mcmanus",
  "termIds": [
    2347,
    2347,
    2389,
    2389,
    2411,
    2411,
    2109,
    2109,
    1743,
    1743,
    1015,
    1015,
    1147,
    1147,
    1385,
    1385,
    704,
    704,
    2590,
    2590
  ],
  "sentences": [
    "The committee suggested its evidence supported findings that Trump himself violated multiple laws by attempting to prevent Congress from certifying his defeat.?\nKyle and Nicholas have much more on what dropped last night, including emails between Vice President Mike Pence's counsel and John Eastman, an attorney who was a key driver of Trump's strategy to subvert the 2020 election, in the moments that Pence was being evacuated to a secure location on Jan. 6.: Jan. 6 committee says Trump violated multiple laws in effort to overturn election\nDEMS TEE UP GOP ATTACKS  A major risk of an extended primary season, especially where candidates go hard and negative, is giving the other party free political ammunition against their eventual opponent.",
    "Democrats' delight: Sen. Mark Warner (D-Va.) captured Democrats enthusiasm (or lack thereof) about negotiating with Manchin yet again, right where they've been for a whole year: I was hoping you would were going to, like, ask me to expound about Ukraine.?\nIn some ways he is as cryptic as ever: No formal? talks are happening with the White House but there's informal back-and-forth.? Has he talked to Biden recently on this?",
    "10:45 a.m. Speaker Nancy Pelosi holds her weekly press conference (HVC Studio A)\nTRIVIA\nWEDNESDAY'S WINNER: Amy Edmonds correctly answered that Winston Churchill addressed a joint session of Congress and said, If my father had been an American, and my mother British, instead of the other way around, I might have gotten here on my own.?\nTODAY'S QUESTION from Amy: Which state was the first to elect a female governor?",
    "[But] we aren't even mentioning it.?\nCovid on Capitol Hill\nEXPLORING (AND EXPERIENCING) LONG COVID Sen. Tim Kaine (D-Va.) is still experiencing Covid symptoms, almost two years after his spring 2020 infection and he's putting that experience, plus his perch on the Senate Health, Education, Labor and Pensions Committee into a push for research funding to learn more about long Covid.",
    "CRIMINAL CONSPIRACY TO DEFRAUD THE U.S.'  The House Select Committee investigating the Jan. 6 attack on the Capitol said last night that it its evidence has shown that [former President Donald] Trump and his campaign tried to illegally obstruct Congress' counting of electoral votes and engaged in a criminal conspiracy to defraud the U.S.,'? report Kyle and Nicholas.",
    "Freshman Rep. Peter Meijer (R-Mich.), a veteran told Olivia that the veteran community is incensed? and that failing to mention the conclusion of a 20-year conflict could be an encouraging sign for the Taliban.Think of the message that sends to the Taliban,? he added, noting how the extremists are blocking SIVs from leaving the country now.",
    "sent a letter to Speaker Nancy Pelosi (D-Calif.) and Minority Leader Kevin McCarthy (R-Calif.) imploring them to keep the House in session so that this body can debate and vote as expeditiously as possible on a standalone supplemental package that will provide vital military aid and humanitarian assistance to Ukraine.? Read their letter.",
    "QUICK LINKS\nMurkowski: Blocking Russian oil to stop Putin is worth the 'hurt' to Americans, from Josh Siegel\nRussia crisis forces Pentagon to rework defense strategy on the fly, from Connor O'Brien, Paul McCleary and Lee Hudson\nTRANSITIONS\nJack Pickett started this week as press secretary in Rep. Michelle Steel's office (R-Calif.).",
    "Hope springs eternal on Dems' domestic dreams\nBy KATHERINE TULLY-MCMANUS\n03/03/2022 07:56 AM EST\nPresented by\nWith help from Sarah Ferris and Olivia Beavers\nMANCHIN, TAKE THE WHEEL  Sen. Joe Manchin (D-W.Va.) is back in the driver's seat, steering the scope of the Democrats agenda  a tough pill to swallow for his colleagues.",
    "The Congressional Black Caucus set up a war room? to defend Jackson even before she was selected, according to Rep. Steven Horsford (D-Nev.).?We'll do everything to make sure that she is confirmed, and that we push back on any attempts to weaken her in the process,? he said.",
    "While a Supreme Court confirmation is the sole purview of the Senate, that's not stopping House members from also weighing in  a sign of the weight Democrats are placing on President Joe Biden's decision to nominate a Black woman to the Supreme Court,? writes Marianne.",
    "HUDDLE HOTDISH\nPotato lovers uniteThe National Potato Council held their Washington Summit yesterday at the Capitol Hill Club, where a bevy of lawmakers stopped by for speeches and indulge in a steaming french fry and mashed potato bar with all the fixings.",
    "They backed a resolution sponsored by Rep. Michael Burgess (R-Texas) calling on the International Criminal Court to prosecute Russian President Vladimir Putin should anything happen? to Zelenskyy, who is effectively being hunted by Russian forces.",
    "National File and Breitbart first reported salacious allegations about Taylor's affair with a woman once married to a commander for the Islamic State, which were quickly shared among the GOP members and staffers in Congress.",
    "Timeline: The Senate Judiciary Committee is set to begin Jackson's four-day confirmation hearings on March 21, and the panel will meet March 23 behind closed doors to discuss Jackson's FBI background check.",
    "MOUTH WIDE OPEN...AGHAST Rep. Van Taylor (R-Texas) is abandoning his reelection bid after admitting to supporters that he had an extramarital relationship, cutting his career short after just two terms.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Thursday, March 4, where your Huddle host has listened to Don't Fence Me In? a half dozen times already this morning.",
    "He introduced a bill Wednesday that would direct funding for research into the complex and little-understood long Covid phenomenon as well as expand treatment resources for patients.",
    "Kaine has been open about the strange tingling and burning sensations he's experienced since recovering? from Covid and told The Washington Post more about it yesterday.",
    "They also reveal where Sen. Kyrsten Sinema (D-Ariz.) fits into the picture and where progressives like Sen. Bernie Sanders (I-Vt.), Sen. Elizabeth Warren (D-Mass.)",
    "The Russia calculation: He says the Russian invasion of Ukraine will require a shakeup of the climate provisions that were on the table a few months ago.",
    "She met Wednesday with key senators and will continue making the rounds, with plans to sit down today with Sen. Patrick Leahy (D-Vt.), Ben Sasse (R-Neb.)",
    "The GOP is giddy at the prospect of 1) An incumbent under the shadow of an FBI raid or 2) An AOC-endorsed progressive in a largely conservative enclave.",
    "The revenue raised would be divided evenly between reducing the federal deficit and inflation in addition to enacting new climate and social programs.",
    "He launched a counteroffer to the Democrats' dead Build Back Better? domestic economic agenda, which Manchin personally assassinated and buried.",
    "Cheers to that The Congressional Hispanic Staff Association hosts an in-person networking event tonight 7pm - 9pm at Agua 301 (RSVP required.)",
    "CONFIRMATION ROADMAP  Democrats on Capitol Hill are plotting the path to confirmation for Supreme Court nominee Judge Ketanji Brown Jackson.",
    "There's another factor in the GOP's favor  their inroads with Latino voters, particularly on the issue of border security and immigration.",
    "), Jim Risch (R-Idaho) and Reps. Mike Simpson (R-Idaho), Dan Newhouse (R-Wash), Russ Fulcher (R-Idaho), Glenn Thompson (R-Pa.) and others.",
    "Where to start: Manchin wants to roll back 2017 Trump tax cuts and lean into revenue savings from prescription drug pricing reform.",
    "Different White House people reach out, and we talk from time to time.?\nBut Burgess and Nicholas don't just have Manchin's musings.",
    "SOTU's MIA TOPIC  Republicans were quick to point out Wednesday that Biden's State of the Union address glossed over Afghanistan.",
    "The Senate convenes at 10 a.m.\nAROUND THE HILL\n10 a.m. Senate Banking Committee hearing on the semiannual monetary policy report.",
    "and Rep. Katie Porter (D-Calif.): Dems agonize over Manchin's wish list: Taxes, prescription drugs, climate cash\nGOOD MORNING!",
    "It's one thing if you're going to the map and saying, Hey, this is important to us, we're going to expend some political will.",
    "PROTECTING ZELENSKYY  Dozens of House members, like you, want to keep Ukraine President Volodymyr Zelenskyy safe at all costs.",
    "They say Manchin doesn't care  he's killing the environment.' I'm not killing anything.?Except, of course, Build Back Better.",
    "Never screw around that ISIS bride, that's my strong advice,? one of Taylor's colleagues quipped, pointing to the reports.",
    " Reps. August Pfluger (R-Texas) and Lou Correa (D-Calif.) along with Ukrainian-born Rep. Victoria Spartz (R-Ind.)",
    "Rep. Henry Cuellar's (D-Texas) South Texas seat has never been a concern for Democrats in the general election.",
    "The news of his sudden exit broke when members were on the House floor yesterday afternoon for a vote series.",
    "In some cases, reporters off the house floor informed Taylor's colleagues of the latest campaign development.",
    "But this year, Republicans are betting it'll go their way  even before they know who their opponent will be.",
    "Betsy Woodruff Swan has more from her conversation with Burgess (not our Burgess, the House-side one.)",
    "Long Covid encompasses a wide range of long-term symptoms, from irritating to completely debilitating.",
    "It's socialism versus corruption, to borrow the two competing Democrats' attacks against each other.",
    "Farewell to the fenceNicholas spotted parts of the Capitol fence perimeter coming down last night.",
    "You have to use all of the above,'? Manchin said in defense of his support for clean energy.",
    "Circuit Court of Appeals, already returned the extensive committee questionnaire this week.",
    "You want to be able to defend your people, have reliable, dependable and affordable power?",
    "Pierce Wiegard is now deputy chief counsel for oversight on the Senate EPW Committee.",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "He previously was senior counsel for Sen. Dan Sullivan's (R-Alaska) office.",
    "If you do that, the revenue producing [measures] would be taxes and drugs.",
    "Anthony and Olivia have more in-the-moment reaction from his colleagues.",
    "TODAY IN CONGRESS\nThe House convenes at 9 a.m. for legislative business.",
    "Many joked that Taylor was not on their bingo card for stuff like this.",
    "The final day, March 24, will include testimony from outside witnesses.",
    "We're going to say this as an issue that matters,'? Meijer told Olivia.",
    "She previously was legislative counsel for Sen. Rand Paul (R-Ky.).",
    "POLITICO Agriculture reporter Ximena Bustillo spotted Sens.",
    "Sarah and Ally Mutnick break down the road ahead in Laredo.",
    "He was previously in Rep. Dan Newhouse's (R-Wash.) office.",
    "Ericka King is now VP of Ervin Graves Strategy Group.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "Jackson, who currently serves as a judge on the D.C.",
    "The spending is going to be climate,? Manchin said.",
    "(Both Ella Fitzerald's version and Wille Nelson's.)",
    "Marianne has more KBJ's confirmation road ahead.",
    "Is that what Democrats are doing in South Texas?",
    "Federal Reserve Chair Jerome Powell testifies.",
    "GET HUDDLE emailed to your phone each morning.",
    "Susan Collins (R-Maine), John Boozman (R-Ark.",
    "Send your answers to ktm@politico.com.",
    "(No word on what toppings they like.)",
    "(Hence your host's morning tunes.)",
    "FIRST IN HUDDLE: STAY IN SESSION?",
    "and Amy Klobuchar (D-Minn.).",
    "(Dirksen 538)."
  ]
}