{
  "id": 5,
  "mediaId": 165,
  "date": "d2022-04-26T14:46",
  "headline": "Republicans Are Trying to Seize Veto Power Over the 2024 Election",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/kristina-karamo-michigan-gop.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-features/michigan-election-denier-trump-2024-biglie-1342918/",
  "sentiment": "0.0",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kara Voght",
  "authorUrl": "",
  "termIds": [
    1147,
    1536,
    1802,
    1901,
    307,
    308,
    428,
    2645,
    2678,
    2791
  ],
  "sentences": [
    "Instead, we are left to clean up the mess caused by violent protestors overrunning the U.S. Capitol in an attempt to undermine the people's business.?\nNow, standing in a sea of red caps, I wondered how many attendees milling about the building that shared DeVos' name also shared her view of Trump: Someone whose politics she supported, but whose conspiracies breached a fundamental precedent.",
    "As Detroit tallied its roughly 150,000 absentee ballots at the city's TCF Center in November 2020, pro-Trump demonstrators flooded the convention center to stop the count.? At the front of the mob was an influential pro-Trump activist who'd become a power player in the state's conservative scene, even if she was a thorn in the side of the mainstream establishment: Meshawn Maddock.",
    "Mark Forton, the recently ousted chair of the Macomb County GOP who has admonished his fellow state Republicans for not adequately supporting Trump and his claims of election fraud, told me the former president called him last September to complain that Republicans in other states had done a better job fighting the election results.",
    "Installing big lie? sympathizers on the boards responsible for certifying results positions the MAGA wing to reject future election outcomes  and to have their people at the ready on Election Day, 2024. They're clearly trying to set things up to succeed where they failed in 2020,? Brewer says.",
    "The nominees for the state's top law-enforcement official and chief election officer represent the highest-profile efforts to date, but neither office has the authority to actually deny an election outcome, says Mark Brewer, an election-law expert and former Michigan Democratic Party chair.",
    "Their fealty to election conspiracies had earned them early endorsements from the former president, who  never one to let the inconvenience of election results stand in his way  congratulated the pair on their incredible victory? three hours before the final results were tallied.",
    "While Dana Nessel, Michigan's current Democratic attorney general, has defended the state against frivolous election-fraud lawsuits, DePerno could bring them himself  in other words, much of what he's been doing, but with all of the state's authority and resources.",
    "Karamo, meanwhile, has claimed the incumbent, Democrat Jocelyn Benson, is obsessed with corrupting our election process.? Karamo appeared at a QAnon conference event last August and doubled down on unsubstantiated claims of widespread voting fraud in Michigan.",
    "How are you going to run an election system if you believe it's all fake?? (Rep. Peter Meijer, the hometown congressman and rare Republican who voted to impeach Trump, skulked around the periphery, unwilling to tell reporters which candidates he'd supported.)",
    "GRAND RAPIDS, Michigan  It was around 5:35 p.m. on Saturday when the leaders of the Michigan Republican Party, whose members had spent the day sermonizing about election integrity, realized their nominating convention might be lacking that virtue.",
    "(I, meanwhile, surveyed the scene wearing a press credential issued by the party that read Whitmer Protection Program,? a Trumpian suggestion that most reporters in the media are working on behalf of the incumbent Democratic governor.)",
    "At the county board level, the Detroit News reported last October that Republicans had nominated new canvassers in eight of Michigan's 11 largest counties, and the incumbent GOP canvasser was not nominated in at least four instances.",
    "Maddock, once the outsider looking in, sat on the convention center's stage as the party's co-chair  sounding gleeful, one delegate observed, when she announced the machine counts for the first round of voting matched the audit.",
    "This issue revealed itself at an ironic juncture: A runoff to determine who would be the party's nominee for attorney general, the office that would be called upon to protect fair and free elections  or, perhaps, undermine them.",
    "As the state's chief election officer, Karamo could deny Michigan voters resources necessary to conduct fair elections, limiting the distribution of absentee ballots and funding for township and county clerks, for example.",
    "A number of them, like Karamo, are members of a right-wing coalition of candidates seeking to take control of elections in key states, formally working with a group of conspiracy theorists and a QAnon influencer to do so.",
    "We saw how well this worked out in Georgia, when we cast doubt on whether it's worthwhile to go out and vote,? a delegate representing Michigan's 3rd District, who was only willing to speak on background, said.",
    "Brewer also noted that township and county clerks, positions that have election supervisory roles, could also be prime slots for election deniers, though those positions aren't up for reelection until 2024.",
    "Roughly 300 Trump supporters held their own local Stop the Steal? rally outside the Michigan statehouse in Lansing on January 6 (though it remained peaceful, unlike its counterpart at the U.S. Capitol).",
    "The heart of the confusion was simple: The order of the would-be nominees on the ballot given to delegates was different from what appeared on the projectors at the front of the convention hall.",
    "At a rally with the former president earlier this month, she promised Trump supporters that, if elected, your vote isn't nullified by illegal ballots.?\nSuch allegiance earned Trump's affection.",
    "Rudy Giuliani showed up to lead a singalong of God Bless America,? while My Pillow Guy?turned?big lie? benefactor Mike Lindell took photographs with delegates as he worked the room for DePerno.",
    "The Michigan GOP chose to gather at DeVos Place, the colossal convention center in downtown Grand Rapids named for the DeVos family, the conservative billionaire benefactors who founded Amway.",
    "One of the clan's esteemed members, Betsy, resigned her post as Trump's secretary of education after the Jan. 6, 2021, attack on the U.S. Capitol that was spurred on by election conspiracies.",
    "Michigan's nominating process privileges candidates whose positions appeal to the activists, local party leaders, and elected officials who serve as delegates  in other words, the GOP base.",
    "Party leadership denied Ryan Berman, a candidate for attorney general who failed to qualify for the second round, the opportunity to do the same for Tom Leonard, the establishment pick.",
    "It very much seemed to be going? from the look of things in Grand Rapids, redolent with tributes to the 2020 election conspiracies the former president and his allies continue to push.",
    "Last fall, the state party began quietly replacing Republicans who served on county canvassing boards with newcomers, many of whom had sought to undermine the 2020 election results.",
    "The outcome was a major victory for the faction of pro-Trump Republicans who deny the 2020 election  and who're eager to seize the right to veto results they don't like in 2024.",
    "In the end, Michigan Republicans did choose Karamo and DePerno, who bested more moderate candidates many in the party's establishment had hoped would prevail, as their nominees.",
    "Secretary of state candidate Kristina Karamo is a community-college professor who rose to prominence claiming she witnessed election fraud in Detroit during the 2020 election.",
    "County officials discovered discrepancies due to human error and quickly resolved the matter, but DePerno nevertheless nurtured the argument into a full-blown conspiracy.",
    "The election wasn't stolen, and we need to believe in the election system that we have,? said Aaron Miller, a former Republican statehouse member from St. Joseph County.",
    "The party conducted a hand-count audit? of the convention's nominating votes, a nod to the never-ending demand that the 2020 presidential results get the same treatment.",
    "Quite a few, it turned out, proved by the fact that DePerno failed to meet the required 50 percent threshold necessary for securing the nomination on the first ballot.",
    "Trump's claims are false, but the power of the respective would-be offices to comply with his wishes is real, Brewer, the Democrat and election-law expert, explains.",
    "The result validated not only Trump's presumption but also his reason for backing them: their elevation of false claims of widespread fraud during the 2020 election.",
    "John Yob, a strategist for DePerno's campaign, told me he expects the issue to strike less of a chord with primary voters who seem otherwise fixated on the economy.",
    "The worry, skeptics said, is that running candidates so strongly associated with a baseless claim will hamper Republicans in a year that looks ripe for the taking.",
    "Amid the sea of red baseball caps, I noticed many of the Trump die-hards had traded Make America Great Again? for Trump Was Right? in the same signature serif.",
    "Attorney General candidate Matt DePerno is an attorney who gained acclaim for pursuing litigation against election results in counties throughout Michigan.",
    "John Lauve, a former gubernatorial candidate, choked back tears to call the party leadership amateurs? and express how unacceptable? the process had been.",
    "Michigan is one of the worst on election fraud and corruption, and they will put an end to it,? the former president said in his premature victory lap.",
    "After her victory in the first round of voting, Karamo had been allowed to take the stage and encourage the room to vote for DePerno in the runoff.",
    "Dozens of protesters showed up at the secretary of state's house in December to demand their claims of widespread voter fraud be taken seriously.",
    "In Macomb County, Republicans nominated a woman who tweeted that Trump should have military tribunals to investigate claims of election fraud.",
    "A pair of Donald Trump acolytes were seeking the nominations for attorney general and secretary of state against less extreme alternatives.",
    "As attorney general, DePerno could bypass the state's election administrators to order whatever audit of results he desires.",
    "He's been attacking these election crimes, the greatest crime in history,? Lindell told me in praise of Trump's endorsee.",
    "Trump has thrown his weight behind other secretary of state nominees in key swing states, including Georgia and Arizona.",
    "We should be highlighting and celebrating your Administration's many accomplishments,? she wrote in a letter to Trump.",
    "He sued Antrim County after the election, arguing that Dominion Voting Systems had rigged the election against Trump.",
    "Trump himself was holding a rally 300 miles south, in central Ohio, remembering to praise U.S. Senate candidate J.D.",
    "Michigan GOP state senators gave up the fight last June with a report that claimed no election fraud had transpired.",
    "Karamo could also appoint an election conspiracist to the traditionally nonpartisan job of state election director.",
    "It fits a pattern playing out in other states where Trump lost and lobbed baseless accusations of foul play.",
    "DePerno had been a tax attorney until he took a shine to election law in the aftermath of the 2020 election.",
    "But after years of railing against rigged elections, delegates privately admitted this wasn't a great look.",
    "At the end of the night, former Michigan GOP chair Laura Cox tweeted her dismay over how the day unfolded.",
    "A chaotic convention, disenfranchised delegates and no unity.? Maddock, the current co-chair, shot back.",
    "Michigan has been a hot spot for election conspiracies since before 2020's ballots were fully counted.",
    "Roughly 2,000 Michigan Republicans had convened to choose their nominees for key statewide offices.",
    "Michigan certified its election results in late November, but election-denying efforts continued.",
    "But election deniers are working at multiple levels of government to have their people in place.",
    "A crisis for democracy this was not  it was an inconvenience at best and quickly remedied.",
    "Twenty-one GOP candidates for secretary of state have challenged the 2020 election result.",
    "In the end, it was the establishment who left feeling like the outcome was rigged.",
    "What can you do, Mark, to get this going in Michigan?? Trump asked him.",
    "And then, of course, there were the victorious candidates themselves.",
    "In his stead, Grand Rapids got lesser stars in the Trump firmament.",
    "Vance in between tirades on the evils of low water pressure.",
    "Trump, though, has not, nor have the state's MAGA devotees.",
    "Put your drink down, Laura,? Maddock wrote in reply.",
    "Winning isn't something you would understand.?"
  ]
}