{
  "id": 55,
  "mediaId": 151,
  "date": "d2022-02-20T16:45",
  "headline": "POLITICO Playbook: Harris declares unity,' while Zelenskyy accuses appeasement'",
  "image": "https://static.politico.com/d4/1f/0c11287f48f8a5ab7772bb4a171c/220220-zelenskyy-harris-ap-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/02/20/harris-declares-unity-while-zelenskyy-accuses-appeasement-00010389",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    895,
    1901,
    1969,
    2030,
    3094,
    328,
    403,
    2567,
    2629,
    2744,
    2888,
    2942
  ],
  "sentences": [
    " What's worrying Texas Dems: From Laredo, NYT's Edgar Sandoval writes of a parade of Latino voters who are changing the political fabric of South Texas.? In particular, more and more voters are spurning Dem candidates over views on aborton, and are worrying Democratic leaders, whose once tight grip and influence on the Texas-Mexico border region has loosened in recent electoral cycles.?\n Related reading: FBI raid, redistricting throw Texas Democrats' re-election chances into doubt,? by NBC's Suzanne Gamboa, also in Laredo\nPOLICY CORNER\nHOW IT HAPPENED  NYT's Kate Kelly has a look at one unique way lobbyists found to get their priorities into the bipartisan infrastructure bill: In the middle of the infrastructure bill negotiations last year, with the pandemic still limiting in-person meetings, the lobbyist MARTIN T. WHITMER JR. found a creative way to get in front of lawmakers with a message from his client, the asphalt industry: He pulled a pair of collapsible lawn chairs out of his trunk and invited lawmakers to meet with him in a park near the Capitol.",
    "The Atlantic's Gary Kamiya is the latest to take on The Meaning of San Francisco's School-Board Recall.? Republicans, he says, believe the results show that the Democratic Party is out of step not just with Republicans, but with its own constituents, while [p]rogressives rejected such conclusions, insisting that the recall was simply about competence and was driven by an only-in-San-Francisco set of circumstances.? His conclusion is that the truth lies somewhere in between, but closer to the conservative view.? He adds, At a minimum, the recall demonstrates that woke' racial politics have their limits, even in one of the wokest cities in the country.?\nSan Francisco Mayor LONDON BREED, who endorsed the recall and will appoint three replacements for the recalled commissioners, had this to say on Meet the Press: My take is that it was really about the frustration of the board of education doing their fundamental job.",
    "In interviews, they castigated the Biden administration for placing their loved ones into such a dangerous situation and said that the Marines who survived the explosion told them they endured a firefight afterward  claims the Pentagon has dismissed.?\nSIX MONTHS LATER  From AP's Ben Fox: The last of thousands of Afghan refugees who awaited resettlement at eight U.S. military installations departed Saturday from a base in New Jersey, completing a journey that started with the chaotic evacuation from Kabul in August.?\nTRUMP CARDS\nTRUMP EYES BUSINESS WITH SAUDIS  Sources tell WaPo's Josh Dawsey and Jonathan O'Connell that former President DONALD TRUMP's company is angling to host events at his golf courses for the controversial Saudi golf league, potentially handing Trump a lucrative business partnership with an oppressive regime he defended as president.",
    "HAPPY BIRTHDAY: Senate Minority Leader Mitch McConnell (8-0)  Doug Mills  Mark Knoller  Chris Cillizza  Trevor Noah  David Corn  Bob Davis  POLITICO's David Cohen, Juan Perez, Elana Zak, Carmen Paun and Joseph Kenol  Tamara Fucile  Greg D'Angelo  Andrew Hanna of Senate Foreign Relations  Jason Moyer  Caleb Fisher  Arc Initiatives' Aaron Wells  Kaylin Dines  Michael Zona of Bullpen Strategy Group  David Blair  Keosha Johnson  Vox's Dylan Matthews  Miguel Rodriguez of the Gates Foundation  Andrew Baumann  Dan Gross  Amy Spitalnick  Stu Spencer (95)  Ashkon Eslami  Herald Group's Julianne Haggerty  Michael Clemente\nDid someone forward this email to you?",
    "And while roads were always likely to be a key focus of the legislation, the lobbying effort provided the industry a chance to promote what it cast as its environmental consciousness, making funding it more palatable to lawmakers who were concerned about road building fueling climate change.?\nAMERICA AND THE WORLD\nGOLD-STAR FAMILIES QUESTION PENTAGON REPORT  The attack at Hamid Karzai International Airport's Abbey Gate was not preventable, the Pentagon determined, though critics of commanders' decision-making have said the entry point was especially vulnerable and questioned why it was left open.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nALL POLITICS\nHOW TRUMP LOOMS IN 2022 GOP PRIMARIES  Even as former President DONALD TRUMP plays the role of 800-pound gorilla in the GOP, a number of Republican candidates are finding that his support or opposition isn't necessarily the be-all, end-all in this year's primaries:\n For pro-impeachment Republicans: The remaining seven House Republicans who voted to impeach Donald Trump are facing down a vengeful former president, his angry supporters and a summer of primaries.",
    " We believe President Putin has made the decision, but until the tanks are actually rolling and the planes are flying, we will use every opportunity and every minute we have to see if diplomacy can still dissuade President Putin from carrying this forward.?\n On potential sanctions, on NBC's Meet the Press?: Until the tanks are rolling and the planes are in the air, we're going to try everything we possibly can to get President Putin to reverse the decision we believe he's made and to dissuade him.",
    "More from The Washington Post\nDispatches from the frontlines:\n WaPo: In Ukraine's war-weary east, intensifying shelling and battered homes signal attempts at provocation by Russia.?\n WSJ: Russian Proxies in Eastern Ukraine Mobilize Troops, Kill Two Ukrainian Soldiers?\n NYT: As shelling intensified in eastern Ukraine, a seemingly routine press tour turned into a frantic rush to safety.?\nTHE SHOWS  Biden officials blanketed the Sunday shows.",
    "And, notes Bloomberg's Jennifer Jacobs, Johnson shared intelligence from a Friday briefing President JOE BIDEN gave to allies: You're looking at not just an invasion through the east, through the Donbas, but according to the intelligence that we're seeing, coming down from the north, down from Belarus, and actually encircling Kyiv itself, as Joe Biden explained to a lot of us,? Johnson said.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "POLITICO Playbook: Harris declares unity,' while Zelenskyy accuses appeasement'\nBy RYAN LIZZA\n02/20/2022 11:45 AM EST\nPresented by\nDRIVING THE DAY\nDIVISIONS BETWEEN U.S. AND UKRAINE  At the Munich Security Conference on Saturday, Ukrainian President VOLODYMYR ZELENSKYY delivered a speech peppered with criticism about the West's response to Russian meddling in Ukraine over many years.",
    "Zelensky's remarks contrasted with Vice President KAMALA HARRIS's portrayal earlier in the day of a united and vigorous NATO alliance that had shown its resolve at a time when Europe's security was under direct threat.'?\nHARRIS RESPONDS  Harris, who met with Zelenskyy on Saturday, took questions from reporters in Munich this morning for 16 minutes before returning to the States.",
    " Three good reads today dissecting the continuing recalibration of Democrats as they face an ugly midterm environment:\nJAMES CARVILLE, DAVID AXELROD and STAN GREENBERG talk to NYT's Maureen Dowd, who asks, Can Dems Dodge Doomsday??\nIn The LBJ delusion about Biden,? historian Timothy Naftali, writing for CNN, explains why comparisons of Biden to LYNDON JOHNSON were always wrong.",
    "Officials from LIV Golf Investments, the apparatus funded by the Saudis to host the tour, have held conversations with the Trump Organization.?\n ICYMI, here's PGA pro PHIL MICKELSON on the Saudi effort: They're scary motherf---ers to get involved with,' Mickelson told author ALAN SHIPNUCK, who posted an excerpt of his upcoming book, Phil: The Rip-Roaring (and Unauthorized!)",
    "Today in Ukraine is the Day of the Heroes of the Heavenly Hundred, a commemoration of the activists killed by the country's former pro-Russia government in 2014 during the Euromaidan protests, which were sparked by the government's decision to abandon its orientation towards Europe and which accelerated Russia's meddling in Ukraine.",
    "And it may have disastrous implications for the party in the fall of what otherwise looks like a favorable year for Republicans across the electoral map, undercutting fundraising and turnout efforts in the GOP's bid to reelect Sen. RON JOHNSON and to unseat the state's Democratic governor, TONY EVERS.?\nQ NO LONGER ANON?",
    "Johnson said the current sanctions strategy would ensure any lightning war,' even if initially successful, doesn't pay off' over time.?\nBut Johnson also noted some agreement with Zelenskyy: The lesson of [the Russian seizure of Crimea from Ukraine in] 2014 is that you can't just let Vladimir Putin get away with it.\"",
    "And, you know, the decisions that he's making now will bring about a lot of pain and suffering on his comrades in Russia.?\nPentagon press secretary JOHN KIRBY on Fox News Sunday,? on potential sanctions: If you punish somebody for something they haven't done yet, then they might as well just go ahead and do it.",
    " In the battle for the GOP nod for AG: Sitting AG KEN PAXTON leads with 39% to 25% for Land Commissioner GEORGE P. BUSH, 13% for former Texas Supreme Court Justice EVA GUZMAN and 7% for Tyler congressman LOUIE GOHMERT.? The primary is on March 1, and if no candidate reaches 50%, there will be a runoff in May.",
    "A GOP CIVIL WAR IN WISCONSIN  Though most Republican state parties have become subsidiaries of Mar-a-Lago, the Wisconsin GOP has not  and the reluctance of the state GOP establishment to fully embrace Trump's election fraud lie is leading the party to tear itself apart, David Siders writes from Milwaukee.",
    " In a Republican district that has shown signs of trending purple in recent election cycles, especially after voters here elected a Democrat for the first time in nearly 40 years in 2018, what kind of impact does a Trump endorsement have in a South Carolina GOP primary in a suburban district such as this?",
    "The contribution, detailed in a new campaign finance filing from Opportunity Matters Fund, is the latest  and largest  step in a budding political relationship between the senator and the Oracle chair.?\nBEYOND THE BELTWAY\nDEEP IN THE HEART  A new Dallas Morning News/UT-Taylor poll gives GOP Gov.",
    "So we're holding that in abeyance, and we're hoping that that could affect the calculus of Mr. Putin.?\n On what the U.S. has offered in negotiations with Russia: We have made serious proposals and talked about changing, for instance, the scope and scale of some of our exercises in Europe.",
    "The seven spent 2021 priming for battle, stockpiling campaign cash, seeing which local activists could be mollified and, in some cases, preparing for their first tough election in years.?\n For Republicans Trump dislikes for other reasons: Rep. NANCY MACE (R-S.C.) is an object example.",
    "At least: the annexation of Crimea and aggression against my state.?\nAs part of a plea for the latest weapons, machinery and equipment for our army,? he cast a Russian attack on Ukraine as a threat not just to his country, but to Europe and the entire global security architecture.",
    "Jill Biden has named a decorator for her East Wing office: Mark D. Sikes, a seasoned designer who grew up in the Midwest and works with A-list clients including Reese Witherspoon.?\nGabby Giffords is doing better and going home after being hospitalized for appendicitis.",
    "Here's what they said\nSecretary of State ANTONY BLINKEN on CNN's State of the Union? on where things stand: Everything leading up to the actual invasion appears to be taking place, all of these false flag operations, all of these provocations to create justifications.",
    "There are likely two authors of the Q texts: (1) PAUL FURBER, a South African software developer  played the lead role in writing them.? (2) RON WATKINS, who operated a website where the Q messages began appearing in 2018 and is now running for Congress in Arizona.",
    "This is your contribution to the security of Europe and the world.?\nZelenskyy also made a new plea for accession to NATO, asking for clear and comprehensive timeframes for joining the Alliance,? which Putin has cited as a redline that Ukraine can never cross.",
    "Biography of Golf's Most Colorful Superstar' ... They killed [Washington Post reporter and U.S. resident JAMAL] KHASHOGGI and have a horrible record on human rights,' Mickelson continued, in an interview that Shipnuck said took place in November.",
    "Will a NIKKI HALEY endorsement matter more??\n For Republicans running against Trump-backed candidates: There may be a way to thread the needle, as KATIE BRITT is doing in her race against Trump-endorsed Rep. MO BROOKS for Alabama's Senate seat.",
    "And depending on what happens in the coming days, we will reevaluate the need that Ukraine has and our ability to support.?\nZelenskyy complained that if the U.S. believes a Russian attack is imminent, then it should implement sanctions now.",
    "CASH DASH  Tech billionaire LARRY ELLISON gave a massive $15 million donation to a super PAC aligned with Sen. TIM SCOTT (R-S.C.) in January, one of the biggest political donations of the 2022 election cycle so far,? Scott Bland writes.",
    "(More from Catherine Kim)\nDefense Secretary LLOYD AUSTIN on ABC's This Week,? on potential Russian sanctions: The sad part about this  is that it may not affect Mr. Putin to the degree that it's going to affect the average Russian.",
    "He warned a war would be bloody and protracted? and had this dire assessment: I'm afraid to say that the plan we are seeing is for something that could be really the biggest war in Europe since 1945, just in terms of sheer scale.\"",
    "For some of the other families of those killed that day, the release this month of a U.S. military investigation examining the attack has caused them to question whether Defense Department officials distorted its findings.",
    " Mr. Watkins appears to have taken over from Mr. Furber at the beginning of 2018.? Though both deny writing as Q, Watkins semi-admitted his authorship in an interview for last year's Q: Into the Storm? documentary on HBO.",
    ": I'm gonna win without him.? Writes Byrd: As the intensity of the Republican primary in South Carolina's 1st Congressional District starts to come into focus, one major question is already looming over the entire race.",
    " NYT's David Kirkpatrick reports that two independent teams of forensic linguists have used machine learning to study the mysterious messages authored by the anonymous Q? that sit at the heart of the conspiracy theory.",
    "Period.?\nWHAT BIDEN TOLD BORIS  Hannah Brenton, our colleague in Europe, reports that in an interview with the BBC today, U.K. PM BORIS JOHNSON pushed back on accusations of appeasement? made by Zelenskyy.",
    " As soon as you trigger the sanctions, any deterrent effect they may have is gone.?\n Blinken said his meeting with Russian Foreign Minister SERGEY LAVROV is still on for this week, barring an invasion.",
    "And before she spoke, she confirmed that she met Trump at Mar-a-Lago earlier this week (a scoop Rachael brought you on Thursday)  which seems to have put Brooks on the defensive in his own speech.",
    "And their government.?\nA reporter pressed her: But if Putin has made up his mind, do you feel that this threat that has been looming is really going to deter him??\nAbsolutely,? Harris said.",
    "At the state GOP's winter meeting on Saturday, Britt praised Trump for what she said was his strength as a commander in chief, comparing him to RONALD REAGAN,? AL.com's Mike Cason reports.",
    "Because this is a once-in-a-lifetime opportunity to reshape how the PGA Tour operates.'?\nPLAYBOOKERS\nQueen Elizabeth II has tested positive for Covid-19, and is experiencing mild symptoms.",
    "Within the $1 trillion of spending authorized by the infrastructure legislation that President Biden signed in November, the asphalt industry may ultimately receive the biggest share.",
    "WHY TODAY COULD BE THE DAY  Several analysts have noted that February 20 is a crucial day on the calendar that could mark the launch of an attack by Putin:\nThe Olympics are ending.",
    "Harris's message was NATO unity in the face of Russian aggression, but she was pressed on the divisions between the West and Ukraine that were exposed by Zelenskyy's fiery speech.",
    "He uttered the A-word and pointedly asked, What are you waiting for??\nIt was here 15 years ago that Russia announced its intention to challenge global security,? Zelenskyy said.",
    "Zelenskyy asked European nations to develop an effective package of preventive sanctions to deter aggression,? rather than waiting to implement sanctions after Putin invades.",
    "Yvette Herrell weighed in on the Canadian trucker protests: Just as we provide asylum for political prisoners, we should do the same for truckers,? the congresswoman tweeted.",
    "Asked, Is there anything new that you're planning to offer Ukraine?? Harris was non-committal: What I made clear in our meeting is that, again, this is a dynamic situation.",
    "The city as a whole was upset, and the decision to recall school board members was a result of that.?\nBIDEN'S SUNDAY  The president has nothing on his public schedule.",
    "We appreciate any help, but everyone should understand that these are not charitable contributions  These are not noble gestures for which Ukraine should bow low.",
    "So far, we have silence instead  And as long as there is silence, there will be no silence in the east of our state.?\nNYT's Roger Cohen and David Sanger note, Mr.",
    "As the president has said,? Harris told reporters just minutes after saying the threat of sanctions will deter Putin, we believe that Putin's made his decision.",
    "The large-scale military exercises between Russia and Belarus were to conclude today, but now  ominously  the estimated 30,000 Russian forces will remain there.",
    "A reporter referenced his argument and asked, If you believe [Russian President VLADIMIR] PUTIN has made up his mind, what leverage do you really have?",
    "It is directed at institutions  in particular, financial institutions  and individuals, and it will exact absolute harm for the Russian economy.",
    "Playbook couldn't happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "After rattling off a list of what Ukraine wanted from the West, he chastised the assembled leaders: All these questions need answers.",
    "He also said that the war may have already started, per the BBC: \"All the signs are that the plan has already in some senses begun.\"",
    "It's an unusual level of dysfunction for a state party that not so long ago was regarded as a model for conservatism nationally.",
    "Others, like Michigan's PETER MEIJER and FRED UPTON, face Trump-backed candidates with steep uphill odds in new districts.",
    "The Americans were due to close the gate for the final time within a matter of minutes,? WaPo's Dan Lamothe reports.",
    "We have certainly put forward other proposals to try to convince Mr. Putin that we're serious.?\nGood Sunday morning.",
    "At least two of Trump's courses in Bedminster, N.J., and Doral, Fla., could be named as sites for the nascent tour.",
    "These are some of the greatest sanctions, if not the strongest that we've ever issued, as I articulated yesterday.",
    "SPOTTED: Seymour Hersh playing tennis on Saturday afternoon at the Pauline Betz Addie Tennis Center in Bethesda.",
    "GREG ABBOTT a 7-point lead (45%-38%) over Democrat BETO O'ROURKE in this year's likely gubernatorial matchup.",
    "And that is to make sure that our children are getting educated, that they get back into the classroom.",
    "HARRIS' SUNDAY  The vice president left Munich at 7:30 a.m. Eastern time to head back to Washington.",
    "But that answer contradicts repeated American predictions that Putin has already decided to invade.",
    "The purpose of the sanctions has always been and continues to be deterrence,? she said.",
    "Worth noting: That 7-point lead is down from January, when Abbott led by 11 (47%-36%).",
    "She put her approach to Trump plainly in an interview with The State's Caitlin Byrd.",
    "But let's also recognize the unique nature of the sanctions that we have outlined.",
    "Rep. DAVID VALADAO (R-Calif.) has not yet garnered a Trump-endorsed challenger.",
    "Why not put those sanctions in place now??\nHarris got tangled in her answers.",
    "[We would be] willing to talk about offensive missile capabilities in Europe.",
    "TRANSITION  Stephen Kent is now director of operations at Echelon Insights.",
    "We will defend our land with or without the support of partners,? he said.",
    "Whether they give us hundreds of modern weapons or 5,000 helmets.",
    "Their message: We're ready for the fight,? Ally Mutnick reports.",
    "tough re-election gets the most attention, it's an outlier.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "He previously was a host for Al Jazeera's Rightly.",
    "Knowing all of this, why would I even consider it?",
    "Send Playbookers tips to playbook@politico.com.",
    "They execute people over there for being gay.",
    "\nThe strategy appears to have paid off.",
    "The Munich Security Conference is over.",
    "Though Rep. LIZ CHENEY's (R-Wyo.)",
    "All of that is already in train.",
    "Thanks for reading Playbook.",
    "How much will Trump matter?",
    " We failed our children.",
    "And that did not occur.",
    "What did the world say?",
    "Parents were upset.",
    "Their conclusion?",
    "WHAT WENT WRONG?",
    "Sign up here.",
    "Appeasement.",
    "Result?"
  ]
}