{
  "id": 63,
  "mediaId": 151,
  "date": "2/2/2022 12:00:00 AM",
  "headline": "House Republicans close money gap in hunt for the majority",
  "image": "https://static.politico.com/79/fc/7a4d79294507b103afe118598735/https-delivery.gettyimages.com/downloads/1231044822",
  "link": "https://www.politico.com/news/2022/02/02/house-republicans-money-gap-democrats-00004682",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    774,
    1139,
    1901,
    2231,
    2428,
    2510,
    3085,
    3094,
    183,
    255,
    562,
    2621,
    2707
  ],
  "sentences": [
    "Some good news for Democrats: money in the bank\nHouse Democratic incumbents still have a large cash-on-hand advantage in many key districts, including those held by Rep. Katie Porter (D-Calif.), who has a whopping $16.1 million; Rep. Antonio Delgado (D-N.Y.), who has $5.5 million; and Rep. Elissa Slotkin (D-Mich.), with $4.5 million.",
    "The exterior of the U.S. Capitol building is seen at sunrise on February 8, 2021 in Washington, D.C. | Sarah Silbiger/Getty Images\nBy Ally Mutnick and Allan James Vestal\n 02/02/2022 02:16 PM EST\nHouse Republicans spent 2021 erasing Democrats' fundraising advantage  now they are overtaking them.",
    "The GOP has a big advantage in open battleground seats\nGOP candidates were the top-raising candidates in many of the most competitive open seats, including Colorado's newly drawn 8th district and the districts held by retiring Reps. Ann Kirkpatrick (D-Ariz.) and Charlie Crist (D-Fla.).",
    "Stark cash disparities emerge in incumbent-versus-incumbent races\nSome 10 incumbents are potentially facing off in member-versus-member primaries, thanks to redistricting drawing them into the same seats  and most are not evenly matched financially.",
    "In West Virginia, GOP Rep. David McKinley trounced fellow Republican Rep. Alex Mooney in fourth-quarter fundraising, raising $1.1 million to Mooney's $200,000  though Mooney does still have more cash on hand.",
    "Buoyed by small-dollar donors, their candidates are outraising Democrats in several key races and turning a favorable political environment into a cash windfall with just nine months until Election Day.",
    "Not all of those candidates who raised large sums last quarter are in competitive races, but the fact that they have tapped the online fundraising spigot is an ominous sign for the Democratic majority.",
    "Meanwhile, Democratic candidates also managed to raise more than GOP Reps. Nicole Malliotakis in New York and Andy Harris in Maryland  two prime pickup Democratic pickup opportunities in blue states.",
    "Another cash dash to watch: In South Texas, embattled Democratic Rep. Henry Cuellar outraised his liberal challenger Jessica Cisneros, $697,000 to $362,000, ahead of their March 1 primary.",
    "A telling statistic: At least 53 Republicans raised over $500,000 last quarter, compared to 38 Democratic candidates, according to a POLITICO analysis of Federal Election Commission data.",
    "Republicans didn't need a cash influx to pick up a dozen seats: In 2020, their candidates were outspent on TV and still managed to cut down the Democratic advantage in the House.",
    "And only a few of Democrats' most vulnerable incumbents were outraised by a GOP challenger: Rep. Jared Golden (D-Maine), Marcy Kaptur (D-Ohio) and Rep. Greg Stanton (D-Ariz.).",
    "Rep. Fred Upton (R-Mich.), who still hasn't revealed whether he will retire in 2022 and could be in a member-vs-member race with Rep. Bill Huizenga (R-Mich.), raised $726,000.",
    "Republican impeachment backers stock their accounts for primary battles\nNone of the seven pro-impeachment Republicans seeking reelection were outraised by a challenger.",
    "In the northwest Illinois district of retiring Democratic Rep. Cheri Bustos, Republican Esther Joy King raised $640,000 but no Democratic candidate cleared $115,000.",
    "In Rep. Ron Kind's (D-Wis.) now-open battleground, Republican Derrick Van Orden raised over $830,000, more than double the total of any of the Democratic candidates.",
    "And in suburban Atlanta, Rep. Lucy McBath (D-Ga.) outraised Rep. Carolyn Bourdeaux (D-Ga.) by $315,000 and she has about $450,000 more in her campaign account.",
    "Back in the fourth quarter of 2019  the same point in the last election cycle  some 60 Democrats raised more than $500,000, but only 27 Republicans did.",
    "In the third quarter of 2021, a roughly equal number of candidates (48 Republicans and 45 Democrats) from each party cleared the half-million mark.",
    "Another problem spot for Democrats: the purple South Texas district that Rep. Vicente Gonzalez left open when he moved to a neighboring district.",
    "In Illinois, Democratic Rep. Sean Casten doubled the haul of fellow Democratic Rep. Marie Newman and has $1 million more in the bank.",
    "In Michigan, Democratic Rep. Haley Stevens outraised Democratic Rep. Andy Levin and has some $900,000 more in cash-on-hand.",
    "New campaign finance reports this week paint an encouraging picture of the GOP's chances of recapturing the House majority.",
    "Rep. Tom Rice (R-S.C.) was the lowest of the pack, with a $155,000 quarter  but he's got some $1.9 million in the bank.",
    "Here are the other major takeaways from the latest round of campaign finance numbers in the battle for the House.",
    "pulled in the most, with a staggering $2 million, nearly five times as much as challenger Harriet Hageman.",
    "Republican Monica De La Cruz raised some $560,000 last quarter; no Democrat raised more than $110,000.",
    "Former President Donald Trump endorsed one of his challengers, state Rep. Russell Fry, on Tuesday.",
    "Many or all will have tough primaries to contend with, but money shouldn't be a problem for them.",
    "The reports also made clear that swing-seat retirements have left Democrats in a tough place.",
    "That was already a sign of GOP momentum as President Joe Biden's approval rating shrank.",
    "That's an unfamiliar gap for House Democrats, who have long enjoyed a financial edge.",
    "But Republicans have been steadily gaining on them for months.",
    "Fellow Michigan Republican Rep. Peter Meijer raised $529,000.",
    "Rep. Liz Cheney (R-Wyo.)"
  ]
}