{
  "id": 69,
  "mediaId": 323,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Thousands of Afghans Face Narrow Path to Gain Entry to U.S.",
  "image": "https://images.wsj.net/im-476026?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/thousands-of-afghans-face-narrow-path-to-gain-entry-to-u-s-11643727602",
  "sentiment": "0.0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michelle Hackman",
  "authorUrl": "",
  "termIds": [
    1901
  ],
  "sentences": [
    "Now, we are prioritizing SIV and [refugee] processing as primary immigration pathways because they provide a durable immigration status upon entry.?\nStill, the denials are raising difficult questions about how the U.S. should handle the wave of refugees its departure from Afghanistan createdand what they should do if the U.S. can't, or won't, take them all.",
    "My only hope is to live and help my children get to a better place.'?\n  Fahima, an Afghan mother with three teenagers now living illegally in Pakistan\nRep. Peter Meijer (R., Mich.) said there was a tremendous amount of confusion? about which path Afghans should try to reach the U.S. We know there are these other programs that can take years.",
    "A Photographic Journal Along Afghanistan's Main Highway\n Joel van Houdt for The Wall Street Journal\nAs an employee of an international organization, Fahima, who asked that only her first name be used, isn't eligible for a Special Immigrant Visa, designed for Afghans who worked alongside the U.S. government in its two-decade war.",
    "This is a continuing humanitarian crisis, and the United Statesas well as other nationsneed to put in place more ways to make it possible for resettlement,? said Doris Meissner, the top immigration official under the Clinton administration who now works for the Migration Policy Institute, a nonpartisan Washington think tank.",
    "The Biden administration has used it in several other instances, including bringing about 13,000 migrants placed into the Trump-era Remain in Mexico program to the U.S. and allowing parents who were separated from their children at the border and deported to return.",
    "Government officials say that they have been consistent in their application of the humanitarian program and that members of Congress and advocates were wrong to direct so many Afghans to a program that has always been tough to qualify for, giving them false hope.",
    "The administration used humanitarian parole as the primary immigration vehicle during and immediately after the [evacuation] in order to move Afghans quickly given the exigent circumstances,? a senior administration official said in a statement.",
    "U.S. officials have continued to evacuate some Afghans from the country, and they are now weighing setting up an expedited refugee-processing center in Qatar to process Afghan refugees, according to three people familiar with the matter.",
    "It's just that there's no other option.?\nRefugee advocates say the Biden administration's approach after the evacuation has been too narrow, drawing a contrast to how they have approached the refugees already on U.S. soil.",
    "To qualify, Fahima's denial notice said, she would have needed to demonstratewith documentationthat she faces immediate and targeted danger, a standard she was less likely to clear after she left Afghanistan.",
    "After several failed attempts to enter the Kabul airport in August, Fahima and her children escaped to Pakistan, where they are now living illegally in a small, rented room on the outskirts of Islamabad.",
    "They are the unlucky ones who missed a brief window when, during the chaotic evacuation from the Kabul airport in August, the U.S. airlifted more than about 80,000 Afghans with Western ties to safety.",
    "Why would we arbitrarily close the door just because the evacuation ended??\nMost immigration-law experts agree the president has broad latitude to allow anyone into the country using the authority.",
    "They say it doesn't make sense to prioritize bringing refugees to the country through a program that gives them only temporary permission to be here and doesn't lead to a green card.",
    "PREVIEW\nSUBSCRIBE\nSuch a program likely wouldn't be much help to Afghans who haven't yet found an escape route, or for others stranded in nations unwilling to host them long term.",
    "Traditionally, it has been used sparingly, granted to about 500 people a year in emergency situations, including receiving specialized medical treatment only available in the U.S.",
    "The administration has also laid out priorities for resettlement, with immediate family members of U.S. citizens and applicants to the Special Immigrant Visa program at the top.",
    "Photo: Bulent Kilic/AFP/Getty Images (Video from 10/6/21)\nWrite to Michelle Hackman at michelle.hackman+1@wsj.com\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "My only hope is to live and help my children get to a better place.?\n Earlier\n The Taliban have been trying to project an image of safety and normalcy since retaking power.",
    "A rarely used U.S. immigration program has come under immense strain as tens of thousands of Afghan refugees turn to it as their only hope to seek safe passage to the U.S.",
    "After the 1975 fall of Saigon, the U.S. accepted about 900,000 Vietnamese refugees over the next two decades under what was called the Orderly Departure Program.",
    "But in the months following the airlift, refugee advocates, members of Congress and even some U.S. government officials urged Afghans to try the tiny program.",
    "Thousands of Afghansfrom former military officials to employees of Western nonprofits, women's rights activists and religious minoritiessent in applications.",
    "We were hoping to see a similarly generous grant of status,? said Jill Marie Bussey, director for public policy at Lutheran Immigration and Refugee Services.",
    "It was an attractive option for people like Fahima, a single mother of three teenagers who fled the western Afghan city of Herat when the Taliban took over.",
    "Earlier this year, they set up a program designed to bring in children from Central America with family in the U.S. legally using humanitarian parole.",
    "In August, her cousin in the U.S. and several former World Bank colleagues pooled $2,300 to cover the cost of four humanitarian parole applications.",
    "But that program would likely cater only to Afghans eligible for Special Immigrant Visas or those who have immediate family members in the U.S.",
    "But as WSJ's Sune Rasmussen reports from Kabul, harsh punishments, violence, and a crackdown on basic freedoms are becoming the reality.",
    "Of the 76,000 evacuated Afghans who have been brought to the U.S. so far, nearly all were admitted using a form of humanitarian parole.",
    "Of more than 40,000 Afghans who have applied to enter the U.S. on temporary humanitarian grounds, just 160 have been approved so far.",
    "And though she would likely qualify as a refugee, that process takes years under the best circumstancestime she doesn't have.",
    "In the meantime, she visits the store each day to buy bread and dates, the only food she can afford on dwindling savings.",
    "They say that they are attempting to stand up other avenues to accept more refugees, but that the effort will take time.",
    "More have made it to neighboring countries, often illegally, while they search for a permanent home to take them in.",
    "She says her ex-husband has threatened to sell their 18-year-old daughter to a Taliban fighter should she return.",
    "SHARE YOUR THOUGHTS\nIs the U.S. doing enough to assist people who have left or are trying to leave Afghanistan?",
    "The program, known as humanitarian parole, provides a path for foreigners to come to the U.S. without a visa.",
    "With each trip out, Fahima risks being discovered by the Pakistani authorities and deported to Afghanistan.",
    "Newsletter Sign-up\n In Today's Paper\n A complete list, with links, of every article from the day's Journal.",
    "The bored teens take turns playing games on her phone or flying a kite on the rooftop of their building.",
    "Most of the rest are likely to be denied under the standard U.S. immigration officials are applying.",
    "She doesn't have a U.S. citizen child, parent or sibling who could sponsor her for a green card.",
    "And, to support her children, she worked doing data entry for the World Bank.",
    "With her future in limbo, Fahima tries to focus on the tasks of daily living.",
    "She is divorceda potential target to become a bride to a Taliban fighter.",
    "She has also applied to go to Canada as a refugee but hasn't heard back.",
    "And there was always some expedited pathway being teased,? he said.",
    "Parole is totally inadequateeveryone knows that,? she added.",
    "They have now collided with the U.S. immigration system.",
    "Earlier this month, those applications were denied.",
    "We really don't know what to do,? Fahima said.",
    "Fahima was in danger for multiple reasons.",
    "She is Shia, a religious minority.",
    "We really don't know what to do.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Many are still in Afghanistan.",
    "Join the conversation below."
  ]
}