{
  "id": 79,
  "mediaId": 1546,
  "date": "1/12/2022 12:00:00 AM",
  "headline": "Few Afghan Refugees Relocating to US Under 'P-2' Program",
  "image": "https://gdb.voanews.com/E08041C1-6362-477D-9A52-302D97676D4D_w1023_r1_s.jpg",
  "link": "https://www.voanews.com/a/few-afghan-refugees-relocating-to-us-under-p-2-program/6394377.html",
  "sentiment": "0.0",
  "mediaOutlet": "VOA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Masood Farivar",
  "authorUrl": "https://www.voanews.com/author/masood-farivar/g_m__",
  "termIds": [
    1901
  ],
  "sentences": [
    "Asked what the State Department was doing to make the P-2 program work, the spokesman said, \"We continue to call for safe passage for all those who wish to leave Afghanistan, and we have been very public about advocacy to other countries to respect the principle of nonrefoulement and to allow entry for Afghans seeking protection.",
    "In early August, as a Taliban onslaught threatened to bring down the U.S.-backed government in Kabul and triggered a surge in demand for special immigrant visas, the State Department announced that at-risk Afghans ineligible for the SIV program could seek refugee status under a new Priority 2 designation.",
    "While the U.S. military is no longer present in Afghanistan, our mission there is not over,\" said Republican Representative Peter Meijer, who last year co-sponsored legislation that would expand the SIV program and ask the administration to prioritize the evacuation of P-2 applicants from Afghanistan.",
    "\"Hearing that only one percent of people have been able to leave the country and move to the next step, unfortunately, confirms our worst fears,\" said Betsy Fisher, director of strategy at International Refugee Assistance Project, a refugee advocacy organization based in New York.",
    "Only a tiny percentage of thousands of vulnerable Afghans seeking to move to the United States under a refugee resettlement program announced last summer have relocated overseas to begin the processing of their applications, according to unpublished State Department data.",
    "\"We still have interpreters and other Afghan partners who put themselves and their loved ones at risk now stranded in Afghanistan, and the chaotic and heartbreaking withdrawal that the world witnessed over the summer shows just how vulnerable they still are.\"",
    "But just over 350  a little more than 1% of all P-1 and P-2 applicants together  are identified as having been moved to a third country, including Pakistan and Turkey, where processing of their cases has begun, according to two people familiar with the data.",
    "\"The administration has told us in many, many different ways that the P-2 program is not a priority of theirs,\" said Katie LaRoque, senior manager for democracy, rights and governance at InterAction, an alliance of U.S.-based international NGOs.",
    "\"It clearly is not suited for a situation where people are being prevented from leaving,\" said a U.S. government official with access to the Afghan refugee data who asked to remain anonymous when discussing the program's challenges.",
    "Unprotected Afghans who do not meet the P-2 criteria may be referred under the State Department's pre-existing Priority 1 refugee program by the U.S. Embassy in Kabul, the U.N. High Commissioner for Refugees or a designated NGO.",
    "Although the United States and its allies evacuated more than 124,000 people from Kabul after the Taliban takeover, tens of thousands of other vulnerable Afghans who were left behind are struggling to find a pathway to safety.",
    "What is more, uncertainty over whether a case will be approved deters many from leaving the country, said a Kabul-based TV writer and producer who has been referred to the program by a U.S.-based nongovernmental organization.",
    "None of the proposals has gained public support from the Biden administration, which, according to refugee advocates, remains focused on evacuating American citizens, permanent residents and special immigrant visa holders.",
    "The Priority 2, or P-2, refugee program was meant to help relocate at-risk Afghans such as journalists and rights activists who were otherwise ineligible for special immigrant visas available to military interpreters.",
    "This week the United Nations launched a more than $5 billion funding appeal for Afghanistan, much of it aimed at direct payments to health workers and others, instead of financial support for the Taliban government.",
    "The government official cautioned that the actual number of people who have relocated to a third country could be higher, noting that some refuge-seeking Afghans may not have contacted the State Department yet.",
    "As a result, the vast majority of applicants to the refugee program, many of them journalists, human rights activists and aid workers, have remained stranded in Afghanistan facing an uncertain future.",
    "To be eligible, an individual must have worked in Afghanistan for the U.S. government, a U.S.-based media organization or nongovernmental organization, and must be referred by the U.S.-based employer.",
    "State Department data shared with VOA by a spokesman show that the department has received about 12,000 referrals to the Afghan P-2 refugee resettlement program and approximately 17,000 P-1 referrals.",
    "\"Without money, a job, and a house to live in, I simply cannot afford to wait for a process that could take years,\" said a veteran Afghan editor who is staying at a guesthouse in Islamabad, Pakistan.",
    "This quandary has led some frustrated refugee advocates to suggest that the administration should simply shut down the program if it can't find a way to help the applicants leave the country.",
    "\"Individuals with urgent protection needs should follow procedures to register for international protection and assistance with the government of the country they are in,\" the spokesman said.",
    "Logistical challenges frustrate P-2 applicants\nThe State Department has long recognized the difficulty many Afghans face in moving overseas to begin the processing of their refugee cases.",
    "Even those who have made it to a third country and received a status confirmation from the State Department complain about the exorbitant cost of an unpredictably long waiting time.",
    "For Afghans without appropriate travel documents to leave Afghanistan or the financial means to live in a third country, the requirement has proved to be an insurmountable obstacle.",
    "Applicants must first relocate to a third country where their applications are processed, a procedure that, according to the State Department, can take 14 to 18 months or more.",
    "But regardless of the designation, referral to the program came with a catch that has hindered the ability of most Afghans to take advantage of it.",
    "One is a decade-old special immigrant visa program open to military interpreters and others who worked on government-funded contracts.",
    "Of the total number of referrals, more than 4,200 have \"accepted\" status, meaning they have submitted all the required documents.",
    "Aid groups warn half the population faces acute hunger in what is one of the world's most quickly worsening humanitarian crises.",
    "\"I can try to sell everything I own and move to a third country but what if, at the end of the process, they reject my case?",
    "One proposal would expand the SIV program to allow employees of NGOs and other Afghans to apply for immigrant visas.",
    "Another would direct the State Department to prioritize the evacuation of P-2 applicants along with SIV applicants.",
    "Instead, they've been pressing the Biden administration to institute a number of changes to the program.",
    "\"I think it shows that there is a tremendous amount of work to be done to make this program work.\"",
    "Most lack passports to travel and money to live on for an extended period in a foreign country.",
    "Some advocates have pushed for financial support for P-2 applicants living in a third country.",
    "The other is a refugee admission program run by the State Department and other agencies.",
    "But even if more people have left, tens of thousands still are stranded in Afghanistan.",
    "Pushing for changes\nOthers, however, say shuttering the program is not a solution.",
    "There are two primary avenues for Afghans seeking to move to the United States.",
    "\"If this was a country where it was easy to get out, then P-2 would be fine.\"",
    "Supporters of the Afghan evacuation say they haven't given up the fight.",
    "the writer, who requested anonymity, said in a WhatsApp message to VOA.",
    "For P-2 applicants unable to leave Afghanistan, that's no comfort.",
    "VOA's Cindy Saine and Nike Ching contributed to this report.",
    "What do I do then?\""
  ]
}