{
  "id": 8,
  "mediaId": 43,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Highlights from The Downballot: Primaries heating up and why House Democrats should go on offense",
  "image": "https://images.dailykos.com/images/1025505/story_image/GettyImages-1236026214.jpg?1641857496",
  "link": "https://www.dailykos.com/story/2022/4/22/2093264/-Highlights-from-The-Downballot-Primaries-heating-up-and-why-House-Democrats-should-go-on-offense",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1901
  ],
  "sentences": [
    "And if you want to keep the gavel out of Kevin McCarthy's hands, this is the place to start.?\nThese 10 targeted U.S. House races are:\nAZ-01: David Schweikert (eastern Phoenix and suburbs)\nCA-22: David Valadao (southern Central Valley)\nCA-27: Mike Garcia (northern Los Angeles suburbs)\nCA-45: Michelle Steel (western Orange County)\nCO-08: OPEN (northern Denver suburbs)\nNC-13: OPEN (southern Raleigh suburbs)\nNE-02: Don Bacon (Omaha area)\nNY-01: OPEN (eastern Long Island)\nMI-03: Peter Meijer (Grand Rapids area)\nNM-02: Yvette Herrell (southern New Mexico)\nThe Downballot comes out every Thursday everywhere you listen to podcasts.",
    "So trying to play on Trump's the idea that he doesn't want to be a loser by instead saying, Well, Vance is going to lose even if you endorse him, so you better endorse me because I'm going to be the winner.'\nAll of this was unfolding in Ohio a week after Trump endorsed Dr. Mehmet Oz in the Pennsylvania Republican Senate race, to the consternation of many Republicans in the state who didn't want to see Oz be endorsed because he holds a number of views opposing conservative positions.",
    "we really don't want these people in charge of the House next year\nThis week on The Downballot, cohosts David Nir and David Beard talked about the bizarre situation unfolding with redistricting in Florida; looked into how Trump has inserted himself into even more GOP Senate primaries in Ohio and Pennsylvania; called out a democratic Senate candidate for running an offensive xenophobic ad; and previewed upcoming elections in France and Australia.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy House Democrats' best defense is a good offense\nThe Downballot\nFollowShare\n0:0044:11\n15301xApr 21, 2022\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nMaps in Florida will be drawn by Governor Ron DeSantis after after a protracted showdown between the governor and Florida's Republican lawmakers, who decided to abdicate their responsibility to draw legislative maps.",
    "As Beard noted with frustration that many Republicans there, particularly the other candidates, have been fighting hard for Trump's endorsementformer state treasurer Josh Mandel most notably:\nHe even made sort of a Hail Mary ahead of the endorsement when it became clear that it was happening, releasing a poll claiming that he would win for sure with Trump's endorsement.",
    "While these aren't necessarily the top 10 pickup targets for Democrats, Nir feels optimistic about these seats: They aren't the only possible pick-up targets for Democrats, but there are races that we feel, for a variety of reasons, represent a really good use of small dollar donor efforts that these are races where you'll get a good bang for the buck.",
    "While the Florida Supreme Court has gotten much more conservative over the years, it has also cracked down on GOP gerrymandering using these amendments in the previous decade, though the justices may be more inclined to be favorable toward DeSantis and the GOP particularly because DeSantis himself has appointed some of them, Nir noted.",
    "At the same time, Le Pen went after Macron for his proposed pension reforms that would raise the retirement age to 65 in France, which has been very unpopular, and which Macron has sort of halfway walked back to talk about compromises and things like that as he realized this was really a problem for his race.",
    "If you really want to help Americans who've been harmed by the decline in manufacturing and the outsourcing of jobs, telling them that you're magically going to roll back the clock to a better time is just not the way to do it.?\nNir and Beard wrapped up updates with another international election roundup.",
    "So this map gives the GOP a huge advantage.?\nMoreover, Nir pointed out that the way the map goes about doing this is what makes it even more troubling: Over a decade ago, Florida voters approved amendments to the state constitution to reform redistricting and crack down on gerrymandering.",
    "And as Politico wrote, The former president's endorsements have often added more chaos to these already contentious fights.' So it's really interesting to see this sort of division between Trump, who has these really idiosyncratic reasons for endorsing candidates [and other Republicans].",
    "This is what it takes for a Democrat to win.' But I want to point to a Washington Post piece by Dave Weigel exploring the ad and pointed out that former governor Ted Strickland, he's a Democrat, and when he ran for this same Senate seat in 2016, he relied on similar messages.",
    "Hate crimes against Asian Americans didn't spike because Donald Trump exhorted goon squads to terrorize individual people, they spiked because people like Trump sought to demonize China as a way to deflect blame for their atrocious handling of the coronavirus pandemic.",
    "That was the issue that came up a lot in the debate that happened just on Wednesday where Macron went after Le Pen for her party's loan from a Russian bank and really attacked her on her past contacts with Russia and support for Russia before the invasion of Ukraine.",
    "Beard stated that the entire premise of Ryan's ad relied on a falsehood and ultimately simply villainized one country and its people:\nThe particularly revealing aspect is that China isn't even the place where most manufacturing jobs are going overseas at this point.",
    "Of course, this huge GOP impasse that lasted for months and months benefits Republicans in another way, which is we have seen courts refuse to strike down or adjust unconstitutional or flawed maps because it's supposedly too close to the election to do so.",
    "The most salient future of DeSantis's map, according to Nir, is the demolition of the 5th Congressional District, a seat in north Florida that runs from Jacksonville to Tallahassee and is Democratic-leaning and contains a plurality of Black voters.",
    "The map itself is a total travesty,? Nir lamented, noting that it is an extreme GOP gerrymander that would create 20 seats carried by Donald Trump and just eight for Joe Biden, compared to the 15-12 advantage for Trump under the current map.",
    "There are a lot of Republican seats this year that actually present interestingly ripe targets for Democrats to potentially flip.?\nDaily Kos has assembled a slate of 10 races to raise funds for the eventual Democratic winner of the primary.",
    "Incumbent prime minister Scott Morrison is going to attempt to win a fourth consecutive election for the Liberal National Coalition while Anthony Albanese will try to win back power for the Labor Party after a decade in opposition.",
    "Nir thinks that this November could produce a number of surprises, especially due to redistricting and gerrymandering, and not to write this cycle off completely for Democrats just yet: Democrats control the White House.",
    "So it's certainly something to watch as the campaign heats up as we go through the end of April and into May to see if the Labor Party can maintain its lead, or if it really becomes a toss up,? Beard said.",
    "As Nir put it, DeSantis's map would completely change the district and turn it from a seat that Biden won by a 63-36 margin into a seat Trump would've won by a 57-41 margin:\nThat's a swing of 43 points.",
    "The drama is only continuing to ramp up as Trump goes around picking these candidates, upsetting the other Republicans involved in these raceswith little guarantee that his endorsed candidates will win.",
    "The discussion then moved to Democratic Rep. Tim Ryan of Ohio, candidate for the state's open Senate seat, who recently launched a new ad declaring, \"We've got to take on China and be Americans first.\"",
    "President Emmanuel Macron's lead over his challenger, Maureen Le Pen, has expanded a bit in polling since the pair talked about it last week and is now around 10% as things seem to have settled a bit.",
    "And even if the map passes the House as it's expected to, and of course DeSantis signs it, those Fair Districts Amendments still lurk, and Democrats are absolutely certain to file a lawsuit.",
    "Beard hopes that means Macron will coast to a comfortable win on Sunday, despite some major jabs being thrown by both candidates:\nThat's obviously, I think, the broadly preferred thing.",
    "And of course the Labor Party is the major center-left party in Australia.?\nThe election is for all 150 seats in the lower chamber and then 40 of the 76 seats in the Australian Senate.",
    "Lastly, the duo took a look at the House playing field and highlighted 10 Republican-held districts where Democrats have a chance to go on offense and actually pick up seats this year.",
    "Even Sen. Sherrod Brownwho previously endorsed Ryan, Nir noteddeclined to defend the ad and said that Ryan should have introduced himself to voters with a biographical spot instead.",
    "These are generally known as the Fair Districts Amendments, and they (ostensibly) block lawmakers from drawing maps that unduly favor one party over the other.",
    "And so there's sort of this tension between Trump and his personal favorites and the Republican Party's desire for sort of true conservative candidates.",
    "Next up, the pair discussed Senate primaries in Alabama and Georgia that Trump has decided to involve himself in through endorsements of GOP candidates.",
    "So to point out one country over the broader situation is clearly wanting to find a villain and blame the villain as opposed to actually solving policy.",
    "Even if you are going to this as a matter of bare-knuckle politics and tell Asian Americans that their concerns don't matter, Strickland got crushed.",
    "However, legal experts say that the language in the state constitution protecting minority voting rights is actually quite strong and quite clear.",
    "So even if the state Supreme Court does have a problem with this map, there is a real chance that it's still winds up getting used in November.",
    "Now, the professional class was more polite, essentially deflecting these concerns and saying, This is an effective message in the Rust Belt.",
    "Nir pointed out with dismay that many seem to have missed the root of the problem entirely:\nThe reaction in many quarters has been dismaying.",
    "Next, in Australia, which holds elections every three years for their House, the date for the upcoming general election was set for May 21.",
    "Black voters are the largest proportion of residents of the district, which is currently represented by a Black Democrat, Al Lawson.",
    "So the idea that the problem with jobs overseas is China in particular versus American policy or trade policy is just not true.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "A prior ad featured an even more amped-up version of this offensive anti-China rhetoric, and Asian Americans were furious.",
    "Late last week, Trump endorsed venture capitalist JD Vance, just a few weeks before the May 3 Republican primary in Ohio.",
    "In France, voting for the presidential runoff takes place this Sunday, April 24, just two weeks after the first round.",
    "Thus, he added:\nThere is a realistic chance that the [state] Supreme Court throws out at least this part of the map.",
    "Beard clarified that the Liberal National Coalition is the center-right coalition: Don't get confused with liberal.",
    "He lost by 21 points, and not only did he get his ass handed to himhe ran 13 points behind the top of the ticket.",
    "It's been the kind of thing you see all too often when members of a minority group call out racism or bigotry.",
    "Jobs are going overseas to a ton of different countries in a ton of different sectors for different reasons.",
    "They also contain a provision that bars legislators from drawing maps that diminish minority voting power.",
    "What's going to be different about electing him to the Senate versus electing into the house?? Nir said.",
    "It certainly leans somewhat to the right, but Trump only won it by about three or four points in 2020.",
    "He would easily win this primary, but Vance very well could lose even if he got Trump's endorsement.",
    "Le Pen is a far-right candidate who's very concerning, has a been a big fan of Russia in the past.",
    "Lastly, the cohosts delved into Democratic opportunities to go on offense in the House this year.",
    "Instead, they let DeSantis draw the map that he wants and simply passed it on a party line vote.",
    "And that is what led to a spike in hatred that the worst Americans turned into violent action.",
    "Beard thinks it will be interesting to see how Trump reacts if they fail to come out on top.",
    "Why not go after greedy American corporations who are undermining American workers at home?",
    "The Labor Party remains in the lead in polling, but it has narrowed in the past few weeks.",
    "So why hasn't he managed to fight back, quote-unquote, against China in that whole time?",
    "I saw one remark online saying, Well, the ad only mentions China, not Chinese people.",
    "You can listen below, or subscribe to The Downballot wherever you listen to podcasts.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "They have every reason to expect a difficult time at the ballot box in November.",
    "But for a whole host of reasons, the best defense may in fact be a good offense.",
    "As a reminder, you can reach our hosts by email at thedownballot@dailykos.com.",
    "Ryan's colleague, New York Rep. Grace Meng, demanded that he take down the ad.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Please send in any questions you may have for next week's mailbag.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "And of course, Florida is a perennial swing state,? he added.",
    "So definitely keep an eye on the litigation over this map.",
    "Beard elaborated:\nHe's not seen as the true conservative.",
    "So what's the problem?' That's not how incitement works.",
    "You can also find a transcript for this week right here.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "A lot of folks simply refuse to take it seriously.",
    "Asian American advocacy groups demanded likewise.",
    "You can also reach out via Twitter: @DKElections.",
    "Very, very likely to elect a white Republican.",
    "It's not what liberal means here in America.",
    "Of course, it becomes a white district.",
    "This is a short blurb about Daily Kos.",
    "New episodes come out every Thursday!",
    "He's been in congress for 20 years.",
    "That's just absolutely massive.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Rhetoric really matters.",
    "Daily Kos is different.",
    "Here's the problem.",
    "Please read it.",
    "Right."
  ]
}