{
  "id": 80,
  "mediaId": 124,
  "date": "1/7/2022 12:00:00 AM",
  "headline": "Jan. 6 Capitol riot: Full anniversary coverage",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/mpx/2704722219/2022_01/1641501422442_nbc_testimony_mikie_cheney_220106_1920x1080-nbdccu.jpg",
  "link": "https://www.nbcnews.com/politics/politics-news/capitol-riot-anniversary-marked-fiery-biden-speech-gop-absences-n1287139",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    895,
    1147,
    1335,
    1901,
    2214,
    2362,
    3094,
    84,
    545,
    2945
  ],
  "sentences": [
    "One year later, congressman fears U.S. hasn't learned the lessons of Jan. 6\nGOP senators who voted against certifying 2020 election say they have no regrets\nPelosi says Jan. 6 was 'as if somebody in the White House dropped a bomb' on Congress\nLive Blog\nSEE NEW POSTS\nGarrett Haake\n3h ago / 1:49 AM UTC\nCapitol police chief on what has changed since Jan 6. attack\nJan. 5, 202201:42\nShare this -\nChar Adams\n3h ago / 1:41 AM UTC\nBlack photographer reflects a year later on capturing the Jan. 6 attack\nLast Jan. 6, photographer Mel D. Cole had only recently turned his lens from musical events to political ones.",
    "Rep. Cheney showed great deal of moral courage' on Jan. 6, says Rep. Sherrill\nJan. 6, 202201:17\n\"It's appropriate to point out one person who I think has shown a great deal of moral courage, someone who stood up for her country at great personal cost, and that is Liz Cheney,\" Sherrill said of the Wyoming congresswoman who is one of two Republicans serving on the House committee investigating the Capitol attack.",
    "Share this -\nRebecca Shabad\n9h ago / 8:15 PM UTC\nBill Clinton warns efforts to undermine democracy have 'only grown stronger' since Jan. 6\nFormer President Bill Clinton said in a statement Thursday that \"far too many elected officials and public figures continue to spread the lie that the 2020 election was stolen\" to sow distrust in the electoral system and make it harder to cast a ballot.",
    "Share this -\n4h ago / 1:19 AM UTC\nTexas realtor speaks on role in Jan. 6 attack\nJan. 5, 202203:58\nShare this -\nDartunorro Clark\n5h ago / 11:48 PM UTC\nLawmakers conclude Jan. 6 remembrance with somber prayer vigil on Capitol steps\nA brief prayer vigil on Capitol Hill on Thursday capped a day of events in Congress marking the anniversary of the Jan. 6 riot.",
    "\"From what I'm witnessing from the outside, it seems that they are exercising great diligence, and they are being guided by the facts and law, and doing their job, and upholding their oath to defend and support the Constitution of the United States,\" Harris told PBS Newshour in a taped interview that aired Thursday evening.",
    "Share this -\nJonathan Allen\n8h ago / 8:49 PM UTC\nMikie Sherrill praises Liz Cheney for rare 'moral courage' in condemning Jan. 6 and Trump\nIn sharing her memories of Jan. 6 with fellow lawmakers Thursday, Rep. Mikie Sherrill, D-N.J., recalled the acts of physical bravery she witnessed when she was a U.S. Navy pilot.",
    "Share this -\nTeaganne Finn\n3h ago / 1:53 AM UTC\nHouse members share personal stories from Jan. 6, commend Capitol Police\nHouse lawmakers Thursday shared their experiences and reflected on the ramifications of the Jan. 6 riot, many of them praising the actions of the U.S. Capitol Police.",
    "Share this -\nTeaganne Finn\n4h ago / 1:21 AM UTC\nProgressive advocates hold vigil on National Mall, call on Senate to act on voting rights\nA group of progressive advocates hosted a candlelight vigil Thursday evening on the National Mall, joined by several House and Senate lawmakers.",
    "Share this -\nDartunorro Clark\n4h ago / 1:27 AM UTC\nHarris says she expects to 'see justice come out of' the Jan. 6 committee probe\nVice President Kamala Harris says she has faith that justice will be served when the Jan. 6 committee finishes its investigation.",
    "Share this -\nAllan Smith\n9h ago / 8:32 PM UTC\nGOP Rep. who voted to impeach Trump shares video of House evacuation\nRep. Peter Meijer, R-Mich., posted to Twitter a video he shot from the House gallery as the chamber was being evacuated during the Capitol riot.",
    "Thursday's events at the Capitol, organized by Democrats, consisted of lawmaker testimonials of the Jan. 6 riot and a panel discussion with historians Doris Kearns Goodwin and Jon Meacham to \"establish and preserve the narrative\" of the attack on Congress.",
    "\"A year later it is difficult to comprehend the gravity of this attack on our democracy,\" said Rep. Rosa DeLauro, D-Conn. \"But I will never forget that amid this interaction, the Capitol Police told us to hit the floor, grab the gas masks under our seats.",
    "Rep. Jamie Raskin, D-Md., who spoke at the vigil, thanked Capitol Police officers who protected all inside the Capitol, as well as Reps. Liz Cheney, R-Wyo., and Adam Kinzinger, R-Ill., for standing up for democracy.?\nRep. Pramila Jayapal, D-Wash., Del.",
    "\"If we are going to save our democracy, we all have a responsibility to act now  to stop violence and start seeing one another as equally deserving of full citizenship, life, liberty, opportunity, and a voice and a vote that can be cast and counted.",
    "The bipartisan committee investigating the origins of last year's attack on the Capitol has ramped up its probe, interviewing hundreds of individuals with knowledge of what happened on Jan. 6, including many in former President Donald Trump's orbit.",
    "Share this -\nAllan Smith\n5h ago / 11:44 PM UTC\nKinzinger says he has no regrets when asked about becoming GOP 'pariah'\nRep. Adam Kinzinger, R-Ill., said Thursday he has no regrets about how he has approached the aftermath of Jan. 6.",
    "In a speech Thursday morning noting the anniversary, President Joe Biden placed blame on Trump for the attempted insurrection and pushed back on many of the former president's false claims about the 2020 election.",
    "About two dozen House Democrats recalled jarring moments from last year's attack, from being told to put on gas masks to frantically locking doors as a pro-Trump mob stormed the halls of Congress.",
    "\"Because I know  I've got a son being born imminently, that's why I'm in Illinois  I know that he'll be proud of me someday, and I know he'll be able to look and say I stood up in a tough time.",
    "His compelling images show rioters struggling with police, tending to their pepper-sprayed eyes, forcing their way into the Capitol and dragging an officer down the building's steps.",
    "\"In so doing, they've managed to convince millions of Americans to embrace falsehoods and even consider violence a legitimate tactic for achieving political goals,\" Clinton said.",
    "\"To prevent this kind of attack from happening again, our elected leaders must act now to pass urgent legislation that will protect this country from anti-democratic forces.\"",
    "The Declaration for American Democracy, a coalition of over 200 progressive organizations, which hosted the vigil, called on Congress to pass voting and election legislation.",
    "\"We will never let those who want to rewrite what happened one year ago get away with it,\" said Rahna Epting, the executive director of MoveOn, a progressive organization.",
    "\"The promise of democracy is not a partisan issue but a calling that unites us as Americans,\" said Jana Morgan, the director of the Declaration for American Democracy.",
    "Pelosi honors heroes who defended Capitol before moment of silence\nJan. 6, 202202:11\nThe U.S. Marine Band ended the seven-minute vigil with \"God Bless America.\"",
    "Biden called Trump a \"defeated former president\" and vowed not to shrink from the fight against those who have sought to undermine the electoral process.",
    "Thursday marked one year since the Jan. 6 riot, where supporters of then-President Donald Trump stormed the Capitol to protest the 2020 election results.",
    "\"We prayerfully mark one year since the insurrection and patriotically honor the heroes who defended the Capitol and our democracy that day,\" she said.",
    "\"I never thought the most dangerous place I could be was the United States Capitol, but on January 6, the Capitol became a conflict setting,\" she said.",
    "Both have been critical of former President Donald Trump's role in the riot and of Republicans who have downplayed the events that unfolded on Jan. 6.",
    "Earlier Thursday, Harris and President Joe Biden gave speeches marking the Jan. 6 anniversary, where they called for vigilance and accountability.",
    "Earlier in the day, President Joe Biden gave a forceful speech, calling the lies of the \"defeated former president\" an attack on America's soul.",
    "The former president has endorsed a primary challenger to the Michigan Republican in hopes of ousting him from office later this fall.",
    "The former president warned that the organized effort to undermine the U.S. democracy \"has only grown stronger over the last year.\"",
    "Cheney, who voted to impeach former President Donald Trump over the Jan. 6 riot, is facing a primary challenge backed by Trump.",
    "The parents of Capitol Police Officer Brian Sicknick, who died just hours after the riot, attended Thursday's testimonials.",
    "Michael Curry gave the invocation prayer, followed by the U.S. Marine Band performing \"My Country, 'Tis of Thee.\"",
    "Trump celebrated news earlier this year that Kinzinger will retire from his House seat at the end of his term.",
    "Kinzinger and Cheney are the only Republicans serving on the House committee investigating the Capitol riot.",
    "Rep. Sara Jacobs, D-Calif., recalled how Jan. 6 was the first day she had ever been in the House gallery.",
    "She then spoke about moral courage, which she said she hasn't often seen in her career as a politician.",
    "If Republicans win back the House in the November midterm elections, the panel could be dissolved.",
    "That day, he simply planned to capture then-President Donald Trump's rally near the White House.",
    "Meijer was one of 10 House Republicans who voted to impeach Trump for his role in the riot.",
    "Meanwhile, Senate Democrats reflected on the riot by renewing their voting rights push.",
    "In no way, shape or fashion did I expect people to do what they did that day,? he said.",
    "Eleanor Holmes, D-D.C., Sen. Chris Van Hollen, D-Md., and other lawmakers also spoke.",
    "House Speaker Nancy Pelosi briefly addressed the crowd before a moment of silence.",
    "Democratic lawmakers from both chambers gathered on the Capitol steps as the Rev.",
    "I wish it was more people, though,\" he said, referring to Rep. Liz Cheney, R-Wyo.",
    "\"But I would not change a thing that I've done particularly in the last year.\"",
    "Some people got in [to the Capitol], there were fights, there was craziness.",
    "\"Although we eventually secured the building, the conflict is not over.",
    "And I think we will, I hope and believe, see justice come out of it.\"",
    "If we shoulder our responsibility, our best days still lie ahead.\"",
    "Analysis: Could this be Biden's unofficial re-election launch?",
    "\"I do have faith in the process that they have embarked upon.",
    "And if it's just me and Liz doing it, it's just me and Liz.",
    "\"You know, I don't like the feeling,\" Kinzinger responded.",
    "\"How does it feel to be a pariah within your own party?\"",
    "The committee, however, is competing against the clock.",
    "\"I will never cease to be angry at this desecration.\"",
    "I had no idea there were gas masks under our seats.\"",
    "\"A year ago at this minute,\" Meijer tweeted.",
    "\"Sad f---ing history,\" he says in the clip.",
    "Fox News host Neil Cavuto asked Kinzinger.",
    "It was the craziest day of my entire life.",
    "He had no idea how the day would unfold.",
    "Read more of what Cole saw here.",
    "Share this -\nLoad More Posts",
    "January 6 was not the end.",
    "It was the beginning.\"",
    "That's fine."
  ]
}