{
  "id": 83,
  "mediaId": 165,
  "date": "1/5/2022 12:00:00 AM",
  "headline": "Republicans Promised to Banish Jan. 6 Insurrectionists. A Year Later, They've Purged Jan. 6 Critics",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/01/congress-j6-insurrectionists-banish.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-news/jan6-insurrectionists-trump-accountability-cheney-1278644/",
  "sentiment": "0",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Dickinson",
  "authorUrl": "",
  "termIds": [
    1901,
    3094
  ],
  "sentences": [
    "Even Lindsey Graham, the South Carolina senator and longtime Trump toady, blasted POTUS for demanding that former Vice President Pence block certification of the Electoral College vote, calling it the most offensive concept in the world? and insisting it would amount to a single person deciding to disenfranchise 155 million people.? Citing a litany of court rulings against Trump's election challenges, and the absence of evidence of fraud, Graham declared: Enough is enough? and Count me out!?\nAs he finally left the White House in late January, Trump  banned from Twitter, in exile in Mar a Lago  seemed to have been defanged.",
    "Even as she was being expelled, Cheney warned her fellow Republicans: We cannot let the former president drag us backward and make us complicit in his efforts to unravel our democracy.?\nTrump, making the party's rejection of Cheney a test of loyalty, released a statement blasting the Wyoming conservative as a bitter, horrible human being.? He then returned to bang the drum of his Big Lie, writing: The Presidential Election of 2020 will go down as THE CRIME OF THE CENTURY!?\nAs summer took hold, Republicans continued to seek Trump's favor by muddying the waters.",
    "Rep. Jim Jordan of Ohio began blaming the Capitol mob on Black Lives Matter activists and Democrats who'd created this environment of normalizing rioting, normalizing looting, normalizing anarchy in the summer of 2020.?\nThe campaign of deflection and projection grew ever more twisted as Republicans tried to sync up with Trump's latest Tweet-like musings, including blaming Nancy Pelosi (somehow) for having failed to anticipate  and fortify the Capitol against  the assault by the MAGA mob.",
    "In December he touted Trump as the most consequential Republican in the entire Republican party, maybe even in the history of the party since Ronald Reagan.? And he counseled fellow lawmakers, If you're gonna to be a lead this party in the House and the Senate you have to have a working relationship with Donald Trump or it will not work.?\nFor her part, Cheney now sits as one of two Republicans on the Jan. 6 committee, and in many ways has become its public face.",
    "A late-December poll by the University of Massachusetts, Amherst, tells the story: Only 6 percent of Republicans surveyed believe the election of Joe Biden was definitely legitimate.?\nRaymond La Raja, a political science professor at the school and a director of the poll, elaborates that respondents doubting Biden's win overwhelmingly cited belief that fraud, absentee votes from dead people, and the votes of non-citizens had put Biden over the top.",
    "Nearly a quarter of GOP voters say they'd be more likely to back a politician who refused to denounce the events of Jan 6. Republicans say they will punish GOP candidates who voted to impeach Donald Trump or establish a commission to investigate Jan. 6,? said Alexander Theodoridis another director of the poll, and reward those who question Biden's legitimacy.?\nRepublicans who sway in the wind can tell you which way it's blowing.",
    "Senate majority leader Mitch McConnell declared Trump was practically and morally responsible? for unleashing the violence, insisting that the people who stormed this building believed they were acting on the wishes and instructions of their president.?\nGOP senators Pat Toomey of Pennsylvania and Lisa Murkowski of Alaska called on Trump to resign.",
    "At the end of the day,? Michigan GOP Rep. Peter Meijer admitted morbidly on Meet the Press? to begin 2022, there's no other option right now in the Republican Party.?\nIn the immediate aftermath of Jan. 6, 2021, a different path for the GOP appeared to have opened: The party's top leaders, and even some of Trump's lapdogs, turned on him.",
    "It was pure nonsense, but Stefanik still echoed Trump, pronouncing the very next day: The American people deserve to know the truth that Nancy Pelosi bears responsibility as Speaker of the House for the tragedy that occurred on January 6th.?\nSusan Corke directs the Intelligence Project at the Southern Poverty Law Center.",
    "In comments made in the new year, Cheney again appealed to her fellow members of the GOP: We as Republicans have a choice to make,? Cheney said: We can either be loyal to Donald Trump or we can be loyal to the constitution, but we cannot be both.?\nAll indications are that the choice has already been made.",
    "McConnell decried the quest for accountability for the Capitol siege as a purely political exercise?  echoing Trump who called it just more partisan unfairness? and a Democrat trap.?\nWhen Democrats moved on to Plan B, standing up a bipartisan Jan 6th committee, McCarthy sought to place Jordan on it.",
    "McCarthy reversed himself on Trump's responsibility before the month was up, insisting on Jan. 21: I don't believe he provoked it.? By February, McConnell voted to acquit Trump on impeachment charges  as did Toomey and Murkowski, and every other Republican senator not named Mitt Romney.",
    "Extremism is now a part of the mainstream of the Republican party,? which she describes as anchored to the country's anti-democratic, far-right, authoritarian bloc.?\nHolding tight to Trump's lies, Republicans blocked an independent commission to investigate Jan. 6.",
    "In the immediate aftermath of Jan. 6, she says, there was a moment of hope? where it seemed as if Americans could come together, expel Trumpism, and put country over party.? Instead, Corke says, the Republican party did not disavow the violence of Jan. 6.",
    "Sen. Ron Jonson of Wisconsin called the insurrection a peaceful protest.? Back benchers like Rep. Andrew Clyde of Georgia likened the mob violence to a normal tourist visit.?\nAmid this propaganda blitz, the party had an inconvenient irritant.",
    "Republicans, with very rare exceptions, have lost the courage of their supposed convictions, and fallen back into a complicit orbit around the center of grievance and gravity that defines Donald Trump and, by extension, the modern GOP.",
    "A year ago, top Republicans were clear-eyed  and forceful  in their repudiations of president Trump, blaming him directly for the Jan 6 insurrection at the Capitol and blasting his false claims that he was robbed of a second term.",
    "We've now learned Jordan was in the thick of things: He texted Trump chief of staff Mark Meadows in the run up to Jan. 6, arguing that Mike Pence should simply invalidate Electoral College votes the GOP didn't find favorable.",
    "When it comes to accountability, a majority of Republicans oppose efforts to identify, arrest and prosecute the participants; 75 percent of the party thinks it's time to stop looking for lessons from the assault  and move on.",
    "Heading into the primary elections for the 2022 midterms, more than half (55 percent) of Republicans say a candidate who openly questions Biden's legitimacy will be more likely to receive their vote.",
    "A full 80 percent of Republicans describe the insurrection as a protest,? and three quarters are confident no harm would have come to lawmakers had they been reached by the mob.",
    "And for that stubborn adherence to reality, she was voted out of House leadership  replaced with Elise Stefanik, a New York representative and enthusiastic Trump sycophant.",
    "These are extremely worrisome perceptions, and improved faith in the electoral process won't happen until Republicans stop saying the election was stolen,? La Raja said.",
    "The president bears responsibility for [the] attack by mob rioters,? insisted House minority leader Kevin McCarthy, calling for a congressional censure of the president.",
    "She tweeted in real time after the event: There is no question that the President formed the mob, the President incited the mob, the President addressed the mob.",
    "Liz Cheney  a member of House leadership  had seen the events of January 6th with the same moral clarity that Kevin McCarthy had at the start.",
    "Trump and his apologists, enablers, and yes men have  at least for the rank-and-file of the Republican base  succeeded in warping reality.",
    "By spring, the gravity of the events of Jan. 6 seemed to pale in comparison to the political gravity of the 45th president.",
    "He lit the flame.?\nBut unlike her fellow partisans, Cheney never softened those charges or walked them back.",
    "Rep. Paul Gosar of Arizona conspiratorially suggested the FBI had ginned up the violence at the Capitol.",
    "But as the days and weeks passed, the GOP was soon reminded that Trump remains the life of their party.",
    "Overwhelmingly, GOP voters view public concern about the storming of the Capitol as overblown.",
    "The few outliers in the Republican party are retiring or have been demonized by the party.",
    "Only 7 percent of Republicans hold Trump responsible for the events of Jan. 6.",
    "Graham is no longer preaching enough is enough? vis a vis the 45th president.",
    "Democrats blocked the move, and with good reason.",
    "Trump loyalists were soon busy recasting history.",
    "They've been continually gaslighting the nation.",
    "It's an incredibly scary situation,? she says.",
    "The craven cave-in began almost immediately.",
    "The political ramifications are alarming.",
    "How a year can change people."
  ]
}