{
  "id": 86,
  "mediaId": 147,
  "date": "1/4/2022 12:00:00 AM",
  "headline": "Death threats, primary challenge followed Rep. Meijer's vote to impeach Trump after Jan. 6",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/assets/images/placeholder.jpg",
  "link": "https://www.pbs.org/newshour/show/death-threats-primary-challenge-followed-rep-meijers-vote-to-impeach-trump-after-jan-6",
  "sentiment": "0.0",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1901
  ],
  "sentences": [
    "But, in my mind, the opportunity that was missed  and I hope that the ultimate work product will be this  was to have something that could be looked at and viewed objectively by the American people that can be clearing away a lot of, again, the rumors and innuendo and the deception and the misinformation, the whitewashing, the blame-casting that we saw in the days, weeks and months after January 6, and still today trying to make it seem like anything other than it was, which was a violent attempt to interfere with the proceedings of Congress, and specifically the certification of the Electoral College results.",
    "I would say just feels of anger, of frustration, of feeling something sacred was being trampled on, and that, in the history that was made, a very dark, dark possibility raised of the threat that every four years we would no longer have a peaceful transfer of power, but that we have just chosen to expand what we compete on in a political playing field outside of elections, outside our institutions and, frankly, put everything up for debate.",
    "But when you start to get down to brass tacks and what actually occurred, clear away some of the fog, some of the deception and the misinformation that's out there, it's very hard to justify how the former president reacted, at the very least in the hours after the Capitol was attacked, when the vice president and the next two individuals in the presidential line of succession were under assault in the Capitol.",
    "I mean, what does it  what do\n(CROSSTALK)\nRep. Peter Meijer:\nYes, to clarify, when asked about whether  why there was the reversion back after January 6 to supporting Donald Trump, I said because individuals did not see an alternative, they did not see another path, not that there is no choice, but that we need to be creating the path.",
    "I mean, the loss of Officer Sicknick and then the subsequent loss of several other Capitol Police officers and Metropolitan Police officers who took their own lives in the days and weeks and months that followed is an absolute tragedy, and why it is even more frustrating to see people whitewash and downplay the events of January 6.",
    "That was one of the reasons why I voted for impeachment, the fact that we cannot, in our political system, be playing around with such dangerous rhetoric and encouraging, spurring, inciting people to go and try to use force, use threats, use violence in order to achieve a political end.",
    "I think I have seen that plenty of times, where somebody will publicly be very defensive, and then, in a one-on-one conversation, where the guard is let down, where somebody doesn't feel like it's their tribe against another, they're more than willing to accept and acknowledge things.",
    "Read the Full Transcript\nJudy Woodruff:\nJust three days after being sworn in to serve his first term in Congress, Representative Peter Meijer, a Republican from Michigan, was among the lawmakers in the House chamber last January when pro-Trump rioters attacked the Capitol.",
    "I was just going to say, but you know the leadership of your party in the House and the majority of Republican members of the House are saying that this committee shouldn't be there, it shouldn't be doing this work, that it's important to look ahead, not to look back.",
    "I think, oftentimes, we will find that the misunderstanding or where we differ is a lot less significant than it may appear from the outside, especially talking about the lack of response in the immediate hours after the Capitol was broken into.",
    "Judy Woodruff:\nBut I think it's clear that you  and listening to the police officers we just heard from, there's no doubt in their  or at least what came across is, they believe this was an attempt to overthrow the results of the election.",
    "But when we have a highly polarized context, when it's black or white, when it's all or nothing, when we're dealing with absolutes, it's very tempting to feel like it's us vs. them, when, at the end of the day, we're all Americans.",
    "Judy Woodruff:\nAnd, tomorrow, we want to say we will continue our coverage of the January 6 anniversary, including a conversation with the chairman of the House Democratic Caucus, Hakeem Jeffries of New York.",
    "Judy Woodruff:\nWell, I want to ask how you reconcile those views, because in a poll we have just done, only 10 percent of Republicans said they could call what happened on January 6 an insurrection.",
    "We need to be working on what a party that is reflective of the concerns of conservative Americans, but that also is a party that adheres to the rule of law, what that looks like.",
    "Michigan Rep. Peter Meijer was among the lawmakers in the Capitol's House chamber last January during the pro-Trump riot just three days after he was sworn in to his first term.",
    "Rep. Peter Meijer:\nAnd there were dozens of my Republican colleagues who voted in support of a bipartisan independent commission that was styled after the 9/11 Commission.",
    "And, to me, that is a charge, that is an opportunity to be defining that, not succumbing to a belief that there is no other option, but that the charge is to create it.",
    "But I did interview yesterday the longtime partner of Brian Sicknick, who was a Capitol Police officer who died the day after the attack on the Capitol.",
    "And she said, unless members of Congress, including Republicans, are able to hold President Trump accountable, there's going to be more violence.",
    "Judy Woodruff:\nBut 10 percent of the Republican Party saying  members of the Republican Party saying they don't think it was an insurrection.",
    "Rep. Peter Meijer:\nI say we absolutely have the same fears, that I grieve for the tragedy that struck her and her family in those moments.",
    "Judy Woodruff:\nAs we mentioned, you were one of just a handful of Republicans to vote to impeach President Trump over inciting that riot.",
    "Rep. Peter Meijer:\nI think you  whenever you're asking a survey or a polling question, there's a certain defensiveness that can come in.",
    "Again, I said that I will look at the work product and the results coming out of the January 6 Select Committee as it continues along.",
    "You were asked about President Trump, whether there was another option for the Republican Party other than to support him.",
    "And then, coupled with that, you have the great majority of Republicans who don't believe President Biden won.",
    "You know, there's obviously people who have very strong beliefs about the November 2020 presidential election.",
    "That vote has resulted in death threats and now, a Trump-endorsed primary challenger to his reelection bid.",
    "In other words, it's just the opposite of what these police officers and what Ms. Garza are calling for.",
    "And I think riot was 30 percent, and I think protest was 40 percent, if I'm referencing the same poll.",
    "We have to recognize the threat of political violence, and say that we should not be tolerating that.",
    "And just to clarify on that poll that only 10 percent of Republicans describe it as an insurrection.",
    "I also want to ask you, Congressman, about  you did an interview with NBC News over the weekend.",
    "And I think  I'm still deeply disappointed and frustrated that that commission was not formed.",
    "You had a reaction, very negative reaction, from your constituents, even from family members.",
    "Are you able to have a rational discussion about what happened with any of these people?",
    "He voted later with nine other House Republicans to impeach then-President Donald Trump.",
    "Judy Woodruff:\nAnd we're hearing your voice, a minority voice in the Republican Party.",
    "And now he is facing a Trump-endorsed primary challenger as he runs for reelection.",
    "What do you say to Sandra Garza, who  again, longtime partner of Brian Sicknick?",
    "How do you explain these views, both of which are clearly not based on facts?",
    "He voted with nine fellow Republicans to impeach then-President Donald Trump.",
    "Congressman, you didn't vote for this January 6 Committee in the House.",
    "You have said that you want to wait and see what the work product is.",
    "What memories does it  come back to you as you reflect on that?",
    "Congressman Peter Meijer, thank you very much for joining us.",
    "Rep. Peter Meijer (R-MI):\nThank you for having me tonight.",
    "As we said, you were in the House chamber on that day.",
    "Congressman Peter Meijer joins us from Grand Rapids.",
    "Rep. Peter Meijer:\nCertainly on a one-on-one basis.",
    "I think the other options were a protest or a riot.",
    "Congressman, thank you so much for being with us.",
    "That decision has resulted in death threats.",
    "That cannot be tolerated in our politics.",
    "Judy Woodruff:\nI was just  excuse me.",
    "And you said there's no other option.",
    "Meijer joins Judy Woodruff for more.",
    "And we also mentioned death threats.",
    "We have to face it for what it was.",
    "More stories from this series"
  ]
}