{
  "id": 8646,
  "mediaId": 151,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "How the gun debate will be won or lost in the suburbs",
  "image": "https://www.politico.com/dims4/default/fee9342/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F0b%2Fb4%2F5556e29c43fd8fb15baaaaebe3a3%2F220531-voting-booth-getty-773.jpg",
  "link": "https://www.politico.com/news/2022/06/01/gun-control-debate-suburbs-elections-00036230",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    971,
    1901,
    2237,
    6412,
    6457,
    403,
    571,
    2661,
    2672,
    2851,
    6481
  ],
  "sentences": [
    "I don't know that I can sort of necessarily put a political lens on this in the pundit's sense, in terms of how this will impact or sway voters, but I can certainly say from the ground what we're seeing is people who are very interested in seeing change, because this has resonated in a way that I think is so unique and so personal to people, said Scholten, who spent a dinner table conversation last week explaining to her fourth grade son Wesley what happened in Uvalde.",
    "In a statement to POLITICO, Demings' communications director Christian Slater said the candidate knows we can't afford to have law enforcement outgunned on the streets and will continue holding Marco Rubio accountable for refusing to pass common sense measures to protect communities from violent criminals.",
    "Yet as the experience of Noblesville Stands Together shows, even a searing local experience like a school shooting  and even on the last front where activists see tillable political land  activists continue to struggle with translating gun violence into an issue that's capable of deciding elections.",
    "The anti-gun violence group Giffords, founded by former Rep. Gabby Giffords, herself a victim of a failed assassination attempt, released polling shortly before the shooting in Uvalde, Texas, affirming that suburban voters are sympathetic to calls for gun reform.",
    "If they vote for gun safety and break the logjam, it shows Democrats and Republicans alike that they can vote their conscience to the will of the voters and keep their job, Watts said of pending efforts in the Senate to find common legislative ground.",
    "I think there is a lot of agreement among the Democratic coalition and suburban voters that something should be done on this issue, said Lanae Erickson, senior vice president for social policy at Third Way, the center-left Democratic think tank.",
    "Regardless of what becomes of gun reform talks in the Senate in the coming days, Shannon Watts, founder of Moms Demand Action, the grassroots anti-gun violence operation, told POLITICO that the issue is at a tipping point with suburban voters.",
    "Hillary Scholten  who is running in Michigan's redrawn 3rd District, which includes several large West Michigan suburbs, and is currently held by Republican Rep. Peter Meijer  said she's heard about the issue from voters over the last week.",
    "His response was, You know, Mom, we have these drills to prepare for this, but I didn't really think it actually happened,' recalled Scholten, who, if elected, would be the first mother representing Grand Rapids, she added.",
    "A former Everytown staffer who lost her son a decade ago to gun violence and who has campaigned on stepping up regulations, McBath won the three-way Democratic primary outright in Georgia's 7th Congressional District.",
    "The poll, conducted by Global Strategy Group, showed that 58 percent of registered suburban voters in the battleground states of Florida, Georgia, Nevada, Pennsylvania and Wisconsin support more restrictive gun laws.",
    "Their candidate  Democrat Christina Hale, running against Republican Victoria Spartz that year  lost her 2020 House race in a suburban Indianapolis district where that 2018 shooting was still fresh in voters' minds.",
    "In very cold political terms, it's hard not to look at this shooting and feel like the cycle is somewhat familiar, said Jim Henson of the Texas Politics Project, which routinely polls voters on gun regulations.",
    "He organized the group of 25 fellow parents after a shooting at their Noblesville West Middle School that critically injured a then-13-year-old girl after a wounded teacher wrestled the shooter to the ground.",
    "Watts said that her organization will be pulling out all the stops between now and November to make this a priority issue for voters, though the group wasn't prepared to detail specific ad buys or targets.",
    "We really worked literally almost every day for two years, and we reached the limits of what was possible, and we made very marginal progress, said Steve Rogers, a longtime Indiana Democratic lobbyist.",
    "In Vermont, state Senate President Pro Tempore Becca Balint, who is running to replace Democratic Rep. Peter Welch, has made increased gun restrictions a cornerstone of her campaign.",
    "After following the news of the murder of 19 children and two teachers in Texas last week, Rogers said he's uncertain whether gun violence will make a difference in November.",
    "With opinion essentially hardened on guns in rural and urban America, the suburbs have become the political crucible for winning support for more significant restrictions.",
    "There seems to be a bit more attention to this, and a bit more of a push for action, but I'm still not seeing evidence that we're going to see a fundamental shift here.",
    "We've seen that the issue gets raised around one of these massacres, and then that has a shorter and shorter half-life, where people's attention is maintained.",
    "They hired a staffer in the latter state, where gun owner and former Orlando police chief Val Demings is challenging incumbent Republican Sen. Marco Rubio.",
    "I'm going to remind people all the time of my record on this issue and the work that we've done here in Vermont, and how the sky did not fall, said Balint.",
    "| Sean Rayford/Getty Images\nBy Adam Wren\n 06/01/2022 04:30 AM EDT\nA red-state shooting at their children's middle school had left parents deeply unsettled.",
    "A mother of an 11-year-old and 14-year-old  and a middle school teacher during the Columbine shooting  she lists common-sense gun reform on her website.",
    "Kate Moore, political director for Giffords, said the Texas shooting is definitely going to impact our independent expenditures for this cycle.",
    "Several candidates who plan to target the suburbs told POLITICO their campaigns have found a new animating force in the wake of the shooting.",
    "Several candidates who plan to target the suburbs told POLITICO their campaigns have found a new animating force in the wake of the shooting.",
    "But if they fail to act, then it's all the more reason for Americans to vote for gun safety up and down the ballot in November.",
    "The group's PAC endorsed Demings, who has made her opponent's inaction on gun violence legislation an issue in the campaign.",
    "Rogers' exhaustion from his suburban-focused advocacy effort echoes the fatigue of other proponents of stricter gun laws.",
    "Unfortunately, the issue is usually low salience, especially when it's not proximate to one of these shootings.",
    "So far, Giffords is concentrating its midterm spending efforts in the Pennsylvania and Florida Senate races.",
    "She cited last week's primary victory by Democratic Rep. Lucy McBath as evidence the issue can be decisive.",
    "A group of them  Republicans and Democrats  banded together to advocate for greater gun restrictions.",
    "And yet it remains unclear whether voter attention on mass shootings will dissipate or endure.",
    "But the efforts of Noblesville Stands Together fell short when Election Day arrived.",
    "They attended campaign events for a congressional candidate who promised action.",
    "She also passed some of her gun-friendly state's first firearm safety laws.",
    "They even wrote op-eds in local news outlets on the candidate's behalf.",
    "Other issues, such as the pandemic and the economy, overshadowed guns.",
    "This is not rocket science or some deep analysis.",
    "I'm not real optimistic about it, he said.",
    "They lobbied state and federal officials."
  ]
}