[
  {
    "id": 4988,
    "mediaId": 2586,
    "date": "2022-02-24",
    "sentence": "But of the eight USFL draft picks who have some connection to the Steelers, the one who came into the NFL with the most fanfare—at least in terms of draft pedigree—was cornerback <span class='selected-term'>Brian Allen</span>.",
    "author": "Jason Zasky",
    "title": "Former Steelers Fifth-Round Pick Drafted by Birmingham Stallions"
  },
  {
    "id": 3179,
    "mediaId": 2523,
    "date": "2022-03-13",
    "sentence": "Both have free agents of their own to worry about, whether it's edge-rusher Von Miller and center <span class='selected-term'>Brian Allen</span> in Los Angeles or linebacker De'Vondre Campbell and cornerback Rasul Douglas in Green Bay.",
    "author": "Gary Davenport",
    "title": "Tom Brady Is Back, but the Buccaneers Are Far from Super Bowl Favorites"
  },
  {
    "id": 3526,
    "mediaId": 2523,
    "date": "2022-03-14",
    "sentence": "Secondary Market: James Daniels, Andrew Norwell, Ben Jones, Austin Corbett, <span class='selected-term'>Brian Allen</span>\nBehind Daniels, there isn’t a clear long-term option in this group.",
    "author": "Steven Ruiz",
    "title": "The Complete Guide to 2022 NFL Free Agency"
  },
  {
    "id": 2826,
    "mediaId": 2707,
    "date": "2022-03-16",
    "sentence": "Since Monday, when teams could start negotiating with other teams’ free agents, the Rams have not announced any acquisitions, while they’ve re-signed tackle Joe Noteboom – groomed as retiring left tackle Andrew Whitworth’s successor – and center <span class='selected-term'>Brian Allen</span> and guard-center Coleman Shelton.",
    "author": "Kevin Modesti",
    "title": "Rams lose Von Miller after Bills come with cash"
  },
  {
    "id": 630,
    "mediaId": 2586,
    "date": "2022-04-11",
    "sentence": "— Mike Garafolo (@MikeGarafolo) March 15, 2022\nStrange can also come in as insurance and provide a valuable backup for the resigned <span class='selected-term'>Brian Allen</span> at center.",
    "author": "Lorenzo Reyna",
    "title": "NFL Draft Analyst Identifies ‘Perfect Fit’ for Rams’ Scheme in 2022"
  }
]