[
  {
    "id": 6911,
    "mediaId": 2746,
    "date": "2022-01-23",
    "sentence": "Kupp, who had nine catches for 183 yards, lost a fumble, and the offense failed to take advantage of Miller sacking Brady to a force a fumble at the Tampa Bay 25 when center <span class='selected-term'>Brian Allen</span> snap sailed past Stafford in shotgun formation and recovered by the Bucs.",
    "author": "Fred Goodall",
    "title": "Last-second FG lifts Rams over Brady, Buccaneers"
  },
  {
    "id": 5038,
    "mediaId": 2707,
    "date": "2022-02-14",
    "sentence": "Let’s not let fear of what if it doesn’t work out keep us from maybe getting that edge.”\nSome hard personnel decisions are upcoming for the champs, who have 11 unrestricted free agents (including Miller, Beckham – who reportedly had already begun contract talks with the Rams – Sony Michel, and offensive linemen Joe Noteboom, <span class='selected-term'>Brian Allen</span> and Austin Corbett), and five restricted free agents (including linebacker Troy Reeder and kicker Matt Gay).",
    "author": "Jim Alexander",
    "title": "Alexander: Rams’ Super Bowl title a reward for Les Snead’s boldness"
  },
  {
    "id": 5021,
    "mediaId": 2586,
    "date": "2022-02-18",
    "sentence": "He managed to play surprisingly well at tackle over the last two seasons despite having a guard’s body and foot quickness.”\nWhy the Upgrade is a Possibility\nHere’s why the need for upgraded help is on the table for the Rams: Starting guard Austin Corbett and center <span class='selected-term'>Brian Allen</span>.",
    "author": "Lorenzo Reyna",
    "title": "Rams Urged to ‘Upgrade’ Help for Matthew Stafford in 2022"
  },
  {
    "id": 2510,
    "mediaId": 2523,
    "date": "2022-03-19",
    "sentence": "They moved to prevent a mass exodus from the offensive line by re-signing starting center <span class='selected-term'>Brian Allen</span> as well as new left tackle Joe Noteboom and guard/center Coleman Shelton.",
    "author": "Kevin Modesti",
    "title": "Rams face new questions after first week of moves"
  }
]