[
  {
    "id": 6773,
    "mediaId": 2605,
    "date": "2022-01-23",
    "sentence": "On the very next play, Rams quarterback Matthew Stafford, in shotgun formation, is surveying Tampa Bay’s coverage when center <span class='selected-term'>Brian Allen</span> unexpectedly snaps the ball.",
    "author": "",
    "title": "‘This is officially lunacy’: The eight crazy plays that capped the Rams’ win"
  },
  {
    "id": 6911,
    "mediaId": 2746,
    "date": "2022-01-23",
    "sentence": "Kupp, who had nine catches for 183 yards, lost a fumble, and the offense failed to take advantage of Miller sacking Brady to a force a fumble at the Tampa Bay 25 when center <span class='selected-term'>Brian Allen</span> snap sailed past Stafford in shotgun formation and recovered by the Bucs.",
    "author": "Fred Goodall",
    "title": "Last-second FG lifts Rams over Brady, Buccaneers"
  },
  {
    "id": 6961,
    "mediaId": 2728,
    "date": "2022-01-27",
    "sentence": "Center <span class='selected-term'>Brian Allen</span> (55) could have his hands full with defenders in the middle.",
    "author": "Barry Wilner",
    "title": "NFC Matchup: Old West rivals meet for Super Bowl berth"
  },
  {
    "id": 5626,
    "mediaId": 2679,
    "date": "2022-02-05",
    "sentence": "The interior line contains two draft picks — center <span class='selected-term'>Brian Allen</span> and left guard David Edwards — along with right guard Austin Corbett, a trade acquisition from Cleveland in 2019.",
    "author": "GREG BEACHAM",
    "title": "Bold, brash Rams pair flashy superstars with rock-solid core"
  },
  {
    "id": 5842,
    "mediaId": 2728,
    "date": "2022-02-05",
    "sentence": "The interior line contains two draft picks — center <span class='selected-term'>Brian Allen</span> and left guard David Edwards — along with right guard Austin Corbett, a trade acquisition from Cleveland in 2019.",
    "author": "Greg Beacham",
    "title": "Bold, brash Rams pair flashy superstars with rock-solid core"
  },
  {
    "id": 6032,
    "mediaId": 2746,
    "date": "2022-02-05",
    "sentence": "The interior line contains two draft picks - center <span class='selected-term'>Brian Allen</span> and left guard David Edwards - along with right guard Austin Corbett, a trade acquisition from Cleveland in 2019.",
    "author": "Greg Beacham",
    "title": "Bold, brash Rams pair flashy superstars with rock-solid core"
  },
  {
    "id": 5038,
    "mediaId": 2707,
    "date": "2022-02-14",
    "sentence": "Let’s not let fear of what if it doesn’t work out keep us from maybe getting that edge.”\nSome hard personnel decisions are upcoming for the champs, who have 11 unrestricted free agents (including Miller, Beckham – who reportedly had already begun contract talks with the Rams – Sony Michel, and offensive linemen Joe Noteboom, <span class='selected-term'>Brian Allen</span> and Austin Corbett), and five restricted free agents (including linebacker Troy Reeder and kicker Matt Gay).",
    "author": "Jim Alexander",
    "title": "Alexander: Rams’ Super Bowl title a reward for Les Snead’s boldness"
  },
  {
    "id": 5021,
    "mediaId": 2586,
    "date": "2022-02-18",
    "sentence": "He managed to play surprisingly well at tackle over the last two seasons despite having a guard’s body and foot quickness.”\nWhy the Upgrade is a Possibility\nHere’s why the need for upgraded help is on the table for the Rams: Starting guard Austin Corbett and center <span class='selected-term'>Brian Allen</span>.",
    "author": "Lorenzo Reyna",
    "title": "Rams Urged to ‘Upgrade’ Help for Matthew Stafford in 2022"
  },
  {
    "id": 5228,
    "mediaId": 2644,
    "date": "2022-02-18",
    "sentence": "We’re told Rams players Tyler Higbee, <span class='selected-term'>Brian Allen</span>, Troy Reeder, Coleman Shelton, Greg Gaines, Michael Hoecht, Jamil Demby, JJ Koski, Ben Skowronek, Jeremiah Kolone, Brycen Hopkins, Christian Rozeboom and John Mundt sat down for dinner at 9:30 p.m. and “ordered everything” on the menu, including multiple surf & turfs, endless margaritas and more.",
    "author": "Francesca Bacardi",
    "title": "LA Rams celebrate Super Bowl win with Las Vegas bash"
  },
  {
    "id": 2510,
    "mediaId": 2523,
    "date": "2022-03-19",
    "sentence": "They moved to prevent a mass exodus from the offensive line by re-signing starting center <span class='selected-term'>Brian Allen</span> as well as new left tackle Joe Noteboom and guard/center Coleman Shelton.",
    "author": "Kevin Modesti",
    "title": "Rams face new questions after first week of moves"
  },
  {
    "id": 2378,
    "mediaId": 2523,
    "date": "2022-03-21",
    "sentence": "Robinson and center <span class='selected-term'>Brian Allen</span>, who spoke with reporters Monday for the first time since re-signing as a free agent for three years and $24 million, both said knowing Stafford will be here was one attraction of signing with the Rams.",
    "author": "Kevin Modesti",
    "title": "WR Allen Robinson wants to help Rams reach even higher"
  },
  {
    "id": 2248,
    "mediaId": 2586,
    "date": "2022-03-22",
    "sentence": "The team did resign some key free agents along the offensive line including starting center <span class='selected-term'>Brian Allen</span>.",
    "author": "Lorenzo Reyna",
    "title": "Former Super Bowl MVP Has Telling Insight Into Rams’ 2022 Expectations"
  }
]