{
  "id": 1024,
  "mediaId": 2570,
  "date": "2022-04-06",
  "headline": "The Masters 2022: Schedule, Tee Times, Golf Odds For Tiger Woods And The Field At Augusta National",
  "image": "",
  "link": "https://www.forbes.com/sites/alexkay/2022/04/06/the-masters-2022-schedule-tee-times-golf-odds-for-tiger-woods-and-the-field-at-augusta-national/?sh=47e48f274b2e",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Kay",
  "authorUrl": "https://www.forbes.com/sites/alexkay/",
  "termIds": [
    1313,
    2086,
    2492,
    2708,
    3002,
    3899,
    4292,
    4698,
    97,
    595
  ],
  "sentences": [
    "You can find the full list of participants and Thursday's pairings at Augusta National below:\nThe Masters 2022 Field, Tee Times and Pairings\nTee Time (ET) Group\n7:40 a.m. Jack Nicklaus, Gary Player, Tom Watson (Honorary Starters)\n8 a.m. Jose Maria Olazabal, J.J. Spaun\n8:11 a.m. Mike Weir, Padraig Harriington, Austin Greaser\n8:22 a.m. Larry Mize, Sepp Straka, Franceso Molinari\n8:33 a.m. Fred Couples, Garrick Higgo, Guido Migliozzi\n8:44 a.m. Vijay Singh, Ryan Palmer, Kyoung-hoon Lee\n8:55 a.m. Min Woo Lee, Hudson Swafford, Cameron Young\n9:06 a.m. Stewart Cink, Brian Harman, Harry Higgs\n9:17 a.m. Zach Johnson, Si Woo Kim, Aaron Jarvis\n9:39 a.m. Luke List, Matthew Wolff, Mackenzie Hughes\n9:50 a.m. Danny Willett, Jason Kokrak, Talor Gooch\n10:01 a.m. Max Homa, Kevin Na, Shane Lowry\n10:12 a.m. Kevin Kisner, Daniel Berger, Tommy Fleetwood\n10:23 a.m. Bryson DeChambeau, Cameron Smith, Paul Casey\n10:34 a.m. Tiger Woods, Louis Oosthuizen, Joaquin Niemann\n10:45 a.m. Hideki Matsuyama, Justin Thomas, James Piot\n10:56 a.m. Adam Schott, Scottie Scheffler, Tony Finau\n11:18 a.m. Sandy Lyle, Stewart Hagestad\n11:29 a.m. Lucas Glover, Erik Van Rooyen, Cameron Champ\n11:40 a.m. Bernhard Langer, Christiaan Bezuidenhout, Cameron Davis\n11:51 a.m. Charl Schwartzel, Robert MacIntyre, Laird Shepherd\n12:02 p.m. Gary Woodland, Justin Rose, Takumi Kanaya\n12:13 p.m. Lee Westwood, Russell Henley, Corey Conners\n12:24 p.m. Patrick Reed, Seamus Power, Lucas Herbert\n12:35 p.m. Bubba Watson, Tom Hoge, Keita Nakajima\n12:57 p.m. Marc Leishman, Webb Simpson, Sungjae Im\n1:08 p.m. Sergio Garcia, Thomas Pieters, Harold Varner III\n1:19 p.m. Abraham Ancer, Tyrrell Hatton, Sam Burns\n1:30 p.m. Dustin Johnson, Billy Horschel, Collin Morikawa\n1:41 p.m. Will Zalatoris, Patrick Cantlay, Jon Rahm\n1:52 p.m. Jordan Spieth, Viktor Hovland, Xander Schauffele\n2:03 p.m. Matthew Fitzpatrick, Brooks Koepka, Rory McIlroy",
    "With that in mind, here's a list of odds for all the top contenders:\nThe Masters 2022 Odds\nJon Rahm (+1300)\nCameron Smith (+1400)\nJustin Thomas (+1400)\nScottie Scheffler (+1600)\nDustin Johnson (+1600)\nJordan Spieth (+1700)\nCollin Morikawa (+2000)\nBrooks Koepka (+2000)\nRory McIlroy (+2000)\nViktor Hovland (+2000)\nPatrick Cantlay (+2300)\nXander Schauffle (+2400)\nWill Zalatoris (+3300)\nBryson DeChambeau (+3800)\nSam Burns (+3900)\nHideki Matsuyama (+4200)\nJoaquin Niemann (+4400)\nCorey Conners (+4500)\nMatthew Fitzpatrick (+4600)\nShane Lowry (+4700)\nRussell Henley (+4800)\nLouis Oosthuizen (+5500)\nDaniel Berger (+5500)\nTiger Woods (+5500)\nThe Masters action is coming up quickly, with the honorary starters getting things going at 7:40 a.m.",
    "Here's a look at how you can watch all the 2022 Masters action at Augusta National tomorrow:\nThe Masters 2022 Schedule And Viewing Guide\nRound 1: Thursday, April 7\nTelevision\nTime: 3 to 7:30 p.m.\nChannel: ESPN\nSimulcast: Masters.com\nLive Streaming\nFeature Groups: 9:15 a.m. to 7:30 p.m.\nAmen Corner: 10:45 a.m. to 6 p.m.\nHoles 15 & 16: 11:45 a.m. to 7 p.m.\nHoles 4, 5 & 6: 9:25 a.m. to 6:45 p.m.",
    "That puts him slightly ahead of a crowded group of front-runners that also includes Cameron Smith (+1400), Justin Thomas (+1400), Scottie Scheffler (+1600), Dustin Johnson (+1600) and Jordan Spieth (+1700).",
    "Reigning Masters winner Hideki Matsuyama is going off at +4200, giving him rather long odds of becoming the first repeat champion since Woods accomplished the feat in 2001-02.",
    "ET on ESPN—which will be simulcast on Masters.com—but golf fans can start watching right away via live stream through CBSSports.com and the CBS Sports app.",
    "After practicing for the past few days, Woods revealed on Tuesday that he's planning to tee off at the first major of the season tomorrow.",
    "Colin Morikawa, the 25-year-old sensation who won the 2020 PGA Championship and 2021 British Open, is 20-1 to win his first green jacket.",
    "Viktor Hovland may yet to finish in the top-10 at a major, but the Norwegian is also near the front of the list with the same 20-1 odds.",
    "He's been installed as a +5500 long shot, odds that are equal to those of Louis Oosthuizen and Daniel Berger at the 2022 Masters.",
    "The Masters is nearly here and the golfing world is abuzz about Tiger Woods' return to the sport at Augusta National on Thursday.",
    "That distinction belongs to Jon Rahm, the surging Spaniard who broke through and won his first major at the U.S. Open last year.",
    "Despite his success at this event—no active golfer has won more green jackets than Woods—he's far from the favorite this year.",
    "The final feature group—which includes Jordan Spieth, Viktor Hovland and Xander Schauffele—tees off shortly after at 1:52 p.m.",
    "Despite his lack of victories at Augusta National, there's arguably no one playing better golf going into April.",
    "Rahm has placed in the top-10 in four of his eight events this year, only once finishing outside the top-21.",
    "He's looking to add more hardware to his collection at a tourney he's never finished better than fourth at.",
    "Brooks Koepka will be looking to break through and win a Masters after tying for second three years ago.",
    "Rory McIlroy, still missing a victory at Augusta National to cap off a career Grand Slam, is +2000.",
    "The five-time Masters champion is expected to be one of 91 participants in the field this week.",
    "The 27-year-old is currently +1300 to win the 2022 Masters based on FanDuel's golf odds.",
    "Dustin Johnson, Billy Horschel and Collin Morikawa are set to hit the links at 1:30 p.m.",
    "The Masters can be live streamed via Masters.com, CBSSports.com and the CBS Sports app.",
    "Woods is only tied for the 22nd-best odds of winning at Augusta National this year.",
    "The four-time major champion has +2000 odds this week to accomplish that goal.",
    "ET and the first set of contestants scheduled to tee off at 8 a.m.",
    "ET tomorrow and includes Woods, Oosthuizen and Joaquin Niemann.",
    "There are some exciting groupings to get the tourney started.",
    "There's plenty of notables further down the list as well.",
    "The first feature group gets going at 10:34 a.m.",
    "TV coverage won't begin until 3 p.m.",
    "ET on Thursday.",
    "ET.",
    "ET."
  ]
}