{
  "id": 1052,
  "mediaId": 2644,
  "date": "2022-04-01",
  "headline": "Beloved NYC Italian restaurant Forlini’s closes after 79 years",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/forlinis-restaurant-00.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/04/01/beloved-nyc-italian-restaurant-forlinis-closes-after-79-years/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Frishberg",
  "authorUrl": "",
  "termIds": [
    2623,
    2650,
    4403,
    5030,
    5096,
    5126
  ],
  "sentences": [
    "When I was working as a young assistant DA, and eventually as a judge, it was the unofficial commissary for the courthouse.”\nThe family-owned restaurant was begun by “Grandpa Joe” in 1943, then continued by his sons Frank, Freddie and Hugo before being operated by the current 3rd generation: “Big” Joe, Derek and “Little” Joe.",
    "We do not consider you our customers, but friends and part of our family.”\nThe big-boothed, white-tableclothed, extremely carpeted Baxter Street beacon of family-style pasta dishes was a crowd favorite and one of the last Manhattan red-sauce joints.",
    "“My cousin and I are in our sixties now,” one of the Joes told Eater of their reason for selling the family business, as well as the building, which was reportedly co-owned by 12 family members.",
    "Joe would not elaborate on who the new owners are, but they’d bought not just the restaurant’s home but also its furnishings — chairs, tables, equipment and all.",
    "I always remember it as a place of celebration,” Little Italy native and “Hot Bench” Judge Michael Corriero told The Post in 2017 of his favorite restaurant.",
    "Public records do not yet show how much 91-93 Baxter St. was sold for, but in 2020 Eater reported that the building was on the market for $15 million.",
    "“Forlini’s has officially closed,” the 79-year-old restaurant just south of Little Italy announced on social media Friday morning.",
    "After nearly eight decades of serving up old-country classics, this Italian-American landmark has sold its final veal scallopini.",
    "In 2018, Vogue hosted it’s pre-Met Gala party, attended by Hailey Baldwin and Ashley Graham, at the restaurant.",
    "“We want to thank everyone for the wonderful memories over the years,” the eatery concluded its goodbye post.",
    "It’s where we generally celebrated the main events of our lives — first confirmations, school graduations.",
    "Its location by the courts made it a go-to for many judges, lawyers, prosecutors and defendants alike.",
    "But in recent years the restaurant’s bar area became a favorite hangout of the downtown fashion set.",
    "“I lived literally across the street from The Tombs and up the block from Forlini’s.",
    "“We would like to thank all of our patrons for supporting us throughout the years.",
    "“Forlini’s was really a very significant place for Italian-American families.",
    "We are now closed,” announced a sign taped to the restaurant’s door Thursday.",
    "Joe and Derek, however, retain the Forlini’s name.",
    "“God Bless and blessings to you all.”",
    "“Forlini’s has been sold."
  ]
}