{
  "id": 1058,
  "mediaId": 2586,
  "date": "2022-04-07",
  "headline": "Steelers Insider Labels Eagles Exec ‘Front-Runner’ for GM Job",
  "image": "https://heavy.com/wp-content/uploads/2022/01/GettyImages-1196544775.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/eagles-andy-weidl-front-runner-gm/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Zasky",
  "authorUrl": "https://heavy.com/author/jasongzasky6/",
  "termIds": [
    0
  ],
  "sentences": [
    "We interviewed the following candidates for our General Manager position this week:\n• Joe Hortiz (Baltimore Ravens)\n• Ran Carthon (San Francisco 49ers)\n• Andy Weidl (Philadelphia Eagles)\n— Pittsburgh Steelers (@steelers) February 26, 2022\nAndy Weidl Began His Front Office Career With the Steelers\nWeidl is a Pittsburgh native who started his NFL career as a player personnel assistant with the Steelers in 1998-99, back when Tom Donahoe was the team’s director of football operations.",
    "During Gerry Dulac’s Post-Gazette chat on April 6, 2022, one visitor suggested that Weidl “would be a good replacement” for Colbert, to which Dulac replied: “I’d be willing to bet he is the front-runner for the position, as of right now.”\nWeidl was among a trio of candidates that interviewed for the job during the latter part of February, along with Joe Hortiz of the Baltimore Ravens and Ran Carthon of the San Francisco 49ers.",
    "ALSO READ:\n• Emmanuel Sanders ‘Looking Forward to Seeing’ Mitch Trubisky With Steelers\n• Taco Charlton Has Message for Steelers Fans After Signing With Saints\n• Free Agent QB Josh Dobbs Works Out for Steelers’ Hated Archrival\n• Steelers Named ‘Best Scheme Fit’ for 2 Top QBs in 2022 NFL Draft\n• Steelers’ Cam Heyward Named Best-Ever Player Drafted No.",
    "Dulac Dismisses the Notion That the Steelers Are ‘Close’ to Signing Minkah Fitzpatrick\nMeanwhile, on Wednesday Dulac rejected the the idea that the Steelers are “close” to coming to an agreement on a contract extension with Minkah Fitzpatrick, as Aditi Kinkhabwala of NFL Network asserted on 93.7 FM in Pittsburgh on Monday.",
    "To date the Pittsburgh Steelers have interviewed 16 candidates for the organization’s soon-to-be-open general manager position, but in the opinion of Steelers insider Gerry Dulac, Philadelphia Eagles vice president of player personnel Andy Weidl appears to be the leading contender to take over for Kevin Colbert.",
    "And that might not happen until they find another safety to line across from him in the secondary, either in the draft or free agency.”\nHistorically, the Steelers have not worked toward contract extensions with star players until summer rolls around.",
    "It’s also conceivable that the Steelers won’t hire a general manager at all, in which case they would split Colbert’s duties between two individuals, at least one of whom would have a scouting/personnel background.",
    "He went on to join the Eagles in 2016 as assistant director of player personnel and was promoted to director of player personnel in 2018 before ascending to his current job in 2019.",
    "In his April 6 column for the Post-Gazette, he said that according to his sources, “the Steelers have not even started discussions with their two-time All-Pro safety on a new deal.",
    "All-Pro defensive lineman Cam Heyward signed his four-year extension in September 2020, and the Steelers made T.J. Watt the league’s highest paid defender in September 2021.",
    "The Ravens won Super Bowl XLVII while Weidl was in Baltimore and the Eagles won Super Bowl LII in February 2018, at the end of his second season in Philadelphia.",
    "Whoever replaces Colbert will have big shoes to fill, as he is widely considered to be one of the best — if not the best — GMs in the league.",
    "After a stint as a scout with the New Orleans Saints, Weidl worked as a scout for the Ravens from 2005-16.",
    "Follow the Heavy on Steelers Facebook page for the latest breaking news, rumors and content!",
    "The latest Steelers news straight to your inbox!",
    "Join the Heavy on Steelers newsletter here!",
    "31 Overall"
  ]
}