{
  "id": 1088,
  "mediaId": 2592,
  "date": "2022-04-06",
  "headline": "Masters 2022 Tee Times, TV Schedule: How To Watch Tiger Woods, Major Golf Tournament",
  "image": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2022/04/06/tiger-woods-watches-at-the-13th-hole-during.jpg",
  "link": "https://www.ibtimes.com/masters-2022-tee-times-tv-schedule-how-watch-tiger-woods-major-golf-tournament-3464432?utm_source=Public&utm_medium=Feed&utm_campaign=Distribution",
  "mediaOutlet": "IBTimes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anthony Riccobono",
  "authorUrl": "https://www.ibtimes.com/reporters/anthony-riccobono",
  "termIds": [
    1313,
    1744,
    1749,
    1986,
    4127,
    4634,
    595,
    4955
  ],
  "sentences": [
    "The year’s first major is usually golf’s most-watched tournament, and Tiger Woods’ return to the course has generated even more buzz for the event.",
    "Before TV coverage starts in the first and second round, fans can watch featured groups with ESPN+ or Masters.com.",
    "Justin Thomas, Cameron Smith, Dustin Johnson and Scottie Scheffler are viewed as top contenders.",
    "ET Thursday when Rory McIlroy, Brooks Koepka and Matt Fitzpatrick close out the first round.",
    "The betting odds suggest that it’s close to a toss-up whether or not Woods makes the cut.",
    "You can start watching the final two rounds with ESPN+ or Masters.com at 10:15 a.m.",
    "The 2022 Masters are finally set to start Thursday at Augusta National Golf Club.",
    "The networks certainly hope that Woods is still playing beyond the second round.",
    "Viewers can watch a simulcast of ESPN’s broadcast with a stream at Masters.com.",
    "Woods told reporters Tuesday that he believes he can win the 2022 Masters.",
    "ESPN will have Masters TV coverage Thursday and Friday from 3-7:30 p.m.",
    "Woods will be playing alongside Louis Oosthuizen and Joaquin Niemann.",
    "ET Friday as part of the third-to-last group in the second round.",
    "The 15-time major champion won his fifth green jacket in 2019.",
    "ET with the pairing of Jose Maria Olazabal and J.J. Spaun.",
    "On Saturday and Sunday, the TV coverage shifts to CBS.",
    "John Rahm is the favorite to win the 2022 Masters.",
    "The fourth and final round starts Sunday at 2 p.m.",
    "Click here for the full list of Masters tee times.",
    "Saturday’s third round is scheduled for 3-7 p.m.",
    "They have a scheduled tee time of 10:34 a.m.",
    "The first round starts Thursday at 8 a.m.",
    "The final tee time is set for 2:30 p.m.",
    "Woods tees off at 1:41 p.m.",
    "ET on the weekend.",
    "ET on TV.",
    "ET.",
    "ET.",
    "ET."
  ]
}