{
  "id": 1094,
  "mediaId": 2586,
  "date": "2022-04-01",
  "headline": "Raiders Sign Ex-49ers Starting Quarterback: Report",
  "image": "https://heavy.com/wp-content/uploads/2022/04/GettyImages-1056151142.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/las-vegas-raiders/nick-mullens-qb-signing-contract/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Austin Boyd",
  "authorUrl": "https://heavy.com/author/austincjboyd/",
  "termIds": [
    0
  ],
  "sentences": [
    "No More ‘Mariota Package’\nWith the signing of Mullens, the Raiders are showing that they’ve moved on from doing any kind of “Mariota Package.” Last season, the team would put Mariota on the field for certain packages that would usually be a run-pass option.",
    "The team signed Garrett Gilbert but his lack of game experience meant that he would likely be the third quarterback on the depth chart.",
    "Barring any more moves at quarterback this offseason, Mullens should be the favorite to be Carr’s primary backup this upcoming season.",
    "The Raiders had another chance against Mullens last season when he was thrust into starting duties while with the Cleveland Browns.",
    "There were still solid options in free agency like Cam Newton and Ryan Fitzpatrick but the Raiders went in a different direction.",
    "Had the Raiders signed somebody like Newton, then a “Newton Package” would’ve been a talking point this offseason.",
    "There are other ways the coach will get creative as the Patriots’ offense was never dull with him at the helm.",
    "Derek Carr isn’t going anywhere but the Las Vegas Raiders still had a need for a capable backup quarterback.",
    "He’s a creative offensive mind so he could’ve seen what the team did last season and tried his own version.",
    "Marcus Mariota signed with the Atlanta Falcons and Nathan Peterman will likely play elsewhere this season.",
    "Right now, it's him and Garrett Gilbert behind Derek Carr, so a good shot for him to land a backup gig.",
    "The 49ers beat the Raiders 34-3 and Mullens threw for 262 yards, three touchdowns and no interceptions.",
    "The “Mariota Package” had limited success last season and the Raiders didn’t use it often.",
    "He wasn’t as effective as he only threw one touchdown but didn’t throw any interceptions.",
    "According to NFL Network’s Mike Garafolo, the team has signed Nick Mullens to the roster.",
    "Those aren’t great numbers but he’s proven that he can run an offense in an emergency.",
    "Raiders\nPerhaps the team that Mullens has had the most success against is the Raiders.",
    "He came into the NFL with the San Francisco 49ers and spent four years with the team.",
    "Mullens isn’t a splash signing but he does have more game experience than Gilbert.",
    "He only went 5-11 in those 16 starts and threw 26 touchdowns to 22 interceptions.",
    "However, Mullens and Gilbert aren’t exactly Mariota when it comes to athleticism.",
    "The Raiders made a change at head coach this offseason by hiring Josh McDaniels.",
    "He doesn’t have a ton of upside but he also doesn’t make a ton of mistakes.",
    "It was one of the worst losses of that season for the silver and black.",
    "It was a creative way to utilize the hyper-athletic backup quarterback.",
    "The #Raiders have agreed to terms with QB Nick Mullens, source says.",
    "Over the course of those four seasons, he started 16 games.",
    "It’s not a surprise that McDaniels isn’t very interested.",
    "He had one start against them in 2018 and lit them up.",
    "He almost pulled off the upset as his team lost 16-14.",
    "McDaniels has gone in a different direction for now.",
    "ALL the latest Raiders news straight to your inbox!",
    "Subscribe to the Heavy on Raiders newsletter here!",
    "He’s even started a good chunk of games.",
    "Mullens Has Played Well vs."
  ]
}