{
  "id": 1113,
  "mediaId": 2745,
  "date": "2022-04-05",
  "headline": "Who can win the green jacket? Our Masters picks.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HNLO6JKGJJDBZLUKVKF5SCMZMQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/sports/2022/04/05/masters-best-bets/?utm_source=rss&utm_medium=referral&utm_campaign=wp_homepage",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The following golfers aren’t in top form right now and are off my list: Abraham Ancer, Cameron Champ, Stewart Cink, Bryson DeChambeau, Harris English, Tony Finau, Sergio Garcia, Lucas Glover, Padraig Harrington, Max Homa, Mackenzie Hughes, Takumi Kanaya, Jason Kokrak, Marc Leishman, Luke List, Robert MacIntyre, Francesco Molinari, Kevin Na, Louis Oosthuizen, Ryan Palmer, Justin Rose, Webb Simpson, Hudson Swafford, Lee Westwood, Matthew Wolff and Jordan Spieth.",
    "There are only three former Masters champions in this year’s field whose recent play suggests at least a viable shot at victory: Dustin Johnson (+1600 to win), Jordan Spieth (+2200) and Adam Scott (+5500) Among the players near the top of the odds board with previous top 10s: Jon Rahm (+900), Justin Thomas (+1400), Cameron Smith (+1400), Rory McIlroy (+2000), Xander Schauffele (+2000), Brooks Koepka (+2000), Patrick Cantlay (+2500) and Corey Conners (+5500).",
    "My one worry with Scheffler is that he’s played a whole lot of golf recently, with five rounds in his WGC Match Play triumph, and none of the past four April winners had advanced all that deep into the Match Play tournament that annually precedes the Masters (Tiger Woods, a quarterfinalist in 2019, made the deepest run before winning the Masters).",
    "I’m crossing the following former Masters champions off my list of potential winners: Tiger Woods (if he plays), Patrick Reed, Danny Willett, Bubba Watson, Zach Johnson, Fred Couples, Bernhard Langer, Sandy Lyle, Larry Mize, José María Olazábal, Charl Schwartzel, Vijay Singh and Mike Weir.",
    "But what if I told you that surprise winners at Augusta National like Matsuyama are rare, and there’s a way to narrow down an already-small field (compared with most other events) to single out which players have the best chance at Masters success?",
    "Even finishing near the top of the leader board one year after winning is tough: Of the past 20 defending champions, only four have finished in the top 10 the following year, with four — including Johnson last year — missing the cut entirely.",
    "So I’m crossing off the following golfers who haven’t been strong on par 4s of late: Paul Casey, Will Zalatoris, Erik Van Rooyen, Shane Lowry, Tyrrell Hatton, Matthew Fitzpatrick, Gary Woodland, Christiaan Bezuidenhout and Tommy Fleetwood.",
    "If a Masters rookie wins this year, good for him, but I’m crossing all of this year’s first-timers off my list: Sam Burns, Cameron Davis, Talor Gooch, Lucas Herbert, Garrick Higgo, Harry Higgs, Tom Hoge, K.H.",
    "Only two short months ago, Scheffler was widely seen as the best golfer yet to score a professional win, but after three victories in six weeks, the 25-year-old has emphatically put that narrative to bed.",
    "But he also hasn’t missed the cut at the Masters over that span and enters on some pretty solid form: T-9 at the Match Play, T-4 at Genesis, T-9/T-10 at consecutive January tournaments in the Middle East.",
    "So even though he’s playing well, Matsuyama will not be a consideration this year, especially with him also dealing with a neck injury that has caused him to withdraw from two recent tournaments.",
    "Of the past 11 Masters champions, only Matsuyama did not have at least two top-12 stroke-play finishes in the calendar year of the tournament, either on the PGA Tour or the European Tour.",
    "This year’s top 12 entering the tournament: Scottie Scheffler, Rahm, Collin Morikawa, Viktor Hovland, Cantlay, Smith, Thomas, Johnson, McIlory, Schauffele, Burns and Matsuyama.",
    "Matsuyama last year became the eighth Masters champion out of the past 12 and 12th out of the past 17 who had either a previous green jacket or a top 10 finish on his resume.",
    "Yes, he’s only played in two Masters, finishing T-18 last year and T-19 in 2020, but at some point you have to go with the hot hand, and Scheffler’s are blazing right now.",
    "Last year, he put himself into contention with a second-round 67 and was one stroke off the lead on Saturday before he put a ball into a tributary of Rae’s Creek at No.",
    "That’s Scott, the 2013 Masters champion who hasn’t won anywhere since 2020 at Riviera and has just one top 10 at Augusta National since winning a green jacket.",
    "Hideki Matsuyama entered off showing some mediocre form and left with a fairly surprising green jacket at pretournament odds of somewhere around 40 to 1.",
    "Instead of trying to guess who can win, this exercise will take a look at who most likely cannot win, eliminating their names from betting contention.",
    "But he’s been rounding back into form ever since his tie for eighth at last year’s British Open and has top 10s in three of his last five tournaments.",
    "1 golfer in the Official World Golf Rankings after a truly meteoric rise; the 42 days between his first professional win and his rise to No.",
    "The last seven leaders in approach at the Masters finished first, first, second, third, first, first and eighth for that year’s tournament.",
    "Repeating as Masters champion is also difficult, and only three golfers have ever done it (Jack Nicklaus, Nick Faldo and Tiger Woods).",
    "According to Datagolf, course history is far more predictive at Augusta National than at any other course in the PGA Tour rotation.",
    "Johnson followed up his green jacket at the coronavirus-delayed 2020 Masters with his first Augusta National missed cut since 2014.",
    "Thomas is fifth on tour in strokes gained: approach, which is a key statistic every week but even more so at Augusta National.",
    "And six of the past eight entered the tournament ranked 11th or better in the PGA Tour’s par-4 birdie-or-better statistic.",
    "Only three players have won the Masters in their first appearance at the tournament, the last being Fuzzy Zoeller in 1979.",
    "Thomas has always been a little snake-bitten at Augusta National, with a fourth-place finish in 2020 his only top 10.",
    "Of the past 22 Masters winners, 15 entered the tournament ranked in the top 12 of the Official World Golf Ranking.",
    "Cross them all off: James Piot, Austin Greaser, Laird Shepherd, Keita Nakajima, Stewart Hagestad and Aaron Jarvis.",
    "As for other past winners in the field, they’re either in middling form or simply past their competitive primes.",
    "Lee, Min Woo Lee, Guido Migliozzi, Sepp Straka, Cameron Young, Seamus Power, Harold Varner III and J.J. Spaun.",
    "All of the above picks are fairly chalky, so let’s target at least one golfer who’s a little down the board.",
    "Take away last year’s missed cut, and Johnson has finished no worse than T-10 in five straight Masters.",
    "Thomas hasn’t lost strokes on approach in a tournament since the Scottish Open last July, and he’s No.",
    "He’s won twice already this year, including his most recent tournament at the Players Championship.",
    "Of the past nine Masters champions, seven ranked first or second in the field in par-4 scoring.",
    "This eliminates players such as Koepka (17th), Daniel Berger (21st) and Kevin Kisner (27th).",
    "So there you have it, a field of 91 narrowed down to just a handful of golfers who can win.",
    "Last year’s Masters showed just how hard it is to pick the winner of a golf tournament.",
    "Matsuyama’s best calendar-year finish ahead of last year’s win was a tie for 15th.",
    "The results of the last five Masters defending champions: MC, 38th, 36th, MC, MC.",
    "From there, we can piece together a few golfers to fill out our betting card.",
    "No amateur ever has won the Masters, and there are six in this year’s field.",
    "He’s first in par-4 birdie-or-better percentage and second in par-4 scoring.",
    "The Australian with the proud, flowing mullet checks a whole lot of boxes.",
    "Much of his 2021 was spent putting up similarly unexceptional results.",
    "He’s finished inside the top 10 in three of the last four Masters.",
    "He’s gained strokes on approach in eight of his last 10.",
    "So that’s 13 golfers we can eliminate right off the top.",
    "This could be the year for the 28-year-old Smith.",
    "All of these golfers have my attention, for now.",
    "2 behind Smith in par-4 birdies-or-better.",
    "Of that group, here’s who I like the most.",
    "He ranks sixth in par-4 birdie-or-better.",
    "There, we’ve cut away another 15 golfers.",
    "(I’ll get to Matsuyama in a moment.)",
    "1 is the shortest span by 210 days.",
    "13 and carded a triple-bogey 8.",
    "Another one bites the dust.",
    "What’s not to like?",
    "Six more victims!",
    "He’s now the No."
  ]
}