{
  "id": 1121,
  "mediaId": 2586,
  "date": "2022-04-07",
  "headline": "Bills WR Stefon Diggs Delivers Message to Fans After Signing New Deal",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Stefon-Diggs-Patriots-Fans-e1649361399444.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/diggs-delivers-message-bills-fans/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "I am extremely grateful to my mom, all of the coaches who have impacted my life over the years, my teammates, my agency and, of course, Kim and Terry Pegula, Brandon Beane, and the entire Bills organization.”\nBills Build Future\nAs Katherine Fitzgerald of the Buffalo News noted, the contract extension appeared to be a vote of confidence for Diggs and the effect he’s had on the team.",
    "“Diggs has said how much he loves being in Buffalo, but as the wide receiver market surged, it made sense for the Bills to make sure he was properly compensated.”\nSigned WR Stefon Diggs to a four-year extension through the 2027 season.",
    "The team still has more work this offseason, including finding more cornerback depth after the departure of Levi Wallace and the injury to Tre’Davious White expected to keep him out for at least a portion of the upcoming season.",
    "The All-Pro wide receiver just signed a new contract extension that will keep him in Buffalo through 2027, ending the speculation that the Bills may not be able to afford to give Diggs the pay raise many felt he had earned.",
    "Beane and coach Sean McDermott have both pointed to Diggs’ influence on the team as a whole as a critical reason to keep him around, on top of his franchise records,” Fitzgerald wrote.",
    "Diggs had shared some cryptic messages and deleted his Instagram posts, leading some fans to worry that there could be a rift growing between Diggs and the front office.",
    "But Diggs seemed to squash those rumors on Wednesday, taking to Instagram to let Bills fans know that he’s thrilled to be playing the rest of his career in Buffalo.",
    "Diggs Speaks Out\nIn the weeks leading up to Diggs signing the four-year, $104 million extension, many Bills fans speculated that he was showing signs of discontent.",
    "There was so much work put in to get to this point but I am beyond happy to know that I will be playing the rest of my career with BILLS MAFIA,” Diggs wrote.",
    "pic.twitter.com/4JEcLsHJty\n— Buffalo Bills PR (@BuffaloBillsPR) April 7, 2022\nDiggs has made an immediate impact since joining the Bills in 2020.",
    "In his first season, he recorded career- and league-highs with 127 receptions and 1,535 receiving yards with eight touchdowns.",
    "The deal benefits both Diggs and the team, and was a top offseason priority for Bills general manager Brandon Beane.",
    "After the news of the new deal broke on Wednesday, Diggs took to social media to deliver a message to Bills fans.",
    "Before the Diggs deal, Beane brought in edge rusher Von Miller to shore up the Buffalo defense.",
    "“Beane has locked in Josh Allen’s top receiver in a way that should benefit both sides.",
    "The Bills have now built a team with an elongated window to contend for a Super Bowl.",
    "Stefon Diggs is ready to be with the Buffalo Bills for the rest of his career.",
    "“We live and work in a very competitive and often times uncertain environment.",
    "He also showed appreciation for the entire Bills organization.",
    "Last season, Diggs had a career-high 10 touchdowns.",
    "“Words cannot describe how I’m feeling right now.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!"
  ]
}