{
  "id": 1136,
  "mediaId": 2572,
  "date": "2022-04-07",
  "headline": "Masters 2022: How to watch, tee times, groupings and more",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/Tiger-Woods-Masters-2022-5.jpg",
  "link": "https://www.foxnews.com/sports/masters-2022-tee-times-groupings-more",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Gaydos",
  "authorUrl": "https://www.foxnews.com/person/g/ryan-gaydos",
  "termIds": [
    1313,
    1453,
    1986,
    2492,
    2991,
    3044,
    3515,
    3567,
    4543,
    595
  ],
  "sentences": [
    "8:15 am: Jack Nicklaus, Gary Player, Tom Watson (honorary starters)\n8:30 am: Jose Maria Olazabal, JJ Spaun\n8:41 am: Mike Weir, Padraig Harrington, Austin Greaser (A)\n8:52 am: Larry Mize, Sep Straka, Francesco Molinari\n9:03 am: Fred Couples, Garrick Higgo, Guido Migliozzi\n9:14 am: Vijay Singh, Ryan Palmer, Kyoung-hoon Lee\n9:25 am: Min Woo Lee, Hudson Swafford, Cameron Young\n9:36 am: Stewart Cink, Brian Harman, Harry Higgs\n9:47 am: Zach Johnson, Si Woo Kim, Aaron Jarvis (A)\n10:09 am: Luke List, Matthew Wolff, Mackenzie Hughes\n10:20 am: Danny Willett, Jason Kokrak, Talor Gooch\n10:31 am: Max Homa, Kevin Na, Shane Lowry\n10:42 am: Kevin Kisner, Daniel Berger, Tommy Fleetwood\n10:53 am: Bryson DeChambeau, Cameron Smith, Paul Casey\n11:04 am: Tiger Woods, Louis Oosthuizen, Joaquin Niemann\n11:15 am: Hideki Matsuyama, Justin Thomas, James Piot (A)\n10:26 am: Adam Scott, Scottie Scheffler, Tony Finau\n11:48 am: Sandy Lyle, Stewart Hagestad (A)\n11:59 am: Lucas Glover, Erik Van Rooyen, Cameron Champ\n12:10 am: Bernhard Langer, Christiiian Bezuidenhout, Cameron Davis\n11:21 am: Charl Schwartzel, Robert MacIntyre, Laird Shepherd (A)\n12:32 pm: Gary Woodland, Justin Rose, Takumi Kanaya\n12:43 pm: Lee Westwood, Russell Henley, Corey Conners\n12:54 pm: Patrick Reed, Seamus Power, Lucas Herbert\n1:05 pm: Bubba Watson, Tom Hoge, Keita Nakajima (A)\n1:27 pm: Marc Lieshman, Webb Simpson, Sungjae Im\n1:38 pm: Sergio Garcia, Thomas Pieters, Harold Varner III\n1:49: pm: Abraham Ancer, Tyrrell Hatton, Sam Burns\n2:00 pm: Dustin Johnson, Billy Horschel, Collin Morikawa\n2:11 pm: Will Zalatoris, Patrick Cantlay, Jon Rahm\n2:22 pm: Jordan Spieth, Viktor Hovland, Xander Schauffele\n2:33 pm: Matthew Fitzpatrick, Brooks Koepka, Rory McIlroy\nHow to watch\nGolf fans can watch the first two days of the Masters on Masters.com, the Masters app, ESPN+ and Paramout+.",
    "Past champions\n2021: Hideki Matsuyama\n2020: Dustin Johnson\n2019: Tiger Woods\n2018: Patrick Reed\n2017: Sergio Garcia\n2016: Danny Willett\n2015: Jordan Spieth\n2014: Bubba Watson\n2013: Adam Scott\n2012: Bubba Watson\n2011: Charl Schwartzel\n2010: Phil Mickelson\nTee times and pairings (ET)\n(Kevin C. Cox/Getty Images)\nBad weather pushed the start of the first round backward.",
    "This year’s tournament will be as intriguing as ever as Tiger Woods said earlier in the week he intends on playing more than a year after suffering devastating leg injuries in a Los Angeles car crash.",
    "Woods hasn’t competed in the Masters since 2020 – the last event in which he faced high-level competition.",
    "TV coverage of the first two rounds on ESPN won’t begin until around 3 p.m.",
    "Woods added he believes he could win the green jacket again as well.",
    "The 86th edition of the Masters is set to tee off Thursday morning.",
    "He competed in the PNC Championship in 2021 with his son, Charlie.",
    "Ryan Gaydos is the sports editor for Fox News and Fox Business.",
    "CBS’ TV coverage will begin Saturday will also start at 3 p.m.",
    "Xander Schauffele and Jordan Spieth lost by three strokes.",
    "The Masters is the premier event of the golf season.",
    "Hideki Matsuyama is the defending Masters champion.",
    "Here’s what to know about this year’s tournament.",
    "Story tips can be sent to Ryan.Gaydos@fox.com.",
    "He beat out Will Zalatoris by one stroke.",
    "Here's the updated tee times below.",
    "ET and Sunday at 2 p.m.",
    "ET.",
    "ET."
  ]
}