{
  "id": 1140,
  "mediaId": 2586,
  "date": "2022-04-03",
  "headline": "Bills Rumors: Former Pro Bowl Cornerback, DPOY Could Return to Buffalo",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Stephon-Gilmore-Bills-e1649032859452.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-rumors-stephon-gilmore-return/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "Pro Football Focus predicted that Nelson would fetch a two-year, $14 million contract with $8.5 in guaranteed money, which could be much more in line with Buffalo’s budget than the two-year, $28 million contract that the outlet predicts Gilmore will earn.",
    "ESPN’s Jeremy Fowler reported on April 3 that the Bills are among a small group of teams showing interest in veteran cornerback and former Defensive Player of the Year Stephon Gilmore, one of the top free agents left on the market.",
    "pic.twitter.com/AUUZtEc56S\n— Buffalo Fanatics (@BfloFanatics) April 3, 2022\nGilmore played only eight games last season while hampered by a quad injury, splitting time between the New England Patriots and Carolina Panthers.",
    "Fowler noted that free agents over 30 typically struggle to get big-money contracts, but Gilmore is the best remaining player on the market and the high level of interest could lead to a significant contract.",
    "He’s also like [Tyrann Mathieu]—willing to take his time if he has to.”\nBleacher Report is reporting on NFL Rumors: The #Bills, #Cheifs and #Eagles have interest in signing CB Stephon Gilmore.",
    "Like, you know, we’re never satisfied.”\nFollowing the early wave of free agency, a look at where all 32 NFL teams officially stand in terms of cap space, from the Panthers to the Giants.",
    "The Bills are looking to fill some holes in the secondary, especially with their own All-Pro corner Tre’Davious White expected to miss a chunk of the season while rehabbing a torn ACL.",
    "Bills general manager Brandon Beane has made it clear that the team doesn’t have the cap space for any more free agents, though he could have a few tricks to free up space.",
    "“He allowed the highest passer rating when targeted since his rookie season (103.5), and 46.4% of his receptions allowed went for a first down or touchdown.",
    "Philadelphia Eagles need a starting corner — there’s belief to be interest on him around the league with the Eagles,” Fowler said, via Bleacher Report.",
    "He still managed to make a significant impact with the Panthers, making 16 tackles and two interceptions while earning a spot in the Pro Bowl.",
    "Bills Showing Interest in Gilmore\nAs Fowler reported, there are several contenders looking into Gilmore, though none have taken the lead yet.",
    "“Nelson had a bit of a down year in 2021, as he allowed a 65.2% completion percentage when targeted and four touchdowns,” the outlet noted.",
    "The team reportedly showed interest last offseason in veteran Steven Nelson, who ended up signing with the Philadelphia Eagles.",
    "pic.twitter.com/rOBNzOb5IJ\n— Field Yates (@FieldYates) March 31, 2022\nThe Bills could have some cheaper options at cornerback.",
    "He performed better in the past, and due to the streaky nature of coverage performance, he could easily rebound next season.”",
    "As PFF noted, the free-agent Nelson could be due for a bounce-back season after a rough season with the Eagles.",
    "Bills Looking at Cheaper Options\nCost could be a prohibitive factor for the Bills in the race for Gilmore.",
    "That list includes the Bills, the team that took Gilmore in the first round of the 2012 NFL Draft.",
    "The Buffalo Bills could be working on a reunion with their former Pro Bowl cornerback.",
    "He played there as a rookie; maybe there’s a reunion in the works potentially.",
    "“Kansas City Chiefs have done their homework on him; there’s interest there.",
    "Stephon GIlmore defends a pass in a game against the Pittsburgh Steelers.",
    "Buffalo Bills, they’ve been looking at some starting cornerback help.",
    "“My main focus right now is just the [NFL] Draft,” Beane said.",
    "“We’re out of money, unless you guys have some here.",
    "So yeah, other than that, I mean, we’ll always look.",
    "The latest Bills news straight to your inbox!",
    "Could you imagine Gilmore back in #Buffalo?",
    "Join the Heavy on Bills newsletter here!",
    "But nothing really cooking right now.",
    "“There’s some other wild-card teams.",
    "After the draft, we’ll be looking.",
    "We’re always looking."
  ]
}