{
  "id": 1145,
  "mediaId": 2644,
  "date": "2022-04-04",
  "headline": "Masters betting: Modeling strategy to help you make the best golf bets",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/Tiger-Woods-practice-masters-2022.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/04/04/2022-masters-betting-golf-bets-and-modeling-strategy/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Hennion",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are the leaders in strokes-gained: approach over the last 36 rounds in addition to their betting odds:\nViktor Hovland (+2000)\nRussell Henley (+6600)\nPaul Casey (+6600)\nDaniel Berger (+4000)\nShane Lowry (+5000)\nCheck out the best sports betting sites and apps\nStatistic #3 – Good Drives Gained (21 percent emphasis)\nAlthough the fairways are much wider than the average tour stop – 46 yards wide vs. 32 yards on average for the season – the penalty for missing is also greater.",
    "Here are the good drives gained leaders over the last 36 rounds with odds for the week:\nCorey Conners (+6000)\nJon Rahm (+1000)\nDaniel Berger (+4000)\nTom Hoge (+15000)\nWill Zalatoris (+3300)\nStatistic #4 – Bogey Avoidance (17 percent emphasis)\nThis statistic is a correlation play for me alongside strokes-gained: par 5’s as I want players who can, for lack of a better phrase, play boring golf when required.",
    "Here are the leaders in this category over the last 36 rounds as well as their betting odds for this week:\nPatrick Cantlay (+2000)\nMatt Fitzpatrick (+5000)\nScottie Scheffler (+1600)\nBryson DeChambeau (+4000)\nCameron Smith (+1400)\nStatistic #2 – Strokes-Gained: Approach (24 percent emphasis)\nPer data-golf.com, this strokes-gained element has the strongest correlation in terms of winning the event.",
    "Here are the leaders over the last 36 rounds in terms of bogey avoidance as well as their odds for the week:\nSungjae Im (+6000)\nTom Hoge (+15000)\nSeamus Power (+10000)\nDaniel Berger (+4000)\nWill Zalatoris (+3300)\nStatistic #5 – Scrambling (13 percent emphasis)\nIf there are one (of many) things we know about Augusta National, it’s that creativity around the greens will go a long way.",
    "Statistic #1 – Strokes-Gained: Par 5’s (25 percent emphasis)\nThere’s a key reason behind this being my most important factor this year – winners tend to play the four Par 5’s – holes two, eight, 13, and 15 – quite well.",
    "Plus, the Augusta National greens are smaller than the average PGA Tour square footage – this week’s greens average about 6,435 square feet in size whereas a typical tour stop comes in at 6,600 square feet.",
    "That said, here are the leaders in scrambling across the last 36 rounds:\nRobert MacIntyre (+12500)\nKevin Na (+17500)\nRory McIlroy (+1600)\nDaniel Berger (+4000)\nChristiaan Bezuidenhout (+15000)",
    "Plus, driving accuracy correlates slightly stronger with finishing position than driving distance, so I’m really looking for a player that knows how to plot his way around the course.",
    "All of the last five winners have finished fifth or better in total strokes-gained: approach for the week, including a fourth-place finish in the category for Matsuyama last year.",
    "Therefore, a demonstrated ability to escape those situations without dropping shots could be the difference between a green jacket or settling for that standard blue blazer.",
    "So, while it’s certainly not the most important statistical factor of the week, players who consistently find the short grass should finish near the top of the leaderboard.",
    "The key percentage to keep in mind here is 16 percent, a percentage all five of the last champions have finished under in terms of total holes bogeyed for the weekend.",
    "Those stats tell me the player that wins this week is whoever can take advantage of those four holes and that is why I’m opting to place so much emphasis on it.",
    "Our best bets for the event will come later on, but for now, we’re going to focus on the key statistical factors that will decide players’ finishing positions.",
    "As evidenced by the earlier metrics in terms of Par 5 scoring, there aren’t many opportunities available on the remaining 14 holes in each individual round.",
    "But if players can grind out pars on those holes and avoid recording big numbers, they should set themselves up nicely to have a chance on Sunday.",
    "This stat likely won’t decide the champion – like the first two highly emphasized stats might – so I don’t want to over-inflate its importance.",
    "As a result, I’m looking for players with accurate irons who can hit a lot of greens in regulation and not have to scramble to save par.",
    "Per data-golf.com, a missed fairway penalizes players by 0.39 strokes, just slightly higher than the average (0.37) at other events.",
    "Given the aforementioned small greens, it’s a safe assumption players are going to miss the putting surface from time to time.",
    "Distance is helpful, but those types of players (cough cough: Bryson DeChambeau) will likely find trouble every now and then.",
    "While none of the four previous champions before Matsuyama had a similar experience, all did very well on the Par 5’s.",
    "Here are the winning scores for the last five Masters champions as well as their scores on the Par 5’s for the week.",
    "That’s of course assuming they’re also doing their jobs on the four Par 5’s where scoring is absolutely critical.",
    "Close behind are Justin Thomas (+1200), Cameron Smith (+1400), and 2020 winner Dustin Johnson (+1600).",
    "The world’s best will descend upon Augusta National Golf Club to vie for a coveted green jacket.",
    "That said, it’s not the most important factor for me in this model, hence the low emphasis.",
    "Jon Rahm (+1100), a perennial Masters contender, arrives as the favorite to win the event.",
    "Without further delay, here is my modeling strategy for the 2022 Masters Tournament.",
    "However, he was -11 on those four aforementioned holes across four days of play.",
    "Last year, Hideki Matsuyama finished with a winning score of 10-under par.",
    "It’s official: the first major on the PGA Tour calendar year has arrived!"
  ]
}