{
  "id": 1152,
  "mediaId": 2586,
  "date": "2022-04-06",
  "headline": "Bills WR Shares Hilarious Reaction to Stefon Diggs’ New Deal",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Isaiah-McKenzie-Stefon-DIggs-e1649292026126.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-mckenzie-reaction-diggs-deal/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "He’s been great for our offense, and his leadership has stepped up, and we want to see Stef in Buffalo for years to come.”\nMcKenzie Happy Too\nWhile a number of Diggs’ teammates took to social media to share their congratulations, McKenzie offered a measure of relief.",
    "After social media posts from Diggs that some fans interpretted as discontented in the weeks leading up to the new deal, the Bills receiver took a much different tone in announcing the deal on Wednesday.",
    "He previously served as a return specialist who occassionally took jet-sweep handoffs out of the backfield, but took on a bigger role in the passing game with Beasley out for a stretch this season.",
    "When McKenzie signed a new contract with the Bills back in March for two years and $8 million, Diggs reportedly tried to take credit — and squeeze something of a commission out of his teammate.",
    "200k not 200 dollars https://t.co/E8H6zZOrnw\n— DIGGS (@stefondiggs) March 14, 2022\nBut McKenzie seemed to think that the deal was off after Diggs signed his massive extension on April 6.",
    "Diggs’ New Deal\nAs ESPN’s Alaina Getzenberg reported, the team gave Diggs an extension that will run through the 2027 season and gives him $70 million in guaranteed money.",
    "With the Bills releasing slot receiver Cole Beasley earlier in the offseason, McKenzie has the chance to play an expanded role in the offense next season.",
    "In his first season with the team in 2020, Diggs recorded career- and league-highs with 127 receptions and 1,535 receiving yards with eight touchdowns.",
    "McKenzie shared that Diggs had demanded $200 for helping him earn the new contract, and Diggs corrected him to say that it was actualy $200,000.",
    "“There was so much work put in to get to this point but I am beyond happy to know that I will be playing the rest of my career with BILLS MAFIA.",
    "McKenzie turned in a career-best performance in a December win over the New England Patriots, making 11 catches for 125 yards and a touchdown.",
    "The deal ends the uncertainty of Diggs’ future with the Bills, and led to some relief for fellow receiver Isaiah McKenzie.",
    "Even before the deal was reported on Wednesday, Bills general manager Brandon Beane hinted that Diggs had earned a raise.",
    "Diggs had only two years left on his existing contract, but the new extension means he will likely retire with Buffalo.",
    "If there’s anyone as excited as Stefon Diggs is with his new contract, it’s his slightly more cash-strapped teammate.",
    "“I want to give all players their respect and a fair pay, whoever it is, and Stef’s no different,” Beane said.",
    "The Buffalo Bills wide receiver signed a new four-year extension with the team worth a reported $104 million.",
    "“[Buffalo Bills] good looking out, because i was not trying to pay [Diggs] 200K,” he tweeted.",
    "Isaiah McKenzie and Stefon Diggs celebrate a touchdown in a game against the New York Jets.",
    "Diggs has helped turn the Bills into Super Bowl contenders over his two years in Buffalo.",
    "Words cannot describe how I’m feeling right now,” Diggs wrote in an Instagram post.",
    "As Getzenberg noted, Diggs topped his career high with 10 touchdowns last season.",
    "I think what he’s brought our team has been great.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "“… I think the world of Stef.",
    "He’s been great for Josh."
  ]
}