{
  "id": 1165,
  "mediaId": 2732,
  "date": "2022-04-05",
  "headline": "First Call: Multiple storylines emerge about Steelers safety position while 1 draft pick trade could impact team",
  "image": "",
  "link": "https://triblive.com/sports/first-call-multiple-storylines-emerge-about-steelers-safety-position-while-1-draft-pick-trade-could-impact-team/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Benz",
  "authorUrl": "https://triblive.com/author/tim-benz/",
  "termIds": [
    1873,
    1919,
    2129,
    2609,
    3273,
    3686,
    3773,
    823
  ],
  "sentences": [
    "• She said a contract extension for Minkah Fitzpatrick is “very, very close to getting done.” When asked by host Andrew Fillipponi if the contract would make him the highest-paid safety in the league, Kinkhabwala said, “I expect that.”\n• On the prospect of signing ex-Kansas City safety Tyrann Mathieu, she said, “I have been told that ‘Honey Badger’ may not need quite as much money as I was told he needed a week ago.” Kinkhabwala went on to say that Mathieu believes “the idea of playing for Mike Tomlin is very enticing” and that “perhaps the monetary hopes and demands aren’t quite what they once were.”\n• Regarding current Steelers free agent safety Terrell Edmunds, Kinkhabwala says there is “still an offer on the table” for him.",
    "With depth concerns at wide receiver, running back and defensive line already staring them in the face, I would expect the Steelers to sign a veteran safety of some starting repute regardless of how much Fitzpatrick’s wallet is stuffed before the draft weekend rolls around at the end of the month.",
    "The coach also hopes captain Gabriel Landeskog will be back before playoffs begin, and defenseman Ryan Murray could also be ready around then.”\nThe Avalanche have the NHL’s best point total with 104.",
    "Tuesday’s “First Call” sees some possible movement soon at the safety position for the Pittsburgh Steelers, and movement in front of them on the draft board may influence the quarterbacks available.",
    "Safety first … and maybe second and third\nNFL Network reporter Aditi Kinkhabwala dropped multiple nuggets about the Steelers safety position during her weekly appearance on 93.7 The Fan.",
    "— Aditi Kinkhabwala (@AKinkhabwala) April 4, 2022\nIf the Steelers are as interested in drafting a quarterback as they appear to be, an NFL trade yesterday may influence who is available.",
    "Meanwhile, the Boston Bruins pulled into a third place tie with the Tampa Bay Lightning at 93 points apiece (and the Bruins actually have one more win with 44).",
    "Although, how much money they give Fitzpatrick and how it can be spread out may influence their ability to sweeten an offer to get Mathieu or retain Edmunds.",
    "But she said he still has multiple offers from other teams that he is considering and may not be all that interested in the Steelers proposal financially.",
    "Two-way street\nIt’s not just the Penguins who are worried about health and injuries heading into Tuesday night’s rematch with the Colorado Avalanche.",
    "Atlantic action\nThree likely Eastern Conference playoff teams were in action Monday as postseason spots continue to shuffle in the Atlantic Division.",
    "Sam Howell follows Fri, Carson Strong and Matt Corrall in next week and Malik Willis is slated to come to town the week after, per source w/in org.",
    "The New Orleans Saints — another team believed to be interested in some of the names listed above — just acquired an extra first-round pick.",
    "20, or they could package something to move higher up the board if they feel like one of the quarterbacks is on the verge of being taken.",
    "Fitzpatrick extending his contract to me is a given in whatever equation the Steelers front office is formulating for its secondary.",
    "Also via The Athletic’s Peter Baugh, “Nazem Kadri is out, but coach Jared Bednar expects he’ll be back for the playoffs.",
    "The 20-year-old former first-round pick suffered a concussion on Nov. 11 and hasn’t played in the NHL since Jan. 10.",
    "Anthony Angello, Danton Heinen and Kasperi Kapanen missed the Penguins’ practice because of an undisclosed illness.",
    "Two of the teams were playing each other as the Toronto Maple Leafs were in Tampa Bay to play the Lightning.",
    "Avs defenseman Bo Byram was recalled by the Avs and was photographed joining the team flight to Pittsburgh.",
    "The Steelers still have more than $13 million in salary cap space remaining, according to OverTheCap.com.",
    "No signing of the available safeties would be in place of — or a hindrance to — extending Fitzpatrick.",
    "He has also tied the Leafs’ franchise record for goals in the season set by Rick Vaive in 1981-82.",
    "Kinkhabwala also tweeted the Steelers’ schedule for visits with some draft-eligible quarterbacks.",
    "We can’t wrap up any Steelers conversation without mentioning the quarterback situation, right?",
    "Both clubs entered the game with 93 points, tied for second place behind the Florida Panthers.",
    "That’s because they edged the Columbus Blue Jackets 3-2 in overtime on a Jake DeBrusk goal.",
    "We check in on the health of the Penguins and Avalanche in advance of Tuesday night’s game.",
    "And there was plenty of activity in the Eastern Conference playoff picture Monday night.",
    "So that means that the Panthers (102 points) now have a seven-point edge on the Leafs.",
    "— Toronto Maple Leafs (@MapleLeafs) April 5, 2022\nMatthews has 54 goals on the season.",
    "So that means the Saints now have at least two picks in front of the Steelers at No.",
    "According to Colorado Hockey Now, he has been on the ice in a red no-contact jersey.",
    "The Saints also traded their 2023 first-round pick and their 2024 second-rounder.",
    "It’s a massive shakeup for not just this year’s draft, but the next two cycles.",
    "As compensation, the Saints shipped out their initial 2022 first-rounder at No.",
    "He has been with the AHL Colorado Eagles on a conditioning assignment.",
    "The Avalanche still are without injured defenseman Samuel Girard.",
    "(Kenny Pickett, considered local, already met w/ OC Matt Canada.)",
    "All emails are subject to publication unless specified otherwise.",
    "#Steelers QB draft visit train starts Thurs w/ Desmond Ridder.",
    "The Penguins are still missing Jason Zucker due to injury.",
    "You can contact Tim at tbenz@triblive.com or via Twitter.",
    "18, as well as a compensatory third-round selection (No.",
    "Toronto won 6-2 behind a hat trick from Auston Matthews.",
    "16 and 19 (and also picked up a sixth-round pick at No.",
    "Categories: Sports | Steelers/NFL | Breakfast With Benz",
    "They beat the Penguins 3-2 on Saturday in Denver.",
    "He skated in a tracksuit after practice Monday.",
    "New Orleans will now make selections at Nos.",
    "Tim Benz is a Tribune-Review staff writer.",
    "That was DeBrusk’s 24th of the season.",
    "101) and their seventh-rounder (No.",
    "And what about the quarterbacks?",
    "All tweets could be reposted.",
    "That’s 18th in the league.",
    "That leads the NHL.",
    "194 overall).",
    "237)."
  ]
}