{
  "id": 1168,
  "mediaId": 2586,
  "date": "2022-04-09",
  "headline": "Ex-Steelers Quarterback Signs Deal with Browns: Report",
  "image": "https://heavy.com/wp-content/uploads/2022/04/abc-12.jpeg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/ex-steelers-quarterback-signs-browns-report/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DJ Siddiqi",
  "authorUrl": "https://heavy.com/author/lizdelasko89/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The Steelers are still leaning on their defense to win now, and Mathieu next to Minkah Fitzpatrick would give them one of the league’s rangiest safety pairings.”\nMathieu visited the New Orleans Saints’ team facility earlier this week and had a virtual visit with the Philadelphia Eagles.",
    "There’s room for a third ahead of training camp.”\nIt was actually Dobbs’ second tryout in recent weeks as he also had a workout with the New England Patriots on March 21, according to Michael David Smith of Pro Football Talk.",
    "While the signing would make sense from a personnel standpoint — the Steelers are still seeking a starting strong safety — general manager Kevin Colbert seemed to rule out the idea of signing Mathieu in late March.",
    "Dobbs’ Long History With Steelers\nAfter spending his first two seasons with the Steelers, he was traded to the Jacksonville Jaguars prior to the start of the 2019 NFL season for a fifth-round draft pick.",
    "However, the situation not only complicates itself due to Cleveland finding difficulty in a trade partner for Mayfield, Watson’s near-term NFL future is uncertain due to his pending civil lawsuits.",
    "The former Steelers backup will join a Browns quarterback room that currently features projected starter Deshaun Watson, returning starter Baker Mayfield and newly signed backup Jacoby Brissett.",
    "Steelers Considered ‘Landing Spot’ for Tyrann Mathieu\nIf you’re wondering where notable safety Tyrann Mathieu could possibly sign, the Steelers are a potential landing spot, says one analyst.",
    "Via Brooke Pryor of ESPN:\n“Our preference is always to add players coming off of their first contract or as close to their first contract as they can be,” said Colbert.",
    "At the very least, Dobbs figures to have an opportunity to provide insurance for the Browns as a backup or practice squad quarterback if Watson is indeed suspended.",
    "“The market for ‘Honey Badger; has been unusually slow, which only makes Pittsburgh a better option considering the lack of overpriced bids,” says Benjamin.",
    "With all of that said, it’s going to be difficult and awkward for the Browns to enter the season with Mayfield on the roster as insurance for Watson.",
    "Dobbs has six career appearances to his name — five during the 2018 season as the Steelers’ primary backup and one during the 2020 season.",
    "According to CBS Sports’ Cody Benjamin, Pittsburgh is a potential destination for Mathieu, who remains unsigned deep into April.",
    "Earlier this week, the ex-Steelers quarterback had a tryout with another AFC North division rival — the Baltimore Ravens.",
    "Dobbs would then join the Steelers again after he was waived by the Jaguars prior to the start of the 2020 season.",
    "The 27-year-old initially arrived in the NFL as a fourth-round draft pick of Pittsburgh in the 2017 NFL draft.",
    "According to his agent Mike McCartney, Joshua Dobbs is joining the Cleveland Browns on a one-year deal.",
    "The University of Tennessee product spent the 2021 season on injured reserve due to a toe injury.",
    "Dobbs worked out with the Ravens on Monday, April 4, according to The Athletic’s Jeff Zrebiec.",
    "Dobbs is best known for his two different stints with the Steelers as a backup quarterback.",
    "“Per today’s personnel notice, the Ravens worked out former Steelers QB Josh Dobbs today.",
    "The situation appears to be a fluid one as the Browns seek a trade partner for Mayfield.",
    "“Excited for @josh_dobbs1 agreeing to a 1 year deal with the @Browns,” says McCartney.",
    "The 29-year-old safety entered the offseason considered one of the top free agents.",
    "Especially considering Mayfield demanded a trade prior to the Watson acquisition.",
    "A former Pittsburgh Steelers quarterback is joining a familiar divisional rival.",
    "McCartney took to Twitter on Friday, April 8 to report the news.",
    "ALL the latest Steelers news straight to your inbox!",
    "Join the Heavy on Steelers newsletter here!",
    "Ravens have 2 QBs on their roster."
  ]
}