{
  "id": 1183,
  "mediaId": 2586,
  "date": "2022-04-06",
  "headline": "Emmanuel Sanders ‘Looking Forward to Seeing’ Mitch Trubisky With Steelers",
  "image": "https://heavy.com/wp-content/uploads/2022/04/GettyImages-130149296.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/emmanuel-sanders-former-teammate-mitch-trubisky/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Zasky",
  "authorUrl": "https://heavy.com/author/jasongzasky6/",
  "termIds": [
    0
  ],
  "sentences": [
    "Mitch Trubisky to Host Steelers Players at His Florida Home\nMeanwhile, on Tuesday April 5 Aditi Kinkhabwala of NFL Network reported that Trubisky is having the team’s skill-position players come down to his Florida home this weekend to “throw and hang out.”\nKinkhabwala indicates that the Steelers’ pass-catchers will be in attendance, as will starting running back Najee Harris and the team’s two other quarterbacks—Mason Rudolph and Dwayne Haskins.",
    "ALSO READ:\n• Steelers Insider Provides Update on Minkah Fitzpatrick Contract Negotiations\n• Taco Charlton Has Message for Steelers Fans After Signing With Saints\n• Free Agent QB Josh Dobbs Works Out for Steelers’ Hated Archrival\n• Steelers Named ‘Best Scheme Fit’ for 2 Top QBs in 2022 NFL Draft\n• Steelers’ Cam Heyward Named Best-Ever Player Drafted No.",
    "He spent the first four years of his career catching passes from Ben Roethlisberger, having been part of Pittsburgh’s so-called Young Money Crew in the early 2010s, when ‘Easy Money’ Sanders was part of ‘The Young Money Crew’ of Steelers receivers that also included Hines ‘Old Money’ Ward, Antonio ‘Cash Money’ Brown and Mike ‘Fast Money’ Wallace.",
    "https://t.co/b979oLQCTG\n— Albert Breer (@AlbertBreer) April 5, 2022\nBreer went on to add that the “play-time triggers start at 60% (and) go up from there.”\nHere's a gift for you—play-time triggers start at 60%, go up from there.",
    "He’s an athletic guy, he can run, he can throw and I’m looking forward to seeing it,” concluded Sanders, who had 42 receptions for 626 yards and four touchdowns in 2021, according to Pro Football Reference.",
    "According to NFL reporter Albert Breer the contract features a total of $8.5 million in incentives: $4 million each year in playing time incentives and $250,000 per year for earning Pro Bowl honors.",
    "Mitch Trubisky’s Contract Incentives Revealed\nOn April 5, 2022, we also learned more about the contract incentives that are included in the two-year contract that Trubisky agreed to on March 14.",
    "But he still made an impression on former Steelers wide receiver Emmanuel Sanders, who like Trubisky, spent last season in Buffalo, having inked a one-year contract with the Bills in March 2021.",
    "In February he appeared on The Herd With Colin Cowherd and revealed that he hasn’t yet made up his mind as to whether he’s going to retire or try to catch on with another Super Bowl contender.",
    "“He’s kind of laid back, chill, but everything that I saw from him, I saw a guy who makes plays,” he said, before noting that there are yet-to-be answered questions about the former No.",
    "New Pittsburgh Steelers quarterback Mitch Trubisky didn’t get much opportunity to play last season with the Buffalo Bills, owing to the fact that he was serving as Josh Allen’s backup.",
    "The incentives, by the way, aren't crazy …\n• $4 million each year in play-time incentives (these will be pretty achievable if he starts and stays healthy all the way through).",
    "— Aditi Kinkhabwala (@AKinkhabwala) April 5, 2022\nIt’s an opportunity to begin bonding and establishing on-field chemistry before the first OTAs take place between May 24-26.",
    "Wide receiver Emmanuel Sanders of the Pittsburgh Steelers celebrates after scoring on a four-yard touchdown reception against the Arizona Cardinals on October 23, 2011.",
    "He’s having the #Steelers pass-catchers and the other QBs (Mason Rudolph and Dwayne Haskins) down to his FL home this weekend to throw and hang out.",
    "pic.twitter.com/J5bOt3UWQt\n— Good Morning Football (@gmfb) April 4, 2022\nSanders, 35, was a third-round pick of the Steelers in 2010 out of SMU.",
    "— Albert Breer (@AlbertBreer) April 5, 2022\nFollow the Heavy on Steelers Facebook page for the latest breaking news, rumors and content!",
    "Fast forward to today and Sanders remains an unrestricted free agent following the completion of his twelfth NFL season.",
    "During his appearance on NFL Network’s Good Morning Football on April 4, Sanders was asked about his former teammate.",
    "And how “hungry” is he, now that he has the opportunity to potentially regain a starting NFL job.",
    "— @ESanders_10\nAre the Steelers better off today than they were at the end of last season?",
    "\"Everything I know about the guy, he (Mitch Trubisky) produced when we called upon him.\"",
    "Remember Mitch Trubisky talking about coming into Pittsburgh and leading right away?",
    "So obviously those being NLTBE help manage the cap, while being fair to Mitch.",
    "As in, how much did he learn from watching Josh Allen for a year?",
    "The latest Steelers news straight to your inbox!",
    "“I’m looking forward to seeing what he can do.",
    "Join the Heavy on Steelers newsletter here!",
    "• $250,000 Pro Bowl incentive each year.",
    "I’m told RB Najee Harris is going too.",
    "Pretty fair all the way around.",
    "2 overall pick.",
    "31 Overall"
  ]
}