{
  "id": 1216,
  "mediaId": 2592,
  "date": "2022-04-06",
  "headline": "Woods Defies The Odds In Quest For Sixth Masters Title",
  "image": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2022/04/06/five-time-champion-tiger-woods-plays-a-practice.jpg",
  "link": "https://www.ibtimes.com/woods-defies-odds-quest-sixth-masters-title-3464769?utm_source=Public&utm_medium=Feed&utm_campaign=Distribution",
  "mediaOutlet": "IBTimes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca BRYAN",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Spain's US Open champion Jon Rahm, 27, can regain the number one ranking he ceded to Scheffler with a first Masters victory, one of five players who can supplant the American this week along with reigning British Open champion Collin Morikawa, US PGA FedEx Cup champion Patrick Cantlay, rising Norwegian star Viktor Hovland and Aussie Cameron Smith.",
    "Northern Ireland's four-time major-winner Rory McIlroy will be trying for the eighth time to complete a career Grand Slam with a Masters victory, while defending champion Hideki Matsuyama of Japan is battling fitness concerns as he tries to join Jack Nicklaus, Nick Faldo and Woods as the only players to win back-to-back Masters titles.",
    "Fred Couples, the 1992 Masters champion who has played his share of rounds -- and missed his share as well -- with back trouble, said Woods \"looked phenomenal\" in practice rounds that had patrons at Augusta National buzzing with excitement.",
    "Matsuyama tees off in the group after Woods at 10:45 a.m. Rahm tees off alongside Cantlay and Will Zalatoris at 1:41 p.m. (17:41GMT), followed by Hovland, in a group with Spieth and Tokyo Olympic champion Xander Schauffele, at 1:52.",
    "The 46-year-old, who has slumped to 973rd in the world rankings, couldn't even confirm until Tuesday that he planned to tee it up, but make no mistake, Woods has his sights set on a record-equalling sixth Masters victory.",
    "But all the focus is on Woods, and whether he can pull off the most miraculous comeback yet in a career marked as much by his gritty determination to defy pain as by his sublime skill.",
    "Then, the 21-year-old Woods cemented his superstar status with a record-setting victory that made him the youngest Masters winner, nabbing the first of his current 15 major titles.",
    "Woods won the 2008 US Open with a broken leg, then battled through five back surgeries, including at last a spinal fusion, before he won his 15th major title at the 2019 Masters.",
    "\"It's amazing if you think about where he was at a year ago to now, I don't know how many people, if anybody, could be out here,\" said 2015 Masters winner Jordan Spieth.",
    "Tiger Woods was poised to launch his boldest Masters bid yet on Thursday, a quarter-century after his 12-shot triumph at Augusta National heralded a new era in golf.",
    "Former PGA Champion Justin Thomas, who Woods refers to as his \"little brother\" on tour, says Woods's game is \"plenty, plenty good enough to play well.\"",
    "Scottie Scheffler, 25, arrived at Augusta ranked number one in the world after winning his first three US PGA Tour titles in the space of two months.",
    "The action will official get underway at 7:40 when honorary starters Nicklaus, Gary Player and Tom Watson make the ceremonial first tee shots.",
    "16 comes 14 months after Woods suffered career-threatening injuries to his lower right leg in a February 2021 single-car crash in California.",
    "Niemann, who won the Woods-hosted Genesis Invitational at Riviera in February, wasn't born when Woods won his first Masters title in 1997.",
    "So Woods will once again defy the pain and try to defy the odds to move one step closer to Nicklaus's all-time record of 18 major titles.",
    "\"That's going to be the challenge, and it's going to be a challenge of a major marathon,\" said Woods, who was unable to walk for months.",
    "He would become the third-oldest major winner in history and would surpass Nicklaus as the oldest Masters winner by a matter of weeks.",
    "\"I don't show up to an event unless I think I can win it,\" Woods said, expressing complete confidence in every aspect of his game.",
    "McIlroy is in the final group of the day alongside four-time major winner Brooks Koepka and England's Matthew Fitzpatrick.",
    "Woods tees off on Thursday at 10:34 am (14:34GMT) alongside South African Louis Oosthuizen and Chilean Joaquin Niemann.",
    "The challenge will be simply walking the hilly, 7,510-yard Augusta National course for four straight days.",
    "\"What impresses me the most is he was bombing it,\" Couples said of Woods's length off the tee.",
    "And does that mean he believes he can produce his most unlikely triumph to date this Sunday?",
    "But he's among a raft of young golfers whose careers were inspired by Woods.",
    "\"And I feel like if I can still compete at the highest level I'm going to.",
    "And if I feel like I can still win, I'm going to play.\"",
    "\"I love competing,\" Woods said of his motivation.",
    "\"I mean, how many comebacks has he had?\"",
    "\"But is anybody surprised?\"",
    "\"I do,\" Woods said.",
    "Spieth marvelled.",
    "His quest for No."
  ]
}