{
  "id": 1260,
  "mediaId": 2584,
  "date": "2022-04-08",
  "headline": "Tiger Woods writes latest redemption tale as Scheffler surges into Masters lead",
  "image": "https://i.guim.co.uk/img/media/38838c55a25de6e53c91dccdeff4c87493763fbc/0_251_6010_3608/master/6010.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d3b619f8f0f5e5416ac616981c51ae33",
  "link": "https://www.theguardian.com/sport/2022/apr/09/masters-golf-tiger-woods-scottie-scheffler-day-two-report",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Murray",
  "authorUrl": "https://www.theguardian.com/profile/ewanmurray",
  "termIds": [
    0
  ],
  "sentences": [
    "After his round, Scheffler told US TV the secret to his success had been “managing my way around the course … when I’ve got out of position, I’ve done a good job getting the ball back in play.” The 25-year-old appeared relaxed at the prospect of being the player to beat this weekend.",
    "Whether he can joust for what would be a sixth Masters title remains to be seen – the imperious Scottie Scheffler is among those standing in his way – but the manner in which he rebounded from such a shaky opening to the second round was arguably more impressive than day one’s 71.",
    "When I saw I had taken the lead today, my first thought was just to keep trying to build it.”\nShane Lowry, playing in the toughest of the day’s conditions, posted a 68 to join Schwartzel, Im and the defending champion, Hideki Matsuyama, in a share of second place.",
    "“I just thought I could listen to everyone and play that type of game but I’ve been feeling comfortable over a lot of tee shots, which is a big part out here, and then just kind of making my way through.”\nFor Stewart Cink, there was a marquee moment at the 16th.",
    "Justin Thomas came agonisingly close to matching Cink’s feat on the same hole but this was still a profitable day for the 28-year-old, who responded to an opening 76 by firing himself firmly back into the tournament’s discussion.",
    "Aberrations at the next two holes – he missed a short putt for par at the 11th and could not rescue a three from a back bunker at the next – were offset by back-to-back birdies.",
    "The 2020 champion perhaps has a point to prove; at the time of his win, there were no spectators at Augusta and the course was as defenceless as the November date would imply.",
    "Scheffler, the world No 1, reached six under par and minus three for the day thanks to a birdie at the 13th that was out of context with the struggles of so many others.",
    "“I think my issue is I listen to everyone else rather than trusting myself on how to play this golf course,” said Morikawa after a 70 edged him to one under.",
    "Television executives, conscious of ratings figures fired into fresh stratospheres by Woods’s unlikely involvement, were coming out in cold sweats.",
    "Jordan Spieth’s failure to survive for the weekend owed plenty to the hole which fatally wounded his bid for a successful Masters defence in 2016.",
    "“That’s the hardest thing, you hear all these things about this course and you really don’t know how to play it until you actually show up.",
    "Sandy Lyle, the 1988 champion, said after his rounds of 82 and 76 that 2023 at Augusta is likely to mark his last major appearance.",
    "At the 10th, a hole that causes palpitations to most, Woods played one of the approach shots of the tournament to set up a birdie.",
    "Woods was irked at not making a birdie on the par-five 15th and spurned a chance after a glorious iron into the par-three 16th.",
    "What happened next supplied proof, if that was really needed, that the most unwise thing in sport would be to write off Woods.",
    "His eight under par means a lead of five; any player holding such leeway after 36 holes of a Masters has gone on to win.",
    "He delivered the first hole in one of the tournament, a moment extra special for Cink given his son is on caddie duties.",
    "The prospects of Collin Morikawa, the Open champion, are heightened by the theory Augusta rewards strong iron players.",
    "Work was required to save par at the penultimate hole after a tame first putt but Woods saved a par four at the last.",
    "As Woods toiled badly in the most testing of conditions, Thursday’s fairytale had descended into Friday’s nightmare.",
    "So, too, did Justin Rose, Bryson DeChambeau, Brooks Koepka, Xander Schauffele, Francesco Molinari and Fred Couples.",
    "The 15-times major champion was embroiled in a battle simply to survive for this tournament’s closing 36 holes.",
    "Woods’s celebrated period at Augusta National had never included the playing of holes 1 to 5 in four over par.",
    "Player after player arrived for post-round media duties to articulate just how tough this venue was playing.",
    "Until then Charl Schwartzel and Im Sung-jae, both at three under, sat proudly atop the leaderboard.",
    "The Texan was in contention at one over par when taking to the 12th tee, with chaos to follow.",
    "He found water again at the 13th, so he could not take advantage of the submissive par five.",
    "The bad news for those competitors is the scene looks identical for rounds three and four.",
    "“To have that happen is something I will always remember,” said the 2009 Open champion.",
    "By this point it would be reasonable to assume Tiger Woods is beyond career firsts.",
    "Woods still looks physically comfortable; he is forever incredibly resilient.",
    "Woods’s latest redemption tale will therefore include 72 holes at Augusta.",
    "Winds gusted and temperatures dropped in a style not at all common here.",
    "Given what was occurring before the 6th tee, Tiger had reason to purr.",
    "Not that the Californian has much time for external opinion this week.",
    "DeChambeau’s week, on return from injury, was especially disastrous.",
    "He is widely regarded as the best in the business on that front.",
    "He will still, unquestionably, have thoughts of Georgia triumph.",
    "A back nine of 33 had the man from Offaly justifiably smiling.",
    "Spieth fired two balls into Rae’s Creek, for a double bogey.",
    "A double bogey at the 18th typified Spieth’s frustrations.",
    "Having participated in 100 of them, he has done his time.",
    "For the first time in his career he missed the cut here.",
    "All in all, this added up to 74 and a total of plus one.",
    "Until day two of the Masters’ 86th edition, that is.",
    "Not so and, in this case, not for the right reasons.",
    "There was the straightforward birdie at the 8th.",
    "By close of play, Scheffler had signed for a 67.",
    "Dustin Johnson hovers with intent at minus two.",
    "“If anything, it gives me more confidence.",
    "This time it is a major of attrition.",
    "He carded 80 for a 14-over-par total.",
    "Only the strongest will survive.",
    "No pressure, Scottie.",
    "He is now one under."
  ]
}