{
  "id": 1262,
  "mediaId": 2745,
  "date": "2022-04-08",
  "headline": "The Masters is supposed to be gorgeous and genteel. This year, it’s a brute.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6OWPWMHSPFCWVKDCUMAF7MXMW4.jpg&w=1440",
  "link": "https://www.washingtonpost.com/sports/2022/04/08/masters-wind-weather-friday/?utm_source=rss&utm_medium=referral&utm_campaign=wp_homepage",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Barry Svrluga",
  "authorUrl": "https://www.washingtonpost.com/people/barry-svrluga/",
  "termIds": [
    1313,
    2124,
    2127,
    3036,
    3515,
    3936,
    4127,
    97,
    595
  ],
  "sentences": [
    "“It’s kind of one of those things you have to figure out what gust it’s going to hit and what direction it’s going,” 2018 Masters champ Patrick Reed said, “and it just makes this place even harder.”\nWhat would be the most challenging part of the course?",
    "So as McIlroy peered across the 11th green — where he was about to make a miserable double bogey of his own — he watched Schauffele on the left and Spieth on the right, each having to drop and play his third into the narrow green over Rae’s Creek.",
    "On the coast of Scotland, howling gusts are the standard because, as the saying goes, “Nae wind, nae rain, nae golf.” In the Piedmont of Georgia, the breezes are best when they’re gentle, what with the azaleas to preserve.",
    "1 Scottie Scheffler from the equation because he is apparently some sort of alien — a winner of three of his past five events, now leading the Masters at the midway point by five shots at 8 under.",
    "It’s a tough one because you can hit a great shot and then all of a sudden you get a gust and you look like a complete amateur.”\nThat includes the world’s best players.",
    "Tiger tracker: With a second consecutive 78 in the books and a closing score of 13 over par, Tiger Woods wrapped up his improbable participation in the 86th Masters.",
    "So a bogey, then a double and then a step to the infamous, infuriating 12th — with all those balls in the water lodged directly into the front of McIlroy’s cranium?",
    "Ahead of him was a group that included Jordan Spieth and Xander Schauffele, two players who arrived here thinking they would contend for a green jacket.",
    "Bryson DeChambeau might want to rethink his boast that Augusta National is a par-67 for him because by that standard he was 22 over par for two days.",
    "The forecast high for Saturday’s third round doesn’t reach 60 degrees, and the winds are again supposed to blow from 10 to 20 mph.",
    "“It’s really playing 200 or whatever it is and just committing to it because the wind’s so much up and down.”\nWell, that’s tough.",
    "That’s what this Masters probably will bring as the weekend awaits: as many chills from the temperatures as from thrills.",
    "“Good shots end up bad today,” said South Africa’s Charl Schwartzel, the 2011 Masters champ who managed a 69 on Friday.",
    "Justin Thomas, who matched Scheffler’s 67 for the day’s best round, stood over a short birdie putt at the par-5 second.",
    "“It’s not easy, and it’s not supposed to be easy.”\nRead more golf news\nThe Masters: Scottie Scheffler, the world’s No.",
    "Friday at Augusta National Golf Club, though, was a hold-on-to-your-hat, shield-your-eyes-from-the-debris struggle.",
    "Koepka, a four-time major champion, made three birdies in 36 holes, shot back-to-back 75s and likewise headed home.",
    "Advertisement\nAUGUSTA, Ga. — The Masters is not the British Open, and Rae’s Creek is hardly the Firth of Forth.",
    "(In the real world — which is a distant moon in DeChambeau’s universe — he shot 76-80 and was a mere 12 over.)",
    "Barry Svrluga: For one generation of stars, golf’s timeline is slipping, slipping, slipping into the future.",
    "Advertisement\n“It’s really tough,” said Rory McIlroy, the Northern Irishman with four majors to his name.",
    "Spieth made a triple bogey at 12, doubled 18, shot a 41 on the back — and missed the cut by two strokes.",
    "Golfing while Black: Twenty-five years after Tiger Woods’s arrival, golf is still overwhelmingly White.",
    "It just felt like I just came out of 10 rounds with Canelo.”\nThat would be Alvarez, the Mexican boxer.",
    "“I’m glad to be off the course at this point.”\nExcept they have to go back out there Saturday.",
    "The pines are swaying at the top, then spitting the wind back out in a different direction.",
    "Advertisement\n“It’s hard to commit to a number and say, ‘Okay, it’s 170,’ ” McIlroy said.",
    "McIlroy arrived at the 11th green — the entrance to Amen Corner — having just bogeyed No.",
    "There was more stomping around in frustration than slaps on the back in congratulations.",
    "Advertisement\nThe outliers were those who managed to read the gusts and ride the wave.",
    "Advertisement\nWhat’s needed to commit to a shot in conditions that can’t be predicted?",
    "To be fair, Garcia — save for one year — has a hate-hate relationship with this place.",
    "Sweat comes not from the mercury but from the conditions this Masters is presenting.",
    "Throw in the wind, and he might be disappointed he will be here for the weekend.",
    "“It’s gusting, and then there’s no wind,” Englishman Matthew Fitzpatrick said.",
    "The wind was such that sand blew out of the bunkers, swirling in the air.",
    "He stepped away and collected himself, allowing the breeze to die down.",
    "The azaleas are in bloom, but they’re clinging to limbs only tenuously.",
    "“This is what major championship golf is all about,” McIlroy said.",
    "Spieth hit his onto the bank, where it rolled back into the creek.",
    "It is the first major championship for the 25-year-old American.",
    "And then Brooks Koepka stepped to the 12th tee before McIlroy.",
    "That’s in yourself, in the ethereal and in the meteorological.",
    "The second round of the Masters can be a time to go low.",
    "Augusta National is supposed to be gorgeous and genteel.",
    "Garcia said all that, even after a birdie-birdie finish.",
    "HBCUs (and one NBA champion) are hoping to change that.",
    "Advertisement\nAdvertisement\nAdvertisement\nAdvertisement",
    "Friday’s 25-mph gusts made it a time to seek shelter.",
    "“I shot 74,” 2017 Masters champ Sergio Garcia said.",
    "He proceeded to launch his tee shot over the green.",
    "“All of it, really,” England’s Lee Westwood said.",
    "Schauffele put his pitch on the putting surface.",
    "This could be an interesting weekend, then.",
    "Compare that to 42 who couldn’t break 75.",
    "On Friday, it was harrowing and harsh.",
    "Each hit his tee shot into the water.",
    "“It’s so up and down,” McIlroy said.",
    "Who beats up on people for a living.",
    "That had to build momentum, right?",
    "It’s a difficult one to describe.",
    "1 player, won the 2022 Masters.",
    "Or at least some of them will.",
    "Only six players broke 70.",
    "You have to experience it.",
    "Thomas all but staggered.",
    "“I feel like I shot 86.",
    "A gust howled through.",
    "“It’s just crazy.",
    "The wind swirled.",
    "Remove world No.",
    "I don’t know.",
    "10."
  ]
}