{
  "id": 1293,
  "mediaId": 6545,
  "date": "2022-03-31",
  "headline": "Officials: 1 dead in commercial building fire in downtown New Rochelle",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/03/31/6084a433-51a4-4d7a-a098-c4c0ced1c0b7/thumbnail/1200x630/995443c89d9fc465c8fcf3efd21ef7c8/new-rochelle-fatal-fire.jpg",
  "link": "https://www.cbsnews.com/newyork/news/officials-1-dead-in-commercial-building-fire-in-downtown-new-rochelle/",
  "mediaOutlet": "newyork.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tony Aiello",
  "authorUrl": "",
  "termIds": [
    5186
  ],
  "sentences": [
    "In:\nwestchester county\nnew rochelle\nFire\n Tony Aiello\nTony Aiello serves as a CBS2 general assignment reporter with a focus on covering news and breaking stories in the Northern Suburbs.",
    "Orange flashes of flames pierced the immense volume of smoke as a stubborn fire spread through an art deco 1929 commercial building in New Rochelle.",
    "We thought, 'Well, maybe we'll be spared,' but it looks like ... it looks like this place is destroyed,\" business owner Roy Gilwit said.",
    "We had to knock down fire before we could actually go in and do a detailed search,\" New Rochelle Fire Chief Andrew Sandor said.",
    "Billowing smoke was first noticed at around 6 a.m.\n\"We heard the fire started on the other side of the building.",
    "He said business was just returning after the remnants of Hurricane Ida flooded the basement in September.",
    "It happened in the heart of downtown, at Hamilton and North avenues, CBS2's Tony Aiello reported.",
    "NEW ROCHELLE, N.Y. -- Fire officials say one person was killed in a fire on Thursday morning.",
    "\"Between the pandemic and Hurricane Ida and now this, I think it's time for me to pack it in.",
    "The hoses deliver anywhere from 500 to 1,000 gallons of water per minute, Aiello reported.",
    "Two tenants told CBS2 they were concerned about wiring and maintenance in the building.",
    "The blaze reached four alarms and more than 100 first responders arrived on the scene.",
    "Investigators brought an arson K-9 to the scene out of an abundance of caution.",
    "Determining the cause and origin of the fire will take time, officials said.",
    "\"I've been teaching for 45 years on this street,\" Raymond Fitzpatrick said.",
    "Searchers found a 60-year-old woman deceased in a second-floor apartment.",
    "Gilwit operated a co-working space on the first floor of the building.",
    "He said the property loss is terrible and the human toll is tragic.",
    "At one point there were eight lines putting water on the fire.",
    "The building is likely a total loss and is facing demolition.",
    "Fitzpatrick operated a martial arts studio in the building.",
    "\"We had an idea somebody was inside.",
    "I'm 68 years old.\"",
    "Twitter Facebook"
  ]
}