{
  "id": 1306,
  "mediaId": 2712,
  "date": "2022-03-31",
  "headline": "ISIS Beatles ‘made prisoners do Royal Rumble style wrestling fights and waterboarded captives during campaign of terror’",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2022/04/NINTCHDBPICT000395785949-1.jpg?strip=all&quality=100&w=1920&h=1080&crop=1",
  "link": "https://www.thesun.co.uk/news/18132388/isis-beatles-prisoners-royal-rumble-wrestling-trial-islamic-state/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anthony Blair",
  "authorUrl": "https://www.thesun.co.uk/author/anthony-blair/",
  "termIds": [
    0
  ],
  "sentences": [
    "Grew up in west London one of three kids, travelled to Syria in 2012\nQPR fan who worked as a mechanic before radicalisation in early 20s\nMarried Ethiopian woman aged 21, angry she couldn't move to UK\nMohammed Emwazi 'John' (27)\nKnown as Jihadi John, responsible for executing 7 Western hostages\nBorn in Kuwait in 1988, moving to UK with family at age of 6\nWent back to Kuwait at age 21 to work as an IT salesman\nIn 2014, he killed American journalist James Foley\nWiped out in US drone strike in November 2015\nAine Lesley Davis 'Paul' (38)\nAlso born in London, he was a drug dealer with firearms convictions\nConverted to Islam and joined ISIS.",
    "Most read in News\nWHO NEXT\nZelensky warns of Putin's terrifying plans as this is the 'beginning'\nNUKE ALERT\nRussia preparing to deploy devastating 'Satan-2' nukes which can wipe out UK\nDESPERATE SEARCH\nTour boat with 26 on board goes missing with 'no sign of survivors'\nDEATH RIDDLE\nMan arrested for murder after body found in car outside hospital\nHe said the fights took place in a prison he called 'The Box' along with fellow captives James Foley, an American, and Brits John Cantlie and David Haines.",
    "THE ISIS 'BEATLES'\nThe four British ISIS fanatics were dubbed \"The Beatles\nAlexanda Kotey 'Ringo' (38)\nRaised in Paddington, west London, by Ghanaian and Cypriot parents\nWas a drug dealer prior to his radicalisation\nConverted to Islam in teens, travelling to Gaza in aid convoy in 2009\nLeft his two young children behind in Britain to join ISIS\nEl Shafee El Sheikh 'George' (33)\nBorn in Sudan.",
    "His wife, Amal el-Wahabi, was convicted for smuggling money to him\nPlayed a smaller role in 'Beatles'\nSentenced to seven and a half years in prison in Turkey in 2017\nMotka said the captives were forced to wear orange jumpsuits with numbers on the back similar to those worn by inmates at Guantanamo Bay, to 'remind' them of the US prison.",
    "Kotey was arrested alongside Elsheikh in 2018Credit: AFP\nTheir former prisoner Federico Motka has described his 14-month ordealCredit: Handout\nMohammed Emwazi, also known as 'Jihadi John'Credit: AP:Associated Press\nProsecutors say Elsheikh played a key role in tormenting some 20 Western hostages they kidnapped between 2012 and 2015.",
    "READ MORE ON WORLD\nPLANE TERROR\nSobbing passengers pray as sparks fly from jet in terrifying emergency landing\nPUTIN BUZZED\nUS bomber flies near Russia in warning after Putin sent ‘nuke jets to Sweden’\nMotka testified that there were at least three Brits in the group of captors, nicknamed 'John', 'George', and 'Ringo'.",
    "El Shafee Elsheikh, the UK-born jihadi who was part of the 'ISIS Beatles'Credit: AP\nElsheikh is on trial in the US on terrorism chargesCredit: AFP\nElsheikh, right, with fellow ISIS Beatle Alexanda KoteyCredit: AP:Associated Press\nThe 'loser' as decided by the captors would be tortured by waterboarding.",
    "Read More on The Sun\nTEENAGE WASTELAND\nInside town held prisoner by yobs who lob bricks at buses and attack OAPs\nWILD WILD JEST\nJada's incredible reaction as Will Smith smacks Chris Rock in new video\nHe faces an unconditional sentence of life imprisonment.",
    "They were so excited, it was the event of the day\nFederico MotkaFormer ISIS hostage\nMotka said the four were forced to fight for a whole hour, despite being so tired and weak that they were \"barely able to life our arms\".",
    "Mohammed Emwazi, the ISIS executor known as 'Jihadi John', was killed in a drone strike in 2015, while Alexanda Kotey and Elsheikh were captured in Syria in January 2018 and brought to Virginia to face trial.",
    "Describing the ordeal of waterboarding at the hands of Elsheikh and George, Motka said he was forced to lie on his back over the toilet with a jumper on his face while water was poured on top of it.",
    "In chilling testimony, he claimed Elsheikh, 'George', and 'John' made him and three other prisoners take part in a 'Royal Rumble'-style fight with each other for their pleasure.",
    "Foley, Sotloff and Kassig were decapitated, while Mueller was forced into slavery and raped repeatedly by Islamic State leader Abu Bakr al-Baghdadi before being killed as well.",
    "He said one of the guards would use a \"stun gun\" on the hostages' bodies, demanding they put their stomachs or hands through a hole in their cell where he would zap them.",
    "Elsheikh's charges carry a potential death sentence, but US prosecutors have advised British officials that they will not seek the death penalty against either man.",
    "The British ISIS members tortured and murdered US journalists James Foley and Steven Sotloff, as well as relief workers Peter Kassig and Kayle Mueller.",
    "George \"always spoke about Guantanamo\" and the horrific beatings and mistreatment were \"his idea of what conditions in Guantanamo were like,\" he added.",
    "On this occasion, the ISIS fighters decided John Cantile was the winner and Motka had lost but didn't go through with their threat to waterboard him.",
    "Four inmates were forced to get into a tag-team boxing match until they passed out, while their Islamic State captors did mock \"commentary\".",
    "THE ISIS \"Beatles\" made their hostages take part in sick 'Royal Rumble'-style wrestling fights and waterboarded them, a US court has heard.",
    "The abuse at the hands of 'The Beatles' ranged from the \"ridiculously childish\" such as nipple twisting up to waterboarding, Motka said.",
    "US journalist James Foley was murdered by the ISIS BeatlesCredit: AP:Associated Press\nHowever, he suffered torture on other occasions.",
    "Elsheikh's lawyers insist he was just a \"simple ISIS fighter\" who wasn't involved in the torture carried out by 'The Beatles'.",
    "John Cantlie is still missing and is presumed to be in the hands of the Islamic State, almost a decade after he was kidnapped.",
    "Once the jumper absorbs the water you start to lose oxygen... water starts to get into your lungs and you start to choke.\"",
    "He was giving evidence during the trial of alleged terrorist El Shafee Elsheikh, 33, taking place in Alexandria, Virginia.",
    "Elsheikh is accused of being a member of the 'ISIS Beatles', so-called by their captives because of their British accents.",
    "Federico Motka, an Italian-born aid worker, described his horrifying 14-month ordeal at the hands of the four Jihadis.",
    "Under the agreement, he will serve 15 years in jail in the US and will then be sent to the UK to face further charges.",
    "Elsheikh is accused by prosecutors of being the who was nicknamed Ringo, although others have alleged he was George.",
    "Motka was finally released on May 25, 2014, after 14 months in captivity, more than any other 'Beatles' hostage.",
    "Motka is the first surviving hostage to testify at Elsheikh's trial, which entered its second day on Thursday.",
    "He said that Elsheikh and 'John' would \"egg each other on,\" adding: \"It was like school kids bullying someone.",
    "Prosecutor Dennis Fitzpatrick asked if the ISIS Beatles did a \"play-by-play\" commentary on the fight.",
    "He was kidnapped near a refugee camp on the Turkish border and taken to Syria in March 2013.",
    "\"They called it the Royal Rumble,\" he said, referring to the annual WWE wrestling event.",
    "Motka said the four were barely given any food, and usually just ate bread and olives.",
    "Last year, Kotey pleaded guilty in a plea bargain that calls for a life sentence.",
    "At this point, George would always stop the process and say: \"That's enough.\"",
    "Mr Motka went on: \"They were so excited, it was the event of the day.",
    "All three routinely wore masks covering everything but their eyes.",
    "Whoever they deemed to have lost the fight would be waterboarded.\"",
    "They ordered us to get into a tag team-style boxing match.",
    "Mr Motka replied: \"They did a Radio 5 Live commentary.\"",
    "If you were too tired you had to tag yourself out.\"",
    "\"I was trying to breathe out the side of my mouth.",
    "David Haines was also beheaded in September 2014.",
    "He said: \"James passed out, John passed out.",
    "\"You start to panic a little bit,\" he said.",
    "\"James and John were against me and David.",
    "David nearly passed out.",
    "The trial continues."
  ]
}