{
  "id": 1338,
  "mediaId": 4045,
  "date": "2022-04-05",
  "headline": "Masters Tee Times",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?crop=375%2C375%2C30%2C0&resize=200%2C200&order=crop%2Cresize",
  "link": "https://www.stltoday.com/sports/golf/masters-tee-times/article_393eca41-409e-562a-8cb5-562204420abe.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "",
  "termIds": [
    1313,
    2124,
    3123,
    3899,
    3926,
    4195,
    4502,
    4574,
    4698,
    595
  ],
  "sentences": [
    "The resurgent former UCLA star had the lone bogey-free round of the day in testing conditions with the wind gusting to 25 mph to start the LPGA Tour’s two-week run in the Los Angeles area, with the Palos Verdes Championship next week.",
    "Patrick Cantlay and Xander Schauffele shot a 4-under 68 in alternate-shot play Friday at windswept TPC of Louisiana to maintain a one-stroke lead in the Zurich Classic of New Orleans.",
    "Jordan Spieth hit a 56-foot shot from a greenside bunker to 7 inches and beat Patrick Cantlay with the tap-in par putt on the first hole of a playoff Sunday in the RBC Heritage.",
    "Playing four groups ahead of Cantlay, Spieth birdied Harbour Town’s par-4 18th lighthouse hole in regulation, holing a 10-footer for a 5-under 66 and 13-under 271 total.",
    "Alison Lee shot a 5-under 66 on Thursday afternoon at breezy Wilshire Country Club to take the first-round lead in the DIO Implant LA Open.",
    "Varner had eight birdies in a bogey-free round to match Cameron Young’s opening score as the lowest at Harbour Town Golf Links this week.",
    "FedEx Cup champion Patrick Cantlay, 2019 British Open winner Shane Lowry of Ireland and Erik van Rooyen of South Africa were a shot back.",
    "Spieth would be quick to acknowledge that without Woods driving increases in prize money over the years, he wouldn't be at $50 million.",
    "Harold Varner III shot an 8-under 63 to take a one-shot lead in the RBC Heritage on Saturday in pursuit of his first PGA Tour victory.",
    "Varner has two international victories, winning the Australian PGA Championship in 2016 and the Saudi International in February.",
    "Hoffmann, 32, was diagnosed with muscular dystrophy and had to step away from tournament golf for the past two-and-a-half years.",
    "A nightly look at the day\\'s top sports stories, and a first look at the topics St. Louis fans will be talking about tomorrow.",
    "Masters champion Scottie Scheffler and Ryan Palmer settled for an even-par 72 to make the cut on the number at 8 under.",
    "Fellow afternoon starter Emma Talley and morning players Nasa Hataoka and Emily Kristine Pedersen were a stroke back.",
    "Jordan Spieth is the 11th player to cross the $50 million mark in career PGA Tour money, and he's also the youngest.",
    "The father-son team of Jay Haas and Bill Haas also made the cut on the number, following a 65 with a 61.",
    "But Lowry’s chip on the par-3 14th raced across the green and into the water, leading to double bogey.",
    "He won $1 million or more in earnings in three of four seasons on the PGA Tour between 2014-17.",
    "AP\nThursday-Friday\nPlease subscribe to continue reading…\nCopyright 2022 The Associated Press.",
    "Morgan Hoffmann missed the cut at the RBC Heritage in his first PGA Tour event since 2019.",
    "Cantlay and Schauffele opened with a tournament-record 59 on Thursday in best-ball play.",
    "Hoffmann felt his strength and stamina had improved enough for him to come back to golf.",
    "Scottie Scheffler is learning about the recognition that comes with winning the Masters.",
    "And what sets Woods apart is that he's been atop the career money list for 22 years.",
    "The teams of David Lipsky-Aaron Rai and Doc Redman-Sam Ryder were second after 67s.",
    "Hoffmann had a bogey on the final hole Friday that kept him from making the cut.",
    "At 68 years, four months, Jay Haas is the oldest player to make a PGA Tour cut.",
    "This material may not be published, broadcast, rewritten or redistributed.",
    "Still, Hoffmann was pleased with his week and is hopeful going forward.",
    "He also got a handwritten letter from former President George W. Bush.",
    "All that does is serve as a reminder of the dominance of Tiger Woods.",
    "He is teaming with Ryan Palmer in the Zurich Classic of New Orleans.",
    "He received a message from Cowboys running back Ezekiel Elliott.",
    "Cameron Smith and Marc Leishman are the defending champions.",
    "When Spieth finished, he was a stroke behind Shane Lowry.",
    "Hoffmann played his college golf at Oklahoma State.",
    "It's the only official team event on the PGA Tour.",
    "Scheffler's says he couldn't read the handwriting.",
    "Scheffler took a week at home in Dallas to relax.",
    "And then he hit $100 million seven years later.",
    "Cantlay parred the 18th in regulation for a 68.",
    "Cantlay, the second-round leader, had a 70.",
    "And not even inflation can diminish that.",
    "Lowry shot 65, and van Rooyen had a 67.",
    "They were a tournament-record 17 under.",
    "He finished a stroke back after a 69.",
    "Woods reached that benchmark in 2005.",
    "Spieth won his 13th PGA Tour title.",
    "He was mentioned by Michael Phelps.",
    "Varner had an 11-under 202.",
    "Now it's back to work.",
    "Money still matters.",
    "All rights reserved.",
    "One problem."
  ]
}