{
  "id": 1346,
  "mediaId": 2685,
  "date": "2022-04-07",
  "headline": "Jim Souhan live at the Masters: How close could I get to Tiger Woods?",
  "image": "https://chorus.stimg.co/23368537/merlin_67168371.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces",
  "link": "https://www.startribune.com/masters-tiger-woods-birdie-augusta-national-gift-shop/600162915/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Souhan",
  "authorUrl": "https://www.startribune.com/jim-souhan/6134710/",
  "termIds": [
    1313,
    1805,
    1986,
    2473,
    2559,
    3123,
    3509,
    4467,
    595
  ],
  "sentences": [
    "The final four groups, starting at 12:30, which include Dustin Johnson, Billy Horschel, Collin Morikawa, Will Zalatoris, Patrick Cantlay, Jon Rahm, Jordan Spieth, Viktor Hovland, Xander Schauffele, Matthew Fitzpatrick, Brooks Koepka and Rory Mcilroy.",
    "My column is on the fact that Tiger Woods is the dominant figure in this tournament, which speaks to both his greatness and the inability of anybody else to take over as a permanent No.",
    "For today's Star Tribune, I wrote about van Rooyen, who withdraw from his only Masters appearance, in 2020, because of back problems, but who looks to be in good form and good spirits.",
    "One of my greatest privileges in the business was having inside-the-ropes access at the 2008 U.S. Open at Torrey Pines, when Woods beat Rocco Mediate in a Monday playoff.",
    "The ceremonial starters are now scheduled to tee off at 8:15 a.m., 35 minutes later than planned, and the first group is scheduled to tee off at 8:30, a half-hour late.",
    "The problem with trying to walk near Woods at The Masters, or at any tourney at which you don't have inside-the-ropes access, is that you can't get close to him.",
    "The rains are light right now but it's been raining and off since late Tuesday morning, and sometimes the rains have been heavy, with lightning and thunder.",
    "The Masters gift shop is massive and quite nice, and it's the only place on the course more crowded than the first tee box when Tiger is starting his round.",
    "Predictions are ridiculous, especially in a golf tournament where about 50 different people have a chance to win, but I'm intrigued by Brooks Koepka.",
    "Last year, he became the fourth player (fifth instance) to finish in the top-3 in 3 majors in the same year and not win one of them, since 1934.",
    "Today, trying to buy something for a colleague, I made it into the shop and for perhaps the first time in my life felt claustrophobia.",
    "Fred Couples said yesterday that the biggest crowds he has ever seen at The Masters have been for Woods' practice rounds this week.",
    "Some important/intriguing start times:\nFargo's Tom Hoge at 11:35 Central with Bubba Watson and Keita Nakajima.",
    "He's walking pretty well on his surgically-repaired leg, but doesn't look comfortable crouching to read putts.",
    "Weather.com indicates there is a slight chance of rain all day, with increasing winds in the afternoon.",
    "Former Gopher Erik van Rooyen is wearing shell pink pants to go with his Yosemite Sam mustache.",
    "This is also a relatively small field for a major, so making up for lost time isn't difficult.",
    "He loves playing in majors, isn't facing massive expectations and seems to be fully healthy.",
    "Former Gopher Erik van Rooyen at 10:29 Central with Lucas Glover and Cameron Davis.",
    "The start of The Masters was delayed by a half-hour by rains this morning.",
    "Continuing rains have delayed the start of the tourney, if only briefly.",
    "Defending champ Hideki Matsuyama, Justin Thomas and Tony Finau at 9:56.",
    "Woods, who was playing on a damaged leg, barely spoke the entire day.",
    "I hope to spend much of the day walking with Hoge, van Rooyen and .",
    "It's beautiful out now and should be clear the rest of the day.",
    "Paul Casey was supposed to play in Tiger's group but withdrew.",
    "Woods is wearing a collarless golf shirt the color of azaleas.",
    "Mediate talked nonstop, even to reporters crouched nearby.",
    "The course drains so well that it shouldn't be a problem.",
    "Louis Oosthuizen is playing today with Tiger Woods.",
    "1 after missing long right with his approach.",
    "6:45 a.m.\nGood morning from Augusta National.",
    "I saw his left elbow on his follow-through.",
    "Tried to watch Tiger Woods tee off on No.",
    "The lines have been extensive all week.",
    "He barely missed his birdie putt on No.",
    "(Thanks to @JustinRayGolf on Twitter.)",
    "5 to get back to even-par on the day.",
    "He's been dealing with back spasms.",
    "1 with a clutch mid-range putt.",
    "He looks like a body builder.",
    "Fargo's Tom Hoge bogeyed No.",
    "Golf 600162915\n12:55 p.m.",
    "5, he made a mess at No.",
    "I'll try again later.",
    "After a birdie at No.",
    "It was a mob scene.",
    "He made par on No.",
    "I couldn't move.",
    "8, making bogey.",
    "1 in the sport.",
    "He birdied No.",
    "Woods?",
    "1.",
    "2.",
    ".",
    "."
  ]
}