{
  "id": 1354,
  "mediaId": 2740,
  "date": "2022-03-31",
  "headline": "Review: Bon Iver returns to the road with a blend of experimentation, emotional intensity",
  "image": "https://www.gannett-cdn.com/presto/2022/03/31/PPHX/248cc82b-ae06-4c0f-a46a-e17f12896a3b-DSC04642_Tanner_Johnson.JPG?crop=5999,3374,x1,y494&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/entertainment/music/2022/03/31/bon-iver-tour-launch-mesa-arizona-review-setlist/7239557001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatodaycommusic-topstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Masley",
  "authorUrl": "https://www.azcentral.com/staff/2647013001/ed-masley/",
  "termIds": [
    1408,
    2614,
    3090,
    3189,
    3910,
    143,
    5141,
    5242,
    5245
  ],
  "sentences": [
    "'We can achieve something good':Bon Iver is committing 5% of annual publishing royalties to nonprofits fighting for gender equity\nVernon and his bandmates set the tone for a set that put the focus squarely on 2019's \"I,I\" with a haunting rendition of \"22 (OVER S88N)\" from their previous album, \"22, A Million,\" before diving into the soulful experimentation of \"iMi\" and \"We,\" the first two proper tracks on \"I,I.\"",
    "Taylo Swift's 'Evermore' review:Pop star returns to the woods for a spellbinding 'Folklore' companion\nThe saxophonist harmonized with Vernon's keyboard on an epic \"____45_____,\" which gave way to the sampled vocal loops of \"33 'GOD' ” and the speaker-rumbling bass tones of \"8 (circle)\" as the set made its way to a crowd-pleasing finish.",
    "From there, they made their way through highlights as ambitious as the gospel-flavored \"U (Man Like),\" the heavy bass of \"10 d E A T h b R E a s T,\" the drama of \"715 - CRSSKS\" and \"Heavenly Father\" before reaching back to the album that started it all, 2007's \"For Emma, Forever Ago,\" for a dreamy rendition of \"Blindsided.\"",
    "Then, Vernon told the crowd, \"In March of 2020, we played in town and then a month later, we had to make this song\" by way of introducing “PDLIF (Please Don’t Live In Fear),” a song whose proceeds benefited healthcare workers on the COVID-19 frontline through Direct Relief.",
    "Their last big concert before the shutdown was, in fact, in downtown Phoenix, where they headlined McDowell Mountain Music Festival with an equally stunning display of intensely emotional vulnerability filtered through a wide array of digital manipulation.",
    "He apparently got the chords all sort out before leading his bandmates in a super-soulful version of \"Sh'Diah,\" a ballad whose title is an abbreviation for “(Expletive) Day in American History”, referring to the day after Donald Trump’s election in 2016.",
    "MESA, Ariz. – Justin Vernon was four songs deep into opening night of Bon Iver's first U.S. tour since the pandemic shut things down in early 2020 when he paused coming out of a mournful \"Jelmore\" to share what he was feeling in that moment.",
    "Vernon's vocals, in particular, were frequently run through a combination of software and assorted gear that not only allows him to alter his pitch like Auto-Tune or an old-school vocoder but also to create a wall of harmonies in real time.",
    "And it served as a suitably haunting conclusion to a tour launch that found Vernon and his bandmates reasserting themselves as modern masters of pushing the experimental envelope with music that resonates on a profoundly emotional scale.",
    "The effect is otherworldly and yet it somehow only underscores the raw emotion of the songs themselves and Vernon's awe-inspiring singing voice, especially when he hits that sweet spot in the upper register of his three-octave range.",
    "\"Sh'Diah\" had an almost Prince-like vibe and was followed by the final number of the proper set, \"Naeem,\" which built to an explosive climax with Vernon inserting profanities in his gritty shouts of \"I can hear.\"",
    "A wash of cymbals underscored Vernon's guitar lick as they followed the magic of \"Blindsided\" with \"Perth,\" a song whose instrumental break was so electrifying, you could feel it in your chest.",
    "It doesn't hurt that the man has surrounded himself with a team of stellar multi-instrumentalists – Sean Carey, Jenn Wasner, Mike Lewis, Matt McCaughan and Andy Fitzpatrick.",
    "They returned to start the encore without Carey, who was in the bathroom backstage but returned in time to join his bandmates on the first song of the encore, \"Blood Bank.\"",
    "Then, after a gorgeous, acoustic-guitar driven “Holocene,” Vernon admitted that the tour launch was not going off without a hitch, regardless of how good it sounded.",
    "After a meditative yet noisy performance of \"Marion,\" Vernon took a moment to see if there were any people from his home state of Wisconsin in the audience.",
    "They signed off on an existential note, with Vernon reminding the crowd as he introduced \"RABi\" that \"This song's about death.\"",
    "\"I can't tell you what it feels like to be up here playing for you guys right now,\" he told the crowd at Mesa Amphitheatre.",
    "\"Faith\"\n\"Marion\"\n\"Towers\"\n\"____45_____\"\n\"33 'GOD'”\n\"8 (circle)\"\n\"Holocene\"\n\"Sh’Diah\"\n\"Naeem\"\n\"Blood Bank\"\n\"PDLIF\"\n\"RABi\"",
    "Bon Iver tour launch setlist\n\"22 (OVER S88N)\"\n\"iMi\"\n\"We\"\n\"Jelmore\"\n\"U (Man Like)\"\n\"10 d E A T h b R E a s T ?",
    "\"I brought the wrong keyboard,\" he said, as he struggled to figure out what chord he was supposed to play.",
    "Each musician performed in his or her own geometric lighting pod under a diamond-shaped lighting rig.",
    "\"I guess I've been outed as a person who only plays in C and transposes all the keyboard part.\"",
    "When a handful of people responded, he took the opportunity to tease them.",
    "As songs about death go, \"RABi\" has an oddly life-affirming quality.",
    "?KS\"\n\"Heavenly Father\"\n\"Blindsided\"\n\"Perth\"\n\"666 ?\"",
    "\"You guys are really missing out on a great winter.",
    "\"Couple of snowbirds here,\" he said.",
    "We call you guys cheaters.\"",
    "\"It's been a minute.\"",
    "\"715 - CR?",
    "?\""
  ]
}