{
  "id": 1361,
  "mediaId": 2707,
  "date": "2022-03-31",
  "headline": "Omar Kelly: Todd Bowles needs to succeed with Buccaneers to create favorable change",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/03/202203311342TMS_____MNGTRPUB_SPORTS-OMAR-KELLY-TODD-BOWLES-NEEDS-SUCCEED-1-FL5.jpg?w=1024&h=683",
  "link": "https://www.ocregister.com/2022/03/31/omar-kelly-todd-bowles-needs-to-succeed-with-buccaneers-to-create-favorable-change/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tribune News Service",
  "authorUrl": "https://www.ocregister.com/author/tribune-news-service/",
  "termIds": [
    0
  ],
  "sentences": [
    "The point I’m making is that the few good jobs — the ones that come with established quarterbacks like Ben Roethlisberger, or jobs attached to tradition-rich franchises that have a history of doing things the right way like the Steelers, usually don’t go to minorities.",
    "He’ll also join a small fraternity that includes Art Shell, Dennis Green, Ray Rhodes, Tony Dungy, Herm Edwards, Lovie Smith, Romeo Crennel, Jim Caldwell and Hue Jackson, becoming the 10th Black coach who got a second opportunity to lead an NFL team.",
    "The caliber and credentials of those quarterbacks explain why Bowles only managed 14 wins in his final three seasons before getting shown the door, and got added to the pile of failed minority defensive coaches who couldn’t cut it as a head coach.",
    "If Bowles succeeds, he’ll breathe new life into the Leslie Frazier, Vance Joseph, Raheem Morris, Steve Wilks of the NFL world, proving that minorities do deserve a second change to make a favorable head coach impression.",
    "Bruce Arians’ abrupt, and surprising retirement from what many believe is a Super Bowl contending Buccaneers team is Bowles’ opportunity to rewrite his resume, creating a second act for his coaching career.",
    "Just look at the last 10 years of minority hires, checking each team’s track record, and it proves Black coaches, or other minority coaches, are usually asked to take bad jobs and make miracles happen.",
    "Bowles, who led Miami to a 2-1 record as the Dolphins’ interim coach when Tony Sparano was fired in 2011, took a bad job with the New York Jets, and it produced a 24-40 record in his four seasons.",
    "He joins Tomlin as one of the six minority head coaches in 2022, and he will be the only one who benefits from having a first ballot Hall of Fame quarterback like Brady with him under center.",
    "After that solid start, the Jets organization feasted on a steady diet of bad quarterbacking from Geno Smith, Bryce Petty, Josh McCown and eventually Sam Darnold, a first-round pick.",
    "Minority coaches are often asked to lead an organization’s rebuild, and according to his lawsuit, they are even encouraged to lose games, like he alleges he was in 2019.",
    "But with that opportunity comes the weight of expectations and the pressure of knowing your success or failure will have a lasting impact on more than just yourself.",
    "This time, he needs to make sure the organization is set up for success, because few get put in positions to have a third head coach post, like Smith.",
    "Tomlin, who became the 10th black head coach in NFL history when he was hired by the Pittsburgh Steelers in 2007, has never had a losing season.",
    "That’s why Todd Bowles getting a second chance to become a head coach with a Tom Brady-led Tampa Bay Buccaneers roster is so important.",
    "Saying they were forced to do so would be disingenuous; nobody is twisting their arms to take one of 32 NFL head coach positions.",
    "That saga is part of the reason Brian Flores’ lawsuit against the NFL, challenging their hiring practices, has some merit to it.",
    "Mike Tomlin is the gold standard for hope, the possibility of fairness, and a catalyst for change in the NFL.",
    "He owns a 154-85-2 record in his 15 seasons at the helm of one of the NFL’s tradition rich franchises.",
    "But in Bowles’ defense, he started out 10-6 with Ryan Fitzpatrick as his starting quarterback in 2015.",
    "His teams have qualified for the postseason 10 times, and there’s one Super Bowl win on his resume.",
    "He’s a poster boy for what a minority coaches can do IF they are set up for success, like he was.",
    "This time, around Bowles has the type of job, the caliber of a team, that will give him a chance.",
    "The hope is that one day there’s more than Tomlin who can be held up as the gold standard.",
    "It could impact an entire generation of coaches who look like him, one way or another.",
    "That team was a week 17 win from qualifying for the postseason, but fell short.",
    "Not everyone can be that fortunate.",
    "Unfortunately, few ever are.",
    "()"
  ]
}