{
  "id": 1378,
  "mediaId": 6615,
  "date": "2022-04-07",
  "headline": "What Tennessee Titans GM Jon Robinson expects from 2022 draft class, last year's rookies",
  "image": "https://www.gannett-cdn.com/presto/2021/08/19/PNAS/9e0d7a7b-4028-4fcc-9791-38089a5f9e8e-NAS-Titans-Bucs-017.JPG?crop=1800,1013,x0,y241&width=1800&height=1013&format=pjpg&auto=webp",
  "link": "https://www.tennessean.com/story/sports/nfl/titans/2022/04/07/tennessee-titans-gm-jon-robinson-expects-2022-draft-class/7247682001/",
  "mediaOutlet": "Tennessean",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Arthur",
  "authorUrl": "https://www.tennessean.com/staff/4828851001/ben-arthur/",
  "termIds": [
    1409,
    1906,
    3261,
    4019,
    4301,
    4378,
    671,
    1014,
    5348
  ],
  "sentences": [
    "Between draft busts, slow-developing prospects and injuries, the Titans’ 2020 and 2021 draft classes have to this point produced little in the form of key contributions, hurting the team’s ability to get over the hump that has kept it a rung below Super Bowl contention.",
    "Dez Fitzpatrick, who spent most of 2021 on the practice squad after being cut from the initial 53-man roster, and Rashad Weaver, who suffered a season-ending leg injury in Week 3, had little to no impact after being picked in the fourth round.",
    "Of the Titans’ top three picks in 2020, the only one still on the roster just two years later is second-round cornerback Kristian Fulton, who had an injury-riddled rookie season but became a productive starter as a second-year pro.",
    "26 — and still land a building block\nThe 2020 class has been arguably the most disappointing in the six drafts led by Robinson, primarily because first-round offensive tackle Isaiah Wilson turned out to be an all-time draft bust.",
    "They offer a sharp contrast to the 2019 class, which produced five players ranging from starters (right guard Nate Davis, safety Amani Hooker and linebacker David Long Jr.) to franchise cornerstones (wide receiver A.J.",
    "“You certainly are eager for those guys to come in and be contributors,\" Robinson said at the NFL owners meetings last week, \"but you’re also cautious with knowing you’re playing the longer game.\"",
    "But you’re not ready to cast them aside if they’re not Day 1 out there, at whatever position they play, being an impactful player, knowing that the transition to the NFL game takes time.",
    "“At some point, they’re going to have to go out there and do the job that they’re drafted to do.”\nBen Arthur covers the Tennessee Titans for The USA TODAY Network.",
    "NFL MOCK DRAFT:How Tennessee Titans can ace the rest of 2022 NFL Draft — after taking a QB in Round 1\nMORE:NFL mock draft 3.0: Tennessee Titans trade down from No.",
    "First-rounder Caleb Farley, who had health concerns when he was drafted, played only three games last year after a shoulder issue and a season-ending knee injury.",
    "But the third-round pick that year, running back Darrynton Evans, was also released last month, after two injury-filled seasons held him to six games.",
    "He had a bevy of issues on and off the field and only played in one game before being traded, less than a year after he was drafted.",
    "Second-round offensive lineman Dillon Radunz was at the bottom of the depth chart as a rookie, a healthy scratch for five games.",
    "After slow early returns from his last two drafts, is Jon Robinson more eager for instant impact from the 2022 class?",
    "Robinson is hopeful that members of the 2021 class will make the jumps, similar to the one Fulton made last season.",
    "Monty Rice, also a reserve in a deep inside linebacker room, missed seven games as a rookie.",
    "“This year’s draft class, the 2022 class, to what degree they can help the football team?",
    "Elijah Molden was Tennessee’s most impactful rookie last season, emerging as it’s No.",
    "The jury is still out on the 2021 class, but the early returns weren’t promising.",
    "The Tennessee Titans general manager looks at it as a balance of expectations.",
    "Contact him at barthur@gannett.com and follow him on Twitter at @benyarthur.",
    "They got to be productive players for us,” Robinson explained.",
    "Our coaches do a great job of bringing those guys along.",
    "But we’re going to lean on them at some point.",
    "Brown and defensive tackle Jeffery Simmons).",
    "1 nickelback and playing 61% of snaps.",
    "Obviously, the sooner the better.",
    "\"We need them."
  ]
}