{
  "id": 1404,
  "mediaId": 2586,
  "date": "2022-04-02",
  "headline": "Bills Rumors: Josh Allen’s Contract Could Be Restructured for Cap Room",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Josh-Allen-1-e1648924236669.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-rumors-allen-contract-restructure/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1681,
    1817,
    2331,
    2332,
    3507,
    3583,
    160,
    700
  ],
  "sentences": [
    "Josh Allen and Kyler Murray are in a tier of their own pic.twitter.com/BFtVZMSl07\n— PFF Fantasy Football (@PFF_Fantasy) April 1, 2022\nThe Bills have already restructured some other contracts this offseason, including linebacker Matt Milano and punter Matt Haack, who took a pay cut and removed the final year of his contract in what appears to be a prelude to a competition for his job this coming training camp and preseason.",
    "“We don’t play games until September, so it’s my job to make sure we have the roster ready by then.”\n\"The money gets close, and you're looking for the tiebreakers, whether that's playing with Josh Allen, playing in front of Bills Mafia, I think it all weighs in.\"",
    "More Needs to Fill\nThere are still several areas of need for the Bills, namely the secondary where All-Pro Tre’Davious White is expected to miss some of the upcoming season while rehabbing a torn ACL and fellow cornerback Levi Wallace left in free agency.",
    "The Bills signed Allen to a $258 million extension last August, including $150 million in guaranteed money, but have the capacity to restructure slightly to lessen the cap hit without giving Allen a pay cut, as they have done with other players.",
    "A look at how Buffalo has transformed into a destination for free agents: https://t.co/FuqmzFeEZ9\n— Alaina Getzenberg (@agetzenberg) March 25, 2022\nThe team’s diligence in looking for players has paid big dividends in the past.",
    "The Buffalo Bills will be bargain shopping for the remainder of free agency, but have the potential to buy themselves a bit of room by revisiting the massive contract extension that quarterback Josh Allen earned last season.",
    "Looking for Room\nAfter a relatively busy free agency period where Beane filled holes in some places and added depth in others, he hinted that there won’t be much more coming until the draft.",
    "After the team made a splash by landing edge rusher Von Miller, Bills general manager Brandon Beane has made it clear that the team doesn’t have the cap space for any more big moves.",
    "But after Diggs shared a tweet the next offseason that said it was “time for a new beginning,” Beane checked back with the Vikings and found them ready to make a deal for Diggs.",
    "Like, you know, we’re never satisfied.”\nBut as Jay Skurski of the Buffalo News noted, Beane could have some moves up his sleeve to create some immediate cap space.",
    "But with several important holes left to fill — including getting depth in the secondary — they may need to pull a few maneuvers to gain more cap space.",
    "We’re not just waking up every day, going `where’s the corner?’ We’re looking everywhere, and we’ve got a lot of time,” Beane said, via SI.com.",
    "Beane recounted how the team had looked into a trade for wide receiver Stefon Diggs in 2019, but the Minnesota Vikings weren’t up for a deal.",
    "One of those would be a simple restructuring of Allen’s contract, which could free up $2.5 million for the upcoming season.",
    "Josh Allen looks on after the Buffalo Bills defeated the New England Patriots.",
    "“My main focus right now is just the draft,” Beane said, via SI.com.",
    "“We’ve got a lot of positions that I still want to get more depth.",
    "One of those could be a simple restructuring of Allen’s contract.",
    "Beane said the team is continually evaluating options.",
    "“We’re out of money, unless you guys have some here.",
    "So yeah, other than that, I mean, we’ll always look.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "After the draft, we’ll be looking.",
    "We’re always looking."
  ]
}