{
  "id": 1412,
  "mediaId": 2732,
  "date": "2022-04-09",
  "headline": "Mark Madden's Hot Take: Re-signing Terrell Edmunds makes more sense for Steelers than Honey Badger",
  "image": "",
  "link": "https://triblive.com/sports/mark-maddens-hot-take-re-signing-terrell-edmunds-makes-more-sense-for-steelers-than-honey-badger/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Madden",
  "authorUrl": "https://triblive.com/author/mark-madden/",
  "termIds": [
    0
  ],
  "sentences": [
    "If Mathieu’s name was Joe Smith and he had no catchy moniker, Steelers fans wouldn’t be screaming, “SIGN JOE SMITH!”\nMinkah Fitzpatrick, also a safety, has one season left on his contract.",
    "Some see Edmunds as a bust because he was the Steelers’ first-round pick (28th overall) in 2018 and has been mostly average.",
    "Edmunds won’t get the $6.7 million he would have had the Steelers picked up the fifth-year option on his rookie contract.",
    "“SIGN THE HONEY BADGER!”\nIt’s the war cry of local fanboys who want to collect football cards, not build a team.",
    "A bit beat up at 29, perhaps, thanks to being extremely physical, 5-foot-9, and having played nine NFL seasons.",
    "That would be spending too much money at safety, a relatively inconsequential position.",
    "He’s only missed one game out of 65 since entering the NFL in 2018, starting 60.",
    "If the Steelers keep Fitzpatrick, which they will, they shouldn’t sign Mathieu.",
    "They need a legit cornerback much more than they need another marquee safety.",
    "It should be one of the easiest decisions of the Steelers’ offseason.",
    "If Edmunds was a third-round pick, he’d be seen as a big success.",
    "But he’s a three-time first-team All-Pro, most recently in 2020.",
    "He will want approximately $60 million over four years.",
    "Re-sign Edmunds, if he’s amenable to being affordable.",
    "(Mathieu being unsigned suggests something, BTW.)",
    "He made $14 million with Kansas City last season.",
    "That’s in line with the NFL’s top safeties.",
    "But, at the right price, average isn’t bad.",
    "Free agency started over three weeks ago.",
    "He won’t get what Mathieu will, either.",
    "But Edmunds knows the Steelers’ system.",
    "Tyrann Mathieu is a good safety.",
    "He works well with Fitzpatrick.",
    "So, bring back Terrell Edmunds.",
    "He’s got a great nickname.",
    "Edmunds remains unsigned.",
    "There isn’t great demand.",
    "Forget the Honey Badger.",
    "He won’t sign cheap.",
    "He’s a free agent."
  ]
}