{
  "id": 1420,
  "mediaId": 2552,
  "date": "2022-04-09",
  "headline": "Masters 2022 result: Scottie Scheffler wins Green Jacket after late Rory McIlroy fireworks",
  "image": "https://www.telegraph.co.uk/content/dam/golf/2022/04/10/TELEMMGLPICT000292478835_trans_NvBQzQNjv4BqgmFsEjQK2M33nnfQ31Q2_4wNShXd6MTFxoA1w-FqY_s.jpeg?impolicy=logo-overlay",
  "link": "https://www.telegraph.co.uk/golf/2022/04/10/masters-2022-final-round-fourth-live-score-latest-updates-augusta1/",
  "mediaOutlet": "Daily Telegraph",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Corrigan",
  "authorUrl": "https://www.telegraph.co.uk/authors/j/ja-je/james-corrigan/",
  "termIds": [
    1313,
    2124,
    3002,
    3486,
    4127,
    97,
    595
  ],
  "sentences": [
    "#themasters pic.twitter.com/It1FtTvILS\n— The Masters (@TheMasters) April 10, 2022\nAnd I'll leave you with this stat...\nPlayers to win four times in a PGA TOUR season, including a major and a World Golf Championships event:\nScottie Scheffler, 2021-22\nTiger Woods, 2008\nTiger Woods, 2007\nTiger Woods, 2006\nTiger Woods, 2005\nTiger Woods, 2002\nTiger Woods, 2001\nTiger Woods, 2000\nTiger Woods, 1999\n— PGA TOUR Communications (@PGATOURComms) April 10, 2022\n 12:27AM\nWin the Masters and one of the prizes is...\n...you get to go into the Butler Cabin and take part in one of the most awkward ceremonies in sport - one that wouldn't be out of place in a David Lynch film...\nJim Nantz is the host and the American broadcaster loves mawkishness and delivers lashings of sickly sweet sentimentality - we'd be disappointed if he didn't.",
    "17:40 Harry Higgs (US), Lee Westwood (Eng)\n17:50 Kim Si-woo (Kor), Hudson Swafford (US)\n18:00 Marc Leishman (Aus), Talor Gooch (US)\n18:10 Hideki Matsuyama (Jpn), Viktor Holand (Nor)\n18:30 Webb Simpson (US), Will Zalatoris (US)\n18:40 Dustin Johnson (US), Cameron Champ (US)\n18:50 Rory McIlroy (NI), Collin Morikawa (US)\n19:00 Tommy Fleetwood (Eng), Jason Kokrak (US)\n19:10 Corey Conners (Can), Danny Willett (Eng)\n19:20 Charl Schwartzel (SA), Justin Thomas (US)\n19:30 Im Sung-jae (Kor), Shane Lowry (Ire)\n19:40 Scottie Scheffler (US), Cameron Smith (Aus)\n 4:41PM\nTiger Woods' final round is under way\nAnd the big beast is off to a fine start, parring the first before birdieing the par-five second.",
    "The Texan even had the luxury of four-putting the last for a 71 and a 10-under total and still be three clear of Rory McIlroy, the Northern Irishman who produced an astonishing eight-under 64 to move up from a tie for ninth into second, his best ever finish at The Masters..\nNobody has ever shot lower in the final round at Augusta (there had been seven 64s before this on the Sunday) and McIlroy’s wild celebrations after holing out from a bunker on the 18th were warranted, if only because of the electric atmosphere he had charged around that green.",
    "Scottie Scheffler with the famous Green Jacket after his dominant victory at Augusta Credit: REUTERS\nMasters leaderboard in full\nTiger Woods a winner again after surviving Masters slog\nMarauding Rory McIlroy lights up Masters final round but cynics still carp\nScottie Scheffler, the world No 1 from nowhere, capped one of the most remarkable winning stretches in the history of golf when easing to his first major here at the 86th Masters.",
    "Credit: REUTERS\n 12:14AM\nHere's a piece from Tom Cary on Rory's remarkable last round\nMarauding Rory McIlroy lights up Masters final round but cynics still carp\n Pure joy after McIlroy chipped in on 18 Credit: REUTERS\n 12:12AM\nHugs from the family\n Scottie Scheffler celebrates with his wife Meredith Scudder Credit: REUTERS\n 12:08AM\n'Walking in the footsteps of legends'\nCan you get an more Masters-type phrase?!",
    "— Andrew Cotter (@MrAndrewCotter) April 10, 2022\n 10:59PM\nFair to say Rory was quite happy with that bunker shot\npic.twitter.com/2tHeq97Fgs\n— The Masters (@TheMasters) April 10, 2022\n 10:57PM\nThe final pair are on the 14th\nBoth parred the par-five 13th, Scheffler adding to the drama of the past 30 minutes with a missed short putt that would have got him to 11-under, with a four-shot lead.",
    "TIger Woods hits a drive during his final round Credit: GETTY IMAGES\n 4:32PM\nAll signs point to a Scheffler win, but anything can happen on Masters Sunday\nAt one point yesterday evening, when Scottie Scheffler had a six-shot lead, many among you may well have worried that the fabled Masters last round would be a rather prosaic procession rather than an exciting Sunday.",
    "I knew I needed my best score here to have a chance...it's probably not going to be low enough\"\nOn the round as a whole...\n\"It's the most fun I've had on a golf course in a very long time\"\nOn the fast start...\n\"I really wanted to post a number...when I birdied one i thought 'this could be the one...it's probably not enough but you never know.\"",
    "Whatever he's been faced with today he's dealt with calmly and with utter class - to think that some (I might have been among them...) thought he might falter today...\nScheffler - 12-under\n McIlroy - seven-under\n Lowry - five-under\n Smith - five-under\n Credit: REUTERS\n 11:43PM\nShane Lowry finishes with a birdie at 18\nAnything Rory can do...",
    "With Scheffler having chipped in for a birdie at the third, “I’m not saying it was the crucial moment, but it got me going” - the gap was four and although McIlroy very briefly made it three with his miracle on 18th, Scheffler birdied the 14th with a sumptuous approach from 150 yards to four feet and that was largely it.",
    "Yet at that stage, Scheffler was three ahead with five to play and however much McIlroy prayed his heroics would be enough to earn, at the very least, a play-off in which to shoot for his first green jacket and a place in the pantheon as only the sixth golfer to complete the grand slam, deep down he knew it would not.",
    "Unlikely, but...\nRory McIlroy out in 32 (-4), his best career first nine score in a final round at #TheMasters\n— Justin Ray (@JustinRayGolf) April 10, 2022\n 9:14PM\nSmith and Scheffler are at the seventh\nThey both parred the par-three sixth and so the American remains four shots clear of the Australian.",
    "#themasters pic.twitter.com/ftP97jAvTr\n— The Masters (@TheMasters) April 10, 2022\n 8:36PM\nRory needs to play the round of his life\nTo have a chance of finally getting his mitts on the famous green jacket - he's started off well and has a good look at birdie at the par-five eighth.",
    "That puts the Australian at five-under in solo third place, something that helps the bank balance, not that he'll be thinking about that after the disaster at the 12th...\nScheffler, as if you needed any telling, obviously negotiated the famous short hole, walking off with a three.",
    "And in some ways that round is hugely frustrating as it once again showed what he is capable of and why the career grand slam should be his, if only he could start in the same way as he's just finished...\nScheffler still has five holes to play so you never know...\n 10:44PM\nOh no!",
    "#themasters pic.twitter.com/zW0NxJ1PDI\n— The Masters (@TheMasters) April 10, 2022\n 9:28PM\nRory pars the 11th\nAnd hits the smart tee shot on 12 (the one Jack Nicklaus always advises you hit on the Sunday), ignoring the pin on the right and hitting it over the bunker.",
    "Scheffler - 10-under\n Smith - four-under\n 10:30PM\nRae's Creek at the 12th has another Sunday victim\nJack Nicklaus always says you have to ignore the pin on the right on Sunday and hit over the bunkers to the heart of the green and be happy to walk off with a par.",
    "- Lowest final round ever shot at #TheMasters is 64, done 7 times\n- Biggest final round comeback to win a major is 10 shots by Paul Lawrie at the 1999 Open (Rory was 10 back)\n— Justin Ray (@JustinRayGolf) April 10, 2022\n 9:45PM\nRory flying high\nEagle on No.",
    "Scheffler - 10-under\n Smith - seven-under\n 10:23PM\nRory McIlroy pars the 16th\nWith the traditional Sunday pin position in the bowl on the par-three (the scene of the famous Tiger chip in and subsequent fist pump in 2005) it's a decent chance for a birdie.",
    "pic.twitter.com/E22Fgh65RU\n— Sky Sports Golf (@SkySportsGolf) April 10, 2022\n 7:36PM\nSungjae Im and Shane Lowry\nHave got their fourth and final rounds under way - you suspect both will need a fast start to have a chance of a come-from-behind win today.",
    "#themasters pic.twitter.com/DWXrJxsA5A\n— The Masters (@TheMasters) April 10, 2022\n 8:45PM\nAnother bogey for Cam Smith\nHis tee shot at the par-three fourth found the front bunker and unable to get up and down the Australian registers another bogey.",
    "Scheffler his his remarkable approach to the 19th Credit: SHUTTERSTOCK\nIf Scheffler isn't to be wearing green come the end of the round it is more than likely that that will be because second-placed Cam Smith has hit one of the rounds of his life.",
    "No matter, that audacious splashdown on the 18th assured him of second, his best Masters finish.,\nThis was his fourth top five in his last eight Augusta appearances and it cannot be denied that he is getting ever closer to his green-clad dream.",
    "— Justin Ray (@JustinRayGolf) April 10, 2022\n 6:20PM\nIt's fair to say Scheffler's in fine form\nHere's a stat that will further that belief...(understatement, I know...)\nScottie Scheffler is seeking his 4th PGA Tour win of the season today.",
    "pic.twitter.com/Ax1kshJOrZ\n— Sky Sports Golf (@SkySportsGolf) April 10, 2022\n 7:46PM\nMin Woo Lee out in 30\nThe Aussie is the hottest golfer out on the course today - he's birdied the ninth, thanks to another laser-guided approach shot.",
    "It wouldn't be a shock to see JT (Justin Thomas, not John Terry...) put together one of his streaky-good rounds, he's been on the back foot since his first round 76 but he's by no means out of it if he can get 'hot' out there today.",
    "You have to feel for him\nScheffler - 11-under\n McIlroy - seven-under\n Morikawa - four-under\n Lowry - four-under\n Smith - three-under\n 11:06PM\nRory McIlroy speaks...\nOn whether that's the most fun he's had at Augusta...\n\"Yes, by far.",
    "— Justin Ray (@JustinRayGolf) April 10, 2022\n 11:48PM\nOne hole to go until Scheffler is crowned Masters champion\nThe faultless American pars the 17th despite being in trouble off the tee and having to chip sideways with his second.",
    "— Justin Ray (@JustinRayGolf) April 10, 2022\n 11:24PM\nAnd then the lead was five\nYes, FIVE SHOTS...this would be a collapse way beyond Devon Loch (and, dare I say it, Greg Norman) proportions if Scheffler doesn't win it from here.",
    "#themasters pic.twitter.com/BowR8LjYJT\n— The Masters (@TheMasters) April 10, 2022\n 8:19PM\nScheffler has problems with the driver\nHe's again hooked his tee shot at the par-four third left - this one is way left though...horrendous.",
    "The bold approach to the 15th pays off as he chips to below the hole and nails the six-foot putt - yet another example of his flawless short game today, it's been as close to perfection as you though possible on a Masters Sunday.",
    "Two-under collectively for their rounds - fine but not exactly putting the fear of God into the tow two...\n 9:31PM\nIt's still a two-horse race\nThe lead remains at four after birdies for Cameron Smith and Scottie Scheffler on No.",
    "9:34PM\nFront nine is over for most of the chasing pack\nAnd it's fair to say it hasn't gone according to plan - the plan being to put pressure on Scheffler and Smith by firing in a bunch of birdies (as some say in the USA...).",
    "Scheffler triumphed at the Phoenix Open on Feb 13 (his first ever PGA Tour title) then three weeks later in Orlando prevailed at the Arnold Palmer Invitational and then three weeks after that in Austin won the WGC Match Play.",
    "pic.twitter.com/I6gul06ywo\n— LKD (@LukeKerrDineen) April 10, 2022\n 7:15PM\nRory gets his final round under way\nIt's been another fallow year at Augusta for the four-time major winner yet to get his hands on a green jacket.",
    "He needs to hole this, you suspect, as Scheffler and Smith don't look like both throwing it away...\n 9:39PM\nSteady from Scheffler\nBut exceptional in the circumstances - he pars the par-five eighth to stay at 11-under.",
    "The Scot, who finished 12th at Augusta last year, will be looking for a good round here to move him up the leaderboard - he's now on five-over\n 4:54PM\nTiger's drive at the second\n Just went the 335 yards...\n335 yards.",
    "If there is a silver lining to that bogey-filled cloud (sounds a bit rank that, apols...) it's that Scheffler makes the same mistake - he too walks off the 10th green with a five and and his lead stays at four shots.",
    "Scheffler (12) - 10-under\n McIlroy (17) - six-under\n Smith (12) - four-under\n 10:35PM\nThe moment Smith's hopes ended\nCam Smith was getting back in the battle for top spot, but then finds the water at the 12th hole ??",
    "#themasters pic.twitter.com/uNyEsieMXC\n— The Masters (@TheMasters) April 10, 2022\n 7:56PM\nScheffler's lead already back to two\nScheffler found a gap in the trees through which to hit his approach to the first green.",
    "There are clearly some good scores out there today - if Smith, Thomas, Lowry or Im can shoot a 65...\n Min Woo Lee is making a move Credit: GETTY IMAGES\n 7:43PM\nScottie Scheffler in trouble off the tee\nAt the first.",
    "The world No.1 heads into today with a three-shot lead and, despite being two-over for his last seven holes on Saturday, looks as calm as anyone can be with the green jacket and a first major within their grasp.",
    "Granted, the relentless competitor within wanted and expected so much more but from where he had come in 14 months - from a car wreckage that almost cost him his right leg - this comeback still defied belief.",
    "10:56PM\nWhile we were salivating over that McIlroy magic\nCollin Morikawa, Rory's playing partner, also chipped in from the same bunker for birdie - he ends on four-under to go alongside Cam Smith in third.",
    "Having started 10 behind Scheffler, McIlroy was suddenly within four and observers began whispering about Paul Lawrie and his own major victory from a 10-shot Sunday deficit at the 1999 Open Championship.",
    "just outside the top 10.\n Credit: SHUTTERSTICK\n 5:49PM\nBrit Watch\nIf every year you fancy Matt Fitzpatrick to have a good tournament ahead of the first round at Augusta I suspect you're not the only one.",
    "Credit: GETTY IMAGES\n 6:23PM\nHere's another good stat\nTomorrow is the first time there have been two top-10 players in the world in the final Sunday group at #TheMasters since 2010 (Mickelson-Westwood).",
    "10:39PM\nThe fear was that this was going to be a Scheffler procession\nAnd it will be one of the biggest shocks in Masters history if that amble towards the green jacket doesn't happen for the American.",
    "He birdied the first courtesy of a wedge to nine feet, made up for the disappointment of failing to get up and down from a bunker on the par-five second by birdieing the third after driving the green.",
    "Of those that are making moves in the right direction, Rahm is two-under through eight for his round and Russell Henley is three-under through seven having birdied the second, sixth and seventh.",
    "Last time he played Golden Bell he posted a nightmare, cold-sweat inducing 10...that won't happen today as his tee shot lands safely on the green, over the bunkers, the way he played it in 2019.",
    "Final scores\nScheffler - 10-under\n McIlroy - seven-under\n Lowry - five-under\n Smith - five-under\n 11:49PM\nScottie S is about to make it four wins in his past six starts\nHaving not won before..!",
    "#themasters pic.twitter.com/0e6M3j9MtP\n— The Masters (@TheMasters) April 10, 2022\n 11:31PM\nCam Smith has bounced back well\nHe's just birdied the par-three 16th having done the same at the 15th.",
    "11:40PM\nJustin Thomas' challenge never got going\nThe all-American star was strongly fancied at the start of the week, but an opening-round 76 scuppered any real hopes of green-jacketed glory.",
    "He proves he's more than fallible by double-bogeying the last, but that horrendous four-putt doesn't matter as he raises his arms soaking in the glory that victory at Augusta brings with it.",
    "Never an easy hole - lots of golfers have been going into the green with longish irons this week - from a decent position in the centre of the fairway Woods hit his approach short and right.",
    "He loves playing at Augusta - being the only man to ever card four rounds in the 60s is testament to that - and yesterday's 68 in brutal conditions was the best in the field by two strokes.",
    "When he made a mockery of the 13th’s status as a par-five, hitting his 200-yard second to 10 feet and then converting the eagle putt, an almighty din was reverberating between the pines.",
    "Rory McIlroy is overjoyed after he chipped in from the bunker on the 18th for birdie and a final-round 64 Credit: GETTY IMAGES\nEarlier, Woods made a highly emotional walk up the 18th.",
    "He's just birdied the 14th - a perfect drive is followed up by a jaffa of an approach, using the slope at the back of the green to bring the ball pin high within six foot of the hole.",
    "pic.twitter.com/1d0MIDaVfV\n— Sky Sports Golf (@SkySportsGolf) April 10, 2022\n 10:34PM\nSmith walks off the famous par-three with a triple bogey\nThe 12th has another final-round victim.",
    "Meanwhile, Cam Smith puts the pressure on with a fine three - having split the fairway with his drive the Australian struck his approach to 15 feet and he then nailed the birdie putt.",
    "10:07PM\nLast year's runner up\nWill Zalatoris is on a run - he's three-under for his past four holes (13, 14, 15 and 16) and now in a tie for fourth (with Im and Lowry) at three-under.",
    "Scheffler was brilliant as he won his first major and fourth title in his past six tournaments Credit: AP\nA fortnight later and he has rode this glory all the way to the Butler Cabin.",
    "Anyone who hopes the American will 'bottle' it today only need to look at how he fared on the 18th last night for evidence that it's highly unlikely that Scheffler will throw it away.",
    "pic.twitter.com/RXNbJQK36p\n— Sky Sports Golf (@SkySportsGolf) April 10, 2022\n 6:11PM\nHaving bogeyed three in a row\nTiger Woods has parred his next four holes and stays on nine-over.",
    "After four rounds of the toughest walk in golf, 14 months after a horrifying leg injury, not to mention all the back stuff, Tiger with an easy 172 mph ball speed drive on the 15th.",
    "There was another three on the par-four seventh where he putted in from off the green after thinning his approach and another birdie on the eighth where he wedged into seven feet.",
    "#themasters pic.twitter.com/OsN3YNOsxT\n— The Masters (@TheMasters) April 10, 2022\n 6:43PM\nBrit Watch\nBob MacIntyreis three-under for his round through 10 and lies on three-over.",
    "Francesco Molinari, Jordan Spieth and Greg Norman are just three who know how he feels...\nScheffler does heed Nicklaus' advice but hooks his tee shot well right, but it's dry.",
    "Of course, the 10th is where his infamous meltdown began in 2011, but he was four shots better on the par four on this occasion when chipping in 10 the slope from 15 yards.",
    "#themasters pic.twitter.com/ZsUNfnyyJ8\n— The Masters (@TheMasters) April 10, 2022\n 9:00PM\nPars for Smith and Scheffler at the tricky fifth\nI say tricky, they're all tricky!",
    "After chatting to the rules official and his caddie a calm, cool and collected Scheffler took an unplayable drop and hit a long iron off the pine straw just over the green.",
    "Hoping that we do see some excitement later here are three reasons why Scheffler might not have it all his own way today and why it could be Smith smiling after 18 holes.",
    "8:58PM\nShane Lowry is back to one-under\nThe 2019 Open champion had to get off to a great start and one-under through three hinted he was about to put something together.",
    "Certainly that procrastination did not make sense over these four days when, after grabbing the advantage midway through his second round, was not headed or even caught.",
    "8:34PM\nWonderful stuff from Scheffler\nGood break for Scheffler - his horrendous drive at the short par-four third still leaves him with an approach to the raised green.",
    "So there you have it, all signs point to a Scheffler win, but anything can happen at Augusta so it should be a fascinating next few hours, stay here for all the action.",
    "7:22PM\nRory McIlroy misses great chance at the second\nThe Northern Irishman misses a short birdie putt on the par-five having driven into the bunker with his approach.",
    "#themasters pic.twitter.com/P7wobcKbSw\n— The Masters (@TheMasters) April 10, 2022\n 4:48PM\nTiger back to seven-over\nMini disaster struck on the tough par-three fourth.",
    "#themasters pic.twitter.com/smCowk5i8V\n— The Masters (@TheMasters) April 10, 2022\n 12:00AM\nScottie Scheffler is the 2022 Masters champion\nAnd what a champion he is.",
    "10:26PM\nHuge moment on the treacherous 11th\nCam Smith hits a stunning approach to within 10 feet while Scheffler is down in the new gully to the right of the green.",
    "Credit: AP\n 10:43PM\nWhile we were lamenting Smith's watery approach\nOn the 12th, it was easy to forget to pay tribute to Scheffler's up and down on the same hole.",
    "He finds the gap but the ball goes over the green and leaves a fiendishly tough up and down - the chip that follows is 10/10, stunning shot to within three feet.",
    "To think he had been 13 behind at one stage on Saturday and here he was slicing through the field, putting the fear of God into all of those Scheffler admirers.",
    "He then plays the most delightful bunker shot, using the slope to direct the ball into the hole and the patrons (or fans as we call them in the UK...) go wild!",
    "The 2019 Open champion was on the green in two and holed his 25-foot birdie putt for the three to end with a 69, five-under overall to lie in a tie for third.",
    "Scheffler - 11-under(out in two-under 34)\n Smith - seven-under (out in one-under 35)\n 9:46PM\nSome stats for us to ponder...\nAs we watch Rory McIlroy's charge.",
    "If you say no you either need to increase your medication or are lying...\nTiger Woods has just posted a three at the famous par-three and remains on 10-over.",
    "7:04PM\nHere's some of the Harry Kane interview at Augusta\n\"When I'm on the first tee in front of a crowd I get more nervous than when I'm playing football!\"",
    "These were unforgettable moments for McIlroy and he will be full of self-belief for future Masters missions, now that he has such positive Augusta memories.",
    "It's a bit of good fortune he doesn't capitalise on as he hits his approach a touch heavy and it ends up short and left, the one place you cannot leave it.",
    "Never an easy hole (in fact it's been toughened up this year) Woods went right of the green with his approach and was unable to get up and down from there.",
    "Having birdied the first two, he's give both shots back and is now four behind Scheffler, who also had a tricky up and down, this one from off the green.",
    "Scottie S is now on 12-under and doubtless wondering whether green suits him..\n 11:15PM\nBold from Scheffler\nThe man is clearly feeling no nerves at all.",
    "Harry Higgs hit his approach on the same hole, with the same pin position to within an inch of the hole, leaving him the easiest, tap-in putt for eagle.",
    "Woods pulled his tee shot into the left-hand bunker, with the pin all the way on the right of the green, and was unable to get up and down for the par.",
    "Not known for being the calmest of chaps out on the course I suspect the Englishman is seething...he's on 15-over having started the day on nine-over.",
    "11:12PM\nAnd the lead is extended to four once more\nHe's playing so well, is so calm that I'm calling this - Scheffler is this year's Masters champion.",
    "#themasters pic.twitter.com/fOLbwx7SBl\n— The Masters (@TheMasters) April 10, 2022\n 7:25PM\nMin Woo Lee\nIs showing that there are good scores out there.",
    "His drive went left, leaving him to hit a low punch to the back of the green (a shot that did very well to avoid the bunkers at the front and right).",
    "Credit: GETTY IMGAES\n 5:12PM\nTiger's going backwards\nTiger fans look away now as he's compounded his bogey at the fourth with one on the tough fifth.",
    "7:34PM\nRory McIlroy makes another birdie\nHe only just gone and birdied the third - he's two under for his round and in the red numbers on one-under.",
    "From the fairway Scheffler goes first, hitting his approach beyond the pin and using the slope to bring it back under the hole to within five feet.",
    "That's a six and his chances of green jacket glory are all but over - the 12th once again proving to be both beautiful and brutal in equal measure.",
    "It's advice Cam Smith ignores as he aims at the pin, mishits it and comes up short, his ball ending in the most famous bit of water in world golf.",
    "Credit: GETTY IMAGES\n 7:32PM\nMost of us, including me, are assuming\nThat today will be a a two-horse race between Cam Smith and Scottie Scheffler.",
    "He's through Amen Corner without a blemish (two-under) and very much on the move...still think it's too little too late, but it's great to watch!",
    "From there he hit his approach to the top shelf of the green leaving himself a tricky downhill putt that he rolled a full 30 feet past the flag.",
    "Rounds of 67 and 72 got him into the top 10 and some speculated that perhaps he would be the man to go low today and put pressure on Scheffler.",
    "Cameron Smith, the reigning Players champion and the second hottest male player in the world at the moment, tried valiantly to close him down.",
    "4:44PM\nSome final-round tee times\nThe leaders, and you suspect the pairing the winner will come from, tee it up on the first at 7.40 our time.",
    "#themasters pic.twitter.com/j3zdhkzAnx\n— The Masters (@TheMasters) April 10, 2022\n 12:03AM\nThe winning moment\nRounding off a great four days.",
    "Rory ends on seven-under - that's an eight-under round of 64 , one off the course record and the joint lowest final round in Masters history.",
    "9:22PM\nBirdies apiece for Scheffler and Smith\nGreat bounce back from Smith who makes no mistake with his birdie putt, to move to seven-under.",
    "11:27PM\nCharl Schwartzel ends birdie, birdie\nNot quite the four birdies he finished with when he won in 2011, but a fine finish nonetheless.",
    "The Australian reduced the deficit on Saturday evening from six to three and after birdies on his opening two holes was actually within one.",
    "8:24PM\nMeanwhile (Rory fans, you'll like this one...)\nRory's doing what he tends to do when the pressure is off: put in a fine final round.",
    "A duck hook into the bushes right, and short of the fairway, on the 18th could easily have ended with him carding a double or triple bogey.",
    "6:09PM\nRussell Henley is on the move\nThe American has posted five-under for the front nine and is now back to two-over for the tournament.",
    "It's usually the toughest hole on the course but the duck hook of 2011 (remember when he hit it so far left into the trees on this hole?!)",
    "He pars the par-four ninth BUT so does Scheffler after a great approach from way right (after a wayward drive) and the lead remains four.",
    "\"We saw that Rory had posted seven under, and it got a bit tight, but I knew if I played solid it was still mine to win,” Scheffler said.",
    "He's not limping, instead smiling as though he's won - it's been yet another epic showing to add to his long list of golfing brilliance.",
    "An up and down saw him only register a five and not a six or seven, and off he walked as happy as anyone can be having bogeyed the last.",
    "The Australian is in the form of his life, has won twice already this year and is possibly the best iron player on the planet right now.",
    "He was never likely to challenge for a sixth green jacket but what he's done this week has still been jaw-dropping and a joy to behold.",
    "His main rival for the green jacket and today's playing partner Cam Smith, however, is safely slap, bang in the middle of the fairway.",
    "From there he does brilliantly to leave himself with a six-footer for par but he leaked it right and walks off the green on six-under.",
    "For all those who doubted his status as the male game’s best player, this was an emphatic justification of the 25-year-old’s standing.",
    "The old adage that the tournament doesn't start until the back nine on Sunday, bunkered along with any hope of nail-biting excitement.",
    "His chip was brilliant, giving him an eight-footer for par but the big beast missed and and is now on eight-over, back in 45th place.",
    "NO, not from Scheffler who chips in for birdie - he played that hole so badly and yet walks off with a birdie and is now at 10-under.",
    "He'll be a deserved winner and those who have been questioning his spot at the top of the world rankings will be few and far between.",
    "#themasters pic.twitter.com/L5fWWbR9cj\n— The Masters (@TheMasters) April 10, 2022\n 10:53PM\nMcIlroy chips in for birdie at the last!!",
    "I didn't mind the little hiccup on the last, and missing a couple of putts, because it meant I had time to get my emotions in check.",
    "He birdied the 15th, as well and by that stage Smith had fallen away, largely due to a triple-bogey at the notorious par-three 12th.",
    "I didn't mind the little hiccup on the last, and missing a couple of putts, because it meant I had time to get my emotions in check.",
    "Smith has a chance to add to the pressure BUT he too makes the same mistake leaving his approach short...\nTouch of nerves from both?",
    "6:38PM\nOne of the most famous walks in golf\nOver the Hogan Bridge as you approach the 12th green - who would love to make that walk?",
    "6:28PM\nImpressive from Tiger\nAt the tough par-fur 10th.He hooked a drive into the trees and had to play sideways on to the fairway.",
    "pic.twitter.com/1d0MIDaVfV\n— Sky Sports Golf (@SkySportsGolf) April 10, 2022\nIn the clubhouse McIlroy smiled and accepted his fate.",
    "I still think it will be too little too late - he always tends to play well in the final round of a major when the pressure is off.",
    "His drive at the par-five 15th is pulled slightly left, he's behind those protruding trees and a lay up is the clear, obvious play.",
    "7:40PM\nKane on Cam\nHarry Kane's backing Cam Smith to come from behind and win the Masters on the final day an Augusta National ??",
    "— Justin Ray (@JustinRayGolf) April 10, 2022\n 6:15PM\nDisaster for Hatton at the 11th\nThis error ended up with a double-bogey six.",
    "pic.twitter.com/kB8IKHtMoJ\n— Sky Sports Golf (@SkySportsGolf) April 10, 2022\n 6:57PM\nHow do you celebrate a win over Aston Villa?",
    "7:47PM\nScheffler's shoddy start\nMasters leader Scottie Scheffler with a less than ideal start as he tees off on the final day ??",
    "It's not obvious what happened as there was no coverage on Sky and the brilliant Masters app isn't showing what happened either.",
    "— Oliver Brown (@oliverbrown_tel) April 10, 2022\n 8:36PM\nScheffler's chip in at the third\nThe Tournament leader chips in on No.",
    "Scheffler - nine-under\n Smith - seven-under\n 7:51PM\nTiger is on the 18th tee\nHaving double-bogeyed the 17th - he's on 13-over.",
    "If there is one thing that Scheffler has told us in this startling 56 days it is that he has the wherewithal down the stretch.",
    "He pars the last after a brilliant approach and walks off the green to a standing ovation - one fully justified and deserved.",
    "He my not end up in green later on, but this is one of those Rory rounds that is hugely entertaining...he stays on six-under.",
    "The American was in the perfect position after a booming drive, but he pulled his approach and was unable to get up and down.",
    "9:04PM\nMcIlroy is on the move\nMost of us have already written him off BUT he's only just gone and birdied the par-four 10th.",
    "But what really resonates is his emphatic declaration that \"I'm pretty tired right now, I'm going to go home and celebrate.\"",
    "Credit: GETTY IMAGES\n 6:33PM\nNo sooner had I pressed send on that last post...\n...than Tiger then bogeyed the par-four 11th.",
    "It was his second successive 78 - his worst rounds in 27 years of playing at the Masters - and left him in 47th on 13-over.",
    "The American registers a par while the Australian bombs his eagle chance eight feet past the hole - that was a quick putt.",
    "\"We saw that Rory had posted seven under, and it got a bit tight, but I knew if I played solid it was still mine to win.",
    "Ignoring conventional wisdom he decides to hook his approach around the trees and over the water to just over the green.",
    "The last player to leave #TheMasters with the green jacket & 4 wins so far in that PGA Tour season: Arnold Palmer, 1960.",
    "The Australian nails his birdie putt BUT the American makes sure of his par with a huge putt to avoid a two-shot swing.",
    "8:15PM\nShane Lowry gets to three-under\nThe Irish hero has birdied the second and is back to six shots behind Scheffler.",
    "Having driven right behind a tree he was on the green in three and then, what every golfer hates to hear, three putted.",
    "#themasters pic.twitter.com/BiKwNWXUkf\n— The Masters (@TheMasters) April 10, 2022\n 9:45PM\nThe Grand Slam is still on!",
    "From there it was always going to be tough to get up and down and so it proved to be, Woods unable to magic a three.",
    "5:07PM\nBrit Watch\nBob MacIntrye bogeyed the first but has bounced back with aplomb, birdieing the second and third.",
    "9:52PM\nSmith is playing well...\n...but since the first two holes hasn't been able to put Scheffler under pressure.",
    "But his approach doesn't catch the slope to bring the ball close to the hole, and he can only two putt from there.",
    "11:25PM\nHere's a stat\nAnd one that illustrates the changes to the hole - principally lengthening it - have worked.",
    "Eventually Smith posted a 73 to finish in a tie for third on five-under with another Irishman in Shane Lowry (69).",
    "It was only left for Scheffler to put on a show of dominance that so appropriately seemed cast in Tiger’s honour.",
    "He may not rouse excitement levels in the way that Tiger or Rory can but this has been a magnificent performance.",
    "The Sheffield United supporter is level-par for his final round and is currently on four-over, back in 27th spot.",
    "There were 0 eagles made this week on the 15th hole, the first time that has happened at The Masters since 1965.",
    "You suspect he'll post a good final 18 holes, end up in the top 10 but without ever challenging for the victory.",
    "The world No.42 birdied the second and then went on a run of four in four from the sixth and now finds himself.",
    "And it's going from bad to worse for Tyrrell Hatton, he's now on 16-over through 15, seven-over for his round.",
    "Pure joy for Rory McIlroy after his chip in at 18 Credit: GETTY IMAGES\n 11:00PM\nDo you get a jacket for this?",
    "7:26PM\nRory's opening birdie\nRory McIlroy immediately jumps into the top 10 with a birdie on the first hole.",
    "Smith is now just one shot back of Scheffler on eight-under now we have a battle on our hands - delightful!",
    "The world was seven-under for his first 13 holes and at that stage anything and everything looked possible.",
    "Another trip to the Masters without troubling the top 10 - you suspect that will change, but not this year.",
    "That left a tough up and down for par but a peach of a chip to within two inches left the par in no doubt.",
    "Smith, thanks to a sensational up and down from over the green into the grain, also walks off with a five.",
    "The Australian is five-under for his round through eight and is back in the red numbers now on one-under.",
    "Meanwhile, all the life has seemingly been sucked out of Cam Smith, he bogeys and is back to three-under.",
    "5:42PM\nOf those out on the course at the moment\nNo one has really made any move towards positive figures.",
    "7:20PM\nThe final round may not be going his way but...\n...Tiger is still producing some magic out there.",
    "A five-iron fired to within 15 feet at the famous, picturesque hole - great chance to move to six-under.",
    "If Scheffler gets through Amen Corner blemish free I think that old cliche will be redundant this year.",
    "The Spurs striker and golf-mad fan said: \"I think he'll make some birdies and run hot on the back nine.",
    "Dare I say it, possibly one of the most commanding victories in the history of this fabled tournament.",
    "He's played his way back into 'vague' contention and is currently two-under, one-under for the round.",
    "He's just parred 17 and his remarkable round will more than likely prove to be too little, too late.",
    "It's a good feeling to have so I am going to go out there and play really good golf again,\" he said.",
    "Cam Smith was getting back in the battle for top spot, but then finds the water at the 12th hole ??",
    "9:18PM\nTwo cracking approaches at the seventh\nFrom the the two most likely to end the day in green.",
    "Out of position off the tee, right into the trees, he was forced to chip sideways onto the fairway.",
    "Scottie Scheffler wins the Masters - as it happened\n 12:48AM\nA happy chap\nOne for the mantlepiece.",
    "Only Arnold Palmer had previously won four events including the Masters by this time of the year.",
    "\"My play this year has shown me I can get it done when I'm up against the best guys in the world.",
    "He drove to just short of the green at the short par-four third before chipping to within a yard.",
    "Under real pressure, going for his first major the American's short game has been sublime today.",
    "Having found the water the Australian chips right of the green and takes three shots from there.",
    "There are hints of Bubba Watson (thankfully minus the tears...) in Scheffler's brief interview.",
    "From early on Friday he dominated and never looked like anything other than a Masters champion.",
    "As with his horror drive at the 18th last night, the American has gone way left into the trees.",
    "His birdie attempt flirts with the hole but finishes agonisingly centimetres from dropping in.",
    "Well, that too didn't happen, he shot a level-par 72 to finish on one-under for the four days.",
    "He fired his approach (his second) to the back of the green and two-putted to get to six-over.",
    "Having bogeyed the first the Spaniard is back to seven-over thanks to a birdie at the third.",
    "Having finished in the top seven on debut in 2016 he's failed to finish in the top 20 since.",
    "8:40PM\nJustin Thomas\nStarted off as one of the firm favourites and also with a four-over 76.",
    "That was always likely after a hooked drive ended up among the trees on the tough par-four.",
    "He's playing with Jon Rahm who's had a tournament to forget, never really being in the mix.",
    "Lot's of \"it must have been great to have your family there on the 18th green\" type stuff.",
    "He's backing Cam Smith to come from behind and wear the green jacket in a few hours time.",
    "\"I've been on a great run and I'm thankful that I was able to keep that going this week.",
    "But the par at 15th - after a wild hook - needed to be a birdie to pile on the pressure.",
    "It is the sort of legendary company that Scheffler’s run is fully deserving of keeping.",
    "I've been on a great run and I'm thankful that I was able to keep that going this week.",
    "His approach, his third shot, is to within two feet leaving him with a simple par putt.",
    "He drove into the fairway bunker and then spanked the approach to the greenside bunker.",
    "Justin Thomas is on three-under, Sungjae Im on four-under and Shane Lowry on two-under.",
    "But can Charl Schwartzel (two-under) or Justin Thomas (one-under) make an early charge?",
    "From there he hit a vintage iron to a few feet above the flag and rolled it in for par.",
    "Well, if you're Harry Kane you fly over to Augusta to watch the final round in person.",
    "He nails the eight-foot birdie putt to move to three-under, four-under through eight.",
    "8:18PM\nThe leaders are on the second green\nScheffler is on in three and Smith in two.",
    "Rory nails the eagle putt at 13 and he's now at six-under, seven-under for the round.",
    "Of course he can...that's two holes in a row he's responded to putts from Cam Smith.",
    "Ireland has yet to hail a Masters winner, but two in the top four is not too shabby.",
    "\"I probably looked calm on the inside today, but it was a tough day and a long day.",
    "Lee Westwood is going the other way, one-over through four and is now on four-over.",
    "I probably looked calm on the inside today, but it was a tough day and a long day.",
    "Smith did very well to leave with a par four, a fine-two putt from above the hole.",
    "He hit his drive right into the first cut before leaving the approach well short.",
    "He started his fourth round on one-over and he left the first green at level par.",
    "He makes the putt and his lead over Smith is now back to six (four over McIlroy).",
    "Matt Fitzpatrick is one-under for his round (through seven) and is on three-over.",
    "5:18PM\nMore bad news for Tiger fans\nIt's a third bogey in a row for the main man.",
    "He hits his drive right meaning that choice to go for the green in two isn't on.",
    "That will give him hope of future glory at Augusta, he's had a fine four rounds.",
    "But it was as if the exertions had emptied the well, as he bogeyed the next two.",
    "He's since birdied the sixth but at one-under his race is almost definitely run.",
    "But what we do know is that he walked off to the fifth tee with a triple bogey.",
    "Smith then does the same, his ball ending above the hole within six or so feet.",
    "From there, however, he holed his fifth shot meaning he only left with a bogey.",
    "He lays up and hits the approach over the water t the back fringe of the green.",
    "McIlroy is the only challenger within four shots and he's running out of holes.",
    "Lucky guy, he looks very happy as he chats to the suited Sky Sports fraternity.",
    "His tee shot at the par-three sixth was short and right, short-siding himself.",
    "He's seven shots back, and definitely, not yet at least, out of the reckoning.",
    "9:40PM\nMagic from McIlroy\nHe's on the dance floor in two at the par-five 13th.",
    "He leaves his approach just over the green, but chips in from 30 or so feet.",
    "Not even Tiger Woods has ever managed the major-plated quartet by mid April.",
    "Harry Kane confirms he has the same fear at the first tee as the rest of us!",
    "Credit: GETTY IMAGES\n 6:46PM\nRemember Louis Ooosthuizen's albatross in 2012?",
    "As it happens the lead is at three and there's still some hope for McIlroy.",
    "The last player to win 4 times in 6 PGA Tour starts was Jason Day in 2015.",
    "Yet again, final-day Masters pyrotechnics almost certain to be in vain.",
    "Smith now has a tricky up and down to just fall to a two-shot deficit.",
    "The world No.1 saved par and is now looking good for that first major.",
    "This might prove to be the greatest 2nd-place finish in major history.",
    "10:53PM\nThat Rory chip at 18\nWatch and enjoy...\nWhat a way to finish.",
    "No, he did not win, but he exorcised a few Georgia ghosts regardless.",
    "He's just walked off the 13th green having registered another double.",
    "His run also included his first major, the PGA at Whistling Straits.",
    "And once that is done he can finally put on the famous Green Jacket.",
    "10:17PM\nThe Masters never starts until the back nine\nOr so they say.",
    "7:12PM\nTiger bogeys the 14th\nBut it could so easily have been worse.",
    "Why did it take Scheffler so long to visit the winner’s enclosure?",
    "He needs birdies and is running out of holes in which to get them.",
    "Though not sure the powers that be meant to make it this tough...",
    "A shocking four-putt on the last BUT a great performance overall.",
    "He then holed the right left, 30-foot putt to move to two -under.",
    "And there is still the 'worry' that that may still be the case.",
    "It came at the par-five second and it's nearly happened again.",
    "He's also confident he can go toe-to-toe with anyone and win.",
    "He misses it and falls back to seven-over - three shots back.",
    "Rory's run up the leader board continues with a birdie at No.",
    "Yet what a thrill he had given this memorable Masters Sunday.",
    "Scottie Scheffler now leads by five with three holes to play.",
    "11:32PM\nScheffler's bold birdie on 15\nNerves, what nerves?",
    "Not the start the leader by three shots would have wanted.",
    "8:00PM\nTiger's race is run\nAnd what a performance it was.",
    "Scheffler's chip ends behind the hole, within eight feet.",
    "Standing on the 12th tee the big beast is now on 10-over.",
    "Solid, but far from spectacular from Tiger's little bro.",
    "He makes no mistake with the putt and moves to 11-under.",
    "Anyone still think he's still not a worthy world No.1?!",
    "He goes the aerial route and ends 15 feet past the pin.",
    "He's now at 11-under, maintaining that four-shot lead.",
    "He is four under par today and tied for third place.",
    "10:06PM\nMcIlroy pars the 14th\nAnd what a par it was!",
    "Can he nail his birdie attempt to get to within one?",
    "The pair have just got their final rounds under way.",
    "He almost toppled a few with that ridiculous finale.",
    "He stays at 12-under, still with the five-shot lead.",
    "10:16PM\nNo birdie joy for Rory\nAt the par-five 15th.",
    "He's just parred the third and stays at that figure.",
    "He's now back to nine-over, two over for his round.",
    "The South African ends his tournament at level par.",
    "Serious cojones on him as well as touch and talent.",
    "I got off to a great start today and got rolling.",
    "He two putts from there and walks off with a par.",
    "However, disaster struck at the par-three fourth.",
    "He's now at four-under, five-under for the round.",
    "Surely, it's still a case of too little too late?",
    "So close... a tap-in eagle for Harry Higgs on No.",
    "He now has the par-fives at 13 and 15 to attack.",
    "Rory McIlroy eagles 13, he's now -7 for the day.",
    "He's six-under for the day and now on two-under.",
    "7 moves McIlroy to two under for the Tournament.",
    "Cam Smith hits the dreaded tee shot on the 12th.",
    "Scottie Scheffler is the 2022 Masters champion.",
    "Can Scheffler respond with a birdie of his own?",
    "Tyrrell Hatton's caddy said to use the 5 iron ?",
    "We're all idiots for doubting him, aren't we?!",
    "The chapter ends on Tiger Woods' 24th Masters.",
    "What a brilliant way to end a fantastic round!",
    "He's now on 11-over, four-over for his round.",
    "That's more than the tour average ball speed.",
    "One-under through 10, 11 and 12 is just fine.",
    "Tyrrell Hatton decided to use the 6 iron ???",
    "The noise was getting progressively louder.",
    "\"I never went this far in my dreams\" etc.",
    "I fancy him to be four-five under today.\"",
    "The lead stays at four for the American.",
    "is replaced by a booming straight drive.",
    "He stays at six-under, five shots back.",
    "10:14PM\nBogey for Smith...\nAt the 10th.",
    "He's just birdied the par-four seventh.",
    "I’d probably be crying now, otherwise.\"",
    "I’d probably be crying now, otherwise.\"",
    "The ball decided to go in the water ??",
    "Walking in the footsteps of legends.",
    "8:46PM\nToo little too late for Rory?",
    "He's still four back of Scheffler.",
    "The American is now on three-over.",
    "He's now seven-back of Scheffler.",
    "18 to put pressure on the leader.",
    "Rory McIlroy now tied for third.",
    "Here's his birdie at the eighth.",
    "Rory McIlroy is making his move.",
    "Rory McIlroy continues his run.",
    "8:37PM\nSame old story for Rory?",
    "He's currently on the 11th.",
    "A champion and his trophy.",
    "McIlroy holes out on No.",
    "He makes par from there.",
    "He's back to seven-over.",
    "A brilliant roll at No.",
    "9:15PM\nIs now the time?",
    "Trouble, what trouble?!",
    "He stays on six-under.",
    "He stays at level par.",
    "Four different states.",
    "He stays on nine-over.",
    "Back-to-back birdies.",
    "Surely too far back?",
    "He's on four-under.",
    "He ends on 13-over.",
    "One huge statement.",
    "Truly amazing ??",
    "He can't can he?",
    "YES HE CAN!!",
    "10.",
    "13!",
    "???",
    "??",
    "2.",
    "7.",
    "3."
  ]
}