{
  "id": 1435,
  "mediaId": 2525,
  "date": "2022-04-08",
  "headline": "Arlington man accused of shooting his nephew to death outside a Medford courthouse held without bail",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/04/SHOOTINGsc004-1.jpg?w=1024&h=718",
  "link": "https://www.bostonherald.com/2022/04/08/arlington-man-accused-of-shooting-his-nephew-to-death-outside-a-medford-courthouse-pleads-not-guilty-ordered-held-without-bail/",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Flint McColgan",
  "authorUrl": "https://www.bostonherald.com/author/flint-mccolgan/",
  "termIds": [
    1857,
    3416,
    4716,
    948,
    4832,
    4833,
    5136,
    5147
  ],
  "sentences": [
    "“There’s a lot of investigation that has to happen to understand who and why things happened the way they did.”\nMedford police first responded to multiple reports of gunshots in the area of the district courthouse at around 4:50 p.m., according to the statement of probable cause that was largely read aloud in court by prosecutor Ceara Mahoney, an assistant district attorney for Middlesex County.",
    "Xue and Wang had both just left the court following a Restraining Order Extension hearing where a judge ruled not to extend an order restraining Wang from Xue and his ex-wife, who according to Milligan was the only other family member present at Thursday’s arraignment.",
    "“It appears something serious and very tragic happened yesterday at the courthouse, and anything beyond that is pretty dangerous speculation,” defense attorney Leonard Milligan said in a brief statement following the hearing.",
    "The man accused of striking his nephew with his car and then shooting him to death outside a Medford courthouse Thursday afternoon pleaded not guilty to the charges and is being held without bail.",
    "Chenghai Xue, 44, of Arlington, appeared before Judge William Fitzpatrick at Somerville District Court Friday morning for his arraignment, accompanied by a court-appointed Mandarin interpreter.",
    "A witness told police he had seen Wang pinned between the two vehicles before seeing another man, who the police say is Xue, exit the Equinox and shoot Wang several times.",
    "Xue’s white Chevy Equinox had extensive front-end damage and a black Toyota RAV4 had damage to the driver’s side rear wheel well.",
    "Cops say Xue was lying facedown on the ground nearby, according to the doc, with blood visible on his hands and in his hair.",
    "The probable cause statement alleged that surveillance footage shows the Equinox slamming into Wang at a high rate of speed.",
    "But lying in front of that wheel well was Xue’s nephew, Cong Wang, 23, “covered in blood” and with brain matter visible.",
    "Xue faces charges of murder and assault to murder and had a not guilty plea entered on his behalf.",
    "The scene at first looked like a traffic accident, according to a court document.",
    "A total of 10 shell casings were allegedly recovered from the scene.",
    "A probable cause hearing has been scheduled for May 4 at 10 a.m.",
    "He was declared dead at the scene."
  ]
}