{
  "id": 1437,
  "mediaId": 6454,
  "date": "2022-04-03",
  "headline": "Colorado Clerks Seek To Dispel Rumor Prior To “Election Truth” Rally",
  "image": "https://denver.cbslocal.com/wp-content/uploads/sites/15909806/2022/04/IMG_4778.jpg?w=1500",
  "link": "https://denver.cbslocal.com/2022/04/03/colorado-clerks-seek-to-dispel-rumor-prior-to-election-truth-rally/",
  "mediaOutlet": "denver.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Abeyta",
  "authorUrl": "https://denver.cbslocal.com/personality/michael-abeyta",
  "termIds": [
    3771,
    4011,
    4866,
    4915,
    4942,
    5079,
    5142
  ],
  "sentences": [
    "“Many of us here represented here today have spent hours responding to emails and office visits from constituents who have been intentionally misled by half-truths and lies,” said Tiffany Lee, the Clerk and Recorder for La Plata County.",
    "They say conspiracy theories about the 2020 presidential election being rigged to elect Joe Biden have kept them busy, but so far no one has provided any legitimate evidence anything illegal or suspicious happened.",
    "DENVER (CBS4) – Sunday morning a contingent of county clerks from all over Colorado gathered in downtown Denver to reassure Coloradans there is no election fraud happening in our state.",
    "They want evidence of fraud so they can investigate, or they want these groups to stop spreading what they see as misinformation, because they fear it will harm American democracy.",
    "“They don’t want the truth to come out about the election.”\nThe Colorado County Clerks Association says they want election truthers to put up or shut up.",
    "“That decreases the involvement in our so important government that we have,” said Weld County Clerk and Recorder Carly Koppes.",
    "“We do have safe and secure elections in Colorado,” said Molly Fitzpatrick the Clerk and Recorder from Boulder County.",
    "Their message was sent urgently ahead of an “Election Truth” rally planned for Tuesday at the Colorado State Capital.",
    "Peters is under investigation after voting machine information from her county was posted on the internet.",
    "Speakers include Mike Lindell and embattled Mesa County Clerk Tina Peters.",
    "She’s seen it happen,” Lindell told CBS4’s Rick Sallinger in February.",
    "Both say they have evidence that the 2020 election was fraudulent.",
    "“She was right there when a crime happened."
  ]
}