{
  "id": 1442,
  "mediaId": 2523,
  "date": "2022-04-05",
  "headline": "Masters 2022 Tee Times and Pairings for Augusta National Golf Club Announced",
  "image": "https://media.bleacherreport.com/image/upload/v1649174686/wnlbrcmq2kwjduowezjh.jpg",
  "link": "https://bleacherreport.com/articles/10031734-masters-2022-tee-times-and-pairings-for-augusta-national-golf-club-announced",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Daniels",
  "authorUrl": "https://bleacherreport.com/users/32e68f71-1938-4f03-b3b9-8fe447930dd7",
  "termIds": [
    1313,
    2124,
    2472,
    2630,
    3123,
    3899,
    4292,
    4698,
    97,
    595
  ],
  "sentences": [
    "ET: Matthew Fitzpatrick, Brooks Koepka, Rory McIlroy\nWoods confirmed during his press conference Tuesday he's planning to play \"as of right now,\" which would be his first official appearance since November 2020, and said he's teeing it up with the intent of being in contention:\nThe Masters\nTiger Woods believes he can win a sixth Green Jacket this week.",
    "<a href=\"https://twitter.com/hashtag/themasters?src=hash&amp;ref_src=twsrc%5Etfw\">#themasters</a> <a href=\"https://t.co/WHjD4BcOcx\">pic.twitter.com/WHjD4BcOcx</a>\nHe's a five-time Masters champion, and 1992 Masters winner Fred Couples, who played alongside Tiger and Justin Thomas in a practice round Monday, said his game looked in fine form.",
    "Jon Rahm is the slight favorite over Thomas and a host of others, according to FanDuel Sportsbook:\nThe Masters will begin Thursday at 8 a.m. when Jose Maria Olazabal and J.J. Spaun are the first players from the 91-golfer field to tee off.",
    "With his game seemingly in good shape, the question surrounds whether his right leg, which was seriously injured in a February 2021 car crash, can physically handle four trips around Augusta.",
    "Meanwhile, Hideki Matsuyama arrives as the defending champion after a final-round 65 to win last year's tournament by four strokes.",
    "Augusta National Golf Club announced the full slate of tee times for the first two rounds of the season's first major on Tuesday.",
    "Tiger Woods is scheduled to tee off the first round of the 2022 Masters Tournament at 10:34 a.m.",
    "Here's a look at some other notable groups with their opening-round start times:\n10:45 a.m.",
    "Matsuyama isn't the top choice on the betting markets to defend his title, though.",
    "Digital coverage will be available all four days on the Masters' official website.",
    "I know JT's not the longest hitter on tour, but I know he's damn long.",
    "ET: Jordan Spieth, Viktor Hovland, Xander Schauffele\n2:03 p.m.",
    "ET on Thursday alongside Louis Oosthuizen and Joaquin Niemann.",
    "ET: Dustin Johnson, Billy Horschel, Collin Morikawa\n1:41 p.m.",
    "On television, ESPN will handle the first two rounds (3 p.m.",
    "ET: Hideki Matsuyama, Justin Thomas, James Piot\n10:56 a.m.",
    "ET: Adam Scott, Scottie Scheffler, Tony Finau\n1:30 p.m.",
    "ET: Will Zalatoris, Patrick Cantlay, Jon Rahm\n1:52 p.m.",
    "ET both days) followed by CBS for the weekend (3 p.m.",
    "\"What impressed me the most is he was bombing it.",
    "\"He looked phenomenal,\" Couples told reporters.",
    "A champion will be crowned around 7 p.m.",
    "He was with him, flushing it.\"",
    "ET on Saturday and 2 p.m.",
    "ET on Sunday).",
    "ET on Sunday."
  ]
}