{
  "id": 1451,
  "mediaId": 2745,
  "date": "2022-04-07",
  "headline": "Sungjae Im takes the lead after first round at the Masters",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OVJ4AUWA4RHVNGFOJ4NEKTTMLI.jpg&w=1440",
  "link": "https://www.washingtonpost.com/sports/2022/04/07/masters-leaderboard-today/?utm_source=rss&utm_medium=referral&utm_campaign=wp_homepage",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Return to menu\nAs the first round of the Masters winds down, the leader board is starting to look spookily similar to the final round of the 2020 tournament, which was held in November because of the pandemic:\nAs of this writing, Johnson still has six holes to play, but the 2020 Masters champion is working on a bogey-free round.",
    "“We taped up my back, we did ice, we did physio, we did heat, we did drugs … and I wanted to play but even after another round of treatment this morning it was tender on the putting green, started to feel it on the chipping green and then couldn’t get past a 9-iron” on the range, he said then.",
    "Smith, a pretournament favorite to win after top 10 finishes in three of his last four Masters appearances and two PGA Tour victories this season, put his opening tee shot into a deep fairway bunker and his third shot well over the hole, ending with a 6 after his bogey putt rimmed away.",
    "There’s only place at Augusta National to go, then, for the 24-year-old South Korean, and after Thursday’s first round he’s right there: His round of 5-under-par 67 gave him the lead at the Masters, a score that was nearly one better after he almost holed out from the sand at No.",
    "It’s all business during the week and a few beers on the boat during the weekend.”\nSeeing as how Thursday’s Masters first round was “during the week,” Smith naturally was all business, firing a 4-under-par 68 to take the lead into the clubhouse in the first round of the Masters.",
    "But this was Tiger Woods, car crash survivor, and in that view, his 1 under was an exceptional result in his first competitive round since the day his car went off a Southern California road, resulting in a reconstructed right leg and more than a year of rehabilitation.",
    "But I made two stupid mistakes at 8 … but to end up in the red, I’m right where I need to be.”\nIt was far from perfect, of course: Woods’s tee shots found the gallery with increasing regularity as the round went on, and he misjudged a chip or two for a bogey at No.",
    "Return to menu\nUntil Thursday, Sungjae Im was known for three things: his exceptional ball-striking, his ability to play in what seemed to be every single professional golf tournament on offer and for his second-place tie behind Dustin Johnson at the 2020 Masters.",
    "Im’s reputation as one of the golf’s most ardent grinders — he spent the early portion of his PGA Tour career living out of hotels before finally buying a house in Atlanta last year — began on the Japan Golf Tour, where he once played 10 consecutive weeks.",
    "The five-time Masters champion, playing his first competitive round in 17 months after a 2021 car crash that left unclear whether he would ever compete again, finished the afternoon with a 1-under-par 71, four strokes behind first-round leader Sungjae Im.",
    "Im began his round with three straight birdies, becoming the first player to start off an April Masters in such a way since Webb Simpson in 2014 (three golfers did it in 2020, when the tournament was played in more forgivable conditions in November).",
    "Still been working hard the last couple of weeks at home and I really can’t wait to get back out here this week.”\nReturn to menu\nDanny Willett returned straight back to obscurity after his stunning win at the 2016 Masters, at least on these shores.",
    "Among the other high-profile Americans, two-time major winner Collin Morikawa finished 1 over par to tie for 31st; four-time major winner Brooks Koepka shot a 75; and 2020 U.S. Open winner Bryson DeChambeau is tied for 70th following a 4-over 76.",
    "Though he’s won a few times on the European tour — as recently as September — he has not been able to replicate the Sunday six years ago when Jordan Spieth’s Amen Corner collapse opened the door for Willett’s green jacket.",
    "And after the PGA Tour returned amid the coronavirus pandemic in 2020, he played in all but one tournament between the tour’s restart in June and August’s season-ending Tour Championship, where he finished 11th.",
    "Then, sitting at 2 under at the par-5 13th hole, he hit his second shot to 12 feet and made the eagle putt to join the leaders, and a birdie two holes later gave him the lead for the rest of the day.",
    "Return to menu\nWhen you’re a professional golfer with a mullet, as Australia’s Cameron Smith unrepentantly is, you’re bound to be asked questions about the party-in-the-back side of the equation.",
    "18, the mass of humanity that followed him around Thursday roaring with support, he sat only three shots back of clubhouse leader Cameron Smith and Scottie Scheffler, who was still on the course.",
    "Return to menu\nIn the grand sweep of Tiger Woods’s career, the 1-under-par 71 he shot Thursday at the Masters was hardly exceptional: three birdies, two bogeys, a bunch of semi-nervy par saves.",
    "Return to menu\nDespite opening the tournament with a double bogey, Australia’s Cam Smith has charged into a share of the Masters lead with a sizable group of other players as of 2 p.m. Eastern.",
    "By that point, Im already had scored his first PGA Tour win, at the 2020 Honda Classic a few weeks before the world shut down, and he added his second at the Shriners last October.",
    "And so here was Smith earlier in the week, dealing with queries about his beer consumption instead of the fact that he was coming off a Players Championship victory, was ranked No.",
    "Smith not only won the Players, which boasts a far stronger field than the Masters, but also January’s Tournament of Champions, beating all the winners from the previous season.",
    "But he used the knowledge gained from 23 previous Masters appearances, five wins and nine other top-10 finishes to work his way around the course with a good amount of success.",
    "And he had to be feeling optimistic as he approached the par-5 eighth, which is playing as the easiest hole on the course Thursday, with more birdies than pars from the field.",
    "The Masters got underway at Augusta National on Thursday, and the spotlight shined on Tiger Woods, who exceeded any reasonable expectation at the start of his latest comeback.",
    "Two weeks ago, the 44-year-old Casey conceded all three of his group-stage matches at the WGC Match Play because of back spasms, playing only two holes in the tournament.",
    "The 12th is the middle hole of Amen Corner, and Rae’s Creek, bunkers in front and back of the green and the oft-present breeze have made aces there all but unheard-of.",
    "Since the Masters win, he has finished in the top 10 in only one major (the 2019 British Open) and has missed the cut in four of five Augusta National appearances.",
    "Return to menu\nTiger Woods was cruising along nicely, his birdie at the par-3 sixth hole propelling him within sight of the early first-round lead at the Masters.",
    "Then, hitting from the fairway at the par-4 ninth, Niemann hit the early shot of the tournament, holing out from the fairway to assume the lead at 3 under par.",
    "When he made his lone birdie on the front — a two-foot putt at the par-3 sixth — fists shot into the air as if someone canned a buzzer-beater from half-court.",
    "When Woods walked from the practice green to the first tee Thursday morning at Augusta National Golf Club, the galleries lined the tee box a half dozen deep.",
    "Return to menu\nTiger Woods started the Masters with five straight pars before carding his first birdie in his return to golf after a February 2021 car crash.",
    "After only three holes, Im had gained more strokes putting than all but four other players, all of whom had either finished or nearly finished their rounds.",
    "Return to menu\nThere have only been three holes-in-one at Augusta National’s par-3 12-hole in Masters history, and none since Curtis Strange did it in 1988.",
    "Go three holes ahead, patiently work your way to the front of the crowd to get to the ropes — then hope he hits the ball on your side of the fairway.",
    "In his first tournament since suffering severe injuries in a February 2021 car crash, five-time Masters champion Tiger Woods shot a 1-under 71.",
    "He’s one ahead of Cameron Smith and two ahead of a group of players at 3 under: 2016 Masters champion Danny Willett, Joaquin Niemann, world No.",
    "The pertinent part, as it pertains to the competition: 14 months after a devastating car accident, Woods appears to be walking without a limp.",
    "Here’s what to know\nSungjae Im, who tied for second at Augusta National in 2020, fired a 5-under-par 67 to take the lead into the clubhouse.",
    "Woods was also three shots back after the first round of his last Masters appearance, in 2020 when the tournament was played in November.",
    "Willett has finished no better than a tie for 21st this season in tournaments played in the Western Hemisphere and has missed four cuts.",
    "He finished 19 strokes behind winner Dustin Johnson in a tie for 39th, and the course then was much more agreeable to the contenders.",
    "So he’s asked about beer and not, say, about his approach game, which was by far the best of any player after his 18 holes Thursday.",
    "Woods’s troubles began with his third shot, a chip that ended up traveling far shorter than intended, not even making the green.",
    "Return to menu\nEngland’s Paul Casey withdrew from the Masters before his first round began Thursday with an unspecified injury.",
    "Woods followed that near miss with a beautiful tee shot at the par-3 sixth hole, the ball landing about two feet from the hole.",
    "But Willett seemed to find something in Thursday’s opening round, carding a 3-under-par 69 to remain within sight of the lead.",
    "Trying to follow him in his first competitive round in 17 months is an exercise in neck-straining, luck-seeking and guesswork.",
    "Time will tell, but his impressive start on a course where he won the first of his 15 majors has already defined the week.",
    "At the par-4 third, Im curled in an even longer putt, from about 25 feet, to complete his opening trio of birdies.",
    "As of 12:38 p.m. Eastern, he was only one stroke behind leaders Harry Higgs and Talor Gooch, both at 2 under par.",
    "“I feel pretty hungry, mate,” he replied when asked earlier in the week how he was feeling ahead of the Masters.",
    "Tomorrow’s forecast calls for excessive winds, particularly in the afternoon when Woods is scheduled to tee off.",
    "Smith actually started his round with a double bogey on his first hole, and he remained at 2 over through four.",
    "Return to menu\nAUGUSTA, Ga. — Trying to follow Tiger Woods at the Masters is annually as much chore as reward.",
    "He’s one ahead of Australian Cameron Smith and two ahead of a group of players at 3 under, including world No.",
    "Woods had answered “I do” when asked at a Tuesday news conference whether he thought he could win this week.",
    "But birdies at 9, 13 and 15 followed, and he was the leader in the clubhouse after closing with a par at No.",
    "But he doesn’t have a major championship yet, and he has that mullet that’s abetted by a prominent mustache.",
    "At the first hole, he rolled in a 15-footer, followed by another of similar length at the par-5 second hole.",
    "But he played the next 14 holes at 6 under par, his lovely run spoiled by another double bogey at the last.",
    "“I wouldn’t say I drink a whole lot,” Smith said when asked at a news conference whether he likes to party.",
    "Woods nearly scored a birdie at the difficult par-4 fifth hole, when he stuck his approach within 10 feet.",
    "Return to menu\nTiger Woods obviously has been a massive draw Thursday upon his return to Augusta National.",
    "1 Scottie Scheffler, 2020 Masters champion Dustin Johnson, 2016 winner Danny Willett and Joaquin Niemann.",
    "His birdie putt looked to be heading for the bottom of the cup, but it caught the edge and caromed away.",
    "He converted the easy putt for his first Masters birdie since the 18th hole of his final round in 2020.",
    "He is the first player to open an April Masters with three straight birdies since Webb Simpson in 2014.",
    "Smith is in the clubhouse at 4 under par despite starting and ending his round with double bogeys.",
    "Woods’s par-save attempt dribbled off to the right, and his bogey-six sent him back to even par.",
    "“I did not have a very good round at all; I thought it was awful,” Woods told ESPN afterward.",
    "Im became the first Korean player to ever top the leader board after a round at the Masters.",
    "Tiger Woods shot a 1-under 71 in his first competitive tour round in more than 500 days.",
    "But in the meantime, he’s not thinking about that but rather the rest he’s about to get.",
    "Im birdied his first three holes and joined the leaders with an eagle at the par-5 13th.",
    "When Woods walked off the course after another par save of uncomfortable length at No.",
    "After bogeying his first hole, Niemann got it back with a birdie at the par-3 fourth.",
    "Return to menu\nThe South Korean is getting it done almost entirely with his putter.",
    "Im is the first Korean player to top the leader board after a round at the Masters.",
    "Defending champion Hideki Matsuyama is tied for 18th place after a first-round 72.",
    "But Joaquim Niemann, one of Woods’s playing partners, has stolen the show so far.",
    "He’s finished in the top 10 at Augusta National in three of the past four years.",
    "It’s not unusual to find yourself near a player, able to hear his conversation.",
    "“I definitely love a beer with the boys on the weekend or something like that.",
    "He got out of trouble by laying up and chipped to within about a foot for par.",
    "Woods’s galleries at Augusta this week offer all the intimacy of Woodstock.",
    "It didn’t change throughout his front nine, which he finished even par.",
    "Smith entered the tournament ranked eighth in strokes gained: approach.",
    "And he started slowly Thursday, sitting at even par after eight holes.",
    "The five-time champion had three birdies, and is tied for 10th place.",
    "6 in the world and was one of the pretournament Masters favorites.",
    "On the minor league Korn Ferry Tour, he played 17 straight weeks.",
    "What to watch: how he holds up physically over four days of this.",
    "Australian Cameron Smith sits a stroke behind in second place.",
    "Viktor Hovland almost joined that very small group Thursday.",
    "7 after his drive found the pine straw down the right side.",
    "1 Scottie Scheffler and 2020 Masters winner Dustin Johnson.",
    "Attending a golf tournament can be an intimate experience.",
    "He ranks second in that statistic (2.45) so far Thursday.",
    "He is, by any measure, one of the best players on Earth.",
    "“As the round built, I was able to get into the red.",
    "“Pretty good time of year to be playing good golf.",
    "The shot that followed went 15 feet past the hole.",
    "But, during the week I keep it pretty tidy.",
    "8 and 9 to find himself tied for the lead.",
    "Woods then did well to save par at No.",
    "Watch it, that is, if you can see it.",
    "Tied for fourth at 3 under: world No.",
    "You know, it’s just nice to contend.",
    "His ball-striking is not an issue.",
    "1 Scottie Scheffler and Johnson.",
    "Find the full leader board here.",
    "Now he’s leading the Masters.",
    "Want to see Tiger in person?",
    "This should be no surprise.",
    "But he birdied Nos.",
    "3 and 4 and Nos.",
    "18.",
    "18.",
    "8."
  ]
}