{
  "id": 1463,
  "mediaId": 2700,
  "date": "2022-04-09",
  "headline": "NFC offseason moves summary, 2022 NFL draft primer",
  "image": "https://www.denverpost.com/wp-content/uploads/2022/04/202204090042TMS_____MNGTRPUB_SPORTS-NFC-OFFSEASON-MOVES-SUMMARY-2022-NFL-1-FL5.jpg?w=1024&h=683",
  "link": "https://www.denverpost.com/2022/04/08/nfc-offseason-moves-summary-2022-nfl-draft-primer/",
  "mediaOutlet": "The Denver Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tribune News Service",
  "authorUrl": "https://www.denverpost.com/author/tribune-news-service/",
  "termIds": [
    0
  ],
  "sentences": [
    "Top Needs: OT, Edge, S, LB\nPhiladelphia Eagles\nAdditions: The Eagles re-signed center Jason Kelce, defensive tackle Fletcher Cox, safety Anthony Harris and pass rusher Derek Barnett, and added pass rusher Haason Reddick, linebacker Kyzir White and receiver Zach Pascal, who has started 44 games in his first four seasons.",
    "That means the teams with upper-echelon quarterbacks — Green Bay, Dallas, Tampa Bay, Arizona and the Los Angeles Rams — should all be able to lock up their division with little resistance if they can keep their rosters relatively healthy, and stack up wins in the regular season.",
    "Top Needs: Edge, QB, S, WR\nGreen Bay Packers\nAdditions: The Packers retained Aaron Rodgers, signing him to a three-year, $150 million extension, and re-signed linebacker Preston Smith to a four-year extension worth $52.5 million, and linebacker DeVondre Campbell.",
    "Top Needs: S, DT, CB, TE\nNFC SOUTH\nAtlanta Falcons\nAdditions: Receiver Calvin Ridley is suspended for the 2022 season for allegedly gambling on NFL games, and the Falcons added Demiere Byrd, KhaDarel Hodge and Auden Tate to fill out a thin receiver unit.",
    "Top Needs: CB, Edge, WR, RB\nLos Angeles Rams\nAdditions: The Super Bowl champs got a three-year, $129 million extension done with Matthew Stafford, and signed receiver Allen Robinson to a three-year deal worth $46.5 million to enhance his receiver unit.",
    "NFC EAST\nDallas Cowboys\nAdditions: The Cowboys retained defensive end Damarcus Lawrence by restructuring his deal, placed the franchise tag on Dalton Schultz and re-signed receiver Michael Gallup and safeties Malik Hooker and Jayron Kearse.",
    "Top Needs: QB, OT, OL, CB\nNew Orleans Saints\nAdditions: Jameis Winston, whose season ended prematurely because of a knee injury, was re-signed to a two-year deal worth $28 million, and the Saints also added veteran quarterback Andy Dalton.",
    "Departures: The Bears traded Khalil Mack to the Chargers, and must find replacements for linebackers Danny Trevathan, Alex Ogletree and Bruce Irvin, and defensive linemen Eddie Goldman and Akiem Hicks, who are all still free agents.",
    "Top Needs: OT, S, Edge, CB\nSan Francisco 49ers\nAdditions: The 49ers signed Charvarius Ward, who started 43 games for the Chiefs the past four seasons, seemingly moving on from Josh Norman and Jason Verrett, who remain free agents.",
    "Top Needs: OG, WR, CB, LB\nSeattle Seahawks\nAdditions: The Seahawks acquired quarterback Drew Lock, tight end Noah Fant, and defensive tackle Shelby Harris from the Broncos in the trade that sent Denver quarterback Russell Wilson.",
    "Top Needs: WR, CB, S, TE\nNFC NORTH\nChicago Bears\nAdditions: The Bears signed receivers Byron Pringle and Equanimeous St. Brown to help ease the departure of Allen Robinson (Rams), Damiere Byrd (Falcons) and Jakeem Grant (Browns).",
    "Receiver Russell Gage signed with Tampa Bay, linebacker Dante Fowler joined the Cowboys, tight end Hayden Hurst signed with the Bengals, linebacker Foye Oluokun signed with the Jaguars, and safety Duron Harmon joined the Raiders.",
    "Top Needs: QB, Edge, WR, S\nCarolina Panthers\nAdditions: The Panthers signed offensive guard Austin Corbett to a three-year, $29 million deal, and added center Bradley Bozeman to replace Matt Paradis, who remains a free agent.",
    "Four key defenders — Chandler Jones (Raiders), Jordan Hicks (Vikings), Jordan Phillips (Bills) and Malcolm Butler (Patriots) — left Arizona, and defensive tackle Corey Peters and cornerback Robert Alford remain free agents.",
    "Top Needs: OT, WR, QB, LB\nTampa Bay Buccaneers\nAdditions: Future Hall of Fame quarterback Tom Brady unretired, committing to play one more season for new coach Todd Bowles, who replaced the abruptly retired Bruce Arians.",
    "Top Needs: Edge, S, WR, OL\nNew York Giants\nAdditions: Tyrod Taylor was signed to a two-year deal worth a base of $11 million to replace Mike Glennon as Daniel Jones’ backup heading into Jones’ important fourth season.",
    "Departures: Dallas lost two members of the starting offensive line in La’el Collins (Bengals) and Connor Williams (Dolphins) and two wide receivers, Amari Cooper (Browns via trade) and Cedrick Wilson Jr. (Dolphins).",
    "Offensive tackle Andrew Whitworth retired, offensive guard Austin Corbett and punter Johnny Hekker signed with the Panthers, and receiver Robert Woods got traded to the Titans for a 2023 sixth-round pick.",
    "Seattle also signed defensive linemen Quinton Jefferson, linebacker Uchenna Nwosu and cornerback Artie Burns, and re-signed tailback Rashaad Penny, tight end Will Dissly and offensive lineman Kyle Fuller.",
    "Arizona also added cornerback Jeff Gladney, a 2020 first-round pick, signing the troubled cornerback to a two-year, $6.5 million deal, and added offensive guard Will Hernandez and linebacker Nick Vigil.",
    "Top Needs: OG, CB, S, DT\nNFC WEST\nArizona Cardinals\nAdditions: The Cardinals re-signed tailback James Connor, and tight ends Zach Ertz and Maxx Williams, keeping things somewhat consistent on offense.",
    "Carolina also added safety Xavier Woods, cornerback Rashaan Melvin, defensive linemen Matthew Ioannidis and Marquis Haynes, linebackers Damien Wilson and Cory Littleton, and tailback D’Onta Foreman.",
    "Departures: Linebacker Nick Vigil signed with the Cardinals, tight end Tyler Conklin joined the Jets, safety Xavier Woods joined the Panthers, and defensive tackle Michael Pierce joined the Ravens.",
    "Clark, re-signed receivers Josh Reynolds and Kalif Raymond, and added tight end Garrett Griffin, who started nine of the 20 games he played in his four seasons with the Saints.",
    "Departures: Pro Bowl receiver Davante Adams was traded to the Raiders, and receivers Equanimeous St. Brown (Bears), and Marquez Valdes-Scantling (Chiefs) left as free agents.",
    "Top Needs: CB, Edge, S, OL\nWashington Commanders\nAdditions: Washington traded for Carson Wentz, hoping he’s an upgrade over Ryan Fitzpatrick and Taylor Heinicke.",
    "Departures: Defensive tackle DaQuan Jones signed with the Bills, and linebackers Jermaine Carter Jr. (Chiefs) and Haason Reddick (Eagles) left as free agents.",
    "Departures: Linebackers Genard Avery (Steelers) and Alex Singleton (Broncos) signed elsewhere, and reserve defensive tackle Hassan Ridgeway joined the 49ers.",
    "Departures: The Buccaneers acquired guard Shaq Mason from the Patriots to address the retirement of Ali Marpet, and Alex Cappa’s departure to Cincinnati.",
    "Linebacker Anthony Barr, defensive end Everson Griffen, defensive tackle Sheldon Richardson and cornerback Mackensie Alexander are still free agents.",
    "Defensive end Al-Quadin Muhammad, defensive tackle Justin Jones and linebacker Nicholas Morrow were signed to add some bite to the Bears defense.",
    "Departures: The Commanders must find two new starting guards because Brandon Scherff signed with the Giants, and Ereck Flowers was released.",
    "Take a look at the key additions and departures from every NFC team, analyzing what teams improved the most, and which ones remain stagnant.",
    "Washington’s usually deep defensive line was thinned out because Matthew Ioannidis (Panthers) and Tim Settle (Bills) left as free agents.",
    "Top Needs: WR, Edge, OT, DL\nMinnesota Vikings\nAdditions: Linebacker Za’Darius Smith signed a three-year deal worth a base of $42 million.",
    "More than half-dozen teams in the NFC are in some phase of a rebuilding project, overhauling their rosters to get younger and cheaper.",
    "Tailback Raheem Mostert and receiver Trent Sherfield signed with the Dolphins, and receiver Richie James Jr. signed with the Giants.",
    "Departures: Quarterback Matt Ryan was traded to the Colts for a 2022 third-round pick, ending his 14-year tenure with the Falcons.",
    "Linebacker Jordan Hicks, defensive lineman Harrison Phillips and offensive linemen Jesse Davis and Chris Reed joined the Vikings.",
    "Linebacker Jalen Reeves-Maybin signed with the Texans, safety Dean Marlowe and receiver KhaDarel Hodge signed with the Falcons.",
    "Offensive lineman Will Hernandez signed with the Cardinals, while Nate Solder, Billy Prince and Matt Skura remain free agents.",
    "Pass rusher Randy Gregory (Broncos), safety Keanu Neal (Buccaneers) and kicker Greg Zuerlein (Jets) also left as free agents.",
    "Three starting offensive linemen — Jason Peters, James Daniels (Steelers) and Germain Ifedi (Falcons) — need to be replaced.",
    "Safety Marcus Maye was signed to a three-year deal worth $28.5 million to replace Marcus Williams, who joined the Ravens.",
    "Tight end Gerald Everett joined the Chargers and offensive tackles Duane Brown and Brandon Shell are still free agents.",
    "Two members of the Eagles starting secondary — cornerback Steven Nelson and safety Rodney McLeod — remain free agents.",
    "Departures: Starting free safety Logan Ryan signed with the Buccaneers, leaving a glaring hole in the Giants defense.",
    "Departures: Offensive guard Laken Tomlinson joined the Jets and offensive tackle Tom Compton signed with the Broncos.",
    "So did linebacker Za’Darius Smith (Viking), and offensive lineman Billy Turner (Broncos) and Lucas Patrick (Bears).",
    "Green Bay also re-signed cornerback Rasul Douglas and added defensive tackle Jarran Reed and punter Pat O’Donnell.",
    "Departures: Receiver Christian Kirk signed with the Jaguars, tailback Chase Edmonds signed with Miami, and A.J.",
    "Tight end Garrett Griffin joined the Lions, and starting inside linebacker Kwon Alexander remains a free agent.",
    "Chris Goodwin signed a three-year, $60 million deal, but is coming back from a season-ending knee injury.",
    "Veteran defenders Jason Pierre-Paul, Ndamukong Suh, Kevin Minter and Richard Sherman remain free agents.",
    "Marcus Mariota signed a two-year deal that will have him viewed as the Falcons’ bridge quarterback.",
    "And San Francisco added safety George Odum and receiver and return specialist Ray-Ray McCloud.",
    "Safety Landon Collins was released so Washington could avoid paying him his bloated contract.",
    "Departures: Replacing Wilson, a Super Bowl champion and nine-time Pro Bowler, won’t be easy.",
    "And neither will replacing linebacker Bobby Wagner, who joined the Rams after being waived.",
    "That explains why the Buccaneers added receiver Russell Gage to fill out the receiver unit.",
    "Jones (Broncos), Arden Key (Jaguars) and Kentavius Street (Saints) all left as free agents.",
    "Jabrill Peppers joined the Patriots and linebacker Lorenzo Carter signed with the Falcons.",
    "We also break down the top four position needs for each team heading into the NFL draft.",
    "Williams signed with the Ravens and his fellow starting safety Malcolm Jenkins retired.",
    "Tight end Ricky Seals-Jones was signed to replace Evan Engram, who joined the Jaguars.",
    "And guards Mark Glowinski and Jon Feliciano were added to fortify the offensive line.",
    "Howard signed with Buffalo and Rob Gronkowski hasn’t decided if he’ll play in 2022.",
    "Ronald Jones signed with the Chiefs, and safety Jordan Whitehead joined the Jets.",
    "Top Needs: OT, WR, Edge, RB\nDetroit Lions\nAdditions: Detroit added receiver D.J.",
    "Cornerback Patrick Peterson and backup quarterback Sean Mannion also re-signed.",
    "Cordarrelle Patterson was re-signed and Atlanta added tailback Damien Williams.",
    "Safety Logan Ryan and Keanu Neal were added to improve Tampa Bay’s secondary.",
    "Washington signed offensive guard Andrew Norwell, and re-signed tailback J.D.",
    "The Cowboys also added linebacker Dante Fowler and receiver James Washington.",
    "Departures: Pass rusher Trey Flowers was released and remains a free agent.",
    "Departures: Pro Bowl left tackle Terron Armstead signed with the Dolphins.",
    "Receiver Odell Beckham Jr. and tailback Sony Michel remain free agents.",
    "McKissic, offensive tackle Cornelius Lucas and safety Bobby McCain.",
    "The Lions also added linebackers Chris Board and Jarrad Davis.",
    "And tailbacks Leonard Fournette and Giovani Bernard re-signed.",
    "Departures: Elite pass rusher Von Miller signed with Buffalo.",
    "Tight ends Jimmy Graham and Jesse James remain free agent.",
    "Defensive lineman Tyler Lancaster remains a free agent.",
    "The Rams also added Pro Bowl linebacker Bobby Wagner.",
    "Defensive end Carlos Dunlap remains a free agent.",
    "Tailback Ty Montgomery signed with the Patriots.",
    "Cornerbacks Stephen Gilmore and A.J.",
    "Top Needs: OT, QB, Edge, CB\n()",
    "Bouye are still free agents.",
    "Green remains a free agent.",
    "On defense D.J.",
    "Tight end O.J."
  ]
}