{
  "id": 1465,
  "mediaId": 2637,
  "date": "2022-04-05",
  "headline": "Golf-Woods grouped with Oosthuizen and Niemann to start Masters",
  "image": "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.3.1/websites/images/np/favicon-np.ico",
  "link": "https://nationalpost.com/pmn/sports-pmn/golf-woods-grouped-with-oosthuizen-and-niemann-to-start-masters",
  "mediaOutlet": "news.nationalpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1313,
    1744,
    1986,
    2124,
    2492,
    3936,
    4735,
    595,
    4905
  ],
  "sentences": [
    "Among the other notable groups is the penultimate threesome of 2015 Masters champion Jordan Spieth, world number four Viktor Hovland and Xander Schauffele, who challenged Matsuyama in the final round last year before ending up tied for third.",
    "Betting favorite and world number two Jon Rahm will go out in the third-to-last group along with Will Zalatoris, who last year finished runner-up on his Masters debut, and reigning PGA Tour Player of the Year Patrick Cantlay.",
    "Five-time champion Woods, who suffered career-threatening leg injuries in a February 2021 car crash, was in the day’s 14th group set to go off the 445-yard par-four first hole at Augusta National for the year’s first major.",
    "Article content\nThe next group off the first tee will feature world number one Scottie Scheffler, 2013 champion Adam Scott and Tony Finau, who has three top-10 finishes in four Masters appearances.",
    "ET will feature England’s Matthew Fitzpatrick, four-times major champion Brooks Koepka and Rory McIlroy, who with a win this week would complete the career Grand Slam of golf’s four majors.",
    "Following Woods’ threesome will be defending champion Hideki Matsuyama, who last year became the first Japanese man to win a major championship, Justin Thomas and amateur James Piot.",
    "ET (1434 GMT) on Thursday in a group with South African Louis Oosthuizen and Chilean Joaquin Niemann, according to the starting times released on Tuesday.",
    "Playing one group ahead will be 2020 Masters champion Dustin Johnson, Billy Horschel and reigning British Open winner Collin Morikawa.",
    "Article content\nAUGUSTA — Tiger Woods will mark his return to competition at this week’s Masters at 10:34 a.m.",
    "(Reporting by Frank Pingue in Toronto Editing by Toby Davis)",
    "The days’ final group at 2:03 p.m."
  ]
}