{
  "id": 1520,
  "mediaId": 2586,
  "date": "2022-04-05",
  "headline": "‘The Challenge’ Champ Blasted by Former Co-Star: ‘You’re Such a Donkey’",
  "image": "https://heavy.com/wp-content/uploads/2022/01/pjimage-21-1.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/entertainment/mtv-the-challenge/jemmye-carroll-zach-nichols-blasted/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Warnock",
  "authorUrl": "https://heavy.com/author/carolinewarnock/",
  "termIds": [
    2224,
    3943,
    235,
    500,
    597,
    1094
  ],
  "sentences": [
    "Like it just did not feel right to me to still be friends with someone that was so vocally [that way].”\nJemmye also explained that she felt as though Zach hasn’t grown over the years and was still the “piece of s*** human that you were years ago.” Zach replied to Jemmye’s comments on Twitter and wrote, “Only two things in the world smell like tuna, and one of them is Jemmye.” After that post, Emilee posted a long statement on her Instagram blasting Zach.",
    "As fans know, Zach Nichols and Jemmye Carroll have often traded blows on social media but their last dispute appeared to be the final straw for Emilee Fitzpatrick of “The Real World: Cancun.”\nIt all started with an interview Jemmye gave on the “Mike Lewis Podcast” where she said her issues with Zach stemmed from comments he’d made on social media.",
    "Someone put him back in the cabinet until he expires.”\nEmilee Appeared on 2 Seasons of ‘The Challenge,’ Including 1 With Zach & Jemmye\nEmilee got her reality TV debut on “The Real World: Cancun” and then competed on two different seasons of “The Challenge” although without much success.",
    "She said she didn’t have Twitter anymore but wanted to comment on the dispute, adding that Jemmye is a “wonderful person.” She then added:\nWhat amazes me is how some people especially little b****es can never grow they take everything so personally instead of becoming better.",
    "Despite not appearing in many episodes of “The Challenge,” Emilee was cast as an alternate on “All Stars 2.” However, she wasn’t needed by the producers and flew home without appearing on the spinoff.",
    "Jemmye & Zach’s Former Co-Star Emilee Blasted Zach on Instagram\nEmilee, who appeared on two seasons of “The Challenge” after her “Real World” debut, posted a long statement on her Instagram Story.",
    "There are always feuds going on in “The Challenge” world and one former cast member seemed to finally have enough of the drama between two stars of the show.",
    "She said since Zach used a food metaphor she would do so as well and wrote, “you are and will always remind me of a bowl of mayonnaise… white, bland.",
    "She returned for “Free Agents” and didn’t make it much farther, getting eliminated in the second episode by her “Real World” co-star Jonna Mannion.",
    "So take your washed up dry plastic Mattel Ken dollar store Barbie bin a** back to the Mayo jar you belong in and get canned.",
    "Not interesting without something else in the mix.”\nEmille added, “Something chicken salad can live with or without.",
    "Out of her two seasons of “The Challenge,” Emilee appeared on one, “Free Agents,” with both Jemmye and Zach.",
    "She said, “I couldn’t just stand by and let Zach be a f****** d*** on Twitter and not say anything.",
    "Follow the Heavy on The Challenge Facebook page for the latest breaking news, rumors and content!",
    "READ NEXT: CT Tamburello Hints at Going Head-to-Head With Johnny Bananas Devenanzio",
    "And not something someone would ever request to bring excitement into their lives.",
    "She first appeared on “Cutthroat” but was eliminated in the first episode.",
    "You’re such a donkey."
  ]
}