{
  "id": 1523,
  "mediaId": 6570,
  "date": "2022-04-06",
  "headline": "Gerry Dulac: Steelers want to give Minkah Fitzpatrick a big payday, but talks haven't started yet",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/20211226mfsteelerssports04-1649251541.jpg",
  "link": "https://www.post-gazette.com/sports/steelers/2022/04/06/pittsburgh-steelers-minkah-fitzpatrick-contract-extension-nfl-free-agency/stories/202204060089",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1659,
    1919,
    3686,
    3773,
    3835,
    4507,
    4606,
    612,
    671,
    823
  ],
  "sentences": [
    "But it’s ongoing, not only in terms of preparation for the draft, but our continued look at free agency and those that are available to us across a couple of positions.”\nBut, if the Steelers don’t find a potential starter in free agency, would they attempt to find one in the draft?",
    "The Steelers intend on changing that during the offseason, likely toward the start of training camp, when they give Fitzpatrick, 26, a T.J. Watt-like contract that will make him one of the highest-paid players at his position.",
    "Incredibly, 12 safeties in the NFL have average salaries higher than that for the life of their contract, led by Seattle’s Jamal Adams, who signed a four-year, $70 million extension in 2021 that averages $17.5 million.",
    "General manager Kevin Colbert said at the NFL owners meetings last week the Steelers have a starter or a player capable of being a starter at every position on the team but one — strong safety.",
    "Minkah Fitzpatrick is entering the option year of a rookie contract he signed with the Miami Dolphins that will pay him $10.61 million in guaranteed salary with the Steelers in 2022.",
    "At the top of the list is Tyrann Mathieu, a two-time All-Pro selection who played the past three seasons with the Kansas City Chiefs at an average salary of $14 million.",
    "We’ve gotten a lot of things done in free agency that I think set us up nicely for the draft where we can kind of let some things come to us and things of that nature.",
    "We’ll see what we can do in the coming weeks leading up to the draft.”\nThere are not many safeties — at least, starting-capable safeties — remaining in free agency.",
    "That opening was created when the Steelers elected to decline the fifth-year option on Terrell Edmunds that would have paid him $6.753 million in 2022.",
    "But, with the Steelers planning to sign Fitzpatrick to a huge deal, team sources said signing a high-priced safety such as Mathieu was not feasible.",
    "The Steelers have several strong safety-types on their roster, including special-teams standout Miles Killebrew and hybrid linebacker Marcus Allen.",
    "And that might not happen until they find another safety to line across from him in the secondary, either in the draft or free agency.",
    "“I think we go into the draft feeling that we can add from the bottom up, not necessarily having to plug in a starter,” Colbert said.",
    "According to team sources, the Steelers have not even started discussions with their two-time All-Pro safety on a new deal.",
    "“But the one place where we don’t have an established starter is at that strong safety so we’ll continue to look at that.",
    "The Steelers could re-sign Edmunds, a dependable player who started 60 of 64 games in four seasons with the team.",
    "But that would only happen if Edmunds found few suitors in free agency and was available for a reduced price.",
    "And look at all the options that fulfill that.”\nGerry Dulac: gdulac@post-gazette.com and Twitter @gerrydulac.",
    "“That’s always a nice place to be when you’re entering into the draft and you try to take the best players.",
    "Colbert called it “the one position we haven’t solidified from a starting-type role yet.",
    "“We’ve got two avenues to improve our team — free agency and the draft.",
    "That is almost a bargain at today’s market price for a safety.",
    "But they do not consider either player a potential starter.",
    "“You guys know our approach,” coach Mike Tomlin said.",
    "First Published April 6, 2022, 6:25am",
    "But, for now, it will have to wait.",
    "Colbert didn’t sound so sure."
  ]
}