{
  "id": 1541,
  "mediaId": 2712,
  "date": "2022-04-01",
  "headline": "Bart Skils is looking forward to Drumcode festival in the summer with this selection of techno",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2022/03/DCH_4327-1.jpeg?strip=all&quality=100&w=1920&h=1080&crop=1",
  "link": "https://www.thesun.co.uk/tvandshowbiz/music/18125178/bart-skils-is-looking-forward-to-drumcode-festival-this-summer-with-this-selection-of-techno/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Gwinnett",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He's also one of Holland's leading purveyors of techno, with his own Voltt event a highlight in the Amsterdam calendar over the years and a steady stream of releases delighting dance floors across the globe.",
    "E-dancer - Velocity Funk\nDetroit based Kevin Saunderson aka E-dancer is one of the godfathers of the techno scene and it's amazing to have him as part of the Drumcode festival.",
    "Drumcode Festival\nBart is also playing at this years Drumcode festival in Malta, taking to the stage as part of a mouth watering line up between 15th and 19th September.",
    "Adam Beyer - Dub Embassy\nLong time friend and Drumcode label boss, Adam is at the top of his game with his production of tracks and delivery of quality dj sets.",
    "Kolsch -Lorely\nComing from Germany, Kolsch managed to create a sound of his own with catchy melodies and repetitive hooks to build to a great momentum.",
    "\"Velocity funk\" is one of the tracks that created a milestone in techno music in the early 90’s and it still stands strong when it's played today!",
    "Richie Hawtin x Chilly Gonzales - Contain (In Key)\nRichie Hawtin is a true techno pioneer and has been part of the Drumcode events for many years.",
    "This is one of the vocal tracks that I love to play out at open air summer stages and Drumcode festival in Malta will definitely be the place!",
    "BART Skils has become a mainstay on Adam Beyer's Drumcode label alongside the likes of Alan Fitzpatrick, Joseph Capriati and Sam Paganini.",
    "Alan Fitzpatrick - Skeksis\nAlan has been part of the Drumcode family for many years and wrote a whole bunch of classics for the label.",
    "In this standout track he uses a beautiful vocal sample taken from the 80’s bbc tv-series “Harry’s game” by Irish folk group Clannad.",
    "While it might be a while away yet this looks like a great option if you fancy dancing at a late summer techno getaway this year.",
    "“Lorely\" is one of his special weapons that has been on my playlist for years with an mazing cool memorable hook off beat hook.",
    "It has a great super catchy repetitive vocal hook by Tom Stephan aka Superchumbo and get’s the crowd every time I play it.",
    "Joris Voorn - The Navigator\nAs fellow dutch musicians, Joris and I have known each other for over two decades.",
    "Layton Giordani - New Generation\nNew York based Layton Giordani is one of the biggest new talents on Drumcode.",
    "The club is known for weekend long opening hours and marathon closing sets and Ben is incredible at these.",
    "I admire him for his forward way of thinking when it comes to technology and innovative production style.",
    "He created his own sound within the techno spectrum, leaning into deep melodic with a good feel groove.",
    "Bart Skils feat Superchumbo - All Over My Body\nFor the last track, I will add a track I wrote myself.",
    "His sound is raw and hypnotic with many classic 90’s gems mixed with more contemporary pieces.",
    "It creates a perfect vibe and when the vocal sample comes in its pure magic on big dancefloor.",
    "We caught up with him this week and he's compiled a special Drumcode festival playlist for us.",
    "I saw him live at London’s Drumcode event at Printworks in October and that was amazing.",
    "On this track \"Navigator,\" he goes full on acid and creates a timeless piece of music.",
    "This track is in collab with Canadian classic pianist and songwriter Chilly Gonzales.",
    "It always takes the crowd to the next level when it's played at the right moment!",
    "Maceo Plex - revision\nMaceo Plex has a great feel for melody and special tracks.",
    "Ben Klock - Subzero\nBen Klock is resident at the famous Berghain club in Berlin.",
    "“Subzero\" that I love to drop on opening sets is a great hypnotic masterpiece.",
    "“Skeksis\" was a milestone for the label and it still sounds great today.",
    "This track has a tremendous break that lifts you up with crazy effects.",
    "He came into the scene like a rocket with some amazing productions.",
    "The result is a beautiful journey with pure listening pleasure.",
    "Read what he had to say about the music he chose below.",
    "For more information and for ticket deals head HERE.",
    "It's a timeless piece that I love to play.",
    "On dub embassy he goes a little deeper."
  ]
}