{
  "id": 1560,
  "mediaId": 6415,
  "date": "2022-04-05",
  "headline": "Do the Colts need a veteran backup for Matt Ryan?",
  "image": "https://www.gannett-cdn.com/presto/2022/03/21/USAT/dbe3919b-5dc1-49fa-96d5-e2fe60ab7de2-USATSI_8968335.jpg?crop=1673,941,x748,y66&width=1673&height=941&format=pjpg&auto=webp",
  "link": "https://www.indystar.com/story/sports/nfl/colts/2022/04/05/indianapolis-colts-news-backup-qb-options-matt-ryan/7255719001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=indystar/allsports",
  "mediaOutlet": "blogs.indystar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nate Atkins",
  "authorUrl": "https://www.indystar.com/staff/2684227001/nate-atkins/",
  "termIds": [
    1376,
    1709,
    1782,
    1887,
    3336,
    3474,
    3931,
    4232,
    496,
    671
  ],
  "sentences": [
    "It's hard to look at Ehlinger's body of work and have faith he could replace what Ryan brings an offense as a leader and pre-snap manipulator, but if the Colts want to develop him behind Ryan and not risk losing him through waivers, they have to consider whether they want to carry three quarterbacks on the roster.",
    "Indianapolis can compensate with quick passes and with help from All-Pro left guard Quenton Nelson, but pivots can disappear against elite edge rushers such as Joey Bosa, Chandler Jones, Demarcus Lawrence, Bradley Chubb, Josh Allen and Harold Landry, all of whom they will see this season.",
    "He’s shown the ability to carry a team in those moments when you need him to carry a team, and that’s shown time and time again.”\nThe Colts have to be aware of the risk at left tackle, where they plan to start Matt Pryor, who has made 15 starts at various positions in three seasons.",
    "With Wentz, the Colts had the element of subtraction to consider: He struggled in Philadelphia when looking over his shoulder at Nick Foles and Jalen Hurts, and part of trying to restore his confidence was offering him security.",
    "Wentz had foot surgery during training camp and wound up playing early on with two ankle injuries, but Indianapolis simply rotated backups with rookies Jacob Eason and Sam Ehlinger and journeyman Brett Hundley.",
    "But he's turning 37 now, with the skills to overcome pressure declining, and so much of the Colts' approach to this year appears built around the veteran savviness of the man they have under center.",
    "FOR SUBSCRIBERS: Peyton Manning says Colts are 'very close' to greatness and Matt Ryan will take them there\nMatt Ryan has been healthy\nRyan has been one of the most durable players in the NFL.",
    "But last year, when the Colts traded for another dual-threat quarterback in his late 20s with an injury history, they declined multiple chances to find Carson Wentz a proven backup.",
    "The Colts have spoken glowingly of Ryan ever since they pulled off the trade with the Falcons, but now they have to decide how best to surround and protect him.",
    "He's due a $4 million base salary this year from the Bears, who are rebuilding around Justin Fields and would likely take a draft pick to shed the salary.",
    "With Andrew Luck, Ballard had opportunities to trade Jacoby Brissett but chose to keep a backup he trusted, knowing the risk Luck so often played with.",
    "But without a first-round pick and with glaring holes at wide receiver and in the secondary, it's not the easiest road to maximizing Ryan's window.",
    "The move would prove to be prescient when Luck abruptly retired following shoulder surgery in the 2019 preseason and Brissett became the starter.",
    "Ryan Fitzpatrick (147 career starts) and Cam Newton (144) bring so much experience, but they could hold out for a chance to compete for a job.",
    "The Colts could trade for a veteran they like such as Foles, who won a Super Bowl with Reich in Philadelphia as a backup in the 2017 season.",
    "McCarron, Mike Glennon and Geno Smith are career backups who have all started games and played at least eight years in the league.",
    "But as they look to maximize a 37-year-old version of Matt Ryan, they have to ask themselves: Should they invest in his backup?",
    "Ryan, who comes with 232 career starts and essentially zero controversies, appears to have all the security in himself.",
    "He's stayed on the field despite taking at least 40 sacks in four straight seasons, including an NFL-high 48 in 2019.",
    "In 14 years as a starter for the Falcons, he's missed only three games, including just one in the past 12 years.",
    "These processes show each scenario is different, and the Colts must decide what the one with Ryan calls for.",
    "Nearly a month into free agency, the Colts made a big swing on a quarterback and not much else on offense.",
    "The draft could be an option if the Colts find someone they like more than Ehlinger to step in and play.",
    "But the Colts might not see any of them as having the ceiling to lead a playoff run if Ryan went down.",
    "Free agency does have veteran options, and the Colts have more than $22 million available to spend.",
    "General manager Chris Ballard's history offers a few different paths with backup quarterbacks.",
    "“Brings in elite leadership, elite accuracy,” Colts coach Frank Reich said of Ryan.",
    "He saw starter reps in practice for one week while Wentz missed due to COVID-19.",
    "“A model of consistency but also a model of consistency at a very high level.",
    "The sixth-round pick out of Texas did not attempt a pass as a rookie.",
    "He didn't get an offseason program due to COVID-19 restrictions.",
    "“He’s got that ‘it’ factor,\" Reich said of Ehlinger last season.",
    "Sometimes you say that (when) somebody flashes here or there.",
    "\"I mean, everyone who has ever been around the guy says it.",
    "Contact Colts insider Nate Atkins at natkins@indystar.com.",
    "The Colts have to decide where they believe Ehlinger is.",
    "Sam has been flashing in these moments his whole life.\"",
    "Follow him on Twitter @NateAtkins_.",
    "Is Sam Ehlinger capable?",
    "Blaine Gabbert, A.J."
  ]
}