{
  "id": 1562,
  "mediaId": 3992,
  "date": "2022-04-08",
  "headline": "Masters: Tiger Woods shoots 74 as Scottie Scheffler leads at Augusta",
  "image": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/52A6/production/_124085112_-a824c891-a58e-4c06-bd62-ef2349d5f300.png",
  "link": "https://www.bbc.com/sport/golf/61048081?at_medium=RSS&at_campaign=KARANGA",
  "mediaOutlet": "BBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Jurejko",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "-8 S Scheffler (US); -3 C Schwartzel (SA), H Matsuyama (Jpn), S Lowry (Ire), I Sung-Jae (Kor); -2 K Na (US), D Johnson (US), H Varner III (US), C Smith (Aus)\nSelected others: -1 J Thomas (US), C Morikawa (US), D Willett (Eng); E M Fitzpatrick (Eng); +1 T Woods (US); +2 L Westwood (Eng), R MacIntyre (Sco), S Garcia (Spa), T Hatton (Eng), J Rahm (Spa), R McIlroy (NI)\nTiger Woods was unable to match the standard he set on his comeback as world number one Scottie Scheffler dealt with tricky winds to take a commanding halfway lead at the Masters.",
    "McIlroy content but 'Rory Slam' is unlikely\nNorthern Ireland's Rory McIlroy said after his round - before Scheffler took command later on - that he felt he was still in contention to land an elusive first Masters, despite replicating his opening 73 on Friday.",
    "Woods 'definitely feeling it' after another encouraging display\nAfter a stunning performance on Thursday which defied expectations, the next question surrounding 46-year-old Woods was how his body would cope with the exertions of another 18 holes on Friday.",
    "While not as spectacular as his opening round, it was another encouraging performance from Woods - just 409 days after he suffered life-threatening injuries when he crashed his car while speeding in February 2021.",
    "Again, the physicality of the hilly Augusta terrain - which five-time champion Woods said coming into the tournament would be his toughest opponent - appeared to provide fewer difficulties than feared.",
    "England's Matt Fitzpatrick played with McIlroy in the opening two rounds and, following a one-over 73 on Friday, is two shots better off than his European Ryder Cup team-mate at level par.",
    "Justin Rose, the 2017 runner-up, missed the weekend after shooting another 76 and, another Englishman, amateur Laird Shepherd, propped up the leaderboard at 22 over on his Augusta debut.",
    "The 32-year-old, who has won the Open, US Open, and two US PGA Championships, looked in danger of being close to the cutline after a double bogey on the newly extended par-four 11th.",
    "Woods started with four bogeys in his opening five holes - his worst start in 92 career rounds at the Masters - before a birdie on the eighth galvanised the 15-time major champion.",
    "Big-name American trio Bryson DeChambeau, Brooks Koepka and 2015 champion Jordan Spieth were also among the 37 players - from the 89 men who started on Friday - who missed the cut.",
    "English pair Lee Westwood and Tyrrell Hatton are also two over at the halfway stage, while compatriot Tommy Fleetwood (+3) is the only other British player to make the cut.",
    "Defending champion Hideki Matsuyama of Japan, South Africa's 2011 winner Charl Schwartzel and overnight leader Im Sung-jae are sat alongside Lowry on three under.",
    "The left-hander, who finished 12th on his Masters debut last year, played solidly during Friday's second round and plans to \"take the reins off\" at the weekend.",
    "Afterwards, Woods said he had been in a \"grind\" at a testing Augusta National, but was happy after his astonishing comeback continued with him making the cut.",
    "Ireland's Shane Lowry carded a wonderful four-under 68 - only bettered on Friday by Scheffler and Justin Thomas - to sit in a four-way share of second place.",
    "They were wiped out by two more birdies on 13 and 14, with Woods annoyed at missing chances on 15 and 16 before resiliently holing out two pars to finish.",
    "However, he responded superbly with two birdies in the final seven holes to ensure he did not miss the weekend at Augusta for the second successive year.",
    "McIlroy acknowledged he could be a \"few shots better\" as he bids to finally complete the career Grand Slam - eight years after his last major victory.",
    "Fellow Scot Robert MacIntyre continued his impressive record of making the cut in every major he has played in by carding another 73 to sit two over.",
    "Playing in the 100th major championship of his career, the 64-year-old shot a 76 to finish 14 over and miss the cut for the eighth straight year.",
    "England's Danny Willett started the day one shot off South Korea's Im and moved to the top of the leaderboard after an impressive front nine.",
    "American veteran Stewart Cink claimed the first hole-in-one of the tournament, sparking fervent celebrations when he aced the par-three 16th.",
    "The atmosphere ramped up further when he sunk another birdie on the 10th, but Woods' progress was checked by successive bogeys on 11 and 12.",
    "Woods, 46, is one over par after carding a 74, following an opening-round 71 in his first competitive round since a car crash 14 months ago.",
    "It is also served to crank up the noise among the Augusta patrons, who again flocked in huge numbers to watch the former world number one.",
    "Scottish veteran Sandy Lyle, who won the 1988 tournament, conceded next year's Masters is likely to be his last appearance at Augusta.",
    "\"I feel my game is in a good spot,\" said Scheffler, who had not won a PGA Tour title before his three victories this year.",
    "But three successive bogeys after the turn saw the 2016 champion drop off the pace and he ended on one under after a 74.",
    "Instead, it was initially the ball-striking which was not quite at the same level as it was during his opening 71.",
    "\"You go out on Saturday and you play a decent front nine and all of a sudden you're right in the thick of things.",
    "\"It was one of the best rounds I've ever played, the conditions were difficult,\" said the 2019 Open champion.",
    "With no player blowing such an advantage since 1945, he looks primed to continue his dominant form in 2022.",
    "Lowry, 35, almost took the position outright but saw a short birdie putt on the 18th dribble past the hole.",
    "\"It's brilliant to know that my game stands up in the toughest of tests against the best players.",
    "The US Ryder Cup star has tied the tournament record for the largest 36-hole lead.",
    "\"It was a good fight, I'm in the ball game and tomorrow is a big day,\" he said.",
    "Scheffler, bidding for his first major win, holds a five-shot lead at the top.",
    "MacIntyre, 25, has reached the weekend in all eight of his major appearances.",
    "Fellow American Scheffler, 25, shot 67 to lead on eight under at Augusta.",
    "But afterwards he said: \"I'm feeling it, I'm definitely feeling it.",
    "\"I've done a good job of managing my way around the golf course.",
    "You never want to miss a cut in a major,\" he said.",
    "I've kept the cards pretty clean which is nice.\"",
    "I've just not had any magic yet,\" he added.",
    "My game is there,\" McIlroy told Sky Sports.",
    "I'm playing solid, I'm putting it decent.",
    "\"I showed some resilience and character.",
    "We have some work ahead of us tonight.\"",
    "\"It's a brilliant record to have.",
    "What about the other UK players?",
    "\"I'm in a decent position.\"",
    "\"I'm in a good spot."
  ]
}