{
  "id": 1579,
  "mediaId": 2570,
  "date": "2022-04-07",
  "headline": "National No-Fly List Legislation Introduced In Congress",
  "image": "",
  "link": "https://www.forbes.com/sites/suzannerowankelleher/2022/04/07/national-no-fly-list-legislation-introduced-in-congress/?sh=1f836cf55dec",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Suzanne Rowan Kelleher",
  "authorUrl": "https://www.forbes.com/sites/suzannerowankelleher/",
  "termIds": [
    1981,
    3165,
    3174,
    4538,
    91,
    521,
    955,
    1124
  ],
  "sentences": [
    "7433, “The Protection From Abusive Passengers Act” introduced by Swalwell and Brian Fitzpatrick (R-Pa.), passengers whose unruly or violent actions result in a civil or criminal penalty could be referred by the Federal Aviation Administration (FAA) or Department of Justice (DOJ) and placed on a “no-fly” list maintained by the Transportation Security Administration (TSA).",
    "“Unfortunately, too many of our pilots, flight attendants and crew members are dealing with unacceptable abuse from passengers — everything from kicking to spitting to biting,” said Rep. Eric Swalwell (D-Calif.), who introduced the bill, at a press conference.",
    "“This behavior is not only inappropriate, but it also puts other crew and passengers at risk.”\nTraditionally, each airline has kept its own internal list of passengers whose behavior was so egregious that they are no longer welcome to fly with that carrier.",
    "According to a 2021 survey of flight attendants, over 85% had dealt with unruly passengers in the first half of last year, when the most egregious incidents escalated to cause disruption on the flight and even, in some cases, violence.",
    "This bill has the potential to be a game changer.”\nIn February, Delta Air Lines CEO Ed Bastian asked the Department of Justice to create a master list of passengers banned from flying on commercial aircraft.",
    "“The TWU has been calling for such a banned-passenger list since the fall of 2021, as assaults against aviation workers have skyrocketed,” the organization said in a statement.",
    "On an Alaska Airlines flight in March 2021, a Colorado man who refused to wear a face mask swatted at a flight attendant, then stood up and urinated in his seat area.",
    "But that leaves the door open for a passenger who was banned on, say, United Airlines, to simply book future travels on Delta, American, JetBlue or Southwest.",
    "“Despite the severity and frequency of these events, not a single passenger who has assaulted a ground service worker has been prosecuted under federal law.",
    "The bill also has the support of the Transport Workers Union of America (TWU), the nation’s largest airline union representing over 65,000 aviation workers.",
    "Lawmakers introduced a bill yesterday to create a national list for unruly passengers in an effort to curb the rise of violent incidents on airplanes.",
    "Thank you, @RepSwalwell, for introducing the legislation to protect Flight Attendants and Passenger Service Agents,” the organization tweeted.",
    "The Association of Flight Attendants, which represents over 50,000 flight attendants at 17 airlines, applauded the introduction of the bill.",
    "In May of last year, a Southwest Airlines passenger punched out a flight attendant’s teeth after being told to keep her seat belt fastened.",
    "The bill has been referred to the Committee on Homeland Security and to the Committee on Transportation and Infrastructure.",
    "It has taken a while, but legislation to create a national no-fly list has finally made its way to Congress.",
    "The Federal Aviation Administration (FAA) received a record 5,981 reports of unruly passengers in 2021.",
    "Throughout this period of increased bad behavior, flight attendants have born the brunt of the abuse.",
    "The following week, U.S. Transportation Secretary Pete Buttigieg told CNN he was open to the idea.",
    "“It’s about time we take real action to keep Flight Attendants and passengers safe in the air.",
    "Incidents of disruptive passenger behavior on flights spiked during the Covid-19 pandemic.",
    "Under H.R."
  ]
}