{
  "id": 1585,
  "mediaId": 6656,
  "date": "2022-04-07",
  "headline": "Masters golf 2022: Rahm, Thomas favored as Tiger Woods returns to play",
  "image": "https://cdnph.upi.com/sv/ph/og/upi/3891649261945/2022/1/63b8581c7d5f6a12ac3d005578331f7d/v1.5/Masters-golf-2022-Rahm-Thomas-favored-as-Tiger-Woods-returns-to-play.jpg",
  "link": "https://www.upi.com/Sports_News/2022/04/07/Rahm-Thomas-favored-Tiger-Woods-expected-make-cut-Masters-golf/3891649261945/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Butler",
  "authorUrl": "https://www.upi.com/author/Alex-Butler/",
  "termIds": [
    1313,
    2086,
    2124,
    2708,
    3002,
    3899,
    3936,
    97,
    595
  ],
  "sentences": [
    "4, 5, 6, 11, 12, 13, 15, 16 from 8:45 a.m. to 7 p.m. on ESPN+ and Masters.com; Featured groups from 9:15 a.m. to 7:30 p.m. on ESPN+ and Masters.com; Round 1 telecast from 3 to 7:30 p.m. on ESPN+\nFriday\nSecond round\nTV: From 3 to 7:30 p.m. on ESPN\nStreaming: Featured hole Nos.",
    "4, 5, 6, 11, 12, 13, 15, 16 from 10:30 a.m. to 6:30 p.m. on ESPN+ and Masters.com; Featured groups from 10:15 a.m. to 7 p.m. on ESPN+ and Masters.com; Round 1 telecast from 3 to 7 p.m. on Paramount+\nSunday\nFinal round\nTV: From 2 to 7 p.m. on CBS\nStreaming: Featured hole Nos.",
    "4, 5, 6, 11, 12, 13, 15, 16 from 8:45 a.m. to 7 p.m. on ESPN+ and Masters.com; Featured groups from 9:15 a.m. to 7:30 p.m. on ESPN+ and Masters.com; Round 1 telecast from 3 to 7:30 p.m. on ESPN+\nSaturday\nThird round\nTV: From 3 to 7 p.m. on CBS\nStreaming: Featured hole Nos.",
    "4, 5, 6, 11, 12, 13, 15, 16 from 10:30 a.m. to 6:30 p.m. on ESPN+ and Masters.com; Featured groups from 10:15 a.m. to 7 p.m. on ESPN+ and Masters.com; Round 1 telecast from 3 to 7 p.m. on Paramount+; Green Jacket ceremony at 7 p.m. on Masters.com",
    "The final group, which features Koepka, McIlroy and Matthew Fitzpatrick, tees off at 2:33 p.m. McIlroy, who has titles in three of the PGA Tour's four major tournaments, is looking to complete golf's Grand Slam with a weekend victory.",
    "Thomas, defending champion Hideki Matsuyama and amateur James Piot tee off in the next group at 11:15 a.m.\nScheffler, the FedExCup standings leader, Tony Finau and Adam Scott tee off at 11:26 a.m. as part of Group 16.",
    "April 7 (UPI) -- Jon Rahm and Justin Thomas are the golfing favorites to win the 2022 Masters Tournament, which runs Thursday through Sunday in Augusta, Ga., as Tiger Woods makes his return to a PGA Tour event.",
    "The players who are either inside or tied for the Top 50 scores through the first two rounds will make the cut for the third and fourth rounds on Saturday and Sunday, respectively.",
    "\"I've been lucky to have great surgeons, great physical therapists and great physiotherapists who worked on me virtually every day,\" Woods said Tuesday.",
    "Featured groups\nThis year, Tom Watson will join fellow Hall of Famers Jack Nicklaus and Gary Player for the Honorary Starters segment of the tournament.",
    "He returns from a 17-month hiatus from competitive golf, the result of serious leg injuries he sustained in a 2021 single-car crash near Los Angeles.",
    "Masters coverage airs throughout the tournament on CBS Sports Network, ESPN, CBS, Masters.com, Paramount+, CBSSports.com and the CBS Sports app.",
    "That trio is scheduled to start play at 10:53 a.m. Woods, Joaquin Niemann and Louis Oosthuizen then tee off at 11:04 a.m. as part of Group 14.",
    "The total purse and winner's share will be announced Saturday, but the first place finisher is expected win more than $2 million.",
    "The first group tees up for the first major of the 2022 season at 8:30 a.m. EDT Thursday at Augusta National Golf Club.",
    "A slight chance of rain is forecast Thursday morning, but no additional showers are expected this weekend at Augusta.",
    "Forty-eight of the Top 50 players in the Official World Golf Ranking will navigate the vibrant, azalea-lined course.",
    "The strong winds also could make it difficult for golfers to land shots on the 7,510-yard course's narrow fairways.",
    "Cameron Smith, Bryson DeChambeau and Paul Casey are one of the first headline groups to tee off in the first round.",
    "\"It's been a tough, tough year, with a lot of stuff I have to deal with I don't wish on anyone, but here we are.\"",
    "Thomas, the 2017 PGA Championship winner, placed fourth at the 2020 Masters, his best finish at the tournament.",
    "How to watch (all times EDT)\nThursday\nFirst round\nTV: From 3 to 7:30 p.m. on ESPN\nStreaming: Featured hole Nos.",
    "Rahm, the 2021 U.S. Open champion, finished inside the Top 10 in his previous four appearances at the Masters.",
    "Jose Maria Olazabal and J.J. Spaun tee off in the first group at 8:30 a.m. to launch the competitive field.",
    "Spieth, Hovland and Schauffele, a 2020 Summer Games gold medalist, tee off at 2:22 p.m. in Group 30.",
    "Complex green designs, water hazards, large bunkers and tree clusters provide additional challenges.",
    "\"We've worked hard to get to this point, to walk the grounds, test it out and see if I can do this.",
    "The trio tees off at 8:15 a.m. EDT Thursday, with the ceremonial event streaming on Masters.com.",
    "\"Hopefully, I get to the back nine on Sunday and not needing a crazy [score] to get the win.\"",
    "The wet grass and thick air could slow putts and shorten drives early in the tournament.",
    "Being the only major that plays at the same venue every year makes it very special.\"",
    "Winds are expected to be between 20 and 30 mph during Friday's second round.",
    "Dustin Johnson, Morikawa and Billy Horschel tee off at 2 p.m. in Group 28.",
    "\"I've been there, I've done it and know I can play good here,\" Rahm said.",
    "973) is listed outside the Top 20 in the odds to win the Green Jacket.",
    "\"It's the Masters,\" Rahm told reporters at a news conference Tuesday.",
    "Rahm, Cantlay and Will Zalatoris tee off 11 minutes later.",
    "7) as Top-10 favorites in the 91-player field.",
    "5 Patrick Cantlay join Rahm (No.",
    "\"It's an iconic golf course.",
    "3 Collin Morikawa and No.",
    "He tied for 21st in 2021.",
    "1 Scottie Scheffler, No.",
    "18 Jordan Spieth, No.",
    "17 Brooks Koepka, No.",
    "7 Dustin Johnson, No.",
    "4 Viktor Hovland, No.",
    "6 Cameron Smith, No.",
    "9 Rory McIlroy, No.",
    "2) and Thomas (No.",
    "Woods (No.",
    "No."
  ]
}