{
  "id": 1589,
  "mediaId": 2586,
  "date": "2022-03-31",
  "headline": "Seahawks Make Likely Decision on Colin Kaepernick: Report",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-610466144-e1647487231586.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/seattle-seahawks/colin-kaepernick-kaep-rumors-signing-decision/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Adams",
  "authorUrl": "https://heavy.com/author/jondadams/",
  "termIds": [
    1459,
    1620,
    1895,
    2015,
    2546,
    2797,
    3849,
    4764,
    930,
    931
  ],
  "sentences": [
    "As Pete mentioned, we’ve spoken recently and still hoping that door is open and get a chance to walk through it.”\nCarroll on Kaepernick: ‘He’s Doing a Nice Job Presenting Himself’\nCarroll was asked if he could garner any information on Kaepernick’s status from watching the highlights of his workouts.",
    "So, he’s still competing for it.”\nESPN’s Brady Henderson reported that Kaepernick’s landing with the Seahawks “isn’t likely.”\nCarroll’s public praise of Kaepernick would seem odd if it’s true that the team had no interest in signing him.",
    "He’s doing a nice job presenting himself.”\nDuring a March 24 interview with Seattle Sports’ Dave Wyman and Bob Stelton, Seahawks general manager John Schneider did not indicate the team had a great deal of interest in adding Kaepernick.",
    "“Carroll said conversations ‘have not progressed’ with Colin Kaepernick, who told reporters last week that he’s still hoping the door is open for a shot with the Seahawks,” Henderson tweeted on March 29.",
    "“He’s a free agent so, yeah, there’s guys out there with experience like I said [Blaine] Gabbert, [Ryan] Fitzpatrick, Geno [Smith], he’s one of ’em,” Schneider said of the team’s potential interest.",
    "With Russell Wilson on the roster, it made sense why the Seahawks would be hesitant, but Carroll’s unprompted discussion of Kaepernick at the start of the offseason remains curious.",
    "Kaepernick on Seahawks Workout: ‘Still Waiting for That Chance’\nKaepernick hosted his second Seahawks-related workout on March 23, throwing to Seattle receiver Aaron Fuller.",
    "Seahawks head coach Pete Carroll indicated that his talks with Kaepernick “have not progressed” since their initial discussions at the beginning of the offseason.",
    "“Yeah, our conversations have not progressed from the early connection that we made,” Carroll told reporters on March 29.",
    "There’s a whole process we go through here, the free agency period and getting through the summer as you build your team.",
    "“That comment from Carroll is another indication it isn’t likely.”\nALL the latest Seahawks news straight to your inbox!",
    "All indications are that the Seattle Seahawks are not going to sign Colin Kaepernick as the team looks to find its QB1.",
    "“Not yet, still waiting for that chance [with Seahawks], still hopeful” Kaepernick explained to reporters on March 23.",
    "After his most recent Seattle throwing session, Kaepernick campaigned for a workout for the team.",
    "The former Niners star previously worked out on March 14, with Seattle wideout Tyler Lockett.",
    "Carroll described what he’d seen from Kaepernick’s throwing sessions over the last month.",
    "“Yeah, you can see that he’s running around, he’s throwing the ball,” Carroll said.",
    "Again, we’ve had conversations with Pete [Carroll] and John [Schneider] previously.",
    "He sent me stuff along the way to kind of keep me up with what’s going on.",
    "He’s all over the country traveling around, getting his workouts in.",
    "The quarterback was last on a roster during the 2016 NFL season.",
    "“Now, the difference is he hasn’t played in several years.",
    "There’s comments from the players that he works out from.",
    "“You can tell the distance that he’s throwing the ball.",
    "“I’ve watched a bunch of his workouts for stuff.",
    "“There’s been a lot of conversation around it.",
    "Join the Heavy on Seahawks newsletter here!",
    "So, he’s getting some information out.",
    "You can get a sense for the velocity.",
    "He’s really working hard.",
    "It never stops.”"
  ]
}