{
  "id": 1615,
  "mediaId": 2586,
  "date": "2022-04-01",
  "headline": "Former NFL Exec Reveals Steelers’ Likely Decision on Tyrann Mathieu",
  "image": "https://heavy.com/wp-content/uploads/2022/04/GettyImages-1341357646-e1648828813471.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/tyrann-mathieu-free-agent-minkah-fitzpatrick/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Randy Mueller",
  "authorUrl": "https://heavy.com/author/randy-muellerheavy-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "But I think they’re going to have to go younger at the safety position just because of what it’s going to take to sign Minkah long-term.”\nThe longer Mathieu remains on the free-agent market; the more affordable a contract will become.",
    "As evidenced by the Senquez Golson (2015), Artie Burns, Sean Davis (2016), Terrell Edmunds (2018) and Justin Layne (2019) selections, Pittsburgh has an underwhelming track record of drafting defensive backs, especially early.",
    "Though viewed as a bust because of where he was drafted compared to his output, Edmunds, 25, is serviceable considering the team’s otherwise limited affordable options.",
    "All-Pro Minkah Fitzpatrick is scheduled to become a free agent in 2023, and the Pittsburgh Steelers need to do everything in their power to ensure that doesn’t happen.",
    "Calls by fans for the Pittsburgh Steelers to ink veteran defensive back Tyrann Mathieu have been loud and proud since before the March 16 start of NFL free agency.",
    "He suffered injuries in three consecutive training camps (shoulder, 2015; foot, 2016; hamstring, 2017) and was subsequently cut in September 2017.",
    "A return on a short-term deal would at least provide continuity at a position from which they desperately need production opposite Fitzpatrick.",
    "— Ian Rapoport (@RapSheet) September 2, 2017\nBurns and Davis, selected in the first and second rounds, never lived up to their draft position.",
    "You just have to be patient and hang with it a little bit.”\nMoney Talks\nIt essentially comes down to money, as it almost always does in life.",
    "“I think they’re probably going to have to go younger there and get a guy who can play opposite the skillset that Minkah Fitzpatrick brings.",
    "Should the Steelers and Fitzpatrick not get a long-term deal hammered out this offseason, he’ll play on the $10.6 million fifth-year option.",
    "Depending on the haul after the smoke of draft weekend clears with college free agent signings, Pittsburgh could bring Edmunds back.",
    "While he’ll never be a first-round caliber player, Edmunds knows the Steelers’ system and mainly improved as his career progressed.",
    "Pittsburgh is one starter short at the safety position, and despite Steelers Nation’s pleas, Mathieu is still on the market.",
    "Spotrac calculated a market value for Fitzpatrick of four years, $61 million, which averages out to $15.2 million annually.",
    "Rapoport suggests that Mathieu, 29, is selective because the offers he’s been getting don’t jive with his perceived worth.",
    "A strong argument could be made that Fitzpatrick’s production deems him worthy of far more than he’s scheduled to make.",
    "Maybe if a team needs a safety, needs a leader, maybe they don’t get what they wanted in the draft, they come get him.",
    "“I don’t think they’re going to be in the market for an even medium-priced safety in free agency,” continued Mueller.",
    "“Like every year, there are a couple of free agents, who kind of just linger out there and wait for maybe the draft.",
    "Maybe it’s more of a box safety, maybe it’s more of a physical presence in and around the line of scrimmage.",
    "The #Steelers released former 2nd round CB Senquez Golson, who battled injuries and never found his footing.",
    "Mueller believes paying Fitzpatrick, though worth every penny, limits the options at Pittsburgh’s disposal.",
    "I could see Honey Badger being out there for a while.”\nALL the latest Steelers news straight to your inbox!",
    "But if Pittsburgh wants to keep Fitzpatrick happy — which they do — that’s likely where its focus will be.",
    "Unsafe at Safety\nThe thought of the Pittsburgh Steelers drafting a safety is enough to make my skin crawl.",
    "According to NFL Network’s Ian Rapoport, the three-time All-Pro isn’t in a hurry to cement his future.",
    "“The really good ones who know their value will just hang out and wait,” Rapoport continued.",
    "The Steelers aren’t firmly in a financial position to be players in the Mathieu sweepstakes.",
    "“I don’t get the sense that he’s in a rush at all,” Rapoport told Pat McAfee on March 25.",
    "Edmunds started 60 of 64 games, racking up 340 tackles and five interceptions.",
    "Because if you’re a great player, you have all the leverage.",
    "56 overall, never played a meaningful snap for the Steelers.",
    "They have to make whole a safety already on their roster.",
    "“It doesn’t always work out, but a lot of times it does.",
    "Both have spent their careers bouncing around the NFL.",
    "Join the Heavy on Steelers newsletter here!",
    "Golson, selected at No.",
    "You’re a great player.",
    "Why?"
  ]
}