{
  "id": 1649,
  "mediaId": 2586,
  "date": "2022-04-05",
  "headline": "Bills FA Receiver Talks About Uncertain Future, Hints at Retirement",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Emmanuel-Sanders-e1649191280846.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-wr-sanders-hints-retirement/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1858,
    2019,
    3069,
    3583,
    160,
    700
  ],
  "sentences": [
    "The way he throws deep, gets linemen off of him, just the way he spins the football, and just the way he attacks the game.”\nIsaiah McKenzie and the Bills have agreed to terms on a 2-year deal to keep McKenzie in Buffalo!#GoDawgs | #DawgsInTheNFL pic.twitter.com/MGhI4JX1YE\n— Georgia Football (@GeorgiaFootball) March 29, 2022\nThe Bills have already seen some changes in the wide receiver room this offseason.",
    "I’m gonna be on the beach somewhere while y’all are sitting out in the cold weather next year.”\nSanders Shares Love for Bills\nWhile he may still be undecided regarding his playing future, Sanders made it clear that he holds a lot of love for Buffalo.",
    "For me, hold myself to a standard in which I want to produce and which I want to give a team.”\nSanders came to the Bills last offseason on a one-year contract and became a reliable target for quarterback Josh Allen.",
    "He spoke highly of Allen, saying he is high on the list of quarterbacks he’s played with during his career — a strong list that includes Drew Brees, Peyton Manning and Ben Roethlisberger.",
    "The Pro Bowl receiver said it was hard for him to decide, saying he only wanted to play another year if his heart was fully in it and otherwise hinting that he’s ready to retire.",
    "He made 42 receptions for 626 yards and four touchdowns, and scored his first-career playoff touchdown in a 47-17 win over the New England Patriots in the Wild Card round.",
    "The 35-year-old receiver hinted during the last season that it could be his last in the league, and it appears he is still mulling over what to do next.",
    "Sanders had hinted about retirement during the 2021 season, saying his goal was to win one more Super Bowl before calling it a career.",
    "“I played with so many great quarterbacks, and this guy right here, he always pops up in the front of my mind,” Sanders said.",
    "The Bills also brought back some of their free-agent receivers from last season, re-signing Isaiah McKenzie and Jake Kumerow.",
    "The veteran wide receiver spoke this week about his past season with the Buffalo Bills and his uncertain future in the NFL.",
    "Sanders Talks Future\nSanders served as a co-host of “Good Morning Football” on Monday, talking about his future in the NFL.",
    "The team parted ways with Cole Beasley while bringing in former New York Jets receiver Jamison Crowder.",
    "“It’s tough because, for me, I just want to make sure that I’m passionate,” Sanders said.",
    "— Matthew Bové (@Matt_Bove) September 23, 2021\n“I don’t care about stats.",
    "I’m still working out but I’m trying to figure out if I want to do it.",
    "I don’t want to just jump into something and chase after some money.",
    "Emmanuel Sanders is still unsure what his football future holds.",
    "“I don’t want to cheat myself and I don’t want to cheat a team.",
    "And then, I’m just gonna chuck my two fingers up.",
    "… I just wanna win,” he said back in September.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "So, I’m just trying to figure it out.",
    "What have I not done in this league?",
    "Get to the Super Bowl, win.",
    "“Get in the playoffs, win.",
    "I’ve done it all, dude.",
    "“He’s just so dynamic.",
    "Man, I’m gone."
  ]
}