{
  "id": 1665,
  "mediaId": 2586,
  "date": "2022-04-03",
  "headline": "Bills Release Fan-Favorite Running Back After 3 Seasons",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Christian-Wade-e1649027782705.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-release-rb-christian-wade/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The Bills can bring 91 players to camp (with Wade as the exemption), unless of course the NFL reduces the roster limits like they did last year due to Covid.”\nBut Wade suffered a shoulder injury that kept him out of the 2021 season, and the team released him this week.",
    "There were some things that went down with the other organization, which is painful, but they chose to do what they did, and I couldn’t stop it.”\nIt's ON SIGHT next time #Bills Brandon Beane is in Washington #Commanders territory ??",
    "“So, Bills RB Christian Wade now once again has an exemption on the roster and the practice squad, basically in the exact situation he’s been the last two years…Wade can still make the team,” Capaccio reported in March 2021.",
    "Wade, a converted rugby star from England, had been allocated to the Bills in 2019 as part of the NFL’s International Pathway Program, which created special exemptions for foreign players trying to make it into the league.",
    "Wade remained on the Bills’ practice squad for two seasons — unable to be pulled up to the active roster through the 2019 and 2020 seasons — but gained an extra year when the league expanded the program last year.",
    "Wade Gained Extra Year With Bills\nIn the International Pathway Program, players received a two-year exemption that allowed them to be added to a team’s practice squad without having to count against the limit.",
    "Bills head coach Sean McDermott said he wants to see quarterback Josh Allen running the ball less in the upcoming season, staying in the relative safety of the pocket.",
    "pic.twitter.com/oPuXUqqtru\n— Buffalo Fanatics (@BfloFanatics) March 18, 2022\nThere could be at least one other significant change in Buffalo’s running game in 2022.",
    "Obviously, he was a guy we targeted and, in this business, in general, when you have an agreement, it’s good,” Beane said, via ESPN’s Alaina Getzenburg.",
    "They signed veteran running back Duke Johnson, who last season played for the Dolphins and had 330 yards on 71 carries with three touchdowns.",
    "Bills general manager Brandon Beane expressed some frustration that the Commanders kept working on McKissic after he picked the Bills.",
    "Wade drew some big attention for his play in preseason games, but never made it off the practice squad during his time with the Bills.",
    "— Bradley Gelber (@BradleyGelber) April 1, 2022\nWade had made quite an impression on Bills fans in the 2019 preseason.",
    "Bills Could Boost Running Back Position\nThe Bills have already made some moves to boost the backfield this offseason.",
    "As WGR 550’s Sal Capaccio noted, Wade was given the opportunity to compete for a roster spot at no cost to the Bills.",
    "Christian Wade managed to capture the hearts of Buffalo Bills fans without ever playing in a regular-season game.",
    "McKissic, coming to an agreement on a deal before he changed his mind to return to the Washington Commanders.",
    "On his first NFL snap, Wade took a handoff and scampered 65 yards for a touchdown.",
    "The Bills released the running back on April 1 after three seasons with the team.",
    "Christian Wade runs the ball in a preseason game against the Minnesota Vikings.",
    "“But until there’s ink on the paper, and his agent did a great job.",
    "Now, the British speedster will be on to his next adventure.",
    "Doug Hendrickson and CJ LaBoy did a great job.",
    "The Bills also tried to add the versatile J.D.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "McKissic deal fell through.",
    "Talking about how the J.D.",
    "“That was tough."
  ]
}