{
  "id": 1713,
  "mediaId": 2523,
  "date": "2022-04-06",
  "headline": "1 Free Agent Still on the Market Who Can Help Each NFL Team in 2022",
  "image": "https://img.bleacherreport.net/img/images/photos/003/921/170/hi-res-fac49595f33935bc37186f013af912d6_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2954907-1-free-agent-still-on-the-market-who-can-help-each-nfl-team-in-2022",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Kenyon",
  "authorUrl": "https://bleacherreport.com/users/d3daab38-0fba-447f-b10e-c380908ef4e6",
  "termIds": [
    0
  ],
  "sentences": [
    "Green Bay Packers: Will Fuller V, WR\n\"If you look at our roster right now, we definitely need to get some speed in that room,\" Green Bay Packers coach Matt LaFleur said recently, per Matt Schneidman of The Athletic.",
    "Longtime tight end Jack Doyle retired this offseason, and the Colts—particularly after the win-now trade for Matt Ryan—might not be satisfied with Mo Alie-Cox and Kylen Granson atop the depth chart at the position.",
    "Philadelphia Eagles: Anthony Barr, LB\nAfter spending the first eight seasons of his NFL career on the Vikings, Anthony Barr is probably headed elsewhere, as Minnesota is unlikely to re-sign the veteran linebacker.",
    "Potential starters like defensive end Jadeveon Clowney, cornerback Stephon Gilmore and safety Tyrann Mathieu—who recently said it'll \"be a while\" before he signs a contract—are among the unsigned players.",
    "And the Bucs unquestionably would like him back, considering he's totaled 100 receptions for 1,425 yards and 13 touchdowns while providing good value as a blocker in two seasons on the team.",
    "They shipped Noah Fant to the Seattle Seahawks in the Russell Wilson trade, which creates an opportunity for Rudolph to earn regular snaps and catch passes from a top-tier quarterback.",
    "Hilton, though, can provide a much-needed veteran presence to a receiving corps currently headlined by Olamide Zaccheaus, Tajae Sharpe and Auden Tate beyond flex tight end Kyle Pitts.",
    "Cook is clearly comfortable with short-term agreements, and Indianapolis would benefit from his 500-yard potential and the opportunity to develop Granson at a lower-pressure pace.",
    "Teams may prefer a rookie for certain vacancies, while low- and mid-tier players may be patient to wait until the draft ends to reassess the best opportunities for regular snaps.",
    "Buffalo Bills: Chris Harris Jr., CB\nUnder the assumption the Buffalo Bills can't create space for Stephon Gilmore, they'll need to find a different option at the position.",
    "Pittsburgh Steelers: J.C. Tretter, C\nOne of the league's more surprising cap casualties, J.C. Tretter returns to the market after a respectable five-year run in Cleveland.",
    "Rudolph played only 48 percent of offensive snaps with the New York Giants last season, dropping from his previous career-low mark of 72 percent on the Minnesota Vikings.",
    "However, the Jags could add Paradis and protect the ability to use Shatley's versatility in case a rookie underperforms or the oft-injured Brandon Scherff misses time.",
    "New Orleans Saints: Damontae Kazee, S\nThis may initially sound like a criticism, but stay with me: New Orleans has a bunch of mix-and-match pieces in the secondary.",
    "While he managed just five interceptions and 21 total pass defenses along the way, Edmunds—who will be 25 years old next season—is theoretically entering his prime.",
    "Philadelphia's defensive coordinator is Jonathan Gannon, who installed a similar scheme to the one Minnesota used in his four seasons (2014-17) as an assistant.",
    "Brady Christensen gives them flexibility and reduces the outright need, but he might be a better fit at guard to keep Bozeman—also a versatile piece—at center.",
    "Not only is the club interested in re-signing him, per John Gambadoro of Arizona Sports 98.7 FM, but Green also hasn't received much interest from other teams.",
    "As the Chargers aim to capitalize on the salary-cap flexibility Justin Herbert's rookie deal provides, they should be stacking the roster as much as possible.",
    "New York Jets: Star Lotulelei, DT\nLike his former teammate Daryl Williams, Star Lotulelei went to free agency as a result of Buffalo's cost-cutting moves.",
    "Indianapolis Colts: Jared Cook, TE\nIn what feels like an annual tradition, Jared Cook is again a free agent likely en route to a comfortable landing spot.",
    "Dallas Cowboys: Trai Turner, OG\nDuring the 2014 NFL draft, the Dallas Cowboys planned to select Trai Turner had they not traded up for Demarcus Lawrence.",
    "He's played all 13 NFL seasons with Cincinnati and is a candidate to return, but he's posted a top-10 net punting average in two of the past three years.",
    "New York Giants: Terrell Edmunds, S\nSimilar to Detroit, this is a home-run swing predicated on the reality of the New York Giants' below-average roster.",
    "New England Patriots: Ereck Flowers, OG\nOnce considered a first-round bust, Ereck Flowers has reshaped that perception since shifting inside in 2019.",
    "He played eight of his nine seasons on the New Orleans Saints alongside punter Thomas Morstead, who split 2021 between the New York Jets and Falcons.",
    "Las Vegas Raiders: Daryl Williams, OL\nOne of several cap casualties on the market, Daryl Williams is basically only available for financial reasons.",
    "Kansas City Chiefs: Jerry Hughes, Edge\nAmong the litany of the Kansas City Chiefs' defensive concerns, upgrading the pass-rush group is a major one.",
    "Barr's learning curve would be much simpler, and the Eagles plucked two former Vikings—Anthony Harris and Eric Wilson—out of free agency last year.",
    "Michael Onwenu will probably replace one of them, but Flowers could snag the other spot ahead of James Ferentz or 2021 sixth-rounder Will Sherman.",
    "Jacksonville Jaguars: Matt Paradis, C\nGiven the injury struggles Brandon Linder faced in eight NFL seasons, his retirement was hardly a surprise.",
    "Clowney's main strength is defending the run, but placing him opposite Myles Garrett seems to have unlocked his much-desired pass-rushing upside.",
    "Green's familiarity with Kyler Murray is a real positive, especially as Arizona tweaks the receiving corps following Christian Kirk's departure.",
    "Las Vegas re-signed both Brandon Parker and Jermaine Eluemunor, but Parker struggled last season and Eluemunor only played 28 percent of snaps.",
    "Otherwise, the Seahawks could be down to replacement-level tackles—and entering 2022 in that condition doesn't agree with what they're saying.",
    "Minnesota Vikings: Dennis Kelly, OT\nAs the roster stands, depth is not exactly an area of strength for the Minnesota Vikings' offensive line.",
    "He notched 16.5 sacks in his first three seasons, but groin and Achilles injuries held McKinley to 15 combined appearances in 2020 and 2021.",
    "Solidifying the offensive line for the next quarterback—whether it's Davis Mills or someone drafted in 2022 or 2023—must be a high priority.",
    "Detroit Lions: Takkarist McKinley, Edge\nConsidering the likelihood of another losing year, the Detroit Lions should take a swing on upside.",
    "According to Jeff Zrebiec of The Athletic, head coach John Harbaugh said general manager Eric DeCosta and Campbell are \"talking regularly.\"",
    "If the Steelers sign him, they'd also have the option to shift 2021 third-rounder Kendrick Green from center to his natural guard position.",
    "Brandon Aiyuk caught 56 passes for 826 yards last season, giving the Niners a superb third option after Samuel and tight end George Kittle.",
    "Miami has once again engaged in an offseason spending spree, and it could reunite new left tackle Terron Armstead with an old teammate.",
    "That's especially valuable as the Raiders try to figure out which of those positions 2021 first-rounder Alex Leatherwood should hold.",
    "Kazee missed the majority of the 2020 campaign with an Achilles injury, but he returned to start 15 games for the Cowboys last year.",
    "Rob Gronkowski hasn't made a decision about the 2022 season, but he told JC Cornell of The Draft Network that it's Tampa or nowhere.",
    "Chicago won't be a fantastic team next season, but 2022 certainly isn't a throwaway season like it might be in Atlanta, for example.",
    "They swiped Lucas Patrick from the rival Green Bay Packers and could snag former Cincinnati Bengals starter Quinton Spain, as well.",
    "Although they have a couple of in-house options to consider, they've been relatively quiet in free agency and could use a veteran.",
    "Denver Broncos: Kyle Rudolph, TE\nEntering his age-33 season, Kyle Rudolph is approaching the twilight of a successful NFL career.",
    "If that happens, there's less need for a one-year veteran option like Ryan Fitzpatrick to serve as Sam Darnold's backup in 2022.",
    "Given the recent struggles of Pitt's O-line, Tretter would also mark welcome return to devoting resources to the blocking corps.",
    "The cornerback is only approaching his age-26 season, and a run of good health could provide the spark for a career turnaround.",
    "Billy Price hasn't matched the expectations of his first-round billing in 2018, but he's started at both center and left guard.",
    "Houston's greatest need along the offensive line is the interior, and Price is worth a gamble for this reconstructing roster.",
    "After picking off 17 passes in four seasons at San Diego State, he's snatched 12 interceptions in basically four NFL seasons.",
    "Fifth-year coordinator Steve Spagnuolo is known for his aggressive blitz packages, and the Chiefs create plenty of pressure.",
    "This offseason, left guard Connor Williams left for the Miami Dolphins, and the Cowboys released right tackle La'el Collins.",
    "However, the former All-Pro would be a wise addition for a secondary that knows White's return will bolster the unit anyway.",
    "Seattle Seahawks: Eric Fisher, OT\nPlan A for Seattle is re-signing left tackle Duane Brown and right tackle Brandon Shell.",
    "But he's a zone-busting wideout who can take advantage of soft coverage as defenses respect Tennessee's star receiver A.J.",
    "But if the Virginia Tech product continues to develop in coverage as he did in 2021, the Giants could be landing a steal.",
    "The entire point of this offseason is to start building around Justin Fields while not sacrificing long-term flexibility.",
    "The good news is Minnesota has both starting tackles with Christian Darrisaw on the left and Brian O'Neill opposite him.",
    "Fans of the Los Angeles Rams likely already do, thanks to fake-punt legend Johnny Hekker and his 14 career completions.",
    "The bad news is current backup options Blake Brandel and Timon Parris have combined for 71 snaps in their NFL careers.",
    "Health issues have derailed the once-promising career ofTakkarist McKinley, a first-round pick of the Falcons in 2017.",
    "He'd give Dallas—which should be eyeing offensive linemen in the 2022 draft—a steady blocker on a short-term contract.",
    "Fuller would provide the much-needed downfield element for Aaron Rodgers in his pursuit of a second Super Bowl title.",
    "But the Atlanta Falcons—fresh off an exorbitant dead-money trade of Matt Ryan to Indy—don't need a superstar wideout.",
    "J.C. Tretter is the flashy name, but he's probably out of the Jags' price range following their free-agency splurge.",
    "Tretter, 31, would immediately bolster the interior of the offensive line as the post-Ben Roethlisberger era begins.",
    "However, the now-Commanders released him for financial reasons, and the Patriots don't have a second starting guard.",
    "Washington has a collection of unproven depth pieces, too, so aiming for King's low-risk upside is a sound strategy.",
    "According to Nate Ulrich of the Akron Beacon Journal, Clowney's agent said there is \"mutual interest\" in a reunion.",
    "Spain should be a relatively inexpensive piece, and his strength—run blocking—is a key area for Chicago to upgrade.",
    "Projected for nearly $16 million of cap space post-draft, the Bengals have the ability to make an appealing offer.",
    "Right or wrong, the Bears seem headed for the campaign with Teven Jenkins and Larry Borum as the starting tackles.",
    "After reaching Super Bowl LVI, the Bengals have attacked their greatest need and overhauled the offensive line.",
    "Tennessee Titans: Cole Beasley, WR\nTennessee needs a stronger group of receivers but has little money to spend.",
    "Carolina has clearly put an emphasis on upgrading the line, acquiring both Bradley Bozeman and Austin Corbett.",
    "Kevin King simply didn't work out in Green Bay, making 51 appearances over an injury-plagued five-season run.",
    "Cole's consistent availability is a real positive, too, considering he's only missed two games along the way.",
    "But the Los Angeles Chargers are likely on the hunt for a right tackle as a possible upgrade to Storm Norton.",
    "During each of the past four seasons—one with Dallas and three in Buffalo—he's reeled in 65-plus receptions.",
    "Calais Campbell spent the past two seasons with the Baltimore Ravens, and they are hoping to bring him back.",
    "Though fully deserved, it will limit the Bengals' opportunities for taking a swing at the best free agents.",
    "The 2022 season will be spent identifying players with legitimate long-term potential for the organization.",
    "And while Kyle Juszczyk has an important role by design, it's not ideal that a fullback is the next target.",
    "Reed and potentially the bookends of the offensive line, the Seahawks have played down the \"rebuild\" label.",
    "But the veteran can help prevent a precipitous drop, especially if the Chiefs don't re-sign Melvin Ingram.",
    "But the Arizona Cardinals need a couple of wideouts, and Green should be a comfortable, short-term option.",
    "But as the draft approaches, each franchise has an intriguing fit to address a current need on the roster.",
    "Following the initial burst of signings around the NFL, the 2022 free-agent market has slowed to a crawl.",
    "Unfortunately for the Boise State product, a torn left ACL abruptly ended his 2021 campaign in November.",
    "The Pittsburgh Steelers have the money available to make their AFC North rivals metaphorically pay, too.",
    "The 36-year-old Morstead ranked seventh in the league with a 42.0-yard net punting average last season.",
    "Cook has played on six teams throughout his 13-year career, most recently for the Los Angeles Chargers.",
    "Carolina Panthers: Duane Brown, LT\nRight now, the Carolina Panthers are in a bit of a holding pattern.",
    "It seems hopeful to consider either one a locked-in starter, even as they're staying with the Raiders.",
    "However, the San Francisco 49ers need to avoid structuring an offense that requires he do everything.",
    "Kelly served as the Titans' right tackle in 2020 and a valuable reserve for the Packers last season.",
    "Arizona can do much worse than bringing back someone who caught 54 passes for 848 yards last season.",
    "Before that, though, he caught 53 passes for 879 yards and eight touchdowns on the Houston Texans.",
    "While that campaign ended with a PED suspension, it doesn't need to be a career-defining negative.",
    "Detroit can patiently wait for his return and hope for a late-season jolt to the pass-rush group.",
    "Jadeveon Clowney posted nine sacks in 2021, his first season as a member of the Cleveland Browns.",
    "Once Tom Brady's monthlong retirement ended, attention soon shifted to his longtime pass-catcher.",
    "That could happen, but the appeal of playing for a contender may sway Brown and Shell elsewhere.",
    "Ted Karras signed with Cincinnati, and New England dealt Shaq Mason to the Tampa Bay Buccaneers.",
    "While not a flashy addition, Lotulelei would reduce the Jets' need for drafting a top D-tackle.",
    "Instead, they could focus on upgrades at wide receiver, edge-rusher, cornerback and linebacker.",
    "Miami Dolphins: Thomas Morstead, P\nYou might not be excited to read about two punters in a row.",
    "Jarvis Landry and Emmanuel Sanders may be too expensive, and the Julio Jones experiment failed.",
    "Last season, Hilton recorded career-low marks of 23 receptions, 331 yards and three touchdowns.",
    "That production isn't eye-popping, but it would be a welcome sight for the Indianapolis Colts.",
    "He played 10 games with Green Bay, logging 47 percent of offensive snaps in those appearances.",
    "Los Angeles Chargers: Brandon Shell, OT\nHow about another right tackle for an AFC West squad?",
    "Though inconsistent, MVS tallied 17.5 yards per grab on his 123 receptions over four seasons.",
    "Since his peak in the mid-2010s, the four-time Pro Bowler has slipped off the national radar.",
    "Tre'Davious White is recovering from an ACL injury and might not return until November or so.",
    "But as the AFC loads up on quarterbacks, Cincinnati has extra reason to bolster the defense.",
    "Lotulelei is an eight-year veteran who'd started nearly every game of his career until 2021.",
    "Health is the main concern for Barr, considering he played two games in 2020 and 11 in 2021.",
    "He's averaged 37.4 receptions and 538.2 yards across five seasons with the Jaguars and Jets.",
    "Pending his Achilles recovery timeline, McKinley may start 2022 on the injured list anyway.",
    "Still, he leaves a major vacancy in the middle of the Jacksonville Jaguars' offensive line.",
    "LaFleur made that comment after Marquez Valdes-Scantling headed to the Kansas City Chiefs.",
    "Baltimore Ravens: Calais Campbell, DL\nThe fit is obvious, and recent comments are helping.",
    "The 14-year veteran would be a useful piece for a defensive line in need of greater depth.",
    "Marcus Maye is probably best suited as a box defender, though he could be the free safety.",
    "As his memorable decade-long tenure comes to a close, though, the Rams need a replacement.",
    "While a return to Seattle shouldn't be ruled out, Brandon Shell is exploring his options.",
    "San Francisco 49ers: Keelan Cole, WR\nDeebo Samuel can do darn-near anything on the field.",
    "However, the Rams and Dolphins have a combined zero punters on their respective rosters.",
    "Considering his recent performance, Rudolph could be a low-risk bargain for the Broncos.",
    "Last season with the Dolphins, a broken thumb sidelined him for nearly the entire year.",
    "Chicago Bears: Quinton Spain, OG\nSigning an offensive lineman is rarely a flashy move.",
    "Jerry Hughes, who will be 34 next season, will not suddenly change that trend himself.",
    "But at the right price, he'd be a knowledgeable voice who can offer steady production.",
    "Washington Commanders: Kevin King, CB\nYou never know what a change of scenery can do.",
    "And with the most projected cap space in the league, Carolina can afford Duane Brown.",
    "Campbell is past his prime, sure, but he could contribute at either D-end or tackle.",
    "That's never been Beasley's game as a short and intermediate target out of the slot.",
    "He notched 17 tackles with three sacks in 11 appearances for the Bills last season.",
    "The former All-Pro struggled in 2021 when an injured DeAndre Hopkins missed time.",
    "Jacksonville re-signed Tyler Shatley and may turn to him as Linder's replacement.",
    "The South Carolina product registered 37 tackles and generated 22 pressures, too.",
    "Shell, who's started 58 games in the past five seasons, would certainly be that.",
    "He visited the Broncos before Denver ultimately went with Billy Turner instead.",
    "He started 61 of 65 games for the Seattle Seahawks over the past four seasons.",
    "And the 2022 campaign might be his final chance for a true bounce-back year.",
    "Since 2019, he's managed just 93 catches for 958 yards and eight touchdowns.",
    "Terrell Edmunds registered 340 tackles as a four-year starter in Pittsburgh.",
    "Williams is mostly a safety, but the veteran can slide to corner in a pinch.",
    "Despite sending Russell Wilson to Denver, cutting Bobby Wagner, losing D.J.",
    "Chauncey Gardner-Johnson has the versatility to play cornerback or safety.",
    "The hugely successful signing of Rasul Douglas signaled the end for King.",
    "Turner, a five-time Pro Bowl guard, can immediately slot in as a starter.",
    "In seriousness, how many foundational pieces do the Texans actually have?",
    "Matt Paradis, on the other hand, might be looking for a prove-it deal.",
    "Perhaps the Ravens are just waiting on him to return from Egypt first.",
    "For fans of the Chicago Bears, though, it should be a welcomed sight.",
    "He reeled in 48 passes for 564 yards and four touchdowns last season.",
    "In the not-too-distant future, Joe Burrow will sign a huge extension.",
    "Damontae Kazee is the ball-hawking complement to that utility group.",
    "He specifically played well for Washington that season and in 2021.",
    "And, yes, wideout Odell Beckham Jr. is the obvious name otherwise.",
    "He occasionally had decent games, then would be a major liability.",
    "Run down the options, and perhaps the Titans land on Cole Beasley.",
    "Los Angeles Rams: Kevin Huber, P\nRespect your specialists, folks.",
    "Moving forward, the Utah product can be a solid rotational piece.",
    "Cleveland Browns: Jadeveon Clowney, DE\nWhy break up a good thing?",
    "Right now, the looming 2022 NFL draft presents a timing obstacle.",
    "Gilmore would immediately become the team's top cornerback, too.",
    "\"We need a legit guy that can take off the top of the coverage.\"",
    "Last year, Kansas City ranked 29th in the league with 31 sacks.",
    "Hilton, WR\nIf he doesn't return to the Indianapolis Colts, T.Y.",
    "Outside of the draft, the best available option is Kevin Huber.",
    "However, it's not because the remaining group is unimpressive.",
    "Injuries limited him to 10 appearances in both 2019 and 2021.",
    "Levi Wallace left for the Pittsburgh Steelers in free agency.",
    "This is basically a make-or-break season for Rudolph's value.",
    "Hughes has averaged 4.5 sacks and 26.8 pressures since 2019.",
    "And the Bills' loss could be the Las Vegas Raiders' gain.",
    "One way or another, the Bills will be adding a cover man.",
    "Green, WR\nThe proverbial ship has probably sailed on A.J.",
    "Will Fuller V has similar upside with a stronger resume.",
    "In short: All 32 teams are still exploring free agency.",
    "Chris Harris Jr. might be out of Buffalo's price range.",
    "Hilton might be limited to a one-year \"prove-it\" deal.",
    "He was also a six-time All-Pro for, you know, punting.",
    "Williams, meanwhile, can play either guard or tackle.",
    "Nevertheless, it's much too early to give up on King.",
    "Houston Texans: Billy Price, OL\nAnyone works, really.",
    "Cincinnati Bengals: Stephon Gilmore, CB\nGo for it.",
    "Will they target a quarterback early in the draft?",
    "Tampa Bay Buccaneers: Rob Gronkowski, TE\nCheating?",
    "Fisher would be a step in the opposite direction.",
    "Yeah, the Vikings need someone like Dennis Kelly.",
    "Still, the Panthers could use a true left tackle.",
    "They're heading toward a tough 2022 campaign.",
    "However, they've struggled to finish the job.",
    "3 receiver, and Keelan Cole fits the billing.",
    "On paper, they're already a stronger roster.",
    "The Denver Broncos are a wise landing spot.",
    "Edmunds has proven himself as a box safety.",
    "That's not intended to disrespect Houston.",
    "But they absolutely must add a cornerback.",
    "That, of course, is not shocking news.",
    "Why not reunite with a familiar coach?",
    "San Francisco needs an impactful No.",
    "Now, he's not an explosive player.",
    "So, strengthen the interior spots.",
    "Keep the band together, Cleveland.",
    "How about a full-circle signing?",
    "Green as a team's top receiver.",
    "Let's assume a first-round QB.",
    "Plan B should be Eric Fisher.",
    "Go for it now, Cincinnati.",
    "Arizona Cardinals: A.J.",
    "Atlanta Falcons: T.Y.",
    "B/R Recommends",
    "For the Brand!",
    "Easy enough!",
    "Brown.",
    "Maybe.",
    "P.J."
  ]
}