{
  "id": 1727,
  "mediaId": 2712,
  "date": "2022-04-02",
  "headline": "Patrick Gilham arrest for Roxanne Wood murder – Inside how STUDENTS used Post-it notes and cigarette clue to find killer",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2022/04/CW-ROXANNE-WOOD-COLD-CASE-COMP.jpg?strip=all&quality=100&w=1500&h=1000&crop=1",
  "link": "https://www.thesun.co.uk/news/18142987/patrick-gilham-arrest-roxanne-wood-murder-cigarette-find-killer/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josephine Fuller",
  "authorUrl": "https://www.thesun.co.uk/author/josephine-fullerthesun-com/",
  "termIds": [
    2241,
    4511,
    416,
    1231,
    5145,
    5196
  ],
  "sentences": [
    "Most read in US News\nBRUTAL DEATH\nSuspect 'accused of telling Gaal's husband 'your whole family is next'\nJUSTICE DONE\nMurder of girl, 9, solved by teen who tracked down suspect 59 years later\nSHOOTING AT RANDOM\nSchool shooter found dead as weapons arsenal uncovered after gun rampage\n'CUFFED WITH NO SHOES ON'\nSon, 13, was 'dragged through police station' after mom killed\nAfter Gilham was identified as a suspect, he was \"surveilled extensively\" by undercover state police troopers and interviewed twice.",
    "Roxanne Wood (pictured) was 30 when she was murdered in her Michigan homeCredit: Copyright/WDNU 16 News\nPolice said her throat was slashed after someone got inside on February 20, 1987Credit: Copyright/WDNU 16 News\nPatrick Gilham, 67, pleaded no contest in March to second degree murder in her deathCredit: Copyright/Michigan State Police\nGilham, 67, was also formally accused in February of breaking and entering of an occupied dwelling, WNDU reported.",
    "Read more on cold cases\nBRINGING THEM HOME\nInside group of scuba-diving sleuths who cracked 7 cases in 2 months\nDESERT SAGA\nHow 'Little Miss Nobody' case was cracked by lab 60yrs after girl's body found\nThe case remained an active investigation for decades, police said, and it was reexamined in 2001 and 2020 by investigators from Michigan State Police.",
    "Identifiers International said in a statement that the case was a \"landmark in the use of forensic genetic genealogy (FGG) as the decades-old DNA sample used to identify Roxanne’s assailant was very low level and highly degraded, representing the contents of only a few cells of his body.\"",
    "Read More on The US Sun\nPUNCH LINE\nWill Smith RESIGNS from the Academy after slapping Chris Rock at Oscars\nTAKE A LOOK\nWhat you see first in this optical illusion reveals if you are looking for love\n\"But it shows that we should never give up hope,” Fitzpatrick said.",
    "Evidence from the scene was examined forensically using genetic genealogy by Identifinders International LLC and the MSP Forensic Laboratory in Grand Rapids, according to a police statement.",
    "Police then used DNA from the cigarette to confirm that DNA found at the crime scene belonged to Gilham, Michigan State Police Detective First Lt. Charles Christensen told NBC News.",
    "\"We are grateful to the Michigan State Police for having faith in us for the careful decision making it took to process the DNA and solve the case.”\nWe pay for your stories!",
    "A MAN will spend decades in prison in a 1987 cold case as it's been revealed college students used Post-it notes and a cigarette to help find the killer.",
    "Students in Western Michigan University's Cold Case Program ultimately helped those detectives find Gilham on their first case working together.",
    "Police said the students played a key organizational role in sifting through the 3,000-page case file and throwing out ideas with investigators.",
    "In late March, Gilham pleaded no contest to second-degree murder and agreed to a minimum sentence of 23 years in prison.",
    "The charges stem from February 20, 1987, when Terry Wood found his wife dead in their Niles Township, Michigan home.",
    "The students collected and sorted piles of evidence, including digitized Post-it notes and unlimited case files.",
    "Patrick Wayne Gilham was arrested and charged with second-degree murder decades after the death of Roxanne Wood.",
    "The organization's president, Colleen Fitzpatrick, said it was the toughest technical challenge they'd faced.",
    "Like us on Facebook at www.facebook.com/TheSunUS and follow us from our main Twitter account at @TheSunUS",
    "Gilham was arrested in February, just days from the 35th anniversary of the killing.",
    "They had driven separately to go bowling and Roxanne Wood, 30, returned home first.",
    "During this time, he discarded a cigarette that detectives collected.",
    "Email us at exclusive@the-sun.com or call 212 416 4552.",
    "Police say her husband found her with throat cut.",
    "Do you have a story for The US Sun team?",
    "Sentencing is set for April 25."
  ]
}