{
  "id": 1754,
  "mediaId": 2732,
  "date": "2022-04-04",
  "headline": "BetMGM Golf: Masters 2022 Picks: 5 Favorites to Target at Augusta National",
  "image": "",
  "link": "https://triblive.com/news/partner-news/betmgm-golf-masters-2022-picks-5-favorites-to-target-at-augusta-national-2/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Content Partner",
  "authorUrl": "https://triblive.com/author/content-partner/",
  "termIds": [
    1313,
    1986,
    2086,
    2124,
    2472,
    3936,
    97,
    123,
    595
  ],
  "sentences": [
    "2022 Masters Favorites Odds\nPLAYER ODDS\nJon Rahm +1000\nCollin Morikawa +1200\nCameron Smith +1400\nDustin Johnson +1400\nJordan Spieth +1400\nJustin Thomas +1400\nRory McIlroy +1400\nScottie Scheffler +1600\nBrooks Koepka +1800\nPatrick Cantlay +1800\nViktor Hovland +1800\nXander Schauffele +2200\nBryson DeChambeau +2500\nHideki Matsuyama +2800\nWill Zalatoris +3300\nDaniel Berger +4000\nLouis Oosthuizen +4000\nSam Burns +4000\nJoaquin Niemann +4000\nAdam Scott +5000\nCorey Conners +5000\nMatt Fitzpatrick +5000\nPatrick Reed +5000\nPaul Casey +5000\nShane Lowry +5000\nSungae Im +5000\nJon Rahm Odds to Win Masters: +1000\nRahm is no longer the No.",
    "Will Zalatoris Odds to Win Masters: +3300\nZalatoris was runner-up to Hideki Matsuyama last season in his tournament debut, so now that he has that experience under his belt, it’s likely he will be a real threat once again.",
    "There’s odds to win Masters, Masters prop bets (including for Tiger Woods specifically), and then once the action starts like live Masters odds that will change quite a bit over the four days.",
    "He also has published a golf book, “The Ultimate Book of Golf Trivia: 600 Questions and Answers.” Twitter: @RYANHANNABLE\nThis has been a paid article submitted by our content partner.",
    "His weakness has always been his putter, but he recently underwent some changes with his stroke, and he looked much better his last time out at the WGC-Dell Technologies Match Play.",
    "It’s almost time for the 2022 Masters, which means it’s definitely time to start looking into Masters golf odds and mapping out a plan for golf betting with the tournament.",
    "More often than not, the winner generally is one of the best players in the field and a player with relatively low golf odds to win.",
    "With that in mind, here’s a list of players with the 20 shortest odds and five who are worth taking a good look at.",
    "He also hasn’t won a tournament since the 2021 Players Championship, so why not snap the winless streak at Augusta?",
    "Justin Thomas Odds to Win Masters: +1400\nAt some point, Thomas is going to win the Masters, so why not this year?",
    "Thomas was tied for 25th last year, but that was due to a poor weekend, shooting 75 on Saturday and 73 on Sunday.",
    "The 25-year-old hasn’t yet won on the PGA Tour and is considered by some as the best player who has yet to win.",
    "Corey Conners Odds to Win Masters: +5000\nConners is one of the best under-the-radar players on the PGA Tour.",
    "Sign up today with Promo Code TRIB1000 and receive a Risk Free Bet up to $1000 when you sign up with BetMGM.",
    "Scheffler is the hottest player in the game right now and has a decent track record at Augusta National.",
    "1 ranked player in the world right now and a player who has won three times in his last five starts?",
    "1 ranked player in the world, so there may be some extra incentive to play well for the 27-year-old.",
    "Along those same lines, he hasn’t won a tournament on the PGA Tour since the U.S. Open last year.",
    "He has five straight top-25 finishes and has made the cut all six times he’s played in the event.",
    "He’s played very well at Augusta National of late, as he has four straight top-10 finishes.",
    "Scheffler has only played in the Masters twice, but both times he finished in the top 20.",
    "Rahm has played 20 total competitive rounds at the course and has 12 under-par scores.",
    "Thomas has the overall game that it takes to win; just look at his recent appearances.",
    "When looking at players to bet for the Masters, it’s not like most other tournaments.",
    "Conners has consecutive top-10s, including four rounds in the 60s the last two years.",
    "His ball-striking is outstanding, which is what you need to win at Augusta National.",
    "Scottie Scheffler Odds to Win Masters: +1600\nHow can you not consider the No.",
    "Previously, he was a New England Patriots beat writer for WEEI in Boston.",
    "Ryan Hannable is a copy editor on the Web Content Team for BetMGM.",
    "He also has some good history at the tournament to fall back on.",
    "It’s a great tournament to bet with plenty of options.",
    "Categories: BetMGM | Partner News | Sports Betting",
    "Bet now on The Masters with BetMGM."
  ]
}