{
  "id": 1791,
  "mediaId": 2586,
  "date": "2022-04-09",
  "headline": "Dwayne Haskins at Workout Organized by Former Bills QB Before His Death",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Dwayne-Haskins-e1649518020533.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/dwyane-haskins-workout-bills-qb/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "#Steelers players spotted in Boca Raton at Trubisky practice:\nMitch Trubisky\nPat Freiermuth\nNajee Harris\nChase Claypool\nKendrick Green\nAnthony Miller\nSteven Sims\nDwayne Haskins\nGunner Olszewski\nCody White\nBenny Snell Jr.\nZach Gentry\n— SteelerNation (@SteeIerNation) April 9, 2022\nHaskins Had Made Impression on Steelers\nAfter being taken with the No.",
    "“He does a good job of communicating with coaches, with players, gaining an understanding of what we’re trying to do schematically and his role in it, gaining a rapport with the receivers specifically, trying to do the things that we want him to do in the drill work that we do.",
    "“Haskins would have turned 25 years old on May 3.”\nDwayne Haskins, a standout at Ohio State before becoming Washington’s first-round pick and playing in Pittsburgh, died this morning when he got hit by a car in South Florida, per his agent Cedric Saunders.",
    "Haskins Had Joined Trubisky in Florida\nAfter spending one season with the Bills, Trubisky signed with the Steelers in March and quickly got to work with his teammates, inviting a group to his home in Florida to practice and train together.",
    "“Dwayne Haskins, a standout at Ohio State before struggling to catch on with Washington and Pittsburgh in the NFL, died this morning when he got hit by a car in South Florida, per his agent Cedric Saunders,” Schefter tweeted.",
    "Trubisky was seizing the chance to move out of Josh Allen’s shadow and take on a leadership role, and NFL Network’s Aditi Kinkhabwala reported on April 5 that he brought along a number of Steelers players with him.",
    "pic.twitter.com/CTen4TJKgV\n— steelers_convo (@steelers_convo) April 8, 2022\nSteelerNation tweeted on April 8 that a dozen players had been seen working out with Trubisky in Boca Raton.",
    "Haskins, a 2019 first-round pick by the Washington Commanders, was released after a turbulent tenure with the team before being signed by the Pittsburgh Steelers in January 2021.",
    "pic.twitter.com/9kWEcEDafQ\n— ESPN (@espn) April 9, 2022\nHaskins appeared to be sticking to that vow, earning some praise from Steelers head coach Mike Tomlin for his work ethic.",
    "15 overall pick in 2019, Haskins had a rocky tenure with the Commanders that led to his release in December 2020 after he had been benched in a loss to the Carolina Panthers.",
    "He’s having the #Steelers pass-catchers and the other QBs (Mason Rudolph and Dwayne Haskins) down to his FL home this weekend to throw and hang out,” Kinkhabwala tweeted.",
    "We’ve made an emphasis that drill work is football-like, but not necessarily football, and so we have certain things that we emphasize under those circumstances.",
    "“I take full responsibility for not meeting the standards of a NFL QB & will become a better man & player because of this experience,” he tweeted, via ESPN.",
    "Dwayne Haskins, an Ohio State standout and NFL QB, died Saturday morning in a car accident in South Florida, agent Cedric Saunders told @AdamSchefter.",
    "Dwayne Haskins was in Florida attending a practice organized by former Buffalo Bills quarterback Mitch Trubisky before his death Saturday morning.",
    "After Ben Roethlisberger’s retirement this offseason, Haskins was looking to compete for a job and the chance to turn around his career.",
    "The Miami Herald later reported that Haskins had been hit by a dump truck while trying to cross Interstate 595 on foot.",
    "“He’s grown by leaps and bounds,” Tomlin said during training camp in August, via The Athletic’s Mark Kaboly.",
    "At the time, Haskins was photographed attending events that went against the league’s COVID-19 protocol.",
    "ESPN’s Adam Schefter reported that Haskins’ agent said Haskins, 24, had been hit by a car.",
    "“Remember Mitch Trubisky talking about coming into Pittsburgh and leading right away?",
    "The former Ohio State quarterback took responsibility and vowed to improve.",
    "“I’m told RB Najee Harris is going too.”\nThe boys gettin it in ????",
    "Haskins would have turned 25 years old on May 3.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "I think he’s done a nice job of that.",
    "I think a lot of guys have.”"
  ]
}