{
  "id": 1796,
  "mediaId": 2633,
  "date": "2022-04-09",
  "headline": "Suspected Killer Went to Gym After Shooting Ex-Girlfriend in NY Parking Garage: DA",
  "image": "https://media.nbcnewyork.com/2022/04/long-island-suspect.png?resize=1200%2C675&quality=85&strip=all",
  "link": "https://www.nbcnewyork.com/news/local/suspecter-killer-went-to-gym-after-shooting-ex-girlfriend-in-long-island-parking-garage-da/3638789/",
  "mediaOutlet": "nbcnewyork.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2295,
    3039,
    3152,
    3216,
    728,
    5017,
    5102,
    5172
  ],
  "sentences": [
    "\"According to the preliminary investigation, less than one hour after Hines allegedly shot Ms. Laguerre, he went to the gym,\" said District Attorney Anne Donnelly, who called her murder \"a selfish act, a calculated act and a cowardly act.\"",
    "Quay-Sean Renard Hines' arrest comes a week after he allegedly approached Amelia Laguerre from behind and discharged his firearm 10 times, Nassau County officials detailed Saturday.",
    "\"Our investigation also determined that Quay-Sean began to stalk Amelia, and he would show up unannounced at [her work] seeking to rekindle their relationship,\" Fitzpatrick said.",
    "The publicly accessible garage is adjacent to physician offices and specialty care practices, said a spokesperson for Northwell Health, where the woman was a staff member.",
    "A Long Island man has been arrested on murder charges, accused of shooting his ex-girlfriend nine times in a parking garage near where she worked as a health care worker.",
    "Hines, of Bay Shore, is being held without bail after pleading not guilty at his arraignment in First District Court in Hempstead.",
    "Hines is accused of ambushing Laguerre on March 31 in an underground parking structure in New Hyde Park around 6 p.m.",
    "According to police records, Hines does not have a history of prior arrests or domestic incidents, Fitzpatrick said.",
    "Other Northwell employees provided medical attention immediately after at the scene in an effort to save her life.",
    "Relatives and friends told investigators that Hines became increasingly violent and emotionally abusive.",
    "Stephen Fitzpatrick detailed a grim case of domestic violence that resulted in the 33-year-old's death.",
    "Hines and Laguerre were dating for nearly two years before the pair broke up in late 2021, police said.",
    "They accused him of burning clothes, damaging property, and breaking into her apartment last year.",
    "Officers arrested the 30-year-old in Merrick on his way to work the night before.",
    "Contact information for his attorney was not immediately known.",
    "Donnelly and Nassau County Detective Capt.",
    "He's scheduled back in court on Tuesday."
  ]
}