{
  "id": 1798,
  "mediaId": 2523,
  "date": "2022-04-08",
  "headline": "Re-Drafting the 2021 NFL Draft",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/512/454/08cdf9feab4fcefcebe056c880fad33e_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2955114-re-drafting-the-2021-nfl-draft",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristopher Knox",
  "authorUrl": "https://bleacherreport.com/users/6e186227-f9b2-4450-af0d-8f62243323ee",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Overall, Lawrence is living up to the hype he received as the top high school quarterback in the country and looks like a Week 1 franchise quarterback with the upside to win multiple MVPs and only injuries or an incompetent franchise will put him on a path toward failure,\" Nate Tice wrote in his predraft profile for the Bleacher Report Scouting Department.",
    "That production is comparable to what Baltimore got out of Oweh, who played 65 percent of the defensive snaps over 15 games and posted five sacks, 33 tackles, five tackles for loss and 27 QB pressures—again, though, in an injury-riddled defense.",
    "However, defense was such a liability in 2021—the Vikings ranked 28th in passing yards allowed, 24th in points allowed and 30th in total defense—that they switch gears and snatch a centerpiece for their secondary instead.",
    "Now, Williams probably wouldn't have actually had those numbers with Pittsburgh's woeful offensive line, but it's not outlandish to believe he would have been as impactful for the Steelers as Harris actually was.",
    "There was some consideration of swapping Sewell for Pro Bowl tackle Rashawn Slater here, but given the progress Sewell showed in his move to the right side—along with Decker's presence—the pick stays the same.",
    "This hypothetical redraft is based on factors like player performance, team performances, team needs, injuries and projected upside—basically everything we've learned over the past year is on the table.",
    "The Bengals reached the Super Bowl with a lackluster line, though, and they have worked to improve it through free agency this offseason—adding the likes of La'el Collins, Alex Cappa and Ted Karras.",
    "Head coach Robert Saleh and offensive coordinator Mike LaFleur worked with a similar quarterback in Jimmy Garoppolo—an athletic pocket passer and high-end game-manager—with the San Francisco 49ers.",
    "12 overall (by DAL via trade)\nThe Denver Broncos might consider going with a quarterback, but the knowledge that they can eventually go out and get Russell Wilson takes that option off the table.",
    "According to Jeff Howe of The Athletic, San Francisco may have zeroed in on Jones before pivoting to Lance during the predraft process—though it has since claimed Lance was always the choice.",
    "While he might not possess the raw upside of a player such as Jaycee Horn—who went higher in the redraft despite his own season-ending injury—his dependability would be huge for the Titans.",
    "He wasn't a major piece of the offensive game plan early, but he still finished with 60 receptions, 497 yards and seven touchdowns while helping to post a 121.1 passer rating when targeted.",
    "8 overall\nWith quarterback Ryan Fitzpatrick suffering a season-ending injury in Week 1, the Washington Commanders may wish they had taken a quarterback in the first round in 2021.",
    "1 overall\nTrevor Lawrence had an up-and-down rookie campaign for the Jacksonville Jaguars, finishing with 3,641 yards, 12 touchdowns, 17 interceptions and a 71.9 passer rating.",
    "Herbert and Slater are poised to be longtime building blocks for the Chargers offense, and there's little reason for the Chargers to deviate from that reality in a redraft.",
    "To be fair, New York got a decent rookie season out of Michael Carter, a fourth-round running back who produced 639 rushing yards, 325 receiving yards and four touchdowns.",
    "Tennessee ranked just 25th in passing yards allowed last season and surrendered 348 passing yards in a three-point playoff loss to Cincinnati despite logging nine sacks.",
    "While Horn's rookie season was cut short after only three games by a foot fracture, he came into the draft as one of the top defensive prospects and has a ton of upside.",
    "Penei Sewell struggled a little early while transitioning from left to right tackle, but he eventually proved to be an anchor opposite blindside protector Taylor Decker.",
    "Despite splitting time with starter Melvin Gordon III, Williams still finished with 903 rushing yards, 43 receptions, 316 receiving yards and seven combined touchdowns.",
    "Instead of taking Minnesota wideout Rashod Bateman—who had 515 receiving yards during an inconsistent rookie campaign—the Ravens grab some much-needed secondary depth.",
    "32 overall\nThe Ravens bolstered their pass rush with the 31st pick a year ago—a selection gained from the Kansas City Chiefs as part of the Orlando Brown Jr. trade.",
    "Choosing Pitts over a wideout like Jaylen Waddle or DeVonta Smith comes down to the fact that the Bengals already had solid perimeter targets coming into the draft.",
    "One could argue that Jacksonville showed plenty of incompetence during Lawrence's inaugural season, but that's not enough reason to not take Lawrence a second time.",
    "San Francisco 49ers (from HOU Via MIA): Trey Lance, QB, North Dakota State\nOriginal Selection: Trey Lance, QB, North Dakota State\nWhere he was actually picked: No.",
    "Lamar Jackson suffered a season-ending ankle injury Dec. 12, and the Ravens lost six straight to finish the year, including five-plus games without their star QB.",
    "New York Jets (from SEA): Najee Harris, RB, Alabama\nOriginal Selection: Christian Darrisaw, OT, Virginia Tech (by MIN via trade)\nWhere he was actually picked: No.",
    "2 overall\nIn a somewhat ironic twist, the Carolina Panthers look to replace quarterback Sam Darnold with Wilson—which is precisely what the Jets did a year ago.",
    "Denver should be completely happy to have Surtain in the fold, but Parsons is a player the Broncos simply cannot afford to pass over given a second opportunity.",
    "Given the uncertainty surrounding this year's rookie quarterback class, preemptively pairing Fields with new head coach Brian Daboll would make plenty of sense.",
    "Waddle will pair with tight end Mike Gesicki and new additions Tyreek Hill and Cedrick Wilson Jr. to give Miami one of the better receiving corps in the AFC.",
    "Chicago Bears: Christian Darrisaw, OT, Virginia Tech\nOriginal Selection: Kadarius Toney, WR, Florida (by Giants via trade)\nWhere he was actually picked: No.",
    "Taking Penn State's Pat Freiermuth a year early would have Tampa in a good spot—and it would have helped the Bucs navigate Gronkowski's injury last season.",
    "Lawrence still carries the promise of a generational quarterback, and that's hard to pass over—especially with no can't-miss quarterback prospects in 2022.",
    "Minnesota Vikings: Greg Newsome II, CB, Northwestern\nOriginal Selection: Alijah Vera-Tucker, OG, USC (by Jets via trade)\nWhere he was actually picked: No.",
    "While those might not seem like overly impressive stats, it's worth noting that Philadelphia had a run-oriented offense that ranked last in pass attempts.",
    "However, Darnold's presence—he started the first nine games before being forced out with a shoulder injury—allows the Panthers to work in Wilson slowly.",
    "While an ankle injury limited Owusu-Koramoah to 14 games, he still finished with 76 tackles, 1.5 sacks, four passes defended and three tackles for loss.",
    "However, that might have happened in Jacksonville, too, as Marvin Jones Jr. and Laviska Shenault Jr. were the only Jaguars to reach 500 receiving yards.",
    "Sewell missed the season finale with a thumb injury and illness, but he played 100 percent of the offensive snaps in the 16 games in which he appeared.",
    "Philadelphia Eagles: DeVonta Smith, WR, Alabama\nOriginal Selection: Micah Parsons, LB, Penn State (by PHI via trade)\nWhere he was actually picked: No.",
    "New York Giants: Justin Fields, QB, Ohio State\nOriginal Selection: Justin Fields, QB, Ohio State (by CHI via trade)\nWhere he was actually picked: No.",
    "Original pick Jaycee Horn was great in limited action before landing on injured reserve, but the Panthers need to find their franchise quarterback.",
    "Dallas Cowboys: Patrick Surtain II, CB, Alabama\nOriginal Selection: DeVonta Smith, WR, Alabama (by PHI via trade)\nWhere he was actually picked: No.",
    "Now-retired quarterback Ben Roethlisberger was a shadow of his former self, ranking just 29th in yards per attempt among qualifying signal-callers.",
    "Plus, it would have been a lot more fun to watch Jones and Harris in the lineup for Gang Green than the product New York actually put on the field.",
    "Chicago tried with second-round pick Teven Jenkins, but Jenkins was limited to just six games and 160 offensive snaps after offseason back surgery.",
    "Baltimore Ravens (from KC): Joe Tryon-Shoyinka, Edge, Washington\nOriginal Selection: Odafe Oweh, Edge, Penn State\nWhere he was actually picked: No.",
    "Naturally, the Bears are left without a new franchise quarterback in this scenario, but no signal-caller left on the board warrants a top-20 pick.",
    "While Newsome did experience some injury woes as a rookie—he missed time with a concussion and battled a calf injury—he was reliable when healthy.",
    "Cleveland Browns: Jeremiah Owusu-Koramoah, LB, Notre Dame\nOriginal Selection: Greg Newsome II, CB, Northwestern\nWhere he was actually picked: No.",
    "The Bills should be happy to have Rousseau, but Ojulari would be a fine consolation pick with Buffalo's original selection already off the board.",
    "While Harris isn't the most explosive runner, he's exactly the sort of high-volume back who could lead the Jets offense as it finds an identity.",
    "According to ESPN's Field Yates, St. Brown didn't drop a pass and had 22 more receptions than any other player who went without a drop in 2021.",
    "112 overall\nThe Jaguars had a decent plan with the 25th pick, looking to pair quarterback Trevor Lawrence with college teammate Travis Etienne.",
    "Seeing as how New Orleans narrowly missed the playoffs in Sean Payton's final season, however, it goes with the pass-rusher who stayed healthy.",
    "Tampa Bay Buccaneers: Pat Freiermuth, TE, Penn State\nOriginal Selection: Joe Tryon-Shoyinka, Edge, Washington\nWhere he was actually picked: No.",
    "Smith wasted little time establishing himself as the top receiver in Philadelphia, finishing with 64 receptions, 916 yards and five touchdowns.",
    "As Detroit continues to defer its decision to replace Jared Goff at quarterback, it ensures that it has bookend tackles for whoever comes next.",
    "11 overall\nThe New York Giants originally traded this pick to the Chicago Bears so that they could draft Ohio State quarterback Justin Fields.",
    "50 overall\nThe Buffalo Bills just miss out on Rousseau in our redraft, so they look to add a different edge-rusher in Georgia's Azeez Ojulari.",
    "Jacksonville Jaguars (from Rams): Amon-Ra St. Brown, WR, USC\nOriginal Selection: Travis Etienne, RB, Clemson\nWhere he was actually picked: No.",
    "\"PFF charted Owusu-Koramoah with just 168 passing yards allowed into his coverage on 300 coverage snaps this season,\" Ben Linsey of PFF wrote.",
    "\"That rate of 0.56 yards allowed per snap ranked third among off-ball linebackers with at least 250 coverage snaps during the regular season.\"",
    "Los Angeles Chargers: Rashawn Slater, OT, Northwestern\nOriginal Selection: Rashawn Slater, OT, Northwestern\nWhere he was actually picked: No.",
    "Lance showed a few flashes during his limited playing time, and San Francisco is likely done with Jimmy Garoppolo as a franchise quarterback.",
    "The North Dakota State product did post a 97.3 passer rating and go 1-1 as a starter, but he also completed just 57.7 percent of his passes.",
    "The Florida product finished with 68 receptions and 1,026 receiving yards—just shy of Mike Ditka's tight-end rookie record of 1,076 yards.",
    "Pittsburgh Steelers: Javonte Williams, RB, North Carolina\nOriginal Selection: Najee Harris, RB, Alabama\nWhere he was actually picked: No.",
    "Freiermuth is exactly the sort of crafty, dependable target Tom Brady would love to have in what might (or might not) be his final year.",
    "As things stand in the real world, Arizona is left having to replace a pass-rusher who logged 71.5 sacks in 84 games with the franchise.",
    "Carolina Panthers: Zach Wilson, QB, Brigham Young\nOriginal Selection: Jaycee Horn, CB, South Carolina\nWhere he was actually picked: No.",
    "Miami Dolphins (from PHI): Jaylen Waddle, WR, Alabama\nOriginal Selection: Jaylen Waddle, WR, Alabama\nWhere he was actually picked: No.",
    "Arizona only got seven games out of veteran pass-rusher J.J. Watt in 2021, and having Phillips would have helped mitigate his absence.",
    "L.A. snatched up the Northwestern product with the 13th overall pick and solidified their left tackle spot for the foreseeable future.",
    "A player can check every conceivable box and still wind up struggling as a rookie because of poor team fit, a bad situation or injury.",
    "Green Bay Packers: Asante Samuel Jr., CB, Florida State\nOriginal Selection: Eric Stokes, CB, Georgia\nWhere he was actually picked: No.",
    "The team got just five games, 143 defensive snaps and one sack out of him before he landed on injured reserve with a shoulder setback.",
    "Washington Commanders: Jaycee Horn, CB, South Carolina\nOriginal Selection: Jamin Davis, LB, Kentucky\nWhere he was actually picked: No.",
    "He racked up 1,455 yards and 13 touchdowns while earning a Pro Bowl nod (like Pitts) and being named AP Offensive Rookie of the Year.",
    "\"It was bad,\" Fields' private quarterback coach Ron Veal told 670 The Score in Chicago (h/t Michael David Smith of ProFootballTalk).",
    "New Orleans Saints: Gregory Rousseau, Edge, Miami\nOriginal Selection: Payton Turner, Edge, Houston\nWhere he was actually picked: No.",
    "Farley was serviceable in three games—he allowed an opposing passer rating of 101.4 before being lost for the season to a torn ACL.",
    "Denver Broncos: Micah Parsons, LB, Penn State\nOriginal Selection: Patrick Surtain II, CB, Alabama\nWhere he was actually picked: No.",
    "15 overall\nThe New York Jets took a flier on the physically gifted but unpolished Zach Wilson, and the results were underwhelming.",
    "Indianapolis Colts: Elijah Moore, WR, Mississippi\nOriginal Selection: Kwity Paye, Edge, Michigan\nWhere he was actually picked: No.",
    "47 overall\nThe Green Bay Packers got a good one in Stokes, but he's off the board here, and the team still needs cornerback depth.",
    "It's also worth noting that Ojulari played on an underwhelming Giants defense that ranked 21st overall and 23rd in points allowed.",
    "Baltimore Ravens: Paulson Adebo, CB, Stanford\nOriginal Selection: Rashod Bateman, WR, Minnesota\nWhere he was actually picked: No.",
    "Of course, Chicago also holds the seventh overall pick in the 2022 draft in this scenario after not trading up to acquire Fields.",
    "He flashed in his brief window, playing 142 defensive snaps over three games and allowing an opposing passer rating of only 39.6.",
    "Las Vegas Raiders: Alijah Vera-Tucker, G, USC\nOriginal Selection: Alex Leatherwood, OT, Alabama\nWhere he was actually picked: No.",
    "He fell in the draft because of his injury history—he underwent knee surgery in both high school and college—and limited resume.",
    "In Fields' first career start, for example, Nagy went with a pass-first game plan against a fearsome Cleveland Browns pass rush.",
    "While Wentz was far from perfect for Indianapolis, he posted a 94.6 rating and was better than anyone New York had under center.",
    "Tennessee Titans: Eric Stokes, CB, Georgia\nOriginal Selection: Caleb Farley, CB, Virginia Tech\nWhere he was actually picked: No.",
    "Miami Dolphins: Odafe Oweh, Edge, Penn State\nOriginal Selection: Jaelan Phillips, Edge, Miami\nWhere he was actually picked: No.",
    "Buffalo Bills: Azeez Ojulari, Edge, Georgia\nOriginal Selection: Gregory Rousseau, Edge, Miami\nWhere he was actually picked: No.",
    "\"49ers decision-makers implied to Jones during predraft interviews that he was their target, according to sources,\" Howe wrote.",
    "We're going with the final draft order before Round 1 began, meaning predraft trades are included but draft-day swaps are not.",
    "Arizona Cardinals: Jaelan Phillips, Edge, Miami\nOriginal Selection: Zaven Collins, LB, Tulsa\nWhere he was actually picked: No.",
    "The Giants have quarterback Daniel Jones under contract for another year, and Fields had a rough rookie campaign with Chicago.",
    "Indy lacked receiver depth behind Michael Pittman Jr., who was the only player on the team to top 400 receiving yards in 2021.",
    "He finished with 50 tackles, four passes defended, an interception, a forced fumble, four sacks and 24 quarterback pressures.",
    "Parsons finished his rookie season with 84 tackles, 64 solo stops, an opposing passer rating of 71.5 and a whopping 13 sacks.",
    "Additionally, the Cardinals lost Chandler Jones this offseason, and drafting Phillips would have provided a succession plan.",
    "New England Patriots: Davis Mills, QB, Stanford\nOriginal Selection: Mac Jones, QB, Alabama\nWhere he was actually picked: No.",
    "Oweh's production came in a Ravens defense that suffered multiple injuries in the secondary and ranked last in pass defense.",
    "He was a reliable starter, too, responsible for only six penalties and four sacks allowed, according to Pro Football Focus.",
    "The Miami product logged 8.5 sacks and 26 quarterback pressures in Year 1 to go with 42 tackles and nine tackles for loss.",
    "6 overall\nThe Miami Dolphins will continue to try building around quarterback Tua Tagovailoa for at least one more season.",
    "Instead, Tennessee turns to former Georgia corner Eric Stokes, who appeared in 16 games for the Green Bay Packers in 2021.",
    "Had Baltimore fielded a quality starter for the entire season, it might have stood a chance of sneaking into the playoffs.",
    "As the Packers now know, star cornerback Jaire Alexander missed 13 games during the regular season with a shoulder injury.",
    "He finished with 66 tackles, eight passes defended, three interceptions and a respectable opposing passer rating of 91.7.",
    "Darrisaw missed the first four games of his rookie season with a groin injury, but he recovered to have a solid campaign.",
    "He didn't have quite the numbers Phillips did as a rookie, but the drop-off in Miami's defense shouldn't be significant.",
    "However, the rest of the 2021 class remains largely unproven, and passing on a sure thing like Chase would be a mistake.",
    "Cincinnati Bengals: Kyle Pitts, TE, Florida\nOriginal Selection: Ja'Marr Chase, WR, LSU\nWhere he was actually picked: No.",
    "In other words, the NFL draft would look quite a bit different if teams could go back a year and redo their selections.",
    "While Waddle wasn't a Pro Bowler like some of the players left on the board, he did nothing to disappoint as a rookie.",
    "An offensive tackle would also make a lot of sense here, seeing as how Burrow was sacked an NFL-high 51 times in 2021.",
    "Detroit Lions: Penei Sewell, OT, Oregon\nOriginal Selection: Penei Sewell, OT, Oregon\nWhere he was actually picked: No.",
    "Most people might shy away from that challenge,\" Smith said of Hurts, per Josh Tolentino of the Philadelphia Inquirer.",
    "He appeared in 16 games as a rookie, intercepted four passes and allowed an opposing quarterback rating of only 61.3.",
    "A lot goes into making an NFL draft pick, including film study, athletic testing, interviews and analytical research.",
    "Atlanta Falcons: Ja'Marr Chase, WR, LSU\nOriginal Selection: Kyle Pitts, TE, Florida\nWhere he was actually picked: No.",
    "The Jets would be tempted to take Ja'Marr Chase here, but that wouldn't solve their need for a franchise quarterback.",
    "The Raiders' offensive line was a liability in 2021—Las Vegas surrendered 40 sacks and ranked 27th in yards per rush.",
    "24 overall\nIn this redraft, the Jets miss out on both Vera-Tucker and Moore, two bright spots in their 2021 campaign.",
    "Stokes had a terrific rookie campaign, finishing with 14 passes defended and an opposing passer rating of just 71.3.",
    "A Pro Football Writers of America All-Rookie selection, Vera-Tucker stood out on an underwhelming Jets team in 2021.",
    "The former Crimson Tide star finished with 22 touchdown passes, a 92.5 rating and a Pro Bowl appearance as a rookie.",
    "Therefore, there aren't many reasons for them to move away from their original choice here, Alabama's Jaylen Waddle.",
    "They scoop him up knowing they'll get a legitimate playmaker and a tremendous teammate for quarterback Jalen Hurts.",
    "23 overall\nWith the Vikings passing on Darrisaw, the Bears get a prime opportunity to improve their offensive line.",
    "However, he still rushed for 1,200 yards while catching 74 passes for 467 yards and scoring 10 combined touchdowns.",
    "Rob Gronkowski was limited to 12 games by a rib injury in 2021, but he still produced 802 yards and six touchdowns.",
    "In that short span, he was responsible for seven penalties and two sacks allowed, according to Pro Football Focus.",
    "14, however, they look to secure their other rookie defensive star, Notre Dame linebacker Jeremiah Owusu-Koramoah.",
    "He rarely came off the field when healthy, and he would still be a valuable contributor in the Packers secondary.",
    "Moore was limited to 11 games by a hamstring injury, but he was one of the few highlights for a bad Jets offense.",
    "The standout corner led the NFL with 11 interceptions but also allowed 907 yards and four touchdowns in coverage.",
    "Whether Jones was a smokescreen or not, he's off the board, so San Francisco sticks with its original selection.",
    "New York Jets: Mac Jones, QB, Alabama\nOriginal Selection: Zach Wilson, QB, BYU\nWhere he was actually picked: No.",
    "However, the running back suffered a Lisfranc injury during the preseason and missed his entire rookie campaign.",
    "Starting cornerbacks Marcus Peters (torn ACL) and Marlon Humphrey (torn pectoral) both missed significant time.",
    "While Samuel did allow an opposing passer rating of 96.8, he also had 11 passes defended and two interceptions.",
    "10 overall\nThe Eagles luck out and find the receiver they originally traded up to get still on the board at No.",
    "Davis Mills was a third-round pick by the Houston Texans in 2021, but here, he goes in the middle of the first.",
    "Darnold was a disaster in 2021, throwing a mere nine touchdown passes with 13 interceptions and a 71.9 rating.",
    "However, the floor for Jones would still be high, and his poise and efficiency would benefit the Jets greatly.",
    "Pittsburgh may still have made the playoffs and would still be set with a starting-caliber back entering 2022.",
    "While Fields has plenty left to prove, Jones has largely proven that he isn't franchise-quarterback material.",
    "Quarterback Justin Herbert made a big second-year leap in 2021, thanks in no small part to Slater's presence.",
    "Slater missed one game on the reserve/COVID-19 list but played 100 percent of the offensive snaps otherwise.",
    "Naturally, Pitts wouldn't possess the same preexisting chemistry with quarterback Joe Burrow that Chase had.",
    "While Ojulari only had three more pressures in 249 more snaps than Rousseau, he also doubled his sack total.",
    "Some consideration was given to Bateman here, since the Ravens passed on the wideout earlier in the redraft.",
    "The trade for Darnold was a failure, though Carolina insists it wants to see Darnold be the Week 1 starter.",
    "4 overall\nWith Chase off the board, the Cincinnati Bengals take a different Pro Bowl pass-catcher in Pitts.",
    "However, he didn't show enough as a rookie to justify taking him over a potential future star on the edge.",
    "Originally picked in the second round by Denver, Williams made an immediate impact on the Broncos offense.",
    "According to Pro Football Focus, Leatherwood was responsible for 14 penalties and eight sacks surrendered.",
    "Oweh burst onto the scene quickly with the Baltimore Ravens, tallying three sacks in his first five games.",
    "Originally a fourth-round pick by the Lions, St. Brown represents the single biggest rise in our redraft.",
    "Rousseau was a rotational piece for a Buffalo defense that ranked first in both points and yards allowed.",
    "Now, New York couldn't expect the same results, as New England surrounded Jones with far superior talent.",
    "7 overall\nThe Detroit Lions also have little reason to move away from their original pick, so they don't.",
    "\"We want him to take it and run with it,'' general manager Scott Fitterer said, per ESPN's David Newton.",
    "A trio of Tee Higgins, Tyler Boyd and Pitts would be nearly as formidable as Cincinnati's current group.",
    "While Paye flashed at times—he had four sacks and 16 pressures—he didn't have a huge impact as a rookie.",
    "29 overall\nThe Tennessee Titans originally used this selection on Virginia Tech cornerback Caleb Farley.",
    "A third-round pick of New Orleans, Stanford's Paulson Adebo was both effective and durable as a rookie.",
    "Miami sticks with its original pick and leaves Tagovailoa no room for excuses entering the 2022 season.",
    "Here, competition comes in the form of Wilson, who lacked the polish to be a successful rookie starter.",
    "Calvin Ridley missed the majority of the 2021 season after stepping away to focus on his mental health.",
    "13 overall\nThe Lions sticking with Sewell over Slater would be great news to the Los Angeles Chargers.",
    "He started 11 games, threw 16 touchdown passes with 10 interceptions and posted an 88.8 passer rating.",
    "It's tempting to pair Minnesota with offensive tackle Christian Darrisaw, their original choice at No.",
    "Turner was in and out of the lineup even before the injury, inactive in four of the first seven games.",
    "Given Harris' workload, Williams would have finished with 1,351 rushing yards and 540 receiving yards.",
    "With Harris off the board one pick earlier, Pittsburgh needs to find another dual-threat running back.",
    "After failing to notch a sack in 2020 with Penn State, Oweh had five of them with the Ravens in 2021.",
    "However, the Jaguars were a mess under head coach Urban Meyer, who was fired before the season ended.",
    "He caught 104 passes for 1,015 yards and six touchdowns in an offense that ranked just 25th overall.",
    "His ability to rush the passer is key, as the Broncos traded away sack artist Von Miller midseason.",
    "However, if the 49ers still believed he could be the future, they never would have traded up to No.",
    "That production will be difficult to replicate, but adding Phillips would have been a great start.",
    "52 overall\nThe Cleveland Browns originally took Newsome with this pick, and they're glad they did.",
    "While Rousseau played just 49 percent of the defensive snaps, he started all 17 games for Buffalo.",
    "Instead, Arizona scoops up pass-rusher Jaelan Phillips, who starred for the Dolphins as a rookie.",
    "Instead, they go with the 2021 Defensive Rookie of the Year, Penn State linebacker Micah Parsons.",
    "10 spot—allowing the Philadelphia Eagles to snag wideout DeVonta Smith—and still landed Parsons.",
    "Given Atlanta's recent trade of quarterback Matt Ryan, a quarterback could also make sense here.",
    "According to Jordan Raanan of ESPN, the Giants are unlikely to pick up Jones' fifth-year option.",
    "Owusu-Koramoah, who made the Pro Football Focus All-Rookie Team, was also fantastic in coverage.",
    "To be fair, the Lions lacked receiver depth and forced the ball to St. Brown late in the season.",
    "However, Harris was a rookie Pro Bowler who practically carried the Pittsburgh Steelers offense.",
    "34 overall\nLast April, the Indianapolis Colts took Michigan pass-rusher Kwity Paye 21st overall.",
    "It's worth noting, though, that Jets quarterbacks had a cumulative rating of just 76.0 overall.",
    "He was responsible for three penalties and five sacks allowed, according to Pro Football Focus.",
    "However, he was a quality starter, playing 84 percent of the defensive snaps in those contests.",
    "He was picked by the Bills two spots after Turner and had a far more impactful rookie campaign.",
    "55 overall\nThis revised selection has a lot to do with the Tampa Bay Buccaneers' current state.",
    "18 overall\nThe Arizona Cardinals originally took Tulsa linebacker Zaven Collins with this pick.",
    "While Waddle didn't have the raw statistics or the buzz of Chase, he was fantastic as a rookie.",
    "The Cowboys led the NFL with 26 of them while ranking seventh in touchdown passes allowed (24).",
    "Waddle is a centerpiece receiver around which new head coach Mike McDaniel will look to build.",
    "While the rookie wasn't a disaster in his first season, he didn't see the field a ton, either.",
    "14 overall\nThe Las Vegas Raiders used the 17th pick on former Alabama tackle Alex Leatherwood.",
    "14 spot, allowing the New York Jets to move up and select interior lineman Alijah Vera-Tucker.",
    "Trey Lance didn't get on the field often as a rookie, and he wasn't overwhelmingly impressive.",
    "A second-round pick by the Giants, Ojulari stepped into a fairly significant role as a rookie.",
    "The Alabama product averaged just 3.9 yards per carry behind a poor Pittsburgh offensive line.",
    "He appeared in all 17 games, started 13 of them and played 67 percent of the defensive snaps.",
    "Even Defensive Player of the Year candidate Trevon Diggs was a risk-reward player for Dallas.",
    "They've built a strong connection in Philadelphia, and Smith openly supports his quarterback.",
    "He finished with four sacks, 29 tackles, five tackles for loss and 27 quarterback pressures.",
    "He also logged 33 tackles, 23 solo stops, three forced fumbles and 27 quarterback pressures.",
    "Getting Vera-Tucker instead of Leatherwood would be a positive step toward fixing the issue.",
    "With Stokes long gone, Green Bay turns to former Florida State cornerback Asante Samuel Jr.",
    "In this redraft, the Vikings stay put and scoop up Northwestern cornerback Greg Newsome II.",
    "He finished with 11 penalties but only five sacks allowed, according to Pro Football Focus.",
    "The bottom line, though, is San Francisco traded up before the draft to take a quarterback.",
    "He finished with 2,334 passing yards, nine touchdowns, 11 interceptions and a 69.7 rating.",
    "30 overall\nA year ago, the New Orleans Saints took Houston pass-rusher Payton Turner 28th.",
    "31 overall\nThe Dolphins should be thrilled with what they got out of Phillips as a rookie.",
    "Having Stokes in that one might just have pushed Tennessee to the AFC Championship Game.",
    "With Tryon-Shoyinka off the board one pick earlier, Tampa grabs Freiermuth while it can.",
    "3 overall\nIt's very tempting to give the San Francisco 49ers a different selection here.",
    "Now, Denver's original pick, cornerback Patrick Surtain II, was a perfectly fine choice.",
    "Drafting Surtain would help add a little more depth and consistency to Dallas' defense.",
    "There's a very real chance Mills could have beaten out Cam Newton for the starting job.",
    "Cleveland landed him in the second round, but it won't risk missing him in the redraft.",
    "However, he's off the board here, so Miami turns to Penn State pass-rusher Odafe Oweh.",
    "However, he was hampered by some very questionable decision-making by coach Matt Nagy.",
    "Like Lawrence, Wilson suffered from a poor supporting cast and disappointed in Year 1.",
    "They won with Garoppolo and would have little trouble learning how to win with Jones.",
    "However, Mills carried himself extremely well with a bad Houston Texans team in 2021.",
    "The Bears went on to surrender 58 sacks and ranked 21st in yards per rushing attempt.",
    "35 overall\nThe Pittsburgh Steelers made the playoffs thanks in large part to Harris.",
    "He started all 17 games for the Saints and played 76 percent of the defensive snaps.",
    "Ojulari finished the year with eight sacks, 49 tackles and 27 quarterback pressures.",
    "Newsome had nine passes defended and allowed an opposing passer rating of only 85.6.",
    "Las Vegas moved him to guard as a rookie, and the results left plenty to be desired.",
    "Jacksonville Jaguars: Trevor Lawrence, QB, Clemson\nWhere he was actually picked: No.",
    "Another player might exceed expectations and immediately be labeled a \"draft steal.\"",
    "The Patriots had a playoff-caliber roster that won six more games than Houston did.",
    "This might seem like a luxury pick, given Dallas' ability to haul in interceptions.",
    "However, he's still a dynamic playmaker who would help lift the Cincinnati offense.",
    "He played a rotational role for the Buccaneers in 2021, but he was still impactful.",
    "Taylor Heinicke was serviceable, but he couldn't push Washington into the playoffs.",
    "He was responsible for five penalties and just two sacks allowed, according to PFF.",
    "It was a gamble, as he was coming off March back surgery, and it failed to pay off.",
    "Moore's production likely would have reflected that if he had been in Indianapolis.",
    "The Cowboys ranked 20th in passing yards allowed and 19th in total yards allowed.",
    "5 overall\nThe Atlanta Falcons got plenty out of tight end Kyle Pitts as a rookie.",
    "Drafting Chase would also fill Atlanta's pressing need for a perimeter receiver.",
    "In his 11 appearances, Moore caught 43 passes for 538 yards and five touchdowns.",
    "Sure, but that's not an option, so the team goes with the best corner available.",
    "In the redraft, the Jets go with a more polished passer in Alabama's Mac Jones.",
    "That's not a bad consolation prize after missing out on Parsons in the redraft.",
    "With New England's supporting cast, Mills might have been even more impressive.",
    "The rookie tackle joined Herbert in the Pro Bowl following the regular season.",
    "He also ended the year with six straight games with at least eight receptions.",
    "Washington ranked 29th in pass defense and 25th in points allowed last season.",
    "He played just 49 percent of the defensive snaps but appeared in all 17 games.",
    "He appeared in 12 games with 11 starts and 89 percent of the defensive snaps.",
    "19 pick, the Commanders instead snag South Carolina cornerback Jaycee Horn.",
    "He cooled off after that and missed the final two games with a foot injury.",
    "He started six games and played 100 percent of the offensive snaps in them.",
    "With a better line in place, Chicago could gamble on a quarterback in 2022.",
    "23, New York pairs Mac Jones with a workhorse running back in Najee Harris.",
    "76 overall\nAs noted, the Baltimore Ravens defense battled injuries in 2021.",
    "Parsons, though, was a difference-maker against both the run and the pass.",
    "Garoppolo is under contract through this season and may get one more year.",
    "Hurts and Smith spent time together at Alabama before Hurts transferred.",
    "The Browns keep him in the fold by drafting him a round early this time.",
    "The Commanders will now turn to trade acquisition Carson Wentz for 2022.",
    "*Advanced statistics from Pro Football Reference unless otherwise noted.",
    "\"Right now, I'm not ready to get back out on that field,\" he told TMZ.",
    "Instead, Jacksonville scoops up former USC receiver Amon-Ra St. Brown.",
    "With Jones already off the board, the Patriots need a new quarterback.",
    "Statistically, he was the second-best rookie after Jones last season.",
    "The Eagles got a great player in Smith, and they take him again here.",
    "9 overall\nIn the real world, the Dallas Cowboys traded out of the No.",
    "This is a pick based largely on potential, but it's a logical gamble.",
    "With Alijah Vera-Tucker available in the redraft, the Raiders pounce.",
    "He provided a passer rating of 77.7 when targeted, which isn't great.",
    "However, the Falcons pivot here to former LSU wideout Ja'Marr Chase.",
    "The reality is that Mills might not be a downgrade for New England.",
    "Williams had 104 fewer carries and 31 fewer receptions than Harris.",
    "Instead, New Orleans grabs Miami's Gregory Rousseau in the redraft.",
    "He suffered two concussions in 2021 and only appeared in 12 games.",
    "Mills started only 11 games over his last two seasons at Stanford.",
    "67 overall\nThis represents the second-biggest jump of the redraft.",
    "He appeared in all 17 games, playing just 20 percent of the snaps.",
    "26 overall\nA year ago, the Minnesota Vikings traded out of the No.",
    "He has since been suspended indefinitely for betting on NFL games.",
    "With Parsons off the board, though, Dallas instead takes Surtain.",
    "\"I can't exaggerate how much he really wants to make us just go.",
    "As a result, Baltimore fielded the league's worst pass defense.",
    "1-caliber receiver with Detroit, especially late in the season.",
    "Miami ranked a more respectable 16th in passing yards allowed.",
    "He has a 12-25 record and a career passer rating of just 84.3.",
    "In the redraft, they stand pat and take Fields for themselves.",
    "However, Dallas very much had a boom-or-bust defense in 2021.",
    "He finished with 90 catches, 912 yards and five touchdowns.",
    "New York ranked 26th in total offense and 28th in scoring.",
    "They do the same here, but with Oweh off the board at No.",
    "The Falcons could take a quarterback with this year's No.",
    "Cincinnati opts for the instant-impact receiver instead.",
    "\"But we're gonna add a lot of competition to that room.\"",
    "Drafting former Mississippi receiver Elijah Moore would.",
    "He might have managed New England to the playoffs, too.",
    "What teams can't bring to the equation is future sight.",
    "18, they instead grab Washington's Joe Tryon-Shoyinka.",
    "Freiermuth was outstanding for the Steelers in 2021.",
    "Turner could still develop into a great pass-rusher.",
    "They were also just 1-3 in games without a takeaway.",
    "8 pick and have a star waiting to aid him in Chase.",
    "Rather than looking to replace either player at No.",
    "And the Colts could have used his production, too.",
    "Four of those losses were by a field goal or less.",
    "However, Gronkowski is no lock to return to Tampa.",
    "While Pitts was impressive, Chase was even better.",
    "Uzomah departed this offseason in free agency.",
    "However, Oweh had a promising rookie campaign.",
    "Adebo's durability is the big selling point.",
    "The move would be worth it for Jacksonville.",
    "With no quarterbacks left worthy of the No.",
    "Enter: North Carolina's Javonte Williams.",
    "Fields was sacked a whopping nine times.",
    "How different might the 2021 draft look?",
    "The Buccaneers also lost tight end O.J.",
    "3 to grab his replacement a year ago.",
    "To be fair, this is a risky decision.",
    "Howard to the Bills in free agency.",
    "Would Green Bay rather have Stokes?",
    "That's what we're here to examine.",
    "With Newsome off the board at No.",
    "\"He took a beating that day.\"",
    "Additionally, tight end C.J.",
    "St. Brown proved to be a No.",
    "Darnold isn't it.",
    "Wilson could be.",
    "B/R Recommends",
    "32.",
    "31.",
    "25.",
    "24.",
    "27.",
    "26.",
    "30.",
    "29.",
    "28.",
    "20.",
    "19.",
    "18.",
    "22.",
    "21.",
    "23.",
    "10.",
    "11.",
    "12.",
    "12.",
    "14.",
    "13.",
    "16.",
    "17.",
    "15.",
    "23.",
    "9.",
    "6.",
    "7.",
    "8.",
    "1.",
    "2.",
    "4.",
    "5.",
    "3."
  ]
}