{
  "id": 1804,
  "mediaId": 3992,
  "date": "2022-04-06",
  "headline": "Masters: Tiger Woods, Rory McIlroy, Jon Rahm, Scottie Scheffler at Augusta National",
  "image": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/18281/production/_124054989_-d329c4f1-a241-4f28-b1b7-91cefec3e263.png",
  "link": "https://www.bbc.com/sport/golf/61000847?at_medium=RSS&at_campaign=KARANGA",
  "mediaOutlet": "BBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Jurejko",
  "authorUrl": "",
  "termIds": [
    1313,
    2086,
    2124,
    2708,
    3936,
    4127,
    4292,
    97,
    595,
    4841
  ],
  "sentences": [
    "England's Paul Casey, 44, finished third in last month's Players Championship and has a good record at Augusta with three top-six finishes and just one missed cut in the past seven years, while fellow veterans Lee Westwood, 48, and Justin Rose, 41, are hoping to belie their advancing years and less-than-vintage form with a renaissance on a course where they have both finished second.",
    "That has allowed the likes of Scottie Scheffler, who recently rose to the world number one ranking after three wins in his past five events, his American Ryder Cup team-mates Justin Thomas, Dustin Johnson and Collin Morikawa, plus Europe's leading player Jon Rahm, to prepare for their Green Jacket bids without the same level of scrutiny.",
    "Ahead of the action starting on time on Thursday - presuming the wet weather which disrupted practice on Tuesday and Wednesday clears up - here are the key things to look out for over the next four days of action...\nWoods is back and targeting victory\nIt's been impossible to ignore the planet's most popular player.",
    "The five-time champion feared his leg would have to be amputated following his high-speed car crash in Los Angeles in February 2021, but this week he returned to the course which has seen some of his greatest moments in a stellar career amid jubilant scenes.",
    "Norway's Viktor Hovland is ranked fourth in the world but there are doubts whether his short game is good enough to succeed at Augusta, while 25-year-old American Sam Burns - who has enjoyed a breakout year with three tour wins - makes his Masters debut.",
    "England's Danny Willett and Scottish veteran Sandy Lyle play by using their lifetime invitations as former champions, while English amateur Laird Shepherd qualified to make his debut after producing an amazing comeback to win the Amateur Championship.",
    "Open champion Morikawa wants to \"play to his strengths\" after finishing 44th and 18th in his two Augusta appearances, while 2020 champion Dustin Johnson and 2015 winner Jordan Spieth already have the knowledge of what it takes to succeed.",
    "The first tee shot will be hit at 13:00 BST on Thursday - after the ceremonial drives from legendary champions Jack Nicklaus, Gary Player and Tom Watson - with a field of fewer than 100 aiming to sink the winning putt come Sunday.",
    "After sinking more birdies than anyone else in the field on his Masters debut last year, Scotland's Robert MacIntyre returns to Augusta looking to build on his steady recent form and improve on last year's 12th-place finish.",
    "Smith claimed a share of second place in 2020 - when he became the first player to shoot sub-70 in all four rounds - and says he can \"compete against anyone in any given week\" as he looks to land his first major.",
    "\"I have put too much pressure on myself in the past, put the tournament too much on pedestal and tried to overdo things when in reality I should have faith in my game and the things that I can do on the course.\"",
    "Venue: Augusta National Golf Club, Georgia Date: 7-10 April\nCoverage: Listen to commentary on BBC Radio 5 Live; follow live text on the BBC Sport website and app; watch highlights on BBC Two and online.",
    "The big-hitting Spaniard has finished in the top 10 at each of the past four Masters, although the 27-year-old will need to improve his recent form around the greens if he wants to challenge again.",
    "Since putting the first US point on the board in the Sunday singles at Whistling Straits by thumping Rahm, Scheffler has gone from strength-to-strength with his composed and classy all-round game.",
    "The 35-year-old has finished in the top 25 at all six events he has played this year, including at the Honda Classic where he looked on course for victory before a rain downpour derailed his bid.",
    "Defending champion Hideki Matsuyama has struggled with back and neck injuries in recent weeks, but the Japanese player remains optimistic of being 100% fit when the tournament begins on Thursday.",
    "Three tour victories in 2022 have propelled him above Rahm to the top of the rankings and, although he has never finished in the top three at a major, looks a good bet to change that this week.",
    "Then the world number one, the Northern Irishman won back-to-back majors in 2014 at the Open Championship and the US PGA Championship - having previously won the 2011 US Open and 2012 PGA.",
    "McIlroy finished fourth at Augusta in 2015 and the 32-year-old has not won another major title since that gripping PGA Championship triumph at Valhalla in near darkness eight years ago.",
    "Tyrrell Hatton is the highest-ranked Englishman at 16th in the world, regaining the consistency which deserted him in 2021 with five top-10 finishes in his eight events this year.",
    "Most of the attention this week has been on whether Tiger Woods will play, just 14 months after suffering life-threatening injuries when he crashed a car while speeding.",
    "Fitzpatrick, 27, comes into the Masters on the back of top-10 finishes in four of his last five PGA Tour strokeplay events\nAre any other UK players likely to contend?",
    "On Tuesday, he confirmed he planned to play in the Masters and compete in a top-level event for the first time since his last appearance at Augusta in November 2020.",
    "Fresh from winning the prestigious Players Championship title in March, Australia's Cameron Smith has both the hot form and past pedigree to succeed at Augusta.",
    "World number nine Rory McIlroy, who again bids to complete the career Grand Slam of winning all four majors, is once again the leading player from the UK.",
    "McIlroy tees off at 19:03 BST on Thursday, playing alongside American four-time major winner Brooks Koepka and England's world number 24 Matt Fitzpatrick.",
    "Golf's first men's major of the year is upon us, with the world's finest players making their annual pilgrimage to one of sport's most iconic venues.",
    "There will also be live text commentary, in-play clips, reaction and analysis on the BBC Sport website and mobile app every day of the tournament.",
    "You can watch highlights of all four rounds on BBC Two, BBC iPlayer and online, with live radio coverage on BBC Radio 5 Live and Sports Extra.",
    "Packed galleries during Monday's practice rounds provided a celebratory atmosphere as the patrons welcomed Woods back to Augusta National.",
    "\"In terms of a results standpoint, I feel I have performed very, very poorly,\" said Thomas, whose best Masters finish was fourth in 2020.",
    "While his record at Augusta is mixed, 2019 Open champion Lowry is fancied by some to challenge this week after a solid start to 2022.",
    "Another American tipped to challenge is Thomas, who says he has underachieved in the majors since winning the 2017 PGA Championship.",
    "Shane Lowry, Padraig Harrington and Seamus Power - players who McIlroy has practised with this week - are representing Ireland.",
    "Going into the 2015 Masters, McIlroy was the overwhelming favourite to win the Green Jacket and complete the career Grand Slam.",
    "The 86th Masters takes place from 7-10 April and you can follow the action on BBC TV, radio and digital platforms.",
    "\"I've always said time is on my side and I'll keep saying that until it isn't, whenever that is,\" said McIlroy.",
    "Going into last year's Ryder Cup, Scheffler was the lowest-ranked player in the victorious United States team.",
    "\"Looking at the rankings and focusing on that stuff doesn't provide any benefit for me,\" said Scheffler.",
    "Rahm remains the favourite to follow up his win at last year's US Open with a second major victory.",
    "\"I look forward to preparing and playing good golf and executing shots and being in contention.",
    "Asked if he thought he could win a 16th major title this week, Woods simply replied: \"I do.\"",
    "Fast forward seven months and the 25-year-old from New Jersey is the world number one.",
    "McIlroy and Fitzpatrick are among 11 UK players set to tee off at Augusta on Thursday.",
    "\"I'm not looking at it, but I like to think I'm the favourite myself in my mind.\"",
    "I've got a few more grey hairs than I used to, but I'm still young at heart.\"",
    "\"I couldn't care any less what the odds say,\" said Rahm.",
    "Who are the other players expected to challenge?",
    "\"I'm 32 years old with a ton of experience.",
    "How can you follow the Masters on the BBC?",
    "Can McIlroy finally land the 'Rory Slam'?",
    "Unmistakeably, the Masters.",
    "The manicured fairways.",
    "The blooming azaleas.",
    "That's what's fun.\"",
    "Augusta National.",
    "The Green Jacket.",
    "Amen Corner."
  ]
}