{
  "id": 1816,
  "mediaId": 2551,
  "date": "2022-03-31",
  "headline": "Italian aid worker describes 14 months of torture and abuse at the hands of ISIS Beatle",
  "image": "https://i.dailymail.co.uk/1s/2022/03/31/20/56066851-0-image-a-49_1648755793987.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10672635/Italian-aid-worker-describes-14-months-torture-abuse-hands-ISIS-Beatle.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "+18\nView gallery\n Elsheikh is standing trial in Alexandria, accused of being involved in the murders of American journalists James Foley and Steven Sotloff and relief workers Peter Kassig and Kayla Mueller\n+18\nView gallery\nA Kurdish security officer escorts Alexanda Amon Kotey, left, and El Shafee Elsheikh, who were allegedly among four British jihadis who made up a brutal Islamic State cell dubbed 'The Beatles,' for an interview with The Associated Press, March 30, 2018\n+18\nView gallery\nSpanish journalist Javier Espinosa, who was kidnapped by the ISIS cell and spent three months as a hostage, said Elsheikh was the 'most brutal' of the terrorists.",
    "+18\nView gallery\nAlexanda Amon Kotey, left, and El Shafee Elsheikh, who were allegedly among four British jihadis who made up a brutal Islamic State cell dubbed 'The Beatles,' speak during an interview with The Associated Press at a security center in Syria in 2021\n+18\nView gallery\nDiane and John Foley, the parents of James Foley, an American journalist beheaded by the ISIS cell known as the 'Beatles', arrive at the court case for the US terror trial of Elsheikh on Wednesday\n+18\nView gallery\nBethany Haines, the daughter of Briton David Haines, who was beheaded by the ISIS 'Beatles' cell, arrives at the courthouse in Alexandria on Wednesday.",
    "+18\nView gallery\n El Shafee Elsheikh, 33, is standing trial in Alexandria, Virginia\n+18\nView gallery\nPaula (left) and Ed Kassig (second left), the parents of beheaded US relief worker Peter Kassig walk towards the Alexandria federal court house after a break for the trial of ISIS member El Shafee Elsheikh on Wednesday\nBorn in Trieste, Italy, Motka said he spent much of his childhood in the Middle East and went to boarding school in England.",
    "+18\nView gallery\nFor the opening statements Foley's mother Diane and father John (pictured arriving at court) sat in one of the benches of the courtroom in Alexandria, Virginia, as they heard details of their son's execution by the ISIS 'Beatles' cell\nSotloff, 31, from Miami, Florida, also a journalist, was kidnapped on the way to Aleppo in 2013 and was executed by Emwazi in a sick video released the following year.",
    "ISIS victim David Haines's daughter tells how she wanted his killers from terror gang 'the Beatles' to be 'hung from a tree'\n+18\nView gallery\nDavid Haines was a British aid worker kidnapped and beheaded by the 'Beatles'\nThe daughter of David Haines came face-to-face with the man accused of kidnapping and torturing her father for the first time, as she said she wanted his killers to be 'hung from a tree'.",
    "+18\nView gallery\nFederico Motka testified on Thursday about the 14 months of brutality he suffered at the hands of the Islamic State\nMotka also told the court how his captors forced him to participate in a 'Royal Rumble' fight with other hostages, and subjected them to a ‘regime of punishments and stress positions’, including making them pretend to be obedient dogs, until his release in May 2014.",
    "While Elsheikh has not been charged in America over Mr Haines' death due to America lacking jurisdiction, Haines wanted to come face-to-face with her father's alleged killer\nThe families of the four US victims attended the trial on Wednesday, with Foley's parents Diane and John as well as Kassig's parents Paula and Ed pictured arriving at the courtroom.",
    "The savage ISIS Beatles, including Jihadi John ringleader who shared beheading videos online and killed innocent aid workers\n+18\nView gallery\nJihadi John\nMohammed Emwazi - Jihadi John\nEmwazi was one of the most prominent members of the so-called ISIS Beatles and was regularly seen carrying out executions in their horrific beheading videos.",
    "Relatives of James Foley, Kayla Mueller, Steven Sotloff and Peter Kassig glared at El Shaffe Elsheikh at the federal court in Alexandria, Virginia\nBut for Mueller's mother Marsha the emotion was too much and she wiped a tear from her eye as Elsheikh walked into court - before her husband Carl put his arm around her to comfort her.",
    "Advertisement\nBethany Haines, the daughter of David Haines - a British aid worker kidnapped and beheaded by the ISIS 'Beatles' cell - also arrived at the courtroom in Virginia, as she said she wanted to come face-to-face with the man accused of kidnapping and torturing her father.",
    "Together, the men were nicknamed 'The Beatles' by their captives, in part because of their accents and in part because the hostages felt the need to be surreptitious when talking amongst themselves because they risked punishment to be openly discussing their captors, Gibbs said.",
    "As the victims' families stared down Elsheikh in the courtroom, Gibbs described the ISIS propaganda videos showing Foley, Sotloff and Kassig being beheaded, and how Mueller was forced into slavery and raped repeatedly by the ISIS leader Abu Bakr al-Baghdadi before being killed.",
    "Pictured: Espinosa running to hug his son as he arrived in Madrid, Spain, after he was released from ISIS captivity\nA former Danish soldier later took the witness stand to tell how he had negotiated for months to secure the release of a Danish photographer, Daniel Rye Ottosen.",
    "Motka said: ‘The did a Radio 5 Live commentary’, referring to the BBC’s sports radio station\nThe Beatles decided that Cantile was the winner and that Motka had lost, but he was not waterboarded and it seemed like just a threat - but he suffered the torture on other occasions.",
    "Both were killed in Syria by ISIS\nElsheikh, who is also charged with lethal-hostage taking, is believed to be one of four British ISIS terrorists belonging to the 'Beatles' cell - nicknamed for their UK roots and accents - that operated in Iraq and Syria.",
    "Speaking to The Sunday Telegraph, the daughter of Mr Haines - the former RAF engineer and aid worker who was 44 he was captured by ISIS in 2013 and beheaded the following year - said that she never thought Elsheikh would be caught, let alone stand trial.",
    "According to Motka, the prisoners were made to wear orange jumpsuits with numbers on the back because George wanted them to experience what it was like for prisoners in Guantanamo Bay, the US prison in Cuba where post-9/11 terror suspects were held.",
    "While Elsheikh has not been charged in America over Mr Haines' death due to America lacking jurisdiction, he is believed to have participated in the kidnapping, torture and beheading of 27 British, American and other foreign hostages in Syria.",
    "Advertisement\nMotka testified that for the first month of captivity, he was only only occasionally mistreated, but that mistreatment frequently came at the hands of three captors hostages dubbed 'the Beatles' because of their British accents.",
    "He played a leadership role in keeping at least 27 Western hostages captive between 2012 and 2015 whilst inflicting torture on his victims using brutal methods such as waterboarding, prosecutors told the court in Alexandria on Wednesday.",
    "Pictured: Paula and Ed Kassig arrive at court on Wednesday\nElsheikh has denied any role in the kidnapping of the Americans and his trial is due to last four weeks - with relatives of his alleged victims expected to be in court every day.",
    "The British accents and phraseology are a key element of the case, though, as prosecutors seek to prove that Elsheikh is indeed one of the Beatles who tortured hostages, even though the Beatles took great pains to conceal their faces.",
    "They were made while he was in custody of the Syrian Democratic Forces, and he was fearful of being transferred to Iraq, where he heard rumors that detainees were being summarily executed after 10-minute trials, the attorney said.",
    "Federico Motka, an Italian-born aid worker who survived 14 months in Syrian captivity, outlined the extremists' chip on their shoulder at alleged terrorist El Shafee Elsheikh's federal trial in Alexandria, Virginia, on Thursday.",
    "Gibbs told jurors that they will hear from numerous witnesses who will provide evidence of Elsheikh's guilt, including from captives who spent time with the slain Americans as well as family members who received ransom demands.",
    "In opening statements, prosecutors referenced only three British nationals - Elsheikh, his longtime friend Alexenda Kotey, and Mohammed Emwazi, who frequently carried out the role of executioner and was known as 'Jihadi John.'",
    "While Elsheikh, who was stripped of his British citizenship, has not been charged in America over Mr Haines' death due to America lacking jurisdiction, Haines wanted to have some sense of closure by attending the US trial.",
    "At the RNC the Muellers criticized the Obama administration for failing to bring their daughter back alive, and praised Donald Trump under whose administration the operation to kill Baghdadi was successfully carried out.",
    "Families of four Americans killed by ISIS terrorist stare him down in court\nThe families of four Americans allegedly killed by an ISIS terrorist stared him down in court as he faced trial for their kidnap and murder.",
    "Other times they were not allowed to go to the toilet, which became problematic when they were moved to another prison and were given more food but couldn’t keep it inside because they had been so badly mistreated.",
    "Kassig, 26, an aid worker and former Army ranger who converted to Islam and changed his name to Abdul-Rahman, was captured in Syria in 2013 while delivering food and medical supplies to refugees in eastern Syria.",
    "Motka is the first surviving hostage to testify at Elsheikh's trial in Alexandria, Virginia, which entered its second day on Thursday, when he described 14 months of brutality at the hands of the Islamic State.",
    "'The former hostages will give you different versions of whom the Beatles were, you will hear very, very different stories,' he said, arguing that the evidence 'will fail to prove' that Elsheikh was involved.",
    "Throughout opening statements of the trial, which is expected to last at least three weeks, Elsheikh sat stiff, avoiding eye contact with the jury while Gibbs described the atrocities inflicted on hostages.",
    "Bethany Haines is present in Virginia this week for the trial of El Shafee Elsheikh, who is accused of being involved in the murders of Americans James Foley, Steven Sotloff, Kayla Mueller and Peter Kassig.",
    "Defense attorney Edward MacMahon highlighted the discrepancy about the number of Beatles as he argued for his client's innocence, saying Elsheikh was not a 'Beatle' but a simple Islamic State foot soldier.",
    "Jihadi Paul\nAine Lesley Davis - Paul\nDavis was born Aine Leslie Junior Davis in 1984 to Fay Rodriquez, and is believed to have spent the early years of his childhood in Hammersmith where his mother lived.",
    "'No matter what you say, this was not about religion, you brutally murdered good and innocent people, and now you have to live with that for the rest of your life,' Ms Haines plans to tell him, she said.",
    "They were turned over to US forces in Iraq and flown to Virginia, US, in October 2020 to face charges of hostage-taking, conspiracy to murder US citizens and supporting a foreign terrorist organization.",
    "Interestingly, the prosecutor referred only to three British nationals — Elsheikh, Alexanda Kotey, and Mohammed Emwazi, who frequently carried out the role of executioner and was known as 'Jihadi John'.",
    "Spanish journalist Javier Espinosa, who was kidnapped by the ISIS cell and spent three months as a hostage, said Elsheikh - whom he dubbed 'Jihadi George' - was the 'most brutal' of the terrorists.",
    "The first witness to testify was terrorism expert Bruce Hoffman, a professor at Georgetown University, who walked the jury through the origins of the Islamic State group as an offshoot of al-Qaeda.",
    "He was captured along with Kotey when they tried to flee to Turkey in 2018 and has since been transported to the US where he now faces charges relating to terrorism and beheading Western hostages.",
    "Motka described in chilling detail how his captors made him and three other prisoners do a ‘Royal Rumble’ style fight for their enjoyment - while the terrorists made sportscaster style commentary.",
    "Mueller, from Prescott, Arizona, was kidnapped in 2013 while leaving a hospital in Aleppo and, in an appalling turn of events, was repeatedly raped by the former ISIS leader Abu Bakr al-Baghdadi.",
    "Jurors also heard testimony Thursday from Danish hostage negotiator Jens Serup, who testified about prolonged efforts to secure the release of Daniel Rye Ottosen in exchange for 2 million euros.",
    "Davis was captured by Turkish security officials in 2015 and was later found guilty of being a senior member of a terrorist organization and was sentenced to seven and a half years in prison.",
    "Prosecutor John Gibbs said Elsheikh was known by his captives not only for his British accent, but for his unusual penchant for brutality even within a terrorist group known for its cruelty.",
    "The aid worker testified that his abductors greeted him in English after he and his colleagues were kidnapped near a refugee camp on the Turkish border, saying: 'Welcome to Syria, you mutt.'",
    "Espinosa said whilst it was another Beatles member, Mohamed Emwazi, who carried out the executions of prisoners, he was 'just muscles' and Elsheikh was 'the one who was leading the others'.",
    "But for Mueller's mother Marsha the emotion was too much and she wiped a tear from her eye as Elsheikh walked into court - before her husband Carl put his arm around her to comfort her.",
    "Describing waterboarding at the hands of Elsheikh and George, Motka said he was forced to lie on his back over the toilet with a jumper on his face while water was poured on top of it.",
    "The charges against Elsheikh carry a potential death sentence, but U.S. prosecutors have advised British officials that they will not seek the death penalty against Elsheikh or Kotey.",
    "He took part in the barbaric beheadings of British aid workers David Haines and Alan Henning and US journalists James Foley and Steven Sotloff and US humanitarian worker Peter Kassig.",
    "Defense lawyers, though, have highlighted the difficulties that hostages have in formally identifying each of their captors, who routinely wore masks that covered all but their eyes.",
    "A privately-educated aid worker captured and tortured by the notorious ISIS 'Beatles' said his British abusers branded him a 'posh w**ker' for attending an English boarding school.",
    "The hostages 'all experienced brutal mistreatment at the hands of the British men they called the Beatles,' prosecutor John Gibbs said Wednesday as part of his opening statement.",
    "El Shafee Elsheikh\nEl Shafee Elsheikh - George\nBorn in Sudan, Elsheikh, 33, grew up in West London and is the final member of the four British terrorists who fled to join ISIS.",
    "Among specific murders the prosecution alleges Kotey and Elsheikh were involved in was that of Mueller, who was seized and detained by Islamic State militants in August 2013.",
    "Pictured right: US aid worker Peter Kassig - otherwise known as Abdul-Rahman Kassig - in Syria\n+18\nView gallery\n+18\nView gallery\nLeft: US freelance journalist Steven Sotloff.",
    "In 2012, he left for Syria where the US claims he was involved in beheadings and known for administering 'exceptionally cruel torture methods', including electronic shocks.",
    "In pretrial arguments, defense lawyers sought unsuccessfully to have Elsheikh's confessions to interrogators and journalists tossed out, saying they were made under duress.",
    "'You are negotiating for the life of your only son and time is a factor,' they wrote to the parents, accompanying their words with photos or videos of executed hostages.",
    "Elsheikh is a British national charged with taking a leading role in the Islamic State kidnapping scheme that took more than 20 Westerners hostage between 2012 and 2015.",
    "The terrorist, who was born in Kuwait and grew up in Queen's Park, West London, was charged with 27 counts of murder and five counts of hostage taking in November 2014.",
    "The judge, confused, asked him to explain the meaning of 'posh banker', forcing the aid worker to clarify the British vulgarity 'w**ker', which is uncommon in America.",
    "When Elsheikh and the other militants learned that a European hostage was marking his twenty-fifth birthday, they ensured they inflicted exactly 25 blows, Gibbs said.",
    "The indictment says that beginning about October 2014, Mueller was sexually abused by the late Islamic State leader Abu Bakr al Baghdadi while held captive in Syria.",
    "Elsheikh, 33, is accused of being involved in the murders of American journalists James Foley and Steven Sotloff and relief workers Peter Kassig and Kayla Mueller.",
    "Elsheikh and Kotey are accused of inflicting electric shocks with a taser, forcing hostages to fight each other, 20-minute beatings with sticks and waterboarding.",
    "'James, Peter, Kayla and Steven were kidnapped, tortured, beaten, starved, and murdered by members of the Islamic State in Syria,' they said in a joint statement.",
    "Motka said that George ‘always spoke about Guantanamo’ and that the horrific beatings and mistreatment were ‘his idea of what conditions in Guantanamo were like’.",
    "They learned to speak surreptitiously about their captors, who wore mask and took pains to conceal their identity, since they never knew what would set them off.",
    "MacMahon said surviving hostages have different recollections about each of the Beatles and their characteristics, and about whether there were three or four.",
    "Kotey pleaded guilty last year to federal charges of hostage-taking resulting in death and providing material support to terrorists, and faces life in prison.",
    "In 2014 his wife, Amal el-Wahabi, was convicted of funding terrorism after she persuaded a friend to try and smuggle £16,000 in cash in her underwear to him.",
    "'That we have got to this point feels like a miracle,' she told the newspaper earlier this week before she travelled to Virginia from her home in Perthshire.",
    "Motka said it happened in the prison he dubbed ‘The Box’ with other prisoners John Cantlie, a Brit, James Foley, an American, and David Haines, another Brit.",
    "Ms Haines says that as much as she wants to see Elsheikh see justice, she is also hoping that he will finally reveal the location of her father's body.",
    "He was an aid worker surveying the needs of refugee camps in March 2013 when he and a colleague, Briton David Haines, were captured and taken hostage.",
    "Motka said that they were barely given any food and if they were it was usually just bread and olives - he and Haines lost dozens of pounds in weight.",
    "His sentencing, originally scheduled for March 4, has been delayed until April 29, spurring speculation that he could be cooperating against Elsheikh.",
    "But, he said, while there was 'no doubt' that Elsheikh had gone to Syria and fought with IS, there also was no evidence he was one of the 'Beatles.'",
    "The third member of the cell, Mohammed Emwazi, a British citizen who oversaw the executions known as 'Jihadi John', died in a drone strike in 2015.",
    "Relatives of James Foley, Kayla Mueller, Steven Sotloff and Peter Kassig glared at El Shaffe Elsheikh at the federal court in Alexandria, Virginia.",
    "Prosecutors claim Elsheikh was part of an infamous ISIS cell called The Beatles which captured dozens of Westerners in Syria between 2012 and 2015.",
    "The physical abuse they dished out was 'unrelenting and unpredictable' and they 'seemed to get satisfaction from physically abusing the hostages'.",
    "He said he and other hostages at the box then endured a lengthy 'regime of punishment' that included regular beatings and forced stress positions.",
    "Alexanda Kotey\nAlexanda Kotey - Ringo\nKotey, 38, was born to a Ghanaian father and a Greek Cypriot mother and grew up in Shepherd's Bush, London.",
    "Detailing the abuse that began after his capture in March 2013, he recalled: 'They said I was a posh w**ker because I went to boarding school.",
    "'They played lots of games with us,' Motka said, maintaining composure as he clearly struggled with the emotions of describing his captivity.",
    "Motka testified that there were at least three Britons in the group of captors, and the hostages nicknamed them 'John,' 'George' and 'Ringo.'",
    "Diane Foley, James Foley's mother, attended the trial on Wednesday and said it was important to her that the judicial process be carried out.",
    "Motka said that all of them were so tired and weak they were ‘barely able to lift our arms’ but they were still forced to fight for an hour.",
    "The British Government wanted him tried in the US, where officials believe there is a more realistic chance of prosecution than in the UK.",
    "Surviving hostages will testify that Elsheikh and Kotey were more likely than regular day-to-day guards to hand out beatings, Gibbs said.",
    "Life became far worse about a month into his captivity when he was blamed for a Syrian captive's efforts to escape from an adjacent cell.",
    "MacMahon also said Elsheikh's numerous admissions in media interviews about his role in the hostage-taking scheme should be disregarded.",
    "Motka said that the abuse at the hands of The Beatles ranged from the ‘ridiculously childish’ like nipple twisting up to waterboarding.",
    "One of the few times they were allowed to shower, Motka saw blue bruises all over the muscular part of Haines’ body from the beatings.",
    "'Their goal is to motivate people to launch attacks against Western targets wherever they are, using any means available,' Wray said.",
    "Two years later the group released a video showing Mohammed Emwazi, the leader of The Beatles known as 'Jihadi John' , beheading him.",
    "Mueller's family received an email from Islamic State fighters in February 2014, confirming her death in Syria, the indictment says.",
    "Mueller was forced into slavery and raped repeatedly by the Islamic State´s leader, Abu Bakr al-Baghdadi, before she too was killed.",
    "'Don't do it for me, do it for my son, who can finally say goodbye to his grandad,' she told the newspaper, reading from her draft.",
    "If the Britons came into contact with hostages, they were supposed to kneel down, face the wall and avoid eye contact at all times.",
    "For the opening statements Foley's mother Diane and father John sat in one of the benches of the courtroom in Alexandria, Virginia.",
    "John Foley at times closed his eyes while Diana Foley took notes, only pausing when the prosecution described her son's execution.",
    "Also present in court was Bethany Haines, the daughter of British aid worker David Haines, another alleged victim of The Beatles.",
    "Under his plea agreement, Kotey will serve 15 years in jail in the US and then be extradited to Britain to face further charges.",
    "Ringleader Mohammed Emwazi, a British citizen who oversaw the executions known as 'Jihadi John', died in a drone strike in 2015.",
    "He is also accused of acting as an ISIS recruiter who convinced a number of other British extremists to join the terror group.",
    "Four Americans - journalists James Foley and Steven Sotloff and aid workers Peter Kassig and Kayla Mueller - were among them.",
    "Wray and Demers said the support of the British government was critical to moving the investigation and prosecution forward.",
    "Giving the Telegraph a preview, she said it would say that Elsheikh's alleged killings had nothing to do with his religion.",
    "Emwazi was killed in a drone strike, and Kotey was captured alongside Elsheikh and also brought to Virginia to face trial.",
    "Emwazi was killed in a drone strike, and Kotey was captured alongside Elsheikh and also brought to Virginia to face trial.",
    "Even hostages about to be released after paying a ransom were given 'going-away beatings' by the British men, Gibbs said.",
    "FBI Director Christopher Wray said Islamic State is still trying to radicalize people in the United States and elsewhere.",
    "Motka said: ‘They called it the Royal Rumble’, referring to the annual wrestling event produced by US wrestling body WWE.",
    "Once the jumper absorbs the water you start to lose oxygen…water starts to get into your lungs and you start to choke’.",
    "James Foley, a journalist, 40, from New Hampshire, was seized by ISIS in 2012 while reporting on the conflict in Syria.",
    "Elsheikh and Alexanda Kotey, were captured in January 2018 by Kurdish forces in Syria while trying to escape to Turkey.",
    "The former tube driver, who has drug-dealing and firearms convictions to his name, converted to Islam while in prison.",
    "The group paraded their victims in orange jumpsuits in gruesome videos shared online which showed them being beheaded.",
    "Motka's use of the term 'posh w**ker' set off a brief period of uncomfortable laughter and confusion in the courtroom.",
    "He was beaten that night with a rubber cable for an hour, and transferred to a facility the hostages dubbed 'the box.'",
    "The confused judge was then told that 'w**ker' is a British swearword derived from a slang term used for masturbation.",
    "Before his radicalization, he is thought to have worked as a drug dealer before converting to Islam in his early 20s.",
    "He said Elsheikh, who was known as both 'Ringo' and 'George', had 'knowingly conspired' to take Westerners hostage.",
    "Kotey was captured in Syria while trying to escape to Turkey in 2018 and was held in a US military center in Iraq.",
    "Bethany, who had flown from Scotland to be at the trial, shook her head in disgust as Elsheikh walked into court.",
    "'George,' another man named Abu Mohamed and a third nicknamed 'the punisher' regularly tortured them, Motka said.",
    "He has been linked to the killings of a number of hostages after heading to Syria to join the extremist group.",
    "Aine Lesley Davis, the fourth member of the group, was convicted in Turkey on terrorism charges and jailed.",
    "Aine Lesley Davis, the fourth member of the group, was convicted in Turkey on terrorism charges and jailed.",
    "+18\nView gallery\n+18\nView gallery\nPictured left: James Foley while covering the civil war in Aleppo, Syria.",
    "Only two accused members of the four-man cell, Elsheikh and Alexanda Kotey, are being prosecuted in the US.",
    "Kassig's parents Edward and Paula were in court - Paula sat taking notes throughout the opening arguments.",
    "That to me is the huge contrast,' she said, referring to the treatment of her son and the other hostages.",
    "They had spoken movingly at the Republican National Convention in 2020 about their daughter's captivity.",
    "He noted that the British speakers were careful to always wear masks, making identification difficult.",
    "Serup testified that the captors told Ottosen the beating was a 'farewell present not to forget them.'",
    "Motka said that it felt ‘terrible’ and was the ‘worst thing that could happen up until that point’.",
    "Admitting that he was a 'Beatle' was a way to ensure transfer into Western custody, MacMahon said.",
    "'Now our families can pursue accountability for these crimes against our children in a US court.'",
    "Prosecutor Dennis Fitzpatrick asked if The Beatles did a ‘play by play’ commentary of the fight.",
    "The jury saw photos of huge bruises on Ottosen's arm and back after he was finally released.",
    "'George was the most crazy one,' the El Mundo journalist said of his former captor Elsheikh.",
    "Carl said: 'The operators named themselves 'Task Force 814' after Aug. 14, Kayla's birthday.",
    "The judge said the evidence was overwhelming that Elsheikh's confessions were given freely.",
    "At the RNC Carl said: 'Kayla was mostly held in a 12-by-12 cell in solitary confinement.",
    "The 24-year-old has prepared a victim impact statement which she plans to read in court.",
    "'They said I was a posh w**ker because I went to boarding school,' Motka testified.",
    "Her parents sat in the second row and stared intently on the first day of the case.",
    "Her letter will implore him to give up the location not for her, but for her son.",
    "A dispute over bathroom hygiene prompted a particularly intense beating, he said.",
    "Kotey pleaded guilty last year in a plea bargain that calls for a life sentence.",
    "Prosecutors have said in court that Elshiekh is the one who was nicknamed Ringo.",
    "'The Trump team gave us empathy we never received from the Obama administration.",
    "'If a hostage looked at any of the three men, they would be beaten,' Gibbs said.",
    "Kotey pleaded guilty last year in a plea bargain that calls for a life sentence.",
    "Usually, public discussion has centered on four captors known as 'the Beatles.'",
    "We needed to come and immediately respond' to the dog name to avoid a beating.",
    "He said that Elsheikh and the Beatle called John used to ‘egg each other on’.",
    "He was extradited last year and was charged with a number of terror offences.",
    "Right: Kayla Mueller is shown after speaking to a group in Prescott, Arizona.",
    "MacMahon said there was 'no dispute' about the horror of the captives' fate.",
    "At that point George would always stop the process and say: ‘That’s enough’.",
    "The ISIS militants 'were utterly terrifying' to the hostages, Gibbs said.",
    "His 14 months in captivity were the longest of any hostage in the group.",
    "He read emails to the young man's family demanding ever higher ransoms.",
    "'They said I was arrogant, and they were going to take me down a peg.'",
    "'They said I was arrogant, and they were going to take me down a peg.'",
    "Motka explained that the phrase implies someone is 'a bit of a d**k'.",
    "The families of Foley, Kassig, Mueller and Sotloff welcomed the news.",
    "Kotey pleaded guilty in September 2021 and is facing life in prison.",
    "Among them, Elsheikh was known specifically as 'Ringo', Gibbs said.",
    "He was warned before the transfer: 'You don't know punishment yet.'",
    "Whoever they deemed to have lost the fight would be waterboarded’.",
    "He was killed in a Hellfire missile drone strike in Syria in 2015.",
    "He was one of 13 children his father had by four different women.",
    "He continued: ‘They were so excited, it was the event of the day.",
    "Motka's words prompted a ripple of laughter around the courtroom.",
    "Other accounts have alleged that he was the one known as George.",
    "She said she was 'surprised' by the defense's opening statement.",
    "The leader of ISIS, Abu Bakr al-Baghdadi, raped her repeatedly'.",
    "The Obama administration said it was doing everything it could.",
    "The fourth, Aine Davis, is serving a prison sentence in Turkey.",
    "They ordered us to get into a tag team style boxing match.",
    "'In fact, they did not have to do anything to be beaten.'",
    "He faces an unconditional sentence of life imprisonment.",
    "He was beheaded in 2014 after being held in captivity.",
    "He said: ‘It was like school kids bullying someone’.",
    "If you were too tired you had to tag yourself out’.",
    "In court were his father Arthur and mother Shirley.",
    "And they named the mission Operation Kayla Mueller.",
    "'I think we must do the opposite of what was done.",
    "ISIS terrorists shined bright lights in her face.",
    "I was trying to breathe out the side of my mouth.",
    "He said: ‘James passed out, John passed out.",
    "Foley, Sotloff and Kassig were decapitated.",
    "He said: ‘You start to panic a little bit.",
    "Motka was not released until May 25, 2014.",
    "‘James and John were against me and David.",
    "The Trump administration actually is'.",
    "Her death was confirmed in 2015.",
    "They beat her and tortured her.",
    "Kayla was looking down on you.",
    "To those soldiers: thank you.",
    "'They gave us dog names.",
    "David nearly passed out.",
    "It was cold and dirty.",
    "They shaved her head.",
    "Advertisement"
  ]
}