{
  "id": 1837,
  "mediaId": 4024,
  "date": "2022-04-07",
  "headline": "Ex-bishop of Albany admits reassigning clerical sex abusers because he feared ‘scandal’",
  "image": "https://www.lifesitenews.com/wp-content/uploads/2022/04/Bishop-hubbard.jpg",
  "link": "https://www.lifesitenews.com/news/ex-bishop-of-albany-admits-reassigning-clerical-sex-abusers-because-he-feared-scandal/",
  "mediaOutlet": "LifeSiteNews",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael\nHaynes",
  "authorUrl": "https://www.lifesitenews.com/author/michael-haynes/",
  "termIds": [
    0
  ],
  "sentences": [
    "LaFave was supported by Jeff Anderson, an attorney for the survivor who sought the release of the deposition, who stated: “Bishop Hubbard’s testimony reveals decades of decadence, denial and deception at the peril of so many innocent, trusting children, in his own words.”\nHubbard defended his policy in a 2021 article in The Times Union, saying that priests only returned to ministry “when a licensed psychologist or psychiatrist determined the priest was capable of returning to ministry without reoffending.”\n“We as a society now better understand the compulsive, addictive nature of sexual abuse of minors,” Hubbard wrote.",
    "The wounds persist, the accompaniment continues, the denial and cover up does not.”\nThe diocesan spokesman added that “while we cannot offer detailed information on historic events that occurred long ago, we can with absolute conviction say that the Roman Catholic Diocese of Albany takes all allegations of abuse seriously and remains committed to uncovering the truth without fear or favor.”\n“The Diocese has and continues to resolve pending claims of victims/survivors in mediations with the assistance of the court,” he said.",
    "Over $2.4 million was paid to the investigator, Mary Jo White, and her firm – more than the total of $2.3 million that the Diocese of Albany had at that time paid to “the survivors of sexual abuse by clergy.”\nPriests admitted to abusing children, then reassigned to ministry\nThe newly released testimony documents how Hubbard received complaints and allegations about 11 priests between 1977 and 2002, regarding the sexual assault of children.",
    "“While we never condoned, ignored or took lightly sexual abuse of minors, we did not respond as quickly, as knowledgeably and as compassionately as we should have, and for that I am sincerely sorry.”\nBishop Hubbard’s 37-year reign\nHubbard was noted for his “progressive views” on a range of matters, including “drug addicts and prisoners, and advocacy of sometimes unpopular social justice issues” and his support for LGBT advocates.",
    "Hubbard declared that a number of priests “admitted” to him that they had indeed abused children, and that he then reassigned them to some form of active ministry after a period of “treatment.”\nHubbard led the Albany diocese from 1977 to 2014, having been the youngest bishop in the U.S. when he was appointed by Pope Paul VI.",
    "Hubbard continued his 2004 denial of any such abuse, saying “I can only declare with absolute certitude that I was never their abuser or the abuser of anyone else.”\nIn 2011, Hubbard made headlines when he weighed in on the question of giving Holy Communion to pro-abortion New York state governor, Andrew Cuomo.",
    "Cynthia LaFave, an attorney representing some of the plaintiffs, told the AP that the testimony “will be read with horror by the public.” “The public will see the culpability of the Diocese in perpetuating a culture of sex abuse by priests that was allowed to continue for decades,” she added.",
    "Bishop Hubbard told the testimony that in light of this, he was “totally brokenhearted.”\nHe stated:\nIt is the worst experience I ever had in my life as a priest and as another human being and I, looking back, wish I had done things differently at an earlier stage of my life as a bishop.",
    "ALBANY, New York (LifeSiteNews) – The former bishop of Albany, Bishop Howard Hubbard, has acknowledged that he covered up clerical sex abuse of children, due to concern over “scandal and respect for the priesthood,” and even reassigned abuser priests to ministry.",
    "The many pages of evidence, given under oath, document a consistent record of Bishop Hubbard shielding alleged abuser priests from public scrutiny, in order to safeguard their reputation and that of the Church.",
    "David Bentley had admitted to the bishop that he had indeed abused a child, but Hubbard did not report the matter to the police, since he was “not a mandated reporter.”\nAnother instance was the case of Fr.",
    "LifeSiteNews contacted the Diocese of Albany for comment, and a spokesman replied saying that the diocese’s “priority is the protection and assistance of victim/survivors and the discovery of the truth.",
    "Of the 11 priests Hubbard mentioned by name in the testimony, nearly all admitted to Hubbard that they had abused children, were sent to “treatment” by the bishop, and subsequently reassigned.",
    "However, while such records were kept by the diocese, Hubbard revealed that he did “not necessarily” keep or make personal notes “of reports of sexual abuse by clerics” under his authority.",
    "Bishop Hubbard, 83, made the revelations in a four-day testimony in April 2021, in response to “dozens of claims filed under New York’s Child Victims Act,” reported the Associated Press.",
    "Hubbard noted in his “shockingly frank deposition” that the priests’ absences would sometimes be explained as being for “health reasons.”\nIn his testimony, Hubbard recounted how one Fr.",
    "Bishop Hubbard did not report these allegations to the police, but instead sent the priests for “treatment,” although he did not inform their parishioners what the treatment was for.",
    "Carl Stone: Unlike most of the other priests, who were complained about to the bishop by parents, Stone was reported by state troopers for sexual abuse of a child.",
    "Since 2004, a growing number of lawsuits have been filed claiming that he abused teenage boys and girls, along with a 10-year-old boy, during the 1970s and 90s.",
    "John Fitzpatrick: “Admitted” to abusing and then sent to “treatment.” Was later reassigned to ministry but in a curial setting, not in a parish.",
    "Such a stance meant that he “clashed” with Popes John Paul II and Benedict XVI, reported The Times Union at the time of Hubbard’s resignation.",
    "Hubbard said he had no intention of denying Cuomo the sacrament, despite Cuomo being divorced and living with his girlfriend at the time.",
    "“We have settled claims with the intent to provide assistance to victims/survivors through mediation with their attorneys and the court.”",
    "Towards the end of his tenure, a number of allegations began to be made, both against him and against other priests of the diocese.",
    "James Rosch: “Admitted” to abusing a young boy, and was sent to “treatment.” Was later reassigned to unspecified “ministry.”\nFr.",
    "The details of these priests were kept in diocesan “sealed files,” recounted Hubbard, and numbered between 11 or 13 in total.",
    "I am mortified to have to talk about these things, and I am glad they are finally being addressed in an appropriate fashion.",
    "Nearly 700 pages of transcripts from the testimony were unsealed March 25, 2022 by order of the Albany County Supreme Court.",
    "Hubbard also attested that in nearly all the cases, he did not ask the priests the number of the children they had abused.",
    "Mark Haight: He “admitted” to a “number of cases” and was reassigned to ministry after “treatment,” but later removed.",
    "Hubbard strenuously denied this, and an investigator the diocese hired later cleared Hubbard of the allegations.",
    "Edward Leroux: “Admitted” to abusing and sent to “treatment.” Later reassigned to unspecified “ministry.”\nFr.",
    "‘Decades of decadence’\nIn total around “300 victims of child sexual abuse” have contacted the investigation.",
    "He was sent to “treatment” and then reassigned to a parish, without the parishioners knowing his past.",
    "Was sent to “treatment” by the bishop and later placed back in ministry “in a hospital setting.”\nFr.",
    "James McDermott: “Admitted” to abusing, but after his “treatment” decided to resign from ministry.",
    "In 2004, Bishop Hubbard was himself accused of having engaged in homosexual activity in the 1970s.",
    "Rosch to active ministry without informing the priest’s new parishioners about Rosch’s past.",
    "James Rosch, who also “admitted” to the bishop that he had sexually assaulted a young boy.",
    "Joseph Mancusco: Found “guilty” by the diocese, and offered “treatment,” which he refused.",
    "A summary of the details of some of the priests Hubbard mentioned is provided below:\nFr.",
    "It seems that he reoffended, although “not after [he] returned to ministry.”\nFr.",
    "Hubbard sent Rosch to a treatment center, which later signed Rosch off.",
    "He “reoffended” within “weeks” and was then removed from ministry.",
    "David Bentley: “Admitted” to Hubbard that he had abused a child.",
    "Edward Pratt: “Admitted” to “more than one” victim.",
    "He was sent to “treatment” and then reassigned.",
    "Then removed from ministry.",
    "Hubbard then returned Fr.",
    "Fr.",
    "Fr.",
    "Fr.",
    "Fr."
  ]
}