{
  "id": 1848,
  "mediaId": 4045,
  "date": "2022-03-23",
  "headline": "Former Falcons quarterback Matt Ryan ‘disappointed,’ but ready to move on",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?crop=375%2C375%2C30%2C0&resize=200%2C200&order=crop%2Cresize",
  "link": "https://www.stltoday.com/sports/football/former-falcons-quarterback-matt-ryan-disappointed-but-ready-to-move-on/article_cad2138e-d1dd-596f-8813-af93d7af11ae.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1314,
    1593,
    1887,
    2641,
    4496,
    4593,
    4729,
    93,
    671,
    1030
  ],
  "sentences": [
    "When they do, it’s about how you respond and how you react.”\nRyan was the third overall selection in the 2008 NFL draft and helped turn around the Falcons franchise, which was coming off a turbulent 2007 season that saw then-quarterback Michael Vick go to federal prison on charges related to dogfighting and coach Bobby Petrino quit with three games left in the season.",
    "“Obviously, I’m so thankful for my time there and appreciate the way things were handled and their professionalism with it.”\nRyan believes he’s with a team that can compete for the Super Bowl and that the Falcons can start rebuilding for the future.",
    "Ryan plans to keep his recently built new home and continue his social action in the city, but Monday, after 14 seasons with the Falcons, Ryan was traded to the Indianapolis Colts for a third-round pick in the coming NFL draft.",
    "Sometimes it’s best for both places.”\nFormer Falcons assistant head coach/wide receivers Terry Robiskie said he saw Ryan a couple of weeks ago at former Falcon Roddy White’s wedding and that Ryan had no idea he would be traded.",
    "It’s a good-bye in that I’m not playing there, but it’s a relationship that I’m always going to have.”\nRyan turned into the most prolific passer in team history, shattering all of Steve Bartkowski’s passing marks.",
    "“You have a ton of people who love Matt and some who don’t, I don’t know why or for whatever reason,” said former Falcons wide receiver Harry Douglas, who also was drafted by the Falcons in 2008.",
    "“Yes, the organization is going in a different direction, but let’s not bash this man, who for 14 years gave you everything that he had on that football field.”\nThe next Bengals?",
    "Matt Ryan, the greatest player in history of the Falcons, came to grips with the fact that his work in Atlanta and at the $1.5 billion Mercedes-Benz Stadium was done.",
    "Ryan spoke with Falcons owner Arthur Blank, general manager Terry Fontenot and coach Arthur Smith before heading to Indianapolis on Tuesday morning.",
    "He’s in new city, and it’s a different world.”\nThe Falcons pursued a trade for former Houston Texans quarterback Deshaun Watson, but came up short.",
    "They have not had a winning season since 2017, and coach Dan Quinn and general manager Thomas Dimitroff were fired five games into the 2020 season.",
    "“I think all of those guys, there is a level of respect on both sides with all three of them.”\nRyan worked with Fontenot and Smith for one season.",
    "I was able to have a meeting with the staff here in Indianapolis and front office on Saturday.”\nRyan took some time to reflect.",
    "But the Cleveland Browns came in with a fully guaranteed five-year, $230 million contract that the Falcons didn’t match.",
    "Ryan guided the Falcons to the NFC Championship game after the 2012 season and to the Super Bowl after the 2016 season.",
    "“When everything went down, I just made the request that I could take a look at what the options were available to me.",
    "“It’s always disappointing at first,” Ryan told The Atlanta Journal-Constitution in an exclusive interview Tuesday.",
    "No one from the Falcons has publicly discussed the trade and why they received only a third-round pick for Ryan.",
    "“It was hard because I appreciate all of the fans and how kind they’ve been to me during that time,” Ryan said.",
    "Watson was traded to Cleveland on Friday, and Ryan was meeting with the Colts’ coaching staff Saturday.",
    "The team was considered the favorite to land Watson, a former Gainesville High School and Clemson star.",
    "Ryan came in and won games immediately and became a pillar of the community through his charity work.",
    "The chance he gave me in 2008, the consistent support that he provided during that time.",
    "But the Falcons, because of some poor drafting from 2017-20, have fallen on hard times.",
    "Jacksonville Jaguars\nChicago Bears\nWashington Commanders\nNew York Giants\nNew York Jets",
    "I’m a Georgia boy.’ That was two weeks ago, and bam, the NFL comes up and is the NFL.",
    "“Obviously, my relationship goes the farthest back with Arthur Blank,” Ryan said.",
    "He led the franchise to its first back-to-back winning seasons in 2008 and 2009.",
    "“They are moving on and trying to head in a different direction,” Ryan said.",
    "“By Monday I’d made the decision that it was time to move on,” Ryan said.",
    "But as you go through it, you understand that those things can happen.",
    "“So, Monday I knew that the trade was going to go through,” Ryan said.",
    "“He was excited that he’d just built him a new house,” Robiskie said.",
    "He won the NFL’s Most Valuable Player award for the 2016 season.",
    "“But we have to give him his respect because his respect is due.",
    "It’s funny how quickly we forget what somebody meant to us.",
    "Five NFL teams that could make a surprise run in 2022.",
    "Even the rival New Orleans Saints had conceded.",
    "“Yeah, and they all were great,” Ryan said.",
    "He’s been so great for this organization.",
    "Some of the fans had begun to bash Ryan.",
    "I love him for the opportunity he gave.",
    "Two weeks later he’s in a new town.",
    "He said, ‘I put my roots down.",
    "“That’s a very human reaction.",
    "“It’s hard to see people go.",
    "They did issue statements.",
    "It’s hard to move on.",
    "“That was it.",
    "“I love him."
  ]
}