{
  "id": 1940,
  "mediaId": 2586,
  "date": "2022-03-20",
  "headline": "Details Emerge on Team-Friendly Deal for New Bills Quarterback",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Case-Keenum-e1647814466668.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/case-keenum-bills-contract-details/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1795,
    2249,
    2613,
    3583,
    4421,
    160,
    217,
    636,
    823
  ],
  "sentences": [
    "I feel pretty good that we’re going to find the right fit.”\nIt appears the #Bills will bring back Matt Barkley as backup QB: https://t.co/4sjjInY8vw\nThe Bills had lost all depth behind Allen in a matter of months, with the New York Giants plucking 2020 draft pick Jake Fromm off the practice squad late in the season after starter Daniel Jones went down with what became a season-ending injury.",
    "Though the Bills ended up making one of the biggest splashes, drawing Von Miller away from the Los Angeles Rams, they have also added a number of cap-saving moves like cutting wide receiver Cole Beasley and linemen Jon Feliciano and Daryl Williams, along with restructuring the contracts of Matt Milano and Micah Hyde to create more space.",
    "Keenum’s Team-Friendly Deal\nThe former Minnesota Vikings starter was initially due for a $6.1 million base salary in 2022, along with a prorated signing bonus of $1.33 million for a total cap hit of $8.4 million, Cleveland.com‘s Mary Kay Cabot report.",
    "#BillsMafia pic.twitter.com/I8LXmJo4Ev\n— Buffalo Bills (@BuffaloBills) March 20, 2022\nBills general manager Brandon Beane had made it clear before free agency began that the Bills wouldn’t have room for many big moves.",
    "The Giants later signed Bills practice squad quarterback Davis Webb after the season ended, and Trubisky’s one-year contract came to an end with no plans to keep him in Buffalo.",
    "The move helped to fill the void left when Mitch Trubisky left to join the Pittsburgh Steelers, and a new report shows that it comes at a very reasonable price for the Bills.",
    "Beane said earlier this offseason that Allen’s mobile style of play leaves him at a higher risk of injury, which creates the need for a capable and steady hand behind him.",
    "On March 19, the Bills addressed their lack of depth behind Josh Allen by trading for Case Keenum, sending a seventh-round pick to land the seasoned backup.",
    "ESPN’s Alaina Getzenberg reported that the team is in negotiations to re-sign quarterback Matt Barkley, who was Allen’s backup from 2018 to 2021.",
    "Since’s Allen’s breakout season in 2020, the Bills have prioritized bringing in top-end backups as something of an insurance policy.",
    "“That’s his play style, that’s why we love him, but a backup quarterback is very important knowing the way he plays the game.”",
    "She also reported that Keenum was expected to restructure his deal, and details have now emerged from ESPN’s Field Yates.",
    "“Keenum is now due a base salary of $3.5M, which makes acquiring him more palatable for the Bills from a cap perspective.",
    "“Case Keenum has agreed to a restructured deal as part of the trade to the Buffalo, per source,” he tweeted.",
    "“I’ve got some things in the works for there,” Beane said Friday regarding the team’s quarterback depth.",
    "More Quarterback Help Could Be Coming\nThe Bills may not be done adding help behind Allen.",
    "“Hopefully early next week we’ll have that resolved, but [I] do have some things.",
    "We’ve acquired QB Case Keenum from the @Browns for a 2022 7th round draft pick.",
    "The Buffalo Bills will be getting quite a deal out of their newest quarterback.",
    "“The only time I ever get on Josh is for taking unnecessary hits,” Beane said.",
    "He recently earned a $1M roster bonus from Cleveland.”\n??",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "It’s an important position.",
    "TRADE ALERT ??"
  ]
}