{
  "id": 1972,
  "mediaId": 2586,
  "date": "2022-03-30",
  "headline": "Ex-Eagles QB Leads List of Best Remaining Free Agents",
  "image": "https://heavy.com/wp-content/uploads/2021/08/NickMullens-e1630432915758.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/philadelphia-eagles/nick-mullens-free-agent/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Greger",
  "authorUrl": "https://heavy.com/author/mikegreger/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The parity is so tight that anything that bumps your course off can affect you and so communication is one of those things, and it’s been awesome working with Howie to help build a team that can get back to the playoffs and do damage in the playoffs.”\n— Philadelphia Eagles (@Eagles) March 29, 2022",
    "“You hear about Eagles fans, Eagles tradition, Eagles history, I’ve always thought the helmet was one of the coolest in football,” Mullens said at camp, via Eagles Insider Dave Spadaro.",
    "That’s what you do.”\nHowie Roseman, Nick Sirianni Attached at the Hip\nMany fans were miffed when the Eagles handed Howie Roseman a three-year contract extension.",
    "“I love the fact that I’m going to be working side by side with him [Roseman] for the next three years and hopefully more,” head coach Nick Sirianni said.",
    "“Every organization I guess is different, but the due diligence tells you exactly if that player is a smart acquisition for you, in every way possible.",
    "Remaining free agent QBs:\nMike Glennon\nCam Newton\nGeno Smith\nJake Fromm\nNick Mullens\nBlaine Gabbert\nJosh Rosen\nRyan Fitzpatrick\nJosh Dobbs\nA.J.",
    "Yes, he was the architect behind the 2017 Super Bowl championship but he had to tear down the mistake-riddled roster he built to do that.",
    "“So being able to wear the helmet and work with these coaches in this environment, which is filled with energy, it’s been great so far.",
    "— Zach Berman (@ZBerm) March 29, 2022\nThere was even a rumor that team owner Jeffrey Lurie gave his approval to green-light a deal.",
    "On Tuesday, Lurie side-stepped questions about Watson and offered only that the franchise does its “due diligence” on all players.",
    "The Cleveland Browns might need to keep Nick Mullens’ locker stall safe, just in case the NFL decides to suspend Deshaun Watson.",
    "The 27-year-old went 16-of-29 for 129 yards with 4 interceptions for a 27.0 QBR in three preseason games before getting cut.",
    "Jeffrey Lurie Side-Steps Watson Question\nThe Eagles may have flirted with trading for Watson before he landed in Cleveland.",
    "McCarron https://t.co/3D5ND2SWYh\nWhen the Eagles got Mullens ahead of camp, it was widely lauded as a great depth signing.",
    "Philadelphia eventually cut Mullens and traded for Gardner Minshew, not before supplying Mullens with some nice memories.",
    "Lurie would have addressed whether the Eagles would have traded for Deshaun Watson had he wanted to come to Philadelphia.",
    "He was coming off successful elbow surgery and the thought was he could possibly push Joe Flacco for the backup spot.",
    "Mullens, of course, spent 2021 training camp with the Philadelphia Eagles where he couldn’t get out of his own way.",
    "They hired an investigator to explore his legal troubles, according to reports, and checked in on the asking price.",
    "He said they do due diligence on every player, and the red light/green light becomes apparent during that process.",
    "A lot of teams could do worse than a guy who ranks second to Patrick Mahomes in a random statistical category.",
    "And the four years since that title have seen mostly heartbreak despite three playoff appearances.",
    "“It becomes clear through the due diligence what you should do,” Lurie said, via Philly Voice.",
    "Cleveland picked Mullens up to serve as third-stringer behind Baker Mayfield and Case Keenum.",
    "Former Eagles QB Nick Mullens posted a zero passer rating in the first preseason game.",
    "I’m working hard and feeling good.”\nSavor the Nick Mullens era while you can, friends.",
    "The free-agent quarterback remains one of the best backup options on the market.",
    "Either way, Philadelphia is sticking with their embattled general manager.",
    "pic.twitter.com/BTpzmAAodA\nThe latest Eagles news straight to your inbox!",
    "Join the Heavy on Eagles newsletter here!",
    "But wouldn't address Watson specifically.",
    "The Browns let him walk in free agency.",
    "I’ve enjoyed every bit of it.",
    "That didn’t happen."
  ]
}