{
  "id": 1987,
  "mediaId": 2551,
  "date": "2022-03-22",
  "headline": "Children's home carer, 26, caught having a sexual relationship with 17-year-old boy at work and wearing 'inappropriate' hot pants shares photos with her new girlfriend on Facebook",
  "image": "https://i.dailymail.co.uk/1s/2022/03/22/14/55658089-0-image-a-6_1647958380630.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10639779/Childrens-home-carer-caught-having-relationship-boy-17-shares-photos-new-girlfriend.html?ns_mchannel=rss&ito=1490&ns_campaign=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stewart Carr",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Stewart+Carr",
  "termIds": [
    3790,
    5406
  ],
  "sentences": [
    "+4\nView gallery\nJade Fitzpatrick (pictured), 26, was spotted hugging and kissing a teenage boy who was a resident at a children's home where she worked, a hearing was told\n+4\nView gallery\nNow, social media photos show her cosying up to new girlfriend, Kelly Tushingham\n+4\nView gallery\nCaptioned under a picture of the couple cuddling, Fitzpatrick wrote: 'I love you forever my girl.'",
    "Yesterday, in announcing the sanction against her, committee chair Lorna Savidge said that Fitzpatrick had 'brazenly lied' to her prospective employers about being unaware of her suspension, had placed colleagues who had reported her to management in a difficult position and had continued to deny the allegations.",
    "+4\nView gallery\nFitzpatrick (pictured) and the teen allegedly sparked a relationship together - and booked to go on a 200-mile trip from the home to Thorpe Park\nBecause of the risk Fitzpatrick posed the panel decided that her removal from the register should come into effect immediately.",
    "Fitzpatrick had also arranged an overnight trip to Thorpe Park theme park when she had been told not to, engaged with the boy on social media, taken him out on her days off and closed the door after entering his bedroom at night.",
    "Earlier this month Griffiths admitted three charges, including lying to the police and his bosses about having made a recording, and a fourth charge of failing to safeguard YP1 by not reporting his suspicions was found proved.",
    "Earlier this month the panel ruled that her behaviour at a home in Wrexham had been sexually motivated, having changed her shifts to take the teenager on a family visit, while wearing 'inappropriate' hot pants to work.",
    "The relationship between Fitzpatrick and the boy came to light when a neighbour told her bosses that he had seen her and the youth, identified only as 'Young Person 1', kissing and hugging each other.",
    "That, said the panel, also amounted to serious misconduct but the panel found that his fitness to practise was not currently impaired and issued a warning which will remain for three years.",
    "No further police action was taken and she told her then fiancé Matthew Griffiths, who worked for a different care company, after her arrest that there was no truth in the rumours.",
    "Referring to 'serious departures from the code of conduct for social care, she said: 'There is nothing to persuade us that the conduct would not be repeated in future,' she said.",
    "A carer at a children's home who was struck off the social work register for having a sexual relationship with a 17-year-old boy is now in a new relationship.",
    "Jade Fitzpatrick, 26, acted 'deplorably' in breaching the profession's code of conduct, according to a fitness to practice committee of Social Care Wales.",
    "She had shown 'no signs of having an insight' into the seriousness of her conduct and therefore continued to 'pose a risk to others', said Ms Savidge.",
    "Four charges against Fitzpatrick, who did not participate in the hearing, were found proved and said to amount to serious misconduct.",
    "When interviewed by her boss and the police, Fitzpatrick denied the allegations and called them 'horrendous lies'.",
    "Captioned under a picture of the couple cuddling, Fitzpatrick wrote: 'I love you forever my girl.'",
    "Now, social media photos show her cosying up to new girlfriend, Kelly Tushingham.",
    "In reply, Miss Tushingham wrote: 'I love you too.'",
    "In reply, Miss Tushingham wrote: 'I love you too.'"
  ]
}