{
  "id": 2018,
  "mediaId": 2586,
  "date": "2022-03-27",
  "headline": "Bills Coach Hints at Big Change for Josh Allen’s Game Next Season",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Josh-Allen-3-e1648427585724.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-coach-change-josh-allen/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    2849,
    3583,
    125,
    160,
    539
  ],
  "sentences": [
    "“We’re always trying to evolve — on the field, off the field, schematically — and in this case with Josh’s running or the amount of times that we run him, we have to continue to evolve that way and making sure we’re doing right by him by doing right by our team,” McDermott said, via NFL.com.",
    "Bills Aim to Protect Allen\nMcDermott’s vow to take some emphasis off Allen’s rushing game seems to support comments from general manager Brandon Beane earlier this offseason that the team wanted to do a better job of protecting their Pro Bowl quarterback.",
    "But beyond that, always looking for the various pieces.”\nAs Michael David Smith of Pro Football Talk noted, Allen was sacked on just 3.9 percent of dropbacks last season, but that number can be deceiving.",
    "https://t.co/DNXUc69CmW\nWhile Allen has often done damage to opposing defenses on scrambles, racking up rushing yards when a play breaks down, the Bills also utilized a number of designed runs for him.",
    "But his coach said he wants to see Allen focus on the passing game more next season, and is working on a gameplan that will keep him safely in the pocket more often and avoid the risk of injury.",
    "Allen Sticking to the Air\nSpeaking at the NFL Owners Meetings on Sunday, McDermott said he would like to limit the number of times that Allen leaves the pocket to run next season.",
    "They regularly called quarterback sneaks in very short-yardage situations, and also used a number of quarterback sweeps that had Allen attacking the edges behind pulling guards.",
    "That will require gameplans that attack defenses through the air, though McDermott admitted that Allen will still use his feet to get out of trouble and keep defenses honest.",
    "The team parted ways with guard Jon Feliciano and tackle Daryl Williams, meaning they will likely be looking to add at least one lineman in the upcoming NFL Draft.",
    "— Buffalo Bills (@BuffaloBills) March 14, 2022\nThe Bills have already done some work to protect Allen, bringing in veteran guard Rodger Saffold in free agency.",
    "That’s a better question for him, but he doesn’t shy away from mixing it up from time to time.”\nSean McDermott would prefer Josh Allen to run less.",
    "Allen has been one of the best dual-threat quarterbacks over his four seasons in the NFL, rushing for a total of 2,325 yards with 31 touchdowns.",
    "Allen was masterful at avoiding pressure, moving out of the pocket and taking off running when his protection broke down.",
    "Buffalo Bills head coach Sean McDermott wants to see Josh Allen use his talents a little differently next season.",
    "Beane said that it was a priority to beef up the offensive line so Allen could stay safely within the pocket.",
    "So, he’s gonna do it when he’s gonna do it.”\n“I don’t know if he likes to take it,” McDermott added.",
    "\"I wanted to come to Buffalo because of how close I feel this team is to winning a championship.\"",
    "“As I said earlier, I have to make sure the o-line is set and that we’re confident in them.",
    "But the one thing we will never take from Josh is his competitive nature and spirit.",
    "Josh Allen jogs onto the field before a playoff game against the Kansas City Chiefs.",
    "“First thing, I’m going to try and protect him,” Beane said.",
    "“So, we are going to keep a close eye on that.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "“I don’t want to say that."
  ]
}