{
  "id": 2022,
  "mediaId": 2732,
  "date": "2022-03-31",
  "headline": "First Call: Tyrann Mathieu says he got a call from Mike Tomlin; multiple theories on Bruce Arians' latest 'retirement'",
  "image": "",
  "link": "https://triblive.com/sports/first-call-tyrann-mathieu-says-he-got-a-call-from-mike-tomlin-multiple-theories-on-bruce-arians-latest-retirement/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Benz",
  "authorUrl": "https://triblive.com/author/tim-benz/",
  "termIds": [
    1464,
    2609,
    3268,
    3538,
    3686,
    3719,
    3904,
    671,
    823
  ],
  "sentences": [
    "Neither are this week’s quotes from owner Steve Bisciotti, stating that general manager Eric DeCosta “can’t keep calling him and say(ing), ‘Hey, Lamar, you really need to get in here and get this thing done.’ That’s not a GM’s job.”\nThat said, Bisciotti added, “We’ll pay [Jackson] when he’s ready.” He also went on to say, “The kid is so obsessed with winning a Super Bowl that I think, deep down, he doesn’t think he’s worthy.",
    "Rick Stroud of the Tampa Bay Times tweeted that Brady “was informed Bruce Arians planned to step down and Todd Bowles would succeed him as head coach either the same day or a day after the QB announced he was ending his retirement … Team insists it was not related to Brady’s decision.”\nThat’s something Arians continues to deny.",
    "I love my Ravens I don’t know who the hell putting that false narrative out that I’m having thoughts about leaving stop tryna read my mind\n— Lamar Jackson (@Lj_era8) March 30, 2022\nWell, Jackson’s apparent lack of willingness to sign a contract extension isn’t helping.",
    "Arians intimated through Peter King of “Football Morning in America” that he’d likely retire from coaching after the 2022 season ended anyway and that he’s taking a senior consultant’s role to stay with the franchise.",
    "You are a true NFL legend and pioneer for all the work you have done to make the league more diverse and inclusive.”\nSo believe what you want, but the timing of all things in Tampa this offseason has been strange.",
    "Go-Go keeps going\nWhen Penguins defenseman Alex Goligoski was traded to Dallas in the James Neal transaction in 2011, many in Pittsburgh assumed he’d bounce around for a few years and then fade into obscurity.",
    "Terrell Edmunds wasn’t kept as the strong safety next to Minkah Fitzpatrick, although he could be a cheaper option to return if the Steelers decide to avoid bringing Mathieu on board.",
    "I don’t think he is turned on by money that much, and he knows it’s coming one way or the other.”\nSo whatever angst Jackson is getting may not be from Bisciotti’s comments directly.",
    "All that in Thursday’s “First Call.”\nTomlin and Tyrann\nAccording to free agent safety Tyrann Mathieu, he has received a phone call from Steelers coach Mike Tomlin.",
    "Mathieu was explaining that he isn’t sweating over the fact that he is still unsigned, but admits it still gives him a spark when NFL coaches have reached out.",
    "Great relationship off the field.”\nAnd Brady went so far as to say in a lengthy Instagram post, “Thank you, BA for all that you have done for me and our team.",
    "The former Tampa Bay Buccaneers head coach announced Wednesday that he is stepping down, so that defensive coordinator Todd Bowles could be his successor.",
    "He’s like, ‘Hey, this is Mike T.’ Just being able to talk to these guys, it’s a blessing.”\nThe Steelers do have a need at one of their safety positions.",
    "At the start of free agency, Spotrac’s market value calculations projected the “Honey Badger” to sign a contract in the range of $14.8 million annually.",
    "Lamar lets loose\nRavens quarterback Lamar Jackson does not like suggestions that he is at odds with his franchise or tiring of his time in Baltimore.",
    "Although unlike when he was forced out as offensive coordinator with the Steelers, Arians is making it sound like he chose to retire this time.",
    "Now he’s in his 15th NHL season, currently with the Minnesota Wild, and he just signed a contract extension for two years and $4 million.",
    "That’s three points better than the third-place Penguins and three points behind the Metropolitan Division-leading Carolina Hurricanes.",
    "Not so fast, Detroit was up 4-3 on New York with under five minutes left when Chris Kreider scored his 46th goal for the Rangers.",
    "That Brady would unretire — which he eventually did — if Arians left because a rift had developed between him and the coach.",
    "But during an appearance on “The Jordy Culotta Show,” Mathieu referenced a conversation he had with the Steelers coach.",
    "That’s as opposed to eventually shooting down those talking points from the Steelers after the 2011 season.",
    "I think he wants that [title] to say, ‘Now I deserve to be on top.’ People can speculate any way they want.",
    "Since then, though, many others have theorized that the Bucs made a choice between Arians and Tom Brady.",
    "After all, his four years with the Pens were marginal, never exceeding nine goals or hitting 30 points.",
    "Mathieu is coming off of a three-year, $42 million contract he signed with Kansas City in March 2019.",
    "No word yet if another former Penguin, Marc-Andre Fleury, will be in net or if it’ll be Cam Talbot.",
    "The 36-year-old Goligoski has two goals, 26 assists and a team-leading plus-34 rating in 58 games.",
    "I mean, I had conflicts with every player I coached because I cussed them all out, including him.",
    "pic.twitter.com/Ieb6lpEiTM\n— New York Rangers (@NYRangers) March 31, 2022\nThat tied the game.",
    "So, one would assume that the Rangers would barrel over Detroit as well Wednesday night.",
    "You are an incredible man and coach, and it was a privilege to play for you.",
    "A big-name free agent reveals that he has been in touch with the Steelers.",
    "“Just being able to have this time with family, it’s cool,” Mathieu said.",
    "Go figure\nOn Sunday, the Penguins rocked the Detroit Red Wings 11-2.",
    "All emails are subject to publication unless specified otherwise.",
    "But they certainly advanced the conversation Jackson is hearing.",
    "The extent and details of the conversation, he didn’t disclose.",
    "It’s still cool talking to all coaches, the different coaches.",
    "We debate the reasons behind Bruce Arians’ latest retirement.",
    "You can contact Tim at tbenz@triblive.com or via Twitter.",
    "On Tuesday, the New York Rangers edged the Penguins 3-2.",
    "Categories: Sports | Steelers/NFL | Breakfast With Benz",
    "This sounds familiar\nBruce Arians is retiring.",
    "Lamar Jackson is getting testy in Baltimore.",
    "In overtime Andrew Copp won it for New York.",
    "And the New York Rangers just keep winning.",
    "Tim Benz is a Tribune-Review staff writer.",
    "Tom was very in favor of what I’m doing.",
    "Because some of these guys, I’m fans of.",
    "“But I still try to enjoy the process.",
    "Alex Goligoski just keeps on playing.",
    "The Wild host the Penguins Thursday.",
    "So the Rangers now have 93 points.",
    "“No,” Arians said in King’s post.",
    "Mike Tomlin calling your phone.",
    "for Kreids and no better time.",
    "All tweets could be reposted.",
    "Again.",
    "“No.",
    "4?6?",
    "No."
  ]
}