{
  "id": 2040,
  "mediaId": 2584,
  "date": "2022-03-20",
  "headline": "Wonder Boy review – an exhilarating teenage spin on The King’s Speech",
  "image": "https://i.guim.co.uk/img/media/ff654e9e127faaa904ba7c8cd9d1fe7302e4ead3/0_8_6375_3825/master/6375.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tcmV2aWV3LTQucG5n&enable=upscale&s=9f4a2afe5f19ffb6e71f35f46510ac90",
  "link": "https://www.theguardian.com/stage/2022/mar/20/wonder-boy-review-an-exhilarating-teenage-spin-on-the-kings-speech",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clare Brennan",
  "authorUrl": "https://www.theguardian.com/profile/clare-brennan",
  "termIds": [
    155
  ],
  "sentences": [
    "Following a classic triumph over adversity story arc (similar to that used in the film The King’s Speech), Sonny discovers he must face the challenge of delivering lines in public when the headteacher insists he perform in his school’s production of Hamlet.",
    "Raphel Famotibe is stupendous as Sonny, perfectly conveying the contrast between the boy’s sullen, withdrawn exterior and his vibrant inner life, as well as the frustration of not being able to say the words he thinks.",
    "Bristol Old Vic\nA schoolboy overcomes his stammer in an energising paean to the power of language marked by fine performances\nriter Ross Willis has a terrific feel for words, their sounds, their percussive qualities.",
    "The staging shifts seamlessly between cartoon fantasy, reality and Sonny’s memories of his mother, thanks in part to Tom Newell’s videos and captions, incorporating the entire text into projections.",
    "Amanda Lawrence’s caustic but inspirational teacher, with a secret of her own, is lively and convincing, while Jenny Fitzpatrick is wicked as a tick-box-obsessed headteacher and touching as Mum.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "As Sonny’s naughty schoolfriend Roshi, Juliet Agnes is a force of nature, winning a well-deserved round of applause for her delivery of the snappy, slangy, teen-view synopsis of Hamlet.",
    "In Wonder Boy, he fixes our focus on the power of language by presenting as the hero of his story 12-year-old Sonny (Raphel Famotibe), who stammers so much that he avoids talking.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "Ultimately, it feels less like a main-house play and more like a beautifully produced example of effective theatre-in-education – inspiring, irrespective of age.",
    "Instead, he draws, for his own eyes only, cartoon stories featuring Captain Chatter (Ramesh Meyyappan), whose amazing power is… speech.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "The development of the plot is schematic, rather than dramatic – structured as a sequence of scenes to tackle issues.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "If the strength of Willis’s writing is the dialogue, the weakness lies in its construction.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "The actors, under director Sally Cookson, deliver Willis’s text with energising relish.",
    "Wonder Boy is at Bristol Old Vic until 26 March\n… we have a small favour to ask.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "It’s hard to believe this is his professional stage debut.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "If there were ever a time to join us, it is now.",
    "Thank you.",
    "?"
  ]
}