{
  "id": 2042,
  "mediaId": 2594,
  "date": "2022-03-23",
  "headline": "We got an early look at Murad’s new SPF serum – is it worth the £70 splurge?",
  "image": "https://static.independent.co.uk/2022/03/21/09/Murad%20SPF%20copy.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/extras/indybest/fashion-beauty/skincare/murad-spf-serum-review-b2038339.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lucy Partington",
  "authorUrl": "https://www.independent.co.uk/author/lucy-partington",
  "termIds": [
    2666,
    4297,
    940,
    1180
  ],
  "sentences": [
    "Amongst its range of active ingredient-laced cleansers and moisturisers is a bestselling selection of sunscreens – from its 100 per cent mineral “cityskin” formula (£60, Murad.co.uk) to its much-loved oil and pore control mattifying lotion (£37, Murad.co.uk) that’s a real godsend for blemish-prone skin types.",
    "It’s also been clinically tested on the full Fitzpatrick skin types scale (a classification that analyses skin type based on the amount of pigment in the skin and its reaction to sun exposure) which makes it truly ideal for any skin tone.",
    "While that’s not enough time to fully analyse its supposed dark spot and pigmentation-reducing abilities, we were able to test how easily it slots into an existing skincare routine, as well as how it wears underneath make-up.",
    "We got our hands on this product around a month before its official launch and have been using it ever since – applying it after our usual cleansing and daily antioxidant routine, as the last step before putting on make-up.",
    "Claiming to brighten the skin as you use it, the correcting benefits come via the UV-responsible carotenoid technology – which is exclusive to Murad – and is formulated with jojoba, squalene, tomato and beetroot extract.",
    "However, Murad really has struck the perfect balance in terms of creating a range of mineral sunscreens that offer incredible UVA and UVB protection that are almost invisible on skin and leave no white cast at all.",
    "This formula is packed with promising claims, but also has the highest price point out of all Murad sunscreens, so – before you shell out your hard-earned cash – we’ve put it to the test to see if it’s worth it.",
    "Described as a serum, the texture lived up to our expectations and once applied, skin immediately felt soft to the touch and had a natural-looking, dewy finish that was perfect for applying make-up on top of.",
    "It works to absorb and reflect UV light for a natural-looking glow, while simultaneously acting as an antioxidant, brightening skin and visibly reducing discolouration and always ensuring skin is hydrated.",
    "The brainchild of Dr Howard Murad, it’s a brand steeped in science and one that prides itself on its effective, clinically-proven formulations that promise to ensure skin is the healthiest it can be.",
    "The carotenoids technology used has been proven to help stimulate collagen and elastin in skin, as well as helping to repair and regenerate protein fibres previously damaged by UV light.",
    "Unlike physical (or chemical) sunscreens, mineral formulas are less likely to cause irritation or sting eyes, but they are also the ones that are most often thick, white and greasy.",
    "We also noticed a slight improvement in the appearance of post-acne marks around our jawline and on our neck, which is a great sign of the longer-term benefits this formula offers.",
    "It really does deliver on every level, from the lightweight, easy-to-apply formula that leaves skin feeling smooth and hydrated, right through to the proven technology.",
    "It’s a two-in-one formula that claims to protect against the sun’s harmful UV rays while working to brighten skin and correct existing pigmentation and dark spots.",
    "Given Murad’s overarching approach to science and skincare, our tester has no doubt excellent results will be seen with prolonged use of this particular product.",
    "For the latest discounts on skincare, try the links below:\nFor gentle skin TLC, try the best bakuchiol skincare products for a natural alternative to retinol",
    "That’s because the ingredients don’t absorb into the skin itself, instead, the filters sit on the surface and act as a screen that deflects harmful UV rays.",
    "While that’s not unusual for this sort of product nowadays, when you consider that this is a 100 per cent mineral formula, it is impressive.",
    "The 100 per cent mineral SPF costs £68 for 30ml, which is very much on the more expensive end of the sliding scale of sunscreen prices.",
    "Read more:\nMurad says that this two-in-one formula will act as both a sunscreen and as a product to correct discolouration.",
    "Murad isn’t known for falling within the affordable category though, and this new product is even more proof of that.",
    "The verdict: Murad correct and perfect serum SPF 45\nDespite the high price point, this sunscreen can’t be faulted.",
    "Over time, it will target existing discolouration while also preventing future hyperpigmentation from developing.",
    "Now, there’s a new kid on the block and it comes in the form of Murad’s correct and perfect serum SPF 45.",
    "We also kept an eye on any small improvements in both overall skin tone and brightness.",
    "As with all Murad sunscreens, this one is incredibly lightweight.",
    "Anybody who’s tried Murad skincare will know just how good it is."
  ]
}