{
  "id": 2069,
  "mediaId": 2586,
  "date": "2022-03-19",
  "headline": "Raiders Strike Deal With Former Rams, Cowboys QB",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-1337101738.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/las-vegas-raiders/garrett-gilbert-quarterback-signing/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Austin Boyd",
  "authorUrl": "https://heavy.com/author/austincjboyd/",
  "termIds": [
    0
  ],
  "sentences": [
    "#Raiders #LasVegasRaiders pic.twitter.com/jEufgFmh2r\n— Steinberg Sports (@SteinbergSports) March 19, 2022\nGilbert was part of the same 2014 NFL Draft that the Raiders selected Carr in.",
    "However, the team made a change at head coach this offseason and Josh McDaniels wants to bring in a quarterback with a little more understanding of his offense.",
    "The Raiders have made a decision on who will back up Carr this season as Steinberg Sports announced that Garrett Gilbert has agreed to a contract with the team.",
    "However, possible landing spots like the Pittsburgh Steelers and Washington Commanders have filled their quarterback needs for now.",
    "He’s bounced around the NFL quite a bit and had a brief stint with the Raiders in 2015 and 2016 where he played with Carr.",
    "This is a smart signing as Gilbert knows Carr and also spent time under McDaniels in New England in 2014, 2015 and 2021.",
    "If they can’t land jobs where getting some starts is more feasible, the Raiders would be an appealing landing spot.",
    "He’s only played in games for the Carolina Panthers, Cleveland Browns, Dallas Cowboys and Washington Commanders.",
    "Raiders Will Likely Add Another Quarterback\nGilbert has been in the league a long time and is a savvy veteran.",
    "Though Mariota remains unsigned, there’s still a good chance he lands in a spot with a better chance to start.",
    "He’s got a strong relationship with Carr and McDaniels could certainly use his athleticism in creative ways.",
    "Over the last two seasons, the Las Vegas Raiders have had consistency with their quarterback situation.",
    "Derek Carr, Nathan Peterman and Marcus Mariota have stood at as the three quarterbacks on the roster.",
    "Players like Jacoby Brissett, Ryan Fitzpatrick and Andy Dalton are still available in free agency.",
    "2 overall pick spent the last two seasons mostly on the Raiders bench but has a lot of talent.",
    "The Seattle Seahawks still hope to add a starting quarterback after trading Russell Wilson.",
    "Regardless, the Raiders would be wise to sign a quarterback who has played in more games.",
    "The Indianapolis Colts could make sense for him if they don’t trade for Baker Mayfield.",
    "Marcus Mariota has been touted as a possible target for many teams over the past year.",
    "If something were to happen to Carr, the team needs somebody who can win some games.",
    "He’ll be an asset for the coach as he teaches the rest of the team his offense.",
    "If he can’t find the right spot, perhaps he’ll want to come back to Las Vegas.",
    "READ NEXT: Raiders’ Kenyan Drake Puts AFC West on Notice With Stern Statement",
    "Gilbert never played a game under McDaniels or when he was with the Raiders.",
    "The need for a capable backup quarterback has never been bigger in the NFL.",
    "Las Vegas is a destination city and the team could be building a contender.",
    "However, his lack of experience actually playing on Sundays is concerning.",
    "Congratulations to Garrett Gilbert on agreeing to terms with the @Raiders!",
    "Fortunately, Carr rarely gets hurt so it’s not too much of a concern.",
    "He has one touchdown pass and one interception in his career.",
    "We’re excited to watch you get after it in Vegas GG!",
    "ALL the latest Raiders news straight to your inbox!",
    "Subscribe to the Heavy on Raiders newsletter here!",
    "He was a sixth-round pick of the Rams at the time.",
    "Where Will Marcus Mariota End Up?",
    "The former No."
  ]
}