{
  "id": 2075,
  "mediaId": 2679,
  "date": "2022-03-22",
  "headline": "Match Play the format where every day feels like Sunday",
  "image": "",
  "link": "https://www.seattletimes.com/sports/match-play-the-format-where-every-day-feels-like-sunday/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DOUG FERGUSON",
  "authorUrl": "https://www.seattletimes.com/author/doug-ferguson/",
  "termIds": [
    0
  ],
  "sentences": [
    "Advertising\n Skip AdSkip AdSkip Ad\nThe most famous moment for Woods was in 2006, the final year at La Costa, when Stephen Ames was the last one in the 64-man field and figured he had a chance against Woods, jokingly adding, “especially where he’s hitting the ball.” Woods won, 9 and 8, still the largest margin in tournament history.",
    "“The further you advance, the more you’re almost playing Sunday rounds in contention, and those are priceless.”\nWhether he was on top of his game or trying to find his way back, Spieth has never made it to the quarterfinals.",
    "“When you start hitting 13, 14 in a close match, it starts to feel like you’re trying to win a golf tournament against that person next to you, and those feelings you don’t normally have until Sundays,” he said.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThe Masters is two weeks away, and this is the final week for players not already eligible to move into the top 50 to earn a trip to Augusta National.",
    "The most unpredictable format in golf starts Wednesday at Austin Country Club, beginning with 16 four-man groups before one winner advances to the knockout stage on the weekend.",
    "He was the heavy favorite at the Masters, except that he slipped down the stairs at his rental house in Augusta, Georgia, wrenched his back and never got to the first tee.",
    "1 seeds have gone on to win since the Match Play began in 1999 — Dustin Johnson in 2017, Rory McIlroy in 2015 and Tiger Woods all three times he won (2003, 2004, 2008).",
    "Along with beating Rahm in the quarterfinals, it was a performance that stood out to Ryder Cup captain Steve Stricker, who used his last wild-card pick on Scheffler.",
    "AUSTIN, Texas (AP) — Jordan Spieth has been in serious contention just once this year, and he is certain that’s going to change in the Dell Technologies Match Play.",
    "“There will be a lot of people out there who after Friday will probably be thinking, ‘I didn’t play bad at all.’ And they’re not making it through,” Rahm said.",
    "Scheffler isn’t sure anyone can declare a player to be a match-play specialist just for getting through the seven matches required to win.",
    "McIlroy didn’t want Match Play to be his final start before the Masters, while Burns and Smith are coming off victories and wanted rest.",
    "He lost in the third round and had to face Brian Harman, whom he had beaten on the first day, in a sudden-death to win the group.",
    "Spieth is in a group of major champions — Keegan Bradley (PGA Championship), Adam Scott (Masters) and Justin Rose (U.S. Open).",
    "“You get more opportunities to play shots under pressure, especially as you come down the stretch in each match,” Spieth said.",
    "“I just think you see the guys playing good at stroke-play events, they’re probably going to play good here,” Scheffler said.",
    "There’s still a few interesting matches over the next three days of round-robin, such as Rahm against Patrick Reed on Friday.",
    "He beat Rahm in the championship match in 2017 for his third straight victory, two of them in World Golf Championships.",
    "“That would be bad news for me.”\nScheffler faced Poulter last year in the fourth round and took him down in 14 holes.",
    "Advertising\n Skip Ad\nAnd then there’s Scottie Scheffler, the runner-up a year ago in his Match Play debut.",
    "Over the next three days, he plays European members Ian Poulter, Tommy Fleetwood and Matt Fitzpatrick.",
    "Xander Schauffele has never advanced out of group play the three times he has been at the Match Play.",
    "In Arizona the following year, Ames opened with Robert Karlsson and the match was over in 11 holes.",
    "Phil Mickelson is recovering from his Saudi-related comments and isn’t even playing the Masters.",
    "___\nMore AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports\n DOUG FERGUSON",
    "He called home to Canada after the match, and his wife was surprised to hear from him so soon.",
    "He made 14 birdies and two eagles over two matches last year, both times going the distance.",
    "The calendar is also a reason why not everyone from the top 64 in the world is in Austin.",
    "His last time in match play was six months ago in the Ryder Cup, where he went 2-0-1.",
    "Ames beat him, 8 and 7, tied for the second-biggest rout in tournament history.",
    "Two others, Hideki Matsuyama and Harris English, are recovering from injury.",
    "Even so, every match feels important, and that’s what appeals to Spieth.",
    "Rory McIlroy, Sam Burns and Cameron Smith chose not to play.",
    "Everyone can be St. Peters and no would call it an upset.",
    "Imagine her surprise to find out he wasn’t coming home.",
    "In their places are six players equally capable.",
    "He won’t even have to wait until the weekend.",
    "Dustin Johnson is an example of that.",
    "This is nothing like March Madness.",
    "Patrick Cantlay can attest to that.",
    "1 seed, which guarantees little.",
    "“I hope not,” Scheffler said.",
    "Does this week really matter?",
    "No one was playing better.",
    "The tale gets better.",
    "Jon Rahm is the No.",
    "It could be worse.",
    "Ryder Cup revenge?",
    "Harman beat him.",
    "Only three No.",
    "Probably not."
  ]
}