{
  "id": 2097,
  "mediaId": 2732,
  "date": "2022-03-25",
  "headline": "Mark Madden: Steelers would be better served drafting a quarterback in 2023",
  "image": "",
  "link": "https://triblive.com/sports/mark-madden-steelers-would-be-better-served-drafting-a-quarterback-in-2023/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Madden",
  "authorUrl": "https://triblive.com/author/mark-madden/",
  "termIds": [
    2156,
    2249,
    2609,
    2876,
    3069,
    4688,
    4705,
    146,
    823,
    4814
  ],
  "sentences": [
    "Tanking the 2019 season after Roethlisberger got hurt instead of trading the next draft’s first-round pick for safety Minkah Fitzpatrick to stupidly salvage .500 might have brought Justin Herbert to Pittsburgh, which would see the problem long since solved.",
    "Stroud and Alabama’s Bryce Young will lead a deep pack of draftable signal-callers that also includes Phil Jurkovec, the Pine-Richland High School grad who plays for Boston College.",
    "But with Ben Roethlisberger not involved for the first time since 2004, the passion of the quarterback gets acted out nonstop despite the signing of free agent Mitch Trubisky.",
    "One would think that Trubisky inking a two-year deal puts the situation on hold through the 2022 season, and here’s betting it does.",
    "If you take a quarterback with the 20th pick in this year’s draft, that seems to accelerate Trubisky’s trip to the pay-no-mind list.",
    "The Steelers get their presumed long-term successor in next year’s draft, which will be flush with top quarterbacks.",
    "They need depth all over, not least at inside linebacker, edge rusher, cornerback, wide receiver and running back.",
    "It’s the only topic in town on radio shows like mine, but not mine, although I indulge it more than I should.",
    "If that’s the case, it would have made more sense to use Mason Rudolph as the bridge quarterback.",
    "Finishing 4-13 last season probably gets you Pitt’s Kenny Pickett, which would make us all giddy.",
    "If you take a quarterback this year, fans will call for him the minute Trubisky has a bad game.",
    "Steelers coach Mike Tomlin was at various college pro days making goo-goo eyes at quarterbacks.",
    "We analyzed Tomlin’s reaction to every pass at the pro days, never mind the actual throws.",
    "Draft a quarterback now, and you put another dagger in your hopes for the upcoming season.",
    "Some have said that Stephon Tuitt wants to play after missing the entirety of last season.",
    "You’re taking a player that won’t pay instant dividends instead of one who would.",
    "The Steelers don’t know how to do this because they haven’t done it since 2004.",
    "It’s more immediately impactful to take, say, a defensive lineman from Georgia.",
    "It’s likely the Steelers could draft a better quarterback next year than this.",
    "But the best move seems drafting a quarterback in 2023 when Ohio’s State C.J.",
    "Tomlin was said to be “riveted” by the performance of Ole Miss’ Matt Corral.",
    "It would be far preferable to going 7-10, or even last season’s 9-7-1.",
    "WHY’D YOU DRAFT HIM?” (That’s going to happen at some point anyway.)",
    "Willis might be a second-rounder if he were in next year’s draft.",
    "I’m ashamed, but not as much as others should be but aren’t.",
    "Liberty’s Malik Willis made Tomlin “giddy,” it was reported.",
    "He’s always taken potential draft picks out to dinner.",
    "If you’re 4-13 this coming season, so much the better.",
    "Ordinarily, of course, Tomlin barely pays attention.",
    "(Then again, wings cost as much as steak right now.)",
    "The Steelers aren’t nearly as good as Cincinnati.",
    "The Steelers have lots of holes: Defensive line.",
    "None of that just started being part of his job.",
    "The torch gets passed during the 2023 season.",
    "(That might have made more sense, anyway.)",
    "Trubisky starts for one season, maybe two.",
    "Tomlin ate wings, just like a regular guy.",
    "Baltimore and Cleveland seem better, too.",
    "Tomlin has always attended pro days.",
    "He’s always watched intently.",
    "Willis and Tomlin had dinner.",
    "Use big-picture thinking.",
    "Perhaps that’s realistic.",
    "Tomlin has never done it.",
    "Sometimes he nods off.",
    "“LET THE KID PLAY!",
    "But Tuitt hasn’t.",
    "Or quarter.",
    "Or pass.",
    "Or half.",
    "Safety."
  ]
}