{
  "id": 2101,
  "mediaId": 2586,
  "date": "2022-03-19",
  "headline": "Bills Fans Find Innovative Way to Troll Browns Over Watson Trade",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Deshaun-Watson-Bills-e1647720792992.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-fans-troll-browns-watson/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "“What this trade tells us is what we already knew — Deshaun Watson is a very talented quarterback, and because of that, anything he does off the field will be minimized and ignored by the league to a greater or lesser degree — to whatever degree the league finds convenient at any particular time,” he wrote.",
    "The practice largely began in late 2017, when Bills fans donated more than $440,000 to Andy Dalton’s foundation after the Cincinnati Bengals led a late comeback to defeat the Baltimore Ravens in the season finale, pushing the Bills into the playoffs for the first time in 17 years.",
    "While some were happy to have landed an established franchise quarterback and bring an end to the up-and-down tenure of Baker Mayfield, others were angry at the team overlooking the character concerns and likely suspension for Watson’s sexual misconduct and assault allegations.",
    "One Bills fan took to Twitter to suggest that the team’s fans consider donating $22 to the Cleveland Rape Crisis Center, meant as a show of support and an answer to the Browns taking on Watson after he faced 22 separate allegations of misconduct.",
    "i’ll be donating $22.https://t.co/wQi2qJoAxC pic.twitter.com/itr52up0WM\n— victoria (@litttlesnappy) March 18, 2022\nThe tweet elicited a viral response, with many Bills fans pledging to donate and fans of other teams joining in as well.",
    "There have been a number of other donation campaigns, including one that raised more than $1.1 million for Josh Allen’s preferred charity, the John R. Oishei Children’s Hospital, after Allen’s grandmother passed away in 2021.",
    "The trade has not been popular with all Browns fans given Watson’s controversial history and the multiple allegations he faces, and some Bills fans are now joining in to show just how much they dislike the move.",
    "Others Speaking Out Against Watson\nMany others have criticized the trade bringing Watson to the Browns and the five-year, $230 million contract restructure the team will be giving the quarterback.",
    "Other fans have also picked up the practice, with a number of Kansas City Chiefs raising money for the hospital to honor Allen’s performance in this year’s divisional playoff game.",
    "https://t.co/mbTgHi2g0r\nWatson will still likely face punishment including a suspension, with the NFL confirming that the league’s investigation into the quarterback will continue.",
    "That prompted a flood of Browns fans renouncing their team and joining the Bills bandwagon, and Bills fans deciding to troll the Browns’ franchise in their own unique style.",
    "Bills Give Back While Denouncing Browns\nAs soon as news broke that Watson had picked the Browns, there was an immediate split among Cleveland fans.",
    "Some Buffalo Bills fans have decided to show their displeasure with the Cleveland Browns trading for Deshaun Watson, sounding off $22 at a time.",
    "The Browns pulled off the shocking acquisition this week, landing Watson after it appeared he had decided against moving to Cleveland.",
    "Doug Farrar of USA Today’s Touchdown Wire wrote that the trade shows that talent trumps character in today’s NFL.",
    "Bills fans have a long history of using donations both as a show of appreciation and something of a protest.",
    "NFL confirms investigation of \"serious allegations\" against Deshaun Watson continues.",
    "The hospital used the funds to create the Patricia Allen Pediatric Recovery Wing.",
    "Deshaun Watson sits on the field after taking a hit against the Buffalo Bills.",
    "please join me in donating to the cleveland rape crisis center.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "hi #billsmafia."
  ]
}