{
  "id": 2106,
  "mediaId": 2523,
  "date": "2022-03-28",
  "headline": "Steelers' Team Needs to Fill in 2022 NFL Draft",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/510/616/d9f0981f39b6f37948022d4b95d1ce99_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2954812-steelers-team-needs-to-fill-in-2022-nfl-draft",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Rill",
  "authorUrl": "https://bleacherreport.com/users/e900d7e2-a11e-4773-a1c8-d33057639a89",
  "termIds": [
    0
  ],
  "sentences": [
    "Quarterback\nThere's a good chance that Roethlisberger's immediate successor at quarterback will be Mitchell Trubisky, who signed a two-year, $14 million deal with the Steelers earlier this offseason.",
    "Even if the Steelers sign or trade for a new strong safety, though, they may still want to take one during the draft, especially if their other acquisition is only a short-term fix for the spot.",
    "There will be other possible safety targets for the Steelers throughout the draft, so they'll likely have options to address what could still be their biggest defensive need at that point.",
    "However, they're the only two on the roster who had more than six catches for the team last year, now that JuJu Smith-Schuster left via free agency and signed with the Kansas City Chiefs.",
    "Auburn's Smoke Monday could be an intriguing target for Pittsburgh on the third day of the draft, as he's a high-potential player who may outperform where he gets selected.",
    "Moore is from the Pittsburgh area, as he previously attended Shady Side Academy in Fox Chapel, Pennsylvania, where he played high school football with Tomlin's son, Dino.",
    "Pittsburgh's Kenny Pickett, Ole Miss' Matt Corral, Cincinnati's Desmond Ridder and North Carolina's Sam Howell are among the other top QBs in this year's draft class.",
    "And there will be plenty of new faces on the field in Pittsburgh, such as linebacker Myles Jack and cornerback Levi Wallace, a pair of notable free-agent signings.",
    "\"... Willis could compete with Trubisky, Mason Rudolph and Dwayne Haskins in training camp, but he wouldn't be under immediate pressure to start in Week 1.",
    "If Trubisky or any other quarterback is going to have success in Pittsburgh's offense, another solid wide receiver likely needs to be added to the roster.",
    "Regardless, the Steelers should draft a potential franchise quarterback who could be accelerated into the role should the Trubisky signing not work out.",
    "If Pittsburgh doesn't bring back Edmunds or sign somebody else to be its starting strong safety, perhaps it addresses the position early in the draft.",
    "It marked their 10th postseason appearance under head coach Mike Tomlin, who has still never had a losing season during his 15 years at the helm.",
    "If Pittsburgh doesn't land Willis, it could also take one of these quarterbacks, or somebody else who may not get taken until the middle rounds.",
    "And there are some talented playmakers in this year's draft class, meaning the Steelers could address that need after the first round.",
    "Whether it's Moore or another wide receiver, Pittsburgh should add one more legitimate pass-catching weapon to its offense.",
    "Although the Steelers have been fairly active this offseason, they still have holes to fill before the 2022 season arrives.",
    "\"It's a storybook ending if I landed with the Steelers,\" Moore said earlier this month, per Aaron McMann of MLive.com.",
    "However, the 25-year-old safety is now a free agent, and it's possible he won't be coming back to Pittsburgh for 2022.",
    "ESPN's Mel Kiper Jr. has the Steelers drafting Liberty's Malik Willis, who could be a great fit for the situation.",
    "Terrell Edmunds started all 17 games for the Steelers last season, and he started 60 games for them from 2018-21.",
    "Last season, the Pittsburgh Steelers made a late push to get into the playoffs as the third AFC wild-card team.",
    "One potential fit could be Western Michigan's Skyy Moore, who may be available for Pittsburgh to draft at No.",
    "Although ESPN's Jeremy Fowler recently reported that the Steelers re-signing Edmunds is \"not off the table.\"",
    "They may opt to address several of those needs during the NFL draft, which will take place from April 28-30.",
    "That will help it make up for the loss of Smith-Schuster and potentially take the unit to another level.",
    "20 overall selection) on a quarterback who they can develop and not have to rush into a starting role.",
    "Wide Receiver\nThe Steelers have a solid pair of wide receivers in Diontae Johnson and Chase Claypool.",
    "The signing of Trubisky may not prevent the Steelers from using their first-round draft pick (the No.",
    "But now, the Steelers are entering a new era, one without longtime quarterback Ben Roethlisberger.",
    "\"Trubisky could be a bridge to Willis, who is raw but supremely talented,\" Kiper wrote.",
    "Here's a closer look at Pittsburgh's top needs it may look to address during the draft.",
    "Safety\nMinkah Fitzpatrick will again be the Steelers' starting free safety in 2022.",
    "But is the 27-year-old QB the franchise's long-term answer at the position?",
    "That's a question that Pittsburgh doesn't yet have an answer to.",
    "As for who will be starting alongside him at strong safety?",
    "It could find a new starter within the first few rounds.",
    "Many mocks have Pittsburgh using the pick on a QB.",
    "That would be crucial for him.\"",
    "That may not be the case.",
    "B/R Recommends",
    "52."
  ]
}