{
  "id": 2111,
  "mediaId": 2732,
  "date": "2022-03-24",
  "headline": "First Call: 1 team may have stoked the price on Chuks Okorafor; Steelers attend another quarterback's pro day",
  "image": "",
  "link": "https://triblive.com/sports/first-call-1-team-may-have-stoked-the-price-on-chuks-okorafor-steelers-attend-another-quarterbacks-pro-day/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Benz",
  "authorUrl": "https://triblive.com/author/tim-benz/",
  "termIds": [
    1659,
    1712,
    2609,
    3635,
    3682,
    184,
    386,
    671,
    823
  ],
  "sentences": [
    "He was joined by general manager Kevin Colbert, pro scouting coordinator Brandon Hunt, offensive coordinator Matt Canada and player personnel coordinator Dan Rooney Jr.\nThat’s because Ole Miss quarterback Matt Corral was working out for pro scouts.",
    "Getting another potential starting safety alongside Minkah Fitzpatrick would be nice so the Steelers can pay attention to other areas of need in the draft such as wide receiver, tackle, defensive line, inside linebacker and cornerback.",
    "He could have been a Bear, but not at three years and $29.25 million, which Pittsburgh was willing to pay to re-sign him.”\nOkorafor’s cap number of $4.33 million is the largest of any offensive lineman on the team.",
    "https://t.co/kJW63bmmR7\n— Cameron Wolfe (@CameronWolfe) March 23, 2022\nAttending the workout in Oxford meant that top members of the Steelers brass were not on hand in Columbus for Ohio State’s pro day.",
    ": Steelers fans get feisty about Mitch Trubisky, Tom Brady, and the idea of tanking a season\nFlower’s first game\nThe Minnesota Wild play on Thursday night against the Vancouver Canucks.",
    "Recently acquired by the Wild from the Chicago Blackhawks, Fleury isn’t expected to make his debut with his new team until Saturday’s game against the Columbus Blue Jackets.",
    "Instead, he pointed to the prospect of a potential return of Terrell Edmunds who hit free agency this season after four years starting with the team.",
    "Panthers (Scott Fitterer, Matt Rhule), Falcons (Terry Fontenot, Arthur Smith) Steelers (Mike Tomlin, Kevin Colbert) among QB-needy teams deep here.",
    "#mnwild coach Dean Evason said Fleury flew back home and the team told him to get settled and be back for the game on Thursday vs. Vancouver.",
    "Thursday’s “First Call” tells us which quarterback prospect lured top members of the Pittsburgh Steelers to his pro day.",
    "That’s if they decide to wait a year on quarterback and see how recently signed Mitch Trubisky does at the position.",
    "“Overall, Chicago took a prudent approach to Ryan Poles’ first free agency as the Bears’ GM,” Fowler said Wednesday.",
    "That price seemed surprisingly hefty since there weren’t many names linked to Okorafor in the bidding process.",
    "• Tim Benz: What the Tyreek Hill trade means for him, the Dolphins, Chiefs and even the Steelers\n• U mad, bro?",
    "— Sarah McLellan (@sarah__mclellan) March 23, 2022\nCam Talbot is slated to get the start against the Canucks.",
    "Path of priorities\nSteelers coach Mike Tomlin was at the University of Mississippi pro day on Wednesday.",
    "Many have wondered if the Steelers were essentially bidding against themselves for Chuks Okorafor.",
    "The organization decided to retain their starting right tackle for three years and $29.25 million.",
    "Talbot will start against #Canucks, and Evason said Fleury will most likely play on Saturday.",
    "And we find out when Marc-Andre Fleury is supposed to get his first start with his new team.",
    "He is one of several quarterback candidates that could go in the first round of the draft.",
    "One report suggests the Steelers are keeping an eye on the safety market in free agency.",
    "We find out what team may have primed the bidding on Steelers tackle Chuks Okorafor.",
    "Being Badgered\nFowler also noted that the Steelers are in the market for a safety.",
    "Many have linked the franchise to former Pro Bowler Tyrann “Honey Badger” Mathieu.",
    "That’s according to coach Dean Evason via Sarah McLellan with the Star-Tribune.",
    "“The team identified several players as great fits but not worth a bidding war.",
    "A reported 100 NFL representatives were there to see 11 prospects participate.",
    "Corral got hurt in the Sugar Bowl against Baylor this year, injuring an ankle.",
    "The 6-foot-1, 212-pound junior also didn’t participate in the Senior Bowl.",
    "According to Jeremy Fowler of ESPN.com, the Chicago Bears wanted Okorafor.",
    "He just threw a 3-0 shutout against the Vegas Golden Knights on Monday.",
    "Matt Corral (6’1 1/2, 215 pounds) will to throw at pro day in an hour.",
    "But former Penguins goalie Marc-Andre Fleury isn’t supposed to start.",
    "That’s usually a target-rich environment for draft decision makers.",
    "Colbert and Tomlin have been staples at that event in years past.",
    "All emails are subject to publication unless specified otherwise.",
    "They may be of interest to whatever Steelers scouts showed up.",
    "That limited his offseason participation at the NFL Combine.",
    "Titans OC Todd Downing, Cowboys HC Mike McCarthy also here.",
    "Two of them were receivers Garrett Wilson and Chris Olave.",
    "You can contact Tim at tbenz@triblive.com or via Twitter.",
    "“He is known as a ball hawk who can play multiple spots.",
    "Another name to keep in mind is Dallas’ Damontae Kazee.",
    "The Steelers have him on their radar,” Fowler said.",
    "As a result, his workout drew lots of attention.",
    "One example was right tackle Chukwuma Okorafor.",
    "Tim Benz is a Tribune-Review staff writer.",
    "But Fowler downplayed that angle.",
    "All tweets could be reposted.",
    "But not at that price tag.",
    "Now one has emerged.",
    "Bear market?"
  ]
}