{
  "id": 2128,
  "mediaId": 2586,
  "date": "2022-03-25",
  "headline": "Bills Fans Flip Over Rumors of Tom Brady Trade to AFC East Rival",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Tom-Brady-2-2-e1646103609813.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-fans-react-brady-rumors/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1587,
    2049,
    3583,
    4512,
    160,
    612,
    700,
    1004
  ],
  "sentences": [
    "@DaleEArnold tweeted this afternoon he \"wouldn't be surprised\" if Tom Brady goes to the Miami Dolphins this season\nDale tells us he is hearing the parties are \"working on it\"\nRemember: Dale was the first to report Brady to Tampa was a done deal pic.twitter.com/NN46dssrI2\n— Merloni & Fauria (@MerloniFauria) March 24, 2022\nWhile there was plenty of skepticism surrounding this report, some Bills fans pondered the idea of Brady once again joining the AFC East.",
    "“It’s not going to happen but… Put Tom Brady on the #Dolphins, let him be the 2nd best Quarterback in the AFC East, and enjoy the schadenfreude when Josh Allen and the #Bills pummel them twice next season,” one fan tweeted.",
    "None of this makes sense.”\nThe Dolphins could also be hard-pressed to find the requisite assets to trade for Brady, having just given up a slew of draft picks to land wide receiver Tyreek Hill from the Kansas City Chiefs.",
    "Other Bills fans were more exasperated at the rumors of his return to the AFC East, especially after Brady changed his mind just weeks after a retirement announcement and instead decided to return to the Buccaneers.",
    "\"Tom Brady to Miami doesn't make any sense.. he's under contract with the Bucs & has recruited guys to play with him in Tampa\" ~@RapSheet#PMSLive pic.twitter.com/oJbGilgCPC\n“Brady is under contract with the Bucs.",
    "“There was a kind of like a tampering thing that was part of the Brian Flores lawsuit and the Miami Dolphins … so after all this … after that allegation, which has not been proven, do the Dolphins then get him?",
    "“Plus, [Brady] did recruit a couple guys to sign back with Tampa including his buddy Leonard Fournette, Chris Godwin, including several other free agents and he is really going to do that […] and then bail?",
    "Bills Fans Jump on Brady Rumors\nThe rumor of Brady’s possible trade to the Dolphins originated with Dale Arnold of the New England Sports Network, who said that both teams were working on the deal.",
    "After Arnold’s initial report suggesting a trade to the Dolphins, a number of other sources threw cold water on the rumor and insisted that Brady will be staying with the Buccaneers.",
    "As SI.com’s Mike Fisher noted, Arnold is the Boston Bruins host for NESN, but has connections to the Patriots and was the first to report Brady’s move to the Buccaneers.",
    "This week, rumors surfaced that Brady may have been working on a trade that would ship him downstate, moving from the Tampa Bay Buccaneers to the Miami Dolphins.",
    "The rumor brought some strong reactions from Bills fans, who had been tortured by Brady and the New England Patriots for the better part of two decades.",
    "Now, the future Hall of Fame quarterback not only decided to come back and play another season, but could end up with a bitter longtime rival.",
    "Appearing on The Pat McAfee Show, the NFL Network’s Ian Rapoport said that it would not make sense for the Buccaneers to trade Brady.",
    "Still, some Bills fans relished the idea of getting a second chance at beating Brady now that Josh Allen is at the helm in Buffalo.",
    "Brady amassed a 33-2 record against Buffalo while with the Patriots, becoming a major source of frustration for many Bills fans.",
    "… [The Buccaneers] said definitely that he isn’t going anywhere,” Rapoport said.",
    "Buffalo Bills fans thought they had gotten rid of Tom Brady once and for all.",
    "Guys such a pain in the a** it’s unbelievable,” another wrote.",
    "Brady Likely Staying Put\nBills fans can likely rest easy.",
    "As a Bills fan, please politely do not talk to me today.",
    "Tom Brady will play for the Buccaneers in 2022.",
    "“Tom Brady can p*** off,” a Bills fan tweeted.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "“Brady’s going to the Dolphins.",
    "."
  ]
}