{
  "id": 2135,
  "mediaId": 2732,
  "date": "2022-03-27",
  "headline": "Eastern Pittsburgh suburban real estate transactions for the week of March 27, 2022",
  "image": "",
  "link": "https://triblive.com/local/penn-hills/print-only-7/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Categories: Local | Monroeville Times Express | Murrysville Star | Norwin Star | Oakmont | Penn Hills Progress | Penn-Trafford Star | Plum Advance Leader",
    "Estate of Richard Michael Delgrosso sold property at 318 Greenway Drive to Kevin Patrick Barry and Maura Ann Miglioretti for $98,000.",
    "North Huntingdon\nNorth Main Street Investors Inc. sold property at 139-141 Front St. to Ryan O’Donnell and Emily Price for $108,000.",
    "First Select Holdings LLC sold property at 103 St. Croix Drive to Thomas Sechrist and Jordan Fitzpatrick for $225,000.",
    "Federal Home Loan Mortgage Corp. sold property at 116 Fitzsimmons Ln to Errol Abdulla and Emelie Spencer for $120,000.",
    "Parameshwar Ramkumar Midhe sold property at 230B Berkeley Way to Maxine Bucciarelli and Marianne Brown for $320,000.",
    "Estate of Louis Divis Jr. sold property at 123 Halliford Drive to Diversified Residential Homes 2 LLC for $172,500.",
    "Monroeville\nPaul McCullough sold property at 401 Alpine Village Drive to Edward and Shirley Kendeall for $229,950.",
    "Estate of Bernard Schwartz sold property at 1303 Hillsdale Drive to Jonas Chaney and Mary Trujillo for $175,000.",
    "Estate of Theresa Elizabeth HaffeyFankhauser sold property at 1071 Indiana Road to Multiflora LLC for $210,000.",
    "Plum\nDonald Powers Jr. sold property at 685 Blue Ridge Road to Adam Siecinski and Jamie Frank for $234,900.",
    "Tamara Tucker sold property at 38 Edinburg Drive to Deutsche Bank Natianal Trust Co. trustee for $100,000.",
    "Sharon Richards sold property at 403 Olten Road to Bosco Ngondet and Christelle Magouga Pape for $205,000.",
    "Paul Anthony Kristofik sold property at 2827 Reiter Road to Anthony Watson and Erica Morgan for $150,000.",
    "Jennifer Thompson sold property at 267 Red Oak Drive to Angelo Madonna and Jennifer Thompson for $98,717.",
    "Murrysville\nTerry Smith sold property at 5124-5126 Cherry Drive to Thomas and Diedre Whalen for $525,000.",
    "Debra Jean Demarco sold property at Unknown Address to Bryan Demarco and Antonina Ermakova for $80,000.",
    "Morgan Drenning sold property at 235 Old Haymaker Road to Yu Lin Shih and Tsui Chuan Lin for $298,000.",
    "Wilkinsburg\nPenn Pioneer Enterprises LLC sold property at 1412 Clark St. to Minnie Diggs for $41,601.",
    "Berlinn Development LLC sold property at 1315 Jefferson Heights Road to RP Homes 2 LLC for $163,000.",
    "Darren Spaziani sold property at 1 Edinburg Drive to Michael and Marguerite Pernatozzi for $176,150.",
    "Hayley Jayne Geary sold property at 855 Maine St. to Ronald Jonh and Abraham Rovansek for $160,000.",
    "Kevin Calcara sold property at 1419 Willow Heights Drive to David Bradley Nesmith Jr. for $420,000.",
    "Kim Stawicki sold property at 2191 Robbins Station Road to Andrew and Andora Weglein for $365,000.",
    "Verona\nCharles Spring sold property at 222 Arch St. Unit C to Daniel Robbins trustee for $365,000.",
    "Nicolas Helbling sold property at 231 Scott Road to Steven Hopley and Johnna Beehner for $170,500.",
    "UTZ Quality Foods LLC sold property at 121 Pennant Drive to 121 Pennant Drive LLC for $1,100,000.",
    "Central Penn Capital Management LLC sold property at 1380 Cavitt Road to RP2ALL LLC for $170,000.",
    "Victor Callahan Jr. sold property at 232 Avenue F to Omar Matthie and Naomi Johnson for $162,000.",
    "Thomas Conroy sold property at 168 Glenfield Drive to Gary Keith and Theresa Siegel for $175,000.",
    "William Henderson sold property at 530 Regency Drive to Charles and Linda Broniman for $169,900.",
    "Mary Jane Henry sold property at 13723 Ormsby Drive to Matthew and Jennifer Wilson for $170,000.",
    "Jeffrey Donald Patterson sold property at 439 Union St. to Jr PA 2021 Rental 3 LLC for $62,000.",
    "Robert Epps sold property at 431 Cypress Hill Drive to Thomas and Margaret Burley for $194,900.",
    "Adrian Fontes sold property at 2414 Haymaker Road to Nathaniel and Theresa Morgan for $112,500.",
    "Norma Corletti sold property at 325 Skyview Drive to Justin and Jennifer Kalnicky for $200,000.",
    "Horizon Homes Pittsburgh III LLC sold property at 169 Urick Ln to Michael Sedlock for $440,000.",
    "Michael McGreal Jr. sold property at 316 Beulah Road to Keyway Homes East Two LLC for $83,500.",
    "Edward Jacob III sold property at 815 Braddock Road to Future 2020 Management LLC for $80,000.",
    "SIRVA Relocation Credit LLC sold property at 6 Ocala Trail Drive to Anaisa Barry for $159,900.",
    "Estate of Joseph Albert Toth sold property at 364 Kenney Ave. to HQO Holdings LLC for $10,000.",
    "Jason Marks sold property at 6 Ocala Trail Drive to SIRVA Relocation Credit LLC for $159,900.",
    "Danny Hunt sold property at 3717 Northern Pike to Antony Hale and Camille Parker for $60,000.",
    "Estate of Rosalie Lombardo sold property at 1340 Hillsdale Drive to RP2ALL LLC for $120,000.",
    "Walter Rauch sold property at 7170 Saltsburg Road to Dejavaughn Demonti Thomas for $137,000.",
    "Patti Tomayko sold property at 177 Nassau Drive to Justin and Elizabeth Tomayko for $86,039.",
    "Triple Alpha Heights LLC sold property at 2604 Grandview Ave. to Scott Coleman for $180,000.",
    "Estate of Robert Mentzer sold property at 9172 Walnut St. to Elizabeth Geiser for $107,500.",
    "James Sugden Jr. sold property at 211 Shannon Heights Drive to Randal Collins for $170,000.",
    "Penn Hills\nDaniel Weidenhof III sold property at 913 Fourth St. to Casey Brown for $74,900.",
    "Leslie D’Antonio sold property at 336 Chateau Ct to Francis and Donna Napfel for $164,400.",
    "Mary Caldwell sold property at 459 North Ave. to Wells Fargo Bank NA trustee for $35,000.",
    "Sergio Afanador sold property at 301 Highland Ave. to Poppin Willies LLV LLC for $42,000.",
    "Ian McGrath sold property at 245 Lansdowne Drive to Randall and Diane Flick for $170,000.",
    "Jessica Piccolino sold property at 247 Hillary Drive to Fund IV Homes 3 LLC for $125,900.",
    "Burrell Group Inc. sold property at Columbia Road to Greencore Holdings LLC for $50,000.",
    "Timm Phoebe sold property at 116 Rodilin Drive to Amtex International Inc. for $42,500.",
    "Michael Schmidt sold property at 1016 Wainwright Drive to Judith Ashbaugh for $241,000.",
    "Marie Santarcangelo sold property at 330 Beulah Road to JCZ Properties LLC for $45,000.",
    "PTV 1045 LLC sold property at 1108 Milltown Road to Verona City DG LLC for $1,719,000.",
    "Paul Gasparovic sold property at 708 Whitney Ave. to Rising Tide Partners for $15,129.",
    "Mark Tomasic sold property at 297 Perry St. to Nathaniel Hunter Strachan for $185,000.",
    "Arthur Berg sold property at 1840 Lynch Drive to Jason and Kim Gillespie for $45,000.",
    "Tracy Lee Shimko trste sold property at 549 Guylyn Drive to Luke Rhoades for $87,500.",
    "NEPA LLC sold property at 506 Nelbon Ave. to Watch Mountain Holding LLC for $51,660.",
    "Beth Ann Hepting sold property at 12339 Frankstown Road to SFR3 040 LLC for $85,000.",
    "James Henderson sold property at 2705 Blackridge Ave. to Caitlyn Brown for $168,525.",
    "Michael Perlic sold property at 531 Pennview Drive to Verum Holdings LLC for $5,500.",
    "Marilyn Jack sold property at 320 Center New Texas Road to Noah Seniow for $166,900.",
    "Pitcairn\nPitcare Inc. sold property at 643 Third St. to Heather Luimes for $25,000.",
    "Gary Lobaugh Jr. sold property at 334 Barclay Ave. to Karen Gregoire for $232,000.",
    "Walter Mead sold property at 1205 Northwestern Drive to Alison Read for $207,000.",
    "Daja Properties LLC sold property at 130 Lois Drive to Chelsea Craig for $99,900.",
    "Monte Bartley sold property at 990 Elizabeth St. to Dara Lynn Hawes for $173,000.",
    "Elvia Way LLC sold property at 712 Elvia Way to JLA Properties L.P. for $260,000.",
    "Rosemarie Marino sold property at 144 Venango Ct to Raelynn Honkus for $272,500.",
    "Alfred Bortz sold property at 1312 Foxboro Drive to RP Homes 2 LLC for $180,000.",
    "Estate of Clyde McFall sold property at 106 Clay Drive to Xin Zhao for $100,000.",
    "Terry McCoy sold property at 312 Walpole Drive to Michael Webster for $150,000.",
    "Ruth Grant sold property at 901 Center Road to Louis Potochnik Jr. for $85,000.",
    "James Webb sold property at 512 Springdale Drive to Andrea Brooks for $180,000.",
    "Jonathan Trujillo sold property at 2715 Race St. to Robert Payne for $135,000.",
    "Thomas Whalen sold property at 103 Crosswinds Ln to Wendy Smith for $190,000.",
    "Donato Pasquarelli sold property at 970 Giulia Drive to NVR Inc. for $91,500.",
    "Anne Fields sold property at 1152 Princeton Road to Floyd Foote for $290,000.",
    "Omar Foster sold property at 1714 Penn Ave. to Sharon Jennings for $134,000.",
    "OWGS LLC sold property at 5635 Verona Road to SFG Holdings LLC for $40,000.",
    "Roger Schmitt sold property at 259 Willow Drive to RP2ALL LLC for $96,000.",
    "James Green sold property at 9202 Valley St. to SFR3 040 LLC for $42,000.",
    "Richard Burge sold property at 920 James St. to SFR3 020 LLC for $30,500.",
    "Richard Demko sold property at 9101 Maple St. to Ryan Smith for $65,000.",
    "Contact RealSTATs at 412-381-3880 or visit www.RealSTATs.net.",
    "to Donald Thomas Betts III and Shaquala Swinton for $320,000.",
    "Jonathon David Garrison sold property at 2814 Graham Blvd.",
    "Real Estate Transactions provided by RealSTATs."
  ]
}