{
  "id": 2141,
  "mediaId": 2586,
  "date": "2022-03-26",
  "headline": "Colin Kaepernick Sends Message to Seahawks Amid Rumors",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-610466144-e1647487231586.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/seattle-seahawks/colin-kaepernick-kaep-wants-workout-rumors/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Adams",
  "authorUrl": "https://heavy.com/author/jondadams/",
  "termIds": [
    0
  ],
  "sentences": [
    "“He’s a free agent, so yeah, there’s guys out there with experience like I said [Blaine] Gabbert, [Ryan] Fitzpatrick, Geno [Smith], he’s one of ’em,” Schneider said of the team’s potential interest in Kaepernick.",
    "I don’t know if it’s even in football.”\nThe Seahawks Remain Noncommittal on Kaepernick\nESPN’s Brady Henderson believes the Seahawks would have already made a move if they were going to sign Kaepernick.",
    "As Pete mentioned, we’ve spoken recently and still hoping that door is open and get a chance to walk through it.”\nKaepernick has not been on an NFL roster since the 2016 NFL season.",
    "“Doesn’t seem like the Seahawks are interested, at least not now, even with Pete Carroll stumping the other day for Kaepernick to get another shot,” Henderson tweeted on March 24.",
    "Carroll on Kaepernick: ‘I Think He Does [Deserve a Shot] Somewhere’\nUnprompted, Seahawks head coach Pete Carroll recently discussed his offseason conversations with Kaepernick.",
    "During a March 24 interview with Seattle Sports’ Dave Wyman and Bob Stelton, Seahawks general manager John Schneider indicated that nothing with Kaepernick was imminent.",
    "The former Niners quarterback threw for 2,241 yards, 16 touchdowns and four interceptions while completing 59.2% of his passes in 12 appearances for the 49ers in 2016.",
    "After the workout, Kaepernick discussed his talks with the Seahawks and confirmed he is “waiting for that chance” when it comes to a workout.",
    "If there was a move, Kaepernick could be a training camp invite as the season gets closer, but even that sounds like more of a long shot.",
    "“This is about second opportunities and free agency kind of marks that deal,” Carroll explained during a March 16 press conference.",
    "Colin Kaepernick is still hoping to get a workout with the Seattle Seahawks as the team looks to find their next quarterback.",
    "The former NFL quarterback threw to Seahawks receiver Aaron Fuller weeks after connecting with Seattle wideout Tyler Lockett.",
    "There’s a whole process we go through here, the free agency period and getting through the summer as you build your team.",
    "I’m working out.’\n“And so, he sent me some videos, the next thing I know he’s working out with with Tyler Lockett.",
    "“Not yet, still waiting for that chance [with Seahawks], still hopeful” Kaepernick told reporters on March 23.",
    "Carroll noted that Kaepernick deserved a shot “somewhere” but stopped short of saying that would be Seattle.",
    "Kaepernick hosted his second workout of the offseason that involved a Seahawks receiver.",
    "Again, we’ve had conversations with Pete [Carroll] and John [Schneider] previously.",
    "I don’t know how that happened, but does that guy deserve a second shot?",
    "I mean, I know you’re going to ask, so let me just put it out there.",
    "He contacted me the other day said, ‘hey, I’d like to get a shot.",
    "The quarterback also added 468 rushing yards and two touchdowns.",
    "“Now, the difference is he hasn’t played in several years.",
    "You’re going to ask questions about Colin Kaepernick.",
    "ALL the latest Seahawks news straight to your inbox!",
    "It will be worth watching as the season gets closer.",
    "“There’s been a lot of conversation around it.",
    "Join the Heavy on Seahawks newsletter here!",
    "“And you know, I thought about another guy.",
    "I think he does, somewhere.",
    "I don’t know if it’s here.",
    "I don’t know where it is.",
    "It never stops.”"
  ]
}