{
  "id": 2147,
  "mediaId": 2586,
  "date": "2022-03-23",
  "headline": "Bills Twitter Sounds Off on Blockbuster Trade Sending Tyreek Hill to AFC East",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Tyreek-Hill-Bills-e1648057262561.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-twitter-reacts-hill-trade/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "We’ve signed WR Jamison Crowder to a one-year deal: https://t.co/JqcnG4zk2C pic.twitter.com/pQTLxIsDgI\n— Buffalo Bills (@BuffaloBills) March 22, 2022\nThe Bills have not done as much work on skill players this offseason, focusing more on the offensive and defensive lines, but did add one playmaker in former New York Jets wide receiver Jamison Crowder.",
    "I am absolutely here for the Chiefs’ downfall.”\nBills Used Hill as Benchmark\nBuffalo’s front office was keenly aware of the effect Hill had on the Chiefs’ offense, and used him as something of a benchmark for their own offseason plans.",
    "Though the trade boosted the AFC East and created a more difficult path to a third straight division title for the Bills, many Buffalo fans were happy to see a top rival lose their most explosive player.",
    "The 28-year-old made 51 catches for 447 yards and two touchdowns on the New York Jets last season, and will now be able to fill some of the void left with the release of Cole Beasley.",
    "The Kansas City Chiefs shipped the speedy playmaker to the Miami Dolphins in a blockbuster deal that will see him become the highest-paid wide receiver in NFL history.",
    "Bills Fans Happy to See Chiefs Weakened\nOver the last two postseasons, there may have been no single player more responsible for ending the Bills’ season than Hill.",
    "“You’d love to have a RAC (run-after-catch) guy that you can get the ball to and he can turn a 5-yard pass into a 60-yard touchdown,” Beane said, via The Athletic.",
    "He had an even bigger game last postseason, making 11 catches for 150 yards and a key touchdown in Kansas City’s 42-36 overtime victory in the divisional round.",
    "He made nine catches for 172 yards in the 2021 AFC Championship game, turning in a series of big plays that helped the Chiefs seize and keep momentum.",
    "Given Hill’s history of killing the Bills, many Buffalo fans were thrilled to see him gone from one of their biggest roadblocks to the Super Bowl.",
    "@MSGNetworks/@WGR550 | #BILLSMAFIA pic.twitter.com/JO7lhRV2va\n“As if this offseason couldn’t be more perfect for the #Bills,” tweeted another.",
    "?How does Tyreek Hill being traded to the Dolphins and the AFC East change the way you feel about the #Bills' chances in the division?????",
    "As ESPN’s Adam Schefter reported, the Dolphins gave up a massive haul to land Hill, sending the Chiefs a 2022 1st-round pick (No.",
    "Bills general manager Brandon Beane mentioned Hill specifically when talking about the team’s need for a potential game-breaker.",
    "Tyreek Hill has haunted the Buffalo Bills in two straight postseasons, and now they’ll be forced to see him twice each season.",
    "“I don’t care that Tyreek Hill is in our division now, breaking up him and Patrick Mahomes is HUGE.",
    "“Take him off KC and they are in Huge trouble when we see them again in the playoffs.",
    "50) and a 4th-round pick along with 4th- and 6th-round picks in the 2023 draft.",
    "He’s the 1 player in the NFL I think the Bills can’t cover,” one fan tweeted.",
    "?Tweet or Call us up and we'll discuss with you on the air!",
    "So we’ll continue to look for various ways.”\nIt’s official.",
    "It’s a tradeoff many Bills fans are happy to make.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "On the field that man is a Game Changer!",
    "KC is my target, not my division.”\n?",
    "You can never have enough of that.",
    "1-888-550-2550 or 716-803-0550.",
    "“I need Tyreek Hill gone TODAY.",
    "Send him to the Jets or Miami.",
    "“We talked about speed here.",
    "29), a 2nd-round pick (No.",
    "??",
    "?"
  ]
}