{
  "id": 2148,
  "mediaId": 2586,
  "date": "2022-03-19",
  "headline": "Bills Trade With Cleveland Browns to Land New Backup QB: Report",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-1363659614-e1647720848659.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/qb-case-keenum-trade-browns/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Bicks",
  "authorUrl": "https://heavy.com/author/emilybicks/",
  "termIds": [
    1655,
    1795,
    3380,
    4496,
    160,
    225,
    473,
    671,
    4910
  ],
  "sentences": [
    "#GoBills #BillsMafia #Fitzmagic #Bills pic.twitter.com/0ZA7ICyTT8\n— Lance Valcour (@Lance_Valcour) March 17, 2022\nRyan Fitzpatrick has to be the Bills backup QB if they want to win the Super Bowl, don’t ask me why, it’s to mathematical for me to explain\nmaybe some fitzmagic next season #BillsMafia https://t.co/Wtu9eNeN4g pic.twitter.com/7EIICD9Se1\n— Jenna Cottrell (@JennaCottrell) March 19, 2022\nHowever, with Keenum signing with Buffalo, and Bakley’s contract seemingly just around the corner, it seems Fitzpatrick is officially out of the running.",
    "According to ESPN‘s Adam Schefter, the Browns decided to move on from Keenum and “are expected to sign QB Jacoby Brissett to a one-year deal to be Watson’s backup, per sources.”\nAs for Keenum’s contract, Cleveland.com‘s Mary Kay Cabot clarified that the Browns “reworked his deal” in order “to make it more palatable for Buffalo, and “essentially purchased the seventh-round pick for $1 million.” He’s due a $6.1M base salary in 2022, and along with a prorated signing bonus of $1.33 million, his total cap hit is $8.4 million for this coming season.",
    "Bills Fans Were Hoping Ryan Fitzpatrick Would Return to Buffalo\nHey @BuffaloBills, I think we still need a backup QB… https://t.co/iKm4dUcUtV\n— Brad Shapiro (@btshapir) March 17, 2022\nIt was highly expected for last season’s backup, Mitch Trubisky, to move on for the 2022 NFL season, and the search for his replacement started before he signed a two-year $14.25 million contract worth up to $27 million in incentives to join the Pittsburgh Steelers as their “expected” starter for the 2022 NFL season.",
    "NFL Network’s Tom Pelissero tweeted, “Another QB trade in Cleveland: The #Browns are sending veteran Case Keenum to the #Bills for a 2022 seventh-round draft pick, per sources.”\nAfter the Browns pulled off the surprise trade with the Houston Texans to land starter Deshaun Watson, it was widely assumed that Keenum would remain in Cleveland.",
    "While Bills’ general manager Brandon Beane announced during his press conference on Friday that they’ll sign a new backup “hopefully early next week,” news broke on Saturday, March 19, that the Bills made a trade with the Cleveland Browns to receive 34-year-old quarterback Case Keenum, who’s served as Baker Mayfield’s backup since 2020.",
    "Following his release, Barkley shared the following photo of his son in a Bills jersey on Instagram and wrote, “Mood.”\nThis past week, former Bills players Marquel Lee, Jordan Phillips, and Shaq Lawson officially returned to Buffalo, and it’s not crazy to think Barkley could also join them.",
    "He loves buffalo, can win you some games if needed to come in, adored by fans, and would likely retire a Bill\n— Buffalo Smitty (@Buffalo_Smitty) March 18, 2022\nThe perfect end to a fantastic few days by the @BufaIoBills will be their signing Ryan Fitzpatrick!",
    "The undrafted quarterback out of Houston was heading into the final year of his three-year, $18 million contract, per OvertheCap.com, which included a $1 million bonus due on the third day of the 2022 league year, which he received on Friday, March 19.",
    "?pic.twitter.com/7aCzYZLKvL\n— NFL Stats (@NFL_Stats) September 8, 2019\nIn addition to the Browns and the Texans, Keenum played with the then-St. Louis Rams (2015) and Los Angeles Rams (2016), before signing with the Minnesota Vikings in 2017.",
    "While the 31-year-old had a breakout game in November 2018 against the Jets, completing 232-yard passing yards and leading the Bills to a 41-10 victory over New York, Buffalo did not renew his contract when it expired in 2020.",
    "Source also says a Matt Barkley return is in the works as well and could be finalized next week.”\nThe Barkley update doesn’t come as a huge surprise since Barkley hinted at his possible return on Twitter the day before.",
    "The Buffalo Bills have successfully bolstered numerous areas of their roster through free agency this past week, however, one gaping hole still remained, a backup quarterback for Josh Allen.",
    "Most recently, during the 2021 NFL season, Keenum started two games for the Browns, during which he passed for a total of 462 yards, three touchdowns, and one interception.",
    "Case Keenum #5 of the Cleveland Browns throws the ball during the first half against the Cincinnati Bengals at FirstEnergy Stadium on January 09, 2022.",
    "The Athletic’s Joe Buscaglia tweeted shortly after the Keenum trade news broke that former Bills backup Matt Barkley is expected to return to Buffalo.",
    "Barkley, who was drafted by the Philadelphia Eagles in the fourth-round draft pick from the 2013 NFL Draft, served as Allen’s back from 2018 to 2020.",
    "A year later, Keenum signed a two-year $36 million contract with the Denver Broncos, before he was traded to the Washington Commanders in March 2019.",
    "Buscaglia tweeted, “Source confirms the Bills have agreed to a trade with Cleveland to acquire QB Case Keenum, as @TomPelissero first reported.",
    "Ex-Bill Backup QB Matt Barkley’s Return to Buffalo Is ‘Also in the Works’\nKeenum isn’t the only backup quarterback heading to Buffalo.",
    "Before the Bills officially announced they were re-signing Lawson, the defensive end sent out a viral tweet begging Buffalo to return.",
    "In Washington, Keenum started eight games, where he tallied a total of 1,707 passing yards, 11 touchdowns, and five interceptions.",
    "Keenum has bounced around the league quite a bit since he was first signed to the Houston Texans’ practice team in 2012.",
    "Name such as Marcus Mariota and Ryan Fitzpatrick, the latter of which was the clear fan-favorite choice.",
    "!” along with a GIF of himself swinging his sideline warming jack around like a bull master.",
    "The Bills will mark the seventh franchise he’s played for since joining the NFL.",
    "While Lawson got his wish, it looks like Barkley will too.",
    "Case Keenum to Vernon Davis for the 48-yard TD ???",
    "ALL the latest Bills news straight to your inbox!",
    "Barkley kept his message short and simple.",
    "Join the Heavy on Bills newsletter here!",
    "The Commanders went 1-7 in those games.",
    "But I'd really like a better backup.",
    "Fitzpatrick makes too much sense.",
    "I love Barkley as a 3rd option.",
    "He tweeted, “Buffalooooooo!!!",
    "The Browns won both games."
  ]
}