{
  "id": 2165,
  "mediaId": 2551,
  "date": "2022-03-25",
  "headline": "Incredible medieval Scottish castle on Airbnb is named ‘hottest property’ in the UK and Ireland in 'Oscars of independent accommodation'",
  "image": "https://i.dailymail.co.uk/1s/2022/03/25/17/55805593-0-image-a-19_1648228679411.jpg",
  "link": "https://www.dailymail.co.uk/travel/travel_news/article-10652315/Medieval-Scottish-Airbnb-castle-named-hottest-property-UK-Ireland.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ted Thornhill",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Ted+Thornhill,+Mailonline+Travel+Editor",
  "termIds": [
    0
  ],
  "sentences": [
    "WINNERS AND SHORTLISTED ENTRIES IN THE 2022 'OSCARS OF INDEPENDENT ACCOMMODATIONS\nHOTTEST PROPERTY\nWinner\nKilmartin Castle – Argyll, Scotland\nFinalists\nLaythams Holiday Lets Retreat (The Lakehouse) – Lancashire, England\nChambers of Distinction – County Antrim, Northern Ireland\nBen Shea Smart Home – Morayshire, Scotland\nMerry Harriers – Surrey, England\nOUTSTANDING HOST\nWinner\nCatherine Cummings at Kiltariff Hall Country House – County Down, Northern Ireland\nFinalists\nTina Lovatt at Parkets House B&B – Powys, Wales\nDavid Looney at Tatler Jack – County Kerry, Ireland\nLauren & Keith Elstob at The Blue Bell Inn – Northumberland, England\nKaren Twist at Kinlochewe Hotel – Highland, Scotland\nUNSUNG HERO\nWinner\nJules at KVM Serviced Accommodation – Cambridgeshire, England\nFinalists\nDelphine Delaveau at Robin Hill House – County Cork, Ireland\nSheila at Bay Horse Inn – North Yorkshire, England\nTamsin at The Bridge House – Dorset, England\nTracey Toulmin at Bryn Woodlands House – Conwy, Wales\nEviivo Awards 2022\nAdvertisement",
    "Pictured here is the incredible living room\n+9\nView gallery\nStef and Simon transformed Kilmartin Castle over the months and years, with dollops of determination, into the amazing property it is today\n+9\nView gallery\nPictured here is one of the turret ensuite bathrooms at Kilmartin Castle, complete with a rain shower and heated floor\nAt the end of 2018, they set up home temporarily in a camper van outside the castle and began a huge renovation project, turning it over the months and years, with dollops of determination, into the amazing property it is today.",
    "+9\nView gallery\nBen Shea Smart Home in Morayshire, Scotland (pictured), was shortlisted in the Hottest Property category\n+9\nView gallery\nMerry Harriers, Surrey, was in the running for a 2022 Hottest Property gong\n+9\nView gallery\nOutstanding Host winner Catherine Cummings, from Kiltariff Hall Country House in Northern Ireland\nJudges describe Kilmartin Castle as ‘magical, luxurious, rustic’, combining the ‘ancient and modern’ having been ‘lovingly and thoughtfully restored’, a ‘historic, ancient’ property that is ‘discovery-inducing’.",
    "An imposing, dramatic, thick-walled fortress – but with mod cons, delightful luxury boutique touches and a splash of cool (this is a castle where guests can spin vinyl)'\n+9\nView gallery\nKilmartin Castle was named hottest property at a virtual ceremony for the 2022 Eviivo Awards, dubbed the 'Oscars of independent accommodation'\n+9\nView gallery\nWater great feature: Pictured here is the wild swimming pool at Kilmartin Castle\nKilmartin Castle was built in 1550 during the legendary reign of Mary Queen of Scots.",
    "The other hosts in the mix for the Outstanding Host gong were Tina Lovatt at Parkers House B&B, Powys, Wales; David Looney at Tatler Jack, County Kerry, Ireland; Lauren and Keith Elstob at The Blue Bell Inn, Northumberland, and Karen Twist at Kinlochewe Hotel in Scotland.",
    "The other properties in the running for the 'Hottest Property' gold medal were Laythams Holiday Lets Retreat (The Lakehouse), Lancashire; Chambers of Distinction County Antrim, Northern Ireland; Ben Shea Smart Home, Morayshire, Scotland, and Merry Harriers, Surrey.",
    "Each award winner was announced by surprise guest David Hasselhoff, who named Jules Murray at KVM Serviced Apartments in Cambridgeshire as 2022's 'Unsung Hero' and Catherine Cummings at Kiltariff Hall Country House in Northern Ireland as 'Outstanding Host'.",
    "The Unsung Hero shortlist comprised Delphine Delaveau at Robin Hill House, County Cork, Ireland; Sheila at Bay Horse Inn, North Yorkshire; Tamsin at The Bridge House, Dorset, and Tracey Toulmin at Bryn Woodlands House in Conwy, Wales.",
    "Stef Burgon and Simon Hunt bought the property for £330,000 in 2014 when they lived and worked in Dubai (Stef as a radio presenter and Simon as an ad agency creative director) and rented it to holidaymakers remotely.",
    "It was great to see so many hosts and hoteliers across the board – from B&Bs and independent hotels to self-catering rentals, apartments and alternative accommodation providers - all doing such a brilliant job.",
    "The winners were selected by a panel of industry experts, who judged each finalist across a number of different criteria, with each winner collecting a grand prize of £1,000 to put towards their property.",
    "Kilmartin Castle, in Scotland's rural Argyll, was handed the accolade last night at a virtual ceremony for the 2022 Eviivo Awards, dubbed the 'Oscars of independent accommodation'.",
    "MailOnline Travel's review of Kilmartin Castle, which can be booked through Airbnb, Sawday's and directly through the property's site, said: 'It's Game of Thrones hipster chic.",
    "Michele Fitzpatrick, CEO at hospitality software company Eviivo, added: 'We were overjoyed with the high standard and volume of entries we received for this year's awards.",
    "An imposing, dramatic, thick-walled fortress – but with mod cons, delightful luxury boutique touches and a splash of cool (this is a castle where guests can spin vinyl).",
    "+9\nView gallery\nKilmartin Castle, in Scotland's rural Argyll, has been named the 'hottest property' in the independent UK and Ireland accommodation sector.",
    "The property was an abandoned semi-ruin from 1790 until 1990 when a couple spruced it up over 10 years and used it as a holiday home.",
    "A 16th-century Scottish castle has been named the 'hottest property' in the independent UK and Ireland accommodation sector.",
    "'Plus, it has laid-back, welcoming, bonhomie-infused owners who you'll be chatting to like old friends within minutes.'",
    "They told MailOnline Travel: 'We were thrilled to be in amongst Eviivo’s list of hottest property finalists for 2022!",
    "There were some really great nominees, embodying the same experience-focused travel that we champion.",
    "This inspires us to work even harder to create those special experiences for fellow travellers.'",
    "MailOnline Travel's review of Kilmartin Castle said: 'It's Game of Thrones hipster chic.",
    "+9\nView gallery\nStef Burgon and Simon Hunt bought Kilmartin Castle for £330,000 in 2014.",
    "'Congratulations to all the winners on their well-deserved wins.'",
    "We are already talking about going to stay with a few of them.",
    "For more visit eviivo.com/week-of-the-host/winners2022.",
    "To win is fantastic recognition for us."
  ]
}