{
  "id": 2226,
  "mediaId": 2594,
  "date": "2022-03-25",
  "headline": "Seamus Power books Masters debut despite defeat in final group game in Austin",
  "image": "https://static.independent.co.uk/2022/03/25/21/f01e328a3b411299acb3c6e312ba8f6aY29udGVudHNlYXJjaGFwaSwxNjQ4MzI3ODY1-2.66048620.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/golf/tyrrell-hatton-power-austin-richard-bland-england-b2044441.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Phil Casey",
  "authorUrl": "https://www.independent.co.uk/author/phil-casey",
  "termIds": [
    2831,
    3200,
    3821,
    3968,
    4083,
    100,
    816,
    4963
  ],
  "sentences": [
    "“I’ve known Lee a long time, he’s a legend of the sport and to be able to go head-to-head with him and get one over on him was pretty special.”\nBland, who will face former world number one Dustin Johnson in the last 16, added: “It’s 18 holes but if I play the way I know I can play he’s got a game on his hands.”\nAs for qualifying for a first competitive trip to Augusta, Bland added: “I do have a friend who is a member and I’ve been there.",
    "“Those things are small margins, so if you could just make one less mistake, one less good shot, one less putt or one more putt holed and the whole kind of shape of your career can change.”\nRichard Bland is also on the verge of securing a Masters debut at the age of 49 after beating 48-year-old Lee Westwood 2 and 1 to win group nine.",
    "In a repeat of last year’s final, Horschel will face Scottie Scheffler in the last 16 after the latter twice got the better of Matt Fitzpatrick, firstly winning their group five contest 5 and 4 to force a play-off and then making a birdie on the sixth extra hole to advance.",
    "So if I get there I think, with the 12 months that I’ve had, that would be a pretty nice sort of cherry on the top.”\nDefending champion Billy Horschel had earlier produced a grandstand finish to become the first player into the knockout stages.",
    "That means the 35-year-old from Waterford will take on England’s Tyrrell Hatton in the last 16 at Austin Country Club, secure in the knowledge that he will be receiving an invite to the year’s first major at Augusta National.",
    "Power lost his final group game in the WGC-Dell Technologies Match Play against Keith Mitchell, but Patrick Cantlay’s victory over Sungjae Im ensured Power still topped group four after previous wins over Cantlay and Im.",
    "World number one Jon Rahm won group one despite losing to Patrick Reed and will face Brooks Koepka in the last 16 after the four-time major winner beat Shane Lowry on the last to maintain his 100 per cent record.",
    "Thomas Pieters was two up with two holes to play against Horschel and seemingly on course to secure the win which would set up a play-off between the pair to decide the winner of group 12.",
    "This time last year Power was bouncing between second-tier Korn Ferry Tour events and the PGA Tour before enjoying his breakthrough win in the Barbasol Championship in July.",
    "“I kind of had to get some stuff figured out with my game and I was able to figure that out and make some improvement with wedges and putting and that sort of stuff.",
    "Even this week obviously the top-ranked guys are favoured to go through, but it’s only like a shot per round maybe they might be better than anyone else.",
    "A year after being ranked outside the world’s top 450, Ireland’s Seamus Power solidified his place inside the top 50 to earn a maiden Masters appearance.",
    "However, Horschel made a birdie on the 17th and was conceded another on the last after Pieters missed from close range for his own birdie.",
    "“I need the afternoon off,” said Bland, who won the British Masters last year on his 478th start on the DP World Tour.",
    "I don’t really watch a huge amount of golf at home, but the Masters I’m there from the first shot to the last putt.",
    "“It’s just the best tournament to watch on TV and I can only assume it’s a million times better to play in it.",
    "“But if I could play the tournament, it would be a dream come true.",
    "“Me and Lee joked that whoever just finishes probably wins.",
    "“Things don’t quite seem as hard on the golf course.",
    "“The margins out here are so small.",
    "That’s what’s changed,” Power said.",
    "So I’ve played the course twice.",
    "“Obviously my golf has improved.",
    "I don’t move."
  ]
}