{
  "id": 2231,
  "mediaId": 2732,
  "date": "2022-03-26",
  "headline": "As market cools, Steelers need reinforcements at safety, receiver, running back",
  "image": "",
  "link": "https://triblive.com/sports/as-market-cools-steelers-need-reinforcements-at-safety-receiver-running-back/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Rutter",
  "authorUrl": "https://triblive.com/author/joe-rutter/",
  "termIds": [
    0
  ],
  "sentences": [
    "Given that the Steelers like to have about $5-7 million in reserve for in-season additions and that they must sign their draft class, they aren’t in the market to take on another big contract unless they push money into future years and restructure the contracts of T.J. Watt and/or Cam Heyward.",
    "Wide receiver, a position that lost JuJu Smith-Schuster, James Washington and Ray-Ray McCloud, and running back, where the Steelers could use a complementary back to Najee Harris, also could be in play before the draft.",
    "According to overthecap.com and the NFL players’ association, the Steelers are about $15 million under the cap, but that doesn’t account for the contract that cornerback Ahkello Witherspoon signed Friday.",
    "Similarly, the Pittsburgh Steelers are in a wait-and-see mode as they contemplate their next move after signing six outside free agents to contracts totaling $84.375 million, not counting incentives.",
    "A low-risk signing could be former Penn State and Broncos receiver DaeSean Hamilton, who never flourished in Denver, or Keelan Cole, who had only 28 catches in his lone year with the Jets.",
    "Jabrill Peppers, taken by the Cleveland Browns five picks before the Steelers selected T.J. Watt, is a free agent after wrapping up a third season with the New York Giants.",
    "Wide receiver\nDiontae Johnson and Chase Claypool are the only experienced NFL starters on the roster, which means the Steelers likely use a high draft pick on the position.",
    "Jordan Howard began his career with back-to-back 1,000-yard seasons in Chicago, but injuries limited him to 24 games the past three years with the Dolphins and Eagles.",
    "Almost two weeks after the legal tampering period opened and a dozen days after free agents could sign contracts, the NFL market predictably has slowed to a crawl.",
    "The Steelers have addressed issues on the offensive line by bringing back right tackle Chuks Okorafor and signing interior linemen James Daniels and Mason Cole.",
    "That would seem to rule out the Steelers making a big push for former Chiefs safety Tyrann Mathieu, who is coming off a three-year, $42 million deal.",
    "Safety\nBy declining to exercise the $6.75 million fifth-year option on Terrell Edmunds last year, the Steelers allowed him to test free agency.",
    "Most of the big name players already have signed and those who remain on the market are waiting for a satisfactory contract proposal to emerge.",
    "They got starters at inside linebacker (Miles Jack) and cornerback (Levi Wallace) and a likely starter at quarterback (Mitch Trubisky).",
    "The Steelers wouldn’t mind keeping the Edmunds-Minkah Fitzpatrick pairing intact but only at a price the organization deems reasonable.",
    "Marlon Mack rushed for 1,091 yards with the Colts in 2019, but injuries limited him to seven games combined over the past two seasons.",
    "Running back\nIf the Steelers want to limit Harris’ usage after he had 307 carries as a rookie, they have options in free agency.",
    "Will Fuller played in three games last year with the Miami Dolphins before breaking a finger and missing the rest of the season.",
    "He missed one game and started 60 of 64 the past four seasons, but his availability shows that teams weren’t wowed by his play.",
    "Darrel Williams, a part-time starter in Kansas City last year, had 144 carries, 558 yards and six touchdowns for the Chiefs.",
    "Gipson, though, will turn 32 in August and was limited to 12 games last year because of hip and hamstring injuries.",
    "Having a veteran in the room would help, too, and several options remain available to round out the depth chart.",
    "Trouble is, several teams are trying to land him, and the Steelers might choose to use their dollars elsewhere.",
    "A low-cost option could be former Chicago Bears safety Tashaun Gipson, who has started 132 games in 10 seasons.",
    "They added a return specialist in Gunner Olszewski and retained core special teams player Miles Killebrew.",
    "Safety, though, is one of several positions the Steelers could address in this next wave of free agency.",
    "He has familiarity with Brian Flores, but injuries have limited Fuller to 52 starts in six seasons.",
    "A five-time Pro Bowl pick in eight seasons, Landry is comfortable lining up in the slot.",
    "At 31, Carlos Hyde’s best days are behind him and could be an affordable backup option.",
    "Jarvis Landry is the biggest name available after the Browns cut him March 14.",
    "Hilton, Julio Jones, Emmanuel Sanders — or come with baggage (Cole Beasley).",
    "The Steelers have familiarity with Alex Collins from his days in Baltimore.",
    "Phillip Lindsay had 1,000-yard seasons in his first two years with Denver.",
    "Peppers, though, is coming off an ACL tear that he sustained in October.",
    "You can contact Joe by email at jrutter@triblive.com or via Twitter .",
    "Landry also has switched agents in an attempt to get a better offer.",
    "Last year, Benny Snell’s 36 carries were second-most on the team.",
    "Kalen Ballage, who is an unrestricted free agent, had 12.",
    "He’s back on the market after two seasons in Seattle.",
    "Another former first-rounder remains a free agent.",
    "Edmunds has a more inflated sense of his worth.",
    "Other unsigned veterans are either old — A.J.",
    "Joe Rutter is a Tribune-Review staff writer.",
    "The past two years, he has totaled 751.",
    "Categories: Sports | Steelers/NFL",
    "Green, T.Y."
  ]
}