{
  "id": 2253,
  "mediaId": 2586,
  "date": "2022-03-24",
  "headline": "NFL Draft Guru Mel Kiper Sees Eagles Taking ‘Underrated’ Baylor Track Star",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-1362300356-e1648132182567.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/philadelphia-eagles/jt-woods-baylor-draft/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Greger",
  "authorUrl": "https://heavy.com/author/mikegreger/",
  "termIds": [
    1774,
    2325,
    3357,
    3973,
    116,
    209,
    671,
    817
  ],
  "sentences": [
    "And if he doesn’t go 2, then he goes 3 or 4.”\nNext up in @ttwentyman's Meet the Prospect series is @NDFootball's Kyle Hamilton.https://t.co/FouyBojyzN pic.twitter.com/NVf9KdacAG\n— Detroit Lions (@Lions) March 23, 2022\nThe Eagles own three picks in the first round — No.",
    "He’s not convinced they hold onto all three picks but if they did he likes the following guys: DE Jermaine Johnson II (Florida State), WR Chris Olave (Ohio State), LB Devin Lloyd (Utah).",
    "“I don’t think they use all three but having that maneuverability is going to be interesting to see how creative they are come draft day,” Kiper said.",
    "Woods (6-foot-2, 195 pounds) has legitimate sprinter’s speed — 4.36 seconds in the 40 — and earned a reputation as a “rangy playmaker” for the Bears.",
    "Forget About Notre Dame’s Kyle Hamilton\nKyle Hamilton (Notre Dame) is probably the most heralded safety to come out of college since Isaiah Simmons.",
    "@BUFootball\n— NFL (@NFL) March 6, 2022\nPitre is considered a sure-fire second-rounder, but his partner in the secondary is severely underrated.",
    "— NFL (@NFL) March 6, 2022\nPercy Butler (Louisiana-Lafayette) would be an intriguing option in the fourth or fifth round, according to Kiper.",
    "Woods in the third or the fourth round would be a good pick.”\nAs if 4.38u wasn't enough…\nJT Woods put on a SHOW in the 40!",
    "Safety Dance: Second-Round Options\nWoods might be Kiper’s favorite to land in Philly, but he’s far from the only option.",
    "Those three guys would join Jalen Pitre (Baylor) if the Eagles wanted to burn a second-round pick on an impact safety.",
    "“This is a deep draft in some spots, like in the fourth and fifth rounds, so you can find starters in those rounds.”",
    "ESPN’s draft guru sees potential fits in Lewis Cine (Georgia), Jaquan Brisker (Penn State), Daxton Hill (Michigan).",
    "BAYLOR 21\nOLE MISS 7\n— Brendan Moore (@bmoorecfb) January 2, 2022\nThe latest Eagles news straight to your inbox!",
    "He finished the 2021 campaign with 56 tackles while leading the Big 12 Conference with six interceptions.",
    "Todd McShay – Kiper’s colleague at ESPN — threw one more name into the mix: Kerby Joseph out of Illinois.",
    "“You know, [Jalen] Pitre gets all the publicity and rightfully so — he’s a heck of a player — but J.T.",
    "He provided Heavy with a list of hard-hitting safeties to watch, highlighted by a college track star.",
    "He had 44 tackles, along with two interceptions, six pass breakups, and two forced fumbles in 2021.",
    "Either way, Hamilton is expected to be a stud, a plug-and-play starter and a perennial Pro Bowler.",
    "Scouts love his ball skills, although he lacks “thump-and-finish” when making tackles in the box.",
    "Safety is the one position the Philadephia Eagles need to strike it rich on in April’s draft.",
    "ESPN draft expert Mel Kiper Jr. sees plenty of options for the Eagles on Day 2 and later.",
    "19 — and Kiper has them addressing other needs outside of safety with those selections.",
    "And Nick Cross (Maryland) could be there in the fourth or fifth round, per Kiper.",
    "He had the fifth-most career-interception return yards in program history (201).",
    "When I went back to watch two or three games from last year he jumped out, J.T.",
    "They have no veteran depth after missing on everyone in free agency.",
    "Gerry Bohanon swings it out to Tyquan Thornton for the 3 yard TD.",
    "He had 66 tackles, plus three sacks and three picks last season.",
    "Luckily, the NFL draft provides an opportunity for a quick fix.",
    "“I’ll tell you a guy I like who’s underrated is J.T.",
    "Or maybe Minkah Fitzpatrick is a better comparison.",
    "Is there any way he could drop to the Eagles at No.",
    "Woods out of Baylor in the third or fourth round.",
    "Their starting tandem entering the 2022 campaign?",
    "End of this drill's about locating the football.",
    "JT Woods picks off Luke Altmyer & they cash in.",
    "Kiper has him going to the Detroit Lions at No.",
    "Join the Heavy on Eagles newsletter here!",
    "2 overall in his most recent mock draft.",
    "“It’s not going to happen,” Kiper said.",
    "He could stand to bulk up a bit, too.",
    "Woods from Baylor,” Kiper told Heavy.",
    "“Because he’s going to go 2 I think.",
    "Woods is a good football player.",
    "Anthony Harris and Marcus Epps.",
    "Percy Butler does it perfectly.",
    "The Bears have a 2 score lead.",
    "Baylor adds another score.",
    "Perish the thought.",
    "Keep an eye on J.T.",
    "I like him a lot.",
    "Not great.",
    "No chance.",
    "15, No.",
    "16, No.",
    "15?"
  ]
}