{
  "id": 2256,
  "mediaId": 2518,
  "date": "2022-03-28",
  "headline": "Benton County marriage licenses",
  "image": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/200993873_marriage_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676",
  "link": "https://www.arkansasonline.com/news/2022/mar/28/benton-county-marriage-licenses/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terri OByrne",
  "authorUrl": "https://www.arkansasonline.com/staff/terri-obyrne/",
  "termIds": [
    0
  ],
  "sentences": [
    "Benton County\nMarch 17\nJoshua Alexander Coggeshell, 21, and Michael Lamar Register, 19, both of Rogers\nJordon Paul Enget, 30, and Rebecca Niccole Hill, 34, both of Fort Worth, Texas\nJohn Richard Fitzpatrick III, 30, and Makayla Dawn Spitz, 25, both of Rogers\nShawn Eugene Howard, 53, Spiro, Okla., and Jennifer Elaine Jackson, 42, Lavaca\nDavid Clark Kay, 24, Fayetteville, and Anna Katherine Lopez, 24, Pea Ridge\nLogan Blake Rose, 26, Pea Ridge, and Skye Laine Craig, 25, Bentonville\nMarch 18\nClint Logan Bush, 28, and Shelby Rebecca Rye, 28, both of Bella Vista\nChristopher Brian Coatney, 47, and Isha Sharma, 34, both of Ponca City, Okla.\nBrian Andrew Conner, 35, and Jennifer Lorraine Gagne, 34, both of Lowell\nGary Devlin, 65, and Luba Nichipor, 54, both of Bella Vista\nJonna Clare Farmer, 26, and Allyson Mackenzie Paul, 26, both of Fayetteville\nCharles Alexander Hollister, 28, and Jill Marie Carter, 28, both of Bella Vista\nLandon Guy Lloyd Krout, 19, Rogers, and Kara Hope Scott, 18, Gravette\nJames Thomas Larsen, 25, and Cassady Alexa Pearce-Grubb, 26, both of Bentonville\nKraig Erwin Max, 55, and Kari Lee Casias, 54, both of Pea Ridge\nJuan Antonio Palacios Rodriguez, 35, and Emily Medrano, 29, both of Rogers\nHampton Cole Williams, 27, and Christina Augusta Musial, 24, both of Bentonville\nMarch 21\nMichael Joseph Bligh, 61, and Debra Lorraine Kaufman, 62, both of Bentonville\nTroy Allen Cook, 45, and Luanna Azzarito, 41, both of Rogers\nBilly David Counts, 44, and Monica Gonzalez, 25, both of Siloam Springs\nMalaw N Dibaneh, 38, and Fatoumata Conta, 27, both of Rogers\nJeffrey Randall Frerking, 25, Prairie Grove, and Ashley Lynn Janes, 26, Centerton\nHarold Wesley Holliday, 36, and Molly Erin Hottinger, 25, both of Bentonville\nJeffrey A. Johnston, 30, and Shannon B. Blackledge, 34, both of Rogers\nJeffrey William Klenklen, 30, and Carly Ann Parker, 25, both of Pittsburg, Kan.\nJohn Arthur McFadden, 67, and Judy Anna Moloney, 66, both of Gravette\nJorge Orta Gracian, 49, and Abril Sagrario Martinez Rodriguez, 50, both of Rogers\nMatthew Vincent Patton, 23, Diamond, Mo., and Layne Michelle Karhoff, 22, Girard, Kan.\nJose Ivan Pereira Gonzalez, 20, and Mirna Jeaneth Herrera Santos, 20, both of Siloam Springs\nEric Lee Windelkin, 48, Greenwood, and Jennifer Lee Clelland, 45, Bella Vista\nMarch 22\nLawrence Alan Bowman, 68, and Janet Lynn Poplin, 67, both of Bella Vista\nJerod Charles Bradshaw, 40, and Michelle Ann Alexander, 43, both of Bentonville\nBandy Ray Harris, 39, Quapaw, Okla., and Brandi Dawn Rupert, 38, Miami, Okla.\nDylan Tyler Moody, 31, and Amber McKenzie Warrington, 25, both of Noel, Mo.",
    "March 23\nJosue Israel Garcia, 21, and Mya Senei Olivarez, 18, both of Rogers\nSpencer Charles Heald, 24, and Alexandrea MacKenzie Abbott, 24, both of Bentonville\nLeon Hodge, 83, Rogers, and Wanda Lue Hunnicutt, 77, Springdale\nKyle Lee Huffman, 33, and Maranda Tenae Caudle, 33, both of Bentonville\nJoseph Frank Johns IV, 34, and Taylor Ellen Finn, 27, both of Bentonville\nTyler Beckham Schlaf, 31, and Miranda Leigh Stave, 30, both of Rogers\nSamantha Carol Scofield, 29, and Heather Ann Corral, 28, both of Fayetteville\nMatthew Gerrit Voskamp, 36, and Anne Hany Attia, 30, both of Rogers\nRandy Lee Wright, 26, and Maggie Aileen Ryan, 28, both of Gravette\nSponsor Content"
  ]
}