{
  "id": 2277,
  "mediaId": 2710,
  "date": "2022-03-24",
  "headline": "Climate-minded Utah gas customers now can pay to remove as much carbon as they generate",
  "image": "https://www.sltrib.com/resizer/tM5HQBjblMY9TJ9pGkr-U-1z8eQ=/1200x630/cloudfront-us-east-1.images.arcpublishing.com/sltrib/7F5AKHFQW5A6NERR6ILXMGCJHU.jpg",
  "link": "https://www.sltrib.com/news/environment/2022/03/24/climate-minded-utah-gas/",
  "mediaOutlet": "The Salt Lake Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Fitzpatrick",
  "authorUrl": "https://www.sltrib.com/author/tfitzpatrick",
  "termIds": [
    0
  ],
  "sentences": [
    "Turning garbage into electricity\n(Trent Nelson | The Salt Lake Tribune) Wells at Trans-Jordan Landfill capture methane gas from rotting waste in the landfill and use it to produce electricity in South Jordan on Wednesday, March 16, 2022.",
    "“It’s basically a giant burrito,” says Jaren Scott, executive director of Trans-Jordan Cities, which operates the Trans-Jordan Landfill, the principal garbage dump for the southern half of the Salt Lake Valley.",
    "Projects like Trans-Jordan’s are monitored by independent organizations — the Climate Action Reserve and the American Carbon Registry — to see that they’re actually removing what they claim to remove.",
    "It also encourages efficiency through its “ThermWise” program and has its own renewable gas program called “GreenTherm,” which allows customers to buy gas from renewable sources like landfills.",
    "Dominion is quick to point out that natural gas is the cleanest of the fossil fuels, which is why most of the coal-fired power plants in the nation have been replaced by natural gas turbines.",
    "And Dominion Energy is able to purchase carbon offset credits for the TransJordan project, which allows Dominion customers to pay the extra fee to essentially take credit for those offsets.",
    "To curb emissions on a meaningful scale, we need to decarbonize our energy grid, and make our homes and buildings energy efficient and electric.”\nWhat’s the future for natural gas systems?",
    "According to Andrew Hegewald, gas business development manager at Dominion, that test is going to be expanded in the next two years to about 2,500 Dominion households in one service area.",
    "“We’re in the very early days of the hydrogen economy.”\nTim Fitzpatrick is The Salt Lake Tribune’s renewable energy reporter, a position funded by a grant from Rocky Mountain Power.",
    "Called “CarbonRight,” Dominion Energy’s new program is aimed at the million customers in Utah, Idaho and Wyoming served by Dominion, the Beehive State’s largest natural gas utility.",
    "The ultimate goal is electrification, according to Kevin Emerson, the director of energy efficiency and building decarbonization for the nonprofit Utah Clean Energy.",
    "Utah’s natural gas customers now can buy credits that pay for removing the same amount of greenhouse gases that they generate in their home furnaces and appliances.",
    "That methane is trapped in the liner, and the landfill has a series of wells and a vacuum that sucks it out and uses it as fuel for three electrical generators.",
    "That city uses the power to supply electricity to about 3,000 homes, according to Matt Youngs, energy services and regulatory compliance manager for Murray.",
    "This story is part of The Salt Lake Tribune’s ongoing commitment to identify solutions to Utah’s biggest challenges through the work of the Innovation Lab.",
    "In this case, Dominion Energy has agreements with methane-capture projects in Utah and Missouri and a hardwood forest conservation project in Minnesota.",
    "If it is embraced by most of Dominion’s Utah customers, it will take 20 or more projects like Trans-Jordan’s to offset their carbon footprint.",
    "Burning fossil fuels, including natural gas, generates carbon dioxide, a greenhouse gas that blocks radiation from escaping the atmosphere.",
    "It’s $5 a month to offset the average Dominion customer’s consumption, and heavier users can buy more offsets in $5 a month increments.",
    "At that low ratio of hydrogen to natural gas, the mixture can work safely in traditional furnaces and appliances without modification.",
    "They have become attractive to technology companies and airlines, which have large fuel demands but still want to be carbon neutral.",
    "As the garbage decomposes, it releases its own natural gas (methane) that is an even stronger greenhouse gas than carbon dioxide.",
    "The company has been running tests using 5% hydrogen mixed in with the natural gas at its training facility in Salt Lake County.",
    "So if people are still burning the same amount of fossil fuel in their homes, are we really making progress on climate change?",
    "Dominion has hydrogen ambitions beyond a 5% mix, and it has a company goal of being a net-zero carbon energy company by 2050.",
    "For $5 a month, Dominion Energy will “offset” customers’ carbon with green projects at Trans-Jordan Landfill and elsewhere.",
    "Carbon offsets offer a way to compensate for the added CO2 by removing greenhouse gases from the atmosphere elsewhere.",
    "That hydrogen will be “green” hydrogen, meaning it will be produced from carbon-free sources like solar or wind power.",
    "With 4 out of 5 Utah homes heated by natural gas, Dominion isn’t ready to concede its turf to electricity providers.",
    "And erasing greenhouse gases from the atmosphere by whatever means is a necessary part of addressing climate change.",
    "That substantially reduces the climate effect of the methane and adds clean energy to the electrical grid.",
    "It’s put in lined beds that then are covered with a liner on top (the “burrito”) and covered with dirt.",
    "The Trans-Jordan project has been producing electricity since 2005 under a partnership with Murray.",
    "The Tribune retains all control over editorial decisions independent of Rocky Mountain Power.",
    "Still, it’s an open question as to how many people will participate in CarbonRight.",
    "Instead of adding methane to the air, it’s used to power electrical generators.",
    "These kinds of programs (like CarbonRight) have good potential,” Emerson said.",
    "Dominion also is pursuing more use of a fuel that could be a game changer.",
    "Could Dominion’s network someday deliver hydrogen instead of natural gas?",
    "Worried about the climate change you’re causing when you heat your house?",
    "Landfills are required to completely seal the garbage they receive.",
    "“The climate challenge requires us all to think holistically.",
    "Simply cutting fossil fuel usage isn’t going to be enough.",
    "Hegewald couldn’t say for sure, but it’s a possibility.",
    "“However, it is only one small piece of the puzzle.",
    "That blocked radiation is warming the planet.",
    "It’s one more example of carbon offsets.",
    "Your rotting garbage is here to help.",
    "[Subscribe to our newsletter here.]",
    "Are carbon offsets enough?",
    "RELATED STORIES",
    "Of a sort."
  ]
}