{
  "id": 2295,
  "mediaId": 2523,
  "date": "2022-03-26",
  "headline": "NFL Free Agents Who Could Break the Bank in 2023",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/510/294/907252bb1bfdc71e9b9871c3325cdbda_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2954751-nfl-free-agents-who-could-break-the-bank-in-2023",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Kay",
  "authorUrl": "https://bleacherreport.com/users/154dd674-8be2-4ed9-9ad2-319633d217eb",
  "termIds": [
    0
  ],
  "sentences": [
    "While Nelson struggled with nagging injuries this past season, he still earned a second-team All-Pro nod—a slight step back from the three consecutive first-team All-Pro teams he made to start his career—as he cleared holes for Jonathan Taylor, who led the league in rushing in his breakout second season.",
    "He's already going to cost nearly $13 million for the upcoming campaign after the organization picked up his fifth-year option, making him one of the higher-paid linebackers in football, and another promising showing could push the value of his next contract into the upper stratosphere for the position.",
    "Pittsburgh had no qualms picking up Fitzpatrick's fifth-year option, worth $10.6 million, after the playmaker contributed an impressive 260 tackles, 27 pass defenses, 11 interceptions, four fumble recoveries and three forced fumbles since joining the team early in the 2019 campaign.",
    "While he may not get the same type of deal that contemporaries like Christian McCaffrey ($16 million average annual value) or Ezekiel Elliott ($15 million AAV) have recently signed, Barkley could still net an eight-figure yearly contract from a RB-needy squad in 2023.",
    "While Samuel—who is eligible for an extension as early as this offseason as a member of the 2019 draft class—may not cash in on as big of a payday as Hill, he should score a long-term deal worth at least $20 million annually with the potential for more.",
    "The 2018 Offensive Rookie of the Year may benefit from a change of scenery and improved offensive line, as he failed to find much success running behind a unit that Pro Football Focus graded as the league's third-worst last year.",
    "Although Baltimore suffered through its only losing campaign and missed the postseason for the first time since drafting Jackson in 2018, the team will want to do everything in its power to retain the 25-year-old quarterback.",
    "Whether that comes during the final year of his rookie deal or in 2023 and beyond, the ultra-athletic, rangy linebacker who is still just 23 years old has a real chance to evolve into a game-changing defensive player.",
    "QB Lamar Jackson, Baltimore Ravens\nThe Baltimore Ravens are coming off a rare down year in the Lamar Jackson era, but the 2019 NFL MVP is still likely to become one of the highest-paid free agents next spring.",
    "He caught 77 of his 121 targets for 1,405 yards and six touchdowns, rushed 59 times for 365 yards and eight scores and even added a 24-yard touchdown pass in the season finale with a playoff berth on the line.",
    "WR Deebo Samuel, San Francisco 49ers\nThe San Francisco 49ers made an unexpected run to the NFC Championship Game last year largely thanks to Deebo Samuel's emergence as an all-around weapon in their offense.",
    "He earned a 79.7 PFF grade or higher in each of his first three seasons, and although he took a slight step back with a 69.1 grade in 2021, he still had a major impact on the team's improved rushing attack.",
    "Given Jackson's importance to this organization and the sustained regular-season success it has found under him, it's reasonable to expect a big-money, long-term agreement will be reached rather quickly.",
    "The Ravens are still looking for their first Super Bowl appearance under Jackson, but the quarterback finally broke through and won a playoff game in 2021 after a 0-2 start to his postseason career.",
    "Team president Art Rooney II said back in January that the club wants to hammer out an extension for Fitzpatrick during the 2022 offseason, but the two sides have not come to an arrangement yet.",
    "Although Fitzpatrick came down to earth a bit in 2021 after earning first-team All-Pro nods in 2019 and 2020, he still projects to become one of the most handsomely paid safeties in the league.",
    "S Minkah Fitzpatrick, Pittsburgh Steelers\nAfter a slow start to his career, Minkah Fitzpatrick quickly evolved into one of the game's best safeties following a trade to the Pittsburgh Steelers.",
    "G Quenton Nelson, Indianapolis Colts\nThe Indianapolis Colts have had the good fortune to employ Quenton Nelson, one of the league's top interior offensive linemen, for the last four years.",
    "It's highly unlikely that will happen, however, as the Ravens always have the option of franchise-tagging him in each of the next two seasons if they can't come to terms on an extension.",
    "While Jackson has thrown for nearly 10,000 yards and has notched 84 touchdown passes in his career, he's also amassed a whopping 3,673 rushing yards and scored 21 times on the ground.",
    "The free-agency signing frenzy that started off the new league year is finally starting to slow down, making this a great time to look ahead to next year's crop of available talent.",
    "He boasts an impressive 37-12 record as a starter and owns a .717 career winning percentage, which trails only Tom Brady and Patrick Mahomes amongst active starting quarterbacks.",
    "Some of these stars are in line for a big payday due to their combination of proven career production, potential to contribute well into the future and clean bills of health.",
    "Others may have been productive in the past but are now getting up there in football years or have dealt with injuries that will limit their earning power on a new contract.",
    "He has a rather unique impact as both a pass-catcher and runner in head coach Kyle Shanahan's system, but he gets results and is going to cash in on a major contract.",
    "Barkley started his career red-hot, amassing over 2,000 yards from scrimmage his rookie season and scoring 23 total touchdowns over his first two years in the NFL.",
    "According to Grant Cohn of SI.com, Samuel confidently stated that he's a \"wide back, a wide receiver playing running back\" when asked to describe his position.",
    "While he earned Pro Bowl nods in both 2019 and 2020, there is a sense that the 6'5\", 250-pound linebacker should be making an even larger impact for the club.",
    "He returned to start the 2021 campaign but still ended up missing four games, and he rarely looked like the dynamic playmaker the New York Giants drafted No.",
    "Given his incredible production and consistency over these past few years, it's likely he will earn a record-setting contract for his position next spring.",
    "Injuries and poor performance over the last two years have lowered Barkley's trajectory, but he could still end up inking a pricy deal next spring.",
    "LB Tremaine Edmunds, Buffalo Bills\nTremaine Edmunds has been a polarizing player since joining the Buffalo Bills as a first-round pick in 2018.",
    "We'll focus on the former here, a group preparing to have the Brink's truck backed up if and when they hit the open market as 2023 free agents.",
    "Edmunds has racked up plenty of tackles, totaling 463 in the 61 games he's started, but he hasn't made many game-changing plays in that span.",
    "Unfortunately for the Bills, it will likely cost the club heavily to retain Edmunds even if he doesn't have a true breakout season in 2022.",
    "If a deal does not get done, expect Fitzpatrick to break the bank when he signs his next contract as one of the top 2023 NFL free agents.",
    "RB Saquon Barkley, New York Giants\nIt once appeared Saquon Barkley was on track to become one of the league's highest-paid running backs.",
    "But despite those pedestrian numbers, a team will likely roll the dice on his upside when he hits the open market next year.",
    "The Penn State product missed just three games in that span but has since seen his career derailed by a series of injuries.",
    "The former Kansas City Chiefs star signed what is effectively a three-year extension with $75 million in new money.",
    "He's recorded a meager 28 passes defended, 26 tackles for loss, four interceptions and two forced fumbles in total.",
    "He'll be just 26 years old when the 2022 campaign gets underway and could still have plenty of tread on his tires.",
    "If the team wants to keep him around for another half-decade, it will need to shell out some big bucks in 2023.",
    "11 overall in 2018, but he returned to his natural free safety position and blossomed with the Steelers.",
    "Tyreek Hill helped set Samuel's market when he was traded to the Miami Dolphins earlier in the week.",
    "The Colts went from averaging 124.8 yards per game (11th in the league) in 2020 to the league's No.",
    "It's unlikely Nelson's next contract will be impacted by the minor injuries he dealt with in 2021.",
    "Since the start of 2020, Barkley has recorded just 950 yards from scrimmage and four touchdowns.",
    "The third-year veteran did nearly everything at a high level for this organization last year.",
    "Nelson has been a stalwart in the offensive trenches for Indianapolis since being drafted No.",
    "The Louisville product has also helped revolutionize the position with his unique skill set.",
    "There are plenty of notable players finishing out the final year of their contract in 2022.",
    "If not, there should be no shortage of suitors if Jackson were to hit the open market.",
    "Here's a look at some of the players teams will have to break the bank for next year.",
    "The Alabama product struggled at times with the Miami Dolphins, who selected him No.",
    "The Steelers certainly do not want to let the 25-year-old test the open market.",
    "The most concerning was a torn ACL that limited him to just two games in 2020.",
    "Few would doubt the potential for Edmunds to make a significant leap soon.",
    "The Notre Dame product has missed just four starts since joining the NFL.",
    "Like that position, Samuel's value can also be tough to quantify.",
    "2 ground game with an average of 149.4 yards in 2021.",
    "Jackson has been a revelation for the Ravens.",
    "6 overall in 2018.",
    "2 overall in 2018.",
    "B/R Recommends"
  ]
}