{
  "id": 2300,
  "mediaId": 2937,
  "date": "2022-03-27",
  "headline": "PGA TOUR: Scottie Scheffler wins match play, is new World No. 1 ... Third-place for Corey Conners ... Tiger sighting",
  "image": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2022/03/1388060346_91525152-scaled-e1648427356451.jpg?quality=100&strip=all",
  "link": "https://torontosun.com/sports/golf/pga-tour-scottie-scheffler-wins-match-play-is-new-world-no-1-third-place-for-corey-conners-tiger-sighting",
  "mediaOutlet": "torontosun.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon McCarthy",
  "authorUrl": "https://torontosun.com/author/jmccarthypm/",
  "termIds": [
    2006,
    2086,
    2124,
    2242,
    2831,
    100,
    816,
    5351
  ],
  "sentences": [
    "“The format of match play, as well, for the Presidents Cup is definitely on my mind a little bit.”\nConners semifinal match versus Kevin Kisner was a clash of styles: Kisner, the gritty competitor who makes every putt and gets in your head; against Conners, who stays in every hole, plays his own game, and wears you out by hitting fairways and greens.",
    "“I got my first win in Phoenix, and then I guess this is my third now, and golly, what a long week.”\nArticle content\nO CANADA\nCorey Conners became the first Canadian to reach the semifinals at the WGC Match Play, and went on to defeat Johnson 3&1 in the consolation match to claim third place and $852,000.",
    "Article content\nWith uncharacteristic early year inconsistency firmly behind him, Conners heads confidently to the Valero Texas Open — the site of his lone PGA Tour win — before making the trip to Augusta National for the Masters, where he has back-to-back top-10 finishes.",
    "Let’s hope they vote yes … In the near-miss category, it looked for a while as though folk hero to middle-aged men everywhere Richard Bland, 49, would earn a spot in the Masters field by cracking the top-50 this week after making it out of group play in Austin.",
    "Like I told him after, enjoy the hell out of how well you’re playing, man.”\nAs easy as Scheffler seemed to make it look on Sunday, he wouldn’t have made it to the weekend had he not won a six-hole playoff over Matthew Fitzpatrick to escape the group stage.",
    "“Still hitting it very well, and chipping and putting as good as I ever have now … feel great about all parts of my game.”\nOne person outside Canada who likely was keeping a close eye on Conners is Presidents Cup International captain Trevor Immelman.",
    "The recently un-retired LeBlanc shot a final round four-under 68 and finished tied for fourth at 14-under … At some point before next year’s WGC Match Play, members at Austin Country Club will vote on whether to continue hosting the event.",
    "Conners’ trademark ball-striking was on full display in Austin, and was complemented nicely by a hot putter and an improved short game that is sure to excite Canadian golf fans with the Masters just a week away.",
    "For the most part, Conners played his role to a tee, driving the ball with ease and rhythm, frequently reaching down to grab his tee worry-free as his ball soared perfectly toward his target.",
    "Article content\nOn Sunday, Scheffler picked up his third PGA Tour win in his past five starts at the WGC-Dell Match Play at Austin Country Club, in his home state of Texas.",
    "It was always just about being out here and competing.”\nScheffler showed an incredible mixture of power and touch around the greens, dominating both his Sunday matches.",
    "“It was a great week, a long week; it wasn’t the match I wanted to be playing in this afternoon, but nice to come out on top,” Conners said of his consolation win.",
    "Article content\n“I’ve been trying to put some good results on the board to move up the rankings, and yeah, this is definitely a good week,” Conners said.",
    "“I feel like I played really solid, and I take a lot of positives from that.”\nCHIP SHOTS\nGreat week for Maude-Aimee LeBlanc at the LPGA’s JTBC Classic.",
    "Article content\nScheffler took home $2.1 million and will replace Jon Rahm atop the world rankings, becoming the sixth youngest player to reach No.",
    "Conners has been a strong match play golfer since his days in college when he made it to the semifinal and final in two separate trips to the U.S.",
    "“I couldn’t get it going with the putter in the final match and Scottie is probably playing the best golf on the planet right now,” Kisner said.",
    "In his morning semifinal, Scheffler jumped out to a 5-up lead over Dustin Johnson through 11 holes, before finishing him off 3&1.",
    "With the match all-square, Conners watched as his 23-foot birdie putt from just off the green raced eight feet past the hole.",
    "It was more of the same versus Kisner in the final, as he raced out to a 3-up lead after six holes and never looked back.",
    "It’s still a long shot but anyone saying the walk is too hard at Augusta must be forgetting who they’re talking about.",
    "“My game definitely feels good, I feel like I made a lot of strides with my short game,” Conners said on Sunday.",
    "Conners’ bogey handed Kisner a 1-up lead heading to the final hole and led to a 2-up victory for the American.",
    "“I grew up wearing long pants to go practice because I wanted to be a professional golfer,” Scheffler said.",
    "The 25-year-old capped off a busy week of head-to-head golf by defeating Kevin Kisner 4&3 in the final.",
    "The turning point in the tight back-and-forth semifinal match came at the par-3 17th hole.",
    "The Listowel, Ont., native moves to 32nd in the world rankings, matching his career best.",
    "That’s the nature of match play though, and there’s no looking back for the new World No.",
    "Give the young guy a chance … … Is Tiger Woods gearing up for a Masters appearance?",
    "The Presidents Cup will take place in September at Quail Hollow in North Carolina.",
    "Perhaps the green jackets at Augusta should offer him Phil Mickelson’s spot.",
    "Bigfoot-style video taken from Medalist in Florida suggests he might be.",
    "Two months ago Scottie Scheffler had never won, now he’s World No.",
    "In the end, he fell just short and moves to 53rd in the world.",
    "It was his second match of the day, and seventh of the week.",
    "“It’s been kind of a crazy past few months,” Scheffler said.",
    "Article content\nKisner had no answers for Scheffler.",
    "“I don’t think I won a hole the whole match.",
    "… The rankings never really crossed my mind.",
    "I dreamed of being out here.",
    "“That’s what I dreamed of.",
    "He’s playing great.",
    "Hats off to him.",
    "Amateurs.",
    "1.",
    "1.",
    "1."
  ]
}