{
  "id": 2315,
  "mediaId": 2523,
  "date": "2022-03-23",
  "headline": "Steelers Rumors: Tyrann Mathieu, Damontae Kazee Interest PIT in NFL Free Agency",
  "image": "https://media.bleacherreport.com/image/upload/v1648039733/gcvgzglsla7jzyyvmsva.jpg",
  "link": "https://bleacherreport.com/articles/10030613-steelers-rumors-tyrann-mathieu-damontae-kazee-interest-pit-in-nfl-free-agency",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Chiari",
  "authorUrl": "https://bleacherreport.com/users/82f455f6-6745-445e-8c91-b8c0044d3c37",
  "termIds": [
    0
  ],
  "sentences": [
    "Regardless of what the Steelers decide to do at safety, the offseason has to be considered a success for them thanks to the signings of quarterback Mitchell Trubisky, linebacker Myles Jack, cornerback Levi Wallace and offensive linemen James Daniels and Mason Cole, among others.",
    "The 29-year-old veteran has spent nine seasons in the NFL with the Arizona Cardinals, Houston Texans and Kansas City Chiefs, earning three Pro Bowl nods, three First Team All-Pro selections and one Super Bowl win during that time.",
    "Norwood was a seventh-round pick in 2021 who started three games as a rookie, Killebrew is primarily a special teamer who has started four games in six NFL seasons, and Stiner has never appeared in a regular-season game.",
    "Mathieu was a Pro Bowler and First Team All-Pro in 2020 when he registered a career-high six interceptions with the Chiefs, and he was a Pro Bowler again last season after finishing with 76 tackles and three picks.",
    "His best season to date remains 2018 when he set a career high and led the NFL with seven interceptions, while also setting new career marks with 82 tackles and 10 passes defended as a member of the Falcons.",
    "Kazee, 28, is a five-year NFL veteran with the Atlanta Falcons and Dallas Cowboys coming off a season that saw him start 15 of 17 games for Dallas and finish with 52 tackles and two interceptions.",
    "Edmunds had 89 tackles and two interceptions last season but just five interceptions in his four-year career, and he didn't necessarily live up to the expectations the Steelers had for him.",
    "One of Pittsburgh's safety spots is locked down by Minkah Fitzpatrick, but the other remains unstable, with Tre Norwood, Miles Killebrew and Donovan Stiner being the top in-house options.",
    "According to ESPN's Jeremy Fowler, the Steelers have shown interest in Tyrann Mathieu and Damontae Kazee, and they also aren't ruling out the idea of bringing back Terrell Edmunds.",
    "Mathieu was also part of the Pro Football Hall of Fame's All-2010s Team by virtue of racking up 26 interceptions and 76 passes defended in 129 career regular-season games.",
    "If the Steelers are serious about shoring up the back end of their defense, there are still several solid options available on the free-agent market.",
    "If the Steelers favor familiarity and stability, going back to Edmunds remains an option as well after he started for the past four seasons.",
    "28 overall pick in the 2018 NFL draft out of Virginia Tech, and he went on to start 60 of the 64 games he appeared in for the Steelers.",
    "The Pittsburgh Steelers have been busy in free agency, but they may not be done, as they reportedly have interest in adding a safety.",
    "While Mathieu would be the big-name addition, Kazee is a bit less heralded, although still productive at the safety position.",
    "Mathieu is the marquee name and is arguably the most accomplished free agent remaining at any position.",
    "Pittsburgh took Edmunds with the No."
  ]
}