{
  "id": 2319,
  "mediaId": 2586,
  "date": "2022-03-29",
  "headline": "Bills Rumors: Buffalo May Be Out of the Race for $43.5M Cornerback",
  "image": "https://heavy.com/wp-content/uploads/2022/03/James-Bradberry-e1648583879456.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-rumors-out-running-bradberry/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "#BillsMafia pic.twitter.com/Zf2SKb7PZk\n— Buffalo Bills (@BuffaloBills) November 26, 2021\n“It would come as no surprise if they repeated that pattern at cornerback this year, because this year’s draft is believed to be particularly fertile in that area, with potential value picks galore in every round.”\nFierro noted that the Bills could still look for some veteran depth through free agency, and a trade for Bradford remains an option, especially if the Giants are willing to lower their asking price.",
    "“They have since signaled to teams that they are willing to pick up some of Bradberry’s $13.4 million salary if teams are willing to offer the right package of picks in return.”\nThe Bills do have a strong connection with the Giants now, as New York hired former Bills assistant general manager Joe Schoen as their general manager.",
    "But they have yet to add any new members of the secondary, despite losing cornerback Levi Wallace to the Pittsburgh Steelers and facing the prospect of up to half of the season without All Pro Tre’Davious White, who is rehabbing a torn ACL and meniscus injury.",
    "Bills to Address Cornerback Needs\nAs Nick Fierro of SI.com’s Bills Central noted, the team has conspicuously avoided the secondary since the start of free agency, hinting that the team could use several of their top picks on cornerbacks.",
    "Trading Bradberry would clear a little more than $12 million in cap space for the Giants, room that would be critically needed in order to sign their draft class and fill out the practice squad and mid-season replacements.",
    "“They had been hoping for a package that included a third-round pick in this year’s draft, a source said, but no one was willing to pay that when the Giants shopped him before the free agent market opened,” he wrote.",
    "Bradberry on the Trade Block\nAs SNY’s Ralph Vacchiano reported, the Giants have come to the realization that they have no future with Bradberry and are working to have a trade in place before May’s NFL Draft.",
    "The Buffalo Bills are in need of some help in the secondary, but may have decided to bow out of the race for a $43.5 million cornerback reportedly on the trade block.",
    "https://t.co/RAAJDtdnx8\nThe Bills could potentially jump back into the running, as Vacchiano noted that the Giants may need to revisit their asking price.",
    "There had been reports that the Bills were in the running to land New York Giants cornerback James Bradberry, but that opportunity may now have passed.",
    "The Kansas City Chiefs, Indianapolis Colts, and Houston Texans were named as suitors who have reached out to the Giants to inquire about Bradberry.",
    "The Bills have had a busy offseason adding to their defensive line, adding three new key players including edge rusher Von Miller.",
    "Schoen has already signed a number of former Bills players, including backup quarterback Davis Webb.",
    "But Vacchiano did not list the Bills among the teams actively seeking to land Bradberry.",
    "CB Tre’Davious White suffered a torn ACL and will miss the remainder of the 2021 season.",
    "“Last year, the Bills used their first two picks in the draft on defensive ends.",
    "James Bradberry reacts to a play in a game against the Los Angeles Chargers.",
    "Joe Schoen: James Bradberry on the roster, will consider trade offers.",
    "One of them, Greg Rousseau, became an instant starter,” he wrote.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "Wishing you a speedy recovery, 27.",
    "????"
  ]
}