{
  "id": 2320,
  "mediaId": 2608,
  "date": "2022-03-22",
  "headline": "Child Protective Services Caseworker Allegedly ‘Demonstrated Hostility and Annoyance’ to Calls Reporting Abuse of Teen with Cerebral Palsy. Parents Now Face Homicide Charges.",
  "image": "https://lawandcrime.com/wp-content/uploads/2022/03/Lisa-Marie-Waldron-L-and-Anthony-Michael-Waldron-R-appear-in-mugshots.jpg",
  "link": "https://lawandcrime.com/crime/child-protective-services-caseworker-allegedly-demonstrated-hostility-and-annoyance-to-calls-reporting-abuse-of-teen-with-cerebral-palsy-parents-now-face-homicide-charges/",
  "mediaOutlet": "lawnewz.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Colin Kalmbacher",
  "authorUrl": "https://lawandcrime.com/author/colin-kalmbacher/",
  "termIds": [
    0
  ],
  "sentences": [
    "Despite multiple calls made to Child Protective Services, a caseworker there “demonstrated hostility and annoyance with school staff for making hotline calls” and “said that in such situations, the parents should be given the benefit of the doubt because they are trying as hard as they can,” according to court documents cited by the outlet.",
    "At the time of his death, authorities noted that the teen appeared to be “severely underweight” and had “bedsores covering a significant portion of his body.” In February of this year, a medical examiner’s report determined the boy’s manner of death was a homicide and the cause of death was a combination of infection and malnutrition.",
    "According to 15 court documents reviewed by Syracuse area-focused news outlet CNY Central, teachers repeatedly raised “concern after concern” about Brooks’ health beginning in 2018, when he attended eighth grade at the Mexico Central School District in Oswego County.",
    "“I would caution people not to jump to any conclusions as I have seen nothing to date to suggest the child’s needs were ignored in Onondaga and in fact the complaints were addressed,” the DA told CNY Central in response to questions about the investigation there.",
    "The district where Brooks attended school until seventh grade is currently working with the Onondaga County District Attorney’s Office over certain complaints made to the county Department of Social Services during the time period in question.",
    "A resulting CPS call led a caseworker to say she “could not smell urine on his chair.”\nMyriad additional health and care concerns were raised by teachers and others at the school, they said, and those concerns went serially unaddressed.",
    "As Law&Crime previously reported, they were both charged with one count each of manslaughter in the second degree, criminally negligent homicide, and first-degree endangering the welfare of an incompetent or physically disabled person.",
    "After a 10-month-long investigation, his mother, Lisa Marie Waldron, 43, and stepfather, Anthony Michael Waldron, 37, were arrested in connection with the boy’s death earlier this month by the Oswego County Sheriff’s Office.",
    "On Monday, March 21, 2022, CNY Central also confirmed that concerns about Brooks’ welfare were made by Liverpool Central School District staff and faculty to Child Protective Services caseworkers in nearby Onondaga County.",
    "In May 2020, the victim’s school aide said Brooks appeared to be struggling with remote learning and documented several instances in which he cried during online calls and had trouble supporting his own head.",
    "For now, however, Onondaga County District Attorney Bill Fitzpatrick said there were no indications that social workers there failed to adequately respond to those child abuse complaints.",
    "Court documents say a Child Protective Services caseworker in Upstate New York dismissed concerns over a disabled and abused teenager who eventually lost his life.",
    "Teachers at his school said they noticed sores on the victim’s body that appeared to be caused by overuse from the wheelchair he needed to move around.",
    "Two separate Empire State counties were aware of the alleged abuse and neglect in the years leading up to the teen’s death.",
    "Those concerns were relayed to CPS–as well as the boy’s apparent trouble with swallowing and lack of medical attention.",
    "An excerpt reads: “But CPS said, ‘I don’t know much about Cerebral Palsy but Jordan is happy doing school at home.",
    "They captioned the image with notes expressing concern over marks on his face and dark circles under his eyes.",
    "While those numerous concerns were raised for years in Oswego County, there were even earlier signs of abuse.",
    "When the COVID-19 pandemic hit and schools were closed, things appeared to take a drastic turn for the worst.",
    "He has no dark circles under his eyes and the marks on his face is excema, Mom showed me the cream she uses.",
    "Teachers also said that Brooks was sent to school with a urine-soiled diaper on numerous occasions.",
    "In April 2019, the documents say, the boy’s school aide noticed a “baseball-sized sore” on his hip.",
    "This prompted the principal to clean Brooks’ wheelchair which was soaked with urine.",
    "On March 9, 2021, the boy’s speech therapist took a photograph of him.",
    "[images via Oswego County Sheriff’s Office]\nHave a tip we should know?",
    "Throughout this time, Brooks consistently appeared to lose weight.",
    "Jordan Brooks was just 17 years old when he died in May 2021.",
    "'”\nExactly two months later, Jordan Brooks was dead.",
    "We will close this case very soon.",
    "tips@lawandcrime.com"
  ]
}