{
  "id": 2329,
  "mediaId": 2551,
  "date": "2022-03-22",
  "headline": "Ian Poulter is praying for one more match play miracle to qualify for his 17th Masters next month... with the Englishman needing to jump 17 places in the world rankings into the top 50",
  "image": "https://i.dailymail.co.uk/1s/2022/03/22/21/55671519-0-image-a-18_1647983267206.jpg",
  "link": "https://www.dailymail.co.uk/sport/golf/article-10641283/Ian-Poulter-praying-one-match-play-miracle-qualify-17th-Masters-month.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Derek Lawrenson for the Daily Mail",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Derek+Lawrenson+for+the+Daily+Mail",
  "termIds": [
    1453,
    2042,
    2124,
    2472,
    2937,
    4127,
    4698,
    4963
  ],
  "sentences": [
    "+4\nView gallery\nPoulter is 65th in the world rankings, and needs to climb back into the top fifty to make it\n+4\nView gallery\nShould Poulter make the jump by March 27, he will qualify for his 17th Masters (above)\nJustin Rose will seek to make it from a quartet of three fellow major champions in Jordan Spieth, Keegan Bradley and his long-time friendly rival, Adam Scott.",
    "+4\nView gallery\nEnglishman Ian Poulter (above) has work to do if he is to make it to this year’s Masters\nWith only one player from each group progressing to the weekend knockout stages, Poulter has to get past American Scottie Scheffler, twice a winner this year, and two of his Ryder Cup comrades in Tommy Fleetwood and Matt Fitzpatrick.",
    "Poulter will likely need a semi-final berth at least to progress from 67th into the world’s top 50 when the cut-off point to trigger a Masters invite falls on Monday — and the odds on that happening have lengthened considerably given he is in arguably the toughest of the 16 four-man groups.",
    "As the golf world digested the news of Phil Mickelson’s absence from Augusta for the first time since 1994, the Englishman is in a bleak-looking fight to make it via the WGC-Match Play Championship, which begins on Wednesday in Texas.",
    "It certainly promises to be an intriguing event, even with absentees such as Rory McIlroy, who has decided to complete his Masters preparations at the Valero Texas Open next week.",
    "There is no doubt who will be attracting the most attention, however, as Bryson DeChambeau plays for the first time in six weeks after a hand injury.",
    "Ian Poulter will need to call on all his renowned skills in escapology if he is to make it to this year’s Masters.",
    "His opponent on Wednesday, in a group that also includes Lee Westwood, is debutant Richard Bland.",
    "There might never have been a golfer so much better at one form of the game than another.",
    "Now 46, can ‘Mr Match Play’ go to the well one more time?",
    "One thing in Poulter’s favour, of course, is the format.",
    "l WGC-Dell Match Play, LIVE on Sky Sports from 2.15pm."
  ]
}