{
  "id": 2377,
  "mediaId": 2594,
  "date": "2022-03-25",
  "headline": "Billy Horschel into Match Play last 16 after dramatic draw with Thomas Pieters",
  "image": "https://static.independent.co.uk/2022/03/25/19/5001754f01251ef1ef7272bb25818ee4Y29udGVudHNlYXJjaGFwaSwxNjQ4MzE5ODU4-2.66031080.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/golf/dell-tommy-fleetwood-matt-fitzpatrick-ian-poulter-phil-casey-b2044359.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Phil Casey",
  "authorUrl": "https://www.independent.co.uk/author/phil-casey",
  "termIds": [
    1326,
    2124,
    2804,
    2937
  ],
  "sentences": [
    "Being two down with two to go and knowing all I needed was a half to move on to the round of 16, that’s a real confidence boost to birdie the last two to get through.”\nHorschel will face either Matt Fitzpatrick or Scottie Scheffler in the knockout stages after Scheffler’s 5 and 4 victory over Fitzpatrick left the pair tied on two points at the top of group five.",
    "“I played really solid except for two holes where I hit a pitching wedge in the water on three, which is just a bad, bad swing, and then another bad swing at 13 with a three iron off the tee just trying to put it in the fairway.",
    "Thomas Pieters was two up with two holes to play against Horschel and seemingly on course to secure the win which would set up a play-off between the pair to decide the winner of group 12.",
    "Defending champion Billy Horschel produced a grandstand finish to become the first player into the last 16 of the WGC-Dell Technologies Match Play.",
    "However, Horschel made a birdie on the 17th and was conceded another on the last after Pieters missed from close range for his own birdie.",
    "Tommy Fleetwood could have made it a three-man play-off with a victory over Ian Poulter, but lost 4 and 3 to his Ryder Cup team-mate.",
    "I’m going to guess he probably shot four, five under maybe, didn’t make a bogey at all.",
    "“So when your opponent’s not gifting you anything, then you’ve got to be on your game.",
    "Horschel said: “Thomas came to play today and he played a beautiful round of golf.",
    "“But other than that, I hung in there.",
    "I hit some really quality shots."
  ]
}