{
  "id": 2380,
  "mediaId": 2679,
  "date": "2022-03-21",
  "headline": "Burns withdraws from Match Play as groups set for Austin",
  "image": "",
  "link": "https://www.seattletimes.com/sports/burns-withdraws-from-match-play-as-groups-set-for-austin/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DOUG FERGUSON",
  "authorUrl": "https://www.seattletimes.com/author/doug-ferguson/",
  "termIds": [
    1707,
    2086,
    2492,
    2672,
    3002,
    4519,
    100
  ],
  "sentences": [
    "Cameron Smith (6) withdrew after winning The Players Championship, Hideki Matsuyama (12) is recovering from an upper back injury and Rory McIlroy (8) previously said he plans to play the Valero Texas Open as his final event before the Masters.",
    "Three players moved into the top 64 from their performance last week — Shaun Norris and Dean Burmester in South Africa, Stewart Cink at Innisbrook — but are not eligible.",
    "Sam Burns withdrew from the Dell Match Play on Monday, one day after outlasting Davis Riley in a playoff to become a back-to-back winner at the Valspar Championship.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThis is the final week for players to earn a spot in the Masters through the top 50 in the world ranking.",
    "1 seed and will start Wednesday by playing Sebastian Munoz, the second straight year they squared off on the first day.",
    "5 seed and has three Ryder Cup players from England in his group — Matt Fitzpatrick, Tommy Fleetwood and Ian Poulter.",
    "The 16 groups were finalized Monday, each group filled randomly with one player from the top 16 seeds, one from Nos.",
    "Among those at Match Play who are on the bubble are Seamus Power (48), Cameron Tringale (51) and Alex Noren (56).",
    "Bryson DeChambeau is playing for the first time since he withdrew from the Saudi International with injuries.",
    "The 64-man field at Austin Country Club will be missing four players from the top 12 in the world ranking.",
    "___\nMore AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports\n DOUG FERGUSON",
    "Billy Horschel is the defending champion after beating Scottie Scheffler last year.",
    "The winner of each group after round-robin play advances to the knockout stage.",
    "The field is determined by the world ranking from a week ago.",
    "He was replaced in the field in Texas by Maverick McNealy.",
    "10 in the world with his victory in Florida.",
    "This time he is the 12th seed.",
    "33 to 48, and one from Nos.",
    "17 to 32, one from Nos.",
    "Horschel was the No.",
    "Scheffler is the No.",
    "Jon Rahm is the No.",
    "32 seed last year.",
    "Burns moved to No.",
    "49 to 64."
  ]
}