{
  "id": 2438,
  "mediaId": 2710,
  "date": "2022-03-21",
  "headline": "Renewable energy is climate change’s solution story, and I’m covering it for The Tribune",
  "image": "https://www.sltrib.com/resizer/Z14PsX7K22f57aN2Nk2IAHcBe90=/1200x630/cloudfront-us-east-1.images.arcpublishing.com/sltrib/IIAUWM3HXJHQBG24NPQNVMBLAI.jpg",
  "link": "https://www.sltrib.com/opinion/2022/03/21/renewable-energy-is/",
  "mediaOutlet": "The Salt Lake Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Fitzpatrick",
  "authorUrl": "https://www.sltrib.com/author/tfitzpatrick",
  "termIds": [
    0
  ],
  "sentences": [
    "Still, in the middle of the cold fusion saga, I wrote my first story on “the greenhouse effect.”\nClimate change is the biggest challenge of the next 10, 20 and 50 years, and renewable energy is climate change’s solution story.",
    "This story is part of The Salt Lake Tribune’s ongoing commitment to identify solutions to Utah’s biggest challenges through the work of the Innovation Lab.",
    "I led the web side of the operation as we moved to all-day publishing in the early 2000s, and in 2018 I headed up the launch of digital subscriptions.",
    "We still have years of fossil fuels ahead, but Utah can go from lagging to leading the sustainable energy revolution if Utahns know what is possible.",
    "I started at the paper in 1976 when I was 19, and I have been a reporter, editor, managing editor and editorial page editor, among other roles.",
    "I am going to cover renewable energy and Utah’s transition to a sustainable energy structure to power our homes, businesses and transportation.",
    "We are more culpable than most people in the world for the ice caps melting and the forests burning, though most Utahns don’t realize it.",
    "I appreciate the support, but rest assured that Rocky Mountain Power has no role in deciding what stories to cover or how to cover them.",
    "But we’re also blessed with plenty of sun, wind, geothermal hotspots and the technological and financial resources to exploit them.",
    "Tim Fitzpatrick is The Salt Lake Tribune’s renewable energy reporter, a position funded by a grant from Rocky Mountain Power.",
    "After 31 years as one of the big cheeses in The Tribune newsroom, I have left management to return to a reporting gig.",
    "The first hope is that it’s not too late for an old Tribune hand like me to go back to reporting and writing the news.",
    "And for the last two years, I have been all in on helping reinvent The Tribune as a nonprofit news organization.",
    "Here’s one more sign that I’m not back in the ‘90s: My position is funded by a grant from Rocky Mountain Power.",
    "Fitzpatrick, started working for then-Tribune owner Sen. Thomas Kearns in 1913 and became publisher in 1924.",
    "After years of uncertainty, The Tribune has arrived at a point where it actually grows instead of shrinks.",
    "For the last 20 years, I’ve been working to make The Tribune less about ink and more about electrons.",
    "Only through worldwide cooperation to reduce atmospheric carbon emissions will humanity thrive.",
    "The Tribune retains all control over editorial decisions independent of Rocky Mountain Power.",
    "So now is my time to go back to the true mission: informing Utahns on issues that matter.",
    "With its coal-fired power plants and urban sprawl, Utah has an outsized carbon footprint.",
    "After three decades in Tribune management, I have a hot story to follow ... literally.",
    "As a third-generation Tribune employee, I have more than a century of ink in my veins.",
    "Energy is a cornerstone of civilization, and climate change is our ultimate test.",
    "Unfortunately, it was fake energy and cold fusion became Utah’s embarrassment.",
    "The second is that there is still time to keep the planet from overheating.",
    "For Utahns, it’s about making informed choices so we can lead by example.",
    "I won awards for covering the biggest energy story in the world in 1989.",
    "I was the Tribune’s science writer in the late ‘80s and early ‘90s.",
    "My father, Jim Fitzpatrick, was also a Tribune writer and editor.",
    "[Subscribe to our newsletter here]\nIt’s not too late.",
    "I will go where the reporting takes me.",
    "What should Utah’s energy mix be?",
    "I take that as my challenge.",
    "It is a homecoming of sorts.",
    "It’s actually two hopes.",
    "We’ll find out together.",
    "Better late than never.",
    "My grandfather, J.F.",
    "Grid modernization.",
    "Battery technology.",
    "Charging networks.",
    "That’s the hope.",
    "Wind corridors.",
    "Nuclear plants.",
    "Solar farms.",
    "Heat pumps."
  ]
}