{
  "id": 2445,
  "mediaId": 2714,
  "date": "2022-03-31",
  "headline": "Resolution in US House calls for April 14 as 'National Sikh Day'",
  "image": "https://static.toiimg.com/thumb/msid-90557365,width-1070,height-580,imgsize-777656,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "link": "https://timesofindia.indiatimes.com/city/amritsar/resolution-in-us-house-calls-for-april-14-as-national-sikh-day/articleshow/90557318.cms",
  "mediaOutlet": "The Times of India",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yudhvir Rana",
  "authorUrl": "https://timesofindia.indiatimes.com/toireporter/author-Yudhvir-Rana-8496.cms",
  "termIds": [
    3174,
    3530,
    3656,
    3938,
    4671,
    4771,
    1163,
    4821
  ],
  "sentences": [
    "\"Sikhs celebrate Baisakhi on the first day of the month of Vaisakh in the Sikh calendar, which typically falls on April 14; whereas Baisakhi is a special occasion in which Sikhs remember the founding in 1699 of the Order of Khalsa, a fellowship of devout saint-soldier Sikhs, by the 10th Sikh Guru to fight tyranny and oppression, which played an important role in shaping the religion's history and identity; and whereas it is altogether fitting and proper to celebrate the day of Baisakhi alongside Sikhs throughout the world\" reads the resolution.",
    "He informed the main sponsor of the resolution, titled 'Supporting the designation of Baisakhi, April 14, of each year, as National Sikh Day', was congresswoman Mary Gay Scanlon, while the co-sponsors were Karen Bass, Paul Tonko, Brian K Fitzpatrick, Daniel Meuser, Eric Swalwell, Raja Krishnamoorthi, Donald Norcross, Andy Kim, John Garamendi, Richard E Neal, Brendan F Boyle, and David G Valadao .",
    "AMRITSAR: Several United States (US) Congresswomen and men have introduced a resolution in the House of Representatives, seeking to declare Baisakhi, April 14 of each year, as National Sikh Day, said a spokesperson for American Gurdwara Parbandhak Committee (AGPC)\nAGPC coordinator Pritpal Singh on Wednesday said the congressmen included members of the American Sikh Congressional Caucus.",
    "Harpreet Singh Sandhu, an executive director of American Sikh Congressional Caucus, said, \"We are glad that the USA understands the importance of recognising communities living in the US and contributing to its growth.\"",
    "It says the community played an important role in developing the US and that Sikhism is the world's fifth-largest religion with nearly 30,000,000 adherents, roughly 1,000,000 of whom call the US home.",
    "\"This will not only help in generating awareness about Sikh religion, culture, and customs in the USA, but also help in bringing down the cases of hate crime,\" observed the coordinator of AGPC.",
    "The resolution recognizes the contributions of Sikh community, which originated in Punjab and began immigrating into the US over 100 years ago.",
    "They introduced Resolution 1007 in the House on March 28."
  ]
}