{
  "id": 2486,
  "mediaId": 2586,
  "date": "2022-03-22",
  "headline": "Bills in Danger of Losing Breakout Guard to AFC East Rival",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Ryan-Bates-e1647981977601.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-danger-losing-bates-patriots/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Bills have offered an original round tender of $2.4 million to Bates and would be able to match any contract offered to Bates, though that could be difficult if the offer is\nBates could be particularly attractive to the Patriots, who already lost two starting guards this offseason in Ted Karras and Shaq Mason.",
    "Bill Belichick seems very interested in the versatile OL, but the #Bears & #Vikings are also in play for the RFA.https://t.co/5dxu8jv1A6 #BillsMafia\nBills Value Bates\nBills general manager Brandon Beane has hinted that the team may be willing to match an offer for Bates.",
    "“That’s a more manageable situation than the team would have faced if Brown signed elsewhere.”\nAs Talbot noted, Belichick also has a history of taking restricted free agents away from the Bills, including wide receiver Chris Hogan and running back Mike Gillislee.",
    "Due in part to some inclement weather at home, the team relied more heavily on running back Devin Singletary, who averaged 80 yards per game over the final four games of the season and scored five of his seven touchdowns during that stretch.",
    "With the Bills balancing a tight cap situation that became even tighter with the signing of Von Miller, the team could be at risk of losing Bates if another team makes an offer too difficult for them to match.",
    "As Nick Wojton of USA Today’s Bills Wire noted, he has already met with the Minnesota Vikings and has plans to meet with the Chicago Bears and New England Patriots in the coming days.",
    "The team was able to re-sign starting tackle Trent Brown, but The Athletic’s Matthew Fairburn noted that Patriots head coach Bill Belichick will likely be looking for more help.",
    "“But between the draft and the next few waves of free agency, Belichick should have plenty of opportunity to find another piece for the offensive line,” Fairburn wrote.",
    "“Something to build on, hopefully next year we won’t start out with a lull.”\nBeane also spoke highly of the effect Bates had on teammate Dion Dawkins.",
    "Bates, a restricted free agent this offseason, has gotten interest from several teams including one of Buffalo’s top AFC East rivals.",
    "In his end-of-year press conference, Beane gave credit to Bates for helping to spark a late-season surge in the running game.",
    "The Buffalo Bills got a breakout season from guard Ryan Bates, but now the 25-year-old could be breaking away from the team.",
    "After struggling to establish the running game through three-quarters of the season, the Bills broke out down the stretch.",
    "Bates was the team’s starter through both playoff games, while Feliciano was released following the end of the season.",
    "The Bears are hosting Ryan Bates on Tuesday, and they have a chance to add a young interior lineman to their roster.",
    "Bates Drawing Interest\nIt’s already been a busy offseason for Bates, who has drawn the interest of several teams.",
    "Bates moved into a starting role in Week 15, then held onto the job even as Jon Feliciano returned from injury.",
    "Bates is seen as one of the best available guards, and signing him would pull him away from a rival team.",
    "https://t.co/bOzmW3tH5e\nBeane hinted that the team wanted to keep Bates around next season.",
    "The #Patriots have a history of signing away #Bills RFA (Chris Hogan, Mike Gillislee).",
    "“I think Dion played some of his best football with Bates next to him,” Beane said.",
    "“We definitely found a rhythm,” Beane said, via USA Today’s Bills Wire.",
    "Ryan Bates looks on before a game against the New England Patriots.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "Could Ryan Bates be next?",
    "If the price is right."
  ]
}