{
  "id": 2538,
  "mediaId": 2668,
  "date": "2022-03-21",
  "headline": "YouTube Strikes Again: Conservative St. Louis Radio Station NewsTalkSTL Gets the Boot",
  "image": "https://redstate.com/wp-content/uploads/media/2022/03/NewsTalkSTL-1110x740.png",
  "link": "https://redstate.com/smoosieq/2022/03/21/youtube-strikes-again-conservative-st-louis-radio-station-newstalkstl-gets-the-boot-n538817",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susie Moore",
  "authorUrl": "https://redstate.com/author/smoosieq",
  "termIds": [
    1580,
    2138,
    3304,
    3588,
    537,
    1260,
    5330
  ],
  "sentences": [
    "Chase severed its payment processing relationship with the Defense of Liberty PAC, claiming that the organization was engaged in “hate, violence, racial intolerance, terrorism.”\nAs I wrote at the time:\nYou read that right: WePay asserted that an organization whose most recent guest speaker was an African-American woman (Owens), whose upcoming event was set to feature Cecilia S. Johnson, National Director of Black Engagement for the RNC, and whose hosts were directly involved in fighting terror was engaged in “hate, violence, racial intolerance, terrorism.” (Having attended several of these events, I can assure you this assertion is utter bunk.)",
    "One of the station’s taglines is “We offer news, analysis, and opinion.” Apparently, for the Facebook censors, our ad which simply tells you who we are and how to listen to the station could “influence public opinion.”\nThis was followed by an effort by JP Morgan Chase, via its subsidiary, WePay, in November of 2021, to cancel an event sponsored by NewsTalkSTL and co-hosted by Paul Curtman (one of the station’s hosts).",
    "And rather than kowtowing to YouTube’s cluck-clucking regarding “misinformation,” made a running joke of the situation, with host Vic Porcelli and producer Ken Williams adopting as nicknames the “controversial” therapeutics of “Hydroxychloroquine” and “Monoclonal Antibodies,” (“Mo,” for short).",
    "Not two months into its existence, the station had its first brush with Big Tech censorship, when Facebook saw fit to take down two brief promos regarding the station, neither of which contained anything more controversial than stating the obvious — that it’s a conservative talk station.",
    "It wasn’t long before the Censor Scolds at YouTube threw a flag and suspended the station, ostensibly for “medical misinformation” (following discussions regarding Joe Rogan, Dan Bongino, and references to potential therapeutics, such as Ivermectin).",
    "Read the email they sent us below:https://t.co/dQ5eli1npq\n— NewsTalkSTL (@NewstalkSTL) March 21, 2022\nThe e-mail announces the removal of the station’s channel for “severe or repeated violations” of the platform’s Community Guidelines.",
    "Locally owned and operated, NewstalkSTL offers political opinions from local hosts (the station also broadcasts the Dan Bogino and Joe Pags programs) that listeners in the St. Louis metro area have grown to trust.",
    "(I’ll be sitting in as a guest co-host with Chris Arps this Wednesday and Friday at 3:30 pm Central, for those interested in keeping tabs on the dastardly goings-on at this dangerously subversive outlet.)",
    "Make sure you’re listening to The @dbongino Show today at 12:05pmCT/1:05pmET to hear @SpeakerTimJones on discussing media censorship, our YouTube ban, and our newest @rumblevideo account ??",
    "With the sincerest notes of concern, the e-mail goes on:\nWe know this is probably very upsetting news, but it’s our job to make sure that YouTube is a safe place for all.",
    "Hello Rumble!”\nCurrently, NewsTalkSTL has over 8,700 subscribers on Rumble (just two months after starting up that account), so something tells me, they’ll be just fine.",
    "Chris wrote about it at the time:\nFacebook seems to be up to its old tricks of banning speech they don’t like, especially if that speech is conservative speech.",
    "Because of that success, station management decided recently to embark upon a four-week ad campaign on Facebook to let more people know about our station.",
    "For full disclosure, I co-host the afternoon show with former Missouri Speaker Tim Jones and our exceptional executive producer Katie Fitzpatrick.",
    "No specifics were provided as to the hazards posed by NewsTalkSTL’s content, but I’m sure the wrongthink and wrongspeak were very, very unsafe.",
    "The station was back on YouTube for the past several weeks, then lo and behold, an attempt to view it this morning yielded no results.",
    "NewsTalkSTL can be found at 94.1 and 101.9 on the FM dial in St. Louis — and streaming on Facebook and Twitter (for now) and Rumble.",
    "It features several well-known St. Louis-area politicos and talk show hosts, including my RedState colleague, Chris Arps.",
    "We’ve been on the air a little over two months now, and the reception from the listening audience has been tremendous.",
    "When asked for comment regarding the ban, station owner Jeff Allen had this to say:\n“It was just a matter of time.",
    "As of this morning, we no longer have access to our channel and it has been taken down from the platform ????",
    "The station started streaming its shows on video platforms, including Facebook and YouTube, late last Fall.",
    "The censorious impulses of Big Tech sadly are no longer shocking — but they are disappointing nonetheless.",
    "The station received an e-mail this morning that it has, in fact, been kicked off the platform for good.",
    "Back in July, a brand new conservative radio station started broadcasting in my hometown of St. Louis.",
    "(Full disclosure — yours truly is also a regular guest and frequent fill-in co-host at that station.)",
    "— NewsTalkSTL (@NewstalkSTL) January 6, 2022\nA second YouTube suspension followed in February.",
    "Not to be deterred, NewsTalkSTL kept streaming along (on Facebook, Twitter, and Rumble).",
    "NewsTalkSTL, a conservative talk radio station in St. Louis, launched in July of 2021.",
    "(And though it was supposed to be for two weeks, lasted roughly a month.)",
    "NewsTalk STL has been permanently removed from YouTube ??",
    "We have been in YouTube jail off and on for a while.",
    "They don’t seem to like conservative discussions.",
    "We knew this day would come eventually.",
    "The channel was just…gone."
  ]
}