{
  "id": 2549,
  "mediaId": 2523,
  "date": "2022-03-20",
  "headline": "Valspar Championship 2022: Sam Burns Edges Davis Riley After 2-Hole Playoff",
  "image": "https://media.bleacherreport.com/image/upload/v1647816553/fgsi9jv1ykwzz0jxmipl.jpg",
  "link": "https://bleacherreport.com/articles/10030354-valspar-championship-2022-sam-burns-edges-davis-riley-after-2-hole-playoff",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rob Goldberg",
  "authorUrl": "https://bleacherreport.com/users/97da3dae-f34c-40be-8ea8-f6d59f4ffefa",
  "termIds": [
    1665,
    2937,
    3123,
    3502,
    3936,
    4497,
    4519,
    816
  ],
  "sentences": [
    "Riley was fortunately able to regroup, keeping himself among the leaders with a quality chip-in a few holes later:\nBurns eventually built a two-stroke lead, but his path to victory got harder when he bogeyed No.",
    "He kept this lead through four holes until a brutal showing on the par-five fifth hole:\nThe snowman on the card pushed him out of the lead, creating a crowded race at the top heading into the back nine.",
    "<a href=\"https://t.co/CbWOptcjLW\">pic.twitter.com/CbWOptcjLW</a>\nJustin Thomas and Matthew NeSmith each finished one stroke back in a tie for third.",
    "The top players will now prepare for the World Golf Championships-Dell Technologies Match Play, which begins Wednesday in Austin, Texas.",
    "Riley stormed on top of the leaderboard with his third-round score of 62, putting him three strokes clear of the rest of the field.",
    "Sam Burns won the Valspar Championship for the second year in a row after outlasting Davis Riley in a two-hole playoff.",
    "Burns and Thomas were among those who took advantage with multiple birdies giving them each a share of the lead.",
    "?<br><br>Unbelievable putt from <a href=\"https://twitter.com/Samburns66?ref_src=twsrc%5Etfw\">@SamBurns66</a>.",
    "The two Americans were 17 strokes under par for the tournament at Innisbrook Resort in Palm Harbor, Florida.",
    "It was Burns who finally ended up on top with a long birdie putt enough to secure his third PGA Tour win.",
    "Burns shot 69 in the final round Sunday to match Riley, who entered the day with a three-stroke lead.",
    "After Burns and Riley each earned a par in the first playoff hole, the battle moved to the 16th hole.",
    "In the playoff, Burns came through with an impressive birdie on the second hole to pull out the win.",
    "Both players missed potential tournament-winning birdie putts on 18, leading to a playoff.",
    "Xander Schauffele (-11)\nFull results and stats via PGATour.com.",
    "Riley then forced a tie with a birdie on the same hole.",
    "Matt Fitzpatrick (-14)\nT5.",
    "Matthew NeSmith (-16)\nT5.",
    "Sahith Theegala (-12)\nT7.",
    "Kevin Streelman (-12)\nT7.",
    "Brooks Koepka (-11)\nT12.",
    "Robert Streb (-12)\nT12.",
    "Justin Thomas (-16)\nT3.",
    "Brian Harman (-14)\nT7.",
    "PGA TOUR\nHe BURIES it?",
    "Stewart Cink (-12)\nT7.",
    "Adam Hadwin (-12)\nT7.",
    "Davis Riley (-17)\nT3.",
    "Final Leaderboard\n1.",
    "Sam Burns (-17)\n2.",
    "17."
  ]
}