{
  "id": 255,
  "mediaId": 2540,
  "date": "2022-04-10",
  "headline": "Scottie Scheffler wins 2022 Masters, the first major of his career, following dominant performance",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220410183110-01-scottie-scheffler-masters-winner-2022-super-tease.jpg",
  "link": "https://www.cnn.com/2022/04/10/golf/masters-2022-winner-scottie-scheffler-spt-intl/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Morse",
  "authorUrl": "",
  "termIds": [
    2124,
    2738,
    3002,
    4127,
    97,
    816
  ],
  "sentences": [
    "With a big lead and his 2022 Masters champion title almost certainly wrapped up, Scheffler showed he was human as he four-putted -- missing two from close range -- before rolling home the winning putt and sparking scenes of celebration.",
    "Embraces with his beaming wife Meredith and his proud father Scott were the first order of business before he made the short walk to the clubhouse to sign his victorious scorecard and prepare himself for his new item of clothing.",
    "Even with the pressure of a potential Masters title on the line, though, Scheffler did not buckle, instead adding to his lead over the 14th and 15th holes to stretch it to five with just three holes remaining.",
    "For Australian Smith, who had pushed Scheffler so hard, his charge for a debut major felt apart on the treacherous par-three 12th hole when his tee shot found the water and he had to settle for a triple-bogey.",
    "After two close-range misses on the 18th green, he rolled home the winning putt and carded a final round one-under par 71 to finish on 10-under for the tournament, three shots ahead of second-placed McIlroy.",
    "Over the four days at the lush, sprawling golf club in Augusta, Georgia, Scheffler produced some excellent golf, refusing to falter under the pressure of being the tournament's leader for nearly three days.",
    "In the end, he was rewarded for his recent run of good form, winning the most prestigious tournament title out there, as well as going home with the famous green jacket and the $2.7 million winners purse.",
    "On Saturday, under difficult conditions with blustery winds and low temperatures, Scheffler continued to display his even-keeled nature to go into the final day with a three-shot lead over Cameron Smith.",
    "But, as he has done for the last three months, Scheffler remained calm, producing some excellent shots -- including a masterful chip-in on the third hole for a birdie -- to once again assert his lead.",
    "And with that red-hot form behind him, the 25-year-old Texan was earmarked as one of the favorites to be fitted with a green jacket come the end of the day Sunday.",
    "According to the PGA Tour, Scheffler's win makes him the first player to win four times in a PGA Tour season by the end of the Masters since David Duval in 1999.",
    "His closest challenger eventually became McIlroy, who shot up the leaderboard following an outstanding eight-under par 64 to claim the clubhouse lead.",
    "While Smith's confidence seemed to vanish, Scheffler remained steadfast, continuing to pick up pars and the odd birdie to maintain his sizeable lead.",
    "And from there, despite a wayward drive on the 17th, Scheffler managed to calm his nerves, right up until the final green on the 72nd hole.",
    "This story has been updated to make clear that Scottie Scheffler finished three shots ahead of Rory McIlroy.",
    "By the end of the second round, he had accumulated a large lead with some steady but precise golf.",
    "He loomed ominously after day one, sitting in third position, just two behind leader Im Sung-jae.",
    "And after Sunday's first two holes, it looked like he might have a real battle on his hands.",
    "While he went about his work without a look of stress on his face, others began to falter.",
    "To have the honor of winning the tournament and to have my family with me was incredible.\"",
    "After a stretch of three wins in five tournaments though, he was named golf's world No.",
    "Asked how he felt in the immediate aftermath, Scheffler said he was \"pretty tired.\"",
    "1 finished ahead of Northern Irishman Rory McIlroy to claim his first major title.",
    "I'm pretty tired right now -- I'm really at a loss for words right now,\" he said.",
    "\"I can't thank my family enough -- they've made many sacrifices over the years.",
    "In February, the American golfer didn't have a PGA Tour victory to his name.",
    "\"I want to go home!",
    "The world No.",
    "1 in March."
  ]
}