{
  "id": 2570,
  "mediaId": 2937,
  "date": "2022-03-24",
  "headline": "Auston Matthews flirting with 50 again, but this time, says Rick Vaive, he should do it",
  "image": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2022/03/HKN_BRUINS_MAPLE_LEAFS_20211106_91098266-scaled.jpg?quality=100&strip=all",
  "link": "https://torontosun.com/sports/hockey/auston-matthews-flirting-with-50-again-but-this-time-says-rick-vaive-he-should-do-it",
  "mediaOutlet": "torontosun.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lance Hornby",
  "authorUrl": "https://torontosun.com/author/lhornby/",
  "termIds": [
    1935,
    1970,
    2011,
    2172,
    2561,
    3229,
    3523
  ],
  "sentences": [
    "I thought he had a great line a couple of weeks ago about (deliberately) crashing into the crossbar ‘to see what it felt like’.”\nThough Matthews has played down the milestone in recent weeks with so many close calls through the years, he and the team would like the 50th, 55th or both to come at Scotiabank Arena.",
    "He’s come close since, too.”\nArticle content\nShooting exclusively on Canadian team goalies in the truncated 2021 campaign, Matthews likely would’ve hit 50, but settled for 41 and his first Rocket Richard Trophy as league leader as the post-pandemic schedule ended after 56 contests.",
    "“That’s what Frank Mahovlich did for me when I passed his record (of 48 in 1960-61).”\nLinemates Mitch Marner and Michael Bunting or power play partners John Tavares and William Nylander could be excused if seeking to make the extra pass to Matthews and get him the record sooner.",
    "Total GS\nRick Vaive 22 3/24/82 St. Louis Mike Liut W 4-3 72 54\nRick Vaive 23 3/30/83 @ Detroit Gilles Gilbert W 4-2 76 51\nRick Vaive 24 3/14/84 Minnesota Gilles Meloche T 3-3 69 52\nGary Leeman 26 3/28/90 NYI Mark Fitzpatrick L 3-6 75 51\n*Dave Andreychuk 29 3/23/93 @ Wpg.",
    "Article content\nWhen Sheldon Keefe replaced Mike Babcock as head coach, Matthews had more ice time and a glowing green light to carry team offence, but COVID-19 then got in the way, halting him at 47 when the entire NHL shut down with a dozen games remaining.",
    "This year, despite missing a few games at the start as wrist surgery healed, he was touted not just as the fourth Leaf to reach the milestone, first in almost 30 years, but to break Vaive’s club mark of 54 as well.",
    "He was embarrassed, not that it was a terrible thing he did (the parties settled and the matter was dismissed), but I think that motivated him to be a better player and person.",
    "“I think he’s going to do it this time,” said Vaive, who had made the chase a weekly topic on his podcast Squid And The Ultimate Leafs Fan with team historian Mike Wilson.",
    "“I think that incident in Arizona a couple of years ago (a disorderly conduct complaint about him was made to police by a female security guard) was a wake-up moment.",
    "He’s on a bit of a deadline with 50, as there’s only two at home next week, against Florida and Winnipeg, sandwiched by a total of six road games up to April 7.",
    "Bob Essensa W 5-4 72 54\nDave Andrechuk 30 3/24/94 San Jose Arturs Irbe W 2-1 73 53\n*Prior to a mid-season trade, Andreychuk scored 29 with Buffalo.",
    "Matthews was assessed a two-game NHL suspension for crosschecking in the March 13 Heritage Classic in Hamilton and has one goal in two games since.",
    "A lot of changes have happened to speed the game up, though I can’t say it’s easier to score, because goalies are better and their gear is bigger.",
    "The equipment, taking out the red line, you can’t hook a guy all the way down the ice anymore, can’t cross check someone in front of the net.",
    "Article content\nOn March 24, 1982, Vaive beat Mike Liut of the St. Louis Blues at the Gardens to become the first Leaf to 50, then 54.",
    "If he’s not the best player in the league, he’s certainly top three.”\nLike many, Vaive has also sensed growing maturity in Matthews.",
    "Article content\nIt seemed he might get it in his rookie year of 2016-17 after scoring four goals against Ottawa in his first game.",
    "As much as scoring comes easy to Auston Matthews, achieving the magical 50 mark in a single season has been difficult.",
    "But league goaltenders met the Calder Trophy kid’s challenge and over the next 81 games, he was held to 36.",
    "“I was hoping he’d do it then,” said Rick Vaive, for now the club’s record holder with 54 goals.",
    "“I’d like to be there when he breaks 54 or meet him next day to congratulate him,” Vaive said.",
    "If we’re doing that, then all three of us are going to get good opportunities to score.",
    "Article content\n“From all accounts and everyone I’ve talked to, he’s a great person.",
    "We’re going to do our job here, make sure we’re doing stuff right (defensively).",
    "“I’ve held it 40 years and I’m happy someone such as Auston ties it or beats it.",
    "I see a big difference year to year in his 200-foot game, a huge credit to him.",
    "Matthews missed 20 games with injury as a sophomore, leaving him with 34 goals.",
    "Auston’s an elite scorer, no question, but I’m impressed with his full game.",
    "He’s parked at a league-best 46 heading into Saturday’s game in Montreal.",
    "We just have to stay patient.”\nlhornby@postmedia.com\nName Age Date Opp.",
    "Article content\n“You don’t need to look for him any extra than we do.",
    "Ditto in 2018-19 when he was shelved 14 games and finished with 37.",
    "“That year he was 22, same age as I was when I first had 50.",
    "When he gets his looks, he’s not going to miss very often.",
    "Marner insisted that wasn’t the plan this week or beyond.",
    "But that seemingly inevitable event is on hold as well.",
    "To score that many in any era is a good accomplishment.",
    "Article content\n“In the end, it’s still the same game.",
    "“Like I’ve said before, he’s not a guy who’s selfish.",
    "You can snap a shot quicker and get a lot on it.",
    "It took Vaive 72 games, Matthews has played 58.",
    "“Everything has evolved since my era.",
    "But also the sticks are better.",
    "Goalie Result , Player Game No.",
    "“I love watching him."
  ]
}