{
  "id": 2613,
  "mediaId": 2586,
  "date": "2022-03-21",
  "headline": "Ex-Bills Receiver Mentioned in Expose on Disgraced NFL Coach",
  "image": "https://heavy.com/wp-content/uploads/2022/03/John-Brown-e1647909830830.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-john-brown-urban-meyer/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "“You couldn’t get a job paying more than $15 an hour.”\nThere are so many anecdotes in here that shed light on the kind of person Urban Meyer is — and the power structure that allowed him to run college football programs that way for so long: https://t.co/BopwLsLzGQ\n— Nicole Auerbach (@NicoleAuerbach) March 21, 2022\nThe report noted that players were left fuming at the implication that they would be incapable of getting a job outside of football.",
    "The former college coaching legend had a rather rocky jump to the NFL, coming under fire for leaving the team following a game and later being fired after a series of controversies culminating with a report that he kicked former Jaguars kicker Josh Lambo and swore at him.",
    "“These boys from the South, their transcripts ain’t right.”\nLow Point for Bills\nThough Meyer’s tenure is regarded as one of the worst in NFL history, he was able to score one of the league’s biggest upsets in years when the Jaguars beat the Bills 9-6.",
    "\"https://t.co/Z7DDnLi8vT pic.twitter.com/oJgcA3c4DS\nThe Bills responded to the loss with wins over the New York Jets and Miami Dolphins, while the Jaguars went on to lose eight straight games.",
    "Former Bills receiver John Brown, who had a short tenure with the Jaguars during the last season, played a role in one of the stories illustrating Meyer’s lack of respect for his players.",
    "Meyer’s Rough Relationship With Players\nUsing interviews with former players and staff, the story painted Meyer as an abusive coach who often berated his players and assistant coaches.",
    "When one of his players missed an assignment during a preseason game and blew a play, Meyer warned the entire position group that he would cut all of them if the mistake were repeated.",
    "So now we’ve got to continue that momentum.”\nMultiple sources told The Athletic that former Jaguars coach Urban Meyer was unfamiliar with star players around the NFL, including\n??",
    "The Buffalo Bills‘ loss to the Jacksonville Jaguars was one of the team’s biggest blunders in decades — potentially in franchise history — and may look even worse in retrospect.",
    "The relationship between Meyer and his players remained tense as the season went on, including an incident when Brown ran the wrong route in practice.",
    "The Athletic’s Jayson Jenks and Mike Sando published a rather sordid expose on the short and controversial tenure of Jaguars head coach Urban Meyer.",
    "Much of the blame fell on Bills coach Sean McDermott, with Jaguars cornerback Shaquill Griffin said the Bills players didn’t look very motivated.",
    "”I was just looking on their sideline and one thing I know is I was like, `They don’t have the same energy as us,”’ Griffin said, via CBS Sports.",
    "He and Jaguars quarterback Trevor Lawrence stayed after practice to run through the route again, and Meyer made a dig at Brown’s intelligence.",
    "After Meyer was fired, the Jaguars ended the season by upsetting the Indianapolis Colts in the season finale, knocking them out of playoffs.",
    "“And do you know what would happen if I cut you guys?” Meyer reportedly told the players.",
    "”If you feel like one team deserved this win, it’s us, but you’ve got to believe that.",
    "Look on the sidelines, watching them walking around, it’s like they don’t care.",
    "“Hey, Trevor, you’ve got to slow it down for him,” Meyer reportedly said.",
    "”That’s one thing I kept preaching at everybody else.",
    "The latest Bills news straight to your inbox!",
    "Aaron Donald\n\"Who’s this 99 guy on the Rams?",
    "I’m hearing he might be a problem for us.",
    "Join the Heavy on Bills newsletter here!",
    "They don’t deserve this.",
    "Let’s show them why.",
    "Deebo Samuel\n??",
    "Jamal Adams\n??"
  ]
}