{
  "id": 2648,
  "mediaId": 2637,
  "date": "2022-03-29",
  "headline": "Kevin Kisner's match play prowess hasn't led to Ryder Cup - yet",
  "image": "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.3.1/websites/images/np/favicon-np.ico",
  "link": "https://nationalpost.com/pmn/sports-pmn/kevin-kisners-match-play-prowess-hasnt-led-to-ryder-cup-yet",
  "mediaOutlet": "news.nationalpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "‘Man, you were on the team and then you didn’t play well in the playoffs.’ OK, bud.”\nArticle content\nDustin Johnson, who last year became only the fifth player to go 5-0-0 at a Ryder Cup, is third in the current U.S. standings following his fourth-place finish in Austin.",
    "Kisner entered last week with a 16-6-2 record at the match play event, including a victory in 2019, and continued to build on that resume with six more wins before falling 3&1 to Scheffler in Sunday’s final.",
    "Article content\nKevin Kisner admittedly was disappointed not to be selected for his first United States Ryder Cup team last fall after closing the season with a win at the Wyndham Championship.",
    "If you had told me 15 years ago, you’re going to have four wins, play in a Presidents Cup, play in 35 straight majors, or whatever I’ve done, I would have said, ‘You’re f—ing crazy.",
    "Kisner will be attempting to make the team for the first time at nearly — he turned 38 in February — although he seems resigned to missing out on the event once again.",
    "In the very early Ryder Cup team rankings, the top 10 is filled out by Doug Ghim, Will Zalatoris, Keith Mitchell, Brooks Koepka, Max Homa and Daniel Berger.",
    "After several close misses, Kisner told the Sub-Par podcast in January that the Ryder Cup process is “too political for me.”\n“I don’t know, man.",
    "He is followed by Keegan Bradley and Harold Varner III, who claimed his biggest career victory to date in Saudi Arabia last month.",
    "1 in the Official World Golf Ranking thanks to his victory at the WGC-Dell Match Play event, where he beat Kisner in the final.",
    "Spain’s Jon Rahm, who had his 36-week stint atop the world rankings snapped this week, leads Team Europe Ryder Cup rankings.",
    "He is followed England’s Tommy Fleetwood and Tyrrell Hatton, Austria’s Bernd Wiesberger and England’s Matthew Fitzpatrick.",
    "Article content\nThe next Ryder Cup takes place from Sept. 25-Oct. 1, 2023, at Marco Simone Golf & Country Club in Rome.",
    "Scheffler ultimately was named to the squad that went on to rout Team Europe at Whistling Straits in September.",
    "Among those he was battling for one of the final spots on captain Steve Stricker’s team was Scottie Scheffler.",
    "Both are off to excellent starts in their quest to be part of captain Zach Johnson’s team in Rome next year.",
    "Article content\nKisner is atop the U.S. team rankings released on Tuesday, followed by Scheffler.",
    "“But if my career ended tomorrow, I’d be perfectly content with everything I’ve accomplished.",
    "I love playing team golf, I love representing the U.S., I’d love to be on any team possible.",
    "“I’ve had the same phone call for about four (Ryder Cups) in a row from about every captain.",
    "Scheffler already has three victories in 2022 while Kisner has risen to No.",
    "27 in the world with four top-10s in eight starts this year.",
    "They don’t like me I, guess,” Kisner said on the podcast.",
    "Northern Ireland’s Rory McIlroy is currently No.",
    "“Whatever, it’s fine,” he said on the podcast.",
    "It came a day after Scheffler rose to No.",
    "Homa and Berger are tied for 10th.",
    "“I don’t really care.",
    "'”\n–Field Level Media",
    "6."
  ]
}