{
  "id": 2664,
  "mediaId": 2713,
  "date": "2022-03-26",
  "headline": "Right place, right timing: AFL and game blessed Buddy landed in Sydney",
  "image": "https://static.ffx.io/images/$zoom_1.0773037037037037%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_684%2C$y_59/t_crop_custom/q_86%2Cf_auto/t_smh_analysis_no_age_social_wm/e6716f1e5e1bc7c6323f621533ab7dd421be576b",
  "link": "https://www.smh.com.au/sport/afl/right-place-right-timing-afl-and-game-blessed-buddy-landed-in-sydney-20220326-p5a86i.html?ref=rss&utm_medium=rss&utm_source=rss_sport",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Niall",
  "authorUrl": "https://www.smh.com.au/by/jake-niall-hved4",
  "termIds": [
    1332,
    1845,
    2121,
    3060,
    3614,
    4359,
    4583,
    101,
    238,
    5338
  ],
  "sentences": [
    "The AFL hierarchy, in the form of then chairman Mike Fitzpatrick, were angered when Franklin went to the Swans at the end of 2013 on that monstrous deal, the league believing then that the Swans had used their contentious cost of living allowance (COLA) to purloin the superstar from Hawthorn; in reality, the AFL had hoped he’d cross to their new offspring, the Giants.",
    "The regulation mark and goal encapsulated Franklin’s career, in that he’d found himself in the right place, at exactly the right moment: This time, at the storied Sydney Cricket Ground, and it says something about Buddy’s appeal that more than 36,000 turned up, many punting on the chance that he’d kick four goals against Geelong - less than a 50 percent proposition.",
    "Yet, this joyous storming of the field - an event that attracted global interest, with popular American sportscaster Pat McAfee referring to “Buddy f...g Franklin” - also had the postmodern element of the throng around Franklin also holding up their mobile phones, as if they were standing to record their presence at a boy band concert.",
    "But he got to a rising, talented Hawthorn, which forged a protective shield around this unique talent, in the knowledge that he could muck up off the field - at one point, the Hawks forced Franklin to have a senior player as chaperone if he went out on the town - and that Lance was completely media-averse.",
    "It will be remembered mostly for what was (fortunately) a benign ground invasion - the security didn’t have a prayer of getting around Franklin first - but my most vivid image of the match was that of the redoubtable Alastair Clarkson in the crowd, cracking a massive smile and wearing a Swans scarf.",
    "The adulation at the SCG.Credit:Getty Images\nFranklin himself is a thoroughly modern footballer - a 199 cm, 106 kilogram athlete who can run like a deer, with a lightweight boxer’s feet, as Dermott Brereton once put it - yet a throwback to the past in this key respect: he’s a serious goalkicker.",
    "The Franklin purchase would cost the Swans COLA and the ripples in the pond that followed saw them effectively banned from trading in 2014, while the resultant salary cap squeeze meant they were forced to offload a number of players - right up to Aliir Aliir and Jordan Dawson.",
    "Share\nNormal text sizeLarger text sizeVery large text size\n15\nView all comments\nAs he had hundreds, if not 999 times, Buddy Franklin found himself in the right place on the field - by himself, 35 or so metres from goal - when Chad Warner looked upfield.",
    "They should be thankful that he’s still playing, aged 35, in the ninth year of a $10m contract that appeared so reckless that the league forced the Sydney Swans’ board of directors to sign a document making them accountable if it turned to mud.",
    "No one, besides Buddy, is averaging better than three goals per game in these heavily coached, defensively dominant times, and he’s managed that feat with relatively limited aerial talents compared with the other 1000-goalers.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "The Swans, indeed, subsequently drew a distinction between the reserved “Lance” and his more exuberant on-field persona “Buddy.” It was anxious Lance who avoided scrutiny, Buddy who performed on the big stage.",
    "He’s the sixth footballer in the code’s premier competition to reach 1000 goals, the first Indigenous footballer to do so, and it’s conceivable that he will be the last player ever to reach the milestone.",
    "Fans, most of them young, had already jumped the fence after he took the mark, so it’s just as well, as an AFL senior figure conceded later, that Franklin kicked truly with fewer than six minutes left.",
    "They’ve made two grand finals - one in which Franklin was hurt and they were luckless (v the Bulldogs) - but the squeeze rendered them unable to fill holes with seasoned players for several years.",
    "The ratings on Friday night’s game - an average of 1.2 million viewers, not counting streaming, in a match that lasted close to four hours due to the halt in play - bear witness to Buddy’s appeal.",
    "Clarkson, his first AFL coach, was blessed that Richmond twice overlooked Franklin, in the storied 2004 national draft, while Buddy, equally, was fortunate in his first club.",
    "The same coach had bothered Buddy when he turned up, unannounced, in Las Vegas late in 2012 to press him on his future - an intervention that Franklin did not appreciate.",
    "Buddy would be the third key forward fugitive, after Lockett and Barry Hall, to seek refuge from relentless intrusions of being a name footballer in Melbourne.",
    "Still, the $10m has been well spent, if measured wholly on the interest it has spurred in the game of Australian football in the nation’s largest city.",
    "And he might have the further incentive of landing that elusive Sydney flag - the Swans now rising again via accumulation of young talent.",
    "It could have been Collingwood’s Peter McKenna, Tony Lockett at either St Kilda or the Swans, Matthew Lloyd with the Bombers.",
    "If Ash Barty’s abrupt retirement reminds us of anything, it is to savour the special sports performers while we have them.",
    "And it was Buddy who had the ball for that final shot, Buddy who felt the love of the fans when they crammed around him.",
    "The AFL’s great moment.Credit:The Age\nThe AFL should be thanking the heavens that he’s playing in Sydney, for the Swans.",
    "Had he gone to Richmond, who knows how he might have fared, since the ragged Tigers of old were not the Tigers of today.",
    "The notion of Franklin playing beyond that nine year deal - preposterous in 2013 - is suddenly feasible.",
    "By Jake Niall\n March 26, 2022 — 5.46pm\n Save\nLog in, register or subscribe to save articles for later.",
    "Ditto for Buddy Franklin, who, in his 18th season, remains mesmerising.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "Sorry, your browser doesn't support embedded videos.",
    "The scorecard of the Buddy deal is not clear-cut.",
    "The ground invasion was a throwback event.",
    "Thank you for reading the Herald.",
    "This article is complimentary.",
    "Hide content"
  ]
}