{
  "id": 2676,
  "mediaId": 2598,
  "date": "2022-03-29",
  "headline": "NFL Rumors: Chiefs' Tyrann Mathieu In No Rush To Make Free Agency Decision",
  "image": "https://imgb.srgcdn.com/dc515d68-35f1-48a3-837a-b147b57008bf.jpg",
  "link": "https://www.inquisitr.com/10004534/nfl-rumors-chiefs-tyrann-mathieu-in-no-rush-to-make-free-agency",
  "mediaOutlet": "Inquisitr",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1419,
    3333,
    3381,
    3686,
    3830,
    473,
    539,
    671,
    823
  ],
  "sentences": [
    "You just have to be patient and hang with it a little bit.”\nSara Sigmundsdottir Shows Off Bulging Biceps In Pre-Semi Finals Training\nNBA Rumors: Lakers Could Form 'Big 3' Of Paul George, Anthony Davis & Russell Westbrook In Crazy Trade Proposal\nChiefs Have Yet To Make Him An Offer\nNotably, it seems like the Chiefs have already ruled themselves out of the race for his services, as they didn't even offer him a new contract at the end of the season:\n\"As @ByKimberleyA has reported, I can confirm the Chiefs never offered Tyrann Mathieu a new contract.",
    "Steelers Are Out Of The Race\nThe Steelers were rumored to be in the race for him but with Minka Fitzpatrick due for a big extension, that won't be possible anymore:\n“Despite wishful thinking on the part of the public, they are not in financial position to sign Tyrann Mathieu because of the large extension they are prepared to give free safety Minkah Fitzpatrick, according to sources,” reported Gerry Dulac of the Pittsburgh Post-Gazette.",
    "4 Times Georgia Steel Thrilled Fans In Bikini\nLindsey Vonn In Bikini Pronounces Self-Worth\nEverything We Know About Jennifer Lopez’s Workout Secrets\nChlöe Bailey Gives A Tour Inside Her Beautiful Los Angeles Home\nBella Hadid In Bikini Channels Lizzie McGuire\nMathieu Is Taking Things Slowly\nBut it's not like teams haven't been knocking on his door over the past couple of months.",
    "I could see Honey Badger being out there for a while.”\nMalia Manuel In Bikini Shows Off Lithesome Physique\nHe's Looking For The Right Deal\nMathieu has gotten plenty of offers but has yet to find the team willing to meet his demands.",
    "But the former Texans and Chiefs star has yet to make the news for choosing a new team, and besides a couple of rumors here and there, it seems like there's no clear frontrunner to acquire his services.",
    "If anything, Mathieu is just taking it day by day, according to Ian Rapoport:\n“I don’t get the sense that he’s in a rush at all,” Rapoport said on The Pat McAfee Show.",
    "Apparently, he won't settle for less than what he's asking for as one of the prime defenders in his position:\n“Yeah, look he could have signed,” Rapoport added.",
    "Being one of the best, most energetic safeties in the NFL, one would think that Tyrann Mathieu should've signed a contract by this time.",
    "Plenty of teams could certainly use a vocal leader and solid stopper like Mathieu, so he won't be a free agent for long.",
    "Maybe if a team needs a safety, needs a leader, maybe they don’t get what they wanted in the draft, they come get him.",
    "“Like every year there are a couple of free agents, who kind of just linger out there and wait for maybe the draft.",
    "(The contract) that you’ve earned.’ The really good ones who know their value will just hang out and wait.",
    "When last season ended, Mathieu knew the Chiefs could make such a decision.\"",
    "Because if you’re a great player, you have all the leverage.",
    "It doesn’t always work out, but a lot of times it does.",
    "It’s, ‘Are you getting the contract you want?",
    "reported Nate Taylor of The Athletic.",
    "You’re a great player.",
    "“(In) many places."
  ]
}