{
  "id": 2697,
  "mediaId": 2606,
  "date": "2022-03-25",
  "headline": "Mack Hollins looks to make new memories at Allegiant Stadium",
  "image": "https://www.reviewjournal.com/wp-content/uploads/2022/03/16296317_web1_FBN-RAIDERS-MAR18-22hf_006.jpg",
  "link": "https://www.reviewjournal.com/sports/raiders/mack-hollins-looks-to-make-new-memories-at-allegiant-stadium-2551255/",
  "mediaOutlet": "Las Vegas Review-Journal ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Hill",
  "authorUrl": "https://www.reviewjournal.com/staff/adam-hill/",
  "termIds": [
    0
  ],
  "sentences": [
    "“So, here I am.”\nWhile he’s not the most high-profile receiver the Raiders acquired in an offseason that has seen superstar Davante Adams and talented Demarcus Robinson added to the roster, Hollins figures to add a veteran presence in the locker room and play a key role on special teams where he led the Dolphins in tackles last season.",
    "The 34-yard catch with an additional 15 yards tacked on allowed the Dolphins to somehow move the ball 49 yards on one play and set up an improbable field goal that kept Miami in playoff contention and broke the hearts of Raider nation.",
    "I thought they just made up some guy’s face, like somebody drew a smiley face on him and put a patch.”\nRaiders fans hope he can carve out a piece of franchise history for himself just like he did in Miami.",
    "So, I know I can be more than just a stretch-the-field guy.”\nHe hopes to show the Raiders the full repertoire he has developed over five seasons in the NFL, including last year as a team captain in Miami.",
    "“That’s the message of the NFL, I guess, is once you think you’ve arrived, that’s when they ship you out.”\nHollins is looking forward to reuniting with Hunter Renfrow, who he played against in the ACC.",
    "“Going into my sixth year, it’s always exciting to be able to play football, but it’s a little different coming here because I think I can really get an opportunity to excel here,” he said.",
    "Hollins streaked down the left sideline uncovered as quarterback Ryan Fitzpatrick heaved the ball in his direction while his facemask was twisted all the way around on his head.",
    "“I figure it’s only right I come back and try to do a few more of those plays in silver and black,” he said upon signing a one-year, $2 million deal with the Raiders.",
    "Hollins was selected by the Eagles in 2017 and played there until he was waived late in his third season, but not before winning a Super Bowl ring with Philadelphia.",
    "Wide receiver Mack Hollins may be new to the Raiders, but the team’s fans are well acquainted with the 28-year-old former fourth-round pick out of North Carolina.",
    "“I think just never getting comfortable with where you are, never thinking you’ve arrived,” he said of his keys to sticking around in the league.",
    "He finished the season with the Dolphins and then established himself as a leader over the next two full seasons.",
    "I just found out that the logo was designed by the father of the head equipment manager, and that’s his face.",
    "That, and the chance to work with the creative minds of quarterback Derek Carr and head coach Josh McDaniels.",
    "He did have 14 catches for 223 yards and a career-high four touchdowns as a receiver for Miami last year.",
    "I guess that’s the word, just excited.”\nThe Maryland native is already learning about his new franchise.",
    "The most memorable moment of his three seasons with the Dolphins, a catch that was voted the No.",
    "He has watched Renfrow develop in the NFL and believes their games will complement each other.",
    "“I think I definitely have the ability to stretch the field,” the 6-foot-4, 220-pounder said.",
    "I think it’s often overlooked the history of a team and how a team got to where they are.",
    "21 play in franchise history, happened late in the 2020 season at Allegiant Stadium.",
    "For the size that I am, I think people think that I can’t run routes and I can.",
    "“I think that’s what I guess since college has kind of been my thing.",
    "I can go in the slot, and I can beat defenders one-on-one.",
    "“You know, ‘Once the Raider, always Raider,” he said.",
    "I’ve followed football for 28 years and I never knew.",
    "But I also think that I can be a good route runner.",
    "Miami claimed him off waivers in December 2019.",
    "You know, why did they move from Oakland?",
    "I’ve been in the league six years.",
    "“I think that’s important.",
    "“So, I’m really excited."
  ]
}