{
  "id": 2699,
  "mediaId": 4042,
  "date": "2022-03-23",
  "headline": "It’s unbelievable how much the NFL QB picture has changed since 2019",
  "image": "https://cdn.vox-cdn.com/thumbor/pePUybPuM5W_4etsBRMqpio9nxo=/0x15:1920x1020/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23337460/pjimage.jpg",
  "link": "https://www.sbnation.com/nfl/2022/3/23/22991277/nfl-starting-qb-changes-2019-2022-russell-wilson-matt-ryan",
  "mediaOutlet": "SB Nation",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Dator",
  "authorUrl": "https://www.sbnation.com/authors/james-dator",
  "termIds": [
    0
  ],
  "sentences": [
    "Starting QBs: 2019 and 2022\nArizona Cardinals\nKyler Murray\nKyler Murray\nAtlanta Falcons\nMatt Ryan\nMarcus Mariota\nBaltimore Ravens\nLamar Jackson\nLamar Jackson\nBuffalo Bills\nJosh Allen\nJosh Allen\nCarolina Panthers\nKyle Allen\nSam Darnold\nChicago Bears\nMitch Trubisky\nJustin Fields\nCincinnati Bengals\nAndy Dalton\nJoe Burrow\nCleveland Browns\nBaker Mayfield\nDeshaun Watson\nDallas Cowboys\nDak Prescott\nDak Prescott\nDenver Broncos\nJoe Flacco\nRussell Wilson\nDetroit Lions\nMatthew Stafford\nJared Goff\nGreen Bay Packers\nAaron Rodgers\nAaron Rodgers\nHouston Texans\nDeshaun Watson\nDavis Mills\nIndianapolis Colts\nJacoby Brissett\nMatt Ryan\nJacksonville Jaguars\nGardner Minshew\nTrevor Lawrence\nKansas City Chiefs\nPatrick Mahomes\nPatrick Mahomes\nLas Vegas Raiders\nDerek Carr\nDerek Carr\nLos Angeles Chargers\nPhilip Rivers\nJustin Herbert\nLos Angeles Rams\nJared Goff\nMatthew Stafford\nMiami Dolphins\nRyan Fitzpatrick\nTua Tagovailoa\nMinnesota Vikings\nKirk Cousins\nKirk Cousins\nNew England Patriots\nTom Brady\nMac Jones\nNew Orleans Saints\nDrew Brees\nJameis Winston\nNew York Giants\nDaniel Jones\nDaniel Jones\nNew York Jets\nSam Darnold\nZach Wilson\nPhiladelphia Eagles\nCarson Wentz\nJalen Hurts\nPittsburgh Steelers\nBen Roethlisberger\nMitch Trubisky\nSan Francisco 49ers\nJimmy Garoppolo\nJimmy Garoppolo/ Trey Lance\nSeattle Seahawks\nRussell Wilson\nDrew Lock\nTampa Bay Buccaneers\nJameis Winston\nTom Brady\nTennessee Titans\nRyan Tannehill\nRyan Tannehill\nWashington Commanders\nCase Keenum\nCarson Wentz\nOnly three players who were starters in 2019 are completely out of the league, all due to retirement, all Hall of Fame-caliber players in Drew Brees, Philip Rivers and Ben Roethlisberger.",
    "Regardless of the reason we have seen incredible turnover at quarterback, and that’s still going to get weirder when the next round of obvious retirements happen, while other teams realize their development projects aren’t paying off.",
    "Of the QBs on the 2019 starting list who were drafted in the five years prior, only Kyler Murray, Lamar Jackson, Derek Carr, Patrick Mahomes, Dak Prescott and Daniel Jones find themselves still playing for the team that drafted them.",
    "Lost amongst the Russell Wilson and Matt Ryan trades of 2022 is a wider shakeup that’s been happening around the NFL with playoff teams moving into “win-now” mode, while the rest of the league tries to rebuild.",
    "This is not like a decade ago when players retired, sure, some have hung it up — but this is about the same group of quarterbacks rotating around the league and finding new homes.",
    "Rather than trying anything new, or playing mid-round draft picks to see if they have talent, teams have had a propensity to recycle failed players from other organizations.",
    "Organizations around the league are punting on the season, realizing they can’t content with the established “win-now” franchises, and are pinning their hopes on the future.",
    "This has stacked the draft in such a way that QB needy teams selected players, and are still developing them — while the better organizations have established passers.",
    "A total of 15 teams found new quarterbacks as veterans like Kurt Warner, Marc Bulger, Donovan McNabb, Brett Favre and numerous more retired.",
    "Essentially someone, somewhere in the NFL believed that every other player on this list had enough talent to warrant a contract.",
    "This is a hit rate of under 50 percent, and that’s not good — especially when we’re talking about such a short time span.",
    "It gets weirder, because while a total of 22 QBs are on new teams, 21 of these players are still starters in the NFL.",
    "The quarterback shuffle this offseason has been wild, but it’s really an extension of the past three years.",
    "Player turnover happens all the time, but it’s never quite been like this at the QB position.",
    "Only 10 passers who started for their teams in 2019 will be still starting for them in 2022.",
    "During the span from 2009-2012 was considered one of the greatest QB upheavals at the time.",
    "In total eight drafted quarterbacks started on 2019 teams and are now on new organizations.",
    "With all this upheaval it’s fun to look back and see where everyone went — so buckle up.",
    "Firstly, teams have been very risk-averse in their approach to the position.",
    "The worst teams have remained bad, and the best have been perennially good.",
    "Secondly, the crop of quarterbacks coming out recently have not been good.",
    "If you need further proof these last three years have been surreal.",
    "Hell, the Jets re-signed Joe Flacco as recently as five days ago.",
    "The 2023 draft is stacked at quarterback, and everyone knows it.",
    "That’s why we’re seeing so many retread players right now.",
    "Finally, the NFL has mostly been stagnant over the time.",
    "In that same gap from 2019-22: 22 teams have new QBs.",
    "So, what does all this QB movement tell us?",
    "However, this is a bridge year.",
    "What a time to be alive."
  ]
}