{
  "id": 2700,
  "mediaId": 2819,
  "date": "2022-03-30",
  "headline": "How Business Is Shaping Our Future",
  "image": "https://api.time.com/wp-content/uploads/2022/03/16x9_100.COMPANIES.GRID_.FINAL_.jpg?quality=85&w=1200&h=628&crop=1",
  "link": "https://time.com/6161943/time-business-future/",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Edward Felsenthal",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Others, like United Airlines and Capital One, took bold steps and dared their rivals to follow: United was the first major U.S. airline to issue an employee vaccine mandate, while Capital One recently became the first of its peers to eradicate overdraft and insufficient-fund fees, which so often punish those with the least ability to pay them.",
    "1 is quickly becoming the premier activist firm of the climate-capitalism movement, while AMC’s Adam Aron wrote the book—in real time—on how to respond to becoming a “meme stock,” by courting younger, digitally savvy investors to keep the company afloat.",
    "We’ve brought you inside the C-suites with interviews of major figures in the business world through our weekly Leadership Brief, and inside the rise of crypto and NFTs through staff writer Andrew R. Chow’s Into the Metaverse newsletter.",
    "From the vaccines that are pulling the world out of the worst depths of the pandemic to the unprecedented withdrawal of Western companies from Russia as a tool of war, business has never had a greater impact.",
    "One year ago, we launched TIME Business, a new franchise devoted to exploring the growing influence of business not only on our economic lives but also as a force shaping society and our collective future.",
    "“Taken together, these 100 companies—and the executives who run them—represent the firms and leaders who are charting an essential path forward,” says senior editor Alex Fitzpatrick, who oversaw the list.",
    "Moderna is developing new mRNA vaccines for a host of pathogens, while Astroscale is developing technology to safely deorbit satellites after their useful lives are over.",
    "And certainly not always for the good, as reflected in Billy Perrigo’s ongoing reporting on the all-too-frequent prioritization of profits over people in the tech world.",
    "Some, like pharmaceutical upstart Moderna and space-junk removal firm Astroscale, are pushing the boundaries of technology in new and potentially world-changing ways.",
    "You can see all that on display in our second annual TIME100 Companies list, included in this issue and featuring the world’s most influential businesses.",
    "As TIME’s business coverage continues throughout the year, these are the companies we’ll be watching most closely—and we suggest you do the same.",
    "Led by executive editor John Simons, we’ve chronicled everything from the future of work to how American shoppers broke the supply chain.",
    "Along the way, business has grown from a very small portion of our coverage to about one-fifth of all the content we publish.",
    "‘We Knew It Was Coming.’ Police-Reform Advocates in Grand Rapids, Mich., Had Been Bracing for a Death Like Patrick Lyoya’s",
    "Still others, like Alphabet and Ford, are titans whose sheer size and scope make them influential by nature.",
    "A weekly newsletter featuring conversations with the world’s top CEOs, managers, and founders.",
    "As Vivienne Walt reports in this issue, Engine No.",
    "1 and AMC, meanwhile, are changing the rules.",
    "Disrupters like Engine No.",
    "Join the Leadership Brief.",
    "That’s as it should be."
  ]
}