{
  "id": 2710,
  "mediaId": 2560,
  "date": "2022-03-21",
  "headline": "Roxanne Wood was found dead in her home in 1987. Police say they have cracked the case",
  "image": "https://www.gannett-cdn.com/presto/2022/03/21/PDTN/5370fb6b-79ed-48a7-9441-ccf688c4d6a3-FL5yFM5WYAQC71K.jpeg?crop=177,99,x6,y62&width=177&height=99&format=pjpg&auto=webp",
  "link": "https://www.detroitnews.com/story/news/local/michigan/2022/03/20/michigan-state-police-cold-case-roxanne-wood-patrick-wayne-gilham/7116717001/",
  "mediaOutlet": "Detroit News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carol Thompson",
  "authorUrl": "https://www.detroitnews.com/staff/4395808002/carol-thompson/",
  "termIds": [
    2100,
    2256,
    416,
    620,
    1231,
    4887,
    5037,
    5195
  ],
  "sentences": [
    "Michigan State Police troopers investigating the cold case involving the killing of Roxanne Wood in Niles, Michigan, in 1987 have identified Patrick Wayne Gilham, 67, of South Bend, Indiana, as a suspect based on evidence at the scene, additional interviews, surveillance and \"different resources,\" the department said.",
    "The Wood case was a \"landmark in the use of forensic genetic genealogy,\" the company said online, because the decades-old sample used to allegedly identify Gilham was \"highly degraded, representing the contents of only a few cells of his body.\"",
    "The company does not disclose much of its ongoing work because cases are active police investigations, but is working to uncover the identity of a young boy, estimated 7-12 years old, whose skull was discovered in St. Joseph County in 1993.",
    "Joseph James DeAngelo Jr., a former police officer, was sentenced to multiple consecutive life sentences in August 2020 for 13 murders and 13 rape-related charges that spanned much of California between 1975 and 1986.",
    "The evidence that led investigators to Gilham was examined by the MSP Forensic Laboratory in Grand Rapids and Identifinders International LLC, a California-based company that conducts forensic genetic genealogy.",
    "Some states limited police departments' use of genetic genealogy after the case, citing concerns about privacy of people who use genealogy websites and their relatives, the New York Times reported last year.",
    "The Golden State Killer terrorized California as a serial burglar and rapist and killed more than a dozen people while evading capture for years from the 1970s to the '80s, the AP reported.",
    "MSP's Niles Post started investigating Wood's murder on Feb. 20, 1987, the date Wood's husband, Terry Wood, found his wife's body in the kitchen of their home at about 1:15 a.m., MSP said.",
    "Police used pioneering DNA technology from crime scenes to find a distant relative through a popular genealogy website database then built a family tree that eventually led them to him.",
    "MSP reopened the case in 2001 and 2020, the Associated Press reported, and were aided by new technology to help connect Gilham allegedly to the crime.",
    "A 35-year-old slaying case spurred by technology unavailable decades ago has led to an Indiana man in the death of a woman, police said.",
    "He was arrested in February in South Bend on a warrant issued by the Berrien County Prosecutor's Office, the Associated Press reported.",
    "After Gilham was identified as a suspect, he was \"surveilled extensively\" by undercover state police troopers and interviewed twice.",
    "They tailed DeAngelo and secretly collected DNA from his car door and a discarded tissue to get an arrest warrant, AP reported.",
    "Terry Wood had driven separately from his wife for a night of bowling, the AP reported, and Roxanne had arrived home first.",
    "Gilham has entered a no contest plea to second-degree murder and will serve at least 23 years in prison, MSP said Friday.",
    "Company President Colleen Fitzpatrick described the case as having \"the toughest technical challenges we have faced.\"",
    "The technology is similar to that used to identify the Golden State Killer, according to the company's website.",
    "MSP detective sergeants John Moore and Jason Bailey joined the investigation 18 months ago.",
    "His arrest was days away from the 35th anniversary of the day Roxanne Wood, 30, was slain.",
    "Identifinders International said it can process \"even the most challenging DNA samples.\"",
    "Western Michigan University's Cold Case Program also contributed to the investigation.",
    "The case had remained active with the MSP Fifth District Cold Case Team.",
    "The investigation took more than 10,000 hours of investigative work.",
    "It conducts \"indefinite monitoring for new DNA relatives\" on cases.",
    "It was the first time the program collaborated with MSP.",
    "The plea deal spared him the death penalty.",
    "ckthompson@detroitnews.com"
  ]
}