{
  "id": 2782,
  "mediaId": 2594,
  "date": "2022-03-09",
  "headline": "‘It’s been crazy’: Brett Wild and Millie Knight frustrated by ParalympicsGB’s intense schedule",
  "image": "https://static.independent.co.uk/2022/03/09/08/urnpublicidap.org7f5fc69bd9cb4fb59c4d1651deb57476.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/winter-olympics/brett-wild-millie-knight-paralympics-b2031732.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Will Jennings",
  "authorUrl": "https://www.independent.co.uk/author/will-jennings-0",
  "termIds": [
    1360,
    1796,
    3590,
    3990,
    157,
    4852,
    5240
  ],
  "sentences": [
    "\"Working closely and collaboratively with GB Snowsport every step of the way, we put in place robust travel protocols to help mitigate against the risk of athletes missing the opportunity to compete at the Games because of a positive Covid-19 test, whilst also giving them the best opportunity to achieve their full sporting potential at Beijing 2022.",
    "She cut a forlorn figure after a sluggish second run in Monday’s Super Combined slalom, where she was leapfrogged by compatriot and technical specialist Menna Fitzpatrick – Britain’s most decorated Winter Paralympian athlete – onto the podium.",
    "“Coming fourth hurts again.”\nNo one does more to support our Olympic and Paralympic athletes than National Lottery players, who raise more than £30 million each week for good causes including grassroots and elite sport.",
    "“I’ll admit we’d have preferred it to be different.”\nResponding to Wild’s outburst, ParalympicsGB said: \"The health and wellbeing of every athlete at the Beijing 2022 Paralympic Winter Games is always our top priority.",
    "The British pair have endured a rocky ride on the gruelling World Cup circuit as Knight battled back from a near-career ending concussion suffered in Leogang, Austria, last February to book her place at a third Games.",
    "\"The historic success of the Alpine Skiers at these Paralympic Winter Games so far points to the difficult balancing act having been largely achieved, but we recognise every athlete is an individual.",
    "The fatigued duo bagged a brave downhill bronze on day one of the Games but near misses on Sunday – they came fourth by 0.09s in the Super-G – and Monday derailed their momentum.",
    "Knight and Wild, who won three medals at PyeongChang 2018, have had just one day off since arriving in China and took to the Yanqing snow just hours after hitting the runway.",
    "We’ve had a lot of days of downhill and Super-G skiing, and all of a sudden in the space of half a day, we’re changing to the shortest distance and discipline.",
    "And Glaswegian Wild, also a Royal Navy submariner, fumed: “Our schedule, in terms of our acclimatisation and jet lag prevention, hasn’t been ideal.",
    "Discover the positive impact playing the National Lottery has at www.lotterygoodcauses.org.uk and get involved by using the hashtag: #TNLAthletes",
    "The Glaswegian, 29, guided visually impaired skier Millie Knight to Super Combined fourth on Monday in the third alpine event in as many days.",
    "\"Every athlete is always encouraged to voice any concerns they might have as soon as possible so we can agree the best way to support them.\"",
    "Monday’s Super Combined event was due to take place on Tuesday but was brought forward 24 hours because of boiling Beijing conditions.",
    "I guess we can be pleased with that – we just didn’t have enough of a buffer in the Super-G to give us a bit of time in the slalom.",
    "“I’d have liked to have either flown earlier, or at least had a day off after we arrived to get over jet lag before skiing speed.",
    "“The Super-G run was better than yesterday’s, and that was probably the best we skied slalom in a very long time.",
    "Knight and Wild now have a midweek break ahead of pivoting their attention to Friday’s giant slalom event.",
    "Brett Wild took aim at a ‘crazy’ Paralympic schedule after suffering more medal heartbreak in Beijing.",
    "We arrived on the 25th and skied on the 26th, whereas normally we’d have an acclimatisation day.",
    "Knight, 23, corroborated Wild’s criticism and added: “The schedule is obviously very intensive.",
    "We are tired, we’ve had one day off in eight days off the back of severe jet lag.",
    "“It’s all just been so rushed and really challenging since the day we arrived.",
    "It’s been crazy and really difficult."
  ]
}