{
  "id": 2802,
  "mediaId": 2594,
  "date": "2022-03-13",
  "headline": "Neil Simpson caps golden Games as GB flagbearer at closing ceremony",
  "image": "https://static.independent.co.uk/2022/03/13/13/667063e1a6971f1d5495cbae2d4a3986Y29udGVudHNlYXJjaGFwaSwxNjQ3MjUyNDIy-2.65762851.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/winter-olympics/paralympicsgb-union-jack-beijing-great-britain-millie-knight-b2034810.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pa Sport Staff",
  "authorUrl": "https://www.independent.co.uk/author/pa-sport-staff",
  "termIds": [
    3590,
    3990,
    157,
    5370
  ],
  "sentences": [
    "Just to feel the team here is just a real marker that maybe come Milan, we participated today, and hopefully in four years’ time we’ll be on that start line competing in a race like the relay.”\nThe Simpson brothers were in action on the final day, finishing ninth in the men’s slalom, while James Whitley finished in eighth place in the standing slalom.",
    "You have the hype and additional pressure, but if you can put that to one side you can treat it as just another race.”\nParalympicsGB finished with six medals in total as Menna Fitzpatrick won a silver and bronze, Millie Knight took bronze and Ollie Hill won bronze in the snowboarding.",
    "They were unable to add to their tally on the final day on Sunday, though there was more history made as Steve Arnold, Scott Meenagh, Steve Thomas and Callum Deboys became the first British team to complete the cross-country open relay.",
    "The 19-year-old made history by claiming Britain’s first male Paralympic gold on snow, triumphing in the men’s Super-G vision-impaired class, with 21-year-old brother Andrew on hand as his guide.",
    "He was the only Briton to top the podium in 2022, also winning bronze in the men’s super combined class and was given the honour of carrying the Union Jack as the Games closed on Sunday.",
    "“Having a relay team on the start line today and a relay ream that didn’t include all the athletes we have on the ground is testament to the progression we’ve made.",
    "Golden boy Neil Simpson was Great Britain’s flagbearer alongside his brother Andrew at the closing ceremony of the Beijing 2022 Paralympic Winter Games.",
    "“We’ve come on aeons in such a short period of time, every other nation in the world has noticed it as well and it’s something we’re really proud of.",
    "“To be chosen as flagbearers at the closing ceremony is such an incredible honour for me and my brother,” Neil Simpson told ParalympicsGB’s website.",
    "“Coming out to the Games was something pretty special anyway and then we wanted to try and enjoy it.",
    "The quartet finished 12th with a time of 35:27.3, with Meenagh citing it as a landmark achievement.",
    "“It’s fairly significant in terms of a mark of progress of how the programme’s developed,” he said.",
    "“When we were asked it really made what has already been a special Games for us even more amazing.",
    "The team environment has been really good, everything about it has been well organised.",
    "“What I have learned is we have nothing to be afraid of at this level of competition.",
    "“It’s been really special, a really cool experience."
  ]
}