{
  "id": 2807,
  "mediaId": 2594,
  "date": "2022-03-11",
  "headline": "Oldest British Paralympic skier Shona Brownlee feels part of GB ‘family’ in Beijing",
  "image": "https://static.independent.co.uk/2022/03/11/11/SEI92709216.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/winter-olympics/oldest-british-paralympic-skier-shona-brownlee-feels-like-part-of-gb-family-b2033737.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Will Jennings",
  "authorUrl": "https://www.independent.co.uk/author/will-jennings-0",
  "termIds": [
    2660,
    3590,
    3990,
    157,
    5370
  ],
  "sentences": [
    "“I know they’re all there supporting me – I just want to keep building on the experience, take what I can, learn and see where it leads in the future.”\nNo-one does more to support our Olympic and Paralympic athletes than National Lottery players, who raise more than £30 million each week for good causes including grassroots and elite sport.",
    "“I didn’t even expect to be here this year so I’ve already exceeded my expectations – I just need to keep building on that and get better each run.”\nBrownlee had her leg amputated after a military accident in 2018 before first taking to a ‘sit-ski’ as part of the Ministry of Defence’s Battle Back programme the next year.",
    "At 42, Brownlee is the oldest member of ParalympicsGB’s ten-strong alpine skiing squad alongside the decorated likes of Menna Fitzpatrick and Millie Knight, who have racked up ten Paralympic medals between them by the age of 23.",
    "They’re an awful lot more experienced than I am - both of them have been skiing since quite a young age competing on the circuit for a few years, so they’re really good at helping out and letting me know what to expect.",
    "The Scot continued to develop throughout 2020 and after clinching Super-G silver and giant slalom bronze at January’s World Championships in Lillehammer, her place on the Paralympic plane was all-but secure.",
    "But Brownlee, who only first competed in an international race in 2019 and won a pair of World Championship medals to gear up for the Games, said: “It’s just like a family.",
    "She clinched an impressive sixth-place finish on debut in Sunday’s super-G before following it up with an admirable ninth in Friday’s technically-challenging giant slalom.",
    "They were cheering me at the finish line, we were supporting the boys [Neil and Andrew Simpson] yesterday - everybody really wants everybody else to do well.",
    "And three gold medals at British Championships followed by a third place in the Europa Cup then propelled her further into the international spotlight.",
    "Discover the positive impact playing the National Lottery has at www.lotterygoodcauses.org.uk and get involved by using the hashtag: #TNLAthletes",
    "“I’m just trying to learn from everything and get as much as I can from the experience – I’m trying to put that into practice and build on it.",
    "Sitting skier Shona Brownlee insists age is just a number as she continues to immerse herself in Great Britain’s Winter Paralympic ‘family’.",
    "And she added: “They’ve been up during the night watching – they’re probably still in disbelief and excited that I’m here, just like I am.",
    "The Scot has enjoyed a searing rise on the international circuit and is revelling in her maiden Games experience at Beijing 2022.",
    "Brownlee’s family all hail from West Lothian, where she will return after she competes in Saturday’s final slalom event.",
    "“Everybody gets on each other’s nerves now and again but overall, it’s a really good team and we work well together.",
    "“It’s been great having Menna and Millie on the team – I think age is just irrelevant.",
    "Hopefully that will take me further."
  ]
}