{
  "id": 2812,
  "mediaId": 2572,
  "date": "2022-03-09",
  "headline": "Commanders to acquire Carson Wentz from Colts for draft picks: report",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/Carson-Wentz.jpg",
  "link": "https://www.foxnews.com/sports/commanders-to-acquire-carson-wentz-colts-report",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Gaydos",
  "authorUrl": "https://www.foxnews.com/person/g/ryan-gaydos",
  "termIds": [
    3931,
    496,
    817,
    1218
  ],
  "sentences": [
    "Ryan Fitzpatrick, who the team signed at the beginning of the 2021 season, only appeared in one game after going down in Week 1 with an injury and missing the remainder of the season.",
    "Their 26-11 loss to the Jacksonville Jaguars set off a chain reaction in the NFL, making the final game of the regular season matter more than ever.",
    "Wentz had the Colts in playoff contention for most of the season but lost the final two games of the season and failed to get into the playoffs.",
    "According to ESPN, the team is expected to pay the full $28 million Wentz is owed for 2022 and the $5 million roster bonus he’s owed next week.",
    "The Commanders had Taylor Heinicke start a majority of their games with Garrett Gilbert starting one and Kyle Allen appearing in two more.",
    "It was only the third time in his career he’s played at least 16 games since he came into the league at the start of the 2016 season.",
    "The Indianapolis Colts traded Wentz to the Washington Commanders for a handful of draft picks, ESPN reported on Wednesday.",
    "Wentz only spent one season with the Colts after the team acquired him from the Philadelphia Eagles last offseason.",
    "Washington is reportedly receiving at least two third-round picks in the deal.",
    "Washington won the division in 2020 but failed to make the postseason in 2021.",
    "He had 3,563 passing yards, 27 touchdown passes and seven interceptions.",
    "The Commanders have been in the market for a starting quarterback.",
    "Carson Wentz appears to be the latest quarterback on the move.",
    "Wentz played and started each of the team’s 17 games."
  ]
}