{
  "id": 2815,
  "mediaId": 4045,
  "date": "2022-03-11",
  "headline": "Bid to review failed Rams rescue plan fizzling after two false starts",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/b/fa/bfa66de0-960c-5a68-b99e-3339e2990160/622b8a26719ac.preview.jpg?crop=1500%2C788%2C0%2C28&resize=1200%2C630&order=crop%2Cresize",
  "link": "https://www.stltoday.com/news/local/govt-and-politics/bid-to-review-failed-rams-rescue-plan-fizzling-after-two-false-starts/article_bfa66de0-960c-5a68-b99e-3339e2990160.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kurt Erickson",
  "authorUrl": "https://www.stltoday.com/users/profile/Kurt%20Erickson",
  "termIds": [
    1273,
    1433,
    3399,
    51,
    134,
    570,
    1074,
    5057,
    5159,
    5330
  ],
  "sentences": [
    "State Treasurer Scott Fitzpatrick has twice backed efforts to hire a company to review the spending surrounding the state’s effort to help convince Rams owner Stan Kroenke and his National Football League colleagues to keep the team in Missouri.",
    "The stalled review comes as the focus in St. Louis is on how to divvy up more than $500 million the region won in a settlement with the National Football League over Kroenkes’ decision to move the team to the West Coast.",
    "In November, Fitzpatrick said the settlement, which will funnel the money to the city, county and the Regional Convention and Sports Complex Authority, known as the RSA, should not stop the audit from going forward.",
    "He argued that the state should hire a company to determine whether more than $17 million used in the effort to develop an open-air, riverfront stadium for the football team was well spent.",
    "“If the services are unable to be procured at a reasonable cost for taxpayers, it may be the case that the state auditor should look into this in the near future,” his office said.",
    "JEFFERSON CITY — A top state Republican’s bid to shine more light on the failed effort to keep the Rams professional football team from leaving St. Louis appears to be dimming.",
    "Fitzpatrick, who is running for state auditor against Rep. David Gregory, R-Sunset Hills, said there is an alternative to hiring an outside firm to conduct the review.",
    "House Budget Committee chairman Cody Smith, R-Carthage, also is signaling that money for the review may not be earmarked in the upcoming state spending plan.",
    "“The Treasurer remains concerned with the process for selecting vendors and the purpose they each served in the stadium effort,” his office said.",
    "Fitzpatrick, a Republican, floated the idea of a review when he was a state lawmaker serving as the powerful chairman of the House budget panel.",
    "As governor, Nixon had appointed former Anheuser-Busch executive Dave Peacock to work with attorney Bob Blitz to head up the stadium proposal.",
    "“Two failed procurements make it unlikely a third procurement will succeed at the current appropriated amount,” his office said.",
    "“We’ve tried to get that off the ground for a couple of years now and haven’t had much luck,” Smith told the Post-Dispatch.",
    "Of the millions spent to retain the team, the St. Louis-based architecture firm HOK made the most, more than $10.5 million.",
    "Most of the riverfront stadium design work was awarded without bids, and many of the contractors had political ties.",
    "Companies engaged by the task force seeking to keep the Rams from leaving gave more than $200,000 to former Gov.",
    "A year ago, the state issued a request for a contractor to perform the evaluation, but no firms submitted bids.",
    "In each case, however, no vendors stepped forward to bid on the job, despite the lure of a $100,000 payday.",
    "Again, no law firms, accountants or other financial services companies stepped forward to take on the job.",
    "“The desire still remains to determine what happened around the Rams departing the state,” he said.",
    "In September, the state made another attempt to find a company willing to conduct the study.",
    "The Dome authority’s attorneys, Blitz, Bardgett & Deutsch, have billed for almost $900,000.",
    "In a statement, Fitzpatrick’s office said the search for answers may be coming to an end.",
    "Jay Nixon, a Democrat, and more than $300,000 to former St. Louis Mayor Francis Slay.",
    "Smith said the lack of a contract doesn’t mean officials have completely given up.",
    "Nixon joined one of the law firms, Dowd Bennett, after he left office.",
    "Thompson Coburn bond and financing lawyers charged $760,000.",
    "Blitz’s firm, for instance, gave more than $10,000 to both.",
    "Fitzpatrick agrees."
  ]
}