{
  "id": 2823,
  "mediaId": 2728,
  "date": "2022-03-12",
  "headline": "Pressure-packed hoops flaring up tempers on the hardwood",
  "image": "https://images.thestar.com/hoh60GIYeYCG4FznG0oymb4MKXk=/1280x1024/smart/filters:cb(1647073160506)/https://www.thestar.com/content/dam/thestar/sports/basketball/ncaa/2022/03/12/pressure-packed-hoops-flaring-up-tempers-on-the-hardwood/20220310140336-622a5404a7430ba486a4184ajpeg.jpg",
  "link": "https://www.thestar.com/sports/basketball/ncaa/2022/03/12/pressure-packed-hoops-flaring-up-tempers-on-the-hardwood.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Larry Lage",
  "authorUrl": "",
  "termIds": [
    1848,
    2730,
    3179,
    3388,
    3394,
    3969,
    96,
    5145
  ],
  "sentences": [
    "“But at the same time there’s emotion involved with everything that we do, and sometimes our emotions get the best of us.”\nHoward said he wasn’t sure if pandemic pressures played a part in the melee at Wisconsin or in the crowd at the Bryant-Wagner game, but the Michican coach said he was quite confident the challenges of the pandemic last year have not entirely gone away.",
    "Follow Larry Lage on Twitter at www.twitter.com/larrylage\nMore AP college basketball: https://apnews.com/hub/college-basketball and https://apnews.com/hub/ap-top-25-college-basketball-poll and https://twitter.com/AP_Top25\nSHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Teams and conferences have tried to beef up mental health support for their players since the pandemic hit in 2020, with basketball teams a particular concern at times because of the isolation tied to sometimes-empty campuses and travel.",
    "As things have returned to something more normal, there have been some flashpoints:\n— Michigan’s Juwan Howard struck a Wisconsin assistant in the head during an emotionally charged postgame handshake line nearly three weeks ago.",
    "Syracuse's Buddy Boeheim sits on the bench in the first half of an NCAA college basketball game against Duke during quarterfinals of the Atlantic Coast Conference men's tournament, Thursday, March 10, 2022, in New York.",
    "But I think fans have had it bottled up in them for a couple years now.”\nMitch Abrams, a psychologist who studies violence in sports, said he does not think the pandemic triggered any of the the recent flare-ups.",
    "That triggered two of Howard’s players to throw punches of their own, leading to a five-game suspension for the coach and one-game suspensions for Moussa Diabate and Terrance Williams II.",
    "Howard took full responsibility for his actions earlier this week before the Wolverines were ousted by Indiana in the Big Ten Tournament in a keen blow to their NCAA Tournament hopes.",
    "“I think the pandemic has affected all of us, especially these (players), and I think fans more than the players, “Wright said at the Big East Tournament earlier this week.",
    "Nearly 900 games in Division I men’s and women’s basketball were postponed or canceled because of the pandemic this season alone and the scene was similar last season.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "— The Northeast Conference tournament final was marred by a fight in the stands among fans that broke out as Bryant was cruising along to a win over Wagner.",
    "Violence is always multiply determined.”\nProvidence coach Ed Cooley said emotions can “get in the way,” even for players who have been told to keep cool.",
    "Pressure-packed basketball is back, with buzzer-beating shots all over the place on the eve of the NCAA Tournament and all of its March Madness.",
    "Buddy Boeheim, the ACC’s leading scorer, attended the postgame news conference with his family members and apologized for losing his cool.",
    "Wagner’s Will Martinez was ejected for attempting to join the fray and several players had to be restrained from entering the stands.",
    "— Syracuse guard Buddy Boeheim punched Florida State’s Wyatt Wilkes in the stomach at the Atantic Coast Conference tourney.",
    "Villanova coach Jay Wright said the pandemic is part of the reason tempers are running hot on and around the hardwood.",
    "The ACC suspended the star, forcing him to watch coach Jim Boeheim, his frather, and teammate big brother lose to No.",
    "He chalked Howard’s slap up to bad sportsmanship after being provoked and said fan misbehavior is nothing new.",
    "“But I think we all have gotten stronger during the process.”\nAP Sports Writer Mike Fitzpatrick contributed.",
    "The relief and joy comes after two long years of stress across college basketball and sports in general.",
    "”Even though you’re physically talented, it doesn’t you don’t have psychological issues.",
    "“We want to vilify people for transgressions and we deify sports heroes,“ Abrams said.",
    "“This is something new that we all haven’t experienced before,” Howard said Wednesday.",
    "There was bonding that the players enjoyed during the pandemic.",
    "“The players got to play, and really enjoyed that.",
    "“We all do things we’re not proud of,” he said.",
    "The Star does not endorse these opinions.",
    "7 Duke the next day.",
    "It’s complicated."
  ]
}