{
  "id": 2833,
  "mediaId": 2523,
  "date": "2022-03-08",
  "headline": "Who could be the Seahawks' new quarterback after Russell Wilson's departure?",
  "image": "https://phantom-marca.unidadeditorial.es/e698751f1c3629b33fdb49c7f0aca4c3/resize/1200/f/jpg/assets/multimedia/imagenes/2022/03/09/16467830817043.jpg",
  "link": "https://www.marca.com/en/nfl/seattle-seahawks/2022/03/09/6227f0e6e2704e3d8a8b4621.html",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The two top names to pursue a trade with the capital acquired in the Wilson trade are Jimmy Garoppolo and Deshaun Watson, the former looking unlikely as he belongs to the division rival San Francisco 49ers, the latter depending on Seattle's willingness to accept the Houston Texans quarterback's legal questions.",
    "It is true that this draft class is not viewed as the strongest as far as quarterbacks go and that there could be a hidden name here in later rounds, however, it is also true that in the deal for Wilson they have the #9 overall pick and could take a chance on Kenny Pickett from the University of Pittsburgh.",
    "he NFL will see many new faces in places where certain figures with long careers seemed immovable, especially at the quarterback position, where the Pittsburgh Steelers will change their passer after 18 years and now the Seattle Seahawks will not see Russell Wilson at the controls after 10 years.",
    "Free agency/trade\nThe quarterback names available in free agency are not the most attractive, they include Mitchell Trubisky, Ryan Fitzpatrick, Andy Dalton, Cam Newton, Cam Newton, Tyrod Taylor, Jameis Winston, Jacoby Brissett, Marcus Mariota and Cam Newton.",
    "A quarterback from the roster\nThe reality is that none of the options that are in this option are the most appealing to Seahawks fans, according to the depht chart, Geno Smith and Jacob Eason would be the names to consider here along with Drew Lock's case.",
    "Lock would be acquired in the trade that has brought Wilson to the Denver Broncos and would be the favorite of the three if the Seahawks go for this scenario as he was a starter with the \"Mile High\" team last season.",
    "A quarterback from the draft\nWhen Russell Wilson came to Seattle in the 2012 Draft he did so being selected in the third round and the team had Matt Flynn as their starter that they had taken out of free agency.",
    "Here's a look at the top options or scenarios the Seattle team could decide on for Seattle's new QB.",
    "The question is clear, who can be the next Seahawks quarterback?"
  ]
}