{
  "id": 2839,
  "mediaId": 4045,
  "date": "2022-03-08",
  "headline": "Diggin' deep: Looking for an edge at The Players",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/a/85/a852f625-8cab-5892-a4b2-d101a411cfdd/6227a8e8342f1.preview.jpg?crop=996%2C523%2C2%2C11&resize=996%2C523&order=crop%2Cresize",
  "link": "https://www.stltoday.com/sports/betting/diggin-deep-looking-for-an-edge-at-the-players/article_a852f625-8cab-5892-a4b2-d101a411cfdd.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Kiewiet Montana Standard",
  "authorUrl": "",
  "termIds": [
    2472,
    2695,
    3936,
    932,
    4977
  ],
  "sentences": [
    "Another thing I’ve noticed about the leaderboard is that there are key stats which are consistently important, but guys who aren’t traditionally known for those traits have excelled in these categories at The Players.",
    "Finally, there are six par-4s in the neighborhood of 400-450 yards (give or take 15 yards, depending on the tee box and pin locations), so we’ll also look at par-4 scoring efficiency from 400-450 yards.",
    "He doesn’t have outstanding history at TPC Sawgrass or comp courses, but I'm going with my gut here (really going out on a limb betting one of the most popular players on Tour, I know!).",
    "After taking fifth at the 2019 Wyndham, he was blitzing the field at a rate of 6.74 total strokes per round during the 2020 Players before the tournament was shut down due to COVID-19.",
    "Not only does he have consistent success at TPC Sawgrass and Sedgefield CC, but his performance at the Wyndham often correlates to success during The Players that immediately follows.",
    "The reason I mention those numbers before the API is because almost everyone’s metrics plummeted in those categories after horrible scoring conditions at Bay Hill last weekend.",
    "Scott has finished in the top-15 in four of his last five starts at The Players, and the 2004 champion really seems poised to break through for a victory one of these weeks.",
    "The Players always has a substantially stronger field than those events, so a T20 or T30 finish at the 3M Open probably isn’t predictive of a strong finish at The Players.",
    "I’ll be considering past success as these events while filling out my card, but a player needs to have a top-10 or a victory on one of these courses to get my attention.",
    "The Florida swing treks about 150 miles from Bay Hill toward the northeast coast of the Sunshine State for The Players Championship in Ponte Vedra Beach.",
    "Adam Scott, a player I like this week for example, won The Players back in 2004 but also missed the cut twice and finished outside the top 40 four times.",
    "The books don’t charge us extra dollars for a player missing the cut, and we don't need to cash a winner every week in order turn a profit, long term.",
    "The average odds of the winner has been +8300, with four favorites cashing, three mid-range players getting home and four longshots coming through.",
    "Prior to the Arnold Palmer Invitational, Fitzpatrick was 12th in par-4 efficiency from 400-450 and third in par-5 birdie or better percentage.",
    "Other than the drivable-ish (depending on the tee box and pin location) par-4 12th hole, scoring opportunities seem to be at the four par-5s.",
    "During the 2021 Players, Im shot not one but two 66s, but his overall score ballooned with a couple too many mishits ending up in the water.",
    "Si Woo Kim, another player I like this week, also has a Players victory under his belt but also has a pair of finishes outside the top 50.",
    "If you can’t find the green on your approach – which is common with small, fast greens – you’ll need to be able to scramble and save par.",
    "In addition to driving accuracy, shots gained: approach and SG: around the green, the course specs give us our last few items to look at.",
    "It won’t be an all-out birdiefest by any stretch of the imagination, but low scores are out there as Justin Thomas proved last year.",
    "According to Data Golf, the three best comparisons to TPC Sawgrass are Sedgefield Country Club, TPC Twin Cities and TPC Potomac.",
    "Sedgefield hosts the Wyndham Championship, TPC Twin Cities hosts the 3M Open and TPC Potomac hosts the Wells Fargo Championship.",
    "Even those who have had success at TPC Sawgrass and other comparable courses might also have multiple missed cuts at this event.",
    "His recent form is outstanding, with his last competitive round being a 6-under 65 at the Genesis Invitational for a T2 finish.",
    "He’s shown he can win this season with his victory at the Shriners and enters this weekend fresh off a T20 finish at the API.",
    "When Morikawa’s irons are dialed in, there is not a green on earth that is too small or too fast to hold his approach shots.",
    "But we can do our best by taking someone's recent form into strong consideration when going through our key stats.",
    "The logic being: if they are currently excelling at something, perhaps that will continue for another tournament.",
    "Matthew Kiewiet is the sports editor for the Montana Standard and sports betting columnist for 406MTSports.",
    "He also has a T2 at the 2021 Wyndham, where he was tied for the lead after 72 holes but lost in a playoff.",
    "The leaderboard at this tournament tends to be a bit more volatile than the Arnold Palmer Invitational.",
    "The 2021 champion put himself in the mix by shooting 8-under on Day 3 before closing with a 4-under.",
    "I don’t think there is a better course fit in the field, and we have an interesting trend with Kim.",
    "According to PGA Splits 101, since 2010 the winner of The Players has shot an average of 14-under.",
    "But he’s been excellent in both areas during various appearances in The Players over the years.",
    "Water hazards galore and forced layups will give an edge to fairway finders and shot shapers.",
    "If he can stay out of trouble this weekend, Im has shown he can go low at TPC Sawgrass.",
    "Email him at matthew.kiewiet@406mtsports.com or follow him on Twitter @mattkiewiet406.",
    "Im finished T17 at the 2021 Players and has a pair of top-10 finishes at the Wyndham.",
    "He is not known as someone who is accurate off the tee or great around the greens.",
    "So we’ll want to check out par-5 birdie or better percentage for each player.",
    "Being a TPC course, there are quite a few close comparisons on the PGA Tour.",
    "He didn’t play the Wyndham in 2017 and finished T63 at The Players in 2018.",
    "Let’s see if that trend continues and we get a strong finish this weekend.",
    "When putting together a betting card, volatility doesn’t really hurt us.",
    "Kim was cut at the 2018 Wyndham and finished T56 at the 2019 Players.",
    "For daily fantasy players, this tournament can be quite frustrating.",
    "Speaking of key stats, it’ll be more of a finesse game this week.",
    "A T3 finish at the 2020 Wyndham led to a T9 at the 2021 Players.",
    "Below I’ll go through my favorite bets for outright winner.",
    "His last four starts have resulted in: T12, T6, T10 and T9.",
    "After a 2016 victory at the Wyndham, he won The Players.",
    "He has three top-10 finishes in his last five starts.",
    "Finally, we see Kim finished T2 at the 2021 Wyndham.",
    "1 on Tour in par-4 efficiency from 400-450 and No.",
    "Check the breakout box for my entire betting card.",
    "Even now he ranks 32nd and eighth, respectively.",
    "Elite iron play will be the ticket to success.",
    "Fitzpatrick comes in with excellent form.",
    "So how do we predict outliers like this?",
    "4 in par-5 birdie or better percentage.",
    "Take Bryson DeChambeau, for example.",
    "Short answer: we cannot.",
    "Morikawa is No."
  ]
}