{
  "id": 2841,
  "mediaId": 2586,
  "date": "2022-03-10",
  "headline": "Bills Predicted to Sign Rob Gronkowski for ‘Romantic’ Ending to Career",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Rob-Gronkowski-1-e1646948579626.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-predicted-sign-rob-gronkowski/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The Bills are reportedly interested in bringing him aboard to boost their pass-catching options around Josh Allen and, given that Gronkowski is an upstate New York native, it would be a fitting bookend to finish out his career with his hometown team as they compete for a Super Bowl next season.",
    "He remains one of the most hated opponents in franchise history after a controversial 2017 late hit on Bills cornerback Tre’Davious White that sent the cornerback into concussion protocol and led to the only suspension of Gronkowski’s career.",
    "Playing against his former team in the New England Patriots twice would also be a fun side story to follow.”\nBills Fans Not So Sure\nMany Bills fans would pick an adjective other than “romantic” to describe Gronkowski signing with Buffalo.",
    "Gronkowski is headed to free agency after a successful two-year stint with the Tampa Bay Buccaneers, and with friend and lifelong teammate Tom Brady now retired, many believe Gronkowski will test the open market.",
    "Those receiving yards had him third on the team behind Chris Godwin and Mike Evans, while his six receiving scores ranked second.”\nRob Gronkowski is (+550) to join the Buffalo Bills ??",
    "Before the Buccaneers hosted the Bills in a regular-season game last season, Gronkowski recalled fond memories of growing up in Buffalo and pretending to be his favorite Bills players.",
    "He had originally retired from football following the 2018 season, sitting out all of 2019 and returning the next year when Brady left the New England Patriots to join the Buccaneers.",
    "“Whenever I was in the backyard playing football with my friends, my brothers and I, you line up out wide you’re pretending you’re the receiver they had,” Gronkowski said, via WKBW.",
    "I got a son to raise.”\npic.twitter.com/5l5ZwNgx1F\n— Circling The Wagons Podcast (@CTWpod) March 3, 2022\nGronkowski seems to be open to the idea of coming back to his hometown.",
    "White spoke out against Gronkowski at the time, and many Bills fans have recalled that criticism amid rumors that the former Patriots tight end could come to Buffalo.",
    "— PFF Bet (@PFF_Bet) March 5, 2022\nSullivan put the Bills as the most likely landing spot for Gronkowski if he does decide to continue playing.",
    "Gronkowski could decide to go back to retirement, Sullivan wrote, though it’s clear that he still has a lot to contribute on the field.",
    "Tyler Sullivan of CBS Sports believes that if the future Hall of Famer decides to keep playing, he could be headed to Buffalo.",
    "The history of the Buffalo Bills goes way back for my family and I from playing in the back yard to watching the games.”",
    "The Buffalo Bills could give Rob Gronkowski a “romantic” — and unexpected — ending to his career, an insider predicts.",
    "Gronkowski’s Future Uncertain\nAs Sullivan noted, there is nothing certain about Gronkowski’s future.",
    "“In 12 games played, the soon-to-be 33-year-old caught 55 passes for 802 yards and six touchdowns.",
    "“From what we saw on the field in 2021, Gronkowski still has some fuel in the tank,” he wrote.",
    "“This is the most romantic way for Gronkowski to finish out his career,” Sullivan wrote.",
    "If you make a stop or big hit you’re acting like Takeo Spikes.",
    "Apparently folks forget Tre White’s thoughts on the hit.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "I never want Gronkowski on my team.",
    "“Moulds was my favorite player.",
    "“He coulda broke my neck."
  ]
}