{
  "id": 2853,
  "mediaId": 2584,
  "date": "2022-03-11",
  "headline": "Winter paralympics 2022: historic bronze for GB snowboarder Ollie Hill",
  "image": "https://i.guim.co.uk/img/media/2d4b9bf27594d470783c32f9eb4045e6ed98fc46/0_188_3550_2131/master/3550.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=00662d45b1509329b2e121f216705f29",
  "link": "https://www.theguardian.com/sport/2022/mar/11/winter-paralympics-2022-historic-bronze-for-gb-snowboarder-ollie-hill",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Martin Belam",
  "authorUrl": "https://www.theguardian.com/profile/martin-belam",
  "termIds": [
    3990,
    157,
    4852,
    5240,
    5370
  ],
  "sentences": [
    "It’s my third ever banked slalom.” He won a bronze medal in the same event in the World Championships in Lillehammer in 2021, and added that after that result, where he felt he had made a mistake right at the end of his run, he “kind of thought that there was a little chance in the back pocket that I could pull something out here”.",
    "The rescheduling of events to avoid warmer Beijing weather forecast for the weekend made for a busy Friday at the 2022 Winter Paralympics, with medals available in Alpine skiing, biathlon and snowboarding, and the para ice hockey and wheelchair curling competitions reaching the semi-final stages.",
    "In the women’s individual standing biathlon there was silver for China’s Zhao Zhiqing and bronze for Canada’s Brittany Hudak, but the gold went to Ukraine, with Liudmyla Liashenko leading from start to finish, and winning by 44.3sec despite picking up two shooting penalties.",
    "Sadly Carina Edlinger of Austria did not finish the race in the women’s visually impaired biathlon, and so there was to be no repeat of the scenes when her guide dog Riley stole the show while she was receiving her gold medal for the women’s sprint event on Wednesday.",
    "She would normally have been able to do that in person, as athletes would usually be accompanied to the Winter Paralympics by friends and family, but the Beijing “closed loop” system to mitigate against Covid-19 means attendance in China is severely restricted.",
    "The women’s banked slalom SB-LL2 went to Brenna Huckaby of the US, while France’s Maxime Montaggioni won the men’s banked slalom SB-UL\nIn the para Alpine skiing, the women’s visually impaired giant slalom was a family affair for Austria’s Aigner sisters.",
    "In the men’s individual standing biathlon, France’s Benjamin Daviet raced away with it, finishing more than two minutes ahead of Canada’s Mark Arendz in silver and four minutes ahead of the bronze medallist, Grygorii Vovchynskyi from Ukraine.",
    "At the National Biathlon Center in Zhangjiakou, the Ukraine-born Oksana Masters now has two golds and three silvers from these Games after finishing ahead of teammate Kendall Gretsch in the women’s individual sitting biathlon race.",
    "If two medals in one event for the Aigner family wasn’t enough, Veronika Aigner is guided by her elder sister Elisabeth Aigner – and Barbara Aigner is the twin sister of Johannes Aigner, who has taken the men’s events by storm.",
    "Sweden’s Ebba Årsjö had been in contention, only 0.07sec slower than Zhang in the first run, but she suffered a bad crash on her second run, which led to a course hold while she received medical attention.",
    "Edlinger has said Riley has become “more famous than the Chinese President” in the Paralympics Village, and that “even when you have a bad day, your dog still comes to you and wants to have a cuddle.",
    "He went into his second run laughing and clapping as he knew his first run time of 1min 10.45sec was enough to have guaranteed him at least the bronze in the men’s banked slalom SB-LL2.",
    "The 32-year-old Hill was making his Paralympics debut, having joined the ParalympicsGB programme in summer 2020 after a below-the-knee leg amputation after a car crash in December 2018.",
    "His teammate Owen Pick, who lost his right leg serving in Afghanistan in 2010, just missed out on a historic second British medal, finishing in fourth place in the same event.",
    "The gold medal match is scheduled for Sunday, and will be a re-match of the 2018 final after defending champions the US similarly defeated China 11-0 in the second semi-final.",
    "Momoka Muraoka of Japan won her third gold of these Games in the women’s giant slalom sitting, ending up with a 7.28sec advantage over China’s Liu Sitong in second place.",
    "That result came moments after Oksana Shyshkova had secured gold for Ukraine in the women’s event in a tight finish, just 3.6 seconds ahead of Germany’s Linn Kazmaier.",
    "Oleksandr Kazik added a ninth Ukrainian gold of these Games with victory in the men’s visually impaired biathlon, with his compatriot Vitaliy Lukianenko in second.",
    "The 2018 silver-medallists Canada booked their expected place in the final of the para ice hockey competition with an emphatic 11-0 victory over South Korea.",
    "Liu Mengtao had a clear shooting round as he powered to another Chinese gold, finishing nearly 45 seconds ahead of Ukraine’s Taras Rad in the men’s event.",
    "That gold for Sun Qi was accompanied by a victory for Wu Zhongwei in the men’s banked slalom SB-LL1 on another highly successful day for the hosts.",
    "His journey to China was delayed by a pre-departure positive Covid test, and ParalympicsGB have confirmed he has tested positive again on arrival.",
    "Millie Knight of ParalympicsGB finished ninth, describing Friday’s run as “really good fun”, and Britain’s Menna Fitzpatrick finished seventh.",
    "Back on the slopes,\nChina’s Zhang Mengqiu claimed a second gold of the Games with victory in the women’s giant slalom standing.",
    "In the two other snowboarding classes contested on Friday, Chinese athletes filled out the podium with silvers and bronzes.",
    "The South Koreans must be absolutely sick of the sight of the Canadians, who also beat them 6-0 in the preliminary stages.",
    "With snow conditions deteriorating, like the majority of athletes he could not improve on his time, and so finished third.",
    "Fitzpatrick had enough breath left after her second run to wish her parents a happy wedding anniversary into the camera.",
    "It will be China and Sweden who will bid for the gold medal in the wheelchair curling on Saturday afternoon in Beijing.",
    "Canada went on to secure the bronze in the final action of the day, beating Slovakia 8-3 in the 3rd place play-off.",
    "Defending champions China won their semi-final against Canada 9-5, and Sweden got the better of Slovakia 6-4.",
    "Veronika Aigner comfortably won the gold by a margin of more than seven seconds from China’s Zhu Daqing.",
    "Masters finished in 42:17.09 despite missing a shot, and in the end had a 5.8sec cushion over Gretsch.",
    "He awaits the results of further tests with just two days of Nordic skiing competition remaining.",
    "After the race Hill told Channel 4: “I didn’t think banked slalom was going to be my thing.",
    "Mollie Jepsen of Canada ended up with silver, with Germany’s Andrea Rothfuss third.",
    "Britain’s Ollie Hill picked up the first ever ParalympicsGB medal in snowboarding.",
    "Those precautions may yet prevent Steve Arnold from competing for Great Britain.",
    "In bronze medal position was Veronika’s 16-year-old sister Barbara Aigner.",
    "Between them the family now have six medals to take home from Beijing.",
    "Sun Qi of China took gold, with Finland’s Matti Suur-Hamari second.",
    "Britain’s Scott Meenagh finished an impressive sixth.",
    "He is worth more than gold”."
  ]
}