{
  "id": 2856,
  "mediaId": 2523,
  "date": "2022-03-10",
  "headline": "Players Championship 2022: Tee Times, Pairings and Predictions for Friday",
  "image": "https://media.bleacherreport.com/image/upload/v1646956541/zs0ca8xknkyh5e0ljhro.jpg",
  "link": "https://bleacherreport.com/articles/10029386-players-championship-2022-tee-times-pairings-and-predictions-for-friday",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Erin Walsh",
  "authorUrl": "https://bleacherreport.com/users/49c04630-2523-4df1-989d-4e762d355d05",
  "termIds": [
    0
  ],
  "sentences": [
    "ET: Joseph Bramlett, Stephan Jaeger, Sahith Theegala\nPlayers Championship Round 2 Tee Times and Pairings for Friday\nAs previously mentioned, Round 2 will start later than expected Friday, with the remaining Round 1 group set to kick off the day's action.",
    "The Players Championship, one of the biggest events of the golf season, kicked off Thursday at TPC Sawgrass in Ponte Vedra Beach, Florida, and things certainly didn't go according to plan thanks to heavy rain and high winds.",
    "<a href=\"https://t.co/69BYrNnzjH\">pic.twitter.com/69BYrNnzjH</a>\nConsidering many players were unable to complete the first round Thursday, they'll pick up where they left off Friday before the second round kicks off.",
    "Rahm entered the tournament as one of the favorites to win, and if he can position himself among the leaders Friday, he'll be well on his way to capturing his first victory since the 2021 U.S. Open.",
    "Chris Kirk, Lee Westwood and Matt Fitzpatrick will begin the second round on the first hole, while Brian Stuard, Harry Higgs and Brandon Hagy will get the start on the 10th hole.",
    "If Zalatoris can piece together a similar early run in Round 2 and be more consistent on the back nine, he could challenge Fleetwood for the lead Friday.",
    "Round 2 Predictions\nWill Zalatoris, Jon Rahm Make Push for Lead\nZalatoris is currently tied for 11th place after shooting three under par Thursday.",
    "He got off to a hot start before the weather delay, finishing the front nine with four birdies and one bogey to sit among the top competitors.",
    "Three players from the morning wave were unable to complete the first round, including Hank Lebioda, Henrik Norlander and Taylor Pendrith.",
    "The start of Thursday's opening round was delayed for about an hour because of overnight rain, and play was suspended again at 11 a.m.",
    "The PGA Tour has not announced a specific time for the start of Round 2 but noted it will begin between 11 a.m. and 1 p.m.",
    "According to the National Weather Service, Ponte Vedra Beach is in for more showers and thunderstorms throughout the day.",
    "Despite the delays, Tommy Fleetwood and Tom Hoge impressed on Thursday, finishing six under par to lead the first round.",
    "The 25-year-old is still searching for his first win on the PGA Tour, and what better way to do it than at TPC Sawgrass.",
    "Friday's action won't see much relief from the weather, however, which could lead to more delays and inconsistent play.",
    "His performance on the back nine wasn't nearly as good, though, as he sank just two birdies and double-bogeyed.",
    "As for Rahm, he also is tied for 11th place, finishing with five birdies and two bogeys through 18 holes.",
    "Kramer Hickok, Joaquin Niemann, Keith Mitchell and Anirban Lahiri are tied for third at five under par.",
    "at the turn for <a href=\"https://twitter.com/TommyFleetwood1?ref_src=twsrc%5Etfw\">@TommyFleetwood1</a>.",
    "He performed slightly better on the back nine, but it wasn't enough to propel him up the leaderboard.",
    "The second delay lasted more than four hours, and play didn't resume until 3:14 p.m.",
    "Players Championship Round 1 Tee Times and Pairings for Friday\nFirst Hole\n7:15 a.m.",
    "ET: Brendan Steele, Emiliano Grillo, Matthew NeSmith\n10th Hole\n7:15 a.m.",
    "None of the players from the afternoon wave completed the first round.",
    "It was smooth sailing after that until another suspension at 6:36 p.m.",
    "ET, this time due to darkness, which concluded the first day of play.",
    "ET: Charl Schwartzel, Denny McCarthy, Tyler McCumber\n7:26 a.m.",
    "ET: Troy Merritt, Scott Stallings, Doug Ghim\n7:26 a.m.",
    "ET on account of \"dangerous weather in the area.\"",
    "PGA TOUR\nChip-in ??",
    "ET.",
    "ET."
  ]
}