{
  "id": 2864,
  "mediaId": 2586,
  "date": "2022-03-11",
  "headline": "Bills Could Add Former League MVP as Josh Allen’s Backup: Report",
  "image": "https://heavy.com/wp-content/uploads/2022/02/camnewton-e1644859446163.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-cam-newton-backup/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1509,
    1630,
    2249,
    2281,
    2855,
    3383,
    3583,
    160,
    184
  ],
  "sentences": [
    "The Bills have a bare quarterback room behind Allen, with Mitch Trubisky headed to free agency at the completion of his one-year deal and practice squad signal-callers Jake Fromm and Davis Webb plucked away by the New York Giants.",
    "Breaking that down: https://t.co/tgmMU0iiAg\nWojton added that Newton and Allen share similar skill sets, and Newton was mentioned as the closest comparison for Allen’s potential when Allen was coming out of college.",
    "Bills Looking for New Backup\nAs Nick Wojton of USA Today’s Bills Wire noted, the Bills have been linked to free agent and former MVP Cam Newton, who has stated that he wants to sign with a contender.",
    "The Buffalo Bills could trade in one prominent backup quarterback for another, with an insider suggesting that the team could target a former league MVP to back up Josh Allen next season.",
    "Any quarterback taken would likely come in the later rounds, as the Bills are looking to fill holes left by outgoing free agents and build depth across the board with their top picks.",
    "In the same mindset as Trubisky, Newton, if Allen does go down, is someone the Bills could have some confidence in.”\nCould the #Bills be in the Cam Newton market during free agency?",
    "With the Bills going into the season with Super Bowl aspirations, they could prioritize finding another seasoned and high-end backup to Allen, as Trubisky had been last season.",
    "Bills general manager Brandon Beane has shown a penchant for finding players from his onetime home in Carolina, with the Bills taking on a number of former Panthers players.",
    "“At 39, he’s no Tom Brady physical fitness wise, but Fitzpatrick’s willingness to chuck it and run it when he does get on the field might actually be a nice No.",
    "2 option to Allen.”\nTyrod Taylor, another former Bills quarterback, could be an option as well and could run much of the same offense as Allen, Wojton added.",
    "— Sunday Night Football on NBC (@SNFonNBC) March 4, 2022\nThe Bills could also look to the draft to develop a longer-term and more affordable backup to Allen.",
    "Bills Could Have Other Options\nWojton noted that the Bills will have some other options if they’re looking for a steady veteran behind Allen next season.",
    "While Newton also wants to compete for a starting job, he could be willing to overlook that preference to join the Bills, Wojton wrote.",
    "Finding a new backup will be a priority this offseason, and a new report suggests that the Bills could target a very prominent name.",
    "The team kept three or four quarterbacks in each of the last two seasons, spending a fifth-round pick in 2020 to snag Fromm.",
    "That includes former Bills quarterback Ryan Fitzpatrick, who could be a good fit for the team’s high-flying offense.",
    "The Bills quarterback has reached that potential, leading one of the top passing attacks for the last two seasons.",
    "“The fan favorite in Fitzpatrick is beloved by Bills fans and always loved by teammates,” he wrote.",
    "Newton was not overly effective starting for the Panthers last season,” Wojton noted.",
    "“While he might hope for a starting job, that might be a longshot.",
    "“Still, Carolina’s roster does not match Buffalo’s.",
    "Cam Newton will become a free agent this offseason.",
    "Newton could have another advantage in Buffalo.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "BUF was named a suitor."
  ]
}