{
  "id": 2867,
  "mediaId": 2551,
  "date": "2022-03-09",
  "headline": "So, can an Englishman finally tame Sawgrass and claim the £2.75m prize? Eight stars bid to end 40 years of 'fifth major' hurt... with the cold and heavy rain in Florida set to play a key role",
  "image": "https://i.dailymail.co.uk/1s/2022/03/09/21/55160859-0-image-a-83_1646862525131.jpg",
  "link": "https://www.dailymail.co.uk/sport/golf/article-10595977/So-Englishman-finally-tame-Sawgrass-Eight-stars-bid-end-40-years-fifth-major-hurt.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Derek Lawrenson for the Daily Mail",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Derek+Lawrenson+for+the+Daily+Mail",
  "termIds": [
    0
  ],
  "sentences": [
    "Sandy Lyle, from Scotland, in 1987, and Rory McIlroy, from Northern Ireland, in 2019, are the only representatives from the United Kingdom to have successfully negotiated the scary back nine in fewer strokes than their competitors.",
    "+4\nView gallery\nIan Poulter, Westwood, Justin Rose and Paul Casey have played it 71 times between them\nBut since the PGA Tour opened their doors to the world’s best, no English winners becomes harder to explain.",
    "+4\nView gallery\nEngland's Lee Westwood finished runner-up to Justin Thomas at the Players last year\n+4\nView gallery\nSure, there have been close shaves — isn’t it always the case with the leading Englishmen?",
    "‘Let’s concentrate one event at a time and see if I can have another good week here.’\nThe other four Englishmen playing are Matt Fitzpatrick, Tommy Fleetwood, Tyrrell Hatton and Matt Wallace.",
    "There are eight representatives this time around and between them, four — Poulter, Westwood, Justin Rose and Paul Casey — have played the event an aggregate of 71 times.",
    "It was the fifth second-place finish by an Englishman, stretching all the way back to 1992 and Sir Nick Faldo, in the year he won the last of his three Open titles.",
    "+4\nView gallery\nThis would certainly be a heck of a year for an Englishman to break through, with the first prize bumped up to the fantasy figure of £2.75million.",
    "There is an easy explanation for the lack of success in the 1980s and 1990s, as hardly any were allowed to play in an event that basically operated a closed shop.",
    "For 40 years they have been crowning champions at Sawgrass in the best event outside the four big ones, but we are still awaiting the first English winner.",
    "Only last year, Lee Westwood followed his runner-up finish at the Arnold Palmer Invitational the previous week with another here at the stadium course.",
    "It does not look as if this year’s edition is going to be a lucky one, either, with a weather forecast so bad it is hard to believe we are in Florida.",
    "Two days of prolonged thunderstorms are predicted followed by wind and heavy rain on Saturday and a final round played in a chilly 12ºC (54°F).",
    "Thursday’s first round marks the two-year anniversary since the game closed down owing to the pandemic that had begun to rage worldwide.",
    "Poulter is back again, trying desperately not to fret about the fact he is still not in the field for the Masters next month.",
    "Never mind the hard luck stories compiled by English golfers at the majors, how about the purgatory at the Players?",
    "It is an unusual fact that there has not been a single weather delay to date on the PGA Tour this year.",
    "‘If I think about it, there’s no way in the world it’s going to help, is it?’ he said.",
    "Even another second-place finish would bring a handsome consolation payout of £1.6m.",
    "Luke Donald notched one in 2005 followed by Ian Poulter in both 2009 and 2017.",
    "Anyone finishing in the top 30 this week will earn a six-figure cheque.",
    "It looks like we are about to get them all at once.",
    "A win is certainly long overdue."
  ]
}