{
  "id": 2886,
  "mediaId": 2713,
  "date": "2022-03-11",
  "headline": "Concrete office gets the design glitz it missed out on in the ’80s",
  "image": "https://static.ffx.io/images/$zoom_0.1659%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_97/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/861753ec4c851358e44dff8a7956bee030df3128",
  "link": "https://www.smh.com.au/property/living/concrete-office-gets-the-design-glitz-it-missed-out-on-in-the-80s-20220308-p5a2uh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Crafti",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Given the substantial fall across the site, the architects had to rework underutilised spaces at ground level.Credit:Tyrone Branigan\nOriginally occupied by the Department of Health, the brief given by the clients ESR Australia to Fitzpatrick + Partners was to reconfigure the 13-level building on its prominent corner site bordered by Miller and Blue streets and surrounding laneways.",
    "“Most of the outdoor terraces weren’t used,” says Reidy, who found the additional space by literally wrapping the perimeter of the building with floor-to-ceiling glass windows, with bands of aluminium marking out each floor to reduce the scale of the office building, now with separate tenancies (a typical floor plate for each tenant is 1750 square metres).",
    "The architects retained a strong focus on some of the original 1980s detailing.Credit:Tyrone Branigan\nHowever, while this new veil was created, Reidy and his colleagues not only expressed the services that straddle parts of the ceiling, but also magnified the texture of the original concrete walls by bush hammering.",
    "“There were areas, such as the covered walkway to the station, that felt fairly unsafe and simply unpleasant to be in or walk through,” says Reidy, whose brief was also to increase the building’s floor area – which Fitzpatrick + Partners did to the tune of 4000 square metres.",
    "“Our brief also included opening up the foyer and lower levels to the adjoining streets and laneways, creating a more civic presence than the former arrangement that really didn’t embrace its surrounds,” says architect Paul Reidy, a partner with Fitzpatrick + Partners.",
    "Share\nNormal text sizeLarger text sizeVery large text size\nThe 1980s in Australia produced some strong architecture, with buildings in the early part of the decade touching on postmodernist and Memphis design and those built later often showing a glitzy edge.",
    "Fitzpatrick + Partners clad the upper recessed levels with glass, but in the case of level 11, the outdoor roof terrace was retained and is now a verdant rooftop garden (Fitzpatrick + Partners worked with Junglefy in greening up the indoor and outdoor areas).",
    "The refurbishment of 73 Miller Street has not only created a new kid on the block, but also an entirely new pedestrian-friendly precinct that benefits both locals regularly going to the heritage pub nearby, as well as the staff working there.",
    "“We wanted to retain, and in some cases even create, a stronger focus on some of the original 1980s detailing,” says Reidy, who clad the base of the building with concrete tiles to further enrich this detail and also conceal the car parking.",
    "Given there’s a substantial fall across the site, the brief given to the architects was also to rework the underutilised spaces, both at ground level and also those areas that previously had a subterranean feel.",
    "The architects made some modifications, creating a new canteen-style window to the laneway that allows those passing through to the station and beyond to grab a coffee on their way.",
    "Other areas within the lower-level space were also reworked, including new meeting areas, a cafe, and simply space to pause before proceeding within or through the building.",
    "However, a tiered 1980s concrete construction at 73 Miller Street in North Sydney missed the decade’s architectural flourishes, apart from its triangular-shaped terraces.",
    "Featuring mirrored doors on two levels (including the mezzanine level), these have been finely etched with maps of North Sydney, including the Sydney Harbour Bridge.",
    "The best property news and advice delivered straight to your inbox\nSign up\nBy signing up, you agree to Domain's Privacy Policy and Conditions of Use.Sign up",
    "And bridging the outside to the ground floor flyer is a new, faceted plywood ceiling (up to 900 millimetres in depth) that functions as a welcome mat.",
    "“It just didn’t make sense to demolish a robust and well-built office building, with all the embodied energy that would have required,” adds Reidy.",
    "There was previously a pedestrian path leading through the site to the nearby Metro station, but it was a fairly dark and cavernous connection.",
    "Unlike the former design, where the foyer was buried, Fitzpatrick + Partners created a sense of arrival with its tiered canopies.",
    "“It’s only when you get up close that you see how this map unfolds,” says Reidy, pointing out the abstracted etching.",
    "By Stephen Crafti\n March 12, 2022 — 12.00am\n Save\nLog in, register or subscribe to save articles for later.",
    "The reflective lift doors also give a subtle nod to the 1980s (think Studio 54 in New York).",
    "One of the subtle contemporary touches can be seen with the new lift core."
  ]
}