{
  "id": 2896,
  "mediaId": 2523,
  "date": "2022-03-09",
  "headline": "Commanders' Updated Depth Chart After Reported Carson Wentz Trade",
  "image": "https://media.bleacherreport.com/image/upload/x_66,y_78,w_5017,h_3351,c_crop/v1646852237/elghtuottler7lnjcncl.jpg",
  "link": "https://bleacherreport.com/articles/10029226-commanders-updated-depth-chart-after-reported-carson-wentz-trade",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Zucker",
  "authorUrl": "https://bleacherreport.com/users/edba0a54-eb92-42d2-af0e-0cff486dadd2",
  "termIds": [
    0
  ],
  "sentences": [
    "McKissic*, Jaret Patterson\nWR: Terry McLaurin, Dyami Brown, Antonio Gandy-Golden\nWR: Cam Mills*, DeAndre Carter*, Kelvin Harmon\nWR: Adam Humphries*, Curtis Samuel, Dax Milne\nTE: Logan Thomas, Ricky Seals-Jones*, John Bates\nLT: Charles Leno Jr., Saahdiq Charles\nLG: Ereck Flowers, Wes Schweitzer\nC: Chase Roullier, Tyler Larsen*\nRG: Brandon Scherff*, Saahdiq Charles\nRT Samuel Cosmi, Cornelius Lucas*\n* indicates player who is out of contract\nThis trade is a summation of Washington's inability to find a long-term solution at quarterback.",
    "With Deshaun Watson's status up in the air because of 22 allegations of sexual assault or sexual misconduct and 10 criminal complaints against him, Washington didn't have many options on the trade front.",
    "You can talk yourself into Wentz on the basis of his 2017 season, when he played at an MVP level by throwing for 3,296 yards and 33 touchdowns with seven interceptions in 13 starts.",
    "Since Joe Theismann's career ended in 1985, only two quarterbacks have led the team in passing for at least four straight seasons: Mark Rypien and Kirk Cousins.",
    "In the case of Cousins, the Commanders were reticent to make a long-term commitment, which paved the way for him to sign with the Minnesota Vikings in 2018.",
    "Wentz is an upgrade over Taylor Heinicke, who finished with 3,419 yards, 20 touchdowns, 15 interceptions and a 39.9 QBR in 2021, per Pro Football Reference.",
    "Now, Washington is betting on a quarterback who has been cast aside by two different teams, with the Colts having decided to move on after only one year.",
    "But his arrival may not make Washington meaningfully better, so the franchise could once again be looking for a new quarterback in a year or two.",
    "Instead, Rodgers confirmed he intends to stay with the Green Bay Packers, while Wilson is reportedly off to the Denver Broncos.",
    "ESPN's Adam Schefter reported Wednesday the Commanders will acquire Wentz from the Indianapolis Colts for multiple draft picks.",
    "The Commanders have the 11th pick in the 2022 draft, which could put them in position to select one of the top quarterbacks.",
    "Washington Commanders Projected Offense\nQB: Carson Wentz, Taylor Heinicke, Ryan Fitzpatrick*\nRB: Antonio Gibson, J.D.",
    "Wentz and the Commanders is almost a perfect marriage of a player and team who continually fail to meet expectations.",
    "Trading for a veteran was an optimal solution when Russell Wilson and Aaron Rodgers were potentially available.",
    "The Washington Commanders are set to become the third NFL franchise to hitch its wagon to Carson Wentz.",
    "Cincinnati's Desmond Ridder was their choice in Bleacher Report's most recent mock draft.",
    "But the Colts and Philadelphia Eagles have made that choice and regretted it later.",
    "With the move, Washington will shore up its biggest question mark on offense.",
    "But opinions on the incoming class of passers aren't very high."
  ]
}