{
  "id": 2914,
  "mediaId": 2728,
  "date": "2022-03-14",
  "headline": "Vulnerable residents insist on access to rapid tests",
  "image": "https://www.thestar.com/assets/img/thestar-ribbon.png",
  "link": "https://www.thestar.com/news/canada/2022/03/14/vulnerable-residents-insist-on-access-to-rapid-tests.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Jackson",
  "authorUrl": "",
  "termIds": [
    5191,
    5209,
    5260
  ],
  "sentences": [
    "“And when they announced the March 14 (dropping of restrictions), I thought, oh my God, and they’re not giving us any tools to be able to go out into society.”\nThe tools she really wants are easily accessible rapid antigen tests (RATs), which have become an essential tool in other circumstances, including schoolchildren who are experiencing symptoms and cases of exposure in long-term and personal care homes.",
    "“What we know with antigen tests, and particularly antigen tests and Omicron, is that they’re not quite as good at picking up infection, that it takes a little bit longer because Omicron can spread at a lower viral load,” Fitzgerald said.",
    "“I said to the premier, the measure of any decent society is how it treats its most vulnerable population,” she said, referring to a letter she wrote to Andrew Furey several weeks ago.",
    "On Wednesday, Chief Medical Officer of Health Dr. Janice Fitzgerald said she’s afraid people will get a false sense of security from a negative test, which is often a false negative.",
    "Yetman says the province already has the highest average number of seniors in the country, as well as the highest rate of chronic diseases like diabetes, heart and Crohn’s disease.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "But the pharmacy in Pouch Cove doesn’t carry them, and Newfoundland and Labrador officials have consistently resisted cries to make them more widely available.",
    "Lori Yetman feels she’s being thrown to the wolves when it comes to Newfoundland and Labrador lifting all pandemic restrictions today, and she’s not alone.",
    "“By taking the masks away, they’re taking away everything, so the rapid test kits are going to be an important part of how we navigate now,” she said.",
    "If they have RATs on hand, they can test when they have cold-like symptoms and seek antiviral treatment in plenty of time if the result is positive.",
    "“It really is a matter of urgency.”\nSHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "She’s had someone bring her a couple from Nova Scotia, and more recently got some extras from a parent who has children in school.",
    "Both have Crohn’s disease, and both have been especially vocal about the risks they face without mandates or restrictions.",
    "Fitzpatrick said he feels too many people will simply think the pandemic is over once the health orders disappear.",
    "The Pouch Cove resident says she needs more tools to protect her and her mother, who’s in her 70s.",
    "Yetman has Crohn’s disease, and medication she takes leaves her immune-compromised.",
    "“I was hearing from friends all across Canada that they could get them anywhere.",
    "They were giving them out like candy, for free,” Yetman told The Telegram.",
    "That’s what people like Yetman and Labrador City’s Keith Fitzpatrick want.",
    "However, she did say they are more accurate in symptomatic people.",
    "It’s not over,” he told The Telegram earlier this week.",
    "The Star does not endorse these opinions.",
    "“They think COVID’s over."
  ]
}