{
  "id": 2936,
  "mediaId": 2586,
  "date": "2022-03-11",
  "headline": "Steelers Rumors: Tampa Bay Bucs Safety is Plan B if Terrell Edmunds Exits",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-1365001686.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/buccaneers-safety-jordan-whitehead-terrell-edmunds/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Zasky",
  "authorUrl": "https://heavy.com/author/jasongzasky6/",
  "termIds": [
    1919,
    4329,
    4520,
    4560,
    4651,
    817,
    823,
    1004,
    5249
  ],
  "sentences": [
    "In fact, PFF once labeled him as the ideal safety for a hypothetical ‘All-Average Team.’ And on several different occasions, Steelers head coach Mike Tomlin has said that Edmunds’ “best ability is his availability.”\nThat’s because Edmunds has played in all but one game since joining the NFL and already has 60 starts to his credit, this according to Pro Football Reference.",
    "“The Steelers are still preparing—if they haven’t already—(to make) an offer to Edmunds and he is either sitting on it, or they are going to make him an offer in the next couple of days.”\nFillipponi went on to describe said offer as being ‘team friendly,’ “and Edmunds would have to accept (it).",
    "He has since appeared in 59 NFL games (55 starts), during which time he has recorded 292 tackles (222 solo), along with five interceptions, 25 passes defensed, two sacks, two forced fumbles and a pair of fumble recoveries, as per Pro Football Reference.",
    "— Andrew Fillipponi (@ThePoniExpress) March 10, 2022\nBucs’ Jordan Whitehead the ‘Perfect’ Fit for the Steelers\nAndrew Fillipponi isn’t the only member of the sports media who has mentioned Jordan Whitehead in conjunction with the Steelers.",
    "The Pittsburgh Steelers are expected to attempt to re-sign strong safety Terrell Edmunds, this despite the fact that they declined to pick up his fifth-year option in May 2021, allowing him to reach unrestricted free agency this year.",
    "During that time, he has been responsible for 340 tackles (235 solo), along with five interceptions, 21 passes defensed, three sacks and one fumble recovery, numbers that are quite comparable to those of Whitehead.",
    "He is best-suited as a strong safety in a defense that plays a lot of single-high coverage,” he concludes, which in fact describes the Steelers, as All-Pro Minkah Fitzpatrick frequently plays the single-high role.",
    "It’s also been rumored that the Steelers are interested in Buccaneers center Ryan Jensen, who could provide the skill and leadership the team is looking for as it continues to rebuild its offensive line.",
    "Mike Tomlin: Terrell Edmunds’ ‘Best Ability is His Availability’\nThis isn’t to say that Terrell Edmunds would be a bad option going forward, it’s just that he hasn’t lived up to his draft pedigree.",
    "But if they are unable to retain the former first round pick (2018), the team may make a bid for a former fourth-round pick of the Tampa Bay Buccaneers who was part of Edmunds’ draft class.",
    "Candidate Gets Major Endorsement from ESPN Commentators\n• Steelers’ Terrell Edmunds Teases Release of My Element EP\n• Steelers’ Terrell Edmunds Releases Music Video for ‘We Ride’",
    "“My understanding on the safety situation is this,” began Andrew Fillipponi—co-host of The PM Team w/Poni & Mueller on 93.7 FM (Pittsburgh)—during his show on March 10, 2022.",
    "Jordan Whitehead of the Tampa Bay Buccaneers celebrates a defensive stop against the Philadelphia Eagles in the NFC Wild Card Playoff game on January 16, 2022.",
    "ALSO READ:\n• Tampa Bay Bandits Draft 2 Ex-Steelers in USFL Supplemental\n• 49ers, Packers Have ‘Sights Set’ on Steelers Free Agent WR: Report\n• Steelers G.M.",
    "“Few safeties have been better at getting downhill and making plays against the run than Whitehead the past two years in Tampa Bay,” writes Linsey.",
    "It doesn’t hurt that Whitehead, 24, is a Pittsburgh area native who played his college ball at Pitt before the Buccaneers selected him No.",
    "“He ranks in the 95th percentile of all safeties in (PFF) run-defense grade and 97th percentile in run-stop percentage since 2020.",
    "If he goes to market next week, look for the Steelers to make a play for former Pitt safety Jordan Whitehead.",
    "In a recent piece for ESPN+, Ben Linsey of Pro Football Focus labeled him a “perfect” match for Pittsburgh.",
    "Incidentally, Jordan Whitehead isn’t the only Tampa Bay free agent who has been linked with the Steelers.",
    "Fillipponi has also reported that the Steelers are “targeting” Buccaneers cornerback Carlton Davis.",
    "Follow the Heavy on Steelers Facebook page for the latest breaking news, rumors and content!",
    "1 free agent safety that they’ll target is Jordan Whitehead,” he said.",
    "Source: Steelers will make an effort to re-sign Terrell Edmunds.",
    "The latest Steelers news straight to your inbox!",
    "If he doesn’t, then I think on Monday their No.",
    "Join the Heavy on Steelers newsletter here!",
    "There is not much negotiating going on.",
    "If he takes it, they are set at safety.",
    "117 overall in 2018."
  ]
}