{
  "id": 2940,
  "mediaId": 2586,
  "date": "2022-03-15",
  "headline": "Bills Lose Fan-Favorite Defensive Lineman, Land Potential Replacement",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Harrison-Phillips-1-e1647316345576.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-lose-phillips-free-agency/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1386,
    2268,
    2302,
    2428,
    160,
    636,
    671,
    721
  ],
  "sentences": [
    "Phillips Finds New Home\nPhillips, taken by the Bills in the third round of the 2018 NFL Draft, appeared in all 16 games this season and took on a larger role later in the year, when fellow defensive tackle Star Lotulelei missed time with a COVID-19 infection and subsequent recovery.",
    "Bills general manager Brandon Beane said in an appearance on One Bills Live during this month’s NFL combine that the team would love to have Phillips back, but said he earned the right to test the waters of free agency.",
    "“He was stuck behind a logjam of talent on the Commanders’ defensive line, which includes four first-round picks in defensive ends Chase Young and Montez Sweat and defensive tackles Daron Payne and Jonathan Allen.",
    "Both Settle and fellow reserve defensive tackle Matt Ioannidis have been viewed as quality backups.”\nThe Lotulelei contract is without question one of the worst of the McDermott-Beane Era.",
    "ET, the NFL Network’s Mike Garafolo reported that the Minnesota Vikings had signed free agent defensive tackle Harrison Phillips, who took on a significant role for the Bills last season.",
    "https://t.co/tnhbrTQj4P\nKatherine Fitzgerald of the Buffalo News noted that Beane did hope to keep Phillips for next season, but the market for the 26-year-old proved to be too strong.",
    "Phillips had been a fan favorite in Buffalo, participating in a number of charitable endeavors and being chosen as the team’s nominee for the Walter Payton Man of the Year Award.",
    "Dead cap $5 million https://t.co/pzETH4pBSl\n— Sal Maiorana (@salmaiorana) December 26, 2021\nThere could still be more changes for the Bills defensive line on the way.",
    "pic.twitter.com/UJaJeJkMVU\nThough Settle has only started two games in his career, Fitzgerald noted that he could see more of an opportunity now with the Bills.",
    "The Bills signed former Carolina Panthers lineman DaQuan Jones, who Fitzgerald said can fill the same 1-technique, run-stopping role that Phillips played.",
    "Between what I always felt was average play his first 2 years, to opting out last year, and this season being unavailable so often, pretty much a waste.",
    "The Buffalo Bills lost a fan-favorite player and one of the biggest surprises of their defense in 2021, but may already have a replacement on the way.",
    "The Bills did keep some other players who were headed to free agency, re-signing wide receiver Isaiah McKenzie and offensive lineman Mitch Morse.",
    "The #Bills have signed DT Tim Settle to a 2 year deal, per @AdamSchefter\nLast season, Settle recorded a career high 70.1 PFF grade??",
    "When (Justin) Zimmer went out with the ACL I thought Harrison really was ready to roll and did a nice job the second half the year.",
    "Phillips reportedly signed a three-year, $19.5 million deal, and the Bills moved quickly to add more depth to their defensive line.",
    "As Fitzgerald noted, the team agreed to terms with a pair of linemen who look to be part of the team’s rotation next season.",
    "Bills Address Defensive Line Depth\nThe hole in the defensive line left by Phillips’ departure didn’t last long.",
    "“A 6-foot-3, 308-pounder, Settle played just 20% of defensive snaps last season for Washington,” she reported.",
    "The team also agreed to terms with defensive tackle Tim Settle, formerly of the Washington Commanders.",
    "“He’s earned that right and so we’ll stay in touch with them, and would we love to have him back?",
    "Lotulelei has been identified as a potential cut as the team looks to create more cap space.",
    "He and Ed (Oliver) settled in nicely.”\nVikings land DT Harrison Phillips from the Bills.",
    "Hours after the NFL’s legal tampering period began on Monday at 12 p.m.",
    "The latest Bills news straight to your inbox!",
    "We’re proud of the development he’s made.",
    "Join the Heavy on Bills newsletter here!",
    "Yes, of course,” Beane said.",
    "I'd move on in '22.",
    "“We love Harry."
  ]
}