{
  "id": 2961,
  "mediaId": 2586,
  "date": "2022-03-07",
  "headline": "Bills Urged to Sign Commanders QB: ‘Makes Almost Too Much Sense’",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-1335779271-e1646675948417.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/ryan-fitzpatrick-backup-qb-2022/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Bicks",
  "authorUrl": "https://heavy.com/author/emilybicks/",
  "termIds": [
    1509,
    2249,
    3583,
    3830,
    4172,
    4281,
    160,
    217,
    671,
    1218
  ],
  "sentences": [
    "The Bills don’t have a ton of cap space, but they also know how important it is to have a backup quarterback who can win games if the hit-taking Allen suffers an injury.”\nAs for what’s in it for for the former seventh-round pick from the 2005 NFL Draft, “To make an extra $3 million, possibly without needing to play, and to go to a Super Bowl contender in a place that he loves, that’s a hard offer for Fitzpatrick to pass up.”\nFor Allen, Fitzpatrick Is the Best ‘Chemistry-Building QB Available in Free Agency’\nRyan Fitzpatrick #14 of the Washington Football Team takes the field during training camp at the Bon Secours Washington Football Team training center park on July 29, 2021 in Richmond, Virginia.",
    "Not Everyone Is on Board With a Buffalo Homecoming for Fitzpatrick\n@NateGearySports this is the best Ryan Fitzpatrick pic with my friends son… #Ryanfitzpatrick #BuffaloBills #billsmafia pic.twitter.com/ZgsgiFXaQp\n— Therese “Tee” Forton-Barnes and Green Living Gurus (@teeforton) January 16, 2022\nTo have Fitzpatrick back in the mix in the twilight of his career during a season for which the Bills are highly expected to make it to the Super Bowl sounds great, but not everyone thinks it’s a fairy tale situation.",
    "Following the exit of Bills’ former offensive coordinator Brian Daboll, who was famously close with Allen, adding a veteran like Fitzpatrick to the quarterbacks room, who was the starter in Buffalo from 2009 to 2012, would “be a resource” for the $258 million franchise star, Buscaglia noted:\nThey also know how much they’ve lost around Allen, and the chemistry within the quarterbacks room is paramount to them.",
    "While all of Bills Mafia loved seeing Fitzpatrick shirtless at Highmark Stadium during Buffalo’s dominant 47-17 playoff win over the New England Patriots, some NFL analysts believe Fitz will want to land somewhere where he will continue to be a starting quarterback, and if he can’t, could turn toward retirement.",
    "He’s mentioned he doesn’t need to do it anymore and only wants to sign somewhere if he can play.”\nFitzpatrick, who’s played with nine different franchises during his 17 years in the NFL, could also get picked up by a team with a young quarterback who needs veteran advice.",
    "Therefore, the Bills will be in a market to find a new backup for starting quarterback Josh Allen, and according to The Athletic’s Joe Buscaglia, the one clear, easy answer to fill that vacancy is to bring back one of the franchise’s former starters, Ryan Fitzpatrick.",
    "It's Taylor Heinicke going forward… pic.twitter.com/JjG4lwgPE8\n— Ian Rapoport (@RapSheet) September 13, 2021\n“We’re now in a situation where we’re going to look, and we’re going to look to move forward,” Rivera said.",
    "Fitzpatrick, after signing a one-year, $10 million contract with the Washington Commanders, suffered a season-ending injury in the second quarter of the team’s season opener, and never returned to play.",
    "It’s no longer a question as to if the Buffalo Bills can retain backup quarterback Mitchell Trubisky for the 2022 NFL season, but what team will he ultimately land with and how much money he will make.",
    "As for possible retirement, “Fitzpatrick hasn’t given any indication that he’s planning to or even wants to, but the facts are what they are: he’s 39 and has seven kids,” Roscher continued.",
    "“We are still evaluating all of our options.” In other words, it’s highly like Fitzpatrick will be available in free agency, and the Bills should be able to snag him for cheap.",
    "Ryan Fitzpatrick #14 of the Washington Football Team rolls out of the pocket during the NFL preseason game against the Cincinnati Bengals at FedExField on August 20, 2021.",
    "Fitzpatrick also provides the benefit of having a great football mind and plenty of experience, which can be a resource for Allen and new offensive coordinator Ken Dorsey.",
    "There’s almost always a team that needs a QB like him: an experienced veteran who can help the young guys while giving a solid (and sometimes inconsistent) performance.",
    "That’s not a knock on Fitzpatrick — teams genuinely need quarterbacks like him, or else he wouldn’t have been able to last nearly 20 years in the NFL.",
    "On March 6, the Commanders head coach Ron Rivera “essentially confirmed” to WGR 550‘s Sal Capaccio that the 39-year-old veteran returns to Washington.",
    "SB Nation’s Bruce Nolan tweeted on March 4, “I don’t think Ryan Fitzpatrick is coming to Buffalo with his shirt on in 2022.",
    "From NFL Now: WFT QB Ryan Fitzpatrick suffered a hip subluxation, putting him on IR and knocking him out indefinitely.",
    "But hopefully, after such a disappointing season, Fitzmagic will return to give his NFL career a proper finale.”",
    "There is also a connection between Fitzpatrick and the city from his time as the starter from 2009 to 2012.",
    "“After spending almost the entire season off the field, he could decide that’s where he wants to stay.",
    "He always speaks glowingly about the area and likely has always kept an open mind regarding a return.",
    "“The pairing of this Bills team and Fitzpatrick makes almost too much sense,” Buscaglia wrote.",
    "There isn’t a better chemistry-building quarterback available in free agency than Fitzpatrick.",
    "Knowing the two personalities, Allen and Fitzpatrick would get along very well.",
    "}pic.twitter.com/UUtA8nuTF1\n— Ari Meirov (@MySportsUpdate) May 26, 2021\nYahoo!",
    "I’ll take the L if he comes as a backup, but I would very highly doubt it.",
    "Liz Roscher wrote in December, “So where does Fitzpatrick go next?",
    "{Fun fact: Fitzpatrick led the #Dolphins in rushing yards in 2019.",
    "Ryan Fitzpatrick is having the time of his life at OTAs.",
    "ALL the latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "At this point, it’s hard to tell.",
    "Sports!"
  ]
}