{
  "id": 2963,
  "mediaId": 2523,
  "date": "2022-03-18",
  "headline": "Texans' Top QB Options in Draft, Free Agency After Deshaun Watson Trade",
  "image": "https://media.bleacherreport.com/image/upload/v1647610076/awokvcnjd6bjimxat7ce.jpg",
  "link": "https://bleacherreport.com/articles/10030173-texans-top-qb-options-in-draft-free-agency-after-deshaun-watson-trade",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Wells",
  "authorUrl": "https://bleacherreport.com/users/552fd1ff-4f15-4bf0-9b0c-8bdc7f6d25c3",
  "termIds": [
    2436,
    2479,
    2889,
    3117,
    3676,
    4496,
    4730,
    225,
    473
  ],
  "sentences": [
    "Carson Wentz (acquired by the Washington Commanders) and Mitchell Trubisky (signed by the Pittsburgh Steelers) certainly aren't among the better QBs in the NFL, but there is a baseline level of play they can reach in order to keep their new teams competitive without bottoming out.",
    "Per Pro Football Focus' Michael Renner, Mills did have mechanical issues that also contributed to his 10 interceptions and five fumbles in 2021:\n\"Mills displayed the footwork, fakes and processing speed quarterbacks need to play in the league when he was at Stanford.",
    "Their best course of action could end up being just playing things out with Mills as their starter and sign a veteran backup for the 2022 season, then hope that the 2023 quarterback draft class—currently led by Alabama's Bryce Young and Ohio State's C.J.",
    "There's no indication that Mariota has significantly improved as a passer from his days with the Tennessee Titans, but his ability as a ball-carrier would give Houston a higher baseline of play at quarterback than it has had over the past two seasons.",
    "San Francisco 49ers general manager John Lynch said during the NFL Scouting Combine that one of the factors they considered when making the move up in last year's draft to select Trey Lance was because of how the 2022 quarterback class looked.",
    "If the Texans decide not to go with one of the quarterbacks in this year's draft, the free-agent market still has several players who could at least give them one season of competent play as they look ahead to the 2023 draft class.",
    "B/R's Nate Tice wrote this in his scouting report for Ridder:\n\"Ridder is able to operate on time and has the arm strength to drive throws and balls to the field, which allows him to attack all areas of the defense.",
    "Even though it had been made clear Watson wasn't returning to the Texans anyway, having his contract off their books and getting a significant return for him allows them to start planning for their future.",
    "It's probably not a coincidence that teams that ended last season needing a quarterback elected to trade for or sign a free-agent QB rather than take their chances in the draft.",
    "New Texans head coach Lovie Smith told Sports Illustrated's Albert Breer in February that he liked what he saw from Mills but stopped short of naming him the starter in 2022.",
    "Per ESPN's Adam Schefter, the Texans will likely receive three first-round picks, a third-round pick and possibly a fifth-rounder in exchange for Watson.",
    "The Houston Texans have officially turned the page on the Deshaun Watson era on Friday after trading the veteran quarterback to the Cleveland Browns.",
    "Other available options with previous starting experience include Andy Dalton, Cam Newton, Blaine Gabbert, Jacoby Brissett and Mike Glennon.",
    "Prior to the injury, the Florida State alum was playing well with 1,170 yards, 14 touchdowns and three interceptions in seven starts.",
    "It was the bouts of ugly decision-making, inconsistency and limited physical ability that dropped him down the PFF draft board.",
    "Jameis Winston and Marcus Mariota, the top two picks in the 2015 NFL draft, are both intriguing options because of their age.",
    "If Mills ends up being a stopgap starter for the Texans, their options in this year's draft aren't particularly attractive.",
    "The Stanford alum threw for 2,664 yards, 16 touchdowns and completed 66.8 percent of his attempts in 13 games (11 starts).",
    "The Las Vegas coaching staff did a good job taking advantage of Mariota's running ability when he did get on the field.",
    "He’ll hesitate to pull the trigger at times and take a sack rather than getting the ball out quickly to his outlet.\"",
    "\"So, if I’m going to change my opinion of him as a player, it would be because those attributes materially changed.",
    "ESPN's Todd McShay didn't have Ridder among his top 32 prospects on his most recent big board from early February.",
    "\"At times, Willis’s timing and accuracy become spotty and his touch on passes can run hot or cold,\" Kelly wrote.",
    "Winston is coming off a torn ACL and damaged MCL he suffered in Week 8 last season with the New Orleans Saints.",
    "The Liberty star is a bit quick to bail on a clean pocket and can be overly reliant on his athleticism.",
    "His 4.3% turnover-worthy play rate was the highest in the rookie class, as his grade fluctuated weekly.",
    "His main blemish is some inaccurate throws at the beginning of games when he seems to be too amped up.",
    "I’d need to see that change before talking myself into him as the Texans' quarterback of the future.\"",
    "He’s not a perfect prospect and might take some knocks early as he steps up a level in competition.\"",
    "Davis Mills' performance as a rookie last season certainly makes him a viable option for the team.",
    "The Ringer's Danny Kelly labeled Willis as \"Jalen Hurts with turbo boosters\" on his big board.",
    "There is virtually no consensus over which order the incoming quarterbacks should be drafted.",
    "Desmond Ridder is the only quarterback in the 2022 draft class with a first-round grade (No.",
    "The 39-year-old was limited to one game with the Commanders in 2021 because of a hip injury.",
    "The biggest question after this trade is: Who will start at quarterback for Houston in 2022?",
    "\"He’ll put a ball inside when he needs to lead his receiver to the outside, or vice versa.",
    "He started 12 games for the Texans in 2014, throwing for 2,483 yards and 17 touchdowns.",
    "He had 22 rushes over the past two seasons combined, with 14 resulting in first downs.",
    "But he settles in as the game goes along and is a player who steps up in big moments.",
    "Ridder shows enough advanced play that he can start for an NFL team as a rookie.",
    "He spent the past two years backing up Derek Carr with the Las Vegas Raiders.",
    "\"We don’t give out starting positions in the spring—to anybody,\" Smith said.",
    "Willis appears to be the most tantalizing quarterback because of his upside.",
    "There certainly aren't any great solutions for the Texans to choose from.",
    "Stroud—plays out so they can add one of them in the first round.",
    "They are both 28 and have had moderate success in their careers.",
    "Ryan Fitzpatrick has a history with the organization.",
    "Mariota hasn't started a game since the 2019 season.",
    "And that was not the case for Mills as a rookie.",
    "16 overall), per B/R's NFL scouting department.",
    "27) as first-round talents in this class.",
    "He did have Malik Willis (No.",
    "19) and Matt Corral (No.",
    "17), Kenny Pickett (No.",
    "B/R Recommends"
  ]
}