{
  "id": 3026,
  "mediaId": 2586,
  "date": "2022-03-10",
  "headline": "Bills Could Possibly Sign QB Colin Kaepernick as Josh Allen’s Backup",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Josh-Allen-Colin-Kaepernick.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/colin-kaepernick-qb-backup-2022/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Bicks",
  "authorUrl": "https://heavy.com/author/emilybicks/",
  "termIds": [
    1459,
    1509,
    2249,
    2579,
    3117,
    3583,
    4387,
    160,
    671,
    924
  ],
  "sentences": [
    "So it shows the different cultures and different beliefs throughout this country and it also makes it very evident that there’s a difference in perspective between White America and Black America.”\nKaepernick’s Personal Stats in 2016 Don’t Paint the Whole Picture\nColin Kaepernick #7 of the San Francisco 49ers runs with the ball during the game against the Los Angeles Rams at Los Angeles Memorial Coliseum on December 24, 2016.",
    "— Circling The Wagons Podcast (@CTWpod) March 10, 2022\nThe opportunity to closely study Allen, who’s currently ranked as the No.3 best quarterback in the league, per NFL.com, and work with Bills’ offensive coordinator Ken Dorsey, who was a huge part of developing Allen’s talent, will be an incredibly appealing opening for any quarterback hoping to one day reclaim a starting role.",
    "pic.twitter.com/PDo0NL2Pcp\n— robertklemko (@RobertKlemko) October 16, 2016\nThe former second-round pick from the 2011 NFL Draft recalled to The Mercury News on December 16, 2020, “Atlanta was somewhere where I had a lot of support, a lot of people saying they agree with what I’m doing, support it and are happy that I did it.",
    "While Kaepernick was basically blacklisted from the NFL for taking a kneel during the national anthem to raise awareness against racial violence and police brutality, since 2016, particularly following the death of George Floyd, the league’s acceptance of peaceful protesting has shifted dramatically.",
    "In June 2020, NFL owner Roger Goodell endorsed Kaepernick’s return, telling ESPN‘s Mike Greenberg, “I support a club making that decision and encourage them to do that.”\nShortly after, Bills co-owner Kim Pegula said that she supports players wanting to take a knee during the anthem.",
    "Kaepernick’s second-best option was Torrey Smith, who earned a 52.2 receiving grade in 2016.”\nThrough his six-year career, Kaepernick tallied 12,271 career passing yards, a 72-30 TD-to-INT ratio and a 59.8% career completion rate.",
    "We’ve been learning to love other people and understand experiences and what they have gone through, what they’ve experienced, and what maybe the anthem or the flag means to them, it’s truly different than what I went through.",
    "Bills Co-Owner Kim Pegula Said in 2020 that She Supports Players Who Kneel\nBuffalo Bills owners Terry and Kim Pegula walk off the field before the game against the Houston Texans at Ralph Wilson Stadium on December 6, 2015.",
    "He would be a great fit for teams with QB vacancies to fill who want to win a Super Bowl.” https://t.co/VAXfKlZ6E4\nWhile Kaepernick would love to once again be a starter, the reality is that he hasn’t played since 2016.",
    "However, Riske pointed out that Kaepernick “had the worst offensive supporting cast in the league.” His pass protection at the time “ranked 29th in the league, and his receiving corps might have been even worse.",
    "The former Chicago Bears starter took a pay cut to sign a one-year, $2.5 million contract with the Bills last year, and despite barely playing this past season, he’s now one of the hottest names in free agency.",
    "Names such as Marcus Mariota and Ryan Fitzpatrick have been linked to the Bills as possible replacements for Trubisky, but an unexpected player suddenly added himself to that list on Thursday, March 10.",
    "Even in a year with a weak quarterback draft class, and numerous teams without clear starters, it’s hard to imagine any franchise taking a flyer on a guy who hasn’t stepped onto the field in six years.",
    "His passing grade (53.8) ranked 33rd amount the league’s 40 quarterbacks who dropped back to pass at least 100 times, per PFF reporter Timo Riske, and ranked 29th while operating from a clean pocket.",
    "ESPN’s Adam Schefter retweeted the 34-year-old’s workout video and wrote, “Colin Kaepernick is still working out and is said to be, in the words of one source, ‘in the best shape of his life.",
    "If they choose to kneel, or whoever wants to protest, I don’t think it’s because they don’t love the country or they don’t respect our military or any of that.",
    "The Buffalo Bills will soon be in the market for a new backup quarterback for starter Josh Allen (L) and Colin Kaepernick (R) is looking to make a comeback.",
    "Pegula’s statement was in stark contrast to some of the crowd’s reception of Kaepernick in Orchard Park when he last played there on October 16, 2016.",
    "One of the most important moves for the Buffalo Bills heading into the 2022 NFL season is finding a new backup for quarterback Josh Allen.",
    "In a surprise move, former San Francisco 49ers quarterback Colin Kaepernick announced that he’s “still working” toward an NFL comeback.",
    "1 receiver — and I use this term volume-wise, not ability-wise — was Jeremy Kerley, who graded out in the 70s only once in his career.",
    "While the Bills would love to keep Mitch Trubisky, he’s expected to field several offers to once again become a starter next season.",
    "I think and I would hope that our players or anybody would understand that if I’m standing, that does not mean I am for racism.",
    "“And there’s other places where the fans don’t agree as much – Buffalo, in particular, was one where that was very evident.",
    "'”\nColin Kaepernick is still working out and is said to be, in the words of one source, “in the best shape of his life.",
    "If Kaepernick can’t get a starting job in 2022, his second-best option could be to follow in Trubisky’s footsteps.",
    "pic.twitter.com/bSuxF3G5qq\n— robertklemko (@RobertKlemko) October 16, 2016\nThese are for sale in the #Bills lot.",
    "pic.twitter.com/NLTC2C9DeZ\nHere's a very drunk Bills fan spearing a dummy with Kaepernick jersey and afro wig.",
    "Shirts with a rifle scope trained on Colin Kaepernick selling for $10 outside of Ralph Wilson stadium.",
    "I’d take Colin Kaepernick as the backup QB for the Bills in a heartbeat for the vet minimum.",
    "He would be a great fit for teams with QB vacancies to fill who want to win a Super Bowl.",
    "Kaepernick’s final season with the Niners wasn’t great.",
    "ALL the latest Bills news straight to your inbox!",
    "Fitzmagic is the only QB I’d want over him.",
    "Join the Heavy on Bills newsletter here!",
    "Personally, I’m not going to kneel.",
    "And the same goes for our players.",
    "And to keep going, stay strong.",
    "But we’ve been listening.",
    "Certainly, it’s not.",
    "He wants to play.",
    "He wants to play.",
    "He’s ready play.",
    "He’s ready play.",
    "2 for $5.",
    "His No."
  ]
}