{
  "id": 3037,
  "mediaId": 2732,
  "date": "2022-03-12",
  "headline": "DCNR names 9/11 National Memorial Trail as Statewide Major Greenway",
  "image": "",
  "link": "https://triblive.com/local/regional/dcnr-names-9-11-national-memorial-trail-as-statewide-major-greenway/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Ann Thomas",
  "authorUrl": "https://triblive.com/author/mary-ann-thomas/",
  "termIds": [
    3165,
    3975,
    4498,
    804,
    5239,
    5250,
    5312,
    5317
  ],
  "sentences": [
    "“It is impossible to understate the meaning this trail has for Pennsylvania and our nation as a whole.”\nThe designation is also important to DCNR’s mission to close priority trail gaps that form arteries connecting statewide land and water trail networks, Dunn added.",
    "“The trail and this special designation will allow Pennsylvanians to harness the great outdoors to forever commemorate our heroes and memorialize the innocent lives our nation lost on 9/11,” said U.S. Rep. Brian Fitzpatrick, R-Bucks County.",
    "“The designation affirms our strong partnership with DCNR and allows us to access additional grants and support,” said Tom Baxter, president of the September 11th National Memorial Trail Alliance.",
    "The trail is a proposed 1,300-mile recreational trail linking the three 9/11 crash sites — in New York City; the Pentagon in Arlington, Va.; and near Shanksville, Somerset County.",
    "Pennsylvania’s designation follows federal legislation signed by President Joe Biden authorizing the secretary of the interior to designate the 9/11 memorial trail route.",
    "Although much of the recent off-road trail development has been focused in Somerset County, the trail winds through Allegheny and Westmoreland counties as well, he said.",
    "“We at DCNR are proud to designate the September 11th National Memorial Trail as a Statewide Major Greenway,” said DCNR Secretary Cindy Adams Dunn in a news release.",
    "The Pennsylvania Department of Conservation and Natural Resources has designated the 9/11 National Memorial Trail as a Statewide Major Greenway.",
    "The trail alliance will announce new off-road extensions of the trail in Somerset County this spring, Baxter said.",
    "In Southwestern Pennsylvania, the trail is expected to spark economic development in communities along the route.",
    "Details about the 9/11 Memorial Trail and its routes are on the trail’s website, 911trail.org.",
    "Currently, the trail is a patchwork of about 50% off-road trails and existing roads.",
    "You can contact Mary at 724-226-4691, mthomas@triblive.com or via Twitter .",
    "The trail spans 25 counties in Pennsylvania, including 16 local trails.",
    "Mary Ann Thomas is a Tribune-Review staff writer.",
    "Categories: Local | Regional"
  ]
}