{
  "id": 3040,
  "mediaId": 2594,
  "date": "2022-03-16",
  "headline": "Vettel full of beans and Poulter backs Stenson – Wednesday’s sporting social",
  "image": "https://static.independent.co.uk/2022/03/16/18/16160656-20d4dbd5-976b-411f-bfe7-4e16311bf35e.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/gary-neville-spurs-cheltenham-france-lee-westwood-b2037486.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pa Sport Staff",
  "authorUrl": "https://www.independent.co.uk/author/pa-sport-staff",
  "termIds": [
    0
  ],
  "sentences": [
    "Sports stars and clubs across the world continue to provide an insight into their lives on social media.",
    "Alexandra Hartley received feedback for her commentary…\nSteven Finn had a decision to make.",
    "A couple of former Premier League defenders progressed in the Champions League.",
    "Football\nGary Neville was not surprised by Man Utd’s Champions League exit.",
    "High praise for Babar Azam after his match-saving knock against Australia.",
    "Matt Fitzpatrick was happy to have brother Alex making his PGA Tour debut.",
    "Here, the PA news agency looks at some of the best examples from March 16.",
    "Pep Guardiola was doing his bit to help solve the world’s water problems.",
    "Ian Poulter gave his backing to new Ryder Cup captain Henrik Stenson.",
    "Leinster made a long-awaited discovery behind the skirting boards.",
    "Happy 29th birthday to England and Leicester fly-half George Ford.",
    "Sir Nick Faldo gave his view on the proposed Saudi Golf League.",
    "A bit of desert blew into Gary Lineker’s garden.",
    "England got off the mark at the World Cup.",
    "Sebastian Vettel was full of beans.",
    "Valtteri Bottas was raring to go.",
    "Lucy Bronze was primed and ready.",
    "Billie Jean King enjoyed herself.",
    "Paul Lawrie was in Carnoustie.",
    "Happy birthday, Ottis Gibson.",
    "The Six Nations looked back."
  ]
}