{
  "id": 3045,
  "mediaId": 2728,
  "date": "2022-03-15",
  "headline": "‘Book it now’: Vacation travel costs set to soar due to increased demand and rising fuel costs",
  "image": "https://images.thestar.com/6l8QqSM1OTraS-BhWr0OTrP4nPM=/1200x800/smart/filters:cb(1647372958679)/https://www.thestar.com/content/dam/thestar/business/2022/03/15/book-it-now-increased-demand-and-soaring-fuel-costs-ramp-up-airfare/travel_costs.jpg",
  "link": "https://www.thestar.com/business/2022/03/15/book-it-now-increased-demand-and-soaring-fuel-costs-ramp-up-airfare.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clarrie Feinstein",
  "authorUrl": "https://www.thestar.com/authors.feinstein_clarrie.html",
  "termIds": [
    0
  ],
  "sentences": [
    "And that, combined with the federal government dropping its recommendation that Canadians avoid international travel for non-essential purposes, allowing antigen tests instead PCR tests when entering the country, and ending quarantine for kids 12 and under, makes it worthwhile to book now, Firestone said.",
    "“A number of factors go into airline ticket pricing apart from fuel and fixed costs, including but not limited to, competition, demand, third-party navigation, airport and other charges, marketing considerations and the type of traffic that a route serves,” Fitzpatrick said in a statement.",
    "“There was unbelievable interest in March break travel,” said Martin Firestone, president of the travel insurance brokerage Travel Secure Inc. That increased demand, coupled with oil sanctions against Russia, will increase the cost of air travel, said Firestone.",
    "In a conference call last week, Transat A.T.’s chief financial officer Patrick Bui said the tour operator may consider fuel hedging (agreeing to purchase oil in the future at a predetermined price) to buffer against mounting costs.",
    "“It basically reignited the travel industry.”\nThe question consumers should be asking is whether a surcharge will be added at a later date to a trip already paid for to compensate for the rising oil prices, said Firestone.",
    "Allison Wallace, director of media and communications for Flight Centre Canada, said with the easing of restrictions there is no question that there is a lot of pent-up demand, which is driving costs for the short-term.",
    "Helane Becker, an analyst with investment banker Cowen Inc., said airports generally have about two weeks’ worth of jet fuel on hand, which means airlines are only now starting to feel the financial pressure.",
    "Da Silva expects prices to rise even higher along with soaring fuel prices, as some airlines carry exorbitant fuel surcharges — an extra charge on top of airfare — to cover the cost of airline fuel.",
    "Just as COVID induced travel restrictions are lifting, the price of fuel is skyrocketing, and that means Canadians clamouring to getaway are going to feel the brunt of increasing travel costs.",
    "“Historically, when fuel prices have gone up it takes a bit of time for that cost to be passed on to the customer in terms of higher prices as airlines purchase fuel on futures,” she said.",
    "To compare year over three years, KAYAK considered searches originating in Canada for domestic and international travel from 3/2/19 - 3/8/19 for travel 3/8/19 - 9/8/19.",
    "That said, it would not be surprising to see a repeat of 2008 when a rapid rise in fuel prices was followed by an equally rapid fall,” she wrote in a research note.",
    "Online travel agency Kayak considered searches originating in Canada for domestic and international travel from 3/2/22 - 3/8/22 for travel between 3/8/22 - 9/8/22.",
    "“Do it whether they add a surcharge or not, because in three or four months I can’t imagine what some of these costs will be.”\nWith files from The Canadian Press.",
    "“To compensate for some of these, we do include a carrier surcharge as a regular part of our normal pricing, but not a specific ‘fuel surcharge,’” he said.",
    "If people are weighing whether to book tickets now or wait for costs to decrease, it’s best to book now and lock in the current price, said Firestone.",
    "“Could there be additional costs tagged on?”\nWhen it comes to cruise ship tickets, Firestone warned prices are likely to increase drastically.",
    "Oil and gas sanctions levied against Russia for its invasion of Ukraine have already pushed up the price of fuel by more than 27 per cent.",
    "Deise da Silva at Toronto’s Mandala Travel agency has watched prices increase substantially since travel restrictions eased in February.",
    "WestJet spokesperson Denise Kenny, said fares have not been increased and said that demand is the key driver of ticket prices.",
    "The average price of flights from Toronto to destination hot spots Cancun and Dominican Republic has increased 47 per cent.",
    "Oil rose to $142 (U.S.) a barrel in the week ending March 4, according to S&P Global Commodity Insights.",
    "“Unsurprisingly, jet fuel at the current level or higher is a significant headwind to airline earnings.",
    "Travel search website Kayak compared the price of international flights in March 2022 to March 2019.",
    "Air Canada always factors fuel costs into ticket prices, said spokesperson Peter Fitzpatrick.",
    "For example an all-inclusive vacation to Cuba was $800 at the beginning of the year.",
    "“Prices have gone up at least 20 per cent to the Caribbean,” said the travel agent.",
    "For example, a flight from Toronto to New Delhi is up 60 per cent over 2019 prices.",
    "It found the average costs rose drastically for some popular destinations.",
    "Even the short trip to New York is 30 per cent more than three years ago.",
    "“Anyone who was sitting on the fence about travel aren’t now,” he said.",
    "The cost of your long-awaited vacation is set to soar.",
    "Travel experts say the best bet is to book it now.",
    "“That would be my biggest question,” he said.",
    "A trip to Paris is 15 per cent higher.",
    "This week it cost closer to $1,200.",
    "Attention international travellers.",
    "SHARE:"
  ]
}