{
  "id": 3048,
  "mediaId": 2586,
  "date": "2022-03-16",
  "headline": "Ex-Steeler Suggests Pittsburgh Is Pursuing 3-Time All-Pro Defender",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-3548697034.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/tyrann-mathieu-free-agent-chiefs-twitter/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allison Koehler",
  "authorUrl": "https://heavy.com/author/allisonkoehler79/",
  "termIds": [
    1420,
    1919,
    2372,
    2902,
    3686,
    3773,
    539,
    671,
    823,
    5249
  ],
  "sentences": [
    "Ex-Steelers linebacker Terence Garvin posted an intriguing Tweet yesterday, March 15, that his former team was “trying land the Bagerr.” Though he botched the spelling, Garvin’s tweet refers to All-Pro safety Tyrann Mathieu, also known as Honey Badger.",
    "— Ian Rapoport (@RapSheet) March 16, 2022\nAdditionally, the Steelers’ history of drafting the safety position has been underwhelming since Troy Polamalu in 2003, so landing a seasoned player of Mathieu’s caliber is the fail-safe way.",
    "https://t.co/nv16uKMCK1\n— Christopher Carter (@CarterCritiques) March 15, 2022\nWhy It Makes Sense\nIf there’s even a shred of truth to the Pittsburgh Steelers pursuing Mathieu, there are many reasons why it makes sense.",
    "Cap hits for quarterback Mitch Trubisky (quarterback), center Mason Cole (center), Montravius Adams (defensive tackle), Miles Killebrew (linebacker/safety) and Arthur Maulet (cornerback) are still unknown.",
    "While Garvin is no insider, he did divulge to SteelersNation.com last offseason that something was about to go down in Pittsburgh mere days before Vince Williams shocked the NFL with his retirement.",
    "@BordasLaw https://t.co/KHqH0BYWiV\n— Pittsburgh Steelers (@steelers) March 16, 2022\nWith the Banner move, Pittsburgh cleared $5 million of cap space.",
    "The Steelers typically prefer to extend their top players while one season remains on the contract, which is the case for the All-Pro safety.",
    "That formidable duo would undoubtedly ease the blow of having Lamar Jackson, Joe Burrow and, potentially, Deshaun Watson in the AFC North.",
    "According to Spotrac, Fitzpatrick’s market valuation is four years, $61.073 million, or an average salary of $15.268 million.",
    "If Pittsburgh and Fitzpatrick don’t get a deal done this offseason, he’ll play on his fifth-year option at $10.612 million.",
    "Former #Chiefs team MVP and Pro Bowl S Tyrann Mathieu is the last and best safety standing, by far the top at his position.",
    "Until official news breaks (or doesn’t), NFL free agency is all about rumors and speculation from insiders and outsiders.",
    "Christopher Carter, writer for DK Pittsburgh Sports, also believes that Mathieu is a real possibility for the Steelers.",
    "There will also be a void at the safety position as Pittsburgh will likely let Terrell Edmunds walk in free agency.",
    "While that base salary is trimmed, the team will have $1.625 million of dead money left on the books (per Spotrac).",
    "Their financial situation gives them a rare opportunity to make a splash signing with the three-time All-Pro.",
    "Of course, should Banner go un-signed, a future reunion at a more reasonable salary is always a possibility.",
    "Fitzpatrick’s current contract, which carries an average salary of $4.112 million, expires in March of 2023.",
    "Banner’s release comes on the heels of Pittsburgh re-signing fellow tackle Chuks Okorafor on March 14.",
    "Former #Pitt safety finds a new home, but also a potential target for the #Steelers is off the board.",
    "Mathieu would be a tremendous upgrade over Edmunds, who never lived up to his first-round selection.",
    "The Steelers currently rank 11th in league with $21.535 million in cap space (per Spotrac).",
    "Imagine — if you will — a backfield with both Minkah Fitzpatrick and Tyrann Mathieu in it.",
    "Mathieu is looking for a new NFL home as a free agent from the Kansas City Chiefs.",
    "Bye-Bye Banner\nOn March 16, the Pittsburgh Steelers cut fan-favorite Zach Banner.",
    "And the latest story swirling around Pittsburgh Steelers free agency is a doozy.",
    "Cap hits for Adams, Killebrew and Maulet shouldn’t affect the numbers much.",
    "The offensive tackle never hit his stride in four seasons with the team.",
    "Minkah Money\nSpeaking of Fitzpatrick, he’s the next guy up to be paid.",
    "Terrell Edmunds' return is still in play, but so is Tyrann Mathieu.",
    "They’re in foreign territory this offseason — flush with money.",
    "Injuries limited him to one game in 2020 and seven last season.",
    "We have terminated the contract of OT Zach Banner.",
    "Steelers trying land the Bagerr ????"
  ]
}