{
  "id": 3056,
  "mediaId": 2586,
  "date": "2022-03-15",
  "headline": "Steelers Acquisition of Ex-Bears, Bills QB Mitch Trubisky Draws Mixed Twitter Reactions",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-1335462071-e1647366383651.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/mitch-trubisky-bears-bills-twitter-reaction/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allison Koehler",
  "authorUrl": "https://heavy.com/author/allisonkoehler79/",
  "termIds": [
    2249,
    2980,
    3069,
    3117,
    4688,
    671,
    817,
    823,
    1094
  ],
  "sentences": [
    "pic.twitter.com/Zv6tTmuWVi\n— Rico (@ANGRY_RICO) March 15, 2022\nA fan in Mexico had tweeted this about the Trubisky news: “Everyone makes the ugly choice @Mtrubisky10 by @Steelers, but they forget that in this sport the underdogs only need a real chance to show what they are made of.",
    "Two words: Matthew Stafford.”\nTodo mundo le hace el feo a la elección de @Mtrubisky10 por parte de @steelers, pero se olvidan que en este deporte los underdogs sólo necesitan un chance real para demostrar de que están hechos.",
    "Trubisky’s contract is in the mix with backups Case Keenum (Cleveland Browns), Jordan Love (Green Bay Packers), free agent Ryan Fitzpatrick, and rookie contracts for Patriots’ Mac Jones and Ravens’ Lamar Jackson.",
    "Dos palabras: Matthew Stafford#Steelers\n— Juárez Góngora (@juarezsolrac) March 15, 2022\nWhile the message is true, Rams quarterback Matthew Stafford’s Super Bowl win put him in the Hall of Fame conversation.",
    "My thought is that it’ll be a true quarterback competition in training camp, which will bring out the best in Trubisky, Rudolph, Haskins, and whoever ends up the fourth arm in the room.",
    "Even after the signing becomes official, the Pittsburgh Steelers quarterback situation remains muddled — it’s unknown whether Trubisky, 27, will be the starting QB come September.",
    "Trubisky Versus Rudolph\nTribLive Steelers columnist Tim Benz compiled an apples-to-apples comparison of Mitchell Trubisky and Mason Rudolph and it’s closer than fans might think.",
    "Hoping he rejuvenates his career\n— Free Thought ASL (@Shoulder_Shrugg) March 15, 2022\nOne fan, a self-described “professional sports s–t talker,” has an interesting take.",
    "Shortly after the March 14 news that the Steelers had agreed to terms with the quarterback, Trubisky took to Twitter to share his excitement via ESPN’s Adam Schefter.",
    "Looking at the numbers, the former second-overall draft pick is slightly better than Rudolph but by no means good enough to immediately be crowned the starter.",
    "The two-year/$14.25 million contract, per NFL Network’s Tom Pelissero, is worth up to $27 million with incentives, which kick in if he’s named the starter.",
    "While Mason Rudolph didn’t seize the opportunity to supplant the retired Ben Roethlisberger, he has earned the right to compete for the starting role.",
    "Though his mobility will be a most valuable asset to the Pittsburgh Steelers, Trubisky will want to improve on this number during the offseason.",
    "One NFL fan believes Trubisky is a bench-warmer for life:\nNo, Steelers news outlet that doesn’t have a blue check, I do know Mitch Trubisky.",
    "pic.twitter.com/RCuWm9X2BT\n— Allison Koehler (@AKoehlerNFL) March 15, 2022\nIt’s not a forgone conclusion that Trubisky will be the starter.",
    "Most Steelers fans have no faith that incumbent quarterback Mason Rudolph can capably replace Roethlisberger, and Trubisky isn’t Rudolph.",
    "A fan in Chicago of all places has hope for the ex-Bears quarterback: “As a run first team, Mitch should do just fine for Pittsburgh.",
    "It breaks down to just over $7 million per year and ranks Trubisky the 31st among quarterback contracts, according to Spotrac.",
    "Benz wrote:\nLet’s be honest, the news of Trubisky’s signing was met with wild applause in Pittsburgh on Monday for one reason.",
    "Trubisky completed six of eight passes for 43 yards, no touchdowns, one pick, and two first downs in the remaining four.",
    "It doesn’t appear that the Steelers are making any splash moves to vastly improve their 26th-ranked offensive line.",
    "The Pittsburgh Steelers are granting Trubisky an opportunity to dig out of the “bust” hole and reset his career.",
    "While #Steelers will categorize their QB position as a “Competition”, it will Mitch Trubisky’s job to lose.",
    "While the role is likely Trubisky’s to lose, it’ll be several months before a starter is named.",
    "Hope he rejuvenates his career.”\nAs a run first team, Mitch should do just fine for Pittsburgh.",
    "— Angus Young (@8Young0) March 15, 2022\nAngry_Rico is angry about the acquisition of Trubisky.",
    "Another interesting number is the “average time to throw” stat provided by NFL Next Gen Stats.",
    "Trubisky appeared in limited packages of six regular-season games with the Bills last season.",
    "— Bob Pompeani (@KDPomp) March 15, 2022\nBy the numbers, Trubisky’s contract is backup money.",
    "Ben Roethlisberger’s release time was the quickest in the league in 2021 at 2.38 seconds.",
    "There are several reports that he is the “expected starter,” but it’s pure speculation.",
    "Trubisky’s time to throw in 2020 was tied with the Saints’ Drew Brees at 2.66 seconds.",
    "According to Pro Football Reference, no stats were recorded in two of those games.",
    "I watched him on RedZone, and I kept up with his stats via fantasy.",
    "Trubisky was 6-3 for the Bears in his last year as a starter.",
    "He also ran the ball 13 times for 24 yards and one touchdown.",
    "Backup money for a guy who could wind up the Day 1 starter.",
    "It would take a miracle for Trubisky to reach that status.",
    "The Trubisky news drew mixed reactions from the NFL world.",
    "He is not the answer, and we are not underestimating him.",
    "I watched him play numerous games in a Bears jersey.",
    "ALL the latest Steelers news straight to your inbox!",
    "Well, except that in a lot of ways, he actually is.",
    "Second chances don’t come along often in the NFL.",
    "Trubisky’s career completion percentage is 64.1.",
    "They learned nothing from the last Super Bowl.",
    "But Mitch Trubisky is one of the lucky few.",
    "Join the Heavy on Steelers newsletter here!",
    "No aprendieron nada del último Super Bowl.",
    "Rudolph was 5-3 for the Steelers in 2019.",
    "Throw him in the dumpster ??????????????",
    "Rudolph averages 6.2 yards per attempt.",
    "I think Eagles fans would disagree.",
    "Steelers got a GREAT deal!",
    "Trubisky averages 6.7.",
    "Trubisky is TRASH!!!",
    "To Be or Not To Be?",
    "Rudolph’s is 61.5.",
    "Career backup."
  ]
}