{
  "id": 3057,
  "mediaId": 2732,
  "date": "2022-03-09",
  "headline": "NFL free agency outlook: Quarterback class is thin, but options exist for Steelers",
  "image": "",
  "link": "https://triblive.com/sports/nfl-free-agency-outlook-quarterback-class-is-thin-but-options-exist-for-steelers/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Rutter",
  "authorUrl": "https://triblive.com/author/joe-rutter/",
  "termIds": [
    0
  ],
  "sentences": [
    "Aaron Rodgers decided against taking a ride Tuesday when he agreed to return to the Green Bay Packers, but the Seattle Seahawks got the merry-go-round revved up by sending Russell Wilson to the Denver Broncos for a bevy of draft picks and players.",
    "Armed with at least $29 million under the salary cap — and with capabilities of creating a larger cash flow — the Steelers could target a free agent to compete for the position left vacant by Ben Roethlisberger’s retirement.",
    "Exploring the market\nMitchell Trubisky: His name has generated plenty of free agency buzz despite the fact he attempted just eight passes — with no touchdowns and one interception — last season with the Buffalo Bills.",
    "As for the Pittsburgh Steelers, they continue to watch and wait, deciding whether to take the unlikely path of trading for a quarterback or go the more conventional routes via free agency or the draft.",
    "The quarterback carousel continued to spin Wednesday with news that the Indianapolis Colts are trading Carson Wentz to the Washington Commanders once the new NFL season opens for business March 16.",
    "Unrestricted free agents (1): Joshua Dobbs: If the Steelers desire to bring him back as the fourth quarterback for training camp, he could be offered the veteran minimum of $1.035 million.",
    "Before we delve into the open market, a look at what the organization already has on hand:\nSteelers situation\nOn the roster (1): Mason Rudolph: He carries a $4.04 million cap hit in 2022.",
    "Free agency kicks off at 4 p.m. next Wednesday, but it is preceded by a 48-hour period during which teams can begin negotiating with free agents outside their organization.",
    "Pros: Mariota was used as a situational runner/passer late in the season, and the Steelers could be enticed by a veteran who can use his legs to break containment.",
    "Others available: Ryan Fitzpatrick, Andy Dalton, Cam Newton, Tyrod Taylor, Jacoby Brissett\nJoe Rutter is a Tribune-Review staff writer.",
    "Although his numbers weren’t eye-popping in Denver, he is coming off his career high in touchdowns, and he can move in the pocket.",
    "Expected to return (1): Dwayne Haskins: A restricted free agent, he could get a right-of-first-refusal tender of $2.433 million.",
    "He started 14 games last year, going 7-7 while completing almost 67% of his passes with 18 touchdowns and seven interceptions.",
    "In a thin QB free agent class, he’s in line for more than a one-year, prove-it deal and could command $10 million per season.",
    "Like Winston, he could be on the move after spending two seasons with his second organization, the Las Vegas Raiders.",
    "Pros: The second overall pick by the Chicago Bears in 2017, Trubisky is only 27 and has a 29-21 record as a starter.",
    "Teddy Bridgewater: He will hit the market after making $4.25 million with the Denver Broncos, his fourth NFL team.",
    "Jameis Winston: He spent a second year in New Orleans as the Saints began their first year minus Drew Brees.",
    "He could be signed to compete for the backup job if the Steelers prefer to see what Rudolph can do in 2022.",
    "Marcus Mariota: He and Winston forever will be intertwined as the top two picks from the 2015 draft class.",
    "He earned $5.5 million and went 5-2 as a starter while throwing just three interceptions on 161 attempts.",
    "Cons: He hasn’t started a game since 2019 and hasn’t been a full-time starter since the previous season.",
    "Cons: In his last full season as a starter, 2019, he had 17 touchdown passes offset by 10 interceptions.",
    "Pros: Despite his mileage and frequent NFL stops, Bridgewater won’t turn 30 until November.",
    "Cons: He is coming off a torn ACL that he sustained in November, which ended his season.",
    "The second-round tender is $3.96 million, and the first-round tender is $5.562 million.",
    "The Steelers also need to determine if his skill set has more upside than Rudolph.",
    "With Carolina in 2020, he went 4-11 and had 11 interceptions against 15 TD passes.",
    "He also could be ready to capitalize on the improvement he made with New Orleans.",
    "He also has shown mobility the Steelers covet for Roethlisberger’s successor.",
    "Even if he is ready for the 2022 season, his mobility could be limited.",
    "You can contact Joe by email at jrutter@triblive.com or via Twitter .",
    "And they might find themselves bidding for Trubisky’s services.",
    "Cons: His next team will be his fourth in as many seasons.",
    "Pros: Another top pick, Winston turned 28 in January.",
    "That could be enough to scare off the Steelers.",
    "He had a $3.5 million cap hit last year.",
    "Categories: Sports | Steelers/NFL",
    "He’s also 28."
  ]
}