{
  "id": 3059,
  "mediaId": 2746,
  "date": "2022-03-14",
  "headline": "Commanders give offensive coordinator Scott Turner mutli-year extension",
  "image": "https://twt-thumbs.washtimes.com/media/image/2020/01/15/ScottTurnerpng_c0-19-900-544_s1200x700.png?4bdd8331c9ebbd8a024c998b3ae15e8a0bff4e78",
  "link": "https://www.washingtontimes.com/news/2022/mar/14/commanders-give-offensive-coordinator-scott-turner/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Paras",
  "authorUrl": "https://www.washingtontimes.com/staff/matthew-paras/",
  "termIds": [
    1358,
    1509,
    1718,
    1977,
    3527,
    3931,
    4335,
    1218
  ],
  "sentences": [
    "Scott Turner began his coaching career in Carolina as a quality control coach and became an offensive coordinator for the first time in 2019 after the Panthers reshuffled their coaching staff more than midway through the season.",
    "Washington Commanders offensive coordinator Scott Turner agreed to a multi-year extension that keeps him under contract through 2024, according to multiple reports.",
    "With Turner, Washington has started six different quarterbacks: Dwayne Haskins, Kyle Allen, Alex Smith, Taylor Heinicke, Ryan Fitzpatrick and Garrett Gilbert.",
    "Last season, Washington started the run the ball more after the bye week — a change in strategy that correlated with a four-game winning streak.",
    "Over the last two seasons, the Commanders have ranked near the bottom of the league offensively, albeit with a rotating door at quarterback.",
    "Turner has been Washington’s offensive coordinator since 2020 when he was one of coach Ron Rivera’s first hires upon joining Washington.",
    "Despite the circumstances, Turner has occasionally drawn praise for creative play-calling and adapting to the team’s personnel.",
    "That year, the Panthers fired Rivera following a loss to Washington and Turner took over coordinator duties from his dad.",
    "Still, Washington finished last season ranked 21st in total yards, 23rd in points and 21st in passing yards.",
    "The team also ranked 21st in Football Outsiders’ offensive DVOA, a metric that measures efficiency.",
    "Turner‘s new deal coincides with the length of newly acquired quarterback Carson Wentz.",
    "After the season ended, Rivera was hired by Washington and brought Turner with him.",
    "Turner beat out former Washington coordinator Kevin O’Connell for the job.",
    "NBC Sports Washington first reported the news of Turner‘s new deal.",
    "Turner, 39, is the son of former Washington coach Norv Turner.",
    "The Washington Post reported it’s a three-year contract."
  ]
}