{
  "id": 3061,
  "mediaId": 2586,
  "date": "2022-03-14",
  "headline": "Ex-Bills QB Mitch Trubisky Sends Message After Signing With Steelers",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-1344635373-e1647278059291.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/mitch-trubisky-steelers-twitter-reaction/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Bicks",
  "authorUrl": "https://heavy.com/author/emilybicks/",
  "termIds": [
    1718,
    2249,
    2586,
    2596,
    3069,
    3931,
    4688,
    160,
    308,
    823
  ],
  "sentences": [
    "— Joy Taylor (@JoyTaylorTalks) March 14, 2022\nDwayne Haskins, Mason Rudolph, and Mitch Trubisky in the Steelers QB competition: pic.twitter.com/WmCqRPKp47\n— Jœ (@Incognito_Jo) March 14, 2022\nBefore he signed with the Steelers, Trubisky’s name had been linked to numerous teams, including the Indianapolis Colts, Washington Commanders, Denver Broncos, New Orleans Saints, and the Tampa Bay Buccaneers.",
    "— Barstool Sports (@barstoolsports) August 21, 2021\n“You’ve just got to believe like deep down that everything you’re working on is going to pay off eventually,” Trubisky told The Buffalo News in a story published January 30.",
    "(via @MikeGarafolo) pic.twitter.com/Uw7aBwyhgH\n— NFL (@NFL) March 14, 2022\nPer ESPN’s Adam Schefter, Trubisky sent Schefter a text message about how he’s “beyond excited and blessed” to be a part of the Steelers organization.",
    "Some fans were glad the Steelers signed Trubisky, a free agent, rather than trading for San Francisco 49ers quarterback Jimmy Garappolo, while others found little excitement in learning the former No.",
    "After the Bears fired coach Matt Nagy and general manager Ryan Pace following a disappointing 6-11 season, Trubisky received an onslaught of public apologies for the way he was treated in Chicago.",
    "Steelers GM Kevin Colbert and President Art Rooney II repeatedly said they would be bringing in another QB to compete with Mason Rudolph and Dwayne Haskins for the starting job.",
    "— Ian Rapoport (@RapSheet) March 14, 2022\n— Joey (@JoeyMulinaro) March 14, 2022\n— RAMEY (@HoodieRamey) March 14, 2022\nMitchell Trubisky is your new starting QB in Pittsburgh.",
    "Trubisky appears to have taken in stride his journey from being a first-round draft pick and starting quarterback for the Chicago Bears to being a backup player.",
    "— Daniel Valente (@StatsGuyDaniel) March 14, 2022\nThe #Steelers had been in the mix on Jimmy G with the #49ers, but signing Mitch Trubisky means they are out.",
    "The Colts traded Carson Wentz to Washington, the Broncos acquired Russell Wilson from the Seattle Seahawks and Tom Brady decided to come out of retirement.",
    "2 overall pick heads to Pittsburgh as the expected starter in place of the retired Ben Roethlisberger.”\nALL the latest Bills news straight to your inbox!",
    "The Bills had been preparing for Trubisky to move on from their team, and now they’re looking for a new backup quarterback behind Josh Allen.",
    "In a surprise announcement, former San Francisco 49ers quarterback Colin Kaepernick said that he’s “still working” toward an NFL comeback.",
    "After a year as the Buffalo Bills‘ backup quarterback, Mitchell Trubisky is returning to his role as a starter for the 2022 NFL season.",
    "Several names, including Marcus Mariota and Ryan Fitzpatrick, have been floated in recent weeks as possible replacements for Trubisky.",
    "NFL Network’s Mike Garafalo tweeted, “The #Steelers have reached agreement on a two-year deal with QB Mitchell Trubisky, sources say.",
    "Hopefully, when I get that next opportunity, I’ll be able to shine.”\nWho Will Replace Trubisky in Buffalo?",
    "“And they say the things you do in the dark will shine in the light someday when you get the opportunity.",
    "On Monday, March 14, news broke that the 27-year-old is taking his talents to the Pittsburgh Steelers.",
    "I know Pittsburgh fans are going freak out, but I think Mitch Trubisky is a good bridge situation.",
    "Reaction on Twitter was strong but mixed following news of Trubisky’s deal with the Steelers.",
    "WPXI’s Jenna Harner tweeted, “Trubisky’s role as the starter, however, is not set in stone.",
    "Trubisky Says He’s Ready for his Next Opportunity\nTrubisky is 29-21 in 50 career starts.",
    "But that list shrank considerably following a flurry of transactions this past week.",
    "But these offers of validation were not something he needed or was waiting for.",
    "Ryan Fitzpatrick, 39, spent the 2021 season with the Washington Football Team.",
    "And an unexpected player suddenly added himself to that list on March 10.",
    "Trubisky was named only as the Steelers’ “expected” starter, however.",
    "Tough division, can't go into this season with Rudolph and Haskins.",
    "2 overall pick from the 2017 NFL draft was heading to Pittsburgh.",
    "Steelers, QB Mitchell Trubisky agree to two-year deal.",
    "Mitch Trubisky is now that guy.”\nThank you Steelers!",
    "Trubisky > trading for Garoppolo > starting Rudolph.",
    "The #Colts still have interest in Jimmy Garoppolo.",
    "Join the Heavy on Bills newsletter here!",
    "The former No."
  ]
}