{
  "id": 3067,
  "mediaId": 2586,
  "date": "2022-03-12",
  "headline": "Bills Rumors: Struggling Specialist Takes Pay Cut, Could be Released",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Matt-Haack-e1647115853975.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-rumors-haack-pay-cut/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1954,
    2849,
    3380,
    160,
    721
  ],
  "sentences": [
    "At his age, Beasley is unlikely to get more on the open market — in total money and guaranteed money — than what the Bills would offer.”\nSome options of who could be in the market to trade for #Bills WR Cole Beasley: https://t.co/MkZnfye6gI\nThe Bills have already made some moves to create cap space, cutting linebacker A.J.",
    "Maybe until they find someone else, or he has a chance to win the job again at camp.”\nBills punter Matt Haack agrees to pay cut as part of new contract https://t.co/7BJWW3Iynx\nMore Cap Space Moves Could Be Coming\nThe Bills may look to restructure more contracts as a means to save on cap space.",
    "The Buffalo Bills could be paving the way for a position battle on special teams, with struggling punter Matt Haack taking a pay cut in a move that some insiders see as a potential prelude to his release.",
    "Haack Takes New Deal\nAfter signing with the Bills last offseason, Haack was one of the league’s least-utilized punters as head coach Sean McDermott adopted an aggressive approach on fourth-down calls.",
    "As The Athletic’s Joe Buscaglia reported, the Bills removed a $1 million salary guarantee that was set to kick in on March 18, which could pave the way for the Bills to cut Haack in training camp.",
    "He had some high-profile struggles, including in the season finale against the New York Jets when he shanked a series of punts and the Bills had a difficult time putting away the game.",
    "“Given Brandon Beane’s comments at the end of the season, saying they’d be looking at punters this offseason, I’m surprised they didn’t outright move on from Haack,” Capaccio tweeted.",
    "The NFL Network’s Tom Pelissero reported on Saturday that Haack agreed to a pay cut as part of a contract restructuring that will also void the final year of his contract.",
    "In a story written before news that Beasley was seeking a trade, Buscaglia suggested that the Bills would be willing to keep the veteran receiver on a restructured deal.",
    "“The Bills could offer Beasley a base salary reduction to get his cap hit down to the range of $4.5 million to $6 million and fully guarantee the salary.",
    "Buscaglia predicted that the team could ask slot receiver Cole Beasley to take a pay cut that would put his salary more in line with his production.",
    "There had already been speculation that Haack could be cut this offseason, and the restructured contract could allow the Bills to do so more easily.",
    "Haack, who was near the bottom of the league rankings for punters across a number of categories, could now face competition to hold onto his spot.",
    "But Haack struggled when he was called upon and his 42.9-yard average on punts and 38.3-yard net average were near the bottom of the league.",
    "#Bills punter Matt Haack signed a revised contract, reducing his pay to $1.135 million in 2022 and voiding the last year of his contract.",
    "https://t.co/zIdM9ptpuS\nSal Capaccio of WGR 500 predicted that Haack will now face tough competition for a spot on the team next year.",
    "According to a source, that $1M base salary guarantee on March 18 was removed from Haack's contract.",
    "Klein and lineman Jon Feliciano, who the team had just signed to a contract extension last season.",
    "“Beasley is a good player, but he should not account for a nearly $8 million cap hit,” he wrote.",
    "Bills have all the punting flexibility possible this summer.",
    "The latest Bills news straight to your inbox!",
    "He now can be a free agent after the season.",
    "Join the Heavy on Bills newsletter here!",
    "“But he will stick….for now.",
    "There's your answer."
  ]
}