{
  "id": 3071,
  "mediaId": 2586,
  "date": "2022-03-18",
  "headline": "Bills Release $50M Defensive Tackle: ‘The Writing Was on the Wall’",
  "image": "https://heavy.com/wp-content/uploads/2022/01/GettyImages-1196538400-e1643410903956.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-release-dt-star-lotulelei/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1817,
    2268,
    3005,
    4472,
    160,
    671,
    5222
  ],
  "sentences": [
    "He got better and I thought it improved the two playoff games, but I still don’t think it was as consistent as he was the first part of the season.”\nThe Bills have made other cap-saving moves this offseason, releasing offensive linemen Jon Feliciano and Daryl Williams along with wide receiver Cole Beasley.",
    "says Tim Settle will be among the biggest steals of free agency pic.twitter.com/S25HkS9Btb\n— JP Finlay (@JPFinlayNBCS) March 11, 2022\nSettle’s signing earned some praise from the NFL Network’s Mike Garafolo, who said the Bills got one of the biggest steals of free agency.",
    "Bills Releasing Lotulelei\nAs Getzenberg noted, the Bills had already restructured Lotulelei’s $50 million contract in 2020 to save on salary cap space, but it was still too high of a number for a team looking to get out from a tight cap situation.",
    "As Nick Wojton of USA Today’s Bills Wire noted, Settle showed some strong potential in Washington but had difficulty getting snaps in the crowded defensive line rotation, and could have more of a chance to shine with the Bills.",
    "Just one day after the rather surprising announcement that the team was signing edge rusher Von Miller to a $120 million deal, the Bills announced that they were parting ways with defensive lineman Star Lotulelei.",
    "The 32-year-old tackle had initially signed with the Bills on a five-year, $50 million deal in 2018, but he has missed much of the last two seasons with a COVID-19 opt-out and a series of injuries.",
    "Harrison Phillips, who largely filled in for Lotulelei during his absence this season, left to join the Minnesota Vikings and the Bills brought in more depth with a pair of other acquisitions.",
    "Star Lotulelei #98 of the Buffalo Bills tackles Le'Veon Bell #26 of the New York Jets during the first quarter of an NFL game at New Era Field on December 29, 2019 in Orchard Park, New York.",
    "(@SalSports) March 18, 2022\nLotulelei had missed all of the 2020 season, opting out due to COVID-19, and missed more time last season for a COVID-19 infection and for personal reasons.",
    "The Bills could have lowered this number by designating Lotulelei as a post-June 1 release, but they instead decided to take a more immediate cap saving of $1.5 million.",
    "The Buffalo Bills have already made one of the biggest additions in free agency, and now are making another widely expected subtraction to create more cap space.",
    "They signed former Carolina Panthers lineman DaQuan Jones, who is seen as a strong run stopper playing largely the same role as both Phillips and Lotulelei.",
    "Bills general manager Brandon Beane had already warned that the team would need to make some moves to create space, and that was before Miller’s signing.",
    "As ESPN writer Alaina Getzenberg noted, many had expected that the Bills would be releasing Lotulelei to reap the salary cap savings.",
    "“Ultimately, the writing was on the wall for the end of Lotulelei’s time with the Bills,” Getzenberg wrote.",
    "The Bills also agreed to terms with defensive tackle Tim Settle, formerly of the Washington Commander.",
    "And I think he’d be the first to tell you that at what he was playing at earlier in the year.",
    "More Help at Defensive Line\nThe Bills had already seen some changes at defensive line.",
    "Beane said it appeared clear that Lotulelei never fully recovered from the infection.",
    "More details, including what it means financially for the Bills and their salary cap.",
    "“But when he got COVID, when he came back, it really affected him,” Beane said.",
    "“Without getting too deep into the woods, I don’t think he returned to form.",
    "She noted that the move will result in $7.7 million in dead cap this year.",
    "https://t.co/8vec5ulr6L via @WGR550\n— Sal Capaccio ??",
    "Bills release defensive tackle Star Lotulelei.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "Watch this – ?@MikeGarafolo?"
  ]
}