{
  "id": 3073,
  "mediaId": 2728,
  "date": "2022-03-12",
  "headline": "Mets get all-star righty Chris Bassitt from A’s for minor leaguers",
  "image": "https://images.thestar.com/L_9jD7o5QwiztauU25ebvm_zbdM=/1280x1024/smart/filters:cb(1647137964993)/https://www.thestar.com/content/dam/thestar/sports/baseball/2022/03/12/mets-get-all-star-righty-bassitt-from-as-for-minor-leaguers/2022031220034-622d432c7b850a4d33b3f03fjpeg.jpg",
  "link": "https://www.thestar.com/sports/baseball/2022/03/12/as-trade-rhp-bassitt-to-mets-for-2-minor-league-pitchers.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Janie Mccauley",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "But overlooked a bit in that excitement was the fact that Marcus Stroman, the club’s best starter last season, signed with the Chicago Cubs and right-hander Noah Syndergaard, coming back from Tommy John surgery, left for the Los Angeles Angels.",
    "OAKLAND, Calif. (AP) — All-Star righty Chris Bassitt, who made a remarkable recovery from a frightening line drive to the head last year, was traded by the Oakland Athletics to the New York Mets on Saturday for a pair of minor league pitchers.",
    "They also have Carlos Carrasco, who managed 12 mostly ineffective starts last year in his first season with the Mets, and Taijuan Walker, who followed up an All-Star first half with a miserable second half.",
    "New York made a huge splash by landing Scherzer in free agency before the Major League Baseball lockout, giving the team an imposing duo with deGrom that’s combined to win five Cy Young Awards.",
    "Oakland, which won the AL West in the virus-shortened 2020 season, finished 86-76 and nine games behind the division champion Astros to miss the playoffs following three straight appearances.",
    "___\nMore AP MLB: https://apnews.com/tag/MLB and https://twitter.com/AP_Sports\nSHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "The 33-year-old Bassitt came back to make two starts in late September, just more than a month after he took a 100 mph liner to the face on Aug. 17 in Chicago.",
    "So the Mets need to add depth on the mound, especially with deGrom coming off an injury-abbreviated season and Scherzer set to turn 38 in July.",
    "Bassitt gives the Mets a much-needed starter for the middle of the rotation, seemingly a good fit behind aces Jacob deGrom and Max Scherzer.",
    "Third-year lefty David Peterson and right-hander Tylor Megill are also rotation options after each showed some promise as a rookie.",
    "Bassitt wound up 12-4 with a 3.15 ERA in 27 starts, including his first career complete game, and was a first-time All-Star.",
    "He had been an AL Cy Young candidate when he got hurt and his absence took a toll on the A’s beyond the field.",
    "The small-budget A’s have long been known for trading away their key players during the offseason.",
    "The Athletics will be led by first-year manager Mark Kotsay, a former outfielder for the club.",
    "The drive came off Brian Goodwin’s bat in the second inning of a 9-0 loss to the White Sox.",
    "Bassitt is 31-25 with a 3.47 ERA in parts of seven seasons with the A’s and White Sox.",
    "Oller, 27, was a combined 9-4 with a 3.45 ERA in Triple-A and Double-A last year.",
    "He was 12-3 with a 3.06 ERA and leading the AL in victories when he was injured.",
    "He was a combined 5-5 with a 3.33 ERA in two levels of Class A ball last year.",
    "Bassitt underwent surgery for three fractures in his right cheekbone.",
    "___\nAP Baseball Writer Mike Fitzpatrick contributed to this report.",
    "The 22-year-old Ginn was a second-round pick by the Mets in 2020.",
    "Immediately after the injury, his right eye was swollen shut.",
    "Ginn and Adam Oller to the A’s for Bassitt.",
    "The Star does not endorse these opinions.",
    "The Mets sent right-handers J.T."
  ]
}