{
  "id": 3075,
  "mediaId": 2523,
  "date": "2022-03-12",
  "headline": "Fletcher Cox Trade Rumors: Steelers, Bills, Chargers Interested in Eagles Star",
  "image": "https://media.bleacherreport.com/image/upload/v1647125611/s9sr5cq4glybszthfoqq.jpg",
  "link": "https://bleacherreport.com/articles/10029583-fletcher-cox-trade-rumors-steelers-bills-chargers-interested-in-eagles-star",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Erin Walsh",
  "authorUrl": "https://bleacherreport.com/users/49c04630-2523-4df1-989d-4e762d355d05",
  "termIds": [
    0
  ],
  "sentences": [
    "The Philadelphia Eagles are receiving a lot of interest in veteran defensive tackle Fletcher Cox, according to Boardroom's Jordan Schultz, and the Buffalo Bills, Pittsburgh Steelers and Los Angeles Chargers are among those interested.",
    "The Steelers tried to acquire Cox at last year's trade deadline, and the Eagles were looking for at least a third-round pick at the time, according to Jason La Canfora of CBS Sports.",
    "Adding Cox to the Pittsburgh defense would make it one of the best in the league with players like T.J. Watt, Cameron Heyward and Minkah Fitzpatrick set to return.",
    "The news comes after NFL Network's Ian Rapoport reported Friday that the Eagles were receiving calls about Cox, who was nearly traded at last year's deadline.",
    "As for the Bills, Cox would be a nice addition to the defense alongside defensive tackles Star Lotulelei, Vernon Butler, Ed Oliver and Harrison Phillips.",
    "Trading the six-time Pro Bowler would hit the Eagles with a $40 million dead-cap charge, so the return \"would have to be substantial,\" Schultz added.",
    "In addition, Cox has been one of the most durable defensive tackles in the NFL over his career, appearing in at least 14 games in every season.",
    "The same could be said for the Chargers, who boast a defensive line that includes Christian Covington, Justin Jones and Joe Gaziano.",
    "In 10 seasons, he has earned six Pro Bowl selections and one All-Pro selection and has helped the Eagles win a Super Bowl.",
    "The 31-year-old has been a staple in Philly's defense since being selected 12th overall in the 2012 NFL draft.",
    "He started 16 games last season, recording 3.5 sacks, two forced fumbles, one fumble recovery and 35 tackles.",
    "Interest in Cox doesn't necessarily come as a surprise after he showed no signs of slowing down in 2021.",
    "Cox is entering the final year of his six-year, $102.6 million deal, which he signed in June 2016.",
    "He has a $14.9 million cap hit for the 2022 campaign, according to Spotrac."
  ]
}