{
  "id": 3082,
  "mediaId": 2586,
  "date": "2022-03-16",
  "headline": "Former Bills Starting Quarterback Lands With NYG, Will Back Up Jones",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Tyrod-Taylor-e1647465471528.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/former-bills-qb-taylor-nyg/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1595,
    2249,
    2855,
    3583,
    3747,
    3977,
    4421,
    4496,
    160,
    707
  ],
  "sentences": [
    "After the Giants plucked general manager Joe Schoen and head coach Brian Daboll away from the Bills, many expected that quarterback Mitch Trubisky would be a top free-agent target as the Giants look for an insurance policy against the uneven play from Daniel Jones.",
    "Tyrod Taylor will sign a two-year, $17M deal ($8.5M guaranteed) with the Giants, per @AdamSchefter @brgridiron pic.twitter.com/Wz7FRFzzEP\n— Bleacher Report (@BleacherReport) March 15, 2022\nTaylor is also coming off an injury-plagued season.",
    "“It was imperative to the new Giants regime led by general manager Joe Schoen and coach Brian Daboll to avoid the type of offensive collapse the team experienced late last season when Daniel Jones was injured,” the report noted.",
    "Before Trubisky’s departure, the Giants also signed Bills practice squad quarterback Davis Webb and had already plucked 2020 fifth-round pick Jake Fromm off the practice squad during the season after the injury to Jones.",
    "“Given that Buffalo is trending towards finally becoming a Super Bowl team—there are very few, if any, organizations that can offer Cam a chance to win like this AFC powerhouse,” he wrote.",
    "The Giants had been seeking a capable backup to Daniel Jones, the report noted, and had already looked at Trubisky before the now-former Bills quarterback picked the Pittsburgh Steelers.",
    "Though Newton has made it clear that he wants to compete for a starting job, he could be willing to bend for Buffalo given the team’s Super Bowl chances, Rizzuti speculated.",
    "Breaking that down: https://t.co/DwGXygVnCP\nAnthony Rizzuti of USA Today’s Panthers Wire predicted that former league MVP Cam Newton could be a potential backup for Allen.",
    "He took over as starter for the Houston Texans in Week 1 after Deshaun Watson sat out while demanding a trade, but missed six games after injuring his hamstring in Week 1.",
    "After spending four seasons with the Baltimore Ravens as backup to Joe Flacco, Taylor came to the Bills in 2015 and won an open quarterback competition in training camp.",
    "Bills Still Looking For Quarterback\nThe Bills will need to do some quarterback shopping of their own this offseason, as there is currently no help behind Josh Allen.",
    "As Katherine Fitzgerald of the Buffalo News noted, the Bills likely want to find a backup with plenty of experience, like what they had last season with Trubisky.",
    "Taylor Picks New York\nAs ESPN reported, former Bills starter Tyrod Taylor intends to sign a two-year deal with $17 million, with $8.5 million in guaranteed money.",
    "Trubisky ended up signing with the Pittsburgh Steelers, but the Giants were able to get a different Bills quarterback to provide some depth at the position.",
    "“It also doesn’t hurt that Newton is well-acquainted with head coach Sean McDermott, who was Carolina’s defensive coordinator from 2011 to 2016.”",
    "But we definitely need to find that piece, because we know how Josh plays.”\nCould the #Bills be in the Cam Newton market during free agency?",
    "He remained the starter for three seasons, helping lead the Bills to a playoff berth in 2017 end ending the team’s 17-year playoff drought.",
    "The New York Giants are grabbing a former Buffalo Bills quarterback, though not the one most people expected.",
    "He struggled during the season, eventually being benched in favor of rookie Davis Mills.",
    "Beane said the team could use different avenues to find their next backup signal-caller.",
    "Taylor ended the season with 966 passing yards with 5 touchdowns and 5 interceptions.",
    "“We’ll look in free agency, we can trade, we could draft, we could do all the above.",
    "Tyrod Taylor drops back to throw in a game against the Indianapolis Colts.",
    "“We’re going to look high and low,” Beane said.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "BUF was named a suitor."
  ]
}