{
  "id": 3096,
  "mediaId": 2728,
  "date": "2022-03-10",
  "headline": "BUBBLE WATCH: Michigan-Indiana game critical for both teams",
  "image": "https://www.thestar.com/assets/img/thestar-ribbon.png",
  "link": "https://www.thestar.com/sports/basketball/ncaa/2022/03/10/bubble-watch-michigan-indiana-game-critical-for-both-teams.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Megargee",
  "authorUrl": "",
  "termIds": [
    1336,
    3394,
    622,
    953,
    5037,
    5039,
    5145,
    5408
  ],
  "sentences": [
    "___\nMore AP college basketball: https://apnews.com/hub/college-basketball and https://apnews.com/hub/ap-top-25-college-basketball-poll and https://twitter.com/AP_Top25\nSHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "A look at Thursday for bubble teams chasing NCAA Tournament bids:\nGAME OF THE DAY\nMichigan coach Juwan Howard returns from a five-game suspension as the Wolverines face Indiana at Indianapolis in a Big Ten Tournament game with major ramifications for both teams.",
    "That marked assistant coach Phil Martelli’s last game filling in for Howard, who was suspended after his open hand hit Wisconsin assistant coach Joe Krabbenhoft on the side of the head while both were in the postgame handshake line.",
    "“I’m hopeful we’ll be in it because I think we’re a team that can advance and really do some damage in the NCAA Tournament.”\nAP Sports Writer Mike Fitzpatrick contributed to this report.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "... Wake Forest (23-9) and Xavier (18-13) both have reason to worry after suffering stunning overtime losses early in their respective conference tournaments.",
    "RISING AND FALLING\nVirginia Tech (20-12) kept its at-large hopes alive by edging Clemson 76-75 on Darius Maddox’s buzzer-beating 3-pointer in overtime.",
    "Neither Florida (19-12) nor Texas A&M (20-11) can afford a loss when they face off in a Southeastern Conference Tournament game at Tampa, Florida.",
    "Wyoming: The Cowboys (24-7) were one of the last four at-large teams in the field as of Wednesday according to the BracketMatrix.com average.",
    "The Hoosiers likely need to beat Michigan and perhaps do even more damage in the Big Ten Tournament to have a shot at an NCAA bid.",
    "Xavier led by six with under 50 seconds left in regulation, but went 1 for 7 at the free-throw line in the final minute.",
    "Indiana (18-12) was one of the top teams projected to miss the 68-team field according to the BracketMatrix.com average.",
    "Wake Forest (23-9) blew a 10-point lead in the final six minutes of regulation and lost 82-77 to Boston College (7-14).",
    "Michigan’s resume also includes an 80-62 victory at Indiana, which has lost its last nine matchups in this series.",
    "... Oregon (19-13) beat Oregon State 86-72 in a likely must-win game in the first round of the Pac-12 Tournament.",
    "... Virginia (19-12) is another ACC bubble team that advanced, as the Cavaliers defeated Louisville 51-50.",
    "The Musketeers missed their last five foul shots during that stretch, and finished 13 for 29 at the line.",
    "The Wolverines helped their cause by ending the regular season with a 75-69 road victory over then-No.",
    "The Fighting Irish should be in good shape as long as they beat Virginia Tech on Thursday.",
    "10 seed in BracketMatrix.com’s average of various projected brackets across the country.",
    "The Ducks likely have to win more games this week to have a realistic shot at a bid.",
    "The Hokies can really help their case by beating Notre Dame in an ACC quarterfinal.",
    "Now they must face UNLV on the Rebels’ home floor in a Mountain West quarterfinal.",
    "TEAMS TO WATCH\nFlorida and Texas A&M: Here’s another matchup between bubble teams.",
    "“When you don’t control your own destiny, I mean, you’re nervous constantly.",
    "Wake Forest had trounced Boston College 87-57 during the regular season.",
    "2 seed in the ACC Tournament and still isn’t assured of an at-large bid.",
    "Notre Dame: How bad has the Atlantic Coast Conference been this season?",
    "Xavier fell 89-82 to Butler and has lost six of its last seven games.",
    "Virginia still has more work to do and next faces North Carolina.",
    "Puts a pit in your stomach,” Xavier coach Travis Steele said.",
    "Consider that Notre Dame (22-9) earned the No.",
    "Michigan (17-13) entered Wednesday as a No.",
    "Wyoming lost 64-57 at Wyoming on March 2.",
    "The Star does not endorse these opinions.",
    "But a loss could put them at risk.",
    "Texas A&M has won four straight.",
    "23 Ohio State."
  ]
}