{
  "id": 3111,
  "mediaId": 2631,
  "date": "2022-03-16",
  "headline": "Angelina Jolie lauds passage of Violence Against Women Act, says 'We need to do more'",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220316-angelina-jolie-mn-1500-2c7670.jpg",
  "link": "https://www.nbcnews.com/politics/angelina-jolie-lauds-passage-violence-women-act-says-need-rcna20344",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2723,
    2760,
    2776,
    4919
  ],
  "sentences": [
    "“And my focus for the last few years has been to help my family and … to focus on helping change laws to protect other families and other women and focus on their stories.”\nOther new provisions in the Violence Against Women Act include increasing culturally specific services, including creating the first grant program dedicated to supporting LGBTQ survivors, and improving forensic evidence collection for detecting bruising and other injuries for people with darker skin tones.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nInside the fight to change the family court system after custody dispute tragedies\nMay 14, 202103:32\n“I think once you’re exposed to this system, whoever you are, once you’re exposed to it and you realize how unbelievably broken this system is, you have to do something to improve it,” Jolie said.",
    "Championed by her mother Kathy Sherlock, Kayden's law focuses on how family courts handle custody cases involving abuse allegations, including improving training for judges who hear custody disputes, outlining required qualifications to give expert testimony about abuse, and asking states to change their statutes to limit therapies focused on forced family reunification.",
    "Angelina Jolie: Protections in Violence Against Women Act are 'urgently needed'\nFeb. 9, 202202:58\nThe Senate renewed the act last Thursday as part of its massive $1.5 trillion spending bill, which also prevented a government shutdown, renewed funding for Pell Grants and other programs, and provided billions in emergency aid for Ukraine.",
    "Actress and UN special envoy for refugees Angelina Jolie told NBC News on Wednesday that the updated Violence Against Women Act that just became law was “a long time coming” — and “personal.”\n“It is personal to everyone,” said Jolie, who has been advocating for a revamped version of the law for years.",
    "“The sad truth is that we see many of these conflicts,” she said, referencing the eight-years-long civil war in Yemen, the war in Ukraine, and the 11th anniversary of the Syrian civil war last week, urging the public to maintain their focus on refugees even when conflicts disappear from the headlines.",
    "“Everyone who cares about family, everyone who cares about children, everyone who cares about their own safety and the health of their community.”\n“I [think] this country doesn’t recognize what a serious domestic violence and child abuse problem it really has,” she said.",
    "A longtime human rights activist, Jolie campaigned to pass the law and strengthen its provisions, including those on family courts, in the years since it expired, including appearing with Senators pushing for the bill’s passage last month.",
    "“Many survivors who have not had their needs addressed previously will now have their needs addressed,” said Ruth Glenn, president and CEO of the National Coalition Against Domestic Violence, but there is more to be done.",
    "The Violence Against Women Act is a landmark 1994 law that created grant programs for states to provide services and housing to abuse victims and training to improve the legal system’s response to domestic violence.",
    "Though the administration did not meet that deadline, Biden signed the bill Tuesday and advocates, including Jolie, attended a Wednesday event to mark its passage, nearly a decade after its last reauthorization.",
    "Called a “momentous achievement” for survivors of domestic and sexual violence by Sen. Dick Durbin, D.-Ill., one of the bipartisan bill’s sponsors, the new version of VAWA will go into effect in later this year.",
    "The updated act includes an addition called Kayden’s Law, named after a seven-year-old Pennsylvania girl killed by her father in a murder-suicide during an unsupervised visit in 2018.",
    "It was renewed three times since its passage, each time with stronger protections for victims, before expiring in 2018 (Congress continued to fund its programs in the years since).",
    "President Joe Biden vowed during his campaign to enact the reauthorized bill in the first 100 days of his presidency, and the House passed a version of it last year.",
    "“This is still a public health crisis, particularly when we’re talking about domestic violence and child abuse.”\nFor Jolie, the fight doesn’t stop with this bill.",
    "New grants and funding will begin being distributed by the VAWA programs administered by the Department of Justice and Health and Human Services.",
    "Her activism is also focused on displaced families around the world, from Ukraine to Yemen, where she was on a humanitarian trip 10 days ago.",
    "Jolie’s own split and custody battle with ex-husband Brad Pitt gave her experience with the family court system.",
    "“It all does tie together if we see all people as equal and we see all people as deserving of rights.”",
    "\"We’re building a world, and a legal system, that puts survivors first,” Durbin said.",
    "Watch the interview tonight on “NBC Nightly News with Lester Holt” at 6:30 p.m.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "“My children’s health is my priority at this moment,” she added.",
    "“We really have to do more in that bigger picture,” Jolie said.",
    "ET / 5:30 p.m. CT (or check your NBC station)."
  ]
}