{
  "id": 3112,
  "mediaId": 2523,
  "date": "2022-03-07",
  "headline": "Marcus Mariota, Casey Hayward, Raiders Free Agents' Projected Contracts",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/505/575/hi-res-b7b8506b5571763dfc5401f10597f76b_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2953991-marcus-mariota-casey-hayward-raiders-free-agents-projected-contracts",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristopher Knox",
  "authorUrl": "https://bleacherreport.com/users/6e186227-f9b2-4450-af0d-8f62243323ee",
  "termIds": [
    0
  ],
  "sentences": [
    "And while they do have a handful of key contributors slated to hit the open market, they should have enough flexibility to keep their critical pieces and make some valuable additions ahead of the 2022 NFL draft.",
    "Bringing back Wright on a prove-it deal could allow the Raiders to spend more money on run-stopping upgrades while gambling on Wright's ability to return to form.",
    "Contract projection: One year, $9 million, fully guaranteed\nCasey Hayward\nMariota was a key backup in 2021, but cornerback Casey Hayward was a valuable starter.",
    "This will affect Hayward's chances of landing a lucrative long-term deal, even though he's listed as Pro Football Focus' 25th-best free agent.",
    "With this in mind, let's examine some of the Raiders' top 2022 free agents and the contracts they are likely to receive on the open market.",
    "After joining the Raiders on a two-year, $17.6 million deal in 2020, Mariota should be looking at a similar annual salary this offseason.",
    "PFF projects a one-year, $2.5 million deal for Wright, and that's probably right around what an aging two-down linebacker should warrant.",
    "Because some teams will likely view Mariota as at least a bridge starter, he's likely to command more than typical backup money.",
    "This feels a little low on the starter market after Andy Dalton and Ryan Fitzpatrick each received a $10 million deal in 2021.",
    "Mariota, who spent time on injured reserve with a quad issue this past season, should be among Las Vegas' top backup targets.",
    "Mariota, the second overall pick in the 2015 draft, has 61 starts on his resume and a 29-32 win-loss record as a starter.",
    "The negative with Hayward is that he will turn 33 at the start of the season and is entering the back end of his career.",
    "While a one-year deal is probably fair given Hayward's age, expect him to still command a mid-level starter's salary.",
    "The two-time Pro Bowler started all 17 games for Las Vegas and played a whopping 94 percent of the defensive snaps.",
    "Pro Football Focus, for example, projects Mariota to receive a one-year deal worth $8 million, fully guaranteed.",
    "That feels more in line with what Mariota may want from Las Vegas if he's willing to stay in the backup role.",
    "The Raiders are projected to have $20.6 million in cap space, which puts them in the top half of the league.",
    "Contract projection: One year, $3.5 million, $1 million guaranteed\nCap and contract information via Spotrac.",
    "He's a valuable understudy to starter Derek Carr but may be viewed as a potential starter by other teams.",
    "Las Vegas isn't going to keep everyone, though, and has some tough decisions to make in the coming days.",
    "He was a valuable rotational piece against the run last season but struggled to stand out in coverage.",
    "Hayward was effective too, finishing with nine passes defended and an opposing passer rating of 91.9.",
    "However, he may be interested in getting a chance to reestablish himself as a starter elsewhere.",
    "While Hayward is on the older side, he's a starting-caliber corner and a durable one at that.",
    "The Las Vegas Raiders have a good opportunity to reload and make another playoff run in 2022.",
    "While that's going to limit his market in free agency, it could help the Raiders financially.",
    "Factors like past production, health, age, upside and positional value will be considered.",
    "Marcus Mariota\nA deal with backup quarterback Marcus Mariota could be tricky to navigate.",
    "Wright is one of the more interesting players on whom Las Vegas must make a decision.",
    "A complete list of Las Vegas' impending free agents can be found at Spotrac.",
    "Wright played 37 percent of the defensive snaps and had 51 total tackles.",
    "Contract projection: One year,$8 million, $5.5 million guaranteed\nK.J.",
    "Hayward has missed just two games since the start of the 2014 season.",
    "Las Vegas, meanwhile, needs to bolster its 19th-ranked run defense.",
    "However, he also allowed an opposing passer rating of 115.4.",
    "At 32, Wright's time as an every-down player is likely over.",
    "An incentive-laden contract would make the most sense here.",
    "PFF projects a one-year, $6.5 million deal for Hayward.",
    "Advanced statistics from Pro Football Reference.",
    "Again, this feels low.",
    "Wright\nLinebacker K.J.",
    "B/R Recommends"
  ]
}