{
  "id": 3116,
  "mediaId": 2586,
  "date": "2022-03-08",
  "headline": "Bills Getting Interest from ‘Big-Name Free Agent,’ Insider Says",
  "image": "https://heavy.com/wp-content/uploads/2021/12/Bills-Sidelines-e1638494172766.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-interest-big-free-agent/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1288,
    1331,
    1561,
    1638,
    3320,
    68,
    160
  ],
  "sentences": [
    "#BillsMafia\n— Buffalo Bills (@BuffaloBills) March 8, 2022\nPrior to the news that Beasley was pursuing a trade, The Athletic’s Joe Buscaglia suggested that the Bills could ask Beasley to restructure his contract instead, which remains a possibility if they can’t find a willing trade partner.",
    "It should have been in the 220s if we hadn’t had the setback with Covid.”\nBills Find Some Breathing Room\nBeane had hinted earlier this year that the team could make some moves to find cap relief, and one of those came on Tuesday.",
    "So if the finances work out, it wouldn’t surprise me to see someone like that signed by the Bills.”\nBreer didn’t identify the player by name, but anyone with a high price tag could be out of reach for the Bills this year.",
    "Almost 10 years ago to the day, the Buffalo Bills scored one of the biggest free-agent signings in their history, shocking the rest of the league by landing pass-rusher Mario Williams after an extended visit to Buffalo.",
    "Though the Bills have made it clear that they won’t be making any splashy moves, SI.com’s Albert Breer reported this week that a veteran has reached out to the Bills with interest in coming to Buffalo.",
    "“I’m told at least one big-name veteran reached out to the Bills (it’s usually the other way around) to show his interest in them and set up a meeting for his agent at the combine last week.",
    "As The Buffalo News noted, Bills general manager Brandon Beane confirmed on Tuesday that the team is currently $6.6 million over the 2022 salary cap, which is set at $213.844 million.",
    "Brandon Beane: Bills about $6.6 million over 2022 salary cap as new league year approaches https://t.co/3KTWqhnvxy\n“I need a loan,” Beane joked during an appearance on WGR 550.",
    "Bills Become Top Destination\nIn his Monday Morning Quarterback column, Breer wrote that the Bills could have the insider track for at least one coveted free agent.",
    "“The Bills could offer Beasley a base salary reduction to get his cap hit down to the range of $4.5 million to $6 million and fully guarantee the salary.",
    "At his age, Beasley is unlikely to get more on the open market — in total money and guaranteed money — than what the Bills would offer.”",
    "A decade later, the situation has changed dramatically and the Bills are now the frontrunner for some of the league’s top free agents.",
    "Klein, which NBC Sports’ Pro Football Talk noted will save $5.2 million against the cap while leaving $400,000 in dead money.",
    "The Bills could have some other moves to create cap space, including trading or releasing wide receiver Cole Beasley.",
    "“Beasley is a good player, but he should not account for a nearly $8 million cap hit,” Buscaglia wrote.",
    "“The Bills—of Buffalo—are becoming a bit of a destination for veteran free agents,” he wrote.",
    "The slot receiver asked the team to seek a trade, Beane confirmed last week.",
    "“We’ve got some moves we’ve got to get done between now and next week.",
    "The cap went up this year, but we’re still catching up.",
    "… I wish I had more room, but this is where we’re at.",
    "… We’ve got work to do, as a lot of teams do.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "You have to, so we’ll get that done.",
    "The team released linebacker A.J.",
    "“We’re in the red right now.",
    "We’ve had conversations.",
    "We’ll get there in time.",
    "We’ve released LB A.J.",
    "We’ve got some ideas.",
    "Klein."
  ]
}