{
  "id": 3124,
  "mediaId": 2586,
  "date": "2022-03-17",
  "headline": "Bills Receivers Share Emotional Goodbyes With Cole Beasley",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Cole-Beasley-2-1-e1647561899821.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-wr-goodbye-beasley/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "Beasley’s Teammates Share Support\nNot long after Beasley’s official release, fellow receiver Isaiah McKenzie took to Twitter to repost the team’s announcement share a fist and heart emoji, showing some love and solidarity with his fellow receiver.",
    "Both saw their roles in the offense expand as the season went on, with Davis setting NFL history with eight receptions for 201 yards and a postseason record four touchdowns in the team’s postseason loss to the Kansas City Chiefs.",
    "As ESPN’s Alaina Getzenberg reported, the Bills were unable to find a trade partner for Beasley and opted to take the $6.1 million in cap relief that comes through releasing him.",
    "McKenzie came back strong afterward, posting a career-best 11 catches for 125 yards against the New England Patriots while Beasley was out with a COVID-19 infection.",
    "The Bills announced on Thursday that Beasley had been released, an ending that many had predicted after Beasley asked the team for permission to seek a trade.",
    "Beasley came to the Bills in 2019 and has been an important part of the team’s rise to Super Bowl contender, becoming one of the league’s top slot receivers.",
    "— NFL (@NFL) March 17, 2022\nAs Nick Fierro of SI.com’s Bills Central noted, some questioned why it took the Bills so long to treat Davis like a true No.",
    "Beasley’s Departure Could Bring Opportunity\nThough they may be sad to see him go, both McKenzie and Davis could stand to gain from Beasley’s departure.",
    "https://t.co/ttFviepHJo\n— Isaiah McKenzie (@_IsaiahMcKenzie) March 17, 2022\nWide receiver Gabriel Davis also left a message of support for Beasley.",
    "Beasley responded to Davis in an Instagram story, saying the two would remain close and predicting that Davis had a bright career ahead of him.",
    "Cole Beasley’s career with the Buffalo Bills may be over, but the friendships he developed with fellow receivers apparently will live on.",
    "He also told McKenzie that it was great to see how much he had grown through adversity, appearing to hint at his mid-season benching.",
    "Shortly after the team announced Beasley’s release, some of his teammates took to social media to say their goodbyes.",
    "“It was definitely a little challenge for me this year to not be able to play as much as I think I should have.",
    "“I just can’t do nothing but thank God for the opportunity that I had that I was able to execute,” Davis said.",
    "He had a career-high 967 yards in 2020, though saw a bit of a dropoff last season with 693 yards last season.",
    "“Thank you for the wisdom, encouragement, laughs, and just being a helluva (sic) teammate/brother to me.",
    "After the game, Davis said he was grateful for the opportunity to get the chance to play a bigger role.",
    "And my name was called a lot and I’m continuing to make the plays when they’re coming to me.",
    "He shared a longer message on Instagram, thanking Beasley for their time together.",
    "“You know, whenever any of our numbers are called, we have to make the play.",
    "But at the end of the day, it all worked out the way it should have.”",
    "The latest Bills news straight to your inbox!",
    "Love you,” McKenzie wrote, via Syracuse.com.",
    "Join the Heavy on Bills newsletter here!",
    "2 receiver.",
    "?????"
  ]
}