{
  "id": 3129,
  "mediaId": 2586,
  "date": "2022-03-13",
  "headline": "Bills Could Land Pro Bowl RB for an Affordable Price: Insider",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Saquon-Barkley-2-e1647203935590.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-land-barkley-affordable-price/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1888,
    2331,
    2724,
    3057,
    3583,
    160,
    707
  ],
  "sentences": [
    "“You can never have enough of that.”\nSaquon Barkley over his last 2 seasons…\n15 games\n627 rush yards (3.5 YPC)\n323 receiving yards\n4 TDs pic.twitter.com/Hfh7lkKdCv\n— NFL Stats (@NFL_Stats) March 3, 2022\nThe 25-year-old Barkley is in the final year of his contract, and is coming off the worst full season of his career.",
    "Bills Could Land Top Back\nGraziano noted that New York Giants running back Saquon Barkley is not likely to stay with the team in the coming season, and new general manager Joe Schoen indicated at the combine that the Giants could be willing to trade him.",
    "While the Bills have had one of the league’s top passing attacks for the past two seasons, their running game has often been lacking and it was not until the conclusion of the last season that Devin Singletary established himself as a primary back.",
    "While he added another 263 receiving yards and two receiving touchdowns, the lack of production raised concern that Barkley may not be able to match his breakout rookie season when he rushed for 1,307 yards with 11 touchdowns.",
    "Now you can go compete with Cincinnati, you can go compete with Kansas City.”\nBarkley Could Be Strong Fit for Buffalo\nThe Bills have already indicated that they could be in the hunt for a player like Barkley.",
    "After Buffalo lost to the Kansas City Chiefs in two consecutive playoffs, Bills general manager Brandon Beane said he hopes to land more players with explosive speed who can turn short passes into big gains.",
    "Appearing on ESPN’s “Get Up” earlier this month, Mike Tannenbaum suggested that the Pro Bowl running back could be a strong addition to the Bills’ offense and another weapon for Josh Allen.",
    "Because the Giants will need to dump salary this offseason, Graziano speculated that Barkley could be acquired for an affordable price and pegged the Bills as a potential frontrunner.",
    "Singeltary had a career-best season for the Bills in 2021, rushing for 870 yards and seven touchdowns while adding another 40 catches for 228 yards and one receiving touchdown.",
    "After splitting carries with Zack Moss for much of the season, the Bills leaned more heavily on Singletary in the final stretch of the season and through the playoffs.",
    "ESPN’s Dan Graziano speculated that the Bills could make a significant upgrade, grabbing a former Pro Bowler who could be in for a change of scenery.",
    "I mean, you’d love to have a guy … that you can get the ball to and he can turn a 5-yard pass into a 60-yard touchdown,” Beane said, via ESPN.",
    "pic.twitter.com/sD7crWCUGl\n— Get Up (@GetUpESPN) March 2, 2022\n“They’re sort of in the ‘one player away’ mode,” Tannenbaum said.",
    "The Giants’ hope is that a contending team with a need for one more explosive player on offense (Buffalo or Arizona?)",
    "The Buffalo Bills could add a major boost to their running game at a very affordable price, an insider says.",
    "“And while his $7.2 million salary isn’t the top target in New York’s cap-saving efforts, it would help.",
    "He rushed for 593 yards on 3.7 yards per carry in 2021, scoring two touchdowns.",
    "\"Could you imagine Josh Allen, a healthy Saquon Barkley, and Stefon Diggs?\"",
    "There are others who see the Bills as a potential landing spot for Barkley.",
    "Could you imagine Josh Allen, a healthy Saquon Barkley, and Stefon Diggs?",
    "@RealTannenbaum wants to see Saquon Barkley play for the Bills ??",
    "might offer a midround pick for Barkley,” Graziano wrote.",
    "The latest Bills news straight to your inbox!",
    "“To me, he makes all the sense in the world.",
    "“We mentioned [Chiefs receiver] Tyreek Hill.",
    "Join the Heavy on Bills newsletter here!",
    "."
  ]
}