{
  "id": 315,
  "mediaId": 2710,
  "date": "2022-04-22",
  "headline": "Could a ‘hydrogen hub’ energize Utah and the West to a cleaner future?",
  "image": "https://www.sltrib.com/resizer/z9lsOTwSvkaCt7TTPb7dO75kyPY=/1200x630/cloudfront-us-east-1.images.arcpublishing.com/sltrib/FTDF7WB5IRAV7HFIYQ3HH3JUYY.JPG",
  "link": "https://www.sltrib.com/renewable-energy/2022/04/22/could-hydrogen-hub/",
  "mediaOutlet": "The Salt Lake Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Fitzpatrick",
  "authorUrl": "https://www.sltrib.com/author/tfitzpatrick",
  "termIds": [
    3237,
    4788,
    499,
    970,
    1129,
    4820,
    4915,
    5374,
    5408
  ],
  "sentences": [
    "Here’s what the four states told the DOE:\n“We believe “close proximity” should not be defined by geographic distance, but rather by the ability to economically produce and efficiently move clean hydrogen – and hydrogen-derived products – throughout the region and more broadly.”\nAlso noteworthy, the four states are at the heart of western fossil fuel production, where rural communities are struggling to identify a new path.",
    "“IPP will work with SRERC in solving problems specific to hydrogen conversion at a natural gas generating facility, such as grid resource and hydrogen production optimization, as well as fuel cell dynamics,” said the letter from Jon Finlinson, president and COO of Intermountain Power Service Corporation.",
    "“That is storing renewable energy in the form of green hydrogen in the spring months, where it is produced in excess due to low energy market requirements,” said Rob Webster, chief strategy officer for Magnum Development and ACES Delta, which owns the salt domes and is partnering with IPA.",
    "Spencer Cox joined governors from Colorado, New Mexico and Wyoming to announce their pursuit of a federal “hydrogen hub.” The U.S. Department of Energy has allocated $8 billion to establish four such hubs as part of the Infrastructure Investment and Jobs Act passed last year.",
    "“Clean hydrogen is key to cleaning up American manufacturing and slashing emissions from carbon-intensive materials like steel and cement while creating good-paying jobs for American workers,” U.S. Secretary of Energy Jennifer M. Granholm said when announcing the initiative.",
    "“With hydrogen there are some uphill struggles, but the beauty of it is the low emissions and the sustainability.”\nThe colors of hydrogen\nHydrogen is an invisible gas, but those who work with hydrogen have developed a color spectrum to identify how it was produced.",
    "Lynn Barney, co-founder and chairman of Renewable Innovations, says the rise of electric cars is happening faster than the electric grid can keep up, particularly when rapid charging requires more powr than is available in most convenience stores and gas stations.",
    "“Today, we have heavy-duty class-8 hydrogen trucks with a range of up to 500 miles, and in 2024 we will have trucks that can go up to 900 miles without refueling.”\nAnd, importantly for the Wasatch Front, a hydrogen-fueled truck does not contribute air pollution.",
    "That train is being built in Switzerland, but “future orders for hydrogen trains in the U.S. are expected to be manufactured here in Utah,” said Matt Sibul, director of sales and program development at Stadler’s northwest Salt Lake City plant.",
    "The Intermountain Power Agency (IPA) is working to convert its coal-fired power plant near Delta into a major source of renewable electricity for Los Angeles, powering the plant with “green” hydrogen produced from solar and wind power.",
    "So reducing the cost of green hydrogen is a crucial factor, and the federal government’s stimulus is intended to build out infrastructure to provide enough economies of scale for a green hydrogen industry to survive on its own.",
    "Green hydrogen is made by using clean electricity from surplus renewable energy sources, such as solar or wind power, using an electrochemical reaction to split water into hydrogen and oxygen without producing carbon dioxide.",
    "The Swiss-based company is building a hydrogen-fueled passenger train that will run from Redlands to San Bernardino, and eventually to downtown Los Angeles, adding nothing but water vapor to Southern California’s gritty air.",
    "The coming refueling station at Utah Inland Port, which is promising to be the cleanest port in the nation, is part of something called Project Beehive, an effort to convert heavy vehicles in Utah to cleaner fuels.",
    "That hydrogen will be stored in a massive underground salt dome below the Millard County power plant so it can be converted into electricity when the sun isn’t shining and the wind isn’t blowing, even months later.",
    "Another Utah company, Renewable Innovations, is focused on providing mobile and stationary power systems to provide hydrogen-fueled electric power where there isn’t a practical way to connect to the power grid.",
    "The research center, located just outside Orangeville, is intended to identify and develop technologies that could help Emery County maintain its economy as the nation moves away from coal-fired electricity.",
    "With the DOE soon to release a detailed request for proposals, the four states have formed the “Western Inter State Hydrogen Hub” (WISHH) with the intent of having facilities in all four states.",
    "The four states’ letter to the Energy Department specifically mentions “favorable geology to support underground storage” as an asset that should be included in the DOE’s hub criteria.",
    "But the energy stored in a molecule of two hydrogen atoms – energy that can be liberated without harmful emissions – has made hydrogen a tempting air-quality solution for decades.",
    "“This renewable energy can then be returned to the market in a variety of ways during months where requirements are peaking.”\nBut it will take years for IPA to get there.",
    "(Chris Samuels | The Salt Lake Tribune) A mobile power unit that uses hydrogen for energy is on display at Renewable Innovations in American Fork, Friday, April 15, 2022.",
    "Renewable recently announced a collaboration with General Motors to put GM’s hydrogen fuel cells in the company’s electric-vehicle charging stations and other products.",
    "Salt Lake City-based Lancer works with companies to convert their truck fleets from diesel to compressed natural gas, but hydrogen is a growing part of the business.",
    "Blue hydrogen is produced mainly from natural gas, using a process called steam reforming, which brings together natural gas and heated water in the form of steam.",
    "This story is part of The Salt Lake Tribune’s ongoing commitment to identify solutions to Utah’s biggest challenges through the work of the Innovation Lab.",
    "Jeremy Pearson, who was recently hired to run the research center, is waiting to see more specifics on the hub plan, but he sees possibilities beyond IPP.",
    "Combining hydrogen and natural gas is new technology, and IPA says it is seeking help with that from Emery County’s San Rafael Energy Research Center.",
    "The company has a truck-mounted version for charging multiple cars, which they recently demonstrated at an off-road rally that included electric cars.",
    "Gray hydrogen is created from natural gas, or methane, using steam methane reformation but without capturing the carbon dioxide made in the process.",
    "Hydrogen requires higher pressures, meaning stronger storage tanks, but unlike fossil fuels it’s not an environmental threat if it leaks.",
    "The effort includes Bayotech, a company that makes small-scale hydrogen production facilities that could be deployed at fueling stations.",
    "And Sibul from Stadler Rail said the transit district buying their hydrogen train required that the train run all day without refueling.",
    "It also is a highly flammable material that requires high-pressure storage, and it has to get past public perceptions over safety.",
    "Powering trucks and trains\nHydrogen fuel cells have been around for years and were once seen as a promising clean-car technology.",
    "Reyes from Lancer Energy credits the development of lightweight carbon-fiber tanks with making hydrogen trucks more practical.",
    "Tim Fitzpatrick is The Salt Lake Tribune’s renewable energy reporter, a position funded by a grant from Rocky Mountain Power.",
    "The output is hydrogen – but also carbon dioxide, which must be trapped and stored for the hydrogen to be considered blue.",
    "Gray hydrogen is currently the most common form of hydrogen, and it is widely used in a variety of industrial processes.",
    "Bigger vehicles with longer trips will be hydrogen’s niche, says Free Reyes, executive vice president at Lancer Energy.",
    "(Stadler Rail) Artist's rendering shows a hydrogen-powered train being built for Southern California by Stadler Rail.",
    "But to get into the nation’s energy mainstream, hydrogen has to overcome challenges to producing and transporting it.",
    "Green hydrogen, which is produced without generating any carbon dioxide, is still more expensive and less common.",
    "It burns clean or it can be converted to electricity in fuel cells, with water vapor being the only byproduct.",
    "It’s flammable, and it’s stored under pressure, but the same can be said for other fuels, including propane.",
    "Over time, the plan is to reduce the natural gas as more hydrogen from renewable sources becomes available.",
    "But he says the tanks will actually outlast the trucks and will be tested and redeployed in new trucks.",
    "The most economical and widely used way to make hydrogen is to produce it from methane, a fossil fuel.",
    "Bayotech’s technology is lower carbon than traditional hydrogen production, but it’s not carbon free.",
    "Still, transition to any hydrogen power makes it easier to get all the way to carbon-free hydrogen.",
    "Now coal-driven, it may one day be a sun and wind-driven, hydrogen-fueled clean-energy powerhouse.",
    "“The advantage we offer with hydrogen is we don’t have to wait for the grid upgrade,” said Barney.",
    "Black or brown hydrogen uses black coal or lignite (brown coal) in the hydrogen-making process.",
    "A cave full of fuel\nHydrogen is found everywhere on earth, but it’s tied up in other materials.",
    "The Tribune retains all control over editorial decisions independent of Rocky Mountain Power.",
    "Combined with hydrogen storage, could those same communities one day see a brighter future?",
    "So can four states that collectively cover 11% of the nation really be considered a “hub”?",
    "First it is converting the coal plant to burn a combination of natural gas and hydrogen.",
    "The first element on the periodic table, hydrogen is just a single proton and electron.",
    "Hydrogen is less “energy dense” than natural gas, so the tanks must be higher pressure.",
    "Nuclear-produced hydrogen can also be referred to as purple hydrogen or red hydrogen.",
    "But lithium batteries have outpaced fuel cells as the alternative for passenger cars.",
    "They also have stationary units for rapid charging stations, all powered by hydrogen.",
    "Energy storage and long-haul transportation could be powered by the littlest atoms.",
    "And the DOE points out that because it’s lighter than air, leaks dissipate quickly.",
    "“We have to make absolutely sure the tanks are very strong.”\nCan we make enough?",
    "A gray hydrogen-fueled system can run on green hydrogen without any alterations.",
    "It must be created through a variety of processes, some cleaner than others.",
    "Those processes take energy, but much of that energy can be later retrieved.",
    "[Subscribe to our newsletter here]\nHydrogen is getting the hype these days.",
    "Black and brown hydrogen are the least climate-friendly forms of hydrogen.",
    "Pink Hydrogen is generated through electrolysis powered by nuclear energy.",
    "That’s also why Stadler Rail is getting into the hydrogen train business.",
    "And in coal-driven Emery County, they want to help with that future.",
    "To do that, the train carries a large, high-pressure hydrogen tank.",
    "Sibul said the system had to go through rigorous safety testing.",
    "Utah may someday have the largest hydrogen battery in the world.",
    "There is very little fuel-ready hydrogen to be tapped or mined.",
    "In that respect, the IPA project outside Delta may be a model.",
    "From a clean energy standpoint, green hydrogen is the ideal.",
    "“Weight is 100% why hydrogen is a major factor,” says Reyes.",
    "That includes looking opportunities around hydrogen.",
    "The states also have an abundance of sun and wind.",
    "Future hydrogen trains will be built in Utah.",
    "In other words, hydrogen works as a battery.",
    "Does it have the hope to match?",
    "Relatively speaking, yes.",
    "In February, Utah Gov.",
    "Why a hydrogen hub?",
    "Is hydrogen safe?"
  ]
}