{
  "id": 3150,
  "mediaId": 2572,
  "date": "2022-03-08",
  "headline": "Lawmakers urge Biden to work with NATO allies to provide aircraft to Ukraine to 'defend and secure its skies'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Russia-Ukraine-War-No-Fly-Zone-2.jpg",
  "link": "https://www.foxnews.com/politics/lawmakers-biden-nato-allies-ukraine-aircraft",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooke Singman",
  "authorUrl": "https://www.foxnews.com/person/s/brooke-singman",
  "termIds": [
    0
  ],
  "sentences": [
    "US, POLAND IN TALKS TO HELP UKRAINE ACQUIRE WARPLANES\nThe letter was led by Himes, and signed by Democratic congressmen, including Reps. Adam Schiff, Raja Krishnamoorthi, Adriano Espaillat, Tom Malinowski, Eric Swalwell, Brad Sherman and Jackie Speier, and Republican congressmen, including Reps. Brad Wenstrup, Chris Stewart, Mike Turner, Brian Fitzpatrick, Andy Barr, Brian Mast, Burgess Owens and Mike Waltz.",
    "\"In order to ensure NATO retains the necessary capabilities, we urge you to provide our NATO allies who transfer Soviet- era fighter jets to Ukraine other airframes, such as the F-16, to bolster their own defenses,\" they wrote, adding that by working to transfer aircraft to Ukraine \"swiftly,\" the U.S. and NATO allies \"can continue to demonstrate our staunch support for Ukraine’s democracy and sovereignty.\"",
    "Zelenskyy, on Sunday, also called for a no-fly zone, in a video message posted to Twitter bearing subtitles in English that stated: \"We repeat everyday: ‘Close the sky over Ukraine!’\"\nUkrainian Ambassador to the U.S. Oksana Markarova espoused the same message on \"Fox News Sunday,\" in response to the Biden administration stating that it would not be imposing a no-fly zone.",
    "\"We stand ready to assist you in any way necessary to ensure our NATO allies are able to facilitate a transfer of aircraft to Ukraine rapidly and efficiently,\" they wrote, adding that they \"appreciate\" the president’s \"continued efforts and attention to providing Ukraine with the resources it needs to protect its sovereignty and freedom.\"",
    "\"In light of reports that you are exploring the option of working with Poland to transfer Soviet-era aircraft to Ukraine, we want to express our support for this effort and encourage you to implement this policy without further delay, including by backfilling Poland’s aircraft supply to ensure their security.\"",
    "\"That is why it is even more essential that we work with our NATO allies – including Poland, Romania, Slovakia and Bulgaria – who are in possession of the Soviet-era jets familiar to the Ukrainian Air Force and that are essential assets for Ukrainians working to defend their sovereign territory,\" they wrote.",
    "A bipartisan group of lawmakers urged President Biden on Tuesday to work with NATO allies to provide Ukraine additional aircraft to \"defend and secure its skies,\" amid calls from Ukrainian President Volodymyr Zelenskyy to create a no-fly zone over the country as Russia continues its invasion for a 13th day.",
    "Ukraine’s calls for a no-fly zone come as the Biden administration and both Democratic and Republican lawmakers have made clear they are firmly against such a move, saying it would be viewed by Russia as an escalation – with some warning it could be the beginning of \"World War III.\"",
    "Last week, the Biden administration ruled out setting up a no-fly zone for Russian aircraft over Ukraine, with senior defense officials saying enacting one would put the United States \"in the fight\" – as President Biden has maintained that U.S. military will not fight in Ukraine.",
    "Himes and the House lawmakers reflected on Zelenskyy’s meeting with members of Congress over the weekend, when he described \"the grim and distressing situation facing the people of Ukraine following Russia’s unprovoked and unjustified invasion of Ukraine’s sovereign territory.\"",
    "The lawmakers continued by telling Biden they \"understand that imposing a no-fly zone in Ukraine at this time raises concern about a possible direct NATO confrontation with Russian forces, which President Putin could use as an excuse to further escalate the conflict.\"",
    "\"We commend you for the support you have provided to Ukraine and the sanctions and measures implemented swiftly, in coordination with our allies and partners, in response to Russia’s aggression so far,\" they wrote, adding, though, that \"there is more work to do.\"",
    "But on Tuesday, Rep. Jim Himes, D-Conn., led a group of more than 50 lawmakers – both Democrats and Republicans – in encouraging the Biden administration to continue its negotiations with Poland to help in \"rapidly\" sending aircraft to Ukraine.",
    "The lawmakers said Ukraine \"lost significant numbers of aircraft\" in the early days of the war, but said Ukrainian pilots \"have continued to courageously provide air support for ground troops and defend Ukrainian territory.\"",
    "(AP Photo/Alik Keplicz, File)\n\"However, the Ukrainian Air Force requires additional aircraft to secure its skies and protect Ukrainian civilians, who continue to be disproportionately targeted by Russian forces,\" they wrote.",
    "We are awaiting the decision, clearing of the sky, either by the forces that you have or you give us the fighter planes of anti-aircraft defense that you have and that will provide the needed strength to us,\" he said.",
    "The aid would go for additional humanitarian, security and economic assistance in Ukraine and the neighboring region in the coming days and weeks, according to the Office of Management and Budget (OMB).",
    "Lawmakers noted that Poland has \"voiced concern about transferring these critical assets without backfill, which could degrade their own defensive capabilities and readiness as well as NATO’s overall.\"",
    "Ukraine is not a member of NATO and therefore not subject to the Article V provision of the NATO alliance that says when one member country is attacked all member countries will take action to assist.",
    "Air Force via AP)\nCiting comments made by Secretary of State Antony Blinken from over the weekend, the lawmakers said the U.S. \"fully backed any member of NATO sending fighter planes to Ukraine.\"",
    "\"So, I think, you know, the events of the past 11 days clearly shows that we have to act together and that Russia can attack anyone being totally unprovoked like they did with Ukraine.",
    "\"We write today urging you to continue to work with our NATO allies to provide the Ukrainian Air Force with the additional aircraft needed to defend and secure its skies,\" they wrote.",
    "The letter comes after Zelenskyy, on Monday, again called for the West to create a no-fly zone over Ukraine, as Russia continues its unprovoked and brutal invasion of the country.",
    "UKRAINE URGES WORLD TO 'STEP UP,' IMPOSE NO-FLY ZONE, WHILE US LAWMAKERS WARN THIS WOULD MEAN 'WORLD WAR III'\nA no-fly zone is \"just not going to happen,\" the official added.",
    "Zelenskyy said the Ukrainian government is \"already working on how to restore our country after the victory, how to provide strength to the country while we are fighting.\"",
    "The Biden administration has been weighing a deal with Poland to send U.S. warplanes to Warsaw to replace any Soviet-era fighter jets the NATO country sends to Ukraine.",
    "Zelenskyy slammed the decision, but NATO Secretary General Jens Stoltenberg warned that having alliance planes over Ukrainian airspace could spark a new world war.",
    "Zelenskyy said a no-fly zone is \"not just for Ukraine but for yourselves, too, in order to prove that humanity will win as fast as it can.\"",
    "Markarova offered a reminder that Russia attacked Ukraine unprovoked, and that if this could happen to Ukraine, it could happen to others.",
    "The Biden administration is requesting at least $10 billion in new money to provide aid to Ukraine amid Putin's war against the nation.",
    "Pleading with Western allies Monday, Zelenskyy asked: \"How many deaths and losses are still needed to secure the sky over Ukraine?\"",
    "The U.S. has not yet signed off on the deal, over concerns it would be seen as an escalation, a source told Fox News.",
    "NATO also rejected a Zelenskyy request for a no-fly zone over Ukraine to provide air cover for the Ukrainian people.",
    "\"What is the difference between peaceful people in Kharkiv and Mykolaiv and those in Hamburg and Vienna?",
    "CLICK HERE TO GET THE FOX NEWS APP\n\"So if this situation, you know, happened to Ukraine, who is safe?",
    "\"We have watched the Kremlin purposefully strike hospitals, schools and residential areas.\"",
    "You can reach her at Brooke.Singman@Fox.com or @BrookeSingman on Twitter.",
    "Brooke Singman is a Fox News Digital politics reporter.",
    "What democracy can feel safe right now?\"",
    "So it's time for all of us to step up.\"",
    "\"This is unacceptable,\" they added.",
    "Markarova wondered.",
    "Jacob Albers/U.S.",
    "(Tech.",
    "Sgt."
  ]
}