{
  "id": 3158,
  "mediaId": 2586,
  "date": "2022-03-17",
  "headline": "Bills WR Works Out With QB Colin Kaepernick in Texas",
  "image": "https://heavy.com/wp-content/uploads/2022/03/pjimage-4-3.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/marquez-stevenson-colin-kaepernick-qb/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Bicks",
  "authorUrl": "https://heavy.com/author/emilybicks/",
  "termIds": [
    0
  ],
  "sentences": [
    "Backup QB option for the Bills off the board: https://t.co/KnjAwAcyGF\n— WGR 550 (@WGR550) March 16, 2022\nChad Henne is returning to the Kansas City Chiefs as Patrick Mahomes backup, former Broncos quarterback Teddy Bridgewater intends to sign a one-year deal to be the backup QB for the Miami Dolphins, per ESPN‘s Adam Schefter, and former Washington Commanders backup Kyle Allen, who was rumored to be a strong option for the Bills due to his close relationship with Josh Allen, is heading to the Houston Texans.",
    "The Backup QB Pool Is Quickly Drying Up\nHey @BuffaloBills, I think we still need a backup QB… https://t.co/iKm4dUcUtV\n— Brad Shapiro (@btshapir) March 17, 2022\nWhile the Bills have made a flurry of roster moves over the past week, and nearly broke the Internet after making the surprise announcement that they were signing two-time Super Bowl champion outside linebacker Von Miller, they haven’t found a replacement for Trubisky.",
    "— Circling The Wagons Podcast (@CTWpod) March 10, 2022\nThe opportunity to closely with superstar quarterback Josh Allen, who’s currently ranked as the No.3 best quarterback in the league, per NFL.com, and work with Bills’ offensive coordinator Ken Dorsey, who was a huge part of developing Allen’s talent, will be an incredibly appealing opening for any quarterback hoping to one day reclaim a starting role.",
    "Stevenson, who turns 24 next week, captioned the photo album by using a lyric from Lil Durk’s “Started From” track: “Daddy was doing time, couldn’t sit outside and wait for em…”\nKaepernick, who hasn’t taken a snap in the NFL in six years, announced last week that he’s “still working” toward an NFL comeback.",
    "The Buffalo Bills roster is going through heavy restructure heading into the 2022 NFL season, however, one wide receiver/kick returner was already locked in to return, Marquez “Speedy” Stevenson, who signed a four-year rookie contract in Mary 2021.",
    "— Jenna Harner (@JennaHarner11) March 17, 2022\nOn March 14, Trubisky signed a two-year $14.25 million contract worth up to $27 million in incentives to join the Pittsburgh Steelers as their “expected” starter for the 2022 NFL season.",
    "He would be a great fit for teams with QB vacancies to fill who want to win a Super Bowl.” https://t.co/VAXfKlZ6E4\nThe former San Francisco 49ers starter also shared a video of his workouts with Stevenson on Twitter.",
    "Man, it felt good to be out there!”\nThe Footwork King, whose real name is Rischad Whitfield, invited Kaepernick to Houston to work at Strake Jesuit High School’s football stadium, as reported by MySanAntonio.com.",
    "However, the Houston alum is making sure he stays fit this offseason and shared a series of photos of himself working out on Instagram, catching balls from none other than former NFL quarterback Colin Kaepernick.",
    "The former Chicago Bears starter took a pay cut to sign a one-year, $2.5 million contract with the Bills last year, and despite barely playing this past season, became one of the hottest names in free agency.",
    "In addition to Stevenson, Philadelphia Eagles wide receiver Greg Ward was at the workout, along with former Green Bay Packers wide receiver J’Mon Moore, who currently plays for the New Jersey Generals.",
    "Even in a year with a weak quarterback draft class, and numerous teams without clear starters, it’s hard to imagine any franchise taking a flyer on a guy who hasn’t stepped onto the field in six years.",
    "ESPN’s Adam Schefter retweeted the 34-year-old’s workout video and wrote, “Colin Kaepernick is still working out and is said to be, in the words of one source, ‘in the best shape of his life.",
    "pic.twitter.com/Bj3c7ATink\n— Colin Kaepernick (@Kaepernick7) March 16, 2022\nKaepernick tweeted the video and wrote, “I had a great time with @Footwork_King2 and the squad yesterday!",
    "Names such as Marcus Mariota and Ryan Fitzpatrick have been linked to the Bills as possible replacements, but no movement has been made to lock anyone in.",
    "Stevenson, who the Bills drafted in the sixth round of the 2021 NFL Draft, unfortunately, spent the bulk of last season on injured reserve.",
    "If Kaepernick can’t get a starting job in 2022, his second-best option could be to follow in Mitch Trubisky‘s footsteps.",
    "'”\nColin Kaepernick is still working out and is said to be, in the words of one source, “in the best shape of his life.",
    "While Kaepernick would love to once again be a starter, the reality is that he hasn’t played since 2016.",
    "Trubisky on taking a step back last season: \"It helped me so much, it was a blessing in disguise.",
    "Here’s the link to the workout.https://t.co/hqtB4XX01J\nToday we are back at it again in Dallas!",
    "I’d take Colin Kaepernick as the backup QB for the Bills in a heartbeat for the vet minimum.",
    "He would be a great fit for teams with QB vacancies to fill who want to win a Super Bowl.",
    "I appreciate y’all letting me come through and get that work in with y’all.",
    "I appreciate y’all letting me come through and get that work in with y’all.",
    "The Bills Need a New Backup Quarterback, Could Kaepernick Replace Trubisky?",
    "I could tell that when I was in Buffalo, and I can already tell that here.\"",
    "I had a great time with @Footwork_King2 and the squad yesterday!",
    "ALL the latest Bills news straight to your inbox!",
    "Fitzmagic is the only QB I’d want over him.",
    "Join the Heavy on Bills newsletter here!",
    "I think I learned a lot……culture wins.",
    "Man, it felt good to be out there!",
    "He wants to play.",
    "He wants to play.",
    "He’s ready play.",
    "He’s ready play."
  ]
}