{
  "id": 3162,
  "mediaId": 2523,
  "date": "2022-03-09",
  "headline": "Steelers' Top Players to Prioritize in 2022 NFL Free Agency",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/506/648/1c8cdc27c81e6b395543878ab3dc9c7a_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2954175-steelers-top-players-to-prioritize-in-2022-nfl-free-agency",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Tansey",
  "authorUrl": "https://bleacherreport.com/users/70f980a1-e85d-4abb-afb8-9bb78d0eb0d5",
  "termIds": [
    1919,
    2596,
    2609,
    3773,
    4264,
    4688,
    217,
    671,
    823
  ],
  "sentences": [
    "Re-signing one of the defensive backs and Turner could take out the opportunity to bring back JuJu Smith-Schuster, but the Steelers can feel comfortable about that decision with Chase Claypool and Diontae Johnson still under contract.",
    "Ray-Ray McCloud\nRay-Ray McCloud emerged as a decent target in the passing game toward the end of the 2021 season after recording four receptions in each of the final three contests and six catches in Week 14.",
    "At 25, he has a chance to partner Minkah Fitzpatrick for years to come at safety, a position that is valued more in the AFC North with so many dynamic playmakers in Baltimore, Cleveland and Cincinnati.",
    "Turner, 28, will command more money than his last contract because of how he played in 2021, but he could be worth the investment with so much change happening behind the offensive line.",
    "Pittsburgh might have been able to target an interior lineman in the early stages of the NFL draft in other seasons, but it may go after a quarterback in the first round next month.",
    "However, the Virginia Tech product has been strong enough over multiple years to warrant that type of deal and should be Pittsburgh's top target to re-sign when free agency opens.",
    "Trai Turner\nPittsburgh needs to find some consistency on the offensive line to provide comfort for its new starting quarterback following the retirement of Ben Roethlisberger.",
    "Pittsburgh may not be able to justify paying Haden at a large sum of change in his mid-30s, and Witherspoon has not been consistent at cornerback to warrant a multi-year deal.",
    "Head coach Mike Tomlin and his staff may be more inclined to land a young quarterback through the NFL draft because of the lack of strong free-agent options at the position.",
    "Trai Turner was a solid piece of the Steelers offensive line in 2021, and it could be worth re-signing the guard because of the lack of other options on the depth chart.",
    "Offensively, JuJu Smith-Schuster is the most notable free agent, but he isn't the top offensive player who should be brought back by the Steelers when free agency opens.",
    "Edmunds has recorded at least 75 tackles in three of his four seasons in Pittsburgh, and he carries much more value right now than Joe Haden and Ahkello Witherspoon.",
    "The secondary needs to be one of the first non-quarterback positions addressed since Joe Haden, Terrell Edmunds and Ahkello Witherspoon are set to be free agents.",
    "Pittsburgh could feel inclined to let him take over that role with Pat Freiermuth and Najee Harris providing security at tight end and running back, respectively.",
    "McCloud should re-sign on a relatively inexpensive deal, which would allow the Steelers to provide some depth while saving money to spend at other positions.",
    "Re-signing some of the top defensive free agents may be the best approach off the bat, especially if the quarterback focus is on the draft and Mason Rudolph.",
    "The team has a few key defensive players set to hit the market, but it has to manage its offseason approach with how it takes on its quarterback vacancy.",
    "There could be some who argue the Steelers would be locking up too much money at one position between Edmunds and a likely extension for Fitzpatrick.",
    "James Washington should not be pursued because he was unable to move up the depth chart with Smith-Schuster, Claypool and Johnson in front of him.",
    "Pittsburgh still has to sign Minkah Fitzpatrick to a contract extension, so that may limit its chances to re-sign more than one of those players.",
    "Pittsburgh should look to bring back the 25-year-old to add some depth behind Claypool and Johnson without making an external signing.",
    "Terrell Edmunds\nTerrell Edmunds makes the most sense to bring back of the three defensive backs set to hit free agency.",
    "The state of Pittsburgh's wide receiver depth chart makes it difficult to justify a return for Smith-Schuster.",
    "The Pittsburgh Steelers face a handful of tough decisions at the start of NFL free agency.",
    "As of Wednesday morning, Jimmy Garoppolo would still have to be acquired through a trade.",
    "3 target for the new Steelers quarterback.",
    "McCloud could develop into a solid No.",
    "B/R Recommends"
  ]
}