{
  "id": 3171,
  "mediaId": 2679,
  "date": "2022-03-15",
  "headline": "History-making Providence eyes deep run in NCAA tourney",
  "image": "",
  "link": "https://www.seattletimes.com/sports/college/history-making-providence-eyes-deep-run-in-ncaa-tourney/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KYLE HIGHTOWER",
  "authorUrl": "https://www.seattletimes.com/author/kyle-hightower/",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s not something Cooley takes for granted, especially since he began his journey being talked out of a job as a high school history professor in 1996 to take a post as an assistant on Al Skinner’s staff at the University of Rhode Island.",
    "… It has allowed him and the university to flourish because of that understanding.”\nPicked seventh in the Big East’s preseason poll, Cooley has notched his sixth, 20-win season in Providence with a veteran roster full of underdogs.",
    "Cooley enters his sixth NCAA Tournament as part of an even smaller group as one of just three coaches of color (joining Florida State’s Leonard Hamilton and Miami’s Jim Larranaga) to lead Power Five schools for at least a decade.",
    "I’m just happy to go to practice tomorrow, inspire young men to be the best that they can be and one day, too, people that didn’t believe in them they can live the dream beyond their belief,” he said.",
    "PROVIDENCE, R.I. (AP) — With his team on the verge accomplishing something that had never been done in Providence basketball history last month, Ed Cooley allowed himself to get lost in the moment.",
    "The Friars were comfortably in front of Creighton, and there was about a minute to play before they could officially celebrate the school’s first regular-season Big East Conference title.",
    "But for Cooley, now in his 11th season at Providence following five years at Fairfield, it’s simply an opportunity to add to what he says has always felt has been an improbable path here.",
    "That’s what we did.”\nReeves points to the chemistry they’ve shared since early in the season despite having to integrate Durham and Minaya (South Carolina transfer) into the mix.",
    "He believes the secret sauce for Cooley at Providence has been a combination of “loving where he’s at” and the administration giving him the space to grow the program his way.",
    "___\nMore AP coverage of March Madness: https://apnews.com/hub/march-madness and https://apnews.com/hub/college-basketball and https://twitter.com/AP_Top25\n KYLE HIGHTOWER",
    "“If you grew up the way I grew up and I could actually sit here and talk to you — you have no idea,” Cooley said after notching his 300th career win earlier this season.",
    "Ed was the kid that, whoever was a minority, would go in the back door, I would try to ask them if I can go in with them to be their nephew, their son, or somebody.",
    "Only 18 of the 75 coaches at schools in the Power Five — plus Big East — conferences have been at their current programs for at least 10 years.",
    "Watson, who likely has the best chance to play in the NBA, said the team’s success has validated his decision to return for a fifth season.",
    "“I took a deep breath and then when the game was over, I took a step aside — I wasn’t Coach Cooley, I was Ed,” the Providence native said.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThat’s because the kind of longevity Cooley has had remains a rarity in college basketball’s top tier.",
    "This (stuff) is real, man.”\nMost Read Sports Stories\nAsked about what he attributes to his staying power to, Cooley got emotional.",
    "… It was a real emotion.”\nIt’s that kind of reflection that Cooley, the Big East Coach of the Year, will carry with him as the No.",
    "His starting five features four graduate players (Nate Watson, Al Durham, Noah Horchler, Justin Minaya) and a senior (A.J.",
    "Providence is back in the tourney for the first time since 2018 and is a sleeper pick to make a deep March Madness run.",
    "4 seed — the highest in program history — and prepare to take on 13th-seeded South Dakota State (30-4) on Thursday.",
    "I would said, man, I’m just trying to make it through the day.”\n___\nAP Sports Writer Mike Fitzpatrick contributed.",
    "The group has also been tested in close games, boasting an 11-2 record in games decided by five or fewer points.",
    "“The fact that I’m here and you asked me that question — you couldn’t ask me that question 25, 26 years ago.",
    "No matter what happens over the next three weeks, Cooley is thankful to continue the ride he’s been on.",
    "Advertising\n Skip Ad\n“This is America, you have to be successful first and foremost,” Skinner said.",
    "“The fact that I’ve been a head coach for 16 years, I thought I’d get fired after the first game.",
    "Advertising\n Skip AdSkip AdSkip Ad\n“It just felt like we were around each other for a long time.",
    "Zero.”\nSkinner first noticed Cooley’s passion watching him as a captain on Stonehill (Mass.)",
    "“I came back for reason, and that was to cut down nets and make it to the NCAA Tournament.",
    "You come home and they give you a chance to do something special in your backyard.",
    "It was a surreal moment with respect to me being the coach of Providence College.",
    "“But you also want to be in an environment where you have that support.",
    "13 Friars (25-5) enter the NCAA Tournament as the Midwest Region’s No.",
    "“Ed was the kid that used to sneak into the Dunkin’ Donuts Center.",
    "Reeves) — none of whom who average more than 14 points per game.",
    "“The percentages say you’re not supposed to be sitting here.",
    "I didn’t know what the hell I was doing,” Cooley said.",
    "“I spoke it into existence last year,” Watson said.",
    "“Everybody worries about when our next win is.",
    "“Over a period of time, you get lucky.",
    "We never lost that beat,” Reeves said.",
    "Cooley suddenly was a kid again.",
    "College’s basketball team.",
    "Honest to God."
  ]
}