{
  "id": 3175,
  "mediaId": 2586,
  "date": "2022-03-09",
  "headline": "Bills Already Feeling Impact of Blockbuster Russell Wilson Trade",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Russell-Wilson-Bills-e1646860575289.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-feeling-impact-wilson-trade/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1394,
    1797,
    2015,
    2432,
    4285,
    135,
    160,
    308
  ],
  "sentences": [
    "On Tuesday, ESPN reported that the Seattle Seahawks agreed to a trade sending quarterback Russell Wilson to the Denver Broncos in exchange for a package that included quarterback Drew Lock, tight end Noah Fant, defensive lineman Shelby Harris, a pair of first-round picks and two second-round picks.",
    "“Seattle would have no problem finding someone willing to give up a first-round pick — perhaps an early one — for the right to acquire Metcalf and sign him to an extension that pays him like one of the best players at his position (about $22 million per year),” Dugar wrote.",
    "The trade, which won’t be officially announced for more than a week when the league year starts, has vaulted the Broncos to bona fide contender among many pundits, and may have made smoothed the potential path to the Super Bowl for the Bills.",
    "Blockbuster: After weeks of negotiations, in one of the largest trades in NFL history, the Seattle Seahawks and Denver Broncos have agreed to terms for a deal involving Super-Bowl winning QB Russell Wilson, sources tell ESPN.",
    "His contract is up at the end of 2022, so any team trading for Metcalf would be looking to exploit a short window for Super Bowl contention, which the Bills could be willing to pursue.",
    "Camenker and others noted that the trade and the now-tougher AFC West led oddsmakers to drop the Kansas City Chiefs, which had been seen as the frontrunner to win the Super Bowl.",
    "The move, along with the release of All-Pro linebacker Bobby Wagner just hours after news of the trade broke, appears to signal that Seattle is headed toward a full rebuild.",
    "Metcalf has been one of the most productive receivers over the last three seasons, ranking fifth in touchdowns (29) and 10th in receiving yards (3,170) during that time.",
    "Denver now has its best quarterback since Peyton Manning and bookmakers believe the team will be a contender in the 2022 season and 2023 postseason,” he wrote.",
    "AFC West Gets More Competitive\nThe trade will likely make one of the NFL’s best divisions even tougher, which could be a boon to the Bills.",
    "The Athletic’s Michael-Shawn Dugar suggested that the Seahawks may be willing to let him go in exchange for a first-round pick.",
    "25 overall pick, which some insiders have suggested could be enough to entice the Seahawks to trade the talented wide receiver.",
    "The Buffalo Bills were not a party to one of the biggest NFL trades in years, but they’re already feeling the effects of it.",
    "With Russell Wilson joining the AFC West, the Bills are now the favorites to win the Super Bowl at +750, per @ESPNStatsInfo.",
    "As Jacob Camenker of The Sporting News noted, oddsmakers immediately noted the increasing odds of a Broncos title run.",
    "The AFC West now has four of the league’s top quarterbacks — Patrick Mahomes, Justin Herbert, Derek Carr, and Wilson.",
    "Some insiders have suggested that the Bills target Seahawks wide receiver DK Metcalf, who may be the next to go.",
    "Bills Could Reap Rewards\nThere could still be more effects for the Bills in the fallout from the Wilson trade.",
    "That status now belongs to Buffalo, as the Bills may now have an easier path to the top overall seed.",
    "https://t.co/mTPVh83IOK\n— Nate Geary (@NateGearySports) February 25, 2022\nThe Bills have the No.",
    "“As one might expect, the Broncos’ odds to win the 2023 Super Bowl have shortened significantly.",
    "— Alaina Getzenberg (@agetzenberg) March 8, 2022\nThe Bills may have seen an even bigger boost.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "The Chiefs previously had the best odds.",
    "How does 25 sound?"
  ]
}