{
  "id": 3200,
  "mediaId": 2523,
  "date": "2022-03-12",
  "headline": "Players Championship 2022: Fleetwood, Hoge Lead as Inclement Weather Suspends Round 2",
  "image": "https://media.bleacherreport.com/image/upload/v1647131994/aqrua7jaslbtj8s1rxxh.jpg",
  "link": "https://bleacherreport.com/articles/10029596-players-championship-2022-fleetwood-hoge-lead-as-inclement-weather-suspends-round-2",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Kasabian",
  "authorUrl": "https://bleacherreport.com/users/5f54d71b-3a7f-4887-a7ae-837a2dde69cf",
  "termIds": [
    1449,
    2501,
    2846,
    3509,
    3599,
    4195,
    4333,
    816
  ],
  "sentences": [
    "The same goes for Matthew Fitzpatrick, as a near-automatic putt became a challenge in the wind:\nThe elements didn't appear to cause Zach Johnson to accidentally hit the ball on a practice swing, proving that pro golfers are human after all:\nAs far as the leaderboard goes, no one currently in the top 10 (or ties) sits in the top 20 of the Official World Golf Rankings.",
    "Justin Thomas is in sight of the top 10 at three under, while Dustin Johnson sits at two under after these back-to-back birdies:\nDJ is safely moving on to the third round with the cut line sitting at even par, although he likely has even more room with Data Golf currently projecting the cut to more likely than not slide down to two over.",
    "Taylor Pendrith: -4 (yet to start Round 2)\nFull leaderboard: PGATour.com\nHighlights and Notes\nIt's been brutal for the grounds crew members this week as the team fights to keep the course in good shape.",
    "Inclement weather continued to halt play at The Players Championship in Ponte Vedra Beach, Florida, on Saturday, to the point where 27 golfers have yet to begin their second rounds.",
    "Thankfully, the weather looks good for Sunday and Monday before thunderstorms roll in Tuesday, so a frenzied race to the finish appears likely at this juncture.",
    "A double bogey didn't do him any favors:\nStill, McIlroy may very well stay alive in this tournament and see 36 more holes of golf.",
    "For now, here's a look at the leaderboard heading into Sunday and some highlights and notes from Saturday's play.",
    "Even though the rain stopped and the sun came out, the wind wrecked havoc on the best golfers in the game.",
    "Scottie Scheffler, Brooks Koepka and Xander Schauffele all notably found the water on No.",
    "Frankly, the conditions were near-impossible to play in at times, as the No.",
    "Thunderstorms, heavy winds and rain have pounded the Players Stadium Course.",
    "That's good news for Rory McIlroy, who finished his two rounds at two over.",
    "He ended up building a snowman on the par-four hole for a quadruple bogey.",
    "Only 48 golfers in the 142-person field have finished their second rounds.",
    "Sixty-seven others are at least on the course aiming to finish 36 holes.",
    "ET Saturday because of darkness, and it will resume Sunday at 8:15 a.m.",
    "Much better days certainly lie ahead for the four-time PGA Tour winner.",
    "It didn't get any easier for Schauffele, who found the rough on No.",
    "Ultimately, they're the real MVPs of The Players Championship.",
    "Harold Varner III: -4 (-1 through 3 holes in Round 2)\nT6.",
    "Will Zalatoris: -4 (-1 through 3 holes in Round 2)\nT6.",
    "Kramer Hickok: -4 (+1 through 4 holes in Round 2)\nT6.",
    "Cameron Smith: -4 (-1 through 1 hole in Round 2)\nT6.",
    "Brian Harman: -4 (E through 3 holes in Round 2)\nT6.",
    "Doug Ghim: -4 (-2 through 14 holes in Round 2)\nT6.",
    "Tommy Fleetwood: -6 (E through 3 in Round 2)\nT1.",
    "Keith Mitchell: -5 (yet to start Round 2)\nT3.",
    "Anirban Lahiri: -5 (yet to start Round 2)\nT6.",
    "7 golfer in the world found out the hard way.",
    "Abraham Ancer: -4 (yet to start Round 2)\nT6.",
    "Sam Burns: -4 (yet to start Round 2)\nT6.",
    "Tom Hoge: -6 (yet to start Round 2)\nT3.",
    "18 and proceeded to hit this 16 feet.",
    "Joaquin Niemann: -5 (teed off on No.",
    "Leaderboard (Top 10 and Ties)\nT1.",
    "Play stopped at 6:29 p.m.",
    "1 in Round 2)\nT3.",
    "ET.",
    "17."
  ]
}