{
  "id": 3206,
  "mediaId": 2637,
  "date": "2022-03-16",
  "headline": "Valspar Championship: Preview, Odds & Best Bets",
  "image": "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.3.1/websites/images/np/favicon-np.ico",
  "link": "https://nationalpost.com/pmn/sports-pmn/valspar-championship-preview-odds-best-bets",
  "mediaOutlet": "news.nationalpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "VALSPAR CHAMPIONSHIP\nPalm Harbor, Fla., March 17-20\nCourse: Innisbrook Resort, Copperhead (Par 71, 7,340 yards)\nPurse: $7.8 (Winner: $1.404M)\nDefending Champion: Sam Burns\nArticle content\nFedExCup Leader: Scottie Scheffler\nHOW TO FOLLOW\nTV: Thursday-Friday, 2-6 p.m.",
    "ET (Golf Channel); Saturday-Sunday, 1-3 p.m. (Golf Channel), 3-6 p.m. (NBC)\nPGA Tour Live: Four live feeds per day on ESPN+\nSocial Media: @ValsparChamp (Twitter)\nNOTES\n–The Valspar returns to its traditional March date after being played in May last year.",
    "It begins Thursday at the Copperhead course at Innisbrook Resort in Palm Harbor, Fla. Sam Burns will defend his maiden PGA Tour victory, and Field Level Media’s golf experts provide key tournament notes, odds and best bets.",
    "He has +1100 odds at BetMGM, where Hovland leads with 6.0 percent of the bet count and 10.1 percent of the handle, making him the sportsbook’s third-biggest liability this week.",
    "BEST BETS\n–Hovland (+900 at DraftKings) finished T3 in his event debut last year, is coming off a T9 last year and has seven top-10s in his past nine worldwide starts.",
    "Coming off a solo fourth at The Players, Kisner has been backed by 3.3 percent of the bets and 4.5 percent of the money, making him the book’s biggest liability.",
    "–Two-time Valspar winner Paul Casey withdrew on Tuesday after finishing third at The Players the previous day, as did Doug Ghim and Sebastian Munoz.",
    "Article content\n–College stars Alex Fitzpatrick (Wake Forest) and Jackson Suber (Ole Miss) will make their PGA Tour debuts on sponsors exemptions.",
    "–The only players in the field to have made the cut at each of the previous three Florida stops this season are Denny McCarthy and Sam Ryder.",
    "The former U.S. Open champion has moved from +6600 to +5000 at BetMGM with 3.8 percent of the bets and 3.2 percent of the handle backing him.",
    "Article content\n–Morikawa (+1200) is coming off a missed cut at The Players but has a pair of runner-up finishes this season.",
    "Thomas is the +900 favorite at BetMGM, where he has been backed by 4.1 percent of the tickets and 7.8 percent of the money.",
    "Article content\nThe Valspar Championship is the final stop of the PGA Tour’s four-event Florida Swing.",
    "That momentum has led to Johnson being backed by 4.8 percent of the bets at BetMGM at +1400 odds.",
    "–Abraham Ancer (+3500) has only one top-10 in his past nine starts but finished fifth last year.",
    "–Shane Lowry (+3000) is coming off a runner-up at the Honda Classic and a T13 at The Players.",
    "He is making his Valspar debut and his odds at DraftKings shortened from +1400 on Tuesday.",
    "Morikawa is +1100 at BetMGM, where he has drawn the second-highest handle at 9.2 percent.",
    "–Thomas’ (+900) best finish in four previous starts at the Valspar was a T10 in 2015.",
    "Woodland missed the cut at TPC Sawgrass after posting consecutive T5s.",
    "He was in contention at The Players before shooting a final-round 76.",
    "–Kevin Kisner provides enticing longshot odds at +6600 at BetMGM.",
    "–Dustin Johnson tied the course record at TPC Sawgrass on Monday.",
    "He and Hovland both shifted from +1000 on Tuesday at DraftKings.",
    "They were replaced by Bronson Burgoon, Austin Cook and Dylan Wu.",
    "–The field features half of the top 10 players in the world: No.",
    "After eight consecutive top-20s, he finished T33 last week.",
    "Johnson will be making his 300th career start on tour.",
    "26 Matt Fitzpatrick, who is also playing this week.",
    "–Burns (+1800) is defending his maiden tour title.",
    "Fitzpatrick is the younger brother of world No.",
    "–Gary Woodland is second on that list.",
    "9 Xander Schauffele and No.",
    "2 Collin Morikawa, No.",
    "3 Viktor Hovland, No.",
    "8 Justin Thomas, No.",
    "10 Dustin Johnson.",
    "–Field Level Media"
  ]
}