{
  "id": 3235,
  "mediaId": 2696,
  "date": "2022-03-10",
  "headline": "Al Durham hits clutch 3-pointer to send No. 11 Providence past Butler",
  "image": "https://www.boston.com/wp-content/uploads/2022/03/BEast_Butler_Providence_Basketball_85422-622a575169668-scaled.jpg",
  "link": "https://www.boston.com/sports/college-sports/2022/03/10/providence-butler-recap-big-east-tournament/",
  "mediaOutlet": "The Boston Globe",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MIKE FITZPATRICK",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Jared Bynum, the league’s sixth man of the year, added 16 points off the bench and defensive specialist Justin Minaya made two huge blocks as Providence advanced to the Big East semifinals for the first time since 2018.",
    "Nate Watson scored a season-high 26 points for the top-seeded Friars (25-4), who avoided an early exit at Madison Square Garden after winning the first regular-season conference championship in school history.",
    "The score was tied 55-all late in a back-and-forth second half before Simas Lukosius sank two free throws and Golden made a layup to give the Bulldogs a three-point lead with 2:38 left.",
    "Golden made four straight layups, two on passes from Simas Lukosius, to account for all the points in an 8-0 run that gave Butler a 51-45 lead with 9:13 to play.",
    "Providence had trouble getting the ball inbounds cleanly, but Bynum finally secured it and passed to a wide-open Durham for a dunk at the buzzer that sealed it.",
    "Reeves found Durham in the left corner and the Indiana transfer knocked down a clutch 3 that gave the Friars a 61-59 lead and left him 1 for 8 from the field.",
    "Chuck Harris had 14 points and Bryce Golden scored all 13 of his points in the second half for the ninth-seeded Bulldogs (14-19), who rallied late to beat No.",
    "Minaya came up with another huge block at the other end, flying off the weakside, and Bo Hodges missed a contested layup for Butler.",
    "It was the first 3-pointer since January for Durham, who began the day 19 of 91 (21%) from behind the arc this season.",
    "NEW YORK (AP) — Al Durham drained a go-ahead 3-pointer with 41 seconds left for his first basket of the game, and No.",
    "The 6-foot-10, 260-pound Watson bullied the Bulldogs down low and went into the break with 15 points.",
    "Watson snagged a loose ball out of the air, dropped in a layup and drew a foul with 1:20 remaining.",
    "11 Providence barely got past pesky Butler 65-61 in the Big East Tournament quarterfinals Thursday.",
    "Bynum hit a pair of free throws with 12.9 seconds to go before Hodges scored quickly on a drive.",
    "The gritty Friars, who improved to 11-2 in games decided by five points or fewer, will play No.",
    "There were 26 fouls — 15 on Butler — in a tightly called first half that ended tied at 31.",
    "4 seed Creighton or fifth-seeded Marquette in the opener of Friday night’s doubleheader.",
    "Minaya blocked a shot by Harris and the ball went out of bounds to Providence.",
    "But he missed the free throw that could have tied it with a three-point play.",
    "8 seed Xavier in overtime in the first round Wednesday.",
    "A.J."
  ]
}