{
  "id": 3247,
  "mediaId": 2728,
  "date": "2022-03-11",
  "headline": "The Associated Press’ 2021 Kentucky All-State Football Teams",
  "image": "https://www.thestar.com/assets/img/thestar-ribbon.png",
  "link": "https://www.thestar.com/sports/2022/03/11/the-associated-press-2021-kentucky-all-state-football-teams.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Linebackers: Brady McEnaney, Louisville Trinity; Dylan Ferguson, Lawrence County; Caden Johnson, Frederick Douglass; Tyler Snell, South Warren; Jake Napier, Bowling Green; Keygan Pelfrey, Johnson Central; Logan Stephens, Casey County; Matthew Davis, Paintsville; Peyton Ledford, Franklin County; Ramont Townsend, Louisville DuPont Manual; Kellen Bowen, LaRue County; Giddeon Brainard, Southwestern; Layton Abbott, Pulaski County; Sam Jones, West Carter; Connor Goodall, Russell; Caden Ball, Lawrence County; Cannon Sheffer, Union County; Lofton Howard, Greenwood; Brody Wells, Corbin; Bryce Creekmore, Williamsburg.",
    "Offensive linemen: Jon Thompson, Scott County; Zach Mason, Boyle County; Drew Woodruff, Louisville Trinity; Matt Mason, Ryle; Lucas Hughes, Hopkinsville; Andrew Hardwick, Boyle County; Holden Stamper, Lincoln County; Samual Turley, Lexington Paul Dunbar; Bryce Tapp, Henderson County; Ethan Goforth, Corbin; Davis Pike, Union County; Tre Alexander, North Hardin; Bryson Kiser, East Carter; Mikey Holbrook, East Carter; Franklin West, Corbin; Jakson Lindsey, Owensboro; Gavin Adams, West Carter; Paul Turley, Lexington Paul Dunbar; Andrew Hobbs, Central Hardin; Connor Lay, Williamsburg.",
    "Running backs: Brady Hensley, Madison Central; Tanner Wright, Southwestern; Daniel Swinney, Louisville Male; Kobe Martin, South Warren; Elijah Pitman, Casey County; Jed Martin, Bishop Brossart; Keyandre Strand, John Hardin; Wyatt Blake, Logan County; Zack McCoart, Johnson Central; Zach Shofner, Bullitt Central; JaWaun Northington, Louisville DuPont Manual; Tramel Barksdale, Owensboro; Cole Crampton, West Carter; Cole Wallace, Rowan County; Noah Wallace, Raceland; Keiran Stockton, Glasgow; Ryan Rayno, Logan County; Jovari Gamble, Russellville.",
    "Wide receivers: Clayton Davis, Lincoln County; Mitchell Berger, Beechwood; Chandler Godby, Pulaski County; Ricky Padron, Ashland Blazer; Chaunte Marrero, Louisville Ballard; Carson Patrick, Russell; Max Dees, Daviess County; Martin Shannon, Williamsburg; Avrin Bell, South Warren; Jackson Bond, West Carter; Jackson Marshal, Sayre; Logan Pinkley, Fleming County; Jax Cooper, Allen County-Scottsville.",
    "Defensive backs: Zach Clark, Owensboro; Kristopher Hughes, Union County; Conner Hughes, Raceland; Micah Parmes, North Hardin; Alex Strickland, Lawrence County; Curtis Rearden, Louisville DuPont Manual; Jeremy Hamilton, Scott County; Terrell Henry, Mason County; Evan Poore, Corbin; Brett Mullins, Ashland Blazer; Ezra Major, Southwestern; Liam Hutson, North Oldham.",
    "Defensive linemen: Adam Hobbs, Central Hardin; Layton Davis, Caldwell County; Bradley Rose, Russell; Zane Christian, Ashland Blazer; Cody Harmon, Southwestern; Dylan Yates, Crittenden County; Elijah Lalli, South Oldham; Ryun Dye, Pulaski County; Iverson King, Union County; Andrew Jones, Lexington Paul Dunbar.",
    "HONORABLE MENTION:\nQuarterbacks: Jagger Gillis, Boyle County; Caden Veltkamp, South Warren; Jack Sivori, Louisville Saint Xavier; Drew Polston, Pulaski County; Sydney Bowen, Williamsburg; Adrian Stringer, Hopkins County Central.",
    "Offensive linemen: Jordon Jones, Ashland Blazer; Andrew Daniel, Louisville Male; Jon Daniels, Louisville Male; Anthony Johns, Lexington Christian; Mason Sulla, Garrard County; Carter Guillaume, Louisville Saint Xavier.",
    "SECOND TEAM DEFENSE\nDefensive linemen: Xavier Campbell, Beechwood; Saadiq Clements, Henderson County; Jeremiah Goodwin, Owensboro; Austin Johnson, North Laurel; Jack Jackson, South Warren.",
    "Kickers: Nick Keller, Conner; SJ Lycans, Ashland Blazer; Zavier Cruse, Henderson County; Jacob Baker, Corbin; Kellan McLaughlin, Louisville Trinity; Nathan Totten, Russell.",
    "Offensive linemen: Luke Slusher, Beechwood; Grant Bingham, Johnson Central; Owen LeMaster, Johnson Central; Malachi Wood, Madison Central; Evan Wibberley, Dixie Heights.",
    "FIRST TEAM DEFENSE\nDefensive linemen: Selah Brown, Louisville Male; Tommy Zeismer, Boyle County; Jerimiah Lightfoot, Bowling Green; Jadairion Smith, Louisville Ballard.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "Defensive backs: Mason Moore, Lexington Christian; Ty Bryant, Frederick Douglass; Elijah Reed, Louisville Pleasure Ridge Park; Chevis Elliott, Russellville.",
    "Running backs: Charlie Terry, East Carter; Kaden Moorman, Franklin County; Isaiah Fitzpatrick, Anderson County; Blake Birchfield, Pikeville.",
    "Linebackers: Ben Marks, Louisville Saint Xavier; Malachi Williams, Louisville Central; Trevor Wilson, Covington Catholic; Gabe Savage, Ryle.",
    "Defensive backs: Kenyon Goodin, Collins; Daisjuan Mercer, Hopkinsville; JT Haskins, Lexington Bryan Station; Grant Rice, Johnson Central.",
    "Linebackers: Tyler Morris, Lexington Christian; Kalib Perry, Great Crossing; Mitchell Berger, Beechwood; Elijah Manning, Louisville Male.",
    "Wide receivers: Braden Mundy, Owensboro Catholic; Easton Messer, Louisville Christian Academy; Mekhi Smith, Louisville Saint Xavier.",
    "Wide receivers: Dane Key, Lexington Frederick Douglass; Cole Lanter, Boyle County; Vinny Anthony, Louisville Male.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Running back: Isaac Dixon, Belfry; Xavier Brown, Lexington Christian.",
    "SECOND TEAM OFFENSE\nQuarterback: Joey Humphreys, Daviess County.",
    "FIRST TEAM OFFENSE\nQuarterback: Cameron Hergott, Beechwood.",
    "Coach of the Year: Kevin Wallace, Louisville Saint Xavier.",
    "Punter: Ryan Zoeller, Louisville Saint Xavier.",
    "Kicker: Andrew Dobbs, Lexington Christian.",
    "The Star does not endorse these opinions.",
    "Kicker: Jackson Smith, Boyle County.",
    "Mr. Football: Isaac Dixon, Belfry.",
    "Wilcoxson, Trimble County.",
    "Punter: J.T."
  ]
}