{
  "id": 3251,
  "mediaId": 2745,
  "date": "2022-03-09",
  "headline": "The Players Championship tees off this week. Here’s everything you need to know.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2SVUU66HKNGRPC2W3CEZYXVCQE&w=1440",
  "link": "https://www.washingtonpost.com/sports/2022/03/09/players-championship-best-bets/?utm_source=rss&utm_medium=referral&utm_campaign=wp_homepage",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Scottie Scheffler (+2000, $9,200): Maybe the hottest golfer on the planet at the moment, Scheffler held off Patrick Cantlay in a playoff to win the Phoenix Open on Super Bowl Sunday and then emerged from the Sunday carnage to win this past weekend’s Arnold Palmer Invitational, giving him two victories in his past three starts.",
    "“The rainfall amounts we think we’re going to see don’t look like they would be heavy enough to make the course unplayable, given the fact that the drainage is so good and they’ve got the technology to take moisture out of the greens.”\nThere hasn’t been a Monday finish at the Players Championship since 2005.",
    "Scheffler was the only golfer to gain at least two strokes on approach at the API, the fourth tournament of his past five in which he has been on the positive side of that metric, and though he is not the most accurate driver, he has been on the plus side more often than not.",
    "So far this year, he has a fourth-place finish at the Honda Classic — a tournament he led by five strokes after three rounds before a Sunday collapse — and a tie for fifth at the Tournament of Champions, and he is third on tour in strokes gained on approach.",
    "Daniel Berger (+3000, $8,800): The Florida native tied for ninth at the Players last year, his second such finish at the event over the past five tournaments, and he has missed the cut at TPC Sawgrass only once, in his maiden trip to the Players in 2015.",
    "Cameron Smith (+3000, $9,400): The mulleted Australian hasn’t played much this calendar year (only four events), but he won the Tournament of Champions in Kapalua (Hawaii) in January and tied for fourth at an Asian Tour event in Saudi Arabia last month.",
    "Sergio Garcia (+400 to finish top 10, $7,400 on DraftKings): Garcia has averaged 1.8 strokes gained per round over his past two trips to the Players, a number topped by only three golfers who played in both the 2019 and 2021 tournaments.",
    "Cameron Young (+1000 to finish top 10, $7,200): The 24-year-old tied for 13th at the API, tied for 16th at the Honda Classic and tied for second at the Genesis, gaining strokes off the tee and on approach in all three events.",
    "— Statistics compiled by Datagolf also show that accuracy off the tee is much more important at TPC Sawgrass than at other courses (again, look at all that water), and it’s much more important than driving distance.",
    "Sungjae Im (+450 to finish top 10, $8,300 on Draftkings): Im has gained strokes off the tee in every tournament he has played in since the John Deere in July, and he gains strokes on approach more often than not.",
    "He has also gained 2.07 strokes on average per round in events played in Florida since 2017, second behind only Woods among all golfers with at least 16 rounds in the Sunshine State since then.",
    "Abraham Ancer (+500 to finish top 10, $7,600 on DraftKings): Like Garcia, Ancer averaged 1.8 strokes gained per round over his past two appearances at TPC Sawgrass; he tied for 22nd and 12th.",
    "PGA Tour Live, which now is streamed at ESPN Plus, will feature numerous featured groups and featured holes starting at 6:45 a.m. Thursday and Friday and 7:45 a.m. Saturday and Sunday.",
    "For the first time since 1994, the Players Championship will not feature Tiger Woods or Phil Mickelson, but that doesn’t mean golf’s “fifth major” isn’t worth your time this weekend.",
    "— The Players is not usually won by competitors who enter with bad form: Of the past seven winners, only Si Woo Kim in 2017 didn’t finish at least 21st in his previous tournament.",
    "He lost strokes on approach at the API last weekend, but then again, so did a lot of other golfers, and Scott has gained strokes on approach in seven of his past nine tournaments.",
    "TPC Sawgrass in Ponte Vedra Beach, Fla., is an iconic Pete Dye design that’s most renowned for its island-green, par-3 17th hole and the difficult finishing hole that follows it.",
    "He tied for fourth at the Genesis and tied for ninth at a January tournament in Dubai, and he hasn’t missed a cut in a full-field tournament since last year’s PGA Championship.",
    "Matthew Fitzpatrick (+400 to finish top 10, $7,700 on DraftKings): The Englishman tied for ninth last year and has top-10 finishes in each of his past three PGA Tour events.",
    "He and Martin Kaymer (2014) also are the only winners out of the past seven who didn’t have at least one top-10 finish in the previous six tournaments entering the Players.",
    "Things are looking pretty grim, with persistent (and sometimes heavy) rain and thunderstorms in the forecast for the first three days before things clear up Sunday.",
    "He mounted impressive weekend charges in both, coming from nine shots back after 36 holes at the Phoenix Open and eight shots back after 36 holes at the API.",
    "Adam Scott (+3000, $8,200): The 2004 winner here, Scott has gained 37.89 strokes at this event over his past five appearances, second only to Jason Day.",
    "He has gained strokes in nearly every major statistical category except for a minor off-the-tee blemish at Pebble Beach (and he still tied for sixth).",
    "A total of 144 golfers will tee it up at TPC Sawgrass, with the field mainly filled out by the top 125 golfers from last year’s FedEx Cup points list.",
    "Collin Morikawa (+1600 to win, $10,700 on DraftKings): A two-time major winner by the time he turned 25, Morikawa has the iron game to win here.",
    "But the final round could be a chilly one, with a forecast high of only 53 degrees, which would make it the coldest day in tournament history.",
    "(He’s the only golfer over the past 35 years to overcome at least an eight-shot 36-hole deficit in each of his first two PGA Tour victories.)",
    "It should be noted that the greens at TPC Sawgrass all have Precision Air suction systems underneath, meaning they can be quickly dried out.",
    "“I think they’ll be able to play some golf every day,” Wade Stettner, the PGA Tour meteorologist on duty this week, told Jacksonville.com.",
    "A stacked field — deeper than some of the actual majors — competing for record prize money on an immaculate course: What’s not to love?",
    "— Strokes gained on approach is a key metric in every tournament, but it’s more so at TPC Sawgrass, which features water on 17 holes.",
    "Per analyst John Haslbauer, the past four Players winners each gained at least two strokes on approach in their previous tournament.",
    "These players might not win, but they could be good looks to finish in the top 10 or top 20 and to fill out your DFS lineups.",
    "If he can figure out his irons — Garcia has lost strokes on approach in his past two tournaments — he could be a contender.",
    "This will be his fifth straight week playing and he has never been in the Players, but he could be worth a look.",
    "Water abounds, and nearly all of the par-4 fairways are in an S shape, putting the draw and the fade into play.",
    "Well, the weather this week might not be all that lovable, but the PGA Tour’s best will soldier through it.",
    "He finished tied for 41st last year in his only previous Players appearance but shot a 66 on Sunday.",
    "He tied for second at his previous event, the Genesis Invitational in February, and he putted well.",
    "(Garcia tied for ninth last year, tied for 22nd in 2019 and won the event way back in 2008.)",
    "All but two of the top 50 in the Official World Golf Rankings will be on hand.",
    "(Morikawa’s main weakness is on the greens, but he has been on the upswing.)",
    "He has what it takes off the tee and from the fairway to be in the running.",
    "Two top 10s and two more top 20s this calendar year put him in good form.",
    "The big bombers don’t necessarily have an edge here.",
    "Here’s a look at this week’s Players Championship."
  ]
}