{
  "id": 3267,
  "mediaId": 6656,
  "date": "2022-03-09",
  "headline": "Colts to trade QB Carson Wentz to Commanders",
  "image": "https://cdnph.upi.com/sv/ph/og/upi/8971646852813/2022/1/4697110729a3387d04f9efbbe76bbb9b/v1.5/Colts-to-trade-QB-Carson-Wentz-to-Commanders.jpg",
  "link": "https://www.upi.com/Sports_News/NFL/2022/03/09/Indianapolis-Colts-to-trade-QB-Carson-Wentz-Washington-Commanders-NFL/8971646852813/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Butler",
  "authorUrl": "https://www.upi.com/author/Alex-Butler/",
  "termIds": [
    1709,
    3336,
    3474,
    3931,
    496,
    671,
    1116,
    1218,
    5144
  ],
  "sentences": [
    "MIAMI, March 9 (UPI) -- A deal is \"in place\" to trade veteran quarterback Carson Wentz from the Indianapolis Colts to the Washington Commanders, a league source told UPI on Wednesday.",
    "Sources told ESPN, The Athletic and NFL Network that the Commanders agreed to send the Colts a 2022 third-round pick, a 2023 third-round pick and the No.",
    "Colts coach Frank Reich told reporters in January that the team would \"evaluate\" Wentz's play this off-season before they committed to his 2022 return.",
    "The Colts do not own a first-round pick in the 2022 NFL Draft, but could be active in free agency in their search for a new quarterback.",
    "Wentz, 29, completed 62.4% of his throws for 3,563 yards, 27 touchdowns and seven interceptions in 17 games last season for the Colts.",
    "Sam Ehlinger and James Morgan will be the only quarterbacks that remain on the Colts roster at the start of the league year.",
    "Ryan Fitzpatrick, Kyle Allen and Garrett Gilbert were on the roster last season, but are expected to become free agents.",
    "The 2023 third-round pick the Commanders will send to the Colts can become a second-round pick based on incentives.",
    "The Colts traded away two draft picks to acquire Wentz last off-season in a trade with the Philadelphia Eagles.",
    "Ehlinger, 23, joined the franchise as a sixth-round pick in the 2021 NFL Draft and is signed through 2024.",
    "He led the team to a 9-8 regular-season record, which placed the Colts outside of the AFC playoff field.",
    "Wentz heads to the Commanders, whose quarterback depth chart also will include veteran Taylor Heinicke.",
    "He carries a total salary cap hit of $28.3 million, but his pact features a 2023 opt-out clause.",
    "Neither Ehlinger nor Morgan attempted a pass through the start of their NFL careers.",
    "The trade cannot become official until March 16, the start of the NFL's league year.",
    "The Commanders are now expected to pay Wentz a $22 million base salary in 2022.",
    "The Colts waived former third-string quarterback Jacob Eason in October.",
    "47 overall pick in the 2022 NFL Draft to the Commanders in the swap.",
    "Ehlinger totaled nine yards on three rushing attempts in 2021.",
    "He also totaled 215 yards and one score on the ground.",
    "Morgan, 25, was a fourth-round pick in 2020.",
    "42 overall pick this year in the deal.",
    "The Colts sent Wentz and the No."
  ]
}