{
  "id": 3272,
  "mediaId": 2522,
  "date": "2022-03-07",
  "headline": "Politico uncorks epic whine about Biden voters made to ‘suffer in silence’ in rural red areas",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/03/GettyImages-1228930941.jpg",
  "link": "https://www.bizpacreview.com/2022/03/07/politico-uncorks-epic-whine-about-biden-voters-made-to-suffer-in-silence-in-rural-red-areas-1209597/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Donaldson",
  "authorUrl": "https://www.bizpacreview.com/author/chris-donaldson/",
  "termIds": [
    0
  ],
  "sentences": [
    "“at a crafts store when she stumbled into an aisle display where someone had used big, block letters to spell out “T-R-U-M-P.” She flagged it for a store employee, who she says assured her it wasn’t constructed by anyone working there.” https://t.co/Dz5Xaval5C\n— David Marcus (@BlueBoxDave) March 4, 2022\nIf I was the employee I would have said, “I’m sorry m’am we don’t have a designated safe space.”\n— Julie Shera (@Bothered_Blonde) March 4, 2022\nThey expect support from a party that has routinely referred to large swaths of rural America as “flyover country?”\n— CalRadioHost (@cal_host) March 5, 2022\nGender issues , and gay issues, marriage issues, don’t really play in rural America These are pretty conservative people.",
    "(@InezFeltscher) March 4, 2022\nWhat the article fails to strongly emphasize is that the Democratic Party has left a considerable portion of what once used to be its longtime base of white, working-class, rural Americans behind and while many likely dutifully lined up to cast their votes for the “Joe Biden” brand name, they were really voting for socialists Bernie, AOC and the Squad along with a toxic “woke” identity politics that Americans with traditional values reject as toxic.",
    "SIGN UP HERE\nIn an effort to generate sympathy, Politico Magazine has outdone itself with a long feature article detailing the heart-wrenching accounts of Democrats who live in rural areas that are dominated by conservatives, areas that liberal elitists regularly sneer down at from their bastions of power on the coasts and in big cities.",
    "If one is to believe Politico, there are few who have been made to “suffer in silence” more than Democrats who are trapped in Trump country who have been abandoned by their party’s focus on the priorities of California and New York City and the “woke” agenda that has been greatly successful in alienating the vast majority of the country.",
    "We’ve just never seen this level of vulgarity after an election — and so long after the election at that.”\n“In a civilized society,” she said, “we just don’t do that.”\nPolitico also quoted retired schoolteachers, Kathy and Frank Foulkrod who are “also Democrats, members of a minority group in a place that’s suddenly unfamiliar to them.",
    "“As he pilots us through the backroads around DuBois, Kathy tells me about the time she was shopping at a crafts store when she stumbled into an aisle display where someone had used big, block letters to spell out ‘T-R-U-M-P.’ She flagged it for a store employee, who she says assured her it wasn’t constructed by anyone working there.",
    "One church member urged the man to remove the flag.”\n“They supported the ultimate winner and yet a relentless and toxic campaign to delegitimize his victory and overturn the election makes them feel somehow as if they’re under siege.” Rural Democrats are having a rough time of it, reports @chriscadelago.",
    "Our drive reveals multiple signs as profane as the one across from the church, another sign calling Biden and Vice President Kamala Harris ‘Baby Killers,’ not to mention the ‘Don’t Tread on Trump’ placard in the window of The Cheapo Depo 2,” writes Politico’s Christopher Cadelago.",
    "In its account of Democrats forced to live under the yoke of red state oppression in areas that are regularly snickered at by leftist late-night hosts and other haughty snobs as the “flyover states,” Politico lays out an array of horror stories for its cosmopolitan audience.",
    "“In the pandemic’s darkest days, a man living across the street from a Methodist church in this small town raised a flag in front of his house emblazoned with the words “F**k Biden,” the article begins.",
    "“Once-benign personal encounters between acquaintances in bookstores and barber shops have turned into bitter, ridicule-infused standoffs over abiding by Covid-19 protocols,” the story adds.",
    "On a tour of the town and nearby communities, they told me they have never felt so detached from their neighbors.”\n“Life here has never been as coarse as it is now,” Frank said.",
    "(@gmail_hess) March 5, 2022\nOthers were quick to point out that it is not rural Democrats who are being censored, demonized, and doxed by the leftist thought police.",
    "https://t.co/32vpQCpY2h\n— POLITICO Magazine (@POLITICOMag) March 4, 2022\n“For months, the man refused, and his brusque demeanor frightened some people off.",
    "Also, in the reverse case, the massive corp definitely spelled out the message and forced all its employees to wear it.",
    "He eventually decided to take the flag down, only to replace it with another one, which still hangs outside the house.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "Users took to Twitter to ridicule the article and its emphasis on the fragility of Democrats.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "A resident complained about the profanity to the zoning commission but never heard back.",
    "The flag’s owner lived in a home that once belonged to pillars of the church community.",
    "And when they had gotten sick, neighbors recalled delivering them home-cooked meals.",
    "— Stephen Winn (@redtick79) March 5, 2022\nThe fragility of leftists is astounding.",
    "“We’ve never seen this before,” she said of the abundance of anti-Biden signs.",
    "The article quotes Joanne Fitzpatrick, identified as a DuBois, PA Democrat.",
    "“Neighbors were so repulsed they brought it up with church leadership.",
    "The one thing that the left excels at more than bullying is whining.",
    "Try getting fired over a private thought or donation and we’ll talk.",
    "I typically rearrange them to read “FJB & LGB,” but that’s just me.",
    "It wasn’t just that the slur offended their sense of propriety.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "— Kokomojoe (@Kokomojoe5) March 4, 2022\nThat’s pathetic.",
    "It reads: “Joe and the Ho got to Go,” oh, the horror.",
    "“I’m not a prude by any stretch, but it’s offensive.",
    "The public will not see it and we do not share it.",
    "The employee took it down,” the piece recounted.",
    "“Daily rituals are a series of passive insults.",
    "Some here felt a sense of betrayal, too.",
    "They were the man’s late grandparents.",
    "They are literally useless to society.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "— Inez Stepman ??????",
    "This is so laughable.",
    "— American daddy!",
    "The horror!",
    "????"
  ]
}