{
  "id": 3275,
  "mediaId": 4056,
  "date": "2022-03-08",
  "headline": "Key senators accept Scott’s demand on firearm background check bill",
  "image": "https://vtdigger.org/wp-content/uploads/2020/01/philip-baruth-1-20200108.jpg",
  "link": "https://vtdigger.org/2022/03/08/key-senators-accept-scotts-demand-on-firearm-background-check-bill/",
  "mediaOutlet": "vtdigger.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ethan Weinstein",
  "authorUrl": "https://vtdigger.org/author/ethan-weinstein/",
  "termIds": [
    2210,
    2538,
    1178,
    5379
  ],
  "sentences": [
    "“I believe going from three to effectively 30 days is excessive and unreasonable for law-abiding citizens who wish to purchase a firearm for their own personal safety or for other lawful and constitutionally protected purposes,” Scott said in his letter to the Legislature.",
    "“After thinking it over and talking it over with the chair, it seemed like it was best to accept the hand that had been offered,” said Sen. Phil Baruth, D/P-Chittenden, an outspoken supporter of new gun laws and the original sponsor of S.30.",
    "To expedite the rewrite process, legislators on Tuesday voted to accept a strike-all amendment to another bill, S.4, which had originally proposed creating a two-day waiting period for firearms purchases.",
    "“We deny our own citizens the ability to possess the same.”\nBenning’s biggest problem with the bill, he said, was a section that allows judges to temporarily seize firearms from alleged domestic abusers.",
    "“That’s what this draft attempts to do.”\nErik FitzPatrick, a lawyer for the Legislature, explained that the change to seven business days is the only difference between S.30 as vetoed and the compromise.",
    "He highlighted his distaste for a provision of the bill intended to be a compromise — allowing out-of-staters to bring high-capacity magazines into Vermont for shooting competitions.",
    "“I remain somewhat perplexed and uncomfortable with a provision that would allow another out-of-state resident to bring a high-capacity magazine into the state,” he said.",
    "What initially had been introduced as a bill to ban guns in hospitals and other public places morphed into legislation amending the background check system.",
    "The Senate Judiciary Committee decided to replace the text of S.4 with the amended text of S.30 in order to more quickly move the bill out of panel.",
    "In a Tuesday meeting of the Senate Judiciary Committee, lawmakers aired their feelings about the demise of S.30 and its potential path forward.",
    "Last month, the Legislature approved S.30 after a back-and-forth between the Senate and House that led to significant changes to the bill.",
    "As it passed the Legislature, S.30 would have required most purchasers to actually pass a background check before receiving their gun.",
    "Scott vetoed the bill, telling lawmakers he’d sign a version of it that lengthened the waiting time from three to seven business days.",
    "The new plan would scale back S.30, which would have closed the Charleston Loophole by strengthening firearm background check rules.",
    "“I think it’s a precedent that we’re establishing that I fear for the future may be a stepping stone for other cases,” he said.",
    "The committee approved the amended gun legislation 4-1, with Sen. Joe Benning, R-Caledonia, casting the only dissenting vote.",
    "“Thank you all for this draft, which accepts the governor’s path forward for this compromise,” she said.",
    "Key members of the Vermont Senate say they’re willing to accept a compromise offered by Gov.",
    "Federal law allows gun sales to proceed if a background check takes longer than three days.",
    "Jaye Johnson, Scott’s legal counsel, offered her stamp of approval on behalf of her boss.",
    "The new bill, S.4, is now expected to move to the Senate floor.",
    "He said a 30-day or longer waiting period was not acceptable.",
    "Phil Scott on a gun-control bill he vetoed last month."
  ]
}