{
  "id": 3303,
  "mediaId": 2523,
  "date": "2022-03-09",
  "headline": "Let the Jimmy Garoppolo Sweepstakes Begin",
  "image": "https://cdn.vox-cdn.com/thumbor/Z_8EpNw4OQZFOY8n2K1b9JBtv64=/0x9:1200x637/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23301721/JimmyGRipples_AP_Ringer.jpeg",
  "link": "https://www.theringer.com/nfl/2022/3/9/22969342/jimmy-garoppolo-nfl-quarterback-trade-market",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nora Princiotti",
  "authorUrl": "https://www.theringer.com/authors/nora-princiotti",
  "termIds": [
    0
  ],
  "sentences": [
    "He’s won lots of games in San Francisco, but he’s interception-prone, particularly over the middle of the field, and carries the reputation of a player who was buoyed by Kyle Shanahan’s offense and the rest of the 49ers roster, particularly playmakers like Deebo Samuel who could make the most out of Garoppolo’s limited dropback ability and short passes.",
    "It exists in a world in which there’s currently a shortage of decent, available quarterbacks, and in which Garoppolo is now the clear best option available for teams like Carolina, Pittsburgh, and others (I would include Tampa Bay here were Garoppolo not such a bad fit for Bruce Arians’s dropback-heavy offense).",
    "The new league year begins next week and the man of the hour has a $27 million cap hit, a hurt shoulder, a propensity for throwing interceptions, a 33-14 record, two NFC championship game starts, and the most chiseled jawline you can find strapped into a helmet on Sundays.",
    "It’s not out of the question that San Francisco could decide to keep Garoppolo, who got the team within a few plays of a Super Bowl appearance last season, but neither 49ers leadership nor Garoppolo himself has been shy about acknowledging that he’s likely on the move.",
    "The Colts traded Carson Wentz to Washington, which was willing to take on Wentz’s entire $28 million salary and give up two third-round picks, one of which can become a second-round pick based on appearance incentives, just to get out of the dismal marketplace.",
    "But this year’s prospects are a significant downgrade from those in last year’s draft, when quarterbacks were taken with the first three picks and five went in the first 15—no prospect in this year’s class is considered a trustworthy Day 1 starter.",
    "Shortly after, the Seahawks traded Russell Wilson and a fourth-round pick to the Broncos for a package deal of two first-round picks, two seconds, a fifth, and quarterback Drew Lock, defensive lineman Shelby Harris, and tight end Noah Fant.",
    "In less than half an hour, the two highest-profile quarterbacks rumored to be available had chosen their 2022 homes, two options removed from the circle of musical chairs that quarterback-needy teams must navigate this offseason.",
    "The QB free agent list looks like this: Andy Dalton, Cam Newton, Tyrod Taylor, Jameis Winston, Jacoby Brissett, Marcus Mariota, Teddy Bridgewater, Joe Flacco, Blaine Gabbert, Chad Henne, Geno Smith, and Mitchell Trubisky.",
    "“It’s been a fun ride, guys, and I really appreciate you for that,” Garoppolo said in a press conference with Bay Area media two days after the 49ers season ended in the NFC championship game loss to the Rams.",
    "The Eagles, Lions, Falcons, Colts, Texans, and Giants are QB-needy too, though their timelines make it slightly easier to stick it out with their incumbent starters and hope for better options next year.",
    "He has a long injury history, has played a full season just once in his career, and just had surgery on his throwing shoulder that is expected to keep him from throwing until sometime this summer.",
    "First, Aaron Rodgers elected to stay in Green Bay for at least one more season, providing the Packers with clarity going forward and removing the most coveted veteran passer from the market.",
    "Two other league executives estimated that, in a vacuum, Garoppolo’s value might be closer to one second- or third-round pick, with interceptions and injuries being major concerns.",
    "Malik Willis has incredible physical tools but struggled with accuracy at Liberty, where he played in a limited offense that is a far cry from any he’d need to operate in the NFL.",
    "So, see ya.”\n“A lot of people need or want quarterbacks right now and he’s obviously a guy they’d look at,” 49ers general manager John Lynch said last week at the combine.",
    "To understand this offeason’s quarterback market, all you need to know is that Garoppolo is the best bet to start a bidding war among teams looking for their 2022 starter.",
    "Washington reportedly offered three first-round picks to Seattle for Wilson, reflecting its desperation for a good quarterback—which culminated in its trade for Wentz.",
    "Desmond Ridder is a streaky player and one of the more polished prospects available, but he’s going to face a big jump in competition going from Cincinnati to the NFL.",
    "That would be double what the 49ers gave the Patriots to acquire Garoppolo in 2017, and double what New England originally gave up to draft Garoppolo in 2014.",
    "Kirk Cousins is staying put in Minnesota under new head coach Kevin O’Connell, and his contract makes moving him almost prohibitively expensive anyway.",
    "Rodgers never actually entered the market and Wilson is now off of it, having created a need at QB for the Seahawks while filling one for the Broncos.",
    "Sam Howell comes with similar concerns after playing in an RPO-heavy offense at North Carolina; plus he’s undersized and takes way too many sacks.",
    "Multiple league sources said at the combine that San Francisco wants compensation in the range of two second-round draft picks for Garoppolo.",
    "This is happening a year after the 49ers spent multiple first-round picks to move up to draft a rookie, Trey Lance, to replace Garoppolo.",
    "Matt Corral had some disastrous outings in college and played in an RPO-reliant offense at Ole Miss that will give many pro teams pause.",
    "Evaluating quarterbacks is hard and there will probably be a passer or two in this group who turns out to be solid or even special.",
    "It’s been crazy, man, just all the comebacks at Levi’s, comebacks on the road, ups and downs, it’s been a hell of a ride, guys.",
    "He is the closest thing this year to what Matthew Stafford was last offseason (OK, maybe that tells you all you need to know).",
    "According to ESPN’s Jeremy Fowler, Trubisky could realistically get $10 million or more annually on a new deal this offseason.",
    "Kenny Pickett had one good season at Pitt, he’ll be 24 as a rookie, and comes with questions about his fumbles and hand size.",
    "Tuesday’s franchise tag deadline was overshadowed by a cascade of major NFL news, most significantly involving quarterbacks.",
    "Celtics Stifling KD and Embiid’s Raptors Revenge, Plus Deebo’s Value, NFL Draft Rumors, and Going Abroad With Kevin Clark",
    "And let’s not sugarcoat this, either: This is a bad free agent and trade market for veteran quarterbacks!",
    "We’re about a thousand words too late for a TL;DR, but here’s one anyway: Handsome man stays winning.",
    "The Panthers, Steelers, Saints, Colts, Buccaneers, and Seahawks have immediate needs at quarterback.",
    "This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
    "Considering what Wentz netted the Colts, two seconds for Garoppolo sounds pretty reasonable.",
    "The Ringer Newsletter\nBy submitting your email, you agree to our Terms and Privacy Notice.",
    "Anyone familiar with basic economic theory knows what happens when demand outpaces supply.",
    "But consider the alternatives and Garoppolo starts to look pretty, pretty good.",
    "The buzz at last week’s combine was that Ryan Fitzpatrick might soon follow.",
    "“So yes, we have listened.”\nGaroppolo is hardly a perfect quarterback.",
    "That meager supply is going to be met with significant demand.",
    "Maybe—maybe—the Falcons would listen to offers on Matt Ryan.",
    "That is, except for this offseason’s belle of the ball.",
    "Let’s be real: This is a bad draft for quarterbacks.",
    "It’s Jimmy’s world, they’re all just trading in it.",
    "But Garoppolo’s value doesn’t exist in a vacuum.",
    "Faithful, thank you very much for everything.",
    "It’s bleak out there in the QB market.",
    "The options left are fairly limited.",
    "Garoppolo is the best of the rest.",
    "It’s Jimmy Garoppolo’s time now.",
    "“And yeah, I’ll miss you guys.",
    "Ben Roethlisberger did, too.",
    "You can opt out at any time.",
    "Same with Ryan Tannehill.",
    "So thank you guys again.",
    "Tom Brady retired.",
    "I love you guys.",
    "That’s right.",
    "Who is left?",
    "Oh, my."
  ]
}