{
  "id": 3321,
  "mediaId": 4056,
  "date": "2022-03-08",
  "headline": "Final Reading: ‘Every Ukrainian is my family’",
  "image": "https://vtdigger.org/wp-content/uploads/2022/03/ukraine-protest-030822-2.jpg",
  "link": "https://vtdigger.org/2022/03/08/final-reading-every-ukrainian-is-my-family/",
  "mediaOutlet": "vtdigger.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Mearhoff",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "WHAT WE’RE READING\nOrganic Valley to take as many as 90 farmers dropped by Horizon, Maple Hill (VTDigger)\nThe hard pinch of gas prices: Upper Valley feels impact of rising fuel expenses (Valley News)\nAs state loosens masking recommendations, many school districts are ready to ditch mandates (VTDigger)\nVermont, Dressed in Snow (The New York Times)",
    "Sen. Anthony Pollina, P/D-Washington, quipped that for a study, lawmakers could survey representatives in other states that have divested, like New York, California and Maine, and “see how many of them regret it.”\nSen. Jeanette White, D-Windham, who chairs the committee, drew a hard line in the sand when it came to the timeline: nothing by 2027.",
    "Phil Scott, earmarks $1 for every Vermonter, plus $1,749 — the sum the Vermont Department of Liquor and Lottery collected from sales of Russian-sourced products between Feb. 24, when Russia launched its invasion, and March 2, when Vermont took Russian liquor off its shelves.",
    "Legislative Counsel Eric FitzPatrick explained to the committee that to maintain consistency within the classes, certain offenses, such as manslaughter, were given maximum sentences of “10 years plus five additional.”\n“That makes it 15 years total,” FitzPatrick said.",
    "“And those,” she continued, gesturing at the people lining the sidewalk, “all my family now.”\n— Lola Duffort, Riley Robinson and Sarah Mearhoff\nIN THE KNOW\nKey members of the Vermont Senate say they’re willing to accept a compromise offered by Gov.",
    "“After thinking it over and talking it over with the chair, it seemed like it was best to accept the hand that had been offered,” said Sen. Phil Baruth, D/P-Chittenden, an outspoken supporter of new gun laws and the original sponsor of S.30.",
    "“However, this legislation shows that we are united together — the governor, the Legislature and the 643,077 Vermonters we collectively represent can help.”\nThe bill passed on a voice vote with no opposition, and now heads to the Senate.",
    "Through its indexes, he said, Vermont’s pension system held roughly $6 million in Russian holdings — a number Golonka described as “minimal exposure,” unlikely to majorly disrupt the pension system’s bottom line after liquidation.",
    "Proponents of the bill on Tuesday brought forward what they thought was a middle-ground agreement, rolling back the bill to assign the Joint Public Pension Oversight Committee to study how to divest in fossil fuels by July 2027.",
    "Wells, Mabel Ping-Hua Lee and Stacey Abrams appear alongside Vermonters Louvenia Dorsey Bright, the first Black woman elected to the Legislature, and Lucy J.C. Daniels, who was jailed for protesting at the White House in 1917.",
    "“Same as the existing law.”\n— Alan J. Keays\nThe Senate Government Operations Committee has yet to agree on a path forward for S.251, which would divest the state pension fund’s direct and indirect investments in fossil fuels.",
    "— Lola Duffort\nSen. Kesha Ram Hinsdale, D-Chittenden, picked up two labor endorsements in her U.S. House campaign, from the Communications Workers of America District 1 and the National Rural Letter Carriers’ Association.",
    "Eric Henry and Tom Golonka, of the state Treasurer’s Office and Vermont Pension Investment Commission, respectively, maintained that divesting outright would be detrimental to the pension system’s return on investment.",
    "The upper chamber is conducting only pro-forma or “token” sessions on Tuesdays and Wednesdays as its members get used to legislating in person again, and so the matter will have to wait until Thursday for a vote.",
    "The news comes just a week after the U.S. Centers for Disease Control and Prevention advised states’ public health departments to move away from contact tracing and investigating every coronavirus case.",
    "Phil Scott appointed Kascenska to his new post Monday, replacing Patrick Seymour, R-Sutton, who resigned the week before the Town Meeting break to spend more time with his family, including a newborn.",
    "— Riley Robinson\nON THE CAMPAIGN TRAIL\nBrenda Siegel, an anti-poverty activist who has run for governor and lieutenant governor in prior Democratic primaries, is thinking of giving it another shot.",
    "Tom Golonka, who chairs the state Pension Investment Commission, told VTDigger that the move was made by investment firm BlackRock, not at the specific request of anyone in state government.",
    "Some demonstrators, wearing yellow and blue ribbons pinned to their jackets — in the colors of the Ukrainian flag — said they planned to attend the twice-weekly gathering until the war ends.",
    "But as public health policy shifts to living with Covid rather than eradicating it, Vermont expects to wind down its contract with AM soon, state epidemiologist Patsy Kelso said on Tuesday.",
    "Most notably, her 27-day campout on the Statehouse steps earlier this fall pushed the governor to re-expand eligibility for an assistance program that houses homeless Vermonters in hotels.",
    "A problem arose when offenses carried sentences that didn’t fall within the 10-year intervals between certain classes, such as manslaughter, which carries a 15-year maximum penalty.",
    "As the civilian toll in Ukraine grows and President Joe Biden bans Russian oil, state lawmakers are fast-tracking legislation to send humanitarian aid to the besieged nation.",
    "— Erin Petenko\nCORRECTION SECTION\nTom Kavet, the Legislature’s economist, wrote to me last week to say that news of his (professional) demise had been greatly exaggerated.",
    "“But I think we're asking who is most likely to be able to beat the governor and I'm the one that showed I can do that.”\nSiegel has never beaten Scott at the ballot box.",
    "But there's no way.”\n— Sarah Mearhoff\nA new oil painting, celebrating International Women’s Day, will be on display in the Statehouse Card Room until the end of March.",
    "The legislation, H.475, would fit existing crimes into specific categories — such as Class B, Class C and Class D — based on several factors, including the penalties.",
    "“There is no amount of money that will make everything right again, nor bring back those lost,” Rep. Jim Harrison, R-Chittenden, told his colleagues on the floor.",
    "Vermont can’t afford to make a mistake.”\n“She’s the only candidate who’s worked in and with Congress, and run and won statewide,” he said of the Democratic LG.",
    "The National Rural Letter Carriers’ Association represents 130,000 people nationwide, with about 350 members in Vermont, according to a campaign press release.",
    "Barbara Felitti of Huntington worked in Ukraine in the mid-2000s during a democracy-building project backed by the U.S. Agency for International Development.",
    "There’s no set timeline for the process, Kelso said, but the state expects to take over Covid contact tracing eventually, with the help of nine new hires.",
    "House Speaker Jill Krowinski assigned seat 35 to Rep. John Kascenska, R-Burke, and appointed him to sit on the Commerce & Economic Development Committee.",
    "Felitti held a sign pleading for a no-fly zone over Ukraine, which included pictures of two young boys sitting in a bomb shelter somewhere outside Kyiv.",
    "Last spring, the Vermont Department of Health outsourced the bulk of its Covid contact tracing to AM Trace, a contractor based in Leesburg, Virginia.",
    "But leadership there also plans to suspend that chamber’s rules to get the bill out the door and on the way to the governor’s desk within the day.",
    "In the past three weeks leading up to Tuesday, cases have dropped about 50% and now sit at about 140 cases per day, with 48 reported on Tuesday.",
    "In a meeting Tuesday of the Senate Judiciary Committee, lawmakers aired their feelings about the demise of S.30 and its potential path forward.",
    "Sofia Shatkivska, a Ukrainian-born artist who has lived in Vermont most of her adult life, was among the group standing shoulder-to-shoulder.",
    "Kascenska is the founder and owner of Kingdom Adventures Mountain Guides in East Burke, according to a press release sent by Scott’s office.",
    "Soon after Russia invaded, nearly two weeks ago, Shatkivska began a solitary protest on a bench outside Montpelier's post office, she said.",
    "The new plan would scale back S.30, which would have closed the Charleston Loophole by strengthening rules on firearm background checks.",
    "— Sarah Mearhoff\nCOVID CORNER\nIn the three weeks after Vermont topped 1,800 Covid cases per day on Jan. 9, cases dropped a whopping 63%.",
    "She told VTDigger last week she was considering jumping into the governor’s race, and would make a decision near the end of this month.",
    "That’s still a considerable drop, but it’s a sign that Vermont’s once-shocking drop after the Omicron variant wave may be leveling off.",
    "2 p.m. — Senate Education plans to mark up and possibly vote on S.162, an act relating to the collective bargaining rights of teachers.",
    "Meanwhile, dozens of people gathered again on State Street in Montpelier on Tuesday afternoon to protest Russia’s attacks on Ukraine.",
    "Before that, he worked for over three decades in higher education, including 25 years at Northern Vermont University’s Lyndon campus.",
    "In a campaign video, Dean said (forebodingly, but over chipper royalty free music), “The stakes are really high this election year.",
    "Shatkivska’s younger sister still lives in western Ukraine, she said, and is sheltering in a cellar with two young grandchildren.",
    "When she was at home in Washington, she wanted to “cry and scream,” she said, but the small gathering made her feel less alone.",
    "Dean has also put his money where his mouth is, maxing out his campaign donations to Gray, according to her latest FEC filings.",
    "The House suspended its rules Tuesday to move a bill sending $644,826 to Ukraine through all stages of passage in the chamber.",
    "The proposal does not change the length of sentences for most offenses, though some fines would see increases or decreases.",
    "WHAT’S ON TAP\nWEDNESDAY, MARCH 9\n9 a.m. — Senate Agriculture gets a report from the Vermont Danone Horizon Task Force.",
    "— Lola Duffort\nWHAT’S FOR LUNCH\nOn Tuesday, the cafeteria dished out pork pinwheels with wild mushroom risotto cakes.",
    "The new federal guidelines say the focus should be on prisons, jails, nursing homes and other high-risk settings.",
    "CWA District 1 represents more than 150,000 workers across New England, New York, New Jersey and eastern Canada.",
    "— Liora Engel-Smith\nThe House Judiciary Committee reviewed a bill Tuesday that included some creative figuring.",
    "— Lola Duffort\nThe state is moving away from third-party contact tracing as Covid-19 cases continue to drop.",
    "Doug Racine is also mulling a run, after finding the contest for lieutenant governor to be quite crowded.",
    "10 a.m. — House Education gets an update from Health Commissioner Mark Levine on PCB testing in schools.",
    "With crossover day rapidly approaching, senators are set to meet Wednesday to write yet another draft.",
    "Molly Gray picked up a high-profile endorsement in her campaign for U.S. House from former Gov.",
    "“I will pay more for gas to defend Ukrainian freedom and democracy,” the back of her sign read.",
    "Gasoline prices have soared to well over $4 a gallon across the country, including in Vermont.",
    "Artist Cynthia Cagle of South Burlington depicted six women leaders in politics and activism.",
    "But Siegel said even if Racine gets in, Democrats should still pick her during the primary.",
    "In the three weeks after that, the state again reported a 67% decline in new infections.",
    "“Forty million is now all my family … every Ukrainian is my family,” Shatkivska said.",
    "— Riley Robinson\nWhile Final Reading was on its Town Meeting Week hiatus, Lt. Gov.",
    "But that shouldn’t deter the U.S. from pressing forward on sanctions, she argued.",
    "He is not semiretired, as I incorrectly reported, but working 60-hour weeks.",
    "Chef Bryant Palmer said he’s planning to serve a turkey dinner on Wednesday.",
    "The painting was commissioned by the Vermont Suffrage Centennial Alliance.",
    "Vermont paid the company — now called AM — almost $15 million since then.",
    "(The process otherwise usually takes a minimum of three calendar days.)",
    "The state’s pension system is also liquidating its Russian holdings.",
    "— Ethan Weinstein\nThe House welcomed another new member Tuesday.",
    "The picture was taken by the boys’ mother — Felitti’s friend.",
    "“And she said: Please use it,” Felitti said of the picture.",
    "But she has gone toe-to-toe with him on policy — and won.",
    "“That’s what this draft attempts to do.”\nRead more here.",
    "Phil Scott on a gun-control bill he vetoed last month.",
    "“It would be lovely if we could do it by 2027.",
    "“He's a nice guy,” Siegel said of Racine.",
    "“I could never vote for that,” she said.",
    "It is Steve Klein that is retired.",
    "H.717, originally proposed by Gov.",
    "Former Democratic Lt. Gov.",
    "Zitkala-Ša, Ida B.",
    "Read more here.",
    "Read more here.",
    "Howard Dean.",
    "My mistake.",
    "Gov."
  ]
}