{
  "id": 3371,
  "mediaId": 2745,
  "date": "2022-03-09",
  "headline": "The questions in Washington haven’t changed, and Carson Wentz isn’t the answer",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Z4GEB5UTHVEUHANIJN3W3FGWEM.jpg&w=1440",
  "link": "https://www.washingtonpost.com/sports/2022/03/09/commanders-russell-wilson-trade/?utm_source=rss&utm_medium=referral&utm_campaign=wp_homepage",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Tony Banks leads to Mark Brunell, who gives way to Jason Campbell, who is replaced by Donovan McNabb, who is benched for Rex Grossman, who begets a trade up in the draft for Robert Griffin III, who gets hurt, gets healthy and eventually gets benched for Kirk Cousins, who signs elsewhere, so the team trades for Alex Smith, who suffers a devastating injury and is replaced by Case Keenum, but the team also drafts Dwayne Haskins, who lasts six starts under new coach Ron Rivera, who ends up signing 38-year-old Fitzpatrick, who lasts roughly 30 seconds before he is injured and replaced by Heinicke, who was an out-of-work math graduate student one year earlier.",
    "But remember when listening to those explanations — that he’s an upgrade over the incumbent Taylor Heinicke, that the capital they gave up doesn’t hinder their ability to continue to build the rest of the roster, blah blah blah — that the Commanders have Wentz because they failed to land Wilson, and they failed to land Wilson because they have an environment that established stars avoid like toddlers turning away from cauliflower on a fork.",
    "Here is what Indianapolis General Manager Chris Ballard, the man who gave up first- and third-round picks for Wentz just a year ago, said at last week’s scouting combine following one year of the Carson Experience: “As we sit down and work through whether Carson’s the best long-term answer or not … we’re not there yet.”\nSo welcome to Washington’s hamster wheel.",
    "Aaron Rodgers returning for what will be an 18th season in Green Bay really had nominal effect on the Commanders’ 2022 situation because it just defies logic that the player who won the past two MVP awards would survey the landscape and say, “I choose Ashburn.” But it’s still instructive because the Commanders are such a non-contender in these situations.",
    "There’s an explanation for why Washington agreed Wednesday to send a couple of third-round draft picks to Indianapolis for Wentz, who two seasons ago essentially was run out of Philadelphia in favor of decidedly unproven Jalen Hurts, then last year took the NFL’s best running game and failed to deliver the Colts to the playoffs.",
    "In general, there are two ways to land one: be fortunate enough to have a high draft pick in a year when one of those players is coming out of college or create an environment and build a roster that would be attractive to an established quarterback who is looking for new surroundings.",
    "In his one season with the Colts — a season in which no one rushed for more yards than Indianapolis running back Jonathan Taylor — Wentz averaged 6.9 yards per attempt, which tied with Heinicke for a decidedly middle-of-the-pack 20th in the league.",
    "Here’s the thing about Carson Wentz, who is set to become the new Washington Commanders quarterback: Even at 29, he’s a lot closer in profile and ability to a tired Donovan McNabb and a decrepit Ryan Fitzpatrick than he is to, say, Russell Wilson.",
    "That’s quite a run of incompetence — particularly with the next draft just seven weeks away and Washington possessing the enticing-but-dangerous combination of a vacuum at quarterback and the 11th pick in the first round.",
    "In a worst-case scenario, that could lead to a change at coach and in the front office, which would lead to a new regime having to develop and evaluate an iffy quarterback, which would just continue this bottomless cycle.",
    "On the first front: Since the last of its three Super Bowl titles following the 1991 season, Washington has drafted 14 quarterbacks, from Chris Hakel in the fourth round in 1992 to Haskins in the first round in 2019.",
    "Washington plays in an outdated, half-empty stadium for an owner who is loathed by its fan base and who oversaw a culture that demeaned and harassed women for years — a shroud that still covers the entire operation.",
    "His arrival won’t end the questions about who the long-term quarterback will be, because Washington can cut him after the 2022 season and be free and clear of any future salary cap implications.",
    "Maybe that’s better than tying your cart to one of the reclamation project quarterbacks who will be out there in free agency — Mitch Trubisky or Jameis Winston or Marcus Mariota or the like.",
    "When this offseason opened, Rivera said, “It’s time I think that we see this team start to take that big step forward.” He tried to do it by landing Wilson, which would have helped.",
    "He is a placeholder by résumé and ability, and the franchise’s endless search for a quarterback who repeatedly can lead it deep into the playoffs continues ad infinitum.",
    "He completed 62.4 percent of his passes — better than just six regular starters in the league, three of whom were rookies, and not as good as Heinicke’s 65 percent.",
    "That’s some combination of dizzying and defining, and it doesn’t even deal with the John Becks and Garrett Gilberts who filled in some of the cracks in between.",
    "Don’t even go down the road that has the Commanders both trading for Wentz and taking a quarterback in the first round — and having the season go awry anyway.",
    "They have combined to win one playoff game as starters — and that was Cousins for Minnesota, after he moved on from Washington.",
    "The Colts have a roster that is ready to win now, and they decided they would prefer to try to do it with someone else.",
    "On the second front: Don’t give me any of this “The Seahawks didn’t want to trade Wilson to another NFC team” garbage.",
    "Put another way: Wilson chose a franchise that is up for sale rather than a franchise owned by Daniel Snyder.",
    "Wilson had control here because in order for Seattle to cut a deal, he had to waive his no-trade clause.",
    "But the answer to “Who will lead this team behind center in 2023 and beyond?” is not at all clearer.",
    "Of course, those guys wouldn’t have cost any draft picks, so …\nThe draft is seven weeks away.",
    "What, they were worried about facing Washington and Wilson in the NFC championship game?",
    "Pittsburgh’s Kenny Pickett or Liberty’s Malik Willis — or both — could be there.",
    "Then Wentz becomes even more of a stopgap, and the future belongs to that kid.",
    "He now will do it by inserting Wentz, which just begets more questions.",
    "So the search for a stable, franchise-steadying quarterback continues.",
    "Wentz is just the latest to jump aboard and start running to nowhere.",
    "Rivera and his lieutenants may well have a quarterback in mind at No.",
    "So Wentz becomes Rivera’s way to kick the can down the road.",
    "No wonder quarterbacks aren’t lining up to play here.",
    "What’s believable: He would do that to go to Denver.",
    "Washington traded for a quarterback Wednesday.",
    "Go over the entire century for this franchise.",
    "It’s old news, but it’s perpetually a marvel.",
    "Oh, and it has one playoff win this century.",
    "He would not do that to come to Washington.",
    "In that way, Wentz will fit right in.",
    "They can’t and won’t choke it down.",
    "That’s telling.",
    "Go figure.",
    "Please.",
    "Ugh.",
    "11."
  ]
}