{
  "id": 341,
  "mediaId": 2586,
  "date": "2022-04-18",
  "headline": "Former Bills WR Terrell Owens Scores TD in First Game of Pro Comeback",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Terrell-Owens-e1650335532934.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/former-bills-terrell-owens-scores-td/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1509,
    4270,
    160,
    368,
    519,
    671,
    700
  ],
  "sentences": [
    "“If you look at my stats, they weren’t particularly good in the beginning of the season, but once I got with Ryan Fitzpatrick it was like ‘Fitz Magic.’”\nOwens made 55 catches for 829 yards and five touchdowns with the Bills, and had some particularly memorable plays with Fitzpatrick.",
    "@TerrellOwens is returning to @HighmarkStadm for MNF as our Bills Legend of the Game: https://t.co/DAHLkZUo55 pic.twitter.com/LrgncVh5ME\n— Buffalo Bills (@BuffaloBills) December 2, 2021\nOwens has also said he wished he could have stayed in Buffalo beyond his one season.",
    "People ask me who is your favorite quarterback and people think I’m saying it was a joke but I’m like, ‘Yo, Ryan is one of the better quarterbacks that I played with.’ I say that honestly because of how smart he is.",
    "So, always a lot of room for improvement.”\nOwens Has Fond Memories of Buffalo\nWhile Owens found plenty of controversy during his NFL career, he had one productive and drama-free season in Buffalo in 2009.",
    "As Mike Gavin of NBC Sports noted, Owens was targeted five times during the opening drive and had the chance to make one long play when he beat a defender, but the ball was underthrown.",
    "Owens Makes an Impact\nPlaying for the FCF Zappers and wearing “Prototype81” on the nameplate of his jersey, Owens showed that he can still hang with other professional players.",
    "Thirteen years after he joined the Buffalo Bills as an aging receiver in hopes of a late-career resurgence, Terrell Owens still has some gas left in the tank.",
    "The team even brought him back last season as a “Bills Legend” last season, honoring him before a Monday Night Football game against the New England Patriots.",
    "The 48-year-old Owens made his debut this week in the new Fan Controlled Football league, a 7-on-7 indoor league with some unique wrinkles.",
    "In the Fan Controlled League, fans have the power to call offensive plays and tried to feed the ball to the Hall of Famer more frequently.",
    "In an interview with The Athletic in 2020, Owens said he wished he had one full season with Ryan Fitzpatrick as his signal-caller.",
    "Owens has hinted at a comeback many times since he last played in the NFL in 2010, and started his new career off with a bang.",
    "One the final play of his team’s 20-12 loss to the Shoulda been Stars, Owens snagged a 12-yard touchdown in traffic.",
    "“I mean, obviously a little rusty, just got to get a little timing with some of the quarterbacks.",
    "Fitzpatrick took over as starter during the 2009 season, winning the job from Trent Edwards.",
    "After the game, Owens said he believes he can play even better once he shakes the rust off.",
    "— Fan Controlled Football (@fcflio) April 17, 2022\nOwens had the chance to make more plays.",
    "“Honestly, I wish I could have played another year or two (in Buffalo),” Owens said.",
    "Obviously, I think we wanted to get the win, but we came up short on that end.",
    "Owens said he still sees Fitzpatrick as one of his favorite quarterbacks.",
    "Maybe it has something to do with that Harvard education,” Owens added.",
    "But other than that, it’s football, you know what I mean?",
    "His touchdown ended up as his only catch of the game.",
    "That included a team-record 98-yard touchdown catch.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "“I’ve spoken very highly of Ryan.",
    "“I felt alright,” Owens said.",
    "Hey, we got seven more games.",
    "Get your popcorn ready.",
    "THE TOUCHDOWN SCORER?",
    "TERRELL OWENS.",
    "THE YEAR?",
    "2022.",
    "??"
  ]
}