{
  "id": 3410,
  "mediaId": 2745,
  "date": "2022-03-18",
  "headline": "Why people hated permanent daylight saving time when the U.S. last tried it",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6M2M5HR6LQI6ZPLP3I3W6RZQJY.jpg&w=1440",
  "link": "https://www.washingtonpost.com/history/2022/03/18/daylight-saving-seventies-history/?utm_source=rss&utm_medium=referral&utm_campaign=wp_retropolis",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Though Florida would be on a different schedule than the rest of the Eastern Seaboard, the governor told United Press International that any disruption “would be small indeed when compared to the life of even a single child whose death could be attributed to a too-early start of his or her school day.”\nSome schools pushed back their start times; some cities bought reflective signs for crosswalks, according to news reports.",
    "“People were saying if this had happened two years ago, McGovern would be President today.”\nDavid Prerau studied the issue as a researcher for the U.S. Department of Transportation and went on to write a book about it, “Seize the Daylight: The Curious and Contentious Story of Daylight Saving Time.” He said in an interview that the reality of the change seemed to take people by surprise.",
    "“On the other hand, daylight and darkness are still the same as they were in ’74, and kids having to go to school in the morning is still the same, and people having to go to work in the morning is still the same.”\nPrevious versions of this post incorrectly said that President Gerald Ford signed a bill repealing permanent daylight saving time on Oct. 6, 1974.",
    "Sen. Marco Rubio (R-Fla.), a co-author of the bill, called it “an idea whose time has come.”\nLawmakers from both parties championed the legislation, which still requires passage by the House of Representatives and a signature from President Biden.",
    "Signing the bill into law, he said it would “mean only a minimum of inconvenience.” Seventy-nine percent of Americans favored the change at the time, according to polling by NORC at the University of Chicago.",
    "“Today the Senate has finally delivered on something Americans all over the country want — to never have to change their clocks again,” said Sen. Patty Murray (D-Wash.), another co-author.",
    "People didn’t think about that.”\nFrustration over the shift took on a new sense of urgency when reports emerged of children being hit and killed by cars during predawn treks to school.",
    "When federal officials pitched the concept, the nation was in the grips of an energy crisis because of the Organization of Arab Petroleum Exporting Countries declaring an oil embargo.",
    "The Post ran a story on “inventive Washington mothers improvising outerwear” from fluorescent fabrics, complete with photographs of kids wearing their handiwork at bus stops.",
    "The Senate voted this week to end the twice-annual practice of “springing forward” and “falling back,” setting the stage for daylight saving time to last all year.",
    "On Day One, the New York Times reported, hundreds of tourists missed flights from Puerto Rico, which remained on standard time, to the continental United States.",
    "That month, a National Safety Council survey found no appreciable change in the number of early-morning fatalities between January 1973 and January 1974.",
    "“The time to admit a mistake is when you’ve made one,” Rep. William Ketchum (R-Calif.), a co-author of the bill, was quoted as saying in the Times.",
    "The New York Times called it “the Second Dark Age.”\n“Pitch black at 7:30 in the morning,” a Long Island man named Bob Fitzpatrick told the Times.",
    "Amid a swell of public displeasure and a series of early-morning traffic fatalities, Congress voted to undo the change 10 months in.",
    "The article noted that some companies planned to offer jackets with reflective detailing in their back-to-school lines.",
    "The thinking was that fuel consumption would go down as Americans used the extra evening sunshine for heat and light.",
    "President Richard M. Nixon estimated that 150,000 barrels of oil could be saved a day, the New York Times reported.",
    "I’m just staying in bed.”\nSo it went the last time the United States took a run at year-round daylight saving time.",
    "“And they don’t think, ‘Oh, I’m going to have four months of dark mornings.’ I think that’s what happened in ’74.",
    "Reubin Askew (D) called a special legislative session Jan. 27, urging state lawmakers to change back the clocks.",
    "The experiment, which meant a sunrise of 8:30 a.m. or later for large swaths of the nation, proved short-lived.",
    "Grasping for solutions, lawmakers made daylight saving time permanent from January 1974 until October 1975.",
    "And a Reuters report said the United States had used about 2 percent less energy because of the change.",
    "Commuters grumbled about having to descend to the subways and report to work without glimpsing the sun.",
    "On Oct. 5, President Gerald Ford signed it, and three weeks later, Americans rolled back their clocks.",
    "Public support for the extended daylight saving time had plummeted to 42 percent, according to NORC.",
    "It was still dark when most Americans set off for work and school the morning of Jan. 7, 1974.",
    "Throughout the week, newspapers carried reports of bleary-eyed commuters and nervous parents.",
    "In August, the same month Nixon resigned over Watergate, the Senate voted to repeal the law.",
    "“Daylight time is like darkness time,” declared a headline in The Washington Post.",
    "“Most people think, ‘Oh, I’m not going to have to change my clock,’ ” he said.",
    "They argued that the clock-changing ritual carries health and safety risks.",
    "“It’s the end,” Terry Minz, of Long Island, N.Y., told the New York Times.",
    "Clocks would “spring forward” and not “fall back” for almost two years.",
    "People always grouse about losing an hour of sleep in the spring.",
    "Prerau wasn’t surprised that doing away with it came up again.",
    "The semiannual routine returned and has continued ever since.",
    "Still, the country was ready to go back to the old times.",
    "Some kids carried flashlights on their way to school.",
    "The House passed a similar measure soon after.",
    "And, they pointed out, many Americans hate it.",
    "The comet, the energy crisis, now darkness.",
    "As for whether it’ll last, he isn’t sure.",
    "Almost 50 years later, the idea is back.",
    "After eight deaths in Florida, Gov.",
    "“It’s a different time,” he said.",
    "This post has been corrected.",
    "“I can’t cope anymore.",
    "He signed it Oct. 5."
  ]
}