{
  "id": 3430,
  "mediaId": 3992,
  "date": "2022-03-08",
  "headline": "Winter Paralympics: Medal haul beyond dreams - Menna Fitzpatrick",
  "image": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/CBD5/production/_123518125_gettyimages-1379744271.jpg",
  "link": "https://www.bbc.com/sport/winter-sports/60664639?at_medium=RSS&at_campaign=KARANGA",
  "mediaOutlet": "BBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Brown",
  "authorUrl": "",
  "termIds": [
    2388,
    3590,
    5240,
    5266,
    5370
  ],
  "sentences": [
    "She broke her leg at the end of the 2019/20 season, had to do most of her rehab over Zoom during lockdown, and then split from previous guide Jennifer Kehoe last summer.",
    "\"We also know that the competition might get a bit stronger - there's a few more athletes, really good athletes, coming to join us in the next races.",
    "\"To even just become a Paralympian is amazing - but to come along with four medals in Pyeongchang and then two here is better than what I dreamed.\"",
    "Visually-impaired skier Menna Fitzpatrick says adding two more Paralympic medals to her collection at Beijing 2022 is \"better than she dreamed\".",
    "Since her success in South Korea and a world title the following year, it has been a turbulent build-up to these Beijing Games for Fitzpatrick.",
    "Fitzpatrick and Smith will next race in the women's visually-impaired giant slalom on Friday, before finishing with the slalom on Sunday.",
    "Her new guide, Katie Guest, then tested positive for Covid-19 just before the Games and Fitzpatrick teamed up with Smith instead.",
    "\"All I wanted to be was a Paralympian, since the age of about four or five,\" Fitzpatrick told BBC Sport Wales.",
    "\"Every medal is special its own right but some of them really do mean quite a lot,\" Fitzpatrick continued.",
    "A silver and bronze in China have cemented her status as Britain's most-decorated Winter Paralympian.",
    "The latter was the event in which Fitzpatrick won Paralympic gold in back in 2018.",
    "\"It has been a long two years and it just makes it sweeter [winning two medals].",
    "So we'll just again try to do our best and let's see what's happens.\"",
    "We just go into each race, try our best and hope the results happen.",
    "The 23-year-old previously won four medals at Pyeongchang 2018.",
    "Thankfully we've come up with some really good results.",
    "\"We're absolutely thrilled with how we've performed.\"",
    "\"Confidence is really high,\" said Fitzpatrick.",
    "\"We've done some great performances.",
    "\"We weren't really expecting it.",
    "It does mean everything."
  ]
}