{
  "id": 3467,
  "mediaId": 6570,
  "date": "2022-03-08",
  "headline": "What the 2022 franchise tag numbers mean for Steelers' negotiations with Minkah Fitzpatrick",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/20220116mfsteelerssports07-2-1646752711.jpg",
  "link": "https://www.post-gazette.com/sports/steelers/2022/03/08/pittsburgh-steelers-2022-franchise-tag-numbers-upcoming-minkah-fitzpatrick-contract-negotiation/stories/202203080088",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ray Fittipaldo",
  "authorUrl": "",
  "termIds": [
    2272,
    2506,
    3106,
    3773,
    3817,
    4507,
    4606,
    671,
    823,
    930
  ],
  "sentences": [
    "“I’m talking to him, getting a feel for the organization.”\nThe next day, Watt became the NFL’s highest-paid defender although Adam Schefter of ESPN reported he went against the advice of his agents and accepted the deal the Steelers had on the table when his agents believed they could extract more money for him.",
    "If the Steelers cannot come to terms with Fitzpatrick this summer they can tag him next year at this time and could potentially save around $3 million all while controlling his rights through the 2023 season after which another long-term deal could be discussed.",
    "The Steelers structure contract in ways that virtually guarantees money in the first two years of the deal and makes it punitive for the team in terms of their salary cap if the player is cut before the contract expires.",
    "(Harrison Smith of the Vikings has a similar deal with an average annual salary of $16 million, but there is an out in his deal after the 2022 season that significantly reduces the average annual value of his contract.)",
    "For argument’s sake, let’s say Fitzpatrick shoots for $16.5 million a year on a typical Steelers structure, meaning no team out clauses in the middle of the contract as most other teams do.",
    "In 2020, the Steelers tagged linebacker Bud Dupree, and although it was a more amicable situation, he left as a free agent the following year after a long-term deal could not be negotiated.",
    "One other negotiation to watch this year that could impact the Fitzpatrick negotiations is the one between the Bengals and safety Jessie Bates, who was designated with the tag on Monday.",
    "Fitzpatrick, who is set to earn $10.6 million on the fifth-year option of his rookie contract, knows his negotiation could go well into next summer just as Watt’s did.",
    "Even if the franchise tender rises to $13.5 million for safeties in 2023 it will be well short of the contract Fitzpatrick would like to sign this summer.",
    "The Steelers won’t be tagging anyone, but one of the numbers lends some insight into what their negotiation with safety Minkah Fitzpatrick will be like.",
    "The real number, however, might be $15.4 million because the Seahawks can opt out of the deal in 2023 after three years and $46.4 million paid out.",
    "That’s the average compensation for Seahawks safety Jamal Adams, who signed a four-year, $70 million deal last year with $38 million guaranteed.",
    "“I would love to get it done to guarantee the future and have it all done, but that’s up to the people upstairs when they want to get that done.",
    "If Fitzpatrick is intent on becoming the NFL’s highest-paid safety he’ll need to earn more than $17.5 million per year on his next deal.",
    "It never became contentious because Watt was in the building with his teammates and working out under the supervision of team personnel.",
    "He played on the tag in 2017, but he sat out the 2018 season after he was tagged again when a long-term deal could not be worked out.",
    "That’s up to them.”\nSteelers fans might want to brace for another “hold-in” this summer and another down-to-the-wire negotiation.",
    "Broncos safety Justin Simmons, who signed a four-year, $61 million deal last year, is a two-time second-team All-Pro.",
    "Fitzpatrick watched closely last summer as T.J. Watt went through his long and hard negotiation with the Steelers.",
    "Bates, who was named second-team All-Pro last year, will be looking for a long-term deal along with Fitzpatrick.",
    "The Steelers went down this road with Le’Veon Bell in 2017 and 2018, and it did not turn out well.",
    "“That’s not really on my terms,” Fitzpatrick said two days after the playoff loss to the Chiefs.",
    "“I’m paying attention to it,” Fitzpatrick said in September as Watt’s negotiations dragged on.",
    "(He was a second-round pick so there was no fifth-year option on his 2018 rookie contract).",
    "Fitzpatrick is a two-time first-team All-Pro, earning the recognition in 2019 and 2020.",
    "Fitzpatrick could do the same if he’s intent on setting the market for safeties.",
    "Watt sat out all of training camp and signed two days before the season began.",
    "The non-exclusive franchise tender for safeties is $12.9 million in 2022.",
    "Adams is a nice player, but he’s only been named All-Pro once — in 2019.",
    "Ray Fittipaldo: rfittipaldo@post-gazette.com and Twitter @rayfitt1.",
    "There are some things they want to get done before they sign me.",
    "The NFL set the franchise tag numbers for this year on Monday.",
    "They have free agency coming up and all that stuff.",
    "He just wasn’t taking part in practices.",
    "First Published March 8, 2022, 7:00am",
    "And why wouldn’t he?"
  ]
}