{
  "id": 3478,
  "mediaId": 2745,
  "date": "2022-03-09",
  "headline": "With Carson Wentz, the Commanders hope his production finally matches his talent",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LLVOG3VBWRADLGM37YBVV34FRA.jpg&w=1440",
  "link": "https://www.washingtonpost.com/sports/2022/03/09/carson-wentz-commanders-analysis/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "After Wednesday’s trade, the Athletic reported that some unidentified members of the Colts’ organization were frustrated with Wentz for “a lack of leadership, a resistance to hard coaching and a reckless style of play, which had a role in several close losses this year.”\n“[The Colts are] more disappointed in the day-to-day person and the locker room leader he must be,” ESPN analyst Dan Orlovsky said on the air shortly after the trade.",
    "He cut down on the negative plays that plagued him in Philadelphia — his seven interceptions tied a career low, and his eight fumbles were his fewest — and his completion percentage climbed from a career-worst 57.4 in 2020 to a career-average 62.4.",
    "“Been walking that one out my whole career, trying every day to figure out how to toe the line of being aggressive, trying to be a playmaker, trying to make things happen but being smart,” Wentz told reporters before the season.",
    "The Colts’ stunning loss to the two-win Jacksonville Jaguars that kept them out of the postseason wasn’t entirely on Wentz — the defense and his offensive supporting cast shared the blame — but he shouldered a sizable chunk.",
    "But even if the Commanders’ coaches can’t help Wentz improve, even if he remains a quarterback with a chasm between his talent and his production, he figures to be an upgrade over Taylor Heinicke in ability and consistency.",
    "Last season, wideout Michael Pittman Jr. (1,082 yards, six touchdowns), one of his only consistent options, became his second 1,000-yard receiver (joining Eagles tight end Zach Ertz, who had 1,163 in 2018).",
    "Wentz will turn 30 in December and was just traded away by his biggest advocate, Colts Coach Frank Reich, who was the Philadelphia Eagles’ offensive coordinator during Wentz’s MVP-caliber 2017 season.",
    "At his end-of-season news conference, Colts General Manager Chris Ballard divulged that he had a lengthy conversation with Wentz after Week 18 in which he urged him to make smarter, safer decisions.",
    "It’s difficult to know how much blame falls on coordinator Scott Turner because he has spent the bulk of his tenure calling plays for limited quarterbacks in Dwayne Haskins, Alex Smith and Heinicke.",
    "Wentz, an established NFL starter, was considered for most of this past season about league average, and he should bring some of the stability that Ryan Fitzpatrick was expected to offer in 2021.",
    "But Wentz is a complicated player who not only has struggled to use his physical skills judiciously but has gained a reputation as a player who makes crushing mistakes in the biggest moments.",
    "During his news conference at the NFL combine last week, Ballard hinted that Wentz needed to learn to better handle criticism and that “it’ll be interesting to see how he grows from this.",
    "After two years of scrappy underdog stories, Washington made a bet that Wentz’s talent will trump his question marks and help Washington’s offense make the strides Rivera wants it to.",
    "He’s downgrading at running back — Indianapolis’s Jonathan Taylor was the class of the league last season — but getting a boost along the offensive line and with his pass catchers.",
    "In Carson Wentz, the Washington Commanders have arguably their best combination of talent and experience at quarterback since 2017, Kirk Cousins’s final season with the team.",
    "Still see mechanical deficiencies at times, which can force him to miss some layups.”\nLast year, until the Colts’ late-season collapse, Wentz played relatively well.",
    "Ballard said he told Wentz that he needed to get the ball out quickly — which is what Commanders Coach Ron Rivera said about Heinicke at times last season.",
    "He also showed an ability to run, picking up 215 yards (and 21 first downs), though admittedly Wentz’s scrambles lack the flair of Heinicke’s pylon dives.",
    "But like Heinicke early in the season, Wentz seemed to have trouble balancing his aggressive style with the conservative approach his coaches wanted.",
    "“Would think the team is betting on the physical tools, 2nd/3rd level throws in Scott Turner’s offense,” ESPN analyst Matt Bowen wrote.",
    "The combination of wide receiver Terry McLaurin, running back Antonio Gibson and tight end Logan Thomas, among others, should help.",
    "Under Rivera, Washington often has been led by quarterbacks with physical questions and loads of charisma (Heinicke and Smith).",
    "Questions about his leadership have lingered for years, most notably when the Eagles benched him for Jalen Hurts in 2020.",
    "I think he will.”\nIn Washington, Wentz may have one of the best supporting casts of his career.",
    "Per ESPN, his total quarterback rating of 4.3 was one of the worst for any passer all season.",
    "Wentz completed 17 of 29 passes for 185 yards, one touchdown and one interception.",
    "This is key for a Washington offense that has struggled for the past two years.",
    "Wentz is capable of stretching the field, attacking intermediate windows.",
    "It’s fair to wonder whether Wentz will fare any better with Washington.",
    "The latest and most dramatic example came last season in Week 18.",
    "“Deep in-breakers, skinny posts, play-action/boot concepts.",
    "He took six sacks and lost a fumble.",
    "Wentz may represent a shift."
  ]
}