{
  "id": 3511,
  "mediaId": 2713,
  "date": "2022-03-15",
  "headline": "Victoria’s fails in drive to attract foreign healthcare workers",
  "image": "https://static.ffx.io/images/$zoom_0.3531%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/f19c2ad44095e8bc051483445e62dc3091e6d597",
  "link": "https://www.smh.com.au/national/victoria/victoria-s-fails-in-drive-to-attract-foreign-healthcare-workers-20220310-p5a3nk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Gordon",
  "authorUrl": "https://www.smh.com.au/by/josh-gordon-hve2g",
  "termIds": [
    0
  ],
  "sentences": [
    "“According to the Commonwealth government, 90 per cent of applications are done within 20 months.”\nThe association specifically wants the Commonwealth to remove age limits for permanent residency for health-sector workers, cut the limit on working hours for international students, and streamline the immigration process for foreign professionals.",
    "“The extra nurses and midwives have helped, but our focus must be on supporting and valuing the precious nursing and midwifery workforce we have and ensuring they have the right working conditions.”\nWith Lucy Carroll\nThe Morning Edition newsletter is our guide to the day’s most important and interesting stories, analysis and insights.",
    "Share\nNormal text sizeLarger text sizeVery large text size\n40\nView all comments\nA Victorian government plan to hire up to 1000 overseas health workers to tackle severe staff shortages in hospitals has so far attracted only about 100 people, heightening concerns the state could soon lack enough qualified people in essential services.",
    "The body, representing Catholic-run health services, wants a moratorium on labour market testing, which requires businesses to first advertise jobs within Australia before recruiting overseas, as a short-term solution to the staff retention crisis while a wage case plays out before the industrial umpire.",
    "Health Minister Martin Foley in October announced the scheme to attract overseas workers to tackle severe staff shortages.Credit:Luis Enrique Ascui\nThe federal government also announced last year it would ramp up efforts to attract thousands of health workers from overseas.",
    "“These nurses, doctors, midwives and allied health professionals are in high demand right across the world and are making a big difference on the ground.”\nAbout 300 international healthcare workers are understood to have recently started work in Victoria.",
    "Australia’s largest aged-care body, Catholic Health Australia, has also called on the federal government to temporarily dump a rule forcing it to prioritise hiring local staff so the sector can recruit overseas to stop the closure of homes.",
    "Hospital sources unable to speak publicly have warned Victoria will have limited capacity to catch up on an elective surgery backlog unless state and federal governments ramp up efforts to recruit foreign health professionals.",
    "In October, federal Health Minister Greg Hunt said doctors and nurses who had already applied to come to Australia would be able to sidestep travel restrictions as part of a national plan to attract 2000 extra health workers.",
    "Credit:Chris Hopkins\nIn October last year the Andrews government announced a $2.5 million package to recruit up to 1000 extra healthcare workers living overseas to help ease pressure on the overburdened hospital system.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "“Health workers have been desperately needed across the world and in their own countries, so it’s no surprise health services have been unable to recruit additional staff despite the incentives,” she said.",
    "At the time, the government said priority for relocation assistance would be given to the first 1000 healthcare workers who started work at a Victorian health service, “as soon as possible”.",
    "“Our international healthcare workers who have touched down in Victoria have helped boost our frontline workforce, including our response to COVID-19,” the spokesman said.",
    "Australian Nursing and Midwifery Federation secretary Lisa Fitzpatrick said the federal government needed to increase its financial support to help the workforce expand.",
    "“If we don’t make it easier for healthcare workers to come ... we will get caught up in a worsening global shortage of qualified people to deliver healthcare,” he said.",
    "Victorian Healthcare Association chief executive Tom Symondson said state and federal governments needed to make it easier for healthcare workers to come to Victoria.",
    "The idea was to pay the relocation costs for nurses, doctors, midwives and allied health professionals, including Australians living overseas who wanted to come home.",
    "That represents a fraction of the extra health workers needed to tackle the unmet demand as the state deals with elective surgeries postponed during the pandemic.",
    "The Royal Melbourne Hospital said its delegates were currently in the United Kingdom to attend recruitment fairs to attract more international healthcare workers.",
    "But five months later, The Age has been told by well-placed hospital sources that the scheme has so far managed to attract only 100 extra staff to Victoria.",
    "A spokesperson for the federal Health Department said 609 nurses and 33 midwives had taken up employment in Australia between July 2021 and January 2022.",
    "In October last year, the Australian College of Nursing estimated there were more than 12,200 vacant nursing positions in Australia.",
    "But it was unclear how many arrived under the federal scheme, which began in October 2021 and was supposed to run for six months.",
    "By Josh Gordon and Sumeyya Ilanbey\n March 16, 2022 — 5.00am\n Save\nLog in, register or subscribe to save articles for later.",
    "A spokesman for Health Minister Martin Foley said the government was “working hard to attract more international workers”.",
    "“For example, the skilled regional visa can take more than a year to process for some people,” Mr Symondson said.",
    "He said it remained a difficult and lengthy process for overseas healthcare workers to take jobs in Victoria.",
    "According to the International College of Nurses, there is a global shortage of 5.9 million nurses.",
    "But problems with recruiting more health professionals have been exacerbated by global shortages.",
    "A plan to attract up to 1000 international healthcare workers has fallen well below its targets.",
    "That figure includes about 100 who arrived under the relocation scheme.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "The problem is not unique to the health sector.",
    "Thank you for reading the Herald.",
    "This article is complimentary.",
    "Sign up here.",
    "Hide content"
  ]
}