{
  "id": 3558,
  "mediaId": 2551,
  "date": "2022-03-13",
  "headline": "Rory McIlroy somehow stays alive at the Players Championship after he is saved by malevolent drama... as Scott Piercy becomes the hapless victim of the unpredictable 17th hole with a quadruple bogey in front of thousands",
  "image": "https://i.dailymail.co.uk/1s/2022/03/13/21/55308165-0-image-a-84_1647205945495.jpg",
  "link": "https://www.dailymail.co.uk/sport/golf/article-10608881/Rory-McIlroy-stays-alive-Players-Championship-Scott-Piercy-victim-hole-17.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Derek Lawrenson for the Daily Mail",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Derek+Lawrenson+for+the+Daily+Mail",
  "termIds": [
    2012,
    3200,
    4127,
    4407,
    5371
  ],
  "sentences": [
    "It's hard to do justice to how much more difficult it was for players in his half of the draw, but the starry cast list of those who headed home early, cursing their misfortune, tells its own story: Collin Morikawa, Jordan Spieth, Brooks Koepka, Xander Schauffele and Brits Matt Fitzpatrick and Lee Westwood to name just a few.",
    "+3\nView gallery\nTommy Fleetwood is two shots off the lead held by American pair Sam Burns and Tom Hoge\n'It must have been five shots harder for those guys,' added Paul Casey, who shot 69 to stand on the same five under mark as Fleetwood, in a tie for fifth.",
    "+3\nView gallery\nIt looked like Rory McIlory would be exiting the Players Championship with a two over total\nOn the 18th green his last chance appeared to have gone when Peter Malnati made a miraculous par to finish on one over.",
    "As if all the carnage witnessed on the infamous par three on Saturday was not enough, the thousands who gathered there got to witness another hapless victim when American Scott Piercy stepped on to the tee.",
    "McIlroy had battled the brutal gusts manfully the previous day to play 21 holes in just one over par for a two over total - but it appeared for all the world as if it would be one shot too many.",
    "Rory McIlroy was heading for the unluckiest missed halfway cut of his career at the Players Championship before the island green 17th hole staged one more act of malevolent drama to save him.",
    "said a smiling Tommy Fleetwood, after adding a 73 yesterday to his opening 66 to be two shots off the halfway lead held by Americans Sam Burns and Tom Hoge, both PGA Tour winners this year.",
    "+3\nView gallery\nMcIlory was saved by Scott Piercy's hapless stumble on the famously unpredictable 17th hole\nThe way this hole messes with the heads of golfers.",
    "Given the weather had warmed up considerably from the frigid temperatures early on and there was little wind, there appeared no chance.",
    "Off he trudged to the drop zone, where he managed to miss the generous-sized green once more, this time from just 90 yards.",
    "'I'm sure I've had a day and a half off before but it felt much longer than that by the time we played,' said Fleetwood.",
    "Piercy's tee shot looked long as soon as he hit it, bouncing once before disappearing into the water.",
    "The halfway cut came at a time when players would normally have been starting their final rounds.",
    "For McIlroy to be given a lifeline, therefore, he needed Piercy to drop four shots in two holes.",
    "Sixty-five players and ties make the cut – and there were exactly 65 on one over.",
    "Back at the 17th Piercy, in the last group out, was on two under.",
    "Two putts later, and Piercy was marking down a quadruple bogey.",
    "At the 17th on the Stadium Course, there is always a chance.",
    "I've never been shivering like that in Florida before.'",
    "Now, it will be touch and go to finish by sunset today.",
    "Not that it was easy for these players, on two counts.",
    "'We've had an amazing piece of luck, haven't we?'",
    "It looked all over for Rory at this point.",
    "Unbelievably, McIlroy was now safe.",
    "'It was also so cold."
  ]
}