{
  "id": 3576,
  "mediaId": 2553,
  "date": "2022-03-13",
  "headline": "The World Reacts To Tom Brady Announcing NFL Comeback",
  "image": "https://dw-wp-production.imgix.net/2022/03/Screen-Shot-2022-03-13-at-6.36.39-PM.png?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/the-world-reacts-to-tom-brady-announcing-nfl-comeback",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "https://t.co/U2u8l6HZMb\n— Harry Zahn (@harry_zahn) March 14, 2022\nWhen your wife tells you you need to start doing the dishes every night, and those bins aren't taking themselves out – sometimes it's just time to play on:) https://t.co/19VODyrntv\n— Trevor Long (@trevorlong) March 14, 2022\nThis man has 7 Super Bowls and still has unfinished business https://t.co/wXmxNT3B9d\n— TickPick (@TickPick) March 14, 2022\nSends a message to dads everywhere that this life isn't for everyone.",
    "https://t.co/1892OCyg25\n— John Hyslop (@sloprules) March 14, 2022\nA day after watching 37-year-old Cristiano Ronaldo score a hat-trick at Old Trafford, 44-year-old NFL quarterback Tom Brady cancels his retirement and will be back for another season at Tampa https://t.co/EsJq0XLJyF\n— Simon Carswell (@SiCarswell) March 13, 2022\nDidn't some dude just spend $500K on Tom Brady's last TD football?",
    "I don’t think that’s over with.”\n“He’s still able to play at a high level,” he added, “and the way his season ended for him, I would think that with the team he has, give it at least one more shot.”\nRelated:\nTom Brady To Star In Road Trip Comedy Movie With Lily Tomlin, Jane Fonda, Rita Moreno, And Sally Field: Report\nThis is a developing news story; refresh the page for updates.",
    "“I have loved my NFL career, and now it is time to focus my time and energy on other things that require my attention.”\nHall of Fame NFL quarterback Joe Montana told TMZ back in mid-February that he believed that Brady was “crazy” to retire right now with the team that he has in Tampa Bay and that Brady is not done playing football.",
    "Unfinished business LFG.”\nThe Tampa Bay Buccaneers responded, “Tampa Tom is BACK.”\n— Tampa Bay Buccaneers (@Buccaneers) March 13, 2022\nMuch of the reaction was pure shock, while some called him out for making the announcement on Selection Sunday, which is when the NCAA tournament bracket is released.",
    "“I have always believed the sport of football is an ‘all-in’ proposition – if a 100% competitive commitment isn’t there, you won’t succeed and success is what I love so much about our game,” Brady wrote in an Instagram post.",
    "“These past two months I’ve realized my place is still on the field and not in the stands,” Brady wrote in a tweet that garnered hundreds of thousands of engagements in a mere matter of minutes.",
    "There are no shortcuts to success on the field or in life.”\n“This is difficult for me to write, but here it goes: I am not going to make that competitive commitment anymore,” Brady continued.",
    "Tens of thousands of people instantly reacted to legendary quarterback Tom Brady announcing on Sunday that he was returning to play a 23rd season in the NFL for the Tampa Bay Buccaneers.",
    "https://t.co/wX62pXwXxC\n— Percy Allen (@percyallen) March 13, 2022\nWhen Ronaldo asked him if he was coming back you could see in his face that he wanted it.",
    "https://t.co/ZKyqUG14VR\n— Arash Markazi (@ArashMarkazi) March 13, 2022\n— Ian Rapoport (@RapSheet) March 13, 2022\nExciting news for the sports world.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "Happy to see Tom Brady for another season https://t.co/Yp5edQYd1O\n— Josh Norris (@JoshNorris) March 13, 2022\nWHAT IN THE WORLD IS HAPPENING?!?!?",
    "— SB Nation (@SBNation) March 13, 2022\nOn February 1, Brady officially announced his retirement from the NFL in a post on Instagram.",
    "https://t.co/AyCnim19XL\n— Laurie Fitzpatrick (@LaurieFitzptrck) March 13, 2022\nWhy retire when you're playing unreal football?",
    "“There is a physical, mental, and emotional challenge EVERY single day that has allowed me to maximize my highest potential.",
    "Makes sense that TB12 makes the announcement today as that gives TB UFAs heads up as \"legal tampering\" begins tomorrow.",
    "Many made note of how short the retirement was given that Brady just announced 40 days ago that he was retiring.",
    "#BEASTwriter | #GoBucs | #TB12 https://t.co/HhYbXDAz6A\n— Ryan Sakamoto (@BEASTwriter) March 14, 2022\nDude.",
    "https://t.co/2kEOQpNRmI\n— Wes Rucker (@wesrucker247) March 13, 2022\nTom Brady is turning 45 in August.",
    "– He is the career passing yards, passing touchdowns and passing completions leader.",
    "“Look at the team he’s got, why would you want to leave that?” Montana said.",
    "Condolences to whoever paid over $500k for his \"final\" touchdown ball.",
    "– He is coming out of retirement for \"unfinished business.\"",
    "Get inside access to The Daily Wire by becoming a member.",
    "Good news that the GOAT is returning for a 23rd season.",
    "I love my teammates, and I love my supportive family.",
    "The bad news is that the other 31 wish he retired.",
    "And I have tried my very best these past 22 years.",
    "Create a free account to join the conversation!",
    "I’m coming back for my 23rd season in Tampa.",
    "– He has won 7 Super Bowl titles.",
    "– He has won 5 Super Bowl MVPs.",
    "This is College Basketball Day.",
    "“I don’t think it’s done yet.",
    "They make it all possible.",
    "Hard not to root for him.",
    "I'd hate to be that guy.",
    "– He has won 3 NFL MVPs.",
    "“That time will come.",
    "Takes a true warrior.",
    "But it’s not now.",
    "Wait a day."
  ]
}