{
  "id": 3586,
  "mediaId": 2932,
  "date": "2022-03-15",
  "headline": "MS382.001E: Interview with Betty Cunningham and Linda Williams (transcript)",
  "image": "https://archive.org/services/img/ms-382-001-e-transcript",
  "link": "https://archive.org/details/ms-382-001-e-transcript",
  "mediaOutlet": "archive.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    786,
    992,
    1190,
    4837
  ],
  "sentences": [
    "Digital copies of resources which are made available by BCSC include materials for which any of the following circumstances may apply: 1) the rights to the resource are held by BCSC; 2) the copyright holder has given BCSC permission to make the resource available for personal or research use; 3) the resource is available under an exception or limitation to US copyright law, such as 17 USC 107 and 17 USC 108(h); or 4) there are no known restrictions on use.",
    "Betty Cunningham and her daughter Linda Williams were interviewed by Friends of the North Carolina Room volunteers Tealey Ellis and Judith Robertson on June 13, 2018 at the interviewees' home on Merrill Road in Fairview.",
    "If you believe that we have made a mistake and wish for your material to be removed from our site, please contact us with the URL for the item and the reason for the takedown request.",
    "Any display, publication, or public use must credit Buncombe County Special Collections, Pack Memorial Public Library, Asheville, North Carolina.",
    "For permission for commercial use, or to remix, transform, or build upon materials, please contact Buncombe County Special Collections (BCSC).",
    "It is the user's responsibility to research copyright and seek permission from the copyright holder of any resource found on this site.",
    "Citation\nFairview Community History Project, Buncombe County Special Collections, Pack Memorial Library, Asheville, NC.",
    "BCSC adheres to U.S. copyright law and respects the copyright and intellectual property rights held by rights holders.",
    "BCSC is not liable for use or reproduction of this material if there is a claim by a third party.",
    "This interview was collected as part of the Fairview Community History Project.",
    "Description\nThis is a transcript of an oral history interview.",
    "Repository\nRights and licensing\nCC BY-NC-ND.",
    "The audio recording is available here.",
    "Transcribed by Pat Fitzpatrick."
  ]
}