{
  "id": 3609,
  "mediaId": 2637,
  "date": "2022-03-10",
  "headline": "Seahawks Next QB Odds: Drew Lock trails 'Any Rookie'",
  "image": "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.3.1/websites/images/np/favicon-np.ico",
  "link": "https://nationalpost.com/pmn/sports-pmn/seahawks-next-qb-odds-drew-lock-trails-any-rookie",
  "mediaOutlet": "news.nationalpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Seahawks Week 1 QB Odds (SportsBetting.ag)\nDrew Lock (-130)\nMalik Willis (+400)\nDeshaun Watson (+600)\nGeno Smith (+900)\nMarcus Mariota (+1200)\nMitchell Trubisky (+1600)\nJameis Winston (+1600)\nKenny Pickett (+1800)\nMatt Corral (+2000)\nJimmy Garoppolo (+2000)\nRyan Fitzpatrick (+2000)\nTeddy Bridgewater (+2000)\nCam Newton (+2800)\nDesmond Ridder (+5000)\nSam Howell (+6600)\n–Field Level Media",
    "Seahawks 1st Snap QB:\nAny Rookie QB: -150\nDrew Lock: +125\nGeno Smith: +500\nGardner Minshew: +500\nJimmy Garoppolo: +600\nJameis Winston: +600\nMarcus Mariota: +700\nDeshaun Watson: +700\nJacob Eason: +800\nLock has started 21 of 24 games through his first three seasons while throwing for 4,740 yards, 25 touchdowns and 20 interceptions.",
    "Coach Pete Carroll said the team hopes to re-sign Geno Smith, Wilson’s backup the past two seasons, but he will become a free agent and has an off-field incident hanging over his head following a January arrest for suspicion of driving under the influence.",
    "Article content\nWhat the Seattle Seahawks plan to do at the quarterback position is one of the great mysteries of the NFL offseason after they agreed to trade Russell Wilson to the Denver Broncos.",
    "Article content\nSportsBetting.ag went a step further in breaking out the rookie quarterbacks individually in the sportsbook’s prop market for who will start for Seattle in Week 1.",
    "Article content\nMinshew, who starred at Washington State, as well as Winston and Mariota are considered the top pending options on the free agent market.",
    "9 and 40 overall picks in the 2022 NFL Draft will be part of the package heading Seattle’s way when the new league year officially starts next week.",
    "Lock and former University of Washington star Jacob Eason will be the only two quarterbacks on the roster once the trade becomes official.",
    "So there is certainly the potential for Carroll and Schneider to identify a quarterback they see as an immediate fit in this year’s draft.",
    "Pittsburgh’s Kenny Pickett, Ole Miss’ Matt Corral, Cincinnati’s Desmond Ridder and North Carolina’s Sam Howell also are listed as options.",
    "However, the immediate future is clouded by a thin free agent class and a quarterback draft class widely considered to be weak.",
    "Watson’s status remains in limbo while his legal situation in Texas plays out, and he could yet face punishment from the NFL.",
    "Garoppolo is widely expected to be dealt by San Francisco, but it’s unlikely the 49ers would ship him to a division rival.",
    "Carroll and general manager John Schneider selected Wilson with the 75th overall pick in 2012 and started him as a rookie.",
    "Lock is the early leader, followed by Liberty quarterback Malik Willis, who may be available to the Seahawks at No.",
    "Article content\nFew believe Lock is the team’s short-term answer at quarterback much less its long-term one.",
    "DraftKings is offering a “first-snap” market on who will be under center for the Seahawks in Week 1.",
    "The Seahawks will have eight total picks once the trade is finalized, including Nos.",
    "“Any Rookie” leads the way at -150, followed by Lock (+125) and Smith (+500).",
    "He has been accused of sexual improprieties by multiple women.",
    "He has an 8-13 career record, including 0-3 last season.",
    "Three-year veteran Drew Lock and the Nos.",
    "41, 72 and 107 overall.",
    "9."
  ]
}