{
  "id": 3654,
  "mediaId": 2796,
  "date": "2022-03-05",
  "headline": "Zelenskyy's emotional, direct Zoom plea to Congress: No-fly zone, Russian oil ban, more military aid",
  "image": "https://static.politico.com/f1/52/0ae0c2124125a088acc204ee2bd5/russia-ukraine-war-disinformation-23850.jpg",
  "link": "https://www.politico.com/news/2022/03/05/zelenskyy-plea-congress-aid-00014419?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "mediaOutlet": "politico.eu",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2976,
    3709,
    3975,
    1263,
    5287,
    5366
  ],
  "sentences": [
    "According to another person who was on the call, Schumer told Zelenskyy he was “inspired by you and the strength and courage of the Ukrainian people.” He also vowed to work with Senate Minority Leader Mitch McConnell to deliver the Biden administration’s recent request for $10 billion in military and humanitarian assistance for Ukraine, which is likely to materialize as soon as next week.",
    "| Ukrainian Presidential Press Office via AP\nBy Andrew Desiderio\n 03/05/2022 12:19 PM EST\nUkrainian President Volodymyr Zelenskyy implored U.S. lawmakers on Saturday to do more to force Russian leader Vladimir Putin to the negotiating table and end the war on his country — including the establishment of a no-fly zone, additional direct aid and a ban on oil imports from Moscow.",
    "And I will do all I can to help the administration to facilitate their transfer.”\nBut Zelenskyy’s call for a no-fly zone has been met with stiff resistance from the West, even from Congress’ most hawkish voices, because it would put the U.S. in a direct military conflict with Russia.",
    "In a private Zoom call with Senate and House members, Zelenskyy expressed appreciation for the actions taken so far by the U.S. and NATO allies as Russia continues assaulting Ukraine, including sanctions and weapons transfers, according to five people who participated in the call.",
    "The Ukrainian leader also urged the U.S. to ban Russian oil imports — a cause with bipartisan support on the Hill but plenty of domestic political volatility — and target its sanctions regime directly at the Russian people, the people said.",
    "He sought to tie Russia’s war on Ukraine directly to European security by noting that Ukraine has 15 nuclear plants, contending that continued bloodshed could cause a nuclear disaster with ramifications for the entire continent.",
    "He said the Russian people need to feel the pain of the sanctions given how much Ukrainians are suffering and specifically mentioned cutting Russians off from Visa and Mastercard, a step that has already been set in motion.",
    "Later in the call, Zelenskyy said U.S. and European sanctions — which have already effectively crippled Russia’s economy — should specifically target ordinary Russians, according to three of the people who participated.",
    "Sen. Marco Rubio (R-Fla.), for example, recently said setting up a no-fly zone would start “World War III” because it would lead to the shooting-down of Russian planes by the U.S. and NATO allies.",
    "On Friday, he said those who oppose a no-fly zone are “weak” and “insecure.” It was the biggest ask during his call with lawmakers on Saturday, according to those who participated in it.",
    "“This will become Europe’s problem” if the U.S. and NATO countries don’t take additional actions, Zelenskyy said through a translator, according to two of the people who participated.",
    "One of them described Zelenskyy not as angry, but rather “measured in expressing his huge appreciation” for what the U.S. and European allies have already done in support of Ukraine.",
    "Ukrainian President Volodymyr Zelenskyy speaks to the nation in Kyiv, Ukraine on Feb. 27, 2022, in this photo taken from video provided by the Ukrainian Presidential Press Office.",
    "“President Zelenskyy made a desperate plea for Eastern European countries to provide Russian-made planes to Ukraine,” Senate Majority Leader Chuck Schumer said in a statement.",
    "He called on lawmakers to pressure eastern-flank NATO partners to approve the transfer of planes that Ukrainian pilots are already trained to fly.",
    "White House officials have said implementing an embargo would reduce the global supply of oil and likely lead to higher gas prices for Americans.",
    "Dick Durbin (D-Ill.), Rob Portman (R-Ohio), Jeanne Shaheen (D-N.H.), as well as Reps. Brian Fitzpatrick (R-Pa.) and Marcy Kaptur (D-Ohio).",
    "An emotional Zelenskyy told participants on the call, who numbered more than 300, that it might be the last time they see him alive.",
    "One of the sources described Zelenskyy’s plea as a shift in the way he has been communicating about the threat of nuclear disaster.",
    "Still, Zelenskyy has continued to press for such a move, arguing it would help alleviate the suffering of the Ukrainian people.",
    "After the Zoom meeting ended, lawmakers praised Zelenskyy and reiterated some of his calls for additional military assistance.",
    "The U.S. got 3 percent of its oil imports from Russia in 2021, according to the American Fuel & Petrochemical Manufacturers.",
    "But Zelenskyy made a direct appeal for more, those people said, including planes, drones and Stinger anti-aircraft missiles.",
    "The Biden administration has also resisted banning Russian oil imports, despite growing bipartisan support for the idea.",
    "Fitzpatrick joined the call from the Poland-Ukraine border, where he is on a bipartisan congressional delegation trip.",
    "Zelenskyy spoke with President Joe Biden by phone later Saturday, the Ukrainian president said in a tweet.",
    "Both credit card companies announced later Saturday that they were suspending operations in Russia.",
    "Nearly all of the hundreds of participants in the earlier Zoom call were lawmakers.",
    "In addition to Schumer and McConnell, Zelenskyy was questioned by Sens.",
    "Burgess Everett and Alexander Ward contributed to this report.",
    "The White House confirmed the more than 30-minute call.",
    "“These planes are very much needed."
  ]
}