{
  "id": 3691,
  "mediaId": 4045,
  "date": "2022-02-28",
  "headline": "Paul Sullivan: With Aaron Rodgers and Phil Mickelson around, we could all use a break from the world of sports",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/8/7c/87c53c87-c122-5040-8083-eea6b0658c7f/621cd1ec4ad71.image.jpg?crop=1675%2C879%2C0%2C178&resize=1200%2C630&order=crop%2Cresize",
  "link": "https://www.stltoday.com/sports/football/paul-sullivan-with-aaron-rodgers-and-phil-mickelson-around-we-could-all-use-a-break/article_858e23b8-9f08-50d8-b387-481836f63509.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Sullivan",
  "authorUrl": "",
  "termIds": [
    1313,
    1451,
    1703,
    2195,
    2237,
    3044,
    3462,
    4408
  ],
  "sentences": [
    "“Phil’s always had a reputation amongst the players as trying to manipulate almost every scenario to benefit himself.”\nThat’s a description that perfectly fits Aaron Rodgers, the Green Bay Packers quarterback who apparently didn’t learn a lesson from last year’s offseason antics when he kept fans guessing about his future.",
    "Instead we’re treated to the thoughts of minor-leaguers who won’t even make the 2022 roster and seeing grainy photos of Commissioner Rob Manfred emerging from hibernation like baseball’s Bigfoot, trying to heroically settle the owners’ lockout before Monday’s deadline that would postpone the start of the regular season.",
    "Manfred earlier this month bragged that “in the history of baseball, the only person who has made a labor agreement without a dispute — and I did four of them — was me.” Yet this was the first time he has engaged with the union since the lockout began in December, leaving the negotiations to mere mortals.",
    "Because this is a once-in-a-lifetime opportunity to reshape how the PGA Tour operates.”\nAfter a public outcry, Mickelson released a statement saying his comments were “off the record” and “out of context” — which author/reporter Alan Shipnuck refuted — while apologizing for the inflammatory words.",
    "He teased them again last week with an Instagram post expressing “gratitude” to “teammates … past and current,” adding he loved them and would “cherish the memories we’ve made.”\nThe next day Rodgers appeared on the “Pat McAfee Show,” an outlet that never challenges Rodgers’ views.",
    "Mickelson told a reporter he considered joining a proposed Saudi-financed rival golf league, despite Saudi Arabia’s alleged involvement in the murder of U.S. citizen and journalist Jamal Khashoggi, just to get the PGA Tour to change its ways — meaning more money for golfers.",
    "Instead, Rodgers told McAfee there would be no news and explained the cryptic post was simply the result of his 12-day Panchakarma cleanse — a holistic healing treatment that includes therapeutic vomiting, detoxification of the blood, yoga and meditation.",
    "Defenseman Calvin de Haan and goaltender Marc-André Fleury, for instance, were excused from practice earlier this week for “maintenance.” This can be general soreness or just a mental break for a player to get his body and mind in tune for upcoming games.",
    "“I’m beyond disappointed and will make every effort to self-reflect and learn from this.”\nGolf Channel analyst Brandel Chamblee called it “one of the worst apologies I’ve ever seen written” and compared Lefty unfavorably with Tiger Woods.",
    "Jacksonville Jaguars\nChicago Bears\nWashington Commanders\nNew York Giants\nNew York Jets\nA nightly look at the day\\'s top sports stories, and a first look at the topics St. Louis fans will be talking about tomorrow.",
    "It also would be nice to be able to enjoy the rites of spring training — hearing real major-leaguers telling us about how they lost weight during the offseason and are committed to having a great season.",
    "Sports is supposed to be a diversion from real-world problems, a chance to relax and enjoy athletes competing without worrying about wars, inflation, crime, a pandemic or any other modern-day stressor.",
    "And with recent changes in attitudes regarding the importance of maintaining one’s mental health, particularly during the COVID-19 pandemic, no one needs to apologize for taking time off to recharge.",
    "If you didn’t know better, you’d think that the owners want games postponed to force the players union to cave in to their demands and that they sent in Manfred at the last minute just for show.",
    "Felt an immense amount of gratitude.”\nExcuse us while we all induce some therapeutic vomiting of our own to cleanse ourselves of Rodgers’ incessant craving for media attention.",
    "We can start with a moratorium on Phil Mickelson, the golfer who decided to go into hiding after being exposed as the selfish, money-obsessed guy we always suspected him to be.",
    "“I’d dare say 100% of the players out there would rather play with Tiger and they recognize Tiger for being authentic,” Chamblee said.",
    "Pro sports seasons are a long grind, and finding a way to keep athletes mentally and physically prepared is an ongoing struggle.",
    "Fans could use a maintenance day, or perhaps even a week, to help us deal with the current goings-on in the world of sports.",
    "The days of Cal Ripken Jr. shrugging off aches and pains to keep his consecutive games streak alive are ancient history.",
    "Now we all might need a break from the constant stream of idiocy that’s causing stress rather than reducing it.",
    "The cleanse put Rodgers in the mood for thanking everyone in sight, including former fiancee Shailene Woodley.",
    "Like all NHL teams, the Chicago Blackhawks send out daily medical updates about players’ injuries.",
    "Talks ended Saturday with no progress toward a deal, making a postponement of opening day likely.",
    "“It was reckless, I offended people, and I am deeply sorry for my choice of words,” he said.",
    "We’d all be immensely grateful if he would just go away for a while and detox out of sight.",
    "If he’s such a master negotiator, why wasn’t Manfred involved in talks all along?",
    "Everyone tuned in as if it were a reality-show finale, waiting on the big reveal.",
    "“We know they killed Khashoggi and have a horrible record on human rights.",
    "“They’re scary (bleeps) to get involved with,” Mickelson said.",
    "But players aren’t the only ones in dire need of a break.",
    "Five NFL teams that could make a surprise run in 2022.",
    "Knowing all of this, why would I even consider it?",
    "When I come out (I feel) just intense gratitude.",
    "They execute people over there for being gay.",
    "“It’s kind of a recentering,” he said.",
    "Anyone up for a maintenance year?",
    "That was just where I was at.",
    "“Takes away mental stress.",
    "The next Bengals?"
  ]
}