{
  "id": 3698,
  "mediaId": 2658,
  "date": "2022-03-04",
  "headline": "Democrats spar over Russia oil embargo",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/morning-energy/2022/03/04/democrats-spar-over-russia-oil-embargo-00014077",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2034,
    2697,
    3257,
    4330,
    4466,
    305,
    343,
    5287
  ],
  "sentences": [
    "His press secretary Jen Psaki told reporters Thursday that “we don’t have a strategic interest in reducing the global supply of energy, and that would raise prices at the gas pump for the American people.”\nThat sparked an outcry from Manchin, who declared “they are so wrong,” while calling Psaki’s comments “irresponsible.”\nDespite the continued White House resistance to a U.S. oil embargo, the ranks of supporters are swelling.",
    "Democrats spar over Russia oil embargo\nBy JOSH SIEGEL\n03/04/2022 10:00 AM EST\nPresented by the Edison Electric Institute\nWith help from Catherine Morehouse, Zack Colman and Jordan Wolman\nEditor’s Note: Morning Energy is a free version of POLITICO Pro Energy’s morning newsletter, which is delivered to our subscribers each morning at 6 a.m.",
    "FERC UNDER FIRE: Manchin and Senate Energy Committee Republicans attacked FERC on Thursday over its recent shift to scrutinize the climate and environmental justice effects from new pipelines and LNG projects, arguing it would strain the U.S.’ ability to help European allies during global emergencies like the Russian invasion of Ukraine.",
    "She also said monitoring showed “no elevated radiation readings near the facility.”\nOn the Hill\nGAS CAN GET MUCH HIGHER: Americans are going to see even higher gasoline prices as a result of Russia’s war on Ukraine, while transportation and energy costs will also rise for businesses, Federal Reserve Chair Jerome Powell said Thursday.",
    "You are going to deal with something that has enormous implications for people’s pocketbooks, and their jobs, and their communities.”\nOther Democrats, meanwhile, are denying that banning Russian oil would alter already skyrocketing prices, noting the U.S. prohibition would only affect a small slice of the global energy market.",
    "They want Raimondo to dismiss the petition without even opening an inquiry, writing that even the “threat of an investigation” is causing “significant disruption in domestic solar deployment and imperiling the Biden-Harris Administration’s climate goals.” The agency must decide next week whether to open the tariff probe.",
    "Follow us on Twitter\nMatt Daily @dailym1\nGloria Gonzalez @ggonzalez2176\nMatthew Choi @matthewchoi2018\nZack Colman @zcolman\nAlex Guillen @alexcguillen\nBen Lefebvre @bjlefebvre\nAnnie Snider @annelizabeth18\nKelsey Tamborrino @kelseytam\nCatherine Morehouse @cmorehouse10\nJosh Siegel @SiegelScribe\nFollow Us",
    "The Grid\nSaudi crown prince plays the oil card in quest for U.S. recognition via Reuters\nVenezuela asks Wall Street to help lift U.S. sanctions so oil can flow via Wall Street Journal\nLukoil, a Russian oil company, calls for an end to the Ukraine war via New York Times\nTHAT’S ALL FOR ME!",
    "Beyond the Beltway\nFOSSIL FUEL DOMINANCE HARD TO KICK: Carbon emissions would fall just 1.8 percent through 2050 under current U.S. laws and regulations despite renewable energy nearly doubling its share of the nation’s energy mix, the Energy Information Administration said Thursday.",
    "Around the Agencies\nNO ON SOLAR TARIFFS: A group of utilities and renewable energy developers wrote to Commerce Secretary Gina Raimondo on Thursday, urging her agency to reject a petition to expand solar tariffs on China to four Southeast Asian nations, POLITICO’s Gavin Bade reports.",
    "Reminder: California-based Auxin petitioned Commerce last month, arguing that solar cells and modules imported from Malaysia, Thailand, Cambodia and Vietnam nearly always originate in China, and should be covered by tariffs that hit imports from the world’s second largest economy.",
    "Lead co-sponsor Sen. Joe Manchin (D-W.Va.), who chairs the Energy and Natural Resources Committee, said Thursday he would take the blame for a jump in gasoline prices that would likely follow a move to restrict supply from Russia, one of the world's top energy producers.",
    "House Speaker Nancy Pelosi said Thursday that she backs the growing push to ban Russian oil, while Manchin and Murkowski’s bill has a total of 18 co-sponsors, nine from each party, ranging from liberal Sen. Brian Schatz (Hawaii) to GOP hawk Sen. Lindsey Graham (S.C.).",
    "Democratic FERC commissioners, however, defended the policy implemented just two weeks ago, contending that rather than delaying fossil fuel infrastructure projects, the change would head off legal challenges and help resolve many of the current permitting disputes.",
    "FLIPPIN’ OVER PHILLIPS: Some Republican senators targeted FERC’s newest Commissioner Willie Phillips during the hearing, implying he had misled them during his confirmation hearing in emphasizing that reliability and affordability were of central importance to him.",
    "Several Democrats have proposed a nationwide gas tax holiday to ease the pressure of rising inflation stemming from residual economic challenges caused by the pandemic, but the idea is failing to gain traction as Russia’s war has worsened those problems.",
    "HOLIDAY BLUES: House Speaker Nancy Pelosi may be down with banning Russian oil, but she’s throwing cold water on a push by some of her vulnerable members to suspend the federal gas tax unless the legislation expressly protects consumers at the pump.",
    "His shouldering of ownership comes after his fellow co-sponsor Sen. Lisa Murkowski (R-Alaska) told yours truly in an interview that blocking Russian oil to stop Russian President Vladimir Putin is worth the “hurt” of higher prices to Americans.",
    "A report from BloombergNEF and the Business Council for Sustainable Energy found that greenhouse gas emissions in the U.S. rose in 2021 compared to 2020 as the country began its pandemic recovery, but emissions are still down from 2019 levels.",
    "But the utilities and independent developers, represented by the group American Clean Power, argue that doing so would have a “chilling effect” on solar deployment and affect more than 80 percent of the large-scale projects planned this year.",
    "“If there was a poll being taken and they said, ‘Joe, would you pay 10 cents more per gallon to support the people of Ukraine and stop the support of Russia?’ I would gladly pay 10 cents more per gallon,” Manchin said at a press conference.",
    "Driving the day\nOIL EMBARGO STANDOFF: More and more congressional Democrats are backing a bipartisan legislative push to block Russian oil despite the White House's opposition, setting up a potential standoff with their party’s leader.",
    "EIA projected renewable energy would account for 16 percent of the U.S. energy picture by midcentury, up from 8 percent today, while petroleum and natural gas would remain relatively constant at 37 percent and 32 percent, respectively.",
    "“If there is a significant supply disruption with respect to Russian crude … that will be very difficult for the market to make up and therefore that will lead to, I think, significantly higher prices,” Woods told CNBC on Thursday.",
    "“I can't square those statements with the decision to approve these orders.”\nMurkowski also grilled the commissioner on affordability, asking him how such a policy would help low-income communities with their power and gas bills.",
    "Total carbon emissions rose 5.8 percent – due in part to coal-fired power rising year-on-year for the first time since 2014 to 22 percent of electricity generation, up from 19 percent the prior year, as natural gas prices rose.",
    "BloombergNEF and BCSE identified a record $105 billion was invested in new U.S. clean energy assets in 2021, up 11 percent from 2020, while China spent more money than any other country on energy transition investments.",
    "Phillips, who during his confirmation hearing also pledged a focus on climate and environmental justice, argued the policy would help lower costs to consumers by avoiding the lengthy court battles seen by some projects.",
    "Republicans are motivated to bail on Russian energy as a means to make the case for more domestic production — but the case is less clear cut for Democrats that have a larger stake in the outcome as the party in power.",
    "QUICK FIX\n— A growing bipartisan group of lawmakers wants to block imports of Russian oil despite the White House's opposition, setting up a potential standoff between Congressional Democrats and their party’s leader.",
    "— Opponents of FERC’s new policy for reviewing natural gas pipelines are floating the notion that Congress could reverse the agency’s plans to take climate change and environmental justice into greater consideration.",
    "“That sounds good, but do you know, there is no guarantee the oil companies pass that reduction onto the consumer,” Pelosi said during a press conference Thursday, which Oriana Pawlyk covered for Pro’s.",
    "“Tell me how ... this is actually going to help either those families that you are familiar with or the families that I represent, because I don't see this taking us in the right direction,” she said.",
    "Those numbers would not get the U.S. anywhere near Biden’s goal of hitting net-zero emissions on the power grid by 2035 and economywide by 2050, although he is banking on new policies to get it done.",
    "Finance Committee Chair Ron Wyden (D-Ore.) told ME that he asked his staff to check the accuracy of news reports that many U.S. refiners have not imported Russian crude since Putin invaded Ukraine.",
    "Kudos to Frank Maisano of Bracewell for knowing that Mike Mogis and Justin Oberst, brother of Bright Eyes frontman Conor, started a record label named after Saddle Creek, a street in Omaha, Neb.",
    "told FERC Chair Richard Glick he had “no confidence” that he would fix things, and he said the committee \"should be prepared to use every tool available at our disposal to clean up this mess.\"",
    "That’s because the boom in carbon-free energy would not be enough to replace natural gas and petroleum, which would remain the top U.S. fuel sources, as Zack Colman reports for Pro’s.",
    "“During your confirmation hearing you assured us that ‘the cornerstone of utility service is reliability,’ and emphasized the need to make sure power bills are affordable,” he said.",
    "Energy Secretary Jennifer Granholm tweeted that she spoke with Ukraine's energy minister about the situation and said the “reckless” military operations around the plant must cease.",
    "But he said the extent of the fallout will depend on how long markets continue to have anxieties about the energy supply, as POLITICO’S Victoria Guida reports.",
    "“Russia has already created the rise in price.”\nNews broke overnight that the Russians attacked Ukraine’s Zaporizhzhia nuclear power plant, sparking a fire.",
    "Power from all zero-carbon sources (renewables plus nuclear) met 40 percent of electricity demand while U.S. primary energy consumption rose 4.4 percent.",
    "Check out the POLITICO Energy podcast — all the energy and environmental politics and policy news you need to start your day, in just five minutes.",
    "— Gasoline prices could rise even higher depending on how long Russia’s war in Ukraine goes, warns Federal Reserve Chairman Jerome Powell.",
    "His company this week halted operations in Russia, while Shell and BP have announced that they will divest their assets in the country.",
    "For today: In honor of this week's finale of the Jeen-Yuhs documentary on Netflix, what was Kanye West's first single to top the U.S.",
    "“You would expect at least a little bit of lower economic activity.”\nExxon CEO Darren Woods also said prices could go much higher.",
    "Opponents floated the notion that Congress could seek to reverse the new policy, as Catherine Morehouse reports for Pros.",
    "But overall U.S. oil and gas consumption will still grow even if it doesn’t increase market share, EIA’s analysis showed.",
    "The POLITICO Pro platform combines the news you need with tools you can use to take action on the day’s biggest stories.",
    "“People will feel that certainly at the gas pump,” Powell told lawmakers in testimony to the Senate Banking Committee.",
    "Reps. Josh Gottheimer (D-N.J.) and Brian Fitzpatrick (R-Pa.) have introduced a matching House version of the bill.",
    "Biden spoke with Ukrainian President Volodymyr Zelenskyy to receive an update on the fire, the White House said.",
    "“I don’t think it’s going to make a big difference,” Sen. John Hickenlooper (D-Colo.), a co-sponsor, told ME.",
    "But the White House knows full well that President Joe Biden would bear the blame.",
    "On today's episode: Why lawmakers are pushing to ban Russian oil imports.",
    "LOOKING IN THE REARVIEW: What was the energy picture like this past year?",
    "“If that’s the case, that has real effects on this debate,” Wyden said.",
    "EVs would compose 21 percent of the car market, up from 3 percent now.",
    "Send your tips and trivia answers to me at joshuasiegel@politico.com.",
    "Natural gas remained the largest source of generation at 38 percent.",
    "Listen and subscribe for free at politico.com/energy-podcast.",
    "“I know it’s a quaint idea [to ban Russian oil].",
    "Barrasso said he was “disappointed” in Phillips.",
    "I’m your first-time host Josh Siegel.",
    "Act on the news with POLITICO Pro.",
    "Find me on Twitter @SiegelScribe.",
    "Sen. John Barrasso, (R-Wyo.)",
    "Facts really matter.",
    "Billboard Hot 100?",
    "WELCOME TO FRIDAY!"
  ]
}