{
  "id": 3713,
  "mediaId": 2658,
  "date": "2022-03-07",
  "headline": "What will Congress give Ukraine?",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/03/07/what-will-congress-give-ukraine-00014561",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2599,
    2790,
    2976,
    3267,
    3375,
    3709,
    262,
    1124,
    5287,
    5366
  ],
  "sentences": [
    "More from Olivia: ‘Pretty far down on the list’: Why Greene and Gosar are McCarthy's unsolvable problem\nON THE GROUND — A bipartisan delegation of Democrats and Republicans on the House Foreign Affairs Committee went to the Poland-Ukraine border over the weekend where the group met with U.S. Secretary of State Antony Blinken, U.S.",
    "Extraordinary circumstances… The Committee on House Administration has determined that the convoy constitutes “extraordinary circumstances” that could allow official funds to be used for short-term lodging expenses for members and staff if their presence on the Hill is essential and no public transit option exists.",
    "By KATHERINE TULLY-MCMANUS\n03/07/2022 07:46 AM EST\nPresented by Connected Commerce Council\nWith an assist from Andrew Desiderio\nTRAINED ON UKRAINE — Some members of Congress spent the weekend on the Poland-Ukraine border, others heard Ukrainian President Volodymyr Zelenskyy’s pleas for help over Zoom.",
    "TRIVIA\nFRIDAY’S WINNER: Kevin Petroccione correctly answered that Sen. Herman Talmadge of Georgia claimed to be the rightful governor of his home state after the governor-elect (who also happened to be his father) died after winning the election but before he could take the oath of office.",
    "But don’t rack up a bill just yet: “Employees should consult with their House Office before incurring these expenses to ensure they meet the requirements.” But the scene over the weekend seemed less than dire, many reports said the convoy got itself stuck… in regular old beltway traffic.",
    "Latest letter: Speaker Nancy Pelosi (D-Calif.) announced in a Dear Colleague letter last night that the House is “exploring” legislation that would ban Russian oil imports, end trade relations with Russia and Belarus and curtail Russia’s access to the World Trade Organization.",
    "A CALL FOR TRANSPARENCY — Key public documents related to ethics, lawmakers’ legal defense funds and documents lawmakers are *supposed* to file when in negotiations for jobs after Congress have all been available only by personal escort by a member of Congress’ office.",
    "An emotional Zelenskyy — who warned lawmakers it might be the last time they see him alive — pleaded with the West for the establishment of a no-fly zone, additional military aid including planes, and a ban on Russian oil imports, Andrew reports.",
    "While Congress is gearing up to send $10 billion in additional aid this week and support is growing for an oil ban, there’s absolutely no appetite among Western nations for a no-fly zone, which would put the U.S. and Russia directly at war.",
    "ZELENSKYY HOUR — Around 300 lawmakers hopped on a Zoom call with Ukrainian President Volodymyr Zelenskyy on Saturday morning where they had an opportunity to hear from him for the first time since Russia invaded his country.",
    "Exhausted intern, daughter, grandaughter… Those were the guesses people on the internet had about who Rep. Sara Jacobs (D-Calif.) was when she appeared on the Zoom call with Zelenskyy alongside Majority Leader Steny Hoyer.",
    "House Sergeant-at-Arms William J. Walker and Chief Administrative Officer Catherine L. Szpindor warned House employees over the weekend about how the trucker convoy intent on blocking the beltway could impact the Capitol.",
    "In particular, a Feb. 7 dinner in D.C. with Chancellor Olaf Scholz and a bipartisan group of senators crystallized the U.S.’s belief that Germany was serious about ending its decades-long rapprochement toward Moscow.",
    "A bipartisan coalition of 36 organizations led by Demand Progress is calling on the Committee on House Administration to direct the House Clerk to examine making these public documents available online.",
    "Senate Republicans have balked at the administration’s request for Covid aid and some are willing to slow down the omnibus package in order to get an accounting of how previous Covid funding was spent.",
    "The delegation was led by HFAC Chair Rep. Gregory Meeks (D-N.Y.) and ranking member Rep. Michael McCaul (R-Texas) along with Reps. David Cicilline (D-R.I.) Gerry Connolly (D-Va.), Ann Wagner (R-Mo.",
    "TODAY IN CONGRESS\nThe House convenes at noon for morning hour and 2 p.m. for legislative business\nThe Senate convenes at 3 p.m. with a cloture vote at 5:30 p.m. on the postal service overhaul bill.",
    "The aid will be wrapped into the larger $1.5 trillion omnibus spending package that needs to pass both chambers by Friday — when current funding runs dry — in order to avert a government shutdown.",
    "A HISTORIC SHIFT — Germany’s seismic about-face on Russia and Ukraine was fueled in part by a full-court press from U.S. lawmakers, Andrew reports in a team effort with our colleagues in Europe.",
    "QUICK LINKS\nK Street was fine taking Russian cash — until it couldn't, from Hailey Fuchs\nRepublican ‘unforced errors’ threaten path to Senate control, from The AP\nThe bride wore fatigues.",
    "“The Administration and the Congress remain laser-focused on bringing down the higher energy costs for American families and our partners stemming from Putin’s invasion,” wrote Pelosi.",
    "As domestic angst about skyrocketing gas prices grows, Pelosi pointed to the 60 million barrels of oil released from the U.S. strategic reserves in an effort to stabilize the market.",
    "Ambassador to Poland Mark Brzezinski, Ukrainian activists, a team from the U.S. Agency for International Development and American military members who have been deployed to Poland.",
    "The dinner instilled a striking level of confidence in lawmakers that Germany would follow through on its commitments to exact tough punishments on Russia if it invaded Ukraine.",
    "“Members and staff that choose to drive should account for lengthy delays and consider several alternate driving routes to the Capitol campus,” they wrote in a Sunday memo.",
    "Angling for aid: This is all on top of action expected in the coming days on the $10 billion in emergency aid for Ukraine requested by the White House late last week.",
    "TODAY’S QUESTION: This foreign leader made a 13-day visit to the U.S. in September 1959 and was especially frustrated he was not able to visit Disneyland as planned.",
    "Response to Russia, from Eliza Collins and Natalie Andrews at The Wall Street Journal\nWhy Did Mark Meadows Register to Vote at an Address Where He Did Not Reside?",
    "He cited the 15 nuclear plants in Ukraine and said that a continuation of the war could cause a nuclear disaster with ramifications for the entire continent.",
    "Others want Ukraine aid to be divorced from the larger funding package -- but both Republican and Democratic leaders are on board with tying them together.",
    "“This will become Europe’s problem” if the U.S. and NATO countries don’t do more, Zelenskyy told the lawmakers, according to two participants on the call.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Monday, March 7, where constantly-clammy season is back in full force.",
    "They warned members and staff against driving and instead told them to consider telework and public transit -- trains, not buses -- this week.",
    "The group also saw border crossing and refugee admittance up close and shared their journeys – here are snapshots from Cicilline and Meeks.",
    "If you see a young woman at an event with only Members of Congress, best to assume she's also a Member of Congress,” she tweeted back.",
    "He specifically pushed for an end to Visa and Mastercard services in Russia; both companies announced a suspension later in the day.",
    "by Charles Bethea at The New Yorker\nTRANSITIONS\nHannah Stern is joining the David Lynch Foundation as government affairs manager.",
    "“Everywhere they turned, they found somebody reminding them they weren’t stepping up,” one senator who attended the dinner said.",
    "That’s House Minority Leader Kevin McCarthy’s problem with Reps. Marjorie Taylor Greene (R-Ga.) and Paul Gosar (R-Ariz.).",
    "Later, Zelenskyy said U.S. sanctions should hit ordinary Russians, too, since Ukrainian citizens are suffering as well.",
    "Don’t miss the deep dive from Matthew Karnitschnig, Hans von der Burchard, Florian Eder, and Andrew in POLITICO Europe.",
    "He promised to speak to the pair after they spoke at a recent white nationalist event, but hasn’t yet, reports Olivia.",
    "Jen Newman will be assistant VP of congressional relations at the Independent Community Bankers of America.",
    "They’ve already been stripped of committee assignments and there’s not an appetite for censure.",
    "THE SOUND OF GREENE AND GOSAR — How do you solve a problem like extremism within your ranks?",
    "She previously was a senior legislative assistant for Rep. Scott Peters (D-Calif.).",
    "Daniel J. Hillenbrand is now acting chief of staff for Sen. Jim Inhofe (R-Okla.).",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "“He absolutely delivered,” added Sen. Thom Tillis (R-N.C.), who also attended.",
    "The wedding party carried rifles and RPGs., from The Washington Post in Kyiv.",
    "She most recently was a legislative assistant for Sen. John Kennedy (R-La.).",
    "), Brian Fitzpatrick (R-Pa.), Susan Wild (D-Pa.), and Raul Ruiz (D-Calif.).",
    "It would also authorize the White House to hike tariffs on Russian imports.",
    "It won’t all be smooth sailing for the White House’s requests.",
    "He can’t just say so long, farewell, Auf Wiedersehen, goodbye.",
    "(And during the pandemic, access was restricted even further.)",
    "GOP’s Victoria Spartz, Born in Ukraine, Aims to Step Up U.S.",
    "(They were both in Alabama for a civil rights pilgrimage.)",
    "This week they’ll vote on just how much aid to provide.",
    "AROUND THE HILL\nNot much yet, but it’s sure to pick up.",
    "He retains his title as Inhofe's legislative director.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "HUDDLE HOTDISH\nTraffic report… Convoy clog ahead.",
    "GET HUDDLE emailed to your phone each morning.",
    "He most recently was comms adviser for Sen.",
    "Drew Nirenberg is joining Cavalry LLC.",
    "Send your answers to ktm@politico.com.",
    "How do you make them stay (in line)?",
    "What leverage does he have anyway?",
    "What will Congress give Ukraine?",
    "And listen to all you say?",
    "Rob Portman (R-Ohio).",
    "Read the letter.",
    "GOOD MORNING!",
    "“It's 2022."
  ]
}