{
  "id": 372,
  "mediaId": 2594,
  "date": "2022-04-10",
  "headline": "How to watch The Masters 2022 online and on TV in the UK today",
  "image": "https://static.independent.co.uk/2022/04/10/06/SEI98046699-1.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/golf/masters-2022-live-stream-watch-online-b2054841.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kershaw",
  "authorUrl": "https://www.independent.co.uk/author/tom-kershaw",
  "termIds": [
    1453,
    1913,
    2124,
    2530,
    3002,
    3515,
    3516,
    4195,
    4292,
    4447
  ],
  "sentences": [
    "Leaderboard\n-9: Scottie Scheffler\n-6: Cameron Smith\n-4: Sunjgae Im\n-2: Charl Schwartzel, ,Shane Lowry\n-1: Justin Thomas, Corey Conners\nE: Danny Willett\n+1: Jason Kokrak, Tommy Fleetwood, Collin Morikawa, Dustin Johnson, Rory McIlroy\nSelected others\nHideki Matsuyama (+2), Tiger Woods (+7), Jon Rahm (+7)\nRound four times\n3.10pm BST: Cameron Davis, Adam Scott\n3.20pm BST: Tyrrell Hatton, Billy Horschel\n3.30pm BST: Patrick Cantlay, Mackenzie Hughes\n3.40pm BST: Max Homa, Bubba Watson\n3.50pm BST: Jon Rahm, Tiger Woods\n4pm BST: Russell Henley, Daniel Berger\n4.10pm BST: Robert MacIntyre, Harold Varner III\n4.20pm BST: Tom Hoge, Sepp Straka\n4.30pm BST: Kevin Na, Seamus Power\n4.50pm BST: Joaquin Niemann, Christiaan Bezuidenhout\n5pm BST: Kevin Kisner, Matthew Fitzpatrick\n5.10pm BST: Tony Finau, Sergio Garcia\n5.20pm BST: Lucas Glover, Patrick Reed\n5.30pm BST: JJ Spaun, Min Woo Lee\n5.40pm BST: Harry Higgs, Lee Westwood\n5.50pm BST: Si Woo Kim, Hudson Swafford\n6pm BST: Marc Leishman, Talor Gooch\n6.10pm BST: Hideki Matsuyama, Viktor Hovland\n6.30pm BST: Webb Simpson, Will Zalatoris\n6.40pm BST: Dustin Johnson, Cameron Champ\n6.50pm BST: Rory McIlroy, Collin Morikawa\n7pm BST: Tommy Fleetwood, Jason Kokrak\n7.10pm BST: Corey Conners, Danny Willett\n7.20pm BST: Charl Schwartzel, Justin Thomas\n7.30pm BST: Sungjae Im, Shane Lowry\n7.40pm BST: Scottie Scheffler, Cameron Smith",
    "The 25-year-old American looked odds on to make it five out of six as he extended his lead to six shots after eight holes on Saturday and was still five ahead with five holes to play, but a late stumble at least partially opened the door for the chasing pack.",
    "Ireland’s Shane Lowry and 2011 champion Charl Schwartzel are seven shots off the pace following matching rounds of 73, with 2016 winner Danny Willett on level par and Rory McIlroy and Tommy Fleetwood part of a five-strong group on one over.",
    "Australia’s Cameron Smith is his nearest challenger, three strokes behind following a superb 68 - the only competitor to break 70 - with South Korea’s Sungjae Im two shots further back following a 71.",
    "Scheffler was the sixth player in tournament history to hold a five-shot lead at the halfway stage, with four of the previous five going on to claim the green jacket at Augusta National.",
    "Sky subscribers can stream The Masters via Sky Go,\nFor the first two rounds on Thursday and Friday, featured groups will be shown from 2pm BST, before full coverage begins at 7.30pm.",
    "Viewers in the United Kingdom can watch all of the action from The Masters on Sky Sports, with coverage across the weekend on the Main Event and Golf channels.",
    "Scottie Scheffler will take a three-shot lead into the final round of The Masters as he bids to cement his position as world No 1 with a first major title.",
    "The Masters is held over four days at Augusta National Golf Club in the state of Georgia, beginning on Thursday 7 April and concluding on Sunday 10 April.",
    "The BBC will also show highlights at the end of each day’s play, starting at just after midnight BST on Friday, Saturday, Sunday and Monday morning.",
    "Coverage of Round Three on Saturday starts at 7.30pm while the final round will be shown live from 6.30pm.",
    "Here is everything you need to know ahead of the final round of the Masters:\nWhen is it?",
    "They will also be available on the BBC iPlayer.",
    "How can I watch it online and on TV?"
  ]
}