{
  "id": 374,
  "mediaId": 2551,
  "date": "2022-04-10",
  "headline": "Seeing Tiger Woods fight through the dying of the light was heroic and Bubba Watson wears the green jacket with pride... but slow players have made themselves unwatchable - Masters hits and misses",
  "image": "https://i.dailymail.co.uk/1s/2022/04/10/22/56449275-0-image-a-14_1649627030887.jpg",
  "link": "https://www.dailymail.co.uk/sport/golf/article-10705727/Masters-Tiger-Woods-heroic-slow-players-unwatchable-hits-misses-Augusta.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DEREK LAWRENSON",
  "authorUrl": "",
  "termIds": [
    1313,
    3123,
    4501,
    4543,
    595,
    4841
  ],
  "sentences": [
    "Here, Sportsmail's DEREK LAWRENSON reveals his hits and misses...\n+3\nView gallery\nTiger Woods was heroic when fighting through pain and the dying of the light at the Masters\nHITS\nTiger Woods\nI've been lucky enough to witness all 82 of Tiger's majors as a professional and I'd definitely place this one in the top five or six.",
    "+3\nView gallery\nBubba Watson (above) pulled off a stunning shot on the 18th hole on Friday to catch the eye\nThe Patrons\nSure, they made it impossible to get a dinner reservation down Washington Road but it was good to have them back in full attendance.",
    "+3\nView gallery\nPlayers like Xander Schauffele have made themselves unwatchable due to their slow speeds\nSpitting\nAnother old chestnut that nobody does anything about.",
    "No sport is as hard to watch as golf as you walk miles and miss loads of the action, but their love for the occasion and reverence for their surroundings was plain.",
    "It was awesome watching him swat everyone aside when he was in his prime — but seeing him fight through the pain and the dying of the light was just plain heroic.",
    "Elsewhere at Augusta, Bubba Watson played a stunning shot on the 18th hole on Friday, while the patrons in attendance showed their love for the sport again.",
    "There were also brief moments that marred the showpiece, with some players now making themselves unwatchable because of their slow speed and spitting.",
    "His response to his employer Matt Fitzpatrick after the Sheffield man wondered whether to go for the green at the 13th made me laugh out loud.",
    "Tiger Woods was able to complete a memorable professional comeback by finishing the Masters and receiving acclaim for his efforts.",
    "MISSES\nSlow Play\nFair play to whoever came up with AimPoint, the complex method of reading putts adopted by so many.",
    "Billy Foster\nThe veteran caddie has been coming even longer than I have and he still takes no prisoners.",
    "Bubba Watson\nHas there ever been a Masters champion who wears the green jacket with quite as much pride?",
    "Imagine if someone in your group at your club started gobbing by the side of every green?",
    "He turned up at all the pre-event festivities for the kids suitably dressed.",
    "But they get zero thanks for their contribution to speeding up the game.",
    "And have you seen the shot he played on the 18th hole on Friday?",
    "And doing it at Augusta, of all places, well words fail.",
    "It's even better than his banana wedge to win in 2012.",
    "Why do Americans — and it is always Americans — do it?",
    "He takes so long he has made himself unwatchable.",
    "You'd report them or never play with them again.",
    "Just watch Xander Schauffele, for example.",
    "Get on with it,' he said.",
    "'I've told you the shot.",
    "Actually, don't bother.",
    "Just YouTube it.",
    "Fitz did, too."
  ]
}