{
  "id": 3788,
  "mediaId": 2586,
  "date": "2022-03-04",
  "headline": "Blockbuster Trade Proposal Sends Christian McCaffrey to Bills",
  "image": "https://heavy.com/wp-content/uploads/2022/01/Christian-McCaffrey-e1641669544998.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/blockbuster-proposal-christian-mccaffrey-bills/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1561,
    1858,
    1888,
    2238,
    3057,
    160,
    184
  ],
  "sentences": [
    "It would take some doing to fit his salary under the cap, but teams play that shell game every year.”\nB/R: #Bills could be trade destinations for Christian McCaffrey, Saquon Barkley: https://t.co/Gu2dTyDyuL\nBut as he also noted, McCaffrey has struggled with injuries, playing only 10 total games since his breakout season in 2019 where he topped 1,000 rushing yards and 1,000 receiving yards.",
    "The Buffalo Bills front office has made it clear that they want more home-run hitters on the offense next season, and an insider is weighing the odds that the Bills could trade for a dangerous — albeit injury-prone — running back.",
    "Responding to a suggestion from Bleacher Report’s Gary Davenport, De Cristofaro wrote that Carolina Panthers running back Christian McCaffrey could be an offseason trade target to give the Bills running game a major boost.",
    "Bills Could Be in the Market for Pro Bowl RB\nWhile the Bills have employed one of the league’s top passing attacks over the last two seasons, the running game has been lacking — and has become entirely stalled at times.",
    "Bills Looking for More Speed\nBills general manager Brandon Beane has made it clear that the Bills will be looking for some upgrades on offense, including a player with more home-run ability.",
    "Last year, the Bills went into the offseason with a goal to keep both the offense and defense as intact as possible, re-signing a number of key players who were headed to free agency.",
    "While it would be a risk for any team to acquire McCaffrey given his injury history, De Cristofaro thought the Bills could be a contender if the Panthers decide to trade him.",
    "“You’d love to have a RAC (run-after-catch) guy that you can get the ball to and he can turn a 5-yard pass into a 60-yard touchdown,” Beane said, via The Athletic.",
    "Wide receiver Isaiah McKenzie is headed to free agency, and shifty slot receiver Cole Beasley has reportedly been granted permission to seek a trade.",
    "The team’s primary running backs, Devin Singletary and Zack Moss, were not speedsters and not as involved in the passing game as McCaffrey would be.",
    "“But in addition to the risks that come with his injury history, spending substantial draft capital on a running back is something of a luxury move.",
    "https://t.co/TRmrJd1ZKM\n— Buffalo Rumblings (@BuffRumblings) March 4, 2022\nThe Bills could be losing some of their top offensive threats as well.",
    "“A contending team’s acquisition of McCaffrey would certainly make headlines—and send the fantasy football community into a tizzy,” he wrote.",
    "But the Bills could offset these losses by snagging a former Pro Bowl running back, David De Cristofaro of USA Today’s Bills Wire suggests.",
    "So we’ll continue to look for various ways.”\nCole Beasley granted permission by #Bills to seek trade\nWhy is this happening now?",
    "He noted that the Panters appear headed for a full rebuild, leaving the expensive McCaffrey a likely casualty.",
    "This offseason looks to bring more changes, including the potential of losing some key members of the offense.",
    "A contender would only make such a deal if it believed McCaffrey was the missing piece.",
    "“With that in mind, imagine the Buffalo Bills or Kansas City Chiefs with McCaffrey.",
    "Christian McCaffrey avoids a tackle in a game against the Buffalo Bills.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "You can never have enough of that.",
    "What are the cap ramifications?",
    "“We talked about speed here.",
    "Lots more info inside."
  ]
}