{
  "id": 3792,
  "mediaId": 2644,
  "date": "2022-03-05",
  "headline": "Better promoting its young stars is still MLB’s most important fight",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/newspress-collage-21426657-1646492297253.png?w=1024",
  "link": "https://nypost.com/2022/03/05/promoting-young-stars-mlbs-most-important-fight-post-lockout/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joel Sherman",
  "authorUrl": "",
  "termIds": [
    1631,
    2217,
    2570,
    2746,
    3640,
    3887,
    579,
    580,
    671
  ],
  "sentences": [
    "Disqualifying 26-year–olds also took out Pete Alonso, Randy Arozarena, Shane Bieber, Walker Buehler, Corbin Burnes, Carlos Corrrea, Lucas Giolito, Jonathan Loaisiga, Cedric Mullins, Bryan Reynolds and the catcher Will Smith.",
    "Yet, you should know they both sweated it — Ian had particular issues where to fit the mega-talented, but oft-absent Zion Williamson, and Ryan kept trying to figure out whether Saquon Barkley belonged on his list or not.",
    "Of the 20 players on the MLB list, just Sandy Alcantara (who turned 26 in September) and Julio Urias played at 25 last year, which means the other 18 would be eligible for a 25-and-under list again.",
    "The list did not project burgeoning prospects likely to play this year — if there is a this year — such as Seattle’s Julio Rodriguez, Baltimore’s Adley Rutschman and Kansas City’s Bobby Witt Jr.",
    "Please go gentle with Ian and Ryan, because not only did I not give them a ton of time to formulate lists, but also I offered a nebulous criteria of talent and appeal and no clear roadmap.",
    "And both guys worked at it, and I am so thankful, and I hope you, dear readers, look at the lists and form your own and debate and do all that stuff that helps make sports so much fun.",
    "Because if the ball is put in play more often, then I will see Byron Buxton running and Nolan Arenado fielding and the ballet of a well-run relay play trying to vanquish a runner.",
    "The list also did not include anyone who played in their age-26 season last year, which included Shohei Ohtani, who arguably is the most unique athlete currently in any sport.",
    "Fountains of youth: The best 25-and-under talent in MLB, NBA, NFL\nBut for my purposes, I looked at the list and don’t think MLB has to accept the back seat in young talent.",
    "The fight — the real fight — will begin as soon as MLB owners and the Players Association complete the preliminary of finalizing a new collective bargaining agreement.",
    "The league begins with “what do we need to do to enhance the health and performance of our best players.” So quarterbacks are protected from dangerous hits.",
    "To that end, I wanted to undertake an exercise in which I looked at the best 25-and-under talent in MLB, the NBA and the NFL to compare and contrast.",
    "Some of this, however, is about partnership and the need for MLB and the union to come together in a more concerted way to best promote the players.",
    "Because what comes next will determine whether they will be fighting over many more newly added billions of dollars in future CBA negotiations.",
    "I asked colleagues Ian O’Connor (NBA) and Ryan Dunleavy (NFL) to formulate top-20 lists to put side by side with mine for MLB.",
    "And maybe the inventory of 162 games makes it hard to care about any game that does not involve one of your favorite teams.",
    "So the preliminaries need to end (as important as they are), and we have to get to the most important fight for the sport.",
    "So I never fall into the “just get it done” category as much as I wish the owners and players could just get it done.",
    "But that has been hard to sell because the ball is not in play enough, and many strategies negate in-game action.",
    "In the NFL and NBA, the ball is in Josh Allen’s and Ja Morant’s hands on every offensive play by their teams.",
    "Let’s just say I don’t miss a defensive player using a hand-check to maneuver Morant and Trae Young around.",
    "The top three — Soto, Vlad Guerrero Jr. and Fenrando Tatis Jr. — all were in their age-22 season last year.",
    "MLB needs a similar fan-friendly philosophy: How do you get less standing-around-time for the stars?",
    "But Juan Soto bats, then waits until the next eight hitters take their turns before he bats again.",
    "There are already champions and All-Stars on these lists, and that are going to be Hall of Famers.",
    "The list didn’t include Dylan Carlson, Alek Manoah and Freddy Peralta, but definitely could have.",
    "The greatest athletes who have ever played major league baseball populate the game right now.",
    "There seems near universal agreement that work needs to be done together in these areas.",
    "Subtleties, one way or the other, could be worth millions of dollars, possibly billions.",
    "The main event for MLB is making sure its young stars are presented and promoted better.",
    "Again, the problem is not young talent in MLB, the problem is highlighting it better.",
    "But I think the bigger picture is what comes next after there is a signed document.",
    "But I think part of the problem is that the players do not resonate enough.",
    "The CBA serves as the spine for the day-to-day operation of the game.",
    "Because what comes next is improving the product and fan experience.",
    "It has particularly made the game hard to sell on a national level.",
    "I’d rather watch them traverse the court and transfix my attention.",
    "Is there initial backlash: “What would Dick Butkus say?” Yeah.",
    "Again, part of that is an institutional baseball problem.",
    "But that dies as Allen and Patrick Mahomes are dueling.",
    "In the NFL, for example, rules feel reverse-engineered.",
    "It is short on full national recognition of the talent.",
    "Of course, the ongoing negotiations are important.",
    "And some of it is about that inactivity.",
    "Baseball still does just fine locally.",
    "MLB is not short on talent.",
    "Because there are stars.",
    "Stars worth your time.",
    "Young stars."
  ]
}