{
  "id": 3801,
  "mediaId": 2551,
  "date": "2022-03-05",
  "headline": "Great Britain land first medal at the Beijing Winter Paralympics as skiing star Millie Knight defeats her demons to claim bronze in the women's visually-impaired downhill event",
  "image": "https://i.dailymail.co.uk/1s/2022/03/05/11/54980801-0-image-a-2_1646479119753.jpg",
  "link": "https://www.dailymail.co.uk/sport/paralympics/article-10580531/Paralympics-Knight-wins-Great-Britain-medal-bronze-womens-visually-impaired-downhill.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Oliver Salt For Mailonline",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Oliver+Salt+For+Mailonline",
  "termIds": [
    2282,
    3590,
    3799,
    3990,
    4852,
    5370
  ],
  "sentences": [
    "+3\nView gallery\nKnight claimed bronze in the women's visually-impaired downhill event on Saturday\n+3\nView gallery\nThe 23-year-old overcame her demons in the sport with the help of guide Brett Wild\n'Brett's belief and confidence in me has very much inspired me and made me want to do it not just for me, my family friends and sponsors but for him.",
    "+3\nView gallery\nSkiing star Millie Knight has delivered Great Britain's first medal at the Winter Paralympics\nKnight and Wild, who picked up a silver medal at the 2018 Games, were beaten to the gold and silver prizes by Slovakia's Henrieta Farkasova (1:19.50) and China's Zhu Daqing (1:21.75).",
    "Knight, who came close to quitting the sport after suffering a number of crashes and concussions in recent years, claimed bronze in the women's visually-impaired downhill on Saturday.",
    "With the help of guide Brett Wild, the 23-year-old finished in just one minute and 23.20 seconds of a superb run on the opening day of the competition.",
    "'At the start I was just thinking, find the seconds, do anything you can do to go faster, it doesn't matter if you're scared, keep going,' Knight said.",
    "Menna Fitzpatrick, Britain's other competitor in the woman's visually-impaired downhill, finished fifth in what is one of her weaker events.",
    "We genuinely didn't believe we were at the level that would get us a medal, especially with the standard at the moment.",
    "Skiing star Millie Knight has delivered Great Britain's first medal at the Winter Paralympics in Beijing.",
    "'I feel like I'm on cloud nine and I just genuinely can't believe that this is happening to us.'",
    "'We have gone through some tough things and it has changed us.",
    "'Crossing the line with a smile on my face was our No 1 goal.",
    "It ranks above our silver four years ago in Pyeongchang.",
    "She then added: 'This bronze is something very special."
  ]
}