{
  "id": 3803,
  "mediaId": 2528,
  "date": "2022-03-01",
  "headline": "Josh Gottheimer says it's 'massively unproductive' for Rashida Tlaib to give a State of the Union response even though he's also giving one",
  "image": "https://i.insider.com/621e2c1396929400196c088e?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/josh-gottheimer-rashida-tlaib-biden-state-of-union-response-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    1810,
    2599,
    3165,
    3975,
    4097,
    4165,
    4236,
    104,
    305,
    5180
  ],
  "sentences": [
    "Democratic Rep. Mark Pocan of Wisconsin, a former member of the No Labels-sponsored \"Problem Solvers Caucus,\" wrote an op-ed in 2018 claiming to have been \"duped\" by the organization while saying it's \"about finding more centrist, more corporate and more special interest-focused things to do.\"",
    "—No Labels (@NoLabelsOrg) February 28, 2022\nNo Labels was founded in 2010, and the group says it's created a \"rebellious but constructive third force in American government\" to tackle \"gridlock and dysfunction\" in Washington, according to the group's website.",
    "Gottheimer is a member of the \"Unbreakable Nine,\" a group of centrist House Democrats that called for the House to pass a bipartisan infrastructure bill that progressives wanted to see move alongside the Build Back Better social spending bill.",
    "Rep. Josh Gottheimer of New Jersey slammed fellow Democrat Rep. Rashida Tlaib for giving a progressive response to President Joe Biden's State of the Union address, calling it \"counterproductive\" and comparing it to \"slashing your own tires.\"",
    "Gottheimer told Axios that Tlaib's speech will highlight \"the real tension between the socialist far left and the common-sense moderate wing, which is focused on crime, costs, tax cuts and affordability, and turning the page on COVID.\"",
    "After Biden's address on Tuesday night, Tlaib will give a speech on behalf of the Working Families Party, a minor political party that works to boost progressive candidates and elected officials within the Democratic Party.",
    "But Gottheimer is giving his own response to the speech on behalf of No Labels, a centrist political organization that once contemplated launching a primary challenge against House Speaker Nancy Pelosi.",
    "It's highly unusual for even one lawmaker to formally respond to a State of the Union address by a president of their own party — and this year there are at least three such planned speeches.",
    "\"While Rep. Tlaib will not be calling people out by name, she will make it clear that Republicans and a handful of corporate Democrats are providing obstacles to the President's agenda.\"",
    "Tlaib's office, for its part, has emphasized that her speech is about backing the president's agenda and calling out those lawmakers who progressives believe are standing in the way.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "It's about delivering a popular, progressive vision that people across the country are demanding,\" communications director Denzel McCampbell told Insider last week.",
    "No Labels released a video promoting their \"bipartisan perspective\" discussion, which is scheduled to take place immediately after Biden's speech concludes.",
    "But after the infrastructure bill was signed into law, Democratic Sen. Joe Manchin of West Virginia declared his opposition and killed the legislation.",
    "Bill Clark/CQ-Roll Call, Inc via Getty Images\nRep. Josh Gottheimer slammed Tlaib for giving the Working Families Party's response to Biden's speech.",
    "Reached for comment, Gottheimer's communications director James Adams disputed the fact that Gottheimer is giving a response at all.",
    "Last year, Democratic Rep. Jamaal Bowman of New York gave the group's response to Biden's first joint address to Congress.",
    "\"It's like keying your own car and slashing your own tires,\" Gottheimer told Axios, referring to Tlaib's planned speech.",
    "\"He was invited by a group to speak about where Democrats and Republicans can work together to move the country forward.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Democratic Rep. Colin Allred of Texas is also scheduled to speak on behalf of the Congressional Black Caucus.",
    "\"The speech is about supporting President Biden and his Build Back Better Agenda for the American people.",
    "Gottheimer will be speaking alongside Republican Rep. Brian Fitzpatrick and the director of No Labels.",
    "The duo are speaking on behalf of No Labels, a centrist group that once tried to primary Nancy Pelosi.",
    "Democratic Rep. Josh Gottheimer of New Jersey outside the Capitol on October 21, 2021.",
    "But Gottheimer is also giving a response alongside Republican Rep. Brian Fitzpatrick.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "I'm sure many members will offer their perspective on the state of the union.\"",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "The video highlights crime and inflation while asking \"Is Covid over?\"",
    "Stay up to date with what you want to know.",
    "\"He is not giving a response,\" Adams said.",
    "Sign up for notifications from Insider!",
    "\"It's massively counterproductive.\"",
    "and \"What's the breaking point?\"",
    "Loading Something is loading."
  ]
}