{
  "id": 3818,
  "mediaId": 2639,
  "date": "2022-02-25",
  "headline": "Grumman polluted Bethpage's air, too, lawsuit alleges",
  "image": "https://cdn.newsday.com/ace/c:OWU4MGVhODQtMzg5NS00:NzM5NWU3/preview/1280",
  "link": "https://www.newsday.com/long-island/environment/grumman-plume-air-pollution-bethpage-c47746",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul LaRocco",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"The bar on certifying that kind of class is lower,\" Fitzpatrick said, noting that proving property damages is also something that would face fewer challenges than an injury claim because \"the causation question is probably easier to solve: You can probably get a statistician or economist to say, 'Once this environmental problem became known, the property values in the area dropped by a certain amount.'",
    "Grumman began winding down its Bethpage operation after its 1994 acquisition by Northrop Corp. That happened just as the U.S. Clean Air Act Amendments of 1990 began to take effect, including the 1996 institution of New York State’s Title V program, which for the first time required detailed annual emissions data to be reported to the state Department of Environmental Conservation.",
    "Lawyers seeking to create a medical monitoring fund for tens of thousands of people are arguing that the maker of World War II fighters and the Apollo Lunar Module between 1950 and 1994 annually released thousands of pounds of hexavalent chromium and more than 1 million pounds of trichloroethylene, or TCE, into the atmosphere as they also let the substances seep into the aquifer.",
    "The suit, in recent court filings, alleges that Grumman’s emissions data, as occasionally reported in permit applications before the early 1990s enactment of strict air pollution measures, can be used to develop a model that estimates the approximate \"excessive\" exposures to people who lived within a few miles of the 600-acre facility off Stewart Avenue.",
    "Paul Rosenfeld, a Santa Monica, California-based environmental exposure expert hired by the plaintiffs, produced a report supporting the motion that said his estimates were developed using documents including periodic Grumman state air emission permit applications filed through the mid-90s and historical meteorological and terrain data.",
    "What to know\nA class-action lawsuit seeks to create a medical monitoring fund, and obtain damages for lost property value, for tens of thousands of people who live or lived in the vicinity of Grumman's former Bethpage facility, where toxic chemicals were used for decades as solvents to produce airplane parts and other machinery.",
    "Billions in potential liability\nThe groundwater and soil contamination, as such, has been documented in formal state cleanup proposals for more than 30 years, culminating in a landmark December 2020 agreement that calls for Northrop Grumman and the Navy to spend more than $400 million to contain and ultimately remove the plume.",
    "The new theory, introduced five years into the litigation against Grumman's corporate successor, Northrop Grumman, is spotlighting the practice of using experts to prove — or discredit — historical pollution exposures that were never formally investigated by public health agencies and are no longer present in the environment.",
    "The state Department of Health’s lone Bethpage community cancer study, released in 2013 after reports of toxic soil vapors in residential homes, found no higher overall cancer rates in a 20-block area closest to the former Grumman and Navy property, even as it noted younger-than-expected cancer patients in a one-block area.",
    "Franks, a breast cancer survivor who worked as a preschool teacher, said she suspects a link between Grumman and community cancers, even without extensive studies, because she knew multiple people on the blocks directly surrounding the plants who were sickened at unusually young ages, including the best man in her wedding.",
    "The plaintiffs' allegations focus only on hexavalent chromium and TCE and don’t consider the potential air exposure risks to other toxic industrial compounds the company used and that also have been found in the groundwater and soil, such as polychlorinated biphenyl, or PCB, and perchloroethylene, or PCE.",
    "The same report said that the drinking water from one Bethpage Water District well, before the first discovery of TCE contamination in late 1976, \"could have harmed people’s health,\" citing a higher risk of immune system deficiencies, or developmental effects in infants, including fetal heart defects.",
    "But 11 current and former Bethpage residents are representing the class that, if approved by a federal judge and then settled or taken to trial, could allow upward of 50,000 people to seek money for medical care and testing, as well as damages for lost property value tied to living over the plume.",
    "The plaintiffs’ October 2021 motion for class certification argued that TCE and hexavalent chromium releases were a major factor causing residents in the proposed class boundary to have at least triple the EPA-defined acceptable lifetime cancer risk of 1 in 1 million for each year of exposure.",
    "\"But given the realities of the contamination that has occurred, I think sometimes you have to just take the situation and draw some reasonable conclusions from it,\" said Spaeth, who has viewed the plaintiffs' findings in the Grumman class action but has not been retained to work for them.",
    "No formal studies\nJeanne O’Connor, a fourth-generation Bethpage resident who has advocated for a more comprehensive state study of local cancer cases, said she always believed that air emissions, along with soil vapors, \"was the most logical route that people were being affected.\"",
    "But getting to the next step is no guarantee, he said, as personal injury cases are \"some of the most challenging\" to be certified by a judge because they have to show a common causation between the event — in this case contamination — and the injuries of a wide range of people.",
    "The suit, filed in 2016, is newly alleging that residents were exposed to these chemicals not only via groundwater and soil vapors, but also historical air emissions, which were not regularly recorded or well-regulated before Grumman's mid-1990s halting of most local production.",
    "Dr. Ken Spaeth, division chief of occupational and environmental medicine at Northwell Health and Hofstra Northwell School of Medicine, said that ideally there always would be a comprehensive health study done by a public agency to independently verify historical health risks.",
    "In a statement for this story, Northrop Grumman spokesman Vic Beck rejected air emission allegations by alluding to the long history of local and state officials finding few conclusive links between Grumman’s groundwater and soil contamination and residents’ illnesses.",
    "\"I think we all missed [it], and Grumman wanted us to miss\" it, said Paul Napoli, of Napoli Shkolnik, the Melville- and Manhattan-based personal injury firm bringing the action, which is pending a decision on class certification that could come as soon as this fall.",
    "\"Decades of testing by regulators, water districts and others has produced no evidence that residents have been exposed to substances migrating from the Navy/Grumman facility into groundwater hundreds of feet below the surface,\" Beck said in the statement.",
    "As part of the 2020 deal with the state, Northrop Grumman, on top of its plume and park cleanup responsibilities, agreed to pay local water districts more than $60 million for past and future treatment systems necessitated by the groundwater contamination.",
    "A Newsday investigation published in 2020 detailed the history of false and misleading statements, missteps and minimization — from both Grumman and regulators — that aided the plume’s steady spread and made it the region’s worst environmental crisis.",
    "Slowly, the physical education teacher in the Bronx began to view his own situation — he also suspects his children’s health issues are related to the contamination — as a way to potentially help get others access to health screenings and treatment.",
    "The 11 class representatives are not all exhibiting illnesses tied to the two chemicals, but several have had cancer, and all have a minimum of 26 times the 1 in 1 million lifetime cancer risk for each year of residing in the area, lawyers argued.",
    "The near-lifelong Bethpage resident has lived at two homes near the former Grumman facility and is now a class representative estimated by his lawyers to have a total lifetime cancer risk through toxic air emissions of at least 173 in 1 million.",
    "He then used an EPA-approved air dispersion model, known as AERMOD, to estimate the elevated cancer risks to residents based on how many years they lived near the facility, the emission levels during those years and how close they were.",
    "Confidential documents obtained by Newsday showed that the company attempted to obscure its responsibility when drinking water wells first were contaminated with chromium and TCE, but the prospect of air pollution was not addressed.",
    "Legal experts say that medical monitoring and property value damage classes are generally easier to establish than personal injury ones, where direction causation between the contamination and residents' illnesses is needed.",
    "But Napoli, who also represents more than 2,000 people in parallel personal injury lawsuits against Northrop Grumman, said he believes air pollution was not emphasized earlier because it was never a regulatory focus.",
    "\"It’s certainly going to be in the top five of what we would know as a historical or legacy type pollution matter,\" said Greg Cade, a Birmingham, Alabama, environmental lawyer who is litigating the case with Napoli.",
    "Dr. Max Costa, chairman of the NYU Grossman School of Medicine’s Department of Environmental Medicine, said that calculating historical hexavalent chromium exposure using old emissions data is an accepted practice.",
    "I happen to be one of the lucky ones,\" said Laurie Franks, 62, a class representative who has lived in Bethpage for all but four years of her life, including at a home where \"my backyard was the Grumman airstrip.\"",
    "Now 70 and settled in upstate Norfolk, she deals with Parkinson’s disease and asthma, but never connected her ailments to Grumman exposure until her sister-in-law alerted her to the class action a few years ago.",
    "Whether sickened Bethpage residents also will succeed in taking on a large corporation will hinge, at first, on whether a judge sides with the plaintiffs' experts over Northrop Grumman’s and certifies the class.",
    "Northrop Grumman responds\nAttorneys for Northrop Grumman, in filings throughout 2021 that updated the judge on the status of discovery disputes, called the air exposure theory \"spurious\" and \"unsupported.\"",
    "Todd Ommen, a Pace Law School professor who manages its environmental litigation clinic, said air pollution is generally \"transitory,\" while groundwater contaminants can linger for years or decades.",
    "Her outreach to the state Health Department, she said, was not successful, and if Grumman was emitting excessive amounts of carcinogens in the pre-regulatory era, \"They never would have caught it.\"",
    "Unlike the groundwater plume, which spread south from the facility, he alleged that residents in all directions of the old Grumman operation, including to the north, were exposed to air pollution.",
    "It contains two dozen volatile organic compounds, led by TCE, as well as so-called \"emerging contaminants\" that only began being removed by water treatment systems within the last several years.",
    "Now, a federal class-action lawsuit alleges the community’s most significant exposure to carcinogens came not from water — or the tainted soil at a Grumman dump-turned-public park — but the air.",
    "They served document requests for class discovery back in 2018,\" Katie Louise Viggiani, one of Northrop Grumman’s attorneys, told the judge during a May 2021 hearing, according to a transcript.",
    "If the class is certified, the chance of a settlement increases significantly, said Brian Fitzpatrick, a Vanderbilt Law School professor who has written extensively on class-action litigation.",
    "As later depicted in the Julia Roberts film \"Erin Brockovich,\" hexavalent chromium in the groundwater was found in the 1990s to have caused cancer in a southern California desert community.",
    "A shift in focus\nThough the class action was filed in U.S. District Court in Central Islip in 2016, it wasn’t until last year that air pollution was alleged as a primary exposure pathway.",
    "There is no evidence to support plaintiffs’ most recent allegations … Grumman complied with applicable regulatory standards and permits to protect human health and the environment.",
    "\"It gives me an opportunity to be a voice for a lot of people who don’t understand, don’t know what’s going on or just don’t have the capacity to voice it themselves,\" Blades said.",
    "Residents linked their cancers to the drinking water, despite a paucity of scientific studies and water providers’ frequent proclamations that what they pump into taps is treated.",
    "People who lived near the property’s fence line could qualify for the medical monitoring class with as little as a few months of historical residential exposure, Rosenfeld wrote.",
    "Plaintiff attorneys in the Grumman case said the company was emitting an average of more than 2,000 pounds per year of the contaminant into the air during the 1970s, for example.",
    "In 2019, the department released a health consultation that asserted public water supplies in the area, due to existing treatments, \"are not expected to harm people’s health.\"",
    "The DEC’s first formal cleanup plan was adopted in 1994, right as Grumman was leaving Bethpage, so the site was treated as inactive, with air pollution already in the past.",
    "If the class action is successful, medical monitoring funds and property value damages could bring the company's liability into the billions, the plaintiffs' lawyers said.",
    "\"If they didn't monitor it in the past, it might be a little harder to establish,\" said Ommen, who worked in the state attorney general's environmental protection bureau.",
    "The plaintiffs allege the carcinogens escaped not just through stacks and chimneys dotting the facility, but also out windows and doors, known as \"fugitive emissions.\"",
    "Regulators pushed the aerospace giant to pay for a comprehensive cleanup of the contaminant plume that has spread for more than four miles in the region’s groundwater.",
    "It showed the company that year emitted more than 500,000 pounds of TCE, a degreaser for airplane parts, and 300 pounds of hexavalent chromium, an anti-rust agent.",
    "Soil contamination at Bethpage Community Park, which was built in 1962 on land that Grumman had used to dump toxic waste and then donated, was discovered in 2002.",
    "The original complaint centered on the groundwater plume, as well as toxic soil vapors that seeped into the basements of homes closest to the former Grumman/U.S.",
    "A federal magistrate judge, after considering expert reports from the plaintiffs and Northrop Grumman, will rule on whether to certify the suit as class action.",
    "Erin Silk, a state health spokeswoman, said in an email that the department \"was not requested to evaluate historic air emission data for the Grumman facility.\"",
    "Blades, now 52, said he didn’t become engaged in the issue until about a decade ago, when he attended public hearings on the state’s then-stalled cleanup plans.",
    "Sign up for the NewsdayTV newsletter\nFrom breaking news to special features and documentaries, the NewsdayTV team is covering the issues that matter to you.",
    "Northrop Grumman asserts that many years of water quality testing and state health reports have been unable to link site contamination to residents' health.",
    "They estimated that TCE releases averaged 1.1 million pounds at its peak, but say the smaller amounts of hexavalent chromium posed a greater cancer risk.",
    "\"Most people can do these calculations,\" said Costa, who was the plaintiffs’ expert in the Brockovich case but is not involved in the Grumman litigation.",
    "\"The migration pathway and geographic extent of historical [hexavalent chromium] and TCE air contamination in Bethpage is not complex,\" Rosenfeld wrote.",
    "But seeking a medical monitoring fund as one proposed class, rather than damages directly tied to injuries, improves the plaintiffs' chances, he added.",
    "Having dealt with hexavalent chromium cancer risk of 1 in 1,000, Costa said of a 760 in 1 million risk (or 1 in about 13,000): \"I’ve seen a lot worse.",
    "It’s not like an occupational exposure, a chrome plater working inside, but it’s still not good to have [hexavalent chromium] in the air you breathe.\"",
    "Ross Meadow, 73, who has lived about a mile south of the Grumman site since 1978, recalled that the plants used to emit \"what we called a fog.\"",
    "And TCE was the contaminant central to the 1980s Woburn, Massachusetts, pollution case dramatized in the John Travolta film \"A Civil Action.\"",
    "As a class representative, she is revisiting her time growing up on Stewart Avenue from the early 1960s to mid-1970s in a different light.",
    "The study, however, acknowledged the scientific limitations that make linking residential cancer clusters and pollution nearly impossible.",
    "In late 2020, plaintiff attorneys discovered Grumman’s 1987 \"Toxic Release Inventory Report\" to the U.S. Environmental Protection Agency.",
    "\"If it helps the people in the community, I’m all for it,\" Franks said of why she is a class representative against Northrop Grumman.",
    "Her home essentially bordered one side of Grumman’s expansive grounds, where the TCE and hexavalent chromium were heavily relied on.",
    "\"But what blew me away … is realizing how much contamination was being let into the air over 300, 400 chimneys around the plant.\"",
    "\"Rather, it is a contiguous area extending outward from the Facilities due to emissions blanketing the Proposed Class Boundary.\"",
    "\"Whereas, with the water, you can see where it is today, look at the releases and it can be a little easier to reconstruct.\"",
    "It has until June to depose the plaintiffs’ experts and file its opposition brief, which will be backed by its own experts.",
    "Before then, Grumman, in most cases, would not have been required to place antipollution controls on its emission points.",
    "The National Cancer Institute has linked prolonged TCE exposure to kidney cancer, and hexavalent chromium to lung cancer.",
    "The department would not comment on the class-action allegations, she added, \"without a formal scientific data review.\"",
    "For decades, concerns over Grumman’s extensive release of toxic chemicals in Bethpage focused on impacts to the water.",
    "The formula involves the air concentration of the carcinogen per cubic meter, a person’s weight and time of exposure.",
    "After the plaintiffs reply to that, by September, a magistrate judge will decide whether the class can move forward.",
    "\"I didn’t think it was going to be poisonous,\" said Meadow, who, with his wife Arlene, are class representatives.",
    "Grumman complied with applicable regulatory standards and permits to protect human health and the environment.\"",
    "\"There are so many reasons we get sick, and it's very hard to exclude all the other reasons,\" Fitzpatrick said.",
    "In the late 1980s, at age 19, Christopher Blades was diagnosed with severe asthma that endured through his 20s.",
    "One whose property directly bordered Grumman has a cumulative risk of 760 in 1 million, the filing alleges.",
    "\"Similarly, there is no evidence to support plaintiffs’ most recent allegations regarding air emissions.",
    "Napoli recalled being \"shocked\" by the findings, which argue that Grumman underreported its emissions.",
    "That made the attorneys suspect much higher numbers during peak production of preceding decades.",
    "It previously has estimated spending more than $200 million on remediation efforts in Bethpage.",
    "After the first phase of discovery was completed last spring, the shift in focus was complete.",
    "\"You see these movies and you go, 'Oh, all those poor people,' \" Meade said in an interview.",
    "The chemicals previously have played a central role in well-known environmental litigation.",
    "Later, the park was found to also have spawned some of the worst groundwater contamination.",
    "The company has yet to formally respond to plaintiffs’ motion for class certification.",
    "Grumman's corporate successor, Northrop Grumman, says the case is without evidence.",
    "He died of lung cancer at 34, and her son’s 8-year-old classmate got brain cancer.",
    "\"I always thought it was a [soil] vapor case, a drinking water case,\" Napoli said.",
    "\"\n‘Kind of shocking’\nTeresa Meade hasn’t lived in Bethpage for more than 40 years.",
    "\"And I think exposures like this can reasonably be said to pose health hazards.\"",
    "Its lawyers call air pollution \"yet another implausible exposure pathway.\"",
    "The plume is now more than 4 miles long, 2 miles wide and 900 feet deep.",
    "Laurie Franks, class representative\n\"Too many people have died.",
    "You see these movies and you go, 'Oh, all those poor people.'",
    "And I’m just trying to do what’s right for our community.\"",
    "\"This case has been pending for four-and-a-half years.",
    "\"Air emissions were not included in those requests.\"",
    "\"Then you realize, 'Wow, that happened in Bethpage?'",
    "Then you realize, 'Wow, that happened in Bethpage?'",
    "\"They need to do the right thing by these people.\"",
    "The company said the case is without evidence.",
    "I happen to be one of the lucky ones.\"",
    "\"Not necessarily the water,\" she said.",
    "\"Too many people have died.",
    "Navy manufacturing site.",
    "It’s kind of shocking.\"",
    "It’s kind of shocking.",
    "\"It’s like algebra.\"",
    "I love my neighbors.",
    "\"I love my town."
  ]
}