{
  "id": 3822,
  "mediaId": 2584,
  "date": "2022-03-06",
  "headline": "Neil Simpson wins Great Britain’s first gold of 2022 Winter Paralympics",
  "image": "https://i.guim.co.uk/img/media/764b635330014cc2a7d7a44257c9a5096a3ff58b/0_110_3804_2282/master/3804.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3c958c5bb3d68e1c6018719f4a7ec992",
  "link": "https://www.theguardian.com/sport/2022/mar/06/neil-simpson-wins-great-britains-first-gold-of-2022-winter-paralympics",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Martin Belam",
  "authorUrl": "https://www.theguardian.com/profile/martin-belam",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s something we’ve been working towards for a long, long time, and you know, even to get to the Paralympics is a real honour.”\nNeil Simpson said that it was an advantage having his brother as his guide, explaining: “You are able to be very clear and concise in what you want, even direct and blunt sometimes.",
    "Fitzpatrick had a torrid build-up to the Games, recovering from a broken leg in March 2020 and then losing her regular guide Katie Guest who could not attend Beijing due to a positive Covid test before her departure from the UK.",
    "Norway, who dominated events at the Winter Olympics, have their first gold of these Games, with Jesper Pedersen’s victory in the men’s sitting super-G. Corey Peters of New Zealand took silver, adding to his gold from Saturday.",
    "The US para ice hockey team, the defending champions, guaranteed their passage to the semi-finals by heavily defeating South Korea 9-1, and look unstoppable after Saturday’s opening 5-0 win over 2018 silver medallists Canada.",
    "The 19-year-old, who is guided by his brother Andrew, finished 0.40 seconds ahead of Italian Giacomo Bertagnolli to go into first place, and then had to wait at the foot of the hill to see if anybody else could beat his time.",
    "One of those victories included a shock in the women’s long distance sittingcross-country where Yang Hongqiong finished over 30 seconds ahead of heavy favourite and serial gold medal winner Oksana Masters of the US.",
    "James Barnes-Miller of ParalympicsGB has qualified for Monday’s snowboard cross upper limbs division semi-finals, while Owen Pick and Ollie Hill have reached the next stage in the LL2 lower limb category.",
    "He told Channel 4: “I was so happy with how Menna had done in the downhill [where she finished fifth on Saturday], and I just kept on telling her how much I believed in her and how much she could do.",
    "I was really proud of it today.”\nFitzpatrick’s teammate Millie Knight narrowly missed out on a second medal at these Games, finishing just 0.09 seconds behind bronze medallist Zhu Daqing of China.",
    "“Initially when we came down and Andrew said we had gone in to first place, there was a bit of an anxious wait,” said Simpson, who was born with nystagmus, which causes involuntary eye movements.",
    "We put it all down on the line and really went for it and I’m just very happy with the performance.”\nHis guide Andrew told Channel 4: “It’s amazing to win it with my brother.",
    "You don’t have to beat around the bush, so that definitely helps.” It is the first time any British male athlete has won a gold medal on snow at a Winter Paralympics.",
    "Beijing’s “closed loop” Covid measures have been declared effective after just two new cases were reporting at the Paralympics in the last 48 hours.",
    "Zheng Peng won gold in the men’s long-distance sitting event to make it a double celebration for China at the Zhangjiakou National Biathlon Centre.",
    "Neil Simpson claimed Britain’s first gold medal of the 2022 Beijing Winter Paralympics with victory in the men’s Super-G vision impaired class.",
    "The Russian state news agency Tass has confirmed the Russian Paralympic Committee athletes have travelled back to Moscow.",
    "He now has five career medals, his first being silver in the giant slalom at the 2006 Turin Paralympics.",
    "I’m so proud of what we’ve achieved together.”\nGary Smith had stepped in as guide at the last moment.",
    "Menna Fitzpatrick, 23, added a silver for ParalympicsGB in the women’s Super-G vision impaired class.",
    "The silver is the fifth medal of her career, making her Britain’s most successful Winter Paralympian.",
    "“I wasn’t thinking about it being a winning performance, I was just thinking that it was a good run.",
    "China have taken the lead in the medal table with six gold, four silver and six bronze medals.",
    "The 41-year-old Taiki Morii of Japan secured bronze, as he did in Saturday’s downhill race.",
    "That bronze medal was just one of a slew for the hosts on day two of the sporting action.",
    "The nation had previously only ever won one gold medal at a Winter Paralympics.",
    "“To be here at all is a great achievement,” she said after the race.",
    "“But to stand up on that podium is absolutely amazing.",
    "The gold went to Alexandra Rexova of Slovakia.",
    "Agencies contributed to this report",
    "No one could."
  ]
}