{
  "id": 383,
  "mediaId": 2586,
  "date": "2022-04-21",
  "headline": "Bills Rumors: Trade Proposal Addresses Biggest Roster Weakness",
  "image": "https://heavy.com/wp-content/uploads/2022/03/GettyImages-1166766986-e1648747045788.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-rumors-trade-proposal-cornerback/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1514,
    1817,
    3507,
    4231,
    160,
    708
  ],
  "sentences": [
    "The Buffalo Bills have a penchant for trading up in the draft under general manager Brandon Beane, but a new report suggests that they could move the opposite way this year to bring more help to one of the thinnest positions on the roster.",
    "@FDSportsbook | #BillsMafia\n— Buffalo Bills (@BuffaloBills) April 16, 2022\nAs Barnwell wrote, the Bills could consider trading up as well, but it makes sense to gain more high picks if possible.",
    "“The buzzards tell me the #Bills may be aggressive in trying to move up in the #NFLDraft & may move a veteran or two in the process…next few weeks will be interesting!” he tweeted on March 31.",
    "“One option would be to try to trade up for Derek Stingley Jr. or Trent McDuffie, but it’s plausible they approach this problem by adding multiple cornerbacks to the roster,” he wrote.",
    "“I would say where we are right now, as many at-bats as you can get, as many swings as you can get, I think that’s important where we are as a team,” Schoen told Giants.com.",
    "The Bills have made a few big moves this offseason, chiefly bringing in pass rusher Von Miller in free agency, but have done little to address their needs in the secondary.",
    "Trade Proposal Brings Secondary Help\nIn a story where he proposed first-round trades for all 32 NFL teams, Barnwell envisioned that the Bills could trade out of the No.",
    "Bills GM Brandon Beane says the wide receiver is deep in every draft, and will be for years to come, because youth football is developing receivers like never before.",
    "https://t.co/uXVYb5Zgn2\nGiants general manager Joe Schoen, who came from the Bills earlier this offseason, has said he’s willing to trade back if it’s the right move.",
    "General manager Brandon Beane could also instead use one of those picks to make a more reasonable bet on a running back, as taking Breece Hall looks better at No.",
    "The Bills have yet to make any additions at the position, but ESPN’s Bill Barnwell believes they could address that over the first two nights of the NFL Draft.",
    "All-Pro cornerback Tre’Davious White is coming off a torn ACL and likely to miss a chunk of the season, while veteran Levi Wallace bolted in free agency.",
    "General manager Brandon Beane of the Buffalo Bills watches warmups before a game against the New York Jets at MetLife Stadium on September 8, 2019.",
    "Zig Fracassi of SiriusXM NFL Radio reported in late March that Beane could be willing to trade a veteran in order to get a higher pick.",
    "7 picks, and like the Bills could be looking to trade back in order to get more picks for what will likely be a rebuilding season.",
    "25.”\nBills Could Consider Other Trades\nThere are some reports that the Bills are considering a move up the draft board instead.",
    "“I’m open to moving up, moving back, whatever it may be, as long as I can sleep good at night with the decision that I make.”",
    "Syracuse.com’s Ryan Talbot pegged the New York Giants as a potential partner for the Bills if Beane does decide to trade up.",
    "That would allow the Bills to take an immediate impact player like N.C. State tackle Ickey Ekwonu.",
    "25 pick and out of the first round entirely in order to get more shots at finding secondary help.",
    "“Trading down could get Buffalo two viable starting corners early in the second round.",
    "57) to the Seattle Seahawks for a pair of higher second-round picks (No.",
    "He proposed the Bills trade their first and second-round picks (No.",
    "41) along with an extra fourth-round pick (No.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "It's mock draft season with @FieldYates.",
    "Wide receiver or cornerback?",
    "The Giants hold the No.",
    "40 than it does at No.",
    "40 and No.",
    "25 and No.",
    "5 and No.",
    "109)."
  ]
}