{
  "id": 3887,
  "mediaId": 2883,
  "date": "2022-03-01",
  "headline": "Party unity vote studies underscore polarized State of the Union",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/02/house_gop011_071718-1.jpg",
  "link": "https://rollcall.com/2022/03/01/party-unity-vote-studies-underscore-polarized-state-of-the-union/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Niels Lesniewski\nRyan Kelly",
  "authorUrl": "https://www.rollcall.com/author/niels-lesniewski/",
  "termIds": [
    2201,
    3165,
    3975,
    4076,
    300,
    305,
    878,
    1124
  ],
  "sentences": [
    "Holding an extraordinarily narrow majority, House Democrats needed to remain unified in 2021 to pass legislation and ward off attempts to attach amendments that members of their caucus would view as “poison pills.”\nThey largely succeeded, in part thanks to the unity that comes with agenda-setting alongside a president of their own party, and partly by changing the rules to minimize the Republican minority’s ability to call votes on measures that could divide the majority, a CQ Roll Call analysis of votes in 2021 found.",
    "Senate more straightforward\nAs in the closely-divided House, the 50-50 Senate has yielded tremendous success for the Democratic majority on party unity votes, with Majority Leader Charles E. Schumer, D-N.Y., not calling up measures without agreement from his entire caucus, including Joe Manchin III of West Virginia and Kyrsten Sinema of Arizona.",
    "President Joe Biden asked for bipartisan support for his legislative agenda in his State of the Union address Tuesday night, but he faces a stark reality: The political parties in Congress are increasingly unified in their voting patterns, often putting majority Democrats and minority Republicans at odds.",
    "Throughout the year, Republicans repeatedly forced votes on suspension bills, scoring a few victories that temporarily derailed measures and causing annoyance for the majority in the scheduling of votes, especially when the COVID-19 pandemic drove a desire to minimize time in session.",
    "“Republicans profess to support local control over local affairs, but somehow that principle stops at the District’s border, including for the salary the District chooses to pay its own employees with its own funds,” Norton said in a Sept. 30, 2021, statement.",
    "“The bill had bipartisan support in committee and during House floor debate.”\nTight margins\nFor most of last year, House Democrats could afford to lose support from only four members of their own caucus and still win if the GOP was united against them.",
    "Suspension bills that came up short under the expedited process include a measure that would prevent the Department of Veterans Affairs from requiring co-pays for contraceptive products that are covered by private insurers with no cost-sharing.",
    "Recommitting with instructions had given the minority a way to try to amend legislation, or, more often, a way to force politically vulnerable members of the majority who stuck with their party to cast votes against popular-sounding positions.",
    "New rules set by Democrats at the start of the 117th Congress eliminated the minority’s power to offer a motion just before final passage of legislation to recommit bills to committee with instructions detailing how they should be rewritten.",
    "Quick passage blocked\nSeveral of the House Republican victories came on efforts to thwart Democrats from passing legislation through suspension of the rules, an expedited process that allows passage of measures with a two-thirds majority.",
    "More than 80 percent white, Bucks County has grown more diverse — minorities make up 18 percent of its population — and faster than the state as a whole, at 3.4 percent compared to the state’s 2.4 percent total growth.",
    "Since then, the precedents have changed multiple times so that nominations can move forward all the way to confirmation with just a simple majority, increasing the likelihood of successful party unity votes.",
    "The leader of the pack in rebuffing his party was GOP Rep. Brian Fitzpatrick of Pennsylvania, one of an ever-dwindling number of members representing a perennially competitive district.",
    "The Republican minority prevailed on just 17 of those votes — 6 percent — and that is the fourth-lowest rate in the 67 years this organization has been conducting such studies.",
    "The Fitzpatrick-held seat encompasses suburban Bucks County just outside of Philadelphia, as well as parts of nearby Montgomery County, under Pennsylvania’s newly drawn map.",
    "Both are serving as appointees of Speaker Nancy Pelosi on the select committee investigating the Jan. 6 insurrection, an arrangement that has made them pariahs in the GOP.",
    "From preventing government shutdowns to protecting Asian-Americans from still-too-common hate crimes to reforming military justice,” the president’s prepared remarks read.",
    "CQ Roll Call calculates party unity scores based on votes in which a majority of one party and a majority of the other party are on opposite sides.",
    "Kinzinger comes in third-lowest on the GOP party unity standings, behind only Fitzpatrick and New York’s John Katko, with a 76 percent unity score.",
    "Rep. Jared Golden, who represents Maine's sprawling and largely rural 2nd District, was the only Democrat in the bottom 50 for party unity scores.",
    "Of the nine Democrats most likely to break with their party in 2019, one became a Republican and five were defeated in their 2020 reelection bids.",
    "But on those measures, Democrats could ultimately schedule floor votes and pass them with simple majority votes, as they did with the VA measure.",
    "It’s also a continuation of an upward trend, as their previous four highest rates on record were the four years of the Donald Trump presidency.",
    "Other notable members who voted against their party’s majorities included, predictably, Reps. Adam Kinzinger, R-Ill., and Liz Cheney, R-Wyo.",
    "That’s a higher total than the 176 in 2020, but a lower percentage than all but one year (59 percent in 2018) over the previous decade.",
    "In fact, Senate Democrats voted unanimously on 364, or 87 percent, of the 418 unity votes cast in 2021 — their highest rate on record.",
    "But despite that record, many of the most contentious legislative issues, such as voting rights, split the parties down the middle.",
    "So leadership worked to limit opportunities where that could happen, and CQ Roll Call’s analysis found they were highly successful.",
    "House Democrats voted unanimously on 222, or 78 percent, of the 283 party unity votes in 2021, by far their highest rate on record.",
    "Eleanor Holmes Norton, D-D.C., that would allow the local D.C. government to set the rate of pay for the chief financial officer.",
    "The revised process merely allowed for a motion to recommit, or to send measures back to committee — and effectively doom them.",
    "All told, 20 House Republicans had party unity scores below 90 percent last year, while there were no such Democrats.",
    "With the motion to recommit effectively gutted as a partisan tool, the procedural politics played out in other ways.",
    "Highest was 92.3 percent in 2009, when Senate Democrats started the Congress with 60 votes in the Senate.",
    "Fitzpatrick sided with the Republicans on party unity votes just 66 percent of the time in 2021.",
    "The 384 Democratic victories — 91.9 percent — is the second highest rate on record.",
    "Both Kinzinger and Katko have decided not to seek reelection this year.",
    "For 2021, such House votes totaled 283, or 63 percent of all votes.",
    "In another example, House Republicans derailed a bill from Del.",
    "“While it often appears that we never agree, that isn’t true.",
    "I signed 80 bipartisan bills into law last year.",
    "Michael Macagnone contributed to this report.",
    "Another factor when considering party unity?"
  ]
}