{
  "id": 3891,
  "mediaId": 2639,
  "date": "2022-03-06",
  "headline": "Ukraine dominates global outlook",
  "image": "https://cdn.newsday.com/ace/c:MWM2NGJjNDgtYWI5Ni00:MzBjN2Jm/preview/1280",
  "link": "https://www.newsday.com/opinion/letters/ukraine-russia-putin-p00296",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Newsday Readers",
  "authorUrl": "",
  "termIds": [
    1806,
    3709,
    3975,
    4533,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "Kathy Hochul announced that New York State will not do business with Russian companies, Nassau County Executive Bruce Blakeman wants to shut down a Russian estate, and liquor stores are removing Russian vodka from their shelves.",
    "I believe that is because their troops see the Ukrainian faces in this type of battle, and they had thought they were oppressed but now are realizing the Ukrainians are innocent, ordinary citizens just like themselves.",
    "Confirmed attacks against civilian targets, schools, and residences, and the unthinkable shelling of a nuclear power plant, indicate Putin is guilty [\"Russian shelling sets fire to nuke power plant,\" News, March 4].",
    "— Michael Fitzpatrick, Massapequa Park\nIt’s outrageous that the United States has become a spectator to horrific criminal acts on the world stage while the criminal, Russia, vetoes any intervention by the UN.",
    "— Ann Leahy, Wantagh\nLet’s all start putting our flags at half-staff in honor of the brave Ukrainian people who have died fighting Russian President Vladimir Putin’s forces invading their democratic country.",
    "The West has loudly condemned Russia’s attack, but Russian President Vladimir Putin could, rightly or wrongly, call America a hypocrite by bringing up the invasion of Iraq that the United States led.",
    "This is unlike our former president, who has praised and bowed to Russian President Vladimir Putin for years, most recently calling him a genius for invading an innocent democratic country.",
    "That empowers Russian President Vladimir Putin because the Biden administration has reinstituted our nation’s dependence on foreign oil imports by restricting domestic oil production.",
    "The Ukraine war is possibly several things at once: the biggest challenge in NATO history, the worst tragedy since 9/11, and the largest military conflict since the Iraq War in 2003.",
    "— Christopher L. Turpin, Patchogue\nOne can only wonder whether Russian President Vladimir Putin would have done this if former President Donald Trump were still president.",
    "Unlike Hussein in 2003, Putin is the aggressor, so opposing him is right, but this time there’s no political will in Washington to risk lives or suffer heavy casualties.",
    "They should take a hard look at what true leadership looks like, while the rest of us better pray that we never have to face the bear on our doorstep.",
    "The United States has a moral obligation to enter the fray to militarily help Ukraine but certainly more so if forces in Belarus attack Ukraine, too.",
    "Ukrainian President Volodymyr Zelenskyy is a strong and brave leader who has vowed to die for his country, its people, its freedom and democracy.",
    "This is all laughable because as this virtue-signaling takes place, the United States is still importing millions of gallons of oil from Russia.",
    "— Brian Kene, Patchogue\nI’m grateful that Joe Biden is our president at this perilous time, not just for Ukraine but for the rest of the world.",
    "I propose a U.S. response that should be painless for our politicians: Stand together to show Putin that we are united against his atrocities.",
    "Antiwar Americans in 2003 were called unpatriotic by right-wingers lobbying to take out Saddam Hussein, and now they want to take out Putin.",
    "He faces the Russian bear, which has overwhelming military might and is ruled by a war criminal with his finger on the nuclear trigger.",
    "The belief that wagging one’s finger while telling the criminal, in the act, that its finances are going to be targeted, is ludicrous.",
    "— Josh Paul, Islip Terrace\nThe Russians have been changing their tactics from a ground assault to long-range shelling and bombing.",
    "— Hank Cierski, Port Jefferson Station\nEuropean countries are afraid [\"Russia lays siege to two key seaports,\" March 3].",
    "— Michael Sullivan, Garden City\nUkrainian President Volodymyr Zelenskyy has shown us what leadership is all about.",
    "What a stark contrast to our congressional leaders on Jan. 6, 2021, who, in the face of a Capitol riot, exited.",
    "It is easier for the Russians to do this since the Ukrainians being shelled at a long distance are faceless.",
    "The European Union needs to take swift military action, and the United States needs to use its air power.",
    "— Rich Areskog, East Meadow\nIn the rush to place sanctions on Russia for its invasion of Ukraine, Gov.",
    "Putin may have the same weapons that Hussein was supposed to have had, plus he has a nuclear arsenal.",
    "Some would reject the analogy, but many would see no difference between Iraq then and Ukraine today.",
    "— Thomas Atkinson, Hauppauge\nInstead of baseball’s spring training, Americans are following a war.",
    "Sanctions are being placed not only on Russia but on the American people with higher oil prices.",
    "All countries need to act now to send a message to aggressors around the world.",
    "Russian President Vladimir Putin may be charged with crimes against humanity.",
    "Is Putin doing this to show the world his disrespect for President Joe Biden?",
    "Why is Putin taking the steps gradually instead of doing it all at once?",
    "The ground assault has been stalled in large part due to low morale.",
    "China may see military inaction as an opportunity to invade Taiwan.",
    "Americans died for a reason that turned out to be a false flag.",
    "Now is the time to act before World War III is in full motion.",
    "Strike a unified blow for democracy without firing a shot.",
    "This could collapse the Russian economy in one giant step.",
    "I pray for peace and a quick ending to this horrible war.",
    "This is also how World War II began, with people afraid.",
    "Putin loves Western division, which he sees as weakness.",
    "Leave out the partisan bickering during this crisis.",
    "Germany has greatly increased its defense budget.",
    "Russia may want to take countries one by one.",
    "The alternative is piece-by-piece occupation.",
    "Anti-tank ammunition, not an evacuation.",
    "North Korea could move on South Korea.",
    "We have already felt ripple effects.",
    "Show him we are one against him.",
    "The emperor has no clothes.",
    "And what does he ask for?",
    "It’s an ironic dilemma.",
    "— Gene Reynolds, Ridge"
  ]
}