{
  "id": 3895,
  "mediaId": 2732,
  "date": "2022-03-04",
  "headline": "First Call: Antonio Brown's latest music venture; an offensive lineman that seems to have the Steelers' interest before draft",
  "image": "",
  "link": "https://triblive.com/sports/first-call-antonio-browns-latest-music-venture-an-offensive-lineman-that-seems-to-have-the-steelers-interest-before-the-draft/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Benz",
  "authorUrl": "https://triblive.com/author/tim-benz/",
  "termIds": [
    1674,
    2315,
    3219,
    3480,
    4134,
    4441,
    183,
    671,
    823
  ],
  "sentences": [
    "“On defense, we have a monster group, I feel like you got the Defensive Player of the Year (T.J. Watt), you got Minkah Fitzpatrick, you have myself, Stephon Tuitt, Tyson Alualu, combine that all together, that is winning success, you just got to have a quarterback.”\nHeyward’s brother, Connor, is a draft-eligible fullback/tight end prospect out of Michigan State.",
    "• 5 specifics to love about the Penguins' big-picture romp through Tampa Bay\n• Tim Benz: Feeling nostalgic about college basketball after a rough year for the sport in Western Pa.\nHurricane conditions\nAfter their recent win in Pittsburgh (4-3 on Feb. 20), the Carolina Hurricanes stayed hot.",
    "While sitting down with Andrew Siciliano of the NFL Network at the NFL Draft combine, Steelers defensive captain Cameron Heyward didn’t dismiss the notion of his team drafting a quarterback.",
    "“Who’s to say a rookie quarterback can’t win?” Heyward said when asked about the prospect of rookie quarterback impacting the team’s chances for success in 2022.",
    "Washington remains in fourth place of the Metro with 67 points, good for the eighth and final playoff spot in the Eastern Conference to start play this weekend.",
    "pic.twitter.com/kkN3L03blr\n— Andrew Siciliano (@AndrewSiciliano) March 4, 2022\nHeyward argued that the team has the support pieces in place to aid a rookie QB.",
    "According to Lance Zierlein of NFL.com, “The phrase ‘phone booth guard’ was made for Johnson thanks to his wide, girthy frame and immense playing power.",
    "Favorite emerging\nVia Steelers Depot, the Steelers haven’t met with Boston College offensive lineman Zion Johnson at the combine yet.",
    "This should be good\nTMZ reports that Antonio Brown is going to be part of the Rolling Loud Music Festival in Miami.",
    "Johnson has experience at tackle, but he’s clearly an interior blocker on the next level.”\nWhy not with a rookie?",
    "“Most teams don’t have a Najee Harris running the ball, (Chase) Claypool or Diontae Johnson,” said Heyward.",
    "Carolina (79 points) still has a three-point edge in the Metropolitan Division on the Penguins (76 points).",
    "Another Steelers Pro Bowler, Cameron Heyward, talks about the prospect of his team drafting a quarterback.",
    "Friday’s “First Call” features the latest adventure for former Pittsburgh Steelers All-Pro Antonio Brown.",
    "It indicates he’ll be performing on the festival’s first day in Miami before Kanye West takes the stage.",
    "Alexander Ovechkin had one of the goals in support of Vitek Vanecek’s third shutout of the season.",
    "“Who’s to say a rookie quarterback can’t win?”@CamHeyward joined me on @nflnetwork at the Combine.",
    "And we look at the Carolina Hurricanes as the Penguins visit Raleigh on Friday night.",
    "That may seem surprising until you hear that they met five times at the Senior Bowl.",
    "Johnson is believed to be a first-round pick and performed well at the Senior Bowl.",
    "His performance is supposed to take place on Friday, July 22 at Hard Rock Stadium.",
    "One offensive lineman sure seems to be drawing the attention of the franchise.",
    "The NFL star broke the news on social media, posting Rolling Loud’s flier.",
    "He claims to have grown up a Steelers fan while living in Maryland.",
    "All emails are subject to publication unless specified otherwise.",
    "First, it was a 4-3 overtime decision in Detroit on Tuesday.",
    "You can contact Tim at tbenz@triblive.com or via Twitter.",
    "Since then, though, the Canes have dropped two in a row.",
    "Categories: Sports | Steelers/NFL | Breakfast With Benz",
    "He has to open with “Whole Lotta Money,” doesn’t he?",
    "He’s going to be rapping under the stage name A.B.",
    "Then a 4-0 loss in Washington on Thursday night.",
    "There might not be much else to talk about.",
    "Tim Benz is a Tribune-Review staff writer.",
    "keeps his shirt on for this one, right?",
    "They won their next three as well.",
    "Rapping onstage in Miami in July?",
    "So what’s not to like about that?",
    "What do the @steelers do at QB?",
    "All tweets could be reposted.",
    "No way A.B."
  ]
}