{
  "id": 3947,
  "mediaId": 2551,
  "date": "2022-02-24",
  "headline": "Watch the heartwarming moment one-year-old Axel hears for the very first time - and the look on his mother's face says it all",
  "image": "https://i.dailymail.co.uk/1s/2022/02/25/00/54628319-0-image-a-15_1645750352919.jpg",
  "link": "https://www.dailymail.co.uk/femail/article-10549403/Deaf-toddler-hears-parents-voice-time-fitted-cochlear-implants.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Louise Allingham For Daily Mail Australia",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Louise+Allingham+For+Daily+Mail+Australia",
  "termIds": [
    4619,
    4843,
    5338
  ],
  "sentences": [
    "+7\nView gallery\nAfter failing the newborn hearing screening at birth Axel was diagnosed with profound hearing loss in both ears and was fitted with hearing aids at just seven weeks old\n+7\nView gallery\nAfter connecting with national not-for-profit organisations First Voice and Next Sense that work to provide support and assistance for people and children with hearing loss, the parents decided to proceed with cochlear implants\nAfter connecting with national not-for-profit organisations First Voice and Next Sense that work to provide support and assistance for people and children with hearing loss, the parents decided to proceed with cochlear implants.",
    "Scroll down for video\n+7\nView gallery\n Parents, Julia Jaekel and Andrea Gandolfi, from Sydney watched on in delight as their 22-month-old son Axel was able to hear their voices for the first time after being fitted with cochlear implants\n+7\nView gallery\n+7\nView gallery\nA video shows Axel looked both bewildered and delighted as he was introduced to a whole new world filled with sound as his parents and therapist laughed and played with him\nAfter failing the newborn hearing screening at birth Axel was diagnosed with profound hearing loss in both ears and was fitted with hearing aids at just seven weeks old.",
    "+7\nView gallery\nAxel is now thriving and developing his communications skills at a stellar rate\nWith Hearing Awareness Week coming up from March 1-7, First Voice chair and director Mark Fitzpatrick wants to educate Australians to know that with the right and timely interventions, a life of hearing, listening and speaking is possible for children with hearing loss.",
    "Save 10% On This Electric Body Hair Trimmer That’s Better Than A Salon Bikini Wax\nOriginally marketed as a below the belt grooming tool for men, the Meridian hair removal device is now a firm favorite in thousands of women’s beauty cabinets due to how it effectively removes coarse and curly hair for a silky smooth finish - no nicks, razor burn or bumps.",
    "Ditch Toothpaste And Try Tooth-Cleaning Tablets For Better Smiles And A Better Planet\nThe Good Company Toothpaste Tabs contain natural teeth cleaning and whitening ingredients in every tablet as an eco-friendly alternative to toothpaste so you can say goodbye to plastic tubes, and stop wasting toothpaste that you can’t squeeze out.",
    "Get 15% Off This Ultra-Hydrating Toner, Beauty fans Are Using Instead of Moisturizer\nCirccell skincare’s much-loved Dew pH Perfector is a balancing toner with an abundance of moisturizing ingredients that is so hydrating, beauty fans have been using the multi-tasking product as a moisturizer and toner in one.",
    "Get 20% Off This Female-Led Beauty Brand That’s Better Than Botox\nDime Beauty’s premium clean beauty products are full of moisturising, hydrating and acne-busting properties that have helped thousands of women with their primary skin concerns while still being astonishingly affordable.",
    "Made from only the best ingredients such as log-grown organic Lion’s Mane mushrooms, Ashwagandha, Probiotics and MCT Oil, these nutrient dense ingredients will superboost your brain, support immunity, balance your stress and provide you with a better way to power up in the mornings.",
    "'We know that children with hearing loss who receive listening and spoken language therapy and hearing technology, such as cochlear implants and hearing aids, have the potential to develop speech and language skills at the same level as their typical hearing siblings and peers.'",
    "Get 10% Off This Latina Owned Beauty Brand Changing The Manicure Game\nMini Mani Moo president and co-founder Andreina (a young latin entrepreneur) has created an LED gel polish line that no longer requires a base coat and has added vitamins to help strengthen your nails.",
    "Revive Dry Winter Skin With This Affordable Body Butter Packed With Ultra-Moisturizing Pistachio Nuts - That Smells Like Biscotti\nIf you want to feel perkier, improve your skin’s tone and texture and feel more moisturized, you need to know about skincare label Pistaché.",
    "Supercharge Your Immune System And Health With 50% Off These Powerful Vitamin C Supplements\nHealthcare company 2 x 4 have launched fast-absorbing Liposomal Vitamin-C, delivering nutrients in a liquid form that reaches the bloodstream better than tablets or gummies.",
    "'For parents, a hearing loss diagnosis can be full of unknowns and uncertainties about the future, so it is critical that we educate them on the options available to encourage informed decisions that can enable their child to embrace a world of sound,' he said.",
    "Parents Julia Jaekel and Andrea Gandolfi, from Sydney, watched on in delight as their 22-month-old son Axel, who was diagnosed with profound hearing loss as a newborn, was able to hear their voices for the first time after being fitted with cochlear implants.",
    "Score 15% Off This New Period Product Designed For No-Mess Period Sex\nHello Disc is the innovative menstrual disc that collects your period blood and tucks away under your pubic bone, so you can get freaky any time of the month, and save time doing laundry.",
    "Get 15% Off This Lash And Brow Growth Serum With Hundreds of Five-Star Reviews\nBy applying Bondi Lash Lab and Brow growth serum to your lash and eyebrow roots day and night, your lashes and eyebrows will grow longer and thicker in less than a month.",
    "This $13 Rose-Scented Face And Body Oil Will Have Your Friends Asking If You’ve Been Botoxed\nThe Provence Beauty Rose Multi-use body oil has more than 9,000 five star reviews from shoppers impressed by how it nourishes hair, skin and nails.",
    "The ultra-light, natural-looking blush went viral on Tik Tok within days of its launch with beauty fans blown away by how well it blends into skin, and because the pigment is buildable, you can combine shades to create your own bespoke hue.",
    "This Honeysuckle Face And Body Oil Reduces Inflammation For Under $14\nProvence Beauty’s new Honeysuckle Jasmine Multi-Use Body Oil provides the benefit of the Honeysuckle’s antioxidant, anti-inflammatory and hydrating benefits.",
    "Try the benefits for yourself and sign up to their auto-replenishment program, where you save 20 percent on the cost of buying the item as a one off and five percent of your order will go directly to the charity of your choice.",
    "These CBD-infused products promote healthy hair growth and calm an itchy scalp\nLondon-based haircare brand Wild Science Lab has created a CBD-infused Leaf + Seed Head range to help balance the scalp for healthy hair growth.",
    "These TikTok-Viral Cream Blushes That Give 24-hour Coverage Are Only $7\nMakeup Revolution’s Superdewy Liquid Blush is a natural-looking cream blush that will give you a longer lasting flush than powder for only $7 a tube.",
    "This Beloved Brazilian Plant-Based Skincare Is Powered By Nutrient-Rich Quinoa Oil\nWhat’s been the secret weapon in millions of Brazilian women’s beauty and hair care regime that is now launching in the US?",
    "It contains 120mg pure CBD, organic Hemp Seed oil, anti-inflammatory organic aloe vera and five essential oils that soothe scalp tension and irritation while creating an environment for healthy hair growth.",
    "The versatile $13.99 oil can be used to soften and condition hair without making it appear greasy, and calms and soothes acne prone skin and the skin of psoriasis and eczema sufferers without irritation.",
    "This Cool Down Mist Will Relieve Your Hot Flashes Quick\nKindra is the fastest-growing menopause brand in the U.S and the latest product in their line-up of estrogen-free essentials is the Cool Down Mist.",
    "Get 20% Off This Sexual Wellness Brand’s New Collection That’ll Hit All Your Pleasure Points\nLe Wand is a female-founded brand of personal vibrating massagers that are best-in-class, hair-raising toys.",
    "Their breads, buns and bagels are made from simple, functional ingredients that feel good to eat, are full of fiber and protein and free of unnecessary allergens such as gluten, nuts and dairy.",
    "This Healthy Bread Wants To Rebuild Our Unhealthy Relationship With Carbs\nQueen Street Bakery was built on the belief that just because something is ‘free-from’ doesn’t mean it’s good for you.",
    "Save 20% Off This Celebrity-Approved Skincare Brand Loved By Margot Robbie And Victoria Beckham\nWhat do Victoria Becham, Meghan Markle, Margot Robbie and Jennifer Aniston have in common?",
    "Formulated with hot flashes and night sweats in mind, it gives women instant relief with a skin-cooling sensation that lasts for two hours, leaving behind refreshed, hydrated skin.",
    "Currently, they’re offering a bath and body set containing their oil, butter and exfoliator for just $65, a significant saving on the $88 cost of buying the items individually.",
    "This Award Winning Plant Based Creamer Will Bring Delicious Wellness To Your Morning Cup Of Joe\nFour Sigmatic brings a creamy dose of elevated wellness to your everyday coffee.",
    "Their new 'Chrome Vibes’ collection is shaped to thoroughly stimulate your g-spot, p-spot or a-spot, with three different shapes, 6 intensity levels and 15 vibration patterns.",
    "So if you want to reduce your risk of catching illnesses, recover from sport faster and transform the appearance of your skin, save 50% with the code RESILIENT50 at checkout.",
    "The Pistaché body butters, face moisturizers and haircare products all contain the super-nut pistachio, which is packed with nutrients to improve your skin and hair.",
    "30x more potent than coconut oil, quinoa oil firms, tones and moisturizes the skin like no other and right now, you can get 20% off with the discount code NATIVA20.",
    "Axel looked both bewildered and overjoyed as he was introduced to a whole new world filled with sound as his parents and therapist laughed and played with him.",
    "Created by a master aesthetician and a mother of three, the cleansers, toners and masks cater to the different challenges skin faces whether you’re 20 or 65.",
    "Made from medical grade silicone and designed by a registered nurse, the disc’s two loop tab makes removal and emptying as easy as a flick of a finger.",
    "The serum has collagen and Vitamin B7 as key ingredients that help to stimulate hair follicles naturally, so it’s great for those with sensitive skin.",
    "You can get 15% off at Bondi Lash Lab with the code DM15%, and if you don’t see results within 90 days, you can send it back for a full refund.",
    "Nativa SPA, a vegan and plant-based brand which harnesses the power of the ancient grain, quinoa, due to the nourishing properties of its oil.",
    "Its luxurious scent of rose, peony and bergamot lingers on the skin once the Vitamin E rich, apricot and coconut oil blend is absorbed.",
    "Julia said she and her husband were frightened and overwhelmed by the diagnosis and what it would mean for their son's future.",
    "With lactic acid, hyaluronic acid as well as aloe, arnica and camphor, the luxury botanical formulation is like a mini facial.",
    "By curing each coat under the LED lamp, you’ll get a full gel manicure that will last up to 3 weeks in less than ten minutes.",
    "Try the only bread on the planet made from Chia or their Charcoal Pizza Dough that's the best thing since sliced bread.",
    "They all use Augustinus Bader’s scientifically-proven Rich Cream to keep their skin red-carpet ready and glowing.",
    "An Australian couple have shared the heartwarming moment their deaf toddler was able to hear for the first time.",
    "Simply pop one tab in your mouth, chew it up completely, and begin brushing with a wet toothbrush.",
    "Pre-order yours now, and get 15% off your first Hello Disc, by entering the code - HELLODISC.",
    "Get 10% off with the discount LOVEMERIDIAN10 and save time and money on trips to the salon.",
    "According to First Voice, more than 3.6million Australians are impacted by hearing loss.",
    "With 100% natural and vegan ingredients, a four ounce bottle is yours for just $13.95.",
    "In honour of International Women’s Day, use the exclusive code DAILY20 for 20% off.",
    "Axel is now thriving and developing his communication skills at a stellar rate.",
    "'We couldn't quite believe it at first and were quite numb to the news.",
    "You can score 20 per cent off by using the code GET20 at checkout.",
    "These beauty and wellness finds will save you time AND money\n1.",
    "Get 20% off with your unique discount code - CHROME20 here.",
    "It's not what you expect as a new parent,' she said.",
    "Shop\nProducts featured are independently selected.",
    "We may earn a fee from links on this page.",
    "Get 15% off with the exclusive code DMAIL.",
    "Shop their revolutionary range here.",
    "Shop\nRead more\n2.",
    "Need some TLC?",
    "Shop\n13.",
    "Shop\n15.",
    "Shop\n14.",
    "Shop\n17.",
    "Shop\n16.",
    "Shop\n10.",
    "Shop\n11.",
    "Shop\n12.",
    "Shop\n19.",
    "Shop\n18.",
    "Shop\n8.",
    "Shop\n9.",
    "Shop\n5.",
    "Shop\n3.",
    "Shop\n4.",
    "Shop\n6.",
    "Shop\n7."
  ]
}