{
  "id": 3952,
  "mediaId": 2512,
  "date": "2022-03-04",
  "headline": "These pro-Biden Democrats find themselves surrounded by ‘coarse’ MAGA Republicans in small rural towns",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29478445&width=1200&coordinates=0%2C9%2C0%2C179&height=600",
  "link": "https://www.alternet.org/2022/03/these-pro-biden-democrats-find-themselves-surrounded-by-coarse-maga-republicans-in-small-rural-towns/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    2201,
    3975,
    305,
    878,
    4909,
    4950,
    5371,
    5390
  ],
  "sentences": [
    "You don’t want to have to talk about anything political.”\nAccording to Kathy Foulkrod, a friend told her, “I just came to tell you I had to take my Biden sign down because I was too afraid.”\nThe Democrats Politico interviewed in Clearfield County, Cadelago reports, “say party leaders need to come to terms with just how calamitous the dropoff of rural support has been.”\nCadelago writes, “The fundamental question the party needs to answer — one that gnaws at everyone from the Foulkrods and Fitzpatrick to Biden’s advisers in Washington — is: how far can they expect to get with people who refuse even to listen?”",
    "But the other 25% who voted for Joe Biden — 9673 people — find themselves in an unusual position: They supported the ultimate winner, and yet, a relentless and toxic campaign to delegitimize his victory and overturn the election makes them feel somehow as if they’re under siege.”\nClearfield County is also home to Kathy and Frank Foulkrod, both of whom are Democrats and retired schoolteachers who find that the political environment has become increasingly toxic in their area.",
    "What those tales often leave out is the other side of the same coin.”\nCadelago continues, “In these towns and counties, there remain thousands of Democrats like Fitzpatrick who are faithful to their party — and feel that they are paying an increasingly steep price for that loyalty.",
    "“And the reasons for that massive defection have become familiar from repetition: the erosion of manufacturing and energy jobs, the withdrawal of private-sector labor unions, an explosion of technology and expanding cultural divisions.",
    "Journalist Christopher Cadelago, in an article published by Politico on March 4, describes what it is like to be a pro-Biden Democrat who lives in a rural area and is surrounded by Trump supporters.",
    "“Blue-collar ‘diner stories’ about disaffected Democrats and independents who crossed over to support Republicans are so common they’ve become their own media subgenre,” Cadelago explains.",
    "When Democrat Joe Biden enjoyed a decisive victory over Republican Donald Trump in the 2020 presidential election, he did so with a lot of help from urban and suburban voters.",
    "One of the Democrats Politico interviewed was Joanne Fitzpatrick, who lives in the small town of DuBois in rural Clearfield County, Pennsylvania.",
    "It gets to a point where you avoid going somewhere that you know some of your friends are on the Republican side.",
    "Nearly 30,000 people in Clearfield County voted for Trump in 2020, roughly three-quarters of the ballots cast.",
    "Frank Foulkrod told Politico, “Life here has never been as coarse as it is now….",
    "Rural areas of the United States were, on the whole, more favorable to Trump."
  ]
}