{
  "id": 3953,
  "mediaId": 2586,
  "date": "2022-02-26",
  "headline": "6-Time All-Pro Free Agent Drops Hint About Joining Bills Next Season",
  "image": "https://heavy.com/wp-content/uploads/2022/02/cordarrelle-patterson-1-e1645914428384.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/cordarrelle-patterson-bills-free-agency/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1278,
    1331,
    1593,
    1858,
    93,
    160,
    671
  ],
  "sentences": [
    "This is a good example of when a coach understands the scheme — which he does, Coach Smith — and he takes an athlete like this and can use him in a variety of ways I think you see the kind of production that he can have.”\nMost targets without a drop this season:\n— PFF (@PFF) February 19, 2022\nOthers believe the Bills will prioritize bringing back McKenzie and potentially expanding his role.",
    "Falcons Star Drops Twitter Hint\nThe Bills have been mentioned as potential suitors for Atlanta Falcons playmaker Cordarrelle Patterson, who is headed to free agency after a season where he topped 1,166 yards from scrimmage as a receiver and running back.",
    "After he was a healthy scratch for a stretch midseason, McKenzie moved into a more prominent role in the offense, topped off by his career-best 11 catches for 125 yards and one touchdown in a 33-21 win over the New England Patriots on December 26.",
    "Skurski wrote that Patterson is a much more accomplished version of Isaiah McKenzie, who played a somewhat similar role for the Bills as both a return specialist and wide receiver who takes sometimes takes handoffs in the backfield.",
    "The NFL’s free agency bonanza is still more than two weeks away, but the buzz surrounding the Buffalo Bills is already starting to build up after a six-time All-Pro dropped a hint about joining the team.",
    "Bills general manager Brandon Beane has made it clear that the team won’t be making any big moves this offseason, as Josh Allen’s extended contract kicks in and salary cap space will be very tight.",
    "Patterson appears to have his eyes on Buffalo as well, liking a tweet from a fan that predicted the Bills would be in the running to sign him when free agency starts on March 14.",
    "So we’ll continue to look for various ways.”\nTight Competition for Patterson\nIf the Bills do make a run at Patterson, they could face some tough competition.",
    "A number of teams have been connected to the 30-year-old, and Falcons owner Arthur Blank has publicly said that the team wants him back again next season.",
    "“I’m so confident the Bills will be players for Cordarrelle Patterson that I’m now preemptively following him on Twitter,” the fan tweeted.",
    "There could be room to add one WR/RB/KR, however, and that multi-talented player may have just shown some interest in joining the Bills.",
    "“You’d love to have a (run after catch) guy that you can get the ball to and he can turn a five-yard pass into a 60-yard touchdown.",
    "Beane has also said that the team wants to add more playmakers this offseason, which could make Patterson a good fit.",
    "Patterson would seem to fit into Buffalo’s plans for the offseason, noted Jay Skurski of the Buffalo News.",
    "“From our standpoint, we’d love to have (Patterson) back,” Blank said.",
    "I think this is a very talented player, a very talented athlete.",
    "Like Patterson, McKenzie is now headed to free agency.",
    "“I’m always looking for speed,” Beane said, via ESPN.",
    "“We saw the same thing that you saw on the field.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "You can never have enough of that.",
    "We talked about speed here."
  ]
}