{
  "id": 3975,
  "mediaId": 2551,
  "date": "2022-03-06",
  "headline": "Tyrrell Hatton comes agonisingly close to repeat his Arnold Palmer Invitational 2020 triumph",
  "image": "https://i.dailymail.co.uk/1s/2022/03/06/23/55023559-0-image-a-61_1646608771390.jpg",
  "link": "https://www.dailymail.co.uk/sport/golf/article-10584177/Tyrrell-Hatton-hits-six-birdies-Arnold-Palmer-Invitational-looks-repeat-2020-triumph.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "+4\nView gallery\nThe Englishman has a great feeling for the tournament, which he won back in 2020\nMatt Fitzpatrick posted his third top ten finish in three starts in America so far this year with a 73 for tied ninth place, but a gut-wrenching finish with three dropped shots in the last three holes saw Graeme McDowell miss out on one of three spots on offer for the 150th Open at St Andrews in July.",
    "+4\nView gallery\nScottie Scheffler won the tournament by one stroke ahead of Englishman Hatton\nAfter the birdie-fest in California in January came the bogey-onslaught at Arnie's place, with plenty believing the course set-up, with bone-hard greens and vicious collars of rough around them, and further protected by capricious breezes, tip-toed into the realm of being unfair.",
    "+4\nView gallery\nTyrrell Hatton finished second in the Arnold Palmer Invitational on Sunday in Orlando\nIn the end, only Scottie Scheffler finished in front of him, as the American Ryder Cup player nervelessly two putted the final two holes from long range for a one stroke success to follow up his maiden tour victory in Phoenix last month with a far more prestigious title.",
    "+4\nView gallery\nRory McIlroy led the tournament after two rounds but in the end finished tied for 13th\nNext to finish was Ian Poulter, digging deep in his quest for world ranking points to trigger an invitation to the Masters but signing for a 77 to make no progress.",
    "Out of sorts with his long game for two rounds and seemingly out of contention after a third round 78 left 12 players ahead of him, Hatton showed his resilience with a wonderful bounce-back 69 to post a stiff four under par target.",
    "'Funnily enough, I don't ever remember seeing the course set up like this when Tiger Woods was winning it every year,' was the caustic verdict of one experienced caddie, who better remain nameless.",
    "Tyrrell Hatton came agonisingly close to winning the Arnold Palmer Invitational for the second time in three years following an astonishing bravura performance at brutal Bay Hill on Sunday.",
    "When he finished there were no fewer than six players either tied on the same score or one stroke ahead of him who still had to play the treacherous closing holes.",
    "After following a 76 on Saturday with another, Rory McIlroy must have wondered what on earth happened to the golf course he demolished in 65 strokes on Thursday.",
    "Former US Open Champion Gary Woodland eagled the par five 16th to be two ahead of Hatton standing on the 17th tee, only to finish double bogey, bogey.",
    "'Who wants to play on a test like this and then go on to the Players Championship feeling physically and mentally beaten up?'",
    "Was it really just a month ago that world number one Jon Rahm was criticising the courses on the PGA Tour for being too easy?",
    "This was some gritty display from Hatton, in his first tournament since a nasty bone graft operation on his jaw a month ago.",
    "His peers must have been tempted to form a queue round the block to tell him to keep his thoughts to himself in future.",
    "The 30 year old from Marlow certainly has something to smile about again, even if he didn't leave holding the trophy.",
    "'There are some days when you just can't see your way round a golf course,' the 44 year old told Sportsmail.",
    "Hatton finished tied second with Norwegian Viktor Hovland and American Billy Horschel.",
    "When he was done, he put on his wedding ring, his watch and walked silently away.",
    "Given he has a handsome deal with the sponsor Mastercard, it was a wise move.",
    "Paul Casey was lieing in the top six at halfway, only to finish with an 83.",
    "He finished in a tie for 13th with his playing partner, G-Mac.",
    "Asked if he had anything to say, he replied:'Negative.'",
    "What a mad weekend this was at Bay Hill."
  ]
}