{
  "id": 4024,
  "mediaId": 2584,
  "date": "2022-03-03",
  "headline": "Brute force, raw emotions: six things lying ahead at the Winter Paralympics",
  "image": "https://i.guim.co.uk/img/media/672ed9a99a2455aeb37f01eab20ce18c51dd9edc/0_238_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=eaabf5077046b785665b748d0611a75c",
  "link": "https://www.theguardian.com/sport/2022/mar/03/brute-force-raw-emotions-six-things-lying-ahead-at-the-winter-paralympics",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Martin Belam",
  "authorUrl": "https://www.theguardian.com/profile/martin-belam",
  "termIds": [
    0
  ],
  "sentences": [
    "“If we come away from these Games without a medal,” she has said, “that’s not going to be disappointing for us – it’s about performing well and being proud of what we’ve done.”\nA breakthrough Winter Paralympics for the hosts\nChina don’t have a huge pedigree in Winter Paralympics – having previously won only one gold medal – but the hosts have consistently dominated the medal table at the Summer Paralympics since Athens in 2004, and have invested heavily in advance of hosting.",
    "The Ukraine-born Oksana Masters was unstoppable with two golds in para-cycling at Tokyo, and now she is in Beijing to defend her two cross-country skiing titles, saying: “I can’t wait to race for the two countries that make me whole.” Dan Cnossen is back, having won six medals including one gold in the biathlon and cross-country skiing last time.",
    "Emotional podium scenes for Ukraine\nUkraine have an excellent Winter Paralympics track record, with seven golds in Pyeongchang in 2018, and they finished fourth in the medal table in Sochi 2014, when they similarly competed during a Russian invasion of their homeland.",
    "The 44-year-old Zhang Haiyuan will race in the Alpine skiing for China, having previously won Paralympic gold in the long jump at Athens in 2004, while 28-year-old Jing Yu will become only the third woman to be part of a para ice hockey squad.",
    "The top priority remains making sure US Paralympic athletes have the support needed on all fronts – both mentally and physically – to perform at their best while living out their dreams,” the US chef de mission, Julie Dussliere, has said.",
    "Around 650 athletes from 49 nations were expected to compete before the IPC banned Russia and Belarus, and they will contest alpine skiing, cross-country skiing, biathlon, snowboarding, wheelchair curling and para ice hockey.",
    "A smaller Games\nThe Winter Paralympics are a modest affair compared with their summer counterpart – 78 gold medals are on offer across six sports between Saturday 5 March and Sunday 13 March, two events fewer than in 2018.",
    "Athletes had been warned before the Winter Olympics about making political statements that could upset the host nation, but we can anticipate a huge show of solidarity for Ukraine’s athletes from their peers.",
    "hen the Winter Olympics closed on 20 February the main talking points were another Russian doping scandal and the International Olympic Committee’s controversial decision to award the Games to China.",
    "There is also sure to be a lot of attention on the “Eileen Gu of the Paralympics” – 20-year-old Katlyn Maddry was born in China but grew up in Alaska and represents the US in snowboarding.",
    "For a complete contrast there is wheelchair curling, once described as “chess on ice” by the Chinese star Yan Zhuo, who will be part of the host team defending their 2018 gold medal.",
    "Brute force and tactical thinking\nIf you enjoyed the aggression of the wheelchair basketball at the Summer Paralympics in Tokyo then it is worth giving the para ice hockey your time.",
    "It’s a contact mixed team sport with players on sleds, playing ice hockey with an adjusted paddle that can be used to hit the puck at one end and manoeuvre on the ice with the other.",
    "The snowboarders Sun Qi and Pang Qiaorong won world championship golds in 2019 and the standing skier Zhang Mengqiu won a World Cup gold in 2020 and are all medal hopes.",
    "Fast forward just 12 days to Friday’s opening ceremony for the 2022 Beijing Winter Paralympics, and the Games will open under an entirely different geopolitical cloud.",
    "Millie Knight, who won two silvers and a bronze in South Korea, returns from serious injury to compete at her third Winter Paralympics but denies feeling pressure.",
    "However, the US topped the medal table in Pyeongchang and, with Russian athletes unable to compete, the path is open for even more than the 36 they won last time.",
    "Katie Guest, who would have been guide to the defending Paralympic slalom champion, Menna Fitzpatrick, has been unable to travel because of a positive test.",
    "More medals for ParalympicsGB than Team GB\nTeam GB went into the Winter Olympics with a target of three to seven medals, and ended up with only two.",
    "Their full delegation of 20 athletes and nine guides is expected to reach Beijing and will compete in biathlon and cross-country skiing.",
    "This year the team are 25-strong, the biggest delegation since Lillehammer 1994, but Covid is a concern.",
    "The British Paralympians in Beijing have a chance to perform better – they won seven in Pyeongchang.",
    "A dominant US team thinking beyond medals\n“Our hopes for Team USA go far beyond medal expectations.",
    "They are sending their largest ever Winter Paralympics delegation of 96 athletes to these Games.",
    "The opening game on Saturday is a rematch of the 2018 final, featuring the US and Canada.",
    "Here is some of what we can anticipate over the next week and a half in China.",
    "The opening ceremony takes place at noon UK time on Friday 4 March.",
    "Fitzpatrick will ski with a replacement guide.",
    "Both will expect to meet again in the final."
  ]
}