{
  "id": 4041,
  "mediaId": 2644,
  "date": "2022-03-03",
  "headline": "Commanders calling every team about a quarterback leaves some confused",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/newspress-collage-21402377-1646338619905.png?w=1024",
  "link": "https://nypost.com/2022/03/03/rodgers-wilson-washington-commanders-asked-about-every-nfl-qb/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jaclyn Hendricks",
  "authorUrl": "",
  "termIds": [
    1333,
    1509,
    1703,
    2015,
    2267,
    4281,
    4285,
    671,
    1218,
    5390
  ],
  "sentences": [
    "Martin Mayhew, the team’s general manager, said Wednesday at the NFL Combine in Indianapolis that the Commanders have “spoken to every club that has a quarterback who might be available,” according to ESPN, with the publication adding, “That means they’ve inquired about quarterbacks Russell Wilson and Aaron Rodgers, among others.”\nAlthough Wilson recently sang Seattle’s praises and Rodgers’ NFL future is yet to be determined, some fans – as highlighted by the Kansas City Star – had a field day over the idea of Washington connecting with Kansas City about Patrick Mahomes’ availability.",
    "“While I commend the @Commanders for leaving no stone unturned, I feel sorry for the poor soul that had to ask the @Chiefs if @PatrickMahomes was available!” one user wrote, while another wrote, “The Washington Commanders (aka WFT) called the Kansas City Chiefs and asked if Patrick Mahomes was available.. if you are ever scared to shoot your shot in life.. just reread the first sentence of this tweet.”\nMahomes is tied to Kansas City for the foreseeable future, having signed a 10-year contract extension worth $503 million after winning the Super Bowl in 2020.",
    "The ESPN report that noted how the Commanders have “reached out to every team to inquire about a quarterback’s availability and the cost.”\nOthers, meanwhile, commended the Commanders for shooting their shot but offered sympathy to whoever was tasked to dial Chiefs general manager Brett Veach.",
    "Commanders: I was thinking Patrick Mahom…\nChiefs: *hangs up\nChiefs: they couldn’t be serious\n— Austin Ewing (@TheRealBigOlAE) March 3, 2022\n“Every time you hear something, you’re checking into it,” Rivera said Tuesday.",
    "We’ve got to do our due diligence.”\nThe Commanders, per ESPN’s sources, drew up a list “of around 40 quarterbacks to at least discuss or investigate,” which also apparently includes those in college.",
    "Despite signing veteran journeyman Ryan Fitzpatrick in March 2021, the quarterback was placed on injured reserve after suffering a hip subluxation in Week 1.",
    "Washington is one of several quarterback-needy teams this offseason and currently holds the 11th overall pick in the 2022 NFL Draft.",
    "Taylor Heinicke went on to replace Fitzpatrick, with backups Kyle Allen and Garrett Gilbert also on the roster.",
    "Despite the unlikelihood of some scenarios, Commanders coach Ron Rivera seems keen on exhausting every option.",
    "Should an NFL team decide to make a move, perhaps they’ll be the ones giving the Commanders a call.",
    "The Washington Commanders appear to be swinging for the fences in their search for a quarterback.",
    "Commanders: Hey, we wanted to speak about the possibility of a trade.",
    "Washington finished the 2021-22 season with a 7-10 record.",
    "“And so we’ve got to do our work.",
    "Chiefs: Who do you have in mind?"
  ]
}