{
  "id": 4044,
  "mediaId": 2586,
  "date": "2022-02-28",
  "headline": "Bills Take Major Step Toward New $1.4 Billion Stadium: Report",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Buffalo-Bills-Fans-1-e1646107035576.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-step-toward-new-stadium/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1671,
    4262,
    4323,
    160,
    184,
    671,
    4967
  ],
  "sentences": [
    "Stadium Likely Missing One Important Detail\nWhile many Bills fans have expressed a desire for a domed stadium — especially after a season with a string of bad-weather games, capped off by a single-digit playoff game against the New England Patriots — that will almost certainly not be included in the final plans.",
    "“The Governor [Kathy Hochul] has stepped into a very difficult challenge because when she came into office, not only is the lease up in another year, but the stadium has been studied by experts and it’s reaching [the end of] its useful life for that stadium.",
    "The Bills’ lease at Highmark Stadium expires July 31, 2023 — after one more season.”\nBills stadium agreement so close you can almost touch it.https://t.co/4MnW2c4tEM\nGraham said the details may have actually already been determined, but New York Gov.",
    "The Athletic’s Tim Graham reported that the team has been moving steadily forward negotiations with New York State and Erie County, and the two sides have progressed enough that an announcement on financing could come as earlier as this week.",
    "“A public-private financing agreement not only will get done for the proposed $1.4 billion Orchard Park ballpark, but the tea leaves indicate it also could be announced this week,” he reported.",
    "DETAILS: https://t.co/vMEoEld8vi\n— Mel Orlins (@Mel_Orlins) February 21, 2022\nGoodell said the new stadium will come just in time, as the current stadium is nearing the end of its life.",
    "While that may come as a disappointment to some fans, Graham noted that the team will likely be able to avoid the threats of relocation that often come with stadium negotiations.",
    "All sides have expressed optimism about reaching a conclusion, and even NFL commissioner Roger Goodell said during Super Bowl weekend that he was pleased by the negotiations.",
    "Graham reported that it has already been decided that the next stadium will have natural grass and no dome, and that it is far too late to make a push to move it downtown.",
    "“I’m encouraged by the progress that’s being made both at the state level and county level and with the club,” Goodell said, via SI.com’s Bills Central.",
    "Announcement Could Be ‘Imminent’\nGraham reported that the upcoming schedule in March indicates that a deal will in place very soon.",
    "Though they had initially aimed to have a deal in place by the end of 2021, Graham reports that the wheels are now in motion.",
    "League owners will be holding spring meetings on March 27 and the stadium sub-committee will convene on March 8 or 9.",
    "“NFL owners won’t meet again until the fall, and no lease agreement can become official without their blessing.",
    "The Buffalo Bills are about to take a major step toward a new stadium, a new report claims.",
    "“No deal before the March 27 meeting would stop progress in its tracks,” Graham reported.",
    "Instead, it will be located in Orchard Park, near the footprint of the current stadium.",
    "Kathy Hochul could be waiting for a politically expedient time to announce it.",
    "That likely means something solid will be determined before the end of March.",
    "THE PUSH FOR CHEAPER FOOD & DRINKS… as talks of a new Bills stadium brew ????",
    "It probably has no more than five years, according to many of those studies.”",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!"
  ]
}