{
  "id": 4048,
  "mediaId": 2594,
  "date": "2022-02-25",
  "headline": "Winter Paralympics 2022: A closer look at Great Britain’s hottest medal prospects",
  "image": "https://static.independent.co.uk/2022/02/25/06/a67773102ededd750af6b54e103e8e19Y29udGVudHNlYXJjaGFwaSwxNjQ1NjI1NDQ3-2.35580599.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/winter-olympics/paralympicsgb-great-britain-alpine-skiing-nordic-skiing-beijing-b2023026.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Elliot",
  "authorUrl": "https://www.independent.co.uk/author/ed-elliot",
  "termIds": [
    1364,
    3590,
    3990,
    157,
    4994,
    5322,
    5370
  ],
  "sentences": [
    "Last year he won the overall Para-snowboard World Cup title, while he returned from the recent world championships with silver in snowboard cross, plus bronzes in dual banked slalom and the team event, alongside Ollie Hill.",
    "Ewan, a bronze medallist from Sochi 2014, and Nibloe are veterans of the underwhelming seventh-placed finish of 2018, with Melrose, Dawson-Farrell and travelling reserve Charlotte McKenna making Paralympic debuts.",
    "Visually-impaired Simpson – who has Nystagmus, which causes involuntary eye movements – broke through in 2020, winning slalom gold and giant slalom bronze at the Para Alpine World Cup.",
    "Sweden and reigning world and Paralympic champions China are among their formidable rivals but the team is capable of beating anyone on their day and gold is not out of the question.",
    "Fitzpatrick, 23, last month underlined her credentials by winning the slalom world title, in addition to claiming super combined silver behind team-mate Millie Knight.",
    "The reigning slalom champion, who also claimed two silvers and a bronze in South Korea, will be racing with new guides Katie Guest and Gary Smith on this occasion.",
    "The team – GB’s biggest for a winter Games since Lillehammer in 1994 – will compete between March 4-13 in alpine skiing, Nordic skiing, snowboarding and curling.",
    "The Scottish siblings – from Banchory in Aberdeenshire – head to China buoyed by a silver medal in the super combined at the recent world championships.",
    "The 32-year-old, who was born without a right hand, relocated to the French ski resort of Morzine after finishes of seventh and 10th at the 2018 Games.",
    "She also has a strong bond with long-term guide Brett Wild and, like compatriot Fitzpatrick, will go for glory in all five alpine events.",
    "Menna Fitzpatrick (Alpine skiing)\nVisually-impaired skier Fitzpatrick was Britain’s only gold medallist four years ago in PyeongChang.",
    "Despite being keen to downplay her chances, Knight claimed the visually-impaired super combined world title just last month.",
    "She is a gold short of a complete Paralympic medal collection following two silvers and a bronze in PyeongChang.",
    "Games debutant Simpson, 20, has skied since the age of four and is guided by elder brother Andrew.",
    "Britain’s curlers will look to take inspiration from the successes of their Olympic counterparts.",
    "Barnes-Miller is bidding to make history as Britain’s first Paralympic medallist in his sport.",
    "The 23-year-old has overcome repeated concussions to be selected for a third successive Games.",
    "He went on to be shortlisted for the BBC Young Sports Personality of the Year.",
    "ParalympicsGB has selected 25 athletes across four sports for Beijing 2022.",
    "Here, we picks out five of the best medal hopes.",
    "The move has paid dividends."
  ]
}