{
  "id": 4061,
  "mediaId": 2643,
  "date": "2022-02-25",
  "headline": "'You Jacka**': Man Dragged for Bringing Entire Family to Girlfriend's Job",
  "image": "",
  "link": "https://www.newsweek.com/you-jacka-man-dragged-bringing-entire-family-girlfriends-job-1682919",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Taylor McCloud",
  "authorUrl": "https://www.newsweek.com/authors/taylor-mccloud",
  "termIds": [
    0
  ],
  "sentences": [
    "\"She clearly wasn't ready to meet them, and instead of respecting that you trampled all over it and brought them into her WORK (where she quite literally has no choice but to be as respectful and polite as possible) and forced an interaction on her,\" they commented.",
    "Recommending that couples prepare for meeting families by reviewing specific dynamics and warning each other of any potential areas of tension, Chronister was also clear that first interactions should be \"short and sweet,\" to mitigate pressure felt by each partner.",
    "In a separate comment, which has received more than 2,100 votes, Redditor u/Kokbiel said it was clear the original poster's girlfriend was not ready to meet his family, and that she had no choice but to be cordial because he brought them to her job.",
    "In an interview with Refinery29, couples' therapist Jean Fitzpatrick discouraged partners from forcing interactions, and said that all circumstances must be considered when deciding the best time to introduce a significant other to family.",
    "In the post's top comment, which has received nearly 24,000 votes, Redditor u/JessicaJones2 sided firmly with the original poster's girlfriend, and slammed the 24-year-old for thinking his introduction plan was a good idea.",
    "In a viral post published on Reddit's r/AmITheA**hole, the 24-year-old Redditor said that his 26-year-old girlfriend had been hesitant to meet his family, so he decided to bring them all to the restaurant she works at.",
    "Titled, \"AITA for bringing my entire family to the restaurant where my girlfriend was working as a server in order to meet her?,\" the post has received 9,300 votes and 2,300 comments in the last 12 hours.",
    "Writing that he had asked his girlfriend to meet his parents, siblings, in-laws and nieces on multiple occasions, the Redditor explained that she always \"had an excuse\" why she couldn't.",
    "Expectations, combined with family dynamics and a myriad of personality, have the potential to lead to poor first interactions that can linger for the duration of the relationship.",
    "\"I called her and she went off on me about how I shouldn't have blindsided her by bringing my whole family and how she should have had the chance to meet my family on her terms.\"",
    "Another commenter, whose response has received more than 6,600 votes, said they would have reacted the same way the original poster's girlfriend did if put in the same situation.",
    "Echoing those sentiments, Redditors responding to the viral post called out the original poster for bringing so many family members to meet his girlfriend while she was working.",
    "\"I responded that she didn't seem to want to meet my family whenever I brought it up so that if it were to ever happen, this was the way I'd figured out,\" he added.",
    "In 2016, clinical psychologist Dr. Kim Chronister told Bustle that \"introducing one's partner to family is a nerve-racking moment for many reasons.\"",
    "Thousands of internet commenters were stunned after one man revealed how he introduced his whole family to his girlfriend, while she was at work.",
    "\"Last weekend, I brought my whole family (my parents, as well as my sisters and their husbands, and their kids) to her restaurant,\" he wrote.",
    "\"When she saw us I could tell that she was taken aback, but she did her job well and even took the time to talk to us all,\" he continued.",
    "But after weeks of requests from his family to meet her, the Redditor said he coordinated a plan to ensure both parties would meet.",
    "\"What your partner looks like, does, or says can create negative or positive opinions in the minds of one's family for years.\"",
    "\"She said that what I did was wrong and that she had to give my family special attention at the expense of her other tables.\"",
    "\"Instead of easing her into another possible meeting scenario...you show up with your whole family at her place of work.\"",
    "\"She's right, you've blindsided her with something that she's having difficulty coping with,\" they commented.",
    "\"Not only are you ignoring her opinions, but you're also putting her [in] a tough time at work,\" they added.",
    "\"Upon leaving my entire family expressed that they really liked her...they also left her a HUGE tip.",
    "Fitzpatrick also discouraged introducing a significant other to the entire family all at once.",
    "\"One reason is that a first impression...is a lasting impression,\" Chronister explained.",
    "After his girlfriend finished her shift, the Redditor said he was informed otherwise.",
    "\"My girlfriend texted me and said 'Thanks a lot, you jacka**',\" he wrote.",
    "Regardless that your family liked her and left a 'HUGE' TIP,\" they wrote.",
    "\"There is no 'maybe' you shouldn't have done that,\" they added.",
    "The fact that you don't see an issue, is a huge issue.\"",
    "For couples, meeting families can be a daunting task.",
    "\"I requested a table in her section.\"",
    "I'd be so pissed at you if it was me!",
    "I thought the whole thing was fine.\"",
    "\"You absolutely shouldn't have.\"",
    "\"How uncomfortable for her!",
    "\"Yuck."
  ]
}