{
  "id": 4071,
  "mediaId": 2644,
  "date": "2022-03-05",
  "headline": "Seahawks set bar for Russell Wilson trade after declining Commanders’ hefty offer",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/1362406213.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/05/seahawks-reject-commanders-hefty-russell-wilson-trade-offer/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Dunleavy",
  "authorUrl": "",
  "termIds": [
    2015,
    3978,
    4055,
    4281,
    286,
    703,
    930,
    1218,
    5039
  ],
  "sentences": [
    "The trade offer backs up what both teams said earlier this week at the NFL Scouting Combine: The Seahawks will entertain phone calls on all players, but are not looking to move on from Wilson, while the Commanders plan to be aggressive in pursuing a veteran quarterback.",
    "Washington has a talented roster — perhaps more so than the seemingly fading Seahawks — but the organization has been surrounded by controversy for most of owner Daniel Snyder’s two-decade tenure and is being investigated over allegations of sexual misconduct.",
    "We’ve got to do our due diligence.”\nPackers general manager Brian Gutekunst said he had not heard from any of his peers regarding a trade for MVP Aaron Rodgers, which could be about to change unless Washington saw Wilson as much more likely to be available.",
    "Wilson has a no-trade clause and, even if the teams agreed upon fair compensation, it is unknown if he would waive it to go to the Commanders, who could become the favorites in the NFC East with a quarterback of the nine-time Pro Bowler’s caliber.",
    "Taylor Heinicke was 7-8 as Washington’s starter last season, when the initial plan to go with Ryan Fitzpatrick backfired when the veteran suffered a season-ending injury in Week 1.",
    "“I don’t think you will see many quarterbacks on the move despite all the talk,” one NFL executive told The Post.",
    "The Seahawks declined an offer of multiple first-round picks from the Commanders, according to multiple reports.",
    "Wilson’s agent said last offseason he would be willing to be traded to the Cowboys, Saints, Bears and Raiders.",
    "Wilson’s trade availability has been a subject for 14 months, but Washington’s is the first reported offer.",
    "INDIANAPOLIS — Any team looking to make a trade for Russell Wilson will have a high bar to clear.",
    "Wilson is a former NFL Man of the Year award-winner and is close to commissioner Roger Goodell.",
    "“This year we are being very proactive, looking, searching,” head coach Ron Rivera said.",
    "Every time you hear something, you’re checking into it.",
    "“We are trying to truly cover every base."
  ]
}