{
  "id": 4078,
  "mediaId": 2732,
  "date": "2022-03-01",
  "headline": "Steelers notebook: GM 'absolutely' expects DE Stephon Tuitt to play football in 2022",
  "image": "",
  "link": "https://triblive.com/sports/steelers-notebook-gm-absolutely-expects-de-stephon-tuitt-to-play-football-in-2022/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Rutter",
  "authorUrl": "https://triblive.com/author/joe-rutter/",
  "termIds": [
    0
  ],
  "sentences": [
    "Colbert, who is assisting team president Art Rooney II in the search for his successor, wanted to get most initial interviews out of the way before Tuesday, when NFL teams could restrict candidates from interviewing for positions with other clubs.",
    "“Then, we’ll deal with it after the draft.”\nOpenings in secondary\nOne year after the offensive line was overhauled, the Steelers face the prospect of losing three of their top five members of the secondary to free agency.",
    "I can’t say which one it will be and in which order.”\nFitzpatrick, who had his fifth-year option exercised, is in line for a contract extension, but such talks likely won’t take place until training camp, Colbert said.",
    "INDIANAPOLIS — After missing the 2021 season because of a knee injury and the unexpected death of his brother, defensive end Stephon Tuitt has told the Pittsburgh Steelers he plans on returning to play this year.",
    "Tuitt then underwent knee surgery in training camp before participating in a team practice, and he spent the season on injured reserve while the Steelers offered no updates on a potential return.",
    "We’ll always have that door open for him.”\nMore the merrier\nAfter interviewing 12 candidates to replace him as general manager, Colbert said that the Steelers might not be done with the process.",
    "“The people under contract, we’re respectfully going to leave them to their teams, and our focus will be on getting this draft and free agency correct,” Colbert said.",
    "“There might be folks not under contract we may look at as well.”\nInternal candidates Omar Khan and Brandon Hunter were the first to be granted interviews.",
    "“We respected what he had to deal with, and we tried to support him as best as possible.”\nThe question is whether Tuitt will play for the Steelers in 2022.",
    "“I wish I could say it’s going to be this, this and this, but it’s going to be a combination of trade, unrestricted free agent and draft.",
    "His salary cap hit of nearly $14 million heading into the final year of his contract is third highest on the Steelers roster.",
    "“Oh, yeah, absolutely,” general manager Kevin Colbert said on an interview with Steelers Nation Radio at the NFL Combine.",
    "“He had a knee injury he had to work his way through and had a family situation that hurt that,” Colbert said Tuesday.",
    "Colbert has said the second round of interviews won’t take place until the conclusion of the NFL Draft in late April.",
    "“We’ll continue to look at guys who are still under contract as we move forward,” Colbert said at the NFL Combine.",
    "Among starters, only cornerback Cameron Sutton and free safety Minkah Fitzpatrick are under contact for 2022.",
    "“He wanted to play last year.”\nTuitt’s brother was killed in a hit-and-run accident in Georgia in June.",
    "“We’re very excited to see what the next step is for Stephon,” Colbert said.",
    "The Steelers conducted 10 additional interviews, including three last week.",
    "We’ll continue to monitor that and see where it leads.",
    "“How do we put that back together?” Colbert said.",
    "We respect that and understood that.",
    "Stephon went through a tough year.",
    "“We’re respectful of where he is.",
    "Categories: Sports | Steelers/NFL",
    "“The next step, we don’t know."
  ]
}