{
  "id": 4102,
  "mediaId": 2523,
  "date": "2022-03-01",
  "headline": "How Both Drafting and Trading for QBs Can Save the Future of the Steelers",
  "image": "https://img.bleacherreport.net/img/images/photos/003/920/688/hi-res-2ddbbc631f039f8fd2d607c627ec661c_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2953938-how-both-drafting-and-trading-for-qbs-can-save-the-future-of-the-steelers",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maurice Moton",
  "authorUrl": "https://bleacherreport.com/users/4cb5ecd3-8950-4cfa-9f2d-559fbbcd282e",
  "termIds": [
    1674,
    1703,
    2015,
    2249,
    3069,
    3778,
    4050,
    4352,
    4790,
    823
  ],
  "sentences": [
    "He can move the chains if the Steelers have issues with their offensive line, which featured two rookies last year (left tackle Dan Moore Jr. and center Kendrick Green) and may lose two veterans in guard Trai Turner and Chukwuma Okorafor via free agency.",
    "While a fourth-round pick and a conditional fourth-rounder seems like fair compensation for a quarterback who's helped his team advance to the NFC Championship Game in two of the last three years, like Mariota, Garoppolo has an extensive injury history.",
    "If the Steelers make an aggressive move, Kenny Pickett—who had a breakout 2021 term at Pittsburgh, throwing for 4,319 yards and 42 touchdowns against seven interceptions with a 67.2 percent completion rate—should land on their radar.",
    "Free-Agent Targets\nAs Pauline noted Monday, the Steelers might have an interest in Trubisky, who could land a starting job for the upcoming campaign after he served in a backup role behind Josh Allen of the Buffalo Bills in 2021.",
    "Rather than give up draft capital and pay $10 million-plus for an injury-prone quarterback such as Mariota or Garoppolo, Pittsburgh could sacrifice far less for Minshew, who can produce in a stopgap role.",
    "With $28.7 million in projected cap space, the Steelers would likely restructure Garoppolo's contract, but he may still cost more than Mariota, who is coming off back-to-back campaigns in a reserve role.",
    "Despite all the trade buzz around quarterbacks Aaron Rodgers and Russell Wilson, their teams, the Green Bay Packers and Seattle Seahawks, haven't shown signs that they're ready to move on from the stars.",
    "As a sleeper option, the Steelers should also consider Gardner Minshew, who has thrown for 41 touchdowns to 12 interceptions through 27 outings, which includes 22 starts with the Jaguars and Eagles.",
    "With 2021 Defensive Player of the Year T.J. Watt, two-time All-Pro safety Minkah Fitzpatrick and three-time All-Pro tackle Cameron Heyward, new coordinator Teryl Austin has cornerstone playmakers.",
    "Within a run-heavy offense (fifth in carries) and with one pass-catcher who went over 40 receptions and 384 yards, Wentz posted decent numbers; a better supporting cast could elevate his play.",
    "If general manager Kevin Colbert entertains trade options, he should pursue Carson Wentz, who has played through bumps, bruises and sprains without missing a game because of injury since 2018.",
    "Like the Steelers' quarterback transition in the early 2000s with Tommy Maddox claiming a couple of seasons between Kordell Stewart and Roethlisberger, the club may go through a bridge phase.",
    "2 pick from the 2017 draft, but he's a capable starter who threw for 3,223 yards and 24 touchdowns against 12 interceptions with a 66.6 percent completion rate in a Pro Bowl 2018 campaign.",
    "In the meantime, Minshew can run the offense and keep the Steelers competitive until team brass decides it's time to turn over the reins to the dual-threat Liberty product.",
    "Minshew, who has never started and finished a season in a lead role, should be able to handle a high draft pick in the backup spot while he tries to establish himself.",
    "If the defense bounces back after a down year, having ranked 20th in points allowed and 24th in yards allowed, Pittsburgh wouldn't have to heavily depend on Trubisky.",
    "If the Colts don't terminate Wentz's contract, the Steelers should offer a fourth-round pick for him and restructure his deal, which carries a $28.3 million cap hit.",
    "In 2020, he had a solid game against the Los Angeles Chargers, throwing for 226 yards and a touchdown with an interception while rushing for 88 yards plus a score.",
    "Meanwhile, Pittsburgh has targeted impending veteran free agents Mitchell Trubisky, Teddy Bridgewater and Jameis Winston, per Pro Football Network's Tony Pauline.",
    "Pickett doesn't have the arm strength or mobility of Willis, but he's decent in both aspects and makes anticipatory pro-level throws to three levels of the field.",
    "In 2020, he had tied Drew Lock with a league-leading 15 interceptions, and the Philadelphia Eagles benched him for Jalen Hurts for the final quarter of the year.",
    "Trubisky would also have a talented pass-catching group with wideouts Diontae Johnson and Chase Claypool, tight end Pat Freiermuth and running back Najee Harris.",
    "At Liberty, Willis threw for 5,117 yards and 47 touchdowns with 18 interceptions and a 62.4 completion percentage and rushed for 1,822 yards and 27 touchdowns.",
    "Trade Options\nThe Athletic's Tim Kawakami has laid out a hypothetical trade between the Steelers and San Francisco 49ers that centered around Jimmy Garoppolo.",
    "With Mariota, the Steelers would have to feel comfortable with Mason Rudolph as a backup or confident in a rookie because of the veteran's injury history.",
    "In 2021, Minshew made two quality fill-in starts in place of Hurts, completing 39 of 58 passes for 428 yards and four touchdowns against one interception.",
    "He's not a dynamic quarterback, but the third-year pro can move in and out of the pocket, having logged 518 rushing yards and a touchdown in his career.",
    "According to ESPN's Chris Mortensen via Pro Football Focus' Ari Meirov, the Indianapolis Colts will \"probably\" trade or release Wentz before March 19.",
    "He has a big arm, the ability to play in an RPO-heavy system and the legs to compensate for an offensive line that may take time to build chemistry.",
    "With Pittsburgh, he would have Johnson, Claypool and Freiermuth, which is far better than just the reliable Michael Pittman Jr. on the perimeter.",
    "Through his first four seasons, Mariota missed eight games, and he went on injured reserve twice with the Raiders for pectoral and quad injuries.",
    "His contract also carries a $27 million cap hit with San Francisco responsible for $1.4 million in dead money if he is traded, per Over the Cap.",
    "With that said, Willis may need a season or two to develop a better feel for the pocket before he takes on a full-time role with the first unit.",
    "In Philadelphia, Wentz may have struggled with Hurts, a 2020 second-rounder, behind him on the depth chart, per Fox Sports' Jay Glazer.",
    "He started 61 contests with the Tennessee Titans and threw for 76 touchdowns with 44 interceptions and a 62.8 percent completion rate.",
    "Nevertheless, the Steelers could mirror what Vegas did and extrapolate that plan through an entire campaign with him as the starter.",
    "Before a disappointing finish in his 2021 season finale against the Jacksonville Jaguars, Wentz put together a decent campaign.",
    "But the 29-year-old threw for 27 touchdowns with seven interceptions for a decent showing in his first year with the Colts.",
    "Over the past two years, Mariota settled into a reserve role behind the Las Vegas Raiders' Derek Carr and played sparingly.",
    "Of course, if the Packers or Seahawks made their starters available, both would draw several suitors, including Pittsburgh.",
    "Let's explore a few options on the free-agent, trade and draft markets and offer a conclusion for the best plan of action.",
    "The 28-year-old has recorded 1,574 yards and 13 touchdowns on the ground and averaged 5.7 yards per carry as a starter.",
    "Barring a blockbuster move for either Super Bowl-winning passer, what's the best practical approach for the Steelers?",
    "Through five terms, Trubisky has thrown for 64 touchdowns with 38 interceptions and a 64.1 percent completion rate.",
    "At his best, he can beat defenses through the air and on the ground, and he would be tough to pass up if available.",
    "Unless the Steelers have major concerns about his hand size, he is arguably a top-two draft target at the position.",
    "\"And though I cannot confirm Pittsburgh is targeting Willis, I do know they like him an awful lot,\" Pauline wrote.",
    "For the first time since the 2004 season, the Pittsburgh Steelers will have a new full-time starter behind center.",
    "20 spot if the dual threat continues to build his buzz following an impressive showing during Senior Bowl week.",
    "The Steelers can possibly acquire him in a similar deal and take on his relatively measly $2.5 million cap hit.",
    "The Athletic's Mark Kaboly believes the Steelers should \"take a peek at\" Mariota in free agency, and why not?",
    "If the Steelers have competition for Trubisky's services, they can turn to Marcus Mariota, who was also a No.",
    "With that concern, he would not be a good option if Colbert wants to draft a quarterback in the first round.",
    "How can he put the Steelers in the best position to compete in 2022 while setting them up for the future?",
    "Mariota is a more dynamic signal-caller, and Pittsburgh can probably acquire him at a better value.",
    "In that year, Trubisky helped lead the Chicago Bears to the NFC North title and had an 11-3 record.",
    "Draft Fits\nPauline and NBC Sports Edge's Thor Nystrom have connected the Steelers to Malik Willis.",
    "Last offseason, the Eagles acquired Minshew from the Jaguars for a conditional sixth-round pick.",
    "In 2021, the Raiders used Mariota for run-pass option plays, but he only threw two passes.",
    "Best Plan of Action\nWhat should Colbert do as he transitions out of his role?",
    "In addition, defenders would have to account for his ball-carrying skills.",
    "Because of his tools, Willis is a high-upside prospect.",
    "Trubisky may never play up to his pedigree as the No.",
    "He's also rushed for 1,081 yards and nine touchdowns.",
    "2 pick (2015) and has extensive starting experience.",
    "Salary-cap information provided by Over the Cap.",
    "Pittsburgh may have to trade up from the No.",
    "Let the post-Ben Roethlisberger era begin.",
    "College statistics via CFBStats.com.",
    "He's missed 25 outings since 2018.",
    "B/R Recommends"
  ]
}