{
  "id": 4104,
  "mediaId": 2722,
  "date": "2022-03-03",
  "headline": "English golfer Matt Fitzpatrick reveals harrowing phone call with ex-girlfriend from Ukraine",
  "image": "https://i2-prod.mirror.co.uk/incoming/article8944896.ece/ALTERNATES/s1200/Ryder-Cup-Golf-Practice-Round.jpg",
  "link": "https://www.mirror.co.uk/sport/golf/matt-fitzpatrick-girlfriend-ukraine-invasion-26373656",
  "mediaOutlet": "themirror",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fraser Watson",
  "authorUrl": "https://www.mirror.co.uk/authors/fraser-watson/",
  "termIds": [
    0
  ],
  "sentences": [
    "However, the significance of golf tournaments, and indeed sport as a whole, has been dwarfed this past week by the situation in Ukraine, with more than a million civilians having fled to the border as the country's death toll rises amid the Russian invasion.",
    "Fitzpatrick, 27, has made a solid start to the year with top-10 finishes at the Phoenix Open and the Pebble Beach pro-am, but is still seeking his first win in America as he gears up for Thursday's Arnold Palmer Invitational in Orlando.",
    "\"I’d already decided to be a little easier on myself this year and appreciate all that I have but that phone call just emphasised I don’t want to be miserable for the rest of my life worrying about winning golf tournaments,\" he said.",
    "The two-time Ryder Cup player has admitted to putting too much pressure on himself in the build-up to big events, but the situation in Ukraine has allowed him to view the sport in a different light.",
    "Matt Fitzpatrick will approach the major golf tournaments with a different perspective this year after a harrowing phone call with his Ukrainian ex-girlfriend.",
    "\"She was telling me about her gran who had a couple of strokes recently and can hardly walk, so she can’t go anywhere,\" he told Sportsmail.",
    "At the Arnold Palmer event, hosted by the Bay Hill Club and Lodge, Fitzpatrick will tee off for his first round at 12.10pm GMT on Thursday.",
    "\"I was sitting there in Florida ready to practise and it hit me, the contrast between the fact he might never come back and what I do.\"",
    "\"The people around me say that I’m different in a major week and while I can’t see it myself it’s something that I need to work on.",
    "Fitzpatrick is yet to notch a major title, with a tied-seventh placed finish at the 2016 US Masters representing his best effort.",
    "World no 25 Fitzpatrick contacted his former partner after the conflict began, knowing her family still reside in Lviv.",
    "I feel that I’m a different player now to 2015-18, so hopefully I can relax in the majors and it will start to show.\"",
    "The event traditionally forms an integral part of the build-up to the US Masters, which starts this year on April 5.",
    "\"Then she told me about her uncle who had just packed his bags and was off to fight tomorrow.",
    "\"Sure, I want to win but there has to be a balance."
  ]
}