{
  "id": 4109,
  "mediaId": 2636,
  "date": "2022-02-25",
  "headline": "Arctic Explorers, New Jersey Literature and Other Letters to the Editor",
  "image": "https://static01.nyt.com/images/2022/02/13/books/review/chua1/chua1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/25/books/review/arctic-explorers-new-jersey-literature-and-other-letters-to-the-editor.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "King\nPhiladelphia\nJersey Books\nTo the Editor:\nIn his review of Harley Rustad’s “Lost in the Valley of Death” (Feb. 13), about the American trekker Justin Alexander Shetler, Michael Paterniti writes that Shetler “is sent to the Tracker School in New Jersey, of all places.” For those who might have snickered along but then wondered how the Garden State might have spawned such an institution, let me suggest two New Jersey books: “The Pine Barrens,” by John McPhee; and one by the founder of that very school, Tom Brown Jr., entitled “The Tracker.”\nLee Mosher\nNew York\nSpiritual Strolls\nTo the Editor:\nI feel compelled to defend the minutiae of “The Transcendentalists and Their World,” by Robert A.",
    "Kibbe Fitzpatrick\nNaples, Fla.\nGendered Gods\nTo the Editor:\nGiven that both of them are women, it’s surprising that neither the reviewer Karen Armstrong nor, I’m presuming, the author Francesca Stavrakopoulou mentioned female (or for that matter, nonbinary or trans) depictions of God relative to the canonical portrayals in Stavrakopoulou’s book, “God: An Anatomy” (Feb. 13).",
    "It is even more surprising because in a previous book on the discovery of the South Pole, “Race to the Pole,” Fiennes spent almost a full chapter criticizing Huntford’s own book on the same subject, “Scott and Amundsen” (which was subsequently republished as “The Last Place on Earth,” to fit with the title of a television show based on it).",
    "Betsy Andrews\nBrooklyn\nMissing Receipts\nTo the Editor:\nI found it surprising that in his review of Ranulph Fiennes’s “Shackleton” (Feb. 13), Lloyd Spencer Davis did not mention Roland Huntford’s biography of Ernest Shackleton, widely considered the standard account of the explorer’s life.",
    "And there are umpteen examples in the feminist outsider scholar Barbara Walker’s “The Woman’s Encyclopedia of Myths and Secrets” and “The Woman’s Dictionary of Symbols and Sacred Objects.” It’s OK that Stavrakopoulou’s focus is the canonical.",
    "According to Chua, the book’s author glides “over why English won, simply stating that English is the language of neoliberalism and globalization, which seems to beg the question.” A murky explanation indeed.",
    "But the review is all “he,” “him,” “his.” It would have behooved both author and reviewer to at least acknowledge that not all gods, and not all depictions of the Judeo-Christian god, are male.",
    "Correction\nA bibliographic note with a review on Feb. 13 about Julia May Jonas’s novel, “Vladimir,” misidentified the book’s publisher; it is Avid Reader Press, not Simon & Schuster.",
    "Language Barriers\nTo the Editor:\nAmy Chua’s superbly written review of “The Rise of English” (Feb. 13) prompted me to order the book right away.",
    "As a longtime simultaneous interpreter at the United Nations, I had a front-row seat to the conquest of the world by the English language.",
    "I still search for the answer to why English could win a battle that Sanskrit, Greek and Latin could not come close to achieving.",
    "Apparently in contrast to Fiennes’s new book, Huntford’s on Shackleton was well documented with source notes.",
    "Spirituality filled the air as I walked through the town and visited one historic site after another.",
    "To cite a few, there’s Shekinah, who is female and is the presence of God on Earth in the kabbalah.",
    "As I walked the Old North Bridge, a gentle wind brought golden oak leaves down upon my head.",
    "I loved every minute of my visit as I have also loved every minute of reading this book.",
    "Perhaps that owes in part to my daylong visit to Concord several years ago.",
    "But what accounted for this unprecedented victory remains unexplained.",
    "A book on this subject is waiting to be written.",
    "Carole Lee\nLexington, Ky.",
    "books@nytimes.com",
    "Gross (Feb. 13).",
    "Steven A."
  ]
}