{
  "id": 4119,
  "mediaId": 2551,
  "date": "2022-03-06",
  "headline": "DEREK LAWRENSON AT BAY HILL: It has been the year of the underdog at the PGA Tour this season with Talor Gooch and Billy Horschel leading the way, and Rory McIlroy, Viktor Hovland and Brit Tyrrell Hatton struggling to deliver",
  "image": "https://i.dailymail.co.uk/1s/2022/03/06/13/55011665-0-image-a-2_1646574901957.jpg",
  "link": "https://www.dailymail.co.uk/sport/golf/article-10583169/Rory-McIlroy-Viktor-Hovland-Tyrrell-Hatton-struggled-far-years-PGA-Tour.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Derek Lawrenson Golf Correspondent At Bay Hill",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Derek+Lawrenson+Golf+Correspondent+At+Bay+Hill",
  "termIds": [
    1326,
    1523,
    1805,
    2178,
    4083,
    4127,
    816
  ],
  "sentences": [
    "+5\nView gallery\nRory Mcilroy has failed to deliver so far in the PGA Tour at the Arnold Palmer Invitational\n+5\nView gallery\nViktor Hovland has also struggled to produce the goods when it matters most in Florida\nFor the second day running he finished poorly over the daunting closing stretch, driving out of bounds at the 15th and then bogeying the tortuous 17th and 18th holes for good measure.",
    "+5\nView gallery\nUnderdog American Talor Gooch has been a standout player so far and leads the way\n+5\nView gallery\nFellow countryman Billy Horschel is another outsider who is at the top of the standings\nHis ball had finished in a wicked lie just off the putting surface from where he had virtually no shot.",
    "A victory for either would continue a curious run that has seen not a single player ranked inside the world top ten at the time of their win claim any of the first eight events held so far this season on the PGA Tour.",
    "It was a day for the streetfighters, therefore, so no surprise to see Graeme McDowell shoot 69 to move up 23 places to stand alongside McIlroy, while Matt Fitzpatrick shot 70 to be inside the top ten.",
    "It says everything about the difficulty of the test that McIlroy shot a disappointing 76 and yet will start the final round only four shots behind, having begun the day two strokes in arrears.",
    "The consolation on a course where no-one seems to be able to hold on to the lead is that he might fancy a shot at the title from just off the pace, rather than at the top of the board.",
    "It appeared he was cruising to his fourth victory worldwide in his last eight starts but then it all went wrong, even for him, as he played the back nine in 40 strokes for a 75.",
    "It's been the year of the underdog so far on the PGA Tour this season and it certainly continued in a wild third round at the Arnold Palmer Invitational at brutal Bay Hill.",
    "Instead of his impossible shot, he was allowed to drop the ball on the apron of the green and, adding insult to injury, he holed the subsequent birdie putt.",
    "It left him one stroke behind the unheralded American Talor Gooch and his underrated fellow countryman, Billy Horschel.",
    "Horschel was the outrageous beneficiary of what ought to go down as licensed cheating on the 18th hole.",
    "It is how he won this title in 2018, after all, when he birdied five of the last six holes.",
    "Fortunately for Horschel, he was allowed a free drop because of a sprinkler head nearby.",
    "With nine holes to play he had reached ten under and was four shots clear.",
    "Even Hovland struggled after hitting the front.",
    "Hatton, alas, carded a 78 to fall six behind.",
    "Viktor Hovland struggled.",
    "Tyrrell Hatton imploded.",
    "Rory McIlroy struggled."
  ]
}