{
  "id": 4162,
  "mediaId": 2746,
  "date": "2022-03-06",
  "headline": "Blinken: U.S. in talks with allies about banning Russian oil imports",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/04/russia_ukraine_war_lukoil_backlash_58335_c0-247-5917-3698_s1200x700.jpg?b685a8bac77f7a98c8c8889d1900a887f5d590dd",
  "link": "https://www.washingtontimes.com/news/2022/mar/6/blinken-us-talks-allies-about-banning-russian-oil-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1402,
    2943,
    3375,
    4045,
    4466,
    1157,
    5287,
    5371
  ],
  "sentences": [
    "“I spoke to the president and the Cabinet — the leading members of the cabinet about this just yesterday from Europe, and we are now in very active discussions with our European partners about banning the import of Russian oil to our countries, while of course at the same time maintaining a steady global supply of oil,” Mr. Blinken said on NBC’s “Meet The Press.”\nMr. Blinken noted that sanctions the Biden administration has imposed on Russia for invading Ukraine have had a “devastating impact on the Russian economy.”\n“We’ve already had a major impact, but we’re looking — again, as we speak — in coordination with allies and partners at this prospect of banning oil imports,” he added.",
    "The legislation would “impose sanctions with respect to persons involved in the importation of such crude oil and petroleum products who have engaged in acts of corruption or who are responsible for serious human rights abuses, and for other purposes.”\nThe bill would issue a moratorium on importing oil from the Russian Federation until a thorough investigation is complete.",
    "Afterward, Mr. Markey wants to develop a strategy to replace oil imported from the Russian Federation with “domestic carbon-free energy sources and invest in renewable energy alternatives to replace foreign carbon-intensive energy imports.”",
    "But not if we just continue to say, ‘Well, we’re just going to keep doing what we’ve been doing’ and effectively reward Putin.”\nOther lawmakers in the upper chamber who support the Russian oil import ban include Sens.",
    "Joe Manchin III, West Virginia Democrat and chairman of the Senate Energy and Natural Resources Committee, and Lisa Murkowski, Alaska Republican and a senior member of that committee, introduced the legislation.",
    "“The United States cannot continue to purchase millions of barrels of oil while [Russian President Vladimir] Putin wages an unprovoked and unjustified war on Ukraine,” Mr. Durbin said.",
    "“The Ban Russian Energy Imports Act would declare a national emergency with respect to Russian aggression and immediately prohibit the import of Russian energy products.",
    "Sen. Ed Markey, Massachusetts Democrat, introduced legislation that would ban the importation of Russian petroleum products into the United States.",
    "Other lawmakers in the House who support a ban include Reps. Josh Gottheimer, New Jersey Democrat and Brian Fitzpatrick, Pennsylvania Republican.",
    "Jon Tester, Montana Democrat; John Hickenlooper, Colorado Democrat; Lindsey Graham, South Carolina Republican; and Rob Portman, Ohio Republican.",
    "Mr. Markey, a member of the Senate Foreign Relations Committee, introduced the Severing Putin’s Immense Gains from Oil Transfers (SPIGOT) Act.",
    "President Biden has been under pressure by lawmakers in both parties to prohibit Russian oil from being imported into the United States.",
    "A ban on the hundreds of thousands of barrels of Russian oil flowing daily into the U.S. would likely cause a backlash at the gas pump.",
    "Senate Majority Whip Richard J. Durbin, Illinois Democrat, announced Saturday that he would support a bill banning Russian oil imports.",
    "“We are importing Russian energy,” said Rep. Michael McCaul of Texas, the ranking Republican on the House Foreign Affairs Committee.",
    "House Speaker Nancy Pelosi, California Democrat, said last week at a press conference that she supports banning Russian oil imports.",
    "The U.S. is in talks with European allies about banning the import of Russian oil, Secretary of State Antony Blinken said Sunday.",
    "I don’t want U.S. dollars to be funding this carnage in Ukraine led by Putin,” Ms. Murkowski said of banning Russian oil.",
    "This bipartisan bill shows the U.S. Senate’s commitment to stand behind the brave Ukrainian people,” he added.",
    "However, lawmakers on both sides of the aisle are pushing the idea to crush Russia as it wages war on Ukraine.",
    "“We can help ameliorate the pressure on us, we can help ameliorate the pressure on our allies.",
    "Mr. Durbin said he would co-sponsor the Ban Russian Energy Imports Act.",
    "Both are leaders of the Problem Solvers Caucus.",
    "“I think that there is a moral obligation here.",
    "We are funding Putin’s war machine,” he said.",
    "Ban it,” Mrs. Pelosi said.",
    "“This needs to stop.",
    "“I’m all for that.",
    "Sens."
  ]
}