{
  "id": 4182,
  "mediaId": 2722,
  "date": "2022-03-04",
  "headline": "Paralympics GB boss lifts lid on 24 hours of turmoil at Beijing Winter Games",
  "image": "https://i2-prod.mirror.co.uk/incoming/article26382997.ece/ALTERNATES/s1200/0_Beijing-2022-Winter-Paralympics-Previews.jpg",
  "link": "https://www.mirror.co.uk/sport/other-sports/paralympics-gb-boss-lifts-lid-26382961",
  "mediaOutlet": "themirror",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Spink",
  "authorUrl": "https://www.mirror.co.uk/authors/alex-spink/",
  "termIds": [
    0
  ],
  "sentences": [
    "“But I’m comfortable none of those involved the British delegation.”\nHe went on to confirm that his curlers had been prepared to play Russia, saying “their position was that they are here to compete and their preference was to play all games regardless of the opposition.”\nSmith hopes that is no longer a concern and that once competition starts tomorrow [Sat] the focus will turn to Menna Fitzpatrick and Millie Knight, Britain’s visually-impaired alpine skiers who scooped all seven of the medals won by Britain in Pyeongchang four years ago.",
    "“There’s obviously a large amount of jeopardy around winter sport, but we’ve put ourselves in a really good place to go and hopefully do something special over the coming 10 days.”\nWheelchair curlers Gregor Ewan and Meggan Dawson-Farrell will be Great Britain's flagbearers at the opening ceremony before attempting to emulate the gold medal achievement of Eve Muirhead and her team a fortnight ago.",
    "“What’s going on there is abhorrent and we stand with our Ukrainian friends here and the wider Ukrainian community.”\nA rapidly changing situation may even now not have found its final resting place as Russia have lodged an appeal with the Court of Arbitration for Sport.",
    "Organisers had overturned their contentious decision to allow the two pariah nations to compete as “neutral” athletes and for the first time the roar of dissent had quietened enough for him to hear himself think.",
    "FIVE TO WATCH AT WINTER PARALYMPICS\nMenna Fitzpatrick (GB, alpine skiing)\nBritain’s most successful Winter Paralympian, having won four medals including the nation’s only gold in Pyeongchang last time round.",
    "Oksana Masters (USA, cross-country skiing and biathlon)\nA five-time Paralympian and 10-time Paralympic medalist, Masters has made the podium in four different sports across Summer and Winter Games.",
    "“We didn’t feel it was compatible with the values of the Paralympic movement for Russian or Belarusian athletes to compete given what horror we’re seeing unfold in Ukraine.",
    "But for now Smith is simply relieved the flame will be lit today and a Games that 24 hours ago appeared at risk of having to be abandoned, will get underway.",
    "Phil Smith had just heard Russia and Belarus were being kicked out of the Games, bringing an end to a turbulent 24 hours for the entire Paralympic movement.",
    "A self-taught engineer, he founded his own prosthetics company and has provided prosthetics for more than 100 people - including some of his competitors.",
    "Nor, he said, did his athletes have first hand knowledge of what IPC president Andrew Parsons termed a “very, very volatile environment” in the Village.",
    "Bronze in rowing at London 2012 was followed by biathlon and cross-country skiing medals before a switch back to summer for cycling in Tokyo.",
    "That could, in theory at least, force Britain to come face to face with Putin’s country in a wheelchair curling match scheduled for Sunday.",
    "Millie Knight (GB, alpine skiing)\nLike Fitzpatrick visually impaired and like her team mate a multi-medal winner at the 2018 Paralympics.",
    "Despite living with a degenerative eye condition since his teenage years he is unbeaten in Paralympic cross-country races since 2006.",
    "Britain’s youngest ever Winter Paralympian in Sochi, when just 15, she comes here fresh from winning super combined world gold.",
    "Mike Schultz (USA, snowboarding)\nWon snowboard cross gold on his Paralympic debut in 2018 as well as silver in banked slalom.",
    "High in the mountains outside Beijing the boss of Britain’s Winter Paralympics team paused and allowed himself a deep breath.",
    "Brian McKeever (CAN, Nordic skiing)\nFive Games, 17 medals qualifies this 42-year old for Winter paralympic legend status.",
    "The 23-year old from Macclesfield has lost her regular guide to Covid but has been “absolutely buzzing” in training.",
    "“It was starting to become a big distraction away from the Games,” Smith admitted with some understatement.",
    "It brings the International Paralympic Committee into line with where our position has been throughout.",
    "“Clearly there was an issue, there were situations,” said ParalympicsGB's chef de mission.",
    "He revealed that Britain was not one of the teams threatening to boycott.",
    "“Overall we’re really excited to see what this team can do,” he said.",
    "“We think it’s our most competitive team yet.",
    "Beijing is supposedly his final hurrah.",
    "“Clearly we welcome the decision."
  ]
}