{
  "id": 4196,
  "mediaId": 2747,
  "date": "2022-03-01",
  "headline": "QB Carousel: Which NFL teams will have different quarterbacks next season?",
  "image": "https://media.wfaa.com/assets/LOCKEDON/images/d0f1dd0b-d27c-4648-a55d-64424179dd36/d0f1dd0b-d27c-4648-a55d-64424179dd36_1140x641.jpg",
  "link": "https://www.wfaa.com/article/sports/locked-on/nfl-podcast/qb-carousel-which-nfl-teams-will-have-different-quarterbacks-next-season-aaron-rodgers-russell-wilson-carson-wentz-kirk-cousins-tom-brady/535-33f9771f-c5cc-47b2-9c50-8e142729a6f3",
  "mediaOutlet": "WFAA ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "On the Peacock and Williamson NFL Show, part of the Locked On Podcast Network, NFL analysts Brian Peacock and Matt Williamson cycled through every team with a potential question mark next to their QB situation and discussed what they think should or will or could happen with those teams and their QBs.",
    "I wonder if they’d be better off calling a team with cap space and giving Matt Ryan and a second for just a mid-round draft pick…I don’t think they’ll do that…But you can make the argument the franchise would be better served with Jordan Love or Mitch Trubisky than Matt Ryan.",
    "But then Seattle is saying why do we want Baker?...My prediction for the Browns is they stay put and cut Case Keenum and draft Drake London or something in the first round and then the second round they might try to trade up for Sam Howell or get Carson Strong at their spot.",
    "Peacock: There is some heat to this and this was a storyline this offseason and scrubbing of all Cardinals photos in his social media, I think he’s kind of gotten over that, maybe he was talking to buddies at the Pro Bowl when that happened and got some ideas.",
    "Mike McDaniel will probably live and die by Tua over there though.”\nWilliamson: “I think ownership wants that and that’s the answer.”\nThe Eagles are in a bit of a weird spot because they have Jalen Hurts and they also have THREE first round picks this year.",
    "Maybe they work a deal out where somehow they end up with Daniel Jones or Jordan Love or somebody like that and say, that’s probably our opening day starter but we’re also going to draft one in the first round…But I think they should trade Wilson.",
    "Peacock: Our colleague from Locked On Seahawks Corbin Smith did a podcast talking about what a trade offer should look like for Russell Wilson and what they would be looking for and it involves getting a good QB in return and staying good.",
    "I do think they would be really infatuated with a QB that can move and someone on their rookie deal because they haven’t had it here in so long…I like the Jameis Winston, Mitch Trubisky, Marcus Mariota way of doing things for them.",
    "I think it’s a little different than Jacksonville, Chicago where it’s a second year guy…But, speaking of Arizona, didn’t Kingsbury get hired to get Josh Rosen right and then convinced everyone to get Kyler Murray in the draft?",
    "Peacock: The question for the Eagles is would sticking with Jalen Hurts be plan A and see what you have with him…Or are you willing to trade all your first round picks and you’re in the Wilson, Rodgers, Watson market?",
    "I’ve got plan A being Russell Wilson, trying to talk Wilson and Ciara into coming to the big city New York, you make that deal and you’ve got pick five and seven in the draft, which could be enticing for the Seahawks.",
    "Williamson: I think it’s gotten to that point where you hope Mills turns into a Dak Prescott, Russell Wilson mid-round gift from the gods…Maybe you bring in a Ryan Fitzpatrick or Andy Dalton or someone like that.",
    "Williamson: I think you have that conversation within your walls and when you leave that meeting, you say that’s not really feasible for us…I think it’s Jameis Winston, maybe even Jameis and Matt Corral.",
    "Meanwhile, teams have one week before the deadline to designate franchise or transition tag players on March 8, and then on March 16, player contracts from 2021 expire and the free agency period begins.",
    "Last year, Wilson gave Seattle a list of four teams he'd be willing to be traded to, but Peacock and Williamson both say it's tough to see Seattle giving him up for what teams would be willing to give.",
    "I think Rodgers looks at the NFC, the division, the success he’s had and they figure out a way to keep him and extend him…But there’s still a domino if he stays because I think they trade Jordan Love.",
    "Kirk Cousins is heading into the final year of his contract with the Vikings and with a new head coach coming in, it's not completely 100% that Minnesota will roll with Cousins this upcoming season.",
    "The Raiders likely have their franchise guy in Derek Carr but in a world where the futures of Russell Wilson and Aaron Rodgers remain up in there, is there any sort of trade possibility?",
    "That’s all going to be decided by Aaron Rodgers in the coming weeks…If Plan A doesn’t happen, do you go to Jordan Love and go get the backup and have him battle it out with Drew Lock?",
    "FILE - Green Bay Packers quarterback Aaron Rodgers (12) throws a pass during the first half of an NFL football game against the Minnesota Vikings, on Nov. 21, 2021, in Minneapolis.",
    "Houston can absorb his salary…I’m not going to say it’s likely but I do think Watson getting traded in the next month or two is very likely and there’s not many landing spots.",
    "The only think that makes sense for the Raiders to change is if they’re able to swing a deal for like Russell Wilson and if that’s the case, the Seahawks will want Derek Carr.",
    "Well they need leaders and I’m not sure Kyler is an extreme leader at this point…You can see where there’s a little crack in the relationship…But Kyler’s going to stay home.",
    "Williamson: I’m not implying that Kyler isn’t a good leader, but he had Larry Fitzgerald the first two years there was always an older brother in that building with him.",
    "While there were midseason questions about Tua Tagovailoa with a rumored Deshaun Watson trade brewing, Peacock and Williamson believe that Tua will be their quarterback.",
    "He listed them in his group of four teams that he would want to go to last year, but Sean Payton is gone now and they have a rough situation with this salary cap now.",
    "Peacock: Get a stop gap quarterback like Marcus Mariota, if Jameis Winston is not available…With a draft pick like Pickett or Willis, maybe move around on draft day.",
    "The Niners are trying to trade away Jimmy G.\nWilliamson: The problem with Brady to the Niners is Tampa wants something for him if he leaves, you can't just get him.",
    "The Lions were very, very bad, but there were some bright spots with the offense toward the end of the year, namely Amon-Ra St. Brown's connection with Jared Goff.",
    "Williamson: A lot of these newly hired coaches, we assume got hired because they’re going to take the QB there and deal with it and work around him or improve him.",
    "That will likely lead them to start 2021 third overall pick Trey Lance next season...unless a certain 44-year-old retiree wants to come back for one last hurrah.",
    "If Aaron Rodgers and the Packers don't agree to come back together and he wants to go elsewhere, it opens the floodgates for the QB carousel around the league.",
    "I think Trubisky makes an awful lot of sense and those two have some similarities and you could see where that would be some competition, an insurance policy.",
    "Williamson: I think it’s Rodgers, which might not be an option, then Watson, then Cousins, because if Cousins plays elsewhere I think it’s Denver or Tampa.",
    "Obviously the conversation omits teams with stable current situations like Kansas City, Buffalo, both Los Angeles teams, Dallas, Cincinnati and Baltimore.",
    "Williamson: Option 1, which I don’t think will happen, is offering Seattle three to two firsts for Russell Wilson and we’re going to try to win the AFC.",
    "He tried to go to the 49ers a couple years ago after their Super Bowl run, they decided to stick with Garoppolo, which probably was the wrong decision.",
    "But it sounds like the Giants will go with a fallback option like Mitch Trubisky, who their new coach was just coaching as a backup there in Buffalo.",
    "Peacock: I have a feeling that Tom Brady is retired but that he wouldn’t mind playing one more year for his hometown team, the San Francisco 49ers.",
    "They brought in Carson Wentz but after the Colts failed to make the playoffs, there's some blame game going around that could result in a breakup.",
    "I think the Vikings would love for someone to call them about Cousins but I don’t think the Raiders are looking for anything except an upgrade.",
    "They’re in a similar situation with Seattle where if they don’t get better by moving him, they’ve got to start moving on from multiple people.",
    "Peacock: Option A and plan A is clearly Aaron Rodgers…Its hard to imagine Rodgers being anywhere other than Green Bay or Denver at this point.",
    "We have a cheap, maybe future starter in Davis Mills, this draft class isn’t amazing, we’re not going to spend anything on trading for a guy.",
    "Peacock: If you’re Washington, if you’re Ok with Jimmy Garoppolo and you have pick 11, you know there might be a quarterback there for you.",
    "Many continue to speculate on the future of Russell Wilson in Seattle after a rough season and the potential for change coming in Seattle.",
    "Both Peacock and Williamson said they find it hard for there to be a scenario where they don't stick with him at QB1 for another season.",
    "This was supposed to be the offseason that Baker Mayfield was supposed to get a big contract and he did not earn that this past season.",
    "Peacock and Williamson both say the Falcons should try to trade Matt Ryan, but the cap hit that he's making will be hard to deal away.",
    "So if you're a team out there without a current, stable franchise quarterback, there are a lot of decisions that have to be made soon.",
    "I think you have to stick it out there and just see how he looks on his fifth year option and then make a decision next offseason.",
    "The Texans weren't a bit of a weird mess last season but ended up giving the starting reigns to 2021 third-round pick Davis Mills.",
    "Peacock: Is plan A for the Bucs for Tom Brady to go film a movie and then come back and say just kidding I’m not retired anymore?",
    "Peacock: There is an ownership group here that is active and they want to win…Deshaun Watson, is that option A for the Panthers?",
    "You’re not going to get someone to win you 13 games a year again if you’re moving on from Aaron Rodgers, including Jordan Love.",
    "Getting a worse quarterback in return makes zero sense, so Russell Wilson, unless he forces his way out, is staying in Seattle.",
    "The Saints had Jameis Winston starting last season and then he tore his ACL and they went with Trevor Siemian and Taysom Hill.",
    "When Larry left, they went out and got AJ Green, JJ Watt, Rodney Hudson and we said why are they getting all these old dudes?",
    "Peacock: It sounds like the Giants are going to stick with Daniel Jones even though I believe they absolutely should not.",
    "Williamson: Rodgers is the biggest domino without question…When it’s all said and done I think Rodgers will be a Packer.",
    "Peacock suggested that the Falcons and Colts swap quarterbacks in some sort of trade, bringing Matt Ryan over to Indy.",
    "If you trade for Garoppolo today, that doesn’t mean you can’t use your first round pick on your favorite quarterback.",
    "NEW YORK — It's that time of year for the NFL when the season just ended but the front offices are ramping things up.",
    "Williamson: I think they’ll probably just kiss and make up with Wentz and run it back and try to win a bad division.",
    "Peacock: You can talk me into a Matt Ryan trade, in fact I would be trying to trade Matt Ryan if I was the Falcons.",
    "I would put money on the Lions drafting a QB between picks 2 and 32, whether they trade up from 32 or down from 2.",
    "The Cleveland Browns are in a similar spot that the Eagles are in where they could be a possibility for a trade.",
    "But they discuss about 20 teams' quarterback situations heading into March and speculate on what could happen.",
    "Unlikely to make a change, but not impossible\nThe Cardinals obviously are in a public tiff with their 2019 No.",
    "1 overall pick Kyler Murray, who is trying to get a new contract prior to the fourth year of his rookie deal.",
    "I feel like this is the perfect opportunity for the Panthers to fix their situation and go get a quarterback.",
    "But like the Steelers, Peacock and Williamson don't think they're going to tear it all down and rebuild yet.",
    "But, maybe plan A is they’re blown away by an offer from another franchise and then plan B is Kirk Cousins.",
    "Ultimately, Peacock and Williamson do agree it will be Lance with potentially a veteran backup brought in.",
    "Which teams are unlikely to have new quarterbacks and which teams will definitely have new quarterbacks?",
    "Williamson: The Lions might even be able to stay put at 32 and end up with Demond Ridder or Sam Howell.",
    "So a rookie QB plus a stop gap like Mariota, I think that is the most likely scenario for the Steelers.",
    "Chances are neither ends up hitting and you’re in this conversation again next year but you never know.",
    "The 49ers just went to the NFC Championship Game with Garoppolo and developed their young quarterback.",
    "None of the veteran quarterbacks are going to want to go there, you already have Jared Goff in house.",
    "There was plenty last offseason and with the hiring of Nathaniel Hackett, that stoked the fire more.",
    "It's hard for anyone to see exactly what could happen with the Colts' QB situation for next season.",
    "Or maybe the Packers are OK with trading Aaron Rodgers if he wants to go and they make that happen.",
    "Rodgers was named to The Associated Press 2021 NFL All-Pro Team, announced Friday, Jan. 14, 2022.",
    "Sam Darnold was pretty much a disaster for Carolina and they'll have a new quarterback next year.",
    "Of course there's been plenty of buzz about the potential for Aaron Rodgers to come to Denver.",
    "They're one of few teams that have attractive enough capital to make a big trade for a big QB.",
    "You don’t have a first round pick, you’re not going to be able to trade for a big time player.",
    "They have Baker Mayfield for one more year after he didn't earn a new contract last season.",
    "Peacock: I talked to our Locked On Texans hosts and I said hey what about Jimmy Garoppolo?",
    "Peacock and Williamson pitched that it could be the right destination for Deshaun Watson.",
    "Winston will be a free agent if they don't re-sign him, so what's going to happen here?",
    "New York is another team that could try to make a deal with Seattle for Russell Wilson.",
    "Williamson: Houston isn’t the worst place to send Sam Darnold if you can make a trade.",
    "Williamson: The Steelers are always going to try to win the Super Bowl to some degree.",
    "Williamson: The door’s always open Tom, he might go stir crazy I guess it’s possible.",
    "It's unlikely the Commanders are going to stick with Taylor Heinicke for much longer.",
    "I think the wild card is taking Malik Willis with one of their first round picks.",
    "This is expected to be an all-time offseason for quarterback movement in the NFL.",
    "Obviously the Steelers will have a new starter with Ben Roethlisberger retiring.",
    "The 49ers are getting rid of Jimmy Garoppolo and pretty much everyone knows it.",
    "So if it was an all-in guy, I think it’s likely Watson over Rodgers and Wilson.",
    "(AP Photo/Bruce Kluckhohn, File)\nOf course, this is the biggest domino to fall.",
    "With Tom Brady hanging them up, the Bucs will need a new starting quarterback.",
    "But they also just hired Brian Flores and Flores really wanted Deshaun Watson.",
    "Plan B, likely, is giving Hurts a big receiver and see another year with him.",
    "Peacock and Williamson agree that Pittsburgh isn't interested in a rebuild.",
    "They fall apart, they get a bunch of draft picks and they get better later.",
    "Detroit is in a rebuild, but would they draft a new starting QB this year?",
    "I think that’s the wrong plan, but I think that’s going to be their plan.",
    "Or do you start calling on Deshaun Watson, Kirk Cousins, Jimmy Garoppolo?",
    "Peacock: I think Derek Carr is their plan, I have him penciled in there.",
    "By the time the Falcons are good, Matt Ryan is going to be gone anyway.",
    "If you give away Carson Wentz, who takes him and how do you get better?",
    "Williamson: I think plan A is Wilson and I don’t think it will happen.",
    "Williamson: I do think the Vikings and Raiders situations are similar.",
    "But, if (Jim Irsay) doesn’t like Wentz, then Wentz isn’t coming back.",
    "Plan B should be Matt Ryan, plan A should be to see what we can get.",
    "The likelihood is low, but New York is always a destination market.",
    "I think it’s a Kirk Cousins or Carson Wentz possibility in Tampa.",
    "I can’t see them saying Kyle Trask or Blaine Gabbert is the guy.",
    "I can’t see anything good about where the Falcons are right now.",
    "Garoppolo, plus Willis, that might be a good situation for you.",
    "I don’t know which is the better team but they’re both average.",
    "I think Jordan Love ends up in Atlanta or something like that.",
    "Is there any chance Murray isn't Arizona's starter in 2022?",
    "This team is not going anywhere as currently constructed.",
    "Peacock: I’ve got them in the Russell Wilson sweepstakes.",
    "I’m not going to put it past the Saints to figure it out.",
    "The Seahawks don’t get better by trading Russell Wilson.",
    "And they scoffed at it, saying Davis Mills is the guy.",
    "But, then heads were more level the following week.",
    "But there’s no fall back, there’s no plan C to me.",
    "Peacock: Plan A is likely still just Kirk Cousins.",
    "Peacock: If you’re the Lions, you go to the draft.",
    "You could have the same plan if you’re Washington.",
    "I can’t come up with a better one than Carolina.",
    "He grew up in the shadow of of Candlestick Park.",
    "I think it’ll remain the same with Kirk Cousins.",
    "But it's up in the air whether that will happen.",
    "The NFL Scouting Combine takes place this week.",
    "Peacock: Do we keep Aaron Rodgers in Green Bay?",
    "Peacock: “They’re all in at Tua it feels like.",
    "I think it will be Rodgers, Watson or Cousins.",
    "Williamson: I agree with everything you said.",
    "Peacock: What do you do with Baker Mayfield?",
    "Peacock: What can you do with Carson Wentz?",
    "Adding a $30-$40 million QB might be tough.",
    "What moves could they make this offseason?",
    "But, what happens when Rodgers stays home?",
    "Do they revisit the Deshaun Watson stuff?",
    "I’d rather be GM of the Texans or Jags.",
    "So that leaves with them with pick 32.",
    "Are you swapping Wentz for Garoppolo?",
    "That doesn’t seem worth doing really.",
    "They don’t want draft picks for Carr.",
    "And you’re not drafting one at No.",
    "I think they’re really in a bind.",
    "So you’re drafting a quarterback.",
    "Bring the Clemson kid back home.",
    "It seems like the logical move.",
    "Is that plan A for the Eagles?",
    "Williamson: I tend to agree.",
    "That doesn’t exist for you.",
    "Williamson: Totally agree.",
    "But how likely is that?",
    "We break it all down.",
    "Williamson: I agree.",
    "Is it that easy?",
    "Is that plan A?",
    "2 most likely.",
    "New coach.",
    "That’s it.",
    "New coach."
  ]
}