{
  "id": 4197,
  "mediaId": 2586,
  "date": "2022-03-02",
  "headline": "Bills Could Look to Trade for Pro Bowl RB This Offseason: Insider",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Saquon-Barkley-e1646265221947.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-target-saquon-barkley-offseason/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "@JordanRaanan has more: https://t.co/wRf63UWwNR pic.twitter.com/ant83Qvi0n\nIt’s not clear what price Barkley could fetch, and Lyons added that Giants running back has missed 21 games over the last three seasons, and faltered last season with just 593 rushing yards and 263 receiving yards in 13 games.",
    "The Bills aren’t expected to make many big moves in free agency, but ESPN’s Mike Tannenbaum suggested that they could look to trade for New York Giants running back Saquon Barkley, who has been hampered by injuries could be a cap casualty for a team looking to shed salary this offseason.",
    "While there are some maneuvers Beane can make to give them some breathing room — including restructuring the contract of receiver Cole Beasley or releasing some veteran players — he has warned that there will not be much room for big free-agent acquisitions.",
    "pic.twitter.com/sD7crWCUGl\n— Get Up (@GetUpESPN) March 2, 2022\nBills general manager Brandon Beane has said that the team needs to add more speed in the offseason, targeting players who give a boost to the passing game by racking up yards after the catch.",
    "Bills Could Add Barkley\nAppearing in “Get Up” on ESPN, Tannenbaum said that if the Giants do end up parting ways with Barkley, the Bills could be one of the most logical landing spots.",
    "“They’re sort of in the ‘one player away’ mode,” he said, noting that Barkley is a difference-making running back who can do damage in both the running and passing games.",
    "As SI.com’s Dan Lyons noted, the Giants are projected to be $12 million over the cap in 2022, and new general manager Joe Schoen made it clear that he’s open to anything.",
    "The 25-year-old Barkley has not been able to match the numbers from his breakout rookie season, but Tannenbaum said he could still be the perfect addition for Buffalo.",
    "“You can never have enough of that.”\nBut Beane has also warned that the Bills are likely out of making any big moves this offseason due to their tight cap space.",
    "The Buffalo Bills could make a splash this offseason by targeting a former Pro Bowl running back in need of a fresh start, an insider is predicting.",
    "I mean, you’d love to have a guy … that you can get the ball to and he can turn a 5-yard pass into a 60-yard touchdown,” Beane said, via ESPN.",
    "If it’s trading a couple players—I’m not going to say the entire roster, [that] we’re open for business on the entire roster.",
    "I’m certainly going to listen.”\nThe New York Giants are willing to entertain calls for RB Saquon Barkley, says GM Joe Schoen.",
    "That was particularly evident to Beane after the Bills lost to the speedy Chiefs in two straight playoffs.",
    "Barkley Could Be on the Move\nWhether the Bills target Barkley or not, it appears the former No.",
    "“We’re still working through that, but I’m open to everything,” Schoen said, via ESPN.",
    "Now you can go compete with Cincinnati, you can go compete with Kansas City.”\n.",
    "But if anyone is going to call and they’re interested in any of our players.",
    "\"Could you imagine Josh Allen, a healthy Saquon Barkley, and Stefon Diggs?\"",
    "Could you imagine Josh Allen, a healthy Saquon Barkley, and Stefon Diggs?",
    "“Like whether it’s trading player for player; I’ll listen to anybody.",
    "@RealTannenbaum wants to see Saquon Barkley play for the Bills ??",
    "2 overall pick could be on the move this offseason.",
    "The latest Bills news straight to your inbox!",
    "“To me, he makes all the sense in the world.",
    "“We mentioned [Chiefs receiver] Tyreek Hill.",
    "Join the Heavy on Bills newsletter here!"
  ]
}