{
  "id": 4235,
  "mediaId": 2877,
  "date": "2022-03-02",
  "headline": "Tlaib and Reynolds Hit Biden’s Many Failures",
  "image": "https://img.patriotpost.us/01FX5PCEWBGNB1XXAYJ3QYBK36.jpeg?w=1200&h=600",
  "link": "https://patriotpost.us/articles/86614-tlaib-and-reynolds-hit-bidens-many-failures-2022-03-02",
  "mediaOutlet": "patriot post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Tlaib, the two-term Detroit congresswoman and the oldest of 14 children, was profoundly moved on the night of November 6, 2018, when she became the first Palestinian-American woman elected to Congress — so much so that she tenderly told her young son, “We’re gonna impeach the motherf**ker.”\nShe began her “friendly” 15-minute rebuttal to Biden by telling us that she grew up in “the most beautiful, blackest city in the country, the city of Detroit.” We’re not sure what to make of this bizarre attempt to suck up to her mostly black constituents, but the Motor City was a drug-addled, murder-ravaged hellhole when Tlaib was growing up in the 1980s.",
    "Tlaib lamented the sad fact that she and her fellow wingnuts had yet to abolish the filibuster, ram through the Green New Deal, and codify abortion on demand with a constitutional amendment, and she blamed these progressive failures on two dark forces: “a Republican Party that serves only the rich and the powerful, and just enough corporate-backed Democrat obstructionists to help them succeed.”\nApparently, no one has informed the congresswoman that her Democrat Party is the party of the rich and the privileged and the all-powerful.",
    "“Americans,” Reynolds said, “are tired of a political class trying to remake this country into a place where an elite few tell everyone else what they can and cannot say, what they can and cannot believe.”\nWe’re not sure how many folks managed to stay awake through Joe Biden’s disjointed train wreck of a speech, but those who stayed tuned and saw Kim Reynolds speak got a glimpse of good, effective Republican governance — and maybe even a glimpse of the future.",
    "And they certainly won’t tell you that we should be giving billions in tax giveaways to millionaires and billionaires in Democratic controlled states like California, New York, and New Jersey.”\nNear as we can tell, Reynolds’s only misstep was a homer’s plug for biofuels, which are a woefully inefficient fuel source.",
    "Which brings us to Governor Reynolds, who took on the always-challenging task of following up a State of the Union address — and did it superbly, especially with respect to the kitchen-table issues that most matter to the American people.",
    "Were this a normal year, and were Biden a normal president, the standard response from a representative of the out-of-power party — in this case Iowa Republican Governor Kim Reynolds — would’ve been the end of it.",
    "Reynolds fits the mold of a rebuttal speaker: As Iowa’s first female governor, she’s a rising star in an influential state, and she’s seen as a possible running mate for Donald Trump should he seek another term.",
    "… On the economy, the contrast couldn’t be more stark: While Democrats in DC are spending trillions, sending inflation soaring, Republican leaders around the country are balancing budgets and cutting taxes.",
    "And Representatives Josh Gottheimer and Brian Fitzpatrick, the co-chairs of the House Problem Solvers Caucus, offered up a “Problem Solvers Perspective” from the bipartisan group No Labels.",
    "And finally, not willing to cede all the fun to angry leftists and squishy centrists, Georgia Congresswoman Marjorie Taylor Greene spoke up for the Trumpian group Women for America First.",
    "Perhaps the strongest indication of the weakness of Joe Biden is the sheer number of Democrats who, last night, tripped over themselves to rebut his very existence.",
    "As if Joe Biden hasn’t been “progressive” enough, hard-left Squadster Rashida Tlaib gave us the perspective of a group called The Working Families Party.",
    "For example:\nThe president and Democrats in Congress have spent the last year either ignoring the issues facing Americans or making them worse.",
    "Of the Democrats, she said: “They won’t tell you that spending trillions more and bankrupting their children is the answer to their problems.",
    "… And it shouldn’t come as a surprise that of the top 20 states that have the lowest unemployment rates, 17 are governed by Republicans.",
    "“Imagine,” said Tlaib, “turning the Rust Belt into a Green Belt that is a center of American jobs and innovation for the next century.",
    "Because I know we can’t build back better if our children can’t live healthy lives.”\nYep, just imagine.",
    "Just ask Mark Zuckerberg, Jeff Bezos, Jack Dorsey, LeBron James, Nancy Pelosi, or Hunter Biden.",
    "And Texas Congressman Colin Allred spoke up on behalf of the Congressional Black Caucus.",
    "Lashing out is what people do when their career dissipation light starts a-flickering.",
    "They won’t tell you that we should be paying people not to work.",
    "Ah, the cascading failures of Joe Biden.",
    "And we’d ensure clean air and water.",
    "We can’t blame them, though.",
    "But no."
  ]
}