{
  "id": 4246,
  "mediaId": 3992,
  "date": "2022-03-05",
  "headline": "Winter Paralympics: Neil Simpson and brother Andrew win super-G gold in Beijing",
  "image": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/10898/production/_123563776_gettyimages-1381073620.jpg",
  "link": "https://www.bbc.com/sport/winter-sports/60636157?at_medium=RSS&at_campaign=KARANGA",
  "mediaOutlet": "BBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Hudson",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Fitzpatrick has had a challenging build-up to the Games, recovering from a broken leg in March 2020, while her new guide Katie Guest - who took over the role when Jen Kehoe retired to focus on her Army duties -- was ruled out of the Games by a positive Covid test prior to her scheduled departure.",
    "And in the snowboard cross qualification, James Barnes-Miller was ninth-fastest in the men's upper limb division, where the top four qualifiers were all Chinese athletes, and he will go in Monday's finals (from 03:00).",
    "The 19-year-old Scot, guided by brother Andrew, 21, became GB's third-ever Winter Games gold medallist and the first male to achieve the feat after successes for Kelly Gallagher in 2014 and Menna Fitzpatrick in 2018.",
    "The British skiers will be in action again in Monday's super combined, which has been brought forward by a day because of high temperatures and the risk of snow melting at the Yanqing National Alpine Skiing Centre.",
    "Meanwhile, at the Zhangjiakou National Biathlon Centre, Scott Meenagh narrowly missed out on a second top-10 finish in consecutive races, when he was 12th in the men's cross-country long-distance seated event.",
    "Fitzpatrick's silver success\nEarlier, Fitzpatrick, 23, said she was \"proud\" as she won the fifth Paralympic medal of her career, cementing her place as the nation's most successful Winter Paralympian.",
    "Great Britain's Neil Simpson said it was \"almost indescribable\" after he put in the performance of his life to clinch Paralympic gold in the men's visually-impaired super-G skiing event in Beijing.",
    "And after first Austria's Johannes Aigner, the downhill champion, and then Bertagnolli had set good times to sit at the top of the standings, the pressure was on the brothers.",
    "\"Growing up together, it just makes this moment really special,\" added Neil, who born with nystagmus, a condition that causes involuntary eye movements.",
    "Owen Pick and Ollie Hill are also through in the men's LL2 (lower limb) event but Andy Macleod missed out, finishing just out of the top 16 in 17th.",
    "Although they dropped to second at the next checkpoint, they finished strongly to take the lead and the remaining skiers were unable to challenge.",
    "It meant she was guided by Smith, who she had worked with in the 2019-20 season, and the pair were a solid fifth in the downhill on Saturday.",
    "Elsewhere, Shona Brownlee marked her Paralympic debut with sixth in the women's seated event with James Whitley 19th in the men's standing.",
    "You are able to be very clear and concise in what you want - even direct and blunt sometimes, so you can get feedback across a lot easier.",
    "The Simpson brothers, from Banchory, are making their Paralympic debuts, and had finished seventh in Saturday's opening downhill.",
    "It was the second medal of the day for Britain after Fitzpatrick and her guide Gary Smith took silver in the women's race.",
    "The brothers have been skiing together since childhood and made their international debut together in the 2019-20 season.",
    "\"We put it all down on the line and really went for it and I'm just very happy with the performance - it felt good.",
    "\"To be here at all is a great achievement, but then to stand up on that podium is absolutely amazing,\" she said.",
    "The siblings finished 0.40 seconds clear of Italy's Giacomo Bertagnolli and his guide Andrea Ravelli.",
    "I wasn't thinking about it being a winning performance, I was just thinking that it was a good run.",
    "\"We went in with a clear game plan and it worked out pretty well,\" said the delighted teenager.",
    "\"We went out to ski well and build on the day before and we are super, super happy.\"",
    "Downhill bronze medallist Millie Knight was fourth, just 0.09secs off third.",
    "But they started their run well and were fastest at the second intermediate.",
    "We grew up together so we know what each other is thinking anyway.\"",
    "\"You don't have to beat around the bush, so that definitely helps.",
    "\"Initially when we came down, there was a bit of an anxious wait.",
    "\"I could tell it was quick but I didn't know how special it was.",
    "I'm just really thrilled, it's not really sunk in yet.",
    "\"For me, it definitely helps having Andrew with me.",
    "It's such a high - it's almost indescribable.\"",
    "\"I'm so proud of what we've achieved together.",
    "\"Andrew was shouting and screaming.",
    "I said, 'Yeah, maybe a podium'.",
    "It's just that wait."
  ]
}