{
  "id": 4266,
  "mediaId": 5296,
  "date": "2022-03-02",
  "headline": "Nursing Home Resident Defeats COVID for the Second Time",
  "image": "https://www.thepostemail.com/wp-content/uploads/2017/11/Alabama-in-US.png",
  "link": "https://www.thepostemail.com/2022/03/02/nursing-home-resident-defeats-covid-for-the-second-time/",
  "mediaOutlet": "thepostemail.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2269,
    2576,
    200
  ],
  "sentences": [
    "This writer has been acquainted with the nursing home resident, Mrs. Norma Whiting, for more than a decade dating back to when she and her husband were closely following cases relating to CDR Walter Francis Fitzpatrick, III (Ret), who challenged the state’s grand jury system and spent more than three years in state prison.",
    "Her eye doctor, who has his office outside the nursing home and who she expects to visit in the near future, has a sign on his door which reads, “Fauci face diapers not required,” Mrs. Whiting told us, which refers to NAIAD Director Dr. Anthony Fauci, who has throughout the pandemic issued a number of conflicting dictates.",
    "When we asked if she felt the facility had adhered to its pledge to restore normal activities following her quarantine period, she said, “Basically, yes.”\nMrs. Whiting opposes mask “mandates” and told us in a September 2020 interview that the pandemic was taking its toll on patients and staff alike.",
    "When we asked if she experienced any symptoms of illness this time, she said, “Not a bit.”\nFor our February 9 article, spokesman Joe Perkins informed us that vaccination status plays no role in whether or not a resident may participate in outings or in-house activities.",
    "2, 2022) — On February 9, The Post & Email reported the difficult circumstances nursing homes have been facing in light of the declared COVID-19 “pandemic” from the viewpoints of a resident and a spokesman for the resident’s healthcare organization.",
    "Despite the waning of the Omicron variant since its peak in January, the CDC is now recommending respirators for children age 2 and up, which a group of industrial hygienists claim is contrary to science and endangers children’s health.",
    "The same day, the Centers for Disease Control and Prevention (CDC) issued updated recommendations for mask-wearing depending on the transmission level of COVID-19 in any given area with a search tool by individual county.",
    "At the time Perkins was optimistic that if Mrs. Whiting showed no symptoms for ten days or recovered from any symptoms she might have within that time frame, she would be able to resume all customary activities.",
    "In an interview on February 25, Mrs. Whiting confirmed her release from the COVID wing and that she had been permitted to shower and visit the hairdresser as had been planned before her exposure to the virus.",
    "Happily, Mrs. Whiting’s son informed us last week that his mother did not become ill this time, either, and was moved back to her customary room with full facility privileges restored the same day.",
    "Shortly before our last article went to press, Mrs. Whiting informed us she had received a “positive” coronavirus test after her roommate tested “positive” several days earlier.",
    "For the last 2+ years, Mrs. Whiting has resided at the Lineville Health and Rehabilitation, LLC facility, whose parent company is Northport Health Services.",
    "In late 2020, Mrs. Whiting was told she tested “positive” and subsequently told us that her only symptom was a loss of taste and smell for a few weeks.",
    "In a follow-up conversation Saturday, Mrs. Whiting told us several family members planned to take her out to lunch for her birthday, which was Monday.",
    "Consequently, both women were sent to the “COVID wing” of the facility for the mandatory ten-day quarantine period.",
    "Rather, any restrictions arise from potential exposure to the coronavirus or a “positive” test result, he said.",
    "Mr. Whiting told us he believes his mother is receiving very good care at Lineville.",
    "by Sharon Rondeau\n(Mar."
  ]
}