{
  "id": 4294,
  "mediaId": 2668,
  "date": "2022-03-04",
  "headline": "Are Financial Institutions Using ESG Social Credit Scores to Coerce Individuals and Small Businesses?",
  "image": "https://media.townhall.com/townhall/reu/o/2018/85/cfbb67f7-7ddb-456e-ae99-f12d78f07f77-1110x740.jpg",
  "link": "https://redstate.com/heartlandinstitute/2022/03/04/are-financial-institutions-using-esg-social-credit-scores-to-coerce-individuals-and-small-businesses-n530993",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Heartland Institute",
  "authorUrl": "https://redstate.com/author/heartlandinstitute",
  "termIds": [
    2201,
    355,
    604,
    1046
  ],
  "sentences": [
    "Moody’s algorithm predicts scores by using “company size, location, and industry as inputs.”\nWhen individuals and small businesses have raised concerns about the use of ESG and how it could be used against them— as opposed to merely being applied to corporations for the benefit of investors — banks, investment groups, and their lobbyists have claimed that concerns over ESG are nothing but “conspiracy theories.”\nHowever, the evidence shows that there are very good reasons to believe that financial institutions and banks plan to dramatically expand the use of ESG soon for individuals, families, and small businesses, a move that would dramatically change the U.S. economy and society.",
    "The Heritage Foundation noted in a 2021 report that “PayPal has admitted to closing accounts flagged by the Southern Poverty Law Center in 2019, now, PayPal has announced a partnership with the left-leaning Anti-Defamation League to focus on ‘further uncovering and disrupting the financial pipelines that support extremist and hate movements.’”\nIn 2019, the New York Post reported that J.P. Morgan Chase closed bank accounts associated with several political activists and commentators, including Enrique Tarrio, Joe Biggs, Laura Loomer, and Martina Markota — all within weeks of each other.",
    "In November 2021, WePay, a J.P. Morgan Chase-owned payment processor, informed the Missouri-based Defense of Liberty political action committee that it would stop offering its services to the organization after it planned an event featuring Donald Trump Jr. (Chase later reversed the decision, but only after “Missouri treasurer Scott Fitzpatrick threatened to have the state stop doing business with the bank.”)\nIn 2020, Wells Fargo suspiciously closed a bank account belonging to Lauren Witzke, a 2020 Republican candidate for the Delaware Senate.",
    "They are also freezing out businesses that sell high-capacity magazines and ‘bump stocks,’ attachments that enable semiautomatic rifles to fire faster, even though such products are legal under federal law.”\nCredit Agencies Have Started to Alter Businesses’ Credit Ratings Based on ESG Scores\nAs noted in a 2021 sweeping report by Fitch Ratings — one of the “big three credit rating agencies” (along with Moody’s and S&P) — corporate credit rating agents already take ESG scores into account.",
    "One example would be the inclusion of property energy ratings data in mortgage valuation and decisioning, and CO2 emission data for small businesses.”\nHe also noted, “Over the longer term, we expect that ESG and climate risk evaluations will become an integral element of credit risk and affordability assessments.”\nThis is a clear admission that ESG will likely soon be applied to individual and small business credit scores and/or other considerations, such as mortgage applications.",
    "In an article published in December 2021 on FICO’s website titled “Lending Predictions 2022: From BNPL to ESG (and More),” a FICO senior principal consultant wrote that he believes in 2022 “The ESG Agenda Will Drive the Search for Cleaner Decisions.”\n“In financial institutions, much of the ESG agenda is delivered at the corporate level,” the analyst wrote, “but in 2022 we expect to see an increased focus on bringing ESG data into more granular lending and investment decisions.",
    "There Are Already Many Examples of Individuals and Businesses Being Denied Access to Financial Services or Capital Based on Subjective Criteria\nIt’s impossible to know to what extent individuals, organizations, and businesses are now being denied access to financial services, including loans, based on subjective criteria because there are no databases nor reporting agencies tasked with compiling denials based on non-financial reasons.",
    "Banks Have Promised to Use ESG to Fight Climate Change Throughout All of Their Portfolios and Business Activities\nThe largest and most influential banks and financial institutions in the United States, much of Europe, and Canada have openly said that they will use their tremendous amount of wealth to force the global economy to move to net-zero by at least 2050, and to halve CO2 emissions by 2030.",
    "This will be done in a variety of ways, including by “accelerating decarbonization in the real economy by describing financial sector expectations of transition plans from the companies the sector engages with and finances.”\nOne of the largest groups of banks and financial institutions promising to make such an extreme acceleration is the Glasgow Alliance for Net Zero (GFANZ).",
    "Instead of looking at economic and financial considerations, ESG social credit metrics measure things like “Percentage of active workforce covered under collective bargaining agreements” (union labor) and “Percentage of employees per employee category, by age group, gender and other indicators of diversity (e.g.",
    "The widespread adoption of ESG metrics, which is also commonly called “stakeholder capitalism” — is meant to radically alter how businesses are evaluated, expanding considerations beyond traditional economic metrics like profit, revenue, debt, customer satisfaction, and product development.",
    "Of course, Fink attempts to put a happy face on ESG and stakeholder capitalism throughout his letter, but even he can’t help himself when discussing climate change, making it clear that companies must choose between being leaders or being dragged into a net-zero economy against their will.",
    "According to a report by the New York Times, “They are restricting their credit card and banking services to gun retailers and halting lending to gun makers that do not comply with age limits and background check rules determined by the banks.",
    "Large Investment Management Firms and Banks Are Using ESG to Coerce Corporations\nThe primary stated purpose of ESG is to change corporations, especially the largest and most powerful ones, in order to produce more extensive societal impacts.",
    "If you’re looking for specific examples of this, however, a good place to start is Larry Fink’s 2022 “Letter to CEOs,” in which Fink sings the praises of “stakeholder capitalism” and promises to use ESG scores as a way to alter society.",
    "Environmental, social, and governance (ESG) metrics (discussed previously here) are a kind of social credit system designed to coerce businesses — and, by extension, individuals and all of society — to transform their practices.",
    "There are already “over 450 financial firms across 45 countries responsible for assets of over $130 trillion” in GFANZ, including numerous large U.S. banks, such as Bank of America, J.P. Morgan Chase, and Wells Fargo & Company.",
    "For example, Deutsche Bank AG and Signature Bank announced in early 2021 that they would no longer provide services to former President Donald Trump or his business, the Trump Organization, purely for ideological reasons.",
    "Justin Haskins is the director of the Socialism Research Center at The Heartland Institute and the co-author of the New York Times bestselling book The Great Reset: Joe Biden and the Rise of Twenty-First Century Fascism.",
    "Through a carrot-and-stick approach, investors and banks (and soon governments) use ESG to push businesses to change how they function, regardless of what the employees and customers of those businesses want.",
    "For instance, Merrill Lynch, a division of Bank of America, produces ESG scores for all or nearly all of its individual investment accounts, even for those whose value is $1,000 or less.",
    "There simply is no way for banks to keep their promises related to a transition to net-zero without imposing ESG metrics or other, similar criteria on individuals and small businesses.",
    "Analysts Predict Individual Credit Scores Could Soon Have an ESG Component\nPerhaps the most widely used service to check the creditworthiness of individuals and small business is FICO.",
    "Unlike many corporations, which spend substantial time and resources self-reporting ESG, individual investors and most small businesses typically do not produce their own ESG reports.",
    "Fink is the head of Blackrock, the world’s largest asset management company, and is widely considered one of the most powerful people on Wall Street, if not the most powerful person.",
    "In many cases, however, corporate executives are all too willing to go along, because they want access to the cheap capital offered by investors and financial institutions.",
    "If the largest agencies are willing to use ESG to alter corporate credit scores, why wouldn’t credit agencies and banks do the same for individuals and small businesses?",
    "Accounting firm KPMG reports thousands of companies in dozens of countries have ESG systems in place, including 82 percent of large companies in the United States.",
    "If investors and banks are willing to utilize ESG to control corporations, why wouldn’t they use ESG to manipulate individual and small business behavior as well?",
    "Moody’s has created an “ESG Score Predictor” that offers users with ESG reports for 100,000 businesses, many of which have never produced their own ESG metrics.",
    "Instead, large financial services companies and banks have produced them for these groups, often without individuals or businesses asking for the reports.",
    "ethnicity).”\n(To learn more about the basics of ESG, read my ESG primer here, or watch my recorded presentation for The Heartland Institute here.)",
    "And according to Fitch and others, the use of ESG to alter credit ratings will almost certainly expand in the months and years to come.",
    "Everyone who understands ESG, regardless of whether they support it or not, agrees that it’s being used to alter corporate activities.",
    "(The opinions expressed in guest op-eds are those of the writer and do not necessarily represent the views of RedState.com.)",
    "In 2018, some large U.S. banks, including Citibank, rolled out restrictions for gun manufacturers and retailers.",
    "“The question is, will you lead, or will you be led?”\nThe threats from Fink and others have largely worked.",
    "“Every company and every industry will be transformed by the transition to a net zero world,” Fink wrote.",
    "According to the Post, the activists said they were not given clear explanations for the cancellations.",
    "When banks and credit unions examine applications for loans, FICO is often the first place they turn.",
    "This will require increased innovation in the use of alternative data across all kinds of lending.",
    "His opinions in this article do not reflect the views of The Heartland Institute.",
    "Below are the five most important reasons for all Americans to be concerned.",
    "However, news outlets have reported many examples of such actions.",
    "(And this data is now a couple of years old.)",
    "This point is not in dispute."
  ]
}