{
  "id": 4356,
  "mediaId": 2722,
  "date": "2022-03-02",
  "headline": "Britain's star Winter Paralympian loses guide to Covid on eve of Beijing Games",
  "image": "https://i2-prod.mirror.co.uk/incoming/article12208494.ece/ALTERNATES/s1200/2018-Paralympic-Winter-Games-Day-9.jpg",
  "link": "https://www.mirror.co.uk/sport/other-sports/britains-star-winter-paralympian-loses-26364163",
  "mediaOutlet": "themirror",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Spink",
  "authorUrl": "https://www.mirror.co.uk/authors/alex-spink/",
  "termIds": [
    0
  ],
  "sentences": [
    "Therefore my Paralympic dream is over for this year.”\nFitzpatrick has switched guides to Gary Smith, a serving member of the Royal Air Force, and early evidence suggests the pair have made an instant connection on the slopes outside Beijing.",
    "The Macclesfield-born 23-year old is visually impaired with only five per cent vision and has skied with guide Katie Guest since last year when they they won the world title in Norway.",
    "But having packed her bags for China, Guest revealed that two weeks after catching coronavirus her cycle threshold (Ct) have not met the requirements of the organisers.",
    "“Today was our second Downhill training run and we are absolutely buzzing with how we skied,” said Menna, who starts her campaign with the Downhill on Saturday.",
    "Alpine skier Menna Fitzpatrick won four medals at her debut Games in Pyeongchang in 2018, including the nation’s only gold.",
    "Great Britain’s most successful Winter Paralympian has lost her guide to Covid on the eve of the Beijing Games.",
    "“Having had my bags packed for over 3 weeks I’m sad to say they will not make it out the front door.",
    "“A few things to tidy up but bring on one more training day before the real fun begins!”",
    "“Some blows hit harder than others, and this one hurt,” she wrote on Instagram.",
    "my Ct values were not high enough to enter China.",
    "“After 2 weeks from catching COVID."
  ]
}