{
  "id": 4383,
  "mediaId": 2713,
  "date": "2022-03-01",
  "headline": "The two new books you should read to help understand Russia’s mindset",
  "image": "https://static.ffx.io/images/$zoom_0.2772136036832914%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_142%2C$y_350/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/c3fa7ba206650a3de4b06e742c242127228c494d",
  "link": "https://www.smh.com.au/culture/books/the-two-new-books-you-should-read-to-help-understand-russia-s-mindset-20220228-p5a09i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kurt Johnson",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Through these three acts democracy emerges a flawed hero and her villains (democracy is always a woman) a diabolical cast of kings, despots, emperors, orators and populists, whose headwear changes with time and place but whose goal remains the same: confound and flatter the masses and grab power.",
    "The Ukraine conflict has led both sides to argue their version – with Ukraine fixated on the terrible famine of the 1930s as well as invoking once marginal characters such as Nestor Makhno, who fought for an independent Ukraine against the Red and the White armies.",
    "Keane does not coddle the reader as to the magnitude of present threats – climate change, misinformation, societal fragmentation and wealth inequality within a system claiming equality of voice while populist despots peddle easy solutions to weary populations.",
    "First, Sheila Fitzpatrick’s The Shortest History of the Soviet Union is an opportunity for the world-renowned Australian Sovietologist to present history with greater nuance than the lingering Cold War version of the Black Marias, bread lines and gulags.",
    "Share\nNormal text sizeLarger text sizeVery large text size\nIn a recent article, Yuval Noah Harari, author of Sapiens, claims that armed conflict between Russia and Ukraine is a rebuke to humanity’s greatest claim: that progress is possible.",
    "One wonders whether Fitzpatrick is genuinely reducing its role in Soviet society, hidden as it was through secrecy and remoteness, or if she is relying on the canon and the explosive research conducted during glasnost to fill the blanks.",
    "What remains today is nostalgia for social bonds eviscerated by commercialism, memories of respect afforded to a superpower and the chaotic collapse together with a dictator who operates with the zero-sum logic of a Cold Warrior.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "The former Soviet neighbours, together with China and Hong Kong or China and Taiwan, reveal that the contest between power and progress continues and is bound by ideological roots.",
    "Most relevant now is unpicking what the Soviet collapse actually meant – which was not, as we were told at the time, the happy adoption of liberal democracy and the free market.",
    "The Shortest History of the Soviet Union by Sheila Fitzpatrick and The Shortest History of Democracy by John Keane.Credit:\nFitzpatrick explains just what a handicap it had been.",
    "Yet the defining trait of “monitory democracy” promises unacknowledged resilience – all the noise of opposition, institutions representing the margins is a feature, not a bug.",
    "When the sun eventually set on Lenin’s Soviet Union, liberal democracy did not emerge in place of communism.Credit:Michael Probst\nThe shift is also a mellowing with age.",
    "They had to rapidly industrialise, which was achieved at immense human cost, but then, when utopia did not materialise, the country began its long, slow decline.",
    "Keane terms this “monitory democracy”, in which a multiplicity of competing and conflicting localities, races, sexes, ethnicities and languages all participate.",
    "City-states were home to the most coherent and rigorous version of assembly democracy, albeit only consisting of men and on the back of a slave subcaste.",
    "While the terrible human cost of the early years still looms large, the history synthesises big leaders with the experience of regular Soviet citizens.",
    "In deliberating, they believed they were mimicking gods, their ultimate decision rendered sacred, a trait that would emerge as a near fatal flaw.",
    "They do not assume a final perfect state but function as bastions of vigilance, which in the words of Thomas Jefferson is the price of freedom.",
    "Two “big-little” histories, one on the Soviet Union, the other on democracy, serve as crucial backgrounding to the present conflict.",
    "Minorities from the central Asian republics were promoted through affirmative action long before the concept appeared in the West.",
    "Instead, the origins and the etymology are traced further back and further east to the governing assemblies of Mesopotamia.",
    "This led to a successful negotiation between the traditional Muslim norms and the radical modernism of the Soviet project.",
    "Aspects resonant to a contemporary reader receive emphasis and, more than ever, history is revealed to be a living thing.",
    "By the third act, it is clear what democracy must do: the indivisible will and its sacred claims did not reflect society.",
    "The crisis signals a return to the “jungle” where might is right, a posture thought obsolete at the end of the Cold War.",
    "In the 1920s, when the global revolution never eventuated, the Bolsheviks were left isolated with a backward country.",
    "Instead, the Marxist formulation that history operates as a machine was jettisoned as official ideology.",
    "By Kurt Johnson\n March 2, 2022 — 5.00am\n Save\nLog in, register or subscribe to save articles for later.",
    "“We the people,” always an uneasy meld of the plural and the singular, was elevated beyond question.",
    "The Shortest History of the Soviet Union by Sheila Fitzpatrick is published by Black Inc., $24.99.",
    "Instead of the mess of endless debates, why not a populist dictator, the embodiment of this will?",
    "Yet this latter period was experienced as a happy, if boring time, by many Soviet citizens.",
    "So came totalitarianism and war not as opposition to democracy but as an extension of it.",
    "The Shortest History of Democracy by John Keane is also published by Black Inc., $24.99.",
    "What is fascinating are those details that return to prominence after time in obscurity.",
    "John Keane takes us on a whirlwind history of democracy through three acts in his book.",
    "For one, ethnicity, often overlooked in Soviet histories, receives special treatment.",
    "No longer did all participants need be present, instead representatives were elected.",
    "The Booklist is a weekly newsletter for book lovers from books editor Jason Steger.",
    "“We the people” had to be shattered to the less catchy “The people are all of us”.",
    "By the second act, we arrive in a recognisably modern place: electoral democracy.",
    "This metaphysical switcheroo spelled trouble because a deity stayed baked in.",
    "It rests as a backdrop but its vast scale and human cost are only hinted at.",
    "His people and their will was, naturally, superior to their neighbour’s.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "Here, Greek gods are replaced by the monolithic “will of the people”.",
    "From here, it was simple to demand one voice and eliminate dissent.",
    "Democracy didn’t begin with togaed, pontificating Greeks.",
    "Constitutions, politicians, upper and lower houses.",
    "Still, ancient Greece was a culmination.",
    "Communism vanished into pure theory.",
    "The gulag system is de-emphasised.",
    "It is messy because it has to be.",
    "Thank you for reading the Herald.",
    "This article is complimentary.",
    "Get it delivered every Friday.",
    "Act one rejects convention.",
    "Hide content",
    "Not so."
  ]
}