{
  "id": 4400,
  "mediaId": 2713,
  "date": "2022-03-03",
  "headline": "‘Extraordinary courage’: Inside the Eastern Freeway tragedy",
  "image": "https://static.ffx.io/images/$zoom_0.6727%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_43/t_crop_custom/q_86%2Cf_auto/t_smh_analysis_no_age_social_wm/7a4794e4047491b300788afad4a6e60985906acf",
  "link": "https://www.smh.com.au/national/victoria/extraordinary-courage-inside-the-eastern-freeway-tragedy-20220303-p5a1bc.html?ref=rss&utm_medium=rss&utm_source=rss_national",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Silvester",
  "authorUrl": "https://www.smh.com.au/by/john-silvester-hvejs",
  "termIds": [
    0
  ],
  "sentences": [
    "A police review concluded: “Utilising material identified in the audit, investigators then conducted a series of compulsory examinations on current and former Connect Logistics employees to corroborate the malpractice of directors and managers at Connect Logistics identified through the documentation audit.”\nIn September, three Connect Logistics executives and the company were charged at the Parramatta Local Court with failing to adhere to “chain of responsibility” standards by allegedly directing Singh to work when he had informed the company he was not in a fit state to drive.",
    "They were followed by the attendance of emergency services personnel from all disciplines, that included local, specialist police and the Major Collision Investigation Unit, who performed their roles in extraordinarily confronting circumstances.”\nThe scene at the crash in Kew that killed four police officers.Credit:Simon Schluter\nThere was the doctor who stopped and instantly knew he could do nothing to save the victims.",
    "“It is hoped that by shining a light on dangerous and deadly practices in these circumstances, it will affect positive change in preventing heavy vehicle-related road trauma, which historically accounts for 40 per cent of fatal and life-threatening injury collisions nationally.”\nThank you for reading the Herald.",
    "Police formed the Paragon Taskforce, led by Superintendent John Fitzpatrick and made up of investigators from the Major Collision Investigation Unit, Homicide Squad, Counter Terrorism Command, the Heavy Vehicle Crime Investigation Unit and the Eastern Region Crime Squad.",
    "The investigation took 14 months and was split into three streams:\nThe actions (or lack of them) from Porsche driver Richard Pusey;\nThe actions and movements of truck driver Mohinder Singh;\nThe actions (or lack of them) from Singh’s employers, Connect Logistics.",
    "“In addition to holding individuals to account for their actions, the legacy of this investigation is anticipated to send a significant message regarding the safety obligations of employees and employers at all levels throughout the National Transport Industry.",
    "Investigators interviewed hundreds of potential sources in Victoria, NSW and Queensland, conducted physical and electronic searches in those three states, seized computers and mobile phones and examined thousands of emails and electronic documents.",
    "Share\nNormal text sizeLarger text sizeVery large text size\nThe death of four police on the Eastern Freeway was one of those awful events that brings a community together - it often takes a crisis to separate the mundane from the meaningful.",
    "The police investigation identified more than 200 persons of interest, “ranging from company employees who failed in their safety duty, to drug traffickers and users who were directly linked to the driver and his impairment”.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "Richard Pusey is arrested in 2020 for filming the dying police officers.Credit:Nine News\nHis contemptible actions distracted us from important truths: Pusey didn’t kill the police, and he didn’t cause the crash.",
    "Late last year Connect Logistics was given the TruckSafe stamp of approval, a decision that left many in the industry gobsmacked and led to the protest resignations of two long-term members of the review panel.",
    "Companies that pass a safety audit (that includes monitoring the hours and health of drivers) are given a top rating that shows the industry and customers that they are good corporate citizens.",
    "The decision is in direct contrast to Paragon’s conclusion that “if Connect Logistics had adhered to their lawful obligations with respect to safety, this collision would not have occurred”.",
    "Specialist police going about their jobs without needing direction, as if the only way they could honour their colleagues was to rise above their grief and anger to gather every clue.",
    "On April 22, 2020, a Connect Logistics truck driven by Mohinder Singh killed senior constables Lynette Taylor and Kevin King and constables Glen Humphris and Joshua Prestney.",
    "The charges sound rather innocuous but carry a serious punch, with penalties including up to five years’ jail, $300,000 individual fines and $3 million for the company.",
    "An official police review reported: “In the immediate aftermath, civilian witnesses showed extraordinary courage to provide first aid to the victims among the chaos.",
    "There have always been the cowboys (known as mile-men) who use drugs to stay awake and the owners who cut corners on safety maintenance to improve the bottom line.",
    "Police wanted to know where Singh bought his drugs, who knew he was a risk and who pushed him to keep driving when he was a danger to himself and others.",
    "The investigation didn’t stop there, with Paragon using National Heavy Vehicle laws to investigate Connect Logistics’ Sydney-based senior management.",
    "Fitzpatrick says investigators approached “colourful characters” in the drug and vice worlds who would usually refuse to cooperate with police.",
    "The job of Paragon or any major collision investigation is not just to assign blame but to work out what went wrong, so it won’t happen again.",
    "The four police from two police cars were on the verge because they had pulled over a recklessly speeding Porsche driver called Richard Pusey.",
    "Singh’s boss, Simiona Tuteru, has been committed for trial on multiple charges, including four counts of manslaughter by criminal negligence.",
    "Credit:Joe Armao\nThe grief of fellow cops was palpable, the scene horrific and the events leading up to the crash nearly indescribable.",
    "He is an angry, self-obsessed and pathetic character destined to spend a miserable life feeling aggrieved, unloved and misunderstood.",
    "The Mick Miller Award’s citation makes it clear that Paragon investigators did more than achieve justice for their dead colleagues.",
    "Singh pleaded guilty to four counts of culpable driving and was sentenced to 22 years with a minimum of 18 years and six months.",
    "Two experienced police, well respected by their peers, and two optimistic rookies just starting on their professional journeys.",
    "There are no winners there.”\nPusey was charged with multiple offences, including outraging public decency and drug possession.",
    "It took about five days to set up Paragon, but he says most of the “heavy lifting” was done by the police first at the scene.",
    "Long haulage trucking has always been a ruthless business, where the longer you can stay on the road the greater the profit.",
    "The cops showed simple human understanding to a man we now know finds it impossible to comprehend this most basic emotion.",
    "Fire Brigade units offered to free the bodies from the wreckage, but police said “they are ours” and did it themselves.",
    "Buildings in Melbourne turned blue in a tribute to the four police officers who died on the Eastern Freeway a year ago.",
    "The city glowed blue in tribute as many of us reflected on how such a routine traffic stop could end so tragically.",
    "It was Mohinder Singh, drug-affected and sleep-deprived, who veered into the emergency lane and crushed the police.",
    "Pusey showed not a sliver of normal compassion, filming the scene - including the police - before leaving the site.",
    "A couple of weeks ago the taskforce was quietly honoured with Victoria Police’s Mick Miller Outstanding Team Award.",
    "Motorists on the busy freeway stopped and tried to help, providing dignity for the dead and comfort to the dying.",
    "Fitzpatrick says: “He pleaded guilty at the earliest opportunity, and he showed real remorse for what he did.",
    "By John Silvester\n March 4, 2022 — 11.58am\n Save\nLog in, register or subscribe to save articles for later.",
    "The only reason he is alive is that police allowed him to cross the crash barrier to urinate out of sight.",
    "Fitzpatrick has spent five years as the head of the Road Policing Operations and Investigations Division.",
    "In many ways it looked like a simple case - all the evidence was laid out for the investigators to see.",
    "He was called in to take control, personally delivering the dreadful news to two of the four families.",
    "But it was anything but simple for police wanting to find out not only what had happened but why.",
    "There was the fireman heading to work who did what he could, knowing it could never be enough.",
    "“It was like a complex fraud examination where you follow the paper trail,” says Fitzpatrick.",
    "What we saw in the aftermath of the impact was the best and the worst of the human spirit.",
    "The industry has worked hard to improve standards, developing a code called TruckSafe.",
    "In April 2021, he was sentenced to 10 months’ jail and a Community Corrections Order.",
    "They also seized boxes of physical files and manuals that took months to examine.",
    "If they had told him to hold on to his bladder, there would have been five dead.",
    "Such was the level of public sympathy, he adds, that “only one was reluctant”.",
    "Apart from the usual cop-hating trolls, what happened touched everyone.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "It was the single biggest loss of life in Victoria Police’s history.",
    "He became, with good reason, one of the most hated men in Australia.",
    "It was a job he could have delegated but believed was his duty.",
    "It will be a harsher punishment than any court could inflict.",
    "And there were the ordinary commuters who stopped to help.",
    "Four people went to work and just didn’t come home.",
    "None had seen them in uniform - their uniform.",
    "He didn’t get it then and doesn’t get it now.",
    "The scene was horrible and the cause obvious.",
    "He was on leave on the day of the collision.",
    "All the police there had seen bodies before.",
    "Those who were there remember the silence.",
    "There was no media release or celebration.",
    "“It was the right thing to do,” he says.",
    "It was not that sort of investigation.",
    "Unlike Singh, he has shown no remorse.",
    "They were shattered by what happened.",
    "They will never forget what they saw.",
    "Instead, he tried to comfort them.",
    "This article is complimentary.",
    "Tears cloud anyone’s vision.",
    "His family was in court.",
    "Hide content"
  ]
}