{
  "id": 4421,
  "mediaId": 2586,
  "date": "2022-02-24",
  "headline": "Former Bills WR/KR Lands as Birmingham’s Top Pick in USFL Draft",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Victor-Bolden-Jr.-e1645757421243.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-bolden-usfl-draft-birmingham/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "?#USFLDraft | #LetsHunt pic.twitter.com/y7m6BOeG1K\n— Michigan Panthers (@USFLPanthers) February 23, 2022\n“Like Kupp (who was clocked at 4.62 in the 40-yard dash at the 2017 Scouting Combine), Lenoir is more polished than prototypical, clocking in at 4.67 seconds at his Pro Day after dominating at Western Illinois, leaving as the Leathernecks’ all-time leader in receptions (273), receiving yards (3,796) and touchdowns (31),” he wrote.",
    "Rob Rang of Fox Sports broke down some of the players in the USFL and identified their NFL counterparts, noting that the closest comparison to Los Angeles Rams receiver Cooper Kupp is former Bills receiver Lance Lenoir.",
    "The Bills have utilized five different returners this season counting Micah Hyde.”\nThe report noted Bolden averaged close to 21 yards per kick return as a rookie, though saw limited action in his time with the Niners.",
    "Victor Bolden Jr is the first WR taken in the USFL Draft for the Birmingham Stallions\nBolden spent time with the 49ers first team in 2017 and Bills & Lions Practise Squads from 2019-2021\n— P?yto?",
    "(@NCSportscast716) February 23, 2022\nA number of other former Bills players were taken during the 35-round draft, though most were not household names and few saw time during the regular season.",
    "Bills Receiver Goes First\nWide receivers had to wait until the second day of the USFL draft for their chance to get selected, with the 13th through 17th round dedicated to their position group.",
    "The Bills signed him in December 2018 off the San Francisco 49ers practice squad, but the team’s official website noted that he was mainly to serve as a potential weapon in the return game.",
    "The Houston Gamblers — the reincarnation of the team that Jim Kelly initially chose over the Buffalo Bills after college — drafted offensive lineman Brandon Hitner.",
    "Other Former Bills Represented in New League\nBolden will join a number of other former Bills in the new league, including another highly touted wide receiver.",
    "A former Buffalo Bills wide receiver and kick returner is headed to Birmingham after landing at the team’s top pick in the receiver round of the USFL’s draft.",
    "Lenoir appeared in eight games for the Dallas Cowboys between the 2017 and 2018 seasons, appearing mostly on special teams with only eight snaps on offense.",
    "The new startup league held a multi-part draft this week, with a format that dedicated specific rounds to certain position groups for the eight new teams.",
    "“The receiver ran a 4.54 at the NFL combine in 2017 and had a 32-inch vertical leap and 6.83-second three cone drill time,” the report noted.",
    "But like Bolden, Lenoir didn’t have much of an impact on the Bills, coming in for training camp last season before being cut in August.",
    "Several former Bills had their names called, including one speedy wide receiver who made a mark in the NFL on special teams.",
    "“Knowing it’s this late in the season, Buffalo is likely exploring the opportunity to find a return candidate.",
    "The first one off the board was Victor Bolden Jr., an Oregon State wideout who spent time in Buffalo in 2018.",
    "Bolden appeared in two games for the Bills late in that season, returning five kicks for a 23.2-yard average.",
    "(@pritcharg) February 23, 2022\nHe had another chance in the return game after signing with Buffalo.",
    "Former Bills cornerbacks Bradley Sylve, Trae Elston, and Ike Brown were drafted as well.",
    "A few former #Bills DB were selected during Day 1 of the #USFLDraft last night\n??",
    "Lenoir was the third receiver off the board, taken by the Michigan Panthers.",
    "@b_sylve3 – RD 11, Pick 7/@USFLStars\n— ??¢??????",
    "The latest Bills news straight to your inbox!",
    "@Trip7ERA – RD 9, Pick 6/@USFLGenerals\n??",
    "Join the Heavy on Bills newsletter here!",
    "His longest return was 28 yards.",
    "Lance Lenoir is a Panther!",
    "????????????????????",
    "????",
    "???"
  ]
}