{
  "id": 4455,
  "mediaId": 2586,
  "date": "2022-03-05",
  "headline": "Bills’ Owner in Hot Water Over Comments on Dedication of Local Fanbase",
  "image": "https://heavy.com/wp-content/uploads/2022/03/Terry-Kim-Pegula-e1646522536372.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-owner-fanbase-controversy/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    4323,
    4387,
    4736,
    160,
    161,
    641,
    798,
    1033
  ],
  "sentences": [
    "(@TedBrady5) March 4, 2022\nMany Bills fans were angry at the comment on there being little crossover between the fanbases, noting that owners Kim and Terry Pegula had pushed a “One Buffalo” theme of togetherness for both the Bills and Sabres and their fans.",
    "But some noted that the outrage appeared to miss the mark, as Kim Pegula was not questioning whether fans supported both teams, and was instead making a comment on the small number of fans who own season tickets to both.",
    "The Bills have ascended to one of the top teams in the AFC and become a trendy Super Bowl pick for next season, while the Sabres appear headed to an NHL-record 11th straight year without a playoff appearance.",
    "Bills cornerback Tre’Davious White has even joked about having never given up a goal as goalie in high school — his Louisiana school did not have hockey — and operating a fictional goalie academy.",
    "“A public-private financing agreement not only will get done for the proposed $1.4 billion Orchard Park ballpark, but the tea leaves indicate it also could be announced this week,” he reported.",
    "Bills Nearing Major Milestone\nWhile Kim Pegula’s comments were drawing some public controversy, behind the scenes the owners have reportedly been moving the Bills toward a major milestone.",
    "Comments Draw Controversy\nPegula, who serves as president of both the Bills and Sabres, appeared at the “Future of the Fan” panel at the MIT Sloan Sports Analytics Conference on Friday.",
    "A comment that Pegula made about the overlap between the fan bases — or, what appeared to be a misinterpreted version of the remark — drew some anger from both Bills and Sabres fans.",
    "If the idiots don’t want to open their wallets to build a nice new modern domed stadium then they should just slap a couple of coats of paint on the old stadium and use it!",
    "Pegula was taking part in a panel discussion and touched on the difficulty of owning two professional teams in the same city, with each one on a very different trajectory.",
    "The stadium has also drawn some mild controversy among fans, as there are reportedly no plans to add a dome that some cold-weary fans had hoped would be included.",
    "The Athletic’s Tim Graham reported that the team is very close to securing financing for a new stadium, which could be publicly introduced in the coming days.",
    "She noted the difficulty of both teams being on different paths, and remarked that there is not a lot of overlap between season-ticket holders for both teams.",
    "Buffalo Bills owner Kim Pegula generated some controversy with remarks about the dedication of the local fanbase and its ability to support two teams.",
    "As the Buffalo News noted, the Sabres averaged just 8,657 tickets sold per game this season, which is last place in the NHL by a significant margin.",
    "If BuffaBLOW doesn’t have the money and can’t afford to keep up with the other NFL cities they should move the team to a city that can.",
    "We have a few, not as many as you would think, living in the same market that is a ticket buyer to both.”\n— Ted Brady ??",
    "She is so out of touch with the fanbase I am shocked she remembers she runs the Sabres.",
    "“This is coming from the person who said they had more knowledge then the regular fan.",
    "There are a lot of cities with plenty of money that would love to have an NFL team.",
    "Then again, look at their record since purchasing the team,” one fan tweeted.",
    "Moving the team out of this run-down excuse for a city would be a blessing.",
    "Bills players have regularly appeared at Sabres games, and vice versa.",
    "“For us, I have a hard job,” Pegula said, via the Buffalo News.",
    "“I’ve got one team that’s building and one team that’s peaking.",
    "We don’t have a ton of crossover, actually, believe it or not.",
    "Others were critical of the Pegulas’ attention to both teams.",
    "As an added bonus move them to a city with decent weather.",
    "The latest Bills news straight to your inbox!",
    "You have to adapt for two different groups.",
    "Join the Heavy on Bills newsletter here!"
  ]
}