{
  "id": 4530,
  "mediaId": 2558,
  "date": "2022-03-01",
  "headline": "Broncos Mailbag: Why not consider Mitchell Trubisky as option at quarterback if big names aren’t traded?",
  "image": "https://www.denverpost.com/wp-content/uploads/2022/02/GettyImages-1358632159.jpg?w=1024&h=683",
  "link": "https://www.denverpost.com/2022/03/01/broncos-mailbag-mitchell-trubisky-quarterback-option/",
  "mediaOutlet": "Denver Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan O’Halloran",
  "authorUrl": "https://www.denverpost.com/author/ryan-ohalloran/",
  "termIds": [
    0
  ],
  "sentences": [
    "— Marshall, Parker\nRO: Watson isn’t on the Broncos’ radar (at least publicly) because the 22 lawsuits filed against him last year remain open and it makes no sense for a team to trade for Watson until those are settled and the NFL office has levied its punishment.",
    "I think Trubisky might be the best option to knock it out of the park, and if not, we’ll be at the same point next year but with maybe a more enticing quarterback class (if they don’t select one this year to sit out the first season).",
    "My thought is with new coaches and lots of new players that fit Nathaniel Hackett’s system, no matter who the quarterback is, they aren’t going to be world beaters next year — or maybe longer.",
    "Long answer: I agree that trading for Foles (under contract with Chicago) or signing Fitzpatrick (limited to one game last year for Washington) keeps the Broncos in chase-their-tail mode.",
    "Bradley Chubb was disappointing last season and while other players (Jonathon Cooper, Malik Reed and Stephen Weatherly) all showed promise, the void Von Miller left was evident.",
    "There are three things to like about Landry: His age (he turns 26 in June), durability (one missed game in four years) and his production (31 sacks in 64 games).",
    "If general manager George Paton and then-coach Vic Fangio had confidence in Lock at this time last year, they wouldn’t have eventually pursued Teddy Bridgewater.",
    "Put Rodgers or Wilson in charge of the Broncos’ offense and they immediately become contenders in the AFC West and should be expected to secure a wild-card spot.",
    "— Mike, Denver\nRO: Edge rusher could be addressed in the first round if the Broncos still have the ninth overall pick and don’t immediately draft a quarterback.",
    "— Tim Eitel, Orlando, Fla.\nRO: Shockingly, another vote for Lock to at least get a chance to compete (again) for the Broncos’ starting quarterback position.",
    "This quarterback class isn’t as dazzling as last year’s group, which puts the Broncos in a semi-bind if they can’t swing a deal for Rodgers or Wilson.",
    "That way, if the Broncos get Rodgers, they will be instantly competitive and didn’t clean out their cupboard of players and picks just to acquire him.",
    "Trubisky has a 29-21 record in the regular season (0-2 in the playoffs), is only 28 and had career totals of 64 touchdowns and 38 interceptions.",
    "He has only 21 1/2 sacks in 64 games, which means he may be willing to settle for a one-year/prove-it contract with a team like the Broncos.",
    "If the Broncos don’t acquire Rodgers or Wilson, they will have the cap space to make at least one big splash free-agent addition.",
    "Barnett is under contract for 2022 with Philadelphia, but it’s set up as an option/void so he is expected to hit the market.",
    "Let’s break this into a couple of categories:\n• Broncos won’t be “world beaters” regardless of who plays quarterback.",
    "If Drew Lock would be coming out in this year’s draft, he very easily could be the first quarterback selected.",
    "Why spend the draft and player capital on Aaron Rodgers when he will be gone before the system flourishes?",
    "I don’t see the point of going after Nick Foles and Ryan Fitzpatrick or bringing back Teddy Bridgewater.",
    "Denver Post Broncos writer Ryan O’Halloran posts his Broncos Mailbag periodically during the off-season.",
    "Denver Post Broncos writer Ryan O’Halloran posts his Broncos Mailbag periodically during the offseason.",
    "Maybe — and this is a big maybe — you sign him and pair him with a first- or second-round draft pick.",
    "Trubisky might embrace the one-year contract offer if he believes he has a chance to start in Week 1.",
    "Because of Watson’s off-the-field issues, trading for him is an ownership-level decision.",
    "His agent went public on Monday by saying he had given the Cardinals a contract proposal.",
    "— Yoann, Beine-Nauroy, France\nRO: Short answer: No thanks … at least not as the starter.",
    "Wilson could be viewed as the starter for 5-6 years (compared to 2-3 years for Rodgers).",
    "His floor might be about the same as the others right now, but his ceiling is higher.",
    "If they can’t trade for Rodgers or Wilson, why overreach for an inferior quarterback?",
    "If Aaron Rodgers chooses not to leave Green Bay, what do think of Mitchell Trubisky?",
    "At least Russell Wilson would be around long enough to get the team into contention.",
    "Draft Malik Willis and wait for him to develop while a veteran place-holder starts?",
    "Wilson would catapult the Broncos into contention immediately, much like Rodgers.",
    "Therefore, Seattle can command more for Wilson than Green Bay can for Rodgers.",
    "Florida State’s Jermaine Johnson is one to watch at the Combine this week.",
    "Spotrac estimates he will receive a contract that averages $17.1 million.",
    "It’s a pricey move, but what do you think about getting Harold Landry?",
    "• Wilson will be around long enough to get Broncos into contention.",
    "— Andy, Bismarck, N.D.\nRO: Always good to hear from my home state.",
    "As for Lock, giving him another chance would also be an overreach.",
    "He’s young (26) and looks like he’s about to jump into his prime.",
    "Probably too rich for the Broncos, who remain committed to Chubb.",
    "One name I don’t hear much anymore for Denver is Deshaun Watson.",
    "He may just need new scenery to thrive and Denver could be it.",
    "I wouldn’t give up more than two first-round picks.",
    "The Murray situation in Arizona merits monitoring.",
    "• Unproven quarterback option always a wild-card.",
    "Finding an unproven player is always a wild-card.",
    "• Why trade players and draft picks for Rodgers?",
    "Draft Kenny Pickett and start him right away?",
    "The Broncos, of course, don’t have an owner.",
    "I wouldn’t give up more than two players.",
    "He doesn’t seem super happy in Arizona.",
    "We need depth at the edge-rusher spot.",
    "Does he have any shot at coming here?",
    "The on-going quarterback discussion.",
    "How about a trade for Kyler Murray?",
    "Submit questions to Ryan here.",
    "Submit questions to Ryan here.",
    "Or how about Derek Barnett?",
    "Because he’s worth it.",
    "Totally agree.",
    "I disagree.",
    "A risk.",
    "Ditto."
  ]
}