{
  "id": 4625,
  "mediaId": 4045,
  "date": "2022-02-22",
  "headline": "Missouri Republicans trade jabs as race for U.S. Senate kicks off",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/b/cb/bcb48b3e-55b6-5cd0-9830-0bfc17a99881/62153b231a7bc.image.jpg?crop=640%2C336%2C0%2C72&resize=640%2C336&order=crop%2Cresize",
  "link": "https://www.stltoday.com/news/local/govt-and-politics/missouri-republicans-trade-jabs-as-race-for-u-s-senate-kicks-off/article_3d971c5e-f15a-5394-ac1b-dc568637f54f.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kurt Erickson",
  "authorUrl": "https://www.stltoday.com/users/profile/Kurt%20Erickson",
  "termIds": [
    1961,
    2104,
    2923,
    4433,
    878,
    1171,
    5057,
    5159,
    5240
  ],
  "sentences": [
    "Hartzler, after filing her own Senate paperwork, said Tuesday she would support the Republican nominee in the general election “unless it’s Eric Greitens.”\nGreitens’ former lover testified to a GOP-led Missouri House committee that before he was governor, Greitens tied her up in his basement, blindfolded her, restrained her and insisted she give him oral sex even though she was crying.",
    "They’d make a great team.”\nHartzler, asked to respond, said, “I respect Jack Danforth and what he did for our state, but I think what we need right now is someone with a track record for conservative leadership, who’s a fighter in Washington.”\nSt. Louis attorney Mark McCloskey was one of the first candidates in line Tuesday morning.",
    "Eight Democrats had filed paperwork for U.S. Senate: Lucas Kunce of Independence; former state Sen. Scott Sifton, D-south St. Louis County; Gena Ross of Platte City; Lewis Rolen of St. Louis; Spencer Toder of St. Louis; Carla Coffee Wright of St. Louis; Jewel Kelly of Festus; and Josh Shipp of St. Louis.",
    "She added, “and then you also have a former governor, who went over to China and pandered to them.”\nIn addition to the Senate, filing for the state’s eight congressional districts, state auditor, all 163 House seats and half of its 34 state Senate districts began Tuesday.",
    "“No matter what the mainstream media does, no matter what the Republican establishment does, no matter what the left does, we’re going to win this race,” Greitens told a group of reporters after he submitted paperwork to run in the Aug. 2 Republican primary.",
    "McCloskey, who entered the race as a political newcomer after he and his wife, Patricia, waved guns at racial injustice protesters outside their Central West End Home in 2020, said he offers voters a different choice from the other candidates.",
    "The former governor, in a poll released Saturday by Remington Research Group and Missouri Scout, continued to lead the rest of a crowded field, registering 25% support among likely Republican primary voters surveyed.",
    "He jabbed Hartzler, saying she should seek the backing of former U.S. Sen. John Danforth, R-Mo., who said last week he was looking for a center-right candidate to run as an independent for Senate.",
    "“If you want an authentic job creator who will get the job done, I’d be honored to earn your vote.”\nChina ties\nLong and Hartzler on Tuesday also dinged Schmitt over past actions related to China.",
    "I’m the attorney general that has sued China — the first one to sue China for unleashing the coronavirus on the world.”\nHartzler said that she stood apart when it came to challenging China.",
    "Because at the end of the day, this is a race about the future of the country and people know that they need someone who is willing to stand up and fight for them,” Greitens said Tuesday.",
    "Spencer filed to run for state Senate and said it doesn’t bother him that the boundaries for the district remain in flux due to a bipartisan commission’s inability to agree on new lines.",
    "In the state Senate, he sponsored efforts to turn St. Louis’ international airport into a hub for China air cargo, proposing up to $480 million in tax breaks over 15 years.",
    "She opted not to run for her last term in the House last election, instead running and losing a race to represent the 15th Senate District, covering west St. Louis County.",
    "Asked if he agreed with Greitens that the former governor had been “exonerated” of wrongdoing, Schmitt said, “I think he’s going to have to make that case to Missourians.",
    "Other Republicans who filed for Senate include: Hartford Tunnell of Carthage; Deshon Porter of St. Louis; Dave Sims of Kansas City; Patrick Lewis of Wellsville; C.W.",
    "The sixth well-known GOP candidate, Missouri Senate President Pro Tem Dave Schatz, R-Sullivan, also sought to differentiate himself as he filed paperwork Tuesday.",
    "Former Rep. Alan Green, D-Florissant, announced his candidacy for the job being vacated by the state’s lone Democratic officeholder, Auditor Nicole Galloway.",
    "Candidates running for the state’s eight congressional seats and half of the state Senate seats filed to run in districts that have not yet been finalized.",
    "She criticized Schmitt’s support of the “China hub” and also slammed Greitens’ appearance on Chinese television when he visited Asia as governor in 2017.",
    "“There’s a lot of questions that were left unanswered when he left.”\nSchmitt also commented on U.S. Sen. Josh Hawley’s recent endorsement of Hartzler.",
    "Greitens joined more than a dozen other Republicans in filing paperwork to run for the U.S. Senate seat being vacated by Sen. Roy Blunt, R-Mo.",
    "“If you want someone who will say and do anything to get elected then you’ll have plenty of options and, frankly, I’m not your guy,” he said.",
    "State Treasurer Scott Fitzpatrick and state Rep. David Gregory, R-Sunset Hills, are both competing for the GOP nomination for state auditor.",
    "“It’s not conservative to tie a woman up in your basement and to assault her, and to bring shame and disgrace on our state,” Hartzler said.",
    "Missouri deserves better.”\nSchmitt said “I’m never going to quit on Missouri” when asked what distinguished him from Greitens.",
    "Early birds at candidate registration included former state Reps. Deb Lavender, D-Kirkwood, and Bryan Spencer, R-Wentzville.",
    "As governor, Greitens faced allegations of campaign finance violations and of assaulting and threatening his former lover.",
    "Hartzler is a member of the Congressional Executive Commission on China, which was targeted by Chinese sanctions in 2020.",
    "Gardner of St. Louis; Robert Allen of Defiance; Bernie Mowinski of Sunrise Beach; and Dennis Lee Chilton of Springfield.",
    "Lavender, who has two years left before term limits bar her from running again, served in the House from 2015 to 2021.",
    "“Tell him to call Vicky Hartzler,” Long said when told Danforth was looking for an independent, centrist Republican.",
    "JEFFERSON CITY — Nearly four years after he resigned from office and retreated from the capital city, former Gov.",
    "“Eric Greitens was unfit to serve then as Governor and he’s unfit to serve now and that’s why I’m in this race.",
    "Attorney General Eric Schmitt garnered 22% support, while U.S. Rep. Vicky Hartzler came in third, at 18%.",
    "Told Long had called him “Shanghai Schmitt,” Schmitt said “it’s a total misrepresentation of my record.",
    "“Here you have a candidate who’s truly focused on addressing the threats from China,” Hartzler said.",
    "“If you like the status quo ... vote for the traditional candidate,” McCloskey said.",
    "“I think no matter where they are, my constituents know my history of serving them.",
    "U.S. Rep. Billy Long, R-Springfield, also filed paperwork to run for U.S. Senate.",
    "“Trump knows I’ve been with him longer and stronger than anybody,” Long said.",
    "Lavender is seeking the redrawn 98th House District seat in St. Louis County.",
    "Eric Greitens returned Tuesday to officially launch his bid for U.S. Senate.",
    "“I think Vicky’d make a great centrist Republican for Jack Danforth to run.",
    "Greitens resigned less than 18 months into his four-year term as governor.",
    "“I look forward to serving with Sen. Hawley in the Senate,” Schmitt said.",
    "“You have another person who tried to turn our airport into a China hub.",
    "He has been seeking the endorsement of former President Donald Trump.",
    "“I think however big or small the field is we’re going to do great.",
    "Democrats had gone without a candidate for auditor — until Tuesday.",
    "Schmitt voted in 2013 to allow for foreign ownership of farmland.",
    "Tuesday marked the first day of candidate filing for the primary.",
    "While Greitens exuded confidence, Hartzler expressed disgust.",
    "The controversies preceded his resignation on June 1, 2018.",
    "In 2015, he voted to loosen oversight of foreign purchases.",
    "They know I’m involved in the community,” Spencer said.",
    "Missouri deserves better,” Schatz said on Twitter.",
    "The final date for candidate filing is March 29.",
    "“And he did."
  ]
}