{
  "id": 465,
  "mediaId": 2586,
  "date": "2022-04-20",
  "headline": "Bills Rumors: Team Likely to Explore Trade for 49ers Star Deebo Samuel",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Deebo-Samuel-e1650507608200.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-rumors-deebo-samuel-trade/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    2000,
    2335,
    2413,
    160,
    442,
    703,
    708,
    924
  ],
  "sentences": [
    "I would give an arm to find a way to put Deebo on the Bills https://t.co/BXX2xsFZ7s\n— Joe-hei Joe-tani (@SneakyJoeSports) April 20, 2022\nWhile it could be difficult for the cash-strapped Bills to find room for Samuel and a new contract he could be seeking, Beane has said in the past that the team will always inquire when a talented player hits the trade block.",
    "@kpatra spotlights 10 potential landing spots.https://t.co/gPxGt7AGaj pic.twitter.com/CB4EbU7cwI\n— Around The NFL (@AroundTheNFL) April 20, 2022\nShanahan is not part of the negotiations, Wagoner noted, but said it’s imperative that the team find a way to keep Samuel.",
    "They’re very much at the core of who we are and they’re fabulous players, fabulous people and a big part of who we are.”\nIn yet another dramatic development at the receiver position, Deebo Samuel has requested a trade from the 49ers.",
    "As ESPN’s Nick Wagoner noted, general manager John Lynch and coach Kyle Shanahan have both said that they want to keep Samuel, and both have highly valued his contributions both as a receiver and a running back.",
    "Florio suggested as many as eight other teams could be in on Samuel — the Chicago Bears, Atlanta Falcons, Houston Texans, New Orleans Saints, New England Patriots, Kansas City Chiefs, and Green Bay Packers.",
    "The Buffalo Bills may not be the most likely destination for multi-talented wide receiver Deebo Samuel, but Brandon Beane will never say never when there’s a talented player on the trade block.",
    "pic.twitter.com/hHGiNJCpS5\n“Listen, he’s on another team but here’s what I’ll say is good players like that you always do your due diligence,” Beane said at the time, via NewYorkUpstate.com.",
    "If there’s an opportunity at any position to make a move that we think is a good fit for us, we’ll do it.”\nSan Francisco Aims to Keep Samuel\nThe 49ers may not be trying hard to trade Samuel.",
    "The Jets were also in the running for Tyreek Hill before losing out to AFC East rival Miami Dolphins, and could take another swing at landing a speedy and talented receiver.",
    "As Pro Football Talk’s Mike Florio noted, the New York Jets could be a frontrunner as they now have former 49ers defensive coordinator Robert Saleh as head coach.",
    "Samuel is expected to be a coveted trade prospect, and the Bills are likely to be one of the teams reaching out to San Francisco to check on his asking price.",
    "Chris Owen of Buffalo’s WYRK suggested the Bills make a run at Samuel, and Buffalo Bills Radio Network pregame host Joe DiBiase endorsed the idea as well.",
    "Samuel is going into the final year of his rookie contract, and there had been growing signs of a rift between him and the Niners organization.",
    "The San Francisco 49ers receiver and running back told ESPN’s Jeff Darlington that he asked the team for a trade.",
    "While the Bills are not seen as a frontrunner, some in the Buffalo media wondered if the team could take a look.",
    "Samuel had wiped any mentions of the team from his Instagram account and unfollowed the team, ESPN noted.",
    "“Like I’ve long said, those guys are going to be a part of us for a long, long time,” Lynch said.",
    "That was the case back in 2019, when the team nearly pulled off a trade for Antonio Brown.",
    "Deebo Samuel runs after making a catch in a game against the Los Angeles Rams.",
    "Samuel Wants a Trade\nThe market for Samuel could be hot.",
    "Where is the best landing spot for Deebo Samuel?",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "“But we need to figure it out,” he said.",
    "Where could the All-Pro wideout end up?",
    "“You know I’ve made moves before.",
    "“They’re fantastic players."
  ]
}