{
  "id": 4659,
  "mediaId": 2644,
  "date": "2022-02-16",
  "headline": "Genesis Open perfect spot for Patrick Cantlay to win again",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/Patrick-Cantlay.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/16/genesis-open-perfect-spot-for-patrick-cantlay-to-win-again/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Sobel",
  "authorUrl": "",
  "termIds": [
    2937,
    3899,
    4698,
    890,
    1081
  ],
  "sentences": [
    "I’ll be honest here: I’m not exactly sure when the best time to recruit the world’s premier golfers and promote a rival golf league largely based on promises of massive contracts to sportswash prior human rights misdeeds really is, but during a stretch that’s included brilliant golf porn in the form of gorgeous scenery and unparalleled spectator support at the game’s biggest party, this probably ain’t it.",
    "Outright winner\nPatrick Cantlay (11/1): Full disclosure: I was all prepared to list Matt Fitzpatrick as my favorite outright this week until I saw his odds (33/1) — and I wasn’t prepared for him to have a shorter number than the likes of Jordan Spieth and Sam Burns (both 40/1).",
    "Whether he is is subject to debate — I’ll still give that edge to Jon Rahm — but it’s the mission itself which is more relevant, as he continues to contend with something less than his most well-rounded game, posting finishes of second-fourth-ninth-fourth so far this year.",
    "It might be difficult to find a lull in the PGA Tour’s annual schedule when the product seems more ordinary than extraordinary, but it’s fairly simple to realize that the current sequence of events is not one easily infiltrated.",
    "That won’t change this week, as all 10 of the top-10 players in the Official World Golf Ranking will be in the Genesis Invitational field at one of the game’s enduringly resplendent venues.",
    "Trying to follow in Max Homa’s footsteps as a second straight SoCal native to win his hometown event, Cantlay has finished 15th-17th-15th-fourth over the past four editions of this one.",
    "The only thing we shouldn’t love is the price, but it’s the right number for a guy who’s been knocking on the door for another victory and could be walking through that door this week.",
    "No, Riviera Country Club won’t afford the magnificent ocean backdrops of Torrey Pines or Pebble Beach, nor will it provide memories of beer raining from the sky like TPC Scottsdale.",
    "In the post-NFL world, with the betting public begging for more action, the Genesis offers a major championship-like feel, with so much star power on the outskirts of Hollywood.",
    "Last week is a perfect example: While his performance was terrific tee-to-green in Sunday’s final round, for the week he ranked a mere 27th in Strokes Gained: Approach.",
    "Fresh off a playoff loss at last week’s WM Phoenix Open, Cantlay seems like he’s on a mission to prove that he’s the world’s best player right now.",
    "Instead, we’ll be treated to a stringent test of golf on a course which will assess every part of a player’s game, exposing any inefficiencies.",
    "Let’s get right to the picks, beginning with an outright play who isn’t listed too far down the board, but makes way too much sense this week.",
    "At some point, all of the parts are going to be locked in at the same time — and this feels like the right week to expect it.",
    "This is a great fit for him from an analytical perspective and he certainly owns enough narratives.",
    "When his other clubs came around, his putting faltered, ranking just 55th on the greens Sunday.",
    "The timing extends past just riding that wave of momentum.",
    "Yuck."
  ]
}