{
  "id": 4678,
  "mediaId": 2551,
  "date": "2022-02-22",
  "headline": "Millionaire Ovo energy boss who told customers to 'cuddle your cat, eat porridge and do star jumps' if they're cold has a trendy £1,200 woodburning stove in his £3.2m Cotswolds",
  "image": "https://i.dailymail.co.uk/1s/2022/02/22/10/54495747-0-image-a-9_1645524227965.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10537929/Millionaire-Ovo-energy-boss-1-200-woodburning-stove-3-2m-home.html?ns_mchannel=rss&ito=1490&ns_campaign=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Sales For Mailonline",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Dan+Sales+For+Mailonline",
  "termIds": [
    2115,
    2835,
    3152,
    782,
    783,
    4923,
    4991
  ],
  "sentences": [
    "+4\nView gallery\nOvo Energy boss Stephen Fitzpatrick, 45, had woodburning stove fitted in his mansion\n+4\nView gallery\nThe charming Cotswold Manor owned by the founder of OVO Energy Stephen Fitzpatrick\n+4\nView gallery\nThe cooker had to be given permission by his local council in the Cotswolds, Gloucestershire\nTrendy wood burners TRIPLE the level of harmful pollution particles inside homes\nWood burners are a danger to children and elderly people and should be sold with a health warning, a study finds.",
    "+4\nView gallery\nFounder of OVO Energy Stephen Fitzpatrick seen outside BBC late last year after an interview\nOvo energy had been criticised over advice to keep warm that included cuddling pets\nStephen Fitzpatrick: The £675m 'Robin Hood' ex-City trader who was born to a Belfast grocer and founded firm with his childhood sweetheart\nMr Fitzpatrick, who was dubbed a disruptor to the UK energy market when he founded Ovo in 2009, which has made him one of the nation's richest people.",
    "The stunning weekend home is set in 12 acres of pristine countryside and also has a swimming pool, four bathrooms and elegant dining room with stunning views, giving Mr Fitzpatrick and his family adequate space to follow his company's controversial advice on\nMr Fitzpatrick, who is worth an estimated £675million, is usually seen by locals and workers on his estate during the weekends.",
    "Around 1,000 call centre staff will be trained to become zero-carbon living advisers, with specialist knowledge of green home products and technologies from tariffs to making homes more energy efficient.",
    "The son of a Belfast grocer he studied at Edinburgh University and then started a successful property newspaper before becoming a City trader, which he quit in his mid 30s to set up on his own with OVO.",
    "In 2014, he controversially made headlines after it was revealed that he had taken £2million out of OVO, when it was struggling to break even, to buy a family home in Gloucestershire.",
    "After establishing Ovo, Mr Fitzpatrick, who was born in Northern Ireland, became known as the 'Robin Hood' of the energy sector for taking on the big six established energy companies.",
    "After learning about the word burner the Green Party's Amelia Womack told The Sun: 'It's clear he's found a cosy alternative to cuddling his cat and doing star jumps to keep warm.",
    "'Ovo must be subject to severe scrutiny before the union decides on our next moves, but if they move to compulsory redundancies they will be fully opposed by the union.'",
    "Advertisement\nOvo's self-described 'visionary strategy' is called Plan Zero and says: 'This means reducing our carbon emissions and removing carbon from the atmosphere.",
    "The company added it will reverse the policy of offshoring from the previous owner and create more high-skilled jobs in the UK, and open a new Ovo Academy in Glasgow.",
    "Mr Fitzpatrick was in hot water last month after Ovo's sister firm SSE Energy gave embarrassing and insulting advice to customers trying to save money on fuel bills.",
    "The founder of the energy firm who told customers to do star jumps and cuddle their pets for warmth has had a polluting woodburner fitted in his £3.2million mansion.",
    "But they included the pets and star jumps advice, as well as 'challenging the kids to a hula-hoop contest' and leaving the oven door open after cooking food.",
    "Mr Fitzpatrick founded Ovo Energy in 2009 and led its growth to become the largest independent energy provider in the UK, with around five million customers.",
    "Wood burners were lit for four hours at a time and, while operating, the levels of harmful particles was three times greater than when they were unlit.",
    "The three remaining offices will be in Bristol, Glasgow and London, while more employees will be supported to work flexibly from home should they wish.",
    "They have known each other since the age of 16 and with their children, enjoy an elaborate life of plush country living and exotic foreign holidays.",
    "These particles have been linked to a number of health issues and can cause damage to the lungs - particularly in young and old people.",
    "Researchers from the University of Sheffield placed pollution detectors in 19 homes for a month and collected data every few minutes.",
    "University of Sheffield researchers said they should be sold with a health warning because of the pollution they emitted into homes.",
    "A keen Formula One fan, in 2015 he invested £30million of his own money into the Marussia F1 team after it went into administration.",
    "At the time the Unite union said it warned in 2020 that Ovo was taking a risk when it took over the retail base of energy giant SSE.",
    "Ovo Energy boss Stephen Fitzpatrick, 45, had to get permission for the posh £1,199 Anevay Tana stove at his Gloucestershire home.",
    "Unions said they will oppose the job cuts, and criticised the Government for 'doing nothing' to tackle the energy crisis.",
    "The blog said it was giving ten simple and cost effective tips to keeping warm in winter without turning up the heating.",
    "Advertisement\n'We can't all live in mansions but we all have the right to a warm home, and that needs system change.'",
    "Unite national officer for energy Simon Coop added: 'We warned the directors about blundering into the SSE takeover.",
    "Cotswold District Council passed the request from Mr Fitzpatrick – worth an estimated £675million – two months ago.",
    "'In recent years the same directors have plundered the accounts for amounts estimated to be touching £5 million.",
    "Ovo said it is also increasing its minimum wage by 15% to £12 an hour, giving a pay rise for 1,000 employees.",
    "Staff were given details of plans in January, which include reducing the number of offices from 10 to three.",
    "The cut-back represents a quarter of the number of employees at Ovo, which has around 4.5 million customers.",
    "It appears at odds with his own company's aims to become the 'UK's zero carbon living partner in the home'.",
    "The burners were all 'smoke exempt', meaning they meet government standards due to be compulsory by 2022.",
    "General secretary Sharon Graham said: 'We will do everything in our power to defend our members' jobs.",
    "Conservative MP Craig Mackinlay added: 'It seems another instance of do what I say but not as I do.'",
    "The outcry saw the webpage deleted and Mr Fitzpatrick admit 'It was a bad day, we made a mistake'.",
    "Woodburning stoves contribute to particle pollution and last year were labelled a health risk.",
    "He co-founded the company with Sophie using £350,000 they raised by selling their first home.",
    "'We will not sit by and watch our members being made to pay the price of the pandemic.'",
    "Last month it announced at least 1,700 jobs were set to be cut by the energy firm.",
    "'We've set tough targets to help us achieve both of these objectives.'",
    "As a first step the company must now open the books to union experts.",
    "'Meanwhile his customers are left shivering unable to pay bills.",
    "'All and every option will be on the table.",
    "Ovo declined to comment to MailOnline."
  ]
}