{
  "id": 4688,
  "mediaId": 2636,
  "date": "2022-02-17",
  "headline": "The $1.7 Billion Student Loan Deal That Was Too Good to Be True",
  "image": "https://static01.nyt.com/images/2022/02/14/business/00navient-1/00navient-1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/17/business/navient-student-loan-settlement.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2982,
    3298,
    3494,
    4048,
    694,
    917
  ],
  "sentences": [
    "“If you were defrauded by your school, you were defrauded, and your loans should be released whether you’ve paid on them or not.”\nThe settlement resolved nearly a decade of state investigations into the role Navient, the lender and loan servicer that has long been a linchpin of the educational lending market, played in a bleak cycle of vulnerable students, dubious for-profit schools and taxpayer money.",
    "Rob Bonta, the attorney general of California, said the settlement focused on borrowers who were “hurt the most by the bad practices — they were the most distressed, the most in need.” The deal punishes “a bad actor that sent a lot of bad loans into the student universe,” said Mr. Bonta, whose state was one of five that led the settlement.",
    "Their ability to repay the private loans was immaterial: One especially risky set of loans had a default rate that peaked at 87 percent, according to Pennsylvania’s attorney general, but the number of loans Navient made to those borrowers swelled to 54,000 in 2006 from 706 in 2000.",
    "There’s a real sense that if you signed for the loan, you have to repay it.”\nMs. Linssen, who still owes $70,000 for private loans she took out to attend the Brooks Institute, a for-profit in California that abruptly folded in 2016, said she hoped to sue Navient.",
    "State prosecutors said Navient, which did business as Sallie Mae until 2014, was willing to give private loans to borrowers it knew couldn’t pay them back because they were a money-losing lure for a far more profitable product: federal student loans.",
    "As employers seek to hire and keep workers in a challenging job market, more are treating student debt repayments as a job benefit: A recent study found that about 17 percent of large employers offered some form of student debt assistance.",
    "Navient began to wind down the tactic only after it and other lenders faced were engulfed in a series of scandals over their practices; the strategy largely ended after the federal government started lending directly to students in 2010.",
    "“I was stunned,” said Ms. Linssen, 57, who has sent Navient about $500 every month — sometimes skipping groceries to do it — after graduating from Brooks Institute, a for-profit arts school in California that abruptly folded in 2016.",
    "I’d worked hard for it.”\nHe found work in an unrelated field — he is a digital production specialist — but his six-figure debt was oppressive, and the double-digit interest rates on his private loans stifled his progress.",
    "He borrowed $130,000 to attend the New England Institute of Art, part of a chain then owned by Education Management, which went bankrupt in 2018 after facing state and federal charges over its recruiting tactics.",
    "Eileen Connor, the director of the Project on Predatory Student Lending, which represents former students at for-profit schools, said the states had used a familiar playbook in reaching the settlements.",
    "Both Navient and the states have called the settlement a win: Navient did not acknowledge wrongdoing and avoided lengthy court battles, while the prosecutors trumpeted the $1.7 billion in forgiven debt.",
    "Starting in the early 2000s, Navient and the schools it worked with used the private loans to fill gaps for students who relied on government-backed loans from Navient to pay the bulk of their tuition.",
    "“It feels like such a betrayal — we’re being penalized for paying our debts,” said Jacqueline Strouse Schible, 39, who attended the Art Institute of California’s campus in San Diego, where she lives.",
    "“If the borrower can create condensation on a mirror, they need to get a loan this year,” Thomas Fitzpatrick, Navient’s former chief executive, said in a 2007 meeting, according to court filings.",
    "As the Fed changes its benchmark rate, private student loan borrowers should expect to pay more, as both fixed and variable rate loans are linked to benchmarks that track the federal funds rate.",
    "Even though prosecutors said Navient had made predatory loans to hundreds of thousands of borrowers it knew couldn’t afford them, the settlement covered only about 66,000 who were in default.",
    "“It’s ‘Let’s make this big splashy announcement’ that creates the impression in the public’s mind — and, sadly, in the minds of people who have these loans — that relief is here,” she said.",
    "“You’re relying on state laws that prohibit deceptive practices, and the strength of those statutes varies widely,” said Adam Minsky, a Boston lawyer who specializes in student loan cases.",
    "Those who managed to make the payments on their deceptive, high-interest debt — mostly to attend for-profit schools that left them with worthless degrees — would just have to keep paying.",
    "While her debt hangs over every financial decision she makes, Navient is now free of “the burden, expense, time and distraction” of the states’ claims, the company said in a statement.",
    "They can seek to have any federal loans eliminated through a program known as “borrower defense to repayment,” which can wipe out loans to students whose schools defrauded them.",
    "A longstanding government policy, the so-called 90/10 rule, requires for-profit schools that receive federal student loans to get at least 10 percent of their funding elsewhere.",
    "A deal last month between 39 states and Navient, a student lending giant accused of unfairly ensnaring borrowers like her, would wipe away $1.7 billion in private student loans.",
    "It’s rolled off their credit score and they can move on with their lives, while I’m still spinning my wheels.”\nStudent Loans: Key Things to Know\nCard 1 of 4\nNew sources of aid.",
    "Even if the private loans weren’t repaid, the federally guaranteed loans were bulletproof revenue for Navient — and the more borrowers it attracted, the more money it made.",
    "After years of struggling to make payments that hardly put a dent in the loans she took out to attend a now defunct arts school, Victoria Linssen saw a glimmer of hope.",
    "The move will help people seeking to have their loans eliminated under the Public Service Loan Forgiveness program and through the use of income-driven repayment plans.",
    "Navient hasn’t made federally guaranteed loans for more than a decade, and last year said it would stop servicing millions of federal loans on the government’s behalf.",
    "Schools like the Art Institute chain and ITT Tech — big players in an industry with a history of subpar outcomes for students — were crucial to Navient’s strategy.",
    "The Education Department will use one-time waivers and adjustments to retroactively credit millions of borrowers with additional payments toward loan forgiveness.",
    "Its focus now is its booming private loan business: Navient originated $6 billion in private student loans last year, making it the country’s largest provider.",
    "She pays Navient $600 a month toward a $23,000 balance for her own private loans and those she co-signed for her mother, who attended ITT Technical Institute.",
    "Education Department officials added a chain that’s still in operation, DeVry University, to the list on Wednesday, and more claims could be approved soon.",
    "Although Navient made hundreds of thousands of private loans as part of its strategy, it’s not clear how many borrowers are still repaying the lender.",
    "Some defunct schools cited in the states’ Navient settlement, including ITT and the Marinello Schools of Beauty, are already covered by the program.",
    "Millions of borrowers who have defaulted on their federal student loans will also get a fresh start and have their loans restored to good standing.",
    "President Biden pushed the restart date for federal student loan payments to Sept. 1, extending a pause put in place at the start of the pandemic.",
    "Borrowers who are covered by the deal — generally those who were overdue for at least seven consecutive months before June 20, 2021 — were elated.",
    "She has struggled to put her degree to use and now works as a digital marketing director in Muncie, Ind., where her paycheck stretches further.",
    "“Our position that these allegations are baseless and without merit has remained unchanged since these cases began nine years ago,” he said.",
    "They will have to keep paying Navient, often for a decade or more, for private loans that state officials said should never have been made.",
    "One internal Navient email cited in court documents described the private loans as a “baited hook” to reel in more government-backed loans.",
    "By using its private loans to help schools cover that gap, Navient ensured a steady supply of borrowers for its government-backed loans.",
    "“But when you get into the details, it’s not actually helping many people.”\nThe state officials who struck the deal stand by it.",
    "“A lot of state court judges are not gong to be sympathetic to allegations that the loan was used to attend a predatory school.",
    "Mr. Revezzo, who lives in Natick, Mass., picked the school because it promised that employers were eager to hire its graduates.",
    "One recruiter finally leveled with him: The school had a terrible reputation, and Mr. Revezzo’s skills couldn’t get him hired.",
    "She has kept paying her private loan bill because she doesn’t want to put her mother, who co-signed the loan, on the hook.",
    "Some have paid off or refinanced their loans, and Navient declined to say how many loans it still holds from that period.",
    "Matthew Revezzo, 32, took government-backed and private loans in 2007 to finance his bachelor’s degree in graphic design.",
    "For years, Mr. Revezzo worked seven days a week, adding evening and weekend shifts at a supermarket to his day job.",
    "He now makes enough to skip the second job, but he is still holding off on medical care he needs but can’t afford.",
    "Then she read the fine print: People like her who made their payments on time were disqualified from the relief.",
    "Borrowers who want those wiped out can pursue their own litigation against Navient, though their odds are slim.",
    "The settlement should never have been necessary at all, added Paul Hartwick, a Navient spokesman.",
    "“I am going to sleep better,” one borrower, Ashley Hardin, told The New York Times last month.",
    "The true value of the debt it forgave, the company told its investors, was just $50 million.",
    "“Our most complete and successful year ever,” said Jack Remondi, Navient’s chief executive.",
    "The intention is to force schools to prove that they can attract other sources of support.",
    "Four years ago, he refinanced his two most expensive Navient loans with another lender.",
    "And Navient didn’t have to compensate borrowers who stayed current on their payments.",
    "The settlement was portrayed as a win-win for 39 states and the loan giant Navient.",
    "Their remaining Navient private loans, averaging nearly $26,000, will be canceled.",
    "The $1,100 he pays each month for his private loans is roughly equal to his rent.",
    "Being excluded from the Navient settlement was “infuriating,” Mr. Revezzo said.",
    "He kept the most affordable one: $13,000 at nearly 11 percent interest.",
    "“Otherwise, I would have strategically defaulted,” Ms. Linssen said.",
    "But thousands who received predatory loans will still have to pay.",
    "Last month, Navient reported a profit of $717 million for 2021.",
    "He added, “It was a year where we exceeded all of our goals.”",
    "But Navient never expected to be repaid much of that money.",
    "Both schools collapsed after state and federal crackdowns.",
    "“I know people who have defaulted and are now past it.",
    "Some of the schools even subsidized Navient’s losses.",
    "But borrowers who were left out have few options.",
    "But that system does not cover private loans.",
    "But every application ended in rejection.",
    "“It’s incredibly unfair,” she said.",
    "“I was floored,” Mr. Revezzo said.",
    "The cost of private loans.",
    "They don’t have the debt.",
    "Payments delayed again.",
    "Companies step in.",
    "“I had a degree."
  ]
}