{
  "id": 4701,
  "mediaId": 2740,
  "date": "2022-02-22",
  "headline": "What can the Colts get in a trade in exchange for Carson Wentz? NFL history offers insight",
  "image": "https://www.gannett-cdn.com/presto/2022/01/09/PIND/7fa4f8d7-b3a1-4eb6-8274-1491111c569d-220109_Colts_at_Jags_RS001.JPG?crop=2399,1350,x0,y140&width=2399&height=1350&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/sports/nfl/colts/2022/02/22/indianapolis-colts-quarterback-carson-wentz-nfl-football-trade-value/6895309001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatodaycomnfl-topstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nat Newell",
  "authorUrl": "https://www.indystar.com/staff/2646726001/nat-newell/",
  "termIds": [
    1509,
    1989,
    3931,
    3977,
    4395,
    184,
    308,
    496
  ],
  "sentences": [
    "Josh Rosen from Arizona to Miami for a 2019 second and 2020 fifth\nRosen was awful as a rookie (66.7 passer rating) and the Cardinals were taking Kyler Murray, but Rosen had just been selected 10th in the draft and he cost you almost nothing -- $1,279,898 -- so the Dolphins were able to talk themselves into giving up a second-rounder for him.",
    "MOST RELEVANT TRADES\nTeddy Bridgewater from Carolina to Denver for a 2021 sixth-round pick\nThe Panthers acquired Sam Darnold and it was clear they needed to move on from Bridgewater after a superficially successful season (92.1 passer rating, 15 TDs, 3 interceptions, though he was 4-11 as a starter).",
    "LESS RELEVANT TRADES\nSam Darnold from the Jets to Carolina for a 2022 second, 2022 fourth and 2021 sixth\nYou could still talk yourself into Darnold as a promising quarterback (much like Wentz prior to last season) because he was playing for the Jets.",
    "Bradford was more highly regarded than Wentz -- the Eagles were planning to start him prior to Wentz's emergence -- and played well in Minnesota, leading the NFL by completing 71.6% of his passes with 20 TDs, 5 INTs and a 99.3 rating.",
    "Joe Flacco from Baltimore to Denver for 2019 fourth\nFlacco was mediocre in Baltimore in 2018 (12 TDs, 6 INTs, 61.2%, 84.2 passer rating) at the age of 33 AND was owed $18,500,000, but the Ravens still got a fourth-rounder for him.",
    "Tyrod Taylor from Buffalo to Cleveland for a 2018 third\nTaylor posted a 22-20 record as a starter for the Bills (who had just drafted Josh Allen) though his statistical profile was merely solid (92.5 rating, 51 TDs, 16 INTs).",
    "PARTIALLY RELEVANT TRADES\nSam Bradford from Philadelphia to Minnesota for a 2017 first and 2018 fourth\nWith Wentz demonstrating he was ready to start as a rookie, the Eagles were looking to unload Bradford.",
    "Teddy Bridgewater and a 2019 sixth from the Jets to New Orleans for a 2019 third\nThe Saints were looking for a backup, making this trade less relevant, and Bridgewater was only owed $6 million.",
    "Looking at recent, relevant (and not so relevant) quarterback trades using Spotrac.com's transaction tracker it's not crazy to think the Colts could get as much as a fourth-rounder for Wentz.",
    "Nick Foles from Jacksonville to Chicago for a 2020 fourth\nGardner Minshew's emergence (and Foles' play) made Foles unnecessary and Chicago brought him in as competition for Mitchell Trubisky.",
    "It should first be noted that Wentz posted a solid 94.6 passer rating with 27 touchdowns and 7 interceptions in 2021, flashing the physical talent that made him the No.",
    "Ryan Fitzpatrick from Houston to the Jets for a 2016 sixth\nFitzpatrick was decent in Houston with 17 TDs and 8 INTs and a career-high 95.3 passer rating in 12 games.",
    "Ryan Tannehill and a 2019 sixth from Miami to Tennessee for a 2020 fourth and 2019 seventh\nThis is the trade the Colts want other teams thinking about.",
    "Tannehill went to the Titans, supplanted Marcus Mariota as the starter and was excellent in 2019 and 2020 before taking a step back last season.",
    "Tannehill put up decent numbers for Miami -- a 92.7 passer rating with 17 TDs and 9 INTs in 2018 -- but was wildly considered a disappointment.",
    "It's also possible for the Colts to renegotiate Wentz's contract, lowering the salary cap hit a bit for his new team.",
    "A different situation but interesting given the Saints were willing to trade a decent pick for a backup quarterback.",
    "Foles wasn't cheap -- $15,625,000 -- so this raises the bar on what the Colts could acquired in exchange for Wentz.",
    "Then was good enough in New York, with 31 TDs, 15 INTs and an 88.0 rating in leading the Jets to a 10-6 record.",
    "When Teddy Bridgewater got hurt, a Vikings team expecting to compete for the playoffs needed a quarterback.",
    "He was owed $4,774,685 last season but the Panthers picked up his fifth-year option for $18,858,000.",
    "Fitzpatrick was cheap (second year of a $7,250,000 deal), so less relevant but an interesting deal.",
    "Tannehill was owed just $2,000,000 in 2019 but then signed a four-year, $118 million deal.",
    "But he had a nearly identically bad season in 2021 (59.9%, 9 TDs, 13 INTs, 71.9 rating).",
    "With $28 million owed and reports swirling they won't bring him back, it seems unlikely.",
    "But the Jets were looking to move him after drafting Darnold and landed a third-rounder.",
    "But he also wasn't cheap, having just signed a two-year, $36 million contract.",
    "Taylor wasn't cheap at $16,000,000 so another point in the Colts' favor.",
    "He didn't get any better in Denver (85.1 rating) and is now a backup.",
    "Taylor was awful with the Browns (49.4%, 64.5 rating), however.",
    "(Miami would replace him with Josh Rosen and Ryan Fitzpatrick).",
    "NFL teams have talked themselves into trading for worse.",
    "You can dream on this return but it seems very unlikely.",
    "And he still only brought a sixth-round pick back.",
    "The Browns were looking for a placeholder for No.",
    "But NFL history tells a different story.",
    "Bridgewater was owed $4,415,000.",
    "1 overall pick Baker Mayfield.",
    "The biggest difference?",
    "2 pick in 2016."
  ]
}