{
  "id": 4719,
  "mediaId": 2584,
  "date": "2022-02-22",
  "headline": "Fitzpatrick and Knight lead biggest GB Winter Paralympic team since 1994",
  "image": "https://i.guim.co.uk/img/media/44f888ffaa76e4de00b295461492dd3e9a16243b/0_119_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8b0148b551fc18105607032630365dc1",
  "link": "https://www.theguardian.com/sport/2022/feb/22/fitzpatrick-and-knight-lead-biggest-gb-winter-paralympic-team-since-1994",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul MacInnes",
  "authorUrl": "https://www.theguardian.com/profile/paulmacinnes",
  "termIds": [
    0
  ],
  "sentences": [
    "I’m super excited to travel to China as part of such an incredible team of athletes representing Great Britain.”\nThe Nordic skiing team will be five strong, a sign of increased strength after Scott Meenagh became the first British athlete to compete in the class for 20 years in Pyeongchang.",
    "The ParalympicsGB chef de mission, Phil Smith, said: “We are looking forward to using Beijing to build on the success of the past two Paralympic Winter Games and further enhance our reputation as an emerging winter sport nation.”",
    "Fitzpatrick, who won four medals in Pyeongchang four years ago, including one gold, to become Britain’s most decorated winter para-athlete, will be joined by double-silver medallist Knight in the Alpine ski team.",
    "“The last two years have been disrupted due to injury and the pandemic and, with uncertainty about whether the Games would go ahead, let alone the qualification process, to have a seat on that plane is amazing.",
    "ParalympicsGB finalised their numbers for the Games that begin on 4 March by adding Alpine, Nordic skiing and snowboard athletes to five wheelchair curlers already selected.",
    "Menna Fitzpatrick and Millie Knight are to lead the biggest British Winter Paralympic team in nearly 30 years, as the final places for Beijing were confirmed on Tuesday.",
    "Meenagh returns for Beijing alongside fellow British forces veteran Steve Arnold and Callum Deboys in the biathlon and cross-country events.",
    "“It’s a huge honour to be selected to represent ParalympicsGB again, and I can’t wait to get out there and get started,” Fitzpatrick said.",
    "Fitzpatrick and Knight will be joined in the visually impaired class of alpine skiing by debutant Neil Simpson, as well as their guides.",
    "Steve Thomas will appear in a sixth Paralympic Games, having competed in sailing and ice hockey previously, racing cross-country.",
    "Hope Gordon, meanwhile, is set to become Britain’s first ever female Nordic Paralympian, by competing in the cross country.",
    "In the sitting class there will be three athletes competing at their first Games, Shona Brownlee, Alex Slegg and Dan Sheen.",
    "Finally, James Barnes-Miller and Owen Pick lead the snowboard team along with debutants Ollie Hill and Andy MacLeod.",
    "It brought the total number of athletes to 25, the biggest group since Lillehammer in 1994.",
    "James Whitley will compete at his third games in the standing class.",
    "She has already represented Britain in para-canoeing."
  ]
}