{
  "id": 4756,
  "mediaId": 2584,
  "date": "2022-02-20",
  "headline": "What is the Suisse secrets leak and why are we publishing it?",
  "image": "https://i.guim.co.uk/img/media/3acb9230e63ef3c71f1ea51d0f7b17b1ff6a83ca/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=64d3da913422ad6593b114a7d4759780",
  "link": "https://www.theguardian.com/news/2022/feb/20/suisse-secrets-leak-financial-crime-public-interest",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Lewis",
  "authorUrl": "https://www.theguardian.com/profile/paullewis",
  "termIds": [
    1869,
    2051,
    2199,
    277,
    5337
  ],
  "sentences": [
    "“The right to privacy cannot be used as grounds to restrict the right of the media to publish information that may be of public interest.”\nWhile far-fetched, the possibility that Switzerland’s prosecutors might use its banking secrecy statute to criminalise journalists led to the decision to protect Swiss media outlets from such a scenario by excluding them from the consortium investigating the leaked data.",
    "“I can say very clearly that international law gives journalists the right to publish information that is in the public interest, and financial or banking information can fall into that category, for instance if it concerns public personalities,” she said.",
    "The UN special rapporteur on the promotion and protection of the right to freedom of opinion and expression, Irene Khan, told a reporter in the consortium of journalists investigating Credit Suisse that she was assessing article 47.",
    "Journalists who try to expose them risk criminal proceedings for doing so.”\nFor media outside of Switzerland, including the Guardian, the country’s radical banking secrecy law was also a consideration, albeit a less direct one.",
    "Banking secrecy is an issue of global public interest that can have a profound impact on the world’s poorest\nIn popular culture, there is nowhere safer to stash your cash than the vault of a Swiss bank.",
    "The recipients of the leak – Frederik Obermaier and Bastian Obermayer – are the award-winning investigative reporters behind the massive offshore leaks that led to the Panama and Paradise papers.",
    "When Switzerland began requiring its banks to share client data with some foreign authorities under a global exchange system to combat tax evasion in 2018, it was heralded as a watershed moment.",
    "The country has nurtured, codified and even advertised the discretion of its bankers for centuries, enjoying lucrative returns as wealthy elites flocked to the Alps to stockpile their riches.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "However, decades of scandals have made clear that Swiss banks generally – and Credit Suisse in particular – have attracted illicit funds from tax evaders, kleptocrats and money launderers.",
    "“This law is a massive restriction of press freedom in Switzerland,” said Arthur Rutishauser, the editor-in-chief of Tamedia, which would have been a logical Swiss partner in the project.",
    "Any such move would be considered a brazen attack on free expression, not least in a country such as Switzerland, which is among the top 10 countries in the World Press Freedom Index.",
    "The 30,000 Credit Suisse clients in the leaked data include customers who have done nothing wrong and have an entirely reasonable expectation of privacy in their financial affairs.",
    "Perversely, Swiss citizens wanting to read how the country’s second-largest lender provided services to corrupt leaders and money launderers can do so only via the foreign press.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "There are legitimate reasons why some Credit Suisse clients might want an offshore account, and it is not illegal to have one – assuming it is declared to the tax authorities.",
    "As James Bond quipped in The World Is Not Enough: “If you can’t trust a Swiss banker, what’s the world come to?”\nSwitzerland dismisses such stereotypes as lazy and outdated.",
    "Swiss banks do share client data with many countries, but many developing nations are excluded from the global exchange system set up to combat tax evasion and fraud.",
    "The wording is sufficiently vague that an overzealous prosecutor might think about using it against a journalist exposing wrongdoing by a Swiss bank or its clients.",
    "It was among many factors considered when we weighed the public interest case for reviewing the leaked data – and, more recently, decided to publish some of it.",
    "When an anonymous source leaked the Credit Suisse data to Süddeutsche Zeitung, Germany’s largest broadsheet newspaper, they knew exactly what they were doing.",
    "Months of painstaking reporting have unearthed evidence that Credit Suisse had clients involved in torture, drug trafficking, money laundering and corruption.",
    "Support independent investigative Guardian journalism\nBecome a digital subscriber and get something in return for your money\n… we have a small favour to ask.",
    "In leaking the data to them, the source appears to have made a moral choice to circumvent what they said were Switzerland’s “immoral” banking secrecy laws.",
    "Their data was never of interest to investigative journalists focused on exposing wrongdoing and contributing to public debate about the banking system.",
    "In other cases, the data raises questions about unexplained wealth, or whether Credit Suisse asked basic questions about the origin of a client’s funds.",
    "On one side: personal issues of privacy, confidentiality and data protection, and a Swiss banking secrecy law that could be used to censor reporting.",
    "Since 2015, the law could theoretically be applied to any third party who “reveals” or “exploits” a secret that has come from within a Swiss bank.",
    "There were more than 160 reporters from 48 media outlets involved in the Suisse secrets project – but none of them were in Switzerland.",
    "Not that long ago Switzerland strengthened its banking secrecy law, which had originally applied only to bankers and other insiders.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "From thrillers to spy novels, Swiss bankers are depicted as discreet men in suits who know which questions not to ask.",
    "Meanwhile, Switzerland’s famed banking secrecy law – article 47 of the 1934 Federal Law on Banks – remains in force.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "Some were allowed to open bank accounts years after they had been convicted for serious financial crimes.",
    "When it involves corruption in the developing world, the impact on the world’s poorest can be profound.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "But its reputation as one of the premier tax havens has not come out of nowhere.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "This was not a dump of data on the darknet or a sale to the highest bidder.",
    "Credit Suisse response to Suisse secrets disclosures available here.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "Deciding to publish these stories has been a balancing exercise.",
    "Financial crime is a serious issue of global public interest.",
    "Over the past decade, however, things have started to change.",
    "Those who fall foul of it risk a five-year prison sentence.",
    "On the other: the public’s right to know about wrongdoing.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "Some even called it the end of Swiss banking secrecy.",
    "Our reporting suggests that conclusion was overblown.",
    "But it is not outside the realms of possibility.",
    "“The law can protect criminals and their assets.",
    "If there were ever a time to join us, it is now.",
    "And our duty to reveal it.",
    "Thank you.",
    "?"
  ]
}