{
  "id": 4764,
  "mediaId": 2523,
  "date": "2022-02-15",
  "headline": "Post-Super Bowl LVI NFL Power Rankings Entering 2022 Offseason",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/502/283/hi-res-0bfe0cbb2ad05993478cb46e7c2cec01_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2953359-post-super-bowl-lvi-nfl-power-rankings-entering-2022-offseason",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NFL Staff",
  "authorUrl": "https://bleacherreport.com/users/648de6de-6391-4348-b8ac-38da77fb1746",
  "termIds": [
    0
  ],
  "sentences": [
    "Jones was smiling when he said that, and the Cowboys appear to have everything on paper to contend again in 2022—an excellent quarterback in Dak Prescott, an offense loaded with talent, one of the league's best offensive lines and a defense that sports the reigning Defensive Rookie of the Year in linebacker Micah Parsons.",
    "\"In addition to Brady's retirement, the Buccaneers could lose several key contributors in free agency such as running backs Leonard Fournette and Ronald Jones II, wideout Chris Godwin, tight end Rob Gronkowski, center Ryan Jensen, edge-rusher Jason Pierre-Paul, defensive tackle Ndamukong Suh and cornerback Carlton Davis.",
    "Thanks to over 2,100 scrimmage yards from young running back Jonathan Taylor and the defensive prowess of players like linebacker Darius Leonard and defensive tackle DeForest Buckner, all the Colts needed was a victory over the lowly Jacksonville Jaguars to advance to the postseason.",
    "Left tackle Ronnie Staley (ankle) sat out all but one game, wideout Rashod Bateman, a 2021 first-rounder, missed the first five outings while recovering from core-muscle surgery and quarterback Lamar Jackson missed five contests (non-COVID-19 illness and ankle injury) as well.",
    "But the biggest question surrounding the Bears in the wake of Eberflus’ hiring is the development of young quarterback Justin Fields, which will be overseen by new offensive coordinator Luke Getsy, who was the Packers’ quarterbacks coach and passing game coordinator.",
    "In 2022, much more roster attrition is likely—especially with key contributors in wide receiver Chris Godwin, center Ryan Jensen, running back Leonard Fournette, cornerback Carlton Davis, safety Jordan Whitehead and right guard Alex Cappa all set to hit free agency.",
    "\"He's done them before in his career, and I'm just looking forward to getting to know him—how he learns the best, what he does, and how we put this thing around him the best way we can to help him be successful and help our team ultimately achieve our goals.\"",
    "The Rams went all-in on winning the Super Bowl in 2021, adding veterans like Stafford, wide receiver Odell Beckham and edge-rusher Von Miller to a team that included players like defensive tackle Aaron Donald and 2021 Offensive Player of the Year Cooper Kupp.",
    "Much like his longtime quarterback, Belichick certainly appeared to have plenty left in the tank last year—after missing the postseason in 2020, and with a rookie quarterback at the helm in Mac Jones, Belichick led the Pats to 10 wins and a playoff spot.",
    "\"But the much more likely scenario is that Hurts is the Eagles' starter again in 2022, and while he could improve with another offseason under his belt, Hurts just doesn't appear to have the ceiling as a passer to lead this team on a deep playoff run.\"",
    "In spite of injuries that blasted the team on offense (including the loss of star running back Derrick Henry for a big chunk of the season), the Titans captured the NFC South, won 12 games and secured home-field advantage throughout the AFC playoffs.",
    "Unless the Titans upgrade at the position in the offseason (which isn't especially likely), they will be in the same boat in 2022 they were in 2021—a division favorite with precious little margin for error against the big dogs in the playoffs.\"",
    "But the far more likely scenario is Mayfield returning for the final season of his contract while the Browns focus their draft capital and cap space on improving the defense and the passing-game weapons around the first pick in the 2017 draft.",
    "That extension is going to have a massive impact on the rest of Baltimore's offseason—with less than $9 million in cap space, DeCosta has some financial wrangling ahead of him if the Ravens are going to be any kind of player in free agency.",
    "After firing head coach David Culley despite his doing a relatively admirable job with arguably the league's worst roster, the team embarked on a meandering search for a new coach before finally promoting defensive coordinator Lovie Smith.",
    "\"Through the pain of transition, the Bears could flourish because they have two things other teams, particularly those counted among the league's bottom-feeders, don't: a potential franchise quarterback in Fields and a top-10 defense.",
    "\"When you develop from within, you draft well, you select the right free agents, you build a culture you believe in, you stay with continuity ... and you don't fall to peer pressure, you end up reaping the benefits of your patience.\"",
    "When asked at the Pro Bowl by NFL Network's Cameron Wolfe about where he wants to play, Wilson said, \"Hopefully I get to play in one place like that for a long, long time like this those guys [Tom Brady and Ben Roethlisberger] did.\"",
    "The Raiders' new regime can push the Silver and Black further in the postseason while posing a legitimate threat to the Kansas City Chiefs' reign over the AFC West or pull the team back a couple of steps because of all the changes.",
    "Trevor Lawrence's first season as the team's quarterback was a mess, as he completed less than 60 percent of his passes, recorded five more interceptions than touchdown passes and threw four touchdown passes total from Week 9 on.",
    "And in the biggest surprise of all, Joe Burrow and the Cincinnati Bengals went from a four-win cellar-dweller in 2020, to 10 wins in 2021, an AFC North crown and a run all the way to Los Angeles and a berth in the Super Bowl.",
    "Still, even if Cousins does stick around (and recent reports indicate he will), Minnesota has to do something about his $45 million cap hit—a hit that leaves Minnesota over $15 million over the projected salary cap for 2022.",
    "Given an uneven 2021 season, a $28.3 million cap hit next season and the fact that the Wentz trade cost Indy its first-round pick in the 2022 draft, there has been speculation that Wentz could be one-and-done with the Colts.",
    "Miami Dolphins\nThere's rather a lot going around surrounding the Miami Dolphins right now, and the team's offseason may well be dominated by storylines that have little to do with the team that will take the field in 2022.",
    "Shane Day (Chargers quarterbacks coach), Joe Lombardi (Chargers offensive coordinator) and I, we're going to spend a lot of time together talking about the offense, talking about footwork, drops, throws, all those things.",
    "\"When ya'll hear what sounds like—over these Los Angeles hills—when you think they got one of these mountain lions with its tail caught,\" Jones said, \"that's me screaming into my pillow for not being in that Super Bowl.\"",
    "There has been no shortage of skepticism regarding Derek Carr's viability as a franchise quarterback for the Raiders—skepticism that existed long before last year and continues even after Las Vegas' playoff appearance.",
    "The late-season collapse should be enough concern, but it's only the starting point because the relationship between franchise quarterback Kyler Murray and the rest of the organization appears to be on the rocks.",
    "McDaniel inherits a team with talent on both sides of the ball—wide receiver Jaylen Waddle just set a new record for receptions by a rookie, while Miami's defense possesses talented players at all three levels.",
    "Meanwhile David Tepper, proud as billionaires tend to be, has shown no willingness to admit he got duped by Rhule during the hiring process, and has instead chosen to vanish at a time fans are wanting answers.",
    "But given Bills Mafia's history and the history of the Buffalo Bills, the things that that city has had to endure, the 17-year (playoff) drought, we know about the stuff before that, I won't even mention it.",
    "Frankly, given all the injuries the team had under center and the absence of star wideout Michael Thomas for the entire season, a nine-win season was arguably one of Sean Payton's better jobs as head coach.",
    "\"There will be no shortage of Eagles fane clamoring for Howie Roseman to throw all that draft capital the Eagles have at Seattle or Green Bay in an effort to land a big name at quarterback,\" Davenport said.",
    "But while the Colts have a fair amount of cap space, the $15 million dead cap hit Indy would eat for releasing Wentz would be a tough pill to swallow...especially with no clear Plan B currently in place.",
    "\"But the Bolts need to find a way to be more consistent, and with players like wideout Mike Williams and linebacker Kyzir White slated for free agency, there are some tough personnel decisions looming.\"",
    "\"Unless the Buccaneers acquire a veteran quarterback, they will drop from a Super Bowl contender that just won the NFC South title to a club set to pick in the top five for the 2023 draft,\" Moton wrote.",
    "But despite all the near-misses (and this year's collapse at home against the Bengals), head coach Andy Reid said he remains optimistic that the good times will keep rolling in Kansas City for a while.",
    "There's going to be plenty said (and written) about Denver's interest in any number of signal-callers, whether it's veterans like Aaron Rodgers or Russell Wilson or one of this year's rookie class.",
    "Yes, the Bengals came up short against the Los Angeles Rams in Super Bowl LVI, but this was a team that was pegged as a last-place squad by a lot more people than as a potential playoff contender.",
    "The 2021 season certainly didn't end the way the team wanted, but the fact the Bengals have jumped over 20 spots from the start of the season stands as a testament to just how far they have come.",
    "New England Patriots\nWith Tom Brady hanging them up after the 2021 season, it's only natural that some would question whether the other half of New England''s dynastic duo might soon follow suit.",
    "But the second half was a much different story—Patrick Mahomes struggled mightily, Kansas City blew a 21-3 lead and the Cincinnati Bengals wound up representing the conference in Super Bowl LVI.",
    "Indy's defense faltered, quarterback Carson Wentz played arguably his worst game of the season, and the Colts were thumped in Jacksonville and wound up watching the playoffs from their couches.",
    "There's a new head coach in town in former Eagles head coach Doug Pedersen, and Lawrence told reporters he's looking forward to working with the coach who led Philly to a win in Super Bowl LII.",
    "That streak isn't going to be easy to maintain in 2022—in no small part because this will be the first time Tomlin ever entered a season without Ben Roethlisberger as his starting quarterback.",
    "Rams wide receiver Cooper Kupp paced the league in receptions, receiving yards and touchdown catches, winning Offensive Player of the Year honors before going on to become Super Bowl LVI MVP.",
    "The bad news is that was 15 years ago, and Smith hasn't posted a winning record as a head coach since 2012, which spans two NFL seasons with Tampa Bay and five college seasons with Illinois.",
    "\"Before the 2021 season started, the Baltimore Ravens lost multiple key players in running backs J.K. Dobbins and Gus Edwards and cornerback Marcus Peters, who tore their ACLs,\" Moton said.",
    "As dominant as the Chiefs have been in recent years—six straight AFC West titles and four consecutive trips to the AFC Championship Game—the team only has one Super Bowl win to show for it.",
    "In fact, this season was in some ways the most frustrating of the lot—Green Bay was eliminated in the Divisional Round by the San Francisco 49ers in a moribund performance at Lambeau Field.",
    "Sources told ESPN's Chris Mortensen that Murray is 'self-centered, immature and a finger-pointer,' while the quarterback believes the team framed him as the scapegoat for the playoff loss.",
    "But it's plainly evident that Taylor Heinicke isn't any kind of long-term answer, and Ryan Fitzpatrick is a free agent after getting hurt in his first game as the team's starter last year.",
    "We had numerous discussions with countless coaches, executives, and players, and what revealed itself is that Lovie has both the leadership and people skills it takes to lead us forward.\"",
    "But as Peter King reported for NBC Sports, new head coach Nathaniel Hackett indicated that he hasn't ruled out rolling into the season with Teddy Bridgewater or Drew Lock as his starter.",
    "\"The entire offseason will devolve into a discussion about how the Browns can either A) build around their quarterback in hopes of maximizing his lost potential or B) replace Mayfield.",
    "But improving the league's seventh-worst scoring defense and fifth-worst offensive line are significant priorities that are more readily repaired than a mythical upgrade under center.\"",
    "It's a negotiation complicated by the fact that Jackson has no agent, but Ravens GM Eric DeCosta expressed confidence while speaking to the team's website that a deal will get done.",
    "The other question: How smart was it to match a first-time head coach with a first-time general manager (Ryan Poles) when there were more experienced coaching candidates available?\"",
    "Yes, DeAndre Hopkins' injury played a part in Arizona's late-season slump, but this also marks the second consecutive season that the Cardinals have fallen apart down the stretch.",
    "Green Bay Packers quarterback Aaron Rodgers won his second consecutive MVP award, but it was a bittersweet award after the Pack were unceremoniously bounced from the postseason.",
    "\"But unless Wilson is absolutely hell-bent on leaving Seattle, I have a hard time imagining a team making an offer good enough for the Seahawks to effectively blow up the team.",
    "Chicago Bears\nThe Bears gave up quite a lot to land quarterback Justin Fields in last year's draft, and now it will fall to a new regime to develop the former Ohio State star.",
    "But the Giants are also over $10 million in the red against the salary cap and have to do something to bolster the league's third-worst offensive line, per Pro Football Focus.",
    "… We're going to explore all avenues to try to make the best decision we can for the organization.”\nQuarterback may be Tampa's biggest problem, but it's hardly the only one.",
    "And given Hackett's connections to the Green Bay Packers, the grumbles we've heard about Aaron Rodgers joining the Broncos in the offseason aren't going away any time soon.",
    "The 36-year-old is much closer to the end of his career than the beginning, but team owner Arthur Blank said via the team's website that he expects Ryan to be back in 2022.",
    "It was Tepper’s call to hire Rhule without a GM being in place, so the blame falls on him, and his ego isn’t allowing him to pull the bandaid off and let this wound heal.\"",
    "However, despite all those issues (and Dennis Allen's 8-28 record as a head coach), he told reporters that he doesn't envision 2022 as a rebuilding season in the Big Easy.",
    "And if that wasn't bad enough, there could be offseason drama coming after Murray and the team took turns taking (perceived) social media jabs at one another on Instagram.",
    "But thanks to three losses over the last four weeks of the season (including an overtime loss to the rival Raiders in Week 18), the Bolts came up short of the postseason.",
    "So we’re just looking for help a little bit of everywhere.”\nWith the second overall pick in this year's draft, the Lions should be able to add at least one impact player.",
    "We set ourselves up to protect the quarterback; now you've got playmakers around him, so let's see if we can find that [QB] and plug that guy in and see what happens.\"",
    "The Insta-beef is probably, in the words of William Shakespeare, full of sound and fury, signifying nothing—posturing by a quarterback angling for a massive extension.",
    "In April, the Niners made a bold play with eyes firmly planted on the future at the quarterback position, selecting quarterback Trey Lance after trading up for the No.",
    "But after the Seahawks pitched and lurched their way to a 7-10 season, there has been rampant speculation that Russell Wilson's time with the team is coming to an end.",
    "But as Karen Guregian reported for the Boston Herald, despite his 70th birthday approaching Bill Belichick has given no indication that he's near the end of the line.",
    "But thanks in no small part to injuries that decimated the team from training camp right on through Christmas, the Ravens posted their fewest wins (eight) since 2016.",
    "There are at least resources with which to address those needs—no team in the NFL has a larger cap-space war chest than the $63.8 million the Dolphins are sitting on.",
    "\"Wilson threw for nine touchdowns and 11 interceptions in 13 games with a 55.6 percent completion rate and showed minimal progress once he returned from a PCL injury.",
    "As a second-year pro and first-time full-time starter, Lance just needs to avoid costly turnovers while Elijah Mitchell and Deebo Samuel move the ball on the ground.",
    "Arizona limped into the playoffs losers of four of five and was blown out by the Rams in one of the ugliest playoff performances from a quarterback in recent memory.",
    "Detroit Lions\nWhen Dan Campbell was hired as head coach of the Detroit Lions, he pledged that his team would be a hard-nosed squad that would \"bite a kneecap off.\"",
    "As the offseason journey begins, we have gathered Bleacher Report NFL Analysts Brent Sobleski, Maurice Moton and Gary Davenport to slot the league's teams from No.",
    "Per Judy Battista of NFL.com, the importance of developing Fields makes it a bit curious that the Bears went the defensive route with new head coach Matt Eberflus.",
    "Philadelphia Eagles\nThanks to the NFL's most run-heavy offense and four wins in five games to close out the 2021 season, the Philadelphia Eagles made the playoffs.",
    "But then Lance spent the vast majority of his rookie season holding a clipboard, watching as Jimmy Garoppolo led San Francisco to within a game of Super Bowl LVI.",
    "The Vikings were the last team to fill their vacancy, eventually settling on a philosophy shift by hiring Los Angeles Rams offensive coordinator Kevin O'Connell.",
    "And for the second time in as many seasons, the Browns wiped out, stumbling their way through an injury-marred 8-9 season and missing the postseason altogether.",
    "\"There's a lot of things to like about Daniel, and we'll just take it one day at a time, we'll work with him, we'll help him get better,\" Daboll told reporters.",
    "\"The Chargers have shown the potential to be a Super Bowl contender, including wins over Kansas City and Cincinnati during the regular season,\" Davenport said.",
    "Yet they're headed in a new direction as general manager Dave Ziegler and head coach Josh McDaniels take over for Mike Mayock and Rich Bisaccia, respectively.",
    "And as Bills quarterback Josh Allen told The Jim Rome Show, he has already turned his focus toward the future—and bringing Buffalo its first Super Bowl win.",
    "\"I've been with a lot of different quarterbacks,\" Hackett said, \"and they always know I'll put them in position to excel, and I'll always have their backs.\"",
    "Whether you believe that Brian Flores' performance was good enough for him to keep his job, the reality is that Mike McDaniel is the team's head coach now.",
    "\"To be the best at something, obviously, it takes a whole lot of preparation, a lot of skill, a lot of guys coming together to accomplish one single goal.",
    "If he builds chemistry with Samuel, George Kittle and Brandon Aiyuk in the passing game, the 49ers will have a potent multidimensional offensive attack.",
    "\"Garoppolo's probable departure isn't a tremendous blow to the San Francisco 49ers because Kyle Shanahan's offense centers around an effective run game.",
    "While the new duo can bring what they learned with the Buffalo Bills, they have a lot to address, starting with how to maximize Daniel Jones' potential.",
    "And the front office dynamic between Caserio, executive vice president of football operations Jack Easterby and CEO Cal McNair is like a bad telenovela.",
    "Pittsburgh Steelers\nIn all his years as the head coach of the Pittsburgh Steelers (15, if you're counting), Mike Tomlin has never had a losing season.",
    "The front office must decide on Cousins' future due to his $45M cap hit, but many coaches interviewing for the job liked Cousins, O'Connell included.\"",
    "\"I think there's plenty of things we can go back and look at and say, 'You know what, I could have done this better or I could have done that better.'",
    "That performance has led to Tannehill being criticized roundly, but Henry said that the veteran quarterback isn't solely to blame for the early exit.",
    "But it's equally difficult to imagine the Steelers as a legitimate contender with Mason Rudolph or Dwayne Haskins as the team's starting quarterback.",
    "But if the Commanders roll into 2022 with Heinicke or another mediocre option under center, another year as a seven- or eight-win also-ran is likely.",
    "In short, the Falcons have a lot of work to do—and with the team upside down against the salary cap, they are short on resources with which to do it.",
    "Tampa Bay Buccaneers quarterback Tom Brady led the league in passing yards at the age of 44—and then stunned the league by announcing his retirement.",
    "And the team is hopeful that newly promoted offensive coordinator Ben Johnson will coax improvement from Jared Goff in his second year with the team.",
    "Granted, quarterback play wasn't the only reason Washington struggled in 2021—the team's allegedly star-studded defense disappointed in a major way.",
    "However, as has been the case so many times since Dallas last won the Super Bowl, all that regular-season success amounted to a fat bag of nothing.",
    "For at least part of the 2021 season, the Cowboys appeared headed in that direction—Dallas won 12 games, captured the NFC East and fielded the No.",
    "Las Vegas Raiders\nGiven everything that happened off the field in Las Vegas in 2021, a convincing argument can be made that the team overachieved.",
    "Since then, things have gotten that much more complicated—Colbert will be stepping down after the draft, and his position has not yet been filled.",
    "And as TMZ reported, team owner Jerry Jones wasn't shy about offering his opinion on another year of watching other teams play in the Super Bowl.",
    "What I can say is that Lamar and I have had probably five or six conversations at different points over the last year in regards to his contract.",
    "But as Kevin Clark of The Ringer tweeted, the greatest quarterback in franchise history doesn't think it's time to cut bait on Jimmy G just yet.",
    "And, you know, I've had good conversations with Green Bay and I'll, you know, do some contemplating and then make a decision here pretty quick.\"",
    "But even so, as wild as it sounds, given all that's happening around Atlanta, the Falcons may well enter 2022 as the favorites in the NFC South.",
    "With three first-round picks in April's draft and a decent amount of cap space, Philly is well-positioned to build around Hurts this offseason.",
    "Now for all 32 teams, the focus shifts to Glendale, Arizona, and Super Bowl LVII—to patching holes and getting better ahead of the 2022 season.",
    "\"It’s become apparent that this entire exercise is no longer about winning football games for the Carolina braintrust, it’s about saving face.",
    "\"This is what I grew up on: You have the franchise quarterback, you have to protect him and put playmakers around him,\" Rivera told reporters.",
    "Eberflus should keep the defensive side of the ball performing at a high level, while Poles must concentrate on placing talent around Fields.\"",
    "Seattle Seahawks\nOver the past decade or so, there haven't been many more consistently successful teams in the NFC than the Seattle Seahawks.",
    "But if the Browns can't engineer a significant improvement in 2022, there are apt to be some major changes coming on the shores of Lake Erie.",
    "There's also the matter of third-year quarterback Tua Tagovailoa, who hasn't enjoyed the success of classmates Justin Herbert and Joe Burrow.",
    "Buccaneers general manager Jason Licht said that the team was aware both that this day could be coming and that there's a lot of work to do.",
    "Those same Bills ended New England's season in humiliating fashion in the Wild Card Round, and that game exposed New England's shortcomings.",
    "That disappointing season has led to a surly Browns fanbase tired of losing and ready to move on from embattled quarterback Baker Mayfield.",
    "In a statement by the team, general manager Nick Caserio made it clear he believes Smith is the man to lead the Texans back to contention.",
    "That decision will say more about Green Bay's status entering the 2022 season than every other offseason move the team makes put together.",
    "Los Angeles Rams\nAfter 13 years in the NFL (including a 12-year sentence) in Detroit, Matthew Stafford finally won a playoff game in 2021.",
    "Miller and Beckham (who suffered a knee injury in the first half of the Super Bowl) are among numerous key players set to hit free agency.",
    "Rhule is desperately hoping something will click, and until then he’s willing to throw anyone under the bus to keep his head above water.",
    "The question is what sort of ceiling a Hurts-led Eagles team might have, even with improved passing game weapons and an upgraded defense.",
    "Even after falling well below expectations, Cleveland still finished 8-9 with a legitimate shot to make the playoffs going into Week 17.\"",
    "Tee Higgins, Tyler Boyd and 2021 Offensive Rookie of the Year Ja'Marr Chase form one of the most potent wide receiver corps in the game.",
    "If Washington can somehow procure a veteran upgrade at the game's most important position, it could pose a real threat in the NFC East.",
    "And when the confetti fell at the end of Super Bowl LVI at SoFi Stadium, the Los Angeles Rams stood as the champions of Super Bowl LVI.",
    "Despite rookie bright spots in running back Michael Carter and wideout Elijah Moore, New York has a lot of work to do this offseason.\"",
    "What concerns fans as the offseason begins is the possibility the team's MVP quarterback may have played his last game with the Pack.",
    "Quarterback Zach Wilson struggled as a rookie, completing just 55.6 percent of his passes with nine touchdowns and 11 interceptions.",
    "But the Lions finished the season 22nd in total offense, 25th in scoring offense, 29th in total defense and 31st in scoring defense.",
    "Second-year quarterback Jalen Hurts played a significant role in that late surge, pacing all quarterbacks in rushing yards with 784.",
    "But the season ended in a disappointing loss in the Divisional Round in which quarterback Ryan Tannehill threw three interceptions.",
    "While appearing on 92.3 The Fan in Cleveland, head coach Kevin Stefanski admitted the fans have at least some reason to be miffed.",
    "\"New York may have made two of the offseason's best hires in new head coach Brian Daboll and general manager Joe Schoen,\" he said.",
    "Cincinnati Bengals\nHeading into Week 1, the Cincinnati Bengals checked into the NFL power rankings here at Bleacher Report at No.",
    "With those players healthy, the Ravens should bounce back and challenge the Cincinnati Bengals for the AFC North title in 2022.\"",
    "Provided those ruffled feathers are smoothed over, the Cardinals have a roster (on paper) capable of contending in the NFC West.",
    "Colts fans may not have that same level of affection, and there are reports that the team plans to move on from the 29-year-old.",
    "\"We were in this situation a couple of years ago where [coach] Bruce [Arians] and I both said we'll have to look behind door No.",
    "The Buccaneers may spend the 2022 campaign developing young players in a rebuild, starting with rookie quarterback Kyle Trask.\"",
    "Per James Dator of SB Nation, there's a common thread running through all these struggles—Rhule is completely out of his depth.",
    "\"I'm assuming that (Wentz) is going to be back,\" Taylor said, \"because I love him in the locker room, I love him on the field.\"",
    "Given what the 49ers surrendered to procure Lance, most believe that Garoppolo is headed out of the Bay Area in the offseason.",
    "Kansas City Chiefs\nFor the first half of the AFC Championship Game, it appeared that Kansas City's hold on the AFC was secure.",
    "How will general manager Joe Douglas and head coach Robert Saleh fix a defense that allowed the most yards and points in 2021?",
    "While coaching at the Senior Bowl, Campbell admitted to reporters that Detroit's roster needs work on both sides of the ball.",
    "And none of that mattered even a little bit—because for the third year in a row, the Pack came up short of the ultimate goal.",
    "In theory, this is a talented team that could be primed for a quick turnaround with a few improvements—especially on defense.",
    "Herbert told CBS Sports' Jeff Kerr that the late swoon left he and his teammates with plenty of work to do in the offseason.",
    "\"Right now things don't seem great because of the loss,\" Reid told reporters, \"but I think the future here is still bright.",
    "But the G-Men just might have the right people in place to properly build around Jones, as they helped do with Josh Allen.\"",
    "Jacksonville Jaguars\nCalling the 2021 season a disaster for the Jacksonville Jaguars is the mother of all understatements.",
    "But there's going to be immense pressure on Getsy, who doesn't have the luxury of coaching Aaron Rodgers this time around.",
    "Head coach Ron Rivera said the Commanders have the talent to make a playoff run if they can find the right signal-caller.",
    "Still, a playoff collapse followed by this kerfuffle is most assuredly not an ideal start to the offseason in the desert.",
    "It's not as much fun, but the most likely scenario is Wilson (and the other big-name quarterbacks) staying put in 2022.\"",
    "So, we look forward to moving on to the 2022 season and getting ourselves built back up after we take a step back here.\"",
    "\"At this point people are looking to find a scapegoat and want to blame someone,\" Henry said, via Jim Wyatt of NFL.com.",
    "It's a phrase that will live in infamy in Western New York, right alongside the \"Music City Miracle\" and \"Wide Right.\"",
    "And the biggest of those questions is the largest issue facing any of the league's top teams from this past campaign.",
    "To say that upgrading Cincinnati's offensive line is a priority this offseason is the mother of all understatements.",
    "By the way, defensive coordinator DeMeco Ryans' coaching stock should continue to rise with his strong front seven.\"",
    "But while appearing on SiriusXM Radio, Taylor said that were it up to him, Wentz will be back for a second go-round.",
    "Whether the Patriots can add more weaponry around the young quarterback while preventing a backslide in other areas.",
    "For his part, Murray took to social media Monday, stating flatly that \"all of this nonsense is not what I'm about.\"",
    "However, 10 wins and a playoff appearance weren't enough to get interim head coach Rich Bisaccia the full-time job.",
    "But the reality is that just about every other AFC heavyweight has something the Titans don't—an elite quarterback.",
    "The number of folks who predicted that the Bengals would represent the AFC in the Super Bowl numbered exactly zero.",
    "At the same time, everyone in and around the organization should be giddy with the overall direction of this squad.",
    "But Hurts also played a big role in the Eagles getting blasted by the Tampa Bay Buccaneers in the Wild Card Round.",
    "\"Eberflus, who has a reputation for being detailed, had emerged from previous cycles as an impressive interviewee.",
    "New York Jets\nThe bad news for the New York Jets is that the team just suffered through another miserable season.",
    "And with less than $5 million in cap space, the team won't likely be big players in free agency,\" Davenport said.",
    "It's one of those things that, if you can keep Jimmy healthy, he plays well enough to get you (to the playoffs).\"",
    "Still, the biggest thing on the offseason to-do list is a potential extension for star quarterback Lamar Jackson.",
    "\"But Kansas City remains an absolutely loaded offensive team led by arguably the best quarterback in the league.",
    "Packers quarterback Aaron Rodgers captured his second consecutive most valuable player award and fourth overall.",
    "Director of player personnel Duke Tobin should dump all of the team's assets into improving the offensive line.",
    "\"We're going to be flooded with stories about Wilson's future in the weeks and months to come,\" Davenport said.",
    "Despite another year of struggles, head coach Robert Saleh preached patience while coaching at the Senior Bowl.",
    "And Minnesota's offensive line showed some improvement in 2021 with the addition of rookie Christian Darrisaw.",
    "\"A 6-11 campaign finally signaled the end of Ryan Pace and Matt Nagy's tenure with the Bears,\" Sobleski said.",
    "And we're gonna play with a passion and an energy that our opponents are either unwilling or unable to match.",
    "It's the rest of the coaches on our staff, it's the scouts, it's the support staff, it's the ownership group.",
    "In Brandon Staley's first year as the team's head coach, Justin Herbert led the AFC with 5,014 passing yards.",
    "Whether it's edge-rusher Joey Bosa or safety Derwin James, the Chargers have some building blocks on defense.",
    "Rodgers said at last week's NFL Honors that he intends to make a decision about his future in Green Bay soon.",
    "Dallas Cowboys\nThe Dallas Cowboys enter every season with one goal and one goal only—winning the Super Bowl.",
    "\"We know what comes with the territory when you have high expectations, and you don't meet that expectation.",
    "New England ranked fourth in the NFL in total defense and trailed only the Buffalo Bills in scoring defense.",
    "There has been an exodus of assistants, whether they were fired by Matt Rhule or left of their own volition.",
    "For the first time in the common draft era (since 1967), the Jets possess a pair of picks in the top 10 (No.",
    "And while Pittsburgh's roster certainly isn't without talent, the offensive line remains a glaring weakness.",
    "Much like the early years of Brady's career, these Patriots are built to win with ball control and defense.",
    "Indianapolis Colts\nThe Indianapolis Colts are probably still trying to figure out where it all went wrong.",
    "\"O'Connell conveyed a firm belief in Kirk Cousins during the interview process, I'm told,\" Fowler tweeted.",
    "The defense wasn't any better—Atlanta was 26th in yards allowed (364.4) and 29th in points allowed (27.0).",
    "Given the Steelers' history of success over the past few decades, it's hard to count them completely out.",
    "\"I enjoy working with [general manager] Kevin [Colbert] this time of year because we speak plain English.",
    "\"I know New York doesn't like to hear it with time and all that stuff, but it is what it is,\" Saleh said.",
    "And that's what the New Orleans Saints are going to be about.”\nTell yourself whatever you need to, Coach.",
    "New Orleans Saints\nTo say that the New Orleans Saints are a franchise in flux doesn't begin to cover it.",
    "Denver Broncos\nThe offseason in Denver is going to be dominated by one storyline and one storyline only.",
    "But as we saw last season, none of that will matter if the Broncos don't get improved play under center.",
    "\"It didn't completely shock us … that this could happen, so we've been preparing,\" Licht told reporters.",
    "Stafford admitted to reporters after the win that it's all a bit surreal that he's now a world champion.",
    "Instead, that gig went to longtime Patriots assistant (and one-time Broncos head coach) Josh McDaniels.",
    "\"The offseason has barely begun,\" Davenport said, \"and Carr has already been traded umpteen times over.",
    "But this team has lots of holes on both sides of the ball and posted the NFL's worst record a year ago.",
    "As reality set in and injuries mounted, the Panthers would win just two more games the rest of the way.",
    "Daboll has confidence that he can turn around the fortunes of beleaguered fourth-year pro Daniel Jones.",
    "Since handing Christian McCaffrey a massive contract, the star running back has missed 23 of 33 games.",
    "Over the first half of the 2021 season, the Cardinals looked like one of the best teams in the league.",
    "\"At one point during the 2021 campaign, the Cardinals looked like the NFL's best team,\" Sobleski said.",
    "In quarterback Joe Burrow, the Bengals have a budding superstar at the game's most important position.",
    "And while Seattle won just seven games a season ago, it won 12 games and made the postseason in 2020.",
    "Justin Jefferson and Adam Thielen are one of the league's more formidable one-two punches at wideout.",
    "A proven winner, Lovie has shown the ability to develop players both on and off the field for years.",
    "But after how the last two seasons ended, the last thing Kliff Kingsbury needs is unnecessary drama.",
    "Decisions to be made on free agents like wide receiver Emmanuel Sanders and cornerback Levi Wallace.",
    "But there are holes in the roster, such as edge-rusher, running back and especially offensive line.",
    "Hurts averaged less than 210 passing yards per game last season and threw just 16 touchdown passes.",
    "For the second time in three seasons, the Cleveland Browns entered a year riding a tsunami of hype.",
    "\"The Jets lost five of their last six games and still have some major question marks,\" Moton said.",
    "Carolina Panthers\nFor a time, it appeared the Carolina Panthers might be on to something in 2021.",
    "But the Bills will enter the 2022 campaign among the favorites to rep the AFC in Super Bowl LVII.",
    "Arizona finished 2-4 after its bye week and easily fell to the rival Rams in the Wild Card Round.",
    "And whether Belichick can make one more run at a ring before his own countdown to Canton begins.",
    "The salary-cap situation in New Orleans is a nightmare—no team in the league is more in the red.",
    "There's a new defensive coordinator in the Steel City, with Teryl Austin replacing Keith Butler.",
    "\"All options are on the table,\" Tomlin told reporters in January about replacing Roethlisberger.",
    "They will be among the top contenders in the AFC again in 2022—and for the foreseeable future.\"",
    "But to give them that Super Bowl, I have vivid dreams of the parade and what it would be like.",
    "Green Bay Packers\nThe Green Bay Packers won 13 games in 2021 for the third consecutive season.",
    "\"But he's also not a great one, and he isn't going to magically morph into one this offseason.",
    "This isn't to say that Vegas should pass on adding Aaron Rodgers if a deal becomes available.",
    "As painful as the end of Buffalo's Divisional Round loss may have been, it's in the past now.",
    "\"That's important to us, that's important to our organization, that's important to our game.",
    "Chicago has no first-rounder in 2022 and a decided lack of offensive weaponry around Fields.",
    "And given the players at his disposal, he isn't likely to post one in Houston any time soon.",
    "No team in the NFC averaged fewer yards per game on the ground than Atlanta's 85.4 in 2021.",
    "Dallas is going to have some financial wrangling to do to get under this year's salary cap.",
    "There's little question that a Wilson trade would reap the Seahawks a bevy of draft picks.",
    "Despite an 0-3 start to the season, the Colts had maneuvered to the brink of the playoffs.",
    "\"I don't think Trey's ready to play yet, myself, and after talking to some of the players.",
    "From all indications, McDaniel is one of the brighter young offensive minds in the league.",
    "There was the occasional bright spot, including a December win over the Arizona Cardinals.",
    "Will edge-rusher Carl Lawson bounce back to pre-injury form after rupturing his Achilles?",
    "The first is the future of quarterback Matt Ryan, who has two years left on his contract.",
    "There isn't a playoff team from 2021 facing more questions than the Tampa Bay Buccaneers.",
    "Combined with the regular season, Burrow was dropped a jaw-dropping 70 times this season.",
    "Los Angeles Chargers\nOn one hand, there's cause for significant optimism in Los Angeles.",
    "But McDaniels told SiriusXM Radio that he's excited to get to work with the 30-year-old.",
    "With that said, if Carr is the starter in 2022, this team should be in the playoff mix.\"",
    "The Jets are also sitting on the fifth-most cap space in the league, per Over the Cap.",
    "No team in the league allowed more yards per game than the 397.6 the Jets surrendered.",
    "\"It's quite a change of pace after years of Pat Shurmur, Joe Judge and Dave Gettleman.",
    "Per ESPN's Jeremy Fowler, O'Connell appears to think he can win with the 33-year-old.",
    "And just the same when they celebrate the victories, that's part of fandom,\" he said.",
    "The future of quarterback Deshaun Watson looms over the franchise like a dark cloud.",
    "Kyler Murray played like an MVP candidate, and the Redbirds hit the bye week at 9-2.",
    "\"On one hand, they're coming off a 10-7 season with a top-10-12 quarterback in Carr.",
    "Donald and offensive tackle Andrew Whitworth are both reportedly mulling retirement.",
    "And you won't often find a 12-win head coach on a shorter leash than Mike McCarthy.",
    "\"[Smith] is one of the most respected coaches in the NFL and an established leader.",
    "But we have no reason to think he won't continue to be playing quarterback for us.\"",
    "Calvin Ridley's uncertain future leaves the Falcons woefully thin at wide receiver.",
    "Assuming that Ryan is back, the focus has to be rebuilding the offense around him.",
    "\"You should have an opinion, you should have criticism when we don't come through.",
    "The Urban Meyer \"era\" was a catastrophe—he won two of 13 games before being fired.",
    "The Browns do need to make significant investments in the wide receiver position.",
    "\"The Bengals were oh so close to capturing the franchise's first title,\" he said.",
    "San Francisco 49ers\nIt was a very interesting season for the San Francisco 49ers.",
    "Tennessee Titans\nIn many respects, the Tennessee Titans had a remarkable season.",
    "\"I think it would mean everything in terms of why I play this game,\" Allen said.",
    "The Eagles (and their 25th-ranked pass offense) went run-heavy out of necessity.",
    "Atlanta Falcons\nThe Atlanta Falcons face a mountain of questions this offseason.",
    "And Cincinnati's revamped defense exceeded expectations in a big way this year.",
    "The team doesn't have the passing-game weapons or quarterback to win shootouts.",
    "Now the question becomes whether Jones can take the next step as a quarterback.",
    "So, it's something I want to happen so badly that I won't stop until we do it.",
    "But the future in the Queen City is the brightest it's been since the 1980s.\"",
    "He's been around the block these last three years with some different pieces.",
    "“Just upgrading in all areas, that’s where we need some help,\" Campbell said.",
    "The Chargers won nine games—the franchise's first winning record since 2018.",
    "But one of our writers sees a rebound season on the horizon for the Ravens.",
    "As bad as that game was, it isn't what has Packers backers upset right now.",
    "We're going to try to give him some stability and just take it from there.\"",
    "I've spoken with him a couple of times, really just impressed by who he is.",
    "\"Our team is going to be smart, and our team's gonna be highly competitive.",
    "After eight seasons as the team's head coach, Mike Zimmer was sent packing.",
    "Until that occurs, the Bengals are behind the Chiefs and Bills on my list.",
    "Baltimore Ravens\nThe Baltimore Ravens aren't used to missing the playoffs.",
    "What the heck does Tampa do at quarterback now that Tom Brady is retired?",
    "Washington Commanders\nIt's a new era of football in the nation's capital.",
    "Last year, the Saints played the first season of the post-Drew Brees era.",
    "Given the results in Charlotte, it's awfully difficult to argue with him.",
    "Still, any improvements in 2022 hinge on Wilson looking more like the No.",
    "But the team's 3-0 start was a mirage born of playing inferior opponents.",
    "It was a season filled with excitement, milestones and surprises galore.",
    "Still, Sobleski expressed a measure of optimism about the team's future.",
    "The Saints' best quarterback last year (Jameis Winston) is a free agent.",
    "To help Jones, the offensive front must be almost completely overhauled.",
    "Pro Football Focus ranked the Falcons offensive line 27th in the league.",
    "Mike Vrabel was rewarded for that success with Coach of the Year honors.",
    "\"I think you keep Jimmy until you find somebody else,\" Joe Montana said.",
    "\"He's certainly capable of doing a lot of great things,\" McDaniels said.",
    "And that status generally earns you the top spot in rankings like these.",
    "\"Yesterday was like the first day that kind of felt like the offseason.",
    "To say there's work to be done is another whopper of an understatement.",
    "The Jets do have some assets with which to goose their rebuild in 2022.",
    "A top-eight defense in terms of both yards and points allowed in 2021.",
    "Otherwise, the current roster is capable of competing at a high level.",
    "Ryan has been in this league for a long time and he is a great player.",
    "Running back Joe Mixon was third in the NFL with 1,205 rushing yards.",
    "But this remains one of the more talent-bereft rosters in the league.",
    "O'Connell inherits a fair amount of talent on that side of the ball.",
    "Actually, calling the speculation \"rampant\" may not really cover it.",
    "Minnesota Vikings\nThe times they are-a-changing in the Twin Cities.",
    "2 overall pick and less like the limited talent we saw last season.",
    "\"The Texans had the NFL's worst offense in 2021,\" Davenport wrote.",
    "This is a team with a fair amount of talent in the receiving game.",
    "Arizona Cardinals\nWill the real Arizona Cardinals please stand up?",
    "Moton thinks Garoppolo is a goner—and that's not such a bad thing.",
    "\"Over four postseason games, Burrow was sacked 19 times,\" he said.",
    "I think at this point I would say we're working at Lamar's pace.\"",
    "\"I can tell you this, our team is going to be tough,\" Allen said.",
    "Carolina whiffed on veteran quarterbacks in successive seasons.",
    "I was just a little emotional and so happy to be a world champ.",
    "Those are problems that will need to be addressed soon enough.",
    "There are needs to be filled along the interior of both lines.",
    "\"I would never divulge a conversation with a player,\" he said.",
    "\"So for me to talk about it in specifics would be prohibitive.",
    "The good news is that Smith has led a team to the Super Bowl.",
    "The question is whether they can avoid barreling off a cliff.",
    "Others still are in the early stages of a ground-up rebuild.",
    "However, after the bye week it was another story altogether.",
    "As Davenport pointed out, just one glaring weakness remains.",
    "At least one of our analysts is inclined to agree with him.",
    "If he does, the Bengals will be a force for years to come.\"",
    "Pedersen's arrival may be cause for at least some optimism.",
    "I think, personality-wise, we're going to jell really well.",
    "Last year, the team was able to bring back all 22 starters.",
    "\"That's a decision the coach and general manager will make.",
    "You do it to free agency, and you do it through the draft.\"",
    "That leaves the big question—what to do about Kirk Cousins?",
    "That's our job as a coaching staff and as an organization.",
    "As a matter of fact, he won four—including Super Bowl LVI.",
    "But it would also mean a complete reset for the franchise.",
    "\"I've got some decisions to make for sure,\" Rodgers said.",
    "He loves the city and he wants to stay here,\" Blank said.",
    "It's hard to envision a quick turnaround happening here.\"",
    "\"Eberflus may well be a fine head coach,\" Davenport said.",
    "\"And the Bears have the talent to field a solid defense.",
    "Without Brady, Tampa Bay isn't an appealing destination.",
    "New York Giants\nIt's a time of great change in New York.",
    "And a new offensive coordinator after Brian Daboll left.",
    "And the Rams are over $14 million in the salary-cap red.",
    "Sobleski, on the other hand, ranked the Bengals second.",
    "There's a lot of room for improvement in the offseason.",
    "And a pair of picks in the top seven of the 2022 draft.",
    "No one knows when (or if) Thomas could rejoin the team.",
    "Of course, therein lies the problem—Payton is gone too.",
    "For some squads, there are just a few needs to address.",
    "Dalvin Cook is a top-10 (if not top-five) running back.",
    "Fans may be hoping for Aaron Rodgers or Russell Wilson.",
    "As it turns out, the 2021 Lions were pretty toothless.",
    "\"The Chiefs aren't without needs—primarily on defense.",
    "But for now at least, the Rams have much to celebrate.",
    "\"The Raiders are a true wild-card team,\" Moton added.",
    "An impressive young running back in Javonte Williams.",
    "\"Tannehill isn't a bad quarterback,\" Davenport said.",
    "\"It's probably gonna take some time,\" Stafford said.",
    "\"That's more than any quarterback in league history.",
    "It takes a lot to raise a quarterback, if you will.",
    "You’d like to add a little depth at o-line and DB.",
    "But he's also a 38-year-old first-time head coach.",
    "Chase, Higgins and Boyd are a nightmare to defend.",
    "It's not me, it's not any individual on this team.",
    "I know in the moment I didn't know what to think.",
    "\"The Ravens couldn't shake the injury bug either.",
    "The Giants have a new head coach in Brian Daboll.",
    "Tampa Bay Buccaneers\nIt was fun while it lasted.",
    "When next year does come, we'll be ready to go.\"",
    "From Week 13 on, the Cardinals won all of twice.",
    "And that gamble paid off with a Lombardi Trophy.",
    "The franchise has a new name in the Commanders.",
    "Now they just need a quarterback to lead them.",
    "The Buccaneers are taking a step back in 2022.",
    "A new defensive coordinator in Don Martindale.",
    "Just about everything that could go wrong has.",
    "Houston Texans\nThe Houston Texans are a mess.",
    "It is a team sport, and not just one player.\"",
    "Henry's defense of his teammate is admirable.",
    "But with all that talent comes expectations.",
    "But Carr isn't the Raiders' biggest problem.",
    "And to get it done together was so special.\"",
    "An OK (albeit unspectacular) offensive line.",
    "It won't be a pleasant one,\" Sobleski wrote.",
    "\"Let the offseason of Baker Mayfield begin!",
    "But he has been set up to fail in Houston.\"",
    "Now the task turns to defending that title.",
    "They are the reigning Super Bowl champions.",
    "The team entered the postseason as the No.",
    "We all take on the criticism—I take it on.",
    "Well, the 2021 NFL season is in the books.",
    "Because of Hurts' limitations as a passer.",
    "\"Certainly, you’d like to add a receiver.",
    "Without our fans, we don't have a game.\"",
    "Can I interest you in Mitchell Trubisky?",
    "And so happy to be a part of this group.",
    "Smith has shown he can be a fine coach.",
    "The Giants have some talent on offense.",
    "What there isn't is a new quarterback.",
    "I'm gonna enjoy the next couple weeks.",
    "We picked up his option, as you know.",
    "He has plenty of problems of his own.",
    "We have to improve our football team.",
    "It leaves the Eagles with a dilemma.",
    "At least one of our analysts agrees.",
    "A new general manager in Joe Schoen.",
    "Just knowing he played the position.",
    "\"I'm really excited,\" Lawrence said.",
    "\"We'll help him be a better leader.",
    "\"The league's second-worst defense.",
    "Nearly everything else is in place.",
    "Cleveland Browns\nIt happened again.",
    "But we'll stick to the latter here.",
    "\"After all, this group started 9-2.",
    "Maybe the best team in the league.",
    "\"I'm gonna have to think about it.",
    "Care to guess which team is first?",
    "I'm really excited for the future.",
    "And others still fall in-between.",
    "There's two major ways you do it.",
    "Buffalo Bills\n\"Thirteen Seconds.\"",
    "\"The loss to the Rams must sting.",
    "That task won't be easy, either.",
    "The roster isn't in great shape.",
    "You’d like to add a linebacker.",
    "He isn't even in the top three.",
    "Is he a franchise quarterback?",
    "I think we're pretty similar.",
    "We'll help him be everything.",
    "We're at that position again.",
    "We're a group, we're a team.",
    "But that's just what it is.",
    "We all know what happened.",
    "That's the biggest thing.",
    "So, we're working on it.\"",
    "The quarterback position.",
    "\"We did it the other way.",
    "Burrow is the real deal.",
    "1 offense in the league.",
    "\"(Ryan) loves the game.",
    "He's an offensive guy.\"",
    "Even more on defense.",
    "He loves the Falcons.",
    "It takes everybody.",
    "Then, December hit.",
    "1 seed in the NFC.",
    "\"He's high on him.",
    "Likely a big one.",
    "It's not just me.",
    "3 pick in March.",
    "4 and No.",
    "32 to No.",
    "Not one.",
    "However.",
    "Yikes.\"",
    "10).",
    "29.",
    "30.",
    "32.",
    "31.",
    "28.",
    "27.",
    "26.",
    "25.",
    "19.",
    "18.",
    "17.",
    "16.",
    "15.",
    "23.",
    "24.",
    "21.",
    "20.",
    "22.",
    "10.",
    "11.",
    "12.",
    "14.",
    "13.",
    "...",
    "25.",
    "4.",
    "5.",
    "3.",
    "1.",
    "2.",
    "9.",
    "8.",
    "6.",
    "7.",
    "2.",
    "1."
  ]
}