{
  "id": 4796,
  "mediaId": 2586,
  "date": "2022-02-23",
  "headline": "2 Reasons Why the Brian Flores Hire Could Spell Disaster for Steelers",
  "image": "https://heavy.com/wp-content/uploads/2022/02/156ea348962648a3975d394f7bcab4f3-e1645559793151.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/brian-flores-mike-tomlin-minkah-fitzpatrick/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allison Koehler",
  "authorUrl": "https://heavy.com/author/allisonkoehler79/",
  "termIds": [
    1698,
    1990,
    2315,
    2609,
    3069,
    3773,
    4507,
    671,
    823
  ],
  "sentences": [
    "“[Fitzpatrick] was asked to essentially abandon his instincts and move to a strong safety role that, in the Dolphins’ scheme, was really more of a quasi-linebacker, mashing into a pile of 300-pound linemen,” Dunne wrote.",
    "— Brooke Pryor (@bepryor) February 19, 2022\nA year after the blockbuster trade, Fitzpatrick confirmed in an in-depth interview with Bleacher Report‘s Tyler Dunne that he felt Flores was misusing him.",
    "“I am excited about Brian Flores joining our coaching staff given his history of developing and teaching defensive players during his time in the NFL,” Steelers head coach Mike Tomlin said.",
    "Sure, Flores dug his own grave by filing a class-action lawsuit against the Dolphins, the NFL and two other teams, but “trouble” playmakers with proven talent find teams all the time.",
    "Adding Brian Flores to the defensive staff is a win for the Steelers in every way, but I’d love to be a fly on the wall for Flores’ first conversation with Minkah Fitzpatrick.",
    "Excluding T.J. Watt and Cam Heyward, the defense wasn’t impactful for reasons that should be helped by an fresh perspective with a defensive mind.",
    "Minkah, Meet Brian\nThe second reason why the Flores hire could spell disaster for the Pittsburgh Steelers has a name: Minkah Fitzpatrick.",
    "“Brian’s resume speaks for itself, and I look forward to him adding his expertise to help our team.”\nIt sounds all well and good, right?",
    "The Steelers were only lucky enough to land Minkah Fitzpatrick in a trade because he no longer wanted to be with the team he was on.",
    "He led the Dolphins to a 24-25 overall record and guided the team to back-to-back winning seasons for the first time in two decades.",
    "If Flores wants to implement some new ideas — and you’d think that’s one of the reasons why he was hired — how open will Tomlin be?",
    "Steelers Nation begged and pleaded for an external hire, something that, before Flores, had never been done under Mike Tomlin.",
    "Mike Tomlin calls the shots on defense, and finding a smart, defensive mind who wants to take a back seat can’t be easy.",
    "And what about Teryl Austin — the man the Steelers promoted to defensive coordinator when Keith Butler retired?",
    "Fitzpatrick and Flores’ team-altering tryst could make for an awkward encounter once offseason training begins.",
    "On the surface, the addition of Brian Flores to the Pittsburgh Steelers coaching staff was a total slamdunk.",
    "Too Many Cooks in the Kitchen\nLooking at it from the other side, here’s why the hire could go very wrong.",
    "Their offense was predictable for reasons that should be helped by the Ben Roethlisberger retirement.",
    "If the situation isn’t handled carefully, it could result in a case of too many cooks in the kitchen.",
    "The interesting aspect to watch will be how the Flores hire changes the Steelers defense, if at all.",
    "Fitzpatrick could not be himself, and his head coach would not budge.”\nSo, Fitzpatrick got out.",
    "Beneath the surface, after peeling back the complicated layers, a disaster could be lurking.",
    "Furthermore, their disagreement was in 2018, and, as they say, time heals all wounds.",
    "Brian Flores is the first big name to be hired as an assistant by the Steelers.",
    "Swallowing his pride and accepting a lesser role had to be humbling for Flores.",
    "Before his surprise and controversial firing, Flores had success in Miami.",
    "The club has previously remedied that problem by promoting from within.",
    "Will Tomlin be willing to delegate play-calling duties to Flores?",
    "Flores is coaching linebackers, not the defensive backs.",
    "“It was maddening, like playing with a straitjacket on.",
    "It was a necessary move but one that no one saw coming.",
    "ALL the latest Steelers news straight to your inbox!",
    "On both sides of the ball, the Steelers grew stale.",
    "Join the Heavy on Steelers newsletter here!",
    "But it’s more likely nothing comes of it.",
    "Miami’s loss was Pittsburgh’s gain.",
    "Yep, you guessed it — Brian Flores.",
    "That team was the Miami Dolphins.",
    "Who was the head coach?"
  ]
}