{
  "id": 4830,
  "mediaId": 2525,
  "date": "2022-02-21",
  "headline": "TD Garden drops proof of vaccination mandate, still holds onto masks",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/02/fansms003.jpg?w=1024&h=664",
  "link": "https://www.bostonherald.com/2022/02/21/td-garden-drops-proof-of-vaccination-mandate-still-holds-onto-masks/",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meghan Ottolini",
  "authorUrl": "https://www.bostonherald.com/author/meghan-ottolini/",
  "termIds": [
    1509,
    1811,
    3696,
    144,
    240,
    296,
    4865,
    5192
  ],
  "sentences": [
    "“So I kind of rebelled against coming to any games until now.”\nTD Garden put the policy change into effect just ahead of Monday’s game, but in a statement, retired their mask policy, stating, “the City of Boston Mask Mandate will continue to be in effect, requiring all guests 2 years old and over to wear a mask while indoors, unless actively eating or drinking.”\nThe home of the B’s and C’s will continue following public health guidelines put into place by the City of Boston, which has not yet dropped an indoor mask mandate.",
    "Toomey said she also took some comfort before the mandate was lifted in knowing that wherever she went before in Boston, people indoors had shown proof of their shots, but she said gradually moving forward with masks in big crowds is a steady compromise in these complicated later stages of the pandemic.",
    "“Once the game gets going and the crowd starts going and it’s really exciting, that’s when people want to take it off, and at that point it’s just useless,” said Brennen Fitzpatrick, a fan attending Monday’s game.",
    "Bruins and Celtics fans can now enter TD Garden without showing proof of vaccination at the door, as the venue dropped its mandate three days after Mayor Michelle Wu rescinded the city-wide vaccination ordinance.",
    "“I’m so happy just to have it normal,” said Kirsten Toomey, a fan from Brookline who attended Monday’s matinee game between the Bruins and the Colorado Avalanche.",
    "Some neighboring communities, like Newton, have ended their indoor mask rules, but allow individual businesses to call their own shots with face coverings.",
    "TD Garden, which is owned and operated by company Delaware North, required proof of vaccination from all attendees starting back on Jan. 15.",
    "However, between eating and drinking and cheering on their teams, stringent mask-wearing can slip by the wayside, some fans have noticed.",
    "Fitzpatrick’s sister, Isabel, expressed some reservations about attending the game without a proof of vaccination check at the entrance.",
    "I’ll take the precautions with this,” said Bruins fan Scott Ridley, who brought a mask to Monday’s game.",
    "The mandate lasted just over five weeks, but that was long enough to rub some fans the wrong way.",
    "Fans trickling into the Garden for Monday’s Bruins game were generally unbothered by the masks.",
    "“It’s got to end sometime, I’m so torn,” she told the Herald.",
    "“It’s none of their business whether I’m vaccinated or not.",
    "“It’s great to be here, but it is also concerning as well.",
    "A mask ain’t that uncomfortable,” Ridley said.",
    "“I don’t have a problem, I’ll wear a mask.",
    "It’s a little bit of both,” she said."
  ]
}