{
  "id": 4879,
  "mediaId": 2551,
  "date": "2022-02-18",
  "headline": "Warrington promise more antics from social media sensation 'Whizzy Rascal' after youngster sparked hilarious scenes by driving off with the match ball in a mini BMW at first home game",
  "image": "https://i.dailymail.co.uk/1s/2022/02/18/18/54374079-0-image-a-16_1645209693661.jpg",
  "link": "https://www.dailymail.co.uk/sport/rugbyleague/article-10528695/Warrington-planning-antics-social-media-sensation-Whizzy-Rascal.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Press Association",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Press+Association",
  "termIds": [
    3055,
    4590,
    139,
    1217
  ],
  "sentences": [
    "Instead of taking the ball straight to referee James Child in the centre spot, the mysterious youngster drove to the far side of the pitch and, after being encouraged to turn around, decided it would then be more fun to carry on to the opposite touchline.",
    "pic.twitter.com/NVDlOaAnhJ\n— Warrington Wolves (@WarringtonRLFC) February 18, 2022\nThe match got under way when the ball was eventually wrestled from the car and Warrington emerged 34-10 winners over Castleford but Whizzy remained a major talking point.",
    "‘Against Catalans, which is our next home game, we’ve also got an appearance from a mechanical dragon that will do battle with Whizzy Rascal.’\n+2\nView gallery\nWarrington emerged 34-10 winners over Castleford but Whizzy remained a major talking point",
    "The match ball for the Wolves’ first home Super League game of the season was delivered by a young driver in a mini BMW, who sparked hilarious scenes after then driving off with the ball.",
    "Warrington are keeping the identity of their new social media sensation ‘Whizzy Rascal’ secret but promise there are more antics to come.",
    "Warrington chief executive Karl Fitzpatrick said: ‘I can’t let you into too much but a lot of people have got the sex wrong.",
    "+2\nView gallery\n‘Whizzy Rascal’ sparked hilarious scenes by driving off with the match ball before kick-off\n??",
    "But we’ll be doing it for the full season and there is a lot more to come.",
    "‘People are assuming it’s a boy and I’m not able to confirm or deny.",
    "The 'Whizzy Rascal' stole the show last night!",
    "??"
  ]
}