{
  "id": 4937,
  "mediaId": 2586,
  "date": "2022-02-22",
  "headline": "Struggling Bills RB May Need to Move Into New Role Next Season: Insider",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Zack-Moss-e1645582853648.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-zack-moss-new-role/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1278,
    1888,
    2516,
    3677,
    4360,
    160
  ],
  "sentences": [
    "“It would be optimal for the Bills if they could dress three running backs, and all three can be trusted to carry the ball if necessary.”\nBills Could Bring in Help for the Backfield\nWhile the Bills were able to shore up some of their rushing deficiencies as the season went on and Singletary saw his role increase, some insiders suggest that the team could look to bring in more help next year.",
    "Zack Moss saw a dropoff in production last season, failing to follow up his strong rookie season and seeing his carries and snaps diminish greatly as the season went on and backfield cohort Devin Singletary became something closer to a primary running back.",
    "New Role for Moss\nAs Buscaglia wrote, Moss was unable to follow up on the flashes of potential he showed during his rookie season, struggling to contribute last year and eventually becoming a healthy scratch in three of the final four games.",
    "Buscaglia suggested that Moss could increase his value by joining the special teams unit, which would also fill in for fellow running back and impending free agent Taiwan Jones, who played almost exclusively on special teams.",
    "“The Bills are likely going to need to find some answers with their special teams units, and with Moss slightly falling out of favor this past season, it might be time to see what he can do in the third phase,” he wrote.",
    "“I’d like to see the Bills add a pass-catching speed back who can pick up chunk yards when Allen is forced to check down — the type of back that Tom Brady killed defenses with for decades,” he wrote.",
    "After multiple chances throughout the season, the Bills decided that Moss wasn’t an essential game day asset in late November.”\nBills Mailbag: How does Zack Moss factor into the 2022 offensive plan?",
    "He racked up 1,166 yards from scrimmage for the Atlanta Falcons as a hybrid running back/wide receiver last season, and is headed to free agency as a potentially affordable option for Buffalo.",
    "The Athletic’s Joe Buscaglia wrote that the Bills may need to find some creative ways to make use of Moss’s talents next season, which could mean joining the special teams unit.",
    "Most targets without a drop this season:\n— PFF (@PFF) February 19, 2022\nSome have suggested that versatile Cordarrelle Patterson could be a free agent target for the Bills.",
    "With Bills receiver Isaiah McKenzie also headed to free agency, Patterson could take his place as the speedy receiver who adds new wrinkles to the rushing game.",
    "NFL.com’s Kevin Patra wrote that the biggest priority will likely be to add depth behind Singletary and Moss, including a player with more home run ability.",
    "“The film revealed a player who struggled to consistently make the right reads, almost to the point where he sometimes seemed to be overthinking it.",
    "“His second season was a legitimate step backward that raises concerns about how much of a role he should get moving forward,” Buscaglia wrote.",
    "https://t.co/hw4CE3MX56\nAfter rushing for 481 yards in his rookie season, Moss saw his production drop in his second year.",
    "He rushed for just 345 yards, and his yards per carry dropped from 4.3 in his rookie year to 3.6 last season.",
    "A struggling Buffalo Bills running back could find new life with a new unit next season, an insider suggests.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!"
  ]
}