{
  "id": 4958,
  "mediaId": 2690,
  "date": "2022-02-22",
  "headline": "Offices on the ballot",
  "image": "https://storage.ning.com/topology/rest/1.0/file/get/4287750681?profile=UPSCALE_320x240",
  "link": "https://teapartyorg.ning.com/group/montana/home?commentId=7928364%3AComment%3A2997173",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Johnson",
  "authorUrl": "https://teapartyorg.ning.com/members/KenJohnson",
  "termIds": [
    0
  ],
  "sentences": [
    "Click Here or go to: http://www.eaglesvoice.com/Illegal_Immigration_Questionair.html\nAs states in the Southwest, and other areas of our country, move foreword to save themselves and their communities from the multitude of negative effects resulting from Illegal Immigration, Illegal Immigrants will look for opportunities to leave those states seeking refuge in states that continue to protect their Illegal status by allowing Illegal Employment (Thereby taking jobs away from honest hard working citizens.",
    "), and we can go on and on…\nJoin the EaglesVoice Forum on Immigration Click Here or go to:\nhttp://www.eaglesvoice.com/forum_immi.html\nApril 28, 2010\nThe Honorable Jan Brewer\nGovernor of Arizona\n1700 West Washington\nPhoenix, Arizona 85007\nHonorable Governor Jan Brewer,\nI commend your actions regarding illegal immigration!",
    "This is the result of President Obama and the Leftist (Socialist) Liberals intent to reform immigration by offering amnesty and all citizenship rights to Illegal Immigrants and by the boldly appropriate actions of the State of Arizona to control Illegal Immigration by passing and signing Arizona’s S.B.",
    "Your actions will help Arizona economically, your actions will help to prevent crime, drug trafficking, the potential spread of disease, the socio/economic burden born by Arizona Citizens to pay (through taxes) the cost of medical care and other social services that illegal’s have no right to.",
    "Data gleaned from 29,346 pages of documents obtained under the Freedom of Information Act and from other Fed databases of more than 21,000 transactions make clear for the first time how deeply the world’s largest banks depended on the U.S. central bank to stave off cash shortfalls.",
    "Thank you Donna,\nPhillip Erquiaga\n82 Cedar Street Extension\nLibby, Montana 59923\n406-293-2393\nperquiaga@EaglesVoice.com\nIllegal Immigration\nAgain Illegal Immigration is at the forefront of discussion around the country and within many states.",
    "), that think that the threat of terrorism only originates in the middle east and won’t happen here, for example in Montana (Thereby opening the door for terrorist cells to propagate and threaten society.",
    "Fed officials argued for more than two years that releasing the identities of borrowers and the terms of their loans would stigmatize banks, damaging stock prices or leading to depositor runs.",
    "1070 at: http://www.azsos.gov/public_services/Chapter_Laws/2010/49th_Legisla...))\nI am asking the people of Montana to join together to pass a Montana bill similar to Arizona’s S.B.",
    "21,000 Transactions\nAny new rescues by the U.S. central bank would be governed by transparency laws adopted in 2010 that require the Fed to disclose borrowers after two years.",
    "I hope that Governors Office and Arizona will continue to fight the objections and resistance to your efforts, and encourage the rest of our country to follow your lead.",
    "I hope the people of Arizona, that may see temporary economic setbacks as a result of boycotts, will see that in the long term the people will be better off financially.",
    "Even as the firms asserted in news releases or earnings calls that they had ample cash, they drew Fed funding in secret, avoiding the stigma of weakness.",
    "), that refuse to acknowledge the influx of crime created by Illegal’s (Thereby putting their citizens at risk of becoming victims of crime.",
    "You can also go to www.EaglesVoice.com and fill out my SHORT questionair which will put you on my email list if you check yes to do so.",
    "), that will encourage the proliferation of illicit narcotic sales and use (Thereby risking the future of our youth and citizens.",
    "Hi Donna,\nI would suggust going with your own instinct and write letters to the editor and write to your state representatives.",
    "A group of the biggest commercial banks last year asked the U.S. Supreme Court to keep at least some Fed borrowings secret.",
    "), that feel there is no risk that disease will be transmitted by illegal’s (Thereby putting our citizens health at risk.",
    "I’m asking the people of Montana to provide your thoughts on Illegal Immigration by filling out a brief questionnaire.",
    "In March, the high court declined to hear that appeal, and the central bank made an unprecedented release of records.",
    "I know Chas Vincent (Republican) who is running for State Senate 1 is for the idea, and there are others.",
    "), that allow them to receive free social services (Thereby increase the tax burden on the citizens.",
    "I was born in Nevada, spent most of my life in Las Vegas, and then moved to Southern California.",
    "I would like a copy of your new law so I can consider submitting similar legislation in Montana.",
    "He has committed, to me anyway, that after the election he will move forward with legislation.",
    "You have taken bold action that will, if not reversed, help to save the state of Arizona.",
    "Comments\nRead this first before you see who got the money, if you can!!!!",
    "Sadly, these problems exist here also - although on a much smaller scale.",
    "Thank you,\nPhillip Erquiaga\nLibby, Montana\nwww.EaglesVoice.com",
    "This allows me to understand the problems that Arizona faces.",
    "His email is cvvincent@hotmail.com his phone is 406-293-1575.",
    "These problems are one of the reasons I've moved to Montana.",
    "If you send me your email I will keep you up to date.",
    "Especially about the \"Foreign Borrowers\"!!!",
    "Arizona will be a much stronger state.",
    "1070\n(See full test of Arizona’s S.B.",
    "Sent to: perquiaga@EaglesVoice.com.",
    "1070."
  ]
}