{
  "id": 4962,
  "mediaId": 2586,
  "date": "2022-02-17",
  "headline": "Bills Could Ask Cole Beasley to Take Pay Cut Next Season: Insider",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Cole-Beasley-1-e1645152427493.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-cole-beasley-pay-cut/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1561,
    1858,
    2019,
    3583,
    3677,
    160,
    539
  ],
  "sentences": [
    "In my positional deep dive:\n-How Beasley could shape all their upcoming decisions\n-Why Davis' emergence was essential to 2022\n-My WR recommendations for the offseason\nMuch more here: https://t.co/iRkG4z4UXT\n— Joe Buscaglia (@JoeBuscaglia) February 15, 2022\nDespite a dip in productivity, Beasley remains a strong asset and one of the team’s best receivers against zone coverage, Buscaglia noted.",
    "At his age, Beasley is unlikely to get more on the open market — in total money and guaranteed money — than what the Bills would offer.”\nBeane Could Create Breathing Room\nAs Bills Wire’s Wojton noted, Beane faced another tight cap situation last offseason and managed to create some room by restructuring other contracts.",
    "Bills Making Moves at Wide Receiver\nIn his assessment of the Bills receiving corps going into the offseason, Buscaglia noted that some changes are likely on the way, especially with Isaiah McKenzie and Emmanuel Sanders headed to free agency — and Sanders potentially headed to retirement.",
    "https://t.co/WNt9uE7Imf\nThat was largely the approach the Bills took last offseason, putting an emphasis on re-signing players like Jon Feliciano and Matt Milano before they could hit free agency, along with making some other more affordable moves like bringing in the veteran Sanders.",
    "“We’ll still have to make some moves but I wouldn’t see us being like big spenders but we’ll definitely look to fill some spots from the outside as well as retain some of our guys,” Beane said, via USA Today’s Bills Wire’s Nick Wojton.",
    "The Buffalo Bills will be facing some difficult cap decisions in the coming offseason, and one insider suggests that the team may need to ask a veteran wide receiver to take a pay cut in order to make some space.",
    "Beane has already said that the Bills will be unable to make any splashy moves in free agency this year, and instead will be focused on making some improvements and holding onto key players.",
    "“Beasley is a good player, but he should not account for a nearly $8 million cap hit,” he wrote, noted that Over The Cap pegged Beasley’s value at close to $4.6 million last season.",
    "After making 67 receptions for 778 yards and six touchdowns in 2019 and 82 catches for 967 yards with four touchdowns last season, Beasley saw his production drop a bit this year.",
    "Buscaglia noted that Beasley had a dropoff in play last season from 2019 and 2020, with age and injuries taking away some of his quickness and change-of-direction skills.",
    "Even though the salary cap is increasing to $208M this offseason, the Bills will be in a tight situation after giving a long-term extension to quarterback Josh Allen.",
    "“The Bills could offer Beasley a base salary reduction to get his cap hit down to the range of $4.5 million to $6 million and fully guarantee the salary.",
    "The Athletic’s Joe Buscaglia speculated that the Bills may need to create space by asking one key player to restructure to take less money in 2022.",
    "“Beasley can find the soft spots, knows what Allen is looking for during his reads and knows how to play the zone defender in a given area.",
    "But one of the biggest question marks could be a player who is still under contract through the next season — Cole Beasley.",
    "Buscaglia predicted that the Bills would keep Beasley in their plans, but would need to restructure his contract.",
    "Brandon Beane: Protecting Josh Allen is the first priority for Bills' offense this offseason.",
    "He made the same number of catches, 82, but for 693 yards and only one touchdown.",
    "Cole Beasley leaves the field after a loss to the Kansas City Chiefs.",
    "The Bills had one of the most talented WR rooms in the NFL in 2021.",
    "He is a third-down asset to help keep drives alive,” he wrote.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!"
  ]
}