{
  "id": 4990,
  "mediaId": 2644,
  "date": "2022-02-16",
  "headline": "Nebraska mom gave birth on sidewalk, abandoned baby in cold: cops",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/omaha-baby-sidewalk-comp-1.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/16/nebraska-mom-gave-birth-on-sidewalk-abandoned-baby-in-cold/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joshua Rhett Miller",
  "authorUrl": "",
  "termIds": [
    1273,
    1366,
    773,
    4946,
    5175,
    5219
  ],
  "sentences": [
    "Cops responded to an intersection in southeast Omaha at about 10 a.m. Sunday to check on the well-being of a woman later identified as Shakespeare, who allegedly had given birth to a baby boy and then walked off.",
    "Juvenile court prosecutors are expected to seek to deem the newborn boy a ward of the state since Shakespeare is unfit to care for him due to the alleged abandonment, Douglas County Attorney Don Kleine said.",
    "Trinity Shakespeare, 27, was arrested Tuesday on a felony child abuse charge after being released from a hospital following Sunday’s incident, Omaha police said in a statement.",
    "The man, who was not the father of the toddlers, told cops Shakespeare seemed “buzzed” while admitting he was a “drunk” unable to care for the youngsters, court records show.",
    "Shakespeare had lost custody of two other children — a boy born in 2016 and a girl in 2017 — after leaving them with a man in August 2018, the Omaha World-Herald reported.",
    "Medics first made contact with Shakespeare after receiving a call for a “maternity problem,” Omaha Fire Battalion Chief Scott Fitzpatrick told the World-Herald.",
    "The children were put in emergency protective custody, while Shakespeare was later sentenced to 200 days in jail for child abuse by neglect.",
    "Shakespeare was found by cops near the back of a home about a block away, according to a police report obtained by the Omaha World-Herald.",
    "The woman, who was alert at the time, refused to answer questions from paramedics other than to deny being ill or hurt, Fitzpatrick said.",
    "The temperature at the time was just 15 degrees and witnesses at the scene covered the boy to shield him from the elements, police said.",
    "Shakespeare was wearing a baggy winter coat, making it unclear to medics if she was in active labor, Fitzpatrick told the newspaper.",
    "Nebraska’s Safe Haven Law, meanwhile, allows anyone to drop off an infant 30 days or younger at a hospital without prosecution.",
    "Shakespeare’s father told the World-Herald he spoke to his daughter early Tuesday as she was recovering in a hospital.",
    "“Here you go,” Shakespeare told him as she abandoned the children, according to juvenile court filings.",
    "But Shakespeare was “adamant” that she be left alone, insisting she didn’t need help, Fitzpatrick said.",
    "A Nebraska woman gave birth on a sidewalk and then abandoned the baby in the frigid cold, police said.",
    "Shakespeare was charged after consultation with Douglas County prosecutors, Omaha police said.",
    "The boy, who was taken to a hospital in critical condition, is expected to survive.",
    "He was exposed to the bitter temps for at least five minutes, KETV reported.",
    "“She must have been scared,” Edd Shakespeare told the newspaper."
  ]
}