{
  "id": 5045,
  "mediaId": 2594,
  "date": "2022-02-18",
  "headline": "More to come from Whizzy Rascal as Warrington pledge to ‘do things differently’",
  "image": "https://static.independent.co.uk/2022/02/18/11/b379fe33a1e0c3b4155584752e17fd52Y29udGVudHNlYXJjaGFwaSwxNjQ1MjY4NTI5-2.65393934.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/warrington-super-league-people-bmw-warrington-wolves-b2018107.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ian Laybourn",
  "authorUrl": "https://www.independent.co.uk/author/ian-laybourn",
  "termIds": [
    3055,
    3836,
    4129,
    4590,
    139,
    187,
    990,
    1094,
    1217,
    5386
  ],
  "sentences": [
    "“Against Catalans which is our next home game, we’ve also got an appearance from a mechanical dragon that will do battle with Whizzy Rascal.”\nWarrington also kept under wraps the identity of a previous crowd entertainer, speed merchant ‘Wire the Flier’, with Whizzy’s anonymity similar to that of Top Gear’s ‘The Stig’.",
    "The phone has been red hot, it’s been on BBC and it’s had over half a million views already on Twitter alone.”\nPlayers from both Warrington and visitors Castleford all saw the funny side of the delay and it also brought a huge smile to new Wolves coach Daryl Powell.",
    "Instead of taking the ball straight to referee James Child in the centre spot, the youngster drove to the far side of the pitch and, after being encouraged to turn around, decided it would then be more fun to carry on to the opposite touchline.",
    "There will be a lot more to come on the back of this.”\nThe mini BMW belongs to local car manufacturer Halliwell Jones, who have the naming rights to Warrington’s stadium and are about to enter into a new five-year sponsorship deal.",
    "It was awesome.”\nShaun Briscoe, the former England full-back who is Warrington’s commercial account manager, got a close-up view of the action after compering the pre-match build-up.",
    "The match ball for the Wolves’ first home Super League game of the season was delivered by a young driver in a mini BMW, who sparked hilarious scenes after driving off with the ball.",
    "“We live in a time when everyone is vying for people’s attention and I’ve no doubt when they start watching the game, they will absolutely love it, it’s the best sport on the planet.",
    "The match got under way when the ball was eventually wrestled from the car and Warrington emerged 34-10 winners over Castleford but Whizzy remained the talking point.",
    "Warrington are keeping the identity of their new social media sensation ‘Whizzy Rascal’ a closely-guarded secret but promise there is more to come.",
    "Warrington chief executive Karl Fitzpatrick told the PA news agency: “I can’t let you into too much but a lot of people have got the sex wrong.",
    "But the club make no secret of their desire to innovate, having recently become the first Super League club to launch non-fungible tokens.",
    "“We want to expose the sport to a bigger audience and these kind of marketing activations creates talking points and grab attention.",
    "“We’re in the entertainment business and we try to give a positive, memorable and enjoyable experience.",
    "“We’d been planning it for a few weeks and a few people asked if we were sure about it,” Briscoe said.",
    "“Initially we were going to make it a remote control vehicle but we decided to go with just the child.",
    "“If he had taken it to the middle and then got back you’d have said ‘he’s fantastic, that kid’.",
    "“We’ve shown over the years that we do things differently at Warrington,” said Fitzpatrick.",
    "“We were pretty confident it would go down well but not to this degree to be honest.",
    "But we’ll be doing it for the full season and there is a lot more to come.",
    "“People are assuming it’s a boy and I’m not able to confirm or deny.",
    "I think last night shows that we are doing our best to entertain.",
    "But he’s created a bit of theatre which everybody enjoyed.",
    "We’re in a sport that needs evolution and change.",
    "“It couldn’t have been any better to be honest.",
    "“It was awesome wasn’t it?” said Powell."
  ]
}