{
  "id": 5054,
  "mediaId": 2586,
  "date": "2022-02-19",
  "headline": "Bills Lose Another Coach, Plan to Name His Son as Replacement: Insider",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Tremaine-Edmunds-e1645298604953.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-lose-lb-coach/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "There are times Bobby Babich and John Butler, our secondary coaches, we give them the liberty to have input on the game plan, about what type of looks we want to give the quarterback, or what’s the best strategy in this particular defense.”\nMany Changes for Bills This Offseason\nBabich’s reported retirement would be the latest change for a Bills coaching staff in flux, and many of the replacement coaches have come from within.",
    "Poyer is the first Bills safety to be named an AP first-team All-Pro since Henry Jones in 1992. pic.twitter.com/953fPuRBGd\n— Buffalo Bills PR (@BuffaloBillsPR) January 14, 2022\n“That’s part of being together for the last five years – they feed off each other,” Frazier told the Buffalo News in November.",
    "pic.twitter.com/whFgI8Iljc\n— Ian Rapoport (@RapSheet) February 2, 2022\nAllen will be getting another highly coveted coach to take over Dorsey’s spot, as the Bills brought in former Carolina Panthers offensive coordinator Joe Brady to serve as the new quarterbacks coach.",
    "Bills Losing Linebacker Coach\nAs Aaron Wilson of Pro Football Network reported, Bills linebackers coach Bob Babich is retiring and the team is planning to replace him by promoting Bobby Babich, his son who is currently serving as Buffalo’s safeties coach.",
    "The Bills have lost a number of top coaches this offseason, as offensive coordinator Brian Daboll was named the head coach of the New York Giants and has brought a number of position coaches along with him.",
    "Bills defensive coordinator Leslie Frazier said that Hyde and Poyer have fostered some great chemistry, and credited Babich for helping put together the game plans that give opposing offenses trouble.",
    "I appreciate what he’s done for me over the course of my career so far.”\nFrom NFL Now: The #Bills are hiring QBs coach Joe Brady to pair with OC Ken Dorsey — all good news for Josh Allen.",
    "As Wilson noted, Bobby Babich has gotten some strong performances out of his position group, with the tandem of Micah Hyde and Jordan Poyer considered one of the best in the league.",
    "As NFL.com’s Kevin Patra noted, Brady had a strong reputation and is seen as an innovative offensive mind who is expected to be a good fit in Buffalo’s pass-heavy offense.",
    "Bob Babich was formerly a defensive coordinator and assistant head coach for the Chicago Bears, also spending time as defensive coordinator for the Jacksonville Jaguars.",
    "After the team officially named Dorsey to the position, Allen credited his former position coach with helping develop him into one of the league’s top quarterbacks.",
    "After Daboll’s departure, the Bills promoted quarterbacks coach Ken Dorsey to offensive coordinator, a move that was heavily endorsed by Josh Allen.",
    "The coaching changes continue for the Buffalo Bills, with another defensive coach reportedly leaving — and a very familiar face taking over.",
    "“I think when he got here three years ago, my career definitely changed in terms of how I viewed the game of football,” Allen said.",
    "“Just having a guy in the quarterback room that played the game, was the winningest college quarterback of all time.",
    "The latest departure is reportedly coming through a retirement, with a replacement already lined up.",
    "Jordan Poyer (first-team) and Micah Hyde (second-team) have been named to the AP All-Pro team.",
    "Tremaine Edmunds makes a tackle in a game against the Los Angeles Chargers.",
    "“They really give quarterbacks a hard time sometimes with their looks.",
    "He says it all the time, but just the way he approaches the game.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "He’ll never let me forget that.",
    "He works his a** off.",
    "He’s competitive.",
    "He was 38-2.",
    "He’s smart."
  ]
}