{
  "id": 5071,
  "mediaId": 2594,
  "date": "2022-02-16",
  "headline": "Mother gave birth on a sidewalk and her abandoned baby miraculously survived in freezing cold, police say",
  "image": "https://static.independent.co.uk/2022/02/16/18/mum.png?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/crime/abandoned-baby-sidewalk-survivor-b2016737.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Justin Vallejo",
  "authorUrl": "https://www.independent.co.uk/author/justin-vallejo",
  "termIds": [
    1366,
    4946,
    5175,
    5219
  ],
  "sentences": [
    "In 2018, she abandoned a two-year-old boy and one-year-old girl with a self-described \"drunk\" who told police he couldn’t care for the toddlers, according to juvenile court filings obtained by The Omaha World-Herald.",
    "Police arrested Nebraska woman Trinity Shakespeare on child abuse charges after she allegedly ran away from the newborn in temperatures as low as 15-degrees Fahrenheit (-9.4 Celsius).",
    "The 27-year-old mother was found about a block away after medics received a call of a \"maternity problem\", Omaha Fire Battalion Chief Scott Fitzpatrick told The Omaha World-Herald.",
    "She was sentenced to 200 days in jail for child abuse by neglect after leaving the children with the man, who was not the father, and said: \"Here you go\".",
    "A baby boy survived after his mother allegedly gave birth on a sidewalk and abandoned him in below-freezing temperatures in Omaha, according to police.",
    "They found him in a critical condition shortly after 10am on Sunday and he was rushed to a local hospital, where he is expected to survive.",
    "Douglas County Prosecutor Don Kleine said the child was in protective custody and that they would seek to make him a ward of the state.",
    "He said she was dressed in a baggy winter coat and was \"adamant\" she didn’t need help and wanted to be left alone.",
    "Police believe the baby was exposed to the sub-freezing temperatures for at least five minutes.",
    "Witnesses Latrell Crane discovered the boy and tried to shield him from the elements.",
    "She was also taken to the hospital and is expected to survive from cold exposure.",
    "\"I shook his chest, come on baby, come on, come on,\" she told KETV.",
    "It would be the third child that Shakespeare loses custody of."
  ]
}