{
  "id": 5076,
  "mediaId": 2586,
  "date": "2022-02-19",
  "headline": "Bills Likely Moving on From Veteran Receiver in 2022: Insider",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Emmanuel-Sanders-e1645288217688.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-moving-on-emmanuel-sanders/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1858,
    2019,
    3093,
    3583,
    4439,
    4797,
    160,
    671
  ],
  "sentences": [
    "If Sanders would do a low-cost, one-year deal, the Bills could bring him back, but there’s no guarantee that he’d be inclined to do that even if he wants to play another season.”\nSanders ended the season with 42 catches for 626 yards and four touchdowns, making another three catches for 52 yards in the playoffs, including his first career playoff touchdown in the team’s 47-17 win over the New England Patriots.",
    "— NFL on ESPN (@ESPNNFL) January 16, 2022\nBuscaglia predicted that Sanders would not be back with the Bills next season, with the team instead looking to snag another receiver within the first three rounds of the NFL draft and giving practice-squad wideout Isaiah Hodgins a chance.",
    "I’m gonna be on the beach somewhere while y’all are sitting out in the cold weather next year.”\nThe idea of retirement has stuck with Sanders, even though Buffalo’s season ended in heartbreaking fashion three wins short of a Super Bowl title.",
    "Veteran Considering Retirement\nThe Athletic’s Joe Buscaglia surveyed the team’s offseason decisions at wide receiver, including some impending choices like whether to keep Isaiah McKenzie or Jake Kumerow, who are both headed to free agency.",
    "The Bills have a trio of wide receivers headed to free agency, and general manager Brandon Beane has already made it clear that the team will be limited in its moves due to tightening cap space as Josh Allen’s contract extension begins.",
    "Sanders was a key contributor during the early part of the season, he noted, but saw his role decline as second-year wide receiver Gabriel Davis came on late in the season and during the playoffs.",
    "Bills receiver Emmanuel Sanders hints at retirementhttps://t.co/3I70CGs224 pic.twitter.com/wCtvkzo8Iw\n— Around The NFL (@AroundTheNFL) February 11, 2022\n“I’ve got my son, he’s getting older.",
    "Throughout the year he spoke about retirement, including back in September when Sanders said he wanted to win one more Super Bowl and then ride off into the sunset.",
    "Speaking to Colin Cowherd, Sanders said he needs to think seriously about his future in the NFL and decide whether he wants to give it one more go in 2022.",
    "The Buffalo Bills could have some tough decisions to make with the receiving corps this offseason, including one that might be out of their hands.",
    "And for the past three years, [I’ve] been traveling and moving from team to team, trying to win a Super Bowl,” he said, via si.com.",
    "“In the two playoff games, with their top five receivers available, Sanders had the second-fewest snaps,” Buscaglia wrote.",
    "That leaves the impending free agent with an uncertain future with the team and with his own career, he wrote.",
    "Sanders Could Retire\nAs Buscaglia hinted, Sanders may decide not to come back to the NFL at all next season.",
    "When it came to veteran Emmanuel Sanders, Buscaglia wrote that the situation is more complicated.",
    "One veteran receiver could be making the decision for them, an insider hints.",
    "“And he didn’t shut down the idea of retiring after the season.",
    "“But I’ve got some reflecting I want to do and possibly retire.",
    "Josh Allen finds Emmanuel Sanders for the 34-yard TD!",
    "And then, I’m just gonna chuck my two fingers up.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "What have I not done in this league?",
    "… I just wanna win,” Sanders said.",
    "I’ve got a daughter getting older.",
    "Get to the Super Bowl, win.",
    "“Get in the playoffs, win.",
    "“I don’t care about stats.",
    "I’m just feeling it out.”",
    "I’ve done it all, dude.",
    "THE BILLS STRIKE AGAIN!",
    "I don’t know yet.",
    "Man, I’m gone."
  ]
}