{
  "id": 5090,
  "mediaId": 6598,
  "date": "2022-02-19",
  "headline": "Steelers hire former Dolphins HC Brian Flores as senior defensive assistant/linebackers coach",
  "image": "https://sportshub.cbsistatic.com/i/r/2022/01/11/f2851c57-2c17-4008-99b8-bf5e8b56e3f6/thumbnail/1200x675/46369943b8c7632d76de64b7f32daf59/brian-flores.jpg",
  "link": "https://www.cbssports.com/nfl/news/steelers-hire-former-dolphins-hc-brian-flores-as-senior-defensive-assistantlinebackers-coach/",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cody Benjamin",
  "authorUrl": "https://www.cbssports.com/writers/cody-benjamin/",
  "termIds": [
    0
  ],
  "sentences": [
    "Round 1 - Pick 8\n Jermaine Johnson II EDGE\n Florida State • Sr • 6'5\" / 254 lbs\n Projected Team\n Atlanta\n PROSPECT RNK\n 19th\n POSITION RNK\n 3rd\n Atlanta isn't afraid to buck the consensus on draft day, and while Johnson isn't necessarily a popular top-10 pick, his combination of size, strength and ascending production could be too enticing to pass up for a club that's long lacked a pass rush.",
    "Round 1 - Pick 3\n Ahmad Gardner CB\n Cincinnati • Jr • 6'3\" / 190 lbs\n Projected Team\n Houston\n PROSPECT RNK\n 3rd\n POSITION RNK\n 1st\n Kayvon Thibodeaux makes a lot of sense here, as does an offensive tackle, but Gardner is the lock-down stud of the corner class, and Houston has a dire need at the position, not to mention a defensive mind running the show in Lovie Smith.",
    "Round 1 - Pick 6\n Ikem Ekwonu OL\n NC State • Soph • 6'4\" / 310 lbs\n Projected Team\n Carolina\n PROSPECT RNK\n 10th\n POSITION RNK\n 4th\n With Seattle jumping up to secure the draft's high-upside QB, the Panthers stick to their board despite their own dire need for a signal-caller, securing a long-term left tackle for Sam Darnold and/or another addition (Baker Mayfield?)",
    "Mock Trade from Detroit Lions\n Round 1 - Pick 32\n Quay Walker LB\n Georgia • Sr • 6'4\" / 241 lbs\n Projected Team\n Buffalo\n PROSPECT RNK\n 99th\n POSITION RNK\n 12th\n A corner or running back would be just as smart for Buffalo here, but Walker allows them not to lean too much on Tremaine Edmunds' continued development in the middle of Sean McDermott's playoff defense.",
    "From Cleveland Browns\n Round 1 - Pick 13\n Drake London WR\n USC • Jr • 6'4\" / 219 lbs\n Projected Team\n Houston\n PROSPECT RNK\n 12th\n POSITION RNK\n 3rd\n A pass-rusher would be more preferable, but with guys like Jermaine Johnson off the board, London stands out as a potential Mike Evans for Lovie Smith, who drafted the real Evans with the Buccaneers in 2014.",
    "From Las Vegas Raiders\n Round 1 - Pick 22\n Trevor Penning OL\n Northern Iowa • Jr • 6'7\" / 321 lbs\n Projected Team\n Green Bay\n PROSPECT RNK\n 35th\n POSITION RNK\n 8th\n Everyone wants a receiver for Green Bay here, but with two first-rounders, Brian Gutekunst bolsters the trenches first, securing a Day One replacement for former right tackle Billy Turner.",
    "Round 1 - Pick 17\n Devin Lloyd LB\n Utah • Jr • 6'3\" / 237 lbs\n Projected Team\n L.A. Chargers\n PROSPECT RNK\n 20th\n POSITION RNK\n 2nd\n Linebacker isn't necessarily an urgent need, even with Kyzir White gone, but boy does Lloyd's athleticism give yet another boost to Brandon Staley's reloaded defense, now featuring Khalil Mack and J.C. Jackson.",
    "From Miami Dolphins\n Round 1 - Pick 15\n Trent McDuffie CB\n Washington • Soph • 5'11\" / 193 lbs\n Projected Team\n Philadelphia\n PROSPECT RNK\n 22nd\n POSITION RNK\n 4th\n The Eagles have been burned by early-round Washington corners before, but McDuffie's toughness is worth the bet, especially with only Darius Slay proven in their secondary.",
    "Mock Trade from Arizona Cardinals\n Round 1 - Pick 23\n Nakobe Dean LB\n Georgia • Jr • 5'11\" / 229 lbs\n Projected Team\n New England\n PROSPECT RNK\n 14th\n POSITION RNK\n 1st\n After pulling off a Bill Belichick signature -- the trade down -- the Patriots hold off on addressing receiver and corner to get a new heart for their vaunted defense.",
    "From Chicago Bears\n Round 1 - Pick 7\n Evan Neal OL\n Alabama • Jr • 6'7\" / 337 lbs\n Projected Team\n N.Y. Giants\n PROSPECT RNK\n 2nd\n POSITION RNK\n 1st\n \"Sauce\" Gardner would've been a major get here, but instead, New York wisely invests in the trenches, giving Daniel Jones (and a future/potential 2023 successor) a much-improved line.",
    "Mock Trade from Philadelphia Eagles\n Round 1 - Pick 29\n Zion Johnson OL\n Boston College • Sr • 6'3\" / 312 lbs\n Projected Team\n Tampa Bay\n PROSPECT RNK\n 32nd\n POSITION RNK\n 7th\n Tampa Bay slides back and still gets one of the top interior blockers of the class, shoring up Tom Brady's front for another run at a title.",
    "Flores was reportedly a finalist for head coaching positions in Houston and New Orleans, but those clubs instead chose to hire from within; Houston promoted former defensive coordinator and Bears head coach Lovie Smith, while the Saints promoted former defensive coordinator and Raiders head coach Dennis Allen.",
    "From Philadelphia Eagles\n Round 1 - Pick 19\n Chris Olave WR\n Ohio State • Sr • 6'0\" / 187 lbs\n Projected Team\n New Orleans\n PROSPECT RNK\n 29th\n POSITION RNK\n 5th\n With a new tackle secured earlier in the first, the Saints shift gears to wide receiver, where Michael Thomas needs a running mate.",
    "Mock Trade from Seattle Seahawks\n Round 1 - Pick 9\n Derek Stingley Jr. CB\n LSU • Jr • 6'0\" / 195 lbs\n Projected Team\n N.Y. Giants\n PROSPECT RNK\n 5th\n POSITION RNK\n 2nd\n Stingley brings durability concerns, but the Giants badly need talent at corner, with James Bradberry's future unclear.",
    "NFL Mock Draft\nRound 1\n Round 1 - Pick 1\n Aidan Hutchinson EDGE\n Michigan • Sr • 6'7\" / 260 lbs\n Projected Team\n Jacksonville\n PROSPECT RNK\n 1st\n POSITION RNK\n 1st\n Protecting Trevor Lawrence is paramount, but Hutchinson is the surest thing in the top crop of impact pass-rushers.",
    "Mock Trade from Minnesota Vikings\n Round 1 - Pick 12\n Charles Cross OL\n Mississippi State • Soph • 6'5\" / 307 lbs\n Projected Team\n New Orleans\n PROSPECT RNK\n 8th\n POSITION RNK\n 2nd\n After acquiring an extra first with the Eagles, the Saints have the ammo to make a bigger splash.",
    "Round 1 - Pick 2\n Travon Walker DL\n Georgia • Jr • 6'5\" / 272 lbs\n Projected Team\n Detroit\n PROSPECT RNK\n 13th\n POSITION RNK\n 1st\n Dan Campbell likes them nasty, and Walker has the physical tools to be just that, giving Detroit a much-needed upgrade up front and off the edge.",
    "Round 1 - Pick 14\n Jordan Davis DL\n Georgia • Sr • 6'6\" / 341 lbs\n Projected Team\n Baltimore\n PROSPECT RNK\n 17th\n POSITION RNK\n 2nd\n An edge rusher or corner could be in play, but Davis offers power and pass-rushing potential for the interior, always a priority in Baltimore.",
    "Round 1 - Pick 30\n Daxton Hill S\n Michigan • Jr • 6'0\" / 191 lbs\n Projected Team\n Kansas City\n PROSPECT RNK\n 18th\n POSITION RNK\n 2nd\n This draft is all about betting big on the long term for the Chiefs, and after adding Jameson Williams in their big trade up earlier, K.C.",
    "Round 1 - Pick 26\n Kenyon Green OL\n Texas A&M • Jr • 6'4\" / 323 lbs\n Projected Team\n Tennessee\n PROSPECT RNK\n 27th\n POSITION RNK\n 6th\n They have quite a few needs yet, but protecting Ryan Tannehill and paving the way for the Derrick Henry-led run game is key.",
    "Two years earlier, while serving as New England's linebackers coach, the Patriots defeated the Falcons in Super Bowl LI after linebacker Dont'a Hightower's strip-sack of Matt Ryan ignited the largest come-from-behind win in Super Bowl history.",
    "Mock Trade from New Orleans Saints\n Round 1 - Pick 16\n Andrew Booth Jr. CB\n Clemson • Jr • 6'0\" / 194 lbs\n Projected Team\n Minnesota\n PROSPECT RNK\n 16th\n POSITION RNK\n 3rd\n With the top three corners off the board, the Vikings roll with No.",
    "Round 1 - Pick 24\n Tyler Linderbaum OL\n Iowa • Jr • 6'2\" / 296 lbs\n Projected Team\n Dallas\n PROSPECT RNK\n 9th\n POSITION RNK\n 3rd\n A trademark Cowboys selection, Linderbaum gives Dallas a short- and long-term building block for the O-line.",
    "By submitting my email I agree to receive the \"Pick Six Newsletter\" and other marketing and promotional emails from CBS Sports, which may include information from our affiliates and/or partners' offers, products and services.",
    "Mock Trade from New England Patriots\n Round 1 - Pick 21\n George Karlaftis EDGE\n Purdue • Jr • 6'4\" / 266 lbs\n Projected Team\n Arizona\n PROSPECT RNK\n 26th\n POSITION RNK\n 4th\n Chandler Jones is gone, and J.J. Watt is old.",
    "\"We congratulate Coach Flores on his new position with the Steelers and thank Coach Tomlin and the organization for giving him this great opportunity,\" Flores' attorneys said in a statement, via ESPN's Brooke Pryor.",
    "Tua Tagovailoa\n MIA • QB • 1\n View Profile\nWith Tagovailoa winning two-thirds of his starts as a rookie, the Dolphins finished the 2020 season with a 10-6 record to finish just outside of the AFC playoff picture.",
    "Mock Trade from Philadelphia Eagles\n Round 1 - Pick 18\n Jameson Williams WR\n Alabama • Jr • 6'2\" / 179 lbs\n Projected Team\n Kansas City\n PROSPECT RNK\n 11th\n POSITION RNK\n 2nd\n Hello, Tyreek Hill replacement.",
    "Mock Trade from Tampa Bay Buccaneers\n Round 1 - Pick 27\n Treylon Burks WR\n Arkansas • Jr • 6'2\" / 225 lbs\n Projected Team\n Philadelphia\n PROSPECT RNK\n 15th\n POSITION RNK\n 4th\n Another Howie Roseman trade!",
    "\"I am excited about Brian Flores joining our coaching staff given his history of developing and teaching defensive players during his time in the NFL,\" Steelers coach Mike Tomlin said in a statement.",
    "While he may be a head coach again sometime in the future, Flores will first join forces with Tomlin, who this past season became the first coach to begin his career with 15 non-losing seasons.",
    "Mock Trade from Buffalo Bills\n Round 1 - Pick 25\n Matt Corral QB\n Ole Miss • Jr • 6'2\" / 212 lbs\n Projected Team\n Detroit\n PROSPECT RNK\n 33rd\n POSITION RNK\n 3rd\n Dan Campbell, you dog, you!",
    "The Steelers will also have a new quarterback this season after Ben Roethlisberger retired after an 18-year career that included two Super Bowl victories and three Super Bowl appearances.",
    "Seattle hasn't had to think about QB in this way for a long time, and Willis' tantalizing arm and legs could sell them on a quick pivot from one dual threat (Russell Wilson) to another.",
    "Jets\n PROSPECT RNK\n 7th\n POSITION RNK\n 1st\n With pass-rusher addressed Joe Douglas gets Zach Wilson much-needed pass-catching help -- a ready-made WR1 who can work opposite Corey Davis.",
    "Mock Trade from New York Giants\n Round 1 - Pick 5\n Malik Willis QB\n Liberty • Jr • 6'1\" / 219 lbs\n Projected Team\n Seattle\n PROSPECT RNK\n 23rd\n POSITION RNK\n 1st\n And here we go.",
    "In 2008, his first season as special teams coach, Flores worked with then-rookie Matthew Slater, who this past season was selected to his 10th Pro Bowl as a special teams player.",
    "Maybe Trent Baalke values upside, but Jacksonville could really use an instant star off the edge, and Travon Walker is better suited for a role in the trenches, not standing up.",
    "Mark Brown/Getty Images\nThe Pittsburgh Steelers found a supremely qualified individual to fill their previously vacant roles at senior defensive assistant and linebacker coach.",
    "Round 1 - Pick 11\n Kyle Hamilton S\n Notre Dame • Jr • 6'4\" / 220 lbs\n Projected Team\n Washington\n PROSPECT RNK\n 4th\n POSITION RNK\n 1st\n Ron Rivera might salivate over this one.",
    "Mock Trade from Cincinnati Bengals\n Round 1 - Pick 31\n Kenny Pickett QB\n Pittsburgh • Sr • 6'3\" / 217 lbs\n Projected Team\n Atlanta\n PROSPECT RNK\n 30th\n POSITION RNK\n 2nd\n Boom!",
    "Flores will also be reunited with two-time All-Pro safety Minkah Fitzpatrick, who was traded from Miami to Pittsburgh during Flores' first season as the Dolphins' head coach.",
    "Round 1 - Pick 28\n Jahan Dotson WR\n Penn State • Sr • 5'11\" / 178 lbs\n Projected Team\n Green Bay\n PROSPECT RNK\n 42nd\n POSITION RNK\n 7th\n And there's Aaron Rodgers' receiver.",
    "For more information about our data practices consult our Privacy Policy\n See All Newsletters\n Please check the opt-in box to acknowledge that you would like to subscribe.",
    "The team traded former starters Fitzpatrick, Laremy Tunsil, Kenny Stills and Kiko Alonso, as well as part-time starter Kenyan Drake, during the season's first two months.",
    "While cornerback also deserves a big investment, Arizona moves up to secure the top remaining pass-rusher on the board, adding a plug-and-play starter at defensive end.",
    "With all but one of the top QBs still on the board, Mike Tomlin and Co. stay patient, instead adding some serious muscle to the trenches of an already-stout defense.",
    "Brian Flores, who recently concluded a three-year run as the Miami Dolphins' head coach, will fill both positions with the Steelers, the club announced Saturday.",
    "Prior to coaching the Dolphins, the 40-year-old coach spent 15 seasons with the Patriots that included stints as special teams, linebackers and safeties coach.",
    "\"While Coach Flores is now focused on his new position, he will continue with his race discrimination class action so that real change can be made to the NFL.\"",
    "We've got plenty of drama unfolding in our latest first-round mock below, including a couple of surprise quarterback selections and seven -- count them, seven!",
    "That was the season when Flores alleged that Dolphins owner Stephen Ross offered him $100,000 per loss in order to increase Miami's odds at securing the No.",
    "Here, they seize on the opportunity to stop Pickett's slide, trading back in to secure a fifth-year option for the potential next face of their franchise.",
    "As linebackers coach, Flores will work closely with Jerry Olsavsky, who has served as the Steelers' inside linebackers coach since the 2015 season.",
    "In Pittsburgh, Flores will get a chance to work with reigning Defensive Player of the Year T.J. Watt and All-Pro defensive tackle Cameron Heyward.",
    "Pick Six Newsletter\n Crafted By The Best NFL Experts\n Get the day's big stories + fun stuff you love like mock drafts, picks and power rankings.",
    "Round 1 - Pick 20\n Devonte Wyatt DL\n Georgia • Sr • 6'3\" / 307 lbs\n Projected Team\n Pittsburgh\n PROSPECT RNK\n 28th\n POSITION RNK\n 4th\n Surprise!",
    "This time, he moves up two spots to snag a running mate for DeVonta Smith, giving Nick Sirianni's run-heavy attack a potential Deebo Samuel.",
    "Falcons ownership adored Matt Ryan for both his on- and off-field leadership, and Pickett has the character to earn their respect early on.",
    "The Dolphins ultimately missed the playoffs last season but were able to salvage a winning record after defeating the Patriots in Week 18.",
    "They can afford to be patient with Williams' injury recovery, securing a fifth-year option and allowing him to grow with Patrick Mahomes.",
    "Flores, who earlier this month sued the NFL for racial discrimination, went 19-14 during his final two seasons as the Dolphins' coach.",
    "Pittsburgh will look to strengthen the offensive and defensive lines this offseason in both free agency as well as during the draft.",
    "After adding Travon Walker near the top of the draft to shore up the D-line, Detroit uses some of its extra ammo to move up from No.",
    "Kansas City makes a big leap, dealing with Andy Reid's old friends to secure maybe the top playmaker of this year's receiver class.",
    "This offseason has already been wacky and wild, chock-full of blockbuster moves -- surprise trades, big-name holdouts, you name it.",
    "Flores will succeed Teryl Austin as Pittsburgh's senior defensive assistant after Austin was promoted to defensive coordinator.",
    "Flores was hired by the Dolphins in 2019 after helping the Patriots hold the Rams to just three points in Super Bowl LIII.",
    "Ross sent shockwaves throughout the NFL when he decided to fire Flores just days after the conclusion of the 2021 season.",
    "32 and swipe maybe the most aggressive QB of the class ahead of the Titans, a dark-horse landing spot for signal-callers.",
    "In Miami, Flores inherited a team that was clearly in rebuilding mode after winning 13 games the previous two seasons.",
    "A QB would be spicy (and understandable), but with Terron Armstead gone, their left-tackle need is just as prominent.",
    "From Seattle Seahawks\n Round 1 - Pick 10\n Garrett Wilson WR\n Ohio State • Jr • 6'0\" / 183 lbs\n Projected Team\n N.Y.",
    "Dotson does a lot of little things well, which makes him a logical target for a clockwork offense managed by A-Rod.",
    "The 2021 Steelers made the playoffs on the strength of the league's top-ranked pass rush, led by Watt's 22.5 sacks.",
    "Miami started 1-7 this season before rallying to win seven consecutive game to climb back into playoff contention.",
    "Jets\n PROSPECT RNK\n 6th\n POSITION RNK\n 2nd\n Don't rule out a tackle here; Joe Douglas loves investing up front.",
    "Buckle up:\nFor a more extensive draft discussion beyond the mock drafts, check out our weekly show on YouTube!",
    "But they still need more juice off the edge, and Thibodeaux brings requisite size and skill (and then some).",
    "Hamilton's range and versatility essentially help Washington satisfy two needs (LB, S) with one pick.",
    "\"Brian's resume speaks for itself, and I look forward to him adding his expertise to help our team.\"",
    "4, securing a long-term partner/successor for Patrick Peterson as the new regime gets underway.",
    "Miami started the 2019 season with an 0-7 record before rallying to finish with a 5-11 record.",
    "Round 1 - Pick 4\n Kayvon Thibodeaux EDGE\n Oregon • Soph • 6'4\" / 254 lbs\n Projected Team\n N.Y.",
    "Dean's potential as a tackling machine gives New England an immediate upgrade on the inside.",
    "Olave possesses the all-around skill set to be an instant target funnel for Jameis Winston.",
    "Remember the old days, when they shook up the first round by moving up for Julio Jones?",
    "5 overall pick, which they used to select former Alabama quarterback Tua Tagovailoa.",
    "The Dolphins replaced Flores with former 49ers offensive coordinator Mike McDaniel.",
    "Cameron Heyward isn't getting any younger, and they like themselves a nasty D-line.",
    "That makes two first-round swaps just since their pre-draft deal with the Saints.",
    "New England won four Super Bowls during Flores' run with the organization.",
    "gets a ready-made Tyrann Mathieu replacement to pair with Justin Reid.",
    "Green has enough talent to start just about anywhere up front.",
    "They've got the ammo to move up after parting with Russ.",
    "Missing out on \"Sauce,\" they get the next best thing.",
    "There was an error processing your subscription.",
    "But who's to say the draft will be any quieter?",
    "Get ready for the camp battle with Jared Goff.",
    "He'd be an instant fan favorite in New York.",
    "Watch Now:\nThe 2022 NFL Draft is upon us.",
    "1 overall pick in the 2020 NFL Draft.",
    "Dak Prescott's health takes priority.",
    "The Dolphins ended up with the No.",
    "Gotta keep Aaron Rodgers upright!",
    "Cross gives them a long-term No.",
    "-- different projected trades.",
    "Keep an eye on your inbox.",
    "Thanks for signing up!",
    "under center.",
    "Sorry!",
    "1."
  ]
}