{
  "id": 5133,
  "mediaId": 2712,
  "date": "2022-02-18",
  "headline": "Morgan Stewart welcomes second child with Dr. Phil’s son Jordan McGraw & reveals unique name of their baby boy",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2022/02/ao-comp-morgan.jpg?strip=all&quality=100&w=1500&h=1000&crop=1",
  "link": "https://www.thesun.co.uk/tvandshowbiz/celebrities/17701962/morgan-stewart-child-dr-phil-son-jordan-mcgraw/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Valerie Nome",
  "authorUrl": "https://www.thesun.co.uk/author/valerie-nomethe-sun-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Most read in Celebrity\n'MASSIVE SCARE'\nEmotional Kerry Katona reveals her mum is in hospital after heart attack\nHE'S BAD\nInside 'animal lover' Jacko's zoo - with giraffes burned & chimp Bubbles beaten\nLOOKING FIT\nMark Wright & Michelle Keegan look incredible as they model new sports range\nINTO THE WOODS\nKatie Price 'confirms' she's back with ex Carl as she posts pic of him\nMorgan wrote \"Dada\" while mom Robin McGraw wrote, \"Our son has a son!",
    "Row enjoyed a day out with dad Jordan and mom MorganCredit: Instagram/@morganstewart\nFamily moment: Jordan, Dr. Phil McGraw and Morgan celebratedCredit: Instagram/@drphil\nJordan and Morgan dated a decade before she married her ex-husbandCredit: Getty\nWe pay for your stories!",
    "Morgan Stewart cuddled son GreyCredit: Instagram/@morganstewart\nOff to dad: Jordan McGraw got to know son GreyCredit: Instagram/@morganstewart\n\"GREY OLIVER MCGRAW joined us exactly one year and a day after his big sister and we are so in love,\" she posted.",
    "Alongside a snap of her cradling her new daughter in the hospital bed, Morgan wrote: \"Row Renggli McGraw just quickly wanted me to update you guys that after 30 hours, 27 apple juices, & 16 pushes later that she decided to join our party!",
    "1\nThe couple welcomed their first child together just a few months earlier, with the TV personality sharing the happy news with an adorable photo on Instagram.",
    "2 BACKSTORY\nMorgan announced the news on Instagram with a sweet photo of her showing off her baby bump in a tight skirt, while her husband rested a hand on it.",
    "Nicky Hilton commented, \"Sweet!,\" with an arrow-through-the-heart emoji, and Sofia Richie wrote, \"Ahh congrats\" with a heart-eyed smiley face.",
    "MORGAN Stewart welcomed her second child with Dr. Phil’s son Jordan McGraw and revealed the unique name of their baby boy.",
    "Jordan also shared a snap of himself cradling their daughter, which he simply captioned: \"Row Renggli McGraw 2/16/21.\"",
    "Like us on Facebook at www.facebook.com/TheSunUS and follow us from our main Twitter account at @TheSunUS",
    "host, 33, took to Instagram Friday to post a photo of herself cradling the little one in a hospital bed.",
    "Morgan and Jordan dated a decade ago before rekindling their relationship after her split from her ex.",
    "Morgan announced that she and Dr. Phil's son were expecting their first child together in August 2020.",
    "Joe and Nick Jonas each sent a few heart emojis, while Vanderpump Rules' Stassi Schroeder said: \"No.",
    "Jordan, 35, shared an Instagram post of his own, holding the infant, writing, \"Grey Oliver McGraw.",
    "\"We can’t wait to meet baby #2, we love you,\" she wrote, punctuating with heart balloon emojis.",
    "host joked in the caption of the pregnancy announcement: “Maybe this baby will look like me?",
    "xoxoxo\"\nThe couple, who wed in December 2020, are also parents to daughter Row, one.",
    "The Keeping Up With The Kardashians star posted, \"Congratulations beautiful mommy!\"",
    "?”\nMeanwhile, Jordan wrote in his post: “Round 2” with a heart emoji.",
    "Other famous faces chimed in to send their love and congratulations.",
    "host finalized her divorce from ex-husband Brendan Fitzpatrick.",
    "Email us at exclusive@the-sun.com or call 212 416 4552.",
    "She also commented on Morgan's post: \"Over the moon!!!!",
    "Khloe Kardashian was the first to send her best wishes.",
    "\"And she's definitely the coolest girl I've ever met.\"",
    "with a kiss-blowing emoji and heart-eyed smiley face.",
    "Congratulations Morgan and Jordan and sister Row!!!",
    "News of the pregnancy came just days after the E!",
    "His mom, Robin, excitedly commented: \"Yay!!!!",
    "I can’t say congratulations enough!!!!!!!!\"",
    "Do you have a story for The US Sun team?",
    "You and Morgan and Row are adorable!!",
    "We love you Grey Oliver!!",
    "We love you so much!!\"",
    "MORGAN!!!!!!!!!!!!!!!",
    "This is amazing!!!!!!",
    "You are the queen!!!",
    "The news is out!!!",
    "Freaking.",
    "2/17/22.\"",
    "BABY NO.",
    "BABY NO.",
    "Yay!!!!",
    "The E!",
    "The E!",
    "WAY."
  ]
}