{
  "id": 5149,
  "mediaId": 2712,
  "date": "2022-02-21",
  "headline": "Energy boss has wood burner fitted at mansion after telling customers to cuddle pets to stay warm",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2022/02/EXL-pg17-1.jpg?strip=all&quality=100&w=1500&h=1000&crop=1",
  "link": "https://www.thesun.co.uk/news/17727255/ovo-energy-boss-wood-burner-cuddle-pets/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Most read in News\nWHO NEXT\nZelensky warns of Putin's terrifying plans as this is the 'beginning'\nNUKE ALERT\nRussia preparing to deploy devastating 'Satan-2' nukes which can wipe out UK\nDESPERATE SEARCH\nTour boat with 26 on board goes missing with 'no sign of survivors'\nDEATH RIDDLE\nMan arrested for murder after body found in car outside hospital\n“Meanwhile his customers are left shivering unable to pay bills.",
    "“We can’t all live in mansions but we all have the right to a warm home, and that needs system change.”\nTory MP Craig Mackinlay added: “It seems another instance of do what I say but not as I do.”\nCotswold district council gave the nod for the Anevay Tana stove at Fitzpatrick’s Gloucestershire home two months ago.",
    "Ovo Energy founder Stephen Fitzpatrick has had a £1,199 stove installed at his £3.2million boltholeCredit: Times Newspapers Ltd\nIt comes as Brits face energy bill rises of £700 a year — taking the average household bill to £1,971.",
    "Fitzpatrick said: “It was a bad day, we made a mistake.”\nGreen Party’s Amelia Womack said: “It’s clear he’s found a cosy alternative to cuddling his cat and doing star jumps to keep warm.",
    "Fitzpatrick, worth an estimated £675million, founded Ovo in 2009Credit: Marc Giddings\nLast month Ovo was blasted after sister firm SSE Energy told customers to cuddle pets to stay warm",
    "In findings published last week it cut the estimated proportion of particle pollution they produce from 38 per cent to 17 per cent — still higher than transport’s 12 per cent.",
    "Yet the Environment Department says domestic wood fires are worse than road transport for causing fine particle emissions — the most dangerous type of air pollution.",
    "AN energy boss whose firm told customers to cuddle their pets to stay warm had a pollution-pumping wood burner fitted at his mansion.",
    "Ovo Energy founder Stephen Fitzpatrick has had a £1,199 stove installed at his £3.2million bolthole.",
    "Last month Ovo was blasted after sister firm SSE Energy told customers to cuddle pets to stay warm.",
    "He has said he wants Ovo to cut its emissions to net zero by 2030.",
    "Fitzpatrick, worth an estimated £675million, founded Ovo in 2009.",
    "It is Britain’s third-biggest supplier.",
    "Ovo declined to comment."
  ]
}