{
  "id": 5196,
  "mediaId": 2608,
  "date": "2022-02-22",
  "headline": "WATCH: Former Doctor Fentanyl Murder Trial",
  "image": "https://lawandcrime.com/wp-content/uploads/2022/02/Dr.-William-Husel.jpg",
  "link": "https://lawandcrime.com/live-trials/live-trials-current/william-husel/watch-former-doctor-fentanyl-murder-trial/",
  "mediaOutlet": "lawnewz.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alberto Luperon",
  "authorUrl": "https://lawandcrime.com/author/alberto-luperon/",
  "termIds": [
    2512,
    2652,
    2731,
    3795,
    4664
  ],
  "sentences": [
    "“They were unstable patients already on full life support who were in the process of dying, and these are people who didn’t want to die with tubes coming out of their bodies and had expressed their wishes previously.”\n“What it’s about is really about death and dignity,” Baez said, “and I think this case is an affront to all caring and compassionate doctors out there who want to allow people to have their last moments on Earth be peaceful ones free of pain, and allow their loved ones to see them die with dignity.”",
    "Husel is on trial for allegedly murdering James Allen, 80, Troy Allison, 44, Bonnie Austin, 64, Joanne S. Bellisari, 69, Francis Burke, 73, Sandra Castle, 80, Ryan Hayes, 39, Jeremia “Sue” Hodge, 57, Brandy McDonald, 37, Danny Mollette, 74, Melissa Penix, 82, Beverlee Ann Schirtzinger, 63, James “Nick” Timmons, 39, and Rebecca Walls, 75.",
    "Prosecutors have dropped charges concerning Corrinnia Blake, 55, Emma Bogan, 75, Larry Brigner, 70, Timothy Fitzpatrick, 55, Janet Kavanaugh, 79, Charles Longstreth, 67, Thomas Matthews, 61, Robert P. Lee, 70, Jan Marlene Thomas, 65, Michael Walters, 57, and Norma J. Welch, 85.",
    "“What everyone must know right off the bat that these are patients who their families had agreed to withdraw life support measures,” he said in a Feb. 9 interview on The Law&Crime Network.",
    "And now to hear that 11 of these cases were dismissed, she is dying all over again.”\nHusel attorney Jose Baez is arguing his client was only alleviating pain as patients were dying.",
    "Prosecutors in Columbus, Ohio, initially sought 25 counts of murder against William Husel, 46, but they ended up dropping 11.",
    "A former doctor is on trial for allegedly murdering patients through lethal doses of fentanyl.",
    "“Every time her name flashes in the story – it’s back in the news.",
    "Jan’s son Sean Thomas remarked bitterly on the state’s decision.",
    "She dies again,” he said in a WBNS report from Jan 21.",
    "He denied that the doctor gave anyone an overdose.",
    "No compatible source was found for this media.",
    "You can watch in the player above.",
    "There is movement in the case.",
    "“Every time this is covered.",
    "Court is dark on Fridays.",
    "She dies all over again.",
    "This is a modal window."
  ]
}