{
  "id": 5206,
  "mediaId": 4056,
  "date": "2022-02-17",
  "headline": "Bill would prevent immigration arrests in and around courthouses",
  "image": "https://vtdigger.org/wp-content/uploads/2018/11/Migrant-Justice-3.jpg",
  "link": "https://vtdigger.org/2022/02/17/bill-would-prevent-immigration-arrests-in-and-around-courthouses/",
  "mediaOutlet": "vtdigger.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ethan Weinstein",
  "authorUrl": "https://vtdigger.org/author/ethan-weinstein/",
  "termIds": [
    0
  ],
  "sentences": [
    "Current laws “have a chilling effect on people’s ability and willingness to both work with law enforcement and engage in court proceedings,” said Falko Schilling, advocacy director for the Vermont chapter of the American Civil Liberties Union.",
    "“We have a responsibility not just to benefit from the labor and the presence of folks who are in the state, but also to recognize that as members of our community,” said Xusana Davis, Vermont’s racial equity director.",
    "“We’ve got to have a focus to make sure they’re well protected as long as they’re on our turf.”\nIn the first year of Donald Trump’s presidency, arrests by U.S. Immigration and Customs Enforcement rose by 30%.",
    "And while the Biden administration has rolled back those Trump-era arrests, states such as New York, Washington and Oregon have passed laws to further prevent ICE from operating in the vicinity of courts.",
    "“Our immigrant community is afraid of going to courts in this state because of the fear of being arrested,” said Olga Cruz, a dairy worker who testified before the Senate Judiciary Committee on Wednesday.",
    "And with 70% of the state’s agricultural revenue, roughly $2.2 billion, coming from dairy, Vermont relies heavily on the industry — and its often undocumented workforce — to pay the bills.",
    "“All you’re thinking about is if an immigration agent is going to arrest you when you leave.”\n“What we’re asking, as a community, is for these detentions to be prohibited,” she said.",
    "“We are a state that is, of course, a border state, and because of that, we’ve experienced more than our fair share of tension with the federal government,” Davis said.",
    "If S.140 passed, a person who was arrested in violation of the bill would be able to sue for monetary damages, legislative council Erik FitzPatrick said.",
    "A new bill would protect migrant workers who participate in court proceedings from being arrested at the courthouse for federal immigration offenses.",
    "As Lambek explained, a migrant worker might appear in court as a witness or to assist a family member through court proceedings.",
    "“I personally have received multiple calls from people as they’re being detained during and after court appearances,” he said.",
    "There are between 1,200 and 1,500 migrant workers in Vermont who help sustain the dairy industry, Migrant Justice estimated.",
    "Advocates for S.140 made clear during Wednesday’s testimony that the bill would make Vermont safer for its entire workforce.",
    "If passed, S.140 would prevent U.S. Immigration and Customs Enforcement from making civil arrests in and around courthouses.",
    "RELATED STORIES\n“When you have to go to court, you aren’t even thinking about what the judge might say to you,” Cruz said.",
    "She spoke in Spanish with Will Lambek, a representative from the nonprofit advocacy group Migrant Justice, translating.",
    "With its proximity to Canada, Vermont is more susceptible than most states to the presence of border control.",
    "If more people feel comfortable cooperating with law enforcement, Vermont would be safer, he said.",
    "With that bump came increased arrests inside and around courthouses."
  ]
}