{
  "id": 5207,
  "mediaId": 2712,
  "date": "2022-02-24",
  "headline": "Inside Love Island’s Abi Rawlings’ new home as she moves in with new boyfriend",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2022/02/crop-17754071-1.jpg?strip=all&quality=100&w=701&h=467&crop=1",
  "link": "https://www.thesun.co.uk/tv/17753769/love-island-abi-rawlings-home-boyfriend/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Gallagher",
  "authorUrl": "https://www.thesun.co.uk/author/mary-gallagher/",
  "termIds": [
    0
  ],
  "sentences": [
    "Most read in Love Island\n'horrible'\nLaura Whitmore hits back at Love Island star over Iain Stirling job claims\nNO LOVE LOST\nLove Island's Laura Whitmore SLAMMED by ex contestant\nCRACKIN' ON\nHere's when you can watch the new series of Love Island\n'it was crazy'\nSiannise Fudge cries as she gets 'closure' during psychic reading\nHer Love Island co-stars soon congratulated her beneath the photos, with Sharon Gaffka writing: \"So happy for you both!",
    "Love Island's Abi Rawlings has bought a new home with her boyfriend DavidCredit: Instagram\nShe gave a glimpse inside the home which has plush grey carpetsCredit: Instagram\nAbi, 28, shot to fame on Love Island last yearCredit: Rex\nAbi, who shot to fame on the 2021 series of Love Island, posed with events director David outside the red-brick pad and the pair looked completely in love with their house.",
    "At the time, she explained that she compared the lads in the villa to her last partner - and has since said she was glad that she hadn't found a connection with anyone after reuniting with her former flame.",
    "In other snaps David, who is the founder of exclusive events business Roles and the director Prospect Football Ltd, was seen kissing Abi, and the pair celebrated with a bottle of fizz.",
    "She was initially partnered with Toby but he ditched her for someone else in Casa AmorCredit: Rex\nShe partnered with Dale Mehmet next but failed to find loveCredit: Rex",
    "The tattoo artist, 27, announced her exciting news last night after getting back together with David Aboro Fitzpatrick following their split last summer.",
    "Speaking exclusively to The Sun in October, Abigail said: \"It’s a guy that I’ve dated before; we never really made it to relationship status.",
    "\"I missed him anyway and I didn’t have very much luck in there and naturally you do just think about the last person you were with.\"",
    "Abi reunited with David after she failed to find love with Toby Aromolaran and Dale Mehmet during the 2021 Love Island series.",
    "\"I actually reached out to him, before it wasn’t working relationship-wise and we became best friends before I went in.",
    "LOVE Island star Abigail Rawlings has moved in with her boyfriend and given fans a glimpse inside their plush new home.",
    "!”\nThe pair wore comfy tracksuits in the snap and both showed off their toned physiques.",
    "\"But we’re back dating now and it’s going really well, I’m really happy to be honest.",
    "I can’t believe I’m announcing this but.. We bought a mother fudging houseeee!!",
    "She held a set of keys in the sweet snap and gushed: “Such a pinch me moment.",
    "It’s my absolute dream house with my absolute dream man ???",
    "And Liberty Poole said: \"So happy for you bubs ??\"",
    "“I’m honestly so so happy, it doesn’t feel real!",
    "#sofreakingrateful eeeeeek!",
    "??????",
    "??\""
  ]
}