{
  "id": 5234,
  "mediaId": 6593,
  "date": "2022-02-18",
  "headline": "From the Archives: Great Backyard Bird Count turns 25",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/de1021b/2147483647/strip/true/crop/3545x1861+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc5%2F93%2F9ffdae0e4069898ff862cbae51b9%2Ffeb-10-1998-backyard-bird-count.jpg",
  "link": "https://www.sandiegouniontribune.com/news/local-history/story/2022-02-18/from-the-archives-great-backyard-bird-count-turns-25",
  "mediaOutlet": "San Diego Union Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "From The San Diego Union-Tribune, Tuesday, Feb. 10, 1998:\nWeb site opens annual winter backyard bird count to all\nBy Steve La Rue\nPeople from all over the country, even those with more interest than experience in bird-watching, are being recruited via the World Wide Web as volunteers for a continent-wide bird count on Feb. 20, 21 and 22.",
    "During the first Great Backyard Bird Count in 1998 over 14,000 people across the country tallied more than half a million birds and shared that information via the Internet in an innovative real-time citizen-science project.",
    "In the Northeast, another goal for the count is to gauge the size and extent of what is reported to be a mass migration of seed-eating finches from Canada into the United States, on a scale that hasn’t happened since 1983.",
    "“People have the idea you have to be good at identifying birds, and you have to go out and stand in the snow for long periods,” he said, adding, “This time, you just have to watch the birds that come to your bird feeder.",
    "And if you see a bird you are not familiar with, there are plenty of pictures and help on the Web site to help you.”\nThe event is also sponsored by Cornell University’s Laboratory of Ornithology.",
    "Participants will contribute their sightings online by filling out a form that describes when and where they made their observations and what species they saw over the weekend of Feb. 20-22.",
    "“A record number of migratory bird species that normally winter in Central and South America have reportedly been seen spending this winter in the northern states,” Fitzpatrick said.",
    "Another advantage of using the Web to tally the count is that participants will be able to watch the tallies of different bird species as they are submitted.",
    "Usually, this would be limited only to birding clubs,” said Kevin Sequeira, spokesman for the National Audubon Society.",
    "One of its key aims is to identify how such weather phenomena as El Nino affect bird movements and concentrations.",
    "It is easy to participate in, and it is good for science,” said John Fitzpatrick, director of the laboratory.",
    "More information about the event can be obtained at http://birdsource2.ornith.cornell.edu/birdsource.",
    "He said the count may help scientists verify or discount unusual field reports this winter.",
    "The “Birdsource Great ’98 Backyard Bird Count” is touted as the first Internet bird survey.",
    "In 2021, an estimated 300,000 people submitted checklists reporting 6,436 species.",
    "The 25th edition of the event runs from today, Feb. 18, through Monday, Feb. 21.",
    "He said watching the results will be something like watching election returns.",
    "“It is a state-of-the-art project and a great family activity.",
    "“People will get feedback almost immediately,” said Sequeira.",
    "The Web site is at http://birdsource.cornell.edu/.",
    "“We are opening the count up to everybody.",
    "For more information, see birdcount.org.",
    "Neither phenomenon is well understood.",
    "You can involve the whole family.",
    "It is fun."
  ]
}