{
  "id": 5264,
  "mediaId": 6497,
  "date": "2022-02-24",
  "headline": "Hilary Bevan Jones Taking Back Seat at Endor as Carlo Dusi Takes Over as Managing Director",
  "image": "https://www.hollywoodreporter.com/wp-content/uploads/2022/02/HBJ_Headshot.jpg?w=1024",
  "link": "https://www.hollywoodreporter.com/tv/tv-news/hilary-bevan-jones-endor-carlo-dusi-1235098829/",
  "mediaOutlet": "Hollywood Reporter",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Ritman",
  "authorUrl": "https://www.hollywoodreporter.com/author/alex-ritman/",
  "termIds": [
    1362,
    2562,
    3643,
    551
  ],
  "sentences": [
    "“As a company, we have never been busier and, with the projects I brought into Endor from my time at Red Arrow Studios International now forming part of the overall slate, our pipeline has never looked more exciting – so we are in for a fantastic ride over the coming months.”\nMcBain joined Endor at the end of 2015 as head of finance and commercial affairs after spells as financial controller at both Twenty Twenty Productions and Left Bank Pictures on a raft of scripted and non-scripted shows.",
    "The Emmy-winning producer, whose credits include The Girl in the Cafe, Deep State, Vienna Blood and Amazon’s upcoming Neil Gaiman adaptation Anansi Boys, and who served as BAFTA chair 2006-2008 (the first woman to hold the position), has decided to dedicate more time to hands-on producing, according to the Red Arrow Studios-owned company.",
    "“I could not be more thrilled to take on the managing director role at Endor and continue to work with the wonderful Endor family in building upon the legacy that Hilary has created through her incredible slate of projects,” said Dusi, whose credits include the Taboo, Before I Go to Sleep, Get Santa and The Aftermath.",
    "With Carlo and Ian leading them into 2022 and beyond, I have no doubt that there will be a positive and dynamic future ahead.”\nAlongside Dusi and McBain, Endor’s team includes Eamon Fitzpatrick (head of production), Jez Swimer (producer), Samantha White (production manager) and Charlie Niel (development executive).",
    "Carlo Dusi — who joined Endor last year from Red Arrows Studios International as exec producer and strategy director — has been named managing director, taking over from Jones, with Ian McBain promoted to the role of director of finance and operations.",
    "“I am delighted to be continuing my partnership with Endor on projects I have developed with the team that are close to my heart,” said Jones, now shooting Anansi Boys in Scotland.",
    "British TV veteran Hilary Bevan Jones is taking a step back from the helm of Endor Productions, the company she founded in 1998.",
    "“The company hosts a very talented team of people, all of whom I value immensely.",
    "She will move to an executive producer role."
  ]
}