{
  "id": 5286,
  "mediaId": 2722,
  "date": "2022-02-19",
  "headline": "Warrington Wolves chief explains why mascot in tiny car drove off with the ball",
  "image": "https://i2-prod.mirror.co.uk/incoming/article26265234.ece/ALTERNATES/s1200/1_Warrington-Wolves-v-Castleford-Tigers-Betfred-Super-League-Rugby-League-Halliwell-Jones-stadium.jpg",
  "link": "https://www.mirror.co.uk/sport/rugby-league/warrington-wolves-castleford-tigers-26279200",
  "mediaOutlet": "themirror",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fraser Watson",
  "authorUrl": "https://www.mirror.co.uk/authors/fraser-watson/",
  "termIds": [
    0
  ],
  "sentences": [
    "She appeared to miss her cue though, instead surging past the official and although home centre Toby King took action by turning the car back around in the right direction the mascot evaded the referee a second time.",
    "\"I can't disclose that,\" joked Fitzpatrick, before saying \"But the original plan was that 'Whizzy Rascal' was going to drive onto the pitch, drop the ball off to the referee, and drive off the other side.",
    "The crowd at the Halliwell Jones Stadium embraced the fun, cheering her on until the ball was eventually stripped from the mascot and thrown to fullback Stefan Ratchford to get things going.",
    "Obviously they brought the match football on [with a remote controlled car], and you have the Catalan Dragons who brought the kicking tee on, so we thought how can we do something better?\"",
    "In an hilarious opening to Friday's Super League clash, 'Whizzy Rascal' drove a mini car onto the pitch with the ball, and was supposed to give it to referee James Child.",
    "The impromptu delay didn't seem to affect the focus of the home side anyway, as they proceeded to hammer The Tigers 34-10 as wing Josh Charnley crossed for two tries.",
    "The footage soon went viral on social media and was lapped up by fans, and on Saturday, Wolves' Karl Fitzpatrick went onto BBC television to offer an explanation.",
    "The chief executive of the Warrington Wolves has explained why the mascot for their game against Castleford Tigers appeared to drive off with the match ball.",
    "\"So when we did the debrief she said 'I didn't see the man in the green so I just thought I'd do some free-wheeling' and she enjoyed the experience.\"",
    "Fitzpatrick was asked whether \"sticky breaks\" were the issue or if she had intentionally gone past the referee twice.",
    "He said after discussions with car provider Halliwell Jones, they were offered a mini-car.",
    "It meant two wins from two for Warrington after beating Leeds Rhinos 22-20 last weekend.",
    "He also explained what prompted the club to come up with the original plan.",
    "Up pops 'Whizzy rascal' - and she certainly lived up to her name.\"",
    "\"The next thing then was we need a driver,\" he continued.",
    "\"We came up with the idea after the Euro's.",
    "\"So we went on a search to find a driver."
  ]
}