{
  "id": 5352,
  "mediaId": 2889,
  "date": "2022-02-18",
  "headline": "Morgan Stewart Gives Birth, Welcomes 2nd Baby With Husband Jordan McGraw",
  "image": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2021/12/Morgan-Stewart-Gives-Birth-Welcomes-2nd-Baby-With-Husband-Jordan-McGraw-.jpg?crop=0px%2C31px%2C1877px%2C987px&resize=1200%2C630&ssl=1&quality=86&strip=all",
  "link": "https://www.usmagazine.com/celebrity-moms/news/morgan-stewart-gives-birth-welcomes-2nd-baby-with-jordan-mcgraw/",
  "mediaOutlet": "US Weekly",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Riley Cardoza",
  "authorUrl": "https://www.usmagazine.com/author/rcardozaami/",
  "termIds": [
    0
  ],
  "sentences": [
    "I wanted to take the time to clarify that our reason for separating has nothing to do with anything other than two people who sadly grew apart, deciding what’s best for themselves in the next phase of their lives.”\nThe former blogger first dated Jordan before she wed Fitzpatrick, 32.",
    "Dad and I are so happy for you both and precious Row,” the Inside My Heart author, 67, wrote, while the Renovate My Family alum, 42, added, “Happy anniversary you love birds!”\nStewart was previously married to Brendan Fitzpatrick, but she and her fellow E!",
    "“I know many of you have been curious about the current status of mine and Brendan’s relationship,” the California native wrote via Instagram in August of that year.",
    "The most complete I’ve ever felt,” the Rich Kids of Beverly Hills alum gushed via Instagram in December 2021 while celebrating her and McGraw’s first anniversary.",
    "Cheers to so much more.”\nDr. Phil McGraw’s son, 35, added in a post of his own: “Who would’ve thought you could fit so many perfect moments into one year?",
    "I love you!”\nThe Texas native’s family members sweetly commented on the social media upload, including mom Robin McGraw and brother Jay McGraw.",
    "Since the couple’s eldest child, Row, arrived, their sex life has been “rickety,” the new mom said during an April 2021 episode of her E!",
    "“Many of you got to know us and our story through the show, and feel connected to us, and for that, we are forever grateful.",
    "Brendan and I have spent six wonderful years together, but we have made the difficult decision to go our separate ways.",
    "The couple tied the knot in December 2020 in California, four months after the pair’s first pregnancy announcement.",
    "“My first postpartum checkup when she was like, ‘You’re gonna feel a little pressure.’ [But] where’s the pressure?",
    "The Daily Pop star gave birth on Thursday, February 17, to her and husband Jordan McGraw’s second baby.",
    "“GREY OLIVER MCGRAW joined us exactly one year and a day after his big sister and we are so in love ?",
    "“Thank you for being the perfect partner and for allowing me to calm the f–k down.",
    "With you, I know that each of our next will be more special than the last forever.",
    "Seven months later, the former reality star, 33, debuted her second baby bump.",
    "?,” she wrote on Friday, February 18, via Instagram alongside a hospital snap.",
    "Thank you for making our first so incredible, @morganstewart.",
    "They reconciled in late 2019, getting engaged in July 2020.",
    "I was like, there’s an entire appliance in me.",
    "“One year and almost two perfect babies later.",
    "Their daughter, Row, arrived in February 2021.",
    "I felt nothing,” Stewart joked in April 2021.",
    "Happy tears flowing after reading this.",
    "I’m still not sure how I got so lucky.",
    "personality called it quits in 2019.",
    "Morgan Stewart is a mom — again!",
    "“Things were really open.",
    "I can’t feel a thing.”",
    "I love you!",
    "“Wow.",
    "show."
  ]
}