{
  "id": 5358,
  "mediaId": 2518,
  "date": "2022-02-16",
  "headline": "Central stifles Conway at the end",
  "image": "https://wehco.media.clients.ellingtoncms.com/static-4/ao_redesign/graphics/adgog.jpg",
  "link": "https://www.arkansasonline.com/news/2022/feb/16/central-stifles-conway-at-the-end/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Todd Pearce",
  "authorUrl": "https://www.arkansasonline.com/staff/todd-pearce/",
  "termIds": [
    0
  ],
  "sentences": [
    "Central tied its Class 6A-Central game with Conway on a short bank shot by Annor Boateng with 56.3 seconds to play, and the Tigers took the lead on two free throws by Gavin Snyder with less than 14.9 seconds left.",
    "6A-CENTRAL BOYS\nLITTLE ROCK CENTRAL 46, CONWAY 44\nLittle Rock Central did not shoot the ball well Tuesday night at Boone-Fitzpatrick Fieldhouse, but the Tigers' defense was impenetrable when it had to be.",
    "1 CONWAY 70, LR CENTRAL 28\nConway, the Arkansas-Democrat-Gazette's top-ranked girls basketball team, outscored Central 26-7 in the third quarter led to a dominant road victory.",
    "Snyder, who led Central with 18 points, gave the Tigers the lead, and the Wampus Cats went without a timeout to try to force overtime but couldn't get a shot off.",
    "Culberson's steal with the scored tied at 44-44 and the shot clock running down on Conway's possession led to Snyder driving the other way and getting fouled.",
    "Central tied it 44-44 on Boateng's basket, but the Wampus Cats had the ball with a chance to take the lead with less than 30 seconds to go.",
    "Central hit 15 of 46 from the field (32%), including 3 of 19 on three-point attempts,\n\"Our defense stepped up and saved us,\" Ross said.",
    "Conway could not get off a good shot, and Central's Daniel Culberson came away with the ball after a scramble on the floor.",
    "Central Coach Brian Ross said the Tigers relied on their defense because they couldn't count on their offense.",
    "Defense sealed Central's 46-44 victory over a reeling Conway team that has lost seven consecutive games.",
    "Conway (24-1, 10-0 6A-Central) led Central (17-8, 4-6) 18-6 after one quarter and 35-16 at halftime.",
    "Conway led 44-42 with 1:23 to play on Keiron Duncan's layup off a feed from Colen Thompson.",
    "Snyder (18), Boateng (9) and Luke Moore (8) accounted for all but 9 of Central's points.",
    "Conway shot 9 of 22 from the field in the first half, with 12 rebounds and 8 turnovers.",
    "Central (17-8, 4-6) had more turnovers (28) than points (23) through three quarters.",
    "\"He was focused, he was locked in and he played really well,\" Ross said of Snyder.",
    "Culberson got the ball to Snyder, who was fouled with 14.7 seconds to play.",
    "Five of Conway's losses during that span have been by five or fewer points.",
    "Junior Cloe Clardy and freshman Alexis each scored 14 points for Conway.",
    "\"When you get down inside two-three minutes, it's about making plays.",
    "Central hit 5 of 19 in the first half to go along with 17 turnovers.",
    "I want to tell you: We made some, but they made the last two.\"",
    "\"They clamped down on us,\" Conway Coach Salty Longing said.",
    "Duncan scored 10 points and had six rebounds for Conway.",
    "\"It's unreal how our games have looked,\" Longing said.",
    "\"We got stuck on one side of the floor,\" Longing said.",
    "Emerie Bohanon scored 10 for the Lady Wampus Cats.",
    "Jordan Marshall led Central with 9 points.",
    "Our kids are a bunch of fighters.",
    "\"They made the final two plays.",
    "Sometimes it's that simple.\"",
    "\"It was just good defense.\"",
    "\"You want it so bad.",
    "GIRLS\nNO."
  ]
}