{
  "id": 5411,
  "mediaId": 2713,
  "date": "2022-02-21",
  "headline": "‘There’s no relief coming for us’: Weary workers dread surgery resumption",
  "image": "https://static.ffx.io/images/$zoom_0.19353070175438597%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/0dd890c77c8492ec6abd3584db5846007481ef65",
  "link": "https://www.smh.com.au/politics/victoria/there-s-no-relief-coming-for-us-weary-workers-dread-surgery-resumption-20220221-p59y7d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clay Lucas",
  "authorUrl": "https://www.smh.com.au/by/clay-lucas-hved8",
  "termIds": [
    0
  ],
  "sentences": [
    "“Tens of thousands of nurses [were] needed and back then I got the impression that things were sort of just going along at meeting after meeting without the sense of urgency that we needed.”\nSo severe is the public hospital crisis, not just in Victoria but across the country, that the AMA has for the first time launched a campaign targeted at the upcoming federal election on the critical issue of chronic problems within public hospitals: bed shortages, ambulances ramping, crowded emergency departments and long waits for elective surgery.",
    "“We must not delay elective surgery a moment longer than necessary, but we can’t tackle waiting lists without the safe number of nurses to care for patients during and after their operations.”\nDr Parnis says even though the January COVID-19 wave was not as dire as predicted, the number of staff off meant even the slight increase in coronavirus workload “was a very heavy burden to bear”.",
    "“So what we were seeing as surgeons were quite a few empty operating rooms, cancelled sessions and available nursing staff in some hospitals – not all hospitals, but some.”\nBurnout like never before\nEven with COVID-19 declining and with it the immediate pressure on the health system, hospital workers are still burnt out like never before.",
    "“I’ve seen a lot of people in emergency – and I will see even more in the weeks ahead – who wouldn’t have needed [emergency] care if they’d been able to receive an elective procedure in a timely manner.“\nTom Symondson is chief executive of the Victorian Healthcare Association, which represents public hospitals around Victoria.",
    "“Which might be people who are in a lot of pain and suffering but nonetheless they’re not about to succumb to their illness.”\nFrydenberg regularly sees patients with cancer who might not, according to the categories used in Victoria, be considered the most urgent and so have had their surgery delayed.",
    "Patients with an underlying malignancy, Frydenberg says, “even if you try and rationalise with [them] and say that, you know, ‘We don’t envisage that you would necessarily come to harm within a month’, psychologically, most people with cancer that need an operation just want it gone.",
    "But then what happens after that is we just go back to what our normal lives were, which for many of us is busy, high stress and long hours and low sleep.”\nThe Morning Edition newsletter is our guide to the day’s most important and interesting stories, analysis and insights.",
    "“It’s almost an alternate universe.”\nOn Tuesday the AMA will release polling, done by Essential Research, showing that of 1069 voters questioned, 34 per cent said they were less likely to vote for the government as a result of its handling of public hospital funding.",
    "“We need to proceed cautiously to keep our health system available for the sickest people needing the most urgent care.”\nNo finish line\nFor doctor Gavin Wayne, the pandemic has been a unique emergency: relentless and yet lacking any defined finish line.",
    "This time, though, it will combine with fresh challenges including the likely return of the flu – almost eradicated during the pandemic due to travel restrictions, social distance and mask wearing – and a possible dual winter surge of COVID-19.",
    "“We still have really large numbers of really sick patients, many of whom need to be admitted to hospital, that we don’t have capacity for,” says emergency doctor and Australian Medical Association federal council member Sarah Whitelaw.",
    "The organisation doesn’t have the budget to spend on an ad campaign, but it does have something perhaps more powerful: a network of trusted doctors, and patients captive to posters being put up in doctors’ waiting rooms.",
    "Symondson says it’s good the state government plans to gradually increase elective surgery, but that any prospect of an “elective surgery blitz” right now needs to accept the reality: healthcare workers are exhausted.",
    "In Victoria, where there are 115,000 nurses along with 8000 midwives, that exhaustion is also present, says Australian Nursing and Midwifery Federation Victorian secretary Lisa Fitzpatrick.",
    "Under the code brown, surgery was restricted in private hospitals so the most urgent surgical cases could be brought over from public hospitals if they were overwhelmed by COVID-19 cases.",
    "Need to get surgery under way: surgeons\nThe Omicron wave saw Victorian hospitalisations from coronavirus peak on January 17 with just over 1200 people occupying hospital beds that night.",
    "Royal Women’s Hospital chief executive Sue Matthews said her staff were exhausted and any possible increase in surgery being done needed to consider impacts on them as well as patients.",
    "The messages would come to Gavin Wayne every day: pleas from hospital management or locum agencies scrambling to get healthy staff as the Omicron wave struck Victoria’s health system.",
    "“We’ve been having intermittent surgical restrictions now for probably the best part of 18 months.”\nPatients in the greatest need have still received surgery, says the professor.",
    "Stephen Parnis, a Melbourne emergency physician, remembers speaking about the issue of a profound nursing shortage when he was vice-president of the federal AMA six years ago.",
    "But in hospitals – where waves of COVID-19 cases wash over them, only to recede before crashing back again with the next variant – the staffing crisis has been troubling.",
    "The association wants a return to elective surgery done gradually to account for ongoing furloughing of staff, and to retain capacity for emergency cases due to COVID-19.",
    "Many junior doctors Wayne speaks with (he chairs the AMA Victoria’s doctors in training group), when asked about their future plans, say they needed some time off.",
    "“There’s no relief coming for us.”\nFrom Monday, semi-urgent or “category 2” surgery resumes in public and private hospitals, placing further strain on the system.",
    "The “code brown” in place for three weeks to direct resources to coronavirus wards by restricting certain types of less urgent surgery was removed last week.",
    "Following last year’s lockdowns, there was a notable surge for treatment in hospitals as people caught up on care put off during waves of the pandemic.",
    "“If you win the America’s Cup, everyone takes Monday off … but there’s not really going to be a day when you wake up and it’s mission accomplished.",
    "Nurses beyond tired, union says\nIn New South Wales, nurses are taking industrial action over their conditions, but also over COVID-19 exhaustion.",
    "Victoria needs, Symondson says, “to catch up on deferred care, but not at the expense of pushing our exhausted healthcare workers over the edge”.",
    "Urologist Mark Frydenberg is a councillor with the Royal Australasian College of Surgeons, and chairs its health policy and advocacy committee.",
    "“If we don’t have people rock up to tend to the sick it’s not like we can just say ‘the hospital is closed today, don’t get sick’,” he says.",
    "Public hospitals were more important as a vote switcher than economic management or Australia’s relationship with China, the polling found.",
    "Yes, restrictions are going to ease and things are going to get easier, but a lot of these problems are still going to exist,” he says.",
    "Those with problems considered not life-threatening, though, were constantly pushed back one month, and then another and another.",
    "At times more than half the nurses in some hospitals were unable to work, upping the pressure on those still there enormously.",
    "Nurses and midwives are “bone weary and need to recover from the summer crisis they’ve just worked through”, she says.",
    "A state parliamentary inquiry into the pandemic last week heard from the heads of Victoria’s biggest hospitals.",
    "Coronavirus presentations rose at the same time as the army of workers trained to care for them was depleted.",
    "When Wayne got the requests for volunteers to help with extra shifts, the junior doctor felt obliged to help.",
    "Talk to a healthcare worker in a Victorian hospital today and they will reach for similar words and phrases.",
    "In an industry tightly rationed to keep labour costs down, the worker shortage has become all too obvious.",
    "The association is pushing as hard as it can to put the issue at the centre of the upcoming federal poll.",
    "“This end point for this is going to be this slow fade away as we adapt to this new sort of normality.",
    "Surgeons have been pushing for more surgery to get under way swiftly, even that deemed non-urgent.",
    "“There’s this sense COVID is almost over in the community, but it isn’t in hospitals,” she said.",
    "But he says it’s important to tackle as much surgery as possible with the staffing available.",
    "Surgery in Victoria falls into three categories: urgent, semi-urgent and non-urgent.",
    "Outside the hospital, people were living almost pre-pandemic lifestyles, she said.",
    "He says it wasn’t just the recent code brown that caused the backlog in surgery.",
    "And few hospital staff have had a chance to rest and recharge the batteries.",
    "From Monday this week, semi-urgent or “category 2” surgery can resume.",
    "Thousands were forced into isolation, exposed or sick with the virus.",
    "And surgeons are lobbying for even non-urgent surgeries to resume.",
    "Now’s the time to acknowledge it,” says the AMA’s Sarah Whitelaw.",
    "“But in fact, very few people were transferred,” says Frydenberg.",
    "All workplaces have been forced to adjust during the pandemic.",
    "Even though it could be at the expense of his own wellbeing.",
    "Even though it was already a struggle to get enough sleep.",
    "By Sunday there were 358 people in hospital with COVID-19.",
    "It causes an enormous amount of psychological distress”.",
    "All told of the struggles of coping over summer.",
    "Even though his days were already fully packed.",
    "“The public hospital system is in crisis.",
    "“We’re running on empty,” he says.",
    "Case numbers have stabilised.",
    "Just holding on for a break.",
    "This is expected again.",
    "It was pre-pandemic.",
    "Sign up here.",
    "Exhaustion.",
    "Fatigue.",
    "Burnout."
  ]
}