{
  "id": 5448,
  "mediaId": 2937,
  "date": "2022-02-16",
  "headline": "Durham cops identify remains of Kandis Fitzpatrick — with killer's help",
  "image": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2022/02/EMBRACE-1-scaled.jpg?quality=100&strip=all",
  "link": "https://torontosun.com/news/local-news/killer-adam-strong-leads-cops-to-remains-of-woman-who-vanished-in-2008",
  "mediaOutlet": "torontosun.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Laurie",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Strong accompanied our investigators while he was in custody under judicial authorization and pointed to a general area where he believed he had buried the remains back in 2008,” Det.-Sgt.",
    "“Our goal in this recovery was to provide some closure to Kandis’ family.”\nPolice obtained information from Strong himself, about two months after he was locked away in May 2021.",
    "Adam Strong, 48, is serving both a life sentence for murder and 18 years for manslaughter in the disappearance of two teenagers: Rori Hache and Fitzpatrick.",
    "Police did not link her death to Strong until later in 2017, after plumbers working on the house where he lived found a flesh-like substance in the pipes.",
    "The two women disappeared roughly a decade apart — Fitzpatrick was last seen in 2008, while Hache, who was 18 and pregnant, went missing in August 2017.",
    "It’s not something that you hear about happening in the criminal system.”\n“There’s no getting around what he did to Rori and Kandis,” she added.",
    "Article content\nDurham cops have identified partial remains found last November as those of Kandis Fitzpatrick, 19, who disappeared in 2008.",
    "“If you want to recover the rest of her, it’s in my freezer.”\nOfficers found the rest of Hache’s body in the freezer in Strong’s bedroom.",
    "The remains were found Nov. 8 buried in a small clearing by a tree line behind Secreto Dr. near Britannia Ave. E. in Oshawa.",
    "Article content\nInvestigators say they were led to her remains in Oshawa by the man jailed and convicted in her killing.",
    "“I can confirm today that the remains found last November are those of Kandis Fitzpatrick,” said Det.-Sgt.",
    "Article content\n“The information came to us from the staff at the correctional facility,” Det.-Sgt.",
    "And from there we became involved.”\nHomicide detectives did a series of interviews with Strong.",
    "Article content\nHache’s torso was found in Lake Ontario about a month after she vanished.",
    "“OK, you got me, the gig’s up, it’s a body,” an officer testified Strong told him.",
    "At the police announcement Wednesday, Fitzpatrick’s father did not wish to speak.",
    "Detectives said Strong received no benefit by providing information to them.",
    "The details of how police initially discovered the murders are grisly.",
    "DNA testing at the apartment later revealed a match for Fitzpatrick.",
    "By Nov. 13, forensics helped to identify Fitzpatrick using DNA.",
    "Hache’s mother, Shanan Dionne, said: “I’m in shock.",
    "They put the substance in a bag and called police.",
    "Officers then knocked on Strong’s door.",
    "“He provided the information there.",
    "Doris Carriere.",
    "Carriere said.",
    "Carriere said.",
    "I am shocked.",
    "“Mr."
  ]
}