{
  "id": 548,
  "mediaId": 2586,
  "date": "2022-04-21",
  "headline": "Former Jets Starting QB Could Be Joining AFC Powerhouse, Says Analyst",
  "image": "https://heavy.com/wp-content/uploads/2022/04/GettyImages-1166833744-1-e1650569824499.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/new-york-jets/jets-afc-powerhouse-join/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul A. Esden Jr.",
  "authorUrl": "https://heavy.com/author/boygreen25/",
  "termIds": [
    1509,
    2249,
    3069,
    3415,
    4688,
    671,
    708,
    823,
    5269
  ],
  "sentences": [
    "Sports analyst Andrew Fillipponi said the Pittsburgh Steelers could now add a veteran to the room and he suggested Ryan Fitzpatrick, “I’d take a shot.”\nSo the Steelers could now sign a veteran free agent QB to fill-out their quarterback depth chart.",
    "Fill an Empty Void\nSteelers quarterback Dwayne Haskins tragically lost his life on the morning of Saturday, April 9 when he was struck by a dump truck while walking on a South Florida highway, per ESPN.",
    "The Steelers have done extensive work on this crop of rookie quarterbacks at every level of the offseason from the Senior Bowl, to the NFL combine, to visiting an array of Pro Days in person.",
    "To launch up that high the Steelers would have to surrender a combination of their top picks in this class and likely would have to delve into the 2023 draft treasure chest as well.",
    "Last season was the final campaign for future Pro Football Hall of Famer Ben Roethlisberger which leaves a massive void that needs to be filled at the NFL’s most important position.",
    "He doubled down on that take saying, “I think he’s better than [Mitchell] Trubisky” and could help groom a young quarterback you’d then acquire in the 2022 NFL draft.",
    "The 39-year-old had a career year that he has yet to top since throwing for over 3,905 passing yards with a 31 touchdown to 15 interception ratio.",
    "Some may squirm at the thought of giving up that much to move up, but if you’re in love with a quarterback then the price is no object.",
    "There has been a ton of speculation this offseason that Pittsburgh could look to the 2022 NFL draft to find their long-term answer.",
    "Without any proven commodities that you feel great about, Fitzpatrick could come in and be a stabilizing presence for the room.",
    "Follow @BoyGreen25 & @obermuller_nyj on Twitter for all the latest New York Jets breaking news, rumors, fresh takes, and more!",
    "20 overall pick and to ensure they land their favorite quarterback target of choice, the Steel City will need a helping hand.",
    "Helping out the Steel City\nObviously, Fitzpatrick at this stage of his career is nothing more than a stop-gap option.",
    "Every year regardless of the situation he finds himself in, Fitzpatrick always discovers a path to a starting gig.",
    "Pittsburgh only has two quarterbacks listed on its official online roster: Mason Rudolph and Mitch Trubisky.",
    "Despite his old age, Fitzpatrick has found a way to not only survive but thrive as a starting quarterback.",
    "The New York Jets might soon be watching a former starting quarterback don some new colors next season.",
    "When you look at the Steelers’ depth chart at quarterback, it lacks a legitimate option for the future.",
    "He just completed his 17th professional season with his ninth different NFL franchise.",
    "It has been an incredible journey and one he is hoping continues in 2022.",
    "10 overall picks, they provide two tempting trade-up opportunities.",
    "The most notable of which came back in 2015-16 with the Jets.",
    "ALL the latest Jets news straight to your inbox!",
    "Join the Heavy on Jets newsletter here!",
    "That is where the Jets enter the chat.",
    "And could help groom your rookie QB.",
    "I'd take a shot on Ryan Fitzpatrick.",
    "I think he's better than Trubisky.",
    "They hold the No.",
    "With the No.",
    "4 and No."
  ]
}