{
  "id": 5487,
  "mediaId": 4045,
  "date": "2022-02-08",
  "headline": "75 years ago: The Post-Dispatch brings St. Louis its first regular TV broadcast",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/8/7b/87b9e41e-3708-5fda-ba95-1c06561c9142/5120d478cc956.preview-1024.jpg?crop=1024%2C538%2C0%2C105&resize=1024%2C538&order=crop%2Cresize",
  "link": "https://www.stltoday.com/news/archives/75-years-ago-the-post-dispatch-brings-st-louis-its-first-regular-tv-broadcast/article_9cfc03be-3422-5156-8a4b-c59e1cbec2da.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim O’Neil",
  "authorUrl": "",
  "termIds": [
    1621,
    1746,
    3520,
    969,
    5330
  ],
  "sentences": [
    "Feb. 8, 1947: The first TV broadcasts come to St. Louis\nKSD-TV\nLook back: Post-Dispatch and KSD airplane\nDemonstrating TV\nBroadcast of Cards-Brown game\nEarly KSD-TV broadcast\nInside KSD-TV studio\nA tour of TV studio\nKSD-TV tower overlooking downtown St. Louis\nBroadcasting from Sportsman's Park\nAn early celebrity wedding televised from St. Louis\nP-D cartoonist sketches for TV cameras\nMan on the street interview in 1947\nMoolah Temple show in 1950",
    "Unsurprisingly, the gaggle in the lounge at the Hotel Statler, 822 Washington Avenue, got the nod as “most exuberant” when the small glass screens glowed with images of an American flag, accompanied by the sound of the national anthem.",
    "For 90 minutes, the live in-studio program from the Post-Dispatch building included dance demonstrations and an interview of Cardinals catcher Joe Garagiola by Post-Dispatch sports editor J. Roy Stockton.",
    "What Garagolia told viewers that day is lost to history, but the Post-Dispatch said 400 new “receivers” — TVs — were available at local retailers, with more on the way.",
    "It was the video child of KSD-AM, the newspaper’s radio station, and the Post-Dispatch proudly declared itself the nation’s only newspaper with a TV station.",
    "The first regular television broadcast in St. Louis began patriotically at 2:30 p.m. on Saturday, Feb. 8, 1947, over the weak airwaves of KSD-TV.",
    "Television technology predated World War II but was a curiosity when KSD made St. Louis the seventh American city with regular broadcasting.",
    "When KSD-TV went on the air, an Ethan Allen bedroom suite was advertised for $115, women’s wool sweaters at $4 and men’s dress shirts, $3.",
    "KSD-TV signed off with promises to return Monday afternoon and announcing ambitious plans for 25 hours of broadcasting in the first week.",
    "Pro wrestler Bill Longson demonstrated the “airplane spin,” using station special events director Frank Eschen as the airplane.",
    "KSD-TV soon was televising boxing matches, fashion shows, call-in news quizzes and baseball games, both Cardinals and Browns.",
    "By year’s end, TV network ground cables reached St. Louis from Chicago, Cleveland and Buffalo, N.Y., with more on the way.",
    "During that first broadcast, announcers modified the script to read a news wire bulletin about a U.S. Supreme Court case.",
    "There wasn’t much to watch, and TVs sets cost upwards of $400 in late 1946, the equivalent of about $4,700 today.",
    "KSD-TV would have St. Louis to itself until 1953, when WTVI-TV (later KTVI) in Belleville went on the air.",
    "In August 1947, KSD-TV (now KSDK) completed a 540-foot-tall tower downtown that could beam 50 miles.",
    "People assembled in downtown department stores, a hotel bar and a short list of private residences.",
    "ST. LOUIS • Crowds gathering around the strange new flickering boxes were counted in the hundreds.",
    "By summer, weekday broadcasts ran seven hours beginning at 3 p.m. A few shows even ran on Sundays.",
    "Nationwide, there were only 44,000 TV sets, mostly in taverns and other public places.",
    "The Famous-Barr appliance department was crowded each day during the broadcasts.",
    "The broadcast ended with an infomercial on the wonders of meat for every meal.",
    "KSD-TV’s studio was at 1111 Olive Street, in the Post-Dispatch building.",
    "Hill-Behan Lumber Co. offered a one-car garage kit for $285.",
    "Five years later, half of American households had TVs.",
    "By summer 1948, the St. Louis area had 7,000 TV sets.",
    "The newspaper was the owner of the TV station.",
    "The number exploded to 200,000 by late 1950.",
    "Union ironworkers made $2.25 an hour.",
    "Only 0.1 percent of homes had them.",
    "It added programs at night."
  ]
}