{
  "id": 5497,
  "mediaId": 4045,
  "date": "2022-02-03",
  "headline": "Mark Bradley: Will Brian Flores’ lawsuit lead to NFL change? Let’s hope.",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?crop=375%2C375%2C30%2C0&resize=200%2C200&order=crop%2Cresize",
  "link": "https://www.stltoday.com/sports/football/mark-bradley-will-brian-flores-lawsuit-lead-to-nfl-change-let-s-hope/article_b91856ec-1118-5a77-8b2e-6ca6656c3fe4.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Bradley",
  "authorUrl": "",
  "termIds": [
    1951,
    1990,
    2898,
    3819,
    4065,
    308,
    612,
    671,
    700,
    707
  ],
  "sentences": [
    "That the NFL, which should be less essential to the welfare of this nation than the executive branch, has seen only one franchise hire a Black head coach since 2019 – that one, David Culley, was dismissed after one season by Houston – forces us to ask: If the NFL didn’t have a Rooney Rule, would it look much different?",
    "Flores deems his interview “a sham.” Speaking with ESPN on Wednesday, he said: “I was upset I wasn’t getting a true opportunity to show what I can bring to a team.”\nFour NFL teams have hired new coaches in the past week: Bears, Broncos, Giants and Raiders.",
    "Their quarterbacks were the 37-year-old retread Ryan Fitzpatrick and the 22-year-old Josh Rosen, who already had been dumped by Arizona, the team that drafted him.",
    "Only three NFL head coaches – Mike Tomlin of the Steelers, Ron Rivera of the Washington Commanders and Robert Saleh of the Jets – represent minorities.",
    "The NFL has its Rooney Rule, which requires a team seeking a new head coach to hold at least one in-person interview with a minority candidate.",
    "On Tuesday, Flores filed a class-action lawsuit against three teams in particular – the Dolphins, Giants and Broncos – and the NFL in general.",
    "He’d spent more than a decade working for Bill Belichick’s Patriots, which is the NFL equivalent of having apprenticed under Nick Saban.",
    "Before Flores interviewed with the Giants last month, Belichick sent a message saying the New York club wanted him as head coach.",
    "Eric Bieniemy is the offensive coordinator with Kansas City, which has graced the AFC Championship game four seasons running.",
    "Before a team can introduce a new coach, it must first tick the box that says, “We certify we’ve compiled with league policy.",
    "The Rooney Rule forces teams to grant minority candidates an audience, but it doesn’t compel them to hire such a candidate.",
    "It’s unclear whether his lawsuit will help or hurt his prospects, which isn’t to suggest he shouldn’t have filed it.",
    "We should be long past box-ticking, but here the snooty NFL sits, having talked the talk without walking the walk.",
    "It finished 5-4, somehow toppling the Patriots of Belichick – a 17.5-point favorite – in the season finale.",
    "Flores contends that, in the effort to tank, team owner Steve Ross offered him $100,000 for every loss.",
    "The suit also suggests that Belichick, the greatest NFL coach ever, is horrible at texting.",
    "He alleges that his interview processes involving the latter two teams were discriminatory.",
    "Flores inherited a team coming off seasons of 6-10 and 7-9 under the regrettable Adam Gase.",
    "Of the past 10 offensive rookies of the year, five were quarterbacks; four were Black.",
    "In a league where roughly 60% of the players are Black, there’s one Black head coach.",
    "As we speak, the NFL’s only Black head coach works for the club owned by the Rooneys.",
    "It says much about the NFL that Gase was soon given a second chance as a head coach.",
    "The first, he wrote, was meant for Brian Daboll, another former Belichick assistant.",
    "We wait to see if Flores and Anthony Lynn and Todd Bowles are afforded the same.",
    "He claims John Elway, then Denver’s general manger, showed up with a hangover.",
    "They were 13-8 in games started by Tua Tagovailoa, their Round 1 pick in 2020.",
    "Flores interviewed with the Giants, who – big shock – hired Daboll instead.",
    "Barack Obama was elected to the first of two presidential terms in 2008.",
    "Flores also said the Dolphins, who actually hired him, were unethical.",
    "He would seem a suitable hire for any team in need of a head coach.",
    "Lawsuits aren’t pleasant things, but sometimes they’re necessary.",
    "Of the past six MVPs, all were quarterbacks; three were Black.",
    "Kamala Harris was sworn in as vice president Jan. 20, 2021.",
    "Now say hello to our latest non-minority hire.”\nIt’s 2022.",
    "Brian Flores was by hired as head coach by Miami in 2019.",
    "The Rooney Rule has essentially become an HR exercise.",
    "The Dolphins went 10-6 and 9-8 the past two seasons.",
    "Only Tomlin is Black, and he has won a Super Bowl.",
    "Flores has interviewed with the Saints and Texans.",
    "There hasn’t been a bigger NFL upset in 30 years.",
    "None filled those jobs with a minority candidate.",
    "That game was Tom Brady’s next-to-last as a Pat.",
    "In Flores’ first season, the Dolphins went 5-11.",
    "Miami opened with seven consecutive losses.",
    "This didn’t seem a franchise on the skids.",
    "Good intentions aren’t always enough.",
    "Belichick’s next text was #awkward.",
    "The career of Tom Brady, in photos",
    "He remains Andy Reid’s assistant.",
    "They didn’t make the playoffs.",
    "Neither did they miss by much.",
    "Flores was fired anyway.",
    "That’s a stat of shame.",
    "Five vacancies remain.",
    "It’s 2022."
  ]
}