{
  "id": 5574,
  "mediaId": 2658,
  "date": "2022-02-07",
  "headline": "Sen. Warner 'less convinced' directed-energy attacks behind AHIs",
  "image": "https://static.politico.com/9f/a0/2d541d2e4fd38f0e237af2202cd1/ap21230710825646-2.jpg",
  "link": "https://www.politico.com/newsletters/national-security-daily/2022/02/07/sen-warner-less-convinced-directed-energy-attacks-behind-ahis-00006306",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1295,
    3540,
    3906,
    4748,
    1171,
    5371
  ],
  "sentences": [
    "The Next Day, She Vanished From the Spotlight.”\nTomorrow Today\n— The Armed Forces Communications and Electronics Association, 9 a.m.: “The Vision for the Future Military Health System — with JASON MILLER, CHRIS NICHOLS, DAVID NORLEY and LANCE SCOTT”\n— The National Defense Industrial Association, 9:25 a.m.: “2022 Virtual Expeditionary Warfare Conference\" — with BILYANA ANDERSON, DAVID BERGER, WILLIAM MERZ, TOM RIVERS, BENJAMIN WATSON and more”\n— Senate Armed Services Committee, 9:30 a.m.: “Full Committee Hearing: Nominations — with MICHAEL KURILLA”\n— House Homeland Security Committee, 10 a.m.: “Subcommittee Hearing: The Nonprofit Security Grant Program and Protecting Houses of Worship: A View From the American Jewish Community — with CHARLIE CYTRON-WALKER, ERIC FINGERHUT, YOSEF KONIKOV and MICHAEL MASTERS”\n— House Intelligence Committee, 10 a.m.: “Subcommittee Hearing: Intelligence Support to the DoD’s August 29, 2021 Strike in Kabul”\n— House Science, Space, and Technology Committee, 10 a.m.: “Full Committee Hearing: Data Challenges Impacting Human Trafficking Research and Development of Anti-Trafficking Technological Tools — with HANNAH DARNTON, GRETTA GOODWIN, THERESA HARRIS and LOUISE SHELLEY”\n— The Middle East Institute, 10 a.m.: “Climate Change and Security Implications in the Mediterranean — with ALI AHMAD, ANDREI COVATARIU, IULIA JOJA, BRIAN KATULIS and MOHAMMED MAHMOUD”\n— Senate Foreign Relations Committee, 10 a.m.: “Full Committee Hearing: Nominations — with LAURA FARNSWORTH DOGU, RANDI CHARNO LEVINE, DEBORAH E. LIPSTADT and N. NICKOLAS PERRY”\n— Senate Homeland Security and Governmental Affairs Committee, 10 a.m.: “Full Committee Hearing: Responding to and Learning from the Log4Shell Vulnerability — with BRAD ARKIN, TREY HERR, JEN MILLER-OSBORN and DAVID NALLEY”\n— The United States Institute of Peace, 10 a.m.:“Paths to Recovery in Yemen: Prospects and Priorities for Reconciliation, Reconstruction and Sustainable Development — with ABDULRAHMAN AL-ERYANI, BARBARA BODINE, KHALIDA BOUZAR, JEEHAN ABDUL GHAFFAR, SARHANG HAMASAEED, TIMOTHY LENDERKING, AUKE LOOTSMA, JONATHAN MOYER and MIKE YAFFE”\n— The Atlantic Council, 12 p.m.: “The Arctic in Transition: Energy, Resilience and National Security — with MICHAEL MCELENEY and TERZAH TIPPIN POE”\n— Axios, 12:30 p.m.: “Spearheading a Safer Internet — with JEN FITZPATRICK, ERIC HAN and LISA PLAGGEMIER”\n— The Center for a New American Security, 1 p.m.: “Virtual Fireside Chat with the Honorable CHRISTINE WORMUTH, Secretary of the Army — with STACIE PETTYJOHN”\n— House Armed Services Committee, 2 p.m.: “Subcommittee Hearing: Military Personnel Talent Management Modernization and the Effects of Legacy Policies — with GARY M. BRITO, BRIAN T. KELLY, PATRICIA MULCAHY, JOHN B. NOWELL JR. and DAVID OTTIGNON”\n— House Veterans’ Affairs Committee, 2 p.m.: “Subcommittee Hearing: Honoring Our Promise: Reviewing the Effectiveness of Services for Survivors and Dependents”\n— The Hudson Institute, 2 p.m.: “Lessons From the Ukraine Crisis — with JASON CROW and KENNETH R. WEINSTEIN”\n— Senate Intelligence Committee, 2:30 p.m.: “Closed Briefing: Intelligence Matters”\n— The Department of Veterans Affairs, 3 p.m.: “Meeting of the Advisory Committee on the Readjustment of Veterans”\nHave a natsec-centric event coming up?",
    "), the commission’s co-chair, argued that China is “critically involved” in the more than 64,000 U.S. fentanyl deaths that took place from April 2020-April 2021, “because they are pretty much the lone supplier of [fentanyl] precursor chemicals and pre-precursor chemicals, which they are shipping to Mexico.” He added: “[It] is coming into the U.S. by the hundreds of millions of pills, and the chain all starts in China.”\nKeystrokes\nSPYWARE REPORTS SHAKE NETANYAHU TRIAL: Former Israeli Prime Minister BENJAMIN NETANYAHU’s corruption trial was upended by media reports last week that police allegedly used sophisticated spyware to collect information off a key witness’ phone, per The Associated Press’ TIA GOLDENBERG.",
    "The new strategy they propose includes deemphasizing America’s focus on short-term military objectives, like counterterrorism, in pursuit of longer-term goals like “human rights and good governance.”\n“We strongly recommend your Administration focus on identifying and addressing the complex challenges surrounding conflict and violence, improve the efficacy of assistance designed to reform national security sectors and institutions, and — given the anti-democratic trends in the region — strengthen governance, civil society, and accountability based on rigorous conflict analysis and diplomacy,” the lawmakers continued.",
    "Sen. Warner 'less convinced' directed-energy attacks behind AHIs\nBy ALEXANDER WARD and QUINT FORGEY\n02/07/2022 04:03 PM EST\nWith help from Nahal Toosi, Andrew Desiderio and Daniel Lippman\nSend tips | Subscribe here | Email Alex | Email Quint\nFIRST IN NATSEC DAILY –– Sen. MARK WARNER (D-Va.) is “less convinced” that a foreign actor using a directed-energy weapon is responsible for so-called “Havana Syndrome” symptoms, the Senate Intelligence chair told NatSec Daily, casting further doubt on the theory once popular among some lawmakers.",
    "I was able to ‘hit the ground running’ despite the pandemic shutdown occurring just after I took over the portfolio because I had been working on the issues and known the principal actors for years.”\nBroadsides\nFIRST IN NATSEC DAILY –– BIPARTISAN ORGS URGE END TO SAUDI MIL HELP IN YEMEN: A transpartisan group of six pro-restraint and human rights organizations wrote a letter to Biden today demanding he end America’s support for the Saudi Arabia-led war in Yemen, per a copy seen by NatSec Daily.",
    "“Furthermore, genuinely robust nuclear agreement with Iran would be compelling enough to secure assent from two-thirds of the Senate — and the only reason not to present it for a resolution of ratification is that it is too weak to pass muster.”\nThe Iran Nuclear Agreement Review Act of 2015, known as INARA, states that the president must, among other items, send Congress “the text of the agreement and all related materials and annexes” within five days of reaching a deal.",
    "“A seasoned diplomat with experience in Sub-Saharan Africa” would help the administration “coordinate U.S. diplomatic engagement, work with regional partners to implement a refreshed and balanced strategy and refocus U.S. support toward addressing the root causes of chronic violence, instability, and governance challenges,” wrote Meeks alongside Reps. SARA JACOBS (D-Calif.), KAREN BASS (D-Calif.), ILHAN OMAR (D-Minn.) and AMI BERA (D-Calif.).",
    "“After you announced an end to U.S. support for “offensive” operations in the Saudi war on Yemen, the Pentagon later acknowledged that the United States is still providing spare parts, maintenance, and logistical support for Saudi warplanes which are carrying out airstrikes and enforcing a blockade of Yemen’s ports,” wrote the groups, including the Friends Committee on National Legislation, Concerned Veterans for America and Demand Progress.",
    "The two sailors “were not actively training when they reported symptoms and were transported to receive emergency care.”\nOn the Hill\nFIRST IN NATSEC DAILY –– 5 HOUSE DEMS DEMAND SAHEL ENVOY: Five House Democrats, including House Foreign Affairs Chair GREGORY MEEKS (D-N.Y.), are pushing Biden to appoint a special envoy for the Sahel as a string of coups threatens to destabilize the region, per a letter obtained by NatSec Daily.",
    "Stating that the president has statutory obligations to let senators weigh in, “we are committed to using the full range of options and leverage available to United States Senators to ensure that you meet those obligations, and that the implementation of any agreement will be severely if not terminally hampered if you do not,” the 27 Republicans state in the letter drafted by Sen. TED CRUZ (R-Texas).",
    "“We kept expecting to find more there and have not yet.”\n“I think all of us who were following this have been surprised,” he continued, “but at the same time, even if we were surprised, you got to go where the facts lead.”\nMARK ZAID, a lawyer who represents former U.S. officials who believe they were victims of deliberate directed-energy attacks, urges Warner to dig deeper.",
    "“Again, we urge your administration to end all forms of U.S. support, including logistical support, spare parts, and maintenance contracts, for the Saudi war effort against the Houthis in Yemen.”\nThese and other groups have long called for Biden to end the U.S.-sold maintenance contract to keep the Royal Saudi Air Force flying.",
    "What to Read\n— ROBBIE GRAMER, Foreign Policy: “Biden’s Pick for Top Human Rights Post Stuck in Nomination Limbo”\n— SUZANNE SMALLEY, POLITICO Magazine: “Is Biden Ignoring a Key Tool to Combat Violent Extremists?”\n— LIZA LIN and ELAINE YU, The Wall Street Journal: “A Uyghur Skier Became the Face of China’s Winter Olympics.",
    "On “Fox News Sunday,” national security adviser JAKE SULLIVAN said “we have been absolutely clear that if Russia invades Ukraine, one way or the other, Nord Stream 2 will not move forward.” That echoed the line from other Biden administration officials, indicating the U.S. believes the energy throughway would shutter.",
    "“Security is a necessary condition for bringing stability to the region, but it is not sufficient.”\nHe also said an effective envoy needs strong support from the White House and State Department, as he says he had, and that whoever gets the role “needs to have experience in and relationships with the region.",
    "Mullen was one of two SEAL candidates taken to the hospital last Friday “several hours after their Basic Underwater Demolition SEAL (BUD/S) class successfully completed Hell Week, part of the first phase of the Navy SEAL assessment and selection pathway,” the Navy said in an earlier news release.",
    "The Inbox\nFIRST IN NATSEC DAILY –– GOP SENATORS DEMAND SAY ON IRAN DEAL REENTRY: Nearly 30 Senate Republicans sent a letter to Biden today, obtained by NatSec Daily, demanding that he give them a say over America’s reentry into the Iran nuclear deal, or they will try to block the move.",
    "“[W]e reiterate our view that any agreement with Iran regarding its nuclear program is of such gravity for U.S. national security that by definition it is a treaty requiring Senate advice and consent,” continued the Senators including Oklahoma’s JIM INHOFE and PAT TOOMEY.",
    "Republicans have since contended that any effort to reenter an accord requires at least Senate say so, while proponents of the deal insist it’s up to presidential prerogative — just like it was when former President DONALD TRUMP withdrew the U.S. from the pact in 2018.",
    "Even Netanyahu’s political opponents are outraged.”\nIn the scandal’s latest development, a local newspaper reported today that police also allegedly used spyware on the phones of Netanyahu’s son and members of his inner circle, per the AP’s ILAN BEN ZION.",
    "Warner’s comment comes as the intelligence community and outside experts aim to solve a five-year mystery: What’s behind the anomalous health incidents that have affected hundreds of U.S. and foreign officials on every continent except Antarctica?",
    "RUSSIAN OFFICERS HAVE INVASION DOUBTS: Some Russian military and intelligence officials believe that a full-scale invasion of Ukraine is riskier than their leaders acknowledge, CNN’s NATASHA BERTAND, JIM SCIUTTO and KATIE BO LILLIS reported.",
    "Israeli Prime Minister NAFTALI BENNETT called the claims, if true, “very serious,” and Public Security Minister OMER BARLEV announced the formation of a government commission of inquiry to probe potential civil rights and privacy violations.",
    "Still, a senior European official told CNN that \"[i]n the assessments we see it is clear some people on the [Russian] defense side are not really understanding what the game plan is” and that \"it's a very difficult game plan to stand up.\"",
    "VOTERS BACK BIDEN’S UKRAINE APPROACH: A total of 57 percent of American voters either “strongly support” or “somewhat support” Biden’s diplomatic efforts to resolve the Russia-Ukraine conflict, per a new Morning Consult/POLITICO poll.",
    "J. PETER PHAM, Trump’s Sahel special envoy, told NatSec Daily, “I fully agree with Chairman Meeks and the other members who signed the letter that there needs to be more than a military or security-focused solution” for the region.",
    "And last week, the intelligence community found that the core symptoms of a subset of cases couldn’t be explained by mass hysteria or psychosomatic effects alone, and could be caused by pulsed electromagnetic or ultrasonic energy.",
    "While you’re at it, follow the rest of POLITICO’s national security team: @nahaltoosi, @woodruffbets, @politicoryan, @PhelimKine, @BryanDBender, @laraseligman, @connorobrienNH, @paulmccleary, @leehudson and @AndrewDesiderio.",
    "Flashpoints\nAMERICA’S WAR ON DRUGS WITH CHINA: Our own PHELIM KINE reports today on the deadliest flashpoint in the relationship between Washington and Beijing — and it’s not the potential for military conflict over Taiwan.",
    "China’s reluctance to tighten controls on chemical production and exports will be the focus of a long-awaited report on its role in fueling the flow of drugs that Mexican cartels process into synthetic opioid fentanyl.",
    "Warner is still open to the idea that another nation is deliberately targeting U.S. officials, trusts the seriousness of Burns’ investigative efforts and wants Americans to continue reporting their cases.",
    "“The officials have also grumbled about their plans being discovered and exposed publicly by western nations,” they wrote, adding that there’s no evidence the officials would disobey an invasion order.",
    "White House press secretary JEN PSAKI addressed this during today’s briefing: \"We are united in our view of the potential actions of Russian leaders and united in our efforts to hold them accountable.\"",
    "Last week, Biden restored sanctions waivers for Iran to allow it to engage with other countries on nuclear cooperation projects, a move deemed an indicator of an imminent American return to the deal.",
    "There’s also over 50 percent overall agreement that countries like Ukraine should be allowed to apply for NATO membership and that sanctions should be imposed on Russia should it invade Ukraine.",
    "Instead, U.S. policymakers and members of Congress are infuriated by the thousands of overdose deaths in the United States each year caused by illicit fentanyl made from Chinese raw materials.",
    "The investigation, not thoroughly conducted during the Trump administration, kicked into high gear after CIA Director WILLIAM BURNS took charge of the agency under President JOE BIDEN.",
    "Granted, both sides have different constituencies and interests in this case, and Berlin may want to give itself wiggle room to do business with Russia should Putin back off Ukraine.",
    "Mullen died at Sharp Coronado Hospital in Coronado, California, and the surviving SEAL candidate “is in stable condition” at Naval Medical Center San Diego, according to the Navy.",
    "This space is reserved for the top U.S. and foreign officials, the lawmakers, the lobbyists, the experts and the people like you who care about how the natsec sausage gets made.",
    "But in a Washington Post interview ahead of his meeting with Biden, German Chancellor OLAF SCHOLZ refused to explicitly commit to ending the pipeline project in such a scenario.",
    "The Complex\nNAVY NAMES DEAD SEAL CANDIDATE: The Navy has identified the SEAL candidate who died after finishing “Hell Week” as 24-year-old KYLE MULLEN of Manalapan, New Jersey.",
    "Earlier this year, Cruz also proved a thorn in Biden’s side by blocking multiple diplomatic nominees over the president lifting sanctions on the Nord Stream 2 gas pipeline.",
    "Last month, the CIA released an interim report assessing a U.S. adversary isn’t deliberately targeting hundreds of Americans serving abroad in a worldwide campaign.",
    "The administration says that it must service Riyadh’s warplanes to help the kingdom protect against increasingly sophisticated attacks from Houthi rebels in Yemen.",
    "The intelligence community’s review continues, and it’s possible they find some information to reinvigorate Warner’s belief in the directed-energy explanation.",
    "Meanwhile, the reporting “has reenergized Netanyahu’s supporters, who have long seen the trial as part of a conspiracy to topple the polarizing former leader.",
    "And we have a very clear agreement with the United States government on gas transit and energy sovereignty in Europe,” he told the Post’s SOUAD MEKHENNET.",
    "— MICHAEL MOSIER has joined global management consulting firm Oliver Wyman as a senior adviser to its anti-financial crime and digital assets practices.",
    "But, he reiterated, “the lack of evidence has eroded my confidence” in the one-time leading theory, explicitly stating he’s “less convinced” of it now.",
    "STILL DIFFER ON NS2: Daylight persists between Washington and Berlin over the future of the Nord Stream 2 gas pipeline should Russia invade Ukraine.",
    "“[I]t is absolutely clear that in a situation like this all options are on the table.”\nThat’s close — but not the same — as the American position.",
    "Furthermore, 48 percent support — also “strongly” or “somewhat” — the decision to send 3,000 U.S. troops to bolster NATO allies in Eastern Europe.",
    "But the noticeable difference in messaging makes clear the U.S. and Germany aren’t fully united on the pipeline, at least in public.",
    "Aim your tips and comments at award@politico.com and qforgey@politico.com, and follow us on Twitter at @alexbward and @QuintForgey.",
    "— KENNETH WEINSTEIN has joined critical issues advisory firm the Brunswick Group as a senior adviser focused on U.S.-Japan issues.",
    "It appears senior Russian officials have heard the complaints, though it’s unclear if that will alter any of the Kremlin’s plans.",
    "Warner told us that a year ago his presumption was an adversary armed with a directed-energy weapon explained the health attacks.",
    "The service is now undertaking an investigation into the cause of his death, which is unknown, the Navy said in a news release.",
    "and MIKE WALTZ (R-Fla.) to let Biden know there’s support for redesignating the Houthis as a foreign terrorist organization.",
    "The Cruz-led effort is the latest Republican attempt to make it harder for Biden to fulfill his promise of a revived deal.",
    "And thanks to our editor, John Yearwood, who’s “less convinced” of the theory that we should still lead this newsletter.",
    "He is the Walter P. Stern distinguished fellow at the Hudson Institute and a former U.S. ambassador-designate to Japan.",
    "Shoot us an email at award@politico.com or qforgey@politico.com to be featured in the next edition of the newsletter.",
    "We “see no evidence of any foreign state bragging about this or talking about this,” he said in an interview today.",
    "“Netanyahu’s lawyers have demanded answers from the state about what was gathered and how,” Goldenberg reports.",
    "Transitions\n— JESSICA HARRIS will become director of strategic communications at the Brookings Institution.",
    "“I've actually seen no evidence that even the agencies have bothered to investigate the historical aspects.",
    "Overall, the voting public seems mainly satisfied with how the Biden administration is handling the crisis.",
    "He previously served as acting director of the Treasury Department’s Financial Crimes Enforcement Network.",
    "— MATTHEW MASTERSON is now director of information integrity at Microsoft’s Democracy Forward Initiative.",
    "However, the IC found a larger majority of solved cases were caused by medical and environmental factors.",
    "That report is set to be published Tuesday by the Commission on Combating Synthetic Opioid Trafficking.",
    "Based on current evidence — or, rather, the lack of it — the senator is no longer as sure.",
    "After that, the law states at least 60 senators must vote to stay in the nuclear pact.",
    "Yet I am aware of incidents back in the 70s, 80s and 90s,” he texted NatSec Daily.",
    "She currently is communications director at Brookings’ Governance Studies program.",
    "Meanwhile, there’s a bipartisan House effort led by Reps. SETH MOULTON (D-Mass.)",
    "The question now is if such evidence exists after all this time in search of it.",
    "He most recently was a nonresident fellow at the Stanford Internet Observatory.",
    "Follow us on Twitter\nAlex Ward @alexbward\nQuint Forgey @QuintForgey\nFollow Us",
    "Transitioning to a new defense-adjacent or foreign policy-focused gig?",
    "“We are ready to take together with our allies all necessary steps.",
    "A new round of talks kick off in Vienna on Tuesday.",
    "IT’S MONDAY: Thanks for tuning in to NatSec Daily.",
    "Not mentioned in any disclosed report.",
    "Rep. DAVID TRONE (D-Md.",
    "GERMANY AND U.S.",
    "POLL: U.S."
  ]
}