{
  "id": 5601,
  "mediaId": 2676,
  "date": "2022-02-04",
  "headline": "Biden pleads for unity — in speech at anti-LGBTQ, faux-bipartisan Prayer Breakfast",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/joe-biden-national-prayer-breakfast-0203221.jpg",
  "link": "https://www.salon.com/2022/02/04/biden-pleads-for-unity--in-speech-at-anti-lgbtq-faux-bipartisan-prayer-breakfast_partner/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Larsen",
  "authorUrl": "https://www.salon.com/writer/jonathan-larsen",
  "termIds": [
    0
  ],
  "sentences": [
    "The Family's only brand new House Democrat, Rep. Frank Mrvan of Indiana, also provided a statement, saying:\nI ran for Congress in order to continue to be a tireless advocate to bring people together and have the difficult conversations that are necessary to bridge the great divides that are confronting our nation.",
    "After TYT shared internal Family guest and invitation lists with him, Moline called it \"remarkable\" that aside from pro forma invitations to Jewish diplomats and office-holders, \"There seemed to be no cohort of Jews, leaders or otherwise … no renowned scholars or pundits from the community.\"",
    "Moline added, \"For people who claim to have a Biblically-induced love for the Jews and the State of Israel, you almost have to be intentional not to have guests from the wide range of Jewish and Israel-friendly organizations that inhabit every inch of the religious and political spectrum.\"",
    "Even after The Family began selectively sharing its websites, the White House had neither disclosed Biden's participation to TYT nor announced it publicly, apart from his weekly schedule (Biden's remote address to the 2021 breakfast was never posted to the White House website).",
    "In a statement, the Secular Coalition for America said:\n[T]he presence of our nation's leaders at this Christian nationalist event organized by an extremist organization makes it appear as if the U.S. government endorses a fringe movement within one particular religious sect.",
    "Neither Biden nor Gillibrand, this year's breakfast co-chair, disclosed their involvement in response to earlier queries, even after The Family began letting its network and members of Congress know that the two, and at least a dozen other Democrats, would be involved.",
    "Rabbi Jack Moline, president of the Interfaith Alliance, told TYT that \"the socially conservative agenda promoted by the sponsors ought to make those committed to diversity, equity and inclusion think twice about lending their names and titles to this set of events.\"",
    "The TakeCareTim blog reported more than two years ago that Family insider Rep. Tim Walberg, R-Mich., a member of this year's host committee, used side events at Ukraine's breakfasts to push overtly political, anti-LGBTQ and anti-choice messages.",
    "It's not clear why Biden, Gillibrand, and the other Democrats didn't admit their involvement earlier, let alone announce it in a manner befitting an event that is ostensibly meant to unify political figures of different faiths and ideologies.",
    "In fact, conservative, evangelical Family insiders draw up the vast majority of the guest list, and The Family even secretly allows anti-LGBTQ officials in other governments to invite guests of their choosing to the breakfast.",
    "After keeping their involvement secret until this week, President Biden, Vice President Harris, Sen. Kirsten Gillibrand, D-N.Y., and other prominent Democrats participated in this year's National Prayer Breakfast on Thursday.",
    "RELATED: Bias, theocracy and lies: Inside the secretive organization behind the National Prayer Breakfast\nThe White House only revealed that Biden and Harris would attend Sunday evening, when it released his weekly schedule.",
    "Last week, TYT revealed that Family insiders secretly used the U.S. and Guatemalan prayer breakfasts to stand up an evangelical political network that helped crush a UN task force aimed at cleaning up Guatemalan corruption.",
    "My voting record and history as an elected official demonstrate my unwavering commitment to fight against any form of discrimination, including standing up for members of all religions and members of the LGBTQ community.",
    "In a statement, she said:\nWe are deeply disturbed that President Biden has chosen to address an event that has become a hotspot for Christian nationalists and theocrats, anti-LGBTQ bigotry and influence-peddling.",
    "But there's a growing body of evidence that suggests not only that that is false but that it helps to whitewash The Family's secret work at the closed-door \"breakout sessions\" that are part of the breakfast.",
    "When it was suggested they had inadvertently revealed that Biden was scheduling something related to the breakfast, the spokesperson responded, \"We don't have anything further to share yet at this time.\"",
    "Rémy Bonny, executive director of the LGBTI organization Forbidden Colours was considerably stronger:\nThe National Prayer Breakfast is a deceptive organization by the world's leading ultraconservatives.",
    "Congressional participation helps foster the implication that guests are invited by members of Congress, or even the president, but internal Family documents show that that's a very rare occurrence.",
    "The site exalts Jesus explicitly and its congressional \"honorary host committees\" have no Jews, Muslims, Mormons or any non-Christians, even though all of those faiths are represented in Congress.",
    "The rest of the \"host committees\" consist largely of Republican Family allies sympathetic to Graham's sentiments, as well as a few Democratic breakfast veterans who otherwise support LGBTQ causes.",
    "Sen. Marsha Blackburn, R-Tenn.\nSen. Shelley Moore Capito, R-W.Va.\nSen. Robert Casey D-Pa.\nSen. Kevin Cramer, R-N.D.\nSen. Jim Inhofe, R-Okla.\nSen. Jim Lankford, R-Okla.\nSen. Roger Marshall, R-Kan.",
    "A recent congressional disclosure form shows that Kibben, along with Vargas and Rep. Brian Fitzpatrick, D-Pa., was invited by Ukraine's anti-LGBTQ organizers to their prayer breakfast last year.",
    "When asked about his involvement, Correa said in a statement:\nEvery Democratic President in recent history including Presidents Clinton, Obama, and Biden have been part of the Prayer Breakfast.",
    "Presaging Mrvan's unity claims, Family insider David Beasley, the former Republican governor of South Carolina, had predicted that forming prayer groups in Guatemala would unite rival factions.",
    "Last year Gohmert responded to the failure of his legal challenge against Biden's victory by saying on TV, \"You got to go to the streets and be as violent as antifa and [Black Lives Matter].\"",
    "On January 6, 2021, those of us who were on the House floor were gathered in a secure location, and in that uncertain moment we joined hands and prayed with House Chaplain [Margaret] Kibben.",
    "While the events are superficially anodyne, The Family uses them not only to build right-wing networks but also to mainstream activists and policies opposed to LGBTQ and reproductive rights.",
    "Instead, The Family posted information about the event, including Biden's participation, on a website intended only for in-person attendees, limited to members of Congress and their spouses.",
    "Neither is that of Rep. Juan Vargas, D-Calif., whose appearance at a Ukrainian prayer breakfast run by anti-LGBTQ politicians prompted one LGBTQ group to warn that Vargas had been \"misled.\"",
    "But one of those Democrats, Sen. Tim Kaine of Virginia, told TYT in December through a spokesperson that he had not attended since 2016 and had \"no intention of attending\" this year.",
    "Rochester's absence is noteworthy due to the fact that her state's senior senator, Chris Coons, remains on the list, and is also The Family's most prominent Democratic defender.",
    "The congressional site said only that the \"Honorary House and Senate Committees request the pleasure of your company at the [breakfast] with The President of the United States.\"",
    "Forced to flee the country, Guatemala's former attorney general now relies on financial help from fellow refugees and does her prayers in a studio apartment outside Washington.",
    "When TYT asked the White House in December whether Biden would participate this year, a spokesperson responded, \"We will circle back with you when we have something to share.\"",
    "The Washington Post report described the event as \"a Washington tradition where politicians could set aside their partisan differences and find commonalities in their faiths.\"",
    "I will continue to make myself present in any room in order to lend my voice to help bring people together and live up to our mission to be our brother's and sister's keeper.",
    "This article is part of a series about the Fellowship Foundation, the secretive religious group that runs the National Prayer Breakfast and is popularly known as The Family.",
    "Most major media completely ignored the controversy surrounding the Prayer Breakfast, or its multiple ties to far-right evangelical groups with strongly anti-LGBTQ agendas.",
    "Other past Democratic \"hosts\" not signing on this year include Reps. Emanuel Cleaver II, D-Mo., Debbie Dingell, D-Mich., Grace Meng, D-N.Y., and Lisa Blunt Rochester D-Del.",
    "The president told Senate Minority Leader Mitch McConnell, who has doggedly obstructed his agenda, \"Mitch, I don't want to hurt your reputation, but we really are friends.",
    "Biden made news with a speech appealing for \"unity\" and praising America's diversity of faith before a purportedly bipartisan crowd at the U.S. Capitol Visitor Center.",
    "The Family's other site hosted a livestream, but even that site doesn't appear to have been shared with the general public through a press release or on social media.",
    "At a time of rising Christian nationalism, with LGBTQ and reproductive rights under assault, Biden has not explained why he continues to facilitate The Family's work.",
    "But Democratic participation has become increasingly fraught, in political terms, and this year comes in the face of mounting pressure from LGBTQ and secular groups.",
    "One, Rep. Charlie Crist, D-Fla., distanced himself from the breakfast a year ago after TYT reported on Family insiders backing Donald Trump's false election claims.",
    "TYT reported last year that the Prayer Breakfast was an important tool for Family insiders and allies who radicalized Lindell religiously and politically.",
    "The Family uses this event to create deception about their real agenda: [to] recreate a patriarchal society outlawing LGBTIQ+ persons across the world.",
    "There's no evidence that his eloquent words about forging unity and ending division at this week's breakfast are likely to make those things happen.",
    "Here are the other House members:\nRep. Robert Aderholt, R-Ala.\nRep. Virginia Foxx R-N.C.\nRep. Louie Gohmert, R-Texas\nRep. Vicky Hartzler, R-Mo.",
    "Gohmert's friendship with former Rep. Janice Hahn, D-Calif., a Family ally, has been held up by both as an example of a bridge built on prayer.",
    "Rep. Conor Lamb, D-Pa.\nRep. John Moolenaar, R-Mich.\nRep. Cathy McMorris Rodgers, R-Wash.\nRep. Bobby Scott, D-Va.\nRep. Victoria Spartz, R-Ind.",
    "Rabid Trump supporter and election truther Mike Lindell, for instance, says that his claims about the 2020 election have a religious basis.",
    "But after Guatemala's evangelical president began targeting the UN task force, its supporters were no longer invited to the D.C. breakfast.",
    "Carper's absence may have nothing to do with revelations about The Family, which seems to have a stronger Democratic bench in the Senate.",
    "A source close to The Family told TYT that, \"They would prefer more [Democrats] so I would take that that they couldn't find any more.\"",
    "The Congress-only website did not even make clear that Biden would speak, as he did last year and as presidents historically have done.",
    "It is deeply disappointing to see our elected officials legitimize this event, we strongly urge them to reconsider their involvement.",
    "It wasn't clear why Kaine's name is still on this year's list and his office did not immediately respond to a request for comment.",
    "The Family added three new Democratic Senate \"hosts\": Robert Casey of Pennsylvania, Maggie Hassan of New Hampshire, and the Rev.",
    "Asked how they would explain those implications to participating Democrats, the source said, \"Have them read your reporting.\"",
    "Mrvan's suggestion that his attendance will bring people together echoes past rhetoric from other Democrats and The Family.",
    "Responding to a TYT followup, the same spokesperson emailed on Jan. 27: \"We are trying to coordinate with Scheduling now.\"",
    "As TYT discovered, Graham's secret financial backing of the breakfast has helped keep its operations afloat during COVID.",
    "It is in that spirit of prayer from January 6 that I agreed to lend my name for the National Prayer Breakfast committee.",
    "No longer listed this year are at least seven Democrats who have been cited in TYT's recent reporting about The Family.",
    "Although Rep. Val Demings, D-Fla., defended her involvement last year, her name is also not on this year's invitation.",
    "It has been mired in scandal after scandal, including the FBI's arrest of a Russian agent with ties to Vladimir Putin.",
    "Delaware's junior senator, Sen. Tom Carper, another previous Democratic attendee, doesn't appear on this year's list.",
    "(The source said that this year's keynote speaker is criminal-justice reformer Bryan Stevenson, another Delawarean.",
    "This year, even the breakfast itself — a scaled-down version, presumably due to COVID — was not announced publicly.",
    "Secular, interfaith and LGBTQ organizations responded strongly to Democratic participation in Thursday's breakfast.",
    "This series is based on Family documents obtained by TYT, including lists of breakfast guests and who invited them.",
    "Annie Laurie Gaylor, co-president and co-founder of the Freedom from Religion Foundation, was even more critical.",
    "The National Prayer Breakfast makes a mockery of our secular Constitution and serves to undermine our democracy.",
    "Six Democrats are also listed, along with Sen. Angus King of Maine, an independent who caucuses with Democrats.",
    "Neither responded, and as of earlier this week, neither had made any public disclosure of their participation.",
    "\"Many of the Dems enjoy and value the time together [at the breakfast],\" the source close to The Family said.",
    "Gillibrand's co-chair, Sen. Rounds of South Dakota, last year tweeted what appeared to be a threat to Biden.",
    "Guatemala is now a major source of frustration for the Biden White House and human-rights activists alike.",
    "Some of the Republican \"committee\" members have undercut Democratic claims about prayer's unifying power.",
    "Bonny's claim about evangelicals appears to be a reference to leading evangelical pastor Franklin Graham.",
    "Kibben told TYT in an email last year that she did not attend, but declined to answer followup questions.",
    "(The website for members of Congress to register for attendance makes no mention of any COVID protocols.)",
    "Similarly, Ukraine's prayer breakfast had proved divisive even before TYT's reporting on its organizers.",
    "Gillibrand and Mike Rounds, R-S.D., about a source's claim that they would co-chair the 2022 breakfast.",
    "The same evangelicals are responsible for the anti-LGBTIQ+ initiatives in Poland, Hungary and Ukraine.",
    "For years, Democratic participants have helped legitimize Family prayer breakfasts around the world.",
    "This year, for the first time, it will be held on federal property, at the Capitol Visitor Center.",
    "If we assume that everyone has a certain set of views, then if the rest leave, then who is left?",
    "I'm a Christian and a Catholic who strongly believes in human rights and equal rights for all.",
    "TYT previously reported on the guest lists' scarcity of progressive leaders and LGBTQ people.",
    "Graham has been identified as a major funder of anti-LGBTQ networks in Europe and elsewhere.",
    "Although the event is ostensibly ecumenical, the breakfast website betrays its true nature.",
    "Democratic participation appears to be growing sparser, as well as more sensitive.",
    "One reason the breakfasts don't yield unity may be that not everyone gets invited.",
    "\"But [they] do not fully understand the wider activities or their implications.\"",
    "Google, however, cached The Family's congressional website as early as Jan. 25.",
    "The White House has also never explained why Biden has chosen to participate.",
    "Traditionally, The Family has held the breakfast at the Washington Hilton.",
    "Rep. Tom Suozzi, D-N.Y.\nRep. Randy Weber, R-Texas\nRep. Joe Wilson, R-S.C.",
    "Here are the remaining host committee senators:\nSen. John Boozman, R-Ark.",
    "Every year more and more members of Congress walk away from this event.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "It's on the House side where the growing Democratic shortfall shows up.",
    "(Only two of this year's Democrats responded to requests for comment.)",
    "Only five House Democrats are listed, compared with 11 Republicans.",
    "Stevenson's organization did not immediately respond to an email).",
    "Last year, eight House Democrats lent their names to the event.",
    "Of the 32 members of Congress named, all but three are white.",
    "Seven Senate Republicans are on the Senate \"host committee.\"",
    "Rep. Lou Correa, D-Calif., a past \"host,\" is back this year.",
    "Similar examples can be found from other Family Republicans.",
    "Democrats should not treat the NPB as a bipartisan event.",
    "That was well after the White House had told The Family.",
    "You're a man of your word, and you're a man of honor.\"",
    "And the URL appeared online even earlier, on Jan. 10.",
    "Subscribe to our morning newsletter, Crash Course.",
    "One called Biden's involvement \"mind-boggling.\"",
    "Why Biden still embraces it, is mind-boggling.",
    "You've always done exactly what you've said.",
    "Two, both men, are Black and one is Latino.",
    "Even earlier, in September, TYT asked Sens.",
    "Last year's was virtual due to COVID.",
    "That circling-back never happened.",
    "There are 23 men and nine women.",
    "Raphael Warnock of Georgia.",
    "Rep. French Hill, R-Ark."
  ]
}