{
  "id": 5603,
  "mediaId": 2713,
  "date": "2022-02-09",
  "headline": "Caged, isolated, scared: Why Perth Children’s Court president would rather send kids to an adult prison",
  "image": "https://static.ffx.io/images/$zoom_0.2491%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_94/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/7432ce7b5db8e9e3f35ceb4e1afb9c557800909d",
  "link": "https://www.smh.com.au/national/western-australia/caged-isolated-scared-why-perth-children-s-court-president-would-rather-send-kids-to-an-adult-prison-20220131-p59soq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aja Styles",
  "authorUrl": "https://www.smh.com.au/by/aja-styles-hve7u",
  "termIds": [
    0
  ],
  "sentences": [
    "Banksia Hill Detention Centre facts:\nFirst Nations youth make up 74 per cent of Banksia Hill detainees;\nMore than 530 testimonies have been submitted as part of the class action;\nOf those, more than 80 per cent are from male complainants and 20 per cent from females;\n80 per cent of the plaintiffs are First Nations, 15 per cent caucasian and 5 per cent migrants; and\n10,000 inmates have been detained at Banksia Hill since 1997.",
    "“The conditions at Banksia at the moment are very bad and it is frankly a consideration in my deciding now to send you somewhere else because the older boys who I’ve sent to prison have done better in prison, frankly, than they have in Banksia because the lockdowns in Banksia are so long that there’s very little rehabilitative effect,” Judge Quail said in his January 18 sentencing.",
    "This is our great shame.”\n*Not the boys’ real names as they were underage when they were detained in Banksia Hill\nCrisis support can be found at Lifeline: (13 11 14 and lifeline.org.au), the Suicide Call Back Service (1300 659 467 and suicidecallbackservice.org.au) and beyondblue (1300 22 4636 and beyondblue.org.au)\nThank you for reading the Herald.",
    "“Most confronting is that we are entering this cage, to visit children as young as 10 years old.”\nDr James Fitzpatrick, FASD expert\nJudge Quail agreed that the conditions at the already grim detention centre had worsened during the pandemic and sentenced the 17-year-old to 14 months jail at Hakea Prison, with parole in seven months.",
    "The forgotten children of lockdown in WA are experiencing conditions worse than those afforded murderers.Credit:Matt Davidson\nOne boy, 15, has spent 77 days out of 91 locked in Banksia Hill’s Intensive Supervision Unit (ISU), known as “the cage” because of its concrete walls, wire roofing and no natural sunlight.",
    "There have been increased assaults on prison officers, with up to 22 assaults a month early last year marking it as the state’s most violent correctional facility, while there were seven attempted suicides in October alone, according to a legal firm which has sought to bring a class action against Banksia Hill.",
    "“Chronic understaffing means more lockdowns, which makes detainees agitated and disruptive.”\nOne of those who rioted on the roof of Banksia Hill over getting locked up for hours, said one of the guards “bashed and flogged” one of the boys because “apparently he threw a rock at the guard but that wasn’t true”.",
    "But poor record keeping at the jail, meant then-Inspector of Custodial Services Neil Morgan could only substantiate that in 2017, two teenagers were held in solitary confinement for 10 days, which breached international standards but not WA law because the boys were managed under individual case plans.",
    "Department of Justice data on self-harm and attempted suicide from July 2018 to June 2019 and July 2019 to June 2020 showed a decrease in instances of minor self-harm incidents from 145 to 113, with only one case of serious self-harm in the latter report, and a drop from two attempted suicides to one.",
    "“Guards would lock boys down for days and just leave them in their cells because the boys would play up because the guards would treat them wrong.”\nFrom the age of 10, Luki* has been in Banksia about 30 times and he claimed he never saw a psychologist, doctor, counsellor or teacher.",
    "Cameras and other security infrastructures were a highly visible feature of the centre, making it “appear much like an adult prison”, while accommodation units were bare and unwelcoming, with graffiti widespread and the gardens unkempt, according to a 2020 prison inspection.",
    "“Most confronting is that we are entering this cage, to visit children as young as 10 years old.”\nHe said the state’s youth justice system had the highest rates of FASD in the world, with many still slipping through the cracks or not getting critical access to services.",
    "Accommodation quarters in Banksia Hill Detention Centre have changed since this picture was taken.Credit:Michael O’Brien\nDr James Fitzpatrick, a paediatrician, and expert in FASD and incarcerated youth in WA, said visiting Banksia Hill was “a haunting experience”.",
    "“It’s three years later but I remember it – I wanted to get out of there and don’t want to ever go back.”\nAurelius*, who has fetal alcohol spectrum disorder, was 16 at the time and was never convicted of the petty stealing offences that landed him in the cage.",
    "Share\nNormal text sizeLarger text sizeVery large text size\n3\nView all comments\nA West Australian children’s prison has been accused of human rights violations so dire that a Perth judge would rather send 17-year-olds to a maximum-security prison for adults.",
    "“The first time I went in there, there were about five guards and four nurses, and they took me into a room, put me on my back and pulled my pants down and jabbed a needle in the back of me, and they all ran out of the room and locked the door,” he said.",
    "The 15-year-old who spent the majority of his time in ISU, and who has clocked up more than a dozen assault charges and threatened suicide since being detained, was only afforded the chance to breathe fresh air for half the days he was in “the cage”.",
    "Last month, the President of the Children’s Court, Hylton Quail, granted the wish of a 17-year-old boy to serve his time at Hakea Prison, an adult remand facility in Perth’s southern suburbs, rather than return him to the state’s only juvenile jail.",
    "This is making it very difficult for the staff that are there and the people who are suffering the most are the detainees.”\nCorrective Services Minister Bill Johnston’s office has previously denied claims that Banksia Hill was understaffed.",
    "I wanted to come home because I was scared.”\nThe alleged denial of exercise, education, solitary confinement, excessive use of restraints and lack of family contact at Banksia Hill was likened to “torture” by Amnesty International in 2018.",
    "Chronic understaffing, assaults that required St John’s Ambulance and threats to safety have taken a toll on staff, leading to high staff turnover, 10 changes of leadership in 10 years and vacancies in the rosters due to stress leave.",
    "National Suicide Prevention and Trauma Recovery Project volunteers Gerry Georgatos and Megan Krakouer, who were called in to de-escalate a riot last September, saw “a lot of the kids in the ISU and there was at least eight cells”.",
    "Many of the 100-odd detainees at Banksia Hill have some sort of mental or learning impairment, a third due to FASD, so reading materials prove useless unless taught and electronic devices often get smashed in anger or protest.",
    "Dr Fitzpatrick continues to be frustrated by the lack of improvement in outcomes, including the persistent high rates of suicide and justice system involvement, and the low rates of educational and employment attainment.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "The continued problems plaguing Banksia Hill have sparked plans for a class action against the detention centre, with Mr Georgatos collecting more than 530 testimonials on behalf of Levitt Robinson Solicitors.",
    "Barrister Tony Hager told the court his client had been subjected to long and lengthy lockdowns at Banksia Hill since being taken into custody for a string of aggravated burglaries on December 17.",
    "WAtoday understands that his matter will be referred to the Aboriginal Legal Service of WA to investigate a civil lawsuit over human rights violations and breaches of the Young Offenders Act.",
    "“And that’s no criticism of the particular staff there nor the superintendent who’s trying very hard, but there’s simply inadequate resourcing, in my view, and inadequate staff at the moment.",
    "“They are disgraceful, with respect, in terms of the extent of the lockdowns that he has had to endure, and I accept it’s not just him, but all the others there at Banksia,” Mr Hager said.",
    "Under the Young Offenders Act, the ISU was designed to be a punishment of last resort that required confinement orders, but WAtoday understands no such orders exist for the 15-year-old.",
    "“While detained in Banksia Hill, there is an opportunity to provide therapeutic support and help them to set realistic, functional goals for their life back in the community,” he said.",
    "As the state education system groans under the amassing weight of COVID-19, education programs in Banksia Hill Detention Centre has declined since the prison’s last inspection in 2020.",
    "There have been increasing reports before WA courts that Banksia Hill Detention Centre’s staffing shortages have forced 10 to 17-year-olds into repeated lockdowns for 22 hours a day.",
    "“When we got down the guards started slamming us down on the ground and my lip was split open and blood started coming out, the SRG sprayed pepper spray at us,” Luki* said.",
    "“He was in a rip-proof suit – he was going through a hard time because someone close to him passed away, it was very sad – he was put in isolation down the back,” he said.",
    "Dr Fitzpatrick said even after 20 years of working with disadvantaged youth, he could never get used to seeing a child far away from family and country in such a setting.",
    "The Inspector of Custodial Services last year reported 39 active workers’ compensation cases at Banksia Hill, which tended to climb due to “critical incidents”.",
    "“Safe operational standards are 65 staff on-site, during the periods in question the centre was operating at around 40 on a day shift,” Ms Bray said in June.",
    "Among them are reports of children at risk of suicide being escorted in handcuffs to the ISU, with Luki* saying a mate of his tried to kill himself in 2021.",
    "Former detainee, 19-year-old Aurelius*, described “the cage” as a dark grey box so small that if he spread his arms out wide he could touch both walls.",
    "Over summer, with no fans in their cells, the children at Banksia Hill have been unable to sleep through Perth’s record-breaking 11 days of 40C heat.",
    "“The back of Banksia is worse than any other back of a prison of any adult prisons – it’s the smallest, the darkest and the most isolating.",
    "Community and Public Sector Union assistant secretary Melanie Bray last year warned the centre was at risk of a riot like in 2013 and 2017.",
    "“I was doing it hard in there and the guards didn’t care, I didn’t sleep for like about six days, there was no fan in there,” he said.",
    "It’s cruel.”\nA bright frontage at Banksia Hill Detention Centre in Western Australia disguises a dark ‘cruel’ cage at the rear.",
    "But he was unable to comment at the time of publication because he was on a regional tour of the state, with limited reception.",
    "“We enter through vast fences topped with barbed wire, through locked gates and under escort of security personnel,” he said.",
    "“I never saw the sun when I was in the cage – only if I was allowed to make a phone call – and so I had no concept of time.",
    "By Aja Styles and Lauren Pilat\n February 10, 2022 — 9.02am\n Save\nLog in, register or subscribe to save articles for later.",
    "The boy’s exercise consisted of walking around a caged outdoor pen the size of a generous two-square handball court.",
    "“Boys in ISU were lucky to get half an hour sunlight, so they’re in there the whole time,” Mr Georgatos said.",
    "“I would ring my nan crying because the older boys were picking on me and I was lonely.",
    "“Every time we would get locked down we’d get locked down for about six hours.",
    "“I know they’re pushing through additional staff to try and get them on board.",
    "“That is the brutal reality of life for these children,” Dr Fitpatrick said.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "“Moreover, it is often seen as a rite of passage into adolescence.",
    "Recreation has been affected by the lockdowns as well.",
    "All I could do was lay there and sleep.",
    "“People are being deprived of programs.",
    "“There were no blankets or anything.",
    "This article is complimentary.",
    "Hide content"
  ]
}