{
  "id": 562,
  "mediaId": 2712,
  "date": "2022-04-12",
  "headline": "England players should be being pushed to become household names before World Cup, says Karl Fitzpatrick",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2022/04/AW3_6869.jpg?crop=0px%2C127px%2C1921px%2C1279px&resize=1920%2C1080",
  "link": "https://www.thesun.co.uk/sport/18238101/england-world-cup-tv-marketing/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gary Carter",
  "authorUrl": "https://www.thesun.co.uk/author/gcarter/",
  "termIds": [
    2169,
    3484,
    3536,
    4129,
    352,
    902,
    1217,
    1235,
    4963
  ],
  "sentences": [
    "Most read in rugby league\nKA-POW\nDaryl Powell claims refs admit Warrington were robbed by wrong call\nHARD TIMES\nZak Hardaker released by Wigan after latest disciplinary issues\nFEVER MITCH\nMitch Garbutt believes handling the pressure could turn Leeds' season around\nTALK THE TALK\nEngland RL boss Shaun Wane may influence Gareth Southgate dealings with stars\n“They should absolutely be appearing on certain TV shows.",
    "More should be made of England's stars, like Tommy Makinson, to promote them, says Karl FitzpatrickCredit: SWPIX.COM\nAnd Warrington chief executive Fitzpatrick feels Rugby Football League chiefs should be planting the stars in the public conscience.",
    "“There should be a dedicated marketing strategy for England players.”\nWarrington chief exec Fitzpatrick believes there should be a dedicated marketing strategy for England ahead of the World CupCredit: SWPIX.COM",
    "“So we should have a social media strategy that takes in all the platforms and promoting players the way they should be promoted - as gladiatorial, cool athletes.",
    "The Autumn sees Shaun Wane’s side go for glory on home soil – but those wearing the shirt are virtually unknown outside the 13-a-side circle.",
    "“It’s a great opportunity for the sport, we should have England players front and centre of our marketing activity this year.",
    "KARL Fitzpatrick believes rugby league bosses are missing a trick by not pushing England’s stars ahead of the World Cup.",
    "“We need to be on platforms people are engaging with – like TikTok as a place young people are present in.",
    "We should be pushing players in readiness for that campaign - then maximising it off the back of that.",
    "That means putting them on big TV shows, exposing their characters and making them familiar faces.",
    "He said: “We should be marketing our England players aggressively at the moment.",
    "“Super League’s on free-to-air Channel 4 and the World Cup’s on free-to-air BBC.",
    "Ones that will give us the most bang for our buck with great audience figures."
  ]
}