{
  "id": 5624,
  "mediaId": 2554,
  "date": "2022-02-07",
  "headline": "Queen 'hooked on gossip' - Her Majesty gets special daily private email of 'inside track'",
  "image": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/1562094.jpg",
  "link": "https://www.express.co.uk/news/royal/1562094/royal-family-news-queen-elizabeth-gossip-email-westminster-politics",
  "mediaOutlet": "dailyexpress.co.uk",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon King",
  "authorUrl": "https://www.express.co.uk/search?s=Jon%20King&b=1",
  "termIds": [
    0
  ],
  "sentences": [
    "Paying tribute to Her Majesty, who marked her 70th year on the throne on Sunday, former republican Mr Fitzpatrick, said: \"Just seeing her majesty as I did at close quarters on quite a few occasions, both privately and publicly, as everybody has said who has ever been interviewed about her: the awareness, the sharpness, the stamina, the integrity, the enthusiasm, the energy that she puts into the task is absolutely singular.",
    "The Queen looks at a fan as she views a display of memorabilia from her Golden and Platinum Jubilees (Image: Getty)\n\"I think one of the keys is her attention to detail, her desire to be well-informed, and not interfere, because she understood the constitutional position completely.\"",
    "Conservative Andrew MacKay, who held the post in 1996, admitted his initial \"rather stilted efforts\" led to a phone call from the Queen’s private secretary who suggested she wanted the \"gossip and the inside track\", POLITICO reports.",
    "Queen Elizabeth inspects Platinum Jubilee art submissions\nAs monarch, Her Majesty has to remain politically neutral although she plays important ceremonial roles, including by opening new sessions of Parliament.",
    "Former dispatch writers told POLITICO they were asked to write the inside track because the Queen reads the newspapers and listens to BBC Radio 4’s flagship morning program, Today, or another daily news show.",
    "\"The year of this unprecedented Platinum Jubilee brings an opportunity for us all to come together in celebrating the service of The Queen, by whose example we will continue to be led in the years to come.\"",
    "He said: \"On this historic day, my wife and I join you all in congratulating Her Majesty The Queen on the remarkable achievement of serving this nation, the Realms and Commonwealth for seventy years.",
    "You know, ‘the Speaker’s lip curled with hatred'.”\nMr Swayne added that it became clear to him that the Queen read his bulletins when she told him at their last meeting she had enjoyed them.",
    "Tory MP Desmond Swayne, who held the post in 2013 and 2014, told POLITICO he put any insider news in the daily email when he had it, although he confessed to never being much good at gossip.",
    "One tradition sees a junior member of the Government whips’ office writing a private daily email to the Queen with a colourful account of what has been going on in Parliament that day.",
    "The Queen spent her Accession Day in private at the Sandringham estate in remembrance of her father George VI, whose death marked the start of her reign at the age of 25.",
    "The Queen used the occasion to express her \"sincere wish\" that Camilla will be known as Queen Consort when Charles becomes King, urging the public to support them both.",
    "He told POLITICO: \"It’s patently obvious to everybody but the most anti-royalist that [the Queen] has been a hugely successful monarch over a very long period of time.",
    "As we have sought together to serve and support Her Majesty and the people of our communities, my darling wife has been my own steadfast support throughout.",
    "Ex-Labour MP Jim Fitzpatrick, who held the post between 2003 and 2005, recalled instructions from the Queen when he asked what he should write about.",
    "National celebrations marking the Queen's record-breaking service on the throne will be staged during a four-day bank holiday weekend from June 2-5.",
    "So there was every encouragement just to be frank and transparent with what one was saying because it was just private between she and I.\"",
    "He said: \"I put quite a lot of effort into it and I used to really go for [the former Speaker of the House of Commons] John Bercow.",
    "Prince Charles said in a statement marking the anniversary that he and Camilla were \"deeply conscious\" of the honour.",
    "This does not mean that Elizabeth does not want to know news of the latest goings on behind the scenes in Government.",
    "Mr Mackay went on to turn his missive into a who’s up, who’s down, which he was later told had been \"appreciated\".",
    "This Jubilee was her first without her beloved husband of 73 years the Duke of Edinburgh, who died 10 months ago.",
    "\"The Queen's devotion to the welfare of all her people inspires still greater admiration with each passing year.",
    "THE QUEEN is hooked on gossip about Westminster and gets a private daily email detailing the \"inside track\".",
    "Mr Fitzpatrick said: \"She said something like 'that which doesn’t make the press would be of interest'.",
    "I am a great admirer of Her Majesty now and I’ve got a great respect for her and for the institution.",
    "\"One couldn’t but admire just how much she gives to the role as our head of state.",
    "\"It’s personal correspondence so it would never be disclosed to anybody.",
    "\"We are deeply conscious of the honour represented by my mother's wish.",
    "And my republican tendencies have certainly been eclipsed.\""
  ]
}