{
  "id": 567,
  "mediaId": 2586,
  "date": "2022-04-18",
  "headline": "Former Top 10 QB Makes ‘Most Sense’ as Veteran Addition: Steelers Insider",
  "image": "https://heavy.com/wp-content/uploads/2022/04/GettyImages-1337266305.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/pittsburgh-steelers/quarterback-josh-rosen-makes-most-sense/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Zasky",
  "authorUrl": "https://heavy.com/author/jasongzasky6/",
  "termIds": [
    1509,
    2609,
    2855,
    3069,
    3548,
    4395,
    4480,
    4558,
    93,
    823
  ],
  "sentences": [
    "ALSO READ:\n• Free Agent CB Joe Haden Named ‘Best Fit’ for Steelers’ AFC North Rival\n• Draft Simulators See 2 Top QBs Among Steelers’ Most Likely Picks\n• Former Steelers ‘Hostage’ Signing With Texans: Report\n• 2 Steelers Legends Named XFL Head Coaches\n• Ex-Cowboys Exec Apologizes for ‘Disgraceful’ Comments About Dwayne Haskins",
    "Josh Dobbs Is No Longer an Option\nAt one point in time, the Steelers might have simply elected to bring back former fourth-round pick Josh Dobbs, who served as the team’s fourth-stringer last summer and spent all of last season on injured reserve.",
    "Potential draft picks include everyone from top prospects like Malik Willis and Kenny Pickett to possible late round picks like South Dakota State’s Chis Oladokun or the University of Waterloo’s Tre Ford.",
    "Rosen would also presumably come cheap — and without any financial commitment — as his 2021 contract with the Falcons paid him $850,000, and did not include a signing bonus.",
    "Among that group, “Rosen makes the most sense, though he is still a candidate to be re-signed by the Atlanta Falcons,” offers Gerry Dulac of the Pittsburgh Post-Gazette.",
    "But Dobbs agreed to a one-year contract with the Cleveland Browns the day before Haskins’ accident, following tryouts with the Baltimore Ravens and New England Patriots.",
    "Lynch struggled mightily while playing a bit role during the game, completing just two of five passes for one yard with one interception, according to the box score.",
    "Meanwhile, the aforementioned Paxton Lynch is currently playing for the Michigan Panthers of the USFL, along with fellow ex-Steelers T.J. Carter and Cavon Walker.",
    "Last season Rosen — 6-foot-4 and 226 pounds — appeared in four games for the Falcons and completed just two of 11 passes for 19 yards, per Pro Football Reference.",
    "His career yards per attempt is 5.6; by way of comparison, consider that Ben Roethlisberger averaged 6.2 yards per attempt during his 18th and final NFL season.",
    "Trubisky signed a two-year deal in mid-March while Rudolph inked a one-year extension in April 2021 that keeps him with the Steelers through the 2022 season.",
    "“He’s 25 and, above all else, has the pedigree (Mike) Tomlin seems to seek in outside free agents — he’s a former first-round draft choice.",
    "The team plans to have four by the time training camp rolls around, with one likely to be a draft pick and the other a veteran free agent.",
    "After all, that’s part of the reason Tomlin signed Haskins and another first-round quarterback, Paxton Lynch, in 2019,” continues Dulac.",
    "10 overall by the Arizona Cardinals in 2018 suggests the Steelers might be better off taking a flyer on a rookie undrafted free agent.",
    "In terms of the available unrestricted free agents, the pickings are getting slim, down to the likes of Cam Newton, Mike Glennon, A.J.",
    "He has completed 277 of 513 passes (54%), with 12 touchdowns and 21 interceptions, good for a quarterback rating of just 61.6.",
    "Josh Rosen of the Atlanta Falcons rushes upfield against the Cleveland Browns at Mercedes-Benz Stadium on August 29, 2021.",
    "In the wake of the tragic death of Dwayne Haskins, the Pittsburgh Steelers have just two quarterbacks on their roster.",
    "So the Steelers are looking to add to a quarterback room that is currently limited to former No.",
    "Follow the Heavy on Steelers Facebook page for the latest breaking news, rumors and content!",
    "Josh Rosen Has a 61.6 Career Passer Rating\nBut his lack of success since being drafted No.",
    "He also threw a pair of interceptions among his 11 attempts, hence his 0.0 passer rating.",
    "Rosen’s regular-season track record with the Cardinals and Dolphins isn’t much better.",
    "On Sunday April 17, Michigan lost its season-opener to the Houston Gamblers, 17-12.",
    "All together he has appeared in 24 NFL games and has a 3-13 record as a starter.",
    "He also carried the ball four times and 14 yards and lost a fumble.",
    "2 overall pick Mitch Trubisky and veteran backup Mason Rudolph.",
    "The latest Steelers news straight to your inbox!",
    "Join the Heavy on Steelers newsletter here!",
    "McCarron, Ryan Fitzpatrick and Josh Rosen."
  ]
}