{
  "id": 5677,
  "mediaId": 2732,
  "date": "2022-02-05",
  "headline": "Mark Madden's Hot Take: Instead of trading for Minkah Fitzpatrick, Steelers should have tanked in '19",
  "image": "",
  "link": "https://triblive.com/sports/mark-maddens-hot-take-instead-of-trading-for-minkah-fitzpatrick-steelers-should-have-tanked-in-19/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Madden",
  "authorUrl": "https://triblive.com/author/mark-madden/",
  "termIds": [
    1990,
    3013,
    3069,
    3773,
    4688,
    612,
    823,
    930
  ],
  "sentences": [
    "Fantasies abound about trading for a big name, or signing a lesser name, or drafting Pitt’s Kenny Pickett or Liberty’s Malik Willis.",
    "But, given that rationale, in 2018 the Steelers drafted Mason Rudolph three rounds earlier than the Patriots picked Brady in 2000.",
    "Tanking is in the news after accusations made by ex-Miami coach Brian Flores and ex-Cleveland coach Hue Jackson.",
    "The Steelers gave Miami their first-round pick for 2020 to acquire Fitzpatrick after Week 2 of the 2019 season.",
    "Quarterback Ben Roethlisberger got elbow surgery after the Steelers’ Week 2 home loss to Seattle.",
    "Rely on Rudolph’s inexperience and instability, which the Steelers appear prepared to do in 2022.",
    "Before you know it, you’re 4-12 and drafting Justin Herbert with the pick you traded to Miami.",
    "The likeliest way to do that is finish with a real bad record, thus getting a high draft pick.",
    "Going 9-7-1 this season to get blown out by Kansas City in the wild-card round meant nothing.",
    "The 2019 season was a perfect chance to use Roethlisberger’s injury as an excuse to go 4-12.",
    "Safety Minkah Fitzpatrick has played almost three full seasons with the Pittsburgh Steelers.",
    "Owner Art Rooney II recently said the Steelers’ goal every season is to win the Super Bowl.",
    "But the Steelers have won three playoff games in 11 seasons, none in the past five seasons.",
    "Fitzpatrick made immediate impact, intercepting a pass and forcing a fumble vs. the 49ers.",
    "The Steelers rallied to finish 8-8, not least because of Fitzpatrick’s contributions.",
    "Instead, you have a real good safety, which means little unless it’s Troy Polamalu.",
    "Instead, the Steelers got Fitzpatrick and went 8-8, narrowly missing the playoffs.",
    "He made first-team All-Pro in 2019 and 2020 and is a key component to the defense.",
    "Baltimore drafted Lamar Jackson with the last pick of the first round in 2018.",
    "The Steelers have a plan, too: finish middle, draft middle, stay middle.",
    "Heck, New England got Tom Brady in the sixth round of the 2000 draft.",
    "The Steelers fell to 0-3 after losing at San Francisco in Week 3.",
    "That real good safety wants a real big contract extension, BTW.",
    "He had one job to do: Finish last, then draft Mario Lemieux.",
    "The Steelers don’t have a nailed-on starting quarterback.",
    "Heck, starting 11-0 last season wound up meaning nothing.",
    "But none of those options are probable or legit.",
    "Both say their owners incentivized losing games.",
    "The Steelers need to get their Joe Burrow.",
    "Let excrement roll downhill, like it does.",
    "Johnston was the Penguins’ GM in 1983-84.",
    "Play youth under the guise of rebuilding.",
    "Five Stanley Cups are that plan’s legacy.",
    "(That often happens anyway, doesn’t it?)",
    "Not tanking equals integrity, I guess.",
    "The Steelers should have tanked 2019.",
    "Roethlisberger was out for the year.",
    "Trying hard is admirable, to some.",
    "Eddie Johnston should replace him.",
    "How’s that working out for them?",
    "Kevin Colbert is retiring as GM.",
    "Now Roethlisberger has retired.",
    "It was the perfect opportunity.",
    "Rudolph should be fine, right?",
    "Call a few ill-advised plays.",
    "The Steelers started 0-3.",
    "Sure, you can get lucky.",
    "It was a terrible trade.",
    "Johnston did his job.",
    "(Don’t forget Duck!)",
    "(Fitzpatrick isn’t.)",
    "That meant nothing.",
    "He had a plan."
  ]
}