{
  "id": 568,
  "mediaId": 6526,
  "date": "2022-04-10",
  "headline": "How Lehigh Valley-area lawmakers voted last week",
  "image": "https://www.mcall.com/resizer/yRdEkzykWCzp9hsR_Y7fervroOw=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/3SHEFV52R5AM7CHOBF2G6PABRM.jpg",
  "link": "https://www.mcall.com/news/local/mc-nws-how-they-voted-0410-20220410-w6wiqffb4bf27eo6ap3g2f5meq-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Debra Schnecker",
  "authorUrl": "https://www.mcall.com/debra-schnecker#nt=byline",
  "termIds": [
    0
  ],
  "sentences": [
    "The bill permits the redistribution of hazard mitigation funds unclaimed or unobligated for a major disaster upon the expiration of 84 months or the closeout of the grant, whichever is sooner; increases from 6% to 15% the estimated aggregate amount of grants made for national public infrastructure pre-disaster mitigation assistance; makes private nonprofit facilities eligible for technical and financial assistance in the implementation of cost-effective pre-disaster hazard mitigation measures; and expands the use of hazard mitigation assistance to cover certain activities pertaining to wildfires, tsunamis, and ice storms.",
    "Specifically, the report must describe in detail U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities.",
    "Voting 418 for and 6 against, the House on Tuesday passed a bill that requires the National Telecommunications and Information Administration and the Federal Communications Commission to update the Memorandum of Understanding (MOU) on Spectrum Coordination to improve the process for resolving frequency allocation disputes in shared or adjacent spectrum bands, ensure the efficient use of spectrum, and establish reasonable timelines for information exchanges between the administration and the commission.",
    "The bill authorizes the President to impose sanctions on any foreign person who is responsible for serious human rights abuse, is a current or former government official who is responsible for or complicit in corruption, is or has been a leader or official of an entity that has engaged in any of these activities, has provided support for any of these activities, or is owned or controlled by a person subject to these sanctions.",
    "The bill authorizes the President to impose sanctions on any foreign person who is responsible for serious human rights abuse, is a current or former government official who is responsible for or complicit in corruption, is or has been a leader or official of an entity that has engaged in any of these activities, has provided support for any of these activities, or is owned or controlled by a person subject to these sanctions.",
    "The bill authorizes the President to impose sanctions on any foreign person who is responsible for serious human rights abuse, is a current or former government official who is responsible for or complicit in corruption, is or has been a leader or official of an entity that has engaged in any of these activities, has provided support for any of these activities, or is owned or controlled by a person subject to these sanctions.",
    "The bill authorizes the President to impose sanctions on any foreign person who is responsible for serious human rights abuse, is a current or former government official who is responsible for or complicit in corruption, is or has been a leader or official of an entity that has engaged in any of these activities, has provided support for any of these activities, or is owned or controlled by a person subject to these sanctions.",
    "Additionally, the Federal Emergency Management Agency (FEMA) must set aside 10% of funds made available for any given year to further the implementation of the latest published editions of relevant consensus-based building codes, and carry out a pilot program through which states and localities award grants to individuals for retrofitting their residences with appropriate hazard mitigation measures.",
    "Additionally, the Department of Health and Human Services must continue to produce marijuana through the National Institute on Drug Abuse Drug Supply Program and implement a specialized process for supplying marijuana products available through state-authorized marijuana programs to researchers until manufacturers and distributors can provide a sufficient supply of marijuana for medical research.",
    "Voting 414 for and 11 against, the House on Tuesday passed a bill that increases to $1 million the threshold for eligibility for assistance for what qualifies as a small project under the Robert T. Stafford Disaster Relief and Emergency Assistance Act, thereby allowing more recovery projects to proceed under simplified procedures.",
    "The resolution also calls on the President to use the voice and vote of the United States to adopt a new Strategic Concept for NATO that is clear about its support for shared democratic values and committed to enhancing NATO’s capacity to strengthen democratic institutions within NATO member, partner, and aspirant countries.",
    "The bill generally prohibits the importation of Russian products that are classified under chapter 27 of the Harmonized Tariff Schedule (which includes mineral fuels, mineral oils and products of their distillation, bituminous substances, and mineral waxes), with an exception for prior contracts or agreements.",
    "The bill generally prohibits the importation of Russian products that are classified under chapter 27 of the Harmonized Tariff Schedule (which includes mineral fuels, mineral oils and products of their distillation, bituminous substances, and mineral waxes), with an exception for prior contracts or agreements.",
    "HR 7276: To direct the President to submit to Congress a report on United States Government efforts to collect, analyze, and preserve evidence and information related to war crimes and other atrocities committed during the full-scale Russian invasion of Ukraine since February 24, 2022, and for other purposes.",
    "Voting 348 for and 75 against, the House on Tuesday passed a bill that establishes the DHS Trade and Economic Security Council, which shall provide trade and economic security advice and recommendations to the Department of Homeland Security (DHS).",
    "The MOU formalizes the cooperative relationship between the two parties to ensure that spectrum policy decisions promote efficient use of spectrum consistent with both the economic interests and national security of the nation.",
    "Voting 310 for and 110 against, the House on Monday, This bill requires private health insurance plans to cover diagnosis and treatment of congenital anomalies and birth defects, such as reconstructive services and items.",
    "The bill directs the U.S. Trade Representative to take certain actions, including to consider steps to suspend Russia’s participation in the World Trade Organization and seek to halt the accession process of Belarus.",
    "The bill directs the U.S. Trade Representative to take certain actions, including to consider steps to suspend Russia’s participation in the World Trade Organization and seek to halt the accession process of Belarus.",
    "Coverage must include services and items that functionally improve, repair, or restore any body part that is medically necessary for normal bodily functions or appearance, as determined by the treating physician.",
    "Voting 409 for and 11 against, the House on Tuesday passed a bill directs the Federal Communications Commission (FCC) to include data on certain maternal health outcomes in its broadband health mapping tool.",
    "Specifically, it directs the Drug Enforcement Administration to register practitioners to conduct medical marijuana research, and manufacturers and distributors to supply marijuana for such research.",
    "It also permanently authorizes the President to impose visa- and property-blocking sanctions based on violations of human rights, and it revises the President’s authority to impose these sanctions.",
    "Additionally, the bill statutorily authorizes broader coverage of current visa- and property-blocking sanctions for human rights violations to cover persons involved in serious human rights abuses.",
    "Additionally, the bill statutorily authorizes broader coverage of current visa- and property-blocking sanctions for human rights violations to cover persons involved in serious human rights abuses.",
    "Additionally, the bill statutorily authorizes broader coverage of current visa- and property-blocking sanctions for human rights violations to cover persons involved in serious human rights abuses.",
    "Additionally, the bill statutorily authorizes broader coverage of current visa- and property-blocking sanctions for human rights violations to cover persons involved in serious human rights abuses.",
    "It also permanently authorizes the President to impose visa- and property-blocking sanctions based on violations of human rights, and it revises the President’s authority to impose these sanctions.",
    "It also permanently authorizes the President to impose visa- and property-blocking sanctions based on violations of human rights, and it revises the President’s authority to impose these sanctions.",
    "It also permanently authorizes the President to impose visa- and property-blocking sanctions based on violations of human rights, and it revises the President’s authority to impose these sanctions.",
    "Voting 418 for and 7 against, the House on Wednesday passed a bill that requires the President to report to Congress on atrocities committed during Russia’s invasion of Ukraine since Feb. 24.",
    "Coverage limits and cost-sharing requirements for such services and items may not be more restrictive than those applicable to all medical and surgical benefits under the plan.",
    "The bill directs the U.S. Trade Representative to take certain actions, including to consider steps to suspend Russia’s participation in the World Trade Organization.",
    "Voting 383 for and 41 against, the House on Tuesday passed a bill that addresses the issue of U.S. disaster resilience and expands coverage for hazard mitigation.",
    "Voting 343 for and 75 against, the House on Monday passed a bill that establishes a new, separate registration process to facilitate medical marijuana research.",
    "The bill also establishes the position of Assistant Secretary for Trade and Economic Security within DHS’s Office of Strategy, Policy, and Plans.",
    "This is an online platform that allows users to visualize, overlay, and analyze broadband and health data at national, state, and county levels.",
    "Voting 100 for and 0 against, the Senate on Thursday passed a bill that prohibits the importation of energy products from Russia.",
    "Voting 100 for and 0 against, the Senate on Thursday passed a bill that suspends normal trade relations with Russia and Belarus.",
    "Voting 413 for and 9 against, the house on Thursday passed a bill that prohibits the importation of energy products from Russia.",
    "Voting 420 for and 3 against, the House on Thursday passed a bill that suspends normal trade relations with Russia and Belarus.",
    "This includes identifying concentrated risks and setting priorities for protecting the nation’s trade and economic security.",
    "(Current law imposes these sanctions on persons responsible for gross violations of human rights, a higher standard.)",
    "(Current law imposes these sanctions on persons responsible for gross violations of human rights, a higher standard.)",
    "(Current law imposes these sanctions on persons responsible for gross violations of human rights, a higher standard.)",
    "(Current law imposes these sanctions on persons responsible for gross violations of human rights, a higher standard.)",
    "The media could not be loaded, either because the server or network failed or because the format is not supported.",
    "The threshold must be reviewed every three years."
  ]
}