{
  "id": 5693,
  "mediaId": 2605,
  "date": "2022-02-08",
  "headline": "L.A. temporarily halts impounding of vehicles with 5 or more unpaid tickets",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/49f31bf/2147483647/strip/true/crop/2000x1050+0+144/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fzbk%2Fdamlat_images%2FLA%2FLA_PHOTO_ARCHIVE%2FSDOCS%2813%29%2Fi6o6qzkf.JPG",
  "link": "https://www.latimes.com/california/story/2022-02-08/los-angeles-stops-impounding-cars-for-unpaid-tickets",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Uranga",
  "authorUrl": "https://www.latimes.com/people/rachel-uranga",
  "termIds": [
    2134,
    2179,
    2393,
    567,
    5104
  ],
  "sentences": [
    "The approach has become a flashpoint for advocates, who label such enforcement “poverty tows.”\n“The people who were victimized are basically people at the bottom rungs of the socioeconomic ladder,” said Donald W. Cook, Fitzpatrick’s lawyer.",
    "“They live in high-density neighborhoods, parking is difficult, they don’t have a garage.”\nFitzpatrick’s car was impounded last summer when it was left legally parked on the street not far from where she lives, according to her lawsuit.",
    "The proposal failed to gain support, and the Los Angeles City Council came out against it, despite pleas from advocates who argued that the financial burden could push the most vulnerable toward homelessness.",
    "In his ruling last month, he questioned the city’s reading of state and federal laws to seize cars without a warrant and argued that towing Fitzgerald’s car did not act as a deterrent, as the city contended.",
    "She has four dozen parking tickets, many of those she got in her neighborhood, where she said parking became increasingly difficult during the pandemic as residents stayed home and streets became filled.",
    "Legal aid groups have long denounced the practice, saying that it can quickly sink the most vulnerable into debt and cut them off from a vehicle essential to their livelihood.",
    "“It is designed to try and extract payment from people who, by and large, are simply unable to pay,” said Nisha Kashyap, an attorney at the pro bono law firm Public Counsel.",
    "In a memo last week first reported by NBC4, Brian Hale, the head of city parking enforcement, ordered the temporary suspension of tow authority for unpaid citations.",
    "And it disproportionately affects those among us who have the least means and who often rely on their cars the most for meeting their very basic needs,” she said.",
    "Los Angeles has temporarily halted towing and placing boots on cars that have more than five unpaid tickets, a practice long decried by social justice advocates.",
    "“This impound was entirely permissible as it was in furtherance of the city’s enforcement of parking ordinances,” city lawyers said in court filings.",
    "Colin Sweeney, a spokesperson for the Los Angeles Department of Transportation, said the agency has paused the practice pending a final court ruling.",
    "They contended that the city was within its right to seize the car as part of its “community caretaking” and asked the court to dismiss the case.",
    "The Koreatown resident accused parking officials of wrongfully impounding her Toyota Yaris for about $9,000 worth of unpaid citations.",
    "In 2019, then-Assemblyman David Chiu (D-San Francisco) pushed a bill to repeal cities’ authority to tow vehicles for parking tickets.",
    "But Cook, her lawyer, pointed out that she was still on the hook for her unpaid tickets, along with the $8,000 she owes on her car.",
    "Lawyers for the city argued it was within their right to impound cars as part of their larger duty to ensure parking enforcement.",
    "The move came in response to a federal judge’s ruling against the city in a lawsuit brought by Breonnah Fitzpatrick last year.",
    "“Towing ostensibly deters repeated behavior only if [Fitzgerald’s] car was parked illegally, or overnight in a private lot.",
    "Fees can mount quickly for owners of impounded vehicles, starting with a tow fee of $145 and daily storage charges of $45.",
    "The city has a program for those that are homeless and other assistance programs, but Fitzpatrick did not qualify.",
    "She co-authored a report on the issue in 2019 and found the city had towed about 9,400 vehicles in one month.",
    "If a legally parked car is towed, it’s unclear what conduct is sought to be deterred,” Bernal wrote.",
    "Making the situation more complicated, she said, she had a bout of pneumonia and a hospital stay.",
    "But U.S. District Court Judge Jesus G. Bernal rejected the city’s pretrial request.",
    "The city released her car without her having to pay storage or towing fees.",
    "Vehicles posing a traffic or safety hazard can still be towed.",
    "And if the owner doesn’t pay or can’t pay, the car is sold.",
    "“It is just a form of debt collection."
  ]
}