{
  "id": 577,
  "mediaId": 2586,
  "date": "2022-04-14",
  "headline": "Bills QB Josh Allen and GF Get Viral Attention at Hollywood Outing",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Josh-Allen-Brittany-Williams-e1644614924285.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-josh-allen-girlfriend-hollywood/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1437,
    3583,
    3718,
    4691,
    160,
    671,
    5024,
    5104,
    5392
  ],
  "sentences": [
    "“That’s because patrons are required to turn over their phones upon arrival.”\nAllen has been a big golf fan, and shortly after the Bills season ended he turned down the chance to be an alternate in the Pro Bowl and instead accepted an invitation to compete in the AT&T Pebble Beach Pro-Am in his native California.",
    "The Buffalo Bills quarterback, who over the last two seasons has ascended to superstar status as he grew into one of the league’s top quarterbacks, has been attracting more attention for his off-the-field life, including a recent outing that he and girlfriend Brittany Williams had in Los Angeles.",
    "“The couple was spotted heading into Catch in West Hollywood just after sunset … and the quarterback didn’t seem to have too many cares in the world as he walked into the restaurant next to Brittany Williams,” the report noted, going on to describe their date night outfits in detail.",
    "“It gets like-minded guys that are going through situations that not many people in the world are going through and puts them in the same room.”\nJosh Allen back working with Jordan Palmer in the last few weeks leading up to #Bills training camp.",
    "https://t.co/X0AhDa2IpF\nThe report shows that Allen has reached sports celebrity status, which was not a familiar place during his relatively quiet first few years in Buffalo.",
    "The two were spotted on a night out at a West Hollywood restaurant, an outing that came just days after Allen was seen at another high-profile event on the opposite coast.",
    "As ESPN reported, Palmer’s offseason sessions include a number of quarterbacks — including Darnold — and some very candid conversations together about how to improve.",
    "His difficulty escaping the spotlight was also evident over the weekend, when Allen was spotted at the Masters with friend and former AFC East rival Sam Darnold.",
    "It’s like we don’t need to hold back.”\nAllen has spoken highly of Palmer’s approach, saying he enjoys working with some of his peers around the NFL.",
    "Allen’s Offseason Starting\nAllen, a native of central California, could have some business in Southern California beyond Hollywood outings.",
    "pic.twitter.com/4SSFQNcEYv\n— Bradley Gelber (@BradleyGelber) July 8, 2021\nAllen maintains some of the friendships during the offseason.",
    "“If you’re looking for photo evidence of Allen and Darnold walking the grounds at Augusta, you won’t find any,” Pantuosco wrote.",
    "“Honestly, we are super honest about what we talk about and how we say it to each other,” Allen told ESPN back in 2020.",
    "He regularly spends offseasons working with former NFL quarterback turned coaching guru Jordan Palmer in Orange County.",
    "Buffalo Bills superstar Josh Allen took his smokin' hot girlfriend on a dinner date to an L.A. hotspot on Wednesday.",
    "hotspot” this week, with the Bills quarterback ignoring some questions from reporters as they made their way inside.",
    "Buffalo Bills quarterback Josh Allen poses with girlfriend Brittany Williams at the 11th Annual NFL Honors.",
    "Allen’s Night out\nAs TMZ reported, Allen and Williams were photographed on a dinner date to an “L.A.",
    "Back in February, he and Williams took a tropical vacation along with some other NFL players.",
    "As Audacy’s Jesse Pantuosco noted, this time there were no photos of Allen’s outing.",
    "“We all feel like we have a good perspective of who everybody is in the room.",
    "Josh Allen may have a hard time keeping a low offseason profile from now on.",
    "“That is what’s special about what Jordan is doing,” Allen said.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!"
  ]
}