{
  "id": 5860,
  "mediaId": 2523,
  "date": "2022-02-08",
  "headline": "NFL Teams Ready to Vault into Super Bowl Contention in 2022",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/501/521/0a5b054013d3b59228a53fc21ff0a8cb_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2953202-nfl-teams-ready-to-vault-into-super-bowl-contention-in-2022",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Kay",
  "authorUrl": "https://bleacherreport.com/users/154dd674-8be2-4ed9-9ad2-319633d217eb",
  "termIds": [
    0
  ],
  "sentences": [
    "Even if the Broncos don't land a star like Aaron Rodgers or Russell Wilson via trade, they have the rest of the pieces in place to make a Super Bowl run with a lower-tier quarterback like Kirk Cousins or Jimmy Garoppolo.",
    "Even quarterback Lamar Jackson missed significant action for the first time in his career, playing only 810 snaps over 12 starts after appearing in 15 games and logging 900-plus snaps in each of the last two seasons.",
    "After unsuccessfully kicking the tires on veteran journeyman Ryan Fitzpatrick and getting backup-tier play from Taylor Heinicke in 2021, Washington still managed to claw its way to a 6-6 record after 12 games.",
    "As the Cincinnati Bengals and Los Angeles Rams gear up to clash in Super Bowl LVI, the rest of the NFL is already focused on Super Bowl LVII and planning how to bring the Lombardi Trophy home next year.",
    "Adding another skilled wideout alongside St. Brown would raise the ceiling on this offense, which also has young building blocks such as running back D'Andre Swift and offensive tackle Penei Sewell.",
    "The offense features a dangerous backfield platoon spearheaded by rookie Javonte Williams and veteran Melvin Gordon III, as well as quality wideouts in Jerry Jeudy, Courtland Sutton and Tim Patrick.",
    "Washington's biggest needs beyond quarterback are at safety and linebacker, which it should be able to cheaply and efficiently upgrade with a portion of its $30-plus million in projected cap space.",
    "Bridgewater went 7-7 as a starter in his lone season in Denver, completing 66.9 percent of his passes for a pedestrian 3,052 yards and 18 touchdowns against seven interceptions and 31 sacks.",
    "After a 4-11-1 season last year, they pulled themselves out of the league's basement by staying healthy and making a handful of key offseason moves to mount a surprise run to the Super Bowl.",
    "While the Lions will lack some upside until they replace Jared Goff with a franchise-caliber signal-caller, this team can become far more competitive with a few shrewd offseason pickups.",
    "A 1-4 finish submarined the club's chances of making a second consecutive postseason appearance, but the right signal-caller could guide the Commanders back to the playoffs next year.",
    "Denver's offensive line finished 19th in Pro Football Focus' grades this year, but the Broncos could spend some of their $40.4 million in projected cap space to address that unit.",
    "With defensive coordinator Wink Martindale gone, Mike Macdonald is now tasked with leading a defense that finished 19th in points allowed and 25th in yards allowed this season.",
    "Considering that the Ravens lost four games by two or fewer points—matching the most such losses in NFL history—better health alone could push them back into the playoffs.",
    "While acquiring a quality signal-caller is easier said than done, the Commanders have the draft capital to swing a blockbuster trade for a veteran or even move up from No.",
    "Chase Young and Montez Sweat already form one of the best young pass-rushing combinations in the league and should only get better with an injection of talent around them.",
    "Washington Commanders (7-10)\nLike the Broncos, the Washington Commanders boast a relatively well-built roster with plenty of intriguing players on both sides of the ball.",
    "Meanwhile, Denver finished third in scoring defense and eighth in total defense this season, fielding a lineup loaded with talent in the trenches and along the secondary.",
    "Baltimore Ravens (8-9)\nAfter a litany of injuries last year, it was a borderline miracle for the Baltimore Ravens to even finish within a game of making the playoffs.",
    "Denver Broncos (7-10)\nThe Denver Broncos just missed the playoffs for the sixth consecutive year, but they're tantalizingly close to becoming a Super Bowl contender.",
    "Rookie wideout Amon-Ra St. Brown came into his own late in the year, racking up 51 receptions on 67 targets for 560 yards and five scores over the final six games.",
    "While the 14-team playoff field next season will likely feature plenty of the same teams, some newcomers figure to force their way in after missing out this year.",
    "They lost more collective time from injured players than any team but the New York Giants in 2021, and they lead the league in cumulative quality of players lost.",
    "Between that and the fifth-most cap space leaguewide, they could become a force to be reckoned with in 2022 if they acquire a solid signal-caller this offseason.",
    "The safety position and depth corner spots arguably need the most work, but the Ravens have the means to acquire upgrades at those positions and elsewhere.",
    "Detroit should focus much of its attention this offseason shoring up a defense that ranked 31st in points allowed and 29th in yards allowed last season.",
    "The Broncos finished with the league's 10th-best pressure rate despite trading future Hall of Fame pass-rusher Von Miller to the Rams in November.",
    "Washington already boasts promising offensive talent such as running back Antonio Gibson, wide receiver Terry McLaurin and tight end Logan Thomas.",
    "With head coach Dan Campbell getting another offseason to train this young roster up, the Lions could be the Cinderella story of the 2022 season.",
    "Detroit will have ample opportunity to speed up its rebuild up during this offseason, boasting 10 selections in the 2022 draft—including the No.",
    "Pro Bowlers like Marcus Peters and Ronnie Stanley barely saw the field this year, and promising back J.K. Dobbins went down in the preseason.",
    "The Ravens also have nearly $10 million in projected cap room now, and they have several ways—such as extending Jackson—to free up even more.",
    "It would be a shock if Baltimore can't find a way to return to the postseason for the 10th time in John Harbaugh's 15th year at the helm.",
    "If the Ravens manage to stay healthy and do return to the playoffs next season, they'll likely be one of the toughest outs in the field.",
    "A few teams appear to be on the verge of changing their fortunes, needing a few final pieces to fall into place to contend for a title.",
    "With Bridgewater's contract now up and Lock looking like a bust, the Broncos seem committed to finding an elite replacement.",
    "Detroit Lions (3-13-1)\nThe upstart Detroit Lions were more competitive this past season than their 3-13-1 record suggested.",
    "It was readily apparent this year that neither Teddy Bridgewater or Drew Lock is the right signal-caller for the job.",
    "He would immediately bolster a lineup that recorded only 30 sacks this past season, the third-fewest in the NFL.",
    "These four squads in particular appear ready to vault into contention after failing to go even .500 in 2021.",
    "Bleacher Report's Scouting Department recently mocked Oregon's Kayvon Thibodeaux to the Motor City at No.",
    "2 overall pick and a late first-rounder from the Rams—and nearly $24 million in projected cap space.",
    "That would translate to 144 catches for 1,587 yards and 14 touchdowns over a 17-game campaign.",
    "Baltimore has four picks in the first three rounds of the upcoming draft, headlined by the No.",
    "However, the Commanders averaged only 323.6 yards and 19.7 points per game this past season.",
    "Thanks to that deal, the Broncos now have nine picks in this draft, including four on Day 2.",
    "But they could improve their Super Bowl odds by upgrading a few problem areas as well.",
    "Either move could be the catalyst for Washington mounting a run to Super Bowl LVII.",
    "One of those moves should be snapping up a prized edge-rusher in the first round.",
    "They lost by a single score six times and by a field goal or less four times.",
    "Quarterback is likewise holding them back, which has been the case for years.",
    "That would leave plenty of room to absorb a veteran quarterback's salary.",
    "But adding more talent to the offense could make this team a real force.",
    "Washington should also improve defensively after dropping from the No.",
    "The most glaring missing piece in the Mile High is at quarterback.",
    "Other teams could make similarly shocking rises next year.",
    "This year's Bengals are the perfect example.",
    "11 if they choose to target a rookie.",
    "2 total defense in 2020 to No.",
    "22 this past season.",
    "14 overall pick.",
    "B/R Recommends",
    "2 overall."
  ]
}