{
  "id": 5874,
  "mediaId": 2584,
  "date": "2022-02-03",
  "headline": "If owners really paid coaches bonuses to lose, the NFL is in big trouble",
  "image": "https://i.guim.co.uk/img/media/c7f08a492d30988c1f4c3cf4a5dcea1e29e71779/0_73_1920_1152/master/1920.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=89f1b24bf4953671cda4bd997678e8d4",
  "link": "https://www.theguardian.com/sport/2022/feb/03/nfl-tanking-allegations-owner-payments-brian-flores-hue-jackson",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Jacobs",
  "authorUrl": "https://www.theguardian.com/profile/melissa-jacobs",
  "termIds": [
    1708,
    1990,
    2046,
    2609,
    225,
    612,
    671,
    5371
  ],
  "sentences": [
    "The Flores complaint, which lays out the disturbing history of racism in the NFL, includes extensive data supporting the notion that qualified Black candidates have long been passed over in droves for head coach, coordinator, and general manager openings.",
    "Former Browns head coach Hue Jackson piled on, claiming that team owner Jimmy Haslam incentivized losses and was quite satisfied with Jackson’s 1-36 record during 2016 and 2017, which led to them gaining the No 1 draft pick in 2017 and 2018.",
    "49ers long snapper Taybor Pepper, who spent the 2019 in Miami under Flores, shared his thoughts in a now deleted tweet:\n“I’ve been quiet about my experience in Miami and still probably won’t go into details until my football career is over.",
    "Paying a coach for poor performance may or may not be about race though the idea of a white owner thinking the Black coach would be acquiescent to his demands is quite plausible given the history of the NFL, and well, America.",
    "This, the theory goes, allows teams to say they are committed to diversity but also means they can replace the Black head coach with a white one once things go wrong and a high draft pick has been secured.",
    "The idea that a player would spend a season or even a play intentionally trying to lose so a wealthy owner can get richer by selling more season tickets and jerseys with a splashy draft pick is repulsive.",
    "Somehow the league continues to thrive in large part thanks to high-budget TV broadcasts, fantasy football, the league’s marketing machine and its global ambitions, but most of all because of its product.",
    "But allegations that hit the integrity of the game itself are a different matter\nThe Super Bowl, the NFL’s ultimate coronation and by far the most watched event in America, is a little over a week away.",
    "Yet you wouldn’t know it because Brian Flores’s explosive lawsuit against the league and its clubs alleging racial discrimination in its hiring practices continue to take the NFL zeitgeist by storm.",
    "But if what Flores and Jackson are alleging (and perhaps others will come forward) is true it’s a slap in the face to every person involved in the league from fan to player to concession worker.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "These allegations are not dissimilar to the 1919 Black Sox scandal, when the Chicago White Sox were accused of taking bribes from a gambling syndicate to throw the World Series.",
    "[Flores’s] allegations are false, malicious and defamatory.”\nRoss’s statement, late Wednesday night, came a full day and half after the allegations were made public.",
    "But after Flores’s media blitz where he emphatically repeated the claims for the world to hear the league reversed course and has now opened an investigation.",
    "Flores alleges that Dolphins owner Stephen Ross offered to pay him $100,000 per loss in 2019 in hopes of securing the No 1 draft pick in the 2020 draft.",
    "The Dolphins won five games that season despite unloading a litany of key players, including safety Minkah Fitzpatrick and left tackle Laremy Tunsil.",
    "Ross denied these claims in a statement that read, “I take great personal exception to these malicious attacks, and the truth must be known.",
    "And many have noted in the last few days that when Black head coaches are given jobs, it’s often on teams with little chance of competing.",
    "And sure, there reaches a point in every season where Jets fans, the first example that comes to mind, are ready to throw in the towel.",
    "If any aspect of tanking under the behest of an owner is proven to be true, the NFL will be rocked in a way it has never experienced.",
    "The notion of not investigating an owner who is alleged to have attempted to undermine the very fabric of competition was appalling.",
    "But there’s a difference between viewing your position in the NFL draft order as a silver lining and intentionally plotting to lose.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "The NFL was hastier with its reaction, claiming Flores’s 58-page lawsuit was “without merit” just two hours after it was released.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "That scandal created turmoil for Major League Baseball and led to the first appointment of a commissioner to restore integrity.",
    "And even if the tanking allegations are not proven true or Flores settles the lawsuit, the seeds of mistrust have been planted.",
    "Tanking is the term we use but really this act of defying basic principles of competition deserves a far more potent moniker.",
    "The league could enact massive fines and strip picks from the Dolphins in addition to forcing Ross to sell the team.",
    "It’s impossible to predict the exact fallout the league could be facing if these claims are backed with evidence.",
    "WHERE IS/WAS THE INTEGRITY.”\nThere is no integrity if owners are out there incentivizing their coaches to lose.",
    "If that product is proven to be tainted, the NFL will finally be faced with a scandal it can’t slither out of.",
    "One, even though many of these players strive to become coaches and executives in the league upon retirement.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "The NFL is usually mired in some sort of controversy – Colin Kaepernick, concussions, domestic violence.",
    "Knowing that my EMPLOYER was actively trying to sabotage the season, again, makes me sick to my stomach.",
    "But if we find out that it has been rigged all along, how can we consume the league in the same way?",
    "It could also disincentivize teams from tanking by moving from a draft to a lottery like the NBA.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "The beauty of sport and especially the NFL with its salary cap is that nothing is predetermined.",
    "Suck for Luck and Tank for Trevor might make cute hashtags and inspire fun social media banter.",
    "But the other piece of Flores’s complaint may be even more difficult for the league to ignore.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "Flores claims his refusal to comply was the beginning of the end of his time in Miami.",
    "The Browns have denied the charge calling any such claims “completely fabricated”.",
    "The NFL’s ability to survive scandal after scandal is almost a sport of its own.",
    "Somehow, the league always weathers the storm, and keeps piling up the revenue.",
    "NFL players put their bodies through the wringer in ways we can’t even imagine.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "The league manages to slither out of every controversy that comes its way.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "The ramification is a career span that averages just 3.3 years.",
    "The NFL currently has just one Black head coach in Mike Tomlin.",
    "If true, the league as we know may be a thing of the past.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "If there were ever a time to join us, it is now.",
    "One, despite 70% of NFL players being Black.",
    "But the deeper issue is the game itself.",
    "… we have a small favour to ask.",
    "Every game is an audition.",
    "One Black head coach.",
    "Thirty-two teams.",
    "Thank you.",
    "Zero.",
    "?"
  ]
}