{
  "id": 5880,
  "mediaId": 2551,
  "date": "2022-02-06",
  "headline": "Teacher Olivia Fitzpatrick shares how she bought a $400K house by herself in Melbourne at 25",
  "image": "https://i.dailymail.co.uk/1s/2022/02/03/04/53714507-0-image-a-23_1643865380549.jpg",
  "link": "https://www.dailymail.co.uk/femail/article-10470965/Teacher-Olivia-Fitzpatrick-shares-bought-400K-house-Melbourne-25.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4843,
    5138,
    5139
  ],
  "sentences": [
    "TIPS FOR BUYERS WHEN INSPECTING PROPERTIES\nAlways check the heating and cooling systems the property has and whether this needs updating\nAsk the agent if they have a floor plan of the property\nAsk for a copy of the vendor's statement, which will include rates\nTake a quick glance at the ceiling and make sure there's no water marks\nCheck what appliances there are in the kitchen, such as dishwasher and gas stove\nIf possible, inspect the property when it's raining to see if there's any leaks\nAdvertisement\n+9\nView gallery\n+9\nView gallery\nOlivia's assets include her property valued at $530K, $75,000 worth of shares and super, $1,000 in cryptocurrency and $10,000 in cash, while her liabilities include her $350K mortgage and $10,00 HECS debt\nOn TikTok she also shares her investing tips and detailed her net worth breakdown of $250,000.",
    "+9\nView gallery\nOlivia, now 28, told FEMAIL she started saving for a home deposit in 2017 when she started working full time\n+9\nView gallery\nAfter purchasing the quaint home, she spent $20K renovating it to boost the value - which is now calculated over $530,000\nThe property is just 9km from the Melbourne CBD and close to trendy suburbs - an ideal location many strive to live in.",
    "Ditch Toothpaste And Try Tooth-Cleaning Tablets For Better Smiles And A Better Planet\nThe Good Company Toothpaste Tabs contain natural teeth cleaning and whitening ingredients in every tablet as an eco-friendly alternative to toothpaste so you can say goodbye to plastic tubes, and stop wasting toothpaste that you can’t squeeze out.",
    "This is how I managed to secure a great property for a great price,' Olivia said (pictured, kitchen area before and after)\n+9\nView gallery\nAlready the $20K home renovation has boosted the value of the property up to $530,000\nAlready the $20,000 home renovation has boosted the value of the property up to $530,000.",
    "Score 20% Off This Nutritious Dog Food That Reduces Your Pup’s Carbon Pawprint\nChippin is a fast growing pet startup that’s developed sustainable pet foods and dog treats from planet friendly superfood proteins, including crickets, overpopulated silver carp and spirulina.",
    "This $13 Rose-Scented Face And Body Oil Will Have Your Friends Asking If You’ve Been Botoxed\nThe Provence Beauty Rose Multi-use body oil has more than 9,000 five star reviews from shoppers impressed by how it nourishes hair, skin and nails.",
    "Try to save on your continuous expenses where you can, these are the things that will make the most difference (such as insurances or home interest rates)\nAdvertisement\nGuilt-free products that are good for you AND the planet\n1.",
    "These CBD-infused products promote healthy hair growth and calm an itchy scalp\nLondon-based haircare brand Wild Science Lab has created a CBD-infused Leaf + Seed Head range to help balance the scalp for healthy hair growth.",
    "It contains 120mg pure CBD, organic Hemp Seed oil, anti-inflammatory organic aloe vera and five essential oils that soothe scalp tension and irritation while creating an environment for healthy hair growth.",
    "This Beloved Brazilian Plant-Based Skincare Is Powered By Nutrient-Rich Quinoa Oil\nWhat’s been the secret weapon in millions of Brazilian women’s beauty and hair care regime that is now launching in the US?",
    "Founder Haley Russell (Forbes 30 under 30) aims to minimize the carbon pawprint and reduce global meat consumption, by sourcing proteins that are readily available and naturally in abundance.",
    "The rising cost of Australian house prices is making it more difficult for first home buyers to crack into the market, but one young teacher has managed to do so with a $40,000 deposit.",
    "Scroll down for video\n+9\nView gallery\nOlivia Fitzpatrick (pictured) purchased her two-bedroom property in Melbourne by herself at the age of 25 for $400,000 in 2019.",
    "30x more potent than coconut oil, quinoa oil firms, tones and moisturizes the skin like no other and right now, you can get 20% off with the discount code NATIVA20.",
    "'I managed to save by putting away as much of my income as possible, which was difficult as I was living in a share house paying $230 per week in rent,' she said.",
    "After she had the funds for the deposit, the process of looking for the perfect home itself took two to three years with assistance from real estate agents.",
    "Her liabilities include her $350K mortgage and $10,00 HECS debt, leaving her with a net worth of $250,000 - after the debt is subtracted from the assets.",
    "Olivia said she started researching well before she began attending auctions and open houses to get a feel for what she wanted and could afford.",
    "Nativa SPA, a vegan and plant-based brand which harnesses the power of the ancient grain, quinoa, due to the nourishing properties of its oil.",
    "'When I purchased the property, it was a complete dump - this is how I managed to secure a great property for a great price,' Olivia said.",
    "'I made saving for a house deposit my only financial goal at the time, so I was focused and all of my spare money went there,' she said.",
    "Each week Olivia hosts The Motivated Millennial Podcast where she talks about finance, money, budgeting, building wealth and investing.",
    "Its luxurious scent of rose, peony and bergamot lingers on the skin once the Vitamin E rich, apricot and coconut oil blend is absorbed.",
    "Olivia's assets include her property valued at $530K, $75,000 worth of shares and super, $1,000 in cryptocurrency and $10,000 in cash.",
    "Prior to investing, it's important to do your research and consider your personal values to make smart investment decisions.",
    "Olivia purchased the home with hope for it to one day become an investment property, but she's living in it for now.",
    "Olivia Fitzpatrick purchased a two-bedroom property in Melbourne by herself at the age of 25 for $400,000 in 2019.",
    "She gained the net worth after working for six years as a teacher, saving her money and tracking her expenses.",
    "Olivia, now 28, told FEMAIL she started saving for a deposit in 2017 when she began working full time.",
    "Since then, she has renovated sections of the quaint inner-west unit to boost the value of the home.",
    "'I have renovated most things in the property from the floors in every room to a brand-new kitchen.'",
    "'I love my property and would love to do another property renovation in the future with my partner.",
    "Simply pop one tab in your mouth, chew it up completely, and begin brushing with a wet toothbrush.",
    "She added there's still 'more work to be done', including a full bathroom and garden renovation.",
    "She honed in on frugal spending habits and carefully tracked where she was spending her money.",
    "+9\nView gallery\n+9\nView gallery\n'When I purchased the property, it was a complete dump.",
    "With 100% natural and vegan ingredients, a four ounce bottle is yours for just $13.95.",
    "You can score 20 per cent off by using the code GET20 at checkout.",
    "For now, I am focused on investing in the stock market,' she said.",
    "Automate anything you can when it comes to saving or investing\n3.",
    "You can get 20% off Chippin with the discount code CHIP20.",
    "Be realistic and allow yourself some money to splurge.",
    "Shop\nProducts featured are independently selected.",
    "We may earn a fee from links on this page.",
    "Have a budget in place and stick to it.",
    "Olivia's three money-saving tips:\n1.",
    "Shop\nRead more\n2.",
    "Shop\n4.",
    "Shop\n5.",
    "Shop\n3.",
    "2."
  ]
}