{
  "id": 5889,
  "mediaId": 2586,
  "date": "2022-02-09",
  "headline": "Bills WR Stefon Diggs Shares Very Revealing Memory of Younger Brother",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Stefon-Diggs-Pro-Bowl-e1644418187603.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-diggs-revealing-memory-brother/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "Pro Bowl a Special Moment for Diggs Brothers\nAfter both Diggs brothers had disappointing endings to their seasons — the Cowboys being upset at home in the Wild Card round and the Bills losing to the Chiefs in heartbreaking fashion in the divisional round — the Pro Bowl was a moment that both savored.",
    "Both of the Diggs brothers were picked to represent their teams in the Pro Bowl, with Stefon earning his second straight nod as a member of the Bills and Trevon securing a spot in just his second year in the league as a member of the Dallas Cowboys.",
    "He caught a pass, completed a pass, dropped back again as a quarterback on a play where he ended up scrambling for a touchdown, and even got the chance to line up against his brother as a cornerback and defend a pass.",
    "@TrevonDiggs | @stefondiggs\n— NFL (@NFL) February 6, 2022\nThere is a bit of an age difference between the Diggs brothers, though Stefon was still pitching in to change diapers at a fairly young age.",
    "I saw his picture and I saw his face, I saw him in the Cowboys [jersey], I’m like, yeah, that’s my little brother.”\nTrevon said the chance to play with his brother was a highlight for him as well.",
    "Their mother told ESPN that Stefon Diggs was thrilled to learn that his brother was selected to the NFC’s roster, and that 15 family members joined in a video call to celebrate.",
    "Stefon Diggs had the chance to play against younger brother Trevon at this year’s Pro Bowl, and it brought back a very revealing memory for the Buffalo Bills wide receiver.",
    "After the game, Stefon Diggs took to Twitter to share with fans the revealing memory that came flooding back as he saw his brother on the opposite side of the field.",
    "“I break the huddle and look across from me I see one of the best players in the world and guess who changed his diapers,” the Bills wide receiver tweeted.",
    "The two seemed to relish the chance to play against each other, and Stefon took to Twitter after the game to recall their much younger days together.",
    "'”\nStefon Diggs added that he was filled with pride to see the accomplishment from his younger brother, a 2020 second-round pick of the Cowboys.",
    "“[Both of us making the Pro Bowl is] probably one of my favorite moments of this year, for real, because that’s my brother,” Trevon said.",
    "“I was more happy for when I heard about him [making the Pro Bowl], because I knew he was going, but I still wanted to see it.",
    "Stefon Shares Candid Memory\nStefon Diggs got the chance to do a little bit of everything during Sunday’s game.",
    "— PFF (@PFF) February 6, 2022\n“I was just more proud than anything,” Stefon said.",
    "“I love him to death and just being able to go up there with him, that’s fire.”",
    "“I’ve never seen Stefon that excited,” Stephanie Diggs said.",
    "The elder Diggs is five years older than his brother.",
    "“[He was like], ‘Mom, Mom, Can you believe it?",
    "Stefon Diggs reacts to a play at the Pro Bowl.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "Sibling rivalries never die."
  ]
}