{
  "id": 5903,
  "mediaId": 2732,
  "date": "2022-02-07",
  "headline": "Madden Monday: Opinion on Steelers QB situation unchanged after Senior Bowl hype over Kenny Pickett, Malik Willis",
  "image": "",
  "link": "https://triblive.com/sports/madden-monday-opinion-on-steelers-qb-situation-unchanged-after-senior-bowl-hype-over-kenny-pickett-malik-willis/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Benz",
  "authorUrl": "https://triblive.com/author/tim-benz/",
  "termIds": [
    0
  ],
  "sentences": [
    "• First Call: Odd-couple highlights for T.J. Watt, Jake Guentzel; Steelers listed atop 'best fits' for Jimmy Garoppolo\n• Tim Benz: Tom Brady's retirement offers more than just memories of bitter defeat for Steelers fans\nTo that point, the Steelers have failed to win a playoff game in nine of the past 11 seasons.",
    "The only way to get that (franchise) quarterback is to tank a season.”\nDuring the Senior Bowl on Saturday, Kenny Pickett was 6 of 6 for 89 yards with no interceptions and a touchdown pass to Baylor’s Abram Smith.",
    ": @seniorbowl on NFL Network pic.twitter.com/I8tcGMFfX7\n— NFL Network (@nflnetwork) February 5, 2022\nWillis was only 2 of 4 for 11 yards, but he ran four times for 54 yards, including this 27-yard scamper.",
    "Also in the podcast, Madden and I talk about poor Olympic television ratings, the Penguins’ status at the All-Star break, NHL trade conversation, twists in the Brian Flores situation and more.",
    "But you need linemen, too.”\nOn that front, many people are hoping Mike Munchak returns to coach the Steelers offensive line now that the Denver Broncos coaching staff has been turned over.",
    "It’s his stance that the Steelers had that opportunity to finish near the bottom of the league in 2019 when Ben Roethlisberger was lost for the season with an elbow injury during Week 2.",
    "He thinks the conversation about the organization potentially acquiring a big-name veteran quarterback or landing a top-flight first-round rookie in the draft is pure fantasy.",
    "Also, the only time they picked higher than the 15th slot in this stretch (Ryan Shazier, 2014) is when they traded up to the 10th spot to acquire linebacker Devin Bush.",
    "And despite a week’s worth of hype over how much attention the Steelers were paying to the quarterbacks at the Senior Bowl, Madden isn’t adjusting his opinion.",
    "On his 105.9 The X radio show, TribLIVE columnist Mark Madden has made his stance on the Pittsburgh Steelers quarterback debate very clear.",
    "Madden doesn’t believe that the Steelers should bank on the prospect of stumbling into a surprise franchise quarterback late in the draft.",
    "“The Steelers are just scratching out .500 seasons and scratching out the occasional playoff berth, but not winning playoff games.",
    "“All I ever hear is ‘Brady got picked in the sixth round.’ Well, so did a guy named Spence Fischer for the Steelers (1996, Duke).",
    "In part, because Fitzpatrick was an instant big-play success, the Steelers managed to win eight games.",
    "But they still lost eight as well and finished middle of the pack in the NFL’s draft order.",
    "“People are acting like Malik Willis or Kenny Pickett will be the answer,” Madden said.",
    "Madden advanced that argument over the weekend in his TribLIVE “Hot Take” post.",
    "And they have missed the playoffs entirely four times in that span as well.",
    "The only way to get that guy is to finish bottom five,” Madden insisted.",
    "But Madden insists the Steelers’ problems upfront run deeper than that.",
    "But they traded a first-round pick to get Minkah Fitzpatrick instead.",
    "It’s stupid,” Madden said on this week’s “Madden Monday” podcast.",
    "“People are just ignoring that they are so bad,” Madden said.",
    "They aren’t going to get a big-name guy like Aaron Rodgers.",
    "“Kenny Pickett isn’t going to drop to them (at pick No.",
    "Malik Willis is just Kordell Stewart junior.",
    "Or even a mid-name guy like Jimmy Garoppolo.",
    "“I just hate the quarterback discussion.",
    "Jim Miller, too (1994, Michigan State).",
    "And it’s putting them in a deep hole.",
    "Maybe a guy like Mitch Trubisky.",
    "I’m not going to indulge it.",
    "20) in the draft.",
    "????"
  ]
}