{
  "id": 5940,
  "mediaId": 2713,
  "date": "2022-02-10",
  "headline": "Plumbing magnate lists $20 million home, and the bathrooms are flush",
  "image": "https://static.ffx.io/images/$zoom_0.1513%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/8a571ec6f6c2c2b1de659db3efa554a8def106b1",
  "link": "https://www.smh.com.au/property/news/plumbing-magnate-lists-20-million-home-and-the-bathrooms-are-flush-20220210-p59vgg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Redman",
  "authorUrl": "https://www.smh.com.au/by/elizabeth-redman-p535ya",
  "termIds": [
    0
  ],
  "sentences": [
    "Curved walls, floor-to-ceiling windows and a kitchen with butler’s pantry.Credit:Kay & Burton\nIt features three bedrooms with en suites and a powder room, a home office, elevator, pool, gym, outdoor barbecue/entertaining area, wine cellar, six-car garage, and a kitchen with Gaggenau appliances and a butler’s pantry.",
    "Credit:Kay & Burton\nThe contemporary residence, at 16 Fairlie Court, is set in a sought-after precinct near the Botanic Gardens, and well-heeled neighbours in the area include Just Jeans founder Craig Kimberley and former AFL chairman Mike Fitzpatrick.",
    "“It’s in the greatest position South Yarra can offer.”\nExpressions of Interest\n16 Fairlie Court, South Yarra VIC 3141\n3 Beds3 Baths6 Parking\nView property\nAnd as for the bathrooms ... well, what would you expect from a plumbing magnate?",
    "A living room you can lock up and leave.Credit:Kay & Burton\n“It is not a big family home, it is potentially [for] someone who is coming out of the area, scaling down, wanting to be close to the Botanic precinct,” he said.",
    "The latest Australian Financial Review Rich List values Alan Wilson and family at $7.86 billion, for a rank of 11 on the list, above media boss Kerry Stokes and casino mogul James Packer.",
    "The 15-year-old home boasts architecture and interiors by Saaj Design, with curved walls, a curved stainless steel front door, and floor-to-ceiling windows.",
    "The best property news and advice delivered straight to your inbox\nSign up\nBy signing up, you agree to Domain's Privacy Policy and Conditions of Use.Sign up",
    "Mr Delany said the home would suit someone selling a larger house and downsizing, looking for a low-maintenance, lock-up-and-leave style property.",
    "Mr Wilson is a former director of plumbing and bathroom supplies company Reece, a family business now chaired by his brother Alan Wilson.",
    "Room to entertain outdoors.Credit:Kay & Burton\nAgents on the listing are Kay & Burton chairman Gerald Delany and partner Oliver Booth.",
    "Plumbing magnate Bruce Wilson has listed his South Yarra home for sale, with an asking price of $18.5 million to $20 million.",
    "By Elizabeth Redman\n February 11, 2022 — 10.28am\n Save\nLog in, register or subscribe to save articles for later.",
    "Share\nNormal text sizeLarger text sizeVery large text size\nTime to tap out of the hot property market?",
    "16 Fairlie Court, South Yarra, is for sale with a price guide of $18.5 million to $20 million.",
    "“It has been done with a great flair, architectural flair,” Mr Delany said.",
    "Credit:Kay & Burton\nExpressions of interest are due by March 15.",
    "Mosaic and marble feature heavily in the bathroom."
  ]
}