{
  "id": 6015,
  "mediaId": 2732,
  "date": "2022-02-09",
  "headline": "Steelers officially promote Teryl Austin to defensive coordinator",
  "image": "",
  "link": "https://triblive.com/sports/steelers-officially-promote-teryl-austin-to-defensive-coordinator/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Rutter",
  "authorUrl": "https://triblive.com/author/joe-rutter/",
  "termIds": [
    1698,
    2914,
    3418,
    4485,
    4753,
    671,
    707,
    823,
    4842
  ],
  "sentences": [
    "He fosters a great environment for all of us to be ourselves, and we just come to work excited.”\nOne of Austin’s responsibilities with the Steelers was serving as Tomlin’s eye-in-the-sky coach on game days, working out of the coaches booth.",
    "“When you have a coach that can inform you about the run game and understand where the linebackers are going to be so that your job can be easier, just kind of that complete approach is important at the cornerback position.",
    "Austin didn’t make it through a full season with the Bengals; he was relieved of his duties in November after the Bengals became the first team to allow at least 500 yards in three consecutive games.",
    "During Butler’s tenure as defensive coordinator, head coach Mike Tomlin made the calls, a practice Butler said began in the final few years of Dick LeBeau’s second stint as defensive coordinator.",
    "He coached defensive backs in three Super Bowls — he was on the losing side to the Steelers in Super Bowl XL with Seattle in 2005 and in Super Bowl XLIII with Arizona in 2008.",
    "— Pittsburgh Steelers (@steelers) February 9, 2022\nAustin, 56, was promoted after spending the past three seasons as the team’s senior defensive assistant/secondary coach.",
    "There’s not too much he hasn’t seen in the circuit around the league.”\nIn Austin’s first season with the Steelers, they finished second in the NFL with 20 interceptions.",
    "The Steelers also are known to have interviewed former New York Giants defensive coordinator Patrick Graham and New Orleans Saints defensive backs coach Kris Richard.",
    "Cornerback Ahkello Witherspoon joined the Steelers in a September trade and didn’t become a regular contributor until the second half of the season.",
    "He became the top internal candidate for the defensive coordinator position when Keith Butler retired in January after seven seasons in that role.",
    "Austin joined the Steelers in 2019 after being a defensive coordinator at his previous two stops — Cincinnati in 2018 and Detroit from 2014-17.",
    "Austin also had received permission to interview for the Giants defensive coordinator position after Graham left to join the Las Vegas Raiders.",
    "“He loves the game,” said free safety Minkah Fitzpatrick, who made All-Pro in his first two seasons under Austin’s tutelage.",
    "He’s played in the past, so he has a natural love for the game, and it’s definitely reflective in the way that he coaches.",
    "This past season, the Steelers’ takeaways (22) and interceptions (13) dropped to the middle of the NFL rankings.",
    "That success led to Austin getting his first chance to be in charge of a defense when he was hired by the Lions.",
    "Austin, a Sharon native and Pitt graduate, is the new defensive coordinator of the Pittsburgh Steelers.",
    "“He understands the game from all levels, and that’s good for a defensive back,” Witherspoon said.",
    "Austin’s promotion was reported over the weekend but was not finalized until Wednesday.",
    "In 2020, the Steelers ranked first with 18 interceptions and second with 27 takeaways.",
    "He earned a Super Bowl ring as secondary coach with the Baltimore Ravens in 2013.",
    "He assisted in determining whether Tomlin should throw the replay challenge flag.",
    "Austin was a three-year starter at safety before he graduated from Pitt in 1988.",
    "It remains to be seen whether Austin will make the defensive calls on game days.",
    "Austin interviewed for the Lions’ head coaching position after the 2017 season.",
    "With the Steelers, Austin went back to his roots by overseeing the secondary.",
    "You can contact Joe by email at jrutter@triblive.com or via Twitter .",
    "Teryl Austin will get his third chance to run a defense in the NFL.",
    "We have named Teryl Austin as our defensive coordinator.",
    "He spoke glowingly of how Austin coached the secondary.",
    "When he did not get the job, he went to Cincinnati.",
    "He’s a guy with a whole lot of experience as well.",
    "Joe Rutter is a Tribune-Review staff writer.",
    "“It’s been good to see him lead the room.",
    "Categories: Sports | Steelers/NFL",
    "“He’s passionate about the game."
  ]
}