{
  "id": 6018,
  "mediaId": 2586,
  "date": "2022-02-04",
  "headline": "Bills WR Stefon Diggs Goes Viral for Table-Crashing Catch at Pro Bowl",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Stefon-Diggs-e1643959938307.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-stefon-diggs-breaks-table/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1519,
    2331,
    2784,
    160,
    671,
    700,
    5222
  ],
  "sentences": [
    "pic.twitter.com/OfEwzuBk7b\n— Ryan Talbot (@RyanTalbotBills) February 4, 2022\nFor his next catch, Diggs climbed atop a pickup truck and stood over a white folding table, jumping down to make an airborne catch before crashing through the table and onto some padding below.",
    "He pulled up to the drive through of the West Seneca McDonalds and tipped every employee working $200 each pic.twitter.com/0hkxJOtDg7\n— Nate Mendelson (@NateMendelson) December 24, 2021\nDiggs made another direct donation a few weeks later.",
    "“I think I’m going to have to jump through a table to really start getting some of the experiences.”\nSharing Love for Bills Fans\nDiggs has frequently shared love for Bills fans during his two-season tenure in Buffalo.",
    "Competing in the Best Catch Skills Showdown, Diggs teamed up with New England Patriots quarterback Mac Jones and started out with a one-handed snag that didn’t earn him much love from the judges.",
    "The catch paid homage to a tailgating tradition for Bills fans, who often climb atop cars and leap onto folding tables, which sometimes are set afire to increase the degree of difficulty.",
    "Diggs Goes All Out for Fans\nDiggs was one of two Bills players named to the Pro Bowl as starters, and got an early start representing the team at Thursday’s Pro Bowl Skills Competition.",
    "At the time the Bills were playing in front of empty stadiums, as New York had not lifted its COVID restrictions, but Diggs said he wanted to see what Bills fans were all about.",
    "The wide receiver paid tribute to an Orchard Park fan tradition during the skills competition at the Pro Bowl, something he had promised to do not long after joining the team.",
    "Just before Christmas, he stopped at a Buffalo-area McDonald’s to get some food in the drive-thru and gave two $100 bills to each of the employees working that day.",
    "Speaking to ESPN’s Sam Borden for a cover story published in 2020, Diggs said that he was yearning to see the wild fan experience on game days in Buffalo.",
    "I just want to keep pushing this thing forward and keep a good thing going.”\nMerry Christmas to these Bills fans from Stefon Diggs.",
    "“Because of COVID and everything that happened last year, I didn’t get that full experience with Bills Mafia in the community.",
    "He regularly plays catch with fans in the stands before games, and in November sponsored a turkey giveaway for local families.",
    "Stefon Diggs knows that the most direct path into the hearts of Buffalo Bills fans runs directly through a broken table.",
    "The act earned Diggs some viral attention after one of the workers shared pictures of the gift on social media.",
    "— NFL (@NFL) February 4, 2022\nDiggs had actually predicted that he would jump through a table for Bills fans.",
    "After the catch recorded the lowest score of the first round, Diggs upped the ante for his next entry.",
    "Diggs earned some viral attention for the catch, with many Bills fans sharing love on social media.",
    "“It’s my first time, and first opportunity to get to do it in Buffalo,” Diggs said.",
    "I didn't think it would be possible for #BillsMafia to love Stefon Diggs any more.",
    "Diggs said he was excited to get the chance to interact with fans and give back.",
    "So, I felt like it was important to do it this year by any means necessary.",
    "Stefon Diggs’ first catch in the Pro Bowl Best Catch Skills Showdown.",
    "Stefon Diggs on the field before a game against the Miami Dolphins.",
    "This received a 86.7, the lowest score of the first round.",
    "The latest Bills news straight to your inbox!",
    "… I’m blessed that I’m in a great situation.",
    "“I wanted the whole shebang,” Diggs said.",
    "Join the Heavy on Bills newsletter here!",
    "I was wrong."
  ]
}