{
  "id": 6034,
  "mediaId": 2551,
  "date": "2022-02-03",
  "headline": "Energy price cap announcement is brought forward - could it breach £2,000 a year meaning far bigger bills for millions of households?",
  "image": "https://i.dailymail.co.uk/1s/2022/02/02/12/53680109-0-image-a-12_1643803951565.jpg",
  "link": "https://www.dailymail.co.uk/money/bills/article-10467997/Energy-price-cap-breach-2-000-barrier-April.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Magnus For Thisismoney.co.uk",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Ed+Magnus+For+Thisismoney.co.uk",
  "termIds": [
    270,
    889,
    5097
  ],
  "sentences": [
    "The wholesale prices that suppliers typically face when buying gas or electricity to supply their customers - the cost of suppliers purchasing wholesale energy is the largest component of a customer's bill and can account for up to 40% of it\nHomeowners with variable mortgages also face the prospect of rising costs, with the Bank of England tipped to increase the base rate tomorrow.",
    "'Our prevailing forecast of the winter of 2022/23 indicates a further increase to more than £2,300 per year, but we note that there are a number of legislative and regulatory proposals in development which could affect both this figure and that for Summer 2022.'",
    "Dr Craig Lowrey, senior consultant at Cornwall Insight said: 'We are forecasting the summer 2022 default tariff cap will increase by around 50 per cent to approximately £1,915 for the typical user, placing more than £600 extra on the average yearly bill.",
    "But I would argue that's a red herring: there is a lot to be said for the odd universal benefit and a nation that hands out Winter Fuel payments to pensioners both rich and poor shouldn't worry too much about a temporary VAT cut for all.",
    "Other options, according to Cornwall Insight, include deferring recouping costs for failed suppliers, which would also save about £90, moving green levies to general taxation (£160), and deferring payment of energy network costs (£330).",
    "From a VAT cut, to paying suppliers SIMON LAMBERT looks at the options\nTHIS IS MONEY'S FIVE OF THE BEST CURRENT ACCOUNTS\nSantander's 123 Lite Account will pay £140 cashback to switchers and up to 3% cashback on household bills.",
    "Last October, the energy price cap rose 12 per cent, but with energy wholesale prices having surged since, the cap is expected to rise far more in April 2022, with some predicting that it will increase by roughly 50 per cent.",
    "There has been plenty of talk of a VAT cut, which seems like an imminently sensible move, but the tax is only 5 per cent on energy bills and Cornwall Insight reckons this would shave just £90 on average off dual fuel bills.",
    "Meanwhile, either direct financial support to customers, or loans to suppliers to mitigate energy price rises could both be worth about £500 off bills - and it looks likely that this is option the Government will take.",
    "It will ask questions about the challenges facing the energy market, how effective the energy price cap is at protecting consumers, and whether regulatory changes may be needed to address problems in the sector.",
    "Customers whose fixed tariff is coming to an end soon are currently being advised to let their deal roll onto a default deal as these are covered by the price cap and are much cheaper than current fixed offers.",
    "It’s part of its new inquiry into energy pricing and the future of the energy market, launched following surges in wholesale energy prices which have caused a huge number of energy suppliers to go bust.",
    "Two thirds of people said the cost of living has risen in the past two months, according to a recent ONS study, and of those people, four in five said rising gas and electricity prices were a factor.",
    "There have been some reports this morning that the Government is set to offer the energy industry a £6billion loan to offset customer bills by £200 on average, which could ease some of the pain.",
    "HOW THIS IS MONEY CAN HELP\n Best current accounts: Top bank accounts for switching with rewards\nMany experts predict that the price cap will increase by roughly £600 this April to around £1,900.",
    "Jonathan Brearley, chief executive of Ofgem; Stephen Fitzpatrick, founder of OVO Energy and Jonathan Marshall, senior economist at the Resolution Foundation think tank will be on the Committee.",
    "Those who have already seen fixed rates that have expired and shunted onto a variable rate could also face far bigger bills, along with those who were already on a default tariff.",
    "Anyone considering moving to a fixed deal should also be aware that wholesale prices could change within the next year and you could end up overpaying if stuck in a contract.",
    "Next Tuesday, the Business Energy and Industrial Strategy committee will be assessing the operation of the energy price cap and the impact it has on household energy bills.",
    "The next revision arrives in October and analysts at Cornwall Insight suggest on current data that the price cap could then climb to in excess of £2,300 for next winter.",
    "Households will discover how much their gas and electricity bills will potentially rise this year, with the new price cap being revealed days earlier than expected.",
    "Club Lloyds's Current Account pays 0.6% interest on balances of up to £3,999, while those with sums of between £4,000 and £5,000 will earn 1.5% on that balance.",
    "'There's been a lot of speculation, and it's in consumers' interests to announce the level of the price cap as soon as possible after it has been calculated.'",
    "Plus 2% interest on up to £1,500 - the highest interest rate on any current account - if you pay in at least £1,000 each month, plus a fee-free overdraft.",
    "Virgin Money's current account offers a £100 Virgin Experience Days gift card when you switch and pays 5.02 per cent monthly interest on up to £1,000.",
    "Households coming to the end of their fixed rate deals will be in for a nasty shock if the price cap rises by as much as many are predicting it will.",
    "The price cap limits the rates a supplier can charge for their default tariffs and at the moment, for the typical household it sits at £1,277 a year.",
    "There is a £2 monthly fee and you must log in to mobile or online banking regularly, deposit £500 per month and hold two direct debits to qualify.",
    "For example, analysts at Cornwall Insight, forecast that the average default tariff will rise to £1,915 a year – up £638.",
    "Ofgem said: 'Global gas prices continue to put pressure on, and people are understandably concerned about energy prices.",
    "To get the bonus, £1,000 must be paid into a linked easy-access account and 2 direct debits transferred over.",
    "+2\nView gallery\nMany Britons are already contending with the rising cost of fuel, food and household bills.",
    "It was expected to take place next Monday, but households will now find out the new cap at 11am tomorrow.",
    "Nationwide's FlexDirect account comes with up to £125 cash incentive for new and existing customers.",
    "Outside of London, rents are up 9.9 per cent on average over the past year, according to Rightmove.",
    "Read the full story: What can Britain do to ease the pain of energy bills rocketing 50% in April?",
    "The fastest growth on record and now outpacing house price gains in most areas of the country.",
    "Many households are already contending with the rising cost of fuel, food and household bills.",
    "It is also expecting the pain to continue, with the October 2022 forecast coming in at £2,300.",
    "These two are the big guns that could be wheeled out, but would cost the most money.",
    "Because there is no magic bullet here, writes This is Money editor Simon Lambert.",
    "Customers must pay in at least £1,000 within three months of opening the account.",
    "However, it is generally expected that prices will rise yet further this autumn.",
    "However, from tomorrow, the cap will soar meaning pricier bills from April.",
    "There is no cost if you pay £1,500 each month, otherwise a £3 fee applies.",
    "However, it could potentially overshoot this amount and go beyond £2,000.",
    "First Direct will give newcomers £150 when they switch their account.",
    "Critics of a VAT cut say this would also help wealthier households.",
    "Please check your inbox to confirm your email address.",
    "Energy crisis: What can be done to lower bills?",
    "It also offers a £250 interest-free overdraft.",
    "Renters will be feeling even more pressure.",
    "What if your fixed energy deal is ending?",
    "Read our full best bank accounts round-up",
    "Both the latter perks last for a year.",
    "The tricky question is what do we do?",
    "This is Money newsletter\nThank you.",
    "What does it mean for households?",
    "Must hold two direct debits.",
    "What next?"
  ]
}