{
  "id": 6037,
  "mediaId": 2796,
  "date": "2022-02-05",
  "headline": "Queen Elizabeth is hooked on political gossip",
  "image": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2022/02/05/GettyImages-1235983859-scaled.jpg",
  "link": "https://www.politico.eu/article/how-queen-elizabeth-gets-her-own-london-playbook-political-gossip/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "mediaOutlet": "politico.eu",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "So there was every encouragement just to be frank and transparent with what one was saying because it was just private between she and I.”\nAnother, the Conservative Andrew MacKay, who held the post in 1996, admitted his initial “rather stilted efforts” prompted a phone call from the queen’s private secretary who suggested the queen wanted the “gossip and the inside track.” He subsequently transformed his letters into a “who’s up, who’s down,” something he was later told had been “appreciated.”\n“It’s patently obvious to everybody but the most anti-royalist that she has been a hugely successful monarch over a very long period of time.",
    "Fitzpatrick, who hails from an Irish Catholic community of Glasgow, admits he “wasn’t brought up with any royalist tendencies at all, in fact if I anything I was quite a strong republican.”\n“Just seeing her majesty as I did at close quarters on quite a few occasions, both privately and publicly, as everybody has said who has ever been interviewed about her: the awareness, the sharpness, the stamina, the integrity, the enthusiasm, the energy that she puts into the task is absolutely singular.",
    "“If there had been a bit of a row in the house … it’s quite nice to give a bit of color to the events that have gone on.”\nThe Conservative MP Desmond Swayne, who held the post in 2013 and 2014, says he put any insider news in when he had it, although confesses to have “never been much good at gossip.” Overwhelmingly his notes hammed up what had happened in the chamber that day, he said.",
    "Post-holders also play a key role during the State Opening of Parliament, a ceremony which marks the start of a parliamentary session and includes nods to events throughout British history such as a search for explosives in the Palace of Westminster to commemorate the “gunpowder plot” of 1605 that propelled conspirator Guy Fawkes into eternal infamy.",
    "In a tradition that stems from the reign of Charles I, who had a disastrous relationship with parliament and was eventually beheaded in 1649, the vice chamberlain is taken hostage at Buckingham Palace while the queen attends parliament to read out what the government plans to do during the upcoming session.",
    "A little-known tradition of the U.K. system means a junior member of the government whips’ office — MPs responsible for the management of legislation through parliament — writes a private daily email to the queen with a colorful account of what’s being going on in parliament that day.",
    "As head of state, Queen Elizabeth II must rise above the political fray, playing a largely ceremonial role by formally appointing ministers despite having no say over who gets the jobs, and unquestioningly setting out her elected government’s legislative agenda.",
    "As Queen Elizabeth II celebrates 70 years on the throne on Sunday — her Platinum Jubilee — those who have held this post of “vice chamberlain of the Royal household” point to her genuine interest in the behind-the-scenes workings of the legislature.",
    "MacKay arrived at Buckingham Palace where the Lord Chamberlain, who is head of the royal household, saw the queen off in her carriage as she traveled the short distance across London’s St James’s Park to parliament.",
    "Former dispatch writers said they were instructed to write “the inside track” because the queen reads the newspapers and listens to BBC Radio 4’s flagship morning program, Today, or another daily news show.",
    "I think one of the keys is her attention to detail, her desire to be well-informed, and not interfere, because she understood the constitutional position completely,” MacKay added.",
    "By 2014, dispatches were sent to Buckingham Palace by email rather than being collected by a messenger, Anne Milton, one of the few female vice chamberlains to hold the post said.",
    "Queen’s biggest fans\nAs the Queen’s messenger in the House of Commons, all vice chamberlains have seen up close how the queen conducts her role as head of state.",
    "Former Labour MP Jim Fitzpatrick, who held the post between 2003 and 2005, recalls his instructions from the queen when he asked what he should write about.",
    "Those characteristics have been a “help” to successive prime ministers, who hold weekly private meetings with the queen at Buckingham Palace, Mackay said.",
    "The Lord Chamberlain then announced it was “time for champagne,” taking MacKay up to his study to watch the proceedings in parliament on television.",
    "Swayne also recalls being told by the Lord Chamberlain it was traditional to open a bottle of champagne, or sherry if his hostage preferred.",
    "'”\nSwayne says it was clear his bulletins were being read when the queen told him at his final meeting she had “so enjoyed” them.",
    "“I put quite a lot of effort into it and I used to really go for [the former Speaker of the House of Commons] John Bercow.",
    "And my republican tendencies have certainly been eclipsed.”\nBuckingham Palace declined to comment for this piece.",
    "“She referred to one or two things that had been in them, so she clearly had been reading them,” Swayne added.",
    "Correction: An earlier version of this article misstated the route from Westminster to Buckingham Palace.",
    "The taking of a hostage is meant to guarantee the queen’s safe return to Buckingham Palace afterwards.",
    "I am a great admirer of her majesty now and I’ve got a great respect for her and for the institution.",
    "“She said something like ‘that which doesn’t make the press would be of interest,'” he recalls.",
    "But that doesn’t mean the British monarch doesn’t want to know Westminster’s hottest gossip.",
    "“I used look for things that, in my very humble opinion, might amuse her,” Milton said.",
    "“One couldn’t but admire just how much she gives to the role as our head of state.",
    "“It’s personal correspondence so it would never be disclosed to anybody.",
    "LONDON — Britain’s ultimate Westminster insider is actually its queen.",
    "“I said let’s have both and so we had a very, very enjoyable watching.",
    "I very quickly developed Stockholm syndrome,” Swayne quipped.",
    "Champagne hostage\nVice chamberlains don’t just write letters.",
    "You know, ‘the Speaker’s lip curled with hatred."
  ]
}