{
  "id": 6042,
  "mediaId": 2586,
  "date": "2022-02-06",
  "headline": "Bills Could Target Broncos QB to Replace Mitch Trubisky: Insider",
  "image": "https://heavy.com/wp-content/uploads/2022/02/GettyImages-1339910971-e1644167574752.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-target-bridgewater-offseason/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1738,
    2249,
    2320,
    3583,
    4673,
    4710,
    160,
    308
  ],
  "sentences": [
    "“The Broncos have a core of youthful playmakers at the skill positions with a newly-minted offensive-minded head coach in Nathaniel Hackett.”\nQuarterback a High Priority for Bills\nAs Nick Fierro of SI.com’s Bills Central noted, the Bills could once again seek a top-tier backup for Allen, especially given Allen’s high volume of running plays and physically running style that puts him at risk of injury.",
    "#Broncos Predicted to Re-Sign QB Teddy Bridgewater to 2-Year, $39M Deal | via @KelbermanNFL\n— Mile High Huddle (@MileHighHuddle) February 4, 2022\n“The deal has an additional $2M bonus for 70% of offensive snaps in 2022 or 2023, $2.5M bonus for 80% of offensive snaps in 2022 or 2023 or $3M bonus for 85% of offensive snaps in 2022 or 2023 — so it could actually be worth as much as $45M,” Legwold wrote.",
    "And that’s his play style, that’s why we love him, but a backup quarterback is very important, knowing the way he plays the game.”\nFierro noted there are some other veteran options, including former Bills quarterbacks Ryan Fitzpatrick and Tyrod Taylor, but noted that Marcus Mariota could be an especially intriguing option given his rushing ability.",
    "Responding to a question about potential targets for the Bills this offseason, Syracuse.com’s Ryan Talbot wrote that while Trubisky will likely land elsewhere, he thought a Denver Broncos quarterback could be a target thanks to Buffalo’s new quarterback coach, Joe Brady.",
    "Here's how it's shaped him & shaped what the Bills will look for in next backup:\nhttps://t.co/EBb7pGyUkZ\n— katherine fitzgerald (@kfitz134) January 30, 2022\n“I’m up there screaming for him to get down plenty of times,” Beane said.",
    "Bills Looking for New Backup\nWith Trubisky headed to free agency and likely the chance to compete for a starting job again, the Bills will be looking for a replacement — and potentially a high-end one.",
    "The Bills showed last offseason that they are willing to make significant investments into an insurance policy for Allen, reportedly beating out several other teams looking to land Trubisky.",
    "He started 15 games for the Broncos this season, throwing for 3,052 yards and 18 touchdowns with seven interceptions, completing 66.9 percent of his passes.",
    "2 overall pick on the benefit of playing under the same coaching staff who helped Allen make a giant leap into one of the league’s top quarterbacks.",
    "Bills general manager Brandon Beane said after the season ended that he sometimes cringes when Allen takes extra contact on his runs.",
    "The Buffalo Bills will have some positions to address this coming offseason, including who will be backing up Josh Allen.",
    "But some believe that he could likely land back with the Broncos and a chance to compete for the starting job again.",
    "“I think Mitch will have opportunities to start elsewhere so I’m taking him out of the equation,” Talbot tweeted.",
    "“Bridgewater makes a lot of sense based on his past with Joe Brady.”\nBridgewater is seen as a reliable veteran.",
    "Despite the connections to the Bills coaching staff, Bridgewater could also come with a high price tag.",
    "ESPN’s Jeff Legwold predicted that he would command a two-year, $39 million contract from the Broncos.",
    "Bills signed Mitch Trubisky to a one-year contract last offseason, selling the former No.",
    "2 pick, almost all of his work the last year in Buffalo has happened behind the scenes.",
    "One insider believes that another veteran could now take Tubisky’s place behind Allen.",
    "“I don’t ever get on him for throwing interceptions, a fumble or whatever happens.",
    "I just don’t want Josh taking unnecessary hits.",
    "What's next for quarterback Mitchell Trubisky?",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "A few years removed from being the No."
  ]
}