{
  "id": 6049,
  "mediaId": 2526,
  "date": "2022-02-05",
  "headline": "Republican Lawsuit Accuses NY Democrats of Gerrymandering Maps, as 15 Assembly Republicans Legitimized Brazen Process",
  "image": "https://media.breitbart.com/media/2022/02/Redistricting-New-York-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/05/republican-lawsuit-accuses-ny-democrats-of-gerrymandering-maps-as-15-assembly-republicans-legitimized-brazen-process/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    0
  ],
  "sentences": [
    "“If the 15 Assembly Republicans had fought like their Senate colleagues, we would have had a better chance of defeating these maps in the courts.”\nThese are the 15 State Assembly members who voted with the Democrats to legitimize the gerrymandering process:\nGOP Leader William Barclay\nMichael Fitzpatrick NY8\nKarl Brabenec 98\nBrian Miller 101\nChris Tague 102\nKieran Michael Lalor 105\nJoseph Angelino 122\nJohn Lemondes 126\nPhilip Palmesano 132\nJosh Jensen 134\nStephen Hawley 139\nMichael Norris 144\nAngelo Morinello 145\nAndy Goodell 150\nJoseph M. Giglio 148\nAll 15 Assembly members are running for reelection in November.",
    "“First, the Legislature had no authority to enact the new map because the Legislature did not follow the exclusive process for enacting replacement maps that the People enshrined through the 2014 amendments, meaning that the congressional map is entirely void,” the lawsuit states, and elaborates further:\nSecond, if this Court holds that the Legislature somehow had the authority to adopt a replacement map notwithstanding these procedural failures, this Court should reject it as a matter of substance, as the map is an obviously unconstitutional partisan and incumbent-protection gerrymander.",
    "The attorneys who filed the case, Misha Tseytlin and George Winner, told Breitbart News the congressional maps are “unconstitutional partisan gerrymanders that attempt to rig New York elections for the next decade in defiance of the will of the voters and with blatant disregard for New York’s Constitution.” They explain:\nNew York voters adopted a Constitutional Amendment in 2014 to ban partisan gerrymandering and create a new process for creating legislative and congressional districts.",
    "If the lawsuit wins in court, not only would the congressional map need to be reconfigured fairly in the state legislature, but the local state Assembly map would also likely be thrown out as unconstitutional, impacting local and federal House districts.",
    "Last November the voters spoke again by rejecting Proposition 1 — a last ditch effort by Albany politicians to reverse New York’s redistricting reforms — and restating their support for banning partisan gerrymandering in the Empire State.",
    "“The only thing the Democrats are good at is cheating on elections, and the proof is out for everybody to see but hold on, you haven’t seen anything yet!”\nThe case is Tim Harkenrider et al.",
    "“What those 15 cowards did to save their own seats out of self-interest had national implications and will impact the GOP’s ability to remove Nancy Pelosi from her speakership,” Wax said.",
    "“We were expecting to do well in New York and now, we’ll lose 4 seats and the Old Broken-Down Crow, Mitch McConnell, sits back and does nothing to help the Party,” Trump said.",
    "If this Court takes this approach, it should invalidate the map and then send it back to the Legislature to create a new congressional map, which complies with the law.",
    "Gavin Wax, president of the Young Republican Club, told Breitbart News the treacherous deal was made behind closed doors, led by Minority Leader William Barclay.",
    "Donald Trump sounded off Saturday, accusing Republicans of allowing the New York GOP to lose four districts, half its delegation in the House of Representatives.",
    "Kathy Hochul (D) on Thursday immediately signed into law the brazen map that cuts the Republican delegation in half by using extreme gerrymandering tactics.",
    "“The maps could have been prevented from becoming law if the 15 Republicans in the Assembly had fought instead of betraying their constituents,” Wax said.",
    "A lawsuit was filed Thursday in New York state that alleges the state’s redistricting map is unconstitutional, Breitbart News has learned.",
    "The lawsuit was filed in the Supreme Court of Steuben County, New York, a Republican stronghold in the southwest part of the state.",
    "In the state Assembly, 15 Republicans voted for the Democrat-drawn gerrymandered Assembly map to protect their own Assembly seats.",
    "Despite the alleged unconstitutionality of the gerrymandered map, the court case may face an uphill battle.",
    "“The betrayal might have set the stage for further defeat in the courts,” Wax continued.",
    "These assemblymen likely legitimized the process the lawsuit alleges was illegal.",
    "The docket number is unassigned in the Supreme Court of Steuben County, New York.",
    "New York state gerrymandering has garnered national attention.",
    "New York Gov.",
    "Kathy Hochul.",
    "v. Gov."
  ]
}