{
  "id": 6072,
  "mediaId": 2551,
  "date": "2022-02-07",
  "headline": "Controversial AFL star Barry Hall breaks down in tears as he admits he's 'got an anger issue' after 'almost killing' another player with a vicious punch in the face",
  "image": "https://i.dailymail.co.uk/1s/2022/02/07/04/53863341-0-image-a-90_1644209715582.jpg",
  "link": "https://www.dailymail.co.uk/tvshowbiz/article-10483911/AFL-star-Barry-Hall-breaks-SAS-Australia-sneak-peek-admits-Ive-got-anger-issue.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "D. Lawrance For Daily Mail Australia",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=D.+Lawrance+For+Daily+Mail+Australia",
  "termIds": [
    2200,
    3084,
    3182,
    3217,
    4166,
    101,
    968,
    999,
    1227
  ],
  "sentences": [
    "+9\nView gallery\n+9\nView gallery\n'I think I've got it fully under control, but I haven't been put under those pressure situations,' the 44-year-old says\nLater in the clip, Hall who shares three children with his wife, former Hi-5 star Lauren Brant, chokes up while speaking about his family.",
    "+9\nView gallery\nEmotional: Barry Hall (pictured) breaks down in a sneak peek trailer for the upcoming season of SAS Australia as he admits, 'I've got a bit of an anger issue'\nHall's reputation for aggression on-field saw him miss numerous weeks of his AFL career through suspensions.",
    "+9\nView gallery\nEmotional: Later in the clip, Hall who shares three children with his wife, former Hi-5 star Lauren Brant, chokes up while speaking about his family\n+9\nView gallery\nFamily man: The high-profile couple share three boys",
    "+9\nView gallery\nTussle:In 2008, commercials starring Hall were pulled from the air after he viciously struck West Coast Eagles player Brent Staker in the chin with his closed fist while playing for the Sydney Swans.",
    "+9\nView gallery\nFighting words: Hall's reputation for aggression on-field saw him miss numerous weeks of his AFL career through suspensions\nHall has made headlines for more than just his on-field aggression.",
    "The footy star was commentating during the station's pre-game show with St Kilda legend Leigh Montagna, when he made an offensive comment regarding Montagna's wife Erinn, who is due to give birth next week.",
    "In 2008, commercials starring Hall were pulled from the air after he viciously struck West Coast Eagles player Brent Staker in the chin with his closed fist while playing for the Sydney Swans.",
    "'Tonight on Triple M Football there were unacceptable and inappropriate comments made by a member of the commentary team,' the station's head of content Mike Fitzpatrick said in a statement.",
    "+9\nView gallery\nAll-star: Hall seen here in action for the Sydney Swans in 2006\n'The commentator was removed immediately from the broadcast and an apology was issued on air afterwards.'",
    "During the show's Monday February 21 premiere, 17 Aussie celebrities will attempt to pass the SAS selection process with a gruelling series of physical and psychological tests.",
    "The star recruits include former Bachelor star Anna Heinrich, 34, actress Melissa Tkautz, 47, AFL commentator Wayne Carey, 50, and Olympic diver Melissa Wu, 29.",
    "Pictured with Travis Gaspar in 2005\nHall 'joked' that the male doctor behaved in a sexually inappropriate way, which sparked laughter from the other panelists.",
    "And Barry Hall breaks down in a sneak peek trailer for the upcoming season of SAS Australia as he admits, 'I've got a bit of an anger issue.'",
    "The panel was discussing the fact she had undergone a 'sweep', a technique used by medical professionals to try to induce labour.",
    "'I think I've got it fully under control, but I haven't been put under those pressure situations,' the 44-year-old says.",
    "Hall was sacked before the game between the Western Bulldogs and Geelong Cats at Melbourne's Etihad Stadium.",
    "Hall later admitted the punch could have killed Staker during an emotional interview on The Footy Show.",
    "In 2018, he was sacked by Triple M after making vulgar on-air comments about a former player's wife.",
    "Your biggest asset is your brain, I tried to use my brawn,' Hall admits in his SAS teaser.",
    "'Immediate action was taken with the termination of employment for one team member.'",
    "Hall was filling in for fellow AFL legend Chris Judd during the Triple M broadcast.",
    "He was notorious for his on-field aggression during his AFL career.",
    "'I didn't realise how selfish I was until I had a wife and kids.",
    "'I was so young and immature, I had a chip on my shoulder.",
    "'No one likes to see a grown man cry,' he says.",
    "I'm doing this course to make my boys proud.'"
  ]
}