{
  "id": 6096,
  "mediaId": 5247,
  "date": "2022-02-13",
  "headline": "US F-22 fighter jets arrive in UAE after Houthi attacks",
  "image": "https://www.militarytimes.com/resizer/KwjMaLKI1daeENggQG7DN8sn5pg=/1024x0/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/mco/Q5WFIJNNDJE77INSASVLT2MKAQ.jpg",
  "link": "https://www.militarytimes.com/flashpoints/2022/02/13/us-f-22-fighter-jets-arrive-in-uae-after-houthi-attacks/",
  "mediaOutlet": "Military Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Gambrell",
  "authorUrl": "/author/Jon Gambrell",
  "termIds": [
    2,
    19,
    474,
    532,
    1117,
    4808,
    4948,
    5369,
    5382,
    5411
  ],
  "sentences": [
    "“The Raptors’ presence will bolster already strong partner nation defenses and puts destabilizing forces on notice that the U.S. and our partners are committed to enabling peace and stability in the region,” Lt. Gen. Greg Guillot, the commander of the U.S. Air Force’s Mideast command, said in a statement.",
    "The spillover of Yemen’s yearslong war into the UAE puts American troops in the crosshairs of the Houthi attacks — and raises the risk of a regional escalation at a crucial moment of talks in Vienna to potentially restore Iran’s nuclear deal with world powers.",
    "DUBAI, United Arab Emirates — U.S. F-22 fighter jets arrived in the United Arab Emirates on Saturday, part of an American defense response to recent missile attacks by Yemen’s Houthi rebels targeting the country.",
    "American soldiers there launched Patriot interceptor missiles in response to the Houthi attacks last month, the first time U.S. troops have fired the system in combat since the 2003 U.S.-led invasion of Iraq.",
    "The deployment comes after the Iranian-backed Houthis launched three attacks targeting Abu Dhabi last month, including one targeting a fuel depot that killed three people and wounded six.",
    "A shadowy Iraqi group claimed launching a drone attack targeting the Emirates in early February, though authorities say they intercepted them.",
    "American officials declined to say how many F-22s deployed or the number of airmen supporting the aircraft, citing operational security.",
    "However, they identified the unit involved as the 1st Fighter Wing, located at Joint Base Langley-Eustis in Virginia.",
    "Though overshadowed by the Ukraine crisis, the missile fire targeting the Emirates has sparked a major U.S. response.",
    "A photo later released by the Air Force showed six F-22s in a line on a taxiway at Al-Dhafra.",
    "The attacks coincided with visits by presidents from South Korea and Israel to the country.",
    "The Raptors landed at Al-Dhafra Air Base in Abu Dhabi, which hosts some 2,000 U.S. troops.",
    "The American military has sent the USS Cole on a mission to Abu Dhabi."
  ]
}