{
  "id": 6100,
  "mediaId": 6526,
  "date": "2022-02-02",
  "headline": "Roundball roundup: A look back at Tuesday’s boys basketball games, including another overtime win by Allen",
  "image": "https://www.mcall.com/resizer/yUn8K8LtBV6BsKIY5g2ev-9v7Es=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/HPAQR4Z73VA2NKN3H6FMI4VT3U.jpg",
  "link": "https://www.mcall.com/sports/varsity/basketball/mc-spt-boys-basketball-tuesday-roundup-20220202-ti6c6ds7nrhndnz7ahfzxhvyba-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Keith Groller",
  "authorUrl": "https://www.mcall.com/mc-bio-keith-groller-staff.html#nt=byline",
  "termIds": [
    1652,
    202,
    350,
    828,
    4956,
    5205,
    5235,
    5293
  ],
  "sentences": [
    "While the Canaries, Green Hornets, and Konkrete Kids all have tough games (Allen hosts Central Catholic Friday and plays at Northampton Monday to close the regular season while Emmaus hosts Parkland Thursday and plays at CCHS Monday) the Cavaliers have East Stroudsburg North, Stroudsburg and Easton left.",
    "It was the final big Tuesday of the 2021-22 boys basketball regular season and there were a number of competitive games in the Eastern Pennsylvania Conference and Colonial League that helped to provide clarity for the league tournaments set to begin next week.",
    "Meanwhile, in the Colonial League, Southern Lehigh, Notre Dame, Wilson, Palmerton, and Salisbury are secure in gaining tourney spots, although the Warriors still have to play at Salisbury and must face Notre Dame twice.",
    "The Vikings play at Allen Friday night and after playing Holy Redeemer in the Lehigh Valley Hoop Group at Parkland on Sunday, they’ll close out the regular season at home against Emmaus on Monday.",
    "The Timberwolves, Mounties, and Red Rovers are a combined 15-38, so South still has a good chance of passing either Allen, Emmaus, or Northampton for the final tournament spot.",
    "The Canaries boosted their chances to make the EPC tournament, improving to 14-6, 9-5 EPC with Central Catholic and Northampton still to play.",
    "The Pocono Mountain West-Pocono Mountain East game, at East, has been moved up Thursday to avoid Friday’s potential weather issues.",
    "Pocono Mountain West improved to 14-4 overall, 13-1 in the EPC while South was hurt in its bid to secure an EPC tournament spot.",
    "The Blue Eagles won their fifth in a row and improved to 14-4, 9-4 with Freedom, Easton and Bethlehem Catholic still to play.",
    "The Spartans, who also routed Northern Lehigh 67-18 on Monday night, remain the only team not to lose a Colonial League game.",
    "The Vikings remain tied with Parkland for first place in the EPC’s Skyline Division, improving to 16-3 overall and 12-2 EPC.",
    "According to Pocono Mountain West’s Facebook page, junior JuJu Pagan went for a career-high 23 points on his birthday.",
    "The media could not be loaded, either because the server or network failed or because the format is not supported.",
    "For the second time in as many games, Allen went to overtime for a critical win — this time over Emmaus.",
    "The race appears to be between Bangor (9-6 league) and Northwestern Lehigh (10-7) for the last spot.",
    "The Patriots kept alive their District 11 tournament hopes, improving to 9-10 overall, 5-8 EPC.",
    "In the Skyline Division, Central Catholic and Parkland won and remain tied for the top spot.",
    "Ditto for Bethlehem Catholic and Nazareth who are in a tight race in the Steel Division.",
    "Pen Argyl has doubled its win total of last season while the Pirates fell to 3-15, 3-12.",
    "The Tigers have the tiebreaker edge thanks to a 52-50 win over the Slaters on Jan. 10.",
    "The Green Hornets fell to 15-5, 9-5 with Parkland and Central Catholic left to play.",
    "Christian Fermin had another big night with 23 points, 13 rebounds, and 5 blocks.",
    "The Golden Hawks won their fifth straight and clinched an EPC tournament berth.",
    "They can close out a perfect league schedule by beating Salisbury Friday night.",
    "Northwestern plays winless Catasauqua to close out the regular season Friday.",
    "The victory boosted the Canaries’ chances of making the EPC tournament.",
    "The Olympians won their fifth straight and improved to 12-6 overall.",
    "Allen, Emmaus, and Northampton are all tied with 9-5 EPC records.",
    "Pocono Mountain West clinched the EPC’s Mountain Division crown.",
    "The Green Knights improved to 4-11 in the league, 6-14 overall.",
    "The Panthers clinched the EPC Mountain Division championship.",
    "He hit seven of eight foul shots late to hold off the Cavs.",
    "The other team in the mix is East Stroudsburg South at 7-6.",
    "Freedom hosts Nazareth tonight and Freedom on Friday.",
    "They are 17-0 in the league, 0-4 in nonleague games.",
    "Bangor hosts Pen Argyl and has to play at Palmerton.",
    "The Cavs are now 12-6 overall, 7-6 in the league.",
    "Becahi (15-4, 11-3) hosts Dieruff on Friday.",
    "Both are headed to the tournament.",
    "The Panthers fell to 10-8.",
    "This is a modal window."
  ]
}