{
  "id": 6139,
  "mediaId": 2925,
  "date": "2022-02-07",
  "headline": "Joseph Sikora, 50 Cent talk ‘Power Book IV: Force,’ getting out of Ghost’s shadow",
  "image": "https://thegrio.com/wp-content/uploads/2022/02/070220221644261588-1-scaled-e1644261662393.jpg",
  "link": "https://thegrio.com/2022/02/07/joseph-sikora-50-cent-power-force-interview/",
  "mediaOutlet": "thegrio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nayo Campbell",
  "authorUrl": "https://thegrio.com/author/nayocampbell/",
  "termIds": [
    0
  ],
  "sentences": [
    "“He was the only guy that wanted to sell drugs in a show about drug dealers who made it to the top of the drug trade, and now, thinks he could do something different.”\nTommy Egan has become one of television’s characters you either love or hate, causing original Power fans to have to choose whether they are “Team Tommy ” or “Team Ghost.” During season 2 of Power, 50 Cent let Sikora know that this is his show.",
    "“For Force, I feel good about it because Tommy was one of the strongest characters in Ghost and particularly my favorite character,” 50 Cent shared regarding his excitement to explore Tommy’s character within the spinoff.",
    "With the show focused on Tommy’s life in Chicago, we will see a new side of the character as he navigates the culture, builds the drug business from the ground up, and also discovers new connections in Chicago.",
    "The actor also mentioned that despite being the series’ lead, he is thankful for his castmates who play such phenomenal roles and have attributed to Tommy’s growth while taking on this new city.",
    "He can't escape it,\" Sikora said of his alter ego, Tommy Egan, on the new 'Power' spinoff\n50 Cent and Courtney Kemp’s Power franchise has proven over and over again that it is here to stay.",
    "So when Tommy was without Kanan and when Tommy was without Ghost finally—even when they were rivals at some points—that was still his brother, ultimately,” said 50 Cent.",
    "If I wasn’t surrounded by such an incredibly talented group of actors, this would have been a really much more difficult and I’m sure less fun process,” he explained.",
    "I have been doing a lot of this on my own anyway.’ But now he’s forced to.”\nSikora opened up about leading the show and developing Tommy as a leader in his own right.",
    "I was so ready with this character and I was so familiar with this world that coming into this show was just pure excitement,” Ryan said.",
    "Previously, Tommy was the best friend and sometimes rival of Ghost (played by Omari Hardwick) — the star of Power.",
    "TheGrio caught up with the show’s executive producer, 50 Cent, as well as Sikora to talk about the new chapter.",
    "This chapter is switching it up with a whole new scenery and moving the franchise to the streets of Chicago.",
    "The show introduces newcomer Gabrielle Ryan, who will play an “integral role” as he adjusts to the city.",
    "Feb. 6 marked the launch of the fourth installment to the Power Universe with Power Book IV: Force.",
    "Power Book IV: Force airs at 9 p.m. on Starz, with episode 1 now available for streaming.",
    "Viewers are now following the life of fan-favorite Tommy Egan, played by Joseph Sikora.",
    "He was my favorite, I had such a huge crush on the Tommy character for many many years.",
    "So when Tommy finds himself alone, I think that he says, ‘Yeah, I have been doing this.",
    "“Tommy didn’t give himself enough credit, and I think a lot of us can relate to that.",
    "Now with Power Book IV: Force, the actor is officially number one on the call sheet.",
    "“That fight in between brothers is how we know what happens with the family anyway.",
    "He can’t escape it, and he doesn’t want to escape it right now,” Sikora said.",
    "TheGrio is now on your TV via Apple TV, Amazon Fire, Roku, and Android TV.",
    "“I have to give a lot of credit to the rest of the cast.",
    "Also, please download theGrio mobile apps today!",
    "EXCLUSIVE: “He really brings his past with him.",
    "“He really brings his past with him.",
    "“It was actually really exciting.",
    "I was such a huge Tommy fan.",
    "I was definitely team Tommy."
  ]
}