{
  "id": 6151,
  "mediaId": 5296,
  "date": "2022-02-09",
  "headline": "While COVID-19 Restrictions Loosen Elsewhere, Nursing Homes Remain Heavily Impacted",
  "image": "https://www.thepostemail.com/wp-content/uploads/2022/02/Nursing-Home-wheelchairs-Pix.png",
  "link": "https://www.thepostemail.com/2022/02/09/while-covid-19-restrictions-loosen-elsewhere-nursing-homes-remain-heavily-impacted/",
  "mediaOutlet": "thepostemail.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Well, we go beyond some of their regulations in this regard: In December, we decided, at our own expense, what we were going to start doing was testing all of our workers, every one, every shift, and we have gone through tens of thousands of these individual tests that we’re paying for just to make sure we stop COVID at the door.”\n“Do they work 12-hour shifts?” we asked, to which he responded, “I think most of ours are eight hours, but I know some places that have 12-hour shifts.”\n“We hope Mrs. Whiting is safe; we’re paying extra attention to her health now that she has tested ‘positive’ for COVID,” he expounded.",
    "She gets a heightened level of monitoring and observation because she has tested ‘positive’ for COVID.”\nRegarding the feelings of “isolation” Mrs. Whiting related to us which we communicated to Perkins, he responded, “It has nothing to do with the vaccine or being vaccinated at all.”\nTo our question on visitors, Perkins told us, “When somebody is in isolation like that, if a visitor is willing to agree to the protocols and put on full PPE, they can visit.”\n“Her daughter visited her today,” he added, signifying Mrs. Whiting.",
    "“How long will you be there?” we asked, to which she said, “Ten days.”\nWhen we asked how often residents are tested, she responded, “Every few days.”\nRegarding any “treatment” which might be employed in the event she experiences symptoms, she said, “We’ll have to see what they provide.”\nOn Monday, Smith replied to our inquiry by stating a spokesman would respond to our questions later that day.",
    "When we asked why, she said she was told because she “was not vaccinated.” When we asked what type of risk the facility might presume she posed, she said she was “not sure.”\n“Are you allowed to have other visitors besides your daughter?” we asked, to which she replied, “She brought a neighbor with her today” and that the individual was permitted to visit.",
    "Last week, the reason she was restrained was because her roommate tested ‘positive,’ and it obviously was a good call to not let her go to the beauty parlor because she tested ‘positive.”\nHe stressed that those coming out of COVID isolation are “treated the same,” regardless of vaccination status.",
    "“Her roommate tested ‘positive’ for COVID, and one of the policies we have to follow is that when you are exposed — and it doesn’t matter if you’ve been vaccinated or not — then you have a ten-day period during which we isolate to make sure that you’re not sick,” Perkins explained.",
    "As for Mrs. Whiting’s period of confinement, he said, “If she had gone for ten days after exposure with her roommate and shown no symptoms, then this would be over,” but the “positive” test result necessitated her continued isolation through ten days, which presumably began Friday.",
    "by Sharon Rondeau\n(Feb. 9, 2022) — Last Wednesday evening, The Post & Email spoke with Mrs. Norma Whiting, a longtime acquaintance with whom we first started speaking more than a decade ago when she and her now late husband, Gene Whiting, resided in McMinn County, TN.",
    "Perkins then asked if we were aware Mrs. Whiting tested “positive again” for coronavirus, to which we responded, “Yes, she did call me to keep the record completely straight.”\nThat call took place on Friday morning, several hours before our conversation with Perkins.",
    "'”\n“Since she has tested ‘positive’ today, we have pretty rigorous protocols that we have to follow where she will be in a specialized COVID ward that helps isolate her from other residents in the facility,” Perkins continued, referring to Mrs. Whiting.",
    "“I would like to be able to go and get my hair done, and that was scheduled for tomorrow.”\nWhen we asked if it were still scheduled, she said, “I believe someone canceled it.”\nMrs. Whiting confirmed on Saturday her hair appointment did not take place.",
    "Mr. and Mrs. Whiting attended several court hearings and took action on behalf of LCDR Walter Francis Fitzpatrick, III after he was accused of several crimes and ultimately sent to state prison in late 2014 for more than three years.",
    "For just over two years, Mrs. Whiting has resided at the Lineville Health and Rehabilitation, LLC nursing home in Lineville, AL and has shared with us the impact COVID-19 has had on her, the other residents in general and staff.",
    "Despite the CDC’s late-December announcement reducing the quarantine period from ten days to five, assuming no symptoms or a resolution of symptoms, Northport facilities continue to use the former guideline, Perkins said.",
    "“They’re taking my roommate out and putting her in the COVID unit,” Mrs. Whiting told us Thursday, “and put me in isolation.”\n“They’ve closed me off to everything, except my daughter is still allowed in,” she said.",
    "As promised, Mr. Joe Perkins, who stated his position as “Communications” for Northport Health Services, the parent company of Lineville Health and Rehabilitation, contacted us to address our questions.",
    "The CNAs here don’t even make $10.00 an hour; that’s outrageous, and they work 12-hour shifts.”\nIn December 2020, Mrs. Whiting informed us she had tested “positive” for coronavirus and was quarantined.",
    "Clint Lorance, who was sent to Ft. Leavenworth for 19 years after court-martial and conviction on charges of murder and attempted murder arising from his leadership of a platoon in Afghanistan.",
    "On Friday morning, Mrs. Whiting called to say she had tested “positive” for coronavirus but was exhibiting no symptoms or feeling ill. “They’re going to move me to the COVID unit,” she added.",
    "“In terms of recognizing natural immunity, that’s really not our option, and it’s really kind-of irrelevant in the things that we have to do,” he said, responding to our first question.",
    "“She’ll have all the same services and in fact, they are increased, because what we do now is we constantly monitor to see if she has any symptoms or any other health-related issues.",
    "Her objection was that she was restricted to her room, Mrs. Whiting said, which precludes her ability to shower and have her hair done.",
    "I was treated very, very well when we first got here, and the last few weeks I see a major difference in the way people react.",
    "Like most nursing homes, most of our homes are funded in part by Medicaid, so we have to follow what the CMS guidelines are.",
    "“When she comes out of COVID isolation and shows no symptoms, then she can do everything that she’s always been able to do.",
    "To our question as to her well-being, she responded at the time, “Physically, I am deteriorating, and emotionally, I’m mad.",
    "In November that year, President Donald Trump pardoned Lorance and ordered him released after five years of confinement.",
    "“That is the reason that she was in that temporary period of isolation, because her roommate had tested ‘positive.",
    "On Friday morning, we contacted the home administrator, Mark J. Smith, to ask the following questions:\n1.",
    "In 2019, Mrs. Whiting shared the essence of correspondence she exchanged with then-military prisoner 1Lt.",
    "“Virtually all of our regulations to handle COVID inside our facilities are dictated by CMS and by CDC.",
    "“An awful lot of your questions are covered by the general policies that we have to follow,” he began.",
    "CNAs, in particular, were overworked and “over-stressed,” she told us in a late-August 2020 interview.",
    "In a follow-up communication, Mrs. Whiting reported her only symptoms were loss of taste and smell.",
    "A return to normal activities, he said, would include going outside once the weather improves.",
    "Hopefully, if she’s well by the end of this week, she can go to the beauty parlor next week.",
    "“Let me explain something else to you about what we’re trying to do to contain COVID.",
    "Was she able to have her hair done on Thursday as she said was previously scheduled?",
    "Is Mrs. Whiting permitted to leave her room on the same basis as other residents?",
    "Can Mrs. Whiting participate in the full range of activities the facility offers?",
    "“We communicated that to both her and her family,” he said, meaning Mrs. Whiting.",
    "She had previously reported her decision against taking a vaccine for the virus.",
    "“Can more than one person visit at a time based on your protocols?” we asked.",
    "“I would like to be able to go out and have a shower,” Mrs. Whiting told us.",
    "I told you that most of our regulations were dictated by CMS and CDC.",
    "The roommate received the “positive” test “last week,” Perkins said.",
    "Does the facility recognize natural immunity following infection?",
    "Is she allowed to have the visitors of her choosing in her room?",
    "The shower facility is located outside her room, she said.",
    "He invited us to recontact him with further questions.",
    "Comment *\nThis site uses Akismet to reduce spam.",
    "Learn how your comment data is processed.",
    "“She’s in COVID isolation,” he replied.",
    "I see the staff and I see the results.",
    "The staff is over-stressed.",
    "5.",
    "2.",
    "3.",
    "4."
  ]
}