{
  "id": 6171,
  "mediaId": 2738,
  "date": "2022-02-07",
  "headline": "The Absolute Best Vodkas For Shots, According To Bartenders",
  "image": "https://uproxx.com/wp-content/uploads/2022/02/vodka-grid-uproxx-3.jpg?w=710",
  "link": "https://uproxx.com/life/best-vodkas-for-shots-according-to-bartenders/",
  "mediaOutlet": "uproxx.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Osburn",
  "authorUrl": "https://uproxx.com/author/christopher-osburn/",
  "termIds": [
    0
  ],
  "sentences": [
    "It ranges from low-end mixers to premium multiple-distilled, specially filtered vodkas that are so clean and pure you’d think you were sipping spring water with a boozy kick.",
    "Tito’s Handmade Vodka\nAlejandro Mendoza, restaurant and bar manager at Hotel SLO in San Luis Obispo, California\nABV: 40%\nAverage Price: $20\nWhy This Vodka?",
    "Ketel One Botanical Cucumber & Mint\nCassie Stockbridge, bartender at Lobby Bar at The Godfrey Hotel in Boston\nABV: 30%\nAverage Price: $20\nWhy This Vodka?",
    "The contemporary vodka marketplace is diverse with vodkas made from various ingredients like potatoes, wheat, grapes, rye, corn, apples, and even milk.",
    "Wheatley\nJohn “Fitzy” Fitzpatrick, spiritual advisor at Warren American Whiskey Kitchen in Delray, Florida\nABV: 41%\nAverage Price: $20\nWhy This Vodka?",
    "Russian Standard\nHeather Buelna, lead bartender at Sun Outdoors San Diego Bay in San Diego, California\nABV: 40%\nAverage Price: $20\nWhy This Vodka?",
    "Chopin\nMy Nguyen, general manager at I|O Rooftop at The Godfrey Hotel Hollywood in Los Angeles\nABV: 40%\nAverage Price: $20\nWhy This Vodka?",
    "The Grey Goose VX has a percentage of cognac blended into it and really rounds it out and adds much more complexity thanks to the cognac.",
    "We’re not talking about the harsh, chemical-tasting vodkas that come in plastic jugs and feel like they should be used to peel wallpaper.",
    "Most people that are doing shots tend to want the alcohol to be masked, which is why you see so many fruity or sweet shots all the time.",
    "Absolut Vodka is clean and substantial with flavors of a toasted baguette that finishes with notes of fresh cracked black pepper.",
    "Hanson of Sonoma\nChristopher Devern, lead bartender of Red Owl Tavern in Philadelphia\nABV: 40%\nAverage Price: $27\nWhy This Vodka?",
    "Belvedere\nEric Cohen, lead bartender at The Kimpton Sawyer in Sacramento, California\nABV: 40%\nAverage Price: $27\nWhy This Vodka?",
    "But, for those that do want to shoot straight vodka, I always push them toward a brand like Russian Standard Original, chilled.",
    "Absolut\nJosh Curtis, bar director at Malibu Beach Inn in Malibu, California\nABV: 40%\nAverage Price: $20\nWhy This Vodka?",
    "We’re talking about vodkas that you can still enjoy a shot of between gulps of your New England IPA or crafty lagers.",
    "To find these shot-worthy gems, we asked a handful of well-known bartenders to tell us the best vodkas for shots.",
    "With a neutral grain spirit like vodka for shots, I typically like to mix it with some sort of sweet and citrus.",
    "We’re talking about well-crafted vodkas that are created with as much care as any other spirit on the shelf.",
    "It goes down great as a shot with hints of fruit esters, lemon zest, and a slightly herbal, peppery flavor.",
    "Grey Goose VX\nNick Gergen, beverage director of Juniper and Ivy in San Diego\nABV: 40%\nWhy This Vodka?",
    "This ten-time distilled, triple filtered vodka is known for its crisp flavors of vanilla and grains.",
    "Ketel One Botanical Cucumber & Mint is my number one choice of vodka to drink straight or in a shot.",
    "Hanson of Sonoma is a small-batch vodka from California with multiple flavors to choose from.",
    "The Swedish distillation process will leave you feeling not too shabby the next morning.",
    "I am not a vodka fan but if I were to choose one, Chopin on the rocks would be my go-to.",
    "This vodka is made from a blend of wheat-based neutral spirit and grape-based vodka.",
    "It is very smooth and lacks that stringent taste you get from a lot of other vodkas.",
    "Keep an eye out for their seasonal releases which include boysenberry and espresso.",
    "With these naturally infused vodkas, I find it is just fine neat or served chilled.",
    "Flavors range from habanero, cucumber, mandarin, lemon, and of course classic.",
    "If I have to do a shot of vodka I’m going with Harlan Wheatley all the way.",
    "It’s made from corn, making it sweeter with slight corn and peppery flavor.",
    "With every sip, you taste crisp cucumbers mixed with slight notes of mint.",
    "If you want to drink vodka, you might as well go to the experts, right?",
    "Writer’s Pick: Hangar 1\nABV: 40%\nAverage Price: $28\nWhy This Vodka?",
    "There are tons of high-quality, flavorful vodkas on the market.",
    "I would enjoy either Belvedere Lake Bartezek or Grey Goose VX.",
    "The finish is warming, but there’s no harsh aftertaste.",
    "It’s known for its soft, sweet, easy-to-drink flavor.",
    "Shots are tricky, especially when it comes to vodka.",
    "It’s full of flavors like vanilla and green apple.",
    "Additionally, there is a slight citrus hint.",
    "Keep scrolling to see all of their picks.",
    "It’s of the smoothest vodkas out there.",
    "This one is clean and easy to drink.",
    "Tito’s Handmade Vodka is my pick.",
    "Belvedere is what I recommend.",
    "I love how smooth Chopin is.",
    "It goes down smoothly.",
    "It’s great for a shot.",
    "It’s hard to beat."
  ]
}