{
  "id": 6172,
  "mediaId": 2518,
  "date": "2022-02-11",
  "headline": "Today's Overall Top 10 Games",
  "image": "https://wehco.media.clients.ellingtoncms.com/static-4/ao_redesign/graphics/adgog.jpg",
  "link": "https://www.arkansasonline.com/news/2022/feb/11/capsules/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Erick Taylor",
  "authorUrl": "https://www.arkansasonline.com/staff/erick-taylor/",
  "termIds": [
    0
  ],
  "sentences": [
    "10 BRYANT AT LITTLE ROCK SOUTHWEST\nWHERE Gryphon Arena, Little Rock\nRECORDS Bryant 15-5, 8-1 6A-Central; Southwest 5-12, 1-6 6A-Central\nCOACHES Bryant: Mike Abrahamson; Southwest: Chris Threatt\nNOTEWORTHY Bryant trailed by as many as eight points Tuesday against Little Rock Central until staging a rally to win 50-45 and take the season series.",
    "4 LITTLE ROCK PARKVIEW AT BEEBE\nWHERE Badger Arena, Beebe\nRECORDS Parkview 17-3, 8-0 5A-Central; Beebe 12-9, 4-5 5A-Central\nCOACHES Parkview: Scotty Thurman; Beebe: Roger Franks\nNOTEWORTHY Parkview turned a 15-point lead into a 25-point advantage by the end of the third quarter in its game against Little Rock Christian on Feb. 8.",
    "6 FAYETTEVILLE AT BENTONVILLE\nWHERE Tiger Arena, Bentonville\nRECORDS Fayetteville 17-4, 9-0 6A-West; Bentonville 16-6, 6-3 6A-West\nCOACHES Fayetteville: Brad Stamps; Bentonville: Dick Rippee\nNOTEWORTHY May be the biggest game of the night, particularly for Bentonville if it expects to get back in the race for the league title.",
    "6 SPRINGDALE HAR-BER\nWHERE Wildcat Arena, Springdale\nRECORDS Bentonville West 14-7, 4-4 6A-West; Har-Ber 16-4, 8-0 6A-West\nCOACHES Bentonville West: Dion Hargrove; Har-Ber: Kimberly Jenkins\nNOTEWORTHY Har-Ber is four games in front of West in the standings and has four of its final six games at home before the playoffs start.",
    "2 NORTH LITTLE ROCK AT MOUNT ST. MARY\nWHERE McAuley Center, Little Rock\nRECORDS North Little Rock 19-3, 7-1 6A-Central; Mount St. Mary 4-17, 0-9 6A-Central\nCOACHES North Little Rock: Daryl Fimple; Mount St. Mary: Lauren Lawrence\nNOTEWORTHY North Little Rock, which has won five straight games since it was beaten by No.",
    "3 MAGNOLIA AT STAR CITY\nWHERE Bulldog Arena, Star City\nRECORDS Magnolia 20-0, 11-0 4A-8; Star City 5-15, 3-8 4A-8\nCOACHES Magnolia: Ben Lindsey; Star City: Reggie Turner\nNOTEWORTHY Seven of the past eight games for Star City has resulted in losses, including a 58-31 defeat to Watson Chapel earlier this week.",
    "9 LITTLE ROCK CENTRAL AT CABOT\nWHERE Panther Arena, Cabot\nRECORDS Central 15-6, 4-4 6A-Central; Cabot 12-9, 3-5 6A-Central\nCOACHES Central: Marlon Williams; Cabot: Jay Cook\nNOTEWORTHY A victory by Cabot could potentially create a three-way tie with Central and Bryant for fourth-place in the conference.",
    "3 FARMINGTON\nWHERE Cardinal Arena, Farmington\nRECORDS Pea Ridge 16-9, 7-4 4A-1; Farmington 24-1, 10-0 4A-1\nCOACHES Pea Ridge: Heath Neal; Farmington: Brad Johnson\nNOTEWORTHY Farmington has clinched the 4A-1 West division title and notched an automatic berth in the 4A-North regional tournament.",
    "5 MELBOURNE\nWHERE Bearkatz Arena, Melbourne\nRECORDS Sloan-Hendrix 4-18, 1-10 2A-2; Melbourne 24-0, 11-0 2A-2\nCOACHES Sloan-Hendrix: Josh Cagle; Melbourne: Eric Teague\nNOTEWORTHY The Lady Bearkatz are looking to make it 56 consecutive victories since being beaten by Paragould early last season.",
    "2 JONESBORO AT GREENE COUNTY TECH\nWHERE Eagle Arena, Paragould\nRECORDS Jonesboro 19-3, 9-0 5A-East; Greene County Tech 13-8, 5-4 5A-East\nCOACHES Jonesboro: Wes Swift; Greene County Tech: Jeff Guiot\nNOTEWORTHY Over the past 10 games, Jonesboro's average margin of victory is 31.9 points.",
    "10 JONESBORO AT GREENE COUNTY TECH\nWHERE Eagle Arena, Paragould\nRECORDS Jonesboro 14-6, 8-1 5A-East; Greene County Tech 13-7, 5-4 5A-East\nCOACHES Jonesboro: Jodi Christenberry; Greene County Tech: Matt Dean\nNOTEWORTHY Greene County Tech has been beaten by Jonesboro 12 times in a row.",
    "5 MARION\nWHERE Patriot Arena, Marion\nRECORDS Searcy 13-10, 4-5 5A-East; Marion 17-5, 7-1 5A-East\nCOACHES Searcy: Wayne Herren; Marion: David Clark\nNOTEWORTHY Juniors Ryan Forrest and Donnie Cheers teamed to score 51 points in Marion's recent double-overtime win over Nettleton.",
    "7 FARMINGTON\nWHERE Cardinal Arena, Farmington\nRECORDS Pea Ridge 10-15, 4-6 4A-1; Farmington 24-1, 10-0 4A-1\nCOACHES Pea Ridge: Trent Loyd; Farmington: Johnny Taylor\nNOTEWORTHY Pea Ridge gave Farmington a stiff challenge Jan. 11 when the Blackhawks lost to the Cardinals 38-29.",
    "8 MAUMELLE\nWHERE Hornet Gymnasium, Maumelle\nRECORDS Christian 11-9, 2-7; Maumelle 19-3, 8-1 5A-Central\nCOACHES Christian: Clarence Finley; Maumelle: Michael Shook\nNOTEWORTHY Little Rock Christian is 2-7 over its past nine games, including a 77-69 home loss to Maumelle.",
    "1 NORTH LITTLE ROCK AT LITTLE ROCK CATHOLIC\nWHERE Rocket Gymnasium, Little Rock\nRECORDS North Little Rock 19-3, 7-0 6A-Central; Catholic 10-9, 3-4 6A-Central\nCOACHES North Little Rock: Johnny Rice; Catholic: Todd Ezzi\nNOTEWORTHY North Little Rock is ranked No.",
    "8 BERGMAN AT LINCOLN\nWHERE Wolves Den, Lincoln\nRECORDS Bergman 32-0, 11-0 3A-1; Lincoln 3-18, 1-8 3A-1\nCOACHES Bergman: James Halitzka; Lincoln: Emilianne Cox\nNOTEWORTHY Bergman's 86-36 win over West Fork on Tuesday was its fifth by at least 50 points.",
    "9 SPRINGDALE AT ROGERS\nWHERE Mountie Arena, Rogers\nRECORDS Rogers 8-12, 4-5 6A-West; Springdale 15-6, 6-3 6A-West\nCOACHES Rogers: Lamont Frazier; Springdale: Jeremy Price\nNOTEWORTHY Rogers has been victorious in three of its past four games.",
    "Stewart Arena, Greenwood\nRECORDS Vilonia 17-4, 7-2 5A-West; Greenwood 17-4, 8-0 5A-West\nCOACHES Vilonia: Jeremy Simon; Greenwood: Clay Reeves\nNOTEWORTHY Greenwood can extend its lead over Vilonia in the 5A-West by 2.5 games with a victory.",
    "1 CONWAY\nWHERE Buzz Bolding Arena, Conway\nRECORDS Northside 19-2, 6-2 6A-Central; Conway 22-1, 8-0 6A-Central\nCOACHES Northside: Rickey Smith; Conway: Ashley Hutchcraft\nNOTEWORTHY These two will play again in 11 days in Fort Smith.",
    "... Jordan Marshall scored 16 points for the Lady Tigers when they knocked off the Lady Panthers 55-46 on Jan. 15 at Boone-Fitzpatrick Fieldhouse in Little Rock.",
    "2 North Little Rock on Feb. 15, which makes this contest extremely important for their chances at catching the Lady Wampus Cats atop the league standings.",
    "... Catholic came up with one of its biggest wins of the season Tuesday when it won at Fort Smith Northside 54-50 behind Beau Kronenberger's 18 points.",
    "... West had its two-game winning streak end when it suffered a 48-43 loss to Rogers on Feb. 8 -- its second of the season to the Lady Mounties.",
    "The Lady Golden Hurricane have won seven straight games and avenged its lone 5A-East loss Tuesday when it held on to beat Paragould 48-44.",
    "... Anna Trusty filled up the stat sheet with 18 points, 6 rebounds and 5 steals for Greenwood in a 52-19 blowout over Van Buren.",
    "This will be the first of three consecutive home games for Bentonville, which hosts Bentonville West and Rogers next week.",
    "The only loss during that span was to Mayflower, 63-49, in the semifinals of the Class 3A state tournament a year ago.",
    "The teams each own a win over the other, with the Lady Bulldogs taking the most recent battle 56-51 last week.",
    "... Senior guard Carl Daughtery Jr. has scored at least 30 points in his previous two games for the Hornets.",
    "... Searcy trailed 52-51 late in the game when it met Marion in mid-January before eventually falling 56-51.",
    "... Northside and Conway split a pair of games last season, with each winning on the other's home floor.",
    "4 Little Rock Parkview at the end of the regular season to determine the top seed from the 5A-Central.",
    "... Mount St. Mary has averaged 15.3 points in its prior three contests against North Little Rock.",
    "... Caylan Coons had 25 points for the Lady Wildcats in their 73-40 rout of Springdale on Monday.",
    "... Senior guard Landon Glasper had 25 points when the Bulldogs beat the Tigers 75-68 on Jan. 26.",
    "The Mounties won at Springdale 45-35 on Wednesday when five players have at least seven points.",
    "The Belles have dropped 23 straight 6A-Central games since the start of the 2020-21 season.",
    "The Rockets were beaten by 41 points when they played the Charging Wildcats on Jan. 14.",
    "The Lions' last win against the Patriots came on Jan. 17, 2020, when they won 71-65.",
    "If Maumelle wins its next four games, it could potentially set up a tilt with No.",
    "... Of the Cardinals' 10 conference wins, only three have come by single digits.",
    "... Sloan-Hendrix's only conference win was against Midland, 51-38, in December.",
    "... Jenna Lawrence scored 31 points in Farmington's 70-54 victory over Gentry.",
    "... Magnolia can essentially lock up the regular-season title with a victory.",
    "... Greene County Tech has won four in a row and five of its past six games.",
    "... Pea Ridge was beaten 53-29 by the Lady Cardinals in the first go-round.",
    "... Today's game in the first of four for Southwest over an eight-day span.",
    "... Springdale is tied with Bentonville for second place in the conference.",
    "He's coming off a 30-point outing in a 14-point victory over Sylvan Hills.",
    "... Jonesboro has came out on top in four of the previous five matchups.",
    "The Lady Eagles are tied with Paragould for fourth place in the league.",
    "1 Conway, dominated the first head-to-head meeting 75-19 a month ago.",
    "... Lincoln suffered a 64-14 loss to the Lady Panthers on Jan. 22.",
    "The Patriots are scheduled to play at Sylvan Hills on Feb. 18.",
    "... Beebe is coming off a 58-44 loss at Benton on Wednesday.",
    "... Cabot is 2-3 in its past five home games vs. Central.",
    "... Farmington has won 13 games by at least 20 points.",
    "The only defeat in that stretch was 47-32 to Marion.",
    "The Hornets won 75-58 in the first meeting Jan. 29.",
    "... Melbourne has won 21 games by double figures.",
    "The Panthers blasted Star City 71-22 on Jan. 29.",
    "Parkview doubled up the Bears 80-40 on Jan. 25.",
    "The Bulldogs travel to Fayetteville in a week.",
    "... Bergman is 63-1 over its past 64 games.",
    "14 nationally in the ESPN top 15 poll.",
    "It was the team's ninth win in a row.",
    "Forrest had 18 points in that one.",
    "The Lady Bears will take on No.",
    "4 FORT SMITH NORTHSIDE AT NO.",
    "LITTLE ROCK CHRISTIAN AT NO.",
    "BENTONVILLE WEST AT NO.",
    "7 GREENWOOD\nWHERE H.B.",
    "SLOAN-HENDRIX AT NO.",
    "PEA RIDGE AT NO.",
    "PEA RIDGE AT NO.",
    "Sponsor Content",
    "VILONIA AT NO.",
    "SEARCY AT NO.",
    "GIRLS\nNO.",
    "BOYS\nNO.",
    "NO.",
    "...",
    "...",
    "NO.",
    "NO.",
    "...",
    "...",
    "NO.",
    "...",
    "...",
    "...",
    "NO.",
    "...",
    "NO.",
    "NO.",
    "...",
    "...",
    "...",
    "...",
    "NO.",
    "...",
    "NO.",
    "NO."
  ]
}