{
  "id": 6185,
  "mediaId": 2530,
  "date": "2022-02-10",
  "headline": "Jerry Harris From \"Cheer\" Pleaded Guilty To Receiving Child Sexual Abuse Material",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-02/11/0/campaign_images/fed3c27d7b45/jerry-harris-from-cheer-pleaded-guilty-to-receivi-2-700-1644539270-13_dblbig.jpg",
  "link": "https://www.buzzfeednews.com/article/paigeskinner/jerry-harris-pleaded-guilty",
  "mediaOutlet": "Buzzfeed",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paige Skinner",
  "authorUrl": "https://www.buzzfeednews.com/author/paigeskinner",
  "termIds": [
    0
  ],
  "sentences": [
    "Posted on February 10, 2022, 1:28 pm\nJerry Harris, the 22-year-old former star of Netflix's Cheer, pleaded guilty Thursday to one count of receipt of child sexual abuse material and one count of traveling with the intent to engage in illicit sexual conduct.",
    "“In an effort to put a stop to a serial predator and avert harm to other children, my sons took the brave step of speaking publicly about the sexual abuse they suffered at the hands of Jerry Harris,\" the victims' mother said in a statement Thursday.",
    "Joseph D. Fitzpatrick, assistant US attorney of the Northern District of Illinois, told BuzzFeed News that the child sexual abuse material charge carries a mandatory minimum sentence of five years in federal prison and a maximum of 20 years.",
    "According to the criminal complaint, the investigation into Harris began when the mother of the twins, who were 14 at the time, contacted authorities because she found sexually explicit pictures on one of her sons' cellphone.",
    "\"The criminal conduct in this case also took place in the context of a competitive cheer community where inappropriately sexualizing and sexually abusing children was far too common and too often overlooked.\"",
    "There is still an ongoing civil lawsuit filed on behalf of twin brothers against Harris that alleges Harris sexually exploited and abused them and that the cheer officials enabled the abuse.",
    "\"Jerry is a 22-year-old young man whose story can only be understood though the lens of the extreme poverty, sexual abuse, and neglect of his childhood,\" part of the statement reads.",
    "In October 2020, federal prosecutors alleged that Harris \"exploited and violated\" more than 10 boys, including raping a 15-year-old boy in a bathroom at a 2019 cheer event.",
    "Since his arrest in September 2020, Harris has stayed in a Chicago jail ahead of his trial because the judge ruled that Harris was a \"significant danger to the community.\"",
    "Harris was one of the breakout stars, appearing regularly in interviews, commercials, and even hitting the red carpet as the correspondent for The Ellen DeGeneres Show.",
    "One boy allegedly sent Harris more than a dozen explicit photos in the span of two years, and Harris allegedly sent the boy photos and videos of Harris masturbating.",
    "Then in December 2020, Harris was hit with additional charges of producing child sexual abuse images and one count of enticing a minor to engage in sexual activity.",
    "The squad's coach, Monica Aldama, recently told Tamron Hall that she found out about the charges against Harris while she was competing on Dancing With the Stars.",
    "The twins, who are also cheerleaders, described the abuse and why they chose to come forward in detail in the second season of Cheer following Harris's arrest.",
    "\"Harris’ admission of guilt today gives me hope that the pain and grief that my sons have suffered as a result of speaking up has not been in vain.",
    "I will continue my mission to hold Jerry Harris and his enablers fully accountable both in the courts of law and the court of public opinion.\"",
    "According to documents, Harris used his money and fame from Cheer to offer minors $1,000 to perform sexual acts over FaceTime and Snapchat.",
    "Harris was originally charged with an additional five counts including sexual exploitation of children, to which he pleaded not guilty.",
    "\"I was just taken aback and it kind of took the breath out of me for a minute, and all I could read is the headline,\" Aldama told Hall.",
    "Harris rose to fame after appearing on Netflix's Cheer, which followed the cheer team of Navarro College in Corsicana, Texas.",
    "Prosecutors agreed to drop those charges as part of Thursday's plea agreement, the Associated Press reported.",
    "In a statement, Harris's lawyers said that Harris wants to take responsibility for his actions.",
    "Harris was arrested in September 2020 for allegedly producing child sexual abuse material.",
    "In a statement to ABC News at the time, Harris denied the allegations.",
    "The traveling charge is punishable by up to 30 years.",
    "\"I couldn't read the actual article.\"",
    "The sentencing is June 28."
  ]
}