{
  "id": 6262,
  "mediaId": 2523,
  "date": "2022-02-03",
  "headline": "The 2022 NFL Quarterback Commitment Index",
  "image": "https://cdn.vox-cdn.com/thumbor/mXopAjmOFw_0C6TSCKXskKMFPaA=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23212890/qbcommit_getty_ringer.jpeg",
  "link": "https://www.theringer.com/nfl/2022/2/3/22914367/2022-quarterback-commitment-index-aaron-rodgers-russell-wilson-tom-brady",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Danny Heifetz",
  "authorUrl": "https://www.theringer.com/authors/danny-heifetz",
  "termIds": [
    0
  ],
  "sentences": [
    "— Adam Schefter (@AdamSchefter) February 25, 2021\nThis is like saying, “I don’t want a divorce, but if I did, here is who I’d leave you for.” The Seahawks responded by catering to Russ’s desires: They brought in help on the offensive line and gave him more input in hiring their next offensive coordinator.",
    "Relationship Goals\nKansas City Chiefs and Patrick Mahomes\nBuffalo Bills and Josh Allen\nCincinnati Bengals and Joe Burrow\nLos Angeles Chargers and Justin Herbert\nLos Angeles Rams and Matthew Stafford\nIt doesn’t take a queen to deem Mahomes flawless.",
    "Morning-After Regrets\nNew York Giants and Daniel Jones\nIn the hazy light of the Dave Gettleman era, Daniel Jones looked just enough like the Giants’ ex (Eli Manning) for New York to convince itself this was a good idea.",
    "These three rookie QBs all finished in the bottom four among qualifying passers in completion percentage, passer rating, ESPN quarterback rating, and prayers for their safety per throw (PFTSPT—it’s an unofficial stat).",
    "But does it make more sense for Rodgers to get traded to Denver for two or three first-round picks in 2022, or go there without costing the Broncos anything but money in 2023 (and maybe bring Davante Adams with him)?",
    "Not Ready to Be Exclusive\nMiami Dolphins and Tua Tagovailoa\nPhiladelphia Eagles and Jalen Hurts\nHurts and Tua had their own love triangle in college, when they went back and forth as the starter at Alabama.",
    "Still on the Apps\nDenver Broncos\nWashington Football Team\nCarolina Panthers\nThe Broncos have had a bunch of mini-relationships since Peyton Manning left, but they always seem to be into the worst guys.",
    "“But those decisions are inner-related based on our global needs and the totality of those global needs.”\nHot tip: don’t put “inner-related based on our global needs” on your Hinge profile, Mike.",
    "The First Year of Marriage Is Not What It Looks Like on Instagram\nJacksonville Jaguars and Trevor Lawrence\nNew York Jets and Zach Wilson\nChicago Bears and Justin Fields\nHoneymoons end quickly.",
    "Whereas the previous four quarterbacks were drafted by their current teams, the Rams and Stafford began a secret dalliance in Mexico that ended with them leaving their partners for each other.",
    "“Meet Me Halfway”\nDallas Cowboys and Dak Prescott\nArizona Cardinals and Kyler Murray\nBoth of these quarterbacks are saddled with coaches who are not carrying their weight in the relationship.",
    "Baker looked broken down the stretch, as he played through a ridiculous amount of injuries: a torn labrum in his throwing shoulder, a broken upper arm bone, a knee contusion, and a sore foot.",
    "Rodgers won a Super Bowl with the Packers a decade ago, but they’ve lost four NFC title games in the past eight seasons and just had an embarrassing playoff exit at the hands of the 49ers.",
    "In This Stream\nCeltics Stifling KD and Embiid’s Raptors Revenge, Plus Deebo’s Value, NFL Draft Rumors, and Going Abroad With Kevin Clark\nSometimes Patrick Swayze teaches you how to dance.",
    "“You Could Do Worse—Plus He Pays for Everything”\nLas Vegas Raiders and Derek Carr\nCarr falls into a similar category as the above guys, except he has a sweet rent-controlled apartment.",
    "And the Panthers are so desperate for a relationship that they dumped Cam Newton for Teddy Bridgewater, then dumped Bridgewater for Sam Darnold, then dumped Darnold to go back to Cam!",
    "There’s been smoke for almost a year that Rodgers could be interested in going to Denver, and the team just hired Packers offensive coordinator Nate Hackett as their head coach.",
    "They’ll be watching this Super Bowl the same way people look at happy couples on their Instagram feed, fighting the gnawing sense that they are missing something—or someone.",
    "“You Could Do Worse”\nTennessee Titans and Ryan Tannehill\nMinnesota Vikings and Kirk Cousins\nAtlanta Falcons and Matt Ryan\nThese three teams are in quarterback purgatory.",
    "Trouble With Monogamy\nSeattle Seahawks and Russell Wilson\nGreen Bay Packers and Aaron Rodgers\nIs a person really meant to stay with one team for their entire career?",
    "It’s easy for outsiders to say dump these guys, especially when Tannehill throws multiple picks in the playoffs or Minnesota fails to make the playoffs altogether.",
    "Getting Cold Feet\nCleveland Browns and Baker Mayfield\nBaker and the Browns seemed like they were going to get married last year via a big, fat contract extension.",
    "And while the Patriots tried to get along without him—remember Cam Newton?—they eventually decided to get a younger man who reminded them of their long-lost love.",
    "Everyone felt Stafford could do better than the Lions, but the Rams took quite the risk by dumping Jared Goff and two first-rounders for the man of their dreams.",
    "The Dolphins publicly say they are committed to Tua, but behind closed doors, we know they have had their doubts—and that they are looking at other quarterbacks.",
    "Wilson has told the Seahawks he wants to play in Seattle but, if a trade were considered, the only teams he would go to are the Cowboys, Saints, Raiders, Bears.",
    "Down six with 14 seconds left in the wild-card game against the 49ers, Cowboys head coach Mike McCarthy and offensive coordinator Kellen Moore called a draw.",
    "He can either force a trade this spring or play one more season as a Packer and walk in free agency next year, à la what Tom Brady did leaving the Patriots.",
    "Fields got sacked on 12 percent of his dropbacks this season, which not only led the league, but was also the second-highest sack rate of the past decade.",
    "So with a new offseason quarterback carousel starting up, let us dive in and assess how committed teams and QBs really are to their current relationships.",
    "There’s no question about whether he’ll deliver in big moments—he just brought his team to its first Super Bowl berth since the 1988 season, after all.",
    "[Editor’s note: Given the open criminal, civil, and NFL investigations into Deshaun Watson, we’ve excluded both Watson and the Texans from this list.]",
    "But then San Francisco became interested in a younger man—Lance—and made a splashy move to trade two future first-rounders to draft him last spring.",
    "Don’t be sad it’s over, be happy that it happened—and that the franchise value increased by almost a fourth since Brady joined, according to Forbes.",
    "Maybe we can use a better one: What’s the German word for taking $20 million per year from Fox Sports until you can replace Mike McCarthy in Dallas?",
    "Just give this relationship another year and hope they fall in love—or that the dead cap penalty will eventually be palatable enough for a divorce.",
    "These teams have been swept off their feet by their dashing beaus, and now they are just a few short steps away from eternal, immortalized bliss.",
    "And it seems like Mayfield is on the mend—he tweeted last month that he was taking the steps “to get back to my true self.” The Browns hope so.",
    "There were questions about Allen’s, uh, processing ability when he was drafted in 2018, but nobody ever had concerns about his physical build.",
    "After winning one Super Bowl and almost winning another after the 2013 and 2014 seasons, respectively, the Seahawks defense has disintegrated.",
    "“We Have an Understanding”\nSan Francisco 49ers and Jimmy Garoppolo (and Trey Lance)\nThe 49ers have an open relationship with Jimmy Garoppolo.",
    "For these two couples, it’s natural to wonder “what happened to us?” And it would be nice to point to one moment when everything went wrong.",
    "“I Can Fix Him”\nIndianapolis Colts and Carson Wentz\nThe Colts traded for Wentz last offseason despite his mechanics being completely broken.",
    "Hurts was added to the roster while the team was still “committed” to Carson Wentz, and then it traded Wentz away to make Hurts the starter.",
    "The Jets are the wild-card friend who keeps roping in seemingly solid guys (Mark Sanchez, Sam Darnold, Zach Wilson) but can’t make it work.",
    "And this is the time of year when teams go looking for that special someone—just ask the Rams, who traded for Stafford on January 30, 2021.",
    "McCarthy’s gotta clean things up, because former Saints coach Sean Payton is single again, and Jerry Jones has always had an eye for him.",
    "Wilson not-so-subtly signaled a possible divorce last year, when his agent went on the record with a list of teams Wilson would play for.",
    "Hamler at receiver, Noah Fant and Albert Okwuegbunam at tight end, plus the feisty Javonte Williams and Melvin Gordon at running back).",
    "Perhaps the next head coach will make sure his QB gets to operate in a more comfortable atmosphere—and isn’t left with too many scars.",
    "The Blind Date From Hell\nNew Orleans Saints and Sean Payton and Taysom Hill\nSean Payton has retired—though he doesn’t like that term.",
    "The Colts are committed to Wentz for one more season, but everyone knows they’re already looking for a way out of this relationship.",
    "And they did so because Indy head coach Frank Reich worked with Wentz in Philly in 2017, when Wentz was playing at an MVP level.",
    "That would make Jimmy GQ one of the hottest bachelors on the free agent market—and you know he’s going to enjoy the single life.",
    "Honeymoon Phase\nNew England Patriots and Mac Jones\nAfter a blissful 20-year marriage, Tom Brady asked New England for a divorce.",
    "Jimmy handled it like a pro, and the 49ers surprisingly stayed faithful to him for just almost the entirety of the 2021 season.",
    "Seattle finished below .500 this season for the first time in a decade and doesn’t even have a first-round pick to show for it.",
    "Now, it’s easy to make fun of the trade that sent him to Indianapolis, but haven’t we all tried and failed to change someone?",
    "And by that I mean he’ll cost just $20 million in 2022, effectively making him the cheapest solid veteran starter in the NFL.",
    "And who might be the next iterations of Stafford and the Rams, ready to spurn their current partners to find their next ones?",
    "Unsuccessfully Getting Back at Their Exes\nDetroit Lions and Jared Goff\nThese two got together for purely carnal purposes.",
    "We broke down 10 classic falling-in-love montages to determine which seem feasible—and which would be complete disasters.",
    "In Chargers-land, fans are starting to realize that Justin Herbert is doing things Philip Rivers couldn’t even dream of.",
    "But who wants to deal with that financial headache, especially when you don’t have great odds of finding someone better?",
    "When Russell Wilson and Aaron Rodgers signed up for this marriage stuff, they didn’t know it was going to be this hard.",
    "After the Rams dumped Goff for Stafford, Goff moved into Detroit’s place and they tried to make their exes jealous.",
    "Whatever Payton calls it, he’s leaving the Saints’ next head coach with the most awkward blind date situation ever.",
    "Not crushing in an emotional sense—but in the sense that he’s literally been getting crushed on the football field.",
    "The Lions won just three games this season, and now both parties have to watch their exes play in the Super Bowl.",
    "But hopefully that doesn’t mean limiting their options to a competition between Mason Rudolph and Dwayne Haskins.",
    "Washington was with Taylor Heinicke and Ryan Fitzpatrick last year, and those two might be best left in the past.",
    "This situation is why Facebook introduced that feature to “see less” of your exes in your feed after a breakup.",
    "Wentz committed two turnovers in the team’s Week 18 loss to the Jaguars that knocked them out of the playoffs.",
    "With that prologue to a relationship, Hurt can’t be surprised he’s not getting clear answers about his future.",
    "Back on the Apps\nPittsburgh Steelers\nBen Roethlisberger is gone, and the Steelers are back in the dating pool.",
    "For no matter how good a football team is, it can’t be truly happy until it finds the right man under center.",
    "The Bears fired general manager Ryan Pace and head coach Matt Nagy this winter, in part for failing Fields.",
    "But after losing in the NFC championship game, the Niners may split with Jimmy to go exclusive with Lance.",
    "But these two are starting to drag their feet in part because Lamar hasn’t hired a wedding planner (a.k.a.",
    "And in the process, they likely gave every team looking for a new passer rather unrealistic expectations.",
    "And the Rams have committed to Matthew Stafford following a sordid and scandalous international affair.",
    "Or hearing that, just one season ago, ESPN listed him on its fantasy football platform as a tight end?",
    "But while the Browns aren’t breaking off the engagement, they might be wise to postpone the wedding.",
    "Imagine getting to dinner and realizing the quarterback you’ve been set up with plays special teams?",
    "Each of these teams could move on if they really wanted to—it would just be complicated financially.",
    "It’s always hard to talk about money and weddings—especially when the mother-in-law gets involved.",
    "Maybe he means the Steelers aren’t trying to jump into another long-term relationship so quickly.",
    "Cleveland’s been with a lot of terrible guys—29 starting quarterbacks prior to Baker since 1999.",
    "But the people saying “get rid of them” aren’t the ones who would have to deal with the fallout.",
    "Meanwhile, the other 30 NFL teams are staring in the mirror, evaluating all their imperfections.",
    "In Arizona, Cardinals coach Kliff Kingsbury’s offensive plan has mostly been to lean on Kyler.",
    "Do you want to sell Vikings fans on Kellen Mond as the team’s starting quarterback in 2022?",
    "“Right now, all options are on the table,” Steelers head coach Mike Tomlin said in January.",
    "With their teams at inflection points, Rodgers and Wilson are both contemplating leaving.",
    "Or it could package those picks for a star quarterback and keep Hurts as its side option.",
    "Their passers are good enough to fear losing them, but not good enough to really satisfy.",
    "Jacksonville’s marriage with Lawrence got rocky right around the time Urban Meyer’s did.",
    "Yet after their worst season together, Wilson has said he still wants to win in Seattle.",
    "Seahawks’ QB Russell Wilson has not demanded a trade, his agent Mark Rodgers told ESPN.",
    "Mac Jones will likely finish second in Offensive Rookie of the Year voting this season.",
    "Let’s go through the NFL, from the dream couples to the single-and-ready-to-mingles.",
    "They have a staggering number of free agents, many of which won’t be able to return.",
    "They even once said they wanted to be a “quarterback factory.” (Total fuccboi move.)",
    "Rodgers might want out now, but it would cost him some medium-term competitiveness.",
    "Maybe New Orleans’s new coach can have a friend call and pretend it’s an emergency.",
    "Baltimore Ravens and Lamar Jackson\nEveryone expected the Ravens would marry (a.k.a.",
    "With a deal that good, a lot of other teams might be interested in trading for him.",
    "“It’s Not You, It’s Me.”\nTampa Bay Buccaneers and Tom Brady\nBrady is walking away.",
    "Mahomes and Allen just combined for one of the greatest playoff games in decades.",
    "Burrow’s appeal isn’t so much about his arm or his skill set, but his confidence.",
    "And you can guarantee that any diamonds he buys you will be real and spectacular.",
    "The Cincinnati Bengals recently married a modern-day Marlboro Man in Joe Burrow.",
    "Minnesota would have a more palatable $20-25 million cost to get rid of Cousins.",
    "Their skill group is young and athletic (Courtland Sutton, Jerry Jeudy, and K.J.",
    "Denver’s been working out, and this offseason is their Hot Destination Summer.",
    "To be clear, though, Hurts knew what he was getting into when he got drafted.",
    "Now they are in the pros, and they have each ended up with total fuccbois.",
    "Instead, Lamar’s mother is handling the $100 million contract negotiation.",
    "Even before he confirmed it, everyone could tell his heart was elsewhere.",
    "The Seahawks were the only team to run less than 1,000 plays on offense.",
    "Meanwhile, the Eagles made the playoffs and got Indy’s first-round pick.",
    "They need to feel that spark again before they can walk down the aisle.",
    "Payton insisted Hill has a lot of potential, but Hill is 31 years old.",
    "against San Francisco and led the NFL in penalties on the season (!!).",
    "Trading Tannehill would burn a $28 million hole in Tennessee’s budget.",
    "But in truth, the love drained from these relationships drip by drip.",
    "The Colts hoped that reuniting the two could re-spark their old fire.",
    "Other times you’re stuck in nightmarish traffic heading to the mall.",
    "(Cousins’s cap hit is more than twice as high as Carr’s next year.)",
    "Rodgers has made no such proclamations about staying in Green Bay.",
    "But in the harsh morning sunlight, it turns out he’s just tall.",
    "The 2022 Packers will probably be worse than the 2021 version.",
    "Now they’re on the market again, and this time they look good.",
    "He just guided the team through an immensely difficult season.",
    "Let this be a lesson, teams: Desperation is not attractive.",
    "The Eagles, meanwhile, have no interest in being exclusive.",
    "New head coach Josh McDaniels may have a vision for him.",
    "Everyone knows those flings won’t be anything serious.",
    "Philly has three draft picks in the top 20 this year.",
    "Fields’s relationship with Chicago has been crushing.",
    "Unfortunately, those embers have cooled to gray ash.",
    "Be careful, Jalen—once a fuccboi, always a fuccboi.",
    "This year’s Super Bowl features two happy couples.",
    "Now they are one win away from happily ever after.",
    "But eventually Kyler will need some support, too.",
    "A Matt Ryan trade would cost Atlanta $41 million.",
    "How could you embarrass Dak in public like that?",
    "He has Patriots fans feeling a spark once again.",
    "Wilson missed three games with a thumb injury.",
    "Their defense was top three in points allowed.",
    "Wait a second … is that what Sean Payton did?",
    "extend) Lamar after his dazzling 2019 season.",
    "Sure, he isn’t Herbert or Allen or Mahomes.",
    "But Buffalo’s Josh Allen is not far behind.",
    "It could build a solid group around Hurts.",
    "The situation is even bleaker in Seattle.",
    "And then there are the Rams and Stafford.",
    "This isn’t a traditional NFL love story.",
    "Love, like football, is a contact sport.",
    "This spiteful union didn’t work so well.",
    "But he is very much New England’s type.",
    "And oh, how he puts that build to use.",
    "He is the incomparable of the season.",
    "The Cowboys also had 14 penalties (!)",
    "But now the Browns are having doubts.",
    "But then what would the Raiders do?",
    "He can’t do everything around here.",
    "He just needs to work on his hair.",
    "At first, the two were exclusive.",
    "That biological clock is ticking.",
    "Their offensive line is solid.",
    "But everything went to hell.",
    "Do they just have bad taste?",
    "Or are the Jets the problem?",
    "This is a comfortable life.",
    "They want this to work.",
    "Maybe a bit of both.",
    "Put a Ring on It!",
    "And … it worked?",
    "Carr is steady.",
    "He’s reliable.",
    "Of course not.",
    "Who is single?",
    "Who is taken?",
    "an agent)."
  ]
}