{
  "id": 6270,
  "mediaId": 6552,
  "date": "2022-02-04",
  "headline": "Hochul says data will guide mask mandate in New York",
  "image": "https://s7d2.scene7.com/is/image/TWCNews/hochul_mask_mandateap_12132021",
  "link": "https://www.ny1.com/nyc/all-boroughs/ny-state-of-politics/2022/02/04/hochul-says-data-will-guide-mask-mandate-in-new-york",
  "mediaOutlet": "ny1.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Reisman",
  "authorUrl": "https://www.ny1.com/nys/central-ny/capital-tonight-team/2017/09/18/nick-reisman",
  "termIds": [
    0
  ],
  "sentences": [
    "Opponents of the mandate believe the rule should not be enforced because Hochul lacks the power to do so; state officials have argued the Department of Health is given broad powers to protect public health.",
    "\"I think the biggest thing is whether it's constitutional or not and the fact that it never came before the Legislature as the representatives of the people,\" he said.",
    "Kathy Hochul on Friday indicated the future of mask wearing in schools, however, will be in large part linked to the number of kids who are vaccinated for the virus.",
    "\"The more children we have vaccinated, the safer they will be when they go to school at the time they get to where they won't need a mask anymore,\" she said.",
    "We'll be making some announcements in the short term as we see these numbers progressing,\" she said on Friday during a weather and COVID-19 briefing.",
    "A mask rule for indoor spaces was re-instituted in December as the omicron variant was beginning to show a steep rise in COVID-19 cases.",
    "Hochul indicated she's watching the numbers, especially when it comes to increasing the number of children who have been vaccinated.",
    "But for now, efforts to curtail the spread of the virus through wearing masks inside businesses and schools will remain in effect.",
    "COVID-19 cases in New York have rapidly declined over the last month as the omicron surge this winter appears to be subsiding.",
    "Some Republican lawmakers in the state Assembly this week called for more local control over pandemic guidelines and mandates.",
    "So each one of us represent diverse areas, unique areas and the biggest thing is having a voice for the people we represent.\"",
    "\"We've got to learn with this virus and I think mandating masks, especially for children, is not the way to go,\" he said.",
    "The vaccination, along with a booster shot, is seen as an effective guard against contracting a severe case of COVID-19.",
    "The mask mandate, put in place by the state Department of Health, remains under a legal challenge in state court.",
    "Others, including Assemblyman Michael Fitzpatrick, remain concerned over the mandate in place for schools.",
    "Lawmakers like Assemblyman Christopher Tague called the current mandate a one-size-fits-all approach.",
    "\"Things are not the same in downtown Schoharie that they are in downtown Manhattan so to speak.",
    "\"It's something we get asked a lot about: When are masks coming off in schools?",
    "\"It's something we're striving for, but we're just not there yet.\"",
    "Kids age 5 and older are eligible for the vaccine.",
    "Gov."
  ]
}