{
  "id": 6276,
  "mediaId": 6704,
  "date": "2022-02-07",
  "headline": "Yes, participating in a social media gift exchange can get you into legal trouble",
  "image": "https://media.king5.com/assets/VERIFY/images/ef32c873-e9c0-4f8f-b7ef-b18e3d1400d3/ef32c873-e9c0-4f8f-b7ef-b18e3d1400d3_1140x641.jpg",
  "link": "https://www.king5.com/article/news/verify/money-verify/international-book-exchange-pyramid-schemes-is-international-book-exchange-real-legal-social-media-scams/536-59321c76-043e-40c3-a11e-a8330b79775d",
  "mediaOutlet": "king5.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Wisconsin Department of Agriculture, Trade and Consumer Protection\nAttorney Douglas Brooks, advisor to the Pyramid Scheme Alert watch group\nStacie Bosley, associate professor of economics at Hamline University\nRobert FitzPatrick, author of “Ponzinomics: The Untold Story of Multi-level Marketing,” expert witness in pyramid scheme cases, and president of the Pyramid Scheme Alert watch group\nBetter Business Bureau\nNot only is it highly unlikely that you’ll get 36 books back, our experts also say the message shares commonalities with classic pyramid schemes and data grabs, and participating in those can open the doors for legal repercussions under state anti-pyramid scheme laws.",
    "The Federal Trade Commission and the Securities and Exchange Commission label pyramid schemes, which include viral social media gift exchanges, as “a form of investment, (illegal in the US and elsewhere) in which each paying participant recruits further participants, with returns being given to early participants using money contributed by later ones.” The agencies warn that pyramid schemes can often be disguised as multi-level marketing scams, camouflaging as products that require a buy-in, like leggings, gift-exchanges or hair products.",
    "For example, in Pennsylvania, there are three different definitions of a “Chain-Letter Plan,\" “Pyramid Club\" and “Pyramid Promotional Scheme,” with violators potentially getting business licenses revoked, paying restitution to the victims and community service depending on the crime and listing chain letters asking for $25 or more as illegal.",
    "“Because once they've got you sort of hooked on something fairly cheap, then there's some psychological factors that come into play that may encourage you or induce you to keep on with it, because maybe it didn't work out this time, but maybe it'll work out next time.”\nHow can you decipher what’s likely a pyramid scheme and what’s real?",
    "He told VERIFY that the book exchange is just “one tiny manifestation of a much larger phenomenon,” saying that physical chain letters where people would put a dime in an envelope and were told it would increase by the hundreds were a starting point for people to use the postal service for schemes as early as 1935.",
    "“When people participate in more camouflage pyramid schemes like this, they get used to this notion that it's perfectly valid to contribute something and then go recruit people, and I want to reiterate that these [pyramid schemes] can come at you in a lot more complicated forms,” Bosley said.",
    "“So if you can't stop yourself from participating in this version of a scheme, it's very likely, again, that your own brain will make it seem appropriate when it comes in another form.”\nBrooks agreed, saying it can be easy to fall for the gimmicks when the cost to play is relatively low.",
    "(The scam, dubbed the ‘Send-A-Dime’ or ‘Prosperity Club’ letter, overwhelmed postal services in Denver before hitting other post offices across the U.S.)\n“If you got a certain number (from the envelope), all the money from all those people would come back to you,” FitzPatrick said.",
    "Whether it’s on Facebook, Instagram or Twitter, you may have seen the following message making the rounds online, claiming you can get free books if you participate in an international literary exchange:\n“I’m looking for people to participate in a huge book exchange.",
    "In Arizona, it’s a felony to \"establish, operate, advertise or promote a pyramid promotional scheme.” In Florida, the penalty for such a crime starts as a first-degree misdemeanor for those soliciting over $100 and goes up depending on the severity of the crime.",
    "Attorney Douglas Brooks told VERIFY that while smaller gift recruits like the book exchange might be harder to prosecute because the financial losses are often much smaller than major frauds committed by large scale companies, participating can still be illegal.",
    "Every platform that you can think of, you’ll see these solicitations.”\nAll of our experts agree – while the price of one book might not seem too hefty, the real cost of participating in schemes like the book exchange is the cost of giving up your information.",
    "The moment you pay for something and start promising a return, that's when it moves into the area of fraud.”\nIn 2019, Bosley’s lesson plan on “How to Spot A Pyramid Scheme” was translated to a TED Talk, where it has since gained almost 5 million views.",
    "“It may very well violate pyramid scheme laws.”\nThe rise of social media and new technology has also made it easier to disguise pyramid schemes, changing the act of mailing physical letters to new forms of “free” payments or products on social media.",
    "Beyond being risky, the Better Business Bureau warns that pyramid schemes and gift exchanges are also illegal in the United States and Canada, listing jail time, fines and potential lawsuits as potential repercussions for participants and organizers.",
    "How many things in your life do you have to ask if it’s legal or not to participate?”\nBosley agreed, saying if it sounds too good to be true, it likely is, and that using the mail service to continue these scams is illegal, even if it’s harmless.",
    "“Even if the chain letter itself is not mailed, as long as the payment or prize is sent through the mail the entire scheme is illegal,” reads a warning from the Wisconsin Department of Agriculture, Trade and Consumer Protection on gift exchanges.",
    "\"With the pure pyramid scheme, where all you're doing is sort of putting out some money with the expectation that you're going to receive something back...whether it's $10, or a book, shouldn't really make a difference,” says Brooks.",
    "They’ll be the favorite books from strangers around the world.”\nOther variations of this claim have appeared for years, like the “secret sister gift exchange” – which has been labeled a scam by the Better Business Bureau.",
    "In order to receive 36 books you would have to recruit six of your friends to participate, and they would also have to find six followers of theirs to participate and send books, which our experts say isn’t guaranteed.",
    "Giving your address for books to be sent, coupled with your first name – or in some cases, financial information for someone to buy a book on their own – to people you don’t know well online is never a safe idea.",
    "If you do something as harmless as a book exchange it can open you up for further trouble.”\nExchanges like this one also open the potential for someone to collect your personal data and sell it to criminals.",
    "On top of that, our experts warn that participating in online exchanges can leave you susceptible to leaking your private information online or falling for other more nefarious schemes that take your data.",
    "\"This is limited to the cost of the book, but my concern would be, you know, next month it’s going to be another book or 50 bucks or 100, you know…how much are you going to put into this for?” Brooks said.",
    "Robert FitzPatrick is the author of “Ponzinomics: The Untold Story of Multi-level Marketing,” an expert witness for pyramid scheme cases, and the president of the Pyramid Scheme Alert watch group.",
    "If you do decide to purchase a book and mail it, the United States Postal Inspection Service warns that the same federal law that prohibits lotteries also applies to chain letters and exchanges.",
    "It’s a deceptive practice at heart.”\nWhen the classic structure of a pyramid scheme is visualized, the number 36 is found in the second tier of the pyramid scheme, as listed in the image below.",
    "Bosley says the exchange could also be a “sifting” device, where scammers can see who is likely to share posts like this and target their social media pages or emails more often than others.",
    "“The math says that if you put in a book, you can get more than one book or many books back,” says Stacie Bosley, an associate professor of economics at Hamline University in Minnesota.",
    "You could also be required to pay restitution to victims, engage in community service or be charged with felonies depending on the severity of the crime and the state you live in.",
    "“Whether it's money, whether it's books, whether it's wine, people might not know that with something like this book exchange, it's actually considered mail fraud,” she said.",
    "There are some cases I have seen where people would pay $40 a lead for just a name like that.”\nIt can also make you susceptible to more nefarious scams going forward.",
    "“Chain letters actually evolved over time and they’re still around, usually through email, and often they don't involve any money at all,” says FitzPatrick.",
    "The third level would be multiplying how many of those 36 new people could also recruit six new followers, making the total 216 new people, and so forth.",
    "So while you might actually receive a book in return and it might not seem too nefarious, be wary of social media exchanges that promise lofty returns.",
    "I’d like to think if they knew that, they wouldn’t be so keen to participate.”\nStates have varying degrees of anti-pyramid scheme laws on the books.",
    "“They're things like ‘say a prayer and then spread it’ or pass on this poem and you'll have good luck, and if you don't, you'll have bad luck.",
    "A viral book exchange post shares many qualities of a pyramid scheme, and it’s also illegal to participate if you send something in the mail.",
    "All you have to do is buy your favorite book (just one) and send it to a stranger (I’ll send you their information in a private message).",
    "But the idea that we're trying to share with people is that maybe it's a data grab, or maybe it's someone sifting for your information.",
    "“People pay a lot of money for the contact information of people who are more likely to be vulnerable to scams,” she told VERIFY.",
    "Physically sending the books in the mail can be considered a form of gambling, and participants can also be fined for mail fraud.",
    "\"But other people are losing, because books don't have babies, and there are not just magical books that can materialize forever.",
    "The final level would require more than 13 billion people to participate, which is more than the current world population.",
    "“It’s a similar scheme, but dressed up now as a sales business for MLMs and now to smaller forms like this book club….",
    "“But absolutely, yes, they've gotten very sophisticated at using all of the tools that are available for these.",
    "“Because you're perpetrating this fraud using the U.S Postal Service, or mail courier, and it’s illegal.",
    "“This could be a sifting device for the people who are more vulnerable to other higher stakes, frauds.",
    "In the case of the social media book exchange, that initial investment would be the price of one book.",
    "The last thing you'd want to do is put your name and your contact information in that kind of system.",
    "“It doesn't seem like there's a lot of loss, maybe a $10 book or $20 book,” says FitzPatrick.",
    "“It's harder to get a lot of attention on what the consequences of sharing just a book are.",
    "I usually tell people, frankly, whether or not it’s illegal is almost irrelevant.",
    "The exchanges can be considered forms of gambling, violating U.S. lottery laws.",
    "Our experts say to look out for three general criteria:\nIs it an endless chain?",
    "Can participating in social media gift exchanges get you into legal trouble?",
    "\"The medium has changed, but the message is still the same,” says Brooks.",
    "The book would be considered the payment or prize sent through the mail.",
    "It's silly, because the chain always breaks anyway no matter what.",
    "People don't tend to know it, it's just in our daily feeds….",
    "But is it safe to participate, or are you breaking the law?",
    "You’ll receive a maximum of 36 books back to you, to keep.",
    "“Buy a book, read it, and keep it or give it to a friend.",
    "“My advice as far as the book scheme goes?” Brooks said.",
    "As for the books, our experts say to play it safe.",
    "What you’re promised in return is up to 36 books.",
    "But the moment you pay, that's when it changes.",
    "But don't, don't get involved in this thing.”",
    "Is there any type of recruitment involved?",
    "That's not illegal, and it’s innocent.",
    "You can be anywhere in the world.",
    "But you didn't pay anything.",
    "Do you have to pay to play?"
  ]
}