{
  "id": 6316,
  "mediaId": 4043,
  "date": "2022-02-10",
  "headline": "After 174 years based in London, why the 'man from the Pru' is heading for Asia",
  "image": "https://e3.365dm.com/22/02/1600x900/skynews-prudential-man-from-the-pru_5669362.jpg?20220210163247",
  "link": "https://news.sky.com/story/after-174-years-based-in-london-why-the-man-from-the-pru-is-heading-for-asia-12538352",
  "mediaOutlet": "Sky News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "It is tempting to speculate that whoever does - Mark FitzPatrick, the chief financial officer and chief operating officer, will become interim chief executive but has asked not to be considered for the role on a permanent basis - may eventually shift the company's primary stock market listing to Asia.",
    "His two immediate predecessors both went on to high-powered jobs elsewhere with the highly-regarded Tidjane Thiam going on to become chief executive of Credit Suisse while, before him, Mark Tucker went on firstly to run the Asia-based insurer AIA and has since become chairman of HSBC.",
    "Analysts at JP Morgan told clients in a note: \"From our conversations with investors, it is clear that the lack of an Asia-based and focused management team has acted as a drag on the stock, particularly when comparing Prudential to key Asian peers.",
    "But news that the next chief executive will be based in Asia is sure to reignite speculation that the Pru's London head office, just around the corner from the Bank of England at Angel Court, will be de-emphasised.",
    "Most day-to-day operations are already run out of Hong Kong and the latest move will add to speculation that the grand old FTSE 100 company may move its prime stock-market listing away from the City too.",
    "He told analysts at the company's results presentation last August: \"In the markets with the largest economies - China, India, Indonesia, and Thailand - we see the greatest growth opportunities.",
    "\"In China, already the largest life market in Asia and the biggest market in terms of expected growth, our footprint covers over 80% of the wealth and life premiums written of the country.",
    "The company currently has dual headquarters in London and Hong Kong but most of the day-to-day operations are run out of the latter and around 60% of head office roles are based there.",
    "Mr Wells, who studied science at San Diego state university and who at 6'5\" is one of the tallest chief executives in the FTSE 100, has been with the Pru since joining Jackson in 1995.",
    "The business, founded in 1848 in London's Hatton Garden to provide life insurance to the burgeoning Victorian middle classes, has spent the last half-decade or so breaking itself up.",
    "\"He has overseen two strategic demergers and a successful equity raise on the Hong Kong Stock Exchange, whilst steering the group through the unprecedented events of the pandemic.",
    "The company said it was currently conducting a search for his successor and that whoever got the job would, reflecting the \"refocused nature of the business\", be based in Asia.",
    "Shriti Vadera, chair of Prudential, praised his \"outstanding contribution\" to the Pru over the last 26 years and particularly as chief executive for the last seven years.",
    "Third Point, which claimed at one point to be the Pru's second-largest shareholder, also urged the insurer to tap more local talent in Asia for its executive team.",
    "More from Business\nIt announced that Mike Wells, chief executive since 2015 and the man who oversaw the Pru's two break-ups, is to step down at the end of March.",
    "\"We're also number one in the fast-growing Sharia segment, where the size of the opportunity is huge, with Muslims making up over 85% of the entire population.\"",
    "The latter business, which comprises the Pru's old UK operations and the fund manager M&G, listed as a separate company in October 2019 under the M&G banner.",
    "The Pru is currently listed in London, New York, Hong Kong and Singapore and in September last year raised HK$18.8bn (£1.77bn) from investors in Hong Kong.",
    "\"We continue to see huge opportunities and potential in India, which is the second largest contributor to Asia GDP growth and an underpenetrated market.",
    "Mr Wells, a passionate music fan who owns a ranch just outside Nashville and who collects Gibson guitars, will leave with plaudits ringing in his ears.",
    "The hedge fund Third Point, headed by the renowned activist investor Daniel Loeb, has been calling for a while for the Pru to shut its London office.",
    "It announced in 2018 that it would split itself into two businesses, one focused on its international operations and the other focused in the UK.",
    "Last year saw it demerge Jackson, its US business and part of the Pru since 1986, in order to concentrate on its operations in Asia and Africa.",
    "A full departure of the Pru for Asia would certainly provoke more soul-searching about London's future as a global financial services sector.",
    "Of the top ten investors, just three - Edinburgh-based Walter Scott & Partners and Baillie Gifford, and London-based Schroders - are British.",
    "It would be no surprise to see Mr Wells take up one more executive role before going off to spend more time with his guitars.",
    "Mr Wells, who was born in Canada but who is a US citizen, said at the time that there were good reasons to remain in London.",
    "Mr Wells made very clear early on in his tenure that Asia represented the most exciting growth opportunities for the group.",
    "\"Not only do we have a fast-growing business, but we also have the opportunities for growth there that other firms do not.",
    "Baroness Vadera said: \"He has led the group through one of the most significant periods of change in its 174-year history.",
    "\"In Indonesia, we're the number one insurer in the world's fourth most populous nation with the largest economy in Asia.",
    "\"In India, we're the major investor and a top three player in both the life insurance and asset management sectors.",
    "The Prudential, one of the grandest old names in British insurance, has been on quite a journey in recent years.",
    "\"This is an opportunity for Prudential to hire or promote a manager with local relationships and knowledge.\"",
    "As for Mr Wells, it will be interesting to see where he ends up next, as he is certain to be in hot demand.",
    "The news has certainly been well-received by investors and, at one point, Pru shares were ahead by 3%.",
    "The Pru's journey to its ultimate Asian destination has been well sign-posted.",
    "The vast majority of its leading shareholders are already American or Asian.",
    "For the standalone Prudential, though, the separations did not end there.",
    "\"We believe we have some unique advantages and opportunities for growth.",
    "More recently, he has sounded just as enthusiastic, if not more so.",
    "\"The board and I wish him every success in the future.\"",
    "Either way, it is the end of an era at the Pru.",
    "Today, the company took the next logical step.",
    "But it feels inevitable."
  ]
}