{
  "id": 6324,
  "mediaId": 2637,
  "date": "2022-02-06",
  "headline": "Tom Hoge emerges from pack at Pebble Beach for first PGA Tour win",
  "image": "https://storage.googleapis.com/pmd-stage-northamerica-northeast1-dcs-static-files/10.3.1/websites/images/np/favicon-np.ico",
  "link": "https://nationalpost.com/pmn/sports-pmn/tom-hoge-emerges-from-pack-at-pebble-beach-for-first-pga-tour-win",
  "mediaOutlet": "news.nationalpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3509,
    3867,
    3899,
    4698,
    797,
    816,
    4887,
    4963
  ],
  "sentences": [
    "Article content\nTom Hoge made four birdies on the back nine to pass Jordan Spieth and claim his first PGA Tour victory at the AT&T Pebble Beach Pro-Am on Sunday in Pebble Beach, Calif.\nOne of three co-leaders after 54 holes, Hoge rebounded from a double bogey at the par-3 fifth hole to card a 4-under-par 68, landing him at 19-under 268 for the tournament.",
    "Andrew Putnam, who entered Sunday tied atop the leaderboard with Hoge and Hossler, only managed a 1-over 73 to tie for sixth at 14 under with Joel Dahmen (72) and England’s Matt Fitzpatrick (68).",
    "“Really I was just trying to get two good looks for birdie on 17 and 18 and still expected Jordan to make a birdie or eagle on 18 coming up the stretch,” Hoge said.",
    "When I hit it I initially thought it was short, but went right in the middle, it was pretty nice.”\nBeau Hossler posted a 71 to finish alone in third at 16 under.",
    "“I’ve always kind of got myself into position and then just felt a little bit uncomfortable on Sundays out there,” Hoge said on the CBS broadcast.",
    "“So finally today I felt great the whole day and felt real calm, kind of standing over those putts you need to make down the stretch.",
    "Cantlay birdied three of his first six holes Sunday to tie for the lead, but he faded down the stretch and consecutive bogeys at Nos.",
    "That proved two shots better than Spieth, the three-time major winner who spent some time alone in front on the back nine Sunday.",
    "You work through so many hard times to be here and to finally pull one off feels incredible.”\nHe rolled his approach at No.",
    "17 bounced by the cup and stopped 5 feet away, but he blew his par save past the hole and dropped out of the tie with Hoge.",
    "A tee shot into the sand led to a costly bogey for Spieth at the par-3 17th as Hoge surged past him.",
    "That moved him to 18 under to tie Spieth, who was dealing with a sand shot one hole ahead of him.",
    "17 by converting a 22-foot, left-to-right putt for birdie to give himself the two-stroke cushion.",
    "Article content\nHoge, 32, finally broke through after playing on tour since 2015.",
    "You never expect to make that putt, a big swinging downhill putt like that.",
    "Troy Merritt (67) and Patrick Cantlay (71) tied for fourth at 15 under.",
    "Spieth carded a final-round 69 at Pebble Beach Golf Links.",
    "16 to 9 inches away from the pin for a tap-in birdie.",
    "Article content\nHoge capitalized at No.",
    "15 and 16 took him out of the running.",
    "Spieth’s second shot at No.",
    "“Putt was kind of a bonus.",
    "–Field Level Media",
    "It’s awesome."
  ]
}