{
  "id": 6342,
  "mediaId": 2728,
  "date": "2022-02-03",
  "headline": "BHP discusses Jansen Project contract and individual opportunities",
  "image": "https://www.thestar.com/assets/img/thestar-ribbon.png",
  "link": "https://www.thestar.com/news/canada/2022/02/03/bhp-discusses-jansen-project-contract-and-individual-opportunities.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Durling",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Site testing and inspection services (non-destructive testing, steel etc) has the estimated pre-qualification start in early August, estimated RFP issue in late-October, and the award is estimated for mid-March, 2023,\nCustom brokerage services has the estimated pre-qualification start in early Oct, estimated RFP issue in early January, 2023, and the award is estimated for early May, 2023.",
    "“Right now we are in process for the 2022 contracts and the 2023 contracts so there are a lot of opportunities right now for local Saskatchewan and Indigenous businesses to actively participate in these upcoming opportunities.”\nCurrently, 55 per cent of procurement packages and 15 per cent of contract packages have been awarded.",
    "We expect our contractors and suppliers to buy into our culture and our philosophy and our work, thereby ensuring diversity, integrity and local involvement in all that we and they do.”\nBusinesses interested in contract opportunities or supplying to Jansen should register and create profiles on applicable databases.",
    "“We really encourage organizations out there to get prequalified well in advance of RFPs or the request for proposals being issued because when we issue an RFP, organizations in our databases that meet the criteria for the package are contacted and notified that an RFP has been issued,” Hannah said.",
    "“Since prequalification is specific to a contract package that would have to be completed each time a company bids on a specific package.”\nDatabase registration for east central Saskatchewan businesses can be done on the Mid-Sask Municipal Alliance website at msmaregion.com/business-database.",
    "Brumwell said all contractors are expected to provide a diversity, inclusion and local element plan that’s approved by the project\n“It’s not just who can provide the work at the cheapest, it’s a competitive bid process that includes prioritizing factors many companies don’t.",
    "The Feb. 3 event, hosted by the Saskatchewan Chamber of Commerce, and the Humboldt and District Chamber of Commerce, featured Lindsay Brumwell with BHP and Ben Hannah, project director for Jansen with Hatch Bantrel Joint Venture (HBJV).",
    "“This still means there’s still room and a lot of opportunity to come.”\nOver the coming years, Brumwell said they will be focusing on apprenticeships and training, to help locals take advantage of opportunities at mine operations.",
    "Following this, camp management, catering, maintenance and janitorial services opens up the estimated pre-qualifications in mid-Feb, the estimated RFP issue is in mid-May, and the award is estimated for mid-November.",
    "For phase one operations in 2027, BHP plans to have construction complete and 600 workers hired for operations with 65 per cent of the jobs at the mine site and 35 per cent of the jobs at the Saskatoon head office.",
    "“Potential contractors that meet the necessary technical requirements of the scopes of work are invited by our contracts and procurement team to prequalify for that package – that individual package,” Hannah said.",
    "Upcoming contract opportunities include site services, with an estimated pre-qualification start in mid-January 2022, estimated RFP issue in early March, and the contract itself being awarded in early August.",
    "Individuals wishing to apply are asked to go to bhp.com, then “job alerts.” Brumwell said that the permanent Jansen team operations will be posted there first, which will be the best source to be informed.",
    "More than 50 per cent of the engineering is complete, and BHP has nearly completed the construction and lining of two approximately one kilometre deep shafts with just two per cent left to go.",
    "Workers looking to join any of the contracted companies are asked to check out the HDJV website at teamjansen.hdjv.ca to see what companies they have on-site and on contract.",
    "Brent Fitzpatrick, executive director of the Humboldt chamber, moderated a question and answer period, relaying previously given questions from the business community.",
    "The smart endpoint installation has the estimated pre-qualification start in mid-March, estimated RFP issue in mid-August, and the award is estimated for late-May.",
    "Hannah said the first step for businesses interested in contract opportunities or supplying to Jansen should register and create profiles on applicable databases.",
    "Site security services has the estimated pre-qualification start in late-March, estimated RFP issue in mid-June, and the award is estimated for early November.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "For questions, residents were asked to contact their local BHP corporate affairs representative via email at Potash.CommunityEnquiry@bhp.com.",
    "Prequalification is done for specific contract packages, meaning it would need to be done each time a company bids on a specific package.",
    "“With six years of construction ahead, we’re standing at an overall three per cent progress to completion,” Brumwell said.",
    "“We’ve already started signing contracts with about 15 per cent being awarded for Jansen stage one to date,” Hannah said.",
    "A special virtual presentation detailed how local businesses can participate in stage one of the Jansen Potash Project.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Hannah said the four databases will be used to ensure all options are being considered on the contracts.",
    "The second is to complete a prequalification form, which takes about four weeks to be registered.",
    "Registration for Indigenous-owned businesses or workers can be done at exportdata.ca.",
    "Registration for Saskatchewan based companies can be done at simsa.ca/join/.",
    "Registration for companies outside of Saskatchewan can go to hbjv.ca.",
    "Among them were the timeline of upcoming contracts.",
    "The Star does not endorse these opinions."
  ]
}