{
  "id": 6370,
  "mediaId": 2658,
  "date": "2022-01-06",
  "headline": "A year later, the Hill ‘is no longer the safest place'",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/01/06/a-year-later-the-hill-is-no-longer-the-safest-place-495624",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1951,
    2277,
    2629,
    2883,
    3267,
    3434,
    4527,
    262,
    5371
  ],
  "sentences": [
    "The Black Women’s Congressional Alliance are hosting a reflection call at noon with current and former Hill staff for “anyone who could use encouragement.” The House’s Black Congressional Associates and Senate Black Legislative Staff Caucus are teaming up to host a mental health check-in on zoom at 1 p.m.\n650 STAFFERS STRONG — The Congressional Management Foundation has dug up data from a decade-old survey of Hill staffers on job engagement and satisfaction, publishing 650 responses they got to the open ended question “What does working in Congress mean to you?” So much has changed since 2011, but are the motivations behind Congressional staff the same?",
    "There’s a “general concoction of frustration, anger and anxiety” one Hill aide said, and their friends and coworkers are still struggling, seeking therapy and sometimes overwhelmed by “really intense anger towards the people who perpetrated this or encouraged it.”\nBut some Republican staff, as news coverage and personal reflections of the attack and ensuing trauma became inescapable in recent days, have hardened their position that Democratic lawmakers, staff and the Capitol press corps are overblowing last year's events and mock the toll they took on those who experienced the attack first hand.",
    "CLEANUP IMMORTALIZED — Rep. Andy Kim (D-N.J.) thinks of the Capitol Rotunda as the “most beautiful room in the most beautiful building” in America and a “physical manifestation of our Constitution.” But when he found himself standing there on the evening of Jan. 6, 2021, just hours after a violent mob of insurrectionists had, in his words, “desecrated and disrespected” the historic monument, all he could think to do was drop to the ground and start to help clean it up.",
    "QUICK LINKS\nPentagon spending stuck in neutral even as lawmakers back budget boost, from Connor O’Brien and Jennifer Scholtes\nMcConnell cracks door to Electoral Count Act reform, from Burgess\nThe GOP ‘Traitor’ Trump Hasn’t Managed to Bully, by Michael Kruse in POLITICO Magazine\nTODAY IN CONGRESS\nThe House convenes at noon for a pro forma session, which will include a moment of silence in observance of the events of January 6, 2021.",
    "He’ll declare that his predecessor, Donald Trump, had “singular responsibility” for the attacks and “forcibly push back on the lie spread by the former president in an attempt to mislead the American people and his own supporters, as well as distract from his role and what happened,” White House press secretary Jen Psaki told reporters Wednesday.",
    "… Sending a wedge into the trans-Atlantic relationship right now would not be productive if our end goal is to try to save Ukraine from an invasion.” Cruz was already calling out Democrats for what he called a “capitulation” and argued that they would support his bill if Donald Trump were still in office.",
    "While the country and world watched live on TV as a violent mob laid siege to an iconic symbol of American democracy, members of the Capitol Hill community — staff, lawmakers, clerks, cooks, custodians, police, reporters — experienced something different, more personal.",
    "The House is out this week, and few Republicans are expected to trek to Washington to the Jan. 6 events, which Minority Leader Kevin McCarthy (R-Calif.) has said Democrats are “using it as a partisan political weapon to further divide our country.\"",
    "The attendance of President Joe Biden and Vice President Kamala Harris for remarks this morning is just another high-pressure assignment the short-staffed force is tackling, all while officers process their own violent experiences one year ago.",
    "Today, Capitol Police are geared up to implement a security plan for the anniversary, despite Covid-19 “wreaking havoc” on the force by putting dozens of officers out of commission while they isolate, according to USCP Chief Thomas Manger.",
    "— A significant number of Senate Republicans, including Minority Leader Mitch McConnell (R-Ky.), Sen. Mitt Romney (R-Utah), and others are heading to Atlanta together for the funeral of widely beloved Sen. Johnny Isakson (R-Ga.).",
    "That includes a moment of prayer, a series of member testimonials, and a prayer vigil on the Capitol steps — all of which Pelosi’s office said would have “a spirit of unity, patriotism and prayerfulness.”\nWHERE ARE REPUBLICANS?",
    "— Senate Democrats are poised to reject Sen. Ted Cruz’s (R-Texas) legislation to sanction the Nord Stream 2 pipeline when it gets a vote next week, lining up behind the president despite their previous support for sanctions.",
    "They are holding a press conference this afternoon billed as “a Republican response” to promote a baseless conspiracy theory that federal law enforcement, informants and FBI plants were key instigators of the violence.",
    "Wyoming Republican Rep. Liz Cheney, the vice chair of the select committee investigating the Jan. 6 2021 attack on the Capitol, will be on hand today and is booked widely on television and radio throughout the day.",
    "Whether they crouched behind a barricaded office door or watched wide-eyed from home, the impacts of that day continue to reverberate for both young Hill staffers and those who also lived through 9/11 and anthrax.",
    "Democrats say they don’t want to undercut Biden as he navigates precarious talks with Russia over its possible invasion of Ukraine, and they don’t want to do anything that would undermine trans-Atlantic unity.",
    "Some House staffers told Huddle they feel pressure to show up at the Capitol today to staff their bosses through the full schedule of commemoration events, even though they’d rather skip the commemoration.",
    "On the Senate side, staff can drop in to “reflect gratitude for our fellow staff” and sign books for Capitol Police, join Chaplain Barry Black for a message of hope and healing or visit with therapy dogs.",
    "A year later, the Hill ‘is no longer the safest place'\nBy KATHERINE TULLY-MCMANUS\n01/06/2022 07:49 AM EST\nPresented by Connected Commerce Council\nWith Sarah Ferris, Andrew Desiderio and Nicholas Wu.",
    "TAKE CARE — The House and Senate are pushing out support offerings for staff throughout the day today, from in-person gatherings and opportunities to connect to virtual spaces for staff to reflect.",
    "ANXIETY REIGNS — Republican and Democratic staff told your Huddle host they were feeling anxious as this anniversary approached, not knowing how they’d find themselves feeling a year to the day.",
    "Andrew has much more on the situation: Dems shift gears on Russian pipeline, backing Biden against Cruz’s gambit\nHUDDLE HOTDISH\nBicycle Diaries…Chuck Schumer took a bike ride with David Byrne.",
    "Your Huddle host was evacuated from the Senate chamber, not yet knowing that we were a few seconds separated from the surging throng that U.S. Capitol Police officer Eugene Goodman diverted.",
    "Speaker Nancy Pelosi (D-Calif.) and her leadership team have planned a lineup of events focused largely on those who endured the attack in the Capitol, rather than those behind the violence.",
    "“This is no longer the safest place you could possibly be.” More from your Huddle host: One year later, congressional staffers reckon with their new normal\nAll of this isn’t an abstraction.",
    "1 p.m. Pelosi, Senate Majority Leader Chuck Schumer (D-N.Y.) and Librarian of Congress Carla D. Hayden host a conversation with historians Jon Meacham and Doris Kearns Goodwin about Jan. 6.",
    "Las Vegas Lineup…Harry Reid’s funeral will feature musical performances by Carole King and Brandon Flowers, lead singer of The Killers, in addition to a eulogy from President Barack Obama.",
    "Jan. 6 Anniversary\nBIDEN BRINGS THE BLAME — The president still considers himself a “Senate guy” and returns this morning to mark one year since the deadly siege on the U.S. Capitol.",
    "POLITICO did one-on-one interviews with thirteen lawmakers from both chambers and both parties about the effects of Jan. 6 on each of them and on the legislative process.",
    "A year ago today their workplace, the halls they’ve walked a thousand times, the usual meeting spot for a coffee run, were stained with tear gas, bear spray and blood.",
    "Fellow journalists and friends were attacked by rioters and colleagues left jobs they loved in the weeks and months after, pushed to the brink by the experience.",
    "“The only conceivable reason they might vote no is if they make the cynical decision to put partisan loyalty above U.S. national security interests,” Cruz said.",
    "TODAY’S QUESTION from Sue: Which suffragist was selected to represent their state in the U.S. Capitol National Statuary Hall and what state are they from?",
    "That leaves an open lane for GOP messaging on the anniversary and Reps. Mat Gaetz (R-Fla.) and Marjorie Taylor Greene (R-Ga.) will fill the vacuum.",
    "That is on top of the toll of the continued coronavirus pandemic, escalating what has always been a relentless and high-pressure work environment.",
    "TRIVIA\nWEDNESDAY’S WINNER: Sue Gander correctly answered that Walter Johnson played for the Senators and ran for Congress in 1940 (and lost.)",
    "Sen. Jeanne Shaheen (D-N.H.), a bellwether on this issue given her strong opposition to the pipeline, told Andrew she’s leaning against it.",
    "NOT JUST A SYMBOL — There’s a heaviness today on the Hill as staffers grapple with stubborn trauma from last year’s attack on the Capitol.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Thursday, January 6, where it could be a tough day for many.",
    "Rep. Ann Kuster (D-N.H.) believes there's still video evidence out there that could show how close the Capitol came to mass casualties.",
    "Don’t miss the whole project, In Their Own Words: Members of Congress Look Back and Forward, from Anthony, Olivia, Sarah and Marianne.",
    "Now, a piece of Kim’s famous gesture will be featured in the Smithsonian’s exhibit that tells the story of the Jan. 6 insurrection.",
    "On the House side, the Office of Employee Assistance has expanded virtual and in-person drop-in hours for staff who want support.",
    "IN THEIR OWN WORDS — Sen. Chris Murphy (D-Conn.) has upended how he operates around Connecticut due to security concerns.",
    "In this video from JC Whittington and Monica Akhtar, Kim reflects on his personal contribution to the legacy of Jan. 6.",
    "I was here last year for all that,” one Capitol food service worker announced yesterday while making sandwiches.",
    "The Senate convenes at 10:30 a.m. and holds a moment of silence at noon.There will be no roll call votes today.",
    "2:30 p.m. Pelosi and Rep. Jason Crow (D-Colo.) host a session featuring testimonials from members of Congress.",
    "The tension between those points of view, of course, has colored every day since the attack on the Capitol.",
    "5:30 p.m. Pelosi, Schumer and members of Congress will hold a prayer vigil on the Capitol’s center steps.",
    "There are also virtual mindfulness sessions and virtual “connect and reflect” rooms throughout the day.",
    "“I think this place is worth saving,” she said, her reason for why she is running for reelection.",
    "Staff organizations are hosting their own programming, with Black staffers taking the lead.",
    "Rep. Brian Fitzpatrick (R-Pa.) isn’t sure people understand just how fragile democracy is.",
    "AROUND THE HILL\n9 a.m. Biden and Harris speak at the Capitol about the Jan. 6 attacks.",
    "10 a.m. Pelosi holds an off-the-record “moment of reflection” on the House floor.",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "is refraining from snarky tweets and hopes colleagues on both sides follow suit.",
    "“People do live inside of this place in a little more fear,” said a House aide.",
    "“It’s been a shitty year,” a different House staffer told your Huddle host.",
    "This is about a Cruz-Trump agenda to break up the trans-Atlantic alliance.",
    "Lead with kindness and check in on Hill friends and colleagues.",
    "And Sen. Lisa Murkowski (R-Alaska) was scared and angry.",
    "Photographs of Kim quickly went viral on social media.",
    "Sen. Chris Murphy (D-Conn.): “This isn’t about Russia.",
    "This is not a normal work environment.”\nGOOD MORNING!",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "GET HUDDLE emailed to your phone each morning.",
    "McCarthy won’t participate in today’s events.",
    "Send your answers to ktm@politico.com.",
    "Read through the responses HERE.",
    "Rep. Kelly Armstrong (R-S.D.)",
    "“This is not normal.",
    "I took tomorrow off.",
    "KILL THE BILL?",
    "“Nuh, uh.",
    "Hell no."
  ]
}