{
  "id": 643,
  "mediaId": 2586,
  "date": "2022-04-17",
  "headline": "Popular Former Bills QB Could Be Roethlisberger’s Replacement: Insider",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Ryan-Fitzpatrick-e1650245823580.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-fitzpatrick-steelers-quarterback/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1509,
    1718,
    2609,
    3069,
    3583,
    4688,
    160,
    708,
    823
  ],
  "sentences": [
    "WFT\n— SportsCenter (@SportsCenter) March 18, 2021\nHaskins’ death could lead the Steelers to find a rookie quarterback as a developmental project, and CBS Sports Radio’s Andrew Fillipponi believes the team could sign a more steady veteran who has a track record of helping develop young quarterbacks.",
    "“He does a good job of communicating with coaches, with players, gaining an understanding of what we’re trying to do schematically and his role in it, gaining a rapport with the receivers specifically, trying to do the things that we want him to do in the drill work that we do.”\n?",
    "“My goal throughout free agency was find a way to get back on the field and going into a situation where I could win a starting job and use my talents on the field.”\nMitch Trubisky is going to shock a lot of people next year.",
    "Steelers May Sign Another Quarterback\nThe tragic death of 24-year-old quarterback Dwayne Haskins earlier this month shook the franchise and the entire league, and could also upend the team’s plans at quarterback.",
    "The Steelers offered no clear path forward after Roethlisberger’s retirement this offseason, though many believe that former Bills quarterback Mitch Trubisky could have the inside track to the starting job.",
    "And could help groom your rookie QB.”\nTrubisky Could Still Have the Inside Track\nAfter spending the last season backing up Josh Allen in Buffalo, Trubisky could still have the best chance for the job.",
    "The former first-round pick of the Washington Commanders had impressed coach Mike Tomlin, who praised Haskins for his work ethic and ability to learn and understand the team’s offensive scheme.",
    "2 overall pick has the strongest resume of Pittsburgh’s quarterbacks, even if Mason Rudolph does have the advantage of playing within the team’s system for the last three seasons.",
    "But a tragedy within the Steelers program could open the door for another former Bills quarterback with more experience in mentoring young signal-callers to compete for the job.",
    "#Steelers #steelersnation @steelers pic.twitter.com/5nhMVXD4i7\n— Papi (@SnakeDraftViper) March 29, 2022\nIt’s not clear what the future holds for Fitzpatrick.",
    "Two former Buffalo Bills quarterbacks could end up competing to become Ben Roethlisberger’s successor in Pittsburgh, an insider has speculated.",
    "Speaking after the Steelers signed him in March, Trubisky said he didn’t need to think about it much after getting an offer from Pittsburgh.",
    "He will turn 40 during the upcoming season, and is coming off a hip subluxation that kept him out for nearly all of 2021 for Washington.",
    "“This is where I wanted to be, play for coach [Mike] Tomlin, be a part of the rich Pittsburgh Steelers history and contribute to that.",
    "I honestly think he’s going to be one of the few QBs that actually got better from taking a backseat the last two years.",
    "He’s grown by leaps and bounds,” Tomlin said during training camp in August, via The Athletic’s Mark Kaboly.",
    "“So the Steelers could now sign a veteran free agent QB to fill-out their quarterback depth chart.",
    "“They didn’t really have to make a pitch to me or sell me on anything,” Trubisky said, via ESPN.",
    "Fitzpatrick suffered the injury in Week 1 and underwent arthroscopic surgery in December.",
    "Ryan Fitzpatrick looks on after a play in a game against the New York Jets.",
    "Trubisky also has plenty of enthusiasm for the job.",
    "I’d take a shot on Ryan Fitzpatrick,” he tweeted.",
    "Steelers QB situation isn’t as bad as some say.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "“I think he’s better than Trubisky.",
    "The former No.",
    "Dolphins\n?",
    "Bengals\n?",
    "Titans\n?",
    "Texans\n?",
    "Bills\n?",
    "Rams\n?",
    "Jets\n?",
    "Bucs\n?"
  ]
}