{
  "id": 6510,
  "mediaId": 2586,
  "date": "2022-01-21",
  "headline": "Bills QB Mitch Trubisky Emerges as Top Free Agent Candidate for Giants",
  "image": "https://heavy.com/wp-content/uploads/2021/12/GettyImages-1358632159.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-trubisky-fa-candidate-giants/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    2249,
    3583,
    3747,
    4421,
    4504,
    160,
    209,
    707,
    1004,
    5345
  ],
  "sentences": [
    "“However, there is also a world where none of the alternatives are attractive enough and the team gives Jones one more chance while the rebuild commences.”\nBears under Matt Nagy\nMitchell Trubisky as starter: 25-13 (.658)\nEvery other CHI starting QB: 9-18 (.333) pic.twitter.com/mnDxmtNmhq\nMany believe that Trubisky, the former No.",
    "https://t.co/qnMmReFnlm\n— Ryan Talbot (@RyanTalbotBills) January 21, 2022\nMatt Bove of Buffalo’s WKBW suggested that if Schoen looks to the Buffalo coaching staff for the next Giants coach — as the team is expected to interview Bills offensive coordinator Brian Daboll — then it could heighten the odds of a Trubisky signing.",
    "Obviously Trubisky has familiarity with Daboll and it’s an opportunity for him to be a starter again.”\nBills Need New Backup\nWhatever decision Schoen makes in New York, the Bills will likely be looking for a new backup quarterback next season.",
    "Trubisky joined the Bills on a one-year deal, with Buffalo’s coaching staff selling him on the idea of developing under the same staff that helped Allen make an enormous leap and then going back to compete for a starting job.",
    "As ESPN reported, Schoen replaces the retired Dave Gettleman, who had a 19-46 record and left behind a Giants roster with a number of questions, including the quarterback position and the team’s next head coach.",
    "“My immediate focus is to hire a head coach, with who I will work in lockstep with to create a collaborative environment for our football operations.”\nThe latest Bills news straight to your inbox!",
    "Sam Monson of Pro Football Focus recently ranked the Giants’ quarterback situation as the 12th-most dire in the league, suggesting that the team should be exploring all options this offseason.",
    "After Jones went down with a season-ending injury, the Giants signed second-year quarterback Jake Fromm off Buffalo’s practice squad, but he failed to make much of his opportunity.",
    "The New York Giants looked to the front office of the Buffalo Bills to find their next general manager, and some believe that Josh Allen’s backup could soon be coming with him.",
    "2 overall pick of the Chicago Bears who has backed up Allen in Buffalo this season, could be a strong option for the Giants to compete with Jones for the starting job.",
    "Mitchell Trubisky #10 of the Buffalo Bills warms up prior to the game against the Tampa Bay Buccaneers at Raymond James Stadium on December 12, 2021 in Tampa, Florida.",
    "“If Schoen brings in Daboll as the new Giants HC [that would be another great hire], I also wonder if they bring in Trubisky to compete with Daniel Jones for a year.",
    "Daniel Jones had shown flashes of strong play at times during his first three years in the league, but failed to establish himself as the permanent starter.",
    "Fromm completed just 45 of his passes in three appearances, throwing for a total of 210 yards with one touchdown and three interceptions.",
    "“With the Giants pressing the reset button, they can’t have seen enough in Jones to prevent them from exploring other options,” he wrote.",
    "— Bobby Skinner (@BobbySkinner_) January 9, 2022\nThe Giants may have also helped the Bills make a decision on another potential backup.",
    "Giants Could Sign Josh Allen’s Backup\nOne of the main tasks that Schoen faces in New York will be finding a franchise quarterback.",
    "The Giants announced on Friday that they hired Bills assistant general manager Joe Schoen as their new general manager.",
    "If I’m Schoen, I’m bringing Brian Daboll in as HC before Miami can make a play.",
    "Probably signing Trubisky as a FA to compete with Jones as well.",
    "“Now, the work begins,” Schoen said in a statement.",
    "Join the Heavy on Bills newsletter here!"
  ]
}