{
  "id": 6545,
  "mediaId": 2586,
  "date": "2022-01-27",
  "headline": "Bills GM Gives Answer on Cole Beasley’s Future With the Team",
  "image": "https://heavy.com/wp-content/uploads/2022/01/Cole-Beasley-1-e1643329811143.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-gm-cole-beasley-future/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "Beasley Likely Coming Back\nSpeaking to reporters for close to an hour and growing emotional at times about the heartbreaking end to the season, Beane said that Beasley remains in the team’s plans for 2022, though admitted he had not yet talked to the 32-year-old receiver to discuss what he had in mind.",
    "Cole Beasley has been one of the most important weapons for quarterback Josh Allen through the last three seasons, but saw his production drop off a bit due to lingering injuries and the rise of other targets like Gabriel Davis and Isaiah McKenzie.",
    "Some Belive Beasley Reached the End With Buffalo\nDespite the reassurances from Beane that Beasley remains in the team’s plans for the future, there had been growing speculation among insiders that the team could move on in the offseason.",
    "Because I know what his number is on the books for the upcoming years and we can just build around it.”\nBeasley saw a growing threat to his slot targets from McKenzie, who saw his role grow beyond being simply a jet sweep specialist.",
    "With Beasley out against the New England Patriots on December 26, McKenzie made 11 catches for 125 yards and a touchdown, helping propel the team to a 33-21 victory that gave them control of the division.",
    "“Bills receiver Cole Beasley has been fined multiple times for Covid protocol violations for a cumulative sum in the range of $100,000 per league and union sources,” Mortensen tweeted.",
    "Bills GM Brandon Beane 'would anticipate' WR Cole Beasley being back https://t.co/2tj3BODbDS\nBeasley’s 2021 season brought some of his lowest output since joining the Bills in 2019.",
    "Ed Oliver: 71.8 pic.twitter.com/1AUpHS4rVu\n— PFF BUF Bills (@PFF_Bills) January 24, 2022\nIn speaking to reporters, Beane admitted that the team would not be able to keep everyone.",
    "As Joe Buscaglia of The Athletic noted, the cap is expected to rise from $182.5 million to $208 million, but the Bills would still only be $3 million under that projected cap.",
    "Though Beasley remains under contract through the next season, releasing him before the season would leave the Bills with a relatively manageable $1.5 million dead cap hit.",
    "Buffalo Bills general manager Brandon Beane has a lot of hard decisions to make this coming offseason, but one open question at wide receiver may already have an answer.",
    "Though he had 82 catches — the same number as last season — Beasley only had 693 yards and one touchdown compared to the 967 yards and four touchdowns he had last year.",
    "ESPN’s Chris Mortensen reported that Beasley repeatedly broke league rules regarding unvaccinated players, leading to some massive fines.",
    "Some questioned whether the Bills could part ways with Beasley in the coming offseason, but Beane seemed to strike down that speculation.",
    "“Cole, he’s still under contract so we didn’t, I didn’t sit down with Cole at the end and see where he was at or things like that.",
    "Beane had already acknowledged in his year-end press conference that the team has some work in staying under the cap this season.",
    "Beasley also ran into some controversy with his apparent inability to stick to the league-mandated protocol regarding COVID-19.",
    "He did become a reliable target in Sunday’s 42-36 loss to the Kansas City Chiefs, making six receptions for 60 yards.",
    "“Beasley was fined $14,600 in August on a day league officials were in the facility to review the protocols.”",
    "“There may be some guys on this team that I want to keep, but I can’t keep them all,” Beane said.",
    "But I would anticipate Cole being back,” Beane said, via the Buffalo News.",
    "Cole Beasley leaves the field after a loss to the Kansas City Chiefs.",
    "“We now have paid Josh (Allen) — which is good.",
    "The latest Bills news straight to your inbox!",
    "Highest graded #Bills vs Kansas City (min.",
    "Join the Heavy on Bills newsletter here!",
    "Gregory Rousseau: 72.0\n5??",
    "Gabriel Davis: 92.7\n2??",
    "Cole Beasley: 76.2\n4??",
    "Josh Allen: 92.2\n3??",
    "25% snaps)\n1??"
  ]
}