{
  "id": 6565,
  "mediaId": 2732,
  "date": "2022-01-30",
  "headline": "Alex Highsmith vows continued improvement for Steelers in ‘22",
  "image": "",
  "link": "https://triblive.com/sports/alex-highsmith-vows-continued-improvement-for-steelers-in-22/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Adamski",
  "authorUrl": "https://triblive.com/author/chris-adamski/",
  "termIds": [
    2315,
    3773,
    4507,
    671,
    823
  ],
  "sentences": [
    "“I just want to continue to get better,” Highsmith said during a video conference call with media earlier this month, “no matter if I am a Pro Bowler or All-Pro, I want to always continue to get better.”\nIf Highsmith is setting his sights that high, he only needs to look across the locker room for a role model.",
    "“I’m not happy with the way I’m playing, production-wise,” Highsmith said.https://t.co/4wv8mpNOwZ\n— Tribune-ReviewSports (@TribSports) November 11, 2021\nBy all measures and indications, Highsmith proved himself a perfectly capable, more-than-adequate NFL edge defender.",
    "And while it’s highly unlikely for Highsmith to have a career that ends up usurping that of three-time reigning All-Pro outside linebacker T.J. Watt, his teammate has taken note of Highsmith’s ascension as a player over the past two years.",
    "3 OLB for most of 2020, Highsmith tripled his sacks (two to six) and tackles for loss (five to 15) and boosted his overall tackles production by more than 50% (48 to 74 total tackles, 30 to 46 solo tackles).",
    "And I’m excited to keep watching his progression.”\nHighsmith finished the season tied with All-Pro lineman Cameron Heyward for the second-most tackles for loss on the Steelers behind Watt.",
    "Still, Highsmith beats himself up for his sack total, which paled in comparison to Watt’s NFL record-tying 22 ½ and was less than half of the 14 Highsmith had as a senior at Charlotte.",
    "“He eats up blocks for a lot of people, whether it’s inside linebackers, he takes the slides in pass protection, which allows guys to go single one-on-one matchups against pass pro.",
    "Though he’s still playing a secondary role behind stars such as Watt, Heyward and safety Minkah Fitzpatrick, his spot on the Steelers’ defense has potential to become longterm.",
    "“And he’s just a guy that’s very selfless and is doing whatever possible to help the team.”\nHighsmith talks like a player that belies his NFL experience level of two seasons.",
    "Speaking earlier this month in the wake of the end of the Steelers’ season, Highsmith vowed he’d be better in Year 3 at all aspects of his game.",
    "Those two aspects of an edge defender’s game aren’t as sexy as sack totals, but they are appreciated by Steelers coaches and teammates.",
    "His playing time increased, up to 76% of the Steelers’ defensive snaps, despite missing a Week 3 game because of a groin injury.",
    "“I can’t wait,” he said, “to get back to work.”\nHey, Steelers Nation, get the latest news about the Pittsburgh Steelers here.",
    "Over the course of four years in college, Alex Highsmith went from walk-on to among the best at his position in the country.",
    "Being a walk-on in college, I know where I came from — the bottom — so I want to continue to get better, no matter what.",
    "I will always say after a game — two sacks, no sacks, no matter how I played — I know I can always play better.",
    "“He continues to improve, and I know he’s not satisfied when he’s the last guy off the field every day.",
    "But Highsmith also is earning a reputation as a stout run stuffer and being reliable in coverage.",
    "“That’s the last thing I want to do in the coming year…\n“That’s just the mindset I have.",
    "”\nIt’s reasonable to conclude Highsmith got better from his rookie to his second season.",
    "“I just don’t want to get complacent,” the Pittsburgh Steelers outside linebacker said.",
    "So … that’s going to be my mindset of this offseason: just to continually get better.",
    "You can contact Chris by email at cadamski@triblive.com or via Twitter .",
    "“He’s taken leaps and bounds,” Watt said of Highsmith late this season.",
    "Highsmith’s Pro Football Focus grade also went up from 2020 to ‘21.",
    "Highsmith, though, has higher aspirations for his NFL career.",
    "Highsmith also was third in QB hits and fifth in tackles.",
    "What can he do over a similar timeframe in the NFL?",
    "Chris Adamski is a Tribune-Review staff writer.",
    "A full-time starter after serving as the No.",
    "That placed him third nationally in 2019.",
    "“He (also) eats up blocks,” Watt said.",
    "Categories: Sports | Steelers/NFL",
    "He’s always studying film hard.",
    "The sky’s the limit for him."
  ]
}