{
  "id": 6582,
  "mediaId": 5329,
  "date": "2022-01-23",
  "headline": "Meet the 2022 Queen of the Snows candidates of the St. Paul Winter Carnival",
  "image": "https://www.twincities.com/wp-content/uploads/2022/01/Queen-of-Snows-2020-e1642700295162.jpg?w=1024&h=684",
  "link": "https://www.twincities.com/2022/01/23/2022-st-paul-winter-carnival-queen-of-snows-candidates/",
  "mediaOutlet": "St.Paul Pioneer-Press ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Molly Guthrey",
  "authorUrl": "https://www.twincities.com/author/molly-guthrey/",
  "termIds": [
    0
  ],
  "sentences": [
    "Royal Coronation of Boreas Rex LXXXV and Aurora, Queen of the Snows\nWhen: 8 p.m. Friday, Jan. 28 (social hour, 5:30 p.m.; dinner, 7 p.m.; doors open for general admission seating at 7:30 p.m.)\nWhere: St. Paul RiverCentre\nCost: $25 with a Winter Carnival button; dinner is $90 for members, $105 for nonmembers\nNote: Seating is very limited.",
    "Alyssa Grythe, 25, Cottage Grove, sponsored by Opportunity Community Services, Inc.: Grythe is currently an assistant program manager at Opportunity Community Services Inc. in Oakdale, where she assists with relocation services and coordination and targeted case management.",
    "In her free time, she enjoys laughing with family, collaborating as a coordinator for the Mainstreet Foundation, honing her photography skills and breaking a sweat in her new pursuit, mastering aerial skills.",
    "DeMaster, who has a bachelor’s degree from the University of St. Catherine and a master’s degree in public policy from the University of Minnesota, manages research and program evaluation for Ramsey County.",
    "In her spare time, Barnes enjoys scrapbooking at her mom’s crafting retreat, exploring sites of the Minnesota Historical Society and volunteering in her community by mentoring young adults.",
    "In her spare time, she enjoys volunteering for Special Olympics Minnesota or enjoying the great outdoors with her husband, Brad, and their dog, a three-pound teacup Yorkie named Harley.",
    "Sunny Chen, 23, of Shoreview, sponsored by Ideal Printers, Inc. Chen graduated in 2019 from the University of Wisconsin-Eau Claire with a bachelor’s degree in information systems.",
    "Bagstad recently graduated from Hamline University with a bachelor’s degree in criminology and criminal justice, with minors in social justice, legal studies and psychology.",
    "A December 2021 graduate of the University of Wisconsin-Eau Claire with a bachelor’s degree in elementary education, she is now a teacher at Everbrook Academy of Woodbury.",
    "Baier and her sister are founders of a nonprofit organization, Blankets for a Brighter Day, which provides tie blankets to patients at Children’s Minnesota — Minneapolis.",
    "After a skipped year due to the pandemic, this year there are 20 candidates to wear the crown of Aurora, Queen of the Snows of the 2022 St. Paul Winter Carnival.",
    "When she’s not working, Sunny enjoys baking from scratch, playing JRPG (role-playing) video games and learning how to sew to make and model cosplay costumes.",
    "Bagstad, the 2019-2021 Hopkins Raspberry Festival Queen, represented Hopkins at the Minneapolis Aquatennial and was the recipient of the InSPIREation award.",
    "With her communication skills and her big heart, as well as her history of giving back, she believes she would make a great Winter Carnival representative.",
    "In her spare time, she enjoys organizing, reading, completing do-it-yourself projects and taking her 6-year-old son, Jacob, to as many parades as possible.",
    "In her spare time, she enjoys volunteering, spending time with her family, going on walks with her dog, a Labrador named Theo, reading, cooking and baking.",
    "Johnson was born and raised in St. Paul, where she attended Como Park Senior High School, going on to study theatrical arts and drama at Century College.",
    "During the early days of the pandemic, Barrett went walking — and hasn’t stopped: She has logged 2,983 miles including virtual 5Ks and the Mud Girl Run.",
    "In 2021, she reached her goal of returning to college and graduated with her bachelor’s degree in nursing from Minnesota State University Moorhead.",
    "Emerson is passionate about her involvement in the American Foundation for Suicide Prevention and the Twin Cities’ Out of the Darkness Walk.",
    "Ahead of coronation, here’s a look at the Queen of the Snows candidates:\nKeyah Adams, 27, of Oakdale, sponsored by 5th Street Poker Parties.",
    "She has a master’s degree from the University of Minnesota in heritage studies and public history, with a focus in archaeological heritage.",
    "She graduated from Hamline University in 2016 with a bachelor’s degree in creative writing and is currently finishing her first novel.",
    "She loves country music and “anything that sparkles!” She is currently a cloudLibrary account specialist at Bibliotheca in Oakdale.",
    "A graduate of St. Mary’s University of Minnesota, she has a degree in evangelization and religious education with a Spanish minor.",
    "Baltes, who is sponsored by her employer, provides consulting on change management, technology operations and project management.",
    "She most recently obtained her certified lactation counselor accreditation and has applied to receive her public health license.",
    "An educator, she specializes in English language development, working with primary and secondary English language learners.",
    "Baier recently graduated from the University of St. Thomas with a degree in business administration — marketing management.",
    "She is living her passion for serving children in need and using her degree to work in human resources for three schools.",
    "An avid “Harry Potter” enthusiast, she also enjoys baking, fitness and learning, as well as giving back to her community.",
    "Heimerdinger’s passion for science led her to become a chemist, then a regulatory affairs specialist for Medtronic.",
    "Johnson currently attends Grand Canyon University online, pursuing a degree in elementary and special education.",
    "In her spare time, she has fostered more than 300 dogs and raised awareness for the Leukemia & Lymphoma Society.",
    "Nearly her entire wardrobe is hand-sewn, with a focus on the 1940s, but her passion is sewing historic corsets.",
    "In 2020, Effie became a first-time homeowner in St. Paul, where she lives with her guinea pigs and cat, Bucky.",
    "Grounded by the pandemic, she now works as an account manager for Madison Equities LLC in downtown St. Paul.",
    "Born and raised in Woodbury, Johnson was first introduced to the Winter Carnival by her grandmother in 2004.",
    "General admission tickets will be sold until Jan. 27 while supplies last, with no ticket sales at the door.",
    "Born in Nigeria and raised in St. Paul, she enjoys spending time outdoors, from sledding to paddleboarding.",
    "She is the Women Veteran and Gold Star Family Coordinator for the Minnesota Department of Veteran Affairs.",
    "She is a technical writer with ServiceTec International at the Minneapolis-St. Paul International Airport.",
    "When she isn’t in the classroom, she loves hiking throughout Minnesota’s state parks with her dog, Solo.",
    "In her free time, she loves supporting other ambassador programs by attending parades and coronations.",
    "A volunteer for the Winter Carnival, she’s wanted to be a part of the royal family since childhood.",
    "When she does slow down, you’ll find her at home with her family and three dogs, likely crafting.",
    "As a volunteer, she serves as board president of the Fort Road Federation, her district council.",
    "Hungiapuko is a graduate of Bethel University and is currently studying for a master’s degree.",
    "Teri Theno-Erb, 57, of Oakdale, sponsored by Patti Jo and Kari Fitzpatrick at Coldwell Banker.",
    "Barrett has honed her organization and leadership skills working with executives at Medtronic.",
    "She enjoys attending sporting events with her family and spending time with her puppy, Ernie.",
    "In her free time, she also volunteers for several other organizations, including Camp Odayin.",
    "Kim Johnson, 38, of Apple Valley, sponsored by White Bear Country Inn & Rudy’s Redeye Grill.",
    "She loves the Winter Carnival, especially attending Carnival events with family and friends.",
    "She enjoys volunteering with the Friends of San Lucas and Retrieve a Golden of the Midwest.",
    "Ticket and event info: www.wintercarnival.com/events/royal-coronation\nRecommended For You",
    "Mayfield, a college student, is awaiting acceptance into her desired program of nursing.",
    "Michelle Boris, 32, of Fridley, sponsored by Dan Moran Financial Advisor Merrill Lynch.",
    "While she waits, she works full time at Helzberg Diamonds at the Mall of America.",
    "She is also a board member with the Ambassadors for the St. Paul Winter Carnival.",
    "Rahila Hungiapuko, 32, of Lauderdale, sponsored by Allegra Marketing Print Mail.",
    "Shannon Baier, 21, of Hudson, Wis., sponsored by Village Inn Sports Bar & Grill.",
    "She currently works as a housing first advocate at Supportive Living Solutions.",
    "Boris is the coordinator of young adult ministries at a White Bear Lake church.",
    "Her family includes her husband, Bryan, and her 7-year-old daughter, Danielle.",
    "She also enjoys volunteering, including tutoring children in reading and math.",
    "Cathryn Heimerdinger, 33, of Oakdale, sponsored by Northern Prairie Financial.",
    "She graduated from the University of St. Thomas with a degree in social work.",
    "Johnson, who grew up in Northeast Minneapolis, joined the military at age 17.",
    "She retired from the Minnesota Army National Guard after 20 years of service.",
    "Kylie Johnson, 24, of Woodbury, sponsored by Hamernick’s Interior Solutions.",
    "Marissa Mayfield, 23, of Monticello, sponsored by Quality Insurance Service.",
    "In her spare time, she sews historical clothing from between 1780 and 1940.",
    "Jayna Emerson, 32, of New Richmond, Wis., sponsored by Bob & Cheryl Flood.",
    "Theno-Erb has roots in West St. Paul and raised her three kids in Oakdale.",
    "Pulcher has been a labor, postpartum and NICU nurse for the past 22 years.",
    "Adams, a Hopkins native, says she “followed her heart” to the east metro.",
    "Royal Coronation is 8 p.m. Friday, Jan. 28, at the St. Paul RiverCentre.",
    "Katey Johnson, 45, of St. Paul, sponsored by The Tschida-Johnson Family.",
    "When the travel bug hit her, she became a flight attendant with Delta.",
    "She has two grown children and welcomed her first grandchild in 2020.",
    "King Boreas, Aurora and the Princes and Princesses will be revealed.",
    "She has spent the last 12 years volunteering for West St. Paul Days.",
    "Her family includes her husband, Dan, and children, Zach and Mina.",
    "She has great childhood memories of the St. Paul Winter Carnival.",
    "She is newly married to her soulmate and biggest supporter, John.",
    "Susan Pulcher, 53, of Cambridge, sponsored by South Main Dental.",
    "Maija Johnson, 21, of Woodbury, sponsored by Doodle Productions.",
    "With her love of music, she also teaches violin to beginners.",
    "She works as a personal banker at Highland Bank in St. Paul.",
    "Jen Baltes, 51, of West St. Paul, sponsored by F2 Strategy.",
    "She loves working with the community and giving to others.",
    "Dee Barrett, 51, of Fridley, sponsored by Visit Roseville.",
    "Dana DeMaster, 44, of St. Paul, sponsored by Hoover Perio.",
    "Effie Barnes, 27, of St. Paul, sponsored by LCS Company.",
    "Adams is a cultural resource assistant at Mead & Hunt.",
    "Jayda Bagstad, 22, of Hopkins, sponsored by Mess Hall.",
    "She enjoys cooking, even after a full day of working.",
    "She is also a local performer in community theater.",
    "She is also a mom to two kids, Quinn and Daphne.",
    "She enjoys playing with her new kitten, Laszlo.",
    "Barnes was born and raised in Farmington.",
    "Emerson was born and raised in St. Paul.",
    "She is the owner of Teri’s Hair Studio.",
    "She has a pet bunny named Bella."
  ]
}