{
  "id": 6605,
  "mediaId": 2707,
  "date": "2022-01-30",
  "headline": "Omar Kelly: Ten drawbacks to Dolphins’ head coaching job",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/01/202201301520TMS_____MNGTRPUB_SPORTS-OMAR-KELLY-TEN-DRAWBACKS-DOLPHINS-HEAD-1-FL5.jpg?w=512&h=368",
  "link": "https://www.ocregister.com/2022/01/30/omar-kelly-ten-drawbacks-to-dolphins-head-coaching-job/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tribune News Service",
  "authorUrl": "https://www.ocregister.com/author/tribune-news-service/",
  "termIds": [
    1494,
    1740,
    1990,
    3478,
    3681,
    3941,
    4103,
    612,
    5144
  ],
  "sentences": [
    "Let’s take a look at some of the concerns candidates might have about the Dolphins’ head coach job:\nA decade-plus of dysfunction\nWhether it’s the Ireland-Tony Sparano beef, the Dawn Aponte power struggle, Tannenbaum snaking Hickey for the top football job, the Adam Gase and Tannenbaum power struggle, or Chris Grier’s recent dust up with Flores, the one common thread about the Dolphins is the franchise’s leadership was submerged in some level of dysfunction.",
    "What we are seeing during this NFL hiring cycle to replace Brian Flores, who was fired after producing back-to-back winning seasons three years into a rebuild, seems no different than what we witnessed nine years ago when Miami struggled to find a replacement for former general manager Jeff Ireland.",
    "Tua Tagovailoa doesn’t have top-tier NFL arm strength\nTagovailoa has spent the past two seasons showing he’s worthy of being an NFL starter, but his lack of arm strength could force his next coach to use a limited playbook because the former Alabama standout can’t make every NFL throw.",
    "Many of Miami’s top players are free agents\nEmmanuel Ogbah, the team’s top defensive lineman, tight ends Mike Gesicki and Durham Smythe, linebacker Elandon Roberts, running backs Duke Johnson and Phillips Lindsay, and defensive back Nik Needham are all expected to become free agents.",
    "Then Hickey basically got “deboed” for the job two seasons later when Mike Tannenbaum, who Ross wouldn’t interview for the general manager opening, was hired as vice president of football operations because he upstaged Hickey while being a consultant for Miami for a season.",
    "And it’s possible that Aaron Rodgers could be coming to the AFC if he leaves Green Bay for Denver, which is being speculated because of the hiring of Nathaniel Hackett, his former Packers’ offensive coordinator, who was named the Broncos coach last week.",
    "Grier’s footing in the organization isn’t firm\nThere’s a running theory in NFL circles that the reason Grier survived is because Ross couldn’t stomach firing one of the league’s few black coaches and few black general managers in the same offseason.",
    "Ross’ history of making bad hires — and the franchise’s affinity for power struggles — makes it tremendously challenging for Dolphins fans and media members to not conclude that this latest process doesn’t have disaster written all over it.",
    "Miami’s next hire might be encouraged to keep key members of Flores’ defensive staff, like defensive coordinator Josh Boyer and secondary coach Gerald Alexander, to ensure that there isn’t a ton of collateral loss from the coaching change.",
    "The hope is that a veteran offensive line coach can get the best out of Austin Jackson, Michael Deiter, Solomon Kindley, Liam Eichenberg and Robert Hunt, the five early round draft picks who have struggled in their first few seasons.",
    "Job stability isn’t a selling point\nRoss turns 82 in May, and has a prospective buyer in place already, which means he could sell to New York businessman Bruce Beal, Jr. in the next few years.",
    "Offensive line needs to be rebuilt\nThe next coaching staff must accept this job with the understanding that last year’s offensive line handcuffed the entire team because of their limitations.",
    "The constant confusion and dysfunction that persists from the people in positions of power for the Dolphins is a turnoff when it comes to hiring people for leadership positions.",
    "If that’s truly what saved Grier from being purged, it means he needs to knock it out the park in 2022 from a performance standpoint in free agency and the draft.",
    "And Flores got fired at the conclusion of the 2021 season with a 24-25 record, having produced the franchise’s first back-to-back winning seasons since 2002-03.",
    "Players like Chad Pennington, Ryan Fitzpatrick, Kurt Warner and even Drew Brees have carved out respectable NFL careers without possessing a cannon for an arm.",
    "While the Dolphins have a league-leading $65 million in cap space, re-signing these key contributors could eat up a substantial portion of the team’s budget.",
    "The AFC has a ton of upper-echelon quarterbacks\nPatrick Mahomes, Josh Allen, Joe Burrow, Justin Herbert, Derek Carr and Lamar Jackson all reside in the AFC.",
    "Whether it’s the serious hip injury he suffered in college or just a lack of velocity on his throws, his limited arm strength is no longer debatable.",
    "An ownership change usually results in a cultural change for a franchise, and that might mean a lack of patience with the newest head coach hire.",
    "If his performance as the team’s top football executive is part of the reason next year’s team struggles don’t be surprised if he’s replaced.",
    "That means the Dolphins must sign roughly two dozen free agents before training camp in July, and hopefully upgrade the team’s talent base.",
    "Next coach might be encouraged to inherit assistants\nThere’s usually a handful of quality assistants on every staff, even on losing teams.",
    "But Miami will need to continue investing in the run-pass-option style of offense that Tagovailoa thrived in at Alabama for this to work.",
    "Deshaun Watson’s begins his second season of trying to force his way out of Houston, but there’s no guarantee he’ll land on another team.",
    "The tide needs to turn in Miami before another generation of fans forget that the Dolphins were once the NFL’s winningest franchise.",
    "An impatient fan base\nThe Dolphins’ two-decade long ride on the mediocrity merry-go-round has negatively impacted the fan base.",
    "At this point Ross has to take ownership for it because those power struggles have all happened under his watch as team owner.",
    "The only reason they avoided leading the NFL in sacks was because Tagovailoa has stellar pocket presence, and a quick trigger.",
    "For instance, special teams coordinator Darren Rizzi was originally hired by Sparano and retained by Joe Philbin and Gase.",
    "But every head coach should be allowed to build their own staff, and forcing their hand could be a turnoff to candidates.",
    "Back-to-back coaches fired at conclusion of third season\nTwo straight Dolphins coaches didn’t make it to a fourth season.",
    "It’s always the next coaches job to turn that tide, and when he doesn’t, anger and venom usually comes his way.",
    "The Dolphins offensive line not only struggled opening up running lanes, but protection was also a major issue.",
    "At this rate, it’s difficult to say what can guarantee the team’s next coach makes it to his fourth season.",
    "Philbin made it to a fourth season — and got fired after four games for starting out the 2015 season 1-3.",
    "There’s an entire generation of South Floridians who have never seen the Dolphins win a playoff game.",
    "But Flores’ entire five-year contract was guaranteed and that didn’t stop Ross from firing him.",
    "Gase was fired at the conclusion of the 2019 season with a 23-25 record and one playoff berth.",
    "The Dolphins eventually hired Dennis Hickey after three others turned down the job.",
    "Let’s be clear, transparent, and direct about the state of the Miami Dolphins.",
    "The draft and undrafted rookie free agents will add another 20 or so players.",
    "That’s tough sledding for any team trying to become a perennial contender.",
    "And that’s why owner Steve Ross has had a troublesome history of hires.",
    "There’s something wrong with this franchise’s front office structure.",
    "What if the next coach doesn’t want to run an RPO-based offense?",
    "And everyone knows a new GM wants to hire their own head coach.",
    "Nobody takes a job without having guarantees on job stability.",
    "Dolphins fans have come to expect drama and disappointment.",
    "The Dolphins only have 44 players under contract.",
    "However, that was their choice."
  ]
}