{
  "id": 6658,
  "mediaId": 2732,
  "date": "2022-01-21",
  "headline": "Mark Madden: Steelers are underinvested at 3 most important positions",
  "image": "",
  "link": "https://triblive.com/sports/mark-madden-steelers-are-underinvested-at-3-most-important-positions/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Madden",
  "authorUrl": "https://triblive.com/author/mark-madden/",
  "termIds": [
    1703,
    1718,
    1919,
    2315,
    2609,
    2889,
    3773,
    4688,
    823
  ],
  "sentences": [
    "The other big offseason discussion will be about receiver JuJu Smith-Schuster, who returned early (we’re told) from shoulder surgery (there’s a report he nearly lost the arm) to register an incredible five catches for an amazing 26 yards at Kansas City.",
    "That won’t stop the local media from blindly speculating about the imminent arrival of Aaron Rodgers, Derek Carr, Russell Wilson, Jimmy Garoppolo, Jameis Winston or whoever else.",
    "Unfortunately, the perceived possibilities at quarterback will be discussed ad nauseam till Week 1 when Rudolph takes the first offensive snap — and even after that.",
    "The Steelers’ biggest assets are a few superstar performers on defense: edge rusher T.J. Watt, defensive end Cameron Heyward and safety Minkah Fitzpatrick.",
    "Don’t believe it, and don’t believe any of the wild notions ricocheting everywhere about the Steelers getting a prominent veteran QB.)",
    "In terms of any appreciable quality, the lone returnee at that position could be Cameron Sutton, who has a cap figure of $5.2 million.",
    "If the Steelers lost their minds and traded for, say, Rodgers, the Steelers would make the playoffs but wouldn’t win the AFC North.",
    "There’s no point using their first-round choice (20th overall) on a mediocre QB prospect in a draft that’s weak at the position.",
    "But remember, this is the same local media who told you the Steelers could make a game of it at Kansas City, maybe even win.",
    "Twitter bleats about making this brave young man a “Steeler for life.”\nSmith-Schuster played six games and did very little.",
    "The draft picks surrendered in a trade for Rodgers or another prominent quarterback would cripple the rebuilding process.",
    "So for that, Smith-Schuster should be made a “Steeler for life?” Smith-Schuster thinks he merits a four-year contract?",
    "Smith-Schuster said afterward that he’d like to sign a four-year contract with the Steelers.",
    "The three most important positions in football are quarterback, cornerback and left tackle.",
    "Rudolph will be the Steelers’ starting quarterback in 2022, exactly like I’m telling you.",
    "(Coach Mike Tomlin says Dwayne Haskins has a chance to compete with Rudolph for that job.",
    "Pegging him as the long-term solution at that crucial position is quite a leap of faith.",
    "If Edmunds had been a second- or third-round pick, he’d be considered a success.",
    "That defense allowed 42 points at Kansas City in Sunday’s playoff loss.",
    "(Edmunds has played 64 games out of a possible 65 in his four seasons.",
    "The Pittsburgh Steelers are woefully underinvested at those positions.",
    "He is mediocre and has betrayed his pedigree as a first-round pick.",
    "When you don’t get hurt, there’s never a brave comeback story.)",
    "They might win a playoff game but wouldn’t win the Super Bowl.",
    "Cornerbacks Joe Haden and Ahkello Witherspoon are free agents.",
    "Salary cap-wise, Moore is a bargain next season at $1 million.",
    "He missed the rest of the games because of his bum shoulder.",
    "Rudolph will be an average starting quarterback, no better.",
    "Kansas City crushed the Steelers, exactly like I told you.",
    "The Chiefs scored touchdowns on six straight possessions.",
    "Rookie Dan Moore Jr. did a creditable job at left tackle.",
    "But we’re still going to debate what isn’t a debate.",
    "But Edmunds contributes more than Smith-Schuster.",
    "The Steelers are in a tough spot at quarterback.",
    "They might win more but wouldn’t win enough.",
    "Safety Terrell Edmunds is also a free agent.",
    "That QB’s salary would skew the salary cap.",
    "(Yes, that includes Pitt’s Kenny Pickett.)",
    "There are too many other needs to address.",
    "He averaged just 7.8 yards per reception.",
    "You can’t reinvent football’s priorities.",
    "Mason Rudolph was a third-round choice.",
    "That is, by far, his primary talent.",
    "He carries a $4 million cap hit.",
    "But he is a fourth-round pick.",
    "That’s not up to the Steelers.",
    "Hubris is one heck of a drug.",
    "Rudolph is a lock to start.",
    "Bitterly and way too much.",
    "Smith-Schuster is beloved.",
    "So is social media."
  ]
}