{
  "id": 6660,
  "mediaId": 2586,
  "date": "2022-01-28",
  "headline": "Fan-Favorite Bills RB Signs With NFC Team in First Offseason Casualty",
  "image": "https://heavy.com/wp-content/uploads/2021/11/Antonio-Williams-e1636592505879.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-rb-antonio-williams-giants/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    2019,
    3018,
    4571,
    160,
    539,
    707,
    719
  ],
  "sentences": [
    "“They’ve obviously had success with it in Buffalo and we need to make some changes in how we do things around here and that was one of the big reasons why we wanted to bring somebody in from the outside that can look and see … what we’re doing well, see what we’re doing poorly at and just change things to a point where everybody’s on the same page moving forward,” Mara said, via ESPN.",
    "Just days after Buffalo’s season came crashing to a heartbreaking ending against the Kansas City Chiefs, the New York Giants offered a reserve/future deal to a running back that many Bills fans had hoped would eventually get a crack at the active roster and a chance at more carries.",
    "Bills Have Tough Decisions Ahead\nIt was not clear if Williams remained in the long-term plans for Buffalo, as the Bills signed 11 players to reserve/future contracts earlier in the week and Williams was not among the group.",
    "Giants Grab Bills Running Back\nThe Giants announced on January 27 that they gave a reserve/future contract to Antonio Williams, the second-year running back who spent the season going on and off the Bills practice squad.",
    "Brandon Beane got emotional as he started thanking the fans for their support this season #BillsMafia @WKBW pic.twitter.com/AlofJWwZfj\nBeane said the work on putting together next year’s team has already started.",
    "Schoen, the former Bills assistant general manager, has gotten the stamp of approval from Giants co-owner John Mara, who spoke highly of the work that the front office has done in assembling Buffalo’s roster.",
    "@Giants pic.twitter.com/YNHjhAlWnZ\n— Tone (@A_B_Williams26) January 27, 2022\nWilliams became a favorite among Bills fans after his breakout performance in the 2020 season finale against the Miami Dolphins.",
    "After a late-season release, the Bills had brought him back to the practice squad on January 5, but the Giants and new general manager Joe Schoen scooped him up after Buffalo’s season ended.",
    "As Joe Buscaglia of The Athletic noted, the league salary cap is expected to rise from $182.5 million to $208 million for the coming season, but the Bills would still be tight against it.",
    "Last offseason, the Bills prioritized keeping intact the squad that brought the Bills to the AFC Championship game, re-signing players like Jon Feliciano, Daryl Williams, and Matt Milano.",
    "This is the first loss for the Bills and leads into an offseason when they will need to make some difficult decisions on what players to keep.",
    "The Bills have a number of veteran players headed to free agency, including Levi Wallace, Ryan Bates, Emmanuel Sanders and Jerry Hughes.",
    "“We’re going to assess this roster, which we’ve started personnel meetings this week with each side of the ball,” Beane said.",
    "He made the most of the opportunity, taking 12 carries for 63 yards and two touchdowns to propel the Bills to a 56-26 win.",
    "But general manager Brandon Beane has said that the team will have some difficult decisions to make in the offseason.",
    "The Bills had the division locked up and rested many of their starters, giving Williams his first NFL action.",
    "“We’ve got to first know our own roster before we start looking at other rosters.”",
    "Forever grateful for my time in Buffalo\nExcited to get to work in the Big Apple!",
    "The Buffalo Bills have started the offseason by losing a fan-favorite player.",
    "Williams took to Twitter to announce the move.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!"
  ]
}