{
  "id": 6672,
  "mediaId": 2551,
  "date": "2022-01-26",
  "headline": "Habito hikes rates on 7x income 'lifetime' mortgages just a month after launch, adding tens of thousands in interest for those on longer fixes",
  "image": "https://i.dailymail.co.uk/1s/2022/01/26/12/53391991-0-image-a-7_1643200041746.jpg",
  "link": "https://www.dailymail.co.uk/money/mortgageshome/article-10442887/Habito-hikes-rates-7-times-income-lifetime-mortgages-adding-tens-thousands-interest.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Helen Crane For This Is Money",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Helen+Crane+For+This+Is+Money",
  "termIds": [
    451
  ],
  "sentences": [
    "Habito rates: old versus new (no early repayment charge)\nDeposit\n26-30yr fix Old rate\n26-30yr fix New rate\n£ interest change*\n31-35yr fix Old rate\n31-35yr fix New rate\n£ interest change*\n40%\n3.59%\n4.30%\n£24,600\n4.25%\n4.55%\n£13,300\n25%\n3.69%\n4.40%\n£24,700\n4.35%\n4.65%\n£13,400\n20%\n3.94%\n4.65%\n£25,100\n4.60%\n4.90%\n£13,600\n15%\n4.24%\n4.95%\n£25,500\n4.90%\n5.20%\n£13,800\n10%\n4.74%\n5.45%\n£26,200\n5.40%\n5.70%\n£14,200\n*Based on a £200,000 mortgage over a 26-year and 31-year fixed term respectively\nHowever, the appeal of this may be limited as it means the borrower will not be able to remortgage away from Habito without penalty for the first 10 years of the loan, which could be a problem if market interest rates fell.",
    "+4\nView gallery\nHome buyers using Habito One can leave the mortgage at any time without fees, but only if they have chosen the early repayment charge-free option at the outset\nIn October, the OBR warned of a worst-case scenario whereby a 'wage spiral' or energy price shock would cause the base rate to increase to 3.5 per cent in 2023.",
    "+4\nView gallery\nRate rise: Habito mortgages allow home buyers to fix their mortgage for between 10 and 40 years - though those opting for longer fixes are now subject to increased rates\nEvery mortgage with a term of 26 or more years, which is not subject to an early repayment charge, has been subject to a rate rise.",
    "+4\nView gallery\nMoving costs: Home buyers are seeing mortgage rates increase across the board, due to the increase in the Bank of England's base rate as well as increases in swap rates\nSomeone with a 10 per cent deposit repaying over 40 years would see their rate rise from 5.6 per cent to 5.9 per cent.",
    "'As well as looking at income, we use further measures of loan-to-income requirements, including applicants having 10 per cent excess cash remaining as well as a good credit score to make sure we continue to lend responsibly and that the mortgage is affordable on a monthly basis.'",
    "+4\nView gallery\nHabito's seven times income offering is only available to those in certain professional occupations, including teachers working in the public sector\nAll of the Habito One products come with a hefty product fee of £1,995, though this can be added to the loan.",
    "It is only available to applicants in the following professions: firefighters; police officers; NHS doctors, nurses and paramedics; teachers in the public sector; accountants; lawyers; barristers; civil engineers; dentists; architects; surveyors and vets.",
    "TOP FIXED 90% MORTGAGES\n provided by\nProvider\nRate (APRC)\nType\n2.29%\n(3.8%)\nFixed to 02/07/24\n2.29%\n(3.7%)\nFixed to 31/07/24\n2.39%\n(3.6%)\nFixed for 2 years\n2.40%\n(4.6%)\nFixed to 30/06/24\n Check the best rates for you >\nAxmTYklsjo190QW????",
    "However, borrowers should think carefully about borrowing a larger-than-average sum, as their monthly mortgage payments will be higher and could be more difficult for them to cover if their financial circumstances changed.",
    "Applicants for the Habito One mortgage borrowing 7 times their income will also need to have the equivalent of 10 per cent of the amount they are borrowing left over in cash once they have paid their deposit.",
    "Offering a higher loan-to-income ratio means that those on lower salaries find it easier to qualify for a mortgage, and enables borrowers to afford a larger or more expensive property than otherwise possible.",
    "Find the best deal and get fee-free advice\nFor a borrower with a £200,000 mortgage, this would increase the total interest paid over a 26-year period by more than £26,000, from £150,278 to £176,476.",
    "Habito announced on 26 December that it would allow applicants in certain professions to borrow seven times their income, as opposed to the typical 4.5 times income multiple offered by most banks.",
    "On the ERC-free option, someone with a 20 per cent deposit fixing for 26 years would see their rate rise to 4.65 per cent under the new pricing system, when the rate was previously 3.94 per cent.",
    "It did so at the same time as it launched its new offering, which allows buyers in certain professions to borrow 7 times their salary as a mortgage – more than the standard 4.5 times multiple.",
    "Many lenders have also increased their standard variable rates – the 'default' mortgage rates borrowers drop on to when fixed deals end – largely in line with the 0.15 per cent base rate rise.",
    "They will need to earn at least £25,000 a year, have a good credit score, and to have been employed full-time for at least one year, as opposed to the industry standard of 3 months.",
    "A lender will sometimes want to exchange a tranche of variable-rate repayments for a tranche of fixed-rate payments in order to reduce risk or hedge against interest rate changes.",
    "In real terms, this would see someone with a 10 per cent deposit and a £200,000 mortgage paying more than £19,800 more interest over the loan period, up from £303,683 to £323,523.",
    "Mortgage lender Habito has hiked the rates on some of its mortgages by more than 0.7 per cent, including its seven-times income 'fixed for life' loans launched just a month ago.",
    "If the base rate, and therefore mortgage rates, were to increase much more substantially than that over time, then fixing for life on Habito's rates could start to make sense.",
    "'Due to rising inflation and the money markets appearing to be pricing in more Bank of England rate rises to come, in recent months, the swap rates have been driven up.",
    "Most mortgage lenders have moved to increase their rates after the Bank of England decided to increase the base rate from 0.1 per cent to 0.25 per cent on 16 December.",
    "It can be argued that rate changes matter more on a Habito mortgage than on a typical two-year fix, as the borrower will could be paying that rate for much longer.",
    "Habito said that its 'typical' Habito One customer takes a 25-year term and has a 25 per cent deposit, and therefore would not be affected by the rate increases.",
    "Rates have been increased on some of the market disruptor's Habito One products, which allow borrowers to fix their mortgage rate for between 10 and 40 years.",
    "Fitzpatrick added: '7 times salary is our extending borrowing limit and is specifically available to those in certain eligible jobs and with minimum incomes.",
    "Whether fixing a mortgage rate for the long term is a good idea depends on the rate offered, and where the borrower believes rates will go in the long term.",
    "In joint applications only one borrower will be able to borrow 7 times their salary, even if both are in an eligible profession or earn more than £75,000.",
    "However, Habito published its previous Habito One rates – the ones that have now been hiked – on 26 December, after that decision had already taken place.",
    "Habito One customers would be able to exit the mortgage at any time if they saw a better deal elsewhere, but only if they had chosen the ERC-free option.",
    "Asked to explain the decision, Alan Fitzpatrick, lending operations at Habito said: 'Like many other lenders, our pricing is also tied to swap rates.",
    "'Our longer-term fixed-rate mortgages are significantly longer and therefore offer more certainty than a typical 2-year or 5-year fixed-rate deal.'",
    "Nationwide increased rates on 238 fixed and tracker mortgages in early January, with rises of between 0.05 per cent and 0.45 per cent, for example.",
    "This is because a higher base rate drives up the cost of borrowing for banks and building societies – a cost which they pass on to their customers.",
    "Habito offers lower rates for borrowers who agree to pay an early repayment charge (ERC) if they wish to switch their mortgage during the term.",
    "If this extreme scenario became a reality, a mortgage fixed for life on one of the Habito One rates would start to look like a better deal.",
    "This takes the highest rate in that category up to 5.45 per cent for someone with a 10 per cent deposit, up from 4.74 per cent previously.",
    "However, the new rate rises apply to all Habito One mortgage applicants, whether they are borrowing seven times their income or not.",
    "Meanwhile someone with a 40 per cent deposit repaying over 31 years would be subject to a rise from 4.25 per cent to 4.55 per cent.",
    "The price change is reflective of the length of time that a Habito One customer could fix for, which is between 10, up to 40 years.",
    "Its early repayment charges are levied at 5 per cent or 10 per cent depending on how many years into the mortgage the borrower is.",
    "However, the party taking on the variable rate will charge them interest in exchange for taking on the additional uncertainty.",
    "'The Habito One with no ERCs product means that customers can leave it at any time, with no financial penalty whatsoever.'",
    "Usually, borrowers only fix their rate for two or five years, after which time they can remortgage to another product.",
    "The changes do not affect anyone who has already taken a Habito mortgage, as the interest is fixed for the loan term.",
    "It is predicted to rise further in 2022, with some estimates suggesting it could rise to 0.50 per cent over the year.",
    "Recent rate increase decisions by other mortgage lenders have been more modest than Habito's 0.70 per cent, however.",
    "The largest rise is 0.71 per cent, which applies to all mortgages with a repayment term of between 26 and 30 years.",
    "It will also accept applications where at least one borrower earns a salary of £75,000 or more in any profession.",
    "Scottish Widows and Halifax have also increased selected two and five-year products by up to 0.13 per cent.",
    "While still very low in historical terms, interest rates are now edging up after months of sustained falls.",
    "This is because the Bank of England increased its base rate from 0.1 per cent to 0.25 per cent this month.",
    "The average fixed rate of interest being charged by lenders 'receiving' a swap is known as the swap rate.",
    "Most lenders have increased the rates on at least some of their mortgages due to the base rate increase.",
    "Those choosing mortgages which are subject to early repayment charges will not see the rates change.",
    "It comes after the lender had huge publicity after Christmas when it revealed the mortgage terms.",
    "They can do this by agreeing to 'swap' the loans with another lender for a set number of years.",
    "Habito put the decision to increase the cost of its mortgages down to increases in swap rates.",
    "Someone with a 40 per cent deposit would see it increase to 4.3 per cent from 3.59 per cent.",
    "Rates for those repaying on terms between 31 and 40 years have all risen by 0.3 per cent.",
    "Rates for those who have chosen a deal which includes early repayment charges are lower.",
    "They must be qualified, practising and registered with the appropriate industry body.",
    "Banks routinely borrow money from other lenders, and pay interest on this borrowing.",
    "But without early repayment charges, they are free to switch their deal at any time.",
    "'For others, the Habito One product has a cap of 4.5 or 5 times salary borrowing.",
    "This is assuming they did not move to a bigger property or remortgage.",
    "The other will be able to borrow up to 5 times their salary.",
    "HOW THIS IS MONEY CAN HELP\n Looking for a cheaper mortgage?",
    "'This has resulted in us having to increase our prices.",
    "Please check your inbox to confirm your email address.",
    "How does it compare to what other lenders are doing?",
    "Their monthly payments would increase by £42.",
    "The monthly payments would increase by £84.",
    "This is 5% to 10% of the loan amount.",
    "This is Money newsletter\nThank you.",
    "What are swap rates?",
    "AxmTYklsjo190QW????"
  ]
}