{
  "id": 6726,
  "mediaId": 2584,
  "date": "2022-02-01",
  "headline": "New ‘super tax’ to deter energy firm owners from gas profiteering",
  "image": "https://i.guim.co.uk/img/media/452e4905c81f28fdcef292f7af34c2b0606bf870/0_117_3499_2100/master/3499.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b1956f253fea3a24dcaaa1599ba7bbc7",
  "link": "https://www.theguardian.com/business/2022/feb/01/new-super-tax-to-deter-energy-firm-owners-from-gas-profiteering",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jillian Ambrose",
  "authorUrl": "https://www.theguardian.com/profile/jillian-ambrose",
  "termIds": [
    3152,
    149,
    162,
    783,
    859,
    5370
  ],
  "sentences": [
    "Consumers in England, Scotland and Wales could already be on the hook for a total of £3.2bn to cover the cost of finding a new supplier for the 2 million households affected by the collapse of energy suppliers since the start of September, and for the further 1.7 million customers of Bulb Energy, who have been handed to a special administrator appointed to handle the large-scale collapse.",
    "A spokesperson for Ovo Energy said: “We support this, and other recent announcements intended to strengthen the resilience of the UK energy retail market.”\nHowever, the company added that it was “still not clear on what – if anything – the government will do to help support vulnerable customers” ahead of the looming hike to the UK’s energy cap which is expected next week.",
    "Treasury documents said there was “a potential risk” that some energy suppliers and their shareholders might monetise large profits on assets such as hedges “for their own benefit, leaving the government and ultimately the wider public to be landed with the costs of ensuring the continuity of supplies of energy to customers”.",
    "The government quickly pushed through the new laws late last week to counter industry concerns that Stephen Fitzpatrick, the founder of Ovo Energy, could use his almost two-thirds stake in the company to liquidate its long-term gas contracts and exit the supply market with a hefty profit.",
    "The Guardian understands that the tax was ushered in to block any financial incentive for energy company owners to make a fortune off the loophole, and to provide a “safety net” for household bill payers and the public purse that would otherwise have to bail out customers left behind.",
    "Under the government’s new super-levy, called the public interest business protection tax, a 75% tax will be imposed on any future windfall that an energy company shareholder could hope to make by cashing out gas contracts while leaving millions without a supplier.",
    "“The government considers it unacceptable that, whilst consumers across the UK face rising energy bills, it would be possible for some companies and their shareholders to exploit this situation to the detriment of taxpayers and end consumers,” the documents added.",
    "Energy bills are expected to soar to almost £2,000 a year from April under the regulator’s energy price cap – up from an average of £1,277 this winter – in the steepest bill increase since the cap was introduced in 2019.",
    "Treasury officials have quietly introduced a new “super tax” to deter energy company owners from cashing out lucrative contracts for gas bought in advance before leaving their supply business to go under.",
    "Energy industry sources believe this loophole may have already been used by BP, which owned almost a quarter of Pure Planet before pulling the plug on the challenger brand last October.",
    "Ovo Energy said the new levy had its support, and that it had “been clear for some time that action was needed” to help protect households and taxpayers.",
    "However, those that did buy gas in advance, before markets reached record highs last year, have found the value of the contracts has rocketed.",
    "“We hope this announcement is a sign of further initiatives to come to resolve the current energy crisis,” the Ovo spokesperson said.",
    "Many of the suppliers that have gone bust did not have long-term energy contracts, known as hedges, in place.",
    "It is understood to have sold the energy it bought in advance, using the profit to pay back loans to BP.",
    "The government has been in talks to soften the blow to households but no measures have been agreed."
  ]
}