{
  "id": 6759,
  "mediaId": 2754,
  "date": "2022-01-28",
  "headline": "Florida Trucker In Canada Convoy: \"We're Here To Join A Movement\"",
  "image": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2022-01/fuck%20trudeau%20truck.jpg?itok=0CXDtmml",
  "link": "https://www.zerohedge.com/political/florida-trucker-canada-convoy-were-here-join-movement",
  "mediaOutlet": "Zero Hedge",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Durden",
  "authorUrl": "",
  "termIds": [
    1481,
    3327,
    4890,
    4977,
    5229,
    5357,
    5371,
    5377
  ],
  "sentences": [
    "By Nate Tabak of Freight Waves,\nFlorida-based owner-operator DeAndre Mahadeo, like other truckers who rolled past throngs of supporters just outside Toronto, got a rousing send-off on Thursday as he prepared to head to the capital, Ottawa, in a protest against COVID-19 vaccine mandates at the border.",
    "“Governments are using this as an opportunity to gain more leverage against the people.”\nMahadeo spoke as he inched his truck forward as his convoy prepared to join a larger one that had come from Niagara, Ontario.",
    "As of yet, reports from across Canada point to a smaller figure, with individual convoys numbering in the hundreds of vehicles to over 1,000, in the case of one spotted in Saskatchewan.",
    "“The small fringe minority of people who are on their way to Ottawa, who are holding unacceptable views that they are expressing, do not represent the views of Canadians,” Trudeau said.",
    "“We need to end these restrictions once and for all.”\nAcross the Toronto area, supporters on overpasses cheered on convoys as they made their way along Canada’s busiest freight routes.",
    "Many in the crowd held signs calling out the prime minister, including some that read “Truck Frudeau.”\nOrganizers of the Freedom Convoy say that 50,000 trucks will converge in Ottawa.",
    "Hundreds of people of all ages called them heroes and even freedom fighters as 15 to 20 trucks and a few hundred passenger vehicles paraded through a mall parking lot in Vaughan.",
    "pic.twitter.com/K3x3YZpASr\n— Meagan Fitzpatrick (@fitz_meagan) January 27, 2022\nAdding to the anger in the crowd were comments Trudeau made on Wednesday about the convoy.",
    "Multiple convoys under the auspices of the Freedom Convoy have been making their way toward Ottawa since the weekend — with the largest coming from western Canada.",
    "Carey said she identified with the unvaccinated cross-border drivers, having been fired from her job in housekeeping at a hospital after refusing to get the shot.",
    "The protest convoys bound for Ottawa started in response to the vaccine mandates that the U.S. and Canada imposed on cross-border drivers earlier this month.",
    "But they have emerged as a rallying point for Canadians against pandemic-related restrictions and the government of Prime Minister Justin Trudeau itself.",
    "“There is a whole lot of overreach of the government, certainly in the U.S. and Canada and around the world,” said Mahadeo, who was born in Guyana.",
    "The organizers have reportedly withdrawn CA$1 million after submitting a distribution plan to GoFundMe, which had been withholding the funds.",
    "Huge crowd here in Vaughan to support the convoy of truckers who are en route to Ottawa to protest vaccine rules for cross-border drivers.",
    "But for the unvaccinated driver, the consequences were more immediate since he can only run domestic freight now unless he gets the shot.",
    "But the long-haul trucker — who considers both countries his home — believes more is going on behind the vaccination requirements.",
    "A few trucks ahead of Mahadeo, Ontario owner-operator Tom Slawinski expressed frustration at the U.S. and Canadian governments.",
    "“We’re here to join a movement,” said Mahadeo, 30, a dual U.S.-Canadian citizen who regularly moves freight in both countries.",
    "I feel now like it’s getting momentum,” said Carolyn Carey, of Newmarket, Ontario, one of the many nontruckers in the convoy.",
    "Mahadeo is fully vaccinated against COVID-19 so the mandates at the border haven’t affected his job.",
    "“I tried to join groups that have done this, but it’s always just kind of fizzled out.",
    "“I should be able to choose and not have to be forced to take the vaccine,” she said.",
    "On Wednesday, Ottawa police said they are expecting 1,000 to 2,000 protesters.",
    "A GoFundMe campaign for the Freedom Convoy continues to see donations pour in.",
    "As of Thursday evening, it had raised over CA$6.3 million (US$5 million).",
    "He continues to move auto parts back and forth between the countries.",
    "Some handed over boxes of cookies, brownies and other snacks.",
    "“I can’t make money,” Slawinski said."
  ]
}