{
  "id": 6786,
  "mediaId": 2586,
  "date": "2022-02-01",
  "headline": "Bills QB Josh Allen Has New Plans After Turning Down Pro Bowl",
  "image": "https://heavy.com/wp-content/uploads/2022/02/Josh-Allen-3-e1643764110559.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-allen-pga-pro-am/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1331,
    1953,
    3583,
    160,
    539
  ],
  "sentences": [
    "I know I don’t play well when I’m frustrated, and again, hearing that from a Hall of Fame golfer, one of the best of all time, to say that type of thing, that resonated well with me, because that’s exactly kind of how I feel, too.",
    "“Unfortunately I will be declining the invitation to play in the Pro Bowl this year in order to allow my body to rest and recover from the harshness of the season,” Allen wrote in a text message to ESPN’s Chris Mortensen.",
    "“The type of quarterback I am, I obtain a lot of bumps and bruises along the road of a season, so I will use this time to let my body heal.”\nBut Allen now has plans to spend the weekend competing in another sport instead.",
    "Allen, who was not named to the Pro Bowl as a starter, turned down the chance to play as an alternate, saying after the loss to the Kansas City Chiefs that he needed a chance to heal from a long and grueling season.",
    "Allen’s Weekend Plans\nThis week, the AT&T Pebble Beach Pro-Am announced that Allen would be among the athletes and celebrities competing in the golf tournament, which runs February 3-6.",
    "There had been some controversy when Allen was not named a Pro Bowl starter, despite ranking at or near the top of the AFC in several passing categories at the time he was passed over.",
    "Allen’s Other Athletic Passion\nAllen’s love for golf is well-documented, and his friendship with a PGA legend caught some viral attention earlier in the season.",
    "After he set a slew of team passing records in the 2020 season, Allen thanked his offensive linemen by buying golf clubs and lessons for them.",
    "Allen showed up to Buffalo’s Halloween game dressed as Phil Mickelson for Halloween, and later opened up about the friendship the two share.",
    "It helped me today and hopefully it’ll help me in the future, too.”\nFrom dressing up as Lefty for Halloween to teeing it up at Pebble Beach.",
    "“The type of throws where I struggle are kind of the underneath patterns where I’ve got to tone down my arm a little bit,” Allen once said.",
    "“It was right after he won the PGA and he was right there with his trophy and the golf cart,” Allen revealed last year, via PGA.com.",
    "pic.twitter.com/33qodoVVjM\nBills general manager Brandon Beane stuck up for Allen and his decision to skip the Pro Bowl.",
    "Allen noted that Mickelson even called the team before the last season started to offer some words of encouragement.",
    "— GOLF.com (@GOLF_com) February 2, 2022\nAs PGA.com noted, Allen has integrated golf into his football career.",
    "“I think we can all agree he got snubbed on the Pro Bowl,” Beane said last week, via the Buffalo News.",
    "“He was on the golf course, and he took about 30 minutes to talk to the team and it was really cool.",
    "The report noted that Allen has also made reference to his golf game in some postgame interviews.",
    "Buffalo Bills quarterback Josh Allen said no to the Pro Bowl and yes to the pro-am.",
    "Josh Allen runs onto the field before a game against the Kansas City Chiefs.",
    "@BuffaloBills quarterback, Josh Allen is heading to Pebble Beach!",
    "Bills fans, please note tables are not permitted at this event.",
    "I think it’s just self-knowledge, understanding who you are.",
    "“It’s like I’m 100 yards out, and I have a 4-iron.”",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "HEY AYYY AYYY AY let's go @JoshAllenQB!!",
    "Bills Mafia where are you at?",
    "??"
  ]
}