{
  "id": 6808,
  "mediaId": 2586,
  "date": "2022-01-20",
  "headline": "Insider Sheds Light on Belichick’s Actions After Blowout Loss to Bills",
  "image": "https://heavy.com/wp-content/uploads/2022/01/Bill-Belichick-1-e1642684497140.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/belichick-visit-bills-locker-room/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1386,
    1937,
    2849,
    3161,
    3826,
    4065,
    110,
    160,
    700,
    707
  ],
  "sentences": [
    "Belichick had gained a reputation for being something of an ungracious loser in big games, having been criticized for not shaking Tom Coughlin’s hand after the New York Giants upset the Patriots in the 2008 Super Bowl, and later refusing to do a postgame interview after the Baltimore Ravens knocked off the Patriots in the 2013 AFC Championship Game.",
    "I think we certainly made improvements from where we were last year but we certainly have a way to go as well.”\nThe Patriots could present a challenge to the Bills, as rookie quarterback Mac Jones led the team on a faster-than-expected turnaround to return to the playoffs just one season after the departure of Tom Brady.",
    "He noted that the Patriots coach visited the Bills locker room “for an extended period” after his postgame press conference, hinting that Belichick was not actually snubbing Bills head coach Sean McDermott on the field following the game.",
    "After some initial speculation that he could retire following this season and that he was evaluating his future with the team on a year-to-year basis, Belichick confirmed that he is coming back to the Patriots.",
    "Giardi’s report seemed more in line with the relationship between Belichick and McDermott, who have spoken respectfully of each other in the past with no outward signs of any ill will.",
    "Belichick Visited Bills After Loss\nMike Giardi of the NFL Network shared video this week of a “cool moment” between rival players after the conclusion of the January 15 game.",
    "That’s what I’ve always done and that’s what I’ll continue to do.”\nBelichick also seemed content with the situation in New England and the support from owner Robert Kraft.",
    "The brief exchange could have been due to the conditions on the field, where temperatures were in the single digits all game with wind chills that dropped below zero.",
    "The New England Patriots coach faced some criticism after video appeared to show him blowing off Bills coach Sean McDermott on the field following Saturday’s game.",
    "Robert and Jonathan [Kraft] have been very supportive and they’ve given me great opportunity to try and do the things we need to do to have a good team.",
    "Bills center Mitch Morse sought out Patriots defensive tackle Christian Barmore, who had been watching Bills players celebrate their win on the field.",
    "Belichick Confirms Future With Patriots\nBelichick will get at least a few more opportunities to enact revenge on the Bills for the 47-17 loss.",
    "https://t.co/JNDseZr3PZ\n— Mike Giardi (@MikeGiardi) January 18, 2022\nGiardi revealed that Belichick had his own moment to show appreciation.",
    "Bill Belichick was asked about his future with the #Patriots this morning and he made it a point to squash any \"year-to-year\" talk.",
    "Bill Belichick may not have been as grumpy following a blowout loss to the Buffalo Bills as initial reports seemed to indicate.",
    "— The Greg Hill Show (@TheGregHillShow) January 17, 2022\n“Nobody ever said it was year-to-year or something else,” he said.",
    "Should also note Bill Belichick did his press conference then went into the #Bills locker room for an extended period.",
    "Morse shared some kind words with Barmore, telling the Patriots lineman that he is a great player.",
    "But that was not the case following Saturday’s loss to Buffalo, an insider reveals.",
    "“I enjoy the job that I have and trying to do everything I can to help the team.",
    "Sure seems like Bill is not slowing down any time soon.",
    "“It’s challenging, but I enjoy all aspects of it.",
    "The latest Bills news straight to your inbox!",
    "“For me, I enjoy the job,” Belichick said.",
    "Join the Heavy on Bills newsletter here!"
  ]
}