{
  "id": 6814,
  "mediaId": 2644,
  "date": "2022-01-27",
  "headline": "The questions that will make or break Brian Flores’ Giants coaching chances",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/01/bflores.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/01/27/brian-flores-giants-coaching-chances-will-come-down-to-this/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Schwartz",
  "authorUrl": "",
  "termIds": [
    1466,
    1990,
    2213,
    3018,
    3418,
    3747,
    3941,
    4575,
    308,
    707
  ],
  "sentences": [
    "“We’re gonna spend some time on that when he comes in.’’\nFlores and Brian Daboll, the Bills’ offensive coordinator, are thought to be the two favorites to land the Giants’ job — handicap it as Daboll 1 and Flores 2 — but the interviews are a critical part of the evaluation and it was difficult to cast anyone as a frontrunner before he actually met with the team.",
    "Another Giants’ candidate, Dan Quinn, announced Thursday he will be staying with the Cowboys as their defensive coordinator, after the Broncos and Bears – two teams that had Quinn in for interviews – filled their head coach openings, the Broncos with Nathaniel Hackett and the Bears with Matt Eberflus.",
    "After the regular-season finale — a 33-24 victory over the Patriots — Flores admitted he learned much about himself during the year and added, “I try to improve every day.’’ If that was a message to ownership, it did not have the desired effect.",
    "Flores, 24-25 in three years in Miami (no playoff appearance), was 19-14 the past two years, and the Dolphins after starting off 1-7 this past season, the Dolphins rolled to seven consecutive victories and finished 9-8.",
    "Flores had several hours with the Giants to explain what went down in Miami and a source said he did an acceptable job answering the many questions about the relationship breakdowns that led to his ouster.",
    "“Communicate through collaboration.”\nThe “C” word is a big one around the Giants, as both Mara and Schoen mentioned “collaboration’’ several times Wednesday during Schoen’s introductory press conference.",
    "Daboll spoke at length with the Giants on Tuesday and his history with quarterbacks and familiarity with new general manager Joe Schoen from their time together in Buffalo makes him the one to beat.",
    "Players anonymously claimed Flores played favorites and it was obvious Tagovailoa was not one of those favorites, as reports swirled Flores wanted Grier to draft Justin Herbert and not Tagovailoa.",
    "He led the Dolphins to back-to-back winning seasons for the first time since 2002 and 2003 and the two-game sweep of the rival Patriots in 2021 was the first time that has happened in 21 years.",
    "The most intriguing candidate — for reasons that can potentially help and also hurt his chances — got his day on Thursday, when Brian Flores interviewed for the vacant Giants head-coaching job.",
    "In many ways, the young (40), tough Flores is exactly what Mara is looking for, as he has already proven he can handle the rigors of life as an NFL head coach, at least on the field.",
    "Grier has been involved with the Dolphins organization since 2000 and he clearly won a power struggle with Flores, who clashed with several players in his three years in Miami.",
    "Graham earlier in the week interviewed for the Giants’ head-coaching job and was in Pittsburgh on Thursday making a pitch for the Steelers’ defensive coordinator opening.",
    "That he was jettisoned in Miami the day the season ended – one day before Judge was let go – came as a surprise, not only to the Giants but the majority of the NFL.",
    "Reports of unrest with players, incompatibility with general manager Chris Grier and a supposed lack of respect for owner Stephen Ross led to Flores’ demise.",
    "Graham’s quick departure from Miami was more about moving closer to home and receiving a promotion, a source said, rather than a falling-out with Flores.",
    "The Dolphins under Flores played strong defense, kept mistakes to a minimum, battled hard and were offensively limited with quarterback Tua Tagovailoa.",
    "Flores cycled through offensive coordinators, hiring and firing Chad O’Shea, Chan Gailey, George Godsey and Eric Studesville in a three-year span.",
    "The Dolphins allowed the most points in the league and Graham came to the Giants as the assistant head coach/defensive coordinator for Judge.",
    "The Giants, when they started contemplating the firing of Joe Judge late in the season, did not expect Flores, 40, would be available.",
    "That Flores is from Brooklyn makes for a good potential homecoming story but it has no bearing on the decision the Giants will make.",
    "They filled the Rooney Rule requirement — at least one in-person interview with an outside minority candidate — with Flores.",
    "Cornerback Minkah Fitzpatrick, a first-round pick in 2018, ripped Flores after he was traded to the Steelers in 2019.",
    "Flores hired Patrick Graham to be the defensive coordinator in Miami in 2019 but the pairing lasted only one season.",
    "The Dolphins also have interest in Daboll and want to bring him and others back for second interviews — next week.",
    "Leslie Frazier, the Bills’ defensive coordinator, visits with the Giants on Friday for his in-person interview.",
    "“An organization can only function if it’s collaborative, if it works together,” Ross said after firing Flores.",
    "“That’s certainly one of the things we’ll discuss with Brian,’’ Giants co-owner John Mara said a day earlier.",
    "Graham, Flores and Judge all worked together on Bill Belichick’s staff with the Patriots.",
    "But can he get along with those he works for, works with and those who play for him?",
    "“That is my man, I love him to death,’’ Graham said about Flores this past season.",
    "The Giants could have their new head coach in place by Friday night or Saturday.",
    "“Different people rub different people in different ways,” Ross said.",
    "By then, Daboll could already be the Giants’ head coach.",
    "It remains to be seen how Flores rubs the Giants.",
    "Is he a relationship builder or breaker?",
    "The football did not get Flores fired.",
    "He can coach."
  ]
}