{
  "id": 6823,
  "mediaId": 2586,
  "date": "2022-01-27",
  "headline": "Tom Brady’s Witty Response to Ben Roethlisberger’s Retirement",
  "image": "https://heavy.com/wp-content/uploads/2022/01/GettyImages-1356621473-e1643322164559.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/tampa-bay-buccaneers/bucs-tom-brady-witty-response-steelers-ben-roethlisberger-retirement/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DJ Siddiqi",
  "authorUrl": "https://heavy.com/author/lizdelasko89/",
  "termIds": [
    1509,
    1587,
    1703,
    1797,
    2003,
    2967,
    3069,
    4725,
    823
  ],
  "sentences": [
    "Brady’s Message to Big Ben\nAlthough the two were AFC rivals for many games over the years — they matched up in the postseason twice and 10 times in the regular season — Brady paid tribute with a message to his fellow quarterback over Twitter shortly after his retirement.",
    "“There’s more than one way to bake a cake!”\nWith Roethlisberger now officially retired, most of Brady’s adversaries from the beginning of his career — Peyton and Eli Manning, Philip Rivers and Drew Brees — are now retired.",
    "And I think now it’s just some time to spend some time with my family and spend some time with my kids.”\nBrady has repeatedly stated his desire to play until the age of 45.",
    "“Ben defied the TB12 Method in favor of the “Throw Some Ice On It” method his whole career, and ended up an all-time-great with 6 Pro-Bowls and 2 Super Bowls,” said Brady.",
    "As has become common over recent years, another one of Brady’s rivals — Ben Roethlisberger — announced his retirement over social media on Thursday, January 27.",
    "That thinking was validated when he inked a contract extension last season with the Buccaneers that would keep him under contract through the 2022 season.",
    "The Pittsburgh Steelers quarterback walks away from the game after an illustrious 18-year career that saw him bring two Super Bowls to Pittsburgh.",
    "The Tampa Bay Buccaneers QB has never had a losing season and the last time he missed the postseason as a starter was during the 2002 season.",
    "In fact, the next oldest active quarterbacks after the 44-year-old Brady is 39-year-old Ryan Fitzpatrick and 38-year-old Aaron Rodgers.",
    "Although, you know, it is divided attention as you get older, ‘cause there’s different priorities and responsibilities in life.",
    "Brady, Roethlisberger, the Manning brothers and Brees combined for 14 Super Bowl wins over the past 20 years.",
    "And I’ve literally given everything I had this year, last year, the year before that, the year before that.",
    "So, you know, we’ll just see.”\nIf Brady does decide to retire, we could officially see the end of an era.",
    "So again, it’s a, you know, I’ll know when the time is right and there’s no rush to make a decision.",
    "Brady is the only quarterback during Roethlisberger’s era that can match that level of consistency.",
    "Brady Could Soon Join That List\nSpeaking of retired quarterbacks, Brady soon may join that list.",
    "“I would say I’m proud and satisfied of everything we accomplished this year,” Brady continued.",
    "It’s been six straight months of football, every day consumed by day in and day out football.",
    "And, you know, I have things happening outside of football that require some time and energy.",
    "Not a ton but, you know, the kids require time and energy and that’s enjoyable for me, too.",
    "“I think the point is there’s no really rush for me to figure out what’s next,” Brady said.",
    "Brady stated the following regarding his decision on the latest episode of the Let’s Go!",
    "The Buccaneers quarterback has yet to commit to playing the entire 2022 season.",
    "Both quarterbacks didn’t enter the league until 2005 — five years after Brady.",
    "Perhaps most amazing, Roethlisberger never had a losing season in his career.",
    "Tom Brady responds to Ben Roethlisberger's retirement in a hilarious manner.",
    "Tom Brady is saying goodbye to another one of his longtime rivals.",
    "“So I know when I give it my all, that’s something to be proud of.",
    "So I think for all of us, you know, we can all decompress a bit.",
    "However, there’s “no rush” to make a decision on Brady’s part.",
    "I feel like I give everything I can to my teammates.",
    "Like, I don’t leave anything half-ass, you know?",
    "ALL the latest Bucs news straight to your inbox!",
    "I think I leave it with everything that I have.",
    "My physical being, I work really hard on that.",
    "And he won’t be making a decision this week.",
    "Join the Heavy on Bucs newsletter here!",
    "“You know, I’ll know when I know.",
    "It’s a day after the season.",
    "podcast."
  ]
}