{
  "id": 6848,
  "mediaId": 2740,
  "date": "2022-01-27",
  "headline": "Putin plans to crush liberty in Ukraine. Free World must unite to stop him.",
  "image": "https://www.gannett-cdn.com/presto/2022/01/26/USAT/2d0240af-04ee-43a8-a4db-9be0ff563759-AP_Ukraine_On_the_Front_Lines.jpg?crop=7887,4437,x0,y416&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/opinion/2022/01/27/defend-ukraine-russian-aggression-putin/9233596002/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=news-opinion",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1806,
    3296,
    3709,
    3975,
    1115,
    5287,
    5366
  ],
  "sentences": [
    "The U.S. has an obligation to act\nLet us recall that in 1990, when Iraqi strongman Saddam Hussein ordered his Republican Guard across the border into Kuwait, the United States led a United Nations-backed coalition to drive the invading troops back.",
    "Let the United Nations and the Organization for Security and Cooperation in Europe rally the global coalition that is needed to defend Ukrainian sovereignty and independence, and preserve European stability for generations to come.",
    "Put an end to Putin's nightmare\nIn 1994, the United States and the United Kingdom signed the Budapest Memorandum – assuring they would come to the aid of Ukraine in the event it was preyed upon.",
    "Opinion contributors\nSince Russia’s illegal invasion of Ukraine’s southeast flank in 2014, nearly 14,000 innocent Ukrainians have perished and more than a million have been displaced.",
    "Now, the free world is watching with growing alarm as Russia amasses more than 100,000 well-armed soldiers at Ukraine’s border, awaiting the signal to unleash further bloodshed.",
    "The Kremlin is preparing to sacrifice the lives of thousands of its own men and women for no other reason than to bolster the ego of its ruthless dictator, Vladimir Putin.",
    "Reps. Marcy Kaptur, D-Ohio, Brian Fitzpatrick, R-Penn., Mike Quigley, D-Ill., and Andy Harris, R-Md., are co-chairs of the bipartisan Congressional Ukraine Caucus.",
    "The free world must demand an unequivocal cease-fire and quickly form the protective shield to ward off those who wish Ukraine harm.",
    "His callous and unyielding aggression – toward a nation that voted by 90% for its own independence from tyranny – must be halted.",
    "The free world cannot sit back as he alone – isolated from the norms of decent behavior – beats the Russian drums of war.",
    "If Russia is allowed to carry out its brutal schemes, the slaughter of countless innocents is inevitable.",
    "Harsh sanctions against the Russian oligarchy and the Nord Stream 2 pipeline project must be stiffened.",
    "With Putin eager to embark on a similar course, President Joe Biden should seek such a coalition.",
    "Russia has engaged in countless atrocities – this is part of Putin’s legacy of madness.",
    "It is painfully clear the moment to make good on those assurances has arrived.",
    "Having twice taken bites out of Ukraine’s territory, Putin is hungry for more.",
    "Ukraine is the scrimmage line for liberty on the European continent.",
    "The delivery of critical military weaponry to Ukraine must continue.",
    "When liberty falls under siege, the world has an obligation to act.",
    "Alexander Vindman:US can stop the horror of a Putin war in Ukraine.",
    "But hasn’t enough blood already been shed on Ukrainian soil?",
    "It is time for the free world to rise up together.",
    "Let us slam the door on Putin’s wild nightmare.",
    "What a terrible waste of human potential.",
    "But time is running out."
  ]
}