{
  "id": 6857,
  "mediaId": 2808,
  "date": "2022-01-31",
  "headline": "Afternoon Edition: Jan. 31, 2022",
  "image": "https://cst.brightspotcdn.com/dims4/default/97764b6/2147483647/strip/true/crop/750x428+0+34/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FR80MqNICac_ErTB5pJgsNZMx5tQ%3D%2F0x0%3A750x496%2F750x496%2Ffilters%3Afocal%28375x248%3A376x249%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F23208144%2FIMG_3255.jpeg",
  "link": "https://chicago.suntimes.com/afternoon-edition-newsletter/2022/1/31/22911099/afternoon-edition-jan-31-2022",
  "mediaOutlet": "suntimes.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Satchel Price",
  "authorUrl": "https://chicago.suntimes.com/authors/satchel-price",
  "termIds": [
    0
  ],
  "sentences": [
    "Palos toboggan slides is where we went also!” — Janet Maxwell\n“Not in Chicago, but Wood Oaks Green Park in Northbrook has an awesome sled hill.” — Nick Esposito\n“If we’re only saying the city then it’s the hill at Henry C. Palmisano Park.” — Valentin Galvan\nThanks for reading the Chicago Sun-Times Afternoon Edition.Got a story you think we missed?Email us here.",
    "From the press box\nBears GM Ryan Poles spoke to media today alongside head coach Matt Eberflus, who Poles says got his attention with the way the Colts played defense: “A fast, violent effort.”\nEberflus also spoke today about what he sees in new offensive coordinator Luke Getsy, who recently joined the team from the Packers.",
    "Here’s what some of you said...\n“MT trashmore in Evanston right outside Chicago city limits.” — Shawn McGovern\n“Oak Park has that huge hill off Lombard.” — Kimberly Martin\n“Cricket Hill, at Montrose and Lake Shore Drive.” — Jose T. Cortez\n“Logan Monument or the Soldier Field Sledding Hill!",
    "A bright one\nIt’s been said laughter is the best medicine, and organizers of the World Comedy Expo are hoping the four-day event, slated for Chicago this spring, will help all of us find something to laugh about amid all the stress, hardship and sadness of a pandemic world.",
    "Shawon Dunston wasn’t surprised that his daughter was moving up in the baseball world and accomplishing life goals, but to land a job of this stature after just one year in the industry with the Cincinnati Reds came as a bit of a shock.",
    "She came to the Sox with an impressive resume, having received a masters degree in sports administration from Valparaiso, interning for All Pro Sports & Entertainment in Denver, working for the Raiders of the NFL and as a law clerk.",
    "“I came to Chicago from Japan as a young stand-up because the city is known as the comedy capital of the world,” said festival co-founder and artistic director Saku Yanagawa, via statement, about the festival’s Chicago locale.",
    "Jasmine, 31, was a scholarship softball player at Tennessee State who grew up around major league baseball, attending Cubs games at Wrigley Field when Shawon was the North Siders shortstop beginning in 1995.",
    "More news you need\nSeveral synagogues and Jewish businesses in West Rogers Park were targeted with spray-painted swastikas and broken windows over the weekend, just days after Holocaust Remembrance Day.",
    "The expo, running March 25-27, will bring together more than 170 stand-up comics and sketch/improv troupes from Chicago, across the country and across the globe for 27 comedy showcases.",
    "J.B. Pritzker’s latest state budget proposal will aim to ease the “pinch of inflation” for Illinois residents by providing almost $1 billion in tax cuts, freezes and rebates.",
    "Drummer Sam Lay, a Rock & Roll Hall of Fame inductee who played with blue legends and backed Bob Dylan when he went electric at the Newport Folk Festival, has died at age 85.",
    "While police declined to describe the graffiti painted on a North Side synagogue, a local group that tracks antisemitic attacks in the Chicago area says they were swastikas.",
    "Hired by Roland Hemond and Dave Dombrowski when Tony La Russa was managing the Sox in 1982, Zwit was ahead of her time as an assistant in player development and scouting.",
    "Top story\nWhen Jasmine Dunston informed her father that she would be the White Sox’ new director of minor league operations late last year, he was overcome with emotion.",
    "While attending law school at John F. Kennedy University, Jasmine celebrated three World Series championships during her dad’s tenure as a Giants coach from 2009-2019.",
    "1 draft who played 12 of his 18 seasons in the major leagues with the Cubs, including two as an All-Star, has four adult children with Tracie, his wife of 34 years.",
    "The National Weather Service, which has issued a winter weather watch, estimates at least 6 inches of snow for the Chicago area by the time the storm ends Thursday.",
    "“I am thankful to Cincinnati Reds for my first opportunity in baseball and taking my development seriously after getting my foot in the door,” Jasmine said.",
    "Chicago’s spring and summer concert slate is starting to come together with big names like The Black Keys and Marco Antonio Solis slated to visit the city.",
    "They talked baseball with me day in and out.”\nDunston is taking over for Grace Guerrero Zwit, who is easing into retirement after 40 years with the Sox.",
    "Each stand-up showcase will feature eight to 10 comics doing 10-minute sets, while sketch and improv showcases are double-billed for an hourlong show.",
    "Read Maureen O’Donnell’s full obituary for Lay, who as a member of the Paul Butterfield Blues Band helped to bring Chicago blues to a wider audience.",
    "Among the proposed measures are a suspension on the state’s 1% grocery tax and delaying a gas tax increase that’s set to kick in this summer.",
    "The shows will take place at Laugh Factory, The Annoyance Theatre, Den Theatre and two Second City venues: Up Comedy Club and Donny’s Skybox.",
    "Reply to this email (please include your first name and where you live) and we might feature your answer in the next Afternoon Edition.",
    "A daughter to Mexican immigrants, she was the first woman to work in Sox baseball operations and passes a meaningful baton to Dunston.",
    "With those two and Candace Parker, the team will have at least three Finals MVPs on their roster for the 2022 season.",
    "The expo will include more than 90 stand-up comics and 25 ensembles — artists from 18 countries and five continents.",
    "Coby White keeps filling whatever role the Bulls ask of him, but his future in Chicago seems as uncertain as ever.",
    "Send us an email at newsletters@suntimes.gcom and we might feature your answer in the next Afternoon Edition.",
    "Showtimes are staggered, with performances at 7, 9 and 11 p.m. Friday and Saturday, and 7 and 9 p.m. Sunday.",
    "She landed her first baseball job as a specialist in the Reds’ player development department a year ago.",
    "Tomorrow will be mostly cloudy with a high near 43 before a winter storm enters the area in the evening.",
    "He was so shocked and stunned because people in baseball don’t get a director role after one year.",
    "The Sky had a big day in free agency by re-signing Kahleah Copper and adding Emma Meesseman.",
    "“Nick Krall, Eric Davis, Shawn Pender, Cam Bonifay, Walt Jocketty, they took me seriously.",
    "On Friday, we asked you: Where’s the best place to go sledding in Chicago?",
    "It’s about a 5-minute read that will brief you on today’s biggest stories.",
    "1 in Michael O’Brien’s latest Chicago-area Super 25 basketball rankings.",
    "Here’s a look at some of the acts coming to Chicago later this year.",
    "This afternoon will be partly sunny with a high near 34 degrees.",
    "What’s something you always make sure to do before a snowstorm?",
    "Joe Cowley looks at where White’s at in his third NBA season.",
    "“He cried like a baby, oh my goodness,” Jasmine Dunston said.",
    "Tonight will be mostly cloudy with a low around 30.",
    "Here’s the latest news you need to know in Chicago.",
    "“I had to repeat the title to him like five times.",
    "“I hoped I would be replaced by a female minority.",
    "!” — Angela Fitzpatrick\n“Dan Ryan Woods years ago.",
    "So he was just proud.”\nShawon Dunston, a No.",
    "Shawon Jr. was drafted by the Cubs in 2011.",
    "Individual tickets are $20, per showcase.",
    "“They say I blazed a trail,” Zwit said.",
    "I’m glad that they did it.",
    "Glenbard West remains No.",
    "No question was dumb.",
    "Your daily question?",
    "It’s a good move.",
    "Good afternoon.",
    "Gov."
  ]
}