{
  "id": 6872,
  "mediaId": 2523,
  "date": "2022-01-20",
  "headline": "Buyer Beware: Which NFL Free Agents Should Teams Avoid in 2022?",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/498/264/hi-res-8b443459be53839e446cec3a051f3896_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2952588-buyer-beware-which-nfl-free-agents-should-teams-avoid-in-2022",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristopher Knox",
  "authorUrl": "https://bleacherreport.com/users/6e186227-f9b2-4450-af0d-8f62243323ee",
  "termIds": [
    0
  ],
  "sentences": [
    "While he has shown recently that he can play at an acceptable level—he posted a passer rating of 95.6 with the Miami Dolphins in 2020—the reality is this: He's a 39-year-old quarterback coming off a significant injury and will have gone nearly a year without taking a meaningful snap by next season.",
    "Whether they benefited from a strong supporting cast, are saddled with injury concerns, carry scheme-specific skill sets or are facing age-induced drop-offs, some players should be avoided by all but a select few teams.",
    "A first-round pick of the Cleveland Browns in 2017, the Michigan product started 29 games in his first two seasons before being sent to the Giants as part of the Odell Beckham Jr. trade.",
    "With the salary cap expected to rise this offseason—to $208.2 million, according to NFL Network's Tom Pelissero—we're likely to see quite a bit of spending when the market opens.",
    "QB Ryan Fitzpatrick\nLast offseason, the Washington Football Team signed journeyman Ryan Fitzpatrick to a one-year, $10 million deal and tabbed him as the starter in 2021.",
    "Teams looking for a run defender who can occasionally pressure the quarterback will have younger, cheaper options this offseason—both in free agency and the draft.",
    "To be fair, he hasn't had the most reliable quarterback play with the Giants, but teams cannot simply expect to pluck him out of New York and make him a star.",
    "Some team will inevitably take a chance on the 32-year-old, who has a projected market value of $6.2 million annually—if Hilton doesn't call it a career.",
    "Given his age and underwhelming production with the Giants, teams should be very careful about targeting Solder for any sort of long-term starting role.",
    "TE Evan Engram\nWith Zach Ertz, Dalton Schultz and Mike Gesicki slated to hit the market, 2022 will be a good year to target tight ends in free agency.",
    "Teams hoping for a return to form will likely pay a pretty penny to take that chance—Fuller played on a one-year, $9.5 million deal this past season.",
    "Weapons such as Tyreek Hill, Mecole Hardman and Travis Kelce dominate the defensive attention, often giving Pringle gaping holes in the secondary.",
    "At a likely cost in the $10 million range—he had a cap hit of $13 million this season—he isn't likely to provide value to an outside suitor.",
    "Teams hoping to see Fowler return to that form are likely to be disappointed if they sign him to anything more than a veteran minimum deal.",
    "He's a decent box safety who flows to the football—he's had 224 solo stops in five seasons—but he can be a huge liability on the back end.",
    "With a career starting record of 59-87-1, Fitzpatrick should only entice teams looking for a short-term bridge or hoping to tank in 2022.",
    "His Pro Bowl selection—which came with 654 yards and a single touchdown—says more about last year's NFC field than it does about Engram.",
    "The 2018 undrafted free agent out of Kansas State benefits greatly from the spacing and one-on-one coverage he receives in Kansas City.",
    "A versatile safety and capable return specialist, the 26-year-old should be looking to cash in during his first foray into free agency.",
    "3 receiver finished the regular season with 42 catches, 568 yards, five touchdowns and an impressive 13.5 yards-per-reception average.",
    "In his first year with the Giants, Solder was responsible for five penalties and seven sacks allowed, according to Pro Football Focus.",
    "Indianapolis and perhaps the Philadelphia Eagles are really the only teams that make sense for Hilton at that price point, though.",
    "In addition to the injury concerns, there's the fact that Peppers' production hasn't exactly lived up to his physical potential.",
    "The Cincinnati Bengals, for example, added Trey Hendrickson, Larry Ogunjobi, Chidobe Awuzie and Eli Apple this past offseason.",
    "Given Peppers' injury and his inconsistency, it's difficult to justify his projected market value of $12.5 million annually.",
    "Edge Dante Fowler Jr.\nPass-rushers are always in high demand, which is why some team will take a flier on Dante Fowler Jr.",
    "He has a projected market value of $9.1 million annually, which is fair if Patterson can give Atlanta similar production.",
    "WR Byron Pringle\nWide receiver Byron Pringle has emerged as a dangerous complementary option for the Kansas City Chiefs.",
    "At his age, Patterson simply may not be capable of maintaining a high-volume offensive workload for an entire season.",
    "This year, Solder was responsible for six penalties and six sacks surrendered while moving from left to right tackle.",
    "OT Nate Solder\nFor seven seasons, offensive tackle Nate Solder was an effective player for the New England Patriots.",
    "The Colts are very familiar with him, as is Eagles head coach and former Colts offensive coordinator Nick Sirianni.",
    "The four-time first-team All-Pro return specialist found an expanded role with the Falcons and took full advantage.",
    "We're not saying that these impending free agents cannot succeed with the right team, but they're not for everyone.",
    "While re-signing Pringle makes sense for Kansas City, he shouldn't be a top option for other receiver-needy teams.",
    "Giants running back Saquon Barkley, for example, wasn't the same after he returned from a torn ACL this season.",
    "DE Calais Campbell\nBaltimore Ravens defensive lineman Calais Campbell is a six-time Pro Bowler with 93.5 sacks.",
    "On top of age and injury concerns, there's the fact that consistency has never been Fitzpatrick's strong suit.",
    "Unfortunately for Washington and Fitzpatrick, a hip subluxation ended his season after only six pass attempts.",
    "While these are better numbers than we saw in 2019, the 33-year-old is still merely in serviceable territory.",
    "With a lesser supporting cast and a lesser quarterback, he would likely return to this level of production.",
    "CB Kyle Fuller\nCornerback Kyle Fuller was a reliable starter during his six seasons with the Chicago Bears.",
    "The Atlanta Falcons were that team in 2020, inking Fowler to a three-year, $45 million deal in free agency.",
    "Fowler was coming off an impressive 11.5-sack season with the Los Angeles Rams when the Falcons signed him.",
    "The 27-year-old's standout 2019 campaign—one in which he got to play alongside Aaron Donald—was a one-off.",
    "However, teams other than Kansas City should be wary of signing the 28-year-old to be a difference-maker.",
    "While quarterback Patrick Mahomes has learned to take advantage of these opportunities, it's taken time.",
    "He's an aging speed receiver—which is already a concern—and he's coming off an injury-hampered campaign.",
    "The former Colorado lineman signed a four-year, $62 million deal with the Giants in free agency in 2018.",
    "Teams simply cannot count on the Harvard product to be healthy and prepared to lead an offense in 2022.",
    "He's had 17 drops over the past two years, while eight of his targets were intercepted over that span.",
    "He's had just 7.5 sacks in 28 games with the Falcons and had a mere 17 quarterback pressures in 2021.",
    "In four of his 16 appearances, the Broncos had Fuller on the field for fewer than 10 defensive snaps.",
    "He finished the latter season with eight passes defended and an opposing quarterback rating of 89.8.",
    "Used as both a receiver and a running back, Patterson was nearly unstoppable early in the campaign.",
    "And they should definitely avoid giving him the sort of money the Giants did a few short years ago.",
    "Engram is a boom-or-bust pass-catching tight end who busts too often to be a top free-agent target.",
    "He's capable of carving up a defense in one game but then throwing multiple interceptions the next.",
    "A return to the Ravens could make sense because Campbell is happy to be a contributor in Baltimore.",
    "Given the likely cost and Fuller's recent performance, betting on him isn't a gamble worth making.",
    "It's clear that Fuller, who will turn 30 next month, isn't the same lockdown defender he once was.",
    "Tennessee Titans pass-rusher Bud Dupree wasn't as effective off the edge upon his return either.",
    "However, teams hoping to get similar dual-threat production out of Patterson should be warned.",
    "Atlanta later restructured that pact, making Fowler an unrestricted free agent this offseason.",
    "He underwent neck surgery before the season and then suffered a quad injury and a concussion.",
    "WR/RB Cordarrelle Patterson\nCordarrelle Patterson was fantastic for most of the 2021 season.",
    "As did many former Patriots, though, Solder struggled to find success away from New England.",
    "I might be willing to do it again,\" Campbell said, per Clifton Brown of the Ravens' website.",
    "In Pringle's 2019 and 2020 seasons, he produced just 330 yards and two touchdowns combined.",
    "He found the right fit with head coach Arthur Smith and offensive coordinator Dave Ragone.",
    "While franchises cannot buy a championship on the open market, they can certainly improve.",
    "This is partially why he has never lasted more than four seasons with a single franchise.",
    "He failed to reach 30 rushing yards or 25 receiving yards in any of his final four games.",
    "Though Fuller still started 10 games in 2021, his role in the defense was inconsistent.",
    "Free agency—slated to kick off March 16 this year—is always a huge part of the process.",
    "Patterson will also turn 31 in March, and he fell off dramatically late in the season.",
    "However, he's also 35 years old and possibly contemplating retirement this offseason.",
    "It could take time for Hilton to adjust to an unfamiliar scheme and supporting cast.",
    "He finished the year with 618 rushing yards, 548 receiving yards and 11 touchdowns.",
    "However, teams should be cautious of signing New York Giants tight end Evan Engram.",
    "If not, then I won't,\" Hilton said, per Joel A. Erickson of the Indianapolis Star.",
    "However, other teams shouldn't look for him to jump-start their offenses in 2022.",
    "While still a capable run defender, he is not the potent pass-rusher he once was.",
    "However, reliability has been a major issue for the former Mississippi standout.",
    "There's no guarantee that another staff will coax the same greatness out of him.",
    "At this point, the 14-year veteran is a fine rotational piece and nothing more.",
    "For the rest of the league, it's on to the offseason and preparations for 2022.",
    "For the eight divisional-round teams, the NFL playoffs are still going strong.",
    "Campbell finished the season with only 1.5 sacks and 16 quarterback pressures.",
    "He was even less effective in his Pro Bowl season, providing a rating of 55.4.",
    "However, there were red flags even then that he might not reach expectations.",
    "S Jabrill Peppers\nSafety Jabrill Peppers has had a winding career in the NFL.",
    "His projected market value of $3.2 million annually is extremely reasonable.",
    "In such a scenario, his previous $10 million price point would be too high.",
    "In 2021, Engram helped provide a passer rating of only 80.2 when targeted.",
    "The 2019 season was the first in which Fowler reached double-digit sacks.",
    "In 2021, Hilton caught just 23 passes for 331 yards and three touchdowns.",
    "He last topped the 1,000-yard mark in 2018, Andrew Luck's final campaign.",
    "He landed with the Denver Broncos, and his play declined significantly.",
    "Advanced statistics from Pro Football Reference unless otherwise noted.",
    "This past season, Peppers allowed an opposing passer rating of 122.1.",
    "Yes, he has 262 receptions and 16 touchdown catches in five seasons.",
    "There's no telling if or when he'll be back to 100 percent in 2022.",
    "It's highly unlikely that he'll recapture his former glory in 2022.",
    "Dupree had just three sacks in 11 games during the regular season.",
    "However, teams should be wary of signing Peppers to be a starter.",
    "He was a Pro Bowler in 2018 and 2019 and was again solid in 2020.",
    "Engram has caught just 61.1 percent of the passes thrown his way.",
    "That's a concerning lack of reliability for a back-end defender.",
    "However, the franchise that does could be making a big mistake.",
    "Once he arrived in Atlanta, Fowler went back to underwhelming.",
    "Hilton is a four-time Pro Bowler with 9,691 receiving yards.",
    "Teams should not target Fitzpatrick to be a starter in 2022.",
    "\"If I want to play one more year, I can play one more year.",
    "That's a big concern if he isn't likely to return in 2023.",
    "However, the Bears made Fuller an offseason cap casualty.",
    "He is coming off a torn ACL, which he suffered in Week 7.",
    "Solder was even less reliable in 2019, allowing 11 sacks.",
    "Contract information and market projections via Spotrac.",
    "This doesn't mean the Falcons shouldn't bring him back.",
    "They know how to utilize his skills better than anyone.",
    "Other teams should be out on Campbell in 2022, however.",
    "He allowed an opposing passer rating of 119.8 in 2021.",
    "Hilton has spent his entire career in Indianapolis.",
    "It was a decision that New York quickly regretted.",
    "You'll find a look at some of those players here.",
    "Cincinnati is one of the eight teams still alive.",
    "Over the past four years, he missed 35 tackles.",
    "However, not every signing will be a home run.",
    "Yes, the 27-year-old was a Pro Bowler in 2020.",
    "Some notable free agents represent big risks.",
    "He subsequently opted out of the 2020 season.",
    "He didn't get on the field at all in Week 7.",
    "Hilton\nIndianapolis Colts wide receiver T.Y.",
    "If the price makes sense, so does a return.",
    "For other teams, it's a massive gamble.",
    "\"I do know that I love being a Raven.\"",
    "3 pick had just 16 total sacks.",
    "\"I feel pretty good right now.",
    "Before then, the 2015 No.",
    "Who knows?",
    "WR T.Y.",
    "The No."
  ]
}