{
  "id": 6885,
  "mediaId": 2636,
  "date": "2022-01-25",
  "headline": "Stephen Sondheim Leaves Rights to His Works to a Trust",
  "image": "https://static01.nyt.com/images/2022/01/24/multimedia/24arts-briefing-sondheim/24arts-briefing-sondheim-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/01/24/theater/stephen-sondheim-will-estate-trust.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3275,
    4493,
    4872
  ],
  "sentences": [
    "(Sondheim and Lapine shared a Pulitzer for writing “Sunday in the Park With George”; their other collaborations included the musicals “Into the Woods” and “Passion.”) Also listed as beneficiaries: Peter Jones, a playwright who was once romantically involved with Sondheim; Steven Clar, who was Sondheim’s assistant; Peter Wooster, a designer who lived in a small house on Sondheim’s Connecticut property; and Rob Girard, who is Wooster’s gardener.",
    "The beneficiaries of the trust include a number of prominent organizations: the Smithsonian Institution, the Library of Congress, the New York Public Library for the Performing Arts, the Irish Repertory Theater and the Dramatists Guild Fund; the Museum of the City of New York is listed as a “contingent beneficiary,” but the filing does not specify what the contingency is.",
    "The probate petition says that the estimated value of Sondheim’s personal property at the time of his death was between $500,000 and $75 million, but three estate lawyers advised caution in interpreting those numbers, which they said are often rough estimates, and which would not reflect the value of any property Sondheim had placed in a trust during his lifetime.",
    "“Although it is possible that his estate contains other assets not passing under the will, it appears likely that the $75 million in the probate document filed with the court constitutes the bulk of his estate.”\nRemembering Stephen Sondheim\nThe revered and influential composer-lyricist died Nov. 26, 2021.",
    "The court filings include two documents — a will, written in 2017 with the estate lawyer Loretta A. Ippolito, that leaves all of his property to the revocable trust, and a probate petition, put together by Sondheim’s longtime friend and lawyer F. Richard Pappas, that lists beneficiaries of that trust.",
    "“$75 million is the estimated ceiling of the value of the assets that were in his name, which pass under the will to the Stephen J. Sondheim Revocable Trust,” T. Randolph Harris, a partner in the law firm McLaughlin & Stern, said when asked to help interpret the filings.",
    "Stephen Sondheim left the rights to all of his work — including his contribution to musicals such as “Sweeney Todd” and “Into the Woods,” as well as any unfinished shows — to a trust that will manage his estate.",
    "“The probate papers tell you who the beneficiaries are, but not who gets what, and that’s the point here,” said Andrew S. Auchincloss, an estate lawyer with Schlesinger Lazetera & Auchincloss.",
    "The trust will now determine what happens to the acclaimed composer and lyricist’s intellectual property, as well as all other property that he left behind when he died last fall.",
    "The plan for handling Sondheim’s assets is described in a probate petition signed last month and filed with Sondheim’s will in New York Surrogate’s Court.",
    "“Among other benefits, a revocable trust affords privacy to public figures and celebrities in the administration of their affairs,” she said.",
    "Alison Arden Besunder, a partner at Goetz Fitzpatrick, said reliance on a revocable trust was a common estate planning technique.",
    "Obituary: A titan of the American musical, Sondheim was the driving force behind some of Broadway’s most beloved shows.",
    "Sondheim, who had spent much of the pandemic at his country house in Roxbury, Conn., died in Connecticut on Nov. 26.",
    "His Legacy: As a mentor, a letter writer and an audience regular, Sondheim nurtured generations of theater makers.",
    "‘West Side Story’: Does the musical, which features some of the artist’s best-known lyrics, deserve a new hearing?",
    "Among them: Sondheim’s husband, Jeff Romley, and one of Sondheim’s best-known collaborators, James Lapine.",
    "A dozen individuals are also listed as beneficiaries, including friends, neighbors and former assistants.",
    "Final Interview: Days before he died, he sat down with The Times for his final major interview.",
    "The cause of death, according to a death certificate, was cardiovascular disease.",
    "The trust will also benefit a Stephen Sondheim Foundation, once that is created.",
    "‘Company’: The revival of his 1970 musical features a gender swap.",
    "“It’s being kept private.”\nBenjamin Weiser contributed reporting.",
    "The filings were previously reported by The New York Post.",
    "He was 91."
  ]
}