{
  "id": 6888,
  "mediaId": 2658,
  "date": "2022-01-25",
  "headline": "WOTUS in SCOTUS",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/morning-energy/2022/01/25/wotus-in-scotus-00001733",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1432,
    1900,
    1933,
    3700,
    4191,
    4294,
    4798,
    343,
    996,
    1149
  ],
  "sentences": [
    "“Given this significant development, the Biden administration should immediately cease its efforts to issue a new WOTUS definition rule that will greatly broaden the federal government’s jurisdiction over privately owned land and add layers of red tape for farmers, builders, small businesses, local governments, and many Americans,” Transportation Committee ranking member Sam Graves (R-Mo.)",
    "EUROPE’S NAT GAS FIGHT BURNS ON: Across the Atlantic, Europe’s debate on deeming natural gas and nuclear projects eligible for green financing rages on, with the European Commission’s advisory Platform on Sustainable Finance saying supporting the technologies “could not be considered sustainable” in a Monday report.",
    "Follow us on Twitter\nMatt Daily @dailym1\nGloria Gonzalez @ggonzalez2176\nMatthew Choi @matthewchoi2018\nZack Colman @zcolman\nAlex Guillen @alexcguillen\nBen Lefebvre @bjlefebvre\nAnnie Snider @annelizabeth18\nKelsey Tamborrino @kelseytam\nCatherine Morehouse @cmorehouse10\nJosh Siegel @SiegelScribe\nFollow Us",
    "In addition to advancing the reconciliation package that passed the House last year and is fermenting in the Senate, top priorities include fiscal year 2022’s appropriations legislation, which Democrats and environmentalists say is needed to finance the administration’s green goals for the year.",
    "In addition to $52 billion in incentives to bolster the domestic semiconductor industry and funding to advance U.S. research included in the Senate version, the House version is likely to include some language to tighten trade rules to strengthen the squeeze on Chinese imports, Gavin reports.",
    "The high court in some fashion will revisit its notoriously complex ruling in 2006 over what waters are federally protected that generated two litmus tests, a more stringent one concocted by Antonin Scalia and a broader one created by Anthony Kennedy that most courts have since relied on.",
    "A group of progressive senators wrote an amicus brief Monday supporting EPA in the power pollution case, casting the GOP-led challenge as a political exercise to benefit the fossil fuel industry “At this time, EPA is not regulating CO2 from existing coal-fired power plants at all.",
    "EXPERTS WANTED: EPA is seeking nominations for scientific experts to peer review a forthcoming technical support document underlying the Biden administration's refresh of the social cost of greenhouse gas (which will include carbon dioxide, methane and nitrous oxide).",
    "On The Hill\nCOMPETITIVE COMPETITIVENESS BILLS: The House could release its long-anticipated version of the China competitiveness bill as soon as today, setting up a contentious array of differences with the Senate version passed last year, Pro’s Gavin Bade scoops.",
    "They wrote the executive order “overlooks” high-octane liquid fuels’ ability to increase the transportation sector’s efficiency, and pointed to the contributions to security and sustainability from clean liquid motor fuels like ethanol and renewable diesel.",
    "But that technology is far from being financially enticing enough to effectively mitigate the climate changing impacts of burning fossil fuels, Kerry said, adding that the world is largely not on the right path to prevent the worst of a warming planet.",
    "“Given that climate is an issue with a lot of salience and a lot of bipartisan support out there, I think the types of candidates who EDF Action is going to be backing are pragmatic problem solvers who are committed to doing the right thing on climate.",
    "Around the agencies\nKERRY’S NAT GAS CAVEAT: U.S. climate envoy John Kerry said Monday he backs natural gas as a “transitional” energy source, qualifying his support by emphasizing the need for advanced emissions-capturing technology in the sector.",
    "KIEVE-N IT REAL: Ex-Biden administration official David Kieve said he’ll be getting back to his roots in campaigns and electoral work next month when he formally begins leading EDF Action, the Environmental Defense Fund’s political advocacy arm.",
    "CHARM CITY HEADS TO COURT: Climate will also be front and center today as a U.S. appeals court in Richmond, Va., considers whether the city of Baltimore’s climate lawsuit against BP and other energy companies belongs in state or federal court.",
    "Driving the Day\nSCOTUS TAKES ON WOTUS: The Supreme Court has taken on a second high-profile environmental case this term, putting a wrinkle in the Biden administration’s mission to expand what waters are protected under the Clean Water Act.",
    "\"I hope somebody will come up with the technology that will affordably capture the emissions,\" he said during an event hosted by the U.S. Chamber of Commerce, noting that new natural gas infrastructure would require “abatement” technology.",
    "WOTUS in SCOTUS\nBy MATTHEW CHOI\n01/25/2022 10:14 AM EST\n Updated 01/25/2022 10:24 AM EST\n 2022-01-25T10:24-0500\nPresented by the Edison Electric Institute\nWith help from Alex Guillén, Kelsey Tamborrino, Zack Colman and Jonathan Custodio.",
    "Among the potential proposals:\n— Reauthorization for two expired tariff exemption programs, the Generalized System of Preferences and Miscellaneous Tariff Bill, but with stricter labor and gender requirements than in the Senate version.",
    "The additions were triggered due to language included in the 2020 National Defense Authorization Act that automatically required adding the PFAS to the TRI list because of toxicity values published last year or other regulatory actions.",
    "The potential inclusion of natural gas and nuclear has already incensed many green activists who do not deem either on par with renewables like wind and solar, owing to natural gas’ climate changing emissions and nuclear waste.",
    "The high court agreed Monday to take on a case reexamining how its past rulings on “waters of the U.S.” have been implemented despite pleas from the Biden administration not to, Pro’s Annie Snider and Alex Guillén report.",
    "The White House has been pushing the House to get on with its bill, hoping for another legislative win after Democrats’ extensive voting rights package fell apart and their reconciliation bill came to a standstill.",
    "The Interagency Working Group set up last year to overhaul the calculation in light of economic and climate forecasting developments is apparently slipping past President Joe Biden’s initial January 2022 deadline.",
    "The order, they added, undermines national security since the build out of electric vehicles will rely on critical minerals largely sourced from China or countries where China has significant influence.",
    "The joining of forces of the liquid fuels supply chain comes as the Biden administration faces looming decisions about the future of the RFS and the role power generation for electric vehicles can play.",
    "— Baltimore's case against energy majors on their culpability in climate change will be scrutinized today as a federal appeals court weighs whether the suit should be heard in state or federal court.",
    "An agency spokesperson said EPA is “committed to establishing a durable definition,” but the latest case looming over the Biden administration’s head could put a damper on that regulatory effort.",
    "Kieve, who left the White House Council on Environmental Quality this month, tells ME that he sees EDF Action engaging in federal, state and even municipal races where climate is on the ballot.",
    "The letter, signed by 50 Republican lawmakers, opposes an executive order that Biden signed in December directing the federal government to procure 100 percent zero-emission vehicles by 2035.",
    "Also notable was the court’s rejection of argument time for North Dakota, which stands alone in pushing a legal theory that states and not EPA have the authority to set power plant standards.",
    "PLAYBOOK LIVE: House Minority Leader Steny Hoyer will be talking with POLITICO Playbook’s Rachael Bade today on House Democrats’ legislative priorities and the upcoming midterm elections.",
    "It isn’t the only SCOTUS case putting EPA’s authority on trial, with the court slated to hear oral arguments Feb. 28 on EPA’s authority to regulate power plant greenhouse gas emissions.",
    "EPA has oscillated between Democratic and Republican administrations on WOTUS definitions, with the Trump administration significantly narrowing protections set out in the Obama-era.",
    "Another layer of uncertainty is whether the Supreme Court will squeeze this case into this term, with an early summer ruling, or punt it to the fall, with a decision not until 2023.",
    "Quick Fix\n— The Supreme Court is taking on a case on the ever-fluid definitions of Waters of the U.S. just as EPA goes about trying to broaden protections under the Clean Water Act.",
    "Methane, a potent greenhouse gas, has been singled out by the U.S. and several major economies as a key target for rapid reductions due to its outsized impact on climate change.",
    "“On a very high level, I think there's real opportunity for EDF Action to support candidates of both parties who are serious about addressing the climate crisis,” he told Zack.",
    "FTI’s Chris Tucker gets the trivia for knowing Israel’s Ben Gurion International Airport is colloquially called “Natbag.” For today: What is the most populous town in Svalbard?",
    "One is that the justices decided to give some of EPA’s argument time to utilities aligned with the Biden administration, including ConEd, Exelon, National Grid and PG&E.",
    "FOUR PFAS ADDED TO REPORTING LIST: EPA has added four PFAS substances to the Toxics Release Inventory, through which various industries publicly report emissions.",
    "Congress only set statutory biofuel blending volumes through 2022, leaving EPA tasked with setting the volumes for the future of the program for 2023 and beyond.",
    "The lawmakers represent states home to both the petroleum and ethanol industries, and were led by Rep. Ashley Hinson (R-Iowa) and Rep. August Pfluger (R-Texas).",
    "This is the first appellate court to hear this issue since the Supreme Court ruled last May that appellate courts must review all of the companies’ arguments.",
    "“It also completely disregards the opportunities presented to reduce both cost and emissions immediately through traditional and emerging liquid motor fuels.",
    "Editor’s Note: Morning Energy is a free version of POLITICO Pro Energy’s morning newsletter, which is delivered to our subscribers each morning at 6 a.m.",
    "The Commission’s proposal remains open for comment until Friday and is expected to pass due to a high threshold of member countries required to tank it.",
    "EPA recently got sued over a pair of PFAS TRI reporting rules, which covered 175 \"forever chemicals\" before the addition of PFBS and the other three.",
    "KEEP YOUR ENEMIES CLOSER: Lawmakers traditionally on opposing sides of the Renewable Fuels Standard debate joined forces Monday in a letter to Biden.",
    "“This order ignores the challenges presented with forcing a single-technology approach to the federal government’s vehicle procurement,” they write.",
    "Check out the POLITICO Energy podcast — all the energy and environmental politics and policy news you need to start your day, in just five minutes.",
    "Kieve told Zack he’s optimistic climate can cut through today’s polarized politics, pointing to polling that shows support for clean energy jobs.",
    "— A government screening protocol for American investments in nations that “may threaten national critical capabilities,” including China.",
    "Facilities must immediately start tracking their use of the four PFAS, including PFBS, and report annual activity starting in July 2023.",
    "Much of that went to supporting Democratic candidates, including Biden — though it also backed Rep. Brian Fitzpatrick (R-Pa.).",
    "That could indicate heightened interest in hearing from regulated entities that don’t want EPA’s climate authority handcuffed.",
    "The court could name the Scalia test as controlling, or use the strengthened conservative majority to set a new standard.",
    "The POLITICO Pro platform combines the news you need with tools you can use to take action on the day’s biggest stories.",
    "The Court does not have the authority to review future, potential, or hypothetical administrative regulations,” Sens.",
    "The Grid\n— “Old-Fashioned, Inefficient Light Bulbs Live On at the Nation’s Dollar Stores,” via The New York Times.",
    "and Water Resources and Environment Subcommittee Ranking Member David Rouzer (R-N.C.) said in a statement Monday.",
    "EDF Action, EDF Action Votes and EDF Action PAC spent $18 million in the 2020 cycle, doubling its 2018 spending.",
    "Sheldon Whitehouse (D-R.I.), Richard Blumenthal (D-Conn.), Bernie Sanders (I-Vt.) and Elizabeth Warren (D-Mass.)",
    "The contractor will request comment on at least 15 nominees before selecting five to seven for the final panel.",
    "Environmentalists argued problematic exemptions led to low reporting figures for those other PFAS substances.",
    "He also didn’t rule out EDF Action backing Republican candidates who embrace that sort of vision.",
    "EPA will pass the nominations along to a to-be-determined contractor managing the peer review.",
    "— “After months of delays, state approves doubling of solar energy,” via The Boston Globe.",
    "However the 4th Circuit rules, expect the loser to appeal to the Supreme Court yet again.",
    "And I think we're gonna find a lot of them out there,” he told Pro's Zack Colman.",
    "The oral argument schedule released on Monday had a couple of eyebrow-raisers.",
    "— “VW agrees to $3.5 mln diesel emissions settlement with Ohio,” via Reuters.",
    "— Ending duty-free treatment for millions of low-value shipments from China.",
    "— The House could release its China competitiveness bill as soon as today.",
    "— “Oil falls 2% as Fed rate hike talk spooks risk markets,” via Reuters.",
    "Listen and subscribe for free at politico.com/energy-podcast.",
    "Lack of dais time doesn’t bode well for North Dakota’s case.",
    "House Republicans quickly called on EPA to hit the brakes.",
    "Send your tips and trivia answers to mchoi@politico.com.",
    "On today's episode: FERC’s shifting EJ focus.",
    "POLITICO Europe’s America Hernandez has more.",
    "— “Which Drugs Will Survive Climate Change?",
    "Find me on Twitter @matthewchoi2018.",
    "Act on the news with POLITICO Pro.",
    "Read more from Pro’s Zack Colman.",
    "Sign up to watch the event here.",
    "Nominations are due Feb. 15.",
    "I’m your host, Matthew Choi.",
    "We Investigated,” via Vice.",
    "Read more from Gavin.",
    "WELCOME TO TUESDAY!",
    "THAT’S ALL FOR ME!",
    "write."
  ]
}