{
  "id": 6913,
  "mediaId": 2586,
  "date": "2022-01-29",
  "headline": "NFL Hands Down Punishment to Tyreek Hill for His Actions Against Bills",
  "image": "https://heavy.com/wp-content/uploads/2022/01/Tyreek-Hill-Bills-1-e1643512321602.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/nfl-hands-down-punishment-to-tyreek-hill-for-his-actions-against-bills/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    0
  ],
  "sentences": [
    "Hey @NFL, you can’t use a highlight of a player’s celebration across all of your platforms and then fine them for it days later #hypocrisy https://t.co/VWMDMVkYPC\n— Kyle Bock (@KyleBock) January 29, 2022\nEnding Still Stings for Bills\nIt may not have made much of a difference if officials flagged Hill for the celebration.",
    "It was the second straight weekend that Hill drew a fine for a touchdown celebration, as the league also hit him with a $12,875 fine the previous week for using pom-poms to celebrate a 31-yard touchdown catch against the Pittsburgh Steelers, Pelissero reported at the time.",
    "The Kansas City Chiefs wide receiver flashed his trademark peace sign toward Bills defenders as he was racing to a 64-yard touchdown that gave his team a lead with just over a minute remaining in the January 23 divisional round playoff game.",
    "my best shot of the night pic.twitter.com/cx3Sr17hT3\n— Bryndon Minter (@Bryndon) January 25, 2022\nAfter the loss, Bills head coach Sean McDermott admitted that it was painful for all the players and coaches.",
    "Mike Florio of Pro Football Talk pointed out that he disagrees with this season’s crackdown on taunting penalties, but recognized that Hill’s “blatant” infraction still should have been called.",
    "The Bills were still able to score again on the next possession, with quarterback Josh Allen leading the team down the field for a go-ahead touchdown with 13 seconds remaining.",
    "… We will work tirelessly to do that and go about it the right way.”\nThe Bills will get a chance to get some measure of revenge against Hill and the Chiefs next season.",
    "Enforce the rule consistently, or get rid of it.”\nAs others pointed out, the league appeared to have an inconsistent approach to Hill’s touchdown and taunt.",
    "League Fines Hill for Celebration\nAs the NFL Network’s Tom Pelissero reported, the league on Saturday handed down a $10,300 fine to Hill for the taunt.",
    "He didn’t draw a flag for a mid-touchdown-run celebration against the Buffalo Bills, but Tyreek Hill will now be taking a hit to his wallet for it.",
    "“If you saw that plane ride on the way home, you would not come away with the impression that we’re fine,” he said, via Yahoo Sports.",
    "But Hill and the Chiefs answered back, racing down the field in two plays to get into field goal range for a game-tying kick.",
    "The play drew some pushback but no flag for taunting, though the league is now handing down a different punishment to Hill.",
    "Not only was it unflagged during the game, but the NFL also celebrated the play as one of the fastest runs of the week.",
    "The Chiefs won the coin toss to start overtime and never looked back, driving 75 yards for the winning touchdown.",
    "The teams are slated to meet again in the 2022 regular season, with the Bills returning to Arrowhead Stadium.",
    "There had already been some pushback during the week after officials failed to flag the play.",
    "“Everyone has single-minded focus to improve and committed to accomplishing one goal.",
    "We’re going to be human here and try to get a little bit of rest and get back on it.",
    "The latest Bills news straight to your inbox!",
    "The gesture is textbook taunting,” he wrote.",
    "“No flag was thrown for the obvious taunt.",
    "Join the Heavy on Bills newsletter here!",
    "this angle of @cheetah ????",
    "“It’s a simple concept.",
    "It should have been."
  ]
}