{
  "id": 6928,
  "mediaId": 4042,
  "date": "2022-01-24",
  "headline": "Josh Allen’s mega-star turn makes the Bills’ playoff loss less painful",
  "image": "https://cdn.vox-cdn.com/thumbor/R2Rj5XJPGv8cwBPBbBqHt_xBPjQ=/0x0:4220x2209/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23191427/1364878608.jpg",
  "link": "https://www.sbnation.com/nfl/2022/1/24/22899153/josh-allen-buffalo-bills-nfl-playoffs-highlights-stats-draft-omg",
  "mediaOutlet": "SB Nation",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ricky O'Donnell",
  "authorUrl": "https://www.sbnation.com/authors/ricky-odonnell",
  "termIds": [
    1282,
    1509,
    1587,
    2639,
    3171,
    3491,
    3583,
    3977,
    160
  ],
  "sentences": [
    "Here are his numbers in two postseason games against the Patriots and Chiefs:\n9 touchdowns\n0 turnovers\n771 total yards\n14 total incompletions\nAllen played a perfect game in the blowout win over New England, leading the Bills to a touchdown on every single drive that wasn’t interrupted by the end of the half.",
    "The great Jason Kirk wrote about all the troubling signs for Allen’s NFL future as he arrived in the league, concluding that if Allen was a successful pro, “the Bills will have outsmarted basically all regular humans and the entirety of math itself.”\nIt happened.",
    "#BillsMafia #NFLPlayoffs\n: #BUFvsKC on CBS\n: https://t.co/bCIjXIlFWh pic.twitter.com/udFm0TlSgN\n— NFL (@NFL) January 24, 2022\nAll of the physical tools that were apparent in Allen during his college career have fully come into focus.",
    "The Bills’ season ended in the second round of the 2022 NFL Playoffs on Sunday night with a heartbreaking loss to the Kansas City Chiefs, but the silver lining for Buffalo is that they have a burgeoning superstar at quarterback.",
    "The Chiefs ended Buffalo’s bid one win short of the Super Bowl, but Allen was very good, passing for 817 yards and five touchdowns to one interception while rushing for 145 yards across the team’s three-game postseason run.",
    "Allen was one of the most polarizing QB prospects in years, beloved by old school scouts for his prototypical tools, and mocked by college football fans and numbers nerds because he wasn’t that good in the Mountain West.",
    ": #BUFvsKC on CBS\n: https://t.co/bCIjXIlFWh pic.twitter.com/DgdL4Pwvnd\n— NFL (@NFL) January 24, 2022\nHe made plays with his legs, whether he was keeping it himself or bending the defense before making a throw.",
    "He’s a 6’5, 240-pound tank with a cannon for an arm, tremendous athleticism, the accuracy to hit receivers all over the field, and the toughness to keep gaining yards on the ground after contact.",
    "Allen’s line of 21-for-25 for 308 yards, five touchdowns, and zero interceptions (to go along with 66 yards rushing) was hailed as one of the best playoff performances by a QB in recent memory.",
    "#NFLPlayoffs\n: #BUFvsKC on CBS\n: https://t.co/bCIjXIlFWh pic.twitter.com/NrxNk9jSHq\n— NFL (@NFL) January 24, 2022\nJOSH ALLEN AND GABRIEL DAVIS' 4TH TD GIVES THE BILLS THE LEAD WITH 17 SECONDS.",
    "Unfortunately, the Bills lost the coin toss in overtime, and Allen never got to touch the ball before Mahomes ended the game on a TD throw to Travis Kelce on the team’s first possession.",
    "#BillsMafia #NFLPlayoffs\n: #BUFvsKC on CBS\n: https://t.co/bCIjXIlFWh pic.twitter.com/8E7vBQo8eo\n— NFL (@NFL) January 24, 2022\nJust look at this backfoot touchdown toss under pressure.",
    "The last time the Bills had a franchise QB, Jim Kelly helped lead the team to eight trips to the NFL playoffs over a nine-year span, including four consecutive Super Bowl appearances.",
    "#NFLPlayoffs\n: #BUFvsKC on CBS\n: https://t.co/bCIjXIlFWh pic.twitter.com/MSYXxvSTnU\n— NFL (@NFL) January 24, 2022\nHow many quarterbacks alive are capable of making this play?",
    "The results weren’t pretty: the Bills missed the playoffs for 17 consecutive seasons, which was the longest playoff drought in the four American professional sports leagues.",
    "Taylor was at the helm when the Bills finally reached the postseason with a 9-7 record in 2017, but Buffalo knew they still needed an upgrade at QB.",
    "The Buffalo Bills wandered the quarterback desert for more than two decades looking for a long-term answer at the most important position in sports.",
    "#NFLPlayoffs\n: #BUFvsKC on CBS\n: https://t.co/bCIjXIlFWh pic.twitter.com/lwB9IZtTXt\n— NFL (@NFL) January 24, 2022\nHow’s this for power and accuracy?",
    "Head coach Sean McDermott and offensive coordinator Brian Daboll do a wonderful job of designing a gameplan meant to leverage Allen’s strengths.",
    "Allen threw two beautiful touchdowns with under two minutes left in regulation that each put the Bills ahead:\nTHE @BUFFALOBILLS HAVE THE LEAD.",
    "#BillsMafia #NFLPlayoffs\n: #BUFvsKC on CBS\n: https://t.co/bCIjXIlFWh pic.twitter.com/Kjf7mpd2UK\n— NFL (@NFL) January 24, 2022\nKeeps it.",
    "His first playoff appearance came in his second pro season, and saw the team lose their opening game to the Houston Texans in overtime.",
    "Against the Chiefs, Allen ended the night 27-for-37 for 329 yards, four touchdowns and no interceptions (with 68 yards rushing).",
    "They traded a future first round pick for 30-year-old Drew Bledsoe after a backup named Tom Brady stole his job in New England.",
    "He’s not just a franchise quarterback, he looks like he should be one of the NFL’s defining players over the next 5-10 years.",
    "He matched the great Patrick Mahomes on every throw, and the result was one of the great football games anyone has ever seen.",
    "The worries about his accuracy and footwork were legitimate, but credit Allen for improving at a rapid rate.",
    "It might have been the most impressive play of the night from Allen, but there are so many other options.",
    "Allen leveled up in his next season, leading the Bills on an unlikely run to the AFC Championship Game.",
    "The Bills put him in a position to succeed with an impressive WR group and a solid offensive line.",
    "Allen put up 264 yards passing and 92 yards rushing, but completed only 52 percent of his passes.",
    "The Bills have now made the NFL Playoffs in three straight seasons with Allen at quarterback.",
    "What a beauty — 75 yards against two deep safeties right into the receiver’s bread basket.",
    "After years of employing QBs who weren’t good enough, the Bills officially have a stud.",
    "To see Allen bomb the ball all over the field with impressive accuracy was startling.",
    "7 overall pick in the 2018 NFL Draft, the Bills selected Josh Allen out of Wyoming.",
    "They signed free agents like Ryan Fitzpatrick, Kyle Orton, and Tyrod Taylor.",
    "Four years into his pro career, Allen has proven the Bills to be geniuses.",
    "Somehow, he might have been even better against the Chiefs even in defeat.",
    "This season, his fourth as a pro, Allen was nothing short of spectacular.",
    "Allen had major accuracy issues and poor footwork coming out of Wyoming.",
    "Then Kelly retired after the 1996 season, and things got really dark.",
    "The numbers are wonderful, but they don’t do his performance justice.",
    "They signed 36-year-old Doug Flutie after a long career in the CFL.",
    "They spent first round draft picks on J.P. Losman (2004) and E.J.",
    "The Bills explored every avenue to find an answer at quarterback.",
    "Buffalo’s playoff loss stings, but at least they have Josh Allen.",
    "The Bills have a prototype under contract for a long time.",
    "Josh Allen counters with a ridiculous TD throw of his own!",
    "Josh Allen singlehandedly keeps the Bills drive alive!",
    "More than anything, though, Allen is wildly talented.",
    "Allen shouldn’t hang his head, though.",
    "He’s the total package for an NFL QB.",
    "Josh Allen picks up the first down.",
    "A laser from @JoshAllenQB.",
    "Josh Allen is SUPERHUMAN.",
    "Just look at this throw.",
    "He was unbelievable.",
    "I think just one.",
    "Manuel (2013).",
    "With the No."
  ]
}