{
  "id": 6935,
  "mediaId": 2586,
  "date": "2022-01-19",
  "headline": "Bills Safety Jordan Poyer on Josh Allen: ‘A Big, Goofy A** Dude’",
  "image": "https://heavy.com/wp-content/uploads/2022/01/Jordan-Poyer-e1642640620902.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-safety-poyer-allen-goofy/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    2213,
    2523,
    2816,
    3507,
    3583,
    3707,
    160,
    539,
    700,
    720
  ],
  "sentences": [
    "Jordan Poyer has nothing but love for Josh Allen — even if he does think the Buffalo Bills quarterback is a bit “goofy.”\nPoyer wore a microphone for NFL Films during the team’s 47-17 drubbing on the New England Patriots in Saturday’s Super Wild Card round, catching some candid descriptions of his quarterback.",
    "pic.twitter.com/nnw8t2bM9w\n— B/R Gridiron (@brgridiron) January 19, 2022\nPoyer Focused on the Next Task\nWhile his sideline antics from Saturday’s game may be getting big attention on social media, Poyer remains focused solely on the next task for the Bills.",
    "“Once we lost Tre’Davious, who was arguably one of our top leaders in the secondary along with Micah and Jordan but on our defense in its entirety, that left a void and we were wondering, you know, who’s going to step up?” Frazier said, via ESPN.",
    "#BillsMafia @J_Poyer21 | @NFLFilms pic.twitter.com/A1QIVFaDnj\n— Buffalo Bills (@BuffaloBills) January 18, 2022\nAllen turned in one of the finest games of his career, completing 21 of 25 passes for 308 yards and five touchdowns.",
    "And Levi, I mean, he’s been terrific as far as helping Dane, communicating with him, talking with him, watching tape with him, really leading the other guys in our secondary that are the next guy up.”",
    "After Allen turned around Patriots cornerback De’Vante Bausby with a juke move on a quarterback scramble, Poyer and Wallace watched on in awe and poked fun at Allen a bit.",
    "As Allen was dicing up the Patriots defense on a near-perfect day, Poyer and teammate Levi Wallace marveled at Allen while also joking about his “goofy” demeanor.",
    "The blowout win over the Patriots earned the Bills a rematch with the Kansas City Chiefs, who ended their season in the AFC Championship game last year.",
    "Poyer Loves His ‘Goofy’ Teammate\nVideo captured Poyer on the sidelines giddy over how well Allen was playing against the highly rated Patriots defense.",
    "Bills defensive coordinator Leslie Frazier said that it takes contributions from all members of the secondary to make up for White’s absence.",
    "pic.twitter.com/ft5RYOoLcP\nThe Bills will be without All-Pro cornerback Tre’Davious White, who was lost to a season-ending ACL tear.",
    "Another video showed him getting teammates pumped with in a NSFW pregame rant that called out Patriots players for being arrogant.",
    "I asked a few #Bills players about how much the loss to the #Chiefs in last year's AFC Championship game still sticks with them.",
    "Poyer said that the loss stuck with him and his teammates, which they turned into motivation to come back stronger this season.",
    "Poyer and fellow safety Micah Hyde have stepped up in his absence, as have cornerbacks Levi Wallace and Dane Jackson.",
    "The sideline analysis of Allen was not the only soundbite from Poyer’s night that caught some viral attention.",
    "Allen added another 66 yards rushing on six carries, leaving the Patriots’ defense with no answers for him.",
    "“They have zero idea how goofy he is,” Poyer said, before he and Wallace shared how much they love Allen.",
    "… It’s the end of an era for them tonight.”\nThe @buffalobills were coming for blood on Saturday ??",
    "“Who’s going to fill that role both verbally as well as production-wise?",
    "Let’s go!”\n“You see how cocky these motherf–kers are right now, man?",
    "“This is a big goofy a** dude at quarterback,” Poyer said.",
    "“They really don’t know how goofy he is,” Wallace replied.",
    "Of course we still have that bad taste in our mouth.\"",
    "“We gotta hit these guys in the mouth,” he said.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "We feel the same way about @JoshAllenQB.",
    "It’s an end of an era for them tonight.",
    "\"Things like that you don't forget.",
    "“You see how cocky these guys are?",
    "Devin Singletary w/ best answer.",
    "I’m tired of these (expletive).",
    "An end of a f***ing era.",
    "Man, f** them, man.",
    "When we lost.",
    "How we lost.",
    "F–k them.",
    "??"
  ]
}