{
  "id": 6939,
  "mediaId": 2586,
  "date": "2022-01-24",
  "headline": "Bills QB Josh Allen Shares Surprising Take on Controversial OT Rule",
  "image": "https://heavy.com/wp-content/uploads/2022/01/Josh-Allen-Chiefs-e1643056244703.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-qb-allen-ot-rule/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    2164,
    3583,
    4285,
    160,
    539
  ],
  "sentences": [
    "Tackle Dion Dawkins said after the game that there is too much of an advantage to the team that wins the coin toss, calling it “the most craziest rule in all of sports.”\n“I think that that’s the most craziest rule in all of sports.” Dion Dawkins on overtime rules\nSays the 50/50 of coin toss carries too much weight: “This ain’t Vegas.”\n— katherine fitzgerald (@kfitz134) January 24, 2022\nDisparities in Playoff Overtime\nThere appears to be some evidence to support the gripes that many Bills fans shared about playoff overtime fates.",
    "pic.twitter.com/UqP4vE6nc0\n— Emmanuel Acho (@EmmanuelAcho) January 24, 2022\nUnder the current overtime format, which ends with a touchdown or a safety on an opening drive but allows the opposing team the chance for another drive if the first team with the ball fails to score or scores only a field goal, teams that win the coin toss are 10-1 overall, with seven of those games ending on the first drive.",
    "While many wanted to see Allen get a chance to respond and continue with what some consider one of the best quarterback performances in playoff history, others pointed to the evidence, noting that the current format gives an undue advantage to the teams winning the coin toss.",
    "The Saints in the 2018 NFC Championship Game against the Rams pic.twitter.com/H4pDBdrw3j\n— Pickswise (@Pickswise) January 24, 2022\nThe Bills are now 0-2 in playoff overtime games under the current rules, also losing in Allen’s playoff debut to the Houston Texans in 2020.",
    "— NFL (@NFL) January 24, 2022\nAs Allen noted, the Bills defense failed to stop the Chiefs over the end of regulation and the first drive of the fourth quarter, allowing Patrick Mahomes to throw for an unreal 177 yards after the two-minute warning.",
    "Allen’s Thoughts on Overtime\nAfter the end of four quarters in a game many considered to be one of the most exciting playoff contests of all time, the one-sided overtime frame left many feeling cheated.",
    "The Chiefs won the coin toss to start overtime and never looked back, delivering a 75-yard touchdown drive that left many fans sore over NFL rules that don’t always give both teams a chance in overtime.",
    "Bills fans complained that Allen never got the chance to lead the Bills back, and many took to Twitter to call on the NFL to make a more equitable extra frame that someone gives both teams a chance.",
    "But Allen admitted that he was fine with the rule the way it is, saying he would have been happy if the Bills had won the toss and ended the game on a single drive the way the Chiefs did to them.",
    "Allen led the Bills on two go-ahead scoring drives within the last two minutes of the fourth quarter, but saw the Chief charge back each time, eventually tying on a field goal as time expired.",
    "Buffalo Bills fans advocating for a change to the NFL’s overtime rules after Sunday’s heartbreaker won’t have Josh Allen on their side.",
    "The Bills quarterback spoke out after the 42-36 loss to the Kansas City Chiefs in the January 24 divisional round playoff game.",
    "Teams that win the opening coin toss are 10-1 in the playoffs under the current overtime rules, per @NFLResearch\nThe lone loss?",
    "I can’t complain about that because if it was the other way around, we’d be celebrating too,” Allen said, via CBS Sports.",
    "Not allowing Josh Allen, the best player in today’s game, to touch the ball in overtime is one thing the @NFL must fix.",
    "After the game, Allen shared his thoughts about the heartbreaking ending and the controversial rule.",
    "Not all of Allen’s teammates shared his assessment of the league’s overtime rules.",
    "Josh Allen walks off the field after a loss to the Kansas City Chiefs.",
    "The NFL is the greatest league in sports because of the parity.",
    "We just didn’t make enough plays tonight.”\nMAHOMES TO KELCE.",
    "The last team drafts first, the first team drafts last.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "“It is what it is at this point.",
    "“The rules are what they are."
  ]
}