{
  "id": 7055,
  "mediaId": 2890,
  "date": "2022-01-27",
  "headline": "The extraordinary success of Covid-19 vaccines, in two charts",
  "image": "https://cdn.vox-cdn.com/thumbor/svDJPM51EW8TYsTep3xV30QzBtU=/0x1549:1800x2491/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23196946/model_vax_unvaxxed.jpg",
  "link": "https://www.vox.com/22894978/covid-19-vaccine-lives-saved-deaths-avoided-omicron-chart",
  "mediaOutlet": "Vox",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Umair Irfan",
  "authorUrl": "https://www.vox.com/authors/umair-irfan",
  "termIds": [
    5371
  ],
  "sentences": [
    "But another story of the pandemic focuses on its unprecedented scientific achievements: In record time, scientists went from discovering a new virus to unpacking its genome to developing multiple effective ways to prevent and treat it, fueling what may be the largest public health effort in history.",
    "In a paper published this month in the journal JAMA Network Open, several of the same researchers estimated that Covid-19 vaccines averted more than 240,000 deaths between December 12, 2020, and June 30, 2021, before the worst of the delta variant ignited in the US.",
    "From the start of the US vaccination campaign through the end of November 2021, Covid-19 vaccines prevented about 1.1 million deaths and 10.3 million hospitalizations in the United States, according to estimates by the health care foundation The Commonwealth Fund.",
    "Covid-19 vaccines arrived in time to radically alter the pandemic\nTo figure out how many people would have died without vaccines, researchers drew on real-world observations of Covid-19 impacts on the population and actual vaccination rates across the US.",
    "One is that a cataclysm we weren’t prepared for — worsened by policy mistakes, misinformation, and global inequity — claimed more than 5 million souls and stalled the lives and livelihoods of billions of people around the world.",
    "The US government spent upward of $40 billion to develop Covid-19 vaccines, but Gupta estimated their value in terms of lives saved — just a few months into the campaign — at as much as $1.4 trillion.",
    "In that same six-month window, vaccines were estimated to have prevented 1.1 million hospitalizations and halted 14 million infections, showing that more than 338 million doses had a powerful effect.",
    "Sumedha Gupta, a health policy economist at Indiana University—Purdue University Indianapolis, created a model that used the varying vaccination rates between states as a natural experiment.",
    "“Not only did our vaccination program really suppress the ongoing surge ... but it also helped avoid a later spring wave that would have happened with variant emergence,” said Fitzpatrick.",
    "It may be a source of frustration, given that effective vaccines are going unused among millions of people, even as the unvaccinated form the dominant share of hospitalizations and deaths.",
    "The recent wave of infection in the United States spurred by the omicron variant may have already crested, and the proportion of deaths appears to be smaller than in previous surges.",
    "The number of lives saved might not comfort those who have lost loved ones or are struggling with unemployment, social isolation, and the lasting effects of a Covid-19 infection.",
    "Much of the infrastructure for reporting tests and tracing contacts of infected people remains an ad hoc patchwork, making it difficult to track and respond to outbreaks.",
    "“What we’re still seeing right now is that omicron is undermining the protection that we had previously seen from both vaccines and natural infection,” Fitzpatrick said.",
    "Even without counting the continued impact of the omicron variant in 2022, it’s a stunning effect that presents a different side to the story of the pandemic.",
    "Without these so-called non-pharmaceutical interventions, the shortcomings of the vaccination program have become more apparent as new variants have emerged.",
    "Gupta and her team found that by May 9, 2021 — less than six months into the vaccination effort — vaccines had already prevented 140,000 people from dying.",
    "Compared to vaccinated people, the unvaccinated are 15 times as likely to die from Covid-19, according to the Centers for Disease Control and Prevention.",
    "The scale of the lives saved can still show how our actions now can prevent further misery and could shape the future of the pandemic for the better.",
    "But the Covid-19 vaccines also had knock-on impacts because they slowed the transmission of the virus, which helped protect unvaccinated people too.",
    "The emphasis that we had on getting the vaccines out fast ... was the right impulse.”\nThese conclusions line up with other estimates of lives saved.",
    "Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all.",
    "But the sheer impact of vaccines highlights how much unnecessary suffering is continuing in places that are still struggling to get enough shots.",
    "Public gatherings have resumed across the country and mask mandates have been lifted, even in places where Covid-19 transmission remains high.",
    "Gupta found that the most vulnerable groups benefited the most: the elderly, the immunocompromised, those with preexisting health conditions.",
    "From there, the scientists calculated what would have happened if there were no vaccines (as well as if the vaccination rate were halved).",
    "“It was larger than we would’ve expected,” said coauthor Meagan Fitzpatrick, an infectious disease modeler at the University of Maryland.",
    "It may seem puzzling that half of all US Covid-19 deaths — that’s more than 430,000 people — occurred after vaccines began rolling out.",
    "Continuing to invest in the ongoing vaccination effort, not only in the US but also globally, would likely tip the scale even further.",
    "The results showed that the timing of the vaccines — which were developed faster than any new vaccine in history — had a huge impact.",
    "While the US has leaned hard on vaccines in its Covid-19 strategy, it has neglected other ways to limit the impacts of the infection.",
    "Covid-19 is still here, and about a quarter of the US population — more than 80 million people — haven’t received the shots at all.",
    "But we have far more agency than we may realize, and with a more thoughtful public health strategy, many more lives can be saved.",
    "“It really was a problem of too much hubris, that [many believed] vaccines would be the only thing we needed,” said Fitzpatrick.",
    "The US government has only recently begun to distribute free rapid Covid-19 tests and high-quality face masks on a large scale.",
    "At the same time, the virus is changing in ways that allow it to better evade vaccines, as the omicron variant has shown.",
    "That means that the benefits of vaccines have not been exhausted, and some of the misery right now is avoidable.",
    "Even now, Covid-19 vaccines are saving lives, and an estimate of the lives saved into 2022 would be even larger.",
    "In the US, vaccines began distribution in December 2020, and they were offered to all US adults by April 2021.",
    "By studying the number of lives saved and how those deaths were averted, we can decide what to do next.",
    "Trackers have counted the mounting death toll since 2020, each spike revealing setbacks and missteps.",
    "But the large majority of the people hospitalized and dying of Covid-19 right now are unvaccinated.",
    "Our mission has never been more vital than it is in this moment: to empower through understanding.",
    "Covid-19 vaccines are an example of what’s possible with enough urgency, resources, and know-how.",
    "The mass-vaccination campaign kicked in just as the country was facing a major wave of new cases.",
    "But estimates of the potential death toll, in red, suggest that vaccines averted a catastrophe.",
    "These studies focused on the US, which has managed to vaccinate a majority of its population.",
    "They created a model of Covid-19 transmission and fit their model to what actually happened.",
    "To understand the current moment, we need both — the harm done as well as the harm avoided.",
    "“It’s not ‘either/or,’ it’s ‘both-and.’”\nThese lessons extend beyond the current pandemic.",
    "Once vaccines were widely available, much of the suffering of the pandemic was avoidable.",
    "Covid-19 has taken a terrible toll, as the graph of daily Covid-19 deaths shows in blue.",
    "We may not be able to prevent every death, every new mutation, or every future pandemic.",
    "Looking at the pandemic through the lens of saving lives is a case for not giving up.",
    "The Commonwealth study wasn’t peer-reviewed, but it builds on a methodology that was.",
    "Scientists have modeled a world without vaccines and found some surprising answers.",
    "Deploying the same tactics to other illnesses could prevent even more suffering.",
    "As the pandemic drags into its third year, it’s hard to see it any other way.",
    "“I think the main takeaway is really focusing on speed and not just coverage.",
    "Perhaps, we can even find some hope and optimism amid a stream of misery.",
    "The question is, how do we figure out how many deaths were avoided?",
    "That share will grow for as long as people keep dying of Covid-19.",
    "Millions turn to Vox to understand what’s happening in the news.",
    "But these numbers can obscure the progress against the disease.",
    "The most visible part of the pandemic is what has been lost.",
    "“We’re really leaving benefits on the table,” Gupta said.",
    "There are several ways to look at the Covid-19 pandemic.",
    "Please consider making a contribution to Vox today.",
    "Will you support Vox’s explanatory journalism?",
    "Immunity from vaccines also wanes over time.",
    "How can vaccines reach their full potential?",
    "“That seems like a no-brainer,” Gupta said.",
    "Vaccines have absorbed much of the shock.",
    "They were also an immense bargain.",
    "In This Stream",
    "It still is."
  ]
}