{
  "id": 7077,
  "mediaId": 2712,
  "date": "2022-01-26",
  "headline": "What Disney Channel series and movies did Brenda Song star in?",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2021/04/EP_BRENDASONG_OFFPLATFORM-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1",
  "link": "https://www.thesun.co.uk/tvandshowbiz/celebrities/14639736/disney-channel-series-movies-brenda-song/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Roback",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "more from disney\nDISNEY DELIGHT\nI'm a Disney superfan and have spent £15k on my obsession\nGREEN LIT\nHow to watch She-Hulk online\nMARVEL-LOUS\nHow to watch the Marvel movies in chronological order on Disney+\nWHAT MAGIC\nInside the Florida town designed by Disney with hospital, school & 11,000 locals\nStuck in the Suburbs\nMovie poster for Disney Channel Original Movie Stuck in the SuburbsCredit: Disney\nFollowing her role on The Ultimate Christmas Present, Song starred in the Disney Channel Original Movie Stuck in the Suburbs alongside Danielle Panabaker.",
    "The Suite Life of Zack and Cody\nShow poster for Disney's Suite Life of Zack and CodyCredit: Disney\nFollowing Phil of The Future, from 2005-2008, Song appeared on the hit Disney Channel show, The Suite Life of Zack and Cody, alongside Dylan and Cole Sprouse and Ashley Tisdale.",
    "Wendy Wu: Homecoming Warrior\nMovie poster for Disney's Wendy Wu: Homecoming WarriorCredit: Disney\nIn between filming of The Suite Life of Zack and Cody, Song got her own Disney Channel Original Movie, Wendy Wu: Homecoming Warrior, which premiered in 2006.",
    "Phil of The Future\nShow poster for Disney Channel's Phil of the FutureCredit: Disney\nFrom 2004-2005, Song stared in eight episodes of Phil of The Future, a show about a family from the year 2121 that is stuck in 2004 trying to fit in.",
    "The Suite Life on Deck\nShow poster for Disney's show The Suite Life on DeckCredit: Disney\nFollowing the end of The Suite Life of Zack and Cody, Song reprised her role as London Tipton in the spin-off series, The Suite Life on Deck.",
    "The Ultimate Christmas Present\nThe cast of Disney's Ultimate Christmas PresentCredit: Rex\nSong got her start on Disney Channel after starring in the 2000 movie The Ultimate Christmas Present alongside Hallee Hirsh.",
    "Song continues her role of London Tipton in the movie where her character ends up with the ability to talk to animals and finds out that Zack and Cody are in trouble as she joins in on the rescue to save them.",
    "The show followed the lives of London, Zack, and Cody after they enrolled in Seven Seas High, a semester-at sea program, where they sailed around the world on the SS Tipton, a ship owned by London's father.",
    "The 2004 movie follows Brittany (Panabaker), a girl who is bored with her suburban life, as she finds excitement in her life once her phone is switched with top teen pop singer Jordan Cahill (Taran Killam).",
    "Arguably one of her most famous roles, Song played London Tipton, the Yay Me daughter of Wilfred Tipton, the multi-billionaire owner of the Tipton Hotels chain, where Zack and Cody lived.",
    "Following her success from the Suite Life series, she also guest-starred on multiple other Disney productions as London Tipton, including, Hanna Montana and Wizards of Waverly Place.",
    "In the movie, a doctor approaches the twins Zack and Cody to tell them about the Gemini Project, a study about the effects of twins, but ultimately ends up in trouble for the boys.",
    "Song also competed in the Disney Channel Games and made guest appearances on That's So Raven and voiceovers for Disney's Lilo & Stitch: The Series, and Phineas and Ferb.",
    "The Suite Life Movie\nMovie poster for The Suite Life movieCredit: Disney\nFollowing the success of The Suite Life franchise, Disney Channel made a movie based on it.",
    "Brenda Song at The Paley Center for the Media's 2019 PaleyFest Fall TV PreviewsCredit: Getty\nWhat movies and series did Brenda Song star in on the Disney Channel?",
    "The movie stars Song, who plays Wendy, the California teenager that learns she is the reincarnation of a legendary female warrior destined to protect the world.",
    "The show also starred Disney Channel alum Debby Ryan and had multiple guest appearances from Ashley Tisdale, who reprised her role as Maddie Fitzpatrick.",
    "She also took part in Disney channel cross-over episodes, That's So Suite Life of Hannah Montana in 2007 and Wizards on Deck with Hannah Montana in 2009.",
    "In the movie, Sam Kwan (Song) and Allie Thompson (Hirsh) steal a weather machine from Santa Claus in order to try and make a snow day in LA.",
    "Song, 33, hasn't slowed down since she rose to fame thanks to her roles on the Disney Channel, and is engaged to Macaulay Culkin.",
    "During the film, Brittany and her new friend Natasha (Song) decide to mess with Jordan's career and find out the truth behind it.",
    "Song won the Young Artist Award for Best Performance in a TV Movie Comedy, Supporting Young Actress, for her role in the film.",
    "On the show, Song played Tia, Keely's best friend who is skeptical of Phil at first before the three become good friends.",
    "It received one of the highest ratings in Disney Channel Japan and also broke a record in Europe and the United Kingdom.",
    "Like us on Facebook at www.facebook.com/TheSunUS and follow us from our main Twitter account at @TheSunUS",
    "This was one of Disney's first movies and ended up being one of the most-watched telecasts of its time.",
    "The machine breaks down and causes an uncontrollable snowstorm that they have to try and fix.",
    "The pair named him after Macaulay’s late sister, who died in a car accident in 2008.",
    "Song was later replaced by Juliet Holland-Rose after getting cast as London Tipton.",
    "The two welcomed their first child together, son Dakota, on April 5, 2021.",
    "It was also the first Disney Channel Original Movie to air on ABC Family.",
    "ONE of the most famous names to come from Disney Channel is Brenda Song.",
    "Did Brenda Song appear as a guest in other hit Disney Channel shows?",
    "Here's a look at some of the series and movies Song starred in.",
    "On January 26, 2022, it was announced that they were engaged.",
    "Song began dating Home Alone star Macaulay Culkin in 2018.",
    "Email us at exclusive@the-sun.com or call 212 416 4552.",
    "The movie was quite a success for Song and Disney.",
    "Do you have a story for The US Sun team?",
    "Who is Brenda Song engaged to?",
    "We pay for your stories!"
  ]
}