{
  "id": 7084,
  "mediaId": 6615,
  "date": "2022-01-28",
  "headline": "Here's what must be on Tennessee Titans' checklist this offseason",
  "image": "https://www.gannett-cdn.com/presto/2018/09/09/PNAS/16493748-45ec-46d3-905a-fd6733fa0f7a-_GW50189.JPG?crop=2929,1648,x0,y0&width=2929&height=1648&format=pjpg&auto=webp",
  "link": "https://www.tennessean.com/story/sports/nfl/titans/2022/01/28/tennessee-titans-offseason-2022-priorities/6612246001/",
  "mediaOutlet": "Tennessean",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Arthur",
  "authorUrl": "https://www.tennessean.com/staff/4828851001/ben-arthur/",
  "termIds": [
    0
  ],
  "sentences": [
    "Yet even if team decision makers feel he’s their starting quarterback moving forward – coach Mike Vrabel endorsed Tannehill at his end-of-season news conference Monday – the reality is he’s approaching his age-34 season after a year of regression.",
    "Titans defensive coordinator Shane Bowen used longtime NFL defensive coach Jim Schwartz, hired as senior defensive assistant, as a sounding board for ideas in 2021, and it led to Tennessee having one of the most improved units in the league.",
    "While it appears play-caller Todd Downing is staying put, maybe the team brings in a quarterback specialist to help get Tannehill back to his 2019 and 2020 form, when he was one of the league’s most efficient quarterbacks.",
    "Ideally, the draftee would challenge Tannehill in the upcoming season – if not starting ready right away – and take over the job after 2022, when the team could save $17.8 million by releasing or cutting Tannehill.",
    "Here are four agenda items that should be on the Titans’ offseason checklist:\nHone a quarterback plan\nThere is a feeling among team observers that the Titans have reached their peak with quarterback Ryan Tannehill.",
    "Shore up outside linebacker, cornerback spots\nAfter struggles in 2020, the Titans’ defense transformed into an elite unit, ranking in the top six in points allowed, third-down efficiency and stopping the run.",
    "Tennessee’s second-leading receiver this past season, Nick Westbrook-Ikhine, figures to be back – he can be tendered as an exclusive rights free agent – but the team could use a legitimate No.",
    "The Titans could clear $33.5 million in cap space by releasing all four by June 1: $12.9 million for Lewan, $10.5 million for Saffold, $6.9 million for Jenkins and $3.2 million for Lamm.",
    "MIKE VRABEL:Tennessee Titans' Mike Vrabel named 2021 NFL Coach of Year by Pro Football Writers of America\nIf Landry walks, the Titans will need a plan at outside linebacker.",
    "Kristian Fulton and Elijah Molden appear to be locked in at outside corner and nickelback, respectively, but that still leaves a hole at the other outside cornerback spot.",
    "Pro Bowl edge rusher Harold Landry, the Titans’ sack leader the last three seasons who posted a career-high 12 this season, is set to be an unrestricted free agent.",
    "Fill roster needs on offense\nWhile last offseason saw an overhaul on the defensive side of the ball, the offense is the unit poised for a big change this offseason.",
    "The Titans are in the red with cap space, Bud Dupree is already making $16 million a year and there is Jeffery Simmons’ future contract to keep into consideration.",
    "Similar to their trade for Tannehill to back up Marcus Mariota in the 2019 season, the Titans could also look to acquire a cheap veteran via trade or free agency.",
    "While fourth-rounder Rashad Weaver will be back – he played just two games as a rookie due to a leg injury – Tennessee could need veteran depth at the spot.",
    "The Tennessee Titans will have tough decisions to make this offseason after another year defined by regular-season success and playoff disappointment.",
    "Create cap space\nThe Titans are $6.435 million over their projected cap space for 2022, sixth worst in the NFL, according to Over The Cap.",
    "The cornerback play was the weakness in the Titans’ drastically improved defense, as they ranked 25th in passing yards allowed per game.",
    "Offensive linemen Taylor Lewan, Rodger Saffold and Kendall Lamm and cornerback Jackrabbit Jenkins are among the cap casualty candidates.",
    "And right guard Nate Davis may be the only locked-in starter next season on the offensive line, which struggled in pass protection.",
    "Center Ben Jones is set to be an unrestricted free agent and right tackle David Quessenberry will be a restricted free agent.",
    "The Josh Reynolds free-agent signing was a failure, and fourth-rounder Dez Fitzpatrick was a disappointment as a rookie.",
    "Because of Tannehill’s contract, pursuing high-end quarterbacks like Russell Wilson and Aaron Rodgers is unrealistic.",
    "First-round pick Caleb Farley is the natural choice to step in for 2022, but he enters Year 2 coming off a torn ACL.",
    "Jonnu Smith’s departure last free agency left a big void in pass catching – particularly in the red zone.",
    "Tennessee could use another veteran at the position as a stop-gap, one who is younger than Jenkins.",
    "In addition to quarterback, there are concerns at receiver, tight end and on the offensive line.",
    "Tennessee this could draft a quarterback in the first round or in the middle rounds in April.",
    "They must be cap compliant by March 16 and need financial flexibility to improve the roster.",
    "1 tight end, after using the trio of Geoff Swaim, Anthony Firkser and MyCole Pruitt.",
    "The left side of the line could be gone, if Lewan and Saffold are cap casualties.",
    "A third option: making upgrades to, or shaking up, the offensive coaching staff.",
    "Any cap space Tennessee created this season could go toward fixing the offense.",
    "So a wave of veteran cuts could be coming for Tennessee, just like last year.",
    "Contact him at barthur@gannett.com and follow him on Twitter at @benyarthur.",
    "Brown and Julio Jones, who’s coming off the least production of his career.",
    "Their passing game dramatically regressed when neither was on the field.",
    "There are question marks at outside linebacker and cornerback, though.",
    "But his contract essentially guarantees he’ll be in Tennessee in 2022.",
    "Ben Arthur covers the Tennessee Titans for The USA TODAY Network.",
    "Jenkins turns 34 next season and could get cut as a cap casualty.",
    "It will be tough to keep him for financial reasons.",
    "Nine starters are under contract for next season.",
    "The Titans are thin at receiver behind stars A.J.",
    "So the Titans need a plan at the position.",
    "The core will remain intact in 2022.",
    "There's also a need for a true No.",
    "So what should be prioritized?",
    "3 receiver."
  ]
}