{
  "id": 7088,
  "mediaId": 2790,
  "date": "2022-01-29",
  "headline": "Chair of the Congressional Ukraine Caucus says U.S. must act now to assist Ukraine",
  "image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400",
  "link": "https://www.npr.org/2022/01/29/1076663976/chair-of-the-congressional-ukraine-caucus-says-u-s-must-act-now-to-assist-ukrain",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Simon",
  "authorUrl": "https://www.npr.org/people/3874941/scott-simon",
  "termIds": [
    0
  ],
  "sentences": [
    "Fox News host Tucker Carlson, an influential figure in a Republican Party now embodied by Donald Trump, has called Ukraine strategically irrelevant to the U.S. and suggested that Russian troops entering Ukraine are no different than undocumented immigrants coming over the U.S.-Mexico border.",
    "FITZPATRICK: One hundred percent because Ukraine - I mean, if Russia were to successfully invade Ukraine, these troops that are now amassed on the Russian border would now be amassed on the Ukrainian border with Romania and Poland, two NATO members.",
    "And we have to be unequivocal and unapologetic that we stand with Ukraine and Ukrainians - we have their back - and that it is not OK for a nation to invade and violate the territorial borders and the territorial integrity of a foreign nation.",
    "But Republican Representative Brian Fitzpatrick of Pennsylvania, who's co-chair of the bipartisan Congressional Ukraine Caucus, said on Twitter, the U.S. must act now to deliver security assistance and defensive military aid.",
    "We have to send a very strong and unequivocal message to Vladimir Putin, which would also be a message to Xi Jinping, to Kim Jong Un and other bad actors around the world that this is not OK to do.",
    "SIMON: Well, but you still have Republicans who are saying - I mean, Matt Rosendale of Montana says, despite claims by war hawks on both sides of the aisle, it's not in our national interest.",
    "When we defended Kuwait in Operation Desert Storm - I'm sorry - Desert Shield - we sent a message to the world that you cannot violate the territorial integrity of an independent nation.",
    "There are - plenty of comments were made in the previous administration that I publicly pushed back on - on this network, by the way - specifically with regard to the Helsinki summit.",
    "If you don't understand that what happens in other countries impacts not just that region but the world, including the United States, then you haven't learned the lessons of history.",
    "Scott Simon talks with Congressman Brian Fitzpatrick, Republican from Pennsylvania and co-chair of the Congressional Ukraine Caucus, about what the U.S. should do to deter Russia.",
    "FITZPATRICK: Because we live in a very small world, and democracy is - a threat to democracy in Europe is a threat to democracy in the United States.",
    "This will send a signal that it will be the Wild West internationally if we don't stand together as an international community and push back on this.",
    "FITZPATRICK: Yeah, I think what you're seeing here is the arc where liberal and libertarian foreign policy perspectives arc and meet together.",
    "I worked in the embassy in Kyiv - working specifically counterintelligence and cybersecurity issues mainly dealing with Russian propaganda.",
    "And a couple of other members of Congress of your own party have said that Ukraine is strategically irrelevant to U.S. interests.",
    "Moreover, other bad actors will get a signal - China vis-a-vis Taiwan, North Korea vis-a-vis South Korea, Iran vis-a-vis Israel.",
    "SIMON: Did President Donald Trump, with his frequent praise for Vladimir Putin, make the Republican Party the party of Russia?",
    "Russia will not...\nSIMON: Well, let me ask, representative, just 'cause it's a live interview, and we're pressed for time.",
    "What do you tell people in your district who might ask you now, why should I care about who's in power in Ukraine?",
    "SCOTT SIMON, HOST:\nHave Republicans become isolationist when it comes to a potential Russian invasion of Ukraine?",
    "If you don't nip a problem in the bud early on, it becomes a much bigger, much more costly problem to deal with.",
    "FITZPATRICK: Well, as far as the previous administration goes, none of this was happening during that.",
    "SIMON: Republican Representative Brian Fitzpatrick of Pennsylvania, thanks so much for being with us.",
    "SIMON: It might be that simple, but is it that - is that relevant to American security interests?",
    "FITZPATRICK: Well, I hope he steps it up and - both in terms of level of support and timing.",
    "Visit our website terms of use and permissions pages at www.npr.org for further information.",
    "This text may not be in its final form and may be updated or revised in the future.",
    "And we have to ask why it's occurring now, and we have to push back on it.",
    "So, you know, Afghanistan is happening under this current administration.",
    "SIMON: Has President Biden - what do you think of what he's done so far?",
    "FITZPATRICK: Ukraine is incredibly important to the world's interests.",
    "NPR transcripts are created on a rush deadline by an NPR contractor.",
    "Russia and Ukraine are happening under this current administration.",
    "The authoritative record of NPR’s programming is the audio record.",
    "Ukrainians have gotten about 25% of what they asked for so far.",
    "SIMON: Let me get your estimation of what Tucker Carlson said.",
    "They have not received any anti-aircraft defense systems.",
    "The libertarian view of foreign policy is isolationist.",
    "And this is something that's been years in the making.",
    "My last international assignment was in Ukraine.",
    "That is incredibly important that they get that.",
    "The Javelins are the anti-tank defense system.",
    "I was an FBI agent prior to being in Congress.",
    "But these - this aggression is occurring now.",
    "Vladimir Putin will not stop with Ukraine.",
    "And those are the lessons of history.",
    "Representative Fitzpatrick joins us.",
    "Accuracy and availability may vary.",
    "And Ukraine should be no different.",
    "They have received some Javelins.",
    "BRIAN FITZPATRICK: Good morning.",
    "I think it's a very naive view.",
    "FITZPATRICK: Thank you, sir.",
    "Thanks for being with us.",
    "Thanks for having me.",
    "I disagree with that.",
    "Copyright © 2022 NPR.",
    "All rights reserved.",
    "FITZPATRICK: Sure.",
    "They've come late.",
    "It's that simple.",
    "SIMON: Yeah."
  ]
}