{
  "id": 7114,
  "mediaId": 2523,
  "date": "2022-01-28",
  "headline": "OCVarsity Fab 15 for 2022: The top high school football recruits in the West",
  "image": "https://www.dailynews.com/wp-content/uploads/2022/01/ocvarsity-fab15-2022-2.jpg?w=1000&h=563",
  "link": "https://www.dailynews.com/2022/01/28/ocvarsity-fab-15-for-2022-the-top-high-school-football-recruits-in-the-west/",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Albano",
  "authorUrl": "https://www.dailynews.com/author/dan-albano/",
  "termIds": [
    0
  ],
  "sentences": [
    "Subscribe now\nDan Albano of the Orange County Register and the Southern California News Group selects the top high school football recruits for its annual OCVarsity Fab 15 team.",
    "Earnest Greene | St. John Bosco\nOL, 6-5, 330\nThe massive Greene projects to play guard for the national champion Georgia Bulldogs, but he’s certainly capable at tackle.",
    "Kyion Grayes | Chandler, Arizona\nWR, 5-11, 170\nThe speedy and elusive Grayes was slowed by a dislocated elbow during the season but impressed at the All-American Bowl.",
    "1-rated offensive tackle has narrowed his choices to Washington, Oregon, USC, Oklahoma, Michigan and Miami, he but isn’t expected to announce his decision until March.",
    "Domani Jackson | Mater Dei\nCB, 6-1, 185\nThe speedy Jackson appeared headed toward a monster senior season before a knee injury in August ended his campaign.",
    "Tetairoa McMillan | Servite\nWR, 6-4, 185\nThe Register’s offensive player of the year is an ultra-athletic receiver who can outjump most defensive backs.",
    "Football’s traditional National Signing Day is next week — Wednesday, Feb. 2 — but most of the top recruits signed during the early period in December.",
    "CJ Williams | Mater Dei\nWR, 6-2, 193\nWilliams is blessed with exceptional hands and body control, traits that help him make spectacular catches.",
    "Cyrus Moss | Bishop Gorman, Nevada\nDE/OLB, 6-5, 215\nMoss can certainly give Mater Dei’s David Bailey a push for the top edge-rusher in the West.",
    "Zeke Berry | De La Salle, Concord\nS, 6-0, 195\nEvaluations on Berry vary but there’s no denying his explosive, hard-hitting, playmaking skills.",
    "Anthony Lucas | Chaparral, Arizona\nDL, 6-4, 275\nThe athletic Lucas plays with an outstanding motor, which allows him to finish off tackles.",
    "Status: Notre Dame (signed)\n* * * * * * * * * * * * * * * * * *\nFAB 15 SECOND TEAM\nRank, player name, high school, position, college\n16.",
    "Tobias Merriweather | Union, Washington\nWR, 6-4, 185\nThe tall and long-striding Merriweather has the skills to be an impact player.",
    "Devin Brown | Corner Canyon, Utah\nQB, 6-2, 195\nThe Elite 11 selection throws an excellent deep ball and also is a gifted runner.",
    "1 edge rusher in the West met all challenges in the Trinity League, earning the Register’s defensive player of the year honor.",
    "He passed for almost 5,000 yards and 57 TDs as a senior at Corner Canyon, the same school that produced Jaxson Dart.",
    "Raleek Brown | Mater Dei\nRB/AP, 5-8, 185\nBrown combines blazing speed with big-time moves to weave through tackles.",
    "Most of all, McMillan displayed the ability to raise his level of play to stand out against the best competition.",
    "(Update: This story will be included in the Tuesday, Feb. 1 print edition of the Orange County Register.)",
    "He’s part of a stellar group of defensive linemen signed by Texas A&M coach Jimbo Fisher, who has the No.",
    "Zion Branch | Bishop Gorman, Nevada\nS, 6-2, 196\nBranch projects as a physical safety with speed.",
    "As a senior, he showed an improved physical side while also starring at defensive back.",
    "These are the top seniors (Class of 2022) from the western area of the United States.",
    "Lander Barton | Brighton, Utah\nLB, 6-4, 220\nBarton ranks as 247Sports’ No.",
    "Support our high school sports coverage by becoming a digital subscriber.",
    "Josh Conerly Jr. | Rainier Beach, Washington\nOT, 6-5, 284\n247Sports’ No.",
    "He was selected defensive player of the year at the All-American Bowl.",
    "His latest highlight reception went for a TD in the All-American Bowl.",
    "Don’t be surprised if the Trojans utilize his receiving skills.",
    "He could team with Domani Jackson to anchor the USC secondary.",
    "If he returns to form and improves his consistency, watch out.",
    "He earned offensive line MVP honors at the All-American Bowl.",
    "Behind the scenes at Mater Dei, he is viewed as a future pro.",
    "George Fitzpatrick, Cherry Creek (Colo.), OT, Ohio State\n27.",
    "Brown needs to improve his accuracy after throwing 14 INTs.",
    "Gavin Sawchuk, Valor Christian, Colo., RB, Oklahoma\n17.",
    "Jovantae Barnes, Desert Pines, Nev., RB, Oklahoma\n22.",
    "Jahlil Florence, Lincoln (San Diego), CB, Oregon\n28.",
    "Jadyn Marshall, St. Mary’s (Stockton), WR, UCLA\n25.",
    "1 linebacker in the West and the Utes’ top recruit.",
    "Jake Taylor, Bishop Gorman, Nev., OT, Oklahoma\n18.",
    "He needs to shake some lingering hamstring issues.",
    "Jalil Tucker, Lincoln (San Diego), CB, Oregon\n23.",
    "Darrius Clemons, Westview, Ore., WR, Michigan\n21.",
    "Jaden Mickey, Centennial (Corona), CB, Notre Dame",
    "David Bailey | Mater Dei\nDE/OLB, 6-3, 220\nThe No.",
    "Rayshon Luke, St. John Bosco, RB/AP, Arizona\n30.",
    "Niuafe Tuihalamaka, Alemany, LB, Notre Dame\n26.",
    "Hero Kanu, Santa Margarita, DL, Ohio State\n20.",
    "1 class in the nation, according to 247Sports.",
    "Maalik Murphy, Serra (Gardena), QB, Texas\n29.",
    "Kamari Ramsey, Sierra Canyon, S, UCLA\n24.",
    "Mason Graham, Servite, DL, Michigan\n19.",
    "He also played tight end for Brighton.",
    "Status: Ohio State (signed)\n14.",
    "Status: Ohio State (signed)\n8.",
    "He has all the physical tools.",
    "Status: Michigan (signed)\n15.",
    "Status: Texas A&M (signed)\n5.",
    "Status: Stanford (signed)\n4.",
    "Status: Arizona (signed)\n2.",
    "Status: Georgia (signed)\n6.",
    "Status: Miami (signed)\n13.",
    "Status: Utah (signed)\n12.",
    "Status: USC (signed)\n11.",
    "Status: USC (signed)\n10.",
    "Status: USC (signed)\n9.",
    "Status: USC (signed)\n7.",
    "Status: Uncommitted\n3.",
    "FAB 15 FIRST TEAM\n1."
  ]
}