{
  "id": 7122,
  "mediaId": 2808,
  "date": "2022-01-28",
  "headline": "Chicago’s Joseph Sikora brings his ‘Power’ tough guy home for the city’s first show in the hit Starz franchise",
  "image": "https://cst.brightspotcdn.com/dims4/default/3b88125/2147483647/strip/true/crop/2210x1262+0+369/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FurjK6-laPl3sV00RCGoRbcoC_ig%3D%2F0x0%3A2210x2000%2F2210x2000%2Ffilters%3Afocal%28440x966%3A441x967%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F23198318%2Fpbf1_101_030221_0337_a.jpg",
  "link": "https://chicago.suntimes.com/movies-and-tv/2022/1/28/22783650/power-book-iv-force-chicago-joseph-sikora-starz-universe-shane-harper",
  "mediaOutlet": "suntimes.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Joining Sikora on the “Force” cast are veteran Chicago stage actor Anthony Fleming III, Tommy Flanagan from “Sons of Anarchy,” Lucien Cambric from “The Chi” and “Chicago P.D.”), NFL veteran Isaac Keys, Lili Simmons from “Banshee” and “Ray Donovan,” British actress Gabrielle Ryan, “God’s Not Dead” star Shane Harper and Kris D. Lofton from “Ballers.”\nAnother prominent local stage actor, Guy Van Swearingen, will turn up in a recurring role, as will rapper Freddie Gibbs and “The Chi” actor Barton Fitzpatrick.",
    "Very often, he’s the bringer of death, which is what makes him such an incredible character to write to.”\nBefore Shane Harper came to the city to film “Force,” he says he reached out to his former “Hightown” castmate Monica Raymund, who played Gabriela Dawson for six seasons on the hit NBC series “Chicago Fire,” for local dining recommendations.",
    "“We were shutting locations down for this show that I have the luxury and blessing to be the lead of.”\nWhen “Power” ended after six seasons in 2020, the premium cable network added more shows to the “Power Universe” including “Power Book II: Ghost” and “Power Book III: Raising Kanan.” The new “Power Book IV” premieres Feb. 6 on Starz.",
    "“We both looked at each other and we said: ‘This is a Western.’ In every Western, it has the setup of the cowboy pulling into town on his horse and all he’s really looking to do is get some water for his horse, a hot meal, maybe a shower, go into the saloon, and see what the city is all about, and get out of Dodge.",
    "It’s great to be back here.”\nThe initial showrunner on “Force,” Northwest Side native Robert Munic, said in June that while filming in Chicago wasn’t originally planned for the series, it made sense after a brainstorming session with “Power” creator Courtney Kemp.",
    "People know [Raymund] here, and she was really excited for me to get to come out and enjoy the city, how welcoming it is, and what a good time you can have in Chicago.”\nSikora says longtime “Power” fans will see their favorite character with a different demeanor.",
    "“I haven’t lived in Chicago permanently for half of the year — a six-month stretch — since I was 21 years old so it was really interesting being back,” said Sikora, a Northwest Side native, during a day of shooting at the Tao Chicago nightclub last June.",
    "Sikora, a Columbia College graduate, says some of his favorite places to hang out growing up in Chicago were Forest Glen’s Mr. V’s Pizza, Humboldt Park speakeasy California Clipper and the Garfield Park Conservatory, among other locations.",
    "When “Power Book IV: Force” was filming in and around Chicago last summer, Sikora — reprising his popular character Tommy Egan — found it increasingly difficult to get through scenes without fans spotting and interrupting him.",
    "“I hadn’t ever had a chance to spend a bunch of time here, but I’ve been a few different times and I’ve always loved it.“ When they told me that this show was filming here, I was really excited.",
    "In one instance, the cast filmed on location in suburban Oak Park when a bus driver spotted Sikora, stopped the bus, ditched passengers to run across the street, and yelled: “Tommy!",
    "Fans of the “Power Universe” of TV shows love actor Joseph Sikora so much that they are more than willing to disrupt filming to get some time with him.",
    "We’ll see.”\nFormer Sun-Times reporter Evan F. Moore wrote this story before leaving to become a Chicago Public Schools press secretary.",
    "And he had all these unanswered questions and all these mysteries in the city,’ ” said Munic, who left the series later in the summer.",
    "At the end of the original show, Tommy had lost his best friend Ghost and girlfriend LaKeisha and said goodbye to New York.",
    "“We’re gonna see flashbacks in real-time because now we have Tommy as a shell of a man that lost everything,” said Sikora.",
    "“Very few Chicagoans realize all those boulevards used to connect the parks to each other.",
    "“[The series] shut down Washington Boulevard on the boulevard system,” said Sikora.",
    "“Power Book V: Influence,” starring West Side native Larenz Tate, also is planned.",
    "I love you!” In another, a woman jumped on the hood of Tommy’s trademark Mustang.",
    "What if there was this whole life in between New York and L.A., which is Chicago?",
    "“I started talking about: ‘What if [Egan] stopped midway [across the country]?",
    "“Inevitably, some s- - - jumps off and then the cowboy can’t leave.",
    "Now we get to watch that in real time because he has nothing.",
    "Tommy is a loner, and incredibly adept at survival.",
    "“It’s been wonderful, I love Chicago,” said Harper.",
    "I was always a tourist in my own city growing up.",
    "“How does somebody in that position rebuild?",
    "How did Tommy actually become Tommy?",
    "What is the rebuilding structure?",
    "How does he get something?",
    "I hope we accomplish that.",
    "I love Chicago so much."
  ]
}