{
  "id": 7133,
  "mediaId": 2668,
  "date": "2022-01-24",
  "headline": "More Pressure Applied to Pelosi to Stop a Corrupt Practice That Should've Been Illegal Long Ago",
  "image": "https://media.townhall.com/townhall/reu/o/2021/309/68f28083-ffc4-4dc5-9852-982c4987dffa-1110x740.jpg",
  "link": "https://redstate.com/brandon_morse/2022/01/24/more-pressure-applied-to-pelosi-to-stop-a-corrupt-practice-that-shouldve-been-illegal-long-ago-n511744",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Morse",
  "authorUrl": "https://redstate.com/author/brandon_morse",
  "termIds": [
    0
  ],
  "sentences": [
    "Leading them is Rep. Jared Golden of Maine who feels that elected officials should focus more on serving the people than dealing in lucrative stocks according to The Hill:\n“There is no reason that members of Congress need to be allowed to trade stocks when we should be focused on doing our jobs and serving our constituents,” the lawmakers, led by Rep. Jared Golden (D-Maine), wrote in a letter to House leaders.",
    "As RedState covered in December of last year, Pelosi’s reluctance shouldn’t surprise anyone given that she’s been one of the members of Congress that have benefited the most from insider trading:\nThe Pelosi family’s trades this month include Google and Salesforce call options worth between $500,000 and $1 million each, as well as Roblox call options valued at between $100,000 and $250,000.",
    "Previously, Pelosi was opposed to the idea of forbidding officials from trading stock, stating that they should be able to participate in a “free-market economy.” She did say, however, that if members want to proceed forward with some bills, then she will as well:\n“I do come down always in favor of trusting our members.",
    "Now, according to The Hill, 27 lawmakers called on House leadership to bring up a bill that forbids lawmakers from trading stocks in the form of the “Ban Conflicted Trading Act” which would not just stop members of congress, but their immediate family from also trading in stocks while they’re in office.",
    "According to Business Insider, the “Stop Trading on Congressional Knowledge Act of 2012” or the “STOCK Act” was supposed to prohibit the trading of stocks in order to eliminate any conflicts of interest when it comes to overseeing the business of the people.",
    "We came to Congress to serve our country, not turn a quick buck.”\nThe New York Post reported that Senate members have introduced their own versions of the bill as well including Arizona Democrat Mark Kelly and Missouri Republican Josh Hawley.",
    "The duo also bought up between $250,000 and $500,000 in calls for chipmaker Micron Technology and between $100,000 and $250,000 of Disney call options in disclosures that were earlier reported by Congresstrading.com.",
    "With so many as 54 members having gotten away with breaking the rules on stock trading, and with not much more than a light slap on the wrist to show for it, insider trading is practically encouraged.",
    "Pelosi has generated suspicion around herself that she’s attempting to slow the progress of bills like these so as not to impact tech firms in which she heavily invests.",
    "If the impression that is given by some that somebody is doing insider trading, that’s a Justice Department issue and that has no place in any of this,” Pelosi said.",
    "This movement is bipartisan, with 25 House Democrats signing on and two Republicans including Reps. Brian Fitzpatrick of Pennsylvania and Matt Gaetz of Florida.",
    "I’ve said to the House Administration Committee, review all the bills that are coming in and see which ones — where the support is in our caucus,” said Pelosi.",
    "Truth be told, these laws should have already been in place eons ago, and the fact that they aren’t is a testament to the corrupting power of the U.S. Capitol.",
    "And nothing but evil can come from a person in power being allowed to influence the ups and downs of an economy while also being allowed to participate in it.",
    "House Speaker Nancy Pelosi has signaled support but asked the House Administration Committee to review the STOCK Act to see if it needs to be stricter.",
    "Earlier this month, 54 members of congress were caught having violated a law meant to stop elected members from engaging in insider trading.",
    "That said, I wouldn’t exactly be surprised to watch Pelosi turn up the resistance as these bills get closer and closer to being laws.",
    "On top of that, these members look to pass the “TRUST in Congress Act” which throws senior staffers into the no-trade zone as well.",
    "In recent years he’s made big-money bets on companies his wife is supposed to regulate, including Amazon, Apple, and Google.",
    "“To give a blanket attitude of ‘We can’t do this and we can’t do,’ because we can’t be trusted, I just don’t buy into that.",
    "Despite being caught, those who did violate the law suffered negligible punishments for it, such as a $200 fine.",
    "“If, in fact, we should have severer penalties for delay in reporting one’s stock [transactions], then do that.",
    "Paul Pelosi runs Financial Leasing Services, a real estate and venture capital investment and consulting firm.",
    "Still, if the tide is against her, she won’t have much of a choice but to be carried out to sea.",
    "“Perhaps this means some of our colleagues will miss out on lucrative investment opportunities.",
    "Some didn’t even have to pay at all, having their punishments waved by ethics officials.",
    "House Minority Leader Keven McCarthy has also suggested he supports the ban.",
    "The violations were committed by politicians on both sides of the aisle.",
    "But if members want to do that, I’m okay with that,” she added.",
    "We don’t care."
  ]
}