{
  "id": 7138,
  "mediaId": 2619,
  "date": "2022-01-27",
  "headline": "Why OPEC+ may not want $100 oil prices",
  "image": "https://images.mktw.net/im-475355/social",
  "link": "https://www.marketwatch.com/story/why-opec-may-not-want-100-oil-prices-11643303716?rss=1&siteid=rss",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Myra P. Saefong",
  "authorUrl": "https://www.marketwatch.com/topics/journalists/myra-p-saefong",
  "termIds": [
    0
  ],
  "sentences": [
    "Fitzpatrick says OPEC+ is expected to stick to its current agreement to raise monthly production by 400,000 barrels at the Feb. 2 meeting to “increase revenues, while putting only minimal pressure on oil prices.” However, OPEC+ should “consider holding off on the production hikes…to be better positioned in the event oil prices spike higher,” he says.",
    "Meanwhile, the Russia-Ukraine standoff is important to oil because if Russia cuts off natural-gas exports to Europe, that may “force more gas-to-oil substitution,” says Ryan, and if Russia invades Ukraine and the West imposes more oil-related sanctions, oil production could take a hit.",
    "There is also no assurance that the omicron variant of the coronavirus will be relatively mild, and the Federal Reserve signaled that interest rates will start to rise in March, which adds uncertainty to what happens to the U.S. dollar—and dollar-denominated oil prices.",
    "On Wednesday, U.S. and global benchmark oil prices settled at their highest prices since October 2014, with front-month West Texas Intermediate crude futures CL.1, -1.97% CLH22 CL00, -1.97% settling at $87.35 and Brent BRN00, -0.41% BRNH22 at $89.96 a barrel.",
    "OPEC+, which refers to the Organization of the Petroleum Exporting Countries and its allies, would need to increase production, and U.S. shale-oil output would have to climb to keep prices from finding a new “equilibrium” above $90.",
    "If policies aren’t developed to encourage needed production increases over the next decade or two, these excursions to $90 or $100 will become more frequent, and price levels will move higher in an “increasingly volatile fashion.”",
    "Talk of $100-a-barrel oil has intensified in recent days, but triple-digit prices may pose a disadvantage for major oil-producing nations that are set to meet next week to decide the best course of action on production levels.",
    "While OPEC would love to see oil hover at $80 to $100, prices above the top end of that range will probably see demand destruction, with consumers forced to reduce consumption, and that is the last thing OPEC wants, he says.",
    "BCA’s Ryan believes that OPEC+ faces three key problems, the biggest being that there are only four members—Saudi Arabia, Iraq, the United Arab Emirates, and Kuwait—with the capacity to increase production and sustain it.",
    "For now, OPEC+ members that are able to raise output may agree to “pick up the slack” of other states and lift production enough to bring prices closer to BCA Research’s 2022 $80 forecast average for Brent, Ryan says.",
    "“The potential for demand destruction is high at these levels, especially if the [U.S. dollar] remains strong,” he adds, as local currency costs will become “prohibitive,” especially in emerging market economies.",
    "BCA Research expects Brent oil to average $80 this year and $81 in 2023, but “demand destruction,” either from high prices or widespread omicron-induced lockdowns, is the biggest risk to that forecast, Ryan says.",
    "Oil prices at $100 are a “distinct possibility this year, driven by both strong demand and minimal gains on the supply side,” says Bill Fitzpatrick, managing director and portfolio manager at Logan Capital.",
    "That forecast is contingent on Saudi Arabia, Iraq, the U.A.E., and Kuwait raising output by an average of roughly 3.34 million barrels a day this year, and 2.76 million barrels a day next year, he says.",
    "“It isn’t in OPEC+’s best interest to see prices go through $90 [a barrel] this year and move higher,” says Bob Ryan, chief commodity and energy strategist at BCA Research.",
    "Still, BCA Research has noted for some time that there is a lack of capital expenditure going into oil and natural-gas production globally, Ryan says.",
    "That year also marked the last time prices topped $100."
  ]
}