{
  "id": 7163,
  "mediaId": 2869,
  "date": "2022-01-05",
  "headline": "What the Deshaun Watson trade market looks like this offseason",
  "image": "https://s.hdnux.com/photos/01/16/30/51/20548185/7/rawImage.jpg",
  "link": "https://www.chron.com/sports/texans/article/Deshaun-Watson-trade-market-draft-picks-Texans-16751921.php",
  "mediaOutlet": "houstonchronicle",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Young",
  "authorUrl": "https://www.chron.com/author/matt-young/",
  "termIds": [
    0
  ],
  "sentences": [
    "Some of that success can be attributed to rookie head coach Nick Sirianni switching to a more run-heavy offense to take some of the pressure off Hurts, but the Houston native also has shown a lot of improvement through the season and may have done enough for the Eagles to give up their pursuit of Watson.",
    "After failing to land Watson at the trade deadline, the Panthers signed Cam Newton and he lost five straight games and played poorly (five interceptions with just three touchdowns) before being replaced by Sam Darnold, who didn't look any better than he did in his first three seasons with the Jets.",
    "There were reports that multiple teams offered the Texans three first-round picks and two third-round picks with a contingency that there would be some sort of resolution to the 22 civil lawsuits filed against Watson that include allegations of sexual assault during massage sessions.",
    "As the Texans shopped Deshaun Watson before the November trade deadline, they took a hard-line stance on what they wanted in return: Three first-round picks and some combination of three second- or third-round picks or young players who could make an impact for years to come.",
    "Even without a reliable quarterback, the Saints very nearly made the playoffs - they just needed the 49ers to lose to the Rams in the regular season finale - but they have to be thinking about what they’re going to do at quarterback next season.",
    "Seahawks\nIt’s hard to imagine Russell Wilson playing anywhere besides Seattle, but ESPN’s Adam Schefter has reported that this could have been the last year in Seattle for either Wilson or head coach Pete Carroll.",
    "The Seahawks went 7-10 and the 33-year-old Wilson had by far the worst season of his career if you go by QBR – his 54.7 QBR puts him at 10th in the league behind the likes of Carson Wentz and Ryan Tannehill.",
    "Mayfield has one more year left on his contract and is coming off the worst year of his career, throwing a career-low 17 touchdowns as the Browns underachieved, finishing 8-9 after going 11-5 last season.",
    "Still, the Giants, who just had their fifth straight season with double-digit losses, could use Watson instead of Daniel Jones, who has proven he's not a good NFL starting quarterback.",
    "The Broncos come up in every trade rumor involving quarterbacks – Watson, Russell Wilson and Aaron Rodgers – so it’s no secret how badly they need to resolve the issue behind center.",
    "Commanders\nThere wasn’t much talk about Washington in the Watson sweepstakes early in the season, but the Commanders may want to jump in after watching how 2021 went for them.",
    "Broncos\nThe Broncos let one of the league’s best defenses – only the Patriots and Bills allowed fewer points - go to waste, missing the playoffs for the sixth straight season.",
    "The trade demand for Watson is helped by the fact that the free agent market is pretty bare with Jameis Winston and Teddy Bridgewater being the best quarterbacks available.",
    "Browns\nThe Browns are another team rarely mentioned as being in pursuit of Watson, but after watching Baker Mayfield in his fourth season, it’s obvious they could use him.",
    "The Ryan Fitzpatrick experiment did not go well as the 39-year-old quarterback threw just six passes in Week 1 before injuring his hip and missing the rest of the season.",
    "Saints\nThe Saints - who will be without Sean Payton, who is stepping away from coaching - have been a disaster at quarterback since Drew Brees retired after last season.",
    "If Watson settles the civil lawsuits and puts the assault allegations behind him, as gross as it may be, plenty of NFL teams will want the quarterback in their uniform.",
    "Three months have passed since that trade deadline and most of the teams that were in pursuit of Watson still could use him, while other teams - hello, Tampa Bay!",
    "Minnesota, which went 7-9 and 8-9 in back-to-back seasons, has young stars at the skill positions with running back Dalvin Cook and receiver Justin Jefferson.",
    "Since David Tepper bought the team in 2018, he’s been determined to find his team a quarterback, overpaying for Teddy Bridgewater, then trading for Darnold.",
    "After hiring Nathaniel Hackett, the former Green Bay Packers offensive coordinator, as head coach, the Broncos would love to work out a trade for Rodgers.",
    "Steelers\nBen Roethlisberger is done in Pittsburgh, leaving Mason Rudolph, Dwayne Haskins and Joshua Dobbs as the only quarterbacks on the roster.",
    "Since then, WFT rode Taylor Heinicke, who overperformed expectations but hasn’t shown anything to make you think he’s a quality NFL starter.",
    "If the Seahawks decide it is time to move on from their seven-time Pro Bowler, they would have to consider Watson as a possible replacement.",
    "Giants\nGiants owner John Mara made things pretty clear when he hired Brian Daboll as his head coach, \"We're not trading for Deshaun Watson.\"",
    "Vikings\nThere was some thought that Watson would veto any trade that wasn't in a big market, but Minneapolis has a lot of pieces on offense.",
    "Dolphins\nWatson's first choice was always Miami, and the Dolphins had the most interest in landing the Texans quarterback since the start.",
    "He’s going to want to bring Watson, who played his college ball at Clemson, just 130 miles outside of Charlotte, back to the Carolinas.",
    "The Texans will be trying to pit those potential suitors against each other as they prepare for the NFL Draft, which starts April 29.",
    "However, the Dolphins have since fired Brian Flores and hired former 49ers offensive coordinator Mike McDaniel as their head coach.",
    "The Texans likely would love to trade Watson to the Panthers - sending him to the NFC and getting their hands on Carolina's No.",
    "With offensive-minded Bruce Arians at the helm and Byron Leftwich running the offense, Watson could have a big season in Tampa.",
    "The only stumbling block there is Kirk Cousins still has one more year left on his contract and is guaranteed $35 million.",
    "The Dolphins reportedly made the biggest push, but the Texans rebuffed their offer, opting to try again in the offseason.",
    "Reports are that McDaniel has told owner Stephen Ross that he thinks he can win with Tua Tagovailoa at quarterback.",
    "When the Texans were attempting to trade Watson before the deadline, the Eagles were one of the top teams involved.",
    "A year after winning the Super Bowl, Tampa Bay went 13-4 to tie with Green Bay for the best record in the league.",
    "Instead, they found their groove and made the playoffs with second-year quarterback Jalen Hurts at the helm.",
    "The Steelers haven’t won a playoff game since the 2016 season and need someone to jump-start that offense.",
    "Surely, Mike Tomlin isn’t planning on entering 2022 with any of those guys as his starting quarterback.",
    "They’ve had to use four different starters – Jameis Winston, Taysom Hill, Trevor Siemian and Ian Book.",
    "Buccaneers\nSince Tom Brady retired, Tampa Bay's only quarterbacks are Blaine Gabbert and Kyle Trask.",
    "The Vikings look so good that ESPN reported they're one of the teams in which Watson is interested.",
    "Eagles\nThis is the one team whose quarterback play might have improved since the trade deadline.",
    "They were 3-5 at the time and appeared to be headed to their second straight losing season.",
    "Panthers\nWhen the Panthers were interested in Watson at the trade deadline, they were 4-4.",
    "The Vikings likely would want to trade Cousins before they attempt to land Watson.",
    "Winston was good, but he tore his ACL in Week 8 and is set to become a free agent.",
    "Here are the teams that could make a push for Deshaun Watson this offseason ...",
    "Plus, they're hiring Rams offensive coordinator Kevin O'Connell as head coach.",
    "As soon as Brady retired, the Bucs likely moved to near the top of his list.",
    "The Giants would be an ideal trading partner, because they have both the No.",
    "The culprit is a lousy offense led by Teddy Bridgewater and Drew Lock.",
    "In 12 games, Darnold threw 13 interceptions with just nine touchdowns.",
    "- What the Texans got from the Browns in the trade for Deshaun Watson",
    "Besides the hole at quarterback, the Bucs are built to keep winning.",
    "Maybe not, but at least the Browns should be in the bidding war.",
    "Would Watson waive his no-trade clause to play in Cleveland?",
    "That seems unlikely, so then they could turn to Watson.",
    "None of the other guys are legitimate NFL starters.",
    "- suddenly have a big hole at quarterback as well.",
    "6 overall pick in this year's draft.",
    "Washington’s first-round pick is No.",
    "7 overall pick in this year's draft.",
    "After that, they went 1-8.",
    "That's a problem.",
    "11 overall.",
    "5 and No."
  ]
}