{
  "id": 731,
  "mediaId": 2523,
  "date": "2022-04-09",
  "headline": "Masters 2022 Tee Times: Pairings and Predictions for Sunday",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/513/041/hi-res-4030e0bd9cf7d5d5532a33550b8105f8_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2955229-masters-2022-tee-times-pairings-and-predictions-for-sunday",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michelle Bruton",
  "authorUrl": "https://bleacherreport.com/users/64bbcf14-cf4f-4e91-a4ee-29547fc85488",
  "termIds": [
    1913,
    2124,
    2530,
    3002,
    3200,
    3319,
    3515,
    3516,
    4195,
    595
  ],
  "sentences": [
    "Sunday Pairings\n10:10 a.m.: Cameron Davis, Adam Scott\n10:20 a.m.: Tyrrell Hatton, Billy Horschel\n10:30 a.m.: Patrick Cantlay, Mackenzie Hughes\n10:40 a.m.: Max Homa, Bubba Watson\n10:50 a.m.: Jon Rahm, Tiger Woods\n11:00 a.m.: Russell Henley, Daniel Berger\n11:10 a.m.: Robert MacIntyre, Harold Varner III\n11:20 a.m.: Tom Hoge, Sepp Straka\n11:30 a.m.: Kevin Na, Seamus Power\n11:50 a.m.: Joaquin Niemann, Christiaan Bezuidenhout\n12 p.m.: Kevin Kisner, Matthew Fitzpatrick\n12:10 p.m.: Tony Finau, Sergio Garcia\n12:20 p.m.: Lucas Glover, Patrick Reed\n12:30 p.m.: J.J. Spaun, Min Woo Lee\n12:40 p.m.: Harry Higgs, Lee Westwood\n12:50 p.m.: Si Woo Kim, Hudson Swafford\n1 p.m.: Marc Leishman, Talor Gooch\n1:10 p.m.: Hideki Matsuyama, Viktor Hovland\n1:30 p.m.: Webb Simpson, Will Zalatoris\n1:40 p.m.: Dustin Johnson, Cameron Champ\n1:50 p.m.: Rory McIlroy, Collin Morikawa\n2 p.m.: Tommy Fleetwood, Jason Kokrak\n2:10 p.m.: Corey Conners, Danny Willett\n2:20 p.m.: Charl Schwartzel, Justin Thomas\n2:30 p.m.: Sungjae Im, Shane Lowry\n2:40 p.m.: Scottie Scheffler, Cameron Smith\nAll times ET.",
    "Saturday's Masters action has concluded, and while Moving Day delivered some movement near the top of the leaderboard, it's been clear almost from the beginning of this tournament that Scottie Scheffler came to play.",
    "Sunday promises to be sunny and warm in Augusta, with a high of 73, per Weather.com, so the American won't have any conditions to overcome en route to potentially winning what would be his first major.",
    "Four of those five players went on to win the coveted green jacket; the only one who did not was Greg Norman, who finished second in 1996 after leading by six shots following Round 3.",
    "Some other notable pairings Sunday include Bubba Watson and Max Homa, Matt Fitzpatrick and Kevin Kisner, Sergio Garcia and Tony Finau and Rory McIlroy and Collin Morikawa.",
    "The two have been on a collective tear lately, with five combined wins between them over each of their past five starts, according to ESPN Stats & Info.",
    "Heading into Saturday morning, Scheffler held a five-shot advantage, tied for the largest 36-hole lead in Masters history, per Colin McDonald of SI.com.",
    "In Sunday's final round, Scheffler leads the pack at nine under par and will tee off last alongside Cameron Smith, who's sitting second at six under.",
    "The Australian had the round of the day Saturday, hitting a four-under 68 to move to six under overall, just three strokes behind Scheffler.",
    "Final-Round Predictions\nIt may seem as though this year's Masters is Scheffler's to lose, but he has work to do to hold off Smith.",
    "Let's take a look at the pairings for final-round action and predict who's going to come away with a green jacket Sunday evening.",
    "1 didn't do anything to hurt his chances at securing a green jacket Saturday, at times holding a six-stroke lead.",
    "It's been a charmed season for the 25-year-old, who won three of his last five events heading into the Masters.",
    "With 18 holes left to play, Tiger Woods, who will play with Jon Rahm on Sunday, is sitting at eight over par.",
    "1-ranked player in the world has held the 54-hole Masters lead or co-lead, per ESPN Stats & Info.",
    "One-time champion Dustin Johnson is at one over par and tied for ninth heading into Round 4.",
    "Prior to this season, Scheffler's best finish at the Masters was tied for 18th last year.",
    "His best finish at a major was his 2020 fourth-place tie at the PGA Championship.",
    "Given that history, it's hard to bet against Scheffler.",
    "He birdied four of his last six holes Friday.",
    "This year marks the sixth time that the No.",
    "Prediction: Scheffler wins.",
    "The world No."
  ]
}