{
  "id": 832,
  "mediaId": 2608,
  "date": "2022-04-10",
  "headline": "Ex-Boyfriend Shot and Strangled Woman in Ambush Murder, Then Went to Gym: Authorities",
  "image": "https://lawandcrime.com/wp-content/uploads/2022/04/Quay-Sean-Hines-via-Nassau-County-police.jpg",
  "link": "https://lawandcrime.com/crime/ex-boyfriend-shot-and-strangled-woman-in-ambush-murder-then-went-to-gym-authorities/",
  "mediaOutlet": "lawnewz.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alberto Luperon",
  "authorUrl": "https://lawandcrime.com/author/alberto-luperon/",
  "termIds": [
    2996,
    3039,
    3152,
    3653,
    4225
  ],
  "sentences": [
    "“According to the preliminary investigation, less than one hour after Hines allegedly shot Ms. Laguerre, he went to the gym,” District Attorney Anne Donnelly said.",
    "Quay-Sean Hines, 30, is charged with murder in the second degree after allegedly shooting and strangling Amelia Laguerre, 33, according to local outlets.",
    "Violent and emotionally abusive, he began stalking Laguerre, showing up unannounced at her job in attempts to continue their relationship, police Capt.",
    "She ripped into Hines, calling the alleged murder “a selfish act, a calculated act and a cowardly act.”\nHines pleaded not guilty at his arraignment.",
    "Hines allegedly ambushed Laguerre on March 31 in an underground parking garage near Northwell Health, where the slain woman was a staff member.",
    "“He immediately came up behind her, shot at her ten times, strangled her nine times,” Fitzpatrick said in an WABC report.",
    "pic.twitter.com/DE4twKROiK\n— Commissioner Ryder (@PaddyRyderNCPD) April 9, 2022\nThat culminated in horrifying fashion.",
    "An ex-boyfriend who killed a New York state woman soon went to a local gym after the act, according to authorities.",
    "On 3/31 he shot and killed his ex-girlfriend, a Northwell employee, at work, he is charged with Murder 2nd.",
    "NCPD Homicide Squad reports the arrest of Quay – Sean Hines, 30, of 1052 Howells Road, Bayshore.",
    "Police said the former couple dated for almost two years until breaking up in late 2021.",
    "Hines allegedly did things like burn clothes and break into Laguerre’s apartment.",
    "[Booking photo via Nassau County Police Department]\nHave a tip we should know?",
    "Domestic violence is on the rise, let’s speak up for our victims.",
    "Hines allegedly carried a torch in disturbing fashion.",
    "Stephen Fitzpatrick said, according to NBC New York.",
    "Hines soon went to an LA Fitness, authorities said.",
    "tips@lawandcrime.com",
    "Quay-Sean Hines."
  ]
}