{
  "id": 850,
  "mediaId": 2586,
  "date": "2022-04-15",
  "headline": "Bills’ Former 1st Round Pick Signs 1-Year Deal With Packers",
  "image": "https://heavy.com/wp-content/uploads/2022/04/Sammy-Watkins-Bills-e1650071679239.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/buffalo-bills/bills-sammy-watkins-signs-packers/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Dougherty",
  "authorUrl": "https://heavy.com/author/nated2005/",
  "termIds": [
    1703,
    1753,
    2671,
    3063,
    3218,
    3742,
    4528,
    160,
    442,
    539
  ],
  "sentences": [
    "(via @TomPelissero + @MikeGarafolo) pic.twitter.com/yOc25YhtxI\n— NFL (@NFL) April 14, 2022\nWatkins revealed that he went into a self-imposed exile after undergoing surgery during the 2017 offseason, studying world religions and realizing he needed a split from the Bills.",
    "Watkins can fill the third role as 2021 draft selection Amari Rodgers continues to adjust to the pro game.”\nAdding Sammy Watkins is surely just the beginning, not the end, of Green Bay's effort to rebuild its receiving corps.",
    "4 overall pick — especially as University of Buffalo linebacker Khalil Mack was still available and there were a number of other talented wide receivers they could have taken with their original pick at No.",
    "Watkins revealed this week that he had signed a one-year deal with the Green Bay Packers, giving him the chance to play for a Super Bowl contender desperately in need of talented wide receivers.",
    "“The Packers traded Davante Adams to Las Vegas and lost Marquez Valdes-Scantling in free agency, leaving Allen Lazard and veteran Randall Cobb as their top two targets for Aaron Rodgers.",
    "https://t.co/yjP8ITw4Wu\nThe 28-year-old receiver has just one 1,000-yard season in his career, the 2015 campaign with the Bills in which he also caught a career-best nine touchdowns.",
    "After three seasons with the Kansas City Chiefs, Watkins played for the Baltimore Ravens last season, notching career-lows with 27 catches for 394 yards and one touchdown.",
    "Buffalo received a second-round pick from the Rams, which Bills general manager Brandon Beane used as part of a package that allowed them to trade up to the No.",
    "He later told Tyler Dunne of Bleacher Report that he got too deep into partying in Buffalo, saying he would “go out and get wasted” every night.",
    "Shook noted that the free-agent market on Watkins was relatively quiet, but the Packers seem to be the best fit for the former Bills wideout.",
    "Watkins said those bad habits exacerbated his injuries, leading him to miss three games in his second season and eight games in his third.",
    "Watkins Revealed Troubled Years in Buffalo\nMany Bills fans harbored resentment regarding the team’s decision to take Watkins with the No.",
    "Literally stared into a mirror in his St. John Fisher College dorm room at Bills training camp and prayed, nightly, Get me out of here.",
    "Watkins Heads to Green Bay\nAs NFL.com’s Nick Shook reported, Watkins signed a one-year, $4 million contract with the Packers this week.",
    "Please, God.”\nThe Bills ended up trading Watkins to the Los Angeles Rams, which helped Buffalo set up their current resurgence.",
    "This move turned out much better than the 2014 trade-up to take Watkins, as the Bills used the pick on quarterback Josh Allen.",
    "“Reemerging in July, Watkins felt nothing but bad energy from new Bills head coach Sean McDermott,” Dunne wrote.",
    "“Like McDermott was testing him, triggering him, waging a ‘mental war’ to make him explode.",
    "4 overall pick, and is now teaming up with one of the league’s best quarterbacks to do it.",
    "Watkins had a rocky tenure in Buffalo filled with personal and professional struggles.",
    "In 2014, the Buffalo Bills made a big move up the draft board to take Sammy Watkins.",
    "Now eight years later, Watkins is still trying to reach the potential of his No.",
    "“A move to Green Bay could be just what Watkins needs,” Shook wrote.",
    "Packers signing WR Sammy Watkins to a one-year, $4 million deal.",
    "Watkins never demanded a trade, but he wanted out.",
    "The latest Bills news straight to your inbox!",
    "Join the Heavy on Bills newsletter here!",
    "7 overall pick in the 2017 draft.",
    "Needed out.",
    "9."
  ]
}