{
  "id": 886,
  "mediaId": 2523,
  "date": "2022-04-17",
  "headline": "2022 NFL Free Agents: Which Available Players Can Still Be Key Contributors?",
  "image": "https://img.bleacherreport.net/img/images/photos/003/921/400/5eb5a10f6a811224e415547e1501d3ee_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2955413-2022-nfl-free-agents-which-available-players-can-still-be-key-contributors",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristopher Knox",
  "authorUrl": "https://bleacherreport.com/users/6e186227-f9b2-4450-af0d-8f62243323ee",
  "termIds": [
    0
  ],
  "sentences": [
    "Best Fit: Indianapolis Colts\nJadeveon Clowney, Edge\nAfter failing to make a big impact with the Seahawks and the Tennessee Titans in 2019 and 2020, respectively, pass-rusher Jadeveon Clowney reemerged as a force with the Cleveland Browns last season.",
    "Best Fit: Tampa Bay Buccaneers\nJoe Haden, CB\nCornerback Joe Haden had a down year in 2021, due in part to a foot injury and his presence in a Pittsburgh Steelers defense—one ranked 24th overall—that was too often inconsistent.",
    "\"The Steelers have an interest in signing Tyrann Mathieu, and they would have enough cap space to sign him to a two-year contract for what they believe he is worth,\" Bob Labriola of the Steelers' official website wrote.",
    "Best Fit: Cleveland Browns\nRob Gronkowski, TE\nTight end Rob Gronkowski is an outlier on this list because if he decides to play in 2021, it will be for the Tampa Bay Buccaneers.",
    "Last month, the Akron Beacon Journal's Nate Ulrich spoke to Clowney's agent, Kennard McGuire, who said that Clowney and the Browns shared \"mutual interest\" in a new contract.",
    "However, Los Angeles added defensive linemen Austin Johnson and Sebastian Joseph-Day in free agency and may look at draft options before turning back to the free-agent pool.",
    "For one, the Colts lack receiver depth behind Michael Pittman Jr. Landry would be a terrific go-to option for Matt Ryan and an immediate focal point of the offense.",
    "Best Fit: Pittsburgh Steelers\nJarvis Landry, WR\nA knee injury limited Cleveland Browns receiver Jarvis Landry to 12 games, 570 yards and two touchdowns last year.",
    "The Los Angeles Chargers would make plenty of sense, as they were awful against the run in 2021 and recently acquired Hicks' former Bears teammate Khalil Mack.",
    "He was incredibly durable during his five seasons in Cleveland, missing only one game during that span on the reserve/COVID-19 list and none due to injury.",
    "Brown started all 17 games for the Seattle Seahawks last year, and while he did allow eight sacks, per Pro Football Focus, he wound up with a Pro Bowl nod.",
    "Best Fit: Los Angeles Chargers\nJC Tretter, C\nCenter JC Tretter was a late cap casualty this offseason, released by the Browns at the onset of free agency.",
    "Houston would make some sense for Haden, as it ranked 30th in yards per pass attempt allowed in 2021 and leads the league in cap space with $34.4 million.",
    "Haden has plenty of AFC North experience after playing for both Cleveland and Pittsburgh, and the Bengals have $17.1 million in cap space still available.",
    "Best Fit: Indianapolis Colts\nJoe Schobert, LB\nLinebacker Joe Schobert was released by the Steelers in March, following one season with the organization.",
    "He's not the strongest coverage linebacker—he allowed an opposing passer rating of 90.0 in 2021—but he's a tremendous chase-and-tackle run-stopper.",
    "Schobert, who led the league in tackles and was a Pro Bowler in 2017, has topped 100 tackles in all five of his campaigns as a full-time starter.",
    "ESPN's Jeremy Fowler reported on SportsCenter in early April that \"the concern from some teams I talk to is that maybe Mathieu has lost a step.\"",
    "The Cincinnati Bengals have a late first-round pick and could stand to upgrade a pass defense that ranked 26th in yards allowed last season.",
    "While Haden wasn't in typical form last year, he still finished with six passes defended, a forced fumble, a fumble recovery and 38 tackles.",
    "Here, you'll find 10 available players who have the proven production, experience, skill set and upside to be quality starters this season.",
    "Hicks was limited to nine games by groin and ankle injuries, but he still finished with 25 tackles, 3.5 sacks and 11 quarterback pressures.",
    "While drafting a new center is an option, Tretter is a proven commodity who could leave Baltimore with more flexibility over draft weekend.",
    "Best Fit: Cincinnati Bengals\nAkiem Hicks, DT\nDefensive tackle Akiem Hicks is 32 years old and coming off an injury-impacted 2021 campaign.",
    "With Pittsburgh last season, Schobert tallied 112 tackles, 70 solo stops, six passes defended, one forced fumble and one interception.",
    "In 2020, Fuller caught 53 passes for 879 yards and eight touchdowns while helping to post a quarterback rating of 134.2 when targeted.",
    "At 31 years old, Tretter still has plenty left in the tank and can be either a short-term replacement or a long-term starting option.",
    "He's a five-time Pro Bowler who has topped 800 yards in six of his eight seasons and will make an instant impact wherever he ends up.",
    "Baltimore lost 2021 starting center Bradley Bozeman in free agency, and Tretter has plenty of experience against AFC North defenders.",
    "He would make some sense for the Miami Dolphins and Minnesota Vikings, but the Baltimore Ravens are the most logical landing spot.",
    "Secondly, the Bears don't have a first-round pick this year, so landing an elite defensive tackle prospect may not be an option.",
    "Just about any team needing secondary help—including the Texans, Detroit Lions and Philadelphia Eagles—should be in on Mathieu.",
    "Best Fit: Chicago Bears\nTyrann Mathieu, S\nSafety Tyrann Mathieu remains one of the biggest names on the free-agent market.",
    "The Chargers also have $18.3 million in cap space and could use Schobert to help shore up their second-level run defense.",
    "Best Fit: Cleveland Browns\nWill Fuller, WR\nTo be fair, wideout Will Fuller can only be a key contributor if he's healthy.",
    "Los Angeles was terrible against the run in 2021, ranking 30th in yards allowed and 28th in yards surrendered per carry.",
    "\"Other teams\" could include the Bears and the Dallas Cowboys—who lost both Cooper and Cedrick Wilson Jr. this offseason.",
    "Last season, Tretter was responsible for only five penalties and a single sack allowed, according to Pro Football Focus.",
    "\"That's his home, and he loves it there,\" Landry's agent, Roosevelt Barnes, said, per Mary Kay Cabot of Cleveland.com.",
    "He started 11 games last season and has started 141 of 142 games since his second season in 2011 (148 of 158 overall).",
    "You'll also find a look at the best fits for each of them, based on team needs, cap space and potential draft options.",
    "Seahawks head coach Pete Carroll told team digital media reporter John Boyle that Brown is still in play for Seattle.",
    "The Bears have $13.4 million in cap space, which should be more than enough to bring back Hicks on a short-term deal.",
    "Gronkowski still deserves a spot here, though, because if he returns to Tampa, he's going to be a key contributor.",
    "Indianapolis also has $21.7 million in cap space and should have little trouble giving Brown a fair-market deal.",
    "That was his final season with the Houston Texans, in which he played with Pro Bowl quarterback Deshaun Watson.",
    "According to Mike Florio of ProFootballTalk, Landry has hoped for a contract in the $20 million-per-year range.",
    "The Ravens have just $7 million in cap space and may have to create some room to sign Tretter, but they should.",
    "\"There's mutual interest in him being back there, but Jarvis also has interest from some other teams as well.\"",
    "The 29-year-old is familiar with the Cleveland defense, and the Browns still have $19.6 million in cap space.",
    "He's one of Tom Brady's favorite targets, and he remains one of the biggest tight end mismatches in the game.",
    "The New Orleans Saints—who lost Terron Armstead in free agency—and the New York Giants could use tackle help.",
    "However, this doesn't mean that teams should look exclusively at their draft boards to fill remaining needs.",
    "Several quality players are still available, but fewer jobs will be open once rookies are added to the mix.",
    "They are also without a first-round pick, which will make landing an elite pass-rushing prospect difficult.",
    "One, Hicks has spent the past six seasons with the franchise and has plenty of familiarity with the roster.",
    "Pittsburgh has $14.9 million in cap space and could pair Mathieu with star free safety Minkah Fitzpatrick.",
    "At just 28 years old, he can still be a long-term addition for contenders and rebuilding franchises alike.",
    "At 36 years old, Duane Brown isn't a long-term play, but he can be a reliable starter for a season or two.",
    "They have yet to re-sign 2021 starter Eric Fisher and don't have a first-round pick in this year's draft.",
    "He finished last season with 76 tackles, six passes defended, three interceptions, a sack and a pick-six.",
    "Cleveland—which doesn't have a first-round selection—simply makes the most sense heading into the draft.",
    "However, the 33-year-old is still starting material and can bolster a team's secondary on the perimeter.",
    "Clowney recorded nine sacks and 32 quarterback pressures in 14 appearances opposite star Myles Garrett.",
    "The Texans, though, have a pair of first-round picks this year and could address their secondary early.",
    "They've yet to agree to terms, though, which leaves Clowney in play for other pass-rusher-needy teams.",
    "The Colts need to protect new quarterback Matt Ryan, and Brown represents a great way to help do that.",
    "He played just 22 games over the previous two seasons and has never played more than 14 in a campaign.",
    "Other receiver-needy teams with cap space include the Texans, the Indianapolis Colts and the Bears.",
    "The Indianapolis Colts, for example, just signed 2019 Defensive Player of the Year Stephon Gilmore.",
    "With the 2022 NFL draft set to get underway April 28, we're into the latter stages of free agency.",
    "Last season, Gronkowski was limited to 12 contests because of a rib injury and a punctured lung.",
    "Now that Watson is with the Browns, Cleveland becomes the most logical landing spot for Fuller.",
    "He's started 52 of his 55 career games and has averaged an impressive 14.7 yards per reception.",
    "The three-time Pro Bowler is the best starting option still available heading into the draft.",
    "He played a huge role in Cleveland's ability to field the league's fifth-ranked pass defense.",
    "He's also played for the Jaguars and Browns, and he's been a tackling machine at every stop.",
    "\"The issue is whether Mathieu agrees with the Steelers' assessment about what he is worth.\"",
    "Free agents who can be not just role players but also key contributors are still out there.",
    "Duane Brown, OT\nTeams in need of offensive tackle help are running low on veteran options.",
    "The Colts also have the cap space ($21.7 million) needed to give Landry fair-market value.",
    "They have a quarterback who knows Fuller well and have the cap space to get a deal done.",
    "The Buccaneers have just $4.8 million in cap space, so the financials could get tricky.",
    "Like I said, I love all my teammates there,\" Gronkowski told Debbie Emery of SB Nation.",
    "However, Mathieu may only be considered by teams looking for a short-term contributor.",
    "I don't ever have to decide—if I don't decide, then that just means I'm not playing!\"",
    "Haden only appeared in 12 games and allowed an opposing quarterback rating of 100.1.",
    "There should be no shortage of suitors for Hicks before, during and after the draft.",
    "If Gronk wants to come back, though, one can assume that Tampa will make it happen.",
    "For the short term, though, the 29-year-old can be a significant defensive piece.",
    "The only real question is whether the Steelers and Mathieu can agree on a price.",
    "The Chargers, however, would be an ideal landing spot for the Wisconsin product.",
    "However, he's still a tremendous player, as evidenced by last season's numbers.",
    "He was limited to two games with the Miami Dolphins in 2021 by a finger injury.",
    "He's unlikely to get that, but Indy could still make Landry an enticing offer.",
    "Somehow, one of the league's most reliable offensive linemen remains unsigned.",
    "\"The Buccaneers situation is just too good if I decide to go back and play.",
    "The Browns added Amari Cooper this offseason but still need receiver depth.",
    "Pittsburgh, though, is interested and would make for a great landing spot.",
    "He logged 49 tackles, 3.5 sacks and 29 pressures during the 2020 season.",
    "However, Indianapolis would make a ton of sense for a couple of reasons.",
    "Advanced statistics from Pro Football Reference unless otherwise noted.",
    "The Chicago Bears could use an edge-defender after trading Khalil Mack.",
    "However, a return to Cleveland still makes the most sense for Clowney.",
    "He has a whopping 250 solo stops and 40.5 sacks on his 10-year resume.",
    "Tretter has never been a Pro Bowler, but he's a rock on the interior.",
    "The Kansas City Chiefs could use a player of his caliber on the edge.",
    "Yet he still racked up 802 yards and six touchdowns on 55 receptions.",
    "He also played 100 percent of the snaps when active with the Browns.",
    "Best Fit: Baltimore Ravens\nContract and cap information via Spotrac.",
    "He's a five-time Pro Bowler who also started all 16 games in 2020.",
    "Just about every linebacker-needy team should have some interest.",
    "A return to Chicago seems more probable for a couple of reasons.",
    "And there's no guarantee that Gronkowski will play this season.",
    "For the Notre Dame product, this has been a constant struggle.",
    "That said, the 28-year-old is a dangerous downfield threat.",
    "Over the past four seasons, he has only missed four starts.",
    "He allowed an opposing passer rating of 88.1 in coverage.",
    "He should be a full-time starter in 2022 and a good one.",
    "However, he's missed only one other game in his career.",
    "He also had 24 solo stops and 11 tackles for loss.",
    "Players are listed in alphabetical order.",
    "However, the Colts make the most sense.",
    "Landry could land back with the Browns.",
    "\"I don't really have a decision date.",
    "He also earned a third Pro Bowl nod.",
    "Gronkowski told Emery.",
    "B/R Recommends"
  ]
}