{
  "id": 906,
  "mediaId": 2726,
  "date": "2022-04-19",
  "headline": "A TikTok multi-level marketing scheme is hawking dubious diet supplements and targeting young women",
  "image": "https://i.insider.com/62583d6c1ab402001927b482?width=1200&format=jpeg",
  "link": "https://www.insider.com/tiktok-itworks-multi-level-marketing-diet-it-works-2022-4",
  "mediaOutlet": "thisisinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lindsay Dodgson",
  "authorUrl": "https://www.insider.com/author/lindsay-dodgson",
  "termIds": [
    3529,
    168,
    364,
    500,
    1076
  ],
  "sentences": [
    "William Keep, a professor of marketing at the College of New Jersey's School of Business who has studied MLMs for many years, told Insider these companies persist regardless of individual success at the sales level because people are always going to be attracted to an opportunity to make fast money.",
    "Blogs like Hannah Martin's Talented Ladies Club share the personal experiences of people who have gotten out of MLMs, such as one woman who said the most she ever earned was £140 ($182) in a month, though she usually only took home somewhere between £20-60 ($26-78) in commission.",
    "Media Matters researcher Olivia Little, who wrote the report, told Insider that It Works appears to be the largest MLM company operating on TikTok, but there are others thriving on the platform, such as Herbalife Nutrition, which sells dietary supplements and smoothies.",
    "It Works is one of the most popular MLMs on the platform, but it's just one example of a bigger problem — that millions of people across the world are facing economic difficulty and turn to schemes that are unlikely to ever make them anything but a financial loss.",
    "\"The number of people who make money is minuscule, it's statistically insignificant,\" Robert L. FitzPatrick, the author of \"Ponzinomics, the Untold Story of Multi-Level Marketing\" and president of consumer organization Pyramid Scheme Alert, told Insider.",
    "A multilevel-marketing company has been operating on TikTok since at least October 2020, with young women making bold claims about how \"skinny coffees\" and diet supplements helped them in an attempt to recruit others to the scheme.",
    "Three videos featuring It Works products, flagged by Insider, were removed by TikTok, with the company saying they violated guidelines about illegal activities and regulated goods, and constituted multilevel-marketing content.",
    "It Works MLM content is reaching millions on TikTok\nInsider found 22 individual accounts, all women, selling It Works products and posting recruitment videos, as well as one active brand account affiliated with the company.",
    "It Works' products are scientifically dubious and potentially dangerous, according to health experts, and most people involved in this kind of multilevel marketing find it impossible to earn any sort of meaningful income.",
    "TikTok is \"far more reactive than proactive\" when it comes to moderating MLM content, Little added, often taking down content only after it's been brought to the company's attention by external researchers or reporters.",
    "TikTok announced it was banning content that promotes pyramid schemes and multilevel- with new policies announced in December 2020, but researchers have found that the platform is struggling to enforce those rules.",
    "TikTok's ban on multilevel-marketing schemes doesn't appear to be working\nTikTok is aware of the company, having banned its main page, and put warning labels on certain search terms associated with its products.",
    "\"Technically, replacing food for these gummies could result in weight loss, as you're stripping calories, but this is a highly disordered and extremely dangerous intervention and mindset,\" Tomlinson said.",
    "Media Matters, a media-watchdog nonprofit, posted a report on It Works on March 30, saying the company was targeting \"young, low-income women\" and exposing them to \"possible physical and financial harm.\"",
    "While estimates of how many people are involved in MLMs in the US range between 6 and 50 million, it's almost impossible to keep up with the number because the turnover is so high, FitzPatrick said.",
    "The company notes in small print at the end of the report that those figures do not include expenses incurred, and income disclosures for MLMs are notoriously unreliable and often inflate earnings.",
    "Messaging \"LOSE\" or \"CHANGE\" on these users' Instagram profiles will direct customers to several products distributed by It Works, including skinny coffee, weight-loss gummies, and diet smoothies.",
    "There's an active user base of over 760,000 people on the subreddit r/AntiMLM, where the community swaps stories, shares red flags, and warns each other about the tactics recruiters are using.",
    "The general appeal of \"miracle\" weight-loss products and the popularity of weight-loss content on TikTok means companies like It Works do extremely well on the platform, Little said.",
    "Another one of Asprilla's videos, which has over 400,000 views, shows her holding up a jar of gummies next to a caption that reads, \"How I lost 4 pant sizes without any crazy diets.\"",
    "In one video posted on April 6, a seller named Karen Asprilla shows an old picture of herself, in which she says she was a size 14, \"bloated all the time, and not confident at all.\"",
    "But the platform appears unable to keep up with the number of individual accounts actually promoting the products and keeping the company going with more recruitment and publicity.",
    "He believes all the It Works products are potentially dangerous because they could lead to eating disorders if people trust them rather than addressing overall diet and lifestyle.",
    "It Works also freely exists on Instagram, where its main account has over 63,000 followers, and on Facebook, where over 87,000 people like the page, and nearly 97,000 follow it.",
    "The company, It Works, had its account itworkshq banned by TikTok at the beginning of April, a few days after Media Matters released a report labeling the company \"predatory.\"",
    "Other accounts, like that of a prominent It Works seller called Fanny Carmona, who has 11,000 followers, appear to have been set up specifically for distributing the product.",
    "Registered nutritionist Graeme Tomlinson told Insider that there is no evidence that any of It Works products actually work, and they could, in fact, be \"extremely harmful.\"",
    "A TikTok spokesperson told Insider the app's community guidelines make clear \"that we do not allow anyone to exploit our platform to bring about financial or personal harm.\"",
    "As for the \"skinny wraps,\" body wraps that also claim to reduce stomach fat, Tomlinson says they may lead to temporary water loss, not long-term changes to the body.",
    "\"They're dropping the ball on detecting and removing more complicated and coordinated MLM schemes on their platform because they haven't even addressed the basics.\"",
    "\"You get a sense that it was literally picked up and catapulted into the mainstream with the most powerful institutions in America at that time,\" he told Insider.",
    "It Works sellers sometimes attempt to game TikTok's algorithm to boost their views by adding trending hashtags to their videos and taking part in viral trends.",
    "\"It's a cumulative churning process for people joining, being solicited — aggressively solicited — and then being involved for a year or so,\" FitzPatrick said.",
    "In 2015, Insider's Molly Mulshine visited the company's main office in Florida after seeing its weight loss products advertised on Facebook and Instagram.",
    "Keep said that the people making the most money got in early, and the people who join after are simply funneling money to those at the top of the pyramid.",
    "In a subsequent picture, she claims to now be a size 8 and full of confidence, then encourages viewers to text a number in her bio for more information.",
    "\"This includes multilevel marketing, or pyramid schemes, as well as any other schemes that attempt to defraud individuals or steal assets,\" they said.",
    "People who get involved later see other sellers who have been in the business longer reaping rewards, so they believe their dreams are within reach.",
    "\"It wouldn't work if a person said, 'I need you to keep trying for another six months because I need to make another $5,000 off of you,'\" Keep said.",
    "They urge viewers to \"Message COFFEE on Insta\" to learn more about \"the best switch I ever made\" as they dance around to trending music on the app.",
    "However, the numbers of people involved are increasing thanks to the relative ease in setting one up, and a boom during the coronavirus pandemic.",
    "There's also a great deal of shame associated with joining a business that promises to make you a successful entrepreneur and then losing money.",
    "How companies like It Works suck people into multilevel marketing\nAwareness of unethical MLMs and the financial damage they can do is spreading.",
    "Women who are part of the scheme post video after video about their apparent weight loss, often using the same messaging and background music.",
    "After speaking with several distributors, she concluded that the vast majority of It Works salespeople earn \"nowhere near enough to live on.\"",
    "Asprilla had posted a few videos of TikTok dances and simple videos of her life before her content morphed to focus on It Works full time.",
    "It Works reps claim the skinny coffee gets rid of food cravings, but Tomlinson warned that such practices can lead to disordered eating.",
    "\"It's predatory on multiple levels — not just financially, but it can have real negative consequences to a user's health,\" Little said.",
    "The revenue from average salespeople ultimately filters up to a small group concentrated at the highest levels of these companies.",
    "Other It Works sellers promote gummies, which they say will shrink your stomach, a claim Tomlinson says is not based in science.",
    "Videos under the hashtag #sknygummies, which promotes the use of It Works appetite suppressant gummies, have 2.5 million views.",
    "Entrepreneur Mark Pentecost founded It Works in 2001, and by 2014, the company claimed to be pulling in $538 million annually.",
    "\"It was a philosophical, economic, and political wave about honoring and exalting the market as a savior of all problems.\"",
    "?85.24% of all distributors earned an average of $57 per month; 2.12% earned $277 a month; and 6.84% earned $390 a month.",
    "Other videos feature weight-loss claims with before-and-after photos of customers who claimed to have used the products.",
    "Despite this, Insider found 22 users still shilling the products to hundreds of thousands of followers on the platform.",
    "FitzPatrick looked into the history of MLMs in his book, following its genesis back to late 1970s and early eighties.",
    "\"We use a combination of technology and human moderation to find and remove content that breaches these guidelines.\"",
    "I've seen so many other people like you and with just six more months, you'd be surprised what can happen.'\"",
    "\"This tiny little cadre of people at the top of these schemes who are rolling in money,\" FitzPatrick said.",
    "\"It starts with the fact that they're not even shallowly enforcing their own basic MLM rules,\" she said.",
    "Drinking coffee to suppress appetite (whether it works or not) is highly disordered,\" Tomlinson said.",
    "One prominent saleswoman, Yordanka Perez, has 446,000 followers and 2.5 million likes on her videos.",
    "Insider found 22 users shilling the products to hundreds of thousands of followers on the platform.",
    "\"If someone rips off your credit card or steals your identity, you feel like a victim,\" he said.",
    "As for why people keep joining MLMs, Keep said it's because we inherently want to trust others.",
    "The products are scientifically dubious and potentially dangerous, according to health experts.",
    "Most people don't make it a year, he said, but they are immediately replaced by someone else.",
    "\"The MLM is going to try to make you feel like you didn't succeed because it was your fault.\"",
    "Economic uncertainty and predatory practices mean that the MLM industry still persists.",
    "Some It Works sellers have thousands, or even hundreds of thousands, of followers.",
    "\"If we are hungry, it's usually a sign we need to eat and we should respect that.",
    "Asprilla, Carmona, and Perez did not respond to Insider's requests for comment.",
    "Facebook and Instagram did not respond to Insider's requests for comment.",
    "A multi-level marketing company called It Works is spreading on TikTok.",
    "In its 2021 Income Disclosure Statement, It Works revealed ?",
    "Just 0.09% were top earners, raking in $20,806 a month.",
    "\"We're looking at an enormous phenomenon here.\"",
    "\"Instead they say, 'I know how you feel.",
    "I've been in that situation."
  ]
}