{
  "id": 926,
  "mediaId": 2594,
  "date": "2022-04-07",
  "headline": "Masters 2022 LIVE: Leaderboard and scores as Scottie Scheffler takes five-shot lead and Tiger Woods makes cut",
  "image": "https://static.independent.co.uk/2022/04/09/00/GettyImages-1390363783.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/golf/masters-2022-live-leaderboard-scores-b2053802.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jamie Braidwood",
  "authorUrl": "https://www.independent.co.uk/author/jamie-braidwood",
  "termIds": [
    1313,
    2124,
    2738,
    3002,
    3515,
    3516,
    4195,
    4292,
    4698,
    595
  ],
  "sentences": [
    "1 was on another level as he produced a stunning round of five-under to take five-shot lead into the weekend\n2 weeks ago\nMasters 2022\nRound three tee times\n3:30pm: Viktor Hovland, Min Woo Lee\n2 weeks ago\nMasters 2022\nLeaderboard\n-3: Charl Schwartzel, Sunjgae Im, Shane Lowry, Hideki Matsuyama\n-2: Harold Varner III, Dustin Johnson, Kevin Na, Cameron Smith\n-1: Corey Conners, Collin Morikawa, Will Zalatoris, Danny Willett, Joaquin Niemann, Justin Thomas\nTiger Woods (+1), Rory McIlroy (+2), Jon Rahm (+2)\n2 weeks ago\nThe Masters 2022: Scheffler cards 67 to take five-shot lead\nHe leaves it short.",
    "Scottie Scheffler, with wins in three of his last five starts, will take to the final group on Saturday with a five-shot lead over the field, after what was a fraught and difficult day that tightened the chasing pack heading into the weekend, but left one man stood above the rest.",
    "Relive the second day’s play of the Masters below:\nRecommended\nMasters 2022 leaderboard\n2 weeks ago\nScottie Scheffler rises above tricky conditions to take control of The Masters\nAs the wind swirled around Augusta and the low scores dried up in the gusts, the World No.",
    "That gave the 25-year-old American a halfway total of eight under par and a record-equalling five-shot lead over defending champion Hideki Matsuyama, 2011 winner Charl Schwartzel, Ireland’s Shane Lowry and first-round leader Sungjae Im.",
    "Arriving at Augusta National on top of the rankings after three wins in his last five starts, Scheffler simply carried on where he left off with a superb second round of 67 despite a blustery wind making scoring difficult.",
    "World number one Scottie Scheffler emphatically underlined his newly acquired status as Tiger Woods fought back from a nightmare start to make the halfway cut in the 86th Masters.",
    "Four of the five previous players to hold such a halfway lead in tournament history went on to claim the green jacket, with Jordan Spieth the most recent to do so in 2015.",
    "Joaquin Niemann has played some excellent golf today and at one point held a share of the lead but his round finishes with a disappointing double-bogey six.",
    "But Scottie Scheffler has just tucked away another birdie at the 16th - his sixth in the last 10 holes - to move five shots clear at -8.",
    "His pitch across the green at 15 was judged to consider its lightening pace and he holes from eight feet to move to -7.",
    "He saves par at the last to card a round of 74, when for a few moments it looked like it could have been much worse.",
    "He says the three bogeys in a row at the turn “killed us” in the swirling winds and changing conditions.",
    "But he battled on - why would we doubt that - and has found the birdies needed to make the weekend.",
    "2 weeks ago\nThe Masters 2022: Woods finishes with 74\nWhat a brilliant performance from Tiger Woods.",
    "No one, absolutely no one, thought a player could take control of The Masters on a day like toady.",
    "Woods bogeyed four of his first five holes and at that point he faced a battle to make the cut.",
    "2 weeks ago\n2 weeks ago\n2 weeks ago\nThe Masters 2022: Scheffler moves to -8\nRemarkable.",
    "2 weeks ago\nThe Masters 2022\n“Just a tricky day,” Danny Willett reflects to Sky Sports.",
    "1 emerged to find the birdies required to seize control of The Masters.",
    "A 67, from his position, did not look possible earlier today.",
    "2 weeks ago\nThe Masters 2022: Another birdie for Scheffler!",
    "No one though that score would be reachable earlier on.",
    "He’s played both 13 and 15 to absolute perfection.",
    "Perhaps the only tentative shot of his back nine.",
    "He will take a five-shot lead into tomorrow.",
    "But what a stunning round from Scheffler.",
    "This is sublime from Scheffler.",
    "That sees him drop to -1.",
    "The World No."
  ]
}