{
  "id": 976,
  "mediaId": 2584,
  "date": "2022-04-09",
  "headline": "Belfast Giants: the ice hockey team that captivated and changed a city",
  "image": "https://i.guim.co.uk/img/media/c186ebb5527103bc958fdb7fec2605a15e70b444/0_265_4928_2957/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=04e3a2b802da9d9debf673ca566d4a5f",
  "link": "https://www.theguardian.com/sport/behind-the-lines/2022/apr/09/belfast-giants-ice-hockey-team-captivated-changed-city",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Drennan",
  "authorUrl": "https://www.theguardian.com/profile/jonathan-drennan",
  "termIds": [
    0
  ],
  "sentences": [
    "We want Northern Irish people to have a team that they can be proud of and we think that’s definitely been achieved.”\nIn the programme notes for the Giants’ first home game in 2000, the Belfast Telegraph journalist Stewart McKinlay wrote: “It will be a proud day when a Northern Irish player steps out as a Belfast Giant.” That ambition has become a reality, with nine players from Northern Ireland lacing up their skates to play for the Giants.",
    "We kept getting hammered but I was in nets, so I was getting lots of practice and eventually was spotted to play the Junior Giants.”\nDickson trained in Belfast through the week – driving an hour to start at 10.15pm and making it back at 1.30am – while studying in a technical college.",
    "Ice hockey had no history in Belfast, but somehow the Giants pull in bigger crowds than any of the city’s football clubs\nBy Jonathan Drennan for the Guardian Sport Network\nThe Belfast Giants celebrated their 22nd birthday recently and the party shows no sign of stopping.",
    "My real hope is that I’ve inspired a kid not just from Belfast, but from somewhere else in the country to get out and dream that they can play for the Giants.”\nThe Giants are fighting to clinch the double, but their plans are bigger than winning silverware.",
    "The Millennium Commission had stumped up £45m to build a gleaming arena in the shadow of the city’s shipyard, but the thought that an ice hockey team would bring in thousands of spectators still felt far-fetched.",
    "Giants fans are quick to tell you “in the land of the Giants, everyone is equal” and, in a sport known for its brutal hits, it was quickly established as one of the most family-friendly places in the city.",
    "We bought the video game, couldn’t stop playing that, and then at 17, we started playing inline hockey – initially in the local Tesco car park but we eventually set up a league in the leisure centre.",
    "The Giants won the Challenge Cup last month, beating Cardiff Devils in a sold-out final in front of 7,300 home fans, and they are top of the UK-wide Elite Ice Hockey League with a few games to play.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "“I remember a newspaper asked me for a quote and I said something like: ‘I can’t wait to bring the fighting Irish back to Ireland.’ It never ran in the newspaper and I didn’t understand why.",
    "I wanted to stay here my whole career and luckily I met my wife.”\nThe team’s general manager, Steve Thornton, is another Canadian who arrived as a player and has not been able to leave.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "The Ulster rugby team had just won the European Cup but they played in a rickety, windswept mausoleum of a ground in east Belfast that was mostly favoured by Protestant fans.",
    "Around 20 have never left.”\nOne of them is the Giants’ coach, Adam Keefe, who moved to Belfast from Ontario 11 years ago as a player, married a local and never left.",
    "Robert Fitzpatrick, who grew up in Northern Ireland in the 1970s and is now the CEO of the company that owns the Giants, says inclusivity was vital to their vision.",
    "We are now seeing generations of families in this city who are fans.”\nThe Canadians who signed for the Giants played a brand of ice hockey that thrilled the crowd.",
    "The rules still had to be explained regularly in the programme notes, by the arena announcer or even by the team’s mascot, Finn McCool, the mythical Irish giant.",
    "“I used to watch Glentoran play football in east Belfast, but she wanted to go somewhere that was under cover, safe, and had food and clean toilets.",
    "“There was a lot of hard work, and I suppose an element of some talent, and after three years, I was lucky enough to get to play for the Giants.",
    "Sectarian chanting was common and made attending a game a rotten experience for anyone who yearned for a brighter expression of local pride.",
    "It doesn’t matter and never has.”\nDavy is convinced that the strategists behind the Giants missed one important selling point for the club.",
    "Paddy Smyth was studying at Queen’s University in Belfast when he attended the team’s first game against the Ayr Scottish Eagles in 2000.",
    "Through the Giants we had a common interest and that’s all that has ever mattered.”\nDavy says he started going to games with his wife.",
    "In fact, I remember telling him that I would be playing my first game for the Giants and he said he’d be going to see Rangers instead.",
    "You’re not playing for a normal team – you have a responsibility to represent Belfast as we know what the Giants mean to people here.",
    "We’re all bound by supporting the Giants and that’s exactly what sport should be.”\nPaddy made an unlikely friend through the sport.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "“I just loved playing this sport from the start, and always had that fear that eventually I’d get found out, but I’m still here.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "The great thing about the Giants is that they really spend time educating you on the city and your responsibility playing here.",
    "“I remember coming here 20 years ago and the city’s name was synonymous with what people in Canada had heard about on the news.",
    "The Antrim hurling team played in the heart of nationalist West Belfast at Casement Park, but their glory days were long gone.",
    "“The first time I heard about ice hockey was from a friend who had come back from a cross-community trip to Philadelphia.",
    "There was peace on the streets but it was fragile, and the sporting landscape was as entrenched and traditional as ever.",
    "With Paddy, we shared this love of the Giants, got a podcast going together, and it’s a friendship I continue to value.",
    "Ice hockey was so new and so bizarre that it carried none of the traditional barriers that weighed down other sports.",
    "He went back to Canada to start a corporate career when he retired, but his family missed Belfast so they returned.",
    "The city needed something new, but the foundations for a professional ice hockey in Belfast were flimsy at best.",
    "The Good Friday agreement was just two years old and the city had been scarred by a conflict that remained raw.",
    "The club is lobbying to have a second ice rink built in Northern Ireland so more children can play the sport.",
    "Winning the double would be a huge achievement, but the Giants have been exceeding expectations for decades.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "There was (and remains) only one ice rink in Ireland and the sport was barely known, never mind understood.",
    "In Belfast, if you grow up in a certain area, it can be hard to know someone from outside your background.",
    "There was no junior league in Northern Ireland, so he took the ferry to Scotland every weekend to compete.",
    "Those shipyards were famous for building the Titanic, after all, and that had not lasted for long.",
    "If we see a young kid in a football shirt, we just give them a Giants T-shirt and they put it on.",
    "Going to Giants games and making friends with people from all sorts of backgrounds stuck with me.",
    "Would thousands of fans pay to watch North American athletes play an alien sport in a new venue?",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "There are so many former players who have stayed in Northern Ireland after they have finished.",
    "Belfast was a very different place when the Giants played their first match in December 2000.",
    "I kept up with the sport vaguely and then saw the first Giants game advertised for six quid.",
    "Sports fans in Belfast largely lived on a limited diet of rugby, football and Gaelic games.",
    "Even now, I’d struggle to tell you Catholic friends I have from Belfast outside of hockey.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "I remember one of my relatives visiting in the 1990s and talking about the Red Wings.",
    "The Giants now play to bigger crowds than any of Northern Ireland’s football clubs.",
    "I grew up with Gaelic football and football, but there wasn’t the same connection.",
    "Goaltender Andrew Dickson grew up in Ballymoney, an hour’s drive north of Belfast.",
    "And the various Irish League sides across the city were tied to political tribes.",
    "I’m a Catholic from a Republican background; he’s a Protestant and an Orangeman.",
    "He had been to a Flyers game and couldn’t stop talking about how amazing it was.",
    "I mean everyone: Protestants, Catholics, the LGTB community, it doesn’t matter.",
    "“One of the greatest recruiting tools the Giants have is the women of Belfast.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "Now our players who come over from Canada and the States absolutely love it.",
    "The odds are not in their favour, but they have a habit of overcoming them.",
    "“Right from the start, the Giants was a place where everyone was welcome.",
    "But the fanbase grew every year and so did their knowledge of the game.",
    "It was almost like the people were overcompensating in friendliness.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "“When I signed up, a friend asked me if Belfast was safe to visit.",
    "You will find loyalists and republicans sitting together at games.",
    "We’re diametrically opposed politically but we agree to disagree.",
    "Our colour is teal and that plays a strong part in our identity.",
    "There have never been any football jerseys allowed in the arena.",
    "“I was totally ignorant about the history of Belfast,” he says.",
    "“You go to the games and feel this immense pride in your city.",
    "I love chanting: ‘Come on Belfast.’ That’s who I’m supporting.",
    "“I had grown up in west Belfast and had family from Detroit.",
    "The team has inspired all sides of the community in Belfast.",
    "And we provide all this for free, for everyone to read.",
    "He’s at every game and even brings the neighbours down.",
    "There was a method behind the apparent madness, though.",
    "They were so keen to make sure you enjoyed their city.",
    "We do this because we believe in information equality.",
    "If there were ever a time to join us, it is now.",
    "Now they want their young fans to play the game.",
    "You don’t even need to sell the Belfast Giants.",
    "The team would represent the whole of Belfast.",
    "Yet everyone who comes absolutely loves it.",
    "“My friend Davy and I are really opposites.",
    "I had no family background in ice hockey.",
    "It’s funny, my dad didn’t follow it all.",
    "When I first arrived, I was surprised.",
    "I found that shortly after I arrived.",
    "Hockey is mainstream in Belfast now.",
    "… we have a small favour to ask.",
    "They couldn’t be treated better.",
    "I loved it right from the start.",
    "I went and it stuck with me.",
    "Now he absolutely loves it.",
    "Players just want to come.",
    "I mean hockey in Ireland?",
    "I couldn’t say no.",
    "Everyone is equal.",
    "Thank you.",
    "?"
  ]
}