{
  "id": 993,
  "mediaId": 2594,
  "date": "2022-04-06",
  "headline": "Tiger Woods seeking another incredible Augusta comeback at the Masters",
  "image": "https://static.independent.co.uk/2022/04/06/13/e4950f76a75d9c1183465de1607707c5Y29udGVudHNlYXJjaGFwaSwxNjQ5MzMyOTMx-2.66203082.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/sport/golf/tiger-woods-augusta-rory-mcilroy-los-angeles-police-b2052121.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Phil Casey",
  "authorUrl": "https://www.independent.co.uk/author/phil-casey",
  "termIds": [
    1313,
    2630,
    3936,
    4127,
    4292,
    566,
    595,
    4841,
    4984
  ],
  "sentences": [
    "You’re maybe going to have 15 or 20 more yards into the green, but the penalty for missing is greater than it was before as what people probably don’t realise is that pond on the left has been extended another 10 yards back towards the tee.”\nMcIlroy will be one of the last three players to tackle the 11th in competition after being drawn in the final group on Thursday at 1403 local time (1903 BST) alongside Matt Fitzpatrick and Brooks Koepka.",
    "(Amputation) was on the table.”\nTwelve months on, Woods will be in the spotlight once more on April 7 as he tees off in the first round of the 86th Masters, having completed an incredible journey from that crash on Hawthorne Boulevard to Magnolia Lane, the tree-lined gateway to Augusta National.",
    "“I always like sliding in a little under the radar.”\nThe same could be said of Rory McIlroy as he makes his eighth attempt to win the Masters and complete a career grand slam, the 32-year-old seeking a first major title since 2014 on the back of a missed cut in last week’s Valero Texas Open.",
    "Confined to a hospital bed for three months, initially in Los Angeles and then at home in Florida, the odds of Woods returning to competitive golf appeared slim to say the least, even for a player who had recovered from numerous knee operations and career-saving spinal fusion surgery.",
    "Following two more nine-hole practice rounds, Woods announced he intended to make his first competitive start since the Masters in November 2020, when he finished 38th in defence of his title, took 10 on the 12th hole in the final round and then birdied five of the last six.",
    "Yet by December that year he was fit enough to finish second with son Charlie in a parent-child event in Orlando, albeit with the assistance of a golf cart and a scramble format, and hopes of a competitive playing return began to rise.",
    "Police investigating the 15-time major winner’s car accident in Los Angeles 43 days earlier revealed on the eve of the 85th Masters that Woods had been travelling at almost twice the legal speed limit at the time of the crash.",
    "Aside from Woods, the other main topic of conversation has been the changes made to the course, with the 11th and 15th holes lengthened by 15 and 20 yards respectively and the tee on the former also moved to the left.",
    "Hope became hype when his private jet was tracked on social media as it made its way to Georgia last week, Woods playing a practice round – and the par-three course – at Augusta alongside Charlie and Justin Thomas.",
    "But most eyes will be on the first tee at 1034 local time (1534 BST) when Woods, accompanied by Louis Oosthuizen and Joaquin Niemann, begins yet another chapter in his remarkable story.",
    "“Estimated speeds at the first area of impact were 84-87mph and the final estimated speed when the vehicle struck the tree was 75mph,” Los Angeles County Sheriff Alex Villanueva said.",
    "It’s now walking is the hard part.”\nThe presence of Woods has arguably done the tournament favourites a huge favour, as 2020 winner Dustin Johnson admitted.",
    "Trees have also been removed from the right-hand side of the 11th hole and McIlroy said: “It’s a longer hole, but the tee shot is slightly less daunting.",
    "Woods sustained severe injuries to his right leg in the single-vehicle incident and later admitted: “I’m lucky to be alive and to still have the limb.",
    "“Anytime he tees it up, especially after his injuries, he’s going to take a lot of attention, which is OK with me,” the former world number one said.",
    "“The fairway is 50 to 60 yards wide but if you go down that right half, you’re going to be stuck behind those three trees.",
    "On April 7 last year, Tiger Woods found himself in the spotlight for all the wrong reasons.",
    "“I don’t show up to an event unless I think I can win it,” Woods said.",
    "I don’t have any qualms about what I can do from a golf standpoint.",
    "You don’t have that collection of trees on the right-hand side.",
    "The speed limit on that stretch of road is 45mph.",
    "“The second shot is basically the same.",
    "“I can hit it just fine."
  ]
}