{
  "id": 995,
  "mediaId": 2570,
  "date": "2022-04-06",
  "headline": "Masters-Themed Products Kick Off Golf 2022",
  "image": "",
  "link": "https://www.forbes.com/sites/scottkramer/2022/04/06/products-to-kick-off-the-golf-season/?sh=f7424225106c",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Kramer",
  "authorUrl": "https://www.forbes.com/sites/scottkramer/",
  "termIds": [
    0
  ],
  "sentences": [
    "That said, you can buy the regular version of the ball that sports a REACTIV iQ urethane cover that reacts differently for longer clubs – you’ll get maximum speed and distance – than shorter clubs, in which you’ll get spin and feel.",
    "The popular and extremely comfortable shoe integrates the brand’s running and lifestyle features, including a removable Arch Fit insole to reduce shock, a lightweight and responsive midsole, and waterproof synthetic upper.",
    "Linksoul’s Thank You Mr. Elder charity tee shirt honors golf legend Lee Elder who in 1975 became the first Black golfer to play in the Masters – forever weaving his spirit into the game.",
    "Perhaps my favorite special-run product this week is the new adidas Golf limited-edition Tour360 22 Waffle House shoe in collaboration with the iconic Georgia-based restaurant.",
    "Galvin Green’s full-zip ARVIN jacket features Augusta’s shades of white, yellow and green – and greatly resembles the caddie outfit of the tournament.",
    "In celebration of his return, his ball company Bridgestone Golf produced one-off versions of his TOUR B XS TW ball with a #TigersBack22 sidestamp.",
    "The shoe is outstanding, by the way – I’ve played several rounds in it this year and find the stability and comfort to be top-notch.",
    "You may glimpse Matt Fitzpatrick donning Skechers GO GOLF Pro 5 Hyper golf shoes in a green-and-white color scheme this week.",
    "But you can get into the spirit by getting several Masters-themed products that are either now or soon available online.",
    "Tiger Woods is officially playing in the event – marking an amazing comeback after his serious auto accident last year.",
    "It’s not for sale, but the company is giving away the ball for promotional purposes at Augusta over the next few days.",
    "A transparent outsole also captures that friendly pour of maple syrup underneath our new SPIKEMORE traction system.",
    "SIK by LA Golf’s limited-edition Augusta-inspired putter is a classic plumber neck blade that’s 100% CNC milled.",
    "It also sports the brand’s Descending Loft Technology face that aims to get putts rolling quickly and on-target.",
    "Beyond the upper, the shoe features special yellow sock liners with both the adidas and Waffle House logos.",
    "Lined with Gore-Tex, it’s 100% waterproof and windproof, plus has excellent breathability.",
    "And the upper is an off-white “batter-like” color, and sports a checkered waffle design.",
    "I’ve been wearing it for two weeks and love how warm it keeps me in cooler weather.",
    "The Masters begins tomorrow, unofficially kicking off the 2022 golf season.",
    "The famed adidas three-stripe form on the saddle looks like pancake syrup.",
    "Comes with an embroidered headcover that features an azalea and red flag.",
    "Sales proceeds of this shirt go directly to her mounting medical bills.",
    "Clubhead and shaft are serialized with matching number designations.",
    "They will be available to the public later this month.",
    "It’s available for men and women, starting tomorrow.",
    "His widow, Sharon, is now battling Alzheimer’s.",
    "I get hungry for breakfast just looking at it.",
    "The restaurant’s logo is on the heel.",
    "What’s not to like here?",
    "And it’s lightweight."
  ]
}