{
  "id": 184,
  "mediaId": 238,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Another sign of Cheney's estrangement from the GOP",
  "image": "https://newsletter-imgs.s3.amazonaws.com/prod/the-202s/primary/early.svg",
  "link": "https://www.washingtonpost.com/politics/2022/04/19/another-sign-cheney-estrangement-gop/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2341,
    2341,
    2275,
    2275,
    688,
    688,
    1147,
    1248,
    1147,
    1248,
    1335,
    1335,
    1467,
    1467,
    24,
    24,
    428,
    428,
    2905,
    2905
  ],
  "sentences": [
    "Robust concrete structures, such as banks or government buildings, may be used as a strongpoint from which to defend.?\nUnderground spaces, such as maintenance tunnels and subways, offer areas to depot supplies, protect from aerial attacks and conceal movement from the enemy.?\nOnce the fighting starts, trucks, buses, large concrete blocks, tires and sandbags [are used to create] barriers to protect Ukrainian defenders and block the advance of enemy troops and armor down city streets.",
    "White House officials plan to formally launch the effort [today] at a summit on strengthening U.S. early-warning systems for health threats.?\nRussia's pivot to eastern Ukraine, visualized: Just weeks into its war in Ukraine, Russia has shifted its focus to the country's east, redeploying weapons and troops and increasing attacks on key towns and cities,? our colleagues Aaron Steckelberg, Adam Taylor, Ruby Mellen, Alex Horton and Dylan Moriarty report.",
    "In today's edition Former Rep. Joe Crowley switches lobbying firms  President Biden heads to Portsmouth, N.H., to tout the infrastructure law  The Post's Lena H. Sun on a new team of federal health scientists that wants to be like the National Weather Service, but for infectious diseases?... A 3D animation explaining Russia's decision to give up on urban war in Kyiv and turned to big battles in the east  but first \nYes, Rep. Liz Cheney (R-Wyo.)",
    "About 100 scientists will analyze technical data and communicate policy options to decision-makers and the public about how the virus is behaving and who is most at risk  in user-friendly terms.?\nThe Center for Forecasting and Outbreak Analytics, which starts with $200 million in funding, was created last summer to improve understanding by the CDC and the government more broadly of the coronavirus  and future outbreaks  in real time.",
    "3 in House GOP leadership for her unyielding criticisms of Trump for spreading falsehoods about the election and his role in the Jan. 6, 2021, attack on the Capitol\nShortly thereafter she was named by Speaker Nancy Pelosi (D-Calif.) to serve on the House committee investigating the insurrection  making her persona non grata among most House Republicans.",
    "Happening today: A new team of federal health scientists officially embarks on a mission to provide what has often been absent from the nation's response to the coronavirus pandemic: better, faster information about what's likely to happen next in this public health emergency and in future outbreaks,? our colleague Lena H. Sun reports.",
    "The sudden pivot to friendlier territory  where pro-Moscow separatists have fought for years  comes after Russian forces failed to capture Ukraine's capital, Kyiv.?\nWhy Russia gave up on urban war: Urban areas are a three-dimensional terrain in which attackers must consider a 360-degree sphere of potential threat.",
    "Brent Kappel, a campaign finance expert and lawyer at Harmon Curran, surmised that Cheney and others may no longer want to be ideologically? associated with WinRed, adding that the lack of transparency about the platforms fees and expenditures has also troubled campaign finance experts.",
    "Is all of this money going to one company and who is profiting from it??\nA Republican operative, who spoke on the condition of anonymity to discuss party tensions over the platform, noted that WinRed has continued to peddle unsettling? messages in fundraising appeals.",
    "Republicans started WinRed in 2019 as the party's answer to ActBlue, the Democratic donation-processing platform that's raised nearly $10 billion for liberal candidates and causes since 2004 and that helped power a surge in grassroots fundraising during the Trump era.",
    "Affirming U.S. support to our partners in the Balkans is especially critical as we experience the most precarious military situation in Europe since World War II,? Shaheen, who chairs the Senate Foreign Relations' Committee's Europe subcommittee, said in a statement.",
    "They continue to give a platform and help people like Paul Gosar and Marjorie Taylor Greene  people who traffic in white supremacy,? said the operative, referring to House Republican lawmakers who've attracted condemnation for their far-right views.",
    "We think of ourselves like the National Weather Service, but for infectious diseases,? Caitlin Rivers, an epidemiologist and associate director for science at the initiative, run by the Centers for Disease Control and Prevention, told Sun.",
    "Crowley decamps for Dentons: Former Rep. Joe Crowley (D-N.Y.), who landed at the lobbying firm Squire Patton Boggs after losing his primary to Alexandria Ocasio-Cortez in an upset in 2018, is leaving for one of its rivals.",
    "In April 2021, the New York Times reported that the Trump campaign's 2020 donation page, set up and hosted by WinRed, featured pre-checked boxes to automatically take recurring payments out of donors' bank accounts.",
    "Defenders have an advantage, but they must worry about limiting harm to civilians and the city itself.?\nBuildings provide high angles from which to shoot as well as cover from observation and attacks.",
    "But the fine print of the Wyoming Republican's personal fundraising record is perhaps just as interesting and serves as another sign of how far removed she is from the party she once helped lead.",
    "Cheney stopped using WinRed last year  her final payment to the platform was Aug. 10, according to Federal Election Commission filings  a few months after she was booted from the number No.",
    "raised an astonishing $2.9 million in the first quarter of 2022 in her reelection contest against fellow Republican, Harriet Hageman, who is backed by former president Donald Trump.",
    "Country First, the PAC run by Rep. Adam Kinzinger (R-Ill.)  who is also on the Jan. 6 committee and who isn't running for reelection  uses NationBuilder to handle its donations.",
    "Cheney is no longer using WinRed, the small-donor fundraising platform Republicans rallied to in recent years at the urging of Trump and the Republican National Committee.",
    "What does it say about the party that it will condone and be okay with trafficking in this rhetoric in order to raise money??\nNever let a recess go to waste: Sens.",
    "But left the door open to recruiting some of his former House colleagues who aren't running for reelection to Dentons once they leave Congress in January.",
    "As the New York Times' Katie Rogers' points out, Monday's White House Easter Egg Roll went a little differently than the 2019 White House Easter Egg Roll.",
    "He'll fly to Portland, Ore., on Thursday to talk infrastructure once again before heading to Seattle on Friday to discuss inflation and climate change.",
    "Happening today: President Biden is heading to Portsmouth, N.H., today to tout the benefits of the bipartisan infrastructure law he signed last year.",
    "Crowley's departure means he'll be splitting up his partnership with former Rep. Bill Shuster (R-Pa.), who left Congress at the same time as Crowley.",
    "We don't know where all the money that's going into WinRed is going there's been zero transparency on that since it's an LLC,? said Kappel.",
    "The senators will travel to Bosnia and Kosovo  which, like Serbia, are not members of NATO  before visiting NATO headquarters in Belgium.",
    "Jeanne Shaheen (D-N.H.), Thom Tillis (R-N.C.) and Chris Murphy (D-Conn.) are in Serbia as part of a trip to reassure European allies.",
    "This new platform will allow my campaign and other Republicans to compete with the Democrats money machine,? Trump wrote at the time.",
    "This has been a priority of mine and I'm pleased to share that it is up and running!?\nThe platform has not been without controversy.",
    "Barricades also redirect the enemy to areas that defenders have pre-targeted with artillery and explosives.?\nWhat we're reading:",
    "The two men came to Squire Patton Boggs in 2019 as one of the rare bipartisan duos of former lawmakers turned lobbyists.",
    "She is instead using Anedot, a competing online payment processor for Republicans that was started over a decade ago.",
    "Phil Scott, a Republican who has clashed with Trump, uses Anedot to process his reelection campaign contributions.",
    "In an interview on Tuesday, Crowley declined to say whether he'll be bringing any clients with him.",
    "Crowley is heading to Dentons, the behemoth law firm that maintains a Washington lobbying presence.",
    "Trump blessed WinRed, and Republicans moved to shut down rivals, although Anedot survived.",
    "He'll be a senior policy director, charged with growing the firm's public policy team.",
    "Cheney isn't the only Republican who has clashed with Trump who isn't using WinRed.",
    "(Other NationBuilder users include New Zealand Prime Minister Jacinda Ardern.)",
    "State attorneys general launched investigations into the practice last year.",
    "(The firm also processes donations to nonprofits and other groups.)",
    "Cheney's office declined to say why she is no longer using WinRed.",
    "Anedot and WinRed did not respond to requests for comment.",
    "If I was a donor, I'd be a little concerned about it.",
    "Tips: earlytips@washpost.com.",
    "Thanks for waking up with us.",
    "Good morning, Early Birds.",
    "And Vermont Gov."
  ]
}