{
  "id": 188,
  "mediaId": 195,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "Five takeaways from last quarter's fundraising",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/03/cheneyliz_032822gn_lead.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/campaign/3270413-five-takeaways-from-last-quarters-fundraising/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lexi Lonas",
  "authorUrl": "https://thehill.com/author/lexi-lonas/",
  "termIds": [
    1136,
    1136,
    1026,
    1026,
    1147,
    1147,
    1572,
    1572,
    428,
    428,
    337,
    337,
    393,
    393,
    142,
    142,
    146,
    146,
    2672,
    2672
  ],
  "sentences": [
    "Some of Trump's favorite targets rake in millions\nAlthough Trump has attempted to flaunt his influence in the 2022 elections by targeting those who have condemned his actions or are unsupportive of his false 2020 election fraud claims, his favorite opponents raked in millions last quarter.",
    "), who has drawn Trump ire due to her repeated condemnation of his 2020 election fraud claims and her position on the House panel investigating the Jan. 6, 2021, attack on the U.S. Capitol, raised $2.94 million in quarter one with a total of almost $10 million in cash on hand.",
    "Democratic committees outraise Republicans\nThe Democratic Congressional Campaign Committee (DCCC) raised $52.4 million in the first quarter, beating the National Republican Congressional Committee by more than $11.5 million.",
    "Here are five takeaways from last quarter's fundraising, which was due on Friday:\nCandidates haul in record amounts\nCandidates on both the left and the right have raised record amounts of money during last quarter's cycle.",
    "Lower-profile targets who vexed Trump brought in smaller amounts in the first quarter as the Republican primaries have become a fight between pro-Trump candidates and those who see the former president less favorably.",
    "Candidates, committees and outside groups will go into the second quarter with millions of dollars available to rally to their cause, with almost seven months until election day but some primaries fast approaching.",
    "The Pennsylvania Senate primary also seems to be favoring the progressive candidate, with John Fetterman raising $3.1 million throughout the last quarter with $4.1 million cash on hand.",
    "Prominent progressives see big gains against moderate opponents\nSeveral prominent progressive Democrats boasted significant cash over their centrist opponents ahead of the primaries.",
    "Murkowski, the only senator to vote to convict Trump in his impeachment trial who is up for reelection this year, brought in $1.5 million, bringing her cash on hand to $5.2 million.",
    "The Republican Congressional Leadership Fund said it raised $37.5 million, while the Democratic House Majority PAC and House Majority Forward said it earned more than $16 million.",
    "Although Democratic candidates and committees seem to have pulled ahead in first-quarter funding, outside Republican groups have earned more than their Democratic counterparts.",
    "But outside GOP groups rake in more than Democratic counterparts\nOutside Republican groups, however, saw higher success than their Democratic counterparts in the last quarter.",
    "Her centrist opponent, incumbent Rep. Henry Cuellar (D-Texas) raised $753,000 in the same time period, but has slightly more cash on hand at $1.4 million.",
    "Moderate Rep. Shontel Brown (D-Ohio) is faring better than her colleagues by raising $643,000 in the last quarter, with $582,000 cash on hand.",
    "Democrats and Republicans are reporting massive fundraising gains in the first quarter of what is expected to be a competitive election year.",
    "The group touted its highest fundraising achievement in March when it earned $13.28 million, the highest March fundraising haul on record.",
    "Progressive Texas House candidate Jessica Cisneros raised $1.7 million from Feb. 10 to the end of March, with $1 million cash on hand.",
    "On the Republican side, Sen. Marco Rubio (R-Fla.) garnered $5.8 million and Sen. Lisa Murkowski (R-Alaska) pulled in $1.5 million.",
    "Fundraising reports are also a look into former President Trump's influence, and some of his favorite targets have made millions.",
    "Nonincumbent Democrats are also raising large amounts  Rep. Val Demings (D-Fla.) raised $10 million in her challenge of Rubio.",
    "The Republican State Leadership Committee and its partner, the State Government Leadership Foundation, raised $10.1 million.",
    "Her total raised slightly towers over progressive candidate Nina Turner, who raised $609,000, with $259,000 cash on hand.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Sen. Mark Kelly (D-Ariz.) garnered $11.3 million, while Sen. Maggie Hassan (D-N.H.) earned $4.3 million.",
    "She faces Trump-endorsed Wyoming attorney Harriet Hageman, who earned $1.3 million in the last quarter.",
    "She faces Trump endorsed primary challenger Kelly Tshibaka, a former state administration commissioner.",
    "Among vulnerable incumbent Democrats, Sen. Raphael Warnock (D-Ga.) raised more than $13.6 million.",
    "The Republican Women for Women Action Fund also said it raised $4.6 million in the first quarter.",
    "However, among state committees, Republicans seemed to lead last quarter's fundraising.",
    "Meanwhile, the National Republican Senatorial Campaign Committee earned $43 million.",
    "Moderate opponent Conor Lamb raised $1.7 million and has $2.2 million cash on hand.",
    "The Democratic Legislative Campaign Committee says it garnered $6.5 million.",
    "The DCCC says it has $113.3 million on hand at the end of the first quarter.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Rep. Liz Cheney (R-Wyo."
  ]
}