{
  "id": 190,
  "mediaId": 558,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Will Trump's reckless' endorsements be a referendum on his political power?",
  "image": "https://s.yimg.com/ny/api/res/1.2/BX8r55JzuuG_5EYqvNUi6A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU3NjtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/SpfszZUkx4p4sgA7Szl7BA--~B/aD02MDA7dz0xMDAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/theguardian_763/345003b95390d8caa25f22886ab504e3",
  "link": "https://sg.news.yahoo.com/trump-reckless-endorsements-referendum-political-060053676.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Smith",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    2087,
    2095,
    2475,
    2491,
    3085,
    3094,
    428,
    2862
  ],
  "sentences": [
    "a distinguished professor of history at American University in Washington, said: He's interested in shaping the party, endorsing those who he thinks support him and his approach to politics, and he's also trying to put into place in some key swing states like Michigan, Arizona and Georgia folks that he thinks can help him steal the next election if he runs.?\nThere are also financial incentives.",
    "Trump's Save America group, responsible for countless fundraising events and emails, netted a massive $124m between November 2020 and March 2022 while spending only about $14m, or about 11%, to support midterm candidates, according to an\na political science professor at Brown University in Providence, Rhode Island, said: This has become a business for Trump.",
    "As his other businesses either get sold or dry up or are subject to lawsuits or criminal investigation, he's still continuing to raise a lot of money and he gets to support his lifestyle through all of these activities.?\nA procession of Republican aspirants have beaten a path to Trump's luxury in Palm Beach, Florida, in the hope of joining the anointed ones.",
    "A more seasoned politician would have been a little more judicious, a little more careful on these close races.?\nA string of primary losses for Trump's picks could also puncture the aura of inevitability around him as party standard bearer in the race for the White House in 2024, encouraging potential rivals such as Ron DeSantis, the governor of Florida.",
    "Like some others, JD Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,?\nHe is also the former governor of Alaska and vice-presidential nominee, who is far from guaranteed to win a vacant House seat in her home state.",
    "a pollster and political consultant, said, I don't think it's risky for him because he doesn't acknowledge losing: if they win, they win because of him; if they lose, they lost because of their own failure.?\nTrump has been written off countless times before.",
    "Defeat for Oz by David McCormick in Pennsylvania on 17 May, followed by defeat for Trump-backed David Perdue against incumbent governor Brian Kemp in Georgia a week later, could deal a huge blow to Trump's status as party kingmaker.",
    "Larry Jacobs, director of the Center for the Study of Politics and Governance at the University of Minnesota, said: Donald Trump is like a reckless gambler that's gone into a casino and put his stack of money on one number.",
    "The upcoming primaries  votes in states and districts to decide which Republicans will take on Democrats in November's midterm elections  are shaping up to be a referendum on his dominance of the party.",
    "Some say his bets on extreme candidates are risky, as losses could threaten his role as king and kingmaker in the Republican party\nHe has long held that the true measure of a man is his TV ratings.",
    "Now, it's my turn!?\nperhaps the climactic primary battle will come in Wyoming in August when congresswoman Liz Cheney, who has come to is challenged for a House seat by pro-Trump Harriet Hageman.",
    "Another setback occurred in Alabama, where of congressman Mo Brooks in a Senate race, claiming that Brooks made a horrible mistake? when he told supporters to put the 2020 election behind them.",
    "In the Pennsylvania Senate race  potentially critical to determining which party controls the chamber  he initially backed Sean Parnell, only for amid spousal abuse allegations.",
    "That means people like you.?\nTrump stunned his own party by his decision to back Oz, who is struggling in the real polls and far from certain to win the Republican primary.",
    "One evident motive is to install loyalists who pass the litmus test of supporting his false claim that the 2020 presidential election was stolen by Joe Biden.",
    "Why Trump is so willing to jeopardise his brand  and how he would respond to being given a bloody nose by Republican voters  remains a matter of conjecture.",
    "The chattering class of both parties in Washington DC, starting with [Senator Mitch] McConnell on the Republican side, will read those tea leaves that way.",
    "Never before has a US president left office only to continue barnstorming the country and insert himself so aggressively into congressional elections.",
    "But at February's Conservative Political Action Conference, he received more votes for the 2024 nomination than all other Republicans combined.",
    "It's almost certain that the growing sentiment among Republican leadership that Trump's day has come and gone will be reinforced this year.",
    "Trump's subsequent reportedly encouraged by Trump's wife, Melania, and Fox News host Sean Hannity, carries liabilities of its own.",
    "cofounder of the Lincoln Project, an anti-Trump group, said: Some people will say that; more people might even want to believe it.",
    "Right now the roulette wheel is turning and, if he's wrong on a number of these, you're going to see increasing defiance.",
    "So perhaps it came as no surprise when Donald Trump endorsed a celebrity doctor for a US Senate seat in Pennsylvania.",
    "In 2014 he admitted to Congress that some of the products promoted on his show lacked scientific muster?.",
    "They liked him for a long time,? Trump said of Mehmet Oz at a rally in Pennsylvania last week.",
    "Trump is laying the groundwork for to take control of election machinery across the country.",
    "Sarah shocked many when she endorsed me very early in 2016, and we won big,? Trump stated.",
    "The host of the syndicated The Dr Oz Show is described by critics as a snake oil salesman.",
    "Most observers suspect the real reason was that polls show Brooks heading for defeat.",
    "Cheney has huge name recognition in the state and is raising vast sums of money.",
    "It was one among dozens of risky bets placed by Trump on extreme candidates.",
    "They run the gamut from shoo-ins to too-close-to-call to genuine underdogs.",
    "You know, when you're in television for 18 years, that's like a poll.",
    "He's put his political capital on the line in so many races.",
    "Some of Trump's endorsements have already backfired.",
    "Next month could be pivotal.",
    "That's like a poll."
  ]
}