{
  "id": 205,
  "mediaId": 65,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Targeted by Trump, Cheney hauls in nearly $3 million the past three months for her re-election run",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a4aa8cb1-d4bf-452f-b55f-f347f060361b/068d00a8-7aa2-45a7-b3ed-f0e77db3dd27/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/targeted-trump-cheney-nearly-3-million-reelection-run",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    945,
    945,
    1147,
    1147,
    1248,
    1248,
    2087,
    2087,
    428,
    428,
    556,
    556,
    427,
    427,
    2946,
    2946,
    2858,
    2858
  ],
  "sentences": [
    "They were a fundraiser in Miami hosted by PayPal co-founder and billionaire venture capitalist Peter Thiel, who's a Trump ally; a fundraiser at the former president's Mar-a-Lago resort in Palm Beach, Florida, hosted by Sen. Rand Paul, where Trump made an appearance; and a fundraiser in the nation's capital headlined by House Minority Leader Kevin McCarthy, R-Calif.\nMcCarthy is one of dozens of House Republicans who are backing Hageman in her push to oust Cheney.",
    "(Sarah Silbiger/Bloomberg via Getty Images)\nCheney, a longtime vocal GOP Trump critic, was the most senior of the 10 House Republicans who voted to impeach the then-president on a charge of inciting the deadly attack on the U.S. Capitol by right-wing extremists and other Trump supporters who aimed to disrupt congressional certification of now-President Biden's Electoral College victory in the 2020 election.",
    "LIZ CHENEY HAULS IN OVER $7 MILLION LAST YEAR AS SHE FENDS OFF PUSH BY TRUMP TO OUST HER FROM CONGRESS\nCheney caught a break last month when the Wyoming legislature decided against scrapping same-day party registration in primaries, which would have prevented Democrats from crossing party lines and registering as Republicans to vote for Cheney in the state's Aug. 16 primary.",
    "CHENEY TELLS FOX NEWS THAT BEHIND THE SCENES', MANY IN GOP ARE THANKING HER\nCheney, who's been very vocal in emphasizing the importance of defending the nation's democratic process and of putting country before party, is one of only two Republicans serving on a special select committee organized by House Democrats to investigate the storming of the U.S. Capitol.",
    "Cheney  the most high-profile of the 10 House Republicans who voted 15 months ago to impeach Trump for allegedly sparking the Jan. 6, 2021, attack at the U.S. Capitol  on Monday reported hauling in $2.94 million in the January-March first quarter as she runs for re-election this year.",
    "Cheney released her fundraising figures a couple of days after Harriet Hageman, the leading Republican candidate challenging Cheney, announced that she brought in roughly over $1.3 million the past three months, according to figures shared first with Fox News.",
    "Cheney, a conservative lawmaker and defense hawk who's the daughter of former Vice President Dick Cheney, immediately came under verbal attack from Trump and his allies, and last May was ousted from her number-three House GOP leadership position.",
    "Cheney's first-quarter haul was boosted by a lucrative fundraiser on her behalf headlined last month by Sen. Mitt Romney of Utah, the 2012 GOP presidential nominee and a vocal Republican Trump critic.",
    "Defending herself, the congresswoman said at the time, \"I'm a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.\"",
    "The three-term conservative congresswoman who represents Wyoming's at-large district also reported holding $6.8 million cash on hand in her campaign coffers as of the end of March.",
    "Repeated attacks by former President Donald Trump as he tries to oust Rep. Liz Cheney from Congress keep fueling massive fundraising by the Republican lawmaker from Wyoming.",
    "And the former president and his allies successfully urged some, but not all, of the other anti-Cheney candidates to drop out of the primary and coalesce around Hageman.",
    "Former President George W. Bush, and former Republican House Speakers John Boehner and Paul Ryan, have also helped raise campaign cash for Cheney.",
    "The move by Wyoming's legislature was seen as a defeat for Trump and his allies, who pushed to end same-day party registration.",
    "The highest profile of those staying in the race is state Sen. Anthony Bouchard, a strong supporter of the former president.",
    "CLICK HERE TO GET THE FOX NEWS APP\nHageman's first-quarter haul was boosted by three top-dollar fundraisers on her behalf.",
    "Cheney raised $1.5 million, $1.9 million, $1.7 million, and just over $2 million in the four fundraising quarters of 2021.",
    "Trump, stepping up his efforts to oust Cheney from Congress, endorsed Hageman as she entered the race.",
    "The Republican National Committee in February censured Cheney over her role on the Jan. 6 committee.",
    "Cheney's new fundraising figures were first reported by Politico and confirmed by Fox News.",
    "Hageman, who's backed by Trump, also reported just over $1 million cash on hand."
  ]
}