{
  "id": 207,
  "mediaId": 195,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Cheney sets personal fundraising record",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/04/cheneyliz_032822gn2_lead.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/campaign/3263903-cheney-sets-personal-fundraising-record/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell/",
  "termIds": [
    945,
    1078,
    1147,
    1248,
    1609,
    2465,
    3085,
    3094,
    2590,
    2946
  ],
  "sentences": [
    "While Hageman has the support of Trump and McCarthy, Sen. Mitt Romney (R-Utah) and former President George W. Bush are supporting Cheney, whose father, Dick Cheney, was Bush's vice president.",
    "Hageman, who announced her candidacy in September, raised roughly $745,000 in the second half of 2021, putting her well behind Cheney's strong fundraising totals.",
    "The congresswoman is currently one of two Republicans, alongside Rep. Adam Kinzinger (Ill.), sitting on the House select committee investigating the Capitol riot.",
    "Hageman has the support of former President Trump and House Minority Leader Kevin McCarthy (R-Calif.), but her fundraising appears far smaller than Cheney's.",
    "Cheney raised $2.94 million in quarter one, according to a source familiar with the fundraising, bringing her total haul this cycle to upward of $10 million.",
    "set a personal fundraising record in the first quarter of 2022, raking in nearly $3 million as she fights off a Trump-backed primary challenger.",
    "Cheney attracted the ire of many of her colleagues when she rejected Trump's false claims that the 2020 presidential race was stolen from him.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "She went on to vote to impeach Trump for incitement of insurrection? following the Jan. 6, 2021, attack on the Capitol.",
    "In quarter two she raised $1.9 million, followed by $1.7 million in quarter three and $2.05 million in quarter four.",
    "The primary battle between Cheney and Hageman is shaping up to be one of the most closely watched races this cycle.",
    "The quarter one fundraising haul puts Cheney well ahead of her primary opponent, Wyoming attorney Harriet Hageman.",
    "Last month, however, more than 100 House Republicans, including McCarthy, hosted a fundraiser for Hageman.",
    "In May 2021, House Republicans voted to oust Cheney from her leadership post as conference chairwoman.",
    "With the funds raised in the first three months of 2022, Cheney has $6.8 million in cash on hand.",
    "She raked in $1.5 million in quarter one of last year, a record at the time.",
    "The first-quarter total set a personal fundraising record for Cheney.",
    "Politico first reported on Cheney's quarter one fundraising success.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Kinzinger is not seeking reelection.",
    "Campaign\nRep. Liz Cheney (R-Wyo.)",
    "The primary is set for Aug. 16."
  ]
}