{
  "id": 208,
  "mediaId": 238,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Post Politics Now Biden wades back into politically fraught politics of gun control",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/11/biden-gun-control-dettelbach/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2328,
    2328,
    1609,
    1609,
    2087,
    2087,
    1248,
    1147,
    1248,
    1223,
    1223,
    1147,
    2715,
    2715,
    2709,
    2709
  ],
  "sentences": [
    "He finished a dismal fourth in the caucuses there in his bid to become the Democratic presidential nominee and then he lost the state by more than eight percentage points to former president Donald Trump.But over the weekend the White House released Biden's plans: A speech on his efforts to combat inflation and tout his infrastructure law in Menlo, Iowa, which happens to be in the middle of the congressional district of Rep. Cindy Axne (D-Iowa).",
    "Today, President Biden is wading back into the politically fraught politics of gun control, with plans to announce several actions in an event in the Rose Garden of the White House, including a continued crackdown on so-called ghost guns? and the nomination of Steve Dettelbach, a former U.S. attorney in Ohio, to head the Bureau of Alcohol, Tobacco, Firearms and Explosives.",
    "In a statement Sunday, White House press secretary Jen Psaki said Biden and Modi would discuss cooperation on a range of issues,? including the coronavirus pandemic and climate change, as well as Russia's brutal war against Ukraine.?\nAs Biden has pressed other nations to hold Russia accountable for its invasion of Ukraine, India has maintained its neutrality.",
    "Matthew writes:\nOn Tuesday, more than a dozen voting rights groups, spearheaded by faith leaders, will gather at The King Center in Atlanta to rally their organizations in the run-up to the midterms  and plot their strategy to outmaneuver new regulations they see as limiting access to the ballot.",
    "It is required to rule without consideration of the politics of the day.?\nReturn to menu\nThis afternoon in the Rose Garden, President Biden plans to formally unveil his choice of Steve Dettelbach, a former U.S. attorney in Ohio, to lead the Bureau of Alcohol, Tobacco, Firearms and Explosives.",
    "The Post's Cleve R. Wootson Jr. reports that a senior administration official told reporters Sunday that the White House hoped Dettelbach would be a noncontroversial appointment.? The official spoke on the condition of anonymity under ground rules set by the administration.",
    "In a statement Monday, the White House said that Dettelbach had received bipartisan praise and support from law enforcement for his work? and noted that in 2009 he was unanimously confirmed by the Senate for his position as U.S. attorney for the Northern District of Ohio.",
    "She writes:\nIn January 2021, a California man, who wrongly believed Donald Trump's election win was stolen, was charged with unlawful possession of unregistered destructive devices after he allegedly built five pipe bombs in preparation to go to war? with Democrats.",
    "Return to menu\nA virtual meeting between Biden and Indian Prime Minister Narendra Modi is taking place Monday at a time when India has remained neutral in the war between Russia and Ukraine and has been purchasing Russian crude oil at a greater clip than last year.",
    "Democrats are hoping to hold that competitive seat in the midterm elections.Then on Thursday, Biden heads to North Carolina, where Democrats believe they have a chance of picking up a Senate seat that will be left open by Republican Richard Burr's retirement.",
    "In what has become an increasingly toxic politic environment, The Post's Jaclyn Peiser notes that Jay Allen Johnson of Delta Junction, Ala., is only the latest individual to face charges for threatening the lives of lawmakers in the wake of the 2020 election.",
    "The Post's Matthew Brown zeroes in on Georgia, where voting rights advocates and faith leaders face the challenge of turning out voters despite the legislation passed there by state Republicans in the wake of Biden's upset win in the state over Donald Trump.",
    "In September, the White House pulled the nomination of Biden's previous pick for the post, David Chipman, after he faced unified opposition from Republican senators as well as concerns from a handful of Senate Democrats from states friendly to gun rights.",
    "Colby notes that Trump had previously hinted at his preference for Oz, but David McCormick, a hedge fund manager who is also a top contender in the May 17 Pennsylvania race, was spotted at Mar-a-Lago only a few days ago seeking Trump's endorsement.",
    "In multiple Republican-led states, legislatures have moved in the wake of the 2020 elections to put new restrictions in place that Democrats say are designed to suppress turnout among key constituencies, including Black voters.",
    "Annie Linskey: Biden gets out of Washington this week  President Biden makes good on a promise to Democratic leaders made in the Map Room of the White House to start paying closer heed to the party's political needs this week.",
    "A state panel came to the opposite conclusion last month, and the ruling Sunday by Polk County District Judge Scott Beattie is likely to be kicked up to the Iowa Supreme Court, according to the Des Moines Register.",
    "Late Sunday night, a judge ruled that Finkenauer, a former congresswoman, cannot appear on Iowa's June 7 Democratic primary ballot because she did not submit enough valid signatures on her nominating petitions.",
    "Biden's unilateral actions on gun control underscore how little that Congress  now in a two-week recess  has been able to do on the issue, even in the aftermath of repeated mass shootings across the country.",
    "Return to menu\nOver the weekend, former president Donald Trump threw his weight behind fellow television-celebrity-turned-politician Mehmet Oz in the contested Republican Senate primary in Pennsylvania.",
    "), who is facing a GOP primary challenge in her district from lawyer Harriet Hageman, announced Monday that she raised nearly $3 million in the first quarter of the year and has $6.8 million on hand.",
    "Dan writes:\nNow, the amiable academic faces a real-world test of his pithy TV advice: If the government fails to secure enough vaccines and tests, forcing Americans into long waits, it's his problem.",
    "If a new variant causes a sixth pandemic wave, or besieged hospitals cannot handle an avalanche of cases, those are his problems, too, and ones that can't be explained away in a cable-news segment.",
    "In a meandering written statement Trump issued just as he was starting his remarks in North Carolina, he referenced Oz's television show and said he felt Oz was the most electable candidate.",
    "If the ruling holds, however, Democrats would be left with only lesser-known candidates in the party's bid to defeat Grassley, who at age 88 is the oldest Republican senator in Washington.",
    "Lisa Murkowski and Dan Sullivan, both Republicans from Alaska, has been sentenced to 32 months in federal prison after pleading guilty to two counts of threatening to murder the senators.",
    "The longtime physician has admitted to friends that he's never faced challenges like running a White House team and navigating the bitter partisanship that animates the nation's capital.",
    "Return to menu\nAbby Finkenauer, the leading Democratic candidate seeking to topple Sen. Charles E. Grassley (R-Iowa) this year, has been knocked off the ballot, at least for now.",
    "The bill limits the number of drop boxes overall, imposes new voter ID requirements, and criminalizes passing out water and food to voters in line, among other measures.",
    "Biden's announcements also come amid a midterm election year in which Republicans are eager to brand his party as soft on crime and Democrats are seeking to push back.",
    "It was a familiar setting for Jha, who has served as dean of Brown University's public health school and been a ubiquitous presence on television during the pandemic.",
    "The $2.94 million announced by Cheney eclipses the quarterly haul of Rep. Elise Stefanik (R-N.Y.), who replaced Cheney as the House Republican conference chairwoman.",
    "This Court should not be in the position to make a difference in an election, and Ms. Finkenauer and her supporters should have a chance to advance her candidacy.",
    "The groups, which are mostly nonpartisan but also aligned with Democratic efforts, aim to show GOP leaders that their work will continue in the face of the law.",
    "He's making two trips this week to politically important places, revving up Air Force One for more-than-typical travel.First comes a stop in Iowa on Tuesday.",
    "Reuters also recently reported that India has bought at least 13 million barrels of Russian crude oil since the country invaded Ukraine in late February.",
    "It's a pick that underscores how politically fraught the issue of gun control can be, as well as the process of putting people in place to carry it out.",
    "Each weekday, we'll guide you through the news with assists from some of the best political reporters in the business providing insights and analysis.",
    "Chipman had worked at ATF for more than two decades before joining the gun-control group led by former congresswoman Gabrielle Giffords (D-Ariz.).",
    "Last week, India abstained when the United Nations General Assembly voted to suspend Russia from its seat on the 47-member Human Rights Council.",
    "Matthew notes that opponents of Georgia's law have pointed to numerous measures they said are meant to crack down on minority participation.",
    "He can elevate his preferred candidates in primaries, but they're not always best suited to winning broader support in a general election.",
    "In Wyoming, Cheney is facing a candidate backed by both former president Donald Trump and House Minority Leader Kevin McCarthy (R-Calif.).",
    "By comparison, an event a few weeks earlier for Cheney featuring Sen. Mitt Romney (R-Utah) yielded about $500,000, according to Politico.",
    "Return to menu\nThe reality in Washington is that even with President Biden's strong backing, voting rights legislation is stalled.",
    "Welcome to Post Politics Now, a new live experience from The Washington Post that puts the day's political headlines into context.",
    "Stefanik said late last week that she had raised over $2 million? for her main campaign account and others aiding GOP candidates.",
    "Return to menu\nAshish Jha, who took over Monday as President Biden's coronavirus czar, made his presence felt immediately.",
    "With the Senate evenly divided between Democrats and Republicans, any election this year could tip the balance of power.",
    "He previously endorsed Republican Sean Parnell, who ended his campaign last year amid allegations of domestic abuse.",
    "The endorsement of Dr. Oz underscores why Trump's involvement in GOP primaries makes some Republicans nervous.",
    "Dettelbach enjoyed the backing of gun-control groups during an unsuccessful 2018 race for Ohio general.",
    "Being in Trump's crosshairs has considerably helped Cheney with out-of-state fundraising as well.",
    "However, this Court's job is to sit as a referee and apply the law without passion or prejudice.",
    "At 3 p.m. weekdays, return to this space and we'll address what's on the mind of readers.",
    "Cheney's second-quarter haul is more than double what Hageman raised last quarter.",
    "Return to menu\nA 65-year-old man who left 17 threatening voice mails for Sens.",
    "That move followed allegations that Russian soldiers engaged in war crimes.",
    "There has not been a Senate-confirmed director in place at ATF since 2015.",
    "One can be forgiven for wondering why Biden would go to the Hawkeye state.",
    "The Court takes no joy in this conclusion,? Beattie wrote in his ruling.",
    "The Post's Dan Diamond takes a look at this new Washington power player.",
    "Trump's endorsement of Oz marks his second try in the Pennsylvania race.",
    "There have been other signs of Cheney's relative fundraising prowess.",
    "That compares with about 16 million barrels for all of last year.",
    "The bureau has been without a Senate-confirmed leader since 2015.",
    "A recent McCarthy fundraiser for Hageman netted only $215,000.",
    "Biden is slated to talk economic policy in the Tar Heel State.",
    "But the White House sees a much easier path for confirmation.",
    "Her first-quarter haul marks a new personal record for her.",
    "He started the job with a round of morning TV shows.",
    "But his defenders say he's more than well-equipped.",
    "That kind of money goes a long way in Wyoming.",
    "Got a question about politics?",
    "Return to menu\nCheney (R-Wyo.",
    "Submit it here."
  ]
}