{
  "id": 209,
  "mediaId": 209,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Liz Cheney rakes in cash in fight against Trump-backed challenger",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-continuous-scroll-mobile@1/v1649688489/GettyImages-1346263066.jpg",
  "link": "https://theweek.com/liz-cheney/1012409/liz-cheney-rakes-in-cash-in-fight-against-trump-backed-challenger",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    2524,
    2524,
    1147,
    1147,
    1248,
    1248,
    1609,
    1609,
    1078,
    1078
  ],
  "sentences": [
    "With another \"Trumpy\" Republican candidate Anthony Bouchard still in the Wyoming race, perhaps Hageman and Bouchard will ultimately split the Trump vote, allowing Cheney to \"squeak by with a plurality coalition of traditional Republicans and Democrats who switch parties to vote for her on primary day,\" Politico notes.",
    "But Cheney counts former President George W. Bush, Senate Minority Leader Mitch McConnell (R), Sen. Mitt Romney (R-Utah), and former House Speaker Paul Ryan among her ranks, and her first-quarter fundraising total clocks in at \"more than double what Hageman raised last quarter,\" Politico writes.",
    "As she fends off challenger Harriet Hageman (an attorney who's backed by former President Donald Trump), the Wyoming Republican has actually broken yet another personal fundraising record, having brought in an impressive $2.94 million in the first quarter of 2022, Politico reports Monday.",
    "Hageman herself has plenty of high-profile GOP backing aside from Trump  House Minority Leader Kevin McCarthy, billionaire and activist Peter Thiel, and dozens of House Republicans have pledged their support for the newcomer.",
    "Cheney, who was ousted from House leadership last year after speaking out against Trump and his role in the Jan. 6 Capitol riot, shattered her record from Q4 of 2021, in which she raised $2 million.",
    "With 2022's Q1 total in mind, Cheney's \"total haul\" for the cycle comes to over $10 million; with four months left in her primary campaign, she has $6.8 million at her disposal, per Politico.",
    "The Liz Cheney campaign is holding on quite well, it seems."
  ]
}