{
  "id": 223,
  "mediaId": 43,
  "date": "4/8/2022 12:00:00 AM",
  "headline": "Morning Digest: Tennessee court blocks GOP's new state Senate map for a very unusual reason",
  "image": "https://images.dailykos.com/images/1056931/story_image/Nashville.png?1649373690",
  "link": "https://www.dailykos.com/story/2022/4/8/2090687/-Morning-Digest-Tennessee-court-blocks-GOP-s-new-state-Senate-map-for-a-very-unusual-reason",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    676,
    676,
    1619,
    1619,
    1480,
    1480,
    1878,
    1878,
    1404,
    1404,
    571,
    571,
    428,
    428,
    2813,
    2813,
    2932,
    2932
  ],
  "sentences": [
    "1Q Fundraising\nAZ-Sen: Mark Kelly (D-inc): $11.3 million raised, $23.2 million cash-on-hand\nNC-Sen: Cheri Beasley (D): $3.6 million raised, $5.1 million cash-on-hand\nNH-Sen: Donald Bolduc (R): $100,000 raised\nNV-Sen: Catherine Cortez Masto (D-inc): $4.4 million raised, $11 million cash-on-hand\nWA-Sen: Tiffany Smiley (R): $1.65 million raised, $2.65 million cash-on-hand\nIA-02: Ashley Hinson (R-inc): $950,000 raised, $1.8 million cash-on-hand\nNC-04: Clay Aiken (D): $440,000 raised\nWV-02: David McKinley (R-inc): $466,000 raised, $1 million cash-on-hand\nWY-AL: Harriet Hageman (R): $1.3 million raised, $1 million cash-on-hand\nSenate\n? IA-Sen: Former Rep. Abby Finkenauer is out with a poll from GBAO that gives her a wide 64-15 lead over retired Navy Vice Adm. Mike Franken in the June Democratic primary to take on Republican Sen. Chuck Grassley.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nHow Democrats are fighting to hold the House, with Ali Lapp\nThe Downballot\nFollowShare\n0:0050:44\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? TN Redistricting: A panel of three state court judges has blocked Tennessee's new state Senate map from being used this year for violating the state constitution, though the court allowed new districts for the state House to take effect.",
    "? TX-15: The first poll we've seen of the May 24 Democratic runoff is a Lake Research Partners internal for businesswoman Michelle Vallejo, and it shows her leading Army veteran Ruben Ramirez 39-29.\n? VA-02: Former Rep. Scott Taylor announced on Thursday, which was the day that candidate filing closed in Virginia, that he'd support Republican state Sen. Jen Kiggans' bid to take on Democratic Rep. Elaine Luria rather than run again himself.",
    "Instead, the group referred to a January survey from WPA Intelligence that had Kleefisch up 59-8 to make its case for \"a dramatic 38-point swing towards Nicholson,\" a statement that violates a cardinal rule of polling analysis: Never directly compare polls taken by separate pollsters to find a trendline because every firm uses a different methodology.",
    "? GA-06: Former state ethics commission chair Jake Evans' new spot for the May 24 Republican primary features him standing in front of a jarringly bad green-screen image of the Supreme Court as the narrator proclaims that he's \"the only candidate who took the fight for President Trump to the U.S. Supreme Court, so only legal votes would count.\"",
    "It's not clear why the Republican lawmakers who crafted the new Senate map chose to violate this rule, as it's hard to discern a reason why they'd want an extra district in the Nashville area to go before voters this November (odd numbers are up this year): The 17th is safely red while the 19th and 21st are safely blue.",
    "Mayors\n? Los Angeles, CA Mayor: The Los Angeles Times reports that billionaire developer Rick Caruso has already spent close to $7 million on TV advertising, as well as around $1 million more for digital ads, ahead of June's nonpartisan primary, while none of his many rivals have aired their first TV spots yet.",
    "Covey writes that Defending Main Street, which is a super PAC set up all the way back in 2013 to stop anti-establishment candidates from winning GOP primaries (you can see how that went) has deployed $250,000 on an anti-Mooney buy, though a copy doesn't appear to be online.",
    "The spot, which is almost identical to the one it's currently airing for Illinois Rep. Mary Miller, tells viewers that Hines is Trump's endorsed candidate, believes in term limits, \"will never compromise on election integrity,\" and opposes \"socialist green energy schemes.\"",
    "However, in the map that the Republican-run legislature passed in February, the four districts contained either wholly or partly within populous Davidson Countyhome of the state capital of Nashvilleare numbered the 17th, 19th, 20th, and 21st, so you can see the problem.",
    "Governors\n? HI-Gov: Democratic Rep. Kai Kahele says he's still considering whether to join the open race for governor but did not provide a timeline for when he'd reach his decision, merely telling Civil Beat's Chad Blair that he'd let him know \"if I do decide to run.\"",
    "The memo did not include numbers testing state Rep. Timothy Ramthun, an election denier who entered the race in February; instead it released a matchup that includes businessman Eric Hovde, who has not announced a bid, and showed him in third with 4%.",
    "When Tennessee amended its constitution in 1965 to increase senators' terms from two years to four, the state also staggered the chamber, meaning half of all seats are up for elections every two years, trading between even- and odd-numbered districts.",
    "? NM-02: Physician Darshan Patel announced late last month that he'd turned in enough signatures to advance to the June Democratic primary to take on Republican Rep. Yvette Herrell, and the secretary of state has confirmed that he'll be on the ballot.",
    "Drafters therefore included the consecutive number provision to ensure that large counties would not go four years between Senate elections, and indeed, under the prior map, Davidson's four districts were numbered in order, from 18 to 21.",
    "Several conservative activists tell Allison that they feel Trump made a bad call by backing Hines, whom she describes as a \"Charlotte native who most recently resided two hours away in Winston-Salem,\" thanks to his weak ties to the area.",
    "? Louisville, KY Mayor: Developer Craig Greenberg's first TV ad for the May 17 Democratic primary features his wife, Rachel Greenberg, describing how the candidate survived a murder attempt on Valentine's Day at his campaign office.",
    "In mid-March, Patel lost the state party convention to Las Cruces City Councilor Gabe Vasquez 80.4-19.6, but he argued that his total should be rounded up so he'd have the 20% needed to make the ballot without gathering petitions.",
    "? WV-02: The National Journal's Erin Covey reports that two different outside groups are airing ads supporting Rep. David McKinley ahead of his May 10 Republican primary showdown with his Trump-backed colleague, Rep. Alex Mooney.",
    "Evans was part of a 2020 amicus brief that tried to prevent Pennsylvania from counting mail-in ballots for an additional three days; what his ad doesn't mention, but the Atlanta Journal-Constitution does, is that his side lost.",
    "? PA-Sen: Honor Pennsylvania, which AdImpact says has already spent $9.8 million for rich guy David McCormick ahead of the May 17 GOP primary, is running a new commercial touting him as someone who will \"stand up to Joe Biden.\"",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "One of Caruso's many spots touts him as someone who \"won't defund the police? but will instead ?invest in making L.A. safer with 1,500 new officers,\" while another features a testimonial from former police chief Bill Bratton.",
    "? IA-01: 314 Action, which is supporting Democratic state Rep. Christina Bohannan, has released an internal from Public Policy Polling that shows her trailing Republican Rep. Mariannette Miller-Meeks by a tiny 43-42 margin.",
    "This is the first poll we've seen of the contest for this southwestern Iowa seat, which Trump would have carried 50-48.\n? NC-04: The state AFL-CIO has endorsed state Sen. Valerie Foushee in next month's Democratic primary.",
    "? OK-Sen-B: A new super PAC called Okieway is spending at least $475,000 on an ad campaign starring outgoing Sen. Jim Inhofe urging viewers to back his former chief of staff, Luke Holland, in the June Republican primary.",
    "The spot doesn't actually object to anything in those textbooks but instead uses a brief clip of a history professor the narrator says was a member of the commission explaining, \"The Constitution is soaked in slavery.\"",
    "? NC-13: Politico's Natalie Allison reports that the Club for Growth has launched a $1.2 million ad campaign in support of law student Bo Hines ahead of the May 17 Republican primary for this newly drawn swing seat.",
    "The judges ordered that lawmakers \"remedy the constitutional defect\" in the Senate map by April 21 and extended the candidate filing deadline from April 7 to May 5, though Republicans say they plan to appeal.",
    "? OK-02: Businessman Guy Barker, who is also the secretary-treasurer of the Quapaw Nation, has announced that he's joining the busy June Republican primary for this safely red open seat in eastern Oklahoma.",
    "Evans' other commercial has a different narrator praising him as the one candidate who \"defended our religious liberties against liberals in court, protecting a church's right to its own property.\"",
    "In the same case, plaintiffs had also asked the court to block implementation of the new map for the state House on the grounds that it splits too many counties, but the judges declined to do so.",
    "Sorensen joins a primary that includes Broward County Commissioner Jared Moskowitz, who'd had the field to himself for a month, and commercial airline pilot Curtis Calabrese, a recent entrant.",
    "During the intervening time, however, an unaffiliated group called North Carolina Values Coalition released its own survey from Vitale and Associates that did have Budd ahead by a small 32-29.",
    "The PAC argues that this poll shows the primary has \"has significantly tightened just within the last two months,\" but it didn't release any earlier numbers from Remington to make that case.",
    "The only thing the narrator actually points to Nicholson doing, though, is \"organiz[ing] thousands of Wisconsinites to support our police, get kids back in school, and stop crazy teaching.\"",
    "However, in a footnote, they noted that their ruling is only an \"interim Order that does not bind the Panel\" as it proceeds to a \"full, expedited consideration of this case on the merits.\"",
    "House\n? FL-22: Fort Lauderdale City Commissioner Ben Sorensen announced Wednesday that he would compete in the August primary to succeed his fellow Democrat, retiring Rep. Ted Deutch.",
    "The voiceover continues in histrionic terms, \"His commission mandated textbooks written by radical woke professors pushing critical race theory, teaching our kids to hate America.\"",
    "The U.S. Chamber of Commerce, meanwhile, has launched what NBC says is a $160,000 campaign that praises McKinley for wanting to \"increase oil and gas exploration on federal lands.\"",
    "The senator spends the first third of the spot recounting his career before telling the audience, \"Luke started in our mailroom and quickly rose to be chief of staff.\"",
    "? WI-Gov: Fight for Wisconsin, which supports businessman Kevin Nicholson, has publicized a poll from Remington Research Group that shows him trailing former Lt. Gov.",
    "She adds that Hines' team says he's \"in the process of moving\" to the district and \"intends to update his voter registration in time to vote in the upcoming primary.\"",
    "This isn't, however, an arbitrary or meaningless requirement, as law professor Quinn Yeargain, an expert on state constitutions, explains in a fascinating thread.",
    "Kalloch continues by telling the audience, \"I'm running for Congress to bring a new generation of leadership that puts Oregon first, not the special interests.\"",
    "The AJC also explains that this is a reference \"to a lengthy zoning dispute between an affiliate of the Southern Baptist Convention and the City of Clarkston.\"",
    "? OR-04: Airbnb executive Andrew Kalloch's new ad for the May 17 Democratic primary has him arguing, \"The price of gas, housing, prescription drugs, soaring.",
    "Meanwhile, a Club affiliate called School Freedom Fund is spending at least $1.25 million on an ad campaign that portrays McCrory as a liberal enabler.",
    "Phil Scott has signed Vermont's new legislative maps, which were recently passed by wide bipartisan majorities in the Democratic-run state legislature.",
    "Holland is then shown sitting with Inhofe and asking his former boss, \"We got to conserve the things that are best about America, wouldn't you agree?\"",
    "The narrator proclaims that as governor, McCrory \"put liberals in charge of the state textbook commission, appointing a Democrat [sic] majority.\"",
    "\"As the mayor of Dayton, Nan Whaley put workers first, focusing on manufacturing, attracting investment and jobs with decent wages,\" says Brown.",
    "A party spokesperson said at the time they'd leave the matter up to state election officials, but we never heard whether any decision was made.",
    "At issue is an unusual provision in the state constitution that requires Senate districts in the same county to be numbered consecutively.",
    "? NC-Sen: Rep. Ted Budd's allies at the Club for Growth have dropped a survey from WPA Intelligence that finds him outpacing former Gov.",
    "Blair, though, writes, \"Word on the street is that that announcement will come in early May shortly after the Legislature adjourns.\"",
    "? OH-Gov: Former Dayton Mayor Nan Whaley's new spot for the May 3 primary stars Ohio's most prominent Democrat, Sen. Sherrod Brown.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "That's very different from the 31-25 McCrory lead that Budd's own pollster, Meeting Street Research, found about a month ago.",
    "\"We are lucky that we made it and that everyone in that room was safe and can move forward together,\" Rachel Greenberg says.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Inhofe unsurprisingly does, though he responds in the negative when Holland inquires, \"You think I should pick up flying?\"",
    "Pat McCrory 44-31 in the May 17 Republican primary, which is also well over the 30% Budd would need to avoid a runoff.",
    "Only the 20th, which Joe Biden would have won by a 56-42 margin, is potentially swingy, but it won't be up until 2024.",
    "Fight for Wisconsin also says this new survey was conducted following a \"nearly $1 million ad buy\" for Nicholson.",
    "Inhofe concludes by imploring the audience, \"This last time, I'd sure appreciate your vote  for Luke Holland.\"",
    "However, not everyone in this suburban Raleigh district is as enamored with Hines as the Club and Trump.",
    "Given the GOP's intent to appeal the ruling, though, there's likely some motivation behind the decision.",
    "\"Nan led her city through crisis after crisis, bringing people together, never dividing them.\"",
    "On the Democratic side, state Sen. Wiley Nickel has earned the backing of the state AFL-CIO.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Tony Evers and Kleefisch just talk and do nothing, Nicholson is a man of action.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "\"Many people that are struck by violence don't have that luxury.",
    "Rebecca Kleefisch 42-29 in the August GOP primary.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "In theory, a remedy ought to be extremely simple.",
    "Redistricting\n? VT Redistricting: Republican Gov.",
    "Hawaii's filing deadline is two months away.",
    "The old way of doing things isn't working.\"",
    "That ad argues that, while Democratic Gov.",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Craig understands that.\"",
    "Daily Kos is different.",
    "Please read it."
  ]
}