{
  "id": 255,
  "mediaId": 237,
  "date": "3/30/2022 12:00:00 AM",
  "headline": "Liz Cheney primary opponent fundraiser draws scores of GOP House incumbents",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/983119_sd_1648657779.jpg",
  "link": "https://www.washingtonexaminer.com/news/campaigns/liz-cheney-primary-opponent-fundraiser-draws-scores-of-gop-house-incumbents",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Juliegrace Brufke",
  "authorUrl": "https://www.washingtonexaminer.com/author/juliegrace-brufke",
  "termIds": [
    1147,
    945,
    945,
    1609,
    1609,
    2121,
    2121,
    1147,
    1248,
    1248,
    562,
    562,
    422,
    422,
    146,
    146,
    428,
    428,
    2976,
    2976
  ],
  "sentences": [
    "Dozens of House Republicans are expected to attend House Minority Leader Kevin McCarthy's fundraiser for Rep. Liz Cheney's Wyoming GOP primary opponent, Harriet Hageman, on Wednesday evening in an increasingly bitter contest over fealty by party members to former President Donald Trump.",
    "According to the most recent campaign finance reports, Cheney held a cash advantage over her opponent, bringing in $2 million in the final three months of 2021 and having brought in $7.2 million last year in contrast to Hageman's $745,000 in the fourth quarter.",
    "3 spot in leadership by the conference last year, with critics alleging her rebuke of the former president and the rhetoric on his involvement in the Jan. 6 riot did not align with the majority of the conference.",
    "Liz would like to thank Kevin McCarthy for anointing one of her opponents as the DC insider/establishment candidate in the race,? a Cheney spokesperson said in a statement.",
    "They include House Administration Committee ranking member Reps. Rodney Davis of Illinois and House Appropriations Committee ranking member Kay Granger of Texas.",
    "Those shown on the invitation include Republican Conference Secretary Rich Hudson of North Carolina, Republican Policy Chairman Gary Palmer of Alabama, and Rep.",
    "Listed hosts for the Washington, D.C., fundraiser, an invitation of which was obtained by the Washington Examiner, involve multiple members of GOP leadership.",
    "A senior GOP source noted that 90% of the members listed on the event's invitation voted to object to Electoral College certification, while 10% did not.",
    "Tensions rose after Cheney joined the Democratic-led select committee tasked with investigating the Jan. 6 attack on the Capitol against his wishes.",
    "McCarthy announced his endorsement of Hageman, the state's former national GOP committeewoman who is backed by Trump, in February.",
    "Other fundraising hosts include several Republican lawmakers who have not previously come out against Cheney in the past.",
    "Despite coming under fire from members of her party, the Wyoming Republican has stood by her position.",
    "McCarthy and Cheney have had a contentious relationship due to her criticisms of Trump.",
    "Cheney last year lost her leadership position to GOP Rep. Elise Stefanik of New York.",
    "Cheney, the daughter of former Vice President Dick Cheney, was ousted from her No.",
    "The fundraiser is being hosted at McCarthy adviser Jeff Miller's home.",
    "Guy Reschenthaler of Pennsylvania."
  ]
}