{
  "id": 311,
  "mediaId": 129,
  "date": "3/21/2022 12:00:00 AM",
  "headline": "It's Never a Good Time for the Hunter Biden Story",
  "image": "https://static01.nyt.com/images/2022/03/21/opinion/21conversation_02/21conversation_02-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/03/21/opinion/ukraine-hunter-biden-time.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2475,
    2475,
    2435,
    2435,
    2351,
    2351,
    2087,
    2095,
    2095,
    2030,
    2030,
    2087,
    1921,
    1921,
    1647,
    1647,
    1813,
    1813,
    1464,
    1464,
    1501,
    1501,
    1147,
    1147,
    1248,
    1248,
    1284,
    1284,
    693,
    693,
    571,
    571,
    562,
    562,
    403,
    403,
    428,
    428,
    2550,
    2550,
    2590,
    2590,
    2976,
    2976,
    2910,
    2910
  ],
  "sentences": [
    "If someone had discovered that, say, Ivanka Trump had left a laptop at a repair shop stuffed with emails about 10 percent being held for the big guy? to use a reference that appears to be to Joe Biden, which comes from one of the emails found on Hunter's computer  would the story have been treated with kid gloves?",
    "The news here has less to do with Hunter himself and more with the fact that those emails recovered from the discarded laptop were his, despite the best efforts by Twitter and other social media and news media companies to bury or not look closely enough at that fact on the eve of the 2020 election.",
    "Bret: On the other hand, it's in Putin's interest to make us think he's capable of anything: It's his version of Richard Nixon's madman theory? of international relations, in which a leader cultivates the appearance of being capable of anything in order to terrify his adversary into backing down.",
    "It goes back to William F. Buckley Jr.'s famous line that he'd rather be governed by the first 2,000 people in the telephone directory than by the Harvard University faculty.?\nGail: Do you happen to know what William F. Buckley Jr.'s position on daylight saving time was?",
    "Gail: Well, if Wyoming Republicans can reward Cheney for her independence, I promise to stop complaining that a state with a population of less than 600,000 has the same number of Senators as California, which has nearly 40 million.",
    "Any new evidence needs to be carefully examined to see if Hunter's behavior ever went past that into actual criminality  did he claim, for instance, that he could deliver favors from the government because he was Joe Biden's son?",
    "The biggest problem, as I remember, wasn't lawmakers trying to get some special bridge overpass for their district; it was lawmakers trying to get a contract for some big, unnecessary project that would go to one of their donors.",
    "Fragile son in a family buffeted by tragedy, grows up to have a drug problem and makes a lot of money by working for companies that presumably like to have a famous American politician's relative to trot around.",
    "Gail: Ukraine's troops seem to be doing way better than people expected, and even if average Russian citizens aren't allowed to know about that, they can't help noticing that their economy is cratering.",
    "Gail: And you know, if the first 2,000 people in the telephone directory did take control, polls suggest we'd very likely be right in line for Medicare for all and universal early childhood education.",
    "The best thing Biden can do is continue to provide our Ukrainian friends with all the means we can offer so they can defend themselves by themselves, without us getting into combat directly.",
    "And Russia's battlefield incompetence, along with its mounting losses, is probably tempting Putin to use chemical weapons or even a tactical nuclear weapon to win a war his generals can't.",
    "On a gloomier subject, Joe Biden has now called Vladimir Putin a war criminal,? a murderous dictator? and a pure thug.? Hard to disagree with the characterizations, but is it prudent?",
    "Gail: I'm so glad our colleagues are still doing strong reporting on this story  Hunter Biden's scummy business dealings shouldn't be swept under the rug any more than anyone else's.",
    "Your mentioning her does remind me that it's never been clear to me exactly how much, if any, of the campaign donations Trump's been piling up are going to his kids' activities.",
    "I understand why Biden is reluctant to impose a no-fly zone, but I don't get why he won't supply the Ukrainian air force with fighter jets or any other equipment they ask for.",
    "Despite allegations of violent behavior toward his ex-wife and his recent demand to know why there are still apes if evolution works the way scientists say it does.",
    "It reminds me of Ronald Reagan calling the Soviet Union the evil empire,? which liberals once considered provocative but had the benefit of being absolutely true.",
    "But what really bothered me was the not-so-subtle media effort to bury the email story right before the election as some kind of Russian disinformation? campaign.",
    "Bret: People often forget that Cheney actually supported Trump in the 2016 election, only to become a convinced anti-Trumper after she saw the guy in action.",
    "There's a big Republican fight coming up this spring in Georgia, where Donald Trump and his folks are trying to nominate Herschel Walker for a Senate race.",
    "Not trying to downplay the Hunter story, but in the grand scheme of things I still think his misdeeds are going to wind up as a sidebar on the Biden saga.",
    "A party with a cult-of-personality problem is like a person with a substance abuse problem, meaning they're going to ride the addiction to rock bottom.",
    "Cheney has a big campaign war chest and she could still pull off a win, at least if Wyoming Democrats switch parties to vote for her in the primary.",
    "Her main challenger in this race, Harriet Hageman, went in the opposite direction: from fervent Never Trumper in 2016 to a fervent Trumper today.",
    "The world needs another White House corruption scandal like I need a hole in my head, to borrow a line from one of the better songs of the 1990s.",
    "Modern-day liberals are often quite happy to defer to the wisdom of experts, at least when it comes to subjects like public health or economics.",
    "Bret: Given that daylight savings was initially signed into law by Woodrow Wilson, I'd have to assume Buckley would have been against it.",
    "By the way: Did you read The Times's account of the government's investigation into Hunter Biden's tax and foreign-business affairs?",
    "Gail Collins: Bret, here's one question I don't think I ever asked you before: What do you think of daylight saving time?",
    "I was sorta impressed the other day when the Senate voted unanimously to make daylight saving time permanent, year-round.",
    "I'm just terrified Putin will feel cornered and drop a nuclear bomb or do something else that's planet-destructive.",
    "It's no right-wing hit job, which makes its description of Hunter's business dealings that much more damning.",
    "Bret: Not to mention those paintings he tried to sell for up to $500,000 a canvas in nontransparent sales.",
    "Gail: That said, I have to admit I've never found Hunter's behavior criminal  just very, very depressing.",
    "And then there's a primary this summer in Wyoming, where Liz Cheney is fighting to keep her House seat .",
    "Bret: If Russian forces are capable of firing on a nuclear power station, they're capable of worse.",
    "So far I haven't seen it, but whenever Hunter's name comes up, I do find myself holding my breath.",
    "It brings projects to constituents who need them and makes politics a whole lot more fun to cover.",
    "Gail: Meanwhile, on the domestic front, have you been keeping an eye on the primary elections?",
    "Bret: Isn't that because people love liberal policy ideas until you show them the price tag?",
    "Gail: Well, in the grand scheme of things I'd say Biden could have been more  restrained.",
    "Gail: Makes me sorta sad remembering John McCain's long, long battle to get rid of them.",
    "Bret: The book to read on this subject is The Bidens,? by Politico's Ben Schreckinger.",
    "We prefer the wisdom of crowds, or markets, to the wisdom of the purportedly wise.",
    "But many sleep scientists seem to think standard time  winter time  is healthier.",
    "Gail: Your ability to have everything remind you of foreign affairs is awesome.",
    "Now we're stunned that the Senate can come together on daylight saving time.",
    "Gail: On another subject entirely  have you noticed that earmarks are back?",
    "The Times is committed to publishing a diversity of letters to the editor.",
    "Feel free to remind me I said that if half the family winds up indicted.",
    "Gail: Some of Hunter's behavior was obviously unseemly in the extreme.",
    "I don't think pork is such a bad thing in the grand scheme of things.",
    "Bret: This is a major difference between liberals and conservatives.",
    "We'd like to hear what you think about this or any of our articles.",
    "Bret Stephens: About the same way I feel about Volodymyr Zelensky.",
    "Whereas those of us who are conservative tend to be  skeptical.",
    "Bret: The scary thing is that you're being completely rational.",
    "Gail: Truly scary if I'm being rational on foreign affairs.",
    "Guess things are just darker now than in the olden days.",
    "Bret: I feel just the same way about Vermont and Texas.",
    "What's the last thing they agreed about that easily?",
    "But about Cheney's chances, I wouldn't bet on them.",
    "Gail: I think switching back and forth is stupid.",
    "So I'll go with them, just to be difficult.",
    "Gail: Well, Ivanka is a much tidier person.",
    "Bret: The D.O.J.'s investigation will tell.",
    "And here's our email: letters@nytimes.com.",
    "Bret: Don Young dies but pork is forever.",
    "Gail: Yep, that's my nightmare.",
    "Nothing at all fishy there.",
    "Bret: Invading Afghanistan?",
    "Bret: I'm happy he said it.",
    "Bret: I honestly hope not.",
    "The light of the West.",
    "So what happens next?",
    "Am I being paranoid?",
    "Here are some tips.",
    "What do you think?"
  ]
}