{
  "id": 3131,
  "mediaId": 238,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Post Politics Now Senate Democrats tee up a doomed vote to write abortion protections into law",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/09/democrats-abortion-biden-internet-ukraine/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3053,
    1341,
    2087,
    1711,
    482,
    141,
    571,
    2945
  ],
  "sentences": [
    "At this pivotal moment, the stakes for women  and every American  could not be higher.?\nEugene Scott: GOP lawmaker reaffirms belief in exceptions on abortion  Rep. Ashley Hinson (R-Iowa) on Monday reiterated her support for exceptions to a ban on abortions for rape, incest or risk to the mother's life, putting her at odds with Republicans in dozens of states.I have supported a heartbeat bill here in Iowa that had exceptions for those very things,? Hinson told The Post's Marianna Sotomayor on Monday on Washington Post Live in response to a question about exceptions.At the same time, however, she declined to challenge GOP-led state legislatures and governors who have signed bills with no exceptions for rape or incest.I think ultimately our states are prepared to make those decisions and obviously, every state is going to have a different outcome in terms of whatever that policy could be,? she added.",
    "On Tuesday, Biden will talk about his plan to fight inflation  one of the key political issues dragging down his approval numbers  before holding a bilateral meeting with Prime Minister Mario Draghi of Italy.Then, on Wednesday, Biden travels to Chicago, first stopping at a family farm to discuss the Ukraine war's impact on the rising cost of food and other prices  part what he has tried to dub Putin's Price Hike?  before addressing the International Brotherhood of Electrical Workers' convention, followed by the aforementioned fundraiser.The president will be back in Washington on Thursday and Friday for a two-day U.S.-ASEAN Special Summit.",
    "With the midterms looming, Republicans are inundating the state's airwaves with images of burning buildings, boarded-up stores and chanting protesters, as both parties compete to convince voters they can keep them safe.That's not too different from years past, but this election season, crime is part of a multifaceted Republican message that the country has fallen into chaos under Democratic control, from soaring prices to out-of-control schools to surging immigration.Crime is a page in the playbook  it's not a playbook by itself,? said one Republican strategist, who spoke on the condition of anonymity to discuss GOP persuasion tactics.",
    "He told reporters last week he was looking at everything? when asked if he'd support the modified measure this week.The doomed vote underscores the limited options for Democrats to protect access to abortion, igniting a political firestorm around one of America's most divisive issues ahead of the November midterms.Ultimately, I think this is going to push a lot of people to the polls this November, that may have otherwise stayed home,? Sen. Chris Murphy (D-Conn.) said on Fox News Sunday.The vote will also reopen the long-simmering debate to end the filibuster.",
    "While we have seen and heard extraordinary anguish in our communities, we have been moved by how so many have channeled their righteous anger into meaningful action: planning to march and mobilize to make their voices heard.?\nIn the letter, Pelosi warned of dire consequences if the Supreme Court adopts the leaked draft opinion and overturns Roe v. Wade, citing efforts already underway at the state level to impose restrictions on abortion or ban it altogether.",
    "Jacqueline Alemany: The week ahead on the Hill  Both chambers of Congress are in session this week with all eyes on a Wednesday vote in the Senate on a bill that would codify abortion rights after the leak of a Supreme Court draft majority opinion overturning Roe v. Wade.The vote on the Women's Health Protection Act is all but destined to fail without the 60 senators needed to vote yes? to overcome a filibuster.",
    "Return to menu\nAshley Parker: The week ahead at the White House  President Biden has a busy mishmash of a schedule this week, including two fundraisers for the Democratic National Committee (one Monday night in Potomac, Md., and one Wednesday night in Chicago).He begins his week Monday with remarks on lowering the cost of high-speed Internet and signing a bill providing more assistance to Ukraine.",
    "Manchin and Sen. Kyrsten Sinema (D-Ariz.) have continued to support keeping it in place amid calls for abortion protections.Meanwhile, on the House side, there's a vote expected on Rep. Andy Levin's (D-Mich.) resolution to allow House staff to unionize after House Speaker Nancy Pelosi (D-Calif.) announced last week a $45,000 minimum annual salary for House staff to improve retention.",
    "Return to menu\nSen. Maggie Hassan (D-N.H.), considered among the more vulnerable Senate Democrats on the ballot this year, has seized on comments by Senate Minority Leader Mitch McConnell (R-Ky.) that a national ban on abortion could be possible if Roe v. Wade is overturned by the Supreme Court and Republicans take over Congress.",
    "Return to menu\nBiden, appearing in the Rose Garden of the White House, recognized representatives of several major Internet providers, including AT&T, Comcast and Verizon, who have agreed to provide high-speed service at a steep discount to low-income consumers, significantly expanding broadband access for millions of Americans.",
    "Writing in The Early 202, The Post's Theodoric Meyer and Leigh Ann Caldwell report that 18 state Democratic parties declared they wanted to be one of the first states in the country to vote (or, in Iowa's case, to caucus) in the 2024 primaries by the Friday deadline set by the Democratic National Committee.",
    "We need to wait for the Supreme Court to make their decision and then our state legislators will do their job, which is how our Founding Fathers intended.?More than 10 states have passed laws that ban abortion without any such exception including Missouri, which borders Hinson's Iowa.",
    "Judges perform an incredibly important function in our society, and they must be able to do their jobs without concern for their personal safety.?\nWhen emergency responders arrived at the Wisconsin Family Action's office early Sunday, flames engulfed part of the building, police said.",
    "Tony] Evers, our way of life has been falling apart.?The attack has left Democrats, nationally and in Wisconsin, divided over how much to emphasize their own police-friendly credentials and how much to stick to the racial justice movement that erupted anew in 2020.",
    "Return to menu\nFormer president Donald Trump's political operation formed a joint fundraising committee Monday with the Republican challenger seeking to oust Rep. Liz Cheney in Wyoming's August primary, according to a filing with the Federal Election Commission.",
    "Later, he will sign legislation aimed at speeding up the deployment of military equipment to Ukraine before heading to Potomac, Md., for a fundraiser to benefit the Democratic National Committee as the party braces for a challenging election season.",
    "Today, Senate Majority Leader Charles E. Schumer (D-N.Y.) plans to take a key step to tee up a vote this week on writing abortion protections into federal law as the Supreme Court appears to poised to overturn its landmark Roe v. Wade decision.",
    "Return to menu\nThe White House weighed in Monday following protests over the weekend outside the homes of Supreme Court justices John G. Roberts Jr. and Brett M. Kavanaugh, cautioning demonstrators not to engage in violence or issue threats.",
    "Cleve R. Wootson Jr.: GOP focuses on public safety in Wisconsin ahead of midterms  In Wisconsin, a swing state that has been scarred by both police violence and crimes that have made national headlines, public safety is again on the ballot.",
    "In a new digital ad, Hassan tries to tie three of her potential Republican opponents to McConnell in the latest example of how Democrats are trying to use the reinvigorated abortion debate to their advantage in the upcoming midterms.",
    "The Post's Isaac Stanley-Becker reports that the challenger, Harriet Hageman, has posted feeble fundraising figures, raising about $2 million so far this cycle, compared to the $10 million Cheney has brought into her main committee.",
    "Return to menu\nTwenty Internet providers, including Comast, Verizon and AT&T, have agreed to increase speeds or cut prices to help tens of millions of unconnected households afford service, the White House announced Monday morning.",
    "Cheney, a three-term incumbent, has become one of the GOP's leading Trump critics, voting to impeach him after the Jan. 6 assault on the Capitol and serving on the congressional committee investigating the pro-Trump insurrection.",
    "Return to menu\nSenate Minority Leader Mitch McConnell (R-Ky.) acknowledged in an interview with USA Today that it's possible? there could be legislation imposing a national ban on abortion if Republicans take control of Congress.",
    "During an interview with USA Today, McConnell acknowledged the possibility of a national ban but said it would depend on where the votes were.? He also indicated he has no interest in changing the Senate's filibuster rule.",
    "The effort by Democrats seems destined to fail but will ensure that the issue remains front and center again following the leak of a draft court decision that has scrambled the politics of the upcoming midterm elections.",
    "They write:\nThe deadline kicks off a months-long process that could dethrone the Iowa caucuses or New Hampshire primary  or both states' contests  from their traditional spots at the front of the pack.",
    "Return to menu\nWhite House domestic policy adviser Susan Rice has tested positive for the coronavirus, becoming the latest member of Biden's circle to be infected with the virus in recent weeks.",
    "Return to menu\nOn the same day that Russia throws a huge Victory Day parade in Moscow, Biden is slated to sign into law a bill that would expedite the process of sending military aid to Ukraine.",
    "These draconian measures could even criminalize contraceptive care, in vitro fertilization and post-miscarriage care, dragging our nation back to a dark time decades into the past,? she said.",
    "Our proud pro-choice House Majority must continue this fight in the public arena so that the American people know that their rights are on the ballot this November,? Pelosi said in a letter.",
    "Return to menu\nHouse Speaker Nancy Pelosi (D-Calif.) on Monday issued a call to action to her Democratic colleagues to mobilize voters to elect more lawmakers supportive of abortion rights.",
    "According to the White House, the commitments of the 20 Internet providers will allow eligible households to obtain high-quality plans for no more than $30 a month  and in some cases, free.",
    "Return to menu\nFor Democrats, the presidential nominating calendar could look far different in 2024 as the party considers ditching the storied tradition of beginning the process in Iowa.",
    "The demonstrations Saturday night in the Washington area are among the latest in response to the leaked draft opinion that suggests the court is on the verge of overturning Roe v. Wade.",
    "And if we were a betting woman  which we are, very occasionally, when we're feeling fine about losing some money  we would guess that Biden heads to Wilmington, Del., for the weekend.",
    "The Post's Amy B Wang reports that the signing ceremony, scheduled for 2:45 p.m. Eastern, comes as Ukraine presses into its third month of trying to fight off the Russian invasion.",
    "The discounts plus existing federal Internet subsidies mean the government will cover the full cost of connectivity if consumers sign on with one of the 20 participating companies.",
    "With the midterms looming, Biden has repeatedly highlighted provisions of the law, with the aim of making a case that Democrats can get things done while in charge in Washington.",
    "The decision to rethink the primaries comes two years after the Iowa Democratic Party bungled the caucuses by relying on a faulty app that caused results to be delayed for days.",
    "It's unclear whether all 50 Democratic senators will even support the measure after Sen. Joe Manchin III (W.Va.) voted against the previous legislation in February.",
    "And it follows years of complaints that two of the Whitest states in the country play an outsize role in choosing the nominee of an increasingly diverse party.",
    "The gathering was the first public event at which Biden and Vice President Harris appeared together since she tested positive for the coronavirus April 26.",
    "The argument in Wisconsin is that the status quo isn't going so well, but it's got to be part of a broader argument that, under Biden and [Democratic Gov.",
    "The plan, a feature of the $1 trillion infrastructure package passed by Congress last year, would cost qualifying households no more than $30 per month.",
    "Make no mistake: once Republicans have dispensed with precedent and privacy in overturning Roe, they will take aim at additional basic human rights.",
    "Only a few weeks before, the Senate had passed it unanimously, a rare and overwhelming show of bipartisanship in today's bitterly divided Congress.",
    "In a tweet, Rice said she tested positive Monday morning and that she hasn't seen the president in person since Wednesday, when she was masked.",
    "Rice said that, under guidance from the Centers of Disease Control and Prevention, she is not considered a close contact of the president.",
    "McConnell said that it would depend on where the votes were? and that he is not interested in abolishing the filibuster to make it happen.",
    "That posture, which made her a target of the former president's ire, cost her a leadership position in the House Republican Conference.",
    "The Post's Philip Bump takes a look at that question and concludes that it's within the realm of possibility after the 2024 elections.",
    "The commitments will help make good on a program that was created by the bipartisan infrastructure law that Biden signed last year.",
    "It's also possible that the country could elect a Republican president in 2024 who would sign a bill banning abortions nationally.",
    "A spray-painted message said, If abortions aren't safe then you aren't either,? the organization's president said in a statement.",
    "Speaking from Red Square on Monday, President Vladimir Putin Putin cast Russia's battles in Ukraine now as a comparable effort.",
    "Trump has raised enormous sums since leaving office at the beginning of last year, entering 2022 with $122 million in the bank.",
    "Biden strongly believes in the Constitutional right to protest,? White House press secretary Jen Psaki said in a tweet.",
    "President Biden is expected to tout the effort during an event Monday afternoon in the Rose Garden at the White House.",
    "The joint fundraising committee benefits Hageman's main campaign committee and Trump's leadership PAC, Save America.",
    "The service is being offered through the Affordable Connectivity Program, which was part of the infrastructure law.",
    "Last week, Secretary of State Antony Blinken tested positive; the week before that, Vice President Harris did.",
    "Like Rice, neither were considered a close contact? of the president at the time of their positive results.",
    "The White House said 48 million households could qualify for the program based on income or other criteria.",
    "That would mean legislation imposing a national ban would need 60 votes to move forward in the chamber.",
    "The White House estimates the program will cover 48 million households, or 40 percent of the country.",
    "The House passed the Ukraine Democracy Defense Lend-Lease Act of 2022 last month on a 417-to-10 vote.",
    "Meanwhile, President Biden held an event to promote an effort to expand affordable Internet access.",
    "It can collect contributions, pay fundraising expenses and distribute proceeds to both committees.",
    "Multiple members of Biden's close orbit have tested positive over the past month.",
    "There is no place in the world for executioners, punishers and Nazis,? he said.",
    "Victory Day in Russia commemorates the defeat of Nazi Germany in World War II.",
    "So how likely is it that the GOP could gain enough seats to make it happen?",
    "That means it would take 60 votes in the Senate to advance such a bill.",
    "The chamber is now evenly divided among Democrats and Republicans.",
    "A day earlier, he said Russia was fighting Nazi filth? in Ukraine.",
    "But that should never include violence, threats, or vandalism.",
    "I don't think now is the time to engage in hypotheticals."
  ]
}