{
  "id": 320,
  "mediaId": 25,
  "date": "3/18/2022 12:00:00 AM",
  "headline": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/03/18/aed53ff6-5702-47e5-950d-49f35c289f43/thumbnail/140x90/ac3210a35e70b4b855a031aa4cd0638a/gettyimages-1384330502.jpg",
  "link": "https://www.cbsnews.com/news/ukraine-russia-zelensky-madison-cawthorn-kevin-mccarthy/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Kaplan",
  "authorUrl": "",
  "termIds": [
    2303,
    2303,
    1501,
    1501,
    1609,
    1609,
    428,
    428,
    2553,
    2553,
    2672,
    2771,
    2771,
    2672,
    2834,
    2834,
    2942,
    2942
  ],
  "sentences": [
    "The North Carolina Republican has come under fire in recent days, after reports  and then a video  emerged in which he told supporters in Asheville, North Carolina, \"Zelenskyy is a thug,\" and \"Remember that the Ukrainian government is incredibly corrupt, and it is incredibly evil, and it has been pushing woke ideologies.\"",
    "The only lawmaker who has faced lingering consequences is Wyoming Republican Rep. Liz Cheney, who was removed from her leadership position in the House Republican conference after repeatedly criticizing former President Trump for his role in the January 6 riot.",
    "His view in the minority  the Ukrainian president is widely admired around the world and in Congress as an inspiring leader who has united his people and much of the international community against a withering and unprovoked assault by Russia.",
    "2022 Midterm Elections\n More\n McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy\n House Democrats raised $19.3 million in February, a committee record\n Trump's EPA chief Scott Pruitt weighing Senate run in Oklahoma\n New Hampshire Gov.",
    "Sununu to veto congressional map passed by own party\n Romney warns of \"extraordinary challenge\" to preserve U.S. democracy\n More\nIn:\nUnited States Congress\nVolodymyr Zelenskyy\n Rebecca Kaplan\nRebecca Kaplan covers Congress for CBS News.",
    "House Republican Leader Kevin McCarthy said GOP Rep. Madison Cawthorn, of North Carolina, was \"wrong\" to call Ukrainian President Volodymyr Zelenskyy a \"thug\"  but says he will still be supporting Cawthorn's reelection bid.",
    "Cawthorn's comments, which came to light as Congress has moved swiftly to punish Russia for its invasion of Ukraine, are the latest example of McCarthy's struggle to manage a fractious conference.",
    "Last month, Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona appeared before the America First Political Action Conference, which is organized by white nationalist Nick Fuentes.",
    "Cawthorn's comments are reportedly being played repeatedly on Russian state TV, according to NBC News reporter Raf Sanchez.",
    "McCarthy has also endorsed Wyoming trial attorney Harriet Hageman, who is challenging Cheney in her primary election.",
    "When Zelenskyy addressed Congress earlier this week, he received a standing ovation from lawmakers of both parties.",
    "But the GOP leader, asked by a reporter whether he would support Cawthorn's House reelection bid, replied \"yes.\"",
    "Greene has also faced condemnation for several comments comparing COVID-19 mandates to the Holocaust.",
    "McCarthy often handles these issues with private conversations with his members.",
    "Asked about Cawthorn's comments Friday, McCarthy responded, \"Madison is wrong.",
    "If there's any thug in this world, it's Putin.\"",
    "Twitter"
  ]
}