{
  "id": 3372,
  "mediaId": 188,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Republican Rep. Liz Cheney claims that 'The House GOP leadership has enabled white nationalism, white supremacy, and anti-semitism'",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTgxMTU5NC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY4NTIzMTcwM30.2fZh53KBaM86Pu63Wu31xmUksO_oeUHXnAVZ1-FGd5k/img.jpg?width=1245&quality=85&coordinates=0%2C4%2C0%2C103&height=700",
  "link": "https://www.theblaze.com/news/liz-cheney-house-republican-racism",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Nitzberg",
  "authorUrl": "https://www.theblaze.com/u/alexnitzberg",
  "termIds": [
    1095,
    1098,
    1147,
    1248,
    3085,
    3094,
    427,
    428,
    562
  ],
  "sentences": [
    "You can draw a direct line from the dangerous rhetoric and incitement of trump and gop leaders and the violence of rampaging neo-nazis, militia maniacs, Capitol insurrectionists and other rightwing domestic terrorists.https://twitter.com/liz_cheney/status/1526159124840558592\\u00a0\\u2026\n Bill Pascrell, Jr. \\ud83c\\uddfa\\ud83c\\uddf8\\ud83c\\uddfa\\ud83c\\udde6 (@Bill Pascrell, Jr. \\ud83c\\uddfa\\ud83c\\uddf8\\ud83c\\uddfa\\ud83c\\udde6) 1652710349\nCheney's tweet came after a white 18-year-old man perpetrated a shooting on Saturday at a supermarket in Buffalo, New York.",
    "\"Any implication or attempt to blame the heinous shooting in Buffalo on the Congresswoman is a new disgusting low for the Left, their Never Trump allies, and the sycophant stenographers in the media,\" deGrasse said in the statement.",
    "\"You can draw a direct line from the dangerous rhetoric and incitement of trump and gop leaders and the violence of rampaging neo-nazis, militia maniacs, Capitol insurrectionists and other rightwing domestic terrorists.\"",
    "The congresswoman, who has served in the House since 2017, is seeking re-election, but Trump has endorsed challenger Harriet Hageman who is vying to defeat Cheney in the GOP primary.",
    "The attack left 10 people dead, all of whom were black  three others people were wounded, including two white people and one black person, according to the Associated Press.",
    "Cheney and GOP Rep. Adam Kinzinger of Illinois are the only two Republicans serving on the House select committee tasked with investigating the Jan. 6 episode.",
    "The congresswoman was one of the 10 House Republicans to vote in favor of impeaching then-President Donald Trump in the wake of the Jan. 6, 2021 Capitol riot.",
    "\"Despite sickening and false reporting, Congresswoman Stefanik has never advocated for any racist position or made a racist statement.\"",
    "In a statement, Stefanik senior adviser Alex deGrasse has rejected the idea that Stefanik ever promoted racism.",
    "In May, 2021, the outspoken Trump critic was was ousted from her role as House Republican conference chair.",
    "And MAGA Republican @EliseStefanik ran ads promoting the vile, racist and anti-Semitic replacement theory.\"",
    "Cheney is the daughter of former Vice President Dick Cheney, who served alongside President George W. Bush.",
    "In response to Cheney's post, former Republican National Committee chair Michael Steele tweeted, \"Word.\"",
    "\"Because @GOPLeader refuses to condemn white replacement theory, which radicalized Buffalo murderer.",
    "GOP Rep. Liz Cheney of Wyoming on Monday accused House Republican leadership of enabling racism.",
    "\"The House GOP leadership has enabled white nationalism, white supremacy, and anti-semitism.",
    "@GOP leaders must renounce and reject these views and those who hold them,\" Cheney tweeted.",
    "\"My colleague has it right,\" Democratic Rep. Bill Pascrell Jr. of New Jersey tweeted.",
    "The individual has been arraigned on a murder charge, but has pleaded not guilty.",
    "Rep. Elise Stefanik of New York was later selected to fill the slot.",
    "History has taught us that what begins with words ends in far worse.",
    "\"She's right, you know... \" leftist MSNBC host Joy Reid tweeted.",
    "Last year, Cheney was kicked out of a House leadership role.",
    "Democratic Rep. Ted Lieu of California tweeted.",
    "\"How do we know Liz Cheney is correct?\"",
    "My colleague has it right."
  ]
}