{
  "id": 343,
  "mediaId": 151,
  "date": "3/14/2022 12:00:00 AM",
  "headline": "Liz Cheney turns to Democrats to save her hide",
  "image": "https://static.politico.com/3b/5c/a6af6b974f2d8c017dfd74055b40/https-delivery.gettyimages.com/downloads/1358870625",
  "link": "https://www.politico.com/news/2022/03/14/liz-cheney-democrats-wyoming-00016905",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2372,
    2372,
    2448,
    2448,
    945,
    947,
    947,
    945,
    2087,
    2087,
    1753,
    1753,
    1147,
    1147,
    1248,
    1248,
    428,
    428,
    146,
    146
  ],
  "sentences": [
    "She was absolutely invited to come and present what her facts were, to defend why you are doing this and instead she opted to call the Republicans radicals, which has made people upset within the party,? Martin said from the Jackson mansion of Nancy Donovan, a prominent Republican donor in Wyoming.",
    " It's something that's been an issue in our state for many years, it's not just 2020.?\nA progressive organizer who helped get the Democratic vote out for Gordon in 2018 crunched the numbers based on a hypothetical three-way race between Hageman, Cheney and Republican state Sen. Anthony Bouchard.",
    "I was here when the  Democrats dragged her father's effigy down a village road behind a truck at one of their rallies, and those are the people who are supporting her now, that she's embraced,? an angry Rebecca Cloetta, 66, said over breakfast at a greasy spoon called the Virginian.",
    "But she told The New York Times last month that she will not openly court Democrats by supporting a Democrats for Cheney? group or encourage an existing political action committee, dubbed Switch for Wyoming,? that encourages Democrats to vote in Republican primaries.",
    "Though there's been scant public polling of her primary campaign against Trump-backed Harriet Hageman, it's apparent that Republicans in Wyoming  which voted for Trump over Joe Biden, 70 to 27 percent, in 2020  have turned against Cheney en masse since Jan. 6, 2021.",
    "That theory isn't lost on House Minority Leader Kevin McCarthy, who has told members that he's worried that the numbers add up for Cheney and that she might be back in Congress next session, according to a source with direct knowledge of the discussions.",
    " In 2007, in this blue bastion of one of the reddest states in the country, liberal activists wheeled a giant statue of Dick Cheney through town to protest his star role in the Iraq War  before toppling it, Saddam Hussein style, for good measure.",
    "Pete Jenkins, 54, a contractor who's lived in Wyoming for three decades, said he identifies personally as a Democrat  he did not vote for Trump in 2016 or 2020  but is registered as a Republican just to have some influence in Wyoming politics.",
    "The turnabout for Cheney  one of the more unlikely twists in Republican politics in recent years, in a party that's had no shortage of them  will come into sharp relief next week at a gathering at Jackson's Center for the Arts.",
    "Cheney will speak on a bipartisan panel about defending elections, addressing what should be a welcoming audience amid her running battle with former President Donald Trump over the Jan. 6 sacking of the Capitol.",
    "I'll tell you this, there's only one way Liz Cheney wins, and that's if you let Democrats vote in your primary, so you need to call your state rep and let them know,? he said just days before the bill died.",
    "While Cheney has yet to overtly court Democrats, her decision to aggressively investigate Trump as a leader of the select Jan. 6 House committee naturally appeals to voters who detest the former president.",
    "At an event in Cheyenne earlier this month where nearly 200 people in cowboy hats and boots showed up to support Hageman, Sen. Rand Paul (R-Ky.) urged voters to call their legislators to back the measure.",
    "At the March 22 event, which is being hosted by Issue One, a bipartisan organization that advocates for sweeping reforms to fix our broken political system,? Cheney will answer pre-selected questions.",
    "I think her politics are crap, but I like how much hate she gets from the people of Wyoming,? said a 27-year-old event planner who will register as a Republican for the first time to vote for Cheney.",
    "Without an aggressive campaign strategy to win over Democrats, it might seem like a tough sell: Cheney, after all, voted with Trump 93 percent of the time, according to FiveThirtyEight.",
    "He backed a bill in the Wyoming legislature that would have barred voters from switching parties on the day of a primary election in order to vote for a candidate of another party.",
    "When Cheney was censured by the state Republican Party in February 2021, three of the eight votes against the move were by officials from Teton County, which encompasses Jackson.",
    "The person said Bouchard  because he remains popular among the MAGA set even after Trump endorsed Hageman  could play spoiler by drawing as much as 15 percent of the vote.",
    "It will depend on Cheney's on-the-ground voter engagement  not high-priced advertising campaigns that will quickly saturate Wyoming's small markets,? the person said.",
    "And what we all truly believe is that the Wyoming seat is a stepping stone to running for president in 2024 and she needs to get Trump out of the way.",
    "Just as obvious is that Cheney needs Democrats and independents to change their party registration and cast their vote for her in the Aug. 16 primary.",
    "While Rep. Liz Cheney has yet to overtly court Democrats, her decision to investigate Donald Trump appeals to voters who detest the former president.",
    " I truly will never vote for her again.?\nMartin went further, calling Cheney's work on the Jan. 6 committee duplicity.?\nShe's been MIA since Jan. 6.",
    "Her campaign is loath to talk strategy publicly, but the math doesn't lie  and neither do Cheney's actions on the ground here in recent months.",
    "He asked not to be named because it's a small town.?\nThere are a lot of things about her that don't appeal to me as a gay man,? he said.",
    "We know at least some of these voters will vote if they think their vote will make a difference in a race that means something to them.?",
    "More than 10,000 voters switched parties or registered as Republicans for the first time between the primary and general elections.",
    "They snapped up roughly a quarter of the 350 tickets, at $10 apiece, to give the embattled congresswoman a piece of their minds.",
    "We have one person representing us?  Wyoming has a single House member  and she shows up in town and it costs $10 to see her.",
    "After the event, Hageman told reporters, I'm fully confident I can win this race whether the crossover bill happens or not.",
    "She has shunned town halls and other voter forums in Wyoming's overwhelmingly red counties in favor of controlled events.",
    "It's a slap in the face,? said Rebecca Bextel, 41, another Trump-backing Republican planning to attend the voting event.",
    "She said the congresswoman is rarely in the state, despite having been urged to explain why she voted to impeach Trump.",
    "With the help of even half of the 73,000 Democrats who voted for Biden in 2020, they believe Cheney could pull it off.",
    "Wyoming political strategists say the only path to victory for Cheney is with the help of Democrats and independents.",
    "They are counting on a primary with at least two pro-Trump GOP candidates that will divide the anti-Cheney vote.",
    "They appreciate Cheney's work in Congress prosecuting Trump and they're ready to switch parties to vote for her.",
    "What Cheney doesn't know  until now  is that a band of Trump-loving Republicans will be on hand to greet her.",
    "He said he intends to vote for Cheney  and has heard from lots of other Democrats planning to do the same.",
    "Every vote counts.? Wyoming's population is just under 579,000, according to U.S. Census figures.",
    "She was not supportive of her sister until it came out in the news, and that is a big red flag.",
    "Mark Gordon, the GOP state treasurer at the time, was facing stiff competition from the right.",
    "She's not in the state, she has not been anywhere, maybe one or two places,? Donovan echoed.",
    "I think it's a fairly popular thing,? he said of the party-switchers-for-Cheney movement.",
    "Her parents have events at their house, I've spent money to go to her house to fund her.",
    "| Anna Moneymaker/Getty Images\nBy Tara Palmeri\n 03/14/2022 04:30 AM EDT\nJACKSON, Wyo.",
    "That could open the door just enough for Cheney to slip through, the organizer said.",
    "is turning to the same rare species in Wyoming  Democrats  to save her House seat.",
    "She is not,? Bextel vowed, going to get reelected.?\nBextel may well be correct.",
    "The state's 2018 Republican primary for an open governor's seat is instructive.",
    "Gordon won the primary by 9,000 votes against candidates that included Hageman.",
    "And to raise money, she's using the anti-Trump commentary,? Martin speculated.",
    "Cheney allies are hopeful that crossover voters will bail her out this time.",
    "And Trumpist Republicans are doing everything in their power to thwart her.",
    "Turnout was 116,000 and Gordon received just shy of 39,000 votes.",
    "The dissenters included Mary Martin, now the county's GOP chair.",
    "Trump, too, is worried that Democrats will help reelect Cheney.",
    "But that proposal died in the Wyoming legislature last week.",
    "Fifteen years later, his daughter Rep. Liz Cheney (R-Wyo.)",
    " At the same time, it's Wyoming, a population of 500,000.",
    "But some Democratic voters in Jackson are embracing her.",
    "McCarthy did not respond to a request for comment.",
    "Cheney declined to be interviewed for this story.",
    "Since then, however, Martin has soured on Cheney.",
    "Even if they're not ready to admit it publicly.",
    "Cheney needs as many of them as she can get.",
    "She doesn't show up  she's very entitled.",
    "Charging for a ticket!",
    "Can you believe it?",
    "It's embarrassing."
  ]
}