{
  "id": 349,
  "mediaId": 19,
  "date": "3/14/2022 12:00:00 AM",
  "headline": "Wyoming Voters Have to Pay for an Audience with Liz Cheney",
  "image": "https://media.breitbart.com/media/2021/07/Liz-Cheney-closeup-speaking-to-reporters-ap-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/14/wyoming-voters-have-pay-audience-liz-cheney/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    945,
    945,
    1248,
    1248,
    1335,
    1335,
    1609,
    1609,
    2524,
    2524,
    633,
    633,
    182,
    182,
    428,
    428,
    2976,
    2976
  ],
  "sentences": [
    "It's embarrassing.?\nAccording to the report, Republicans who oppose Cheney and likely support her GOP primary opponent, Harriet Hageman, have bought about a quarter of the 350 available tickets to give the embattled congresswoman a piece of their minds.?\nCheney is in hot water after opposing American First policies, voting to impeach Donald Trump, and allying herself with House Speaker Nancy Pelosi's (D-CA) January 6 committee, which has sought to investigate the January 6 incident without focusing on the alleged FBI informants at the Capitol.",
    "But Hageman is backed by Donald Trump and Republican megadonor Peter Thiel, who reportedly dubbed Cheney the ringleader? of the treasonous ten.?\nThe reference pertains to the Republicans who voted to impeach Donald Trump for January 6.",
    "After spending time with Harriet, it is readily apparent she will always listen and prioritize the needs of her local communities and is focused on tackling our nation's biggest problems,? McCarthy said.",
    "Cheney, who is rarely seen in Wyoming, is charging Wyoming residents $10 for admission to an event next week, Politico reported about a gathering to be held at Jackson's Center for the Arts.",
    "The poll, conducted by the Wyoming Republican State Central Committee via secret ballot, showed Hageman won 59 votes and Cheney six, a 53-vote advantage for Hageman.",
    "After the Wyoming GOP voted to no longer recognize her as a Republican in November, McCarthy announced in February his endorsement of Hageman to defeat Cheney.",
    "She doesn't represent our values.?\nMeanwhile, a straw poll in January among GOP activists found Trump-endorsed Hageman holds a solid lead over Cheney.",
    "Wyoming voters will have to pay for an audience with embattled Rep. Liz Cheney (R-WY) during one of her infrequent visits to her home state next week.",
    "I look forward to serving with Harriet for years to come.?\nMcCarthy's decision to endorse Hageman mirrors the overall criticism of Cheney.",
    "Cheney attended the Democrat-led annual celebration on January 6 with her father Dick Cheney, former vice president to George Bush.",
    "Cheney's conduct has drawn condemnation from the Wyoming Republican Party and House Minority Leader Kevin McCarthy.",
    "During the event, Cheney will only answer pre-selected questions, perhaps to avoid the ire of Wyoming voters.",
    "Among Liz Cheney voters, Dick has a favorability rating of 60 percent with 26 percent disapproving.",
    "Cheney reportedly has a powerful five-million-dollar war chest with which to oppose Hageman.",
    "We have one person representing us and she shows up in town and it costs $10 to see her.",
    "Among prospective Hageman voters, Dick has a 57-32 percent disapproval rating.",
    "It's a slap in the face,? voter Rebecca Bextel told Politico about the event.",
    "Dick Cheney's approval among the Wyoming electorate is also underwater.",
    "She doesn't represent us,? Hageman told Breitbart News in January.",
    "Overall, only 39 percent approve of Dick while 48 percent do not.",
    "Liz Cheney doesn't live in Wyoming.",
    "Liz Cheney has lost Wyoming.",
    "Charging for a ticket!",
    "Can you believe it?"
  ]
}