{
  "id": 350,
  "mediaId": 409,
  "date": "3/13/2022 12:00:00 AM",
  "headline": "Democratic Interlopers Could Diminish Trump's Clout in GOP Primaries",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/03/DTRUMP.jpg?w=1592",
  "link": "https://www.nationalreview.com/2022/03/democratic-interlopers-could-diminish-trumps-clout-in-gop-primaries/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Fund",
  "authorUrl": "",
  "termIds": [
    1147,
    1064,
    1064,
    1563,
    1563,
    2117,
    2117,
    1248,
    1248,
    1147,
    562,
    562,
    428,
    428,
    146,
    146,
    2945,
    2945
  ],
  "sentences": [
    "I took one vote he didn't like and now he's chosen to support a yes man candidate who has and will bow to anything he says, no matter what.? He claims to have voted for Trump's policies more than 90 percent of the time over four years and says the GOP should stick with Trump's policies but move on from his combative personality.",
    "She told the Florence rally that she'd been waiting for two weeks to greet Big Daddy? and that Trump was the best damn president this country's ever had, period, end of story.?\nRice, for his part, was one of ten House Republicans who voted to impeach Trump over his role on January 6, and he isn't backing down one bit.",
    "Mace was a strong supporter of Trump in 2016 and 2020, but after the January 6 riot at the Capitol, she told CNN that his entire legacy was wiped out yesterday.? While she did vote against impeaching Trump over January 6, she voted to hold former Trump aide Steve Bannon in contempt of Congress.",
    "But if he falls short in challenges such as the ones to Nancy Mace and Tom Rice, his reputation as the Big Daddy? of Republican politics may suffer  even if it is Democrats and independents acting as interlopers in the GOP primary who determine the outcome.",
    "If he wins a clear majority of them  including the Alaska Senate race, where the Trump-endorsed Kelly Tshibaka is challenging Senator Lisa Murkowski  he will be well positioned to dominate the discussion about the 2024 presidential race.",
    "But Hageman backers had been hoping that the Wyoming legislature would pass a bill this month barring both independents and Democrats from crossing party lines and changing their party registration on the day of the primary.",
    "Dump these grandstanding losers,? Trump roared, referring to Mace and Rice, and replace them with two rock-star, America-first candidates.? He goaded his audience into booing the two House members.",
    "It's unlikely that the 10,000 voters who switched affiliations to vote in the GOP primary that year swayed the outcome, but the situation could change in the case of Cheney's primary this year.",
    "McCain almost certainly lost among registered Republicans but won by running so strongly with the one-third of Arizonans who are registered independents  and who could vote in the GOP primary.",
    "It was untruthful, just like everything else she does.?\nMace's opponent is Katie Arrington, a former state legislator and Trump Pentagon appointee, who can't say enough to praise Trump.",
    "Consider the case of the late John McCain, the maverick senator who was unpopular with Trump voters when he ran for reelection in the GOP Senate primary in 2016.",
    "Two of his incumbent targets are in South Carolina  Representatives Nancy Mace and Tom Rice  and that explains why Trump held a rally there on Saturday.",
    "Trying to appease Trump supporters, Mace made a video in front of Trump Tower in New York last month, assuring voters that she backed the Trump agenda.",
    "Charleston, S.C.  Donald Trump is spending a lot of political capital trying to prove he can defeat any Republican who dares to challenge him.",
    "A similar dynamic could save Representative Liz Cheney, a vocal Trump critic, who faces several challengers in her August primary in Wyoming.",
    "Anti-Trump independents or Democrats could decide to influence in two heavily Republican districts by casting their vote in the GOP primary.",
    "In some states, independents and Democrats can change their party on Election Day  and vote for the GOP candidate not backed by Trump.",
    "Russell Fry, the state representative who has won Trump's endorsement against Rice, is certainly Trump's equal in being combative.",
    "For all of her unpopularity with grassroots Trump activists in Wyoming, Cheney has more than enough money to get her message out.",
    "No Democrats have filed to run against her, so many of them may be tempted to cast a proxy vote against Trump by backing Cheney.",
    "Trump is here because, like no one else I've ever met, he is consumed by spite,? Rice said in a statement after Trump spoke.",
    "With all the grassroots animosity being heaped on Mace and Rice, you would think they were goners in the June 14 primary.",
    "Trump publicly endorsed the bill, but last week the state house rejected it, declining to follow the state senate's lead.",
    "Former president George W. Bush and former House speakers John Boehner and Paul Ryan have all helped her raise money.",
    "Last week, he began running an eye-catching ad labeling Rice a villain? with whom even The Joker wouldn't associate.",
    "The three leading candidates were Hageman, major Trump donor Foster Friess, and Mark Gordon, the state treasurer.",
    "Trump responded by mocking her at his rally: [She] did a commercial insinuating that I was endorsing her.",
    "Gordon won the primary with only 33 percent of the vote, besting Friess, who won 26 percent of the vote.",
    "Crossover voting may well have influenced the outcome of the 2018 GOP primary for Wyoming governor.",
    "The Trump-backed choice is Harriet Hageman, a land-use attorney and former candidate for governor.",
    "At the Florence rally, he called Rice a slimy reptile? who was part of the Washington swamp.",
    "If they don't meet that, they'll have to compete in a runoff against their top challenger.",
    "So far, Trump has endorsed eight GOP challengers over sitting House Republicans.",
    "He probably sees that as a key way of asserting his dominance over the GOP.",
    "It failed even though 51 of Wyoming's 60 house members are Republicans.",
    "To win, they each have to bring in 50 percent plus one of the votes.",
    "There is no barrier limiting primary voting to just Republicans.",
    "Mace and Rice are in hot water with Trump for different reasons.",
    "Kelli Ward, a pro-Trump former state senator, won 40 percent.",
    "McCain wound up winning only 51 percent of the vote.",
    "South Carolina has nonpartisan voter registration.",
    "He has invested time and even some money in them.",
    "Donald Trump has a lot riding on the primaries.",
    "Their votes could save both Mace and Rice.",
    "But how likely is he to succeed this year?",
    "But it's more complicated than that.",
    ".",
    ".",
    "."
  ]
}