{
  "id": 363,
  "mediaId": 237,
  "date": "3/9/2022 12:00:00 AM",
  "headline": "Trump-backed Wyoming elections bill fails to pass, in boon to Liz Cheney",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/968929.png",
  "link": "https://www.washingtonexaminer.com/news/trump-backed-wyoming-elections-bill-fails-to-pass-in-boon-to-liz-cheney",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Scanlon",
  "authorUrl": "https://www.washingtonexaminer.com/author/kate-scanlon",
  "termIds": [
    2087,
    2141,
    2141,
    2087,
    1248,
    1147,
    1248,
    1147,
    428,
    428,
    146,
    86,
    86,
    146,
    562,
    562,
    2976,
    2976
  ],
  "sentences": [
    "The paper noted that if the bill had become law, voters may not have known for certain who was running before having to register with a certain party.?\nSupporters of the bill, including Trump and attorney Harriet Hageman, whom Trump has endorsed against Cheney in the primary, said it would have prevented Democrats and independents from changing their party registration on Election Day in order to vote in a Republican primary.",
    "But Cheney told the New York Times last month she will not organize a Democrats for Cheney? group or other political action committees for Democrats supporting her or otherwise encourage voters to switch their party registration.",
    "The former president has particularly targeted 10 Republicans who voted to impeach him in the aftermath of the Jan. 6 riot at the U.S. Capitol, including Rep. Liz Cheney, Wyoming's lone representative in the House.",
    "A bill to end so-called crossover voting in state primaries backed by former President Donald Trump failed in the Wyoming House after lawmakers did not consider the bill before a legislative deadline.",
    "Trump has made a series of endorsements in races across the country in support of allies who backed his unfounded claims of a stolen election in 2020 and targeting those who did not back those claims.",
    "According to the Casper Star-Tribune, the bill would have ended same-day party affiliation changes by blocking voters from switching parties about three months before a primary election.",
    "Cheney said her vote to impeach Trump was a rejection of Trump's conduct after the election, not an endorsement of President Joe Biden or his policies.",
    "But a later data analysis by University of Wyoming pollster Brian Harnisch found that crossover voting had little impact on the outcome.",
    "Mark Gordon was elected in 2018 over a Republican rival due to Democratic voters switching their party affiliation.",
    "Trump and Hageman's allies argued that banning the practice would reduce Cheney's odds of winning reelection.",
    "There are no declared Democratic candidates for the House race in the deep-red state.",
    "But the proposal predated Trump's feud with Cheney.",
    "Some state Republicans argued Gov."
  ]
}