{
  "id": 391,
  "mediaId": 25,
  "date": "3/1/2022 12:00:00 AM",
  "headline": "Biden's low approvals worry Democrats campaigning in midterm elections",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/03/01/9748d310-3057-45bd-bb6c-2b05baa5b0d8/thumbnail/140x90/d1a07d69710acbf0a36d68ff94d35254/gettyimages-1238854107.jpg",
  "link": "https://www.cbsnews.com/news/joe-biden-democrats-midterm-elections-2022/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1881,
    2087,
    2156,
    3085,
    3094,
    89,
    146,
    600,
    2550,
    2953,
    2972
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n What to watch for in Texas' primary elections\n Trump's response to Putin's invasion of Ukraine reveals GOP fissures\n Democrats seize on GOP Senator Rick Scott's plan to tax more Americans\n Congressman Colin Allred discusses Democrats' midterm prospects\n Kevin McCarthy backs Liz Cheney's primary challenger Harriet Hageman\n More\n Caitlin Huey-Burns\nCaitlin Huey-Burns is a political reporter for CBS News.",
    "Former Congressman Beto O'Rourke, who has focused his Texas gubernatorial campaign on local issues like the state's power grid, told reporters in January that he is \"not interested in any national politician  anyone outside of Texas  coming into this state to help decide the outcome of this.\"",
    "\"It's working to elect governors to be partners with us in state houses, working to elect people in the Senate to help build on the seats we have now, but also put that infrastructure in now so we are running stronger, harder and faster headed into 2024he's clear eyed about that.\"",
    "With President Biden's approval rating stuck in the mid-40s, inflation at a 40-year high, and voters historically inclined to punish the party in power in midterm elections, Democrats vying for seats in Congress are assessing whether and how to campaign with the president.",
    "\"Every day the president and vice president are out with real people and not in Washington is a good day for Democrats and for the president's agenda,\" said Matthew Daggett, deputy campaign manager to Pennsylvania Senate candidate Malcolm Kenyatta.",
    "\"We are in such a polarized environment now that the days of a congressional incumbent outpolling the president are over,\" said former Representative Steve Israel, who chaired the Democrats House campaign arm for the elections in 2012 and 2014.",
    "\"Because Senate campaigns are the top of the ticket this year and because senators have such large and distinct brands in the eyes of voters, they tend to be a contest of two candidates,\" said DSCC Communications Director David Bergstein.",
    "\"These numbers are showing us where the American people are right now, and they do not have confidence in Joe Biden or the Democrat Party,\" Republican National Committee Chairwoman Ronna McDaniel told reporters on Monday.",
    "In October 2018, CBS News polling showed former President Donald Trump had a 42% approval rating, including support from 87% of Republicans, but only 38% of independent voters  similar to Mr. Biden's level of support.",
    "After winning the presidency, Mr. Biden campaigned for now Senators Jon Ossoff and Raphael Warnock in the January 2021 Georgia runoffs, reminding voters that the Senate majority, and his own agenda, was at stake.",
    "There have already been warning signs for Democrats after Republicans won a hotly contested gubernatorial race in Virginia and came much closer than projected to capturing the governor's mansion in New Jersey.",
    "CBS News reached out to 15 top Democratic Senate campaigns in nine battleground states on Monday to ask if they would welcome a campaign visit from the president and what they'd want his message to be.",
    "Building Back Together, a nonprofit organization focused on supporting the president's agenda, has spent more than $25 million on paid media in eight competitive states and dozens of House districts.",
    "The adviser insisted the midterms are a political priority for the president, saying \"Anybody who has paid enough attention to his life's work knows the party matters to him, he's a party builder.\"",
    "Democratic senators told White House chief of staff Ron Klain at a meeting last week to preview the State of the Union that they like seeing him out around the country, talking about achievements.",
    "\"They've each got to win their own races, and thanks to President Biden, they can point to delivering on major local priorities funded in the American Rescue Plan and the infrastructure package.\"",
    "Party strategists and operatives advising campaigns say that Democrats aren't likely to turn down a visit from the president, but they aren't relying on him to carry over the finish line either.",
    "\"Democratic frontline members are very happy to stand by the president next to the bridge they got money for,\" said Chris Taylor, a spokesman for the House Democrats' campaign committee.",
    "They point to Mr. Biden's recent trip to Culpepper, Virginia, where he appeared with vulnerable Democratic Representative Abigail Spanberger to talk about prescription drug prices.",
    "She stressed that Mr. Biden \"shares people's frustrations\" and said her group wants to double down on its investments to demonstrate tangible impacts from the Biden administration.",
    "Mr. Biden received 41% approval for his handling of Russia and Ukraine, but fewer than 40% of Americans approve of how he has handled crime, the economy, immigration and inflation.",
    "As the president prepares to deliver his first State of the Union address, a new CBS News poll released on Tuesday morning found that Mr. Biden's approval rating remained at 44%.",
    "\"There's a lot at stake in elections and we want to make sure folks know the great work that has already been done to try to make their lives better this past year,\" Melfi said.",
    "The president did receive a 51% approval for his handling of the COVID-19 pandemic, as case numbers have declined, and mask requirements are being lifted around the country.",
    "Georgia, Wisconsin, Pennsylvania, Florida, Arizona, Nevada and New Hampshire all have key Senate races this year, and are critical presidential battleground states.",
    "And they expect candidates will appear with the president to tout ways in which the infrastructure bill signed into law last year helped their district or state.",
    "The president's approval rating started to fall last summer during the U.S. withdrawal from Afghanistan and fell even further as inflation became a bigger issue.",
    "The president is also keenly aware that the outcome of the 2022 midterms have consequences not only for his agenda, but also for his own reelection prospects.",
    "They also encouraged Mr. Biden to get out of Washington, where some key items of the president's agenda are stuck in both intra-party and partisan politics.",
    "Danielle Melfi, the executive director of Building Back Together, said the group knows that \"people are affected\" by rising costs and the ongoing pandemic.",
    "But if Mr. Biden's approval numbers hover around 40% on key issues for voters, it could threaten Democratic candidates across the country later this year.",
    "During the 2018 midterms, he campaigned for 60 candidates in 24 states, establishing relationships with Democrats ahead of his own presidential campaign.",
    "\"But as to where he goes, in individual states, ultimately it's up to the individual candidates and senators to determine what they would like to see.\"",
    "But emphasizing local issues in races can be increasingly difficult to pull off, especially while standing next to the president of the United States.",
    "While Democrats narrowly hold the Senate majority due to Vice President Kamala Harris' tie-breaking vote, they lost seats in the House in 2020.",
    "\"It makes sense when we are thinking about 2024 to begin to lay the groundwork for 2022 in those states,\" a White House adviser told CBS News.",
    "To that end, Biden and the DNC earlier this month announced a $15 million transfer to the campaign committees for House and Senate Democrats.",
    "I'm focused on the people I was sent to represent,\" Senator Warnock said when asked if he wants Biden to come to Georgia to campaign for him.",
    "Republicans are eager to tie Democratic candidates to Mr. Biden throughout the midterm cycle due to the president's low approval ratings.",
    "In 2010, two years after Barack Obama won the presidency, Democrats lost 63 seats and control of the House, as well as six Senate seats.",
    "To compete in this environment, they say candidates will need to emphasize local concerns as much as possible, rather than national.",
    "Groups allied with the White House to push Mr. Biden's accomplishments have already made major investments in battleground races.",
    "The president's party normally has a difficult time with the first-term midterm elections, especially for House candidates.",
    "In 2018, two years after Trump won, Republicans lost 40 House seats and the majority, but managed to gain two Senate seats.",
    "That rating is up one point from last month, and the same number he received in January and November CBS News polls.",
    "\"I think it's always an asset to have the president campaign,\" DSCC Chairman Senator Gary Peters told CBS News.",
    "After his State of the Union address, he will travel to Superior, Wisconsin, to talk about infrastructure.",
    "\"I came here as a pastor and that's still the lense through which I do everything that I do.",
    "His approval rating remains at 78% among Democrats, but just 37% with independent voters.",
    "Democrats note that candidates like Warnock outperformed the president in their races.",
    "In 2022, Republicans just need to flip just five seats to take over the lower chamber.",
    "Mr. Biden told reporters earlier this year that he does plan to get on the road more.",
    "Six of those campaigns responded and said they would welcome a presidential visit.",
    "I'm trying to do the most good for as many people as I can for as long as I can.\"",
    "\"In an environment like this, you can't escape the national,\" Israel said.",
    "Republican Senator Ron Johnson is also up for re-election in that state.",
    "And not every major candidate is welcoming the president with open arms.",
    "In the past, Mr. Biden was seen as an asset on the campaign trail.",
    "\"I know that the folks around here are focused on the politics.",
    "Republicans went on to lose control of the House that November.",
    "Over a year into his presidency, those dynamics have shifted.",
    "But, \"You can edit it to be local.\""
  ]
}