{
  "id": 402,
  "mediaId": 124,
  "date": "2/26/2022 12:00:00 AM",
  "headline": "With Liz Cheney's re-election prospects in doubt, her national profile grows",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220222-liz-cheney-2019-ac-505p-5b8a7c.jpg",
  "link": "https://www.nbcnews.com/politics/elections/liz-cheneys-re-election-prospects-doubt-national-profile-grows-rcna17265",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2465,
    2465,
    1046,
    1046,
    1147,
    746,
    746,
    1930,
    1930,
    1667,
    1667,
    1248,
    1248,
    1147,
    428,
    428,
    2661,
    2851,
    2661,
    2851
  ],
  "sentences": [
    "But I go to a meeting and I have people who flip me the finger because I'm a RINO'  this is sad stuff,? he added, using an acronym for Republican in name only.?\nKilberg is hoping that Cheney, bolstered by the millions she's raising, can assemble a coalition of crossover Democrats and Republicans who've tired of Trump.",
    "In a bit of counterprogramming to the Conservative Political Action Conference hosting Trump, Cheney will be a main headliner at the \"Principles First\" gathering in Washington, D.C., giving recorded remarks to an audience grateful she has stood up to Trump and debunked the fiction that the 2020 election was stolen.",
    "\"I think even people who supported Donald Trump realize we've got to look forward, and that he's just sort of on his vengeance and revenge tour and looking backwards,\" said former Rep. Barbara Comstock, R-Va., who is speaking at the weekend conference alongside Cheney.",
    "The reprisals started last May with her ouster from the House GOP leadership and have continued through this month, when the Republican National Committee voted overwhelmingly to censure her and Rep. Adam Kinzinger, R-Ill., who also sits on the Jan. 6 committee.",
    "Hageman, a Wyoming native, told NBC News that Cheney is out of step with her adopted state, faulting the lawmaker for focusing too much on the Jan. 6 investigation while doing too little to tackle local issues voters care about, such as fossil fuel development.",
    "\"Trump had one of his biggest margins of victory there in the last election and she spends all her time attacking Republicans on the national stage,\" a national Republican campaign strategist said, speaking on condition of anonymity to talk more freely.",
    "They've been trying to drum Cheney out of the party since she voted to impeach Trump for his conduct in the Jan. 6 Capitol riot and accepted House Speaker Nancy Pelosi's appointment to the select committee investigating the attempted insurrection.",
    "Bobbie Kilberg, an adviser to former Presidents Richard Nixon, Gerald Ford and both Bushes, is hosting the event, predicting it will bring in more money than a fundraiser she held for Romney's presidential bid weeks before the 2012 election.",
    "Former President Donald Trump will address his supporters at an annual meeting of conservative activists in Orlando, Florida, while his Republican critics will hear from the congresswoman he's hellbent on defeating  Rep. Liz Cheney, R-Wyo.",
    "\"She embodies the little boy in the 'emperor has no clothes' who supplied the necessary dose of reality,\" Ty Cobb, a former Trump White House lawyer who has donated $2,000 to her campaign, told NBC News.",
    "At a time when few Republican politicians are willing to cross Trump, the congresswoman has made it her singular focus to stop him from getting \"anywhere near the Oval Office ever again,\" as she puts it.",
    "Explaining how he's perceived in Wyoming's Republican circles these days, Simpson, the former lawmaker, said: I'm a Republican and I'm the horse's ass of the Earth.?\nI was 90 percent conservative.",
    "Rep. Liz Cheney responds to Trump's Jan. 6 comments: He clearly would do this all again'\nJan. 31, 202201:34\nMoney is piling up in Cheney's re-election fund  more than $7 million last year.",
    "Trump himself issued a statement last week backing an effort in the Wyoming Legislature to end a practice in which residents can change their party affiliation on the day of the primary.",
    "\"There's a bigger highlight on this race than previous cycles,\" Joe Barbuto, chairman of the Wyoming Democratic Party, said, adding he expects Democratic crossover voting to happen.",
    "What distinguishes her from the challenger isn't policy so much as it is Trump; Hageman has called him the best president in her lifetime (though she was critical of him in 2016).",
    "\"We're in a really sad state of affairs and it is exceedingly important that we protect the fabric of our democracy and that we respect and adhere to the rule of law,\" she said.",
    "The change would impose a new obstacle for Democrats who might be appreciative of Cheney and want to temporarily switch parties so they can vote for her in the GOP primary.",
    "If Cheney were to attack him with impunity in a state where he ran up such a large victory margin, Republicans everywhere would have less reason to fear Trump's ire.",
    "Defeating her would rid him of a high-profile foe whose Jan. 6 committee has used subpoena power to unearth his efforts to thwart President Joe Biden's victory.",
    "A Morning Consult/Politico survey showed there are more Republicans who've moved past Trump's claims of election fraud than want to keep fighting over them.",
    "Next month, like-minded Republicans are hosting a fundraiser for Cheney featuring Sen. Mitt Romney, R-Utah, with VIP tickets priced at $10,800 per couple.",
    "Some GOP strategists don't see how she can win re-election and predict she'll bow out, take her expanding network of donors and run for president in 2024.",
    "And it's so much cash from so many unexpected places that seasoned campaign operatives aren't sure she can even spend it all on a House race in Wyoming.",
    "Yet, her candor has also drawn a national following that could distinguish her from the rest of the GOP field should she run for president in 2024.",
    "And a CNN/SSRS poll found a virtual 50/50 split in Republicans who want to see Trump renominated in 2024, versus those who want a new candidate.",
    "Offending Trump is especially risky in Wyoming, a state where he racked up a higher share of the vote  70 percent  than anywhere in the country.",
    "Some Republicans in the state believe the result speaks more about the party leadership's rightward, pro-Trump drift than it does about Cheney.",
    "Because of her vocal criticism of Trump, Cheney is in real danger of losing Wyoming's Republican primary this summer to a pro-Trump challenger.",
    "The ex-president's endorsement of Hageman helped winnow the field so that it is now effectively a two-person race between Cheney and Hageman.",
    "An upset victory in the August primary would send an unmistakable message to party leaders still clinging to Trump: Enough is enough.",
    "But the reality is that she's raising money from out of state because she is a globalist and they know that they can control her.",
    "Republicans outnumber Democrats by more than 4 to 1 in Wyoming, but in a close contest, Democratic votes could make a difference.",
    "The organizers have already had to switch venues to accommodate the growing number of supporters who have asked to attend.",
    "His eldest son, Donald Trump Jr., is the honorary chairman of a super PAC called Wyoming Values that is helping Hageman.",
    "That legislation would require voters who want to switch parties to do it by mid-May  three months before the primary.",
    "Cheney supporters are encouraged by recent signs that Trump's grip over the GOP might be loosening, if just slightly.",
    "If Cheney can salvage a victory, that would be a powerful sign that Trump's influence inside the party has waned.",
    "\"The 'big lie' led to Jan. 6 and somebody needed to call it out, and she did a courageous job of it,\" he added.",
    "The schism within the Republican Party will be on vivid display Saturday in dueling events 850 miles apart.",
    "Hageman acknowledged that Cheney has far more money in the bank and that Cheney outraised her seven-to-one.",
    "A straw poll taken last month by Wyoming's Republican State Central Committee points to Cheney's troubles.",
    "\"She will be a force  a force  in bringing Donald Trump down,\" former Sen. Alan Simpson, R-Wyo., said.",
    "Her appearance comes at an odd point in a political career that could take two very different paths.",
    "It's roughly 10 times as much as her Trump-backed primary challenger Harriet Hageman drew.",
    "However, Hageman claimed, she has outraised Cheney by the same ratio among Wyoming voters.",
    "Hageman won with 59 votes while Cheney finished a distant second with six votes.",
    "For now, she says she's running for re-election, while striking a defiant chord.",
    "That's what this is about.?\nCheney hasn't ruled a presidential bid in or out.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Following Trump's cues, Republican leaders have maneuvered to stop her.",
    "\"We need more truth and more courage in America todayacross the board.\"",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "And that's something we all ought to be cognizant of and all support.",
    "No midterm election race may be as important to Trump as Cheney's.",
    "\"Bring it on,\" she says of Trump's bid to oust her from Congress.",
    "The anti-Trump wing of the party has found a champion in Cheney.",
    "If this was Susan Collins, that position would make more sense.",
    "Her apostasy has created problems back home, as well.",
    "It would also demonstrate his clout within the party.",
    "\"She's the one in the crowd who says, 'He's nekkid.'\"",
    "That is something that Mike Pence did on Jan. 6.",
    "There's no question about it,? Hageman said.",
    "\"And that is something that Liz is doing.",
    "\"It's not a state where you do that.",
    "But she's in ruby red Wyoming.\"",
    "\"And that will be her mission.\"",
    "It's really as simple as that.\"",
    "\"We need money.",
    "That he has."
  ]
}