{
  "id": 429,
  "mediaId": 43,
  "date": "2/22/2022 12:00:00 AM",
  "headline": "Two Republicans who certified 2020 are winning money race against two",
  "image": "https://images.dailykos.com/images/1040785/story_image/GettyImages-1354083934.jpg?1645548784",
  "link": "https://www.dailykos.com/story/2022/2/22/2081671/-Two-Republicans-who-certified-2020-winning-money-race-against-two-Trump-backed-rivals-who-didn-t",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2510,
    2510,
    1030,
    1030,
    1248,
    1248,
    1332,
    1332,
    2095,
    2095,
    428,
    428,
    2707,
    2707,
    2646,
    2646,
    2959,
    2959
  ],
  "sentences": [
    "Rep. Mary Miller (R-IL) speaks at a press conference on vaccine mandates for businesses with House Republicans on Capitol Hill on Nov. 18, 2021 in Washington, D.C.\nRepublican Reps. Rodney Davis of Illinois and David McKinley of West Virginia have some things in common: They both voted to certify the 2020 election, and now they're both facing primaries from Trump-backed GOP incumbents who were redistricted out of their seats.",
    "Related articles:\nMore bad news for Trump: His hand-picked gubernatorial candidate in Georgia is flopping\nLiz Cheney and other Trump targets trounce his endorsees in the fundraising race\nIt's starting to occur to Trump that some of his endorsements have proven subpar\nThis is a short blurb about Daily Kos.",
    "Davis' opponent in Illinois' 15th District, Rep. Mary Miller, featured a quote from Adolf Hitler during the pre-insurrection speech she gave on Jan. 5, the day before pro-Trump terrorists stormed and desecrated the U.S. Capitol.",
    "We have yet to see how Trump's candidates actually perform in their primaries, but by and large, many of them have proven underwhelming thus far, calling into question just how much of a kingmaker Trump really is in the GOP.",
    "The congressional races in Illinois' 15th and West Virginia's 2nd reflect a broader pattern of underperformance by Trump's picks in their primary raceswhich should presumably be gimmes once they get the Trump nod.",
    "He said, Whoever has the youth has the future.'\"\nMiller later apologized for the comments but, alongside her objection to certifying the 2020 election, it was clearly enough to earn Trump's endorsement.",
    "Those stumbles include high-profile races such Georgia's contest for governor, where Trump-backed David Perdue appears to be floundering in his bid to unseat incumbent GOP Gov.",
    "You know if we win a few elections, we're still going to be losing unless we win the hearts and minds of our children,\" Miller said at the \"Save the Republic\" rally.",
    "Mooney secured Trump's endorsement in November, but his fourth-quarter fundraising totaled just $200,000, one of his lowest showings, according to CNN.",
    "The two men are also defying expectations in the money race to keep their seats while their GOP challengers turn in underwhelming fundraising numbers.",
    "Trump-backed Mooney does have a cash-on-hand advantage in this race however, ending 2021 with $2.4 million, more than double McKinley's $1.6 million.",
    "In the final quarter of 2021, Cheney took in $2 millionbesting the haul of her Trump-backed challenger, Harriet Hageman, by a whopping $1.6 million.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "McKinley not only voted to certify the election, he voted in favor of forming an independent commission to investigate Jan. 6.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "By contrast, Davis hauled in some $421,000 in the final quarter of 2021, bringing his total on the cycle to $1.8 million.",
    "Miller raised less than $165,000 in the fourth quarter of 2021, bringing her fundraising totals of the year to $788,000.",
    "A similar dynamic is playing out in West Virginia's 2nd District, where McKinley is trying to fend off Rep. Alex Mooney.",
    "McKinley, on the other hand, amassed $1.1 million in the final quarter last year, though $500,000 of it was self-funded.",
    "Davis also had $1.2 million cash-on-hand to begin the year, while Miller claimed just $415,000 at the outset of 2022.",
    "It also includes Trump's effort to oust Rep. Liz Cheney from her at-large seat representing Wyoming.",
    "Money isn't everything in politics, but it undoubtedly gives candidates a sizable advantage.",
    "That, however, hasn't translated into clear momentum for Miller, according to CNN.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Each generation has the responsibility to teach and train the next generation.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Hitler was right on one thing.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "\"This is the battle.",
    "Please read it.",
    "Brian Kemp."
  ]
}