{
  "id": 448,
  "mediaId": 65,
  "date": "2/18/2022 12:00:00 AM",
  "headline": "Stefanik joins McCarthy in endorsing Cheney's Republican primary challenger",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/54caf9fd-c5cd-4c80-b50d-64c480a8c533/d97ab53f-08bc-4d90-9bf7-23848e2b11de/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/stefanik-mccarthy-endorse-cheney-republican-primary-challenger",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3085,
    3094
  ],
  "sentences": [
    "After once holding Stefanik's role as House Republican Conference chair, Cheney has angered some fellow Republicans by criticizing former President Donald Trump for his false claims about the 2020 election being stolen and for his actions around the Jan. 6, 2021, Capitol riot.",
    "\"The most successful Representatives in Congress focus on the needs of their constituents, and throughout her career, Harriet has championed America's natural resources and helped the people of Wyoming reject burdensome and onerous government overreach.\"",
    "\"It is fitting that I am receiving the endorsement of the congresswoman who replaced Liz Cheney as chair of the Republican Conference because it exemplifies exactly how Cheney has abandoned her responsibilities,\" the Wyoming Republican continued.",
    "CHENEY TELLS FOX NEWS THAT BEHIND THE SCENES', MANY IN GOP ARE THANKING HER\n\"Harriet is a true America First patriot who will restore the people of Wyoming's voice that has been long forgotten by Liz Cheney,\" Stefanik added.",
    "Cheney was the most high-profile of the 10 House Republicans to vote 13 months ago to impeach Trump for inciting the Jan. 6 riot, and she is vice chair of the House Jan. 6 committee, in defiance of Republican leadership.",
    "\"I am honored and grateful to have the support of Rep. Elise Stefanik, who is an excellent representative for her own constituents and a fantastic chairwoman of the House Republican Conference,\" Hageman said.",
    "The endorsement illustrates a further shift away from Cheney by the House GOP Caucus, after House Minority Leader Kevin McCarthy, R-Calif., threw his endorsement behind Hageman Thursday.",
    "FIRST ON FOX: House Republican Conference chair Elise Stefanik of New York endorsed Wyoming Republican Rep. Liz Cheney's primary opponent, Harriet Hageman, on Friday.",
    "\"When I am the Congresswoman from Wyoming, I will always remember who sent me to Congress, and I will always fight for what is best for our wonderful state.\"",
    "\"She is proof that it is possible to fight for your principles in Washington, D.C. while also staying true to what your constituents want you to do.\"",
    "\"I'm proud to endorse Harriet Hageman in her race to unseat Liz Cheney,\" Stefanik said in a press release exclusively obtained by Fox News Digital.",
    "\"Liz sadly belongs in an MSNBC or CNN news chair, not in Congress representing Wyominga state that voted for President Trump by over forty points.\"",
    "\"House Republicans were ready for a change when I took over as Conference Chair, and it's resoundingly clear that Wyoming families are too.\"",
    "\"At the same time, she has aided Speaker Nancy Pelosi in damaging the Republican Party as a willing pawn of the Democrats,\" she added.",
    "\"Raised on a family ranch outside of Fort Laramie, Harriet and her family have resided in Wyoming for generations,\" he added.",
    "Cheney has turned her back on us, and used the Congressional seat we entrusted her with to further her own personal goals.\"",
    "The statement backing a primary challenger for a long-term lawmaker is a rare move for a party leader in Congress.",
    "\"Wow, she must be really desperate,\" Cheney spokesman Jeremy Adler said in reaction to McCarthy's endorsement.",
    "\"I am proud to endorse Harriet Hageman for Congress,\" McCarthy, R-Calif., said in a statement Thursday.",
    "\"In Wyoming, we only get one member of the House of Representatives, and so we have to get it right.",
    "\"Liz Cheney abandoned her constituents to become a Far-Left Pelosi puppet,\" she continued.",
    "Trump endorsed Hageman last year."
  ]
}