{
  "id": 458,
  "mediaId": 129,
  "date": "2/18/2022 12:00:00 AM",
  "headline": "Explaining Putin's Decades-Long Obsession With Ukraine",
  "image": "",
  "link": "https://www.nytimes.com/2022/02/18/us/politics/putin-ukraine.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    2030,
    2158,
    2433,
    3085,
    3094,
    2888,
    2942,
    2945
  ],
  "sentences": [
    "Annie Karni writes that the endorsement was an extraordinary move? for McCarthy, who has worked to toe a fine line between his far right flank and more mainstream conservatives.?\nThe National Archives found that documents Donald Trump took home to Florida included classified information, report Luke Broadwater and Michael S. Schmidt.",
    "President Vladimir V. Putin of Russia, who has increasingly portrayed NATO's eastward expansion as an existential threat to his country, said that Moscow's growing military presence on the Ukrainian border was a response to Ukraine's deepening partnership with the alliance.",
    "The letter from the archives also said some White House staff conducted official business using nonofficial electronic messaging accounts.?\nValentine's visitors at the White House\nOn Politics regularly features work by Times photographers.",
    "She spoke with us about Putin's longtime obsession with annexing Ukraine, her worries about how he's closed himself off from outside information and his private boasts about his ability to buy anyone? in the United States and Europe.",
    "Winston Churchill once described Russia as a riddle, wrapped in a mystery, inside an enigma.? It's a phrase that could equally apply to Vladimir Putin, the Kremlin's leader, as the world awaits his next move on Ukraine.",
    "Biden, a longtime advocate for educators who continues to teach at Northern Virginia Community College, apologized to the visiting teacher for giving her students chocolate that could make them hyper later in the day.",
    "Hill has served in multiple U.S. administrations as an intelligence officer and policy adviser, most recently as senior director for Europe and Russia on the National Security Council under Donald Trump.",
    "Putin clearly sees himself as a protagonist in Russian history, and is putting himself in the place of previous Russian leaders who've tried to gather in what he sees as the Russian land.",
    "What to read\nProgressive prosecutors hoping to roll back tough-on-crime measures are facing resistance as violent crime rates grow in some cities, Astead W. Herndon reports.",
    "And they were relating discussions that they've had with the Russians, where Putin's told them bluntly that they can buy anyone they like in the United States or in Europe.",
    "Here's what Al Drago told us about capturing the image above:\nI could hear students cheering as their mini yellow school bus pulled up the driveway on the South Lawn.",
    "Representative Kevin McCarthy, the House Republican leader, endorsed Harriet Hageman, a pro-Trump candidate and primary challenger to Representative Liz Cheney.",
    "He didn't probably anticipate the Western resolve that he's got in the form of NATO and European unity, but we don't know what people are telling him.",
    "He's been in power for 22 years, and the whole of that time, he's had Ukraine in the cross hairs one way or another, and it's intensified over time.",
    "The first lady's presence was a surprise, and when I saw her walking with the students, they were jumping up and down and holding hands with her.",
    "On Valentine's Day on Monday, Jill Biden led second-grade students from Aiton Elementary School in Washington on a tour of the White House.",
    "The following excerpts have been edited for length and clarity:\nHow would you evaluate the administration's handling of this crisis so far?",
    "And in some cases, we think it might not be great, because he certainly hasn't read the mood in Ukraine as well as you might have thought.",
    "I don't know what signals he's actually getting directly, beyond what they give him in media compilations, what he might be listening to.",
    "He also is part of a larger group of security people in Russia who have been opposed to NATO expansion; they want the U.S. out of Europe.",
    "And you think he's willing to pay a very high price to get Ukraine  that he's willing to bear costs that we would see as exorbitant?",
    "Russia called the strike a destabilizing act that violated the cease-fire agreement, raising fears of a new intervention in Ukraine.",
    "But I know a lot of people who've been through Moscow recently, and they're saying the guy seems even more closed off to the news.",
    "I like this photo because you can see how eager the students are to keep moving, as the girl in front pulls her classmate forward.",
    "But he's certainly going to give us every impression that he's going to do it, and he wants to try to find operational surprise.",
    "Since then, the United States, NATO and Russia have been engaged in a whirlwind of diplomacy aimed at averting that outcome.",
    "I don't, by the way, believe that he can, because I do know people who work with the Russians and maintain their integrity.",
    "The Russians think that they can just outmaneuver the United States and all of the allies on sanctions and everything else.",
    "You can go down a long list of people who are on the board of Russian companies or do consulting for Russian companies.",
    "Because the Russian point of view is that all the U.S. does is put sanctions on countries irrespective of what they do.",
    "To better understand him, we reached out to Fiona Hill, one of Washington's foremost experts on the Russian president.",
    "And they've been very successful at that, because they have lobbyists within our own systems who lobby for them.",
    "From his point of view right now, he's put the squeeze on Ukraine and the Ukrainian economy is getting crushed.",
    "Putin wants to be the person who, on his watch, in his presidency, pulls Ukraine back into Russia's orbit.",
    "But if we put unilateral sanctions on, in advance of more action from Russia, we'll have lost the allies.",
    "He's got a parade of European leaders coming and he's trying to test them and see what they have to say.",
    "To impose punishments now rather than waiting for some trigger to set off another round of sanctions?",
    "Writ large, what the administration is doing right now is certainly what I would recommend doing.",
    "People may be spinning to him that he's done a great job  you know, that we're all capitulating.",
    "Last night, I was at dinner with a European foreign minister and one of their under secretaries.",
    "Especially in covering politics, I am always looking for those more human, in-between moments.",
    "His goal is to make us split apart, to basically capitulate without actually doing anything.",
    "Putin thinks that he can be more aggressive and wait us out and take more pain than we can.",
    "You have to be able to show the cause and effect of sanctions when you put them on and off.",
    "We're not really sure what kind of information he's getting, and he seems more embittered.",
    "The students toured the North Lawn, Cross Hall, the White House movie theater, and more.",
    "It's about him personally  his legacy, his view of himself, his view of Russian history.",
    "Understand the Escalating Tensions Over Ukraine\nCard 1 of 5\nPreventing an invasion.",
    "When he looks at the West's response, how do you think he is reading the signals?",
    "He's looking for daylight between them, and then he's making his own assessment.",
    "Whether we're hearing him on the terms that he wants us to is another matter.",
    "I think they're handling it as well as they can be, given the circumstances.",
    "I captured this photo as Biden was walking in between preplanned photo ops.",
    "He has his own rationality, and, in the past, he's been much more measured.",
    "And he could be president until 2036, in terms of what's possible for him.",
    "Ukraine is the outlier, the one that got away that he's got to bring back.",
    "Otherwise, the view then becomes, well, there's nothing we can do anyway.",
    "You've got to hope that some saner voices are forcing a recalculation.",
    "No, I don't think he's being irrational at all, from his perspective.",
    "But I don't know whether we can say if it's going to work or not.",
    "Is it because he's been stewing in his own juices for too long?",
    "We can't really be sure what exactly he is thinking right now.",
    "He obviously thought that we'd all fall apart internationally.",
    "Do you think the United States needs to squeeze Putin harder?",
    "But from Putin's point of view, that's very strong signaling.",
    "Putin's been trying to get a grip on Ukraine for years now.",
    "Is this fundamentally ideological for him, or geopolitical?",
    "We're all running around doing nothing but talk about him.",
    "But it seems like he's made his security situation worse.",
    "And does that mean that he's behaving irrationally here?",
    "The real test is going to be over a long period of time.",
    "I don't think this is going to be a short, sharp crisis.",
    "He's living in history and his narrative of history.",
    "Does he just kind of rant about his view of history?",
    "As he would say, he's got us listening to him now.",
    "That would be a mistake, to trigger off right now.",
    "We don't know exactly what he's saying internally.",
    "Clearly, it's always been for political leverage.",
    "It doesn't work with just such crude messaging.",
    "And Putin probably is banking on some of that.",
    "That's from our perspective, on the outside.",
    "He's in a different frame from where we are.",
    "And Putin explicitly says: I can buy anyone.",
    "Is there anything you think we're missing?",
    "And we already are doing plenty of things.",
    "I can't say whether he's going to invade.",
    "They cut off the gas to Ukraine in 2006.",
    "So he's going to keep the pressure up.",
    "You've sat it on meetings with Putin.",
    "We don't know how good his intel is.",
    "Email us at onpolitics@nytimes.com.",
    "We would just feed that narrative.",
    "Anything you want to see more of?",
    "And that's part of the problem.",
    "What's worked and what hasn't?",
    "He's got all of our attention.",
    "And is it the effect of Covid?",
    "We'd love to hear from you.",
    "He wants to catch us out.",
    "The Kremlin's position.",
    "What do you mean?"
  ]
}