{
  "id": 480,
  "mediaId": 25,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "Reports of sexual assault at U.S. military academies rose over the past year",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/04/17/6f0dd2c5-6b5d-40d7-bc36-1d42c19d75a9/thumbnail/620x413/9ce441c9dcae1ee889a1415c47c41fcd/gettyimages-81213767.jpg",
  "link": "https://www.cbsnews.com/news/sexual-assault-us-military-academies-pentagon-report/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eleanor Watson",
  "authorUrl": "",
  "termIds": [
    2159,
    2159,
    234,
    234,
    548,
    548,
    565,
    565,
    567,
    567,
    2945,
    2945,
    2782,
    2782,
    2546,
    2546
  ],
  "sentences": [
    "Trending News\n U.S. proposes limiting consideration of public benefits for green cards\n Russia expels U.S. embassy's second-in-command amid Ukraine tensions\n All members of Congress can attend State of the Union address, with restrictions\n Kevin McCarthy backs Liz Cheney's primary challenger Harriet Hageman\n Information warfare expert says U.S. is finally countering Russia at its own game\n Eleanor Watson\nCBS News reporter covering the Pentagon.",
    "Chip Somodevilla / Getty Images\n\"What I can tell you is at the academies we are, we are putting all the policies in place that we can encourage greater reporting because again, greater reporting of the crime will help more victims and also gives us the opportunity to hold offenders appropriately accountable.\"",
    "During the 2019-2020 year, there were only 88 reports of sexual assault, but officials said when presenting the data last year that this was not sign of a significant decrease since the number of reports was on pace to match previous years before students went home because of COVID-19.",
    "The Sexual Assault Prevention and Response office has also contracted with an outside organization to evaluate the prevention education both at West Point and the Naval Academy and see what programs work and which ones should be eliminated.",
    "There were 131 incidents of sexual assault reported at the military service academies in the 2020-2021 academic year, according to the Pentagon's annual report on sexual harassment and violence that was released Thursday.",
    "The Acting Director of the Sexual Assault Response Prevention Office Dr. Nate Galbreath said in a call with reporters there could be two reasons the number of reports has increased since 2015.",
    "One significant change is that prosecution decisions for sexual assault will shift from the academy superintendents to a special trial counsel, in an effort to eliminate any assumed bias.",
    "Naval Academy midshipmen move toward their seats before the school's graduation and commissioning ceremony at the Navy-Marine Corps Stadium May 23, 2008 in Annapolis, Maryland.",
    "During his first few weeks at the Pentagon, Defense Secretary Lloyd Austin directed the creation of an Independent Review Commission on Sexual Assault in the Military.",
    "\"Either that there was more crime to report or that people overall are encouraged and feel more confident coming forward and making those reports,\" Galbreath said.",
    "The report showed a 7% increase since the 2018-2019 academic year, the most recent year cadets and midshipmen were on campus for the full year before COVID-19.",
    "The military service academies will implement some of those recommendations in the coming years.",
    "For the 2020-2021 year, the most significant increase among the academies came at West Point.",
    "The commission finished its work in the fall of last year and issued 82 recommendations.",
    "West Point had 46 reports of sexual assault in 2020-2021, up from 23 the previous year.",
    "The Naval Academy had 33 reports of sexual assault, and the Air Force Academy had 52.",
    "It's the highest number since the Pentagon began tracking the data.",
    "That work is expected to be completed within a couple of years.",
    "Twitter"
  ]
}