{
  "id": 509,
  "mediaId": 21,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "'I reject the crazies': Liz Cheney blasts Wyoming GOP leadership over notion that she prioritizes Trump battles over reelection bid",
  "image": "https://i.insider.com/6207da543b86990018b31360?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/liz-cheney-blasts-wyoming-republican-leadership-reelection-trump-hageman-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    1147,
    1147,
    1248,
    1248,
    2087,
    2087,
    633,
    633,
    428,
    428,
    427,
    78,
    78,
    248,
    248,
    427,
    2976,
    2976
  ],
  "sentences": [
    "As Cheney, a Wyoming Republican, faces a competitive GOP primary for her House seat  compounded by censures from the Wyoming Republican Party last year and the Republican National Committee earlier this month  her diminished presence within the state party is on the minds of many of the individuals who have soured on her political career.",
    "After she thoroughly rebuked Trump's debunked claims of a stolen election, supporting the former president's impeachment for incitement of insurrection for his role on January 6, and agreeing to serve on the House select committee investigating the riot, she has become persona non grata to many Republicans throughout Wyoming.",
    "For the current congressional session, she has an even higher 96% score, voting against President Joe Biden's $1.2 trillion bipartisan infrastructure bill  which was signed into law with the support of 13 House Republicans  and the John Lewis Voting Rights Advancement Act.",
    "Last Saturday, while Republican leaders and activists were gathered at a high-profile gala in southwest Wyoming complete with a cardboard cutout of Trump, Cheney was speaking to reporters and media executives at a Wyoming Press Association event.",
    "Cheney last week in the Times interview rejected the notion that she focused on her clashes with Trump and was not seriously tending to her reelection bid, calling out state Republican leaders who have attacked her for her impeachment vote.",
    "Normally, this would be enough to endear Cheney to her state's electorate, which voted for then-President Donald Trump in the 2020 presidential election with 70% of the vote, his strongest showing in the entire country.",
    "GOP Rep. Liz Cheney last week amid her campaign for reelection said she didn't need to \"convince the crazies\" in her party over her voting record and her decisions to break with former President Donald Trump.",
    "With Trump's continued popularity among conservative grassroots activists in the state, Cheney has largely shunned party events over the past two years, according to The New York Times.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "At the GOP gala, Teresa Richards was one of the few party members who expressed support for Cheney, but she contended that the congresswoman has her share of backers.",
    "She has not attended any major Republican functions in Wyoming in over two years and has also been absent from in-person GOP events since 2020, per the Times report.",
    "According to The Times, only 31% of Wyoming Republicans had a favorable opinion of Cheney in a recent private poll, compared to 60% who viewed her unfavorably.",
    "At the GOP event, Joey Correnti IV, the chairman of the Carbon County Republican Party and the master of ceremonies, applauded the RNC's censure of Cheney.",
    "And the people right now who are in the leadership of our state party, I'm not trying to get their support because they've abandoned the Constitution.\"",
    "Scott J. Applewhite/AP\nAs Rep. Liz Cheney runs for reelection, she has been absent from recent GOP functions, The New York Times reported.",
    "\"I'm not going to convince the crazies and I reject the crazies,\" she told The New York Times in a recently published interview.",
    "Rep. Liz Cheney (R-Wyoming) is the vice-chair of the House panel investigating the January 6 insurrection at the US Capitol.",
    "Trump has enthusiastically backed Harriet Hageman, a water rights attorney, over the congresswoman in the GOP primary.",
    "She boasts a 80% lifetime rating from the Heritage Action for America, the conservative policy organization.",
    "\"This whole crowd is not representative of what's going on with Liz Cheney,\" Richards told The Times.",
    "Cheney, however, continues to make her case for why she should return to the Capitol next January.",
    "Throughout her time in office, Cheney has compiled an overwhelmingly conservative voting record.",
    "Despite Cheney's conservative voting record, her split with Trump has angered many GOP voters.",
    "For over a year, Cheney has been criticized for her support of Trump's second impeachment.",
    "The contrast between Cheney's positioning and that of her party is all the more striking.",
    "The sentiment seemingly extends to many members of the party throughout the state.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "\"I reject the notion that somehow we don't have to abide by the rule of law.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Stay up to date with what you want to know.",
    "However, Cheney has been no backbencher.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "\"She does have support.\""
  ]
}