{
  "id": 516,
  "mediaId": 193,
  "date": "2/11/2022 12:00:00 AM",
  "headline": "Donald Trump turns to endorsements to keep bending GOP to his will",
  "image": "https://www.denverpost.com/wp-content/uploads/2022/02/Election_2022_Trump_Endorsements_82784.jpg?w=1569",
  "link": "https://www.denverpost.com/2022/02/11/donald-trump-endorsements-republicans/",
  "mediaOutlet": "The Denver Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jill Colvin",
  "authorUrl": "https://www.denverpost.com/author/jill-colvin/",
  "termIds": [
    1147,
    1404,
    1434,
    2355,
    3085,
    3094,
    427,
    428,
    571,
    2672,
    2826,
    2845
  ],
  "sentences": [
    "Everyone in Georgia wants to have Trump's endorsement, but Trump's endorsement is certainly being stretched thin,? he said, We all know that when you throw stuff on the wall only some of it sticks.?\nA Trump spokesman did not respond to questions, but Trump has continued to tout his endorsement record as a measure of his political strength.",
    "The RNC also blasted the Democrat-led House committee investigating the Jan. 6 insurrection as leading a persecution of ordinary citizens engaged in legitimate political discourse.? Many Republican senators and other party officials in Washington bemoaned the move as ill-advised, both substantively and politically.",
    "Walker's commanding position is particularly notable because, after some initial hesitation and troubling allegations that could hurt him in the general election, the Republican establishment, including Senate Minority Leader Mitch McConnell, also backed him in a rare alliance with the Trump wing of the party.",
    "They've been respectful about it.?\nMeanwhile, frustrations are mounting among some Trump allies about his foot-dragging in other primaries, including Ohio's crowded Senate race, where military and overseas absentee voting is set to begin next month.",
    "Longtime Trump lieutenant Corey Lewandowski, who was removed from his role overseeing Trump's super PAC amid allegations of sexual harassment, said he's been asked to identify a strong Republican candidate, and, so far, it's not going well.",
    "We want people that are going to put America first.?\nTrump and his aides had hoped his endorsements would clear the field in many races, avoiding costly and messy primary contests that might weaken the eventual Republican nominees.",
    "In North Carolina, Trump has tried for several years to persuade Rep. Mark Walker to opt against a Senate run to clear a path for Rep. Ted Budd, whom the former president endorsed in June to the surprise of many.",
    "Walker said Trump made his pitch in person twice  once in the Oval Office in 2019, with then-Vice President Mike Pence sitting to his left and acting White House chief of staff Mick Mulvaney to his right.",
    "Trump didn't offer an endorsement but succeeded in culling the field last week when candidate Bernie Moreno announced he was dropping out after a meeting with Trump in which he asked for an endorsement.",
    "In Tennessee, some Trump allies have been seething at his endorsement of former State Department spokesperson Morgan Ortagus before she even announced her congressional candidacy.",
    "This week, he gave David Perdue another boost, orchestrating a deal for a rival to drop his campaign and instead run for Congress with the former president's coveted endorsement.",
    "In New Hampshire, where the 2016 primary helped propel his presidential campaign, Trump is struggling to find a candidate he wants to back in the closely watched Senate race.",
    "And, look, I'm not an anti-Trump guy  but with all due respect, I have to do what I believe in my heart to do.?\nBudd continues to trail the race's frontrunner, former Gov.",
    "It's that people can see mistakes can happen and he's human and he made a mistake on this one.?\nAssociated Press writer Steve Peoples contributed to this report.",
    "Pat McCrory, despite Trump's endorsement and the backing of the conservative Club for Growth's super PAC, which has poured more than $4.3 million into the race.",
    "(What you could) do in the state level, you can do for this country,'? the candidate, Vernon Jones, said in an interview recalling his conversation with Trump.",
    "George W. Bush has kept a lower profile but has supported Cheney, the daughter of his vice president and one of the lawmakers targeted by the RNC censure.",
    "It's just a mess,? said Chip Lake, a GOP strategist in the state who warned that Trump endorsing so many candidates meant some were likely to lose.",
    "In Wyoming, a slew of candidates dropped out after he announced his support for Harriet Hageman's bid against a top Trump critic, Rep. Liz Cheney.",
    "In Georgia, retired football star Herschel Walker is the leading contender for the GOP's Senate nomination after Trump encouraged him to run.",
    "The party is reeling from the Republican National Committee's decision last week to censure two lawmakers who have repeatedly crossed Trump.",
    "The primary field for Hice's seat was already crowded and the congressman, along with several Trump allies, had already made endorsements.",
    "And obviously he said I would have his support, because we share the same agenda.?\nTrump is attempting a similar strategy in other states.",
    "In Georgia, for example, Trump's effort to remove Jones from the governor's race was an attempt to prevent a potential runoff election.",
    "I don't want to give the impression that someone's outside with a crowbar, slicing my tires if we don't do the right thing,? he said.",
    "In the process, some Republicans say, Trump is injecting chaos into an election year that should otherwise be favorable to the GOP.",
    "In Ohio's Republican Senate race, one contender withdrew last week after Trump made clear he would not offer his endorsement.",
    "The moves are a reminder of the power Trump wields over the GOP on the eve of what could be a tumultuous primary season.",
    "But Trump's interventions in the primaries threaten to deepen tensions within the GOP at a particularly sensitive point.",
    "The former president remains the most popular figure with the GOP base as he considers another bid for the White House.",
    "In some instances, he began laying the groundwork for some of the arrangements when he was still in the White House.",
    "We're endorsing some fantastic people,? he said in a call-in interview to Fox Business Network on Tuesday morning.",
    "NEW YORK  Donald Trump spent months persuading a longtime ally to challenge Georgia's sitting Republican governor.",
    "But it's a very winnable seat for the GOP in 2022.?\nAnd in some races, Trump's endorsement has sent sparks flying.",
    "He isn't hesitating to leverage that pull to exact revenge on his enemies and further bend the party to his will.",
    "The move frustrated high-profile supporters who had already endorsed Robby Starbuck, a longtime Trump supporter.",
    "So it's interesting to see the reaction be so wildly in a different direction,? Starbuck said of the backlash.",
    "But in heading off that problem, he created another by pointing Jones to the race to succeed Rep. Jody Hice.",
    "Typically when President Trump makes an endorsement, people jump on  and they're generally very supportive.",
    "In North Carolina, for instance, he has pressed another Senate candidate to drop out and run for Congress.",
    "He did promise if we ran for the House that we would have the endorsement,? Walker said.",
    "The volume of Trump's endorsements and the granularity of his work, however, is notable.",
    "Trump is not the first president to engage in politics after leaving the White House.",
    "Barack Obama has endorsed slates of candidates and stumped alongside some of them.",
    "It's clear there is no standout America First candidate in the race,? he said.",
    "Walker is staying in the race, regardless of Trump's pressure.",
    "He is shopping for a Senate hopeful to back in New Hampshire.",
    "He reupped the effort at his Mar-a-Lago resort in December.",
    "Elsewhere, Trump is still searching for favored candidates.",
    "It's not that his endorsement doesn't matter.",
    "He said, Listen, you have an opportunity.",
    "That worked in some cases.",
    "Trump declined.",
    "It's a mess."
  ]
}