{
  "id": 521,
  "mediaId": 163,
  "date": "2/11/2022 12:00:00 AM",
  "headline": "Surge of out-of-state donors boost Trump critic Cheney's campaign -but cannot vote for her",
  "image": "https://www.reuters.com/resizer/jucAZf1cwjftSbg6sBjFF26_ggQ=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/E5JS2LUT5RL7BKBMVBXXIKFK5Q.jpg",
  "link": "https://www.reuters.com/world/us/surge-out-of-state-donors-boost-trump-critic-cheneys-campaign-but-cannot-vote-2022-02-11/",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Layne",
  "authorUrl": "https://www.reuters.com/authors/nathan-layne/",
  "termIds": [
    2487,
    2487,
    746,
    732,
    732,
    746,
    1147,
    1147,
    1227,
    1227,
    1248,
    1248,
    427,
    427,
    2976,
    2976
  ],
  "sentences": [
    "Last month the non-partisan Cook Political Report said Cheney faced a \"far-fetched path to renomination\" that would depend on Democrats switching parties to vote for her -- which they can do in the state's primaries -- and Hageman splitting votes with state Senator Anthony Bouchard, who along with retired military officer Denton Knapp has stayed in the race.",
    "That high profile has attracted thousands of donors ranging from celebrities to average Americans like West, all hoping to help her fend off primary challengers, including a candidate endorsed by Trump and the Republican Party, which last week broke precedent and agreed to campaign against one of its own.",
    "The Republican National Committee censured Cheney and Representative Adam Kinzinger last week for participating in the House committee investigating the Jan. 6, 2021, assault on the U.S. Capitol by Trump supporters, saying they were focused on destroying Trump rather than supporting Republicans in 2022.",
    "Bobbie Kilberg, a well-connected Virginia Republican, said more than 200 people have indicated they will attend the March 14 fundraiser she is hosting with Senator Mitt Romney as featured guest, prompting her to change the venue from her home to a hotel that could accommodate more guests.",
    "Feb 11 (Reuters) - When Idaho nurse Joan West received a fundraising mailer from U.S. Representative Liz Cheney, she saw a way to address her regret for having voted for Donald Trump in 2016 and her worry about the future of U.S. democracy: She wrote a $500 check.",
    "Robert Boatright, a professor at Clark University and an expert on congressional primaries, said that while the two major parties have in the past stopped short of supporting incumbents, the RNC helping finance Hageman's campaign would be a first.",
    "The RNC also granted a request by Wyoming party officials for a rule exception allowing the national party to provide financial and practical support to Hageman, should it choose to take the unprecedented step of using funds against an incumbent.",
    "Cheney, of Wyoming, is the most high-profile of the nine congressional Republicans that former President Trump is trying to drive from office after they rejected his false claims that his 2020 election defeat was the result of widespread fraud.",
    "Gerry Dee, a carpenter from Rochester, New York, said he gave $200 because he was worried about the country moving towards authoritarianism, and saw Cheney as one of the few Republicans standing up for democratic principles.",
    "The $7.2 million raised to date by Cheney is already a record for Wyoming's sole House district, and has given her a big financial edge over her main challenger, land-use lawyer Harriet Hageman, who has pulled in $745,000.",
    "\"We are hopeful that sanity will prevail, that there are people in Wyoming who will wake up and realize that following Donald Trump's insanity is the wrong move,\" said West, 60, an independent voter who leans Republican.",
    "But Hageman has raised a majority of funds from Wyoming residents, who unlike out-of-state donors can vote in the Aug. 16 primary, a distinction being stressed by her campaign.",
    "In contrast, Cheney's campaign has raised 96% of its dollars from outside Wyoming, according to an analysis by the nonprofit Open Secrets of itemized donations by individuals.",
    "Trump won Wyoming with 70% of the vote in 2020, and his endorsement should solidify support for Hageman even if Cheney keeps fundraising at her current pace.",
    "\"Liz is an unwavering conservative who is committed to fighting for the people of Wyoming and defending the Constitution,\" said spokesman Jeremy Adler.",
    "Reuters spoke with a dozen people who had donated in the last three months of 2021, and all said they were considering donating again.",
    "Cheney had more individual donors from inside Wyoming than Hageman as of the end of September, according to campaign filings.",
    "The winner of the primary is almost certain to sail to victory in the general election in the deeply red state.",
    "\"Liz Cheney cannot buy this race with out-of-state money,\" said Tim Murtaugh, a Hageman campaign advisor.",
    "Cheney, who voted with Trump 93% of the time, believes support for her policies will attract voters.",
    "\"A lot of people who have been quiet will stand up and vote for Liz.\"",
    "The flood of money into Cheney's campaign shows no sign of slowing.",
    "\"I'm just a working Joe, but I'm concerned about the country.\"",
    "\"In the end she's going to surprise people,\" Kilberg said.",
    "\"Nothing like that has happened before,\" Boatright said.",
    "I believe she is doing the right thing,\" said Dee, 59.",
    "Money may not prove to be the decisive factor.",
    "Cheney's supporters are not deterred.",
    "\"I'm a registered Democrat.",
    "\"We wanted to help her.\""
  ]
}