{
  "id": 526,
  "mediaId": 157,
  "date": "2/11/2022 12:00:00 AM",
  "headline": "Trump is fuming over Scooter Libby attending a Liz Cheney fundraiser: report",
  "image": "https://www.rawstory.com/media-library/trump-is-even-more-whiny-dishonest-and-self-absorbed-than-before-he-lost-to-biden-new-yorker-analysis.jpg?id=24495927&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/donald-trump-2656638542/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Wright",
  "authorUrl": "https://www.rawstory.com/u/johnwright",
  "termIds": [
    643,
    723,
    945,
    982,
    1147,
    1248,
    1748,
    3085,
    3094,
    2888
  ],
  "sentences": [
    "Hopefully, this full pardon will help rectify a very sad portion of his life.?\nAt the time, Democrats accused Trump of using his pardon of Libby to send a message to aides who were facing charges in special counsel Robert Mueller's Russia investigation.",
    "\"Libby was never charged with leaking, but was indicted in 2005 on charges of obstruction of justice, perjury and making false statements to investigators, largely for denying his contacts with the media about Plame,\" Politico reported.",
    "Liz Cheney, of course, is a Trump nemesis who voted to impeach him for inciting the Capitol insurrection  and now serves as vice chair of the House Select Committee investigating Jan. 6.",
    "On Friday night, the New York Times' Maggie Haberman reported: \"Trump has been complaining loudly to people that SCOOTER LIBBY, who he pardoned, is attended a fundraiser for Liz Cheney.",
    "Donald Trump reportedly is upset with Lewis \"Scooter\" Libby, whom the former president pardoned in 2018, for attending a campaign fundraiser for Rep. Liz Cheney (R-WY).",
    "And he has asked if he could rescind the pardon.https://twitter.com/maggienyt/status/1492318197416083457\\u00a0\\u2026\n Josh Dawsey (@Josh Dawsey) 1644633723",
    "While serving as Dick Cheney's chief of staff, Libby was caught up in the investigation into the leak of the identity of CIA officer Valerie Plame.",
    "In a statement about Libby's pardon, Trump said: I don't know Mr. Libby, but for years I have heard that he has been treated unfairly.",
    "Responding to Haberman's report, the Washington Post's Josh Dawsey reported that Trump \"has asked if he could rescind the pardon.\"",
    "Libby served as chief of staff to Congresswoman Cheney's father, former vice president Dick Cheney.",
    "He has indicated he sees it as somehow disloyal, per people familiar with the discussions.\"",
    "Trump has endorsed Cheney's opponent in the GOP primary, Harriet Hageman."
  ]
}