{
  "id": 602,
  "mediaId": 223,
  "date": "2/5/2022 12:00:00 AM",
  "headline": "Rule Change Means Liz Cheney's Primary Challenger Could Receive Financial Support",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/209/583f618e-85a4-42dc-ad1b-cddf82124c46.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/02/05/rule-change-means-liz-cheneys-primary-challenge-could-receive-financial-support-f-n2602882",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    982,
    1147,
    1248,
    1335,
    1685,
    2214,
    3085,
    3094,
    422,
    427,
    428,
    633
  ],
  "sentences": [
    "11\nIn addition to Friday's formal censure at the party's winter meeting in Salt Lake City, the RNC also made plans to fund a primary challenge against Cheney in Wyoming  after state Republican leaders passed a special rule to recognize Harriet Hageman, her challenger, as the party's presumptive nominee.",
    "Dawsey and Sonmez included a statement from McDaniel in their report that the language to do with \"legitimate political discourse\" refers to \"ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol.\"",
    "However, as the full context of the language makes clear, the censure was about Cheney and Kinzinger causing a distraction for the Party's efforts to win seats in 2022 and 2024, and working against the interests of Republicans and the Republican Party.",
    "Source: Jim Bourg/Pool via AP\nThe RNC on Friday made the move to censure Reps. Adam Kinzinger (IL) and Liz Cheney (WY), Leah reported, the two Republican members who have been particularly critical of former President Donald Trump.",
    "She and Kinzinger, who is also on the committee and was subsequently added by House Speaker Nancy Pelosi (D-CA) after she was, were the only two Republican members to vote in favor of the select committee.",
    "The national party could send money, volunteers, data and other things to the Wyoming GOP, now the rule has passed, and the state party could then send the resources to use against Cheney.",
    "Not only were the members censured, but the RNC may be paving the way to fund Cheney's primary opponent, Harriet Hageman, whom Trump endorsed last September, thanks to a rules change.",
    "As a report by Josh Dawsey and Felicia Sonmez for The Washington Post indicated, there's also a potential rule change in place as it pertains to Rule No.",
    "Last February, the state party ensured Cheney for her vote in favor of articles of impeachment against Trump, an effort Cheney was particularly vocal in.",
    "Headlines were quick to declare that the RNC censure was about referring to the January 6 Capitol riot a matter of \"legitimate political discourse.\"",
    "Cheney was also ousted last May as the chair of the House Republican Conference and replaced with Rep. Elise Stefanik, a Republican from New York.",
    "[RNC Chairwoman Ronna] McDaniel declined to say what the party would actually do in Wyoming because she said no decisions had yet been made.",
    "Kinzinger, whose House seat was lost to partisan redistricting efforts from Illinois lawmakers, is retiring from Congress.",
    "This includes opinion articles for The Washington Post that have lamented the censure and condemned it in strong terms.",
    "By the Senate voted in Trump's second impeachment trial, he had already left office and Joe Biden was the president.",
    "The spotlight is not so much on RNC Chairwoman Ronna McDaniel, but on what the Wyoming Republican Party does.",
    "The censure is a more ceremonial move, while the rule change could lead to broader ramifications in the race.",
    "Cheney has far outraised Hageman, with almost $5 million on hand, while Hageman has less than $500,000.",
    "Cheney also went on to vote for the January 6 select committee which she now serves on as vice-chair.",
    "The chair, committeeman, and committeewoman had all signed onto a letter in accordance with Rule No.",
    "Not only that, but Cheney has been particularly successful in her fundraising efforts thus far.",
    "Cheney and Kinzinger are also facing issues in Congress with their fellow Republican members.",
    "The report also cited Doug Heye, a former communications director for the Republican Party.",
    "The Houe Freedom Caucus sought to have them removed from their committees last September.",
    "This is not the first sign of discourse between the Wyoming Republican Party and Cheney.",
    "As Dawsey and Sonmez highlighted in their reporting, Hageman has struggled financially.",
    "He may run for another elected position, though, including for president in 2024.",
    "\"The rule allows them to send money, which would not be insignificant,\" he said.",
    "11(a) ruling goes along with the Republican Party in Cheney's state.",
    "\"Everything else is fairly insignificant besides the money.\"",
    "Thus, the RNC and McDaniel supporting the Rule No.",
    "11(a) to support Hageman in the primary.",
    "..."
  ]
}