{
  "id": 620,
  "mediaId": 112,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "A defining moment': Kinzinger says Republican National Committee censure of him and Cheney shows McCarthy's weakness as House leader",
  "image": "https://images.mktw.net/im-376179?width=700&size=1.5005861664712778&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/republican-national-committee-censures-cheney-and-kinzinger-after-backing-away-from-effort-to-oust-them-from-the-party-01644002823",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    1098,
    1248,
    1609,
    2087,
    2214,
    3085,
    3094,
    427,
    428,
    562,
    2892
  ],
  "sentences": [
    "Veteran Republican strategist Brendan Buck, a former aide to thenHouse speakers John Boehner and Paul Ryan, said in an interview with MSNBC on Friday that the censure vote was further evidence that the RNC is no longer functioning as a political party but has become a Donald Trump fan club.?\nRNC members also voted in favor of a rule change that would prohibit their candidates from participating in debates organized by the Commission on Presidential Debates.",
    "Trump and other GOP members were incensed when Kinzinger and Cheney accepted House Speaker Nancy Pelosi's invitation to join the Democratic-led House committee, providing the Jan. 6 panel a measure of bipartisan credibility after Minority Leader Kevin McCarthy withdrew his nominees following the speaker's rejection of two who had voted to overturn Biden's electoral victory and had cast doubt on the investigation into Jan. 6.",
    "From the archives (November 2021): Wyoming Republicans vote that Liz Cheney is no longer a member of their party\nThat, said Michael Steele, former lieutenant governor of Maryland who served as Republican National Committee chairman from 2009 to 2011, was beyond despicable.?\nSteele, speaking on MSNBC at midday Monday, said the censure showed depravity? and capitulation to the whims of Trump.",
    "SALT LAKE CITY (AP)  Republican Party officials on Friday voted to punish GOP Reps. Liz Cheney and Adam Kinzinger for their work on the House committee investigating the Jan. 6 insurrection and advanced a rule change that would prohibit candidates from participating in debates organized by the Commission on Presidential Debates.",
    "Sen. Mitt Romney of Utah, a former Republican presidential candidate and governor of Massachusetts, tweeted that he considered it shameful to censure persons of conscience, who seek truth in the face of vitriol,? adding that [h]onor attaches? to Cheney and Kinzinger for pursuing the investigation at great personal cost.",
    "Kinzinger, who is not running for re-election, said Monday morning on MSNBC that the censure of him and Cheney by the RNC was a defining moment? for the party and for Republican members of Congress and reflective of unprecedented weakness on the part of Republican House leader McCarthy.",
    "The censure resolution accuses Kinzinger and Cheney of participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse?  a striking description of the violent attack on the Capitol by supporters of then-President Donald Trump.",
    "The RNC's censure resolution appears to characterize as legitimate political discourse' the attack by Trump supporters on the Capitol as lawmakers met last January in a joint session to certify the presidential election victory of Democrat Joe Biden.",
    "He added that, while the censure move was not particularly surprising, the language of the document, in which the RNC characterized the Jan. 6 committee as engaging in a crackdown on legitimate political discourse,? was.",
    "We are not walking away from debates, we are walking away from the commission on presidential debates because it's a biased monopoly that does not serve the best interests of the American people,? she added.",
    "On Thursday, members of an RNC subcommittee decided to advance the censure resolution against the pair instead of calling for their expulsion from the party.",
    "Restoring faith in our elections means making sure our candidate can compete on a level playing field,? RNC chair Ronna McDaniel said in a speech on Friday.",
    "Cheney, of Wyoming, and Kinzinger, of Illinois, are the only two Republicans on the House committee investigating the Jan. 6, 2021, attack on the Capitol.",
    "Cheney tweeted an image from the Jan. 6 siege after learning of the censure, stating that the image shown does not depict legitimate political discourse.",
    "GOP officials took a voice vote to approve censuring Cheney and Kinzinger at the Republican National Committee's winter meeting in Salt Lake City.",
    "The institution has been a staple of presidential elections for three decades, but Republicans have of late decried the format as biased.",
    "The move to withhold support for Cheney could benefit her primary opponent, Harriet Hageman, who has been endorsed by Trump.",
    "It also calls on the party to no longer support Cheney and Kinzinger as Republicans, accusing them of sabotage.",
    "McDaniel is a niece of Sen. Romney.",
    "Wyoming's primary is in August.",
    "MarketWatch contributed."
  ]
}