{
  "id": 651,
  "mediaId": 188,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Republican National Committee censures Reps. Liz Cheney and Adam Kinzinger, will 'immediately cease any and all support of them as members of the Republican Party'",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTI0ODI1My9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY4MTQzNTU4N30.htKTe3QelrFmjo65DVNNayqtbtpeZ_dpkzR75U0LbZw/img.jpg?width=1245&quality=85&coordinates=0%2C71%2C0%2C36&height=700",
  "link": "https://www.theblaze.com/news/republican-national-committee-censures-reps-liz-cheney-and-adam-kinzinger-shall-immediately-cease-any-and-all-support-of-them-as-members-of-the-republican-party",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Nitzberg",
  "authorUrl": "https://www.theblaze.com/u/alexnitzberg",
  "termIds": [
    1147,
    1248,
    2214,
    2402,
    3085,
    3094,
    146,
    427,
    428,
    545,
    562
  ],
  "sentences": [
    "It declares that they \"have engaged in actions in their positions as members of the January 6th Select Committee not befitting Republican members of Congress, which include the Committee's disregard for minority rights, traditional checks and balances, due process, and adherence to other precedent and rules of the U.S. House and which seem intent on advancing a political agenda to buoy the Democrat Party's bleak prospects in the upcoming midterm elections.\"",
    " Allan Smith (@Allan Smith) 1643998011\nThe resolution declares that the RNC \"formally censures\" the the two lawmakers \"and shall immediately cease any and all support of them as members of the Republican Party for their behavior which has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic, and is inconsistent with the position of the Conference.\"",
    "The Republican National Committee voted on Friday to censure Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois, two outspoken critics of former President Donald Trump who are the only Republicans serving on the House select committee tasked with investigating the Jan. 6 Capitol riot.",
    "The resolution says that the lawmakers \"are participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse, and they are both utilizing their past professed political affiliation to mask Democrat abuse of prosecutorial power for partisan purposes.\"",
    "\"The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,\" Cheney had said in a statement.",
    "\"Cheney and Kinzinger chose to join Pelosi in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol,\" RNC chair Ronna McDaniel tweeted.",
    "\"Rather than focus their efforts on how to help the American people, my fellow Republicans have chosen to censure two lifelong Members of their party for simply upholding their oaths of office.",
    "Cheney and Kinzinger were among the 10 House Republicans who voted in favor of impeaching then-President Trump in the wake of the Jan. 6 episode.",
    "\"I'm a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "They've allowed conspiracies and toxic tribalism hinder their ability to see clear-eyed,\" Kinzinger had said in a statement.",
    "This is not 'legitimate political discourse,'\" Cheney tweeted in a post Friday that also included a video.",
    "Trump has endorsed Harriet Hageman, a challenger seeking to defeat Cheney in the Republican primary.",
    "The censure resolution and several other resolutions were all approved together via a voice vote.",
    "Unfortunately, this committee has gone well beyond the scope of the events of that day.\"",
    "While Kinzinger is not seeking re-election, Cheney is pursuing another term in office.",
    "Cheney was ousted from her role as House Republican conference chair last year.",
    "\"I have repeatedly condemned violence on both sides of the aisle.",
    "Both lawmakers had already issued statements prior to Friday.",
    "I will never stop fighting for our constitutional republic.",
    "History will be their judge.",
    "\"This was January 6th.",
    "No matter what.\""
  ]
}