{
  "id": 660,
  "mediaId": 129,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "G.O.P. Declares Jan. 6 Attack Legitimate Political Discourse'",
  "image": "https://int.nyt.com/data/documenttools/c4ec538925a0d2d6/1/output-1.png",
  "link": "https://www.nytimes.com/2022/02/04/us/politics/republicans-jan-6-cheney-censure.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2214,
    2214,
    2349,
    2349,
    1248,
    1248,
    1434,
    1434,
    1147,
    1147,
    1685,
    1685,
    2782,
    2782,
    2661,
    2661,
    2959,
    2959
  ],
  "sentences": [
    "I will continue to focus my efforts on standing for truth and working to fight the political matrix that's led us to where we find ourselves today.?\nThe resolution spoke repeatedly of party unity as the goal of censuring the lawmakers, saying that Republicans' ability to focus on the Biden administration was being sabotaged? by the actions and words? of Ms. Cheney and Mr. Kinzinger, which indicate they support Democrat efforts to destroy President Trump more than they support winning back a Republican majority in 2022.?\nNormally, the party stays out of primary fights, but the resolution will make it easier for the Republican apparatus to abandon Ms. Cheney and throw its weight and money behind her main G.O.P.",
    "It came days after Mr. Trump suggested that, if re-elected in 2024, he would consider pardons for those convicted in the Jan. 6 attack and for the first time described his goal that day as subverting the election results, saying in a statement that Vice President Mike Pence could have overturned the election.?\nOn Friday, Mr. Pence pushed back on Mr. Trump, calling his assertion wrong.?\nI had no right to overturn the election,? Mr. Pence told the Federalist Society, a conservative legal organization, at a gathering in Florida.",
    "It declares that the party shall immediately cease any and all support of? both lawmakers as members of the Republican Party for their behavior, which has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic, and is inconsistent with the position of the conference.?\nMr. Kinzinger has already announced he will not seek re-election, as have some other House Republicans who voted to impeach Mr. Trump for inciting the attack on the Capitol.",
    "On Friday, the party went further in a resolution slamming Ms. Cheney and Mr. Kinzinger for taking part in the House investigation of the assault, saying they were participating in persecution of ordinary citizens engaged in legitimate political discourse.?\nAfter the vote, party leaders rushed to clarify that language, saying it was never meant to apply to rioters who violently stormed the Capitol in Mr. Trump's name.",
    "They chose to join Nancy Pelosi in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol.?\nBut the censure, which was carefully negotiated in private among party members, made no such distinction, nor is the House committee investigating the attack examining any normal political debate.",
    "It is a scandal that historians will be aghast at, to think that a major political party would be denouncing Liz Cheney for standing up for the Constitution and not saying anything about Donald Trump's involvement in the insurrection.?\nIn his own defense, Mr. Kinzinger said: I have no regrets about my decision to uphold my oath of office and defend the Constitution.",
    "The Republican National Committee's voice vote to censure Representatives Liz Cheney of Wyoming and Adam Kinzinger of Illinois at its winter meeting in Salt Lake City culminated more than a year of vacillation, which started with party leaders condemning the Capitol attack and Mr. Trump's conduct, then shifted to downplaying and denying it.",
    "WASHINGTON  The Republican Party on Friday officially declared the Jan. 6, 2021, attack on the Capitol and events that led to it legitimate political discourse,? and rebuked two lawmakers in the party who have been most outspoken in condemning the deadly riot and the role of Donald J. Trump in spreading the election lies that fueled it.",
    "Larry Hogan of Maryland, also a Republican, who called Friday a sad day for my party  and the country.?\nRepublican National Committee members defended the measure, describing people who have been questioned by the Jan. 6 committee as victims in a broader Democratic effort to keep focus on the attack at the Capitol.",
    "The investigation is a de facto Democrat-only investigation increasingly unmoored from congressional norms.?\nThe Jan. 6 committee, which has seven Democratic members, has interviewed more than 475 witnesses, the vast majority of whom either volunteered to testify or agreed to without a subpoena.",
    "The day's events, which were supposed to be about unity, only served to highlight Republicans' persistent division over Mr. Trump's attempt to overturn the 2020 election, as their leaders try to move forward and focus attention on what they call the failings of the Biden administration.",
    "The nominal Republicans on the committee provide a pastiche of bipartisanship, but no genuine protection or due process for the ordinary people who did not riot being targeted and terrorized by the committee,? said Richard Porter, a Republican National Committee member from Illinois.",
    "The Republican Party is so off the deep end now that they are describing an attempted coup and a deadly insurrection as political expression,? said Representative Jamie Raskin, Democrat of Maryland and a member of the special House committee investigating the Capitol attack.",
    "Representative Dan Crenshaw, Republican of Texas, called it dumb stuff,? while Representative Mark Green, Republican of Tennessee, lamented the distraction from this abysmal administration's record.?\nDemocrats, however, were incensed at the resolution's language.",
    "The party's far-right flank has long agitated to boot Ms. Cheney and Mr. Kinzinger out of the House Republican Conference for agreeing to serve on the panel, a push that Representative Kevin McCarthy of California, the minority leader, has tried to brush aside.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.?\nHe did not mention that the party chairwoman who presided over the meeting and orchestrated the censure resolution, Ms. McDaniel, is his niece.",
    "William J. Palatucci, a Republican National Committee member from New Jersey who said he opposed the resolution, said those changes were made behind closed doors.? The final language was officially circulated to committee members early Friday morning.",
    "We need to move on from that whole discussion and, frankly, move forward and get the House back in 2022,? said Representative Mike Garcia, a California Republican facing a difficult re-election campaign in a newly configured district.",
    "The letter allows the Republican National Committee to send resources to the Wyoming branch of the party to spend on Ms. Hageman's behalf  essentially designating her as the party's presumptive nominee.",
    "The censure resolution was watered down from an initial version that called directly for the House Republican Conference to expel? Ms. Cheney and Mr. Kinzinger without delay.? That demand was dropped.",
    "In approving it and opting to punish two of its own, Republicans seemed to embrace a position that many of them have only hinted at: that the assault and the actions that preceded it were acceptable.",
    "It was the latest and most forceful effort by the Republican Party to minimize what happened and the broader attempt by Mr. Trump and his allies to invalidate the results of the 2020 election.",
    "The censure was also condemned by Senator Bill Cassidy, Republican of Louisiana, who, like Mr. Romney, voted to remove Mr. Trump from office for inciting insurrection on Jan. 6, and Gov.",
    "Ms. Cheney, who faces an uphill battle in her re-election bid against a Republican Party aligned with Mr. Trump, said party leaders have made themselves willing hostages? to Mr. Trump.",
    "And the formal censure, approved by the state party chairs and committee members who make up the Republican National Committee, is sure to stir up those efforts again.",
    "Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol,? Senator Mitt Romney, Republican of Utah, wrote on Twitter.",
    "Earlier this week, the Wyoming delegation to the Republican National Committee submitted a so-called Rule 11? letter, formalizing party support for Ms. Hageman.",
    "Most House Republicans tried to ignore the actions of the party on Friday, refusing to answer questions or saying they had not read the censure resolution.",
    "It has no prosecutorial powers, and is charged with drawing up a report and producing recommendations to prevent anything similar from happening again.",
    "No matter what.?\nMs. Cheney has a commanding financial advantage over Ms. Hageman, according to federal campaign finance reports released this week.",
    "The designations are common in Republican politics, but typically are used to support incumbents who may be facing token primary challengers.",
    "Liz Cheney and Adam Kinzinger crossed a line,? Ronna McDaniel, the Republican National Committee chairwoman, said in a statement.",
    "I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump,? she said.",
    "Ms. Cheney entered 2022 with nearly $5 million in campaign cash, while Ms. Hageman reported just $380,000.",
    "More than a year later, the party is still wrestling with how much criticism and dissent it will tolerate.",
    "However, the language condemning the attack on legitimate political discourse? was then added.",
    "The existence of the letter was reported by The Washington Post.",
    "I will never stop fighting for our constitutional republic.",
    "Ms. Cheney, however, has vowed to stand for re-election.",
    "He called it cancel culture at its worst.?",
    "challenger, Harriet Hageman.",
    "History will be their judge."
  ]
}