{
  "id": 666,
  "mediaId": 43,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Nat'l GOP is funding this woman in Wyoming primary against Liz Cheney, whom the party condemned",
  "image": "https://images.dailykos.com/images/1028474/large/ScreenShot2022-01-19at3.22.09PM.png?1642634556",
  "link": "https://www.dailykos.com/story/2022/2/4/2078693/-Nat-l-GOP-funding-this-woman-in-Wyoming-primary-against-Liz-Cheney-whom-the-party-condemned",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    891,
    982,
    1248,
    2087,
    2214,
    3085,
    3094,
    146,
    427,
    428,
    2976
  ],
  "sentences": [
    "In her 2018 campaign for governor, Hageman labeled one opponent as anti-coal? and obsessed with so-called green energy.? In a 2020 column in the online Cowboy State Daily, she wrote in what is practically a parody of Republican views, While we have been offshoring our industries and jobs, our own neighboring states have blocked Wyoming from accessing foreign markets to sell clean coal and actually improving air quality for millions of people around the world.?\nPresident Biden's goal of preserving 30% of the nation's land by 2030 is anathema to Hageman, who said in an interview on the \"Working Ranch Radio Show,\" \"The federal government under Joe Biden and radical Democrats are intent on taking over and federalizing our private property rights under the auspices or claim of combating climate change.",
    "The party said the behavior of Cheney and Kinzinger has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic.? [...]\nIn addition to Friday's formal censure at the party's winter meeting in Salt Lake City, the RNC also made plans to fund a primary challenge against Cheney in Wyoming  after state Republican leaders passed a special rule to recognize Harriet Hageman, her challenger, as the party's presumptive nominee\nThis short commentary on Hageman appeared previously as part of the Jan. 20 Earth Matters:\n Harriet Hageman\nRight-wing land-use attorney Harriet Hageman is keen to export clean coal? from Wyoming and export Rep. Liz Cheney back to the private sector in the state's Republican primary next August.",
    "Myron Ebell, the prominent climate science denier chosen to lead Trump's Environmental Protection Agency, said Hageman would follow in the footsteps of really strong people? on the committee like GOP Reps. Tom McClintock of California, Matt Rosendale of Montana, Lauren Boebert of Colorado, and Paul Gosar of Arizona, who Democrats last year stripped of his committee assignments.",
    "As you may have heard, the Republican National Committee has censured Reps. Liz Cheney and Adam Kinzinger for daring to serve on the House committee investigating the violent mob that invaded the Capitol 13 months ago in an attempt to overturn the election of Joe Biden to the presidency in favor of the loser, Donald J. Trump.",
    "The former occupant of the White House has endorsed Hageman, who in 2016 had called him racist and xenophobic,? but now says that he was the greatest president of my lifetime.? Only five Democrats have served as Wyoming's lone congressional representative since it became a state in 1890.",
    "This is a U.N.-driven, unlawful land grab that would be devastating to the economy in this country and dramatically alter the very nature of private property rights and who and what the United States is.\"",
    "Josh Dawsey and Felicia Sonmez report:\nThe censure resolution passed overwhelmingly on a voice vote without debate or discussion, with the whole process taking about one minute.",
    "Leaving the committee, Hageman says, indicates bad priorities on Cheney's part when she should be promoting the state's oil, gas, and coal industry on the committee.",
    "One of Hageman's chief complaints is that Cheney is no longer on the House Natural Resources Committee, where the Congresswoman served in her first two terms.",
    "A December poll by a Republican consulting group showed Cheney with just 18.6% of the vote, putting her in second place behind Hageman with 38.6%.",
    "Cheney's popularity plummeted among the state's strongly GOP electorate after she voted with 10 other House Republicans to impeach Donald Trump.",
    "Of the four candidates opposing Cheney, Hageman, who placed third in her 2018 primary bid to run for governor, is the strongest.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "The last was Teno Roncalio, who left office in 1978.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Cue the black helicopters.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}