{
  "id": 672,
  "mediaId": 238,
  "date": "2/3/2022 12:00:00 AM",
  "headline": "Opinion: The Republican Party formally declares that truth is fiction and patriots are traitors",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/04/liz-cheney-republicans-censure-orwellian/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1434,
    2214,
    2459,
    2475,
    3085,
    3094,
    427,
    428,
    562,
    2782,
    2945,
    2953
  ],
  "sentences": [
    "Members of the Editorial Board and areas of focus: Deputy Editorial Page Editor Karen Tumulty; Deputy Editorial Page Editor Ruth Marcus; Associate Editorial Page Editor Jo-Ann Armao (education, D.C. affairs); Jonathan Capehart (national politics); Lee Hockstader (immigration; issues affecting Virginia and Maryland); David E. Hoffman (global public health); Charles Lane (foreign affairs, national security, international economics); Heather Long (economics); Molly Roberts (technology and society); and Stephen Stromberg (elections, the White House, Congress, legal affairs, energy, the environment, health care).",
    "The investigation, the censure resolution claimed, is a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse.?\nWhen in recent memory has the House been more threatened as when members had to barricade the doors to the chamber against a dangerous mob screaming for their blood?",
    "By asserting, as their censure resolution did Friday, that truth is fiction and patriots are turncoats, they have exposed the dark, festering core of what their party is becoming: an unruly revolt against fact and reason that betrays the principles leaders, such as former president Ronald Reagan, championed.",
    "By insisting on a full probe and accountability for one of the country's lowest moments since the Civil War, Ms. Cheney is waging what, within her party, is an increasingly lonely battle against those seeking to pervert the U.S. system of government for personal gain.",
    "The Post's View | About the Washington Post Editorial Board\nEditorials represent the views of The Washington Post as an institution, as determined through debate among members of the Editorial Board, based in the Opinions section and separate from the newsroom.",
    "The Orwellian censure resolution accuses Ms. Cheney and fellow GOP dissident Rep. Adam Kinzinger (R-Ill.) of engaging in behavior destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic.? Her transgression?",
    "Many Republicans want to focus on other issues, such as inflation, the economy and how to run schools during the covid-19 pandemic, hoping that voters will forget Jan. 6 and hand them the House majority in this year's midterm elections.",
    "Co-leading the House committee investigating the Capitol invasion, an act of political violence Mr. Trump inspired when he was a sitting president charged with protecting the nation from enemies foreign and domestic.",
    "Since Jan. 6, 2021, senior party officials have gone from acknowledging Mr. Trump's guilt to punishing those, such as Ms. Cheney, who continue to speak up about a tragedy that no American should forget.",
    "It remains to be seen what punishment former vice president Mike Pence will endure following a Friday speech in which he rebuked Mr. Trump's claims that he could have overturned the election on Jan. 6.",
    "She rightly believes commitment to democracy should override partisan allegiances and that policy preferences on issues stand insignificant next to commitment to the constitutional order.",
    "and moved to aid her primary opponent, Harriet Hageman, who is former president Donald Trump's preferred candidate for Wyoming's lone congressional seat.",
    "Republicans assailing Ms. Cheney and siding with Mr. Trump and his lies about the 2020 election are the ones who imperil the republic.",
    "At the Republican National Committee's winter meeting in Salt Lake City, party leaders censured Rep. Liz Cheney (R-Wyo.)",
    "Over the past year, Republican leaders have chosen a different course, putting in their lot with the insurrectionists.",
    "Republicans have started their election year by revealing what they really stand for.",
    "The Republican Party on Friday took an official stand  against truth and democracy.",
    "Ms. Cheney refused to let them change the subject.",
    "Voters must remember this moment in November."
  ]
}