{
  "id": 699,
  "mediaId": 376,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "House GOP feels no fundraising backlash for opposing electors",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/02/mccarthy_BC_229_072921.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/02/01/house-gop-feels-no-fundraising-backlash-for-opposing-electors/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Ackley\nStephanie Akin\nRyan Kelly",
  "authorUrl": "https://www.rollcall.com/author/stephanie-akin/",
  "termIds": [
    2475,
    2510,
    2475,
    2510,
    1147,
    1030,
    1030,
    815,
    815,
    1248,
    1248,
    1332,
    1332,
    1147,
    1609,
    1609,
    562,
    562,
    428,
    428
  ],
  "sentences": [
    "Miller, a member of the House Freedom Caucus, faced a backlash for comments at a 2021 rally invoking Adolf Hitler's message that whoever has the youth has the future.?\nDavis especially outpaced Miller in money raised from PACs, pulling in $210,000 during the fourth quarter compared to $27,000 for Miller.",
    "Instead, McKinley  who was attacked in a news release from Trump for voting for the bipartisan infrastructure package that both of his state's senators, Republican Shelley Moore Capito and Democrat Joe Manchin III, supported  raised more than five times Mooney's total for the fourth quarter.",
    "In the West Virginia race, Mooney had more money in the bank than McKinley when the two were drawn into the same district in October, and he bragged when he got Trump's endorsement a month later that it would basically make it impossible? for McKinley to wage a primary against him.",
    "He was drawn into the same district as his Republican colleague Bill Huizenga, who had represented one of the state's most conservative districts but now is running on turf that would have backed Trump over Biden by just 4 percentage points in 2020, according to Inside Elections.",
    "Indeed, more than 125 Republican objectors combined took in more than $51 million more last year than they did in 2019, much of that driven by enormous hauls of party leaders and lightning rods for political attention such as Rep. Marjorie Taylor Greene of Georgia.",
    "And two House incumbents with Trump's backing who are battling GOP House colleagues in primaries  Illinois Rep. Mary Miller and West Virginia Rep. Alex X. Mooney  were outraised by Reps. Rodney Davis and David McKinley, who did not object to the electors.",
    "Upton, who has developed a strong local following in the almost three decades he has served in Congress, raised $726,000 to Huizenga's $409,000 in the fourth quarter, bringing his total fundraising to $1.6 million to Huizenga's $1.2 million.",
    "Cheney, who not only opposed Trump on electoral votes but voted to impeach him and is co-chairing a select committee investigating the Jan. 6 riot, raised more than $2 million in the quarter and had $4.7 million in her account as of Dec. 31.",
    "Heading into 2022, when the GOP needs to flip just five seats to take the House majority, Republican electoral objectors had nearly $140 million in their campaign accounts, 50 percent more than at the same point in the last cycle.",
    "House Republicans who voted against certifying Electoral College results for President Joe Biden last Jan. 6 did not face any overall backlash from campaign contributors in 2021, a CQ Roll Call analysis of new disclosures shows.",
    "Still, some lawmakers who voted against the electors saw some dramatic dips in their fundraising numbers, including Ohio Rep. Steve Chabot, who hauled in about $800,000 in all of 2021 compared with $1.5 million in all of 2019.",
    "While Trump-backed candidates led the pack in some Senate nomination races, such as Rep. Ted Budd in North Carolina and Herschel Walker in Georgia, others, such as Kelly Tshibaka in Alaska and Mo Brooks in Alabama, did not.",
    "State Rep. Stephen Carra, who had Trump's endorsement for a primary challenge against Upton in his old 6th District, announced this week that he would also run in the 4th District primary and called on Upton to drop out.",
    "Former President Donald Trump's backing, however, does not automatically translate to fundraising dominance in competitive primaries, an analysis of candidate filings with the Federal Election Commission found.",
    "The California Republican's support from small-dollar donors, those giving less than $200, rose to $1.6 million in the last three months of 2021, compared with $1.1 million during the same period in 2019.",
    "McCarthy's donations from PACs, including those run by corporations, declined slightly in the fourth quarter to $113,000 from the same period in 2019, when he reported raising about $130,000 from PACs.",
    "Members facing members\nTrump's influence appears not to have helped his preferred candidates in the three primaries where Republican House members are likely facing each other because of redistricting.",
    "The two are running in the state's new 15th District, a solidly Republican district that encompasses about 28 percent of the area that Davis currently represents, and in which Miller does not live.",
    "Rep. Elise Stefanik of New York, who replaced Wyoming Rep. Liz Cheney as chairwoman of the House Republican Conference, raised $5.1 million total for 2021, compared with $4.6 million in 2019.",
    "Mooney also is also under investigation by the House Ethics Committee after an Office of Congressional Ethics report found he had spent thousands of campaign dollars on personal expenses.",
    "Davis, who voted to certify electors and supported the Jan. 6 commission investigating the assault on the Capitol, raised $421,000 in the fourth quarter, compared to Miller's $165,000.",
    "They use multiple funds including leadership PACs and joint-fundraising committees to collect and distribute campaign cash to colleagues and the party's overall efforts.",
    "Big bankrolls\nHouse Minority Leader Kevin McCarthy reported raising $3.8 million in the fourth quarter of 2021, compared with $2.5 million in the fourth quarter of 2019.",
    "In Michigan, Rep. Fred Upton, one of 10 Republicans who voted to impeach Trump after the Jan. 6 uprising, has not said whether he is running again for reelection.",
    "Miller is doing better among donors giving amounts of $200 or less, raising almost $92,000 during the quarter, compared to Davis' $59,000.",
    "Greene raised more than $10.1 million last year, including $1.2 million from people giving $200 or less in the fourth quarter alone.",
    "Colorado Rep. Lauren Boebert raised $3.8 million last year, and North Carolina Rep. Madison Cawthorn raised $3.1 million.",
    "Congressional leaders' fundraising for their own campaign accounts, though, is just one piece of the fundraising picture.",
    "Mooney has touted his unwavering? support for Trump, but McKinley backed Trump's position more often during House votes.",
    "Pennsylvania Rep. Mike Kelly also saw a decline, raising about $475,000 in 2021, compared with $1.3 million in 2019.",
    "Mooney still leads in cash on hand, with nearly $2.4 million in his account on Dec. 31 to McKinley's $1.6 million.",
    "He took a hit in PAC donations, raising just shy of $50,000 from PACs in 2021 versus more than $130,000 in 2019.",
    "A Trump-backed opponent, Harriet Hageman, raised $443,000 during the quarter and had $381,000 on hand Dec. 31.",
    "Some of Cheney's sharpest critics, and the loudest Trump supporters, saw significant fundraising boosts.",
    "After corporate and business PACs took a pause, particularly in donations, most restarted their giving.",
    "Upton finished the quarter with $1.5 million in his account, about $350,000 more than Huizenga.",
    "McKinley raised $1.1 million from October through December, compared to $200,000 for Mooney.",
    "For 2021 overall, his campaign brought in $15.4 million, up from about $8 million in 2019.",
    "Davis' total fundraising in 2021 was $1.8 million, more than double Miller's $787,000.",
    "He raised $135,000 in the fourth quarter, bringing his total receipts to $359,000.",
    "Mary Ellen McIntire contributed to this report.",
    "But Carra has some catching up to do."
  ]
}