{
  "id": 700,
  "mediaId": 195,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "RNC to debate Trump ally's resolution to expel Cheney, Kinzinger: report",
  "image": "https://cdn.jwplayer.com/v2/media/QYRRTcIl/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/house/592249-rnc-to-debate-trump-allys-resolution-to-expel-cheney-kinzinger-report",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell",
  "termIds": [
    1147,
    1170,
    1248,
    1685,
    2214,
    3085,
    3094,
    422,
    427,
    428,
    525,
    633
  ],
  "sentences": [
    "Cheney responded to the reported resolution in a statement to the Post, telling the newspaper, The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn' a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy.?\nI'm a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "Bossie also said the duo should be expelled because of their efforts to destroy President Trump.?\nHe reportedly said the two lawmakers should concentrate on assisting the party in November's midterm elections instead of helping Democrats on the investigative committee.",
    "The resolution  which is reportedly co-sponsored by Frank Eathorne, the chairman of the Wyoming Republican Party and an ally of former President Trump's  has been passed around by party officials and RNC members in recent days, according to the Post.",
    "The document reportedly cited Cheney's and Kinzinger's involvement in the House select committee investigating the Jan. 6, 2021, attack on the Capitol as one reason why they should be ousted from the conference.",
    "Some Republicans are encouraging the RNC to scuttle the resolution, arguing that considering such an issue would create an internal public fight that could spill into the public eye, according to the Post.",
    "The Washington Post reported on Monday that RNC members will discuss a resolution proposed by two-time Trump campaign adviser David Bossie at the committee's annual meeting this week in Salt Lake City.",
    "Cheney was removed from House GOP leadership last year after she voted to impeach Trump on the charge of inciting an insurrection and condemned the president for his actions connected to Jan. 6.",
    "Members of the Republican National Committee (RNC) will reportedly debate a resolution put forth by a Trump ally this week that calls for expelling Reps. Liz Cheney (R-Wyo.)",
    "The proposal criticizes the two Republicans and calls on the RNC to formally endorse ousting them from the House GOP, people with knowledge of the document told the Post.",
    "The reported resolution calling for their ouster is the latest rebuke against Cheney and Kinzinger, who have frequently criticized members of the party and Trump.",
    "Cheney is up for reelection this November but will first have to face off against Trump-backed Harriet Hageman in the GOP primary.",
    "Those individuals say the party's time would be better spent criticizing Democrats or discussing the midterm races.",
    "In November, however, she said she still considered Cheney to be a member of the Republican party.",
    "RNC Chairwoman Ronna McDaniel has not yet said if she supports the resolution, the Post noted.",
    "That statement came after the Wyoming GOP voted to no longer recognize the congresswoman.",
    "They are the only two GOP lawmakers serving on the Jan. 6 select committee.",
    "Kinzinger announced in October that he will not seek reelection this year.",
    "and Adam Kinzinger (R-Ill.) from the House Republican Conference.",
    "I will never stop fighting for our constitutional republic.",
    "The Hill reached out to Kinzinger and the RNC for comment.",
    "History will be their judge.",
    "No matter what,? she added.",
    "Updated at 11:37 a.m."
  ]
}