{
  "id": 719,
  "mediaId": 65,
  "date": "1/31/2022 12:00:00 AM",
  "headline": "Liz Cheney hauls in over $7 million last year as she fends off push by Trump to oust her from Congress",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a4aa8cb1-d4bf-452f-b55f-f347f060361b/068d00a8-7aa2-45a7-b3ed-f0e77db3dd27/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/liz-cheney-hauls-in-over-7-million-last-year-as-she-fends-off-push-by-trump-to-oust-her-from-congress",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    1053,
    945,
    945,
    1078,
    1078,
    1053,
    1248,
    1147,
    1147,
    1248,
    2087,
    2087,
    545,
    545,
    428,
    428,
    2946,
    2946,
    2976,
    2976
  ],
  "sentences": [
    "FIRST ON FOX NEWS: TRUMP BACKED CHENEY CHALLENGER HAGEMAN ANNOUNCES HER FUNDRAISING HAUL\nCheney, a longtime vocal GOP Trump critic, was the most senior of the 10 House Republicans who voted to impeach the then-president on a charge of inciting the riot by Trump supporters who aimed to disrupt congressional certification of now-President Biden's Electoral College victory in the 2020 election.",
    "Cheney, who's been very vocal in emphasizing the importance of defending the nation's democratic process and of putting country before party, is one of only two Republicans serving on a special select committee organized by House Democrats to investigate the storming of the U.S. Capitol.",
    "Cheney released her fundraising figures a couple of hours after Harriet Hageman, the leading Republican candidate challenging Cheney, announced that she raised roughly $745,000 from her campaign launch on Sept. 9 through the end of 2021, according to figures shared first with Fox News.",
    "Chene  the most high-profile of the 10 House Republicans who voted just over a year ago to impeach Trump for allegedly fanning the Jan. 6, 2021 riot at the U.S. Capitol  on Monday reported bringing in over $7 million in fundraising last year as she runs for reelection.",
    "CHENEY TELLS FOX NEWS THAT BEHIND THE SCENES', MANY IN GOP ARE THANKING HER\nThe three-term conservative congresswoman's 2021 haul includes raking in over $2 million during the October-December fourth quarter of fundraising.",
    "The daughter of former Vice President Dick Cheney, Rep. Cheney immediately came under verbal attack from Trump and his allies, and last May was ousted from her number-three House GOP leadership position.",
    "PayPal co-founder and billionaire venture capitalist Peter Thiel, who is a Trump ally, hosted a top-dollar fundraiser for Hageman last week in Florida, which included an appearance from Donald Trump Jr.",
    "Hageman, a 2018 gubernatorial candidate who was a former Cheney supporter and adviser who donated to the congresswoman's past campaigns, reported raising roughly $250,000 so far in the new year.",
    "The figure is her largest fundraising quarter ever, topping the $1.5 million, $1.9 million, and $1.7 million she raised during the first three fundraising quarters of last year respectively.",
    "Repeated attacks by former President Donald Trump as he tries to oust Rep. Liz Cheney from Congress are fueling a massive fundraising haul by the Republican lawmaker from Wyoming.",
    "The former president and his allies successfully urged some, but not all, of the other anti-Cheney candidates to drop out of the primary and coalesce around Hageman.",
    "And Sen. Mitt Romney of Utah, the 2012 GOP presidential nominee and a vocal Republican Trump critic, will headline a fundraiser for Cheney in March.",
    "A source with knowledge of the Cheney campaign tells Fox News that the congresswoman has easily topped $250,000 in fundraising so far in 2022.",
    "Former President George W. Bush, and former Republican House Speakers John Boehner and Paul Ryan, have helped raise campaign cash for Cheney.",
    "CLICK HERE TO GET THE FOX NEWS APP\nTrump, stepping up his efforts to oust Cheney from Congress, endorsed Hageman as she entered the race.",
    "The former president is expected to travel to Wyoming in late May to headline a rally on behalf of Hageman.",
    "Hageman, who's backed by Trump, also reported $381,163 cash on hand at the end of last year.",
    "Cheney entered the new year with a formidable war chest of $4.72 million cash on hand.",
    "Her campaign noted that they started 2021 with just $150,000 in their coffers.",
    "That figure included $443,460 raised in the past three months."
  ]
}