{
  "id": 721,
  "mediaId": 65,
  "date": "1/31/2022 12:00:00 AM",
  "headline": "Trump-backed Cheney primary challenger Hageman hauls in $1 million since launching congressional bid",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1961afac-8e86-41a8-a991-fd4621743e14/060688c9-bac2-4c8e-b778-cf1274a558bf/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/trump-backed-cheney-primary-challenger-hageman-hauls-in-1-million-since-launching-congressional-bid",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1053,
    945,
    945,
    1053,
    2087,
    2087,
    1147,
    1147,
    1248,
    1248,
    562,
    562,
    428,
    428,
    545,
    545,
    2976,
    2976,
    2946,
    2946
  ],
  "sentences": [
    "Cheney, a longtime vocal GOP Trump critic, was the most senior of the 10 House Republicans who voted to impeach the then-president on a charge of inciting the deadly Jan. 6, 2021, attack on the U.S. Capitol by right-wing extremists and other Trump supporters, who aimed to disrupt congressional certification of now-President Biden's Electoral College victory in the 2020 election.",
    "CHENEY TELLS FOX NEWS THAT BEHIND THE SCENES', MANY IN GOP ARE THANKING HER\nCheney, who's been very vocal in emphasizing the importance of defending the nation's democratic process and of putting country before party, is one of only two Republicans serving on a special select committee organized by House Democrats to investigate the storming of the U.S. Capitol.",
    "TRUMP TARGETING OF CHENEY FUELS HER FUNDRAISING\nHageman, a 2018 gubernatorial candidate who was a former Cheney supporter and adviser who donated to the congresswoman's past campaigns, spotlighted past criticism of Cheney for spending more time at her Northern Virginia residence than in her native Wyoming.",
    "EXCLUSIVE: Harriet Hageman, the leading Republican candidate challenging Rep. Liz Cheney as Wyoming's at-large member of the House runs for re-election this year, reports that she's hauled in over $1 million in fundraising since declaring her candidacy for Congress less than five months ago.",
    "Hageman brought in roughly $745,000 from her campaign launch on Sept. 9 through the end of 2021, according to figures shared first with Fox News on Monday, with over a quarter-million raised since the beginning of the new year.",
    "And Hageman, a conservative lawyer who's fought for water, land and property rights, spotlighted that more than half of her funds came from within Wyoming and that her campaign had $381,163 cash on hand at the end of 2021.",
    "\"We only get one House seat, and we can't waste it on someone from Northern Virginia who does all of Nancy Pelosi's dirty work to distract voters from Joe Biden's disastrous administration,\" Hageman charged.",
    "Cheney, who's the daughter of former Vice President Dick Cheney, immediately came under verbal attack from Trump and his allies, and last May was ousted from her number-three House GOP leadership position.",
    "PayPal co-founder and billionaire venture capitalist Peter Thiel, who's a Trump ally, hosted a top-dollar fundraiser for Hageman last week in Florida, which included an appearance from Donald Trump Jr.",
    "CLICK HERE TO GET THE FOX NEWS APP\nCheney's brought in roughly $4.5 million so far in the 2022 election cycle, including nearly $1.7 million in the July-September third quarter of fundraising.",
    "The Wyoming GOP censured Cheney a year ago, after her vote to impeach Trump, and in November the state party narrowly voted to no longer recognize the conservative lawmaker as a Republican.",
    "\"Wyoming deserves to be represented by someone who cares about Wyoming, not someone who is consumed by her own personal war with President Trump,\" Hageman told Fox News in a statement.",
    "The Wyoming native who's backed by former President Trump as she runs to oust Cheney, also reported bringing in $443,460 during the October-December fourth quarter of fundraising.",
    "And the former president and his allies successfully urged some, but not all, of the other anti-Cheney candidates to drop out of the primary and coalesce around Hageman.",
    "And Sen. Mitt Romney of Utah, the 2012 GOP presidential nominee and a vocal Republican Trump critic, will headline a fundraiser for Cheney in March.",
    "Former President George W. Bush, and former Republican House Speakers John Boehner and Paul Ryan, have helped raise campaign cash for Cheney.",
    "\"I am standing for Wyoming First and America First values, which is something that Liz Cheney cannot and will not say.\"",
    "And a week ago, Hageman overwhelmingly defeated Cheney in a state central committee straw poll by a vote of 59-6.",
    "The former president's expected to travel to Wyoming in late May to headline a rally on behalf of Hageman.",
    "Trump, stepping up his efforts to oust Cheney from Congress, endorsed Hageman as she entered the race.",
    "\"I have been to all 23 counties in Wyoming, and I know that the people are desperate for a change.\"",
    "But Trump's attacks on Cheney have fueled her fundraising, as she's set record campaign cash hauls.",
    "Support from the former president and his allies is helping to fuel Hageman's fundraising.",
    "She had nearly $3.7 million in her campaign coffers at the end of September.",
    "Cheney's yet to report her figures from the fourth quarter of fundraising."
  ]
}