{
  "id": 729,
  "mediaId": 19,
  "date": "1/27/2022 12:00:00 AM",
  "headline": "Big Money Donor Peter Thiel Hosts Fundraiser for Liz Cheney's Primary Opponent, Harriet Hageman",
  "image": "https://media.breitbart.com/media/2022/01/Harriet-for-Congress-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/01/27/big-money-donor-peter-thiel-hosts-fundraiser-liz-cheneys-primary-opponent-harriet-hageman/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    1147,
    1248,
    2524,
    3085,
    3094,
    146,
    234,
    428,
    633,
    2826,
    2959
  ],
  "sentences": [
    "During the event held in Thiel's Florida home, the megadonor reportedly called Cheney the ringleader? of the treasonous ten? in reference to those House Republicans who voted to impeach Donald Trump.",
    "Venture capitalist and Republican megadonor Peter Thiel on Wednesday hosted a fundraiser for Democrat-allied Rep. Liz Cheney's (R-WV) primary opponent, Harriet Hageman.",
    "That's where we have some problems, we've got to clean house there first,? Thiel added about his strategy to push the GOP towards American First policies.",
    "The way we're going to defeat the left, the way we're going to roll them back, it's going to start in the Republican Party,? Thiel reportedly said.",
    "Hageman, who has been picking up momentum to defeat Cheney in a crowded race, won the much-coveted financial backing of Thiel.",
    "Thiel's fundraiser for Hageman comes as a January straw poll revealed Hageman holds a commanding lead over Cheney.",
    "Hageman also told Breitbart News that Cheney does not represent the priorities of Wyoming's voters.",
    "In November, the Wyoming Republican Party voted to no longer recognize Cheney as a Republican.",
    "The poll was conducted by the Wyoming Republican State Central Committee among GOP activists.",
    "It's not an endorsement, but these are the county activists,? Hageman said of the poll.",
    "By secret ballot, Hageman earned 59 votes and Cheney only was given 53.",
    "She doesn't represent our values,? she said.",
    "Liz Cheney doesn't live in Wyoming.",
    "Liz Cheney has lost Wyoming.",
    "She doesn't represent us.",
    "I think it's a good sign."
  ]
}