{
  "id": 732,
  "mediaId": 195,
  "date": "1/26/2022 12:00:00 AM",
  "headline": "Romney participating in fundraiser for Liz Cheney",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/romneymitt_121621_jn.jpg?itok=iKX1WaIt",
  "link": "https://thehill.com/homenews/campaign/591490-romney-participating-in-fundraiser-for-liz-cheney",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    945,
    1046,
    1102,
    1147,
    1248,
    1892,
    2150,
    2465,
    3085,
    3094,
    428,
    2538
  ],
  "sentences": [
    "Other guests include former Vice President Dick Cheney and his wife; former chief of staff to Cheney Scooter Libby; former U.S. solicitor general Ted Olson; former chief of staff to the late Sen. Bob Dole (R-Kan.) Sheila Burke; and former Rep. Barbara Comstock (R-Va.), among others.",
    "Cheney and Romney are among a group of Republicans who voted to impeach or convict Trump following the Jan. 6 insurrection at the Capitol, and Cheney is also one of two Republicans to sit on a House panel investigating the events of the Capitol riot.",
    "In addition to Hageman, Trump also endorsed the top primary challenger to Sen. Lisa Murkowski (R-Alaska), former Alaska Commissioner of Administration Kelly Tshibaka, before Murkowski announced she would be seeking reelection.",
    "Several House Republicans who voted to impeach Trump have signaled they will not be running again, including Reps. Adam Kinzinger (R-Ill.), Anthony Gonzalez (R-Ohio) and John Katko (R-N.Y.).",
    "Sen. Rick Scott (R-Fla.), the chair of the Senate GOP campaign arm, affirmed in November that he would be helping Murkowski win reelection despite Trump's endorsement of Tshibaka.",
    "in March as the Wyoming incumbent looks to protect her seat against Trump-endorsed Republican primary challenger Harriet Hageman, according to an invitation obtained by The Hill.",
    "General reception requires a $1,000 contribution per person, while a photo reception asks for a $5,800 contribution per couple, according to the invitation.",
    "The March 14 fundraiser is hosted by Bobbie and Bill Kilberg, who previously supported former Florida Gov.",
    "The March fundraiser comes as Cheney seeks reelection against Hageman, who Trump endorsed in September.",
    "Those moves have led the former president to back several Republican challengers against his opponents.",
    "Bobbie Kilberg, one of the fundraiser's hosts, has previously written an op-ed piece for The Hill.",
    "Sen. Mitt Romney (R-Utah) is participating in a fundraiser for Rep. Liz Cheney (R-Wyo.)",
    "A VIP reception asks for a $10,800 contribution per couple.",
    "Jeb Bush (R) during the 2016 presidential election.",
    "Romney is the special guest.",
    "Tal Axelrod contributed."
  ]
}