{
  "id": 743,
  "mediaId": 151,
  "date": "1/23/2022 12:00:00 AM",
  "headline": "POLITICO Playbook: POLITICO turns 15",
  "image": "https://static.politico.com/d9/a5/318dece0438aa5f49326c92d54d6/15th-anniversary-navy-twitter-1-1.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/23/politico-turns-15-00000032",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2505,
    2505,
    2411,
    2411,
    884,
    884,
    723,
    723,
    2092,
    2092,
    545,
    545,
    403,
    403,
    33,
    33,
    2607,
    2607,
    2976,
    2976
  ],
  "sentences": [
    "Next week, the State Department is also expected to encourage Americans to begin leaving Ukraine by commercial flights, while those are still available,' one official said.?\nON THE GROUND IN AFGHANISTAN  WSJ's Sune Engel Rasmussen has a striking visual story: A Journey Along Afghanistan's Main Highway Leads Through a Country in Translation?: While the Taliban limit personal freedoms and persecute critics, the end of fighting has also brought relief to many Afghans.?\nALL POLITICS\nA new NBC News poll has some harsh findings for the Biden administration to grapple with:\nWrong track: 72% of Americans say the country is headed in the wrong direction.?\nInflation: 61% say their family's income is falling behind the cost of living.?\nPolarization: 70% agree with the statement that America has become so polarized that it can no longer solve the major issues facing the country  and that those differences will only continue to grow.?\nDemocracy at risk: A whopping 76 percent of Americans  including 7 in 10 Democrats, Republicans and independents  believe there is a threat to democracy and majority rule in this country.? More from NBC's Mark Murray\nON WISCONSIN  WSJ's John McCormick has the state of play on Dems' prospects for taking on Wisconsin GOP Sen. RON JOHNSON.",
    "And deaths continue to mount, with more than 2,100 announced most days.?\n While Covid pills were tabbed as game-changers? in the fight against the virus, Lauren Gardner reports that a flurry of regulatory, testing and logistical issues is complicating the rollout, potentially requiring people with symptoms to make multiple stops at doctors' offices or testing sites within the five-day window when the drugs are recommended.?\nHELPFUL VISUAL  Charting an Omicron Infection,? by NYT's Emily Anthes and Jonathan Corum\nJAN. 6 AND ITS AFTERMATH\nCAUGHT ON TAPE  CNN's Andrew Kaczynski and Em Steck uncover previously unreported videos from the social media platform Periscope? on which ALI ALEXANDER, a key organizer of the Jan 6 rally (and central figure in the House Jan. 6 committee's investigation), said he would reach out to the right-wing Proud Boys and Oath Keepers on providing security for the event.?\nPLAYBOOKERS\nBengals fans, including Jen Psaki and Kevin Madden, were stressed out during the fourth quarter of yesterday's game.",
    " Rep. Lloyd Smucker (R-Pa.)  Norah O'Donnell  POLITICO's Alex Ward, Annie Snider,Joe Anuta and Jordan Bowen  Scott Mahaskey  Rolling Stone's Patrick Reis  Annie Shuppy  Brian Cooke of the Institute of International Education  Bryn Woollacott of Systems Planning and Analysis  DHS' Isabella Ulloa  Eric Koch of Downfield Strategies (38)  Mike Gallagher of Intrepidity  Erika Gudmundson of Good Comms  Matt Simeon of Locust Street Group  Missy Foxman of the Entertainment Software Association  CNN's Aaron Pellish  Erik Olson  Laura Keiter of Media Matters for America  Edelman's Daniel Workman  HHS' Loyce Pace  Tom Daffron  Harvard Institute of Politics' Amy Howell  Scott Pace  Instagram's Adam Mosseri  Antonio Villaraigosa  former Reps.",
    "And, again, across the board, we're prepared with Europe for a swift and calibrated and very united response.? More from Nick Niedzwiadek\nSen. JONI ERNST (R-Iowa) on how the Biden administration should be responding to Russia, on ABC's This Week?: Let's make sure that we are pushing back right now with stiff sanctions, making sure that we are showing [Russian President VLADIMIR] PUTIN we do mean business, but also making those preparations to pull out Americans that are in the most vulnerable area of Ukraine.?\n On why the Ukraine-Russia situation is important to the U.S.: When democracy is stable, that means our troops, our citizens are much more safe.",
    "The vote comes eight months before the GOP primary.?\n Cheney's camp responds: The only elections that matter are in August and November.? (Similarly, Hageman said that there will be lots of polls over the next eight months, and they will all show different things,? and the Star-Tribune notes that straw polls, even with a far higher number of voters, do not have an accurate track record in Wyoming in recent years.?)\nSUNDAY BEST \nSen. BERNIE SANDERS (I-Vt.) on the Arizona Democrats' censure of Sinema, on NBC's Meet the Press?: [Sinema's support of the filibuster] was a terrible, terrible vote.",
    "For these DONALD TRUMP supporters, the next chapter of Jan. 6 is not the ashes of a disgraced insurrection, but an amorphous new movement fueled by grievances against vaccines and President [JOE] BIDEN, and a deepened devotion to his predecessor's lies about a stolen election.?\n Take note, Mar-a-Lago: Many Jan. 6 attendees have shifted their focus to what they see as a new, urgent threat: Covid-19 vaccine mandates and what they call efforts by Democratic politicians to control their bodies.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nTara Palmeri @tarapalmeri\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "In a state decided by less than 1 percentage point in the 2020 presidential election  the third-narrowest outcome nationally  six Democrats who have raised the most money so far are all taking positions to the left of President Biden's.?\nTHE ECONOMY\nBLAME GAME  As inflation continues to spike at historic levels, many are left wondering what's to blame: the pandemic or policy?",
    "But, we have a responsibility to see the diplomacy through for as far and as long as we can go, because it's the more responsible way to bring this to a closure.?\n Blinken on CNN's State of the Union?: If a single additional Russian force goes into Ukraine in an aggressive way, as I said, that would trigger a swift, a severe and a united response from us and from Europe.",
    "Or we should be.?\nSecretary of State ANTONY BLINKEN on negotiations with Russia over the situation on the Ukrainian border, on Meet the Press?: It is certainly possible that the diplomacy the Russians are engaged in is simply going through the motions and it won't affect their ultimate decision about whether to invade or in some other way intervene  or not  in Ukraine.",
    "The censure has no practical effect but does deliver a strong message of condemnation and reflects the will of the party's most active and loyal members.?\n Sinema's office responds: During three terms in the U.S. House, and now in the Senate, Kyrsten has always promised Arizonans she would be an independent voice for the state  not for either political party.",
    "More and more states have passed a peak in new cases in recent days, as glimmers of progress have spread from a handful of eastern cities to much of the country.? And yet: The United States continues to identify far more infections a day than in any prior surge, and some states in the West, South and Great Plains are still seeing sharp increases.",
    "SPOTTED at a semi-retirement surprise party for Carla Marinucci, the original California Playbook author, on Saturday night at CaliCraft beer garden in Walnut Creek, Calif.: Willie Brown,Steve Glazer, Buffy Wicks,Kevin Yamamura, Katy Murphy, Jeremy White, David Siders, Debra Kahn, Victoria Colliver, Angela Greiling Keane, Mackenzie Mays, H.D.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nAMERICA AND THE WORLD\nUKRAINE-RUSSIA LATEST  The United Kingdom says it has exposed a plot by Russia to install a friendly government in Ukraine, supporting an earlier U.S. assessment suggesting that the Kremlin is laying plans to oust its neighbor's leadership,? WSJ's James Marson reports.",
    "It was ambitious  and it ran its own reporters absolutely ragged.?\nThere was a reason for that, as co-founder John F. Harris explains in his look at how the media has changed these last 15 years: At the outset, we had no illusion that we could compete on even terms with our old colleagues at legacy publications.",
    " She's delivered for Arizonans and has always been honest about where she stands.?\nOn the right: In a straw poll held by the Wyoming Republican State Central committee on Saturday, HARRIET HAGEMAN, the Trump-endorsed challenger to Rep. LIZ CHENEY (R-Wyo.",
    "There are two big state party vs. one of their own? stories this morning:\nOn the left: The Arizona Democratic Party executive committee censured Sen. KYRSTEN SINEMA on Saturday over her opposition to changing filibuster rules to pass voting rights bills.",
    "What we sought instead was the journalistic equivalent of asymmetric warfare  guerillas taking on larger forces by darting quickly and opportunistically into stories where we might have a chance to win.?\nBut was the old order really all that bad?",
    "We need to make sure that democracy is prevailing around the globe and that socialism, communism, and the old Soviet Union is not regaining territory.?\nBIDEN'S SUNDAY  The president has nothing on his public schedule.",
    "And I think what the Arizona Democratic Party did was exactly right.?\nRep. ELISSA SLOTKIN (D-Mich.) on whether she questions the motives of Sinema and Sen. JOE MANCHIN (D-W.Va.), on Meet the Press?: No, I don't.",
    "While it turned deadlines upside down  days and hours transformed into minutes and seconds  it also satisfied a thirstiness' for community among Washington professionals wanting to see and be seen' in Playbook.",
    "POLITICO Playbook: POLITICO turns 15\nBy TARA PALMERI\n01/23/2022 11:19 AM EST\nPresented by\nDRIVING THE DAY\nOn this date in 2007, a news outlet launched that would upend how the media covered American politics.",
    "The current top tier of Democrats campaigning for U.S. Senate in Wisconsin includes a lieutenant governor, a state treasurer, a county executive and a former Goldman Sachs analyst who is a billionaire's son.",
    "Its opening paragraph boasts of offering a handy, BlackBerry and Treo-friendly peek at the news driving each day.?\n Matt Wuerker walks us through his 15 favorite editorial cartoons over the last 15 years.",
    "It frustrated press secretaries and offended the at-times tender sensibilities of the 200-year-old institution that is Congress, demystifying the protocols and personalities that made Capitol Hill run.",
    "John recently brought together a roundtable of current and former POLITICOs  NYT's MAGGIE HABERMAN, BEN SMITH, WaPo's SEUNG MIN KIM, MATT WUERKER and Playbook's own EUGENE DANIELS  to talk it through.",
    "Neither the U.K. nor the U.S. revealed exactly how it believed Moscow was intending to bring its alleged agents to power.?\n FWIW, the AP reports that Russia's foreign ministry has denied these claims.",
    "A snapshot from its intro:\nWith its relentless pace and radically different standard for what constituted news, POLITICO at turns confused, thrilled and maddened its audience in the nation's capital.",
    "The allegations, announced Saturday by the British Foreign Office, come in the midst of warnings that Russia could invade Ukraine with the around 100,000 troops it has gathered near the border.",
    "Casper Star-Tribune's Victoria Eavis reports that the secret ballot of party activists awarded Hageman 59 votes, Cheney six, state Sen. ANTHONY BOUCHARD, R-Cheyenne, two and DENTON KNAPP one.",
    "It is the case that supply disruptions are leading to higher inflation in many places, including in large developing economies like India and Brazil and in developed ones like the euro area.",
    " But some economists point out that even as inflation proves pervasive around the globe, it has been more pronounced in America than elsewhere,? NYT's Jeanna Smialek and Ana Swanson write.",
    "Palmer, Amy Palmer, Brian Brokaw, Debbie Mesloh, Elex Michaelson, Peter Ambler, Scott Shafer, Marisa Lagos, Doug Sovern, Sara Sidner, Phil Matier, Amelia Matier and Amber Lee.",
    "Bud Shuster (R-Pa.) (9-0), Joe Baca (D-Calif.) and Marty Russo (D-Ill.)  Mark Boal  Secure Democracy's Jay Riestenberg  Suzanne Kennedy\nDid someone forward this email to you?",
    " The State Department has ordered families of U.S. Embassy personnel in Ukraine to begin evacuating the country as soon as Monday,? Fox News' Lucas Tomlinson reports.",
    "But a larger group has received far less attention: the thousands who  did not set foot in the Capitol and have not been charged with any crime  who simply went home.",
    "A lot of people in the MAGA Patriot community are like, What is up with Trump??' Mr. Davis, [a Texas lawyer who attended the pro-Trump demonstration on Jan. 6], said.",
    "THE PANDEMIC\nOMICRON ON THE RUN  Despite a recent surge, Omicron cases appear to be leveling off nationally, NYT's Mitch Smith, Julie Bosman and Tracey Tully write.",
    "I think  someone once told me when I started in Congress, you know, you can question someone's policy choices, don't question their motives.",
    "The closed-door vote Saturday morning came after an avalanche of anger from liberals,? Arizona Republic's Yvonne Wingett Sanchez writes.",
    "Playbook couldn't happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    " Some bridled at Trump's recent, full-throated endorsements of the vaccine and wondered whether he was still on their side.",
    "And, again, there are other things that Russia could do that fall short of actually sending additional forces into Ukraine.",
    "It was both serious and mischievous, high and low, in print and on the web, substantive and fun, with a twist of tabloid.",
    "Here's one of our favorites, from 2010, but still relevant today:\nGood Sunday morning, and thanks for reading Playbook.",
    "Most Jan. 6 post-mortems have focused on the violent core of the mob,? write NYT's Elizabeth Dias and Jack Healy.",
    "But it worked out well in the end: Cincy beat the Tennessee Titans, 19-16, kicking a field goal as time expired.",
    "Eric Swalwell rejoiced in the 49ers' last-second upset of the Green Bay Packers (at Lambeau, in the snow).",
    " Andrew Nicholson is now an associate director of government relations at Imperium Global Advisors.",
    "on the Senate Judiciary Federal Courts, Oversight, Agency Action, and Federal Rights Subcommittee.",
    "SPOTTED: Sarah Palin having dinner at Elio's on Manhattan's Upper East Side (via Shawn McCreesh).",
    "TRANSITIONS  Nathan Williams is now counsel to ranking member Sen. John Kennedy (R-La.)",
    "We'll leave you with two especially fun nuggets:\n How different were things in 2007?",
    "How the Jan. 6 insurrection mutated into an emblem of resistance? on the right.",
    "There's a vivid oral history of that moment in time over at POLITICO Magazine.",
    "He previously was investigations counsel on the Senate Commerce Committee.",
    "He previously was a legislative assistant for Rep. John Katko (R-N.Y.).",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "Check out the first edition of Playbook, which debuted in June 2007.",
    "Their conversation published this morning, and is worth a read.",
    "It was called The POLITICO (the The? was quickly dropped).",
    "HAPPY BIRTHDAY: POLITICO (15)  Sen. Tom Carper (D-Del.)",
    "Because we're all here, I hope, to do the right thing.",
    "With most of us, the vaccines are anathema.'?\n2.",
    "Send Playbookers tips to playbook@politico.com.",
    "And where does political media go from here?",
    "So, this is a concern to our constituents.",
    "Almost immediately, Washington changed.",
    "None could be described as centrists.",
    "It was fast and aggressive.",
    "Many hospitals are full.",
    "TOP SUNDAY READS\n1.",
    "Sign up here.",
    "), won big."
  ]
}