{
  "id": 745,
  "mediaId": 19,
  "date": "1/23/2022 12:00:00 AM",
  "headline": "Liz Cheney Loses Wyoming Straw Poll to Trump-Backed Harriet Hageman",
  "image": "https://media.breitbart.com/media/2022/01/AP21355817052638-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/01/23/liz-cheney-loses-wyoming-straw-poll-trump-backed-harriet-hageman/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    732,
    826,
    1147,
    1248,
    3085,
    3094,
    146,
    428,
    633,
    2598,
    2976
  ],
  "sentences": [
    "It's not an endorsement, but these are the county activists.?\nWhile the state party is not allowed to endorse a candidate in the primary, according to the Star-Tribune, the poll enables party-goers to see what the current party leadership is thinking months ahead of the primary.",
    "Wyoming Republican Harriet Hageman, endorsed by former President Donald Trump, showed a commanding lead against the Democrat-allied Rep. Liz Cheney (R-WY) in a Saturday straw poll full of House candidates held by the Wyoming Republican State Central Committee.",
    "In response to the vote, Jeremy Adler, a spokesperson for the Cheney campaign, said, The only elections that matter are in August and November.?\nThe report acknowledged that only 71 members voted in the straw poll, including three of Hageman's family members.",
    "During an exclusive interview on Breitbart News Saturday, Hageman said that Cheney has been using her seat to pursue a political vendetta against Trump instead of focusing on representing the people of Wyoming.",
    "Cheney garnered only six votes, along with state Sen. Anthony Bouchard (R-Cheyenne), who received two votes, and Denton Knapp, who received one vote.",
    "A secret ballot straw poll of Republican party activists gave Hageman 59 votes, a 53 vote lead against Cheney, according to the Casper Star-Tribune.",
    "The report noted that there are 196,179 registered Republican voters in Wyoming, and straw polls have not had an accurate track record in Wyoming.",
    "After the secret ballot, which came eight months before the state's Republican primary, Hageman told the Star-Tribune, I think it's a good sign.",
    "Since Wyoming's central committee is made up of 74 votes, consisting of three representatives from each county and members of the state party.",
    "Although, the straw polls showed the ongoing conflict between the state party's leadership and Cheney when she started to break with Trump.",
    "Cheney, in the past, has even called the state's party leader, Wyoming's GOP Chairman Frank Eathorne, a radical.",
    "Last year, the Wyoming Republican Party also voted to no longer recognize Cheney as a member of the GOP.",
    "She doesn't represent our values.?\nJacob Bliss is a reporter for Breitbart News.",
    "She added, Liz Cheney has lost Wyoming.",
    "Liz Cheney doesn't live in Wyoming.",
    "You can follow him on Twitter.",
    "She doesn't represent us."
  ]
}