{
  "id": 850,
  "mediaId": 223,
  "date": "1/2/2022 12:00:00 AM",
  "headline": "Sunday Shows Were Hyperfocused on Reminding Everyone About January 6",
  "image": "https://media.townhall.com/townhall/reu/ha/images/2022/2/dfaed5ad-41a6-43da-8ea0-fb40c4cacc4f.png",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/01/02/sunday-shows-were-hyperfocused-on-reminding-everyone-about-january-6-n2601309",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    1081,
    1081,
    1248,
    1248,
    1158,
    1158,
    2052,
    2052,
    1749,
    1749,
    2183,
    2183,
    545,
    545,
    428,
    428,
    124,
    124,
    200,
    200
  ],
  "sentences": [
    "https://t.co/zo7wSq6hc1 pic.twitter.com/Q8v97iEqcY\n This Week (@ThisWeekABC) January 2, 2022\nIn sharing Clinton's fear that Trump running and winning in 2024 \"could be the end of our democracy,\" Cheney also said that Trump \"crossed lines no American president has ever crossed before,\" and offered that \"when a president refuses to tell the mob to stop, when he refuses to defend any of the coordinate branches of government, he cannot be trusted.\"",
    "In recent weeks we've learned that the riot was not a -- merely an explosion of violence prompted by Donald Trump's speech but the result of post-election planning by anti- (small-d) democratic forces at the highest level -- up to and including the then sitting president of the United States -- to overturn the election and subvert the will of the American people.",
    "Cheney maintained that she is \"very focused right now on my re-election and on the work of the select committee,\" but there was a \"though\" in there, which is that, in her mind, \"the single most important thing, though, is to ensure that the Donald Trump is not the Republican nominee and that he certainly is not anywhere close to the Oval Office ever again.\"",
    "https://t.co/RhbkmuCrEO pic.twitter.com/B9OLaDxdY2\n This Week (@ThisWeekABC) January 2, 2022\nWhether or not Cheney will run for president in 2024, something she has not ruled out and has even raised speculation on, was a topic for the congresswoman and Margaret Brennan on CBS' \"Face the Nation.\"",
    "Later in her segment, Cheney said that the work of the select committee gave her \"hope\" as it is \"non-partisan\" and \"very much one that brings together a group of us who have very different policy views, but who come together when the issues have to do with the defense of the Constitution.\"",
    "Brennan also spoke with Rep. Schiff, who threw the U.S. Supreme Court under the bus as it applies to the select committee, in addition to providing a vague answer about how public hearings will take place \"in a matter of weeks, if not a couple of months from now.\"",
    "And the more we learn about what the bi-partisan January 6th House committee is uncovering -- the more we see that the focus increasingly is not only what President Trump and his allies did on January 6th, but what they did before January 6th.",
    "Thompson did point out that \"'assisted' means different things,\" and he also pointed out that \"we don't have any real knowledge that I'm aware of, of people giving tours,\" despite how \"we heard a lot of that.\"",
    "And, as I covered on Saturday, The New York Times editorial board claimed that \"Every Day is Jan. 6 Now,\" in reference to election integrity laws being considered by state legislatures across the country.",
    "Two-thirds of the Senate failed to find Trump guilty, though, which would have meant Trump would have been barred from holding federal office again, among other punishments he would have faced.",
    "Rep. Thompson offered insight as how their \"goal is to produce a report\" of their findings, and the select committee believes members of Congress may have \"assisted\" the January 6 rioters.",
    "Rep. Schiff indicated that \"when it does go before the Supreme Court, we will get a sense of whether that court is a conservative court or whether it has become just a partisan court.",
    "And the nation needs a Republican Party that is based on substance and values and principles, and -- and we've got to get back to that if we want to get this nation back on track.",
    "What brings the committee together, though, is that its members were all appointed by House Speaker Nancy Pelosi (D-CA) and that all voted to impeach then President Donald Trump.",
    "If it's a conservative court, it will not disturb the decisions below, which I think have clearly held that Congress has a right to this information under these circumstances.",
    "Both Reps. Thompson and Cheney, the latter who is the vice chair of the select committee, appeared on ABC's \"This Week,\" where they spoke with host George Stephanopoulos.",
    "Cheney emphasized that Trump had taken part in a \"dereliction of duty\" by failing to tell rioters at the Capitol to stand down and go home much sooner than he did.",
    "But nearly 250 years after America declared independence, and one year since the January 6th Capitol riot, American democracy will survive only if we can keep it.",
    "As to whether it involves other members of Congress, the congressman revealed that \"we will probably be asking some more [members] to come\" before the committee.",
    "While Congress will not be in session on that day, Speaker Pelosi indicated in a \"Dear Colleague\" letter that there will be events that day to mark the occasion.",
    "The other shows featured members from the select committee on January 6, including Reps. Adam Schiff (D-CA), Liz Cheney (R-WY), and Bennie Thompson (D-MS).",
    "Cheney claimed that, when it comes to how \"the Republican Party has to make a choice,\" this means one has to choose between the Constitution and Trump.",
    "pic.twitter.com/3lOFwLeQ9Y\n Face The Nation (@FaceTheNation) January 2, 2022\nTrump endorsed Cheney's primary opponent, Harriet Hageman, in September.",
    "Attorneys for Trump have asked the Supreme Court to block the National Archives from handing over records from the Trump White House from January 6.",
    "As the anniversary of the Capitol Hill riot from January 6 approaches, the media have ramped up their efforts to remind us about that day.",
    "Rep. Liz Cheney, the top Republican on the House select committee investigating the Jan. 6 assault on the U.S. Capitol, says former Pres.",
    "We can either be loyal to our Constitution or loyal to Donald Trump, but we cannot be both,? GOP Rep. Liz Cheney tells @GStephanopoulos.",
    "On Sunday, Cheney said that Trump \"is clearly unfit for future office, clearly can never be anywhere near the Oval Office ever again.\"",
    "Be it the election laws, the secretaries of state or the local election officials, they didn't have them there to overturn the result.",
    "They don't plan to make this mistake again, as they work to fill those positions with allies willing to do their bidding.",
    "And, in my view, the most conservative of conservative principles is fidelity to the Constitution,\" she went on to say.",
    "While \"Fox News Sunday\" spoke with chief of U.S. Capitol Police, Thomas Manger, who took on such a role in July.",
    "Earlier in the program, Todd had also equated the day's events with the loss of democracy:\nGood Sunday morning.",
    "Benjamin Franklin is credited with saying yes, the Founding Fathers had created a republic, if we can keep it.",
    "I can tell you the single most important thing is to ensure that Donald Trump is not the Republican nominee.\"",
    "During that \"special edition\" episode, host Chuck Todd spoke to the select committee's chair, Rep. Thompson.",
    "Trump is \"clearly unfit for future office, clearly can never be anywhere near the Oval Office ever again.\"",
    "This included Cheney once more emphasizing the reasons that she was so determined to see Trump impeached.",
    "@RepLizCheney: \"I'm very focused right now on my re-election and on the work of the select committee.",
    "It would be extraordinary for the judicial branch to differ with both other branches of government.\"",
    "Their plan did not succeed because they did not have the power to make it succeed, at least for now.",
    "Thompson mentioned a similar point, which is that January 6 \"appeared to be a coordinated effort.\"",
    "Stephanopoulos referred to Cheney as someone who is \"as stalwart Republican as I've ever met.\"",
    "\"We can either be loyal to our Constitution or loyal to Donald Trump, but we cannot be both.",
    "You have the executive branch represented by Joe Biden and the legislative branch in court.",
    "Cheney also went on to agree with Hillary Clinton, when prompted to by Stephanopoulos.",
    "NBC's \"Meet the Press\" had a \"special edition\" episode on \"January 6: One Year Later.\"",
    "That led to Stephanopoulos and Cheney discussing why Republicans still support Trump.",
    "But, fundamentally, at the end of the day, we can't be a party that's based on lies.",
    "We've got to be based on a foundation of truth and fidelity to the rule of law.",
    "By the time the trial got to the Senate, Trump had already left office.",
    "Every Sunday show featured someone involved with the U.S. Capitol.",
    "@margbrennan Would you run against former President Trump in 2024?",
    "It's not merely the Sunday shows preoccupied with January 6.",
    "The Republican Party has to make a choice.",
    "Happy New Year.",
    "2022 is here.",
    "."
  ]
}