{
  "id": 853,
  "mediaId": 187,
  "date": "1/2/2022 12:00:00 AM",
  "headline": "Trump Is Making the Midterms a Referendum on Himself",
  "image": "https://cdn.theatlantic.com/thumbor/aDTpuePBPzltKyLt1zeLqUhbVDk=/0x0:2000x1125/1952x1098/media/img/mt/2021/12/Trump_midterms/original.jpg",
  "link": "https://www.theatlantic.com/politics/archive/2022/01/2022-midterm-elections-primaries-trump/620981/",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Catanese",
  "authorUrl": "https://www.theatlantic.com/author/david-catanese/",
  "termIds": [
    1026,
    1026,
    2087,
    2087,
    2095,
    2095,
    1147,
    1147,
    1248,
    1248,
    2475,
    2475,
    2538,
    2537,
    2538,
    2537,
    2672,
    2672,
    2976,
    2976
  ],
  "sentences": [
    "It is very important that the candidates that Donald Trump has endorsed prevail a significant majority of the time because that is a strong message to potential competing candidates of how strongly Republican primary voters like him,? Representative Mo Brooks, a Trump-backed candidate for U.S. Senate in Alabama, told me, in an assessment that just happens to be self-serving.",
    "That's the biggest worry I have for the Republicans.?\nGiven what happened in Georgia's runoff elections, it's easy to envision a scenario in which Trump meddles so heavily and recklessly in a battleground state that the fallout from the divisiveness costs the party a governorship or a precious Senate seat.",
    "In early August, Trump phoned Senator Kevin Cramer of North Dakota, and the conversation turned to Herschel Walker, the former NFL star who was on the cusp of announcing a Senate campaign in Georgia amid reports he threatened his ex-wife's life and that he exaggerated his finances.",
    "Brooks, who appeared at the January 6 rally preceding the U.S. Capitol riot, nabbed Trump's blessing last spring, earning him a giant in-state MAGA rally this summer and a healthy double-digit polling lead even though one of his opponents, Katie Britt, is better funded.",
    "Yet even sooner than that, a slice of the most reliable voters will also deliver a tangible verdict on the staying power of another politician who hovers over the next pair of election cycles like no other: the former president, who hardly needs to be named.",
    "Barring a historic anomaly, Democrats will have lost at least one chamber of Congress, Biden's remaining legislative goals will be placed on life support, and the growing anguish over the party's 2024 presidential nominee will transform into a panic.",
    "This coming February, Trump will host Tshibaka at Mar-a-Lago for a fundraiser, and he recently warned Alaska's incumbent GOP governor that his endorsement comes with one condition: The governor must not back Murkowski for a fourth term.",
    "Notably, Trump was patient in this instance, resisting a snap endorsement of the first Trump-loving candidate to announce a primary challenge to Kemp, and then gradually coaxing former Senator David Perdue into the race.",
    "I cannot fathom a possible scenario where Liz Cheney wins.?\nTrump is also 100 percent committed to defeating Georgia Governor Brian Kemp and Senator Lisa Murkowski of Alaska, according to Michael Wolff's book Landslide.",
    "Trump is the only thing that could upend what should be a historic midterm for the Republican Party, Larry Hogan, the anti-Trump term-limited governor of Maryland who is mulling his own path to the White House, argues.",
    "It's a lot more him making these endorsement decisions than ever before.?\nSure, the 45th president will remain the overwhelming front-runner in hypothetical Republican presidential polling throughout the next year.",
    "He's finished.?\nTrump endorsed Murkowski's opponent, Kelly Tshibaka, out of his sheer disdain for the Senate incumbent, who was one of seven Republicans who voted for conviction in his February impeachment trial.",
    "I haven't seen a time where Trump is more in control than now,? a Republican familiar with the ex-president's staff told me on the condition of anonymity to protect private conversations within Trump's circle.",
    "Trump's contempt for Kemp still simmers from the governor's certification of Georgia's 2020 election results, a normally perfunctory ritual that became a scarlet letter of disloyalty in Trumpworld.",
    "When the 2022 midterm elections are appraised less than a year from now, the Washington commentariat will in all likelihood render them to have been a devastating blow to Joe Biden's presidency.",
    "Conversely, if Trump's highest-profile picks run the table, he'll look unstoppable and potentially head into 2024 as a stronger candidate than he was as an incumbent president in 2020.",
    "He's already suggested that Stacey Abrams, who just launched her second shot at the governorship and harbors her own White House ambitions, might be a better governor than Kemp.",
    "He really wanted to get this right, and I think he feels very confident he did,? a former adviser to Trump's presidential campaign who is involved in the Wyoming race told me.",
    "He's made picks in nearly 40 congressional races to date, most recently training his ammunition on the House Republicans who voted for the bipartisan infrastructure package.",
    "And perhaps more importantly, it'll be closely gauged by the fleet of Republicans lying in wait, seeking any shred of Trumpian vulnerability to justify their own 2024 runs.",
    "The former president's ultimate record in these races will serve as the first barometer of his continued strength as he eyes a comeback bid for the White House in 2024.",
    "Trump talks about Cheney so much that she regularly comes up in meetings with candidates nowhere close to Wyoming, an adviser familiar with the conversations told me.",
    "On an almost weekly basis, he marks up printed-out copies of local-news coverage and op-eds with his signature Sharpie pen and mails Hageman notes of encouragement.",
    "For Trump, the risk of piling up so many endorsementsespecially against incumbentsis that he'll blemish a tally that's been nothing short of extraordinary to date.",
    "And for a guy who had plenty of things that could derail a candidate, he demonstrated himself  [that] people are looking forwards not backwards,? Cramer told me.",
    "Murkowski's favorability among Alaska Republicans has been measured at as low as 6 percent, meaning that her only path for reelection relies on Democratic votes.",
    "Since endorsing Harriet Hageman, an attorney and former Trump critic, to take on Cheney, Trump has been engrossed with even minor developments in the campaign.",
    "The full extent of the ex-president's power will be measured by his ability to dislodge current officeholders, who already have their own bases of support.",
    "I think it will, as much as anything, help inform his decision about whether to run or not.?\nTrump serving as the party uniter, rather than a divider?",
    "Trump could easily sit on the sidelines, observe the trajectory of the race and then intervene in the final weeks on behalf of the leading candidate.",
    "Dethroning Cheney, Murkowski, Kemp, and a few others will also bend the makeup of the party in his favor if he ends up returning to the White House.",
    "So far, his picks have lifted challengers to GOP incumbents who have crossed him and a bevy of newcomers who are eager to align with his brand.",
    "At this early moment, he's most obsessed with a trio of targets: Representative Liz Cheney, Senator Lisa Murkowski, and Governor Brian Kemp.",
    "But the temptation to intervene will be whetted by a coterie of his former aides who are deeply involved in those races.",
    "He formally endorsed Walker just weeks later, and much of what's left of the GOP establishment soon followed suit.",
    "He's made another nine endorsements in gubernatorial primaries, including one against the GOP incumbent in Idaho.",
    "In places such as Ohio and Missouri, home to crowded and complex GOP Senate primaries, he's held back thus far.",
    "Earlier this year, his preferred candidate, Susan Wright, lost the nomination for a special Texas House race.",
    "He's certainly not seeking anyone's approval to make a move, according to those at the other end of the line.",
    "A Club for Growth survey showed that his support swells when people become aware that he's Trump's candidate.",
    "I gave her the drilling, but she's always been nasty to me,? Trump said of Murkowski, according to Wolff.",
    "But even his own allies acknowledge that his endorsement success will factor into his decision matrix.",
    "The people that may try to be more Trumpy to win a primary may be the least electable in the general.",
    "In 2020, a businessperson he backed in North Carolina fell to now-Representative Madison Cawthorn.",
    "Trump would never have gotten this far by playing it safe, so going all in only boosts his brand.",
    "At the top of the listwith no immediate equalis Cheney, Trump's most vocal GOP critic and foe.",
    "Trump has already endorsed candidates in 2022 primary contests in all of those states.",
    "And he certainly is a good redemption story.? Trump liked that argument and agreed.",
    "Voters' verdicts on Trump will come in Idaho, Alabama, and Georgia this spring.",
    "And though his primary-endorsement track record is sterling, it isn't perfect.",
    "If he has a really successful track record, it's going to enhance his potency.",
    "Brooks is now the undisputed favorite to be the next senator from Alabama.",
    "He'll simply deploy another time-tested Trumpian play: He'll blame them.",
    "Donald Trump's instincts on these things have been pretty darn good.",
    "Instead, he relies on spontaneous, freewheeling phone conversations.",
    "Then again, if his big picks fall flat, Trump won't worry too much.",
    "Donald Trump will own the midterms just as much as Joe Biden will.",
    "People like a good redemption story,? Cramer told Trump.",
    "It's the only way we can blow this thing,? he told me.",
    "Make no mistake: Trump is making these picks himself.",
    "[Bill] Stepien ain't making endorsement decisions.",
    "Susie [Wiles] ain't making endorsement decisions.",
    "Then in Arizona, Alaska, and Wyoming in summer.",
    "But Brooks is only a baseline test for Trump.",
    "Trump runs no formal endorsement process.",
    "(Walker has denied making the threats.)",
    "That won't be the case everywhere.",
    "The other is Kemp."
  ]
}