{
  "id": 89,
  "mediaId": 195,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Pro-Trump candidates look to harness populist energy after Ohio",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/trumpdonald_042422ap-joe-maiorana_capitalize.jpeg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3479860-pro-trump-candidates-look-to-harness-populist-energy-after-ohio/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    819,
    819,
    1646,
    1646,
    2095,
    2095,
    1248,
    1147,
    1248,
    1147,
    380,
    380,
    2845,
    2845,
    2672,
    2672
  ],
  "sentences": [
    "The trend is playing out elsewhere and has been compounded by a slew of retirements by longtime conservatives who decided to leave public office, including Portman, Sen. Pat Toomey (R-Pa.) and Sen. Richard Burr (R-N.C.), who have historically adhered to Republican ideological orthodoxy but have been hit with criticism over their views on Trump.",
    "And so, Republican candidates are looking at that and seeing a formula they think can win, can certainly win in their states, if not nationally, and that's what they're focused on, is what do I need to do to win the nomination in this state so that I can win?'? said Doug Heye, a former Republican National Committee staffer.",
    "Now the ads are about immigration, China and Donald Trump.?\nThe month of May is littered with primaries featuring staunch conservative incumbents or former lawmakers butting heads with candidates more aligned with the GOP's populist flank, setting up a test of which wing of the party is stronger heading into November.",
    "And then I think 2024 will be the real answer to the questions in terms of what does the Republican Party look like moving forwardIt's far too soon to know the answer that question.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The 2022 midterm cycle echoes the 2010 elections, when moderate Republicans faced fury from a fired-up Tea Party movement that made fiscal responsibility a cornerstone of their wrath against lawmakers they viewed as squishy centrists, except now the grumbling is more about personality than ideology.",
    "Similar dynamics could play out in other primaries happening this year, as populist candidates running on their fealty to the former president in states like Arkansas, Georgia, Idaho and Wyoming look to replace candidates with strong conservative bona fides in a sign of shifting sands in the GOP.",
    "Some of what I think you see here is that sort of, are you a fighter or are you more insider??\nWith the Tea Party, it was on rein in spending, limited government, free markets, balanced budgets, all those sorts of things,? added Sam DeMarco, the chair of the Allegheny County, Pa., GOP.",
    "And when you think about somebody like Sen. Boozman, who works hard and gets stuff done but isn't out there tossing bombs or being really an activist in the fight between the parties, that doesn't get as much credit,? said one former Trump administration official.",
    "Multiple operatives likened Trump's 2016 campaign and the rise in populism to a chicken-and-the-egg situation  but over a half-dozen Republicans agreed in interviews with The Hill that Trump helped accelerate the surge that's been playing out for years.",
    "And if that gets rewarded by nominations, that's only going to inspire others to do so.?\nOperatives say they hope the clashes between conservatives and populist don't create a permanent schism, voicing optimism that the GOP's big tent? can hold.",
    "McGeachin is focusing much of her campaign on Little's resistance to formalizing a ban on mask and COVID-19 vaccine mandates, but Little has banned so-called vaccine passports and focused on cutting taxes and reducing regulations.",
    "Donald Trump and his allies are looking to capitalize on their victory in Ohio Tuesday night as a slate of coming primaries pits populist candidates in the former president's mold against more traditional conservatives.",
    "One crucial test will be Alaska's GOP Senate primary in August, when centrist Sen. Lisa Murkowski (R) is running for reelection against a Trump-backed challenger, though a new election system could provide a boost.",
    "It's a much more populist primary electorate than it used to be,? said Alex Conant, a former George W. Bush administration staffer and top aide on Sen. Marco Rubio's (R-Fla.) 2016 presidential campaign.",
    "Boozman boasts an 85-percent lifetime rating from the American Conservative Union but was painted in an April ad from a pro-Bequette super PAC as a liberal? and a RINO,? or Republican In Name Only.",
    "And perhaps most prominently in Wyoming, Rep. Liz Cheney (R) is in the fight for her political life in a primary against Trump-backed attorney Harriet Hageman later in August.",
    "Should Republicans take back the House and Senate this year, operatives said they expect the party to remain largely united in opposition to the Biden administration's agenda.",
    "Still, the fact that those lawmakers are in serious primary races at all underscores that conservative credentials are no longer sufficient for a broadening swath of voters.",
    "Kemp is facing Trump's ire over his refusal to overturn his 2020 loss in Georgia but has looked to expand gun rights, significantly restrict abortion access and more.",
    "Just because you believe the election was stolen in 2020 doesn't mean you can't be a member of this party,? said the former Trump administration official.",
    "I think that's what will define the party, and you'll find a lot of unity in there regardless of the addition of populists to the Senate ranks.",
    "Cheney boasts a staunchly conservative voting record but is now a populist target over her blame of Trump over last year's Capitol riot.",
    "In the first two years, if Republicans win the majorities, they will be defined by their opposition to Biden's agenda,? Conant said.",
    "Now, it's America First.?\nBesides squeezing Republican conservatives, operatives say moderates too are increasingly at risk.",
    "But under Trump, the GOP's populist flank is seeing a more supercharged wave of enthusiasm and more wins at the ballot box.",
    "To be sure, conservatives in many states still boast advantages, and Boozman, Kemp and Little are all primary favorites.",
    "Trump also racked up other wins in the Buckeye State, underscoring the extent to which he retains his hold on the party.",
    "In Arkansas, Sen. John Boozman (R), is facing a primary challenge from Jake Bequette, a well-funded former NFL player.",
    "Whereas the Republican Party used to be energized by shrinking government, now it's energized by tearing down elites.",
    "To be sure, Democrats are also grappling with a split between traditional liberals and more firebrand progressives.",
    "The moderates can't raise money, and the moderates can't get through a primary,? said GOP donor Dan Eberhart.",
    "Some conservatives have already scored wins, including in Tuesday's Ohio gubernatorial race, where Gov.",
    "In addition to being a conservative, voters want people who are fighting and fighting hard.",
    "Vance, whom Trump endorsed, clinch the GOP nomination in the race to replace retiring Sen.",
    "Brad Little (R) is also facing a Trump-backed primary challenge from his deputy, Lt. Gov.",
    "Just because you might be pro-choice doesn't mean you can't be a member of this party.",
    "Mike DeWine (R) won renomination, though he failed to clinch 50 percent of the vote.",
    "Brian Kemp (R) is running for a second term against former Sen. David Perdue (R).",
    "You don't see a lot of ads about how we're going to cut taxes and slash spending.",
    "Without a doubt we're heading towards a party of fewer moderates.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "But after that, they say, their big tent will be tested.",
    "Donald Trump was supposed to lose and didn't in 2016.",
    "Rob Portman (R), an establishment-aligned Republican.",
    "The Ohio Senate primary saw self-styled populist J.D.",
    "It's a big-tent party.",
    "Janice McGeachin (R).",
    "In Georgia, Gov.",
    "Idaho Gov."
  ]
}