{
  "id": 91,
  "mediaId": 19,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Liz Cheney Aided in GOP Primary by Ad Agency Linked to Biden, BLM, Planned Parenthood",
  "image": "https://media.breitbart.com/media/2020/03/GettyImages-1189312210-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/07/liz-cheney-aided-in-gop-primary-by-ad-agency-linked-to-biden-blm-planned-parenthood/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    1147,
    1147,
    1248,
    1248,
    2087,
    2087,
    1609,
    1609,
    400,
    400,
    146,
    183,
    183,
    146,
    428,
    428,
    2976,
    2976
  ],
  "sentences": [
    "Hageman is a Donald Trump-endorsed candidate and has a strong shot at defeating Cheney in the open primary on August 16.\nWe're currently working on a new project in Wyoming, where we're asking for people to explain why Liz Cheney is their ideal representative, regardless of their party affiliation,? an email from People First to a Wyoming resident reads.",
    "She accepted an appointment from House Speaker Nancy Pelosi (D-CA) to the January 6 Committee, where she has played a key role in using the committee as an overbroad cudgel against Republicans.",
    "Under the agency's former name, the pro-leftist group has received disbursements of hundreds of thousands of dollars from radical organizations, Federal Election Commission records show.",
    "We need your help explaining why a vote for Liz Cheney is a vote to preserve democracy in this country.?\nIf you'd be interested in helping me with this project, please let me know.",
    "In February, the establishment GOP Wyoming legislature also protected Cheney by blocking legislation that would have prevented Democrats from participating in a Republican primary.",
    "We know this isn't an easy ask, but Donald Trump is supporting a candidate running against Liz Cheney, and has said defeating her is his number one priority,? the email continues.",
    "The conservative group Wyoming Values PAC is plastering anti-Liz Cheney billboards across Wyoming, encouraging voters to support her Trump-backed challenger Harriet Hageman.",
    "The agency's website indicates it is affiliated with far-left Democrat organizations, such as President Biden's campaign arm, Planned Parenthood, and Black Lives Matter.",
    "The email was signed by Val Cheney, who, according to a recent version of her LinkedIn page, goes by (She/Her)? and appears to have no affiliation with Liz Cheney.",
    "The poll, conducted by the Wyoming Republican State Central Committee via secret ballot, showed Hageman won 59 votes and Cheney six, a 53-point victory by Hageman.",
    "Cheney was removed as GOP conference chair in May after the Republican caucus held a no-confidence vote upon reaching a boiling point with Dick Cheney's daughter.",
    "The agency has sent Wyoming residents emails detailing a project it is conducting to defeat Cheney's opponent Harriet Hageman, Breitbart News has learned.",
    "The Republican National Committee in February symbolically censured Cheney for allying with Democrats and is weighing whether to defund her campaign.",
    "A left-wing political advertising agency has reportedly begun promoting Rep. Liz Cheney (R-WY) to Democrats in the Wyoming Republican primary.",
    "Cheney also reportedly orchestrated unprecedented? Republican sabotage by generating a Republican hit piece in the Washington Post.",
    "She doesn't represent our values.?\nA straw poll in January among GOP activists showed Hageman holds a commanding lead over Cheney.",
    "The email is another example of how Democrats are encouraging party members to vote for Cheney in the open Republican primary.",
    "The agency's name is People First but was previously known as Main Street One,? according to the agency CEO's LinkedIn page.",
    "https://t.co/OWuETXIiQK\n Breitbart News (@BreitbartNews) May 6, 2022\nCheney has allied herself with Democrats.",
    "But Democrats encouraging Democrats to vote for Cheney appears to be a strategy to keep Cheney in office.",
    "It is unknown who is paying the group to push Democrats to vote for Cheney in the Republican primary.",
    "Among those organizations are Biden for President? and the Democratic Senatorial Campaign Committee.",
    "In a rare move, House Minority Leader Kevin McCarthy (R-CA) has also endorsed Cheney's opponent.",
    "Wyoming rules allow Democrats to vote for Republican primary candidates and vice versa.",
    "I'd be happy to chat via email, or 1-1, about all the details,? the email concludes.",
    "McCarthy's reason for endorsing Hageman mirrors the overall GOP criticism of Cheney.",
    "In November, the Wyoming GOP voted to no longer recognize Cheney as a Republican.",
    "Democrats are desperate to protect one of their allies, like Cheney.",
    "She doesn't represent us,? Hageman told Breitbart News.",
    "Liz Cheney doesn't live in Wyoming.",
    "Liz Cheney has lost Wyoming."
  ]
}