[
  {
    "id": 2902,
    "mediaId": 8491,
    "date": "2022-02-02",
    "sentence": "",
    "author": "TOM WITHERS - AP Sports Writer",
    "title": "Browns refute tanking claims by former coach Hue Jackson"
  },
  {
    "id": 2738,
    "mediaId": 8491,
    "date": "2022-02-03",
    "sentence": "We must regain control of the United States Senate and eliminate the possibility of career DC politicians like <span class='selected-term'>Tim Ryan</span> from representing Ohio.”",
    "author": "Jen Steer",
    "title": "Bernie Moreno ends bid for U.S. Senate"
  },
  {
    "id": 2642,
    "mediaId": 2630,
    "date": "2022-02-04",
    "sentence": "He worried that the GOP was “on the wrong side of history” on the issue, said Cox, who is no longer close with Mandel and has donated to two of his 2022 rivals, Republican Matt Dolan and Rep. <span class='selected-term'>Tim Ryan</span>, the front-runner for the Democratic nomination.",
    "author": "",
    "title": "Josh Mandel foreshadowed Trump’s rise. His Ohio Senate bid is a test of what’s next."
  },
  {
    "id": 2540,
    "mediaId": 8371,
    "date": "2022-02-04",
    "sentence": "",
    "author": "Associated Press",
    "title": "After meeting with Trump, Bernie Moreno leaves US Senate primary"
  },
  {
    "id": 2307,
    "mediaId": 2643,
    "date": "2022-02-04",
    "sentence": "The eventual winner of the Republican primary will likely face Democratic Rep. <span class='selected-term'>Tim Ryan</span> in the race for the Ohio seat.",
    "author": "Ewan Palmer",
    "title": "Donald Trump Clears Path for MAGA Ticket in Ohio's GOP Senate Race"
  },
  {
    "id": 1698,
    "mediaId": 8484,
    "date": "2022-02-17",
    "sentence": "While the Cook Political Report puts the seat as a 'lean Republican,' the GOP is poised to have a far messier primary than Democrats, who likely will pick moderate Rep. <span class='selected-term'>Tim Ryan</span> as their choice, who has a national profile due to a brief presidential run.",
    "author": "Katelyn Caralle",
    "title": "Is this the world's most secure phone? Biden lands back at the White House talking on his iPhone with a case with the Presidential seal with the US warning Putin is on the brink of invasion"
  },
  {
    "id": 14,
    "mediaId": 2658,
    "date": "2022-02-21",
    "sentence": "If the Senate choice is between an engagement-oriented Democrat like Rep. <span class='selected-term'>Tim Ryan</span>, who has called for sending Ohio-built tanks to Poland to deter Russia, or a Tucker Carlson-style Republican like Mandel, Marko doesn’t know whom he will pick.",
    "author": "",
    "title": "Tucker Carlson Says Ukraine Isn’t Important. These Key GOP Voters Beg to Differ."
  },
  {
    "id": 15319,
    "mediaId": 2919,
    "date": "2022-03-06",
    "sentence": "And dammit, we should get them the planes that they need to be able to protect their citizens there,” said Rep. <span class='selected-term'>Tim Ryan</span> (D - OH 13th District), who was on the call with Zelenskyy.",
    "author": "Catherine Ross",
    "title": "Ukrainian soldiers receive help from Northeast Ohio"
  },
  {
    "id": 11048,
    "mediaId": 2699,
    "date": "2022-03-15",
    "sentence": "“Meanwhile, <span class='selected-term'>Tim Ryan</span> is just plugging along.”\nThe four candidates in the MAGA lane are essentially devoting time and resources to an entirely separate primary contest, said one D.C. operative with deep ties to the state: “Whatever the hell is going on at Mar-a-Lago… who’s down there, who’s meeting with Trump, here’s why you shouldn’t pick J.D., or Jane, or Josh, or Mike.”\nThe one Republican candidate who is not playing in the Mar-a-Lago primary is Dolan, the state senator whose family owns the Cleveland Guardians baseball team.",
    "author": "Sam Brodey",
    "title": "Trump’s Having a Blast Watching Ohio Senate Candidates Try to Kiss His Ass"
  },
  {
    "id": 9250,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "Paul LePage, a Republican seeking an unprecedented third nonconsecutive term, are now officially on a collision course for the Blaine House this fall after no other candidates qualified to run for their party’s nomination.”\n— “Securing the TikTok Vote,” by Anna Kambhampaty, The New York Times: “If all politics is theater, Rep. <span class='selected-term'>Tim Ryan</span> (D-Ohio) is one of its subtler actors.",
    "author": "",
    "title": "Gibbons and Mandel go for round 2"
  },
  {
    "id": 9032,
    "mediaId": 2573,
    "date": "2022-03-26",
    "sentence": "The winner of the GOP contest will likely face off in November against longtime Rep. <span class='selected-term'>Tim Ryan</span> of northeast Ohio, who’s the frontrunner in a much smaller and less combustible Democratic Senate primary.",
    "author": "Paul Steinhauser",
    "title": "Ohio GOP Senate showdown: Gold Star mother takes aim at Gibbons in new Mandel ad blitz"
  },
  {
    "id": 6075,
    "mediaId": 2919,
    "date": "2022-04-12",
    "sentence": "\"I also think it's a political liability like at the end of the day this is the Republican Primary, we need to send the best Republican to take on <span class='selected-term'>Tim Ryan</span> if you're making gaffes like that it maybe means that you shouldn't be running on the big stage.\"",
    "author": "John Kosich",
    "title": "GOP Senate hopefuls Vance, Gibbons campaign in Northeast Ohio ahead of May primary"
  }
]