[
  {
    "id": 3981,
    "mediaId": 6676,
    "date": "2022-01-21",
    "sentence": "On the other side of the political aisle, Democrats appear to be coalescing around Rep. <span class='selected-term'>Tim Ryan</span> as he looks to jump to the upper chamber.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "These Senate seats are up for election in 2022"
  },
  {
    "id": 2596,
    "mediaId": 2512,
    "date": "2022-02-09",
    "sentence": "There has not been much polling in Ohio but a poll last fall showed Rep. <span class='selected-term'>Tim Ryan</span>, the likely Democratic nominee, in a tight race with any of the likely Republican nominees in a state that Trump easily carried twice.",
    "author": "Igor Derysh",
    "title": "Republicans in chaos: Conflict with Trump endangers GOP Senate prospects"
  },
  {
    "id": 950,
    "mediaId": 8322,
    "date": "2022-02-16",
    "sentence": "It’s a similar story in Ohio, where moderate hopeful Rep. <span class='selected-term'>Tim Ryan</span> has vastly out-raised his Democratic opponents, while Republican contenders include author J.D.",
    "author": "",
    "title": "Introducing Fox News Power Rankings for 2022"
  },
  {
    "id": 5711,
    "mediaId": 2883,
    "date": "2022-04-18",
    "sentence": "Ohio Democratic Rep. <span class='selected-term'>Tim Ryan</span>, the favorite for the Senate nomination, raised $4.1 million and has $6.5 million on hand.",
    "author": "Mary Ellen McIntire",
    "title": "Senate Democrats raise money furiously to defend majority"
  },
  {
    "id": 4778,
    "mediaId": 2540,
    "date": "2022-04-23",
    "sentence": "Ohio Rep. <span class='selected-term'>Tim Ryan</span>, the leading Democrat in an open-seat Senate race, has co-sponsored a bill that would prevent the Biden administration from what he calls a \"wrong and reckless\" decision to lift the Title 42 restrictions.",
    "author": "Eric Bradner",
    "title": "Swing-state Democrats turn on Biden over Title 42 border decision"
  }
]