[
  {
    "id": 4306,
    "mediaId": 2550,
    "date": "2022-01-22",
    "sentence": "Rep. <span class='selected-term'>Tim Ryan</span> of Ohio, for instance, is running for the state's open Senate seat and just might make that race competitive if inflation comes down, the pandemic becomes more manageable, and Republicans nominate a pro-Trump extremist who can't moderate for the general election (odds are decent on that part of the equation).",
    "author": "",
    "title": "It's time for Democrats to quit talking about Democrats and do nothing but pillory Republicans"
  },
  {
    "id": 3134,
    "mediaId": 2540,
    "date": "2022-02-03",
    "sentence": "On the Democratic side, Rep. <span class='selected-term'>Tim Ryan</span>, who raised $2.9 million last quarter, has largely consolidated support, but Ohio, which Trump carried by 8 points, remains a tough state for anyone in his party who’s not Sen. Sherrod Brown.",
    "author": "Simone Pathe",
    "title": "The 10 Senate seats most likely to flip in 2022"
  },
  {
    "id": 2594,
    "mediaId": 2514,
    "date": "2022-02-07",
    "sentence": "",
    "author": "David Jackson",
    "title": "As Trump and McConnell feud over GOP's future, Republican candidates tread lightly"
  },
  {
    "id": 2596,
    "mediaId": 2512,
    "date": "2022-02-09",
    "sentence": "There has not been much polling in Ohio but a poll last fall showed Rep. <span class='selected-term'>Tim Ryan</span>, the likely Democratic nominee, in a tight race with any of the likely Republican nominees in a state that Trump easily carried twice.",
    "author": "Igor Derysh",
    "title": "Republicans in chaos: Conflict with Trump endangers GOP Senate prospects"
  },
  {
    "id": 2584,
    "mediaId": 2664,
    "date": "2022-02-09",
    "sentence": "There has not been much polling in Ohio but a poll last fall showed Rep. <span class='selected-term'>Tim Ryan</span>, the likely Democratic nominee, in a tight race with any of the likely Republican nominees in a state that Trump easily carried twice.",
    "author": "Igor Derysh",
    "title": "Republicans in chaos: Conflict with Trump endangers GOP Senate prospects"
  },
  {
    "id": 474,
    "mediaId": 2745,
    "date": "2022-02-22",
    "sentence": "If she wins, she’d face Rep. <span class='selected-term'>Tim Ryan</span>, the expected Democratic nominee.",
    "author": "",
    "title": "Opinion J.D. Vance’s repulsive spin about Putin and Ukraine faces a new test"
  },
  {
    "id": 5984,
    "mediaId": 2745,
    "date": "2022-04-11",
    "sentence": "Democratic front-runner <span class='selected-term'>Tim Ryan</span> would no doubt rather one of them prevail than Matt Dolan, the state senator and part owner of the Cleveland Guardians, who insists on talking about the issues.",
    "author": "",
    "title": "Opinion: If Democrats get some easy midterm wins, they can thank Trump"
  }
]