[
  {
    "id": 3556,
    "mediaId": 2658,
    "date": "2022-01-25",
    "sentence": "New Joint Fundraisers\nNC OH Victory (Reps. <span class='selected-term'>Tim Ryan</span>, Cheri Beasley)\nNew PACs\nADVANCE LIBERTY PAC (Super PAC)\nMichael Hackmer (PAC)\nMuskogee Diversity Coalition (Super PAC)\nVote the R (Super PAC)\nNew Lobbying Registrations\nAcg Advocacy: Pulse Clinical Alliance, LLC\nAcg Advocacy: Better Medicare Alliance\nBose Public Affairs Group: Intel Corporation\nBose Public Affairs Group: The Pharmaceutical Care Management Association\nCapitol Advocacy & Government Affairs, LLC: The Livingston Group (On Behalf Of Rush University Health System)\nForm Energy, Inc.: Form Energy, Inc.\nHorizons Global Solutions LLC: Gene Capture\nLaw Offices Of Frederick H. Graefe, Pllc: Hypatia Group, Inc.\nMcallister & Quinn, LLC: Moldex-Metric, Inc.\nMccarthy Strategic Solutions: Inotiv, Inc.\nNew Century Government Affairs (F/K/A Terrence C. Wolfe): Nuc University\nSquire Patton Boggs: Town Of Breckenridge And Summit County\nSunday Creek Horizons, LLC: Buy Ohio Ppe Manufacturer'S Network\nSustainable Strategies Dc: City/County Association Of Governments Of San Mateo County\nSustainable Strategies Dc: City Of Rifle, Co\nSustainable Strategies Dc: Town Of Silverthorne, Co\nTck International, LLC: Dla Piper LLP (US) (For St George'S University)\nThe Ferguson Group: Central Arizona Irrigation & Drainage District\nThe Ferguson Group: Maricopa Stanfield Irrigation & Drainage District\nThe Vogel Group: Emit-Less\nThe Vogel Group: Resilient Enterprise Solutions\nThe Vogel Group: Vita Inclinata Technologies, Inc.\nWilmer Cutler Pickering Hale And Dorr LLP: Glencore International Ag\nNew Lobbying Terminations\nCapitol Hill Consulting Group: Neurostat Analytical Solutions\nCapitol Hill Consulting Group: Premier Food Group, Inc.\nConnect Strategy LLC: Harvey Gulf International Marine\nConnect Strategy LLC: Muwekma Ohlone Tribe Of San Francisco Bay Area\nJefferson Business Consulting, LLC: Leiters\nLemunyon Group, LLC: Rai Services CompanyNoology, Inc.: Trident-Defence, LLC\nShook, Hardy & Bacon, LLP: American Assn Of Health Plans\nThe Ferguson Group: Bighorn Public Affairs Group, LLC\nThe Ferguson Group: Food Northwest\nThe Ferguson Group: Kansas Bostwick Irrigation District 2\nThe Parr Policy Group, LLC: Effective Advocates LLC On Behalf Of The Gc3 Sustainable Chemistry Alliance\nFollow Us",
    "author": "",
    "title": "Ballard forms a cannabis practice"
  },
  {
    "id": 12803,
    "mediaId": 2550,
    "date": "2022-03-07",
    "sentence": "Hagan ran for Congress during the last two cycles under the old map: She lost the 2018 primary for the 16th to now-Rep. Anthony Gonzalez, and the 2020 general election for the 13th to Democratic incumbent <span class='selected-term'>Tim Ryan</span>.",
    "author": "",
    "title": "Morning Digest: With filing closed, here's how things looks in North Carolina's new House districts"
  },
  {
    "id": 5092,
    "mediaId": 2550,
    "date": "2022-04-23",
    "sentence": "Democratic Congressman <span class='selected-term'>Tim Ryan</span> is running for Ohio's open Senate seat and he just launched a new ad declaring, \"We've got to take on China and be Americans first.\"",
    "author": "",
    "title": "The Downballot: Why House Democrats' best defense is a good offense (transcript)"
  }
]