[
  {
    "id": 2694,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "",
    "author": "",
    "title": "Republican Bernie Moreno drops out of crowded Ohio Senate primary"
  },
  {
    "id": 950,
    "mediaId": 8322,
    "date": "2022-02-16",
    "sentence": "It’s a similar story in Ohio, where moderate hopeful Rep. <span class='selected-term'>Tim Ryan</span> has vastly out-raised his Democratic opponents, while Republican contenders include author J.D.",
    "author": "",
    "title": "Introducing Fox News Power Rankings for 2022"
  },
  {
    "id": 14,
    "mediaId": 2658,
    "date": "2022-02-21",
    "sentence": "If the Senate choice is between an engagement-oriented Democrat like Rep. <span class='selected-term'>Tim Ryan</span>, who has called for sending Ohio-built tanks to Poland to deter Russia, or a Tucker Carlson-style Republican like Mandel, Marko doesn’t know whom he will pick.",
    "author": "",
    "title": "Tucker Carlson Says Ukraine Isn’t Important. These Key GOP Voters Beg to Differ."
  },
  {
    "id": 548,
    "mediaId": 8491,
    "date": "2022-02-22",
    "sentence": "We are also working with our European allies to ensure Ukraine’s military has the equipment and resources to defend itself.”\nCognressman <span class='selected-term'>Tim Ryan</span>\nSenator Rob Portman, R-Ohio, supports the sanctions and called on the Biden Administration to do more.",
    "author": "Gerry Ricciutti",
    "title": "Local lawmakers in unison over Russia-Ukraine conflict"
  },
  {
    "id": 15895,
    "mediaId": 8480,
    "date": "2022-03-05",
    "sentence": "YOUNGSTOWN, Ohio (WKBN) – After a 50-minute call with Ukraine President Volodymyr Zelenskyy, Valley Congressman <span class='selected-term'>Tim Ryan</span> said it’s clear that the U.S. can do more to help.",
    "author": "Chelsea Simeon",
    "title": "‘They need planes,’ Ohio Congressman says after talks with Ukraine president"
  },
  {
    "id": 9644,
    "mediaId": 2752,
    "date": "2022-03-21",
    "sentence": "Democrat <span class='selected-term'>Tim Ryan</span> is both emotionally stable and has never, to our knowledge, called Gibbons a “pussy,” at least not publicly, but he’s still a socialist or whatever lies Republicans tell themselves to rationalize their continued support for the absolute worst people.",
    "author": "Stephen Robinson",
    "title": "All Fun And Games Until Ohio GOP Senate Candidate Starts Calling Opponent A 'Pussy'"
  },
  {
    "id": 12069,
    "mediaId": 2702,
    "date": "2022-03-29",
    "sentence": "Rep. <span class='selected-term'>Tim Ryan</span>’s (D) Ohio Senate campaign launched a $3.3 million ad buy, marking his first of the campaign cycle.",
    "author": "Julia Manchester",
    "title": "Tim Ryan launches $3.3 million ad buy"
  },
  {
    "id": 10276,
    "mediaId": 8278,
    "date": "2022-03-31",
    "sentence": "WASHINGTON, D.C. — U.S. Reps. <span class='selected-term'>Tim Ryan</span>, D-13 Ohio, and Bill Johnson, R-6 Ohio, introduced legislation Thursday that would lead to the Youngstown-Warren Regional Airport (YNG) and Youngstown Air Reserve Station (YARS) being designated as a primary airport.",
    "author": "",
    "title": "Legislation Would Designate YNG/YARS as a ‘Primary Airport’"
  },
  {
    "id": 10586,
    "mediaId": 8291,
    "date": "2022-03-31",
    "sentence": "U.S. Reps. <span class='selected-term'>Tim Ryan</span>, D-Howland, and Bill Johnson, R-Marietta, introduced legislation that would designate any airport in use by an air reserve station as a “primary airport.”\nThe change in the United States Code would allow the Youngstown-Warren Regional Airport and Youngstown Air Reserve Station to be once again designated as a primary airport.",
    "author": "",
    "title": "Thur. 10:15 a.m.: Legislators join forces to increase airport funding"
  },
  {
    "id": 6915,
    "mediaId": 8455,
    "date": "2022-04-15",
    "sentence": "U.S. Rep. <span class='selected-term'>Tim Ryan</span> (D., Warren) launched a new ad Friday in his campaign for U.S. Senate that highlighted some of the leading talking points he’s brought with him on the road across Ohio.",
    "author": "Trevor Hubert",
    "title": "Ryan highlights middle-class issues in latest TV ad"
  },
  {
    "id": 4699,
    "mediaId": 2590,
    "date": "2022-04-23",
    "sentence": "Advertisement\nThe Republican Senate nominee is expected to face Democrat <span class='selected-term'>Tim Ryan</span> in the general election.",
    "author": "Liz Skalka",
    "title": "Donald Trump On J.D. Vance: 'He Said Some Bad S**t About Me'"
  }
]