{
  "id": 2214,
  "mediaId": 21,
  "date": "d2022-04-18T14:00",
  "headline": "Republican candidates seeking Trump's endorsement need to show him 'printouts' with 'big' fonts: 'He's not a real big digital guy'",
  "image": "https://i.insider.com/625d74fad2039d0019ba2f66?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/trump-printouts-charts-big-fonts-midterm-endorsements-gop-candidates-nyt-2022-4",
  "sentiment": "-0.672",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Lahut",
  "authorUrl": "https://www.businessinsider.com/author/jake-lahut",
  "termIds": [
    1147,
    1200,
    1237,
    1374,
    1997,
    2006,
    2125,
    2303,
    78,
    234,
    296,
    427,
    428,
    2661,
    2826
  ],
  "sentences": [
    "Rep. Billy Long, a Republican of Missouri, recalled visiting Mar-a-Lago to meet with Trump for a discussion on his Senate run in The Show-Me State when the former president \"reached over and picked up another poll\" after Long gave Trump a printed copy of another one, the congressman told The Times.",
    "Former President Donald Trump prefers Republican candidates seeking his endorsement to come equipped with \"compelling visual material\" when they visit him at his Mar-a-Lago estate in Florida, according to the New York Times.",
    "Previous reporting by The Times found Trump struggled to focus during his daily intelligence briefings throughout his White House tenure, instead preferring bullet points and simplified charts, ideally limited to one page.",
    "Kent is running in a primary challenge against Republican Rep. Jaime Herrera Beutler of Washington, who was one of 10 House Republicans to vote for Trump's second impeachment.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Best practices for Trump printouts include photos and graphics in color, as well as big fonts, which Times reporter Shane Goldmacher described as \"crucial.\"",
    "\"He's not a real big digital guy, so we had printouts,\" Trump-endorsed House GOP candidate Joe Kent told The Times.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Joe Raedle/Getty Images\nGOP candidates making the pilgrimage to Mar-a-Lago need big league charts, the NYT reports.",
    "Those vying for Trump's endorsement need to bring charts with photos, and \"big fonts are crucial.\"",
    "\"Donald J. Trump is going to do what he wants to do when he wants to do it,\" Long said.",
    "A House candidate said he came with printouts because Trump isn't \"a big digital guy.\"",
    "\"I don't need, you know, 200-page reports on something that can be handled on a page.",
    "\"I like bullets or I like as little as possible,\" Trump told Axios in January 2017.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Former President Donald Trump at a 2016 campaign rally.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"There is no secret sauce here.\"",
    "Loading Something is loading.",
    "That I can tell you.\""
  ]
}