{
  "id": 2217,
  "mediaId": 376,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "New lines, interesting races in Washington state",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/04/house_dems274_030320.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/04/12/new-lines-interesting-races-in-washington-state/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2125,
    2214,
    2214,
    2436,
    2436,
    2249,
    2249,
    2005,
    2005,
    1983,
    1983,
    2030,
    2030,
    2074,
    2074,
    2010,
    2087,
    2010,
    2087,
    2125,
    1614,
    1563,
    1563,
    1895,
    1895,
    1810,
    1810,
    1614,
    736,
    736,
    683,
    683,
    1384,
    1384,
    1335,
    1335,
    1248,
    1248,
    1194,
    1194,
    1147,
    1147,
    571,
    571,
    545,
    545,
    449,
    449,
    562,
    562,
    183,
    183,
    428,
    428,
    2888,
    2791,
    2791,
    2888,
    2942,
    2945,
    2902,
    2902,
    2959,
    2959,
    2945,
    2942,
    2957,
    2957
  ],
  "sentences": [
    "The GOP field includes Army veteran/Amazon senior program manager Jesse Jensen (who lost to Schrier, 52 percent to 48 percent, in 2020), 2020 GOP state Attorney General nominee Matt Larkin (who would have carried the new 8th in that race, 51 percent to 49 percent), and King County Councilman/2012 GOP state Attorney General nominee Reagan Dunn, whose mother, Jennifer Dunn, held this seat for six terms in the 1990s and 2000s.",
    "Races rated Solid Democratic\n1st District (Suzan DelBene, D)\n2nd District (Rick Larsen, D)\n6th District (Derek Kilmer, D)\n7th District (Pramila Jayapal, D)\n9th District (Adam Smith, D)\n10th District (Marilyn Strickland, D)\nRaces rated Solid Republican\n3rd District (Jaime Herrera Beutler, R)\n4th District (Dan Newhouse, R)\n5th District (Cathy McMorris Rodgers, R)\nNathan L. Gonzales is an elections analyst for CQ Roll Call.",
    "Even with the intraparty fighting, Republicans should hold the seat considering Trump would have carried it by 8 points in 2016 and 4 points in 2020, although Kent would bring some serious baggage to the table if he knocks off the congresswoman in the primary and this could turn into a GOP headache if he's the party nominee.",
    "[More House race ratings | Initial Senate race ratings]\nAside from the 8th District, the 3rd and 4th Districts are worth watching because GOP Reps. Jaime Herrera Beutler and Dan Newhouse voted to impeach President Donald Trump, and the former president has made it his mission to oust all 10 Republicans who did.",
    "8th District (Kim Schrier, D)\nThe partisan performance of the 8th District didn't change substantively, which is mixed news for Democratic Rep. Kim Schrier, who won her last two races by 5 points (2018) and 4 points (2020) in more favorable political environments for her party than 2022 is shaping up to be.",
    "ANALYSIS  While the most important event in Washington state this fall will be Denver Broncos quarterback Russell Wilson's return to Seattle to play his former team the Seahawks, the second-most important game to watch will be the fight for the 8th Congressional District.",
    "Even though Biden won the district in 2020 and Hillary Clinton won it in 2016, Republicans have about a 3-point performance edge in a composite of statewide and federal elections over the past three cycles, as calculated by Bradley Wascher of Inside Elections.",
    "While Democrats currently have a 7-to-3 advantage in the House delegation, Republicans could gain at least one seat in their quest to net five seats nationwide and take back the majority  and the speaker's gavel.",
    "But the GOP likes its expected standard-bearer, former triage nurse Tiffany Smiley, and Biden's poor approval rating could put seats in traditionally Democratic states into play.",
    "Similar to the 3rd and 4th Districts, the Republicans will run with Schrier on the Aug. 2 primary ballot and the top two finishers will advance to the November general election.",
    "The district is still geographically diverse, combining the eastern part of the Seattle metropolitan area with communities on the opposite side of the Cascade Mountains.",
    "In 2020, Republican and Trump Republican Party? candidates finished ahead of Democratic candidates 49.2 percent to 47.5 percent, including Schrier's 43 percent.",
    "But those two aren't the only Republicans in the race: State Rep. Vicki Kraft and Christian speaker/author/homeschool advocate Heidi St. John are also running.",
    "Joe Biden would have won the seat by about 7 points in 2020, but that margin puts it within reach for a GOP takeover if the key 2021 races are any guide.",
    "The incumbent congresswoman, who was first elected in 2010, has won 56 percent, 42 percent and 56 percent of the primary vote in the past three cycles.",
    "Hennrich isn't raising a lot of money  he had less than $10,000 in the bank on Dec. 31  but he could benefit from consolidating the Democratic vote.",
    "Trump endorsed 2020 GOP gubernatorial nominee Loren Culp, who refused to concede that race despite losing by 13.5 points to Democratic Gov.",
    "Not only will Washington host at least one competitive House race, the U.S. Senate race there is worth watching for evidence of a GOP wave.",
    "Businessman Doug White is running on the Democratic side and hoping to take advantage of an opportunity should Republicans hand him one.",
    "After gaining a seat following the 2010 census, Washington state maintained its 10 districts during the latest round of apportionment.",
    "Businessman/Navy veteran/former NASCAR driver Jerrod Sessler, state Rep. Brad Klippert and other Republicans are running as well.",
    "Democratic Sen. Patty Murray is up for reelection, and Republicans haven't won a Senate race in the Evergreen State since 1994.",
    "But Trump won the newly drawn district by 17 points, so a Democratic upset is much less likely here than in the 3rd District.",
    "Everyone will run together on the Aug. 2 ballot, including former cinema installation manager Brent Hennrich, a Democrat.",
    "Newhouse faces a somewhat similar situation to the east in a 4th District that includes Yakima and the Tri-Cities.",
    "Democratic candidates in the Virginia and New Jersey gubernatorial races underperformed Biden by a dozen points.",
    "For some reference, Schrier received just 19 percent in the 2018 primary, but that was enough for second place.",
    "With more than $4 million in the bank on Dec. 31, Schrier starts with a considerable financial advantage.",
    "In southwestern Washington, Trump has endorsed former Army Green Beret Joe Kent against Herrera Beutler.",
    "But this is looking like a difficult seat for Democrats to hold in this political environment.",
    "The top two vote-getters will move on to the November general election, regardless of party.",
    "In total, Democratic candidates outpaced GOP candidates, 50 percent to 47 percent.",
    "Smelling an opportunity, there are multiple credible Republicans in the race.",
    "But at the outset, the race is rated Solid Republican.",
    "None of the Republicans had more than $400,000.",
    "The race is initially rated Solid Republican.",
    "Republicans will be more fractured.",
    "Initial rating: Toss-up.",
    "Jay Inslee."
  ]
}