{
  "id": 2237,
  "mediaId": 157,
  "date": "2/25/2022 12:00:00 AM",
  "headline": "Kevin McCarthy squaring off with far-right Republicans over pivotal House seat: report",
  "image": "https://www.rawstory.com/media-library/kevin-mccarthy-marjorie-taylor-greene.jpg?id=29424872&width=1200&coordinates=0%2C17%2C0%2C33&height=600",
  "link": "https://www.rawstory.com/kevin-mccarthy-2656789909/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1609,
    2125,
    2248,
    2303,
    403,
    428,
    562,
    2661,
    2707
  ],
  "sentences": [
    "I'm going to side with the Jim Jordans  the tip of the spear in Washington.?\n\"This Texas primary is reigniting the long-running, intra-party battle between insurgent candidates  tea partiers in the early 2010s, MAGA-world in the 2020s  and more establishment-oriented Republicans, each trying to grow their influence in Congress.",
    "Wins by some of the candidates challenging GOP members who voted to impeach Trump last year, like Reps. Jaime Herrera Beutler (R-Wash.) and Dan Newhouse (R-Wash.), could pad the numbers even more,\" with GOP campaign advisor Doug Heye adding, \"The next speaker is going to have a hard time governing the House.\"",
    "The same competition is set to play out again in a slew of GOP primaries this year, from Illinois to Tennessee to Florida,\" the report states with GOP strategist Ken Spain predicting, \"It also provides you with a glimpse of what governing the Republican conference is going to be like in 2023.\"",
    "McCarthy's involvement suggests that this year, he won't shy away from intervening in deep-red primaries if the outcome could determine whether he leads a majority that is largely aligned with his goals  or one with a significant faction of rabble-rousers willing to publicly stymie his plans.\"",
    "On one side you have McCarthy and more mainstream Republicans lining up behind Navy SEAL Morgan Luttrell while Reps. Marjorie Taylor Greene (R-GA) and Madison Cawthorn (R-NC) are backing far-right extremist Christian Collins for the open seat currently held by Rep. Kevin Brady (R).",
    "According to a report from Politico, House Minority Leader Kevin McCarthy (R-CA) is wading into a battle over a House seat in Texas where he is facing off with far-right members of his party over which GOP candidate will be on the ballot in the general election in November.",
    "What is at stake, Politico's report states is the direction of the party in the House after the election and could determine whether McCarthy becomes the new House speaker after the Republicans take control of the chamber as expected.",
    "According to the p Politico Report, \"This March primary for a deep-red seat pits MAGA forces against the Republican establishment, and the skirmish is part of a larger fight to determine the contours of a possible new GOP majority.",
    "What is concerning for McCarthy is comments made by Collins that he fully intends to serve in the manner of Taylor Greene and Cawthorn who are more interested in bomb-throwing than passing legislation.",
    "The Politico report adds, \"Taken all together, wins by even a handful of MAGA diehards could create a faction with powerful sway in the House GOP.",
    "As Collins explained, \"We cannot have people that are going to go to Washington and go along to get along with the Washington establishment.",
    "I'm going to side with the Marjorie Taylor Greenes.",
    "I'm going to side with the Madison Cawthorns."
  ]
}