{
  "id": 23,
  "mediaId": 195,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "Veteran lawmaker's exit has House GOP trending toward Trump",
  "image": "https://h104216-fcdn.mp.lura.live/1/938892/pvw_lin/A8D/F8A/A8DF8A5E1BC21342B339A0431A771B43_6.jpg?aktaexp=1649205084&aktasgn=7b11bfd36e8c39441fb992043a926a78",
  "link": "https://thehill.com/news/house/3259934-veteran-lawmakers-exit-has-house-gop-trending-toward-trump/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Marcos",
  "authorUrl": "https://thehill.com/author/cristina-marcos/",
  "termIds": [
    2214,
    2214,
    2087,
    2087,
    1983,
    1983,
    2005,
    2005,
    2010,
    2010,
    1614,
    1614,
    1147,
    1147,
    1248,
    1248,
    428,
    428,
    562,
    562
  ],
  "sentences": [
    "Huizenga said in a statement that Upton will leave a statesman-like legacy,? and Rep. Jeff Duncan (R-S.C.) called him a real leader on Energy and Commerce? who will be missed by this conference and by Congress.?\nI'm sad for the institution,? said Katko, one of the other GOP members who voted for impeachment who is not seeking reelection.",
    "He's had a long career, distinguished, he talked about things like 21st Century Cures, a bill I think that for generations to come will help cure more diseases.?\nUpton helped spearhead the 21st Century Cures Act, a 2016 law signed by former President Obama at the end of his term, aimed to accelerate medical innovation and advances.",
    "The browser does not support the specified video codec\nRep. Fred Upton (Mich.) on Tuesday announced he will retire from Congress at the end of the year, becoming the latest House Republican who voted to impeach President Trump for inciting the Jan. 6, 2021, attack on the Capitol to head for the exits.",
    "Kinzinger expressed frustration with far-right members of the House GOP conference focusing on culture war fights like Florida's new law barring instruction on sexual orientation in kindergarten through third grade instead of war atrocities in Ukraine under Russian President Vladimir Putin.",
    "In contrast to widespread praise for Upton, House Republicans have taken a far more hostile attitude toward two of their other members who voted to impeach and went on to serve on the select committee investigating last year's attack on the Capitol by a mob of Trump's supporters.",
    "Upton only mentioned Trump once in his retirement announcement speech, noting that the bipartisan infrastructure bill won little GOP support despite the former president's previous call for a proposal twice as expensive with no pay-fors? during his administration.",
    "Cheney and Kinzinger have faced calls to be officially removed from the House Republican Conference as well as censure by the Republican National Committee for accepting appointments from Speaker Nancy Pelosi (D-Calif.) to serve on the committee.",
    "The increasing ostracization from his own party marked a sharp turnaround from less than a decade ago, when Upton served as chairman of the powerful House Energy and Commerce Committee while Republicans last held the chamber's majority.",
    "Trump has not endorsed a primary challenger against Rep. David Valadao (R-Calif.), whom House Minority Leader Kevin McCarthy (R-Calif.) endorsed despite Trump's stated intention to defeat any Republican who backed impeachment last year.",
    "The other six Republicans who backed Trump's second impeachment are all facing primary challengers  meaning it's possible that none of the 10 GOP yes? votes for Trump's impeachment will be back in Congress in 2023.",
    "And I hope my party can finally remember where our foundations are and actually say that we're not going to be Putin-sympathetic anymore.?\nWishful thinking,? he added, throwing up his arms in frustration.",
    "Cheney is charging ahead with a reelection bid despite that internal party pushback and a Trump-backed primary challenger, Harriet Hageman, for whom more than 100 GOP members held a fundraiser last week.",
    "Fred and I always managed to disagree without vitriolic rhetoric and mean-spirited language.?\nHe has crossed the aisle to join with Democrats on key votes that demonstrated his convictions and values.",
    "Upton received death threats in the fall for being one of the 13 House Republicans who helped hand President Biden a legislative victory by voting for the bipartisan infrastructure bill.",
    "Fred has always put country over party, including when he stood up for our democracy and to ensure the certification of our elections,? House Majority Leader Steny Hoyer (D-Md.)",
    "To him, bipartisan' and compromise' are not forbidden words,? a visibly emotional Rep. Debbie Dingell (D-Mich.) said in a House floor speech that immediately followed Upton's.",
    "But Katko said that pushback from that vote did not factor into his own decision to retire from Congress and that it looks like redistricting really screwed? Upton.",
    "Eager to retaliate against the members who voted to impeach him, Trump last year endorsed a primary challenger, state Rep. Steve Carra, to run against Upton.",
    "But it will be just one battle in the war for the identity of the Republican Party being fought through primaries against those who voted for impeachment.",
    "It's all creating a House GOP that is increasingly in lockstep with the former president, who has been flirting with another White House run in 2024.",
    "But the final redrawn district lines would have ultimately pitted Upton against fellow GOP Rep. Bill Huizenga, who received Trump's endorsement.",
    "In a video posted to Twitter shortly after Upton announced his retirement, Kinzinger made clear he has no regrets about leaving Congress.",
    "Reps. Anthony Gonzalez (Ohio), Adam Kinzinger (Ill.) and John Katko (N.Y.) have similarly opted against running for reelection this year.",
    "Upton's support for Trump's impeachment last year wasn't the only vote that drew ire from Trump, his supporters or the far right.",
    "This was a decision he had to make looking at the dynamics of a member-on-member race,? House Minority Whip Steve Scalise (R-La.)",
    "If it's good policy for Michigan, it's good enough for all of us,? Upton said in a House floor speech announcing his retirement.",
    "House GOP leaders praised Upton and sidestepped the suggestion that his decision to forgo reelection had to do with Trump.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Trump celebrated Upton's decision, declaring that the other yes? votes on impeachment will eventually be turned out.",
    "South Carolina state Rep. Russell Fry got the Trump seal of approval against Rep. Tom Rice (R-S.C.).",
    "Army veteran Joe Kent got the Trump nod in a primary against Rep. Jaime Herrera Beutler (R-Wash.).",
    "Democrats cast Upton's retirement as the latest sign of a GOP increasingly turning to the right.",
    "primary will be the marquee race among those running for reelection who voted to impeach Trump.",
    "I'm glad I'm leaving here in a year, because I'm just being surrounded by a bunch of children.",
    "In Rep. Dan Newhouse's (R-Wash.) district, Trump endorsed retired police chief Loren Culp.",
    "Rep. Peter Meijer (R-Mich.) faces John Gibbs, a former Trump administration official.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "I've worked with seven administrations, seven House Speakers.",
    "Others losing badly, who's next?? he said in a statement.",
    "That eventually prompted Carra to drop out of the race.",
    "None of them would call me a rubber stamp.",
    "So let's grow up,? Kinzinger said.",
    "said during a press conference.",
    "Rep. Liz Cheney's (R-Wyo.)",
    "said in a statement.",
    "4 down and 6 to go.",
    "UPTON QUITS!"
  ]
}