{
  "id": 3123,
  "mediaId": 21,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "House Jan. 6 committee subpoenas Kevin McCarthy for his communications with Trump around time of the Capitol attack",
  "image": "https://i.insider.com/6228dd679fa32d00184c8b57?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/house-jan-6-committee-subpoenas-kevin-mccarthy-over-trump-contacts-2022-5",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brent D. Griffiths",
  "authorUrl": "https://www.businessinsider.com/author/brent-d-griffiths",
  "termIds": [
    1609,
    799,
    1066,
    1081,
    1147,
    562,
    428,
    78
  ],
  "sentences": [
    "\"We have every reason to believe that members of Congress will comply with their legal and moral duty to participate, just as the vast majority of people have participated and cooperated with the investigation,\" Raskin told reporters outside the House chamber, seconds after Perry sped by.",
    "A copy of part of the subpoena that the House January 6 committee sent House Majority Leader Kevin McCarthy House January 6 committee\nThe House panel also issued subpoenas for four other Republican lawmakers: Reps. Scott Perry, Jim Jordan, Mo Brooks, and Andy Biggs.",
    "\"The Select Committee has learned that several of our colleagues have information relevant to our investigation into the attack on January 6th and the events leading up to it,\" Rep. Bennie Thompson, a Democrat who chairs the committee, said in a statement.",
    "When asked if he feared retribution from Republicans should they flip the House this fall, Rep. Adam Schiff, a California Democrat, who also serves on the January 6 panel, said personal safety is the least of his concerns.",
    "\"What I'm most concerned about, if the Republicans should ever get near the gavel, is that they will overturn the next election if Trump loses again,\" Schiff told reporters staking out McCarthy's office.",
    "The House committee investigating the January 6 riot subpoenaed House Minority Leader Kevin McCarthy on Thursday, a sign that the panel will not shy away from securing the testimony of top Republicans.",
    "Like the one where they took evidence, altered it, and lied to the country about it,\" Jordan said of his longstanding reservations about testifying, adding, \"Actually, we have more concerns now.\"",
    "Rep. Jaime Herrera Beutler, one of 10 House Republicans who voted to impeach Trump, cited what McCarthy told her about his conversation with the president in her statement explaining her vote.",
    "Democratic Rep. Jamie Raskin of Maryland, who also serves on the select committee, brushed aside questions about how Democratic leaders might enforce the latest batch of subpoenas.",
    "He further deflected by bringing up rising inflation and the dearth of baby formula as reporters kept pressing him about answering the committee's questions about January 6.",
    "\"Regrettably, the individuals receiving subpoenas today have refused and we're forced to take this step to help ensure the committee uncovers facts concerning January 6th.\"",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Jordan, an Ohio Republican and Trump ally, told Insider he hadn't seen the subpoena yet  then started making a case for why he likely won't talk willingly any time soon.",
    "\"House Republican Leader Kevin McCarthy describes pleading with the President to go on television and call for an end to the mayhem, to no avail,\" she said at the time.",
    "Zak Hudak (@cbszak) May 12, 2022\nIt's unclear how the panel will proceed in the likely scenario that some or all of the Republican lawmakers refuse to cooperate.",
    "Trump reportedly cursed at McCarthy and told the GOP leader of the rioters, \"Well, Kevin, I guess these people are more upset about the election than you are.\"",
    "House Speaker Nancy Pelosi also took the unprecedented step of refusing to seat some of McCarthy's picks on the panel, another major flashpoint for McCarthy.",
    "In particular, the panel is interested in McCarthy's reportedly tense phone call with Trump that occurred as rioters were still ransacking the Capitol.",
    "He has repeatedly blasted the House select committee, which was formed after Senate Republicans blocked the formation of an independent commission.",
    "Lawmakers on the panel want to hear from McCarthy about his communications with President Donald Trump before, during, and after January 6, 2021.",
    "A move to hold their own colleagues in contempt would mark a major escalation and would almost certainly result in a protracted court battle.",
    "Kent Nishimura/Los Angeles Times via Getty Images\nThe House Jan. 6 panel has subpoenaed Kevin McCarthy over his communications with Trump.",
    "McCarthy's call with Trump repeatedly came up as the House considered and later impeached the president for inciting the Capitol riot.",
    "The panel has moved to hold recalcitrant witnesses in contempt, but that's so far been limited to Trump administration officials.",
    "Cheney and McCarthy used to be close allies, but their relationship has rapidly deteriorated in the wake of January 6.",
    "Like McCarthy, the four other congressmen have all thus far declined to voluntarily cooperate with the investigation.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "The committee's action illustrates the extent to which it will go to force Republicans to answer its questions.",
    "\"And if they are, we'll have a lot more to worry about as a democracy than anything they'll do with subpoenas.\"",
    "Perry, like McCarthy, declined to directly answer questions about whether he would comply with the subpoena.",
    "McCarthy declined to answer when repeatedly asked if he would comply with the select committee's subpoena.",
    "All of the subpoenas demand that the Republican lawmakers appear for depositions by the end of the month.",
    "\"They have proven themselves so recklessly irresponsible, they cannot be allowed to govern,\" he added.",
    "\"This is proof positive that this is about headlines,\" Perry told reporters, per CBS News' Zak Hudak.",
    "\"This is all about distracting America from their abysmal record of running America into the ground.\"",
    "Spokespeople for Brooks and Biggs did not immediately respond to a request for comment.",
    "McCarthy declined to answer when repeatedly asked if he would comply with the subpoena.",
    "\"I haven't seen the subpoena,\" he told reporters at the US Capitol on Thursday.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "McCarthy once supported a 9/11-style commission probe into the insurrection.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"We sent a letter out in early January that laid out all our concerns.",
    "McCarthy currently supports a primary challenger to Cheney.",
    "3 House Republican, serves as the vice-chair of the panel.",
    "But he later withdrew his support for such an idea.",
    "At the same time, he slammed the panel's action.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "House Minority Leader Kevin McCarthy.",
    "Loading Something is loading.",
    "Rep. Liz Cheney, once the No."
  ]
}