{
  "id": 3301,
  "mediaId": 238,
  "date": "d2022-05-13T17:34",
  "headline": "More Republicans are working to undermine Trump endorsements",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/13/trump-endorsements-undermined/",
  "sentiment": "-0.798",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Dawsey",
  "authorUrl": "https://www.washingtonpost.com/people/josh-dawsey/",
  "termIds": [
    1147,
    1434,
    1609,
    2006,
    2095,
    2125,
    2136,
    2409,
    3094,
    3103,
    428,
    562,
    2672
  ],
  "sentences": [
    "Kevin tells him a lot, Dont endorse this, or endorse this, and hell usually agree, but then later he might just change his mind and put it out.\nAmerica Rising, an opposition research firm that typically operates as an extension of the Republican Party, has also been sending someone to record Kents campaign events in Washington in an effort to catch him in an embarrassing moment that could be used against him.",
    "McCarthy clearly despises the base of the Republican Party right now.\nKent recalled that the member of Congress who McCarthy had dissuaded from an endorsement told him over dinner this year that McCarthy has threatened that he would withhold committee assignments and some funding.\nTwo other people, who asked for anonymity to describe private conversations, recalled the same comments at the dinner.",
    "Sometime after a Trump-endorsed House candidate, Joe Kent, announced his candidacy for Washington states 3rd District last year, McCarthy advised one Republican lawmaker in a private conversation not to endorse him, according to multiple people briefed on the conversation, who like some others spoke on the condition of anonymity to discuss a private exchange.",
    "Trump said in a statement that Barnette will never be able to win the General Election against the Radical Left Democrats, arguing there are many things in her past which have not been properly explained or vetted. He added that he could support her in the future if such questions were answered, though he did not identify what they were.",
    "Before a roomful of Republican donors Monday, House Minority Leader Kevin McCarthy praised Donald Trump as the secret weapon in the GOPs quest to retake Congress, while Trump returned the favor by saying McCarthy had been with him from the beginning, according to two people in attendance at the event in Dallas.",
    "President Trump is already 58-1 this election season, and the power of his endorsement continues to propel candidates across the nation in a way no endorsement has before, said Trump spokesman Taylor Budowich, referring to a win-loss record pushed by Trump that contains numerous unopposed candidates.",
    "In a Washington Post-ABC News poll released earlier this month, 60 percent of Republicans and Republican-leaning independents said that GOP leaders should follow Trumps leadership, while 34 percent say they should lead the party in a different direction.",
    "In another message Wednesday, Trump denounced all three as RINOs  meaning Republicans in Name Only  and claimed falsely that they were already in Georgia campaigning for Kemp, who has declined to embrace Trumps false claims that he won Georgia in 2020.",
    "But their united front disguised far more complicated relationships that have developed between the former president and elected Republican leaders like McCarthy  a fact that is now playing out in a series of primary proxy battles across the country.",
    "), a strong Trump ally, are stumping for Senate candidate David McCormick, who has also hired a coterie of Trumps former advisers  even though Trump is backing candidate and television personality Mehmet Oz in next Tuesdays Republican primary there.",
    "And in the Pennsylvania Senate race, Trump advisers say the former president was particularly annoyed by Pompeos aggressive efforts against Oz  including calling a news conference last week to raise questions about Ozs dual U.S.-Turkey citizenship.",
    "McCarthy told the Republican lawmaker that working against a GOP incumbent would be difficult to defend before the House Republican steering committee, the group responsible for doling out committee assignments in the next Congress.",
    "Kent and the three other sources, who confirmed the events, requested that The Post withhold the name of the member of Congress as a condition of their interviews, so that the person would not face retribution from party leaders.",
    "The behind-the-scenes machinations have frustrated Kent, who has so far been able to secure only three endorsements from sitting members of Congress: Reps. Matt Gaetz (R-Fla.), Paul A. Gosar (R-Ariz.) and Troy E. Nehls (R-Tex.).",
    "Trump has targeted Kemp  a key figure on his political enemies list  for refusing his efforts to overturn Joe Bidens 2020 win in Georgia, but has struggled to help Perdue gain traction ahead of Georgias May 24 primary contest.",
    "Trump has a very large impact on primary politics but its not unlimited.\nTo be sure, Trump retains wide support across the party, and relatively few of the candidates in GOP primaries are distancing themselves from him.",
    "In several cases, some of Trumps own Cabinet members and advisers, along with other longtime allies in the Republican Party, are working or stumping for candidates running against Trump-endorsed candidates.",
    "The quiet maneuvering  following McCarthys efforts to fund Herrera Beutlers campaign through an agreement that was struck before her impeachment vote  has not soured the relationship between the two men.",
    "The groups clients include the McCarthy-backed Congressional Leadership Fund, the Republican National Committee and the House and Senate campaign committees, among others, according to public filings.",
    "On Thursday, Trump aimed fire at Barnette, the third Pennsylvania Senate candidate, a relatively unknown insurgent who has been rising quickly in some polls with the support from the Club for Growth.",
    "And the Club for Growth, an influential Republican organization with deep pockets that had been aligned with Trump, is also buttressing Kathy Barnette, a third GOP Senate candidate in Pennsylvania.",
    "From Nebraska and Idaho to Pennsylvania and Georgia, Republicans have been actively campaigning  or quietly maneuvering  against Trumps picks in a way that could undermine his sway over the party.",
    "One little-noticed House race in Washington state provides a case study of the covert machinations at play in a growing number of contests involving Trump-endorsed candidates and their rivals.",
    "That tells you all you need to know about what you are getting Georgia  just a continuation of bad elections and a real RINO if you vote for Brian Kemp, Trump wrote on his social network.",
    "Ricketts, who had an oppositional relationship with Herbster long before the Trump endorsement, plans to campaign over the next week for Kemp in Georgia, along with Arizona Gov.",
    "Trump did not take those races into account when he announced that his primary win loss record was 58-1\" Wednesday in a message on Truth Social, the social network he co-owns.",
    "One prominent example came Tuesday when Trumps endorsed candidate for Nebraska governor, Charles Herbster, lost in the GOP primary after significant opposition from Gov.",
    "Publicly, McCarthy and the Republican Party have continued to show widespread obeisance to Trump, fearful of drawing his wrath or having his supporters turn on them.",
    "A former Army Special Forces officer, Kent is running to replace Rep. Jaime Herrera Beutler (Wash.), one of 10 Republicans who voted to impeach Trump in the House.",
    "Trump has long been obsessed with his own endorsement win-loss record, often combining risk-taking endorsements with safer picks so that his percentage stays high.",
    "The two men continue to work closely with Brian Jack, a former Trump White House aide who now works for McCarthy and has been focused on shaping the midterms.",
    "In his sharpest political challenge yet to Trump, for example, former vice president Mike Pence announced Friday that he would campaign for Georgia Gov.",
    "Trumps ability to anoint Republican candidates, and destroy opponents, has been one of his strongest weapons against losing control of the party.",
    "Marc Short, a longtime aide to Pence and former director of legislative affairs in the Trump White House, is also working for Kemp in Georgia.",
    "It seems to be there is a streak of independence in the Republican Party, said Sen. Lindsey O. Graham (R-S.C.), a strong Trump ally.",
    "The release of recordings last month that showed McCarthy criticizing Trump after the Jan. 6, 2021, attacks did not shake the bond.",
    "He endorsed Sean Parnell for the Pennsylvania Senate race before Parnell withdrew amid allegations of child and spousal abuse.",
    "Kevin asked him not to endorse in that race, and he did it anyways, the person said about Herrera Beutlers reelection effort.",
    "Before the May 3 primary in Ohio, the Club for Growth had enraged Trump by running ads against winning Senate candidate J.D.",
    "Pete Ricketts (R)  the first of what could be several potential setbacks in coming weeks for the former president.",
    "Vance that Trump viewed as negative about him  and then increasing their spending after Trump attacked them.",
    "Doug Ducey and former New Jersey governor Chris Christie  a fact that has also angered the former president.",
    "They had a long meeting recently that lasted several hours where Trump referred to McCarthy privately as Mr.",
    "He has described himself as the king of endorsements, telling other Republicans it makes him more powerful.",
    "), Trumps principal antagonist in the House, last year, according to Federal Election Commission records.",
    "The one loss he has recognized was Tuesdays defeat of Herbster, his pick in the Nebraska governors race.",
    "The Republican Governors Association, led by Ducey and Ricketts, has also been supporting Idaho Gov.",
    "The National Republican Congressional Committee has said it is not involved in primaries this cycle.",
    "Budowich did not answer multiple questions about others working against Trump, including McCarthy.",
    "An adviser to Herrera Beutler said the congresswomans campaign had not paid for the tracking.",
    "An America Rising spokesman declined to comment on who was paying for the tracking of Kent.",
    "The member then relayed the conversation to four people who spoke with The Washington Post.",
    "Kent has said he would oppose McCarthys bid for speakership if he wins Congress next year.",
    "In Pennsylvania, former Trump secretary of state Mike Pompeo and Sen. Ted Cruz (R-Tex.",
    "Trump also backed a losing House special election candidate in Texas last summer.",
    "America Rising did opposition research work in 2021 for Rep. Liz Cheney (R-Wyo.",
    "Brian Kemp (R), who is seeking reelection over Trump endorsee David Perdue.",
    "McCarthy, in the meantime, continues to work closely with Trump.",
    "I think he is horrible, Kent said of McCarthy in an interview.",
    "A Trump adviser said McCarthy and Trump remain on good terms.",
    "Brad Littles reelection bid against Trump endorsee Lt. Gov.",
    "Speaker, according to two people familiar with the meeting.",
    "McCarthys office declined a request for comment.",
    "Janice McGeachin in the May 17 primary."
  ]
}