{
  "id": 57,
  "mediaId": 238,
  "date": "d2022-02-17T00:00",
  "headline": "Opinion: Republicans who voted to impeach Trump might be in less peril than people think",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/18/cheney-mccarthy-endorsement-hageman-republican-primary-wyoming/",
  "sentiment": "-0.232",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    826,
    944,
    1147,
    1248,
    1335,
    1901,
    2006,
    2074,
    2125,
    3087,
    3097,
    428,
    2976
  ],
  "sentences": [
    "Her opening video in her bid for Cheney's congressional seat makes the most of her deep Wyoming roots and Cheney's apostasy, arguing that the congresswoman no longer rides for the brand.? In other words, she's betrayed the people and party who backed her.",
    "Her outspoken opposition to Trump over his role in the Jan. 6 riot, along with her involvement with House Speaker Nancy Pelosi's select committee investigating the incident, has put her beyond the pale for loads of Republicans.",
    "He was endorsed by Trump to take on longtime incumbent Fred Upton, who also voted for impeachment, but redistricting threw both of them into the same seat as Rep. Bill Huizenga, a Republican who voted against impeachment.",
    "A close look at her primary contest, and those of the other House Republicans who voted to impeach Donald Trump, shows the Republican renegades have a better chance at survival than many think.",
    "Newhouse will benefit from Washington's top-two primary law as well, and Trump only recently endorsed a Newhouse opponent  Loren Culp, the Republican nominee for Washington governor in 2020.",
    "Carra is thus stuck with a poor hand: If Upton does run, conservatives upset over Upton's relative moderation and impeachment vote can vote for Huizenga in a three-way race.",
    "She can also benefit from a law that allows voters who are not registered Republicans to join the party on Election Day, a provision that Trump allies are trying to repeal.",
    "Hageman has yet to clear the anti-Cheney field, which includes four other declared candidates, including state Sen. Anthony Bouchard, who has raised more than $630,000.",
    "It will be interesting to see if McCarthy also jumps into these riskier challenges to his own members, or if he decides that discretion is the better part of valor.",
    "Reps. Dan Newhouse (Wash.) and Peter Meijer (Mich.) are two other Republicans who voted for impeachment and look well placed to turn back Trump-backed challengers.",
    "Cheney's hope is that a combination of her financial advantage, a divided field and Wyoming's election laws allows her to make it through her primary challenge.",
    "Hageman was Wyoming's national Republican committeewoman before she stepped down to launch a gubernatorial campaign in 2018, finishing third in the GOP primary.",
    "With $1.6 million in the bank and the state's election allowing her to garner primary votes from non-Republicans, Herrera Beutler could easily prevail.",
    "Washington does not have party primaries; instead, the top two candidates, regardless of party affiliation, will advance to the general election.",
    "Moreover, he defeated a Trump-backed candidate, the late multimillionaire businessman Foster Friess, who finished second with 26 percent.",
    "Despite raising more than $1.3 million, Kent has not cleared the field either, with four other Republicans challenging Herrera Beutler.",
    "A recent poll from the Trafalgar Group showed a Democrat leading the pack, with Kent and Herrera Beutler closely bunched for second.",
    "He had raised only $51,000 from people other than himself by the end of 2021, and shares the field with three other GOP challengers.",
    "The winner of the contest need only take a plurality to prevail, which is exactly what happened in Hageman's statewide defeat.",
    "So far, though, it looks like a fair number  perhaps even a majority  of pro-impeachment Republicans can win renomination.",
    "She almost certainly would lose a one-on-one challenge from a credible conservative, and Hageman seems to fit that bill.",
    "Culp's congressional campaign had been foundering before Trump got in; he only had $30,000 on hand to start the year.",
    "Cheney hopes these factors will allow her to overcome her unpopularity and win renomination without a majority.",
    "Rep. Jaime Herrera Beutler (R-Wash.) has also drawn a Trump-backed challenger, political neophyte Joe Kent.",
    "Meijer is sitting on more than $1 million in the bank and only has to win a plurality to win renomination.",
    "Meanwhile, Cheney is sitting on more than $4.7 million, a tremendous sum to spend in tiny Wyoming.",
    "Trump's pick against the personally wealthy Meijer, John Gibbs, was also in bad financial shape.",
    "If Upton drops out, Carra has no way to distinguish himself from the incumbent.",
    "Other Republicans who voted to impeach Trump are in better shape than Cheney.",
    "Trump's candidates may still sweep the field once all the votes are counted.",
    "Michigan state Rep. Steve Carra has even tougher odds to surmount.",
    "Upton has not yet decided whether he will run for reelection.",
    "Mark Gordon, won with only 33 percent of the vote.",
    "But that does not mean her defeat is foreordained.",
    "Let's start with Cheney.",
    "The winner, current Gov."
  ]
}