{
  "id": 61,
  "mediaId": 165,
  "date": "d2022-02-03T18:29",
  "headline": "Republicans Who Voted to Impeach Trump Are Fundraising Laps Around Their MAGA Primary Opponents",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/02/liz-cheney-gop-fundraising.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-news/republicans-impeach-trump-vote-liz-cheney-fundraising-1294606/",
  "sentiment": "0.0",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "William Vaillancourt",
  "authorUrl": "",
  "termIds": [
    717,
    1125,
    1147,
    1248,
    1544,
    1614,
    1839,
    1901,
    2006,
    2125,
    3085,
    3094,
    183,
    428
  ],
  "sentences": [
    "Joe Kent, the Army Special Forces veteran running to unseat Rep. Jaime Herrera Beutler (R-Wash.), also couldn't match the incumbent's haul, although the that the gap is narrower ($297,000 for Kent and $422,000 for Butler in the fourth quarter) than some of the other races, perhaps due to his frequent appearances throughout right-wing media, including Steve Bannon's podcast.",
    "All seven House Republicans who are seeking reelection after voting to impeach former President Donald Trump for his role in the Jan. 6 riot at the Capitol are faring well financially, campaign disclosures filed this week with the Federal Election Commission show.",
    "Part of this has to do with crowded primary fields, candidates who have only recently announced their campaign, and recent endorsements from Trump  like the one Fry locked down in his race to unseat Rep. Rice on Tuesday.",
    "), for instance, raised a war chest of around $6.5 million in 2021, and is entering the 2022 election year with just under $5 million, while her opponent, Harriet Hageman, has about $380,000 in cash on hand.",
    "Former president George W. Bush donated $5,800 to Cheney's campaign, while establishment figures in the GOP like Utah Sen. Mitt Romney and former House Speaker Paul Ryan have each helped with fundraising.",
    "Cheney became a lightning rod for attacks from Trump and his allies after speaking out against the former president's false election claims, as well as for her prominent seat on the Jan. 6 committee.",
    "There's still plenty of time for the lot of MAGA candidates to make up ground, their bids to unseat anti-Trump Republicans may be a case in which there is strength in fewer numbers.",
    "They're in a unique position to raise a lot of money.?\nAs a whole, House Republicans have overtaken Democrats in their fundraising efforts to win back the House of Representatives.",
    "Trump has firm control of the GOP base, but his endorsement alone hasn't been enough against those favored and funded by establishment figures and political action committees.",
    "At least 53 Republicans raised over $500,000 last quarter, according to Federal Election Commission data reviewed by Politico, compared to 38 Democrats who did the same.",
    "If you'd seen 100 Republicans voting to impeach Trump, the donor pool would have been more diluted,? veteran GOP strategist Alex Conant explained to the Times.",
    "Naturally, Trump's desire for revenge against the lawmakers who voted to remove him from office led to primary challengers to try to remove them from office.",
    "Reps. Dan Newhouse (R-Wash.) and David Valadao (R-Calif.) are also out-raising the field  although Trump has yet to endorse a challenger in either race.",
    "Her fundraising efforts, aided by a contribution from Bush, was double the amount that her Trump-supported challenger brought in over the same period.",
    "A similar trend is playing out in the Senate, where Sen. Lisa Murkowski (R-Alaska), a frequent target of Trump, raked in $1.2 million last quarter.",
    "NBC News points out that Rep. Peter Meijer (R-Mich.) hauled in over eight times what his Trump-endorsed challenger did in the fourth quarter.",
    "In Michigan, meanwhile, Rep. Fred Upton has about $1.5 million in cash, while state Rep. Steve Carra, whom Trump endorsed, has $200,000.",
    "The New York Times points out that despite drawing Trump's wrath, the seven Republicans are out-raising their primary opponents.",
    "Rep. Tom Rice (R-S.C.) is out-raising challenger state Rep. Russell Fry, although Trump only recently endorsed the latter.",
    "Rep. Liz Cheney (R-Wyo."
  ]
}