{
  "id": 64,
  "mediaId": 124,
  "date": "d2022-02-02T02:59:38",
  "headline": "Republicans who impeached Trump outpace challengers in latest fundraising haul",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220201-liz-cheney-2021-ac-831p-7653e5.jpg",
  "link": "https://www.nbcnews.com/politics/elections/republicans-impeached-trump-outpace-challengers-latest-fundraising-hau-rcna14496",
  "sentiment": "0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1026,
    1064,
    1147,
    1248,
    1614,
    1901,
    2006,
    2125,
    3085,
    3094,
    183,
    428,
    2538,
    2590
  ],
  "sentences": [
    "Rep. Peter Meijer, R-Mich., brought in eight times what his Trump-endorsed primary challenger secured last quarter, while Rep. Fred Upton, R-Mich., raised more than five times what Trump-backed state Rep. Steve Carra brought in from October through December.",
    "Republicans seeking re-election who backed former President Donald Trump's impeachment or voted to convict him last year are outpacing their GOP challengers in the money race, according to the latest Federal Election Commission filings.",
    "The eight Republicans who voted in favor of either impeachment or conviction and are facing voters this year raised more money than those who seek to oust them from office, the filings released this week showed.",
    "Reps. Dan Newhouse, R-Wash., and David Valadao, R-Calif., are outpacing their fields in the fundraising battle, while Rep. Tom Rice, R-S.C., narrowly topped state Rep. Russell Fry, whom Trump endorsed Tuesday.",
    "Harriet Hageman, Cheney's Trump-backed challenger, who launched her bid in September, reported about $443,000 in contributions last quarter, bringing her total for the year to just north of $745,000.",
    "And in Washington state, Rep. Jaime Herrera Beutler out-raised her Trump-backed opponent, Joe Kent, bringing in about $422,000 compared to his roughly $297,000 during that same period.",
    "Leading the pack was Rep. Liz Cheney, R-Wyo., who pulled in more than $1.97 million during the last three months of 2021, bringing her yearly total to nearly $6.5 million.",
    "\"Great news, another one bites the dust,\" Trump said in a statement last month following the news that Katko will not seek re-election at the end of his current term.",
    "Trump has heralded retirements by three House Republican impeachment backers  Adam Kinzinger of Illinois, Anthony Gonzalez of Ohio and John Katko of New York.",
    "The fundraising totals show that knocking pro-impeachment Republicans out of Congress will not be a walk in the park for Trump's preferred candidates.",
    "The trend also played out in races in which Trump has not endorsed a primary challenger or only recently offered his blessing.",
    "On the other hand, some impeachment backers have decided that running for re-election is not worthwhile or may prove futile.",
    "On the Senate side, Sen. Lisa Murkowski, R-Alaska, more than doubled Kelly Tshibaka's fundraising haul last quarter.",
    "Tshibaka, backed by Trump, raised about $1.82 million last year, far short of Murkowski's $5.4 million.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "The disparity was mirrored in other races."
  ]
}