{
  "id": 73,
  "mediaId": 43,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Overnight News Digest February 1, 2022",
  "image": "https://images.dailykos.com/images/994435/story_image/ond3.jpg?1633482716",
  "link": "https://www.dailykos.com/story/2022/2/1/2078101/-Overnight-News-Digest-February-1-2022",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    928,
    1080,
    1147,
    1232,
    1545,
    1901,
    2006,
    2125,
    3085,
    3094,
    183,
    2707,
    2710,
    2750
  ],
  "sentences": [
    "Washington Post: The mother lode': Cities and counties across America clamor for slice of new infrastructure funds by Yeganeh Torbati, Jonathan O'Connell, and Tony Romm\nOver the past decade, the small coastal city of Largo, Fla., has borrowed tens of millions of dollars from the state, partly to build piecemeal protections against rising sea waters that threaten flooding and major damage to the community, which sits squarely between the Gulf of Mexico and Tampa Bay.",
    "But I think done strategically, it's a great opportunity for us.?\nReuters: Ex-Miami Dolphins coach sues NFL over alleged race bias by Daniel Wiessner\nFeb 1 (Reuters) - Recently fired Miami Dolphins head coach Brian Flores filed a lawsuit on Tuesday accusing the National Football League and its 32 teams of discriminating against Black candidates for coaching and management jobs.",
    "And so last year, as members of Congress debated a historic infrastructure bill that would fund hundreds of billions of dollars' worth of new spending on roads, bridges, pipes, ports and Internet connections across the country, Largo officials did something they had never done before: They hired lobbyists in Washington to advocate on their behalf.",
    "New York Times: U.S. Has Far Higher Covid Death Rate Than Other Wealthy Countries by Benjamin Mueller and Eleanor Lutz\nTwo years into the pandemic, the coronavirus is killing Americans at far higher rates than people in other wealthy nations, a sobering distinction to bear as the country charts a course through the next stages of the pandemic.",
    "NBC News: Republicans who impeached Trump outpace challengers in latest fundraising haul by Allan Smith\nRepublicans seeking re-election who backed former President Donald Trump's impeachment or voted to convict him last year are outpacing their GOP challengers in the money race, according to the latest Federal Election Commission filings.",
    "Guardian: We only have a pen': fury as fourth journalist killed in Mexico this year by David Agren\nJournalists in Mexico have responded with fury and despair at the murder of a fourth reporter in the country this year, cementing its reputation as the world's most murderous country for media workers.",
    "\"I hope that in the end we will find a solution, although it will not be simple,\" Putin said, indicating he was ready for more talks with the West, which has accused Russia of amassing more than 100,000 troops on its border with Ukraine ahead of a planned invasion of its neighbor.",
    "AlJazeera: US asks for UN Security Council meeting on North Korea: Diplomats\nThe United States has asked the United Nations Security Council to hold an emergency meeting on Thursday to discuss North Korea's test-launch of an intermediate-range ballistic missile, diplomats said.",
    "In a class action complaint in Manhattan federal court, Flores said his firing by the Dolphins last month after back-to-back seasons with winning records was emblematic of the treatment of Black coaches, who comprise a fraction of team staff while 70% of NFL players are Black.",
    "Rep. Peter Meijer, R-Mich., brought in eight times what his Trump-endorsed primary challenger secured last quarter, while Rep. Fred Upton, R-Mich., raised more than five times what Trump-backed state Rep. Steve Carra brought in from October through December.",
    "DW: Putin says West has 'ignored' Russia's security concerns\nRussian President Vladimir Putin said on Tuesday that the West had \"ignored\" Moscow's security concerns in his first public remarks over the Ukraine standoff in more than a month.",
    "Alumni editors include (but not limited to) Interceptor 7, Man Oh Man, wader, Neon Vincent, palantir, Patriot Daily News Clearinghouse (RIP), ek hornbeck (RIP), rfall, ScottyUrb, Doctor RJ, BentLiberal, Oke (RIP) and jlms qkw.",
    "The daytime panel show co-host will be off the program for two weeks after making controversial comments Monday about the Jewish people and the Holocaust in response to a local school board banning the graphic novel Maus.",
    "We only have a pen and a notebook to defend ourselves.?\nHollywood Reporter: Whoopi Goldberg Suspended at The View' Over Hurtful? Holocaust Comments by Alex Weprin\nWhoopi Goldberg has been suspended by ABC's The View.",
    "The warning covers southern and central Cook County, most of Will County, all of DuPage, Kendall, Grundy and LaSalle counties and, in Indiana, Lake and Porter counties, according to the National Weather Service.",
    "The eight Republicans who voted in favor of either impeachment or conviction and are facing voters this year raised more money than those who seek to oust them from office, the filings released this week showed.",
    "It hasn't been enough: A recent budget enumerated nearly $77 million in unfunded projects, including protecting an industrial site from hurricane damage and paving with materials that better absorb water.",
    "A winter storm warning for the south suburbs and northwest Indiana went into effect at 8 p.m. Tuesday and wasn't set to expire until 6 p.m. Wednesday, with up to 12 inches of snow expected in some areas.",
    "Whoopi's comments do not align with those values.?\nGoldberg apologized on the program earlier on Tuesday, in a segment that also included an interview with Anti-Defamation League CEO Jonathan Greenblatt.",
    "In the Chicago area, rain was changing to snow Tuesday evening, expected to ramp up to about an inch of snow per hour after midnight through early Wednesday afternoon in some areas, forecasters said.",
    "The lawsuit seeks to force the NFL to make a series of changes, incentivize teams to hire Black coaches and general managers, and require teams to explain hiring and termination decisions in writing.",
    "Harriet Hageman, Cheney's Trump-backed challenger, who launched her bid in September, reported about $443,000 in contributions last quarter, bringing her total for the year to just north of $745,000.",
    "With American lawmakers desperate to turn the page on the pandemic, as some European leaders have already begun to, the number of dead has clouded a sense of optimism, even as Omicron cases recede.",
    "Deaths have now surpassed the worst days of the autumn surge of the Delta variant, and are more than two-thirds as high as the record tolls of last winter, when vaccines were largely unavailable.",
    "The UN Security Council meeting is expected to be held behind closed doors on Thursday, and it is up to Russia, the president of the council for the month of February, to confirm the timing.",
    "Chicago Sun-Times: Disaster declared for entire state ahead of Winter Storm Landon  which could dump more than a foot of snow in some areas by Mitchell Armentrout and Madeline Kinney\nGov.",
    "Welcome to the Overnight News Digest with a crew consisting of founder Magnifico, regular editors side pocket, maggiejean, Chitown Kev, eeff, Magnifico, annetteboardman, Besame and jck.",
    "The entire ABC News organization stands in solidarity with our Jewish colleagues, friends, family and communities.?\nThese decisions are never easy, but necessary,? she addd in her memo.",
    "And in Washington state, Rep. Jaime Herrera Beutler out-raised her Trump-backed opponent, Joe Kent, bringing in about $422,000 compared to his roughly $297,000 during that same period.",
    "Zitcuaro is best known for the nearby monarch butterfly reserves, but the region is rife with violence as drug cartels and criminal groups fight to control illegal logging.",
    "Leading the pack was Rep. Liz Cheney, R-Wyo., who pulled in more than $1.97 million during the last three months of 2021, bringing her yearly total to nearly $6.5 million.",
    "J.B. Pritzker issued a disaster declaration for the entire state Tuesday as a massive winter storm was poised to sock parts of the Chicago area with up to a foot of snow.",
    "OND is a regular community feature on Daily Kos, consisting of news stories from around the world, sometimes coupled with a daily theme, original research or commentary.",
    "\"But it is already clear that fundamental Russian concerns ended up being ignored,\" he said, before adding the Kremlin is still poring over the US and NATO's feedback.",
    "North Korea confirmed that it had fired a Hwasong-12 mid-range ballistic missile? on Sunday, fuelling concen the nuclear-armed state could resume long-range testing.",
    "Some parts of central Illinois could get as much as 15 inches as the storm moves across Peoria, Bloomington and Kankakee and into Indiana, the weather service said.",
    "Roberto Toledo was shot dead by three gunmen on Monday afternoon in a carpark in the city of Zitcuaro, where he reported for a local news outlet, Monitor Michoacn.",
    "Exposing corruption led to the death of one of our colleagues,? said Armando Linares, the director of Monitor Michoacn, in a video originally posted on Facebook.",
    "\"It seems to me that the United States is not so much concerned about the security of Ukraine but its main task is to contain Russia's development,\" Putin said.",
    "The ballooning death toll has defied the hopes of many Americans that the less severe Omicron variant would spare the United States the pain of past waves.",
    "The launch was the seventh missile test conducted by North Korea in January and the first time the country fired a missile of that size since 2017.",
    "Editors of OND impart their own presentation styles and content choices, typically publishing each day near 12:00 AM Eastern Time.",
    "Just last week I noted that the culture at ABC News is one that is driven, kind, inclusive, respectful, and transparent.",
    "Effective immediately, I am suspending Whoopi Goldberg for two weeks for her wrong and hurtful comments,? Godwin said.",
    "I know the term lobbyist' does not have a real good ring to it,? said Jamie Robinson, a Largo city commissioner.",
    "While Whoopi has apologized, I've asked her to take time to reflect and learn about the impact of her comments.",
    "He told reporters: \"We are carefully analyzing the written responses received from the United States and NATO.\"",
    "[Toledo] lost his life at the hands of three people who shot him in a mean and cowardly manner,? he continued.",
    "Last week the US and NATO responded to the Kremlin's calls for legally binding security guarantees.",
    "It said the NFL and it clubs were committed to ensuring equitable employment practices.",
    "ABC News president Kim Godwin announced the decision in a note to staff Tuesday night.",
    "In a statement responding to the suit, the NFL said the claims were without merit.",
    "Linares broke down in tears before offering his apologies to Toledo's family.",
    "And it has laid bare weaknesses in the country's response, scientists said.",
    "Please feel free to share your articles and stories in the comments.",
    "However, Putin believes Russia's requests have fallen on deaf ears.",
    "The disparity was mirrored in other races.",
    "It didn't have to be this way.",
    "Everyone have a great evening!",
    "Lovie Smith comes to mind.",
    "We don't carry weapons.",
    "So does Jim Caldwell."
  ]
}