{
  "id": 11272,
  "mediaId": 2660,
  "date": "2022-03-16",
  "headline": "Claims that Biden is ‘secretly’ flying immigrants into U.S. cities ignore key facts",
  "image": "https://static.politifact.com/politifact/rulings/meter-mostly-false.jpg",
  "link": "https://www.politifact.com/factchecks/2022/mar/16/tyler-kistner/claims-biden-secretly-flying-immigrants-us-cities-/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    2536,
    2765,
    2859,
    1659,
    2049,
    4905,
    5151,
    5802,
    6678
  ],
  "sentences": [
    "Mexican nationals ordered for deportation from the United States travel on domestic flights from various U.S. cities to southern cities such as San Diego, California and Brownsville, Texas, and are then bused to the U.S.-Mexico border for removal at a land port of entry, ICE said in August 2020.",
    "Because of a public health law known as Title 42, invoked at the start of the pandemic by the Trump administration and continued under Biden, the vast majority of migrants are turned back and not given the opportunity to make their case for why they should be allowed to stay.",
    "They include Lisa Scheller, who is running for a U.S. House seat in Pennsylvania; Jake Corman, who is running for Pennsylvania governor; U.S. Rep. Randy Weber of Texas, U.S. Sen. Kevin Cramer of North Dakota, and U.S. Rep. Ashley Hinson of Iowa.",
    "They typically are taken first to facilities near the border and then transferred to the temporary custody of the U.S. Health and Human Services department, which eventually places the children with family or sponsors in the U.S.",
    "So, in recent weeks, unaccompanied children passed through the Westchester (N.Y.) airport, which I think is what you’re referring to, en route to their final destination to be unified with their parents or a vetted sponsor.",
    "The charter flights are not publicized and sometimes are done in the middle of the night to protect the confidentiality of those being transported and to guard against anyone who would interfere with the flights.",
    "How the race plays into House control\nKistner, an ex-Marine, is running against Democratic Rep. Angie Craig, who was first elected in 2018 to the 2nd District seat, which represents part of southeast Minnesota.",
    "Two law professors and directors of immigrants’ rights clinics, Fatma Marouf at Texas A&M University School of Law and Nicole Hallett at the University of Chicago Law School, walked us through the process.",
    "The vast majority of people on the flights are unaccompanied minors who crossed the border, requested asylum under immigration law, and are being released from federal custody to a parent or sponsor.",
    "Featured Fact-check\nThe Biden administration, like the Obama and Trump administrations, uses flights to move adult detainees from one detention facility to another in order to avoid overcrowding.",
    "A reporter on Oct. 19 asked White House press secretary Jen Psaki: \"Why is the administration flying thousands of migrants from the border to Florida and New York in the middle of the night?\"",
    "Ron DeSantis of Florida, have complained that they were not notified about the flights and U.S. House members from New York asked the Biden administration to stop such flights to their state.",
    "Exceptions are made for unaccompanied minors, some of whom are transported by planes to be with relatives or approved sponsors — a practice also done during the Trump administration.",
    "If Your Time is short\nThe federal government transports adult detainees in its custody from one facility to another, or from one U.S. city to another during deportation proceedings.",
    "\"As a part of the unification process, our Office of Refugee Resettlement facilitates travel for children in its custody to their families or sponsors across the country.",
    "Psaki said: \"It is our legal responsibility to safely care for unaccompanied children until they swiftly — can be swiftly unified with a parent or a vetted sponsor.",
    "ICE Air Operations is the air transportation arm of U.S. Immigration and Customs Enforcement, which is responsible for the detention and deportation of immigrants.",
    "Biden \"has been secretly flying illegal immigrants into communities across the country in the middle of the night,\" his ad on Facebook and Instagram claimed.",
    "The Washington Post’s Fact Checker reported that sometimes the federal government tries to save money by arranging for flights that land late in the evening.",
    "News reports, including some in Florida and Pennsylvania, have made clear that the process is routine and occurred under the Trump administration, as well.",
    "The federal government flies adult detainees in its custody from one facility to another, or from one U.S. city to another during deportation proceedings.",
    "Most unaccompanied minors turn themselves in to border authorities and by doing so are \"actually following the rules of seeking asylum,\" said Marouf.",
    "Republican Tyler Kistner, making his second consecutive campaign for a U.S. House seat in Minnesota, made his claim about skullduggery in the dark.",
    "If family members or approved sponsors are not able to arrange transportation, the federal government pays for transportation, including flights.",
    "It’s something that we’re also working to unite children with their family members or vetted sponsors in other parts of the country as well.\"",
    "Our ruling\nKistner said Biden \"has been secretly flying illegal immigrants into communities across the country in the middle of the night.\"",
    "The U.S. government in some cases also flies unaccompanied children who are being released from its custody to a family member or sponsor.",
    "If some of those flights occur at night, it’s not necessarily indicative of something nefarious or covert going on, as the ad suggests.",
    "Experts said the vast majority of people trying to cross the southern border into the United States are summarily turned back.",
    "Republicans campaigning for office are running ads that hammer President Joe Biden’s management of the U.S.-Mexico border.",
    "The ad implies that it is a new phenomenon for the federal government to transport immigrants around the country.",
    "Neither ICE nor the Health and Human Services Department responded to requests for comment for this fact-check.",
    "And that’s something we take seriously; we have a moral obligation to come to do that and deliver on that.",
    "Those encountered at the border who have been allowed to remain are, by and large, unaccompanied minors.",
    "They claim that the administration is using planes to fly \"illegal immigrants\" around the country.",
    "Campaign watchers rate their rematch as \"Democratic toss up\", \"tilt Democratic\" and toss up.",
    "The White House cited one of several statements it has made in response to such claims.",
    "Kistner’s campaign did not reply to our requests for information to support his claim.",
    "\"It’s no surprise that kids can be seen traveling through states, not just New York.",
    "Some of these flights may happen at night, but they are not covert operations.",
    "Some of these flights happen at night, but they are not covert operations.",
    "The same types of routine flights were done by the Trump administration.",
    "Other Republicans have run social media ads making similar claims.",
    "The same types of flights were done by the Trump administration.",
    "Democrats have an 11-seat advantage in the House.",
    "Craig defeated Kistner in 2020 by 48% to 46%.",
    "The ad contains only an element of truth.",
    "Republicans, including Gov.",
    "We rate it Mostly False.",
    "That’s not true."
  ]
}