{
  "id": 2229,
  "mediaId": 2890,
  "date": "2022-02-04",
  "headline": "Liz Cheney’s censure underscores Republican loyalties to Trump",
  "image": "https://cdn.vox-cdn.com/thumbor/xXEfzZliuKYrTVP0YSiHXEOZrfc=/0x217:3295x1942/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23218772/AP22035684164675.jpg",
  "link": "https://www.vox.com/22917728/liz-cheney-adam-kinzinger-censure-january-6-committee",
  "mediaOutlet": "Vox",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Li Zhou",
  "authorUrl": "https://www.vox.com/authors/li-zhou",
  "termIds": [
    0
  ],
  "sentences": [
    "The resolution, which was obtained by the New York Times, states that the RNC would “immediately cease any and all support of them as members of the Republican Party for their behavior which has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic, and is inconsistent with the position of the Conference.”\nIt describes their work on the January 6 committee as aiding “Democrat-led persecution of ordinary citizens engaged in legitimate political discourse,” seemingly downplaying the violence, killing, and destruction that took place at the Capitol and normalizing it.",
    "J. Scott Applewhite/AP\nOn Friday, the Republican National Committee censured Reps. Liz Cheney (R-WY) and Adam Kinzinger (R-IL) for their participation in a congressional committee investigating the January 6, 2021, Capitol riot — a move that underscores just how closely the GOP continues to align itself with former President Donald Trump and his lies about the 2020 election.",
    "In fact, the resolution specifically mentions Trump, rebuking Cheney and Kinzinger for working on the committee alongside Democrats, arguing that they “support Democrat efforts to destroy President Trump more than they support winning back a Republican majority in 2022.”\nBased on the success of Friday’s vote, most in the RNC appear to share this view.",
    "I am now even more committed to fighting conspiracies and lies: pic.twitter.com/NzKK2s2kkC\n— Adam Kinzinger (@AdamKinzinger) February 4, 2022\nThis is far from the first time Cheney and Kinzinger have faced GOP blowback for how directly they’ve been willing to confront Trump’s lies about the 2020 election results.",
    "And as Friday’s censure proves, it is also a way to signify one’s status as a “true Republican.”\nCheney and Kinzinger’s censure, ultimately, is indicative of how much the Republican Party continues to value allegiance to Trump, sending a signal to candidates and voters ahead of the midterms.",
    "But it’s hard to interpret the resolution as anything other than a rebuke of Cheney and Kinzinger’s unwillingness to stay silent on Trump, given how outspoken both have been regarding the president’s role in spreading lies about the election that fueled the events of January 6.",
    "Former RNC party chair Michael Steele decried the censure as a “pathetic act of cowardice.” And current RNC member Bill Palatucci said the censure was a “distracting sideshow,” which followed the RNC’s failure to condemn participants in the January 6 attack.",
    "RNC chair Ronna Romney McDaniel released a subsequent statement noting that the committee was focusing on “legitimate political discourse that had nothing to do with violence at the Capitol,” an apparent attempt to clarify the language from the resolution.",
    "“History will be their judge.”\n“Rather than focus their efforts on how to help the American people, my fellow Republicans have chosen to censure two lifelong members of their Party for simply upholding their oaths of office,” Kinzinger said.",
    "Following the announcement of the RNC subcommittee’s censure vote, both lawmakers put out statements standing by their participation in the January 6 committee, and criticizing the party for moving forward with this resolution.",
    "Harmeet Dhillon, one of the resolution’s sponsors, told Politico the resolution is aimed at calling out Cheney and Kinzinger for their decision to “defy party leadership,” and not for their repeated criticism of Trump.",
    "Pelosi invited Cheney and Kinzinger — who are among the House’s most conservative lawmakers — in part because they were among the 10 House Republicans who voted for Trump’s impeachment in the wake of the insurrection.",
    "Other Trump critics including Reps. Tom Rice (R-SC), Fred Upton (R-MI), and Jaime Herrera Beutler (R-WA) are set to face Trump-backed primary challengers because of their vote to impeach him in January 2021.",
    "In 2020, Trump’s backing appeared to help former football coach Tommy Tuberville beat former Sen. Jeff Sessions in an Alabama Senate primary, and buoyed House candidates like Lisa Scheller in Pennsylvania.",
    "But there is a small group of moderate Republicans who used the vote to make it clear they disagree with the party’s unwillingness to take on Trump and call out the severity of the January 6 insurrection.",
    "Ultimately, the censure serves mainly to reaffirm the message that many Republicans aren’t interested in confronting Trump about his role in contesting the election and stoking the January 6 insurrection.",
    "(@SenBillCassidy) February 4, 2022\nLoyalty to Trump is set to play a role in the midterms\nThe censure also foreshadows the role that loyalty to Trump is likely to play in the upcoming midterm elections.",
    "The resolution condemns Cheney and Kinzinger for their involvement in the January 6 select committee in the House, which is dedicated to investigating the circumstances and causes of the insurrection.",
    "Republicans were left with just two members on the committee ultimately created by Pelosi after McCarthy nominated lawmakers who voted to overturn legitimate election results as committee members.",
    "Republicans have been upset, too, about Cheney and Kinzinger’s participation in a committee that’s focused on the role GOP lawmakers played in amplifying false claims about the election.",
    "In Texas, Susan Wright lost a special election runoff despite having the former president’s backing, and in a North Carolina House district, Lynda Bennett lost a Republican primary.",
    "The censure is emblematic of Trump’s influence on the Republican Party\nThe passage of the resolution is indicative of how many Republicans continue to back Trump and his views.",
    "— Mitt Romney (@MittRomney) February 4, 2022\nThe RNC is censuring Liz Cheney and Adam Kinzinger because they are trying to find out what happened on January 6th - HUH?",
    "That’s because, particularly in races in which the incumbent has a cash advantage, Trump’s backing is seen as a powerful way to boost one’s fundraising and legitimacy.",
    "Previously, House Republicans removed Cheney from leadership for her criticism of Trump, and a GOP organization in Illinois has censured Kinzinger for similar reasons.",
    "Cheney also faces a primary challenge from Trump-backed attorney Harriet Hageman for her Wyoming House seat, while Kinzinger has opted not to run for reelection.",
    "That would have put McCarthy in the difficult position of deciding whether to remove both members, something the House Freedom Caucus has pushed for before, too.",
    "In the past, loyalty to Trump has been a factor in a number of House and Senate primary races, and many — though not all — of his endorsed candidates have won.",
    "Originally, the House Homeland Security Committee hoped to create a fully bipartisan committee, but this plan was derailed by Minority Leader Kevin McCarthy.",
    "The RNC this week also ratified a rule that enables it and the Wyoming Republican Party to financially support Hageman, the candidate challenging Cheney.",
    "A prior version of the resolution could have had more of an impact: It urged House Republican leadership to kick both members out of the conference.",
    "Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all.",
    "“Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol,” Romney wrote in a Twitter post.",
    "An RNC subcommittee approved the resolution on Thursday, and a majority of the RNC’s 168 members did the same in a voice vote on Friday.",
    "I’m a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "Trump’s endorsement could play a significant role in crowded primaries for open Senate seats in Pennsylvania, Ohio, and North Carolina.",
    "“I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump,” Cheney wrote in a statement.",
    "Mitt Romney (R-UT) and Bill Cassidy (R-LA) were among those who questioned why Republicans were pursuing this censure.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.",
    "As the New York Times reports, the incumbent candidates have so far been able to out-raise their opponents.",
    "(2/2) https://t.co/HtgFzrCipd\n— Liz Cheney (@Liz_Cheney) February 4, 2022\nMy statement on the RNC censure.",
    "If anything, many intend to give their full support to what he says, no matter how dangerous or untrue.",
    "Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.",
    "Cheney is among the Republican incumbents facing a primary challenge due to their opposition to Trump.",
    "Our mission has never been more vital than it is in this moment: to empower through understanding.",
    "The censure, while a rare move, won’t affect Cheney’s or Kinzinger’s current roles in the House.",
    "Though it doesn’t formally expel either member from the party, it all but does so in practice.",
    "In a handful of races, however, his endorsement hasn’t been enough to secure victory.",
    "Cheney and Kinzinger are the only Republicans on the January 6 committee.",
    "That hasn’t stopped candidates from vying for Trump’s endorsement.",
    "Millions turn to Vox to understand what’s happening in the news.",
    "I will never stop fighting for our constitutional republic.",
    "Please consider making a contribution to Vox today.",
    "The final version simply criticizes their actions.",
    "Will you support Vox’s explanatory journalism?",
    "History will be their judge.",
    "Senator Bill Cassidy, M.D.",
    "No matter what.",
    "— U.S.",
    "Sens."
  ]
}