{
  "id": 2433,
  "mediaId": 2915,
  "date": "2022-03-25",
  "headline": "Arizona Legislature Takes Giant Step Against LGBTQ Agenda",
  "image": "https://charismanews-secure-charismamedia.netdna-ssl.com/images/stories/2022/3/Swimming_Lia_Will_Thomas.jpg",
  "link": "https://www.charismanews.com/us/88728-arizona-legislature-takes-giant-step-against-lgbtq-agenda",
  "mediaOutlet": "charismanews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Benjamin Gill/CBN News",
  "authorUrl": "https://www.charismanews.com/component/search/?searchword=Benjamin%20Gill/CBN%20News&ordering=newest&searchphrase=exact&areas[0]=authors",
  "termIds": [
    1317,
    2321,
    2950,
    3975,
    82,
    429,
    878,
    4830,
    5037
  ],
  "sentences": [
    "More recently the dominance of transgender collegiate swimmer Will \"Lia\" Thomas has escalated the debate once again in states across the U.S.\nThomas, who had failed to win while competing as a male collegiate swimmer, changed to a female presentation and was then allowed to join the women's swimming team at the University of Pennsylvania.",
    "The debate about transgender athletes has been raging for years, with little girls taking a stand in court for their rights after being forced to race against track athletes who were born male.",
    "The Arizona legislature voted on Thursday to prohibit sex-change surgeries on children and to ban transgender athletes who were born male from playing on girls' sports teams.",
    "Earlier this week, GOP governors in Indiana and Utah vetoed similar bills that were intended to protect the rights of women and girls who are athletes.",
    "Thomas went on to dominate women's swimming, recently winning an individual title at the NCAA Women's Division I Swimming Championship last week.",
    "Then, President Biden signed a controversial executive order that critics said \"erased\" the rights of girls in favor of transgender rights.",
    "\"In my opinion, it's unfair to allow biological males to compete with biological girls' sports.\"",
    "Read articles like this one and other Spirit-led content in our new platform, CHARISMA PLUS.",
    "\"This bill to me is all about biology,\" said Republican state Rep. Shawnna Bolick.",
    "Copyright © 2022 The Christian Broadcasting Network Inc. All rights reserved.",
    "For the rest of this article, visit our content partners at CBN News.",
    "Doug Ducey has not said if he will sign either of the bills.",
    "Get Charisma's best content delivered right to your inbox!",
    "Click here to subscribe to the Charisma News newsletter.",
    "Reprinted with permission from CBN.com.",
    "Never miss a big news story again.",
    "Republican Gov."
  ]
}