{
  "id": 2674,
  "mediaId": 2548,
  "date": "2022-03-28",
  "headline": "Republicans Turn To Female Candidates In Suburban Battleground Districts",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/03/stefanik-epac-presser-e1648501389827.jpg",
  "link": "https://dailycaller.com/2022/03/28/republican-female-candidates-elise-stefanik-elevate-pac/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Ginsberg",
  "authorUrl": "https://dailycaller.com/author/michael.b.ginsberg1998@gmail.com",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/1WWbQxmQX0\n— Kevin Frey (@KevinFreyTV) March 28, 2022\nStefanik pushed back on the idea that her PAC’s efforts are similar to those of Democrats looking to recruit female and minority candidates, saying in an interview with the Daily Caller that her efforts are focused on supporting female candidates who have the best chance to win their districts.",
    "“Rather than playing outdated identity politics, we look for the best candidate, the strongest candidate in these districts who happen to be Republican women, and then we get fully behind that candidate, the strongest candidate, to get them through the primary and general election, which is why I think we’ve had so much success,” she explained.",
    "Stefanik predicted that more than 50 women will serve in the House GOP conference in 2023, adding that Democrats do not have a “monopoly on women candidates or women voters.”\n“We have so many Republican women, it’s hard to fit them all in one press conference,” she joked.",
    "“Having people that can connect with the community, that look the way that we look, that talk the way that we talk, that makes a difference, especially in national politics moving forward,” Luna added of the GOP’s recruitment of female and minority candidates.",
    "I’m not supposed to exist in their world, at least not as a conservative, and so I talk about my upbringing and experience, and how these progressive policies actually did nothing for me when I grew up in the welfare system,” she told the Daily Caller.",
    "“This is going to be a pink wave, a pink wave of Republican women around the country.”\nWASHINGTON, DC – JUNE 10: U.S. State Department spokesperson Morgan Ortagus speaks during a media briefing at the State Department June 10, 2019 in Washington, DC.",
    "(RELATED: ‘The Year Of The Republican Woman’: Here’s A List Of GOP Women Who Won 2020 Elections)\nRolling out her latest tranche of E-PAC endorsements, @EliseStefanik says she predicts there will be more than 50 GOP women in the next Congress.",
    "New York Rep. Elise Stefanik, the third-ranking Republican in the House of Representatives, is banking on a slate of female candidates to wrest control back of the lower chamber after four years in the minority.",
    "(RELATED: Henry Cuellar And AOC-Backed Candidate Headed To Runoff In South Texas District)\n“Cuellar’s voted every time with Nancy Pelosi, even though he talks a real good game on Fox News,” she added.",
    "Garcia will face either Democratic Rep. Henry Cuellar, who is currently facing an FBI investigation for reported dealings with Azerbaijan, or “Squad”-endorsed immigration attorney Jessica Cisneros.",
    "Several endorsed candidates worked in the Trump administration or for the Trump campaign, including Ohio’s Madison Gesiotto Gilbert, Tennessee’s Morgan Ortagus and New Hampshire’s Karoline Leavitt.",
    "“Candidates like myself, and so many of the other candidates today, actually scare the heck out of the Democratic Party platform, because they can’t actually use their identity politics against us.",
    "Stefanik’s Elevate PAC (E-PAC) is promoting 18 Republican women in some of the most competitive House districts in the country, including five in seats labeled toss-ups by Cook Political Report.",
    "“Being [Cruz’s] eyes and ears on the ground and working for 28 million Texans, I saw firsthand the border influx that we’ve had, and the different things that have happened within the district.",
    "Several candidates discussed pocketbook and public safety issues, emphasizing the GOP’s approach to winning suburbanites, specifically parents, on topics like inflation and immigration.",
    "(Photo by Alex Wong/Getty Images)\nGarcia explained that her time working for Texas Sen. Ted Cruz helped her gain experience working on both partisan issues and constituent services.",
    "E-PAC raised more than $1 million during the 2020 election cycle, and has raised more than $548,000 in the 2022 cycle so far, according to Federal Election Commission filings.",
    "Anna Paulina Luna, who is running in Florida’s Thirteenth District, added that female candidates can help Republicans blunt attacks from Democrats claiming racism and sexism.",
    "“It’s one thing to say something, but your votes matter.”\nE-PAC endorsed candidates gain access to Stefanik’s small-dollar donor list, as well as her team of advisers.",
    "She followed up in an interview with the Daily Caller, explaining that drugs can be shipped to southeastern Indiana from the U.S.-Mexico border in 48 hours.",
    "“I’ll fight back to secure the border and stem the flow of illegal drugs into our country,” Indiana state Sen. Erin Houchin said at the press conference.",
    "Nearly 300 women have filed to run for Congress in 2022, according to a review from the Rutgers University Center for American Women and Politics.",
    "She noted that as Cruz’s south Texas regional director, she spent the most time helping Texans navigate the Department of Veterans’ Affairs.",
    "They argue that the Biden administration’s immigration policy has caused increased human trafficking as well as increased drug trafficking.",
    "Working with community leaders, working with law enforcement officials, working with land owners, ranchers, small business owners.",
    "Seventeen of the 18 candidates are running in districts targeted by the National Republican Congressional Committee for flips.",
    "In contrast, she argued, Democrats specifically promote female and minority candidates at the expense of district fit.",
    "“We’re going to do the hardest thing for Republican women, which is getting out of the primary,” Ortagus said.",
    "It’s making our communities less safe, and the voters in southern Indiana want that to end,” she said.",
    "Secretary of State Mike Pompeo discussed topics including the latest development on tension with Iran.",
    "Others, including Houchin and Texas’ Cassy Garcia, have worked as aides to congressional Republicans.",
    "This article has been updated to reflect the number of women currently serving in the 117th Congress.",
    "A Monday afternoon fundraiser held for E-PAC raised $150,000, Stefanik told the Daily Caller.",
    "We’ve got some of the busiest ports of trade in the district,” she told the Daily Caller.",
    "One hundred-forty five women hold seats in the 117th Congress, including 39 Republicans.",
    "“We’ve seen increases in overdose deaths and drug crimes.",
    "Both numbers constitute record highs.",
    "I am a Hispanic female veteran."
  ]
}