{
  "id": 799,
  "mediaId": 2746,
  "date": "2022-04-20",
  "headline": "Original ‘Trumpers’ urge ex-president to rescind Vance endorsement in Ohio Senate race",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/15/Election_2022_Senate_Ohio_Trump_49616.jpg-6bd01_c0-124-4852-2954_s1200x700.jpg?a423c8e1ad5a5d8e7fd7e08034242c48bb553fb3",
  "link": "https://www.washingtontimes.com/news/2022/apr/20/original-trumpers-urge-ex-president-rescind-vance-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    1684,
    3629,
    4192,
    4555,
    4595,
    767,
    878,
    1171,
    5212
  ],
  "sentences": [
    "“While JD Vance may have apologized and now says nice things about you (as candidate Vance) — the fact is JD Vance never once apologized for working against our movement and most importantly calling us — your original supporters — racist,” the letter says.",
    "Mr. Trump threw his support behind Mr. Vance last week, ending months of speculation over whether he would stay on the sidelines in a race in which four of the top five candidates spent months falling over one another to show their fealty to him.",
    "Others are sure to question Mr. Trump’s endorsement of Morgan Ortagus, a former State Department spokesperson, in her bid for Tennessee’s 5th Congressional District after the state Republican Party booted her from the primary ballot.",
    "“This endorsement of JD Vance is a betrayal to not only your Ohio supporters but Trump supporters across our great nation!”\nCorrection: An earlier version of this story misstated the year of the 2016 Republican National Convention.",
    "“We would respectfully request you reconsider your endorsement of JD Vance to show your supporters in Ohio and across our great states why we first believed in you back in 2016,” reads the letter, released Wednesday.",
    "“That it really was about the We the People, America First and Making America Great Again not supporting a political chameleon and snake oil salesman like JD Vance!”\nThe Vance campaign dismissed the letter.",
    "The letter from the early Ohio Trump supporters says Mr. Vance was working against Mr. Trump when they were working for him and that Mr. Vance has not developed relationships with the grassroots activists.",
    "“He is our best chance for victory in what could be a very tough race.”\nThe highly coveted Trump endorsement has been widely viewed as a major victory for Mr. Vance in his quest to replace retiring Sen.",
    "“We look forward to winning them over like President Trump did.”\nThe letter’s 33 signatories include Rob Scott, state director of the Trump 2016 campaign, and Ralph King, a longtime tea party activist.",
    "In Georgia, there is bubbling concern that the former president’s support for Herschel Walker’s Senate bid is misguided because of the personal baggage the Heisman Trophy winner brings to the table.",
    "The former president is set to headline a rally in Delaware, Ohio, this weekend featuring Mr. Vance and other candidates he has endorsed: Rep. Mike Carey, Max Miller and Madison Gesiotto Gilbert.",
    "Vance’s bid for the Republican nomination for the U.S. Senate in Ohio has left some “original and proud ‘Trumpers’” feeling so betrayed that they are calling on him to rescind his support.",
    "Mr. Vance, a venture capitalist, Yale University graduate and the bestselling author of “Hillbilly Elegy,” was a major critic of Mr. Trump during his rise and early on in his presidency.",
    "Mr. Trump also withdrew his support for Rep. Mo Brooks in the Alabama Senate race after the candidate urged Republicans to stop obsessing over the 2020 election and lagged in the polls.",
    "More than half of the Ohio delegates who represented Mr. Trump at the 2016 Republican National Convention have signed an open letter urging him to withdraw his support for Mr. Vance.",
    "“Conservative outsiders like Donald Trump and JD Vance will always be fought by the Republican establishment and party insiders,” said Vance campaign spokesman Taylor Van Kirk.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,” Mr. Trump said in his endorsement statement.",
    "Mr. Trump’s preferred candidate in Pennsylvania’s race for Senate, Sean Parnell, pulled out of the contest after his estranged wife won custody of their children.",
    "“We are NOT the Establishment or RINOs and will not be dismissed as such — we are the original Trump supporters in Ohio,” Mr. King told The Washington Times.",
    "Mr. Trump’s star power remains unmatched with the base of the Republican Party, and he has sought to play kingmaker in numerous races across the country.",
    "Billionaire entrepreneur Peter Thiel donated $3.5 million to a super PAC backing Mr. Vance after he landed the Trump endorsement, according to Politico.",
    "is the strongest candidate in the race to beat [Democrat] Tim Ryan and will be a tough, America First fighter in the U.S. Senate,” Mr. Budowich said.",
    "Donald Trump Jr., meanwhile, is scheduled to headline a town-hall-style forum Wednesday with Mr. Vance in the Cleveland suburbs.",
    "Asked about the letter, Trump spokesman Taylor Budowich said the former president is “looking forward to rallying with J.D.",
    "He said he suspects Mr. Trump is getting bad advice from the party establishment and so-called Republicans in name only.",
    "MAGA supporters in Pennsylvania voiced outrage over Mr. Trump’s endorsement of television personality Mehmet Oz.",
    "Ms. Timken, former state Treasurer Josh Mandel and businessman Mike Gibbons also had sought Mr. Trump’s support.",
    "He said on numerous occasions that he was wrong about Mr. Trump and regretted his remarks.",
    "State Sen. Matt Dolan, who also is running, did not court Mr. Trump’s backing.",
    "Rob Portman, who is backing former Ohio Republican Party Chair Jane Timken.",
    "Vance and tens of thousands of MAGA patriots this Saturday in Ohio.”\n“J.D.",
    "“They are pushing this Vance down Donald Trump’s throat,” Mr. King said.",
    "Mr. Thiel has now donated $13.5 million to the pro-Vance group.",
    "Mr. Trump’s bet that former Sen. David Perdue can unseat Gov.",
    "Other high-profile Trump endorsements are facing blowback.",
    "Brian Kemp in the Republican primary is looking iffy.",
    "Former President Donald Trump’s endorsement of J.D.",
    "Things have not always gone swimmingly.",
    "Mr. Vance eventually changed his view.",
    "It proved to be enough.",
    "“Like some others, J.D."
  ]
}