{
  "id": 109,
  "mediaId": 65,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Trump to target Cheney at May 28 rally in Wyoming",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/dc66470f-a103-4856-89a3-c39530f21902/29e464ce-5d87-46b0-9178-2979ae122ebf/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/trump-to-target-cheney-at-may-28-rally-in-wyoming",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    945,
    1147,
    1248,
    1609,
    2087,
    3085,
    3094,
    427,
    428,
    2598,
    2976
  ],
  "sentences": [
    "They were a fundraiser in Miami hosted by PayPal co-founder and billionaire venture capitalist Peter Thiel, who is a Trump ally; a fundraiser at the former president's Mar-a-Lago resort in Palm Beach, Florida, hosted by libertarian-minded Sen. Rand Paul, where Trump made an appearance; and a fundraiser in the nation's capital headlined by House Minority Leader Kevin McCarthy of California\nMcCarthy is one of dozens of House Republicans who are backing Hageman in her push to oust Cheney.",
    "Cheney, who has been very vocal in emphasizing the importance of defending the nation's democratic process and of putting country before party, is one of only two Republicans serving on a special select committee organized by House Democrats to investigate the storming of the U.S. Capitol.",
    "Cheney caught a break in March when the Wyoming legislature decided against scrapping same-day party registration in primaries, which would have prevented Democrats from crossing party lines and registering as Republicans to vote for Cheney in the state's Aug. 16 primary.",
    "The former president, who last summer backed Harriet Hageman in her bid to oust Cheney in this year's Republican primary and who has helped fundraise for Hageman, is now heading to Wyoming later this month to headline a rally for his endorsed candidate.",
    "Cheney, a conservative lawmaker and defense hawk who is the daughter of former Vice President Dick Cheney, immediately came under verbal attack from Trump and his allies, and last May she was ousted from her number-three House GOP leadership position.",
    "\"President Donald J. Trump, 45th President of the United States of America, delivers remarks in support of Endorsed Candidate Harriet Hageman for U.S Representative from Wyoming,\" read a statement from Trump's Save America political action committee.",
    "Trump's rally in Wyoming will precede a month when Cheney is expected to grab plenty of media attention, as the select committee investigating the attack on the Capitol is scheduled to hold at least eight hearings in June.",
    "Cheney released her fundraising figures a couple of days after Hageman announced that she brought in roughly over $1.3 million during the first quarter, according to figures shared first with Fox News.",
    "Cheney, a longtime vocal GOP Trump critic, was the most senior of the 10 House Republicans who voted to impeach the then-president on a charge of inciting the deadly attack on the U.S. Capitol.",
    "Defending herself, the congresswoman said at the time, \"I'm a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.\"",
    "The attack was waged by right-wing extremists and other Trump supporters who aimed to disrupt congressional certification of President Biden's Electoral College victory in the 2020 election.",
    "Cheney hauled in $2.94 million in the January-March first quarter of 2022 fundraising as she runs for her fourth two-year term representing Wyoming's at large House district.",
    "CHENEY HAULS IN NEARLY $3 MILLION DURING FIRST QUARTER OF FUNDRAISING\nTrump, stepping up his efforts to oust Cheney from Congress, endorsed Hageman as she entered the race.",
    "And the former president and his allies successfully urged some, but not all, of the other anti-Cheney candidates to drop out of the primary and coalesce around Hageman.",
    "CHENEY TELLS FOX NEWS THAT BEHIND THE SCENES', MANY IN GOP ARE THANKING HER\nTrump's repeated attacks on Cheney have fueled her fundraising.",
    "The Republican National Committee in February, in a push by Trump allies, censured Cheney over her role on the Jan. 6 committee.",
    "The move by Wyoming's legislature was seen as a defeat for Trump and his allies, who pushed to end same-day party registration.",
    "The highest-profile of those staying in the race is state Sen. Anthony Bouchard, a strong supporter of the former president.",
    "The congresswoman reported holding a formidable $6.8 million cash on hand in her campaign coffers as of the end of March.",
    "Republican Rep. Liz Cheney of Wyoming sits high atop Donald Trump's list of GOP enemies.",
    "Hageman's first-quarter haul was boosted by three top-dollar fundraisers on her behalf.",
    "Trump announced on Monday that he'll hold a rally in Casper, Wyoming on May 28.",
    "Hageman reported just over $1 million cash on hand."
  ]
}