{
  "id": 114,
  "mediaId": 19,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Donald Trump Announces Rally with Liz Cheney Challenger Harriet Hageman in Casper, Wyoming",
  "image": "https://media.breitbart.com/media/2022/05/Donald-Trump-1-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/02/donald-trump-announces-rally-with-liz-cheney-challenger-harriet-hageman-in-casper-wyoming/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlie Spiering",
  "authorUrl": "https://www.breitbart.com/author/charlie-spiering/",
  "termIds": [
    826,
    945,
    1147,
    1248,
    2087,
    3085,
    3094,
    633,
    2598,
    2607,
    2976
  ],
  "sentences": [
    "Make America Great Again!?\nMany of the top challengers to Cheney dropped out to support Hageman, but not State Sen. Anthony Bouchard, whose fundraising has slowed since Trump chose not to endorse him.",
    "The daughter of former Vice President Dick Cheney has become the darling of the media and Democrat elite since she vocally protested the majority of the Republican party supporting Trump.",
    "Harriet has my Complete and Total Endorsement in replacing the Democrats' number one provider of sound bites, Liz Cheney,? Trump wrote at the time.",
    "Hageman was chosen by Trump in September 2021 to challenge Cheney despite a crowded field of interested candidates.",
    "The president is expected to rally with Harriet Hageman, a Republican primary challenger to Rep. Liz Cheney (R-WY).",
    "Sen. Mitt Romney and former Republican House Speaker Paul Ryan have hosted fundraisers with Cheney.",
    "The rally is scheduled for Saturday, May 28, 2022, at 4:00 PM MDT on Memorial Day weekend.",
    "President Donald Trump announced Monday his plan for a political rally in Casper, Wyoming.",
    "Cheney has raised more than $10 million for her race, with $6.8 million cash on hand.",
    "Senate Minority Leader Mitch McConnell has also donated to her campaign.",
    "Unlike RINO Liz Cheney, Harriet is all in for America First.",
    "She has also won support from anti-Trump Republicans."
  ]
}