{
  "id": 118,
  "mediaId": 312,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Arkansas Governor Asa Hutchinson Says 2024 Presidential Bid 'On the Table'",
  "image": "https://api.time.com/wp-content/uploads/2022/05/AP22121560427491.jpg?w=600&h=276&quality=85",
  "link": "https://time.com/6172475/hutchinson-possible-presidential-bid/",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2409,
    2409,
    1231,
    1231,
    1147,
    1147,
    1434,
    1434,
    2551,
    2551
  ],
  "sentences": [
    "Hutchinson, a two-term Republican governor who is restricted under Arkansas law from seeking a third term, said it was time for the national GOP to move on from Trump in regards to the candidates he's endorsing in 2022 as well as the direction he wants to take our country.?\nAsked on CNN's State of the Union? if he was mulling a presidential run, Hutchinson replied: I am.",
    "And so that's not a factor in my decision-making process.?\nHutchinson in recent months has become a fixture on cable television  at times drawing the ire of Trump  in defending his veto of legislation targeting transgender youths in the state and warning fellow Republicans about tying their fortunes too closely to the former president.",
    "But you have got to get through, of course, this year, but that's an option that's on the table.?\nMaking clear he was not aligned? with Trump, Hutchinson added: I think he did a lot of good things for our country, but we need to go a different direction.",
    "Vote Now\nWhat Elon Musk Really Believes\nWe Knew It Was Coming.' Police-Reform Advocates in Grand Rapids, Mich., Had Been Bracing for a Death Like Patrick Lyoya's\nAmerican Companies Have Always Been More Anti-Union Than International Ones.",
    "Here's Why\nA Foreign Fighter on What It Was Like on Ukraine's Front Line\n14 Book-to-Screen Adaptations to Catch in 2022\nColumn: America Gave Up on Overtimeand It's Costing Workers $35,451 a Year\nSHARE THIS STORY",
    "Though Trump remains the most popular figure among Republican voters who dominate primary elections, several GOP figures are considering presidential runs on a platform opposing the former president.",
    "Ron DeSantis, former Vice President Mike Pence and former Secretary of State Mike Pompeo, though they have been less clear about their intentions if Trump enters the race.",
    "Asa Hutchinson said Sunday he is weighing a presidential run in 2024 and his decision won't be affected by whether former President Donald Trump decides to join the race.",
    "Nikki Haley, a former South Carolina governor and U.N. ambassador, has said she would stand down on a potential bid if Trump opts to run a second time.",
    "After the Jan. 6, 2021, Capitol riot, which led to Trump's impeachment by the House, Hutchinson said he wanted Trump's administration to end.",
    "More Must-Read Stories From TIME\nInside Zelensky's World\nWho Should Be on the 2022 TIME100?",
    "Larry Hogan of Maryland and Reps. Adam Kinzinger of Illinois and Liz Cheney of Wyoming.",
    "He's also made it clear since early 2021 that he would not back a Trump 2024 bid.",
    "Other candidates eyeing possible runs are Florida Gov.",
    "Beyond Hutchinson, they include Gov.",
    "WASHINGTON  Arkansas Gov."
  ]
}