{
  "id": 123,
  "mediaId": 65,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "With Cruz backing, Mandel brushes off RINO' attacks after book alleges dishonesty",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/e0a0d78e-653a-4a64-98cf-bcb37e394d93/20ae769a-68f5-4adb-88d2-fc3b16952e9b/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/josh-mandel-ohio-senate-jd-vance-ted-cruz",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    1765,
    1765,
    1710,
    1710,
    1668,
    1668,
    1887,
    1887,
    946,
    946,
    1147,
    1147,
    1311,
    1311,
    428,
    428,
    379,
    379,
    2845,
    2845
  ],
  "sentences": [
    "New York Times reporters Jonathan Martin and Alex Burns briefly described Mandel, a former Ohio state treasurer, of speaking out of both sides of his mouth when it came to supporting former President Donald Trump over establishment Republican leaders like Senate Minority Leader Mitch McConnell, R-Ky.\n\"Mandel, acknowledged to Republicans in Washington that he was parroting absurd rhetoric in the primary campaign out of a desire to court Trump and his supporters  but that was simply what he believed it would take to win,\" Burns and Martin wrote in their book \"This Will Not Pass,\" which will be released May 3.",
    "OHIO GOP SENATE SHOWDOWN: GIBBONS HITS MANDEL ON CHINA IN AD THAT RETURNS TO ROOT OF COMBUSTIBLE FEUD\n\"In fact even as he publicly mimicked Trump's incendiary rhetoric, Mandel would privately reach out to McConnell's top lieutenants to alert them each time one of his top rivals, J.D.",
    "Mandel also called out anti-Trump Republican Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois, as well as Sen. Mitt Romney, R-Utah, saying: \"we need to do everything we can to eliminate them from the Republican Party and from politics.\"",
    "Ohio GOP Senate candidate Josh Mandel fended off attacks from an opponent calling him a \"phony, fraud and sell-out\" and stumped with political supporters at a packed auditorium of the Victory Christian Church in Kettering, Ohio, Friday.",
    "Vance accused Mandel of being a Republican in name only (RINO) following reports from an upcoming book that Mandel pretends to be pro-Make America Great Again on the campaign trail but sides with establishment Republicans in private.",
    "In a statement Friday, Vance took the excerpts of the book and said Mandel \"claims to be anti-establishment in public, but throws President Trump and the entire MAGA movement under the bus to the establishment behind closed doors.\"",
    "Implementing America first principles at the border, for example, \"means securing the border and deporting every single illegal in this country  not because we hate foreigners, but because we love this country,\" Mandel said.",
    "\"I think people in Washington will make false attacks all the time on people like me because I'm a constitutional conservative and a fighter,\" Mandel told Fox News Digital at the rally, responding to Vance's comments.",
    "\"I think the people here in Ohio, the conservative grassroots, know that there's only one fighter, only one true conservative in this race  and it's me, Josh Mandel,\" he said, flanked by Sen. Ted Cruz, R-Texas.",
    "(Photo by Andrew Spear/Getty Images)\n\"A lot of the people running against me, a lot of the folks in the media, in the squishy, RINO, establishment wing of the party, they think America first is a slogan.",
    "\"While JD Vance was courageously criticizing GOP leadership and holding them to account for their failures, Mandel was quite literally kissing the ring and bending the knee to the RINO establishment.",
    "Mandel and candidate Mike Gibbons, an investment banker, were considered the top tier candidates in the Ohio GOP Senate primary for most of the race, up until Trump endorsed Vance earlier this month.",
    "One attendee said they believe Vance, if he wins the GOP nomination, might make a general election move to the left, leaning on his past criticism of Trump as he runs against a Democrat.",
    "Mandel said he opposed the former Republican governor over Obamacare expansion in Ohio, financial transparency, and disapproved of Kasich's attempts to block pro-life legislation.",
    "\"If you look at Josh's record, he's got the strongest conservative record of standing and fighting for conservative principles,\" Cruz told Fox News Digital.",
    "A Fox News poll released Tuesday showed Vance at 23% compared to Mandel at 18% and Gibbons at 13%, with many likely voters still undecided.",
    "Before the rally, attendees told Fox News that they liked what they hear from Mandel, including his faith and his Marine Corps service.",
    "TRUMP ENDORSEMENTS OF OZ, VANCE AREN'T DETERRING CRUZ, POMPEO IN KEY GOP SENATE PRIMARIES\nCruz, who stumped for Mandel Friday, agreed.",
    "Vance, criticized Washington Republicans  effectively trying to have it both ways with Trump and the GOP leaders he derided.\"",
    "During his speech, Mandel touted his focus on churches during the campaign to applause from the audience.",
    "Josh is a cowardly political chameleon who simply cannot be trusted to put America First,\" Vance said.",
    "To show his conservative credentials, Mandel told Fox News Digital Friday that he was former Ohio Gov.",
    "Several attendees said they support Trump, but are dissatisfied with his endorsement of Vance.",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "He touted large crowd numbers he attracted at churches throughout Ohio.",
    "\"People can call me a lot of names, doesn't make it true.\"",
    "The Ohio Republican Senate primary will be held May 3.",
    "Tyler Olson covers politics for Fox News Digital.",
    "And I'm the only one who gets that,\" Mandel said.",
    "It's not a slogan, it's a governing philosophy.",
    "John Kasich's \"worst nightmare.\"",
    "Another called Vance a \"Judas.\"",
    "Trump-endorsed candidate J.D.",
    "One said it was a \"mistake.\""
  ]
}