{
  "id": 128,
  "mediaId": 237,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "McCarthy's spinelessness bodes ill for future of the House GOP",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/2078815/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Ffe%2Fc2%2F38b051d84a038d0f49ff6a82c181%2Fkevin-mccarthy-abortion-alabama.jpg",
  "link": "https://www.washingtonexaminer.com/opinion/mccarthys-spinelessness-bodes-ill-for-the-future-of-the-house-gop",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Faria",
  "authorUrl": "https://www.washingtonexaminer.com/author/zachary-faria",
  "termIds": [
    683,
    683,
    1609,
    1577,
    1577,
    1248,
    1248,
    1147,
    1147,
    1609,
    2087,
    2238,
    2238,
    2087,
    428,
    562,
    562,
    428,
    2672,
    2672
  ],
  "sentences": [
    "Just a few weeks later, McCarthy was in Mar-a-Lago meeting with Trump and declaring that the former president's popularity has never been stronger.? He endorsed a primary challenger to Rep. Liz Cheney in Wyoming over her criticism of Trump, but not to Gaetz, Greene, or any of the other GOP caricatures he privately criticized.",
    "Gaetz took to Twitter to call McCarthy and House Minority Whip Steve Scalise weak men.? Tucker Carlson took to his Fox News show to call McCarthy a puppet of the Democratic Party.? McCarthy is holding onto Trump's support, for now, but Trump's allies are pressing to change that.",
    "He jumped at the chance to condemn Trump and the GOP's more outlandish members when it looked like the tide had turned against them, then worked his way back into Trump's good graces when it was apparent that he wasn't going away.",
    "Reps. Matt Gaetz of Florida and Marjorie Taylor Greene of Georgia, among others, made a mockery of the party and the conservative movement in the run-up to and the aftermath of the Jan. 6 Capitol riot.",
    "Neither is the continued rhetoric that Joe Biden is not the legitimate president.?\nThat was when it looked like the tide had turned against Trump for good.",
    "House Minority Leader Kevin McCarthy has let narratives about former President Donald Trump determine what he thinks, instead of principles.",
    "As my colleague Quin Hillyer wrote, McCarthy was entirely correct to criticize the rhetoric of the House GOP's most outlandish members.",
    "And now those private criticisms have become public, thanks to a New York Times report that includes leaked audio of his comments.",
    "The president bears responsibility for Wednesday's attack on Congress by mob rioters,\" McCarthy said on the House floor.",
    "As such, he looks like a spineless leader and has become a deserved target of scrutiny from all sides of his own party.",
    "McCarthy has allowed his comments and his public positions to be dictated by whomever he is afraid of at the time.",
    "Some Republicans who had planned to object to the certification of Biden's election backed down.",
    "It's not exactly an ideal trait for the man who might become Sspeaker of the House next year.",
    "Republicans across the country were denouncing his rhetoric and the riot that he inspired.",
    "But then the narrative changed, and Trump's support among the GOP bounced back.",
    "\"He should have immediately denounced the mob when he saw what was unfolding.",
    "In the aftermath of the riot, McCarthy was also right to criticize Trump.",
    "And so McCarthy became a warrior for Trump once again.",
    "What we saw last week was not the American way.",
    "McCarthy is a follower, not a leader."
  ]
}