{
  "id": 130,
  "mediaId": 129,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "A big G.O.P. group amplifies its attacks on a Trump-backed Ohio candidate.",
  "image": "",
  "link": "https://www.nytimes.com/live/2022/04/28/us/midterms-elections-primary",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2215,
    2215,
    2465,
    2465,
    946,
    946,
    1434,
    1434,
    1147,
    1147,
    428,
    472,
    472,
    571,
    571,
    428,
    2845,
    2845
  ],
  "sentences": [
    "He said the survey testing attitudes about Mr. Pence came after the riot at the Capitol on Jan. 6, 2021, at which some Trump supporters chanted: Hang Mike Pence!?\nWe polled Pence's approval rating after Jan. 6 to see what the temperature was on that,? Mr. McIntosh said of the former vice president, who is considering a presidential run in 2024. I'm very much of the mind that if Trump decides to run for president, he's going to be the nominee.?\nMidterms Begin: The Texas primaries officially opened the 2022 election season.",
    "Mr. Vance, the author of Hillbilly Elegy,? has spent heavily to promote this ad, in which he aligns himself with voters who dislike President Biden, reflexively loathe the news media, have grown weary from the opioid crisis and believe that unauthorized immigrants  who he falsely equates to more Democrat voters?  are pouring into this country.?\nNothing racist'\nMr. Mandel, a former state treasurer, takes a similar approach with this ad, which somehow manages to be even less subtle than Mr. Vance's.",
    "They realize that a lot of those union bosses, they're part of the Democratic machine, and oftentimes, they're looking at a political outlook of their unions that is in disalignment with their own.?\nUnion leaders agree that it is becoming much more difficult to paper over disagreements between local Democrats and their national party when Trump-aligned Republican candidates are using the same anti-China, anti-trade rhetoric that Ohio Democrats use.",
    "Our party, for the most part, is very coastally oriented,? she said, adding, Our part of the country just doesn't have much voice, and so partly what he reflects is that vacuum of people feeling left out, and I can understand that.?\nIn Toledo, a burning issue is a natural gas and crude oil pipeline called Line Five that runs on the floor of the Great Lakes from Canada to Ohio, supplying a refinery here that employs 1,200 union workers.",
    "chairwoman, is doing her best to match her rivals in combative tone, promising to fight back? against the liberals? who are trying to destroy our country.?\nEven the leading Democrat, Representative Tim Ryan, is echoing Mr. Trump's rhetoric, if with a slight tweak: We can't afford to be Democrats and Republicans right now,? he says, mindful that being a Democrat in Ohio is most likely a liability come November.",
    "The Biden Democrats want to force our daughters to compete against men,? she says, saying that liberals are ruining girls' sports? and trying to destroy our country.?\nMr. Ryan, a longtime Democratic congressman, has an opponent in the Senate primary, but his television ads seem aimed more at the independents and Republicans he would need to peel away to have a shot in November.",
    "Where people are, I don't know if they're afraid of accountability or where we're headed, but instead of personal responsibility, they say, I'd rather blame you for all my problems, and then not only am I going to blame you, I'm going to be mean and aggressive with it.'?\nMs. Kaptur sees it too, and sees Mr. Trump's appeal, despite his failure to deliver tangible benefits.",
    "When leftist cheaters lose,? he assures Ohioans, you win.?\nRuining girls' sports'\nMs. Timken didn't play pro football, but she brandished her own credentials as a former college athlete? in this ad, set in a high school gym with girls practicing basketball in the background, to issue a strongly worded denunciation of letting transgender athletes compete in girls' sports.",
    "I supported him, and he didn't.? Mr. Trump said he was angry about the negative ads Mr. McIntosh's group was running, but called his relationship with Mr. McIntosh great.? He added: We have an unblemished record of success.? Mr. Trump appeared to overlook a House special election in Texas last year, in which he endorsed a losing candidate at Mr. McIntosh's urging.",
    "Mr. Trump would have won Ms. Kaptur's newly drawn district by three percentage points, but in the parts that overlapped the old map, Ms. Kaptur outperformed Joseph R. Biden Jr. by six percentage points, giving some hope  at least numerically  that her name recognition, long record and general popularity could still deliver that 41st year in Congress.",
    "We have to be Americans first.?\nHere's a look at a few of the ads popping up on screens across the Buckeye State:\nDo you hate Mexicans?'\nNothing says I'm on your side,? apparently, more than defending the sensibilities of white voters who complain that they are being unfairly accused of racism for supporting tough restrictions on illegal immigration.",
    "Right now, we have to be Americans first.?\nTOLEDO, Ohio  Representative Marcy Kaptur, the blue-collar daughter of this blue-collar city, is on the cusp of a milestone: If elected in November to her 21st term, she will become the longest-serving female member of Congress, breaking Barbara Mikulski's combined House and Senate record.",
    "Mr. Trump made clear that he considers Mr. McIntosh to be by his side on a fight he cares most about: We're fighting Liz Cheney,? Mr. Trump said of the Wyoming congresswoman who is a key figure in the committee investigating the Jan. 6, 2021 attack on the Capitol and Mr. Trump's role in the events leading to it.",
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this year's map is poised to be surprisingly fair\nGovernors' Races: Georgia's contest will be at the center of the political universe, but there are several important races across the country.",
    "I mean, it's 1,200 direct jobs, and thousands of indirect jobs, which include union workers in good paying jobs, and Marcy Kaptur has been silent,? said State Senator Theresa Gavarone, a leading Republican in the race, as she shook hands at Archbold High School in the rural west of the newly drawn district.",
    "That Mr. Trump never seemed bothered by such conflicts frustrates her, and she does not seem clear on how to overcome his appeal in a region drained by globalization and left behind, first by free trade, then by the changing priorities of environmental protection and an information and technology economy.",
    "As Republican voters go to the polls on Tuesday to select Ms. Kaptur's opponent for the fall election, some of her oldest, firmest allies in the union world are having their doubts  about Ms. Kaptur's future, and more broadly, the future of the Democratic Party in the industrial heartland.",
    "Ohio voters are being bombarded on television, radio and online with campaign commercials in the fiercely contested Republican primary race for Senator Rob Portman's seat, to the tune of nearly $68 million, making it one of the nation's most expensive campaigns this year.",
    "Gretchen Whitmer in Michigan has labeled it a ticking time bomb? that needs to be shut down, and allies in the environmental movement say workers need to face reality: As the auto industry shifts to electric vehicles, oil pipelines and refineries will no longer be needed.",
    "Inside the club, there has been grumbling among staff members about Mr. McIntosh's leadership, with officials, none of whom were willing to be quoted, either complaining about his relationship with Mr. Trump or lamenting that he's being too antagonistic over Mr. Vance.",
    "Charles Herbster, a Republican running for governor in Nebraska, lashed out at the lawmaker who accused him of groping her in a new ad released days before he was scheduled to appear at a rally with former President Donald J. Trump, who endorsed him last fall.",
    "The message echoes the defense Mr. Herbster gave in a radio interview after the Nebraska Examiner reported that seven women accused Mr. Herbster of touching them inappropriately at various events dating to 2017, and an eighth said he had kissed her forcibly.",
    "There's nothing racist about stopping critical race theory and loving America.?\nLeftist cheaters'\nMr. Gibbons has shown voters two sides of his persona: a Trump-like businessman offering to tell politicians, You're fired,'? and a former football lineman.",
    "People with knowledge of the club's activities suggested that Mr. McIntosh was keeping various options open within the party, commissioning a survey last year that tested the popularity of former Vice President Mike Pence, an old ally of Mr. McIntosh.",
    "While on the coasts, prognosticators fret over the former president's continued hold on the Republican Party, in northwest Ohio, the party's embrace of Trump-era protectionism, immigration exclusion and anti-environmentalism is cheered heartily.",
    "Democrats say they're the ones working on behalf of people's pocketbooks, but how do I tell my members that's the guy working to help your pocketbook when that's the guy who is shutting down the pipeline to your refinery?? Mr. Enright asked.",
    "Vance reminding every waking Ohioan several times a day  including five times alone in one 15-second commercial  that Mr. Trump has endorsed him, and Josh Mandel doing his best to make himself appear the most pro-Trump? candidate regardless.",
    "Like Mr. Vance, Mr. McIntosh and his group vociferously opposed Mr. Trump in 2016, and while they have never formally backed Mr. Trump, Mr. McIntosh forged an alliance with him when he was president and remade the group into an ally of his.",
    "My service has now afforded me the ability to make a difference,? she said in an interview, boasting of her seat on the powerful Appropriations Committee and her chairmanship of the subcommittee that doles out energy and water funding.",
    "Sitting in a locker room in this ad, which ends on a shot of a football helmet, Mr. Gibbons says that he believes in playing by the rules, but that today, from our elections to immigration, cheaters win?  and he promises to stop them.",
    "Kenny Zoeller, the campaign manager for Mr. Pillen, called the ad false and unhinged.? He added, There are circumstances that should transcend politics.? Mr. Zoeller also said the ad was re-victimizing? the people who came forward.",
    "Some in Mr. Trump's circle have bristled for nearly a year at Mr. McIntosh's easy access to the former president, whom Mr. McIntosh persuaded to back an ultimately losing candidate in a Texas special election for Congress in 2021.",
    "Now we're at the endgame.?\nThe state legislature lopped off the tail of Ms. Kaptur's oddly drawn district along Lake Erie  nicknamed the Snake on the Lake  then extended it west through rural Ohio to the Indiana border.",
    "The national Democratic Party has saddled her with an agenda of phasing out internal combustion engines and the fossil fuels that power them that sits poorly in the region that put the first Jeeps into mass production.",
    "Donald Trump Jr., Mr. Trump's eldest son and one of Mr. Vance's most vocal supporters, began attacking Mr. Mandel by name after the Club for Growth first aired an ad featuring Mr. Vance criticizing Mr. Trump last week.",
    "The spot, which also tweaks Mr. Trump over his 2018 endorsement of Senator Mitt Romney of Utah, began running on Wednesday, several days into a fight between Mr. Trump and the club's president, David McIntosh.",
    "That, Professor Broxmeyer said, signaled that Republicans are coming for the last Democrat.?\nIt was not that long ago, 2012, that Barack Obama won Ohio's union families, 61 percent to Mitt Romney's 37 percent.",
    "A person familiar with the discussions, who was not authorized to speak publicly, recalled Mr. McIntosh openly saying he believed he had a chance to be Mr. Trump's chief of staff if he became president again.",
    "In a statement to The Times, Mr. Vance attacked Mr. Mandel and his allies? as declaring war on President Trump and the entire MAGA movement,? and noted Mr. Mandel's shifting positions on a variety of issues.",
    "But that, he says, means that both parties?  including his own  need to stop wasting time on stupid fights.?\nWe can't afford to be Democrats and Republicans,? Mr. Ryan says, more emphatically than hopefully.",
    "It was not clear why Mr. Trump considered Mr. McIntosh to be by his side in that fight, since he has previously been frustrated that the Club has not endorsed Harriet Hageman, who is challenging Ms. Cheney.",
    "After a white woman acidly declares that critical race theory is crap,? Mr. Mandel appears on the Edmund Pettus Bridge in Selma, Ala., where civil rights marchers were beaten by state police in the 1960s.",
    "He was able to prick the despair that results from economic opportunity being jerked out from under you like a rug, and he was able to do it even though he didn't do anything for them,? Ms. Kaptur fumed.",
    "The ad tries to undermine the credibility of Mr. Herbster's accuser, the Republican state senator Julie Slama, by pointing out her ties to his rivals and mentioning he had been invited to her wedding.",
    "Mr. Herbster, who owns a large agricultural company, uses the ad to say that the accusations against him were orchestrated by Jim Pillen, one of his leading rivals in the May 10 Republican primary.",
    "But what national Democrats see as a planetary imperative, union leaders like Mr. Enright see as an immediate mortal threat, and they fully expect the politicians they back to fight for their jobs.",
    "Erika White, president of the Communications Workers of America local in northwest Ohio, said Mr. Trump had given voice to the anger of white workers, even if he did not deliver on his promises.",
    "The Club for Growth, the conservative anti-tax group, paid to air a new advertisement attacking former President Donald J. Trump's preferred candidate in the Republican Senate primary in Ohio.",
    "And Donald J. Trump rattled the underpinnings of Democratic appeal to labor, with his trade protectionism, thundering denunciations of China and professed belief in job creation at all cost.",
    "But her struggle to reach that historical mark attests to what Republicans and some union leaders here have been saying since the rise of Trumpism: Labor politics have changed forever.",
    "He invokes Martin Luther King Jr.'s name  as if to suggest he, too, would have opposed critical race theory  before pointing to his record of serving alongside Black Marines in Iraq.",
    "Mike Gibbons, a wealthy businessman and onetime pro football player, has alone poured $13 million into commercials, according to AdImpact, a firm that tracks campaign advertising.",
    "A lot of those union workers, they're not happy with their unions right now,? said Craig Riedel, a state representative running in the Republican primary to challenge Ms. Kaptur.",
    "It also takes note of Mr. Trump's surprise endorsement in 2018 of Mr. Romney, an antagonist who had auditioned for the secretary of state job and then ran for Senate from Utah.",
    "Ms. Gavarone has used the Line Five issue to make allies in the building trades unions, and used those allies to separate herself from Mr. Riedel, who is openly anti-union.",
    "The organizational capacity of the Democratic Party in northwest Ohio is the organizational capacity of organized labor, and organized labor is much diminished,? he said.",
    "The new ad features people intended to be average voters listening to Mr. Vance's past criticism of Mr. Trump and questioning whether Mr. Trump was aware of it.",
    "Members are tired of hearing it.?\nMs. Kaptur's longevity was supposed to underscore a truism that union families knew their friends and would not abandon them.",
    "As chairwoman of the Energy and Water Appropriations subcommittee, she said she had done what she could to protect and move to strengthen the pipeline.",
    "is a fraud.?\nMr. McIntosh is coming under fire from allies of Mr. Trump and Mr. Vance for his support of Mr. Mandel, and for the advertising strategy.",
    "In one ad, he repeats the word China? again and again, suggesting the United States and its workers were in a dog-eat-dog showdown with that country.",
    "Listen, Marcy is a friend,? said Shaun Enright, executive secretary and business manager of the 17,000-strong Northwest Ohio Building Trades Council.",
    "But she also leads the Great Lakes Caucus in the House, and protecting the largest body of freshwater on Earth, she said, also has to be a priority.",
    "There are fewer union voters, and the ones who remain are less Democratic, said Jeff Broxmeyer, a political scientist at the University of Toledo.",
    "In an interview with The Times on Thursday morning, Mr. Trump said of Mr. McIntosh, We had a very contentious relationship when I first started.",
    "The other leading candidate in the primary, State Senator Brett Lindstrom, has tried to position himself as above the fray of the accusations.",
    "Ms. White, who is Black, said she spends much of her time listening to the frustrations of the white men who make up about half of her union.",
    "Mr. Herbster also filed a defamation lawsuit against Ms. Slama, who has spoken publicly about the allegations and is the only named accuser.",
    "The Club for Growth is backing Josh Mandel, a former state treasurer, while Mr. Trump is supporting the Hillbilly Elegy? author J.D.",
    "I didn't do two tours in Anbar Province, fighting alongside Marines of every color, to come home and be called a racist,? he says.",
    "Democratic senators like Sherrod Brown of Ohio, Bob Casey of Pennsylvania and Joe Manchin III of West Virginia have banked on it.",
    "Representative Tim Ryan is testing it with his run for an Ohio Senate seat that so far has revolved around blue-collar appeals.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle's defining topics.",
    "But for Ms. Kaptur, 75, a famously pro-union, old-school appropriator, the political ground has washed away beneath her feet.",
    "Ms. Slama countersued, and four of her colleagues in the Legislature created a website called HerbsterVictimWitnessFund.com.",
    "But I have to go to membership, whatever the election cycle is, and say, This is the most important election of your life.",
    "Mr. Pillen made a fortune in the farming business and has the support of the outgoing Republican governor, Pete Ricketts.",
    "In the new television ad, Mr. Herbster also likened himself to other conservatives who have faced similar allegations.",
    "A handful of heavily funded candidates and allied outside groups are slugging it out on the Republican side, with J.D.",
    "In the interview, Mr. McIntosh said he had heard nothing but positive feedback from board members and staffers.",
    "Mr. Romney was the only Senate Republican who voted to convict Mr. Trump when he was first impeached in 2019.",
    "Since 1990, the percentage of Ohio workers represented by unions has slipped from 23.2 percent to 13 percent.",
    "A spokeswoman for Mr. Ricketts has said he learned of Ms. Slama's accusation when the article was published.",
    "Ms. Slama has said she spoke publicly about the accusation only after she was contacted by a news reporter.",
    "A new Republican-drawn district has robbed her of reliable Democratic votes on the outskirts of Cleveland.",
    "That means keeping Line Five open and the shift to electric vehicles in the lowest possible gear.",
    "Vance, who was once a sharp critic of the former president but has since become a supporter.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "In this ad, meanwhile, Mr. Ryan touches on issues vexing voters, starting with high prices.",
    "And then it became very good.?\nNow, we had one disagreement, a strong disagreement on J.D.",
    "Vance.?\nHe said he hoped to work with Mr. Trump again after the Ohio primary on Tuesday.",
    "I personally cannot stand the guy, but you think of his persona,? she said of Mr. Trump.",
    "In an interview, Mr. McIntosh maintained that his goal was not to antagonize Mr. Trump.",
    "The Ohio primary is a critical test of Mr. Trump's durability in the Republican Party.",
    "These are people who've worked hard all their lives, and then an earthquake happened.",
    "But Mr. Trump took 54 percent of those same voters in 2016, then 55 percent in 2020.",
    "We've got to get serious about lowering costs and actually helping people,? he says.",
    "I'm a Never Trump guy,? the ad features Mr. Vance saying in an old video recording.",
    "Ms. Kaptur responded defensively, but she also showed the crosscurrents she faces.",
    "Neither Mr. Herbster nor Ms. Slama immediately responded to requests for comment.",
    "It unites unions and business, without alienating any other constituency.",
    "Who here is tired of getting hammered by inflation?? he asks a crowd.",
    "His allies have targeted Mr. McIntosh in connection with the spots.",
    "Lies stacked up to ruin them,? a female announcer says in the ad.",
    "An issue like Line Five is easy for the Republicans in the race.",
    "That's not their fault, and largely Washington never saw it.?",
    "Mr. Trump has been content to let others attack Mr. McIntosh.",
    "The elites were right about Donald Trump, right?",
    "You have to vote.' And I'm tired of doing it.",
    "Mr. Ricketts previously employed Ms. Slama.",
    "The palpable influence of Donald J. Trump.",
    "And a whole lot of macho talk and imagery.",
    "Here are the four incumbents most at risk.",
    "Mr. McIntosh denied that in the interview.",
    "Defensiveness over accusations of racism.",
    "At another point, he said, We think J.D.",
    "We aren't negative on Trump,? he said.",
    "And Jane Timken, a former state G.O.P.",
    "The Democratic administration of Gov.",
    "See the full primary calendar.",
    "We're going negative on J.D.",
    "It's also more audacious.",
    "Vance,? Mr. Trump said.",
    "Then Brett Kavanaugh.",
    "Clarence Thomas."
  ]
}