{
  "id": 131,
  "mediaId": 151,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "DeSantis plays Vegas",
  "image": "https://static.politico.com/d3/05/ba68c9f5400bbef72003544b41ba/fineoutlogo.jpg",
  "link": "https://www.politico.com/newsletters/florida-playbook/2022/04/28/desantis-plays-vegas-00028484",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2082,
    2082,
    2087,
    1837,
    1837,
    661,
    661,
    718,
    718,
    353,
    353,
    2818,
    2818,
    2751,
    2751,
    2661,
    2661
  ],
  "sentences": [
    "The administrator of the government, called the Reedy Creek Improvement District, said the expansion of a solar power project could be delayed because of financing challenges linked to the legislation, and the union for the district's firefighters expressed concerns about what the dissolution might mean for members' lifetime benefits.?\n Ron DeSantis says ending Disney's self-governing status will be a process.' Here's what might happen next,? by CNN's Eric Levenson and Steve Contorno\n Political rift dogs Orlando airport board chair at vulnerable time at OIA,? by Orlando Sentinel's Kevin Spear\n  Report: Florida starting teacher pay is increasing but average pay stagnates,? by Florida Phoenix's Danielle J.",
    "He called Florida the tip of the spear'  a hint at possible future fights  and said Laxalt will represent my voice in the United States Senate.' This is our opportunity to rattle the foundations of this decaying administration in Washington,' DeSantis said.?\nStar treatment  Ninety minutes before the event, more than 100 people were waiting outside Stoney's Rockin' Country near the Las Vegas Strip to hear from the Republican governor who took on Disney, helped enact a ban on certain school instruction about sexual orientation and gender identity, and opened Florida to tourists when many Vegas casinos struggled through Covid-19 restrictions.",
    "DeSantis is the future president of the United States, so I had to see him,' said Jamie Fulmer, a practice manager for a local orthopedic surgeon who had vacationed in the Jacksonville, Florida, area amid the pandemic just to be in his state.'?\nTRENDING RED  National Democrats hesitant about Florida, hindering voter outreach efforts,? by Miami Herald's Alex Roarty and Bianca Padr Ocasio: Liberal grassroots groups in Florida are reducing staff and scaling back voter-outreach efforts because of a growing reluctance from out-of-state donors to spend money on the state, say top progressive strategists.",
    "Later on, he called Biden the worst president of my lifetime.?\nGreatest hits  DeSantis touched on many of the same items he has riffed on during many of his recent official events  education, his \"anti-riot\" bill, election laws  but he amped his volume level when addressing his crowd and laced his remarks with a little more sting with comments such as the lying legacy media.? He contended that he has not taken a single poll? while he has been governor and instead said I know what I believe.? (For what it's worth, those in his orbit have repeatedly said he does not look at polls.",
    "SpaceX launches NASA astronauts from Florida for six-month ISS mission,? by Florida Today's Emre Kelley and Rick Neale\nODDS, ENDS AND FLORIDA MEN\nBIRTHDAYS: Ben Nelson, meteorologist with National Weather Service and former state meteorologist\nFollow us on Twitter\nGary Fineout @fineout\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "In the latest confusing turn since jury selection began three weeks ago, Circuit Judge Elizabeth Scherer overturned her Monday decision to start jury selection anew because of a possible mistake she made.?\nPENINSULA AND BEYOND\nI REALIZED IT WAS ACTUALLY HAPPENING'  After decades in prison for murder, Miami man hears words of freedom: Actually innocent,'? by Miami Herald's David Ovalle: After more than three decades in prison, Thomas Raynard James sat in a packed Miami courtroom, shackled and wearing a red inmate jumpsuit, on paper still convicted of murder.",
    " Voting drop boxes are now called secure ballot intake stations:' New language will cost taxpayers,? by Palm Beach Post's Mike Diamond\n Ron DeSantis's fight with Disney helped him break fundraising records,? by Tampa Bay Times' Emily L. Mahoney\n Crist says he always' supported abortion access, but his record shows inconsistency,? by PolitiFact's Yacob Reyes\n Orange Mayor Jerry Demings has 3rd challenger for his job  and this one's a Democrat,? by Orlando Sentinel's Stephen Hudak\n... DATELINE TALLAHASSEE ...",
    "Florida should not contribute to the financial crunch that our citizens are experiencing.?\nCASHED OUT  Seminole Tribe halts payments to Florida amid gaming deal legal challenge,? by POLITICO's Matt Dixon: The Seminole Tribe of Florida has stopped making hundreds of millions of dollars in quarterly payments to Florida as part of its revenue sharing agreement with the state, saying they're halting payment over the unresolved 2021 gaming agreement.",
    "And some think, due to Florida's size and recent disappointments, we should shift resources and focus elsewhere.'?\nDEMINGS DIRECTS DOLLARS  The Senate campaign of Rep. Val Demings is putting in $3 million to help pay for the One Future Florida bilingual coordinated campaign that has been launched between the Florida Democratic Party and the Democratic Senatorial Campaign Committee to mobilize communities ahead of this year's elections.",
    "Democrats will have the infrastructure we need to deliver our message in every community from the Panhandle to the Keys as we knock on doors, make calls, and engage voters wherever they're found to defeat Marco Rubio and win throughout this state.? The Republican National Committee has already launched its mobilization efforts in Florida and has been regularly touting the number of phone calls and house visits it has been making.",
    "The state's two senators and 23 of its 27 members of the U.S. House signed onto a letter to the U.S. Secretary of the Air Force Frank Kendall this week asking for STARCOM, the Space Training and Readiness Command, which is one of three Space Force field command units, to be based at Patrick Space Force Base and Cape Canaveral Space Force Station in Brevard County.?\nWHAT'S IN YOUR WALLET?",
    "The previous day, Gaetz accused the leaders of being weak men' for speaking about him and former President Donald Trump indirectly during sniveling phone calls' with Republican Representative Liz Cheney of Wyoming.?\nINFINITY AND BEYOND  Rubio, Scott lead bipartisan push to bring Space Force training HQ to Space Coast,? by Orlando Sentinel's Richard Tribou: U.S.",
    "THE GUNSHINE STATE\nNEVER MIND  Florida school shooting judge reverses; confusion follows,? by Associated Press' Terry Spencer: The judge overseeing the penalty trial of Florida school shooter Nikolas Cruz reversed herself Wednesday and said she is not dismissing more than 200 potential jurors who survived a first round of screening earlier this month.",
    " Janet Cruz says racism plays a part in decision to not expand Medicaid,? by Florida Politics' Christine Jordan Sexton\nTO COURT Groups ask court to block new Florida congressional map,? by POLITICO's Gary Fineout: Groups challenging Florida's new congressional map are asking a judge to block the state from using the new districts.",
    "Get in touch: gfineout@politico.com\nCAMPAIGN MODE\nVIVA LAS VEGAS  DeSantis amplifies 2024 chatter with trip to Nevada to campaign for Senate candidate Laxalt,? by CNN's Steve Contorno: Coming off a showdown with Disney and a month of headlines for waging fights over hot-button social issues, Florida Gov.",
    " Scalise and Gaetz meet privately after tension over leaked audio,? by POLITICO's Olivia Beavers: Reps. Steve Scalise and Matt Gaetz met Wednesday to discuss leaked audio of the House minority whip suggesting the Florida firebrand may have acted illegally after the Capitol riot.",
    "AND THEN  McCarthy, Scalise not fitting of leadership,' Gaetz tells Tucker Carlson,? by Newsweek's Aila Slisco: Republican Representative Matt Gaetz of Florida has continued his attack on GOP House leadership in an interview with Fox News host Tucker Carlson.",
    "You got a friend in me  DeSantis has been friends with former Nevada Attorney General Adam Laxalt since they first met in the U.S. Navy nearly 20 years ago, so his decision to back Laxalt's run for U.S. Senate and campaign on his behalf is not a surprise.",
    "DeSantis is scheduled to be in Orlando this evening for a live town hall event with Fox News' Laura Ingraham entitled Florida and the American Comeback.?\nHave a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for Playbook?",
    "The filing states that the injunction should be granted because voters in North Florida  where the district now held by Rep. Al Lawson (D-Fla.) is being dismantled  will suffer irreparable injury? if the map is used during the 2022 elections.",
    "Mousetrap  There was also praise for Elon Musk's takeover of Twitter and yes, there was a section where DeSantis continued to savage Disney over its opposition to the Parental Rights in Education? law  coined \"don't' say gay\" by its critics.",
    "'?\nAFTERMATH  Disney government in dark about effect of law dissolving it,? by The Associated Press' Mike Schneider and Anthony Izaguirre: At the first meeting of Walt Disney World's private government since Florida Gov.",
    "If they're going to run up debt, they need to have a plan to pay it back.' Scott continued to press against forgiveness proposals during an interview Wednesday evening on Newsmax during an interview with Sean Spicer.",
    " But the governor's address  which earned local and national coverage  before a raucous crowd gathered in a Las Vegas bar had all the sounds of a campaign stump speech that could work well on the presidential trail.",
    "If the financial pullback continues, they warn, it threatens not only the party's chances in this year's slate of midterm races but also Florida's place as a top-tier battleground in the 2024 presidential election.",
    "Gaetz said that House Minority Leader Kevin McCarthy of California and Minority Whip Steve Scalise of Louisiana were 'not fitting of leadership' during a Wednesday night appearance on Tucker Carlson Tonight.",
    "Ron DeSantis signed into law a measure to dissolve it next year, officials said Wednesday they were still confused about what the new legislation meant, even as some ripple effects were starting to be felt.",
    "The tape, reported by The New York Times, features Scalise calling Gaetz's actions after the Jan. 6 insurrection potentially illegal?  a reference to the latter's comments hitting Rep. Liz Cheney (R-Wyo.)",
    "Hey Joe  While consistently touting his record in Florida, DeSantis repeatedly jabbed President Joe Biden and his floundering? administration over inflation, gas prices, Covid-19 and immigration.",
    " Rick Scott opposes student loan forgiveness, says it's not fair' to him,? by Florida Politics' A.G. Gancarski: [Sen. Rick] Scott, the richest member of the U.S. Senate, was adamant.",
    "In all, it contained a lot of the zingers that DeSantis will repeat in reelection campaign appearances and Fox News spots in the weeks and months to come  and probably beyond.",
    "If you recall, he was supposed to be one of the headliners at a well-known annual Nevada GOP event last August but scrapped his visit because of a potential tropical storm.",
    "The private sitdown followed Gaetz's scathing rebuke of the top two House GOP leaders over leaked audio that showed them criticizing conservatives in their conference.",
    "With regard to saying for this small group of people that they get their debt forgiven when other people did what I did,' Scott said, talking again about the GI Bill.\"",
    "Demings has been successful in raising money for her campaign against Sen. Marco Rubio, and is now using some of the cash to fund on-the-ground mobilization efforts.",
    "So is a bipartisan group that includes U.S. Reps. Bill Posey, Charlie Crist, Stephanie Murphy, Darren Soto, Matt Gaetz and Debbie Wasserman Schultz, among others.",
    "DeSantis said the bill, which the solar industry bitterly opposed, also allowed utilities to impose additional charges to recover lost revenue from solar owners.",
    "Ron DeSantis  who keeps brushing aside questions about 2024  touched down Wednesday in Nevada, one of the early battleground states of the presidential campaign.",
    "Ron DeSantis on Wednesday vetoed a major bill backed by the Florida Power & Light Co. that would have reduced payments to future owners of rooftop solar.",
    "Lawyers representing Black Voters Matter, the League of Women Voters of Florida and others filed a request for preliminary injunction late Tuesday.",
    "Brown\n  Ex-Jacksonville City Council member Reggie Brown's house taken for fraud restitution,? by Florida Times-Union's Steve Patterson\n  Liftoff!",
    "DeSantis recounted for a packed Las Vegas bar his battles against the Biden administration and Disney and rattled off his conservative victories.",
    "But inside, he said later, it all felt unreal as the judge undid his conviction, and the State Attorney's Office officially dropped the case.",
    "The amount that may be recovered from this provision is speculative and would be borne by all customers,? DeSantis wrote in his veto letter.",
    "Ron DeSantis introduced himself to Republican primary voters in Nevada during a Wednesday campaign stop for US Senate candidate Adam Laxalt.",
    "We're going on offense on Biden,? DeSantis said while discussing his efforts to oppose the administration's policies regarding the border.",
    "That 2021 agreement, known as a compact, was approved by the Florida Legislature last year but was invalidated by a federal judge.",
    "LIGHTS OUT  DeSantis vetoes rooftop solar bill, saying it could add to inflation woes,? by POLITICO's Bruce Ritchie: Gov.",
    "There is a debate happening,' said Greg Speed, president of the national progressive organizing group America Votes.",
    "Marco Rubio and Rick Scott are on board to bring the Space Force's training headquarters to the Space Coast.",
    "He said he had been warned to not go after the company that was joined at the hip? with the state.",
    "It's currently under appeal before the U.S. Court of Appeals for the District of Columbia Circuit.",
    "'We have determined that Thomas Raynard James is actually innocent,' a prosecutor told the judge.",
    "DeSantis plays Vegas\nBy GARY FINEOUT\n04/28/2022 06:58 AM EDT\nHello and welcome to Thursday.",
    "We know when voters hear our message, we win,? said Demings campaign manager Zack Carroll.",
    "Just past 11:30 a.m., James heard the words he himself had been repeating for years.",
    "'If there weren't so many people in there, I'd probably have fainted,' James said.",
    "Florida's primary is Aug. 23, and candidates must qualify for the ballot in June.",
    "He cited a section where sources said Duke Energy Florida got put into the bill.",
    "As part of the compact, the Tribe shares revenue from gaming with the state.",
    "And Scalise isn't quite offering a full-throated apology.",
    "It was the DeSantis brand in all its glory.",
    "Those who work with him, however, do.)",
    "I realized it was actually happening.",
    "'It actually hit me emotionally.",
    "and other fellow Republicans.",
    "James betrayed no emotions.",
    "Spotlight  Florida Gov.",
    "SORRY, NOT SORRY?",
    "DATELINE D.C.",
    " WHERE'S RON?",
    "Warming up?",
    " Gov.",
    "Sens."
  ]
}