{
  "id": 132,
  "mediaId": 239,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Profiles in liberal courage only",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/28/B3_Parisi1_c0-179-1800-1228_s885x516.jpg?e5e4239f5e1fef58af06b4fde08ed721c4d637f6",
  "link": "https://www.washingtontimes.com/news/2022/apr/28/profiles-in-liberal-courage-only/",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Parisi",
  "authorUrl": "",
  "termIds": [
    712,
    1147,
    2411,
    2505,
    3094,
    146,
    428,
    571,
    2550,
    2969
  ],
  "sentences": [
    "The foundation's website explains what it claims it's looking to reward and showcase with its yearly awards: In times of partisan divide and political gridlock, uplifting stories of political courage from across the country is how we can inspire leaders to work together for the common good.?\nThis is nothing if not a time of partisan divide and political gridlock.?\nSo, on Feb. 15, the deadline for submitting nominations for this year's awards, I wrote on these pages that there were two nominees who, by any objective measure, should be the hands-down winners of the 2022 honors.?\nI nominated Democratic Sens.",
    "By joining all 50 Republican senators in the evenly divided Senate to preserve the filibuster, Mr. Manchin and Ms. Sinema effectively prevented Democrats from being able to change Senate rules and ram through several bills that would have been great for Democratic partisans, but horrifically bad for the country, including shamelessly partisan election reforms? whose true purpose was to all but cement permanent Democratic control of Congress and the White House, along with President Biden's $5 trillion Build Back Better boondoggle.",
    "Previous winners include House Speaker Nancy Pelosi (2019), former President Barack Obama (2017), and then-Sen. Ted Kennedy (2009), three deeply partisan liberal Democrats, none of whom will ever be accused of work[ing] together for the common good? in times of partisan divide and political gridlock.?\nPast Republican recipients include Sen. Mitt Romney of Utah (2021) for voting to impeach Mr. Trump, and former President George H.W.",
    "More plausibly, Arizona House Speaker Russell Bowers, a pro-Trump Republican, was chosen for resisting GOP pressure to go along with an illegal scheme to replace Arizona's legal slate of electors with a false slate of electors who would elect Trump.?\nPerhaps as a fig leaf to divert attention from the deeply pro-liberal slant of the awards, the foundation chose as its top recipient Ukrainian President Volodymyr Zelenskyy.",
    "Obviously, the Profiles in Courage Awards are the JFK Library Foundation's prizes to hand out as it sees fit, but the foundation's board does no favors for the award's credibility by invariably choosing actors and actions favoring liberal outcomes  particularly those in which the courage? to cross the political divide always occurs in one direction.",
    "Also to be feted at the awards ceremony on May 22 in Boston is Michigan's Democratic secretary of state, Jocelyn Benson, cited for standing up to protestors  demanding that Michigan's [2020] presidential election result be reversed.? (As if a Democrat was ever going to do that.)",
    "The ability to debate and do the hard work to find consensus between [the] two parties [are] more important for our country now than ever before with the Senate evenly divided,? Mr. Manchin said in a Jan. 22 statement reaffirming his support for preserving the Senate filibuster.",
    "Instead, the award winners included Rep. Liz Cheney, Wyoming Republican, hailed for her unrelenting criticism of Mr. Trump, for voting to impeach him, and for providing GOP cover to the Democrat-packed Jan. 6 committee, which gives kangaroo courts a bad name.",
    "In the face of ad hominem attacks from within their party, they refused to go along with the other 46 Senate Democrats (and the two in-name-only independents? who reflexively vote the party line) in their hyper-partisan bid to abolish the Senate filibuster.",
    "OPINION:\nThere's apparently no political courage worthy of commendation ever exhibited by maverick Democrats  at least not if the John F. Kennedy Library Foundation's annual Profiles in Courage Awards are the arbiters thereof.",
    "While Mr. Zelenskyy is indeed a profile in courage for standing up to the Russian invasion of his country, it's at least worth noting that the invasion didn't occur until Feb. 24, nine days after the deadline for nominations.",
    "(That would be the same filibuster, incidentally, that Senate Democrats weaponized against GOP legislation and Republican President Donald Trump's nominees 327 times in 2020 alone.)",
    "The JFK Library Foundation's award may well serve as Ms. Cheney's consolation prize on Aug. 16, when polls are showing she's likely to be trounced in the Wyoming GOP primary.",
    "Joe Manchin of West Virginia and Kyrsten Sinema of Arizona, who exhibited steadfast political courage in standing up to their party's leaders back in January.",
    "Curiously, the foundation didn't also bestow an award upon Ms. Cheney's fellow GOP enabler on the stacked-deck committee, Rep. Adam Kinzinger of Illinois.",
    "That same day, the Democratic Party of Arizona voted to censure Ms. Sinema, who had expressed similar sentiments nine days earlier on the Senate floor.",
    "For all his well-publicized crocodile tears, Mr. Kinzinger now actually has something to cry about.",
    "Bush (2014) for reading his own lips and breaking his pledge not to raise taxes.",
    "The clear political slant of this year's awards isn't an anomaly, however.",
    "Recipients of the 2022 Profiles in Courage Awards were announced April 21.",
    "Regrettably, Mr. Manchin and Ms. Sinema were not among them.",
    " Peter Parisi is a former editor for The Washington Times."
  ]
}