{
  "id": 133,
  "mediaId": 238,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Post Politics Now McCarthy faces House Republicans in wake of audio tape leak",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/27/mccarthy-republicans-biden-albright/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1916,
    1916,
    2085,
    2085,
    1609,
    816,
    816,
    1464,
    1464,
    1609,
    562,
    562,
    525,
    525,
    255,
    255,
    2590,
    2590
  ],
  "sentences": [
    "Graham said Childs would be a role model for women out there to show people what's possible? and said the public should be encouraged that lawmakers from different political parties can rally around an accomplished woman who has worn the robe well.?\nReturn to menu\nTwo years into the pandemic, lawmakers and government watchdogs are just beginning to uncover how trillions of dollars in aid approved by Congress was spent  or misspent  as federal agencies raced unevenly to plug massive holes in the U.S. economy.",
    "Return to menu\nPresident Biden on Wednesday hailed the return to the United States from Russia of detained Marine Corps veteran Trevor Reed, saying the negotiations to secure his freedom required difficult decisions.?\nMoscow said Reed's return was part of prisoner swap in which the Biden administration released Konstantin Yaroshenko, who was jailed on U.S. drug charges  a deal that took place despite great tension between the two countries stemming from Russia's invasion of Ukraine.",
    "His safe return is a testament to the priority my Administration places on bringing home Americans held hostage and wrongfully detained abroad.?\nThe Post's Timothy Bella had background on Reed's situation in a recent article about his family's efforts to bring him home:\nReed, who traveled from North Texas to Moscow to visit his girlfriend in the summer of 2019, was jailed after a night of drinking that ended with him allegedly attacking two police officers.",
    "Citing people familiar with the matter, they write:\nBiden engaged the students on this set of topics, expressed pride about his diverse cabinet and federal judicial nominees and shared his belief that the U.S. is at a critical point in history in the battle of democracy versus autocracy, according to a person familiar with the meeting who, like others, spoke on the condition of anonymity to describe the private event.",
    "Other high-profile figures in attendance will include Secretary of State Antony Blinken, Defense Secretary Lloyd Austin, Obama and former first lady Michelle Obama, former vice president Al Gore, House Speaker Nancy Pelosi (D-Calif.) and Senate Minority Leader Mitch McConnell (R-Ky.), along with a large, bipartisan group of members of Congress.]",
    "Dave writes:\nThe PAC has poured roughly $7 million into the race, another new PAC was founded to help elect Flynn to Congress, and the House Democrats' own super PAC, to the horror of the other Democrats running in this new seat, have endorsed Flynn, a 35-year lawyer and policy analyst with no political experience.",
    "The Post's Nick Miroff reports that on Tuesday, Biden administration officials described in greater detail their plans for coping with a surge in illegal crossings when the pandemic-era emergency restrictions expire May 23, pledging to boost criminal prosecutions and make aggressive use of fast-track deportations.",
    "Ambassador to Russia John Sullivan, who described the evidence used to convict Reed as ridiculous.?\nReturn to menu\nRussian interference in the 2016 presidential contest prompted election officials in many states to embrace paper records to ensure votes weren't manipulated by hackers or altered by digital glitches.",
    "The Washington Post's Yeganeh Torbati and Jeff Stein offer the latest example of questionable decisions: senior Trump administration officials overruling Pentagon staffers to provide a politically connected trucking firm with hundreds of millions of dollars in pandemic aid after a concerted lobbying effort.",
    "Others who will pay tribute to Albright include Deputy Secretary of State Wendy R. Sherman, who was friends with Albright for more than 35 years; former secretary of state Condoleezza Rice, who was a student of Albright's father, Josef Korbel, at the University of Denver; and Albright's three daughters.",
    "Return to menu\nPolling hasn't been particularly kind to Biden, but earlier this week, in an event that wasn't on his official schedule, he welcomed pollsters from the Harvard Kennedy School Institute of Politics and their students to discuss a range of findings from their Spring 2022 Harvard Youth Poll.",
    "Today, House Minority Leader Kevin McCarthy (Calif.) faced fellow House Republicans for the first time since recordings were released that show him criticizing former president Donald Trump and members of his conference in the days following the Jan. 6, 2021, attack on the Capitol by a pro-Trump mob.",
    "Joseph writes:\nThe moves were spurred in large part by former president Donald Trump's false claims about fraud and manipulation in the 2020 election and his baseless crusade against voting machine companies  rather than by legitimate concerns spurred by Russian interference in the 2016 contest.",
    "Return to menu\nThe latest nugget to emerge from a forthcoming book by a pair of New York Times reporters: House Minority Leader Kevin McCarthy (R-Calif.) feared that several far-right members of Congress could incite violence against other lawmakers in the wake of the Jan. 6, 2021, insurrection.",
    "Torbati and Stein write:\nIn 2020, career employees at the Defense Department determined that Kansas-based Yellow Corp. was not critical to maintaining national security? and therefore did not qualify for a loan program created by Congress earlier in the pandemic, the investigation found.",
    "Foreign leaders in attendance will include Salome Zourabichvili, president of Georgia; Vjosa Osmani-Sadriu, president of Kosovo; Bisera Turkovic, foreign minister of Bosnia; Milo Vystr?il, president of the Czech Senate; and Jan Lipavsk, minister of foreign affairs of the Czech Republic.",
    "Trump has been heavily featured in Perdue's television ads, and the first words from the former senator's mouth in a debate with Kemp included rigged and stolen.?\nWith less than a month to go before the May 24 primary, Perdue's laserlike focus on election fraud seems to be falling flat.",
    ":\nReturn to menu\nMore than 1,400 people, including President Biden and former presidents Barack Obama and Bill Clinton, are expected to attend the funeral Wednesday for former secretary of state Madeleine Albright, who died last month at 84 after a long career in public service.",
    "House Majority Whip James E. Clyburn (D-S.C.) and Sen. Lindsey O. Graham (R-S.C.) had both publicly pressed Biden to choose Childs, a District Court judge from their home state, to replace retiring Supreme Court Justice Stephen G. Breyer.When Biden instead picked D.C.",
    "Return to menu\nDepartment of Homeland Security Secretary Alejandro Mayorkas will be on Capitol Hill starting Wednesday for what are expected to be contentious hearings on the Biden administration's immigration policies with the November midterm elections looming.",
    "Ann Marimow: A warmer, gentler Sen. Graham introduces Judge Childs  Biden's pick for the influential federal appeals court in Washington, J. Michelle Childs, got a bipartisan introduction this morning to the Senate Judiciary Committee considering her nomination.",
    "A news release on the list unveiled Wednesday included this: For example, if confirmed, Ana Reyes  who immigrated to the United States as a child  would be the first Hispanic woman to ever serve on the U.S. District Court for the District of Columbia.",
    "After denying other reporting in the book  only to be proved dishonest by the release of audiotapes  McCarthy has largely sought to dodge questions about the aftermath of Jan. 6, including his assertions that President Donald Trump should resign.",
    "The actions of Rep. Matt Gaetz (R-Fla.) and Rep. Mo Brooks (R-Ala.) in particular had crossed a line, McCarthy suggested, noting that Brooks used incendiary language during a Jan. 6 speech and that Gaetz had singled out Rep. Liz Cheney (R-Wyo.)",
    "The Post's Amy B Wang has details on who's speaking and otherwise appearing at the service at Washington National Cathedral, which starts at 11 a.m.\nBiden, Bill Clinton and former secretary of state Hillary Clinton will deliver eulogies.",
    "Writing in The Early 202, Jacqueline Alemany and Theodoric Meyer report that Monday's discussion focused on the political views of LGBTQ young people, the state of democracy and concerns over a mental health crisis, among other topics.",
    "Return to menu\nIn Oregon's newly drawn 6th Congressional District, Democrat Carrick Flynn, a political newcomer, has emerged as a spending juggernaut  and a diverse field of Democrats running against him cannot understand why.",
    "The Post's Felicia Sonmez, Paul Kane and Marianna Sotomayor report that it remains to be seen whether other House Republicans will echo the concerns of Biggs, a former leader of the conservative House Freedom Caucus.",
    "It may be the only security-enhancing effect of Trump's wild and baseless claims that his election loss was illegitimate  and election security advocates are celebrating it even as they're dubious about the impetus.",
    "The administration has been under fire from Republicans and some Democrats after the Centers for Disease Control and Prevention announced April 1 that the public health order known as Title 42 was no longer needed.",
    "Writing in The Trailer, The Post's David Weigel takes a look at the race in which Protect Our Future, a PAC funded by cryptocurrency billionaire Sam Bankman-Fried, has become heavily involved on Flynn's behalf.",
    "Nick writes:\nSeveral Democrats facing tough reelection races as well as close allies of Biden have raised concerns in recent weeks about the May 23 deadline, saying they don't think DHS officials are prepared.",
    "He was convicted in July 2020 and sentenced to prison by a Moscow court in a case that Reed told reporters was clearly political.? The sentence was denounced by U.S. lawmakers and diplomats, including U.S.",
    "Writing in The Cybersecurity 202, The Post's Joseph Marks notes that Texas, Mississippi, Louisiana, Tennessee and Indiana are all now belatedly making such moves  but for another reason altogether.",
    "They write:\nIn a report Tuesday night, the Times detailed McCarthy's comments to fellow Republican leaders about several members of the House GOP conference days after the Jan. 6 attack.",
    "Former president Bill Clinton and former secretary of state Hillary Clinton are also scheduled to speak at an event that has drawn a sizable portion of the Washington establishment.",
    "Brian Kemp (R) has centered on the discredited notion that the 2020 presidential election was stolen  in Georgia and elsewhere  from former president Donald Trump.",
    "Party insiders credit him with deftly maneuvering around the anger over 2020, neutralizing  for now, at least  what might have otherwise become a fatal liability.",
    "Trevor, a former U.S. Marine, is free from Russian detention,? Biden said in his statement, adding that he was delighted? to share the news with Reed's family.",
    "The revelations come from a report on an investigation by the select subcommittee on the coronavirus crisis, chaired by Rep. James E. Clyburn (D-S.C.).",
    "Each weekday, we'll guide you through the news with assists from some of the best political reporters in the business providing insights and analysis.",
    "Kemp, who has assiduously avoided criticizing Trump, has logged double-digit leads in recent public polls and enjoys a vast fundraising advantage.",
    "He was one of the most aggressive questioners of Jackson during her contentious confirmation hearings and voted against her confirmation.",
    "Return to menu\nOn Wednesday, he unveiled another batch, bringing the total number of nominees since the start of his presidency to 95.",
    "Reed pleaded not guilty to a charge of using violence to endanger the life or health of a government official performing his duties.",
    "Meanwhile, President Biden is among those eulogizing former secretary of state Madeleine Albright at Washington National Cathedral.",
    "Graham sounded a warmer, gentler tone Wednesday when he expressed support for Childs despite their different legal philosophies.",
    "Welcome to Post Politics Now, a live experience from The Washington Post that puts the day's political headlines into context.",
    "The negotiations that allowed us to bring Trevor home required difficult decisions that I do not take lightly,? Biden said.",
    "McCarthy sought to defend himself during the closed-door conference meeting, which could factor into his political future.",
    "They communicated that decision to the Treasury Department on June 24, 2020, according to emails quoted in the report.",
    "During his first year, Biden secured the confirmation of more judges than any president since John F. Kennedy.",
    "Authorities made more than 220,000 immigration arrests last month, the highest level in at least two decades.",
    "Today, we welcome home Trevor Reed and celebrate his return to the family that missed him dearly.",
    "The White House has also attempted to point out the historic firsts among Biden's selections.",
    "Circuit Judge Ketanji Brown Jackson for the high court, Graham did not hide his displeasure.",
    "At 3 p.m. weekdays, return to this space and we'll address what's on the mind of readers.",
    "She would also be the first openly LGBTQ person to ever serve on that court.",
    "Return to menu\nIn Georgia, David Perdue's primary challenge to Gov.",
    "And the carousel, which is built of the postpoliticsnow collection.",
    "U.S. agents and border facilities are already overtaxed.",
    "for criticism in television appearances.",
    "Got a question about politics?",
    "Submit it here."
  ]
}