{
  "id": 135,
  "mediaId": 136,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not",
  "image": "https://d.newsweek.com/en/full/2026189/fe-cover-gop-soul-banner.webp?w=737&f=5cef113b784e9689420c73405e405595",
  "link": "https://www.newsweek.com/2022/05/13/gop-races-dominated-maga-candidateswhether-trump-has-backed-them-not-1701160.html",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Friess",
  "authorUrl": "https://www.newsweek.com/authors/steve-friess",
  "termIds": [
    2283,
    2283,
    2087,
    2087,
    1147,
    1147,
    946,
    946,
    428,
    562,
    562,
    428,
    2738,
    2738,
    2834,
    2834
  ],
  "sentences": [
    "No one is suggesting Republicans won't pick up seats in Novemberprobably enough to tip control of the House, and very possibly in the Senate as wellgiven that the national mood is currently sour toward Democrats amid high inflation, that President Joe Biden's approval ratings are at an all-time low for his administration and that the party in power in the White House traditionally loses ground in Congress in the midterm elections.",
    "A copy of the letter obtained by The Associated Press referenced Vance's anti-Trump sentiments from 2016the author called Trump \"another opioid\" and his supporters racists, among other thingssaying, \"there are many qualified candidates in this race who have stood up for the America First agenda over the years and have carried the Trump mantle over the years, with the notable exception of J.D.",
    "\"Here's what we're gonna know after the primaries: All the narrative that keeps appearing about Trump's influence waning are the worst takes ever in mankind,\" says Timmer, speaking to Newsweek the morning moderate GOP Representative Fred Upton of Michigan, who voted to impeach Trump in 2021, had retired rather than face fellow Republican Representative Bill Huizenga in a redrawn district.",
    "In Ohio, the only non-MAGA Republican running for Senate, State Senator Matt Dolan, has built his campaign around that core message: He's positioned himself as the most appealing, least extreme candidate, and best poised for the general election in a state that, while mostly red in recent years, has also elected progressive Senator Sherrod Brown to Congress for the past three decades.",
    "\"John King is the insurance commissioner and Georgia's first statewide Hispanic officeholder, and his sole crime is having been appointed by Brian Kemp, so Trump endorsed a candidate for insurance commissioner who is basically saying that he will not allow the insurance industry to become 'woke,' whatever the hell that means,\" says Bill Crane, a longtime Georgia political observer.",
    "\"The party polarization and tribalism we have wasn't as strong in 2010, so there may be an opening now for the more extreme candidate to both win the nomination and then win a general election contest in states like Ohio where the vast majority of statewide races have been won by Republicans for the past decade or so,\" she says.",
    "He is married to Dina Powell, a Trump White House national security advisor, and has won endorsements from a raft of top MAGA figures including former White House communications director Hope Hicks, former senior policy advisor Stephen Miller and former White House Press Secretary Sarah Huckabee Sanders, as well as from Conway.",
    "\"With the Republican contests, the big takeaway is how Trumpy the entire field is and how many people are running explicitly on Stop the Steal platforms that have nothing to do with policy,\" says Sarah Longwell, a GOP strategist whose political consultancy ran the focus group described and dozens of others like it.",
    "Matt Bennett, executive vice president of the center-left Democratic think tank Third Way, agrees that the Republican obsession with Trump may end up doing the Democrats a favor, calling it a \"race to the bottom in the Republican primary that can really come back to hurt these guys in the general election.",
    "Businessman Mike Gibbons, who is in a statistical tie for the lead with Mandel in recent polling, hired strategists who work for Senators Rand Paul of Kentucky and Ted Cruz of Texastwo of the most pro-Trump Republicans in Congressand served as a Trump fundraising chair in the state for the 2020 election.",
    "The big question is whether victory for these candidates in the primaries, when the most committed party voters tend to go to the polls, will translate to success in the general election when a broader group will be casting ballots, including independents and on-the-fencers who can tip the scales.",
    "To them, Trumpism is about freedom of expression, adherence to the Constitution \"as it was before the transgenders and abortionists hijacked it\" as one supporter recently wrote on social media, and a return to the booming pre-pandemic economy that focused on aggressive action against China.",
    "That sentiment is playing out across the country, as primary season gets under way and voters head to the polls to pick slates for the first federal elections since Trump left the White Housesome 29 states will vote in May and June, with most of the rest to follow in August and September.",
    "Rather than demanding his chosen candidates be longtime loyalists in perfect lock step with his views, he's gravitated toward celebrity (a helpful quality for winning in November, as he knows from personal experience) and those he feels can burnish his reputation as the party's kingmaker.",
    "Indeed, the field is so crowded with Trump acolytes that businessman Bernie Moreno dropped out in February after a call with Trump in which the two men agreed, according to Moreno's statement, \"this race has too many Trump candidates and could cost the MAGA movement a conservative seat.\"",
    "In Vance, insiders say, Trump saw a compatible campaigner, someone who performs well on TV and has a pre-existing brand thanks to his best-selling memoir (Gibbons has a slight edge, 21-19 percent, over Mandel in the RealClearPolitics polling average, with Vance in third with 14 percent.)",
    "Months earlier, when he launched his campaign, he told the Philadelphia Inquirer, \"In the absence of the kind of movement that I'm trying to mobilize, Pennsylvanians are going to end up next November with an unacceptable choice between a MAGA extremist and a woke progressive extremist.\"",
    "\"People say MAGA is a cult but if I were in a cult, I'd be following Trump's endorsements and I wouldn't tell a magazine that I disagree,\" says Marcie Thomason, a Cleveland woman who attended an Easter appearance for Ohio Senate candidate Josh Mandel the day after Trump picked Vance.",
    "Maybe, but Trump can afford a poor win-loss record because the actual governing that almost all of these candidates would do would align with his prioritiesborder security, hard-core conservative policies on race and gender issues, anger with the media and \"wokeness.\"",
    "So far there is no clear frontrunner but almost all of the GOP candidates adhere to Trump's Make America Great Again playbook: They've adopted a contentious political style, rail against undocumented immigrants and question the legitimacy of Joe Biden's presidency.",
    "He's under attack from Trump for rejecting the idea that the 2020 election was stolen by Democrats and for the baseball team's decision last year to drop the Cleveland Indians name to something more sensitive to Native Americansa classic MAGA anti-woke position.",
    "And Jane Timken, a former state GOP chair, has hired two Trump insiders, Kellyanne Conway and Corey Lewandowski, as senior strategists to prove her bona fides and declared herself on Twitter as \"the only true Pro-Trump, America First Candidate in this race.\"",
    "Perdue has so embraced his role as Trump's revenge avatar that he's vowed to fire \"any and all\" Kemp appointeesa move that would include dumping his own cousin, former Governor Sonny Perdue, who was recently named chancellor of the state Board of Regents.",
    "His choice of Vance in Ohio may be Exhibit A; while many pundits thought he was waiting until late in the game to endorse so he could pick the most likely winner and look prescient, he instead went against both top-polling candidates, Mandel and Gibbons.",
    "His fury at Wyoming Representative Liz Cheney, who voted to impeach him and sits on the House Select Committee investigating the January 6 attack on the U.S. Capitol, led him to endorse her primary opponent, corporate lawyer Harriet Hageman.",
    "Whether or not the former president's endorsed candidates win, most of the GOP field has spent the primary season jockeying to appeal to Trump voters, the most committed of whom are the most likely to turn out to vote in an off-year primary.",
    "Trumpism has triumphed as such a core GOP identity that most of the party's candidates this election season, even those who are not officially endorsed by the former president, call themselves \"Trump Republicans\" and espouse his MAGA themes.",
    "In that contest, a bevy of Republicans are trying to out-MAGA each other, competing to replace retiring GOP Senator Rob Portman in a likely run against Congressman Tim Ryan, the expected Democratic nominee, in the general election this fall.",
    "MAGA MAGA Everywhere\nTo see how Trump candidates are dominating the GOP fieldwhether the former president has officially blessed them or notlook no further than the first marquee race of the season: Ohio's upcoming Senate primary on May 3.",
    "Senate Minority Leader Mitch McConnell recently told Axios that the nominations of extreme candidates that year in Missouri, Nevada, Indiana and Delaware turned off statewide voters and helped the Democrats retain control of the Senate.",
    "What diehard MAGAs hold against McKinley: his votes to establish the January 6th commission to investigate the attack on the U.S. Capitol and, in November, for President Joe Biden's $1.8 trillion Infrastructure Investment and Jobs Act.",
    "At a recent focus group of Republican voters from swing states, the only surprise came about 80 minutes into the two-hour Zoom session, when participants were questioned about the power of Donald J. Trump's primary endorsements.",
    "Still, many Republicans are privately less sanguine as they watch competitive primaries in Ohio, Pennsylvania, Missouri and North Carolina where the field is jockeying for the Trump voter by making increasingly extreme comments.",
    "In truth, McKinley and Mooney have nearly identical records: McKinley has voted with GOP House Leader Kevin McCarthy 93 percent of the time in the current Congress, according to ProPublica; Mooney did so 94 percent of the time.",
    "In contest after contest, state after stateincluding upcoming May primaries in Ohio, West Virginia, North Carolina, Pennsylvania and Georgiathe fields in key races are crowded with not just one or two but several MAGA options.",
    "\"Dolan is the only one who's basically said, 'I am in no way a Make America Great Again candidate,' and he's not doing well in the primary,\" says University of Dayton political science professor Nancy Martorano Miller.",
    "Hageman, who in 2016 was an outspoken anti-Trump Republican, now calls him \"the greatest president of my lifetime\" and was ahead by 20 points over Cheney in the one public poll taken so far in the race late last year.",
    "\"She certainly has a very difficult race on her hands,\" says Kyle Kondik, managing editor of Sabato's Crystal Ball, a nonpartisan political newsletter published by the University of Virginia Center for Politics.",
    "In the days before the announcement, as word leaked that the endorsement was imminent, more than three dozen Republican country and state leaders in Ohio wrote to Trump urging him to stay neutral in the race.",
    "\"They're all being Trumpy, just [to different] degrees,\" says former Michigan Republican Party executive director Jeff Timmer, a co-founder of the Lincoln Project, the anti-Trump political action committee.",
    "Despite his drubbing by MAGA types, McKinley is no Trump criticif anything, he has played up his connections to the former president on the campaign trail, even after Trump endorsed his primary opponent.",
    "Yet Dolan, whose family owns part of the Cleveland Guardians baseball team and who is spending more than $10 million of his own money on the race, sits in distant fourth place in the polling averages.",
    "The spotlight lately has been on Trump's endorsements in these contests, whether his anointed candidates will win or lose, and what that will say about his power as kingmaker in the Republican party.",
    "Trump, the Powerbroker\nA Trump insider familiar with the former president's thinking believes outraged MAGA pundits don't get what's going on: The \"right-wing chattering classes miss the point here.",
    "While most pundits think the House is an easy win for the GOP given the national mood and historic trend of the out-of-power party picking up seats during the midterms, the Senate remains unclear.",
    "This time around, McConnell said, \"The primary season's just beginning and I'm pretty optimistic we're going to have what I would consider a fully electable nominee in every one of those states.\"",
    "As long as the person she favors advocates strong America First and Make America Great Again policies, the voter said, she doesn't need to follow Trump's lead to feel she is supporting his creed.",
    "\"Because you need the MAGA folks to win the Republican primaries, you may end up with a bunch of candidates that are absolutely beatable, even in a tough cycle, in the general election.\"",
    "Budd has also benefited from $15 million in ad spending by the Club for Growth Action, a Trump-aligned Super PAC, attacking and highlighting McCrory's past criticism of the ex-president.",
    "Once they're through, though, in competitive places like Pennsylvania, Wisconsin and Ohiothree of just six states with one senator from each major partythe general electorate may chafe.",
    "Trumpism vs. MAGA\nIronically, the Trumpiest candidatesin terms of aggressive style, stop-the-steal sound bites and adherence to a MAGA agendaare not always the ones winning his support.",
    "That might be because Mooney had already raised large sums before the endorsement and McKinley is supported by high-profile Republicans closer to home, including Governor Jim Justice.",
    "\"These guys are so busy trying to be the Trump guy they forget that Trump is a loser who has cost the party both houses and the presidency,\" says a GOP consultant in upstate New York.",
    "Trump may know he can afford some off-key picks because the payoff, should his long shots come in, in terms of credit and loyalty to him is so huge, a Trump insider tells Newsweek.",
    "3 post in House Republican leadership for refusing to stop denouncing Trump's role in the Capitol attack, and is now reliant on Dems and independents crossing over to vote for her.",
    "Budd credits the Trump imprimatur with helping him keep pace on fundraising; in the first quarter of 2022, for instance, Budd raised $1.125 million versus McCrory's $1.13 million.",
    "In that way, he's already taken full control of the Republican ideology in a way that no one-term president who presided over the party's loss of the House and Senate ever has.",
    "Trump's pick of Mooney in November 2021 did not yield a noticeable bump; Mooney raised just $200,000 in that quarter while McKinley brought in $1.1 million in the same span.",
    "\"There will be more Marjorie Taylor Greenes and Madison Cawthorns nominated for federal office and for state office and for local officefar more than there are Fred Uptons.",
    "There, Trump persuaded former Senator David Perdue, a Republican who lost his seat to Democrat Jon Ossoff in January 2021, to challenge incumbent GOP Governor Brian Kemp.",
    "In another high-profile race in Pennsylvania, Trump recently threw his support behind celebrity physician Mehmet Oz for the GOP nod for U.S. Senate in the May 17 primary.",
    "In West Virginia, for instance, a May 10 primary for a U.S. House seat pits two Republican incumbents, Representatives Alex Mooney and David McKinley, against each other.",
    "Or will a preponderance of more extreme views turn off some general-election voters and cost the GOP what are otherwise winnable seats, as it has in some past elections?",
    "Brooks was one of Trump's earliest presidential campaign supporters and a speaker at the January 6 Stop the Steal rally that preceded the attack on the U.S. Capitol.",
    "Nobody expects Trump to stop exerting his influence, even if his candidates don't advance or those carrying his banner are rejected by more diverse statewide voters.",
    "Trump despises Kemp, Secretary of State Brad Raffensperger and Attorney General Chris Carr for refusing to help overturn his 2020 loss to Biden in the Peach State.",
    "The only anti-Trump Republican to run, longtime lobbyist Craig Snyder, dropped out in September, saying he hadn't been able to draw enough support to be viable.",
    "\"It's like Donald Trump's staff is sabotaging Trump by convincing him to make the worst possible endorsements,\" conservative radio host Erick Erickson tweeted.",
    "Similarly, Trump mentioned Oz's popularity as a TV talk host as a credential, saying at the April 10 rally where he announced the Oz pick, \"TV is like a poll.\"",
    "Trump is looking at the field and deciding which of these candidates are most likely to win in November, who is better on TV and can connect best with voters.",
    "Another hopeful, Kathy Barnette, is a right-wing activist who has spent the past two years hunting for evidence that the 2020 election was stolen from Trump.",
    "Far from predictably choosing the MAGA front-runner in a given race, his picks have been idiosyncratic and frequently buck pressure from his inner circle.",
    "The consultant asked for anonymity because \"going on the record in any way, shape or form against Trump is a death sentence in my line of work right now.\"",
    "This also appears to be a modus operandi when he picks some more obscure figures and elevates them to contenders, like in North Carolina's May 17 primary.",
    "Take the former president's decision in March to rescind his endorsement of Representative Mo Brooks, who is running for an open Senate seat in Alabama.",
    "Yet when asked how much Trump's much-heralded and intensely coveted endorsements would influence their vote in upcoming GOP primaries, they all hedged.",
    "In 2010, during President Barack Obama's first midterms, Republicans gained 63 seats in the House in the largest shift since 1948 on a Tea Party wave.",
    "Vance of Hillbilly Elegy fame, a controversial call in MAGA circles and one being billed as a major test of the former president's endorsement power.",
    "She raised $2.94 million in the first quarter of 2022, a record for her, and she's got $6.8 million on hand to battle Hageman and the Trump machine.",
    "Trump complained that Brooks had betrayed him by saying the 2022 election ought not be a debate over whether the 2020 presidential race was stolen.",
    "There, he is backing Representative Ted Budd, a backbench House member, to be the GOP nominee to replace retiring Republican Senator Richard Burr.",
    "Budd now has a 12.3-point lead over McCrory and former Representative Mark Walker in a RealClearPolitics average of three surveys taken in April.",
    "The doctor only recently renounced his advocacy of abortion rights and has never walked back his longstanding support of the Affordable Care Act.",
    "They echoed his views on immigration and critical race theory, questioned the integrity of the 2020 election and wished he were still president.",
    "Some hesitated, worrying he might lose because of the level of anti-Trump animus among Democrats and independents or because he's getting older.",
    "Townhall columnist Kurt Schlichter was also aghast: \"It's pretty hard for me to fully express how disappointed in Trump I am for endorsing Oz.\"",
    "The great unknown is how the ultra-conservatism of the MAGA crop of candidates will sit with the general electorate in the midterms this fall.",
    "Still, that's remarkable because West Virginia gave Trump his second-highest vote percentage of any statenext to Wyomingin the 2020 election.",
    "(Observers believe the fact that Brooks was running an ineffective and flailing campaign and was down in the polls was also a major factor.)",
    "Just as there's no way of knowing whether nominating a majority of conservative MAGA candidates will cost the party in the general election.",
    "In a North Star Opinion poll on March 22, McKinley led Mooney 38 percent to 33 percent, with 25 percent still undecided in a five-way race.",
    "For those decisions, Mooney's supporters have branded McKinley a RINO, or Republican in Name Only, and mocked his \"liberal voting record.\"",
    "He was out front with our two senators, a Republican and a Democrat, and they talked about things that are coming to the district.",
    "Meanwhile, Matt Dolan, the sole non-MAGA candidate of the lot, wallows in fourth place with a polling average of just 8.3 percent.",
    "After the Oz pick, Fox News Channel's Laura Ingraham urged viewers to consider other candidates truer to the America First mantra.",
    "Evidently, a large number of Trump voters and conservative donors are not feeling beholden to put their money where his mouth is.",
    "During Longwell's focus group of Trump voters, the moderator asked participants whether they wanted to see him run again in 2024.",
    "\"They're running against the media, they're running against vaccine mandates, they are running against 'woke' and socialists.\"",
    "The debate in the Republican Party right now is whether you're on the side of authoritarianism or complete totalitarianism.\"",
    "Republicans this year need to flip just one seat in the Senate and four in the U.S. House to take control of each chamber.",
    "\"Of all the House primaries, that one is probably the most significant if you're looking at Trump critics within the GOP.\"",
    "As of the end of the first quarter of 2022, Mooney had a small cash-on-hand lead of $1.4 million to McKinley's $1 million.",
    "But all seven of the candidates running have MAGA street cred and would have relished the former president's endorsement.",
    "Trump has chosen Mooney, an outspoken MAGA advocate who parrots Trump's sentiments about the 2020 election being stolen.",
    "But that hyper focus overshadows another critical development: In one important respect at least, Trump has already won.",
    "\"McKinley's the guy who brings home the bacon,\" says West Virginia University political science professor John Kilwein.",
    "Trump picked Budd over former Governor Pat McCrory and never really explained the decision, made way back in June 2021.",
    "Oz is not considered conservative enough and Vance is loathed for his past harsh criticism of Trump and his followers.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades.",
    "The question is more about the possible cost to the margin of victoryand to the prospects for the party going forward.",
    "And Trump quickly acknowledged, then dismissed Vance's past criticism in a statement announcing the endorsement.",
    "They also regularly invoke the former president while campaigning, making their loyalty and admiration clear.",
    "Vance [in Ohio] have been in this extraordinary contest to out-nativist, out-Trumpist, out-racist each other.",
    "It's not just in Ohio, though, that entire, crowded fields of candidates are trying to out-Trump each other.",
    "Mooney shot back bemusedly asking how he could be bad for the \"Trump agenda\" when he got the endorsement.",
    "Until then, the group had shown nothing but enduring loyalty and admiration for the former president.",
    "\"But if I truly believed in the opposing candidate, it's not going to make me vote any differently.\"",
    "The big recent development in the race is Trump's April 15 decision to back best-selling author J.D.",
    "\"I'd be there with him, yes,\" one man from Georgia said, \"to win the presidency for the third time.\"",
    "In one of those polls, 59 percent of likely primary voters said Trump's endorsement matters to them.",
    "And the lone non-MAGA candidate, if there is one, is typically trailing substantially in the polls.",
    "Former State Treasurer Josh Mandel, for example, uses the tagline \"Pro-GOD, Pro-GUNS, Pro-TRUMP.\"",
    "So he's jumped in with both feet to try to oust them by backing a bevy of more loyal Republicans.",
    "So he gets to choose people who he thinks can actually gain the power to support his agenda.\"",
    "What's left, typically, are candidates whose America First credentials are largely identical.",
    "(There were reports that Trump was annoyed that McCrory resisted his entreaties not to run.)",
    "\"If I was on the fence, that might be the final factor,\" a woman from North Carolina said.",
    "In one TV ad, McKinley shows footage of himself at a MAGA rally in West Virginia in 2017.",
    "Another spot castigates Mooney as \"bad for the Trump agenda and worse for West Virginia.\"",
    "Take the Vance and Oz endorsements, which gave hard-core MAGA pundits and politicos fits.",
    "\"Trump is spreading himself thin, and almost sticking his jaw out and gathering enemies.\"",
    "Vance, Oz, Budd, Perdue, Mooney and Hageman, among others, would owe Trump their careers.",
    "That virtually guarantees a majority of Trumpists on the Republican ballot in November.",
    "\"The fundamentals for Democrats are bad, but candidates really matter,\" Longwell says.",
    "Trump proclaimed, \"I know of at least one person in the race who I won't be endorsing.",
    "His support appears to be giving her a big boost in the state's August 16 primary.",
    "Cheney was once GOP royalty as the daughter of former Vice President Dick Cheney.",
    "But if he can't make it to the GOP ticket, he has no chance of proving that.",
    "In many cases, Trump's version of Trumpism is less strategic than personal.",
    "Still, there wasn't any doubt: If he ran, these misgivings would evaporate.",
    "So, yeah, I think it's conceivable that they will suffer because of that.\"",
    "Even his most strenuous critics in the GOP, like Timmer, concede defeat.",
    "Meanwhile, Trump has looked the other way over Oz's anti-MAGA positions.",
    "Miller is doubtful, though, as a state like Ohio has become deeper red.",
    "He is our best chance for victory in what could be a very tough race.\"",
    "The only must: questioning the legitimacy of the 2020 election.",
    "They're all going to follow his lead, they'll all be Trumpists.",
    "\"What does he get out of supporting the obvious front-runner?\"",
    "Consider, for instance, former hedge fund CEO David McCormick.",
    "The two candidates voted the same way 91 percent of the time.",
    "If it were just a normal election, I think McKinley has it.",
    "That element of surprise has always been a Trump hallmark.",
    "Yet the party still failed to take control of the Senate.",
    "Trumpism and MAGA, in this context, are not synonymous.",
    "The endorsement's impact on fundraising is murky, too.",
    "So far, Dolan's strategy doesn't appear to be working.",
    "\"He knows this, and he loves this,\" the person says.",
    "Trump seems nonplussed by the reaction to his picks.",
    "Carla Sands served as Trump's ambassador to Denmark.",
    "Trump supporters, of course, don't see it that way.",
    "\"That's why he voted for that infrastructure bill.",
    "All of that is going to be fodder [in November].",
    "But the Trump MAGA element is the wildcard.\"",
    "But she was removed last year from the No.",
    "The Republican Party has too many RINOs!\"",
    "\"It's just where you are on that scale.\"",
    "That's what party insiders worry about.",
    "The Vance nod drew similar resistance.",
    "\"He's saying he can win in November.\"",
    "Her fundraising acumen is impressive.",
    "\"He is the leader of our party, yes.",
    "Said Trump: \"Like some others, J.D.",
    "Polling shows a tight contest.",
    "But he doesn't control me.\"",
    "What About November?",
    "Josh Mandel and J.D.",
    "Georgia is similar.",
    "Vance.\""
  ]
}