{
  "id": 136,
  "mediaId": 151,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "A new Democratic super PAC is endorsing 11 more candidates and spending $10 million in primary contests.",
  "image": "https://www.politico.com/interactives/uploads/image-service/2022/4/27/e55170dbe4-1200.jpeg",
  "link": "https://www.politico.com/minutes/congress/04-27-2022/",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2062,
    2062,
    2179,
    2179,
    2303,
    2299,
    2299,
    2232,
    2232,
    2341,
    2341,
    2303,
    798,
    798,
    101,
    101
  ],
  "sentences": [
    "They're running out of things to throw at me...\nShare your most embarrassing vacay pics in the repliesg??https://t.co/YicRk0Albu\n Madison Cawthorn (@CawthornforNC) April 22, 2022\n9 days ago: According to reporting from the local site Smoky Mountain News, Lisa Wiggins, a former caseworker and aide to the lawmaker, filed a workplace complaint against the congressman claiming that Cawthorn denied her leave when two family members passed away within the same week.",
    "After Gaetz spoke, others Republicans named in the McCarthy recording also got up to speak but with a much diff message\nThey basically said they didn't like what they heard, but want to move on, per GOP source in room https://t.co/DblXAvYb1X\n Sarah Ferris (@sarahnferris) April 27, 2022\nMadison Cawthorn was hit with two distracting furors in the same day.",
    "Tap, click or scroll for more g\nWhat happened: House Minority Leader Kevin McCarthy doesn't appear to be facing a significant groundswell of GOP opposition from The New York Times' leaked tapes of his private comments about fellow Republicans even after a new tape that found him dissing several pro-Trump conservatives in his own conference.",
    "#ncpol https://t.co/3s1UJMk1tj\n Senator Thom Tillis (@SenThomTillis) April 27, 2022\nThe beef between Tillis and Cawthorn: In the midst of an earlier controversy where Cawthorn said he'd gotten invitations to orgies and seen cocaine use in Washington, Tillis endorsed Cawthorn's primary challenger for \"the first time in my political career.\"",
    "Tap, click or scroll for more g\nA month full of scandal: In Rep. Madison Cawthorn's (R-N.C.) latest public stumbles, the 26-year-old was hit Tuesday with two problematic stories in the same day: He was cited for having a loaded gun at the Charlotte airport and dinged for potential insider trading by the conservative Washington Examiner.",
    "\"Many Americans don't know that the landmark Brown v. Board of Education Supreme Court decision that desegregated public schools in 1954 combined legal challenges from four states and the District of Columbia ... Having geographically dispersed historic sites that tell this great story will enable more students to learn from the past.\"",
    "Rep. MTG's message: every member has had their words twisted in media, and that they shouldn't be going after one another/need to be careful about what they say, per 2 R sources in room who said members found message quite ironic coming from her.",
    "According to the newspaper, Cawthorn had insider knowledge that the meme coin, originating from a chant mocking President Joe Biden, would be the primary sponsor of NASCAR driver Brandon Brown's 2022 season before it was announced to the public.",
    "March 10: The lawmaker calls Ukrainian President Volodymyr Zelenskyy a \"thug\" while labeling his government \"incredibly evil\"  breaking from most politicians on the Hill who've voiced support for Ukraine in the midst of the Russian invasion.",
    " Olivia Beavers (@Olivia_Beavers) April 27, 2022\nWhere it got heated: Rep. Matt Gaetz (R-Fla.), who blasted out a scathing statement about the tapes Tuesday night, got fired up toward House Minority Whip Rep. Steve Scalise (R-La.).",
    "Tap, click or scroll for more g\nWhat happened: The House passed legislation by voice vote on Tuesday expanding federal sites celebrating the Supreme Court's Brown v. Board decision to desegregate the nation's public schools.",
    "Tap, click or scroll for more g\nWhat happened: Broader prohibitions on stock trading for federal officials and lawmakers remain uncertain, but Congress just moved to beef up disclosure requirements for federal judges.",
    "In North Carolina we have the North Carolina political establishment, and one RINO Senator who have really targeted me, are coming hard  they're starting to say just these ridiculous salacious lies,\" Cawthorn said.",
    "The report cited interviews with more than three dozen people, including detailed instances in which Cawthorn had been predatory or used misogynistic insults against women at his university, Patrick Henry College.",
    "They are expected to consider the nominations of Sherilyn Garnett to a federal judgeship in California, as well as that of Julia Gordon to be assistant secretary at the Department of Housing and Urban Development.",
    "But this in itself isn't a sign of trouble for House GOP leaders; Gaetz is under DOJ scrutiny in a sex trafficking investigation and not quite a bellwether of conservative sentiment in the conference.",
    " House Democratic Caucus Chair Hakeem Jeffries (D-N.Y.)\nThom Tillis is calling for the House Ethics committee to launch an investigation into insider trading allegations against Madison Cawthorn.",
    "Tap, click or scroll for more g\nWhat happened: A new super PAC on the scene, Protect Our Future, announced its endorsements in 11 new races and plans to spend $10 million in Democratic primaries.",
    "March 30: House GOP leadership reprimanded Cawthorn for speaking on alleged \"sexual perversion\" in Washington, and accusing fellow colleagues of inviting him to orgies and offering cocaine.",
    "Here's a rundown of the most recent times the lawmaker has found himself in hot water:\nTuesday morning: He was found with a 9 mm in his bag at Charlotte Douglas International airport.",
    "Tap, click or scroll for more g\nKnives out: Sen. Thom Tillis (R-N.C.) isn't done calling out delegation-mate Rep. Madison Cawthorn, whose primary challenger he's already backed.",
    "(And he's not alone in that; GOP Sen. Bill Cassidy is supporting the primary challenger of fellow pro-Trump headline-grabber Rep. Marjorie Taylor Greene of Georgia.)",
    "The takeaway: It's pretty rare for party infighting to be this public  and even rarer for lawmakers to support primary challengers to incumbents across the Capitol.",
    "Tuesday afternoon: The Examiner report alleges that the congressman has breached insider trading laws advertising his \"Let's Go Brandon\" cryptocurrency setup.",
    "Cawthorn was issued a citation for possessing a dangerous weapon on city property and later released, but the weapon remained in the possession of officials.",
    "There's no sign yet of significant internal blowback from the leader's comments about Donald Trump and pro-Trump conservatives following the Jan. 6 attack.",
    "February 26: Allegations of sexual assault from four women, one of which is an intern for another Republican member of Congress, were reported by Buzzfeed.",
    "His response:\nI guess the left thinks goofy vacation photos during a game on a cruise (taken waaay before I ran for Congress) is going to somehow hurt me?",
    "What it does: The bill requires judges to file a report within 45 days disclosing transactions exceeding $1,000 of stocks, bonds or other commodities.",
    "Tillis is calling out allegations of insider trading against Cawthorn  and requesting an investigation into the matter by the House Ethics committee.",
    "The expansion would include areas in Virginia, Delaware, South Carolina and the District of Columbia, all managed by the National Park Service.",
    "The infrequency of judges' financial disclosures and the inaccessibility of the reports have made actual transparency practically impossible.\"",
    "Insider trading by a member of Congress is a serious betrayal of their oath, and Congressman Cawthorn owes North Carolinians an explanation.",
    " House Majority Whip Jim Clyburn (D-S.C.)\nKevin McCarthy talked about that leaked audio during a private House GOP conference meeting.",
    "Later, a super PAC associated with the senator spent more than $300,000 on ads knocking down the freshman and calling out his \"lies.\"",
    "The Louisiana Republican appeared in the latest Times audio suggesting that Gaetz's harsh comments about Rep. Liz Cheney (R-Wyo.)",
    "The conservative has staked much of his political identity on traditional Christian values and advocating for hypermasculinity.",
    "(This isn't the first time this has happened  he was found with a 9 mm back in February 2021 at Asheville Regional Airport.)",
    "What he said: McCarthy came out swinging against the audio and warned it was a distraction, per people in the room.",
    "4 days ago: Photos obtained by POLITICO show Cawthorn wearing women's lingerie in what seems to be a party setting.",
    "The House voted to expand a site dedicated to the Brown v. Board Supreme Court decision ending school segregation.",
    "The House passed a bill that would require greater transparency from federal judges in their stock trading.",
    "Check out our archive for previous minutes, or sign up for Huddle our morning Capitol Hill newsletter.",
    "He claimed the recordings were selectively cut, urging his members to not let the tapes divide them.",
    "The beef between the Republican senator and the young House conservative isn't ending anytime soon.",
    "There needs to be a thorough and bipartisan inquiry into the matter by the House Ethics Committee.",
    "Consideration of a resolution axing Biden's Title X family-planning provisions is also expected.",
    "Rep. Abigail Spanberger (D-Va.), who has no threat in her primary but remains a top GOP target.",
    "Rep. Haley Stevens, who's battling Rep. Andy Levin (D-Mich.) in a member-on-member contest.",
    "March 9: Cawthorn faces three court dates for speeding and driving with a revoked license.",
    "Former Rep. Max Rose, who wants to return to his former Staten Island congressional seat.",
    "But Cawthorn's penchant for stoking controversy is starting to wear on many Republicans.",
    "Valerie Foushee, who's in a crowded race to replace longtime Rep. David Price (D-N.C.).",
    "A round-up of the most recent mess-ups from the North Carolina conservative freshman.",
    "\"This legislation makes incremental but necessary progress toward accountability ...",
    "This has been, to say the least, a busy few months for Cawthorn  not in a good way.",
    "Sydney Kamlager, who is vying to succeed the retiring Rep. Karen Bass (D-Calif.).",
    "Here's what's driving the congressional calendar on Wednesday, April 27, 2022.",
    "Just last night, Cawthorn hopped on Instagram and labeled Tillis as a \"RINO.\"",
    "Francis Conole, who is seeking the seat vacated by Rep. John Katko (R-N.Y.).",
    "It can be hard to keep track of his latest problems  so we did it for you!",
    "Tap, click or scroll for more g\nThe Senate: The chamber comes in at 2 p.m.",
    "The measure now heads to President Joe Biden's desk for his signature.",
    "Brittany Pettersen, who wants to replace Rep. Ed Perlmutter (D-Colo.).",
    "Morgan McGarvey, who is aiming to succeed Rep. John Yarmuth (D-Ky.).",
    "Since then, the two have been locked in a consistent back-and forth.",
    "It also establishes an online database of these disclosure reports.",
    "Alessandra Biaggi, who's running to replace Thomas Suozzi (D-N.Y.).",
    "Laura Gillen, who's running to succeed Rep. Kathleen Rice (D-N.Y.).",
    "The two went back and forth Wednesday morning behind closed doors.",
    "Protect Our Future has been funded by a wealthy crypto investor.",
    "The House passed a bill doing that by voice vote on Wednesday.",
    "The measure now heads to President Joe Biden's desk.",
    "That includes a member-on-member race in Michigan.",
    "Check back later today for updates from the Hill.",
    "More testimony from Biden Cabinet officials.",
    "Senate churns through more nominations.",
    "Seizure of Russian oligarch assets.",
    "And he got a standing ovation.",
    "may have been \"illegal.\"",
    "It was a voice vote.",
    "That's all for now.",
    "Want to see more?"
  ]
}