{
  "id": 139,
  "mediaId": 233,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene said some lawmakers talked martial law after Jan. 6, according to texts released by CNN",
  "image": "https://www.gannett-cdn.com/presto/2022/04/22/USAT/5d6638a4-eb88-4d20-b291-24f746c968c3-AP22112490113793.jpg?crop=5759,3240,x0,y292&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/04/25/mark-meadows-texts-cnn-jan-6/7442333001/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bart Jansen",
  "authorUrl": "https://www.usatoday.com/staff/2648278001/bart-jansen/",
  "termIds": [
    1039,
    1145,
    1147,
    1148,
    1184,
    1917,
    2087,
    2240,
    2278,
    3094,
    106
  ],
  "sentences": [
    "Dressed like Trump supporters.?\nRep. Louie Gohmert, R-Texas, told Meadows that Capitol Police told him the night before the certification of the election that they had been warned? about Antifa dressed in red Trump shirts & hats & would likely get violent.?\nGood that Trump denounces violence but could add & well demand justice for those who became violent & well get to the bottom of what group they're with,? Gohmert said in his message.",
    "WASHINGTON  Rep. Marjorie Taylor Greene said in a text to former White House chief of staff Mark Meadows that lawmakers were discussing in January 2021 whether then-President Donald Trump should declare martial law to remain in power, according to texts CNN released Monday.",
    "Here's what else was revealed in the text messages reported by CNN:\nLawmakers warn of need to end violence\nWhile Trump supporters besieged the Capitol, lawmakers and others in the president's orbit encouraged the White House to step in.",
    "Fox's Sean Hannity and Meadows had been texting since Election Day\nEarlier this year Rep. Liz Cheney read text messages between Meadows and several Fox News hosts during the Jan. 6 Capitol riot, including Sean Hannity.",
    "Greene, R-Ga., testified Friday in federal court in Georgia, in a case where voters are trying to disqualify her from the ballot because of her support for overturning the results of the 2020 presidential election.",
    "The text messages included Trump's son Donald Trump Jr. and daughter Ivanka Trump, along with White House officials and political supporters such as personal lawyer Rudy Giuliani and Fox News host Sean Hannity.",
    "On radio.?\nHannity responded: Yes sir.?\nMonths later, Hannity would question Meadows about whether Trump would make a statement as a mob of his supporters overran the Capitol on Jan. 6.",
    "GOP made unfounded allegations about Antifa\nMeadows' phone also was flooded with messages floating conspiracy theories and spin about who was responsible for the attack on the Capitol.",
    "Call me crazy, but ideas for two tweets from POTUS: 1) Bad apples, likely ANTIFA or other crazed leftists, infiltrated today's peaceful protest over the fraudulent vote count.",
    "2) The fake news media who encouraged this summer's violent and radical riots are now trying to blame peaceful and innocent MAGA supporters for violent actions.",
    "Please tell him to declassify as much as possible so we can go after Biden and anyone else!?\nGreene's spokesman didn't immediately return a request for comment.",
    "Trump's son worried about how the riot would affect the president's legacy and said a tweet asking for peace and to support the Capitol Police was not enough.",
    "In our private chat with only Members, several are saying the only way to save our Republic is for Trump to call for Marshall (sic) law,? Greene's text said.",
    "Two weeks later, he sent Meadows a link to then-Senate Majority Leader Mitch McConnell saying on the Senate floor that Trump had provoked the insurrection.",
    "Our people should head home and let the criminals suffer the consequences!?\nGreene told Meadows that she didn't believe these attackers are our people.",
    "Meadows provided thousands of texts to the House committee investigating the Capitol attack Jan. 6, 2021, but then stopped cooperating with the panel.",
    "One text from Greene to Meadows on Jan. 17, 2021  three days before President Joe Biden was inaugurated  mentioned lawmakers discussing martial law.",
    "A campaign staffer, Jason Miller, sent Meadows a message suggesting two possible tweets the president could send from his now-suspended account.",
    "The trove of text messages CNN unveiled on Monday showed that Meadows and Hannity had been in communication since as early as Election Day.",
    "When Rep. William Timmons told Meadows that Trump needed to act, Meadows responded that we are doing it.?\nTELL THEM TO GO HOME !!",
    "Hannity appeared to be taking cues from the White House chief of staff on what he would say during his talk radio show.",
    "Rep. Barry Loudermilk told Meadows that it had gotten really bad up here on the hill? as rioters breached the Capitol.",
    "CNN obtained 2,319 texts to and from former White House chief of staff Mark Meadows and released them Monday.",
    "USA Today and other media outlets have debunked claims that Antifa activists were responsible for the attack.",
    "Former White House chief of staff Mick Mulvaney offered his help and encouraged Trump to stop the riot.",
    "The House has found Meadows in contempt and urged the Justice Department to prosecute him.",
    "MAGA supporters embrace our police and the rule of law and should leave the Capitol now!",
    "When asked whether she advocated martial law, she replied twice: \"I don't recall.\"",
    "!? ex-White Hose chief of staff Reince Preibus said in a message to Meadows.",
    "Well this is as bad as it gets,? Hannity told Meadows on Jan. 19.",
    "U.S. District Judge Amy Totenberg hasn't ruled in the case yet.",
    "Get out and vote,? Meadows said in an Election Day exchange.",
    "Georgia's Republican primary is May 24.",
    "They will destroy our country next.",
    "I just wanted you to tell him.",
    "He's got to condemn this s---.",
    "Asap,? he wrote in a message.",
    "Violence is never acceptable!",
    "I don't know on those things.",
    "Stress every vote matters.",
    "We think they are Antifa.",
    "They stole this election.",
    "This isn't who we are!",
    "We all know."
  ]
}