{
  "id": 142,
  "mediaId": 881,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Kevin McCarthy Is Now Straight-Up Lying About Wanting Trump to Resign",
  "image": "https://video-images.vice.com/articles/6266b6ca87bbc4009b0625a3/lede/1650898833121-kevin-mccarthy-trump-audio.jpeg?crop=1xw:0.8429xh;0xw,0.031xh&resize=1000:*",
  "link": "https://www.vice.com/en_us/article/5dgv3n/kevin-mccarthy-trump-recording-denial",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Blest",
  "authorUrl": "https://www.vice.com/en/contributor/paul-blest",
  "termIds": [
    1147,
    1248,
    1609,
    3094,
    428,
    517,
    2672,
    2845
  ],
  "sentences": [
    "Rep. Matt Gaetz, the far-right congressman from Florida currently under investigation for possible sex trafficking of a minor and a prominent critic of McCarthy, criticized the Republican leader over the weekend and suggested fellow far-right congressman Jim Jordan of Ohio should replace him.",
    "I think [the impeachment resolution] will pass, and it would be my recommendation you should resign,? McCarthy said he would tell Trump, according to audio obtained by New York Times reporters who wrote a forthcoming book about the final months of the Trump administration.",
    "McCarthy said Friday, however, that the phone call was overblown? and that he was just walking? Cheney and other Republicans through different scenarios.?\nI never asked the president to resign and I never thought that he should resign,? McCarthy told reporters.",
    "After leaked audio revealed that House Minority Leader Kevin McCarthy said then-president Donald Trump should resign after the Capitol riot, McCarthy is using a not-so-novel defense: denying it ever happened, in spite of damning evidence that it did.",
    "Just two days after the attack on the Capitol, McCarthy told other top House Republicans, including then-conference chair Rep. Liz Cheney, that he was seriously considering? having a conversation with Trump to urge the president to resign.",
    "McCarthy said Friday that he had spoken with Trump at least twice since the audio was leaked, and that they had a very good conversation.? Asked about accusations that he's a liar, McCarthy responded: I never asked the president to resign.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "McCarthy is traveling to the U.S.-Mexico border in Texas on Monday along with a group of Republican lawmakers, including Cheney's replacement, Rep. Elise Stefanik, and Rep. Marjorie Taylor Greene.",
    "Greene, the far-right freshman lawmaker from Georgia, testified last week under oath in a case to get her thrown off the ballot because she supported overthrowing the 2020 election.",
    "McCarthy later supported an effort by fellow House Republicans to boot Cheney from the GOP leadership, and he's endorsed Cheney's primary opponent in Wyoming.",
    "They say one thing to the American public and something else in private.?\nMcCarthy has also faced pressure from some on the right since the audio was leaked.",
    "Democrats have seized on the audio as evidence McCarthy and other top Republicans bowed to pressure from Trump and right-wing media after the Capitol riot.",
    "McCarthy clearly says in the audio that he would recommend to Trump that he resign, though he also says he doesn't believe Trump will listen to him.",
    "So, no, I stand by what I said and I stand by it today.?\nTrump, for his part, defended McCarthy in comments to the Wall Street Journal Friday.",
    "What I was asked on the phone call was about the process it was never in the process to ask President Trump to resign.?\nThis is untrue.",
    "But almost immediately as you know, because he came here and we took a picture right there,? Trump said in an interview at Mar-a-Lago.",
    "Kevin McCarthy is a liar and a traitor,? Sen. Elizabeth Warren told CNN Sunday.",
    "This is the illness that pervades the Republican leadership right now.",
    "You know, the support was very strong,? Trump told the Journal.",
    "That's what the [New York Times] book tried to say.",
    "Want the best of VICE News straight to your inbox?",
    "I didn't like the call.",
    "I heard the call.",
    "He made a call.",
    "Sign up here."
  ]
}