{
  "id": 144,
  "mediaId": 558,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "America First Political Committee Chairman KW Miller Will Primary RINO Carlos Gimenez in Florida's 28th Congressional District",
  "image": "",
  "link": "https://au.lifestyle.yahoo.com/america-first-political-committee-chairman-122800260.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1335,
    3094,
    254,
    545,
    562,
    2661,
    2788,
    2790
  ],
  "sentences": [
    "550, to allow the federal government to create a database, track unvaccinated Americans, who could be targeted, segregated, discriminated against, and forced to comply with vaccination mandates;\nRINO Gimenez voted with Nancy Pelosi on Anti-Second Amendment legislation HR-8, making it more difficult for law-abiding citizens to purchase, own, carry, and use a firearm;\nRINO Gimenez voted with Nancy Pelosi on H.R.",
    "6 for 'Open Borders and Amnesty' to over 20 million criminal illegal aliens, which would permanently avoid deportation, obtain a pathway to citizenship, and full voting rights;\nRINO Gimenez also voted with Nancy Pelosi to strip Republican Representative Marjorie Taylor Greene of all Congressional Committee positions.",
    "MIAMI, April 25, 2022 /PRNewswire/ -- America First Political Committee Chairman KW Miller will primary RINO Carlos Gimenez in Florida's 28th Congressional District which includes a portion of southern Dade County and all of Monroe County Florida.",
    "RINO Carlos Gimenez has openly voted with Nancy Pelosi and the radical leftists in Congress on critical 'Unconstitutional Issues' far too many times and continues to support a socialist agenda.",
    "About America First Political Committee:\nOur mission is to protect the integrity of the U.S. Constitution, promote conservative political candidates and policy that puts America First.",
    "Gimenez also defended disgraced RINO Liz Cheney after she voted in favor of the 'Sham Impeachment' against Donald Trump.",
    "RINO Gimenez also defended Cheney after the Republican Caucus censored and removed her from Republican Party Leadership.",
    "RINO Gimenez also voted for the 'January 6' Democrat 'Witch Hunt' against American Citizens and Republican voters.",
    "Gimenez, like RINO Liz Cheney continues to openly vote and side with the Socialist and Radical Democrats.",
    "RINO Gimenez openly supported and 'Voted for Hillary Clinton' in 2016.",
    "RINO Gimenez voted with Nancy Pelosi on H.R."
  ]
}