{
  "id": 150,
  "mediaId": 195,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "McCarthy's future hangs in limbo as Washington awaits Trump response",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/mccarthykevin_040422gn3_lead.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/house/3460404-mccarthys-future-hangs-in-limbo-as-washington-awaits-trump-response/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Brooks",
  "authorUrl": "https://thehill.com/author/emily-brooks/",
  "termIds": [
    1126,
    1147,
    1609,
    1715,
    2087,
    2214,
    3094,
    204,
    296,
    428
  ],
  "sentences": [
    "Trump has not publicly responded to the criticisms from the leading House Republican, whom Trump has referred to as my Kevin.? Several news reports on Friday indicated that the former president was not angry with the developments, and in fact was reveling in the news that amplified his unique role as the prominent power-player in the GOP.",
    "The release this week of stunning audio tapes indicating that McCarthy had blamed Trump directly for the riot  and called for his resignation with just days left in Trump's White House tenure  has threatened to strain relations between the GOP leader and the volatile former president, who's known to demand undying loyalty.",
    "McCarthy, who's hoping to seize the Speaker's gavel if Republicans flip the House in November's elections, has been among those pilgrims, visiting Mar-a-Lago several times since Trump left the White House, including a trip just weeks after the Jan. 6, 2021, attack on the Capitol by a mob of Trump supporters.",
    "After recordings were revealed Thursday and Friday showing that McCarthy falsely denied suggesting that Trump should resign if he was impeached for Jan. 6 and that he had had it with this guy,? House Republican aides said that they were waiting to see what other Republicans and Trump would do in response.",
    "But as McCarthy churns headlines this week over revelations that he wanted Trump to resign for stoking last year's deadly attack on the Capitol, the fate of the top House Republican could very well hinge on Trump's willingness to do something he's not accustomed to doing: forgive and forget.",
    "Trump has a well-earned reputation for holding a grudge, and most of the scores of endorsements he's offered this cycle have shunned those Republicans critical of him in the past, while benefiting those who support his false claim that President Biden's election victory was fraudulent.",
    "Complicating McCarthy's defense, he issued a statement Thursday morning in which he sharply denied that he'd ever made such statements, accusing the corporate media? of pushing a liberal agenda.? That evening the audio tapes were released, proving his claims to be false.",
    "Vance, the Hillbilly Elegy? author and venture capitalist, who had hammered Trump leading up to the 2016 election, characterizing the eventual president as reprehensible.?\nVance has said he misread Trump and regrets the criticisms.",
    "He's parlayed that approval into the powerful role of GOP kingmaker, leading scores of Republican candidates from across the country to trek to Trump's South Florida resort seeking a boost in the form of his favor.",
    "Rep. Adam Kinzinger (R-Ill.), who is largely shunned by Republicans for his participation in the Jan. 6 select committee, tweeted that McCarthy ought to be ashamed? for being caught in a lie.",
    "Since then, McCarthy has either downplayed, or declined to discuss, Trump's role in the riot, instead blaming Democrats for what he says was their failure to secure the Capitol that day.",
    "As long as the former president does not come out swinging against McCarthy, some GOP aides expect the news to fade away and McCarthy's Speakership prospects to be largely unaffected.",
    "The political success of Rep. Kevin McCarthy (Calif.), the House Republican leader, has been buoyed for most of the last decade by his unwavering support for former President Trump.",
    "The tapes, obtained by a pair of New York Times reporters set to release a new book, also revealed that McCarthy had deemed Trump's actions ahead of the attack to be indefensible.",
    "The aide adding that it will be just like? former House Speaker John Boehner (R-Ohio), who was pushed out of Congress by the conservative House Freedom Caucus in 2015.",
    "Rep. Matt Gaetz (R-Fla.), who has called for Trump to run for Speaker instead of McCarthy, took a dig at McCarthy for sticking with Rep. Liz Cheney (R-Wyo.)",
    "29 wks from now Republicans will have the majority and Kevin McCarthy will be Speaker of the House,? Rep. Anthony Gonzales (R-Texas) tweeted Thursday night.",
    "The last time he sought the gavel, in 2015, the path was blocked by those same members of the Freedom Caucus, who'd questioned his conservative bonafides.",
    "If he becomes Speaker, it could empower Trump-supporting wings of the conference to move against McCarthy or in spite of him, making him a weak leader.",
    "Several House Republicans tweeted support for McCarthy's Speakership, indirectly dismissing the revelations and McCarthy being caught in a falsehood.",
    "Republicans are going to take back the majority in November and when we do, Kevin McCarthy will be our Speaker,? said Rep. Ashley Hinson (R-Iowa).",
    "House Republicans appeared unfazed by the dishonesty, however, and largely declined to criticize McCarthy publicly, with two notable exceptions.",
    "Among his top targets have been Cheney and Kinzinger, who have hammered Trump as an existential threat to the nation's democratic traditions.",
    "The former president, though defeated in the 2020 election, remains the single most popular figure among Republican voters nationwide.",
    "There'll be a honeymoon phase as speaker then HFC [House Freedom Caucus] and MAGA will sour on him,? the second GOP aide said.",
    "But he'll likely need the support of a vast majority of Trump's conservative House allies if he hopes to achieve that goal.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "In a crowded Senate primary race in Ohio, Trump last week stunned many Buckeye State Republicans when he endorsed J.D.",
    "And he's taken long strides to win over those former critics this time around.",
    "A Trump spokesperson did not respond Friday to a request for comment.",
    "McCarthy's designs on the Speakership are no secret on Capitol Hill.",
    "Yet there are rare cases when a former critic has won Trump's favor.",
    "I doubt it will cut any ice,? said one high-ranking House GOP aide.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "MAGAs will feel more comfortable labeling McCarthy a RINO.",
    "McCarthy's office did not respond to inquiries on Friday.",
    "I've had it with this guy,? McCarthy said at the time.",
    "McCarthy will be back on Hannity tonight or next week.",
    "in early 2020, despite her sharp criticisms of Trump.",
    "But that does not leave McCarthy entirely unscathed.",
    "The midterms will drown it,? another GOP aide said.",
    "Fortunes could quickly change depending on Trump.",
    "Peoples' memories are short."
  ]
}