{
  "id": 154,
  "mediaId": 238,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Why Trump might give McCarthy a pass on Jan. 6",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/22/trump-mccarthy-resignation-comments/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1147,
    1609,
    1646,
    1765,
    1801,
    2525,
    3094,
    571,
    2590,
    2945
  ],
  "sentences": [
    "(I think he's a good man, I think he's going to do his job  we'll find out.?) But this week, after Brnovich's report, Trump announced another anti-endorsement, saying, Because of the amount of time that it took him to do the report, which was endless, his poll numbers have been rapidly sinking.?\nThe reason: Brnovich, like Kemp and many others who have found themselves on the outs with Trump, has been forced to weigh in on all of this by virtue of his day job.",
    "He was the U.S. attorney who did absolutely nothing on the massive election fraud that took place in Philadelphia and throughout the commonwealth,? Trump said, adding that McSwain should have done his job anyway.?\nThe reason: Apparently McSwain was useful in the moment, but ultimately his sin was only producing smoke for Trump after the fact, and not going harder for the supposed fire.",
    "What they said/did before: The Arizona attorney general said on Nov. 12, 2021, There is no evidence, there are no facts that would lead anyone to believe that the election results [in Arizona] will change.? Earlier this month, he released a report finding no evidence of widespread voter fraud in Maricopa County.",
    "What they said/did before: The former U.S. attorney in the summer of 2021 tried hard to give Trump something to work with: He suggested that then-Attorney General William P. Barr had prevented him from examining credible allegations of voter fraud in Philadelphia.",
    "), McCarthy said he'd tell a soon-to-be-impeached Trump that it would be my recommendation you should resign.?\nThe question is what this means for Trump's relationship with McCarthy  and by direct extension, McCarthy's designs on becoming speaker.",
    "But the New York Times reported last year of Hageman, None of [Trump's former opponents] have quite achieved Ms. Hageman's remarkable political transformation.? Even when running for governor in 2018, she did little to attach herself to Trump.",
    "Vance may have said some not-so-great things about me in the past, but he gets it now, and I have seen that in spades.?\nThe reason: It seems possible Trump backed Vance over Mandel because Trump tends toward celebrity candidates.",
    "In yet more newly released audio of another call, from Jan. 11, McCarthy said Trump bears responsibility for his words and actions  no if, ands or buts,? and said Trump acknowledged his responsibility for Jan. 6. to McCarthy.",
    "(Vance earned acclaim during Trump's political rise as the author of Hillbilly Elegy.?) Mandel has certainly been solicitous of Trump and run a very troll-y, Trump-y campaign, without past Trump criticism in his record.",
    "Trump is unfit for our nation's highest office.?\nWhere they stand now: Trump endorsed Vance for Ohio's GOP Senate nomination last week, over other candidates who fought hard for his support like Josh Mandel.",
    "What's more, she has taken care to play up Trump's stolen election? claims, including in a recent ad  despite not really raising such issues in late 2020 and not actually citing supposed fraud in the new ad.",
    "And The Post reports he spoke with Trump after the audio of the call was released, and Trump was not upset  indeed, he was even happy that McCarthy hadn't followed through on what he had said privately.",
    "What they said/did before: The challenger to Cheney back in 2016 was among those engaged in a last-ditch effort to prevent Trump from securing the GOP nomination at the Republican National Convention.",
    "Where they stand now: Trump has made his distaste for the Senate candidate clear, even as he momentarily seemed to relent earlier this year while pushing Brnovich toward voter fraud prosecutions.",
    "He has given most of his non-incumbent endorsements to bona fide election truthers, and reserves most of his venom these days for those he perceives to have wronged him after Election Day 2020.",
    "Where they stand now: Trump unleashed a series of vicious attacks on Kemp  which Kemp declined to respond to in kind  and is now backing his primary challenger, former senator David Perdue (R).",
    "What they said/did before: Trump reportedly privately blamed Ivey for a state commission deciding to prevent Trump from holding a rally last summer at the USS Alabama Battleship Memorial Park.",
    "He endorsed her primary opponent, Katie Arrington, which prompted Mace to record an awkward video in front of Trump Tower arguing that she was actually the one in line with Trump's agenda.",
    "What they said/did before: Kemp in 2020 declined Trump's entreaties to call his state's election results into question, including the use of emergency powers, and certified Trump's loss.",
    "But maybe what they require from McCarthy is not unwavering loyalty, but the assurance that he'll fall in line, and continue to recognize Trump's authority, when push comes to shove.",
    "Where they stand now: Trump has backed Hageman over Cheney, who voted to impeach him after Jan. 6 and has since emerged as his highest-profile critic among congressional Republicans.",
    "Where they stand now: While Trump promoted McSwain's letter at the time, this month  in a remarkable turn  he excoriated McSwain for not investigating the supposed fraud anyway.",
    "In that chamber, Trump's most loyal allies are more numerous, and some have already expressed unease about the California Republican's true commitment to Trump and his agenda.",
    "Trump has thus far unsuccessfully pushed for Republicans to replace Mitch McConnell (R-Ky.) as their Senate GOP leader, but he could hold considerably more sway in the House.",
    "Senate Minority Leader Mitch McConnell (R-Ky.) voted against impeachment on a technicality, while strongly criticizing Trump, and he's been on Trump's bad side ever since.",
    "On the one hand, Trump has been willing to overlook past criticisms  even harsh ones  provided the lawmaker in question proceeds to display the requisite obsequiousness.",
    "But is Trump really going to stand by and let someone who floated his resignation rise to a level of such power  likely leading the House during the 2024 election?",
    "The question for Trump and his allies is whether they trust the guy who didn't do that, but did push for his censure and even talked about pushing him to resign.",
    "Where they stand now: Trump has considered backing an Ivey primary opponent, with a likely possibility being his former ambassador to Slovenia, Lynda Blanchard.",
    "They soon patched things up after McCarthy publicly blamed Trump for not quelling the Jan. 6 riot and even floated a historic censure resolution against Trump.",
    "And indeed, part of the reason Trump was reportedly not upset Thursday night was that McCarthy's retreat showed the strength of Trump's grip on the party.",
    "The reason: Impeachment  or even gesturing in the direction of impeachment, as Mace did  seems to be a red line for Trump, for perhaps obvious reasons.",
    "The New York Times reported Thursday that after the Jan. 6, 2021, Capitol insurrection, McCarthy said that he'd push for Donald Trump to resign.",
    "What they said/did before: She made the rounds after Jan. 6, sharply criticizing Trump and indicated that she might support his impeachment.",
    "Many Republicans seem to be waiting for a cue from Trump about how to respond, though some have weighed in to defend or criticize McCarthy.",
    "On the other hand, insufficiently supporting his efforts to overturn the 2020 election have emerged as something of a red line for Trump.",
    "What they said/did before: In 2016, Vance called Trump cultural heroin? and said his policies range from immoral to absurd.? He said, Mr.",
    "Except Barr denied it in no uncertain terms and said McSwain had acknowledged to him that it was a ploy for Trump's endorsement.",
    "The reason: While Perdue was hardly a voter-fraud crusader in late 2020, he wasn't forced into making decisions like Kemp was.",
    "House Minority Leader Kevin McCarthy's (R-Calif.) hold on his status as the presumptive next GOP speaker was already tenuous.",
    "Brnovich has pressed forward with investigating some far-flung and fraud-adjacent ideas, but that can only go so far.",
    "And he has since winked and nodded at the idea that there was something wrong with the 2020 election results.",
    "She also suggested that the party should turn the page on Trump and that she would lead in that effort.",
    "Then last night, a recording emerged of a phone call confirming that McCarthy had done precisely that.",
    "Georgia law prohibits the governor from interfering in elections,? Kemp's office said at the time.",
    "And because there's still no basis for Trump's election claims, it's made the clashes unavoidable.",
    "A previous version of this post misspelled the last name of former U.S. attorney William McSwain.",
    "Where they stand now: Despite Mace backing off in her criticisms, Trump didn't forget.",
    "(McCarthy's previous bid for speaker fell apart under somewhat similar circumstances.)",
    "Vance despite Vance having sharply criticized him in 2016 as unfit to be president.",
    "McCarthy never publicly backed impeachment, which might be his saving grace here.",
    "She called Trump racist and xenophobic? and the weakest candidate? for the party.",
    "He appears to have earned goodwill from Trump for fighting the Jan. 6 committee.",
    "For now, McCarthy appears to have avoided blowback from the top of the party.",
    "Trump didn't endorse in the race, but did give McSwain an anti-endorsement.",
    "(She ultimately didn't, while pushing for Trump to be censured instead.)",
    "But with the primary happening next month, it hasn't yet materialized.",
    "McCarthy has also been more solicitous of Trump than McConnell has.",
    "And what more might we learn about what McCarthy did post-Jan. 6?",
    "Trump has been more accommodating of McCarthy than McConnell.",
    "The reason: Ivey appears to be in relatively little danger.",
    "And on Thursday it seemed like it could slip further.",
    "McCarthy occupies something of a middle ground here.",
    "The reason: Obviously, this is mostly about Cheney.",
    "Trump recently endorsed Ohio Senate candidate J.D.",
    "And that could matter for the fate of his career.",
    "In the phone call with Rep. Liz Cheney (R-Wyo.",
    "Ivey said she played no role in the decision.",
    "Mace would seem to be in the same camp.",
    "Trump said, Like some others, J.D.",
    "This version has been corrected.",
    "McCarthy flatly denied it."
  ]
}