{
  "id": 155,
  "mediaId": 32,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Liz Cheney denies recording bombshell tape of Kevin McCarthy saying he would urge Trump to resign after Jan. 6 riot",
  "image": "https://image.cnbcfm.com/api/v1/image/106917394-1627392370858-gettyimages-1234227567-CapitolHill.jpeg?v=1650632761&w=740&h=416&ffmt=webp",
  "link": "https://www.cnbc.com/2022/04/22/liz-cheney-denies-taping-kevin-mccarthy-discussing-trump-resigning-after-jan-6.html",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Breuninger",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1311,
    1609,
    1668,
    1765,
    2087,
    3094,
    234,
    571
  ],
  "sentences": [
    "But I don't know.?\nCNBC Politics\nRead more of CNBC's politics coverage:\nRussia declares intent to control Donbas and southern Ukraine; new mass graves found near Mariupol\nBiden announces a new program to help Ukrainian refugees enter the U.S.\nPennsylvania's GOP Senate primary draws backing from some of Wall Street's biggest billionaires, making it one of the most expensive midterm races\nOn Friday, Martin and Burns appeared on CNN, where they shared another clip of McCarthy talking to House Republican leaders shortly after the riot.",
    "McCarthy on Thursday released a statement calling the Times' reporting on him totally false and wrong.? He accused the corporate media? of furthering a liberal agenda? and added that the Biden presidency has shown that America was better off when President Trump was in the White House.?\nThe Times' report also includes a denial from McCarthy spokesman Mark Bednar, who claimed that the GOP leader never said he'd call Trump to say he should resign.?\nBut the audio clip shared Thursday night appears to contradict that claim.",
    "A spokesperson for Cheney, one of two Republicans on the House select committee probing the Capitol riot, said in a statement Friday morning that the congresswoman did not record or leak the tape and does not know how the reporters got it.?\nThe select committee has asked Kevin McCarthy to speak with us about these events but he has so far declined,? the spokesperson said.",
    "Jabin Botsford | The Washington Post | Getty Images\nRep. Liz Cheney on Friday denied recording or leaking audio from a phone call that appears to show House Minority Leader Kevin McCarthy saying he would tell then-President Donald Trump to resign after the Jan. 6 Capitol riot.",
    "He added that an impeachment effort against Trump would definitely pass the House and likely the Senate, even if the final vote came after Trump was set to leave office on Jan. 20, 2021.\nBut what I think I'm going to do, is I'm going to call him,? McCarthy said.",
    "The remarks came days after a mob of Trump's supporters, spurred by the then-president's false claims that widespread fraud cost him the 2020 election, stormed the Capitol and disrupted lawmakers' confirmation of President Joe Biden's victory.",
    "The newspaper's report is based on details from the forthcoming book, This Will Not Pass: Trump, Biden and the Battle for America's Future,? by Times reporters Alexander Burns and Jonathan Martin, who obtained the audio tapes of McCarthy.",
    "In a call with top Republicans  apparently the same call where one of the audio clips came from  McCarthy also wondered aloud if tech companies could suspend the social media accounts of some Republican lawmakers, the Times reported.",
    "Though he lost the 2020 election to Biden and has continued to spread conspiracy theories to suggest that race was rigged against him, Trump is the most popular figure in the GOP and its de facto leader.",
    "In the audio clip, the California Republican can be heard telling Cheney, R-Wyo., that he believed Trump would be impeached in the House and possibly convicted in the Senate after the Jan. 6 riot.",
    "The New York Times on Thursday reported that McCarthy and other GOP leaders, including Senate Minority Leader Mitch McConnell, initially vowed to kick Trump out of politics after the Jan. 6 riot.",
    "There's a lot of different ramifications for that.?\nThe only discussion I would have with him is that I think this will pass, and it would be my recommendation you should resign,? McCarthy said.",
    "The spokesman also did not immediately explain the contradiction between McCarthy's recorded remarks and his prior statement, which denied that McCarthy said he would push Trump to resign.",
    "A portion of that call, dated Jan. 10, 2021, aired Thursday night on MSNBC's The Rachel Maddow Show.? Hours earlier, McCarthy denied saying he would tell Trump to step down.",
    "The only discussion I would have with him is that I think this will pass, and it would be my recommendation you should resign,? McCarthy said, according to the recording.",
    "Less than three weeks after the calls, McCarthy traveled to Trump's Mar-a-Lago resort home in Palm Beach, Fla., to discuss political strategies for the 2022 midterms.",
    "The bombshell recordings could threaten McCarthy's hopes of becoming speaker of the House if Republicans retake control of the chamber in the 2022 midterm elections.",
    "He bears responsibilities for his words and actions, no ifs, ands or buts,? McCarthy said in the Jan. 11, 2021, recording, which was also obtained by MSNBC.",
    "Republicans removed her from the post last year after she voted to impeach Trump and criticized him for his role in the Capitol attack.",
    "Rep. Liz Cheney, R-Wyo., speaks about the Jan. 6 Select Committee on Capitol Hill on Wednesday, July 21, 2021 in Washington, DC.",
    "I've had it with this guy,? McCarthy told a group of Republican leaders in the days after the attack, according to the Times.",
    "I know this is very tough, but what I want to do, especially through here is, I don't want to rush things,? McCarthy added.",
    "The vast majority of House Republicans  who would vote on whether to make McCarthy speaker  have stayed loyal to Trump.",
    "In the recording, Cheney referenced the 25th Amendment  a constitutional process for removing a president from office.",
    "In it, McCarthy tells top House Republicans that Trump admitted he bears some responsibility for the Capitol riot.",
    "They quickly backed off due to fears of retribution from Trump and his supporters, according to the newspaper.",
    "I haven't talked to him in a couple days.?\nMcCarthy said he doubted that Trump would agree to step aside.",
    "Nobody can defend that, and nobody should defend it,? McCarthy said, according to the latest recording.",
    "Is there any reason to think that might happen??\nMcCarthy responded: I've had a few discussions.",
    "A spokeswoman for Trump did not immediately respond to a request for comment on those remarks.",
    "The House impeached Trump for incitement of insurrection during his final days in office.",
    "Later Friday, news outlets aired a separate audio clip of McCarthy from Jan. 11, 2021.",
    "A spokesman for McCarthy did not immediately respond to CNBC's request to comment.",
    "I asked him personally today, does he hold responsibility for what happened?",
    "Cheney was a member of McCarthy's leadership team at the time of the call.",
    "Let me be very clear to all of you, and I am very clear to the president.",
    "She then asked McCarthy, What happens if it gets there after he's gone?",
    "Can't they take their Twitter accounts away, too?? he reportedly asked.",
    "Um, I mean that would be my take, but I don't think he would take it.",
    "I'm seriously thinking of having that conversation with him tonight.",
    "Nobody can defend that, and nobody should defend it,? he said.",
    "He told me he does have some responsibility for what happened.",
    "The Senate acquitted Trump after Biden's inauguration.",
    "McCarthy and McConnell both voted against the efforts.",
    "He has hinted he will run for president again in 2024.",
    "And he needed to acknowledge that,? McCarthy said.",
    "Just 10 House Republicans voted for impeachment.",
    "Does he feel bad about what happened?",
    "Are you hearing that he might resign?",
    "What he did is unacceptable.",
    "What he did is unacceptable.",
    "I've had it with this guy.",
    "I know this is not great.",
    "Is, is there any chance?",
    "I know this is not fun.",
    "My gut tells me no."
  ]
}