{
  "id": 157,
  "mediaId": 151,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Oh Kevin, my Kevin",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/04/22/lordy-roll-the-tapes-00027140",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Oh Kevin",
  "authorUrl": "https://www.politico.com/staff/katherine-tully-mcmanus",
  "termIds": [
    2087,
    2505,
    2505,
    1609,
    2087,
    858,
    858,
    1609,
    1248,
    1248,
    1147,
    1147,
    571,
    571,
    119,
    119,
    2942,
    2942,
    2590,
    2590
  ],
  "sentences": [
    "QUICK LINKS\nRepublican congressional candidate's wildly homophobic fundraising blast accuses his enemies of being 'sodomite predators' and 'LGBT groomers', from Warren Rojas at Business Insider\nUkrainian President Zelensky, Rep. Liz Cheney among 5 recipients of JFK Profile in Courage Award, from Travis Andersen at The Boston Globe\nSenate front-runner in Pennsylvania embraces Biden and progressive agenda amid Democrats' midterm dilemma, from Manu Raju, Alex Rogers and Ali Zaslav at CNN\nTRANSITIONS\nGrace Bobertz is now director of scheduling for Sen. Michael Bennet (D-Colo.).",
    "MARJORIE AT THE MIC  The Atlanta Journal Constitution's Tia Mitchell previews this morning's hearing in Georgia on Greene's eligibility to run for a second term, where the bombastic lawmaker is expected to speak: Marjorie Greene expected to testify in hearing on challenge to her candidacy\nHUDDLE HOTDISH\nBest happy hour architecture A super convenient, close to the Capitol happy hour spot with a stunning view?",
    "A spokesperson for Cheney told our own Kyle Cheney (no relation) that she did not record or leak the tape and does not know how the reporters got it.? The spokesperson added: The select committee has asked Kevin McCarthy to speak with us about these events but he has so far declined.?\nReality check: McCarthy blamed Trump for the attack on the Capitol in a floor speech, but pivoted hard soon after.",
    "Back to the tapesMcCarthy called a New York Times report that detailed Republican leaders' push for the party to move on from Trump's grip following the attack on the Capitol \"totally false and wrong\" while asserting that the country was \"better off when President Trump was in the White House.? But last night, NYT's Jonathan Martin and Alex Burns rolled their tapes of McCarthy's conversations.",
    "RELATED: Mystery drone: How the Air Force fast-tracked a new weapon just for Ukraine, from Lee Hudson and Paul McCleary\nFIRST IN HUDDLE: GROUPS URGE BIDEN TO OPPOSE TITLE 42 BILL A cohort of 37 immigrant, labor and civil rights groups are urging the Biden administration to \"loudly and clearly\" defend its plan to end pandemic-era border restrictions, known as Title 42.",
    "Oh Kevin, my Kevin\nBy KATHERINE TULLY-MCMANUS\n04/22/2022 07:57 AM EDT\nPresented by Connected Commerce Council\nWith help from Marianne LeVine\nLORDY, ROLL THE TAPES  House Minority Leader Kevin McCarthy flatly denied Thursday that he ever planned to tell former president Donald Trump to resign following the Jan. 6, 2021 insurrection.",
    "Playing by House rules: Speaker Nancy Pelosi (D-Calif.) said Thursday she plans to take up aid \"as soon as we can next week,\" though her spokesman, Drew Hammill, clarified that there is \"no specific timeline for a floor vote at this time.? More from Andrew on the path ahead for Ukraine aid.",
    "NBC News's Natasha Korecki dives into Nevada's Democratic organization, the influence Harry Reid still holds months after his death and how the establishment players and the progressive wing of the party are eying a united front headed into the midterm elections.",
    "Also on immigration... A bipartisan effort to find common ground on immigration policy kicks off next week with a press conference Wednesday featuring Reps. Jess \"Chuy\" Garca (D-Ill.) and Dan Newhouse (R-Wash.) along with faith leaders and immigration advocates.",
    "Advocacy groups participating in the event and meetings on the Hill next week include National Catholic Council for Hispanic Ministry (NCCHM), Americans for Prosperity (AFP), the LIBRE Initiative (LIBRE), American Hort, and the National Immigration Forum (NIF).",
    "Next week, the president said he will be asking for more in order to sustain Ukraine for the duration of this fight? and keep weapons and ammunition flowing without interruption.?\nNeed for speed: Lawmakers want to move on this, and fast.",
    "COMING IN HOT  When Congress returns from the two week recess next week, lawmakers want to hit the ground running on another aid package for Ukraine as the besieged country's defense against Russian invasion begins a new phase.",
    "President Joe Biden announced an additional $800 million in military aid for Ukraine on Thursday, but revealed that the expenditure has almost exhausted? the fund Congress created with its most recent aid package.",
    "Sen. Chris Murphy (D-Conn.) told reporters on a conference call from the Balkans that he is open to any pathway that is the fastest? to get both Ukraine aid and Covid assistance to the president's desk.",
    "Sen. Jacky Rosen (D-Nev.), asked by Korecki about the growing influence of Democratic Socialist leaders is a sign the party needs to broaden beyond the Reid legacy, she didn't acknowledge any split.",
    "James Lankford (R-Okla) and Kyrsten Sinema (D-Ariz) that would delay ending Title 42 without a detailed plan to address an anticipated surge of migrants at the border or similar proposals.",
    "TRIVIA\nTHURSDAY'S WINNER: Bruce Mehlman correctly answered that the mission to capture Saddam Hussein was code-named Red Dawn and two farmhouses were dubbed Wolverine 1 and Wolverine 2.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Friday, April 22, where we know that we're still saying tapes? when no one is using actual tapes anymore.",
    "The letter comes as the Biden administration is facing increasing pressure from vulnerable Democratic Senate incumbents and moderates to change course and postpone ending Title 42.",
    "Within a month, McCarthy was meeting with Trump at Mar-a-Lago and by May 2021, Cheney was ousted from her leadership role in the Republican Conference for criticizing Trump.",
    "But Sen. Thom Tillis (R-N.C.), also on the Balkans trip, warned against Senate Majority Leader Chuck Schumer's (D-N.Y.) plan to tie the Ukraine and Covid aid together.",
    "\"The previous administration did its best to unravel that commitment; we implore you to ensure that this Administration and Congress do not finish the job for them.\"",
    "Democrats are eying Nevada as the first presidential primary contest in the country in 2024 and Las Vegas is a potential site of the Democratic National Convention.",
    "He planned to warn Trump of an impending impeachment resolution: \"I think this will pass, and that would be my recommendation you should resign,\" McCarthy said.",
    "If that [Covid aid] discussion is going to take a matter of weeks, we have to make a decision on Ukrainian support in a matter of hours or days,? Tillis said.",
    "Starting May 5, the Library of Congress is extending its hours and offering happy hour food and drinks in the Great Hall overlooking the Capitol.",
    "In a letter to President Joe Biden sent Thursday evening, the groups called on the administration to \"forcefully oppose\" legislation from Sens.",
    "With the most loyal Trump-ist members, like Reps. Matt Gaetz (R-Fla.) and Marjorie Taylor Greene (R-Ga.) grow the ranks of McCarthy skeptics?",
    "It is too soon to say whether McCarthy's effort to lock down votes for the House speakership could be scuttled by these revelations.",
    "I'm seriously thinking of having that conversation with him tonight,\" McCarthy told then-GOP Conference Chair Liz Cheney (Wyo.).",
    "(In contrast, Senate Minority Leader Mitch McConnell hasn't spoken to Trump since his supporters laid siege to the Capitol.)",
    "And they tell a very different story and catch McCarthy (R-Calif.), who has long coveted the speaker's gavel, in a lie.",
    "And of course there's the rank-and-file Republicans, which these days include former McCarthy foes who he won over.",
    "But it could get tangled on the same thorny immigration issue that tanked $10 billion in Covid aid in recent weeks.",
    "Listen for yourself to McCarthy tell colleagues about his plans to call Trump and ask him to resign the presidency.",
    "They are looking for solutions centered on border security, certainty for Dreamers, and the agricultural workforce.",
    "TODAY'S QUESTION from Bruce: Who was the last U.S. President with a mustache, and who was the last to have a beard?",
    "I can tell you this: A coordinated campaign over the last how many years has turned Nevada blue, Rosen said.",
    "\"Four decades ago, Congress unanimously committed to welcome those seeking refuge,\" the groups wrote.",
    "They further requested an \"urgent\" meeting with Biden and his staff to discuss the Title 42 policy.",
    "\"From what I know of him  I mean, you guys know him too  do you think he would ever back away?\"",
    "The shakeout: House Republicans have turned on McCarthy for much less than this in the past.",
    "She most recently was director of scheduling for Sen. Kirsten Gillibrand (D-N.Y.).",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "\"That would be my take, but I don't think he would take it, but I don't know.\"",
    "Will he turn on my Kevin? and sway loyal House members to abandon McCarthy?",
    "REID'S MACHINE It's still running, even without the man who built it.",
    "And that was before Trump had a stranglehold on House Republicans.",
    "(The fugitive dictator was caught at a third farmstead nearby.)",
    "AROUND THE HILL\nClosing out the week on a quiet note.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "TODAY IN CONGRESS\nThe House and Senate are out.",
    "GET HUDDLE emailed to your phone each morning.",
    "Send your answers to ktm@politico.com.",
    "But\nBut the conversations are on tape.",
    "Plenty depends on Trump himself.",
    "First in the nation?",
    "Read the letter.",
    "GOOD MORNING!"
  ]
}