{
  "id": 158,
  "mediaId": 238,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Post Politics Now Leader McCarthy, Rep. Greene both have some explaining to do about Jan. 6",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/22/kevin-mccarthy-greene-insurrection/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1609,
    883,
    883,
    1147,
    1147,
    1596,
    1596,
    1609,
    525,
    428,
    539,
    539,
    525,
    428,
    2590,
    2590,
    2888,
    2888
  ],
  "sentences": [
    "But the MAGA squad,? made up of Reps. Marjorie Taylor Greene (R-Ga.), Matt Gaetz (R-Fla.) and others, have long kept mum on whether they would support him as their speaker in the majority.McCarthy has said he would put Greene and Rep. Paul A. Gosar (R-Ariz.) back on better committees after Democrats ousted them, a move many colleagues saw as a peace offering.But the group has heavily criticized him since, insinuating he's a weak leader for allowing Republicans to vote with Democrats on infrastructure and not showing his cards on kicking Reps. Adam Kinzinger (R-Ill.) and Liz Cheney (R-Wyo.)",
    "The Post's Matthew Brown and Felicia Sonmez report that in his opening statement, Ron Fein, legal director for Free Speech for People, the group trying to dislodge Greene, said that this was not the type of insurrection where the leaders were standing in Richmond, Virginia, giving long-winded speeches.?\nRather, the leaders of this insurrection, of whom there were a number, were among us  on Facebook, Twitter and corners of social media that would make your stomach hurt.",
    "And that could help McCarthy retain his standing atop the House GOP.The two have enjoyed an occasionally rocky but ultimately mutually beneficial relationship since Trump launched his presidential campaign in 2015.McCarthy previously weathered another secret-tape episode in 2017, when The Washington Post published audio of him suggesting, without evidence, in a 2016 leadership meeting that Trump was on the Kremlin payroll.",
    "The 1-minute audio clip from Jan. 10, 2021, was published after McCarthy disputed a report earlier Thursday that he and Senate Minority Leader Mitch McConnell (R-Ky.) had privately pledged to push Trump out of politics following the Capitol attack by a pro-Trump mob, The Post's Felicia Sonmez and Julian Mark report:\nDuring the call, Rep. Liz Cheney (R-Wyo.)",
    "The spot from Perdue, the former U.S. senator whose gubernatorial bid is strongly backed by former president Donald Trump, refers to illegal border crossings, higher gas prices, inflation, the war in Ukraine and the woke mob.?\nFolks, that all started right here when Brian Kemp sold us out and allowed radicals to steal the election,? Perdue tells viewers.",
    "Greene's lawyer, James Bopp, argued that Free Speech for People wants to deny the right to vote to the thousands of people in the 14th District of Georgia by having Greene removed from the ballot.?\nVoters have a right to vote for the candidate of their choice unless there is very compelling legal  not rhetorical  justification for that,? Bopp said.",
    " House Minority Leader Kevin McCarthy (R-Calif.) will have some explaining to do after leaked audio contradicts his claim that he didn't want President Donald Trump to resign after the Jan. 6 attack on the Capitol.It's possible no other group will demand an answer more than the pro-Trump allies in his conference.",
    "Return to menu\nThe Post is now reporting that former president Donald Trump and House Minority Leader Kevin McCarthy (R-Calif.) spoke on the phone Thursday night about newly released audio of McCarthy telling Republican leaders that Trump should resign in the wake of the Jan. 6, 2021, attack on the Capitol.",
    "Mike DeBonis: Why McCarthy could survive  For all the shock the political world felt at hearing House Minority Leader Kevin McCarthy (R-Calif.) say out loud that he would counsel President Donald Trump to resign, there's reason to believe that it may not have been quite so shocking to Trump and his allies.",
    "Writing in The Climate 202, The Post's Maxine Joselow notes that Environmental Protection Agency Administrator Michael Regan on Tuesday toured the hometown of Rep. Marcy Kaptur (D-Ohio), while Energy Secretary Jennifer Granholm on Thursday made a trip to Southern California with Rep. Mike Levin (D-Calif.).",
    "The reform group alleges that Greene, who has become a lightning rod for controversy and has gained a reputation as one of the Republican Party's most hard-right members, helped facilitate the ransacking of the Capitol by a pro-Trump mob in an attempt to stop the confirmation of Biden's presidential win.",
    "Maxine writes:\nWhile experts said the appearances did not violate a federal law barring government officials from engaging in political activities, the events highlight Democrats' anxiety about heavy losses in the midterms, which would probably prevent the passage of ambitious climate legislation.",
    "Glenn writes that Meadows has been particularly active in seeking to combat election fraud and that voter-list maintenance is one of the dividing lines in American politics:\nRepublicans argue that if voter-registration records are not regularly purged and updated, election fraud can take place.",
    "That wasn't enough, McLeod-Skinner said: Schrader had worked to separate? the infrastructure package from President Biden's social spending plan, setting aside provisions that would help to protect our climate? and lower prescription drug costs, all of it at the request of corporate donors.",
    "And it was no secret to Trump that McCarthy had qualms about his behavior surrounding Jan. 6.McCarthy, however, played a key role in Trump's political rehabilitation by visiting him at Mar-a-Lago and declaring him a partner in his quest to regain the House majority in 2022.",
    "House Republicans are still waiting for a firm statement from Trump, according to multiple GOP aides, on how to determine whether they should still back McCarthy as their current leader and potential speaker if the GOP regains the majority in the November election.",
    "I said, That's exactly what it means.' ?\nThe Post's Aaron Blake and Michael Birnbaum report that the comments, an apparent reference to NATO's 2018 summit in Brussels, were the most extensive account from Trump himself about his mind-set and intentions at the time.",
    "That downside is that doing so exposed fissures in the party between those who want to tout the bipartisan achievement last year and those who thought the party bungled an opportunity to go much further and also pass Biden's broader Build Back Better? agenda.",
    "Republicans are not fit to govern, and Republican majorities would mean little more than complete subservience to Donald Trump.?\nDemocrats are bracing for what could be a tough midterm election year with their control of both chambers at risk.",
    "Return to menu\nBoth sides have now delivered opening statements in an Atlanta courtroom ahead of highly anticipated testimony from Rep. Marjorie Taylor Greene (R-Ga.) in a case that could determine whether she remains on the ballot this year.",
    "McCarthy can be heard discussing the possibility of urging Trump to resign during a phone call with other Republican leaders in the wake of the Jan. 6, 2021, attack on the Capitol, according to audio published Thursday by the New York Times.",
    "Trump was not upset about McCarthy's remarks, according to two people familiar with the conversation who spoke on the condition of anonymity, according to our report by Felicia Sonmez, Julian Mark, Jacqueline Alemany and Marianna Sotomayor.",
    "Return to menu\nIt turns out that until last week, Mark Meadows, the former White House chief of staff to President Donald Trump, was simultaneously registered to vote in three different states  North Carolina, Virginia and South Carolina.",
    "Brian Kemp, takes his unsubstantiated claims of election fraud to a new place in a new ad, in which Perdue suggests some of the country's major problems flowed from Kemp's not intervening to overturn Biden's victory in the state in 2020.",
    "Return to menu\nHouse Minority Leader Kevin McCarthy (R-Calif.), who is angling to be the chamber's next speaker and has labored to stay on the good side of former president Donald Trump, seems to have been contradicted by his own words.",
    "Since then, the two men have largely avoided public spats while Trump has shown a willingness to overlook past slights for the sake of political expediency.The larger question is, would it benefit Trump to publicly ditch McCarthy now?",
    "Return to menu\nWhile in office, President Donald Trump openly questioned whether the United States should abide by NATO's Article 5 collective-defense clause, particularly if member countries didn't pay more for the alliance.",
    "Writing in The Early 202, The Post's Theodoric Meyer and Jacqueline Alemany have the latest on Gallego's thinking, as well as thoughts from the congressman on what Democrats more broadly need to do to win over Latino voters.",
    "Anyone who breaks their oath to support the Constitution and help facilitate an insurrection is a danger to the entire country and cannot be trusted,? Ron Fein, Free Speech for People's legal director, said in an interview.",
    "The GOP is angling for midterm gains, and McCarthy has helmed a vast apparatus preparing the party for power  raising tens of millions of dollars for GOP candidates and prepping legislative plans for the next Congress.",
    "In a curtain raiser, The Post's Matthew Brown writes that the case against Greene was brought by Free Speech for People, a campaign-finance reform organization, on behalf of a group of voters from Greene's district.",
    "Today, the Jan. 6, 2021, insurrection looms large in two separate controversies, one involving House Minority Leader Kevin McCarthy (R-Calif.), the other focused on freshman Rep. Marjorie Taylor Greene (R-Ga.).",
    "The audio includes an exchange between Cheney and McCarthy, while she was still part of House GOP leadership, about President Donald Trump possibly resigning following the Jan. 6, 2021, attack on the Capitol.",
    "Writing the Trailer, The Post's David Weigel details the dynamic in one Democratic congressional primary in Oregon, a state Biden visited Thursday to highlight what the infrastructure bill means for airports.",
    "Writing in Fact Checker, Glenn reports that the overlap lasted about three weeks, and says it might have continued if revelations about Meadows's voting record had not attracted scrutiny in North Carolina.",
    "Return to menu\nAhead of the scheduled testimony under oath Friday from Rep. Marjorie Taylor Greene (R-Ga.), she and those trying to remove her from the ballot are offering their takes on what's at stake.",
    "On Thursday night, audio surfaced of McCarthy, during a call with other Republican leaders, pushing the idea that President Donald Trump should resign in the wake of the pro-Trump riot at the Capitol.",
    "That revelation, courtesy of The Post's Glenn Kessler, is the latest in reports about election-related behavior by Meadows that appear to contradict his and his party's rhetoric on election integrity.",
    "McCarthy added that he would tell Trump, as Democrats pushed forward with plans to again impeach the president, that it would be my recommendation you should resign,? according to the audio clip.",
    "In an appearance Thursday night at a Heritage Foundation event in Florida, he offered his most explicit statement to date that he had threatened not to defend NATO allies from attacks by Russia.",
    "Greene, meanwhile, will field questions about her role leading up to that day during a court hearing in Atlanta where activists are challenging her right to appear on the ballot this year.",
    "The audio, which surfaced Thursday night, contradicted McCarthy's claim earlier in the day that he didn't push for Trump to resign after the deadly insurrection by a pro-Trump mob.",
    "[A fellow leader] said, Does that mean that you won't protect us in case  if we don't pay, you won't protect us from Russia'  was the Soviet Union, but now Russia,? Trump said.",
    "Democrats push back that too many voter-list purges are conducted haphazardly, removing eligible voters who don't learn they are no longer listed until they show up to vote.",
    "They want to talk about the big lie?' This is the big lie, and they're destroying democracy,? Greene said of the case during an interview Tuesday with One America News.",
    "Aaron and Michael write:\nThey don't fully jibe with how others described the conversations at the time, although they may still be an accurate window how he felt.",
    "Return to menu\nRep. Ruben Gallego (D-Ariz.) has mused about mounting a primary challenge to Sen. Kyrsten Sinema (D-Ariz.) in 2024, when she's up for reelection.",
    "Return to menu\nTwo of Biden's Cabinet members made Earth Week appearances in the districts of congressional Democrats facing potentially tough reelection races.",
    "Each weekday, we'll guide you through the news with assists from some of the best political reporters in the business providing insights and analysis.",
    "His quest to become speaker has led him to be deferential to all wings of his conference in the hopes of earning enough support when the day comes.",
    "Return to menu\nCongressional Democrats have struggled to pick a midterm message but recently they've leaned heavily into running on infrastructure.",
    "is seeking to make clear that a leaked audio of a conversation she had with House Minority Leader Kevin McCarthy (R-Calif.) did not come from her.",
    "Return to menu\nHouse Minority Leader Kevin McCarthy (R-Calif.) isn't taking cues about his future from the Democratic National Committee.",
    "Representative Cheney did not record or leak the tape and does not know how the reporters got it,\" Cheney's office said in a statement.",
    "The statement also noted that McCarthy has so far declined to appear before the House select committee investigating the insurrection.",
    "I'll make sure our elections are never stolen again.?\nBiden still would have won the presidency if Trump had prevailed in Georgia.",
    "Welcome to Post Politics Now, a new live experience from The Washington Post that puts the day's political headlines into context.",
    "The group has notably remained silent in this moment, but its reaction moving forward can affect whether McCarthy gets the gavel.",
    "The complainants are arguing that her actions leading up to the Jan. 6, 2021, Capitol insurrection should disqualify her.",
    "McCarthy said he was doubtful, but I'm seriously thinking of having that conversation with him tonight,? McCarthy said.",
    "But that didn't stop the party organization from weighing in on the controversy over his leaked audiotapes.",
    "Kevin McCarthy is a fraud and a liar,? DNC spokesperson Ammar Moussa said in a statement Friday.",
    "A public break between the two men could inject new chaos into the party at a critical moment.",
    "From Bend, Ore., Dave writes:\nRep. Kurt Schrader (D-Ore.) wanted to talk about infrastructure.",
    "Return to menu\nDavid Perdue, who is mounting a Republican primary challenge to Georgia Gov.",
    "At 3 p.m. weekdays, return to this space and we'll address what's on the mind of readers.",
    "Sinema has drawn the ire of some in her party for helping block portions of its agenda.",
    "Gallego is chairman of BOLD PAC, the campaign arm of the Congressional Hispanic Caucus.",
    "Neither McCarthy's nor Cheney's offices immediately responded to a request for comment.",
    "McCarthy, who is angling to be speaker, earlier had denied a report that he did this.",
    "Kemp has been leading Perdue in polling in the state's GOP primary for governor.",
    "Marianna Sotomayor: What will Trump allies have to say about the McCarthy audio?",
    "The evidence will show that Marjorie Taylor Greene was one of them,? Fein said.",
    "We'll be closely watching to see what McCarthy in particular has to say today.",
    "McCarthy said he did not think his effort would persuade Trump.",
    "Kemp is just another establishment politician who fought Trump.",
    "For them, disarray among Republicans is a welcome development.",
    "She has made clear she's not happy about having to do this.",
    "Meadows is still registered in Virginia and South Carolina.",
    "asked whether there was any chance Trump would resign.",
    "Return to menu\nThe office of Rep. Liz Cheney (R-Wyo.)",
    "Cheney is vice chairwoman of that panel.",
    "So did his Democratic primary opponent.",
    "And it is not clear that it would.",
    "Got a question about politics?",
    "What will Trump have to say?",
    "We could find out today.",
    "from the GOP conference.",
    "Enough is enough.",
    "Submit it here."
  ]
}