{
  "id": 161,
  "mediaId": 25,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "McCarthy told fellow GOP leaders he was \"seriously thinking\" about telling Trump to resign after Jan. 6, recording shows",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2021/01/28/dd17fca0-e179-47e2-8712-307593984ec5/thumbnail/620x413/c7b1b849d69eabb55ca5459bed9ed05e/trump-mccarthy.jpg",
  "link": "https://www.cbsnews.com/news/kevin-mccarthy-trump-resign-january-6-recordings-tape/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Kaplan",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1311,
    1609,
    1668,
    2214,
    3094,
    296,
    428,
    2661
  ],
  "sentences": [
    "Jack Turman and Nikole Killion contributed to this story\n2022 Midterm Elections\n More\n McCarthy considered telling Trump to resign after Jan. 6, recording shows\n Bernie Sanders hasn't ruled out third run for presidency\n Florida legislature passes map that could give GOP more U.S. House seats\n Tennessee GOP kicks Trump-backed candidate off congressional primary ballot\n McConnell-affiliated group reserves $141 million in fall ad buys\n More\nIn:\nDonald Trump\nKevin McCarthy\n Rebecca Kaplan\nRebecca Kaplan covers Congress for CBS News.",
    "An audio recording released Thursday confirmed that House Minority Leader Kevin McCarthy told his fellow Republican leaders he was \"seriously thinking\" about recommending that former President Trump resign in the wake of the January 6 attack on the Capitol.",
    "Handout / Save America\nHe also mentions he has a \"personal fear\" of getting into any conversations about \"Pence pardoning,\" and acknowledges he had discussions about the 25th Amendment, which dictates how the president could be removed from office.",
    "Ultimately, just seven Senate Republicans voted to convict Trump during his impeachment trial, while others who criticized his behavior  including McConnell  argued that it was unconstitutional to impeach a former president.",
    "The audio was published by New York Times reporters Jonathan Martin and Alex Burns, who detailed an account of the meeting in a story published on Thursday and adapted from their book, \"This Will Not Pass.\"",
    "The Times also reported Senate Minority Leader Mitch McConnell told his advisers after the Capitol attack, \"If this isn't impeachable, I don't know what is,\" in reference to the upcoming impeachment vote.",
    "In the recording, McCarthy goes on to tell his leadership team that the impeachment resolution being crafted by Democrats would pass the House, and that he believes it might pass the Senate too.",
    "In the January 10 meeting, Wyoming Rep. Liz Cheney  who was the chairwoman of the Republican conference at the time  asks McCarthy if there's any chance Trump would resign.",
    "He blamed Trump for the riots at the Capitol, and, with an impeachment resolution on the horizon from Democrats, he planned to tell the former president to resign.",
    "On January 13, 2021, he gave a speech on the House floor in which he said \"the president bears responsibility for Wednesday's attack on Congress by mob rioters.",
    "The recording, which was taken during a House Republican leadership meeting last year, was released just hours after McCarthy denied the episode in a statement.",
    "According to the Times story  but not featured in the audio released Thursday night  McCarthy told other Republican leaders, \"I've had it with this guy.\"",
    "In a statement after the Times story was published Thursday, but before the audio was released, McCarthy called the reporting \"totally false and wrong.\"",
    "\"The select committee has asked Kevin McCarthy to speak with us about these events but he has so far declined,\" Cheney's spokesman said in a statement.",
    "\"The only discussion I would have with him is that I think this will pass, and it would be my recommendation you should resign,\" McCarthy says.",
    "He went on to accuse the \"corporate media\" of trying to profit off of \"manufactured political intrigue from politically-motivated sources.\"",
    "Shortly after the audio was released Thursday evening, Illinois Republican Adam Kinzinger said the Minority Leader should be \"ashamed.\"",
    "But later that month, he sought to repair his relationship with the former president, who still held enormous sway over the GOP base.",
    "\"It comes as no surprise that the corporate media is obsessed with doing everything it can to further a liberal agenda,\" he wrote.",
    "FILE: Former President Trump and House Minority Leader Kevin McCarthy meet at Mar-a-Lago in Palm Beach, Florida, on Jan. 28, 2021.",
    "He also told other House Republican colleagues that Trump's behavior the day of the attack was \"atrocious and totally wrong.\"",
    "If the reporters were interested in truth why would they ask for comment after the book was printed?\"",
    "\"Representative Cheney did not record or leak the tape and does not know how the reporters got it.\"",
    "Nobody can defend that and nobody should defend it,\" he said, according to the Times.",
    "\"Question for Kevin McCarthy, @GOPLeaderhow can you honestly feel ok with the lies?\"",
    "He also predicted there would be a strong bipartisan vote to convict in the Senate.",
    "\"That would be my take, but I don't think he would take it, but I don't know.\"",
    "McCarthy's office did not return a request for comment late Thursday evening.",
    "He should have immediately denounced the mob when he saw what was unfolding.\"",
    "Some of McCarthy's frustrations with the president did play out publicly.",
    "I'm seriously thinking about having that conversation with him tonight.",
    "A spokesperson for Cheney said she did not record or leak the tape.",
    "He visited Trump's Mar-a-Lago home and posed for pictures with him.",
    "I haven't talked to him in a couple of days,\" McCarthy says.",
    "A McConnell spokesman did not return a request for comment.",
    "\"This promotional book tour is no different.",
    "\"What he did is unacceptable.",
    "\"My gut tells me no.",
    "Kinzinger tweeted.",
    "Twitter"
  ]
}