{
  "id": 170,
  "mediaId": 209,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "The case for exiling Manchin and Sinema from the Democratic Party",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1650464067/manchin%20slingshot.jpg",
  "link": "https://theweek.com/politics/1012693/the-case-for-exiling-manchin-and-sinema-from-the-democratic-party",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Faris",
  "authorUrl": "https://theweek.com/authors/david-faris",
  "termIds": [
    2087,
    1765,
    1765,
    2505,
    2505,
    2411,
    2436,
    2436,
    2411,
    2087,
    837,
    837,
    1341,
    1335,
    1341,
    1454,
    1454,
    1248,
    1335,
    1299,
    1299,
    1147,
    1007,
    1007,
    1248,
    1223,
    1223,
    1147,
    428,
    562,
    562,
    255,
    255,
    146,
    146,
    428,
    2976,
    2976
  ],
  "sentences": [
    "New book: GOP leaders' anger toward Trump faded fast post-Jan. 6\nStadium bag rules are out of control\nFAA enshrines 'zero tolerance' policy on unruly passengers\nTrump calls Piers Morgan a 'fool' for thinking the 2020 election was 'free and fair'\nAmerica's navy is vulnerable, too\nMajority of U.S. voters think world would be better off without Putin presidency\nRussia's sunken flagship Moskva is literally irreplaceable, shrouded in intrigue",
    "Here is a partial list of things that have not happened almost exclusively because of Manchin and/or Sinema's opposition: a federal minimum wage hike; an extension of the Child Tax Credit payments; paid family and medical leave; D.C. statehood; voting rights protections; a ban on partisan gerrymandering; universal pre-K and subsidized daycare; and investments in encouraging adoption of clean energy technologies and electric vehicles.",
    "But there are growing strategic reasons why Majority Leader Chuck Schumer (D-N.Y.) and his allies should make life so unbearable for Manchin and Sinema (both of whom aren't up for re-election until 2024) that they leave the party sometime before the 2022 midterms if one last push for even a microscopic version of the Build Back Better social investment package fails because of them.",
    "Considering that Jackson will get outvoted 6-3 or 5-4 for the next 20 years, that the electoral glow from the American Rescue Plan faded months ago, and that the single most important piece of it  increasing the child tax credit and turning it into an automatic monthly payment  was allowed to expire by these same Democrats, I would argue no.",
    "While Manchin and Sinema have occasionally roused themselves out of torpor to vote for things like the Bipartisan Infrastructure package, their votes have been needed on only a few important occasions  like the COVID relief bill from March 2021 and the 50-50 votes to make appointments to the National Labor Relations Board.",
    "You can throw in the confirmation of Supreme Court Justice Ketanji Jackson Brown, too, even though she got two Republican votes, since McConnell would have probably invented some kind of \"no confirmations in the spring before a midterm election year\" rule to prevent even giving her a committee hearing.",
    "After all, the fragile Manchin hardened his opposition to the president's signature legislative goal after his feelings were hurt by a December White House statement in which Jen Psaki accused him of \"a sudden and inexplicable reversal in his position, and a breach of his commitments to the president.\"",
    "Obviously not, but I'd rather take the 10 percent chance that this gamble works rather than the 99 percent certainty that Democrats are going to get blown out of the water in November if they play out the string begging for scraps from other members of their own party.",
    "Speaker Nancy Pelosi (D-Calif.) has mostly kept her caucus in line, but in the Senate, two Democrats  Joe Manchin (W.Va.) and Kyrsten Sinema (Ariz.)  are almost single-handedly responsible for torpedoing Biden's presidency.",
    "Second, the pair could be stripped of their committee assignments, after which Biden could deliver a speech arguing that Democrats who deliberately sabotage their party over and over again are not welcome in the big tent.",
    "Go on a judicial confirmation binge first, but don't be delusional about what can be achieved with Manchin playing impossible to get in what looks like a plan to run out the clock on behalf of his fossil fuel overlords.",
    "Are those achievements sufficient to justify the extraordinary amount of damage that has been done to the Democratic brand over the past year, almost all of it inflicted by Manchin and Sinema on their own party?",
    "The lingering pandemic and worsening inflation are up there, but the inability of congressional Democrats to capitalize on their narrow majorities in the House and Senate has been just as consequential.",
    "Make Mitch McConnell the face of Congress' refusal to act after the Supreme Court guts Roe v. Wade, as well as for his branch's inability to take radical action, like price caps, to battle inflation.",
    "Arizona now sports two Democratic senators, and its ongoing demographic transformation will likely work in Democrats' favor in the long term, despite this year's difficult national environment.",
    "One recent poll showed that for more than two-thirds of respondents, non-economic issues are the most important facing the country, with a plurality citing \"the government/poor leadership.\"",
    "The only way to rail against the \"do-nothing Senate\" is to make Republicans the villain, and the only way to do that is to give them a branch of government to play with for a few months.",
    "There is not one other Democrat roaming the Mountain State, which Trump won in 2020 by nearly 40 points, who could come anywhere near winning, let alone run a competitive race.",
    "Do I think Democrats should do this before exhausting every possible effort to get Manchin on board with any piece of legislation that could be called Build Back Better?",
    "First, Schumer could announce that the Democratic Party will not support re-election bids for Manchin and Sinema and will actively side with their primary challengers.",
    "Sinema has almost no chance of winning her Senate primary, and the country is too polarized now for her to run and win as an independent  la Joe Lieberman in 2006.",
    "A handful of federal judges and some solar panel tax credits are going to seem pretty hollow when Democrats are staring down years in the Senate wilderness.",
    "The two people who are holding it up are in the headline of this article, and neither has given any indication recently that they intend to budge.",
    "And if there's one sure thing about going on the warpath against Manchin and Sinema, it's that it would at least momentarily fill that void.",
    "Losing her seat now might mean going without it for just two years, at a time when Democrats are likely to be in the minority anyway.",
    "It air-fries my blood just gazing at the list of missed opportunities to transform America into a more equitable and livable country.",
    "It is hard to imagine either Manchin or Sinema refraining from a party switch in the aftermath of such public and dramatic rebukes.",
    "Democrats can't run against themselves here, because most people don't care whether it is two or 50 of them holding up the show.",
    "If the election were held today, Republicans would easily win the House, the Senate, and a number of swing-state governorships.",
    "Wouldn't that be passing control of the Senate majority to Mitch McConnell and the Republicans without even putting up a fight?",
    "Pushing Manchin out of the Democratic Party permanently changes the already tough calculus for securing a Senate majority.",
    "That sounds a lot like frustration with the failure of Congress to act on key priorities, or any priorities at all.",
    "After all, once Manchin leaves the party or loses his seat in the Senate, it is likely gone for a generation.",
    "But is that frustration worth the obvious downsides of voluntarily sacrificing the Senate majority this way?",
    "The best retort is that Democrats do not really have working legislative control of the Senate anyway.",
    "There are plenty of reasons that President Biden and the Democrats are in trouble this November.",
    "and Adam Kinzinger (Ill.) due to their support for the impeachment of former President Trump.",
    "The DNC could formally censure both senators, as the RNC did with GOP Reps. Liz Cheney (Wy.)",
    "Why would Schumer and the Democrats willingly give up their Senate majority?",
    "Nuclear war is inevitable\nIs Beijing paying attention to Russia's faceplant?",
    "Countdown to the Democrats' doomsday\nDemocrats could still win in November.",
    "It's a great question, to which I would respond: What legislative agenda?",
    "Finally, let's be clear-eyed about the bleak landscape facing Democrats.",
    "There is no legal mechanism to expel these miscreants from the party.",
    "Won't it be sunk by handing the majority back to Republicans?",
    "What about the Democratic legislative agenda in the Senate?",
    "And it may be prudent for Democrats to move on from them.",
    "In early February, Manchin declared the framework \"dead.\"",
    "I know what you're thinking: That's deranged!",
    "There is no such problem with Sinema.",
    "No, really."
  ]
}