{
  "id": 179,
  "mediaId": 237,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Kinzinger toys with primary challenge against Trump in 2024",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/e3d3296/2147483647/strip/true/crop/5649x2966+0+400/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fff%2Fb0%2Fa2a6410045c29a932fc66af493ce%2Fap22071122410777.jpg",
  "link": "https://www.washingtonexaminer.com/news/kinzinger-toys-with-primary-challenge-against-trump-in-2024",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan King",
  "authorUrl": "https://www.washingtonexaminer.com/author/ryan-king",
  "termIds": [
    1147,
    2214,
    3094,
    427,
    428,
    545,
    2707
  ],
  "sentences": [
    "Though toying with a run for governor, senator, and president, Kinzinger refrained from announcing further political ambitions following his retirement from Congress, a move he announced last year after unfavorable redistricting in his home state of Illinois.",
    "He joined the House committee investigating the Capitol riot alongside GOP Rep. Liz Cheney and has regularly berated the former president's efforts to overturn the 2020 election.",
    "Republican Rep. Adam Kinzinger said Monday that he would \"love\" to challenge former President Donald Trump in 2024, but he stopped short of committing to the showdown.",
    "But there's no grand plan right now.?\nKinzinger contended he is \"exhausted of the same arguments, the same kind of performative politics,\" particularly in the House.",
    "Since the fallout after the 2020 election, Kinzinger, who voted for Trump in that contest, has since become one of Trump's most vocal Republican foes in the House.",
    "Even if he crushed me, like in a primary, to be able to stand up and call out the garbage is just a necessary thing, regardless of who it is.",
    "I think it'd be fun.?\nTrump has flirted with announcing another run for the White House in 2024 but has not made any formal announcements.",
    "Kinzinger emphasized that he currently has no plans to run for president but is \"not going to rule it out,\" either.",
    "Kinzinger has endured heavy return fire from Trump, who has lambasted him as a \"Republican In Name Only.\"",
    "In February, the Republican National Committee voted to censure him for his work on the Jan. 6 committee.",
    "Look, if we're in a position, if it's just terrible candidates and the country's in a worse place?",
    "It's truly not anything I'm planning right now, but I'm not going to rule it out,? he said.",
    "\"I don't know what I identify with anymore,\" he told HuffPost about his political party.",
    "I really would,? he told the HuffPost about a primary challenge against Trump.",
    "But yeah, my time in the House is, mercifully, coming to an end,? he said.",
    "I'll make a decision when we get there, if there's a need and a desire.",
    "But he is open to vying for political office elsewhere in the future.",
    "Maybe I would have run for governor.",
    "Maybe I would have run for Senate.",
    "\"I'm just not a Democrat.\"",
    "I would love it.",
    "I don't know.",
    "Who knows?",
    "Maybe.",
    "..."
  ]
}