{
  "id": 182,
  "mediaId": 21,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Republican Rep. Adam Kinzinger says he 'would love' to run against Trump in 2024 'even if he crushed me'",
  "image": "https://i.insider.com/625d78a23958c2001823dce4?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/adam-kinzinger-donald-trump-2024-primary-crush-january-6-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    1896,
    1896,
    2214,
    2214,
    1147,
    1147,
    428,
    428,
    545,
    545,
    2707,
    2707
  ],
  "sentences": [
    "Recent polling shows that Trump remains popular with his party's base as he regularly teases his own comeback bid in 2024, and if anti-Kinzinger missives by House Republicans are any indication, he would likely face a steep uphill battle in a Republican presidential primary.",
    "He's also broken ranks with his party on several issues in the last year and a half, including voting to impeach Trump for incitement of an insurrection, voting to pass a bipartisan infrastructure bill, and voting to hold several Republicans in criminal contempt of Congress.",
    "But if he were to run for president as a Republican, he would be running for the nomination of a party that has censured him and Republican Rep. Liz Cheney of Wyoming for participating in the House Select Committee investigating the January 6 attack on the US Capitol.",
    "\"I think mentally I feel more like an independent than a Republican,\" Kinzinger told the Huffington Post, adding that he could possibly identify as \"some kind of a moderate Democrat\" if the party were not as progressive.",
    "Kinzinger also told the outlet that since becoming one of the most prominent anti-Trump Republicans in Congress, he's had to \"ghost\" several relationships he'd had with fellow Republican lawmakers.",
    "Republican Rep. Adam Kinzinger of Illinois is once again teasing a potential presidential campaign, perhaps even a primary battle against former President Donald Trump in 2024.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "\"Because as much as people love it or hate it, the Republican Party is going to be around for a while, and it deserves to have a battle for who it is.\"",
    "\"Even if he crushed me, like in a primary, to be able to stand up and call out the garbage is just a necessary thing, regardless of who it is.\"",
    "But the Illinois Republican, who's retiring from Congress this year after serving since 2011, said he's not planning a campaign imminently.",
    "Tom Williams/CQ-Roll Call, Inc via Getty Images\nKinzinger says he \"would love\" to run against Trump in 2024 \"even if he crushed me.\"",
    "Republican Rep. Adam Kinzinger of Illinois boards an elevator with other members of the January 6 committee on July 27, 2021.",
    "It's truly not anything I'm planning right now, but I'm not going to rule it out,\" Kinzinger told the Huffington Post.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "\"To be able to stand up and call out the garbage is just a necessary thing,\" he said, adding, \"it'd be fun.\"",
    "I really would,\" he told the Huffington Post of running against Trump in an interview published Monday.",
    "\"Look, if we're in a position, if it's just terrible candidates and the country's in a worse place?",
    "The anti-Trump Republican is retiring, and he says he's not planning a 2024 bid \"right now.\"",
    "\"In essence, I guess I'm still comfortable holding the Republican label for now,\" he added.",
    "In November, he told CNN that he's \"definitely\" not ruling out a 2024 White House bid.",
    "\"It's like how you stop dating somebody without breaking up with them,\" he said.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It's not the first time he's suggested a desire to run for higher office.",
    "\"I'll make a decision when we get there, if there's a need and a desire.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"I think it'd be fun,\" Kinzinger said of a potential primary battle.",
    "\"You do a week between dates and then three weeks.",
    "\"I never rule anything out,\" he told the outlet.",
    "Stay up to date with what you want to know.",
    "I just sort of ghost having friendships.\"",
    "Sign up for notifications from Insider!",
    "But there's no grand plan right now.\"",
    "Loading Something is loading.",
    "It's like a slow ghosting.",
    "It's the same in Congress.",
    "\"I would love it.",
    "Maybe."
  ]
}