{
  "id": 185,
  "mediaId": 43,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Sitting senator shown to have colluded in coup attempt. Sunday shows yawn",
  "image": "https://images.dailykos.com/images/892718/story_image/GettyImages-1229566335.jpg?1607715468",
  "link": "https://www.dailykos.com/story/2022/4/18/2092610/-Sunday-shows-AWOL-on-story-of-Sen-Mike-Lee-s-coup-conspiring",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joan McCarter\nDaily Kos Staff",
  "authorUrl": "/users/joan mccarter",
  "termIds": [
    1039,
    1385,
    1710,
    1862,
    2406,
    3094,
    571,
    577,
    2946
  ],
  "sentences": [
    "The newly revealed text messages between the senator and then-White House Chief of Staff Mark Meadows prove that Lee had been pushing the plot by John Eastman to get Republican state legislators to toss their election results and appoint their own pro-Trump electors since Nov. 23, 2020.\n?If a very small handful of states were to have their legislatures appoint alternative slates of delegates, there could be a path,? Lee texted Meadows on Nov. 23, when the counting had all been done.",
    "as brave holdouts against the Trump mob frequently omits the many lows from the rest of their careers.?\nAn illustrative example of just how much the national media does not want to deal with Republicans colluding on a coup is that other batch of Meadows' texts, the ones with Ginni Thomas, who is the wife of sitting Supreme Court justice Clarence Thomas, conspiring on an insurrection.",
    "He told Woodward and Costa that the first he'd ever heard about alternate electors? plot was on Jan. 2 and that he was shocked.? That fact, interestingly enough, was picked up and tweeted extensively by former Texas Sen. Ted Cruz communications official Amanda Carpenter, who apparently has a bone to pick with the former Cruz sidekick.",
    "https://t.co/GrNNT3xA2I\n Joyce Alene (@JoyceWhiteVance) April 16, 2022\nHere's a self-proclaimed constitutional conservative? who loves to argue when his cosplaying law professor that Of course, we're not a democracy? conspiring to overturn the will of the people, the government, the constitution.",
    "Utah Republican Sen. Mike Lee was up to his eyeballs in the conspiracy committed to overturning the 2020 presidential electionthe same Lee who sits on the Senate Judiciary committee and lectures much smarter, much more patriotic people on how the Constitution works.",
    "RELATED STORIES\nSenator who says states can constitutionally throw out elections should not have a say on judges\nTexts show they were all for Trump overturning the electionuntil a lack of evidence got in the way\nGinni Thomas wanted to overturn the election.",
    "About Clarence Thomas' Jan. 6 documents dissent ...\nTexts between Ginni Thomas, Meadows reveal an extraordinary effort to destroy democracy\nBeing Ted Cruz's sidekick is not making Mike Lee popular with Utah Republicans\nThis is a short blurb about Daily Kos.",
    "A liar smart enough to know that his 14 hours a day? spent trying to figure out how to overthrow the government and keep Trump installed in the White House was not a good look for him after the events of Jan. 6, so he lied about it.",
    "Fox News is a menace to our democracy, more than ever, so let's take them down\nDaily Kos' The Brief\nFollowShare\n0:001:01:34\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nBut the Kool Kids of the D.C. media?",
    "The same Supreme Court justice who refuses to recuse himself from any case involving his wife's activities, including the attempted violent overthrow of the government.",
    "Listen and subscribe to Daily Kos' The Brief podcast with Markos Moulitsas and Kerry Eleveld\nx\nx\nYou need to enable JavaScript to run this app.",
    "Wow, a sitting senator who plotted for weeks to overthrow the will of the people, fueling the insurrection and then lying about it?",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Lee is up for reelection this year, and the press back home might just have found their storyline for their primary coverage.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "[N]ot one of the five major Sunday talk shows mentioned one word about Lee,? writes the Washington Post's James Downie.",
    "But that's not what he told Bob Woodward and Robert Costa in their recent book about the events leading up to Jan. 6.",
    "x\nIt's chilling to see a US Senator propose a plan in writing to ignore the will of the voters & steal an election.",
    "As Downie says, they instead seem to think it's their job to reflexively boost Republicans who stand up to Trump.",
    "Sign now: Remove election-denier Mike Lee from Senate Judiciary Committee\nThe national media, anyway.",
    "He might have a harder time with the Utah press, which immediately jumped on the story.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Most of the current coverage that portrays Pence and Rep. Liz Cheney (R-Wyo.)",
    "We don't have corporate backers that are only in it for the bottom line.",
    "So, yes, he really should be asked about that by the traditional media.",
    "Are reporters asking anyone about the need to do something about this?",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Will the media let Sen. Mike Lee go unquestioned?? Downie asks.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n60.",
    "When Joe Biden had secured the office.",
    "That's precisely what this is.",
    "That doesn't mean he will be.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Why yes, yes they will.",
    "Lee is also a liar.",
    "Big news, right?",
    "Please read it.",
    "Not at all.",
    "Nope."
  ]
}