{
  "id": 192,
  "mediaId": 223,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Wait...Did This Anti-Trump Congressman Really Just Say That About Nukes?",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/39/9fa516cd-5db4-451a-96ca-5b6ac55e1235.jpg",
  "link": "https://townhall.com/tipsheet/mattvespa/2022/04/14/wait-did-this-anti-trump-congressman-really-just-say-that-about-nukes-n2605878",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Vespa",
  "authorUrl": "https://townhall.com/tipsheet/mattvespa/",
  "termIds": [
    1084,
    1248,
    1687,
    2103,
    2214,
    3094,
    428,
    545,
    562,
    2888,
    2959
  ],
  "sentences": [
    " Adam Kinzinger (@AdamKinzinger) April 12, 2022\nIf we let nukes prevent us from action then expect literally every country to try to get nukes in next few years\n Adam Kinzinger (@AdamKinzinger) April 12, 2022\nDude.",
    "This so be it' attitude regarding an armed conflict between nuclear-armed powers could lead to the end of civilization as we know it.",
    "If we let nukes prevent us from action then expect literally every country to try to get nukes in next few years,? he wrote.",
    "There are many who say Russia is trying to draw us into the war, and America is almost heroic? in restraint.",
    "I think not starting World War III has been a great foreign policy goal for the nuclear powers of the world.",
    "Evan Bayh, Olympia Snowe, and now Adam Kinzingerthe heat was just too much so they left the kitchen.",
    "It's a dream scenario as the core of Russia's military will suffer a setback that can last decades.",
    "So, with this lust for war dashes, maybe Kinzinger can just leave Congress before his term expires.",
    "She has to hope that Democrats in her state can bail her out as the GOP base is through with her.",
    "This is the first war where an alliance can stop it in a few days, but fears a weaker enemy.",
    "The last vestiges of the anti-Trump wing in the House could be swept away by January 2023.",
    "Mr. Kinzinger seems to find that view annoying as he wants to start a war with Russia.",
    "With no re-election campaign, the man is just doling out braindead tweets about nukes.",
    "We would have to conduct airstrikes on anti-aircraft batteries in Belarus and Russia.",
    "Sen. Chris Coons (D-DE), a Democrat, knows better here which is saying something.",
    "After this tweet about nuclear weapons, he's certainly acting like he's leaving.",
    "Not every country can develop nuclear weapons, but that's beside the point.",
    "They rail against the partisanship gripping Congress so what do they do?",
    "And he will do that by totally running away from Washington next year.",
    "We're not going to use chemical weapons if Russia uses them first.",
    "He will fight Trumpism whenever he can, it would seem.",
    "Moderates in the Democratic Party are doing the same.",
    "Rep. Adam Kinzinger (R-IL) is leaving Congress.",
    "One can dream, but we're not deploying troops.",
    "We're not going to assassinate Vladimir Putin.",
    "Yet, Kinzinger could probably just leavenow.",
    "He's Mr. No-fly Zone, which would mean war.",
    "It'll save us a headache, that's for sure.",
    ")-WY) may be on her way out in a primary.",
    "Literally,? this is not going to happen.",
    "We're not going to have a no-fly zone.",
    "I hope Russia is defeated in Ukraine.",
    "If Russia wants to provoke they will.",
    "Is that what we wantover Ukraine?",
    "He's a vocal Donald Trump critic.",
    "Rep. Liz Cheney (R (D?",
    "But Putin fears NATO.",
    "No spine whatsoever.",
    "It cuts both ways.",
    "Who wrote this?",
    "They leave.",
    "Nonsense.",
    "I do.",
    "No."
  ]
}