{
  "id": 206,
  "mediaId": 124,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Cheney capitalizes off national profile to raise $2.9 million in first quarter of 2022",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220411-liz-cheney-jm-0933-798743.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/cheney-capitalizes-national-profile-raise-29-million-first-quarter-202-rcna23838",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1930,
    1930,
    1667,
    1667,
    1609,
    945,
    945,
    746,
    746,
    1248,
    1248,
    1609,
    1147,
    1147,
    428,
    427,
    427,
    428,
    2959,
    2959
  ],
  "sentences": [
    "The panel made similar allegations in a court filing in the case last month, saying it had a good-faith basis for concluding that the president and members of his campaign engaged in a criminal conspiracy to defraud the United States.?\nThe Republican National Committee formally censured Cheney and the only other Republican on the Jan. 6 committee, Rep. Adam Kinzinger, R-Ill., in February.",
    "WASHINGTON  Rep. Liz Cheney, R-Wyo., who has risen to national prominence as one of the most vocal opponents of former President Donald Trump, raised $2.94 million in toward her re-election bid the first quarter of 2022, her campaign confirmed to NBC News on Monday.",
    "The Wyoming Republican's fundraising prowess is in large part due to receiving donations from across the country for her re-election bid, buoyed by her role as the top Republican on the House committee investigating the Jan. 6 riot.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nIn March, Bobbie Kilberg, an adviser to former Presidents Richard Nixon, Gerald Ford and both Bushes, hosted a major fundraiser for Cheney.",
    "The cash will likely all be needed as Cheney tries to fend off Trump-backed primary opponent Harriet Hageman, who is hoping to unseat the incumbent by riding the former president's public disdain for her.",
    "Jan. 6 panel has enough evidence to refer Trump for criminal charges, Liz Cheney says\nApril 11, 202200:32\nLast year, Cheney raised more than $7 million, which was 10 times as much as Hageman raised.",
    "Cheney, daughter of former Vice President Dick Cheney, has been raising her national profile as an outspoken critic of Trump and of many of her fellow Republicans on Capitol Hill.",
    "On Sunday, she said that the House committee investigating the Jan. 6 attack on the Capitol has enough evidence to refer President Donald Trump for criminal charges.",
    "This came after Republicans ousted Cheney as chairwoman of the House GOP Conference and replaced her with Rep. Elise Stefanik, R-N.Y.",
    "Cheney has raised more than $10 million during the 2022 midterm elections cycle and now has $6.8 million on hand, her campaign said.",
    "Earlier this year, House Minority Leader Kevin McCarthy on Thursday endorsed Hageman in her effort to unseat Cheney from Congress.",
    "Cheney has only a few months remaining before she's set to face Hageman in their state's primary on Aug. 16.",
    "The event featured Sen. Mitt Romney, R-Utah, and VIP tickets costed $10,800 per couple.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "The fundraising haul was first reported by Politico."
  ]
}