{
  "id": 21,
  "mediaId": 120,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "What members of the House GOP's Impeachment 10 have in common",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220406-Fred-Upton-al-0805-252e46.jpg",
  "link": "https://news.google.com/__i/rss/rd/articles/CBMiZmh0dHBzOi8vd3d3Lm1zbmJjLmNvbS9yYWNoZWwtbWFkZG93LXNob3cvbWFkZG93YmxvZy9tZW1iZXJzLWhvdXNlLWdvcHMtaW1wZWFjaG1lbnQtMTAtY29tbW9uLXJjbmEyMzE4ONIBAA?oc=5/",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    1147,
    1614,
    1901,
    2005,
    2125,
    2214,
    3094,
    428,
    562,
    2791
  ],
  "sentences": [
    "Recommended\nAs for the who's next? question, these are the other six members of the GOP's Impeachment 10 (in alphabetical order):\nWashington's Jaime Herrera Beutler is running for re-election in a district in which her local Republican Party formally censured her for holding Trump accountable.",
    "The 4 down? reference pointed to the four House Republicans who decided to retire after having voted with the majority on Trump's second impeachment: Ohio's Anthony Gonzalez, New York's John Katko, Illinois' Adam Kinzinger, and as of yesterday, Upton.",
    "California's David Valadao, whose district supported President Joe Biden in 2020, is not only facing a Republican rival, he's also found that his district's lines have been redrawn in ways that will make it more difficult to win another term.",
    "But there was one vote in particular that loomed large: Upton was one of the 10 House Republicans who voted to impeach Donald Trump last year after the former president instigated the Jan. 6 attack on the U.S. Capitol.",
    "Ever since, Trump has been determined to destroy the contingent that voted to hold him responsible for his actions, and as NBC News noted, the former president celebrated Upton's decision not to run for another term.",
    "It's why Upton's retirement announcement yesterday gave Congress a jolt: It meant the already far-right House GOP conference will soon have even fewer members interested in responsible governance.",
    "Wyoming's Liz Cheney has been formally rejected by the Republican National Committee, and her House Republican colleagues have endorsed  and extended financial support to  her GOP primary rival.",
    "That said, after more than three decades on Capitol Hill, the Michigan Republican has earned a reputation as a constructive lawmaker known for striking compromises.",
    "It would be an exaggeration to say Rep. Fred Upton is a moderate centrist who's wildly out of step with his conservative House GOP colleagues.",
    "It is quite possible that of the House Republicans' Impeachment 10, none of these members will be on Capitol Hill in the new year.",
    "The former president held a rally this past weekend in which he mocked the congressman over the spelling of his name.",
    "Michigan's Rep. Peter Meijer is facing multiple primary challengers, one of whom has received Trump's backing.",
    "Washington's Dan Newhouse is facing multiple primary challengers, one of whom has received Trump's backing.",
    "South Carolina's Tom Rice is facing multiple primary challengers, one of whom has received Trump's backing.",
    "The Michigan Republican told reporters that redistricting was a key factor in his decision.",
    "She's facing a primary challenger who's received the former president's endorsement.",
    "My district was cut like Zorro  three different ways,? Upton said.",
    "Watch this space."
  ]
}