{
  "id": 212,
  "mediaId": 25,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Liz Cheney sets personal fundraising record ahead of August primary",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/04/09/b5a03749-e4cc-4336-b775-c8168f28e9c5/thumbnail/140x90/9be5dd1310eec9aa4e00cca12c64ad97/gettyimages-1239844812.jpg",
  "link": "https://www.cbsnews.com/news/liz-cheney-fundraising-primary/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron Navarro",
  "authorUrl": "",
  "termIds": [
    1609,
    2465,
    2465,
    1095,
    1095,
    1248,
    1248,
    1609,
    428,
    562,
    562,
    428,
    427,
    427,
    2976,
    2946,
    2946,
    2976
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n Liz Cheney sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n Trump endorses Oz in Pennsylvania Senate primary race\n Judge declines to slow N.Y. primary elections despite ongoing redistricting battle\n Wisconsin governor vetoes Republican election bills\n More\nIn:\nUnited States Congress\nwyoming\nLiz Cheney\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "Trump, House Minority Leader Kevin McCarthy and GOP Rep. Elise Stefanik of New York, Cheney's replacement as House Republican conference chair, are backing one of her challengers, trial attorney Harriet Hageman.",
    "She was removed from her House leadership position in 2021, and in February the Republican National Committee censured her for voting to impeach Trump after the January 6 attacks on the Capitol.",
    "Cheney has frequently been targeted by other Republicans over her criticism of former President Trump and his baseless claims that the 2020 presidential election was stolen.",
    "Republican Congresswoman Liz Cheney, of Wyoming, raised nearly $3 million in the first three months of the year for her most contentious reelection race yet.",
    "Other challengers in the race include Republican Wyoming State Senator Anthony Bouchard, who raised $639,296 in 2021.",
    "Sign Up\n By signing up, you agree to the CBS Terms of Use and acknowledge the data practices in our Privacy Policy.",
    "Hageman raised over $1.3 million in the first quarter of 2022, and has over $1 million in her campaign stockpile.",
    "In March, Cheney held a fundraiser with Republican Senator Mitt Romney of Utah that brought in over $526,000.",
    "Over 50 House Republicans attended a fundraiser for Hageman in March that brought in close to $250,000.",
    "Thank you for subscribing\nThe sum, $2.94 million, is the most Cheney has raised in a quarter.",
    "Receive updates, offers & other information from the CBS family of companies & our partners.",
    "She enters the penultimate quarter before her primary with $6.8 million cash on hand.",
    "Get the latest breaking news delivered straight to your inbox.",
    "Opt out through the unsubscribe link in any marketing email.",
    "She had previously raised around $745,000 in all of 2021.",
    "Sign up for National Breaking News Alerts\nBe in the know.",
    "The Wyoming primary is August 16.",
    "Twitter"
  ]
}