{
  "id": 215,
  "mediaId": 118,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Liz Cheney Is Getting a Ton of MoneyFrom People Who Can't Vote for Her",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/04/20220411-cheney.jpg",
  "link": "https://www.motherjones.com/politics/2022/04/democrats-liz-cheney-trump-fundraising/",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Noah Y. Kim",
  "authorUrl": "https://www.motherjones.com/author/noah-y-kim/",
  "termIds": [
    826,
    1078,
    1095,
    1147,
    1248,
    1609,
    3085,
    3094,
    428,
    2590,
    2626,
    2946
  ],
  "sentences": [
    "Cheney has the support of two former Republican presidential candidatesformer President George W. Bush and Utah congressman Mitt Romneyand Senate Minority Leader Mitch McConnell recently revealed that he's donated her to reelection campaign.",
    "On the other hand, Cheney's main opponent, Harriet Hageman, has landed the coveted Trump stamp of approval, despite being an erstwhile Never Trumper who once tried to overturn the former president's victory in the 2016 primary.",
    "And then there's Wyoming State Sen. Anthony Bouchard, a diehard Trumper widely viewed as a toxic candidate due to the fact that he impregnated a 14-year-old girl when he was 18 and has been kicked out of all his committees.",
    "However, Cheney still has a narrow path to victory because of Wyoming's crossover voting? provision, which allows Democrats and independents to switch parties on Election Day and vote in the August 16 primary.",
    "But her efforts to investigate the January 6 Capitol riot, as well as her public condemnation of the former president, now appear to have produced another income stream for her upcoming primary battle.",
    "Earlier this year, Wyoming Republicans sought to close off that avenue by attempting to pass a Trump-backed bill that would've eliminated crossover voting in the state.",
    "In 2020, Democratic money flowed into the coffers of doomed candidates like Amy McGrath and Sara Gideon, who nevertheless failed to unseat opponents they had outraised.",
    "Cheney, then, will have to scoop up the state's moderate Republicans, Democrats, and independents, while her opponentsHageman and Bouchardfracture the MAGA vote.",
    "Cheney's primary campaign has set a personal fundraising record this quarter, raising $2.94 million between January and March 2022, Politico reported Monday.",
    "(For comparison, Rep. Elise Stefanik, the New York congresswoman who replaced Cheney as House GOP Conference chair, raised about $2 million.)",
    "The Wyoming primary race has become a focal point of the internecine feud between traditional conservatives and the Trumpist wing of the GOP.",
    "With all the money she's raised, Cheney has the war chest to put up a fight, but as the last election cycle showed, money isn't everything.",
    "Hageman has also received endorsements from scores of Cheney's fellow Republicans in the House, including Minority Leader Kevin McCarthy.",
    "Over the course of the campaign, Cheney has raised more than $10 million in total and has about $7 million left for the home stretch.",
    "As Open Secrets reported, Texas donors contributed the most money in 2021, with the second-highest amount from deep-blue California.",
    "There hasn't been a lot of polling on the race yet, but a December survey found that she trailed Hageman by 20 percentage points.",
    "In another survey, conducted last Summer, almost 80 percent of Republican primary voters said that they wouldn't vote for her.",
    "may have been censured, voted out of leadership, and excommunicated by her party over her war with Donald Trump.",
    "Last year, Cheney received more money from Democratic states like New York and Connecticut than her home state.",
    "But even with Trump's endorsement, Hageman raised only a tenth of the money that Cheney raised in 2021.",
    "In a state where Trump garnered 70 percent of the vote, the wind isn't blowing in Cheney's favor.",
    "(She's since issued a mea culpa, calling Trump the greatest president of her lifetime.)",
    "The problem is that much of this money is coming from out of state.",
    "But that effort ended up dying in the Wyoming legislature.",
    "Rep. Liz Cheney (R-Wyo.)"
  ]
}