{
  "id": 217,
  "mediaId": 25,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Biden announces new rule on \"ghost guns\" aimed at preventing gun crimes",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/04/11/c1294869-d7cb-4018-8f16-17114dafe72f/thumbnail/620x413/d0f316692ab3d8b82a8a2963f4d89aaf/gettyimages-1239921937.jpg",
  "link": "https://www.cbsnews.com/news/biden-ghost-gun-rules-steve-dettelbach-alcohol-tobacco-and-firearms-nominee/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    1952,
    1952,
    2087,
    895,
    895,
    642,
    642,
    1357,
    1357,
    555,
    555,
    356,
    356,
    74,
    74,
    2945,
    2945,
    2959,
    2959
  ],
  "sentences": [
    "Trending News\n Some Jan. 6 defendants turn to trial by judge instead of jury\n Biden announces new rule on \"ghost guns\" aimed at preventing gun crimes\n Ukrainian girl taken into U.S. border custody moved to shelter\n Liz Cheney sets personal fundraising record ahead of August primary\n U.S. processed 9,926 undocumented Ukrainians in last 2 months, data show\n Bo Erickson\nBo Erickson is a reporter covering the White House for CBS News Digital.",
    "The new rule will require ghost guns, which can be made with 3D printers or sold as assembly kits, to be treated like other firearms made and sold in the U.S.\n\"It's going to help save lives, reduce crime and get more criminals off the streets,\" Mr. Biden said in remarks at the White House.",
    "Washington  President Biden and the Justice Department announced new steps Monday aimed at combating gun crimes, including a rule targeting the manufacture and sale of so-called \"ghost guns,\" or homemade firearms that lack serial numbers and are difficult to trace.",
    "In a briefing for reporters on the new ghost gun rule on Sunday, a senior administration official said the ATF was able to trace fewer than 1% of the approximately 45,000 ghost guns recovered during criminal investigations between January 2016 and December 2021.",
    "Mr. Biden had originally tapped David Chipman to lead the agency, but pulled the nomination after several Republican lawmakers and Senator Angus King, an independent who caucuses with Democrats, voiced their opposition to the pick.",
    "During the campaign, he advocated for universal background checks for those who wish to purchase guns, reinstating the assault weapons ban, and restricting guns for people with serious mental health problems, according to WOSU.",
    "After his nomination was withdrawn, Chipman criticized the lawmakers for their opposition, telling \"CBS Evening News\" anchor and managing editor Norah O'Donnell that the gun industry \"profits by gun violence itself.\"",
    "Vice President Kamala Harris, a former prosecutor, noted that ghost guns pose \"an especially grave threat to the safety of our communities\" because of how easy they are to obtain and how difficult they are to trace.",
    "\"Ghost guns look like a gun, they shoot like a gun, and they kill like a gun, but up until now they haven't been regulated like a gun,\" said John Feinblatt, president of Everytown for Gun Safety.",
    "In a CBS News poll released on Sunday, Americans listed crime as the third-highest priority  after the economy and inflation  that they thought Mr. Biden and his administration should address.",
    "The president also called on Congress to do more to address gun violence, including by passing universal background checks and banning assault weapons and high-capacity magazines.",
    "Sellers will also need to be federally licensed, run background checks before selling a homemade gun kit and keep records of the purchases for as long as they are in business.",
    "About 12% of guns seized by the NYPD so far this year were ghost guns, according to the New York Post, although data is limited because of how difficult it is to trace them.",
    "MANDEL NGAN/AFP via Getty Images\nThe president also introduced Steve Dettelbach as his new nominee to lead the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF).",
    "\"[Dettelbach] should be a noncontroversial candidate because he has a long record of working in law enforcement,\" a senior administration official said Sunday.",
    "It comes one year after the Biden White House tasked the Justice Department with looking into such weapons after mass shootings in Boulder and Atlanta in 2021.",
    "But the president is right: The men and women of the ATF and the public that they protect deserve better support from us,\" Dettelbach said in brief remarks.",
    "Under the rule published by the Justice Department, commercial manufacturers of ghost gun assembly kits will now be required to include serial numbers.",
    "A former U.S. attorney for the Northern District of Ohio, Dettelbach would be the first permanent ATF director since 2015 if confirmed by the Senate.",
    "Ghost guns have recently been cited by metropolitan police chiefs and politicians as one of the causes of increased crime rates across the country.",
    "President Biden holds a pistol build kit as he speaks on measures to combat gun crime from the Rose Garden of the White House on April 11, 2022.",
    "\"We call them ghost guns because they can't be traced, but make no mistake  they are real,\" said Deputy Attorney General Lisa Monaco.",
    "A senior administration official asserted that the rule \"operates within the legal boundaries of the Constitution.\"",
    "And so far in 2022, we have 85 compared to 20 last year,\" NYPD Chief of Intelligence Tom Galati said last month.",
    "The White House was forced to pull its first choice for the role in September due to concerns from lawmakers.",
    "Feinblatt expressed confidence in Biden's new ATF nominee \"to lead a top-to-bottom overhaul of the agency.\"",
    "Mr. Biden picked up a prop gun kit next to his lectern, noting how easy they are to assemble.",
    "\"I've seen firsthand the work that so many at the ATF do to protect us from violence.",
    "Almost 700 of the incidents were homicides or attempted homicides, the official said.",
    "Democratic efforts in Congress to enact stricter gun laws have languished for years.",
    "\"Law enforcement is a very tough job, and no person and no agency is perfect.",
    "\"If you commit a crime with a ghost gun, expect federal prosecution.\"",
    "\"That's a 325% increase of seizures of ghost guns since last year.\"",
    "In 2018, Dettelbach lost his race to be Ohio's attorney general.",
    "The current rule allows sellers to purge records after 20 years.",
    "They're dedicated, they're professional and they're effective.\"",
    "\"I know it's controversial but I got it done once,\" he said.",
    "But ghost guns are used in only a fraction of gun crimes.",
    "\"In New York City in 2019, we recovered 47 ghost guns.",
    "In 2021, that number jumped up to 375.",
    "\"They can shoot to kill, and they do.\"",
    "In 2020, we recovered 150 ghost guns.",
    "\"It's not hard to put together ...",
    "\"This is the gun,\" he said.",
    "Doesn't take very long.",
    "Anyone could order it.\"",
    "Twitter"
  ]
}