{
  "id": 218,
  "mediaId": 21,
  "date": "4/10/2022 12:00:00 AM",
  "headline": "Chris Christie says Liz Cheney 'wanted to be kicked out' of House Republican leadership",
  "image": "https://i.insider.com/613e2200a30aeb0018b524a9?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/christie-liz-cheney-wanted-removal-house-republican-leadership-election-trump-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    2087,
    1609,
    2087,
    761,
    761,
    1609,
    1248,
    1248,
    1147,
    1147,
    428,
    562,
    562,
    16,
    16,
    3,
    3,
    428,
    2976,
    2976
  ],
  "sentences": [
    "Despite the fallout, Cheney has emerged as a prominent member of the House panel investigating the January 6 attack on the Capitol, and she is running for reelection to her at-large Wyoming House seat, despite dozens of her colleagues throwing their support behind her most prominent GOP challenger.",
    "Cheney saw the Capitol insurrection as an affront to the rule of law, as it disrupted the Electoral College certification of now-President Joe Biden's 2020 electoral victory and sent lawmakers into secure locations away from the rioters who broke into the building.",
    "Last May, Cheney was ousted as House Republican Conference Chair, the third-highest ranking position within the caucus  the result of her continued public admonishment of Trump for his role in the Capitol riot on January 6, 2021.",
    "To Cheney, Trump's abdicated his commitment to the secure and peaceful transfer of power from his conduct on January 6, threatening democracy based on debunked election theories that were used to whip up aggrieved supporters.",
    "During an appearance on ABC's \"This Week,\" the ex-Republican governor emphasized that \"inside Washington, DC politics\" was not the top concern of most GOP members, pointing to the influence of primary voters within the party.",
    "Christie responded: \"Whatever it is, it wasn't like she was looking to protect her position, and the first time that Republicans inside that caucus had a chance to vote on Liz Cheney they voted the keep her  overwhelmingly.\"",
    "However, the relationship between Cheney, House Minority Leader Kevin McCarthy of California, and House Minority Whip Steve Scalise of Louisiana continued to deteriorate as she kept lambasting Trump for his election claims.",
    "Chris Christie on Sunday said that Rep. Liz Cheney \"wanted to be kicked out\" of House Republican leadership amid the party's internal debate over her criticism of former President Donald Trump's debunked election claims.",
    "ABC News chief Washington correspondent Jonathan Karl  who was serving as the moderator  interjected and said that Cheney was holding firm to her beliefs about the Constitution.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "The congresswoman was one of 10 House Republicans who voted to impeach Trump for \"incitement of insurrection\" for his role in the riot.",
    "He added: \"It's only when she continued after that, that looked like somebody who wanted to make a point and wanted to be kicked out.\"",
    "After a second vote was held, Cheney was voted out of her position and replaced by Rep. Elise Stefanik of New York.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "\"Remember, the first time that she made the statements she made she was reelected to her leadership position.\"",
    "\"Look, my view has always been that Liz Cheney wanted to be kicked out,\" he said of the Wyoming Republican.",
    "While on ABC News, Christie pointed out that the caucus kept her on after her vote to impeach Trump.",
    "\"She says the point she's making is to defend the Constitution of the United States,\" he said.",
    "Christie argued that Cheney continually \"looked like somebody who wanted to make a point.\"",
    "Chris Christie said Rep. Liz Cheney \"wanted to be kicked out\" of House GOP leadership.",
    "Still, the Republican caucus decided to keep Cheney in leadership in a 145-61 vote.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Chris Christie on ABC News during the night of the 2020 presidential election.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Lorenzo Bevilaqua/ABC via Getty Images\nFormer Gov.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "Former New Jersey Gov."
  ]
}