{
  "id": 220,
  "mediaId": 21,
  "date": "4/10/2022 12:00:00 AM",
  "headline": "Rep. Liz Cheney says GOP leader Kevin McCarthy has failed to defend democracy at home after he backed Ukraine in Poland",
  "image": "https://i.insider.com/625307b0a2956a0018d7dea1?width=1300&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/cheney-says-mccarthy-put-political-gain-above-defending-democracy-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Al-Arshani",
  "authorUrl": "https://www.businessinsider.com/author/sarah-al-arshani",
  "termIds": [
    1147,
    1248,
    1609,
    2030,
    3085,
    3094,
    234,
    428,
    2870,
    2942
  ],
  "sentences": [
    "But, if we don't stand for our Constitution, if we don't stand for democracy, if we don't stand for freedom, if we forget that our oath to our Constitution is an oath to a document, it's not an oath to an individual, we have got to always remember that, or our democracy is in peril,\" Cheney told Tapper.",
    "\"What I would say is that what's happening today in Ukraine is a reminder that democracy is fragile, that democracy must be defended, and that each one of us in a position to do so has an obligation to do so,\" Cheney replied, adding that McCarthy as a lawmaker has failed to do so.",
    "Cheney, the vice-chair of the House panel investigating the Capitol riot, told CNN's Jake Tapper in an interview that McCarthy, \"failed to put his oath to the Constitution ahead of his own personal political gains.\"",
    "Tapper asked Cheney, one of just two Republicans on the House January 6 committee, if there was \"any disconnect,\" between McCarthy's statement on the conflict aboard and his actions domestically.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "McCarthy has previously refused to assist the January 6 committee's investigation into whether or not former President Donald Trump was responsible for the Capitol riot.",
    "The congresswoman was responding to a recent statement McCarthy made while leading a bipartisan delegation of lawmakers to Poland in support of Ukraine's democracy.",
    "While he initially said Trump was responsible for the attack in a House-floor speech a week after the riot, he later defended efforts to overturn the election.",
    "We are hereas representatives of the United Statesto ensure we are doing what is right to support Ukrainians as they defend themselves and their democracy.\"",
    "McCarthy has also declined to support Cheney and Rep. Adam Kinzinger after the Republican National Committee voted to move ahead with censure efforts.",
    "GOP Rep. Liz Cheney on Sunday said House Minority Leader Kevin McCarthy has put his own political ambitions first and failed to defend democracy.",
    "Photo by Samuel Corum/Getty Images\nGOP Rep. Kevin McCarthy in Poland said Ukrainians' right to defend democracy has to be ensured.",
    "\"We see the atrocities being committed by Vladimir Putin, and more importantly, we see the bravery of the Ukrainian people.",
    "The two serve on the January 6 committee and were among a handful of Republicans who voted in favor of impeaching Trump.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Cheney said McCarthy has \"failed to put his oath to the Constitution ahead of his own personal political gains.\"",
    "Rep. Liz Cheney speaks during a news conference with House Minority Leader Kevin McCarthy on July 21, 2020.",
    "McCarthy endorsed Harriet Hageman, a right-wing candidate running in the GOP primary against Cheney.",
    "In an interview with CNN, GOP Rep. Liz Cheney said McCarthy has not upheld democracy domestically.",
    "\"At the end of the day, each one of us is responsible for our own actions and activity.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "\"The whole world is watching what's unfolding in Ukraine,\" McCarthy said.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}