{
  "id": 250,
  "mediaId": 237,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "Democrats block trans candidate from primary for trying to 'manipulate voters'",
  "image": "https://html.scribdassets.com/6jwm7aq9z49ohodv/images/1-720f6f9116.jpg",
  "link": "https://www.washingtonexaminer.com/news/campaigns/democrats-block-trans-candidate-from-primary-for-trying-to-manipulate-voters",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Kerr",
  "authorUrl": "https://www.washingtonexaminer.com/author/andrew-kerr",
  "termIds": [
    1248,
    1962,
    2034,
    3094,
    146,
    428,
    2723,
    2799
  ],
  "sentences": [
    "\"In view of the [Democratic] committee's request, the plain language of the governing statute, and the supporting Missouri caselaw, this office is of the opinion that Missouri law prohibits your certification as a candidate for the Democratic nomination for a seat on the county legislature at the upcoming primary election,\" Jackson County Legislature Clerk Mary Jo Spino wrote to Gough.",
    "A military veteran and self-described political centrist, Gough provided the Washington Examiner a copy of a letter from the Jackson County Democratic Committee on March 8 that outlined party censure, rendering Gough ineligible to run as a Democrat in the county legislature election.",
    "Citing Gough's prior history as a Republican, Jackson County Democratic Committee Executive Director Forrest Richardson accused the candidate of attempting to \"manipulate voters and the electoral process\" ahead of the Aug. 2 Democratic primary for a seat on the county legislature.",
    "Brenda Allen, who also filed to run for a seat on the county legislature as a Democrat, was censured and disqualified by the Democratic committee after previously contributing \"a little here and a little there\" to Republican candidates, the Kansas City Star reported.",
    "The Kansas City Star editorial board hailed the Jackson County Democratic Committee on Thursday for blocking Gough and Allen from running as Democrats in the primaries, saying their actions protected voters from getting duped by Republicans masquerading as Democrats.",
    "A local Missouri Democratic committee took a page from the Communist Party of China's playbook when it blocked a transgender woman from running as a Democrat in a county election, the spurned candidate told the Washington Examiner.",
    "Gough, a biological male who now identifies as a female, ran as Bob Gough in Republican primaries for the U.S. House in 2010 and 2012 and in Democratic primaries for the U.S. House in 2014 and 2016.",
    "Gough lost four of the races by overwhelming margins but came fewer than 600 votes shy of defeating incumbent Jackson County Legislator Tony Miller in the 2018 Democratic primary.",
    "Gough compared the local Democratic Party's ability to block people from even running in a primary to the Communist Party of China's stranglehold over elections in its country.",
    "A second letter received on March 23 from a clerk of the county legislature prohibited Gough by state law from seeking the Democratic nomination for a seat on the legislature.",
    "\"A 2021 Gallup poll concluded that less than half of adults in this country have even a fair amount of confidence? in the people who hold or are running for public office.",
    "Collins, a Republican senator from Maine, has voted in line with President Joe Biden's position in 72.7% of her votes, according to FiveThirtyEight.",
    "\"If that's their rule, then I guess that's their rule,\" Allen told the outlet, adding that the committee \"did not call to talk about\" its decision.",
    "Roberta Gough, 84, has run in five elections in Missouri since 2010, twice as a Republican and three times as a Democrat.",
    "\"Candidates misidentifying their true affiliation can only add to this level of distrust in the democratic process.\"",
    "Situated in the Kansas City metropolitan area, Jackson County is the second-most populated county in Missouri.",
    "Cheney, Wyoming's lone Republican representative, has voted in line with Biden's position 11.5% of the time.",
    "Gough refiled for candidacy for a seat on the county legislature on Tuesday, but this time as a Republican.",
    "It's kind of like that in Missouri  the party determines who the candidate is going to be, not the voters.\"",
    "Like Gough, Allen refiled for candidacy for a seat on the county legislature as a Republican on Tuesday.",
    "\"Now, I'm 84 years old, so when you're 84 years old, you're not really identifying as a man or a woman.",
    "I don't even know what manipulating voters means,\" Gough told the Washington Examiner on Thursday.",
    "\"I would call the Republican Party a broad party, unlike the Democrat party,\" Gough said.",
    "Gough wasn't the only candidate blocked by the Jackson County Democratic Committee.",
    "And trust in elected decision-makers continues to wane,\" the editorial board wrote.",
    "\"That's the way it is in Venezuela, Nicaragua, and all of these banana republics.\"",
    "Susan Collins, of course, in the Senate, she votes with the Democratic Party.",
    "In China, Gough said: \"The party determines the candidate.",
    "\"I identify as transgender, as a female,\" Gough said.",
    "Again, I don't know what the word manipulate means.\"",
    "\"Liz Cheney, is she manipulating the voters?",
    "She votes with the Democrats all the time.",
    "And of course, there's only one candidate.",
    "You identify as an old fart.\"",
    "Is she manipulating voters?",
    "\"Manipulate voters?"
  ]
}