{
  "id": 252,
  "mediaId": 120,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "Under pressure, Cawthorn changes his story about orgies, cocaine",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1120w,f_auto,q_auto:best/rockcms/2022-03/220331-madison-cawthorn-mb-1215-e0bb3e.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pressure-cawthorn-changes-story-orgies-cocaine-rcna22346",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    1248,
    1609,
    2030,
    2303,
    3094,
    146,
    427,
    428,
    2976
  ],
  "sentences": [
    "The House minority leader soon after told Axios that Cawthorn acknowledged during their chat that his claims were exaggerated.? Instead of seeing members of Congress doing key bumps? of cocaine, the North Carolinian apparently told McCarthy he thought he saw maybe a staffer in a parking garage from 100 yards away.?\nAccording to a Politico report, Cawthorn told McCarthy he doesn't know what cocaine is.?\nThe minority leader appeared displeased.",
    "NBC News reported:\nHouse Minority Leader Kevin McCarthy, R-Calif., met with first-term Rep. Madison Cawthorn, R-N.C., on Wednesday about his claims of colleagues using drugs and inviting him to a sexual get-together.? McCarthy said he told Cawthorn that I lost my trust in him? because of the salacious claims and that there could be? consequences as a result.",
    "There is no evidence behind his statements.?\nComments like these may seem relatively restrained, but for McCarthy, who's practically obsessed with promoting party unity and loath to lash out at members of his own conference in public, it was an unusual rebuke.",
    "In other words, while the party isn't pleased with Cawthorn, it's still far angrier with Rep. Liz Cheney  whom the Republican National Committee has formally denounced, and whose primary rival now enjoys official GOP backing.",
    "The North Carolina Republican, who has a reputation for peddling strange nonsense, proceeded to tell stories of his congressional colleagues inviting him to orgies and doing cocaine in his presence.",
    "The Wyoming congresswoman didn't make up any stories about her colleagues partaking in orgies and cocaine, but she did denounce Donald Trump and seek answers about the Jan. 6 attack on the Capitol.",
    "As of this morning, McCarthy and the House Republican leadership team haven't taken any of these steps, and they've given no public indication that such punishments are on the table.",
    "As practically every fair-minded congressional observer will concede, House Republicans say outrageous things on a nearly daily basis, nearly all of which go ignored by GOP leaders.",
    "While many assumed this was just the latest in a series of Cawthorn's tall tales, his House GOP colleagues took the accusations seriously and expressed their outrage.",
    "He faced a public rebuke from McCarthy, and I have no doubt that was unpleasant, but for now the far-right freshman remains a member in good standing.",
    "If you're just catching up on this story, Cawthorn appeared on a podcast last week and was asked whether the TV show House of Cards? is realistic.",
    "But a known fabulist told a literally unbelievable story about cocaine and orgies, and the party wasn't about to let that go.",
    "Recommended\nPart of what makes this controversy notable is what it tells the public about the party's breaking points.",
    "McCarthy quickly arranged a private meeting with the freshman lawmaker, and the two met yesterday in the late morning.",
    "The 26-year-old lawmaker said he couldn't help but marvel at the sexual perversion? of his older colleagues.",
    "But as it turns out, there are still some lines House Republican leaders don't want their members to cross.",
    "That said, at least at this point, Cawthorn isn't facing any consequences of great significance.",
    "He's going to have to earn it back.? The would-be House Speaker added, It is just frustrating.",
    "The party could announce that it's no longer supporting Cawthorn's re-election campaign.",
    "Siding with Vladimir Putin as he wages a brutal and unprovoked war against a U.S. ally?",
    "House Republican leaders have a near limitless capacity for tolerating misconduct.",
    "It could withdraw all financial support for Cawthorn and his political operation.",
    "Releasing a video depicting a GOP member killing a Democratic colleague?",
    "It could endorse a primary rival in his North Carolina district.",
    "I just told him he's lost my trust,? McCarthy said of Cawthorn.",
    "He didn't specify what those consequences could be.",
    "It could kick him out of the House GOP conference.",
    "It could strip him of his committee assignments.",
    "And for House Republicans, that's far worse.",
    "Trying to overturn a presidential election?",
    "Embracing the deranged QAnon delusion?",
    "Speaking at a white nationalist event?",
    "They'll let it slide.",
    "Let's not overreact.",
    "No problem.",
    "Great.",
    "Fine."
  ]
}