{
  "id": 265,
  "mediaId": 151,
  "date": "3/28/2022 12:00:00 AM",
  "headline": "Adams' vax mandate controversy grows",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/new-york-playbook/2022/03/28/adams-vax-mandate-controversy-grows-00020790",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    671,
    1224,
    1257,
    1584,
    1654,
    1786,
    1911,
    3094,
    2580
  ],
  "sentences": [
    "SOCIAL DATA BY DANIEL LIPPMAN\nHAPPY BIRTHDAY: Rep. Nydia Velzquez (D-N.Y.)  Hank Paulson ... CBS' Ed O'Keefe and Bob Kovach  Fox News' Todd Piro  Lena Gaviria  Graham Stone  Ulster County Executive Pat Ryan is 4-0  (was Sunday): Walt Mossberg  NBC/MSNBC's Jacob Soboroff  CNN's Meredith Artley  former Rep. Susan Molinari (R-N.Y.)  Sally Kohn  Laura Driscoll  Edelman's Erin Schwille  Yuriy Bash  Annie Polland ... Dorothea Lasky \n (was Saturday): WaPo's Bob Woodward turned 79  CBS' Margaret Brennan  CBS' Kira Kleaveland  Bloomberg's Chris Rovzar  Melissa Toufanian ... Michael Sean Comerford  Phil Chui  Nancy Lynn Snyderman\nMAKING MOVES  Jae Ko is the new deputy director of intergovernmental affairs for City Council Speaker Adrienne Adams.",
    "Housing courts are set to start handling cases in person on Monday, but judges should not hear cases unless the tenants have legal representation, Levine told the Daily News on Sunday.?\nFrom Illegal' Hotel to Housing for the Homeless on Upper West Side,? by The New York Times' Mihir Zaveri: The lobby of the Manhattan building once known as the Royal Park Hotel still beckons to tourists: A sign advertises cheap shuttle rides to nearby airports, and rows of pamphlets promote Broadway musicals and attractions like the Guggenheim Museum Instead, the seven-story building on the Upper West Side is being converted into permanent housing for homeless people  part of an urgent push to alleviate the city's severe housing crisis.",
    "The story of the Royal Park is, in part, a story of how what was once a tenement came to be a flash point in the city's long-running fight against building owners who illegally rent out rooms to tourists instead of long-term residents.?\nFollow us on Twitter\nErin Durkin @erinmdurkin\nAnna Gronewold @annagronewold\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "With the state budget due next week, Ms. Hochul may be forced to explain the taxpayer benefits of spending on a new stadium, despite a long history of publicly funded arenas that have yielded little economic impact.?\n Caucus lawmakers propose their own 10-point public safety plan for NY,? by Spectrum's Nick Reisman: Lawmakers in the Black, Puerto Rican, Hispanic & Asian Legislative Caucus on Saturday proposed a 10-point plan for public safety in the state rooted in funding mental health, youth counseling and housing needs as well as diversion and educational programs.",
    "The debate has become a growing symbol of rifts among progressive and moderate Democrats that is playing out in statehouses across the U.S. Fixing New York's bail requirements was hailed as a national victory after Democrats regained dual majorities in the state Senate in 2019. Flash forward three years later: The fierce fight over how to address a crime wave has infiltrated the debate in all New York statewide races this year, including for governor, and for critical House seats that could help determine the control of Congress in November.",
    "Father of the groom Stephen Harrington and mother of the bride Kristen Atwood were voted MVPs.? Pic ... Another pic ... A third pic\nSPOTTED: Jim, Kristen, Hanna, Chapin, Sophie and Teagan Atwood, Sharon, Shannon and Tara Harrington, Becky Van Der Cook, Vaughn Hilyard, Jessica Dean, Alan He, Sam Feist, Betsy Klein and Jeff Solnet, Meridith McGraw, Brian Roberts, Jacqueline Alemany, Rachel Levitan, DJ Judd, Jay Shaylor, Ali Spiesman, Nick Barquin, Frederico Quadrani, Katherine Schneider, Liza Bray, Chloe Arensberg and Christian Hertenstein.",
    "The inquiry is related to funds doled out through the State and Municipal Facilities Program, or SAM, a lump sum appropriation in the state budget administered through the Dormitory Authority of the State of New York, according to the source.?\nWhat City Hall's reading\nNew York Asian hate crime spike puts pressure on new mayor, by POLITICO's Erin Durkin: Attacks on Asian American New Yorkers have become so prevalent since the pandemic began that a lawmaker is calling on the governor to declare a state of emergency.",
    "A year ago, the same House Republican retreat was fraught with drama as Representative Liz Cheney of Wyoming, who then held the third-ranking leadership post, publicly denounced former President Donald J. Trump's election lies.?\nAROUND NEW YORK\n A veteran Black female fraud investigator is suing the New York State Department of Financial Services alleging she was treated unfairly compared to white male counterparts.",
    " Hochul Weighs a $1.4 Billion Stadium for Her Hometown Football Team,? by The New York Times' Luis Ferr-Sadurn and Ken Belson: The new stadium is expected to be financed with up to $1 billion in taxpayer money, a combination of funding from the state and Erie County, where Buffalo is, according to two people familiar with the structure of the proposed deal, which still has not been finalized.",
    "Adams' vax mandate controversy grows\nBy ERIN DURKIN, ANNA GRONEWOLD and DEANNA GARCIA\n03/28/2022 07:33 AM EDT\nPresented by The Black Car Fund\nA still-unvaccinated Kyrie Irvingplayed his first home game in Brooklyn last night after New York City Mayor Eric Adams' decision to reverse the city's vaccine mandate specifically for athletes and performers while leaving it in place for everyone else.",
    " Joe Anuta\nWHAT ALBANY'S READING\nDemocrats' fight over bail reform might be a fight for the party's direction, by POLITICO's Anna Gronewold and Erin Durkin: Three years after New York bail reform changes were hailed as a national victory to address unfair detainment, the state law and its effects are now a political grenade being lobbed from both the right and left amid surging crime.",
    " NYC homeless shelter provider keeps getting city funding despite facing criminal probe,? by Daily News' Chris Sommerfeldt\nAdams pushes Albany for more control over street safety, by POLITICO's Danielle Muoio Dunn: With mere days left to pass a state budget, Mayor Eric Adams on Friday made an impassioned plea for lawmakers in Albany to give the city control over its streets.",
    "Andrew Cuomo, the state of New York has cut nearly a third of state psychiatric hospital beds reserved for children.?\nBUDGET WEEK:\n Ethics enforcement overhaul remains part of budget talks, by POLITICO's Bill Mahoney: An overhaul of the way the state enforces ethics and lobbying has been a part of budget talks in recent days, three people familiar with the negotiations say.",
    "FROM THE DELEGATION\nElise Stefanik, Reinvented in Trump's Image, Embodies a Changed G.O.P.,? by The New York Times' Annie Karni: On the second floor of an upscale golf resort near Jacksonville this past week, House Republicans gathered for drinks as they kicked off a three-day retreat to plot their path to winning the majority in this year's midterm elections.",
    "Now They Can't Get Treatment,? by The City's Abigail Kramer: Unlike private hospitals, where clinicians say the length of a standard psychiatric stay has shrunk in recent decades to not much more than a week, New York's state-run hospitals are designed to provide longer-term, high-level care to people who are experiencing a mental health crisis.",
    "Real Estate\nAs evictions pile up, many NYC tenants are going without legal defense, says Manhattan BP Mark Levine,? by New York Daily News' Shant Shahrigian: Evictions are racing ahead faster than the city can provide attorneys for the tenants with housing troubles, says Manhattan Borough President Mark Levine.",
    "Adams Says Encampments of Homeless People Will Be Cleared,? by The New York Times' Andy Newman, Katie Glueck and Dana Rubinstein: Mayor Eric Adams said on Friday that his administration was pursuing plans to clear New York City's streets of makeshift campsites where homeless people live.",
    "Carveouts for performers and athletes absolves wealthy & famous of their responsibility to protect fellow New Yorkers.? The decision also caused a rare rift between the mayor and City Council Speaker Adrienne Adams, who called the move a step away from sensible pandemic policy.",
    "Adams demands Biden administration drop plan to close NYC VA hospitals,? by New York Post's Steven Vago and Rich Calder: Mayor Adams said Saturday he plans to lobby the Biden administration hard to drop its plan to close two Veterans Administration hospitals in New York City.",
    "A senior citizen was punched in the face by an assailant who reportedly told police Chinese people look like measles.? Another woman was stabbed 40 times in her Chinatown apartment  and a Stop Asian Hate? memorial left in her honor smashed by vandals.",
    "Investigators with the Southern District of New York have subpoenaed state officials and Senate employees as they probe money Benjamin steered toward projects in his former Harlem district, a source with direct knowledge of the matter told The News.",
    "You may consider it a double standard, I consider it an analysis that I made and I'm comfortable with my decision.? He also reversed himself a day after flatly denying he was lobbied on the matter, despite public records that prove otherwise.",
    "But each of the three sides has said they're open to including ethics reform in the budget, and the possibility of dissolving the controversial Joint Commission on Public Ethics and replacing it with a new entity has been on the table.",
    "The 65-member caucus carries power within both houses of the Democratic-controlled Legislature during the ongoing budget negotiations.?\n#UpstateAmerica: We will have a tent the likes of which have never been seen in these parts.",
    "Today, with the release of his budget, President Biden will now turn open the spigot so these dollars can flow and so construction work on Gateway can advance.?\n Biden will also propose $400 million for the Second Aveue subway.",
    "They need to be open, and I'm joining my federal and state lawmakers because they gotta be open,' said Adams following an unrelated event in Lower Manhattan.?\n Schumer also vowed to fight the closures.",
    "In doing so, Adams became the latest voice in a long-standing fight among city leaders and transportation advocates to gain the right for the city to set its own speed limits and install speed cameras.",
    "Biden and the Boroughs\nFIRST IN PLAYBOOK: President Joe Biden's budget will be the first presidential budget to mention the long-stalled Gateway project by name, Majority Leader Chuck Schumer said.",
    "De Blasio was thought to have favored Adams during last year's primary, and the two were seen last month supping at Osteria La Baia, the Midtown Italian restaurant where Adams often holds court.",
    "This is just unbelievable that we are here trying to convince Albany to give us the speed cameras we need that has proven to be successful,? Adams said at a Friday press conference in Brooklyn.",
    "The community feels a lot of anger, as well as fear, every time they leave the house,? Assemblymember Ron Kim (D-Queens), the lawmaker proposing the state of emergency, said in an interview.",
    "He's won 18 Grammys for crying out loud.? Eddy Dobosiewicz, founder of the Buffalo Dyngus Day festival, says celebrations will be back in full force for the first time in two years.",
    "I worked hard, with the whole delegation, to fill the Gateway silo with billions in fed funds, even during those not-so-Gateway-friendly Trump years,? Schumer said in a statement.",
    "Like the Lang Leav poem read by Kylie's grandmother Joan at the ceremony, they ended the night in cowboy boots, light up hats, and foam Moose caps under a sprinkling of Stardust'.",
    " Retired Albany Bishop Howard Hubbard told investigators that some Catholic priests accused of abuse were returned to ministry after treatment without the public's knowledge.",
    "Brian Benjamin,? by Daily News' Denis Slattery and Michael Gartland: Federal investigators have issued subpoenas and are seeking information about grants related to Lt. Gov.",
    "Pool report: They exchanged vows in a 118 year old church in Jackson Hole, Wyoming followed by dinner, dancing and a flash mob against the backdrop of the slushy Tetons.",
    "The most recent official estimate, in January 2021, put the number of people living in parks and on the streets at around 1,100, which was widely seen as an undercount.",
    "Andrew Cuomo trails successor Kathy Hochul by only 8 points in a hypothetical primary matchup, a poll released by the Siena College Research Institute on Monday found.",
    " The Civilian Complaint Review Board has confirmed 187 allegations of misconduct against 104 members of the NYPD stemming from the 2020 Black Lives Matter protests.",
    "While their previous challenges to the mandate failed, they believe Adams' decision to lift the rules for professional sports teams may give them a stronger case.",
    " A government watchdog group is suing the Federal Election Commission for dismissing its complaint about Rep. Alexandria Ocasio-Cortez's campaign fundraising.",
    "While Nets fans at the Barclays Center greeted Irving with a big ovation, elsewhere in the city, the chorus of jeers over Adams' move is only growing louder.",
    "Unions for city workers, whose members were fired for refusing to get the shot, are mulling new legal action in light of the mayor's latest policy change.",
    "Only 33 percent of registered Democrats want him to actually run in the primary, and only 32 percent think he did not sexually harass multiple women.",
    "Tonight @KyrieIrving (soon followed by MLB) is working despite refusal to get vaccinated, while other workers in NYC were fired for doing the same.",
    "Mr. Adams, in a brief interview, provided few details about the initiative, which would require considerable manpower and logistical coordination.",
    " The family of a man who died at Rikers Island last year sued the city for him being left unsupervised when he suffered a fatal medical episode.",
    "Schumer, a key proponent of the project that would include building a new tunnel under the Hudson, said that means the money can start flowing.",
    "During an interview on Fox 5, anchor Lori Stokes said, according to some observers, Adams inherited a mess from former Mayor Bill de Blasio.",
    "Let us know ... By email: EDurkin@politico.com and agronewold@politico.com, or on Twitter: @erinmdurkin and @annagronewold\nWHERE'S KATHY?",
    "That compares to 30 percent for Cuomo, 10 percent for Rep. Tom Suozzi, and 7 percent for New York City Public Advocate Jumaane Williams.",
    "3 Republican and an architect of the party's message, who was running the show, working the room with her 7-month-old son on her hip.",
    "WEEKEND WEDDING  Kylie Atwood, a national security correspondent for CNN, on Saturday married Steve Harrington, an entrepreneur.",
    "Visiting a child care center in Queens to push for child care funds in the state budget and making an announcement with JetBlue.",
    "Yes, he suddenly remembered, former City Council Speaker Corey Johnson did in fact lobby him on behalf of the Nets.",
    "There are signs, however, that 30 percent of the vote might be close to the ceiling of support Cuomo could receive.",
    "Nonetheless, he vowed to accomplish what his predecessors had not in addressing a persistent, multifaceted issue.\"",
    "That's my words,? Adams replied, though neither he nor Stokes elaborated on what exactly they were referring to.",
    "Siena poll: Hochul leads Cuomo by 8 in hypothetical primary matchup, by POLITICO's Bill Mahoney: Former Gov.",
    "There are a lot of details to work out, and negotiations are never considered final until bills are printed.",
    " A law allowing judges to ban repeat subway criminals from the transit system has never actually been used.",
    "The vaccine mandate was and is the right thing to do,? Public Advocate Jumaane Williams tweeted last night.",
    "ABOVE THE FOLD: Federal investigators subpoena Albany officials for info related to grants and Lt. Gov.",
    " Russia is blocking city pension funds from selling off its stocks as part of a planned divestment.",
    " Adams shared a clip of a mother and baby being held at gunpoint to defend his anti-crime unit.",
    "There was just one big problem: He would have to wait for weeks, maybe months, to get a bed.",
    "The mayor also did not specify where the people now living in the encampments would go.",
    " A rising Hudson River will affect millions of New Yorkers in a bad way.",
    "DE BLASIO DISS: Adams had some harsh words for his predecessor Friday.",
    "Brian Benjamin's time as a state senator, the Daily News has learned.",
    " Long Island Rail Road riders can unmask when TSA ends the mandate.",
    " Adams is considering using drones as a crime-fighting tool.",
    "Under a 'Transformation Plan' launched in 2014 by then-Gov.",
    "[It] was Representative Elise Stefanik of New York, the No.",
    "Cuomo Set Out to Transform' Mental Health Care for Kids.",
    " Adams said he hasn't carried a gun since taking office.",
    " Metro-North has added 66 new trains to its schedule.",
    "T minus three days until the state budget is due.",
    "One woman was shoved in front of a subway train.",
    "Hochul would receive 38 percent of the vote.",
    "Ko was formerly assistant director at DC37.",
    "In Albany with no public events scheduled.",
    "No double standard,? Adams said Friday.",
    "Got tips, suggestions or thoughts?",
    "By the way, the Nets lost anyway.",
    "Not my words,? Stokes cautioned.",
    "We have Jimmy Sturr coming.",
    "WHERE'S ERIC?",
    "IT'S MONDAY."
  ]
}