{
  "id": 266,
  "mediaId": 19,
  "date": "3/28/2022 12:00:00 AM",
  "headline": "Contempt Charge Against Dan Scavino Based on False Claims by January 6 Committee",
  "image": "https://media.breitbart.com/media/2019/03/Dan-Scavino-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/28/contempt-charge-against-dan-scavino-based-on-false-claims-by-january-6-committee/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joel B. Pollak",
  "authorUrl": "https://www.breitbart.com/author/joel-b-pollak/",
  "termIds": [
    830,
    1147,
    1335,
    2052,
    2244,
    3094,
    545
  ],
  "sentences": [
    "In a statement Monday night, committee chair Rep. Bennie Thompson (D-MS) claimed that Scavino strung us along for months before making it clear that he believes he's above the law.? In fact, it was the committee itself that was responsible for a delay of months?: as the contempt report makes clear, it did not attempt to write to Scavino between December 9, 2021 and February 4, 2022, despite receiving a response from Scavino's attorneys to to the December 9 letter on December 13.",
    "Instead, it makes unsubstantiated (and, to any Reddit user, laughable) claims that Scavino may have had advance warning about the potential for violence on January 6th? because he once followed /r/The_Donald,? a now-defunct Reddit forum with close to a million users, a few of whom posted alarming comments on a successor site called thedonald.win months, and perhaps years, later.",
    "The contempt report also falsely claims that Scavino refused to comply with the Select Committee's subpoena in any way,? though the correspondence referred to by the report itself reveals Scavino's attorneys said he would comply once he had knew the scope of the inquiry, and had clarity about the extent to which executive privilege would cover his testimony.",
    "The contempt report claims that it identified specific topics for Scavino to address, but as a letter from Scavino's attorneys noted Feb. 8, the committee also told Scavino's attorneys that it reserves the right to question Mr. Scavino about other topics,? creating the possibility that other executive privilege claims could arise during testimony.",
    "Though the courts have ruled against former President Donald Trump's assertions of privilege over some documents held by the National Archives, they have not ruled on whether executive privilege would also be invalid regarding Scavino's requested testimony  for example, about verbal communications be may have had with the president.",
    "Navarro has said candidly in interviews that the plan among Trump loyalists was to use a peaceful protest at the Capitol to pressure Congress and Vice President Mike Pence to reject the certification of Electoral College votes from states where the results were being contested by the Trump campaign.",
    "Speaker of the House Nancy Pelosi (D-CA) took the unprecedented step of rejecting House Minority Leader Kevin McCarthy's recommended list of Republican participants, and appointed only two Republicans  Reps. Liz Cheney (R-WY) and Adam Kinzinger (R-IL)  alongside seven Democrats.",
    "Correspondence reviewed by Breitbart News indicates clearly that Scavino's attorneys informed the committee that he was willing to cooperate, but was concerned about violating executive privilege, and the unclear scope of requested testimony.",
    "The January 6 Committee voted to recommend Monday that former White House communications official Dan Scavino be held in criminal contempt of Congress, based on false claims by the committee that Scavino refused to comply with it.",
    "Moreover, legal challenges claim the subpoenas issued by the committee are invalid because the enabling resolution requires they be approved in consultation with the ranking member, and there is no such ranking member.",
    "Other Trump officials who have been targeted by the committee have sued it, alleging that it is in violation of the terms of its own enabling resolution, which calls for five Republican members (out of 13 total).",
    "The DOJ, which has historically ignored such referrals  notably, when Republicans referred Obama-era attorney general Eric Holder and IRS official Lois Lerner for contempt  charged Bannon with contempt last year.",
    "Already, Congress has voted to recommend former Trump adviser Steve Bannon and former White House chief of staff Mark Meadows for prosecution by the Department of Justice (DOJ).",
    "The result is that witnesses at the closed-door depositions before the committee are not questioned by two opposing sides, but by attorneys who are all on the same side.",
    "Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m.",
    "Moreover, as Scavino's attorneys pointed out to the committee, the scope of the committee's request for testimony was both vague and ever-expanding.",
    "Contrary to the claims of the January 6 committee, Navarro said that the violence that erupted interfered with the plan and ensured its failure.",
    "These are two separate issues, neither of which the committee addressed in the contempt report? that was the basis for the vote Monday evening.",
    "The partisan committee  perhaps fearing the upcoming midterm elections  appears to have rushed to find Scavino in contempt.",
    "His recent book, RED NOVEMBER, tells the story of the 2020 Democratic presidential primary from a conservative perspective.",
    "The committee also voted to recommend that former Trump trade official Peter Navarro be held in contempt.",
    "The contempt report does not address the question of whether there would be any limit to the inquiry.",
    "He is the author of the recent e-book, Neither Free nor Fair: The 2020 U.S. Presidential Election.",
    "He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship.",
    "Both Cheney and Kinzinger are known for their hostility toward Trump.",
    "Follow him on Twitter at @joelpollak.",
    "ET (4 p.m. to 7 p.m. PT)."
  ]
}