{
  "id": 271,
  "mediaId": 157,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "'Republicans have a ton of baggage' as they try to distance themselves from Trump's Putin praise",
  "image": "https://www.rawstory.com/media-library/vladimir-putin-donald-trump.jpg?id=24995334&width=1200&coordinates=0%2C23%2C0%2C24&height=600",
  "link": "https://www.rawstory.com/donald-trump-vladimir-putin-2657046296/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1147,
    1248,
    1765,
    2030,
    2104,
    3094,
    428,
    2888,
    2942
  ],
  "sentences": [
    "\"The comment, in a video posted by Georgia Rep. Marjorie Taylor Greene, who also suggested blame for the war rested with both Russia and Ukraine, was met with a sharp rebuke from Wyoming Rep. Liz Cheney, one of the few Republicans eager to denounce her party's right-wing flamethrowers and the frequent target of former President Donald Trump who is now facing a primary challenge.\"",
    "I think this will last through November because we're dealing with a situation where there are no good options for Russia, and if Russia were to succeed, they'd only succeed through more carnage, more violence.?\nWith that in mind, the CNN report also notes candidates like Rep. Marjorie Taylor Greene (R-GA) are also providing fodder for Democrats when it comes to Ukraine.",
    "\"Democrats, though, see opportunities to pounce, pointing to Trump's long history of praise for Putin and the former President's attempt to pressure Ukrainian President Volodymyr Zelensky to produce political ammunition targeting Hunter Biden in exchange for already congressionally approved military aid  a move that ultimately led to his first impeachment.\"",
    "\"Senate Republican Leader Mitch McConnell has sought to downplay intra-party tensions, saying on CBS Sunday that the 'vast majority of the Republican Party writ large, both in Congress and across the country, are totally behind the Ukrainians and urging the president to take these steps quicker, to be bolder,'\" CNN's Gregory Kreig and Eric Bradner wrote.",
    "But some lawmakers rooted in the party's Trumpist grassroots have veered from those talking points and, in expressing concern over deeper US involvement in Ukraine, falsely claimed its democratically elected government' 'only exists because the Obama State Department helped to overthrow the previous regime,'\" the report states.",
    "While Republicans had planned to run on complaints about inflation and culture war ranting -- a staple of GOP political campaigns -- the attack on Ukraine combined with Donald Trump's praise of the Russian strongman is casting a shadow over Republicans who will be on the ballot.",
    "The report notes that Republican face a choice \"over whether to remain in lockstep with Trump  who has described Putin as 'smart' and 'savvy' in remarks before and during the invasion --or to unreservedly criticize the Russian leader.\"",
    "According to a report from CNN, Republican plans to coast to big victories in the 2022 midterms have been thrown into disarray after Russian President Vladimir Putin's unprovoked invasion of Ukraine has changed the political calculus.",
    "The Republicans have a ton of baggage when it comes to their worship of Vladimir Putin,? Jay Chen, a Naval Navy Reserve intelligence officer running in California's 45th congressional district explained.",
    "With the CNN report noting his district is home \"Little Saigon and large Vietnamese and Taiwanese populations,\" the candidate elaborated, \"I mean, that's what they fled to escape.",
    "\"GOP leadership has been unified in denouncing the invasion and calling for a more aggressive strategy from the White House.",
    "According to one California Democratic candidate, Republicans running for office have some explaining to do.",
    "And the Republican Party is embracing it and only haltingly turning away from it when they get called out.",
    "Stories Chosen For You"
  ]
}