{
  "id": 280,
  "mediaId": 1576,
  "date": "3/26/2022 12:00:00 AM",
  "headline": "Trump returns to Georgia confronting test of his grip on GOP",
  "image": "https://www.wabe.org/app/uploads/2022/03/AP22085046177338-336x189.jpg",
  "link": "https://www.wabe.org/trump-returns-to-georgia-confronting-test-of-his-grip-on-gop/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    973,
    1147,
    1646,
    2095,
    2355,
    3094,
    428,
    571,
    2672,
    2834
  ],
  "sentences": [
    "In remarks before Trump's arrival at the rally in Commerce in northeast Georgia, Perdue unveiled a series of sharper attacks on Kemp as he parroted Trump's election lies, declaring that our elections in 2020 were absolutely stolen.? He accused Kemp of having sold out? Georgia voters through a series of actions including refusing to call a special state legislative session before Jan. 6 to investigate or overturn the election.",
    "Before we can defeat the Democrat socialists and communists  we first have to defeat the RINO sellouts and the losers in the primaries this spring,? Trump told the crowd, lacing into Kemp again and again as he accused him of betraying Republican voters with the derisive acronym, Republican in name only.?\nBrian Kemp is a turncoat.",
    "Because he kicked sand in the face of the president the last two years and said no' every time the president asked for anything.?\nPerdue promised, if elected, to make sure that those people responsible for that fraud in 2020 go to jail? as he escalated his rhetoric to mimic Trump's.",
    "Given the former president's particular focus on Georgia, a stumble here could weaken his efforts elsewhere to champion candidates who have pledged loyalty to his vision of the GOP, which is dominated by election lies and culture clashes over issues related to race and gender.",
    "Trump returned to Georgia on Saturday night for a rally ahead of the state's May 24 primary to try to boost Perdue in a campaign that is emerging as an early, critical test of whether the former president can live up to his professed role as a kingmaker in the GOP.",
    "Meanwhile, some top national Trump antagonists, including Republican Rep. Liz Cheney of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "Trump has taken a particularly active role in shaping the governor's race, recruiting former Sen. David Perdue to challenge incumbent Brian Kemp as retribution for Kemp not going along with lies about the 2020 election being stolen.",
    "During his waning days in office, Trump pressured Georgia Secretary of State Brad Raffensperger to find? enough votes to overturn Joe Biden's victory, a conversation that is now the subject of a grand jury probe in Atlanta.",
    "Federal and state election officials and Trump's own attorney general have said the election was fair, and the former president's allegations were also roundly rejected by courts, including by judges Trump appointed.",
    "That's why his activity in the state is especially notable as Trump is essentially rallying voters behind candidates who could go on to play critical roles in certifying future elections in which he's a participant.",
    "He will travel to North Carolina next month to try to boost his pick in North Carolina's contentious Senate primary, Republican U.S. Rep. Ted Budd, who has lagged in polling and fundraising behind former Gov.",
    "Duncan, a Republican, said Trump's endorsement isn't the golden ticket? it once was, and his group is launching its first 30-second television spot timed to coincide with the former president's rally.",
    "I think it could be the start of, I don't want to use the word downfall, but it could be the start of his influence waning,? said Eric Tanenblatt, former chief of staff to ex-Georgia Republican Gov.",
    "In it, Duncan decries politicians who would rather talk about conspiracy theories and past losses, letting liberal extremists take us in the wrong direction.?\nYou almost feel bad for David Perdue.",
    "He's a coward and he's a complete and total disaster,? Trump went on, calling Perdue the only Republican who can defeat Stacey Abrams, a Democrat who is running for governor a second time.",
    "Trump has been obsessed with this once Republican stronghold since the aftermath of the 2020 campaign, when he became the first GOP presidential candidate to lose the state in 28 years.",
    "Kemp, who is holding his own Saturday meeting with the Columbia County Republican Party in suburban Augusta, reported having $12.7 million in his main campaign account as of Jan. 31.",
    "Trump's choice in Pennsylvania's Senate GOP primary dropped out, and Trump has so far not sided with a candidate in key but bruising party Senate primaries in Ohio and Missouri.",
    "He's out to settle a score,? Duncan added, referring to Trump, and that's no way to keep conservative leadership in power.?\nDespite such concerns, Trump isn't backing down.",
    "Governor Kemp is focused on making sure Stacey Abrams is never our governor or the next president,? Cody Hall, Kemp's director of communications, said in response.",
    "Geoff Duncan, who isn't seeking reelection but has been staunchly criticized by the former president for his defense of Georgia's 2020 election results.",
    "Jones, for instance, is now competing in a crowded congressional primary in which no one may clear the 50% threshold needed to avoid a runoff.",
    "We're going to see a rally show up that's once again going to confuse Georgians and who knows what Donald Trump's gonna say,? Duncan said.",
    "Kemp was required by state law to certify the results and has repeatedly said any other course would have invited endless litigation.",
    "And in an effort to clear a path for Perdue, Trump pressed another Republican in the race  Vernon Jones  to run for Congress instead.",
    "His backing of football legend Herschel Walker essentially cleared a path to the party's nomination for a critical U.S. Senate seat.",
    "The incumbent governor has vowed to provide an initial investment of at least $4.2 million on TV ads ahead of Georgia's primary.",
    "That (he's) walking off the plank that Donald Trump has put out there for him here in Georgia,? Duncan said in an interview.",
    "The former president has issued highly-coveted endorsements in races ranging from governor to state insurance commissioner.",
    "The Republican incumbents are the statewide officials most closely aligned with Kemp, the leading target of Trump's ire.",
    "Just this week, he threw his support behind the virtually unknown John Gordon to challenge Attorney General Chris Carr.",
    "In Donald Trump's push to fundamentally reshape the Republican Party, few places are a higher priority than Georgia.",
    "If that dynamic holds, Kemp would be within striking distance of winning the primary outright, averting a runoff.",
    "Trump rescinded his endorsement of struggling Alabama Republican Senate primary candidate Mo Brooks on Wednesday.",
    "He's already shown an extraordinary willingness to press officials to overturn results he doesn't like.",
    "He has struggled to raise money and, in a Fox News poll released this month, trailed Kemp 50% to 39%.",
    "The results in Georgia were certified after a trio of recounts, including one partially done by hand.",
    "Other Trump detractors are stepping up spending, including GOP 2.0, a super PAC founded by Lt. Gov.",
    "It could again be central to his political future if he decides to run for the White House in 2024.",
    "While Walker is marching to the primary with minimal opposition, other races are more complicated.",
    "Sonny Perdue and a former fundraiser for David Perdue who is backing Kemp in the primary.",
    "That far outpaced Perdue, who had less than $1 million in cash on hand through January.",
    "Perdue, meanwhile, may pose an even higher-profile challenge for the former president.",
    "He's also endorsed Patrick Witt to go up against Insurance Commissioner John King.",
    "No credible evidence has emerged to support Trump's claims of mass voter fraud.",
    "Associated Press writer Jill Colvin in New York contributed to this report.",
    "Some of those candidates are already struggling.",
    "But there are warning signs for Trump.",
    "They all affirmed Biden's victory.",
    "Weissert reported from Washington.",
    "By the way, where's Brian Kemp?",
    "Where's Brian?? Perdue asked.",
    "He's not here.",
    "You know why?",
    "Pat McCrory."
  ]
}