{
  "id": 285,
  "mediaId": 129,
  "date": "3/25/2022 12:00:00 AM",
  "headline": "Ginni Thomas Texts Expose Rift in House Jan. 6 Panel",
  "image": "https://static01.nyt.com/images/2022/03/25/us/politics/25dc-investigate1/merlin_199257039_ee341056-84ce-4add-9d5c-9c4ac983ec24-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/03/25/us/ginni-thomas-january-6-committee.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2377,
    2377,
    2406,
    2406,
    812,
    812,
    1039,
    1039,
    1147,
    1147,
    1385,
    1385,
    1477,
    1477,
    1248,
    1248,
    562,
    562,
    482,
    482
  ],
  "sentences": [
    "The panel has taken an aggressive posture toward many other potential witnesses, issuing subpoenas for bank and phone records of both high-ranking allies of the former president and low-level aides with only a tangential connection to the events of Jan. 6.\nI think it would be a dereliction not to bring her in and talk to her,? said Kimberly Wehle, a University of Baltimore law professor who has closely tracked the committee's work.",
    "For at least several weeks, the committee's senior level has discussed whether to call Ms. Thomas to testify, as well as whether to issue subpoenas for any other communications she may have had with the White House or the president's legal team about the election, including a message she told Mr. Meadows she sent to Mr. Kushner, according to people with knowledge of the investigation.",
    "WASHINGTON  Buried in the thousands of documents that Mark Meadows, former President Donald J. Trump's final White House chief of staff, turned over late last year to the House committee examining the Jan. 6 attack were text messages that presented the panel with a political land mine: what to do about Virginia Thomas, the wife of Justice Clarence Thomas.",
    "Yet the Republicans, who spoke on the condition of anonymity because they worried about being seen as critical of Ms. Thomas, predicted that if Democrats increased pressure on the Thomases, the right would counter with more calls for investigations of Democrats if Republicans win back the House in the November elections.",
    "That included her role in efforts to overturn the election from her perch on the nine-member board of CNP Action, a conservative group that helped advance the Stop the Steal? movement, and in mediating between feuding factions of organizers so that there wouldn't be any division around Jan. 6,? as one organizer put it.",
    "The panel's Republican vice chairwoman, Representative Liz Cheney of Wyoming, has led the charge in holding Mr. Trump to account for his efforts to overturn the election, but has wanted to avoid any aggressive effort that, in her view, could unfairly target Justice Thomas, the senior member of the Supreme Court.",
    "Perhaps most important, Judge Nichols is the only federal jurist in Washington so far to have thrown out the key obstruction of Congress charge that the Justice Department has used against hundreds of Jan. 6 defendants to describe the political results of a pro-Trump mob storming into the Capitol.",
    "The news media seeks to portray Ginni Thomas's public policy work as a threat to the Supreme Court in order to pressure Thomas to recuse himself from any case that Ginni, or any of the groups she has worked with, has even commented on,? he wrote in an op-ed for The Washington Examiner.",
    "It certainly is inconsistent with their neutral, find the facts where they go' type of approach to this.?\nThe committee's light touch with Ms. Thomas to date reflects a number of considerations by both members and investigators, according to people familiar with the inquiry.",
    "Privately, some Republicans conceded that Ms. Thomas's texts to Mr. Meadows were a mistake  particularly ones in which she urged Mr. Meadows to make Sidney Powell, a lawyer who had advocated conspiracy theories about voting machines being hacked, the face of the legal team.",
    "The public disclosure of the messages on Thursday focused new attention on one avenue of the investigation and risked creating a rare rift within the committee about how aggressively to pursue it, including whether to seek testimony from Ms. Thomas, who goes by Ginni.",
    "The messages showed that Ms. Thomas relentlessly urged Mr. Meadows to overturn the 2020 presidential election, which she called a heist,? and indicated that she reached out to Jared Kushner, the president's son-in-law, about Mr. Trump's legal efforts to keep power.",
    "The House committee investigating the attack on the Capitol said that it would consider contempt of Congress charges against Peter Navarro, a former White House adviser, and Dan Scavino Jr., a former deputy chief of staff, for refusing to comply with its subpoenas.",
    "The committee could recall Dustin Stockton, a rally organizer who told The Times about a conversation he had with Caroline Wren, a Republican who helped raise money for the Jan. 6 March for America,? in which she described Ms. Thomas's peacemaking role.",
    "He may be called upon to rule on questions involving the prosecution for contempt of Congress of Stephen K. Bannon, a onetime aide to Mr. Trump, or concerning the House committee's efforts to obtain emails from Mr. Eastman.",
    "Judge Nichols, the former clerk to Justice Thomas, is overseeing the criminal prosecution of Mr. Bannon, who was charged with contempt of Congress in November after refusing to comply with a subpoena from the committee.",
    "During that period, the Supreme Court was considering a number of cases related to the election, with Justice Thomas taking positions at times sympathetic to Mr. Trump's efforts to challenge the outcome.",
    "The judge is also handling the high-profile defamation lawsuits that Dominion Voting Systems filed last year against two lawyers closely associated with Mr. Trump: Rudolph W. Giuliani and Ms. Powell.",
    "There is debate within the committee investigating the assault on the Capitol over whether to seek testimony from the wife of Justice Clarence Thomas about her efforts to overturn the 2020 election.",
    "The lack of consensus also underscores the extent to which Justice Thomas's shadow, including his network of supporters and former clerks, looms over various aspects of the investigation.",
    "This dynamic was on display during a deposition in December of Mr. Eastman, who was subpoenaed by the committee to talk about his role in helping Mr. Trump try to overturn the election.",
    "That could change, however: On Friday, despite the potential for political backlash, Ms. Cheney indicated she has no objection to the panel asking Ms. Thomas for a voluntary interview.",
    "So although a debate has broken out inside the committee about summoning Ms. Thomas to testify, the panel at this point has no plans to do so, leaving some Democrats frustrated.",
    "Ms. Cheney has indicated that she believes Mr. Trump may have violated the obstruction of Congress law, going so far as to read from the text of the statute on the House floor.",
    "This plus a conversation with my best friend just nowI will try to keep holding on.? (Ms. Thomas and her husband have publicly referred to each other as their best friends.)",
    "In the Thomases, the committee is up against a couple that has deep networks of support across the conservative movement and Washington, including inside the committee.",
    "This month, Ms. Thomas acknowledged attending the rally that preceded the violence in an interview with a conservative news outlet, but otherwise downplayed her role.",
    "If prosecutors ultimately use the law to charge Mr. Trump, it could face scrutiny from Judge Nichols  or from another district judge who could consider his opinion.",
    "John Wood, one of the Jan. 6 committee's top investigators and another former Thomas clerk, is leading the so-called gold team examining Mr. Trump's inner circle.",
    "Representative Mo Brooks, who challenged President Biden's victory on Jan. 6, claimed that Donald J. Trump had asked him to illegally rescind? the election.",
    "They could also recall Amy Kremer and Jenny Beth Martin, two rally organizers close to Ms. Thomas, to ask about her postelection communications with them.",
    "It could subpoena records from not only Ms. Thomas, but also CNP Action, which was deeply involved in the effort to spread falsehoods about the election.",
    "Differing from 12 other federal judges, Judge Nichols wrote in a ruling this month that prosecutors had stretched the statute beyond its original intent.",
    "Three of Justice Thomas's former clerks  a federal judge, a top committee investigator and a key adviser to Mr. Trump  have major roles in the matter.",
    "The ruling could prove important to the House committee as it weighs whether to make a criminal referral to the Justice Department of Mr. Trump.",
    "Her supporters include the lawyer Mark Paoletta, who was Mr. Thomas's sherpa,? introducing him to senators for his confirmation hearings.",
    "Others worried that pursuing Ms. Thomas could by implication sully the reputation of Justice Thomas, an icon among the Republican base.",
    "Investigators could ask her the name of the friend she was referring to when she wrote back to thank Mr. Meadows, saying: Needed that!",
    "And a federal judge, Carl J. Nichols, who is hearing cases related to the Capitol riot, is also a former clerk of Justice Thomas's.",
    "Then came disclosure of the texts to Mr. Meadows, the contents of which were earlier reported by The Washington Post and CBS News.",
    "A main strategist in the effort to try to overturn the election, the lawyer John Eastman, was a former clerk of Justice Thomas's.",
    "If the committee does not summon Ms. Thomas, some legal analysts said, it runs the risk of appearing to have a double standard.",
    "Luke Broadwater reported from Washington, Jo Becker from Los Angeles, Maggie Haberman from New York and Alan Feuer from Albany.",
    "A New York Times Magazine investigation last month examined the political and personal history of Ms. Thomas and her husband.",
    "Ultimately, they could ask her whether she had discussed Mr. Trump's fight to overturn the election with her husband.",
    "Justice Thomas could in the coming months consider a long list of important legal issues surrounding Jan. 6.",
    "Still others argued that the panel could not know the full extent of her role without further questioning.",
    "Mr. Wood began the questioning by noting that Mr. Eastman had once served as a clerk to Justice Thomas.",
    "Such a case, too, could eventually be considered by the Supreme Court and Justice Thomas.",
    "The statement came after Mr. Trump withdrew his endorsement of Mr. Brooks in the G.O.P.",
    "And some members of the committee saw the text messages for the first time on Thursday.",
    "Conservatives have long viewed criticism of Ms. Thomas as an attack on Justice Thomas.",
    "Capitol Riot's Aftermath: Key Developments\nCard 1 of 3\nPotential contempt charges.",
    "Some saw the pursuit of Ms. Thomas as a distraction from more important targets.",
    "Justice Thomas has declined to comment on the matter, through a representative.",
    "A lawyer for Ms. Thomas did not immediately respond to a request for comment.",
    "She even suggested the lawyer who should be put in charge of that effort.",
    "Like you, John,? Mr. Eastman shot back.",
    "There are plenty of leads to pursue.",
    "primary for Alabama's Senate seat.",
    "Requests to rescind? the election."
  ]
}