{
  "id": 294,
  "mediaId": 239,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "Rep. Liz Cheney ditches House Republican retreat",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/23/Liz_Cheney_52139.jpg-09810_c0-0-3600-2098_s885x516.jpg?f93fd2bd88c96b8096e229591f021931916234cb",
  "link": "https://www.washingtontimes.com/news/2022/mar/24/rep-liz-cheney-ditches-house-republican-retreat/",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kerry Picket",
  "authorUrl": "https://www.washingtontimes.com/staff/kerry-picket/",
  "termIds": [
    1147,
    1248,
    1335,
    1468,
    1609,
    2214,
    3085,
    3094,
    146,
    428,
    562,
    2872
  ],
  "sentences": [
    "The panel of seven Democrats and two Republicans has primarily focused on subpoenaing information from Republican lawmakers, their allies and former Trump White House officials that could lead to criminal penalties? against Mr. Trump, Ms. Cheney said recently on NBC's Meet The Press.?\nThe Wyoming Republican is seeking a fourth term and faces a primary in which her strongest opponent, attorney Harriet Hageman, has been endorsed by Mr. Trump and House Minority Leader Kevin McCarthy.",
    "At last year's retreat in Orlando, Ms. Cheney, who was the GOP conference chair at that time, told reporters that former President Donald Trump was no longer the leader of the Republican Party, creating a rift between herself and other GOP lawmakers and officials.",
    "Her absence at the retreat in Ponte Vedra is the latest example of Ms. Cheney's estrangement from the Republican Party after she became a fervent detractor of former President Donald Trump, who remains the leader of the party for most Republicans.",
    "She was kicked off of the House GOP leadership team, was censured and disavowed as a Republican by the Wyoming GOP, faces a tough reelection fight this year and has scores of her House Republican colleagues financing her primary opponent.",
    "Ms. Cheney currently leads Ms. Hageman in campaign fundraising, but more than 100 House Republicans, about half of the GOP conference, have followed Mr. McCarthy's lead and signed on to host a fundraiser for Ms. Hageman.",
    "Months later, House Republicans voted her out as conference chair and early last year, her own state party voted to censure her over her vote to impeach Mr. Trump for inciting the Jan. 6, 2021, riot at the U.S. Capitol.",
    "Ms. Cheney moved further from her party after House Speaker Nancy Pelosi appointed her, and she accepted, to be one of two Republicans on the Democratic-dominated House select committee investigating the Capitol riot.",
    "The other GOP lawmaker is Rep. Adam Kinzinger of Illinois, who voted to impeach Mr. Trump for the riot and recently said he wished he had voted in favor of Mr. Trump's first impeachment in 2017.",
    "Her colleagues, who gathered here to set their political agenda, didn't bemoan her absence: Ms. Cheney does not attend weekly Republican conference meetings and GOP task force sessions.",
    "She was in Jackson, Wyoming, taking questions and giving remarks about U.S. elections on a panel at The Center Theater on Tuesday night and remained in her home state Wednesday.",
    "Earlier this year, the Republican National Committee voted to formally censure Ms. Cheney and Mr. Kinzinger for their involvement on the Jan. 6 investigative panel.",
    "According to Republican staffers, Ms. Cheney neither RSVPed to attend the event nor showed up at the last minute on Thursday.",
    "I guess you can say she's a Republican in name only,? said Rep. Jim Banks of Indiana who was at the GOP retreat.",
    "PONTE VEDRA, Fla.  Rep. Liz Cheney is a no-show at this year's annual House Republican retreat.",
    "The Wyoming GOP later voted, by a narrow margin, to not recognize her as a Republican.",
    "The Washington Times has reached out to Ms. Cheneys office and campaign for comment.",
    "She rarely shows up for Republican Party functions in Washington or Wyoming."
  ]
}