{
  "id": 297,
  "mediaId": 21,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "More than 100 House Republicans will cohost a fundraiser for Rep. Liz Cheney's leading primary challenger",
  "image": "https://i.insider.com/60a27e64f27b4c0019444d2e?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/house-republicans-fundraiser-liz-cheney-challenger-hageman-mccarthy-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    682,
    1095,
    1147,
    1248,
    1563,
    1609,
    2130,
    3085,
    3094,
    422,
    428,
    562,
    2590,
    2707,
    2766
  ],
  "sentences": [
    "Cheney has drawn an intense primary challenge after voting to impeach Trump for \"incitement of insurrection\" tied to the January 6, 2021, riot at the US Capitol, as well as her hard-charging role on the House committee investigating the insurrection.",
    "He's been especially interested in the race, even attempting to meddle into the way that primaries are held in the state in a bid to block Democrats and independents from crossing party lines to vote in the Republican primary.",
    "Per the Politico report, the hosts of the event for Hageman will include House Minority Leader Kevin McCarthy of California and Rep. Elise Stefanik of New York, two of Cheney's most high-profile Republican colleagues.",
    "Stefanik replaced Cheney as the chair of the House Republican Conference amid internal complaints that the Wyoming lawmaker was too vocal in her criticism of former President Donald Trump's debunked election claims.",
    "From left, the House GOP caucus is now led by Minority Leader Kevin McCarthy of California, Minority Whip Steve Scalise of Louisiana, and newly-installed Republican Conference Chair Elise Stefanik of New York.",
    "In Hageman, Republicans are looking for a more reliable partner in a state that during the 2020 presidential election delivered the largest margin of victory for Trump over Joe Biden (70%-27%).",
    "The fundraiser for Hageman, an attorney who specializes in water and natural resources issues, is slated to be held on March 30 at the home of GOP fundraiser Jeff Miller, a McCarthy ally.",
    "She raised $443,000 in the fourth quarter of 2021, but her total was dwarfed by Cheney's $2.04 million quarterly haul, according to documents filed with the Federal Elections Commission.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "More than 100 House Republicans are set to cohost a fundraiser for Harriet Hageman, the leading primary challenger against GOP Rep. Liz Cheney, according to Politico.",
    "Hageman is one of several candidates running in the Republican primary against Cheney, but she is the best-funded challenger.",
    "Scott Applewhite\nMore than 100 House Republicans are cohosting a fundraiser for Liz Cheney's top primary challenger.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Cheney was ousted from her leadership post after her criticism of Trump's debunked election claims.",
    "The event is set to be held on March 30 at the home of GOP fundraiser Jeff Miller, per Politico.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Trump endorsed Hageman last year.",
    "Loading Something is loading.",
    "AP Photo/J."
  ]
}