{
  "id": 299,
  "mediaId": 151,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "More than 100 House Republicans to cohost fundraiser for Cheney challenger",
  "image": "https://www.politico.com/dims4/default/33c22b6/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F37%2Ff9%2Fbf2c36af4633832acd415691f991%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1234237242",
  "link": "https://www.politico.com/news/2022/03/23/republicans-fundraiser-liz-cheney-challenger-00019758",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1095,
    1147,
    1248,
    1609,
    2130,
    3085,
    3094,
    422,
    428,
    562,
    2976
  ],
  "sentences": [
    "The Wyoming congresswoman has drawn the ire of Republicans for her vote to impeach former President Donald Trump and her continued outspoken criticism of him, as well as her decision to sit on the committee investigating the Jan. 6 Capitol riot.",
    "The fundraiser has drawn the support of members of the conservative House Freedom Caucus, which is closely aligned with Trump, but it is also being hosted by members of the moderate Governance Group and Main Street Partnership.",
    "According to details about the event obtained by POLITICO, the list of hosts includes House Minority Leader Kevin McCarthy and Rep. Elise Stefanik of New York, who succeeded Cheney as chair of the House GOP conference last May.",
    "Hageman has raked in more than $1 million so far during the first fundraising quarter, which closes at the end of the month, according to a person familiar with the totals.",
    "The sum is considerable: During the fourth fundraising quarter of 2021, only three non-incumbents running for the House raised more than $1 million.",
    "More than 100 House Republicans have signed on to host a fundraiser for Harriet Hageman, who is waging a primary challenge to Cheney in Wyoming.",
    "| Andrew Harnik-Pool/Getty Images\nBy Alex Isenstadt\n 03/23/2022 03:24 PM EDT\nFirst House Republicans kicked Rep. Rep. Liz Cheney (R-Wyo.)",
    "The event is slated to be held March 30 at the home of Republican fundraiser Jeff Miller, a longtime McCarthy adviser.",
    "has drawn the ire of Republicans for her vote to impeach former President Donald Trump (not shown).",
    "Through the end of last year, the congresswoman had more than $4.7 million in the bank.",
    "Hageman's support within the GOP conference crosses the ideological spectrum.",
    "The Daily Caller was first to report on the existence of the fundraiser.",
    "Cheney has amassed a formidable war chest of her own, however.",
    "The figure amounts to roughly half of the entire House GOP.",
    "Now they're trying to kick her out of Congress entirely.",
    "Trump endorsed Hageman last year.",
    "out of party leadership.",
    "Rep. Liz Cheney (R-Wyo.)"
  ]
}