{
  "id": 3125,
  "mediaId": 65,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Tucker: Our leaders believe protecting Ukraine is more important than protecting you",
  "image": "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/db2e722b-a281-4e7b-9800-aa294289c13b/3929e82f-c17e-482d-ba2f-741677993847/1280x720/match/931/524/image.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/opinion/tucker-our-leaders-believe-protecting-ukraine-is-more-important-than-protecting-you",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1335,
    1433,
    2159,
    2535,
    2959,
    2942,
    2934
  ],
  "sentences": [
    "HOUSE REPUBLICANS CALL FOR BIDEN ADMINISTRATION TO ADDRESS NATIONWIDE BABY FORMULA SHORTAGE\nYou got to hope that there's some sincere billionaire out there who's going to fund a primary challenge against every single one of those Republican state senators standing by Mitch McConnell, as he said, and we'll quote again, \"I think we all agree the most important thing going on in the world right now is the war in Ukraine.\"",
    "No, the most important thing going on in the world right now is the state of your country, the one you're supposed to run, the people you're supposed to represent, whose lives are supposed to care about, the ones who can't buy food or gas, the people ODing on fentanyl, 107,000 in a year dead, young people, Americans.",
    "ALL REPUBLICAN PA. SENATE CANDIDATES SIGN ANTI-CRITICAL RACE THEORY PLEDGE YOUNGKIN BACKED BEFORE VIRGINIA WIN\nDan Crenshaw of Texas, for example, not a stupid guy, just announced that we're, \"investing in the destruction of our adversaries' military\" when we spend $40 billion on Ukraine.",
    "Now this is happening because senior leaders of the Republican Party instantly bought the New York Times' position on Ukraine, as they instantly bought the New York Times' position on the BLM riots, as they instantly bought the position of the New York Times on the COVID lockdown.",
    "o it shouldn't shock you that Nikki Haley's first reaction to the Russia invasion and Mitch McConnell's first reaction too and the first reaction of so many other Republican leaders was that protecting Ukraine is way more important to protecting you, than protecting America.",
    "This war is about the rest of the world and Putin trying to establish autocratic governments throughout, throughout the world, and we know that this is taking place through disinformation campaigns, through all kinds of misinformation that's taking place.",
    "Do you remember that two years ago this month, Nikki Haley, former governor of South Carolina, running for president (she's conservative) told Americans in the first days of the riots that they deserved to suffer after George Floyd died?",
    "NANCY PELOSI BLASTED FOR QUOTING GOSPEL IN SUPPORT OF UKRAINE AID BILL AMID AMERICAN SHORTAGES: 'AWFUL'\nOh, so Jesus wants to send more missiles to Ukraine and the more missiles we send to Ukraine, the less hungry people are going to be?",
    "PELOSI: The wall is, in my view, immoral, expensive, unwise and when the president says, \"Well, I promised a wall during my campaign,\" I don't think he said he was going to pass billions of dollars of cost of the wall onto the taxpayer.",
    "One bill, more than double what we're spending this year on our borders and then in the middle of this historic drug emergency, and it is, the bill spends more than ten times the entire budget of the DEA (More than ten times!).",
    "We could spend the next hour playing clips of Lindsey Graham going back 20 years, making predictions that didn't come true and resulted only in the death of American servicemen and the impoverishment of the United States.",
    "But we know for certain that wars against things you can't really identify, against people who don't exist, wars against concepts, one thing we know about those wars, like the war on terror, is they last forever.",
    "As Congressman Thomas Massie has pointed out, Congress has now spent more money on Ukraine in six months than the U.S. government spent on all roads and all bridges in the United States over all of last year.",
    "Congress, who was feeling kind of sporty, also added $150 million for something called the Global Agriculture and Food Security Program because while we're feeding Ukraine, why not feed the rest of the world?",
    "This is the saddest thing that has happened to our country in a very long time, and yet Congress, which claims to run the country, can't be bothered even to acknowledge it, much less do anything about it.",
    "Now, not combat human trafficking in Texas, where it is now ubiquitous thanks to the open border with Mexico, but to combat human trafficking in Ukraine, because it's sad what's happening there.",
    "And then because paying off your friends is always the real point of these exercises in Washington, there are billions more dollars for Lloyd Austin's former employers in the weapons business.",
    "Not just the peril, the real peril, that this could escalate into something crushing for the West, but what immediate cost to the United States and our own ability to defend ourselves?",
    "In other words, you can't afford to fill your truck, but you now get to pay the living expenses of anyone who shows up in your country claiming to be from Ukraine and you will.",
    "Here, for example, is how Congressman Jamie Raskin of Maryland responded when Marjorie Taylor Greene of Georgia raised an objection with \"Oh, wait, what about our country?\"",
    "This is presenting Western countries with a stark choice between pouring more supplies into Ukraine or husbanding finite capabilities they may need for their own defense.\"",
    "We want to know why this is in America's interest, why this is more important than the pressing crises all around us that the rest of us notice and apparently you don't.",
    "After 100 years of virtually uninterrupted wealth generation, the American economy appears to be faltering in ways that are scary to anyone who's paying attention.",
    "Here's a formula for the destruction of democracy  repeating Putin's propaganda and disinformation and appeasing imperialist assaults on sovereign nations.",
    "Well, for perspective, it is more than we spent per year on average on the war in Afghanistan, a war that began with a direct attack on the United States.",
    "Now, if you remember her name, it may be because in 2001, Barbara Lee of Berkeley was the only member of Congress to oppose the war against the Taliban.",
    "Right now, Joe Biden and the U.S. Congress have sent so much military aid to Ukraine that our country, the United States, is running out of weapons.",
    "The main course of all this funding from day one has been to secure Ukraine's borders because, you know, you can't have a country without borders.",
    "HOUSE SPEAKER NANCY PELOSI: The brutality of Putin is not just what he's doing in Ukraine, but the impact that it is having on food for the world.",
    "MCCONNELL CALLS ON DOJ TO INVESTIGATE PROTESTERS FOR INTIMIDATING JUDGES AFTER SCOTUS OPINION LEAK\nThen there's the problem of \"food insecurity.\"",
    "There's still more money to make sure Ukrainians have emergency shelter because apparently more than a million Americans aren't homeless tonight.",
    "And the worst part is this bill will almost certainly pass in the Senate, which is way more left wing even than the House on the Republican side.",
    "As his office put it, \"Senator Graham has made it clear he supports additional military aid to Ukraine\" because it makes him feel so good inside.",
    "Instead, your representatives in Washington just voted to send yet another $40 billion to Ukrainian oligarchs who paid off the president's son.",
    "SENATE MINORITY LEADER MITCH MCCONNELL: I think we all agree the most important thing going on in the world right now is the war in Ukraine.",
    "RUSSIAN HACKERS 'RAMPING UP EFFORTS' AFTER CYBERATTACK SHUT DOWN UKRAINE INTERNET CONNECTIONS, MUSK WARNS\nSo it's not really about Ukraine.",
    "According to Bloomberg, \"Pentagon officials say that Kyiv is blowing through a week's worth of deliveries of anti-tank munitions every day.",
    "That's how a lot of Americans felt last night watching the House of Representatives approve yet another massive aid package for Ukraine.",
    "They stand as one, but also, as usual, a sustained propaganda campaign in the American media has managed to divide the Republican Party.",
    "Food is getting expensive in Ukraine, so we're going to spend $760 million to fix that just in this check and not just in Ukraine.",
    "They also told us that Daines thinks Russian oligarchs somehow will pay the $40 billion, \"He wants to make Russia cover the costs.",
    "Wait a second, wouldn't Jesus want to do everything possible to bring an end to the war in Ukraine, you irreligious little twit?",
    "Nancy Pelosi was out there first taking the most extreme possible position and then a lot of Republican leaders agreed with her.",
    "NATO COUNTRY IS ALLOWING NATIONALS TO JOIN UKRAINE'S ARMY, FIGHT RUSSIA\nIf you don't believe it, think back the last two years.",
    "An unknown amount of money to the CIA in the Ukraine supplemental bill, but there's no formula for American babies and mothers.",
    "That would include Mitch McConnell, the minority leader, Ted Cruz, Mike Lee, Chuck Grassley, Mitt Romney also did not respond.",
    "The $40 billion we're sending to Ukraine so they can secure their borders, by the way, is more than double (More than double!)",
    "About 107,000 of your fellow Americans, most of them young people who should have had long, productive lives are instead dead.",
    "That would include $72 million for something the bill describes as \"research, development, test, and evaluation in Ukraine.\"",
    "If you agree with that, you should not be sitting in the United States Senate as a Republican and yet that's their position.",
    "Here's why, because Republican officeholders, no matter how conservative they tell you they are, believe The New York Times.",
    "Border security in United States is immoral, but Jesus is strongly for border security and Ukraine and abortion, by the way.",
    "It's a scary world and if you blow it all on Ukraine with finite resources, which we have, sorry, where does that leave you?",
    "$54 billion  that's about as much as Russia, the country, spends on its entire armed forces over the course of a full year.",
    "By the way, there was a time when Nancy Pelosi didn't want to spend billions of dollars to secure a country's borders.",
    "Congress has decided to fix all of the pressing problems that need to be fixed except fix them in Ukraine, not here.",
    "They say it all the time, usually without looking up from their iPhones, but you can tell they don't really mean it.",
    "SEN. LINDSEY GRAHAM: And if Putin's still standing after all this, then the world is going to be a very dark place.",
    "Now, 57 Republicans did vote against last night's bill and God bless them for doing it, but many more voted for it.",
    "Just in case you're wondering how your leaders feel about you, they're not fans at all, and now we know for sure.",
    "BRET BAIER, \"SPECIAL REPORT\" ANCHOR: Alright, so you're saying that that's how this ends, that Putin is removed?",
    "I had a chance to call the president last week and request that the Ukraine package move by itself and quickly.",
    "Ukraine is a war zone and therefore probably not a great place for scientific research right now, but whatever.",
    "You thought we had a mess on our hands when Saddam's arsenals fell into the hands of lunatics and extremists.",
    "There's $900 million to make sure Ukrainians have access to \"entitlement programs\" our entitlement programs.",
    "We want to invite any Republican senator who plans on voting for this to come on this show and explain why.",
    "And of course, that will obviously include baby formula, too, because kids in other countries need to eat.",
    "China is going to get the wrong signal and we'll have a mess on our hands in Europe for decades to come.",
    "They always go farther in one direction and the Republican Party is always led by people who join them.",
    "REP. MARJORIE TAYLOR GREENE: $40 billion, but there's no baby formula for American mothers and babies.",
    "Glad to see that Dan Crenshaw has signed up for this new campaign, but you got to wonder at what cost?",
    "The first reaction of every Democrat is always to read whatever talking points Nancy Pelosi provides.",
    "Tim Ryan was supposed to be a working man's Democrat, a guy who cares about bread-and-butter issues.",
    "This is a war on disinformation, which at some point in some way is dead certain to be a war on you.",
    "It's also running short of usable aircraft as Russian airstrikes and combat losses take their toll.",
    "So, you can't buy baby formula in the United States and maybe you think you can do both at once.",
    "Voting \"no\" will be Mike Braun, Roger Marshall, Marsha Blackburn, Bill Hagerty and Josh Hawley.",
    "You should know that every single Democrat in the House of Representatives voted for this bill.",
    "Nancy Pelosi strongly believes that about Ukraine and so do her friends on the Republican side.",
    "He called back in about 15 minutes and agreed that we need to do this Ukraine only and quickly.",
    "Instead, they spent all their time and all their money buying gifts for a kid down the street.",
    "Let's say you're a kid and you've convinced yourself that your parents don't really love you.",
    "There is nothing in the world worse than finding out that your deepest fears are justified.",
    "All the things that you asked for, they gave to another nine-year-old you have never met.",
    "You saw the same dynamic in the early days of both the BLM riots and the COVID lockdowns.",
    "The gentleman, gentlewoman from Minnesota reserve, gentleman from Maryland is recognized.",
    "These are the cities that built America, crumbling and desperate now from total neglect.",
    "No question about it, because you're a font of disinformation, meaning you disagree.",
    "Nothing against Ukraine, but we could probably use that money here right about now.",
    "Of course, there was Liz Cheney and Adam Kinzinger and their friend Elise Stefanik.",
    "But a handful of senators did respond and we want to let you know where they stand.",
    "We reached out to every Republican in the Senate to find out what they plan to do.",
    "what Joe Biden has asked to fund Customs and Border Security in the United States.",
    "Even people who aren't paying attention can sense there's something really wrong.",
    "You can add it to the approximately $14 billion they've already spent on Ukraine.",
    "That's what happened, and it's just the latest check that Congress has cut them.",
    "You would know for a dead certain fact that your parents really didn't love you.",
    "For Pelosi, funding Ukraine at any cost is more than a foreign policy objective.",
    "\"In order to heal, it needs to be personal and painful for everyone,\" she wrote.",
    "A lot of people died and that was good because your racism killed George Floyd.",
    "That's the nightmare scenario, learning there really is a zombie in the closet.",
    "Pat Toomey, Tim Scott, Cindy Hyde-Smith all refused to give us a direct answer.",
    "But there was also Republican leadership, top leadership, McCarthy and Scalise.",
    "And the consequences - now, we are short on weapons to defend our own country.",
    "So, is Steve Daines of Montana, \"The senator is leaning yes,\" his office said.",
    "Thanks, Barbara Lee, for being dim enough to tell us that, to say it out loud.",
    "Now, don't say biolabs because that's not a lab, but honestly, this is weird.",
    "And yet it is happening and so is the deadliest drug epidemic in our history.",
    "It's weird to see a guy live out his strange little fantasy life on TV live.",
    "Just think about, \"When I was hungry, you fed me\" in the Gospel of Matthew.",
    "As usual, Democrats, as ludicrous this may sound, are united on this point.",
    "What would happen to those 6,000 nuclear weapons if we just take out Putin?",
    "Stop name-calling and answer the question, but Jamie Raskin won't do that.",
    "Because there's no potential chance that war could help the United States.",
    "All these people who love the military, do they ever ask that question?",
    "Maybe there's an answer to the question, but notice they don't answer.",
    "Then there's another huge chunk of cash to \"combat human trafficking.\"",
    "Those who are working are getting poorer quickly, thanks to inflation.",
    "They just accuse the person asking the question of working for Putin.",
    "Ammunition has become scarce in Mariupol and other areas in Ukraine.",
    "He wants to use the seized assets of oligarchs to cover the costs.\"",
    "In fact, they allocated $7 billion more than Joe Biden asked for.",
    "You discover they've forgotten to buy you presents, any presents.",
    "It is a ludicrous amount and yet Congress happily approved it.",
    "You can fund Ukraine and get baby formula for American babies.",
    "He's gotten wrong every single time and he's still out there.",
    "That brings the total as of tonight to more than $54 billion.",
    "So it's a little weird to see Tim Ryan of Ohio vote for this.",
    "Well, you would be crushed, but you would also be vindicated.",
    "But a war in Ukraine is a war that Barbara Lee can support.",
    "We're funding some kind of science experiments in Ukraine.",
    "It wasn't that long ago, by the way, it was April of 2017.",
    "Investing in the destruction of our adversaries' military?",
    "Well, since Putin stole the election from Hillary Clinton.",
    "And that's how the left controls them every single time.",
    "They don't want to be criticized by The New York Times.",
    "Mitch McConnell hasn't, to his credit, moved from that.",
    "We literally have a shortage of baby formula right now.",
    "We should be paying attention to our country right now.",
    "Now, no Democrat ever goes against his own herd, ever.",
    "That's the line \"they may need for their own defense.\"",
    "They'll need them when they arrive here, as many will.",
    "She read it inThe New York Times, and she believed it.",
    "So, when you're home thinking, what is this all about?",
    "REP. BARBARA LEE: This war is not only about Ukraine.",
    "All of a sudden everything is wildly more expensive.",
    "Rand Paul has also indicated he's opposed the bill.",
    "He wouldn't say so, but of course he's against it.",
    "Maybe you can fix inflation and also fund Ukraine.",
    "We all agree Ukraine is the most important thing.\"",
    "Tim Ryan is totally committed to rebuilding Kyiv.",
    "Did you think that would happen in America ever?",
    "That would include even Barbara Lee of Berkeley.",
    "REP. SHEILA JACKSON LEE: Gentlelady, yield back.",
    "I think we're on the path to getting that done.",
    "They've died from drug ODs over the past year.",
    "They were busy and it just slipped their mind.",
    "They don't tell us how Ukraine is a democracy.",
    "Chuck Schumer is promising a swift vote on it.",
    "Oh, he didn't say that, but that's the truth.",
    "Rob Portman of Ohio is leaving, thank heaven.",
    "And then one Christmas morning, confirmation.",
    "And the bill goes on like this and on and on.",
    "So, let's take out Putin by helping Ukraine.",
    "Now, why does this happen every single time?",
    "REP. JAMIE RASKIN: Thank you, Madam Speaker.",
    "She's for spending billions at borders now.",
    "She said it was wasteful and morally wrong.",
    "Ukrainian border security is the main goal.",
    "Of course, it's Lindsey Graham's position.",
    "Lindsey Graham, needless to say, is a yes.",
    "Tim Ryan represents Youngstown and Akron.",
    "It's about something bigger than Ukraine.",
    "They're not even very interested in you.",
    "\"But that's nothing compared to Ukraine.",
    "In the end, it was personal and painful.",
    "We're hoping they'll vote the right way.",
    "Speak slowly and tell us how that works.",
    "Since when do we declare war on Russia?",
    "We'll let you talk as much as you want.",
    "They care deeply what legacy media say.",
    "They read The New York Times every day.",
    "That was Nikki Haley's first reaction.",
    "Lindsey Graham won't come on the show.",
    "That's how excited they were to do it.",
    "The country has 6,000 nuclear weapons.",
    "Just to give you yet another example.",
    "It's a kind of religious observance.",
    "We've got more food than we can use.",
    "They didn't question what they read.",
    "They never listen to the other side.",
    "Most of them didn't bother to reply.",
    "None of them will come on the show.",
    "Since when are we fighting Russia?",
    "They're high on their own supply.",
    "They banned the opposition party.",
    "See if you notice the difference.",
    "Take a look at Akron some time.",
    "Lots of people are not working.",
    "They don't even think about it.",
    "That means as soon as tomorrow.",
    "We're not going to sandbag you.",
    "He said, let me think it over.",
    "How dare you quote that book.",
    "But not here, that's not sad.",
    "How would that make you feel?",
    "It's like a war zone itself.",
    "GRAHAM: There's no off-ramp.",
    "BAIER: There is no off-ramp?",
    "But maybe there's an answer.",
    "She was opposed to it then.",
    "No more questions from you.",
    "Where is this money going?",
    "\"You're working for Putin.",
    "You're against democracy.\"",
    "Did anybody vote for that?",
    "Our adversaries' military?",
    "That's what you do in war.",
    "Let's just take out Putin.",
    "Here's what he said back.",
    "Oh, that's the best part.",
    "They don't seem sincere.",
    "Would they be unsecured?",
    "\"Let's take out Putin.\"",
    "What would happen then?",
    "He screams about Putin.",
    "They have to be secure.",
    "Oh, did you catch that?",
    "And so is Nancy Pelosi.",
    "Here he was yesterday.",
    "A few senators dodged.",
    "You're always welcome.",
    "GRAHAM: No, off-ramp.",
    "Not here, in Ukraine.",
    "Here's her reasoning.",
    "But don't you worry.",
    "He still thinks it.",
    "They claim they do.",
    "That's a democracy?",
    "None of them will.",
    "We're ignoring it.",
    "Have you noticed?",
    "How much is that?",
    "Is there any way?",
    "It's a sacrament.",
    "He's also a yes.",
    "They don't care.",
    "Please tell us.",
    "He's thrilled.",
    "I yield back.",
    "What changed?",
    "He's afraid.",
    "They all do.",
    "Right, okay.",
    "So, tell us.",
    "What is it?",
    "Undefended.",
    "Thank you.",
    "she said.",
    "Shameful.",
    "Really?",
    "Really?",
    "Watch.",
    "Hmm.",
    "Why?"
  ]
}