{
  "id": 3126,
  "mediaId": 136,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Nebraska Primary Gives Trump Reason to Worry About Liz Cheney Race",
  "image": "https://d.newsweek.com/en/full/2035560/former-president-trump.webp?w=790&f=8a9541be6b61927df7342bb16ca4b751",
  "link": "https://www.newsweek.com/trumps-concerns-about-liz-cheney-likely-intensified-after-nebraska-primary-1705634",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Jackson",
  "authorUrl": "https://www.newsweek.com/authors/jon-jackson",
  "termIds": [
    2136,
    1801,
    1909,
    1248,
    1053,
    1147,
    826,
    428,
    2976,
    2816
  ],
  "sentences": [
    "She has also publicly countered his unproven claims that the 2020 presidential election was stolen, and she drew more ire from his supporters by accepting a vice chair position on the House select committee investigating the Capitol riot.",
    "Cheney pulled in $2.94 million in contributions for the first quarter of 2022, while Hageman's campaign announced it reached just over $1 million, according to the Wyoming Tribune Eagle.",
    "Six of those candidates polled in the single digits or lower, but the Associated Press reported Wednesday that state Senator Brett Lindstrom drew 25.8 percent of the vote.",
    "University of Nebraska Regent Jim Pillen was declared the winner of Nebraska's GOP gubernatorial primary, besting Trump-endorsed business executive Charles Herbster.",
    "The New York Times said she not only opposed her party in naming Trump as its presidential nominee in 2016 but she also referred to him as \"racist\" and \"xenophobic.\"",
    "Former President Donald Trump's status as GOP kingmaker took a hit during Tuesday's Republican primaries when his pick in the race for Nebraska governor fell short.",
    "Cheney was the highest-ranking Republican to vote to impeach Trump in January 2021 over allegations that he played a role in inciting the U.S. Capitol riot.",
    "Several factors played into Pillen's victory, such as his endorsements from prominent state Republicans, including current Governor Pete Ricketts.",
    "Though it's not clear who Lindstrom siphoned the most votes from, Pillen won with just 33.9 percent of the vote to Herbster's 30.2 percent.",
    "The loss also likely underscored to Trump the importance of his declared strategy for defeating GOP Representative Liz Cheney of Wyoming.",
    "However, Politico speculated in March that state Senator Anthony Bouchard could draw support away from Hageman in the congressional race.",
    "Hageman also has the benefit of Wyoming's primary not being held until August, and Trump has already begun building up his push for her.",
    "No recent polls have been conducted in the Wyoming GOP race, but Cheney and Hageman are by far the leaders in campaign contributions.",
    "That backing resulted in a huge uplift in the polls, and Vance carried that momentum to a win in Ohio's GOP primary for U.S. Senate.",
    "To do so, he called on his supporters to rally behind one candidate, namely Harriet Hageman, whom he endorsed last September.",
    "Trump has been outspoken in his disdain for Cheney, as well as his desire to see her beaten in Wyoming's August 16 primary.",
    "Another possible factor in Herbster coming up short was the presence of other Republican candidates on Tuesday's ticket.",
    "The Casper Star-Tribune reported in December that Bouchard admitted to impregnating a 14-year-old girl when he was 18.",
    "Herbster, meanwhile, was hit with accusations of sexual misconduct from multiple women in the lead-up to the primary.",
    "Vance also made derogatory comments about the former president in the past, only to later secure his endorsement.",
    "\"The easiest way to defeat Deplorable Liz Cheney is by having only ONE Conservative candidate run and WIN!\"",
    "Hageman may also not have overwhelming support from Trump's base in Wyoming, even with his endorsement.",
    "Bouchard has long been a Trump loyalist, but an incident from his past could harm his campaign.",
    "In addition, the former president will appear at a May 28 rally for Hageman in Casper, Wyoming.",
    "Bouchard legally married the girl in Florida; they reportedly were divorced three years later.",
    "Numerous outlets have reported on previous statements Hageman made about Trump in 2016.",
    "However, there are four other candidates joining Hageman in the race for Cheney's seat.",
    "A new ad blitz, featuring Donald Trump Jr. began this week that targets Cheney.",
    "In addition to Pillen and Herbster, seven other people appeared on the ballot.",
    "Trump said in a statement released on July 30, 2021.",
    "(Herbster has denied all the allegations.)",
    "Newsweek reached out to Trump for comment.",
    "However, J.D."
  ]
}