{
  "id": 3127,
  "mediaId": 195,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Audio: Graham knocked Trump in wake of Jan. 6 attack",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/grahamlindsey_101520gn11_lead.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/senate/3484298-audio-graham-knocked-trump-in-wake-of-jan-6-attack/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Olafimihan Oshin",
  "authorUrl": "https://thehill.com/author/olafimihan-oshin/",
  "termIds": [
    2087,
    1668,
    1147,
    1248,
    1311,
    1464,
    84,
    2945
  ],
  "sentences": [
    "During an appearance on CNN's Anderson Cooper 360? on Tuesday, New York Times reporters Alex Burns and Jonathan Martin shared audio in which Graham can be heard criticizing Trump for the deadly attack on the Capitol, saying that the former president went too far.?\nGraham's comments are reported on in Burns and Martin's new book, This Will Not Pass: Trump, Biden, and the Battle for America's Future.?\nHe's misjudged the passion, he plays the TV game and he went too far here,? Graham says in the clip.",
    "He created a sense of revenge.?\nGraham's comments in the clip come from a time when Graham was also publicly voicing his opposition to those who wanted to block Congress from certifying the 2020 Electoral College results hours after the Capitol insurrection, pushing back on Trump's false election claims.",
    "The former president threatened to back a primary challenger against Cheney due to her being one of the few GOP lawmakers to push back on his of his false claims that the 2020 election was riddled with fraud.",
    "New audio released this week reveals that Sen. Lindsey Graham (R-S.C.) knocked former President Trump in the immediate aftermath of the Jan. 6, 2021, attack at the Capitol.",
    "I tried to be helpful.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "We got to get rid.?\nGraham, a frequent fervent ally of Trump's, pushed back on those remarks in the leaked audio.",
    "That rally didn't help, talking about primarying Liz,? Graham says in the audio clip.",
    "The Liz Cheney's of the world, we got to get rid of them,? Trump said at the rally.",
    "Graham also took a shot at Trump over his remarks about Rep. Liz Cheney (R-Wyo.)",
    "We got to get rid of the weak congresspeople, the ones that aren't any good.",
    "Trump and I, we had a hell of a journey,? Graham said on the House floor.",
    "Oh my god, I hate it  but today all I can say is count me out.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "at a rally from the White House Ellipse just before the riot.",
    "I hate it being this way.",
    "Enough is enough."
  ]
}