{
  "id": 3129,
  "mediaId": 21,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "New audio tapes have leaked of Sen. Lindsey Graham saying that Trump 'went too far' and 'plays the TV game,' while calling Biden the 'best person to have' post-January 6",
  "image": "https://i.insider.com/615037cd2fb46b0019be251d?width=1300&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/new-audio-tapes-leaked-of-lindsey-graham-criticizing-trump-2022-5",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cheryl Teh",
  "authorUrl": "https://www.businessinsider.com/author/cheryl-teh",
  "termIds": [
    1147,
    1248,
    1311,
    1464,
    1668,
    2087,
    3094,
    296
  ],
  "sentences": [
    "Graham was likely referring to a part of Trump's speech at the Ellipse on January 6, 2021, when Trump suggested that his supporters \"primary the hell\" out of those who do not fight to overturn the election.",
    "In a second audio tape played on CNN, Graham is heard saying in an interview after the riot that he thought Trump \"misjudged the passion,\" criticizing the former president's actions.",
    "Sen. Lindsey Graham was heard in new audio tapes criticizing former President Donald Trump after the Capitol riot, saying Trump was playing \"the TV game\" and going \"too far.\"",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "In Burns and Martin's new book \"This Will Not Pass,\" they claim that Graham threatened to invoke the 25th Amendment to remove Trump from office during the Capitol riot.",
    "Martin interviewed Graham on January 6 directly after the riot, and the senator spoke candidly about then-President-elect Joe Biden and the former president, Trump.",
    "New audio tapes have surfaced of Sen. Lindsey Graham, a known Trump ally, criticizing Trump and praising Biden after the January 6 Capitol riot.",
    "The tapes were played on CNN's \"Anderson Cooper 360\" during an interview segment with New York Times reporters Alex Burns and Jonathan Martin.",
    "Graham has also publicly criticized Trump for floating the possibility of pardons for Capitol rioters, calling Trump's idea \"inappropriate.\"",
    "Trump later mocked Graham, calling him a \"progressive senator\" from South Carolina\" during a March fundraising dinner at Mar-a-Lago.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "What this does, there will be a rallying effect for a while, (then) the country says \"We're better than this.'\"",
    "Graham is also heard criticizing Trump in another tape, saying he \"plays the TV game\" and \"went too far.\"",
    "Getty Images\nNew audio has leaked of Sen. Lindsey Graham revealing his feelings about Biden and Trump.",
    "In a post-Capitol riot interview, Graham is heard saying he thinks Biden is the \"best person\" to have.",
    "The term has been used often against Trump critics like GOP Reps. Liz Cheney and Adam Kinzinger.",
    "This then prompted Trump to call Graham a RINO, a GOP insult meaning \"Republican in name only.\"",
    "In the first audio clip, Graham said he thought everyone would \"come out of this stronger.\"",
    "He was then asked if Biden would help make that happen, to which Graham said: \"Totally.\"",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "People will say, 'I don't want to be associated with that,'\" Graham said.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"He'll maybe be the best person to have,\" Graham is heard saying.",
    "\"That rally didn't help, talking about primarying Liz (Cheney.)",
    "However, Graham may have had a more complicated view of Trump.",
    "Graham is known to be a staunch ally of the former President.",
    "\"He plays the TV game and he went too far here,\" Graham said.",
    "\"I mean, how mad can you get at Joe Biden?\"",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"This is a group within a group.",
    "He created a sense of revenge.\"",
    "Loading Something is loading.",
    "\"Moments like this reset.",
    "People will calm down."
  ]
}