{
  "id": 314,
  "mediaId": 43,
  "date": "3/19/2022 12:00:00 AM",
  "headline": "The Democrats' complicated dance with neoconservative heiress Liz Cheney",
  "image": "https://images.dailykos.com/images/970280/story_image/GettyImages-1329925132.jpg?1627353017",
  "link": "https://www.dailykos.com/story/2022/3/19/2086758/-The-Democrats-complicated-dance-with-neoconservative-heiress-Liz-Cheney",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2034,
    2034,
    2239,
    2239,
    754,
    754,
    1248,
    1248,
    516,
    516,
    146,
    146,
    428,
    428,
    2976,
    2976
  ],
  "sentences": [
    "Hageman has won the former president's endorsement, but Cheney still has friends in high places: Republicans from the pre-Trump era continue to support her, fueling speculation that she's laying the groundwork for something more,? according to CNN, which notes that she has demonstrated impressive fundraising prowess, including raising a personal record $2 million in the final quarter of 2021.? And yet, for all that prowess, it's becoming clear that she will probably need some additional assistance to win back her seatspecifically, from Democrats.",
    "It seems a bad deal to me, especially in a week when the fruits of neoconservatism have been so vividly on display in reports that a Kuwaiti detainee, rendered to a CIA black site in Afghanistan, was used as a living prop to teach trainee interrogators, who lined up to take turns at knocking his head against a plywood wall, leaving him with brain damage.? With democracy on the line, is neoconservatism truly something that Democrats want to associate with?",
    "Biden's own Democratic National Convention was an often perverse display of moderate Republican courtship, with spare-no-expense production values given to Ohio Republican John Kasich to stand at a literal crossroads to make a point about a figurative crossroads, while Maine's Sara Gideon was reduced to introducing a musical guest despite being in a competitive Senate race against Susan Collinsa seat that Democrats would dearly love to have now.",
    "Writing for The New Republic, Samuel Moyn pinpointed an even more troubling aspect of this partnership: the extent to which Never Trumpism was being driven primarily by the foreign policy lifers of the Bush-Cheney era, the stalwart crew? who feared that Trump threatened the Cold War national security consensus? that gave rise to so much neoconservative misadventure.",
    "While it would be unfair to dismiss Cheney's opposition to Trumpism as insincereshe's surely seen little political benefit for taking the stances she's takenthis might be a good occasion for Democrats to consider how much longer they want to be in the Liz Cheney business, given what a poor defender of democracy she has actually been during her career.",
    "It's worth noting that earlier this week, Commentary's John Podhoretz crowed that neoconservatism had been vindicated, in part because hip liberals? are no longer its loudest critics (instead, he argues, traditional conservatives'  have taken their place as the leading anti-American voices of our time?).",
    "While Trumpists are snatching up key positions in the country's electoral mechanics, with an eye toward tilting the next presidential contest, Never Trumpers are writing op-eds, retiring from the fight, and occasionally making a complete mess of trying to help Democrats win elections.",
    "As POLITICO's Tara Palmeri reported this week, Wyoming political strategists say the only path to victory for Cheney is with the help of Democrats and independents.? Party-switchers have, notably, come through for Republicans before: Wyoming Gov.",
    "But is this truly a good use of finite resources, to ensure that Wyoming's ruby-red House seat remains in the hands of someone who only voted with Trump 93% of the time, instead of one who will exceed that loyalty by a few percentage points?",
    "Wyoming Rep. Liz Cheney, who in recent years has emerged as the Harley Quinn of Washington's Never Trump suicide squad, is facing a tough reelection fight against Harriet Hageman, a former Cheney adviser who has since been Trump-pilled.",
    "As CNBC's Brian Schwartz reported last October, liberal buckrakers of real renown have lately lined Cheney's larder, including Ron Conway, one of President Joe Biden's top campaign bundlers,? and John Pritzker, cousin of Illinois Gov.",
    "It's one thing for voters in Wyoming to strategically align themselves for the best of a bad result; it's another thing entirely for institutional Democrats to put their heft behind Liz Cheney.",
    "Perhaps the most worrisome part of this partnership is the extent to which the Democrats have allowed these disaffected Republicans to colonize the Democratic Party's aesthetic.",
    "Not too long ago, the thought of a Cheney-less Capitol Hill would have been a dream of Beltway Democrats, who saw Liz ride on her father's coattails to a seat in Congress.",
    "But that was all before her opposition to Donald Trumpand her votes to impeach himearned her a place in the Resistance and a perch on the Jan. 6 commission.",
    "Do Democrats believe that the vindication of neoconservatism is an acceptable trade-off for the chance to have Liz Cheney as an occasional ally?",
    "But that's what some Democratic donors are doing, despite the massive headwinds facing the party's own candidates in the fall midterms.",
    "This article, written by TNR deputy editor Jason Linkins, first appeared on newrepublic.com and in Power Mad, a weekly TNR newsletter.",
    "I get that Cheney has done an inspiring job clearing the very low bar of opposing Trump's corruption and assault on democracy.",
    "To defeat Hageman in the GOP primary in August, Cheney will need a certain percentage of Democrats to become crossover voters.",
    "In fact, Democrats should ponder whether to seek out the Never Trumpers as dance partners at all.",
    "This article first appeared on newrepublic.com and in Power Mad, a weekly TNR newsletter.",
    "Mark Gordon relied on such voters to propel him to victory over a far-right opponent.",
    "(Wyoming allows voters to change their party affiliation as late as Election Day.",
    "That movement's only clear success has been to draw outsize media attention.",
    "This marriage of convenience should be headed for a divorce.",
    "J.B. Pritzker and former Commerce Secretary Penny Pritzker.",
    "A pro-Trump attempt to change that law failed last week.)",
    "It's truly an odd thing to contemplate.",
    "Sign up here.",
    "Sign up here."
  ]
}