{
  "id": 318,
  "mediaId": 19,
  "date": "3/18/2022 12:00:00 AM",
  "headline": "Kinzinger: Many Will Move Heaven and Earth to Ensure' Trump Doesn't Win 2024",
  "image": "https://cdn.jwplayer.com/v2/media/A7PM6pBS/poster.jpg?width=1280",
  "link": "https://www.breitbart.com/clips/2022/03/18/kinzinger-many-will-move-heaven-and-earth-to-ensure-trump-doesnt-win-2024/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pam Key",
  "authorUrl": "https://www.breitbart.com/author/pam-key/",
  "termIds": [
    2527,
    2527,
    2214,
    2214,
    1434,
    1434,
    1248,
    1248,
    1147,
    1147,
    562,
    562
  ],
  "sentences": [
    "Representative Adam Kinzinger (R-IL) said Thursday on CNN's Newsroom? that if former President Donald Trump got the Republican nomination for president in 2024, many? people would move heaven and earth to ensure he doesn't win.?\nDiscussing Trump, Sciutto said, Final question if I can?",
    "But look, if Donald Trump gets the Republican nomination, there are many of us that will move heaven and earth to ensure he doesn't win.",
    "Do you believe that will happen again, or will you get a shot??\nKinzinger said, I don't know if I'm interested in it.",
    "You are among the names mentioned who might challenge him for the nomination in 2024, should he decide to run.",
    "In terms of, yeah, I think somebody will carry the torch of what I call actually pro-American Republicanism.",
    "Do you believe there will be a competitive GOP primary that you will get the opportunity to do so?",
    "It looks more and more like he will run, maybe Liz Cheney, perhaps Mike Pence.",
    "We saw steps in 2020 where the GOP closed the path to challenges.",
    "There is a lot of desire out there for something different.",
    "I don't know who that necessarily will be.",
    "I'm focusing on the Country First stuff.",
    "I think that's the most important.",
    "It is not something I'm pursuing.",
    "I want our country to be better.",
    "I want our party to be better.",
    "He cannot be president again.?"
  ]
}