{
  "id": 322,
  "mediaId": 43,
  "date": "3/18/2022 12:00:00 AM",
  "headline": "Cheers and Jeers: Rum and Granny's Canned Drone Killers FRIDAY!",
  "image": "https://images.dailykos.com/images/1016107/story_image/CheersandJeerssharpedgelogo.jpg?1639234149",
  "link": "https://www.dailykos.com/story/2022/3/18/2086375/-Cheers-and-Jeers-Rum-and-Granny-s-Canned-Drone-Killers-FRIDAY",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    767,
    1501,
    2089,
    2284,
    2347,
    3094,
    545,
    2656,
    2661,
    2888
  ],
  "sentences": [
    "Days 'til the start of the Memorial Day weekend: 70\nDays 'til the Texas Onion Fest in Weslaco: 8\nPercent of Americans polled by Quinnipiac who don't think Ketanji Brown Jackson should be confirmed to the Supreme Court: 24%\nPercent of mail-in ballots that were rejected in the 2020 general election in Texas: 1%\nPercent that were rejected in the 2022 Texas primaries, after Republicans passed their voter suppression law: 17%\nPercent by which oil companies care about lowering gas prices to relieve the suffering of the American people at the pump: 0%\nNumber of U.S. presidents who were an only child: 0\n-\nPuppy Pic of the Day: Parvo survivors\n-\nCHEERS to pissing off the right people.",
    "The Ohio Supreme Court, which told dumb-as-a-rocks Ohio Republicans to stick their gerrymandered district maps where the sun don't shinefor the third time\n Puerto Rico, which formally exited bankruptcy in the largest debt-restructuring in U.S. history\n The grand jury that indicted traitor anarchist Steve Bannon on two counts of contempt of Congress---he could spend 2 years in jail for dissing the Jan. 6 committee\n Time Warner Cable, for dealing a near mortal blow to traitor anarchist network OAN by giving it the boot\n Marina Ovsyannikova of Russia's #1 news channel, for interrupting a newscast watched by millions to hold up a sign: \"Stop the war.",
    "Down Texas yonder way, where thems that knows tells us that ain't nothin' in the middle of the road but yellow stripes and dead armadillos, tongues reeking of barbeque sauce are a' waggin' after one of the state's largest employers went rogue and dared to throw a tumbleweed into the Republicans' woman-control machine:\nCitigroup, the nation's fourth-largest bank, is angering Texas Republicans over its latest workplace benefit: Offering to cover the travel expenses of employees who live in states with restrictive reproductive health care laws, including the state's recently enacted law banning most abortions after six weeks.",
    "The BBC, for reviving shortwave radio to deliver news about the war in Ukraine to the Russian people, whose access to independent reporting is nil\n Ukrainian president Zelenskyy, for addressing a joint session of Congress as he continues confounding Putin and his army of murderous nitwits\n President Biden: signs big budget and Ukraine aid package; brands Putin war criminal; unemployment claims lowest in 52 years; huge pre-confirmation support for SCOTUS nominee Jackson\n Baseball fans, as the major leagues resolve their dispute and prepare for a full 2022 schedule\n 477 votes Vote Now!",
    "If you liked the original Covid-19and you loved the delta variantand you turned cartwheels over the omicron variantand you gave a ticker-tape parade to the second omicron variantwait'll you see the new bundle of joy Coronavirus, LLC will be delivering in Easter baskets this spring:\nA hybrid variant of the coronavirus that has characteristics of both the delta and omicron strains has been detected in the United States and several European countries, scientists say.",
    "3%\n14 votes\nUkrainian president Zelenskyy, for addressing a joint session of Congress as he continues confounding Putin and his army of murderous nitwits\n 26%\n124 votes\nPresident Biden: signs big budget and Ukraine aid package; brands Putin war criminal; unemployment claims lowest in 52 years; huge pre-confirmation support for SCOTUS nominee Jackson\n 12%\n55 votes\nBaseball fans, as the major leagues resolve their dispute and prepare for a full 2022 schedule\n .",
    "Because he's a grouchy old man on Social Security who has nothing better to do than stand behind lecterns delivering grouchy diatribes about child labor, moon colonies, and tyranny while savoring the smattering of applause and media coverage he still gets as if he was draining the last few drops of water from his canteen while stranded in Death Valley as buzzards circle overhead waiting to peck him open and dine on the gristle-flecked pink Newt slime.",
    "At 8:30 on PBS, Firing Line features an interview with Margaret Atwood (The Handmaid's Tale) on her use of fiction to warn about authoritarianism, climate change, and other calamities.? Bill Maher's guests tonightfor those who still bother to tune inon HBO's Real Time include Obama's Secretary of Energy Ernest Moniz, pollster Kristen Soltis Anderson, and some talking head named Max Brooks.",
    "I don't care if we're still surrounded by increasingly-grey-tinged snow, at exactly 11:33 ET Sunday morning, I'll put on my tutu, strap on my fairy wings, go outside, and partake in the annual tradition of romping barefoot through the blueberry fields with the wee village folk.",
    "According to Cormac O'Brien's book Secret Lives of the U.S. Presidents, as sheriff of Erie County, New York in the 1870s, Cleveland \"personally threw the noose around the necks of two convicted criminals,\" making him the only American president who personally hanged someone.",
    "Ambassador to the UN Linda Thomas-Greenfield; former General and CIA director and secrets-spiller-to-his-girlfriend David Petraeus; Polish Ambassador Ambassador Marek Magierowski; Masha Gessen of The New Yorker; author David Remnick (The Last Days of the Soviet Union).",
    "Jimmy Kimmel\nAnd now, our feature presentation...\n-\nCheers and Jeers for Friday, March 18, 2022\nNote: Just a heads-up that there will be no C&J on Monday because sometimes I feel the need to keep you people in line by using the withholding of love as a weapon.",
    "Or, in this guy's case, for anyone who's ever wished the ground would open up and swallow him:\nIf we must have a portrait of TFG in the White House, let it be nothing but a screen shot from that moment.",
    "The bank stated: \"In response to changes in reproductive health care laws in certain states in the U.S., beginning in 2022 we provide travel benefits to facilitate access to adequate resources.\"",
    "The Texas Republican party, which has built a lucrative fundraising machine out of faux-outrage against \"cancel culture,\" is now urging its members to[checks notes]cancel Citigroup.",
    "Bet you didn't know this: March 18th is Awkward Moments Day, which is described at one web site as existing \"For anyone who's ever wished the ground would open up and swallow them.\"",
    "3%\n14 votes\nThe grand jury that indicted traitor anarchist Steve Bannon on two counts of contempt of Congress---he could spend 2 years in jail for dissing the Jan. 6 committee\n .",
    "Stephen Colbert\n\"Putin has always refused to recognize Ukraine's independence, even though 90 percent of Ukrainians voted to break away from the crumbling Soviet Union in 1991.",
    "!?\nThe delta-omicron hybrid, informally dubbed \"deltacron,\" is what's known as a recombinant virus, meaning it has melded-together genetic information from both variants.",
    "Why is Newt Gingrich staying in the GOP primary race when it's clear the closest he'll ever come to occupying the White House is standing in line to take the public tour?",
    "Sunday evening 60 Minutes has the latest on Ukraine, a report on the U.S. rental housing market, and a profile of WNBA star Sue Bird as she gears up for another season.",
    "The NHL schedule is here, the NBA schedule is here, and you'll find the NCAA women's and men's put-the-ball-through-the-basketball-ring tournament info here and here.",
    "46%\n221 votes\nThe BBC, for reviving shortwave radio to deliver news about the war in Ukraine to the Russian people, whose access to independent reporting is nil\n .",
    "The Ohio Supreme Court, which told dumb-as-a-rocks Ohio Republicans to stick their gerrymandered district maps where the sun don't shinefor the third time\n .",
    "Conan O'Brien on Twitter\n\"One of the bright spots in this horrible scenario has been watching these super-yachts owned by Russian oligarchs get seized.",
    "Now here's your Sunday morning lineup:\nMeet the Press: Sen. Chris Murphy (D-CT); Rep. Liz Cheney (R-WY); NATO Secretary General Jens Stoltenberg.",
    "1%\n6 votes\nMarina Ovsyannikova of Russia's #1 news channel, for interrupting a newscast watched by millions to hold up a sign: \"Stop the war.",
    "Zelenskyy called on President Biden to be the leader of the world, and said 'being the leader of the world means being the leader of peace.'",
    "That is, if you don't count presidents Hoover, Nixon, Bush II, and Trump, who did a pretty good job of personally hanging themselves.",
    "After arriving back home, we'll partake in our other annual spring tradition: scraping wee village folk off the bottom of our shoes.",
    "Seth Meyers\n\"Volodymyr Zelenskyy's stirring speech to Congress had to be the first time in history people applauded a Zoom call.\"",
    "On The Simpsons, it's the nerd dads versus the cool kid influencers, and Quagmire can't get rid of his hiccups on Family Guy.",
    "5%\n23 votes\nTime Warner Cable, for dealing a near mortal blow to traitor anarchist network OAN by giving it the boot\n .",
    "You can trust me on this because I have a political psychoanalyst diploma on my wall made of glued-on macaroni shells.",
    "Face the Nation: Secretary of Defense Lloyd Austin; Ukrainian Ambassador to the U.S. Oksana Markarova; Former U.S.",
    "Citi disclosed the new policy in a regulatory filing with the U.S. Securities and Exchange Commission on March 15.",
    "Fox GOP Talking Points Sunday: Who does Fox News call when absolutely no one else on Planet Earth is available?",
    "[] \"Delta basically grabbed omicron's spike protein,\" [associate professor of microbiology] Jeremy Kamil said.",
    "4%\n17 votes\nPuerto Rico, which formally exited bankruptcy in the largest debt-restructuring in U.S. history\n .",
    "\"Yesterday Russia announced that they're hitting Biden, Blinken, and other top U.S. officials with sanctions.",
    "Samantha Bee\nx\n-\nWell, I've officially lived a long life because people are excited Germany is rearming.",
    "-\nTen years ago in C&J: March 18, 2012\nCHEERS to Bill in Portland Maine: Senior Political Psychoanalyst.",
    "If couch-potato'ing is on your agenda this weekend, here are a few things that may pop up on your TV.",
    "Ambassador to Ukraine Marie Yovanovich; Moscow Mitch (The Cult-KY); former FDA head Scott Gottlieb.",
    "In Norway, [a super-yacht] is stranded because the locals refused to sell them gas to refuel it.",
    "It's like when you give your kid a bubble lawnmower and they're like, 'I'm a world power, too!'",
    "The ghost of Uncle Walter shows up on all the shows to issue everyone a disappointed tsk-tsk.",
    "There hasn't been a vote that lopsided since Florida voted to add guns to the food pyramid.\"",
    "The latest on Ukraine will get unpacked by Chris Hayes and Ari Velsher (I think) on MSNBC.",
    "Edition\n\"Ukrainian president Volodymyr Zelenskyy delivered a virtual address to Congress.",
    "Every once in a while the Norwegians like to remind us that they descended from Vikings.\"",
    "Whereas being the leader of the world during the Trump years meant being Angela Merkel.\"",
    "After that you're on your own since John Oliver's Last Week Tonight has the night off.",
    "The new movies and streaming options are all reviewed here at Rotten Tomatoes.",
    "One local oil supplier said, 'Why should we help them when they can row home?'",
    "-\nBRIEF SANITY BREAK\n-\nx\n-\nEND BRIEF SANITY BREAK\n-\nCHEERS to \"Uncle Jumbo.\"",
    "This Week: Who does ABC News call when absolutely no one else is available?",
    "Now start helping to pay for poor, non-employee Texans' transportation.",
    "Happy Birthday to #22 and #24 Grover Cleveland, born March 18, 1837.",
    "And you're like, 'You sure are, buddy, you're doing a great job.'\"",
    "Cheers and Jeers is a weekday post from the great state of Maine.",
    "As usual, their brains will simply ooze around the hypocrisy.",
    "-\nAnd just one more\nCHEERS to the nerds and klutzes among us.",
    "Floor's open...What are you cheering and jeering about today?",
    "Oh, that's adorablethey're doing their own sanctions.",
    "Trevor Noah\nContinued...\nYou are now below the fold.",
    "-\n Poll\n 477 votes Show Results\n Who won the week?",
    "Margaret Atwood is on Firing Line? tonight (PBS).",
    "Why, Sen. John Barrasso (The Cult-WY) of course.",
    "(CNN: call meI could be a great guest hologram.",
    "JEERS to following more of the bouncing balls.",
    "Late Night Snark: \"Tap Tap, Is This Thing On?\"",
    "Why, Sen. Ben Sasse (The Cult-NE) of course.",
    "It was either that or this turnip catapult.",
    "I hope it at least bought it dinner first.",
    "Talk amongst yourselves, I need a shower.",
    "Kieran Culkin (Succession) hosts SNL.",
    "You're, like, really really wee.)",
    "CNN's State of the Union: U.S.",
    "UghI just praised a big bank.",
    "Don't believe the propaganda.",
    "Don't believe the propaganda.",
    "-\nBy the Numbers:\n 8 days!!!",
    "CHEERS to home vegetation.",
    "Back Tuesday with HUGS!!!",
    "(Sorry about that, guys.",
    "'Bout effing time, huh?",
    "They are lying to you.\"",
    "They are lying to you.\"",
    "Have a great weekend.",
    "[Sigh] We can dream.",
    "Great start, Citi.",
    "CHEERS to Spring!",
    "Beware the Horta.",
    "Who won the week?",
    "Helloooooooo!!",
    "You can do it!",
    "Happy viewing!",
    "1%\n3 votes",
    "Really!)",
    "P.S."
  ]
}