{
  "id": 325,
  "mediaId": 223,
  "date": "3/17/2022 12:00:00 AM",
  "headline": "The DeSantis Doctrine",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/55/26da936b-89b9-4db0-bc18-159f8ba63715.png",
  "link": "https://townhall.com/columnists/kurtschlichter/2022/03/17/the-desantis-doctrine-n2604617",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kurt Schlichter",
  "authorUrl": "https://townhall.com/columnists/kurtschlichter/",
  "termIds": [
    661,
    661,
    1523,
    1523,
    1147,
    1147,
    146,
    146
  ],
  "sentences": [
    "Trump has an opportunity in 2024, but so does DeSantis, and you gotta love the idea of a primary where Godzilla fights King Kong, and they only pause to jointly pummel the tacky Rodan that is Liz Cheney or Adam Kinzinger or whatever other Bulwark-approved weenie tries to run in the Democrat lane of the Republican primaries.",
    "The nattering twenty-somethings and woke pronoun people in his company and on social media thought they could leverage their power to make this huge Florida employer bring DeSantis to heel over the threat that creepy weirdos could no longer chat up kindergartners about sex in schools.",
    "But it's ridiculous to expect that, in a world where corporations regularly use their power to affect politics, we normal people are somehow barred from using our own power  political power, including the power to regulate  to protect ourselves.",
    "The DeSantis Doctrine means you unashamedly use the power you are given to defeat the leftist agenda, that you don't shrink from cultural fights because all the Twitter people will tell you that you are somehow obligated to do so.",
    "A key element of that campaign is neutralizing normal people's retaliation by barring us  through the application of principles that exist only in a paradigm that no longer does  from exercising our own power.",
    "Trump is working very hard to clear the field and win the nomination by acclamation (my sources still largely assume he's running, yet in the last week, there have been tantalizing hints that he may not).",
    "But Ron DeSantis has the DeSantis Doctrine, sort of like the Monroe Doctrine, except instead of keeping shady foreigners out of our hemisphere, the DeSantis Doctrine keeps woke fascists out of our lives.",
    "But I was informed by all the smart people with blue checks trapped in a vortex, which keeps them forever in the year 2005, that conservatives were supposed to hate regulation and love big corporations.",
    "Everest of defeats, humiliations, and fiascos  the Trump years have to be looking pretty good to many of the squishy suburbanites, who look back longingly at mean tweets and $3 gas.",
    "Right now, if Donald Trump was not in the picture, he would not only be picking out a tie for his nomination acceptance speech, but he'd be picking out drapes for the Oval Office.",
    "So this dude  who shrimps Chi Com toes even as his commie masters torment, torture, and terminate Uighurs and prop up Putin  comes out and really expects that DeSantis will fold.",
    "They want to fight over a bunch of things that are awful, and far too many Republicans have shied away from not merely saying so but from actually doing something about them.",
    "He's impressed by name universities and huge corporations, and for all his much-justified complaining, he still cavorts with institutions that hate him, like the NYT.",
    "It was DeSantis who started the fire that burned the pyre of Democrat hopes and dreams they jumped onto in their campaign against the Florida anti-grooming statute.",
    "But here's the basic underpinning of the DeSantis Doctrine: A conservative principle that results in conservatives being less free is a pretty crappy principle.",
    "DeSantis is already on his way to winning reelection after having turned what Bart Simpson memorably called \"America's Wang\" into the freest state in the Union.",
    "The sixth, The Split, is now out, but get all these action-packed bestsellers, including People's Republic, Indian Country, Wildfire, Collapse, and Crisis!",
    "Trending\nYou gotta hand it to a guy who convinces Democrats to die on the hill of defending perverted groomers talking about sex with little school kids.",
    "And if they want to make it a fight over whether or not skeevy sex pests can have at your little kids, well, that's a battle we're delighted to fight.",
    "They want to fight over their desire to coddle criminals, let hobos defile our sidewalks, and send your kid to fight their war in Whogivesadamnistan.",
    "There is a lot of talk in conservative circles about needing new blood  this June will see the seventh anniversary of the famous escalator ride.",
    "Well, things change  among them, the left, which decided that it was going to weaponize every institution against us, including corporations.",
    "And then DeSantis, delighted at the chance to figuratively post a rodent skull on a pike, told the Mouse to pound some Sunshine State sand.",
    "They fear him because he does not have the mean tweets aspect that allows the left to attack him for something other than his actual deeds.",
    "This is tremendous news for the DeSantis family, but for our purposes, it eliminates a very real obstacle to DeSantis running in 2024.",
    "Mario Cuomo famously waited, and look what happened to that dynasty  he never got a second chance, and his sons grew up to be jerks.",
    "Perhaps, in a world where corporations tend to literally mind their own business and not use their economic power to affect policy.",
    "It's on-brand for their fellow travelers at The Lincoln Project, but you would think that Democrats actually want to win elections.",
    "But they'll care plenty in November when parents around the country come out and vote for The Party of Not Hitting on Der Kinder.",
    "He's popular and appreciated, but some people wonder if he's our best candidate for 2024, and some people just want to move on.",
    "He loves to crush his enemies, see them driven before him, and to hear the lamentation of their women-identifying persons.",
    "View Cartoon\nIt's the DeSantis Doctrine, and it's summed up this way: Your garbage institutions don't mean Schiff to me.",
    "And also, get my Kelly Turnbull conservative action thriller series about America splitting into red and blue countries.",
    "They do want to fight over the need to strangle our energy industry so that you are paying $10 a gallon for unleaded.",
    "DeSantis has been laying down the law in Florida, literally, and in a way even Donald Trump never did.",
    "Well, you can expect that  many do, in fact  but Ron DeSantis scoffs at such unilateral disarmament.",
    "They have to defend their freakshow agenda because he gives them nothing to change the subject to.",
    "And Check Out Last Week's Stream of Kurtiousness, Ron DeSantis Lays Down the Law to the Mouse.",
    "DeSantis is now, as he slowly gains parity in popularity with Donald Trump, worse than Trump.",
    "At some level, Donald Trump still has some residual respect for the trappings of the elite.",
    "They do want to fight over whether you can abort your kid 30 seconds before they're born.",
    "But far too many, like Kristi Noem, default to the Chamber of Commerce agenda and do zip.",
    "He's hinted he won't oppose Trump if the ex-president goes for Grover Cleveland's record.",
    "I am going to ruthlessly wield my power to protect normal people from your depredations.",
    "But no  they want to make the schools safe for pedos, and they don't care who knows it.",
    "Did the head of China-hugging Disney really think he was going to push Big Ron around?",
    "Pre-order my upcoming non-fiction book We'll Be Back: The Fall and Rise of America.",
    "They do want to fight over the bizarre and repellent pillars of modern liberalism.",
    "You don't get to change the rules, then expect us to remain bound by the old ones.",
    "The Trump Record  which is vindicated every day  versus the DeSantis Doctrine.",
    "Donald Trump has his record of achievement  economic success and peace abroad.",
    "Every GOP governor talks about wokeness or boys dominating girls' sports.",
    "DeSantis is all honey badger, laying waste and making the rubble bounce.",
    "It will make him sharper and better for the general, assuming he wins.",
    "He's not yet completely done with the institutions, but DeSantis is.",
    "We know Trump does not want that  he does not want any competition.",
    "It talks national divorce, civil war, and all sorts of other stuff.",
    "They do want to fight over whether perverts can groom your kids.",
    "Thankfully, Mrs. DeSantis was recently declared cancer-free.",
    "\"It's so unseemly for a governor to attack a corporation!\"",
    "It means not just winning elections but winning fights.",
    "But that's only his latest fight with the elite.",
    "So, the big question is, what's next for him?",
    "Conservatives Must Stand Together and Fight.",
    "But Trump needs competition, desperately.",
    "But after that, will he challenge Trump?",
    "But then, 2024 is looking like his year.",
    "He not only wields power; he enjoys it.",
    "He's all about the massive retaliation.",
    "And that's not a foregone conclusion.",
    "With Biden's mounting failures  a Mt.",
    "And those of us in the base love it.",
    "Some conservatives don't get that.",
    "And I'm going to smile doing it.",
    "Except Trump is in the picture.",
    "You know who wins that contest?",
    "And this terrifies the left.",
    "And my podcast, Unredacted.",
    "But here's the thing.",
    "Will DeSantis do it?",
    "Some are just dumb.",
    "Others are obtuse.",
    "Join Townhall VIP.",
    "Some are bought.",
    "We patriots do!",
    "Not DeSantis.",
    "Wow."
  ]
}