{
  "id": 3300,
  "mediaId": 65,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Elise Stefanik says Republicans are on track to win 'a historic majority'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c190bb9a-39d7-4824-9af1-98e7189757a4/f8255a24-9fa2-4a56-a20e-50eaafe79166/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/elise-stefanik-republicans-expect-win-historic-majority",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marisa Schultz",
  "authorUrl": "https://www.foxnews.com/person/s/marisa-schultz",
  "termIds": [
    1095,
    1147,
    1154,
    1248,
    1609,
    2087,
    3085,
    3094,
    422,
    428,
    545
  ],
  "sentences": [
    "Taking the helm as conference chair, Stefanik said she had three priorities: have a \"disciplined, unified message\" that all Republicans can focus on, \"go on offense every single day to prosecute the case against Joe Biden and Nancy Pelosi and failures of far-left unified government,\" and shine a spotlight on individual members, including the freshman class, with their unique backgrounds.",
    "ELISE STEFANIK ENDORSES INDIANA VETERAN VYING TO MAKE HISTORY IN CONGRESS\nNow 37, Stefanik is playing an outsized role in the 2022 midterm elections, coordinating GOP messaging against Democrats as conference chair while running her E-PAC leadership political action committee that is already backing 23 women candidates for Congress  with more endorsements and fundraising to come.",
    "Rep. Elise Stefanik, R-N.Y., marks one year as chair of the House Republican Conference touting the \"very strong\" position Republicans are in to retake Congress during the midterm elections and highlighting the strides she's made in electing more GOP women who are \"rising stars\" in Washington.",
    "But if Republicans win back the House in November, she has her eye on other leadership positions, including becoming GOP whip  if Whip Steve Scalise, R-La., moves up to House majority leader and Rep. Kevin McCarthy, R-Calif., becomes House speaker.",
    "\"I believe that's a result of our hard work [in] unifying the conference and focusing on the issues that actually matter to the American people,\" said Stefanik, who this week has ramped up the pressure on Biden for the baby formula shortage.",
    "Cheney ran afoul of her colleagues for voting in favor of Trump's impeachment for inciting the Jan. 6 attack, repeatedly calling out his false claims that the presidential election was stolen and saying she wouldn't support Trump in 2024.",
    "Stefanik made history in 2014 when she became the youngest woman ever elected to Congress at the age of 30  though Rep. Alexandria Ocasio-Cortez, D-N.Y., broke that record in 2018 when she was elected at the age of 29.",
    "A year ago, House Republicans were mired with infighting over the fallout of the Jan. 6 riot at the Capitol and second impeachment of President Trump as Republicans were divided on whether to move on from Trump.",
    "In the year since, Stefanik says the Republican Party has united and she credits their messaging against Biden for the tanking of his approval ratings on issues like the economy, immigration and foreign policy.",
    "STEFANIK SAYS BECOMING A MOTHER MADE HER 'MORE EFFECTIVE LEADER,' SAYS MOMS IN CONGRESS 'ON A MISSION'\nWith Trump's backing, Stefanik successfully challenged Rep. Liz Cheney, R-Wyo., last May for the No.",
    "Shocked that in 2019 there were only 13 GOP women in the House, Stefanik set out to fund and support a new crop conservative women and her efforts paid off with now 31 Republicans in office.",
    "\"There was clearly a need for change in leadership and a lot of encouragement from my colleagues,\" Stefanik told Fox News Digital about her ascension a year ago.",
    "Stefanik told Fox News Digital that Cheney was \"attacking\" Republican voters, colleagues and Trump himself, while ignoring the issues that Americans care about.",
    "Cheney, who now sits on the Jan. 6 select committee investigating the Capitol attack, hasn't backed down on her efforts to hold Trump and others accountable.",
    "\"I think we're in a very strong position to not only take back Congress, but to win a historic majority,\" Stefanik told Fox News Digital in an interview.",
    "In shoring up support from conservatives last year, Stefanik told colleagues on the fence she plans to serve just one term as conference chair.",
    "Stefanik is also weighing becoming chair of a committee, such as the House Education and Labor Committee, where she is a member.",
    "\"Elise Stefanik abandoned any commitment to the truth a long time ago,\" Cheney spokesperson Jeremy Adler told Fox News Digital.",
    "You have to earn them,\" said Stefanik, who is backing Cheney's primary challenger in Wyoming, Harriet Hageman.",
    "\"So I took on this job to do the very best I can this cycle, but I haven't made a decision about what's next.\"",
    "She'll be raising and donating more money to female candidates in 2022 than last cycle, according to E-PAC.",
    "Eleven out of the 15 seats that flipped red in 2020 were won by Stefanik-endorsed Republican women.",
    "\"She failed to unite her colleagues and you're not entitled to these positions in leadership.",
    "\"I endorsed them because they're the strongest candidates,\" Stefanik said.",
    "\"And I am so proud to see these women thrive as legislators.",
    "They're some of our most amazing rising stars.\"",
    "We're going to work to earn this majority.\"",
    "And we don't take anything for granted.",
    "3 GOP leadership spot in the House.",
    "\"We do not measure the drapes."
  ]
}