{
  "id": 331,
  "mediaId": 223,
  "date": "3/15/2022 12:00:00 AM",
  "headline": "Oh, So That's Who Liz Cheney Is Banking on Saving Her in Wyoming",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/209/4ff4036f-d297-4b88-83e4-7c7d7f83f66c.jpg",
  "link": "https://townhall.com/tipsheet/mattvespa/2022/03/15/the-people-liz-cheney-is-leaning-on-to-save-her-is-not-shocking-whatsoever-n2604560",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Vespa",
  "authorUrl": "https://townhall.com/tipsheet/mattvespa/",
  "termIds": [
    945,
    947,
    1147,
    1248,
    2087,
    2245,
    3094,
    146,
    428,
    2976
  ],
  "sentences": [
    "The two anti-Liz candidates running could split the conservative vote creating a crease for Cheney to slip through all greased up in Democrat oil (via Politico):\nIn 2007, in this blue bastion of one of the reddest states in the country, liberal activists wheeled a giant statue of Dick Cheney through town to protest his star role in the Iraq War  before toppling it, Saddam Hussein style, for good measure.",
    "She was absolutely invited to come and present what her facts were, to defend why you are doing this and instead she opted to call the Republicans radicals, which has made people upset within the party,? Martin said from the Jackson mansion of Nancy Donovan, a prominent Republican donor in Wyoming.",
    "The war in Ukraine, rising gas prices, inflation soaring, Joe Biden mumbling, rising crime, a border crisis, and the ongoing supply chain issues have ruined thatno one cares about this little riot when they can't afford groceries or gas.",
    "The turnabout for Cheney  one of the more unlikely twists in Republican politics in recent years, in a party that's had no shortage of them  will come into sharp relief next week at a gathering at Jackson's Center for the Arts.",
    "Cheney will speak on a bipartisan panel about defending elections, addressing what should be a welcoming audience amid her running battle with former President Donald Trump over the Jan. 6 sacking of the Capitol.",
    "At the March 22 event, which is being hosted by Issue One, a bipartisan organization that advocates for sweeping reforms to fix our broken political system,? Cheney will answer pre-selected questions.",
    "She's proudly on the select committee investigating' the January 6 riot, which is a now-failed theatrical production that was the basis for the Democrats' entire 2022 midterm strategy.",
    "When Cheney was censured by the state Republican Party in February 2021, three of the eight votes against the move were by officials from Teton County, which encompasses Jackson.",
    "Her campaign is loath to talk strategy publicly, but the math doesn't lie  and neither do Cheney's actions on the ground here in recent months.",
    "[]\nCheney needs Democrats and independents to change their party registration and cast their vote for her in the Aug. 16 primary.",
    "They snapped up roughly a quarter of the 350 tickets, at $10 apiece, to give the embattled congresswoman a piece of their minds.",
    "[]\nShe has shunned town halls and other voter forums in Wyoming's overwhelmingly red counties in favor of controlled events.",
    "She said the congresswoman is rarely in the state, despite having been urged to explain why she voted to impeach Trump.",
    "She's never home, and she'd rather call her fellow Republicans radical looney tunes because they don't agree with her.",
    "What Cheney doesn't know  until now  is that a band of Trump-loving Republicans will be on hand to greet her.",
    "In this deeply red state, Cheney could have coasted to re-election, but everyone is sick of her antics.",
    "She's unabashedly anti-Trump when the party has been taken over by his brand of right-leaning populism.",
    "Cheney was booted from the House leadership prior to being cast as the Democrats' favorite Republican.",
    "Maybe if Liz didn't suck so much, this wouldn't be the most critical two-minute drill of her life.",
    "The only issue is that if there are enough crossover votes, Liz the Liberal could survive.",
    "Pathetic for an incumbent from one of the reddest states in the country, but you see why.",
    "is turning to the same rare species in Wyoming  Democrats  to save her House seat.",
    "And Trumpist Republicans are doing everything in their power to thwart her.",
    "It's a lengthy post about how Cheney's only hope of survival are Democrats.",
    "The once-solid Republican has become a stooge for Democratic Party ploys.",
    "The dissenters included Mary Martin, now the county's GOP chair.",
    "That game is her re-election and her career in public life.",
    "Fifteen years later, his daughter Rep. Liz Cheney (R-Wyo.)",
    "Not a shock since she's already pretty much Democrat Liz.",
    "Liz Cheney (R-WY) needs a touchdown to win the game.",
    "Since then, however, Martin has soured on Cheney.",
    "She now needs to rely on Democrats to survive.",
    "With less than two minutes remainingRep.",
    "What a whiny little baby.",
    "It's the same old story.",
    "I hope she fails."
  ]
}