{
  "id": 334,
  "mediaId": 25,
  "date": "3/15/2022 12:00:00 AM",
  "headline": "In private speech, Romney warns of 'extraordinary challenge' to preserve American democracy",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/03/14/477b5fd8-6d8d-4add-9e6a-863b06fedc0a/thumbnail/140x90/ccfb58ec7bb87d1dd4be4dbefb370d47/gettyimages-1228582602.jpg",
  "link": "https://www.cbsnews.com/news/mitt-romney-american-democracy-extraordinary-challenge/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Costa",
  "authorUrl": "",
  "termIds": [
    2465,
    2465,
    2281,
    2281,
    2030,
    2030,
    1609,
    1147,
    1248,
    1147,
    1248,
    1609,
    428,
    428,
    2945,
    2945
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n Romney warns of 'extraordinary challenge' to preserve U.S. democracy\n Pro-Trump former Minnesota GOP chair running for late husband's House seat\n Democrats anxious about 2022 believe they can run on Biden's agenda\n DNC weighs changes to presidential nominating process\n Florida House passes bill creating office to probe election crimes\n More\nIn:\nmitt romney\n Robert Costa\nRobert Costa is CBS News' chief election and campaign correspondent based in Washington, D.C.\n Twitter",
    "Attendees described Romney, the GOP's 2012 presidential nominee, as delivering the remarks as a warning for the group, which included many longtime members of the Republican establishment, as the U.S. confronts Russia's invasion of Ukraine and as former President Donald Trump continues to exert power inside the Republican Party.",
    "McLean, Virginia  Senator Mitt Romney, of Utah, offered more than 200 Republican donors a stark message on the fragility of American democracy during private remarks on Monday night at a fundraiser in Northern Virginia.",
    "Cheney, a Trump critic, is the vice chair of the House select committee investigating the January 6 assault on the U.S. Capitol and Trump's role in efforts to block the certification of President Joe Biden's election.",
    "In an interview late Monday, Bill Kilberg said the event went \"exceedingly well,\" not only in terms of the fundraising total, but for rallying Republicans who are increasingly worried about their party and nation.",
    "At Monday night's event, which raised over $526,000 for Cheney, Romney framed the survival of American democracy as a battle on two fronts, with the possibility of significant erosion unless leaders are vigilant.",
    "\"We are really the only significant experiment in democracy, and preserving liberal democracy is an extraordinary challenge,\" Romney said, according to the attendees, who gathered at the Hilton Hotel in McLean.",
    "At home, Romney said, \"what has kept us from falling in with the same kind of authoritarian leader as Vladimir Putin are the strengths of our institutions, the rule of law, our courts, Congress, and so forth.\"",
    "Abroad, he said, it faces threats from Russian President Vladimir Putin, who is following an authoritarian playbook \"rehearsed time and time again, over the many thousands of years of world history.\"",
    "Cheney's primary race has a national following  she's facing a challenge from Harriet Hageman, a Trump ally who has been endorsed by House Minority Leader Kevin McCarthy, of California.",
    "According to five attendees, Romney told the crowd that he has a chart in his Senate office tracing the history of civilizations over the past 4,000 years.",
    "The fundraiser was organized by veteran Republican power brokers Bobbie and Bill Kilberg, who have decades of links to past Republican presidents.",
    "From the Mongol Empire to the Roman Empire, Romney said, autocracy is the chart's \"default setting,\" with authoritarian leaders at every turn.",
    "\"They're not happy with the direction of the Republican Party and they're not particularly happy with the direction of the Democratic Party.\"",
    "\"Romney got a standing ovation,\" he added, when he praised Ukrainian President Volodymyr Zelensky and when he spoke about American democracy.",
    "Cheney's father, former Vice President Dick Cheney, and mother, Lynne Cheney, were spotted by CBS News as they exited the fundraiser.",
    "Attendees said Cheney's parents did not make formal remarks at the fundraiser but did socialize with guests at the opening reception.",
    "He said it is a reminder of how they can rise and collapse, and of how unusual American democracy is in global history.",
    "\"I think people are really hungry for a sensible, rational alternative in our political dialogue,\" Bill Kilberg said.",
    "\"She said, if someone doesn't have respect for the rule of law and the democratic system, then it's all for naught.\"",
    "Congresswoman Cheney offered a brief greeting but did not speak with CBS News as she left the event with her family.",
    "\"People of character and courage,\" Romney said, \"have stood up for right at times when others want to look away.",
    "Romney was the introductory speaker at a closed fundraiser for Republican Congresswoman Liz Cheney of Wyoming.",
    "Trump has been furious with Cheney ever since she voted to impeach him last year after the attack.",
    "\"They saw two, sensible, intelligent, rational conservatives, and they were excited.",
    "\"That was the essence of Liz's remarks as well,\" Bobbie Kilberg said.",
    "\"He said we have to appreciate how fragile this system is.\"",
    "It's been a long time since we had that opportunity.\"",
    "At the time, she was in the House GOP leadership.",
    "The crowd roared its approval, attendees said.",
    "Such a person is Liz Cheney.\""
  ]
}