{
  "id": 3353,
  "mediaId": 65,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Congress to hold historic public UFO hearing",
  "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/05/1862/1048/ufo-still.png?ve=1&tl=1",
  "link": "https://www.foxnews.com/us/house-intelligence-congress-ufo-hearing",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Durschlag",
  "authorUrl": "",
  "termIds": [
    683,
    718,
    895,
    1148,
    2087,
    2517,
    3094,
    200,
    327,
    545,
    2888
  ],
  "sentences": [
    "Continue reading \nWOKE TERMINOLOGY' - Michelle Obama's word choice in social media abortion post raises questions: How does one pronounce womxn?' Continue reading \n'MIGHT AS WELL' RUN - Symone Sanders, MSNBC host and former aide to Kamala Harris, offered a passive endorsement of President Biden 2024.",
    "- SEAN HANNITY\nFOLLOW FOX NEWS ON SOCIAL MEDIA\nInstagram\nYouTube\nSIGN UP FOR OUR NEWSLETTERS\nFox News Opinion\nFox News Lifestyle\nFox News Entertainment (FOX411)\nDOWNLOAD OUR APPS\nWATCH FOX NEWS ONLINE\nThis edition of Fox News First was compiled by Fox News' Jack Durschlag.",
    "Continue reading \nTUCKER CARLSON - Race politics always makes us hate each other and always in a very predictable way.' Continue reading \nSEAN HANNITY - Does Joe Biden ever talk about the violence gripping America's cities because of Democratic policies?",
    "Continue reading\nTHE LAST WORD\n\"After the [Buffalo supermarket] shooting, it took Democrats just 3 hours to start blaming Republicans and conservatives and talk show hosts and Fox News.\"",
    "Continue reading \nCALLOUS COMPARISON - MSNBC host Katie Phang compared accused white supremacist Buffalo supermarket shooter Payton Gendron to Kyle Rittenhouse.",
    "Continue reading\nABSOLUTELY BRUTAL' FOR DEMS A draft of a new congressional districting map for the state of New York appears to give Republicans a big boost.",
    "Continue reading \nDURHAM-SUSSMANN TRIAL - What to know before start of first trial out of Durham's probe into the origins of the Trump-Russia investigation.",
    "Continue reading\nROE DEBATED - NBC, ABC and more discuss the effect Roe will have on midterms: 'It hasn't made a difference in the past.'",
    "Continue reading \nCREATED A CRISIS' - GOP rep rips WaPo fact check defending Biden on baby formula shortage, doubles down on criticism.",
    "Continue reading \nPOLITICS\nA WINNING ISSUE' - House Republicans to make protecting women's sports a 'priority' if they retake majority.",
    "Continue reading \nCOLD CASE CRACKED - Remains of New York teen found 13 years after going missing in South Carolina, suspect charged.",
    "Continue reading \nDOWN TO THE WIRE - Three-way Oz-Barnette-McCormick clash for GOP Senate nomination on eve of Pennsylvania primary.",
    "Continue reading \nIN OTHER NEWS\nFINNISH-ING THE JOB - Finland's ambassador reveals warning given to Russia before Ukraine invasion.",
    "Continue reading \nPOINTING FINGERS - Liz Cheney blames GOP leaders for enabling White racism days after Buffalo shooter's attack.",
    "Continue reading \nPRIME TIME\nJESSE WATTERS - The left is trying 'capitalize' on the Buffalo, NY shooting to divide the country.",
    "Continue reading \nFLYING THE COOP - Canadian psychologist Jordan Peterson told his audience he is 'departing' from Twitter.",
    "Continue reading \nLAURA INGRAHAM - Democrats sounding more like China's Xi than John F. Kennedy as they censor opposition.",
    "And here's what you need to know to start your day ...\nMYSTERY' PHENOMENA - Congress to hold historic public UFO hearing.",
    "Continue reading \n'FULLY OPERATIONAL'  Border officials discover massive drug tunnel connecting Tijuana to San Diego.",
    "Continue reading \nPRIMARY CONCERNS - Voters in deep blue city talk priorities on the eve of crucial election.",
    "Continue reading \nFOX WEATHER\nWhat's it looking like in your neighborhood?",
    "Good morning and welcome to Fox News' morning newsletter, Fox News First.",
    "- Elon Musk torches Biden with slam about who the real president' is.",
    "Thank you for making us your first choice in the morning!",
    "We'll see you in your inbox first thing Wednesday.",
    "Subscribe now to get Fox News First in your email.",
    "Continue reading \nWHO'S IN CHARGE?"
  ]
}