{
  "id": 3360,
  "mediaId": 178,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "In Buffalo, Biden to confront the racism he's vowed to fight",
  "image": "https://chorus.stimg.co/23513482/1biden051722.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/in-buffalo-biden-to-confront-the-racism-hes-vowed-to-fight/600173869/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "CHRIS MEGERIAN Associated Press",
  "authorUrl": "",
  "termIds": [
    3094
  ],
  "sentences": [
    "Biden said he hadn't planned to run for president in 2020  he had already fallen short in two previous campaigns, served as vice president and then stepped aside as Hillary Clinton consolidated support for the 2016 race  and was content to spend some time as a professor at the University of Pennsylvania.",
    "A third of U.S. adults believe there is \"a group of people in this country who are trying to replace native-born Americans with immigrants who agree with their political views,\" according to a poll conducted in December by The Associated Press and the NORC Center for Public Affairs Research.",
    "\"The Democrats want open borders so they can bring in and amnesty tens of millions of illegal aliens  that's their electoral strategy,\" Blake Masters, who's running in the Republican Senate primary in Arizona, wrote on Twitter hours after the Buffalo shooting.",
    "But he said he was disgusted \"when those folks came marching out of the fields in Charlottesville, Virginia, carrying torches\" and repeating the \"same anti-Semitic bile chanted in the streets of everywhere from Nuremberg to Berlin in the early '30s.\"",
    "Now Biden is facing the latest deadly manifestation of hatred after a white supremacist targeted Black people with an assault rifle at a supermarket in Buffalo, New York, and left 10 people dead, the most lethal racist attack since he took office.",
    "So far investigators are looking at Gendron's connection to what's known as the \"great replacement\" theory, which baselessly claims white people are being intentionally overrun by other races through immigration or higher birth rates.",
    "The writer of the document described himself as a supporter of Dylan Roof, who killed nine Black parishioners at a church in Charleston, South Carolina, in 2015, and Brenton Tarrant, who targeted mosques in New Zealand in 2019.",
    "Biden was briefed about the shooting by his homeland security adviser, Liz Sherwood-Randall, before he attended church services on Saturday near his family home in Wilmington, Delaware, according to the White House.",
    "It's a message that Biden has delivered several times since he became the first president to specifically address white supremacy in an inaugural speech, calling it \"domestic terrorism that we must confront.\"",
    "Johnson, the NAACP president, said the country needs to \"finally chart a course so we can as a nation begin to address domestic terrorism as we would foreign terrorism  as aggressively as possible.\"",
    "Stefanik is the third-ranking leader of the House Republican caucus, replacing Rep. Liz Cheney, R-Wyo., who angered the party with her denunciations of Trump after the Jan. 6 attack on the Capitol.",
    "Facebook advertisements posted last year by the campaign committee of Rep. Elise Stefanik, R-N.Y., said Democrats want a \"PERMANENT ELECTION INSURRECTION\" by granting amnesty to illegal immigrants.",
    "His commentary reflects how this conspiratorial view of immigration has spread through the Republican Party ahead of this year's midterm elections, which will determine control of Congress.",
    "He repeated the same theme a month later, saying that \"this policy is called the great replacement, the replacement of legacy Americans with more obedient people from faraway countries.\"",
    "Buffalo Police Commissioner Joseph Gramaglia said Gendron is \"someone who has hate in their heart, soul and mind,\" and he called the attack on the store \"an absolute racist hate crime.\"",
    "In a speech at a nearby community center, Biden plans to call for stricter gun laws and urge Americans to reject racism and embrace the nation's diversity, the White House said.",
    "However, such beliefs remain an entrenched threat at a time when his administration has been preoccupied with crises involving the pandemic, inflation and the war in Ukraine.",
    "And he recalled how Trump responded to questions about the rally, which resulted in the death of Heather Heyer, a young woman who was there to protest the white supremacists.",
    "Carlson's show routinely receives the highest ratings in cable news, and he responded to the furor Monday night by accusing liberals of trying to silence their opponents.",
    "Three days before the Buffalo shooting, at a Democratic fundraiser in Chicago, Biden said, \"I really do think we're still in the battle for the soul of America.\"",
    "They're also expected to meet privately with families of the victims, first responders and local officials before the president delivers public remarks.",
    "On Monday, Biden paid particular tribute to one of the victims, retired police officer Aaron Salter, who was working as a security guard at the store.",
    "The president and first lady Jill Biden are to visit the city on Tuesday, where their first stop will be a makeshift memorial outside the supermarket.",
    "\"It's important for him to show up for the families and the community and express his condolences,\" said Derrick Johnson, the president of the NAACP.",
    "The White House said the president and the first lady will \"grieve with the community that lost 10 lives in a senseless and horrific mass shooting.\"",
    "Alex DeGrasse, a senior adviser to Stefanik's campaign, said Monday she \"has never advocated for any racist position or made a racist statement.\"",
    "WASHINGTON  When Joe Biden talks about his decision to run against President Donald Trump in 2020, the story always starts with Charlottesville.",
    "\"'This community is in such pain, and to see the president of the United States show them the attention that Buffalo doesn't always get.'\"",
    "He says it was the men with torches shouting bigoted slogans that drove him to join what he calls the \"battle for the soul of America.\"",
    "\"So because a mentally ill teenager murdered strangers, you cannot be allowed to express your political beliefs out loud,\" he said.",
    "Although Biden has not spoken directly about replacement theory, his warnings about racism remain a fixture of his public speeches.",
    "Jean-Pierre indicated that the White House would speak more broadly about racism than singling out specific people for criticism.",
    "Cheney, in a tweet on Monday, said the caucus' leadership \"has enabled white nationalism, white supremacy, and anti-Semitism.",
    "Tucker Carlson, the prominent Fox News host, accuses Democrats of orchestrating mass migration to consolidate their power.",
    "In the years since Charlottesville, replacement theory has moved from the online fringe to mainstream right-wing politics.",
    "During the 2017 \"Unite the Right\" march in Charlottesville, the white supremacists chanted \"Jews will not replace us.\"",
    "Before the shooting, Gendron is reported to have posted online a screed overflowing with racism and antisemitism.",
    "He said Salter \"gave his life trying to save others\" by opening fire at the gunman, only to be killed himself.",
    "\"Many of those dark voices still exist today,\" White House press secretary Karine Jean-Pierre said Monday.",
    "She called again later to tell him that law enforcement had concluded the attack was racially motivated.",
    "The plan would \"overthrow our current electorate and create a permanent liberal majority in Washington.\"",
    "In addition, the racism that was spouted in Charlottesville, Virginia, appears to have only spread.",
    "The racist ideology is often interwoven with antisemitism, with Jews identified as the culprits.",
    "\"Once you get into calling out people's names, then you get away from that issue,\" she said.",
    "Kathy Hochul, a Democrat, told a Buffalo radio station that she invited Biden to the city.",
    "___\nAssociated Press writer Karen Matthews in New York contributed to this report.",
    "Replacement theory rhetoric has also rippled through Republican primary campaigns.",
    "to make sure we fight back against those forces of hate and evil and violence.\"",
    "Proposals for new gun restrictions have routinely been blocked by Republicans.",
    "\"But we're more concerned with preventing this from happening in the future.\"",
    "Payton Gendron, 18, was arrested at the supermarket and charged with murder.",
    "\"The country is being stolen from American citizens,\" he said Aug. 23, 2021.",
    "He criticized \"sickening and false reporting\" about her advertisements.",
    "History has taught us that what begins with words ends in far worse.\"",
    "A spokesperson for Masters did not respond to a request for comment.",
    "President, it would be so powerful if you came here,'\" Hochul said.",
    "Nearly all the victims were Black, including all of those who died.",
    "\"He said there are very good people on both sides,\" Biden said.",
    "He added, \"White supremacy and democracy cannot coexist.\"",
    "\"And the president is determined as he was back then .",
    "It's unclear how Biden will try to do that.",
    "He added, \"We can't let this happen, guys.\"",
    "Three more people were wounded.",
    "He has pleaded not guilty.",
    "\"Not on my watch.\"",
    "\"I said, 'Mr.",
    "New York Gov.",
    ".",
    "."
  ]
}