{
  "id": 3362,
  "mediaId": 147,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Tamara Keith and Amy Walter on the Buffalo shooting and the dangers of racist conspiracy theories",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/05/fullepisode-15-768x512.jpg",
  "link": "https://www.pbs.org/newshour/show/tamara-keith-and-amy-walter-on-the-attack-in-buffalo-and-the-power-of-racist-ideology",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3094
  ],
  "sentences": [
    "Amy Walter:\nOn the Democratic side here, you have John Fetterman, who not only doesn't look the part with the sweatshirt and the shorts, but he comes from the Bernie Sanders wing of the party, which, again, in the 2018-2020 version of Democrats, they would say, whoa, maybe that's a little too dangerous in a state as conservative as Pennsylvania, and we should elect the more moderate.",
    "NPR's Tamara Keith and Amy Walter of the Cook Political Report with Amy Walter join Lisa Desjardins to discuss the latest political news, including the response of political leaders after the attack in Buffalo, the move of white replacement theory? to the mainstream, and upcoming primary elections.",
    "That ad from Elise Stefanik was the idea that Democrats or somebody wants to bring in lots of illegal immigrants, who could then become legal and become American citizens and vote and replace Native American  or native-born American voters.",
    "Read the Full Transcript\nJudy Woodruff:\nDays after the massacre in Buffalo, the response from political leaders has turned not to the usual conversation on guns, but to the power of the racist ideology that fuels attacks like this one.",
    "The more that leaders, people who are in leadership positions, are willing to either excuse it or find  or find ways to sort of switch the topic, the harder it becomes for leaders to stand up and say, actually, we can draw a line.",
    "Lisa Desjardins:\nAnd speaking of leaders, there was a tweet from another Republican, former lead member of leadership, Liz Cheney, who tweeted: \"The GOP leadership has enabled white nationalism, white supremacy and antisemitism.\"",
    "Amy Walter, The Cook Political Report:\nI think, as this piece  as the lead-in alluded to, lots of times when these things happen, these horrible tragedies involving guns, we talk about the Second Amendment.",
    "Lisa Desjardins:\nJudy, for the political response to this tragedy, as well as a look ahead to some critical primary races tomorrow, I'm joined by our always thoughtful political Monday team.",
    "And some people here in Washington especially are looking at the words of some Republicans, including this from Elise Stefanik, the representative who is in House Republican leadership.",
    "New White House Press Secretary on her first day on the job Karine Jean-Pierre was asked today if the White House should push back more, call out people by name like Tucker Carlson.",
    "And in the years since then, it has become something that is discussed in politics as, like, this is something that is going to happen, and that somebody wants this to happen.",
    "In this case, though, what Democrats are looking for is somebody who's going to be a fighter, because they're frustrated that they're not seeing that from the party right now.",
    "And that sort of social isolation allows people to go into the dark recesses of the Internet and find things that confirm their beliefs and lead to really dangerous places.",
    "But some do see that ad as a reference to this  what we hear about, the white Replacement Theory, which the suspect in the Buffalo shooting wrote about.",
    "And that is a debate that we have been having most recently about what goes  gets posted on the Internet, right, and whose responsibility is that?",
    "But it's also in the political dialogue as well, which is, we know that the rhetoric just keeps getting ramped up and ramped up and ramped up.",
    "And we need to hold ourselves  even if Internet companies or the broader world won't hold us to those standards, we need to do it.",
    "So, white Replacement Theory was KKK, neo-Nazi stuff, and then it started seeping in a, in theory, more palatable form, right?",
    "And that's the whole thing about, what is free speech and what is hateful rhetoric that incites people to do terrible things?",
    "And this idea that there are  this is just a political  that it won't seep into the broader society is  is not true, right?",
    "Republicans in the Senate race have three very conservative candidates, including this sort of new surging Kathy Barnette.",
    "And you had, in Charlottesville, those people marching, chanting, with tiki torches, saying: \"Jews will not replace us.",
    "And that meant electing in primaries the most electable candidate, which usually meant the most moderate to centrist.",
    "It warns of a  quote  \"permanent election insurrection\" and defines that as the arrival of undocumented immigrants.",
    "He shows up in  there you go  in a hoodie and gym shorts for a meeting with the president of the United States.",
    "It is a  the American population is vulnerable to receiving conspiracy theories and accepting them as reality.",
    "Democrats have an unconventional Senate candidate as well, John Fetterman, the lieutenant governor.",
    "Lisa Desjardins:\nAnd it's obviously front of mine, especially for those of us here in the media.",
    "But I think that they are an example of candidates who are potentially redefining what it means.",
    "Tam, these are kinds of ideas, white Replacement Theory, that used to be way on the fringe.",
    "And so there are people who are paying very close attention to this and are very outraged.",
    "And then there are other folks who probably aren't going to hear much about this at all.",
    "That is Amy Walter of The Cook Political Report With Amy Walter and Tamara Keith of NPR.",
    "In 2018 and 2020, the one thing that unified Democrats was getting rid of Donald Trump.",
    "If you went back 10 years to Republican candidate central casting, you would find him.",
    "Why are some Republicans feeding or maybe not actively trying to address white anger?",
    "That is how it went from the fringes to the main  sort of the Republican mainstream.",
    "Someone like Dave McCormick, who's one of the Republican candidates, he's a veteran.",
    "Someone like John Fetterman is not traditionally considered even remotely electable.",
    "He's appealing to working-class voters that Democrats have been struggling with.",
    "And so  and someone like Barnette grabs attention, makes people have passion.",
    "So my question for you guys is, do voters hear these ideas challenged enough?",
    "And it is not  it is not in the exact same terms as white Replacement Theory.",
    "But another topic that does overlap with these sharp divides, primaries.",
    "Instead of white Replacement Theory, it's political Replacement Theory.",
    "It's been with us for a very long time, what you can and cannot say.",
    "I just got back from the Keystone State, fantastic few days there.",
    "And so the issue really about, well, what is free speech exactly?",
    "And the idea of what is electable I think has changed somewhat.",
    "How are they now in the political mainstream for some people.",
    "I want to ask you, Tam, is the idea of who can win changing?",
    "There is a First Amendment, but, this, just not acceptable.",
    "That was Replacement Theory in a way that was unpalatable.",
    "This is a Facebook ad she posted last year, a campaign ad.",
    "Lisa Desjardins:\nNorth Carolina, Pennsylvania and others.",
    "And I don't know if they're going to win their primaries.",
    "Let's start off with this, another unspeakable shooting.",
    "And that is what Stefanik's spokesperson pushed back on.",
    "Amy Walter:\nExcept we kind of flipped the script, Lisa.",
    "Amy Walter:\nWe don't  there is not cross-pollination.",
    "She's simply saying that there shouldn't be amnesty.",
    "In this case, we're focusing on the First Amendment.",
    "Now, Stefanik has disavowed the Buffalo shooter.",
    "She doesn't like  she doesn't have racist ideas.",
    "Tamara Keith:\nThere would be a liberal majority.",
    "Lisa Desjardins:\nAnd then what is there to do?",
    "What do you think is going on underneath here?",
    "We talked about him on this show last night.",
    "And we play a role too, right, in the media.",
    "What is simply OK to be able to talk about?",
    "Tamara Keith, National Public Radio:\nYes.",
    "And yet he is appealing to rural voters.",
    "We have some tomorrow, some good lines.",
    "She represents a district in New York.",
    "But in the years\nTamara Keith:\nYes.",
    "How do we get that truth out there?",
    "These aren't formulaic candidates.",
    "Lisa Desjardins is here with more.",
    "Amy, I'm going to start with you.",
    "I'm not here to make predictions.",
    "Tamara Keith:\nWe are in bubbles.",
    "It all mixes and melds together.",
    "That's the theory behind this.",
    "And there is no defined truth.",
    "And Fetterman is giving that.",
    "There used to be a formula.",
    "He had success in business.",
    "But then Trump got elected.",
    "And, if not, who and where?",
    "You will not replace us.\"",
    "What's inciting violence?",
    "Politics Monday is here.",
    "How does that happen?",
    "Tamara Keith:\nRight.",
    "Amy Walter:\nRight.",
    "He doesn't care.",
    "What do we do?",
    "Amy?"
  ]
}