{
  "id": 3368,
  "mediaId": 233,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "After Buffalo shooting, Liz Cheney tells Republicans to stop enabling white supremacy",
  "image": "https://www.gannett-cdn.com/presto/2022/02/28/USAT/91de54d9-57c4-4950-a817-800ec3ebfd28-AP_Congress_Cheney.jpg?crop=3839,2160,x0,y195&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/2022/05/16/liz-cheney-republicans-stop-enabling-white-supremacy/9791700002/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jackson",
  "authorUrl": "https://www.usatoday.com/staff/2647924001/david-jackson/",
  "termIds": [
    1095,
    1147,
    1248,
    3094,
    428,
    562,
    4938
  ],
  "sentences": [
    "Following Cheney's tweet, the Stefanik congressional campaign team sent out a statement saying that \"any implication or attempt to blame the heinous shooting in Buffalo on the Congresswoman is a new disgusting low for the Left, their Never Trump allies, and the sycophant stenographers in the media.\"",
    "Stefanik, who replaced Cheney as House Republican Conference Chair, supports guns ownership rights and opposes the the increased number of people in the country illegally, including proposals for \"mass amnesty\" and \"voting rights for illegals.\"",
    "Rep. Adam Kinzinger, R-Ill., an ally of Cheney, and other critics have accused Stefanik of expressing sympathy to the concept of \"replacement theory\" through her attacks on immigration at the southern border.",
    "WASHINGTON  U.S. Rep. Liz Cheney, who has long attacked Republican Party leadership for following Donald Trump, went after GOP officials on Monday for racism in the wake of the Buffalo shooting.",
    "The tweet came two days after an 18-year-old man who had expressed fears of racial \"replacement theory\" shot and killed 10 people and wounded three others at a supermarket in Buffalo.",
    "In writings posted online, the accused shooter in Buffalo, who donned body armor and wielded a rifle, said some of the nation's leaders want to ethnically replace my own people.?",
    "This and other racist and anti-Jewish conspiracy theories have triggered mass shoots at a synagogue in Pittsburgh, a Walmart in El Paso, and, now, a supermarket in Buffalo.",
    "Cheney did not name names in her racism tweet, but in the wake of the Buffalo shooting, Rep. Elise Stefanik, R-N.Y., drew criticism for her attacks on migrants.",
    "After the mass shooting in her home state on Saturday, Stefanik tweeted: \"Our nation is heartbroken about the tragic news of horrific loss of life in Buffalo.",
    "Promoted by right wing talk shows, \"replacement theory\" holds that the nation's \"elite\" want to \"replace\" the majority of whites with brown and Black people.",
    "Not naming Cheney, the statement said, \"the shooting was an act of evil and the criminal should be prosecuted to the fullest extent of the law.\"",
    "Stefanik herself did not respond to Cheney on social media Monday, but did post a series of tweets on the immigration issue.",
    "\"The House GOP leadership has enabled white nationalism, white supremacy, and anti-semitism,\" Cheney tweeted.",
    "One said: \"Democrats desperately want wide open borders and mass amnesty for illegals allowing them to vote.",
    "Like the vast majority of Americans, Republicans want to secure our borders and protect election integrity.\"",
    "Cheney's frequent criticisms of the party has earned her a Republican primary challenger backed by Trump.",
    "Most of the victims are Black, including a security guard, store employees and weekend shoppers.",
    "House Republicans also voted last year to dismiss Cheney from her House leadership position.",
    "@GOP leaders must renounce and reject these views and those who hold them.\"",
    "\"History has taught us that what begins with words ends in far worse.",
    "We are mourning for the entire community & loved ones.\""
  ]
}