{
  "id": 3373,
  "mediaId": 129,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "The Buffalo Shooting Was Not a Random Act of Violence",
  "image": "https://static01.nyt.com/images/2022/05/16/opinion/16violence-web/16violence-web-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/16/opinion/buffalo-shooting-replacement-theory.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    1095,
    2089,
    2213,
    3094,
    428,
    4938,
    4973
  ],
  "sentences": [
    "Now I know that the left and all the little gatekeepers on Twitter become literally hysterical if you use the term replacement,' if you suggest the Democratic Party is trying to replace the current electorate, the voters now casting ballots, with new people, more obedient voters from the third world,? Mr. Carlson said on an episode in April 2021. But they become hysterical because that's  that's what's happening, actually.? Representative Matt Gaetz, a Florida Republican, later tweeted that Mr. Carlson is CORRECT about Replacement Theory as he explains what is happening to America.?\nIn September, Ms. Stefanik's re-election campaign paid for a Facebook ad that combined imagery of immigrants with the accusation that Radical Democrats are planning their most aggressive move yet: a PERMANENT ELECTION INSURRECTION.? Ms. Stefanik's ad continued, Their plan to grant amnesty to 11 MILLION illegal immigrants will overthrow our current electorate and create a permanent liberal majority in Washington.?\nRight-wing rhetoricians in the United States portray undocumented immigrants as the primary threat.",
    "The suspects in several mass killings in recent years, including the 2015 murder of nine Black worshipers at a church in Charleston, S.C.; the 2018 murder of 11 Jewish worshipers at a synagogue in Pittsburgh; the 2019 murder of 51 Muslim worshipers at a pair of mosques in New Zealand; and the 2019 murder of 23 people, many Latino, in El Paso also propounded versions of this racist worldview.",
    "The manifesto posted by the El Paso shooting suspect, which Mr. Gendron also referenced, spoke of the Hispanic invasion of Texas.? The common thread  the ineluctable core of replacement theory  is that some people are white and some people are not, and the people who are white are threatened by those who are not.",
    "The French author Renaud Camus coined the term the great replacement? in a 2011 book to describe what he saw as a conscious effort by French elites to open the country's doors for Muslim immigrants to replace the ethnically French population and culture.",
    "The Fox News host Tucker Carlson, a leading purveyor of replacement theory rhetoric, has promoted the idea that elites are seeking to replace white Americans on more than 400 episodes of his program, according to an analysis by The New York Times.",
    "He copied large portions of his manifesto from the document posted to justify the New Zealand killings, in some cases inserting the name of the Jewish philanthropist George Soros in place of the former German chancellor Angela Merkel's name.",
    "The office of one of those politicians, Representative Elise Stefanik of New York, said in a statement that the Buffalo attack was an act of evil? and that she has never advocated for any racist position.?\nThe matter is not so simple.",
    "It is telling that House Republicans last year installed Ms. Stefanik in leadership to replace Representative Liz Cheney of Wyoming, who remains among the most forthright critics of the party's illiberal turn.",
    "Republican politicians, including some of the party's top leaders, openly espouse versions of a white supremacist conspiracy theory holding that an orchestrated effort is underway to displace white Americans.",
    "The suspect, identified as Payton S. Gendron, wrote in an online diatribe that he sought to kill Black people because he wanted to prevent white people from losing their rightful control of the country.",
    "It also provides a disturbing rationalization for people inclined to resort to violence when the political process does not deliver what they want or protect what they see as their place in society.",
    "There are always demagogues whose stock in trade is the demonization of immigrants and other minority groups, and American society has long allowed those on the fringes to air their views.",
    "But these attacks are not random acts; they are part of the long American history of political violence perpetrated by white supremacists against Black people and other minority groups.",
    "The focus on the gunman's motives should not obscure the fact that the most important step the government can take to impede similar attacks is to limit the availability of guns.",
    "It privileges the purported interests of some Americans over those of others, asserting, in effect, that the will of the people means the will of white people.",
    "A recently published poll found that almost half of Republicans believe that immigrants are being brought to the United States as part of such an effort.",
    "On Saturday, a gunman who said he was motivated by a version of this replacement theory? killed 10 people at a Buffalo grocery store, officials said.",
    "It rekindles fears and resentments among white Americans that cynical practitioners of American politics have stoked throughout the nation's history.",
    "The police said that the Buffalo assailant used a Bushmaster XM-15 rifle that he had purchased legally at a gun shop near his hometown.",
    "He didn't stand out  because if he did, I would've never sold him the gun,? Robert Donald, the store's owner, told The New York Times.",
    "The health of American democracy also requires the constructive use of free speech, especially by the nation's political leaders.",
    "He said that he was inspired by similar attacks on other minority communities and that he hoped others would follow his example.",
    "Politicians who have employed some of the vocabulary of replacement theory generally do not make explicit calls for violence.",
    "Ms. Cheney tweeted on Monday: The House GOP leadership has enabled white nationalism, white supremacy, and anti-semitism.",
    "The question in any era is whether such views are voiced, or echoed, by those in positions of responsibility.",
    "As a practical matter, almost anyone can buy guns that are designed to kill a lot of people quickly.",
    "It must also be emphasized that the United States makes it easy for domestic terrorists to kill.",
    "American life is punctuated by mass shootings that are routinely described as idiosyncratic.",
    "Mr. Gendron wrote that he blamed Jews for orchestrating the replacement of white Americans.",
    "This sanitizes replacement theory for mainstream consumption without diluting its logic.",
    "@GOP leaders must renounce and reject these views and those who hold them.?\nShe's right.",
    "The only real line of defense is the judgment of the people who sell guns.",
    "The template has been adapted for use by extremists around the world.",
    "History has taught us that what begins with words ends in far worse.",
    "The same argument is easily applied to other minority groups.",
    "Mr. Gendron described himself as part of a movement.",
    "Replacement theory is an attack on democracy."
  ]
}