{
  "id": 3376,
  "mediaId": 19,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Report: Crazy Erratic' Nancy Mace Would Often Lambast Donald Trump",
  "image": "https://media.breitbart.com/media/2022/05/GettyImages-1394029624-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/05/16/report-crazy-erratic-nancy-mace-would-often-lambast-donald-trump/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sean Moran",
  "authorUrl": "https://www.breitbart.com/author/sean-moran/",
  "termIds": [
    1147,
    1563,
    1839,
    2117,
    3094,
    194,
    234,
    403,
    2660
  ],
  "sentences": [
    "The staffer said, You'll sit down in a meeting to talk about policy and stuff and she'll start the meeting off by just saying, Just so you know, I'm not going to fucking listen to anything going on here.'?\nInstead, the congresswoman has focused more on what's sexy? for political positions that can garner significant media attention.",
    "Anti-Trump Rep. Nancy Mace (R-SC) has been described by former staffers as crazy erratic? in her handling of issues and has often been known to exclaim passionately? about her hatred of former President Donald Trump.",
    "Politico reported about how Mace has struggled to find her footing? in D.C. between her reported hatred of Trump and how she has struggled to manage the turnover in her congressional office.",
    "They will be tough on crime, strong on borders, strong on election integrity, and they will support our military and our vets, and they will never appease the fake news or the radical left.",
    "In response, Trump labeled her absolutely terrible.?\nTrump has endorsed Katie Arrington, a former state lawmaker, for the South Carolina Republican primary, which will take place in June.",
    "Mace has often bucked Republican party lines, including when she voted in favor of criminal contempt charges for Steve Bannon in October, which sharply divided her colleagues.",
    "I want them to have the same kind of vote that you gave me, so get out and vote for Russell Fry and Katie Arrington in the primary on June 14.",
    "One former staffer for Mace described her as crazy erratic? in her handling of issues and said she often disregarded policy advice.",
    "Three former Mace aides have claimed the congresswoman was often known to exclaim passionately? about how much she hated Trump.",
    "The 45th president brought Arrington on stage at a South Carolina rally in mid-March.",
    "During the rally, Arrington compared Mace to Never Trump Rep. Liz Cheney (R-WY).",
    "Trump said:\nKatie Arrington is a fighter for the people of South Carolina.",
    "So I want to ask everybody in this incredible state, I love this state.",
    "So, you know, I have a name for Nancy Mace,? Arrington said.",
    "I call her Liz Cheney of the South.",
    "It's all for you, big guy.",
    "You like that?",
    "It's true.?",
    "It's true."
  ]
}