{
  "id": 3381,
  "mediaId": 238,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Buffalo shooting shines light on Congressional inaction, GOP rhetoric",
  "image": "https://newsletter-imgs.s3.amazonaws.com/prod/the-202s/primary/early.svg",
  "link": "https://www.washingtonpost.com/politics/2022/05/16/buffalo-shooting-shines-light-congressional-inaction-gop-rhetoric/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Theodoric Meyer",
  "authorUrl": "https://www.washingtonpost.com/people/theodoric-meyer/",
  "termIds": [
    1095,
    1147,
    1341,
    1460,
    3094,
    4867,
    428,
    562,
    4938
  ],
  "sentences": [
    "But Rep. Adam Kinzinger (R-Ill.) tweeted that Stefanik's campaign committee ran a series of Facebook ads published in September 2021,? Marianna reports, that charged that Democrats were allowing undocumented immigrants into the U.S. as a ploy to outnumber, and eventually silence, Republican voters.?\nStefanik's senior adviser Alex deGrasse provided Marianna with this statement: Any implication or attempt to blame the heinous shooting in Buffalo on the Congresswoman is a new disgusting low for the Left, their Never Trump allies, and the sycophant stenographers in the media.",
    "In today's edition  The Post's Dan Balz and Marianna Sotomayor have a complete guide to the midterm elections  The week ahead in Congress: the Senate takes up Ukraine aid while the House focuses on gas prices and the baby formula shortage  Ketanji Brown Jackson on her career, values and historic confirmation to the high court  but first \nPresident Biden and first lady Jill Biden will travel to Buffalo on Tuesday to pay tribute to the victims of what police are calling a racially motivated massacre that has rattled the nation.",
    "The atrocious murder that targeted a predominantly Black community where 10 people were killed and 3 were wounded  11 of the 13 people shot were Black  is renewing calls by some congressional Democrats to re-examine gun control legislation and strengthen national hate crime laws while New York state officials said they would scrutinize the role played by social media companies and gun manufacturers and distributors.",
    "After a meeting with Ukrainian President Volodymyr Zelensky, Senate Minority Leader Mitch McConnell (Ky.) said in a press call that Monday night's procedural vote will pass by a significant margin? and that final passage could happen as early as Wednesday, which seems like an optimistic timeline but is a signal that Paul won't delay at every procedural opportunity.",
    "On Friday, she used the pedophilia fixated language of the radicalized QAnon movement when seemingly likening Democrats and the Biden administration to the usual pedo grifters? when she accused them of having no plan for solving the baby formula shortage other than sending pallets of formula to the southern border? for migrant babies.",
    "In a statement he said he is expected to make a full recovery and will be released sometime soon.?\nIt sounds like he is going to be O.K., but it has taken him off the campaign trail the final weekend before voters head to the polls where he is in a close race against establishment-backed Democratic Rep. Conor Lamb.",
    "The shooting was an act of evil and the criminal should be prosecuted to the fullest extent of the law.?\nStefanik, elected to Congress as a moderate Republican, began her hard-right turn during President Trump's first impeachment trial where she became a common figure on Fox News vigorously defending Trump.",
    "I know in the past I've felt, Gosh, I've really got to do well here so that other people will have this opportunity down the line.? That I might be the first, but I don't want to be the last, and it's on my shoulders to make sure that I leave a good impression so that others can follow.",
    "I know in the past I've felt, Gosh, I've really got to do well here so that other people will have this opportunity down the line.? That I might be the first, but I don't want to be the last, and it's on my shoulders to make sure that I leave a good impression so that others can follow.",
    "There is another element that now threatens to affect the direction of these elections: the prospect that the Supreme Court will overturn Roe v. Wade, a monumental action that would elevate a battle over the future of abortion rights into the campaign debates,? Dan and Marianna write.",
    "The shooting is, however, focusing attention on conservative lawmakers who have made comments in support of or similar to the great replacement theory.?\nThe number three House Republican, Elise Stefanik (D-N.Y.), is one of those members as our colleague Marianna Sotomayor reports.",
    "This is another big week for primaries where voters in Pennsylvania, North Carolina, Kentucky, Idaho and Oregon head to the polls, which could give more insight into the mood of the country as well as former president Donald Trump's hold over the Republican Party.",
    "The spotlight is also shining on some conservative candidates, lawmakers and commentators who have supported or echoed the racist great replacement? theory that apparently inspired an 18-year-old White man, Payton Gendron, who allegedly committed the slaughter.",
    "Analysts point to a nation weary at a time in which there seems no escape from disorder, whether it be the long bout with the coronavirus or soaring prices or rising crime rates in cities or surging crossings of undocumented immigrants at the southern border.",
    "out of leadership last year due to her continued criticism of Trump for spreading falsehoods about the election and his role in the Jan. 6 attack on the Capitol, she was replaced by Stefanik despite some members voicing concerns about her more moderate past.",
    "While Stefanik has not pushed the theory by name, she and other conservatives have echoed the tenets of the far-right ideology as part of anti-immigrant rhetoric that has fired up the Republican base ahead of the midterm elections,? Marianna writes.",
    "What we're reading:\nFrom Chuck Todd, who received an honorary Doctor of Public Service from his alma mater, the George Washington University, on Saturday, where he said there's nothing like a productive disagreement to get a better solution.?:",
    "In the closely-watched Pennsylvania primary, three leading Republican candidates for Senate, governor and lieutenant governor, all attended the Stop the Steal? rally on Jan. 6, our colleagues Colby Itkowitz and Rosalind S. Helderman report.",
    "The path to 60 votes in the evenly divided Senate for any gun measure doesn't exist and negotiations between Sen. Chris Murphy (D-Conn.), and Sen. John Cornyn (R-Texas), on a minor background check expansion last year fell apart.",
    "Just in time for several Tuesdays of big primaries, our colleagues Dan Balz and Marianna Sotomayor have a complete guide to the midterm elections, which covers the key primaries as well as key Senate, House and governors' races.",
    "Speaker Nancy Pelosi announced that she'll bring up a bill to help recipients of the low-income Women Infant and Children program (WIC) avoid disruptions to formula supply when shortages occur, like the one happening now.",
    "All about KBJ: Ketanji Brown Jackson sat down with our Post colleague Roxanne Roberts to discuss the pressure of being the first, tearing up during her confirmation hearing and the state of the Supreme Court.",
    "A hot hearing: FDA Commissioner Dr. Robert M. Califf will testify before the House Appropriations Committee on Thursday where Democrats and Republicans are likely to press him on the baby formula shortage.",
    "Expect Republican leaders to be pressed this week on where they stand on the once fringe theory that there is an organized effort to replace White Americans and their power with non-White immigrants.",
    "In a statement, Van Hollen said, I was admitted to George Washington University Hospital after experiencing lightheadedness and acute neck pain while I was delivering a speech in Western Maryland.",
    "And, if Republicans were to capture the House and Senate in November, Biden would become the fifth consecutive president to see his party lose both chambers of Congress on his watch,? they write.",
    "A: It means you feel the weight of wanting to succeed, not just for you in your own independent status, but because so many people are watching and view this as a door opening for others.",
    "A: It means you feel the weight of wanting to succeed, not just for you in your own independent status, but because so many people are watching and view this as a door opening for others.",
    "Another thing to look out for: The use of the Defense Production Act, a law that gives the president the ability to control private industries, to address baby formula supply problems.",
    "Added to all of that is the brutal war of aggression in Ukraine launched without provocation by Russian President Vladimir Putin, a conflict that is redrawing the international order.",
    "After all the mass shootings in recent years Democrats have pressed for stricter gun laws, such as more robust background checks, but have run into stiff opposition from Republicans.",
    "Despite promises to bring up gun control legislation for a vote after a man shot and killed Asian American women, Senate Minority Leader Chuck Schumer (D-N.Y.) has yet to do so.",
    "While opposing gun control measures they say would infringe upon Second Amendment rights, Republicans haven't unified behind any policy proposals to prevent more mass shootings.",
    "Gas prices, food costs and now the baby formula shortage are making life more difficult for many Americans and also causing major political headaches for Democrats.",
    "Because the $39.8 billion Ukraine aid bill was delayed by Sen. Rand Paul (R-Ky.) last week, the Senate will likely spend most of this week working on the bill.",
    "The bill is an attempt by Democrats to try to get ahead of the issue even as Republicans are blaming the Biden administration for being slow to respond.",
    "Lujan is just 49 years old; Fetterman is 52 years old and Van Hollen is 63, still young in the Senate where the average age is 64.3 years old.",
    "Her office said the pedo grifters? remark was directed at The Lincoln Project, a group of anti-Trump GOP political operatives, not Democrats.",
    "Since then she has cemented her position as a leading proponent of Trump's nationalistic and populist message that now dominates the party.",
    "There was also a shooting Sunday at a church in Southern California where a gunman killed one person and seriously wounded five others.",
    "Earlier today, an angiogram indicated that I had experienced a minor stroke in the form of a small venous tear at the back of my head.",
    "Democratic candidate John Fetterman had a health scare over the weekend, announcing that he had a stroke and remains in the hospital.",
    "Q: What was your response when you when you saw the draft leak [of a Supreme Court opinion that would strike down Roe v. Wade]?",
    "Some have offered their condolences and condemned the shooting, but few have called for any specific legislative response.",
    "But it's not expected to motivate Washington to produce any significant policy response after yet another mass shooting.",
    "The process will begin Monday night when they vote on the first procedural measure, cloture on the motion to proceed.",
    "Your prayers? should be for your own salvation - if you choose to sit on your hands - again - and let people die.",
    "But more mystifying is that Van Hollen, Fetterman and Sen. Ben Ray Lujn (D-N.M.) all suffered a stroke this year.",
    "Fortunately, I have been informed that there are no long-term effects or damage as a result of this incident.",
    "Seven of the last eight elections qualify as change elections  a shift in the balance in some important way.",
    "To my do-nothing colleagues:\nYour thoughts? should be about what you are going to do to end this slaughter.",
    "Pelosi endorsed the idea on CNN State of the Union? but said Congress likely has to change the law first.",
    "The House will take steps to try to address two of those issues  gas prices and baby formula  this week.",
    "Political volatility has become commonplace in a nation as deeply and closely divided as America today.",
    "https://t.co/qm7W5bMBGn\nRepublicans' response to the shootings has been much different than Democrats.",
    "At the recommendation of the Attending Physician, I sought medical attention upon my return home.",
    "While some Democratic lawmakers are calling on Congress to act, little is expected to get done.",
    "Dan and Marianna paint the Big Picture where they put this election in historical perspective.",
    "A: Everybody who is familiar with the court and the way in which it works was shocked by that.",
    "A: Everybody who is familiar with the court and the way in which it works was shocked by that.",
    "Here's an excerpt from the interview:\nQ: What does being a first mean in practical terms?",
    "Van Hollen's health scare is a reminder how fragile the Democrats' Senate majority is.",
    "In the Democratic senate primary, there's been a significant 11th hour development.",
    "Our colleagues call it a benchmark of an unprecedented American tragedy.? Tips?",
    "They are all relatively young and in seemingly in good health.",
    "In this year's elections they lay out the political dynamic.",
    "A: Survivor.? I love Survivor.? It's the best show ever.",
    "A: Survivor.? I love Survivor.? It's the best show ever.",
    "The U.S. covid death toll reached 1 million last week.",
    "announced that he suffered a stroke this weekend.",
    "When Republicans kicked Rep. Liz Cheney (R-Wyo.)",
    "Breaking: Sen. Chris Van Hollen (D-Md.)",
    "We wish them all a speedy recovery.",
    "Such a departure from normal order.",
    "Such a departure from normal order.",
    "Q: Back to your personal side.",
    "Thanks for waking up with us.",
    "Good morning, Early Birds.",
    "earlytips@washpost.com.",
    "Guilty pleasure?",
    "Comments?"
  ]
}