{
  "id": 341,
  "mediaId": 65,
  "date": "3/14/2022 12:00:00 AM",
  "headline": "Trump-backed Wyoming GOP primary challenger Hageman urges sending Cheney home to Virginia'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/932389e7-297f-4298-8bfc-baeee30a3a31/c08a4acb-804a-4eeb-a425-d9b2746a40a9/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/trump-backed-wyoming-gop-primary-challenger-hageman-urges-sending-cheney-home-to-virginia",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    2087,
    2087,
    1248,
    1147,
    1248,
    1147,
    945,
    945,
    633,
    633,
    600,
    600,
    428,
    428,
    2976,
    2953,
    2953,
    2976
  ],
  "sentences": [
    "HOUSE GOP LEADER MCCARTHY BACKS HAGEMAN OVER CHENEY IN WYOMING SHOWDOWN\nCheney is the most high-profile of the 10 House Republicans who voted 14 months ago to impeach Trump for allegedly inciting the Jan. 6, 2021 attack on the U.S. Capitol by right wing extremists aimed at disrupting congressional certification of now-President Biden's 2020 election victory.",
    "FIRST ON FOX - Harriet Hageman, the GOP congressional candidate waging a primary challenge against Rep. Liz Cheney, R-Wyo., with the backing of former President Donald Trump, argues in a new digital campaign that the Republican incumbent is out of touch with voters and is \"obsessed with her personal war\" against Trump.",
    "Monday's launch of the digital ad and the website were timed to come on the same day that Cheney is holding a fundraising event in Northern Virginia that is being headlined by Sen. Mitt Romney of Utah, the 2012 GOP presidential nominee and, like Cheney, a vocal Republican critic of Trump.",
    "Cheney, who's been very vocal in emphasizing the importance of defending the nation's democratic process and of putting country before party, is one of only two Republicans serving on a special select committee organized by House Democrats to investigate the storming of the U.S. Capitol.",
    "The new digital ad, which the Hageman campaign tells Fox News they're spending five figures to run in Wyoming, uses news clips of Cheney spotlighting the work of the Jan. 6 committee, which many in the GOP view as a partisan panel aimed at attacking the former president.",
    "CHENEY TELLS FOX NEWS THAT BEHIND THE SCENES', MANY IN GOP ARE THANKING HER\nThe younger Cheney, who served at the State Department in President George W. Bush's administration, moved full time to Wyoming in 2012, when she made an unsuccessful bid for the Senate.",
    "LIZ CHENEY HAULS IN OVER $7 MILLION LAST YEAR AS SHE FENDS OFF PUSH BY TRUMP TO OUST HER FROM CONGRESS\n\"I'm very focused right now on my re-election and on the work of the select committee,\" Cheney says in a news clip in the ad.",
    "The daughter of former Vice President Dick Cheney, the younger Cheney immediately came under verbal attack from Trump and his allies, and last May was ousted from her number-three House GOP leadership position.",
    "FIRST ON FOX NEWS: TRUMP BACKED CHENEY CHALLENGER HAGEMAN ANNOUNCES HER FUNDRAISING HAUL\nTrump, stepping up his efforts to oust Cheney from Congress, endorsed Hageman as she entered the race last summer.",
    "\"And I can tell you that the single-most important thing, though, is to ensure that Donald Trump is not the Republican nominee and that he certainly is not anywhere close to the Oval Office ever again.\"",
    "Hageman, in the accompanying website titled \"LizCheneyforVA.com,\" charges that Cheney's \"true home\" is Virginia rather than Wyoming, and that she \"understands the priorities of Northern Virginia.\"",
    "In a new digital ad by Hageman's campaign that was shared first with Fox News on Monday, the candidate charges that Cheney is \"not representing Wyoming, she's not representing our values.",
    "The former president and his allies successfully urged some, but not all, of the other anti-Cheney candidates to drop out of the primary and coalesce around Hageman.",
    "Liz Cheney split her time growing up between Wyoming and the nation's capital and she graduated from high school in 1984 in northern Virginia.",
    "Bush and later as vice president under President George W. Bush, Dick Cheney represented Wyoming in Congress for a decade.",
    "Cheney reported raising $7 million in fundraising last year, with $4.72 million cash on hand at the start of this year.",
    "She was elected to the House in 2016  with the support of Hageman -- and was reelected in 2018 and 2020.",
    "Trump's efforts to take down Cheney have fueled the congresswoman's campaign coffers.",
    "An accompanying spoof website set up by the campaign is titled \"Cheney for Virginia.\"",
    "Before he served as Defense Secretary under President George H.W.",
    "Let's send her home, to Virginia.\"",
    "Wyoming's primary is August 16."
  ]
}