{
  "id": 342,
  "mediaId": 12,
  "date": "3/14/2022 12:00:00 AM",
  "headline": "Anti-Trump Republicans lining up for 2024 shadow primary",
  "image": "https://www.ajc.com/resizer/0JoX6nniv40Dju4WvAi2I6GXvbA=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/QMTVC2PK6YIB5GTQRF7XSTAQNY.jpg",
  "link": "https://www.ajc.com/news/nation-world/anti-trump-republicans-lining-up-for-2024-shadow-primary/C5ICRHCG6BH5BCEUPXRLZA264Y/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STEVE PEOPLES",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1286,
    1796,
    2195,
    2214,
    3094,
    428,
    2782,
    2976
  ],
  "sentences": [
    "I don't think it would be easy, but she would be a formidable candidate, for sure.?\nCheney has encouraged 2024 speculation by delivering prominent speeches about the future of the Republican Party in recent months, including a November address in New Hampshire, which typically hosts the first presidential primary election.",
    "It's looking and saying, Is there going to be a voice out there that can represent from that megaphone the importance of defending this country and democracy and what America is about?' There certainly, I'm sure within the next year or so, will be a point at which you have to make a decision.",
    "More than two years before the next presidential election, a shadow primary is already beginning to take shape among at least three fierce Republican critics of former President Donald Trump to determine who is best positioned to occupy the anti-Trump lane in 2024.",
    "While I'm focused on finishing my term as governor strong, I'm going to continue to stand up and be a voice for getting our party and our country back on the right track.?\nFor now, Cheney, Hogan and Kinzinger remain friendly and in semi-regular contact.",
    "Their apparent willingness to run  even if Trump does, as is widely expected  represents a shift from previous years when \"Never Trump\" operatives failed to recruit any GOP officeholders to challenge the incumbent president.",
    "Above all, they want to hinder Trump's return to the White House, at least compared with 2020, when his allies cleared the field of any Republican opponents and persuaded some states to cancel primary contests altogether.",
    "It's there as an option, but it's not necessarily because this is all some big plan so I can be in the White House,? Kinzinger told The Associated Press when asked about his timeline for deciding on a presidential run.",
    "The 44-year-old Illinois congressman, a lieutenant colonel in the Air National Guard, plans to spend much of the year working to defeat Republicans in the midterms who promote Trump's false claims of voter fraud.",
    "But those close to Cheney, Hogan and Kinzinger insist a significant number of less vocal Republican voters are eager to move past Trump, especially after he inspired the Jan. 6, 2021, attack on the U.S. Capitol.",
    "To strengthen his network, Hogan is planning to travel to Iowa and New Hampshire  the first and second states on the traditional presidential primary calendar  to stump for local candidates in coming months.",
    "But my hope would be to be able to find the salvation of the GOP.?\nAssociated Press writers Mead Gruver in Cheyenne, Wyoming, and Meg Kinnard in Florence, South Carolina, contributed to this report.",
    "But with the 2024 contest almost in view, the question is no longer whether one of Trump's prominent Republican critics will run, but how many will mount a campaign and how soon they will announce.",
    "She's opened up the door across the country by standing up on a national platform that bridges that middle gap of the people that were frustrated on both the left and the right,? Brown said.",
    "But most in this group have offered Trump far more praise than criticism, leaving the likes of Cheney, Hogan and Kinzinger as the only consistent Trump antagonists in the 2024 conversation.",
    "The range of prospects suggests an openness within the GOP to move past Trump and his divisive politics, even as many Republican voters suggest they would like to see him run a third time.",
    "There is a large and growing lane of Republicans and Americans across the political spectrum who are fed up with toxic politics and want to move in a new direction,? Hogan told the AP.",
    "Meanwhile, both Hogan and Kinzinger are building political organizations that could serve as vehicles to promote their presidential ambitions after they leave office early next year.",
    "And while her allies indicate she is focused on her reelection, it's an open secret that she is seriously considering a presidential run once the 2022 race is decided.",
    "Cheney is building a national fundraising network, as demonstrated by a $7.1 million fundraising haul in 2021, among the most in the nation for any House member.",
    "Kinzinger, among 10 Republican House members who voted to impeach Trump, chose not to seek reelection after his district was redrawn in the Democrats' favor.",
    "Only Cheney, who also voted to impeach, is running to retain her seat in this fall's midterms, although she is no lock to win her primary election in August.",
    "Last month, he announced a plan to encourage Democrats and independents to cast ballots in Republican primaries when possible to oust pro-Trump candidates.",
    "Kinzinger said he would even consider a 2024 run as an independent if that's the best way to stop Trump, although he prefers to stay a Republican.",
    "He remains the most popular figure among Republican voters and plans to use the upcoming midterms to keep bending the party in his direction.",
    "Several former Trump loyalists who have emerged as on-again, off-again Trump critics are also eyeing the GOP's next presidential nomination.",
    "He already decided against a 2022 Senate campaign, rebuffing an aggressive lobbying effort from Senate Republican leader Mitch McConnell.",
    "Lest anyone question his intentions, Trump told thousands of supporters Saturday night in South Carolina, \"We may have to run again.\"",
    "Those close to Cheney, Hogan and Kinzinger expect one of them, if not more, to launch a presidential bid after the 2022 midterms.",
    "After all, 10 Republican representatives voted to impeach Trump and seven Republican senators subsequently voted to convict him.",
    "About 7 in 10 Republicans said the former president should run for president again in 2024, according to a CBS poll last month.",
    "He was in South Carolina, for instance, to support GOP rivals to two incumbent members of Congress who have crossed him.",
    "By some measures, the 55-year-old daughter of former Vice President Dick Cheney has the strongest national profile.",
    "Wyoming state Rep. Landon Brown, a Cheney ally, said this network will allow her to compete on a national scale.",
    "Among the most common reasons they cited: He's the best Republican candidate and has the best chance of winning.",
    "While all three are nationally known to some degree, their goal would not necessarily be to win the presidency.",
    "He voted to impeach Trump for inspiring the Jan. 6 insurrection while Murkowski voted for Trump's conviction.",
    "Kinzinger's outside group, Country First, now claims chapters in 38 states and a growing fundraising base.",
    "If it's not me doing anything, certainly we'll be all in for whoever can represent us,? Kinzinger said.",
    "Rep. Adam Kinzinger, R-Ill., is considering a rough timeline for a potential presidential announcement.",
    "Hogan also plans to host events for Sen. Lisa Murkowski, R-Alaska, and Rep. David Valadao, R-Calif.",
    "This country is built really for two parties, like it or love it or hate it,\" he told the AP.",
    "Hogan's advocacy group, America United, has millions in the bank, according to an adviser.",
    "And allies of Rep. Liz Cheney, R-Wyo., are openly talking up her White House prospects.",
    "Hogan is working to help Trump's loudest Republican critics in other states as well.",
    "Of a Cheney presidential run, he said, I don't see any reason it wouldn't? happen.",
    "The 65-year-old, term-limited Hogan will leave office at the end of the year.",
    "Doug Ducey, who has refused to embrace Trump's lies about the 2020 election.",
    "He said he saw himself as an executive more than a legislator.",
    "Chris Christie, former Vice President Mike Pence, Florida Gov.",
    "Republican primary voters are expected to have other options.",
    "Larry Hogan is planning trips to Iowa and New Hampshire.",
    "Hogan had lunch last week with Arizona Gov.",
    "Trump is pushing hard for Cheney's defeat.",
    "Among them: former New Jersey Gov.",
    "Ron DeSantis and former U.N.",
    "NEW YORK (AP)  Maryland Gov.",
    "\"Never rule anything out.",
    "Ambassador Nikki Haley."
  ]
}