{
  "id": 347,
  "mediaId": 238,
  "date": "3/14/2022 12:00:00 AM",
  "headline": "Opinion: The GOP's anti-Trump presidential contenders should keep their options open",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/03/15/republicans-never-trump-2024-liz-cheney-larry-hogan-adam-kinzinger/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1796,
    1796,
    2087,
    2214,
    2087,
    2305,
    2305,
    2214,
    1147,
    1147,
    1248,
    1248,
    428,
    428,
    338,
    338,
    2782,
    2782,
    2661,
    2661
  ],
  "sentences": [
    "The Associated Press reports: More than two years before the next presidential election, a shadow primary is already beginning to take shape among at least three fierce Republican critics of former president Donald Trump to determine who is best positioned to occupy the anti-Trump lane in 2024.  Those close to Cheney, Hogan and Kinzinger expect one of them, if not more, to launch a presidential bid after the 2022 midterms.?\nThey should consider their full range of options.",
    "In other words, the goal should be to triumph over MAGA politics  its infatuation with conspiracy theories; its contempt for medicine; its reliance on made-up cultural wedge issues and racist nostalgia; its misogynistic outlook; and its anti-democratic bent (including normalization of violence).",
    "Indeed, Sen. Rick Scott of Florida, the chief of the National Republican Senatorial Committee who recently laid out his own agenda for the party, just discovered how unpopular sunsetting Medicare and shifting the tax burden to poorer people can be.",
    "Biden  or whichever Democrat  is infinitely better than Trump.? That, however, might not be a popular response among the voters they are courting who have imbibed the hysteria that Democrats will destroy Western civilization as we know it.",
    "Each would face an uphill climb, to put it mildly, in a party in which supermajorities refuse to admit Trump lost in 2020, insist voting should be more arduous, and think Trump did a bang-up job on covid-19 (and everything else).",
    "Third, the anti-Trump contenders will at some point need to narrow to one candidate (ideally before the first primary) to avoid slicing up what is already a minority of the GOP primary electorate.",
    "Figuring out who that would be before voting begins can be dicey, but the presidential primary field often narrows naturally before the first vote is cast based on polling, endorsements and money.",
    "Ron DeSantis (a Jan. 6 denier, race baiter, persecutor of gay kids, architect of voting subversion bills, covid conspiratorialist and Trump sound-alike when it comes to tolerating extremists).",
    "Opinions Newsletters\nPost Opinin: Opinin y anlisis sobre los temas polticos y sociales ms relevantes en los Estados Unidos, Amrica Latina, Espaa y el resto del mundo, ahora en espaol.",
    "With sore-loser rules that prevent failed party nominees from later running as independents in many states, they would be well-advised to have a party apparatus in place if needed.",
    "Follow Alerts: Sign up to receive email notifications from Eugene Robinson, Henry Olsen, Alexandra Petri and more of your favorite columnists on our newsletters page.",
    "The obvious answer, however awkward in a Republican primary, is that one of them would run as an independent or as the nominee of a new, center-right party.",
    "I can almost hear President Biden saying, God bless 'em!?\nThe three most obvious Republican contenders for an anti-Trump presidential run are Maryland Gov.",
    "The point is not only to snuff out his chance to return to the White House but also to prevent someone just as mendacious from assuming the 2024 mantle.",
    "A handful of elected Republicans still think the GOP can be rescued from the clutches of defeated former president Donald Trump and his MAGA minions.",
    "Watching the GOP base become more radicalized with each passing year, I'm highly skeptical they can separate the GOP from the toxic MAGA movement.",
    "That requires some serious thinking about policy and advance planning on how best to defeat Trump, either in the primary or the general election.",
    "None of the anti-Trump Republicans should say that Trump is horrible, unfit and dangerous but that they'll support him if he is the nominee.",
    "Trump was able to capture the GOP in part because anti-government animus and tax cuts for the rich aren't popular even with the base.",
    "Those dedicated to making sure Trump never returns to power must be equally diligent to make sure the MAGA era comes to an end.",
    "The three candidates have stark differences on policy and ideology regarding everything from green energy to abortion.",
    "They'll also need to answer the conservative complaint that they'll split the vote and allow the Democrat to prevail.",
    "Are Republicans still fixated on repealing Obamacare, as Sen. Ron Johnson (R-Wis.) recently suggested?",
    "That means running even if Trump does not, and it means defining an alternative to the MAGA mind-set.",
    "Clearly, returning to the pre-Trump playbook is a nonstarter, so what do Trump's critics support?",
    "That muddled and morally dishonest formulation would negate the rationale for their campaigns.",
    "It does the party and the country no good if the GOP swaps Trump for, say, Florida Gov.",
    "If not explicitly, they should informally vow to support the strongest of the three.",
    "And that, in turn, raises the problem: What do they do if Trump is the nominee?",
    "The trio of dissenters would be well-advised to keep several factors in mind.",
    "First, it would be a mistake to run purely as an alternative to Trump.",
    "Second, anti-Trump Republicans must define what they are for.",
    "It will nevertheless be fascinating to see them try.",
    "The right answer to that is: Darn right.",
    "Larry Hogan, Rep. Liz Cheney (Wyo.)",
    "and Rep. Adam Kinzinger (Ill.)."
  ]
}