{
  "id": 348,
  "mediaId": 157,
  "date": "3/14/2022 12:00:00 AM",
  "headline": "Anti-Trump Republicans engaging in a 'shadow primary' in case he falters: report",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29534308&width=1200&coordinates=0%2C34%2C0%2C8&height=600",
  "link": "https://www.rawstory.com/anti-trump-republicans-engaging-in-a-shadow-primary-in-case-he-falters-report/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1147,
    1248,
    1434,
    1796,
    2195,
    2214,
    3094,
    428,
    2661
  ],
  "sentences": [
    "It's looking and saying, Is there going to be a voice out there that can represent from that megaphone the importance of defending this country and democracy and what America is about?' There certainly, I'm sure within the next year or so, will be a point at which you have to make a decision.\"",
    "Ambassador Nikki Haley are ostensibly sitting on the sidelines waiting to see if Donald Trump announces his third bid to run for president again, some of the former president's Republican critics are making moves to line up support for a bid themselves if he decides to sit 2024 out.",
    "According to a report from the Associated Press, a trio of anti-Trumpers are testing the waters by traveling and seeing if there is enough support to jump into the race with an appeal to conservatives who have grown tired of the twice-impeached former president's act.",
    "According to Kinzinger -- a favorite target of Trump due to his participation on the House select committee investigating the Jan. 6, insurrection -- \"It's there as an option, but it's not necessarily because this is all some big plan so I can be in the White House.",
    "\"Their apparent willingness to run  even if Trump does, as is widely expected  represents a shift from previous years when 'Never Trump' operatives failed to recruit any GOP officeholders to challenge the incumbent president.",
    "Above all, they want to hinder Trump's return to the White House, at least compared with 2020, when his allies cleared the field of any Republican opponents and persuaded some states to cancel primary contests altogether.\"",
    "But with the 2024 contest almost in view, the question is no longer whether one of Trump's prominent Republican critics will run, but how many will mount a campaign and how soon they will announce,\" the report states.",
    "But most in this group have offered Trump far more praise than criticism, leaving the likes of Cheney, Hogan and Kinzinger as the only consistent Trump antagonists in the 2024 conversation.\"",
    "According to the report, the three are engaging in what is described as a \"shadow primary\" with an eye on becoming the leading alternative choice for so-called \"Never Trumpers.\"",
    "The report goes on to note, \"Several former Trump loyalists who have emerged as on-again, off-again Trump critics are also eyeing the GOP's next presidential nomination.",
    "\"Those close to Cheney, Hogan and Kinzinger expect one of them, if not more, to launch a presidential bid after the 2022 midterms.",
    "While all three are nationally known to some degree, their goal would not necessarily be to win the presidency.",
    "Rep. Adam Kinzinger, R-Ill., is considering a rough timeline for a potential presidential announcement.",
    "If it's not me doing anything, certainly we'll be all in for whoever can represent us,? he predicted.",
    "And allies of Rep. Liz Cheney, R-Wyo., are openly talking up her White House prospects.\"",
    "While high-profile Republicans like former Vice President Mike Pence and ex-U.N.",
    "As Steve Peoples of the Associated Press wrote, \"Maryland Gov.",
    "Chris Christie, former Vice President Mike Pence, Florida Gov.",
    "Larry Hogan is planning trips to Iowa and New Hampshire.",
    "Among them: former New Jersey Gov.",
    "Ron DeSantis and former U.N.",
    "Ambassador Nikki Haley."
  ]
}