{
  "id": 358,
  "mediaId": 157,
  "date": "3/11/2022 12:00:00 AM",
  "headline": "Bill Barr tells CNN he'll get involved in GOP primary to prevent Trump from winning nomination",
  "image": "https://www.rawstory.com/media-library/bill-barr.jpg?id=29491832&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-bill-barr-2656931651/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    920,
    1147,
    2525,
    3094,
    106,
    428
  ],
  "sentences": [
    "Bill Barr says he'll get involved in GOP primary to prevent Trump from winning nomination\nNOW WATCH: Family of Gabby Petito sues parents of Brian Laundrie -- accusing them of knowing he killed their daughter\nFamily of Gabby Petito sues parents of Brian Laundrie -- accusing them of knowing he killed Petito",
    "Former Attorney General Bill Barr has said in the past that he would still vote for Donald Trump if he's the GOP's nominee in 2024 -- but he also told CNN's Jake Tapper on Friday that he will get involved in the Republican primary to derail his attempt at the nomination.",
    "During a lengthy interview, Tapper pointed to Barr's conclusion in his recently released book, \"One Damn Thing After Another,\" that the GOP would be best served by moving on from Trump in 2024.",
    "Barr would not specify which Republican candidates he would get behind, although he told Tapper that he didn't believe Rep. Liz Cheney (R-WY) had any shot at actually getting the nomination.",
    "From my standpoint, the progressive left... is sort of showing sort of a totalitarian temperament and I think the republicans can win a decisive majority.",
    "\"I think the coming presidential election would be a good opportunity for the Republican Party.",
    "\"If Trump runs, would you get involved in the primary fight to defeat him?\"",
    "\"Absolutely,\" Barr said without hesitation.",
    "But I don't think we can do it with Trump.",
    "\"To support one of the other candidates?\"",
    "He's just too divisive a candidate.\"",
    "Watch the video below.",
    "\"Yes,\" Barr said.",
    "Tapper asked him.",
    "asked Tapper."
  ]
}