{
  "id": 360,
  "mediaId": 237,
  "date": "3/10/2022 12:00:00 AM",
  "headline": "Has Trump's seal lost its appeal?",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/40078b9/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F2f%2Fee%2Fc81bed29445f80ebed94b3deb59a%2Fwb.compaign.jpg",
  "link": "https://www.washingtonexaminer.com/has-trumps-seal-lost-its-appeal",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Virginia Aabram",
  "authorUrl": "https://www.washingtonexaminer.com/author/virginia-aabram",
  "termIds": [
    1248,
    1284,
    1284,
    1147,
    1248,
    1147,
    1026,
    997,
    997,
    1026,
    1671,
    1671,
    428,
    428,
    2550,
    2550
  ],
  "sentences": [
    "Just In...\nWith the arrival of spring comes primary season, and with each Republican primary comes the opportunity to assess former President Donald Trump's power as voters weigh the value of his endorsements.",
    "With victories such as Sen. Tommy Tuberville beating former Attorney General Jeff Sessions in the 2020 Alabama Senate primary runoff under his belt, Trump's endorsements have been regarded with interest.",
    "Trump boasted in a March 3 statement following the Texas Republican primaries that he went 33 wins and 0 loses? and that on the heels of yet another show of his kingmaking prowess, his enemy Arizona Gov.",
    "But the statistics on his hundreds of endorsements throughout the last six years show that his candidates' wins may not have been his doing, and his backing today might not be worth what it once was.",
    "Though all the Trump-backed incumbents won by at least 7 points, many won by even wider margins that suggested they weren't reliant on Trump's boost, the Dallas Morning News reported.",
    "He endorsed 113 candidates in the GOP primaries, but according to an analysis by FiveThirtyEight, only 22% were actually risky? as the rest were incumbents or running unopposed.",
    "A December poll of 500 likely GOP primary voters in Alabama showed that only 19% said they would vote for Rep. Mo Brooks specifically because he carries Trump's endorsement.",
    "He's endorsing earlier and trying to oust at least 10 members of his party from the federal government, such as Wyoming Rep. Liz Cheney and Alaska Sen. Lisa Murkowski.",
    "It wasn't like the president was taking big gambles in most cases,? said Josh Blank, research director at the Texas Politics Project at the University of Texas.",
    "It's an attempt to coalesce a nationwide elected faction around his wing of the GOP, one devoted to election integrity as much as \"America First\" policies.",
    "He's also going down the ballot in an attempt to install election-truther loyalists at all levels of state government, especially in Michigan and Arizona.",
    "Over two-thirds of Trump's picks were incumbents, thus statistically safe choices since incumbent candidates fare much better than newcomers.",
    "It may be that President Joe Biden's agenda is enough to clarify to Republican voters what they want in light of being given what they don't.",
    "So far in the 2022 midterm election primaries, FiveThirtyEight pointed out that Trump is taking more risks  Texas example excluded.",
    "Trump's risk-averse strategy stretches back throughout his political career and was especially on display in the 2020 elections.",
    "Another 38% said that though they support Trump generally, they would keep open minds about whom to give their support.",
    "Of the other 10, five won their primaries and five didn't skate cleanly enough to avoid runoff elections on May 24.",
    "But on closer inspection, the outcomes of these 33 Texas endorsements aren't all that surprising.",
    "At first glance, the verdict on Trump's latest round of endorsements appears favorable.",
    "And one-third of voters said Trump's backing wouldn't influence how they vote.",
    "Trump's signoff merely adds a flavor appealing to only half his party.",
    "But this strategy may not play out well with voters.",
    "But just what does Trump's bestowment of favor mean?",
    "Doug Ducey wouldn't dare run for Senate."
  ]
}