{
  "id": 361,
  "mediaId": 19,
  "date": "3/10/2022 12:00:00 AM",
  "headline": "Fundraiser for Alabama's Katie Britt Linked to Program that Sells U.S. Citizenship to Rich Foreign Nationals",
  "image": "https://media.breitbart.com/media/2022/03/Screenshot-2021-05-29-144332-640x489-640x489.jpeg",
  "link": "https://www.breitbart.com/politics/2022/03/10/fundraiser-for-alabamas-katie-britt-linked-to-program-that-sells-u-s-citizenship-to-rich-foreign-nationals/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    1691,
    1691,
    1948,
    1948,
    940,
    940,
    1091,
    1091,
    1482,
    1482,
    434,
    434,
    11,
    11,
    2537,
    2537,
    2932,
    2932
  ],
  "sentences": [
    "Fox News host Tucker Carlson has previously called the EB-5 visa program nothing more than a money-laundering scheme? where a few people get rich by selling a path to [American] citizenship for Chinese nationals and their children.?\nThough proponents claim the EB-5 visa program helps enrich underserved American communities by bringing in foreign capital, the program is often used to build luxury condos and apartment buildings  an operation that Kaegi's former employer boasts of.",
    "On Wednesday, fundraiser to former Never Trump? Sen. Bob Corker (R-TN) Kim Kaegi organized a fundraiser for Britt that included Corker's former Chief of Staff Todd Womack, former Corker staffer Brent Wiles, and Butler Snow lobbyist Mandy Young, who previously donated to former Democrat Tennessee Gov.",
    "The fundraiser helping Alabama Republican Senate candidate Katie Britt raise money from big-dollar donors has ties to a visa program that effectively sells a pathway to naturalized American citizenship to wealthy foreign nationals who invest in United States real estate, Breitbart News has learned.",
    "In addition to Kaegi's deep ties to the failed Never Trump? movement, she previously worked as the managing director of LCR Capital Partners  a firm that facilitates wealthy foreign nationals and their family members into securing green cards by claiming to invest in U.S. real estate.",
    "The EB-5 visa program allows wealthy foreign nationals to claim to invest at least $900,000 in United States development projects in order to receive green cards for themselves and their family, with eventual pathways to American citizenship.",
    "The EB-5 program is fraught with abuse,? Brooks said at the time:\nIt is nothing more than a citizenship buying program used overwhelmingly by wealthy and well-connected Chinese nationals.",
    "In fact, most qualifying investments end up supporting real estate projects in affluent urban areas, not in economically distressed cities as the program originally intended.",
    "Trump's son, Donald Trump Jr., previously called her the Alabama Liz Cheney.?\nBrooks has been endorsed by Reps. Marjorie Taylor Greene (R-GA), Barry Moore (R-AL), Sens.",
    "Rep. Mo Brooks (R-AL), running against Britt in the GOP primary for the open Alabama Senate seat, has long slammed the EB-5 visa program as legalized corruption.",
    "The overwhelming majority of EB-5 visas are rewarded to China's elite  driving a migration of rich Chinese to cities across the country.",
    "Ted Cruz (R-TX), Rand Paul (R-KY), Americans for Legal Immigration (ALIPAC), and the National Association for Gun Rights, among others.",
    "As Breitbart News has reported, 10,000 foreign nationals and their families are allowed to enter the U.S. every year on the EB-5 visa.",
    "Those areas, though, are often in wealthy zip codes to build luxury shopping centers and condos for the wealthiest of Americans.",
    "The foreign EB-5 investor's only requirement is to claim to have created ten U.S. jobs and revitalize distressed? areas.",
    "This program is one of many U.S. immigration programs that do little to benefit America, and it should be eliminated.",
    "[Emphasis added]\nBritt is the former president and CEO of the U.S. Chamber of Commerce's Business Council of Alabama.",
    "The program effectively sells American citizenship to the highest foreign bidders.",
    "Last year, for instance, Brooks sought to shut the program down altogether.",
    "The Republican primary in the race is on May 24.",
    "John Binder is a reporter for Breitbart News.",
    "American citizenship should not be for sale.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here.",
    "Phil Bredesen."
  ]
}