{
  "id": 365,
  "mediaId": 238,
  "date": "3/9/2022 12:00:00 AM",
  "headline": "Opinion: MAGA loyalists run into trouble",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/03/10/maga-republicans-setbacks/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    652,
    899,
    1248,
    1758,
    1999,
    2062,
    2465,
    3085,
    3094,
    211,
    2590,
    2942
  ],
  "sentences": [
    "Mark J. Rozell, dean of the Schar School of Policy and Government at George Mason University, recently wrote for The Post that a potential tripwire? for the two Republicans would be whether they prefer the approach of former president Donald Trump, their party's dominant figure.? They can stick with Trump and look like Vladimir Putin apologists or break with him and watch the base turn on them.",
    "That doesn't necessarily mean that Democrats will be the beneficiaries of their stumbles, but it does show that the most dutiful cultists of defeated former president Donald Trump have less than an ironclad hold on their party and face some general-election challenges.",
    "McMullin tells me, I greatly appreciate Sen. Romney's friendship and principled leadership in the Senate, and I respect his decision not to make an endorsement at this time.? Refusing to endorse your fellow home-state senator of the same party is shocking.",
    "Bryce E. Reeves of Spotsylvania and Jen A. Kiggans of Virginia Beach (challenging Democratic Reps. Abigail Spanberger and Elaine Luria, respectively) have chosen to attack President Biden on national security at a particularly inopportune time.",
    "voting against a Jan. 6 commission, recently objecting to sending U.S. troops to fellow NATO countries without invoking the War Powers Act), leaving McMullin to run as a Romney-like conservative.",
    "Lee's low statewide popularity (42 percent approval in one poll) and Romney's refusal to throw Lee a lifeline have given McMullin a chance to take down one of Trump's most loyal followers.",
    "If the measure had become law, voters may not have known for certain who was running before having to register with a certain party.? That's a big boost to Rep. Liz Cheney (R-Wyo.",
    "After all, even the usually spineless House Minority Leader Kevin McCarthy (R-Calif.) managed to acknowledge that Putin was neither a genius? nor savvy,? as Trump claimed.",
    "The same Trump-Putin problem might hobble other Republican Trump sycophants who never spoke out against his extortion of Ukraine or his fawning praise for Putin.",
    "And it's not just because prominent members of the GOP are advocating repealing Obamacare, raising taxes, and persecuting gay people and transgender kids.",
    "Running that way against two women with strong national security credentials (Spanberger served in the CIA, Luria in the Navy) makes little sense.",
    "Romney has broken with Lee repeatedly, on everything from impeachment to Ukraine to infrastructure spending (which Lee inexplicably opposed).",
    "Wyoming Democrats, who have virtually no shot at winning in the deep-red state, should offer to stand down, if not endorse Cheney outright.",
    "Moreover, Romney's explanation  that he does not weigh in for primaries  makes no sense, since McMullin isn't running in the GOP primary.",
    "By regarding them as essentially running side by side, Romney bolsters McMullin's argument that he is a conservative alternative to Lee.",
    "In Wyoming, the Casper Star-Tribune reports that a bill that aimed to end same-day party affiliation changes? died without a vote.",
    "), who would love crossover support from Democrats and independents in her primary against MAGA favorite Harriet Hageman.",
    "This is what's required for a cross-ideological alliance to succeed at preserving democratic values and institutions.",
    "Glenn Youngkin has mediocre approval numbers and has incited a torrent of opposition to his extreme policy proposals.",
    "While Romney did not endorse independent conservative Evan McMullin, who is challenging Lee, he called him a friend.",
    "A second development also suggests more traditional Republicans are in no hurry to help MAGA-oriented colleagues.",
    "Ukraine is one area where his performance approval is rising, and Republicans are back on their heels.",
    "Finally, radical Republicans have run into trouble in Virginia  and not just because Republican Gov.",
    "In a stunning blow to Sen. Mike Lee (R-Utah), Sen. Mitt Romney (R-Utah) has declined to endorse him.",
    "Certainly, Cheney, McMullin, Spanberger and Luria still have their work cut out for them.",
    "But there are signs of stress in the MAGA cult  and that's good news for the country.",
    "The bill pushed by Trump allies was designed to deprive her of that support.",
    "In three different states, the MAGA forces suffered recent setbacks.",
    "Lee has gone far-right in the Trump and post-Trump era (e.g.",
    "GOP state Sens."
  ]
}