{
  "id": 366,
  "mediaId": 19,
  "date": "3/9/2022 12:00:00 AM",
  "headline": "Exclusive  Scott Presler: Every Aspect of Our Lives' Is Affected by Biden's Feckless and Reckless Agenda'",
  "image": "https://cdn.jwplayer.com/v2/media/REJh6ob2/poster.jpg?width=1280",
  "link": "https://www.breitbart.com/politics/2022/03/09/exclusive-scott-presler-every-aspect-our-lives-affected-by-bidens-feckless-reckless-agenda/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    1147,
    1248,
    1758,
    2087,
    2214,
    3094,
    428,
    2945,
    2953
  ],
  "sentences": [
    "And so we're seeing an uprising with teachers, with students, with parents, with working class America  these are the people that are going to propel an America First Win in 2022.?\nHowever, Presler stressed that electing America First conservatives is priority  not so-called Republicans in the same vein as Rep. Liz Cheney (R-WY) and Rep. Adam Kinzinger (R-IL).",
    "Every aspect of our lives? is affected by President Biden's feckless and reckless? agenda  from soaring gas prices to crumbing foreign policy  grassroots conservative activist Scott Presler told Breitbart News during an exclusive interview at the Conservative Political Action Conference (CPAC).",
    "I will be returning to Wyoming to help primary and defeat Liz Cheney,? he added, listing election integrity, medical freedom, parental choice, border security, and an internet bill of rights as the top issues an America First Congress should tackle on day one.",
    "Look at how every aspect of our lives are affected by Joe Biden's feckless and reckless agenda,? he said, providing specific examples showing the stark contrast between Biden's presidency and former President Trump's.",
    "You can't live daily life now without experiencing the catastrophe of what it's like living under the Joe Biden agenda.?\nThat's what people care about,? he said before pointing to the school system as well.",
    "Presler, who has spoken to countless Americans through his laser-focused efforts to register new voters, said Americans are particularly concerned with the economy under Biden's presidency.",
    "Glenn Youngkin in part because we've seen that parents felt they weren't being represented by school board members,? he said, noting that he lives in northern Virginia himself.",
    "So the reason why I'm doing this work is I want to make sure when we take the House, when we take the Senate, that we are electing American First conservatives.",
    "They're talking about war with Russia when we had peace in the Middle East  we had peace in Europe under President Trump.",
    "They were being told by the state, by the government, that they didn't have a voice in education.",
    "I have to be honest with you, I'm not a Bush or Cheney or an Adam Kinzinger globalist Republican.",
    "You go to the supermarket  all the cost of meat and foods are up,? he said.",
    "So I've been to Illinois because we primaried Adam Kinzinger.",
    "It's higher than it was a year ago under President Trump.",
    "He's not running for reelection.",
    "I'm an America First Republican.",
    "You go to the gas pump.",
    "We just elected Gov.",
    "You turn on the TV."
  ]
}