{
  "id": 367,
  "mediaId": 165,
  "date": "3/8/2022 12:00:00 AM",
  "headline": "Fox News' Invasion Expert Is a Trump-Appointed Putin Propagandist Who Thinks Russia Is Being Too Gentle'",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/03/douglas-macgregor.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-news/douglas-macgregor-fox-news-tucker-carlson-russia-ukraine-1318143/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Bort",
  "authorUrl": "https://www.rollingstone.com/author/ryan-bort/",
  "termIds": [
    683,
    1147,
    1601,
    1870,
    2030,
    2486,
    3094,
    200,
    2888,
    2942
  ],
  "sentences": [
    "In a 2016 presentation his group delivered to the Command General Staff College at Fort Leavenworth, Macgregor wrote that old alliances like NATO may vanish,? and argued that it's time to reexamine U.S. investment in allies' that are doing too little to secure their own sovereign interests,? noting that the Cold War ended 27 years ago.?\nI just dug up an old presentation by Douglas Macgregor, Tucker's favorite analyst on the Russian invasion.",
    "When he was asked if America should just let Russia take whatever it wants from Ukraine, Macgregor said absolutely,? adding that it shouldn't be a big deal because the population there is indistinguishable from their own.?\nFormer Trump Advisor Douglas MacGregor says we need to stop demonizing Putin, lift all sanctions, stop providing weapons and aid, that it's hopeless,? and just let Putin take whatever part of Ukraine that he wants.",
    "Nevertheless, Carlson introduced him last week as an honest man,? after which Macgregor pushed more Putin propaganda, arguing he is simply trying to prevent further attempts to influence or change Ukraine into effectively a platform for the projection of U.S. and Western power into Russia.?\nHis subsequent comments about Russia being too gentle?  which Rep. Liz Cheney (R-Wyo.)",
    "CNN reported that he has on multiple occasions claimed that U.S. support for Israel is due to the Israeli lobby? making top officials very, very rich.?\nCarlson is also, of course, a leading proponent of the Great Replacement theory, and Media Matters notes that Trump repeatedly? considered Macgregor for jobs in his administration after his appearances on Carlson's show.",
    "In fact, it may break down the financial system that we have set up to punish everyone in the world we don't like.?\nMacgregor: Russia will not suffer as a result of our sanctions pic.twitter.com/gewaMXQfBW\n Acyn (@Acyn) March 8, 2022\nJPMorgan estimated recently that Russia's GDP will decline by 12 percent, that the country's exports will decline by 13 percent.",
    "MacGregor's appearance on Monday comes just days after he told Stuart Varney of Fox Business that Russia's forces were too gentle? during the first days of the invasion, that Ukrainian President Volodymyr Zelensky is a puppet? who shouldn't be resisting Russia's incursion, and that everything that's been coming out of Ukraine is propaganda.",
    "Trump nominated him in the summer of 2020 to be the U.S. ambassador to Germany, with the White House describing him as a decorated combat veteran, author, and a consultant,? as well as a frequent radio and television commentator on national security affairs.? The nomination didn't pan out after CNN reported on Macgregor's history of racism.",
    "More here: https://t.co/3V66QC8uqQ pic.twitter.com/ZYtsMCikNu\n Noah Shachtman (@NoahShachtman) March 8, 2022\nMedia Matters recently dug into his past appearances on Fox News, including several on Carlson's show, and found that Macgregor's nationalism very much extends to immigration issues.",
    "pic.twitter.com/HBnLWVdVgD\n Ron Filipkowski (@RonFilipkowski) February 28, 2022\nMacgregor is about as pro-Putin as it gets, and, unlike others in the Republican Party, hasn't backed off as the authoritarian has invaded a neighboring democracy.",
    "I'm inclined to disagree with you, Colonel,? he said\nUS Colonel MacGregor says:\n1)Russian army was too gentle?, but now will complete everything? within 10 days\n2)Zelenskyy is delusional? & a puppet?.",
    "He's a staunch anti-interventionist to the point that, like former President Trump, he's questioned America's participation in NATO, the West's primary military counterbalance against Russia.",
    "He's turned to Douglas MacGregor  a former Army colonel and Trump appointee with a history of racism  to help answer that question and generally make sense of what's happening overseas.",
    "McGregor has been popping up on various Fox News programs since the invasion, mostly to shill for Putin at a time when he's unleashing hell on one of America's allies.",
    "What is clear  is that Russia's growing economic and political isolation will lead to lower growth in the long run,? said Anatoliy Shal, an economist at JPMorgan.",
    "Macgregor's comments align with the Great Replacement theory, which is prevalent in white nationalist circles and is particularly associated with anti-Semitism.",
    "He advocated for instituting martial law at the U.S.-Mexico border, adding that the military should shoot people? if necessary, as CNN reported in 2020.",
    "The Fox News host last month called the invasion horrifying? and a tragedy? for which Putin is to blame,? before wondering how the U.S. should respond.",
    "He should've kept Ukraine neutral instead of trying to join NATO\n Alexei Arora (@AlexeiArora) March 5, 2022\nVarney shouldn't have been so surprised.",
    "A few days earlier, Macgregor said on Fox News that America needs to stop demonizing Putin and refrain from sending any aid to Ukraine.",
    "His argument against sanctioning Russia is basically another way of saying Putin should be able to do whatever it wants to Ukraine.",
    "He's also argued that Democrats are trying to transform the United States? by replacing white people with immigrants.",
    "Trump was undeterred, though, appointing Macgregor as a Pentagon senior adviser shortly after the 2020 election.",
    "He did so again Monday night, arguing on Tucker Carlson Tonight that slapping sanctions on Russia is useless.",
    "He's long praised Vladimir Putin and even said the other year that he was rooting for him against Ukraine.",
    "used to highlight the Putin wing of the GOP?  didn't dissuade Carlson from having him on again on Monday.",
    "Putin has since waged a war that has resulted in thousands of deaths, muddling Carlson's messaging.",
    "Tucker Carlson has been a little confused about how to respond to Russia's invasion of Ukraine.",
    "He's been forecasting  and banging the drum for  the death of NATO for quite a while.",
    "He apparently hasn't slipped out of the good graces of Carlson and Fox News, either.",
    "Macgregor has a history of trading in anti-Semitic tropes, as well.",
    "The sanctions  will do a lot of damage to us,? he told Carlson.",
    "They're not going to make much difference to Russia.",
    "Russia will not suffer as a result of our sanctions.",
    "Varney could barely believe what he was hearing.",
    "Macgregor isn't just a Putin apologist, either.",
    "Russia has an abundance of food and energy.",
    "China will stand with Russia.",
    "China will take it all.",
    "It knows it has to."
  ]
}