{
  "id": 371,
  "mediaId": 195,
  "date": "3/7/2022 12:00:00 AM",
  "headline": "Barr becomes latest former ally to escalate feud with Trump",
  "image": "https://cdn.jwplayer.com/v2/media/TAfC6z1r/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/administration/597204-barr-becomes-latest-ally-to-escalate-feud-with-trump",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brett Samuels",
  "authorUrl": "https://thehill.com/author/brett-samuels",
  "termIds": [
    761,
    803,
    1147,
    1169,
    1248,
    1434,
    2138,
    2525,
    3094,
    2550
  ],
  "sentences": [
    "Barr in his new book chastises Trump for claiming the 2020 election was rigged, and he said in NBC interviews promoting the book with Lester Holt and Savannah Guthrie that the former president was broadly responsible for the riot at the Capitol on Jan. 6, 2021.\nI certainly have made it clear, I don't think he should be our nominee and I'm gonna support somebody else for the nomination,? Barr said on NBC's Today,? while calling a progressive Democratic agenda the greatest threat to the country.?\nIt's hard to project what the facts are gonna turn out to be three years hence, but as of now, it's hard for me to conceive that I wouldn't vote for the Republican nominee,? Barr added.",
    "Barr was quoted last summer saying the former president's claims of fraud in the 2020 election were bullshit,? and Trump called his former attorney general a disappointment in every sense of the word.?\nBut this time, Barr's complaints about Trump's behavior follow a string of rebukes from others who served with the former president.",
    "In 2020, if you look in all of these swing states like Arizona, Georgia, Michigan, Pennsylvania, the right-leaning suburban voters are the ones that decided the election for Joe Biden.?\nTrump will face his biggest test ahead of 2024 in this year's midterms, particularly in Republican primaries where he has endorsed candidates.",
    "Now he is groveling to the media, hoping to gain acceptance that he doesn't deserve.?\nBarr responded by telling Guthrie Monday that \"The president is a man who, when he is told something he doesn't want to hear, he immediately throws a tantrum and attacks a person personally.?\nI thought the letter was childish,? he added.",
    "Former national security adviser John Bolton has commissioned polling to show Trump is not as popular in the GOP as he may seem, and former press secretary Stephanie Grisham is part of a small cadre of former Trump officials seeking to keep the former president from successfully winning a second term.",
    "On Monday, Axios published a three-page letter Trump sent to Holt, complaining about Barr's responses during their interview and deriding his former Cabinet official as slow? and lethargic.?\nHe crumbled under the pressure, and bowed to the radicaland that is not acceptable,? Trump wrote.",
    "Liz Harrington, a spokesperson for Trump, called Barr a coward? and accused him of pulling a Gen. Milley,? a reference to the chairman of the joint chiefs of staff who was quoted in multiple books released in the past year being critical of the former president's decision-making.",
    "But Donald Trump is going around endorsing a bunch of crazy people like Kari Lake in Arizona, Kristina Karamo for secretary of state in Michigan, so the idea of fading influence within the Republican Party for Donald Trump, it's not something I'm seeing at all,? he continued.",
    "What Bill Barr admitted this morning is very reflective about the majority of the Republican Party with voters, with GOP leadership, the GOP elites,? said Gunner Ramer, political director of the Republicans Accountability Project, which has been critical of Trump.",
    "A lot of Republicans are running on a completely Stop the steal' platform that is around and is popular because Donald Trump continues to lie about the results of a free and fair election in 2020 and it's animating the Republican primary base,? Ramer said.",
    "If Trump were to launch a 2024 bid for the White House, he would have to contend with the GOP-leaning independent voting bloc, which in part gave Biden a boost in 2020.\nThey cannot stand that Donald Trump has taken over the Republican Party,? Ramer said.",
    "Former Trump adviser Chris Christie has called on Republicans to move past the 2020 election, a clear jab at the former president's obsession with the result, and he has declined to say whether he would support Trump if he were the 2024 nominee.",
    "The former attorney general joins former Vice President Mike Pence and former Trump adviser Chris Christie as being among those close to Trump who have become more outspoken about their differences with the former president.",
    "Pence told GOP donors on Friday there is no room in the party for apologists? for Russian President Vladimir Putin, a veiled swipe at Trump, who has called Putin a genius? and savvy? for his aggression toward Ukraine.",
    "However, the same poll found that 54 percent of Republicans said they favored Trump when asked who the party should nominate, while only 38 percent of GOP-leaning independents said the same.",
    "Most notably, former Vice President Mike Pence, who steadfastly avoided breaking with Trump throughout their four years in office, has become more outspoken in recent weeks.",
    "At the same time, Trump's endorsement has failed to clear the primary field in a number of key races and candidates he opposes have raked in significant amounts of money.",
    "There's one person in particular that I can think of that has their own lane and has said that they will not support Trump in 2024, and that's Liz Cheney,? he added.",
    "GOP leaders who have clashed with Trump, like Senate Minority Leader Mitch McConnell (R-Ky.) have seen less luck in working to appeal to Republican primary voters.",
    "Fifty percent of GOP and GOP-leaning voters said they wanted their party to nominate the former president again, according to a CNN poll released last month.",
    "Former Attorney General Bill Barr this week escalated his criticism of Donald Trump, becoming the latest ally to publicly split with the former president.",
    "Those still loyal to Trump have dismissed Barr and others as products of the swamp? who are seeking the spotlight and approval from the mainstream media.",
    "Republicans say that Barr's acknowledgment that he would still vote for the former president is an indicator of Trump's grip on the party's elites.",
    "But despite the steady drumbeat of criticism from those Trump hired to work for him, GOP voters seem to be standing behind the former president.",
    "Cheney, for example, is in the fight for her political life in her district where she is running against Trump-backed candidate Harriet Hagemen.",
    "Trump won the annual Conservative Political Action Conference (CPAC) straw poll conducted last month with 59 percent of the vote.",
    "But in a sign of Trump's continuing grip on the party, Barr acknowledged he would still vote for his former boss in 2024.",
    "He said last month Trump was wrong? to say Pence could overturn the election, naming his former boss directly.",
    "However, other polls show that a significant number of Republicans are not on board with a Trump 2024 run.",
    "The back and forth marked the latest feud between Trump and Barr since the end of Trump's presidency.",
    "Here's the thing about Mitch McConnell, he was not able to get [Gov.",
    "Trump's support among the party's grassroots remains strong.",
    "Another 49 percent said they wanted a different candidate.",
    "The primary landscape shows a mixed bag for Trump so far.",
    "Doug] Ducey to run in Arizona,? Ramer said.",
    "Chris] Sununu to run in New Hampshire.",
    "Larry] Hogan to run in Maryland.",
    "He was not able to get [Gov.",
    "He was not able to get [Gov."
  ]
}