{
  "id": 375,
  "mediaId": 238,
  "date": "3/7/2022 12:00:00 AM",
  "headline": "Opinion: The U.S. has four political parties stuffed into a two-party system. That's a big problem.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/03/08/americas-four-party-system/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1147,
    1335,
    1335,
    1796,
    1765,
    1796,
    1765,
    2465,
    2465,
    275,
    275,
    2945,
    2945,
    2661,
    2661
  ],
  "sentences": [
    "This is the party of, for instance, President Biden, House Speaker Nancy Pelosi (Calif.), New York City Mayor Eric Adams, the policy group Third Way and the MSNBC show Morning Joe.?\nFinally, the surprisingly strong 2016 campaign of Sen. Bernie Sanders (I-Vt.) reignited the left wing of the Democratic Party and created our fourth party  a Left-Left Democratic Party.",
    "After Biden's State of the Union address last week, a prominent Left-Left Democrat (Rep. Rashida Tlaib of Michigan) delivered a response laying out a more progressive vision for the country, while a more conservative Democrat, Rep. Josh Gottheimer of New Jersey, also gave separate remarks, urging Democrats to work more with the GOP.",
    "In 2017, immediately after Donald Trump's election, I viewed America as having essentially four political parties, too, but the contours were different then: There were the Democrats, the anti-Trump Republicans, the Old Guard Trump-skeptical Republicans and the Trump-aligned Republicans.",
    "There is an ideological divide between the two Democratic parties, certainly, but their differences are also generational and attitudinal  the Left-Left Democrats tend to be younger, newer to politics and more confrontational with the Republicans than the Center-Left Democrats are.",
    "Those reforms would make it easier for candidates who aren't Democrats or Republicans to win legislative seats, thereby hastening the creation of the true multiparty system we desperately need  and under which these four parties could be their true selves.",
    "But I think the biggest difference between these two groups comes down to style: The Old Guard is resistant to America becoming a more multicultural, multiracial country, but not in the loud, aggressive way that the Trump Party opposes that evolution.",
    "Meanwhile, Ocasio-Cortez, who in 2020 correctly noted that she and Biden would be in different parties in many countries, regularly complains about what she describes as the lack of urgency coming from the Center-Left Democrats on major issues.",
    "But I suspect that in a two-candidate Democratic presidential primary, a generic candidate endorsed by Biden, Pelosi and other Center-Left Democrats would defeat someone embraced by the Left-Left Democrats by about 70 percent to 30 percent.",
    "They're trying to make it easier for their side to win elections and to contest those they lose.?\nMeanwhile, Never Trump? Republican activists and intellectuals have largely been absorbed into a third party, the Center-Left Democrats.",
    "In his Senate campaign in Utah, Evan McMullin is running as an anti-Trump independent, smartly trying to build a coalition of anti-Trump and Old Guard Republicans, Center-Left Democrats and Left-Left Democrats to win in a red state.",
    "But the Old Guard, perhaps best embodied by Senate Minority Leader Mitch McConnell (R-Ky.), news outlets such as the Wall Street Journal's editorial page and organizations such as the U.S. Chamber of Commerce, remains influential.",
    "But even those primaries and the differences illustrated in them have a positive side  Old Guard Republican and Democratic voters get a very clear sense of the terrible things that will happen if a Trump Republican gets elected.",
    "It's likely Sanders, if he had won the Democratic nomination in 2016 or 2020, would have won the overwhelming majority of Democratic voters in a general election, even though many centrist party leaders were wary of him.",
    "), Rep. Alexandria Ocasio-Cortez (N.Y.), Boston Mayor Michelle Wu, the Congressional Progressive Caucus, publications such as the American Prospect and the Intercept, and groups such as the Working Families Party.",
    "But the Trump Party clearly has the upper hand, in part because evangelical Christian activists, Fox News and conservative talk radio are firmly rooted there, as well as influential GOP politicians including Gov.",
    "McConnell wants more establishment-style Republicans in power and to keep pushing the traditional Republican agenda of low taxes and regulation,? said Seth Masket, a University of Denver political scientist.",
    "We are seeing the worst kind of governance in states such as Florida and South Dakota, where Trumpian officials have gained power and are mirroring the terrible tendencies of the former president.",
    "I thought the Old Guard represented more Republican voters and was more powerful than the Trump faction, which I believed had lucked into winning the Republican primaries and the general election.",
    "Similarly, the idea that was floated by some Center-Left Democrats to put Vice President Harris on the Supreme Court so that Biden could make an Old Guard Republican such as Rep. Liz Cheney (Wyo.)",
    "Center-Left Democrats and Left-Left Democrats are increasingly running competing candidates in Democratic primaries, recognizing that it matters what kind of Democrat represents a given district.",
    "Third, many voters, particularly anti-Trump Republicans and people with a mishmash of views that don't fit into one of these four groups, have fairly little representation in this structure.",
    "For example, former U.S. senator David Perdue, once a Republican in the McConnell mode, is now running as the Trump-aligned, election-results-questioning candidate for governor of Georgia.",
    "Maybe the Center-Left Democrats and Old Guard Republicans would occasionally unite in a coalition of the moderates; perhaps the three other parties would join forces against Trumpism.",
    "Defeated in his Senate reelection bid in 2021, Perdue correctly sees a clear path back to political power by running as the Trumpian candidate against incumbent Republican Gov.",
    "The second problem with our current structure arises on the Democratic side, where we now have two ideologically distinct blocs unhappily stuck together under the same banner.",
    "Our predicament makes me long for ranked-choice voting, proportional representation, multi-member congressional districts and other ideas being pushed by political reformers.",
    "If there had been a full-fledged Republican primary in Virginia, it would have been easier to determine that Glenn Youngkin would govern in the Trumpist style that he has.",
    "This reality becomes clear if you set aside the long-standing catchall labels Democrat? and Republican? and look at the fissures actually animating our politics.",
    "Importantly, by party? I'm referring to an informal group of elected officials, intellectuals and institutions with a shared ideology and policy positions.",
    "Much of the divide is about approach, confrontation, urgency, as well as policy,? said Daniel Schlozman, a political scientist at Johns Hopkins University.",
    "They simply have to win low-turnout primaries and then reap the benefits of partisanship, which vault them to victory in general elections in many places.",
    "Old Guard Republicans are more conservative on foreign policy, for instance, while the Trump ones fall to the right of the Old Guard on immigration.",
    "So whoever wins a Democratic or Republican primary will have the support of the overwhelming majority of that party's voters in a general election.",
    "Rank-and-file voters do play some role in shaping the views of these parties, but I think the process is largely driven by political professionals.",
    "I think a generic Trump-backed Republican would defeat a McConnell-backed Republican by about 80 percent to 20 percent in a two-candidate primary.",
    "But growing acknowledgment of the four-party structure is nonetheless acting to make American politics more transparent  and in many cases better.",
    "The United States right now has four political parties stuffed into a two-party system  and that's increasingly a big problem for the country.",
    "The obvious downside of the greater acknowledgment of these four parties is that Trump and his allies can read the political landscape, too.",
    "So they are getting deeply involved in GOP primaries and turning those into races to be the most radical, anti-democratic candidate.",
    "There is nothing new or inherently bad about America having a two-party system with each of those parties being internally divided.",
    "Most important, Old Guard figures such as McConnell wouldn't go along with Trump's scheme to overturn the 2020 election results.",
    "Brian Kemp, who angered many conservatives by refusing to go along with Trump's scheme to overturn the state's election results.",
    "Further, because the Trumpian Party is gaining strength, the Old Guard is also moving in a radical direction to compete.",
    "That makes it all too easy for Trump Republicans to gain power in our current four-parties-in-two arrangement.",
    "2 shows a laudable desire to try to build a broad coalition that can unite against the Trump Republicans.",
    "(It would, of course, be a mistake to push the first-ever woman of color out of the vice presidency.)",
    "The Trump wing is less interested in challenging that agenda than on changing how elections are done.",
    "But the path to fixing American politics probably begins by being really honest about its problems.",
    "I don't think that many rank-and-file voters fit perfectly into either of these Democratic groups.",
    "Center-Left Democrats view people with very left-wing ideas such as Rep. Cori Bush (D-Mo.)",
    "That's how Trump, whom many GOP voters were fairly wary of at first, ended up president.",
    "A small bloc within the Old Guard, such as Utah Sen. Mitt Romney and Maryland Gov.",
    "So it's not great that we have four parties stuffed into a two-party system.",
    "This tension shows up on issue after issue, and it seems intractable.",
    "None of those reforms have much chance of becoming law anytime soon.",
    "But right now, this structure is a huge problem, for three reasons.",
    "There are policy differences between these two Republican parties.",
    "Larry Hogan, isn't just Trump-skeptical but outright anti-Trump.",
    "Most voters are not that ideological but are quite partisan.",
    "Five years later, a different party structure has emerged.",
    "This party includes Sanders, Sen. Elizabeth Warren (Mass.",
    "The Trump Republicans and the Old Guard remain distinct.",
    "Ron DeSantis of Florida and, of course, Trump himself.",
    "First of all, it is empowering the Trump Republicans.",
    "And that's where the biggest problem comes in.",
    "My own views are closest to this group.",
    "What can be done about these problems?",
    "as tarnishing the party's brand.",
    "or Romney his No."
  ]
}