{
  "id": 378,
  "mediaId": 409,
  "date": "3/4/2022 12:00:00 AM",
  "headline": "Phil and the Saudis, &c.",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/03/phil-mickelson.jpg?w=1592",
  "link": "https://www.nationalreview.com/2022/03/phil-and-the-saudis-c/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jay Nordlinger",
  "authorUrl": "https://www.nationalreview.com/author/jay-nordlinger/",
  "termIds": [
    669,
    1566,
    1609,
    1621,
    1716,
    1839,
    2476,
    3094,
    17,
    396,
    2899
  ],
  "sentences": [
    "Allow me to quote the last sentence of my Don Carlos review:\nChances are, I was not the only one in the audience who thought of the boss in the Kremlin when Rodrigo said to Philip, O King, beware that history does not say of you: he was another Nero!?\n Early on Monday morning, I was in Rockefeller Center (New York).",
    " One of the great questions of recent years  and over the centuries, of course  has been What's a conservative?? I took up this question in an essay a couple of years ago: Conservative': A Term Up for Grabs.? I generally stay out of the definitional wars, but sometimes I reenter the fray, or at least comment on it.",
    "It's kind of a concept.? He added, It's just a corrupt area that the Clintons turned into a colony where they can steal money out of.? This is the kind of thing poured into the ears of Americans day after day.",
    "Vance, the Republican Senate candidate in Ohio, who said, I gotta be honest with you, I don't really care what happens to Ukraine one way or another.? In fact, he said it to Bannon  on Bannon's show.",
    "I was planning to write a piece saying, basically, Unleash American energy, for heaven's sake.? KDW has done so in a piece headed Time to Take the Brakes Off the U.S. Energy Industry.? Yes.",
    " In the Atlanta airport, I saw a woman whose shirt had an amazing message: Self-love is so gangster.? I'm just tickled (as we'd say in my native Midwest) by that statement.",
    "I will offer some links, for those interested: Notes on the Catastrophe.? The Spirit of Snake Island, Etc.? Wrestling with Hell.?\n For the music-minded, I have some links.",
    "As David Frum once said to me, Schoolchildren of the future will marvel that the world once ran on an oozy black substance from under the ground.? That day is coming.",
    "Because this is a once-in-a-lifetime opportunity to reshape how the PGA Tour operates.?\nWhen these remarks were made public, the world came down on Mickelson's head.",
    "They execute people over there for being gay.?\nSo, knowing all of this, why would I even consider it?? Consider hopping into bed with the Saudis, that is?",
    " Sometimes you want to write a piece, but someone else does it for you  and when that someone else is Kevin D. Williamson, all the better.",
    "Vance vs. Barry McCaffrey; the curse of music; and more\nPhil Mickelson is one of the greatest golfers of our time, and of all time.",
    "He wanted to gain leverage over the PGA Tour, in order to achieve some reforms on the Tour he thinks are necessary, or desirable.",
    "He said to Steve Bannon, We are no longer conservatives, we are Americans who love our founding.? So, that's good news, bad news.",
    "At any rate, does there come a point at which populist rhetoric is so extreme and so mendacious, it loses its appeal to voters?",
    "On Twitter, Barry McCaffrey responded sharply to Vance  harshly:\nJD Vance is a shameful person unsuitable for public office.",
    " Marjorie Taylor Greene, the Republican congresswoman from Georgia, spoke at the America First Political Action Conference.",
    "Leading the 24th Infantry Division in the Gulf War, McCaffrey delivered the famous left hook.? It was in all the papers.",
    "You drank fine wine at bullshit security conferences while thousands of working class kids died on the battlefield.",
    "He's one of the finest public servants I've met in America.?\nPortman is now a senator, not running for reelection.",
    "If you would like to receive Impromptus by e-mail  links to new columns  write to jnordlinger@nationalreview.com.",
    "But a desire to preserve and further the American founding is the very definition of an American conservative.",
    "The Republican leader in the House, Kevin McCarthy, has said, There's no place in our party for any of this.",
    "A footnote: In 1999, I interviewed McCaffrey, and he brought up a young congressman from Ohio  Rob Portman.",
    "He told an interviewer, They're scary motherf***ers to get involved with.? He was talking about the Saudis.",
    "On a golfer and a dictatorship; unleashing American energy; the meaning of conservatism; J.D.",
    "Bush the Elder used to say it when he was about to uncork a big serve, on the tennis court.",
    "Vance, for his part, responded,\nYour entire time in military leadership we won zero wars.",
    "He received three Purple Hearts, two Silver Stars, and two Distinguished Service Crosses.",
    "Oh, by the way, how much do you stand to gain financially from a war with Russia, Barry?",
    "If Schlapp doesn't want to call what they are doing at CPAC conservative,? fine with me.",
    "Not in a restaurant, not in a gym, not anywhere.?\nOkay, that's my Grumpy Old Man act.",
    "I hope he's president of the United States in another twelve years,? McCaffrey said.",
    "Mickelson's chief sin, it seems, is to have blurted out the truth about the Saudis.",
    "His longtime sponsor KPMG, the accounting giant, dropped him with special speed.",
    "Mickelson flirted with taking part in a new golf league, funded by the Saudis.",
    "I also have three opera reviews  of Don Carlos, Ariadne auf Naxos, and Tosca.",
    "In 2015, after the terror attacks in Paris, the chorus sang the Marseillaise.",
    "But I like the fact that he knows who the Saudis  who the Saudi rulers  are.",
    "McCarthy has endorsed the opponent of Liz Cheney in the Wyoming GOP primary.",
    " Speaking of Bannon: He told his listeners, Ukraine's not even a country.",
    "You know how the early morning is very still, very quiet, very peaceable?",
    "We'll see how long the current style and temper can remain in the saddle.",
    "We know they killed Khashoggi and have a horrible record on human rights.",
    "He is the head of the American Conservative Union, and the head of CPAC.",
    "Yet rock music, or pop music of some sort, was blaring out of speakers.",
    "Talk about being in bed with the Saudis: KPMG has three offices there.",
    "Before Don Carlos, the Met chorus sang the Ukrainian national anthem.",
    "In the lobby of Rock Center, there were very few people (naturally).",
    "So, obviously, he is not averse to trying to unseat his own members.",
    " I've been doing a fair amount of writing about Ukraine and Russia.",
    "It was a slogan of the anti-Communist Right in the early Cold War.",
    "He always has interesting things to say, and is a great interview.",
    "But, in fairness to me: I have felt this way since I was a child.",
    "As others pointed out, McCaffrey almost lost an arm in Vietnam.",
    "But we should not deny ourselves what we need in the meantime.",
    "You and I may not like Phil's tactics  his Machiavellian ways.",
    "And Your entire time in military leadership we won zero wars??",
    "He used this line, in a song, with wonderful, sly bawdiness.)",
    "Gonna unleash Chiang.? I say, today: Unleash American energy.",
    "Here is my New York chronicle? in the current New Criterion.",
    "Vance, Josh Mandel, and the others are campaigning to win.",
    "His comments are those of a stooge for Russian aggression.",
    "We need more energy self-sufficiency, and we need it now.",
    "All of these performances were at the Metropolitan Opera.",
    "But that might get him in trouble with the base?  right?",
    "Huey Long and Father Coughlin would grin in admiration.",
    "I was quite interested in what Matt Schlapp had to say.",
    "You may not like what he's thinking  but he's thinking.",
    "How much do you stand to gain financially from a war?",
    "But is it as effective now as it was even a week ago?",
    "Reason: I was giving commentary on a morning TV show.",
    "I also thought: Americans are terrified of quiet.",
    "Portman represents a GOP that is dead and buried.",
    "Very soon, we will leave fossil fuels behind us.",
    "He is also a very, very interesting personality.",
    "This was a pro-Putin, Hitler-friendly jamboree.",
    "I wrote about MTG and the conference last week.",
    "Have a good day and a good weekend, my friends.",
    "The footprint of the industry is ever smaller.",
    "Two of those kids who served were my children.",
    "Maybe Vance is too young to have heard of it.",
    "That discomforts everyone else in their bed.",
    "Don't let the hypocrites smother you, Phil.",
    "The oil-and-gas industry is ever cleaner.",
    "Would he endorse a GOP opponent of MTG's?",
    "Its methods are ever more ingenious.",
    "Two more are now serving  grandsons.",
    "Conferences (like cocktail parties).",
    "Unleash Chiang!? Remember that one?",
    "incongruous, I thought, and wrong.",
    "That is pure, 200-proof populism.",
    "It's almost all there: Fine wine.",
    "Les beaux esprits se rencontrent.",
    "This is unacceptable.? Oh, yeah?",
    "Past time,? as politicians say.",
    ".? (I have quoted Fats Waller.",
    "And that sounds right to me.",
    "There can be no quiet, ever.",
    "McCaffrey responded,\nWell.",
    "How to prove such a thing?",
    "But while we're waiting .",
    "Bannon reminds me of J.D.",
    "Sponsors are fleeing him.",
    "It is his seat that J.D.",
    "So says George F. Will.",
    "He is now in hot water.",
    "We are in transition.",
    "I really don't know.",
    "The guy's a thinker.",
    "I don't drink wine.",
    "Working-class kids.",
    "I'm talking 6:30.",
    "What's the deal?",
    "It was so .",
    "an impasse.",
    "I hope so.",
    "Later on.",
    "So .",
    "And.",
    "Why?",
    ".",
    ".",
    ".",
    ".",
    "."
  ]
}