{
  "id": 381,
  "mediaId": 195,
  "date": "3/3/2022 12:00:00 AM",
  "headline": "Thune on glide path to reelection a year after Trump's primary threats",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/thunejohn_021522gn_lead.jpg?itok=Pek15hIJ",
  "link": "https://thehill.com/homenews/campaign/596640-thune-on-glide-path-to-reelection-a-year-after-trumps-primary-threats",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod",
  "termIds": [
    1147,
    1248,
    1523,
    1765,
    1963,
    3094,
    428,
    2911,
    2976
  ],
  "sentences": [
    "I mean, in the Senate, it would ... go down like a shot dog,? Thune told reporters in December 2020. I just don't think it makes a lot of sense to put everybody through this when you know what the ultimate outcome is going to be.?\nTrump fired back in a tweet, calling Thune a Republican in name only? and a lapdog for Senate GOP Leader Mitch McConnell (Ky.).",
    "I long for the days when we voted in person with ID unless you have a valid reason for not being present.?\nStill, South Dakotans' relationship with Thune predates Trump, and the well of support he's maintained could offer a buffer to lingering grumbling from the former president's staunchest supporters.",
    "Thune unseated then-Senate Democratic Leader Tom Daschle in 2004, leading some to dub him a giant slayer,? and his ascension to leadership offers a sparsely populated state like South Dakota outsized sway in the Senate, making voters wary of replacing him with what would likely be a backbencher.",
    "And then I think on policy grounds, he is rightly seen as being a very solid conservative Republican very much in line with South Dakota voters.?\nThune has avoided stepping on that image by not insisting on criticizing Trump in the same manner as someone like Rep. Liz Cheney (R-Wyo.).",
    "We have provided an environment to make fraud possible,? said state Rep. Rhonda Milstead (R), who added that Thune would be hard to challenge.? Voting is a right as well as a privilege, but there is an obligation to be sure that right is acted upon responsibly.",
    "South Dakota Sen. John Thune (R) is facing only nominal GOP opposition to his reelection bid more than a year after drawing former President Trump's fury for rebuking objections to the results of the 2020 presidential election.",
    "He's just kind of moving on and working on what he's working on and being a senator.?\nTo be sure, Republicans maintain that Thune's standing after the 2020 dust-up is not a signal that Trump's influence is waning.",
    "But now, as the March 29 filing deadline for the Republican primary in South Dakota draws closer, that anger has not materialized into any serious roadblock to Thune's glide path to reelection.",
    "This is a small-town guy, very down to earth, travels around the state a lot, remembers everybody he's ever met, greets you by name, shakes your hand,? said the South Dakota strategist.",
    "Thune found himself in Trump's crosshairs in December 2020 as the then-president looked to gin up support for a last-ditch push for Congress to overturn the Electoral College results.",
    "If there was a Mount Rushmore of South Dakota politicians, he's going to be right there where George Washington is on our Granite Monument,? said state Sen. Casey Crabtree (R).",
    "As recently as mid-January, Tony Fabrizio, a pollster aligned with Trump, commissioned a survey for the American Potential Fund gauging Thune's support in a primary.",
    "While no major primary challenger has emerged and Trump's personal attention has drifted elsewhere, those in the former president's orbit appear to be keeping tabs.",
    "A spokesperson did not immediately respond to The Hill when asked if Trump had any plans to insert himself into the South Dakota race with an endorsement or rally.",
    "Republicans chalk up Thune's popularity to his advocacy on agriculture issues and constant presence in the state, where he recalls voters by name at local events.",
    "The backlash fueled speculation that Thune would choose to retire instead of run for a fourth term, though he ultimately launched his reelection bid in January.",
    "Trump, a month after his defeat, made Thune one of his public enemies, courting primary challengers to him and warning his political career would be over!!",
    "It's a long way to Washington, D.C., and I think that Sen. Thune has continued to stay connected to his home state,? the former GOP official said.",
    "I can't even give you a name in terms of who could get in this race and really give him a run for it on the Republican side.?\nThune, the No.",
    "Thune pushed back on the idea, insisting that such an effort would fail  which it ultimately did after an insurrection rocked the Capitol.",
    "Trump maintains broad loyalty from the GOP base, and some Republicans remain receptive to Trump's gripes on issues like voter fraud.",
    "His main opponent is Bruce Whalen, a former GOP House candidate, who has promoted the use of ivermectin to combat the coronavirus.",
    "I think that most South Dakota voters realize that that connection is stronger than their connection to Trump to some degree.",
    "That, combined with the absence of a major primary opponent, makes a victory in the June 7 primary a near certainty.",
    "!? for saying that efforts to object to the Electoral College vote would go down like a shot dog? in the Senate.",
    "Nothing is a given in politics, but he's on a good path,? one former South Dakota GOP official said.",
    "The strong footing Thune finds himself on now stands in contrast to where he was at the end of 2020.",
    "2 Republican in the Senate, is facing a handful of what the strategist called gadfly? candidates.",
    "It would take some pretty seismic shift? to unseat Thune, said one South Dakota GOP strategist.",
    "Yet even if Trump does get involved, Thune's standing could help rebuff any more criticism.",
    "Polling has been scarce in the race, but Thune boasts roughly $15 million in the bank.",
    "Rancher Mark Mowry and software executive Patrick Schubert are also running.",
    "They can support Sen. Thune and support President Trump at the same time.?",
    "Kristi Noem (R) to primary Thune, though she promptly shut down the idea.",
    "Building on that is the folk hero status from beating Tom Daschle.",
    "And that alienates a lot of people,? the GOP strategist said.",
    "RINO John Thune, Mitch's boy', should just let it play out.",
    "Cheney keeps talking about Trump and going after Trump.",
    "He will be primaried in 2022, political career over!!",
    "South Dakota doesn't like weakness,? he said.",
    "!?\nTrump also courted South Dakota Gov.",
    "He's not doing that."
  ]
}