{
  "id": 382,
  "mediaId": 195,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "The Memo: Boebert's antics blasted as another twist in politics' downward spiral",
  "image": "https://cdn.jwplayer.com/v2/media/ih0KFEIL/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/administration/596625-the-memo-boeberts-antics-blasted-as-another-twist-in-politics",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Niall Stanage",
  "authorUrl": "https://thehill.com/author/niall-stanage",
  "termIds": [
    1078,
    1090,
    1147,
    1154,
    1845,
    2087,
    2185,
    3094,
    138
  ],
  "sentences": [
    "Ask the families who lost their loved ones how interrupted their lives are now.?\nGreene's official Twitter account  her personal account has been permanently banned for repeated violations pertaining to COVID-19 misinformation  on Wednesday retweeted a video of herself calling for a revival of unity and faith? that would involve Americans putting aside the politics of race and division.?\nImmediately beneath that tweet was one impugning Biden's mental acuity.",
    "At another point during Biden's address Tuesday, Boebert and Rep. Marjorie Taylor Greene (R-Ga.), who has her own record of wild claims and deliberately provocative behavior, tried to start a chant of former President Trump's slogan Build the Wall!?\nDespite the backlash in the chamber and beyond, Boebert was  predictably  unwilling to back down on Wednesday.",
    "It's not because you are giving deference to the person, but because you are giving deference to the most important office in the most important democracy in the world.?\nBut the landscape that Gregg inhabited as a senator  first elected in 1992, he left office after the 2010 elections  has been fundamentally altered, as Tuesday night showed.",
    "GOP strategist Dan Judy told this column that bad behavior occurs on both sides, but I think it has been more concentrated on the Republican side since Donald Trump came on the scene, because incendiary rhetoric is his stock-in-trade.?\nJudy suggested the only real way to break the cycle was for such figures to suffer electoral consequences.",
    "Republican leadership was more forceful regarding Greene's and Gosar's appearances at the Fuentes-organized conference, with House Minority Leader Kevin McCarthy (R-Calif.) calling it unacceptable.? When McCarthy was asked about it a day later on camera, however, he declined to comment further.",
    "Olivia Troye, who served in the Trump administration but resigned in its final days and became a vigorous critic, said on Twitter Wednesday that figures like Boebert and Greene were extremist trash? who were embarrassing our country? with their actions during the State of the Union speech.",
    "Biden was talking about cancers suffered by American soldiers that ended up putting them in a flag-draped coffin? when Boebert yelled out, You put them in  13 of them.?\nThe allusion was to U.S. troops killed during the chaotic pullout from Afghanistan.",
    "In November, Gosar became the first member of the House in more than a decade to be formally censured after he tweeted an animated video in which a figure made to look like him killed a cartoon version of Rep. Alexandria Ocasio-Cortez (D-N.Y.).",
    "Rep. Lauren Boebert's (R-Colo.) heckling of President Biden during Tuesday's State of the Union address was the latest example of a political culture that has turned crude and cruel  and yet it probably won't do Boebert much harm at all.",
    "The intervention drew gasps for its general incivility  and because lawmakers and everyone else with an advance copy of Biden's remarks knew that he would refer in the very next sentence to the death of his son.",
    "Greene's involvement in that event, also attended by yet another GOP firebrand, Rep. Paul Gosar (Ariz.), caused Sen. Mitt Romney (R-Utah) to lament I've got morons on my team? during a Sunday interview with CNN.",
    "But they clearly calculated these outbursts and they calculated for a reason  to get attention, to get on TV and to raise money.?\nIf past form is anything to go by, it's almost certain to work.",
    "and Adam Kinzinger (R-Ill.)  near-outcasts within the GOP caucus because of their forceful condemnations of former President Trump  joined Democrats in voting to censure Gosar.",
    "The late Beau Biden, who served in Iraq as a member of the Delaware Army National Guard and also served as attorney general of Delaware, died of brain cancer in 2015, age 46.",
    "They enjoy prodigious fundraising, large social media followings and a peculiar brand of fame  even as their behavior earns eyerolls from many of their colleagues.",
    "Greene's purported desire to transcend racial divisions did not prevent her from recently speaking at a conference organized by white nationalist Nick Fuentes.",
    "Rep. Maxine Waters (D-Calif.) the previous year called on members of the public to harass members of Trump's then-Cabinet if they saw them out in public.",
    "What happened last night is beyond inexcusable,? former Sen. Judd Gregg (R-N.H.) told this column on Wednesday, referring to Boebert's antics.",
    "The left is pissed because I called out Biden's botched withdrawal from Afghanistan that left 13 of America's finest in a flag-draped coffin.",
    "Greene, who is in her first term, had raised almost $7.5 million for her reelection race by the end of last year, according to OpenSecrets.",
    "But the behavior is hardly unusual for the Coloradan, who has previously targeted Rep. Ilhan Omar (D-Minn.) with Islamophobic remarks.",
    "Figures like Boebert have learned how to thrive in a media and political ecosystem that often rewards the most belligerent voices.",
    "Still, even some Republicans note that the destructive flames seem to burn with more intensity on their side.",
    "First off, you owe the president of the United States deference whether you agree with him  or her  or not.",
    "Gregg, the former senator, said he saw the beginnings of the slide into incivility before he left Congress.",
    "His father, the president, did not react to Boebert's interruption during Tuesday's State of the Union.",
    "Morons or not, there is a market for the scorched-earth approach favored by Boebert, Gosar and Greene.",
    "It's really a shame that you have people like Lauren Boebert and Marjorie Taylor Greene who are fools.",
    "There is also the question of how GOP colleagues grapple or enable this type of behavior.",
    "Meanwhile, some people who witnessed a different era on Capitol Hill look on with horror.",
    "He cited the ferocity of Democratic attacks on former President George W. Bush.",
    "Democrats, to be sure, have exhibited some questionable behavior of their own.",
    "But, for now, the main emotion among more moderate figures is frustration.",
    "They are mad because a speech was interrupted,'? she tweeted.",
    "Omar apologized in 2019 for earlier antisemitic tweets.",
    "He noted Greene faces a primary challenge this cycle.",
    "The Memo is a reported column by Niall Stanage.",
    "Just two Republicans, Reps. Liz Cheney (R-Wyo.)",
    "Boebert has almost 900,000 Twitter followers.",
    "They're fools,? Judy said."
  ]
}