{
  "id": 383,
  "mediaId": 120,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "Pressed for answers on two radical GOP members, McCarthy hedges",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220302-MB-McCarthy-Hedges-jg-1f3d10.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pressed-answers-two-radical-gop-members-mccarthy-hedges-rcna18298",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.nbcnews.com/author/steve-benen-ncpn433601",
  "termIds": [
    1090,
    1106,
    1609,
    3094,
    428,
    600,
    2550,
    2672
  ],
  "sentences": [
    "At one point during Tuesday's press conference, McCarthy seemed to suggest he could comment on his extremist members, but he won't because there's a war in Europe.?\nTo briefly recap, the minority leader and the rest of the House GOP leadership team have options.",
    "The party could also announce that it will not support the members' re-election campaigns  akin to what the party has already done to Liz Cheney and Adam Kinzinger, because of their efforts to help lead the investigation into the Jan. 6 attack.",
    "When McCarthy was also asked yesterday whether he's prepared to endorse primary challenges to Gosar and Greene, after having endorsed Rep. Liz Cheney's rival in Wyoming, the minority leader again referenced what he said a day earlier.",
    "The party should not be associated any time, any place with somebody who is anti-Semitic.?\nBut he didn't say what would become of Greene and Gosar, or what kind of consequences, if any, the pair might face from their party.",
    "HuffPost reported:\nHouse Republican leader Kevin McCarthy (R-Calif.) wouldn't say Tuesday whether party members who participated in a white nationalist event over the weekend would face any repercussions....",
    "House Minority Leader Kevin McCarthy said on Monday that their participation at the gathering was unacceptable.?\nThe hope was that the House GOP leader would then move forward with some kind of action.",
    "This, among other offenses, led the Republican-controlled state Senate to formally censure Rogers yesterday  in a 24-to-3 vote  for unbecoming? conduct that has damaged the institution's reputation.",
    "McCarthy could even announce that he's changed his mind about what he said four months ago, and he will no longer support giving Greene and Gosar committee assignments in the next Congress.",
    "And then, of course, there's the U.S. House, where two Republican members  Georgia's Marjorie Taylor Greene and Arizona's Paul Gosar  also appeared at the white nationalist event.",
    "What mattered about this year's America First Political Action Conference (AFPAC), however, is the fact that some Republican elected officials were on hand for the gathering.",
    "Janice McGeachin not only addressed the white nationalist event via video, she sought to align herself with the conference's attendees who support America First? ideas.",
    "In Arizona, Republican state Sen. Wendy Rogers, whose record in this area is indefensible, did not try to hide the fact that she attended the AFPAC event.",
    "Recommended\nHe certainly issued a statement on Monday, but it didn't say whether he'd back primary challenges to Greene and Gosar.",
    "McCarthy told CNN and Punchbowl News that it was appalling and wrong? for Gosar and Greene to attend the white nationalist event.",
    "Asked Tuesday if the pair could remain in the Republican conference, McCarthy referred to his previous statement.",
    "The fact that right-wing extremists gathered for a white nationalist event would not generate national headlines.",
    "Not surprisingly, McGeachin  who's also running a GOP gubernatorial race  is facing calls for her resignation.",
    "It's left GOP officials with a decision to make about what, if anything, they're prepared to do about it.",
    "As of yesterday, however, McCarthy wanted the questions to simply go away.",
    "The Californian also wasn't on camera on Monday, and yesterday, he was.",
    "McCarthy & Co. could kick Gosar and Greene out of the GOP conference.",
    "He added, There's no place in our party for any of this.",
    "I made my statement yesterday,? McCarthy added.",
    "In Idaho, meanwhile, Republican Lt. Gov.",
    "I answered that yesterday,? he said.",
    "So far, that hasn't happened.",
    "That's not quite right.",
    "That seems unlikely."
  ]
}