{
  "id": 384,
  "mediaId": 151,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "The establishment strikes back: 5 takeaways from the Texas primary",
  "image": "https://static.politico.com/55/4f/e8a9ed9545a6882859c381ad0232/ap22061170400074.jpg",
  "link": "https://www.politico.com/news/2022/03/02/texas-primary-election-results-takeaways-00013117",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2250,
    2250,
    2389,
    2389,
    984,
    984,
    1147,
    1154,
    1154,
    1147,
    1435,
    1435,
    182,
    182,
    2557,
    2557,
    2934,
    2934,
    2894,
    2894
  ],
  "sentences": [
    "From San Antonio to Austin, tonight's results show voters want elected officials who will take on corporate interests and deliver bold progressive policies for the American people,? Reps. Pramila Jayapal, Mark Pocan and Jamie Raskin, co-chairs of the Congressional Progressive Caucus PAC, said in a prepared statement.",
    "If they continue to add 2-4 per cycle, the Squad might match the New Dems' numbers in 45 years.?\nIncumbency still matters\nEarly last year, Texas conservatives were so furious about Greg Abbott's issuance of a statewide mask mandate it appeared the governor might draw a credible challenge from his right.",
    "And in perhaps the most telling race of all, in the contest to replace retiring Rep. Kevin Brady, Morgan Luttrell, the former Navy SEAL backed by the Congressional Leadership Fund, appeared likely to avoid a runoff against MAGA hardliners, including one supported by Rep. Marjorie Taylor Greene (R-Ga.).",
    "Sid Miller, a magnet for controversy whose re-election bid appeared far from certain, was winning his primary by a larger margin than he posted in either 2014 or 2018.\nBig night in Texas!? Trump said in a prepared statement touting his endorsed candidates'  and his  success.",
    "In one of the most closely watched Democratic primaries in the country, Jessica Cisneros  with the backing of Sen. Bernie Sanders (I-Vt.) and Rep. Alexandria Ocasio-Cortez (D-N.Y.) dragged one of the most conservative House Democrats, Henry Cuellar, into a runoff.",
    "Cuellar*\ndem\n48.5%\n23,552\nCisneros\ndem\n46.8%\n22,745\nBenavides\ndem\n4.7%\n2,289\n99% of expected vote in\n*Incumbent\nFull election results\nIn the modern, pro-Donald Trump GOP, Bush, the Texas land commissioner, is a study in survival-by-adaptation.",
    "| Eric Gay/AP Photo\nBy David Siders\n 03/02/2022 09:55 AM EST\nEstablishment Republicans beat back MAGA hardliners in the Texas primary on Tuesday, while the Bush dynasty avoided extinction and progressive Democrats stopped their slide.",
    "Bush  the last Bush in office, the nephew of one president and the grandson of another  advanced with the help of a relatively large primary field, which helped keep Paxton below the 50 percent threshold necessary to avoid a runoff.",
    "Here are five takeaways from the primary in the nation's second-most populous state:\nThe establishment strikes back\nNo incumbent Republican was toppled in Texas, which was no small feat in a primary where there was so much unrest.",
    "Three years earlier, Trump wrote that we need another Bush in office about as much as we need Obama to have a 3rd term.?\nTrump bolsters his batting average\nTrump has made some miscalculations heading into the midterms.",
    "Rep. Van Taylor, who has been pilloried by pro-Trump Republicans for his vote for a commission to investigate the Jan. 6 attack on the Capitol, was forced into a May runoff with former Collin County Judge Keith Self.",
    "And the true measure of Trump's influence on the Republican primaries won't come until more prominent politicians he's marked for extinction come up in other states  people like Rep. Liz Cheney in Wyoming and Gov.",
    "Two traditionalist House Republicans  Kay Granger, the top Republican on the House Appropriations Committee, and Pete Sessions, the former National Republican Congressional Committee chair  both cruised.",
    "With the nation's focus squarely on Russia's invasion of Ukraine and on President Joe Biden's State of the Union address, the first primary of the midterm election year turned out to be unusually muted.",
    "Abbott is favored to beat Beto O'Rourke, the Democratic nominee, in November; the governor was up 7 percentage points over O'Rourke in a recent Dallas Morning News-University of Texas at Tyler poll.",
    "Bush, speaking to reporters on election night, called Paxton arguably the most corrupt official in Texas modern history.?\nTexas' 28th District (Dem primary)\nRace goes to runoff\nCandidate\nPct.",
    "But with George P. Bush pressing Ken Paxton to a runoff in the Texas attorney general's race, one of the most storied lineages in modern Republican politics will hang on at least until May.",
    "The hope of Abbott's challengers was never to beat Abbott outright in the primary, but to force him into a runoff, where they could expect a smaller  and more conservative  turnout in May.",
    "But Allen West, the firebrand former congressman from Florida and former chair of the Texas Republican Party, and Don Huffines, a former state senator, never made a dent in the race.",
    "For the nearly half-dozen other Republican governors who are facing competitive primary challenges this year  from Ohio to Alabama and Georgia  that result may bring some comfort.",
    "Even George P. Bush, the scion of the Bush dynasty, forced his way into a runoff against Ken Paxton, the scandal-ridden, Donald Trump-endorsed state attorney general.",
    "It's easier for a Republican to shore up his right flank when he can sign bills on critical race theory and guns, as Abbott did, or start building a border wall.",
    "But it is Paxton  not Bush  who has Trump's endorsement, after the state attorney general led a failed legal effort to overturn the results of the 2020 election.",
    "Trump's endorsement is still the most sought-after commodity in Republican primaries, and the race for Texas agriculture commissioner was a prime example why.",
    "Trump came in for 16 House incumbents and two candidates in open seats  most of them frontrunners, including several candidates running unopposed.",
    "In an email, Matt Bennett of the center-left group Third Way, said, The moderate New Democrat Coalition has 97 House members; the Squad has 6.",
    "In the attorney general's race, Ken Paxton, Trump's endorsed candidate, failed to clear the 50 percent threshold necessary to avoid a runoff.",
    "In a Republican Party that has increasingly bent to its far right, the Texas primary on Tuesday marked a rare victory for the establishment.",
    "Late last year, Pennsylvania Republican Sean Parnell, Trump's favored candidate in that state's Senate race, suspended his campaign.",
    "But Rep. Dan Crenshaw, who had come under criticism for his comments about grifters? on the right, comfortably won his primary.",
    "The incumbent walloped his primary opponents on Tuesday, easily clearing the 50 percent threshold necessary to avoid a runoff.",
    "Greg Abbott, with his wife Cecilia and daughter Audrey, attends a primary election night event on Tuesday in Corpus Christi.",
    "The scandal-plagued attorney general, though denying wrongdoing, is laboring under a criminal indictment and an FBI probe.",
    "Elsewhere in Texas, Greg Casar, an Austin City Council member and rising star on the left, easily won his House primary.",
    "Progressives stop their slide\nProgressive Democrats, after a string of losses in 2021, found their footing on Tuesday.",
    "In Alabama, Rep. Mo Brooks, Trump's endorsed candidate for Senate, has been a fundraising and polling disappointment.",
    "It would be a mistake to read too much into Trump's performance in Texas, where most of his picks were safe.",
    "And there were no major surprises in the initial glimpse into the electorate's leanings in a critical year.",
    "The question for Abbott now is if he turned too far to the right to render him vulnerable in November.",
    "Jeb Bush split with much of his family to endorse Trump, a near-prerequisite for a Texas Republican.",
    "He followed up Wednesday with another statement touting the success of his slate of endorsements.",
    "The Bush dynasty hangs on\nTuesday could have spelled the end for the fading Bush dynasty.",
    "And there's no indication Trump will grieve the end of the Bush era if Paxton prevails.",
    "But Abbott really won this race months ago, on the power of something else: incumbency.",
    "Cuellar was damaged goods, after the FBI raided his home and office earlier this year.",
    "Greg Abbott won his primary easily, despite early  and loud  noise from his right.",
    "I like him,? Bush put the quote on beer koozies and gave them to his supporters.",
    "And the liberal Austin district Casar won is not exactly a bellwether.",
    "When the former president said, This is the only Bush that likes me.",
    "So might the fact that no incumbent Republican was toppled Tuesday.",
    "On Tuesday, all had won their races or were leading, as were Gov.",
    "In January, Abbott was running ahead of O'Rourke by 11 points.",
    "Trump pummeled Jeb Bush in the 2016 presidential primary.",
    "Dan Patrick, and a raft of down-ballot candidates.",
    "Ximena Bustillo contributed to this report.",
    "Incumbents, for the most part, did well.",
    "Trump's endorsement undoubtedly helped.",
    "Still, the race has tightened recently.",
    "But in Texas it was a different story.",
    "But that may be overstating the case.",
    "This is the Bush that got it right.",
    "Probably not, in deep red Texas.",
    "The son of former Florida Gov.",
    "It was not a clean sweep.",
    "Greg Abbott and Lt. Gov.",
    "Brian Kemp in Georgia.",
    "It never materialized.",
    "Texas Gov.",
    "Gov."
  ]
}