{
  "id": 385,
  "mediaId": 323,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "Nancy Mace Tries to Survive Criticizing Trump",
  "image": "https://images.wsj.net/im-491192?width=700&size=1&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/nancy-mace-tries-to-survive-criticizing-trump-11646229601",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1064,
    1147,
    1563,
    2087,
    2117,
    3094,
    428,
    505,
    2601,
    2910,
    2976
  ],
  "sentences": [
    "Voters are more attuned to climate change and the effect of climate change than you might get in the typical Republican district,? said Gibbs Knotts, a professor of political science at the College of Charleston, citing frequent flooding of the area and the desire to keep beaches clean.",
    "This district does not want someone who is going to toe the party line; they respect an independent streak.?\n  Rep. Nancy Mace\nIt's not your traditional Republican meat-and-potatoes sort of district,? said Ms. Mace, who still has large Trump campaign signs in her garage.",
    "Loyalty to Mr. Trump is expected to play a big role in other races in the midterms, in which Republicans are hoping to regain control of Congress, and could signal how big a role his brand of conservatism will play in party politics as he mulls another presidential run.",
    "Ms. Mace, who dropped out of high school and later earned her diploma while working at Waffle House before heading to the Citadel, said the Constitution dictated her vote to certify the 2020 election, even as 139 House Republicans voted to reject Mr. Biden's win.",
    "Ms. Dixon, a mom of four living in Charleston, also wants Ms. Mace to be more aggressive in pushing for parents to have more control over their children's schooling, including on coronavirus-related rules and what students are taught about U.S. history and race.",
    "Dr. Andrews said the fighting between Ms. Mace and Ms. Arrington will just pull them both further right while she can focus on talking about issues she believes are important to voters, such as the need to support infrastructure spending.",
    "Ms. Mace opposed the bipartisan bill Mr. Biden signed into law, saying too little of the funds focused on what she called true infrastructure and that it wasn't truly bipartisan because House Republicans didn't shape the bill.",
    "This district does not want someone who is going to toe the party line; they respect an independent streak.?\nIn the year since, Ms. Mace has voted consistently with her party and has praised the former president's policies.",
    "Just days into office, the first female graduate of the Citadel military academy voted to certify President Biden's presidential win and said Mr. Trump was to blame when a mob of his supporters overran the Capitol.",
    "Ms. Arrington, who joined the Trump administration after losing the 2018 race, said Ms. Mace shouldn't have certified the 2020 results, and that she shouldn't have blamed Mr. Trump for the Jan. 6 riot.",
    "Ms. Mace narrowly won this coastal district from a Democrat in 2020 with promises to back Mr. Trump's agenda, but she also pledged to break with Republicans when it made sense for her constituents.",
    "Ms. Arrington, who was endorsed by Mr. Trump, argues that Ms. Mace has miscalculated what the district wants and it is time to install someone who is more closely aligned with the former president.",
    "Once taking office, the first thing she did was do an about-face on supporting Trump,? said Christi Dixon, 53, who voted for Ms. Mace in 2020 and plans to back Ms. Arrington this time.",
    "Still, he thinks it is reasonable for Ms. Mace to criticize the former president because he believes Mr. Trump had a lot to do with? the Jan. 6 riot for the rhetoric he used that day.",
    "Ms. Arrington said Ms. Mace has prioritized bills to decriminalize marijuana and stop U.S.-born pandas from being sent back to China over issues such as inflation or border security.",
    "They're clamoring over each other for Trump's approval, not talking about the issues that people in the district are facing, and people are going to see that,? said Dr. Andrews.",
    "In Wyoming, Washington, Michigan and elsewhere, Republicans who broke with the former president are now being challenged by his supporters and targeted personally by Mr. Trump.",
    "Still, to hang onto her seat, she must overcome a primary challenge from several candidates including Katie Arrington, the GOP nominee from 2018 who is running again.",
    "She then lost the general election to Democrat Joe Cunningham by just under 4,000 votes, the first time the seat had flipped to a Democrat in nearly four decades.",
    "After Mr. Trump endorsed Ms. Arrington, Ms. Mace filmed a video in front of Trump Tower to remind voters that she had supported him during both of his campaigns.",
    "Ms. Mace then won it back for the GOP two years later by roughly 5,500 votes, and she argues that anyone but her could lose it in this year's general election.",
    "In South Carolina's 7th Congressional District, Rep. Tom Rice is facing a crowded field of primary opponents, including one who has the backing of Mr. Trump.",
    "Ms. Mace, for her part, has called on the U.S. to produce more oil and loosen regulations on energy production so Europe will be less reliant on Russia.",
    "But unlike Ms. Mace, most of them voted to impeach the former president and some including Rep. Liz Cheney of Wyoming have continued to criticize him.",
    "But she has also taken up causes that could pull Democratic support, including leading efforts to decriminalize marijuana and protect animal rights.",
    "CHARLESTON, S.C.Freshman Rep. Nancy Mace says Republican voters appreciate lawmakers who don't march in lockstep with former President Donald Trump.",
    "A poll of GOP primary voters published by the South Carolina newspaper The State last month found Ms. Mace had an early lead over Ms. Arrington.",
    "Nikki Haley, the state's former governor who served as U.S. ambassador to the United Nations in the Trump administration, has endorsed Ms. Mace.",
    "Minority Leader Kevin McCarthy (R., Calif.) endorsed Ms. Mace in her last primary and Ms. Mace said she expects he will do the same this year.",
    "Octavia Walker, a 40-something personal coach from Charleston who has voted for both parties, is unhappy with Ms. Mace's record in Congress.",
    "She met with officials at the Charleston Aquarium about efforts to attract NASA to create an environment resilience center on the peninsula.",
    "The challenger has also said Ms. Mace is partly to blame for Russia's invasion of Ukraine because she certified Mr. Biden's win.",
    "SHARE YOUR THOUGHTS\nDo you think South Carolina's primary results will be predictive of other midterm outcomes for Republicans?",
    "Katie Arrington, one of the GOP candidates challenging Rep. Mace, says her district needs someone more loyal to Mr. Trump.",
    "Ms. Mace said she has received threats from the far-right and far-left, which she sees as a sign she is doing her job.",
    "Those threats also prompted her to get her license to carry a concealed weapon and she regularly practices shooting.",
    "She said at the time Mr. Trump's actions on Jan. 6 wiped out? his legacy and called for the party to be rebuilt.",
    "In Charleston last month, Ms. Mace visited a bird sanctuary she backed that doubles as a barrier from flooding.",
    "Luke Schuyler, a 67-year-old merchandiser from West Ashley, said he voted for Mr. Trump and would do it again.",
    "In the 2018 primary, Ms. Arrington had a surprise victory over then-Rep. Mark Sanford, a critic of Mr. Trump.",
    "She later joined with most of her party in voting against a bipartisan commission to investigate Jan. 6.",
    "The primary is in June and the winner will have to clear a 50% threshold or be forced into a runoff.",
    "Ms. Mace responded that all of those issues are on her radar but some get more media attention.",
    "The former president will be in the state later this month to rally support for his candidates.",
    "The lawmaker speaks with staff during a tour of a distilling company in North Charleston, S.C.",
    "Our bridges need to be fixed here in Charleston, our infrastructure, our roads,? she said.",
    "The GOP nominee is then expected to go up against Democrat Annie Andrews, a pediatrician.",
    "Why can't we call someone out who you like wrong?? he said, adding he will back Ms. Mace.",
    "But she also opposed impeaching him because she said the effort denied him due process.",
    "She said Russian President Vladimir Putin is emboldened when Democrats are in office.",
    "Representatives for Mr. McCarthy didn't immediately respond to a request for comment.",
    "Rep. Mace works with staff member John Seibels as her dog Libby roams her office.",
    "She said the congresswoman's vote against the infrastructure bill bothers her.",
    "A scorecard from the conservative Heritage Action For America has her at 96%.",
    "She really thought President Trump wasn't going to be the heart of the GOP.",
    "While she never says if she still backs Mr. Trump, she praises his record.",
    "No, that is not what we sent her to Washington for,? said Ms. Arrington.",
    "It's not your traditional Republican meat-and-potatoes sort of district.",
    "Whoever wins the primary could then face a tight general election.",
    "In office, Ms. Mace votes with the GOP majority most of the time.",
    "She also opposes oil drilling off the coast of South Carolina.",
    "Copyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "He cast them as fiscally conservative but socially moderate.",
    "Rep. Mace visits a Waffle House in North Charleston, S.C.",
    "Ms. Haley is considering running for president in 2024.",
    "Ms. Mace said she would support whoever the nominee is.",
    "Rep. Mace wins a shooting competition with her staff.",
    "Write to Eliza Collins at eliza.collins+1@wsj.com.",
    "The lawmaker once worked at the restaurant chain.",
    "A tough primary this June will test her approach.",
    "She thought she was going to be it.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Join the conversation below.",
    "Others see a contradiction.",
    "He was wrong."
  ]
}