{
  "id": 393,
  "mediaId": 409,
  "date": "2/28/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene's Justification for Appearing at a White-Nationalist Conference Is Preposterous",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/02/marjorie-taylor-greene-1.jpg?w=1592",
  "link": "https://www.nationalreview.com/2022/02/marjorie-taylor-greenes-justification-for-appearing-at-a-white-nationalist-conference-is-preposterous/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John McCormack",
  "authorUrl": "https://www.nationalreview.com/author/john-mccormack/",
  "termIds": [
    1248,
    1258,
    1351,
    1609,
    1807,
    3094,
    426,
    545,
    2672
  ],
  "sentences": [
    "We removed Steve King when he made comments [about white nationalism] as a member of Congress.?\nThe Republican Jewish Coalition, former secretary of state Mike Pompeo, Utah senator Mitt Romney, and Senate minority leader Mitch McConnell have all roundly condemned Greene and Arizona GOP congressman Paul Gosar, who addressed Fuentes's group via video, for speaking at AFPAC.",
    "When the House GOP conference previously decided not to strip her of her committee assignments over those comments  as it had done to former Iowa congressman Steve King over his seemingly sympathetic comments about white nationalism  Minority Leader Kevin McCarthy indicated that she'd only been spared because the comments were made before she was elected.",
    "Of course, there is an enormous moral difference between speaking at a white-nationalist convention as a member of Congress  an act that lends the gravitas of elected office to vile bigotry  and believing that people have a legal right to vile speech or even that social-media companies shouldn't ban openly racist accounts.",
    "Accusations of bigotry are often casually and unfairly hurled about by the media and the Left, but Nick Fuentes, the organizer of the America First Political Action Conference (AFPAC) that Greene addressed, is an open and unapologetic racist and antisemite.",
    "I won't cancel others in the conservative movement, even if I find some of their statements tasteless, misguided or even repulsive at times.?\nGreene has found herself in hot water for promoting conspiracy theories and vile speech in the past.",
    "On Monday night, McCarthy called Greene's appearance appalling? and wrong,? but thus far he's stopped short of committing to any kind of concrete punishment for her, promising only that he'll meet with her and express his disappointment.",
    "Earlier this month, McCarthy endorsed the GOP primary challenger to Wyoming representative Liz Cheney because of Cheney's role in serving on the committee investigating the January 6 attack on the Capitol.",
    "A McCarthy campaign aide has not yet responded to an inquiry from National Review on Monday evening asking whether McCarthy will be endorsing Greene's primary challenger.",
    "When Greene spoke to Fuentes's conference on Friday, she told attendees that the very reason she'd decided to do so was because you know what it's like to be canceled.",
    "Now that you're a member of Congress, now it's the responsibility of our conference to hold people accountable,? McCarthy said at a press conference last February.",
    "It's better for them; it's better for us.? In another video, he joyfully promoted grotesque claims denying that millions of Jews were murdered in the Holocaust.",
    "After Greene drew flak for speaking at Fuentes's white-nationalist conference, she told CBS News's Robert Costa on Saturday that I do not know Nick Fuentes.",
    "Fuentes once called a writer a race traitor? because he work[s] for Jews.? He opposes interracial marriage and has praised segregation.",
    "That's why I'm here to talk to you tonight: I don't believe anyone should be canceled.? She had to have known what she was doing.",
    "epresentative Marjorie Taylor Greene, a freshman Republican from Georgia, spoke at a conference of white nationalists on Friday.",
    "I won't abandon these young men and women, because I believe we need to do better by them,? Greene wrote later on Twitter.",
    "I don't know what his views are.?\nBut that answer was transparently preposterous.",
    "Whether she'll face any real consequences for it is another question entirely.",
    "Oh, they had to drink out of a different water fountain, big f***ing deal.",
    "Oh no, they had to go to a different school,? he said in one video.",
    "McCarthy has condemned Greene as well.",
    "Enough with the Jim Crow stuff.",
    "I've never seen him speak.",
    "I've never seen a video.",
    "Who cares?"
  ]
}