{
  "id": 394,
  "mediaId": 124,
  "date": "2/28/2022 12:00:00 AM",
  "headline": "Texas primaries will be the first 2022 test of Trump's endorsement power",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_09/3537628/220228-ken-paxton-al-0754.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/texas-primaries-will-be-first-2022-test-trump-s-endorsement-n1290184",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2087,
    2263,
    2263,
    2347,
    2347,
    1147,
    1147,
    428,
    428,
    2934,
    2942,
    2942,
    2934,
    2959,
    2959
  ],
  "sentences": [
    "A Times review of election data found that officials in the most populous counties have rejected roughly 30 percent of the absentee ballots they have received  more than 15,000 ballots.?\nThe Texas contests also present an opportunity for the liberal wing of the Democratic party to grow its ranks in Congress, Politico reports.",
    "And whether Monica De La Cruz, who is backed by Trump as well as key members of GOP leadership despite accusations stemming from her divorce that she mistreated her stepdaughter (which she denies), can become the party's nominee in the key 15th Congressional District.",
    "Other numbers you need to know today:\n141: The number of people interviewed by the Miami Herald and El Nuevo Herald in two heavily Hispanic areas around Miami whose party affiliation was changed without their consent, the latest evidence in a growing scandal.",
    "pic.twitter.com/YrqK8gNBuV\n Meet the Press (@MeetThePress) February 28, 2022\nEarly voting in Texas ended Friday, and NBC's Gary Grumbach reports from Houston that less than 10 percent of voters in Harris County have cast their ballots early.",
    "National Republican Senatorial Committee Chairman Rick Scott, R-Fla., another potential presidential contender, told Hillyard at CPAC that he does not plan to challenge Sen. Mitch McConnell for GOP leader.",
    "Congressman Jake Ellzey, R-Texas, who beat the Trump-backed Susan Wright in last year's special election following the death of her husband, Rep. Ron Wright, is running with Trump's endorsement in March.",
    "High-profile progressives and outside groups are focused on a trio of House candidates: Jessica Cisneros in the 28th District, Jasmine Crockett in the 30th District and Greg Casar in the 35th District.",
    "But first: As the first primary state on the midterm calendar, Texas tomorrow is going to provide the first test for a number of major storylines for both parties we'll be following through November.",
    "66 percent: The share of likely midterm voters who disapprove of President Biden's immigration policy, per a new poll by an advocacy group that used the firm founded by Biden's top pollster.",
    "Scott isn't up for re-election in Florida this year, leading to questions about the timing of the release of this 11-point plan, including speculation that he has presidential aspirations.",
    "Still, there are a few races we're keeping a close eye on tomorrow, including:\nWhether embattled incumbent Attorney General Ken Paxton can survive a crowded primary (and avoid a runoff).",
    "19: The percentage point edge that the Republican Party has over the Democrats with U.S. adults in the new ABC News/Washington Post poll over who's trusted more to handle the economy.",
    "The Republican Party spent years re-organizing itself in its image, making him the central piece of its fundraising apparatus and making support for him an unofficial litmus test.",
    "And while we're on the topic, here's an update on the census of Trump's endorsements so far this cycle:\n118 endorsements (including 55 House, 15 Senate, 13 governor).",
    "33 percent: The share in that same poll who said they approved of Biden's handling of the situation in Ukraine, compared to 47 percent who said they did not.",
    "Though Scott is the chair of the NRSC, the plan was released by Scott in his capacity as an individual senator, without support from other party leaders.",
    "That's the share of the unscientific Conservative Political Action Conference (CPAC) straw poll that former President Donald Trump won over the weekend.",
    "1,150: About the number of Nevadans who abandoned their political parties to become independents in the last month, according to The Las Vegas Sun.",
    "One of those storylines is former President Donald Trump's hold on the GOP, and whether Republican primary voters will heed his stamp of approval.",
    "Sen. Rick Scott, R-Fla., released an 11-point plan last weekto rescue America,? outlining his policy prescription for Republicans moving forward.",
    "New York City is poised to end its vaccine mandates for many indoor businesses and events next week, assuming case numbers continue to decline.",
    "In North Carolina, state Sen. Jeff Jackson, who dropped out of the Democratic Senate primary in December, announced he's running for Congress.",
    "Get to know Judge Ketanji Brown Jackson, Biden's Supreme Court nominee\nThe fence is back around the Capitol ahead of the State of the Union.",
    "It's a sign of how Trump, who teased another run for the White House in his speech at CPAC, still dominates the minds of the activist base.",
    "All three are still are the favorites  perhaps one reason why a former president so fixated on his win-loss record has jumped on board.",
    "NBC's Vaughn Hillyard reports that the annual gathering attracted 2024 hopefuls, but they're waiting on Trump to decide his next move.",
    "NBC's Peter Nicholas and Allan Smith look at how her national profile has grown even as her re-election prospects remain in doubt.",
    "Texas primary election just days away\nFeb. 26, 202202:17\nTrump has endorsed 32 Texas candidates, more than in any other state.",
    "We've put together a plan to rescue America after Republicans win this year, but official Washington won't like this plan.",
    "And after teasing a potential statewide run, GOP Rep. Dan Bishop announced he's running in the newly drawn 8th District.",
    "But their complicated situations make for a bit of a risk, one that raises the stakes for Trump's endorsement calculus.",
    "This weekend, Scott was up on the airwaves in several major cities, outlining his plan and promoting it to the masses.",
    "Ron DeSantis and his 28 percentage points, with former Secretary of State Mike Pompeo in third with just 2 percent.",
    "But even among the friendly audience, 4 in 10 wanted to see a different person win the party's 2024 nomination.",
    "Our borders are being invaded, inflation is raging and our shelves are empty,? Scott says as the ad opens.",
    "Thousands of absentee ballots have also been rejected thanks to the new law, The New York Times reports.",
    "One note of good news for any GOP candidate that doesn't win Trump's backing: He can change his mind.",
    "NBC News profiles the Wisconsin gubernatorial race, expected to be one of the tightest on the map.",
    "Recorded remarks from Rep. Liz Cheney, R-Wyo., aired at a dueling Principles First? event.",
    "Four percentage points higher than his showing last year, he finished ahead of Fla. Gov.",
    "WASHINGTON  If it's Monday ... Ukraine pushes for ceasefire at talks with Russia.",
    "WATCH: Richard Engel reports on Ukrainian resistance from the outskirts of Kiev.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "... And the State of the Union and the Texas primaries are just one day away.",
    "... Senate begins process to confirm Ketanji Brown Jackson to Supreme Court.",
    "Voting advocates said the state's new voting law may have dampened turnout.",
    "But you will,? he added, before directing viewers to read his plan online.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "And at least 76 with history of questioning the 2020 election results.",
    "Ditto Agriculture Commissioner Sid Miller, who faces his own primary.",
    "... President Biden holds secure call with allies to discuss the war.",
    "... Russian ruble nosedives as central bank doubles interest rates.",
    "... Sen. Rick Scott, R-Fla., touts his 11-point plan in new TV ad.",
    "@RichardEngel: Russian troops \"haven't captured the capital.",
    "They haven't captured even other smaller, major cities.\"",
    "Great nations don't automatically last forever.",
    "And most of them  23  happen to be incumbents.",
    "16 challenging sitting GOP incumbents.",
    "CPAC wrapped up over the weekend.",
    "#MTP #IfItsSunday\n.",
    "91 men, 27 women."
  ]
}