{
  "id": 401,
  "mediaId": 238,
  "date": "2/26/2022 12:00:00 AM",
  "headline": "A MAGA gala, a far-right rally, and a plea for Jan. 6 justice: Trio of summits tests GOP's future",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/02/26/cpac-trump-republicans/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1053,
    1807,
    3094,
    128,
    428,
    2851
  ],
  "sentences": [
    "The intensifying war in Ukraine was not a major focus of speeches or panel discussions, which were planned before the Russian invasion and had titles such as Woke, Inc.? and The Moron in Chief? and Fire Fauci.?\nSen. Rick Scott (R-Fla.), charged with overseeing the party's plans to retake the Senate, said the country was most threatened by the militant left wing,? which he labeled the enemy within.?\nSigns of the enduring influence of Trump's personal brand were everywhere.",
    "Those policies, he said, came down to freedom.?\nDan Schneider, executive director of the American Conservative Union, which hosts the conference, said in a text message, Trump's appeal to conservatives was a response to the desperation we felt as we witnessed the radicalized leadership of the Democrat party making the country unrecognizable to Americans.?\nAs CPAC positioned itself against the left, a challenge from the right was mounted at a hotel across town.",
    "He went further than ridicule, suggesting that a Republican congressional candidate belongs in an electric chair.? He asked why Anthony S. Fauci, the nation's leading infectious-disease expert, who was made into a villain at CPAC, too, was not hanging from a noose.? The question prompted cries of, Hang him up.?\nWhite supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party,? she said.",
    "Take the C.A.L.M? approach, the booklet said, focusing on community? and listening.?\nDiscussions on the agenda included Should We Stay or Should We Go: The Practical Politics of Principle? and Defending Democracy: Principles of Protecting Elections.? Biden was not the focus, according to presentations heard by a Washington Post reporter, and the president's name was not mentioned in the detailed schedule and agenda of the event.",
    "A dueling conference was staged by Nicholas Fuentes, a 23-year-old far-right organizer and online provocateur who has promised a tidal wave of white identity.? He stormed a CPAC event last year in Dallas, shouting America first? and white boy summer.? His contention, which has found some purchase among activists, is that CPAC, first held in 1974 with a keynote from Ronald Reagan, is too moderate.",
    "Mayo said the conference had drawn disgruntled Republicans and independents frustrated with CPAC who believe in reality, the Constitution and the rule of law.? Organizers distributed an 11-page Truth Advocates Handbook? that encouraged people to eat your veggies? by reading reliable news,? to battle conspiracy theories and to engage respectfully with family members who believe in disinformation.",
    "General admission cost about $300, while premium tickets went for upward of $7,000, offering access not just to speeches in the 95,000-foot ballroom festooned with CPAC insignia but also private audiences with speakers and a VIP ticket to the America UnCanceled Town Hall Dinner, among other benefits.",
    "The enthusiasm for Trump, even though he currently holds no office and is running no specific campaign, shows the way the party has been going for a long time,? said former congressman Douglas A. Collins, a Georgia Republican who mounted an unsuccessful primary campaign for Senate in 2020.",
    "The conference's closing attraction Sunday planned to feature the former president's eldest son, Donald Trump Jr., whose fiancee, Kimberly Guilfoyle, also spoke, hinting at Trump returning to the Oval Office.?\nA life-size cutout of the former president showed him wielding a machine gun.",
    "The main attractions on Saturday were Rep. Liz Cheney, the Wyoming Republican and fierce Trump critic recently removed from GOP House leadership, and Brad Raffensperger, the Republican secretary of state of Georgia who rebuffed Trump's claims of widespread voter fraud.",
    "Other crowd favorites included Olivia Troye, a former national security aide to former vice president Mike Pence who now appears frequently on MSNBC as a fierce Trump critic, and Bill Kristol, the columnist, who socialized outside the ballroom and was slated to speak.",
    "Denver Riggleman, a former Republican congressman from Virginia who is now working for the House committee investigating the Jan. 6 attack at the Capitol, drew guests to their feet by acknowledging Harry Dunn, a Capitol Police officer standing in the back of the room.",
    "He said he identifies as a conservative but opposes Trump, having supported Sen. Marco Rubio (R-Fla.) in 2016. The slow dissent away from ideas toward personalities  it doesn't really matter what you're saying  Can you entertain me?",
    "Clashing visions of the GOP's future were on offer this weekend as elected officials, candidates and activists convened at three different events to chart the party's path to the November midterms and the 2024 presidential campaign.",
    "Tim Fox, an anchor on Victory News, said CPAC was an opportunity to meet people and make connections necessary for the growth of his show, part of a Christian television network that debuted a news channel about a year ago.",
    "A keynote address from David Frum, the commentator and former speechwriter for George W. Bush, was scheduled for the same day with the title, The Future of Conservatism.?\nBut conservative media cast their lot with CPAC.",
    "The dominant news presence was Fox Nation, a streaming spinoff of the cable channel whose visibility at the conference  including a mammoth poster illuminated by floor lights  was not lost on attendees.",
    "In the shadows of the four-day festival, a destination for presidential aspirants to measure their appeal and road-test their messaging, far-right influencers gathered to denounce the GOP's mainstream.",
    "If I did, you'd be more shocked than you could imagine.?\nRep. Adam Kinzinger (R-Ill.), a Trump critic and member of the Jan. 6 committee who is not running for reelection, was slated to speak Sunday.",
    "But part of what motivated a two-day Principles First? conference in downtown Washington, D.C., was a perception among organizers that the two groups gathering in Orlando have too much in common.",
    "Leaflets left around the conference carried the heading: Please Help Defend Jan. 6 Defendants: They are Defending Your Freedoms.? Below were directions for donating to a crowdfunding campaign.",
    "ORLANDO  At a conservative conference that drew thousands to this city known for mouse ears and amusement rides, a top Republican in the Senate on Saturday labeled the left a domestic enemy.",
    "Are we going to own the libs?'?\nAt the anti-CPAC, vaccine cards were required to enter, temperatures were taken by a computer outside the check-in area and everyone in the room wore a mask.",
    "Some cast it as a sign that the network had internalized criticism from Trump, who inveighed against Fox for not being supportive enough of his reelection campaign, and was making amends.",
    "Right-wing commentator Stew Peters took the stage to decry what he called useless own-the-libs conservatism? dominant at CPAC, where he said speakers were satisfied to ridicule the left.",
    "It's all volunteers.?\nNone of the major television networks seemed to be in attendance, and no prominent would-be 2024 candidates, members of Congress or governors were in the room.",
    "A crowd of outlets arranged outside the hotel's main ballroom offered live interviews and commentary, as speakers brought memes from right-wing message boards to the main stage.",
    "At CPAC, some of those under investigation by the committee were defiant, even wearing hats that said SUBPOENAED,? while other speakers and guests railed against the committee.",
    "Outside the room, Riggleman told attendees that he had just received promising new phone records of those involved in the pro-Trump riot but declined to say whose they were.",
    "), a former White House physician, called the White House an assisted-living facility,? a dig at President Biden's age and mental acuity that drew applause from the crowd.",
    "CPAC, whose main theme was the threat posed by left-wing elites and where Trump was widely embraced, took place at a luxury resort with Spanish Revival-style architecture.",
    "Otherwise, there were vast differences, which boiled down to how much the American right should orient itself around the kind of cultural grievances harnessed by Trump.",
    "It also welcomed Rep. Marjorie Taylor Greene (R-Ga.), the far-right firebrand whose presence at both Orlando conferences signaled a measure of overlap between the two.",
    "Riding an escalator to an interview with pro-Trump One America News, Collins said it was Trump, but also the party's policies, that excited crowds at CPAC.",
    "And at a remove in D.C., figures who once occupied that mainstream met to urge the party to set aside its veneration for former president Donald Trump.",
    "Fuentes's alternative, called the America First Political Action Conference, brought together right-wing media personalities and tech entrepreneurs.",
    "It was to talk about getting everyone together to save our country.?\nOtherwise, speakers at the CPAC substitute heaped scorn on the main gathering.",
    "CPAC is an embodiment of the intellectual degradation of the party,? said Heath Mayo, a New York corporate attorney who organized the event.",
    "Most of the party's attention was trained on Orlando, where GOP faithful flocked to the Conservative Political Action Conference, or CPAC.",
    "Worlds away in D.C., Republicans at odds with their party's direction warned of the pernicious effects of disinformation and hate.",
    "She later told reporters she attended to address [Fuentes's] very large following,? claiming not to know him personally.",
    "We don't have a Matt Schlapp that does this and charges from $300 to $5,000,? he said, referring to the CPAC organizer.",
    "I'm going to rip apart their ecosystem.? And he hinted at tantalizing findings, while offering few specifics.",
    "It was held at the National Press Club, an organization devoted to promoting and protecting the free press.",
    "One man shaved the number 45, Trump's place in the presidential lineup, on the back of his head.",
    "It is all about money,? Riggleman said of conspiracy theorists and those he is investigating.",
    "About 460 people registered for the event, Mayo said, from 41 states, and tickets cost $35.",
    "I wish I could tell you about it,? he said of the data he was reviewing for the committee.",
    "Upstart networks made a bet that the conference was their ticket to broader audiences.",
    "The Principles First? event cost about $20,000 and does not make money, Mayo said.",
    "It's basically just standing up and saying, I have no ideas at all,'? Peters said.",
    "The highly choreographed event is also a notable commercial proposition.",
    "Scarcely anyone wore a mask, except servers and other staff.",
    "All three summits featured Republican officeholders.",
    "All three promised guests the unvarnished truth.",
    "Delegations came from at least three continents.",
    "He had the prime speaking slot Saturday evening.",
    "Both spoke via prerecorded videos.",
    "Rep. Ronny Jackson (R-Tex."
  ]
}