{
  "id": 403,
  "mediaId": 238,
  "date": "2/25/2022 12:00:00 AM",
  "headline": "Opinion: Putin thinks he can win a new Cold War. He may be right.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/25/why-winning-a-second-cold-war-with-russia-is-harder-than-you-think/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2030,
    2011,
    2011,
    2087,
    2030,
    1253,
    1253,
    2807,
    2807,
    2863,
    2863,
    2888,
    2888,
    2945,
    2945
  ],
  "sentences": [
    "A Republican Party that once led the fight against godless communism (that's how all those evangelical Christians got into politics, by the way) now bows to a leader who calls Putin a genius.? Rather than opposing Russian aggression, Ronald Reagan's political descendants roll back voting rights and support armed insurrectionists in the U.S. Capitol.",
    "The primary conflict between democracy and authoritarianism,? Sen. Bernie Sanders (I-Vt.) wrote in Foreign Affairs last June, arguing against a Cold War with China, is taking place not between countries but within them  including in the United States.?\nIf this was true before Putin's Ukrainian gambit, then it isn't now.",
    "Our once-inspiring voice as a leader of nations has been replaced by the echoing chant of America First.? Our single most important export to the rest of the world  the idea of liberal democracy as the advancement of humankind  looks defective right out of the box.",
    "The prosperity that once raised the standard of living for the middle class is waning now, as faithless capital flees to foreign shores and conservatives look to slash every tax they can find, widening the gulf between the wealthy and everyone else.",
    "A public that once took pride in its embrace of reality  that laughed at Pravda and clumsy Soviet communiques  is suddenly drowning in disinformation, to the point where we can't even agree on whether the president is legitimately elected.",
    "After all, for 30 years, the foreign policy establishment has cast about for a single, recognizable framework to fill the void left by the sudden disappearance of the U.S.S.R. For a while, instability itself was the enemy.",
    "This partly explains why President Biden has often used the term Cold War? when talking about China  because China's repression is every bit as ruthless as the Soviets', and ours is still the better idea.",
    "If we stand now on the brink of a second Cold War, as many analysts have argued, it's because the Russian president, Vladimir Putin, calculates that his odds of winning are better this time around.",
    "Our once-sturdy consensus around liberal democracy  a basic commitment to free speech, civil debate, laws and values over demagogues, division and disinformation  is crumbling with alarming speed.",
    "And if we think the nation is up for another extended standoff with Russian tyranny, then we need to face the frightening state of the democracy that was once our greatest strength.",
    "In fact, he has played an active role in fomenting our civil and political chaos over the past five years, meddling in elections and making Donald Trump his patsy before the world.",
    "But if we forget everything else about the existential threat that dominated many of our childhoods, we should at least remember this: Weapons alone didn't win the first Cold War.",
    "That belief, however imperfectly we may have personified it, rallied much of the world to our cause and inspired ripples of rebellion throughout the Soviet bloc and elsewhere.",
    "The shorthand version holds that America essentially spent the Soviets into submission, driving up the cost of the arms race until Moscow bankrupted itself and broke apart.",
    "Through Putin's lens, we probably look nothing at all like the steely country that won the Cold War, with an almost theological devotion to free markets and free minds.",
    "He must see us as a country increasingly like his own, willing to indulge our own brands of tyranny and propaganda, riven by tribal tensions and intolerant of dissent.",
    "I don't know exactly how we find our way back to the broad agreement that no matter how much we may disagree politically, our underlying convictions are unshakable.",
    "War in Ukraine: What you need to know\nThe latest: Russian forces press closer to Kyiv as U.S. warn it could fall soon as Ukrainians flee to train stations.",
    "We won the Cold War not because we had better soldiers or more reliable weapons or more disposable income, although all of those were advantages.",
    "It sometimes astounds me how fast the country moved on from what President John F. Kennedy called the long twilight struggle? with communism.",
    "There's a pinched view on the left that America faces a choice between restoring its own liberties and protecting them around the world.",
    "The response: U.S. targeted major Russian banks and tech sector with sweeping sanctions and export controls following Ukraine invasion.",
    "In some ways, for policymakers of the president's generation, the notion of another Cold War must feel like a return to steady ground.",
    "How we got here: The conflict playing out between Russia and Ukraine is one marked by land borders and shaped by strategic influence.",
    "It's much tougher to demonstrate the rightness of your ideology when, increasingly, you don't seem to really believe in it yourself.",
    "The United States shouldn't have to choose domestic investment over confrontation with global bullies; we can, and have, done both.",
    "But what cleaner construct could there be than the resumption of a global conflict we already understand and know how to fight?",
    "Nor am I saying that we should shrink from the military and moral re-investment it might take to contain Putin's ambitions.",
    "Looking back on the lessons of the Cold War  and at the state of our politics now  it would be hard to conclude he's wrong.",
    "No nation can lead the fight against tyranny abroad if it is busy stamping out democracy and assaulting truth at home.",
    "But it would be reckless to think our political crises at home are somehow separate from the looming conflict abroad.",
    "Within 20 years of the Berlin Wall's collapse, most Americans couldn't have told you what the Cold War was about.",
    "We were right that liberal democracy was a better and more enduring form of governance than statist repression.",
    "This is what Putin's bid to reassemble his empire has given us, at least for the moment: a return to clarity.",
    "Maps: Russia's assault on Ukraine has been extensive with strikes and attacks across the entire country.",
    "I'm not arguing that America can't prevail in a rematch of the Cold War, if that's where we're headed.",
    "These four maps help explain the deep roots of the conflict and where things stand right now.",
    "You don't have to be a seasoned Kremlinologist to deduce that Putin sees all of this, too.",
    "When you look at it that way, why wouldn't Putin roll the dice on another westward lurch?",
    "Global leaders were quick to condemn Russia's actions and call for a decisive response.",
    "Just because you win a war once, though, doesn't mean you're destined to win it again.",
    "The invasion: Photos and videos show what the situation on the ground looks like.",
    "Then, after 2001, it seemed the War on Terror? would keep us busy for decades.",
    "is a pretty good example  who are willing to denounce un-American extremism.",
    "And we were right about the essential power of human rights and liberty.",
    "Why wouldn't he gamble that we lack the moral clarity to triumph again?",
    "We were right about the superiority of capitalism over collectivism.",
    "We mostly remember it now as a triumph of sheer American might.",
    "I suspect it starts with leaders  Rep. Liz Cheney (R-Wyo.)",
    "Here's what we know about why Russia has attacked Ukraine.",
    "Read our full coverage of the Russia-Ukraine crisis.",
    "In some corners, responses were somewhat muted.",
    "And they won't win the next one, either.",
    "We're tracking the invasion here.",
    "We can afford to do it again.",
    "Why would he stop at Ukraine?",
    "We won because we were right."
  ]
}