{
  "id": 406,
  "mediaId": 237,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "Past Trump",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/b15712f/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F82%2F36%2F747ce3e24852a5dc60546fb43d37%2Ffea.Cover.Trump.jpg",
  "link": "https://www.washingtonexaminer.com/politics/past-trump",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "W. James Antle III",
  "authorUrl": "",
  "termIds": [
    2087,
    1765,
    1765,
    2087,
    2117,
    2117,
    2214,
    2214,
    1248,
    1248,
    1335,
    1335,
    1434,
    1434,
    1563,
    1563,
    1147,
    1147,
    188,
    188
  ],
  "sentences": [
    "When asked by a reporter whether Trump's comments would erode the bipartisan commitment to confronting Russian aggression, Psaki replied, I think that is up to members of the Republican Party to make the decision and make the determination.?\nWhile they would undoubtedly disagree with Psaki's framing of the Russia-Ukraine crisis, that's what Republicans who would like to focus on the future rather than Trump-era controversies are saying, too.",
    "The resolution described them as participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse, and they are both utilizing their past professed political affiliation to mask Democrat abuse of prosecutorial power for partisan purposes.?\nMcConnell demurred.",
    "Republicans faced a similar positive political environment in 2010  a Democratic president whom independent voters were souring on, a motivated base, an opening to add a number of congressional seats to end the Democrats' unified control of the federal government's elected branches.",
    "Glenn Youngkin was elected as a Republican in an increasingly blue state because he threaded the needle skillfully: He didn't disavow Trump, but he did not overly embrace him or re-fight old battles at the expense of issues that were on voters' minds under Biden and the Democrats.",
    "In an interview with Clay Travis and Buck Sexton, he made the obvious points about Russian President Vladimir Putin invading Ukraine under Biden's watch rather than during his term in the White House, despite persistent Democratic allegations about Trump-Russia connections.",
    "Run on matters of importance to the base; be assertive in the face of media and institutional liberal pressure; fulfill campaign promises; pass strong election integrity measures without questioning the 2020 results  but don't get distracted by needless fights.",
    "He advised would-be Republican Senate candidates, I'd be talking about what this administration is doing and how do you feel about it, because the American people are looking to the future.? In other words, not relitigating the 2020 presidential election.",
    "Many Republicans viewed Youngkin as a model for future candidates and officeholders, somewhere in between Liz Cheney and Matt Gaetz, both of whose political fortunes are tied one way or another to Trump's standing among voters.",
    "This enabled White House press secretary Jen Psaki, whose boss is presiding over this heightened threat to Ukraine after many GOP lawmakers pressed the administration on Russia sanctions, to blame Trump and Republicans.",
    "Agree with Trump when you can, keep your focus on Biden and Pelosi, and keep your negative comments to a minimum.?\nElectoral success, or even positive feedback from GOP voters, further incentivizes these strategies.",
    "I think Glenn Youngkin's handling of Trump was brilliant and could be a model for Republicans running in bluish states,? said a veteran GOP operative in Washington, D.C. Embrace him with the right audience.",
    "According to Quinnipiac University, 53% of self-described Republicans reported Pence's view was \"closer in line to their way of thinking\" about the election, compared to 36% who were closer to Trump's.",
    "As a result, Republican primaries produced nominees who frittered away winnable Senate races, keeping the chamber in Democratic hands until midway through former President Barack Obama's second term.",
    "It's also true that the party's governing class has tried to resist him before without much impact, since rank-and-file GOP voters often view the Republican establishment with suspicion or contempt.",
    "Mace is supported by Nikki Haley, the former ambassador to the United Nations and South Carolina governor, who has made her own declarations of independence from Trump and then walked them back.",
    "But she did say she had lost faith in Trump, telling CNN his entire legacy was wiped out? by the events of Jan. 6 and commenting to Fox News that she did not think he had a future in the party.",
    "Under the Constitution, I had no right to change the outcome of our election, and [Vice President] Kamala Harris will have no right to overturn the election when we beat them in 2024,\" he said.",
    "Mace made this point in a video hitting back at Trump's endorsement, which she filmed outside Trump Tower in New York City to send the message she was the better vehicle for Trumpism.",
    "President Trump is wrong,? Pence told the Federalist Society, an important conservative legal network that proved influential in the Trump-Pence federal judicial nominations process.",
    "The Republican National Committee voted to censure Reps. Liz Cheney and Adam Kinzinger, the token GOP lawmakers on the Democratic committee to investigate the Jan. 6 Capitol riot.",
    "The former president is constitutionally eligible to seek a second, nonconsecutive term in 2024, a possible rematch with President Joe Biden, and is seriously considering it.",
    "That opponent is Katie Arrington, the same candidate Trump successfully backed against former Rep. Mark Sanford  and who promptly lost the general election to the Democrats.",
    "Contemplating a presidential bid of his own, Pence has taken Trump on directly over the contention they could have denied Biden the White House with a procedural maneuver.",
    "Some GOP power brokers, chief among them Senate Minority Leader Mitch McConnell, are doing what they can to put this tradition, and the entire question, in the rearview.",
    "Some Republicans fear Trump's interventions in the primaries, motivated by personal fealty more than objective candidate quality, could risk a similar outcome this year.",
    "Traditionally, the view of the national party committees is that we support all members of our party, regardless of their positions on some issues,? he told reporters.",
    "My guiding principle is: Don't do things that are stupid and that take the subject off of what we want it to be on,? McConnell recently told the Washington Examiner.",
    "Larry] Hogan, whose numbers are almost as high as Trump's.?\nIn those two Senate races, however, his endorsement in the primary will matter,? the operative continued.",
    "Gibbons isn't anti-Trump by any means, but Mandel and Vance have been more actively vying for the ex-president's support and have been emulating his combative style.",
    "That's not the job of the RNC.?\nThen there is the case of Rep. Nancy Mace, the first-term South Carolina Republican facing a Trump-endorsed primary challenger.",
    "Whether he runs or not, Trump has always been reluctant to cede the spotlight to others, going back to his days as a reality TV star and real estate mogul.",
    "Barnum: There's no such thing as bad publicity.?\nA political party seeking to win elections and govern the country is apt to feel differently, however.",
    "They gained 63 House seats to send Speaker Nancy Pelosi back into the minority, but it took another four years for Republicans to retake the Senate.",
    "Trump's endorsement of Dan Cox in Maryland won't do much to move the needle in the primary, especially since Kelly Schulz has been endorsed by [Gov.",
    "You'll have to ask him.? By contrast, Arrington's pitch to a local Republican gathering was to say this of Mace: She sold out President Trump.",
    "In a ritual dating back to that June 2015 ride down the escalator, the Republican Party is having a debate over what to do about Donald Trump.",
    "Asked why she had a falling out with Trump after working as a coalitions and field director for his 2016 campaign, she replied, I don't know.",
    "She sold me out.?\nSome recent polls show businessman Mike Gibbons leading former state Treasurer Josh Mandel and Hillbilly Elegy author J.D.",
    "He was referring to the debt ceiling, but it distills in Old Crow Kentucky bourbon fashion the difference between his approach and Trump's.",
    "Vance was an early critic of Trump's, so his shift suggests a strategic calculation about the direction of the party, at least in Ohio.",
    "The issue is whether or not the RNC should be sort of singling out members of our party who may have different views of the majority.",
    "Trump has since called her terrible? and very disloyal.?\nTrump retains a large following among the Republican primary electorate.",
    "A poll in South Carolina's 1st Congressional District showed Mace beating Trump-endorsed Arrington by double digits, 46% to 31%.",
    "My mom used to tell me that if you can't say anything nice, don't say anything at all,? said Republican strategist John Feehery.",
    "As a matter of policy, we try not to take advice from anyone who praises President Putin and his military strategy,? she said.",
    "Trump will nevertheless emerge as a campaign issue for many candidates who would prefer to be talking about Biden.",
    "Keep him at arm's length when you're not.?\nIn reddish states, too, there were possible lessons for Republicans.",
    "You've got to say that's pretty savvy,? he said of Putin's peacekeeping gambit in Ukraine's breakaway regions.",
    "Mace didn't vote for Trump's second impeachment, unlike many of the former president's intraparty targets.",
    "The loyal understudy broke with the boss over certifying Biden's Electoral College victory last January.",
    "A Republican primary for governor of a blue state is different than a Senate race in Ohio or Missouri.",
    "It's a strategy that could pay dividends for the party as Biden's approval ratings continue to tank.",
    "\"When Trump and McConnell worked together, we got our best results,\" said one Republican strategist.",
    "The GOP failed to harness the Tea Party wave to productive purposes in many key statewide elections.",
    "McConnell said much the same thing at the Wall Street Journal CEO Council Summit late last year.",
    "I think it depends on the state and the office being sought,? said the D.C.-based GOP operative.",
    "Yet the former vice president's words were validated by Republican voters in a subsequent poll.",
    "But Trump could not let it go at that and appeared to be in awe of Putin compared to Biden.",
    "These lines are virtually guaranteed to appear in attack ads deployed against Pence.",
    "His entire career has been a running affirmation of the saying attributed to P.T.",
    "The jury is still out on that.?\nTrump complicates the GOP message in other ways.",
    "Others would like to see Trump's populist energy married to a positive agenda.",
    "The question then becomes, can his endorsed candidates win in a general?",
    "Former Vice President Mike Pence spent four years by Trump's side.",
    "(Among all voters, those numbers are 72% and 17%, respectively.)",
    "W. James Antle III is the Washington Examiner's politics editor.",
    "I'm gonna win without him,? she told the State newspaper.",
    "The longtime Kentucky lawmaker knows whereof he speaks.",
    "Vance for the Ohio Republican senatorial nomination.",
    "By the way, this never would have happened with us.",
    "Had I been in office, not even thinkable,? he said.",
    "Seems like a pretty good strategy with Trump.",
    "He's going to go in and be a peacekeeper.\"",
    "Those numbers are confidence-boosting.",
    "Still, McConnell isn't alone.",
    "I said, 'How smart is that?'",
    "She sold out this district.",
    "But old habits die hard.",
    "It won't be easy.",
    "Virginia Gov.",
    "Just In..."
  ]
}