{
  "id": 407,
  "mediaId": 238,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "After Afghanistan, Biden faces another wary public on Ukraine",
  "image": "https://newsletter-imgs.s3.amazonaws.com/prod/the-202s/primary/daily.svg",
  "link": "https://www.washingtonpost.com/politics/2022/02/24/he-prepared-them-poorly-messy-afghanistan-withdrawal/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1168,
    1168,
    1223,
    1223,
    2157,
    2157,
    2087,
    2087,
    2030,
    2030,
    485,
    485,
    2535,
    2535,
    2945,
    2945,
    2888,
    2888,
    2942,
    2942
  ],
  "sentences": [
    "Cueller's race against Jessica Cisneros comes at a time when, like in several Democratic primaries across the country, voters are wrestling with whether to stick with a centrist incumbent who may represent their best chance of holding on to the seat against a Republican challenger or embrace a younger liberal who seems more line with the party's leftward drift.?\nEven with the tons of weapons, ammunition and equipment delivered to Ukraine by Western allies in just the last few weeks, the Ukrainian military is outgunned by the larger, more technologically advanced Russian forces that have launched a multipronged invasion,? the New York Times's Michael Schwirtz reports.",
    "\"Though the Russian incursion is just beginning, signals Thursday  including strikes across Ukraine  suggested a wide-ranging military offensive that would trigger deep sanctions from the United States and European Union, hurting not just the Russian economy, but the whole world's.?\nChina on Thursday denied backing Russia's military assault in Ukraine as it trod a cautious line in response to a conflict that many Chinese analysts just days before were predicting wouldn't happen,? Christian Shepherd reports.",
    "The Russian attacks are the greatest test yet for an emerging Moscow-Beijing partnership, which has recently shown signs of evolving from what many considered a marriage of convenience' to something resembling a formal alliance.?\nMilitary analysts and Western officials had been warning of a brutal assault that could lead to the worst conflict in Europe since World War II.? This is how the situation on the ground is unfolding, including reports from journalists for The Washington Post on the ground.",
    "Asked Wednesday whether the president had done enough to prepare, White House press secretary Jen Psaki replied: We make national security decisions based on what's best for our country's national security, not on the latest polling.?\nIf you step back, what, hopefully, the American people will see and have seen is that while Russia has sought to divide our allies and the American people, the president has sought to revitalize our partnerships and alliances and unite our country,? she said.",
    "He said the alliance had activated defense plans' to help ensure that there is no spillover into any NATO member country, but did not disclose what that means.?\nGlobal markets convulsed Thursday as Russia launched a military assault on Ukraine, with all three U.S. indexes opening in correction territory as investors braced for further uncertainty and energy-related disruptions,? Chico Harlan and Taylor Telford report.",
    "If Republicans win the majority this fall, Mr. McCarthy will need the support of the whole party, including the big donors who fund it, a dwindling number of center-right traditionalists and a larger group of quiet conservatives.?\nEach Thursday morning, Norma Matthews and her twin sister, Edith Antoncecchi, carefully style their hair and sometimes put on coordinating outfits.",
    "As the BASF CEO noted at the ball in 2008, energy-rich Russia' and technology-rich Germany' are a good match.?\nWith Democrats only narrowly in control of the House and Senate, Biden's track record on legislation is mixed, primarily because he failed to persuade all 50 members of the Senate Democratic caucus to support a slimmed-down version of his Build Back Better plan.",
    "A week after images of FBI agents carrying boxes out of Rep. Henry Cuellar's large north Laredo home streamed live on social media, the South Texas native proclaimed his innocence in front of his modest southside childhood home, a totem to the humble roots he routinely invokes  especially when seeking reelection,? Arelis R. Hernndez and Marianna Sotomayor report.",
    "And he sided against a member of his own conference in throwing his support behind the Wyoming primary challenger, Harriet Hageman, whose central message is that [Representative Liz Cheney] should be ousted for breaking with Mr. Trump and daring to investigate the most brutal attack on the Capitol in centuries,? the NYT's Annie Karni and Jonathan Weisman report.",
    "How many roads, bridges, railways, fiber optic lines and other types of infrastructure the U.S. can build or fix under the lawa central accomplishment of President Biden's that experts say is a generational investmentwill largely hinge on the extent of increases in everything from the cost of diesel fuel to workers' wages,? the WSJ's Andrew Duehren reports.",
    "After Ukraine became independent and forfeited the world's third-largest nuclear arsenal, the West could have loosened the purse strings to guarantee the country's economic independence,\" former director of European affairs for the National Security Council Alexander Vindman writes for the Atlantic.",
    "He acknowledged that President Vladimir Putin's move against Ukraine was quite worrisome' for Russians.?\nThe North Atlantic Treaty Organization will bolster its eastern flank and host an emergency summit in response to Russia's attack on Ukraine,? Annabelle Timsit and Emily Rauhala report.",
    "While coronavirus shots still provided protection during the omicron wave, the shield of coverage they offered was weaker than during other surges, according to new data from the Centers for Disease Control and Prevention,? our colleagues Dan Keating and Naema Ahmed report.",
    "After the 2004 Orange Revolution, the West could have embraced Ukraine's Western aspirations, accelerated an EU Association Agreement and a NATO Membership Action Plan, and driven domestic transformation to shield Europe's largest country from nascent Russian revanchism.",
    "In addition to unthinkable human consequences on the ground, getting Ukraine right (or as right as possible) could factor into whether the president's party salvages their razor-thin majorities in Congress in a climate already heavily favorable to Republicans.",
    "Jane Lubchenco, a marine ecologist who serves as OSTP deputy director for climate and environment and who ran the National Oceanic and Atmospheric Administration during President Barack Obama's first term, will lead the discussion,? Maxine Joselow reports.",
    "So, we're less focused on the politics of Ukraine and more focused on preventing a war.?\nBut on the flip side: The relative lack of support for a U.S. role doesn't mean Biden hasn't prepped Americans for the consequences of an all-out invasion.",
    "He has warned that Russian President Vladimir Putin's catastrophic and needless war of choice? will have disastrous consequences for Ukraine's 44 million people, immense costs for Russia, and bring potential economic disruptions here at home.",
    "Americans, in short, aren't particularly supportive of taking on what is now the biggest war in Europe since World War II, though the poll didn't define what a major role? means, so it's hard to apply to Biden's approach to the crisis.",
    "He's standing up for our national security interests and bedrock democratic values against the aggression of a dictator threatening to further invade a sovereign country.?\nThat's why he's doing what he's doing,? Psaki said.",
    "Calling Russia's moves a brutal act of war,' Secretary General Jens Stoltenberg said Thursday that the alliance plans to send more troops east in the coming days and weeks,' but did not provide additional details.",
    "The event, which has not previously been reported, will bring together a diverse group of 17 climate scientists, social scientists, engineers and economists from 11 states and the District of Columbia.",
    "If Russia attacks the United States or our Allies through asymmetric means, like disruptive cyberattacks against our companies or critical infrastructure, we are prepared to respond,? Biden said.",
    "After the 2014 Revolution of Dignity, the West could have invested in a strategic security partnership with Ukraine that would have made the costs of a Russian offensive prohibitively high.",
    "Kremlin spokesman Dmitry Peskov said Thursday that Russian attacks on Ukraine were a special operation,' not a war, carried out in the interests of Russia,? Robyn Dixon reports.",
    "We need to be honest about that,? he said Tuesday, promising to use every tool at our disposal? to protect Americans from energy supply shocks likely to send gas prices surging.",
    "Yet none of this came to pass.?\nEven as [McCarthy] courts the mainstream elements of his party, he has defended Republicans who have called the Jan. 6 riot a righteous cause.",
    "But here's one thing I want to hear: How America has prepared for what happens if hundreds of thousands of refugees flee Ukraine, potentially destabilizing its neighbors.",
    "By contrast, President Barack Obama did reasonably well in fulfilling his legislative priorities until Republicans won back control of Congress,? Glenn Kessler explains.",
    "And 53 percent of Americans say they're very or extremely concerned that Russia's global influence poses a threat to the United States, up from 45 percent in August.",
    "Biden himself has taken pains, in all of his public remarks, to emphasize he's not sending U.S. troops to the former Soviet republic to fight Russian forces.",
    "Weighed down by the stubborn pandemic, the president's numbers haven't recovered, a heavy liability for Democrats heading into this year's midterm elections.",
    "In popular mythology, that loyalty (like much else in modern Germany) is tangled up in its war guilt  The truth is, Germans like to do business with Russia.",
    "President Biden didn't fully prepare Americans for the messy withdrawal from Afghanistan, incorrectly playing down prospects of a speedy Taliban takeover.",
    "The United Kingdom was more interested in attracting oligarchs' wealth than in asking where it came from,? Politico's Matthew Karnitschnig reports.",
    "On this day in 1991, the U.S. led the ground-assault portion of Operation Desert Storm, the successful campaign to expel Iraqi forces from Kuwait.",
    "The summer 2021 end to the Afghan war helped drive down Biden's job approval, a broadly popular policy undermined by how it was carried out.",
    "There hasn't been a systematic effort by Biden to brace the public for how events in Eastern Europe could disrupt Americans' daily lives.",
    "Forty-three percent of Americans now approve of Biden's handling of the U.S. relationship with Russia, down from 49 percent last June.",
    "Thirty-two percent say it should be major; 51 percent say it should be minor, perhaps leaving room for Biden to broaden that support.",
    "Per the AP: 32 percent of Democrats think the U.S. should have a major role in the conflict, compared with 22 percent of Republicans.",
    "We'll know more today, when Biden is expected to lay out a new wave of Western sanctions in response to Russia's overnight onslaught.",
    "White House officials did not return an email asking whether a presidential speech focused on that topic might be in the offing.",
    "Then they catch a lift to a church in St. Petersburg, Fla., for the Golden Heirs musical hour for seniors,? Cathy Free reports.",
    "The public might simply look at Ukraine and conclude what's happening there is terrible, but it's not America's business.",
    "The question now is whether he's done enough to brace Americans for the global shocks from Russia's assault on Ukraine.",
    "The political danger for the president can be seen in a new AP-NORC public opinion poll, released Wednesday.",
    "Independents (32 percent) are more likely than Democrats or Republicans to say the U.S. should have no role.",
    "But make no mistake: No country has done more to downplay and forgive Russia's transgressions than Germany.",
    "The United States refused for years to believe that Putin was as dangerous as he has turned out to be.",
    "It's not that the president has been dismissive of the potential consequences, quite the opposite.",
    "As a result, Biden's failure rate was about three times as high as his success rate.",
    "It found 26 percent of Americans favor taking a major role? in the confrontation.",
    "Fifty-two percent favor a minor role, while 20 percent say no role at all.",
    "And 69 percent disapprove of Biden's handling of relations with Moscow.",
    "Ukraine should ideally be freed, cleansed of Nazis,' Peskov said.",
    "Defending freedom will have costs for us as well, here at home.",
    "There are many fathers of the disaster unfolding in Ukraine.",
    "Free has the details on the twins' life of scandal' and joy.",
    "Tell your friends to sign up here.",
    "Welcome to The Daily 202!"
  ]
}