{
  "id": 411,
  "mediaId": 237,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "Cheney rising: Second to Trump with all 2024 voters",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/957724.png",
  "link": "https://www.washingtonexaminer.com/opinion/washington-secrets/cheney-rising-second-to-trump-with-all-2024-voters",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Bedard",
  "authorUrl": "https://www.washingtonexaminer.com/author/paul-bedard",
  "termIds": [
    1147,
    1248,
    1434,
    1710,
    3094,
    416,
    428,
    2976
  ],
  "sentences": [
    "But the poll also appeared to log some new sliver of hope for Cheney, up for reelection, as a viable voice in the party despite her clashes with Trump, her criticism of his 2020 election claims, and the sanctions leveled by the Wyoming and national GOP.",
    "In the first survey to detect the surge in support for the embattled lawmaker, Rasmussen Reports today said that among all likely voters, Cheney is second to Trump in the Republican primary race.",
    "Wyoming Rep. Liz Cheney, former President Donald Trump's archenemy who was abandoned by her own party, is moving fast up the 2024 GOP leaderboard.",
    "But even when they are stripped out, she is third among Republicans and independents, behind Trump and Florida Gov.",
    "So among Republicans only in the survey, Trump leads with 47%, followed by DeSantis at 20% and Cheney at 7%.",
    "One long-standing trend has been Trump's domination over the GOP, which shows in today's Rasmussen survey.",
    "Many agree that the early 2024 polls are largely meaningless except for showing trends.",
    "That puts her in front of Sen. Ted Cruz, 6%, and former Vice President Mike Pence, 5%.",
    "Unsurprisingly, she is the favorite of Democrats, and the poll numbers show that.",
    "Of course, mostly Republicans vote for the GOP nominee.",
    "She logs in at 16%, behind Trump at 30%.",
    "Ron DeSantis."
  ]
}