{
  "id": 414,
  "mediaId": 238,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "Opinion: Romney is right: MAGA Republicans are almost treasonous'",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/28/treasonous-republicans-romney/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    683,
    1095,
    1147,
    1248,
    1609,
    2030,
    2087,
    2409,
    2436,
    2465,
    3094,
    428,
    562,
    2590,
    2942
  ],
  "sentences": [
    "From House Minority Leader Kevin McCarthy (R-Calif.) to staunch Trump apologist Rep. Elise Stefanik (R-N.Y.) to the entire Republican Party apparatus (which keeps up a constant stream of juvenile insults directed at Biden), the largest group of Republicans now vilifies Biden for being too weak, despite a unified and robust response from the West that has succeeded in making Putin a pariah.",
    "If Putin had handpicked an agent to be president of the United States, he could hardly have expected better results; Trump certainly exceeded any expectations Putin might have had with his disparaging NATO, extorting Ukraine by withholding military aid, leaving Russia's election-meddling unpunished, inviting Putin back into the Group of Seven and attacking our own intelligence community.",
    "Every American watching what's happening in Ukraine should know that.?)\nOn Sunday, she declared on CBS's Face the Nation? that we have seen impressive progress? with sanctions on Russia and praised the unity of the alliance, while making constructive suggestions for further steps (e.g., freezing out the Russian central bank and sanctioning oligarchs' families).",
    "Sen. Mitt Romney (R-Utah), ridiculed as a presidential candidate in 2012 for identifying Russia as our primary international foe (he was premature but prescient), on Sunday called out Putin's admirers in his own party as almost treasonous?:\nThe divisions within the GOP are stark and becoming unsustainable.",
    "Taking the prize for incoherence, Sen. Ron Johnson (R-Wis.) bizarrely attacked Democrats  such as Speaker Nancy Pelosi and retired Lt. Col. Alexander Vindman and others who played a role in Trump's impeachment for betraying U.S. security interests and extorting Ukraine  for weakening Ukraine.",
    "We dare not return to power Trump acolytes who denigrate America (when much of the world has rallied behind the U.S. president), bolster authoritarianism, rationalize political violence, abhor a free press and fail to stand up to Putin's favorite patsy.",
    "It is noteworthy that Romney and Cheney avoid any anti-Biden gibberish, a cheap way for Republicans to appear pro-Trump and pro-MAGA by implication but at the risk of once more undercutting democracies and weakening a united front against Putin.",
    "These were the people who suggested there was nothing wrong with Trump's call in 2019 attempting to extort Ukrainian president Volodymyr Zelensky (now a national hero and international symbol of courage).",
    "In the first group are a tiny handful of Republicans who opposed Trump, supported his impeachment (at least the second one), condemned his assaults on the NATO alliance and denounced his Putin-worship.",
    "One cannot be an unrepentant apologist for Trump (or his advisers) and favor his return to the presidency (or at least not oppose it) while also taking Ukraine's side and defending Western democracies.",
    "The third category of Republicans  including Trump, Rep. Marjorie Taylor Greene (R-Ga.) and Fox News's Carlson (disclaimer: I'm an MSNBC contributor)  remains supportive of Putin.",
    "On NBC's Meet the Press,? Danielle Pletka (who defended voting for Trump in 2020) claimed that former secretary of state Mike Pompeo misspoke? when he repeatedly praised Putin.",
    "There comes a time when a united front means putting aside partisan differences and doing whatever it takes to stop a pro-Putin, pro-Trump faction from returning to power.",
    "Donald Trump spent four years (plus a year campaigning) cozying up to and helping further the geopolitical aims of Russian President Vladimir Putin.",
    "To this day, the defeated former president continues to praise Putin (smart?), and continues to denigrate the United States (dumb?) and our allies.",
    "has remained a consistent defender of democracy and opponent of Trump and Putin  and Cheney has been merciless when it comes to their apologists.",
    "(As Russian forces invade Ukraine, Russian TV features Donald Trump, Mike Pompeo and Tucker Carlson praising Putin,? she tweeted on Friday.",
    "A flock of right-wing media personalities echo their namesake America Firsters of the 1930s, who insisted we had no dog in Europe's war.",
    "How long can Romney and Cheney tolerate the cognitive dissonance required to remain in a party aligned with Trump and Putin apologists?",
    "(NBC foreign affairs reporter Andrea Mitchell appeared flabbergasted, pointing out that Pompeo fawned over Putin more than once.)",
    " When Fox News asked him if he had a message for Vladimir Putin, he said he has no message.? Stephanopoulos never got an answer.",
    "They would have us forget Trump's appeasement and his unabated flattery for Putin, both of which they countenanced.",
    "This brings us to the second group of Republicans, the cowardly and incoherent latecomers to Ukraine's side.",
    "(I simply don't understand why you can't condemn his praise of Vladimir Putin,? Stephanopoulos said.",
    "Cotton refused to rule out supporting Trump in 2024, to Stephanopoulos's utter frustration.",
    "Ukraine, perhaps the Baltics too, would be cooked, and the West would be in disarray.)",
    "On ABC's This Week,? George Stephanopoulos gallantly pressed Sen. Tom Cotton (R-Ark.",
    "Hint: Cotton's ambition and spinelessness prevent him from breaking with Trump.)",
    "Some right-wing pundits become apologists for Putin's cringeworthy defenders.",
    "Some Republicans get so confused they lose track of who's on Ukraine's side.",
    "): Why can't you condemn Donald Trump for those comments? praising Putin?",
    "(Consider what would have occurred if Trump had been elected in 2020.",
    "He continued: You're a senior member of the Republican Party.",
    "Donald Trump is the leader of the Republican Party.",
    "Self-humiliation is no barrier to hypocrisy.",
    "Other than Romney, Rep. Liz Cheney (R-Wyo.)",
    "These are diametrically opposed goals.",
    "Putin is evil."
  ]
}