{
  "id": 421,
  "mediaId": 195,
  "date": "2/23/2022 12:00:00 AM",
  "headline": "Cheney: Trump's 'adulation' of Putin 'aids our enemies'",
  "image": "https://cdn.jwplayer.com/v2/media/SKdRXDiI/poster.jpg?width=640",
  "link": "https://thehill.com/policy/international/595425-cheney-trumps-adulation-of-putin-aids-our-enemies",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Dress",
  "authorUrl": "https://thehill.com/author/brad-dress",
  "termIds": [
    1147,
    1248,
    2030,
    2087,
    3085,
    3094,
    2888,
    2942
  ],
  "sentences": [
    "During his presidency, Trump was accused of having close ties to Putin and came under fire during the Helsinki summit in 2018 when he defended the Russian leader and said Russia did not interfere in the 2016 election, despite U.S. intelligence suggesting otherwise.",
    "said Tuesday night that former President Trump was working against American interests after he offered praise for Russian President Vladimir Putin during a Tuesday interview on \"The Clay Travis and Buck Sexton Show.\"",
    "In the interview, Trump knocked Biden and said that under his own presidency, Putin never would have recognized two breakaway territories in eastern Ukraine and moved troops into the Donbas region.",
    "Cheney, one of 10 House Republicans who voted to impeach Trump over his role in the Jan. 6, 2021, Capitol riot, has emerged as one of the former president's harshest GOP critics on Capitol Hill.",
    "She faces an uphill reelection battle in her home state of Wyoming in November, with Trump and his allies moving to bolster her primary challenger, Harriet Hageman.",
    "\"Former President Trump's adulation of Putin today - including calling him a 'genius' - aids our enemies,\" Cheney tweeted.",
    "But Trump also said Putin's strategy was \"genius\" and \"pretty savvy\" and appeared to praise his military might.",
    "\"Trump's interests don't seem to align with the interests of the United States of America.\"",
    "He's going to go in and be a peacekeeper,\" Trump said.",
    "That's the strongest peace force I've ever seen.",
    "There were more army tanks than I've ever seen.",
    "We could use that on our southern border.",
    "They're going to keep peace, all right.\"",
    "\"That's the strongest peace force.",
    "\"I said, 'How smart is that?'",
    "Rep. Liz Cheney (R-Wyo.)"
  ]
}