{
  "id": 427,
  "mediaId": 43,
  "date": "2/22/2022 12:00:00 AM",
  "headline": "Should Fear Mike Pence  as a Libertarian Presidential Candidate",
  "image": "https://images.dailykos.com/images/1040960/story_image/PencespeakingtoFederalists.jpg?1645577685",
  "link": "https://www.dailykos.com/story/2022/2/22/2081792/-Trump-Republicans-Should-Fear-Mike-Pence-as-a-Libertarian-Presidential-Candidate",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1321,
    1434,
    1557,
    1759,
    2087,
    3094,
    240,
    284,
    2661
  ],
  "sentences": [
    "For example, many would agree with Representative Liz Cheney when she says, I'm a constitutional conservative, and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.?\n It is a strategy that conservative politicians like Cheney might see an independent presidential campaign, working in alliance with the Libertarian Party, as necessary to restore the Republican Party.",
    "There is no viable path to being the GOP presidential nominee without Trump's MAGA supporters, who won't support anyone publicly rebuking the former president.? Consequently, Setmayer declared that Pence's political career was right on top of a heap of ash for telling the gasping Federalist Society that Trump was wrong? and un-American? for wanting Pence to reject certification of Joe Biden's win.",
    "We hope safety for all those who work in the Capitol.? Instead, the RNC chairwoman Ronna McDaniel identified the January 6 insurrection as ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol.?\n Pence is not a dynamic speaker like Trump or DeSantis, rather he is seen as a somewhat dull and everyday politician.",
    "Vice President Mike Pence has described himself as a Christian, a conservative and a Republican, in that order.? Pence's beliefs could be acceptable to Libertarians as long he accommodates their principles of opposing government censorship in any form, opposing all government interference with private property, and prohibiting initiation of physical force against others.",
    "Mike Pence on Trump: I can tell you that we parted amicably at the end of the administration and we talked a number of times since we both left office.' Photograph: Bernadett Szab/Reuters\nFormer President Donald Trump has repeatedly hinted that he will run again for President.",
    "That same day the Republican National Committee passed a resolution censoring fellow Republicans Reps. Liz Cheney of Wyoming and Adam Lininger of Illinois for joining the bi-partisan congressional committee to investigate the January 6 insurrection.",
    "He ended this month's influential Conservative Political Action Conference saying, Who knows, I may even decide to beat them for a third time.? Florida Governor Ron DeSantis is most often mentioned as emerging as Trump's primary opponent.",
    "A CNN Poll conducted by SSRS from January 10 through February 6 shows that Republican and Republican-leaning voters are about evenly split between wanting their party to nominate Trump again (50%) or wanting a different candidate (49%).",
    "Number crunchers have argued that Ralph Nader may have taken enough votes away from incumbent Vice President Al Gore in New Hampshire and Florida to allow George H. W. Bush to win the 2000 election by electoral but not popular votes.",
    "Critics accuse Green Party candidate Jill Stein of taking votes away from Hillary Clinton in the three Democratic-leaning Rust Belt states of Michigan, Wisconsin, and Pennsylvania, which allowed Trump to win the 2016 race.",
    "A recent GOP pollster Tony Fabrizio, who previously did polling for Trump's 2020 campaign, shows support for Pence at 19 percent and DeSantis at 17 percent among GOP primary voters without Trump in the mix.",
    "The Libertarian Party would gain a unique opportunity to garner more votes than any prior third party had since the formation of the Republican Party, which saw the dissolution of the Whig Party.",
    "On January 6, for instance, DeSantis invited nine social media stars to Tallahassee to stop at the governor's office, have dinner at the governor's mansion and go for drinks at a local lounge.",
    "While the Libertarians come from both sides of the political spectrum, a Pew poll taken in the late summer of 2016 showed that 11 percent of them leaned to Republicans, 7 percent to Democrats.",
    "For example, although no former Vice President has ever run against his former President from the same party, a former president ran against his former vice president, an incumbent president.",
    "In other words, he could be a safe candidate for conservative Republicans who, like Pence, believe in following the constitutional rules and norms even when they don't validate your desires.",
    "Although David died in 2019, Charles Koch and other reactionary billionaires could pump money into a Pence campaign if Trump snuffs out his opposition within the Republican Party.",
    "While serving in the House of Representatives, Pence was rated as a far-right Republican leader based on an analysis of bill sponsorship by the non-partisan GovTrack website.",
    "These polls show that Pence could hook up with the Libertarian Party to avoid the internal Republican Party blood bath if Trump is challenged in the Republican Primary.",
    "Instead, the electoral voters are committed to the candidate, allowing the electoral votes to be combined to a single candidate when presented to Congress for a count.",
    "This approach may also appeal to many non-activist Republicans who are disgruntled with Trump, either as individuals or organized into groups like the Lincoln Project.",
    "In the 1912 election, Republican Theodore Roosevelt running under the Progressive Party, cost Republican Howard Taft to lose the election to Democrat Woodrow Wilson.",
    "On the issue of abortion, which Pence has intensely opposed, the Libertarian Party recognizes that its membership includes both pro-choice? or pro-life? advocates.",
    "Nevertheless, the New York Times reported that DeSantis is refusing to commit to clear the way for Trump if the ex-president jumps into the 2024 presidential race.",
    "As the U.S. Capitol building was being breached, Libertarian National Committee Chair Joe Bishop-Henchman issued the following statement: This is not patriotism.",
    "Given the make-up of the Supreme Court, Pence doesn't need to do much on abortion other than support state rights to regulate it out of existence as they choose.",
    "One that could slice off a significant number of Republican and conservative independent voters in the general election to eliminate Trump's chance of a victory.",
    "So, the political insiders and pundits chalk up Pence, once the undying loyal and servile Vice President to Trump, as now locked out of his party's wheelhouse.",
    "Consequently, a Libertarian-backed Presidential candidate would hurt the chances of a victory by a Republican candidate more than a Democrat in swing states.",
    "Each of the attendees, including those from Fox News, New York Post, Turning Point USA, and the Claremont Institute, had more than 95,000 Twitter followers.",
    "Four years later, Pence's Republican successor as Indiana Governor won with a 24% victory margin, while Trump's presidential victory margin slipped to 16%.",
    "Tara Setmayer, former GOP congressional communications director, summed up conventional logic last week on the NBC website that paints Pence as a loser.",
    "Liberals and moderates will vehemently fight against Pence's reactionary policies that block social justice and environmental protection legislation.",
    "For instance, he skipped the opportunity to speak at the critically important CPAC conference, while Trump and DeSantis were featured, speakers.",
    "All states, but two, use party block voting (PBV), in which all the state's electoral votes go to a party's candidate that won the popular vote.",
    "So, what do the Libertarians have to offer Pence to offset going down the primary rabbit hole in the hope of getting the Republican nomination?",
    "For Pence to get the electoral votes in a state, he must run as a candidate from a new Republican-like third-party or the Libertarian Party.",
    "For instance, Billionaire David Koch ran on the Libertarian Party ticket in 1980, contributing $2 million, worth $7 million in 2022 dollars.",
    "Aside from raising critical issues, a third-party candidate can spike the chances of either of the major parties' presidential candidate.",
    "So, if Pence won a state as a Libertarian or as a New-Republican candidate, the electoral voters would still be pledged to Mike Pence.",
    "His idea that government is the problem, and the free market is the solution to everything has been embraced by the Republican Party.",
    "But even in comparison to Republican Donald Trump, he has the credentials for running as the most winnable right-wing candidate.",
    "But the real threat to a future Trump-dominated Republican Party comes from his former Vice President Mike Pence, not DeSantis.",
    "However, it would acknowledge the peaceful transfer of executive power every four years, which Trump-Republicans do not accept.",
    "Still, since its formation in 1984, they have consistently outpolled the largest leftist party, the Green party, three to one.",
    "If both endorsed Pence as their candidate, just one of them would sponsor him in a state to not divide his vote in that state.",
    "However, his extreme conservatism is not coupled with unquestionable loyalty to one man's autocratic vision for this nation.",
    "With this strategy, Pence gains an invaluable social and political infrastructure for getting on the ballot in every state.",
    "That battle lands at the feet of the RNC, whichcontrols the party's presidential primary and the nominating convention.",
    "However, Trump gets 51 percent support when his name is added, trailed by Pence at 9 percent and DeSantis at 7 percent.",
    "His policies are almost identical to Trump and DeSantis's, but his demeanor is closer to good-old plain Joe Biden's.",
    "Nick Licata is the author of Becoming A Citizen Activist and Student Power, Democracy and Revolution in the Sixties.",
    "He is the founding board chair of Local Progress, a national network of over 1,000 progressive municipal officials.",
    "The Libertarian Party also is the only third-party registered in all fifty states to run a presidential candidate.",
    "For example, in 2016, the Libertarian candidate for governor got 3.2%, but in 2020 their candidate received 11.4%.",
    "Having been hijacked by Trump, taking back their? party could be the backdoor to funding Pence's campaign effort.",
    "His margin of victory was less than Green Party presidential candidate Jill Stein's vote count in those states.",
    "That slippage could be seen as totally due to Trump and not Pence since he was continually in Trump's shadow.",
    "That's because Pence might just have enough sense to realize that he will not get the Republican nomination.",
    "And like the Trump-Republicans, they are overwhelmingly white (94 percent) predominantly male (68 percent).",
    "The Daily Mail reported how DeSantis is preparing for a showdown with Trump by working media influencers.",
    "Fifty-one percent of the nationwide Republican base view him favorably  up from 43 percent in mid-May.",
    "Overall, a workable relationship for a campaign could be had between Pence and the Libertarian Party.",
    "And the New-Republican party could see its candidate not be shut out from obtaining electoral votes.",
    "A majority of Republicans (54%) favored Trump, compared with 38% of Republican-leaning independents.",
    "He may lose the election, but a new or revitalized non-Trumper Republican Party might just result.",
    "The Koch Charles and David brothers did not initially support Trump and have been critical of him.",
    "In other words, overall, Republican and Independent conservatives are open to another candidate.",
    "An earlier 2012 survey found only 5 percent called themselves Democrats or liberals (3 percent).",
    "A new entity could emerge which would be just as conservative as the current Republican Party.",
    "Other past third-party attempts have derailed an incumbent or favored candidate from winning.",
    "As the Indiana Governor, FiveThirtyEight ranked him as the second most conservative governor.",
    "However, Libertarian candidates have never garnered more than 4% in a Presidential election.",
    "By avoiding the dead-end Republican primary, he could become a viable third-party candidate.",
    "DeSantis' reputation as a fighter makes it more likely to battle Trump within the party.",
    "However, the party believes these views should remain matters of individual conscience.",
    "First, without hesitation, Libertarians publicly condemned the January 6 insurrection.",
    "Pence gave that speech smack-dab in the middle of Donald Trump's Mar-a-Lago compound.",
    "It conceivably happened most recently with Green Party candidates in 2000 and 2016.",
    "Funding this unique amalgam may well come from billionaires like the Koch brothers.",
    "Roosevelt ran to the left of both the Republican and Democratic candidates.",
    "There is another factor that accounts for the drop, the Libertarian Party.",
    "But, seriously, didn't he know criticizing Trump was tantamount to heresy.",
    "Pence's record helps him with the reactionary Republican voter base.",
    "This is reprehensible violence and aggression and needs to stop now.",
    "Pence has also been making the rounds but in a quieter undertaking.",
    "The constitution does not obligate candidates to run from a party.",
    "Pence would be running to the right of the Democratic candidate.",
    "The electoral voters swear to vote for their party's candidate.",
    "in 2016, Trump won the state with a 19% victory margin.",
    "Pence was the Governor of Indiana, a solidly red state.",
    "Subscribe to Licata's newsletter Citizenship Politics",
    "Still, Trump is not an unbeatable juggernaut.",
    "He knows that the odds will be against him.",
    "They are a growing force in Indiana.",
    "With Pence on the ticket as V.P.",
    "Here's the final kicker.",
    "But wait just a moment.",
    "And Trump owns the RNC.",
    "This is not protesting."
  ]
}