{
  "id": 428,
  "mediaId": 43,
  "date": "2/22/2022 12:00:00 AM",
  "headline": "The Myth of Instant Gratification",
  "image": "https://images.dailykos.com/images/794536/story_image/bluepath.jpg?1587383935",
  "link": "https://www.dailykos.com/story/2022/2/22/2081555/-The-Myth-of-Instant-Gratification-GNR-for-Bluesday-2-22-22",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1732,
    1732,
    2030,
    2030,
    2214,
    2214,
    2300,
    2300,
    2475,
    2475,
    925,
    925,
    1326,
    1326,
    1248,
    1248,
    1145,
    1145
  ],
  "sentences": [
    "Open Letter to Republicans\n[Sent to me by REDACTED, who skillfully retrieved it from the intertubes]\n Portrait of a Loser\nTalented and well-practiced in every vice, a stranger to compassion or empathy, a liar and a cheat so complete in perfidy that he has elevated his dishonesty to hold it up as an ersatz moral principle, violent, so long as he can order someone else to do the dirty work, grotesque in body, graceless in action, in possession of a wounded self-regard so colossal as to smother any spark of grace, treasonous, not only to country, but to every ally he has ever had, the poisoned fruit and rankest flower of racism and contempt for women, and utterly devoid of shame for his moral and spiritual bankruptcy.",
    "I think she's going to have another book ghostwritten for her, with the tentative title, How a Gabbard Changed Its Spots?\nRolling Stone: Tim Dickinson: Tulsi Gabbard to Speak at CPAC, Joining Its Great Un-Wokening'\nTulsi Gabbard, the former Hawaii congresswoman who sought the 2020 Democratic nomination for president, is completing her metamorphosis from iconoclast progressive to hardcore conservative by appearing as a featured guest at the Trumpy love-in known as the Conservative Political Action Conference.",
    "Irresponsible pundits, reporters and that boorish loudmouth at the end of the bar are busy pushing their, The end is nigh? doom and gloom mindset by focusing on falsely manufactured crises (CRT or border caravans come to mind), worst case scenarios (Putin has won or TFG will get away with it) or inaccurately blamestorming real issues without providing context or actual fact (the current frenzy over inflation).",
    "The three cases are: Swalwell v. Trump, in which Democratic Rep. Eric Swalwell sued Trump, Rudy Giuliani, Don Jr. and GOP Rep. Mo Brooks; Thompson v. Trump, in which 11 Democratic representatives sued the former president, his lawyer, and both the Proud Boys and the Oath Keepers; and Blassingame v. Trump, in which two Capitol Police officers seek to hold Trump to account for their injuries on January 6.",
    "In addition to various tort claims, all the plaintiffs sued under a theory that Trump and the other defendants conspired to violate the Ku Klux Klan Act of 1871, a Reconstruction Era statute that makes it illegal to impede a government official carrying out his or her official duty, in this case the certification of Joe Biden's Electoral College win and the peaceful transfer of power.",
    "And in addition to Ramthun, there's another gubernatorial candidate, Kevin Nicholson  who is openly warring with the state party, casting its chair as part of a broken machine.?\nOne Republican Finds Out Asking Russians for Election Help Is Illegal\nIt turns out that following the example of their Dear Orange Leader might not have been the best avenue for staying out of legal trouble.",
    "The proposal would allow voters to request absentee ballots for all future elections, require the state to keep its existing voter ID requirements, let election officials accept third party donations, and ensure that any military or overseas ballot postmarked before Election Day and received within six days after an election still is counted.",
    "Slate: Daniel Politi: Trump's Social Media App Gets a Glitchy Debut (and Maybe Legal Trouble)\nFormer President Donald Trump's Truth Social app got its official debut on Apple's App Store but it appears most people who wanted to experience what has been widely described as a Twitter knockoff were met with frustration and a long waitlist.",
    "Salon: Nicole Karlis: COVID \"long-haulers\" may have finally found relief in inexpensive, over-the-counter drugs\nTwo women have recovered from post-acute sequelae of SARS-CoV-2 infection (PASC), a condition more commonly known as long COVID  and researchers believe that inexpensive, over-the-counter antihistamines were the reason.",
    "Based on recent news brought to our attention by various media outlets, showcasing the similarities between our own Trailar logo and the Truth Social logo, we are now seeking legal advice to understand next steps and options available to protect our brand,? Matthew Summers, head of marketing at Trailar, said in a statement.",
    "Just mentioning a fact of geography...and science..)\nFebruary 22s that have been waiting FOR-EVAH to do that 222222222 thing, so here it is, and here are some of the prior Feb. 22s that have had to be satisfied with various Good and Goofy stuff that have NOT BEEN mathematically symmetrical, repetitive or astronomically odd.",
    "Huffington Post: Mary Papenfuss: Canadian Official Schools Truckers On How Their Protests Aren't About Freedom\nA Canadian government official on Sunday powerfully pointed out how truckers' bullying, destructive weeks long shutdown against COVID-19 vaccines and other health measures does not constitute a fight for freedom.",
    "In fact, the permit expressly stated that it did not authorize a march from the Ellipse.? From these alleged facts, it is at least plausible to infer that, when he called on rally-goers to march to the Capitol, the President did so with the goal of disrupting lawmakers' efforts to certify the Electoral College votes.",
    "The Detroit News: Beth LeBlanc: Michigan groups seek 9 days of early voting, kill Legislature-adopted petitions\nMichigan voting rights groups on Monday launched a petition that would open polls nine days before election day for early voting and require the state to pay for absentee ballot postage, among other ideas.",
    "Daily Beast: Eleanor Clift: Nothing Can Prevent the RNC's Unholy Alliance With Trump\nThe Republican National Committee makes no apologies for picking up the tab for former President Donald Trump's legal bills, even when the fees have nothing to do with his official duties, or its mission as a political party.",
    "Raw Story: Sarah K Buris: Failed Rhode Island GOP candidate illegally asked Russian intel to help him win election: FEC documents\n\"Russia, if you're listening,\" was the plea that former President Donald Trump made in 2016 as he desperately tried to find some bit of \"dirt\" to bring down Hillary Clinton.",
    "Normally this would be simply thrown away, comporting a loss for those who often can't afford it, but now women in Maharashta in the west of India are being hired to operate specially-designed solar conduction dyers that suck every detectable trace of moisture out of the food within just four hours.",
    "They were greenlighted for a rally on the Ellipse, but it was Trump and his minions who decided they would sic the MAGA mob on Congress:\n[From Judge Mehta's ruling:]\nImportantly, it was the President and his campaign's idea to send thousands to the Capitol while the Certification was underway.",
    "Until Lincoln's proclamation of a Day of Thanksgiving, Feb. 22 was the only fixed national holiday aside from July 4 observed in the US (Even the Confederacy chose this date in 1861 to inaugurate Jefferson Davis as a supposed sign of continuity back to the mantle of Washington.)",
    "New Yorker: Satire from the Borowitz Report: Trump Produces Podiatrist's Letter to Avoid Serving in Russian Army\nPALM BEACH (The Borowitz Report)Donald J. Trump has produced a letter from his podiatrist to avoid serving with the Russian forces massing on the border of Ukraine.",
    "Fought in the French & Indian War and learned the art of war the hard way, but bravely: 1 fight put 5 bullet holes in his coat from enemy fire yet he was not wounded or killed; had to surrender his post to superior French forces and was later exchanged as a prisoner of war.",
    "In recent weeks, several county parties have called on the state's longtime Republican Assembly speaker, Robin Vos, to resign, accusing one of Wisconsin's most reliable conservatives of doing too little to pursue baseless claims the 2020 election was rigged.",
    "I don't think they are telling people, 'Write a check so we can defray the former president's legal expenses from before he was in office.' Wouldn't that make an interesting fundraising appeal?? says Norm Eisen, an expert on government corruption and ethics.",
    "The news comes from a report published this month in The Journal for Nurse Practitioners which describes the recovery of two middle-aged women who, by chance, found that antihistamines greatly improved their daily functions after suffering from long Covid.",
    "While, say, in 11 states south of the Mason-Dixon line a pair of shoes needs about 3 days to make, here a factory line could make a pair in about 10 minutes..times 8 or 10 or 12 lines/ factorywill be real handy if, say, an Army would place a large order.)",
    "?\nThe glitches shouldn't be all that surprising considering that Truth Social CEO Devin Nunes, who is a former Republican congressman, told Fox News on Sunday that the goal was for the app to be fully operational in the United States by the end of March.",
    "Wonkette: Liz Dye: Court Rules Trump Can Be Sued For Inciting Mob On January 6\nOn Friday, approximately five seconds after we posted about \"Trump's Terrible Horrible No Good Very Bad Week In Court,\" the old goat got yet more bad news on the legal front.",
    "There are a lot of misguided voters out there who get their misinformation spoon fed to them through a vast propaganda network, coupled with the failures of our for-profit news media to combat the pervasive lies of the pluto/theocracy's FUD2 factories.",
    "Ron DeSantis, Republican senators Ted Cruz, Rick Scott and Marco Rubio, and Representatives Matt Gaetz, Jim Jordan, Lauren Boebert, Madison Cawthorn and Marjorie Taylor Greene  in building buzz for the star of the circus, former President Donald Trump.",
    "The proposed constitutional amendment appears to counter the efforts of separate petition initiatives, Secure MI Vote, which would tighten voter identification rules, and Audit Michigan, which would set up an audit board made up of party delegates.",
    "Up the Resistance\n(to continuing republican depredations)\nJohn Oliver took apart the howling crowd of MAGAots decrying Critical Race Theory and then gave them all a bad case of indigestion from the obvious necessity of eating their empty words.",
    "Excess produce like tomatoes, garlic, onions, ginger, coconut, chilies, and corn are then turned into easy-to-use products and sold to 1.100+ food and beverage industry customers of the solar dryer's creator, S4S, or, Science 4 Society.",
    "GoodNewsNetwork: Andy Corbley: Using the Sun to Fight Food Waste Through Innovative Food Dehydrators\nFarming households in rural India are earning extra money for their food that goes unsold by putting it through solar food dehydrators.",
    "Aid flowed to battered Europe, the Marshall Plan gave hope to millions, displaced persons would NOT be forced home to Stalin-land if they didn't want to go, the western part of Germany would be resurrected, and NATO would be invented.",
    "It will bring a mark of everlasting infamy on the present generation  enlightened as it is  if we should suffer them to be wrested from us by violence without a struggle, or to be cheated out of them by the artifices of designing men.",
    "There should be a law against such an obvious conflict of interest, but there isn't, even though the Federal Election Commission for years has urged Congress to extend the personal use ban? to funds received from the party committees.",
    "Sometimes they are on to something: we use computers for endless things these days but apart from specialists you and I rarely use a computer to compute (numbers via formulas and calculations---at least consciously.)",
    "Later asked to preside over the Constitutional Convention where he was recorded as saying almost nothing, except he let it be known he was flatly NOT interested in becoming king (which was easily open to him.)",
    "Taub pleaded guilty although he was excused from having to pay for a $31,000 fine for this infraction due to financial hardship that resulted from getting previously convicted for defrauding political donors.",
    "(And now I know what the F and W stood for in those Woolworth stores..)\n 1924 Washington, DC In a forgettable speech, President Calvin Coolidge nonetheless ushers in a new age in Presidential communication.",
    "Because of the Academy, no one in France would ever use the term le weekend', and Renault Motors would never dream of painting a stripe on the side of some of their small cars with the fake term Le Car'.",
    "Politico: David Siders: Republicans wince at Wisconsin GOP crack-up\nMILWAUKEE  Timothy Ramthun's entry into Wisconsin's gubernatorial primary last weekend was the car wreck no one could look away from.",
    "Our metric should, instead, be Do we see signs of progress?? Especially since the insurrectionist, bomb throwing wing of the republican party is actively trying to derail any and all actual progress.",
    "Then, just to let EVERYBODY know where they stand, the 3 Presidents yesterday called on the EU (of which they are members as well) to IMPOSE SANCTIONS NOW on Putin for his peacekeeping' shenanigans.",
    "There have been uses of remote and distance learning for decades (a number of children in the Australian Outback graduated from high school after 12 years of shortwave radio classes, for instance.)",
    "In it he expressed his professional opinion that the Soviet regime was fundamentally insecure, that it was unalterably opposed to the US, and held designs on the world for violent destabilization.",
    "In 1781 dared a 500-mile march from New York to Virginia on little more than the promise of a French fleet and the hope it could beat a British fleet, and bagged Cornwallis' army at Yorktown.",
    "Everyone passed the bowls after the 2nd half kickoff\n 1635 Paris At the urging of Cardinal Richelieu (in between sword duels with the 3 Musketeers, no doubt) urged a plan on King Louis XIII.",
    "If his cult followers weren't such rabid no-nothing, see-nothing nincompoops, congressional republicans would have shown signs of vestigial spines and all this could have been over long ago.",
    "The Puritans noted the local folk introduced them to a kind of (pop)corn that was exceptionally hard in the kernels, but when exposed to high heat, would burst inside out, making it edible.",
    "You have demonstrated not only a lack of civic virtue, loyalty to the Republic and to the rule of law, but a willingness to engage in violence and sedition at his slightest expressed wish.",
    "The Providence Journal revealed that H. Russell Taub, a Republican running against U.S. Rep. David Cicilline (D-RI), reached out to to the Russian intelligence agency, the GRU, on Twitter.",
    "Proof of the idea started this day when Columbia University finished an experiment, complete with mailed-in papers and exams and declared radio education (at the college level) a success.",
    "Although Trump has not yet been drafted into the Russian Army, he has been living in terror? of receiving a draft notice from Vladimir Putin, a source close to the former President said.",
    "The United States population has had a cumulative 78 million cases of COVID-19, meaning around 8 million Americans have long Covid symptoms long after the virus has cleared their system.",
    "And in a declaration just as dead-on south of the border, he noted: A lie is not the truth.?\nGOP Meltdown in Cheeseland\nThere's been a massive breakout from a 2020 Big Lie cult revival.",
    "According to the conference agenda, Gabbard will appear at the Friday night Ronald Reagan Dinner,? where the keynote speaker is the former Fox News star conspiracy theorist Glenn Beck.",
    "The Acadmie was/is responsible for the regulation of French grammar, orthography, and literature and the prime reason French is a far more grammatically regular language than English.",
    "Long Covid sufferers experience all kinds of different symptoms, though the most common include brain fog, psychiatric disorders, loss of taste and smell, fatigue and lack of energy.",
    "The Pentagon wanted to provide precise navigation anywhere and everywhere for its forces, but the system has been opened to civilian use, now known as the Global Positioning System.",
    "Tens of thousands of tons of food in India goes to waste every year, often because it doesn't look appealing enough, or because there's no access to refrigeration to keep it fresh.",
    "The Promote MI Vote 2022 ballot initiative also would ensure secure ballot drop boxes in every community and a tracking system for voters to track the status of absentee ballots.",
    "When you start a company with inspiration from a failed orange quasi-human and his failed henchweasel Devin He Sued a Cow? Nunes you are setting up for failure on a cosmic scale.",
    "When those brave kids from Marjorie Stoneman Douglas stood up at the podium and called BS on the gun lobby's shills, like Little Marco, they dented their aura of invulnerability.",
    "Having TFG doing his very best orange albatross impression while he's about to crash and burn in court is dragging down the ability of the RNC to sabotage the midterm elections.",
    "Today's Decadent Libation\n Cherry Ripe Martini\n Poll\n 166 votes Show Results\n On a scale of 0 to 1 (with one being exceedingly) how tired are you of republican lies and liars?",
    "And there was Stalin..with millions of troops on a war footing, camped along the Elbe River, sunning themselves on the Adriatic coast, eating rations from Estonia to Albania.",
    "x\nx\nWineRev's History Lesson\nOur resident history professor's always interesting history lesson will appear here as soon as I notice he's posted it in the comment section.",
    "Last night's Evening Shade: PRESIDENT JOE BIDEN---DAY397---SECOND YEAR DAY33---Evening Shade-Monday\nWe haven't closed out with anything featuring Pigpen in quite a while.",
    " Samuel Adams\nThe liberties of our country, the freedoms of our civil Constitution are worth defending at all hazards; it is our duty to defend them against all attacks.",
    " Alexander Hamilton\nIt is only when the people become ignorant and corrupt, when they degenerate into a populace, that they are incapable of exercising the sovereignty.",
    "To make that even simpler for both the customer and the cashiers, on this day Frank Winfield Woolworth's store opens with signs and the motto 'Nothing over five cents.'",
    "His campaign is built around the preposterous idea the 2020 election could still be overturned  something even sympathetic Republicans here acknowledge is impossible.",
    "No matter how ungainly, inept or stupid legitimate political discourse? appears to the average American, it is still, at least, a speed bump on the road to recovery.",
    "Other local party leaders are objecting to  or considering ignoring  the state party's endorsement process in critical midterm elections, arguing it's exclusionary.",
    "Up to 10 percent of those who contract COVID-19 have long-term symptoms long after the virus has cleared their body, according to University of Alabama researchers.",
    "1630 Plymouth, Massachusetts There was a midwinter feast between the Native people and the Puritan settlers (a Thanksgiving Day; the date was fluid to start with).",
    "A strategic thinker, inspirational leader, often hindered by fellow generals appointed by Congress due to political influence rather than military talent (see e.g.",
    "He and his father watched in their living room as THAT US team beat the Soviets for the gold medal----before the Russians became invincible for the next 20 years.",
    "That Vise Crushing TFG's Dangly Bits Got Another Turn Tighter\nTFG has officially now had more shoes dropped on him than anyone else in American political history.",
    "These people do more to serve the aims of the people out to destroy democracy (aka the republican party) than they do toward moving progressive policies forward.",
    "1860 Lynn, Massachusetts There may be a Civil War brewing (we'll know more after the November elections) but something much more immediate needs to be addressed.",
    "The Academy has decreed the official French word for these devices should be le informatique'---on grounds we incessantly use these machines to find information.",
    "If all three are adopted, Promote MI Vote's constitutional language would likely trump the audit and Secure MI Vote proposals because they only amend state law.",
    "US District Judge Amit Mehta rejected Donald Trump's motion to dismiss, ruling that three cases arising out of his conduct on January 6, 2021, can proceed.",
    "Social media users pointed out that Truth Social's logo was strikingly similar to one used since at least 2019 by Trailar, a British green energy company.",
    "US President Harry Truman, under no leftover illusions from Roosevelt to handle Stalin?, redesigned American foreign policy to limit the effects of Yalta.",
    "Real Roundup Starts Here\nIf life was a typical morality play, all of our outstanding conflicts and issues would be resolved by the end of the third act1.",
    "On the plus side, we can watch the slow drip of cult members waking from their nutjob coma and slithering back to their padded bar stools of ignorance.",
    "And if the ruling holds  a big if with those six goons squatting at SCOTUS  it's a virtual certainty Trump will be going under oath for discovery.",
    "Others of the same type would follow for several years and they all linked together to report their positions relative to any spot on our planet.",
    "He sent it to Felix Mendelssohn, who was so impressed and delighted he arranged to conduct its premiere Leipzig, where it received great acclaim.",
    "42 stations across the country were connected by telephone lines to carry the broadcast (which the nerds and geeks of the day called a network?.)",
    "From late 1971 (over 50 years ago), here's Pigpen belting out a very tasty version of Mr. Charlie (with Bobby and Jerry harmonizing behind him).",
    "1879 Utica, New York General stores are evolving away from store clerks trotting around from shelf to shelf to assemble a customer's order.",
    "(I have personally noticed the microchip soldered onto the tin can I use to call' people through the smart string', so this explains it.)",
    "Another Way for Us to Circumvent Republican Voter Suppression Shenanigans\nThis ballot initiative in Michigan is one to keep an eye on.",
    "In one message to Guccifer 2.0, Taub told the Russian intelligence officials that he could \"use your help to defeat cicilline (sic).\"",
    "After an initial dust-up over the RNC paying his lawyers, Trump threatened to bail on the GOP, hinting he might form a third party.",
    "?\nAs for Trump, he wasn't all that much slicker, summoning the crowd to DC on January 6 with his infamous \"Be there, will be wild!\"",
    "Let us by all wise and constitutional measures promote intelligence among the people as the best means of preserving our liberties.",
    "Produced 8 symphonies and a large number of elaborate cantatas, along with a number of chamber music works and several concertos.",
    "The Oath Keepers, the Proud Boys, and others who forced their way into the Capitol building plainly shared in that unlawful goal.",
    "A hefty subset of our population expects their entire world view to be validated and implemented by sometime yesterday afternoon.",
    "You should have used my idea for a poll, that I didn't bother to share with you, but will, in my slightly above average comment.",
    "You should have used my idea for a poll, that I didn't bother to share with you, but will, in my slightly above average comment.",
    "They will have the same effect here as elsewhere, if we do not, by the power of government, keep them in their proper spheres.",
    "Estonia, Latvia and Lithuania ARE members of NATO and ARE democracies and NO, they are NOT interested in a re-assembled USSR.",
    "Everyone sane shares the frustrations of watching shameless criminals wandering around, bragging about their treasonous acts.",
    "Unfortunately, the entire republican congressional backbone is currently residing entirely in Liz Cheney and Adam Kinzinger.",
    "But something that may have been a bit more unexpected is that there was controversy over the app's logo from the first day.",
    "Does anyone think that would have happened if we hadn't continued to push back against the manufacturers of murder weapons?",
    "Gade was soon appointed director of the Leipzig Conservatory but had to leave in 1848 when Prussia and Denmark went to war.",
    "This day American diplomat George Kennan sends a set of 5 cables to the State Department, known now as the Long Telegram.\"",
    "12%\n20 votes\nUm, booze please Cherry Ripe Martini (Chocolate topping (or dessert sauce), desiccated coconut, coconut milk.",
    "We were bouncing off the walls, whooping it up, passing around Lutheran beer..and then the game started.and time stopped.",
    "A blockade is not freedom, it blocks the liberty of all,? tweeted Bob Rae, Canada's representative to the United Nations.",
    "His three-hour campaign kickoff featured the appearance of Mike Lindell, the pillow salesperson and conspiracy theorist.",
    "He was part of the exhibitions and training gamesand the last man cut from the team before the Squaw Valley Games began.",
    "(These factories in New England used steam- and belt-driven machinery for a good bit of the leather cutting and sewing.",
    "1946 Washington DC The Yalta Conference between Stalin, Roosevelt and Churchill had been held back in January of 1945.",
    "Here in town a new store allows customers to pick out their own goods and bring them to the counter to pay for them.",
    "x\nx\nDisclaimer: I don't think a republican would recognize legitimate political discourse? if it bit him on the ass.",
    "[28:07]\nx\nx\nAnd one more to help us get started, Eminem* responded to Rudy Giuliani's ridiculous anti-kneeling rant.",
    "No, I do not respect your choices,? nor do I admire your loyalty and dedication to this miserific, demoniac vision.",
    "Took to the violin at an early age and his talent carried him to membership in the Copenhagen Orchestra at age 22.",
    "First US President and voluntarily stepped down after 2 terms to set a lasting example for the transfer of power.",
    "Now they are in a bloody fight with some slightly less deranged members of the regular republican dead-end cult.",
    "CPAC 2022 begins Wednesday in Orlando, where Gabbard will join a roster of GOP loyalists  including Florida Gov.",
    "It's Tim time,? Ramthun, a state lawmaker, told supporters, while political professionals in Wisconsin cringed.",
    "The strike began in Lynn and Natick, Massachusetts, spread throughout New England, and involved 20,000 workers.",
    "In a country where intense heat can spoil food within days of harvesting, it can also keep it safe for months.",
    " Benjamin Franklin\nNo character, however upright, is a match for constantly reiterated attacks, however false.",
    "Um, booze please Cherry Ripe Martini (Chocolate topping (or dessert sauce), desiccated coconut, coconut milk.",
    "He is what you would be, if you had inherited money and could shed the last vestiges of conscience and shame.",
    "Musical Interlude\nKansas Joe McCoy and Memphis Minnie wrote a song about the great Mississippi flood of 1927.",
    "So last month, with an OK from NATO, the 3 are transferring MISSLES to Ukraine..for vacation..or something.",
    "Charles Lee, Horatio Gates) and handicapped by trying to defend a seaboard fledgling nation without a navy.",
    "It's been 42 years, and I was at seminary in hockey-mad Minnesota; all of us in the TV lounge in Stub Hall.",
    "A new era DOUBLEHEADER DATE New York City Long before Covid-19, Zoom was invented, and before that Skype.",
    "It seems the technical difficulties began pretty much as soon as the app had its debut late Sunday night.",
    "To expect our democratic institutions to instantly rebound after years of neglect and sabotage is absurd.",
    "And then Herb's boys surprised the hell out of them\nMay all your News be Good, comforting and inspiring.",
    "Cherry Ripe chocolate bar, Maraschino cherries)\n Scraping the bottom of the polling barrel, aren't you?",
    "Born into the plantation class and married well, the man was ambitious for fame to go with his fortune.",
    "Slaveowner of over 300, yet willing to risk fortune and property on a long-odds fight for independence.",
    "That if you start a new country, we'll recognize you and send peacekeepers'? CRAP is just that..crap!",
    "By Monday morning the app had experienced a partial outage? for almost 8 hours, according to Insider.",
    "If you want to get the full numerical effect you should wait to read this until 2:22 this afternoon.",
    "~ Advocatus Peregrini\nOn the Lighter Side\nQuote(s) of the Day\nTime for some words from our Founders.",
    "Dr. Bradford Parkinson of Stanford worked with military scientist Ivan Getting to design the system.",
    "Remington went bankrupt and its insurers recently settled with Sandy Hook families for $73 million.",
    "Our job as citizens and as enlightened consumers of news is to push back against all the bullshit.",
    "Now, John Paul Jones returns to lead this Songs Around the World version of When the Levee Breaks.",
    "On a scale of 0 to 1 (with one being exceedingly) how tired are you of republican lies and liars?",
    "On this day at the Winter Olympics, the men's U.S. Olympic hockey team defeated the Soviets 4-3.",
    "2The intentional invocation of Fear, Uncertainty and Doubt through a campaign of misinformation.",
    "Two years later he offered the orchestra his first symphony for a premiere but was turned down.",
    "He got a dossier with opposition research, polling data and other information on the district.",
    "There's Money Trouble in Bizarro Paradise\nThe longer this kind of crap continues, the better.",
    "If you are friends with any Michiganders, you might want to make sure they are aware of this.",
    "I'm glad we got that out of the way and can move on to our inspirational introductory essay.",
    "In 1971 Led Zeppelin featured their version of the song as the last cut on their 4th album.",
    "Wait long enough and those who can recall such events find them becoming markers for aging.",
    "The workers won their major demands for higher wages and included women in the settlement.",
    "In April Roosevelt died of a stroke, Hitler killed himself and in May Germany surrendered.",
    "It's unclear if this information was among the things hacked from the DNC or RNC servers.",
    "We do this by raising our voices in unison; calling out injustice, deceit and treachery.",
    "countries that share a border with Putin-land got their Presidents together last month.",
    "What is the exact flying time again of F-15 NATO fighters in Estonia to St. Petersburg?",
    "Moved back to Copenhagen and was recognized for decades as Denmark's leading composer.",
    "The people themselves become the willing instruments of their own debasement and ruin.",
    " Benjamin Franklin\nWe are all born ignorant, but one must work hard to remain stupid.",
    " Samuel Adams\nThe rich will strive to establish their dominion and enslave the rest.",
    "It wouldn't be the first time Putin commanded him to do something,? the source said.",
    "On this day the King granted letters of patent to establish the Academie Francaise.",
    "They purchased them for us with toil and danger and expense of treasure and blood.",
    "Some of the seniors had played hockey with or against some of the US Team members.",
    "The research will be welcomed by sufferers of long COVID, of which there are many.",
    "There is, most certainly, still a long way to go, but the situation is improving.",
    "All the escapees ran to Wisconsin and joined that state's republican party elite.",
    "Let us, then, look to the great cause, and endeavor to preserve it in full force.",
    "8%\n14 votes\nUmpteen gazillion\n 54%\n90 votes\npi (it's a numerical quiz, isn't it?)",
    "Several knew or had played under Herb Brooks, the University of Minnesota coach.",
    "We've been conditioned to expect a resolution after 42 minutes plus commercials.",
    "I have it on good authority that a very cute kitten will mewl at you if you do.",
    "Indeed, as Judge Mehta notes, there was no permit for the march on the Capitol.",
    "x\nx\nClosing Notes\nThanks for slogging on through to the end of another Roundup.",
    "It caught on across New York and then other states as the first US chain store.",
    " James Monroe\nPressley's Picks\nMy favorite part of the recent football frenzy.",
    "1978 Cape Kennedy, Florida A satellite roars into orbit today for the US Dept.",
    "Remember to stay active and involved, while also looking out for your health.",
    "1817 Copenhagen, Denmark Birth of Niels Wilhelm Gade, violinist and composer.",
    "I guess the moral of this essay is that things don't get better on their own.",
    "The problem for the Wisconsin Republican Party is that it isn't just Ramthun.",
    "The former president is exploiting the weakness in the law to suit his needs.",
    "It is in the interest of tyrants to reduce the people to ignorance and vice.",
    "He delivers the first ever Presidential radio address from the White House.",
    "1732 Westmoreland, Virginia Birth of George Washington, general, statesman.",
    "In July Churchill was voted out of office and Japan surrendered in August.",
    " Gouverneur Morris\nIf everyone is thinking alike, then no one is thinking.",
    "It turns out that another Republican also tried that same tactic in 2016.",
    "And they complain vociferously every day that it hasn't already happened.",
    "Now she's gone ahead and proved our suspicions were right on the money.",
    "For they cannot live in any country where virtue and knowledge prevail.",
    "We have received them as a fair inheritance from our worthy ancestors.",
    "1\n 1,000,000\n Umpteen gazillion\n pi (it's a numerical quiz, isn't it?)",
    "!?---Al Michaels) (They beat Finland 2 days later for the gold medal.)",
    "TFG is the counter example to the maxim that failure breeds success.",
    "The expression of hatred is not a difference of opinion,? Rae added.",
    "Long Covid appears to affect children and adults in equal measure.",
    "There are iconic public events that people date their lives after.",
    "4%\n6 votes\nScraping the bottom of the polling barrel, aren't you?",
    "A Day Without Andy Is Like a Day Without Andy\nI am such a fanboy.",
    "Stretching the Food Supply\nFood waste is a huge problem globally.",
    "Usurpation is then an easy attainment, and a usurper soon found.",
    "The entire party has been erupting on a near-daily basis here.",
    "Canada, Oh Canada\nSome of us have watched the Northern Lights.",
    "Fingers crossed and prayers raised for the Ukraine situation.",
    "Because you see your dark, twisted, resentful dreams in him.",
    "And, when things do get better, it doesn't happen instantly.",
    "The article is from late January, but I missed it back then.",
    "She didn't come off as being either serious or trustworthy.",
    "That sent RNC Chair Ronna McDaniel Romney to the ramparts.",
    "Paying his attorneys is the fealty that the Boss requires.",
    "In his case, failure just breeds more and more failure.",
    "His campaign website went live, only to be deactivated.",
    "Some Hopeful Medical News\nI really hope this pans out.",
    "1Typical morality plays typically last for three acts.",
    "A demand to overthrow a government is not a dialogue.",
    "Yes, the moral arc of history bends in our direction.",
    "He was asked to try out for the 1960 US Olympic team.",
    "We even have a phrase for it  instant gratification.",
    "I mean besides everyone with half a brain, that is.",
    "Cherry Ripe chocolate bar, Maraschino cherries)\n .",
    "Herb Brooks had been a hockey player, a good one.",
    "There was something off about Tulsi back in 2020.",
    "1980 Lake Placid, New York Where were you when.?",
    "x\nx\nHorse are just a large breed of dogs, right?",
    "He lost more fights than he won, yet persisted.",
    "But, that's because we are the ones bending it.",
    "Sometimes You Don't Want to Be Proven Correct.",
    "Until then look for it in the comment section.",
    "And to renounce him is to renounce yourselves.",
    "And you will never, ever admit you were wrong.",
    "creme de cacao liqueur, cherry brandy, vodka.",
    "creme de cacao liqueur, cherry brandy, vodka.",
    "Keep your heads up and keep working together.",
    "We are the reason we will Build Back Better.",
    "Shoe-making workers struck for higher wages.",
    "Because he is a mirror, not a lighthouse.",
    "That is whose banner you willingly carry.",
    "Our activism is what makes things better.",
    "It was not a planned part of the rally.",
    "And let it be NOTED that 3 (count em!)",
    "At Mach 1 its about, what, 20 minutes?",
    "It's nice to see progress being made.",
    "Now we can watch a Northern Example.",
    "That is to whom you give your money.",
    "They always did...they always will.",
    "x\nx\n *not actually Eminem\nSurprise!",
    "Without Trump, there is no party.",
    "This Time It's Kind of a Relief.",
    "There's even some news to share.",
    "That is who you follow and laud.",
    "He then sent his email address.",
    "(Do you believe in miracles??",
    "1\n 19%\n32 votes\n1,000,000\n .",
    "Some have watched Due North.",
    "You see yourselves in him.",
    "hpg keeps on keeping on.",
    "Your country needs you!",
    "Who could have guessed?",
    "Take it away, WineRev!",
    "That is your leader.",
    "Is Anyone Surprised?",
    "Please send popcorn.",
    "166 votes Vote Now!",
    "And here it comes.",
    "We've got this.",
    "Even a Little?",
    "(Oh, and Vlad?",
    "of Defense.",
    "2%\n4 votes",
    "Shalom.",
    "tweet.",
    "Why?",
    "YES!",
    "."
  ]
}