{
  "id": 430,
  "mediaId": 43,
  "date": "2/22/2022 12:00:00 AM",
  "headline": "Who's who: A rolling guide to the targets of the Jan. 6 committee",
  "image": "https://html.scribdassets.com/348yakpow09ggtsa/images/1-92f83870e0.jpg",
  "link": "https://www.dailykos.com/story/2022/2/22/2067807/-A-field-guide-to-the-figures-at-the-center-of-the-Jan-6-probe",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2052,
    2052,
    2016,
    2016,
    1609,
    799,
    799,
    1609,
    1385,
    1385,
    1039,
    1039,
    1145,
    1145,
    1147,
    1147,
    2945,
    2945
  ],
  "sentences": [
    "Women for America First founder and co-founder Amy Kremer and Kylie Kremer\nCaroline Wren, described as VIP Adviser? on the WFAF permit for Jan. 6; believed to be in regular contact with Mark Meadows about election certification, allegedly parked dark money funds with the Republican Attorneys General Association, the young Republican hub Turning Point, and the Tea Party Express\nCynthia Chafian, who submitted the first permit application for WFAF''s Jan. 6 rally, founder of the Eighty Percent Coalition\nMaggie Mulvaney, was listed as VIP Lead? on a permit application filed by WFAF\nJustin Caporale, of Event Strategies, Inc.which received over $2 million in payments from the Trump campaignwas listed as a point of contact and project manager for WFAF rally on Jan. 6\nLyndon Brentnall was listed as an on-site supervisor for Jan. 6 rally permits\nNathan Martin was listed on a permit for the One Nation Under God? rally on Jan. 6; Martin allegedly failed to disclose that he was also associated with the Stop the Steal' event and reportedly told U.S Capitol Police that he was not associated with Stop the Steal'\nTim Unes of Event Strategies, Inc., was listed as a Stage Manager? on permit paperwork filed by WFAF for Jan. 6.",
    "U.S. House of Representatives Washington, D.C. 20515 BENNIE G. THOMPSON, in his official capacity as Chair of the Select Committee to Investigate the January 6th Attack on the United States Capitol; ELIZABETH L. CHENEY, in her official capacity as a member of the United States House of Representatives; ADAM B. SCHIFF, in his official capacity as a member of the United States House of Representatives; JAMIE B. RASKIN, in his official capacity as a member of the United States House of Representatives; SUSAN E. LOFGREN, in her official capacity as a member of the United States House of Representatives; ELAINE G. LURIA, in her official capacity as a member of the United States House of Representatives; PETER R. AGUILAR, in his official capacity as a member of the United States House of Representatives; Civil Case No.",
    "Beyond Facebook, Google, Twitter, and Reddit, informal demands initially went to:\n4CHAN plus CEO Hiroyuki Nishimura\n8KUN plus CEO James Watkins\nGab plus CEO Andrew Torba\nParler plus CEO George Farmer\nSnapchat plus CEO Evan Spiegel\nTelegram plus CEO Pavel Durov\ntheDonald.win plus owner Jody Williams\nTikTok plus CEO Kevin Mayer\nTwitch plus CEO Emmett Shear\nYouTube plus CEO Susan Wojcicki\nZello plus CEO Bill Moore\nThen after the inadequate response cited by Thompson, the committee issued service on Jan. 13, 2021, to:\nFacebook/Meta plus CEO Mark Zuckerberg\nGoogle plus CEO Sundar Pichai\nReddit plus CEO Steve Huffman\nTwitter plus former CEO Jack Dorsey\nPhone record metadata\nIn court, the committee has aggressively pursued the phone records of more than 100 figures related to the Jan. 6. attack.",
    "1st Amendment Praetorian and founder Robert Patrick Lewis; a loose self-proclaimed militia for Trump events and rallies; claimed to provide security detail to Michael Flynn at a march in December and on Jan. 4 tweeted, There may be some young National Guard Captains facing some very, very tough choices in the next 48 hours.?\nStop the Steal LLC, the organization that coordinated the rally at the Ellipse on Jan. 6 and promoted Trump's widespread lies about the election; it is run by Ali Alexander\nElmer Stewart Rhodes; ex-president of the extremist Oath Keepers group who repeatedly called for ways to delay or stop the certification of the incoming Biden administration.",
    "In a statement following the committee's request to the GOP leader, McCarthy said: As a representative and the leader of the minority party, it is with neither regret nor satisfaction that I have concluded to not participate with this select committee's abuse of power that stains this institution today and will harm it going forward.?\nMcCarthy has dodged questions around Jan. 6 from reporters, even running away from one during an exchange this February in the Capitol after the Republican National Committee agreed to censure the probe's only Republican members: Reps. Liz Cheney and Adam Kinzinger.",
    "78, contrary to the Constitution, can be valid.' The court in Hubbard v. Lowe reinforced this truth: That an unconstitutional statute is not a law at all is a proposition no longer open to discussion.' 226 F. 135, 137 (SDNY 1915), appeal dismissed, 242 U.S. 654 (1916).?\nThe latter half of the message was a citation of Alexander Hamilton's writings in the Federalist Papers and a forward of a message Jordan had received from Joseph Schmitz,\nSchmitz, a former Trump campaign aide and onetime inspector general for the Defense Department, advocated for Pence to stop the certification of the election.",
    "Megan Powers of MPowers Consulting LLC was listed on permit paperwork for WFAF as Operations Manager for Scheduling and Guidance?\nHannah Salem of Salem Strategies LLC was listed on permit paperwork for WFAF as Operations Manager for Logistics and Communications?\nBryan Lewis, records have shown, obtained a permit for a rally on Jan. 6 that expressly urged Congress to nullify electoral votes and make illegal changes to voting rules during the election\nEd Martin helped organize the Stop the Steal' movement and was directly involved in coordinating the Wild Protest? event planned for Jan. 6.",
    "Serve: General Counsel and Executive Vice President Craig Silliman 1095 Avenue of the Americas New York, NY 10036 and CELLCO PARTNERSHIP d/b/a VERIZON WIRELESS Serve: General Counsel ATTN: VSAT 1 Verizon Way Basking Ridge, New Jersey 07920 Corporate Phone Number: 1-908-559-5490 Defendants\n COMPLAINT FOR DECLARATORY AND INJUNCTIVE RELIEF AGAINST UNLAWFUL SUBPOENA FOR PLAINTIFF'S TELEPHONE RECORDS\n Plaintiff Ali Alexander at all times relevant herein is a private citizen and a resident of\n Case 1:21-cv-03308 Document 1 Filed 12/17/21 Page 2 of 25\n 3 Fort Worth, Texas.",
    "e report found the election management system to be wrought\n with unacceptable andunlawful vulnerabilitiesincluding access to the internetprobable\n cause to nd evidence of fraud, and numerous malicious actions.ere is also probable cause to nd that Dominion Voting Systems, Smartmatic, ElectronicSystems & Soware, and Hart Inter Civic, Clarity Election Night Reporting, Edison Research,Sequoia, Scytl, and similar or related entities, agents or assigns, have the same aws and weresubject to foreign interference in the 2020 election in the United States.",
    "ere is probable causeto nd these systems bear the same crucial code \"features\" and defects that allowed the sameoutside and foreign interference in our election, in which there is probable cause to nd voteswere in fact altered and manipulated contrary to the will of the voters.Dominion Voting Systems is based in Toronto, Canada, and assigns its intellectual propertyincluding patents on its rmware and soware to Hong Kong and Shanghai Bank Corporation(HSBC), a bank with its foundation in China and its current headquarters in London, UnitedKingdom.",
    "The Washington Post reported in April that Patel was the subject of an inquiry by the Department of Justice due to a complaint filed earlier in the year by an unidentified intelligence agency suggesting Patel repeatedly pressed intelligence agencies to release secrets that, in his view, showed that the president was being persecuted unfairly by critics.?\nPatel has records that investigators believe show how the White House prepared for and responded to the Capitol attack with Defense Department and White House officials.",
    "Coee County Georgia has refused to certify its result.Accordingly, I hereby order:\n (1)\n Eective immediately, the Secretary of Defense shall seize, collect, retain and analyze allmachines, equipment, electronically stored information, and material records required forretention under United States Code Title 42, Sections 174-174(e), including but not limited tothose identied in footnote 1. e Secretary of Defense has discretion to determine the interdiction of national critical infrastructure supporting federal elections.",
    "Katrina Pierson, a former Trump campaign official that helped organize the Women for American First rally at the Ellipse and on Jan. 6 urged the crowd before the attack started to fight much harder? to stop the steal.? She also reportedly participated in a Jan. 4 meeting with Trump in the Oval Office where she assured him there would be another rally on Jan. 5 where people like Ali Alexander and Roger Stone could speak.? Stone has said Pierson was deeply involved? in the attack.",
    "x\nx\n December 16, 2020PRESIDENTIAL FINDINGSTO PRESERVE COLLECT AND ANALYZE NATIONAL SECURITY INFORMATIONREGARDING THE 2020 GENERAL ELECTIONBy the authority vested in me as President of the United States pursuant to the Constitution andlaws of the United States of America, including Article 2 section 1 of the U.S. Constitution,Executive Orders 12 , 1 ?4?, National Security Presidential Memoranda 1 and 21, theInternational Emergency Economic Powers Act (50 U.S.C.",
    "(7)\n e appointment of a Special Counsel to oversee this operation and institute all criminaland civil proceedings as appropriate based on the evidence collected and provided all resourcesnecessary to carry out her duties consistent with federal laws and the Constitution.-------------------------------------------------------------DONALD J. TRUMPPRESIDENT OF THE UNITED STATES\nMillions of books, audiobooks, magazines, documents, sheet music, and more for free.",
    "(NBA), and section 01 of title , United States Code:I, Donald J. Trump, President of the United States, nd that the forensic report of the AntrimCounty, Michigan voting machines, released December 1, 2020, and other evidence submiedto me in support of this order, provide probable cause sucient to require action under theauthorities cited above because of evidence of international and foreign interference in theNovember , 2020, election.",
    "Alexander's attorney defended the remarks in the videos, saying that the 'Stop the Steal' rally organizer was just making colorful remarks? and exaggerations during playful livestreams contextualizing his intentions.?\nNonetheless, Alexander's attorney conceded that his client helped members of the extremist groups find new housing and the Oath Keepers did provide security for several clients,? CNN reported.",
    "One Michigan prosecutor who squared off with Giuliani and Trump, James Rossiter, told The Washington Post that Giuliani and other Trump officials once asked a Republican prosecutor in Michigan to get his county's voting machines and pass them to Trump's team.?\nThis effort ultimately included the drafting of an executive order that would have had the National Guard seize voting machines around the country.",
    "__________\n Case 1:21-cv-03308 Document 1 Filed 12/17/21 Page 1 of 25\n 2 and STEPHANIE MURPHY, in her official capacity as a member of the United States House of Representatives; and ADAM D. KINZINGER, in his official capacity as a member of the United States House of Representatives; and SELECT COMMITTEE TO INVESTIGATE THE JANUARY 6TH ATTACK ON THE UNITED STATES CAPITOL; and VERIZON COMMUNICATIONS, INC.",
    "Andy Surabian, a Republican strategist and adviser to Donald Trump Jr., the committee contends that Surabian was part of the coordination efforts for the rally on Jan. 6 and that he had contact with multiple people who led the organization of the rally including Donald Trump Jr., Kimberly Guilfoyle, fundraiser Caroline Wren and Julie Fancelli who flooded the Trump reelection campaign with cash.",
    "e modality of the BMD systems'\n capacity to deprive voters of theircast votes without burden, long wait times, and\n insecurity regarding how their votes are actually cast and recorded in the unveried QR\n code makes the potential constitutional deprivation less transparently visible as well, at\n least until any portions of the system implode because of system breach, breakdown, or\n crashes.",
    "Angela McCallum, the national executive assistant to Trump's 2020 reelection campaign, spread false information about voter fraud on Trump's behalf and encouraged, unconstitutionally, state electors to appoint alternate slates and send competing votes to Congress; she also left a voicemail for an election official in Michigan saying Trump was counting on the unidentified representative.",
    "Through attorney Grant Smith, he wrote: Given that the Select Committee's demand for documents is overbroad, overreaching, and far too wide-ranging to be deemed anything other than a fishing expedition, Mr. Stone has a constitutional right to decline to respond.?\nStone' eventually appeared for deposition on Dec. 17 and as planned, invoked his Fifth Amendment to all questions.",
    "PLAINTIFF ALI ALEXANDER\n (hereinafter Alexander?), born Ali Akbar to a Black mother living in Section 8 housing and an Arab father, Alexander left the family when he was two-years old, is a political consultant and voting rights activist known for leading the election integrity movement which seeks fair elections and transparent counting of every vote for every voter.",
    "Every defect and hazard of which Judge Totenberg warned happened in Georgia.Witnesses in Georgia have provided evidence of crashes, the replacement of a server,impermissible updates to the system, connections to the internet, and both Coee and Warecounties have identied a signicant percentage of votes being wrongly allocated contrary to the\n will of the voter.",
    "Other records meanwhile have corroborated public reporting about Trump's conduct in the Oval on Jan. 6, including text messages and testimony demonstrating how Trump's staff, family members, friends, and other White House officials or hangers-on, including those at Fox News, repeatedly begged him to quell the violence on Jan. 6 with little to no success.",
    "Download this PDF\nof 3\nView on Scribd\nUnpublished Trump Draft EO ... by Daily Kos\nWaldron previously told The Washington Post that he met with Trump up to 10 times to discuss ways to replace electors in states where fraud occurred? and that he circulated proposals that outlined ways the National Guard or U.S. marshals could be used to secure? ballots.",
    "In the wait for Attorney General Merrick Garland's decision on the Meadows contempt referral, 2021 campaign finance reports have emerged notating that Trump's onetime political action committee, Save America PAC, has poured $1 million into the Conservative Partnership Institute, a right-wing non profit group that lists Meadows as a senior partner.",
    "Jordan sent a message to Meadows stating: On January 6, 2021, Vice President Mike Pence, as President of the Senate, should call out all the electoral votes that he believes are unconstitutional as no electoral votes at all.?\nThe full text continued: In accordance with guidance from founding father Alexander Hamilton and judicial precedence.",
    "But for all of her blowhard rhetoric during the election about a Kraken? case that would upend America's world as it knew it, Powell's defense in the defamation case was that reasonable people would not accept such statements [about dysfunctional machines] as fact? but they would take her rhetoric to mean that it was up to courts to decide.",
    " 2702, against the Congressional Defendants for issuing an unlawful and overbroad subpoena to Defendant Verizon for Plaintiff's telephone records and against Defendant Verizon to enjoin them from turning over the phone records to the Congressional Defendants in violation of the Stored Communications Act and the First and Fourth Amendments.",
    "That location directly coincided with a site that Ali Alexander's Stop the Steal' organization had reserved with its permit for a rally using the name One Nation Under God.?\nJones sued the committee on Dec. 20 claiming it did not have authority to subpoena his correspondence with the White House, lawmakers, or other campaign officials.",
    "Christopher Liddell, White House deputy chief of staff in the White House on Jan. 6; investigators believe his role as Meadows' deputy meant he was privy to conversations involving state officials in Georgia, discussions of election fraud lawsuits, and correspondence with Jan. 6 rally organizers, the Department of Justice, and others.",
    "After evading more than 100 questions, committee member Rep. Zoe Lofgren called the exchange with Clark very disappointing.?\nThe committee as of Feb. 14 was weighing whether to grant Clark something known as use immunity.? Use immunity would mean he could give the committee information that could not be used to charge him any crimes.",
    "In the meantime, investigators have spent months trying to piece together how the Jan. 6 attack was organized and financed, who was involved in its coordination, and just how many people inside of Trump's orbit may have worked with the 45th president to propagate the pervasive and widely debunked lie that he won the 2020 election.",
    "The insurrection incited by former President Donald Trump cost damages over $1 million to the U.S. Capitol alone, left several dead and hundreds injured, and imbued the national consciousness with doubts over the strengthand futureof American democracy when fanaticism, lies, and autocratic aspirations come to a crashing head.",
    "We hear you from the West WingTHANK YOU??ggg pic.twitter.com/onytmaJUhp\n Dan Scavino Jr.ggg (@DanScavino) January 5, 2021\nx\npic.twitter.com/KBtp8ASS9y\n Dan Scavino Jr.ggg (@DanScavino) January 3, 2021\nScavino in December visited Trump's Florida property, Mar-a-Lago, and posted a video of Trump speaking at a New Year's event.",
    "Prior to the attack, Miller also took frequent opportunities to hold press conferences propagating Trump's lies about the election, and legislators on the committee believe the campaign adviser was a facilitator to the pressure strategy on then-Vice President Pence or was , at the very least, attuned to the scheme's details.",
    "Over the course of several weeks, Alexander, after considerable expense and countless hours, submitted through counsel hundreds of pages of documents, emails, and texts, to the Select Committee, even though much that was sought was not pertinent to the Committee's legislative purpose or in some cases, subject to privilege.",
    "Navarro has so far refused to cooperate with the probe, hostilely telling them they were domestic terrorists.?\nNicholas Luna, Trump's personal assistant or ?body man? was reportedly in the Oval Office on Jan. 6 when Trump was on a call with Pence, in which he pressured Pence not to certify the results of the 2020 election.",
    "On Jan. 20, it was reported that Stephanie Grisham, former White House press secretary and chief of staff to former First Lady Melania Trump, voluntarily sat for deposition in early January and informed that committee that Trump had secret meetings? in the White House residence in the days just before the Capitol attack.",
    "McCarthy was once willing to speak publicly about phone conversations he had with Trump on Jan. 6, including at least one contentious call that took place as the riot was underway, Now the California Republican and House Speaker-aspirant has backpedaled, refusing an invitation to cooperate with investigators voluntarily.",
    "Institutional review\nThe committee has also sought records and testimony from the Defense Department, the Department of Homeland Security, the Interior Department, the Department of Justice, the FBI, the National Counterterrorism Center, the Office of the Director of National Intelligence, and the National Archives.",
    "pic.twitter.com/oyvCgGrcQ2\n Manu Raju (@mkraju) December 23, 2021\nOther text messages provided to the committee by Meadows before he abruptly stopped cooperation also showed Fox News host Sean Hannity writing to Jordan and Meadows about concerns over Trump's strategy and state of mind before the Capitol assault.",
    "2017) Just days prior to the election of November , 2020, federal Judge Totenberg found, aer threedays of testimony including by Dominion executive Eric Coomers:ere are \"true risks posed by the new BMD [Ballot Marking Device of Georgia'sDominion Voting Systems] voting system as well as its manner implementation.",
    "Sharing articles suggesting plainly that Pence was treacherous? for refusing to go along with the delay effort, Stone laced into Pence calling him duplicitous? and a disloyal POS,? shorthand for piece of shit.?\nStone insists Pence and his advisors undermined Trump from the very beginning of his time in office.",
    "Both re osteopaths and in a lawsuit attempting to bar the committee's review, they argued that disclosing metadata would violate the privacy rights of an unknown but quantifiable number of individuals.?\nAs for Mastriano: the Pennsylvania State Senator was at the Capitol on Jan. 6 but never inside the building.",
    "On his way to his rally permitted by the U.S. Capitol Police following the Ellipse rally,\n Case 1:21-cv-03308 Document 1 Filed 12/17/21 Page 3 of 25\n 4 Alexander witnessed some individuals who had arrived before the Ellipse rally ended and were clashing with police near the Capitol Building on the West side.",
    "As Trump reportedly leaned on Pence to go along with the subversion strategy, Kellogg's deposition transcript shows Ivanka turned to Kellogg and remarked: Mike Pence is a good man.?\nThe committee also wants Ivanka to testify about any actions Trump may have taken to direct Pence to violate the Constitution.",
    "pic.twitter.com/yaL8opl6Pf\n Rachel Scott (@rachelvscott) February 8, 2022\nMcCarthy has defended the RNC's language in the censure, saying that the legitimate political discourse? was a reference to those RNC officials now subpoenaed by the Jan. 6 Committee for information about alternate elector activities.",
    "Investigators have said those messages depict just a sliver of the sprawling pressure campaign that ensconced former Vice President Mike Pence and involved a wide cast of players from Trump's personnel director to campaign aides to attorneys like John Eastman, Jenna Ellis, Sidney Powell, and Rudy Giuliani.",
    "The transfer of those records began in mid-January and by Feb. 10, some of the first reporting on White House call logs obtained by the committee revealed that Trump's habit of using personal cell phones or staff phones had left White House records riddled with new gaps for investigators to explore.",
    "But federal judges have found the probe is perfectly legitimate and have ruled against this argument in lawsuits brought by Trump or his allies as they have attempted to stop subpoenas for telephone metadata or other correspondence between officials, the former president, or Jan. 6 rally organizers.",
    "On or about October 7, 2021, Alexander was served with a subpoena by the defendant Select Committee To Investigate The January 6th Attack On The United States Capitol (hereinafter Select Committee?) to produce documents requested, including text messages and emails, and to testify at a deposition.",
    "The committee alleges Scavino has materials relevant to Trump's videotaping and tweeting message on Jan. 6? and was intimately familiar with what occurred during meetings with the president and other administration officials where schemes to stop the certification of the election were hashed out.",
    "Kevin McCarthy, U.S. House GOP Leader\n GOP Leader Kevin McCarthy\nKevin McCarthy, a California Republican and leader of the House GOP, spoke to Trump on Jan. 6 according to his own statements but when the committee submitted a voluntary request for his records and deposition, the lawmaker refused.",
    "Arizona legislator Mark Finchem, who said he came to Washington on Jan. 6 so he could give Pence an evidence book and letter? about fraud in his state and to call for a delay of the certification, was in reported talks with leaders of the Stop the Steal' movement about the rally at the Ellipse.",
    "One of those documents was entitled, Draft letter from POTUS to seize evidence in the interest of national security for the 2020 election.?\nKerik's attorney told reporters that the document was created one day before Trump met with former national security adviser Michael Flynn and Giuliani.",
    "Molly Michael, a special assistant to Trump and Oval Office operations coordinator, forwarded emails on Dec. 14 to then-acting Attorney General Jeffrey Rosen, with the subject line including FROM POTUS,? that laid out talking points on bogus forensic information alleging fraud in Michigan.",
    "On November 4, 2020, he started Stop the Steal,? a viral movement and peaceful protests across the country to address the concerns of millions of voters about how their votes were counted during an election during a coronavirus pandemic with changing ballot casting and counting standards.",
    "At one point, Trump banned Short from the White House grounds because he objected to the pressure on Pence to reject the legitimate election results.? Short has said publicly that it was bad advisers who were basically snake-oil salesman? that gave Trump the idea to have Pence intervene.",
    "McCarthy, Bannon said, is controlled opposition? and when the right leadership? is in place, Bannon suggested the GOP's Make America Great Again' wing could rule for 100 years.?\nx\nBannon docket info continued:\n- Opposition to those motions must be in by Feb. 25 with replies by March 8.",
    "The requests started to flow last August when telecommunications companies like Verizon, AT&T, Sprint, and U.S. Celluar were asked to preserve phone records from a host of Republican lawmakers like Kevin McCarthy as well as Trump administration officials and Jan. 6 rally organizers.",
    "The National Archives in February, as it located and obtained 15 boxes of records from Mar-a-Lago, confirmed now years-old reporting that Trump frequently tore up presidential documents, even flushing some of the destroyed documentslegally required to be preserveddown the toilet.",
    "Alexander Lawsuit by Daily Kos on Scribd\nx\nx\n 1\n IN THE UNITED STATES DISTRICT COURT FOR THE DISTRICT OF COLUMBIA\n ALI ALEXANDER aka Ali Akbar c/o undersigned counsel Plaintiff, v. NANCY PELOSI, in her official capacity as Speaker of the United States House of Representatives.",
    "e stealth vote alteration or operational interference\n risks posed by malware that can be eectively invisible to detection, whether\n intentionally seeded or not, are high once implanted, if equipment and soware systems\n are not properly protected, implemented, and audited.",
    "Patel appeared on the Fox News podcast The Kitchen Table shortly after his appearance and spoke with hosts about fighting the deep state.? In February, Patel interviewed Trump for The Epoch Times, chatting the president up about theories tied to the Durham investigation.",
    "He sat back as Trump brazenly said, more than a year since the attack, that those in the crowd offered a lot of love there? and that they were great people.?\nHannity, according to a mid-riot text message sent to Mark Meadows on Jan. 6 once wrote: Can he make a statement?",
    "Even if the panel is unable to obtain full compliance from some of those subpoenaed, they have argued that the information provided thus far to the committee has been so informative and the document production so voluminous, it could render some of their requests moot.",
    "A Senate Judiciary Committee report released last year revealed emails and other correspondence from Clark to fellow Department of Justice officials where he angled to have then-acting Attorney General Jeffrey Rosen removed so Trump could install him in Rosen's place.",
    "(3)\n e Director of National Intelligence shall deliver this assessment and appropriatesupporting information to the President, the Secretary of State, the Secretary of the Treasury, the\n Secretary of Defense, the Aorney General, and the Secretary of Homeland Security.",
    "Notably, Luna was not an official White House staffer on Jan. 6 but when he was at a meeting in December with Trump and Pence, investigators allege that he was privy to talks between his superiors about seizing voting machines by way of declaring a national emergency.",
    "Kellogg's deposition with the committee in December corroborated public reporting that it was Ivanka Trump, the ex-president's daughter and adviser, who was called upon repeatedly to soothe Trump during the riots and attempt to persuade him to issue a call for peace.",
    "One went to Arizona Republican Party chairwoman Kelli Warda faithful devotee toTrump and his administration's immigration policyas well as two incumbent state lawmakers, Pennsylvania State Senator Doug Mastriano and Arizona State House Representative Mark Finchem.",
    "Scavino's relationship stretches back nearly a decade with the former president and he is among his chief allies, having served him at various points as a digital strategy director and so-called overseer of Trump's presence on social media platforms like Twitter.",
    "When the violence began to erupt at the Capitol while they were in the White House, Kellogg told investigators during his closed-door deposition in December that he urged Trump to deliver a message to his supporters at the U.S. Capitol that would end the chaos.",
    "On Dec. 30, Lin Wood, a conservative trial lawyer who failed to successfully challenge election results in Georgia last year, disclosed to CNBC that Flynn, along with other Trump officials, was once a guest at his South Carolina estate, the Tomotely Plantation.",
    "The alternate electors? subpoenaed in January include Loraine Pellegrino, David Shafer, Shawn Still, Kathy Berden, Mayra Rodriguez, Jewll Powdrell, Deborah Maestas, Michael McDonald, James DeGraffenreid, Bill Bachenberg, Andrew Hitt, Kelly Ruh, and Lisa Patton.",
    "As for Jordan, after he received the friendly subpoena? from the committee, he appeared on Fox News and suggested investigators were in cahhoots against him after a portion of a text message he sent to former White House chief of staff Mark Meadows went public.",
    "The ex-national security official sought a temporary restraining order against investigators but a judge found that because he was unable to prove that even so much as attempted to comply with the probe, he could not prove he was being injured by the demand.",
    "Costello has represented Bannon on Jan. 6 matters since Bannon was first subpoenaed by the committee, Court documents have yet to make clear whether the Justice Department's pursuit of Costello's metadata was tied to Bannon's case or tied to another matter.",
    "Also, Alexander held a permit for a rally at Lot 8 on the North East side of the Capitol Grounds on that same date for a One Nation Under God? event and prayer rally, one of several on the Capitol Grounds scheduled to take place after the Ellipse rally.",
    "Meanwhile, reports on Stone's recent stream of income have revealed that he has been accepting tens of thousands of dollars around the same time he has thrown endorsements behind pro-Trump anti-Jan. 6 committee Republicans like Florida Rep. Matt Gaetz.",
    "Here is a glimpse at just some of the more recent activity around phone records:\nEric Trump Jr. has not yet received a formal subpoena from investigators, but like Kimberly Guilfoyle, his call records have been successfully obtained by the committee.",
    "Documents obtained by the committee reportedly show Fletcher's group was in contact with Stop the Steal' leader Ali Alexander\nEyes on extremism\nSeveral extremist organizations, their supporters, and members have been drawn into the committee's probe.",
    "On Jan. 5 he shared logistics for how to get into D.C. on social media and as the attack kicked off, he posted to Telegram It's happening.? He also reportedly received $25,000 in Bitcoin from the same programmer that may have sent funding to Fuentes.",
    "x\nin case he takes the video down, here's the relevant section pic.twitter.com/IYiqxeX6Ch\n Jason Paladino (@jason_paladino) January 8, 2021\nAlexander led a rally 24 hours before the Capitol attack at Freedom Plaza with the Eighty Percent Coalition.",
    "The committee has been careful to narrow its request to Hannity for messages that were sent over a period of roughly a month, a maneuver that anticipates a First Amendment challenge in response from the Fox host if they make the subpoena official.",
    "Jordan defended his posture in January in a letter to the committee riddled with misinformation, including the suggestion that the committee imposed gag orders on communications companies so that they could collect data without a target knowing.",
    "The select committee issued a subpoena to Ali Alexander on Oct. 7 and laid out a litany of requests it had for him regarding records related to his role organizing Stop the Steal' rallies, including the one outside of the Capitol on Jan. 6.",
    "Jan. 6 Committee members like Republican Rep. Adam Kinzinger have said Giuliani is likely to cooperate with the probe and a New York Times report published on Feb. 12 cited multiple sources familiar with Giuliani's thinking saying as much.",
    "In December, rally organizers Unes, Mulvaney, Powers, and Caporale sued the Jan. 6th Committee in federal court arguing the request for their cell phone data was a breach of their constitutional right to privacy and private communications.",
    "Download this PDF\nof 5\nView on Scribd\nArizona Electoral Votes Sig... by Daily Kos\nWard's T-Mobile phone records have been subpoenaed by investigators along with records from Mole Medical Services, a company owned by Ward and her husband.",
    "Jenna Ellis, Trump attorney\nJenna Ellis was plucked from the sidelines to serve as Trump's senior legal adviser after the former president saw her on television promoting baseless conspiracy theory about the outcome of the 2020 election.",
    "Jason Miller, a longtime Trump confidante, was subpoenaed by the committee on Nov. 8 and along with Bannon and others, was reportedly at the meeting at the Willard Hotel on Jan. 5 where Trump's team plotted how to overturn the election.",
    "An online stream he posted this January featured Alexander delivering a minutes-long rant expressing how he worked behind the scenes? for weeks on something that could help over 100 million people? when cooperating with investigators.",
    "Trump, she said, ignored court rulings against his claims of widespread fraud and launched a massive campaign to mislead the public.?\nOur hearings will show that these falsehoods provoked the violence on Jan. 6,? she said in February.",
    "Ivanka Trump, former President Donald Trump's daughter and senior adviser\n Ivanka Trump\nThe former president's daughter and senior adviser was requested to comply voluntarily with the investigation into the Capitol attack on Jan. 20.",
    "McCarthy said last year that Trump responded: Well, Kevin, I guess these people are more upset about the election than you are.?\nNonetheless, McCarthy maintains the committee is politically motivated and insists it is illegitimate.",
    "He then added that the work of the Jan. 6 Committee was an insurrection against Congress.?\nAlexander sued the committee in mid-December in an attempt to block telephone carrier Verizon from providing his call logs to investigators.",
    "As 2022 got underway, CNN uncovered more Periscope videos including one livestream from Dec. 23, 2020, dubbed JAN6? where Alexander said he called on the Proud Boys and Oath Keepers to provide security for the rally at the Ellipse.",
    "Powell's fundraising efforts for the 2020 election through her group Defending the Republic are currently under investigation in a separate probe led by the U.S. Attorney's Office in Washington, D.C. That probe is over a year old.",
    "He amended the complaint to include Timothy Enlow, the security operations manager for Free Speech Systems, a media entity owned by Jones, in February after it was revealed to Jones that the committee had served Enlow's provider.",
    "There was voluntary compliance from several of the companies noticed in August but the biggest hitters like Facebook, Google, Twitter, and Reddit failed to respond adequately,? according to Jan. 6 Committee chair Bennie Thompson.",
    "Proud Boys International LLC; the right-wing extremist group called for violence before the attack on Jan. 6 and so far, more than 50 Proud Boys or alleged members have been indicted by the Department of Justice for those crimes.",
    "The electors affixed their signatures to electoral certificates for Trump though they were unrecognized officially under state law when they met on Dec. 14, the same day the Electoral College convened to ratify Biden's victory.",
    "One of those lawmakers, according to the committee, was Rep. Mo Brooks, an Alabama Republican who told reporters he was wearing body armor to the rally on Jan. 6 at the Ellipse because he was warned that violence was imminent.",
    "On December 9, 2021, he appeared before the Select Committee for a deposition that\n Case 1:21-cv-03308 Document 1 Filed 12/17/21 Page 4 of 25\nMillions of books, audiobooks, magazines, documents, sheet music, and more for free.",
    "x\n(1/2) I stand with immense respect for our Constitution, the Rule of Law, and the Americans I represent who know that this entity is illegitimate, and not duly constituted under the rules of the US House of Representatives.",
    "In fact, there is probable cause to nda massive cyber-aack by foreign interests on our crucial national infrastructure surrounding our\n electionnot the least of which was the hacking of the voter registration system by Iran.",
    "Trump's defeat at the Supreme Court in his bid to stop the National Archives from transferring his presidential records to the probe was a boon for the committee as well as for overall transparency into the executive branch.",
    "Investigators say plans to subvert the election were hatched there and that Bannon was present on Jan. 5 when guests discussed a strategy to have members of Congress block the certification of election results the next day.",
    "Replies by May 10.\n Brandi Buchman (@Brandi_Buchman) January 5, 2022\nGaetz and Greene have in the weeks since become increasingly inseparable in their efforts to defend the former president and attack the Jan. 6 Committee.",
    "A memo made public in November illuminated the role McEntee played in having Defense Secretary Mark Esper removed, a maneuver that ultimately opened the door for Clark to try his power grab at the Department of Justice.",
    "Several critical findings have trickled out in the last year including text messages sent and received from former White House chief of staff Mark Meadows to legislators like Republican Rep. Jim Jordan of Ohio, for one.",
    "Meadows defended the conduct, telling reporters the ripped up presidential records were little different than the time Speaker of the House Nancy Pelosi tore apart behind Trump after he delivered the State of the Union.",
    "Patrick Casey, another leader in the America First/Groyper movement, was also subpoenaed on Jan. 19 and like Fuentes, he was vocal about his support of movements to overturn the election for several weeks before Jan. 6.",
    "He is indicted on a number of seditious conspiracy charges and according to prosecutors, oversaw a weaponized and nuanced plan that stationed quick reaction forces just outside of Washington to assist the insurrection.",
    "Henry Enrique? Tarrio, chair of the Proud Boys, was arrested on Jan. 4 after he tried to enter Washington, D.C., to sell two empty large-capacity firearm magazines to someone attending the Jan. 6 Stop the Steal' rally.",
    "An NBC report published in February noted that the committee has been particularly interested to learn more about certain events extremists attended in 2020 including Covid lockdown protests or racial justice protests.",
    "Flynn, Wood, right-wing attorney Sidney Powell, former CEO for Overstock Patrick Byrne, and Doug Logan, the CEO of the self-professed cybersecurity firm Cyber Ninjas, were also visitors at various points before Jan. 6.",
    "So the fortunate thing is I'm so underestimated by the left, and what I am doing behind the scenes will impact all of America, but it will positively impact at least the 75 million of us that voted for Trump,? he said.",
    "Miller told The Sun: Deplatforming President Trump was only the beginning for Big Tech and their war on free speech.?\nMiller has lost favor with Trump ally Roger Stone following his cooperation with the investigation.",
    "The committee subpoena to Meadows further cited how he engaged in multiple elements of the planning and preparation? of the failed coup and was privy to dozens of meetings planning the Jan. 6 rally before it launched.",
    "Sidney Powell, attorney who promoted Trump's election fraud lie\nSidney Powell secured her place in history over the course of the 2020 election as one of Trump's most vocal proponents pushing election disinformation.",
    "Investigators premised much of their subpoena on Giuliani's very public sharing of Trump's disinformation about election fraud during 2020 and his insistence that Dominion Voting Systems machines were dysfunctional.",
    "x\nI tried to ask @GOPLeader about the RNC's resolution describing Jan. 6 as legitimate political discourse?\nHe told me to make an appointment with his office insisting it's not good? to answer questions in hallways.",
    "Formally subpoenaing fellow lawmakers is a constitutional morass with potentially negative and time-consuming consequences but investigators have been quietly assessing their options with counsel for several weeks.",
    "According to investigators, Kerik was a close associate of the former president and allegedly coordinated and attended meetings at the Willard Hotel, including on Jan. 5, to develop the election subversion scheme.",
    "Max Miller, another aide for Trump who is now running for a seat in Ohio's 13th district, was with Peede and Trump during a Jan. 4 meeting where the Jan. 6 Stop the Steal' rally was discussed with Katrina Pierson.",
    "Stockton was revealed in mid-December as the source for an October Rolling Stone piece where it was alleged that several members of congress were intimately involved in a scheme to overturn the election results.",
    "White House, administration and campaign officials\nThere are several others in Trump's orbit that have been called up by the committee either through a formal subpoena or through a request to comply voluntarily.",
    "The document Pelosi destroyed, howeverand something Meadows failed to notewas a photocopy of the address, not a formal presidential record with preservation criteria obligated under the Presidential Records Act.",
    "e insularityof the Defendants' and Dominion's stance here in evaluation and management of thesecurity and vulnerability of the BMD system does not benet the public or citizens'condent exercise of the franchise.",
    "The University of Maryland's National Consortium for the Study of Terrorism and Responses to Terrorism broke down the extremist affiliations held by defendants charged with crimes related to the Capitol attack.",
    "While he would not answer questions in the formal setting, Jones took to his podcast right after to breathlessly describe the experience, a decision that could have negative repercussions according to experts.",
    "John Eastman was first subpoenaed by the committee on Oct. 8 after a memo he authored emerged laying out a six-point plan to have then-Vice President Mike Pence stop or delay the outcome of the 2020 election.",
    "Jordan was a huge proponent of Trump's election lies and Hannity, at one point, felt the need to tell Jordan on Jan. 10 nearly a week after the attack:\n Guys, we have a clear path to land the plane in 9 days.",
    " Rep. Jody Hice (@CongressmanHice) December 22, 2020\nLawmakers attending those meetings included Rep. Mo Brooks of Alabama, Andy Biggs of Arizona, Marjorie Taylor Greene of Georgia, and Jody Hice of Georgia.",
    "Seeking information about the private meetings where Giuliani reportedly focused on coordinating alternate elector slates, there's emerging new testimony from other prosecutors that have sparked an interest.",
    "Investigators are interested in two legal memos Ellis circulated in December 2020 and Jan. 2021 advancing the thin legal theory that Pence could simply refuse to consider electors during the count on Jan. 6.",
    "Rhodes allegedly coordinated security detail for Roger Stone for events on Jan. 5 and Jan. 6 and spotted outside of the Willard Hotel on Jan. 6 where Trump officials had met to strategize subversion efforts.",
    "Investigators want Worthington to provide further information about Trump's state of mind and conduct ahead of the speech and have inquired about why Trump littered his remarks with claims of election fraud.",
    "Luna reportedly heard Trump yell at Pence, You're going to wimp out!? Luna's deposition has been held off for now as he has reportedly been cooperating with the committee and submitting to document requests.",
    "The letter came after Pence's ex-national security adviser Keith Kellogg testified behind closed doors and revealed that it was he and Ivanka Trump who witnessed her father's phone call to Pence on Jan. 6.",
    "Investigators say Giuliani had a prominent role at several meetings hosted at the Willard Hotel in Washington, D.C. where Trump's legal team and advisers official or otherwise frequently met to strategize.",
    "The push was part of a larger scheme that began when Clark pushed Rosen and Rosen's deputy, Richard Donoghue, to inform swing state legislatures they should appoint new electors and reject certified votes.",
    "\"Still, this is year one for Georgia in implementation of this new BMD system as the rststate in the nation to embrace statewide implementation of this QR barcode-based BMDsystem for its entire population.",
    "A month before the putsch, Stone appeared at various events including one rally in D.C. on Dec. 12 where he urged the president's supporters to fight until the bitter end? to stop Biden from taking office.",
    "Multiple inquiries have extended into rallies and other pro-Trump events occurring before the Capitol attack like the Million MAGA March held that November and the Stop the Steal' rally held that December.",
    "Jordan is one of several Republican lawmakers who took meetings with the president in December 2020 to discuss election fraud allegations and other plans to object to the election certification on Jan. 6.",
    "By Feb. 1, it was reported that it was McEnany who was responsible for turning over a series of text messages to investigators showing Fox News host Sean Hannity peppering the press secretary with advice.",
    "Those mental jumping jacks aside, she further justified her conduct with another argument: Even if election fraud did not occur, the very appearance of it would absolve any legal contentions against her.",
    "Scavino, as Trump's aide and with an office just near the Oval, was often a reported workaround for Trump to avoid using official White House telephones, relying instead on Scavino's mobile among others.",
    "U.S. Capitol Police officer Harry Dunn, a year later, is still advocating for accountability and transparency and wades through a wake of memories like so many other officers who were on the front lines.",
    "The committee has issued subpoenas to more than 14 individuals, including a variety of powerful state and party officials, who once purported to be alternate electors? for former President Donald Trump.",
    "But it was confirmed last year that it was Short who gave investigators a copy of a memo written by John McEntee that offered shoddy, inaccurate legal strategy on how Pence could stop the certification.",
    "Investigators say he and Clark worked on the letter for Georgia state and election officials and that he met with Clark before a meeting where Clark proposed Jeffrey Rosen's removal at Trump's behest.",
    "The censure also described Jan. 6 as legitimate political discourse,? a decision that even generated public consternation from dyed-in-the-wool Republicans like Senate Minority Leader Mitch McConnell.",
    "Among those records is non-privileged texts illuminating Meadows' correspondence with lawmakers like Rep. Jim Jordan who along with others in congress pushed for the appointment of alternate electors.",
    "Brian Jack, director of political affairs for Trump reportedly contacted several members of Congress on Trump's behalf, asking them to speak at the Ellipse about so-called fraud in the 2020 election.",
    "Jordan contends the text messages he sent to Meadows about strategies to overturn the election results were forwards of information from the former inspector general of the Pentagon, Joseph Schmitz.",
    "Subpoaened on Nov. 8, Flynn came under the committee's purview after it was reported that he attended a Dec. 18 meeting in the Oval Office where discussions of how to seize voting machines abounded.",
    "Stone has long had ties to the extremist organization known as the Proud Boys and on Jan. 8, when he appeared on RT, the Russia-state news channel, he said he sympathized with Trump's frustrations.",
    "Miller's role in propagating the alternate elector? theory was accompanied by his efforts to help Trump craft the speech that would be delivered from the Ellipse on Jan. 6, the committee contends.",
    "She has emphasized through her attorney that she thinks her conversations with Trump may be protected under attorney-client privilege though the ex-president never paid her for her legal services.",
    "Kayleigh McEnany, the White House press secretary who promoted Trump's lies about the 2020 election routinely from the White House press briefing room, accompanied Trump to the Ellipse on Jan. 6.",
    "Williamson was also allegedly contacted by White House Communications Director Alyssa Farah during the siege, who urged him, to no avail, to have Trump issue a statement condemning the violence.",
    "His defense team claimed in a motion filed on Feb. 4 that Justice Department prosecutors improperly obtained orders seeking access to defense attorney Robert Costello's phone and email metadata.",
    "The RNC tried to spin the statement a few days later, saying the legitimate political discourse? comment was in reference to those lawmakers who ultimately voted against certification on Jan. 6.",
    "e forensic reportprepared by experts found that \"the Dominion Voting System is intentionally and purposefullydesigned with inherent errors to create systemic fraud and inuence election results.",
    "Jenna Ellis Dec. 31 and Jan. 5, 2021 Memo Proposing Strategy to Overturn Election by Daily Kos on Scribd\nx\nx\nMillions of books, audiobooks, magazines, documents, sheet music, and more for free.",
    "As for the Ohio lawmaker, Jordan's dodging has continued unabated since July when he was first asked whether he would answer questions about his communications with Trump if ever called upon.",
    "Ideas??\nIn any event, White House call logs obtained by the committee this February confirmed what Jordan has been unable or unwilling to confirm for months: He did speak to Trump on Jan. 6.",
    "Stockton and his fiancee Jennifer Lynn Lawrence said in an interview with Rolling Stone published Dec. 13 that they were going to cooperate with the committee in full and begin naming names.",
    "The data requested would not reveal the content of calls or text messages but would help investigators piece together the dates and times that calls were made and for how long calls lasted.",
    "Investigators allege Perry was the catalyst of a scheme to install Jeffrey Clark as attorney general so that the Trump administration could further its attempt to subvert the 2020 election.",
    "And guess what, we are going to take over the election apparatus.?\nJust a few days before the first anniversary of the attack, Bannon lashed out at GOP Leader Kevin McCarthy on his podcast.",
    "The right-wing talk show host also reportedly told those same organizers that he was responsible for facilitating contributions for the rally from Publix supermarket heiress Julie Fancelli.",
    "Though she has yet to receive a formal subpoena, as of January, the campaign fundraiser and fiancee to Donald Trump Jr., Kimberly Guilfoyle, had repeatedly come into the committee's focus.",
    "Oath Keepers; Several members of the right-wing extremist group have been indicted on charges related to the planning of the attack, including ringleader Elmer Stewart Rhodes for sedition.",
    "Before the attack, Jones spent hours broadcasting Trump's election fraud claims and made statements implying he knew what might be coming when Congress met to certify the electoral votes.",
    "But such an outcome would appear unlikely and days after those reports circulated, Giuliani took to the right-wing Newsmax to bash the probe and deem it illegitimate during an interview.",
    "James P. Waldron, who admitted to contributing to a Jan. 6 eve PowerPoint presentation shared with GOP members of Congress on election fraud, was subpoenaed by the committee on Dec. 16.",
    "Cassidy Hutchinson, a special assistant to Trump for legislative affairs, was in the White House with Trump on Jan. 6 and traveled with him to the Ellipse for the Stop the Steal rally.",
    "According to CNN, following his closed-door deposition, he said: There's this conspiracy theory ... that me and members of Congress worked to jeopardize the safety of their colleagues.",
    "It has also been reported that Republican Sen. Kevin Cramer of North Dakota was invited by Flynn to a meeting just two days before the attack where the overturn strategy was discussed.",
    "The Federal Election Commission report notes the donation was made on July 26, just a few weeks after the Jan. 6 Committee was officially approved by the full House of Representatives.",
    "The committee's investigation has extended as well to a trio of White House advisors and strategists including one official who helped write Trump's Jan. 6 speech that incited the mob.",
    "Steve Bannon, a right-wing extremist and conspiracy peddler, is currently awaiting trial after pleading not guilty to two counts of contempt of Congress filed against him in November.",
    "He disclosed publicly that he and Steve Bannon met to discuss a delay strategy for Jan. 6 but he has insisted that an express attempt to overturn the results was not part of the plan.",
    "Investigators want Mastriano to testify about the alternate elector scheme as well as the role he played allegedly arranging an event in Phoenix with Trump's lawyers on Nov. 30, 2021.",
    "Jennifer Lynn Lawrence, along with her fiance Dustin Stockton, assisted Women for America First with its rallies after the November election and right through to the rally on Jan. 6.",
    "Arthur Schwartz, like Surabian, is a Republican strategist and adviser to Donald Trump Jr. and the committee subpoenaed Schwartz for information related to the planning of the rally.",
    "(They'll be worthless because they won't have the seals of the state Secretaries of State, though) pic.twitter.com/B9pKXqYGIa\n Andrew Feinberg (@AndrewFeinberg) December 14, 2020\n10.",
    "Prior to the Capitol attack, Stone spoke publicly in support of Trump's claims of election fraud and funneled cash for private security? at events in Washington held on Jan. 5 and 6.",
    "Amid all of this, subpoenas have continued to flow and the first anniversary of the attack triggered a subpoena every week or sometimes multiple requests per week throughout January.",
    "Jones indicated in that lawsuit he intended to invoke his Fifth Amendment right if forced to testify at deposition and that was exactly what he did during his appearance on Jan. 25.",
    "Though he has not been publicly subpoenaed by the committee, Chris Krebs, once a senior Trump administration official for cybersecurity, reportedly sat down for questions on Dec. 9.",
    "Similar emails went out on Dec. 29 to the U.S. solicitor general, urging the Department of Justice to file a lawsuit at the Supreme Court that requested the election be overturned.",
    "The RNC has since sought to clarify its statement, saying that the legitimate political discourse? was a reference to all those legislators who objected to certification on Jan. 6.",
    "His testimony could provide valuable insight into Trump's thoughts and conduct while rioters were actively breaching the Capitol and viciously beating police defending the complex.",
    "In the months before, Eastman prolifically shared Trump's bogus election fraud claims with Georgia state senators and even went so far as to urge them to directly appoint electors.",
    "The National Archives confirmed in February that Trump destroyed numerous presidential records while in office, often leaving it to staff to tape some of the records back together.",
    "Outwardly, the committee's chair and vicechair, Reps. Bennie Thompson, a Mississippi Democrat, and Liz Cheney, a Wyoming Republican, have been persistently optimistic but measured.",
    "It is unclear if he was ever formally subpoenaed or if he appeared voluntarily, but the former Pence staffer has been forthcoming with investigators providing several key records.",
    "Importantly, Short was also in the Oval Office on Jan. 4 during a meeting with John Eastman and Trump where they discussed how to get Pence on board with overturning the election.",
    "Ellis has defended the documents saying they were mere explorations of legal theory and that she at no time? advocated for Pence to stop or delay the results o the 2020 election.",
    "Eastman was also in the Willard Hotel's war room? on Jan. 6 with Bannon and was in frequent contact with Pence's counsel, Greg Jacob, about strategies to manipulate the election.",
    "McEntee was tapped by Trump to serve as the director of the White House personnel office, making him a key arbiter in deciding who was hired or fired across the administration.",
    "Eastman met with Trump repeatedly before Jan. 6 and delivered a fiery address from the Ellipse just before the putsch began along with Trump's personal attorney Rudy Giuliani.",
    "In November, after word of the subpoena broke, he issued a letter to the committee saying he would cooperate with the probe but he also demanded an apology in the same breath.",
    "Cox hosted an online live event on Zoom and Facebook in December 2020 where Trump's attorney and alleged ringleader of the alternate elector scheme Rudy Giuliani was featured.",
    "McEntee was reportedly in the room with Trump, Pence, Giuliani, and Trump campaign lawyer Justin Clark when the men hashed out a plan to conduct an audit of votes in Georgia.",
    "The Dec. 31 memo went to Trump's office and proposed that Pence could merely refuse to open state certificates on Jan. 6 if he believed the certificates were based on fraud.",
    "William Stepien, Trump's 2020 reelection campaign manager, promoted false claims about voting machines despite internal campaign memos determining those claims were false.",
    "During an appearance on CNN on Jan. 22, Epshteyn acknowledged that he was part of the process to make sure there were alternate electors? for Trump submitted to Congress.",
    "The committee pointed to Powell's promotion of disinformation about the election and her repeated urging to Trump that he seize voting machines as a basis for the demand.",
    "Investigators have pursued thousands of pages of Eastman's communications and the committee successfully won access to his emails during his tenure at Chapman University.",
    "He must also provide detailed explanations for his privilege assertions and disclose the nature of any attorney-client relationship he might cite to mask those documents.",
    "Nick Fuentes, described by the Anti-Defamation League as a white supremacist and leader of the xenophobic America First/Groyper movement, received a subpoena on Jan. 19.",
    "As of Dec. 2021, at least 105 defendants, or 14%, were or are associated with extremist groups like the Proud Boys, Oath Keepers, Three Percenters and Boogaloo Movement.",
    "States would have to stop or delay certification, the memo suggested, because the first state to object on Jan. 6, Arizona, had not met the criteria for state electors.",
    "Text messages shared with former chief of staff Mark Meadows and lawmakers like Rep. Jim Jordan suggest Hannity felt Trump's subversion efforts were practically doomed.",
    "Lawmakers sought information from Kellogg regarding his participation in at least one meeting with Trump and Trump's attorney Pat Cipollone as the attack was unfolding.",
    "Eastman's decision to invoke his Fifth Amendment right after receiving his October subpoena prompted the committee to work around him and pursue the university emails.",
    "Investigators claim Kerrik paid for and reserved the war room? at the Willard as well as other suites where administration officials could privately game out strategy.",
    "The committee's debut public hearing unfolded last July when a handful of police officers who fought off the mob for hours testified about their harrowing experiences.",
    "Giuliani was also engaged in a sweeping pressure campaign focused on election officials in key battleground states and reportedly urged Trump to seize voting machines.",
    "The strategy was to have the Trump certifications ready and waiting should courts rule in favor of lawsuits brought by the former president alleging widespread fraud.",
    "allegedly solicited and then directed a nonprofit organization to donate $200,000 from an undisclosed source to pay for its ad campaign promoting election falsehoods.",
    "That has included the committee's scrutiny of those individuals who submitted bogus electoral certificates on behalf of Trump in several election battleground states.",
    "He started out as Trump's bag man, but his dogged defense of the president was quickly parlayed into an opportunity where he would serve in a far more powerful role.",
    "Patel, once a senior congressional aide to Trump ally Rep. Devin Nunes, first joined the Trump administration in 2019 as a staffer on the National Security Council.",
    "The committee has requested information about Krebs' termination this August when it sent a request to Department of Homeland Security Secretary Alejandro Mayorkas.",
    "Stephen Miller, Trump's senior adviser and architect of the Trump administration's inhumane immigration policies, received a subpoena from the committee on Nov. 9.",
    "To wit, the Justice Department's prosecution of over 725 people has now importantly come to include the first seditious conspiracy indictments tied to the attack.",
    "Those targeted in January alone have included a wide array of people both tangentially and overtly connected to Trump's efforts to spread election disinformation.",
    "But on Jan. 20, a judge ruled against Budowich, saying his financial records should not be returned to him after JP Morgan Chase handed them off to the committee.",
    "Kerik, upon sitting for deposition in January, told the committee it was onetime U.S. Army Colonel Phil Waldron who dreamed up the idea to seize voting machines.",
    "During his remarks at a D.C. event on Jan. 5, Stone reportedly had a security detail comprising members from the Oath Keepers, an extremist militia organization.",
    "He stood on the grass and his group begged those within range of his voice to go to the North East part of the Grounds where the rally was permitted and planned.",
    "He and his group went around to the East side of the Capitol only to find protestors not being guided to Lot 8 on the North East portion of the Capitol Grounds.",
    "Rep. Scott Perry, a U.S. Representative for Pennsylvania\nRep. Scott Perry received a letter on Dec. 20 requesting his voluntary cooperation? with the committee.",
    "That memo was reportedly turned over to the committee by Marc Short, Pence's former chief of staff, when Short testified before the committee for several hours.",
    "A comprehensive guide to social media posts from legislators about Jan. 6 before, during, and after the attack was first compiled by Rep. Zoe Lofgren last year.",
    "Then, on the day of the insurrection, Giuliani told a mob of Trump's supporters they would have trial by combat? if necessary to determine the election results.",
    "Rudy Giuliani, Trump's personal attorney\nThe former New York City mayor and personal attorney to Donald Trump received a subpoena from the committee on Jan. 18.",
    "Investigators say Peede met with Trump in his private dining room just off the Oval Office on Jan. 4 to discuss the impending rally on Jan. 6 and its speakers.",
    "That same meeting also featured suggestions to Trump that he declare a national emergency or invoke emergency powers, like martial law, to rerun? the election.",
    "Investigators hit Bannon with a subpoena on Sept. 23, and the Trump stalwart stonewalled the committee on both its record request and a request for deposition.",
    "The former commissioner for the New York Police Department and longtime ally of Rudy Giuliani, Bernard Kerik, was subpoenaed by the select committee on Nov. 8.",
    "Though he never had his moment at the Ellipse with Trump on Jan. 6, Jones did march, alongside right-wing extremists and Stop the Steal' founder Ali Alexander.",
    "The committee noted in its subpoena to Jones that when he arrived at the Capitol, he told people to gather on the east side of the complex to hear Trump speak.",
    "Following every trail, the committee has even called on officials who so much as waved alleged subversion conspirators into meetings with Trump or his lackeys.",
    "This is the most important call to action on domestic soil since Paul Revere and his ride in 1776,? Jones told listeners of his podcast, InfoWars, on Dec. 19.",
    "Multipleexpert witnesses and cyber experts identied acts of foreign interference in the election prior toNovember , 2020 and continued in the following weeks.",
    "Marc Short, a top aide to Pence who spent most of Jan. 6 at the former vice president's side, has been cooperating with the committee since at least December.",
    "The committee was primarily interested in learning how misinformation, like claims of widespread fraud in 2020, was allowed to spread on the respective sites.",
    "They include:\nDustin Stockton, a Stop the Steal' rally organizer who investigators say raised the alarm to Mark Meadows that the Jan. 6 event could be unsafe.",
    "He said:\nx\nJim Jordan in July when I asked if he'd be willing to talk to the select committee if they asked him to testify about his conversations with Trump.",
    "But at least one companyVerizondid disclose that the request was made and disclosed that to several figures who saw their metadata targeted by the committee.",
    "Election disinformation purveyor and Trump ally My Pillow CEO Mike Lindell sued the committee in January to stop a subpoena served on his telephone provider.",
    "Lawmakers rejected that argument as spurious since Trump earlier this year declined to assert privilege over materials requested by the committee from Clark.",
    "A long-time operative for the Republican Party and self-described dirty trickster,? Roger Stone was hit with a subpoena from the select committee on Nov. 22.",
    "That message, they added, was of course directly echoed by the mob that breached the Capitol in its attempt to interfere with the peaceful transfer of power.",
    "The Republican National Committee even went so far as to formally censure the only two GOPers on the probe: Rep. Cheney and Rep. Adam Kinzinger of Illinois.",
    "He also reportedly accepted $250,000 in Bitcoin for funds from a French computer programmer that may have been used to support the Stop the Steal' movement.",
    "Ross Worthington, former White House and campaign aide, helped former President Donald Trump write the speech that he delivered from the Ellipse on Jan. 6.",
    "If those boxes were unable to be located, an opening would have almost certainly been created for Trump's allies to cry fraud and use the alternate slates.",
    "Notably, there was an attempt by some who breached the Capitol to locate the authentic electoral ballot boxes on Jan. 6 with the real certificates inside.",
    "Flynn was one of the loudest voices for Trump in 2020 and made repeated calls that the president use the military to \"rerun? the election in swing states.",
    "The judge denied Scavino's request and unmasked him weeks later, ordering him to file his request to block the committee from his phone records publicly.",
    "John Eastman, attorney, author of the memo pressuring Mike Pence to overturn election results\n John Eastman, left, with Rudy Giuliani, right, on Jan. 6.",
    "Nothing could be further from the truth.?\nAlexander also said that the evidence he has provided thus far actually exonerates those members? and himself.",
    "Download this PDF\nof 42\nView on Scribd\nBut when Alexander finally sat for deposition with the committee on Dec. 9, he denied the lawmakers' involvement.",
    "Given the masking nature of malware and the current systems described here, if the State and Dominion simply standby and say, \"we have never seen it.\"",
    "When that happened, he instead spoke on Jan. 5 at Freedom Plaza at the invitation of the Eighty Percent Coalition and its head sponsor, Cindy Chafian.",
    "The Trump ally has expressed outrage at a variety of Trump officials who have agreed to testify including onetime Trump digital director Jason Miller.",
    "The committee subpoenaed Clark on Oct. 13 and in short order, entered into a battle with the former Trump official over claims to executive privilege.",
    "Bannon was often in Trump's ear, allegedly urging the president as early as Nov. 30 to plan for and focus his efforts on Jan. 6,? his subpoena noted.",
    "After a failed attempt to delay his trial until just before the 2022 midterms, a federal judge ruled on Dec. 7 that his trial would commence in July.",
    "Flynn's attorney said if the committee tried to speed up proceedings against Flynn, then another attempt a temporary restraining order could be made.",
    "Ali Alexander, right-wing extremist activist, Stop the Steal' rally organizer\n Ali Alexander (screenshot of YouTube feed published by The Intercept).",
    "The senior White House aide had a call with Trump on the morning of Jan. 6 to discuss possible ways to delay or stop the counting of electoral votes.",
    "The state official came into the spotlight during the 2020 election after Trump called him and pressured him to \"find? 11,000 votes for his campaign.",
    "Rep. Jim Jordan, a U.S. Representative for Ohio\nJordan was the second lawmaker to receive a request from the Jan. 6 Committee to voluntarily comply.",
    "Investigators say he has factual information that could illuminate Trump's thinking and conduct before, during, and after the attack on the Capitol.",
    "Any operational shortcuts now in seing up or running election equipment or\n soware creates other risks that can adversely impact the voting process.",
    "He, again, engaged with law enforcement offering to assist with guiding the crowd away from the Capitol steps and toward his permitted Lot 8 space.",
    "(6)\n e Assistant Secretary of Defense for Homeland Security will coordinate supportrequirements as needed from the Department of Homeland Security.",
    "Investigators have pursued Meadows because he was in Trump's vicinity on Jan. 6, bore witness to his conduct before, during, and after the attack.",
    "That jolted the committee into action and they voted unanimously to hold Meadows in contempt, sending the resolution to the full House for a vote.",
    "Once the national security adviser to former Vice President Mike Pence, now retired U.S. Army General Keith Kellogg was subpoenaed by on Nov. 23.",
    "The commentator has not received an official subpoena as of Jan. 5, 2022 but the committee did request that he voluntarily comply with the probe.",
    "Jordan has flip-flopped on his account of his interactions with Trump and specifically, has danced around answering what time of day they spoke.",
    "Powell's full-throated support of election fraud prompted Dominion Voting Systems and voting machine maker Smartmatic to sue her for defamation.",
    "Friendly' compliance\nOn Dec. 1, it was reported that Georgia Secretary of State Brad Raffensperger served as a witness in the committee's probe.",
    "Jones insisted many of the records sought after by the committee were protected under the First Amendment because he deems himself a journalist.",
    "Lawmakers sought Short's testimony because they believe he could illuminate how Pence conducted himself during the breach and who spoke to him.",
    "On Dec. 21, a full week after the Electoral College had certified the election for Joe Biden, Hice announced the impending meeting on Twitter.",
    "(2)\n Within 7 days of commencement of operations, the initial assessment must be provided to the Oce of the Director of National Intelligence.",
    "Miller was also at the White House on the morning of Jan. 6 and accompanied the former president on their short trip to Stop the Steal' rally.",
    "Giuliani is under federal investigation by prosecutors in New York for possible violations of foreign lobbying laws during a stint in Ukraine.",
    "He suggested Reps. Marjorie Taylor Greene of Georgia and Matt Gaetz of Florida ought to take up the mantle for Trump where McCarthy would not.",
    "He was also with Trump when Trump traveled to the Ellipse and while he delivered his inflammatory speech at the Stop the Steal rally that day.",
    "Untangling the web spun by right-wing extremists and militia groups in the run-up to Jan. 6 continues to be a central focus for investigators.",
    "Long before that November, however, Miller routinely crowed about Democrats stealing the election, lawmakers wrote in their notice to Miller.",
    "e nal assessment must be provided to the Oce of the Director of National Intelligence no later than 60 days from commencement of operations.",
    "Flynn was pardoned by Trump last December after being charged with lying to federal investigators about his contact with Russian officials.",
    "Clark appeared for a closed-door deposition with the committee on Nov. 5 but was uncooperative and eventually walked out without returning.",
    "There are also documents sought relating to Patel's personal involvement? in disrupting the peaceful transfer of power, the committee says.",
    "\"e Plaintis' national cybersecurity experts convincingly present evidence that this isnot a question of \"right this actually ever happen?\"",
    "The draft executive order would have permitted 60 days for the Defense Secretary to assess so-called irregularities in the 2020 election.",
    "Miller has been mostly quiet about Jan. 6 but recently threw his support behind Rep. Marjorie Taylor Greene, a rabid conspiracy theorist.",
    "While he once solicited donations on a Stop the Steal' official website, he removed the link after the attack, according to Mother Jones.",
    "All the while, the overall stakes for those involved in Trump's push to stop or delay the peaceful transfer of power have become steeper.",
    "It was reported in February that Tarrio had communication with D.C. police lieutenant Shane Lamondunrelated to the U.S. Capitol Police.",
    "The Archives rejected them because those who had signed were not recognized by their respective state officials as certified electors.",
    "Dominion Voting Systems and related companies are owned orheavily controlled and inuenced by foreign agents, countries, and interests.",
    "Multiple federal courts, however, have rejected this premise saying the panel is constitutional and has proper legislative authority.",
    "Trump told McCarthy it was antifa? that had breached the building and McCarthy pushed back, saying it was the president's supporters.",
    "As of February, the committee is still exploring whether it has the constitutional authority to formally subpoena fellow legislators.",
    "Kleinhenlder told CNN in January Powell never worked as a lawyer for the former president personally or for the Trump campaign.?\n22.",
    "No more stolen election talk,? and Yes, impeachment and the 25th Amendment are real and many people will quit,? he wrote to McEnany.",
    "Big tech requests and demands\nOver a dozen social media/technology companies received informal demands for information last summer.",
    "So-called alternate electors? held meetings, often broadcast them on social media, elected chairpersons, and appointed secretaries.",
    "Reports have circulated in February that the committee is weighing whether to issue a formal subpoena to the president's daughter.",
    "The committee pointed to his many public statements urging the destruction of the GOP if the election results were not overturned.",
    "Behind the scenes, investigators have reportedly been busy reviewing information about extremist groups' activities before Jan. 6.",
    "Patel slid into the Defense Department role after Trump canned Defense Secretary Mark Esper and put Chris Miller in Esper's place.",
    "Sean Hannity, Fox News host\n Fox News host Sean Hannity on a giant screen displayed at a Trump rally in Michigan in October 2021.",
    "He witnessed police and agitators? scrapping, he's said, and he took photos with pro-Trump former state legislator Rick Saccone.",
    "A response to the lawsuit was filed by Verizon on Feb. 11 indicating that the telecom giant had not yet turned over its records.",
    "Peter Navarro, Trump's onetime trade adviser was subpoaned on Feb. 9, a few months after his memoir In Trump Time was published.",
    "Meadows turned over about 9,000 pages of records, mainly emails, and texts, according to Jan. 6 Committee chair Bennie Thompson.",
    "Those alternate electors sent bogus slates from battleground states to the National Archives for certification on Dec. 14, 2020.",
    "He also denied, despite the existence of widespread reporting and video footage, that he was in Washington before and on Jan. 6.",
    "He fielded a battery of incoming messages where the commentators begged him to get Trump on television and ask people to leave.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Kimberly Fletcher, head of Moms for America, a pro-Trump group, coordinated a Jan. 5 rally at Freedom Plaza in Washington, D.C.",
    "Giuliani has been under investigation by the Justice Department for a few years regarding possible foreign lobbying violations.",
    "She has been producing records for that investigation on a rolling basis? as well according to her lawyer Howard Kleinhendler.",
    "Powell, to be clear, has not been charged with a crime in that case,\nPowell has agreed to cooperate with the Jan. 6 Committee.",
    "The start of the new year for the committee has brought with it too new pressures for Kevin McCarthy, leader of the House GOP.",
    "Perry was the first lawmaker to come into the select committee's purview though the request was not part of a formal subpoena.",
    "Given his outsized role in Trump's orbit, Giuliani breaking with the former president would be a major get for the committee.",
    "After nearly courting a contempt of Congress referral following weeks of obfuscation, he agreed to cooperate and be deposed.",
    "And this evidence is actually going to exonerate President Donald J. Trump, and we're really excited about that,? he added.",
    "Alexander once openly stated on Periscope that Rep. Mo Brooks, an Alabama Republican, helped him organize the insurrection.",
    "The other is devoted to assessing the wider scope of domestic extremism infiltration before and after the Capitol assault.",
    "Campaign finance records show Mastriano's campaign made three payments over six days for buses headed into D.C. on Jan. 6.",
    "Luna reportedly entered the Oval on Jan. 6 before his speech, handing Trump a note letting him know he was ready to go on.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Waldron, a retired colonel, was believed to be in close contact with Meadows, at least 8 or 10 times, after the election.",
    "Taylor Budowich, Trump's current primary political spokesperson and communications director for Trump's Save America PAC.",
    "Mark Meadows and John Eastman sued to keep phone records hidden as did onetime Trump White House adviser Sebastian Gorka.",
    "x\nBig meeting today with @realDonaldTrump, @VP, the President's legal team, @freedomcaucus and other Members of Congress.",
    "The resolution was condemnatory of their roles in the investigation, effectively casting both as traitors to their party.",
    "Alexander appeared for his deposition on Capitol Hill with his lawyer Joseph McBride and conspiracy theorist Jacob Wohl.",
    "Penrose was reportedly one of the individuals who met with John Eastman and Trump on Jan. 5 to strategize the overthrow.",
    "Kerik, who served three years in prison for tax fraud and was sentenced in 2010, was pardoned by Trump for those crimes.",
    "On Feb. 11, Liddell did not comment on reports that the transition process from Trump to Biden was particularly arduous.",
    "According to AP, As Pence's top aide, Short was also present for several White House meetings ahead of the insurrection.",
    "He also fingered Reps. Paul Gosar and Andy Biggs of Arizona for their involvement in those December 2020 clips as well.",
    "Committee investigators say Jones worked closely with members of Women for America First to organize rallies on Jan. 6.",
    "At 222-208, the House found Meadows in contempt and referred him for criminal prosecution to the Department of Justice.",
    "Meadows's attorney also sued the committee arguing a subpoena sent to Verizon for his cell phone records is overreach.",
    "The group allegedly discussed how to seize voting machines and election equipment in states Trump was losing to Biden.",
    "The committee claims Kerik was in cahoots with Giuliani since Nov. 5, 2020, to promote bogus election fraud theories.",
    "A war room? at the Willard Hoteljust a block from the White Housewas often populated by Trump's lawyers and advisers.",
    "The company had to disclose that information so the individuals subpoenaed would have a chance to contest the matter.",
    "Ben Williamson, a deputy assistant to Trump and senior adviser to Meadows, has records similar to that of Liddell's.",
    "McCarthy, Bannon said, refused to counterprogram? events on Capitol Hill that solemnly commemorated the anniversary.",
    "This decision, made in alignment with other Trump congressional cronies, has queued up quite a tricky legal thicket.",
    "He sues for declaratory judgment pursuant to Rule 57 of the Federal Rules of Civil Procedure (\"FRCP\") and 28 U.S.C.",
    "The rival slates were a key component of the Trump White House's push to stop or delay the certification on Jan. 6.",
    "This January he allowed the former president to continue making baseless election fraud claims without fact check.",
    "Casey and Fuentes used to be close but have reportedly fallen out with each other in the wake of the insurrection.",
    "He whipped people into a chant of victory or death.?\nEarly on Dec. 4, though he raged on Telegram about the probe.",
    "e intentional errors lead\n to bulk adjudication of ballots with no oversight, no transparency, and no audit trail.",
    "Trump speaks at the Ellipse on Jan. 6, delivering remarks that Congress found to be incitement of an insurrection.",
    "The select committee has reportedly formed two separate teams just to investigate the domestic extremism elements.",
    "Kashyap Patel, former chief of staff to then-acting Secretary of Defense Christopher Miller\n Kashyap Kash? Patel.",
    "(IEEPA) and allapplicable Executive Orders derived therefrom, the National Emergencies Act (50 U.S.C.1601et seq.)",
    "Budowich sued the Committee in late December in a bid to stop investigators from reviewing his financial records.",
    "Kathy Berden and Michael McDonald serve as the chairs of the Michigan and Nevada Republican Party, respectively.",
    "Upon receipt of subpoena, Stone informed the committee on Dec. 7 that he would invoke his Fifth Amendment right.",
    "Greene saw her personal Twitter account booted from the platform after she shared disinformation about Covid-19.",
    "Many Republicans in Congress have derided the committee as a political cudgel unmoored from legislative purpose.",
    "Pleading from Kellogg and other officials to Trump that he make an announcement calling for peace went ignored.",
    "Investigators say Jordan had at least one and possibly multiple? exchanges with Trump on the day of the attack.",
    "Trump fired Krebs after the election and after Krebs stood vehemently against Trump's claims of election fraud.",
    "By the minute\nFor a minute-by-minute breakdown of Jan. 6, 2021, check out the tick-tock outline available here.",
    "Putting the demand on McCarthy would be undeniably historic and would set the stage for a fierce legal battle.",
    "(5)\n e Secretary of Defense may select by name or by unit federalization of appropriateNational Guard support.",
    "As of Feb. 14, the Trump stalwart has been ordered to produce records specific to Jan. 4 through Jan. 7, 2021.",
    "Jeffrey Clark, former assistant attorney general for the Department of Justice Civil Division\n Jeffrey Clark.",
    "But not long after that agreement, he did an about-face and informed the committee he would no longer comply.",
    "In February, the committee issued several more subpoenas to those involved with the alternate elector scheme.",
    "continues to promote election fraud allegations and threatened to take over the nation's election apparatus.",
    "Alexander was a VIP guest at the Ellipse rally on January 6, 2021, at which President Donald J. Trump spoke.",
    "Alex Jones, conspiracy theorist, ring wing personality\n Alex Jones addressing Trump's supporters on Jan. 6.",
    "Bannon was not officially in Trump's employ at the time of the assault; he left the administration in 2017.",
    "In a statement on Dec. 9, Patel said he was answering the committee's questions to the best of his ability.",
    "Mastriano has not been charged with any wrongdoing and he's been insistent that he was against the rioting.",
    "The following individuals include administration and White House officials as well as Trump campaign staff.",
    "The rest of Pence's staff have followed suit, drawing the ire of allies like Roger Stone and Steve Bannon.",
    "in the 40 years I have been in American politics I have never met a bigger more despicable piece of shit.",
    "Alexander's efforts to help the Capitol Police to deescalate the tension, captured on video, was in vain.",
    "While the Capitol was under siege, McCarthy said he spoke to Trump and Trump rebuffed his pleas for help.",
    "And worse, I'm not sure what is left to do or say and I don't like not knowing if it's truly understood.",
    "Raffensperger was not formally subpoenaed but said in August that he would cooperate with any inquiries.",
    "He did not identify the sender or the recipient by name nor their telephone number for privacy purposes.",
    "Then on Dec. 31, as noted in this interview, Kerik finally handed over a privilege log to the committee.",
    "He surrendered himself to authorities in Washington, D.C. after the Department of Justice indicted him.",
    "In a message on the right-wing social media platform Gab posted on Jan. 22, Stone lashed out at Miller.",
    "The committee postponed his deposition on Dec. 9 after he finally began cooperating with investigators.",
    "The alternate electors? sent their certificates to the National Archives but the records were rejected.",
    "Jones allegedly tried to nab a speaking spot with Trump on Jan. 6 but was denied by fellow organizers.",
    "Flynn was scheduled for a deposition in early December but was granted a brief delay by the committee.",
    "Miller vowed alternate electors? would keep Trump in power in an interview with Fox News in late 2020.",
    "Kash met with the committee on Dec. 9, according to CNN reporters who were staked out in the Capitol.",
    "Grisham reportedly told investigators that Mark Meadows helped coordinate the clandestine gatherings.",
    "They are curious to learn more about her role wrangling her father as the assault was underway, too.",
    "It featured a list of documents that the former police commissioner was unwilling to provide freely.",
    "Much of those activities, the committee has learned, were overseen by Trump attorney Rudy Giuliani.",
    "And including a lawsuit with Nancy Pelosi, but again, it's just like the birth of \"Stop the Steal.\"",
    "Guilfoyle previously boasted about raising over $3 million for the Stop the Steal' rally on Jan. 6.",
    "Investigators say she helped Meadows promote baseless claims of election fraud to state officials.",
    "He was also slated to speak at an event at the Ellipse that day hosted by Women for America First.",
    "Cheney responded to the censure in a style now ubiquitous with her role on the committee: defiant.",
    "Text messages revealed Meadows spoke to Fox News hosts Sean Hannity and Laura Ingraham on Jan. 6.",
    "For right-wing extremists, those events may have served as proving grounds? for the insurrection.",
    "Download this PDF\nof 3\nView on Scribd\nEllis Legal Memos Election Fraud by Daily Kos on Scribd\n23.",
    "Investigators say Liddell tried to resign during the attack but was coaxed out of that decision.",
    "One of the men in his detail, Robert Minuta, has been indicted on charges related to the breach.",
    "What is known publicly about the extent of Miller's cooperation with the probe is murky at best.",
    "John McEntee, former bag man turned White House personnel director\n John McEntee, pictured left.",
    "Michael Flynn, former national security adviser, and Trump's personal assistant\n Michael Flynn.",
    "Kellogg was privy as well to conversations where Trump insisted Pence not certify the election.",
    "Epshteyn also regularly attended? meetings at the Trump admin's war room? at the Willard Hotel.",
    "I will help reinforce...?\nBoris Epshteyn, a senior White House aide, was subpoenaed on Jan. 18.",
    "The former chairwoman of the Michigan Republican Party, Laura Cox, was subpoenaed in February.",
    "Witnesses overheard Mastriano say that voter systems had been hacked? as he left that meeting.",
    "Schmitz, notably, was accused of making anti-semitic remarks during his stint at the Pentagon.",
    "Alexander has sponsored hundreds of rallies with millions of participants in all fifty states.",
    "A spokesperson said Flynn had agreed to engage? with investigators but talks later fell apart.",
    "it has been reported that Scavino kept at least two phones during his time at the White House.",
    "That plot unfolded well after courts had rejected Trump's claims of election almost 60 times.",
    "[FOOTNOTE 1: Case 1:17-cv-02 ?-AT Document 64 Filed 10/11/20 Page 146 of 147]And, yet it did.",
    "(4)\n A direct liaison to be authorized to coordinate as required between the applicable U.S.",
    "Keith Kellogg, national security adviser to former Vice President Mike Pence\n Keith Kellogg.",
    "Kellogg was the first person in Pence's inner circle to receive a demand from the committee.",
    "I talked tonight to the Proud Boys to make sure that they were all covered,? Alexander said.",
    "Alex Jones sued investigators in December, trying to keep scrutiny away from his phone data.",
    "He has entered a not guilty plea and will remain in detention ahead of his trial this July.",
    "Casey told investigators he would not cooperate voluntarily before the subpoena was issued.",
    "Kellogg felt she was one of the only people who could garner a response from the president.",
    "He also said he had contact with the lawmakers in a lawsuit he filed against the committee.",
    "Through his attorney, Clark eventually announced he would invoke his Fifth Amendment right.",
    "In those cases, Alexander only noted the date and time of the text and the subject matter.",
    "Since the electors were unsanctioned, the Archives deemed the certifices to be unofficial.",
    "They sat for lengthy depositions and otherwise cooperated with the committee in November.",
    "Hutchinson also joined Meadows for a Dec. 30 trip to Georgia for an election audit there.",
    "Less than a week later, on Dec. 29, 2020, in another livestream, Alexander said it again.",
    "Conspiracy theory and smut peddler Alex Jones was subpoenaed by the committee on Nov. 22.",
    "Daniel Scavino, former White House deputy chief of staff for communications\n Dan Scavino.",
    "While it was his right to do so, such shrouding can only be done with a judge's approval.",
    "Robert Bobby? Peede Jr., the former deputy assistant to Trump, was subpoenaed on Dec. 9.",
    "Miller received Trump's full-throated endorsement for his congressional run in December.",
    "x\nx\nMillions of books, audiobooks, magazines, documents, sheet music, and more for free.",
    "Those people, we've said from the very beginning, should be in jail,? McCarthy told CNN.",
    "Bannon has since spent time boasting on his podcast about Trump's non-existent victory.",
    "Its deadline would have fallen after President-elect Joe Biden's inauguration, however.",
    "Any motions to dismiss the contempt indictment/exclude evidence must be in by April 8.",
    "Investigators allege he was in close contact with Trump immediately before the attack.",
    "Electoral dysfunction - cyber or otherwise - should notbe desired as a mode of proof.",
    "x\nStephen Miller says Trump electors will be voting and sending results to Congress.",
    "Bernard Kerik, former New York Police Department police commissioner\n Bernard Kerik.",
    "- but *when it will happen,especially if further protective measures are not taken.",
    "His One Nation Under God? rally did not take place and he left the Capitol Grounds.",
    "Stepien has since signed onto advise Ohio Republican Mike Gibbon's senate campaign.",
    "Jan. 6 rally organizers\nA lengthy list of rally organizers has come under scrutiny.",
    "That prompted formal subpoenas to be submitted to those four entities this January.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Chair Thompson recently called his cooperation as witness crucial? to their probe.",
    "But our office researched that and recognized that was never an option,? he said.",
    "Stone has also said that he was invited to lead a march to the Capitol on Jan. 6.",
    "Kellogg met with Trump before the president delivered his remarks at the Ellips.",
    "He finally sat for deposition on February 2 for a swift one hour and 40 minutes.",
    "x\npic.twitter.com/aAlnLX0CTk\n Rep. Jim Jordan (@Jim_Jordan) January 10, 2022\n18.",
    "Further, Ellis said, portions of the Electoral Count Act were unconstitutional.",
    "A federal judge on Dec. 21 scrapped a lawsuit against the committee from Flynn.",
    "ese\n risks are neither hypothetical nor remote under the current circumstances.",
    "Over 500 interviews have been conducted by the select committee as of February.",
    "The Jan. 6 Committee is expected to recommence its public hearings this spring.",
    "Patel made for a good yes-man and rose quickly to the White House as a result.",
    "Stone has also berated Pence on the right-wing social media platform Telegram.",
    "By the time bogus electors met in December, Trump had lost dozens of lawsuits.",
    "On Dec. 21, Perry said that he would not cooperate with the voluntary request.",
    "Saccone spent Jan. 6 celebrating the storming of the Capitol on social media.",
    "e system\n intentionally generates an enormously high number of ballot errors.",
    "The committee's work presses forward despite major pushback from Republicans.",
    "One group is focused on the extremist-related events that occurred on Jan. 6.",
    "Alexander himself has been subject to numerous death threats and harassment.",
    "Ali Alexander is a walking, talking ball of contradictions and conflations.",
    "You can always tell when Jason Miller of Gettr is lyinghis lips are moving.",
    "Jason Miller, former senior adviser to Trump's 2020 campaign\n Jason Miller.",
    "It was Miller's own public statements that piqued the committee's interest.",
    "And hey, all they want to talk about all day long is Omicron and 6 January.",
    "In its subpoena, the committee asked Ellis to sit for deposition on Feb. 8.",
    "Kellogg testified that Ivanka made multiple attempts to soothe her father.",
    "The Alternate Electors?\n Kelli Ward and her husband, Michael Ward in 2018.",
    "Epshteyn has continued to promote claims that Trump won the 2020 election.",
    "A medical condition barred him from appearing for several weeks, however.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "The group was also identified as a participant in the rally on Jan. 6.",
    "Investigators say he also paid for vendors associated with that event.",
    "Alexander also named Speaker of the House Nancy Pelosi in the lawsuit.",
    "e Dominion Voting system is owned and controlled by foreign entities.",
    "The former federal prosecutor was slapped with a subpoena on Jan. 18.",
    "When a contempt referral was threatened, Clark agreed to be deposed.",
    "He said the records were to be protected under executive privilege.",
    "Attorney General Merrick Garland has been mum about the next steps.",
    "He appeared with his attorney and was carrying a bevy of documents.",
    "Eastman unsuccessfully sued the committee and Verizon in December.",
    "Bannon was, however, at Trump's alleged command center? on Jan. 5.",
    "Roger Stone, longtime Trump ally and GOP operative\n Roger Stone.",
    "Scavino sued Verizon on Jan. 5, 2022, and under some subterfuge.",
    "Anybody who broke in and caused damage, that was not called for.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "The committee demanded Verizon handover his records in December.",
    "No legislative act,' wrote Alexander Hamilton in Federalist No.",
    "These efforts were reportedly led or overseen by Rudy Giuliani.",
    "Use immunity was also granted, quite famously, to Oliver North.",
    "Stephen Miller, former senior adviser to Trump\n Stephen Miller.",
    "I mean, my full-time job is to comply with Congress,? he said.",
    "Mark Meadows, former White House chief of staff\n Mark Meadows.",
    "Tarrio was a prolific? informer for law enforcement for years.",
    "Navarro was a vocal supporter of fraud claims in the election.",
    "A request for his deposition has been set for early February.",
    "Under the Electoral Count Act such submissions are forbidden.",
    "Lamond was put on leave in relation to those communications.",
    "Meadows is still a staunch defender of the former president.",
    "Designated locationswill be identied in the operation order.",
    "The committee issued its subpoena to John McEntee on Nov. 9.",
    "We care because we care about the legitimacy of our process.",
    "A digestible recap with source documents is available here.",
    "She allegedly watched the attack unfold with him or nearby.",
    "McEnany's sat for questioning by the committee on Jan. 12.",
    "The second memo from Jan. 5, 2021, delved slightly deeper.",
    "Steve Bannon, former White House strategist\n Steve Bannon.",
    "The guest list also included Jim Penrose and Seth Kershel.",
    "Therefore, the judge found, Flynn's request was meritless.",
    "I got him his job with Donald Trump in 2016,? Stone said.",
    "He initially filed his request as an anonymous plaintiff.",
    "I will lead an objection to Georgia's electors on Jan 6.",
    "Kash Patel was subpoenaed by the committee on Sept. 23.",
    "He has told the press that he declined the opportunity.",
    "It may well land unfortunately on the State's doorstep.",
    "Bannon has been kicking up dust as he awaits his trial.",
    "Trump's former Chief of Staff Mark Meadows is in deep.",
    "Scavino was subpoenaed by the committee in September.",
    "The courts refuse to hear the President's legal case.",
    " RepScottPerry (@RepScottPerry) December 21, 2021\n17.",
    "Shafer is the chair of the Georgia Republican Party.",
    "Katrina Pierson was also reportedly at this meeting.",
    "And we love it,? he said of the media last December.",
    "No one understands the crazy connections that I see.",
    "As of Dec. 16, the ball remains in the DOJ's court.",
    "Kenneth Klukowski, senior counsel to Jeffrey Clark.",
    "McEntee's ascent into Trump's world happened fast.",
    "Those calls were rampant in a Dec. 18 draft memo.",
    "I am doing all this legal preparation for myself.",
    "The nature of those records has been under wraps.",
    "Ellis was subpoenaed by the committee on Jan. 18.",
    "Since the request, he's hosted Trump on his show.",
    "You can just either believe me or not, you know?",
    ", for an injunction and pursuant to 18 U.S.C.",
    "This memo went to Trump attorney Jay Sekulow.",
    "He was scheduled for deposition in December.",
    "She's faced professional sanctions as well.",
    "A whopping 77% expressed support for QAnon.",
    "I did not have a good call with him today.",
    "Kerik has publicly denied the allegations.",
    "He was initially subpoenaed on Sept. 23.",
    "It was the second time he was impeached.",
    "And then the left decides it's a threat.",
    "We're going to make sure the People can!",
    "Costello also represents Rudy Giuliani.",
    "is leads\n to voter or election fraud.\"",
    "This is a short blurb about Daily Kos.",
    "The FBI is scrutinizing that funding.",
    "Ask people to leave the Capitol.?\n19.",
    "He's railed against the Jan. 6 probe.",
    "Trump was impeached for this conduct.",
    "He can't mention the election again.",
    "\"Yeah, I've got nothing to hide.\"",
    "We are a constitutional republic.",
    "Not a single one turned violent.",
    "And so I'm really proud of that.",
    "Miller was subpoenaed on Dec. 9.",
    "That order was never published.",
    "Cox has denied any wrongdoing.",
    "the future does not bode well.",
    "e\n Court certainly hopes not.\"",
    "My team will find you a room.",
    "Key targets under scrutiny\n1.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "And then everyone sees it.",
    "Departments and Agencies.",
    "He goes to trial in July.",
    "She responded, Love that.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Opposition by April 29.",
    "That is the playbook.",
    "Cuz nobody cares.",
    "1 ?00 of May 11.",
    "INTRODUCTION\n 1.",
    "Please read it.",
    "2201,\n et seq.",
    "1701 et seq.)",
    "Thank you.",
    "x\ngWOW!",
    "(B.O.",
    "Ever.",
    "20.",
    "21.",
    "24.",
    "15.",
    "16.",
    "11.",
    "12.",
    "13.",
    "14.",
    "9.",
    "7.",
    "8.",
    "2.",
    "3.",
    "6.",
    "4.",
    "5.",
    "9.",
    "5.",
    "8.",
    "6.",
    "7.",
    "2.",
    "3.",
    "4."
  ]
}