{
  "id": 442,
  "mediaId": 238,
  "date": "2/19/2022 12:00:00 AM",
  "headline": "The top 10 GOP presidential candidates for 2024, ranked",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/02/19/top-10-gop-presidential-candidates-2024-ranked/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1053,
    1147,
    1710,
    1758,
    2087,
    2250,
    2326,
    2409,
    3094,
    428,
    2953
  ],
  "sentences": [
    "That most recent development: Pence saying earlier this month that Trump was wrong? that Pence could have tried to unilaterally overturn the election  and repeating that the idea itself was extremely un-American.? Trump, though, has notably declined to go after Pence like he has others who run afoul of him.",
    "Nikki Haley: The former United Nations ambassador and South Carolina governor has, perhaps more than anybody on this list, struggled to decide whether she's angling to run in Trump's GOP or a post-Trump GOP.",
    "His groveling session with Tucker Carlson seemed to suggest a guy who doesn't really know what his plan is or how to do anything except try to be whatever he thinks the right people want him to be.",
    "And it doesn't hurt that his move to rescind school mask mandates in Virginia preceded a bunch of blue-state Democrats doing the same (albeit without necessarily banning them, as Youngkin has).",
    "Mike Pompeo: It's not necessarily a telltale, but dropping a ton of weight and paying big bucks for media training aren't things you have to do if your goal is merely to be a Fox News pundit.",
    "Most recently that has taken the form of her endorsing another South Carolina Republican who has struggled with the same thing, Rep. Nancy Mace, over Trump's preferred primary challenger.",
    "One encouraging sign for Pence: Even though most Republicans wrongly believe Trump won the election, most agree with Pence that he didn't have the ability to overturn the election.",
    "Tim Scott: The U.S. senator from South Carolina is raising huge money  $7 million last quarter  for something which should, by all accounts, be a pretty sleepy reelection race.",
    "But we will start getting a sense for where the activist wing of the party stands this week at the Conservative Political Action Conference, which will include a straw poll.",
    "With that around the corner, we thought it would be a good time to dust off our quarterly rankings of the 10 people most likely to be the next GOP presidential nominee.",
    "Ted Cruz: The U.S. senator from Texas finished second in the 2016 contest, and with that often comes something amounting to front-runner status the next time around.",
    "As usual, this list is in order of the probability of getting nominated  a formula that takes into account how likely each candidate is to run in the first place.",
    "He also stays here because, unlike many others on this list, it seems possible he might run even if Trump does  and could even have a shot in that scenario.",
    "Youngkin's 2021 win in a blue-leaning state  and the conservative governance that has followed  are going to continue to be cited as a model for the party.",
    "Unfortunately for him, his refusal to go along with trying to overturn the 2020 election has led to an extended exercise in trying to massage the fallout.",
    "Chris Sununu: The New Hampshire governor broke some GOP hearts by declining to run for Senate; he would've been a major recruit in a key race.",
    "Except Cruz badly miscalculated (or, perhaps, he said what he felt) when he tried to make an anti-Trump scene at the 2016 GOP convention.",
    "And the interaction between the two is understandably going to be a major subplot of the looming 2024 race in the coming months.",
    "He's also got some legal issues to worry about, and perhaps some declining GOP patience with making everything about 2020.",
    "The obvious answer would seem to be DeSantis, but there's some brewing tension between him and Trump (more on that later).",
    "If the party wants a middle-finger candidate again, the next-of-kin might be an obvious answer for lots of casual voters.",
    "In the nascent jockeying for the Republican presidential nomination in 2024, it's Donald Trump and everyone else.",
    "Mike Pence: Were it not for Jan. 6 and everything that surrounded it, Pence would be up there in the top three.",
    "All that said, we have long contended that when Haley can put it together, she's a very talented politician.",
    "And you have to wonder whether Trump supporters will believe he's one of them enough to get over that hump.",
    "It asked whether people wanted Trump to be the nominee again, and about half of Republicans said they did.",
    "He said he had been close to running, but that he spoke with GOP senators and found them lacking ambition.",
    "He'd probably be better able to massage the pro-Trump/anti-Trump divide than a lot of others on this list.",
    "That's, of course, a helpful thing to say for a guy running for reelection as governor in a swing state.",
    "He has since tried real hard  perhaps a little too hard  to appeal to the Trumpian wing of the party.",
    "Sununu in November demurred about presidential ambitions, emphasizing his 2022 campaign comes first.",
    "That's not as high as it used to be, but it would probably be plenty to renominate him, if it held.",
    "Some of them will speak at CPAC; others (such as former vice president Mike Pence) notably won't.",
    "Who else on this list is truly ready to lock down a significant majority of Trump supporters?",
    "He's also doing something lots of presidential candidates do before running: release a book.",
    "The former secretary of state and Kansas congressman is a good bet to run if Trump doesn't.",
    "And since doing so, he has made some pretty interesting comments about the national GOP.",
    "And he has less relevant experience on that front than even his dad did six years ago.",
    "Their relative receptions at CPAC starting Thursday will certainly provide some hints.",
    "He suggested they were mostly interested in holding the line against President Biden.",
    "He has also suggested the party is overzealous in casting out anti-Trump Republicans.",
    "Plenty of battles lie ahead in Virginia, though, with a closely divided legislature.",
    "Others either aren't terribly Trump-y in their approach or have waffled on Trumpism.",
    "Then the pollster asked an open-ended question of the rest: If not Trump, then who?",
    "Of course, the younger Trump would have to run a campaign to capitalize on that.",
    "Glenn Youngkin: The other newcomer on this list is the governor of Virginia.",
    "But Cruz struggles from the fact that people just don't seem to like him.",
    "Fully 60 percent of those who didn't want Trump just wanted someone else.",
    "Or, if we're leaning into this being a contest, it's Trump, Florida Gov.",
    "Donald Trump Jr.: This might feel high, and it might indeed be.",
    "But imagine a scenario in which the elder Trump doesn't run.",
    "), former New Jersey governor Chris Christie and Texas Gov.",
    "Also mentioned: Sen. Rick Scott (Fla.), South Dakota Gov.",
    "A CNN poll released over the weekend drove this home.",
    "And no other candidate got more than 1 percent.",
    "People clearly haven't thought about this much.",
    "1 status is not as prohibitive as it once was.",
    "Of course, that posture has alienated Trump.",
    "But could it also be a national platform?",
    "Kristi L. Noem, Sen. Josh Hawley (Mo.",
    "Ron DeSantis: DeSantis stays at No.",
    "Another 21 percent named DeSantis.",
    "Larry Hogan, Sen. Tom Cotton (Ark.",
    "Needless to say, it's very early.",
    "Ron DeSantis and everyone else.",
    "2 because of the poll above.",
    "(Previous ranking: N/A)\n8.",
    "(Previous ranking: N/A)\n7.",
    "What's next for Youngkin?",
    "(Previous ranking: 10)\n9.",
    "(Previous ranking: 6)\n6.",
    "(Previous ranking: 4)\n5.",
    "), Rep. Liz Cheney (Wyo.",
    "(Previous ranking: 5)\n3.",
    "(Previous ranking: 2)\n1.",
    "Donald Trump: Naturally.",
    "(Previous ranking: 7)\n4.",
    "(Previous ranking: 3)\n2.",
    "We'll see if that holds.",
    "(Previous ranking: 1)",
    "That said, his No.",
    "), Maryland Gov.",
    "Greg Abbott\n10.",
    "Tax reform."
  ]
}