{
  "id": 445,
  "mediaId": 124,
  "date": "2/18/2022 12:00:00 AM",
  "headline": "Conor Lamb makes his contrast argument for Pennsylvania Senate bid",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_07/3535855/220218-connor-lamb-mn-0840.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/conor-lamb-makes-his-contrast-argument-pennsylvania-senate-bid-n1289313",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    701,
    1147,
    1159,
    1248,
    1459,
    1609,
    1622,
    1770,
    2095,
    3085,
    3094,
    517,
    600
  ],
  "sentences": [
    "He's never beaten a Republican in a big race before.?\nFetterman versus Lamb (along with fellow Democrat Malcolm Kenyatta) is arguably the top Democratic primary in maybe the most important Senate contest in the country  especially when it comes to Democrats' ability to maintain their Senate majority.",
    "Well, we got our hands on an interview that NBC10 Philadelphia political reporter Lauren Mayk conducted with Pennsylvania Senate Democratic candidate Conor Lamb, in which Lamb makes his contrast argument versus fellow Democratic frontrunner John Fetterman.",
    " Julie Tsirkin (@JulieNBCNews) February 17, 2022\nThat's how much Democratic challenger Jessica Cisneros raised between Jan. 1 and Feb. 9, per the latest round of FEC reports, a massive advantage over her primary opponent, Democratic Rep. Henry Cuellar.",
    "And by choosing someone like Joe Biden as our president, which Philadelphians did, and by sending people like me back to Congress that kept us in the majority, we got one of the most progressive pieces of legislation ever done in our lifetime.",
    "During the Democratic lunch, Ron Klain stressed the importance of bipartisanship, and outlined some themes for the upcoming SOTU - which include addressing the economic concerns of the American people (inflation), per multiple Senators.",
    "Former New York Times columnist Nicholas Kristof won't be on the ballot in Oregon's gubernatorial race after the state Supreme Court refused to overturn the secretary of state's decision that he didn't meet residency requirements.",
    "Rep. Conor Lamb, D-Pa., is facing scrutiny in his campaign for the U.S. Senate for possibly being too close to union leaders who've been indicted or convicted on corruption charges, the Philadelphia Inquirer reports.",
    "Special Council John Durham, who Trump appointed to investigate the Russia investigation, distanced himself from the right-wing media outcry over a recent court filing from his investigation, per the New York Times.",
    "Other numbers you need to know today:\n21: The number of days until the new government funding deadline after senators approved a bill last night averting a government shutdown and extending the deadline to March 11.",
    "And this establishment/progressive/results/ideology debate comes as Democratic strategists and candidates assess whether they went too far to the left during the Trump years, as the Washington Post writes.",
    "11.6 million: The potential number of Hispanic voters in this year's midterm elections, per an estimate from the National Association of Latino Elected and Appointed Officials Educational Fund.",
    "Former President Donald Trump, meanwhile, issued a statement yesterday backing a bill in Wyoming that would end the practice that allows voters to choose their party affiliation on primary day.",
    "57 percent: The percentage of voters in the Democratic Congressional Campaign Committee's internal polling who said Democrats have taken things too far in their pandemic response,? per SFGATE.",
    "But Cuellar had a spending edge over Cisneros during that time  he dug deep into his cash reserves, spending $1.2 million and ending Feb. 9 with nearly $1.3 million in cash on hand.",
    "Instead, Ron Johnson served himself.? The ad goes on to accuse Johnson of pushing for a tax loophole in the 2017 tax law that benefitted his family business and his wealthy donors.",
    "Donald Trump will hold a fundraiser at his Mar-A-Lago resort in Florida next month to benefit former Sen. David Perdue in his campaign to oust Georgia's governor, Brian Kemp.",
    "67 percent: The decline in the two-week average of Covid cases, as of Thursday evening, a trend that's prompted cities across America to lift vaccination requirements.",
    "Texas voters incorrectly sent thousands of mail-in ballot requests to the secretary of state's office instead of local election offices at the direction of Lt. Gov.",
    "Pennsylvania Republican Senate hopeful Dave McCormick dropped out of Monday's GOP primary debate after finding out that a top rival, Mehmet Oz, was not attending.",
    "But first: We told you on Thursday that top Democratic primary candidates have been holding their fire so far when it comes to negative ads and attacks.",
    "It's the third such ad funded by the group Opportunity Wisconsin to attack the sitting senator, who announced his bid for re-election last month.",
    "A new ad accusing Sen. Ron Johnson, R-Wis., of corruption and questioning his integrity is on the airwaves in Wisconsin, according to AdImpact.",
    "House GOP Conference Chairwoman Elise Stefanik, who replaced Cheney in leadership, also announced this morning that she is backing Hageman.",
    "... And Jessica Cisneros outraises Henry Cuellar as the primary race enters the home stretch in Texas' 28th Congressional District.",
    "The GOP super PAC Congressional Leadership Fund, which is aligned with McCarthy, is spending ahead of the March 1 Texas primaries.",
    "Look up the facts and tell Ron Johnson to stop passing tax laws that benefit himself,? the narrator says at the end of the ad.",
    "House Minority Leader Kevin McCarthy endorsed Harriet Hageman yesterday in her primary race against Rep. Liz Cheney, R-Wyo.",
    "I'm someone that does this job because I want to make progress.?\nQ: How do you distinguish yourself from John Fetterman?",
    "In Ohio, the state Democratic Party endorsed Rep. Tim Ryan, despite Ryan having a primary challenger in Morgan Harper.",
    "I have actually worked on and voted for most of the really important bills that we need our next senator to vote for.",
    "CLF spent $528,000 on the airwaves to bolster Morgan Luttrell in the solidly Republican 8th District, per AdImpact.",
    "(Johnson defended his efforts as part of his push to simplify the tax code and help businesses remain competitive.)",
    "Sen. Susan Collins, R-Maine, makes her pitch to reform the 1887 Electoral Count Act in a New York Times op-ed.",
    "Cuellar's campaign spent $794,000 on media buys and ads while Cisneros' campaign spent $583,000 on TV spots.",
    "And in the 15th District, the group also launched a radio ad knocking Monica de la Cruz's primary opponent.",
    "Former Rep. Debbie Mucarsel Powell, D-Fla., announced yesterday that she won't run for Congress this year.",
    "I've also shown I can win in tough areas.?\nQ: Can you represent Philadelphia's progressive voters?",
    "... New York judge orders Donald Trump and his children to testify under oath in civil probe.",
    "I think you should define it by results, just not the rhetoric you use or speeches you give.",
    "Meanwhile, in the Keystone State, Tennessee Republican Sen. Bill Hagerty endorsed McCormick.",
    "WASHINGTON  If it's Friday ... Reports of new shelling in Ukraine raise invasion fears.",
    "The ad opens with a narrator saying, He should have used his power to serve Wisconsin.",
    "He doesn't have those votes, he doesn't have any accomplishments as a legislator.",
    "... House Minority Leader Kevin McCarthy endorses challenger to Rep. Liz Cheney.",
    "... Congress sends spending bill to Biden's desk to avert government shutdown.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "It was the American Rescue Plan.?\nQ: Do you consider yourself a progressive?",
    "Lamb: I think I have the experience of doing the job serving in Washington.",
    "It's a refrain Opportunity Wisconsin keeps using in ads blasting Johnson.",
    "And NBC News Now looks at the history  and impact  of Olympic boycotts.",
    "The interview will air on Sunday, but here's a sneak peek Mayk sent us.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "One ad from January has a Navy retiree repeating the same message.",
    "Lamb: I always ask people how you define a word like progressive.",
    "Both candidates spent the bulk of their campaign cash on ads.",
    "It's about achievements, it's about getting things done.",
    "I can tell you all the bills I've passed and voted for.",
    "Ron Johnson has doubled his wealth since taking office.",
    "De la Cruz also nabbed Trump's endorsement yesterday.",
    "Cisneros spent $791,000 and had $410,000 in the bank.",
    "Dan Patrick's campaign, The Texas Tribune reports.",
    "I've won three elections under a tough spotlight.",
    "Q: Why should you be Pennsylvania's next senator?",
    "Cuellar, by comparison, raised just $147,000.",
    "Politico first reported the decision.",
    "... His experience is much different.",
    "Lamb: I think based on our records.",
    "What are the results that you get?",
    "Lamb: Absolutely, yeah.",
    "...",
    "..."
  ]
}