{
  "id": 451,
  "mediaId": 881,
  "date": "2/18/2022 12:00:00 AM",
  "headline": "The Big Lie Is Turning Fringe Candidates Into MAGA Stars",
  "image": "https://video-images.vice.com/articles/620fb8ffd0c5e70095086bab/lede/1645204006278-ap21006618398013.jpeg?crop=1xw:0.843656592494188xh;center,center&resize=1000:*",
  "link": "https://www.vice.com/en/article/88gdb3/the-big-lie-is-turning-fringe-candidates-into-maga-stars",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron Joseph",
  "authorUrl": "https://www.vice.com/en/contributor/cameron-joseph",
  "termIds": [
    1839,
    1839,
    1850,
    1850,
    2131,
    2131,
    661,
    661,
    1121,
    1121,
    1147,
    1147,
    1202,
    1202,
    308,
    308,
    428,
    428,
    2621,
    2621
  ],
  "sentences": [
    "This week in subpoenas (and speaking of statewide GOP figures from key swing states), on Tuesday the Jan. 6 committee subpoenaed a half-dozen Trump allies who the committee thinks may have information about efforts to send false slates of electors to Washington and change the outcome of the 2020 election.?\nThat list includes Trump's endorsed candidate for Arizona secretary of state, Mark Finchem; Pennsylvania state Sen. Doug Mastriano, who's running for governor; Arizona Republican Party Chairwoman Kelli Ward; and former Michigan Republican Party Chairwoman Laura Cox.",
    "As your Governor, when I lay down my head on MyPillow every night, I will only be able to do so knowing there has been a full ethereal physical cyber digital forensic circumspectual AUDIT of the 2022 election,? Ramthun tweeted on Sunday, apparently without Googling to make sure he knew what ethereal? and circumspectual? mean.",
    "Court Filing Started a Furor in Right-Wing Outlets, but Their Narrative Is Off Track\nThe Convoy Is Coming for Our Democracy\nUS Intelligence Officials Accuse ZeroHedge of Spreading Russian Propaganda\nWant the best of VICE News straight to your inbox?",
    "That Mesa County, Colorado, election official and conspiracy theorist who's under investigation for allegedly aiding in a voting machine security breach that led to QAnon's Ron Watkins publicly sharing private voting information?",
    "A judge also ordered Trump attorney and coup-memo author John Eastman to lay out exactly what his work for Trump entailed after Eastman tried to claim attorney-client privilege to keep his Jan. 6 emails from being released.",
    "With former President Trump casting about for people to echo his false election claims, all a little-known local Republican official needs to become an important force in their party overnight is to loudly agree with him.",
    "Texas' new voting restriction law appears to be working just as intended: An unusually high number of mail ballots are reportedly being rejected ahead of the state's upcoming primary, potentially disenfranchising voters.",
    "Ramthun announced his bid for governor on Saturday, alongside election conspiracy theorist and MyPillow CEO Mike Lindell, with former Trump National Security Adviser Michael Flynn calling in to lend his support.",
    "Pro-Trump activists rallied in Wisconsin on Tuesday to demand their GOP leaders decertify the 2020 elections, led in part by a guy whose actual name is Jefferson Davis (he used to be a local village president).",
    "The following content comes from the latest installment of our weekly Breaking the Vote newsletter out of VICE News' D.C. bureau, tracking the ongoing efforts to undermine the democratic process in America.",
    "This all shows not only Trump's powerful grip on the right but also how much traction truly fringe characters have to gain by jumping on the Big Lie bandwagonespecially if they secure Trump's endorsement.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "Local election officials are sounding the alarm that they won't have enough money to efficiently run elections in the future, partly because of new GOP legal restrictions and threats to election workers.",
    "Peters became a star in the election conspiracy theory community when she spoke at Lindell's Cyber Symposium? last August, and announced her campaign on former top Trump adviser Steve Bannon's podcast.",
    "Earlier this week, he sent out a press release advertising the Georgia Election Integrity Summit,? to be hosted this weekend by a mix of pro-Trump groups pushing his false election claims.",
    "After spending time with Harriet, it is readily apparent she will always listen and prioritize the needs of her local communities and is focused on tackling our nation's biggest problems.",
    "I look forward to serving with Harriet for years to come.?  House Minority Leader Kevin McCarthy in his endorsement of Harriet Hageman against Trump's GOP bte noire, Rep. Liz Cheney.",
    "Oh, and speaking of Lindell, he told the Daily Beast he's planning to deliver MyPillows to the Ottawa truck protesters blockading the U.S.-Canada border to protest COVID policies.",
    "North Carolina Republicans were ordered by the state Supreme Court to redraw their gerrymandered congressional map two weeks ago to make it more representative of the state.",
    "Meanwhile, a federal judge blocked the part of that law making it illegal for election officials to solicit mail-in ballots from voters, declaring it was unconstitutional.",
    "But Ramthun has caught Trump's attention by leading the charge to decertify President Biden's 2020 win in Wisconsina move even Wisconsin GOP leaders say is impossible.",
    "And even if the most bonkers pro-Trump candidates don't win their primaries, their presence is shaping how the rest of the GOP will approach election subversion.",
    "Ron DeSantis is pushing for state Republicans to draw an even more aggressively gerrymandered map than the one they've already proposed, and he may get his way.",
    "And speaking of the family, a New York judge ruled Thursday that Trump, Ivanka, and Don Jr. must testify in the fraud probe into Trump's business practices.",
    "The problem is that some of these folks could actually win and end up with real power over the election system by the time the 2024 elections roll around.",
    "The list of truly fringe GOP characters running for office on the Big Lie platformand jockeying for Donald Trump's endorsementgot even longer this week.",
    "Bannon has reemerged as a top figure on the right, playing a key role in helping candidates who deny Biden's victory gain fame and power within the GOP.",
    "Rebecca Kleefisch, suddenly won't say that Biden won the 2020 election, even though months ago her position was that he did (he did).",
    "The committee is reportedly considering whether to subpoena Ivanka Trump, which will surely go over well with Daddy.",
    "Even if they don't secure Trump's endorsement, the Big Lie ecosystem can help elevate them into real candidates.",
    "Peter Thiel, the right's would-be kingmaker\nIs John Durham Deliberately Stoking Right-Wing Conspiracy Theories?",
    "Peters' campaignand the attention she's received for itshow the perverse incentives in the current GOP.",
    "Proud Boys leader Enrique Tarrio testified to the Jan. 6 Committee but mostly pleaded the Fifth.",
    "The one who got arrested last week because she allegedly illegally recorded a court proceeding?",
    "He's a back-bencher who until recently was barely known even in Wisconsin GOP circles.",
    "Well, she announced this week that she's running to be Colorado's secretary of state.",
    "It's notable that the front-runner for Wisconsin governor, former Wisconsin Lt. Gov.",
    "He's going to air-drop them from a helicopter with little parachutes,? of course.",
    "They put a new map out on Thursday that would still be pretty dang GOP-friendly.",
    "The keynote speaker is Mark Meadows, Trump's former White House chief of staff.",
    "Yeah, the person in charge of running the state's election systems.",
    "And Missouri Sen. Josh Hawley is now literally mugging for MAGA.",
    "Texas Republican officials have promised they'll appeal.",
    "Remember last week when we told you about Tina Peters?",
    "Sign up here to get it in your inbox every Friday.",
    "We'll see if the court lets them get away with it.",
    "Trump is clearly still all-in on the Big Lie.",
    "Take Wisconsin state Rep. Tim Ramthun.",
    "Trump has offered to endorse Ramthun.",
    "Sign up here.",
    "Florida Gov.",
    "How?"
  ]
}