{
  "id": 454,
  "mediaId": 124,
  "date": "2/18/2022 12:00:00 AM",
  "headline": "House GOP leader McCarthy endorses Cheney challenger in Wyoming primary",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220113-kevin-mccarthy-ew-116p-0551d2.jpg",
  "link": "https://www.nbcnews.com/politics/congress/house-gop-leader-mccarthy-endorses-cheney-challenger-wyoming-primary-rcna16741",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1609,
    2214,
    3085,
    3094,
    427,
    428,
    562,
    2590,
    2976
  ],
  "sentences": [
    "I think there's a reason why, at the end of the day, Liz would have a hard time winning here if she runs, and I don't think she runs.?\nHageman welcomed McCarthy's support Thursday, saying on Twitter: \"I am proud to have your endorsement and I look forward to working with you on behalf of the American people and the people of Wyoming to hold the Biden Administration accountable!\"",
    "RNC votes to censure Cheney and Kinzinger over Jan. 6 committee participation\nFeb. 4, 202201:59\nCheney is one of only two Republicans on the House committee investigating the attack on the Capitol.",
    "In a highly unusual move, House Minority Leader Kevin McCarthy on Thursday endorsed Harriet Hageman, the Trump-backed candidate challenging Rep. Liz Cheney in the Wyoming Republican primary.",
    "According to the latest fundraising figures, Cheney pulled in more than $1.97 million during the last three months of 2021, bringing her yearly total to nearly $6.5 million.",
    "Asked last week by NBC News whether he agreed with the RNC's decision to censure the two lawmakers, McCarthy said: I think there's a reason why Adam is not running again.",
    "3 post in House GOP leadership after she voted for impeachment, has been outspoken about the need to hold Trump accountable for the attack on the Capitol.",
    "The public endorsement by McCarthy, first reported by The Federalist, underscores former President Donald Trump's ever-expanding influence on the GOP.",
    "Hageman, who launched her bid in September, reported about $443,000 in contributions last quarter, bringing her total for the year to over $745,000.",
    "Party leaders in Congress rarely, if ever, get involved in primaries, particularly if a member on their side of the aisle is seeking re-election.",
    "Trump has set his sights on defeating the handful of congressional Republicans who voted to impeach or convict him last year.",
    "The Republican National Committee recently censured Cheney and Kinzinger for their involvement with the Jan. 6 panel.",
    "\"I am proud to endorse Harriet Hageman for Congress,\" McCarthy, R-Calif., said in a statement tweeted by Hageman.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nRecaptcha requires verification.",
    "Rep. Adam Kinzinger of Illinois, the other GOP member on the panel, is not seeking re-election.",
    "McCarthy and Cheney have been openly critical of each other after the Jan. 6 riot.",
    "\"I look forward to welcoming Harriet to a Republican majority next Congress.\"",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "In a statement, a spokesperson for Cheney said of Hageman: \"Wow.",
    "Privacy - Terms\nprotected by reCAPTCHA\nPrivacy - Terms",
    "Cheney, who was booted from her No.",
    "Cheney is one of his main targets.",
    "She must really be desperate.\""
  ]
}