{
  "id": 455,
  "mediaId": 43,
  "date": "2/18/2022 12:00:00 AM",
  "headline": "'legitimate political discourse'? Lord HeeHawley or Lando Cotton: better than Mike Pence in 2024?",
  "image": "https://images.dailykos.com/images/1039295/story_image/iu1?1645221763",
  "link": "https://www.dailykos.com/story/2022/2/18/2081088/--legitimate-political-discourse-Lord-HeeHawley-or-Lando-Cotton-better-than-Mike-Pence-in-2024",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1335,
    1434,
    2087,
    2195,
    2214,
    2409,
    3094,
    427,
    2972
  ],
  "sentences": [
    " John Collins (@Logically_JC) February 18, 2022\nFormer Vice President Mike Pence on Thursday defended the Republican National Committee's February 4th resolution that censured United States Representatives Liz Cheney (R-Wyoming) and Adam Kinzinger (R-Illinois) and designated the January 6th, 2021 Capitol insurrection as legitimate political discourse.?\n[...]\nSpeaking at a College Republicans event at Stanford University as reported by The Washington Post, Pence said that the RNC was not talking about people that engaged in violence against persons or property that day.? Rather, the diktat was meant to stand up for a whole range of people that have been set upon? by the bipartisan congressional panel.",
    "www.alternet.org/...\nx\nNo matter the outcome of the 2024 presidential election, the casualties of these continued assaults will be trust in democratic institutions, systemic equity, and Americans' recognition of each other's humanity.?  @SaraKamalihttps://t.co/NDAc84NX6b\n The New Republic (@newrepublic) February 18, 2022\nThis month's question: It's been a year since the attempted insurrection at the U.S. Capitol.",
    "He is followed by Ron DeSantis at +450, Nikki Haley at +800, Mike Pence at +1200 and Mike Pompeo at +2500 to round out the top five names on the oddsboard.? However, there are some GOP senators who may jump to the head of the 2024 line, when trumpism itself falters because of impending prosecutions or revelations.",
    "Then there's always the GOP's 2016 primary runner-up, Cancun Cruz\nAs Mike Pence walks back his objection to the RNC claim of 1/6 as legitimate political discourse', the default for GOP thinking now comes home to roost, making the usual senatorial suspects the actual front-runners for the 2024 POTUS nod.",
    "I just don't know too many people around the country, including my friends at the RNC, the chairman of the Republican National Committee, who have any different view than it was a tragic day, that the people that ransacked the Capitol were wrong and should be held to account in the law,? Pence said.",
    "They're good people, and I believe that's what they meant.?\nThe RNC has also denied that it is siding with the violent mob that stormed the Capitol at the behest of then-President Donald Trump while chanting hang Mike Pence? and hunting House Speaker Nancy Pelosi (D-California) for assassination.",
    "Jennifer McCoy\n Political scientist, Georgia State University\nI am very worried that intimidation and physical violence against election workers will increase, given new legislation criminalizing common election activity and persistent belief in the Big Lie.",
    "Jonathan A. Greenblatt\n CEO, Anti-Defamation League, and author of It Could Happen Here: Why America Is Tipping From Hate to the UnthinkableAnd How We Can Stop It\nI'm extremely concerned about the prospect for increased hate and political violence in 2024.",
    "After consulting with ex-Vice President Dan Quayle, Pence ultimately refused to cooperate with the coup and performed his ceremonial obligation of tallying and certifying President-Elect Joe Biden's 332-206 victory in the Electoral College.",
    "In the days leading up to and including January 6th, Trump and his clown car of jingoist lawyers had been pressuring Pence into throwing out the results of the 2020 election, which Trump and Pence lost in a landslide.",
    "Mary McCord\n Executive director, Institute for Constitutional Advocacy and Protection at Georgetown Law\nRecent polling shows that an alarming number of Americans believe violence may be necessary to save? the country.",
    "No matter the outcome of the 2024 presidential election, the casualties of these continued assaults will be trust in democratic institutions, systemic equity, and Americans' recognition of each other's humanity.",
    "The RNC's likely choice of Milwaukee for their 2024 convention is also about the strength of their corruption in Wisconsin and a repeat of their illegal substitution of electors and interference with balloting.",
    "Barbara F. Walter\n Author, How Civil Wars Start: And How to Stop Them\nThe U.S. has both factors that increase the risk of civil war: a partial democracy and one whose citizens are engaging in racial politics.",
    "The shameful efforts of elected officials and others in positions of power to normalize election denial is like fuel to the fire, increasing the perception that political violence is an acceptable option.",
    "Political violence perpetrated by white nationalists also includes disinformation, voter suppression, ableism, misogyny, transphobia, racism, and discrimination against many religious beliefs.",
    "@ScottWalker and former GOP state and national chairman and WH chief of staff @Reince Priebus giving RNC convention committee a tour of this city, one of three finalists to host the 2024 RNC.",
    "And I think they made a very clear statement, after the fact, that said, We were talking about what's happening in Washington today, with the January 6th committee'  and I believe them.",
    "Sara Kamali\n Author of Homegrown Hate: Why White Nationalists and Militant Islamists Are Waging War Against the United States, equity consultant, and holistic justice activist\nVery.",
    "Every year that the U.S. refuses to strengthen its democracy, and the Republican Party refuses to widen its appeal beyond white Americans, increases our risk of political violence.",
    "Since the January 6 insurrection there's been a dangerous mix of conspiracy theories about the election that are spreading across mainstream outlets and social media.",
    "The growth of militias, hate groups, and the presence of active and former law enforcement officers in them, could result in more violent acts.",
    "www.uspresidentialelectionnews.com/...\nx\nMike Pence defends the RNC for calling the events on January 6th \"legitimate political discourse.\"",
    "This dangerous feedback loop of falsehoods has created a highly combustible environment that could be deadly.",
    "The GOP is always ultimately about violence, however simplistically characterized and in a variety of forms.",
    "Much like skyrocketing? gun sales in Ukraine, everyone needs to be prepared for strange eventualities.",
    "Such harms are inflicted through public policy at all levels of government and through media outlets.",
    "How worried are you that political violence will increase ahead of the 2024 presidential election?",
    "Meanwhile, Republican leaders fail to denounce fellow elected officials who glamorize violence.",
    "In November 2021, the 2024 Republican nominee odds with Trump the favorite at +100.",
    "https://t.co/joNBvfAAH8\n Jason Calvi (@JasonCalvi) February 17, 2022",
    "And these have both only gotten worse since January 6.",
    "newrepublic.com/...\nx\nFormer Wisconsin Gov.",
    "They wanted to fucking hang you."
  ]
}