{
  "id": 457,
  "mediaId": 98,
  "date": "2/18/2022 12:00:00 AM",
  "headline": "Today's Headlines: A new poll finds that L.A. isn't as unpopular as you might think",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/07b8a29/2147483647/strip/true/crop/3600x2188+0+0/resize/840x511!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9e%2F49%2F250c8a344a4691c8dd4e60a617e8%2Fla-photos-1staff-890519-me-shortest-day-of-the-year-1-brv.jpg",
  "link": "https://www.latimes.com/world-nation/newsletter/2022-02-18/todays-headlines-template-todays-headlines",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Blasey",
  "authorUrl": "",
  "termIds": [
    1147,
    1245,
    1444,
    1609,
    1710,
    2363,
    3094,
    29,
    2764,
    2807,
    2942
  ],
  "sentences": [
    "On April 5, 2012, on the 50th anniversary of the opening of Dodger Stadium, The Times' Hector Becerra wrote about the rural village overlooking downtown L.A.? People he spoke to recalled a life of few luxuries but a sense of community and adventure, with sprawling Elysian Park as a backyard playground.? Some of those who fought the evictions were dragged away kicking and screaming and weeping, and the removals became a rallying symbol of Latino L.A. history and activism.?\nWe appreciate that you took the time to read Today's Headlines!",
    "More top coronavirus headlines\nRussian disinformation has kicked into high gear as the Ukraine crisis drags on\nTo hear Russian media tell it, the government of Ukraine is run by neo-Nazis waging a genocidal campaign against ethnic Russians in the country's east, where Moscow-backed authorities regularly uncover mass graves full of the corpses of women and children with bound hands and bludgeoned heads even as they face the hell of constant shelling.",
    "Senate GOP moved to downplay race in the looming Supreme Court confirmation hearing\nSome Senate Republicans are predicting a civil but tough Supreme Court battle in which their members largely steer clear of the nominee's identity as a Black woman, a historic element that Democrats have played up as they tout the need for a more representative judiciary that looks like America.",
    "Nearly three-quarters of respondents in a new poll co-sponsored by The Times rated Los Angeles as either one of the best places to live? or nice but not an outstanding place to live.? Although the poll hardly represents a consensus  it was taken among registered voters, suggesting a preexisting commitment to the city and to their opinions  its optimism might come as a surprise.",
    "Walt Disney Co. says it is moving beyond storytelling? and into storyliving.? The Burbank-based company said it planned to develop a string of real estate projects around the country, beginning in Rancho Mirage, that incorporate legendary guest service? and curated experiences.?\nSPORTS\nEmbroiled by doping accusations, ROC's Kamila Valieva tumbled out of medal contention.",
    "California offers a cautious blueprint forward as COVID wanes and mask orders ease\nState officials released a pandemic plan that gave an overview of how authorities would manage potential new surges, warning that although the Omicron surge is fading, the state must be prepared for the emergence of new variants and seasonal increases in coronavirus transmission.",
    "Crew catalog.? Sen. Ted Cruz (R-Texas) called Biden's pledge to nominate the first Black woman to the court an insult to Black women.?\nMore politics\nThe Justice Department announced it was launching an initiative to identify companies that were exploiting supply chain disruptions in the U.S. for increased profits in possible violation of antitrust laws.",
    "A few days earlier, a headline in the Feb. 12, 1960, edition of The Times said: Price for 12 Affected Home Lots Reported to Be Nearly $490,000, O'Malley Hints.? It was $494,000, and the purchases capped a dark episode in L.A. history in which more than 1,000 mostly Mexican American families were evicted from the neighborhood.",
    "The series  directed by The Times' Nani Sahra Walker, an award-winning filmmaker herself  includes documentaries (up to 22 minutes long) on a Cherokee elder and first language speaker, the first female Sri Lankan surfer, a group of Black and Latina women working to remove police from their children's schools, and more.",
    "Among his recent stops: the Green Room, a 12-room boutique hotel with surf-minimalist white interiors, no lobby, forward-looking technology and flat black exteriors; also, the Mission Pacific Hotel Rooftop Bar, a brilliant spot for sunset-viewing.? The U-shaped hotel is wrapped around a tiny beach cottage.",
    "L.A. County Sheriff Alex Villanueva told county leaders to stop using the term deputy gangs.? Villanueva sent a cease-and-desist letter this week to the Board of Supervisors, demanding they and others stop using the phrase to refer to secretive groups that operate within department stations.",
    "A people long divided by profound disputes over what language to speak, what church to follow and what historical heroes to revere has begun to stitch together a sense of common purpose in the face of a menacing foe.? A reporter and photographer document their trip along the Dnieper River.",
    "Creators, showrunners and brothers Matt and Ross Duffer said they'd always predicted the sci-fi period drama would last four or five seasons: It proved too large to tell in four.? Even Season 4 is large enough that Netflix will release it in two parts  dropping on May 27 and July 1.",
    "The move follows widespread criticism sparked by reports that, as president of Fresno State in 2020, Castro quietly authorized a $260,000 payout and a retirement package for a former school official who was the subject of complaints of bullying and sexual harassment.",
    "The former sideline reporter is said to be backing a politician whose organization aims to counter the prevailing narrative in popular culture that America is structured to undermine the lives of black Americans,? writes columnist LZ Granderson.",
    "The police force has not made the majority of recommendations, the department's inspector general told a House committee, and it still needs more training and intelligence gathering to anticipate and protect against threats to Congress.",
    "The Senate gave final approval to legislation averting a weekend government shutdown, sending President Biden a measure designed to give bipartisan bargainers more time to reach an overdue deal to finance federal agencies until fall.",
    "Such false images and narratives have become a daily staple in Russia in the months since an estimated 150,000 Russian troops, along with armored vehicles, warplanes and naval ships, began assembling on Ukraine's periphery.",
    "The story of the drug Makena shows how pharmaceutical companies can use America's drug approval system to make hundreds of millions of dollars from a cheap, decades-old medicine with questionable effectiveness and safety.",
    "A Texas jury found the former Angels employee guilty of distributing fentanyl and oxycodone since beginning or before 2017? and of providing Skaggs the fentanyl that resulted in his death in a suburban Dallas hotel room.",
    "A handful of Democrats in the state Legislature are pushing again for a tax on extreme wealth? in California, a move they say could bring the state billions in revenue by raising taxes on households worth $50 million.",
    "The Russian media have gone into overdrive with stories depicting a government in Kyiv so cruel that Moscow has no choice but to swoop in and protect the ethnic Russians in eastern Ukraine's Donbas region.",
    "New York Times\nFROM THE ARCHIVES\nSixty-two years ago today, Dodgers owner Walter O'Malley wrapped up the purchase of a dozen remaining properties in Chavez Ravine to make way for Dodger Stadium.",
    "The 15-year-old Russian hailed as the new face of women's figure skating stumbled through triple jumps and tumbled out of quadruples, waving a hand in disgust as her free skate program ended.",
    "(Hey, go ahead and watch Marry Me? [we did], but when you're done trying to figure out just what is it about Owen Wilson's hair, stream Victor and Isolina.? And, for six minutes, be riveted.)",
    "Even as some districts are lifting outdoors mask rules, the superintendent said, L.A. Unified is deliberating and soliciting expert advice before making its own decision early next week.",
    "If you're a fan of this newsletter, you'll love our daily podcast The Times,? hosted every weekday by columnist Gustavo Arellano, along with reporters from across our newsroom.",
    "Speaking of L.A.: Tomorrow we launch a newsletter that'll follow and explain all the upcoming drama of this year's historic L.A. mayor's race and other 2022 contests.",
    "This week, a glitchy website transition resulted in two possible sets of answers, a discovery that unleashed mayhem and the fury of scorned Wordle devotees.",
    "Some call this a vibe shift?: how trends in thought, clothing, media, politics, interests and the social ecosystem they all create can morph into new eras.",
    "Nevada-based Redwood Materials announced it was expanding a used-battery collection program to California, with Ford and Volvo as project-launch partners.",
    "House Minority Leader Kevin McCarthy endorsed the GOP primary challenger to Wyoming Rep. Liz Cheney, his latest show of fealty to former President Trump.",
    "By Laura Blasey and Amy Hubbard\nHello, it's Friday, Feb. 18, and if you're looking for something rewarding to do this weekend, we have a recommendation.",
    "Not only had housing prices, homelessness, crime and general pandemic ennui sapped collective morale, but the state's population also had taken a dive.",
    "Floodwaters and mudslides dragged cars and houses through the streets of the mountain city of Petropolis during the most intense rainfall in decades.",
    "For years he developed the saga of four brothers gathered for a wedding that he'd star in alongside his actual brothers, Derek, Darion and Dionysio.",
    "But now masks are coming off, coronavirus infections are down, and the future  if not entirely bright  seems, at least for some, promising.",
    "Meanwhile, a judge ruled that Trump must answer questions under oath in New York state's civil investigation into his business practices.",
    "The film's title proudly placed their heritage front and center: The Fabulous Filipino Brothers.?\nBUSINESS\nInstagram made Theragun a hit.",
    "From Feb. 17 to 27, there are more than 350 events planned, including house tours, panel discussions, bike and walking tours and parties.",
    "Driven by wind, the Airport fire was the largest of three wildfires to have broken out so far in 2022, according to Cal Fire statistics.",
    "One of her skis clipped a gate seconds into the race and sent her crashing into the snow as disbelieving gasps filled the finish area.",
    "Not only can customers try out the popular massage gun but they can also dabble in cryotherapy, light therapy and hyperbaric chambers.",
    "WHAT OUR EDITORS ARE READING\nNote: Some of the sites we link to may limit the number of stories you can access without subscribing.",
    "Kelly Smiley fractured her back after falling off the 7- to 8-foot stage where the Rams were holding a rally at Exposition Park.",
    "After Smiley fell off, he appeared to pivot and quickly move in the opposite direction while his wife went to try to help.",
    "Skier Mikaela Shiffrin's inexplicable Olympics took another inexplicable turn in her fifth and final individual event.",
    "It was Kelly McGillis' house in the 1986 movie Top Gun.? It's set to open as a dessert bar called the Top Gun House.",
    "Residents have come together in the eight years since Russia first invaded and snatched away parts of their country.",
    "E-commerce sellers have been making the leap to brick-and-mortar to lure customers  and sell them even more stuff.",
    "Capitol Police made a third of the changes that were recommended after the Jan. 6 riot, a watchdog testifies.",
    "For decades, a lot of tourists overlooked the blue-collar city that operated in the shadow of Camp Pendleton.",
    "The word-guessing game took off online due in part to its communal appeal: there is only one answer per day.",
    "The Times this week launched Short Docs, a monthly video series that will entertain but also make you think.",
    "Take a double-decker architectural bus tour, peek inside one-of-a-kind renovated vintage trailers and more.",
    "But there's a new generation of lodging, restaurants and retailers, writes The Times' Christopher Reynolds.",
    "After the New York Times bought the game in January, some players worried the company would change Wordle.",
    "After an hours-long closed-door session with the board of trustees, Castro announced he would step down.",
    "That marks a shift from recent weeks when several drew criticism for comments: Sen. John Kennedy (R-La.)",
    "The death toll following torrential rains in Brazil rose to over 100 with more than 100 still missing.",
    "OPINION\nThe twisted path that led Michele Tafoya from covering the NFL to denying systemic racism.",
    "NATION-WORLD\nA drug that is supposed to help prevent premature births doesn't work, the FDA says.",
    "Get the day's top news with our Today's Headlines newsletter, sent every weekday morning.",
    "Alberto Carvalho confronts his first big decision: Should LAUSD relax mask requirements?",
    "The Rams and Matthew Stafford will cover medical bills for the team's photographer.",
    "Download and listen on our App, subscribe on Apple Podcasts and follow on Spotify.",
    "Washington Post\nThe unbearable weirdness of watching culture change around you.",
    "Electric vehicles may be cleaner than gasoline or diesel fuel cars and trucks.",
    "But that doesn't mean they're clean, especially when they're no longer usable.",
    "CALIFORNIA\nA wildfire east of Bishop in Owens Valley grew to over 4,100 acres.",
    "You may occasionally receive promotional content from the Los Angeles Times.",
    "Dante Basco tapped the whole family to make his Fabulous? directorial debut.",
    "According to a new congressional map, maybe, writes columnist Jean Guerrero.",
    "(More day-off ideas toward the bottom of this newsletter in Your Weekend.)",
    "HOLLYWOOD AND THE ARTS\nBad news: Stranger Things? will end with Season 5.",
    "Modernism is celebrated in a big way at Palm Springs' annual festival.",
    "Tesla's co-founder wants to solve California's battery waste problem.",
    "But the company that makes it has refused to take it off the market.",
    "Video of the incident was not a good look for quarterback Stafford.",
    "By last night, firefighters had begun to gain control of the blaze.",
    "Just last year, the news from the Golden State was less ebullient.",
    "quipped that he wanted a nominee who knows a law book from a J.",
    "At least one trend expert thinks another vibe shift is upon us.",
    "Can California Latinos save Democrats in the midterm elections?",
    "Our City Hall team has it covered with L.A. on the Record.",
    "So why did the company just open a physical L.A. store?",
    "Feel free to drop us a note at headlines@latimes.com.",
    "YOUR WEEKEND\nPay Oceanside a visit (yes, Oceanside).",
    "New York Magazine\nUkrainians had long been divided.",
    "It was her last chance to win an individual medal.",
    "Eric Kay was found guilty in Tyler Skaggs' death.",
    "Now on to today's news you don't want to miss.",
    "Right now I just feel like a joke,? she said.",
    "Go to Palm Springs for Modernism Week events.",
    "Now a common enemy is causing them to unite.",
    "CSU Chancellor Joseph Castro has resigned.",
    "She finished in fourth place.",
    "Want to live at Disneyland?",
    "TOP STORIES\nThey like it.",
    "Go beyond the headlines.",
    "Season 4 is extra long.",
    "Cue the internet fury.",
    "They really like it.",
    "Two Wordle answers?",
    "Comments or ideas?",
    "L.A. Unified Supt.",
    "Good news?",
    "Why?"
  ]
}