{
  "id": 460,
  "mediaId": 195,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "McCarthy endorses Cheney primary challenger",
  "image": "https://cdn.jwplayer.com/v2/media/4zkwnxSu/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/594838-mccarthy-endorses-cheney-primary-challenger",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod",
  "termIds": [
    1147,
    1248,
    1609,
    2214,
    3085,
    3094,
    428,
    562,
    2590,
    2945,
    2976
  ],
  "sentences": [
    "I look forward to welcoming Harriet to a Republican majority next Congress, where together, we will hold the Biden Administration accountable and deliver much-needed solutions for the American people.?\nHageman has racked up endorsements from a slate of prominent Republicans, notably including former President Trump, who is anticipated to make at least one trip to Wyoming this year to campaign for Hageman.",
    "The most successful Representatives in Congress focus on the needs of their constituents, and throughout her career, Harriet has championed America's natural resources and helped the people of Wyoming reject burdensome and onerous government overreach,? McCarthy said in a statement, referencing criticisms that Cheney has been focused more on Trump than Wyoming.",
    "After she was booted from leadership, Cheney blasted the minority leader as not leading with principle right now.?\nMcCarthy's endorsement comes after the Republican National Committee voted to censure Cheney and retiring Rep. Adam Kinzinger (R-Ill.), another Trump critic serving on the Jan. 6 committee.",
    "McCarthy's support for Hageman marks the biggest endorsement by a House Republican against Cheney, who is fighting for her political life over GOP backlash to her criticism of former President Trump and her participation in the House committee investigating the Jan. 6, 2021, riot on Capitol Hill.",
    "The clash between the two went into hyperdrive after last year's insurrection, with Cheney laying the blame for the riot squarely at Trump's feet, saying it was fueled by his false claims of election fraud in 2020.",
    "It is her responsibility to fight for Wyoming and represent our values, and she has completely abandoned that.?\nIt is uncommon for Republican House members to back primary challengers to other incumbents.",
    "I am very grateful for Leader McCarthy's strong support, and I pledge that when I am Wyoming's congresswoman, I will always stand up for our beautiful state and do the job I was sent there to do.",
    "Cheney, first elected in 2016 and once seen as a possible future House speaker, was a constant thorn in Trump's side during his administration, often criticizing him over his rhetoric.",
    "House Minority Leader Kevin McCarthy (R-Calif.) on Thursday endorsed Harriet Hageman, the Wyoming Republican waging a primary challenge against Rep. Liz Cheney (R-Wyo.).",
    "McCarthy has resisted such a move, but endorsing Hageman could be a way of finding middle ground\nThere has also been bad blood directly between Cheney and McCarthy.",
    "The Democrats in Washington, D.C. only see her as a temporary but useful tool to achieve their partisan goals, and the Republicans want nothing to do with her.",
    "Cheney will have immense funds to use in her defense this year, finishing 2021 with $4.7 million in the bank, compared to $381,000 for Hageman.",
    "Liz Cheney has completely lost the ability to do her job of representing Wyoming as our only member of the House of Representatives.",
    "When asked about McCarthy's endorsement for Hageman, Cheney spokesperson Jeremy Adler replied, \"Wow, she must be really desperate.\"",
    "Some Republicans, particularly on the right, have called for her to be removed from the House GOP conference all together.",
    "Her endorsement from McCarthy is the biggest get for her so far from a House lawmaker.",
    "Her role in the committee ultimately led to her ouster last year from the No.",
    "However, Cheney has increasingly found herself on an island in the chamber.",
    "I look forward to representing Wyoming's interests in Congress,? she said.",
    "3 GOP leadership spot in the House."
  ]
}