{
  "id": 461,
  "mediaId": 151,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "McCarthy picks his path on Cheney: Try to boot her from Congress",
  "image": "https://static.politico.com/4f/72/3ae8187f4c8cb0f5394833f71dbb/https-delivery.gettyimages.com/downloads/1364454499",
  "link": "https://www.politico.com/news/2022/02/17/mccarthy-cheney-boot-from-congress-00009972",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    732,
    732,
    1130,
    1130,
    1147,
    1147,
    1248,
    1248,
    1609,
    1335,
    1335,
    1609,
    2214,
    2214,
    545,
    545,
    204,
    204,
    428,
    428
  ],
  "sentences": [
    "It is her responsibility to fight for Wyoming and represent our values, and she has completely abandoned that.?\nMcCarthy's endorsement comes weeks after the Republican National Committee moved to censure Cheney and retiring Rep. Adam Kinzinger (R-Ill.), who both voted to impeach former President Donald Trump and were later tapped to serve on the Jan. 6 select committee by Speaker Nancy Pelosi.",
    "The most successful Representatives in Congress focus on the needs of their constituents, and throughout her career, Harriet has championed America's natural resources and helped the people of Wyoming reject burdensome and onerous government overreach,? McCarthy's statement reads.",
    "He added, I look forward to welcoming Harriet to a Republican majority next Congress.?\nThe accompanying press release described the GOP leader's endorsement as bold and historic,? while noting that he joins Trump and Sen. Rand Paul (R-Ky.) in supporting Hageman.",
    "Rep. Tom Rice (R-S.C.), who also voted to impeach Trump, pointed out last month how McCarthy was urging the conference to run on the field as a team just days after the RNC vote to censure Cheney and Kinzinger, which he did not ultimately condemn.",
    "Bitter tensions resurfaced last month after the Jan. 6 panel asked McCarthy to voluntarily testify about his communications with Trump on the day of the attack, with Republicans directing much of their ire at Cheney at the time.",
    "has illustrated a broader battle between the two wings of the House GOP: those that chose to re-embrace Trump weeks after the Jan. 6 attack and the smaller minority of Republicans who want to move on from the former president.",
    "?Kevin did the right thing,? said Rep. Ralph Norman (R-S.C.), a member of the House Freedom Caucus, calling it great news.? Cheney has long left the Republican Party and aligned herself with the socialist Democratic Party.?",
    "Some Republicans believe McCarthy's actions against Cheney  or silence when the party moves to punish her  undermine his claim that the GOP is a big tent? party that welcomes Republicans across the ideological spectrum.",
    "| Alex Wong/Getty Images\nBy Olivia Beavers\n 02/17/2022 05:30 PM EST\nUpdated: 02/17/2022 06:05 PM EST\nKevin McCarthy is throwing off tradition and supporting a primary challenger to one of his own members.",
    "Cheney and Kinzinger are solidly in that smaller group while a majority of House Republicans rallied around Trump after the attack, arguing that he is generally still considered the leader of the party.",
    "McCarthy's decision came as he faced persistent pressure from his right flank to take action against Cheney, whose involvement on the Jan. 6 select committee has fueled animosity from her colleagues.",
    "Some Republicans believe House Minority Leader Kevin McCarthy's actions against Rep. Liz Cheney  or silence when the party moves to punish her  undermine his claim that the GOP is a big tent? party.",
    "The move emboldened Cheney to repeatedly hit the House minority leader, and McCarthy mostly remained silent as his party chose to ostracize  and for some, publicly berate  the Wyoming Republican.",
    "The GOP leader's decision to wade into the primary battle and support the Trump-endorsed Harriet Hageman marks a departure from the status quo of top party leaders protecting their incumbents.",
    "But rather than voting and falling silent, as some of the other 10 GOP House members did, Cheney continued to vocally criticize Trump's actions and baseless claims of a stolen election.",
    "While some conservatives  including many in the House Freedom Caucus  want to remove her from the GOP conference, Republican leaders have opposed the move.",
    "Cheney was the top House Republican who voted to impeach Trump after the insurrection, serving as the GOP conference chair at the time.",
    "Hageman, touting McCarthy's endorsement in a statement, argued that Cheney is no longer representing the people of Wyoming.",
    "Instead, McCarthy's endorsement, first told to The Federalist, suggests he is hoping to kick her out of Congress entirely.",
    "But other Republicans, particularly in the pro-Trump wing of the party, will celebrate McCarthy's latest move.",
    "It's one thing to say you're gonna be a big tent party and stuff and then to actually do it,? Rice said.",
    "It also caps off a dramatic implosion of their relationship that strained after the Jan. 6 attack.",
    "Wow, she must be really desperate,? spokesperson Jeremy Adler said in a statement.",
    "McCarthy and the rest of the party eventually ousted her from the No.",
    "The GOP leader later said he would not cooperate with the request.",
    "But it's not exactly a surprise  the incumbent is Rep. Liz Cheney.",
    "In response, a Cheney spokesperson took aim at Hageman.",
    "The ongoing fight between McCarthy and Cheney (R-Wyo.)",
    "The bad blood only grew from there.",
    "3 role in the House conference."
  ]
}