{
  "id": 463,
  "mediaId": 65,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "McCarthy backs Cheney challenger Hageman in Wyoming House Republican primary",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/bc780847-bc05-4a70-a952-2677ab451108/f9e8e5a9-cf5d-4e71-a526-c86393453f0a/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/cheney-mccarthy-hageman-congress-wyoming",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly Phares",
  "authorUrl": "https://www.foxnews.com/person/p/kelly-phares",
  "termIds": [
    1609,
    2214,
    2214,
    1147,
    1147,
    1248,
    1248,
    1609,
    428,
    428,
    562,
    562,
    631,
    631,
    2976,
    2590,
    2590,
    2976
  ],
  "sentences": [
    "\"Wyoming deserves a congresswoman who will combat the disastrous Biden administration and hold them accountable for their policies which are ravaging our energy industries, destroying our sovereignty by obliterating our southern border, robbing our citizens of prosperity through catastrophic inflation, and encroaching on our constitutional rights,\" Hageman said.",
    "LIZ CHENEY HAULS IN OVER $7 MILLION LAST YEAR AS SHE FENDS OFF PUSH BY TRUMP TO OUST HER FROM CONGRESS\nHageman has emerged as the most viable of several candidates trying to unseat Cheney, R-Wyo., who has earned the wrath of former President Donald Trump and many Republicans for pushing back on Trump's false claims the 2020 presidential election was stolen.",
    "\"The most successful Representatives in Congress focus on the needs of their constituents, and throughout her career, Harriet has championed America's natural resources and helped the people of Wyoming reject burdensome and onerous government overreach.\"",
    "FIRST ON FOX NEWS: TRUMP BACKED CHENEY CHALLENGER HAGEMAN ANNOUNCES HER FUNDRAISING HAUL\n\"Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol,\" Sen. Mitt Romney, R-Utah, tweeted.",
    "McCarthy's public endorsement of Hageman comes after weeks of pressure from Trump-alinged members to boot her from the House Republican caucus, along with Rep. Adam Kinzinger, R-Ill., a fellow member of the Jan. 6 Committee.",
    "House Minority Leader Kevin McCarthy is endorsing Harriet Hageman in her Wyoming primary challenge to Rep. Liz Cheney, a rare move by a sitting party leader to back an attempt to unseat one of his members.",
    "\"I am very grateful for Leader McCarthy's strong support, and I pledge that when I am Wyoming's congresswoman, I will always stand up for our beautiful state and do the job I was sent there to do.",
    "Hageman said that Cheney, who has one of the most conservative voting records in Congress, is \"actively damaging the Republican party  both in Wyoming and nationally  and it's time for her to go.\"",
    "CHENEY TELLS FOX NEWS THAT BEHIND THE SCENES', MANY IN GOP ARE THANKING HER\n\"Wow, she must be really desperate,\" Cheney spokesman Jeremy Adler said in reaction to McCarthy's endorsement.",
    "Those tensions came to a head earlier this month when the Republican National Committee (RNC) censured Cheney and Kinzinger for their participation on the panel.",
    "\"The Democrats in Washington, D.C. only see her as a temporary but useful tool to achieve their partisan goals, and the Republicans want nothing to do with her.",
    "\"Liz Cheney has completely lost the ability to do her job of representing Wyoming as our only member of the House of Representatives,\" Hageman said Thursday.",
    "Though Hageman has two major endorsements in her pocket from Trump and McCarthy, Cheney has a major cash advantage in the Wyoming race.",
    "\"Raised on a family ranch outside of Fort Laramie, Harriet and her family have resided in Wyoming for generations,\" he added.",
    "\"Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.\"",
    "It is her responsibility to fight for Wyoming and represent our values, and she has completely abandoned that.\"",
    "\"I am proud to endorse Harriet Hageman for Congress,\" McCarthy, R-Calif., said in a statement Thursday.",
    "Cheney's participation on the Jan. 6 Committee is also an irritant for House Republicans.",
    "She hauled in more than $7 million in 2021 to Hageman's approximately $1 million.",
    "The censure received significant backlash, especially from Senate Republicans.",
    "I look forward to representing Wyoming's interests in Congress,\" Hageman said.",
    "Fox News' Paul Steinhauser contributed to this report.",
    "But many in the House GOP vocally supported the move.",
    "Trump endorsed Hageman last year."
  ]
}