{
  "id": 469,
  "mediaId": 237,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "Kevin McCarthy endorses Liz Cheney primary challenger",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/957724.png",
  "link": "https://www.washingtonexaminer.com/news/campaigns/kevin-mccarthy-endorses-liz-cheney-primary-challenger",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Asher Notheis",
  "authorUrl": "https://www.washingtonexaminer.com/author/asher-notheis",
  "termIds": [
    1609,
    945,
    945,
    1609,
    1248,
    1248,
    1147,
    1147,
    613,
    613,
    427,
    427,
    428,
    428,
    146,
    146,
    2976,
    2976
  ],
  "sentences": [
    "When Trump endorsed Hageman last fall, the former president said she has \"my Complete and Total Endorsement in replacing the Democrats number one provider of sound bites, Liz Cheney.? Hageman told the Washington Examiner in an interview the same month that Cheney \"betrayed Wyoming\" and \"betrayed me.\"",
    "More recently, the Republican National Committee adopted a censure resolution against Cheney and Rep. Adam Kinzinger, the only two GOP members of the Jan. 6 committee, in part because of their participation in the panel formed to investigate the Capitol riot.",
    "Cheney, the daughter of former Vice President Dick Cheney, has faced backlash within the Republican Party after she joined nine other House Republicans in voting to impeach Trump in connection to the Capitol riot, a move that led to her losing her No.",
    "The move prompted outrage from the Cheney campaign and other candidates in the race, who paint the move to declare a nominee months ahead of the Aug. 16 primary as un-American? and trying to play a trick on the voters.?",
    "After spending time with Harriet, it is readily apparent she will always listen and prioritize the needs of her local communities and is focused on tackling our nation's biggest problems,? McCarthy told the Federalist.",
    "The California Republican's embrace of Hageman follows former President Donald Trump endorsing her in a bid to unseat a leading Republican on the House committee investigating the Jan. 6 Capitol riot.",
    "McCarthy said members of the RNC \"have a right to do their resolution and what they wanted.?\nWyoming GOP leaders moved to allow the RNC to support Hageman on a financial basis this month.",
    "House Minority Leader Kevin McCarthy has endorsed attorney Harriet Hageman in her 2022 midterm primary challenge against Wyoming Rep. Liz Cheney.",
    "Jeremy Adler, a Cheney spokesman, told the Washington Examiner that Hageman \"must be really desperate.\"",
    "I look forward to serving with Harriet for years to come.?\nCheney's team shrugged off the endorsement.",
    "The Wyoming GOP voted to censure Cheney over the vote.",
    "3 position in the House Republican leadership in May."
  ]
}