{
  "id": 487,
  "mediaId": 33,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "McCarthy endorses Cheney foe in Wyoming GOP primary",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220217171357-mccarthy-cheney-hageman-exlarge-169.jpg",
  "link": "https://www.cnn.com/2022/02/17/politics/kevin-mccarthy-harriet-hageman-endorsement/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Nobles, Manu Raju and Melanie Zanona",
  "authorUrl": "",
  "termIds": [
    2214,
    2214,
    1609,
    1248,
    1248,
    1577,
    1609,
    1577,
    1147,
    1147,
    428,
    428,
    204,
    204,
    633,
    633,
    2976,
    2976
  ],
  "sentences": [
    "(CNN)House Minority Leader Kevin McCarthy has endorsed Harriet Hageman, the Trump-backed opponent of incumbent Rep. Liz Cheney of Wyoming -- a rare endorsement from leadership in a divisive GOP primary, and one that marks the culmination of a simmering feud between the two powerful Republicans battling over the future of their party.",
    "However, as CNN reported earlier month, McCarthy is facing increased pressure from the Trump-aligned wing of the GOP conference that is pushing for him to take action against Cheney and fellow Republican Rep. Adam Kinzinger of Illinois for their roles on the House select committee investigating the January 6 insurrection.",
    "\"The most successful Representatives in Congress focus on the needs of their constituents, and throughout her career, Harriet has championed America's natural resources and helped the people of Wyoming reject burdensome and onerous government overreach,\" McCarthy added.",
    "Hageman responded to McCarthy's endorsement in a statement, saying, \"I am very grateful for Leader McCarthy's strong support, and I pledge that when I am Wyoming's congresswoman, I will always stand up for our beautiful state and do the job I was sent there to do.\"",
    "While McCarthy has held off intense efforts to boot the duo out of the Republican conference, he ultimately was able to convince members of the hardline Freedom Caucus that a better course of action would be to become active in the primary of Cheney.",
    "For her part, Cheney has continued on with her campaign undeterred, outraising Hageman by large sums and drawing support from traditional Republicans like her father the former Vice President Dick Cheney and former President George W. Bush.",
    "Rep. Dan Newhouse, a Washington state Republican who is among the group that voted to impeach Trump for inciting the Capitol attack, said: \"I would hate to see that happen,\" referring to GOP leaders potentially backing Cheney's primary foe.",
    "The tension between the two began in the wake of the January 6 insurrection when Cheney called for her party to move on from former President Donald Trump and voted to impeach him, while McCarthy chose to cozy up to the former President.",
    "During a recent episode of his podcast, GOP Rep. Matt Gaetz of Florida, one of McCarthy's biggest critics, gleefully agreed when former Fox host Lou Dobbs suggested that either Gaetz or Ohio Rep. Jim Jordan should run for speaker.",
    "While McCarthy's decision will be welcomed by members of the Freedom Caucus and could help him stave off a potential challenge for the speaker's gavel should Republicans win back the majority, it won't come without a cost.",
    "And while siding with Cheney's opponent may help McCarthy to calm the concerns of the far-right Republicans in his caucus but it is by no means a guarantee they will all back him in a potential bid for speaker.",
    "The policy of the National Republican Congressional Committee is that they do not get involved in primaries with incumbents, but individual members of leadership are free to do as they please.",
    "His gamble is that the goodwill this endorsement will earn him with Trump and his backers will outweigh the risk that Cheney could win and thereby show that his support is not that valuable.",
    "Many rank-and-file Republicans are uncomfortable with members of the party turning on each other and fear it could ultimately hurt their efforts to win elections in competitive districts.",
    "Cheney's criticism of Trump led to his backers in the House to successfully push for her to be removed from her position as the chairwoman of the GOP Conference.",
    "The former President has made a pledge to take each one of them out and has already recruited and endorsed candidates in several other races.",
    "It will also make life even more difficult for the 10 Republican members who voted to impeach Trump.",
    "\"I personally believe him to be a RINO,\" Dobbs said of McCarthy while Gaetz nodded in agreement.",
    "\"I think the party should try and continue to work with them,\" said Texas Rep. Pete Sessions.",
    "\"I think this is a fight between Donald Trump and (Kinzinger and Cheney), not the party.\"",
    "\"I am proud to endorse Harriet Hageman for Congress,\" McCarthy said in a statement.",
    "\"The party needs strength, it needs vision, it needs vibrancy, it needs new blood.",
    "\"This is a distraction that we shouldn't be engaged in,\" Newhouse said.",
    "That dangerous calculus is generally why leaders stay out of primaries.",
    "It was a movement McCarthy initially resisted, but ultimately backed.",
    "Still, McCarthy has generally stayed out of these intraparty battles.",
    "\"We should be focused on truly who our opponents are.\"",
    "It needs new leadership, it is just that simple.\"",
    "Kinzinger has decided not to run for reelection."
  ]
}