{
  "id": 488,
  "mediaId": 188,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "GOP leader Kevin McCarthy endorses pro-Trump primary challenger to Liz Cheney",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTM3MTA3Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY1NzQ2NzYyN30.Rv1SNTz05IFGLF4V3-uVYag33GX7LLZMsgH3Cyeftv4/img.jpg?width=1245&quality=85&coordinates=0%2C0%2C0%2C33&height=700",
  "link": "https://www.theblaze.com/news/mccarthy-cheney-hagman-wyoming-primary",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carlos Garcia",
  "authorUrl": "https://www.theblaze.com/u/carlosgarcia",
  "termIds": [
    1147,
    1248,
    1609,
    3085,
    3094,
    146,
    428,
    562,
    2590,
    2945,
    2976
  ],
  "sentences": [
    "\"The most successful Representatives in Congress focus on the needs of their constituents, and throughout her career, Harriet has championed America's natural resources and helped the people of Wyoming reject burdensome and onerous government overreach,\" said McCarthy in his statement.",
    "Despite the unpopularity of her joining the Jan. 6 committee, Cheney reported raising $2 million in her recent financial filing, making the primary election likely one of the most expensive in Wyoming history.",
    "The Democrats in Washington, D.C. only see her as a temporary but useful tool to achieve their partisan goals, and the Republicans want nothing to do with her,\" said Hageman.",
    "Hageman also released a statement that vehemently criticized Cheney for participating in the congressional committee investigating the Jan. 6 rioting at the U.S. Capitol.",
    "\"Cheney is doing nothing to help us, she is actively damaging the Republican Party  both in Wyoming and nationally  and it's time for her to go,\" Hageman concluded.",
    "Wyoming deserves a congresswoman who will combat the disastrous Biden administration and hold them accountable for their policies,\" she added in part.",
    "House Republican Leader Kevin McCarthy of California endorsed Harriet Hageman for the at-large seat for Wyoming in the U.S. House of Representatives.",
    "Cheney has made it clear that she believes former President Donald Trump bears responsibility for the rioting at the U.S. Capitol on Jan. 6.",
    "\"Liz Cheney has completely lost the ability to do her job of representing Wyoming as our only member of the House of Representatives.",
    "\"It is her responsibility to fight for Wyoming and represent our values, and she has completely abandoned that.",
    "Republicans ousted Cheney from her leadership position in the party in response to her insolence.",
    "A spokesperson for Cheney offered a brief response to the endorsement of Hageman.",
    "Hageman is the pro-Trump primary challenger to Rep. Liz Cheney (R-Wyo.).",
    "Wow, she must be really desperate,? said Jeremy Adler.",
    "The primary election will be completed in August.",
    "Here's more about Wyoming's congressional seat:",
    "McCarthy released his endorsement Thursday."
  ]
}