{
  "id": 492,
  "mediaId": 238,
  "date": "2/16/2022 12:00:00 AM",
  "headline": "Opinion: Democrats fight about policy. Republicans fight over who's most loyal to Trump.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/17/parties-arguing-amongst-themselves/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2087,
    1147,
    1147,
    1248,
    1248,
    227,
    227,
    146,
    146,
    428,
    428,
    2538,
    2538,
    2672,
    2672
  ],
  "sentences": [
    "That has already been decided; the only question in these primaries is whether one candidate or another is an adequate representative of the Trumpist worldview, one that is hostile to public health measures, committed to lies about voter fraud, eager to whip up the culture war and motivated above all by hatred of liberals.",
    "A former chair of the Georgia Republican Party calls it a cocktail of people being really just mad, beyond the pale of what I would say is traditional political discourse.?\nEvery open seat seems to be the site of a demolition derby, and few incumbents are safe from challenge.",
    "Yet if there's a single person most responsible for the party's problem passing legislation and the resulting consequences  eroding independent support and depressed Democratic turnout  it would be Sen. Joe Manchin III (W.Va.), the most conservative Democrat in Congress.",
    "Our two great parties are always evolving, but what we've often seen in the past is that one party at a time will have an intense internal debate  usually after it loses a few elections  while the other party, having won recent victories, sees little need to change.",
    "If Republican nominees fail, blame will be placed on the individuals  perhaps the party nominated someone beset by scandal or who was just personally unappealing  but not the fundamental Trumpist identity that now defines them.",
    "Some important caveats: Together, these counties make up a relatively small portion of the whole electorate, and the blowout Trump counties are small and rural, while the blowout Democratic counties are large and more urban.",
    "As Politico reports, they are heading into a season of utterly vicious primaries that are all but guaranteed to push the party toward more anger and a firmer devotion to Donald Trump and his lies about our elections.",
    "For some broad context, consider some fascinating data assembled by Rhodes Cook on blowout counties,? places where one presidential candidate wins more than 80 percent of the vote.",
    "The Houston Chronicle asked all 143 Republicans running in congressional primaries in Texas whether President Biden's 2020 victory was legitimate, and only 13 said yes.",
    "And of course, Democrats nominated Biden, the most moderate of the 2020 primary contenders, precisely because he was seen as having the widest general election appeal.",
    "There are a few exceptions  Sen. Lisa Murkowski in Alaska, Rep. Liz Cheney in Wyoming  but in the vast majority of races, no matter the outcome, Trumpism will win.",
    "But regardless of the election outcome, both parties will keep having these same internal arguments  which means our divisions are unlikely to ease anytime soon.",
    "Multiple Republican governors  all of them extremely conservative  are facing primary challenges from the right, from Georgia to Ohio to Alabama to Idaho.",
    "To be sure, the party as a whole has moved left over the long term, but that evolution is still punctuated by short-term pullbacks toward the center.",
    "But on the Republican side, win or lose, there will be no debate about ideology and not much debate at all about the wisdom of Trump's path.",
    "Though most or all GOP governors are likely to survive, they'll have to prove their Trumpist bona fides to the Republican base to do so.",
    "In many cases the less maniacal candidate will win, but only once they've cleared a bar that demonstrates they're Trumpist enough.",
    "But it's a vivid window into the country's changing political landscape, and the places that define the two parties' identities.",
    "Nevertheless, the ensuing debate will take place among Democrats everywhere, from swing districts to the deepest blue cities.",
    "In 2012, Mitt Romney won with those lopsided margins in 274 counties; four years later, 641 counties gave blowouts to Trump.",
    "What they won't do is make an argument for a post-Trump conservatism, let alone something that resembles moderation.",
    "Even in the most liberal places in the country, there are still vigorous debates about policy and tactics.",
    "Democrats, on the other hand, are having a traditional debate between centrists and true believers.",
    "Democrats see that as evidence that they're the ones more connected to reality, which may be true.",
    "In 2020, the dramatic change held up: 653 blowout Trump counties, and 32 blowout Biden counties.",
    "In other words, the intraparty argument isn't between two visions of what the GOP should be.",
    "The number of blowout counties for Democratic candidates rose only slightly, from 24 to 31.",
    "We saw it in New York, where the more moderate candidate, Eric Adams, was elected mayor.",
    "We saw it in San Francisco, where a group of school board members was just recalled.",
    "Their self-reinforcing cycles will keep the party moving in the same direction.",
    "The same dynamic is playing out in House and Senate races.",
    "No issue dominates these races like Trump's lies does.",
    "If Democrats lose, many will blame the left.",
    "Think about the midterm elections.",
    "Let's begin with Republicans."
  ]
}