{
  "id": 496,
  "mediaId": 409,
  "date": "2/14/2022 12:00:00 AM",
  "headline": "Fix the January 6 Committee",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/02/nancy-pelosi-capitol-hill-democrats.jpg?w=1592",
  "link": "https://www.nationalreview.com/2022/02/fix-the-january-6-committee/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew C. McCarthy",
  "authorUrl": "https://www.nationalreview.com/author/andrew-c-mccarthy/",
  "termIds": [
    2052,
    2052,
    1765,
    1765,
    2214,
    2214,
    1081,
    1081,
    1248,
    1248,
    1335,
    1335,
    753,
    753,
    428,
    428,
    427,
    427,
    2888,
    2888
  ],
  "sentences": [
    "Kinzinger has since had to abandon any hope of seeking reelection later this year (Pelosi's enticements did not include insulation from gerrymandering by Illinois Democrats), and Cheney, who in 2020 won her Wyoming seat by a whopping 44 points, will need all the grassroots support she can muster to overcome a very contentious 2022 primary challenge, fueled by former president Trump and state-party leaders he influences heavily.",
    "The joint committee's mandate should include not only crafting a complete account of the relevant events but also reporting on its determinations of whether (a) impeachable offenses were committed, and (b) there is a constitutional basis to conduct an impeachment  understanding that Trump has been out of office for over a year, but that he is laying the groundwork to run for the presidency again.",
    "At the joint session of Congress to acknowledge Trump as winner of the 2016 election, Raskin had baselessly objected to the counting of state-certified electoral votes cast in Trump's favor, the same anti-constitutional tactic used by Trump's congressional supporters in trying to invalidate electoral votes won by Biden  a tactic Raskin and the committee now blame for instigating the riot.",
    "That signal is not obscured by the RNC's rationalizing about double standards: railing about the harsh prosecutorial treatment of the rioters compared to radical-Left violence; intimating that January 6 was essentially just legitimate political discourse,? while hyping a storyline that the uprising  in which rioters are on tape beating on cops  was really an FBI entrapment scheme.",
    "This is the third and final column in a three-column series on the House Select January 6 Committee, prompted by the Republican National Committee's censure of Liz Cheney and Adam Kinzinger, the House committee's two GOP members, and Senate minority leader Mitch McConnell's rebuke of the censure resolution.",
    "The country's sharp modern divide may no longer lend itself to landslide drubbings along the lines of Goldwater (1964), McGovern (1972), or Mondale (1984); but should Trump become the nominee, no one should be surprised when his trouncing proves worse than John McCain's seven-point loss in 2008  much worse.",
    "Clearly, the Capitol riot is of continuing relevance, given Trump's recent suggestion that he would pardon rioters, his persisting in the stolen-election claims, and his absurd insistence that Pence had constitutional authority to overturn the election? result at the January 6 joint session of Congress.",
    "It was especially juvenile for the RNC to censure Cheney and Kinzinger while this democratic process is playing out  going all-in against Republican incumbents on behalf of an unstable lightning rod who, with all the advantages of incumbency, managed to lose to the notoriously insipid Joe Biden.",
    "And it would minimize the chance that Republican leadership, upon retaking the House, would retaliate for Pelosi's aggression by stripping Democrats of various committee assignments  such reciprocity may sound like poetic justice but would kill the House as a functioning bipartisan institution.",
    "Not content with setting reckless precedents, Pelosi compounded the public-perception that she has rigged the January 6 Committee by hand-picking Representatives Liz Cheney and Adam Kinzinger  to provide a bipartisan faade, notwithstanding the strenuous objections of House Republican leaders.",
    "It must be seen as bipartisan and fair to the former president; but to the extent it investigates his suspected commission of crimes, it should be structured as an inquiry into Trump's impeachable offenses  with findings on that score that he will have to bear if he tries to run again.",
    "She and her fellow Democrats will remember this ruefully if, after likely GOP victories in the midterms, a new Republican House speaker starts stripping coveted committee assignments from influential Democrats  right after disbanding whatever remains of the January 6 Committee.",
    "The country, quite sensibly, does not like the anxiety of presidential impeachment  which, no doubt, is why the January 6 Committee's enabling legislation does not mention it, even as the committee openly investigates whether Trump committed impeachable crimes.",
    "ecause of House speaker Nancy Pelosi's partisan heavy-handedness, the January 6 Committee  presently constituted as a panel of implacable Trump enemies tasked to portray the Capitol riot as the Battle of Fort Sumter  has been dismissed by much of the country.",
    "Party leaders are not wrong, however, to complain that Cheney and Kinzinger could have supported McCarthy's prerogative to seat Republicans of his choice on the committee, even as they expressed strong public support for the establishment of the committee.",
    "Trump supporters represent an important faction of the party  and, when push comes to shove, although most Trump sympathizers in Congress may try to deflect the Capitol riot by changing the subject when it comes up, they do not dare try to defend it.",
    "As a practical matter, if the committee were broadly accepted as legitimate by the country, a damning report would illustrate that Trump is no longer a viable Republican or independent presidential candidate  in the sense of being fit or electable.",
    "So, as things now stand, we have a committee whose focus on potential crimes is constitutionally dubious, and whose blatantly partisan, stridently anti-Trump provenance will result in its eventual report's being ignored by much of the country.",
    "The anti-Trump duo's disdain for McCarthy's erratic management of it is palpable: The minority leader was vocal in condemning Trump right after the riot, but changed his tune when Trump's devoted followers did not abandon their man.",
    "Reluctantly, I suspect that they are right  or at least that it's not an either/or situation: The bide-our-time strategy can't work unless the party's Cheneys and Kinzingers accelerate matters by being confrontational.",
    "If there is going to be a congressional committee focused on the Capitol riot, Republican leaders who care about the prospects of the party and the country in the next two elections need it to have public legitimacy.",
    "Four years before his tumultuous term in office ended with the stop the steal? farce and a riot at the Capitol, it began with 54 percent of the country voting against him in his miraculous 2016 victory.",
    "Like several other influential Republicans, McCarthy assesses that the best approach to Trump is to bide time, appease him, and hope his relevance fades away as more pressing issues take center stage.",
    "And if Cheney and Kinzinger had helped McCarthy on that score, it might even have generated public support for the appointment of one or both of them to the committee, whether by McCarthy or Pelosi.",
    "Cheney and Kinzinger could have declined to be political footballs, but they accepted Pelosi's invitation for what they judged was the greater good of exposing the breadth of Trump's derelictions.",
    "Worse, by so obviously stacking the deck against Trump, Democrats have played right into his hands  keeping the spotlight on him and enabling him to rile up his loyalists by playing the victim.",
    "Patently, Pelosi insulted the nation's intelligence by contending that the Trump sycophancy of Jordan and Banks would undermine her hand-picked committee's objectivity (ahem) and legitimacy.",
    "Still, he made a defensible judgment that the best strategy was to deny the committee's legitimacy after Pelosi's blatantly partisan affront, which offended even Trump-hostile Republicans.",
    "Should that grip endure, it would spell disaster for Republican electoral prospects and for the country that would thus be consigned to additional years of woke-progressive governance.",
    "Pelosi also had to realize that the precedent she set by denying Republican committee appointments would eventually be turned against Democrats, probably sooner rather than later.",
    "An Overhaul to Shore Up the Committee's Legitimacy\nNow, to conclude that the censure was asinine is not to say that GOP anger at Cheney and Kinzinger is without any justification.",
    "Not surprisingly, then, the RNC's ineptitude resulted in a week of Republican leaders scurrying away from reporters and hiding under their desks to avoid addressing the censure.",
    "The Constitution gives the House plenary power to decide whether to proceed with impeachment articles, so the House could decide what to do after the committee's work is done.",
    "And even less so when the target of that violence was the seat of our government, where elected officials were then carrying out a constitutionally mandated obligation.",
    "He knew she wanted GOP participation so the committee, despite her tight control over it, would appear legitimate to Republicans, independents, and moderate Democrats.",
    "They need to give former President Trump a fair shake, but be patriotically committed to a comprehensive, credible probe that lets the chips fall where they may.",
    "No matter how one feels, though, about the anti-Trump message that she and Kinzinger so zealously convey, their motivation includes saving the party from itself.",
    "For the last seven years, going back to the Hillary-emails scandal, your humble correspondent has been as vocal as they come in condemning two-tiered justice.",
    "It may have been counterproductive on balance: Pulling out left McCarthy without allies on an important committee that is liberally exercising subpoena power.",
    "Democrats are the House majority party, so they should retain their committee majority (which, with Cheney and Kinzinger, is an even larger working majority).",
    "The Senate should be permitted to appoint eight or ten members, chosen by McConnell and Majority Leader Chuck Schumer, and evenly divided between the parties.",
    "a lawsuit Thompson quietly dropped because he badly wanted to run the high-profile committee and realized the suit showed how ill-suited he is for that role.",
    "Unless Republicans come to the realization that electability is an indispensable quality in a presidential candidate, Trump could conceivably be nominated.",
    "But political parties are collaborative enterprises, and the my-way-or-the-highway approach of Cheney and Kinzinger is not conducive to party discipline.",
    "That said, GOP leaders would be best served in this instance by seasoned, scrupulous members, regardless of whether they are Trump supporters or critics.",
    "If Senate minority leader McConnell were disposed to push for this course correction, it would firm up the committee's legal and political foundation.",
    "Regrettably, Trump continues to exert much more influence over the RNC, state GOP organizations, and elected Republicans, than on the public at large.",
    "Yet, for the short-term partisan goal of keeping a spotlight on Trump, Pelosi has risked blowing up the House as a functioning bipartisan institution.",
    "McCarthy took a righteous stand in withdrawing Republican participation from the committee in response to Pelosi's despotic nixing of his appointees.",
    "Trump is using the January 6 Committee's blatant bias and Javert style to rile up his supporters in anticipation of a revenge-tour presidential run.",
    "It would ensure that the January 6 Committee would be permitted to complete its work  it would not be disbanded if the Republicans retake the House.",
    "His mere announcement that he is running would dissuade many solid Republicans, from across the party's competing factions, from entering the race.",
    "Cheney and Kinzinger clearly find this craven, concluding that the problem, far from fading away, is getting worse and has to be taken head-on.",
    "Adam Schiff and Jamie Raskin had piloted the Democratic-driven first (Ukraine) and second (Capitol riot) impeachments of Trump, respectively.",
    "Senator McConnell should join with Minority Leader McCarthy to negotiate with Democrats for an overhauled committee framework and mandate.",
    "That is how credible congressional committees work  as with courtroom due process, the adversarial approach crystallizes disputed issues.",
    "That is why keeping Trump front and center while giving Republicans a reason to dismiss the January 6 Committee is a boon for Democrats.",
    "No current committee member should be removed from the panel, nor need Democratic chairman Bennie Thompson be dislodged from that role.",
    "That would lead to a crushing GOP defeat in the general election and four more years of ruinous progressive-Democratic governance.",
    "Her edict that two senior GOP representatives, Jim Jordan and Jim Banks, would not be permitted to serve was a sheer power play.",
    "There is nothing conservative about the radical conceit that we have to suppress the Constitution in order to save the Republic.",
    "That said, the first allegiances of the People's representatives must be to themselves and their constituents, not their party.",
    "Thus the joint committee would have 21 or 23 members, which would be manageable and fitting given the gravity of its mandate.",
    "If he were to fold up his tent, there would be no point in further congressional action to disqualify him from future office.",
    "It was outrageous for Pelosi to deny House Republican leaders their prerogative to choose members to serve on the committee.",
    "By accepting Pelosi's invitation to join the committee, they pulled the rug out from under Minority Leader Kevin McCarthy.",
    "McCarthy and McConnell would be wise to avoid appointing members whose conduct has and will come under committee scrutiny.",
    "So let's be clear on this: None of what I am proposing would oblige Congress to proceed to a third Trump impeachment.",
    "For all their obsessions about Trump's destructiveness, Democrats have done more than their share of norm-bulldozing.",
    "For what it's worth, I remain a Liz Cheney fan  I don't always agree with her, but she is a principled conservative.",
    "It would demonstrate that Republicans are opposed to political violence and committed to investigating it credibly.",
    "They want to position Republicans as unambiguously on the side of the Constitution and against political violence.",
    "Schiff was the principal peddler in Congress of the Democrats' fraudulent Trump collusion with Russia? narrative.",
    "The committee, however, should become bicameral and truly bipartisan  maybe think of it as building back better!",
    "It should be a bicameral, bipartisan body with the authority to investigate potential impeachable offenses.",
    "Moreover, its rigged nature is a gift to Donald Trump, though a poison chalice for the Republican Party.",
    "Pelosi claimed, straight-faced, that the pair of ardent Trump loyalists would compromise the committee.",
    "This, after stacking the committee with some of Washington's most infamously Trump-deranged Democrats.",
    "For example, her chosen chairman, Bennie Thompson, had personally sued Trump after the Capitol riot .",
    "Yes, it's a disgrace that Marxist radicals have not been more aggressively pursued for their mayhem.",
    "Without such discipline, it is hard for Republicans to joust with rigorously disciplined Democrats.",
    "Disagreement with Cheney and Kinzinger was not a rational reason for the RNC to censure them.",
    "Getting a cross-section of Republicans on the committee would have enhanced its credibility.",
    "Beyond that, they intuit that the broader public is dismayed by Trump's grip on the GOP.",
    "It signals that when it comes to January 6, the RNC stands with Trump and the rioters.",
    "Besides, at the time, McCarthy was still hoping to pressure Pelosi into backing down.",
    "Impeachment has always hovered here, but to acknowledge that aloud would be bracing.",
    "Senator McConnell has struck a blow for normalcy and propriety by blasting the RNC.",
    "That is a prudential consideration, though; it is not a basis for disqualification.",
    "Yet Democrats calculate that Trump could very well win the Republican nomination.",
    "Who cares whether McCarthy exercised his discretion to tap some pro-Trumpers?",
    "The committees that investigated Watergate had plenty of Nixon sympathizers.",
    "That is why Senator McConnell had to act, swiftly condemning the censure.",
    "The committee would make its report to the full Congress and the public.",
    "McCarthy should be permitted to appoint four members of his choosing.",
    "In terms of national popularity, it never got much better than that.",
    "Congressional committees are inevitably partisan political bodies.",
    "None of this bothers Democrats, because it suits their purposes.",
    "As they see it, that is Biden's best shot at being reelected.",
    "But serious people cannot mince words on political violence.",
    "The first column in the series is here; the second is here.",
    "They realize that Trump could not win a national election.",
    "That could have strengthened McCarthy's negotiating hand.",
    "More to the point, the censure was political malpractice.",
    "The Trump problem is a vexing challenge for GOP leaders.",
    "This must not be a partisan or retaliatory exercise.",
    "It is Republicans who have the most to lose here.",
    "Again, that is how congressional committees work.",
    "Cheney and Kinzinger gutted McCarthy's leverage.",
    "Sure, I believe they acted in good faith.",
    "It has now gotten considerably worse.",
    "Here's hoping he finishes the job.",
    ".",
    "."
  ]
}