{
  "id": 501,
  "mediaId": 223,
  "date": "2/13/2022 12:00:00 AM",
  "headline": "Yet Another RINO May Run for President in 2024",
  "image": "https://media.townhall.com/townhall/reu/ha/2018/170/48ba5a67-6204-42a1-bce7-63ece397c2ab.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/02/13/yet-another-rino-may-run-for-president-in-2024-n2603231",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    1796,
    1796,
    2214,
    2214,
    920,
    920,
    1248,
    1264,
    1264,
    1248,
    571,
    571,
    146,
    146,
    428,
    428,
    2782,
    2782,
    2945,
    2945
  ],
  "sentences": [
    "In responding to whether \"there's a lane for a moderate-ish, blue state, anti-Trump, sane Republican like you, when you look at your party right now,\" Hogan promoted himself on his GOP credentials while also going after partisan politics:\nWell, I consider myself a commonsense conservative.",
    "\"But I'm concerned that they're focusing too much on looking at the past and trying to relitigate the last election and arguing about things, instead of having a positive, hopeful vision for America,\" he went on to say.",
    "To say it's legitimate political discourse to attack the seat of our Capitol, and smash windows, and attack police officers, and threaten to hang vice president, and threaten to overthrow the election, it's insanity.",
    "The comments came towards the end of his appearance on CNN's \"State of the Union,\" when host Jake Tapper pointed out that Hogan announced this week that he would not run for the U.S. Senate.",
    "The Republican Party that I want to get back to is the one that believes in freedom and truth, and not one that attacks people who don't swear 100 percent fealty to the dear leader.",
    "Larry Hogan on rejecting Senate bid: \"I like to get things done and in Washington it seems as if there's just a lot of divisiveness and dysfunction and not a lot gets done.",
    "While Hogan did acknowledge that \"there are certain things that we want to stand up to President Biden,\" such as inflation, he did criticize his party in other ways.",
    "Hogan is just as bad as the flawed tests he paid big money for,\" referring to COVID tests that Hogan purchased from South Korea and had to spend money to replace.",
    "#CNNSOTU pic.twitter.com/PR9V7Y2X8t\n State of the Union (@CNNSotu) February 13, 2022\nHogan not only shared \"I just have never had a desire to be a U.S. senator.",
    "While he can't run again for governor, he still has another year in his term, and expects his decision about running for president to come after next January.",
    "Chris Sununu (R-NH), who likewise declined to run for the U.S. Senate, and has spoken about a \"roadblock\" Republican senators are apparently creating.",
    "Tapper also tried to get Hogan to discuss losing the party:\nTAPPER: So, the battle for the soul of the Republican Party, are you losing it?",
    "The 2024 Republican presidential primary may see RINO candidates running like Reps. Liz Cheney and Adam Kinzinger, and now potentially Gov.",
    "Right now, I think we have made tremendous progress, because we went from about 80-some percent that wanted to reelect Donald Trump to 50.",
    "Trump and Hogan had a back-and-forth shortly after the presidential election in 2020, when the governor called on Trump to concede.",
    "And the latest CNN poll came out and said, right now, only 50 percent of the Republicans would like to see Donald Trump run again.",
    "However, just 45 percent of Democrats want Biden to run for re-election, something he has repeatedly said he plans on doing.",
    "About 70 percent of the people in America are completely frustrated with politics on both sides, Republicans and Democrats.",
    "Both Tapper and Hogan addressed former President Donald Trump, whom Hogan has criticized in the past, including on CNN.",
    "As Tapper and Hogan both mentioned, a CNN survey showed that 50 percent of Republicans want Trump to run again in 2024.",
    "But you're -- yes, I have been speaking out loudly and strongly about this battle for the soul of the party.",
    "Larry Hogan, who is prevented from running for the governor in Maryland again by term limits.",
    "He also wrote in \"Ronald Reagan\" for president when he cast his ballot in the 2020 election.",
    "\"We're certainly going to take a look at it after January of '23,\" Hogan shared.",
    "And it's a -- there's a circular firing squad where we attack Republicans.",
    "Sen. Chris Van Hollen, a Democrat, is up for re-election in November.",
    "And my heart wasn't in it,\" but it's a matter of timing.",
    "HOGAN: Well, I think we have still got a long way to go.",
    "I believe that that's where most people in America are.",
    "Tapper had asked him to comment on comments from Gov.",
    "So, it wasn't the right job, right fit for me.\"",
    "Hogan didn't merely go after Trump, though.",
    "\"This RINO will never make the grade.",
    "I have been a lifelong Republican.",
    "Like I said, we have until 2024.",
    "That's a huge drop.",
    "Maryland GOP Gov."
  ]
}