{
  "id": 503,
  "mediaId": 43,
  "date": "2/13/2022 12:00:00 AM",
  "headline": "Fash And Furious",
  "image": "https://images.dailykos.com/images/905670/story_image/CapitolRiot.JPG?1610643246",
  "link": "https://www.dailykos.com/story/2022/2/13/2080119/-Fash-And-Furious",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2214,
    2214,
    1813,
    1813,
    1930,
    1930,
    1248,
    1127,
    1127,
    1248,
    1147,
    1147,
    428,
    428,
    427,
    427,
    146,
    146,
    545,
    545
  ],
  "sentences": [
    "In yet another Fifth Circuit classic, the Court just ruled that Biden's executive order asking for an \"an accounting for the benefits of reducing climate pollution\" was unconstitutional because it violated the \"the major questions doctrine\", a doctrine not grounded in law and simply created out of thin air by the Supreme Court over the last two decades in order to restrain the power of federal agencies, as well as \"the separations of powers clause of the United States Constitution\", a clause which is nowhere to be found in that particular document.",
    "We've seen it all before in other countries - a first coup attempt, the Stalinesque purge of \"disloyal\" Party members, the overt racism, the disenfranchisement of certain blocs of voters and subverting the electoral system, the whitewashing of history and turning education into propaganda, the loyalty tests and Stasi-like demands to spy on your neighbor, the corruption of the judiciary, and the threats of violence and overt displays of weaponry - and it never ends well.",
    "One leader of a group trying to organize such trucker protests in the US by targeting specific border crossings is also a 1/6 insurrectionist who said at the time, \"We would be well within our rights to take any alleged American who acted in a turncoat fashion and sold us out and committed treason  we would be well within our right to take them out back and shoot them or hang them\".",
    "The Republican National Committee (RNC) is the institutional arm of the Republican Party and, as such, it passed a resolution to censure Republicans Liz Cheney and Adam Kinzinger, declaring the Party \"must not be sabotaged by Representatives Liz Cheney and Adam Kinzinger who have demonstrated, with actions and words, that they support Democrat efforts to destroy President Trump\".",
    "In Michigan, Republican candidates for governor and the state Senate told prospective Republican poll workers \"If you see something you don't like happening with the machines, you see something going on, unplug it from the wall...but the American people, at some point in time, if we can't change the tide, which I believe we can, we need to be prepared to lock and load.",
    "It is hard to decide which part of this censure was the most concerning - was it the Trumpian/Fox propaganda that \"Democrats in Congress have embarked on a systematic effort to replace liberty with socialism; eliminate border security in favor of lawless, open borders; create record inflation designed to steal the American dream from our children and grandchildren\"?",
    "There was a similar situation in North Carolina where the son of the Republican State Senate leader also sits on the State Supreme Court and also refused to recuse himself from ruling on redistricting maps drawn and passed by his father and also provided a dissenting vote in the decision overturning those maps based on violations of the state constitution.",
    "What's truly shocking is just how few Republicans are willing to stand up against this now raging fascism; just how many Democrats refuse to confront it; just how little the political and legal systems seem willing or able to do anything about it; and just how much the elite discourse, from broadsheets to boardrooms, underestimates the danger it poses.",
    "There have always been strains of it on the Party's (and the capitalization is appropriate in light of its current contempt for democracy) both far and not-too-far right, but the path from Goldwater's extremism, to Nixon's and Reagan's sub-rosa racism, to Donald Trump's white Christian nationalism, to today's open fascism is easy to discern.",
    "Missouri is taking Stand Your Ground law to the ultimate extreme by currently debating a bill that that says merely declaring that you were acting in self-defense would make you immune from arrest and prosecution unless that state could prove with \"clear and convincing evidence\" that the use of force was unlawful.",
    "Unsurprisingly, the lawlessness exhibited at the highest court in the land has spread down into the lower federal courts, especially where the Party has placed unqualified judges or the Party's use of the blue slip has formed highly partisan panels in circuits where the Party has long held Senate seats.",
    "Already, some RNC members are hiding behind the voice vote, refusing to answer just exactly how they voted, while others are trying to claim that the resolution's claim of \"legitimate political discourse\" only applied to peaceful protesters, a distinction the actual censure motion did not make.",
    "In a case to be decided this year, the Supreme Court is expected to strike down New York's law that requires proof of some kind of special need in order to carry a concealed gun outside the home, potentially opening the floodgates of public spaces where concealed guns could be legally carried.",
    "Finally, Trump resorted to his evergreen go-to strategies of projection and overt racism by accusing the prosecutors investigating him and his company, who all now happen to be Black, of being racists themselves, adding an incitement to racial violence if he should ever get indicted.",
    "Needless to say, he was one of three dissenting votes in a decision that threw out the new redistricting maps because they did not meet the \"standards of partisan fairness and proportionality\" required by a 2015 amendment to the state constitution that passed with 71% of the vote.",
    "Just weeks after being place on the Court just days before an election, Justice Barrett decided to give an address at the McConnell Center, with McConnell himself in attendance, and had the audacity to whine that the image of the Justices as partisan hacks was simply unfair.",
    "Those protests, if and more likely when they come, will probably be far more violent than what we have seen in Canada, although there appears to be at least a faction in Ottawa that is more interested in a violent conflict with the government, much like some US militias.",
    "As Justice Kagan writes in her Alabama dissent, \"Today's decision is one more in a disconcertingly long line of cases in which this Court uses its shadow docket to signal or make changes in the law, without anything approaching full briefing and argument\".",
    "Multiple states are implementing \"snitch lines\" so that citizens can report any \"offenses\" as well as allowing lawsuits that have the sole purpose of intimidating educational institutions and teachers from even risking any brush with non-compliance.",
    "Wisconsin is already a democracy desert, a state where Democrats have won the popular vote in both 2012 and 2018 but could only barely block the Republicans from having a supermajority in the state legislature because of partisan gerrymandering.",
    "And when all of those efforts came to naught, he unleashed the violent attack on the Capitol to stop the certification which he gleefully watched unfold on TV from his safe perch in the White House, often hitting rewind to watch portions again.",
    "The Black Atlanta prosecutor who is investigating Trump's aforementioned seditious phone call to the Georgia Secretary of State is now having to seek police protection because of the violent threats the former president's attack has generated.",
    "He has reportedly been in regular contact with Florida Governor DeSantis even as that state was a party to the case in front of the Supreme Court involving vaccine mandates for health care workers that receive Medicare or Medicaid funding.",
    "In both cases, the Court simply ignored what the existing law actually says and provided no legal rationale for their decision other than the apparent whims of the Federalist Society Five - Thomas, Alito, Gorsuch, Kavanaugh, and Barrett.",
    "On November 18th, a Trump campaign lawyer wrote a memo that included a section entitled \"The January 6 Hard Deadline\" and a subsequent memo in early December outlined the strategy for choosing a fraudulent, alternate slates of Electors.",
    "Trump is now using Mar-a-Lago as a vehicle for taking bribes for endorsements as illustrated by the Michigan Republican Attorney General candidate who paid $17,000 to hold a fundraiser at the club that brought in no money, nada, zilch.",
    "Ted Cruz says that because Black women make up only 6% of the population, Biden is \"saying to 94% of Americans, 'I don't give a damn about you'\", adding that the pick would be \"offensive\" and is somehow also \"an insult to Black women\".",
    "Thomas has a long history of both \"forgetting\" to include his wife's substantial earnings in his financial disclosure forms and ignoring his obligation to recuse in cases where his conservative activist wife is seemingly involved.",
    "The perfect example of this is the current Fifth Circuit which includes Texas and parts of Louisiana and Mississippi, and which has literally become a lawless Star Chamber where the party can go to get any decision it wishes.",
    "Like the Texas abortion bounty case, these shadow docket decisions are framed by the majority as just being procedural rulings but they create a merits decision on the ground with no actual legal reasoning provided by Court.",
    "Trump allies considered using the National Security Administration to examine raw signals data in an attempt to find interference or even vote tampering by foreign powers that would give Trump the excuse to remain in power.",
    "Apparently, that is not enough for the Party, because Senator Ron Johnson is now working with the state legislature to allow it to control federal elections instead of the current independent state elections commission.",
    "GOP Senator Roger Wicker from Mississippi declared the nominee would be a \"beneficiary\" of what he called \"affirmative racial discrimination\", affirmative action in other words, simply because she is a Black woman.",
    "Or was it the lie that the failed 1/6 coup was \"legitimate political discourse\" in an attempt to turn the insurrectionists into Party patriots and martyrs and legitimize political violence to overturn an election?",
    "Rather than the haphazard and incompetent effort as was originally portrayed, it is now clear that Trump was totally focused on overturning the election, even by a violent coup, from the moment the polls closed.",
    "In Virginia, the Republican Attorney General fired the top lawyer for the University of Virginia because he had worked with the 1/6 committee and therefore did not have the proper \"loyalties\" to the Party.",
    "Already, senior Party leaders are encouraging trucker protests here in this country, with Rand Paul openly saying, \"I'm all for it...I hope the truckers do come to America, and I hope they clog up cities\".",
    "That donation, which was the largest donation the PAC had made and was nearly 75% of all its donations in the six-month reporting period, was made just days after the 1/6 committee was officially formed.",
    "Despite continual warnings over the course of his four-year term that he was breaking the law, Trump constantly shredded documents, apparently even eating those shreds or flushing them down the toilet.",
    "Needless to say, the Party's hand-picked cronies in the judicial system are doing their part in implementing one party rule and are willing to violate the most basic judicial norms and ethics to do so.",
    "He considered having the military seize ballots under the guise of foreign interference and, when that didn't pan out, he thought he might get the Department of Homeland Security to do it instead.",
    "The normally stingy former President also directed his PAC to donate $1 million to a conservative non-profit where Mark Meadows, his chief of staff during the coup, was currently a senior partner.",
    "Nazis marched in Florida and Republican Governor DeSantis refused to condemn them saying that asking him to do so was an attempt to \"smear\" him by using it as \"some type of political issue.",
    "Meanwhile, it has become increasingly clear just how intent Trump was on using every available lever of his power to instigate his autogolpe, ending with the violent insurrection on 1/6.",
    "In Ohio, the Republican governor's son sits on the State Supreme Court and refused to recuse himself in a case involving the Republican gerrymander that his father voted to create.",
    "A similar snitch line was established by a private conservative group to monitor abortions in Texas with the idea that they could then sue those people involved in an abortion.",
    "The Party is working to ensure that every American constantly feels that threat of violence by making guns readily available and allowing them to be carried virtually anywhere.",
    "The Circuit's latest effort was to slap a nationwide injunction on Biden's vaccine mandate for federal workers, a request that twelve federal judges had previously turned down.",
    "There are apparently gaps in the White House call logs for 1/6, suggesting that the calls were either deleted from the logs or were made to and from non-governmental phones.",
    "Educational gag orders are being implemented in Party-run states across the country and many of these orders now extend beyond K-12 primary education into higher education.",
    "In the last two decades, nineteen states, mainly controlled by Republicans, have legalized permitless carry, often without any required training or even background checks.",
    "All of these Orwellian tactics are backed up by the threat of violence, as the aforementioned Michigan candidate's call to bring guns to the polls so clearly illustrated.",
    "The racial attacks on Biden's Supreme Court nominee, whom he has promised will be a Black woman, are even more outrageous considering no specific nominee has been named.",
    "If this law passes, the NAACP may find the need to renew their 2017 travel warning about Missouri because of its long history of \"race, gender and color based crimes\".",
    "According to one Houston lawyer, the Trump-appointed judge in this case was \"was hand-picked to be the national injunction judge\" - hand-picked by the Party, that is.",
    "The US Supreme Court just eviscerated the last vestige of the 1965 Voting Rights Act with its shadow docket decision allowing Alabama' racial gerrymander to proceed.",
    "Trump continually harangued the DOJ to declare there was rampant fraud in the election and plotted to install a crony as Attorney General who would do exactly that.",
    "Eric Trump followed up the former president's accusations against those prosecutors by accusing the Black New York State Attorney General of \"third world\" tactics.",
    "In essence, this law shifts the burden of the defendant having to prove deadly force was necessary, as current law exists, onto the state to prove that it wasn't.",
    "And the Party is putting together the legal structure to create a Stasi-like system where deviation from the Party orthodoxy can be reported and punished.",
    "He illegally absconded to Florida with boxes of documents that belonged to the National Archives which included top secret and other classified material.",
    "Trump considered using virtually every lever of state power to commit his coup - pressuring state officials, DOJ, DHS, NSA, and even the Vice President.",
    "In addition, they are, like a proposed New Hampshire law, an attempt to ensure teacher \"loyalty\" and will be used to attack public education as a whole.",
    "This fascism is no longer driven by the autocratic former president but is now deeply ingrained in all levels of the Party, from school board to Senate.",
    "Alito in particular has a long history of speaking about issues currently or expectedly before the Court, usually in front of conservative audiences.",
    "The RNC's censure also exposed the cowardice and gutlessness that has typified Republican lawmakers' tolerance and then support of Trump's fascism.",
    "Similar tracking of women inquiring about abortions is already being proposed in multiple other states in preparation for the end of Roe v Wade.",
    "It was a bunch of cowards sitting in a ballroom voting to censure two members of Congress who had the nerve to place democracy ahead of Trump\".",
    "Incredibly, the RNC is paying Trump's personal legal bills associated with his defense against investigations into his own private businesses.",
    "Justice Gorsuch just gave an address to a Federalist Society gathering which headlined many top Republicans and which was closed to the press.",
    "Several historically Black colleges and universities (HBCUs) were forced to cancel classes because of a coordinated series of bomb threats.",
    "Last October, Justices Alito and Kavanaugh met with head of a group which provided an amicus brief in an open case before the Court.",
    "At least nine states controlled by the Party have passed laws that bar state and local police from helping enforce federal gun laws.",
    "Beyond the extreme partisan gerrymandering and rampant voter suppression, attempts in that direction are becoming even more direct.",
    "GOP Senator John Kennedy from Louisiana opined that he hoped the nominee was someone \"who knows a law book from a J.Crew catalog\".",
    "These days, however, the pace of the Party's transformation seems to be getting faster and more furious with every passing day.",
    "A recent proposed, now failed, bill in Arizona would have allowed the state legislature to \"accept or reject election results\".",
    "If these Stasi-like tactics aren't concerning enough, conservative Trump supporters had a mass book-burning rally in Tennessee.",
    "A proposed, now failed, bill in Iowa would have put cameras in the classroom to further monitor teacher loyalty and compliance.",
    "This open racism has real-world consequences beyond the long history of Black men murdered by vigilantes and law enforcement.",
    "As one legal analyst put it, \"it's really hard to overstate how completely lawless and fringe right-wing the 5th Circuit is.",
    "In Colorado, elected Party leaders are publicly calling for the execution of both the Secretary of State and the Governor.",
    "Similarly, several predominantly Black high schools in Washington DC also received a coordinated series of bomb threats.",
    "Party orthodoxy now requires the negation of any minority views in pursuit of its white Christian nationalist ideology.",
    "[J]ust weird conservative bullshit going straight from a Facebook comments section right into the federal reporter\".",
    "Trump browbeat the Georgia Secretary of State to \"find\" just enough votes to declare him the winner of that state.",
    "These gag orders cover discussion of this country's historic structural racism as well as sex and gender issues.",
    "Trump is now offering prospective pardons to 1/6 insurrectionists, effectively engaging in witness tampering.",
    "That New Hampshire bill also puts a $500 bounty on teachers who \"violate\" the purposely vague subject bans.",
    "Besides continually ignoring existing law and precedent, Justice Thomas has other ethical issues as well.",
    "Like the Party as a whole, the RNC is just another subsidiary of the larger Trump criminal enterprise.",
    "The Trump campaign pressured certain state officials to turn the actual voting machines over to them.",
    "Immediately after election day, the Trump team was already focused on the 1/6 certification process.",
    "Of course, other members of the Federalist Five spend their time at nakedly partisan Party events.",
    "Of course, overt racism is now almost required to display members' Party loyalty these days.",
    "Thomas was one of the three dissenters that sided with Florida in the Court's decision.",
    "I hope we are going to have in this country the biggest protest we have ever had\".",
    "Was it the Stalinesque purging of Republicans Cheney and Kinzinger from the Party?",
    "When all that failed, Trump pressured Pence into overturning the election on 1/6.",
    "Oklahoma is considering creating a database of women merely considering abortion.",
    "And this is what the RNC is trying to describe as legitimate political activity.",
    "Was it the intimidation of reporters at the hotel where the RNC was meeting?",
    "If these radical, vicious, racist prosecutors do anything wrong or illegal.",
    "This is yet another example of how Trump has essentially become the Party.",
    "The Republican Party's descent into fascism has been years in the making.",
    "Post failed coup, Trump is desperately trying to cover his tracks.",
    "Georgia is already considering a bill that would do exactly that.",
    "As Sarah Reece Jones notes, \"The censure resolution wasn't read.",
    "The Republican Party's drift into fascism has become a torrent.",
    "The Party orthodoxy is also focused on ensuring one party rule.",
    "Said Trump, \"These prosecutors are vicious, horrible people.",
    "[T]hey've completely abandoned any veneer of impartiality.",
    "It wasn't debated, and there was no written vote cast.",
    "Was it the equating of Trump with the Party itself?",
    "By the time they all do, it may well be too late.",
    "They're racists and they're very sick.",
    "We're not playing their game\".",
    "It can happen here and it is.",
    "He got Trump's endorsement.",
    "You asked what can we do.",
    "They're mentally sick.",
    "Show up armed\"."
  ]
}