{
  "id": 505,
  "mediaId": 43,
  "date": "2/13/2022 12:00:00 AM",
  "headline": "BIDEN---DAY389---SECOND",
  "image": "https://images.dailykos.com/images/885911/story_image/2020electionmap.jpg?1605980065",
  "link": "https://www.dailykos.com/story/2022/2/13/2080186/-PRESIDENT-JOE-BIDEN-DAY389-SECOND-YEAR-DAY25-Evening-Shade-Sunday",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1145,
    1147,
    1248,
    1311,
    1999,
    2087,
    2270,
    2465,
    3094,
    428,
    2942
  ],
  "sentences": [
    "https://t.co/8dJvw2Q124\n Gloria Borger (@GloriaBorger) February 13, 2022\nREPUBLICAN SEN. MITCH MCCONNELL\nx\n\"the message McConnell delivers privately is unsparing, if debatable: Trump is losing political altitude and need 't be feared\n\"McConnell is blunt about the damage Trump has done\n\"he's declared he won't let unelectable 'goofballs' win GOP primaries\"\n https://t.co/PXHAqzMb44\n John Harwood (@JohnJHarwood) February 13, 2022\nREPUBLICAN SEN ROGER MARSHALL\nx\nSen. Roger Marshall says that if Republicans win the majority in House and Senate, they'll look at passing legislation forcing Biden to take an annual cognitive test pic.twitter.com/BNunLogGBI\n Aaron Rupar (@atrupar) February 13, 2022\nx\nthe senator who demanded that Fauci make already-public information public https://t.co/m5b7PN6Tbb\n John Harwood (@JohnJHarwood) February 13, 2022\nGIULIANI\nx\nGiuliani is in talks to testify with the J6 committee.",
    "https://t.co/WSC82E7I55\n Kyle Griffin (@kylegriffin1) February 13, 2022\nx\nBush 43 pitched Ducey + Sununu\nMitch telling recruits Trump has lost juice, his lieutenants sharing polling to prove\nMitt + Collins deputized to woo Hogan\nDucey's RGA on air for Kemp\nOld guard is hoping to win in 22 *and* expose Trump as paper tiger https://t.co/v30QuGvaBE\n Jonathan Martin (@jmartNYT) February 13, 2022\nx\nAfter he backed Parnell early and then lunged for Mo Brooks, Trump has expressed regret at blowing capital in some races.",
    "PRESIDENTIAL ELECTION 2020\nW E L C O M E\nTO THE SHADE\nYOU WILL FIND in the DIARIES a LOT of POLITICS\nAND EVEN MORE CATS\nTHE PERSON who MAKES the FIRST COMMENT WILL GET TWO CATS\nEVERY PERSON WHO COMMENTS WILL GET A CAT\nRULES IN THE DIARY\nWHEN YOU FIND SOMETHING in the DIARY that you LIKE\nYOU CAN REPOST IT AS COMMENT in the DIARY\nPRESIDENT JOE BIDEN\nx\nNEWS: President Biden and Ukrainian President Zelenskyy will speak at 10:45am ET, a White House official tells us.",
    "Unclear what level of cooperation he would provide if he testified, but his lawyer has signaled to the committee he's likelier to be less hostile than others in Trump's orbit https://t.co/ywErrBS8g5\n Maggie Haberman (@maggieNYT) February 13, 2022\nREP. ELAINE LURIA\nx\nRep. Elaine Luria (D-VA) confirms that Rudy Giuliani is in talks to testify before the committee investigating January 6th.",
    "He's signing bottles of the swill and giving to donors who pony up $5K pic.twitter.com/8zpv5FWLUB\n Jonathan Martin (@jmartNYT) February 13, 2022\nx\nTbh, they should fill the Crow bottles w @MakersMark 46, justify the price\n Jonathan Martin (@jmartNYT) February 13, 2022\nx\nMost interesting primary w no impact on general but much on the future of party & Senate is AL\nTrump backed Mo early.",
    "pic.twitter.com/sJdT7rtwnK\n The Recount (@therecount) February 13, 2022\nREPUBLICAN REP. ADAM KINZINGER\nx\nKinzinger says January 6 committee \"fully\" expects Giuliani to comply with subpoena https://t.co/xjK5oYXPn4\n CBS News (@CBSNews) February 13, 2022\nREPUBLICAN REP. LIZ CHENEY\nx\nRep. Liz Cheney: \"I'm not going to convince the crazies and I reject the crazies.\"",
    "Biden is at Camp David where he spoke to Putin for just over an hour yesterday\n Josh Lederman (@JoshNBCNews) February 13, 2022\nx\nREADOUT, Biden-Zelenskyy call:\n\"President Biden made clear that the United States would respond swiftly and decisively, together with its Allies and partners, to any further Russian aggression against Ukraine.\"",
    "@MSNBC\n Kyle Griffin (@kylegriffin1) February 13, 2022\nx\nAt one point, the National Archives notified a member of Trump's team that it planned to alert Congress and the Department of Justice of his refusal to hand over presidential documents if the matter wasn't quickly resolved.",
    "Now there's a tad more restraint\n\"Not everybody who runs down to Mar-a-Lago for the weekend gets endorsed on Monday,\" deadpans @SenKevinCramer\n Jonathan Martin (@jmartNYT) February 13, 2022\nx\nHow much is @LeaderMcConnell enjoying the Old Crow moniker ?",
    " Kyle Griffin (@kylegriffin1) February 13, 2022\nCANADA\nx\nPolice in Ontario have begun to clear out people who've been blocking the Ambassador Bridge between Canada with Detroit.",
    "@SenShelby $ coming bigly for Britt\n Jonathan Martin (@jmartNYT) February 13, 2022\nx\nTrump has been running down @dougducey since the weeks after the 2020 election.",
    " Kyle Griffin (@kylegriffin1) February 13, 2022\nTRUMP\nx\nEx-Trump DHS official Miles Taylor says aides feared giving Trump classified info because he might leak it.",
    "https://t.co/2uVMiPAOEk\n Kyle Griffin (@kylegriffin1) February 13, 2022\nPOLAND\nx\nState Department: Poland has opened its borders to Americans fleeing Ukraine.",
    "But there's another Trump admin figure who has been encouraging him on:\nYup, it's g pic.twitter.com/9xWpnOQ7tK\n Jonathan Martin (@jmartNYT) February 13, 2022",
    "\"We were scared, legitimately scared, to take sensitive classified information into the Oval Office and tell the president of the United States about it.\"",
    "\"The people right now who are in the leadership of our state party, I'm not trying to get their support because they've abandoned the Constitution.\"",
    " Kyle Griffin (@kylegriffin1) February 13, 2022\nJAN. 6 COMMITTEE\nx\nTrump's unorthodox phone habits complicate January 6 investigation - CNNPolitics.",
    "Reporting with ??@jamiegangel? and ??@Ashley_Semler? on a fear of phone calls -- getting overheard.",
    "McConnell wouldn't say he'll oppose Mo, but he's watching Britt + Durant closely.",
    "\"We expect him to cooperate fully with the investigation.\"",
    "No advanced approval is required.",
    "One of em likely to be in runoff."
  ]
}