{
  "id": 507,
  "mediaId": 21,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "Rep. Liz Cheney's leading GOP primary challenger says she doesn't know who lawfully won the 2020 presidential election",
  "image": "https://i.insider.com/6207ece13b86990018b313ed?width=1000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/liz-cheney-republican-challenger-hageman-2020-election-trump-biden-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    1147,
    1248,
    2087,
    3085,
    3094,
    86,
    183,
    428,
    562,
    571,
    2976
  ],
  "sentences": [
    "The congresswoman has long maintained that the January 6 insurrection was an affront to the rule of law  as it disrupted the Electoral College certification of President Joe Biden's 2020 electoral victory and sent lawmakers fleeing to secure spaces away from the mayhem that was unfolding at the US Capitol building.",
    "The results of a straw poll conducted last month by the Wyoming Republican State Central Committee revealed 59 votes for Hageman, while Cheney won six votes, with two votes for state Sen. Anthony Bouchard and one vote for retired US Army colonel Denton Knapp, according to The Casper Star-Tribune.",
    "Cheney, who Hageman hopes to oust in the GOP primary, has received heated criticism from within her party for her rejection of Trump's debunked election claims, pointing to the lack of verifiable evidence that would support his longtime accusations of voter fraud.",
    "Despite boasting a solidly conservative voting record, Cheney's vocal admonishment of Trump  who won 70 percent of the vote in the 2020 presidential election in Wyoming  long attracted the ire of the former president and his supporters.",
    "Harriet Hageman, a water rights attorney who has been enthusiastically endorsed by former President Donald Trump, could not verify the legitimate victor of the election when asked during an interview with the newspaper on Wednesday.",
    "Her vote to impeach Trump for incitement of insurrection for his role on January 6  along with her continued criticism of his election claims  led to her removal as the House Republican Conference Chair last year.",
    "The leading Republican challenging Rep. Liz Cheney in Wyoming for the party's primary told The New York Times during an interview this week that she was unsure who lawfully won the 2020 presidential election.",
    "She has raised $443,000 in the fourth quarter of 2021, but her total was dwarfed by Cheney's $2.04 million quarterly haul, according to documents filed with the Federal Elections Commission.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "However, while 43% of Hageman's fourth-quarter donors came from Wyoming, only 1.3% of Cheney's quarterly contributions came from in-state, according to WyoFile.",
    "AP Photo/Mead Gruver, File\nRepublican Harriet Hageman, during a recent New York Times interview, couldn't say who won the 2020 presidential election.",
    "In Cheney's view, Trump abdicated his commitment to the secure and peaceful transfer of power, threatening the stability of the country.",
    "Hageman is one of several candidates running in the Republican primary against Cheney, but she is the best-funded challenger.",
    "Hageman is running against Liz Cheney, who has been castigated by many Republicans for rejecting Trump's election claims.",
    "Hageman's position reflects that of many Republicans who have continued to doubt the veracity of the 2020 election.",
    "Hageman has also cultivated a significant amount of grassroots support that was boosted by Trump's endorsement.",
    "\"I don't know the answer,\" the GOP House candidate told the newspaper during the conversation.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Wyoming Republican congressional candidate Harriet Hageman.",
    "\"I don't know the answer,\" she told The Times.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}