{
  "id": 508,
  "mediaId": 238,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "Republicans may be divided over Trump, but that's of little solace to Biden and the Democrats",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/02/12/sundaytake-gop-infighting-democrats-biden/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    1685,
    1685,
    1765,
    1804,
    1804,
    1765,
    2087,
    2214,
    2214,
    1147,
    1147,
    1248,
    1248,
    146,
    146,
    428,
    428,
    427,
    427
  ],
  "sentences": [
    "For Democrats who reveled in the RNC controversy and who would like to see Jan. 6 and the former president's lies about 2020 as front-line issues in the midterm elections, Republican pollster Kristen Soltis Anderson has a warning: Nothing could be a bigger political gift to Republicans than a focus looking backward, litigating Jan. 6 and continuing to bring it up,? she said.",
    "But as with the 2019 report by special counsel Robert S. Mueller III into Russia's interference in the 2016 election, possible collusion by the Trump campaign (he found plenty of contacts but no criminal conspiracy) and Trump's efforts to obstruct the investigation, whatever the Jan. 6 committee produces will be received through the prism of a partisan electorate.",
    "and Adam Kinzinger (Ill.) for their joining Democrats on the Jan. 6 committee in the persecution of ordinary citizens engaged in legitimate political discourse.?\nNo amount of spin by RNC Chairwoman Ronna McDaniel or others about what legitimate political discourse? did not mean could undo the unforced error  or tamp down the ridicule.",
    "Biden and the Democrats are under pressure to find a way to tell a positive story about the past year, whether it is about millions of new jobs being added, checks being delivered to struggling families or the passage of the bipartisan bill to rebuild the nation's aging infrastructure.",
    "Under the best of circumstances  meaning an easing of inflation by early summer and/or a return to something approaching normalcy with the pandemic  Democrats could still lose the House but might hold the Senate, given that the Senate map is worse for Republicans.",
    "Fourteen years ago, during the heat of their nomination contest, Barack Obama and Hillary Clinton took opposing positions on doing exactly that, with Clinton in favor and Obama dismissing it as a short-term proposal that wouldn't solve the real problem.",
    "For all that it said about the Republicans  and it said plenty about a party that has been caught in the undertow of the former president's lies and obsessions  the RNC controversy offered only minimal opportunity to Democrats as a campaign issue.",
    "Inflation, cost of living, things like crime: These are things people think are affecting their daily lives.?\nDemocratic pollster Jefrey Pollock, acknowledging the head winds his party faces, offered a counterargument about Jan. 6's importance.",
    "Democrats piled on the criticism of the RNC, but this was a sideshow to their main challenge of trying to persuade voters to look more favorably on Biden and themselves in the hope that they could turn around their midterm fortunes.",
    "With inflation roaring at a pace not seen in 40 years, intraparty Democratic debates about mask mandates and President Biden's weak approval ratings, the fundamentals for the midterm elections continue to look ominous for the party.",
    "A newly released CNN poll paints a gloomy picture of the president, with his approval rating upside down and with many of those who disapprove of his overall performance saying they can't think of anything he's done that they like.",
    "Sen. Mitt Romney (R-Utah), who also condemned the RNC resolution, said, Anything that my party does that comes across as being stupid is not going to help us.? But will GOP stupidity actually help the Democrats?",
    "It was a violent insurrection for the purpose of trying to prevent a peaceful transfer of power after a legitimately certified election from one administration to another,? he told reporters on Tuesday.",
    "For now, Biden is telling voters he feels their pain while vulnerable Democratic senators are trying to make clear that they recognize the financial pinch their constituents are feeling.",
    "He told NBC's Lester Holt that he thinks the lifting of mask mandates is probably premature.?\nIs the president out of step with the country or will his caution prove to be wise?",
    "Democrats hope that those Republican primaries will produce candidates far enough out of the mainstream to compromise their ability to win in a general election.",
    "But it and other items in the survey highlight the degree to which the anti-Biden part of the electorate is far more passionate than the pro-Biden portion.",
    "It's not a story that average voters care about.?\nThe investigation by the House committee into the Jan. 6 attack on the Capitol is something different.",
    "This is important because of what it signifies for the Republicans, but there's scant evidence that it's going to move many general election voters.",
    "That's where the political implications are and why [Senate Minority Leader] Mitch McConnell [R-Ky.] is trying to fight the fight of saying hold on.",
    "They've coalesced around a proposal called the Gas Prices Relief Act, which would suspend the 18.4-cent federal gas tax for the rest of this year.",
    "For several days, the big running story was the fallout from the decision by the Republican National Committee to censure Reps. Liz Cheney (Wyo.)",
    "Few minds are likely to be changed by what the committee concludes in its report, however critical it might be for Trump and his acolytes.",
    "He is trusting the science, he says, but will voters conclude he was leading or following as the country adapts to declining caseloads?",
    "Thursday's inflation report that showed consumer prices having risen by 7.5 percent over the past year highlights the real problem.",
    "But he's a lonely voice.?\nHe was referring to McConnell's rebuke to the suggestion that Jan. 6 was either legitimate or discourse.",
    "Revelations keep coming that speak to how determined Trump and his allies were to overturn the results of the 2020 election.",
    "That might be a gratuitous question to ask people who already say they don't like the way the president has done his job.",
    "Democrats got another harsh reminder this past week of what the November elections could bring, which is to say trouble.",
    "The GOP remains a party divided over former president Donald Trump, the 2020 election and what happened on Jan. 6, 2021.",
    "McConnell's comments highlight divisions within the GOP that will play out in primary elections this spring and summer.",
    "Each new piece of information underscores the importance of producing the most complete accounting of events possible.",
    "As it stands now, Biden needs both a more effective strategy and perhaps some lucky breaks to avoid a nasty November.",
    "Now, some Democratic governors are moving away from mask mandates, joining with what Republican governors have done.",
    "That is the overarching reality even though the Republicans spent a good part of the week fighting among themselves.",
    "Biden and the Federal Reserve are under pressure to try to slow inflation's pace, but there may be no easy fix.",
    "It remains an inside-the-Beltway issue that has not and likely will not break through to the typical voter.",
    "Cable and Twitter gave it plenty of attention, though neither is representative of the broader electorate.",
    "They are a party with no clear governing agenda, yet they could be in control of Congress a year from now.",
    "Months ago, the administration suggested the country had turned the corner on the coronavirus pandemic.",
    "Biden and his team played down the threat of inflation last year, suggesting it was transitory.",
    "Biden and the Democrats know what they need to do; it's executing that is proving difficult.",
    "Many political strategists say the RNC's censure resolution is not top-of-mind for voters.",
    "Under the worst of circumstances, however, the Senate too would fall to the Republicans.",
    "We know the general public thinks what happened on Jan. 6 is terrible,? he said.",
    "It's those suburban voters in particular who find the behavior to be atrocious.",
    "We know there is a significant faction on the right that thinks it was normal.",
    "It's a national pundit kind of story,? said Republican pollster Neil Newhouse.",
    "The administration was caught flat-footed as demands for tests skyrocketed.",
    "A number of economists say that inflation will ease later in the year.",
    "It was a perfect controversy to feed an always-hungry media beast.",
    "Then came the delta variant and, more recently, omicron.",
    "The committee's work will help to ensure that happens.",
    "For Democrats, that is especially worrisome.",
    "It has proved not to be such.",
    "But hope is not a strategy.",
    "Biden remains cautious.",
    "Perhaps."
  ]
}