{
  "id": 510,
  "mediaId": 151,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "POLITICO Playbook: Biden warns allies of imminent Russian attack on Ukraine",
  "image": "https://static.politico.com/8a/30/e9e2516b47848db91177eadf9c99/220212-biden-getty-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/02/12/biden-warns-allies-of-imminent-russian-attack-on-ukraine",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3094
  ],
  "sentences": [
    "Congress is suddenly racking up modest yet consequential victories, from protecting victims of sexual abuse and improving mail delivery to making the U.S. more competitive with China,? NBC's Sahil Kapur and Scott Wong write, and the flurry of bipartisan activity comes as Democrats have hit a wall on many of Biden's campaign promises that lack GOP support, from gun control to liberalizing immigration to overhauling police practices.?\nSen. SUSAN COLLINS (R-Maine) put it like this: What the Democratic leaders seem to have finally realized is that in a 50-50 Senate, the only way you're going to be able to produce any accomplishments that matter to the American people is to work across the aisle.?\nAnd here's Sen. CHRIS MURPHY (D-Conn.), to CNN's Lauren Fox: It shifted when the talks on BBB fell apart.",
    "HAPPY BIRTHDAY: Playbook's own Eugene Daniels  Justice Brett Kavanaugh  Susan Page  principal deputy national security adviser Jon Finer  Megan Apper of the State Department  POLITICO's Chris Suellentrop and Kristen East  Jim VandeHei  NBC's Marc Caputo  Maya King  Charlotte Sellmyer  Chris Hodgson  WaPo's Marianna Sotomayor  Ali Lapp  David Reid  Christina Noel  David Brody  Adam Webb  former Rep. Gil Cisneros (D-Calif.)  Trish Hoppey  Christine Jacobs  Robert Zeliger  Kristin Gossel  Lewis Lowe  Bridget Anzano  Jeff Schlagenhauf  Barbara Zylinski  Kyle Naye  WSJ's Rachel Feintzeig  Facebook's Ryan Beiermeister  Ben Sherwood  Jeremy Iloulian\nTHE SHOWS (Full Sunday show listings here):\nABC This Week?: Speaker Nancy Pelosi  Sen. Lindsey Graham (R-S.C.).",
    "What will he turn himself into next??\n It's Your Friends Who Break Your Heart,? by The Atlantic's Jennifer Senior: The older we get, the more we need our friends  and the harder it is to keep them.?\n How The Pandemic Is Changing Our Bodies,? by BuzzFeed News' Katie Camero: Whether it's your eyes, skin, teeth, or something else, the pandemic is having an impact on bodies that has nothing to do with Covid.?\n I More So Consider Myself a Con Artist Than Anything,'' by Gabrielle Bluestone for N.Y. Mag: What Danielle Miller learned at Horace Mann and Rikers.?\n Biden doesn't want to change China.",
    "On Friday afternoon, in response to a FOIA request filed by BuzzFeed News in 2019, the DOJ revealed previously undisclosed portions of the Mueller Report, with three main bits of news: (1) ROBERT MUELLER considered charging DONALD TRUMP JR. with a misdemeanor computer intrusion' crime for accessing a website using a password he obtained from WikiLeaks;? (2) Mueller had insufficient evidence to charge ROGER STONE with crimes related to the 2016 hacking of the DNC; (3) the report did not establish' that the Trump campaign's then-director of national security, J.D.",
    " A public records revelation: A Jan. 23 email obtained by POLITICO's Nicholas Wu shows that on the day Virginia AG JASON MIYARES fired University of Virginia counsel TIM HEAPHY  who was temporarily working for the House Jan. 6 committee  Republicans in Miyares' office raised questions about Heaphy's loyalties.? Miyares has previously said that the decision to remove Heaphy was not related to the Jan. 6 investigation, but these records raise new questions about the truth of that claim.",
    "He was 75.  Angle joined Fox News Channel when the network launched in 1996 as a senior White House correspondent where he appeared nightly on Special Report with Brit Hume.' Angle, who was also a regular substitute anchor for Special Report,' covered many of the most important news stories from the early years of Fox News.? (Full obituary via Fox News' Brian Flood)\nMEDIA MOVES  Adam Behsudi is returning to POLITICO as news editor for economics and finance.",
    "Democrats frustrated by the failure of Build Back Better and other policy priorities are increasingly settling on two people to blame: Senate Majority Leader CHUCK SCHUMER and White House chief of staff RON KLAIN, believing that the men too frequently sought to appease progressives and their allied groups while antagonizing the moderates needed to pass [BBB].?\nMemorable line from an unnamed Democratic lawmaker: They just won't take the hits.",
    "Federal District Judge XAVIER RODRIGUEZ issued a preliminary injunction blocking the state and local prosecutors in Harris, Travis and Williamson counties from enforcing the rule  the first legal blow to new elections restrictions and voting changes Republican lawmakers enacted last year.? Reminder: Texas' primary is on March 1.\n A new version of the Mueller Report is out with some key passages unredacted.",
    "Even so, there is growing momentum in the U.S. anti-vaccination community to conduct rallies similar to Canada's Freedom Convoy,'? reports NBC's Ben Collins  and the effort is receiving a boost from a familiar source: overseas content mills.?\n A Bangladeshi digital marketing firm was behind two of the largest Facebook groups related to the Canadian Freedom Convoy,? Grid News reported on Friday.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Among those accounts:\n U.S. intelligence believes Russia is eyeing Wednesday, Feb. 16, to start military action, report our Alex Ward and Quint Forgey, and that any action could be preceded by a barrage of missile strikes and cyberattacks.?\n But some U.S. allies are skeptical: A U.K. official said that we have a different interpretation' of the Feb. 16 intelligence.",
    "Adds WaPo's Josh Dawsey: Trump has asked if he could rescind the pardon.?\nL. Louise Lucas, a Democratic Virginia state senator, claims that Glenn Youngkin sent her a text congratulating me on my excellent speech on Black History Month.? One problem with that: The speech was actually given by a different Black woman: state Sen. Mamie Locke.",
    "CLICKER  The nation's cartoonists on the week in politics,? edited by Matt Wuerker  15 funnies\nGREAT WEEKEND READS, curated by Ryan Lizza:\n The search for lost slave ships led this diver on an extraordinary journey,? by National Geographic's Tara Roberts: Explorer Tara Roberts took up diving to learn about the human side of a tragic era.",
    " Facebook officials confirmed to NBC's Collins that Facebook groups promoting copycat convoys in the U.S. are being run by fake accounts tied to content mills in Vietnam, Bangladesh, Romania and several other countries.?\nIt's a helpful reminder that foreign meddling in U.S. politics didn't end in 2016.",
    "Start with this fact: Truck drivers in the U.S. already don't have to wear masks, and the vast majority are not required to be vaccinated against Covid, unless they plan to cross an international border.? Instead, their major gripe is a lack of safe places for drivers to park and sleep overnight.",
    "POLITICO Playbook: Biden warns allies of imminent Russian attack on Ukraine\nBy EUGENE DANIELS\n02/12/2022 10:17 AM EST\nPresented by\nDRIVING THE DAY\nOvernight, the State Department began evacuating the U.S. embassy in Kyiv amid fears that a Russian invasion of Ukraine is imminent.",
    "GORDON, was acting on behalf of Russia when he arranged for changes to the Republican platform during the 2016 convention.?\n As China aims to build a military base on the Atlantic coast of Equatorial Guinea, the U.S. is intensifying its campaign? to prevent that from happening.",
    "But: Russia confirmed media reports Saturday that it was pulling its own diplomatic staff from Ukraine, citing possible provocations by the Kyiv regime and third countries,'? though the move could also be read as an attempt to safely remove diplomats ahead of an invasion.",
    "He wants to beat it,? by WaPo's Josh Rogin\n After tragedy, one town reopens the doors,? by Erin Blakemore for WaPo in Boulder, Colo.: Nearly a year beyond the King Soopers mass shooting, Boulder residents ask: What does it mean to heal??\n The Covid Emergency Is Ending.",
    "Here's What We Should Do Next,? by Rajiv Shah for POLITICO Magazine: It's time for a new scientifically feasible and politically sustainable strategy to make the coming lull in the pandemic permanent.?\nPLAYBOOKERS\nHillary Clinton is now selling a But Her Emails? hat.",
    "On Friday night, police in Windsor issued written warnings to protesters, threatening a maximum fine of $100,000 (Canadian), up to a year in prison and the permanent revocation of any personal or commercial licenses, per Freep's Jordyn Grzelewski.",
    " He reiterated that should Moscow pursue the path of aggression and further invade Ukraine, it would result in a resolute, massive, and united Transatlantic response.?\n Scheduled to speak: President JOE BIDEN and Russian President VLADIMIR PUTIN.",
    "She wound up connecting with her family's inspiring past.?\n Bob Odenkirk's Long Road to Serious Success,? by NYT Magazine's Jonah Weiner: He was a comedian's comedian  until Better Call Saul' revealed him as a peerless portrayer of broken souls.",
    "It would be such a mistake by Putin.'?\n Ukraine is  also skeptical: I think there's too much out there about a full-scale war from Russia, and people are even naming dates,? Ukrainian President VOLODYMYR ZELENSKYY insisted at a presser.",
    "ANDREW CUOMO has conferred with a dozen former aides about a a plan to vindicate himself,? report Joseph Spector and Anna Gronewold, who walk through some of the many possibilities for how a return to public life could play out.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\n9 THINGS WE READ THAT STUCK WITH US\n Must-read from the L.A. Times: With Biden's agenda hanging by a thread, Democrats question Schumer-Klain strategy,? by Eli Stokols and Jennifer Haberkorn.",
    "MSNBC The Sunday Show?: Rep. Joe Neguse (D-Colo.)  DNC Chair Jaime Harrison  Rep. Elaine Luria (D-Va.)  Pentagon press secretary John Kirby  Michael Li  Ari Berman  Rob Doar  Melanie Willingham-Jaggers  Marc Morial.",
    "CANADIAN CONVOY CHAOS  This morning, Canadian police have amassed near the crowd of anti-vaccine protesters who've been blocking the vital Detroit-Windsor border crossing for days, reports the Detroit Free Press.",
    "And with the issue poised to take on a heightened role in several competitive swing-state Senate races,? it could have major consequences for which party controls the chamber next year, reports Natalie Allison.",
    "A new Texas law that keeps local election officials from encouraging voters to request mail-in ballots likely violates the First Amendment, a federal judge ruled late Friday,? reports Texas Tribune's Alexa Ura.",
    " Putin reportedly wanted to have the call with Biden this coming Monday, but Biden wanted to conduct it sooner as Washington detailed increasingly vivid accounts of a possible attack on Ukraine,? per Reuters.",
    "Earlier in the day, Biden and Canadian PM JUSTIN TRUDEAU discussed the border-blocking protests and agreed to coordinate on shutting down the destabilizing demonstrations,? reports Andy Blatchford.",
    "WSJ's Michael Phillips reports that a delegation of senior U.S. diplomatic and military personnel? plans to visit the small African nation next week to try and woo it away from Beijing's advances.",
    "And if no one is willing to take the hits, it's anarchy.?\n As Dem governors and House members pivot away from mask mandates, one group is holding out: Democratic senators and candidates.",
    "authorities are bracing for an American version of the movement that could launch as early as this weekend and disrupt the Super Bowl.?\nAre we likely to see copycat protests in the U.S.?",
    "We continue to see scammers latch onto any hot-button issue that draws people's attention, including the ongoing protests,? a spokesperson for Meta, Facebook's parent company, told NBC.",
    "Donald Trump is reportedly upset that Scooter Libby is attending a fundraiser for Liz Cheney  seeing it as a sign of disloyalty after Trump pardoned him, per NYT's Maggie Haberman.",
    " Russia itself has pushed back fiercely against the stark warnings by the Biden administration that Moscow is on the verge of attack,? report WaPo's Steve Hendrix and Amy Cheng.",
    " Another caveat: U.S. intelligence officials acknowledge the possibility that mentioning a particular date could be part of a Russian disinformation effort,? reports the NYT.",
    "It obviously feels like you need some breathing room to work on other things.?\n Closing arguments wrapped up on Friday in SARAH PALIN's libel suit against the New York Times.",
    "David Schweikert's campaign agreed to pay a $125,000 fine to the FEC for misusing donations and failing to adequately report other transactions,? per the Arizona Republic.",
    "Josh Gerstein has the readout, including a look at the uphill battle? faced by Palin's lawyers, and the strongest and weakest arguments from the Times' attorneys.",
    "More from Talking Biz News\nNEW NOMINEES  The White House announced two new ambassador picks: Philip Goldberg to South Korea and Carrin Patman to Iceland.",
    "They tell everyone what they want to hear and they're afraid to take the hits from activist groups, whether it's on voting rights or other policy areas.",
    "Here's the latest:\n A small core? of U.S. diplomats will remain in Kyiv so the U.S. can maintain a diplomatic presence in the country, writes Myah Ward.",
    "Per the White House, Blinken emphasized that a diplomatic path to resolving the crisis remained open, but it would require Moscow to deescalate.",
    "Playbook couldn't happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "government will not be able to evacuate U.S. citizens in the event of Russian military action,? it said in a travel advisory.",
    "The best friend for our enemies is panic in our country, and all this information only creates panic, it doesn't help us.\"",
    "WHITE HOUSE ARRIVAL LOUNGE  Alma Acosta is now special assistant to the president and House legislative affairs liaison.",
    " Top U.S. trucking advocates have taken pains to disavow the trucker blockades,? Tanya Snyder and Alex Daughery report.",
    "Meanwhile, two European Union diplomats shared even more skeptical views, with one saying they still refuse to buy it.",
    "Before talking to Biden, Putin is to have a call with French President EMMANUEL MACRON,? reports AP's Jim Heintz.",
    "CNN Inside Politics?:Panel: Jonathan Martin, Lauren Fox, Zolan Kanno-Youngs, Margaret Talev and Susan Glasser.",
    "The groups, which have since been removed by Facebook, had a combined membership of more than 170,000 people.",
    "This morning:\n Already spoke: Secretary of State ANTONY BLINKEN and Russian Foreign Minister SERGEY LAVROV.",
    "IN MEMORIAM  Fox News Channel original Jim Angle died Wednesday at his home in Arlington, Virginia.",
    " Meanwhile, the State Department has told Americans in Ukraine to leave immediately: the U.S.",
    "Panel: Chris Christie, Donna Brazile, Sarah Isgur and Patrick Gaspard  Dwight Chapin.",
    "Phil Murphy  Rep. Adam Kinzinger (R-Ill.)  Scott Gottlieb  Mary Daly  James Brown.",
    "CNN State of the Union?: National security adviser Jake Sullivan  Maryland Gov.",
    "CBS Face the Nation?: National security adviser Jake Sullivan  New Jersey Gov.",
    "Panel: Bakari Sellers, Alyssa Farah Griffin, Scott Jennings and Hilary Rosen.",
    "She previously was executive director of the Congressional Hispanic Caucus.",
    "Gray TV Full Court Press?: Rep. Debbie Dingell (D-Mich.)  Andrew Freedman.",
    "They note that U.S. and Canadian truckers have different priorities.",
    "BIDEN'S SATURDAY: The president has nothing on his public schedule.",
    "FOX Fox News Sunday,? guest-anchored by Sandra Smith: Colorado Gov.",
    "He currently is a comms officer at the International Monetary Fund.",
    "Study the photos and you will get this soon,? Lucas tweeted.",
    " Natalie Jennings is joining Vox as senior politics editor.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "She previously was deputy Washington editor at WaPo.",
    "Panel: Jason Riley, Gerald Seib and Johanna Maska.",
    "The jury plans to resume deliberations on Monday.",
    " Pentagon press secretary John Kirby  Jim Gray.",
    "Send Playbookers tips to playbook@politico.com.",
    " On pause: Texas' new mail-in voting law.",
    "But there are reasons to pump the brakes.",
    "Jared Polis  Sen. Bill Cassidy (R-La.)",
    "Did someone forward this email to you?",
    " Who says bipartisanship is dead?",
    " Disgraced former New York Gov.",
    "Thanks for reading Playbook.",
    "Good Saturday morning.",
    "It's still going on.",
    "Sign up here.",
    "Larry Hogan.",
    "Maybe.",
    "U.S."
  ]
}