{
  "id": 512,
  "mediaId": 157,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "'They're all petrified': GOP candidates panicked Trump will blow up their election chances",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29323517&width=1200&coordinates=0%2C29%2C0%2C26&height=600",
  "link": "https://www.rawstory.com/gop-panicked/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    924,
    1147,
    1232,
    1248,
    2214,
    3094,
    146,
    428,
    586,
    2707
  ],
  "sentences": [
    "Statements by anyone, including the RNC, have no impact whatsoever on my mission to clean up J.B.'s crime mess.?\nAccording to political scientist Mooney, despite efforts to ignore the RNC and Trump's shenanigans, questions about the party will continue to dog the nominees no matter how much they dismiss them.",
    "\"When the candidates and their campaigns were asked directly if they agreed with the RNC's description of the insurrection, the general response was that they are focused on Illinois and that lawbreakers should be prosecuted,\" the report states.",
    "The Tribune's Rick Pearson reports that the recent censure of Reps. Adam Kinzinger (R-IL) and Liz Cheney (R-WY) have placed a cloud over campaigning as the aspiring candidates try to tip-toe around the controversy that is roiling the party.",
    "According to a report from the Chicago Tribune, Republicans running for office in Illinois are treading carefully as they attempt to make their case with voters knowing fully well Donald Trump could derail their efforts before November.",
    "Those are two completely different things,? Mooney explained before adding, \"The Democratic electorate is also very different, but it's closer to the general election electorate because there are fewer Republicans in the state.",
    "J.B. Pritzker (D) have adopted law and order as the focus of their campaigns which keeps them from having to deal with both Trump's claims that the 2020 election was stolen along with his myriad legal problems.",
    "Everybody in the Republican apparatus, running a campaign or whatever, they're all petrified, I'm sure, of what's going to happen going down the road,? he explained.",
    "According to businessman Gary Rabine, the RNC's business is their business alone and it doesn't impact his campaign strategy\nI am running for governor of Illinois.",
    "According to political scientist Christopher Mooney of the University of Illinois at Chicago, Republicans in the state are worried if another Trump shoe will drop.",
    "Mooney added, \"When I say anything can happen, it's more like he can say anything at any given moment that they're going to have to justify.\"",
    "Pritzker has failed miserably in his most primary function as governor  keeping people safe and everyone here knows that.",
    "You've got two different electorates  the Republican primary electorate and the general election electorate.",
    "And where Republicans live, in less populated areas of the state, they're all-in Trump people.\"",
    "They need to be aligned with Trump to win the nomination and that's a fundamental problem.",
    "The report notes that the five possible GOP contenders maneuvering to take on Gov.",
    "I don't focus on what the RNC does or says.",
    "I'm focused on Illinois,? Rabine declared.",
    "We know this whole thing is a wild card.",
    "Trump's a wild card.",
    "We know that.",
    "J.B."
  ]
}