{
  "id": 513,
  "mediaId": 43,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "Abbreviated Pundit Roundup: Canadian protest is more truck than truckers",
  "image": "https://images.dailykos.com/images/1036777/story_image/shutterstock_2118644105.jpg?1644600158",
  "link": "https://www.dailykos.com/story/2022/2/12/2079832/-Abbreviated-Pundit-Roundup-Canadian-protest-is-more-truck-than-truckers",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1621,
    1621,
    2214,
    2214,
    2271,
    2271,
    1034,
    1034,
    1198,
    1198,
    1427,
    1427,
    2853,
    2853,
    2593,
    2593
  ],
  "sentences": [
    "WSJ:\nCanada Bridge Protesters Agree to Open One Lane From U.S.\nBusiness leaders demand end to blockade, with ruling expected Friday on whether police can remove demonstrators at Ambassador Bridge\nA group of protesters, who have choked off most access to the Ambassador Bridge, decided that opening up a lane might weaken the argument of lawyers for the Canadian border city of Windsor, Ontario, and the automotive industry, who seek to persuade a court that protesters need to be forcibly removed.",
    "x\nOn midterms, @Redistrict: We're headed for fewer competitive seats than we've really ever had in the modern eraI think we're headed for a great purge of Trump dissenters on the Republican side in primary season.? #AMRstaff\n Andrea Mitchell (@mitchellreports) February 11, 2022\nTheodore R Johnson/Bulwark:\nThe Role of Racial Resentment in Our Politics\nThe parties seem further apart on questions of race today than they have been for some timebut the truth is more complicated.",
    "https://t.co/n48eHm4Fde pic.twitter.com/jzvjAK5X70\n Matthew Gertz (@MattGertz) February 11, 2022\nYair Rosenberg/Atlantic:\nWhy It's So Hard to Follow the Science'\nA conversation with Harvard historian Steven Shapin about why people believe Joe Rogan, why our public discourse about science is splintered, and what to do about it\nShapin: Look, whatever we know about the natural worldwhich includes the virus and the orbits of the planets, and so oncomes from human sources.",
    "Consistent with our analysis using census data which similarly showed more equity among those w/ VA coverage in early 2021https://t.co/nInXmO9iDB\n Adam W Gaffney (@awgaffney) February 11, 2022\nRon Brownstein/Atlantic:\nThe Supreme Court's Dead Hand'\nThe 63 majority-conservative Supreme Court is dangerously out of step with a demographically and culturally changing America.",
    "When President Joe Biden announced his intention to follow through on a campaign pledge to nominate a black woman to fill the seat of retiring Supreme Court Justice Stephen Breyer, a chorus of voices on the right grabbed every mic in sight to decry the president for eschewing meritocracy in favor of identity politics.",
    "And a few days later, when Donald Trump suggested during a campaign rally that he would pardon the convicted Jan. 6th insurrectionists (many of whom openly displayed their racism), folks on the left we-told-you-so'd over how in-step the former president's move was with the right-wing politics of white grievance.",
    "The Republican Party is embroiled in a minor internal tiff over three words: legitimate political discourse.? The awkward coinage appeared in a Republican National Committee resolution censuring Liz Cheney and Adam Kinzinger for investigating Donald Trump's efforts to negate the election results.",
    "See the mask trend here: https://t.co/vjZohZd5Bg pic.twitter.com/jWN7bezHuB\n Roper Center (@RoperCenter) February 10, 2022\nJonathan Chait/NY Magazine:\nRepublicans Can't Decide Whether to Celebrate Trump's Coup Plot or Ignore It\nWhat the legitimate political discourse? fight reveals.",
    "The yawning gap between the parties is not, as is often suggested, because Republicans have become more racist and Democrats have become more woke; it is because the left has become more progressive on racial inequality while the right has fortified its pre-existing position.",
    "The Court seems to be pulling the United States back into a prior era without regard for changing notions and understandings of equity, equality, and fairness,? Sarah Warbelow, the legal director for the Human Rights Campaign, which advocates for LGBTQ rights, told me.",
    "It's a rejection of myth and a recognition that some aspects of the pandemic are unambiguous: Covid is more deadly for the unvaccinated than almost any virus in decades, and the vaccines are remarkably effective at preventing serious illness.",
    "On all of these fronts, and others, the Republican justices are siding with what America has beena mostly white, Christian, and heavily rural nationover the urbanized, racially and religiously diverse country America is becoming.",
    "But while the protests are generating a lot of noise and attention, the eruption actually points up a counterintuitive fact: The Canadian far right is weak and ineffectual, especially when it comes to pandemic restrictions.",
    "It is about almost trying to maintain a 1940s, 1950s view of what the United States is and what its obligations are to its citizens.?\nx\nTHREAD: I keep being asked when we can go \"back to normal\" or \"like it was before\".",
    "In a sense, we've always had this, but now we've got such a diversity of voices that we're asking laypeople to decide between Joe Rogan and Trump and Fauci, and determine who is speaking the truth about the virus.",
    "If you think race is a minor part of, or even a distraction from, the broader debate about the future of our democracy, let me introduce you to the last couple of weeks in American politics.",
    "Look, there's this guy, Trump; he doesn't know what he's talking about; don't believe him.? The problem we have today is a radical splintering in sources that speak about the world.",
    " David Frum (@davidfrum) February 11, 2022\nVox:\nThe Canadian trucker convoy is an unpopular uprising\nThe freedom convoy? that has besieged Ottawa isn't a people's revolt.",
    "The comments on the post are filled with #FreedomTruckers supporters using neo-Nazi rhetoric and jokes about \"honk honk\" being a dogwhistle for \"heil Hitler.\"",
    "Roper Health Poll Database is free for the public to use and includes Roper Trends--curated trend lines on important topics, created based on best practices.",
    "Ottawa Mayor Jim Watson has declared a state of emergency, and Trudeau's government has deployed hundreds of Royal Canadian Mounted Police to the protests.",
    "There is a real sense that the parties are further apart on questions of race today than they have been for some timeeach side being pulled to the poles.",
    "So part of the science that's relevant in this situation is the science of credibility: how credibility is established, how people come to know things.",
    "One of the things I think that people mean by following the science is, Look, there's this guy, Fauci; he knows what he's talking about, believe him.",
    "pic.twitter.com/2WW9LVrgki\n Vishal P. Singh (they/he) (@VPS_Reports) February 10, 2022\nDavid Leonhardt/NY Times:\nFollow the Science?",
    "President Biden likes to promise that he will follow the science, to signal his difference from Trump and deference to the C.D.C.",
    "RNC chair Ronna McDaniel is furious with the news media for highlighting those words out of what she regards as proper context.",
    "x\nA new study using VA data shows that racial disparities in COVID-19 vaxx in general population mostly not apparent in the VA.",
    "When Donald Trump was president and making false statements to downplay Covid, follow the science? began to gain popularity.",
    "x\nNEW: Neo-Nazi #FreedomTruckers advocate Tyler L. Russell (of Canada First) condemned a proposal to ban Holocaust denials.",
    "The dispute offers a revealing window into the state of the party's internal deliberations over Trump's coup plot.",
    "90% of Canadian truckers are vaccinated, and comparatively few of the truck blockaders drive a truck for a living.",
    "My personal thoughts:\nWe've added a new disease to our population, more infectious and more severe than flu.",
    "Above all, science makes clear that public health, like the rest of life, usually involves trade-offs.",
    "As the situation in Ottawa continues, the freedom convoy movement has expanded across the country.",
    "There's some movement as the truck protest loses community support, funding, and now is in court.",
    "Demonstrators have shut down at least two border crossings between Canada and the United States.",
    "That's true for Dr. Fauci and that's true for Professor Shapin, and it is true for anybody else.",
    "Many Republican officials are furious at McDaniel for passing the resolution in the first place.",
    "Now, it also serves as a response to the many incorrect statements that vaccine opponents make.",
    "These subjects are practically solved for all of us when we're young by our parents.",
    "Trucks are being used as a weapon of economic warfare against the Canadian state.",
    "They're practically solved later on as we grow up by our teachers at all levels.",
    "The world pre 2020 no longer exists - we may want it to, but it just doesn't.",
    "x\nWant to see the trend of national opinion on mask-wearing?",
    "1/13\n Prof. Christina Pagel (@chrischirp) February 10, 2022",
    "Many other Covid questions, however, are complicated.",
    "It's a fringe movement protesting its defeat.",
    "We know things through trusted sources.",
    "What does the science say about them?",
    "We're no different in that respect.",
    "But the truth is more complicated.",
    "It's certainly a \"truck\" protest.",
    "But it's not a \"trucker\" protest.",
    "We don't know things directly.",
    "The phrase does have its uses.",
    "If only it were so easy.",
    "It's a hard thing to do!",
    "It says many things.",
    "x\nSemantic note.",
    "x\nThat's right."
  ]
}