{
  "id": 514,
  "mediaId": 147,
  "date": "2/11/2022 12:00:00 AM",
  "headline": "Brooks and Capehart on the Ukraine crisis, Republican divisions over Jan. 6",
  "image": "https://image.pbs.org/video-assets/r5ZXRXi-asset-mezzanine-16x9-aw8cjEv.jpg?crop=800x450&format=auto",
  "link": "https://www.pbs.org/newshour/show/brooks-and-capehart-on-the-ukraine-crisis-republican-divisions-over-jan-6brooks-capehart",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    795,
    865,
    1915,
    1970,
    2030,
    3085,
    3094,
    428,
    2888,
    2942
  ],
  "sentences": [
    "But listening to David, but also listening to the national security adviser today, Jake Sullivan, who is a very sober person, to see him, to listen to him from the White House Press Briefing Room delivers such stark news to the American people about the intentions, what they're seeing in terms of the intelligence about what Russia is about to do, but also the warning to Americans on the ground in Ukraine to leave within the next 24 to 48 hours, says to me  and I wasn't in that briefing that David was in.",
    "To hear that the RNC is saying that the insurrectionists were engaged in legitimate political discourse told me that the RNC had lost its mind, and that the fact that you had the Senate majority  Senate minority leader, Mitch McConnell, and other Republicans stepping forward and saying, no, no, no, no, no, this does not speak for me, this is not who we are as a party, goes against what we have seen in the past, which is they just used to just sort of walk  pretend like it didn't happen.",
    "Judy Woodruff:\nWell, speaking of politics, another question I want to raise with both of you, and that is the move by the Republican National Committee last weekend, David, to censure two of its own, Congresswoman Liz Cheney, Congressman Adam Kinzinger, because of their role on the January 6 investigative committee, and then their statement that what happened, the assault on the Capitol January 6, was just normal political discourse.",
    "When I looked at what was happening, I saw a medical response and I saw a political response, the political response coming from the governors of New York and Connecticut, New Jersey, Massachusetts, all saying, we're going to ease up on the mask mandates, we're going to try to get back to normal.",
    "In 1945, after 150 million deaths and two World Wars, we set up a rules-based order, where strong nations do not get to take over little ones, that we have some sort of global international order, with NATO and the U.N. and all sorts of organizations making it a much more peaceful place.",
    "Fund-raising numbers were released, and the seven Republicans who voted for Donald Trump's second impeachment, who he has gone after to try to get them out of Congress with his own candidates, they raised  they outraised their Trump backed or their primary  their primary challengers.",
    "New York Times columnist David Brooks and Washington Post columnist Jonathan Capehart join Judy Woodruff to discuss the week in politics, including the Ukraine crisis, the widening divide in the Republican Party over the Jan. 6 insurrection, and the heated debate over mask mandates.",
    "But it's quite possible that Putin's objectives are much more ambitious, to really disrupt NATO, to take back Ukraine, which a lot of Russians think has always been part of Russian was stolen from Russia, to create a buffer between  in case there's an incursion from the West.",
    "But the president and the administration, they don't want to say, lift all the masks mandates, everyone, get back  go back to your lives as they were before, because they tried that last year, and then had to tell everyone to put masks back on because Omicron came around.",
    "But, sometimes, part of me wonders whether Vladimir Putin felt it was perfectly fine to surround Ukraine on three sides, north, east and south, with thousands of troops because he thought that the NATO alliance would not and the Western alliance would not stand up to him.",
    "And that is the growing divide between the views of Democratic governors dealing with mask mandates, dealing with COVID, and the Biden administration and some scientists, who are saying, wait a minute, it's too soon to be lifting these mandates.",
    "Judy Woodruff:\nWell, David, what's interesting is, I hear some people asking me whether the position the West has taken, the United States has taken, in effect, drawing a line here, is truly in the best interest of the United States.",
    "I'd always assumed that what Putin's objective here was just to push NATO back a little, make sure that NATO promises never to include Ukraine as one of its members, never puts U.S. troops or Western troops on Ukrainian soil.",
    "Jonathan Capehart:\nI'm not sure, because, as we all know, the American populace, writ large, doesn't pay that much attention to what's happening outside of our  outside of our borders, outside of our national concerns.",
    "But I also wouldn't be surprised if, a month or two down the road, the administration and the White House follows the lead of the governors, simply because the science and the raging of the pandemic will have abated.",
    "That liberal, small-D, democratic order that grew out of World War II, the United Nations, NATO, and so on and so forth, was created by the United States and maintained by the United States and the West.",
    "Jonathan Capehart:\nWell, I have to say that David's  what David just said, and also his demeanor, has taken me from cautious to now also feeling very, very, very concerned about what's going to happen.",
    "And if anything we have seen over the last few months is that it appears that the NATO alliance, the Western alliance is pretty solid against what Vladimir Putin appears to be planning for Ukraine.",
    "I was at an embassy dinner on Sunday where Ukraine was part of the table conversation, and lots of experts around the table, all of them wondering the same thing or saying the same thing.",
    "Judy Woodruff:\nWell, as we keep an eye on that situation across the across the Atlantic, David, I want to ask you about something happening here at home.",
    "And so our interest is not to go to war with Russia, but our interest is to preserve a world where rules are followed and it's not the law of the jungle.",
    "In 19  from 1915 to 1945, we had a culture and a regime in Europe which was the law of the jungle, the strong nations get to conquer the little ones.",
    "I think, in communities with that kind of situation, it's worth it to take some of the psychic pressure off and loosen some of the mask restrictions.",
    "The person she's running against, Harriet Hageman  I'm pronouncing her name wrong  Harriet Hageman, she raised $443,000 and has $380,000 in the bank.",
    "And they're  to David, they're responding to a weary populace, to a populace that's been on lockdown in one form or another for the last two years.",
    "And if you look  what's striking, in looking at the polling data, is just how much the Delta and then Omicron have dealt a psychic flow to people.",
    "And this comes at a time, it should be said, when it used to be most Republicans would say, I'm primarily loyal to Donald Trump, not to the party.",
    "And they won't  they can't tell us what exactly they have learned over the last several days, but it's been something that has caused them alarm.",
    "But to hear that coming from the White House today should concern many Americans about what is about to happen on the European continent.",
    "And so there's now a possibility, and I'm told even a relatively high probability, that we will see some sort of incursion into Ukraine.",
    "Well, I think there's a consensus we're not going to send troops there, we're not going to have a direct U.S.-vs.-Russia war over this.",
    "Our colleague Nick Schifrin reporting tonight that U.S. officials are saying a Russian invasion of Ukraine could come at any time.",
    "They're following the science.They're still looking at the high hospitalization rates, the high  well, the increasing death rates.",
    "But you have got the White House, which has the medical response, and a very cautious response, for the reasons that David said.",
    "David Brooks:\nYes, I like to think what Jonathan and I do is normal political discourse, but I may be living in another century.",
    "Congresswoman Liz Cheney, who is the number one target for Donald Trump, she raised $2 million in the fourth quarter of 2021.",
    "But there's another thing that I want to bring up quickly, and that is that  about the stranglehold of Trump on Republicans.",
    "Judy Woodruff:\nAnd, Jonathan, is it your sense that most Americans understand that, that that's what this is all about?",
    "They will probably be fighting  if this happens, they will be fighting to preserve their sovereignty and independence.",
    "And so that shows me the Republican Party has a lot of people who are not really about the party or not institutional.",
    "If money is speech, it looks like the establishment wing of the Republican Party is being heard loud and clear.",
    "There was one person at the table who said that, no matter what Russian President Vladimir Putin does, he wins.",
    "They point out, well, after all Ukraine is right next to Russia, that it used to be part of the Soviet Union.",
    "I can tell you, the Ukrainians then, and I think the Ukrainians now, feel that they are a separate nation.",
    "And, if Russia is allowed to take Ukraine, that would destroy, that would shred that international order.",
    "But, in my view, and it should be local by local, but we're sitting here in D.C., in the Washington area.",
    "And, instead, the RNC picked a completely unnecessary fight in order to divide the party, its own party.",
    "That's New York Times columnist David Brooks, and Jonathan Capehart, columnist for The Washington Post.",
    "Very good to see both of you on this Friday evening, although some of the news today is fairly grim.",
    "David Brooks:\nYes, I don't know if I'm talking to the same people Nick is, but I'm taking to people.",
    "How do you see the pressures on the on these Democratic governors and, conversely, on Washington?",
    "They're convinced Omicron is never going to go away, we're going to have to live with the COVID.",
    "And you were telling us that you have been talking to administration officials today yourself.",
    "Over the last couple of weeks, there's been an accumulation of concern in the U.S. government.",
    "The question is, how can we rally the West to make Russia pay some serious penalties for this?",
    "And in the course of my career, I have been in hundreds, thousands of briefings of this sort.",
    "One is to preserve the health, but the other is the overall flourishing of their communities.",
    "And that would be the most significant military action on the European continent since 1945.",
    "I don't see anything that's happening over there in the Trump wing of the Republican Party.",
    "It would test the NATO alliance, and it would test the liberal order that existed in 1945.",
    "They're still trying to understand why this is a fight the United States should be making.",
    "Usually, in these situations, the writing is pretty clear about the objectives of someone.",
    "David Brooks:\nYes, I understand where the CDC and some of the scientists are coming from.",
    "Read the Full Transcript\nJudy Woodruff:\nAnd now to the analysis of Brooks and Capehart.",
    "We saw serious pushback from people like Mitch McConnell, other prominent Republicans.",
    "And so, if you're an institutional builder for a party, you want to unify your party.",
    "And up until the presidency of Donald Trump, that alliance was inviolate, was solid.",
    "They're not nearly as bad as they were during the big peaks of the pandemic earlier.",
    "Judy Woodruff:\nThank you both this Friday night, Jonathan Capehart, David Brooks.",
    "Jonathan Capehart:\nRight, especially with Democratic governors in the Northeast.",
    "In 1991, in August, I was in Ukraine covering the Ukraine independence movement.",
    "(LAUGHTER)\nDavid Brooks:\nWhat struck me most about that is institutional decay.",
    "But the RNC is not part of that, let's distance ourselves from Donald Trump.",
    "I'm not sure I have ever been in one as sobering as the one I was in today.",
    "The RNC is supposed to be the institutional basis of the Republican Party.",
    "They have  their primary responsibility is to guard the nation's health.",
    "But the fact that they came out publicly and slammed it is terrific.",
    "On the other hand, the governors have a couple of responsibilities.",
    "They see high hospitalization rates, and they say, it's too soon.",
    "Now most are primarily loyal to the party, and not Donald Trump.",
    "They just want to get back to some semblance of their old life.",
    "And they want some peace, some version of their old life back.",
    "Over the last several days, couple days, that has accelerated.",
    "Now, a rising number of people think it'll never come back.",
    "But they should be because of what David just talked about.",
    "They didn't know what Vladimir Putin wanted to do.",
    "And they see 2,500 people still dying every day.",
    "She's got $4 million  $4.7 million in the bank.",
    "And we have enjoyed a peaceful, peaceful land.",
    "They have been governing themselves that way.",
    "We have seen Omicron up and Omicron way down.",
    "Jonathan Capehart:\nWow is all I can say.",
    "What's going on in the Republican Party?",
    "So, the caution, I think, is worth it.",
    "You want to be the center of gravity.",
    "But I agree with David 100 percent.",
    "David, I'm going to start with you.",
    "And they voted that way in 1991.",
    "So there's some weakening there.",
    "You want to keep it together.",
    "I'd say the stakes are this.",
    "That's all I can say.",
    "People are exhausted.",
    "They want the fight.",
    "They are not Russia.",
    "David Brooks:\nYes.",
    "And so it's scary.",
    "They are Ukraine.",
    "We appreciate it."
  ]
}