{
  "id": 532,
  "mediaId": 12,
  "date": "2/10/2022 12:00:00 AM",
  "headline": "The Jolt: What does actress Beverly D'Angelo have to do with Critical Race Theory?",
  "image": "https://www.ajc.com/resizer/1Pq_OWqlyPjwD7HJeV4JR5QWc_s=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/HS5ILEOMTRMH4IYXTTQMHE7LMQ.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/the-jolt-what-does-actress-beverly-dangelo-have-to-do-with-critical-race-theory/CC4NKA7VW5EQDGIRKZE4MDGY4A/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    872,
    1907,
    1984,
    2095,
    2425,
    3094,
    139,
    428,
    2537,
    2555,
    2672
  ],
  "sentences": [
    "In their letter, the eight GOP representatives wrote, We encourage you to look at the facts of Georgia's waiver and recognize our citizens require a tailored, state-based approach to delivering accessible health insurance coverage.?\nIt may not be a scientific poll, but the listeners of Gainesville's WDUN radio station know who they want for lieutenant governor  local Honda dealer and state Senate President Pro Tem Butch Miller.",
    "We are building a bipartisan coalition that includes Democrats and Republicans in both chambers who support banning stock trading by members of Congress.?\nHouse Speaker Nancy Pelosi also addressed the topic Wednesday, saying she would like to make sure whatever is done also includes the judicial branch, which currently isn't required to adhere to the same financial disclosure requirements as members of Congress.",
    "It is extremely unfortunate that language from some Councilmembers has been twisted into false headlines of stolen money and used in the worst kind of way by social media trolls.?\nWe continued to hear from lawmakers throughout the day Wednesday distressed at White's attacks on Parker, who died by suicide in January.",
    "As one Democrat noted: It turns out it might be an investigation into the use of state funds to teach about Christmas Vacation.?\nUNDER THE GOLD DOME, Thursday, Feb. 10:\n7:00 a.m.: Start your engines, committee work begins early for the day;\n10:00 a.m.: The House gavels in;\n10:00 a.m.: The Senate convenes.",
    "The Democratic Attorneys General Association has thrown its support behind state Sen. Jen Jordan, an Atlanta attorney who spent much of the past month as the only Democrat in her primary, calling her the people's lawyer.?\nSandy Springs attorney Christian Wise Smith entered the primary race last week.",
    "It has no reporting of stock transactions, and it makes important decisions every day.?\nU.S. Rep. Drew Ferguson and seven other members of the Georgia GOP congressional delegation have written to the Joe Biden administration in support of Georgia Access, the 1332 Waiver that Gov.",
    "But we noticed a glaring flaw in the 11-page letter from Republican state Rep. David Knight of Griffin, which seeks all publications and materials that use the term anti-racist? or explicitly reference three scholars: Ibram Kendi, Carol Anderson and Beverly DiAngelo.",
    "Our AJC colleague Eric Stirgus reports this morning that a GOP state legislator asked the entire higher education system to submit six years' worth of information about hiring, teaching, and administrative decisions based on anti-racism and social justice.",
    "The AJC's Mark Niesse tells us the judge in the Georgia redistricting challenge floated the idea of a delay as an alternative to the decision made in an Alabama case, where the court upheld the contested maps because of the timing of the May primaries.",
    "That was just uncalled for.?\n***\n34N22, the super PAC supporting Herschel Walker's Senate campaign is out with a new ad featuring several of Walker's high school classmates, as well as his football coach from Johnson County High School.",
    "DAGA, which has a goal of electing and supporting Democratic attorneys general, announced this morning that they are endorsing Jordan because she will use the office as a powerful tool for justice,? the AJC's Maya T. Prabhu tells us.",
    "But let's just say the internet had a bunch of fun after she uttered the statement Nancy Pelosi's gazpacho police.? It appears Greene meant to reference the Nazi Gestapo secret police force and not a bowl of chilled vegetable soup.",
    "Our Washington Insider spoke to as many Georgia Republicans in the U.S. House as she could about the Republican National Committee's censure of Reps. Liz Cheney and Adam Kinzinger for serving on the Jan. 6 committee.",
    "The flap over Stacey Abrams' mask-less episode this week reminded us how well she had managed to avoid controversy and pitfalls of campaigning since she launched her bid in December  and how abruptly that can end.",
    "The Biden administration, noting that the American Rescue Plan and other federal actions had changed the lay of the land for Georgia's marketplace, put out a new request for public comment on the waiver.",
    "There is more momentum behind efforts to ban members of Congress and their spouses from trading individual stocks, and U.S. Sen. Jon Ossoff is hoping his proposal remains in the forefront of discussion.",
    "White had suggested on Instagram that the recent death of MARTA CEO Jeffrey Parker was connected to $200 million of missing? money meant to be spent on a MARTA project in the Campbellton Road corridor.",
    "We have a much stronger fundraising pace, and the governor loses a powerful tool after he was defeated in court on his unconstitutional changes to state law to help him raise more cash,? she said.",
    "A federal judge suggested he could delay Georgia's primary election, possibly until June or July, if he rules that the state's new political maps illegally weakened representation of Black voters.",
    "None of the Georgia lawmakers said they didn't approve of the resolution, although they stopped short of co-signing the legitimate political discourse? line that drew the most controversy.",
    "It's the latest GOP backlash over critical race theory, the graduate-level coursework that studies racism as a historical pattern that's ingrained in law and other structural institutions.",
    "We told you last week that the Democratic Party of Georgia was beefing up its staff earlier than ever, with 27 employees working in various capacities to prepare for the November election.",
    "She pointed to Abrams' hot fundraising streak, the federal ruling that restricted Kemp from using a new law to raise unlimited campaign cash and the GOP warring over the former president.",
    "Former President Donald Trump's administration approved the state's plan, but the U.S. Centers for Medicare and Medicaid Services under President Joe Biden has not yet made its decision.",
    "***\nWe don't want to dig too deep into U.S. Rep. Marjorie Taylor Greene's latest rant against House Speaker Nancy Pelosi, because nearly every statement she made warranted a fact-check.",
    "Tim Reitz, the chief of staff for Georgia U.S. Rep. Jody Hice, has been named the next executive director of the House Freedom Congress, a reporter from Real Clear Politics revealed.",
    "Knight might have gotten her mixed up with Beverly D'Angelo, the actress who starred alongside Chevy Chase as Ellen Griswold in the National Lampoon's Vacation films.",
    "We have not just active engagement but active engagement and expressions of support from leadership in both houses of Congress,? he told reporters Wednesday.",
    "Half of the Georgia GOP caucus  Reps. Barry Loudermilk, Drew Ferguson, Austin Scott and Buddy Carter  didn't respond to questions about where they stand.",
    "There are nearly 40 GOP staffers now working in Georgia, including 20 field staffers, said Garrison Douglas of the Republican National Committee.",
    "That includes a strategic initiative team assigned to community centers devoted to outreach to Asian-Pacific American voters and Black residents.",
    "Brian Kemp pledging to sign a measure that would let parents decide whether to require their children to wear masks at public schools.",
    "It gave Miller a huge win over state Sen. Burt Jones, 73% to 16%, with Jeanne Seaver and Mark McGregor getting single-digit support.",
    "MARTA has recommended a transit project in the Campbellton Corridor that has a smaller estimated cost than the original project.",
    "Jon Ossoff and Raphael Warnock are ready to play their part in helping president Joe Biden make the Supreme Court more diverse.",
    "Send your best scoop, gossip and insider info to patricia.murphy@ajc.com, tia.mitchell@ajc.com and greg.bluestein@ajc.com.",
    "But we're pretty certain Knight meant Robin DiAngelo, whose book White Fragility? has come under fire from conservatives.",
    "Ossoff and other Democrats on the Senate Judiciary Committee are headed to the White House today to discuss the process.",
    "I need to hear all the evidence before I make a decision,? likely soon after court hearings conclude early next week.",
    "One of Buckhead cityhood's original backers, state Sen. Brandon Beach of Alpharetta, grimaced when asked about them.",
    "But campaign manager Lauren Groh-Wargo contended in an interview that the race's dynamics still favor the Democrat.",
    "We told you yesterday about the Capitol backlash to the social media posts of Buckhead cityhood leader Bill White.",
    "The online straw poll asked listeners who they would vote for in the LG primary and got more than 1,000 responses.",
    "Part of the 1332 waiver is already in effect, with the state subsidizing insurance payouts, but part is in limbo.",
    "Biden hasn't yet said who he will nominate but vowed to stand by his campaign promise to select a Black woman.",
    "Here is it in full:\nThere is absolutely no truth to the notion that money is missing or has been stolen.",
    "Beach, the former chair of the Senate Transportation Committee, said Parker has been a dear friend.",
    "Hice won't be returning to Congress next year because he is running for Georgia Secretary of State.",
    "And former U.S. Sen. David Perdue saying he would have already signed an executive order to do so.",
    "Brian Kemp created to overhaul how Georgians buy health insurance under the Affordable Care Act.",
    "The court system, the third branch of government, the judiciary has no reporting,? Pelosi said.",
    "The works of both Anderson and Kendi have been targeted by Republicans in other states.",
    "There are also three election integrity? staffers and a data and communications team.",
    "Sign Up to receive the Morning Jolt & AJC Politics newsletters in your inbox.",
    "Melissa Mullinax, the MARTA chief of staff, responded to White's conspiracy.",
    "I could change the whole calendar,? U.S. District Judge Steve Jones said.",
    "Georgia Republicans have built their own robust operations, too.",
    "Republicans are racing to capitalize off the flap, with Gov.",
    "As always, Jolt readers are some of our favorite tipsters.",
    "The window for submitting comments ended last month.",
    "That was uncalled for,? he said of White's attacks.",
    "The Abrams campaign has indeed had a rough week.",
    "And Trump is calling their shots,? she said.",
    "The Supreme Court has no disclosure.",
    "POSTED: Georgia U.S. Sens.",
    "They are deeply divided.",
    "You can see it here.",
    "About the Authors",
    "We are unified."
  ]
}