{
  "id": 534,
  "mediaId": 195,
  "date": "2/10/2022 12:00:00 AM",
  "headline": "GOP falters in effort to recruit star governors for Senate",
  "image": "https://cdn.jwplayer.com/v2/media/0biEcgZ4/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/593563-gop-falters-in-effort-to-recruit-star-governors-for-senate",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester",
  "termIds": [
    852,
    1131,
    1249,
    1765,
    1796,
    2516,
    3094,
    146,
    428,
    571
  ],
  "sentences": [
    "Democrats jumped on news of Hogan's decision on Tuesday, calling it one of a series of humiliating recruitment failures.?\nWhile Senate Democrats are fighting for working families, Republicans are prioritizing the interests of the ultra-wealthy and big corporations that are raising prices on consumers, and potential GOP candidates know this is a contrast that will lead their campaigns to defeat in 2022,? said David Bergstain, communications director at the Democratic Senatorial Campaign Committee.",
    "You're not asked every day that you're walking in the hallway of Dirksen how you feel about what Trump just said or what happened with the RNC.?\nYou get freedom and you're probably asked more about the state budget or COVID protocols in your state,? the strategist said.",
    "The fact that Democrats were worried about a race in Maryland says everything you need to know about their chances of holding the Senate this cycle.?\nRepublicans also argue that the GOP governors' decisions is not necessarily indicative of a larger recruiting problem.",
    "Doug Ducey (R) has maintained that he is 100% focused on my day job.?\nThe decisions have left Republicans with lesser-known GOP candidates running for the upper chamber in states where popular governors could be assets in the fight to take back control of the Senate.",
    "Past records, past history, past biases.?\nAs long as they have resources  and I think there's a lot of resources to be had, as we're seeing in the fundraising game, you can see it at the party levels  I'm super optimistic about it,? the strategist said.",
    "Republicans point to the job differences between executives and legislators, arguing that being at the helm of a state's executive branch could be seen as more appealing than heading to Washington to legislate during a period of extreme polarization.",
    "Though GOP leaders like McConnell and National Republican Senatorial Campaign Committee Chair Rick Scott (R-Fla.) have attempted in earnest to recruit a number of governors to run this cycle, an NRSC source brushed off the attack from Democrats.",
    "Republicans looking to recruit high-profile, establishment governors to run for Democratic-held Senate seats have suffered a string of disappointments in recent months as the midterm primary season approaches.",
    "and Adam Kinzinger (R-Ill.) for serving on the House panel investigating the Jan. 6, 2021, attack on the Capitol is just the latest sign Trump still holds a considerable amount of influence within the party.",
    "President Biden's approval ratings remain low while inflation and rising costs continue to hit Americans hard, factors that Republicans continue to highlight in their pitches to voters.",
    "Legislators vote on things.?\nWhen I've talked to people who made that transition, they missed the job that they had while they were in charge of doing things,? Heye said.",
    "Republicans also point to former President Trump's role and the influence he still holds within the party as factors that could impact GOP governors mulling Senate bids.",
    "\"I'd rather push myself 120 miles an hour delivering wins for New Hampshire than to slow down, end up on Capitol Hill debating partisan politics without results.",
    "Still, it will be an uphill climb against a figure like Hassan, who formerly served as governor and has had a recent series of impressive fundraising hauls.",
    "David Perdue (R) and Kelly Loeffler met with Senate Minority Leader Mitch McConnell (R-Ky.), but ultimately did not seek Senate bids for 2022.",
    "Trump has also pressured Arizona Attorney General Mark Brnovich (R), who's running in the state's crowded GOP Senate primary, over the issue.",
    "New Hampshire state Senate President Chuck Morse (R) announced last month he would challenge incumbent Sen. Maggie Hassan (D-N.H.).",
    "Name ID is never traditionally a bad thing, but there's also negatives that can come with it,? the Republican strategist said.",
    "Democrats have also pointed to Senate races in Georgia and Nevada as examples of a broader recruiting issue within the party.",
    "Ducey has been at the receiving end of the former president's attacks for not going along with his election fraud claims.",
    "You're kind of the master of your domain, so to speak.?\nBut not every governor has been able to escape Trump's wrath.",
    "In a state like New Hampshire, where retail politics are key, figures like Morse are known commodities among voters.",
    "Sununu voiced a similar sentiment last year when he announced he would not be seeking a run for the upper chamber.",
    "Republicans are also pointing to the national environment as an indicator that they have the wind at their backs.",
    "Larry Hogan (R) became the latest GOP governor to announce he would not pursue a run for Senate in November.",
    "When you have a 50-seat majority,? Heye said, it won't take much for Republicans to take back the Senate.?",
    "In other states, like New Hampshire, Republicans have yet to recruit a major GOP figure to run for Senate.",
    "Chris Sununu (R) announced he would instead run for reelection, a much safer option in the Granite State.",
    "The job of being a governor and the job of being a legislator are vastly different things,? Heye said.",
    "Democrats are losing all across the country and are running away from the head of their own party.",
    "Sandoval's former Attorney General Adam Laxalt (R) is seen as the frontrunner in that GOP primary.",
    "As a governor you get more Trump insulation,? one Republican strategist told The Hill.",
    "Phil Scott (R) said he will not run to replace retiring Sen. Patrick Leahy (D-Vt.).",
    "The Republican National Committee's move to censure Reps. Liz Cheney (R-Wyo.)",
    "That's why I am going to run for a fourth term,\" Sununu said in November.",
    "Gen. Don Bolduc (R) are also among the Republicans running in the field.",
    "Brian Sandoval (R) was floated by some as a potential Senate candidate.",
    "I certainly didn't,? said Doug Heye, a Republican strategist.",
    "Did anyone really think Hogan was going to run for Senate?",
    "Londonderry, N.H., town manager Kevin Smith and Ret.",
    "Their agenda is toxic,? the source told The Hill.",
    "In neighboring Vermont, Gov.",
    "Last year New Hampshire Gov.",
    "Meanwhile, in Arizona, Gov.",
    "On Tuesday, Maryland Gov.",
    "In Georgia, former Sens.",
    "In Nevada, former Gov.",
    "Governors do things."
  ]
}