{
  "id": 541,
  "mediaId": 223,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "Some Laughably Irrelevant Figures Are Trying to Insert Themselves into the Liz Cheney Censure Conversation",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/209/4ff4036f-d297-4b88-83e4-7c7d7f83f66c.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/02/09/some-laughably-irrelevant-figures-are-trying-to-insert-themselves-into-the-liz-cheney-censure-conversation-n2603096",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    1854,
    1854,
    1765,
    1765,
    1685,
    1685,
    2214,
    2214,
    753,
    753,
    1147,
    1147,
    1248,
    1335,
    1335,
    1248,
    571,
    571,
    427,
    427
  ],
  "sentences": [
    "Hageman has performed well in the straw polls, however, and another report from The New York Times, this one from Reid J. Epstein, published on Wednesday, makes a curious point in that Cheney has \"become strangely invisible in her home state\" and that her votes on impeachment and taking part in the January 6 select committee \"have forced her into a kind of exile from Wyoming's Republican Party apparatus.\"",
    "Source: Jim Lo Scalzo/Pool via AP\nThe censure of Reps. Liz Cheney (R-WY) and Adam Kinzinger (R-IL), two particularly fierce Trump critics, by the RNC, has caused something of a stir and often a misinformed and distorted one at that, as RNC Chairwoman Ronna McDaniel went into detail about in a column published with Townhall on Tuesday.",
    "Cheney, however, is facing a primary challenger, Harriet Hageman, who was endorsed by former President Donald Trump last September and who may have an easier time getting financial backing thanks to a rule change.",
    "\"Traditionally, the view of the national party committees is that we support all members of our party, regardless of their positions on some issues,\" McConnell said about the censure.",
    "It was a violent insurrection for the purpose of trying to prevent the peaceful transfer of power after a legitimately certified election, from one administration to the next.",
    "Such condemnation from McDaniel and other Republicans is due to Cheney and Kinzinger's positioning on the January 6 select committee, where Cheney serves as vice-chair.",
    "The Senate has already completed one investigation into January 6th, and there are multiple ongoing active law enforcement investigations into what happened that day.",
    "McDaniel also stresses throughout the piece that she personally and the RNC have condemned the violence that take place during the Capitol riot on January 6, 2021.",
    "The RNC supporting such a rule change is keeping in line with the Wyoming Republican Party, and thus supporting the will of the Republican voters in that state.",
    "A New York Times report by Jonathan Weisman and Annie Karni highlighted Senate Minority Leader Mitch McConnell's (R-KY) remarks on Tuesday about the censure.",
    "As McDaniel mentioned in part:\nLiz Cheney and Adam Kinzinger are cheapening the events of January 6th by participating in Nancy Pelosi's partisan committee.",
    "\"Frank Eathorne and the other leaders in the Wyoming GOP apparently believe they have the power to anoint our nominee before a single vote has been cast.",
    "In addition to the media weighing quite possibly in a way that distorts more so than it reports, irrelevant elected officials have also weighed in.",
    "\"The issue is whether or not the RNC should be sort of singling out members of our party who may have different views of the majority.",
    "The rules change could truly make a difference, especially since Hageman is lagging far behind in Cheney when it comes to fundraising.",
    "Kinzinger is retiring from Congress, due to his seat being affected by partisan redistricting efforts from Illinois state lawmakers.",
    "Perhaps the most irrelevant opinion of all, though, comes from Rep. Jamie Raskin (D-MD), who is also on the January 6 subcommittee.",
    "These two have permitted their party affiliation to be weaponized to allow the Democrats gross overreach and abuse of power.",
    "With regards to the reaction to the rules change on funding, Emily Brooks covered that further for The Washington Examiner.",
    "I firmly believe we are the big tent party, and that disagreement amongst Republicans is welcome and can make us stronger.",
    "While Cheney and Kinzinger were censured resoundingly, Democrats and the media love to focus on a so-called \"civil war.\"",
    "In short, they never should have agreed to be part of a committee where Republicans were denied representation.",
    "But what Cheney and Kinzinger are engaged in goes much further than any policy disagreement.",
    "The Townhall column earned considerable media attention, including from the DNC War Room.",
    "Speaking of Trump and Wyoming voters, Trump won the state in 2020 by 69.5 percent.",
    "\"They just skipped over that whole election phase,\" Raskin claimed last Friday.",
    "That's what it was,\" McConnell said after the Senate Republican's weekly lunch.",
    "\"The cult of Trump is turning them into a party of political dictatorship.",
    "This includes Senators, those not from Wyoming, and even Democrats.",
    "She included s statement from Cheney spokesperson Jeremy Adler.",
    "He is neither a Republican nor does he have ties to Wyoming.",
    "The voters of Wyoming will have something to say about it.\"",
    "They're totally trying to squeeze the voters out.",
    "These are the correct avenues for investigation.",
    "That's who should matter in that case, right?",
    "The right of the people to vote is sacred.",
    "Eathorne is the Wyoming GOP Chairman.",
    "This is un-American,\" Adler claimed.",
    "That's not the job of the RNC.\"",
    "If only it were so.",
    "\"We saw it happen."
  ]
}