{
  "id": 544,
  "mediaId": 124,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "Pelosi rips McCarthy for walking away, declining to comment on RNC censure resolution",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220209-nancy-pelosi-se-1153a-f10fcb.jpg",
  "link": "https://www.nbcnews.com/politics/congress/pelosi-rips-mccarthy-walking-away-declining-comment-rnc-censure-resolu-rcna15543",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    732,
    1248,
    1335,
    1399,
    1609,
    1765,
    2214,
    3094,
    427,
    428,
    2959
  ],
  "sentences": [
    "McCarthy: Rioters on Jan. 6 were not participating in 'legitimate political discourse'\nFeb. 9, 202203:23\nA video clip shared on Twitter Wednesday by an ABC News reporter showed her trying to ask McCarthy about the resolution as he quickly walked away and told her to make an appointment with his office.",
    "WASHINGTON  House Speaker Nancy Pelosi, D-Calif., said Wednesday that it was \"disturbing\" to see video of House Minority Leader Kevin McCarthy, R-Calif., walking away from the press when asked about the Republican National Committee's resolution censuring GOP Reps. Liz Cheney and Adam Kinzinger.",
    "\"It's disturbing to see that the Republican leader of the House ran  actually, literally refused to condemn that resolution of legitimate political [discourse]  literally ran away from the press when he was asked about his position,\" Pelosi said.",
    "McCarthy suggested \"legitimate discourse\" referred to alternate electors that the House select committee investigating the Jan. 6 riot at the U.S. Capitol has subpoenaed, even though he said they were in Florida during the riot.",
    "Asked if he agreed with the decision to censure Cheney, of Wyoming, and Kinzinger, of Illinois, the lone Republican lawmakers on the Jan. 6 panel, McCarthy said: \"I think there's a reason why Adam is not running again.",
    "McCarthy's remarks come a day after Senate Minority Leader Mitch McConnell, R-Ky., said that Jan. 6 was a \"violent insurrection\" and that he opposed the RNC's censure of the two GOP lawmakers.",
    "In response to McCarthy's suggestion that Cheney isn't planning to run for re-election, her spokesman Jeremy Adler said: \"As everyone knows, truth has never been his strong suit.\"",
    "While Kinzinger has said he's retiring from Congress, Cheney is, in fact, running for re-election this year and has outraised her chief primary opponent so far in the 2022 cycle.",
    "\"It was a violent insurrection for the purpose of trying to prevent the peaceful transfer of power after a legitimately certified election, from one administration to the next.",
    "Pelosi said at her weekly press conference on Capitol Hill that the Republican Party has been \"hijacked\" and has advised its members to take back their party from \"this cult.\"",
    "\"They seem to have reached rock bottom with their statement that what happened on Jan. 6 was normal political discourse  legitimate, legitimate political discourse.\"",
    "I think there's a reason why at the end of the day, Liz would have a hard time winning here if she runs, and I don't think she runs.\"",
    "\"I think anybody, we all know this, who entered this building, that rioted, is not legitimate political discourse,\" he said.",
    "McCarthy was asked later Wednesday by NBC News if he agrees with McConnell that Jan. 6 was a violent insurrection.",
    "\"The Republicans seem to be having a limbo contest with themselves to see how low they can go,\" Pelosi said.",
    "NBC News' Garrett Haake pressed McCarthy about the RNC's censure measure on Wednesday.",
    "Pelosi added, \"Republicans can run, but they cannot hide from what happened on Jan.",
    "\"But I don't think that's what the RNC was talking about when you talk to them.\"",
    "\"Anyone who broke into this building, I mean, no one would disagree with that.",
    "But what I think what I think you're interpreting is something much different.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "We saw what happened,\" said McConnell at his weekly press conference.",
    "The Wyoming primary will be held in August.",
    "The RNC was not referring to that.\"",
    "\"Yeah, I agree,\" McCarthy said.",
    "That's what it was.\"",
    "We all were here.",
    "6.\""
  ]
}