{
  "id": 546,
  "mediaId": 238,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "The Trailer: Coming soon to a Democratic primary fight: Israel",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/02/08/trailer-coming-soon-democratic-primary-fight-israel/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    911,
    1846,
    2224,
    3085,
    3094,
    144,
    146,
    150,
    254,
    378,
    2721,
    2918
  ],
  "sentences": [
    "I mean, this is just the ultimate example of cutting off your nose to spite your face.?\nBy going at all, Bowman had violated one of DSA's conditions for endorsements; he avoided being expelled from the organization only after conversations with members that left some critics unhappy but the organization unwilling to reject one of its very few members of Congress.",
    "Supreme Court conservatives tossed that decision on the grounds that there was not enough time to make Alabama's legislature close the doors and draw yet another map, with Justice Brett M. Kavanaugh citing the Purcell principle? to argue that the election was close at hand,? and the courts should not be second-guessing the work of elected officials.",
    "Eleven months ago, 314 Action's executive director Joshua Morrow told Roll Call that those races were the group's top priority.? Not long after that, 314 Action released polling that found Amy Acton, who directed Ohio's pandemic response, leading if she ran for Senate, and it endorsed Arkoosh when she entered the Senate race.",
    "The point was supposed to be condemning Cheney and Kinzinger for joining the Jan. 6 commission, which meant, according to the resolution, advancing a political agenda to buoy the Democrat Party's bleak prospects in the upcoming midterm elections.? The RNC didn't condemn rioting, or even the 2021 impeachment of Donald Trump.",
    "is retiring, the candidates for the now-safe seat include state Sen. Erin Houchin, who narrowly lost a 2016 primary to Hollingsworth, and former congressman Mike Sodrel, who briefly represented the district when it was a swing seat  before Democrats' steep post-2014 decline with working-class White voters in the Midwest.",
    "The precise wording of the RNC's resolution included a line that some members were surprised by, saying that Cheney and Kinzinger had engaged in Democrat-led persecution of ordinary citizens engaged in legitimate political discourse.? The party didn't release the resolution to the public or upload it to its website.",
    "Several endorsements put them up against candidates backed by Democratic Socialists of America, which since 2017 has endorsed the global boycott, divestment and sanctions movement, or BDS  an effort to change Israel's internal policies toward Palestinians modeled after anti-apartheid campaigns against South Africa.",
    "Chehade and Newman co-signed a document the day after Christmas, offering him a job as a foreign policy adviser if she won in 2020; Chehade sued after Newman didn't hire him; a conservative watchdog group filed an ethics complaint; Newman, who'd hired Chehade once the lawsuit was dropped, said she'd be exonerated.",
    "On Saturday morning, a measure to formally censure Liz Cheney and Adam Kinzinger and no longer support them as members of the Republican Party? was finally introduced at the RNC's winter meeting, alongside resolutions to hold Communist China accountable? for the covid-19 pandemic and to oppose noncitizen voting.",
    "The American people deserve better because we know  we all know this  that if we have a free and fair forum, we win.?\nTeam PAC, Mao Money.? Illinois-based Republican donor Richard Uihlein stood up this super PAC to help ex-Missouri governor Eric Greitens in the GOP's very crowded U.S. Senate primary there.",
    "On Sunday, the Austin chapter of DSA announced that it would no longer be working to elect Casar, and that the candidate's campaign team had rescinded their request for endorsement.? That raised the visibility of state Rep. Eddie Rodriguez, who'd trailed Casar in fundraising and endorsements.",
    "It is exactly what our enemies want.?\nIn Texas, where Austin city councilman Greg Casar swept up DSA and other endorsements in his run for a new, safely Democratic House seat, the BDS issue erupted again after Jewish Insider published a letter Casar had written to a rabbi in the district.",
    "In New York, Rep. Jamaal Bowman (D-N.Y.) crossed DSA, which had endorsed and canvassed for his 2020 campaign, by voting for the Iron Dome funding and joining a trip to Israel sponsored by J Street, which favors conditioning aid to Israel on human rights standards but does not support BDS.",
    "Casten, a two-term Democrat from another part of the Chicago suburbs, is endorsed by the Democratic Majority for Israel and other groups that want to defeat candidates who, like Newman, have broken with the party's position on Israel to oppose military aid or criticize the Jewish state.",
    "The problem, he explained, was Cheney and Kinzinger joining a committee that was investigating nonviolent challenges to the 2020 election; some RNC members were among the people summoned to testify before the committee for claiming to be the legitimate electors in states Trump lost.",
    "The New York Times reporter, the future author of Insurgency,? remembers reporting a story about the millionaire's tax? and deciding that one of the richest men in New York? might give a good quote to supplement what he'd gotten from talking to customers at Bergdorf Goodman.",
    "Like a number of recent ads hitting candidates for China connections, it highlights decisions by competitor and Attorney General Eric Schmitt (R) that weren't terribly controversial when he made them, like supporting a hub for China Eastern airline deliveries into Missouri.",
    "At the start of Friday's meeting, McDaniel thanked the party's presidential debate committee for withdrawing from the Commission on Presidential Debates, saying that it was standing up for 74 million Americans? by cutting the 35-year-old bipartisan group out of the process.",
    "It is beyond ludicrous for people who are trying to promote the rights and well-being of Palestinians to object to a trip that is designed to help expose members of Congress to the needs of the Palestinian people,? J Street president Jeremy Ben-Ami said in an interview.",
    "The Supreme Court's conservative majority turned back a challenge to Alabama's new congressional maps, with five justices allowing this year's elections to be held on new lines that maintain the GOP's 6-to-1 advantage by creating just one, safe, majority-Black district.",
    "Expelling Bowman would mean handing the perfect tool to the establishment to stoke divisions within the Palestinian territories solidarity movement, the left and the working class, and play into the strategy of divide and conquer,? DSA said in a statement in December.",
    "Eddie has always been a staunch supporter of Israel and believes that vitriol in the BDS movement is dangerous, particularly in light of the recent surge of antisemitic attacks in Texas and across the country,? said Rodriguez's campaign manager, Caitlin Johnson.",
    "To suggest that a violent attack on the seat of democracy is legitimate political discourse is so far from accurate,? said Sen. Mitt Romney (R-Utah), that it would make people wonder what we're thinking.? The RNC, by its explanation, hadn't endorsed the attack.",
    "But the ongoing investigation into whether Newman gave a job to a potential rival has damaged Newman ahead of a June primary with Rep. Sean Casten (D-Ill.)  and her vote against funding for Israel's Iron Dome missile defense had already set up a brutal primary.",
    "Supporters of Israel have stepped up their investments, with the pro-Israel lobbying powerhouse AIPAC launching a super PAC to spend more this cycle; Israel's critics inside the Democratic Party are on the defensive, and sometimes fighting among themselves.",
    "The Purcell Principle grew out of a 2006 case where the 9th Circuit Court of Appeals  then and now, one of the more left-leaning federal courts  blocked a voter ID law from going into effect weeks before that year's midterm election in Arizona.",
    "*Reporters for The Post won the 2018 Pulitzer Prize for stories that investigated whether Moore, then in his 30s, pursued relationships with teenage women, and for a story exposing an attempt to discredit the newspaper by creating fake sources.",
    "Republicans may compete for a district they've been letting Democrats roam free in  the 1st Congressional District in northwest Indiana, which backed Barack Obama by 24 points in 2012 and backed Joe Biden by the high single digits in 2020.",
    "DMFI and other PACs would go on to pour money into the race, helping Brown prevail, with Turner later telling the Intercept that a wealthy donor had urged her to denounce some left-wing members of the House to avoid a backlash over Israel.",
    "Three words drowned that out: legitimate political discourse.? It was clear to Republicans in Salt Lake City, who'd sat through a closed-door debate on the resolution, that this was not about the Jan. 6 insurrection at the Capitol.",
    "Friends like Eric Schmitt.?\nJudicial Crisis Network, Huge Payback.? The conservative JCN, which does not disclose its donors, has spent tens of millions of dollars to oppose Democratic judicial nominees and support Republican ones.",
    "One of the first signs that this could happen was like [Sean] Hannity being cowed by [Breitbart reporter] Matt Boyle, of all people, into basically reversing this little ultimatum that he had given Roy Moore to quit the race.",
    "In 2011, Republicans approved a map that shored up the state's Republican delegation and pulled together Black communities in Birmingham, Montgomery and rural areas into a seat Rep. Terri A. Sewell (D-Ala.) would win easily.",
    "If she's the nominee, there's no question this seat flips blue next year  because as 2020 showed us, voters trust and want to vote for candidates with science backgrounds.?\nActon never ran, and Arkoosh never got traction.",
    "She'll fight for Tennessee,? says a narrator in her launch video, which also uses footage from her guest stint on The View,? where she confronted Rep. Adam B. Schiff (D-Calif.) over investigations into the ex-president.",
    "Nearly all of those ads framed court battles as nonideological debates about the best-qualified judge  and the very flexible principle of whether it's acceptable to confirm a Supreme Court justice in an election year.",
    "Larry Hogan (R) closed the door on a 2022 U.S. Senate bid, ending months of encouragement from fellow Republicans who saw the popular, term-limited Hogan as their best candidate against Sen. Chris Van Hollen (D-Md.).",
    "It was clear that he had very specific knowledge around Palestine and Israel that I needed,? Newman told investigators last year, according to a transcript published by the Office of Congressional Ethics last month.",
    "A decade and a presidency later, Peters published Insurgency,? which traces the transformation of the GOP from John McCain selecting Sarah Palin as his running mate to Trump picking out drapes for the Oval Office.",
    "Arkoosh was endorsed early on by 314 Action, a group founded in 2016 to elect candidates with STEM backgrounds  and one that targeted both the Pennsylvania race and Ohio's U.S. Senate race when this cycle began.",
    "Black Democrats had hoped that a favorable ruling would strengthen their position when other Southern states, like Louisiana, produced new maps with no competitive seats and just one with Black supermajorities.",
    "That wasn't necessary for it to fulfill its purpose: To join the Wyoming GOP in designating Harriet Hageman, who is challenging Cheney in the August primary, as a Republican candidate entitled to party support.",
    "Whether she got to her current positions through careful thought or bribery, I don't know.? Chehade remains a paid adviser to Newman, and is running for Congress himself in the new 3rd Congressional District.",
    "And I think when the dust settled, they realized the power of an us versus them? campaign, where somebody as radical as Roy Moore can appeal to voters because he is not like them,? he's got the right enemies.",
    "Val became one of the Commonwealth's leaders on the pandemic response, and her science-first, evidence-based approach to policymaking saved lives,? 314 Action president Shaughnessy Naughton said last summer.",
    "Groups like AIPAC, the Democratic Majority for Israel, all these apartheid advocates, are nervous,? said Beth Miller, the senior vice president for governmental affairs at the pro-BDS Jewish Voice for Peace.",
    "In this edition: How Israel and BDS could shape Democratic primaries, how a few words in Salt Lake City created a Republican problem, and a brand-new reason that liberals are angry with the Supreme Court.",
    "But Jones didn't break his own news; the switch was first tweeted by Bernard Kerik, a former New York police commissioner and felon who was involved in efforts to overturn Trump's 2020 defeat in Georgia.",
    "Its first ad on the court's new vacancy suggests that Arabella Advisors, a 17-year-old donor pass-through firm that advises Democratic donors on where to give, is controlling the pick behind the scenes.",
    "Alabama's primary is in May, candidate filing doesn't end until March 3, and other courts have gone so far as to delay primaries if there were questions being litigated about the new, post-census lines.",
    "I believe that strong conservative voices need to be heard as we lead America into the future,? Jones said in a statement, joining Donald Trump in endorsing former senator David Perdue for governor.",
    "TT: A big theme in the book is Republican Party figures opening the door for forces and people they don't understand  thinking at the outset that they could channel the energy but stay in power.",
    "Before the investigation began, she admitted that she did not understand the Palestine-Israel issue very well? before her second campaign in a district with a significant Palestinian population.",
    "The party had laid the groundwork for that exit for months, and was making it official by preventing any candidate who appeared in a CPD debate from appearing in any forums approved by the RNC.",
    "Pennsylvania Democrat Val Arkoosh ended her campaign for U.S. Senate on Friday, less than a week after a meeting in Harrisburg where the suburban Democrat placed fourth out of four candidates.",
    "Just two House Democrats, Rep. Rashida Tlaib (D-Mich.) and Rep. Ilhan Omar (D-Minn.), have voiced support for BDS  and both survived primary challenges in 2020, while Rep. Cori Bush (D-Mo.)",
    "And they are.?\nNewman has never endorsed BDS, which has faced sanctions of its own in most states; in them, companies that do business with the state are prohibited from boycotting Israel.",
    "Republicans' victory in Alabama didn't change the math of this year's redistricting changes; Democrats had one safe seat before the court's decision, and have one safe seat on the new map.",
    "The funneling of more than $1 million through the firm into 2020 PACs and outside groups is retold here as a plan to make sure an Arabella judge? and Biden rubber stamp? joins the court.",
    "Val Arkoosh and Amy Acton are two incredible policy leaders in STEM, and we will be eager to support both in the future.?\nJeremy Peters didn't expect to get Trump on the line so quickly.",
    "But it was at least endorsing the idea that nonviolent attempts to overturn the election, like posing as fake electors in the hopes of replacing the duly elected ones, were legitimate.",
    "N2America, a conservative group, was buying ads that went after hypocritical politicians? for favoring mask mandates in schools while occasionally taking their own masks off indoors.",
    "Former state legislator Vernon Jones, a Democrat-turned-Republican, abandoned his campaign for governor Monday and launched a bid for the new, safely GOP 10th Congressional District.",
    "Mellman's group announced its first group of endorsed candidates last month, including Casten and a number of other Democrats who'll face candidates who are more critical of Israel.",
    "While Arkoosh was finalizing her exit, Georgia Democrat Stacey Abrams was under fire, from Republicans, for taking a mask-free photograph with mask-wearing children in a classroom.",
    "Chief Justice John G. Roberts Jr. voted with the court's three liberals Monday, siding with a lower court panel  composed mostly of Trump-appointed judges  that threw out the map.",
    "Laura Kelly's (D) veto of a new map that would carve up the Democratic-trending 3rd Congressional District, making it harder for Rep. Sharice Davids (D-Kan.) to win reelection.",
    "At early forums, and in a questionnaire, Democrats Nina Turner and Shontel Brown diverged on a few Israel questions  not BDS, which both opposed, but conditions on foreign aid.",
    "and Rep. Adam Kinzinger (R-Ill.) over their membership on the Jan. 6 commission was watered down before it reached the full Republican National Committee at its meeting here.",
    "That eliminated the only Democratic candidate from Philadelphia's suburbs from the now three-way race; state Rep. Malcolm Kenyatta is from the city itself, while Lt. Gov.",
    "We as a party should be against rioting, should be against looting, should be against political violence,? said Caleb Heimlich, the chair of the Washington state GOP.",
    "Brown opposed conditions, and Turner didn't; Brown's response to a 2021 conflict between Israel and Hamas more clearly took Israel's side than Turner's response did.",
    "In a video announcement, the Montgomery County commissioner explained that the best way? for her party to win the open seat in November was for her to back out.",
    "In like a lot of ways, he ended up being this perfect figure for somebody who knew how to like, harness and manipulate all that energy around people like Palin.",
    "But it was also a blow to a particular 2022 project: electing Democratic scientists who were strongly identified with fighting the pandemic in 2020 and 2021.",
    "My current job as governor runs until January 2023, and then we'll take a look and see what the future holds after that,? Hogan said in a statement Tuesday.",
    "The morning after, I interviewed him about what just happened and he and the other Moore supporters were pretty shellshocked because they didn't expect it.",
    "One of the most surprising moments in my reporting was how the Bush campaign in 1992 made the same mistake that McCain would make a generation later.",
    "Josh Green, a doctor who became the public face of his state's covid-19 response, continues to lead in Democratic primary and general election polls.",
    "314 Action is currently working with its largest and most diverse class of STEM candidates in the organization's history,? Morrow told the Trailer.",
    "But the Republican Party might have more to gain when the court rules on the merits of the lawsuit and the enforceability of the Voting Rights Act.",
    "The lower court's decision gave the plaintiffs, which included the Democratic leadership in Montgomery, some hope that the map would be redrawn.",
    "At the time, it was covered as a big humiliation for Steve Bannon, challenging his credibility with the movement, turning him into an outsider.",
    " seven days until school board recall elections in San Francisco  21 days until the first 2022 primaries  273 days until the midterm elections",
    "He called Trump's office, his mother interrupted him with a surprise call, and when he switched lines, Trump told him to call his mother back.",
    "She's worse than we thought, let's put it that way,? Mark Mellman, the Democratic pollster who founded DMFI three years ago, said of Newman.",
    "But pro-Israel Democrats see things moving their way, especially after last year's special election in Ohio's 11th Congressional District.",
    "The trouble began, according to Rep. Marie Newman (D-Ill.), because she wanted to know more about Israel and the Palestinian territories.",
    "Nine Republicans filed to run, including Blair Milo, the former mayor of LaPorte, who announced her bid a few weeks before the deadline.",
    "According to Section 2 of the Voting Rights Act, a three-judge panel must determine whether a map discriminates against minority voters.",
    "Jeremy Peters: I decided that I was not going to engage him or ask him anything about the 2020 election because I don't need to hear it.",
    "Former State Department spokeswoman Morgan Ortagus entered the race for the new 5th Congressional District on Monday, hours after Gov.",
    "Now they have to lawyer up because this committee is going after them.?\nThe nuances were lost in the room, and vanished outside of it.",
    "We had looked for Palestinian advisers and we could never find one.?\nWhat happened next was the reason for that ethics investigation.",
    "But four state senators voted with Democrats to uphold the veto  and then, on Tuesday, Republicans wrangled the votes to override it.",
    "Bill Lee (R) signed off on maps that transformed the traditionally Democratic seat into one that Donald Trump carried easily.",
    "But I got pretty interesting answers, like what he said to Rush Limbaugh when he visited him during the 2016-2017 transition.",
    "It's more focused on conservative media and the GOP's consulting class than most books in the ever-expanding Trump library.",
    "Pro-Israel Democrats want to stop any of the critics' momentum, and roll it back  and the year so far has encouraged them.",
    "The councilman had promised to support the continued federal aid for self defense of Israel,? a position at odds with BDS.",
    "The censure resolution was one of several steps Republicans took to align themselves with Trump's view of the 2020 race.",
    "Three Democrats filed, too, though the national party stopped competing for the seat after a lopsided 2018 defeat there.",
    "They're always messing with you and they will always hate you.? And that was like the governing ethos of his presidency.",
    "So, obviously, Fox paid the price for crossing their audience after 2020, reporting that Joe Biden had won the election.",
    "But last year's vision of trust-the-science candidates storming ahead in swing state Senate races faded away this week.",
    "This is the first time AIPAC has felt the need to launch a super PAC, because they feel like they're losing their grip.",
    "Trump is changed by the conservative outrage engine, and then he flattens the Republican Party's resistance to it.",
    "Campaigns against pandemic restrictions have molded the Republican primaries in both states, and everywhere else.",
    "We were going to have dinner, as part of that process, and he said: I'm going to bring my friend Steve to dinner.",
    "You had the Bezos Washington Post.?* It had commissioned this hit piece.? And their people didn't believe it.",
    "JP: It's a good question, because you're right  the idea is always that they can keep them in the back seat.",
    "Jeremy Peters: I was doing a profile of Andrew Breitbart as this kind of new, right-wing, media phenomenon.",
    "Kansas Republicans won a legislative supermajority in the 2020 election, enough, on paper, to nix any veto.",
    "Newman quickly became one of the most visible advocates for Palestinians after joining the House last year.",
    "Republicans haven't come close to winning one of Maryland's Senate seats since 2006, when then-Lt. Gov.",
    "A number of STEM candidates are still running, with a focus on their pandemic record; Hawaii Lt. Gov.",
    "Bush gives Pat Buchanan a prime-time address, and he went off like a flame thrower at the convention.",
    "And Buchanan loved every moment of it and didn't care that he was being called a crazy right-winger.",
    "I wouldn't sell my soul,? said Turner, who announced last month that she'll run again for the seat.",
    "Newman's campaign has characterized the ethics investigation, and its implications, as a smear.",
    "What's something you reported in real time that didn't become significant until much later?",
    "It was one of the most memorable speeches given at a political convention in modern times.",
    "They had debates begin after 26 states had already started voting,? McDaniel said in Utah.",
    "It was May 2018, a few weeks after she had narrowly lost a Democratic primary in Illinois.",
    "Iymen Chehade, a Palestinian American professor at Columbia College, wanted a meeting.",
    "It's wrong, it's misleading and it's a waste of my time  and a waste of readers' time.",
    "Was there a moment, based on your reporting, where they could have slammed the door?",
    "TT: What impact did the 2017 U.S. Senate race in Alabama have on the MAGA movement?",
    "He thought that she could primary John McCain and win that Senate seat in Arizona.",
    "At the same time, the politics of the pandemic response grew far more complicated.",
    "Peters talked to The Trailer about the book last week, shortly before its release.",
    "It didn't work then, but they had all the enemies lined up in the right places.",
    "Filing for the 2022 midterms closed on Friday, with no last-minute surprises.",
    "Jeremy Peters: I was with him [Bannon] during that race, on election night.",
    "And I always thought that some of his political fascinations were quixotic.",
    "And five years later, he's still here, he's pardoned, he's very relevant.",
    "In the 9th Congressional District, where Rep. Trey Hollingsworth (R-Ind.)",
    "John Fetterman and Rep. Conor Lamb come from the outskirts of Pittsburgh.",
    "I thought he was this kind of hanger-on, but I stayed in touch with him.",
    "Ultimately, what they realized was that this playbook has real power.",
    "On the same day, in Kansas, Republicans failed to override Gov.",
    "The Trailer: You've been on the conservative beat for a while.",
    "Okay.? One overwhelming aye? later, the resolution was passed.",
    "Hearing no further discussion ? said RNC chair Ronna McDaniel.",
    "This is a lightly edited transcript of the conversation.",
    "It's not like it was this blowout defeat for Roy Moore.",
    "He thought Sarah Palin could be president someday.",
    "The resolution to punish Rep. Liz Cheney (R-Wyo.)",
    "The judges reviewing this map found that it did.",
    "How did China get so powerful?? a narrator asks.",
    "Ultimately, they realized that they almost won.",
    "It was like: Oh, this is just more fake news.",
    "It completely stole the show from George H.W.",
    "Rush says: Don't do deals with the Democrats.",
    "That frustrated the already angry plaintiffs.",
    "The resolution doesn't mention that at all.",
    "unseated an incumbent after endorsing BDS.",
    "She paused for some chatter to wrap up.",
    "And it was like a narrow miss for them.",
    "DMFI, once again, is supporting Brown.",
    "None of this ever really panned out.",
    "They're trying to take our guy out.",
    "His friend Steve was Steve Bannon.",
    "Trump has not endorsed Jones, yet.",
    "Michael Steele lost by 11 points.",
    "She fought for President Trump.",
    "I know what he's going to say.",
    "Is there any discussion?",
    "Just run hard right.",
    "But what was in it?",
    "Two-term Gov.",
    "She took it.",
    "Tennessee.",
    "Maryland.",
    "Indiana.",
    "Georgia."
  ]
}