{
  "id": 547,
  "mediaId": 195,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "Trump tightens grip on RNC",
  "image": "https://cdn.jwplayer.com/v2/media/Tb6IJQOY/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/593402-trump-tightens-grip-on-rnc",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1147,
    1248,
    1434,
    1464,
    1685,
    2087,
    2214,
    3094,
    427,
    428
  ],
  "sentences": [
    "A group of 140 Republican leaders and former elected officials also released a joint statement on Monday condemning the censure resolution as a sign that the party had betrayed the GOP's founding principles and ceded control of a once-great movement to grifters and extremists.?\nAmong the signatories were several prominent Republicans, including former White House Director of Strategic Communications Alyssa Farah and former RNC Chairman Michael Steele.",
    "Now, some Republicans fear the former president's influence within the RNC could hamper efforts to recapture Congress in this year's midterm elections and take back the White House in 2024.\nIf Republicans want to have a strong election showing, they need to keep the focus on an unpopular president with an unpopular agenda,? said Doug Heye, a Republican strategist who served as the RNC's communications director during the 2010 midterms.",
    "On Tuesday, Senate Minority Leader Mitch McConnell (R-Ky.), who helped shepherd key parts of Trump's agenda through the upper chamber but has also clashed with him at times, pushed back on the censure resolution's characterization of the Jan. 6 riot, calling the attack on the Capitol a violent insurrection.?\nWhile he said he has confidence in McDaniel's leadership, he criticized the RNC for singling out Kinzinger and Cheney.",
    "There's this larger issue of taking your eye off the ball: an unpopular president who people feel is taking the country in the wrong direction.?\nHeye said that during his tenure at the RNC, the committee's worst days were any days that we were the focus of a political news cycle,? because it meant that we weren't able to focus on Democrats that day or that week.?\nAnd that's where the RNC finds itself right now,? he said.",
    "They chose to join Nancy Pelosi in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol.?\nFor some Republicans, however, the censure resolution was only the latest move in what has been a shift that began nearly six years ago when Trump first rose to prominence within the GOP.",
    "And while the GOP has sought to make the midterm elections a referendum on President Biden, economic inflation and a host of other challenges, Republicans also find themselves tethered to Trump, who remains intensely focused on relitigating the 2020 presidential election and its aftermath, including the attack on the Capitol.",
    "Romney said he texted McDaniel after the censure vote, calling the resolution and the language used in it inappropriate.?\nSen. Lindsey Graham (R-S.C.), a staunch Trump ally, told Politico that the GOP is heading in the wrong direction? when it doesn't focus on its goal of recapturing control of Congress.",
    "And so, it's certainly  Ronna Romney McDaniel is carrying water for Donald Trump in this regard.?\nTo be sure, Trump remains the most popular Republican in the country among the party's voters, many of whom have embraced his false claim that the 2020 election was stolen.",
    "The former president has leaned even more heavily into false election claims in recent weeks, repeatedly asserting that former Vice President Mike Pence could have overturned his electoral loss and floating potential pardons for those who stormed the Capitol.",
    "And while McDaniel has said that the RNC will remain neutral in the party's next presidential primary, the committee has repeatedly shown a willingness to back Trump up on everything from his grudge against Cheney and Kinzinger to his ongoing legal issues.",
    "Donald Trump and his allies are strengthening their hold on the Republican National Committee (RNC) amid a growing rift in the party between those who back the former president's election fraud claims and those hoping to move on.",
    "Anytime we're talking about anything other than what Joe Biden and the Democrats are doing, it's a mistake, and the RNC needs to be the unifying force to remind Republicans of that,? said one GOP donor.",
    "History will mark this censure as a turning point for the RNC  a time of choosing between civility and patriotism, on the one hand, and conspiracy and political violence on the other,? the group said.",
    "That's not what they're supposed to be doing.?\nStill, the censure vote underscores just how tightly the RNC has latched onto Trump since he first won the party's presidential nomination in 2016.",
    "Matt Terrill, a Republican strategist and former aide to ex-RNC Chair Reince Priebus, acknowledged that it's unusual how closely the party committee has stuck by Trump in his post-presidency.",
    "In a statement, McDaniel said that the phrase legitimate political discourse? was intended to describe those who protested on Jan. 6 but were not involved in the violence at the Capitol.",
    "Nevertheless, the RNC's censure resolution and its reference to the Jan. 6 riot as legitimate political discourse? sparked a backlash from Republicans across the ideological spectrum.",
    "And while the two political parties have historically selected new chairs after they lose control of the White House, she was reelected last year without facing any opposition.",
    "The committee's chairwoman, Ronna McDaniel  who's the niece of Sen. Mitt Romney (R-Utah), a prominent Trump critic  was handpicked by the former president after his 2016 win.",
    "I think what you're seeing with the RNC is simply a reflection of where the grassroots activists, the primary voters, the base is right now,? Terrill said.",
    "), as well as its description of the events of Jan. 6, 2021, as legitimate political discourse,? sparked criticism from high-ranking members of the party.",
    "But he also noted that the RNC's actions are ultimately a reflection of the former president's sustained popularity among the conservative base.",
    "At the time, many Republicans were reluctant to throw their support behind the bombastic real estate mogul and former reality TV star.",
    "But the vote also exposed the extent to which Trump's most fervent supporters have consolidated power in the party's highest echelon.",
    "We stand firmly for the first set of values.?\nThe criticism also came from the highest echelons of Republican Senate leadership.",
    "The RNC  most of those folks were put into place over the course of the four years by Donald Trump,? former New Jersey Gov.",
    "Republicans need to net just five seats in the House and only one in the Senate this year to regain control of Congress.",
    "The party has changed, and it's changed in just a few short years,? said Heye, the Republican strategist.",
    "An RNC vote last week to censure two GOP Trump critics, Reps. Adam Kinzinger (Ill.) and Liz Cheney (Wyo.",
    "The former president is also widely believed to be eyeing another run for the White House in 2024.",
    "Chris Christie (R), a Trump ally-turned-critic, said on ABC's This Week? on Sunday.",
    "RNC officials sought to clarify the resolution's language after the vote on Friday.",
    "Liz Cheney and Adam Kinzinger crossed a line,? McDaniel said in a statement.",
    "Since then, however, the RNC has marched in lockstep with Trump.",
    "And the actions of the committee certainly reflect that.?",
    "That's not the job of the RNC,? he said.",
    "Censuring members of your own party?"
  ]
}