{
  "id": 549,
  "mediaId": 209,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "10 things you need to know today: February 9, 2022",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1644405180/GettyImages-1369377794.jpg",
  "link": "https://theweek.com/briefing/daily-briefing/1009959/10-things-you-need-to-know-today-february-9-2022",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Harold Maass",
  "authorUrl": "https://theweek.com/authors/harold-maass",
  "termIds": [
    1765,
    1765,
    2214,
    2214,
    2157,
    2157,
    1248,
    1248,
    1573,
    1573,
    1164,
    1164,
    2567,
    2567,
    2661,
    2661,
    2942,
    2942,
    2888,
    2888
  ],
  "sentences": [
    "Russia denies Ukraine deal as Macron continues shuttle diplomacy, McConnell slams the RNC for censuring Cheney and Kinzinger, and more\nMoscow on Tuesday denied reports that Russian President Vladimir Putin and French President Emmanuel Macron had reached a tentative agreement on de-escalating the Ukraine crisis.",
    "Prosecutors said Lichtenstein and Morgan lied to financial institutions and virtual currency exchanges about who they were and how they got their bitcoin, and tried to cover their tracks by laundering the stolen funds \"through a labyrinth of cryptocurrency transactions,\" Deputy Attorney General Lisa Monaco said.",
    "ReutersThe Wall Street Journal\nThe Justice Department announced Tuesday that authorities had arrested a married couple  Ilya Lichtenstein, 34, and Heather Morgan, 31  in connection with the theft of cryptocurrency currently worth $4.5 billion in a 2016 hack of the Bitfinex exchange.",
    "The Washington Post\nCenters for Disease Control and Prevention Director Dr. Rochelle Walensky said in a radio interview Tuesday that the agency has not changed its mask guidelines urging all schools to encourage students to wear well-fitting face coverings indoors.",
    "CNN\nCanadian \"Freedom Convoy\" drivers have spread their protest against COVID-19 restrictions from Ottawa to the U.S. border, where they partially blocked an auto-industry supply-chain lifeline connecting Windsor, Ontario, with Detroit.",
    "Insider\nMinnesota prosecutors on Tuesday charged 17-year-old Mekhi Speed with second-degree murder in the case that police were investigating when they conducted a no-knock raid and fatally shot 22-year-old Amir Locke.",
    "CNNThe Washington Post\nPresident Biden on Tuesday slammed Florida legislation that critics are calling the \"Don't Say Gay\" bill after the state Senate Education Committee advanced the controversial legislation.",
    "The New York Times\nSenate Minority Leader Mitch McConnell (R-Ky.) on Tuesday became the most prominent Republican to criticize the Republican National Committee's decision to censure GOP Reps. Liz Cheney (Wyo.)",
    "The Best Actress nominees were Jessica Chastain (The Eyes of Tammy Faye), Olivia Colman (The Lost Daughter), Penlope Cruz (Parallel Mothers), Nicole Kidman (Being the Ricardos), and Kristen Stewart (Spencer).",
    "The RNC called the committee's investigation \"a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse,\" and accused Cheney and Kinzinger of hurting the House and the GOP.",
    "Her comments came as a growing number of states, from California to Delaware, this week announced they would be dropping indoor mask mandates now that new cases driven by the Omicron variant are falling.",
    "French officials had indicated that Macron left Moscow with the understanding that Russia would not keep troops in Belarus near the Ukrainian border after military exercises end this month.",
    "Locke's death has set off protests and a Monday march on City Hall demanding that Mayor Jacob Frey fire the officer who shot Locke, Mark Hanneman, and interim Police Chief Amelia Huffman.",
    "Lawmakers in Australia said they feared that local Freedom-Convoy-inspired protests that have continued peacefully for eight days in their country's capital, Canberra, could deteriorate.",
    "\"I want every member of the LGBTQI+ community  especially the kids who will be impacted by this hateful bill  to know that you are loved and accepted just as you are,\" Biden tweeted.",
    "Star Tribune\nU.S. household debt rose by $1.02 trillion in 2021, the most since a $1.06 trillion rise in 2007, according to a report released Tuesday by the New York Federal Reserve.",
    "The proposed law would ban discussion of sexual orientation and gender identity in Florida public schools in primary grade levels, or in any manner that is not \"age-appropriate.\"",
    "McConnell disagreed, saying that the Jan. 6 Capitol riot was a \"violent insurrection\" aiming to \"prevent the peaceful transfer of power after a legitimately certified election.\"",
    "\"Right now, we still have about 290,000 cases every single day, and our hospitalization rates now are higher than they even were at the peak of our Delta surge,\" Walensky said.",
    "Ron DeSantis (R) signaled support for the bill, saying it was \"entirely inappropriate\" for teachers to talk about gender identity and sexual orientation in the classroom.",
    "The Hill\nLindsey Jacobellis won the women's snowboard cross event at the Beijing Winter Olympics on Wednesday, giving the United States its first gold medal of the Games.",
    "The other films up for Best Picture were Belfast, CODA, Don't Look Up, Drive My Car, Dune, King Richard, Licorice Pizza, Nightmare Alley, and West Side Story.",
    "Macron said the tension caused by the fear Russia will invade Ukraine is \"unprecedented,\" and won't \"be solved thanks to a few hours of discussions.\"",
    "The statement cast doubt on Macron's diplomatic clout as he moved on to meet with Ukraine's president, Volodymyr Zelensky, in Kyiv on Tuesday.",
    "Jacobellis, 36, is the oldest snowboarder to medal at the Games, and the oldest American woman to win gold in any sport at the Winter Games.",
    "The average U.S. home price jumped by almost 20 percent in 2021, and rising vehicle prices pushed new auto loans to $734 billion, a record.",
    "USA TodayESPN\nThe Power of the Dog led Academy Awards nominations announced Tuesday with 12 nods, including Best Picture and Best Director.",
    "\"Some of these protesters actually want to undermine and overturn democracy,\" Kristina Keneally of the Australian Labor Party said.",
    "Officers were looking for Speed, Locke's cousin, when they rushed into a Minneapolis apartment where Locke was sleeping on a couch.",
    "He also said it wasn't the RNC's job to single out GOP lawmakers for criticism just because they have different views on an issue.",
    "Protesters in idling trucks and other vehicles also blocked traffic early Tuesday at an access point between Alberta and Montana.",
    "\"As car prices have soared, buyers have borrowed more to finance the additional cost,\" researchers wrote in a separate blog post.",
    "The increase came as Americans borrowed more so they could afford homes, cars, and other big purchases as prices soared.",
    "Walensky also said everyone should wear masks in public indoor settings with substantial risk of coronavirus infection.",
    "Kremlin spokesperson Dmitry Peskov said it was the United States, not France, that had the status to work out a deal.",
    "So far, households have managed the extra debt as the economy recovers from the coronavirus crisis, and incomes rise.",
    "Speed was charged with shooting and killing Otis Elder, 38, in what a witness described as a drug deal that went bad.",
    "His fellow nominees in the category were Javier Bardem (Being the Ricardos), Andrew Garfield (Tick, Tick  Boom!",
    "and Adam Kinzinger (Ill.) for working on the House select committee investigating the Jan. 6 Capitol attack.",
    "They were charged with conspiracy to commit money laundering and conspiracy to defraud the United States.",
    "She took silver in 2006 after infamously losing her lead in the final by making a celebratory board-grab.",
    "Benedict Cumberbatch received a Best Actor nomination for his role in the Netflix Western drama.",
    "Jacobellis is competing in her fifth Olympic Games, and this is the second medal of her career.",
    "Law enforcement agencies have seized more than $3.6 billion linked to the crime.",
    "Her gold gave Team USA seven medals in all and raises its ranking to 10th place.",
    "Canadian-bound traffic across the Ambassador Bridge was shut down early Tuesday.",
    "), Will Smith (King Richard), and Denzel Washington (The Tragedy of Macbeth).",
    "An officer fatally shot Locke when he grabbed a handgun, police said.",
    "Frey has suspended the use of no-knock warrants in the city.",
    "1 Norway has four golds among nine medals.",
    "The Hollywood ReporterThe Washington Post",
    "Limited U.S.-bound traffic got through.",
    "She placed fourth in the 2018 Games.",
    "A day earlier, Florida Gov.",
    "\"I have your back.\"",
    "No."
  ]
}