{
  "id": 560,
  "mediaId": 151,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "Mitch McConnell doesn't like the national GOP censuring Adam Kinzinger and Liz Cheney over their work on the Jan. 6 probe: \"That's not the job of the RNC.",
  "image": "https://www.politico.com/interactives/uploads/image-service/2022/2/8/ab1d2412e8-1200.jpeg",
  "link": "https://www.politico.com/minutes/congress/02-8-2022/",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    790,
    1248,
    1765,
    1814,
    1914,
    2170,
    2214,
    3094,
    116,
    427,
    428
  ],
  "sentences": [
    "Tap, scroll or click for more g\nHer plan: Salazar says her plan would be a compromise for both Democrats and Republicans, saying she blended up what everyone agrees on to make a new product.? It would seek to end illegal immigration once and for all? by securing the southern border with border barrier construction, adding 3,000 new border agents, improving their use of technology and mandating nationwide E-Verify to end the hiring of illegal workers.",
    "The proposal operates on the assumption that the majority of the undocumented population may not be looking for a citizenship-or-nothing deal, but would likely be content with the opportunity to live in the U.S. legally,? according to a summary of the plan, citing when the Reagan administration sought to offer a pathway to citizenship to almost 3 million undocumented immigrants in 1986, but only a third of those who were eligible accepted the offer.",
    "Troy Nehls (R-Texas)\nThe Capitol Police, without naming Nehls, denied his allegation: Chief Thomas Manger said it's policy that if officers see a lawmaker's office is open without anyone inside, they are \"directed to document that and secure the office to ensure nobody can wander in and steal or do anything else nefarious.\"",
    "If a Black man would have touched a white woman and used the profanity with her, it's hard to think of what could have happened.?\n Congressional Black Caucus Chair Joyce Beatty (D-Ohio) in an interview with POLITICO\nIn addition, Beatty said the Black Caucus wanted to meet to discuss what happened and determine next steps.",
    "So why don't we bring out of the shadows 11-plus million people who've been here for more than five years, have American kids, that have not committed a crime, and all they want is dignity??\nToday we'll hear from one critical Senate voice when it comes to the RNC's decision to censure two of its own: Mitch McConnell.",
    "She also wants to reform the asylum process to stop catch-and-release? by establishing more processing centers to hold immigrants while their cases are being decided, increase the number of judges and attorneys dealing with such cases and bringing asylum seekers to court on a last-in-first-out basis.",
    "Tap, scroll or click for more g\nHis comment: \"The issue is whether or not the RNC should be sort of singling out members of our party who ... have different views from the majority,\" McConnell told reporters Tuesday, when asked about the committee's censure of Reps. Liz Cheney (R-Wyo.)",
    "They form a coalition and they stick to the agreements they made, which means he has less wiggle room.?\nIndeed, many lawmakers had expressed significant concerns about Germany's willingness to join with the rest of the West in a unified response to a possible Russian invasion.",
    "Tap, scroll or click for more g\nOlaf Scholz, the new German leader, faced criticism after he declined multiple times on Monday to echo President Joe Biden's vow that the Russia-to-Germany gas pipeline known as Nord Stream 2 would be killed if Russia invades Ukraine.",
    "Senators have figured out a way to bridge the partisan divide over Nord Stream 2 sanctions  to impose them after a Russian invasion  and having Germany's buy-in for such a dramatic move makes senators think they can get enough support for the compromise bill.",
    "They have a chance to change and things of that sort so we've got to make sure we're doing it and doing it right.?\n Sen. Joe Manchin (D-W.Va.)\nA freshman Republican is rolling out a middle-of-the-road proposal she claims would help fix the immigration system.",
    "And he was very clear on that.?\nBetween the lines: Both Menendez and Risch said that what they heard from Scholz makes them more confident that they can reach an agreement on a comprehensive sanctions package, which their parties are still haggling over.",
    "For other undocumented immigrants, she wants to offer long-term pathways, such as a Dignity? path  a 10-year temporary legal status, which would require a criminal background check and for them to pay $10,000 in restitution over 10 years.",
    "According to Sen. Jim Risch of Idaho, Menendez's GOP counterpart on the Foreign Relations panel, Scholz was passionate in his denial that some people here are accusing Germany of  of turning away from the United States and toward Russia.",
    "The funding patch aims to hold the budget over for three more weeks beginning Feb. 18, when federal dollars dry up, and would delay a potential shutdown to March 11  buying appropriators time to negotiate a fiscal 2022 omnibus deal.",
    "What they said: Senate Foreign Relations Committee Chair Bob Menendez (D-N.J.) recalled pressing Scholz on a long-standing belief within his Social Democratic Party  that Germany was a bridge between Russia and the West.",
    "Tap, scroll or click for more g\nWhat happened: Sen. Joe Manchin threw cold water on efforts by congressional staff to form unions, arguing public officials and staff are ultimately accountable to their constituents.",
    "Scholz vigorously denied that, Menendez told POLITICO: He said, No, we do not seek that and we do not want to play that role.' So as far as I'm concerned, he was very strong.?\nWhy the ambiguity on Nord Stream 2?",
    "Tap, scroll or click for more g\nThe House: Talks around government funding are leading the schedule today, as the chamber is set to take up a third stopgap spending bill since the fiscal year began in October.",
    "Tap, scroll or click for more g\nThe landscape: For instance, thanks to aggressive gerrymandering in some states, there will be more GOP seats where Biden won in 2020 than there are in the current Congress.",
    "If we had to guess, we'd wager he says something seemingly mild but subtly pointed about how Republicans should be focused on the midterms  and this move has them looking backwards, not toward the future.",
    "The second part of her plan includes programs to address the undocumented immigrants in the U.S. She says so-called \"Dreamers\" should receive immediate status and an earned pathway to citizenship.",
    "We were the threat.' If Capitol Police had spent this much time investigating January 6th as they did investigating my private legislative materials, January 6th would not have happened.?\n Rep.",
    "A land war in Asia is catastrophic for Germany, and of course they're going to take steps to make sure that that doesn't happen,? Murphy said of the reassurances he received at the dinner.",
    "\"So I think every member of the media, every citizen, every person out there needs to pin down every Republican and say, do you side with what the RNC did or do you condemn what they did?\"",
    "She's not the first one: Republicans from purple districts seem to wade into immigration reform every few years, but recent compromise proposals have gone down in flames in the House.",
    "Tap, scroll or click for more g\nThe timeline: Nehls said they snapped pictures of a draft legislative proposal that would have ensured body armor quality for law enforcement officers.",
    "Tap, scroll or click for more g\nIn an interview, Beatty said the incident suggested far too many members are \"forgetting the decorum of the House\" and vowed not to stand for it.",
    "He said Capitol Police Chief Thomas Manger indicated they were investigating a \"veiled threat\" against the congressman, but Nehls said he was never warned of such a risk.",
    "\"That Monday, [Capitol Police] personnel personally followed up with the Congressman's staff and determined no investigation or further action of any kind was needed.",
    "McConnell noted that traditionally \"the view of the national party committee is that we support all members of our party, regardless of their position on some issue.\"",
    "Joyce Beatty says veteran lawmaker Hal Rogers told her to \"kiss my ass\" for asking him to wear a mask while riding the House's internal subway train to votes.",
    "But senators who had dinner with Scholz last night at the German embassy said he was extremely clear about his country's position on the matter.",
    "Pelosi spoke too: House Democratic leaders also gave a spirited pitch about the importance of shaping a message that the party is fully behind.",
    "Sean Patrick Maloney delivered an upbeat message to fellow Democrats about their midterm prospects, buoyed by some recent redistricting wins.",
    "House Minority Leader Kevin McCarthy said \"I have no idea what you're talking about? when asked about the incident on his way into votes.",
    "Maloney also noted that DCCC has slightly beat the fundraising levels of its counterpart, the National Republican Campaign Committee.",
    "\"After communicating with Chief Manger, it became clear that my office was under investigation and surveillance by [Capitol Police].",
    "Both Bob Menendez and Jim Risch they're feeling more confident about getting a deal done as the threat of a Ukraine invasion looms.",
    "A bipartisan group of senators left a private dinner with German chancellor Olaf Scholz feeling reassured about Russia sanctions.",
    "Sign up for Huddle, our morning Capitol Hill newsletter, to start each day with the inside scoop on what to expect in Congress.",
    "Rogers is hardly new to Capitol customs: He's the exact opposite of a freshman lawmaker, having served in Congress since 1981.",
    "Rogers declined multiple times to comment on Beatty's allegations on his way into votes, referring reporters to his office.",
    "If you don't believe in the message  you can't go sell it,\" Pelosi told members, according to multiple sources in the room.",
    "\"The weekend before Thanksgiving, one of our vigilant officers spotted the Congressman's door was wide open,\" Manger said.",
    "No case investigation was ever initiated or conducted into the Representative or his staff,\" Manger said in a statement.",
    "When you're working for tax dollars and you're [at] will and pleasure, I'm here at the will and pleasure of the people.",
    "Nevertheless, Salazar argued lawmakers need to address the current system and end its status as a political volleyball.",
    "Prior to the vote, he told \"Fox News\" that Kinzinger and Cheney would have a \"hard time ever coming back to Congress.\"",
    "It would have certain appeal to both parties, but she's not the first GOP lawmaker to propose an immigration fix.",
    "Oh, we also expect House Minority Leader Kevin McCarthy (R-Calif.) will get asked about this again on Tuesday.",
    "According to one dinner attendee, it's not as easy for German politicians to make such public pronouncements.",
    "\"He is the weakest leader that has ever, frankly, existed in that position,\" the Illinois Republican said.",
    "And they offered some insights on why Scholz was less than definitive in public after meeting with Biden.",
    "Troy Nehls says the U.S. Capitol Police entered his office and took photos of confidential information.",
    "Joe Manchin didn't sound particularly enthused by the emerging push for a congressional staff union.",
    "Capitol Police Chief Thomas Manger defended his officers in the matter  denying Nehls' allegations.",
    "Expect Kevin McCarthy to get asked about the censure of Adam Kinzinger and Liz Cheney, as well.",
    "Because they're not paying for the roads, for the schools, for the hospitals,? Salazar argued.",
    "You can touch me and poke me in the middle of my back, cuss me out and nothing happens?",
    "There are some positive notes for Dems in their otherwise bleak election cycle.",
    "That money, she said, would go into a fund for training American workers.",
    "Here's what's driving the congressional calendar Tuesday, Feb. 8, 2022.",
    "We dusted off the handy Manch-o-meter to evaluate his latest comments.",
    "Tap, scroll or click for more g\nMcConnell picks his words carefully.",
    "Kinzinger, in turn, slammed McCarthy during an appearance on MSNBC.",
    "Many in the Senate GOP have been sharply critical of the RNC move.",
    "Wonder what would have happened if that would have been reversed?",
    "The problem is that what they really have right now is amnesty.",
    "Here's Sen. Chris Murphy (D-Conn.): German politics are funny.",
    "He's also had some time to figure out this particular answer.",
    "\"We know the disparities and people are treated differently.",
    "They can't say things out loud and on the fly like we can.",
    "Democratic lawmakers host a presser on tax credits.",
    "Elections serve as a check on bad bosses, he said.",
    "Check back later today for updates from the Hill.",
    "Another stopgap spending bill gets a House vote.",
    "Cheney is facing a Trump-boosted primary foe.)",
    "The Kentucky Republican declined to comment.",
    "We've reached out but have yet to hear back.",
    "(Kinzinger is retiring amid redistricting.",
    "An inspector general will investigate.",
    "We don't have a reliable workforce.",
    "\"That's not the job of the RNC.\"",
    "and Adam Kinzinger (R-Ill.).",
    "That's not where they are.",
    "That's all for now.",
    "Want to see more?",
    "So what's next?",
    "Why?"
  ]
}