{
  "id": 561,
  "mediaId": 233,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "Mitch McConnell calls Jan. 6 a 'violent insurrection,' hits Republicans for censure of Cheney, Kinzinger",
  "image": "https://www.gannett-cdn.com/presto/2022/01/21/USAT/526db084-5f87-4bc6-b2d0-7c90f264958d-vpc_bailey_on_mcconnell.00_00_08_01.Still001.jpg?width=1320&height=744&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/02/08/mcconnell-capitol-riot-violent-insurrection/6710131001/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jackson",
  "authorUrl": "https://www.usatoday.com/staff/2647924001/david-jackson/",
  "termIds": [
    895,
    895,
    1248,
    1248,
    1448,
    1448,
    2182,
    2182,
    2214,
    2214,
    1765,
    1765,
    571,
    571,
    427,
    427,
    428,
    428
  ],
  "sentences": [
    "More:GOP censures Reps. Liz Cheney and Adam Kinzinger, calls Jan. 6 riot 'legitimate political discourse'\nWith the Senate deadlocked 50-50 between the parties  and controlled by the Democrats because of Vice President Kamala Harris' tie-breaking vote  the Republicans face toss-up Senate elections in places like Pennsylvania, Georgia and Arizona, states that Biden carried.",
    "Four days after the RNC voted to censure House members Cheney and Kinzinger for participating in the Jan. 6 investigation, McConnell said the party organization should not be \"picking and choosing\" among candidates: \"We support all members of our party, regardless of their positions on some issues.\"",
    "WASHINGTON  Spotlighting a widening breach among Republicans, Senate GOP leader Mitch McConnell criticized the Republican National Committee on Tuesday for censuring Reps. Liz Cheney and Adam Kinzinger, and for suggesting that the Jan. 6 insurrection was \"legitimate political discourse.\"",
    "McConnell echoed other Republican lawmakers who said the censure needlessly divided the party ahead of a challenging set of elections shadowed on the Republican side by former President Donald Trump and his continued insistence on false claims about the 2020 election.",
    "Republicans like McConnell and Cornyn also criticized the censure resolution for suggesting that the Jan. 6 insurrection  which included Trump supporters physically assaulting police officers  constituted \"legitimate political discourse.\"",
    "After his statements about the censure resolution, the Republican National Committee put out a written statement saying that it \"has repeatedly condemned all acts of political violence and lawlessness, including what occurred on Jan.",
    "The RNC said Cheney, Kinzinger and the committee investigating Jan. 6 have \"gone well beyond the scope of the events of that day, and is why the RNC overwhelmingly passed a resolution censuring\" the two Republican House members.",
    "Party members like Sen Josh Hawley, R-Mo., said RNC members had every right to censure Cheney and Kinzinger, the only two Republican members of the House /committee investigating the Jan. 6 insurrection.",
    "It was a violent insurrection for the purpose of trying to prevent a peaceful transfer of power after a legitimately certified election from one administration to the next,\" McConnell told reporters.",
    "McConnell and other Republicans fear divisions over Trump could weaken some Republican nominees in the closely contested states, a list that includes places like Ohio, Florida and North Carolina.",
    "Republicans like Cheney have also said that party candidates should not be echoing Trump's false claims of voter fraud in 2020, the inspiration for the Jan. 6 assault on the U.S. Capitol.",
    "RNC Chairwoman Ronna McDaniel sad that passage referred to bystanders who \"had nothing to do with violence at the Capitol,\" but have been swept up in Jan. 6 investigations.",
    "The wording of the resolution accused Cheney and Kinzinger of \"participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse.\"",
    "Cheney, targeted by Trump for her vote to impeach him over Jan. 6, faces a primary challenge in Wyoming from a Republican backed by the former president, Harriet Hageman.",
    "\"The issue is whether or not the RNC should be sort of singling out members of our party who may have different views from the majority,\" McConnell said.",
    "I don't think you can kick out of the party everybody you disagree with, or it's going to be a minority party,\" said Sen. John Cornyn, R-Texas.",
    "McConnell did not cite the Jan. 6 resolution specifically, but made clear to reporters than the attack was in no way peaceful or legitimate.",
    "Kinzinger, who also voted to impeach Trump, is not seeking re-election because of redistricting in Illinois.",
    "\"What is a distraction is to have a bunch of DC Republicans bashing other Republicans,\" Hawley said.",
    "\"Listen, whatever you think about the RNC vote, it reflects the view of most Republican voters.\"",
    "McConnell said he still has confidence in RNC chairwoman McDaniel, but that is not the question.",
    "More than 700 people have been arrested in connection with the attack on the Capitol.",
    "Other Republicans said critics of the censure are the ones dividing the party.",
    "The divisions could also affect U.S. House races.",
    "\"We all were here,\" McConnell said.",
    "\"That's not the job of the RNC.\"",
    "\"We saw what happened.\"",
    "\"That's what it was.\"",
    "6.\""
  ]
}