{
  "id": 564,
  "mediaId": 195,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "DeSantis: GOP voters want leaders who will 'fight the left'",
  "image": "https://cdn.jwplayer.com/v2/media/Di5riw1A/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/593298-desantis-gop-voters-want-leaders-who-will-fight-the-left",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dominick Mastrangelo",
  "authorUrl": "https://thehill.com/author/dominick-mastrangelo",
  "termIds": [
    661,
    1147,
    1248,
    2214,
    3094,
    427,
    428,
    2661
  ],
  "sentences": [
    "The RNC resolution dictates the party shall immediately cease any and all support of? both lawmakers as members of the Republican Party for their behavior which has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic, and is inconsistent with the position of the Conference.?\nIn a statement defending herself after the resolution passed, Cheney called herself a \"constitutional conservative\" who does \"not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.\"",
    "DeSantis said on Monday it is a mistake for Cheney, Kinzinger and other Republicans who have criticized Trump over his handling of the 2020 election \"to act like the main issue in this country is things that happened over a year ago.\"",
    "On Friday, the RNC voted to censure the Cheney and Kinzinger, who have spoken out against former President Trump's unsupported claims of widespread voter fraud and blamed him for inciting the Jan. 6, 2021, attack on the U.S. Capitol.",
    "and Adam Kinzinger (R-Ill.) after they made a political miscalculation shows the way forward for the party is through promoting leaders who \"fight the left.\"",
    "To have a vendetta against Donald Trump, and to constantly be bringing this up is just not something that I think Republican voters are interested in.\"",
    "They're thankful we're a law-and-order state, but they look around and see what's happening in a lot of these cities where crimes are spiking.",
    "\"Liz Cheney is just totally off the rails with her nonsense,\" DeSantis said during an interview Monday with Fox News Digital.",
    "Ron DeSantis (R) argued that the Republican National Committee's (RNC) move to censure Reps. Liz Cheney (R-Wyo.)",
    "So I think focusing on the issues and showing that we stand for things that matter to people is the way forward.",
    "They're thankful that Florida's a free state, but they look around the country and see how fragile freedom is.",
    "We want people that are going to fight the left, and that's what we need to do in this country.",
    "\"I can tell you in Florida, that's not what Floridians are concerned about,\" DeSantis said.",
    "DeSantis is expected to consider a run for the Republican primary for president in 2024.",
    "\"And I think she's not really a Republican in terms of terms of what she's doing.",
    "That's what we're doing in Florida, standing up for people's freedoms.",
    "\"I will never stop fighting for our constitutional republic.",
    "\"They're concerned about inflation and gas prices.",
    "\"History will be their judge,\" she added.",
    "We're opposing all these things.\"",
    "We're opposing wokeness.",
    "No matter what.\"",
    "Florida Gov."
  ]
}