{
  "id": 565,
  "mediaId": 132,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "McConnell rebukes RNC, calls Jan. 6 'violent insurrection'",
  "image": "https://cdn.newsday.com/polopoly_fs/1.50503409.1644358378!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg",
  "link": "https://www.newsday.com/news/nation/mcconnell-rnc-january-6-insurrection-1.50503408",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "",
  "termIds": [
    1248,
    1685,
    1765,
    2034,
    2214,
    2465,
    3094,
    427,
    428,
    571
  ],
  "sentences": [
    "As former President Donald Trump has downplayed the attack by his supporters last year  the worst attack against the Capitol in two centuries  the RNC last week took a voice vote to approve censuring Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois at the party's winter meeting in Salt Lake City.",
    "Credit: AP/Susan Walsh\nWASHINGTON  Senate Republican Leader Mitch McConnell is criticizing the Republican National Committee for censuring two House GOP lawmakers investigating the \"violent insurrection\" on Jan. 6, 2021, saying it's not the party's job to police the views of lawmakers.",
    "Collins said the GOP started out the year with an advantage on issues that could decide the election, but \"every moment that is spent re-litigating a lost election or defending those who have been convicted of criminal behavior moves us further away from the goal of victory this fall.\"",
    "McDaniel denied that the \"legitimate political discourse\" wording in the censure resolution was referring to the violent attack on the Capitol and said it had to do with other actions taken by the House committee investigating the Jan. 6, 2021, insurrection.",
    "The dispute is the latest tug of war within the party over issues that McConnell and others see as politically beneficial to talk about in an election year  inflation, for example  and discourse over the insurrection and Trump's falsehoods over the election.",
    "The RNC resolution censuring Cheney and Kinzinger accused the House panel of leading a \"persecution of ordinary citizens engaged in legitimate political discourse\"  words that drew outrage from Democrats and firm pushback from several GOP senators.",
    "\"I think every American who watched the video of that attack and who watched that attack unfold knows that it was really shameful to suggest that that what happened that day might be legitimate political discourse,\" she said.",
    "The rioters who broke in to the Capitol were repeating Trump's false claims of widespread voter fraud and a stolen win, even after election officials and courts across the country repeatedly dismissed those claims.",
    "Sen. Josh Hawley, R-Mo., who along with Cruz led objections to the certification of Biden's victory on Jan. 6, said it is a distraction to have Republicans in Washington like McConnell \"bashing other Republicans.\"",
    "He said he still has confidence in RNC Chair Ronna McDaniel, but \"the issue is whether or not the RNC should be sort of singling out members of our party who may have different views than the majority.",
    "\"It was a violent insurrection for the purpose of trying to prevent the peaceful transfer of power after a legitimately certified election from one administration to the next,\" McConnell said Tuesday.",
    "\"The RNC has any right to take any action and the position that I have is that you're ultimately held accountable to voters in your district,\" said New York Rep. Elise Stefanik, the No.",
    "McConnell and his closest allies have said for months that they want to look forward to November 2022, when they have a chance of taking back the Senate, and not back to January 2021.",
    "The rioters who broke into the Capitol through windows and doors brutally beat law enforcement officers and interrupted the certification of President Joe Biden's victory over Trump.",
    "Maine Sen. Susan Collins said that the rioters who \"broke windows and breached the Capitol were not engaged in legitimate political discourse, and to say otherwise is absurd.\"",
    "\"If you come to the state of Missouri and talk to Republicans, people who are going to be voting in our primary, they probably agree with what the RNC did,\" Hawley said.",
    "The two Republicans sit on a Democrat-led House committee that is aggressively investigating the siege and has subpoenaed many in the former president's inner circle.",
    "The censure was approved last week after an RNC subcommittee watered down a resolution that had recommended expelling the pair from the party.",
    "Republican Sen. John Cornyn of Texas said Monday that the RNC has said it wants the party to be unified, \"and that was not a unifying action.\"",
    "Senate Minority Leader Mitch McConnell of Ky., center, speaks to reporters on Capitol Hill in Washington, Tuesday, Feb. 8, 2022.",
    "Utah Sen. Mitt Romney, who is McDaniel's uncle, said the censure \"could not have been a more inappropriate message.\"",
    "Few Republicans openly defended the RNC's move, though several said it was the party's prerogative to take the vote.",
    "Cheney said Monday that she had been receiving a \"tremendous amount of support\" in the wake of the censure vote.",
    "\"Anything that my party does that comes across as being stupid is not going to help us,\" he told reporters.",
    "Texas Sen. Ted Cruz said that Cheney and Kinzinger's role on the Jan. 6 panel is \"not helpful.\"",
    "Standing with McConnell is Sen. Roy Blunt, R-Mo., left, and Sen. John Thune, R-S.D., right.",
    "\"We're going to hear the feedback and the views of voters pretty quickly here this year.\"",
    "Alabama Sen. Richard Shelby said he believes the GOP should be a \"big tent.\"",
    "Associated Press writer Farnoush Amiri contributed to this report.",
    "Romney said he had texted his niece to discuss the censure.",
    "But the resolution drew no such distinction.",
    "That's not the job of the RNC.\"",
    "3 Republican in the House."
  ]
}