{
  "id": 566,
  "mediaId": 195,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "Stefanik says RNC has 'every right' to censure Cheney and Kinzinger",
  "image": "https://cdn.jwplayer.com/v2/media/kuQ2Qmpj/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/house/593281-stefanik-says-rnc-has-every-right-to-censure-cheney-and-kinzinger",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Marcos",
  "authorUrl": "https://thehill.com/author/cristina-marcos",
  "termIds": [
    1095,
    1147,
    1248,
    1963,
    2182,
    2214,
    3094,
    423,
    427,
    428,
    562
  ],
  "sentences": [
    "It's about punishing partisan opponents and not getting to the real facts which should be how can we ensure that the Capitol complex is safe, not only for those of us who work here but for the American people to come continue to advocate for policies they believe in,\" Stefanik continued.",
    "Stefanik declined to endorse the language in the RNC's censure resolution, which stated that Cheney and Kinzinger are participating in persecution of ordinary citizens engaged in legitimate political discourse? by serving on the House select committee investigating the Capitol riot.",
    "House GOP leaders, who are trying to avoid highlighting the party's internal divisions as they eye retaking the House majority this year, have also tamped down efforts to take away committee assignments from Republicans who voted for the bipartisan infrastructure bill last year.",
    "Stefanik succeeded Cheney as the third-ranking House Republican last year after GOP lawmakers booted Cheney from her leadership position for repeatedly pushing back against former President Trump's false claims that the 2020 election was stolen from him.",
    "We also condemn the violence on 2020 as violent criminals attacked federal buildings, including parts of Washington, D.C.,\" Stefanik said, referring to vandalism that occurred at the same time as some Black Lives Matter protests in 2020.",
    "Another Senate Republican closely allied with Senate Minority Leader Mitch McConnell (R-Ky.), Sen. John Cornyn (R-Texas), said describing the events of Jan. 6 as \"legitimate political discourse\" was \"not an accurate description.\"",
    "When asked at a press conference in the Capitol on Tuesday about the RNC's vote on Friday to censure Cheney and Kinzinger, Stefanik said that the two would ultimately face consequences at the ballot box this year.",
    "When another reporter asked at the press conference if Republicans plan to take any additional actions against Cheney or Kinzinger, Stefanik replied: \"It did not come up today in our conference meeting.\"",
    "House Republican Conference Chairwoman Elise Stefanik (N.Y.) said Tuesday that the Republican National Committee (RNC) \"has every right to take any action\" to rebuke GOP Reps. Liz Cheney (Wyo.)",
    "By contrast, Senate Republicans have kept their distance from the RNC's censure of Cheney and Kinzinger and the characterization of the Jan. 6 attack as \"legitimate political discourse.\"",
    "Cheney is running for reelection against a Trump-backed primary challenger, while Kinzinger has opted to retire from Congress at the end of his term.",
    "I just think right now if we want to win the elections in November, [there are] better things for us to be focused on,? said Sen. John Thune (S.D.",
    "Some members of the far-right House Freedom Caucus have called for expelling Cheney and Kinzinger from the House Republican Conference.",
    "Removing them would, among other things, potentially risk altering the ratio of Republicans who could serve on House committees.",
    "Being accurate is really important in particular when you are talking about something that sensitive,? Cornyn said.",
    "and Adam Kinzinger (Ill.) for serving on the House panel investigating the Jan. 6, 2021, attack on the Capitol.",
    "And we're going to hear the feedback and the views of voters pretty quickly here this year,\" Stefanik said.",
    "And the position that I have is that you're ultimately held accountable to voters in your district.",
    "\"As Republicans have been very clear, we condemn the violence on Jan. 6.",
    "But so far, the two officially remain members of the conference.",
    "\"We believe the Jan. 6 [committee] is political theater.",
    "But she didn't express explicit disagreement, either.",
    "\"The RNC has every right to take any action.",
    "A staffer then yelled out: \"Last question!\"",
    "Voters who you represent.",
    "2 Senate Republican.",
    "), the No."
  ]
}