{
  "id": 567,
  "mediaId": 237,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "McConnell: 'Not the job of the RNC' to censure Liz Cheney and Adam Kinzinger",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/951011.png",
  "link": "https://www.washingtonexaminer.com/news/mcconnell-not-the-job-of-the-rnc-to-censure-liz-cheney-and-adam-kinzinger",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Brooks",
  "authorUrl": "https://www.washingtonexaminer.com/author/emily-brooks",
  "termIds": [
    1248,
    1335,
    1609,
    1765,
    2214,
    3094,
    146,
    427,
    428,
    562,
    571
  ],
  "sentences": [
    "Asked if he has confidence in Republican National Committee Chairwoman Ronna McDaniel, who has defended the resolution, McConnell said: I do.?\n\"With regard to the suggestion that the RNC should be in the business of picking and choosing Republicans who ought to be supported: Traditionally, the view of the national party committee is that we support all members of our party, regardless of their positions on some issues,\" McConnell said.",
    "In addition to censuring the two members, leaders in the Wyoming Republican Party have cleared the way for the Republican National Committee to financially support one of her primary challengers who has been endorsed by former President Donald Trump.",
    "The issue of whether or not the RNC should be sort of singling out members of our party who may have different views from the majority  that's not the job of the RNC,? McConnell told reporters Tuesday when asked about the censure.",
    "Among the complaints in the resolution was that the pair is participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse,? terminology that enraged a number of Senate Republicans.",
    "Senate Minority Leader Mitch McConnell said it was not the job? of the Republican National Committee to be singling out members? with differing views, as it did by censuring Republican Reps. Liz Cheney and Adam Kinzinger.",
    "The censure resolution passed by voice vote at the national party's winter meeting last week took aim at Cheney and Kinzinger for participating in the House select committee to investigate the Capitol riot.",
    "McConnell said the Capitol riot was a \"violent insurrection for the purpose to try to prevent a peaceful transfer of power after a legitimately certified election from one administration to the next.",
    "Republicans boycotted the committee after House Speaker Nancy Pelosi refused to seat two of House Minority Leader Kevin McCarthy's picks, but Pelosi appointed Cheney and Kinzinger.",
    "The move has prompted outrage from Cheney and lesser-known candidates still in the race.",
    "That's what it was.\""
  ]
}