{
  "id": 568,
  "mediaId": 195,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "The new politics of America: Fall into line or pay the price",
  "image": "https://cdn.jwplayer.com/v2/media/Di5riw1A/poster.jpg?width=640",
  "link": "https://thehill.com/opinion/campaign/593095-the-new-politics-of-america-fall-into-line-or-pay-the-price",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bernard Goldberg",
  "authorUrl": "",
  "termIds": [
    645,
    958,
    1147,
    1248,
    2214,
    2234,
    2303,
    2505,
    3094,
    33
  ],
  "sentences": [
    "and Adam Kinzinger (R-Ill.), for having the audacity to sit on Speaker Nancy Pelosi's House Select Committee investigating the Jan. 6, 202, riot at the Capitol, and which, to the RNC, amounts to persecution of ordinary citizens engaged in legitimate political discourse.?\nRealizing how bad that sounded, party leaders rushed to clarify what they claimed they actually meant that they weren't talking about the violent rioters who stormed the Capitol, only the ones that had nothing to do with violence at the Capitol.? And the RNC pledged to immediately cease any and all support? for Cheney and Kinzinger..\nNever mind that, just as Sinema is a principled Democrat, Cheney and Kinzinger are principled Republicans who aren't willing to downplay what happened at the Capitol on Jan 6.",
    "As Jonah Goldberg, the conservative pundit who walked away from his job as a contributor at Fox News because of its blind devotion to Donald Trump bluntly puts it in his blog, The Goldberg File: The upshot of this is that [Republican Members of Congress] Paul Gosar, Madison Cawthorn, Marjorie Taylor Greene, Matt Gaetz, and the other gargoyles of the right can spew their bile and be considered Republicans in good standing and receive help from the party.?\nAs for our former president, Goldberg says: Donald Trump, it is now abundantly clear, endeavored to invalidate a constitutionally valid election with the full support of such poltroons and gibbons.",
    "Which brings us to a column last July by Kevin Drum, a progressive writer, whose essay had this eye-catching title: If you hate the culture wars, blame liberals.?\nIn it, he wrote, And for God's sake, please don't insult my intelligence by pretending that wokeness and cancel culture are all just figments of the conservative imagination.",
    "Sure, they overreact to this stuff, but it really exists, it really is a liberal invention, and it really does make even moderate conservatives feel like their entire lives are being held up to a spotlight and found wanting.?\nThis is the kind of stuff that conservatives love, especially coming from a writer who plays left field.",
    "In the choice between an archaic legislative norm and protecting Arizonans' right to vote, we choose the latter, and we always will.?\nYes, the Arizona Democratic Party has plenty of room for policy disagreements.? Just make sure you don't disagree with anything the party cares about.",
    "Her crime: Siding with Republicans and voting to maintain the Senate's filibuster rules, which effectively blocked the Democratic Party's ability to change the nation's voting laws, a key priority for her party.",
    "The Republican censure resolution begins with these words: WHEREAS, The primary mission of the Republican Party is to elect Republicans who support the United States Constitution and share our values  ?\nValues?",
    "It's proof, they like to say, that liberals are the real threats to democracy, and that if you believe in free speech and diversity of ideas and mom and apple pie, you belong in the Republican Party.",
    "And with a straight face, Arizona Democratic Party Chair Raquel Tern said, I want to be clear; the Arizona Democratic Party is a diverse coalition with plenty of room for policy disagreements.",
    "We learned that standing up for what you honestly believe, standing up for your principles, doesn't count for all that much anymore  not when blind party loyalty is on the line.",
    "He was a correspondent with HBO's Real Sports with Bryant Gumbel? for 22 years and previously worked as a reporter for CBS News and as an analyst for Fox News.",
    "That's because Trump has become the personification of our culture war conflicts.?\nThis is what culture war conflicts look like at the moment.",
    "But support for the thrice-married serial adulterer and coup-plotter is considered consonant with our values' but seeking the truth isn't.",
    "Except, liberals don't have a monopoly on purity tests, closed-mindedness, or canceling renegades who disagree with the party line.",
    "And while wokeness and cancel culture? may, in fact, be a liberal invention,? as Kevin Drum puts it, neither side has clean hands.",
    "He is the author of five books and publishes exclusive weekly columns, audio commentaries and Q&As on his Patreon page.",
    "Last month, the executive board of the Arizona Democratic Party censured one of their own  Sen. Kyrsten Sinema.",
    "However, on the matter of the filibuster and the urgency to protect voting rights, we have been crystal clear.",
    "Bernard Goldberg is an Emmy and an Alfred I. duPont-Columbia University award-winning writer and journalist.",
    "We got another example recently of just how intolerant those supposedly open-minded liberals have become.",
    "Last week, the Republican National Committee (RNC) voted to censure Reps. Liz Cheney (R-Wyo.)",
    "It's a war where holding on to your principles can get you censured  by your own team.",
    "And it's one more reason that so many Americans have so little faith in politics.",
    "Diversity of opinion is welcome  as long as it's approved, acceptable opinion.",
    "Either fall into line or you'll pay a price for standing by your principles.",
    "But principles don't matter to the partisans on the left  or the right.",
    "Exactly what values are they talking about?",
    "Follow him on Twitter @BernardGoldberg.",
    "This is what the new left looks like."
  ]
}