{
  "id": 569,
  "mediaId": 558,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "GOP's bungling of Cheney, Kinzinger censure resolution draws rebuke from McConnell",
  "image": "https://s.yimg.com/ny/api/res/1.2/V529parJBqlICESCcKlKtg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MDtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-02/46a0cbd0-891e-11ec-b56f-7a92f2c22013",
  "link": "https://au.news.yahoo.com/go-ps-bungling-of-cheney-kinzinger-censure-resolution-draws-rebuke-from-mitch-mc-connell-211453916.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Ward",
  "authorUrl": "https://www.yahoo.com/author/jon-ward",
  "termIds": [
    1248,
    1337,
    1685,
    1765,
    2214,
    3094,
    146,
    427,
    428,
    571,
    2710
  ],
  "sentences": [
    "Traditionally the view of the national party committee is we support all members of our party regardless of their positions on some issues.?\nMcConnell also responded to language in the text of the censure resolution in which the RNC described the Jan. 6 committee's work as a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse.?\nLet me give you my view on what happened Jan. 6th.",
    "It was a violent insurrection for the purpose of trying to prevent the peaceful transfer of power after a legitimately certified election from one administration to the next.?\nMcConnell's comments were the latest black eye for the RNC and its chair, Ronna McDaniel.",
    "The RNC has said that the phrase legitimate political discourse? was not intended to refer to those who stormed the Capitol on Jan. 6, but only to those who did not assault police or enter the Capitol and have been subpoenaed by the committee.",
    "But the RNC's mishandling of the censure text has made the entire episode a referendum on the Jan. 6 attack, rather than on the two Republicans the RNC intended to penalize: Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois.",
    "Senate Minority Leader Mitch McConnell knocked the Republican National Committee on Tuesday for its decision last week to censure the two Republican members of the Jan. 6 select committee.",
    "Kinzinger has announced he'll be leaving Congress at the end of the current term, while Cheney is attempting to fend off a Trump-backed primary opponent.",
    "Numerous Republican senators have already criticized the censure resolution, including McDaniel's uncle, Utah Sen. Mitt Romney.",
    "The episode has also given a boost of energy to those in the party who want the GOP to move on from the former president.",
    "That's not the job of the RNC,? McConnell, a Kentucky Republican, told CNN's Manu Raju at the Capitol.",
    "I certainly haven't encountered that here in the state of Indiana,? said Sen. Todd Young, R-Ind.",
    "I don't know any American that regards that as legitimate political discourse.",
    "We all were here,? McConnell said."
  ]
}