{
  "id": 570,
  "mediaId": 237,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "Wyoming GOP move to allow RNC to fund Cheney challenger spurs outrage",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/951011.png",
  "link": "https://www.washingtonexaminer.com/news/campaigns/wyoming-gop-move-aimed-at-allowing-rnc-to-fund-cheney-challenger-spurs-outrage",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Brooks",
  "authorUrl": "https://www.washingtonexaminer.com/author/emily-brooks",
  "termIds": [
    1028,
    1147,
    1248,
    1685,
    2214,
    3085,
    3094,
    334,
    427,
    428,
    633,
    2976
  ],
  "sentences": [
    "But it is also prompting outrage from the Cheney campaign and other candidates in the race, who paint the move to declare a nominee months ahead of the Aug. 16 primary as un-American? and trying to play a trick on the voters.?\nRepublican National Committee Rule 11 prohibits the national party from contributing money or in-kind aid to any candidates before they become nominees through a primary or convention with two exceptions: if the candidate is unopposed after the filing deadline for the nomination or if the three RNC members from the state (the state party leader, the national committeeman, and the national committeewoman) give their written approval to the RNC to support the candidate.",
    "Wyoming state law states: No political party funds shall be expended directly or indirectly in the aid of the nomination of any one person as against another person of the same political party running in the primary election.?\nJack Speight and Stephen Klein, both attorneys with experience in Wyoming election law, told the Washington Examiner that the statute does not prohibit the RNC from spending on Hageman in the primary because federal law supersedes state law and because the race is for federal office.",
    "Knapp told the Washington Examiner that voters around the state are telling him: We do have a choice, and we shouldn't be dictated as to who our representatives gonna be before the election even happens.?\nHe also warned that the state party is close to being in violation of Wyoming law, at a time when our country is struggling with rule of law, and consequences for violating national and state laws.? Others in Wyoming have also raised questions about legality.",
    "Wyoming Republican Party Chairman Frank Eathorne, National Committeeman Corey Steinmetz, and National Committeewoman Nina Webber did just that, essentially declaring Hageman, an attorney and former RNC national committeewoman, the presumptive nominee, according to a report from the Washington Post.",
    "Bouchard, a firebrand in the state party unafraid to rile up fellow Republicans, wrote in a Facebook post Monday that party insiders are once again trying to play a trick on the voters.?\nThe current GOP Chairman, Frank Eathorne, has been making back room deals since I got in this race.",
    "The move underscores the Republican mobilization against Cheney and could have just as big of an impact on the race as the RNC moving to rebuke Cheney and Rep. Adam Kinzinger by censuring them for sitting on the House select committee formed to investigate the Jan. 6 Capitol riot.",
    "The voters of Wyoming will have something to say about it.?\nNew Hampshire RNC officials in 2020 resisted a similar push to use Rule 11 to support Trump-endorsed candidates in competitive U.S. Senate and House primaries, though there were no incumbent Republicans in those races.",
    "The RNC respects the will of Republicans in Cheney's home state and agrees that Cheney is working against the best interests of Republicans in Wyoming and nationwide, and RNC Chairwoman Ronna McDaniel and the RNC as a whole support the Wyoming GOP's Rule No.",
    "National Committeewoman Juliana Bergeron said in a statement that it was not necessary nor right to use Rule 11 in a state where we promise every candidate a fair chance.?\nEathorne and the Wyoming Republican Party did not respond to requests for comment.",
    "The Wyoming Republican Party Chair, Committeeman, and Committeewoman have signed a letter in accordance with the RNC's Rule No.11(a) to support the candidacy of Harriet Hageman in the Republican Primary,? an RNC official said in a statement.",
    "Wyoming Republican Party leaders moved to allow the Republican National Committee to support Harriet Hageman, who has been endorsed by former President Donald Trump in her primary run against Rep. Liz Cheney, on a financial basis.",
    "Frank Eathorne and the other leaders in the Wyoming GOP apparently believe they have the power to anoint our nominee before a single vote has been cast,? Jeremy Adler, a Cheney spokesman, said in a statement.",
    "Trump has long urged JUST ONE CANDIDATE? to challenge Cheney in the primary, worrying that a splintered anti-Cheney vote could lead to her cinching the nomination with just a plurality of votes.",
    "Several Republican challengers dropped out of the race following Trump's endorsement of Hageman, but a few who are not raising nearly as much as Cheney and Hageman remain.",
    "The rule is commonly employed to support incumbent Republicans in noncompetitive primaries or in instances of a former Republican politician again seeking the same office.",
    "Cheney is a top target for Trump, who has endorsed several primary challengers to Republicans who voted to impeach him in 2021 following the Capitol riot.",
    "They just skipped over that whole election phase,? Democratic Rep. Jamie Raskin, who sits with Cheney on the Jan. 6 committee, told reporters Friday.",
    "Two of those, State Sen. Anthony Bouchard and Army veteran Denton Knapp, are also expressing anger at the move to let the RNC fund Hageman.",
    "Paul LePage, a two-term governor who was prohibited from a third consecutive term, but is seeking a third nonconsecutive term in 2022.",
    "But she has drastically outraised Hageman and had nearly $5 million in cash-on-hand to Hageman's $381,200 at the end of 2021.",
    "But if the Wyoming GOP directly or indirectly financially supports Hageman, that could open up legal issues.",
    "But it is either rare or unprecedented for the process to be used against a sitting Republican incumbent.",
    "In November, it voted to no longer recognize Cheney as a member of the Republican Party.",
    "While legal, moving to open the spigot for Hageman also opens up the party to criticism.",
    "For instance, there is also an active Rule 11 allowing the RNC to support former Gov.",
    "This is un-American.?\nThe Wyoming Republican Party has tried to disown Cheney.",
    "But parties cannot prevent people from running in their nominating primaries.",
    "11(a) ruling to support the candidacy of Harriet Hageman,? the official said.",
    "Now the party insiders are breaking the rules once again,? Bouchard said.",
    "The cult of Trump is turning them into a party of political dictatorship.",
    "They're totally trying to squeeze the voters out.",
    "The right of the people to vote is sacred.",
    "The Cheney camp fired back at the move.",
    "Hageman is an RNC INSIDER."
  ]
}