{
  "id": 571,
  "mediaId": 441,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "What Can Anti-Trump Republicans Actually Do?",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iJW_UT4BHhEI/v1/800x-1.jpg",
  "link": "https://www.bloomberg.com/opinion/articles/2022-02-08/what-can-anti-trump-republicans-actually-do?srnd=premium-asia",
  "mediaOutlet": "Bloomberg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Bernstein",
  "authorUrl": "https://www.bloomberg.com/opinion/authors/ARq9kPCuG1Y/jonathan-bernstein",
  "termIds": [
    1147,
    1248,
    2087,
    2214,
    2411,
    2465,
    3094,
    427,
    428,
    562,
    2550
  ],
  "sentences": [
    "After the Republican National Committee censured Representatives Liz Cheney and Adam Kinzinger and claimed that the Jan. 6 committee they're serving on is persecuting people for legitimate political discourse,? several Republican senators were quick to criticize their own party's leadership.",
    "Democrats know that Manchin could cross the aisle and give Republicans a 51-49 majority, and in doing so shut down not only any hope of passing legislation with only Democratic votes, but also endangering President Joe Biden's judicial and executive-branch nominees.",
    "It would be an even greater threat if Romney could persuade two or three other Republicans to caucus with him as independent conservatives  continuing to vote as they always have on substantive measures, but supporting the Democrats on procedural votes.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.?\nRomney and the others took some flack as usual for just talking, rather than doing something.",
    "Even so, while Romney could certainly endanger a future Republican majority, that's something that punishes mainstream Republicans as much as or more than it punishes Trump and his allies.",
    "It's hard to see how giving Democrats a Senate majority in 2023 would prevent Trump from winning the presidential nomination or the 2024 election or even make it more difficult for him.",
    "Democrats don't need his vote on nominations, and he isn't going to give it to them on any mainstream liberal legislation that Manchin or Arizona Senator Kyrsten Sinema won't support.",
    "To contact the author of this story:\nJonathan Bernstein at jbernstein62@bloomberg.net\nTo contact the editor responsible for this story:\nTimothy Lavin at tlavin1@bloomberg.net",
    "Romney in particular voted to convict former President Donald Trump in both impeachment trials, and he supported a nonpartisan commission to investigate the Jan. 6 attacks.",
    "Defecting from the party wouldn't change much this year, but a pledge to help the Democrats organize the Senate next year would be a real threat to a Republican majority.",
    "All that said, Romney does have one weapon he could play or threaten to play: a third-party run for the presidency in 2024 if Trump is the Republican nominee.",
    "All this is fanciful, which is sort of the point; there are no obvious options for Romney and the small handful of openly anti-Trump Republicans in Congress.",
    "Meanwhile, if what Romney wants is to reform the party beyond just the influence of the former president, it's hard to see how leaving would help.",
    "That may not do much to ultimately reform the Republican Party, but it would certainly decrease the chances of Trump's winning a second term.",
    "But the truth is, the current dysfunctional Republican Party is a long way down the path they've chosen, and there's no obvious way back.",
    "(Just by, for example, staying off the ballot in Democratic-leaning states while qualifying and campaigning in Republican-leaning ones.)",
    "Most notably Utah's Mitt Romney: Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.",
    "And those who support the rule of law should accept allies where they can find them, and for whatever they're able to contribute.",
    "That said, if Romney really thought that the fate of the republic was on the line, what could he do in addition to speaking up?",
    "But if he could, Senate Minority Leader Mitch McConnell would have to at least consider taking them seriously.",
    "This column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.",
    "I don't know that he could guarantee a Democratic win, but he could certainly make one far more likely.",
    "If Romney threatened not just to run, but to do his best to defeat the Republican candidate?",
    "To be sure, I'm highly skeptical that Romney could get even one Republican to join him.",
    "Nor would it make it more likely that Trump is indicted or convicted of anything.",
    "Realistically, they can continue working on an update of the Electoral Count Act.",
    "But he can't deliver the 10 Republican votes needed to break a filibuster.",
    "Romney could flip to supporting for the Democrats' voting-rights agenda.",
    "They can support anti-Trump Republicans in upcoming primary elections.",
    "Unlike Senator Joe Manchin, Romney simply doesn't have a key vote.",
    "The problem for Romney is that he doesn't have much leverage.",
    "Perhaps there are other similar measures that might help.",
    "To some extent that's simply an inaccurate criticism.",
    "That doesn't mean Romney has no leverage at all.",
    "Romney can't do anything of that importance.",
    "And just plain speaking out isn't nothing.",
    "In politics, speech is action."
  ]
}