{
  "id": 576,
  "mediaId": 1343,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "Is Trump's hold on the Republican Party getting weaker?",
  "image": "https://www.brookings.edu/wp-content/uploads/2022/02/2022-02-07T110130Z_1090755787_RC2B9S9LSY70_RTRMADP_3_USA-TRUMP-SOCIAL-MEDIA.jpg?w=1200&h=630&crop=1",
  "link": "https://www.brookings.edu/blog/fixgov/2022/02/08/is-trumps-hold-on-the-republican-party-getting-weaker/",
  "mediaOutlet": "Brookings",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elaine Kamarck",
  "authorUrl": "https://www.brookings.edu/experts/elaine-kamarck/",
  "termIds": [
    896,
    1147,
    1248,
    1434,
    1460,
    1646,
    2087,
    2095,
    3094,
    4325,
    428,
    2672
  ],
  "sentences": [
    "This data and other related data led Dan Balz, the dean of the Washington Post's political reporters to askDo Republicans love Trump as they once did?? Balz's conclusion is a cautious oneWhether this is the beginning of something genuinely threatening to his standing or a minor hiccup that is of no real consequence is what all those Republicans with an eye on the White House want to know.?\nSecondly, Trump's ability to call the shots in the upcoming Republican primaries is being tested.",
    "Until February 4, Cheney was the undisputed leader of the anti-Trump faction in the Republican Party, but on that day, former Vice President Mike Pence joined her when he stated, in no uncertain words, President Trump is wrong  I had no right to overturn the election.? In a speech that was sincere and powerful he told members of The Federalist Society The truth is there's more at stake than our party or our political fortunes,? he said.",
    "He has held onto the loyalties of Republican voters, he has managed to spread the Big Lie (that he won the 2020 presidential election) to many of his followers and to many Republican politicians who initially were against him, and he has raised enormous sums of money, most of it from small donors.",
    "If we lose faith in the Constitution, we won't just lose electionswe'll lose our country.? Pence's remarks were all the more powerful because he made them while the Republican National Committee was censuring? two Republicans who refused to go along with the Big Lie.",
    "Finally, until lately, the only high profile opponent to Trumpat least rhetoricallywas Rep. Liz Cheney, who has been adamant in opposition to the Big Lie and is getting tons of air time as she announces the work of the select committee investigating January 6.",
    "In Georgia, for instance, the incumbent Governor Brian Kemp, who drew Trump's enmity when he called the state for Biden, has built a sizeable war chest and is running neck and neck or slightly ahead of Trump's choice, former Sen. David Perdue.",
    "She is also the daughter of former Vice President Dick Cheney who served in the George W. Bush Administration and her ties in the Republican Party go deep into that wing of the party that Trump has eclipsedbut that is still there.",
    "(The filing deadline hasn't passed yet) And in Idaho, Trump has endorsed the lieutenant governor but we don't yet know what the Republican primary looks like because the current governor hasn't announced whether he's running.",
    "And while, so far, there is no evidence of any Republican who can beat him for the nomination, we are two full years away from the New Hampshire primary and that, as they say, is a lifetime in politics.",
    "And in Massachusetts, Trump endorsed Geoff Diehl, who has lost so many races in that very blue state that a former Republican party chair said it would be foolish? for them to nominate Diehl.",
    "In polling done by NBC, they asked a very important questionAre you more a supporter of Donald Trump than of the Republican Party?? Before the 2020 election, 54% said Trump.",
    "On the other hand, it has stood in the way of him talking about issues like inflation or the ongoing pandemic that are likely of more immediate concern to voters than 2020.",
    "In many Republican primaries Trump does not appear able to crown winners simply with his endorsementhis candidates are often in for a fight with other Republicans.",
    "In Nebraska, Trump endorsed Charles Herbster and immediately Herbster drew harsh criticism about his business practices from the incumbent Republican governor.",
    "Between now and then his voters may continue to move away, his endorsed candidates may lose, and more high-profile Republicans may decide to take a stand.",
    "When NBC asked the same question in late January 2022, the numbers were evenly divided with 46% saying Trump and 46% saying the Republican Party.",
    "But in recent weeks it is possible to see three cracks in what Trump would like to believe is monolithic control over the Republican Party.",
    "Her candidacy is so strong (for reasons going beyond the Trump endorsement) that she has cleared the Republican primary field.",
    "Ditto for Dan Cox, the Trump candidate in the Maryland Republican primary who is behind other Republicans in his fundraising.",
    "Trump's choice in Arizona, Kari Lake, is facing a large field of Republican candidates and so far, she's being out raised.",
    "There are only two states where the entire Republican Party and Donald Trump's candidates appear to be on the same page.",
    "Many of the primaries will feature an internal fight between Trump endorsed candidates and more mainstream Republicans.",
    "In Arkansas, Trump endorsed Sarah Huckabee Sanders, his former press secretary, and the daughter of a former governor.",
    "In Kansas, the state's attorney general, Derek Schmidt is a strong candidate with no high-profile opponents so far.",
    "Heavy hitters are stepping up to challenge Trump's version of the election, which has become his dominant message.",
    "On the one hand, his obsession with his stolen election has helped spread it to large numbers of Republicans.",
    "For the past year it has been assumed that Donald Trump is the undisputed leader of the Republican Party.",
    "But Cheney is no ordinary congressperson from a small state that can boast more cattle than people.",
    "If so, by 2024 Trump may turn out to be the little man behind the curtain in The Wizard of Oz.?",
    "If his word was as powerful as he thinks it is, opposition to his candidates should melt away.",
    "For example, Trump has endorsed 12 candidates running in Republican gubernatorial primaries.",
    "Very few of these races are cake walks for the Trump endorsed candidate.",
    "First of all, the number of hard-core Trump voters may be shrinking.",
    "When it comes to the 2020 election, Trump is a broken record.",
    "The hard-core Trump base appears to be shrinking.",
    "But that's not happening.",
    "This has workedsort of.",
    "And with good reason."
  ]
}