{
  "id": 578,
  "mediaId": 238,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "Opinion: Can Alaska save democracy?",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/10/alaska-ranked-choice-voting-senate-murkowski/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    971,
    1026,
    1147,
    1248,
    1464,
    2178,
    3094,
    428,
    2538,
    2976
  ],
  "sentences": [
    "She wouldn't need to worry about a Trump-endorsed challenger winning the Republican primary, because she also would easily finish among the top four in a nonpartisan primary, and then in November could vault ahead with enough second-choice votes from Democrats, independents and others who would prefer Cheney to an election-subversion apologist.",
    "Ranked-choice voting fundamentally changes the competitive process, making it much easier for Sen. Lisa Murkowski, the state's moderate Republican, to fend off the challenge from opponent Kelly Tshibaka, endorsed by Donald Trump and the Alaska GOP's leadership.",
    "But if Alabama used Alaska's system, the non-Trump traditionalist Republican (Katie Britt) almost certainly would secure one of the four spots on the November ballot and, with second-choice votes from Democrats and others, prevail over coup-conspirator Brooks.",
    "Instead, Murkowski needs only to secure enough second-choice (and potentially third-choice) votes from voters who prefer one of the other two candidates among the four finalists to leapfrog over Tshibaka once the ballots are redistributed in subsequent rounds.",
    "If they no longer can control which Republicans get on the November ballot, so that all voters and not just partisans who show up for primaries get a chance to weigh in, then Republicans can feel free to counter Trump's authoritarian tendencies.",
    "It's not clear that Murkowski could replicate a write-in victory against Tshibaka, who'd have the double-barreled benefit of Trump's backing and being the sole candidate listed as a Republican on the ballot.",
    "If no candidate has a majority of first-place votes, the candidate with the fewest top-choice votes is eliminated, and their votes are redistributed according to how their supporters ordered their ballots.",
    "While Murkowski in 2010 was able to win a write-in campaign after losing the primary to a tea party challenger, politics has changed significantly since then, especially with the rise of Trump.",
    "In Alabama's Senate race, for example, there's a real risk that Rep. Mo Brooks (R-Ala.), who helped encourage the events of Jan. 6, might win the GOP primary and then the general election.",
    "Under Alaska's old system, which most states still use, Murkowski likely would have needed to beat Tshibaka in the Republican primary to earn a spot on the November ballot.",
    "But the United States' right-of-center party, which sooner or later will get a chance to govern again, is succumbing to Trump because of the existing electoral system.",
    "If the entire country conducted elections this way, it would diminish the severe danger that Trump's facsimile of fascism poses for both party and country.",
    "But with the new system in place, all Murkowski needs to do is earn one of the top four spots in the nonpartisan primary, a feat she easily will achieve.",
    "Instead, he could (and surely would) secure one of the four November spots and then attract sufficient support to prevail in the instant runoff.",
    "But the key point is that something like Alaska's model can liberate America from the threat of Trump and his recruits dismantling democracy.",
    "Consequently, Republicans who would prefer not to succumb to Trump's pressure  but who feel unable to resist given his political pull (Sens.",
    "Others argue there's mathematically a better way to identify the ranked-choice-voting winner than Alaska's specific instant-runoff method.",
    "Alaska might be next-to-last on lists of states, but it's first to employ the electoral reform that's most likely to save democracy.",
    "To assess the national significance of Alaska's new system, begin by imagining it also in place for Wyoming's midterms this year.",
    "Second, November's ballot uses ranked-choice voting, which lets voters to rank the four candidates in order of preference.",
    "If every state used Alaska's new system, Trump would be unable to exert his vise-like grip over the GOP.",
    "First, there's a nonpartisan primary in August, with the top four candidates advancing to November.",
    "Lindsey Graham and Marco Rubio come to mind)  would be able to maintain their independence.",
    "Then, in November, Murkowski doesn't need to receive more top-choice votes than Tshibaka.",
    "The state's new system, which takes effect for this year's midterms, has two parts.",
    "The United States is hardly alone in facing the challenge of right-wing populism.",
    "Preserving democracy here, like elsewhere, requires keeping its power in check.",
    "He wouldn't need to compete against Trump loyalists seeking the GOP nomination.",
    "Some reformers think five November finalists would be better than four.",
    "Will the rest of America follow their lead before it's too late?",
    "wouldn't be in the level of peril that she currently is.",
    "Rob Portman (R-Ohio) might have decided not to retire.",
    "This continues until one candidate has a majority.",
    "Alaskans are showing that this isn't inevitable.",
    "The same point applies in state after state.",
    "States don't need to copy Alaska exactly.",
    "If it were, Rep. Liz Cheney (R-Wyo.)",
    "If Ohio used Alaska's system, Sen."
  ]
}