{
  "id": 581,
  "mediaId": 312,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "Why the RNC's Embrace of Trump and the January Sixers Will Backfire",
  "image": "https://api.time.com/wp-content/uploads/2022/02/Liz-Cheney-Adam-Kinzinger.jpg?w=800&quality=85",
  "link": "https://time.com/6145764/rnc-censures-liz-cheney-adam-kinzinger-january-6-donald-trump/",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Elliott",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1335,
    1609,
    1685,
    1938,
    2214,
    3094,
    427,
    571
  ],
  "sentences": [
    "Why are we talking about this resolution?? said Rep. Michael McCaul, a former prosecutor who has previously defended Cheney, during an appearance on ABC News' This Week.?\nSeparately, the RNC members also changed their rules to allow the committee to fund and work with Cheney's primary challenger, a major shift in how the party's central committee traditionally avoids messy primary fights.",
    "Paid Partner Content\n I threw my Keurig machine away  and then I found this hack\nBy Angelino's Coffee\nThe RNC also branded those being investigated, tried and sentenced for their roles in the Jan. 6 attack on the Capitol as victimsdespite their roles in scaling the marble walls, smashing windows, occupying members' workplaces and sending Capitol Hill into hiding.",
    "It was entirely natural for Washingtonians to have spent a good bit of their weekend gaslighting themselves, questioning whether the Republican National Committee had actually passed a resolution on Friday to censure two House members for participating in the congressional investigation of a failed insurrection plot on Jan. 6 of last year.",
    "And did we get it right that the RNCwith no debate or recorded votealso said in the resolution that Reps. Liz Cheney and Adam Kinzinger engaged in the persecution of ordinary citizens engaged in legitimate political discourse? simply by looking into the details of the deadly attempt to keep Donald Trump in power?",
    "At the one-year anniversary mark, a majority of Republicans52%told ABC News/ Ipsos pollsters that the rioters were protecting democracy.? A staggering 61% of Republicans told The Associated Press-NORC Center for Public Affairs Research that the riot was somewhat? violent or not violent at all.",
    "More Must-Read Stories From TIME\nMarcia Fudge Is Trying to Decide Which Fire to Put Out First\nThe Untold Story of the Ukraine Crisis\nHow Wordle's Creator Feels About Selling His Viral Game\nColumn: Spotify Has a Much Bigger Problem Than Joe Rogan\nBlack History Lives in Memories and Minds.",
    "The RNC voted on Friday to censure Cheney and Kinzinger for accepting House Speaker Nancy Pelosi's invitation to join a House panel looking into the events that led to and took place during the siege of the Capitol for the first time since the Brits set fire to it in 1814.",
    "They chose to join Nancy Pelosi in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol.? That, to be clear, was not the resolution that passed with very few audible nays.",
    "But in the long run, the RNC's all-in-for-Trump position may come at a cost, especially among mainstream conservatives who, before Jan. 6, delighted in Cheney's perch as the third-ranking Republican in the House and saw Kinzinger as the future of the party.",
    "It's tempting to cast these decisions, made Friday in Salt Lake City, as outliersto argue that this is a small slice of the contemporary Republican Party that lives in partisan fundraisers and away from the realities of Washington.",
    "In other words, national Republicans were opening the floodgates for pro-Trump dollars to flow into Wyoming to defeat Cheney, the daughter of a former Vice President and Defense Secretary during Republican administrations.",
    "Minority Leader Kevin McCarthy, who is working aggressively to keep Trump on his side and perhaps deliver him the Speakership next year, sought to gum up a House probe by naming two hostile members to the panel.",
    "Demographics are not trending in Republicans' favor and a generation reset of politics should favor those unaligned with either major party but yearning for a pragmatic posture to the nation's challenges.",
    "COVID-19 Has Endangered Those Traditions\nWhy Toni Morrison's Books Are So Often the Target of Book Bans\nOlympic Sponsors Are Banking on Public Indifference to China's Human Rights Abuses\nSHARE THIS STORY",
    "Rioters used flag poles to smash windows, deployed chemical agents to choke the police trying to stand in the breach and brought the zip ties to be makeshift restraints for lawmakers the mob could find.",
    "Pelosi nixed his choices, prompting a GOP boycott of the House investigation, but Cheney and Kinzinger ignored McCarthy and accepted Pelosi's invitation.",
    "And without the largesse available to super PACs and dark-money groups, the RNC may have less power than it did during the pre-Citizens United rulings.",
    "In the aftermath of the attacks, Senate Republicans effectively killed any hopes of a bicameral probe and shut-down talk of work on a Senate query.",
    "The RNC's actions once again left GOP lawmakers in a frenzied sidestep to avoid siding with anything that could leave them cross with Trump.",
    "And it may well help push the Republicans back into the majority this year, much as the Tea Party helped it swing 63 House seats to the GOP.",
    "And the RNC seems, at least in their resolution, to have sided with Trump that those facing consequences remain in a crouch of victimhood.",
    "RNC Chair Ronna McDaniel tried to clean up the mess after the RNC vote, arguing the resolution was not about the violence at all.",
    "After all, the RNC is a parochial and byzantine organization made up of 168 members, three each from every state and territory.",
    "Trump has dangled, if he wins the White House in 2024, pardons to the more than 700 people arrested so far for their roles.",
    "Those mainstream voters may be on the fringes now, but movements often fade when a charismatic leader leaves the spotlight.",
    "Pew's polling last year said roughly two-thirds of Republicans said the party should not accept criticism of Trump.",
    "A full 71% of Republicans believe Trump to be the winner of the 2020 election, ABC's polling found last month.",
    "That's where things get tougher to square, at least for anyone who watched the Jan. 6 attacks in real time.",
    "The day itself was deadly and the aftermath continued to bring with it fatalities.",
    "In other words, the RNC wasn't striking out on its own here with the resolutions.",
    "Sign up here to get stories like this sent to your inbox every weekday.",
    "This article is part of the The DC Brief, TIME's politics newsletter.",
    "Fealty to Trump is now the position of the contemporary party.",
    "Liz Cheney and Adam Kinzinger crossed a line,? McDaniel said.",
    "Sign up for the daily D.C. Brief newsletter.",
    "Make sense of what matters in Washington.",
    "But yes, all of that happened.",
    "And one day, he will.",
    "Neither is true."
  ]
}