{
  "id": 583,
  "mediaId": 124,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "DeSantis refuses to take sides in Trump-Pence clash as 2024 speculation grows",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220207-ron-desantis-jm-1058-f8bc7a.jpg",
  "link": "https://www.nbcnews.com/politics/politics-news/desantis-refuses-take-sides-trump-pence-clash-2024-speculation-grows-rcna15185",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    1434,
    1710,
    2087,
    3094,
    428,
    2661,
    2788,
    2934
  ],
  "sentences": [
    "Facing re-election this year along with DeSantis, Sen. Marco Rubio on CBS's \"Face the Nation\" on Sunday refused to explicitly say whether he thought Trump was wrong, but he also signaled support for reforming the congressional process of certifying presidential elections.",
    "On Friday, the Republican National Committee referred to the Jan. 6 riot as legitimate political discourse? in a resolution to censure two congressional Republicans who voted for Trump's impeachment, Rep. Liz Cheney of Wyoming and Adam Kinzinger of Illinois.",
    "Though talk of a DeSantis-Trump feud has ebbed and flowed for months, both men say they have a good relationship  underscored by DeSantis's reticence in crossing Trump on the issue of Pence's power to interfere in the Jan. 6, 2021, tally.",
    "Meanwhile, a bipartisan congressional group is examining whether to reform the Electoral Count Act to make it clear that a vice president can't ignore state election results and to give the courts more say over the process in the end.",
    "Polls indicate that a significant portion of GOP primary voters nationwide believe the election was stolen  despite numerous audits, investigations and court cases that found no widespread fraud occurred to prevent Trump's victory.",
    "Former President Donald Trump has repeatedly insisted that Pence could have changed the outcome of the election by upending the congressional certification of the results, overturning President Joe Biden's win.",
    "Pressed by a reporter, DeSantis then changed the subject to say that he had a great working relationship? with the Trump administration during the two years his administration overlapped with it.",
    "While DeSantis was unwilling to comment this week on the Electoral College certification, he did touch on the issue during an interview with Fox News' Laura Ingraham days after the election.",
    "Trump, who has issued a steady stream of lies and misinformation about Pence's role and the 2020 election results, reacted to Pence's limited show of defiance by issuing two statements.",
    "As his stock has risen nationwide, DeSantis has raised money across the country for his re-election and often doesn't shy away from questions of concern to national Republicans.",
    "Mike Pence fires back at Trump: I had no right to overturn the election'\nFeb. 5, 202201:50\nTrump remains the odds-on favorite to win the GOP nomination if he runs again in 2024.",
    "Ron DeSantis declined on Monday to weigh in on one of the most divisive issues in the GOP: Could then-Vice President Mike Pence have overturned? the 2020 presidential election?",
    "Pence, who is also laying the groundwork for a presidential run, comes in third place in a crowded field that also includes Trump allies like Sen. Ted Cruz of Texas.",
    "The U.S. Constitution and the 1887 Electoral Count Act do not explicitly empower the Vice President to completely ignore certified election results from each state.",
    "The confirmation of Biden's win was delayed when a mob incited by Trump stormed the U.S. Capitol, some carrying along mock-gallows and shouting, \"Hang Mike Pence.\"",
    "In a second email, Trump denied he wanted the election overturned? but merely wanted Pence to reject votes from states he lost due to fraud  which no state found.",
    "Instead, he touted his state's laissez-faire approach to responding to the pandemic, an issue that helped make him a national political force in the GOP.",
    "I ? DeSantis told reporters at an immigration-related press event at the American Museum of the Cuban Diaspora in Miami, before cutting himself off.",
    "In that conversation, DeSantis suggested GOP-run state legislatures in Georgia or Pennsylvania could appoint an alternate slate of electors.",
    "On Friday, Pence rebutted his former boss, saying Trump was \"wrong\" to suggest he had the authority to change the outcome of the election.",
    "President Trump is wrong,? Pence said in his remarks in Orlando, Florida before the Federalist Society, a conservative legal group.",
    "Also on Friday, Pence publicly defended his decision to certify the election results because his role was merely ceremonial.",
    "DeSantis is a distant second, according to early primary polls, which show him leading the pack if Trump doesn't run.",
    "DeSantis isn't the only Florida Republican to avoid crossing Trump on the issue of the Jan. 6, 2021, certification.",
    "The position is in keeping with the opinion of nearly every mainstream nonpartisan constitutional law expert.",
    "The issue of formally approving the election results has taken on an added sense of urgency in the past week.",
    "Vice presidents can't simply decide not to certify an election,? Rubio added.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "I had no right to overturn the election.?\nDeSantis also addressed the group.",
    "The attack led to Trump's second impeachment, for which he was acquitted.",
    "Neither state did and Biden won both, catapulting him to the presidency.",
    "And he then criticized the Biden White House for obstructing his agenda.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "In one, Trump admitted he wanted Pence to overturn? the election.",
    "Asked Monday with whom he sides, DeSantis wouldn't say.",
    "MIAMI  Eyeing a possible White House bid, Florida Gov.",
    "But he did not bring up the certification then either.",
    "I'm not."
  ]
}