{
  "id": 586,
  "mediaId": 151,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "Mask wars claim another pol",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/02/07/mask-wars-claim-another-pol-00006113",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1394,
    1646,
    2095,
    2186,
    2455,
    3094,
    4325,
    428,
    2672,
    2813,
    2834,
    2945
  ],
  "sentences": [
    "The account provides one of the most detailed descriptions yet of a meeting that is now being scrutinized by federal prosecutors and the U.S. House committee investigating last year's riot at the U.S. Capitol.?\nDAY IN COURT  Rep. Jeff Fortenberry (R-NE) is claiming he was confused by FBI agents, rather than lying to them, and wants to bring an expert to testify about memory problems in older adults during his court case, the Omaha World-Herald's Todd Cooper reported.",
    "His lawyers are seeking to have the congressman's full statement to the FBI played for jurors  both to show the repetitive questioning of government agents and the idea that Fortenberry was simply confused, rather than lying to agents.?\nSTAFFING UP  The Democratic Attorneys General Association announced Executive Director Sean Rankin has been elevated to president as part of the association's transition to a new leadership model.",
    "Days until the Texas primary: 22\nDays until the CA-22 special election primary: 57\nDays until the Indiana and Ohio primaries: 86\nDays until the general election: 274\nDays until the 2024 election: 1,002\nTopLine\nNO ONE CARED WHO I WAS UNTIL I TOOK OFF THE MASK  It's February 2022, and face coverings are still a political flashpoint between Democrats and Republicans on the campaign trail.",
    "The RNC censured Reps. Liz Cheney and Adam Kinzinger and deemed Jan. 6 legitimate political discourse.?\nFor all the energy he creates at the party's grassroots,? Trump's stranglehold on the party is emerging as one of the biggest threats to the GOP's otherwise bright prospects in November,? David and Natalie wrote.",
    "So far, thousands of voters have had their vote-by-mail applications flagged for rejection because the ID number on their application didn't match what's on their voter registration.?\n New Hampshire state lawmakers rejected a bill that called for a statewide audit of the 2020 election, WMUR's Adam Sexton reported.",
    "Mask wars claim another pol\nBy STEPHANIE MURRAY\n02/07/2022 10:00 AM EST\nPresented by PREMION\nQuick Fix\n Georgia Democrat Stacey Abrams is the latest politician to land in hot water over a maskless photo, as Covid-19 restrictions remain a campaign issue two years into the pandemic.",
    "Down the Ballot\nTRUMP CARD  Trump's grip on the Republican Party was clear at the RNC's Winter Meeting in Salt Lake City, where the GOP censured two of its own members and sought to recast the Jan. 6 attack on the Capitol, POLITICO's David Siders and Natalie Allison reported.",
    "CODA  HEADLINE OF THE DAY  New York mayor holds court in swanky restaurant alongside friend with checkered past?  POLITICO\nFollow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "The Republican-backed legislation requires the ID number on a vote-by-mail ballot and the ballot application to match the ID number the voter used to register to vote, which could be a driver's license or Social Security number, KUT's Ashley Lopez reported.",
    "HINDSIGHT IS 2020  Republicans who posed as presidential electors in Wisconsin in 2020 were accompanied by armed security and met secretly, Milwaukee Journal Sentinel's Patrick Marley wrote, according to a podcast interview from one of the participants.",
    "The proposed legislation, which was deemed inexpedient to legislate? by the state House Election Law Committee, would have the state hire a third party to conduct a forensic audit of 2020 election ballots, and cover the cost through private donations.",
    "Deputy Executive Director and Chief of Staff Michelle Ortiz has been elevated to executive director, and Jonathan Sclarsic will become the organization's first-ever chief operating officer and general counsel.",
    "Pandemic-era precautions like face masks, and whether politicians are adhering to them, are still a campaign issue more than two years after the first Covid-19 case was detected in the United States.",
    "The latest photos Abrams was tagged in on Instagram on Sunday night were memes featuring the maskless photo, and the first page of her Google search results were headlines about the incident.",
    "Cuomo has been attempting to determine the right forum for a speech or appearance that would mark his return to public life, according to the people close to him,? according to the Journal.",
    "Newsom, a pioneer of the politicians getting busted for breaking Covid rules? trope, defended himself by saying he took the mask off for a brief second,? POLITICO's Susannah Luthi wrote.",
    "THE KEYSTONE STATE  The Pennsylvania state Republican Party will not endorse a candidate in the closely watched primaries for Senate and governor, POLITICO's Holly Otterbein reported.",
    "Abrams and the principal removed their posts promoting the photo, and Abrams fired back in a statement calling their attacks as pitiful and predictable.? The damage was already done.",
    "And if you stand up to them, they'll get you fired from your job.?\n Nebraska gubernatorial candidate Charles Herbster is airing a new TV spot that highlights his Trump endorsement.",
    "Murkowski pledged to endorse Manchin if he runs for reelection in 2024.\n Progressive group Our Revolution will endorse Ohio Democrat Nina Turner during an organizing call tonight.",
    "BALLOT BATTLE  High courts in Pennsylvania and Wisconsin are hearing major cases that could curtail mail voting ahead of the midterms, POLITICO's Zach Montellaro reported.",
    "The school's principal shared a photo of Abrams sitting with a group of masked kids with her face uncovered, The Atlanta Journal-Constitution's Greg Bluestein reported.",
    "Youngkin recently issued an executive order allowing parents to opt out of school mask mandates, but it's been halted by a judge, according to The Associated Press.",
    "In posing for the photo, Abrams handed her Republican opponents some fresh material for their campaign ads, as POLITICO's Alex Thompson pointed out on Twitter.",
    " Former President Donald Trump's hold on the GOP was clear during the RNC Winter Meeting over the weekend, and it could make the midterms dicier for the party.",
    "In Pennsylvania, the legal challenge went bigger, throwing out the state's relatively new law allowing anyone to vote by mail without an excuse,? Zach wrote.",
    "Our leaders tell us that our country is racist to the core, that looting and burning down cities is normal and there are 50 genders,? James says in the ad.",
    "The Team PAC ad paints Schmitt as good for China, bad for Missouri.?\n Alabama Republican Tim James is up with a new ad for his campaign against GOP Gov.",
    "FIRST IN SCORE: POLL POSITION  Rep. Ashley Hinson is narrowly leading Democrat Liz Mathis in IA-02, according to an internal poll from Mathis' campaign.",
    "Republican activists voted against making state party endorsements in either of the crowded contests at a meeting over the weekend, an unusual move.",
    "Fourteen New Yorkers filed a lawsuit Thursday in state court against Hochul, Democratic lawmakers and the state board of elections, among others.",
    "Kids are locked out of school, locked out of learning, locked out of their childhood,? the group wrote in a tweet promoting the 30-second spot.",
    "ENDORSEMENT ALERT  Sen. Joe Manchin (D-W.Va.) crossed the aisle to endorse Sen. Lisa Murkowski for reelection during a joint interview on CNN.",
    "It is on TV in Detroit, Denver, Minneapolis and D.C., and will air during The View, Good Morning America, CBS This Morning and the Olympics.",
    "Pittsburgh, once on the party's shortlist, has lost steam, while officials have plans to visit Nashville and Milwaukee in the coming weeks.",
    " The North Carolina state Supreme Court struck down the state's GOP-drawn congressional map, deeming it an illegal partisan gerrymander.",
    "Celebrities and media personalities and hypocritical politicians are partying like it's 2019.? The ad is part of a six-figure campaign.",
    "THE MAP LINES  The North Carolina state Supreme Court struck down the state's new congressional map, POLITICO's Ally Mutnick reported.",
    "Hinson and Mathis, both former TV news broadcasters, are running for a swing seat which became slightly more red during redistricting.",
    "The court ruled the map, which would give Republicans 11 of the state's 14 congressional seats, was an illegal partisan gerrymander.",
    "GETTING IN  Rhode Island Democrat Michael Neary is running to replace retiring Rep. Jim Langevin (D-R.I.) WPRI's Ted Nesi reported.",
    "Sixty-four percent of Americans are fully vaccinated, while the latest virus surge just pushed the U.S. death toll over 900,000.",
    "Murkowski, a top Trump enemy, is facing a challenge from Republican Kelly Tshibaka, who was endorsed by the former president.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "Picking up on the trend, center-right group N2America released an ad focused on Covid-19 precautions for school children.",
    "Brian Kemp and primary challenger former Sen. David Perdue (R-Ga.) hammered Abrams as a hypocrite for removing her mask.",
    "Abrams, who is running for governor, attended a Black History Month reading event with school children several days ago.",
    "Arkoosh, who struggled in polling and fundraising, came in fourth place in a recent vote by the state Democratic Party.",
    "Gavin Newsom got caught violating Los Angeles County's mask mandate via a post on Magic Johnson's Instagram last week.",
    "Glenn Youngkin was confronted in a grocery store in Alexandria for not wearing a mask, WUSA's Matthew Torres reported.",
    " Speaking of the RNC, Nashville is emerging as a top contender to host the party's 2024 convention, Natalie reported.",
    "The Public Policy Polling survey showed Hinson with 43 percent of support, and Mathis with 42 percent of support.",
    " Trump political adviser Susie Wiles is joining public strategy firm Mercury, POLITICO's Alex Isenstadt reported.",
    "Turner is challenging Rep. Shontel Brown (D-Ohio), after losing to her in a special election last year in OH-11.",
    "DROPPING OUT  Pennsylvania Democrat Val Arkoosh ended her Senate campaign, POLITICO's Holly Otterbein reported.",
    "Los Angeles Mayor Eric Garcetti and San Francisco Mayor London Breed were also shown maskless in the photos.",
    "Eric Greitens in the GOP Senate primary is airing an attack ad against state Attorney General Eric Schmitt.",
    " A new Texas law could cause the number of rejected mail-in ballots to go up in the state's March primary.",
    "You'll also receive daily policy news and other intelligence you need to act on the day's biggest stories.",
    "In Wisconsin, a judge in January ruled in favor of banning drop boxes for the return of absentee ballots.",
    "Andrew Cuomo is plotting his return to public life, The Wall Street Journal's Jimmy Vielkind reported.",
    "The association also hired Britteny Jenkins as policy director and JP Boyle as development director.",
    "The lawsuit slams the new congressional districts as ?blatantly gerrymandered? to benefit Democrats.",
    "Wiles will continue working for Trump's political operation, Save America, she wrote in an email.",
    "Read the room, buddy,? a woman said to Youngkin, after asking where his mask was in the store.",
    "Georgia Democrat Stacey Abrams is the latest politician under fire for posing without a mask.",
    "Kay Ivey, in which he says the way the country is portrayed on television is unrecognizable.",
    "Sclarsic serves as legislative director and general counsel in Sen. Amy Klobuchar's office.",
    "Abrams wore a mask during the visit and removed it for photos, according to her campaign.",
    "Kathy Hochul signed into law last week, The Associated Press' Marina Villeneuve reported.",
    "Fortenberry is accused of lying to the FBI and accepting illegal campaign contributions.",
    "The state Democratic Party opted against endorsing a Senate candidate last month.",
    "The ruling reverses a decision by a lower court last month to let the map stand.",
    " New York Republicans are suing over the new congressional map Democratic Gov.",
    "Cuomo may even be weighing a run against state Attorney General Tish James.",
    "Email me at smurray@politico.com and follow me on Twitter @stephanie_murr.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "Herbster is running in a crowded GOP primary to replace term-limited Gov.",
    "Cuomo resigned last year amid allegations of sexual misconduct.",
    "ON THE AIRWAVES  A super PAC supporting former Missouri Gov.",
    "State lawmakers have until Feb. 18 to propose a new plan.",
    "Neary previously worked for former Ohio GOP Gov.",
    "Neary is the fifth Democrat to enter the race.",
    "Want to receive this newsletter every weekday?",
    "Meanwhile on the West Coast, California Gov.",
    "It's not just Democrats facing criticism.",
    "Fifteen percent of voters were undecided.",
    "WHERE ARE THEY NOW  Former New York Gov.",
    "John Kasich's presidential campaign.",
    "The blowback was swift anyway.",
    "Subscribe to POLITICO Pro.",
    "Good Monday morning.",
    "Pete Ricketts.",
    "Virginia Gov.",
    "GOP Gov."
  ]
}