{
  "id": 587,
  "mediaId": 195,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "The Hill's Morning Report - Presented by Facebook - Anticipating an invasion of Ukraine 'any day'",
  "image": "https://thehill.com/sites/default/files/newsletter-open_020722ap.jpg",
  "link": "https://thehill.com/homenews/morning-report/593063-the-hills-morning-report",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger",
  "termIds": [
    1914,
    2030,
    2087,
    2392,
    3094,
    177,
    2721,
    2744,
    2888,
    2942
  ],
  "sentences": [
    "Ambassador to the United Nations Linda Thomas-Greenfield said the administration is still working to discourage the Russians from making the wrong choice and choosing confrontation.?\nA U.S. Air Force plane carrying U.S. troops and equipment from Fort Bragg, N.C., arrived in Poland on Sunday (pictured above), part of Biden's deployment of 1,700 soldiers to Poland to support NATO, in addition to the 4,000 troops already there.",
    "Williams went above and beyond for a teenage passenger, whom he had picked up at Washington, D.C.'s Union Station to transport to Williamsburg, Va. Williams got lucky and found a way to turn around amid the icy gridlock to head back to the nation's capital, where he paid the cost of a hotel room for his passenger after making sure she phoned her parents to explain the predicament (WTOP).",
    "President Biden again told Americans that vaccinations, including for eligible children, and booster doses can save your life and the lives of those you love.?\nAs of today, 74.9 percent of the U.S. population has received at least one dose of a COVID-19 vaccine and 63.5 percent is fully vaccinated,? according to the Bloomberg News global vaccine tracker and the government's definition.",
    "Madness and scaremongering,? responded Russia's deputy ambassador to the United Nations, Dmitry Polyanskiy, in a tweet dismissing information the Biden administration reportedly briefed to members of Congress warning that a full-fledged Russian invasion could lead to the quick capture of Kyiv in Ukraine and potentially result in as many as 50,000 casualties (The Washington Post).",
    "Marc Short, Pence's chief of staff at the end of the Trump administration, told NBC's Meet the Press? on Sunday that the former VP gave a more direct rebuke of Trump's election claims because the continued comments \"merited response.? In that response, Pence said in a speech on Friday that Trump was wrong? and that he had no authority to reject the 2020 electoral results.",
    "THE CLOSER\nAnd finally  The Ellen DeGeneres Show? and its sponsor surprised Washington-D.C.-area Uber driver Davante Williams with a $10,000 check a few days ago as a reward for kindness after learning he got stuck for more than five hours in the Jan. 4 traffic jam that stretched for many miles on Interstate 95 in Virginia.",
    "The practice has ended in controversial shooting deaths of Black people inside their homes, often when they are or have been asleep, and some federal and state lawmakers have introduced legislation that would curtail no-knock warrants by adding restrictions and detailed requirements (Congressional Research Service report).",
    "? STATE WATCH & CLIMATE: In California, economic justice advocates are pitted against the state's solar industry over a postponed state proposal that would lower the incentives that homeowners receive for generating their own solar power and charge them to connect to the electric grid (The Hill).",
    "Among other things, the proposal would make clear that the vice president has zero power to reject a state's slate of electors, make clear that state legislatures are unable to appoint electors post-Election Day and allow states to have more time to carry out recounts (The New York Times).",
    "Alarmed and determined to keep diplomacy alive amid speculation that Putin is looking to gain something tangible from NATO while perhaps averting a punishing clash, European leaders plan this week to keep up a parade of meetings and conversations with the inscrutable Russian leader.",
    "Ahead of French elections in two months, events have handed Macron an opportunity to step into a larger leadership role for all of Europe and to define his at times grandiose visions for a Europe allied with, but more independent of, the United States (The New York Times).",
    "U.S. National Security Council Director Jake Sullivan said, If war breaks out, it will come at an enormous human cost to Ukraine, but we believe that based on our preparations and our response, it will come at a strategic cost to Russia as well? (The Associated Press).",
    "The president today meets at the White House with German Chancellor Olaf Scholz, who is drawing sharp criticism at home and abroad for his hesitant leadership during one of the most serious security crises in Europe since the end of the Cold War (The New York Times).",
    "Western governments assess that Russia has assembled at least 70 percent of the military firepower it likely intends to have in place by mid-month to give President Vladimir Putin the option of invading Ukraine (frontline in the Luhansk region pictured below).",
    "Minneapolis Mayor Jacob Frey (D) announced Friday the city would suspend the use of no-knock warrants after an officer on Wednesday fatally shot Amir Locke, 22, who was not named in the warrant and was asleep on a sofa with a gun he was licensed to possess.",
    "LEADING THE DAY\nPOLITICS: Top Republicans on Sunday came to the defense of former Vice President Mike Pence amid his escalating feud with former President Trump over his refusal to participate in an attempt to overturn the 2020 election on Jan. 6, 2021.",
    "Negotiations are very vigorous and I think we're going to get agreement on the topline and how it will be spent, but it's not there yet.?\nAccording to Punchbowl News, the short-term bill is likely to keep the current spending levels through mid-March.",
    "In South Africa, an mRNA-based COVID-19 vaccine produced at the World Health Organization-backed vaccine hub could take up to three years to get approval if companies do not share their technology and data, a WHO official said on Friday (Reuters).",
    "The RNC said the panel is involved in the persecution of ordinary citizens engaged in legitimate political discourse.?\nThe RNC sought to recast rioters who breached the Capitol, sought to halt the certification of an election and injured police.",
    "Declining community COVID-19 infection rates may encourage schools in some locations to lift mask requirements based on improved public health data, former Food and Drug Administration head Scott Gottlieb told CBS News on Sunday (The Hill).",
    "However, Manchin gave Schumer cover on Sunday, telling CNN that he's talked to the Democratic leader in recent days about that and everything,? referring to whether the New York Democrat would support him in 2024 against a primary opponent.",
    "Speaker Nancy Pelosi (D-Calif.), Schumer, congressional leaders and lawmakers will hold a moment of silence on the East Front Steps of the Capitol at 7 p.m. for the more than 900,000 people who've died in the United States due to COVID-19.",
    "While Biden is with Scholz today, French President Emmanuel Macron will take his shuttle diplomacy to Moscow to meet with Putin before traveling to Kyiv in an effort to avert a potentially imminent war that threatens security in Europe.",
    "His decision not to weigh in reflects a balancing act: not wanting to upset the left-wing of the party while also not trying not to alienate the two centrists who remain crucial to passing Biden's agenda for the rest of this year.",
    "> Dem doldrums: Senate Majority Leader Charles Schumer (D-N.Y.) may be focused on 2022, but the Democratic leader already has himself a 2024 problem as progressives and Democratic activists grow louder with calls to primary Sens.",
    "Russia could invade Ukraine any day,? according to President Biden's national security adviser, who spoke Sunday during television interviews to point to intelligence assessments of Russia's preparations for an all-out conflict.",
    "With those words, Elizabeth sought to answer once and for all public questions about the status of Camilla, 74, who was initially shunned by fans of the late Princess Diana, Charles's first wife (The Associated Press).",
    "Scholz, who has not spoken to his Russian counterpart since taking office two months ago, will next week meet with Ukrainian President Volodymyr Zelensky in Kyiv, followed by Putin in Moscow on Feb. 15 (Politico).",
    "IN FOCUS/SHARP TAKES\nCORONAVIRUS: Mid-February is almost here  a predicted spring before spring when omicron is anticipated by public health soothsayers to recede and life amid a pandemic is projected to bloom.",
    "COVID-fatigue risks lulling Americans into apathy  or worse  when a future coronavirus variant of concern might revive mask mandates, quarantine periods and orders to restrict the size of indoor gatherings.",
    "https://bloom.bg/34Ep1eZ\nA MESSAGE FROM FACEBOOK\nWhy Facebook supports updated internet regulations, including Section 230\nAaron is one of 40,000 people working on safety and security issues at Facebook.",
    "As The Hill's Aris Folley writes, a number of sticking points stand between members and a final deal, including the topline total, the disparity between defense and nondefense spending, and the timing.",
    "Blinken will embark on a trip to confer with officials in Australia, Fiji, and in Hawaii for a trilateral conference with Japanese and South Korean counterparts before a Sunday return to Washington.",
    "Hear more from Aaron on why Facebook supports updating regulations on the internet's most pressing challenges, including reforming Section 230 to set clear guidelines for all large tech companies.",
    "Hear more from Aaron on why Facebook supports updating regulations on the internet's most pressing challenges, including reforming Section 230 to set clear guidelines for all large tech companies.",
    "on Sunday said that lawmakers will likely have to pass a stopgap spending bill to fund the government by Feb. 18 in bid to give them more time to reach a larger, long-term funding agreement.",
    "The monarch expressed a sincere wish? that Prince Charles's wife, Camilla, Duchess of Cornwall, should be known as Queen Consort? when her 73-year-old son one day succeeds her, as expected.",
    "It will probably be a short-term CR and it will be this coming week to give us a little more time,? Hoyer told MSNBC's Sunday Show,? using the shorthand phrase for a continuing resolution.",
    " In Northeast states, a recent bomb cyclone? caught everyone's attention with record snow accumulation, power outages, travel and transit disruptions and at least four deaths in New York.",
    "As The Hill's Alexander Bolton notes, Schumer has twice been asked about supporting primaries against the foremost centrist members in his caucus, having dodged the question both times.",
    "Nonetheless, the Centers for Disease Control and Prevention, wary of jumping the gun, points to record deaths and high hospitalization rates as rationales for continued public caution.",
    "They will hold a joint news conference in the East Room at 3:15 p.m.\nSecretary of State Antony Blinken at 8:45 a.m. meets with Josep Borrell, vice president of the European Commission.",
    "Citing ample supplies, CVS and Walgreens pharmacies this week are no longer limiting the number of at-home COVID-19 test kits customers may purchase at one time (The New York Times).",
    "> Election reform: Manchin was adamant on Sunday that a legislative overhaul to the Electoral Count Act of 1887 will pass through Congress as bipartisan support for the change grows.",
    "A MESSAGE FROM FACEBOOK\nWhy Facebook supports updated internet regulations, including Section 230\nAaron is one of 40,000 people working on safety and security issues at Facebook.",
    "The Hill's Peter Sullivan reports on the intense push public officials are feeling to lift mandates and restrictions as omicron infections continue to ebb in 49 of 50 states.",
    "The White House daily press briefing is scheduled at 1:45 p.m.\nHill.TV's Rising? program features news and interviews at http://thehill.com/hilltv or on YouTube at 10:30 a.m.",
    "The New York Times: Biden will press Scholz on Russia sanctions and likely discuss the $11 billion Nord Stream 2 natural gas pipeline being built between Germany and Russia.",
    "Blinken and Energy Secretary Jennifer Granholm will host Borrell and European Commissioner for Energy Kadri Simson at 9:30 a.m. during a U.S.-EU Energy Council ministerial.",
    "? POLICING: Controversy simmered over the weekend about no-knock warrants issued by judges and used by police to enter properties without first announcing police presence.",
    "Canada: Protests against vaccine mandates continued to cripple Ottawa on Sunday as police were outnumbered and gridlock clogged parts of the city for a 10th day (Reuters).",
    "The president and Vice President Harris will receive the President's Daily Brief at 10:15 a.m. Biden will meet with the German chancellor at 1:30 p.m. in the Oval Office.",
    "Lawmakers in both congressional chambers have four working days to nail down a deal, with the House and Senate both out of town next week for the President's Day recess.",
    "Chris Christie (R), who has increasingly aired criticism of the ex-president and is eyeing a possible 2024 presidential run, called the resolution a mistake (The Hill).",
    "ELSEWHERE\n? OLYMPICS: At the Beijing Winter Olympic games, Russian Olympic Committee athletes have an early lead in the medal count, winning six (two golds) thus far.",
    "Some legal experts continue to argue that no-knock warrants issued by judges and used by police occur under little regulation, supervision or civil rights oversight.",
    "Sen. Marco Rubio (R-Fla.) told CBS's Face the Nation? that vice presidents can't simply decide not to certify an election? (The Hill) Sen. John Barrasso (R-Wyo.",
    "Meanwhile, lower court judges are weighing Biden administration COVID-19 mandates including those applied to federal contractors and government workers.",
    "CNN: Biden, during a Sunday phone conversation with Israeli Prime Minister Naftali Bennett, said he looks forward to visiting Israel later this year.",
    "Russia is experiencing a surge in COVID-19 infections in which positive rates are 10 times higher than reported a month ago (The Associated Press).",
    "Five nations (Netherlands, Canada, Japan, Italy and Austria) have collected four medals, with the U.S. trailing with three total (and no gold).",
    "If we don't take the off-ramps, nobody will listen when we need to have an on-ramp,? said Jeremy Faust, a professor at Harvard Medical School.",
    "The Republican National Committee continued to receive criticism for adopting a resolution on Friday that censures GOP Reps. Liz Cheney (Wyo.)",
    "The legislation would do away with a law that Trump and his supporters used in an attempt to overturn the 2020 presidential election results.",
    "), a member of Senate GOP leadership, added that Pence had a constitutional duty? to follow through with electoral certification (The Hill).",
    "The federal government will shutter on Feb. 18 without new funding, and lawmakers are scheduled to be out of Washington beginning next week.",
    "The secretary at 3:30 p.m. will meet virtually with Australian Foreign Minister Marise Payne and British Foreign Secretary Elizabeth Truss.",
    "Australian Prime Minister Scott Morrison on Sunday signaled that reopening his country's borders to tourists is not far away? (Reuters).",
    "Axios: GOP's shadow Jan. 6 committee targets Capitol Police negligence.?\nReid Wilson, The Hill: On The Trail: The new American malaise.",
    "First lady Jill Biden at 9:15 a.m. will deliver remarks at the 2022 Community College National Legislative Summit in Washington, D.C.",
    "Absolutely, it will pass,? Manchin told CNN's State of the Union? during a joint interview alongside Sen. Lisa Murkowski (R-Alaska).",
    "https://nyti.ms/34FkHMz\nAfter crypto's cold winter, expect springtime for web 3.0, by Niall Ferguson, columnist, Bloomberg Opinion.",
    "https://on.wsj.com/332ZnAp\nThe COVID-19 policy that really mattered wasn't a policy, by Ezra Klein, columnist, The New York Times.",
    "U.S. viewership for the opening ceremony of the Winter Olympics in Beijing, televised by NBC, hit a record low (Yahoo Sports).",
    "Of course there's nothing in the 12th Amendment or the Electoral Count Act that would afford a vice president that authority.",
    "Negotiators have been eyeing an omnibus spending package to fund the government through late September when fiscal 2022 ends.",
    "A police raid under a similar no-knock warrant in Louisville two years ago resulted in the shooting death of Breonna Taylor.",
    "The Hill: Sen. Joe Manchin (D-Va.): Social spending bill elements must go through time-consuming committee process.",
    "and Adam Kinzinger (Ill.) for their roles on the House select committee probing the Jan. 6 attack on the Capitol.",
    "Ratings and ad revenues are iffy for the network's two major winter sporting extravaganzas this year (Forbes).",
    "The answer in New York, for instance, may ride on whether infection rates continue to plummet (New York Post).",
    "At least 725 of the insurrectionists have been charged with serious crimes, including seditious conspiracy.",
    "NBC is also carrying the Super Bowl on Sunday, which for the first time overlaps with the Winter Olympics.",
    "Climate change experts believe warming oceans can lead to more intense such weather conditions (The Hill).",
    "We get you up to speed on the most important developments in politics and policy, plus trends to watch.",
    "Here's what else we're watching this week:\n> Can the House fund the government in the next four days?",
    "He added that RNC Chairwoman Ronna McDaniel is carrying water? for Trump in the process (The Hill).",
    "The New York Times: In scrutinizing Trump and his allies, Jan. 6 panel adopts prosecution tactics.",
    "? INTERNATIONAL: Queen Elizabeth II, 95, on Sunday quietly marked 70 years on the British throne.",
    "We invite you to share The Hill's reporting and newsletters, and encourage others to SUBSCRIBE!",
    "It's why no vice president in 200 years has ever used that authority,? Short said (The Hill).",
    "Sweden, which knows its way around winter sports, leads with three gold medals (NBC Sports).",
    "Blinken and Borrell will hold a joint news conference at noon at the State Department.",
    "Ron DeSantis (R) tensions shadow this year's Conservative Political Action Conference.",
    "Jordain Carney, The Hill: Trump, hurdles loom for Senate election reform talks.",
    "The Morning Report is created by journalists Alexis Simendinger and Al Weaver.",
    "OPINION\nMike Pence's Constitution, by The Wall Street Journal editorial board.",
    "Please recommend the Morning Report to friends and let us know what you think.",
    "The percentage of Americans who have received third or booster doses is 26.8.",
    "Total U.S. coronavirus deaths surpassed another dismal milestone late Friday.",
    "High-profile GOP figures also provided backup for the former vice president.",
    "Trump was not the only GOP figure or entity under the microscope on Sunday.",
    "Oh, gosh, I'm just overwhelmed,? Williams said when handed a check on TV.",
    "Bloomberg News: Beijing Olympics may impact Putin's thinking (or timing).",
    "> Will more COVID-19 restrictions get lifted this week in some states?",
    "Bloomberg News: Manchin endorses Murkowski in Alaska Senate race.",
    "GOP rivals seize on Stacey Abrams's maskless classroom photo.",
    "Readers can find us on Twitter @asimendinger and @alweaver22.",
    "The Hill: Jan. 6 panel hesitates in asking Pence to testify.",
    "Presented by Facebook\nWelcome to The Hill's Morning Report.",
    "*****\nCONGRESS: House Majority Leader Steny Hoyer (D-Md.)",
    "The Sunday Shows: Trump-Pence division in the spotlight.",
    "Email: asimendinger@thehill.com and aweaver@thehill.com.",
    "Politico: Retiring Senate spending chiefs go for broke.",
    "Alexis Simendinger and Al Weaver are the co-creators.",
    "This morning the number of lives lost is 902,624.",
    "Kyrsten Sinema (D-Ariz.) and Manchin next cycle.",
    "The Hill: Fighting for relief for Black farmers.",
    "Former Trump adviser and former New Jersey Gov.",
    "If lawmakers do not, alarm bells will be loud.",
    "The Wall Street Journal has a roundup report.",
    "WHERE AND WHEN\nThe House meets at noon.",
    "Well, we'll get something done.",
    "The Hill: Trump, Florida Gov.",
    "The Senate convenes at 3 p.m.",
    "It's also Super Bowl week!",
    "We want to hear from you!",
    "ET at Rising on YouTube.",
    "CLICK HERE to subscribe!",
    "The Washington Post.",
    "The Hill: U.S.",
    "It is Monday!",
    "> Tuned out?",
    "..."
  ]
}