{
  "id": 591,
  "mediaId": 187,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "Trump Is Obsessed With Being a Loser",
  "image": "https://cdn.theatlantic.com/thumbor/59zr-24iVhOqOKnY4-74DXkAdQI=/0x0:2000x1125/1952x1098/media/img/mt/2022/02/Atl_Trump_L_copy/original.jpg",
  "link": "https://www.theatlantic.com/ideas/archive/2022/02/trump-obsessed-being-loser-2020-election/621505/",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Wehner",
  "authorUrl": "https://www.theatlantic.com/author/peter-wehner/",
  "termIds": [
    707,
    1147,
    1248,
    1434,
    1685,
    1729,
    2214,
    3094,
    173,
    428,
    2945
  ],
  "sentences": [
    "Amanda Carpenter, who once worked for Senator Ted Cruz, put it well: The fact the RNC is censuring Cheney and Kinzinger for investigating January 6 and not condemning Trump for causing January 6 is absolutely demented.?\nEven The Wall Street Journal editorial page felt compelled to issue this warning: Republicans should not get within 10 miles of defending the Capitol riot.",
    "McDaniel's words were echoed in the censure, which accused Cheney and Kinzinger of participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse.?\nEven in a Trump-led party, it is stunning that Republican leaders would seek to whitewash a violent attack on the Capitol to overturn a presidential election.",
    "Donald Trump has made clear time and time again that, in his view, the worst thing that can happen to a person is to be judged a loser.? In the 2020 presidential election he was, in fact, a loser, but his narcissism and the incredibly fragile self-esteem that undergirds it won't allow him to accept that reality.",
    "In a speech, he indicated that if he were to become president again, he'd likely pardon the people who on January 6, 2021, violently stormed the Capitol to stop the certification of the election, part of his ongoing effort to turn insurrectionists and those charged with seditious conspiracy into martyrs.",
    "He has spent the past 15 months attempting to overthrow the election in an effort to make himself the winner and, after that effort failed, rewriting the narrative, portraying himself as a victim of THE CRIME OF THE CENTURY.?\nAlmost every public comment Trump makes these days is focused on the election.",
    "As Shane Goldmacher and Maggie Haberman of The New York Times put it, the Republican Party is very much still Mr. Trump's, transforming his lies about a stolen 2020 election into an article of faith, and even a litmus test that he is seeking to impose on the 2022 primaries with the candidates he backs.",
    "He is the party's most coveted endorser, its top fund-raiser and the polling front-runner for the 2024 presidential nomination.?\nThe Trump era has conditioned many in the Republican Party to think like he doesand those who don't are too afraid to speak out against his malicious transgressions.",
    "As Mark Landler, the Times' London-bureau chief, has noted, Tory members of Parliament have been far more critical of Prime Minister Boris Johnsonwho didn't incite an attack on the House of Commons but did host drinking parties during lockdownthan Republicans have been critical of Trump.",
    "Even Republican Senator Susan Collins of Mainewho voted to impeach Trump, who represents a blue state, who isn't up for reelection for four years, and who clearly views Trump as a threat to American democracybobbed and weaved when she was asked if she would support Trump in 2024.",
    "I've sensed lately that some people on the rightindividuals who defended Trump at virtually every turn in his presidency but knew privately, deep in their heart, that they had made moral accommodations they weren't proud ofwish the rest of us would just move on from Trump.",
    "I discuss Trump in psychological terms because I have said for a half-dozen yearsand previously in these pagesthat the most important thing to understand about Trump is his disordered personality; it's the only way to even begin to think about how to deal with him.",
    "What is to be gained by the RNC's indulgence of President Trump's vendettas?? The answer, of course, is that they may be true believersand even if they aren't, they understand, perhaps better than The Journal's editorial writers, what MAGA world is demanding.",
    "As if to prove that the GOP is now an instrument of Trump's obsession, late last week Republican leaders meeting in Salt Lake City censured Representative Adam Kinzinger and Representative Liz Cheney because of their work on the January 6 committee.",
    "Trump seems unable to incorporate anything critical about himself, hence his need to create an imaginary world in which he really won the 2020 election but was the victim of a conspiracy that borders on intergalactic.",
    "A wise conservative friend of mine who is a critic of the left recently told me, At the elite level, the Republican Party is much worse than the Democratic Party when it comes to the health of American democracy.",
    "Another reason Trump's mindset matters is that millions of his followerspassionate, committed, incensed, aggrieved, and absolutely sure they are right and righteoushave entered his hall of mirrors.",
    "For one thing, there is no persecution?to use the language from the RNC resolutionby the January 6 congressional committee aimed at people who gathered peacefully before the assault on the Capitol.",
    "Cheney and Kinzinger engaged in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse,? the Republican National Committee's chair, Ronna McDaniel, said.",
    "He writes widely on political, cultural, religious, and national-security issues, and he is the author of The Death of Politics: How to Heal Our Frayed Republic After Trump.",
    "But unfortunately, Trump and MAGA world had something different in mindundermining trust in our elections, storming the Capitol, propagating malicious and destructive lies.",
    "And in a resolution in which the events of January 6 were central, the RNC did not see fit to say a single critical word about the violent mob that stormed the Capitol.",
    "To put this indulgence? in perspective, contrast the behavior of the Republican Party in the United States with the Conservative Party in the United Kingdom.",
    "He's performed a moral inversion in which the supporters who stormed the Capitol are the true patriots; they, like he, are being unfairly persecuted.",
    "McDaniel's insistence, after a great deal of blowback, that legitimate political discourse? referred only to nonviolent protesters isn't convincing.",
    "But he is still far and away the dominant figure in the GOP and, at this juncture at least, its mostly likely presidential nominee in 2024.",
    "About the author: Peter Wehner is a contributing writer at The Atlantic and a senior fellow at the Ethics and Public Policy Center.",
    "The Tory party understands the distinction between partisan loyalty and craven, unpatriotic fealty; the Republican Party does not.",
    "America's 45th president said in a statement last week that his vice president, Mike Pence, should have overturned? the election.",
    "He also warned that he would incite unrest if prosecutors who are investigating him and his businesses took action against him.",
    "There is now an entire media industryRight Wing Inc.built around the distorted and disturbed mind of Donald J. Trump.",
    "It is led by, and defined by, Trump, who wants to attack our institutions at every level.?\nSo he does, and so he has.",
    "For another, Trump's dangling of a pardon could apply only to those who were arrested for attacking the Capitol.",
    "They are the defenders of democracy; the people who are holding them accountable are the enemies of America.",
    "Trump was dangerous, his mind disordered, before; he's more dangerous, his mind more disordered, now.",
    "Media coverage of the former president brings to the foreground the cost of their Faustian bargain.",
    "It's true that his hold on the party has weakened some since he left office; that was inevitable.",
    "The Republican National Committee also announced that it would fund Cheney's primary opponent.",
    "He's obsessed and enraged, consumed by vengeance, and moving us closer to political violence.",
    "Trump's mind has no room to entertain any other thoughts, at least not for long.",
    "His behavior needs attention not because of the past but because of the future.",
    "A second Trump term would make the first one look like a walk in the park.",
    "His defeat is his obsession; it has pulled him into a deep, dark place.",
    "His electoral defeat has pulled him into a deep, dark place.",
    "This is not just moral degradation; it is moral nihilism.",
    "Shortly after the election, some of us tried to move on.",
    "The proper response would have been: of course not!",
    "To understand the GOP, one must understand Trump.",
    "He wants to pull the rest of us into it as well.",
    "He wants to pull the rest of us into it as well.",
    "(I'm not the only person to think that.)",
    "That is itself quite telling."
  ]
}