{
  "id": 592,
  "mediaId": 157,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "A lot of Republicans 'want out of the Trump situation': CNN analyst",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29281931&width=1200&coordinates=0%2C28%2C0%2C46&height=600",
  "link": "https://www.rawstory.com/anti-trump-republicans-2656584264/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    971,
    1010,
    1147,
    1248,
    2214,
    3094,
    106,
    428
  ],
  "sentences": [
    "\"And I think you're seeing him try and set himself up as someone who -- not necessarily in that clip -- but if you watch other things he said, as a potential heir to the populism,\"\n\"I do think there is, if you look at the numbers, space for an alternative to the president in the primary,\" she continued.",
    "A discussion on CNN's \"New Day\" about an attack on the House's select committee on the January 6 riot by Sen. Marco Rubio (R-FL), who called it a \"complete partisan scam,\" flipped when CNN analyst Kasie Hunt claimed Republicans are getting weary of defending Donald Trump.",
    "\"I think, bigger picture, Marco Rubio was somebody who ran for president way back in 2016, he was one of the people that Donald Trump vanquished, he is somebody who potentially has additional ambitions going forward,\" Hunt explained.",
    "If there are ten people in the not-Trump category, which is what it is shaping up to be right now, it divides their vote and gives a clear path for Trump to be re-nominated since he controls the party apparatus.\"",
    "\"I know a lot of Republicans I talk to privately so far collectively who want out of the Trump situation, but they haven't found a way to break up the strong support that's left,\" she reported.",
    "Addressing the RNC's censure vote on Reps. Adam Kinzinger (R-IL) and Liz Cheney (R-WY), she added, \"They passed a resolution essentially calling January 6th 'legitimate political discourse.'",
    "\"If they don't figure it out, they will be back in the same situation they have been in the last four to eight years.\"",
    "Even if they watered down their proposed censure around Kinzinger and Cheney a bit around this committee.\"",
    "Watch below:\nCNN 02 07 2022 07 27 18",
    "\"You will have Trump and not Trump."
  ]
}