{
  "id": 597,
  "mediaId": 120,
  "date": "2/6/2022 12:00:00 AM",
  "headline": "Liz Cheney, January 6 and Trump's grip on the RNC",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_05/3533511/220204-liz-cheney-adam-kinzinger-main-an.jpg",
  "link": "https://www.msnbc.com/opinion/liz-cheney-january-6-trump-s-grip-rnc-n1288696",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlie Sykes",
  "authorUrl": "https://www.msnbc.com/author/charlie-sykes--ncpn813256",
  "termIds": [
    1064,
    1147,
    1248,
    1796,
    2214,
    2349,
    3094,
    427,
    428,
    2707
  ],
  "sentences": [
    "Maryland's Republican governor, Larry Hogan, called the vote a sad day for my party  and the country  when you're punished just for expressing your beliefs, standing on principle, and refusing to tell blatant lies.?\nRepublican Sen. Bill Cassidy of Louisiana, who had voted to convict Trump in his second impeachment trial, tweeted: The RNC is censuring Liz Cheney and Adam Kinzinger because they are trying to find out what happened on January 6th - HUH?? South Carolina Rep. Tom Rice also weighed in: Someone should definitely be held accountable for Jan. 6,? he said.",
    "With only a few scattered dissents, the RNC voted overwhelmingly for a resolution condemning the Wyoming congresswoman and her fellow representative, Adam Kinzinger of Illinois, for their roles investigating what the committee ludicrously called the persecution of ordinary citizens engaged in legitimate political discourse.?\nThe message was clear enough: the RNC remains utterly in thrall to Donald Trump and his Big Lie.",
    "In a single vote, the ruling body of the GOP embraced the revisionist version of the Jan. 6 attack on the Capitol that left five dead, recasting the violence millions watched unfold in real time as legitimate political discourse.?\nRepublican leaders seemed to recognize almost immediately that they had blundered, and tried to insist that the language was never meant to apply to rioters who assaulted the Capitol.",
    "This is, after all, the same party that failed to pass even a basic platform in 2020, settling instead for a one-page resolution that declared: ?RESOLVED, That the Republican Party has and will continue to enthusiastically support the President's America-first agenda.?\nAfter his defeat, the RNC could have embraced a post-Trump world.",
    "On Feb. 2, the oleaginous Matt Schlapp, the chairman of the Conservative Political Action Committee (CPAC), went on TV and demanded that any Republican involved in the corrupt Jan. 6 committee should be kicked out of the conference.?\nIn the end, the RNC's resolution was modified to simply condemn Cheney and Kinzinger.",
    "Friday's censure vote came just days after Trump dangled the idea of pardons for Jan. 6 rioters, and following new and newly distributing detail about the Trump administration's possible plans to use the federal government to seize voting machines.",
    "Cheney and Kinzinger, it says, are both utilizing their past professed political affiliations to mask Democratic abuse of prosecutorial power for partisan purposes.? In other words, the problem is not disloyalty, it is credibility.",
    " Mitt Romney (@MittRomney) February 4, 2022\nUtah Sen. Mitt Romney, a former GOP presidential nominee, tweeted: Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.",
    "This is the crucial context for Friday's RNC vote  a desperate anxiety about the danger that the committee poses to Trump world, and the role that Cheney and Kinzinger will play as members of that committee.",
    "Almost on a daily basis we learn new information about the insanity of Trump's final days in office, and the picture that is forming is devastating both to the former president and to his GOP accomplices.",
    "It's also true that Cheney's congressional seat is important: If the next presidential election is decided by the House of Representatives, each state would get a single vote.",
    "But rather than talk about inflation, crime, the pandemic, China or the border, Republicans decided to remain in Trump's endless doom loop of election denialism and revenge.",
    "Why was it so important that the Republican Party denounce and discredit the woman who, just months ago, was the third most powerful member of the House GOP leadership?",
    "Why was it so important that the Republican Party denounce and discredit the woman who, just months ago, was the third most powerful member of the House GOP leadership?",
    "In December, a group of conservative notables  including Ginni Thomas, the wife of Supreme Court Justice Clarence Thomas  signed an open letter demanding their ouster.",
    "(The letter was also signed by Trump's former attorneys Jenna Ellis and Cleta Mitchell, who are likely to be questioned by the House's Jan. 6 committee.)",
    "The first thing to understand is that the Cheney censure was a massive distraction from what Republican elected officials want to be talking about.",
    "They think they hold a winning hand on a number of issues, and polls suggest they may be poised for a significant win in the midterm elections.",
    "Indeed, the House continues to move quickly and effectively  issuing subpoenas, gathering evidence and preparing for televised public hearings.",
    "Before this week, there had been considerable momentum behind the push to expel Cheney and Kinzinger altogether from the House GOP Conference.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.?\nBut these were outliers.",
    "Otherwise, why would the Republican National Committee have engaged in such an extraordinary display of self-humiliation on Friday?",
    "That makes perfect sense.?\nShame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.",
    "The party still pays some of Trump's legal bills and endlessly repeats his discredited talking points.",
    "But the message was clear enough: The RNC remains utterly in thrall to Donald Trump and his Big Lie.",
    "As Wyoming's sole representative, Cheney would have as much clout as the entire state of New York.",
    "Perhaps the answer is obvious: Trump demanded revenge, and the feckless GOP simply acquiesced.",
    "As Republicans, they provide bipartisan credibility to the Jan. 6 committee's investigations.",
    "So this brings us back to the original question: Why does Liz Cheney matter so much?",
    "But instead, it now resembles the spasmodically twitching limb of a dead presidency.",
    "Why is a national political party so obsessed with a pair of representatives?",
    "The committee is also preparing to help fund Cheney's primary challenger.",
    "Why did the RNC decide to spend so much political capital on this fiasco?",
    "But this only partially explains what happened on Friday.",
    "But that is a relatively unlikely future scenario.",
    "It was an ugly look and there was some blowback.",
    "Liz Cheney, it turns out, matters after all.",
    "So why the obsession with Cheney right now?",
    "For the most part, Republicans stayed mum.",
    "Of course the GOP's sycophancy is not new.",
    "Liz Cheney is about to enter prime time.",
    "By now, it feels like a very old story.",
    "But it was not completely meaningless.",
    "The RNC chose Cheney and Kinzinger?",
    "Friday's resolution offers a hint.",
    "That's why she matters so much.",
    "And it could have been worse.",
    "And there it was."
  ]
}