{
  "id": 598,
  "mediaId": 239,
  "date": "2/6/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene says a GOP intraparty civil war' is necessary",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/01/30/Election_2022_Senate_Ohio_71622.jpg-1cc5f_c0-136-3250-2030_s885x516.jpg?0b6492be1e910f3f5dd2cb4cd3fd6b31d98538bb",
  "link": "https://www.washingtontimes.com/news/2022/feb/6/marjorie-taylor-greene-says-gop-intraparty-civil-w/",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kerry Picket",
  "authorUrl": "https://www.washingtontimes.com/staff/kerry-picket/",
  "termIds": [
    667,
    1248,
    1563,
    1813,
    2118,
    2214,
    3094,
    427,
    428,
    2945
  ],
  "sentences": [
    "We have to lean into this civil war in the GOP.?\nMrs. Greenes declaration comes as members of the Republican National Committee on Friday censured Rep. Liz Cheney of Wyoming and Rep. Adam Kinzinger of Illinois for their participation as members of the House select committee investigating the Jan. 6, 2021, attack on the U.S. Capitol.",
    "If we're willing to go to battle on the ideas and the policies that will actually support our country and the base and the people that vote us into office, then we can become the conference, and we can become the party that's actually going to solve the problems and serve the very people that send us to do that,? she said.",
    "No one likes to watch people fighting, and we're supposed to support one another  respect and obey Reagan's 11th commandment.' But If we are truly going to stop the assault on our freedoms and stop what's happening to our country, where America is just being able to be sold out to the rest of the world,? Mrs. Greene said.",
    "Republicans have been struggling to come to terms with the freshman lawmaker since the 117th Congress began in January 2021, when Democrats welcomed her to Washington by demanding GOP leadership remove her from her committees over comments deemed offensive that had been posted to her Facebook page.",
    "She has thrown sand into the gears of the Democrats' agenda by routinely calling motions to adjourn before key Democratic policy votes, motions that trigger the entire lower chamber to stop whatever it's doing to call members back to the floor for a roll call vote.",
    "But Mrs. Greene sees her unconventional approach as a critical symbol to voters and to fellow lawmakers about the values of the modern Republican Party  a message that Republicans who take issue with Mr. Trump, in particular, need to hear, she said.",
    "Since the ouster from her committees, Mrs. Greene has used her time in office to become Capitol Hill's unofficial troublemaker, serving as a tireless irritant and thorn in the side of both the majority Democrats and more than a few Republicans.",
    "She crushed her primary opponents and later her runoff challenger before overwhelming the Democratic nominee, who unofficially withdrew from the race to fill the 14th Congressional District seat being vacated by five-term GOP Rep. Tom Graves.",
    "Mr. Rove said last year that Mrs. Greene was a problem? for the GOP, and Mr. Crenshaw, more recently, fired back at Mrs. Greene, calling her an idiot? for criticizing his conservative credentials over comments he made about COVID-19 policy.",
    "That's why someone like me, even though I'm a freshman member of Congress, have to come in and say, Here's where you're wrong, here's where you've screwed up,' and point out where you are not supporting the people you say you support.",
    "Neither the congresswoman nor her critics inside the party have been shy about taking their disagreements public, despite Reagan's oft-repeated maxim that Thou shalt not speak ill of any fellow Republican.?\nI love Ronald Reagan.",
    "Republicans who just two years earlier had removed then-Rep. Steve King, Iowa Republican, from his committees after he made questionable comments about White supremacy and White nationalism, rejected the Democrats' demands.",
    "The guerrilla legislative tactic, which has angered Democrats holding the gavels during interrupted committee hearings, also annoyed some Republicans who had their own schedules disrupted by the surprise motions.",
    "Many times, I do feel like I'm the only one here saying it because everyone else would rather sing Kumbaya' in the conference and call each other all these names and stuff, and it just makes me sick.?",
    "But Democrats used their majority to remove Mrs. Greene from her committees anyway, making her the first lawmaker in the minority to be stripped of her panel assignments by the majority.",
    "Her battles within the GOP have included clashes with Ms. Cheney, Mr. Kinzinger, Rep. Nancy Mace of South Carolina, Rep. Dan Crenshaw of Texas and Republican strategist Karl Rove.",
    "Eleven Republicans voted with the Democrats to remove the Georgia Republican from her committees, and three of those would go on to vote to impeach former President Donald Trump.",
    "Those are the commandments I believe in, and saying we can't criticize each other is just being soft and going for failure because the truth is iron sharpens iron,? she said.",
    "Mrs. Greene, in an interview with The Washington Times Editorial Board last week, said that on some issues, there is no choice but to stand against others in your own party.",
    "She has even speculated that House Minority Leader Kevin McCarthy of California lacks the votes to be speaker if Republicans recapture the majority in November.",
    "Rep. Marjorie Taylor Greene makes no excuses for routinely criticizing fellow Republicans, arguing against claims that a GOP civil war? will hurt the party.",
    "We're gonna go back to being the uniparty with the Democrats where we all work together and, and sell America out to the rest of the world,'? she said.",
    "In fact, the Georgia Republican says the battle is necessary if conservatives want to take a bigger stake in the party.",
    "I think he was a great president, but  I don't believe in the 11th commandment.' I only believe in 10.",
    "You've been here for 20 years or more, and I'm telling you, you failed all of us,? she said.",
    "They're so out of touch that they are still saying, Oh He was a speed bump.",
    "The Georgia Republican was a popular first-time candidate in 2020.",
    "It's not who the Republican Party is.",
    "They're so naive."
  ]
}