{
  "id": 600,
  "mediaId": 19,
  "date": "2/6/2022 12:00:00 AM",
  "headline": "NY Times Warns: Republicans Can Use January 6 Committee's Precedent to Pursue Democrats After Midterm Elections",
  "image": "https://media.breitbart.com/media/2022/01/GettyImages-1236945829-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/02/06/ny-times-warns-republicans-can-use-january-6-committees-precedent-to-pursue-democrats-after-midterm-elections/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joel B. Pollak",
  "authorUrl": "https://www.breitbart.com/author/joel-b-pollak/",
  "termIds": [
    1097,
    1248,
    1335,
    1804,
    2214,
    2244,
    2293,
    3094,
    146,
    428,
    517
  ],
  "sentences": [
    "The Times Michael S. Schmidt  who shared a Pulitzer Prize for the discredited Russia collusion? story  and Luke Broadwater  reported that the committee ? is borrowing techniques from federal prosecutions, employing aggressive tactics typically used against mobsters and terrorists  [to] develop evidence that could prompt a criminal case? against former President Donald Trump, even though it has has no authority to pursue criminal charges.?\nThe committee hopes to push Attorney General Merrick Garland to pursue charges against Trump and his associates, ignoring President Joe Biden's repeated pledges that the Department of Justice under the Biden administration would not be used as a political weapon.",
    "But the Times warned that Republicans could use the same tactics against Democrats if they win the 2022 midterm elections:\nHaving lived through and being a part of every major congressional investigation over the past 50 years from Iran-contra to Whitewater to everything else, this is the mother of all investigations and a quantum leap for Congress in a way I've never seen before,? said Stanley Brand, a Democrat and the former top lawyer for the House who is now representing Dan Scavino, one of Mr. Trump's closest aides, in the investigation.",
    "Trump's allies have grown angry not just at the aggressiveness of the committee  for example, in making subpoenas public before they have been served  but also at the expansive list of people questioned, some of whom, these allies maintain, had minimal to no involvement in the events of Jan. 6.?\nSome Republicans are already promising to turn the tables on Democrats if they take over the House, as many expect, in November.",
    "But Ms. Cheney insisted that the committee be as aggressive as possible.?\nThe Republican National Committee censured Cheney and fellow committee member Rep. Adam Kinzinger (R-IL) for their participation in the committee after Speaker of the House Nancy Pelosi (D-CA) rejected the party's official nominees.",
    "Just wait if the Republicans take over.?\nThe committee's aggressive approach carries with it another obvious risk: that it could fail to turn up compelling new information about Mr. Trump's efforts to hold onto power after his defeat or to make a persuasive case for a Justice Department prosecution.",
    "The Times also describes Republican Rep. Liz Cheney of Wyoming as an instigating force: Some of the Democrats on the committee were concerned that if the panel was too aggressive, Republicans might turn the tables on the Democrats whenever they took back control of the House.",
    "The Times notes that the committee is using subpoenas to collect personal bank information and phone records of people who have no clear connection to the January 6 Capitol riot, including attorneys for the president and his campaign.",
    "The New York Times warned Saturday that Democrats are setting a dangerous precedent with the January 6 Committee, exceeding the constitutional powers of Congress in a way that Republicans can use when they take back the majority.",
    "Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m.",
    "At a rally in Conroe, Texas, last month, former President Trump promised to investigate corruption by Biden and his family if Republicans took Congress.",
    "Mr. Trump survived years of scrutiny by the special counsel in the Russia investigation, Robert S. Mueller III, and two impeachments.",
    "Despite a swirl of new investigations since he left office, the former president remains the dominant force in Republican politics.",
    "His recent book, RED NOVEMBER, tells the story of the 2020 Democratic presidential primary from a conservative perspective.",
    "He is the author of the recent e-book, Neither Free nor Fair: The 2020 U.S. Presidential Election.",
    "They think they're fighting for the survival of the democracy and the ends justify the means.",
    "He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship.",
    "Brand suggested, that Democrats might one day come to regret.",
    "When a frontier is pushed back, it doesn't recede,? he said.",
    "Follow him on Twitter at @joelpollak.",
    "In addition, it notes, Mr.",
    "ET (4 p.m. to 7 p.m. PT).",
    "It is a development, Mr."
  ]
}