{
  "id": 605,
  "mediaId": 409,
  "date": "2/5/2022 12:00:00 AM",
  "headline": "RNC Should Take a Lesson from Mike Pence",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/02/mike-pence-electoral-college-count.jpg?w=1592",
  "link": "https://www.nationalreview.com/2022/02/rnc-should-take-a-lesson-from-mike-pence/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editors",
  "authorUrl": "https://www.nationalreview.com/author/the-editors/",
  "termIds": [
    1609,
    2214,
    2214,
    1434,
    1434,
    1609,
    1248,
    1147,
    1147,
    1248,
    427,
    427,
    428,
    428,
    545,
    545,
    2550,
    2550
  ],
  "sentences": [
    "But the RNC has issued a statement, purportedly in the name of the entire party, denouncing a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse? and Democrat abuse of prosecutorial power for partisan purposes.? This will, quite predictably and not wholly unreasonably, be read as an argument that the action of the mob was nothing but legitimate political discourse? and that nobody should be prosecuted.",
    "We understand how Republicans think it is wrong for Cheney and Kinzinger to give the committee a patina of bipartisanship it would lack after Nancy Pelosi rejected Kevin McCarthy's selections to serve and to have enthusiastically embraced the committee's mission that has gone well beyond any legislative purpose.",
    "The Republican National Committee has voted to formally censure Liz Cheney and Adam Kinzinger for actions in their positions as members of the January 6th Select Committee not befitting Republican members of Congress.? This is both morally repellent and politically self-destructive.",
    "To the extent that the party did not intend this as the meaning  and RNC chair Ronna McDaniel, already doing damage control, says it was not meant that way  its wording is political malpractice of the highest order coming from people whose entire job is politics.",
    "The presidency belongs to the American people, and the American people alone.?\nThere is also no conceivable political benefit to the Republican Party or its members  other than Donald Trump  in looking to defend or minimize January 6 rather than simply move on.",
    "The first rule of party operatives should be do no harm.? Attacking a party's own elected officials, through channels that reflect neither the voters nor the people they elect, violates every rule of political sense.",
    "To say that investigation and prosecution are justified is not to defend every aspect of the hundreds of criminal prosecutions, or to bless the Democrats' norm-breaking partisanship on the January 6 committee.",
    "Republicans who did nothing to encourage the mob  and there are many such Republicans  need not wear a hair shirt over January 6, but when they choose to talk about it, they should tell the unsparing truth.",
    "A censure of this sort is also the wrong remedy, but one that has become all too common from political-party operatives attempting to vent their spleens at popularly elected public officials.",
    "In Arizona, for example, the Republican Party issued a bizarre censure last year of sitting governor Doug Ducey, former senator Jeff Flake, and the widow of former senator John McCain.",
    "We commend the example of Mike Pence, who told a Federalist Society gathering, I heard this week that President Trump said I had the right to overturn the election.",
    "But Cheney has already been removed from leadership (unwisely, in our view) and faces a primary challenge; Kinzinger is retiring from the House.",
    "It will be used against hundreds of elected Republicans who were not consulted in its drafting and do not endorse its sentiment.",
    "It did so for no good purpose, and its action will only encourage those who see riots as legitimate political discourse.",
    "Not to be outdone in self-destructiveness, Arizona Democrats censured sitting senator Kyrsten Sinema.",
    "But the voters have also shown little interest in the Democrats' obsession over the event.",
    "At least those responses have the virtue of coming from elected officials and the voters.",
    "Aspects of it are also fit subjects for a properly conducted congressional inquiry.",
    "Fair-minded people can, of course, criticize some of the responses to January 6.",
    "The RNC bought the entire party a bounty of bad headlines and easy attack ads.",
    "It is deserving of both political accountability and criminal prosecution.",
    "But there is also, obviously, a need for full accounting of January 6.",
    "The American people are never itching to hear a defense of rioters.",
    "The action of the mob on January 6 was an indefensible disgrace.",
    "It is wrong to minimize or excuse what happened that day.",
    "Again, fair-minded people can disagree here.",
    "I had no right to overturn the election.",
    "A mistake, and worse, a shame.",
    "President Trump is wrong."
  ]
}