{
  "id": 614,
  "mediaId": 120,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Cheney, Kinzinger face striking rebuke from their own party",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2021_30/3495008/210729-liz-cheney-adam-kinzinger-jm-1213.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/cheney-kinzinger-face-striking-rebuke-their-own-party-n1288678",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.nbcnews.com/author/steve-benen-ncpn433601",
  "termIds": [
    1147,
    1248,
    1729,
    2214,
    3094,
    146,
    427,
    428,
    562
  ],
  "sentences": [
    "The RNC's resolution:\naccuses Cheney and Kinzinger of trying to \"sabotage\" their party;\nclaims the duo care more about holding Donald Trump accountable than the party's electoral ambitions;\ninsists they've engaged in behavior \"not befitting Republican members of Congress\";\nsays the lawmakers are \"deliberately jeopardizing\" their party's 2022 strategies;\nand concludes that Cheney and Kinzinger \"are participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse.\"",
    "This was the Republican National Committee  an entity that occasionally likes to say it's emphasizing \"party unity\" in an election year  going after two of their own, both of whom are lifelong Republicans with conservative voting records.",
    "The fact remains, however, that Cheney and Kinzinger agreed to examine the most serious attack on the U.S. Capitol since the War of 1812, and they've shown resistance to their party's slide toward authoritarianism.",
    "In case this isn't obvious, the behavior the RNC considers \"destructive\" is serving on the bipartisan House select committee investigating one of the most serious instances of political violence in U.S. history.",
    "In terms of the practical implications, both House Republican lawmakers are still House Republicans, and at least at this point, there's little to suggest the party will kick them out of the conference.",
    "Recommended\nThe Bulwark's Amanda Carpenter added, \"The fact the RNC is censuring Cheney and Kinzinger for investigating January 6 and not condemning Trump for causing January 6 is absolutely demented.\"",
    "That said, the RNC will now immediately cease \"any and all support\" for the members, which is notable in part because Cheney is facing a competitive primary campaign in Wyoming this year.",
    "After Republican Reps. Liz Cheney and Adam Kinzinger agreed to serve on the Jan. 6 committee, their GOP colleagues decided they deserved the pariah treatment.",
    "When the Republican National Committee offers more support for suspected criminals than sitting Republican members of Congress, something is clearly amiss.",
    "I more or less assumed the party's resolution would be a straightforward rebuke of two lawmakers who dared to ask questions Republicans prefer to ignore.",
    "But the practical implications for the members are less important than what we're learning about the state of Republican politics in 2022.",
    "Today's process was a voice vote, and there were only a handful of voices who were heard opposing the effort.",
    "NBC News reported that Republican National Committee voted Friday to formally censure both lawmakers.",
    "The question wasn't whether they deserved to be punished, it was how the party penalize them.",
    "Remember, we're not just talking about some fringe faction in Republican politics.",
    "The resolution was considered and approved as part of the RNC's winter meeting.",
    "Today's vote was not limited to members of the Freedom Caucus.",
    "But the document is far more ridiculous than that.",
    "For that, today, they paid an unnecessary price.",
    "The answer came into focus this afternoon."
  ]
}