{
  "id": 618,
  "mediaId": 124,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "RNC votes to censure Cheney, Kinzinger for investigating Capitol riot",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220204-liz-cheney-adam-kinzinger-mjf-1327-cadb33.jpg",
  "link": "https://www.nbcnews.com/politics/rnc-votes-censure-cheney-kinzinger-investigating-capitol-riot-rcna14943",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1248,
    1335,
    1248,
    1335,
    2214,
    2214,
    1685,
    1685,
    427,
    427,
    428,
    428,
    146,
    146,
    2959,
    2959
  ],
  "sentences": [
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.?\nSen. Bill Cassidy, R-La., also tweeted late Thursday, The RNC is censuring Liz Cheney and Adam Kinzinger because they are trying to find out what happened on January 6th  HUH??\nMeanwhile, the Democratic National Committee said McDaniel and the GOP keep reminding voters that there is no low they will not go to to protect Donald Trump and his chaos.?\nTheir decision to prioritize politics over our country is disgusting and voters will not soon forget,? Ammar Moussa, the DNC rapid response director, said in a statement.",
    "An RNC panel had advanced the measure on Thursday, which said that the committee will immediately cease any and all support of them as members of the Republican Party for their behavior, which has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic, and is inconsistent with the position of the conference.?\nRep. Liz Cheney responds to Trump's Jan. 6 comments: He clearly would do this all again'\nJan. 31, 202201:34\nIt continued by ripping the two members of Congress for their criticism of former President Donald Trump.",
    "It has nothing to do with anything but what Cheney and Kinzinger chose to do, which is to be Pelosi puppets.?\nPaul Farrow, chairman of the Wisconsin GOP, said RNC members' frustration with Cheney and Kinzinger was over the Jan. 6 investigation starting to broaden their scope of what they're looking at.?\nIt almost seems like a fishing expedition where people are just trying to find something to hang on someone,? he said.",
    "We're frustrated with them.?\nIn a Thursday statement, Kinzinger said his efforts will continue to be focused on standing up for truth and working to fight the political matrix that's led us to this point.?\nRather than focus their efforts on how to help the American people, my fellow Republicans have chosen to censure two lifelong members of their party for simply upholding their oaths of office,? he said.",
    "The Conference must not be sabotaged by Representatives Liz Cheney and Adam Kinzinger, who have demonstrated, with actions and words, that they support Democrat efforts to destroy President Trump more than they support winning back a Republican majority in 2022,? the resolution said.",
    "In a statement, RNC chairwoman Ronna McDaniel said Cheney and Kinzinger crossed a line.?\nThey chose to join Nancy Pelosi in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol,? she said.",
    "WASHINGTON  WASHINGTON  The Republican National Committee voted Friday to formally censure two of their own party's members  Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois  because of their work investigating the Jan. 6 attack on the Capitol.",
    "But after we have our debates and the primaries are over, it is incumbent on every single person in this room to bring Republicans of all stripes together so we can win.? there is no low they will not go to to protect Donald Trump and his chaos.\"",
    "He told NBC News that while he doesn't necessarily disagree that Cheney and Kinzinger have poked their finger at the Republican Party,? he feels any such rejection of the two should come from voters, not the party.",
    "The measure described the two members as participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse? in their roles on the House committee investigating Jan. 6.",
    "They've allowed conspiracies and toxic tribalism [to] hinder their ability to see clear-eyed.?\nSeveral lawmakers denounced the censure, including Sen. Mitt Romney, R-Utah, the 2012 GOP presidential nominee.",
    "Members who spoke with NBC News expressed frustration over the committee's recent subpoenas of alternate electors,? saying they felt such probing went far beyond the attack on the Capitol.",
    "David Bossie, an RNC member from Maryland and an architect of the resolution, suggested that the committee couldn't ignore what he described as Cheney and Kinzinger's egregious actions.",
    "The committee overwhelmingly supported this resolution because of what they have done to empower Nancy Pelosi and to continue her reign of terror over the American people,? Bossie said.",
    "\"Their decision to prioritize politics over our country is disgusting and voters will not soon forget,\" Ammar Moussa, the DNC rapid response director, said in a statement.",
    "But after we have our debates and the primaries are over, it is incumbent on every single person in this room to bring Republicans of all stripes together so we can win.\"",
    "I'm trying very hard to get my folks in Connecticut to stop standing in a circle and going ready, aim, fire.'?\nWe need to stop doing that around the country,? he added.",
    "The measure was adopted Friday by voice vote at the RNC's annual meeting in Salt Lake City, which brought together the party's 168 members for their general session.",
    "In a speech just prior to the vote, RNC co-chair Tommy Hicks said Republicans must remain united.?\nRepublicans aren't afraid to debate each other,? he said.",
    "Our intent, as we look at it, is to hold our elected officials accountable, to make sure that they're doing their best to keep the country moving forward.",
    "They're not doing that right now.?\nBen Proto, chairman of the Connecticut GOP, was one of a handful of members to object to the resolution.",
    "He told NBC News after the vote that the resolution had originally been worded more harshly and was softened amid discussions with members.",
    "Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol,? Romney tweeted Friday.",
    "It was combined with a handful of other resolutions, such as one condemning the Chinese government, and passed overwhelmingly.",
    "Still, he said members are deeply unhappy with Cheney and Kinzinger for participating with Democratic leaders in this effort.",
    "(Arizona GOP chairwoman Kelli Ward, one of the electors subpoenaed, recently sued the committee to block its efforts.)",
    "In his speech just prior to the vote, RNC co-chair Tommy Hicks said Republicans \"must remain united.\"",
    "Kinzinger is retiring at the end of his term while Cheney is facing a primary challenge.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "The Wyoming voters will decide if they don't want Liz Cheney,? Proto said.",
    "Another no? vote came from Henry Barbour, a RNC member from Mississippi.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "\"We have a range of views on the issues, which is a good thing.",
    "We have a range of views on the issues, which is a good thing.",
    "\"Republicans aren't afraid to debate each other,\" he said.",
    "Cheney has outraised her primary opponent by millions.",
    "Sometimes, I think we kind of get in our own way.",
    "Only a small handful of objections were voiced.",
    "There was no debate on any of the measures.",
    "That's not what we're supposed to be doing.",
    "McDaniel is Romney's niece.",
    "...",
    "..."
  ]
}