{
  "id": 619,
  "mediaId": 323,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Cheney, Kinzinger Censured by RNC as Trump Rift Widens",
  "image": "https://images.wsj.net/im-480188?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/cheney-kinzinger-face-rnc-censure-vote-as-trump-rift-widens-11643993140",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Siobhan Hughes",
  "authorUrl": "",
  "termIds": [
    655,
    1147,
    1248,
    1434,
    2087,
    2214,
    2349,
    3085,
    3094,
    427,
    428,
    2945
  ],
  "sentences": [
    "The resolution accuses the lawmakers of disloyalty, alleging they have demonstrated, with actions and words, that they support Democrat efforts to destroy President Trump more than they support winning back a Republican majority in 2022.?\nBy serving on the Jan. 6 committee, the resolution said, Ms. Cheney and Mr. Kinzinger are participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse.?\nOn Jan. 6, supporters of Mr. Trump stormed the Capitol in an effort to block the certification of President Biden's victory by Congress.",
    "tweeted: The RNC is censuring Liz Cheney and Adam Kinzinger because they are trying to find out what happened on January 6thHUH?? Sen. Mitt Romney (R., Utah) tweeted: Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.?\nThe Jan. 6 panel has expressed interest in speaking with former Vice President Mike Pence.",
    "Mr. Kinzinger, who isn't running for re-election, said his fellow Republicans have allowed conspiracies and toxic tribalism [to] hinder their ability to see clear-eyed.?\nThe censure and a related procedural move would clear the way for the RNC to financially support Ms. Cheney's primary opponent, Harriet Hageman.",
    "I'm not hearing good stories.?\nOutside the Capitol during the siege, some rioters could be heard chanting Hang Mike Pence.? Mr. Pence defied the pressure campaign to reject electors from six states challenged by Republicans: Arizona, Georgia, Michigan, Nevada, Pennsylvania and Wisconsin.",
    "Republicans rebuked two House lawmakers for serving on the select committee investigating the Jan. 6, 2021, attack on the U.S. Capitol, as the GOP continues to grapple with former President Donald Trump's failed effort to overturn the 2020 election result.",
    "Mr. Kellogg told investigators that on the morning of the attack, Mr. Trump was on the phone with Mr. Pence and told him you're not tough enough to make the call? to overturn the election, according to testimony from Mr. Kellogg.",
    "He has previously said that the Constitution provides the vice president with no authority to reject or return electoral votes certified by states and had called the notion that he could overturn a result un-American.",
    "A resolution calling for the censure of Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois passed in a voice vote during a meeting of the Republican National Committee in Salt Lake City on Friday.",
    "Photos: Getty Images\nThe Democratic-led House created the Jan. 6 committee last year after Republicans blocked an effort to set up a bipartisan commission based on the model of the Sept. 11 investigation.",
    "The panel has also expressed interest in speaking with former Vice President Mike Pence, who oversaw the certification process and rejected pressure by Mr. Trump to reject some pivotal states' results.",
    "While Mr. Pence hasn't been issued a subpoena from the select committee, several of his former aides have testified, most recently former adviser Marc Short and Mr. Pence's former lawyer, Greg Jacob.",
    "The action comes as the party is split over Mr. Trump's past actions and future influence over the party, headed into a midterm election in which the GOP hopes to regain control of Congress.",
    "Photo: Bridget Bennett/Bloomberg News\nThe Jan. 6 committee has sought testimony and documents from numerous officials close to Mr. Trump, zeroing in on his communications that day.",
    "The focus on Mr. Pence comes as members of the Jan. 6 committee have raised the possibility of referring their findings to the Justice Department for possible criminal prosecution.",
    "Ahead of the vote, Ms. Cheney, who had previously been stripped of her House GOP leadership role and faces a primary challenge this year, brushed off the censure attempt.",
    "Earlier\n A year after pro-Trump rioters attacked the U.S. Capitol, lawmakers and Americans remain divided over what happened on Jan. 6, 2021, and who is to blame.",
    "A bipartisan group of senators is working on revising the Electoral College Act, which governs how Congress counts and certifies presidential election results.",
    "Mr. Trump recently called the panel an unselect Committee of political hacks and highly partisan sleazebags? and has floated the idea of pardoning rioters.",
    "At one point, Mr. Trump told the vice president that I hope you're going to stand up for the good of our Constitution and for the good of our country.",
    "Write to Alex Leary at alex.leary@wsj.com and Siobhan Hughes at siobhan.hughes@wsj.com\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Backers say one change would be to clarify the role of the vice president and eliminate any ambiguity about his or her ability to change an outcome.",
    "Keith Kellogg, a retired three-star Army general who served as Mr. Pence's national security adviser, has already testified to the Jan. 6 committee.",
    "Mr. Trump, who gave a speech encouraging supporters to march to the Capitol, was impeached by the House on a count of inciting an insurrection.",
    "Mr. Trump, who has floated another White House bid, has continued to criticize Mr. Pence, who has also shown interest in running for president.",
    "Mr. Trump's pressure campaign against Mr. Pence continued later that day, when in a speech on the Ellipse he repeatedly taunted Mr. Pence.",
    "Some Republicans, including Senate Minority Leader Mitch McConnell (R., Ky.), have said they are looking forward to the panel's findings.",
    "In the Senate, all 50 members of the Democratic caucus were joined by seven Republicans in voting to convict, shy of the 67 needed.",
    "The RNC, which is closely aligned with Mr. Trump, is made up of party officials representing U.S. states and territories.",
    "Mr. Pence was scheduled Friday afternoon to deliver a speech in Florida in which he is expected to defend his actions.",
    "WSJ journalists look at changes in Congress since then, and what it could mean for the 2022 midterm elections.",
    "Ms. Cheney and Mr. Kinzinger, longtime critics of Mr. Trump, are the only Republicans on the committee.",
    "I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "Several GOP lawmakers pushed backed against the effort to sanction Ms. Cheney and Mr. Kinzinger.",
    "Any legislation drafted by the group would need 60 votes to advance in the 50-50 Senate.",
    "His statements were excerpted in a subpoena that the Jan. 6 panel sent to Ivanka Trump.",
    "SHARE YOUR THOUGHTS\nWhat do you think lies ahead in Mike Pence's political future?",
    "Both party's Senate leaders have signaled they are supportive of the effort.",
    "GOP leaders also opposed the House panel, calling it a partisan exercise.",
    "And if you're not, I'm going to be very disappointed in you.",
    "Lindsay Wise contributed to this article.",
    "History will be their judge,? she said.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Join the conversation below.",
    "Sen. Bill Cassidy (R., La.)",
    "I will tell you right now."
  ]
}