{
  "id": 621,
  "mediaId": 195,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "RNC votes to censure Cheney, Kinzinger",
  "image": "https://cdn.jwplayer.com/v2/media/Jxw8PFfq/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/592841-rnc-votes-to-censure-cheney-kinzinger",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod",
  "termIds": [
    1147,
    1248,
    1335,
    1685,
    2214,
    2465,
    3085,
    3094,
    427,
    428,
    2945,
    2976
  ],
  "sentences": [
    "The resolution adds the RNC shall immediately cease any and all support of? both lawmakers as members of the Republican Party for their behavior which has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic, and is inconsistent with the position of the Conference.?\nThe censure marked the strongest effort thus far to specifically punish the two House lawmakers but stopped short of calls by some to boot them from the House Republican Conference.",
    "Republicans on Capitol Hill have been cool to the prospect of a Trump White House handing out pardons, with Senate GOP leader telling reporters this week he would not be in favor of shortening any of the sentences for any of the people who pleaded guilty to crimes.?\nUpdated at 2:33 p.m.",
    "However, Cheney boasts a large financial advantage, and it's unclear if the RNC would actually divert resources to defeat her in a safe Republican seat while the GOP tries to retake both chambers of Congress  though Hageman has plenty of ammunition on a staunchly pro-Trump state.",
    "\"What's sad is that a year after the attack on the Capitol, the RNC has yet to condemn those who participated in the riot,\" committee member Bill Palatucci of New Jersey, who was in the room when the committee passed the resolution Thursday, told The Hill Friday morning.",
    "The resolution that censured Cheney and Kinzinger said the two lawmakers are participating in persecution of ordinary citizens engaged in legitimate political discourse? by sitting on the Jan. 6 panel, which was convened last year by Speaker Nancy Pelosi (D-Calif.).",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost,? tweeted Sen. Mitt Romney (R-Utah), who voted last year to convict Trump in his impeachment trial over the riot and who is McDaniel's uncle.",
    "He released several statements on it, including saying former Vice President Mike Pence could have overturned? the election and that, should he run for and win another term in 2024, he could pardon some of the people charged in connection with the riot.",
    "Many Republicans railed against last year's insurrection in the immediate aftermath, with some laying the blame squarely at Trump's feet, arguing that his false claims of voter fraud laid the groundwork for the riot.",
    "The resolution, which unanimously passed through the resolutions committee on Thursday, was included in a package with four other motions, including one to \"hold Communist China accountable for Covid-19.\"",
    "She spends every minute of every day engaged in her personal vendetta against Donald Trump, and that is not why Wyoming sent her to Congress,? Hageman said in a statement after the censure.",
    "They chose to join Nancy Pelosi in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol.",
    "and Adam Kinzinger (Ill.) over their criticism of former President Trump and participation in the special House committee investigating the Jan. 6, 2021, attack on the U.S. Capitol.",
    "Many Republicans have excoriated Cheney and Kinzinger for sitting on the Jan. 6 committee, saying their focus on the insurrection and on Trump flies in the face of the GOP.",
    "Kinzinger is not running for reelection next year, while Cheney is fighting for her political life against a Trump-backed primary challenger in attorney Harriet Hageman.",
    "She doesn't have allies in the Republican Party, and the Democrats only see her as a temporary and useful tool to achieve their partisan ends.",
    "Cheney and Kinzinger earlier Friday defended themselves against the effort, arguing they remain conservatives dedicated to the Constitution.",
    "However, few Republicans besides Cheney and Kinzinger make a point any more of discussing the riot at length, let alone assigning blame.",
    "I'm a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "The move against the two comes as Trump this week has thrust last year's riot back into the forefront of the political conversation.",
    "That's why Republican National Committee members and myself overwhelmingly support this resolution,? said RNC Chair Ronna McDaniel.",
    "This is further proof that Liz Cheney has completely lost her ability to be effective in Congress for the people of Wyoming.",
    "Only a smattering of noes? were heard in the sea of yes? votes, though it was unclear who precisely opposed the package.",
    "The resolution's passage is indicative of how Republicans' rhetoric around the riot has shifted over the past year.",
    "I'm a conservative who believes in truth, freedom, and upholding the Constitution of the United States.\"",
    "Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.",
    "The Republican National Committee (RNC) on Friday voted formally to censure GOP Reps. Liz Cheney (Wyo.)",
    "\"I've been a member of the Republican Party before Donald Trump entered the field,\" Kinzinger added.",
    "The entire package passed by a voice vote at the RNC's winter meeting in Salt Lake City.",
    "\"My values and core beliefs remain the same and have not wavered.",
    "The censure resolution divided Republicans Thursday and Friday.",
    "However, moderate Republicans came to their defense this week.",
    "I will never stop fighting for our constitutional republic.",
    "\"The censure ... is just a distracting sideshow.\"",
    "Liz Cheney and Adam Kinzinger crossed a line.",
    "No matter what,? Cheney said in a statement.",
    "History will be their judge."
  ]
}