{
  "id": 623,
  "mediaId": 65,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Republican National Committee overwhelming votes to censure Cheney, Kinzinger for sitting on Jan. 6 committee",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c07a2b5a-5392-4b38-96d0-abd7b5a57ed2/fb79c41a-e7fa-49b5-b4e9-9d3179da40b1/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/republican-national-committee-cheney-kinzinger-censure-jan-6-committee",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1609,
    1609,
    1685,
    1685,
    2214,
    2214,
    1335,
    1248,
    1335,
    1248,
    146,
    146,
    200,
    200,
    428,
    428,
    427,
    427,
    562,
    562
  ],
  "sentences": [
    "Thanks to a move by the Wyoming GOP, the RNC may not be able to indirectly help the effort to defeat Cheney as she runs for reelection\nCLICK HERE TO GET THE FOX NEWS APP\nFox News confirmed that the Wyoming state GOP committee signed a rule and submitted it to the RNC, which allows the national party committee to give the state party support in the upcoming primary.",
    "The two vocal GOP critics of former President Donald Trump were the highest profile of the 10 House Republicans to vote last year to impeach the then-President for inciting the deadly storming of the Capitol by right wing extremists in an attempt to disrupt Congressional certification of now President Biden's 2020 election victory.",
    "\"Republicans have to stand together and what has happened with the Jan. 6 investigation is that it has become a one-sided witch hunt, where they're only going after Republicans,\" Steve Stepanek, the New Hampshire GOP chair and a one of the several dozen co-sponsors of the resolution, told Fox News.",
    "(REUTERS/Elizabeth Frantz)\nStepanek told Fox News that the RNC's resolution was watered down because \"we did not want to usurp the authority of the Republicans in the HouseIt's up to Kevin McCarthy and House Republicans to decide if they want to take further steps.\"",
    "\"The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,\" Cheney charged.",
    "The Republican National Committee (RNC) took a rare step on Friday to censure two GOP lawmakers in the House of Representatives for their participation in a Democratic dominated House select committee investigating the Jan. 6, 2021 attack on the U.S. Capitol.",
    "Cheney was ousted from her number-three position in leadership last spring, but McCarthy's yet to act on calls by Trump loyalists in the House Republican conference to kick out both Cheney and Kinzinger, who decided against running for re-election this year.",
    "A Cheney campaign spokesperson, responding, argued that Wyoming GOP Chair \"Frank Eathorne and the Republican National Committee are trying to assert their will and take away the voice of the people of Wyoming before a single vote has even been cast.\"",
    "CHENEY HAULS IN OVER $7M LAST Y EAR AS SHE FENDS OFF ATTACKS FROM TRUMP\nAnd she emphasized that \"I'm a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "In an overwhelming voice vote by committee members gathered for the general session of their winter meeting in Salt Lake City, Utah, the RNC rebuked Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois.",
    "Sources with the RNC stressed that the move came from the Wyoming GOP  which in November voted to no longer recognize Cheney as a Republican - and was not initiated by McDaniel or other RNC officials.",
    "2024 DEBATES, PRIMARY CALENDAR, CONVENTION CITIES, ON AGENDA AT RNC MEETING\nStepanek also noted that Cheney and Kinzinger weren't appointed to the committee by House Minority Leader Kevin McCarthy.",
    "They chose to join [House Speaker] Nancy Pelosi in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol.",
    "But the resolution that passed the full RNC on Friday was watered down from its original version, which was introduced by David Bossie, a committee member from Maryland and a longtime Trump ally.",
    "Bill Palatucci, a national committee member from New Jersey who opposed the resolution, told Fox News that \"focusing on Liz Cheney at a national RNC meeting is distracting and counterproductive.",
    "The RNC, in its resolution, argued that Cheney and Kinzinger are \"participating in a Democratic led persecution of ordinary citizens engaged in legitimate political discourse.\"",
    "The former president has endorsed Wyoming lawyer Harriet Hageman, a former gubernatorial candidate who is primary challenging Cheney in the state's August GOP primary.",
    "But a move by the national party committee to call for the removal of Cheney and Kinzinger from the House GOP conference would have presented headaches for McCarthy.",
    "To drive home their argument, RNC chair Ronna McDaniel reiterated in a statement that \"Liz Cheney and Adam Kinzinger crossed a line.",
    "Without the rule that was signed by the state party, the RNC would have been prevented from becoming involved in the contest.",
    "Both Cheney and Kinzinger criticized the move by the RNC on Thursday, after the resolution passed an initial committee vote.",
    "\"We're sending a message that we as a party are not going to support these individuals and we feel they should be censured.\"",
    "Trump and his allies have also cleared the GOP primary field of some of the other Republicans challenging Cheney.",
    "Cheney and Kinzinger are the only two Republican members on the panel investigating the attack on the Capitol.",
    "That's why Republican National Committee members and myself overwhelmingly support this resolution.\"",
    "The resolution also states the RNC will \"no longer support them as members of the Republican Party.",
    "The initial resolution called for ousting Cheney and Kinzinger from the House GOP conference.",
    "Cheney, as she runs for reelection, is repeatedly being targeted by Trump.",
    "The resolution didn't sit well with some of the party's committee members.",
    "I will never stop fighting for our constitutional republic.",
    "We should be shooting at Democrats, not Republicans.\"",
    "History will be their judge.",
    "No matter what.\""
  ]
}