{
  "id": 624,
  "mediaId": 233,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "GOP censures Reps. Liz Cheney and Adam Kinzinger, calls Jan. 6 riot 'legitimate political discourse'",
  "image": "https://www.gannett-cdn.com/presto/2021/11/22/USAT/c0ff18b4-7e54-465e-bcda-a449ed389729-AP_Capitol_Breach_Subpoenas.JPG?crop=3294,1853,x0,y167&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/02/04/republicans-censure-cheney-kinzinger/6663972001/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jackson",
  "authorUrl": "https://www.usatoday.com/staff/2647924001/david-jackson/",
  "termIds": [
    1248,
    1335,
    1335,
    1248,
    1147,
    1147,
    1046,
    1046,
    2214,
    2214,
    1685,
    1685,
    428,
    428,
    146,
    146
  ],
  "sentences": [
    "The resolution also accused Cheney and Kinzinger of engaging in \"behavior which has been destructive to the institution of the U.S. House of Representatives, the Republican Party, and our republic.?\nThe resolution will have little if any practical effect on Cheney or Kinzinger, both of whom have described the censure as capitulation to a disgraced and dangerous ex-president.",
    "The censure resolution claims that Cheney and Kinzinger \"have demonstrated, with actions and words, that they support Democrat efforts to destroy President Trump more than they support winning a back a Republican majority (in Congress) in 2022.?\nBoth Kinzinger and Cheney remain members of the House Republican Caucus.",
    "WASHINGTON  The Republican National Committee Friday censured two GOP lawmakers for opposing Donald Trump and probing the Jan. 6, 2021 Capitol riot, an attack the RNC partly framed as \"legitimate political discourse\" in rebuking the legislators.",
    "More:Rep. Cheney says Trump 'clearly unfit' for future office, citing his refusal to stop Jan. 6 attack on Capitol\nKinzinger said too many Republicans have allowed \"conspiracies and toxic tribalism\" to \"hinder their ability to see clear-eyed.\"",
    "Friday's RNC resolution, passed at a meeting in Salt Lake City at the behest of the former president's allies, said the two were participating in \"a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse.\"",
    "But the move shows how the ex-president - who lost the 2020 presidential election - has maintained his grip on the party, which faces questions ahead of the midterms about its appetite for anything other than lockstep loyalty to Trump.",
    "Cheney and others condemned Republicans for referring to events of Jan. 6 as \"legitimate political discourse,\" but RNC members said they were referring to innocent people caught up in the investigation.",
    "\"The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants,\" Cheney said.",
    "Cheney and others also condemned the resolution's reference to legitimate political discourse.? Tweeting out video of rioters assaulting police officers, Cheney said: \"This was January 6th.",
    "\"They chose to join Nancy Pelosi in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse that had nothing to do with violence at the Capitol.\"",
    "Sen. Mitt Romney, R-Utah, the uncle of RNC chair Ronna McDaniel, tweeted that \"shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.\"",
    "Cheney described herself as \"a constitutional conservative,\" and added that \"I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "Trump has long vowed political revenge against Cheney, Kinzinger and other Republicans who supported his impeachment for inciting the Jan. 6 insurrection.",
    "\"My efforts will continue to be focused on standing up for truth and working to fight the political matrix that's led us to this point,\" Kinzinger said.",
    "McDaniel and other Republicans said they weren't referring to violent offenders but to innocent people who have been ensnared in the investigation.",
    "Reps. Liz Cheney and Adam Kinzinger are the only Republicans on the House committee investigating the violent mob of Trump supporters last year.",
    "RNC members did not debate the censure resolution and passed it on a quick voice vote; there were a few scattered \"no's,\" but no recorded vote.",
    "He added; \"Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.\"",
    "Cheney is running for re-election via a Wyoming Republican primary against a Trump backed challenger, Harriet Hageman.",
    "RNC officials told reporters this week that some members wanted to expel Cheney and Kinzinger from the party.",
    "Barbara Comstock, a former Republican member of Congress, tweeted that \"this is a new low for the RNC.",
    "Cheney and Kinzinger instead warned of peril to the GOP should it continue down its current path.",
    "Some Republicans decried the Republican National Committee censure of Cheney and Kinzinger.",
    "That effort turned into a censure resolution after private negotiations with the the RNC.",
    "Liz Cheney and Adam Kinzinger crossed a line,\" said RNC Chairwoman Ronna McDaniel.",
    "They said the party is only helping Trump whitewash the events of Jan. 6.",
    "Beating cops is 'legitimate political discourse'?\"",
    "Kinzinger is not seeking re-election this year.",
    "This is not 'legitimate political discourse.'\"",
    "History will be their judge.\""
  ]
}