{
  "id": 626,
  "mediaId": 238,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "RNC votes to condemn Cheney, Kinzinger for serving on House committee investigating Jan. 6 attack on the Capitol by pro-Trump mob",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/02/04/sen-mitt-romney-condemns-gop-leaders-move-censure-reps-cheney-kinzinger-seeking-truth-about-jan-6-attack/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1147,
    1248,
    1248,
    2214,
    2214,
    2465,
    2465,
    428,
    428,
    427,
    427,
    562,
    562,
    571,
    571,
    2945,
    2945
  ],
  "sentences": [
    "It said the behavior of Cheney and Kinzinger has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic.? The two lawmakers also voted to impeach former president Donald Trump after last year's deadly insurrection.",
    "In 2020, Romney was the sole Senate Republican to vote to convict Trump of abuse of power; he also blasted Trump's efforts to pressure Republicans to overturn the 2020 presidential election as among the most undemocratic? actions ever taken by a sitting U.S. president.",
    "In addition to Friday's formal censure at the party's winter meeting in Salt Lake City, the RNC may fund a primary challenge to Cheney in Wyoming after Republican leaders passed a special rule to recognize her challenger as the party's presumptive nominee.",
    "She had used her maiden name for years in Michigan, where she was state party chair, but dropped Romney? from most official party communications upon becoming RNC chairwoman in 2017, following a request from Trump.",
    "They are not sticking up for hard-working Republicans.?\nA Cheney representative decried the party's position, reiterating her statement last week that Republicans were hostage? to former president Donald Trump.",
    "In a party that continues to embrace Trump, Cheney and Kinzinger have stood out as among the few congressional Republicans to denounce the former president's actions.",
    "It's a sad day for my party  and the country  when you're punished just for expressing your beliefs, standing on principle, and refusing to tell blatant lies.?",
    "and Adam Kinzinger (R-Ill.), the two Republican members of a House committee investigating the Jan. 6, 2021, attack on the U.S. Capitol by a pro-Trump mob.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.?\nMcDaniel is Romney's niece.",
    "We've had two members engage in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse,? she said.",
    "Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol,? Romney said.",
    "In an extraordinary rebuke, the Republican National Committee voted Friday to condemn Reps. Liz Cheney (R-Wyo.)",
    "The censure resolution passed overwhelmingly on a voice vote with no debate or discussion.",
    "Joining them on Friday was Sen. Mitt Romney (R-Utah), who criticized the RNC in a tweet.",
    "Larry Hogan, said in a tweet: The GOP I believe in is the party of freedom and truth.",
    "Another Trump critic in the GOP, Maryland Gov.",
    "This has gone beyond their original intent."
  ]
}