{
  "id": 635,
  "mediaId": 238,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Ten questions for Steny Hoyer",
  "image": "https://newsletter-imgs.s3.amazonaws.com/prod/the-202s/primary/early.svg",
  "link": "https://www.washingtonpost.com/politics/2022/02/04/ten-questions-steny-hoyer/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    724,
    982,
    1248,
    2010,
    2077,
    2164,
    2374,
    3085,
    3094,
    428,
    545,
    2976
  ],
  "sentences": [
    "I think the urgency of inflation, supply-side challenges, competitiveness challenges, self-sufficiency challenges  the urgency of all those matters, I think, lead to really demanding that we do this as quickly as possible.?\nThe call is coming from inside the Capitol: Concerns about low pay, hostile work environments and racial and gender discrimination have gripped Capitol Hill over the past week as an Instagram account called Dear White Staffers' has posted hundreds of testimonials from current and former aides that tell a dispiriting story about what it's like to work in the halls of Congress,? our colleague Marianna Sotomayor reports.",
    "One testimony talked about meetings where members ate lunch but staffers were required to stand with their backs against the wall, and not allowed to eat or sit.?\nAnother claimed that a member once asked them if they wanted to be a postal worker for the rest of [their] life' because they delivered an envelope on the House floor.?\nOne staffer shared that a member threw a pair of reading glasses at them after bringing the wrong pair.?",
    "The flood of testimonials tell a similar story about lawmakers singled out as bad bosses who are unrealistically demanding, expect staff to meet their every need immediately, without thanks or acknowledgment, and don't interact with low-level stuff much  and if they do, it's often to complain about something,? Sotomayor writes.",
    "g: Republican leaders forged an agreement this week to potentially fund a challenger to Rep. Liz Cheney in Wyoming, and party members are expected to formally condemn her for her work on the Jan. 6 committee [today], an unprecedented rebuke of an incumbent member of Congress,? our colleague Josh Dawsey reports.",
    "Hoyer: Well, that's what everybody quoted, but then he quickly added thereafter  what he meant was the bill that came from the House was not something that he could support and that therefore it would not be viable.",
    "The Early: When the New York Times asked you about a term limits proposal for House Democratic leaders in 2018, you responded, Is Tom Brady too old at 41 to be quarterback??\nHoyer: I was pretty prescient, wasn't I?",
    "As the party met in Salt Lake City this week, the leaders of the Wyoming GOP privately signed a special rule that would allow the national party to financially support Harriet Hageman, Cheney's primary challenger.",
    "If people think  and I hope the members do  that I've been effective and that I work hard and that I have their interests in mind and work on their behalf, then I would hope to be reelected majority leader.",
    "He wrote a book called The Hero Code.? I read that going to and from the memorial service for [former Senate Majority Leader] Harry Reid [(D-Nev.)], who was a friend of mine from 1962 to the day he died.",
    "I have been on the Hill for 10 years and don't have the courage yet to share my experiences, but there is power in numbers and watching these stories has been sadly validating,? one admitted.",
    "Don't call it the China bill: House Democrats are working to pass legislation as soon as today intended to bolster American manufacturing and strengthen the country's strained supply chains.",
    "Lawmakers have pitched the $250 billion bill as a way to compete with China  but Hoyer said that referring to the legislation as the China bill,? as some reporters have, is selling it short.",
    "The Early: You won a victory last month when the Supreme Court declined to hear House Republicans' challenge to the proxy voting system you helped put in place early in the pandemic.",
    "It's about how America will be resilient, self-sufficient and will not be subject to the whims of other countries and will not be as vulnerable to supply-side breakdowns.\"",
    "I don't think he meant  and I think he made it clear that he did not mean  that there weren't significant parts of the bill that he has in the past said he is for.",
    "The House bill differs from the Senate one, meaning lawmakers will need to hash out a compromise if it passes  which Hoyer said Democrats will hustle to do.",
    "The Early: Sen. Joe Manchin (D-W.Va.) said Tuesday that the Build Back Better Act was dead.? What do you see as a path forward for that bill at this point?",
    "): We chatted with the longest-serving House Democrat about what he's reading, the Republicans he'll miss when they retire and Tom Brady's best year ever.",
    "Do you think the system has been abused at all  such as when nine Republicans voted by proxy while at a political event on the border with Donald Trump?",
    "This bill is about much more than competition with China,? Hoyer, who has championed some of the ideas in the bill for years, said in an interview.",
    "The Early: To steal a question that New York magazine used to ask New Yorkers: Who is your favorite Marylander, living or dead, real or fictional?",
    "The rule officially recognizes Hageman as the presumptive nominee for the seat.?\nTen Questions for  House Majority Leader Steny Hoyer (D-Md.",
    "The Early: Given that Brady just retired I thought it might be a good time to ask whether you plan to remain majority leader next year.",
    "Roy Blunt likes to say Steny and I vote together all the time when there are at least 425 other people voting the same way.' [Laughs.]",
    "is my example of a public official with high integrity, absolutely honest, brilliant legislator and the courage of his convictions.",
    "Did some people use the proxy vote because for whatever reasons they couldn't get to the floor or didn't want to get to the floor?",
    "Hoyer: Look, I don't think either side can throw stones at the other on this, because obviously we adopted it for covid reasons.",
    "Everybody was saying, Tom Brady, 41, oh, boy, gotta get rid of him, he's too old.' And he had his best year ever at 44.",
    "And of course what he means by that is, When there's no opposition and we're all voting alike, Steny and I vote alike.",
    "Our federal laws are being written and edited by folks [meanwhile] we can't pay enough to EAT and pay RENT?",
    "What I'm starting to read now, and I'm just starting to read it, is Master of the Game,? by Martin Indyk.",
    "But leaving it in the political environment, I was elected to the state Senate at the age of 27 in 1966.",
    "this work is not sustainable and I'm done draining myself for minimal successes,? one submission read.",
    "Hoyer: The last book I finished was a small book, a wonderful book by Admiral [William] McRaven.",
    "I'm for the voter deciding, whether the voter is my constituents or whether it's my colleagues.",
    ")], a very reasonable deal, on setting up a bipartisan oversight committee to look at Jan. 6.",
    "[Senate Majority Leader Chuck] Schumer wants that, [House Speaker Nancy] Pelosi wants that.",
    "We need Republicans who are thoughtful and are not cowed by Donald Trump or anybody else.",
    "I think that's a loss to the country, and a loss to the Republican Party's mainstream.",
    "I'm going over to Israel at the end of the month, and so I started reading this book.",
    "The Senate passed its own version of the bipartisan legislation back in June, 68-32.",
    "Making it some arbitrary limit  there's some people at 50 who ought to be defeated.",
    "We're losing some really good Republicans from the House and from the Senate.",
    "Roy Blunt was the whip, and the leader for a while, when he was in the House.",
    "And a young fella, [23] years of age, was elected to the House of Delegates.",
    "And there's some people, I would suggest, at 75 or 85 who [shouldn't].",
    "?,? one anonymous responder mused after reading scores of complaints.",
    "The Early: Who is your closest friend on the other side of the aisle?",
    "This interview has been edited and condensed for length and clarity.",
    "If Roy told me he was gonna do something, I knew he was gonna do it.",
    "But what Roy and I have in common  we have respect for one another.",
    "The administration wants it signed as soon as possible,? he said.",
    "I wasn't sneezing, wasn't coughing, didn't have a sore throat.",
    "But other times we mostly don't vote alike.' And that's true.",
    "Yes, I think on both sides of the aisle, that's correct.",
    "He reached a deal with [Rep.] Bennie Thompson [(D-Miss.",
    "I'm just waiting to get a better offer and I'm out.",
    "But Kinzinger just decided that he couldn't do it.",
    "And I think he would say the same thing about me.",
    "And I credit that to the vaccine and the booster.",
    "is running [for reelection] and I hope she wins.",
    "Four of my great-grandchildren live in Maryland.",
    "The Early: What was the last book you finished?",
    "The next morning I felt like I had a head cold.",
    "Hoyer: Two of my daughters live in Maryland.",
    "Three of my grandchildren live in Maryland.",
    "Martin Indyk was our ambassador to Israel.",
    "The Early: You must be sad he's retiring.",
    "But, frankly, has it made any difference?",
    "I still have a little nasal congestion.",
    "He's the kind of Republican we need.",
    "Hoyer: [Rep.] John Katko [(R-N.Y.)].",
    "And what do you plan to read next?",
    "You know, I'm not for term limits.",
    "Hoyer: [Sen.] Roy Blunt [(R-Mo.)].",
    "[Rep. Adam] Kinzinger [(R-Ill.)].",
    "Now [Rep. Liz] Cheney [(R-Wyo.)]",
    "We tell one another the truth.",
    "[Sen.] Ben Cardin [(D-Md.)]",
    "Tuesday I tested positive.",
    "They're all my favorites.",
    "His name was Ben Cardin.",
    "But it hasn't been bad.",
    "And it's better today.",
    "Not a bad head cold.",
    "I forgot that quote.",
    "Hoyer: I really am.",
    "So I would say Ben.",
    "Hoyer: I feel fine.",
    "Hoyer: Yes, I do.",
    "So he's leaving.",
    "Absolutely not.",
    "[Laughs.]"
  ]
}