{
  "id": 637,
  "mediaId": 881,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "The GOP Is Now Officially Pushing Jan. 6 Conspiracy Theories",
  "image": "https://video-images.vice.com/articles/61fd4c08d7f5c90094b6e903/lede/1643990941130-gettyimages-1236945711.jpeg?crop=1xw:0.8428xh;0xw,0.1303xh&resize=1000:*",
  "link": "https://www.vice.com/en_us/article/7kbex9/gop-jan-6-conspiracy-theories",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron Joseph",
  "authorUrl": "https://www.vice.com/en/contributor/cameron-joseph",
  "termIds": [
    1850,
    1850,
    2131,
    2131,
    2214,
    2214,
    1248,
    1248,
    1145,
    1145,
    1147,
    1147,
    1170,
    1170,
    428,
    428,
    427,
    427,
    146,
    146
  ],
  "sentences": [
    "That can't be much more explicit: The GOP's official position is now that any investigation into how former President Donald Trump and his allies attempted to overturn the 2020 election, and the connection between that and the violent riot of Trump supporters who overran the Capitol and injured more than 140 policemen, is simply an attempt to sabotage? Republicans' chances in the midterm election.",
    "The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,? Cheney said in a Thursday statement.",
    "The RNC has a planned vote to censure Wyoming GOP Rep. Liz Cheney and Illinois GOP Rep. Adam Kinzinger, the two Republicans who bucked their party and joined the House Select Committee investigating the causes of the Jan. 6, 2021, attack on Congress.",
    "This shouldn't come as a shock: As VICE News previously reported, a large number of Republican state party chairs and RNC committee members have publicly supported Trump's election lies and other even wilder conspiracy theories.",
    "Bossie's original resolution called for Cheney and Kinzinger to be kicked out of the GOP, but that was watered down to a censure resolution by an RNC subcommittee before it unanimously passed this resolution on Thursday evening.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "It's also telling who wrote the resolution: Citizens United President David Bossiea top adviser to Trump who the former president initially put in charge of disputing his loss after the 2020 elections.",
    "Bossie ended up stepping aside for a time because he got COVID, giving Rudy Giuliani and his crew free rein, but was reportedly still involved in the plot to try to overturn Trump's election loss.",
    "He was at a Jan. 5 meeting at the Willard Hotel focused on how to put pressure on more members of Congress to object to the Electoral College results,? as one attendee told the New York Times.",
    "The RNC also changed its rules this week to allow it to fund Cheney's primary challenger, former RNC Committeewoman Harriett Hagemanending a longstanding policy of supporting GOP incumbents.",
    "Representatives Cheney and Kinzinger are participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse,? the resolution reads.",
    "The Republican National Committee plans to formally declare that the House investigation of the Jan. 6 Capitol riot amounts to persecution of ordinary citizens? on Friday.",
    "The resolution comes just days after Trump declared that he would consider pardoning those convicted of crimes on Jan. 6 if he becomes president again.",
    "I'm a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "No matter what.?\nCheney has already lost her leadership position and is facing a tough primary challenge.",
    "And it's a strong signal of exactly how much control Trump and his allies have over the Republican Party.",
    "The party apparatus has been mostly seized by pro-Trump activists, and this vote reflects that.",
    "But this resolution shows that many in the GOP don't think they've been punished enough.",
    "Kinzinger opted to retire rather than face a steep uphill fight for reelection.",
    "Others at that meeting included Giuliani, Mike Lindell, and Michael Flynn.",
    "The full RNC membership is expected to approve the resolution on Friday.",
    "I will never stop fighting for our constitutional republic.",
    "And anyone who supports those efforts will be punished.",
    "Cheney fired back at the resolution.",
    "History will be their judge."
  ]
}