{
  "id": 638,
  "mediaId": 21,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "RNC Chairwoman Ronna McDaniel says January 6 committee is a 'Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse'",
  "image": "https://i.insider.com/61fd38f98a52640019fe3ed2?width=1300&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/rnc-ronna-mcdaniel-january-6-persecution-ordinary-citizens-legitimate-discourse-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    982,
    982,
    1170,
    1170,
    1248,
    1248,
    2214,
    2214,
    1685,
    1685,
    146,
    146,
    427,
    427,
    428,
    428,
    2976,
    2976
  ],
  "sentences": [
    "Given the violent nature of the January 6 attack on the Capitol  several people, including both rioters and officers, died that day and at least 768 people have been charged for their participation  it was unclear what exactly McDaniel was referring to by \"legitimate political discourse,\" and an RNC spokesperson did not immediately respond to Insider's request for comment.",
    "McDaniel made the remarks about the committee in a joint interview with The Washington Post alongside David Bossie, a fellow RNC official and former Trump campaign aide, with whom she co-authored a resolution to censure Republican Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois over their participation in the congressional committee.",
    "\"The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,\" she said, referring to the former president's most recent bombshell disclosures.",
    "'The leaders of the Republican Party have made themselves willing hostages'\nThe censure resolution is the latest turn in the party's ongoing feud with Cheney, who joined Kinzinger and 8 other House Republicans in voting to impeach former President Donald Trump last year for incitement of an insurrection.",
    "Josh Dawsey (@jdawsey1) February 4, 2022\nThat measure, which says the RNC will \"cease any and all support\" for the two Republicans, easily passed the party's resolutions committee on Thursday, and is expected to be approved on Friday at the RNC meeting in Salt Lake City.",
    "Her comments mirrored language in the censure resolution itself, which accuses Kinzinger and Cheney of \"sabotage\" and says the duo are \"utilizing their past professed political affiliation to mask Democrat abuse of prosecutorial power for partisan purposes.\"",
    "Republican National Committee Chairwoman Ronna McDaniel said the select committee investigating the January 6 attack on the US Capitol is a \"Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse.\"",
    "The Post also reported that GOP officials in Wyoming struck a deal with the national party to financially support Harriet Hageman, a former RNC committeewoman who's been endorsed by Trump, in her primary against Cheney this year.",
    "Liz Cheney (@Liz_Cheney) February 4, 2022\nKinzinger, who unlike Cheney has opted not to run for re-election, also tweeted that he had \"no regrets about my decision to uphold my oath of office and defend the Constitution.\"",
    "However, the Post reported that McDaniel took particular issue after an \"elderly, recently widowed friend of hers\" received a subpoena from the committee for serving as an alternate, pro-Trump elector in 2020.",
    "After House Republicans voted in May to boot Cheney from her caucus leadership position and replace her with Republican Rep. Elise Stefanik of New York, Cheney joined the January 6 committee as vice chair.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Jabin Botsford/The Washington Post via Getty Images\nThe Republican National Committee is set to censure Reps. Cheney and Kinzinger on Friday.",
    "That letter officially recognizes Hageman as the presumptive nominee Cheney's seat, even though the primary won't take place until August.",
    "\"We've had two members engage in a Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse.",
    "She also called the committee a \"persecution of ordinary citizens who engaged in legitimate political discourse.\"",
    "RNC Chairwoman Ronna McDaniel co-authored the censure resolution, which targets the January 6 committee.",
    "RNC Chairwoman Ronna McDaniel at Republican National Convention on August 24, 2020 in Washington, DC.",
    "In response, Cheney slammed GOP leadership, writing on Twitter that they were \"hostages\" to Trump.",
    "She also said it was the first time she was aware of the party censuring a member of Congress.",
    "In November, the Wyoming GOP voted to no longer recognize her as a member of their party.",
    "And she's remained outspoken about her belief that Trump poses a threat to democracy.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "The members have shown tremendous support for this,\" McDaniel told the Post.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "They are not sticking up for hard-working Republicans,\" McDaniel said.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Stay up to date with what you want to know.",
    "This has gone beyond their original intent.",
    "Sign up for notifications from Insider!",
    "\"This isn't a top-down situation.",
    "Loading Something is loading."
  ]
}