{
  "id": 640,
  "mediaId": 112,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Republican officials now look to censure Cheney and Kinzinger, not oust them",
  "image": "https://images.mktw.net/im-478430?width=700&size=1.5005861664712778&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/republican-officials-now-look-to-censure-cheney-and-kinzinger-not-oust-them-01643943519",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    2214,
    2214,
    1248,
    1248,
    1335,
    1335,
    1170,
    1170,
    1147,
    1147,
    428,
    428,
    427,
    427,
    146,
    146,
    562,
    562,
    2976,
    2976
  ],
  "sentences": [
    "The draft censure resolution accuses Kinzinger and Cheney of participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse? and of utilizing their past professed political affiliation to mask Democrat abuse of prosecutorial power for partisan purposes.?\nIt says the RNC will immediately cease any and all support? of Kinzinger and Cheney as members of the party and says the RNC denounces those who deliberately jeopardize victory in November.?\nRepublican Party Chair Ronna McDaniel did not respond to request for comment Thursday on the resolution changes, but Dhillon said RNC resolutions are routinely revised.",
    "The initial draft, obtained by The Associated Press, had accused Cheney and Kinzinger of serving as pawns to parrot Democrat talking points? on the Jan. 6 House committee and chided them for deposing their colleagues and pursuing what amounts to a third political impeachment of President Trump.?\nThe Conference must not be sabotaged by Rep. Liz Cheney and Rep. Adam Kinzinger who have demonstrated, with actions and words, that they support Democrat efforts to destroy President Trump more than they support winning back a Republican majority in 2023,? it said.",
    "Associated Press\nParty seeks to punish anti-Trump lawmakers; RNC vote expected Friday\nSALT LAKE CITY  Republican officials meeting in Utah advanced a watered-down resolution Thursday that would formally censure GOP Reps. Liz Cheney and Adam Kinzinger for their perceived disloyalty to former President Donald Trump but not seek to expel them from the party.",
    "Kinzinger released a statement after the vote saying conspiracies and toxic tribalism? were hindering Republicans' ability to see clear-eyed.?\nRather than focus their efforts on how to help the American people, my fellow Republicans have chosen to censure two lifelong members of their party for simply upholding their oaths of office,? he said.",
    "The resolution's passage through a subcommittee followed hours of hand-wringing over language that initially would have called on the House Republican Conference to oust Cheney and Kinzinger, the only Republicans on the House committee investigating the Jan. 6 insurrection at the Capitol.",
    "The former president and other GOP members were incensed when Kinzinger and Cheney agreed to House Speaker Nancy Pelosi's invitation to join the Democratic-led House committee investigating the insurrection, giving the panel a veneer of bipartisan credibility.",
    "The effort to punish Cheney, of Wyoming, and Kinzinger, of Illinois, comes as party officials juggle preparation for this year's midterm elections, when control of Congress and 36 governorships are at stake, with planning for the 2024 presidential election.",
    "The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn' a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,? she said.",
    "The resolution to expel Cheney and Kinzinger was spearheaded by David Bossie, a Maryland committee member who previously served as a Trump campaign adviser, and Frank Eathorne, chair of Wyoming's Republican Party.",
    "That included over $2 million over the last three months of 2021, more than four times as much as her leading primary opponent raised, and Cheney finished the year with over 10 times as much campaign money.",
    "The RNC has no formal power over the party's congressional members, so how much weight a resolution to expel them from the House Republican Conference would have carried in Congress if passed is unclear.",
    "In Salt Lake City this week, they've discussed where to host their 2024 party convention and whether to compel their candidates not to participate in presidential debates, a cause important to Trump.",
    "Wyoming allows voters to change party affiliation at the polls, meaning Cheney could draw enough independent and even Democratic support to prevail in the Republican primary Aug. 16.",
    "But the last-minute change to the resolution puts in question Trump's overarching influence on a party apparatus that has largely acquiesced to his wishes.",
    "Cheney has already been censured by the Wyoming Republican Party, but the voters who will determine her fate are less conservative than party insiders.",
    "The censure resolution is expected to be voted on Friday by all 168 Republican National Committee members at their winter meeting in Salt Lake City.",
    "Cheney over the past year has raised $7.2 million, ranking ninth among all U.S. House candidates, according to the Federal Election Commission.",
    "Cheney said in a tweet Thursday night that she didn't recognize those she felt had abandoned the U.S. Constitution in service of Trump.",
    "This is not time well spent,? Bill Palatucci, a committee member from New Jersey, said of the effort to punish Cheney and Kinzinger.",
    "It's distracting from what should be our main objective: winning back the House and the Senate.",
    "It's a middle ground,? RNC member Harmeet Dhillon said, noting that the vote was unanimous.",
    "Not every RNC member was supportive of the initial draft resolution for expulsion.",
    "There are many anti-Trump Republicans that are not included in this resolution.",
    "Eathorne declined to comment on the revised resolution after its passage.",
    "These two took a specific action to defy party leadership,? she added.",
    "We want to send a message that we're disapproving of their conduct.",
    "We should be focused on taking on Democrats and not each other.",
    "This is not about being anti-Trump."
  ]
}