{
  "id": 641,
  "mediaId": 21,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Rep. Liz Cheney slams Republican leaders as 'hostages' to Trump after RNC committee votes to advance censure",
  "image": "https://i.insider.com/61fc903eb0ec040018d0cd3e?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/liz-cheney-slams-republican-leaders-after-rnc-votes-advance-censure-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Erin Snodgrass",
  "authorUrl": "https://www.businessinsider.com/author/erin-snodgrass",
  "termIds": [
    1039,
    1147,
    1248,
    2214,
    3094,
    78,
    427,
    428
  ],
  "sentences": [
    "\"The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,\" Cheney tweeted following the Thursday vote.",
    "According to Politico's David Siders, members of the Republican National Committee's resolutions committee unanimously voted Thursday to advance the resolution to censure Cheney and Kinzinger, who are the only two Republican lawmakers serving on the January 6 House select committee.",
    "According to CNN, a previous version of the resolution called for Cheney and Kinzinger to be expelled from the Republican Party's conference, but the final version was \"watered down\" after some RNC members worried the effort to punish the lawmakers was too extreme.",
    "In May 2021, Republicans voted to remove Cheney from her leadership position in the House, and the Wyoming Republican Party voted to no longer recognize her as a member of their party in November last year.",
    "In September, Trump endorsed a GOP primary challenger against Cheney, but Rolling Stone reported that candidates backed by the former president are lagging behind their incumbent rivals in fundraising.",
    "Fox News reported that Thursday's closed-door meeting included little discussion of the resolution itself, though the specific language used in the proposal was fiercely debated prior to the gathering.",
    "The motion to censure heads next to the RNC's Friday general session meeting, where the organization's entire body is set to vote on the proposal during the party's winter gathering in Salt Lake City.",
    "Liz Cheney (@Liz_Cheney) February 4, 2022\n\"I'm a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump,\" she added.",
    "Rep. Liz Cheney skewered top Republicans after an RNC committee voted to advance a censure targeting her and Rep. Adam Kinzinger for serving on the panel investigating the January 6 attack.",
    "Cheney has already broken her own fundraising records, raising more than $2 million in the final quarter of 2021 and bringing her total to $7.2 million, ABC News reported.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "\"I will continue to focus my efforts on standing for truth and working to fight the political matrix that's led us to where we find ourselves today,\" Kinzinger tweeted.",
    "Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois, 2 of the Republicans who voted to hold Mark Meadows in criminal contempt of Congress, on July 27, 2021.",
    "Following Thursday's vote, the Illinois lawmaker said he had \"no regrets\" about his decision to \"uphold my oath of office and defnd the Constitution.\"",
    "Andrew Harnik/AP Photo\nAn RNC committee voted to advance a censure targeting Reps. Liz Cheney and Adam Kinzinger Thursday.",
    "They were also two of the ten GOP members who voted to impeach former President Donald Trump following the insurrection.",
    "According to CBS News, the motion could be amended during the Friday session, but supporters expect it to pass.",
    "Cheney slammed top Republicans in a statement following the vote, calling them \"hostages\" to Trump.",
    "The whole organization is set to vote on the proposal during the RNC's winter meeting on Friday.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Kinzinger announced in October that he would not run for reelection in 2022.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "I will never stop fighting for our constitutional republic.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"History will be their judge.",
    "Loading Something is loading.",
    "No matter what.\""
  ]
}