{
  "id": 643,
  "mediaId": 151,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "GOP set to rebuke Cheney, Kinzinger",
  "image": "https://static.politico.com/09/61/5c087ce74cf5be1dd313d28f0bcf/gettyimages-1330932262.jpg",
  "link": "https://www.politico.com/news/2022/02/03/gop-rebuke-cheney-kinzinger-00005547",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    949,
    1132,
    1147,
    1248,
    1685,
    2214,
    3094,
    422,
    427,
    428,
    2892
  ],
  "sentences": [
    "Cheney called leaders of the Republican Party willing hostages? to Trump, while Maura Gillespie, Kinzinger's deputy chief of staff, said in an email that the RNC's time would be better served by focusing on 2022 rather than an unprecedented and shortsighted effort to purge two lifelong Republicans for simply telling the truth and upholding their oaths of office.?\nBill Palatucci, a national committeeperson from New Jersey who opposed the resolution, said after the meeting that while the outcome was somewhat better than initially proposed, the measure still wasn't a worthwhile use of the party's time.",
    "Republicans meeting here fumed over Cheney and Kinzinger's participation on the Jan. 6 committee, which Trump earlier Thursday called a corrupt Unselect Committee of political hacks and highly partisan sleazebags.? And even among RNC members who were hesitant to engage in intraparty warring, several said they would likely support the censure resolution on Friday.",
    "| Chip Somodevilla/Getty Images\nBy David Siders and Natalie Allison\n 02/03/2022 08:04 PM EST\nSALT LAKE CITY  Members of the Republican National Committee are pushing forward with a resolution to censure Reps. Liz Cheney and Adam Kinzinger, while stopping short of calling for their expulsion from the House Republican Conference.",
    "The measure rebukes Cheney and Kinzinger for their involvement on the Jan. 6 select committee investigating Donald Trump's effort to overturn the result of the 2020 election, said Harmeet Dhillon, national committeeperson from California and one of several dozen sponsors of the resolution.",
    "Still, for the Republican National Committee to censure two of its own members is significant  a pointed escalation in the GOP's bid to purge itself of Republicans perceived as disloyal to Trump.",
    "Led by David Bossie, a longtime Trump ally and RNC member from Maryland, ardent Cheney and Kinzinger critics had lobbied for a resolution calling for their ouster from the House conference.",
    "Cheney and Kinzinger, two of 10 House Republicans who voted to impeach Trump following the riot at the Capitol, are widely loathed within the RNC for their lack of fealty to Trump.",
    "The resolution, which RNC officials said cleared an RNC committee vote on Thursday, is likely to be approved by the RNC's full body at its winter meeting on Friday.",
    "Several RNC members said they feared it would create a political headache for both the House minority leader, Kevin McCarthy, and the RNC chair, Ronna McDaniel.",
    "These two took specific action to defy party leadership.?\nThe resolution would amount to a weaker admonishment of Cheney and Kinzinger than initially proposed.",
    "Kinzinger, of Illinois, is not seeking reelection this year, while Cheney, the Wyoming Republican and fierce critic of Trump, is facing a primary challenge.",
    "In statements earlier this week, Cheney and a Kinzinger spokesperson defended their records as conservatives and criticized the RNC for assailing them.",
    "Rep. Liz Cheney and Rep. Adam Kinzinger participate in a hearing of the House Select Committee investigating the Jan. 6 attack in July 2021.",
    "McDaniel said in November that Cheney obviously? is still a Republican.?\nMcDaniel spoke in favor of the resolution as passed, Dhillon said.",
    "For the national party, however, calling for the lawmakers' ouster entirely from the House conference would have been more complicated.",
    "That proposal had drawn resistance from some RNC members, who said they feared the language was unnecessarily inflammatory.",
    "There are plenty of other people in the party who are anti-Trump whose names don't appear in the resolution.",
    "State party leaders in Wyoming voted in November not to recognize her as a member of their party.",
    "I'm glad it was watered down to essentially just a statement of the committee.",
    "But we should be shooting at Democrats, not Republicans.?",
    "This is not about them being anti-Trump,? Dhillon said.",
    "I still don't think it's a good idea,? he said."
  ]
}