{
  "id": 652,
  "mediaId": 43,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Over 100 extremist candidates demonstrate how",
  "image": "https://images.dailykos.com/images/1033968/story_image/GettyImages-1233553679.jpg?1644008896",
  "link": "https://www.dailykos.com/story/2022/2/4/2078644/-Over-100-extremist-candidates-demonstrates-how-radical-right-takeover-of-GOP-is-complete",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    694,
    1031,
    1147,
    3094,
    28,
    428,
    2706,
    2773
  ],
  "sentences": [
    "In September 2021, during a Justice for J6 rally,? Arizona State Rep. Walter Blackman, U.S. congressional candidate (R-AZ), reportedly told the crowd, \"The Proud Boys came to one of my events and that was one of the proudest moments of my life.? In March 2021, former Texas GOP chair and 2022 Texas gubernatorial candidate Allen West appeared on the same stage as Oath Keeper leader Stewart Rhodes during an anti-immigration rally in Laredo, Texas.",
    "What is new and really dangerous for democracy is that they're increasingly running as Republican candidates.?\nAs Olmos observes, some of these extremistsparticularly Idaho gubernatorial candidate Ammon Bundy, infamous for leading the 2016 armed standoff at Oregon's Malheur National Wildlife Refugehave been using their GOP campaigns to expand their already existing networks of far-right activists.",
    "Their strategy as they move down that path, demonstrated over the past year, has involved targeting local politicsschool boards, county commissions, city councilsfor far-right takeovers by extremist Patriots? such as what we have recently seen in Shasta County, California, and elsewhere, fueled by the ugly proto-fascist politics of menace and intimidation.",
    "There are also at least a dozen Republican candidates included on the list who have explicit connections to extremist groups or movements including white supremacists, anti-government extremists and members of the far-right Proud Boys?:\nAt least two dozen candidates have expressed admiration for or appeared in public alongside extremists.",
    "Meanwhile, the very few Republicans who have refused to succumb to the extremist tide and have supported the Jan. 6 commission investigation and the impeachment of Trump that shortly followed the insurrection have been severely punished for doing so by the party's apparatchiks, with the apparent approval of GOP voters.",
    "A number of themincluding Darren Aquino, a Florida candidate for the U.S. House; Melissa Carone, Rudy Giuliani's election-fraud witness,? seeking a seat in the Michigan House; and Alison Hayden, running for a congressional seat in Californiahave tweeted out QAnon's #WWG1WGA? hashtag slogan.",
    "#AMERICAFIRST #NICKFUENTES.? On January 6, 2022, Taurus tweeted, A great night honoring the J6 Heroes!?\nThe radicalization of the Republican Party has been a decades-long process, reaching its seeming apotheosis in the Jan. 6, 2021, attack on the U.S. Capitol by pro-Trump extremists.",
    "But rather than reeling back from the violence and radicalism, the GOP establishment instead has embraced the Patriot? movement that led the insurrection, even as those forces have hardened into an anti-democratic insurgency intent on overthrowing liberal democratic rule.",
    "Republicans have done this by brazenly lying to cover their culpability for the insurrection, gaslighting the public about who was responsible with bloody shirt? rhetoric that inverts the reality by making the perpetrators into victims and the victims into perpetrators.",
    "Bundy, who only moved to the state in 2015 but is campaigning around the slogan Keep Idaho Idaho,? has been able to expand the membership of his far-right People's Network,? which has primarily been advancing the cause of COVID denialism in the state.",
    "The radicalization of the Grand Old Party into a far-right political entity is a now a fait accompli, manifested in the extraordinary incoming tide of Republican candidates who openly embrace extremist conspiracism and Trumpian authoritarianism.",
    "Additionally, the GOP currently boasts 207 elected officials who aided Donald Trump in his efforts to overturn the 2020 election, according to the voting rights organization Public Wise, which lists them all in its Insurrection Index.",
    "The real danger is not just the wave of extreme candidates, it's their embrace, their mainstreaming by the Republican party,? Harvard professor Steven Levitsky, the co-author of How Democracies Die, told Sergio Olmos of The Guardian.",
    "It is apparent that the conservative movement, as Tucker Carlson and his guest Jesse Kelly suggested last year, is giving up on democracy and embracing right-wing authoritarianism, moving down the road to explicit fascism.",
    "Sharing a photo of himself posing with Fuentes he tweeted A legend and inspiration to us all!? On Facebook Taurus shared the same photo with the caption, This guy is the truth and it was an absolute honor to meet him!",
    "As the ADL's report observed: Support for such candidates demonstrates a continuing shift of the so-called Overton Windowthe parameters of what is considered normal' or acceptable' in political and social discourse.",
    "This ever-shifting window signals an expanding mainstream acceptance of extreme beliefs and ideologies.?\nAt first you had a flirtation and tolerance with a handful of extremists at the fringes,? Levitsky told Olmos.",
    "The ADL's list includes candidates who have no direct links to extremist organizations, but who promote far-right views, openly associate with radical ideologues, or embrace extremist conspiracy theories.",
    "Just this week, the two Republican Congress members who sit on the commission, Liz Cheney and Adam Kinzinger, were officially censured by the party, which also voted to support Cheney's primary opponent.",
    "What makes the transformation complete is that not only has the GOP establishment refused to oppose this extremism and denounce the rising tide, but it is actively punishing any Republicans who do.",
    "In June 2021, Nick Taurus, U.S. congressional candidate (R-CA), took to social media to boast about meeting with Nick Fuentes, a white supremacist leader and organizer.",
    "A recent survey by the Anti-Defamation League (ADL) found more than 100 such problematic? candidates running for office in 2022 under the Republican banner.",
    "The extremism they embrace runs the gamut, from authoritarian QAnon cultists to insurrection-friendly Patriots? to COVID denialists to white nationalists.",
    "'Patriot' movement figure Ammon Bundy has been expanding his 'People's Network' operation while running for the Republican nomination for Idaho governor.",
    "Congressmen and Fox News anchors have insisted that it wasn't an insurrection,? while GOP politicos have publicly valorized the insurrectionists.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "They're marching in and taking over the Republican party at the state and local level.?\nThis is a short blurb about Daily Kos.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "(Bundy is also competing for the GOP governor's nomination with another far-right extremist, Lt. Gov.",
    "It tracked at least 45 candidates seeking office in 2020 who promote QAnon conspiracy theories.",
    "The United States has always had nutty, extremist, authoritarian politicians around the fringe.",
    "The network currently has some 33,000 members with 398 activist leaders in 39 states.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "We're now seeing an army of extremists embraced by the former president.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Click here to donate $3 now.",
    "AMERICA FIRST IS INEVITABLE!",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Janice McGeachin.)",
    "Please read it."
  ]
}