{
  "id": 656,
  "mediaId": 238,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Opinion: The RNC turns into an Orwellian horror show",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/07/rnc-censures-cheney/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2214,
    2214,
    1840,
    1840,
    1248,
    1248,
    1434,
    1434,
    428,
    428,
    2946,
    2946,
    2892,
    2892
  ],
  "sentences": [
    "From fanning the big lie? to fomenting a violent insurrection to whitewashing the violence to excusing the former president's sedition to censuring two Republican representatives investigating Jan. 6 to blessing the violent insurrectionists (ordinary citizens engaged in legitimate political discourse,? its resolution declared) the Republican Party has underscored its complete dependency on the delusional cult leader who candidly admits that he sought to overthrow the election and that he would pardon the violent seditionists.",
    "Republicans remaining under the banner of the GOP have a serious dilemma: Their membership in the pro-seditionist party is inconsistent with their oaths to support and defend the Constitution of the United States against all enemies, foreign and domestic.? After all, they remain allied with and thoroughly loyal to the chief domestic enemy of democracy.",
    "It boggles the mind that such questions have to be asked; it is terrifying that, other than Cheney, virtually all Republicans on the ballot this year likely would avoid answering these basic questions or would answer in ways that establish their complicity in the assault on our democracy.",
    "The Republican Party has betrayed our democratic system  first by refusing to accept the results of the 2020 election, then by exonerating the violators and censuring the defenders of our Constitution at its recent meeting in Salt Lake City.",
    "It is time for the media and for their political opponents to demand answers from each and every Republican on the ballot:\nDid defeated president Donald Trump and/or his vice president have the right to overturn the election?",
    "Before she loses a primary to a MAGA-backed Republican, she would be wise to get on the ballot as an independent conservative who will not vote for a MAGA speaker if Republicans wind up in the majority.",
    "The two are mutually exclusive, and even for good? Republicans such as Cheney, Kinzinger and Sen. Mitt Romney (R-Utah), it is no longer tenable to avoid the choice: the GOP or the Constitution?",
    "There is frankly every reason, indeed the obligation, for Cheney, Kinzinger and others unwilling to knuckle under to the Sedition Party to run as independents or as members of a new party.",
    "Even sycophantic former vice president Mike Pence, who apparently struggled with the decision to try to reverse the election, was forced to concede, President Trump is wrong.",
    "and Adam Kinzinger (R-Ill.) seemed appropriate for a gang that has come to resemble the Party in George Orwell's 1984.? Up is down, night is day.",
    " I had no right to overturn the election.? But the party is now on record celebrating the coup and renouncing the sanctity of our elections.",
    "Should people held in contempt of Congress for refusing to testify about their knowledge of Jan. 6 be allowed to hold office?",
    "Should anyone involved in the effort to overthrow the election be prosecuted to the full extent of the law?",
    "Certainly, no House candidate in good conscience could elect to leadership any of the Trump defenders.",
    "Do you support pardons for those who have pleaded guilty or been convicted of attacking the Capitol?",
    "How can you conceive of supporting those who sought to overturn the election for president?",
    "Should members of Congress be able to defy a subpoena to testify about the election coup?",
    "One cannot be a GOP member in good standing these days and still uphold one's oath.",
    "She might start a trend, and deprive the Seditionist Party of a House majority.",
    "She's now running in a party that repudiates her deepest held values.",
    "The party time and again has sided with treacherous seditionists.",
    "A star chamber rendering judgment on Reps. Liz Cheney (R-Wyo.)",
    "Was the effort to do so a violation of our democratic system?",
    "How can you remain in a party that sides with seditionists?",
    "What about disqualification from holding federal office?",
    "Cheney says she no longer recognizes her party.",
    "Trump is always right.",
    "No wonder."
  ]
}