{
  "id": 668,
  "mediaId": 118,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Republicans Formally Censure Cheney and Kinzinger for Investigating January 6",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/02/20220204-kinzingercheney.jpg",
  "link": "https://www.motherjones.com/politics/2022/02/republicans-formally-censure-cheney-and-kinzinger-for-investigating-january-6/",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Noah Y. Kim",
  "authorUrl": "https://www.motherjones.com/author/noah-y-kim/",
  "termIds": [
    955,
    1147,
    1248,
    2214,
    2465,
    3094,
    427,
    428,
    562
  ],
  "sentences": [
    "The committee's resolution reads, in part: WHEREAS, Representatives Cheney and Kinzinger are participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse, and they are both utilizing their past professed affiliation to mask Democrat abuse of prosecutorial power for partisan purposes, therefore be it RESOLVED, That the Republican National Committee hereby formally censures? Cheney and Kinzinger.",
    "It casts those being investigated in connection with the riot or Trump's efforts to overturn the election as ordinary citizens? participating in legitimate political discourse.?\nSince the storming of the Capitol, many Republicans have steadily revised their positionfrom denouncing the rioters to downplaying the gravity of the attack to hinting that the rioters kinda-sorta had a point.",
    "On Twitter, Sen. Mitt Romney (R-Utah) cast shame? on the party (and, by extension, his niece, RNC chair Ronna McDaniel) for censuring Kinzinger and Cheney, whom he described as persons of conscienceseeking truth even when doing so comes at great personal cost.?\nShame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol.",
    "In the immediate aftermath of the riot, as Democrats announced that they would initiate new impeachment proceedings, politicians and pundits asked whether inciting a coup might be one step too far for a party that had already rationalized countless transgressions from its leader.",
    "In opting to punish Cheney and Kinzinger, the Republican Party went even further, signaling that its official position going forward will be that January 6 was justified and the 2020 election was fraudulent.",
    "At its winter meeting, the Republican National Committee overwhelmingly voted to censure Cheney and Kinzinger, the sole Republican members of the select committee investigating the attack on the Capitol.",
    "WHEREAS, the Republican Party has decided that hitching its wagon to Trump is the only path forward, the draft resolution echoes some of the most extreme Trumpist talking points on the insurrection.",
    "This could also be said of the Republican Party, which, already in the lowest deep, was devoured by an even lower deep today when it all but excommunicated Reps. Liz Cheney (R-Wyo.)",
    "The Republican Party has come a long way since January 6, when some of its leaders seemed, for a few brief seconds, to sour on Trump and the right-wing movement he'd harnessed.",
    "Kinzinger, like several other Republicans who voted to impeach Donald Trump, has already announced that he won't seek another term.",
    "In the lowest deep, a lower deep/ Still threat'ning to devour me, opens wide,? says Satan in Book IV of Paradise Lost.",
    "and Adam Kinzinger (R-Ill.) for the unpardonable sin of trying to get to the bottom of the January 6 Capitol riot.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.",
    "But after today's resolution, the Republican Party will officially back Cheney's primary challenger.",
    "The usual anti-Trump Republicans stood up for their compatriots.",
    "One year later, the answer is clear."
  ]
}