{
  "id": 6688,
  "mediaId": 157,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "A Las Vegas paper just published a stunning editorial: 'We are struggling to identify' Republicans 'who are not an active threat' to democracy",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29816857&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/a-las-vegas-paper-just-published-a-stunning-editorial-we-are-struggling-to-identify-republicans-who-are-not-an-active-threat-to-democracy/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.rawstory.com/u/alex_henderson_alternet",
  "termIds": [
    818,
    1248,
    2214,
    3094,
    3102,
    428,
    2661,
    2751,
    2818
  ],
  "sentences": [
    "As we wrote last October, Clark County Sheriff Joe Lombardo disgraced himself by not condemning the violent right-wing groups that have been welcomed into the Nevada GOP, leaving Southern Nevadans to wonder whether their sheriff will protect and serve everyone in our community regardless of political persuasion.?\nNevadas Republican and Democratic primaries will be held on June 14.\nOf the five leading Republican candidates for the governorship of Nevada, every one of them has gone on record as both supporting and contributing to the Big Lie,? the Suns editorial board laments.",
    "(Nevada) gubernatorial candidate Joey Gilbert was actually at the Capitol that day, spinning unfounded conspiracy theories about election fraud and accusing those Republicans who believe the vote was legitimate of being RINOs (Republicans in Name Only) who should be removed from the party.?\nThe editorial board continues, (Gilbert) didnt think that those who vandalized the halls of our Capitol or threatened police officers should be tossed out; he cheered them on.",
    "From Pennsylvania to the southwestern swing state of Nevada, the Big Lie has become a litmus test in the Trumpified GOP  and the Las Vegas Suns editorial board, in a biting editorial published on May 15, poses the question: Are there any Republicans left who are willing to stand up for democracy?",
    "The answer to that question is that yes, some right-wing Republicans are willing to aggressively stand up for democracy  in the U.S. House of Representatives, for example, Rep. Liz Cheney of Wyoming and Rep. Adam Kinzinger of Illinois have been blistering critics of the Big Lie.",
    "For our voters.?\nThe Suns editorial board goes on to describe the violent insurrection? of January 6, 2021 and the vicious assault on the U.S. Capitol Building as one of the darkest days in U.S. history?  arguing that the Big Lie is just as toxic now as it was then.",
    "On Tuesday, May 17, the Big Lie and the Stop the Steal? movement enjoyed a major victory when Pennsylvania State Sen. Doug Mastriano  a far-right Christian nationalist and QAnon ally  won the 2022 GOP gubernatorial nomination in the Keystone State.",
    "Since the insurrection,? the Suns editorial board warns, Republican leadership across the nation has worked to disenfranchise voters, allow themselves to defy the will of voters outright and to allow partisan interference in the vote count.",
    "Yet as we survey the field of Republican candidates across the state, we are struggling to identify those who are not an active threat to American democracy or the institutions of government that have sustained our republic for 250 years.",
    "Mastriano has been a forceful supporter of the claim that the 2020 presidential election was stolen from former President Donald Trump, but he is hardly alone in that regard.",
    "Or will they continue to debase themselves and their formerly great party by kneeling to their unhinged demigod, Donald Trump, and his dreams of authoritarianism??",
    "In doing so, they have all made a choice to subvert our democracy, undermine the integrity of our elections, and ignore the Constitution of the United States.",
    "The Suns editorial board focuses heavily on Nevada politics, but its message is relevant whether one lives in Nevada, Texas, Pennsylvania, Florida or Maine.",
    "But Kinzinger isnt seeking reelection, and Cheney will be gone from the House in 2023 if she loses a GOP congressional primary in Wyoming.",
    "Cheney and Kinzinger are the exception, not the norm, in the MAGA-oriented, increasingly authoritarian GOP of 2022.",
    "No one knows better than Nevadans when its time to put our cards on the table,? the Suns editorial board writes.",
    "Will GOP leaders stand up for the rule of law and free and fair elections by rejecting autocracy and lies?",
    "The editorial board, and Nevadans as a whole, are facing an agonizing problem.",
    "We have endorsed Republicans in the past and might do so again in the future.",
    "Those are the stakes here for the GOP.",
    "And hes not alone.",
    "For Nevada."
  ]
}