{
  "id": 669,
  "mediaId": 237,
  "date": "2/3/2022 12:00:00 AM",
  "headline": "RNC censure resolution against Cheney and Kinzinger advances",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/950335.png",
  "link": "https://www.washingtonexaminer.com/news/rnc-censure-resolution-against-cheney-and-kinzinger-advances",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan King",
  "authorUrl": "https://www.washingtonexaminer.com/author/ryan-king",
  "termIds": [
    717,
    1125,
    1147,
    1248,
    1335,
    1544,
    1609,
    1614,
    1839,
    2214,
    3094,
    183,
    427,
    428,
    562,
    2707
  ],
  "sentences": [
    "\"The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,\" Cheney tweeted.",
    "The RNC's resolution committee unanimously passed a motion to censure the two Republican critics of former President Donald Trump on Thursday over their activity on the House select committee investigating the Jan. 6 Capitol riot, CNN reported.",
    "House Speaker Nancy Pelosi appointed Cheney and Kinzinger to the Jan. 6 committee last year after House Minority Leader Kevin McCarthy withdrew his recommendations in response to Pelosi rejecting two of them.",
    "Lawyers for some Trump allies embroiled in legal disputes with the committee have argued in court documents that the ranking member of the committee should have been appointed by the minority party.",
    "I will continue to focus my efforts on standing for truth and working to fight the political matrix that's led us to where we find ourselves today,\" Kinzinger said in a tweet.",
    "Kinzinger has since announced that he will not seek reelection following new maps in Illinois that would have put him at a significant disadvantage in a reelection bid.",
    "It is unclear if House Republicans have the two-thirds majority support from their caucus that they would need to expel Cheney and Kinzinger from the conference.",
    "The measure condemns Cheney and Kinzinger for straying from party principles and working with the Democrats on the Jan. 6 committee, sources told Newsmax.",
    "Both Cheney and Kinzinger were among the 10 House Republicans who voted to impeach Trump over his actions in the events leading up to the Jan. 6 riot.",
    "Members of the RNC were initially considering a resolution that called for the ouster of Cheney and Kinzinger from the House Republican conference.",
    "However, the language in that version of the resolution stoked concerns from some members that it went too far, according to CNN.",
    "The Republican National Committee is set to vote on a resolution Friday to censure Reps. Liz Cheney and Adam Kinzinger.",
    "The resolution is now set for a vote by the full RNC, which consists of 168 members, during its general meeting Friday.",
    "Kinzinger and Cheney, who hail from Illinois and Wyoming, respectively, have both defended their actions in response.",
    "Cheney is running for reelection but is facing a difficult primary challenge from a Trump-endorsed candidate.",
    "\"I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "\"I have no regrets about my decision to uphold my oath of office and defend the Constitution.",
    "Cheney is currently the ranking member of the Jan. 6 committee.",
    "I will never stop fighting for our constitutional republic.",
    "Trump was then acquitted by the then-GOP-led Senate.",
    "The RNC is holding its winter meeting in Utah.",
    "History will be their judge.",
    "No matter what.\"",
    "Just In..."
  ]
}