{
  "id": 671,
  "mediaId": 237,
  "date": "2/3/2022 12:00:00 AM",
  "headline": "Push to oust Cheney and Kinzinger from GOP simmers in Congress as RNC debates it",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/949342.png",
  "link": "https://www.washingtonexaminer.com/news/push-to-oust-cheney-and-kinzinger-from-gop-simmers-in-congress-as-rnc-debates-it",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Brooks",
  "authorUrl": "https://www.washingtonexaminer.com/author/emily-brooks",
  "termIds": [
    1839,
    1839,
    1609,
    2214,
    2214,
    1170,
    1170,
    1609,
    1335,
    1248,
    1248,
    1335,
    428,
    422,
    422,
    428,
    613,
    613,
    545,
    545
  ],
  "sentences": [
    "Arizona Rep. Andy Biggs, former chairman of the House Freedom Caucus, in July proposed a rule to get around the two-thirds requirement: change conference rules to expel any member who sits on a committee without a recommendation from the Republican leader or Republican Steering Committee automatically.",
    "But opponents of the move warn it could be an unwelcome distraction from critical Democrats during the midterm elections, opening the conference to criticism for rejecting Cheney and Kinzinger while declining to punish controversial firebrands such as Reps. Marjorie Taylor Greene and Paul Gosar.",
    "I think their time would be better served by focusing on 2022 rather than an unprecedented and shortsighted effort to purge two lifelong Republicans for simply telling the truth and upholding their oaths of office,? Kinzinger spokeswoman Maura Gillespie said in a statement.",
    "Proponents believe it is important to take the step to remove the two members, both of whom are vocal critics of former President Donald Trump and were appointed by House Speaker Nancy Pelosi to sit on the House select committee investigating the Jan. 6 Capitol riot.",
    "A push from hard-right conservatives to oust Reps. Liz Cheney of Wyoming and Adam Kinzinger from the House Republican Conference is simmering in Congress as party leaders at the Republican National Committee debate whether to condemn the two members.",
    "At the Republican National Committee's winter meeting in Utah this week, former Trump campaign adviser David Bossie proposed a resolution to endorse the conference booting the pair of lawmakers and got 50 co-sponsors, the Washington Post reported.",
    "I talked to the Leader about our situation, and we've resolved that we are all on the same page, that we are going to move forward together as a Republican Party, as a Republican conference,? Perry told the Washington Examiner this week.",
    "Committee ratios is the last thing we should be worrying about.?\nHouse Republican rules require a two-thirds vote from the entire conference to expel a member, and it is not clear whether enough members agree with kicking them out.",
    "That is going to happen.?\nIf Cheney and Kinzinger were removed from Republicans' numbers in the House, that could affect the proportions of Republicans and Democrats on committees for the rest of the term.",
    "In the current circumstance, Representative Cheney does not represent the Republican Party's views.?\nBut he is not completely closing the door on trying to oust Cheney and Kinzinger.",
    "Pennsylvania Rep. Scott Perry, chairman of the House Freedom Caucus, put that effort on hold in January so Republicans could focus on the Biden administration's one-year anniversary.",
    "How that manifests itself in actions, we shall see.?\nGreene said on a recent episode of former Trump adviser Steve Bannon's podcast: We're going to kick her out of our conference.",
    "We're sitting around here actually having active committees right now?? joked Florida Rep. Byron Donalds, a freshman, in criticism of day-to-day operations in Congress.",
    "In one notable instance, Indiana Rep. Jim Banks, chairman of the Republican Study Committee, came out in support of kicking out the pair from the conference in January.",
    "They are already shunned by Republicans: McCarthy has called the pair Pelosi Republicans,? and the Wyoming Republican Party no longer recognizes Cheney as a Republican.",
    "But the push to kick out the two members has bubbled up again as the Jan. 6 committee becomes higher profile and as attention turns to the 2022 midterm elections.",
    "It was reportedly \"watered down\" to a censure and, if reported out of committee, will be voted on by the party's national officials Friday morning.",
    "Cheney faces Trump-endorsed challenger Harriet Hageman in an August primary this year, though she continues to break personal fundraising records.",
    "I'm a constitutional conservative, and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "Banks was appointed by McCarthy to be ranking member on the Jan. 6 committee, but Pelosi blocked him from taking the position.",
    "3 position as Republican conference chairwoman last year, shows the party now embraces Trump more than conservatism.",
    "Republican leaders boycotted the committee after Pelosi vetoed two of House Minority Leader Kevin McCarthy's picks.",
    "Even Greene has acknowledged Cheney has a more conservative voting record than many of her Republican allies.",
    "He had a meeting with McCarthy, who has reportedly argued against taking the step to kick out the members.",
    "Cheney and Kinzinger argue Republican wrath directed at them, starting with Cheney's removal from her No.",
    "Back in Washington, several right-wing members are still hoping to kick the pair out of the conference.",
    "They also worry it could have immediate negative structural consequences for Republicans in the House.",
    "We're in agreement that [Cheney] doesn't represent the majority of this party,? Perry said.",
    "The new ratio could mean the most junior Republicans on some committees could get removed.",
    "Kinzinger, whose district was redrawn to be Democratic-leaning, is not seeking reelection.",
    "They are not Republicans,? Colorado Rep. Lauren Boebert told the Washington Examiner.",
    "But to some members who support booting the two, committee ratios are not a concern.",
    "The resolution was referred to a committee and has sat dormant since.",
    "In the end, ousting Cheney and Kinzinger may simply be a formality.",
    "It may be that neither of them will be in Congress come 2023.",
    "I will never stop fighting for our constitutional republic.",
    "In my mind, they already are out of the conference.",
    "No matter what,? Cheney told the Washington Post.",
    "History will be their judge.",
    "They removed themselves.",
    "We'll see what happens.",
    "What committees?"
  ]
}