{
  "id": 683,
  "mediaId": 65,
  "date": "2/2/2022 12:00:00 AM",
  "headline": "2024 debates, convention city, primary calendar on RNC winter meeting agenda",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/04eb3997-68d2-47c3-bcc7-3d61b436ae03/4fec0ba6-8b2a-47e8-83c5-e34702c24d86/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/rnc-winter-meeting-2024-debates-convention-city-primary-calendar",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1147,
    1685,
    2214,
    3094,
    111,
    427,
    2707,
    2892,
    2945,
    2976
  ],
  "sentences": [
    "Also grabbing plenty of attention is a proposed resolution that would endorse removing from the House Republican Conference Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois  two vocal Donald Trump critics who voted to impeach the then-president and the only two Republicans sitting on a Democratic- dominated House select committee investigating the deadly Jan. 6, 2021, attack on the U.S. Capitol.",
    "The RNC made major headlines last month with a letter it sent to the CPD, the organization that for more than three decades has hosted and produced the presidential and vice presidential general election debates, that said the RNC will require its presidential candidates running in the 2024 election cycle to pledge not to participate in debates run by the CPD.",
    "\"There were three commonsense asks: please don't start debates after 26 states had started voting; can you assure us that you won't have a moderator that worked for the Democrat nominee; and a code of conduct for your members if they disparage either nominee,\" RNC chair Ronna McDaniel told Fox News in an exclusive interview on the eve of the winter meeting.",
    "Also in the spotlight as the national party organization's 168 committee members and other top officials gather for their annual winter confab will be discussion regarding the presidential primary calendar for the next GOP nomination race and pitches from the four cities vying to host the Republican convention in two and a half years.",
    "The Republican National Committee's (RNC) move to stop doing business with the longstanding Commission on Presidential Debates (CPD) and chart a new path for the 2024 general election debates will be high on the agenda as the RNC holds its winter meeting starting Wednesday in Salt Lake City, Utah.",
    "Cheney was ousted last spring from her number-three position in House GOP leadership, but to date Minority Leader Kevin McCarthy has not acted on calls by Trump loyalists in the House Republican conference to oust Cheney and Kinzinger, who decided against running for re-election this year.",
    "CHENEY HAULS IN OVER $7 MILLION LAST Y EAR AS SHE FENDS OFF ATTACKS FROM TRUMP\nSupport for the proposed Cheney and Kinzinger resolution, which was first reported by the Washington Post, is increasing, sources with knowledge of the winter meeting tell Fox News.",
    "But unlike at the rival Democratic National Committee, where there's a push by some members to upend the longstanding tradition of Iowa and New Hampshire kicking off the nominating process, there appears to be little appetite for change at the RNC.",
    "It's easy to just say we're not going to debate, but what we're doing right now is creating a process to allow us to look at different venues to debate.We need to put our future nominee in the best position with a commission that's not biased.",
    "Henry Barbour, a veteran committee member from Mississippi, told Fox News that \"we're not happy with the way that the Presidential Debate Commission has been operating\" and that \"there's a serious appetite to explore changes with that system.\"",
    "An RNC committee member who asked to remain anonymous to speak more freely told Fox News that \"there is a great deal of disappointment and anger towards Cheney and Kinzinger for further empowering a Democratic witch hunt.",
    "Responding to the RNC letter, the commission said last month that \"the CPD deals directly with candidates for president and vice president who qualify for participation in the CPD's general election debates.",
    "IOWA, NEW HAMPSHIRE, WORK TO STAY ATOP GOP'S NOMINATING CALENDAR\nThe rules and calendar for the 2024 presidential nominating calendar will also be worked on during the three-day meeting in Salt Lake City.",
    "We have been investing in voter registrationOur goal is to build an infrastructure to win in 2022, and we are certainly laying that groundwork at the fastest pace ever in the history of RNC.\"",
    "The RNC's winter meeting comes days after the committee announced that it narrowly edged the DNC in fundraising last year, although the DNC headed into the new year with more cash on hand.",
    "The four cities are holding events this week with committee members to showcase their bids, and the RNC earlier this week did some site selection with the Salt Lake City delegation.",
    "Longtime GOP strategist and former RNC communications director Doug Heye said that taking on the commission over debates \"demonstrates to the base your willingness to fight.\"",
    "And the four remaining cities vying to host the 2024 Republican National Convention  Milwaukee, Nashville, Pittsburgh and Salt Lake City  are making pitches this week.",
    "An RNC official told Fox News that McDaniel, as chair, \"doesn't publicly discuss resolutions until the members have the opportunity to debate and vote on them.\"",
    "McDaniel noted that \"the debate committee's been pretty unanimous that they have found the response of the Commission on Presidential Debates unsatisfactory.\"",
    "The CPD's plans for 2024 will be based on fairness, neutrality and a firm commitment to help the American public learn about the candidates and the issues.\"",
    "\"We beat the DNC, considering they have the White House, which is a testament to our team and the great investors we have,\" McDaniel touted.",
    "The RNC's debate committee will meet and vote this week on the matter, with all the committee members voting at the RNC's summer meeting.",
    "\"The presidential nominating committee will present their report at this meeting and we will vote on that at the summer meeting.",
    "The move could likely lead to a massive shift in how presidential and vice presidential general election debates are conducted.",
    "\"We'll be going to the other cities and doing similar tours in the coming months before we make that decision,\" McDaniel noted.",
    "But there's also resistance to do anything that appears to be a purge, or even to attempt to dictate to the GOP caucus.\"",
    "If the resolution passed through committee, it would then be voted on by all the RNC's members at the end of the week.",
    "And she emphasized that the RNC's using the money raised to \"build up these community centers across the country.",
    "But I am not going to get ahead of our committee and our members on that front,\" McDaniel noted.",
    "And she emphasized that \"the issues we've had with the debate commission are long-standing.",
    "\"They couldn't help with those three things, and we feel it's time to move on.\"",
    "The move by the RNC will likely play well with the party's conservative base.",
    "As of now I have not heard any recommendations to change the calendar.",
    "The final decision is expected to come at the RNC's summer meeting.",
    "I think our requests by any standard were incredibly reasonable.\""
  ]
}