{
  "id": 685,
  "mediaId": 195,
  "date": "2/2/2022 12:00:00 AM",
  "headline": "The Hill's Morning Report - Dems jolted by senator's stroke, majority status",
  "image": "https://thehill.com/sites/default/files/newsletter-open_020222ap.jpg",
  "link": "https://thehill.com/homenews/morning-report/592411-the-hills-morning-report",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger",
  "termIds": [
    1341,
    1582,
    1765,
    2119,
    2160,
    2465,
    3094,
    482,
    517,
    571,
    2945
  ],
  "sentences": [
    "ELSEWHERE\n? CYBER SPYING & WEAPONRY: The controversial surveillance company NSO Group offered to give representatives of an American mobile-security firm bags of cash? in exchange for access to global cellular networks, according to a whistleblower who has described the encounter in confidential disclosures to the Justice Department (The Washington Post).",
    "An aide noted that the agenda was being recalibrated to take into consideration the need for all Democratic votes in order to move certain nominees forward.?\nIt's just a reminder that in a 50-50 Senate any unexpected development could be a challenge to our moving forward on an agenda that the Democratic caucus shares,? Sen. Chris Coons (D-Del.)",
    "A McConnell spokesman told The Hill that during the phone call, McConnell emphasized the importance of a nominee who believes in judicial independence and will resist all efforts by politicians to bully the Court or to change the structure of the judicial system.?\nThe Hill: McConnell looks to turn down the temperature on Supreme Court fight.",
    "I would not be in favor of shortening any of the sentences for any of the people who pleaded guilty to crimes,? McConnell told reporters, noting that 165 people linked to the violent storming of the Capitol more than one year ago have pleaded guilty to crimes.?\nThe Hill: GOP can't escape Trump-fueled election controversies.",
    "Pegasus can turn a targeted smartphone into a potent surveillance tool, allowing operators to track the user's locations, listen to calls, retrieve pictures and monitor social media activity, according to the Post and The New York Times, which recently published results of a yearlong investigation of Pegasus and NSO.",
    "LEADING THE DAY\nADMINISTRATION: Russian President Vladimir Putin spoke Tuesday about Ukraine for the first time publicly since December, complaining that Russia's concerns fall on deaf ears in NATO but indicating Moscow wants to keep talking even as he insists it is the United States that stokes conflict.",
    "We haven't seen adequate consideration of our three key requirements concerning the prevention of NATO expansion, the refusal to deploy strike weapons systems near the Russian borders as well as the return of the military infrastructure? to NATO's 1997 borders, he continued (The New York Times and Axios).",
    "> The Interior Department is under new pressure after being ordered Thursday by a federal judge to conduct a fresh environmental analysis that reflects greenhouse gas emissions that would result from the eventual development and production of offshore drilling leases in the Gulf of Mexico.",
    "Not far from Washington, D.C., to cite examples, counties are doing away with indoor mask mandates, which omicron's rampage had revived: Howard County, Md., made the decision to jettison mask requirements for most public settings because its COVID-19 numbers improved since December (WTOP).",
    "The decision to cancel oil and gas leases of more than 80 million acres was a victory for environmental groups, which argued the Biden administration did not sufficiently take climate change into account when it auctioned the leases late last year (The Hill and The New York Times).",
    "On Capitol Hill, senators drafting a tough Russia sanctions bill encountered more debate Tuesday about whether punishments should be pre- or post-attack and when and if sanctions should hit the Nord Stream 2 pipeline important to Russia but also important in Europe (The Hill).",
    "Blinken, according to a statement, told his counterpart that immediate de-escalation and withdrawal of troops and equipment from Ukraine's border is the bottom line recommendation, accompanied by the U.S.-NATO offer to continue security discussions with Moscow (The Hill).",
    "Democrats on Capitol Hill are faced with a potpourri of issues this week as they deal with a near-term blow to their slim majority, the looming confirmation process of President Biden's nominee for the Supreme Court and the dormant status of Build Back Better talks.",
    "The president and the vice president will receive the President's Daily Brief at 10:15 a.m. Biden, Harris and first lady Jill Biden host an event at 1:30 p.m. to revive the White House Cancer Moonshot, first unveiled in 2016 during the Obama-Biden administration.",
    "While Lujn's representatives say the senator is expected to make a full recovery,? it is unknown when he might return to Washington, leaving Democrats unable to advance nominees or legislation that could require Vice President Harris to cast a tie-breaking vote.",
    "In an extraordinary move, the Food and Drug Administration had urged Pfizer and its partner BioNTech to apply for federal approval earlier than the companies had planned  and before research determined conclusively whether two shots or three are most effective.",
    "And if you're a competitor in the Beijing Winter Olympics, the COVID-19 positivity rate for athletes and officials was a disappointing 40 percent higher than that of others arriving for the events over a three-day period from Saturday through Monday.",
    "> Chinese spying in the U.S. has become so widespread that the FBI is launching an average of two counterintelligence investigations a day to counter the onslaught, FBI Director Christopher Wray said during an interview with NBC News's Pete Williams.",
    "When you have telecom companies and you have software companies, normally they don't engage in cash transactions.? NSO is best known for its Pegasus spyware, which it leases to intelligence and law enforcement agencies in dozens of countries.",
    "As The Hill's Reid Wilson and Max Greenwood detail, GOP groups  including many that trailed their Democratic counterparts two years ago  are pulling ahead in the dash for cash as the party pushes for a November rebuke of Biden's presidency.",
    "Across the Capitol complex, the House Democratic campaign arm maintains a slight advantage over the National Republican Congressional Committee (NRCC), reporting $82.5 million on hand compared to $78.2 million for the NRCC.",
    "I have always believed the sport of football is an all-in' proposition  if a 100% competitive commitment isn't there, you won't succeed, and success is what I love so much about our game,? Brady said in an Instagram post.",
    "Ben Ray Lujan, D-N.M., speaks during a hearing\" width=\"580\" height=\"387\" data-delta=\"2\" />\nSenators later this month expect Biden to announce his nominee to replace Justice Stephen Breyer on the Supreme Court.",
    "> Comeback season: Progressive candidates who lost recent bids for Congress are making comebacks across the country as the left wing of the party hopes for a reversal of fortune after a rough-and-tumble 2021.",
    "The Biden administration, which condemned Russia on Monday at the United Nations, was quick to respond again on Tuesday, eager to push back against Putin's narrative while keeping diplomatic channels open.",
    "> Jan. 6 latest: McConnell on Tuesday also broke from former President Trump's call to give pardons to those convicted in the Jan. 6 attack on the Capitol, saying that he does not back that possibility.",
    "Appreciative librarians found it, asked permission from the family and made the manuscript part of the library's collection, bar code and all, even giving the boy a special award as a young novelist.",
    "That moonshot? endeavor is officially being rekindled at the White House today, again under Biden's stewardship, but it's unclear if additional federal spending will follow (The Associated Press).",
    "Senate Leadership Fund, the main super PAC backing GOP Senate candidates, closed 2021 with $47.4 million in the bank, topping Democrats' Senate Majority PAC by nearly $17 million in cash on hand.",
    "NATO refers to the right of countries to choose freely, but you cannot strengthen someone's security at the expense of others,? he added after meeting with Hungarian Prime Minister Viktor Orbn.",
    "As The Hill's Jordain Carney reports, Democrats on the Commerce Committee  of which Lujn is a member  almost immediately yanked three nominations that were expected to get votes on Wednesday.",
    "> Military push: Frontline Patriots PAC, a GOP group tasked with promoting veterans and military candidates, announced its first batch of endorsements ahead of the 2022 election this morning.",
    "The Hill: Ukrainian President Volodymyr Zelensky has publicly downplayed fears of imminent war with Russia but not his country's wariness about Russia's harsh view of Ukraine as a democracy.",
    "When the fox is screaming from the top of the henhouse that he's scared of the chickens, which is essentially what they're doing, that fear isn't reported as a statement of fact,? she said.",
    "The administration's COVID-19 response team will brief journalists at 3 p.m.\nHill.TV's Rising? program features news and interviews at http://thehill.com/hilltv or on YouTube at 10:30 a.m.",
    "Omicron infections continue to hit the FedEx workforce hard enough to force the company to announce a pause in its domestic express freight services because of staff shortages (The Hill).",
    "That success was also seen at the National Republican Senatorial Committee, which now leads the Democratic Senatorial Campaign Committee with $32.8 million in the bank to $23.7 million.",
    "Through his office, Sen. Ben Ray Lujn (D-N.M.) on Tuesday disclosed that he suffered a stroke on Thursday last week and underwent decompressive surgery to ease swelling? in his brain.",
    "Here's more: The World Health Organization affirmed there is no indication that severe illness results from omicron's cunningly infectious cousin known as BA.2 (The Washington Post).",
    "THE CLOSER\nAnd finally  An 8-year-old boy in Boise, Idaho, in December completed an imaginative book by hand featuring an exploding star atop a Christmas tree and some time travel.",
    "Among those earning the committee's backing are Wesley Hunt (Texas-38), Morgan Luttrell (Texas-08), Esther Joy King (Ill.-17) and former Interior Secretary Ryan Zinke (Montana-01).",
    "Meanwhile, what's the status of Biden's Build Back Better package, which the president has said could be sliced into chunks? to try to get a compromise version through the Senate?",
    "And we have a lot of things we need to get done for the American people,? Rep. Mike Waltz (R-Fla.), a U.S. Army officer who's helping to spearhead the group, said in a statement.",
    "COVID-19 vaccine mandates at two Virginia universities are gone, in part because vaccination rates are so high among students and staff and infection rates dropped (WTOP).",
    "Positive COVID-19 tests mean athletes risk missing their events because they are sent to isolation hotels in order to limit the spread of the virus (The Associated Press).",
    "As The Hill's Hanna Trudo and Julia Manchester point out, former Ohio state Sen. Nina Turner (D) launched a second primary challenge against Rep. Shontel Brown (D-Ohio.)",
    "The Constitution says 'advise and consent, advice and consent,' and I'm serious when I say I want the advice of the Senate as well as the consent,? Biden told reporters.",
    "The Senate convenes at 10 a.m. and will resume consideration of the nomination of Rupa Puttagunta to become a judge of the Superior Court of the District of Columbia.",
    "In 2019, 600,000 people died from cancer in the United States and the administration's goal is to improve the rate of screenings, diagnoses and available treatments.",
    "In the U.S., there still are worrisome economic signals: 4.3 million Americans quit jobs in December as omicron surged, leaving an estimated 10.9 million vacancies.",
    "The book now has a lengthy wait list of eager readers after KTVB, a news station in Boise, reported on the graphic novel's inclusion in the library's holdings.",
    "The book, titled The Adventures of Dillon Helbig's Crismis,? is signed by Dillon His Self? and vividly illustrated with colored pencils (The Washington Post).",
    "In Texas, Jessica Cisneros is running against Rep. Henry Cuellar (D-Texas) after losing to the moderate lawmaker in the 2020 primary by just under 4 points.",
    "OPINION\nA listening deficit plagues America, from 2020 vote to Jan. 6 to vaccines, by Gerald F. Seib, executive Washington editor, The Wall Street Journal.",
    "The Hill: The State Department ordered U.S. Embassy employees' families to leave Belarus, where Russian troops are positioned with eyes trained on Ukraine.",
    "America's 19 million children under age 5 may be eligible for COVID-19 vaccine doses as early as March, a development many parents have said they welcome.",
    "? SPORTS: Using a social media platform to make it official on Tuesday, Tampa Bay Buccaneers quarterback Tom Brady, 44, announced his decision to retire.",
    "As you watch President Putin screaming about the fear of Ukraine and the Ukrainians, that should not be reported as a statement of fact? (The Guardian).",
    "We look forward to his quick return to the Senate, and I believe the Senate will be able to carry forward with its business,? Schumer said (Fox News).",
    "That's why we should lift restrictions now, by Leana S. Wen, contributing columnist, https://wapo.st/3GnCncO\nWHERE AND WHEN\nThe House meets at 10 a.m.",
    "Sen. Joe Manchin (D-W.Va.), whose objections helped scuttle a nearly $2 trillion measure last year, used the word dead? to describe its prospects.",
    "), 82, who announced on Tuesday that he tested positive for the coronavirus after being fully vaccinated and boosted and developing mild symptoms.",
    "Children as young as 6 months would receive jabs that contain one-tenth of the vaccine dose given to adults, Pfizer said (The Associated Press).",
    "The U.S. death rate per capita from the coronavirus exceeds that of other wealthy nations, and the reasons are well known (The New York Times).",
    "The number of confirmed COVID-19 infections and hospitalizations and the clearly downward slopes seen in charts and computer models stir hope.",
    "Dick Durbin (D-Ill.) and Chuck Grassley (R-Iowa), the two top senators on the Judiciary Committee, to discuss his upcoming selection process.",
    "The bids come on the heels of a number of losses on the legislative side to moderates, leaving progressives to strike back at the ballot box.",
    "When asked if he's conferred recently with Democratic leaders about next steps, he responded in the negative, adding, It's dead? (Politico).",
    "Brain cancer killed Biden's son, Beau, in 2015 and former President Obama had initiated a federal focus on finding faster cures for cancer.",
    "He decided to secretly slip his self-published work into a community library's shelf of children's books, thinking he would share his tale.",
    "I have loved my NFL career, and now it is time to focus my time and energy on other things that require my attention? (The New York Times).",
    "Schumer had lined up roughly 20 nominees for consideration in the coming weeks, and the shockwaves of Lujn's absence were felt right away.",
    "In addition to concerns among his colleagues about Lujn's health, his absence presents potential near-term trouble for Senate Democrats.",
    "A year ago, Sen. Patrick Leahy (D-Vt.) was briefly evaluated at a hospital as a precaution at age 80 while complaining of feeling ill.",
    "The scale of China's efforts to steal U.S. technology has meant that more than 2,000 such cases are currently under FBI investigation.",
    "Secretary of State Antony Blinken spoke again with Russian Foreign Minister Sergey Lavrov, each restating by phone familiar positions.",
    "It's a question asked by governors, local officials and school administrators, physicians and nurses, business leaders and economists.",
    "> Today during a White House event, the president will announce his goal to reduce the U.S. death rate from cancer by 50 percent.",
    "The Hill: Former President George W. Bush donated to the campaigns of Sen. Lisa Murkowski (R-Alaska) and Rep. Liz Cheney (R-Wyo.",
    "More data-driven good news: COVID-19 hospitalizations have declined in 34 states and in Washington, D.C. (Bloomberg News).",
    "As talks continue with the Kremlin, the international forecasts of war this month appear to have hit a slow-motion pause.",
    "The county's COVID-19 state of emergency, which was tied to the mask order, will expire as scheduled on Monday (WBALTV).",
    "The whistleblower told Rep. Ted Lieu (D-Calif.) about his account, previously shared with the FBI in 2017 on a tip line.",
    "Total U.S. coronavirus deaths reported each morning this week: Monday, 884,260; Tuesday, 886,687; Wednesday, 890,770.",
    "The New York Times: White House chooses former Sen. Doug Jones (D-Ala.) to guide the eventual Supreme Court nominee.",
    "This is difficult for me to write, but here it goes: I am not going to make that competitive commitment anymore.",
    "I'm a former prosecutor, and you would do cash transactions because you want to hide it,? Lieu told the Post.",
    "Russia, not the West, is the aggressor, White House press secretary Jen Psaki said during her daily briefing.",
    "It is already clear that Russia's fundamental concerns have been ignored,? Putin said at a press conference.",
    "Shane Goldmacher, The New York Times: Trump's words, and deeds, reveal depths of his drive to retain power.",
    "Biden also discussed the pending nomination with Senate Minority Leader Mitch McConnell (R-Ky.) on Tuesday.",
    "We get you up to speed on the most important developments in politics and policy, plus trends to watch.",
    "CNN: Another top aide to former Vice President Mike Pence is meeting with the House Jan. 6 committee.",
    "The employment report for January, to be released Friday, could be bleak, according to some analysts.",
    "and Mark Kirk (R-Ill.)  have had to take extended absences from the Senate after suffering a stroke.",
    "Baltimore County's indoor face mask order expired on Tuesday, with the exception of public schools.",
    "According to Carlos Sanchez, Lujn's chief of staff, the New Mexico Democrat remains hospitalized.",
    "For the next week at least, Senate Democrats will be able to function as usual; Republican Sens.",
    "Dispensing with masks indoors, however, does not mean omicron is somehow less likely to strike.",
    "Putin will be in Beijing this week and will meet with President Xi Jinping during the Olympics.",
    "We invite you to share The Hill's reporting and newsletters, and encourage others to SUBSCRIBE!",
    "At arrival gates in China, disinfectant crews are busy spraying chemicals (pictured below).",
    "Mitt Romney (Utah) and John Hoeven (N.D.) are absent due to COVID-19 infections (The Hill).",
    "As for Kirk, he needed a full year to recover before returning to Washington in Jan. 2013.",
    "It was naughty-ish,? Dillon said of covertly donating his first novel without permission.",
    "This also isn't the first health scare for Senate Democrats since retaking the majority.",
    "Hanna Trudo, The Hill: Biden Supreme Court pick seems likely to make progressives happy.",
    "There is no  I mean I don't know what you're all talking about,? Manchin told reporters.",
    "Morgan Chalfant, The Hill: White House sees China bill as fix for some of its problems.",
    "He said he plans to vote by proxy on any House matters while in isolation (The Hill).",
    "As I've said time and time again, veterans bring a unique perspective to Congress.",
    "*****\nCORONAVIRUS: What does it look like on the other side of the winter surge?",
    "And I'm not the kind of guy that uses words like blown away' easily,\" Wray said.",
    "Please recommend the Morning Report to friends and let us know what you think.",
    "The Morning Report is created by journalists Alexis Simendinger and Al Weaver.",
    "Republicans' optimism about retaking Congress shows up in campaigns' coffers.",
    "They are down a vote in the evenly divided chamber for the immediate future.",
    "He went home to convalesce and soon returned to work (The New York Times).",
    "However, the NRCC outraised Democrats by more than $2 million in December.",
    "after dropping the first contest in a special primary election last year.",
    "It took Johnson nine months to return to work after his Dec. 2006 stroke.",
    "It's about mission, it's about country, it's about getting things done.",
    "https://on.wsj.com/3s5iL8s\nYes, more variants may emerge in the future.",
    "On Tuesday in a show of seeking bipartisan input, Biden met with Sens.",
    "The Associated Press: Putin wants to keep talking with the West.",
    "IN FOCUS/SHARP TAKES\nPOLITICS: Campaign finance reports are in.",
    "Readers can find us on Twitter @asimendinger and @alweaver22.",
    "It raised Lieu's suspicions that a crime might have occurred.",
    "said while emphasizing that he expects Lujn, 49, to recover.",
    "The Hill: Lawmakers face time crunch to clinch funding deal.",
    "The White House press briefing is scheduled at 12:30 p.m.",
    "Email: asimendinger@thehill.com and aweaver@thehill.com.",
    "Life in a thicket of risk precautions may be changing.",
    "We are all grateful that he will have a full recovery.",
    "Politico: Lujn stroke sends Senate Democrats reeling.",
    "Alexis Simendinger and Al Weaver are the co-creators.",
    "Reminder: Two senators in recent years  Former Sens.",
    "Unlike in the House, senators must vote in person.",
    "First, we are all praying for Ben and his family.",
    "As of Saturday, there was a 55-person waitlist.",
    "Ask House Majority Leader Steny Hoyer (D-Md.",
    "But the result, he added, is pretty cool.?",
    "Welcome to The Hill's Morning Report.",
    "However, that will not last forever.",
    "What Build Back Better bill?",
    "We want to hear from you!",
    "ET at Rising on YouTube.",
    "CLICK HERE to subscribe!",
    "This one blew me away.",
    "Tim Johnson (D-S.D.)",
    "It is Wednesday!",
    "Fingers crossed.",
    "), respectively."
  ]
}