{
  "id": 701,
  "mediaId": 195,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Ex-President Bush backs two high-profile Republicans slammed by Trump",
  "image": "https://cdn.jwplayer.com/v2/media/aBoqyeMi/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/592223-ex-president-bush-backs-two-high-profile-republicans-slammed-by-trump",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1026,
    1078,
    1147,
    1248,
    2150,
    3094,
    183,
    428
  ],
  "sentences": [
    "Cheney, who was one of 10 House Republicans to vote to impeach Trump last year in the wake of the Jan. 6, 2021, riot at the U.S. Capitol, raised more than $2 million in the last quarter of the year and entered 2022 with roughly $4.7 million in the bank.",
    "According to Federal Election Commission filings, Bush funneled two separate donations of $2,900 to Cheney in late October  the maximum contribution an individual can give a candidate's campaign committee for both a primary and general election.",
    "and Sen. Lisa Murkowski (R-Alaska) in the final months of 2021, a show of support for two of former President Trump's top Republican targets of the 2022 midterm elections.",
    "Jeb Bush (R), gave $1,000 to Cheney's campaign in November, bringing his total contributions to the Wyoming Republican to $3,000 this cycle.",
    "Murkowski pulled in nearly $1.4 million in the last quarter of 2021 and entered the new year nearly $4.3 million on hand.",
    "Murkowski joined six of her Republican colleagues last year in voting to convict Trump in his second impeachment trial.",
    "Bush also gave $2,900 to fuel Murkowski's primary campaign against her Trump-endorsed challenger, Kelly Tshibaka.",
    "Former President George W. Bush gave money to the reelection campaigns of Rep. Liz Cheney (R-Wyo.)",
    "By comparison, Tshibaka raised just over $600,000 and has about $634 in the bank.",
    "She's the only GOP senator who did so who is facing reelection this year.",
    "Bush isn't the only one in his family to donate.",
    "His brother, former Florida Gov."
  ]
}