{
  "id": 707,
  "mediaId": 43,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Now entering Bizarro World; Democrats must help Cheney win",
  "image": "https://images.dailykos.com/images/1024182/story_image/GettyImages-1358870625.jpg?1641507818",
  "link": "https://www.dailykos.com/story/2022/2/1/2077997/-Now-entering-Bizarro-World-Democrats-must-help-Cheney-win-re-election",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1248,
    3094,
    146,
    428,
    2945,
    2976
  ],
  "sentences": [
    "As a result, we are faced with a very simple choice: Liz Cheney, who despite having political ideologies and beliefs that probably all of us find absolutely repugnant, but still believes in American liberal Democracy and will continue to fight for it till the bitter end no matter the consequences, or a sycophantic rabid trumper who holds even more repugnant ideologies, on top of NOT believing in American liberal Democracy.",
    "If Cheney does not win the GOP primary, and there is every indication there is a good chance she won't, then she can run as an Independent in the general, and if Wyoming Dems back her en-masse, combined with hopefully enough principled republicans in the state who do still support her, we have a shot of at least keeping that seat out of the hands of the next MTG or LB.",
    "She will never be an ally to Democrat policy or Democrat nominees, but she WILL be an ally to preserving and safeguarding American liberal Democracy from the festering autocracy consuming her party.",
    "Therefor, the Democrats who live in Wyoming must make the ultimate Country over Party move and throw their support behind her to help her remain in office.",
    "Cheney faces a tough re-election in Wyoming, with 6 trumpist primary opponents ready to unleash their rabid trumptrash cultism to take her down.",
    "Wyoming was the biggest landslide state for the orange shitpile, at 70% of the vote.",
    "Anyone with a brain knows that no Democrat candidate will win in that state.",
    "Running a Dem primary and backing the winner in the general will not work.",
    "And there is no reason to believe they won't succeed.",
    "It just is not something that will ever happen.",
    "She believes in Democracy, and that is enough!",
    "It's not a hard choice if you think about it.",
    "Dems in Wyoming, help Cheney win re-election!",
    "An imperfect friend, or a deadly enemy.",
    "Even more than West Virginia.",
    "Cheney is in deep trouble.",
    "So the title says it all.",
    "He or she will NOT win."
  ]
}