{
  "id": 711,
  "mediaId": 43,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Trump's endorsement ad of David Perdue is perfectly divisive and comically awful",
  "image": "https://images.dailykos.com/images/1032970/story_image/ScreenShot2022-02-01at11.09.31AM.png?1643742796",
  "link": "https://www.dailykos.com/story/2022/2/1/2078000/-On-heels-of-Trump-flaunting-his-coup-attempt-Perdue-releases-endorsement-ad-from-the-2020-loser",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2095,
    1646,
    1646,
    815,
    815,
    928,
    928,
    1545,
    1545,
    1434,
    1434,
    1080,
    1080,
    1147,
    1147,
    1232,
    1232,
    571,
    571,
    183,
    183,
    227,
    227,
    428,
    428,
    2672,
    2707,
    2707,
    2710,
    2710,
    2750,
    2750,
    2672
  ],
  "sentences": [
    "Donald Trump has cut his first ad for Georgia GOP gubernatorial candidate David Perdue, and it's everything Democrats could hope for: a rehash of Trump's 2020 grievances squarely targeted at incumbent Republican governor Brian Kemp all while exhibiting impeccably bad taste.",
    "Beyond the Georgia gubernatorial race, Trump's divisiveness will surely spill over into the GOP effort to unseat Democratic Sen. Raphael Warnock, who's facing a challenge from alleged wife beater and former football star, Herschel Walker.",
    "Actually, what they are saying, is that Mike Pence did have the right to change the outcome, and they now want to take that right away,\" Trump said Monday in a statement about legislative efforts to reform the Electoral Count Act.",
    "Too bad Republicans missed their opportunity to convict Trump and do away with him forever or, as GOP Rep. Liz Cheney of Wyoming put it, \"made themselves willing hostages\" to a man who just fessed up to trying to stage a coup.",
    "\"Unfortunately, he didn't exercise that power, he could have overturned the Election!?\nSane-ish Republicansand some small segment of them does still existwill find the timing of Trump's endorsement outrageous.",
    "It's also perfect (as Trump likes to say) for Perdue to welcome Trump's ad just days after he publicly pledged to pardon Jan. 6 seditionists, called for raucous protests (what could go wrong?)",
    "But in all seriousness, Trump immediately ripping into Kemp because he \"let us down\" is exactly the pitched intra-party battle Democrats want to see on the right in the Peach State.",
    "\"It's my hope the '22 election will be a referendum on the performance of the current administration, not a rehash of suggestions about what may have happened in 2020.\"",
    "Perdue, the state's former U.S. Senatorwho serially abused his insider post to line his own pocketsis then billed onscreen as \"An America First Conservative Outsider.\"",
    "Senate Republicans have hoped against hope to avoid Trump flooding a Senate race that presents one of their best pick-up chances with his 2020 fraud lies.",
    "\"I do think we need to be thinking about the future and not the past,\" McConnell said last fall, lamenting Trump's obsession with his 2020 election loss.",
    "We want that primary to be as divisive and bloody as possible so that it will hopefully split the loyalties of Republican voters entirely.",
    "Thus begins the GOP polarization into two vehemently opposed camps, who will hopefully despise each other before this is all over.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Trump then takes the baton, saying that Democrats \"walked all over\" Kemp and charging, \"Brian Kemp let us down.\"",
    "Dim the lights, cue the baritone-voiced circus ringleader announcing, \"A message from President Trump.\"",
    "Perdue is dropping at least $150,000 to run the ad, according to the Atlanta Journal-Constitution.",
    "if he is indicted, and admitted that he absolutely did try to overturn the 2020 election.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Donald Trump appearing in an ad for David Perdue's Georgia gubernatorial bid.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Trump adds that Perdue has his \"complete and total endorsement.\"",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "The entire ad is classic Trumpas in, classically awful.",
    "x\nx\nx\nThis is a short blurb about Daily Kos.",
    "MAGA enthusiasts will adore it.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Man, what an opening!",
    "Please read it."
  ]
}