{
  "id": 715,
  "mediaId": 65,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "'The Five' on struggles facing Democrats ahead of midterm elections",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/64d74445-d794-4ece-b4f2-d3f2c07e6aa9/00fa0777-9d29-487a-a860-15bfcdfbe25d/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/the-five-struggles-facing-democrats-ahead-of-midterm-elections",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fox News Staff",
  "authorUrl": "https://www.foxnews.com/person/s/fox-news-staff",
  "termIds": [
    2241,
    2241,
    2410,
    2410,
    978,
    978,
    841,
    841,
    1188,
    1188,
    106,
    106,
    199,
    199,
    2826,
    2826,
    2945,
    2945
  ],
  "sentences": [
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "FORD: Can everyone claim, Jesse, this is a victory, President Trump with Operation Warp Speed, public health experts, although we quarrel with them a bit, they went out and said we had to do these things, Joe Biden in helping to set up an apparatus and a distribution system for the vaccines.",
    "To today's event I will say that Jason Rivera's widow was correct when she said that the system failed him, because in a poignant sense, his death is not only the responsibility of his killer, by which I mean at least a small part of the blame here goes to the city and to its leadership.",
    "I think that what we ended up doing to children in schools, putting them behind it compared to other countries, that global competition they'll face, the you know, the suicides, the attempted suicides, mental health, the drug abuse, you know, the alcoholism, the child abuse and neglect.",
    "Now if it all -- if it all collides and you're helping people and you're doing those things, that's one thing, but it's a little bothersome and a little tiring to hear a progressive or a moderate talk about the other as if somehow or another they have the monopoly on being right.",
    "You mentioned the name of the judge, we know Bragg and the district attorney's office, we know who the governor is, we know the speaker of the House, or the majority leader and the state legislature, they write these bail laws and they don't reform them.",
    "TURNER: Well, I will say, well, they said that they had scheduling issues, but the reality is that if the president had a 60 percent approval rating, the lieutenant governor and the attorney general would've been there with bells on and we all know it.",
    "(END VIDEO CLIP)\nTURNER: So, while Democrats tear themselves apart, Dem strategist James Carville is telling his part, quote, \"this is not a time to complain, it's a time to act, so let's talk about real things and little real language to real people.\"",
    "And I really believe that that totalitarian instinct on the part of the Democrats is so strong that there are people now, small- minded people, when this is over or they say it's safe to unmask, that they are still going to be out there, the crazies.",
    "Joe is like two adolescent boys, one on the other shoulders wearing an overcoat trying to sneak into the adult movies, except the two adolescent boys are AOC and Ilhan Omar, and they snuck into the White House and they are destroying the place.",
    "The judge, there is a particular judge, Denis Boyle, who continuously lets out these young people who have gun crimes over and over, three times letting a young kid out on different gun crimes and then finally he ends up shooting a cop.",
    "A lot of news outlets are reporting what's going on here as, you know, these down ballot Democrats are trying to create their own brands and separate themselves from the president on the issues, but that's not really what's happening.",
    "There's a whole lot of public health experts that are saying, actually, it looks like we're a whole lot closer to the end of the pandemic phase and the beginning of the endemic phase than the government would have you believe.",
    "What -- is she going to go and find a quality primary candidate in Arizona and just keep on a bunch of dough into the word chest and then primary Sinema, and then have enough money leftover to beat the Republican candidate.",
    "So, Democrats, if this is what we want the power but to all this (Inaudible) and fighting here in the middle of a time in which our president is in the low 40s or high 30s, then we deserve to be defeated in November.",
    "But hey, listen, big storm, big nor'easter coming into the New England area here as we head into tonight and tomorrow, especially over 700 miles of blizzard warnings in effect from Virginia right up through Maine.",
    "(BEGIN VIDEO CLIP)\nREP. ALEXANDRIA OCASIO-CORTEZ (D-NY): I don't believe she's really given a compelling case as to why she should be renominated as the Democratic nominee for the United States Senate in Arizona.",
    "They need to have context, which means root causes and systemic racism, and he was abandoned as a child and so suddenly the criminal is decriminalized, and the victim is forgotten, politics becomes the end game.",
    "Because now cops are getting shot left and right and many -- some of them are dying, and so they realize that they created the atmosphere for random violence by basically negating the authority of the police.",
    "JOY REID, HOST, MSNBC: The major reason we don't have a build back better bill to address all of these problems, it's because Sinema and Manchin have played right into the conservative talking points.",
    "The Democrats, he went to Pennsylvania, the lieutenant governor running for higher office, the attorney general running for higher office, neither of them wanted to be with the president, why is that?",
    "That certain Republicans like, you know, Liz Cheney or Adam Kinzinger, you know, they are not quite in the mainstream, but I've never heard people call the names that they are calling --\nTURNER: Yes.",
    "When the widow of Jason Rivera got up and talked about her husband being tired of the loose laws especially of the new D.A., she got a standing ovation by the police, by the priest, by the cardinal.",
    "Governor Hochul who said this funeral today, she says on the one hand I'm not going to change the bail laws so we're going to keep letting the criminals out, but I'm going to work with Mayor Adams.",
    "PIRRO: Well, you know, Joe Biden came in saying that he was going to be the great divider and that his years in the Senate would give him the ability to cross the aisle and get legislation passed.",
    "OK, teddy bear mania took over a Pennsylvania ice skating rink this week where tens of thousands of stuffed animals were tossed out of the Hershey Bear skating rink during the annual charity game.",
    "More than 52,000 stuffed animals are thrown from the stands seconds after the first goal of the game between the Hershey Bears and the Hartford --\nWATTERS: And there was cocaine in all the bears.",
    "They're afraid of the talking point that is given to the people that are his opponents that are going to say, oh, well, he's vaxxed and boosted or oh, well, if he can get it, anybody can get it.",
    "That -- that widow's comments should not only help do that, but you may get a little upset with me now, but two -- the gun that killed those two officers with the ghost gun from Philadelphia.",
    "You know, decriminalizing violent crime is a real part of the problem, but you're not going to fix this until you get at the anti-police sentiment that is running rampant across the country.",
    "And today in New York, the NYPD honoring fallen Officer Jason Rivera who was murdered execution style along with his partner after they were ambushed by a felon with a massive rap sheet.",
    "According to Gallup, Biden polled significantly lower in six key character traits than he did before taking office, and Biden not exactly inspiring confidence during his speech earlier.",
    "FORD: Starting February 1, they will be removing virtually all pandemic restrictions like mask mandates and reclassifying COVID-19 is a disease that no longer poses a threat to society.",
    "Their own beliefs open the door to progressive disasters like the no bail, no cash bail, and you don't need context to cover crime, you only need two variables, victim and victimizer.",
    "We, the public have been silent, it's this minority that is just so loud that they are -- they are literally silencing the rest of us who are just kind of going along with our lives.",
    "TURNER: I got in big trouble like two weeks ago because I was walking the dogs with my husband and I was chewing a piece of gum and I spit it in the gutter and he freaked out on me.",
    "I hope the president can rescue that from -- rescue us from that and I hope that Democrats in the House and the Senate, progressives and moderates alike learn how to work together.",
    "I hope they Brian Stelter to the funerals and took pictures of the mourners and use the correct Instagram filter when they did it and maybe they got some good retweets out of it.",
    "SANDRA SMITH, FOX NEWS HOST: In the streets here, it was -- it was a silent moment and obviously a somber one and we will remember and we'll get better and we will support them.",
    "(END VIDEO CLIP)\nWATTERS: And the widow of Officer Rivera not holding back and calling out radical district attorneys who are putting cops and the people they protect at risk.",
    "Democrats like Congresswomen Alexandria Ocasio-Cortez like are taking serious shots at moderates Joe Manchin and Kyrsten Sinema, some of the attacks are getting pretty herry.",
    "TURNER: Greg, what is hotter right now, the Democratic civil war between the progressives and the moderates or the Republican civil war between the pro and anti-Trump people?",
    "So much like Carville says Democrats are spending a lot of time on races they're not going to win, they're also doubling down on issues they know they're not going to win.",
    "And that's going to help us also preserve the authority among public health officials to re-implement some measures in the future if in fact this does return next winter.",
    "PIRRO: OK.\nWATTERS: If I hear again, scheduling issues, you'd think after all these years they come up with a more eloquent dodge like how about a personal family matter.",
    "Those who willing to fund efforts to change communities, there should be an effort funded right now, let her words be the only words in the commercial to recall any D.A.",
    "And he couldn't exploit the enormous bias of the media and he couldn't exploit the enormous goodwill from never Trumper's who were basically so pleased to see him.",
    "You get a victory, get a victory optically and then you go to Joe Manchin and say what do you want, what will you support and you pass the build back better plan.",
    "PIRRO: OK, when I work -- OK, the favorite part of the workday is getting up and then the dogs are there, all three of them and they're all wagging their tails.",
    "And you too, Democrats, you can win if you grow some stones and go face to face with the woke and regain your sensible -- you're sensible space in this world.",
    "GUTFELD: He squandered both opportunities by climbing into the sack with the woke, so now he is a shell of his former self and the woke is wearing that shell.",
    "(BEGIN VIDEO CLIP)\nKEECHANT SEWELL, NYPD COMMISSIONER: Way may not match the sacrifice made by Jason, but we can try to match his incredible sense of service.",
    "FORD: So, I think James has said a lot of things over the last few weeks that I tend to agree with and this is -- this is another in the string of them.",
    "And, you know, for AOC to come out with those names and all the other Democrats, you know, to follow Sinema into a bathroom, I mean, these are tactics.",
    "And let that be -- let those be the words to help energize, re-energize and rekindle to Gil Scott-Heron's comment about how we support police officers.",
    "And the progressives actually say the reason that Joe Biden isn't doing well is not because of us progressives, it's because he is progressive enough.",
    "I'm someone who usually looks to policy solutions for the nation's biggest problems, but fixing the policy here is only a small part of the solution.",
    "The president out in Pennsylvania today touting the economy, but a top Democrat from that state didn't bother to show up citing scheduling conflicts.",
    "I don't know how you do that, but it takes all of us, meaning all, everybody in America, all of us Americans standing together to try and combat it.",
    "Carjacking in the last year in D.C. have reached record highs, it's looking so far like at the beginning of 2022, that trend is continuing upwards.",
    "(BEGIN VIDEO CLIP)\nJOE BIDEN, PRESIDENT OF THE UNITED STATES: The first thing I ask out of the election results, I said how did I do in Scranton.",
    "Not only do we need activists who want to reform police, police departments, we have to support our cops first before we can do any of this.",
    "TURNER: OK.\nFORD: The way you get popular as a politician is you meet people where they are and try to answer their questions and concerns.",
    "And you have -- you have Trudeau pulling a Hillary Clinton and basically calling him deplorables, and saying, oh, they're a fringe group.",
    "(CROSSTALK)\nTURNER: I was just going to say, Judge, that the Democrats who aren't showing up are trying to distance themselves from him.",
    "Those who seek to dim the beacons of hope across these five boroughs, look outside, hear our voices, see the presence in this cathedral.",
    "HAROLD FORD, JR., FOX NEWS HOST: Look, there is nothing more than to echo, my heart goes out to the Mora family and the Rivera family.",
    "GUTFELD: And it's -- I do agree that I think it's a turning point, but it shouldn't be, if you are surprised by this, you're an idiot.",
    "The city's new police commissioner saying it's time to respect police again and push back against the anarchy that's being unleashed.",
    "He couldn't match the lowest expectations ever had for a president, he just didn't have to beat Trump, and he could barely do that.",
    "And in other states, candidates are making sure their calendars fill up quickly and are avoiding even mentioning Joe Biden's name.",
    "WATTERS: So, next time you take a little sip from the tropical drink and a little coconut, make sure there's not cocaine in there.",
    "TURNER: And he said he thinks they're spending too much time and energy on down ballot races that they have no chance of winning.",
    "So now, you turn, you flip around the channels today and you see on CNN and other places, they are covering the funerals, right?",
    "Married to progressive policies and an ideology that we're in an oppressive society and therefore we, everything has to change.",
    "So, I think we need to be as aggressive in lifting these things as conditions improve, as we were about putting them in place.",
    "They want to make sure they look like they're in front of the parade and not in the back end, like they're leading the parade.",
    "What I think is really fascinating to me in this whole thing with the Democrats, and I agree with Harold to a certain extent.",
    "PIRRO: You know what I think is amazing, I think that 38 percent of the country thinks that he cannot manage the government.",
    "Because we are in this memory erasing industry where one story knocks out another story like you're playing a game of pool.",
    "And I'm going to be streaming right after THE FIVE in the in between show-show on foxnews.com from the Facebook Live World.",
    "(BEGIN VIDEO CLIP)\nSCOTT GOTTLIEB, FORMER COMMISSIONER, FDA: People will resume their normal lives hopefully this spring.",
    "And then, meanwhile, you got this amazing thing going on in Canada with these -- with the -- with this incredible convoy.",
    "This widow's comments and her words and the energy and passion that she showed is going to be shown all across the state.",
    "I think every community in this city, black, white, Hispanic, Asian, all want to support and do support police officers.",
    "GUTFELD: All right, tonight, at 11:00 p.m., I got Dan Bongino, Morgan Ortagus, Charlie Hurt, Carley Shimkus, Kat Timpf.",
    "They're like a tribe that is too scared to move beyond the trees of their village because something bad might happen.",
    "FORD: Running at --\nPIRRO: Democrats are in a full-blown civil war even unleashing four letter attacks on each other.",
    "This week after my first year as president, the United States had the fastest economic growth in nearly four decades.",
    "Liz Cheney is trying to be kicked -- they're trying to kick her out of the party in Washington and in her own state.",
    "WATTERS: Do you ever run and all of a sudden you're like wait, I've seen him before, and they're just going around?",
    "So, it's like COVID has been -- it's been a real problem because I love I love people, so that's been a problem.",
    "If you pass things that people don't want to see you work on, then you're likely going to you lose the majority.",
    "The biggest snow total is going to be in eastern Massachusetts, two to three, maybe even four feet are possible.",
    "This is happening at fundraisers, this is happening at his big signature events, it's happening on social media.",
    "You do that, he won't, as a matter of fact, he'll have Republicans coming to his event if he is able to do this.",
    "You know, we talked, we already covered CNN basically saying that our coverage of crime was an Instagram filter.",
    "A year ago, if you turn on CNN or MSNBC, they would portray the police as basically MS-13 with better uniforms.",
    "They're ready to cancel each other out, get big tech to cancel out Sinema and Manchin because they're so angry.",
    "And they're looking at these countries, as Greg is talking about, Germany, Spain, the U.K. --\nGUTFELD: Ireland.",
    "A sea of blue showing up today to honor and support police officers who were under siege in America right now.",
    "FORD: -- how do you -- how do you think --\nGUTFELD: Yes, and it's funny, I didn't even know Denmark was real.",
    "But I work out every morning before I come to work too, OK.\nGUTFELD: Wow, that was a lot of favorite things.",
    "Again, the snow starts flying tonight, really whipping around out there tomorrow morning into the afternoon.",
    "GUTFELD: It goes into sewage --\nTURNER: Like, in the you know --\nGUTFELD: -- and then a turtle chokes on it.",
    "And so now they cover the funeral because they sense the tide is turning and they're caught in the undertow.",
    "I do think it's a turning point, your honor, from this standpoint and everybody's comments around the table.",
    "I think it's a tall order, but I think that's where the focus should go when you talk about moving forward.",
    "I will tell you that on Thursday, five people were shot at a hotel, one of them fatally in Washington, D.C.",
    "There was almost a two-year demoralization of police, you know, champion by the media and by the activists.",
    "The Democrats could save themselves a lot of trouble if they stop being so obviously terrified of the woke.",
    "And if Democrats whomever is in the majority don't accomplish those things they'd generally get voted out.",
    "I think we need to prescribe very clear goalposts for how we -- how we take these mitigation measures off.",
    "He said his key to long life, he didn't really have any secrets, but he sneaks a little rum in his coffee.",
    "The horror that took their lives is an affront to every decent caring human being in this city and beyond.",
    "TURNER: Karine Jean-Pierre didn't want to talk about it, but they're going to have to talk about it soon.",
    "(COMMERCIAL BREAK)\nTURNER: With President Biden's agenda in a tailspin and hopes of a comeback dwindling.",
    "And I think there's still going to be that tension that was built into us for two years by the Democrats.",
    "(BEGIN VIDEO CLIP)\nDOMINIQUE LUZURIAGA, DETECTIVE JASON RIVERA'S WIDOW: The system continues to fail us.",
    "Maybe they want to have everybody in the public know that they are flipping the bird to the politician.",
    "that does not implement tough laws, any legislature that does not -- that does not reform bail reform.",
    "I just want to know what happens when Sinema and AOC see each other in the ladies room at the Capitol.",
    "But I want to know, do they pretend like it's cool or does Sinema say, I heard what you said about me.",
    "And it's like, no man, truckers are heroes provided there's no like, any kind of aggression going on.",
    "I think we look at teachers differently now after we saw that unions and how they've approached this.",
    "I -- he has convinced herself an obstacle to the right to vote to the United -- in the United States.",
    "And everybody saw that, the media saw the doctor saw it, and then we recognized it, and we moved on.",
    "TURNER: And the pottery -- I was going to say -- I was going to close on in a Pottery Barn backdrop.",
    "And then they realized at the end of the first year he is no good at getting any legislation passed.",
    "OK, knives and spoons to the right of the plate, and the fork is to the left with a napkin straight.",
    "It looks like Omicron was not -- it turned out to be not what everybody thought it was going to be.",
    "But up next, why the tide could be turning against leaders who are clinging to COVID restrictions.",
    "She's a fringe blue candidate in a deep blue district with a lot of grassroots fundraising appeal.",
    "The media hates covering crime because if it does not personally involve them, why does it matter?",
    "I am Jesse Watters along with Judge Jeanine Pirro, Harold Ford, Jr., Gil Turner, and Greg Gutfeld.",
    "The tide might be turning though on COVID restrictions as calls for return to normal grow louder.",
    "And then we have \"LAWRENCE JONES CROSS COUNTRY\" which is going to be premiering at 10:00 Eastern.",
    "And if you don't recognize these things as a party that's in power, you're going to lose power.",
    "All that, I think the collateral damage will be seen as something that really wasn't necessary.",
    "I'm very keen on not being seen in public with certain people who I won't name --\nGUTFELD: Yes.",
    "You think national politicians, the DC politicians will be willing to do some of these things?",
    "TURNER: Well, I will say right now, it's not just the dams and the media who are pushing this.",
    "FORD: My wife and mother-in-law told me I eat off people's plates, so that's my bad etiquette.",
    "I'm in between shows right now or I will be in about two minutes and then \"PRIMETIME\" tonight.",
    "So, Judge, the president spends an inordinate amount of time and energy on build back better.",
    "Pass things that are going to solve people's problems from the border to crime to inflation.",
    "Fox Weather Meteorologist Nick Kosir -- Meteorologist Nick Kosir is tracking the nor'easter.",
    "TURNER: How many times did Senator Manchin say he was not going to overturn the filibuster.",
    "I understand the lieutenant governor did show up, although I thought I read that he didn't.",
    "All right, I'm going to shut up now because I want to leave time for Harold and the judge.",
    "WATTERS: Officials in Colombia seized 20,000 Coconuts filled with liquid coke yesterday.",
    "Now this is not something that just goes with Democrats, you see on the Republican side.",
    "Like, I'm waiting for Democrats to cancel each other out, because that's where they are.",
    "But until you do those things politicians aren't go flock to someone who is not popular.",
    "It's not going to work anyway because midterms are always a referendum on the president.",
    "Two, you got to talk about a national plan for crime and you got to address the border.",
    "(END VIDEO CLIP)\nFORD: The New York Times also pushing back at republishing this piece.",
    "And it's funny how COVID has turned truckers -- because these are the first responders.",
    "So, I think it's really only a matter of time, regardless of where any politicians are.",
    "I think here in New York City, it will be close to about a foot, maybe foot and a half.",
    "You and I do the same thing but anyway, what etiquette -- rule of etiquette you ignore?",
    "What if the Republicans traded Lynne Cheney and Adam Kinzinger for Sinema and Manchin?",
    "Democrats want nothing to do with the most toxic man in politics right now, Joe Biden.",
    "GUTFELD: I can't believe that need --\n(CROSSTALK)\nTURNER: All right, what do you have?",
    "And more importantly for those of us who want bail reform, every legislator in Albany.",
    "We ought to figure out ways to enact smart gun laws, not only do we need bail reform.",
    "This has been a blue state for 20 years and they have to come up with better excuses.",
    "I mean, you look at Joe Rogan is fine, Fox News is fine, Manchin and Sinema are fine.",
    "We are much more widely vaccinated than they are, and they are already transitioning.",
    "And those are countries, by the way, they had much less widespread COVID than we did.",
    "GUTFELD: Yes,\nTURNER: The producer is telling me that I have to let you have a word.",
    "Politics is about solving people's problems, not advancing your own personal agenda.",
    "Everybody wants to know how much snow is going to fall in their city and here it is.",
    "Look, politicians don't always flock to the vulnerable, they flocked to the popular.",
    "It is a turning point because we stand strong and I've stood in many of those lines.",
    "I guess, we had a conversation -- I can't wait to get back to hugging again people.",
    "Yes, there are some Republicans --\n(CROSSTALK)\nFORD: I'm writing that down, Judge.",
    "But she did and we should try our hardest to limit that from ever happening again.",
    "And the way to end it is with governors to talk out of both sides of their mouths.",
    "WATTERS: Well, that's a book in case you're interested, and it's changed my life.",
    "I ran into both Alec Baldwin and Michael Moore enjoying the hot spring somewhere.",
    "TURNER: He said this is like 10 times worse spitting out your gum in the street.",
    "GUTFELD: All right, my -- the rule that -- I am extremely rude, and so were you.",
    "Alvin Bragg, whoever the new governor is, hopefully we'll put him out of office.",
    "It's -- what matters is who shows up or doesn't show up when you come into town.",
    "GUTFELD: I'm going to give you an analogy that's going to blow your mind, Judge.",
    "And you can't criticize them and force them to do things they don't want to do.",
    "Gillian, I think this is your first time on the show and you've done terribly.",
    "GUTFELD: Did you do with the dates --\nPIRRO: During the Iliad and the Odyssey.",
    "So, all these guys do is get popular again and they'll right come back to him.",
    "We're sure it has nothing to do with a string of bad polls including this one.",
    "So, I'm looking forward to having that etiquette come back into my etiquette.",
    "TURNER: How is Harold is supposed to talk -- allowed to talk about his kids?",
    "Greg, since you were becoming advisor to a sovereign nation --\nGUTFELD: Yes.",
    "It's just a matter of time, Harold, before you will be saying that as well.",
    "Legislator in Albany ought to have to listen to what this widow said today.",
    "First of all, let me say that the speeches were powerful in St. Patrick's.",
    "Politics again, it's about solving problems Democrats or Republican alike.",
    "As you said, the cron just kind of breeze through just with the sniffles.",
    "There is a war on cops, you're absolutely right, but it's time to end it.",
    "I know you are tired of these laws, especially the ones from the new D.A.",
    "PIRRO: What -- what -- does he thinks he get something out of whispering?",
    "Their -- the down ballot candidates are entirely ghosting the president.",
    "Carville also said that he thinks --\n(CROSSTALK)\nFORD: Some of them are.",
    "Bragg and the chief of police and the mayor of this town, but every D.A.",
    "GREG GUTFELD, FOX NEWS HOST: Well, I mean, those pictures were amazing.",
    "(END VIDEO CLIP)\nWATTERS: Today was a turning point in the city, Judge.",
    "What is amazing about Joe Biden, he couldn't do the two easiest things.",
    "It seems to be a variant but it looks as if that too may be early data.",
    "GUTFELD: All right, what rules of etiquette do you most ignore, Harold?",
    "The truckers are the people that got the food to Trudeau --\nPIRRO: Yes.",
    "I get up every morning and get to see my kids and take them to school.",
    "FORD: Gillian, you're in Washington and you're around the politicians.",
    "PIRRO: I don't -- I don't think history is going to look kindly at us.",
    "FORD: I don't -- I mean, I'm an etiquette man, so I don't really know.",
    "TURNER: They can distance themselves all they want, it doesn't matter.",
    "PIRRO: Well, you know, Jesse, Biden doesn't know how to fix inflation.",
    "Conor Lamb, the Senate Democratic Senate candidate was there as well.",
    "The border isn't -- them go anywhere because you don't talk about it.",
    "(APPLAUSE)\nBIDEN: By the way, guess who is supplying those batteries?",
    "Harold, I'm going to come to you first because these are your people.",
    "8:00 p.m., you got Brian Kilmeade debuting the new show \"ONE NATION.\"",
    "If that's not a lineup, you can go straight to H-E-double toothpicks.",
    "But I like coming to work when there's sun coming through the window.",
    "GUTFELD: Oh, it's -- that's kind of what I do without the breathing.",
    "I asked if you had a question about that, and I was going to say no.",
    "WATTERS: Did you get it -- oh, you mean on the street or the gutter?",
    "It's something the Biden administration is going to have to address.",
    "I felt that, people of the city felt that, and it's about damn time.",
    "PIRRO: I mean, that is as bad as it's ever been with the president.",
    "It's like -- I haven't been there so I'm not sure it's still there.",
    "They said, The White House is terrified of Joe Biden getting COVID.",
    "\"Let's take their mask off after the Omicron surge,\" kids that is.",
    "GUTFELD: Because somebody steps in it, and then it's on your shoe.",
    "His daughter throws him a surprise party and put Staying Alive on.",
    "And to, like, the poll doesn't matter, a war chest doesn't matter.",
    "We may not match his courage, but we can try to match his passion.",
    "WATTERS: We should be more explicit when we talk about the system.",
    "Then we've got \"UNFILTERED\" with Dan Bongino now at 9:00 Eastern.",
    "The narcotics were found on a shipping container headed to Italy.",
    "GUTFELD: Oh, I'll -- you'll do exactly --\nPIRRO: OK, you tell me.",
    "If he had moved more left, he'd have the whole party behind them.",
    "There are winners and then there are losers and you know who won.",
    "WATTERS: Carrots and sticks, have you heard that analogy before?",
    "And even Adam Kinzinger they are trying to kick him out as well.",
    "If we're serious about having the majority, then behave like it.",
    "TURNER: I think the key in what you just said is pass something.",
    "GUTFELD: -- while he was doing nothing but putting on blackface.",
    "FORD: The Marine Veteran Jack Becker celebrate his 100 birthday.",
    "Across the country, cops are being gunned down every single day.",
    "But aside from that, you know, they don't want to be with them.",
    "We've also got a special forecast for you now to get you ready.",
    "(COMMERCIAL BREAK)\nWATTERS: It's time now for \"ONE MORE THING.\"",
    "My child has asthma, you know, and like I would jump somewhere.",
    "GUTFELD: Oh, OK. Do you want to ask me about Joy Reid's dress?",
    "So, make sure you download the Fox Weather App for the latest.",
    "We're talking about a widespread potential for a foot of snow.",
    "GUTFELD: and they do deserve to drown metaphorically speaking.",
    "WATTERS: So, Gillian, you're a Washington base, is that true?",
    "Six law-enforcement officers were shot in less than 48 hours.",
    "WATTERS: -- because I need to protect my sterling reputation.",
    "Content and Programming Copyright 2022 Fox News Network, LLC.",
    "And they're not afraid of him get it so he gets hospitalized.",
    "WATTERS: It's like the Trojan Horse but a little bit better.",
    "I'm going to go ahead and say that -- I'm going to stick it.",
    "This is a rush transcript from \"The Five,\" January 28, 2022.",
    "That blue line isn't thin, it's a lot bigger than you think.",
    "No widow -- now woman should ever have to say those things.",
    "I'll see you Monday back on America Reports at one o'clock.",
    "It's like a VCR, you just turn the power button on and off.",
    "WATTERS: I wake up, I stretch, I guzzle 40 ounces of water.",
    "FORD: I thought going to Penn and Michigan was educational.",
    "PIRRO: Left -- water is to the right, bread is to the left.",
    "This copy may not be in its final form and may be updated.",
    "Here's the bottom line, it's criminal privilege right now.",
    "These are the judges who have the power, but don't use it.",
    "It's time to find tune it because we're all going to lose.",
    "So, crime, violent crime is a major problem there as well.",
    "It's five o'clock in New York City, and this is The Five.",
    "PIRRO: OK. And even Stacey Abrams when he was in Georgia.",
    "And I'm going to eat some alligator, so it's a good show.",
    "I think that -- and we've talked about this at the table.",
    "And then I read, I write, I breathe, and then I work out.",
    "GUTFELD: What is your favorite thing about your work day?",
    "Because you're very -- you're like the king of etiquette.",
    "That's the reason why he's still in a basement strategy.",
    "The rest of the country is not in the basement strategy.",
    "Why can't politics be like sports, and have team trades?",
    "Like 17 times a day, yet they still went down this path.",
    "TURNER: Greg, you're not making me uncomfortable at all.",
    "Folks, I want to tell you, it matters, it matters a lot.",
    "And I hope those words today resonate not only with D.A.",
    "We know who the people are, this has to be personalized.",
    "Even Democrats our too scared to be seen with this guy.",
    "WATTERS: Does that sound a little better --\nPIRRO: Yes.",
    "TURNER: He acted -- I mean, he acted like I don't know.",
    "TURNER: Like, not on the sidewalk but just in the road.",
    "I just thought it was a fictional place in Shakespeare.",
    "WATTERS: I thought she was like kind of edgy and slick.",
    "TURNER: Are you allowed to comment on people's attire?",
    "But I think it's like the police shootings of A block.",
    "The modern McCarthy-ites fold when you challenge them.",
    "WATTERS: So, that's all they're doing in Pennsylvania.",
    "Thank you very much for joining us here on Your World.",
    "Are you feeling what is going on up here in New York?",
    "He needs to write tighter speeches for the president.",
    "This has been even more so just the speech here, sir.",
    "I'll go to you, Jesse, since your workday is changed.",
    "WATTERS: Water is to the right, bread is to the left?",
    "And then, I got to tell you, I like doing this show.",
    "That's why he goes to Delaware every single weekend.",
    "WATTERS: I didn't --\nPIRRO: He does it all the time.",
    "This isn't Texas, they're not ghosting him in Texas.",
    "No wife or mom should ever have to say those things.",
    "And I believe we are going to go forward from here.",
    "PIRRO: But Gillian, real quick, with one statement.",
    "(CROSSTALK)\nPIRRO: Well, I said it a long time ago.",
    "And so -- I mean, it's --\nPIRRO: No, it's eyebrows.",
    "It's going to impact tens of millions of Americans.",
    "TURNER: You're doing another show before your show.",
    "Not advancing your own personal brand of politics.",
    "But we have got to find tune into the individuals.",
    "TURNER: -- he thinks Democrats are too emotional.",
    "Scheduling issues, yes, I have scheduling issues.",
    "Remember, they are going to reset his presidency.",
    "TURNER: So, she doesn't have the political power.",
    "Like, I'm having fun when I'm insulting somebody.",
    "TURNER: Nobody --\nWATTERS: And the water glasses.",
    "PIRRO: (INAUDIBLE) but the show is not over yet.",
    "Not about your day, so don't bring up your baby.",
    "You think D.C. politicians will behave this way?",
    "But Biden is still in the bunker like it's 2020.",
    "The media and the Dems are seeing the tide turn.",
    "(COMMERCIAL BREAK)\nFORD: My kids' favorite song.",
    "Pass things that people want to see you work on.",
    "The president is trying to get the supply chain.",
    "We can't survive in our society with this chaos.",
    "JESSE WATTERS, FOX NEWS HOST: Hello, everybody.",
    "PIRRO: -- the Democrats are calling each other.",
    "What's your favorite thing about your work day?",
    "PIRRO: What -- you know, what is the worst day?",
    "TURNER: So, there's a huge winter storm coming.",
    "WATTERS: That's Nick the meteorologist, right?",
    "What's your favorite thing about your workday?",
    "Is there -- is there any rule that you ignore?",
    "The American people have lapped the president.",
    "Nothing bad happens if you challenge the woke.",
    "Denmark apparently has been listening to Greg.",
    "WATTERS: Greg Gutfeld, your thoughts on today?",
    "I called it a Trojan horse, but it is a shell.",
    "Trump put it in play one time, but that's it.",
    "GUTFELD: That was a really interesting point.",
    "That's the barometer for a successful person.",
    "The media hates that because that's too easy.",
    "They're so scared they don't have him travel.",
    "Yes, I get to make fun of my friends all day.",
    "GUTFELD: I wouldn't -- you know, I zoned out.",
    "WATTERS: My miracle mornings are my favorite.",
    "I was like, I would never spit in the street.",
    "Water here, wine there --\nWATTERS: Oh, nice.",
    "TURNER: And what did they do with the bears?",
    "WATTERS: Yes, your friends and your enemies.",
    "GUTFELD: I would say I'm the hotter of both.",
    "It's not just a classic people that do that.",
    "Up next, just how toxic is President Biden?",
    "I mean, everybody's a little wacky in this.",
    "And the rest of the world is moving on too.",
    "They're going to say, you can't be near me.",
    "NICK KOSIR, FOX WEATHER METEOROLOGIST: Hey.",
    "TURNER: You guys should have a new segment.",
    "WATTERS: It's an in between the show-show.",
    "TURNER:\" No cocaine in his coconut though.",
    "WATTERS: Well, I'd take Sinema in a fight.",
    "What a perfect trade that would be, right?",
    "FORD: We're OK. We'll take -- I'm kidding.",
    "But the supply chain helps with inflation.",
    "(COMMERCIAL BREAK)\nGUTFELD: Yes, whatever.",
    "But you have to remember how we got here.",
    "And that's the path we find ourselves on.",
    "Do they pretend like nothing's happening?",
    "WATTERS: It was it was yellow, wasn't it?",
    "GUTFELD: I hate people but I love to hug.",
    "When you get to work or when you wake up?",
    "We have a lot -- we have a monkey update.",
    "WATTERS: Well, mask etiquette, obviously.",
    "TURNER: He said it's worse than spitting.",
    "I love -- I'm more --\nWATTERS: Come here.",
    "TURNER: He said it's worse than spitting.",
    "Is it to the right or is it to the left?",
    "In 1942 Columbus sailed -- sorry, Judge.",
    "It's a good question for everybody here.",
    "(COMMERCIAL BREAK)\nGUTFELD: You know it.",
    "I mean, that's what I really care about.",
    "That was like -- I could have done that.",
    "WATTERS: For the message to get through.",
    "And the whispering probably should stop.",
    "GUTFELD: You did call it a Trojan horse.",
    "GUTFELD: That was a very original label.",
    "I mean, she doesn't have that strategy.",
    "Like, it just gives me a lot of energy.",
    "But I can't figure out the bread plate.",
    "GUTFELD: We're both obnoxious and loud.",
    "It took me a while to get down as well.",
    "TURNER: All right Nick, thanks so much.",
    "GUTFELD: I'm going to ask Jesse first.",
    "FORD: Mine is very similar to Jesse's.",
    "You got to have some carrots in there.",
    "WATTERS: Joe Biden got lapped, Harold.",
    "WATTERS: Participation medals, Harold?",
    "GUTFELD: I've never heard that before.",
    "GUTFELD: Do you have the dates, Judge?",
    "We do it too, not even as politicians.",
    "They declined today during the gaggle.",
    "Look, politicians --\nPIRRO: You would?",
    "Is this just a New York centric thing?",
    "The NYPD will never give up this city.",
    "Everyone gave her a standing ovation.",
    "So how can he possibly talk about it?",
    "PIRRO: The Iliad and the Odyssey B.C.",
    "WATTERS: Pottery Barn, AOC, let's go.",
    "GUTFELD: Yes, but that is disgusting.",
    "Everyone has been asking about that.",
    "Check out who I ran into at the spa.",
    "But Denmark is now the world leader.",
    "GUTFELD: And then he demonizes them.",
    "GUTFELD: Actually, that was amazing.",
    "GUTFELD: I was going to say workday.",
    "GUTFELD: Yes, that was pretty funny.",
    "WATTERS: He's going to reset, Judge.",
    "Not even the members of the service.",
    "PIRRO: From your lips to God's ears.",
    "Or it's a national situation, right?",
    "He does not deserve to be in office.",
    "To your point, to your point, Jesse.",
    "GILLIAN TURNER, FOX NEWS HOST: Yes.",
    "FORD: I'm going to write that down.",
    "FORD: \"FAN MAIL FRIDAY\" is up next.",
    "You can't treat people like idiots.",
    "what happened during this pandemic.",
    "You want to know what else is nuts?",
    "This new Saturday primetime lineup.",
    "GUTFELD: I love every minute of it.",
    "GUTFELD: Yes, that's a good point.",
    "WATTERS: Actually, no there's not.",
    "TURNER: Being here with you, Greg.",
    "JEANINE PIRRO, FOX NEWS HOST: Yes.",
    "(END VIDEO CLIP)\nPIRRO: All right.",
    "It's a real nationwide trend now.",
    "He's a human, it's not a machine.",
    "TURNER: I was pretty interesting.",
    "This is a blue state that he won.",
    "WATTERS: OK, here's your diploma.",
    "Look, more people are vaccinated.",
    "PIRRO: They give them to charity.",
    "PIRRO: I can't think of anything.",
    "It's my spa day, Greg's spa day.",
    "WATTERS: Ever run cross country?",
    "Not all sticks, Harold, carrots.",
    "What --\nWATTERS: You're so rude.",
    "February 1, how amazing is that?",
    "TURNER: All right, we got to go.",
    "But all in all, it's trash talk.",
    "She is not ally on civil rights.",
    "WATTERS: I'm sure you felt that.",
    "She takes one side or the other.",
    "UNKNOWN: I think she's (muted).",
    "I will start with you, Gillian.",
    "PIRRO: But what if it's enough?",
    "FORD: I sure hope you're wrong.",
    "I get to insult people for fun.",
    "FORD: Your Honor -- Your Honor?",
    "We've talked about this before.",
    "He deserves every minute of it.",
    "Have a nice weekend, everybody.",
    "Gillian, you said you got one.",
    "TURNER: Jesse went to college.",
    "And that gets my rhythm going.",
    "That -- was that Pottery Barn?",
    "FORD: We're OK.\nGUTFELD: What?",
    "So, Harold, would you show up?",
    "And The Five starts right now.",
    "What do you think about that?",
    "They picked the perfect date.",
    "WATTERS: It's like Greenland.",
    "And then I read a little bit.",
    "FORD: Judge, I mean, come on.",
    "But I don't have any enemies.",
    "And like I said, he's lapped.",
    "PIRRO: Yes, the face shields.",
    "What -- you said you had one.",
    "\"ONE MORE THING\" is up next?",
    "PIRRO: Yes, I do embrace it.",
    "It should be gone by Sunday.",
    "We all need to get involved.",
    "WATTERS: -- than scheduling?",
    "WATTERS: All right, Harold.",
    "FORD: I mean, I'm a hugger.",
    "PIRRO: OK, a Hershey Bears.",
    "WATTERS: Yes, face shields.",
    "TURNER: -- Canada, Ireland.",
    "WATTERS: Mentally Ill Omar?",
    "GUTFELD: Yes, there you go.",
    "PIRRO: Who's your money on?",
    "GUTFELD: But you know what?",
    "WATTERS: I didn't comment.",
    "TURNER: I have a good one.",
    "I read politico last week.",
    "PIRRO: No, I really don't.",
    "GUTFELD: That's a new one.",
    "We're both extremely rude.",
    "GUTFELD: No, there wasn't.",
    "He needs a little cocaine.",
    "Do I have time to do this?",
    "That's what I have to say.",
    "Biden is back is business.",
    "You do these three things.",
    "Can we all claim victory?",
    "WATTERS: That's was cool.",
    "13 minutes to booze time.",
    "You wake up really early.",
    "Does AOC have a strategy?",
    "WATTERS: I couldn't tell.",
    "That's my advice to you.",
    "She looks more athletic.",
    "I was going to say here.",
    "He couldn't stay seated.",
    "GUTFELD: That's my goal.",
    "TURNER: Not interesting.",
    "We are not safe anymore.",
    "WATTERS: In the gutter.",
    "We're both rude people.",
    "And that's my forecast.",
    "We had many more cases.",
    "Also, AOC's backsplash.",
    "Nancy is the tactician.",
    "She's just a live wire.",
    "They're doing it right.",
    "GUTFELD: It was yellow.",
    "WATTERS: Was it yellow?",
    "It has now stalled out.",
    "Pass something, right?",
    "She's not a tactician.",
    "GUTFELD: I don't know.",
    "Do you ever run track?",
    "That's the best thing.",
    "WATTERS: It's so nice.",
    "These are (INAUDIBLE).",
    "GUTFELD: Yes, exactly.",
    "GUTFELD: There you go.",
    "Judge, what -- I know.",
    "Now, he's wrong there.",
    "GUTFELD: None of them?",
    "Thanks for joining us.",
    "That's where we're at.",
    "That's what they have.",
    "You can't reset a guy.",
    "PIRRO: Yes, of course.",
    "I want every precinct.",
    "TURNER: Thanks a lot.",
    "That's all they have.",
    "PIRRO: That's better.",
    "TURNER: That's right.",
    "This is Pennsylvania.",
    "PIRRO: Yes, or a rat.",
    "WATTERS: Do you know?",
    "You might have heard.",
    "The man got to dance.",
    "GUTFELD: I'm kidding.",
    "GUTFELD: I'm kidding.",
    "GUTFELD: What's that?",
    "GUTFELD: It was, yes.",
    "Was it yellow or not?",
    "FORD: Joe Biden did.",
    "FORD: Joe Biden did.",
    "WATTERS: No cocaine.",
    "ALL RIGHTS RESERVED.",
    "Like, in the gutter.",
    "PIRRO: None of them.",
    "And why is this bad?",
    "Wait till the break.",
    "I don't believe you.",
    "We'll be right back.",
    "They were demonized.",
    "Do you believe that?",
    "Here's the problem.",
    "WATTERS: All right.",
    "GUTFELD: All right.",
    "Wait till you hear.",
    "TURNER: I think so.",
    "WATTERS: It's fine.",
    "PIRRO: To the left?",
    "Let's do it anyway.",
    "Oh, those Italians.",
    "How stupid is that?",
    "I'm doing 5:45 now.",
    "GUTFELD: Yes, same.",
    "WATTERS: That's it.",
    "TURNER: Thank you.",
    "\"FAN MAIL FRIDAY.\"",
    "Guys, back to you.",
    "WATTERS: I'm next.",
    "It's a tough word.",
    "GUTFELD: Or a rat.",
    "PIRRO: Yes, I did.",
    "You get a victory.",
    "PIRRO: Absolutely.",
    "And then it does.",
    "I'm Sandra Smith.",
    "PIRRO: All right.",
    "PIRRO: They will.",
    "PIRRO: All right.",
    "PIRRO: Very good.",
    "FORD: He's right.",
    "PIRRO: All right.",
    "GUTFELD: Oh, yes.",
    "GUTFELD: Carrots.",
    "And a backsplash.",
    "I expected more.",
    "I appreciate it.",
    "FORD: You don't?",
    "WATTERS: We did.",
    "It was far less.",
    "PIRRO: I do too.",
    "Just embrace it.",
    "WATTERS: Busted.",
    "Anyway, up next.",
    "She's got to go.",
    "in this country.",
    "General Motors.",
    "GUTFELD: Judge?",
    "You don't know.",
    "TURNER: Thanks.",
    "So, here it is.",
    "PIRRO: Oh, yes.",
    "Voting rights.",
    "Is that weird?",
    "Is that weird?",
    "FORD: Oh, God.",
    "GUTFELD: What?",
    "FORD: I would.",
    "GUTFELD: Look.",
    "We are strong.",
    "We are united.",
    "WATTERS: Yes.",
    "WATTERS: Yes.",
    "PIRRO: Right.",
    "PIRRO: Right.",
    "I don't know.",
    "GUTFELD: Wow.",
    "TURNER: Next.",
    "GUTFELD: Yes.",
    "GUTFELD: Wow.",
    "PIRRO: Right.",
    "There you go.",
    "GUTFELD: Yes.",
    "GUTFELD: Yes.",
    "TURNER: What?",
    "It's insane.",
    "WATTERS: No.",
    "GUTFELD: No.",
    "TURNER: Yes.",
    "FORD: I did.",
    "FORD: I did.",
    "You know it.",
    "PIRRO: Yes.",
    "Oh, please.",
    "Who's next?",
    "No worries.",
    "Guess what?",
    "PIRRO: Yes.",
    "PIRRO: Yes.",
    "PIRRO: Yes.",
    "FORD: Sure.",
    "Yes, right.",
    "All right.",
    "Inflation.",
    "Very good.",
    "All right.",
    "Hear here.",
    "That's it.",
    "Thank you.",
    "Thank you.",
    "It's fine.",
    "Hey, Nick.",
    "Gillian.",
    "A reset.",
    "Please.",
    "Right?",
    "Judge?",
    "Sorry.",
    "Right.",
    "Right?",
    "Right?",
    "Boom!",
    "Next.",
    "Greg?"
  ]
}