{
  "id": 716,
  "mediaId": 157,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "MAGA candidates getting trounced in fundraising -- and showing limits of Trump's power: report",
  "image": "https://www.rawstory.com/media-library/gop-group-under-criminal-investigation-after-auctioning-maga-hats-with-fake-trump-signatures.jpg?id=24740116&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/donald-trump-2656528475/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Wright",
  "authorUrl": "https://www.rawstory.com/u/johnwright",
  "termIds": [
    729,
    815,
    1147,
    1223,
    1404,
    2475,
    3085,
    3094,
    571,
    2537,
    2834,
    2976
  ],
  "sentences": [
    "IN OTHER NEWS: Jen Psaki sets the record straight on Republicans' complaints about nominating a Black woman to SCOTUS\nJen Psaki sets the record straight on Republicans' complaints about nominating Black woman to SCOTUS",
    "In Alaska, incumbent GOP Sen. Lisa Murkowski, who voted to impeach the former president, raised more than twice as much as her Trump-backed challenger, and has nearly seven times as much in the bank.",
    "While former president Donald Trump himself has amassed a $122 million war chest, every candidate he has endorsed against a GOP incumbent is \"getting crushed,\" Vice News reported Tuesday afternoon.",
    "In Alabama, Trump-backed Senate candidate Mo Brooks' fundraising haul for the last three months was less than a third of the total raised by his top Senate primary opponent, Katie Boyd Britt.",
    "Vice News reporter Cameron Joseph pointed to several examples of Trump-backed candidates getting \"shellacked\" by their opponents in fundraising during the most recent quarter.",
    "\"It's not a shock that incumbents are out-raising challengers, even ones backed by the former presidentincumbency offers a lot of fundraising advantages.",
    "In North Carolina, Trump-backed GOP Senate candidate Ted Budd raised less than half as much as the Democratic frontrunner, Cheri Beasley.",
    "And in Wyoming, GOP Rep. Liz Cheney raised $2 million in the last quarter, compared to Trump back challengers Harriet Hageman's $443,000.",
    "\"But the struggles from so many of Trump's candidates to catch fire in fundraising show the limits his support offers candidates.",
    "Trump-backed candidates across the country are getting trounced in fundraising, according to the latest campaign finance reports.",
    "And it could mean his power over the GOPand ability to get his allies into officeisn't quite as strong as many have assumed.\"",
    "In Georgia, Trump-backed Senate candidate Herschel Walker raised an impressive $5.4 million over the last three months.",
    "However, Georgia Democratic Sen. Raphael Warnock far outpaced him, bringing in $9.8 million.",
    "And money isn't the only thing that matters in politics,\" the report states."
  ]
}