{
  "id": 7187,
  "mediaId": 129,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Scorned by Trump, Mo Brooks Rises in Alabama Senate Race",
  "image": "https://static01.nyt.com/images/2022/05/21/us/00pol-alabama-senate-britt-v/merlin_195748242_a2b43142-368e-42d9-8f47-79241127745d-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/05/22/us/politics/alabama-senate-mo-brooks.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    2280,
    2354,
    2475,
    3094,
    5529,
    11,
    12,
    571,
    2537,
    5533
  ],
  "sentences": [
    "He called Mr. Durant a John McCain-type of Republican and Ms. Britt a Mitch McConnell-establishment, open-borders, cheap-foreign-labor, special-interest-group Republican.\nA poker-faced former prosecutor, Mr. Brooks nonetheless seemed to savor, at a couple of campaign appearances on Friday, his comeback from March, when he was polling in the teens and Mr. Trump abandoned him.",
    "In style and experience, there are strong differences between the stolid Mr. Brooks and the energetic Ms. Britt, a lawyer whose first digital ad featured her marriage to Wesley Britt, a former University of Alabama football star  no small credential in a state where the other senator, Tommy Tuberville, is a former Auburn University football coach.",
    "On Friday night, Mr. Brooks appeared in Clanton at Peach Park, a popular roadside fruit and ice cream stand adorned with pictures of beauty queens posing with peaches, for an outdoor screening of the movie 2000 Mules. The film is the latest conservative effort to promote the myth of widespread fraud in the 2020 election.",
    "The former president accused Mr. Brooks of having gone woke because he had urged a crowd, months earlier, to put the 2020 election behind you.\nMr. Brooks, 68, is the least woke person in the state of Alabama, said Terry Lathan, a former chair of the Alabama Republican Party, who is a co-chair of the Brooks campaign.",
    "Mr. Brooks  who appeared at Mr. Trump's Jan. 6 rally before the siege of the Capitol, where he goaded election deniers to start kicking ass  has returned to contention not only despite Mr. Trump's fickleness, but also in the face of opposition by Senator Mitch McConnell of Kentucky, the Republican leader.",
    "One ad flashes a tweet from Donald Trump Jr. in 2021  back when his father still liked Mr. Brooks  calling Ms. Britt the Alabama Liz Cheney.\nThe share of voters with a favorable view of Ms. Britt dropped six points in the recent Alabama Daily News poll, compared with a survey in early May.",
    "In a twist of fate, the Brooks bounce-back appears to be driven by voters who identify as Trump Republicans  another bit of evidence, after recent primaries from Nebraska to Pennsylvania, that the former president's political movement may no longer be entirely under his command.",
    "Another outside group, calling itself No More Mo, ran an ad in the Florida media market that includes Mar-a-Lago, which blared that Mr. Brooks was a proven loser and Trump deserves winners.\nMr. Trump withdrew his endorsement of Mr. Brooks shortly after.",
    "The anti-tax Club for Growth, which supports Mr. Brooks, has spent $6 million in the state on ads, including one barraging Ms. Britt  the former head of an Alabama business group  as really a lobbyist who supported a state gas tax increase.",
    "Mr. Brooks revealed in response that Mr. Trump had pressed him for months after Jan. 6 to illegally rescind the 2020 election and to remove President Biden, and that he told Mr. Trump it was impossible under the Constitution.",
    "She told Mr. Brooks that on her show that day, We all agreed that it's going to be a runoff between you and Katie and that you have picked up steam.\nThere was speculation on air, she said, that Mr. Trump would re-endorse him.",
    "A polling average by Real Clear Politics showed Katie Britt, a former aide to Mr. Shelby, in the lead with 34 percent, Mr. Brooks with 29 percent and Mike Durant, a military contractor and Army veteran, with 24 percent.",
    "The story of the numbers in a way is that everyone at this point has an image that is pretty close to the water line, said John Rogers, a strategist for Cygnal, which conducted the Alabama Daily News polling.",
    "On that date, Mr. Brooks, wearing body armor, had asked the roiling crowd of Trump supporters gathered near the White House, Are you willing to do what it takes to fight for America? Cheers erupted.",
    "A poll on Thursday for The Alabama Daily News and Gray Television showed likely voters who identified as traditional conservative Republicans favored Ms. Britt and Mr. Durant over Mr. Brooks.",
    "It is Mr. Durant, a former Army pilot who figured in the 1993 Black Hawk Down incident in Somalia, who seems most battered  and most upset  by the blasts of negativity on the airwaves.",
    "But Mr. Brooks has staged a compelling comeback, with recent polling putting him in a statistical tie for the lead in a tight three-candidate race ahead of the primary on Tuesday.",
    "Campaign ads feature her calling to get kids and God back in the classroom and, while striding through a girls' locker room, accusing crazy liberals of wanting to let boys in.",
    "The race has seen millions of dollars spent on negative ads attacking all three candidates that in many ways have shaped the turbulent peaks and valleys of their campaigns.",
    "Despite the Trumpian snub, Mr. Brooks continues to falsely maintain that the election was stolen from the former president, a view widely held by Alabama Republicans.",
    "CLANTON, Ala.  Two months ago, Representative Mo Brooks, whose hard-right credentials were unblemished, seemed to be imploding in the Alabama Republican Senate race.",
    "Now he is struggling to make it into a runoff, after being accused of weakness on gun rights and fighting off a false claim that he doesn't live in Alabama.",
    "In particular, opinions of Mr. Durant and Ms. Britt, who as first-time candidates are less well-known, have been battered by assaults over the airwaves.",
    "Mr. Brooks, already a known quantity, better withstood attacks and is slightly above water in terms of favorable and unfavorable opinions with voters.",
    "But Mr. Brooks won the support of a plurality of voters who identified as Trump Republicans  35 percent, up from 26 percent in an earlier survey.",
    "In 12 years as an arch-conservative in the House, Mr. Brooks has bucked party leadership, which won him no fans among Senate Republican leaders.",
    "Awaiting the start of the film, Apryl Marie Fogel told Mr. Brooks that she had been an undecided voter, but had made up her mind to support him.",
    "Brooks may be surging just at the right time, a conservative talk radio host, Dale Jackson, said over the Birmingham airwaves on Friday.",
    "In politics, the only thing that matters is how much money you've got and how low you're willing to go, he said with disgust on Friday.",
    "Mr. McConnell and his allies would prefer a different replacement for the open seat of Senator Richard Shelby, 88, who is retiring.",
    "Slowly but surely, conservatives are figuring out I'm the only conservative in this race, Mr. Brooks said in an interview.",
    "His stated reason was that Mr. Brooks had gone wobbly on election denialism by urging voters to focus on future races.",
    "A super PAC favoring Ms. Britt, Alabama's Future, dredged up clips of the congressman disparaging Mr. Trump in 2016.",
    "A super PAC aligned with Mr. McConnell has funneled $2 million to a group attacking Mr. Brooks in television ads.",
    "Alabama's deep-seated conservatism means that the Republican nominee is all but assured of winning in November.",
    "He went on: Will you fight for America? Not long after, the protest became a riot and the Capitol was breached.",
    "What we're going to see tonight is a reaffirmation of what we already know, Mr. Brooks told a sparse crowd.",
    "If no candidate consolidates more than 50 percent on Tuesday, the top two advance to a runoff on June 21.",
    "On May 12, Mr. Brooks was subpoenaed by the House committee investigating the violence on Jan. 6, 2021.",
    "Former President Donald J. Trump humiliated Mr. Brooks by rescinding an earlier endorsement.",
    "I don't think you can trust Donald Trump with anything he says, Mr. Brooks said back then.",
    "The Georgia State Elections Board last week dismissed some claims central to the movie.",
    "I hope it will backfire.\nMr. Brooks's time in the barrel took place in the spring.",
    "Ms. Fogel is the host of Straight Talk with Apryl Marie on Montgomery talk radio.",
    "Under a rain of attack ads, polls showed him falling behind two rivals.",
    "Ms. Britt, 40, presents herself as a committed social conservative.",
    "That would be interesting, he allowed.",
    "Mr. Brooks paused, his face a mask.",
    "In March, he was leading in polls.",
    "It's very, very disturbing."
  ]
}