{
  "id": 723,
  "mediaId": 234,
  "date": "1/31/2022 12:00:00 AM",
  "headline": "At Least Some Republicans Realize It's Batshit for Trump To Dangle Pardons for Capitol Rioters",
  "image": "https://media.vanityfair.com/photos/61f8145dc7c976782553df90/master/w_2240,c_limit/Donald-Trump.jpg",
  "link": "https://www.vanityfair.com/news/2022/01/at-least-some-republicans-realize-its-batshit-for-trump-to-dangle-pardons-for-capitol-rioters",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1053,
    1147,
    1464,
    2034,
    2240,
    2326,
    2329,
    3094,
    428
  ],
  "sentences": [
    "Susan Collins of Maine, who did vote to convict Trump in his second impeachment trial, said in response to Trump's pardon comments: We should let the judicial process proceed.? She also called January 6 a dark day in our history.?\nRep. Liz Cheney, the top Republican on the House select committee investigating the Capitol attack (and one of ten out of 211 Republicans in the House who voted to impeach Trump), also spelled out the dangerous implications of Trump's recent statements on Twitter:\nWhether pardons for convicted rioters willlike Republicans' watering down the seriousness of January 6become something of an adopted party line remains to be seen, the Washington Post's Philip Bump pointed out.",
    "No, it is not.?\n Inside Jerry Falwell Jr.'s Unlikely Rise and Precipitous Fall at Liberty University\n Eric Adams Pulls Crypto-Paycheck Stunt Hours Before Bitcoin Crash\n Dave Chappelle and the Black Ass Lie? That Keeps Us Down\n Trump's January 6 Cover-Up Is Unraveling Fast\n Florida Man Has Growing God Complex\n In 2024, Mike Pence Is Gearing Up to Go Rogue\n New York Attorney General to Trump, Ivanka, and Don Jr.: Don't F--k With Us\n Inside This Cable News Giant's Streaming Dreams\n From the Archive: It Came From Wasilla\n Not a subscriber?",
    "The particularly problematic issue here? is the way this actually changes how the mainstream responds to what occurred on that day.?\nThis latest test of Trump's hold over the party comes at a time when such allegiances are already being challenged, as reflected in new polling, infighting over endorsements, and a vaccine stance more extreme than even Trump's own anti-science movement, The New York Times reports.",
    "There are other groups with causes that may want to go down the violent path if these people get pardoned.?\nGraham was among the slew of Trump-aligned Republicans who went from openly condemning the insurrection, and Trump's role in it, to increasingly downplaying the violence.",
    "That Graham went so far as to say he didn't want to enable another insurrection apparently came much to the dismay of Georgia Rep. Marjorie Taylor Greene, a far-right conspiracy theorist who later on Sunday bashed the senator for pretending to be a friend? to Trump.",
    "Those GOP lawmakers who have spoken up denounced the idea of undoing legal consequences for people charged in connection with the deadly January 6 insurrection, a pro-Trump attack that had many gathered for that day's joint session fearing for their lives.",
    "Former President Donald Trump's suggestion over the weekend that he would pardon insurrectionists if reelected was seemingly a bridge too far for at least some members of his own partythough as of early Monday afternoon, many had yet to say anything.",
    "Does this actually change the baseline position of the Republican party to be, Yes, let's have these people walk free,' because Donald Trump has now raised this as an issue and sort of shifted the Overton window?? Bump said on CNN's Reliable Sources.",
    "His Republican colleague Lindsey Graham also publicly disagreed with Trump's pardon suggestion, calling it inappropriate,? with the potential to make such violence more likely? going forward.",
    "Things feel like they've been shifting,? Patrick Ruffini, a Republican pollster who regularly takes the pulse of where Trump stands in the GOP, told the paper.",
    "Oh my goodness, no,? New Hampshire governor Chris Sununu said when asked by CNN's Dana Bash whether January 6 defendants should be pardoned.",
    "Only seven GOP senatorsa list that did not include Grahamvoted to convict Trump for inciting the attack in his second impeachment trial.",
    "But is it the same ironclad, monolithic, Soviet-like attachment that we saw when Donald Trump was the incumbent president?",
    "I don't want to send any signal that it was OK to defile the Capitol,? the South Carolina senator told CBS News Sunday.",
    "The folks that were part of the riots and, frankly, the assault on the US Capitol, have to be held accountable.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "It's one that very likely would win a Republican primary today.",
    "There is a rule of law,? Sununu told the outlet.",
    "It's a strong attachment.",
    "Of course not."
  ]
}