{
  "id": 726,
  "mediaId": 19,
  "date": "1/29/2022 12:00:00 AM",
  "headline": "Report: Scooter' Libby, Pardoned by Trump, to Attend Liz Cheney Fundraiser",
  "image": "https://media.breitbart.com/media/2018/04/scooter-libby-Pablo-Martinez-MonsivaisAP-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/01/29/scooter-libby-pardoned-by-trump-to-attend-liz-cheney-fundraiser/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joel B. Pollak",
  "authorUrl": "https://www.breitbart.com/author/joel-b-pollak/",
  "termIds": [
    945,
    945,
    643,
    643,
    730,
    730,
    1147,
    1248,
    1147,
    1102,
    1102,
    1078,
    1078,
    1248,
    1748,
    1748,
    1892,
    1892,
    2465,
    2465
  ],
  "sentences": [
    "\nOther guests include former Vice President Dick Cheney and his wife; former chief of staff to Cheney Scooter Libby; former U.S. solicitor general Ted Olson; former chief of staff to the late Sen. Bob Dole (R-Kan.) Sheila Burke; and former Rep. Barbara Comstock (R-Va.), among others.",
    "Now, both the former vice president and his aide are both participating in a fundraiser for Cheney, who defied her own party to participate in the one-sided January 6 committee, which aims to damage Trump ahead of the 2022 and 2024 elections.",
    "Ironically, Dick Cheney believed that Libby had been the victim of an overzealous prosecutor, a biased Washington jury, and those in the government who wanted to damage the Bush administration because of growing opposition to the Iraq War.",
    "I. Lewis Scooter? Libby, former chief of staff to Vice President Richard Cheney, is reportedly planning to attend a fundraiser in March for embattled Rep. Liz Cheney (R-WY), who is targeting Trump on the January 6 Committee.",
    "The conviction was widely viewed as a miscarriage of justice, especially because Deputy Secretary of State Richard Armitage later admitted that he was the likely source of the leak, not Libby.",
    "in March as the Wyoming incumbent looks to protect her seat against Trump-endorsed Republican primary challenger Harriet Hageman, according to an invitation obtained by The Hill.",
    "Joel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m.",
    "President George W. Bush commuted Libby's sentence, but despite the urging of then-Vice President Cheney, he declined to issue a formal pardon for his aide.",
    "Libby was convicted in 2007 of obstruction of justice and other crimes related to a leak of the identity of CIA agent Valerie Plame Wilson.",
    "It was only Trump who pardoned Libby in 2018, taking the political heat for doing so and standing up for Libby's record of public service.",
    "The Hill reported Wednesday (emphasis added):\nSen. Mitt Romney (R-Utah) is participating in a fundraiser for Rep. Liz Cheney (R-Wyo.)",
    "His recent book, RED NOVEMBER, tells the story of the 2020 Democratic presidential primary from a conservative perspective.",
    "Former Vice President Cheney called Trump personally to thank him for pardoning his long-time aide.",
    "He is the author of the recent e-book, Neither Free nor Fair: The 2020 U.S. Presidential Election.",
    "He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship.",
    "Follow him on Twitter at @joelpollak.",
    "ET (4 p.m. to 7 p.m. PT)."
  ]
}