{
  "id": 734,
  "mediaId": 558,
  "date": "1/26/2022 12:00:00 AM",
  "headline": "Romney, other Trump critics to raise money for Liz Cheney re-election effort",
  "image": "https://s.yimg.com/uu/api/res/1.2/DcHrvuQoCSwtESVPBVZmbA--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/hd/cp-video-transcode/prod/2022-01/07/61d855b6cec8b12ed2ce0001/61d855b6cec8b12ed2ce0002_o_U_v2.jpg",
  "link": "https://ph.news.yahoo.com/romney-other-trump-critics-raise-171942193.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    746,
    945,
    1046,
    1147,
    1248,
    1255,
    2110,
    2465,
    3085,
    3094,
    428,
    562
  ],
  "sentences": [
    "In addition to Romney, the list of attendees is comprised of an array of establishment Republican figures and Trump critics, including former congresswoman Barbara Comstock, former Homeland Security Secretary Michael Chertoff, lobbyist Charlie Black, and former Vice President Dick Cheney, Cheney's father.",
    "Cheney has been the target of Trump's ire and sidelined by most Republicans after voting in January to impeach Trump on a charge that he incited an insurrection at the U.S. Capitol on Jan. 6, and helping lead an ongoing congressional committee investigating the attack.",
    "Senator Mitt Romney, a leading Republican critic of former President Donald Trump, will help raise money for Representative Liz Cheney, who is fighting for political survival after voting to impeach Trump and contesting his false stolen-election claims.",
    "Romney is the featured guest at a March 14 fundraiser for Cheney at the home of Bobbie Kilberg, a well-connected Virginia Republican who lined up against Trump during his 2016 bid for the White House, according to an invitation seen by Reuters.",
    "The race, which will almost certainly determine the general election winner in the deeply conservative state, is widely seen as a proxy for the former president's grip over the Republican Party.",
    "The event comes as Cheney gears up for a tough primary battle for Wyoming's only congressional district in August against a lawyer, Harriet Hageman, endorsed by Trump.",
    "Billionaire Peter Thiel and Donald Trump Jr. were scheduled to co-host a pair of fundraisers for Hageman on Wednesday, Politico reported last month.",
    "Over the weekend, Cheney won only six votes in a straw poll conducted by the Wyoming Republican State Central Committee, with Hageman securing 59.",
    "But she faces a challenge for survival in Wyoming, where the activist base of her own party has moved against her.",
    "Last year Republicans voted to remove Cheney from her leadership position in the U.S. House of Representatives.",
    "Cheney is not in financial trouble, having ended September with more than $3.6 million in the bank.",
    "(Reporting by Nathan Layne in Wilton, Connecticut; editing by Jonathan Oatis)",
    "Hageman had roughly $245,000 in the bank as of September.",
    "(Reuters) - U.S."
  ]
}