{
  "id": 738,
  "mediaId": 195,
  "date": "1/24/2022 12:00:00 AM",
  "headline": "Cheney hits Gingrich for saying Jan. 6 panel members may be jailed",
  "image": "https://cdn.jwplayer.com/v2/media/gNebbvM4/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/house/591007-cheney-hits-gingrich-for-saying-jan-6-panel-members-may-be-jailed",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dominick Mastrangelo",
  "authorUrl": "https://thehill.com/author/dominick-mastrangelo",
  "termIds": [
    1101,
    1147,
    1248,
    3094,
    146,
    200,
    428,
    545,
    571
  ],
  "sentences": [
    "Gingrich, who has reportedly been advising Republican leadership over the last several months, predicted during an appearance on Fox News on Sunday that the GOP will regain control of Congress after this year's midterm elections and will avenge what leading Republicans have said is a partisan investigation led by Cheney and Democrats.",
    "Over the last several months, the committee has been working to investigate what led to the Jan. 6 attack and has spoken with several members of Trump's inner circle as members seek more information on the president's effort to cast doubt on the result of the 2020 presidential election.",
    "slammed former Republican Speaker Newt Gingrich after he suggested that members of the select congressional committee investigating the Jan. 6, 2021 attack on the U.S. Capitol by supporters of former President Trump may be jailed for their work.",
    "And all of these people who have been so tough and so mean and so nasty are going to be delivered subpoenas,\" Gingrich said, adding the lawmakers heading up the commission are \"just running over the law.\"",
    "\"A former Speaker of the House is threatening jail time for members of Congress who are investigating the violent January 6 attack on our Capitol and our Constitution,\" Cheney said in a tweet on Sunday.",
    "\"And the wolves are going to find out they are now sheep and they're the ones who are going to face a real risk of, I think, jail for the kind of laws they're breaking.\"",
    "After the attack on the Capitol, Cheney emerged as a leading critic of Trump and those in her party who remain loyal to him.",
    "\"And I think when you have a Republican Congress, this is all going to come crashing down,\" he continued.",
    "\"You're going to have a Republican majority in the House and a Republican majority in the Senate.",
    "Cheney, a leading member of the commission, later blasted Gingrich over the remarks.",
    "Cheney and Rep. Adam Kinzinger (R-Ill.) are the only Republicans on the panel.",
    "Cheney is facing a Republican primary challenger in Wyoming backed by Trump",
    "\"This is what it looks like when the rule of law unravels.\"",
    "Kinzinger has announced he will not seek reelection.",
    "Rep. Liz Cheney (R-Wy.)"
  ]
}