{
  "id": 746,
  "mediaId": 238,
  "date": "1/22/2022 12:00:00 AM",
  "headline": "Arizona Democratic Party votes to censure Sinema, citing filibuster vote",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/01/22/arizona-democrats-censure-sinema/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2505,
    2505,
    2349,
    2349,
    958,
    958,
    1248,
    1248,
    1284,
    1284,
    571,
    571,
    146,
    146,
    33,
    33,
    2550,
    2550
  ],
  "sentences": [
    "While the reprimand has no practical consequences, it reflects the growing estrangement between the first-term senator and her fellow Democrats, who have been angered by her willingness to help stymie the party's agenda on issues such as the minimum wage and voting rights.",
    "While we take no pleasure in this announcement, the ADP Executive Board has decided to formally censure Sen. Sinema as a result of her failure to do whatever it takes to ensure the health of our democracy,? Tern said in a statement.",
    "Cheney voted to impeach Trump on a charge of inciting an insurrection after the storming of the Capitol on Jan. 6; the three GOP senators joined Democrats in voting to convict him after the Senate trial last February.",
    "The central committee of the Arizona Democratic Party voted on Saturday to censure Sen. Kyrsten Sinema, a symbolic rebuke that follows her decision to buck her party's leadership on an effort to scrap the filibuster.",
    "State party chair Raquel Tern said Saturday's censure vote, which was taken behind closed doors, was a direct consequence of Sinema's unwillingness to endorse Senate rule changes to pass voting rights legislation.",
    "Sinema had said on Wednesday that although she backed the Democrats' voting rights bills, she feared that eliminating the Senate's 60-vote requirement for major legislation would add to the country's divisions.",
    "Sinema, who in 2018 became the first Democrat to win a U.S. Senate seat in Arizona in a generation, has emerged as a major force in Washington by leveraging her status as a swing vote in a 50-50 Senate.",
    "Sinema, who does not face reelection until 2024, could face a primary challenge from Rep. Ruben Gallego, who told CNN this week that he had been encouraged to run by other Senate Democrats.",
    "With Sinema and Sen. Joe Manchin III (D-W.Va.) joining Republicans in opposition to filibuster changes, Democrats' immediate hopes of passing voting rights legislation were dashed.",
    "During three terms in the U.S. House, and now in the Senate, Kyrsten has always promised Arizonans she would be an independent voice for the state  not for either political party.",
    "She's delivered for Arizonans and has always been honest about where she stands,? Sinema spokesperson Hannah Hurley said in a statement after Saturday's Democratic Party vote.",
    "Doug Ducey, former senator Jeff Flake and Cindy McCain, the late senator John McCain's widow, for showing insufficient loyalty to former president Donald Trump.",
    "Arizona's other Senate seat is held by Mark Kelly (D), who had wavered on the filibuster but ultimately backed scrapping it to pass the voting rights bills.",
    "But what Sinema has touted as independence has been decried as unprincipled opportunism by a growing chorus of left-leaning groups and individuals.",
    "She has repeatedly described her stance as an independent one that she has said reflects the political mood in her closely divided state.",
    "He is up for reelection in November, and his seat is expected to be among the most competitive in the nation.",
    "The senator's move, she said, crossed a red line at a time when voting rights are under attack.",
    "Saturday's censure comes a year after the Arizona Republican Party censured Gov.",
    "Richard Burr (N.C.), Lisa Murkowski (Alaska) and Bill Cassidy (La.",
    " have also been punished by their state parties for defying Trump.",
    "Other Republicans in Congress  including Sens.",
    "), and Rep. Liz Cheney (Wyo.)"
  ]
}