{
  "id": 748,
  "mediaId": 19,
  "date": "1/22/2022 12:00:00 AM",
  "headline": "Poll: Donald Trump Sees 40-Point Lead in Hypothetical GOP Primary",
  "image": "https://media.breitbart.com/media/2020/10/Trump-Michigan-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/01/22/poll-donald-trump-sees-40-point-lead-in-hypothetical-gop-primary/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    2409,
    2409,
    2250,
    2250,
    2465,
    2465,
    661,
    661,
    1248,
    1248,
    1434,
    1434,
    1147,
    1147,
    1053,
    1053,
    428,
    428
  ],
  "sentences": [
    "Kristi Noem, and Rep. Liz Cheney (R-WY) saw two percent support or less:\nGOP Presidential Polling:\nTrump: 53%\nDeSantis: 13%\nPence: 9%\nHaley: 4%\nRomney: 3%\nOwens: 2%\nRubio: 2%\nMcLaughlin / January 18, 2022 / n=468 / Onlinehttps://t.co/OnEooPIlLn\n Polling USA (@USA_Polling) January 19, 2022\nThe field shakes up rather significantly, though, when Trump is taken out of the mix and replaced with his son, Donald Trump Jr.",
    "It is not a coincidence that this fabricated media narrative emerged during perhaps the worst week of Biden's presidency, as it became clear last week that Biden would not be able to deliver on Build Back Better, enact sweeping legislation to federalize elections, or shut down the virus' as he had promised during his campaign when he was demagoguing President Trump over COVID,? Pushaw added.",
    "Thinking ahead to the 2024 Republican primary election for President, if that election were held today among the following candidates, for whom would you vote?? the survey, taken January 13-18, asked Republican voters.",
    "Former Vice President Mike Pence came in third with nine percent support, followed by former U.S. ambassador to the U.N. Nikki Haley with four percent and Utah Sen. Mitt Romney (R-UT) with three percent.",
    "Former President Donald Trump continues to lead the field of potential Republican presidential candidates in a hypothetical GOP primary, a McLaughlin & Associates survey released this week found.",
    "The survey follows establishment media rumors of infighting between Trump and DeSantis, both of whom consistently lead the pack in surveys examining the potential GOP primary for 2024.",
    "All these anonymously sourced and baseless stories were merely attempts by corporate media activists to distract from Biden administration failures,? she continued.",
    "Every remaining candidate, which included Sen. Ted Cruz (R-TX), Sen. Marco Rubio (R-FL), Sen. Tim Scott (R-SC), former Secretary of State Mike Pompeo, Texas Gov.",
    "DeSantis has always said that media narratives cannot get in the way of their friendship,? DeSantis's press secretary, Christina Pushaw, told Breitbart News.",
    "As the governor said when asked about the rumors last week, This is what the media does.' And, as President Trump mentioned last night on Hannity, Gov.",
    "On Thursday, Trump dismissed the reports as totally fake news,? and DeSantis's office confirmed that to Breitbart News as well on Friday morning.",
    "In that scenario, DeSantis leads with 26 percent support, followed by Donald Trump Jr. with 18 percent support and Pence with 12 percent support.",
    "Ron DeSantis (R) is the only potential candidate listed who garnered double-digit support, seeing 13 percent support.",
    "The survey showed Trump continuing to lead the potential field by double-digits, with majority support of 53 percent.",
    "Both Trump and DeSantis, however, have denied those reports of tension.",
    "In that scenario, no other candidate garnered double digit support.",
    "No other candidate came close.",
    "Greg Abbott, South Dakota Gov.",
    "Florida Gov."
  ]
}