{
  "id": 749,
  "mediaId": 33,
  "date": "1/21/2022 12:00:00 AM",
  "headline": "Kevin McCarthy's path to speakership enters final but treacherous leg",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/210715143010-trump-mccarthy-split-medium-plus-169.jpg",
  "link": "https://www.cnn.com/2022/01/21/politics/kevin-mccarthy-speaker-gop-conference/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Warren and Melanie Zanona",
  "authorUrl": "",
  "termIds": [
    3094
  ],
  "sentences": [
    "But maintaining support across the conference also requires McCarthy to placate the smaller and less vocal wing of moderates and institutionalists, who have sometimes privately expressed frustration with McCarthy's deference to the party's hardliners and warned that trying to please too many different people can backfire.",
    "He must balance the desires of a populist and emboldened right-flank with the needs of moderate and swing-district Republicans to build a majority coalition -- an increasingly tough task, as exemplified by the recent retirement announcement of centrist Rep. John Katko of New York.",
    "Despite countless controversies with the group's most extreme members using violent or bigoted language, frequently toward their own colleagues, McCarthy has largely resisted calls from both inside and outside the conference to exert discipline on Freedom Caucus members.",
    "Weber recalled how he was in the car with McCarthy when the GOP leader got into a heated phone call with House Majority Leader Steny Hoyer over Greene's committee assignments, and threatened to return the fire on Democrats if he's in charge of the House next Congress.",
    "The shift in the balance of power within the House GOP conference -- from institutionalists like John Boehner to conservative rabble-rousers like Jim Jordan -- is reflected in McCarthy's own evolution from young establishment Republican to dedicated Trump ally.",
    "It all goes to illustrate the narrow path McCarthy is walking as he strives to knit together the warring factions of the GOP in his quest to win back the majority, and with it, the coveted speaker's gavel -- a mission that has been years in the making.",
    "But McCarthy was an ambitious strategist, too, and it showed after he was elected to Congress and teamed up with Reps. Eric Cantor of Virginia, then the chief majority whip, and Paul Ryan of Wisconsin, the ranking GOP member on the Budget Committee.",
    "Appeasing his right wing could run hard up against McCarthy's other mission for 2022: keeping the \"majority makers\" in swing districts happy and putting moderate incumbents and candidates in position to win in districts where Trump is not popular.",
    "Instead of ex-communicating Jordan into the political wilderness, where McCarthy would have less control over him, McCarthy made a strategic decision to push the Ohio Republican for a coveted top spot on the House Oversight and Reform Committee.",
    "Frequently, that has meant acceding to the influence of the Freedom Caucus, the far-right faction of around 44 pro-Trump Republicans that includes Reps. Paul Gosar of Arizona, Lauren Boebert of Colorado and Marjorie Taylor Greene of Georgia.",
    "Even if the GOP leader is not subpoenaed, any details in the final report from the committee on McCarthy's conversations with Trump could be damaging and distracting as the party tries to make its case against Biden in the midterm elections.",
    "But despite McCarthy's defense of Greene, in November, she joined Rep. Matt Gaetz's podcast to say that McCarthy did not have \"the full support to be speaker\" and started laying out a list of demands in exchange for her vote for speaker.",
    "Hurdles on the track to becoming speaker\nAs House Republicans have become more conservative, more populist and more committed to Trump's vision for the party, McCarthy's leadership has reflected the shifting priorities of the conference.",
    "Greene, for instance, spent much of her first year in office making incendiary statements and engaging in conspiracy theories, not stopping even after the Democratic majority voted to strip her of her committee assignments in February.",
    "Further driving home his point was an edgy warning that the House GOP steering committee -- which determines committee assignments -- will take into consideration those fomenting internal dissent and attacking their fellow Republicans.",
    "And while no one has said they would challenge McCarthy for speaker -- and few in the conference believe anyone could pose a serious threat -- there is no shortage of ambitious politicians waiting in the wings should McCarthy stumble.",
    "\"He said, 'If any of you come to me and tell me that you're not going to vote for me unless I do something, I'm going to do exactly the opposite, even if I agree with you,'\" said Rep. Tom Cole of Oklahoma, who was there at the time.",
    "What has remained consistent is McCarthy's willingness to be what House Republicans want him to be -- one of his greatest strengths, yet a trait that could also prove to be a weakness threatening his ascent to the speaker's podium.",
    "McCarthy also opposed the bipartisan commission on January 6 even though he had deputized Katko to strike a deal on the proposal, which surprised and upset the New York Republican, according to sources familiar with his thinking.",
    "Hanging over all of McCarthy's moves is former President Donald Trump, the undisputed leader of the Republican Party to whom much of the House conference remains fiercely devoted and whose opinions of people can turn on a dime.",
    "The House Republican leader cast off his typically sunny demeanor during a December 8 meeting of the GOP conference to deliver a stern warning to his most raucous members: Quit trying to hold your vote for speaker over my head.",
    "Ousting the Wyoming Republican pleased the Freedom Caucus, but his decision to back as her successor Rep. Elise Stefanik of New York, once an ideological moderate, typified why many on the right remain suspicious of McCarthy.",
    "\"The inmates are running the asylum now, and he just constantly looks scared,\" said one former House Republican leadership aide, echoing the views of multiple former top aides familiar with the dynamics of the GOP conference.",
    "But others in the conference have instead sought to test the boundaries of what McCarthy will accept from his members, leaving him with the difficult task of keeping his troops in line while staying in their good graces.",
    "From those conversations, a picture emerges of McCarthy as a hard-working political animal, dedicated to the members he oversees but sometimes struggling to lead a vocal right wing that has grown increasingly extreme.",
    "One example that critics point to is how McCarthy -- once a champion for Silicon Valley -- has made battling major tech firms a top priority if Republicans win the House, echoing a prominent rallying cry on the right.",
    "Mark Bednar, a spokesman for McCarthy, told CNN the leader hasn't changed but that Big Tech firms need real accountability for \"deplatforming conservatives and censoring ideas the left and media didn't agree with.\"",
    "Rep. Jim Banks of Indiana, the head of the conservative Republican Study Committee who is said to have future leadership ambitions, recently came out in support of removing Cheney and Kinzinger from the conference.",
    "But his vote to impeach Trump last year, plus his work to find a compromise on investigating January 6 and his vote for the White House's infrastructure bill, drew the ire of Trump and the conference's right wing.",
    "The balancing act has put him in difficult positions, leading him in May to withdraw his support from the anti-Trump Rep. Liz Cheney as conference chairwoman just months after reasserting his confidence in her.",
    "People familiar with the dynamics of the House GOP conference say McCarthy derives much of his own power from staying in the favor of the Freedom Caucus and its founder and spiritual leader, Jim Jordan.",
    "As they have done for years, the Freedom Caucus' members stir up confrontation with outrageous rhetoric designed more for driving engagement online and in cable news than for any legislative purpose.",
    "The eight-term California Republican built a reputation in House leadership not as an arm-twister or dictator but as a friendly backslapper increasingly tolerant of his party's most hardline members.",
    "It was in this strategic role that McCarthy emerged as an early champion of a novel idea for regular Republicans -- co-opting the burgeoning tea party movement and bringing them under the GOP tent.",
    "Stutzman remembers running into McCarthy in an airport lounge in Denver not long after Barack Obama was first elected to the White House and the Republican Party was at its lowest point in decades.",
    "McCarthy was able to quell those calls for now, asking the group to hold off on their effort so the GOP doesn't distract from its messaging around the one-year anniversary of Biden's inauguration.",
    "The 56-year-old is perhaps closer than ever to fulfilling his lifelong dream, armed with a massive war chest, a favorable political environment and valuable lessons from his previous missteps.",
    "He recognized the movement's political power and how its followers' supposed commitment to reining in government spending dovetailed with the vision he and the Young Guns had for the GOP.",
    "But after Kinzinger voted to impeach Trump and agreed to serve on the select committee investigating the Capitol riot, McCarthy now derides the Illinois lawmaker as a \"Pelosi Republican.\"",
    "Rep. Dave Joyce, a moderate Ohio Republican, said McCarthy made for a \"sh*tty\" whip when he served in the House majority because he was too \"nice\" to always play the role of enforcer.",
    "As the midterms approach, McCarthy will face pressure not just to curb the infighting but to cave to the right wing's demands for a harder line should Republicans win a majority.",
    "Greene, Gaetz and their cohorts in the conference have been pushing for a GOP majority to commit to investigating the 2020 election and launch impeaching proceedings into Biden.",
    "The day after Greene's Thanksgiving appearance on Gaetz's show last fall, McCarthy called up the Georgia congresswoman in part to smooth things over but also to rein her in.",
    "The strategy has helped bring McCarthy and his Republicans just a handful of seats shy of the majority, in a conference that he can legitimately claim to have built himself.",
    "\"He's very congenial and tries to take in everybody's opinions and ideas to come to consensus, and I think that's good leadership,\" said Rep. Vicky Hartzler of Missouri.",
    "Now, with less than a year before the 2022 elections and the expectation that Republicans could win back the House, McCarthy is feeling the heat and laying down the law.",
    "Following her own meeting with McCarthy, Mace had this to say when asked about Greene's threat: \"All I can say about Marjorie Taylor Greene is bless her f***ing heart.\"",
    "McCarthy's role in the group -- the \"Young Guns,\" as people started calling them -- was to focus on recruiting candidates and expanding the map of winnable seats.",
    "And he must parry with the House select committee investigating the January 6 attack, which just last week requested to speak with McCarthy about his knowledge.",
    "A second example is how McCarthy went from condemning Trump for being responsible for the January 6 riot to cozying up with the former President weeks later.",
    "\"He spent the evenings in Sacramento socializing with his members,\" said Rob Stutzman, a Republican political strategist who was a top aide to then-Gov.",
    "Her statement echoed sentiments from Freedom Caucus members in 2015 who helped sink McCarthy's previous bid for speaker following Boehner's resignation.",
    "Even as minority leader in the California State Assembly back in the early 2000s, the Bakersfield native was known for his popularity with colleagues.",
    "CNN spoke with more than two dozen Republicans, including current and former House members, Capitol Hill aides and political figures from California.",
    "\"There are an overwhelming majority of the members of the conference who have constituents that are very loyal and look to Donald Trump as a leader.\"",
    "\"He's got folder after folder of districts that he thinks can be pickups, and he's already out looking for candidates to run,\" Stutzman said.",
    "\"He brought in that energy, he brought in that creativity, he brought in that willingness to say, 'Hey, let's start something,'\" Cantor said.",
    "But their loud megaphones within conservative media and their support, both implicit and explicit, from Trump give them a significant sway.",
    "\"And part of the reason he's not gone after the Taylor Greenes and the Boeberts and the Gosars is because he's concerned about his flank.\"",
    "\"I think he's been careful to court the right of his conference,\" said Charlie Dent, a former Republican congressman from Pennsylvania.",
    "Despite being next in line, McCarthy quickly discovered he did not have enough support from the conference's most conservative members.",
    "In fact, a standoff with the committee could strengthen McCarthy's position within the conference and, just as importantly, with Trump.",
    "But he also objected to Greene's removal from committees and has promised to restore her assignments if Republicans win the majority.",
    "But to critics, McCarthy seems more like a weathervane, shifting with his most vocal members and operating without a core philosophy.",
    "McCarthy declined to heed conservative calls to boot Katko from his top committee spot, but he didn't vocally defend Katko, either.",
    "The encroachment of the January 6 committee on McCarthy raises even more potential problems for him on his journey to be speaker.",
    "McCarthy has condemned Greene's most outrageous comments, including her comparison of the House's masking rules to Nazi Germany.",
    "And in another sign of his evolving attitudes, McCarthy once praised Rep. Adam Kinzinger of Illinois as the future of the party.",
    "\"He shifted from friendly mode to 'stop f***ing around and hurting the conference' mode,\" said the second GOP House member.",
    "Nearly 85% of sitting House Republicans came into Congress after McCarthy, and many of those were recruited to run by him.",
    "There are also persistent calls from that wing to boot anti-Trump Republicans Cheney and Kinzinger from the conference.",
    "Days later, Greene and Rep. Nancy Mace of South Carolina engaged in a high-profile and personal spat over social media.",
    "\"I think he's much better at where he's at now, being able to be Big Picture, get people to consensus,\" Joyce said.",
    "So McCarthy is getting serious, starting, for anyone who had previously missed it, with that pre-Christmas meeting.",
    "The tea party element McCarthy coopted has now evolved into a powerful and contrary faction within his conference.",
    "This time, McCarthy hauled each congresswoman in his office for separate meetings to tell them each to \"stop it.\"",
    "Hailing from a Democratic-leaning district around Syracuse, Katko had defied expectations for several elections.",
    "But McCarthy's swift dismissal of the committee's interest reveals how he sees no advantages in cooperating.",
    "\"He didn't have a whole lot of choices there,\" said Mullin, recalling McCarthy's handling of the situation.",
    "After her meeting, Greene told CNN that both she and Trump may back a primary challenge to Mace in 2022.",
    "But the final leg of McCarthy's journey to the pinnacle of power could prove to be the most treacherous.",
    "\"I think if you remember what Kevin's job is, it's to lead the members in the conference,\" said Cantor.",
    "\"\nWhen asked whether he thought the risky move paid off for McCarthy, Joyce didn't hesitate: \"Oh yes.",
    "In fact, he gets beat up a lot,\" said Rep. Randy Weber of Texas, a member of the Freedom Caucus.",
    "\"Nobody didn't like Kevin,\" said Jim Brulte, the former Republican leader in the state senate.",
    "Allies praise him as a consensus-builder with a keen awareness for where the team wants to go.",
    "\"His attention to detail of building a personal relationship is really quite exceptional.\"",
    "He must ensure Republican infighting doesn't distract from a struggling Biden presidency.",
    "\"I don't know if there is such a thing as a win or a right solution in that circumstance.",
    "\"There's some concessions you have to make up here, that's just the nature of the beast.",
    "That's generated a great deal of personal loyalty to McCarthy among the rank-and-file.",
    "A second Republican member told CNN McCarthy punctuated his threat with, \"I mean it.\"",
    "And that is partly what brings the would-be speaker to his current set of challenges.",
    "\"Kevin is someone who leads by understanding the needs of his members,\" Cantor added.",
    "\"The key to being a successful leader is understanding the fabric of the conference.\"",
    "He withdrew at the last minute, paving the way for Ryan to ascend to the speakership.",
    "He was tireless even when his peers were feeling down, as friends recall it.",
    "\"He'll know your dog's name, your kids name, their birthday,\" Cole said.",
    "\"I'd take a bullet for the guy,\" said Rep. Markwayne Mullin of Oklahoma.",
    "Jordan unsuccessfully challenged McCarthy in 2018 for minority leader.",
    "Yet just as quickly as McCarthy put one fire out, another emerged.",
    "McCarthy has been preparing for this moment for quite some time.",
    "In the meantime, McCarthy risks being outflanked on the issue.",
    "\"He does a tremendous job of bringing everybody to the table.\"",
    "He has been a dogged fundraiser for members across the party.",
    "And he handled it the best way that the conference needed.\"",
    "\"I said to (McCarthy), 'I've never heard you cuss before.",
    "\"When picking Jim for Oversight, I thought he was crazy.",
    "Katko's retirement typifies the struggle McCarthy faces.",
    "But the episode also taught McCarthy a valuable lesson.",
    "It worked, at least in terms of statistical analysis.",
    "But the issue is almost certain to bubble back up.",
    "McCarthy's tough talk has taken some by surprise.",
    "(CNN)Kevin McCarthy was done being nice.",
    "(McCarthy quickly and publicly refused.)",
    "Jim has been a tremendous team player.\"",
    "\"He gets beat up from time to time.",
    "The talking-to didn't seem to work.",
    "\"But he said, 'Bring people in.'",
    "I told him that,\" Joyce said.",
    "What took you so long?'",
    "Arnold Schwarzenegger.",
    "I'm disappointed.",
    "It's not easy.\"",
    "\" Weber said."
  ]
}