{
  "id": 757,
  "mediaId": 165,
  "date": "1/18/2022 12:00:00 AM",
  "headline": "Dan Crenshaw Withers Under Questioning From Young Woman, Gets Booed at Conservative Event",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/01/dan-crenshaw-booed-1.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-news/dan-crenshaw-booed-tea-party-event-1286796/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Bort",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Regardless, we have a young woman asking a gotcha question based on a dumb podcast quote, a member of Congress angrily defending himself instead of patiently and easily explaining the context of his words, the member of Congress getting booed by an audience of Tea Party Republicans, and a hard-right conservative PAC operative sharing a video of the encounter in order to shame Crenshaw for not being sufficiently right wing.",
    "The video of the confrontation was shared by Scott T. Parkinson, the VP of Government Affairs for Club4Growth, a conservative PAC that recently endorsed Illinois Rep. Mary Miller, who achieved brief online prominence after she said Hitler was right about one thing? during a speech the day before the Jan. 6 insurrection.",
    "Real characters too, you know, I could name a thousand,? which the questioner (again, a young woman) interpreted as Crenshaw saying Jesus was not a real character? (The Week points out that this argument appears to be drawn from right-wing pop psychologist Jordan Peterson's work, adding to the game of Mad Libs).",
    "Dan Crenshaw, the acerbic congressman from Texas desperately trying to brand himself as an unnatural chimera of Donald Trump and John McCain, is in hot water today for a video recorded at a Montgomery County Tea Party fundraiser in which he snaps at a young woman for asking him a pointed question about Jesus.",
    "The first part of the question is inaudible, but Newsweek reports that Parkinson's video picks up right after the woman claims Crenshaw lied about being Christian.?\nI can't wrap my head around this,? the woman says after reading Crenshaw's quote about Jesus and hero archetypes back to him.",
    "Taken together, the episode is a perfect look at how the far right eats its own, chewing up candidates for perceived slights and spitting them out further right  which will surely happen with Crenshaw  or out of the party's graces altogether, like it did with Liz Cheney.",
    "Parkinson's reasoning for committing GOP-on-GOP violence on Crenshaw probably stems from the Texas lawmaker's recent online flame-war with Marjorie Taylor Greene, though it's tough to say why any of these people do what they do.",
    "Crenshaw was confronted at a Tea Party fundraiser by a young woman questioner, who challenged him to defend statements that he made likening Jesus to a fictional superhero while on former Navy SEAL Jocko Willink's podcast.",
    "If the modern GOP is a place too hostile even for the daughter of Dick Cheney, it's pretty clear it's going to hammer any dreams of John McCain-centrist-maverick behavior out of Crenshaw as soon as possible.",
    "Don't question my faith, don't question my faith,? Crenshaw says again, to more boos, and, at the end, a confusing chant of Let's Go Brandon,? just to round out the fever swamp bingo card.",
    "Anyway, the woman asked Crenshaw to defend a quote he gave to The Jocko podcast: The important thing is that we have societal hero archetypes that we look up to,? Crenshaw said.",
    "pic.twitter.com/YJyLdUhTke\nThe identity of the young woman is unclear, but Jameson Ellis, a Republican attempting to primary Crenshaw, tweeted that she is 18 years old.",
    "The entire setting and context for the exchange is like a Mad Libs of terms to bubble out of the right-wing fever swamp.",
    "Put a period after Jesus,' and don't question my faith.?\nThe crowd then erupts in a chorus of wows? and boos.",
    "I don't think Dan Crenshaw is gonna raise a lot of money off *this* video.",
    "It's a pity that won't make him any less annoying.",
    "I'll help you,? Crenshaw snaps.",
    "Superman is a hero archetype.",
    "Jesus is a hero archetype."
  ]
}