{
  "id": 758,
  "mediaId": 237,
  "date": "1/18/2022 12:00:00 AM",
  "headline": "Republicans need Dan Crenshaw",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/942506.png",
  "link": "https://www.washingtonexaminer.com/opinion/republicans-need-dan-crenshaw",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Moshe Hill",
  "authorUrl": "https://www.washingtonexaminer.com/author/moshe-hill",
  "termIds": [
    1147,
    1248,
    1609,
    1614,
    2005,
    2010,
    2214,
    3094,
    122,
    146,
    184,
    204,
    255,
    259,
    428,
    562,
    2934
  ],
  "sentences": [
    "The latest controversy occurred when Crenshaw got into a social media fight with Rep. Marjorie Taylor Greene, a fan favorite of the harder edges of the GOP's MAGA wing, over COVID-19 testing.",
    "Crenshaw called his colleague \"a Democrat  or just an idiot\" when she rejected his proposal to use Federal Emergency Management Agency funding to bolster COVID-19 testing sites.",
    "He first earned the MAGA crowd's ire in January 2021 when he defended Rep. Liz Cheney, disliked by pro-Trump elements for her strident opposition to the former president.",
    "Perhaps most damaging, Crenshaw called out members of the House Freedom Caucus in December, referring to them as \"performance artists\" and \"grifters.\"",
    "He is definitely more centrist than the Freedom Caucus, and his voting record has a few blemishes, but his conservative resume is otherwise sound.",
    "But as Republicans look to restore control over Congress with the November midterm elections, conservatives should be wary of our own infighting.",
    "More importantly, Crenshaw has a national reputation and is ready, willing, and able to sound off publicly on important topics.",
    "Moshe Hill (@HillWithView) is a political columnist and senior fellow at Amariah, an America First Zionist organization.",
    "Conservatives are rejoicing that Democratic infighting is preventing the party's radical legislation from becoming law.",
    "The Texas Republican has seen his stock plummet in the hearts and minds of the pro-Trump wing of the Republican base.",
    "In another controversy, Illinois Senate candidate Bobby Piton got into a confrontation with Crenshaw at a fundraiser.",
    "In August, a video of Crenshaw denying the 2020 election was stolen from President Donald Trump went viral.",
    "Throwing away Republicans like Dan Crenshaw is a recipe to keep the party in the minority.",
    "These include men competing in women's sports, voter ID laws, and abortion-on-demand.",
    "Once seen as a Republican all-star, Crenshaw lost much of his luster in 2021.",
    "Crenshaw might be right, but much of the base didn't like his open tone.",
    "Crenshaw now faces three primary challengers in his 2022 reelection bid.",
    "Piton then used the exchange to bolster his own pro-Trump credentials.",
    "However, it's hard to argue Crenshaw is not a reliable conservative.",
    "Both wings of the party need each other, for better or worse.",
    "He can be followed on his blog and Facebook.",
    "Take Rep. Dan Crenshaw, for example."
  ]
}