{
  "id": 763,
  "mediaId": 195,
  "date": "1/17/2022 12:00:00 AM",
  "headline": "The Hill's Morning Report - Presented by Facebook - Democrats see victory in a voting rights defeat",
  "image": "https://thehill.com/sites/default/files/newsletter-open_011722ap.jpg",
  "link": "https://thehill.com/homenews/morning-report/589985-the-hills-morning-report",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger",
  "termIds": [
    1158,
    1916,
    1951,
    2087,
    2318,
    2411,
    3094,
    146,
    177
  ],
  "sentences": [
    "Five Democratic senators led by Sen. Jacky Rosen (Nev.) released a letter to the White House on Friday expressing grave concern? with the state of the pandemic response, arguing that it has often been reactive, rather than proactive.?\nThis Administration either knew or should have known that testing shortages were occurring across the country over the past several months, and with the full expectation that the virus would likely mutate into a new variant steps to increase testing access should have happened before the current wave hit, not several weeks into the surge, with resources still not available until later this month or beyond,? the senators wrote.",
    "Biden last week, acknowledging probable defeat, suggested advocates for voting rights won't quit in Congress before eventually enacting protections, much as they did when King and other leaders in the civil rights movement traveled to Capitol Hill and to the White House to strategize with allies, including former Presidents John F. Kennedy and Lyndon Johnson (pictured below), before Johnson got the chance to sign the 1965 Voting Rights Act into law.",
    "Treasury Secretary Janet Yellen will deliver pre-recorded remarks to the National Action Network's annual King Day breakfast at 8:30 a.m.\nMLK Jr. Day: Martin Luther King III and his family are scheduled at 9 a.m. to join a Washington, D.C., MLK Holiday Committee Peace Walk followed by a noon press conference at Union Station, including Speaker Nancy Pelosi (D-Calif.) and other House members.",
    "> U.S. officials, including tough negotiator Wendy Sherman, deputy secretary of State (The Hill), aspire to resolve Russia's aggressive stance toward Ukraine through diplomacy (The Hill), but intelligence assessments about a suspected Russian false flag plot (Axios and CNN) suggest increasing expectations in the West that Moscow will invade its neighbor within a month's time (CNBC).",
    "The GOP's opposition to a pair of bills, the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act, which Democratic leaders say they intend to put to the test on the Senate floor on Tuesday, is almost a sidebar to the attention paid to the second-guessing and discord within the majority party (The Hill).",
    "House Majority Whip James Clyburn, 81, a Democrat from South Carolina who marched for civil rights in the 1960s and considers this year's defense of voting rights akin to saving U.S. democracy from new conservative threats, insisted on Sunday that this week's Senate bills are on life support? but not dead (The Hill).",
    "As The Hill's Rebecca Beitsch and Scott Wong write, McCarthy  who is in line to become Speaker next year if Republicans retake the lower chamber  has little incentive to play ball, as any talks about his calls with Trump during and after the attack would anger the ex-president and only embolden his opponents.",
    "As The Hill's Jordain Carney points out, Sinema's speech effectively putting to bed any chances to create a filibuster exception in the name of voting rights reform earned her a direct response from Rep. Ruben Gallego (D-Ariz.), a favorite of the left who is considered a top primary challenger.",
    "On Martin Luther King Jr. Day today, President Biden and other Democratic leaders will use the chilly federal holiday to tie the civil rights movement 60 years ago to the Senate's doomed efforts this week to pass bills they argue would protect voting rights against threats posed by Republicans.",
    "ELSEWHERE\n? INTERNATIONAL: Dozens of computer systems linked to the Ukrainian government, agencies and organizations were infected with malware, which was disguised as ransomware but could infect computers and make them inoperable if activated by the attacker, according to Microsoft (The Hill).",
    " Hotels, fitness clubs, tour bus companies and minor league ball clubs are part of a long line of businesses seeking billions of dollars in new COVID-19 relief aid  if they can overcome opposition from many Republicans who say Congress has already done its part (The Wall Street Journal).",
    " A gargantuan volcanic eruption on Saturday near Tonga covered the island, which has 105,000 residents, in ash while contaminating fresh water and cutting off communications as tsunami waves spread across the Pacific through Hawaii and Japan all the way to California.",
    "Glenn Youngkin (R), the state's newly minted chief executive, who was elected on a platform of parental rights and an end to COVID-19 school mandates, immediately signed an executive order ending mask mandates for schools and vaccine mandates for state workers.",
    "Sinema's problems, however, have not trickled down to the state's other top Democrat, Sen. Mark Kelly (Ariz.), who is sticking to his game plan ahead of his reelection contest this fall: raise gobs of money and remain vague on a potpourri of hot-button issues.",
    "As The Hill's Tax Axelrod notes, Kelly hasn't taken a firm stance on a number of topics, including nixing the 60-vote legislative filibuster and the Build Back Better agenda, representing a repeat of what helped get him to the upper chamber in the first place.",
    "*****\nADMINISTRATION: The Justice Department and local law enforcement reacted to a Texas synagogue hostage-taking over the weekend as an event that had the potential to inspire copycats and warranted additional security at synagogues in major U.S. cities.",
    "The significance of what happened that day isn't lost on anybody, and he's clearly put a political calculation above talking about what he knows,? a House Republican aide told The Hill of McCarthy's communications with Trump surrounding the day's events.",
    "(The Associated Press)  Prince Harry, now living with his American wife, Meghan Markle, and their two children in California, wants to pay for his own police protection when he and his family visit Great Britain, but the U.K. government won't let him.",
    ": Sen. Tim Kaine (D-Va.) on Sunday said he believes the core provisions of the Build Back Better agenda will ultimately pass but allowed that many of the extraneous provisions in the package are dead? after Manchin voiced opposition to the proposal.",
    "The president is spending the holiday in Wilmington, Del., and will return to the White House at 8:25 p.m. Biden will deliver pre-recorded remarks to the National Action Network's annual King Day breakfast at 8:30 a.m., with virtual coverage HERE.",
    "Abrams chalked her absence up to a scheduling conflict, but speculation has centered on whether she is trying to distance herself from the White House ahead of what is expected to be a tough bid this fall for the state's governorship (The Hill).",
    "Centrist Democrats, not unlike their Republican colleagues, have misgivings about the two election reform bills and want the Senate filibuster rule to remain as is, undercutting progressives' hopes of wrestling victory from a losing Senate hand.",
    "But if you look at the core of the bill, I think the core is education and workforce and things like reduce childcare and education expenses, workforce training, and then support for the workforce in areas like health care? (The Hill).",
    "As The Hill's Peter Sullivan details, the Biden administration is trying to kick-start actions on testing and masks in the face of pressure from congressional Democrats and questions regarding why they didn't take place months ago.",
    "As of today, 74.2 percent of the U.S. population has received at least one dose of a COVID-19 vaccine and 62.3 percent is fully vaccinated,? according to the Bloomberg News global vaccine tracker and the government's definition.",
    " In parts of Pennsylvania and New York State, residents expect to measure snow in feet (Pittsburgh Post-Gazette) Airlines canceled more than 2,700 U.S. flights as the storm began to hit the U.S. East Coast on Saturday (Reuters).",
    "Biden, who is calibrating his rhetoric with an eye to voters' criticisms in polls and poor grades from party notables, will hold his first press conference since November on Wednesday to mark his initial year in office (CNN).",
    "Politico: Manchin drafted a version of the Freedom to Vote Act with Georgia gubernatorial candidate Stacey Abrams (D), which is not the version heading to the floor this week, said Steve Clemons, editor at large at The Hill.",
    "IN FOCUS/SHARP TAKES\nPOLITICS: Arizona is the focus of much of the political universe as both of the state's senators are coming under the microscope ahead of high-profile reelection battles later this year and in 2024.",
    "Some American manufacturers, several of which are approved by the National Institute for Occupational Safety and Health, have begun manufacturing KN95-style masks as well, including Protective Health Gear and DemeTech.",
    "Biden called it an act of terror? as the FBI identified the man who seized four now-rescued hostages as Malik Faisal Akram, 44, a British national who was killed in a raid following a 10-hour standoff (The Hill).",
    "https://bloom.bg/3IagUFM\nA MESSAGE FROM FACEBOOK\nWhy Facebook supports updated internet regulations\nRochelle is one of many experts working on privacy at Facebookto give you more control over your information.",
    "Either she delivers on the policies that we're asking for or she's out,? said Luis Avila, an organizer aligned with the Primary Sinema Project, which is fundraising in support of a potential 2024 challenger.",
    "When it comes to the Constitution of the United States of America, no one person sitting downtown in a spa ought to be able to pick up the telephone and say you are going to put a hold on my ability to vote.",
    "His whole goal, everything he does, is focused on how do I get or maintain 218 votes so I can be Speaker.?\nThe Hill: Department of Justice raises stakes with rarely used sedition charges for Oath Keepers.",
    "It is not the most timely way to receive such rapid tests if symptoms of COVID-19 infection crop up beforehand, but it is another way to be prepared as the omicron surge continues (The Associated Press).",
    "THE CLOSER\nAnd finally  Outdoor cats, wily as they are, have taken to warming themselves on petite, self-heating $500 Starlink satellite dishes this winter, reports The Guardian and Smithsonian Magazine.",
    "The New York Times has a guide and Bloomberg News reported some consumer tips: KN95s are made in China to meet that country's regulatory standards, while U.S.-made N95s are considered the gold standard.",
    "> International: With the Winter Olympics weeks away, China is increasing its testing requirement and mandating that all travelers headed to Beijing receive a COVID-19 test within 72 hours of arrival.",
    "****\nCONGRESS: Former acting Defense Secretary Christopher Miller, who served in the role under Trump, met with the House select committee probing the Jan. 6, 2021, attack on the Capitol last week.",
    "Clearly, the current strategy is failing and we need a major course correction,? Sen. Bernie Sanders, the liberal Independent from Vermont who caucuses with the Democrats, told The New York Times.",
    "The search for hope and a bridge to build back better in the future  to cite a mashup of Democratic themes since the 1990s  has sent some Democrats thumbing through their nostalgia notebooks.",
    "I would wish they would stop that foolishness because if we do not protect the vote with everything that we've got, we will not have a country to protect going forward,? Clyburn added.",
    "A MESSAGE FROM FACEBOOK\nWhy Facebook supports updated internet regulations\nRochelle is one of many experts working on privacy at Facebookto give you more control over your information.",
    "What else we're watching this week:\n> On Wednesday, the government says the public can begin to order up to four free at-home COVID-19 tests online and by phone to ship via the U.S.",
    "For much of the past year, Sinema has been in the spotlight for role as a semi-gatekeeper for the Biden agenda, headlined by her move to uphold the legislative filibuster last week.",
    "And that's what is going on here,? Clyburn told CNN when asked about Sinema's prediction that GOP senators will turn the tables on Democrats the next time they are in the majority.",
    "Joe Manchin (W.Va.) and Kyrsten Sinema (Ariz.) continue to be two of the most vocal opponents who have resisted Biden's many private and public entreaties to see things his way.",
    "The Hill: Surgeon General Vivek Murthy: Supreme Court blocking vaccine mandate is a setback for public health.?\nThe White House, however, is moving in the opposite direction.",
    "In response, Trump has told associates that DeSantis could never beat, labeling him dull.?\nKelly is not the only top Democrat who has adopted a cautious approach these days.",
    "Senate Majority Leader Charles Schumer (D-N.Y.) is expected to put a sprawling voting rights reform bill on the floor this week, forcing Kelly to finally go on the record.",
    "The latest committee meetings come amid a high-profile spat with House Minority Leader Kevin McCarthy (R-Calif.), who spurned calls by the panel to cooperate last week.",
    "Novak Djokovic was deported from Melbourne after a prolonged drama over his status as unvaccinated against COVID-19 and because of inaccuracies on his visa application.",
    "A rabbi who was among the hostages said the suspect grew increasingly belligerent and threatening? as the FBI negotiated the hostages' release (The Associated Press).",
    "Biden is expected to soon send lawmakers a COVID-19 supplemental budget request to fund more booster doses, antiviral pills, masks and tests (Axios and Roll Call).",
    "Although that maneuvering has rubbed Republicans the wrong way, it hasn't had the same impact on Democratic voters, with his fundraising totals speaking volumes.",
    "In Georgia, Abrams is tippy-toeing around the political scene lately, headlined by her decision to skip Biden's speech on election reform last week in Atlanta.",
    "INVITATION: Join The Hill's Virtually Live discussion, The Future of Cities Summit? on Thursday at 1 p.m., featuring seven experienced mayors from six states.",
    "Some school districts, including Arlington County in Northern Virginia, said they will ignore the order and continue to require masks (The Washington Post).",
    "The FBI's North Texas Joint Terrorism Task Force said there is no indication that other individuals are involved? and that the investigation will continue.",
    "Hear more from Rochelle on why Facebook supports updating regulations on the internet's most pressing challenges, including federal privacy legislation.",
    "Hear more from Rochelle on why Facebook supports updating regulations on the internet's most pressing challenges, including federal privacy legislation.",
    "), a foe of former President Trump, to a ticket in response to Biden's woes are derided by young progressives as soon as they are floated (The Hill).",
    "The vice president and second gentleman Doug Emhoff at 12:15 p.m. will participate in a Washington, D.C., service event at nonprofit Martha's Table.",
    "The World Economic Forum Davos Agenda 2022, an annual economic gathering among global leaders, begins today through Friday but virtually this year.",
    "There is no Democratic consensus about an agenda or even agreement about how to pitch this year's events to voters as the midterm elections loom.",
    "However, her intransigence on the issue has opened her up even further to a primary effort, with progressives itching to deny her a second term.",
    "? WEATHER, WATER & ASH: A major winter storm continues today, dumping snow, ice, rain and cold up the East Coast (WeatherChannel with maps).",
    "Vice President Harris will deliver virtual remarks at 11:15 a.m. to Ebenezer Baptist Church for an MLK Jr. commemorative service in Atlanta.",
    "The eruption was so loud it could be heard in New Zealand, 1,481 miles from Tonga, and its enormity was captured by satellites (Space.com).",
    "Trump is reportedly irked by DeSantis repeatedly declining to say that he would not run for president in 2024 if Trump decides to do so.",
    "Among them is Biden announcing a purchase of 500 million rapid tests and an upcoming one to increase availability of N95 and KN95 masks.",
    "He's gone to court for a review of his security worries and desire to foot the costs of sufficient protection (The Associated Press).",
    "He said he was disappointed? when his appeal was rejected by a federal court on Sunday and he was forced to exit the country (ESPN).",
    "The White House's push to increase free rapid tests also comes weeks after the nation's capital and states moved to do just that.",
    "The previous directive mandated travelers to be tested for the virus within 48 hours of their departure for Beijing (The Hill).",
    "It also caught insurers off guard, leaving them little time to prepare to immediately provide coverage (The New York Times).",
    " North Korea fired two more ballistic missiles into the sea on Sunday, marking its fourth weapon launch of the month.",
    "For the time being, N95 masks are still recommended for those in high-risk health care settings, such as hospitals.",
    "In Washington, D.C., rapid tests are available at public libraries after a directive from Mayor Muriel Bowser (D).",
    "Hill.TV's Rising? program features news and interviews at http://thehill.com/hilltv or on YouTube at 10:30 a.m.",
    "The most recent version of it is not going to happen,? Kaine told Face the Nation? moderator Margaret Brennan.",
    "Miller reportedly met with the panel on Friday, having served in the acting capacity during the deadly riot.",
    "The missiles were detected by South Korea and Japan from an area around Pyongyang's international airport.",
    "While that makes KN95 masks more comfortable, it also means they seal to the face a bit less effectively.",
    "Starting Jan. 24, masks are optional for parents of students in public and private schools, pre-K and up.",
    "We get you up to speed on the most important developments in politics and policy, plus trends to watch.",
    "The Wall Street Journal: To sway unvaccinated, new tactics are tried at funeral homes, on radio shows.",
    "The president and first lady Jill Biden contributed to a day of service on Sunday to mark MLK Jr. Day.",
    "> The Australian Open tournament is underway today, minus the world's top-ranked men's tennis star.",
    "The sit-down came after Kash Patel, Miller's former chief of staff, met with the panel last month.",
    "The former Pentagon chief accused Trump of being responsible for inciting the attack (NBC News).",
    "K95-style masks loop around the ears rather than wrapping around the back of the head like N95s.",
    "We invite you to share The Hill's reporting and newsletters, and encourage others to SUBSCRIBE!",
    "NBC News: Cost of masks and tests deepens a pandemic wedge between the haves and the have-nots.",
    "Talks over an omnibus package to prevent a shutdown have quietly resumed (The New York Times).",
    "In the final quarter of 2021, he raked in nearly $9 million and has $18.5 million in the bank.",
    "Nonprofit group Project N95 was founded to help people obtain legitimate medical-grade masks.",
    "New Zealand and Australia dispatched surveillance flights to assess the damage (BBC).",
    "The Hill: Democrats on Sunday pushed voting rights ahead of scheduled Senate vote.",
    "The percentage of the Americans who have received third or booster doses is 23.7.",
    "Ideas such as a third Hillary Clinton candidacy or adding Rep. Liz Cheney (R-Wyo.",
    "The Associated Press: Omicron exposes inflexibility of Europe's public hospitals.",
    "Postal Service at no charge to their addresses for arrival in a week to 12 days.",
    "The eruption sent a plume of ash into the sky and triggered high waves on Tonga.",
    "> Masks: Are you trying to select N95 or K95 masks while avoiding counterfeits?",
    "The Morning Report is created by journalists Alexis Simendinger and Al Weaver.",
    "Please recommend the Morning Report to friends and let us know what you think.",
    "The Associated Press: China aims for zero-COVID? Winter Olympics in February.",
    "It also drew the ire of outside groups both at the national and state levels.",
    "https://wapo.st/3rrFVFs\nDid Djokovic really pose a health risk in Australia?",
    "The Senate convenes at noon for a pro forma session on the federal holiday.",
    "No additional threats or warnings have been reported (The Times of Israel).",
    " The government is operating on short-term funding that expires on Feb. 18.",
    "The new rule will take effect on Sunday and last through the end of March.",
    "Scientists believe the events may just be a warmup (The Washington Post).",
    "The party in the White House wants to rebuild voter support, but how?",
    "The Atlantic: The worst of the omicron wave could still be coming.",
    "Readers can find us on Twitter @asimendinger and @alweaver22.",
    "Presented by Facebook\nWelcome to The Hill's Morning Report.",
    "Some players say they hope the focus can return to tennis.",
    "It is not clear what he discussed with committee members.",
    "However, whether that strategy lasts is an open question.",
    "The Hill: Florida looms large in Republican 2024 primary.",
    "Ron DeSantis, according to The New York Times and Axios.",
    "Email: asimendinger@thehill.com and aweaver@thehill.com.",
    "Total U.S. coronavirus deaths reported today: 850,605.",
    "Alexis Simendinger and Al Weaver are the co-creators.",
    "Trump is suddenly critical of Florida Republican Gov.",
    "The Beijing Olympic Games are set to start on Feb. 4.",
    "I don't know what she gains from doing what she did.",
    "Djokovic was seeking his 10th Australian Open title.",
    "? CRAZES: The game Wordle caught fire within weeks.",
    "WHERE AND WHEN\nThe House meets at noon on Tuesday.",
    "by Therese Raphael, columnist, Bloomberg Opinion.",
    "KN95s are fine for most people in other settings.",
    "It was immediately unclear how far they traveled.",
    "> The federal budget is back in the spotlight.",
    "Dionne Jr., columnist, The Washington Post.",
    "Don't miss the photos or the play on words.",
    "LEADING THE DAY\nCORONAVIRUS: Virginia Gov.",
    "It is Monday, Martin Luther King Jr. Day!",
    "Here's how to play (The Washington Post).",
    "The website is COVIDTests.gov.",
    "Don't make him bland, by E.J.",
    "You're right that it's dead.",
    "OPINION\nDr. King was bold.",
    "We want to hear from you!",
    "CLICK HERE to subscribe!",
    "ET at Rising on YouTube.",
    "Information is HERE.",
    "> Dead or not dead?",
    "Live stream HERE.",
    "Democratic Sens.",
    "..."
  ]
}