{
  "id": 764,
  "mediaId": 223,
  "date": "1/17/2022 12:00:00 AM",
  "headline": "Democrats Claim Liz Cheney As One Of Their Own; They Can Have Her",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/209/4ff4036f-d297-4b88-83e4-7c7d7f83f66c.jpg",
  "link": "https://townhall.com/columnists/derekhunter/2022/01/17/democrats-claim-liz-cheney-as-one-of-their-own-they-can-have-her-n2601927",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Derek Hunter",
  "authorUrl": "https://townhall.com/columnists/derekhunter/",
  "termIds": [
    1797,
    1797,
    945,
    945,
    1147,
    1147,
    1248,
    1248,
    562,
    571,
    571,
    545,
    545,
    562,
    146,
    146,
    2914,
    2914,
    2782,
    2782
  ],
  "sentences": [
    "What's sad is, thanks to the usual stupidity of so many in the Republican power structure, she will likely win reelection because there are so many Republicans running against her in the primary that they'll split the vote to the point that her fading support in the state will be enough to drag her across the finish line.",
    "But most of Cheney's GOP colleagues are refusing the fact that Trump: Threatened state officials to RIG the 2020 election, DENIED the election results after it was called for Biden, And incited a DEADLY ATTACK on the Capitol to overturn the election!",
    "It's more apparent than ever: the Republican Party is controlled by right-wing extremists who will defend Trump.?\nIn their typical fashion, these leftists write their fundraising emails like an illiterate 12-year-old girl.",
    "They have lionized Cheney  it's her against the entire Trump Republican Party.? It's kind of funny, actually, since Adam Kinzinger sold his soul for the same price to the same people, yet no one cares.",
    "Source: Jim Lo Scalzo/Pool via AP\nThere are lots of differences between being a Senator and being a Congressman, but the biggest is that as a Congressman you simply do not matter.",
    "SO WE THOUGHT you'd help us give Liz Cheney the support she needs to see the investigation through.?\nAre these left-wing groups really raising money to help reelect Liz Cheney?",
    "The pitch continues, We completely agree with Liz Cheney: Donald Trump must be thoroughly investigated for his role in inciting the violent Capitol insurrection on January 6th.",
    "In another fundraising email, the DSI admonishes their followers, saying, WE TOLD YOU Donald Trump thought he could get away with the crimes he committed on January 6th.",
    "Liz Cheney is a key leader in our fight to bring Trump to justice for the January 6th Insurrection,? a fundraising email from the Democratic Strategy Institute begins.",
    "), host of a daily radio show on WCBM in Maryland, and author of the book, Outrage, INC., which exposes how liberals use fear and hatred to manipulate the masses.",
    "But we have no idea how local Democrats feel about Cheney and her work on the January 6th Committee.?\nWhy are they trying to raise money off Cheney?",
    "Five years ago, who would've thought any liberal organization would write, We completely agree with Liz Cheney,? in any context whatsoever?",
    "How far has she fallen if radically progressive groups think invoking her name is a way to get money out of the pockets of their base?",
    "As was the case with the old Soviet Union, useful idiots? eventually lost the useful? part, and all that was left was an idiot.",
    "Now, this once rising star? in the Republican Party is the only person in Congress making Adam Kinzinger seem masculine.",
    "But one day, after a serious case of Trump Derangement Syndrome, Liz Cheney became obsessed with aiding Democrats.",
    "Former Vice President Dick Cheney, Liz's father, has been denounced as everything from the devil to Darth Vader.",
    "WE TOLD YOU Liz Cheney committed to bringing him to justice as the head of the Jan. 6th Investigation Committee.",
    "Honestly, it's not because they love her, it's because they'll raise money off of anyone and anything they can.",
    "The offspring of such a monster? has been attacked as the same and worse because that's where the left lives.",
    "Senators matter, with each of them having power to bring the entire chamber to a halt, at least for a while.",
    "Whatever happens, Liz Cheney has damaged herself to the point that she's a woman without a country.",
    "Ignorance of this fact is certainly why left-wing groups have embraced her, in name at least.",
    "That sentence was enough to get you excommunicated from the left until Donald Trump.",
    "What's amazing, however, is the fact that Liz Cheney is now a darling on the left.",
    "Maybe that's part of why Congresswoman Liz Cheney is so desperate to matter?",
    "She's one Member of the House who matters only in the eyes of the media.",
    "That they think they can raise money off her name is what's telling.",
    "Liz Cheney is now a darling of the left and unwanted on the right.",
    "Well, they're at least raising money pretending they're going to.",
    "Well, that probably wasn't her motivation, just the end result.",
    "Derek Hunter is the host of a free daily podcast (subscribe!",
    "The Cheney name has been one cursed by the left since 2000.",
    "What will ultimately come of that money remains to be seen.",
    "It's a testament to the power of the Cheney name, I guess.",
    "If you aren't the Speaker, there's little you can do.",
    "In the House, only the Speaker really matters.",
    "(The spelling, grammar, etc., are theirs.)",
    "Follow him on Twitter at @DerekAHunter.",
    "And frankly, they can have her.",
    "Still, the content is amazing.",
    "Luke Skywalker she is not.",
    "At least, not generally.",
    "That's Liz Cheney."
  ]
}