{
  "id": 767,
  "mediaId": 151,
  "date": "1/15/2022 12:00:00 AM",
  "headline": "POLITICO Playbook: Civil rights leaders fume after meeting with Sinema",
  "image": "https://static.politico.com/c8/3a/908dfff744b4b2cffbcf19cc8e75/220115-sinema-ap-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/15/civil-rights-leaders-fume-after-meeting-with-sinema-495741",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1096,
    1147,
    1246,
    1248,
    1335,
    1609,
    2030,
    2074,
    2123,
    2505,
    3094,
    141,
    255,
    330,
    346,
    403,
    459,
    562,
    571,
    615
  ],
  "sentences": [
    "Erin Banco reports that in a recent virtual all-hands staff meeting, CDC Director ROCHELLE WALENSKY delivered a sobering message to her employees: the workload was about to ramp up again.? Though it was framed like a pep talk, to many of those listening, the call was a stark reminder that despite their best efforts to contain the virus, the pandemic was not over and that the crushing workload would continue.?\nCLICKER  The nation's cartoonists on the week in politics,? edited by Matt Wuerker  17 keepers\nGREAT WEEKEND READS, curated by Ryan Lizza:\n The Mnuchin Files: New Documents Shed Light on Trump-Era Crypto Policy,? by CoinDesk's Ian Allison, Anna Baydakova, Nikhilesh De, Lawrence Lewitinn, David Morris and Danny Nelson: Jared Kushner advocated behind the scenes for a U.S. digital currency, among other revelations in a 250-page trove from Steven Mnuchin's tenure at Treasury.?\n These mass shooting survivors were called journalism heroes.",
    "David Ige  Dan Scavino  Mark Penn of the Stagwell Group  Amanda Sloat  NYT's Sarah Kliff  Stephen Lewis  New Yorker's Jon Lee Anderson  Ben Shapiro  Stuart Eizenstat of Covington and Burling  Deesha Dyer  Invernergy's Andrew Wills  Scott Hall  Jaymi Light of Cigna  Jason Larrabee  Jeff Carroll of Capitol Counsel  Joe Fuld  Kyle Herrig of Accountable.US (4-0)  Mike Hoffman  Rebecca Haller  Jonny Hiler of Miller Strategies  Katherine LaBeau  Ryan DelGaudio of the US-ASEAN Business Council  Mina Hamblet  Melissa Green of Rational360  Spencer Chretien  Katie Wood of the Senate HELP Committee  Matthew Hoeck  Wesley Morgan  Lorraine Voles  WaPo's Aaron Gregg  Chuck Babington  Scott Stanzel of Capital One  George Sifakis  Discovery's David Zaslav  Apple's Margaret Richardson  Airbnb's Christopher Nulty  Toni Verstandig\nTHE SHOWS (Full Sunday show listings here):\nGray TV\nFull Court Press?: House Majority Whip Jim Clyburn (D-S.C.)  Annie Linskey.",
    "Here's Sen. BERNIE SANDERS (I-Vt.): Clearly, the current strategy is failing and we need a major course correction.? And Rep. TIM RYAN (D-Ohio): It seems like the Democrats can't get out of their own way.? And Rep. STEPHANIE MURPHY (D-Fla.): Leadership set out with a failed strategy, and while I guess, maybe they can message that they tried, it actually isn't going to yield real laws.? And Rep. CHERI BUSTOS (D-Ill.): We really kind of need to reset at this point.? All that, and more, from NYT's Lisa Lerer and Emily Cochrane.",
    "In a statement to Playbook, a spokesperson for Sinema's office said that Senator Sinema is grateful for the chance to hear from these leaders  and as she said in her remarks [Thursday], she believes that different people of good faith can have honest disagreements about policy and strategy, and that honest disagreements are normal and do not reflect a lack of dialogue.?\nBut some of the attendees feel that Sinema's Thursday speech undercut any sense that the senator was truly interested in a dialogue.",
    "On Thursday, MICHAEL CARPENTER, the U.S. ambassador to the OSCE, told reporters that the drumbeat of war is sounding loud?  remarks echoed both by Polish Foreign Minister ZBIGNIEW RAU, who said that the risk of war? in the region is now greater than ever before in the last 30 years,? and by Russian Foreign Minister SERGEI LAVROV, who in a Friday press conference, said that his nation has run out of patience.? On that much, at least, there is agreement between Moscow and Washington.",
    "City & State New York's Caitlin Dorman tried to eat like him for a week, frequently failed, and had this takeaway about the new NYC mayor: The discipline required to maintain this routine is staggering, and it's something political adversaries and allies alike should keep in mind if Adams brings even half this energy to policymaking.?\nPope Francis, ever the hipster, made a secret trip to a record store in Rome.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nTara Palmeri @tarapalmeri\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "ENGAGED  Rudy Soto, a former congressional staffer who was recently appointed by the Biden administration to be the USDA rural development state director for Idaho, and Rose Petoskey, senior counselor to the assistant secretary for Indian Affairs at the Interior Department, got engaged on Jan. 7 at Martin's Tavern in Georgetown in the Proposal Booth,? where JFK proposed to Jackie.",
    "So why is the Atlantic an emotional train wreck of a publication??\n This Wonder Bird Flies Thousands of Miles, Non-Stop, as Part of an Epic Migration,? by Jim Robbins for Smithsonian Magazine: The more scientists learn about the Hudsonian godwit, the more they're amazed  and worried.?\n From the archives: She helped her husband start a far-right militia group.",
    "What happened over the next three years??\n The Atlantic's Nervous Breakdown,? by Commentary's Christine Rosen: The Atlantic's prominence and seriousness  have made it a dream come true for literally hundreds of liberal American journalists who spent most of the past 20 years in a panic about the financial viability of their chosen profession.",
    " Here's the dilemma faced by Senate Democrats amid their sputtering efforts to pass voting rights legislation: Should they embrace a much narrower, bipartisan effort to safeguard the vote-counting process, or continue what increasingly looks like a doomed push to protect access to the ballot box?? NYT's Jonathan Weisman weighs the options.",
    "Philly Inquirer's Jonathan Tamari breaks down the numbers: MEHMET OZ has booked nearly $5 million of ad time? since Nov. 30, DAVID MCCORMICK has spent $3 million on ads since late December, CARLA SANDS has dropped around $2 million since October and a PAC backing JEFF BARTOS has a $2 million ad buy starting next week.",
    "More details from David Lim\n As DONALD TRUMP sours on RON DESANTIS, the Florida governor is actively courting popular conservative media and online figures,? including some heavily involved in amplifying the anti-vax movement and downplaying the Jan. 6 attack on the U.S. Capitol,? Matt Dixon and Gary Fineout report.",
    " [N]ow come President Biden and Senate Democrats with plans to use the memory of Jan. 6 to attempt another federal power grab over our state elections and drive a wedge further into our divided nation.?\n The TV wars have begun in Pennsylvania's U.S. Senate race, and it's eating up campaign cash on the GOP side.",
    "POLITICO Playbook: Civil rights leaders fume after meeting with Sinema\nBy EUGENE DANIELS\n01/15/2022 09:31 AM EST\nPresented by\nDRIVING THE DAY\nOn Wednesday at 3:30 p.m., a group of major civil rights leaders hopped on a Zoom call with Sen. KYRSTEN SINEMA to discuss the latest push for voting rights legislation.",
    " On Jan. 5, the couple married at San Francisco City Hall in front of eight guests.?\nWELCOME TO THE WORLD  Travis Korson, SVP at Madison Strategies, and Emily Korson, a senior consultant at CGI Federal, on Wednesday welcomed Charlotte Lillian Korson, who came in at 7 lbs 13 oz and 21.9 inches.",
    "I don't believe that they know the next steps  their purpose this week was to find out what they could get, and they basically got nothing.? That likely means that war is more likely, because if Russia can't get what it wants through the diplomatic route, it might try a more violent approach.",
    "What Sinema didn't say, according to participants, was that she was planning on definitively drawing that line in the sand the following day on the Senate floor minutes before Biden's lunch with Senate Democrats, effectively ending any chance of enacting Dems' voting rights bills this year.",
    "She said she understood where they were coming from, and supports the voting rights bills, but believes that a filibuster carveout would be bad for the country, and that Republicans could well use it to hold a simple-majority vote to undo whatever voting legislation Democrats passed.",
    "The civil rights leaders are frustrated with Sinema and, in the words of one person familiar with the meeting, pissed.?\nThe timing of her speech  showed an insensitivity, at best, and contempt, at worst, of our efforts and the efforts of the president,? Sharpton told me.",
    "AL SHARPTON, NAACP President DERRICK JOHNSON, NAACP Legal Defense Fund President SHERRILYN IFILL and MELANIE CAMPBELL, president of the National Coalition on Black Civic Participation  came with the goal of pushing the Arizona Democrat to support filibuster reform.",
    "Adams is now a program officer for the State Department in the Bureau of Democracy, Human Rights and Labor  [Ms. Ilyas works] for Front Line Defenders, an organization that provides support for global human rights activists, where she is now the head of protection.",
    "Where things stand: U.S. officials, lawmakers and experts assert that Putin has yet to decide whether or not to launch a massive war  though it's still possible that this all ends with some sort of diplomatic deal rather than a military maneuver.",
    " What they told Sinema: Over the course of an hour, the civil rights leaders impressed upon the Arizona senator that time was running out for voting rights, and that they needed her to support a filibuster carveout for the issue.",
    "As if that weren't enough, on Friday, the U.S. released intelligence showing the Kremlin could be preparing a false-flag operation whereby highly trained Russian forces would sabotage Moscow's proxies and blame it all on Kyiv.",
    "While previous meetings between Sinema and the civil rights leaders ended with mutual respect and a promise to continue talking, this time, given the senator's remarks on Thursday, sources say the relationship has soured.",
    "Bloomberg's Gerry Smith reports that the pro-Trump OAN depends heavily on DirecTV, its largest distributor, to reach its audience.? (The channel is not carried by Comcast, Charter Communications or the Dish Network.)",
    "PHOTO OF THE DAY\nPLAYBOOK READS\n9 THINGS WE READ THAT STUCK WITH US\n A headline sure to cause grief in the White House: Biden supporters apoplectic' one year into his presidency,? from AP's Steve Peoples.",
    "But in the talks, the Russians didn't get anything close to what they wanted, and NATO presented a united front,\" said ALINA POLYAKOVA, president and CEO of the Center for European Policy Analysis.",
    "Now the Oath Keeper's wife has regrets,? by the L.A. Times' Del Quentin Wilber in Eureka, Mont., Nov. 12, 2021\nPLAYBOOKERS\nSherrod Brown binge-watched HBO's Succession,? and has some thoughts.",
    "The pro-Trump rioters that day were, he writes, motivated by a desire to to use federal authority to overturn results of the presidential election that had been certified by all 50 states.",
    "Interesting nugget: Sen. SUSAN COLLINS (R-Maine), who is leading that bipartisan effort, said she is not seeking Senate Minority Leader MITCH MCCONNELL's blessing for her legislation.",
    "But Russia  which has already amassed roughly 100,000 troops near its border with Ukraine  is actively moving even more military equipment towards the country, as the WSJ reported.",
    "RUSSIA-UKRAINE STATE OF PLAY  With tensions ratcheting upward between the U.S. and Russia over Ukraine, POLITICO national security reporter Alex Ward writes in:\nWhat a week it was.",
    "Top U.S. officials held three meetings in Europe with their Russian partners and allies, only to see all parties walk away with the likelier chance of war looming over them.",
    " Former VP MIKE PENCE is up with a new WaPo op-ed defending the filibuster and comparing Democrats' efforts to eliminate it to pass voting rights to the Jan. 6 insurrection.",
    "for more than three decades, will take over as the election threats executive at the Office of the Director of National Intelligence next week,? NYT's Julian Barnes reports.",
    "It was almost like she said that she wanted to be able to tick off the box that she talked to major civil rights leaders' before she did what she did,? one attendee said.",
    "They wanted Sinema to understand that they felt her stance was divorced from political reality: no major voting rights bill will win 60 votes in this partisan climate.",
    "The previously unreported meeting was described to me by multiple people who attended or are familiar with the discussion, and was confirmed by Sinema's office.",
    " The White House announced that starting on Wednesday, Americans will be able to order free, at-home Covid-19 tests through the website COVIDTests.gov.",
    "Just over a year ago, millions of energized young people, women, voters of color and independents joined forces to send Joe Biden to the White House.",
    "You cannot say you fought' [for the bills], and not change the rules to make it happen,? in the words of one person who attended the meeting.",
    "Playbook couldn't happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "Jim Banks said it is long past time? for Kevin McCarthy to expel Liz Cheney and Adam Kinzinger from the House Republican Conference.",
    "Then the buyouts came.? by WaPo's Emily Davies and Elahe Izadi: Capital Gazette reporters were once the face of the First Amendment.",
    "Soto is a member of the Shoshone Bannock Tribes and Petoskey is a member of the Grand Traverse Band of Ottawa and Chippewa Indians.",
    "MSNBC\nThe Sunday Show,? with a special edition on Our Fragile Democracy?: Rep. Terri Sewell (D-Ala.)  Barbara Walter  Virginia Gov.",
    "Larry Hogan  Sen. Tim Kaine (D-Va.)  Kansas City, Mo., Mayor Quinton Lucas  Scott Gottlieb  Betsey Stevenson  Anthony Salvanto.",
    "In short: Neither side felt their core interests were met, and the Biden administration's collective blood pressure is soaring.",
    "There's a lot of emotions, and none of them are good,' said QUENTIN WATHUM-OCAMA, president of the Young Democrats of America.",
    " Jennifer Scoggins Hanks is joining the American Apparel & Footwear Association as director of brand protection.",
    "Eric Adams doesn't eat meat or animal products, and avoids salt, sugar, processed foods, or adding oil to food.",
    "He previously was director of public affairs at the American Society for Biochemistry and Molecular Biology.",
    "The fear is that Russian President VLADIMIR PUTIN will use that as a pretext to send troops over the border.",
    "We're not seeing the results.'?\n Is it time for Dems to smash the reset button ahead of the midterms?",
    " People are feeling like they're getting less than they bargained for when they put Biden in office.",
    "ABC\nThis Week?: Surgeon General Vivek Murthy  House Majority Whip Jim Clyburn (D-S.C.)  Tom Bossert.",
    " What Sinema said: The senator politely listened and held to a message they'd heard from her before.",
    "But at this moment, pessimism reigns  both within the U.S. foreign policy community and in Europe.",
    " The CDC is experiencing a mass wave of staff burnout nearly two years into the Covid-19 pandemic.",
    "OPM ARRIVAL LOUNGE  Blake Davis has joined the Office of Personnel Management as a senior adviser.",
    "NBC\nMeet the Press?: Panel: Matthew Continetti, Andrea Mitchell, Amna Nawaz and Eugene Robinson.",
    "FOX\nFox News Sunday,? anchored by John Roberts: Virginia Gov.-elect Glenn Youngkin  Ashish Jha.",
    "CNN\nState of the Union?: House Majority Whip Jim Clyburn (D-S.C.)  Sen. Bill Cassidy (R-La.)",
    "TRANSITIONS  MK McCloskey and Ansley Braden are joining the development team at No Labels.",
    "Braden most recently was scheduling and operations director for Rep. Ken Buck (R-Colo.).",
    "Panel: Margaret Talev, Toluse Olorunnipa, Seung Min Kim, Kaitlan Collins and Eva McKend.",
    "McCloskey has been at the Townsend Group, a PAC fundraising firm, for over five years.",
    " Satellite TV provider DirecTV plans to drop One America News Network from its lineup.",
    "VP KAMALA HARRIS' SATURDAY  The vice president has nothing on her public schedule.",
    " Jessica Andrews is joining the child care company Otter as a market launcher.",
    "Ralph Northam  Cora Masters Barry  Melanie Campbell  Ns Ufot  Clarence Jones.",
    "The tests are expected to ship within 7-12 days of ordering,? per a release.",
    "I don't know if the right word is apoplectic? or demoralized.? We're down.",
    "\n Benjamin Corb is now SVP of health advocacy at Edelman Public Relations.",
    "Pic  Another pic\nWEDDING  Maheisha Adams and Meerim Ilyas, via NYT: Ms.",
    "But 12 months into his presidency, many describe a coalition in crisis.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "MEDIA MOVE  Pradnya Joshi is joining WaPo as national weekend editor.",
    "She most recently was comms director for Foreign Policy for America.",
    "BIDEN'S SATURDAY  The president has nothing on his public schedule.",
    "DNI ARRIVAL LOUNGE  Jeffrey Wichman, who has worked at the C.I.A.",
    "Panel: Cecilia Vega, Rachel Scott, Ian Pannell and Steve Inskeep.",
    "We don't feel like we have to ask for permission,? she said.",
    " Russia wants a guarantee that Ukraine will never join NATO.",
    "She currently is trade and agriculture editor at POLITICO.",
    " Rep. Mike McCaul (R-Texas)  Surgeon General Vivek Murthy.",
    " The U.S. wants Russian troops to back off from Ukraine.",
    "Good Saturday morning, and thanks for reading Playbook.",
    "He previously was COS to Rep. Josh Gottheimer (D-N.J.).",
    "Pic\nHAPPY BIRTHDAY: CNN's Jeremy Diamond  Hawaii Gov.",
    "Panel: Josh Holmes, Marie Harf and Chad Pergram.",
    "Send Playbookers tips to playbook@politico.com.",
    "She previously was a director at DCI Group.",
    "(The primary election isn't until May 17.)",
    "CNN\nInside Politics?: Jonathan Reiner.",
    "Did someone forward this email to you?",
    "The participants  which included Rev.",
    "CBS\nFace the Nation?: Maryland Gov.",
    "Sign up here."
  ]
}