{
  "id": 771,
  "mediaId": 558,
  "date": "1/14/2022 12:00:00 AM",
  "headline": "Rep. Katko joins exodus of GOP lawmakers who voted to impeach Trump",
  "image": "https://s.yimg.com/ny/api/res/1.2/BEDhRP_rHYDP.WrHS.jt9g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-01/65f144a0-7565-11ec-bffb-55152e343641",
  "link": "https://sg.news.yahoo.com/amphtml/rep-katko-joins-exodus-of-gop-lawmakers-who-voted-to-impeach-trump-183619942.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Wilson",
  "authorUrl": "https://www.yahoo.com/author/christopher-wilson",
  "termIds": [
    1147,
    1248,
    1609,
    2005,
    2010,
    2214,
    3094,
    146,
    428,
    562
  ],
  "sentences": [
    "It is how I've been able to unite people to solve problems, and how I was rewarded with resounding victories in every single campaign for Congress.?\nHe has represented the 24th District, encompassing a portion of central New York, since winning the seat in 2014, and would have potentially faced a primary challenge against a fellow Republican after new maps were drawn.",
    "Rep. John Katko, R-N.Y., announced he would not be running for reelection, becoming the third Republican who voted to impeach former President Donald Trump and subsequently announce their retirement from Congress.",
    "After Katko, the top Republican on the House Homeland Security Committee, had come to an agreement with his Democratic counterpart, he was undercut by McCarthy and saw the proposal get killed in the Senate.",
    "Katko, from Upstate New York, is gone!?\nLast January, Katko became the first Republican to say he would vote to impeach Trump for his role in promoting and prolonging the violence at the Capitol.",
    "To allow the president of the United States to incite this attack without consequence is a direct threat to the future of our democracy,? Katko said in a statement explaining his vote.",
    "Katko follows Reps. Anthony Gonzalez of Ohio and Adam Kinzinger of Illinois in voting to impeach Trump and then subsequently announcing they would not run for reelection.",
    "My conscience, principles, and commitment to do what's right have guided every decision I've made as a Member of Congress, and they guide my decision today,? said Katko.",
    "Trump and his allies have targeted the other Republican legislators who voted for his impeachment, with Rep. Liz Cheney of Wyoming a top target.",
    "House Minority Leader Kevin McCarthy originally had Katko negotiate the details for a bipartisan committee to look into the Capitol riot.",
    "I hear my Republican colleagues in their argument that impeachment only further divides our country at a time when we must move forward.",
    "But I also believe firmly that I must follow the law and the facts and hold this president accountable for his actions.?",
    "Kinzinger and Cheney are the only two Republicans serving on the House committee investigating the events of Jan. 6.",
    "In a statement posted to his Facebook page on Friday, Katko, 59, said he wanted to spend more time with his family.",
    "Sen. Pat Toomey of Pennsylvania also announced his retirement after voting to convict Trump in his Senate trial.",
    "Trump celebrated the news in a statement, writing, Great news, another one bites the dust.",
    "There must be a continuance of government and a peaceful transition of power.",
    "The divide in our country is more clear than ever before,? he continued.",
    "For that reason, I cannot sit by without taking action.",
    "I will vote to impeach this president.",
    "I agree."
  ]
}