{
  "id": 772,
  "mediaId": 124,
  "date": "1/14/2022 12:00:00 AM",
  "headline": "Inside Trump's secretive endorsement operation",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_02/3529546/220113-donald-trump-rally-mn-1630.jpg",
  "link": "https://www.nbcnews.com/politics/donald-trump/inside-trump-s-secretive-endorsement-operation-n1287383",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1147,
    1436,
    1436,
    1284,
    1284,
    1306,
    1306,
    2137,
    2137,
    2087,
    2087,
    1875,
    1875,
    428,
    428,
    2672,
    2661,
    2661,
    2672
  ],
  "sentences": [
    "Full Kinzinger: 'There are people that live in a totally different reality'\nJan. 9, 202207:22\nThe experience of the eight-term lawmaker, whose father held the seats for 12 terms before him, is reflective of a sometimes secretive process that was described to NBC News in interviews with more than half a dozen people familiar with aspects of the endorsement operation.",
    "In cases where Trump doesn't have a long-standing relationship with the candidate  or isn't making the endorsement to thwart an adversary  Republicans familiar with the process describe a more cautious and strategic approach than the one he pursued as president or in the immediate aftermath of his defeat.",
    "WASHINGTON  When former President Donald Trump headlined a fundraiser for the House Republicans' campaign arm in Tampa, Fla., in November, Rep. Gus Bilirakis, R-Fla., seized the opportunity of a face-to-face encounter to ask for Trump's endorsement.",
    "\"He makes up his own mind,\" said Rep. Beth Van Duyne, R-Texas, who narrowly won her seat in 2020 and recently got a second endorsement from Trump in December, along with fellow Texas Reps. Michael Burgess, Roger Williams and Michael Cloud.",
    "Trump has endorsed 91 candidates for House, Senate, governorships, state legislative seats and a variety of statewide offices, including secretary of state, attorney general and Texas lands commissioner, according to an NBC News review.",
    "Trump pollster Tony Fabrizio conducted a survey of South Dakota voters for a conservative group that is trying to demonstrate support for the state's other senator, Republican John Thune, is weak enough for him to lose a primary.",
    "\"There's a lot of other people milling around and keeping a room at Mar-a-Lago and finding a way to spin by the table, but I don't think those people, by and large, have any sway in the process,\" said the GOP operative.",
    "Van Duyne said she wasn't aware of any formal process and that it took her longer to get approved to serve as a Housing and Urban Development official in Trump's administration than to get her most recent endorsement.",
    "While the decisions start from different angles  a one-on-one encounter with a supplicant, Trump approving of an ally's public commentary on him, or appeals to Wiles's endorsement team  they end in the same place.",
    "\"Rumors are that Doug Ducey, the weak RINO Governor from Arizona, is being pushed by Old Crow Mitch McConnell to run for the U.S. Senate,\" he said in a Friday statement, ahead of his weekend rally in that state.",
    "As to whether Trump's imprimatur will scare off potential primary challengers, Bilirakis, whose district should become more Republican in an upcoming rewrite of Florida's congressional lines, said, \"We'll see.\"",
    "And when he takes the stage for his first rally of 2022, in Florence, Ariz., Saturday night, he will be flanked by a retinue of hand-picked favorites who deny that he lost their home state in 2020.",
    "And Rep. Liz Cheney, R-Wyo., who is serving on the Democratic-led House committee investigating the Jan. 6 attack on the Capitol, is in danger of losing a primary to Trump-endorsed Harriet Hageman.",
    "The most common theme of Trump's endorsements, particularly at the state level, is that he is backing candidates who have voiced support for his lie that the 2020 election was rigged against him.",
    "The group includes Bill Stepien, who managed Trump's 2020 campaign, Brian Jack, the White House political director under Trump and Donald Trump Jr., according to people familiar with the process.",
    "Fifty-nine of the 91 have questioned the 2020 election results, according to an NBC News review, including those who voted against certifying President Joe Biden's victory in Congress.",
    "\"There's nobody that would have stopped him from endorsing Jody Hice or David Perdue,\" Georgia candidates who are trying to unseat Secretary of State Brad Raffensberger and Gov.",
    "Arizona saw the closest finish in the country  Trump lost by less than 10,500 votes  and the outcome remained the same after a partisan GOP review failed to change the result.",
    "While Bilirakis drove to an event in north Hillsborough County, Trump read a proposed statement over the phone and asked if the congressman had any changes to make.",
    "Still, when Trump abruptly canceled a planned Jan. 6 speech designed to rebut the actual election results, he promised he would make his case at Saturday's rally.",
    "A super PAC run by Trump ally Pam Bondi is bringing many of them together for a policy conference and fundraising dinner at Trump's Mar-a-Lago resort next month.",
    "But some longtime Republican strategists aren't convinced that's the ticket, at least not for the second-tier candidates who are unknown to the former president.",
    "Facing political and personal destruction at Trump's hands, three House Republicans who voted to impeach him last year have decided not to run for re-election.",
    "He has stayed away from several competitive GOP Senate primaries where multiple candidates are running as acolytes, including in Missouri, Arizona and Ohio.",
    "Rep. Billy Long, R-Mo., and Bernie Moreno, an Ohio Republican, both hired former White House counselor Kellyanne Conway to advise their Senate campaigns.",
    "It's a two-tier process: The candidates Trump is going to endorse come hell or high water, and the lower-tier hopefuls who are getting vetted.",
    "David McCormick, who recently entered the Senate race in Pennsylvania, has lined up so many Trump-world luminaries it's hard to keep count.",
    "He has also become enamored of the anti-endorsement, ripping into Republican incumbents who challenge him or his lie about the election.",
    "Trump is scheduled to speak at the Feb. 23 dinner, according to an email sent to donors that was first reported by The New York Times.",
    "But there's another key thread: Trump is looking to find races where his endorsement can be tied directly to a hopeful's fate.",
    "\"In the end, he makes these decisions, but he does it after having it run through channels,\" said one Republican operative.",
    "In Pennsylvania, Trump endorsed Sean Parnell  only to see Parnell suspend his campaign amid domestic abuse allegations.",
    "The competition for Trump's endorsement has also spurred jockeying to hire advisers who are perceived to have his ear.",
    "\"I will never endorse this jerk again,\" he said last Sunday, after Sen. Mike Rounds, R-S.D., called the election fair.",
    "The next day, the former president called Bilirakis to offer the most sought-after validation in Republican politics.",
    "A small set of advisers, led by longtime counselor Susie Wiles, vets candidates seeking Trump's endorsement.",
    "\"Of course it's important to me,\" Bilirakis said in an interview with NBC News in the Capitol Tuesday.",
    "The better route  save a direct relationship with Trump  may be to go through Wiles' vetting process.",
    "Behind the scenes, there's an effort afoot to align Trump-backed candidates from around the country.",
    "Bilirakis, who could face a tough re-election race, was just thrilled to have the stamp of approval.",
    "While Rounds isn't up for re-election for another five years, Thune is on the ballot in 2022.",
    "Mike Dunleavy on the condition that Dunleavy not back Sen. Lisa Murkowski's re-election bid.",
    "Brian Kemp, both of whom rejected Trump's false claims of foul play in their state in 2020.",
    "If they're considering [an endorsement], they meet with everybody who they're considering.\"",
    "The candidates who agree with him have been assigned choice speaking slots at the event.",
    "Trump has endorsed Kelly Tshibaka, who is seeking to deny Murkowski the GOP nomination.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "\"He will never have my endorsement or the support of MAGA Nation!\"",
    "That served as a warning that he needed a better vetting process.",
    "Then he said he would talk to his team about it.",
    "\"No process would have stopped that.\"",
    "\"Yes, yes, yes,\" Trump replied.",
    "In Alaska, Trump endorsed Gov.",
    "\"Not everybody gets a meeting.",
    "He didn't change a comma."
  ]
}