{
  "id": 773,
  "mediaId": 238,
  "date": "1/14/2022 12:00:00 AM",
  "headline": "Opinion: Susan Collins tries to Trump proof' the 2024 election  behind Trump's back",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/18/susan-collins-trump-coup-electoral-count-act/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2034,
    2034,
    1609,
    1646,
    1646,
    2095,
    2095,
    737,
    737,
    661,
    661,
    1248,
    1248,
    1434,
    1434,
    1609,
    1147,
    1147,
    545,
    545,
    428,
    427,
    427,
    428,
    298,
    298,
    2672,
    2672,
    2661,
    2661,
    2550,
    2550,
    2976,
    2976
  ],
  "sentences": [
    "Collins's piece suggests Republicans are examining ECA reforms that would clarify the vice president's role and make it harder for Congress to invalidate legitimate electors (another thing Trump tried to make happen).",
    "On the other track, a handful of Republicans are trying to assemble reforms that will foil any such future Trump attempt  while carefully saying little about the gigantic elephant in the room, i.e.",
    "Collins's piece in the New York Times constitutes her most extensive remarks yet on the need to fix the Electoral Count Act of 1887, or ECA, which shapes how Congress counts presidential electors.",
    "Trump incited his mob to attack the Capitol, where they tried to search out Pence and delay the count of electors, apparently acting on the idea that this procedural coup actually was possible.",
    "She points out that in pressuring his vice president, Mike Pence, to refuse to count Joe Biden's electors, Trump tried to exploit the ECA's lack of clarity on the vice president's role.",
    "Another threat comes from the possibility that in 2024, a single GOP governor might send fake electors for Trump, and a GOP-controlled House run by a Speaker McCarthy could count them.",
    "On one track, Donald Trump and his allies are loudly telegraphing their intentions to rerun his 2020 scheme in 2024  albeit with more allies installed in key positions this time.",
    "So Collins and other Republicans who want to reform the ECA  and the jury's out on how serious this effort really is  should keep in mind this dimension of the threat.",
    "As Congress debates how to reform our electoral counting procedures to safeguard against another coup attempt, a strange two-track dynamic has set in.",
    "And importantly, Collins declares, in a loaded phrase, that legitimate political discourse? actually entails having a debate about ECA reform.",
    "But we need to be sure that Collins and other Republicans who want reform are focused on the real threat, even if they don't say so out loud.",
    "This endorsement is best understood as forward-looking: It's another sign of the insurrectionism that's taking hold among House Republicans.",
    "It's also present in people such as David Perdue, the former senator mounting a Trump-backed Republican primary challenge to Georgia Gov.",
    "It comes from Trump and McCarthy, and other allies of Trump who would surely execute such a scheme if the circumstances align for it.",
    "The more ECA reform gets associated with an effort to combat Trump, the harder it might get for 10 Senate Republicans to support it.",
    "And at this point, McCarthy is basically clipping Trump's toenails for him, because his ambitions to become speaker depend on it.",
    "But to make this all work, in their private deliberations they need to remain laser-focused on the Trumpian elephant in the room.",
    "It's essentially a declaration that anti-insurrection Republicans must reform the ECA to put their votes where their mouths are.",
    "Indeed, this is the context for understanding McCarthy's new endorsement of the primary challenger to Rep. Liz Cheney (R-Wyo.)",
    "Perdue is running for governor on a tacit promise to execute such a scheme; indeed, this is exactly why Trump supports him.",
    "That means it's more likely that a GOP House under a Speaker McCarthy would count sham electors sent by, say, a GOP Gov.",
    "That's a subtle middle finger to the Republican National Committee's defense of Jan. 6, which used that same phrase.",
    "So by all means, if Collins and Republicans need to do this behind Trump's back, as it were, that's understandable.",
    "In a way, Collins and other Republicans in her camp are trying to Trump proof? our elections  behind Trump's back.",
    "In short, this Collins moment represents something like a public break with the pro-insurrection wing of the GOP.",
    "Collins does note that the holes in the ECA are what created an avenue for Trump to try to overturn his loss.",
    "Sen. Susan Collins (R-Maine) has a new piece outlining her support for reform that underscores this dynamic.",
    "Of course, Collins and Republicans probably can't say this out loud in quite this way.",
    "Collins also points out that the ECA's problems helped spark the Jan. 6 insurrection.",
    "Brian Kemp, who committed the heresy of refusing to help Trump steal the election.",
    "That threat comes from Trump and House Minority Leader Kevin McCarthy (R-Calif.).",
    "As I've reported, if this happens, it might actually work under the current ECA.",
    "(Sorry if you're bored of hearing about the ECA, but this is important.)",
    "This hints at how reform might happen, if it is to happen at all.",
    "But they're not enough: We can't only fight the last war here.",
    "Cheney's challenger has castigated Cheney for betraying Trump.",
    "Trump is pushing many other candidates for similar positions.",
    "And there are basic additional reforms that would fix this.",
    "Fixing the ECA should include reforms that address this.",
    "for the sin of wanting accountability for Jan. 6.",
    "that the 2024 threat comes from Trump himself.",
    "Those things are essential.",
    "That's all good stuff.",
    "David Perdue."
  ]
}