{
  "id": 780,
  "mediaId": 43,
  "date": "1/13/2022 12:00:00 AM",
  "headline": "Trump Supporters: Deceivers and the Deceived",
  "image": "",
  "link": "https://www.dailykos.com/story/2022/1/13/2074459/-Trump-Supporters-Deceivers-and-the-Deceived",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    799,
    1147,
    1609,
    1765,
    2005,
    2087,
    2095,
    2349,
    3094,
    545,
    2766,
    2834
  ],
  "sentences": [
    "Examples certainly include former Secretary of Defense General Jim Mattis, former Secretary of State Rex Tillerson, former White House Chief of Staff General John Kelly, former director of Homeland Security Kiersten Nielsen, former director of Homeland Security Chad Wolf, former White House director of Strategic Communications Alyssa Farah, former director of White House Communications Stephanie Grisham, National Security Advisor John Bolton, National Security Advisor HR McMaster, former Secretary of the Navy Richard Spencer, former Attorney General Jeff Sessions, former White House Counsel Ty Cobb, former director of White House Communications Anthony Scaramucci, National Economic Council director, Gary Cohn and many others.",
    "Though now a golfing buddy, Senator Lindsey Graham, South Carolina, labeled Trump a race-baiting, xenophobic, religious bigot.? That was in addition to describing him as a kook,? crazy? and a man who was unfit for office.?\nBefore the 2016 election, spineless Senator Ted Cruz, called Mr. Trump a pathological liar? who was utterly amoral,? a serial philanderer? and a narcissist at a level I don't think this country's ever seen.? Even though Trump publicly labeled Cruz's wife as ugly, Cruz became a self-serving sycophant, and vocal supporter of his puppeteer.",
    "And in that op-ed piece he stated, I now fear that what we have fought so hard to achieve globally  the right to free, fair elections, unhindered by strongman politicians who seek nothing more than to grow their own power  has become dangerously fragile at home.?\nIn an interview last April, former president George W. Bush stated, When it comes to the unity of America, those days seem distant from our own So much of our politics has become a naked appeal to anger, fear and resentment.",
    "There is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised.?\nThe official Trump had appointed to oversee the integrity, Republican Chris Krebs, publicly stated the 2020 election was the most secure in history.? For his honesty and personal integrity, Krebs was immediately terminated and America the poorer for it.",
    "That's true patriotism.?\nRove continued, On the anniversary of Jan. 6, I'm addressing squarely those Republicans who for a year have excused the actions of the rioters who stormed the Capitol, disrupted Congress as it received the Electoral College's results, and violently attempted to overturn the election.? The architect has spoken.",
    "Speaking shortly after the attack from the House floor McCarthy stated, The president bears responsibility for Wednesday's attack on Congress by mob rioters? Nearly immediately following the inauguration of President Biden, McCarthy, tail between his legs, flew to Mar-a-Lago, begged forgiveness, and pledged fealty to his master.",
    "And while the broken windows have been repaired and many of the rioters have been brought to justice, the truth is that our democracy is at greater risk today than it was back then,\" (emphasis added)\nThe normally reserved but observant former president Jimmy Carter, wrote for the New York Times, I Fear for our Democracy.",
    "Forsaking democracy, after the 2020 election, Cruz wanted to overturn the election and reinstall this same pathological liar.? On 6 January, 2022, Cruz displayed his own amoral character as he groveled nationally before FNC's factually-challenged opinionator Tucker Carlson, admitting he makes frankly dumb statements.",
    "(Coined by Ted Gurr in 1974, an anocracy is a hybrid form of government between democracy and dictatorship) Rightfully, Walter is concerned about the potential of devolving into an American Civil War stating, It will begin with sporadic acts of violence and terror, accelerated by social media.",
    "The federal government agency responsible for election security, the Elections Infrastructure Government Coordinating Council & The Election Infrastructure Sector Coordinating Executives Committees, posted the following statement: When states have close elections, many will recount ballots.",
    "Despite McConnell's acquiescence, Trump publicly denigrated him, stating, Mitch is a dour, sullen, and unsmiling political hack.? Yet, in later interviews McConnell stated he would continue to support Trump if he became the GOP nominee for the 2024 election.",
    "In addition to most of the Republicans in Congress and the Republican National Committee, pushing the Big Lie (that Trump actually won the 2020 election) there are several news organizations that overtly subvert the American people.",
    "But I also know that our darkest days can lead to light and hope.?\nIn addition to senior political figures, there are scores of political scientists and respectable journalists who have been raising warning-flags for many years.",
    "I'm saying this because you should be alarmed.?\nSpeaking to Congress on January 6, 2022, President Biden addressed the concerted effort to undermine democracy through attacks on voting rights in many states across the country.",
    "Interestingly, he again reiterated that, Mitch McConnell is a loser.? He reiterated the lie that Detroit had more ballots than voters, that the election was rigged, and he doesn't believe Biden got 80 million votes.",
    "As Professor Barbara Walter points out in her new book, How Civil Wars Start and How to Stop Them, for some political scientists, the US is no longer considered a fully functional democracy, but rather an anocracy.",
    "Thanks to documents recently released by the subcommittee investigating the insurrection, we are aware that Sean Hannity, Laura Ingram, and others from FNC sent text messages to Trump as the events unfolded.",
    "Using the Big Lie for justification, 19 states have enacted 34 new laws designed to limit voting by groups that predominantly vote for the Democratic Party (note 440 bills were introduced in 49 states).",
    "Following Georgia, state Republican committees in North Carolina and Louisiana voted to censure two of their respective Republican senators, Richard Burr and Bill Cassidy, for voting to convict Trump.",
    "Addressing the events of January, 6, 2021, former president Obama stated, \"One year ago, a violent attack on our Capitol made it clear just how fragile the American experiment in democracy really is.",
    "His actions ever since have been nothing short of reprehensible, as he moved to derail the House investigation of the insurrection by nominating culprits complicit in the instigation of that event.",
    "Speaking truthfully in the immediate aftermath of the vicious attacks, both definitively and explicitly, acknowledged that Trump bore personal responsibility for the overt assault on democracy.",
    "One of the more startling comments came from Dave Ball, a county Republican official in Pennsylvania, who rebuked Toomey for his vote, saying, We did not send him there to vote his conscience.",
    "There are a few members of Congress who are so incompetent that they might actually believe the lies emanating from Trump, but most members privately know they are peddling falsehoods.",
    "As Elizabeth Warren correctly pointed out, Any country that elects Donald Trump is already in trouble.? Pew polls show a significant decline in public confidence in the government.",
    "In addition, they are openly intimidating local election officials, and recruiting people to take over those positions with the intent of changing the outcome of future elections.",
    "There is another group of relatively well-educated individuals who continue to support Trump despite the massive evidence of his incompetence, greed and psychological instability.",
    "With a combination of extreme personality disorder and advances in information technology, that menace is beyond anything the Founding Fathers could possibly have conceived.",
    "He stated, I've said it many times and it's no more true or real when we think about the events of January 6th.? He stated, We are in a battle for the soul of America.",
    "All of the states with close results in the 2020 presidential race have paper records of each vote, allowing the ability to go back and count each ballot if necessary.",
    "As indicated, there are tens of millions of those Deceived, and include a significant majority of Trump voters who still believe that Biden was not lawfully elected.",
    "Following acquittal, McConnell stated, There's no question, none, that President Trump is practically and morally responsible for provoking the events of the day.\"",
    "It will sneak up on us and leave us wondering how we could have been so blind.? In my view, we are already experiencing the precursors to a more intense conflict.",
    "A battle that by the grace of God and the goodness and greatness of this nation, we will win.?\nBiden later stated, Believe me: I know how difficult democracy is.",
    "Among the earliest to warn of the current situation were Steven Levitsky and Daniel Ziblatt in their New York Times op-ed piece dated December, 16, 2016 titled.",
    "Disturbingly, the Republican Party leadership, and tens of millions of mainly unsuspecting supporters, are like lemmings and are prepared to go over that cliff.",
    "It has been the speed of devolution, coupled with relentless attacks on venerable individuals and fundamental institutions, that some of us find surprising.",
    "There is another group of those Deceived who believe themselves to be Republicans based on a historical relationship, as opposed to specific policies.",
    "Noteworthy is that before he was elected in 2016, Trump was widely known to be a malignant cancer for the party and an existential threat to America.",
    "He initially condemned Trump, then betrayed America as he led the majority of Republicans voting to acquit him during the second impeachment trial.",
    "An inveterate narcissist, it is specious to think that he has personal allegiance to anyone but himself, a fact constantly ignored by the Deceived.",
    "However, on their later broadcasts that day, and for months to come, they continuously downplayed the seriousness of the events they had witnessed.",
    "Here too, we know the Deceivers of the media are cognizant of the lies they are spreading, and do so intentionally so as to increase their ratings.",
    "Obviously, Fox News Corp (FNC) leads in this category, with their main commentators spreading demonstrable false information at an astounding pace.",
    "When Darth Vader,? progenitor of the ill-advised invasion of Iraq, decries the GOP's political efficacy, you know the party is in serious trouble.",
    "(Think disruptive Jim Jordan, a supporter of the Big Lie, who personally had been interacting with Trump on that day)\nMcConnell is more enigmatic.",
    "There can be no soft-pedaling what happened and no absolution for those who planned, encouraged and aided the attempt to overthrow our democracy.",
    "In reality, all GOP members of the House and Senate who did not vote to impeach or convict Trump, are complicit, and in the Deceiver category.",
    "As former VP Dick Cheney noted, I'm deeply disappointed we don't have better leadership in the Republican Party to restore the Constitution.\"",
    "Competing for viewers, new networks, such as OAN and Newsmax, jumped into the fray and are infecting the public with even more exaggerations.",
    "Shamefully, it is cowardice and duplicity that now permeate part of our most legislatively important and deliberative political institutions.",
    "They usually cite data? as the rationale for their beliefs even though that information is overwhelmingly contradicted by credible sources.",
    "It is noteworthy that his own officials responsible for the security of the election stated that it was the most secure election ever held.",
    "These are politicians that place their reelection above the well-being of their constituents and their sworn duty to the U.S. Constitution.",
    "Then after he won that election, he raised doubts about the integrity of the vote count claiming there were millions of fraudulent votes.",
    "As has been pointed out, many of them were elected by the same voting machines and ballots that did not support the reelection of Trump.",
    "Despite the warnings of the Founding Fathers, this group of the Deceived have relatively low information intake or interest in politics.",
    "We know that what McConnell called a disgraceful dereliction of duty? was not sufficient for him to vote to uphold Trump's impeachment.",
    "GOP bomb-throwers, Matt Gaetz and Marjorie Taylor Greene, exemplify the cancerous cult that overtly works to undermine the Government.",
    "My experience with this group is that the common factor is actively seeking out information from sites that reinforce their beliefs.",
    "Across the country GOP officials continue to publicly spread the Big Lie and undermine American confidence in the electoral system.",
    "That leaves us worried about our nation and our future together.?\nRepeatedly President Biden has addressed the threat to democracy.",
    "Unfortunately, there are many of these people who are unaware that it is the party, not themselves, that has changed dramatically.",
    "If they took a closer look at the behavior of the party, and the actual policies that the GOP has endorsed, they might reconsider.",
    "Simply put, behavior is believable, and their inconsistent statements and actions betray them, just as they betray the country.",
    "Unfortunately, a majority of GOP officials are doing their utmost to undermine that trust and confidence in their constituents.",
    "Trump, during his term in office engendered considerable distrust with over 30,000 documented false or misleading statements.",
    "The Ohio Republican Party voted nearly unanimously to censure U.S. Rep. Anthony Gonzalez and nine other GOP representatives.",
    "Nonetheless, they are a danger to the country as they violate the admonition that the price of liberty is eternal vigilance.",
    "Terminally greedy, they do so at the expense of our country and their fellow Americans, but such is to be expected of them.",
    "I've been a Republican my entire life, and believe in what the Republican Party, at its best, has represented for decades.",
    "Their perceived transgression was acknowledging the evidence and voting to impeach the former President in February, 2021.",
    "The Republican Secretary of State, Brad Raffensperger, was censured by the party for doing his legally prescribed duties.",
    "However, based on their long-term emotional relationship to the party, it is unlikely we'll see any substantial movement.",
    "Demonstrating an extremely fragile ego, Donald Trump is prepared to bring down the country just to serve his own purpose.",
    "As I, and many others who are more astute, have been warning, the threat posed by the Deceivers is grave and existential.",
    "Given their inconsistent comments following the 6 January, 2021 insurrection, their feckless malleability is undeniable.",
    "Since the Civil War  the Confederates back then never breached the Capitol as insurrectionists did on January the 6th.",
    "Even before the 2016 election, Trump famously stated that he would accept the outcome of the election only if he won.",
    "None is more glaring than actions taken against Georgia Governor Brian Kemp for certifying the 2020 election results.",
    "Blatantly, they spread lies such as inferring that the 6 January, 2021 insurrection was generated by federal agents.",
    "Many of us wrongly believed that the foundations of the U.S. Government were so strong that they were invulnerable.",
    "In recent weeks many dignitaries have come forward to address the potential for destabilizing democracy in the U.S.",
    "That was the same theme employed after the 2020 election, and which he continues to erroneously claim to this day.",
    "It was his understanding that appointing and controlling the judiciary was the key to future success of the party.",
    "There is a third, very tiny subset, some of the very wealthy, who support Trump for their own financial interests.",
    "They have abject disdain for mainstream media,? yet believe information derived from relatively obscure sources.",
    "In July 2021 he stated, We're facing the most significant test of our democracy since the Civil War,? he said.",
    "This is now a party that punishes executives for properly conducting their constitutionally mandated duties.",
    "Continuous themes have been both the emphasis on the Big Lie, and that voting in general cannot be trusted.",
    "That certainly includes House Minority Leader, Kevin McCarthy, and Senate Minority Leader, Mitch McConnell.",
    "The Deceivers\nOf course, the senior leadership of the GOP in Congress constitutes the worst of the worst.",
    "That is far higher than any previous president and proves Ted Cruz correct; Trump is a pathological liar.",
    "While mens rea may be applicable in legal proceedings, we can know what is in the minds of these cretins.",
    "Now, former Senator Perdue is running on a platform that states he would not have certified the election.",
    "At the national level Republicans retaliated against Congresswoman Liz Cheney for voting her conscience.",
    "Once dubbed Bush's Brain, Karl Rove was the architect of much of the Republican platform for many years.",
    "All of these false statements serve to undermine faith in American democracy, but the Deceived love it.",
    "These are the willfully ignorant, many of whom come from a large group of lesser educated individuals.",
    "It is important to note that the Republican Party has made a profound shift in the past few decades.",
    "We did not send him there to do the right thing.?\nWe did not send him there to do the right thing.?.",
    "The Deceivers do have an agenda, to retain control as long as possible through any means necessary.",
    "The vast majority of Trump supporters fall into one of two categories, Deceivers and the Deceived.",
    "These are the people who understand just how corrupt Trump is, yet profess support for him anyway.",
    "In other words, he is specifically appealing to voters to support anti-constitutional activities.",
    "They ignore important warnings from those who have been close to Trump and burned in the process.",
    "The degradation in trust and confidence in government did not begin with the election of Trump.",
    "The largest group of Trump supporters are the Deceived, and there are tens of millions of them.",
    "For their repeated efforts, they are rewarded handsomely as fund-raisers by the nave Deceived.",
    "We must be clear about the major implications of the incessant erosion of American democracy.",
    "Following that, they wrote the prescient and critically important book, How Democracies Die.",
    "Emotionally wed to their beliefs, they appear to have lost their critical thinking skills.",
    "Since reaching a high of 77 in 1964, in recent years it has been hovering in the low 20s.",
    "Now, Rove has expressed great concern about the direction that the GOP has been taking.",
    "There are those who reject all evidence to the contrary of their presupposed position.",
    "Their suggestions/pleas, were that he take actions to call off the insidious attacks.",
    "All countries, and democracies in particular, rely on the confidence of their people.",
    "This process allows for the identification and correction of any mistakes or errors.",
    "The obvious incongruence is insufficient to dissuade their anti-American tendencies.",
    "Later, both reversed their positions, betrayed their oaths and the American people.",
    "Yes, they said they were proud of the 6 January attempt to overthrow the election.",
    "Many in this group of the Deceived are willfully ignorant and impervious to facts.",
    "In a Wall Street Journal op-ed, Rove wrote, We Republicans have a heavier burden.",
    "As Ball openly states, conscience? is not of concern to the main body of the GOP.",
    "Thus, legitimate civil discourse of competing ideas is frequently extinguished.",
    "Unfortunately, they have been quite successful in creating alternate realities.",
    "The results are that a once-accepted commonality of facts, no longer exists.",
    "That's exemplified by a surprising interview granted to NPR's Steve Inskeep.",
    "When pressed about the Big Lie, demonstrating his delicate ego, he hung up.",
    "It is well-established that voter suppression is one of the primary goals.",
    "With Trump, loyalty is a one-way street and unrequited fealty is demanded.",
    "GOP politicians are fearful of the ill-advised, but energized Trump base.",
    "Out of the political cacophony and instability, there are major winners.",
    "Unfortunately, these are most of the currently elected GOP officials.",
    "The Deceived\nThe Deceived Trump supporters come in several flavors.",
    "That is done for personal gain, and at the expense of the nation.",
    "Once trust and confidence are lost, the government cannot stand.",
    "That strategy was successful in bringing W to the White House.",
    "He too recognizes the blight that has overtaken the party.",
    "That, even after multiple recounts had been accomplished.",
    "For them such support is justified as self-preservation.",
    "The Implications\nAmerican democracy is in grave danger.",
    "Such is the saprogenic state of Republican leadership.",
    "And I'm crystal clear about the threats America faces.",
    "This is an added benefit for security and resilience.",
    "That alone does not bode well for American democracy.",
    "By far the worst group is comprised of the Deceivers.",
    "They claim they are proud of the work done that day.",
    "Trump's propensity for lying continues to this day.",
    "Like Trump, they are overt about their intentions.",
    "True, they held in 2021, but just barely.",
    "Is Donald Trump a Threat to Democracy?",
    "Unfortunately, they are not Americans.",
    "Can it get any more blatant than that?",
    "Love of country demands nothing less.",
    "I'm not saying this to alarm you.",
    "That's not hyperbole."
  ]
}