{
  "id": 785,
  "mediaId": 238,
  "date": "1/10/2022 12:00:00 AM",
  "headline": "Mo Brooks urged a Jan. 6 crowd to fight.' Now his actions long before the insurrection face new scrutiny.",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/01/10/mo-brooks-jan6-eric-swalwell-lawsuit-insurrection/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1732,
    1839,
    2475,
    3094,
    545,
    2537,
    2590,
    2945
  ],
  "sentences": [
    "Alexander has also said his role has been misportrayed; he told the committee in a statement that he was not an organizer of the rally at the Ellipse but was a VIP guest, and that his group was part of an event that didn't take place and did NOT start the chaos.?\nSwalwell's lawsuit, which he filed in U.S. District Court in D.C. in March 2021, alleges that Brooks conspired with Trump, Donald Trump Jr. and the president's former personal attorney, Rudolph W. Giuliani, to undermine the election results and that he directly incited the violence at the Capitol? with his Jan. 6 rally speech.",
    "We four schemed up of putting maximum pressure on Congress while they were voting,? with a plan to change the hearts and the minds of Republicans who were in that body, hearing our loud roar from outside.?\nWhen Brooks was asked about Alexander's video after the insurrection, his office said the congressman had no recollection of ever communicating in any way with whoever Ali Alexander is.? But Alexander said in a recent court filing after speaking to the Jan. 6 House committee that he had texted Brooks and had talked with the congressman's staff.",
    "Later that evening, Brooks told Fox Business, We did have some advance warning that there might be antifa elements masquerading as Trump supporters in advance of the attack on the Capitol.? Brooks then took the House floor to repeat his allegation without evidence that Democrats had promoted foreign massive interference? by helping illegal aliens and other noncitizens vote.?\nAfter Pence refused to buckle to pressure and certified Biden's win, Brooks continued describing mounting evidence? that the insurrectionists were members of antifa.",
    "And, the department argued in its brief, if the allegation is true that Brooks incited the insurrection, Instigating such an attack plainly could not be within the scope of federal employment.?\nBy his own admission, he was acting in campaign mode, not as an official act, and that kind of doomed his request,? Lofgren said, referring to Brooks's statement in a court filing that his speech at the Jan. 6 rally was focused on the need for Republicans to win the 2022 and 2024 elections.",
    "Phil Andonian, Swalwell's lawyer, said in an interview the case is unique because one member has alleged that another member has engaged in an insurrection with the purpose of invaliding the results of a presidential election.?\nIn his court filings, which he signed as his own lawyer, Brooks argued that he should be immune from the lawsuit, citing how the Justice Department has often protected members of Congress from being sued over speech made in an official capacity.",
    "He tweeted that he would be very hesitant? to certify the election if Biden was declared the winner because I lack faith that this was an honest election.?\nThen, laying the groundwork to challenge the results, Brooks on Nov. 7 urged Trump to fight Biden's unlawful victory claims? and said he would refuse to certify electoral college votes in states where illegal votes distorted the will of the people.?\nHe pressed his case with a litany of unfounded claims.",
    "But Brooks not only stood by his invocation of Hitler's words, he went after the commission's members, wondering if they had joined America's Socialist Democrats? in embracing the  'Big Lie'  that President Trump colluded with the Russians to steal the 2016 presidential race.?\nDan Puckett, chairman of the Alabama Holocaust Commission, who was appointed by a Republican governor, said in an interview that there was no basis to Brooks's allegation.",
    "He was there Jan. 5 when, shortly before going to sleep, he tweeted that Trump had asked him personally to speak & tell the American people about the election system weaknesses that the Socialist Democrats exploited to steal this election.?\nThe next morning, Brooks slipped into body armor underneath a yellow-and-black jacket, and then delivered an incendiary speech to a sea of Trump backers near the White House.",
    "Brooks told Politico later that day: It was a back-and-forth concerning the planning and strategy for January the 6th.?\nBrooks was ecstatic, writing on Facebook that now Congress could reject the electoral college votes from states with badly flawed election systems.?\nOn Jan. 4, 2021, Brooks later said on Twitter, he was told by an unnamed congressman that it would be dangerous to go home.",
    "In early January 2021, as President Donald Trump summoned his supporters to Washington, Rep. Mo Brooks says he received a dire warning from a fellow lawmaker: Antifa was planning to infiltrate the Jan. 6 rally dressing like Trump supporters.?\nThe Alabama Republican was so convinced that his life was in danger that he stopped going home and began sleeping on his office floor.",
    "We simply wanted to call out something that was improper.?\nIn response to questions about the speech from The Post, Brooks's spokesman said the congressman accurately noted the history of the Big Lie' political tactic and its perfection by the evil Adolph Hitler.?\nDays after the Nov. 3 election, as it became increasingly clear Trump had lost, Brooks ratcheted up his claims.",
    "I was the only one willing to go out on that limb and say, Look, I've looked at it, and in my judgment, there was massive voter fraud, election theft.' ?\nBrooks's actions are now the subject of a novel lawsuit brought by Rep. Eric Swalwell (D-Calif.) that accuses him of conspiring with Trump and others to undermine the election and help incite the insurrection.",
    "A review of his speeches, tweets and media appearances as well as affidavits and other court filings reveals his central part in mobilizing the effort to overturn Joe Biden's victory by repeatedly claiming that the election was stolen and then becoming the first member of Congress to declare he would challenge the electoral college results.",
    "That's not true  He admitted he showed up at the rally in body armor, making really extravagant comments about overturning the election and urging people to take action.?\nBrooks  who has denied any intent to spark the attack on the Capitol and said he was merely urging protesters to battle at the ballot box  declined an interview request.",
    "That same day, Brooks wrote on Twitter there were only 3 bad options? when people lose faith in the election: flee the country, submit to the opposition, or fight back with violence.?\nIn March, Brooks was pressed about FBI Director Christopher A. Wray's testimony that he had not seen evidence of antifa's involvement in the insurrection.",
    "He slammed Trump as a serial adulterer? who lacked moral values,? and told Al.com that even if Trump became the nominee, I will not publicly support, or endorse with my reputation, someone who I know to have such huge character flaws and is dishonest.?\nAfter Trump won, Brooks learned what it meant to be in his disfavor.",
    "Alexander's lawyer, G. Baron Coleman, said the text was normal,? exonerates both men and shows that there was no talk of seditious plots as speculated by left-wing conspiracy theorists.?\nIn the following three weeks, several dozen members of Congress joined Brooks in saying they would challenge the election results.",
    "Asked about Barr's statement that he had seen no evidence of significant fraud, Brooks responded: No, that's false.?\nOne year after the insurrection, Brooks could soon be forced in federal court  and potentially before the Jan. 6 committee  to clarify his role on that day and answer for his actions in the lead-up.",
    "Whatever claims he made in his tweets and speech, Brooks said in the filing, they were within the scope of employment as a United States Congressman.?\nOn those grounds, for the purpose of arguing his immunity defense, he concluded in his filing, It makes no difference whether Brooks is right or wrong.?",
    "But if Congressman Brooks is asked to testify, the testimony must be in public, not in secret and not denying the American people their right to hear the entirety of testimony by any and all witnesses,? the statement said, lambasting the House's Witch Hunt Committee? as politically motivated.",
    "A leading opponent in the tight primary race has also called for a nationwide forensic audit? of the election, and claims that the election was stolen are still so popular in Alabama that Brooks was booed at a Trump rally in August when he suggested it was time to look beyond 2020.",
    "Brooks changed his view, Griffith said in an interview, because Trump won the Republican primary.?\nBrooks, in a court filing, has attributed his political actions to my desire to represent the will of my employer,? referring to constituents who overwhelmingly voted for Trump.",
    "He also said he talked to the congressman's staff about a Dear Colleague' letter and how his activists could be helpful.? He said in the court filing that he turned over thousands of records? to the committee, but he is fighting a request to turn over other material.",
    "Then on Dec. 2, Brooks became the first member of Congress to announce that he planned to challenge the electoral college vote on Jan. 6. Donald Trump won the electoral college by a significant margin, and Congress's certification should reflect that,? Brooks said.",
    "Brooks denied the allegation, saying in a statement, This accusation is despicable and total, utter and complete, unadulterated bovine excrement.?\nAnother hour passed, as Brooks speculated on Twitter that the rioters were members of antifa wearing Trump hats.",
    "After starting as a traditional conservative, serving as a district attorney and county commission member, Brooks became a leading anti-Trumper in Congress before abruptly turning into one of Trump's most loyal backers on false claims of mass election fraud.",
    "Having been an assassination target on a baseball field in 2017, Congressman Brooks took such advice seriously and spent nights in the Capitol complex,? Brooks's spokesman said in the statement, referring to a shooting that wounded Rep. Steve Scalise (R-La.",
    "The morning of Jan. 6, Brooks put on body armor, he later told Slate, and then gave a 10-minute speech to Trump supporters on the Ellipse, attacking Republicans who refused to make the simple choice? of refusing to certify the election results.",
    "He would later allege that Democrats had rigged 11 out of the 45 voting machines that day to vote for everyone on the ballot but me.? After he won the race, a rare Republican victory in a then-heavily Democratic state, he dropped the matter.",
    "Brooks defended his policy, saying at the time, I don't know why some prosecutors feel retailers are a lesser class of victim.?\nBrooks made his way to Washington in 2010, winning a House race after serving on the Madison County commission.",
    "He could be pressed on the extent of his staff's communication with Stop the Steal? organizer Alexander, his reason for wearing a bulletproof vest on Jan. 6 and the source of the warning he says he received that the day could turn violent.",
    "In the wake of that filing, Brooks's office confirmed that the congressman had in fact received a text from Alexander in mid-December about the group's protests, which would be capped by events Jan. 6. Congressman, this is Ali Alexander.",
    "The congressional committee investigating the insurrection is weighing whether to seek testimony from Brooks and has cited his invitation to deliver a Jan. 6 speech in a subpoena to the White House official who invited him to the rally.",
    "So I would agree that the Black Lives Matter and antifa presence to date seems to be relatively insignificant, certainly much less significant than I thought, around Jan. 6, based on the information I had,? Brooks said on CSPAN.",
    "Two weeks later, Ali Alexander, an organizer of the Stop the Steal? movement, said in a video that he worked with Brooks and other members of Congress to plan how to push lawmakers into blocking Biden's certification.",
    "And he said in a court filing that his tweet saying Trump personally? asked him to appear at the rally was false; he blamed an unnamed staffer for the tweet and said the invite came from a White House official.",
    "Brooks quickly alienated some staffers by ordering them to emphasize harsher charges for lesser offenses, such as prosecuting shoplifting cases of $25 or more as a felony, according to the news service Al.com.",
    "In response to a list of questions from The Washington Post, his campaign spokesman said in a statement via email that Brooks has not received questions from the committee, or talked or corresponded with it.",
    "On Dec. 21, 2020, Brooks went with other Republicans to a White House meeting with Trump and a separate meeting with Vice President Mike Pence, who would preside over the counting of electoral college votes.",
    "He was cheering on the fact that the 117th Congress had started this way, and that was much to the dismay of others in the room.? O'Toole told The Post he stood by his statement and declined further comment.",
    "As the committee turns to the public phase of its inquiry, it expects to learn more about Brooks's role in the effort to overturn the election and what led the White House to ask him to speak at the rally.",
    "In seeking financial damages, Swalwell's case could provide a pathway to accountability that Congress  which failed to convict Trump in an impeachment trial after the insurrection  so far has not mustered.",
    "I strongly encouraged people to take down names and kick ass in an election way  all those words I used, by the way, are in the Bible,? he said on Matt Murphy's radio show the day after the insurrection.",
    "Are you willing to do what it takes to fight for America??\nBrooks has faced intense scrutiny over his fiery rhetoric that morning to a crowd that soon stormed the U.S. Capitol in a violent attack.",
    "Trump, who is a defendant in Swalwell's lawsuit, as well as several others that do not name Brooks, is seeking to dismiss the suit on grounds of presidential immunity and First Amendment rights.",
    "At a hearing on Monday, according to his court filing, he plans to argue that he should be dismissed as a defendant because he spoke in his official, not personal, capacity at the Jan. 6 rally.",
    "Brooks soon became a politician transformed, determined to win over Trump  a change his critics attributed to his political ambitions and reading of Alabama's overwhelming support for Trump.",
    "On March 25, 2019, Brooks took to the House floor to castigate Democrats by quoting from Adolf Hitler's memoir, Mein Kampf,? about the power of using a big lie? to mislead a gullible public.",
    "Brooks's role is even more remarkable given that until Election Day in 2016, few Republicans had spoken more loudly than Brooks to warn voters that nothing said by Trump should be trusted.",
    "In Nevada, he said, there were over 130,000 votes identified that were illegal,? adding that 40,000 voted twice? and you've got dead people voting.? (Biden won by 33,596 votes.)",
    "Brooks then returned to the House and tweeted at 1:16 p.m., FIGHT FOR AMERICA'S REPUBLIC IS ON!?\nAs Brooks realized what was happening, he tweeted at 2:18 p.m. DOORS LOCKED!",
    "In fact, there was no evidence of significant fraud in any state in the presidential election, a finding twice endorsed by Trump's then-attorney general, William P. Barr.",
    "When Brooks mounted a failed bid for the U.S. Senate in a special election in 2017  and his anti-Trump rhetoric received new attention  Trump backed an opponent instead.",
    "Brooks has cited the incident to explain his focus on voter fraud  although journalists have not turned up any findings by state or federal authorities about the claim.",
    "He said at one time that he could not imagine Trump being a president,? said former representative Parker Griffith (D), who lost his U.S. House seat to Brooks in 2010.",
    "Speaking on Fox News Radio on Dec. 3, he said Congress could overturn election theft,? saying Trump's supporters needed to emulate the defenders of the Alamo.",
    "Brooks's speech drew outrage from Jewish groups, including the Alabama Holocaust Commission, whose members are appointed by the governor and other officials.",
    "Brooks has denied the allegations and is expected to represent himself in U.S. District Court on Monday, arguing that he should be dismissed from the case.",
    "Brooks's extraordinary efforts to subvert the election were the culmination of a political transformation mirroring the GOP's larger embrace of Trump.",
    "Ryan O'Toole, who at the time was cloakroom director for House Minority Leader Kevin McCarthy (R-Calif.) and now is an aide to Rep. Liz Cheney (R-Wyo.",
    "Jack has been subpoenaed by the congressional investigative committee, which noted in a letter that it wanted to know more about Brooks's invitation.",
    "The idea that I would encourage and incite violence on myself, my friends, and my colleagues is absurd,? he said in a Jan. 12, 2021, statement.)",
    "It was Election Day 1982 in northern Alabama, and Brooks was awaiting the results of his first bid for public office, a seat in the state House.",
    "Now, our ancestors sacrificed their blood, their sweat, their tears, their fortunes and sometimes their lives  Are you willing to do the same?",
    "Jan. 6th is a big moment for our republic.?\nBrooks's office called it 100 % benign? and said it found no other communication with Alexander.",
    "But as the young Duke and University of Alabama School of Law graduate watched the votes come in, something seemed wrong to him.",
    "Brooks served in the Alabama House for nearly a decade before he was appointed in 1991 as district attorney for Madison County.",
    "The Jan. 6 committee also has left open the option of referring information to the Justice Department for possible prosecution.",
    "Rep. Zoe Lofgren (D-Calif.), a member of the committee, said she has long been concerned by her colleague's words and actions.",
    "When Trump declared his candidacy in 2015, Brooks instead backed Sen. Ted Cruz (R-Texas) and became a leading Trump attacker.",
    "Jack, the former White House political director who invited Brooks, is one of the sources who could provide information.",
    "SPEAKER LEAVES!? (Brooks later cited his presence in the House as evidence that he didn't help spark the insurrection.",
    "He has acknowledged that he was wrong to suggest antifa may have played a significant role in the insurrection.",
    "Alexander, meanwhile, said in a court filing that the committee asked him about his communication with Brooks.",
    "Brooks showed the extent of his newfound devotion when Democrats sought to impeach Trump for the first time.",
    "Now he's running for the U.S. Senate with Trump's endorsement and is still campaigning on those falsehoods.",
    "He said he testified that he had sent the text message but had no phone conversation with the congressman.",
    "But the department has rejected that argument, saying Brooks's Jan. 6 speech was a campaign-related event.",
    "); the spokesman declined to name the various congressmen? who allegedly warned Brooks of the threat.",
    "I led the charge,? Brooks, 67, said on a podcast hosted by Stephen K. Bannon, Trump's former adviser.",
    "I don't think you can trust Donald Trump with anything he says,? Brooks told MSNBC in February 2016.",
    "Brooks said, for example, there were likely in the millions? of noncitizens who cast illegal votes.",
    "Seven assistant district attorneys quit, most in protest of Brooks's emphasis on conviction rates.",
    "Now Brooks, who so far has acted as his own lawyer in the case, is slated to appear in court.",
    "Trump and associates at the White House, meanwhile, discussed who should speak at the rally.",
    "Republican members themselves, men crying in the cloakroom for their safety,? O'Toole said.",
    "He did publicly say over and over things that were not true,? Lofgren said in an interview.",
    "Today is the day American patriots start taking down names and kicking ass,? Brooks said.",
    "But Brooks didn't shy away from perpetuating the claim that the election had been stolen.",
    "But less public attention has been paid to Brooks's key role in the lead-up to Jan. 6.",
    "It was shocking to hear Mein Kampf' quoted on the floor of the House,? Puckett said.",
    "He said Georgia poll workers lied? about their work and hid suitcases of ballots.",
    "But he needed at least one senator to join him for the challenge to begin.",
    "We need to stand up and vigorously fight to the last breath,? he said.",
    "Brooks has recanted or distanced himself from some of his statements.",
    "On Jan. 5, White House political director Brian Jack invited Brooks.",
    "An array of court challenges to the election have been dismissed.",
    "He denied that his speech encouraged anyone to storm the Capitol.",
    "Giuliani and Trump Jr. have denied the claims in Swalwell's suit.",
    "After weeks of promoting that claim, Brooks finally backed down.",
    "Brooks began sleeping on his office floor that night.",
    "(Swalwell did not respond to a request for comment.)",
    "I am the founder of Stop the Steal,? the text said.",
    "Day by day, Brooks ratcheted up his rhetoric.",
    "One member, Mo Brooks, for example, was glad.",
    "), told CNN that he heard Brooks celebrate.",
    "It wasn't that we were going after anyone.",
    "He said the election had been stolen.",
    "Members were fearful for their lives.",
    "(Biden won by about 12,000 votes.)",
    "At first, it was pretty lonely.",
    "Jack declined to comment.",
    "CAPITOL COMPLEX BREACHED!",
    "We stand ready to help.",
    "CHAMBER DOORS LOCKED.",
    "My answer is yes.",
    "Louder!"
  ]
}