{
  "id": 788,
  "mediaId": 132,
  "date": "1/9/2022 12:00:00 AM",
  "headline": "Jan. 6 anniversary, Biden's speech and LIPA",
  "image": "https://cdn.newsday.com/polopoly_fs/1.50470715.1641587286!/httpImage/image.jpg_gen/derivatives/landscape_1280/image.jpg",
  "link": "https://www.newsday.com/opinion/letters/newsday-opinion-reader-letters-jan-6-anniversary-lipa-1.50470714",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Newsday Readers",
  "authorUrl": "",
  "termIds": [
    2087,
    2087,
    1147,
    1147,
    305,
    305,
    289,
    289,
    411,
    411,
    2945,
    2945,
    2959,
    2959
  ],
  "sentences": [
    "Rioters try to break through a police barrier at the Capitol in Washington on Jan. 6, 2021. Credit: AP/John Minchillo\nJan. 6 was violent, regardless of view\nThe Merriam-Webster dictionary defines violence as \"the use of physical force so as to injure, abuse, damage, or destroy.\"",
    "I bring up this point because an associate of mine recently filed a Freedom of Information Law letter to ask LIPA just how much debt was still owed on the defunct Shoreham nuclear plant  the very reason why LIPA was formed in the first place.",
    "Sadly, they were incited to be on a destructive mission to create fear and terrorize members of Congress to subvert the most sacrosanct constitutional process and the American people's mandate, the election certification.",
    "Transitioning Long Island's electric transmission and distribution system to a full public entity will have clear, unambiguous accountability to ratepayers while eliminating shareholder demands for more profit.",
    "Does their definition include that more than 100 people must be injured or killed, that more windows have to be broken, that more nooses have to be constructed or more Capitol property has to be destroyed?",
    "Appallingly, Jan. 6, 2021, has gone down as one of the darkest days in the history of modern America and a lesson that our great democracy's strength as well as weakness lies in the hands of its people.",
    " Atul M. Karnik, Woodside\nBiden's speech at the Capitol on the mark\nPresident Joe Biden's Jan. 6 address to America is one for the ages [\"Biden warns of Dagger at throat of democracy,' \"News, Jan. 7].",
    "He reminded us of former President Donald Trump's neglectful stewardship of this nation during his tenure, especially as he watched on television the insurrection from the safety of the White House.",
    "This was demonstrated with the abysmal restoration performance with the technical instability of mission-critical computer systems that acted as PSEG Long Island's backbone during Hurricane Isaias.",
    "The result: The top National Grid executive, John Bruckner, was promoted to lead the U.S. electricity operations while the LIPA CEO who had the oversight responsibility resigned.",
    "This decision-making is made with zero oversight, only hollow bureaucratic recommendations by the Department of Public Service and monthly LIPA board meetings of platitudes.",
    "Bender added, \"There were certainly outlier people who were not peaceful and were breaking through the windows and stuff like that, but I wasn't aware of overt violence.\"",
    "One point in the article that caught my attention was the assessment that the LIPA-run public power model would lead to, among other things, \"increased transparency.\"",
    "Municipalization is supported by the public and numerous elected leaders, so why do ratepayers have to wait 15 months for a study to determine what we all want now?",
    "It will always be a stark reminder that respecting democracy's framework is our responsibility and dissenting peacefully is ingrained in the democratic process.",
    "Instead, he was stalled for 52 days and then was hit with a voluminous document dump that contained everything about LIPA except the answer to his question.",
    "Since the \"invention\" of the Long Island Power Authority public-private partnership 20 years ago, numerous false promises of reliability have been made.",
    "As noted, the defining moment of electric service stability is upon the ratepayer [\"The good, bad of a fully public power utility,\" News, Dec. 29].",
    "This was glaring with the abysmal Superstorm Sandy restoration efforts that left a good portion of Long Island without power for at least 10 days.",
    "According to the article \"Poll: Most in GOP say Jan. 6 wasn't very violent,\" most Republicans feel the events weren't that violent [News, Jan. 5].",
    "A very simple request that would normally take a few minutes and a few clicks of a mouse for most people inside the LIPA bureaucracy to produce.",
    "Don't be fooled that decisions are being made in the best interest of ratepayers and not PSEG's shareholders because, as shown, they are not.",
    "To me, this is highly suspicious behavior of a disingenuous bureaucracy that's acting like it is being transparent, but really isn't.",
    "Perhaps they need to be shown the videos again, especially the one of a police officer screaming while being crushed by protesters.",
    "These failings can be attributed to one primary reason: decision-making at the executive level of PSEG LI, the current \"partner.\"",
    "What made this shameful behavior reprehensible was the violence and vandalizing of property by the rampaging intruders.",
    "Paul Bender, a self-described Cleveland conservative, said, \"My understanding was that a lot of it was pretty peaceful.",
    "It is not surprising that no Republicans, other than Rep. Liz Cheney of Wyoming, attended the memorial at the Capitol.",
    "Who are these people who believe that former President Donald Trump is not responsible for any wrongdoing?",
    " Emily Lester, East Setauket\nI wonder what video of the Jan. 6 insurrection these people were watching.",
    " Howard Litwak, Melville\nOne year ago, the strength and fragility of democracy was tested in America.",
    "Peter Schlussler, Mount Sinai\nThe writer is a former member of the LIPA Oversight Committee.",
    "What would someone have to do to make these people agree that Jan. 6 was extremely violent?",
    "I've had more than enough of Republicans denying what was recorded on video at the scene.",
    "Yet we're again told: Wait, give us another try  this new contract will fix everything.",
    "Only 4 of 10 say they thought the insurrection was very violent or extremely violent.",
    "I've seen some video of the people just like marching in through a velvet rope.\"",
    "If Jan. 6 wasn't that violent, why were people running for their lives to hide?",
    "Matthew Lulley, Melville\nThe writer is president of Hauppauge-based PGP Energy.",
    "Subsequent attempts to get the answer to this question have been ignored.",
    "What about our politicians cowering in offices and hiding places?",
    " Sue Parker, Stony Brook\nWhy is LIPA making us wait yet again?",
    "I wonder what the Republicans' definition of violence is.",
    "Perpetrators rarely return to the \"scene of the crime.\"",
    "Kudos for his forceful, impassioned delivery.",
    "So my question is, what is LIPA hiding?",
    "No overt violence?",
    "Not very violent?"
  ]
}