{
  "id": 792,
  "mediaId": 112,
  "date": "1/8/2022 12:00:00 AM",
  "headline": "Sen. Thune of South Dakota, the No. 2 Republican, says he'll seek 4th term",
  "image": "https://images.mktw.net/im-273429?width=700&size=1.4988290398126465&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/sen-thune-of-south-dakota-the-no-2-republican-says-hell-seek-4th-term-01641672400",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    1091,
    1464,
    1765,
    1963,
    2005,
    3094,
    428,
    571,
    2550,
    2910,
    2911
  ],
  "sentences": [
    "That work continues, which is why after careful consideration and prayer, and with the support of my family, I'm asking South Dakotans for the opportunity to continue serving them in the U.S. Senate.?\nBoth parties are fighting for control of a closely divided Senate in 2022.",
    "Thune in 2016 carried South Dakota by nearly 72% of the vote, but Trump's suggestion in 2020 that he should face a primary challenger emboldened some Republicans who argued he had not shown enough loyalty to the former president.",
    "Two of the 10 current House Republicans who voted last January to impeach Trump after he goaded supporters to attack the Capitol have also decided to leave office: Reps. Anthony Gonzalez of Ohio and Adam Kinzinger of Illinois.",
    "Should Thune prevail in a primary or if Trump fails to find a credible rival to oppose him, Trump risks being seen as having diminished sway within the party.",
    "As Thune considered retiring, powerful Republicans, from McConnell to Sen. Lindsey Graham of South Carolina, urged him to seek another six-year term.",
    "Thune's choice signals a willingness to defy Trump, whose clout has often forced other previously politically secure Republicans to leave Congress.",
    "In addition, Wyoming Rep. Liz Cheney was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "However, he had openly expressed hesitation about running for another term, calling it a family decision? as he mulled it over in recent months.",
    "I've always promised that I would do the work, even when it was hard, uncomfortable, or unpopular,? Thune said in a statement on Twitter.",
    "Thune, who is South Dakota's elder GOP statesman, has $14.8 million in campaign cash, according to the most recent federal report.",
    "Elected Republicans who have previously crossed Trump and subsequently retired include former Republican Sens.",
    "He has served in Congress for 22 years and ushered in a period of Republican dominance over state politics.",
    "Thune is a likely successor to Sen. Mitch McConnell as the leader of the GOP's Senate caucus.",
    "A handful of little-known Republicans have said they would challenge Thune.",
    "Jeff Flake of Arizona and Bob Corker of Tennessee."
  ]
}