{
  "id": 795,
  "mediaId": 178,
  "date": "1/8/2022 12:00:00 AM",
  "headline": "GOP Sen. John Thune of South Dakota says he'll seek 4th term",
  "image": "https://chorus.stimg.co/23154954/merlin_65965451.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/gop-sen-john-thune-of-south-dakota-says-hell-seek-4th-term/600133874/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STEPHEN GROVES",
  "authorUrl": "",
  "termIds": [
    1963,
    1963,
    1765,
    1765,
    1147,
    1147,
    1464,
    1464,
    146,
    146,
    428,
    428,
    571,
    571,
    2911,
    2910,
    2911,
    2910,
    2906,
    2906
  ],
  "sentences": [
    "Senator who actually wants the job and will deliver on important issues like healthcare, education, and good-paying jobs, and that's why it is so important to elect a Democrat,\" Randy Seiler, the state Democratic Party's chair, said in a statement.",
    "Thune in 2016 carried South Dakota by nearly 72% of the vote, but Trump's suggestion in 2020 that he should face a primary challenger emboldened some Republicans who argued he had not shown enough loyalty to the former president.",
    "But he has a clear path to reelection in reliably-red South Dakota even after he drew the ire of then-President Donald Trump late in 2020 for speaking out against his attempt to overturn the results of the presidential election.",
    "Two of the 10 current House Republicans who voted last January to impeach Trump after he goaded supporters to attack the Capitol have also decided to leave office: Reps. Anthony Gonzalez of Ohio and Adam Kinzinger of Illinois.",
    "\"That work continues, which is why after careful consideration and prayer, and with the support of my family, I'm asking South Dakotans for the opportunity to continue serving them in the U.S.",
    "Democrats seized on Thune's hesitation, pointing out that Brian Bengs, a military veteran and lawyer from Aberdeen, had already jumped into the race in November.",
    " U.S. Sen. John Thune of South Dakota, the second-ranking Republican leader in the Senate, announced Saturday he is seeking reelection to a fourth term in 2022.",
    "Should Thune prevail in a primary or if Trump fails to find a credible rival to oppose him, Trump risks being seen as having diminished sway within the party.",
    "Thune, who is South Dakota's elder GOP statesman, has served in Congress for 22 years and ushered in a period of Republican dominance over state politics.",
    "As Thune considered retiring, powerful Republicans, from McConnell to Sen. Lindsey Graham of South Carolina, urged him to seek another six-year term.",
    "Thune's choice signals a willingness to defy Trump, whose clout has often forced other previously politically secure Republicans to leave Congress.",
    "However, he had openly expressed hesitation about running for another term, calling it a \"family decision\" as he mulled it over in recent months.",
    "In addition, Wyoming Rep. Liz Cheney was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "Since then, Thune has offered restrained criticism of Trump's political imitators at times, but mostly focused on scuttling the Democrats' plans.",
    "Graham said Saturday on Twitter that Thune's decision is \"good news for all those who appreciate practical and strong conservative leadership.\"",
    "\"I've always promised that I would do the work, even when it was hard, uncomfortable, or unpopular,\" Thune said in a statement on Twitter.",
    "Elected Republicans who have previously crossed Trump and subsequently retired include former Republican Sens.",
    "Thune is a likely successor to Sen. Mitch McConnell as the leader of the GOP's Senate caucus.",
    "Thune has $14.8 million in campaign cash, according to the most recent federal report.",
    "Thune, who turned 61 on Friday, has mulled retiring from the Senate for months.",
    "A handful of little-known Republicans have said they would challenge Thune.",
    "Both parties are fighting for control of a closely divided Senate in 2022.",
    "___\nAssociated Press writer Alan Fram contributed from Washington.",
    "Jeff Flake of Arizona and Bob Corker of Tennessee.",
    "\"South Dakotans deserve a U.S.",
    "SIOUX FALLS, S.D.",
    "Senate.\""
  ]
}