{
  "id": 796,
  "mediaId": 112,
  "date": "1/7/2022 12:00:00 AM",
  "headline": "Absence, silence, pugnacity: How Republicans marked anniversary of Jan. 6 siege on U.S. Capitol",
  "image": "https://images.mktw.net/im-463746?width=700&size=1.5477629987908101&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/absence-silence-pugnacity-how-republicans-marked-anniversary-of-jan-6-siege-on-u-s-capitol-01641570745",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    1765,
    1765,
    1609,
    1877,
    1877,
    2493,
    2493,
    1609,
    1248,
    1248,
    1147,
    1147,
    428,
    428,
    2661,
    2661
  ],
  "sentences": [
    "I am deeply disappointed at the failure of many members of my party to recognize the grave nature of the January 6 attacks and the ongoing threat to our nation.?\nFrom the archives (November 2021): Wyoming Republicans vote that Liz Cheney is no longer a member of their party\nKarl Rove, who served as deputy chief of staff in the Bush administration and advised Trump at points during the 2020 campaign, wrote an op-ed in the Wall Street Journal addressing those in his own party who for a year have excused the actions of the rioters who stormed the Capitol, disrupted Congress as it received the Electoral College's results, and violently attempted to overturn the election.?\nThere can be no soft-pedaling what happened and no absolution for those who planned, encouraged and aided the attempt to overthrow our democracy.",
    "Associated Press\nRepublican side of House aisle populated only by Rep. Liz Cheney and her father, former U.S. vice president Dick Cheney, as Democrats convened to mark the anniversary by honoring Capitol Police and Washington, D.C., law enforcement\nNEW YORK (AP)  Just a year ago, many Republicans joined Democrats in reacting with horror to the Capitol insurrection, denouncing both the violence perpetrated by the rioters and the role played by former President Donald Trump in stoking the outrage that fueled their actions with lies about a stolen? election.",
    "From the archives (December 2019): Republican infighting breaks out as Georgia governor appears to disagree with Trump over whom to pick for Isakson's open Senate seat\nIndeed, during a moment of silence held in honor of law-enforcement officers, only two Republicans were present in the House chamber: Rep. Liz Cheney of Wyoming, who has become a pariah in her party over her criticism of Trump's actions, and her father, former Vice President Dick Cheney.",
    "From the archives (July 2021): This is how I'm going to die,' Capitol Police officer recalls thinking in midst of Jan. 6 insurrection\nFrom the archives (January 2021): QAnon supporters losing trust in the plan' with Biden inaugurated, Trump in Florida and no storm' materializing\nI think it's going to end up being just a politicized Charlie Foxtrot today,? he said, using military slang for a chaotic situation.",
    "Then he pivoted to politics, characterizing the speeches by President Joe Biden and Vice President Kamala Harris at the Capitol as an effort to resurrect a failed presidency more than marking the anniversary of a dark day in American history.?\nTheir brazen attempts to use January 6 to support radical election reform and changing the rules of the Senate to accomplish this goal will not succeed,? he wrote.",
    "I am deeply disappointed at the failure of many members of my party to recognize the grave nature of the January 6 attacks and the ongoing threat to our nation.'\n Dick Cheney, the former Republican vice president, defense secretary and congressman\nShe accused Cruz of disrespecting MAGA patriots? and people that rioted at the Capitol and did breach the Capitol.?\nShame on Ted Cruz,? she said.",
    "From the archives (July 2021): What one Indiana congressman's trips to Bedminster, N.J., and the border with Mexico say about the future path of the Republican Party\nCounterprogramming\nWhile Trump canceled the anniversary news conference he'd been planning in Florida for Thursday, several of his most ardent followers scheduled their own counterprogramming.",
    "Also saying nothing were former Secretary of State Mike Pompeo, who has been laying the groundwork for a possible 2024 campaign by highlighting the Trump administration's successes, and former Ambassador to the United Nations Nikki Haley, who found herself on the wrong side of the party's base when she criticized Trump immediately after the insurrection.",
    "In a statement, McConnell called Jan. 6 a dark day for Congress and our country? after the seat of the first branch of our federal government was stormed by criminals who brutalized police officers and used force to try to stop Congress from doing its job.?\nBut he also criticized Democrats for what he said was their politicization of the attack.",
    "They are going to take this and milk this for anything they could to try to be able to smear anyone who ever supported Donald Trump.?\nHe lashed out at those who have compared the gravity of what happened on Jan. 6 to the Sept. 11, 2001, terror attacks and said most Florida residents have other issues on their minds.",
    "I think it's going to be nauseating, quite frankly.?\nNo comment\nOther potential 2024 candidates, meanwhile, stayed conspicuously silent, underscoring the complicated calculus they face in a party in which Trump remains very much in charge, with the support of wide swaths of the primary-voting electorate.",
    "We're proud of the work that we did on Jan. 6 to make legitimate arguments about election integrity.?\nGreene slammed Republican Sen. Ted Cruz of Texas, another potential 2024 contender, for having characterized the anniversary as an event marking a violent terrorist attack on the Capitol? Wednesday.",
    "We're ashamed of nothing,? said GOP Rep. Matt Gaetz of Florida during an appearance with Georgia Rep. Marjorie Taylor Greene on a podcast hosted by former Trump strategist Steve Bannon, who has been indicted for defying a subpoena from the House committee investigating the insurrection.",
    "No question about it,? McConnell said then, calling it a disgraceful, disgraceful dereliction of duty.?\nThen vs. now\nLike McConnell, Republican Sen. Lindsey Graham, a friend and ally of the former president, was clear in his denunciation of Trump immediately following the Jan. 6 attack.",
    "The old guard\nThe GOP's transformation into the Party of Trump came perhaps most clearly into focus as former Vice President Dick Cheney paid an unexpected visit to the Capitol to support his daughter, who has become one of the most prominent anti-Trump voices.",
    "McCarthy, the Republican leader in the House who had reportedly clashed a year earlier with Trump during a phone conversation in which he called on the then-president to call on his followers to retreat, issued no known public statement on the anniversary.",
    "Pence has said that he and the former president will likely never see eye to eye? on the events of Jan. 6 and has defended his role that day in rejecting Trump's demands that he overturn the election results  something he did not have the power to do.",
    "Cruz later appeared on Fox News to walk back his comments, apologizing profusely for his phrasing that he said had been sloppy? and frankly dumb,? though consistent with his statements in the past about people who attack and obstruct police.",
    "From the archives (July 2021): Trump and allies work to rebrand Jan. 6 rioters as patriots, heroes and martyrs\nMissing in action\nThe party's top congressional leaders were missing from Thursday's commemoration events at the Capitol.",
    "Asked what he made of Republican leadership's handling of the anniversary, Cheney, who served under George W. Bush, was glib in his assessment of an institution that has all but been remade in Trump's image.",
    "At the same time, he has accused the media of reporting on the attack to demean? Trump's supporters and to distract from the Biden administration's failed agenda,? as he said on Fox News in October.",
    "Former Vice President Mike Pence  who fled for his life on Jan. 6 as rioters broke into the Capitol, chanting Hang Mike Pence!?  did not not make or release any statement marking the occasion.",
    "Speaking to reporters in Florida on Thursday morning around the same time Biden was addressing the nation, DeSantis slammed Democrats and the media for making so much hay of the event.",
    "Republican Senate leader Mitch McConnell, who delivered one of the sharpest denunciations of Trump after the attack, was in Atlanta for the funeral of former Sen. Johnny Isakson.",
    "From the archives (January 2021): Kevin McCarthy becomes poster boy for Republicans walking back their recent Trump criticism\nMany avoided observances planned at the Capitol.",
    "It has been stunning to see some Washington Democrats try to exploit this anniversary to advance partisan policy goals that long predated this event,? he said.",
    "It's not a leadership that resembles any of the folks I knew when I was here for 10 years, dramatically,? Cheney, also a former congressman, told reporters.",
    "From the archives (May 2021): Rep. Liz Cheney lashes out at GOP leaders: I will not sit back and watch in silence'\nFrom the archives (October 2021): No.",
    "I still cannot believe that a mob was able to take over the United States Capitol during such a pivotal moment  certifying a presidential election.",
    "She has since said that she will not run for the GOP nomination if Trump chooses to move forward with the comeback campaign he's been teasing.",
    "It would have been so easy for terrorists to boot strap onto this protest and wreak even further destruction on the U.S. Capitol,? he wrote.",
    "A former staffer told CNN that McCarthy had also been reticent on the day of the Capitol attack, neither guiding nor supporting his staff.",
    "2 House Republican Steve Scalise refuses to say on Fox News that 2020 presidential election wasn't stolen\nPolitics first\nFlorida Gov.",
    "Read on (June 2021): How to treat election deniers' and Big Lie' adherents is an ongoing challenge for mainstream news organizations",
    "There's no question  none  that President Trump is practically and morally responsible for provoking the events of the day.",
    "On Thursday, however, Graham, who remains close to Trump, marked the occasion with a mix of shock and partisan attacks.",
    "It was a notable shift from the comments he had made last year after the Senate voted against Trump's impeachment.",
    "It's all part of the political calculus in a party in which the former president remains very much in charge.",
    "The importance of January 6th as an historic event cannot be overstated,? he added in a statement.",
    "Ron DeSantis, considered a potential 2024 presidential candidate, was also quick to pounce.",
    "House Minority Leader Kevin McCarthy did not make an appearance or issue a statement.",
    "Some acknowledged the terror of the day but quickly pivoted to bashing Democrats.",
    "But on the anniversary of the attack, top Republicans were far more muted.",
    "Isakson had died nearly three weeks earlier after a long illness.",
    "This is their Christmas, January 6th,? he said.",
    "And still others didn't say anything at all.",
    "Love of country demands nothing less.",
    "That's true patriotism,? he wrote.",
    "Enough is enough,? he'd said then.",
    "All I can say is count me out.",
    "MarketWatch contributed."
  ]
}