{
  "id": 805,
  "mediaId": 312,
  "date": "1/6/2022 12:00:00 AM",
  "headline": "Why America Needed a 9/11 Style Commission for Jan. 6",
  "image": "https://cdn.jwplayer.com/v2/media/cvF5q24E/poster.jpg?width=1280",
  "link": "https://time.com/6137435/january-6-anniversary-commission/",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Elliott",
  "authorUrl": "",
  "termIds": [
    906,
    1248,
    1335,
    1338,
    1765,
    2214,
    2465,
    3094,
    445,
    2945,
    2959
  ],
  "sentences": [
    "But in the short term, many Republicans have made the cynical calculation that in order to have any standing inside the GOP, they have to profess fealty to ex-President Donald Trump and his false line that he won the 2020 election and Congress should have kept him in the White House, counter to the wishes of voters who elected Joe Biden.",
    "ABC News polling finds a full 52% of Republicans viewed the riot as merely an attempt protecting democracy,? 71% of them believe Trump was the legitimate winner and 78% of them believing Trump carries just some? or no responsibility for the mob he riled up and sent to the Capitol to push lawmakers to ignore the election results.",
    "Former Senate Majority Leader Harry Reid asserted that Romney didn't pay taxes; Reid later shrugged off his claim that was demonstrably false: Romney didn't win, did he?? In both cases, credible fact-checks made clear that the claims were bunk, even if their speaker may have believed them to be true enough.",
    "Gateway Pundit on Sept. 17 labeled the imprisonment of those arrested on charges related to Jan. 6 an American Gulag.? Ashli Babbitt in this alternative timeline was not an insurrectionist shot by officers as she tried to breach the House chamber but rather a martyr who died under mysterious circumstances.",
    "This is what happens when leadersnamely Republicans herepush such narratives without regard to what actually happened that day on Capitol Hill when protesters built a gallows to threaten lawmakers, a mob overtook the Capitol for the first time since 1814 and sent lawmakers of both parties into hiding.",
    "Instead, the narrative coming from some corners of the Republican Partyand its allies in conservative media, like Fox Newsare actively promoting the incorrect arguments that the government was in on the Jan. 6 protests and orchestrated the insurrection to turn tourists into political prisoners.",
    "Only when I got closer than I should have been did I realize their chants were not for a presidential candidate but for a dangerous and debunked idea: Nine-Eleven was an inside job,? they shouted relentlessly, many holding banners from conspiracy theorist Alex Jones and Infowars.",
    "Instead, a lot of bad information about what happened on Jan. 6 seems ordained to become schlerotic truths? with no rooting in fact beyond Fox News hosts, conspiracy theorists and probably more than a few Russian bots looking to keep Americans pitted against one another.",
    "Rather than having widely respected elder statesmen above politics investigate, the entire affair on the House side of Capitol Hill has come to be seen in Washington as a partisan exercise meant to hurt Trump, despite the committee's fastidiously fact-based work so far.",
    "A few years back, I was walking onto the Saint Anselm College campus on Manchester, N.H.,'s western edge for a presidential primary debate when I spotted in the crowd of demonstrators a very loud and organized group standing on the side of the road.",
    "More Must-Read Stories From TIME\nShonda Rhimes Already Knows What You're Going to Watch Next\nHow Donald Trump Turned Jan. 6 into a Windfall\nWhy 2022 Is the Year We Learn to Live With COVID-19\nPublic Schools Are Struggling to Retain Black Teachers.",
    "These Ex-Teachers Explain Why\nCDC Director Rochelle Walensky Faces a Surging VirusAnd a Crisis of Trust\nHow Addictive Social Media Algorithms Could Finally Face a Reckoning in 2022\nThe Supreme Court Could Let Religious Schools Take Taxpayer Money.",
    "Seldom have I been so comforted to have read the then-relatively new release of the 9/11 Commission's report, probably the most important government audit since the Warren Commission convened to study the Kennedy assassination.",
    "A House-backed proposal for a bipartisan, independent commission to investigate the failed insurrection died in the Senate when Republican Leader Mitch McConnell told colleagues he was against it and called it duplicative.",
    "Well, a new style of such garbage has since made its way into the ether, but this time there may never be a widely-accepted accounting of that seismic event that shook America's footing on Jan. 6 of last year.",
    "It's not at all clear what new facts or additional investigation yet another commission could lay on top of the existing efforts by law enforcement and Congress,? McConnell said in May.",
    "In fact, polls indicate there is now a deep and partisan misunderstanding of the events that took place leading up to the melee here in Washington one year ago today at the Capitol.",
    "And with just two public exceptionsand exemplarsin Reps. Liz Cheney and Adam Kinzinger, most Republicans in power are actively choosing ignorance and denial about that day.",
    "It was a horrendous event, and I think what they are seeking to find out is something the public needs to know,? McConnell said, referring to the House committee.)",
    "After all, imagine if more than the fringes of society thought the U.S. government had actively participated in the killing of almost 3,000 people that day 2001.",
    "The committee is considering holding primetime hearings to get more of the public's attention, perhaps starting in late March and continuing into the summer.",
    "The D.C. Brief has detailed this unfortunate phenomena over the last year, but it's worth one more reminder that this carries tremendous danger.",
    "A quotation often wrongly attributed to a Nazi propagandist remains nevertheless true: a lie told enough times eventually becomes the truth.",
    "Then-nominee Mitt Romney asserted that Barack Obama took two weeks to call Benghazi a terrorist attack; in reality, it took hours.",
    "Trump's twin impeachments were all that mattered in D.C. but not must-see-TV for most of America, according to the ratings.",
    "A fact-based and credible accounting for what led to and transpired on Jan. 6 seems impossibly fanciful at this point.",
    "GOP Leadership sent Pelosi a roster that included two picks known for the incendiary rhetoric and loyalty to Trump.",
    "Trump counselor Kellyanne Conway was roundly mocked when she made the assertion that alternative facts? can exist.",
    "House Speaker Nancy Pelosi invited House Republicans to send her five members to serve on the 12-person panel.",
    "Pelosi, in turn, said the committee's work was too important to be derailed by showmanship and histrionics.",
    "Even among Republicans, 40% support its work against the 44% who oppose it, according to Politico polling.",
    "But a lot has changed since the days of the Watergate hearings and the Clarence Thomas confirmation.",
    "Now consider that more than those adherents sincerely believe that Biden is an illegitimate usurper.",
    "Rep. Paul Gosar on May 12 claimed Babbitt had been executed.?\nThose stories may harden into facts.",
    "And in that lays deep danger that no fact-based alternative can be put forward with credibility.",
    "(And in a shift, the never-accidental McConnell seems to have changed his tune late last year.",
    "House Republicans withdrew all of their nominees and Pelosi recruited Cheney and Kinzinger.",
    "But with the oil-slick of partisanship, it's unlikely to sway any folks wearing MAGA hats.",
    "Totalitarian and authoritarian rulers exploit this pattern better than liberal democrats.",
    "That's not a nation that's easy to govern for himor for whoever comes next.",
    "Sign up here to get stories like this sent to your inbox every weekday.",
    "Sure, politics has always had a choose-your-own-adventure side to it.",
    "This article is part of the The DC Brief, TIME's politics newsletter.",
    "Such an approach is taking a toll on the nation's grasp on reality.",
    "Beyond the Beltway, the public seems to be fine with the efforts.",
    "History will not be kind to this moment in our nation's history.",
    "Instead, the House moved forward with its own select committee.",
    "Former Students Say That's a Mistake\nSHARE THIS STORY",
    "But such blurred truths have bled across party lines.",
    "Thus, hopes for a 9/11-style commission faded.",
    "Sign up for the daily D.C. Brief newsletter.",
    "Make sense of what matters in Washington."
  ]
}