{
  "id": 810,
  "mediaId": 187,
  "date": "1/6/2022 12:00:00 AM",
  "headline": "It's Time for Democrats to Break the Glass",
  "image": "https://cdn.theatlantic.com/thumbor/uAtje6Lc-yzo7JxKXyLdXJRYfxg=/0x0:5706x3210/1952x1098/media/img/mt/2022/01/h_15488263/original.jpg",
  "link": "https://www.theatlantic.com/politics/archive/2022/01/defending-democracy-steps/621170/",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald Brownstein",
  "authorUrl": "https://www.theatlantic.com/author/ronald-brownstein/",
  "termIds": [
    712,
    1097,
    1147,
    1402,
    2087,
    2095,
    2505,
    3094,
    146,
    428,
    2870,
    2950
  ],
  "sentences": [
    "Then it became very clear that's not what the base of the party wants  so that has shifted [to where] the entire incentive structure of the Republican Party is, if you bow down to these antidemocratic efforts, you are rewarded, and if you oppose them, you are punished and ostracized.?\nLast year, 19 Republican-controlled states, including such key electoral battlegrounds as Florida, Georgia, Texas, and Arizona, passed 34 laws restricting access to voting, according to the latest roundup by the Brennan Center.",
    "A similar, if not quite as lopsided, January 6 revisionist project is under way in the party: In a recent CBS News poll, nearly half of Republicans surveyed described what happened on January 6 as patriotism? and more than half called it defending freedom.?\nCombined with the rising tide of physical threats against election officials, these intensifying and interlocked developments are routinely described by experts in democratic erosion as the gravest threat to American democracy since the Civil War.",
    "Benson, who faced a swarm of pro-Trump protesters outside her home in 2020, said that if those acts are not met with greater consequences at all levels, then we must anticipate and accept that these things will continue unabated and perhaps at a greater intensity than before.?\nIn the hours immediately after the January 6 attack, Republican leaders such as Senators Mitch McConnell and Lindsey Graham pointedly criticized Trump's role in fomenting the attack.",
    "While the Justice Department has systematically prosecuted the rioters who actually invaded the building, many observers have grown more and more frustrated at the lack of evidence that Attorney General Merrick Garland and his team are investigating any of the individuals who spurred the attack or participated in the broader maneuvering to undermine Biden's victorya list that extends up to Trump himself.",
    "Trying to secure a commitment from either, says one lobbyist heavily involved in the talks, speaking on the condition of anonymity in order to talk freely, is like trying to put mercury into a bottle.?\nLike other democracy scholars, Bassin, of Protect Democracy, said, It's not sustainable long-term? to preserve a functioning system if only one political party is committed to playing by the rules.",
    "The Republican Party, even with some remaining dissent, has mostly been turned into a pro-autocracy party or an illiberal party, a party where the leadership and a lot of the base  think it's more important that they be in power than constitutional rights and liberal protections be valued,? Susan Stokes, the director of the Chicago Center on Democracy at the University of Chicago, told me.",
    "The big picture,? she said, is that this is a slow-motion palace coup that began after the election in 2020.? Trump couldn't stop Biden from taking office, she noted, but his success at solidifying support among Republican voters for his lies and silencing dissent from elected GOP officials has allowed him to continue working to rig the rules for the next presidential election.",
    "Like many democracy advocates, he pointed to the postCivil War precedent, when the Lincoln-era congressional Republicans passed the Fourteenth and Fifteenth Amendments, as well as all the other civil-rights protections for freed slaves, on an entirely party-line basis, over the unified opposition of Democrats who were defending their partisan allies in the former Confederacy.",
    "Trump's consolidation of control means that arguably for the first time in American history, the dominant faction in one of the nation's major political parties is displaying the willingness to rig the rules of electoral competition in a manner reminiscent of the authoritarian parties that have undermined democracy in countries such as Hungary, Poland, and Venezuela.",
    "But with Republican filibusters blocking both measures, Senate Majority Leader Chuck Schumer is promising make-or-break votes toward the middle of this month that will determine whether Democratic Senators Joe Manchin of West Virginia and Kyrsten Sinema of Arizona will agree to change the filibuster rules to pass the billsor allow Republican opposition to kill them.",
    "Since the Capitol attack, nothing has shaped the ongoing struggle over the fate of American democracy more than this refusal by almost all elected Republicansand such GOP constituencies as national business groups and social conservative organizationsto lock arms in a cross-party popular front? or grand alliance? to defend the basic rules of democratic society.",
    "After January 6, there was a brief moment where it looked like it might be a post-Watergate moment, when the Republican Party joins with the Democrats and says, What was that, and how do we prevent that from happening again?'? Ian Bassin, the executive director of Protect Democracy, a nonpartisan group that analyzes threats to American elections, told me.",
    "With the Republican-appointed majority on the U.S. Supreme Court showing little inclination to restrain state actionsand in fact encouraging them through landmark decisions in 2013 and 2021 that weakened the federal Voting Rights Actthe failure to pass new national standards this year could clear the path for years of escalating GOP restrictions.",
    "Those of us in support of democracy are up against a national coordinated effort to dismantle democracy from within, and that requires a national response that is just as coordinated and just as focused if democracy is going to survive,? Jocelyn Benson, the Democratic secretary of state in Michigan, told me.",
    "The core issue in the VRA debate is restoring the Justice Department's authority to review or preclear? election-law changes in states with a history of discriminationthe pillar of the law that Chief Justice John Roberts and four other GOP-appointed justices invalidated in the 2013 Shelby County decision.",
    "Business leaders in states such as Arizona and Texas helped block some of the most extreme voter-suppression measures, and a nationwide coalition called Business for Voting Rights, which includes prominent companies such as Target, Google, and Dell, has endorsed federal voting-rights legislation.",
    "Conservative media have generally amplified Trump's threats against Republicans who defended the integrity of the 2020 election and center-right columnists, most prominently The New York Times' Ross Douthat, have relentlessly argued that Trump isn't as great a threat to democracy as he seems.",
    "But his initial decision to sublimate the issue means he has generated little public awareness of the threat, and with his overall political position weakened by the persistence of the pandemic, the party might not have enough leverage to force Manchin and Sinema to retrench the filibuster.",
    "Even Republicans such as Cheney and Senator Mitt Romney of Utah, who have criticized Trump as a threat to democracy, have defended the state laws restricting voting access and opposed the Democrats' twin voting-rights bills as an excessive federalization? of election administration.",
    "We face losing our democracy if we can't counter the completely unjustified laws that have passed in state legislatures.?\nAdvocates also identify a second essential front: accountability for the efforts to overturn the 2020 election that culminated in the assault on the Capitol.",
    "The best lever Democrats have to resist the threats to democracy is their capacity to pass legislation through Congress that establishes a nationwide floor of voting rights and restores federal oversight of changes in state electoral laws that disenfranchise minority voters.",
    "With Democrats facing an uphill battle to hold both congressional chambers after November's midterm election, voting-rights advocates view the filibuster decision as an inflection point that could shape the character of American democracy for the next decade or longer.",
    "But none of the biggest national umbrella trade-business associations closely allied with the GOP, such as the Business Roundtable or the National Association of Manufacturers, has joined that effort; the U.S. Chamber of Commerce released a statement opposing H.R.",
    "But instead, Trump has consolidated his control over the GOP, led a movement to purge Republican elected officials who resisted his unfounded claims of fraud, and solidified the belief among the party's voters that Joe Biden is an illegitimate president.",
    "Rather than renouncing Trump's discredited claims, his Republican allies have cited them to justify passing dozens of laws in multiple red states reducing access to the ballot and increasing partisan control over election administration and tabulation.",
    "In states across America it is unquestionable that we've seen an unprecedented, ongoing, and highly successful assault on our democracy and our electoral system,? Wendy Weiser, the vice president of the Democracy Program at the Brennan Center, told me.",
    "Trump has endorsed a series of primary challengers to Republicans who resisted his false claims in 2020, including Representative Liz Cheney in Wyoming and Georgia's Brian Kemp and Brad Raffensperger, the governor and secretary of state, respectively.",
    "In Arizona, Katie Hobbs, the Democratic secretary of state, expects a push from Republicans to roll back mail voting and to explicitly grant the state legislature authority to reject the election results and appoint its own presidential electors.",
    "As Kristol notes, All the notions there would be a solid front, the business community, the Wall Street Journal editorial page, the national-security people, saying This is it,' this is the moment when they step up,? have failed to materialize.",
    "If Democrats let this opportunity pass without establishing national safeguards for voter access and election administration, it may be years before they again hold unified control of Congress and the presidency and get another chance.",
    "But with polls showing Trump's continued appeal to the party rank and file, leaders such as Graham and Representative Kevin McCarthy quickly pivoted to stress the importance of making peace with the former president.",
    "I think the succumbing of the Republican Party to the Big Lie just swamps everything else,? Bill Kristol, the longtime conservative strategist who has become a leader in the Republican opposition to Trump, told me.",
    "The whole is worse than the sum of the parts.?\nIn Congress, Republicans have almost universally opposed measures from Democrats to respond to these state actions or to investigate the attack on the Capitol.",
    "Likewise, frustration is growing at the failure of state and federal law enforcement to prosecute the Trump supporters behind a rising tide of physical threats against state and local election officials.",
    "In a speech today, he delivered his strongest condemnation yet of the January 6 attack and the broader GOP campaign to limit voter access, and he's traveling to Atlanta next week to make the case again.",
    "Stokes said the best way to understand America's current situation is to view the past year as a continuation of Trump's effort to invalidate the election results and maintain power despite his defeat.",
    "When House Democrats came back with a plan to create a special committee to investigate, only Liz Cheney and Adam Kinzinger of Illinois, the two Republicans who eventually joined the panel, voted yes.",
    "The refusal of almost all elected Republicans to take a stand against Trump's assault has left Democrats in the precarious position of seeking to reinforce the basic pillars of democracy on their own.",
    "The next few weeks will likely answer the most crucial question that emerged from last year's insurrection by supporters of Donald Trump: Can one political party defend American democracy on its own?",
    "(In other countries, the center-right's willingness to reject and isolate the autocratic far-rightwhat's not happening among Republicans nowhas proved an especially crucial variable, scholars say.)",
    "The high point of cooperation came last May, when 35 House Republicans backed legislation that would create an independent commission to examine the January 6 attack (while 175 still voted no).",
    "The real choice for today's congressional Democrats on voting rights and democracy protection is not whether to act alone or act with Republicans; it's whether to act alone or not act at all.",
    "The Democratic-controlled House last year passed separate bills incorporating both goals, and all 50 Senate Democrats appear ready to support somewhat modified proposals to do so as well.",
    "In the days after the January 6 attack, it appeared possible that many Republicans would join Democrats in a cross-party coalition to defend democracy against the autocratic threat.",
    "(One study released this morning found that corporations have now donated more than $18 million to congressional Republicans who voted to reject the election results last January.)",
    "After Manchin objected to that bill, Senate Democrats negotiated a new version with him and gave him weeks to pursue Republican support for it; no one in the GOP has endorsed it.",
    "And the Brennan Center reports that dozens of restrictive voting bills have either been pre-filed for the 2022 legislative session or will carry over from last year.",
    "To Kristol, it's hard to make the case that the Republican surrender to Trump's antidemocratic impulses is a passing cloud, even a very big and unpleasant cloud.",
    "In recent weeks, Biden has second-guessed that decision and grown more explicit about supporting an exception to the filibuster in order to pass voting rights.",
    "Business leaders announced they would cut off contributions to GOP members of Congress who voted against certifying Biden's victory even after the riot.",
    "Can Democrats overcome that lockstep opposition to pass either their omnibus floor of voting rights or a new Voting Rights Act restoring preclearance?",
    "Fueling all of this activity has been Trump's success, with a big assist from conservative media, in unifying GOP voters behind his unfounded claims.",
    "The last time Congress renewed the law, in 2006, it passed the Republican-controlled Senate unanimously (with the preclearance provisions included).",
    "Beyond the narrow band of Never Trump? Republicans that existed before 2020, no significant element of the GOP coalition has resisted these actions.",
    "House Republicans locked arms to defend Representatives Marjorie Taylor Greene and Paul Gosar when Democrats censured them for violent rhetoric.",
    "Democracy is at stake this month, and that is not hyperbole,? Fred Wertheimer, the president of the reform group Democracy 21, told me.",
    "Even more striking is the Republican resistance to reinvigorating the 1965 Voting Rights Act, a cornerstone of the civil-rights era.",
    "In private, Biden has expressed that he delayed focusing on voting rights in the hope that he could pass his economic agenda first.",
    "But last November, every GOP senator except Lisa Murkowski of Alaska voted to filibuster new legislation restoring preclearance.",
    "In surveys, about three-fourths or more of Republican voters routinely say they believe that Biden won because of massive fraud.",
    "Candidates endorsing Trump's Big Lie are running for secretary of state in 13 states, according to a recent NPR tabulation.",
    "Although it was possible last January to believe that the GOP would repudiate? Trump, Kristol said, his dominance endures.",
    "I think what we saw last session was the tip of the iceberg in terms of really harmful legislation,? she told me.",
    "The next few weeks will mark a crucial test of whether they can muster the unity and determination to do so.",
    "But McConnell killed that idea with a Senate filibuster (which only six Senate Republicans voted to break).",
    "oting-rights advocates and academic students of democracy see two key tracks to that potential response.",
    "In Georgia, a powerful Republican state legislator is now proposing to eliminate all drop boxes.",
    "But in a crisis like the situation developing now, Bassin said, there may be no other choice.",
    "Six Republican-controlled states launched politically motivated audits? of the 2020 results.",
    "1 and instead called for a national bipartisan commission to study voting rules.",
    "1 bill that Democrats passed last March to set national rules for voter access.",
    "Business groups quietly resumed contributions to the objecting legislators.",
    "We won't know how the story is going to end until after 2024,? she said.",
    "(Reuters has documented more than 800 such threats in 12 states.)",
    "On the voting-rights debates, the GOP has been as impenetrable.",
    "At least five more states are discussing audits for next year.",
    "Every House Republican voted against the legislation as well.",
    "It is a multipronged, multi-tactic assault on our democracy.",
    "It's going to be part of the scene for a while,? he said.",
    "Every House Republican voted against the sweeping H.R.",
    "One is legislative."
  ]
}