{
  "id": 815,
  "mediaId": 165,
  "date": "1/6/2022 12:00:00 AM",
  "headline": "They Helped Save Democracy  and Are Being Tormented for It",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/01/Pennsylvania-Convention-Center-november-2020.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-features/jan6-election-workers-trump-biden-2020-democracy-1279027/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Kroll",
  "authorUrl": "",
  "termIds": [
    2214,
    2214,
    1147,
    1147,
    1338,
    1338,
    1434,
    1434,
    1248,
    1248,
    565,
    565,
    2590,
    2590,
    2550,
    2550,
    2777,
    2777
  ],
  "sentences": [
    "Gong had already explained to the local Republicans why he couldn't give them unfettered access to the county's voting system for their audit.? There were strict chain of custody protocols to follow, confidentiality protections, and a state-level requirement that all of the materials used to conduct a federal election be retained and stored for 22 months.",
    "He hoped that January 6th would shake people out this derangement or whatever is going on.? Instead, it's just settling in, he says, and now, even with some much-needed distance from the 2020 election and the insurrection, Schmidt is still trying to make sense of the state of the country and where it might be headed.",
    "We don't really have any choice,? he says even if it's only being marginally successful and frequently feels like you're hitting your head against the wall.?\nTommy Gong knew that the board of supervisors meeting scheduled for May 4, 2021 would be tense.",
    "Biden had won the county by a 13-point margin, but there were plenty of passionate Trump supporters in San Luis Obispo as well, and in the spring of 2021, months after the vote-counting was over, the local Republican Party came to him with a demand.",
    "He was shockedbut not surprised Jacob Chansley, the so-called QAnon Shaman who strode onto the Senate floor that day in his furs and Viking helmet, had protested outside his office arm-in-arm with Alex Jones chanting Fontes' name back in November.",
    "What matters is what people believe to be true, and if you don't believe democracy is working for you then everything we have goes away.?\nThey've endured death threats and xenophobic abuse, lost friends and grown estranged from family members.",
    "Pro-democracy Republicans like Reps. Adam Kinzinger and Liz Cheney have become pariahs, censured and shunned and attacked for daring to refute the Big Lie and hold Trump accountable for helping foment the unrest that led to the Jan. 6 attack.",
    "He can't quite believe that a diehard conservative like Liz Cheney is labeled a RINO for her repudiation of the Big Lie, nor that the litmus test for a loyal? Republican these days is whether you believe the last election was stolen or not.",
    "Later, as he thought back on that exchange, he wondered: Where is this going?? (Gong says a woman approached him a few weeks later, identified herself as the person who made the Communist comment, and apologized to him.)",
    "Fighting authoritarianism and fascism is a dangerous thing.?\nA June 2021 survey of election workers by the Brennan Center for Justice at NYU found that 1 in 3 had received threats during or after the last election.",
    "Yet there he was in late 2020, meeting with members of the sheriff's department and other law-enforcement agencies about establishing a secure perimeter around the building where Fontes' staff was counting ballots.",
    "But the people who have had it the worst are the people who  in the face of intense pressure and often under threat of physical harm  held the line for American democracy over the past year.",
    "In June, he resigned from his position as San Luis Obispo's top election official and took a new job as the deputy elections chief in Contra Costa County, which covers the East Bay suburbs.",
    "At the May 4 supervisors meeting, Gong made his case as clearly and professionally as he could as to why a forensic audit wasn't possible and why the 2020 vote count was fair and accurate.",
    "At one point, notorious conspiracy theorist Alex Jones joined the crowd and yelled into a megaphone, Resistance is victory!? Other protesters dressed in tactical gear and carried firearms.",
    "And in many cases, they intend to remain on the job for the 2022 midterms and the presidential election two years later even as the vitriol and hatred aimed at them continues to this day.",
    "I don't know that I could be happy doing anything else, and I know there are a lot of my peers who feel the same way.?\nAdrian Fontes is a candidate for Arizona secretary of state.",
    "So long as Republicans continue to deceive the public about the last election, Schmidt says it's his duty and the duty of others in his position to counter those lies with truth.",
    "Security officers with the Philly Police Department's dignitary protection unit guarded him and his family when they walked the dog, bought groceries, or took the kids sledding.",
    "In his new position, Gong is helping create a multi-county coalition to help educate voters about how elections work and to counteract the spread of misinformation about voting.",
    "2022 is going to be the first testing ground for this.?\nThe targeting of election officials didn't end after the 2020 election was certified and Joe Biden began his presidency.",
    "For several days in a row after the 2020 election, hundreds of pro-Trump protesters massed outside the Maricopa County Recorder's Office, where Fontes and his team worked.",
    "It's also become a profitable con, with countless conservative media personalities and minor MAGA celebrities boosting their brands by declaring the election stolen.",
    "He underestimated how much Trump and his campaign would seek to subvert the outcome, and how quickly Trump's base would transform the election into a rallying cry.",
    "Closer to Election Day, he lived in a hotel connected to the Philadelphia convention center and spent every waking hour making sure the vote count went smoothly.",
    "The Big Lie is the new litmus test for any aspiring Republican official on the national stage  and flogging that lie is the easiest way to climb the GOP ladder.",
    "They are the local officeholders and election officials who ran the 2020 election amidst a one-in-a-century pandemic and an onslaught of disinformation.",
    "You can pull on a thread and it can come apart,? says Natalie Adona, the assistant clerk-recorder and registrar of voters in Nevada County, California.",
    "But a year after that attack, the fortunes of those who protected the 2020 election and those who sought to nullify it could hardly be more different.",
    "What Schmidt focused on in that hectic, post-election moment was ensuring every valid vote got counted  even if it put him at odds with his own party.",
    "Having earned a PhD in political history, Schmidt knew he was witnessing history but struggled to grasp its meaning in the moment, close to the heat.",
    "He mentioned that the county had audited a small sample of votes after the election, which had confirmed the result with the exception of two votes.",
    "Adona, the election official from Nevada County, California, says she's heard firsthand accounts from her colleagues about the abuse they've faced.",
    "The effect is just as devastating as an individual.?\nNevertheless, Adona is running for her boss's seat to be the county's top election official.",
    "Adrian Fontes never thought he would need to draw on his training as a Marine in his job as a top election officer for Maricopa County, Arizona.",
    "Trump tweeted that Schmidt was a RINO.? He and his wife received death threats: ALBERT RINO SCHMIDT WILL BE FATALLY SHOT? and HEADS ON SPIKES.",
    "This is really becoming something much larger than election officials have ever experienced,? he says of the spread of election-related lies.",
    "Is Tommy Gong in any way in relationship [sic] to the Chinese Communist Party?? the woman asked in a message played aloud at the meeting.",
    "All the while, Fontes says, he, his employees, and a team of volunteers continued to count all 2.1 million ballots cast in the election.",
    "We refused to allow these protesters to potentially disenfranchise Maricopa County voters,? he later said in testimony before Congress.",
    "Starting in June 2020, Schmidt worked seven days a week preparing first for the city's primary elections and then the general election.",
    "Gong was the nonpartisan elections chief for San Luis Obispo County, located on the central coast of California north of Santa Barbara.",
    "Yet he didn't recognize his party when he looked out on the angry crowd wrapped in Trump flags and screaming about election fraud.",
    "In a way, I feel a deep responsibility in part because of what happened on January 6th to continue on with this work,? she says.",
    "He sees his campaign as part of a full-blown battle? against the insurgency? that wants to tear down democracy in America.",
    "They're not well-known, overworked and underpaid, not eyeing higher political office or angling for a lucrative book deal.",
    "Some fixated on the county's Dominion Voting Systems equipment, a frequent target of election-fraud conspiracy theories.",
    "I heard stories of election officials getting screamed at, followed to their offices, chased down the street,? she says.",
    "Fontes taught a marksmanship course in the Marines, and so he felt a chill when he recognized the weapons in the crowd.",
    "Schmidt announced he wouldn't seek reelection to the Philadelphia city commission about a month after the election.",
    "TREASONOUS SCHMIDTS.? People harassed him and his family by posting their home address and the names of his kids.",
    "He served as executive director of the city Republican Party, and a senior adviser to the state Republican Party.",
    "The slow-burn insurgency is afoot.?\nAl Schmidt struggles with the notion of the first anniversary of January 6th.",
    "Adrian Fontes, the former Maricopa County recorder, says he's still on the receiving end of threatening messages.",
    "Yet others say they feel compelled to stay on the front lines of democracy at this precarious moment in history.",
    "The anti-democracy movement that stalked Fontes and his employees culminated in the Jan. 6 Capitol insurrection.",
    "Arizona's state senate, he knew, had ordered a full recount of all 2.1 million ballots cast in Maricopa County.",
    "Mike Pence, who refused to join the attempt to overturn democracy, is an afterthought in the 2024 GOP primary.",
    "To him, it feels as if we're on the 400th day of the 2020 general election, an event that never seems to end.",
    "I think the folks who don't want democracy to live are slowly but surely getting what they want,? he says.",
    "When Schmidt shot down the various theories put forward by Trump campaign lawyers, he became a target.",
    "He would go on take a job running a local nonpartisan good-government group, the Committee of Seventy.",
    "Schmidt, a Republican, was a city commissioner on the Philadelphia County Board of Elections in 2020.",
    "Outside, in the streets, rival demonstrations gave the scene a dark, almost carnival-like atmosphere.",
    "He says he had hoped that the anger and paranoia about the election would subside as time passed.",
    "He thinks that question is a valuable one  but for the opposite reason his fellow Republicans do.",
    "Those who defended the election, however, have been roundly, and severely, punished for it.",
    "Even though this insurrection was really rooted in a lie, in a way it doesn't even matter.",
    "He and his family packed go-bags? in case they needed to leave their home on short notice.",
    "If you do believe the 2020 election was stolen, you're either a fool or a liar,? he says.",
    "They saw with startling clarity how close the country came to a real democratic crisis.",
    "For the public comment period, people submitted messages to be played at the hearing.",
    "He also couldn't deny that the attack on him factored into his thinking as well.",
    "These machines can be used to alter the outcome of elections,? one person said.",
    "The rifles weren't all that different from the one he carried in the military.",
    "Even if it means he feels like he's reliving the last election day after day.",
    "They found back-up housing in case they needed to stay somewhere long-term.",
    "The slur made national headlines and Gong got calls from major newspapers.",
    "Several months later, Fontes watched the January 6th insurrection unfold.",
    "Philly's convention center was the vote-counting epicenter of the state.",
    "I think we have a huge challenge ahead of us having to deal with this.",
    "Then the twinge of recognition: Yes, someone really just said that.",
    "An affable, chatty fellow, Gong was a third-generation Californian.",
    "I fear my children will live in a world where they cannot vote.?",
    "Some of what we experienced after is still happening,? he says.",
    "Many have quit in the year since the election and January 6th.",
    "Every once in a while, Schmidt walked to a window and watched.",
    "Gong had heard about these partisan audits in other counties.",
    "On one occasion, his children evacuated for several days.",
    "We worried about an invasion into the building,? he says.",
    "They wanted a full forensic audit? of the last election.",
    "The Republicans were the only party he'd ever known.",
    "Donald Trump remains wildly popular among his party.",
    "He would have the chance to work in a bigger county.",
    "He had already started thinking about leaving town.",
    "He would be closer to some family in the Bay Area.",
    "Chants of stop the steal? rang out day and night.",
    "Fontes says he's running not because I'm angry.",
    "This wasn't Schmidt's first political battle.",
    "He had family scattered across the state.",
    "Another woman took aim at Gong directly.",
    "I fear for the future of this republic.",
    "That's what I'm recognizing right now.",
    "Did they really say that, he thought.",
    "Democracy really is a tapestry.",
    "He went to Cal-Berkeley.",
    "Then came the protests.",
    "That would come later."
  ]
}