{
  "id": 817,
  "mediaId": 195,
  "date": "1/6/2022 12:00:00 AM",
  "headline": "Division reins over Jan. 6 anniversary",
  "image": "https://thehill.com/sites/default/files/trumpdonald_010621getty_gop-crossroads.jpg",
  "link": "https://thehill.com/policy/national-security/588446-division-reins-over-jan-6-anniversary",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Beitsch",
  "authorUrl": "https://thehill.com/author/rebecca-beitsch",
  "termIds": [
    3094
  ],
  "sentences": [
    "In the days after the riot, a number of Republicans laid blame for it at Trump's feet, with House Minority Leader Kevin McCarthy (R-Calif.) saying the president bears responsibility for Wednesday's attack on Congress? and Senate Minority Leader Mitch McConnell (R-Ky.) saying President Trump is responsible for provoking the events of the day.?\nBut Trump's response, both before and after his second impeachment that itself was triggered by the Jan. 6 attack, complicated an effort to establish a review mechanism for the riot that was largely fraught from the beginning.",
    "The fact that the Republican leader in the House of Representatives is attempting to obstruct the work of this committee and attempting to hide from the American people what happened and continuing to defend the president, who we know at a minimum sat and watched TV while the mob invaded the Capitol, I think his actions and the actions of those people who continue to defend President Trump will not be judged well by history,? she said in a recent interview with The Dispatch, a conservative publication.",
    "Everybody's initial reaction, whether it was Donald Trump Jr. or Laura Ingraham, or Sean Hannity, aligned with AOC's and Bernie Sanders's: This was a terrible thing and the president needed to do something about calling off the dogs,? said Tim Roemer, a former Democratic lawmaker from Indiana who served on the bipartisan 9/11 Commission, which was established to provide a complete account of the deadliest terrorist attack on America.",
    "And, of course, without his complaints of a stolen election and advocacy on that day, we likely would not have had an insurrection at the Capitol,? said Jamil Jaffer, founder and executive director of the National Security Institute at George Mason University who previously served as counsel in the George W. Bush White House and adviser to Republicans on a number of congressional committees.",
    "And so part of our committee's responsibility is to get the facts for history, to make sure people have all of those on which to make judgements going forward.?\nMore than a dozen Republicans, including sitting lawmakers and former administration officials, politicians and members of the 9/11 Commission, did not respond to The Hill or declined interviews.",
    "So getting back to what that initial reaction was across the political spectrum is what the Jan. 6 select committee's job is.?\nBut Jaffer, of the National Security Institute, said that will be a Herculean task, as Americans on both sides of the aisle tend to be entrenched in their political opinions and beliefs about what happened that day.",
    "That turned very quickly to, how do you take political advantage of something??\nAccording to data from Pew Research Center, from March to September of 2021 there was a 22 percentage point drop in the share of Republicans who say law enforcement needs to track down and prosecute those who stormed the Capitol that day.",
    "Instead, they are using it as a partisan political weapon to further divide our country.?\nMcCarthy's office did not respond to questions from The Hill about whether he would attend any Jan. 6 events, while McConnell's office said he would be in Georgia attending the late Republican Sen. Johnny Isakson's funeral.",
    "And despite what the president said about him in the days that followed Jan. 6, McCarthy saw the reality of his caucus around him and clearly felt the need to go down to Mar-a-Lago and make peace,? Jaffer said, noting that Trump-backed primary challengers to sitting members of Congress have seen success.",
    "I think democracy has become extraordinarily difficult, in part because of disinformation promulgated by prominent political figures in this country that thrive on that disinformation.?\nTrump, who on Monday called off a planned press conference on Jan. 6, continues to claim the 2020 election was stolen.",
    "And so I think that's, to me, what is most notable and troubling is that for that fraction of Americans, this message is working, even though the committee is finding more and more evidence of very troubling involvement by people and indications that there was advanced planning and funding,? he said.",
    "On Jan. 6, 2021, a violent mob of rally attendees, fresh from hearing President Trump speak near the White House, marched to the Capitol, forced their way past barricades and a line of police officers and stormed the building, interrupting the certification of President Biden's electoral victory.",
    "Finally, a December poll from the University of Massachusetts Amherst found that 84 percent of Democrats felt it was important to learn more about what happened on Jan. 6, while 75 percent of Republicans responded that it was time to move on.?\nFormer Senate Majority Leader Tom Daschle (D-S.D.)",
    "While one day after the attack, many Americans were united in revulsion to the ugly scenes that played out on their television screens, a year later people hold deeply different views on the gravity of the day, who is responsible for what happened and even the value of analyzing the attack.",
    "As soon as things didn't change, as soon as Trump continued to insist on the normalcy and legitimacy of it, then you get Tucker Carlson and Laura Ingram stepping in, and everyone in the loyal base now develops a narrative where they're the victims, not the perpetrators,? Benkler said.",
    "The kind of preemptive delegitimizing of the committee's work is working with that particular group of Americans.?\nThe strong views of that subset of Republicans divides the party, while Democrats are fairly unified in their perceptions and attitudes around the day.",
    "And we lose this very, very fundamental tool to develop a shared sense of what actually happened,? said Yochai Benkler, co-director of the Berkman Klein Center for Internet and Society at Harvard University who has studied disinformation within the Republican Party.",
    "Ingraham the night of the attack had suggested members of the far-left antifa movement might actually have been involved in the attack, however, while fellow host Tucker Carlson came under criticism for an online special that forwarded similar conspiracy theories.",
    "Polls show that Democrats and Republicans gravitate toward different words to describe what happened on Jan. 6, but Jesse Rhodes, a political science professor and associate director of the UMass Amherst poll, said there was a more disturbing underlying trend.",
    "Plans to establish an otherwise agreed-to 9/11-style commission were derailed over fighting about how many members each party should be able to appoint after House Speaker Nancy Pelosi (D-Calif.) initially proposed a composition that would favor Democrats.",
    "It's a series of facts and details that have since been disputed, politicized and muddied, leaving the nation bitterly divided on partisan lines and complicating the work of the select committee exploring the day's events and what preceded it.",
    "The former president, who is actively courting a new run for the White House in 2024, called his words ahead of the riot extremely calming? even though he told his supporters to fight like hell? shortly before they marched to the Capitol.",
    "It has to appear to be doing legitimate work and not be viewed as a partisan witch hunt, which requires it to go out of its way to be even-handed and to tell the story in a way that is not viewed as purely political,? he said.",
    "And all but 35 House Republicans voted down a later plan negotiated by one of their own that would have established a commission with equal representation following a no? vote recommendation from House Republican leadership.",
    "Rhodes said messaging to cast doubt on what happened on Jan. 6 has resonated most with the segment of Republican voters most closely associated with Trump who also make up a sizable portion of the general electorate.",
    "That's inevitably going to move politicians; it's the nature of democracy.?\nRepublicans then largely boycotted the select committee established by Pelosi in July after she rejected two of McCarthy's picks.",
    "That reluctance is fairly pervasive.?\nRoemer, the Indiana Democrat, blamed the prism of party politics and reelection and advantage.?\nPeople start to analyze: How does this affect our political party?",
    "An October poll from Quinnipiac University found the parties were divided on whether the attack was Trump's fault  66 percent of Republicans said it wasn't, while 93 percent of Democrats said it was.",
    "A lot of Republicans are more than prepared to talk about it privately, but they don't want to kick it into a public debate with their colleagues,? Daschle, the former Senate majority leader, said.",
    "Unfortunately, one year later, the majority party seems no closer to answering the central question of how the Capitol was left so unprepared and what must be done to ensure it never happens again.",
    "One of the details uncovered by the committee was the extent to which Fox News hosts Laura Ingraham, Sean Hannity and Brian Kilmeade were uncomfortable with the scene transpiring at the Capitol.",
    "While the elements that divide the party today preexisted Trump's candidacy and presidency, there is little question that his leadership of the party enhanced and deepened those divides.",
    "There we're not just talking about how we describe things or what happened, but whether we want to learn from what happened and take steps to prevent such things from happening again.",
    "Kevin McCarthy's own statements on Jan. 6 and the immediate aftermath of that day make clear that  like many others  he was shocked and deeply concerned by what happened.",
    "Rather than getting at the basis of this is a fundamental threat to our democracy, this is breaking the rule of law, this is dividing America, this is wrong,? he said.",
    "And while top-line numbers show general negative attitudes about the attack, recent polling shows sharp contrast in perspectives from Democrats and Republicans.",
    "Benkler blamed a propaganda feedback loop? where GOP politicians, conservative-leaning media and activated voters all reinforce and police one another.",
    "I think what has happened over the last many years is the extraordinary impact that disinformation and the use of algorithms and social media has had.",
    "You have a significant percentage of people in this country who challenge the results of the last election in large measure due to disinformation.",
    "McCarthy mentioned the anniversary in a recent letter to GOP colleagues after hitting Biden on the coronavirus pandemic, inflation and the border.",
    "The result is a very different kind of anniversary from those the nation has previously marked to reflect on the darkest days of its history.",
    "Our Capitol should never be compromised and those who broke the law deserve to face legal repercussions and full accountability,? he wrote.",
    "I think when McCarthy decided not to join formally, the decision was to basically refuse to accept anything other than partisan narrative.",
    "Republicans have vacillated between bashing and dismissing the Jan. 6 committee while trying to show reverence about the day itself.",
    "He has repeatedly called the attack on the Capitol a protest? and argued the insurrection took place on Nov. 3?  Election Day.",
    "I think it is that crucially troubling and impactful in terms of what it could do to this democracy,? Daschle told The Hill.",
    "All three urged Trump's chief of staff Mark Meadows to get the president to call off his supporters and quell the unrest.",
    "Everybody across the political spectrum was deeply offended by this, one of the worst days in American history.",
    "), the vice chair of the Jan. 6 committee and one of its two Republican members, criticized McCarthy's pivot.",
    "said the environment feels remarkably different? than when he was working to establish the 9/11 Commission.",
    "As we have said from the start, the actions of that day were lawless and as wrong as wrong can be.",
    "He pointed to the dip in the number of people who think Jan. 6 participants should be prosecuted.",
    "The shift from conservatives was almost entirely responsible for the 9-point survey-wide drop.",
    "With just two Republicans on the committee, it will be hard to reach the GOP, he said.",
    "You have a motivated voting population and a person with a bully pulpit.",
    "Republicans are divided today, in large part, because of Donald Trump.",
    "They're picking up those messages and they are responding in kind.",
    "It is as dangerous as anything since we created the atomic bomb.",
    "And that's what I think is really troubling,? he told The Hill.",
    "If the committee can do that, they'll be successful.",
    "If they can't do that, they won't be successful.?",
    "We're talking about roughly a third of voters.",
    "The bill was later rejected by the Senate.",
    "I have my story; you have your story.",
    "Rep. Liz Cheney (R-Wyo.",
    "Our reelection?",
    "Our midterms?",
    "..."
  ]
}