{
  "id": 818,
  "mediaId": 237,
  "date": "1/6/2022 12:00:00 AM",
  "headline": "Don versus Don as Nebraska Rep. Bacon dismisses former president's primary threats",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/933273_s_1640880235839.jpg",
  "link": "https://www.washingtonexaminer.com/news/don-versus-don-as-nebraska-rep-bacon-dismisses-former-presidents-primary-threats",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    2087,
    2087,
    1937,
    1937,
    733,
    733,
    1248,
    1248,
    1335,
    1335,
    1147,
    1147,
    428,
    428,
    422,
    422,
    2816,
    2816,
    2848,
    2848
  ],
  "sentences": [
    "Rep. Don Bacon is shrugging off former President Donald Trump's attempt to oust him over his support for President Joe Biden's bipartisan infrastructure bill, declaring in an interview with the Washington Examiner: I am not a yes' man.?\nThe Nebraska Republican does not consider himself a Trump foe.",
    "Bacon, 58, said voting for the infrastructure bill, also backed by Nebraska Republican Sen. Deb Fischer, was right for our district, right for our state, and right for our country.?\nBacon said he has not spoken with Trump since approximately one week before the 2020 election.",
    "For months, House Speaker Nancy Pelosi of California struggled to cobble together 218 Democratic votes, a majority, for infrastructure because of opposition from liberals, who were using the bill as leverage for Biden's massive social spending bill.",
    "He held on in 2018, a Democratic wave year, and won reelection again two years later by more than 20 percentage points, even as Biden defeated Trump in the district by nearly 7 points, capturing one Electoral College vote in the process.",
    "Bacon rarely, if ever, criticizes the former president: He twice opposed impeaching him, including in the aftermath of the ransacking of the U.S. Capitol on Jan. 6, and supported his agenda on the House floor more than 89% of the time.",
    "Excluding the House Republicans in that group who backed Trump's second impeachment, that leaves nine additional GOP incumbents, including Bacon, poised to get swept up in the former president's midterm election intraparty purge.",
    "When Pelosi finally put the infrastructure bill on the floor for a vote, Bacon and the dozen other House Republicans who supported the law cast their aye? votes before it was evident 218 Democrats would do the same.",
    "Back then, the former president was a fan, possibly impressed with the extended cheers Bacon received and chants of Bacon, Bacon? when he mentioned the congressman's name during a campaign rally in Omaha.",
    "I'm not really paying a lot of attention to it,? he said Tuesday afternoon in a telephone interview from the competitive 2nd Congressional District, anchored in Omaha, that he has represented since 2017.",
    "Early last year, Trump committed to defeat the 10 House Republicans who voted to impeach him on charges of fomenting the Jan. 6 riot at the U.S. Capitol, prominent among them Wyoming Rep. Liz Cheney.",
    "The outcome of the last two elections in the 2nd district suggests Republicans have nothing to gain from Trump meddling in Bacon's bid for a fourth term and that Democrats have everything to gain.",
    "That might explain why top Republicans other than Trump are not itching to punish Bacon for his infrastructure vote  he has demonstrated strength in the district, even in tough political climates.",
    "Dividing the Republicans in the House, it weakens that, it has the potential to weaken our country  Republicans need to be coming together to take back the House  that should be our focus.?",
    "Bacon is claiming minimal blowback back home, emphasizing that he raised more than $700,000 in the fourth quarter and claiming the infrastructure bill polls near 70% in his district.",
    "Nebraska is reliably red, but the 2nd Congressional District is not, despite changes to the seat in decennial redistricting that left it somewhat easier for Republicans to defend.",
    "But in opposing Bacon over his infrastructure vote, the 45th president is expanding his list of fireable offenses and escalating his fight against members of his own party.",
    "But the congressman defied Trump on the $1 trillion infrastructure law, prompting the former president to encourage Republicans to challenge him in Nebraska's May primary.",
    "House Republican leaders were livid, and even some GOP operatives otherwise supportive of Bacon expressed frustration with the timing of his vote, if not the substance.",
    "He also called complaints about the timing of his vote irrelevant, saying he always made clear he would support the bill whenever it came up for a vote.",
    "Trump similarly targeted the seven Republicans who voted to convict him at his impeachment trial in the Senate and are up for reelection in 2022.",
    "Asked to comment on Trump's terse, one-sentence statement  Anyone want to run for Congress against Don Bacon in Nebraska??  Bacon did not blink.",
    "We need a check and balance? against Biden, who has gone full Bernie Sanders,? Bacon said, referring to the socialist Vermont senator.",
    "Independents are with me 2-1,? Bacon said, projecting confidence? he would survive any primary challenge that materializes.",
    "Bacon tends to agree, although he declined to explicitly accuse Trump of jeopardizing the GOP's hold on his district.",
    "Thirteen House Republicans supported Biden's bipartisan infrastructure bill (plus 19 Senate Republicans).",
    "The former president has vetted primary challengers in their districts and delivered some endorsements.",
    "The congressman said the commander in chief told him that his polling showed him down and Bacon up.",
    "Bacon never considered it but added, I had to remind the president that he endorsed? Sasse.",
    "That's very good.?\nDuring their conversation, Trump broached two subjects, Bacon recalled.",
    "The 45th president asked why the congressman declined to primary Nebraska Sen. Ben Sasse.",
    "They were accused of bailing out Pelosi and House Democrats from political disaster.",
    "My integrity and my character are more important than playing politics,? Bacon said.",
    "Trump was not the only Republican upset with the congressman's infrastructure vote.",
    "Well, I like him, too, but I don't know if I like him that much.",
    "I want to take back the majority, that's the bottom line.",
    "Trump also asked Bacon for advice in the 2nd District.",
    "Nearly two months later, Bacon has no regrets.",
    "Woah  wow, wow,? Trump said in response.",
    "How can you help me win?? Trump asked."
  ]
}