{
  "id": 821,
  "mediaId": 178,
  "date": "1/6/2022 12:00:00 AM",
  "headline": "A year after Capitol riot, Trump maintains grip on GOP",
  "image": "https://chorus.stimg.co/22512213/merlin_62616747.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/trump-maintains-grip-on-gop-despite-violent-insurrection/600133113/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JILL COLVIN Associated Press",
  "authorUrl": "",
  "termIds": [
    718,
    1147,
    1248,
    1609,
    1765,
    2087,
    2214,
    3094,
    146,
    200,
    428
  ],
  "sentences": [
    "\"It's a concerted effort to undermine our public's confidence in the electoral system, so in 2022 and 2024, if they don't like the elections  and this is Republicans  they can overturn it,\" said Whitman, who also serves as co-chair of States United Action, a nonpartisan nonprofit that aims to protect the integrity of future elections.",
    "After spending 2021 raising money and announcing his endorsements of candidates who have parroted his election lies up and down the ballot, Trump's team is preparing to pivot to helping those candidates win with a stepped-up rally schedule and financial support, including transfers to candidate accounts and targeted advertising.",
    "\"There was this hope when we were in the safe room that we would go back and the Republicans would see how crazy this was, how fragile our democracy was, what President Trump had done, and that they would renounce that and we would all come together,\" said Rep. Pramila Jayapal, D-Wash., describing the events that day.",
    "WASHINGTON  As a raging band of his supporters scaled walls, smashed windows, used flagpoles to beat police and breached the U.S. Capitol in a bid to overturn a free and fair election, Donald Trump's excommunication from the Republican Party seemed a near certainty, his name tarnished beyond repair.",
    "His refusal to accept reality has flourished with the acquiescence of most Republican leaders, who tend to overlook the gravity of the insurrection for fear of fracturing a party whose base remains tightly aligned with Trump and his effort to minimize the severity of what happened on Jan. 6.",
    "Trump is also facing a flurry of investigations, including in New York, where prosecutors are investigating whether his real estate company misled banks and tax officials about the value of his assets, inflating them to gain favorable loan terms or minimizing them to reap tax savings.",
    "\"What I underestimated was the impact that one person would have on that, and that is Kevin McCarthy and his visit to Mar-a-Lago,\" Kinzinger said, referring to a trip McCarthy took to Florida in late January 2021 as the party was on the verge of disarray.",
    "For Trump, the extraordinary outcome is the product of sheer will and a misinformation campaign that began long before the election, when he insisted the only way he could lose was if the election was \"rigged\" and wouldn't commit to accepting defeat.",
    "Trump is positioning himself as a powerful force in the primary campaigns that will determine who gets the party's backing heading into the fall midterms, when control of Congress, governor's offices and state election posts are at stake.",
    "Rep. Adam Kinzinger of Illinois, a Republican who, with Rep. Liz Cheney of Wyoming, has emerged as one of the few GOP anti-Trump critics in Congress, had predicted Trump's hold on the party would \"be gone\" by the summer.",
    "New York Attorney General Letitia James' office confirmed this week that it has subpoenaed Trump and his two eldest children, Ivanka and Donald Trump Jr., as part of an investigation into the family's business practices.",
    "\"Here is the truth: The former president of the United States of America has created and spread a web of lies about the 2020 election,\" Biden said in a speech Thursday at the Capitol that did not mention Trump by name.",
    "\"When somebody walks out of the most powerful office in the world, the Oval Office, to sit by the swimming pool at Mar-a-Lago, his influence declines,\" said John Bolton, Trump's former national security adviser.",
    "He frequently  and falsely  says the \"real\" insurrection was on Nov. 3, the date of the 2020 election when Democrat Joe Biden won in a 306-232 Electoral College victory and by a 7 million popular vote margin.",
    "His former vice president, secretary of state and a handful of Senate allies have made frequent trips to early voting states, preparing for potential campaigns and refusing to rule out running against Trump.",
    "At least for now, there's little stopping Trump as he makes unbending fealty to his vision of the GOP a litmus test for success in primary races, giving ambitious Republicans little incentive to cross him.",
    "They fear what might happen if Trump-endorsed candidates for secretary of state and attorney general who say the election was stolen find themselves in positions that could sway the outcome in 2024.",
    "Bolton has funded extensive national and state-level polling on the subject over the last year that has found Trump's sway and the power of his endorsement waning considerably since he left office.",
    "Voting rights advocates, meanwhile, are increasingly worried as states with Republican legislatures push legislation that would allow them to influence or overrule the vote in future elections.",
    "The second impeachment centered on his role in sparking the insurrection, but Trump was acquitted in a Senate trial, a clear indication that he would face few consequences for his actions.",
    "But less than half of Republicans recall the attack as violent or extremely violent, according to a poll released this week by The Associated Press-NORC Center for Public Affairs.",
    "Christine Todd Whitman, a longtime Republican who now serves on the advisory committee of the Renew America Movement, a group trying to wrest the party away from Trump's control.",
    "The situation has stunned and depressed critics in both political parties who were convinced the insurrection would force Republicans to abandon the Trump era once and for all.",
    "At least nine people who were at the Capitol died during or after the rioting, including a woman who was shot and killed by police as she tried to break into the House chamber.",
    "Mitch McConnell, the Senate Republican leader who worked closely with Trump to dramatically reshape the judiciary, later denounced him as \"morally responsible\" for the attack.",
    "Youngkin's victory created a possible model for candidates running in battleground states where suburban voters uncomfortable with the former president are a key bloc.",
    "Undaunted, Trump is preparing for another run for the White House in 2024, and polls suggest that, at the moment, he would easily walk away with the GOP nomination.",
    "Trump, according to allies, sees the midterms as a foundation for his next campaign, and intends to use the cycle to position himself for his party's nomination.",
    "But Kinzinger, who recently announced his decision not to run for reelection, blamed House Republican leader and Trump ally Kevin McCarthy for proving him wrong.",
    "He canceled a news conference that was scheduled for Thursday following pressure from some Republican allies, who warned that such an event was ill-advised.",
    "\"He's done so because he values power over principle, because he sees his own interest as more important than his country's interest and America's interest.",
    "With their eyes on retaking the House in 2022, Trump and McCarthy agreed to work together and released a photograph showing them smiling side by side.",
    "\"That full-hearted embrace, I saw firsthand in members, made them not just scared to take on Trump but in some cases also full-heartedly embrace him.\"",
    "During last year's most prominent elections, Republicans like Virginia gubernatorial nominee Glenn Youngkin strategically kept Trump at arm's length.",
    "Rather than expressing any contrition for the events of Jan. 6, Trump often seems emboldened and has continued to lie about his 2020 election loss.",
    "Instead, she said, \"there were people defending the insurrectionists and defending Trump and continuing with the challenge and the Big Lie.\"",
    "Meanwhile, on Capitol Hill, the Jan. 6 committee continues to investigate the Trump White House's involvement in the deadly insurrection.",
    "Some of his closest allies, including Fox News Channel hosts like Laura Ingraham, warned that day that Trump was \"destroying\" his legacy.",
    "Federal and state election officials and Trump's own attorney general have said there is no credible evidence the election was tainted.",
    "While Trump's endorsement remains coveted in many midterm primary races, it has also failed to clear the field in some key races.",
    "Banned from Twitter and denied his other social media megaphones, Trump no longer controls the news cycle like he did in office.",
    "\"This political theater is all just a distraction for the fact Biden has completely and totally failed,\" he said in a statement.",
    "\"Kevin McCarthy is legitimately, singlehandedly the reason that Donald Trump is still a force in the party,\" Kinzinger said.",
    "Instead, he is the undisputed leader of the Republican Party and a leading contender for the 2024 presidential nomination.",
    "The former president's allegations of fraud were also roundly rejected by courts, including by judges Trump appointed.",
    "___\nThis story has been corrected to show Trump's post-election meeting with McCarthy was in 2021, not 2020.",
    "Trump has similarly struggled to prevent other Republicans from eyeing the 2024 presidential nomination.",
    "\"But what I am surprised by is how deferential so many of the Republican elected officials\" have been.",
    "\"I really think that the evidence is clear that the people are done with Trump,\" Bolton said.",
    "\"His ego was never going to let him accept defeat and go quietly into the night,\" she added.",
    "Aides to McCarthy didn't respond to a request for comment on Kinzinger's characterization.",
    "___\nAssociated Press writer Mary Clare Jalonick in Washington contributed to this report.",
    "Trump still has his eyes on 2024, even as he continues to obsess over the 2020 election.",
    "Honestly, it's not declining as fast as I would like to see and it's not down to zero.",
    "And because his bruised ego means more to him than our democracy or our Constitution.",
    "Trump responded, accusing Biden of using his name \"to try to further divide America.\"",
    "\"Let's just say I'm horrendously disappointed,\" said former New Jersey Gov.",
    "Others, however, point to fractures that suggest Trump's power is waning.",
    "Enough is enough,\" said his friend and confidant Sen. Lindsey Graham.",
    "He became the first president in U.S. history to be impeached twice.",
    "Both children have been prominent political surrogates for Trump.",
    "About 3 in 10 Republicans said the attack was not violent.",
    "But one year later, Trump is hardly a leader in exile.",
    "\"He still has support, but it is declining.",
    "But among real people, it is declining.\"",
    "\"We are in a very, very fragile place.\"",
    "\"All I can say is count me out.",
    "He can't accept he lost.\""
  ]
}