{
  "id": 828,
  "mediaId": 718,
  "date": "1/5/2022 12:00:00 AM",
  "headline": "Rep. Kinzinger to focus on fighting right-wing extremism, won't run for governor or Senate",
  "image": "https://cdn.vox-cdn.com/thumbor/3bVZUGQCwANGU9uWYCa1YejL7qI=/0x0:2865x1910/2420x1613/filters:focal(1496x734:1954x1192):format(webp)/cdn.vox-cdn.com/uploads/chorus_image/image/70350187/1347581251.0.jpg",
  "link": "https://chicago.suntimes.com/politics/2022/1/5/22868350/kinzinger-will-not-run-senator-governor-congress-january-6-capitol-attack-right-wing-extremism-trump",
  "mediaOutlet": "Chicago Sun-Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lynn Sweet",
  "authorUrl": "https://chicago.suntimes.com/authors/lynn-sweet",
  "termIds": [
    1248,
    1609,
    1464,
    1464,
    1248,
    1147,
    1147,
    1133,
    1133,
    1095,
    1095,
    1026,
    1026,
    2214,
    2214,
    2465,
    2465,
    1609,
    2087,
    2087,
    428,
    428,
    635,
    635,
    562,
    562,
    2959,
    2959,
    2707,
    2707
  ],
  "sentences": [
    " the two Republicans on the Jan. 6 committee investigating the Capitol attack, and two of 10 Republicans voting to impeach Trump because of his Jan. 6 role  now find themselves waging a lonely battle within their party against election denial and whitewashing the events surrounding Jan. 6\nIn his new video Kinzinger said, Some say it's time to move on from January 6th.",
    "WASHINGTON  Leading Trump critic U.S. Rep. Adam Kinzinger, R-Ill., who in October said he would not seek another term in the House but left open the potential of running for senator or governor, on Wednesday said he will, in his next chapter, devote himself full time? to working against the extremism that led to the Jan. 6 attack on the Capitol.",
    "That's why I'm transitioning from serving just one corner of Illinois into fighting this new nationwide mission full time.?\nTrump and his allies, by promising revenge, made Kinzinger's ability to win a GOP 2022 primary in Illinois difficult no matter where Democrats in Springfield put Kinzinger in their new congressional remap.",
    "In a video released Wednesday, Kinzinger said, I'm transitioning from serving just one corner of Illinois into fighting this new nationwide mission full time.?\nHis spokesperson confirmed Kinzinger means he would not mount a statewide run.",
    "Kinzinger closed the door to a statewide Illinois run the day before the first anniversary of the Capitol insurrection, where a Trump-supporting mob tried to prevent Congress from formalizing the election of Joe Biden as president.",
    "At the end of January 2021, Kinzinger, from Channahon, launched his Country First movement? to reclaim the Republican Party from the forces leading to the Capitol riot and to provide a counter to Trump's grip on the GOP.",
    "While there are multiple GOP candidates for governor, and the field may grow, there is no Republican of note running against Sen. Tammy Duckworth, D-Ill., who is seeking another term.",
    "Kinzinger would have had a difficult time winning a GOP primary in Illinois for any office, given that former President Donald Trump is seeking revenge against his main critics.",
    "Kinzinger was already pushing back against the conspiracy theories taking root within elements of his Republican party when the Jan. 6 Capitol insurrection occurred.",
    "For most of 2021, Kinzinger, in his sixth term, said he may run for governor or senator if the Springfield Democrats carved up his district, which they did.",
    "After being thrown into a district with Rep. Darin LaHood, R-Ill., in October, Kinzinger said he would not seek another House term.",
    "To this day, too many politicians have chosen lies over truth, anger over progress, fear over hope and division over unity.",
    "They are stoking division where they should be tackling the root causes that lead to January  anger, fear and hopelessness.",
    "They think it'll be good for their careers, but they should be asking what's good for our country.",
    "If the past 12 months have taught me anything, it's that saving America is the fight of our lives.",
    "But we can't move on without addressing what happened or by pretending it never happened.",
    "Petitions to run in the June 2022 Illinois primary can start to be passed on Jan. 13.",
    "We can't move on without taking action to make sure it never happens again.",
    "We have to admit it, but the leadership of the Republican Party won't.",
    "This time last year I hoped victory would come in a matter of months.",
    "I said last year that the Republican Party has lost its way.",
    "We don't need to pour gasoline on the fire.",
    "We need solutions to these real problems.",
    "Kinzinger and Rep. Liz Cheney, R-Wyo.",
    "Our so called leaders refuse to lead.",
    "But that's exactly what's happening.",
    "That starts by admitting the facts.",
    "The 2020 election was not stolen.",
    "They lied to the American people.",
    "Now I see it will take years.",
    "And it's getting worse.",
    "That's still the case.",
    "And they still are.",
    "Donald Trump lost.",
    "Joe Biden won."
  ]
}