{
  "id": 834,
  "mediaId": 129,
  "date": "1/5/2022 12:00:00 AM",
  "headline": "A Year After Capitol Riot, Trump's Hold on G.O.P. Is Unrivaled",
  "image": "",
  "link": "https://www.nytimes.com/2022/01/05/us/politics/trump-gop-jan-6.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1609,
    1720,
    1720,
    1097,
    1097,
    1147,
    1147,
    1464,
    1464,
    1609,
    428,
    427,
    427,
    428,
    84,
    84,
    2670,
    2670,
    2543,
    2543
  ],
  "sentences": [
    "President Trump is practically and morally responsible for provoking the events of the day,? Mr. McConnell declared in a floor speech, adding, The leader of the free world cannot spend weeks thundering that shadowy forces are stealing our country and then feign surprise when people believe him and do reckless things.?\nBut Mr. McConnell ultimately voted to acquit Mr. Trump at his impeachment trial on a charge of inciting the insurrection.",
    "But more common was the view of members like Corey Steinmetz, of Wyoming, who said in an interview that blaming Mr. Trump for the events of Jan. 6 was nothing more than a sham from the get-go.?\nToday, the Republican Party is very much still Mr. Trump's, transforming his lies about a stolen 2020 election into an article of faith, and even a litmus test that he is seeking to impose on the 2022 primaries with the candidates he backs.",
    "One year ago, on the very same day when fevered supporters of Donald J. Trump breached the United States Capitol in a violent riot that defiled a symbol of American democracy, the leadership of the Republican National Committee happened to gather, almost 700 miles away at a Ritz-Carlton on Amelia Island, Fla.",
    "And he obsesses over his win-loss record in Republican primaries: 152-2 on endorsements,? he told the conservative radio host Hugh Hewitt last month, adding, I take that very seriously.?\nMr. Trump has said he will not announce his plans for 2024 until after the midterms.",
    "Mr. Trump and Mr. McConnell are not on speaking terms now, though Senator Rick Scott of Florida, the chair of the Senate Republican campaign arm, has been solicitous of Mr. Trump, even giving him a new Champion for Freedom? award on a trip to Mar-a-Lago in April.",
    "would pursue its inquiry into the riot at any level.?\nThere was a fleeting moment, in the wake of the Jan. 6 attack, when Republican leaders in the House and Senate had an opportunity to break cleanly with Mr. Trump, as Democrats moved swiftly to impeach him.",
    "On his way out of office, Mr. Trump had fumed about starting a third party of his own, though he closed the door on that idea in his first post-presidential speech in late February, at the Conservative Political Action Conference of pro-Trump activists.",
    "His rehabilitation  to the extent one was even needed among Republicans  is the latest example of an enduring lesson of his tumultuous time in politics: that Mr. Trump can outlast almost any outrage cycle, no matter how intensely it burns.",
    "Even as the national committee drafted a statement condemning the violence  it did not mention Mr. Trump by name  some committee members pressed to add an expression of sympathy for the views of the crowd that had mobbed the Capitol.",
    "Within a month, in early February 2021, an AP-NORC Poll found that only 11 percent of Republicans said Mr. Trump bore a great deal or quite a bit of responsibility for the breach of the Capitol; that figure is at 22 percent today.",
    "Privately, some Trump advisers believe that his online absence has been a blessing in disguise, keeping him out of the public eye as President Biden faces the twin political challenges of rising inflation and a surging virus.",
    "Yet his unrivaled power inside the G.O.P., one year after inciting the sacking of the Capitol to forcibly forestall the certification of the election, is a testament to his unrelenting hold on the loyalty of the party base.",
    "Mr. Trump has already endorsed candidates in nearly 100 races in the midterms, setting up the 2022 primary season as something of a vengeance tour against those Republicans who dared to cross him.",
    "Mr. Trump's chief of staff, who initially provided the panel with a trove of documents that showed the extent of his role in the efforts to overturn the election, is now refusing to cooperate.",
    "In less than a week, Mr. Graham was back at Mr. Trump's side, riding Air Force One, and he repeatedly visited Mr. Trump's golf courses for face time with the former president in the last year.",
    "Mr. Trump is also deeply divisive, unpopular among the broader electorate and under investigation for his business practices and his interference with election officials in Fulton County, Ga.",
    "After Jan. 6, Mr. Trump's banishment from Facebook and, in particular, Twitter, was consequential, keeping him off platforms that had allowed him to reach tens of millions of people directly.",
    "With broken glass and debris still scattered across the Capitol complex, well over half of House Republicans voted against certifying the election, echoing Mr. Trump's false claims of fraud.",
    "Perhaps the first most consequential pivot back to Mr. Trump came from Kevin McCarthy, the House Republican leader, who had said on Jan. 13 that Mr. Trump bears responsibility? for the riot.",
    "After effectively shutting down his campaign finance operation following the Capitol riot, Mr. Trump fired it back up the day of his speech to the Conservative Political Action Conference.",
    "Mr. Christie, a former adviser who broke with Mr. Trump after Jan. 6, has emerged as one of the few prominent Republicans pushing back on Mr. Trump's deceptions about the 2020 election.",
    "In a sign of fatigue even among his supporters, a notable share of Republicans say they would prefer he not run again, as many as 40 percent in a Marquette Law School Poll in November.",
    "The former president initially planned to hold a news conference on the anniversary, but abruptly withdrew on Tuesday on the advice of allies and advisers that it would backfire.",
    "Many of us from the Northeast states just rolled our eyes,? said Bill Palatucci, a Republican national committeeman from New Jersey and a prominent Trump critic inside the party.",
    "Some advisers worry his expansive set of endorsements will expose him to stinging potential losses that could signal a weakening of his sway over the Republican electorate.",
    "That same weekend, at a Republican National Committee fund-raiser, Mr. Trump ripped Mr. McConnell while speaking to donors, uttering a crude insult to his intelligence.",
    "Here's where they stand:\nInside the House Inquiry: From a nondescript office building, the panel has been quietly ramping up its sprawling and elaborate investigation.",
    "critics, such as Representative Liz Cheney of Wyoming, who was purged from House leadership for refusing, in her words, to spread his destructive lies? about 2020.",
    "One reason it has been so hard for party leaders to break from Mr. Trump is that he remains the dominant fund-raising force among the party's grass-roots donors.",
    "Enough is enough.?\nBut if some Republican lawmakers who had narrowly escaped the violence that day were at a breaking point, Republican voters were less moved.",
    "It's pretty clear that candidates who want to be competitive in the general election are being careful how close they get to him during primaries,? he said.",
    "Whit Ayers, a veteran Republican pollster, said that Mr. Trump's backing was powerful in primaries, but a very, very mixed blessing? in swing districts.",
    "And while Mr. Trump remains popular with Republicans, recent 2024 primary polls show potential vulnerability, even as he now outpaces the field handily.",
    "For Jan. 6, the warped narrative that Mr. Trump has spun is that the real insurrection happened on Nov. 3rd?  the date he lost a free and fair election.",
    "Ron DeSantis of Florida, who has consistently polled a distant second to Mr. Trump, have avoided saying whether they would not run if Mr. Trump does.",
    "But now Mr. Trump is planning a bigger public profile in 2022, scaling up a political operation and a more intense travel schedule of rallies.",
    "Understand the Jan. 6 Investigation\nBoth the Justice Department and a House select committee are investigating the events of the Capitol riot.",
    "He remains the same politician whose White House oversaw four years of devastating Republican losses, including of the House and Senate.",
    "Count me out,? Senator Lindsey Graham, Republican of South Carolina and a staunch Trump ally, had said that night on the Senate floor.",
    "Others, most notably Chris Christie, the former governor of New Jersey, have said Mr. Trump's decision will not affect their own.",
    "The R.N.C., plus the House and Senate campaign committees, raised a combined $2.34 million online in the last five days of June.",
    "He pointed to Gov.-elect Glenn Youngkin of Virginia as having offered a classic example? of the type of balancing act necessary.",
    "And while a scattered few Republicans publicly warn about yoking the party to him, more fret in private about the consequences.",
    "He is the party's most coveted endorser, its top fund-raiser and the polling front-runner for the 2024 presidential nomination.",
    "The lawyer has been the subject of intense scrutiny since writing a memo that laid out how Mr. Trump could stay in power.",
    "Mr. Trump smiled slightly and shrugged his shoulders, seeming to acknowledge that Mr. McCarthy hadn't been the leaker.",
    "Mr. Eastman was present at a meeting of Trump allies at the Willard Hotel that has become a prime focus of the panel.",
    "In the Senate, Mitch McConnell of Kentucky, the Republican leader, had been more forceful in denouncing Mr. Trump.",
    "A spokesman for Mr. McCarthy declined to comment, while a spokesman for Mr. Trump denied the exchange took place.",
    "He raised nearly $3.5 million online that day, federal records show  a one-day haul not approached by any G.O.P.",
    "By early summer, Mr. Trump was almost single-handedly matching the entire Republican Party apparatus online.",
    "But when Mr. Hewitt asked what would happen to his base if he did not run, Mr. Trump was quick with a reply.",
    "Did you leak it?? Mr. Trump said to Mr. McCarthy twice, according to two people briefed on the discussion.",
    "Garland's Remarks: Facing pressure from Democrats, Attorney General Merrick Garland vowed that the D.O.J.",
    "The R.N.C., meanwhile, has agreed to foot up to $1.6 million of Mr. Trump's personal legal bills.",
    "But the seeds of a political revival, at least within his own party, were there from the start.",
    "In Washington, Mr. Trump's political future had never appeared darker  and was dimming fast.",
    "The party continues to rely heavily on pro-Trump messages to motivate online supporters.",
    "Republican politicians quickly realigned themselves to comport with public opinion.",
    "By the end of the month, he was on a plane to Mar-a-Lago to try to keep the peace.",
    "The House voted to recommend holding Mr. Meadows in criminal contempt of Congress.",
    "The next morning, Mr. Trump called into the committee's meeting via speakerphone.",
    "Criminal Referrals, Explained: Can the House inquiry end in criminal charges?",
    "If I do decide that,? he said, I think my base is going to be very angry.?",
    "An article was published about the closely-guarded meeting ahead of time.",
    "Afterward, Mr. Trump's PAC released a photo of the two men side by side.",
    "The events of Jan. 6 have not been without consequences for Mr. Trump.",
    "That survey also showed 73 percent of independents prefer he not run.",
    "The money is as powerful a measure of his influence as his polling.",
    "Still, Mr. Trump has recruited challengers to his loudest G.O.P.",
    "Instead, he said, he planned to take back command of the G.O.P.",
    "Key Figures in the Jan. 6 Inquiry\nCard 1 of 10\nMark Meadows.",
    "These are some of the issues confronting the committee.",
    "But it's good for both of us, Kevin,? Mr. Trump said.",
    "politician or committee in the first half of 2021.",
    "Mr. Trump's committees raised $2.29 million.",
    "We love you!? some of the attendees shouted.",
    "Social media giants would soon banish him.",
    "Prominent allies were repudiating him.",
    "Top staff were resigning in protest.",
    "and cleanse it of his critics.",
    "Get rid of them all,? he said.",
    "Some Republicans, such as Gov.",
    "Mr. McCarthy said he did not.",
    "Then, he rewrites history.",
    "He was an electoral loser.",
    "They had to be overruled.",
    "The spotlight shifts.",
    "The furor fades.",
    "John Eastman."
  ]
}