{
  "id": 848,
  "mediaId": 25,
  "date": "1/3/2022 12:00:00 AM",
  "headline": "Cheney says House January 6 panel \"will not be deterred\" despite dangers from Trump claims",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/01/03/1264d900-ef11-402a-b42c-6a59d14ff057/thumbnail/140x90/b1048cd754bd297359b407d548acf407/0103-ctm-jamierraskin-intv-866138-640x360.jpg",
  "link": "https://www.cbsnews.com/news/liz-cheney-january-6-committee-donald-trump-dangers/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Linton",
  "authorUrl": "",
  "termIds": [
    1081,
    1147,
    1248,
    1335,
    1511,
    1609,
    3094,
    428,
    562
  ],
  "sentences": [
    "Professor studying January 6 on what he's lea... 06:49\n\"But, we shouldn't be distracted from the fact that, yes, while there were things that could and should have been done to protect the Capitol that day, the primary lever, instrument, the cause of that violence was the promulgation of a big lie by the former president, as his supporters said, who came and attacked the Capitol that day; they felt like they were following the president's instructions,\" Schiff said.",
    "Capitol Police chief warns threat level is \"much higher\" than a year ago\n House January 6 committee defers request for some of Trump's records\n Proud Boys member pleads guilty to Capitol riot conspiracy charge\n More\nDownload our Free App\nFor Breaking News & Analysis Download the Free CBS News app\n iOS\n Android\n Fire TV\n Apple TV\n Roku\n All Smart TV Apps",
    "\"But again, he knows these claims caused violence and we've seen now people who were in the Capitol, people who've been arrested because of their activities on that day, they themselves have told us in court filings, they've told us on social media, we've seen it on videos; that they were here because Donald Trump told them to be here,\" Cheney said.",
    "Representative Liz Cheney said Sunday on \"Face the Nation\" that she expects former President Trump to \"make the same false claims about the election that he knows to be false and the same false claims about the election that he knows caused violence on January 6\" at his event on the one-year anniversary of the attack on the U.S. Capitol.",
    "Schiff, who also sits on the House Intelligence Committee, said January 6 was an \"intelligence failure\" in that it was \"the failure to see all the evidence that was out there to be seen of the propensity for violence that day, a lot of it on social media.\"",
    "Meanwhile, University of Chicago professor Robert Pape, who has studied insurgencies in war zones and is now working with the Pentagon, has found the majority of those who attacked were not affiliated with any organized militia; they were everyday people.",
    "Cheney is one of only two Republicans on the committee, and while House Minority Leader Kevin McCarthy has so far mainly refused to work with the committee, she said he has, \"on a couple of occasions, said that he's willing to come talk to the committee.\"",
    "The people who attacked the Capitol on January 6 were \"business owners, CEOs from white collar occupations, doctors, lawyers, architects and accountants,\" Pape said, and only 7% were unemployed, which is nearly the same as the national average.",
    "There was, of course, the lies being promulgated by the former president, but also efforts with local elections officials and state legislators, efforts at the Justice Department and of course, the violent attack on January 6.",
    "\"Fully 21 million people believe two radical beliefs in America today: One, that Joe Biden is an illegitimate president; and two, that the use of force to restore Donald Trump to the presidency is justified,\" Pape said.",
    "\"He could have simply walked a few feet to the White House briefing room, he could have gone immediately on live television and asked his supporters to stop what was happening, ask them to go home,\" Cheney said.",
    "He instead, we know, had the motivation, at the same time, the violent assault was happening, he's watching television, he's also calling at least one senator urging delay of the electoral vote.",
    "Further, when we look at the key characteristic of why some counties and not others, what we see is the counties that sent the insurrectionists are the counties losing the most white population.",
    "I think one of the really important things that our committee has to do is lay these facts out for the American people so that they really have a sense of the truth of what happened that day.\"",
    "The second most prominent news sources for that 21 millions are mainstream sources such as CNN, PBS and CBS  \"because often when people watch ideas they disagree with, that makes them angry.\"",
    "Schiff on House January 6 committee 07:03\nCheney is the vice chair of the House January 6 select committee, which was created by Speaker Nancy Pelosi to investigate what happened that day.",
    "Assault On The U.S. Capitol\n More\n Jamie Raskin on January 6 probe, son's death\n Jan. 6 investigator Jamie Raskin: \"I'm not gonna see American democracy go down the tubes.\"",
    "Schiff said the activities of Trump and his advisers and the actions of the Justice Department on January 6 are the \"focal point\" of the committee's investigation.",
    "And we hope to be able to tell the story to the country so that they understand it isn't just about that one day, January 6, but all that led up to it.",
    "Well, that's not what our studies of those who broke into the Capitol on Jan 6 show, or the studies of the insurrection of sentiment in the country.\"",
    "Representative Adam Schiff, a Democrat on the committee, told \"Face the Nation\" on Sunday he expected public hearings to begin in the coming weeks.",
    "Cheney herself is facing a Trump-backed primary challenger in her home state of Wyoming and the state GOP has voted to no longer recognize her.",
    "Again, if he makes those same claims, he's doing it with complete understanding and knowledge of what those claims have caused in the past.\"",
    "\"So, it's important to lose- that we don't lose sight of the real motivating cause here and not just focus on the security of the building.",
    "He's demonstrated that he's willing to blow through every guardrail of democracy, and he can never be anywhere near the Oval Office again.",
    "\"What we're seeing is a movement that is a mainstream movement, not simply confined to fringe elements,\" Pape said on \"Face the Nation.\"",
    "\"And this is important, because we're so used to thinking of right wing extremism, or really extremism in general as part of the fringe.",
    "They're just a tiny fraction of America, less than 1%, and they come from people that are economically destitute, many often unemployed.",
    "But the select committee faces an uncertain future if Republicans take control of the House in the November midterm elections.",
    "And right now, there are far too many Republicans who are trying to enable the former president, embrace the former president.",
    "Of those 21 million people, 42% report their main source of news are outlets such as Fox News, Newsmax and One America News.",
    "Well, that dovetails with this right wing conspiracy theory that used to be part of the fringe called the great replacement.",
    "Look the other way and hope that the former president goes away, trying to obstruct the activities of this committee.",
    "Well, that idea now is voiced by mainstream political leaders, by mainstream media figures, embraced full throttle.\"",
    "Cheney said Americans need to \"understand the danger of President Trump and the danger that he posed on that day.\"",
    "\"I think the country needs a strong Republican Party going forward, but our party has to choose,\" she said.",
    "\"They're coming from San Francisco, Los Angeles, Chicago, New York City, Philadelphia, Houston and Dallas.",
    "Of the 700 people who have been arrested, over half live in counties that President Biden won, Pape said.",
    "\"We can either be loyal to Donald Trump or we can be loyal to the Constitution, but we cannot be both.",
    "\"And what we expect to do is lay out what we've been learning for the American people,\" Schiff said.",
    "He said the FBI and the Department of Homeland Security will have to answer for those failures.",
    "It's also vital we understand that this was an attack inspired by the commander-in-chief.\"",
    "Only 10% reported getting their news from right-wing social media like Gab or Telegram.",
    "So, this is a man who has demonstrated that he is at war with the rule of law.",
    "This idea is also that the Democratic Party is doing this deliberately.",
    "\"They don't mainly come from the reddest parts of America,\" Pape said.",
    "What happened on that day and the continuing danger going forward.\"",
    "At the end of the day, the facts matter, and the truth matters.\"",
    "Race is also an element and a driver of the attack, Pape said.",
    "\"There were several lines of effort to overturn the election.",
    "He's demonstrated a complete lack of fitness for office.",
    "\"And so, he's doing this press conference on the 6th.",
    "The idea that whites are being replaced.",
    "But we won't be deterred.",
    "\"He failed to do that."
  ]
}