{
  "id": 854,
  "mediaId": 43,
  "date": "1/2/2022 12:00:00 AM",
  "headline": "BIDEN---DAY347---Evening",
  "image": "https://images.dailykos.com/images/885911/story_image/2020electionmap.jpg?1605980065",
  "link": "https://www.dailykos.com/story/2022/1/2/2072332/-PRESIDENT-JOE-BIDEN-DAY347-Evening-Shade-Sunday",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    2052,
    2087,
    3094,
    382,
    428,
    511,
    2888,
    2942,
    2945
  ],
  "sentences": [
    "https://t.co/p17S496qPz\n The Hill (@thehill) January 3, 2022\nOKLAHOMA\nx\nA federal judge ruled has that Oklahoma National Guard members must get vaccinated against COVID, denying an attempt by the state's Republican governor to halt the Defense Department's vaccination mandate.https://t.co/5u7GwAnmy2\n Kyle Griffin (@kylegriffin1) January 2, 2022\nTEXAS\nx\nGOP Texas governor asks for federal assistance to help with COVID-19 testing, treatment https://t.co/9swYvXmQbP pic.twitter.com/TULkTDTSwQ\n The Hill (@thehill) January 3, 2022\nx\nTrump demanded an audit of election results in Texasa state he won decisively.",
    "PRESIDENTIAL ELECTION 2020\nW E L C O M E\nTO THE SHADE\nYOU WILL FIND in the DIARIES a LOT of POLITICS\nAND EVEN MORE CATS\nTHE PERSON who MAKES the FIRST COMMENT WILL GET TWO CATS\nEVERY PERSON WHO COMMENTS WILL GET A CAT\nRULES IN THE DIARY\nWHEN YOU FIND SOMETHING in the DIARY that you LIKE\nYOU CAN REPOST IT AS COMMENT in the DIARY\nPRESIDENT JOE BIDEN\nx\nNEW: @POTUS will deliver remarks at the US Capitol on January 6 to mark anniversary of Capitol siege\n Mike Memoli (@mikememoli) January 2, 2022\nx\nReadout: President Biden today with President Volodymyr Zelenskyy of Ukraine.",
    "pic.twitter.com/Zy7IBAN1c4\n The Hill (@thehill) January 3, 2022\nx\nHogan administration found to use disappearing messaging app to communicate with staff https://t.co/265DCFV0t7 pic.twitter.com/fSBnueIipK\n The Hill (@thehill) January 2, 2022\nNEW YORK CITY\nx\nNYC's new mayor, Eric Adams, has vowed to keep New York City's vaccine mandate for private-sector employees in place.",
    " Kyle Griffin (@kylegriffin1) January 2, 2022\nGOP REP. MARY MILLER\nx\nGOP Rep. Mary Miller announced that she plans to run for another House term, launching a bid in the state's newly drawn 15th Congressional District and waging a primary challenge to fellow Republican incumbent Rep. Rodney Davis.https://t.co/NEOYJdUR23\n The Hill (@thehill) January 2, 2022\nCO. GOV.",
    "pic.twitter.com/y50zjUMZr0\n The Hill (@thehill) January 3, 2022\nx\nGOP @GovLarryHogan on 01/06: \"Let's face it  there has been an amazing amount of disinformation that's been spread over the past year and many people are consuming that disinformation and believing it as if it's fact.",
    "pic.twitter.com/LD0nMmJofP\n The Hill (@thehill) January 2, 2022\nx\nJan. 6 panel chair says \"significant testimony\" shows White House \"had been told to do something\" https://t.co/3yriFIuQDW pic.twitter.com/oFhvo1mQDx\n The Hill (@thehill) January 2, 2022\nREPUBLICAN REP. LIZ CHENEY\nx\n.",
    "https://t.co/tSmWCMrLao pic.twitter.com/pxLnGYmcZB\n The Hill (@thehill) January 2, 2022\nx\nRep. @BennieGThompson on getting 01/06 documents: \"What he's doing is the typical Donald Trump modus operandi  he sues, he goes to court, he tries to delay.",
    "https://t.co/gWe2Ulfcrk\n Sewell Chan (@sewellchan) January 1, 2022\nTRUMP\nx\nMajority condemns Jan. 6 attack, says Trump at least partially to blame https://t.co/C6dDh0DwME pic.twitter.com/xYFJqCYqX2\n The Hill (@thehill) January 2, 2022",
    "pic.twitter.com/qYUr1LcwBH\n The Hill (@thehill) January 2, 2022\nREP. BENNIE THOMPSON\nx\nRep. @BennieGThompson on 01/06: \"We have significant testimony that leads us to believe that the White House had been told to do something.",
    " Kyle Griffin (@kylegriffin1) January 2, 2022\nx\nJUST IN: Biden, Harris to speak on anniversary of Capitol insurrection https://t.co/FkFMFfHgiD pic.twitter.com/NoqZVTo7fh\n The Hill (@thehill) January 2, 2022\nEDUCATION SEC.",
    " Ben Siegel (@bensiegel) January 2, 2022\nMTG\nx\nTwitter has permanently banned Georgia Republican conspiracy theorist Marjorie Taylor Greene's account \"for repeated violations of our COVID-19 misinformation policy.\"",
    "https://t.co/O4R1RhzioD\n Kyle Griffin (@kylegriffin1) January 2, 2022\nx\nA New York doughnut shop has taken the city by storm, recently boasting a waiting list of 10,000 preorders for the Filipino-inspired desserts.",
    "CARDONA\nx\nEducation @SecCardona: \"We have to have the will to make sure that we do everything in our power to keep our children in the classroom learning with their peers, with their teachers.",
    "@RepLizCheney on @ThisWeekABC: We have firsthand testimony that [Trump's] daughter Ivanka went in at least twice to ask him to please stop this violence? during the Jan. 6 riot.",
    "President Biden made clear that the United States and its allies and partners will respond decisively if Russia further invades Ukraine.",
    "LARRY HOGAN\nx\nGOP @GovLarryHogan on 01/06: \"We were trying to send the national guard and we kept requesting up and down the flagpole.",
    "Just a few days ago, you were celebrating Christmas and hanging your stockings  and now home and hearth have been destroyed.\"",
    "https://t.co/uAiEYeNeoM pic.twitter.com/ypT8x6vma8\n The Hill (@thehill) January 2, 2022\nREP. GOV.",
    "Now, a state-financed audit in four major counties has turned uppretty much nothing.",
    "Let's not forget the emotional impact last year had on our students and educators.\"",
    "The secretary of state chose New Year's Eve to disclose this news.",
    "[...] We were repeatedly denied the approval to send the guard.",
    "@jaredpolis: \"For many it seams like a surreal experience.",
    "[...] We have to have access to the records.\"",
    "We want to verify all of it.\"",
    "[...] It took 2.5 hours.\"",
    "JARED POLIS\nx\nCO Gov.",
    "[...] It's insane.\""
  ]
}