{
  "id": 92,
  "mediaId": 19,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Poll: Joe Biden's Approval Rating in Delaware Underwater by 3 Points",
  "image": "https://media.breitbart.com/media/2022/04/Biden-at-Presser-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/07/poll-joe-bidens-approval-rating-in-delaware-underwater-by-3-points/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    2087,
    2087,
    1147,
    1147,
    1248,
    1248,
    146,
    146,
    2969,
    2969,
    2951,
    2951,
    2881,
    2881,
    2590,
    2590,
    2643,
    2643,
    2782,
    2782
  ],
  "sentences": [
    "In April, Biden's approval rating was 50 percent in Delaware, dropping from 62 percent at a similar time last year, a Morning Consult poll revealed.",
    "Former President Trump has scheduled a rally for Saturday, May 28, 2022, at 4:00 p.m. MDT on Memorial Day weekend to boost support for Hageman.",
    "Manchin also opposes Biden's Green New Deal-like energy agenda, which would transpose the American economy from capitalism to socialism.",
    "Biden's respective ratings are important because Rep. Liz Cheney (R-WY) and Sen. Joe Manchin (D-WV) are facing political headwinds.",
    "Biden holds a net positive approval rating in Democrat states like Vermont, California, Washington, New York, and Maryland.",
    "Cheney has allied herself with Democrats and refused to support America First policies, which are very popular.",
    "West Virginia, a state that voted for Trump in 2020 by nearly 40 points, is represented by Democrat Manchin.",
    "President Biden's approval rating is underwater in his home state of Delaware, a Thursday Civiqs poll found.",
    "For instance, Manchin opposes nuking the filibuster to codify abortion with a simple majority vote.",
    "Biden's favorability rating in Delaware is 46 percent, while his disapproval rating is 49 percent.",
    "Biden's highest disapproval rating is in Wyoming (77 percent) and West Virginia (75 percent).",
    "Biden's approval rating, where he was a senator for 36 years, has shrunk in recent weeks.",
    "In Wyoming, Cheney is running for reelection against Trump-endorsed Harriet Hageman.",
    "The senator has routinely opposed many but not all of Biden's radical initiatives.",
    "However, in Rhode Island, Biden's net approval rating is just +3 points.",
    "In 41 states, the president is underwater, according to the Civiqs poll.",
    "Biden's net approval rating in his home state is negative three points.",
    "Follow Wendell Huseb on Twitter and Gettr @WendellHuseb.",
    "He is the author of Politics of Slave Morality.",
    "In Illinois, Biden's net approval rating is +1.",
    "The primary will be held on August 16."
  ]
}