{
  "id": 93,
  "mediaId": 238,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Opinion Our democracy at home depends on preserving freedom in Ukraine",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/06/cheney-auchincloss-democracy-ukraine/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1248,
    2030,
    2087,
    3094,
    146,
    562,
    2888,
    2942,
    2945,
    2976
  ],
  "sentences": [
    "The two of us have frequently been on opposite sides this term, including on national security issues such as President Biden's withdrawal from Afghanistan, which one of us (Cheney) opposed and the other (Auchincloss) supported.",
    "But from deep-red Wyoming to deep-blue Massachusetts, Republicans and Democrats must demonstrate to our allies and our enemies alike that there are no half-measures on the front lines of the free world.",
    "To buttress Ukrainian willpower, the United States should rally its NATO allies to make it clear that the sovereignty of Ukraine is not negotiable, and Putin must not benefit from his aggression.",
    "Last week, we both voted for the Ukraine Democracy Defense Lend-Lease Act, which, like its namesake from World War II, will enable more materiel support for an ally whose cause is existential.",
    "And it should work closely with European allies to wield primary and secondary sanctions to blockade Russian oil exports to reduce Moscow's ability to fund its war machine.",
    "What began as a war of maneuver, in which speed and mobility were critical, is becoming a war of attrition, in which firepower and willpower are ever more important.",
    "As a Republican congresswoman from Wyoming and a Democratic congressman from Massachusetts, we have firsthand experience with the partisan clashes in Washington.",
    "If the United States and its allies cannot prevent and punish war crimes right on NATO's border, then enemies further afield, big and small, will be emboldened.",
    "It must be the policy of the United States that the strategic objective in Ukraine is victory for a free and democratic Ukraine, and defeat for Vladimir Putin.",
    "But from East Asia to Europe, Africa to Latin America, they are threaded together by the same existential question: Is democracy on the march, or in retreat?",
    "In the United States, across party lines, we know that our own security requires the survival of freedom and the defeat of Russian forces in Ukraine.",
    "To balance the disparity in firepower, the U.S. government must guarantee weapons, training and intelligence support that Ukrainian forces can use.",
    "With our voices and votes, members of Congress must demonstrate bipartisan support for a policy of victory for the people of Ukraine.",
    "The United States  and Congress  must continue to deliver a strong and unequivocal answer, because democracy everywhere is fragile.",
    "The CCP opposes the postwar order and seeks to replace it with a global surveillance state that would extinguish freedom.",
    "Neither the United States nor the world will sit silently by as Russia commits atrocities and war crimes across Ukraine.",
    "In this order, might does not make right; under this order, freedom, prosperity and human rights have all advanced.",
    "If successful, Putin's forces will landlock and dismember the country  and may attack the capital again.",
    "Liz Cheney, a Republican, is Wyoming's at-large representative in the U.S. House of Representatives.",
    "Since 1945, the United States has been the linchpin of the postwar, rules-based international order.",
    "The Russian president has long sought to divide, disorient and demoralize the U.S. body politic.",
    "Jake Auchincloss, a Democrat, represents Massachusetts' 4th Congressional District in the House.",
    "The Chinese Communist Party (CCP) wants to see the United States and NATO fail in this effort.",
    "Hong Kong has been the most notable casualty of the CCP's targeting of the postwar order.",
    "Russia is now fighting for complete control of Donbas and southern Ukraine.",
    "The United States is critical to sustaining both for our Ukrainian allies.",
    "Strains of authoritarianism here at home make that painfully clear.",
    "Putin, in particular, must be under no illusion about U.S. resolve.",
    "We will not remain neutral in this fundamental battle for freedom.",
    "In combating tyranny overseas, we strengthen our freedom at home.",
    "And there should be no partisan divide among members in Congress.",
    "But on the issue of Ukraine, there is no daylight between us.",
    "The war in Ukraine entered a pivotal new phase on April 19.",
    "In defending Ukraine's democracy, we stand up for our own.",
    "The outcome in Ukraine will reverberate across the world.",
    "We in Congress have an important role in this commitment.",
    "The strength of our democracy here at home depends on it.",
    "The United States must stand with the people of Ukraine.",
    "Democracies, though, draw succor from one another.",
    "Many experts predict Taiwan is their next target.",
    "Each potential flash point is different.",
    "His efforts will not succeed.",
    "In this, we are united."
  ]
}