{
  "id": 94,
  "mediaId": 424,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Meet the Poster Boy for the GOP's Trumpian Cult of Personality",
  "image": "https://www.thenation.com/cdn-cgi/image/width=896,quality=80,format=auto/wp-content/uploads/2022/05/GettyImages-1240431840.jpg",
  "link": "https://www.thenation.com/article/politics/jd-vance-trump-cult/",
  "mediaOutlet": "The Nation ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Nichols",
  "authorUrl": "https://www.thenation.com/authors/john-nichols/",
  "termIds": [
    946,
    1147,
    2005,
    2524,
    3094,
    428,
    571,
    2609,
    2845,
    2976
  ],
  "sentences": [
    "In a competitive, Republican-leaning district in northeast Ohio, Republican primary voters nominated Trump-endorsed candidate Madison Gesiotto Gilbert, a member of the Women for Trump advisory board who in 2016 wrote a column headlined, Why I'm a Miss USA competitor supporting and inspired by Donald Trump.? In a competitive northwest Ohio district, Republicans rejected a prominent state senator and a state representative in favor of J.R. Majewski, a political newcomer who attended Trump's January 6 Stop the Steal? rally, mouthed QAnon fantasies, and painted Trump slogans on his 19,000-square-foot front yard.",
    "After several years of working the circuit of county party dinners and conservative gatherings from Chillicothe to Ashtabula, and even after his former boss (billionaire Peter Thiel) poured more than $10 million into an advertising campaign to pump up his flailing candidacy, Vance was on April 14 polling at just 10 percent, languishing in fifth place among the Republican competition with less than three weeks to go before the primary.",
    "A corporate lawyer and venture capitalist who achieved fame as the author of a lamentable book that purported to tell the story of working-class people in rural Americadespite the fact that its author had grown up in a midsize city, graduated from Yale Law School, and spent much of his adult life cavorting with billionaires in northern CaliforniaVance returned to his native Ohio only in 2017.",
    "Then, on April 15, Donald Trump endorsed Vance, even though his pick had opposed the former reality-TV star's 2016 presidential campaign, back in the day when the author was referring to Trump as a total fraud? and, potentially, America's Hitler.? Three other Ohio candidates were begging for Trump's endorsement, but Vance beat them out by groveling.",
    "He scrubbed his Twitter accountdeleting anti-Trump tweets such as the one from 2017 that declared, In 4 years, I hope people remember that it was those of us who empathized with Trump's voters who fought him the most aggressively?and went on Fox to expressly apologize for offending the dear leader.",
    "He arrived with political ambitions and began positioning himself as Trump's mini-me?: a millionaire populist with a penchant for making the sort of outrageously racist and xenophobic pronouncements that he once condemned his political benefactor for uttering.",
    "Mandel, and he's doing great.?\nJosh Mandel, the former Ohio state treasurer who was the front-runner in the race at the time that Trump made his endorsement, had tried everything to win the former president's favor.",
    "It didn't matter that the former president barely knew the candidate he was endorsing, or that he would eventually flub his choice's name when he told a rally crowd in Ohio, We've endorsedJ.P., right?",
    "For Vance, a shameless self-promoter with an ego almost as outsize as that of the former president, his first race for public office has provided a humiliating reminder that it's Trump's party.",
    "So much so that on Tuesday night, when the results were finally tabulated, Vance had defeated Mandel by almost 90,000 votes, and the former statewide official barely scraped into second place.",
    "Miller's campaign had initially targeted US Representative Anthony Gonzalez, a conservative Republican who voted to impeach the former president after the January 6 insurrection.",
    "It can raise a Hillbilly Elegy huckster out of the pack and make him the nominee for a Senate seat once held by John Glenn and Robert Taft Jr.\nVance didn't win on Tuesday.",
    "It's even possible that Representative Liz Cheney, a neoconservative firebrand who broke with Trump following the insurrection, could win another term in Wyoming.",
    "Because the Republican Party is no longer the party of Lincoln,? or even the party of Reagan.? It is no longer even a political party in any conventional sense.",
    "In Vance's case, the invite came late, and only after the desperate candidate had abandoned his past, his values, and his last shred of dignity.",
    "Vance was Donald Trump's candidate, which is all that matters anymore in a Republican Party where Trump's wish is the electorate's command.",
    "Vance Doesn't Know About France\nIt was a pathetic exercise in precisely the sort of political grasping that Vance once claimed to despise.",
    "It's a subsidiary of the Trump Organizationa cult of personality with no conscience, no soul, no purpose except to please its conqueror.",
    "In the first primary election, Texas's in March, every one of the candidates Trump endorsed won their statewide and congressional races.",
    "That's the reality all the pundits who keep imagining that the former president might be losing his grip on the GOP need to recognize.",
    "Vance secured Ohio's Republican US Senate nomination Tuesday not by impressing the voters of Ohio but by winning the favor of one man.",
    "After Trump chose Vance's celebrity and groveling over Mandel's experience and more consistent conservative vision, the race turned.",
    "Scandal-plagued former Trump aide Max Miller was nominated in a safely Republican congressional district outside Cleveland.",
    "And the rule in the contests that are charting the destiny of the Republican Party is that Trump is not just influential.",
    "Mandel, er, Vance, who was saved from the political scrapheap by the man the author once dismissed as cultural heroin.?",
    "But then, after the state's redistricting, Miller moved into the district of six-term US Representative Bob Gibbs.",
    "His power is greatest in federal contests, especially open-seat races like the one for Ohio's Senate seat.",
    "That doesn't mean that Trump's endorsed candidates130, so farwill win every primary race in 2022.",
    "Majewski, Gilbert, and Miller will run this fall on a Trumped-up Republican ticket with J.D.",
    "There may still be some Republican governors who can survive without a Trump endorsement.",
    "It was a clean sweep for all 22 of Trump's picks in the neighboring Great Lakes states.",
    "Unwilling to run against Trump's pick, Gibbs followed Gonzalez into retirement.",
    "Trump's endorsed candidates elbowed aside veteran Republicans all across Ohio.",
    "Ohio Republicans showed little interest in Vance's bid for their party's nod.",
    "Gonzalez quit a planned reelection campaign rather than face Trump's wrath.",
    "And the same thing happened on Tuesday in the Ohio and Indiana primaries.",
    "Despite his celebrity, despite Thiel's big money, Vance seemed doomed.",
    "Such is the power of a Trump endorsement in today's Republican Party.",
    "And it got him nowhere in the initial stages of the campaign.",
    "Everyone else is just a hanger-on, pleading for an invite.",
    "Trump is the Dr. Frankenstein of the Republican Party.",
    "Subscribe now for as little as $2 a month!",
    "But those are the exceptions to the rule.",
    "He can resurrect the politically dead.",
    "The contrition tour satisfied Trump.",
    "And for good reason.",
    "Now, he's a nominee.",
    "Vance was a loser.",
    "He's definitional.",
    "Fast, and hard.",
    "Trump did.",
    "What J.D.",
    "J.D.",
    "Why?",
    "J.D."
  ]
}