{
  "id": 96,
  "mediaId": 19,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Conservative Group Plasters Anti-Liz Cheney Billboards Across Wyoming",
  "image": "https://media.breitbart.com/media/2022/05/Liz-Cheney-Wyoming--640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/06/conservative-group-plasters-anti-liz-cheney-billboards-across-wyoming/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    1081,
    1147,
    1248,
    1335,
    3085,
    3094,
    428,
    633,
    2749,
    2976
  ],
  "sentences": [
    "Rep. Liz Cheney (R-WY), who was stripped of her House Republican leadership position after standing with Democrats to impeach former President Donald Trump, attempted to blame Trump for dragging the U.S. backward and making us complicit in his efforts to unravel our democracy?:\nNEWS: CHENEY removed from her post by voice vote\nNotably, far-left Rep. Adam Schiff (D-CA) has spoken highly of the so-called Republican, calling her a person of great courage and conviction.?\nTrump has spoken out sharply against RINO? Cheney time and time again, ultimately endorsing her challenger in September.",
    "The group, led by Republican strategists Andy Surabian and James Blair, plans to leave the billboards up until the state's primary election day, or Tuesday, August 16:\nWyoming Values will continue to aggressively expose Liz Cheney as the Pelosi puppet she truly is from now until election day,? Surabian said in a statement.",
    "While Liz Cheney sold Wyoming out to the swamp, Harriet Hageman will fight for the conservative values Wyomings care about and we're confident that she will defeat Cheney in August,? he added.",
    "The conservative group Wyoming Values PAC is plastering anti-Liz Cheney billboards across Wyoming, encouraging voters to support her Trump-backed challenger Harriet Hageman.",
    "Harriet has my Complete and Total Endorsement in replacing the Democrats' number one provider of sound bites, Liz Cheney,? he wrote.",
    "Make America Great Again!?\nThis week, Trump announced an upcoming rally with Hageman, taking place in Casper, Wyoming, on May 28.",
    "Vote for Hageman? and appear in Casper, Rawlins, Cheyenne, and Laramie.",
    "Unlike RINO Liz Cheney, Harriet is all in for America First.",
    "The billboards urge voters to Ditch Liz!"
  ]
}