{
  "id": 8965,
  "mediaId": 261,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Buttigieg, at least 14 others test positive for COVID-19 after Mackinac Policy Conference",
  "image": "https://www.gannett-cdn.com/presto/2021/01/29/PDTF/62fd7688-a590-4b8d-8f42-78ca1d7c2c12-AP21021627889095.jpg?crop=3935,2214,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/2022/06/06/buttigieg-positive-covid-19-mackinac-policy-conference/7532212001/",
  "sentiment": "0",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Boucher",
  "authorUrl": "https://www.freep.com/staff/5427986002/dave-boucher/",
  "termIds": [
    1682
  ],
  "sentences": [
    "More:Pfizer adds 250 new jobs to Kalamazoo plant, making it only US site to make Paxlovid ingredients\nCOVID-19 community transmission rates are low in Mackinaw City, but at a medium level on Mackinac Island, according to state data.",
    "The chamber required participants be vaccinated and show proof of vaccination in order to participate in indoor events, or show a negative COVID-19 PCR test taken within 72 hours of the conference.",
    "In a statement issued Monday afternoon, conference organizer Detroit Regional Chamber indicated it is aware of at least 15 people who tested positive after attending the conference.",
    "The seven-day test positivity rate was about 14% at the end of May, slightly down from the beginning of May but still substantially higher than rates seen in March and April.",
    "More than 2.5 million Michiganders have reported contracting COVID-19 since the start of the pandemic, with more than 36,400 dying from the disease during that time period.",
    "U.S. Transportation Secretary Pete Buttigieg and at least 14 others have tested positive for COVID-19 after covering or attending the Mackinac Policy Conference last week.",
    "\"The individuals testing positive report being asymptomatic or experiencing mild symptoms, and we wish them a speedy recovery,\" reads a statement issued by the chamber.",
    "\"Governor Whitmer continues to test regularly to ensure that she is protecting herself, her family, and those around her every day as she continues to lead our state.",
    "But data and experts show vaccinations do not prevent all infections, though inoculation overwhelmingly reduces the severity of symptoms if someone is infected.",
    "I plan to work remotely while isolating according to CDC guidelines, and look forward to when I can safely return to the office and the road,\" Buttigieg said.",
    "A chamber statement indicated the vast majority of the 1,347 conference attendees and staff submitted the required proof of vaccination.",
    "Buttigieg did not indicate when he started experiencing symptoms or whether he believes he contracted the virus at the conference.",
    "That includes Ryan Kelley, a GOP gubernatorial hopeful who declined to participate in a primary debate hosted at the conference.",
    "Buttigieg joined hundreds of politicians, business leaders, reporters and others at the conference Wednesday on Mackinac Island.",
    "However, the chamber held the debate outside and did not require vaccinations or testing for those participating in the debate.",
    "Although the pair spent substantial time together, Whitmer tested negative Monday morning, said spokesman Bobby Leddy.",
    "The chamber faced some pushback from a handful of conservatives who opposed the vaccination or testing mandate.",
    "He participated in multiple events unmasked, including press conferences and interviews, at times with Gov.",
    "The governor took a rapid test this morning, which came back negative,\" Leddy said in a statement.",
    "\"She is fully up to date on her vaccinations, and is not currently experiencing any symptoms.",
    "We wish Secretary Buttigieg a speedy recovery and hope he feels better soon.\"",
    "\"I have tested positive for COVID-19 and am experiencing mild symptoms.",
    "Governor Whitmer will continue to carry out her duties as governor.",
    "Contact Dave Boucher at dboucher@freepress.com or 313-938-4591.",
    "Only 14 provided proof of a negative PCR test.",
    "Follow him on Twitter @Dave_Boucher1.",
    "Gretchen Whitmer."
  ]
}