[
  {
    "id": 5601,
    "mediaId": 2608,
    "date": "2022-04-19",
    "sentence": "The group previously filed similar actions against Rep. Madison Cawthorn (R-N.C.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) on the same grounds, citing the 14th Amendment’s disqualification clause.",
    "author": "Adam Klasfeld",
    "title": "Federal Judge Refuses to Block Effort to Disqualify Marjorie Taylor Greene from Office Under 14th Amendment ‘Insurrection’ Prohibition"
  },
  {
    "id": 5189,
    "mediaId": 2664,
    "date": "2022-04-20",
    "sentence": "",
    "author": "Ross Williams",
    "title": "Lawsuit seeking to boot Marjorie Taylor Greene from the ballot is probably 'going nowhere': legal expert"
  },
  {
    "id": 5486,
    "mediaId": 2672,
    "date": "2022-04-22",
    "sentence": "“I don’t remember.”\nShe was asked if she talked to Rep. Andy Biggs (R-Ariz.)\n“I don’t remember.”\nShe was asked if she talked to Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.)\n“Sorry, I don’t remember.”\nWhat about anyone in the White House?",
    "author": "Ryan Bort",
    "title": "‘I Don’t Remember’: Marjorie Taylor Greene Comes Down With Case of Jan. 6 Amnesia While Under Oath"
  },
  {
    "id": 4798,
    "mediaId": 2754,
    "date": "2022-04-23",
    "sentence": "There are similar efforts to block members like Arizona GOP Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs from appearing on state ballots.",
    "author": "Tyler Durden",
    "title": "Destroying Democracy To Save It? Court Advances Effort To Block GOP Candidates From Ballots"
  },
  {
    "id": 4733,
    "mediaId": 2642,
    "date": "2022-04-24",
    "sentence": "A judge in Arizona has thrown out lawsuits that sought to disqualify Reps. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) and Andy Biggs (R-Ariz.) from serving in their current capacities in Congress.",
    "author": "WD Staff",
    "title": "AZ Judge Kicks Out Disqualification Complaints For Two GOP Representatives"
  }
]