[
  {
    "id": 2320,
    "mediaId": 2573,
    "date": "2022-02-08",
    "sentence": "Cosponsors on the bill include Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., <span class='selected-term'>Paul Gosar</span>, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., and Bill Posey, R-Fla.\nRosendale said the prioritizing of the southern border reflects what he believes are the priorities of his constituents, who are concerned about things like the flood of fentanyl coming into Montana and other states.",
    "author": "",
    "title": "Rep. Rosendale introduces bill to block military assistance to Ukraine until US border is secured"
  },
  {
    "id": 10735,
    "mediaId": 2526,
    "date": "2022-03-08",
    "sentence": "[Emphasis added]\nReps. Andy Biggs (R-AZ), Bob Good (R-VA), Matt Gaetz (R-FL), <span class='selected-term'>Paul Gosar</span> (R-AZ), Jody Hice (R-GA), Mary Miller (R-IL), Ralph Norman (R-SC), Bill Posey (R-FL), and Randy Weber (R-TX) are co-sponsoring the legislation.",
    "author": "John Binder",
    "title": "Matt Rosendale: No Taxpayer Money for Ukraine Until Border Wall Is Done"
  },
  {
    "id": 11001,
    "mediaId": 2641,
    "date": "2022-03-08",
    "sentence": "Rosendale wrote on Twitter that “the American people are sick and tired of career politicians consistently putting the interests of foreign nations above our own, we must put America first.”\nLast month, Rosendale introduced the “Secure America’s Borders First Act.”\nAccording to Breitbart, Rosendale’s bill, which is co-sponsored by Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., <span class='selected-term'>Paul Gosar</span>, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., Bill Posey, R-Fla., and Randy Weber, R-Texas., would require the federal government to restart building the border wall and to continue building 30-foot steel bollard barriers along the border with Mexico.",
    "author": "Jeremy Frankel",
    "title": "Rep. Rosendale Leads Effort to Stop Ukraine Funding Without Border Wall Completion"
  },
  {
    "id": 10785,
    "mediaId": 2557,
    "date": "2022-03-10",
    "sentence": "Ilhan Omar (Minn.)\nRepublicans:\nAndy Biggs (Ariz.)\nMarjorie Taylor Greene (Ga.)\nLouie Gohmert (Texas)\nDan Bishop (N.C.)\nGlenn Grothman (Wis.)\nLauren Boebert (Colo.)\nTom Tiffany (Wis.)\nMatt Gaetz (Fla.)\n<span class='selected-term'>Paul Gosar</span> (Ariz.)\nClay Higgins (La.)",
    "author": "DML News App",
    "title": "REPORT: The 17 lawmakers who voted against the Russian oil ban"
  }
]