[
  {
    "id": 12748,
    "mediaId": 2520,
    "date": "2022-02-27",
    "sentence": "A pair of prominent Republicans broke the disturbing and rather deafening silence within the once-Grand Old Party over the weekend, calling out Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene for participating in a conference catering to white nationalists.",
    "author": "Laurie Roberts",
    "title": "Where Sen. Mitt Romney sees 'morons', Arizona Gov. Doug Ducey sees allies"
  },
  {
    "id": 12815,
    "mediaId": 2520,
    "date": "2022-02-28",
    "sentence": "Senate lacks the votes to end early voting\nWhich matters not a hoot to the Republican Party because this isn’t really about “election integrity.” It isn’t about “restoring voter confidence” in elections that Ward, Senate President Karen Fann, Rep. <span class='selected-term'>Paul Gosar</span>, Sen. Wendy Rogers and other GOP leaders have sought at every turn to undermine.",
    "author": "Laurie Roberts",
    "title": "The Arizona Republican Party is so scared of you that it's suing to outlaw early voting"
  },
  {
    "id": 13210,
    "mediaId": 3987,
    "date": "2022-02-28",
    "sentence": "Lt. Gov of Idaho Janice McGeachin, Rep. <span class='selected-term'>Paul Gosar</span> (AZ-04), and Arizona State Senator Wendy Rogers all appeared at the conference via video.",
    "author": "Zachary Mueller",
    "title": "A Weekend in Orlando Demonstrates the Republican Party is Going Down a Dark Path Towards White Nationalism"
  },
  {
    "id": 12499,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "While Lake did not respond to questions about Rogers, she has not distanced herself from Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who spoke at the same Nick Fuentes' white nationalist America First Political Action Conference in Florida.",
    "author": "Bob Brigham",
    "title": "Censured Republican is so toxic she’s become an issue in Arizona governor’s race: report"
  },
  {
    "id": 15329,
    "mediaId": 8475,
    "date": "2022-03-07",
    "sentence": "Speakers at the event included the founder and CEO of MyPillow, Mike Lindell and the controversial GOP Representative <span class='selected-term'>Paul Gosar</span>, who's tied to the alleged white nationalist and anti-Semite Nick Fuentes of the \"America First\" podcast and political action conference.",
    "author": "Michael McDaniel",
    "title": "Az gov candidate Kari Lake holds Trump-inspired rally with Mike Lindell & Rep. Paul Gosar"
  }
]