[
  {
    "id": 4218,
    "mediaId": 2766,
    "date": "2022-01-19",
    "sentence": "Congressman <span class='selected-term'>Paul Gosar</span> (R-AZ) recently shared with his constituents new photos and video of the latest surge of illegal aliens crossing the southern border in Yuma, Arizona.",
    "author": "Catherine Mortensen",
    "title": "Joe Biden’s Presidency: How It Started… How It’s Going"
  },
  {
    "id": 3622,
    "mediaId": 2618,
    "date": "2022-01-21",
    "sentence": "",
    "author": "Scott Hounsell",
    "title": "Emails Confirm Hunter Biden Invested in Chinese Government-Owned Companies"
  },
  {
    "id": 9190,
    "mediaId": 2724,
    "date": "2022-03-21",
    "sentence": "— Kevin McCarthy (@GOPLeader) March 20, 2022\nRELATED: McCarthy May Give Marjorie Taylor Greene, <span class='selected-term'>Paul Gosar</span> ‘Better’ Committee Assignments If GOP Takes Back Congress\nWill McCarthy Boot Omar and Swalwell Too?",
    "author": "Rusty Weiss",
    "title": "McCarthy Vows To Kick Adam Schiff Off Intel Committee If GOP Wins Back The House"
  },
  {
    "id": 9057,
    "mediaId": 2551,
    "date": "2022-03-29",
    "sentence": "The effort is also backed by Reps. Andy Biggs (R-Ariz.), Dan Bishop (R-N.C.), Louie Gohmert (R-Texas), <span class='selected-term'>Paul Gosar</span> (R-Ariz.), Marjorie Taylor Greene (R-Ga.) and Thomas Massie (R-Ky.).",
    "author": "Elizabeth Elkind",
    "title": "GOP Rep. Matt Gaetz presses FBI's cyber chief on the whereabouts of Hunter Biden's laptop"
  },
  {
    "id": 9162,
    "mediaId": 2662,
    "date": "2022-03-29",
    "sentence": "However, there is already a large amount of GOP support, with fellow Reps. Thomas Massie (KY), Dan Bishop (NC), Andy Biggs (AZ), <span class='selected-term'>Paul Gosar</span> (AZ), Louie Gohmert (TX), and Marjorie Taylor Greene (GA) all having co-sponsored the bill so far.",
    "author": "Julian Conradson",
    "title": "“Spook Who Cried Wolf”: Matt Gaetz Introduces Resolution to Strip Security Clearances From Dozens of Intelligence Officials Who Falsely Labeled Hunter’s ‘Laptop From Hell’ as “Russian Disinformation”"
  },
  {
    "id": 7123,
    "mediaId": 2724,
    "date": "2022-03-31",
    "sentence": "The Republican’s proposal reads, “The 51 signatories of the letter who publicly and falsely decried Hunter Biden’s laptop to be Russian disinformation should be barred from holding any level of security clearances indefinitely.”\nGaetz’s resolution is co-sponsored so far by fellow Republican Reps. Thomas Massie, Dan Bishop, Andy Biggs, <span class='selected-term'>Paul Gosar</span>, Louie Gohmert, and Marjorie Taylor Greene.",
    "author": "John Hanson",
    "title": "Rep. Gaetz Introduces Resolution To Strip Security Clearances From Officials Who Called Hunter Biden Laptop Story ‘Russian Disinformation’"
  },
  {
    "id": 7449,
    "mediaId": 2833,
    "date": "2022-04-05",
    "sentence": "The effort is also backed by Reps. Andy Biggs (R-Ariz.), Dan Bishop (R-N.C.), Louie Gohmert (R-Texas), <span class='selected-term'>Paul Gosar</span> (R-Ariz.), Marjorie Taylor Greene (R-Ga.) and Thomas Massie (R-Ky.).",
    "author": "Baxter Dmitry",
    "title": "Gaetz Pushes To Strip Security Clearance From FBI Agents Who ‘Lost’ Hunter Biden’s Laptop"
  }
]