[
  {
    "id": 2320,
    "mediaId": 2573,
    "date": "2022-02-08",
    "sentence": "Cosponsors on the bill include Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., <span class='selected-term'>Paul Gosar</span>, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., and Bill Posey, R-Fla.\nRosendale said the prioritizing of the southern border reflects what he believes are the priorities of his constituents, who are concerned about things like the flood of fentanyl coming into Montana and other states.",
    "author": "",
    "title": "Rep. Rosendale introduces bill to block military assistance to Ukraine until US border is secured"
  },
  {
    "id": 93,
    "mediaId": 2594,
    "date": "2022-02-23",
    "sentence": "The signatories include Democratic Reps Alexandria Ocasio-Cortez and Cori Bush alongside Trump-allied GOP representatives including Matt Gaetz and <span class='selected-term'>Paul Gosar</span> as well as independent lawmakers like Ilhan Omar.",
    "author": "Sravasti Dasgupta",
    "title": "Dozens of lawmakers including AOC and Matt Gaetz ask Biden to seek Congress approval to send troops to Ukraine"
  },
  {
    "id": 158,
    "mediaId": 2664,
    "date": "2022-02-25",
    "sentence": "Biden did the impossible and brought war to Europe,\" said Arizona congressman <span class='selected-term'>Paul Gosar</span>, one of Trump's most loyal backers, who has been accused of ties with white nationalists.",
    "author": "Agence France-Presse",
    "title": "Republicans hammer Biden over Russia's invasion of Ukraine"
  },
  {
    "id": 13023,
    "mediaId": 2688,
    "date": "2022-03-01",
    "sentence": "McCarthy Says He Plans To Meet With MTG To Discuss White Nationalist Appearance\nHouse Minority Leader Kevin McCarthy (R-CA) said on Monday that it was “appalling and wrong” for far-right Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) to speak at the America First Political Action Conference (AFPAC) organized by white nationalist Nick Fuentes this weekend.",
    "author": "Cristina Cabrera",
    "title": "Russia Bombards Kharkiv As War Enters More Brutal Phase"
  },
  {
    "id": 12702,
    "mediaId": 2641,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz.\nSen. Lindsey Graham, R-S.C., was also introducing a resolution in the Senate that would back Ukraine's claim in international court that Putin and his \"cronies\" have committed war crimes.",
    "author": "Eric Mack",
    "title": "House Passes Resolution to Support for Ukraine 426-3"
  },
  {
    "id": 12762,
    "mediaId": 2594,
    "date": "2022-03-02",
    "sentence": "The resolution approved by the House says it “stands steadfastly, staunchly, proudly and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.”\nIt calls for an immediate cease-fire and the removal of Russian forces from Ukraine, pledges U.S. support for the Ukrainian resistance and vows to provide “significant additional aid and humanitarian relief to Ukrainian refugees fleeing Russia’s aggression.”\nAll but three members of the House voted for the resolution: Republican Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "author": "Via AP news wire",
    "title": "US House 'staunchly, proudly' passes resolution for Ukraine"
  },
  {
    "id": 11497,
    "mediaId": 2594,
    "date": "2022-03-08",
    "sentence": "While some members of the Republican Party like Sen Ted Cruz have claimed that “[t]he reason that Russia is invading Ukraine is because of enormous mistakes that the Biden administration has made”, other members like Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> attended a conference billed as a far-right alternative to the Conservative Political Action Conference (CPAC) last month where the event’s host quipped that comparisons of Vladimir Putin to Adolf Hitler could be complimentary, and members of the crowd chanted Mr Putin’s name.",
    "author": "John Bowden",
    "title": "Trump attacks Biden with Ukraine abuse, claims Europe is using him"
  },
  {
    "id": 10800,
    "mediaId": 2573,
    "date": "2022-03-08",
    "sentence": "And I want to give my colleagues Matt Rosendale and <span class='selected-term'>Paul Gosar</span> a chance to be harangued as well, because they were the only who joined me in voting this way.",
    "author": "",
    "title": "'The Ingraham Angle' on humanitarian crisis in Ukraine"
  },
  {
    "id": 10746,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "There were just three votes against that resolution of support: Massie, <span class='selected-term'>Paul Gosar</span>, and Matt Rosendale.",
    "author": "Mark Sumner",
    "title": "Ukraine update: 'R' is for Russia"
  },
  {
    "id": 10744,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "Other far-right members could also skip the event: Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> both recently attended an event hosted by a white nationalist where guests broke into a chant of “Putin!",
    "author": "John Bowden",
    "title": "Six things to watch for when Ukraine’s president Zelensky addresses Congress"
  }
]