[
  {
    "id": 4486,
    "mediaId": 2810,
    "date": "2022-01-13",
    "sentence": "A number of House members have been identified by planners of the “Stop the Steal” rally as having collaborated with them—either directly or via assigned staffers—including Marjorie Taylor Greene of Georgia, <span class='selected-term'>Paul Gosar</span> of Arizona, Lauren Boebert of Colorado, Mo Brooks of Alabama, Andy Biggs of Arizona, and Louie Gohmert of Texas.",
    "author": "John Nichols",
    "title": "Madison Cawthorn’s Incitement of Insurrection Should Knock Him Off the Ballot"
  },
  {
    "id": 3744,
    "mediaId": 2636,
    "date": "2022-01-25",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "",
    "title": "Cawthorn Challenge Raises the Question: Who Is an ‘Insurrectionist’?"
  },
  {
    "id": 4059,
    "mediaId": 2679,
    "date": "2022-01-25",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "Jonathan Weisman",
    "title": "Legal challenge to GOP Rep. Madison Cawthorn asks: Who is an ‘insurrectionist’?"
  },
  {
    "id": 4018,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "They include Cawthorn and six other House members: Rep. Andy Biggs (R-Ariz.); Rep. Lauren Boebert (R-Colo.); Rep. Mo Brooks (R-Ala.); Rep. Louie Gohmert (R-Texas); Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.); and Rep. Marjorie Taylor Greene (R-Ga.).",
    "author": "Rick Henderson",
    "title": "The risky plan to prevent Congress' Jan. 6 sympathizers from running for re-election"
  },
  {
    "id": 3613,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 1926,
    "mediaId": 2550,
    "date": "2022-02-07",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. Liz Cheney, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. Madison Cawthorn, Lauren Boebert, and <span class='selected-term'>Paul Gosar</span> ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump ‘is the worst president the U.S. ever had’"
  },
  {
    "id": 12487,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "On one side you have the Trump/MAGA/tea party wing of the GOP, filled with detestable folks like Reps. Lauren Boebert, Matt Gaetz, Madison Cawthorn, <span class='selected-term'>Paul Gosar</span>, and Marjorie Taylor Greene.",
    "author": "",
    "title": "War in the GOP: Have Marjorie Taylor Greene and Paul Gosar made one too many mistakes?"
  },
  {
    "id": 11193,
    "mediaId": 5308,
    "date": "2022-03-10",
    "sentence": "While Republican congressional leaders condemned the invasion, Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene both spoke at a white nationalist conference last month whose organizer favorably compared Russian President Vladimir Putin to Adolf Hitler.",
    "author": "Paul Blest",
    "title": "GOP Rep. Madison Cawthorn Called President Zelenskyy a ‘Thug’"
  },
  {
    "id": 11190,
    "mediaId": 2592,
    "date": "2022-03-13",
    "sentence": "Even after the invasion, two Trump allies in the House - Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> - participated in a white nationalist conference at which participants applauded Russia's move on Ukraine and chanted Putin's name.",
    "author": "David Morgan",
    "title": "Ukraine War Becomes A Cudgel In Republican Party's Internal Conflict"
  },
  {
    "id": 10744,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "Other far-right members could also skip the event: Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> both recently attended an event hosted by a white nationalist where guests broke into a chant of “Putin!",
    "author": "John Bowden",
    "title": "Six things to watch for when Ukraine’s president Zelensky addresses Congress"
  },
  {
    "id": 9058,
    "mediaId": 2512,
    "date": "2022-03-24",
    "sentence": "If the 2022 midterms see a major red wave, even the most extreme MAGA Republicans are likely to be reelected to the U.S. House of Representatives — including Rep. Marjorie Taylor Greene of Georgia, Rep. Lauren Boebert of Colorado, Rep. Matt Gaetz of Florida and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Alex Henderson",
    "title": "How Madison Cawthorn may have doomed his reelection campaign"
  },
  {
    "id": 9671,
    "mediaId": 2741,
    "date": "2022-03-29",
    "sentence": "So we thought it was time to start a list of all the things McCarthy has had to pull a lawmaker aside for:\nThe time Representative <span class='selected-term'>Paul Gosar</span> made and disseminated a video depicting him swinging a sword at Joe Biden’s head and decapitating Alexandria Ocasio-Cortez (McCarthy told CNN he spoke to Gosar, without condemning Gosar’s behavior)\nThe time Representative Marjorie Taylor Greene called for Nancy Pelosi to be executed for treason, harassed a school-shooting survivor on the street, blamed the California wildfires on Jewish laser beams, and espoused the ideas of QAnon (McCarthy refused to discipline the congresswoman and claimed that, during a private conversation, she “recognized” that she needed to hold herself to a higher standard)\nThe time Greene spoke at a white nationalist conference (McCarthy admitted this was bad but, following a conversation with Greene, declined to hold her accountable, saying, “my conversations with my members are exactly that.”)\nThe time Representative Lauren Boebert made Islamophobic comments about Representative Ilhan Omar (McCarthy obviously refused to condemn her but, rest assured, they had a chat!)",
    "author": "Bess Levin",
    "title": "Orgies, Beheadings, Jewish Space Lasers: Everything Kevin McCarthy Has Had to “Speak” to Republican Lawmakers About"
  },
  {
    "id": 9543,
    "mediaId": 2629,
    "date": "2022-03-29",
    "sentence": "It took him a week to speak to Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who had tweeted a violent video featuring Rep. Alexandria Ocasio-Cortez.",
    "author": "Emily Singer",
    "title": "House Republicans Enraged By Cawthorn’s ‘Orgy’ And 'Cocaine Bump' Claims"
  },
  {
    "id": 9519,
    "mediaId": 5308,
    "date": "2022-03-29",
    "sentence": "House Minority Leader Kevin McCarthy, who has come under scrutiny for refusing to criticize the far-right of his party—including former President Donald Trump and Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>—reportedly said he would have a meeting with Cawthorn to talk about his comments.",
    "author": "Paul Blest",
    "title": "Congress Would Like to Know More About Madison Cawthorn’s ‘Cocaine’ ‘Orgies’ Claim"
  },
  {
    "id": 9511,
    "mediaId": 2872,
    "date": "2022-03-30",
    "sentence": "This is a man, after all, who vowed to re-seat Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> after they were stripped of their committee assignments for palling around with Nazis and joking (??)",
    "author": "Rafi Schwartz",
    "title": "Madison Cawthorn’s coke orgy comments earned him a very stern talking-to"
  },
  {
    "id": 9436,
    "mediaId": 2894,
    "date": "2022-03-30",
    "sentence": "Of course, Cawthorn isn't the only controversial member in the GOP ranks: Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, for example, both recently addressed a conference organized by a White nationalist, and received little more than a verbal rebuke from their leaders and colleagues.",
    "author": "",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 9289,
    "mediaId": 2643,
    "date": "2022-03-30",
    "sentence": "Arizona Republican <span class='selected-term'>Paul Gosar</span> was also at the America First Political Action Conference (AFPAC) in Florida.",
    "author": "Alexandra Hutzler",
    "title": "McCarthy Slammed for Being Harsher on Cawthorn Than Marjorie Taylor Greene"
  },
  {
    "id": 9778,
    "mediaId": 2532,
    "date": "2022-03-31",
    "sentence": "McCarthy's rebukes came after House Democrats had lambasted him for not doing enough to address behavior from other Republican members, namely Rep. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, who both spoke at a gathering of white nationalists last month.",
    "author": "Melissa Quinn",
    "title": "McCarthy rebukes Cawthorn over his claims that lawmakers have invited him to orgies and use drugs"
  },
  {
    "id": 7807,
    "mediaId": 2688,
    "date": "2022-03-31",
    "sentence": "Republicans’ outrage over Cawthorn’s Veep-esque account of congressional indiscretions stands in glaring contrast to their muted response to Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) speaking at a white nationalist conference last month.",
    "author": "Matt Shuham",
    "title": "North Carolina Sen. Tillis Backs Cawthorn’s Rival Amid Orgy-Gate"
  },
  {
    "id": 7782,
    "mediaId": 2699,
    "date": "2022-03-31",
    "sentence": "Yet another Freedom Caucus member, Rep. <span class='selected-term'>Paul Gosar</span>, has emerged essentially unscathed after speaking at a white supremacist conference and posting a violent anime depicting the murder of Rep. Alexandria Ocasio-Cortez.",
    "author": "Wajahat Ali",
    "title": "The GOP Was Hard to Embarrass. Then Came Madison Cawthorn."
  },
  {
    "id": 7054,
    "mediaId": 2594,
    "date": "2022-03-31",
    "sentence": "But the final straw for McCarthy was that Cawthorn dared to impugn the character of a caucus that includes the likes of <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene and Lauren Boebert.",
    "author": "Eric Garcia",
    "title": "Kevin McCarthy is to blame for Madison Cawthorn. He deserves the consequences"
  },
  {
    "id": 7729,
    "mediaId": 2550,
    "date": "2022-04-01",
    "sentence": "Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> spoke at a white nationalist event and McCarthy had a private chat with them, then went to reporters and explicitly promised that they’d get their committee assignments back if Republicans take the House.",
    "author": "Laura Clawson",
    "title": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies"
  },
  {
    "id": 7674,
    "mediaId": 2790,
    "date": "2022-04-01",
    "sentence": "This was a swifter-than-usual response from the GOP leader\nMcCarthy has had to step in to condemn various rhetoric and actions taken by members of his conference, from denouncing language used by Rep. Marjorie Taylor Greene that equated COVID-19 safety measures with the treatment of Jews during the Holocaust and more recently calling it \"appalling\" that Greene and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona attended an event led by a white nationalist.",
    "author": "Barbara Sprunt",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 7362,
    "mediaId": 2520,
    "date": "2022-04-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> sought to distance himself from Nick Fuentes in remarks Friday, saying he didn't intend to make a videotaped greeting for the white nationalist's annual conference in February, though he appeared in person at the gathering last year.",
    "author": "Ronald J. Hansen",
    "title": "'Nick's got a problem with his mouth': Rep. Paul Gosar seeks distance from white nationalist"
  },
  {
    "id": 7627,
    "mediaId": 2699,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Ben Burgis",
    "title": "Republicans Just Proved ‘Right-Wing Populism’ Is a Con Job"
  },
  {
    "id": 7304,
    "mediaId": 2664,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Sarah K. Burris",
    "title": "MAGA populism is a 'con job' — here's why"
  },
  {
    "id": 7096,
    "mediaId": 2636,
    "date": "2022-04-07",
    "sentence": "In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives <span class='selected-term'>Paul Gosar</span> and Andy Biggs and State Representative Mark Finchem, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement.",
    "author": "",
    "title": "Legal Effort Expands to Disqualify Republicans as ‘Insurrectionists’"
  },
  {
    "id": 7358,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Now Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) are getting the same challenge.",
    "author": "Sarah K. Burris",
    "title": "Two more GOP ‘insurrectionists’ face ballot challenges as voters seek to disqualify them from office"
  },
  {
    "id": 5441,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "That’s in part because the conservative Christian political party may be having all kinds of non-Christian-style drug-fueled orgies (if Madison is to be believed), and also because Cawthorn and other Republican members of Congress like Lauren Boebert and <span class='selected-term'>Paul Gosar</span> represent a new tea party-inspired rat that has climbed aboard the sinking Republican ship.",
    "author": "",
    "title": "GOP civil war: conservative outlet reports Madison Cawthorn’s outrageous spending of taxpayer money"
  },
  {
    "id": 5601,
    "mediaId": 2608,
    "date": "2022-04-19",
    "sentence": "The group previously filed similar actions against Rep. Madison Cawthorn (R-N.C.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) on the same grounds, citing the 14th Amendment’s disqualification clause.",
    "author": "Adam Klasfeld",
    "title": "Federal Judge Refuses to Block Effort to Disqualify Marjorie Taylor Greene from Office Under 14th Amendment ‘Insurrection’ Prohibition"
  },
  {
    "id": 5189,
    "mediaId": 2664,
    "date": "2022-04-20",
    "sentence": "",
    "author": "Ross Williams",
    "title": "Lawsuit seeking to boot Marjorie Taylor Greene from the ballot is probably 'going nowhere': legal expert"
  },
  {
    "id": 5573,
    "mediaId": 2644,
    "date": "2022-04-22",
    "sentence": "Only the People have the right to choose who they send to Congress.”\nSimilar challenges have been brought up against other Republican members of Congress, including Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs of Arizona as well as North Carolina Rep. Madison Cawthorn.",
    "author": "Callie Patteson",
    "title": "Marjorie Taylor Greene first congressperson to testify about Jan. 6"
  },
  {
    "id": 6128,
    "mediaId": 2608,
    "date": "2022-04-22",
    "sentence": "Asked whether she knew activist Ali Alexander—whose suspected connection to Jan. 6 is currently being scrutinized by Congress and the Department of Justice—Greene replied that she didn’t “really.”\nThe non-profit group Free Speech for People brought similar against Rep. Madison Cawthorn (R-N.C.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) on the same grounds.",
    "author": "Adam Klasfeld",
    "title": "Seeking to Prevent Her Disqualification, Rep. Marjorie Taylor Greene Claims Under Oath That She Can’t Remember Much About Talks Before Jan. 6"
  },
  {
    "id": 5994,
    "mediaId": 2608,
    "date": "2022-04-22",
    "sentence": "Their previous efforts have targeted Rep. Madison Cawthorn (R-N.C.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) on the same grounds.",
    "author": "Adam Klasfeld",
    "title": "‘This Is a Solemn Occasion’: Georgia Voters Fight to Disqualify Marjorie Taylor Greene from Ballot, Citing 14th Amendment Bar on ‘Insurrection’"
  },
  {
    "id": 5973,
    "mediaId": 2699,
    "date": "2022-04-22",
    "sentence": "“I do not remember” was Greene’s response to multiple questions about whether she spoke to government officials about the run-up to the Capitol attack, including election deniers Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) and anyone in the White House.",
    "author": "Corbin Bolies",
    "title": "‘Oh No, Wait!’: Marjorie Taylor Greene’s Own Words Haunt Her"
  },
  {
    "id": 4798,
    "mediaId": 2754,
    "date": "2022-04-23",
    "sentence": "There are similar efforts to block members like Arizona GOP Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs from appearing on state ballots.",
    "author": "Tyler Durden",
    "title": "Destroying Democracy To Save It? Court Advances Effort To Block GOP Candidates From Ballots"
  },
  {
    "id": 4733,
    "mediaId": 2642,
    "date": "2022-04-24",
    "sentence": "A judge in Arizona has thrown out lawsuits that sought to disqualify Reps. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) and Andy Biggs (R-Ariz.) from serving in their current capacities in Congress.",
    "author": "WD Staff",
    "title": "AZ Judge Kicks Out Disqualification Complaints For Two GOP Representatives"
  }
]