[
  {
    "id": 3250,
    "mediaId": 2699,
    "date": "2022-02-01",
    "sentence": "He received no money from other officials or groups last quarter, and the only support he gave was a $2,000 transfer to Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who spearheaded the efforts to overturn the 2020 election results.",
    "author": "Roger Sollenberger",
    "title": "How Matt Gaetz’s Battered Campaign Bled Almost $100,000 in 2021"
  },
  {
    "id": 3156,
    "mediaId": 2564,
    "date": "2022-02-02",
    "sentence": "The Gaetz campaign's most recent disclosures show $50,000 paid to criminal defense lawyer Marc Fernich in October\nThe only other political campaign the Florida Republican has donated to in the last three months of 2021 was fellow GOP Rep. <span class='selected-term'>Paul Gosar</span>.",
    "author": "Elizabeth Elkind",
    "title": "Matt Gaetz campaign donations shrivel up as prosecutors intensify his sex trafficking investigation"
  },
  {
    "id": 196,
    "mediaId": 2594,
    "date": "2022-02-20",
    "sentence": "Representative <span class='selected-term'>Paul Gosar</span>, who was censured by Congress after he tweeted an anime video of a character with his head cutting off the head of a character of Representative Alexandria Ocasio-Cortez’s face, also announced he would be on it.",
    "author": "Eric Garcia",
    "title": "MAGA allies Marjorie Taylor Greene and Matt Gaetz line up for Trump’s new social network ahead of launch"
  },
  {
    "id": 93,
    "mediaId": 2594,
    "date": "2022-02-23",
    "sentence": "The signatories include Democratic Reps Alexandria Ocasio-Cortez and Cori Bush alongside Trump-allied GOP representatives including Matt Gaetz and <span class='selected-term'>Paul Gosar</span> as well as independent lawmakers like Ilhan Omar.",
    "author": "Sravasti Dasgupta",
    "title": "Dozens of lawmakers including AOC and Matt Gaetz ask Biden to seek Congress approval to send troops to Ukraine"
  },
  {
    "id": 11001,
    "mediaId": 2641,
    "date": "2022-03-08",
    "sentence": "Rosendale wrote on Twitter that “the American people are sick and tired of career politicians consistently putting the interests of foreign nations above our own, we must put America first.”\nLast month, Rosendale introduced the “Secure America’s Borders First Act.”\nAccording to Breitbart, Rosendale’s bill, which is co-sponsored by Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., <span class='selected-term'>Paul Gosar</span>, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., Bill Posey, R-Fla., and Randy Weber, R-Texas., would require the federal government to restart building the border wall and to continue building 30-foot steel bollard barriers along the border with Mexico.",
    "author": "Jeremy Frankel",
    "title": "Rep. Rosendale Leads Effort to Stop Ukraine Funding Without Border Wall Completion"
  },
  {
    "id": 11076,
    "mediaId": 2740,
    "date": "2022-03-09",
    "sentence": "The report outlines how right-wing figures like Fox News personality Tucker Carlson and elected officials like U.S. Rep. Matt Gaetz, R-Fla., have promoted white supremacist conspiracy theories like the \"great replacement\" myth, while others – including former President Donald Trump and Republican U.S. Reps. <span class='selected-term'>Paul Gosar</span> of Arizona and Madison Cawthorn of North Carolina – have normalized threats and the use of violence as a political tool.",
    "author": "N'dea Yancey-Bragg",
    "title": "Hate groups declined in 2021, but fringe ideology is a 'powerful force' shaping US politics, SPLC warns"
  },
  {
    "id": 11132,
    "mediaId": 2664,
    "date": "2022-03-09",
    "sentence": "The antidemocratic right rejects equality and pluralism in favor of a hierarchical society where certain groups hold more power, and Fox News broadcaster Tucker Carlson and Republican lawmakers such as Reps. Matt Gaetz (R-FL) and <span class='selected-term'>Paul Gosar</span> (R-AZ) openly promote the white nationalist \"great replacement\" myth to stoke violent anger against racial, religious and sexual minorities.",
    "author": "Travis Gettys",
    "title": "Hate group membership continues dropping as right-wing extremism goes mainstream"
  },
  {
    "id": 10918,
    "mediaId": 8439,
    "date": "2022-03-12",
    "sentence": "The report outlines how right-wing figures like Fox News personality Tucker Carlson and elected officials like U.S. Rep. Matt Gaetz, R-Fla., have promoted white supremacist conspiracy theories like the \"great replacement\" myth, while others – including former President Donald Trump and Republican U.S. Reps. <span class='selected-term'>Paul Gosar</span> of Arizona and Madison Cawthorn of North Carolina – have normalized threats and the use of violence as a political tool.",
    "author": "N'dea Yancey-Bragg",
    "title": "Hate groups declined in 2021, but fringe ideology is a 'powerful force' shaping US politics, SPLC warns"
  },
  {
    "id": 9058,
    "mediaId": 2512,
    "date": "2022-03-24",
    "sentence": "If the 2022 midterms see a major red wave, even the most extreme MAGA Republicans are likely to be reelected to the U.S. House of Representatives — including Rep. Marjorie Taylor Greene of Georgia, Rep. Lauren Boebert of Colorado, Rep. Matt Gaetz of Florida and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Alex Henderson",
    "title": "How Madison Cawthorn may have doomed his reelection campaign"
  },
  {
    "id": 9719,
    "mediaId": 2738,
    "date": "2022-03-25",
    "sentence": "As if having to deal with the likes of Marjorie Taylor Greene, Matt Gaetz, Lauren Boebert, Madison Cawthorn, and <span class='selected-term'>Paul Gosar</span> weren’t already trying enough for Americans who think sanity is a virtue, now Sarah Palin is dropping hints that she may throw her hat and hunting rifle into the congressional ring.",
    "author": "Jennifer Wood",
    "title": "Hoo, Boy! Sarah Palin Hinted That She Might Run For Congress In The Most Sarah Palin Way Possible"
  },
  {
    "id": 9162,
    "mediaId": 2662,
    "date": "2022-03-29",
    "sentence": "However, there is already a large amount of GOP support, with fellow Reps. Thomas Massie (KY), Dan Bishop (NC), Andy Biggs (AZ), <span class='selected-term'>Paul Gosar</span> (AZ), Louie Gohmert (TX), and Marjorie Taylor Greene (GA) all having co-sponsored the bill so far.",
    "author": "Julian Conradson",
    "title": "“Spook Who Cried Wolf”: Matt Gaetz Introduces Resolution to Strip Security Clearances From Dozens of Intelligence Officials Who Falsely Labeled Hunter’s ‘Laptop From Hell’ as “Russian Disinformation”"
  },
  {
    "id": 9057,
    "mediaId": 2551,
    "date": "2022-03-29",
    "sentence": "The effort is also backed by Reps. Andy Biggs (R-Ariz.), Dan Bishop (R-N.C.), Louie Gohmert (R-Texas), <span class='selected-term'>Paul Gosar</span> (R-Ariz.), Marjorie Taylor Greene (R-Ga.) and Thomas Massie (R-Ky.).",
    "author": "Elizabeth Elkind",
    "title": "GOP Rep. Matt Gaetz presses FBI's cyber chief on the whereabouts of Hunter Biden's laptop"
  },
  {
    "id": 9114,
    "mediaId": 2594,
    "date": "2022-03-30",
    "sentence": "In recent weeks that has included public rebukes of Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> for their attendance at a white nationalist-led far right conference hosted during CPAC in Florida.",
    "author": "John Bowden",
    "title": "Trump pours cold water on House speaker idea floated by Matt Gaetz"
  },
  {
    "id": 7123,
    "mediaId": 2724,
    "date": "2022-03-31",
    "sentence": "The Republican’s proposal reads, “The 51 signatories of the letter who publicly and falsely decried Hunter Biden’s laptop to be Russian disinformation should be barred from holding any level of security clearances indefinitely.”\nGaetz’s resolution is co-sponsored so far by fellow Republican Reps. Thomas Massie, Dan Bishop, Andy Biggs, <span class='selected-term'>Paul Gosar</span>, Louie Gohmert, and Marjorie Taylor Greene.",
    "author": "John Hanson",
    "title": "Rep. Gaetz Introduces Resolution To Strip Security Clearances From Officials Who Called Hunter Biden Laptop Story ‘Russian Disinformation’"
  },
  {
    "id": 7449,
    "mediaId": 2833,
    "date": "2022-04-05",
    "sentence": "The effort is also backed by Reps. Andy Biggs (R-Ariz.), Dan Bishop (R-N.C.), Louie Gohmert (R-Texas), <span class='selected-term'>Paul Gosar</span> (R-Ariz.), Marjorie Taylor Greene (R-Ga.) and Thomas Massie (R-Ky.).",
    "author": "Baxter Dmitry",
    "title": "Gaetz Pushes To Strip Security Clearance From FBI Agents Who ‘Lost’ Hunter Biden’s Laptop"
  },
  {
    "id": 6072,
    "mediaId": 2629,
    "date": "2022-04-17",
    "sentence": "Her colleagues in the House include <span class='selected-term'>Paul Gosar</span> and Matt Gaetz and Lauren Boebert and Louie Gohmert and, sigh, many more.",
    "author": "Mona Charen",
    "title": "Is There Any Way To Isolate Political Extremists? Yes"
  },
  {
    "id": 6109,
    "mediaId": 2732,
    "date": "2022-04-17",
    "sentence": "Her colleagues in the House include <span class='selected-term'>Paul Gosar</span> and Matt Gaetz and Lauren Boebert and Louie Gohmert and, sigh, many more.",
    "author": "Mona Charen",
    "title": "Mona Charen: How to disarm the crazies"
  }
]