[
  {
    "id": 4592,
    "mediaId": 2605,
    "date": "2022-01-07",
    "sentence": "When Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) was sanctioned and stripped of his committee assignments for tweeting a video that depicted him killing Rep. Alexandria Ocasio-Cortez (D-N.Y.) and swinging swords at President Biden, McCarthy adopted a much different stance.",
    "author": "Mark Z. Barabak",
    "title": "Column: Scraping bottom, Kevin McCarthy manages to sink even lower"
  },
  {
    "id": 4486,
    "mediaId": 2810,
    "date": "2022-01-13",
    "sentence": "A number of House members have been identified by planners of the “Stop the Steal” rally as having collaborated with them—either directly or via assigned staffers—including Marjorie Taylor Greene of Georgia, <span class='selected-term'>Paul Gosar</span> of Arizona, Lauren Boebert of Colorado, Mo Brooks of Alabama, Andy Biggs of Arizona, and Louie Gohmert of Texas.",
    "author": "John Nichols",
    "title": "Madison Cawthorn’s Incitement of Insurrection Should Knock Him Off the Ballot"
  },
  {
    "id": 3710,
    "mediaId": 2621,
    "date": "2022-01-19",
    "sentence": "The Anti-Defamation League describes Fuentes as “a white supremacist leader and organizer and podcaster who seeks to forge a white nationalist alternative to the mainstream GOP.”\nFuentes is the leader of the so-called Groyper Army and notably hosted Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) as a keynote speaker at a far-right conference he held last year as counter-programming to CPAC.",
    "author": "Alex Griffing",
    "title": "House Jan. 6 Committee Subpoenas Far-Right ‘Groypers’ Nick Fuentes and Patrick Casey"
  },
  {
    "id": 3702,
    "mediaId": 2512,
    "date": "2022-01-19",
    "sentence": "Last February, Fuentes and his groypers drew national attention when Rep. <span class='selected-term'>Paul Gosar</span> — the notorious Arizona Republican who may be the most right-wing member of Congress — delivered the keynote address at their annual America First Political Action Conference in Orlando.",
    "author": "",
    "title": "Texas GOP candidate won’t ditch overt white nationalist staffer — blames 'cancel culture': report"
  },
  {
    "id": 3725,
    "mediaId": 2512,
    "date": "2022-01-19",
    "sentence": "Trump’s recent rally in Arizona featured a who’s-who of unhinged conspiracy theorists, including MyPillow CEO Mike Lindell, Rep. <span class='selected-term'>Paul Gosar</span> and Arizona gubernatorial candidate Kari Lake.",
    "author": "Alex Henderson",
    "title": "How 'wacko' conspiracy extremists are driving the 'radicalization' of the Republican Party: conservatives"
  },
  {
    "id": 3717,
    "mediaId": 2621,
    "date": "2022-01-20",
    "sentence": "Such as when Rep. <span class='selected-term'>Paul Gosar</span> shared an anime parody in which the bad guys had the faces of Democrats like Rep. Alexandria Ocasio-Cortez.",
    "author": "Caleb Howe",
    "title": "Robert Reich Deletes Tweet Calling for Democrats to Smack Kyrsten Sinema Over Her Filibuster Vote"
  },
  {
    "id": 3621,
    "mediaId": 2621,
    "date": "2022-01-20",
    "sentence": "Fuentes is also affiliated with Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) since his organization, the so-called “Groyper Army,” hosted the now-censured congressman at a fundraiser they held as a counter-event to CPAC.",
    "author": "Ken Meyer",
    "title": "White Nationalist Nick Fuentes, Subpoenaed by Jan. 6 Committee, Suggested Killing Legislators Days Before Riot"
  },
  {
    "id": 4130,
    "mediaId": 2522,
    "date": "2022-01-21",
    "sentence": "He aggressively went after Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) for his anime depicting an attack on Rep. Alexandria Ocasio-Cortez (D-NY).",
    "author": "Terresa Monroe-Hamilton",
    "title": "Clinton labor secretary blames his tweet calling for the assault of Sen. Sinema on Republicans"
  },
  {
    "id": 4103,
    "mediaId": 2716,
    "date": "2022-01-24",
    "sentence": "If that's not enough evidence, consider that McCarthy has also already promised to retaliate for Democrats kicking Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) off their committees — Greene for eye-poppingly bigoted and deranged social media posts, some of which endorsed violence against Democratic leaders, and Gosar for posting an edited anime video showing him murdering President Biden and Rep. Alexandria Ocasio-Cortez (D-N.Y.).",
    "author": "Ryan Cooper",
    "title": "The Capitol riot investigators need to realize what they're up against"
  },
  {
    "id": 4059,
    "mediaId": 2679,
    "date": "2022-01-25",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "Jonathan Weisman",
    "title": "Legal challenge to GOP Rep. Madison Cawthorn asks: Who is an ‘insurrectionist’?"
  },
  {
    "id": 3744,
    "mediaId": 2636,
    "date": "2022-01-25",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "",
    "title": "Cawthorn Challenge Raises the Question: Who Is an ‘Insurrectionist’?"
  },
  {
    "id": 3698,
    "mediaId": 2621,
    "date": "2022-01-25",
    "sentence": "But to your question, yes, when people like Boebert (R-CO) and Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) sit in the well of the house under the banner of GOP and espouse very kind of evil ideas about QAnon, making ugly comparisons to the Holocaust and just literally, we’re just in a moment where that silence, a conspiracy of silence has allowed conspiracy-minded people to affect the public conversation.",
    "author": "Alex Griffing",
    "title": "‘Never Seen a Moment Like This’: ADL Chief On Report That Over 100 Candidates for Office in 2022 Have ‘Explicit Ties’ to Extremism"
  },
  {
    "id": 3613,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 3833,
    "mediaId": 2664,
    "date": "2022-01-27",
    "sentence": "Over the last two years, Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) has emerged as a heavy favorite among far-right conservatives.",
    "author": "Meaghan Ellis",
    "title": "How Paul Gosar emerged as a far-right favorite and subsequently the 'most dangerous man in Congress’"
  },
  {
    "id": 4329,
    "mediaId": 2664,
    "date": "2022-01-27",
    "sentence": "The reelection campaign for Rep. <span class='selected-term'>Paul Gosar</span> is advertising a $1,500-per-person event at a spring training game February 27 between the Los Angeles Angels and Dodgers, complete with team logos that make it look pretty official.",
    "author": "Ray Hartmann",
    "title": "GOP's Paul Gosar hijacks MLB team logos to promote a fundraiser – at a game that’s not scheduled"
  },
  {
    "id": 3327,
    "mediaId": 2676,
    "date": "2022-01-28",
    "sentence": "Over the last two years, Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) has emerged as a heavy favorite among far-right conservatives.",
    "author": "Meaghan Ellis",
    "title": "How Paul Gosar emerged as a far-right favorite and subsequently the \"most dangerous man in Congress\""
  },
  {
    "id": 3497,
    "mediaId": 2528,
    "date": "2022-01-28",
    "sentence": "House Minority Leader Kevin McCarthy with fellow Republicans on the House steps as the House debated censuring Rep. <span class='selected-term'>Paul Gosar</span> on November 17, 2021 in Washington, DC.",
    "author": "Warren Rojas",
    "title": "Newt Gingrich is full of ideas about how to reshape America in a more conservative fashion, and Republicans hoping to win big in 2022 are turning to him for advice"
  },
  {
    "id": 2725,
    "mediaId": 2590,
    "date": "2022-01-31",
    "sentence": "Advertisement\nA growing number of Republican lawmakers have openly embraced white supremacist and/or anti-Semitic viewpoints, including Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.),who has repeatedly been linked to white nationalists, and Rep. Marjorie Taylor Greene (R-Ga.), who has spouted racist and antisemitic conspiracy theories as well as violent rhetoric.",
    "author": "",
    "title": "GOP Congressman Quotes Infamous Neo-Nazi In Attempt To Slam Dr. Fauci"
  },
  {
    "id": 2767,
    "mediaId": 2520,
    "date": "2022-02-01",
    "sentence": "Opinion: The fact that Rep. <span class='selected-term'>Paul Gosar</span> would defend a white nationalist who called on his followers to occupy the Capitol until the Jan. 6 coup was complete is ... completely unsurprising.",
    "author": "Laurie Roberts",
    "title": "Rep. Paul Gosar defends a white nationalist with Jan. 6 ties. Is that really OK, America?"
  },
  {
    "id": 3451,
    "mediaId": 2664,
    "date": "2022-02-01",
    "sentence": "Controversial Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) \"has found a new home\" on a far-right social media platform, The Arizona Republic reported Tuesday.",
    "author": "Bob Brigham",
    "title": "Republican Paul Gosar defends notorious white nationalist: report"
  },
  {
    "id": 2837,
    "mediaId": 2550,
    "date": "2022-02-02",
    "sentence": "Unfortunately, we are living in desperate times and the only way that Cheney and Kinzinger can survive is to do the right thing and bring criminal charges to light about the complicity and the possible conspiracy by Republicans like Ted Cruz, Josh Hawley, Louie Gohmert, Mo Brooks, Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, <span class='selected-term'>Paul Gosar</span>, and others, to overturn our democratically elected 46th President.",
    "author": "",
    "title": "Rep. Adam Kinzinger brings a bazooka to Josh Hawley's knife fight"
  },
  {
    "id": 2993,
    "mediaId": 2512,
    "date": "2022-02-03",
    "sentence": "Hullihan has the backing of U.S. Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, a member of the Freedom Caucus.",
    "author": "Patrick Svitek",
    "title": "National GOP proxy war breaks out in crowded primary to succeed retiring Texas Republican"
  },
  {
    "id": 2200,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Controversial Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) is taking a stand in a GOP primary two states to the east as Republicans battle each other in the 2022 midterms.",
    "author": "Bob Brigham",
    "title": "Paul Gosar endorses ‘dumbest guy in Congress’ in primary against Texas AG Ken Paxton"
  },
  {
    "id": 1926,
    "mediaId": 2550,
    "date": "2022-02-07",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. Liz Cheney, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. Madison Cawthorn, Lauren Boebert, and <span class='selected-term'>Paul Gosar</span> ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump ‘is the worst president the U.S. ever had’"
  },
  {
    "id": 2320,
    "mediaId": 2573,
    "date": "2022-02-08",
    "sentence": "Cosponsors on the bill include Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., <span class='selected-term'>Paul Gosar</span>, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., and Bill Posey, R-Fla.\nRosendale said the prioritizing of the southern border reflects what he believes are the priorities of his constituents, who are concerned about things like the flood of fentanyl coming into Montana and other states.",
    "author": "",
    "title": "Rep. Rosendale introduces bill to block military assistance to Ukraine until US border is secured"
  },
  {
    "id": 2393,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "Nine other candidates are in the race, but the only one with significant resources is another veteran, Jonathan Hullihan, who touts the backing of far-right Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ).",
    "author": "Sam Brodey",
    "title": "The Drama in This Crazy Texas Primary Explains Trump’s GOP"
  },
  {
    "id": 2419,
    "mediaId": 2553,
    "date": "2022-02-09",
    "sentence": "After teaming up with 5% of elected Republican congressmen to strip Greene of her assignments, Democrats won only two Republican votes while successfully stripping Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) of his after he made a string of controversial speeches and starred in a bizarre anime video.",
    "author": "Ben Johnson",
    "title": "3 Ways Democrats Are Trying To Overturn Elections"
  },
  {
    "id": 2297,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "Those are the acceptable sins, respectively, of Reps. Marjorie Taylor Greene, Lauren Boebart, Matt Gaetz, and <span class='selected-term'>Paul Gosar</span>.",
    "author": "Wajahat Ali",
    "title": "Sorry, Mitch McConnell. Frankenstein’s Monster Runs the GOP Now"
  },
  {
    "id": 1835,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "Rep. Adam Kinzinger (R-IL) said that the Republican Party, and leaders like Kevin McCarthy (R-CA) now answer to people like Marjorie Taylor Greene (R-GA), <span class='selected-term'>Paul Gosar</span> (R-AZ) and Lauren Boebert (R-CO).",
    "author": "Sarah K. Burris",
    "title": "Adam Kinzinger trashes Kevin McCarthy: He's beholden to Marjorie Taylor Greene and Paul Gosar"
  },
  {
    "id": 1223,
    "mediaId": 8322,
    "date": "2022-02-11",
    "sentence": "The bill has eight co-sponsors: Reps. Ronny Jackson, R-Texas, Jake Ellzey, R-Texas, Ted Budd, R-N.C., Dan Bishop, R-N.C., Scott DesJarlais, R-Tenn., Clay Higgins, R-La., Bill Pose, R-Fla., and <span class='selected-term'>Paul Gosar</span>, R-Ariz.\nFallon cited the ongoing crisis at the southern border and said that \"the enforcement of our immigration laws is not necessarily the root cause of this crisis – it is the laws themselves.\"",
    "author": "Adam Shaw",
    "title": "Rep. Fallon introduces bill to scrap diversity visa lottery, limit asylum claims"
  },
  {
    "id": 1089,
    "mediaId": 2629,
    "date": "2022-02-16",
    "sentence": "In 2020, Chattah donated $250 to Arizona Rep. <span class='selected-term'>Paul Gosar</span>, who was alleging that Democrats were prepared to steal the presidential election.",
    "author": "Nick Vachon",
    "title": "How Republican Attorneys General May Rig The 2024 Election"
  },
  {
    "id": 1309,
    "mediaId": 2580,
    "date": "2022-02-16",
    "sentence": "“Sometimes you just need to have that moment.”\nAOC has said she feels uncomfortable with some of her “creepy” older male colleagues like Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.), who posted an anime fantasy video depicting him killing her.",
    "author": "GOPUSA",
    "title": "AOC: Democrats ‘have too few stones’ and GOP loves to hate her"
  },
  {
    "id": 1579,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "The 2021 America First Political Action Conference was addressed by Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ).",
    "author": "Bob Brigham",
    "title": "Arizona Republican hyping far-right event featuring notorious white nationalist: report"
  },
  {
    "id": 196,
    "mediaId": 2594,
    "date": "2022-02-20",
    "sentence": "Representative <span class='selected-term'>Paul Gosar</span>, who was censured by Congress after he tweeted an anime video of a character with his head cutting off the head of a character of Representative Alexandria Ocasio-Cortez’s face, also announced he would be on it.",
    "author": "Eric Garcia",
    "title": "MAGA allies Marjorie Taylor Greene and Matt Gaetz line up for Trump’s new social network ahead of launch"
  },
  {
    "id": 536,
    "mediaId": 2664,
    "date": "2022-02-22",
    "sentence": "Republicans immediately derided Biden’s pledge to nominate a Black woman to the Supreme Court – while Democratic leaders are hoping for bipartisan support; House Speaker Nancy Pelosi insists the nation needs a strong Republican party – meanwhile radicals like Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just a extremist fringe that has 'hijacked' the Party, as Pelosi suggested.\"",
    "author": "Bob Brigham",
    "title": "Biden needs to stop seeking bipartisanship as Republicans abandon democracy: historian"
  },
  {
    "id": 526,
    "mediaId": 2584,
    "date": "2022-02-22",
    "sentence": "Republicans immediately derided Biden’s pledge to nominate a Black woman to the Supreme Court – while Democratic leaders are hoping for bipartisan support; House Speaker Nancy Pelosi insists the nation needs a strong Republican party – meanwhile radicals like Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just a extremist fringe that has “hijacked” the Party, as Pelosi suggested.",
    "author": "Thomas Zimmer",
    "title": "The Republican party is abandoning democracy. There can be no ‘politics as usual’"
  },
  {
    "id": 562,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "“‘W**nats’ are mad when politicians like <span class='selected-term'>Paul Gosar</span> and Wendy Rogers come on Gab,” a post by one popular groyper account shared by Greyson said.",
    "author": "",
    "title": "The 'groyper army' is looking to make white nationalism mainstream – it has key allies in the GOP"
  },
  {
    "id": 248,
    "mediaId": 2643,
    "date": "2022-02-23",
    "sentence": "Also signing the letter were a number of Republicans who are often at odds with the president, such as Representatives Louie Gohmert (R-Texas) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.).",
    "author": "Justin Klawans",
    "title": "Democrats, Republicans Applaud Biden's Russia Sanctions"
  },
  {
    "id": 37,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"Arizona’s Rep. <span class='selected-term'>Paul Gosar</span> opened for Fuentes at last year’s AFPAC conference and has continued to root for the young white nationalist.",
    "author": "Bob Brigham",
    "title": "Arizona Republicans are flocking to attend white nationalist Nick Fuentes’ far-right conference: report"
  },
  {
    "id": 41,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "“Meanwhile, radicals like Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just an extremist fringe that has ‘hijacked’ the Party, as Pelosi suggested.”\nThe history professor concludes his op-ed on a disturbing note, arguing that Democrats are being naïve if they underestimate the “radicalization” of the 2022 GOP.",
    "author": "Alex Henderson",
    "title": "There can be no ‘politics as usual’ when ‘radicalized’ Republicans reject democracy itself: historian"
  },
  {
    "id": 259,
    "mediaId": 2540,
    "date": "2022-02-24",
    "sentence": "“We know that Kevin McCarthy has a problem in our conference,” Greene said on Gaetz’s podcast in November 2021.”He doesn’t have the full support to be speaker.”\nShe added: “He doesn’t have the votes that are there, because there’s many of us that are very unhappy about the failure to hold Republicans accountable, while conservatives like me, <span class='selected-term'>Paul Gosar</span> and many others just constantly take the abuse by the Democrats.”\nThe best (only?)",
    "author": "Chris Cillizza",
    "title": "One sentence that sums up Kevin McCarthy’s House speaker problem"
  },
  {
    "id": 101,
    "mediaId": 2664,
    "date": "2022-02-25",
    "sentence": "Ben Lorber, an analyst for the social justice think tank Political Research Associates, noted on Twitter that in embracing Fuentes, Greene joined Arizona Republican Congressman <span class='selected-term'>Paul Gosar</span>, who spoke at the conference last year.",
    "author": "John Wright",
    "title": "'Only one reason a person speaks at a white nationalist conference': Marjorie Taylor Greene blasted for speaking at far-right conference"
  },
  {
    "id": 158,
    "mediaId": 2664,
    "date": "2022-02-25",
    "sentence": "Biden did the impossible and brought war to Europe,\" said Arizona congressman <span class='selected-term'>Paul Gosar</span>, one of Trump's most loyal backers, who has been accused of ties with white nationalists.",
    "author": "Agence France-Presse",
    "title": "Republicans hammer Biden over Russia's invasion of Ukraine"
  },
  {
    "id": 159,
    "mediaId": 2718,
    "date": "2022-02-26",
    "sentence": "At the Conservative Political Action Conference (CPAC) on Saturday, CBS News’ Robert Costa questioned Greene about her surprise appearance at Fuentes’ America First Political Action Conference the previous night alongside Arizona Rep. <span class='selected-term'>Paul Gosar</span>.",
    "author": "Jeremy Fuster",
    "title": "Marjorie Taylor Greene Spoke at a White Supremacist Event – But Says She Wasn’t Aware That’s What It Was"
  },
  {
    "id": 169,
    "mediaId": 2636,
    "date": "2022-02-26",
    "sentence": "Eight miles from CPAC, an even angrier right-wing gathering, the America First Political Action Conference, took place at another Orlando hotel with Representative Marjorie Taylor Greene of Georgia as the main attraction and Representative <span class='selected-term'>Paul Gosar</span> of Arizona appearing by video.",
    "author": "",
    "title": "At CPAC, Ukraine and Policy Take a Back Seat to Cultural Grievances"
  },
  {
    "id": 271,
    "mediaId": 2521,
    "date": "2022-02-26",
    "sentence": "Cheney commented that as “Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Caleb Newton",
    "title": "Kinzinger Hits Marjorie Greene For Headlining White Supremacist Event"
  },
  {
    "id": 489,
    "mediaId": 2643,
    "date": "2022-02-26",
    "sentence": "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\n\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" the Wyoming congresswoman wrote in a Twitter post, including a video of Fuentes' remarks.",
    "author": "Jason Lemon",
    "title": "Cheney Rips GOP Silence Over Greene, Gosar Joining 'White Supremacist' Event"
  },
  {
    "id": 824,
    "mediaId": 2646,
    "date": "2022-02-26",
    "sentence": "Extremists like Marjorie Taylor Greene and Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) are enabled by craven politicians like House GOP leader McCarthy, a man so scared of his own voters he can’t be found for comment when his caucus members appear alongside white supremacists.",
    "author": "Thomas Kennedy",
    "title": "COMPLICITY: Kevin McCarthy silent when Marjorie Taylor Greene speaks at white supremacist conference"
  },
  {
    "id": 12550,
    "mediaId": 2594,
    "date": "2022-02-26",
    "sentence": "“As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "John Bowden",
    "title": "Marjorie Taylor Greene defends speaking at white supremacist event saying she didn’t know what it was"
  },
  {
    "id": 12657,
    "mediaId": 2520,
    "date": "2022-02-26",
    "sentence": "\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Cheney tweeted.",
    "author": "David Jackson",
    "title": "Rep. Marjorie Taylor Greene criticized for speaking at white nationalist conference"
  },
  {
    "id": 12953,
    "mediaId": 2740,
    "date": "2022-02-26",
    "sentence": "\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Cheney tweeted.",
    "author": "David Jackson",
    "title": "Rep. Marjorie Taylor Greene criticized for speaking at white nationalist conference"
  },
  {
    "id": 12968,
    "mediaId": 2547,
    "date": "2022-02-27",
    "sentence": "CNN host Dana Bash asked Romney about a tweet by Liz Cheney, where she slammed Republican leadership for their silence on the matter:\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Heather",
    "title": "Mitt Romney: 'I Have Morons On My Team!'"
  },
  {
    "id": 12866,
    "mediaId": 2643,
    "date": "2022-02-27",
    "sentence": "Representative Liz Cheney, of Wyoming tweeted: \"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.\"",
    "author": "Andrew Stanton",
    "title": "Mitt Romney Blasts Greene, Gosar: 'Missing a Few IQ Points'"
  },
  {
    "id": 13033,
    "mediaId": 2614,
    "date": "2022-02-27",
    "sentence": "Yesterday, Cheney tweeted “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist , anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Objectivist Staff",
    "title": "Mitt Romney Bashes “Pro-Russian” Republicans on CNN; “Almost Treasonous”"
  },
  {
    "id": 13146,
    "mediaId": 2640,
    "date": "2022-02-27",
    "sentence": "GOP Rep. Liz Cheney, who's on the outs with her party, denounced Greene and Arizona Rep. <span class='selected-term'>Paul Gosar</span>, who spoke to the America First meeting virtually.",
    "author": "Bob Cronin",
    "title": "Greene Hears From McDaniel About America First Speech"
  },
  {
    "id": 12995,
    "mediaId": 6598,
    "date": "2022-02-27",
    "sentence": "Sen. Mitt Romney on Sunday likened Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene to \"morons\" and said they were \"missing a few IQ points\" after their participation in a political event led by a white nationalist.",
    "author": "Ronald J. Hansen",
    "title": "'I've got morons on my team': Sen. Mitt Romney hits Reps. Paul Gosar, Marjorie Taylor Greene"
  },
  {
    "id": 13224,
    "mediaId": 2629,
    "date": "2022-02-27",
    "sentence": "All Americans should renounce this garbage and reject the Putin wing of the GOP now.”\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Meaghan Ellis",
    "title": "Outrage Over Rep. Greene's Speech To White Nationalist 'America First' Event"
  },
  {
    "id": 13208,
    "mediaId": 2830,
    "date": "2022-02-27",
    "sentence": "In a tweet Saturday, Rep. Liz Cheney, who has faced intraparty censure in her home state of Wyoming over her criticism of former President Donald Trump, blasted their speaking appearance: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Mike Murphy",
    "title": "‘Morons’: Romney, Cheney, Kinzinger condemn fellow Republicans for speaking at white nationalist event"
  },
  {
    "id": 17116,
    "mediaId": 2727,
    "date": "2022-02-27",
    "sentence": "Arizona Republican congressman <span class='selected-term'>Paul Gosar</span> also appeared via pre-recorded video.",
    "author": "TOI staff and Agencies",
    "title": "US Rep. Taylor-Greene slammed for addressing white supremacist gathering"
  },
  {
    "id": 12658,
    "mediaId": 2594,
    "date": "2022-02-27",
    "sentence": "Another Republican who herself has faced censure by the national Republican Party for her participation in the January 6 investigation, Liz Cheney, also aimed fire at Ms Greene: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "John Bowden",
    "title": "Romney calls Marjorie Taylor Greene a ‘moron’ as moderates demand party ditch ‘Putin wing of GOP’"
  },
  {
    "id": 12668,
    "mediaId": 2540,
    "date": "2022-02-27",
    "sentence": "The comment from Romney follows criticism from Wyoming Rep. Liz Cheney, a Republican, of Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona for speaking at the America First Political Action Conference that took place in Orlando, Florida and was organized by White nationalist Nick Fuentes.",
    "author": "Chandelis Duster",
    "title": "'I've got morons on my team': Romney blasts fellow GOP members for attending White nationalist event and supporting Putin"
  },
  {
    "id": 12838,
    "mediaId": 2528,
    "date": "2022-02-27",
    "sentence": "GOP Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona attended the third-annual America First Political Action Conference in Orlando, which was held Friday and organized by the far-right figure Nick Fuentes.",
    "author": "Connor Perrett",
    "title": "'Morons': Mitt Romney goes after Marjorie Taylor Greene and Paul Gosar for attending conference with white nationalist ties"
  },
  {
    "id": 12811,
    "mediaId": 2746,
    "date": "2022-02-27",
    "sentence": "“Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don’t know them,” Mr. Romney, Utah Republican, told CNN’s “State of the Union.” “I’m reminded of the old line from the Butch Cassidy and Sundance Kid movie, where one character says, ‘Morons, I have morons on my team.’”\n“I would think that anybody that would sit down with a white nationalist and speak at their conference would certainly be missing a few IQ points,” he said.",
    "author": "Tom Howell Jr.",
    "title": "Sen. Mitt Romney rips ‘morons’ in GOP after lawmakers address White nationalist conference"
  },
  {
    "id": 12809,
    "mediaId": 2590,
    "date": "2022-02-27",
    "sentence": "It’s, as you’ve indicated, speaking of evil, it’s evil as well,” Romney told CNN’s Dana Bash on “State of the Union.”\nAdvertisement\nHe went on to call out Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for speaking at the third annual America First Political Action Conference, which was organized by white nationalist figurehead Nick Fuentes in Orlando, Florida.",
    "author": "Nina Golgowski",
    "title": "Sen. Mitt Romney Slams GOP 'Morons' At 'Evil' White Nationalist Conference"
  },
  {
    "id": 12761,
    "mediaId": 2664,
    "date": "2022-02-27",
    "sentence": "Arizona Congressman <span class='selected-term'>Paul Gosar</span>, a Republican from Prescott, gave a brief video address, a far cry from last year, when he was the featured speaker.",
    "author": "Jim Small",
    "title": "Arizona Republican said white nationalists are ‘patriots’ and called for hanging political enemies"
  },
  {
    "id": 12748,
    "mediaId": 2520,
    "date": "2022-02-27",
    "sentence": "A pair of prominent Republicans broke the disturbing and rather deafening silence within the once-Grand Old Party over the weekend, calling out Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene for participating in a conference catering to white nationalists.",
    "author": "Laurie Roberts",
    "title": "Where Sen. Mitt Romney sees 'morons', Arizona Gov. Doug Ducey sees allies"
  },
  {
    "id": 12722,
    "mediaId": 2634,
    "date": "2022-02-28",
    "sentence": "Founded in 2020 by white nationalist Nick Fuentes as an alternative to the more buttoned-up (but often still batshit) Conservative Political Action Committee, or CPAC, the conference featured a slew of controversial figures, from fellow Representatives <span class='selected-term'>Paul Gosar</span> and Steve King to Gavin McInnes and Milo Yiannopoulos.",
    "author": "Alex Shephard",
    "title": "Sorry, Marjorie Taylor Greene Is Part of the Republican Establishment Now"
  },
  {
    "id": 12815,
    "mediaId": 2520,
    "date": "2022-02-28",
    "sentence": "Senate lacks the votes to end early voting\nWhich matters not a hoot to the Republican Party because this isn’t really about “election integrity.” It isn’t about “restoring voter confidence” in elections that Ward, Senate President Karen Fann, Rep. <span class='selected-term'>Paul Gosar</span>, Sen. Wendy Rogers and other GOP leaders have sought at every turn to undermine.",
    "author": "Laurie Roberts",
    "title": "The Arizona Republican Party is so scared of you that it's suing to outlaw early voting"
  },
  {
    "id": 12844,
    "mediaId": 2658,
    "date": "2022-02-28",
    "sentence": "Mitch McConnell said in a statement on Monday afternoon: “There’s no place in the Republican Party for white supremacists or anti-Semitism.” | Anna Moneymaker/Getty Images\nBy Burgess Everett and Olivia Beavers\n 02/28/2022 02:56 PM EST\nUpdated: 02/28/2022 06:35 PM EST\nReps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene are on an island among their fellow GOP lawmakers after appearing with a white nationalist group over the weekend.",
    "author": "",
    "title": "Greene and Gosar increasingly isolated in Hill GOP after speaking at white nationalist event"
  },
  {
    "id": 12675,
    "mediaId": 2512,
    "date": "2022-02-28",
    "sentence": "Writing on Twitter, Ocasio-Cortez accused McCarthy of covering for the racist behavior of Greene and Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) for years.",
    "author": "",
    "title": "AOC tears into Kevin McCarthy for 'protecting his little KKK caucus'"
  },
  {
    "id": 12700,
    "mediaId": 2643,
    "date": "2022-02-28",
    "sentence": "His comments came after Greene and Arizona Representative <span class='selected-term'>Paul Gosar</span> spoke at the America First Political Action Conference over the weekend conference in Florida.",
    "author": "Daniel Villarreal",
    "title": "'Appalled' McCarthy Plans Talk With Greene About White Nationalist Rally"
  },
  {
    "id": 12630,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "He added: “Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> — I don’t know them, but I’m reminded of that old line from the ‘Butch Cassidy and the Sundance Kid’ movie where one character says, ‘Morons.",
    "author": "",
    "title": "McConnell says no space in GOP for ‘white supremacists or anti-Semitism’ after two House Republicans participate in white nationalist’s conference"
  },
  {
    "id": 12616,
    "mediaId": 2551,
    "date": "2022-02-28",
    "sentence": "Republican Sen. Mitt Romney slammed both Greene and Republican Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, who sent pre-taped remarks to the conference.",
    "author": "Emily Goodin",
    "title": "'Have you lost all sense of decency?' Liz Cheney shames Kevin McCarthy for not chastising Marjorie Taylor Greene for speaking at white nationalist event"
  },
  {
    "id": 12579,
    "mediaId": 2636,
    "date": "2022-02-28",
    "sentence": "WASHINGTON — Republican congressional leaders on Monday broke their silence about the participation of two House Republicans at a far-right conference with ties to white supremacy, denouncing the actions of Representative Marjorie Taylor Greene of Georgia and Representative <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "",
    "title": "G.O.P. Leaders Condemn Lawmakers’ Appearance at White Nationalist Conference"
  },
  {
    "id": 12495,
    "mediaId": 2550,
    "date": "2022-02-28",
    "sentence": "x\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "",
    "title": "Abbreviated Pundit Roundup: This is the dangerous part (Putin losing)"
  },
  {
    "id": 12489,
    "mediaId": 2664,
    "date": "2022-02-28",
    "sentence": "Writing on Twitter, Ocasio-Cortez accused McCarthy of covering for the racist behavior of Greene and Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) for years.",
    "author": "Brad Reed",
    "title": "'Protecting his KKK Caucus': Ocasio-Cortez shreds Kevin McCarthy for 'toothless' condemnation of Marjorie Greene"
  },
  {
    "id": 17331,
    "mediaId": 8475,
    "date": "2022-02-28",
    "sentence": "Arizona Congressman <span class='selected-term'>Paul Gosar</span>, a Republican from Prescott, gave a brief video address, a far cry from last year, when he was the featured speaker.",
    "author": "Jim Small",
    "title": "Az's Wendy Rogers said white nationalists are 'patriots' & called for hanging political enemies"
  },
  {
    "id": 13344,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "He added: “Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> — I don’t know them, but I’m reminded of that old line from the ‘Butch Cassidy and the Sundance Kid’ movie where one character says, ‘Morons.",
    "author": "",
    "title": "McConnell says no space in GOP for ‘white supremacists or anti-Semitism’ after two House Republicans participate in white nationalist’s conference"
  },
  {
    "id": 13210,
    "mediaId": 3987,
    "date": "2022-02-28",
    "sentence": "Lt. Gov of Idaho Janice McGeachin, Rep. <span class='selected-term'>Paul Gosar</span> (AZ-04), and Arizona State Senator Wendy Rogers all appeared at the conference via video.",
    "author": "Zachary Mueller",
    "title": "A Weekend in Orlando Demonstrates the Republican Party is Going Down a Dark Path Towards White Nationalism"
  },
  {
    "id": 13204,
    "mediaId": 2631,
    "date": "2022-02-28",
    "sentence": "WASHINGTON — GOP leaders in the House and the Senate on Monday denounced a pair of far-right Trump allies — Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz. — for speaking at a gathering of white nationalists in Florida over the weekend.",
    "author": "",
    "title": "GOP leaders denounce Greene, Gosar for speaking at white nationalist event"
  },
  {
    "id": 13335,
    "mediaId": 2560,
    "date": "2022-02-28",
    "sentence": "McConnell issued a statement in response to reports that Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona addressed the America First Political Action Conference (AFPAC) in Orlando, Fla.",
    "author": "Jonathan Edwards and Mariana Alfaro",
    "title": "McConnell: No space in GOP for 'white supremacists or anti-Semitism' after two House Republicans attend in white nationalist's conferene"
  },
  {
    "id": 13261,
    "mediaId": 3987,
    "date": "2022-02-28",
    "sentence": "Lt. Gov of Idaho Janice McGeachin, Rep. <span class='selected-term'>Paul Gosar</span> (AZ-04), and Arizona State Senator Wendy Rogers all appeared at the conference via video.",
    "author": "AV Press Releases",
    "title": "At CPAC, Republican Party Embraces Dangerous Falsehoods and Conspiracy Theories"
  },
  {
    "id": 13302,
    "mediaId": 2676,
    "date": "2022-02-28",
    "sentence": "Sen. Mitt Romney, R-Utah, called Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., \"morons\" on Sunday after the two House lawmakers attended a white nationalist event whose participants heaped praise on Russia for invading Ukraine.",
    "author": "Jon Skolnik",
    "title": "\"I have morons on my team\": Mitt Romney blasts radical Republicans in Congress"
  },
  {
    "id": 13004,
    "mediaId": 2723,
    "date": "2022-02-28",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, who last year stood in Greene’s place getting condemned for his speaking at both conferences, sent a video message to be played at AFPAC, as did Arizona state Sen. Wendy Rogers and Idaho Lt. Gov.",
    "author": "Kristen Doerer – Right Wing Watch",
    "title": "‘Standard Bearer of Trumpism’ Marjorie Taylor Greene Bridges White Nationalism and the GOP"
  },
  {
    "id": 12971,
    "mediaId": 2593,
    "date": "2022-02-28",
    "sentence": "However, he said, “Standing up for freedom is the right thing to do in America, and anything less than that, in my opinion, is unworthy of American support.”\nRomney’s comments come after Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) spoke at a white nationalist conference.",
    "author": "Bradley Cortright",
    "title": "'Almost Treasonous': Romney Denounces 'Pro-Putin Sentiment' Among Some Republicans"
  },
  {
    "id": 12976,
    "mediaId": 2643,
    "date": "2022-02-28",
    "sentence": "\"There's no place in the Republican Party for white supremacists or antisemitism,\" McConnell told Politico, when asked to comment on Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>'s attendance at the America First Political Action Conference.",
    "author": "Natalie Colarossi",
    "title": "Mitch McConnell Condemns GOP Members Who Engage With White Nationalists"
  },
  {
    "id": 12982,
    "mediaId": 2528,
    "date": "2022-02-28",
    "sentence": "Republican House Minority Leader Kevin McCarthy offered a rare rebuke of two members of his caucus on Monday, saying it was \"unacceptable\" for Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona to speak at an event held by a man widely described to be white nationalist.",
    "author": "Bryan Metzger",
    "title": "Kevin McCarthy condemns Marjorie Taylor Greene and Paul Gosar for attending 'appalling and wrong' white nationalist event: 'This is unacceptable'"
  },
  {
    "id": 12958,
    "mediaId": 2643,
    "date": "2022-03-01",
    "sentence": "Rogers' censure follows rebukes by national Republican leaders against U.S. GOP Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona who also spoke at the conference.",
    "author": "Daniel Villarreal",
    "title": "GOP Senators Censure Colleague for Speaking at White Nationalist Conference"
  },
  {
    "id": 12950,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Nationally, several prominent Republicans took aim at two GOP members of Congress who spoke at AFPAC, Arizona’s <span class='selected-term'>Paul Gosar</span> and Georgia’s Marjorie Taylor Greene.",
    "author": "Jeremy Duda",
    "title": "Trump-loving lawmaker threatens to 'destroy' any Republican who tries to punish her for attending white nationalist conference"
  },
  {
    "id": 12941,
    "mediaId": 2625,
    "date": "2022-03-01",
    "sentence": "Janice McGeachin (R-Idaho) and serving members of Congress Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.), among others.",
    "author": "Ali Breland",
    "title": "How Marjorie Taylor Greene and Nick Fuentes Are Easing White Power into the GOP Mainstream"
  },
  {
    "id": 12861,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Later, after criticism, she feigned ignorance that it was a white supremacist conference — though it received enormous attention last year when GOP Congressman <span class='selected-term'>Paul Gosar</span> of Arizona (who sent a video message this year to the conference) attended and spoke.",
    "author": "",
    "title": "While democracy is under attack in Europe, GOP plots to destroy democracy in America"
  },
  {
    "id": 12867,
    "mediaId": 2590,
    "date": "2022-03-01",
    "sentence": "McCarthy on Monday called the America First Political Action Conference “appalling” and said “there’s no place in our party for any of this,” but on Tuesday he declined to say whether House Republicans would sanction Rep. Marjorie Taylor Greene (R-Ga.) or Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for participating, though he said he would have a talk with them.",
    "author": "Igor Bobic",
    "title": "Kevin McCarthy Dodges On Punishing Members Over White Nationalist Conference"
  },
  {
    "id": 12924,
    "mediaId": 2621,
    "date": "2022-03-01",
    "sentence": "GOP Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene also spoke at his controversial conference over the weekend.",
    "author": "Alex Griffing",
    "title": "GOP-Controlled AZ Senate Censures Trump-Backed Republican Lawmaker Wendy Rogers"
  },
  {
    "id": 13182,
    "mediaId": 2627,
    "date": "2022-03-01",
    "sentence": "GOP leaders in the House and the Senate on Monday denounced a pair of far-right Trump allies — Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz. — for speaking at a gathering of white nationalists in Florida over the weekend.",
    "author": "Steve Benen",
    "title": "Republican leaders offer incomplete rebukes of Greene and Gosar"
  },
  {
    "id": 13127,
    "mediaId": 2688,
    "date": "2022-03-01",
    "sentence": "Kevin McCarthy (R-CA), the House minority leader, also didn’t refer by name to the two members of his caucus who attended the racist conference — Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-GA), the latter of whom also headlined the event last year — when he made a perfunctory comment on the matter Monday.",
    "author": "Matt Shuham",
    "title": "Multiple High-Profile Republicans Spoke At A White Nationalist Conference. Party Leadership Shrugs."
  },
  {
    "id": 13197,
    "mediaId": 2602,
    "date": "2022-03-01",
    "sentence": "Senate Minority Leader Mitch McConnell chastised two fellow Republicans for attending a conference run by a well known white nationalist, saying, “There’s no place in the Republican Party for white supremacists or antisemitism.”\nHouse Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> and Arizona State Sen. Wendy Rogers earned the ire of Republican leadership by speaking at the America First Political Action Conference in Orlando over the weekend.",
    "author": "GABE FRIEDMAN/JTA",
    "title": "Mitch McConnell condemns antisemitism after Republicans speak at white nationalist conference"
  },
  {
    "id": 13225,
    "mediaId": 2748,
    "date": "2022-03-01",
    "sentence": "\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Cheney said in a tweet.",
    "author": "Blarp Blog",
    "title": "Romney on Greene, Gosar: 'I have morons on my team'"
  },
  {
    "id": 13246,
    "mediaId": 2676,
    "date": "2022-03-01",
    "sentence": "Writing on Twitter, Ocasio-Cortez accused McCarthy of covering for the racist behavior of Greene and Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) for years.",
    "author": "Brad Reed",
    "title": "\"Protecting his little KKK Caucus\": AOC slams GOP leader for \"toothless\" condemnation of MTG"
  },
  {
    "id": 12491,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "White nationalists flaunt their traction within Republican Party at annual gathering in Florida"
  },
  {
    "id": 12487,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "On one side you have the Trump/MAGA/tea party wing of the GOP, filled with detestable folks like Reps. Lauren Boebert, Matt Gaetz, Madison Cawthorn, <span class='selected-term'>Paul Gosar</span>, and Marjorie Taylor Greene.",
    "author": "",
    "title": "War in the GOP: Have Marjorie Taylor Greene and Paul Gosar made one too many mistakes?"
  },
  {
    "id": 12559,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "After GOP Rep. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> both spoke at a white nationalist event in Orlando over the weekend, GOP leaders were quick to condemn their attendance.",
    "author": "Sky Palma",
    "title": "GOP leaders condemn Greene and Gosar for appearing at white nationalist event – but it's not enough: op-ed"
  },
  {
    "id": 12603,
    "mediaId": 2594,
    "date": "2022-03-01",
    "sentence": "Republican House leader Kevin McCarthy has been called “toothless” for inadequately dealing with Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> after their appearance at a white nationalist event.",
    "author": "Gino Spocchia",
    "title": "‘Toothless’ McCarthy vows to ‘talk to’ Marjorie Taylor Greene over her appearance at white nationalist event"
  },
  {
    "id": 12757,
    "mediaId": 2621,
    "date": "2022-03-01",
    "sentence": "In addition to Rogers, who is expected to be censured by the Arizona State Senate, Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) appeared at AFPAC.",
    "author": "Jackson Richman",
    "title": "Arizona Republican Posted Anti-Semitic Photoshop Before Speaking at White Nationalist Event"
  },
  {
    "id": 12743,
    "mediaId": 2631,
    "date": "2022-03-01",
    "sentence": "This shift has manifested in a strident public embrace of far-right authoritarianism, most recently when Trumpist Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona spoke at a pro-Vladimir Putin event hosted and funded by prominent white nationalist Nick Fuentes.",
    "author": "Max Burns",
    "title": "Ukraine-Russia war overshadows State of the Union. Whatever Biden says, it's not strong."
  },
  {
    "id": 12737,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "If supremacists are still in the party ...\nRepublican Senate Minority Leader Mitch McConnell, in condemning Arizona’s Rep. <span class='selected-term'>Paul Gosar</span> and Georgia Rep. Marjorie Taylor Greene for participating in the America First conference, a haven for racists, white supremacists, anti-Semites and supporters of Russia’s Vladimir Putin, said on Monday that “there’s no place in the Republican Party for white supremacists or antisemitism.”\nThat, sadly, is a lie.",
    "author": "EJ Montini",
    "title": "Big Lie 2.0: White supremacy has no place in the Republican Party"
  },
  {
    "id": 12735,
    "mediaId": 2512,
    "date": "2022-03-02",
    "sentence": "#idpolpic.twitter.com/G3OzspSvik\n— Janice McGeachin (@Janice McGeachin) 1645910035\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Alex Henderson",
    "title": "Idaho newspaper editorial slams state lieutenant governor for embracing the GOP’s 'Putin wing'"
  },
  {
    "id": 12708,
    "mediaId": 2547,
    "date": "2022-03-02",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "Neo-Nazi Nick Fuentes Is Gloating About Taking Over The GOP"
  },
  {
    "id": 12716,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> was one of three members of the House of Representatives on Wednesday to vote against a symbolic measure calling for a cease-fire in Ukraine and support for its people.",
    "author": "Ronald J. Hansen",
    "title": "Rep. Paul Gosar is 1 of 3 to vote against pro-Ukraine measure"
  },
  {
    "id": 12841,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "Although the resolution passed by an overwhelming majority, three House Republicans voted against it: Reps. <span class='selected-term'>Paul Gosar</span> (R-AZ), Thomas Massie (R-KY), and Matt Rosendale (R-MT).",
    "author": "Brad Reed",
    "title": "'Unreal': Adam Kinzinger slams three GOP colleagues who voted against resolution supporting Ukrainian people"
  },
  {
    "id": 12553,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "\"Far-right Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) are untouchable inside the House Republican conference,\" Axios reported.",
    "author": "Bob Brigham",
    "title": "Republicans are 'frustrated by the constant distractions' from Marjorie Taylor Greene and Paul Gosar: report"
  },
  {
    "id": 12637,
    "mediaId": 2557,
    "date": "2022-03-02",
    "sentence": "pic.twitter.com/UTZOeqPzkg\n— Alex Andrade (@RAlexAndradeFL) March 2, 2022\nHouse votes on resolution in support of Ukraine, which includes a warning to that “it will never recognize or support any illegitimate Russian-controlled leader or government installed through the use of force.”\nGOP Reps <span class='selected-term'>Paul Gosar</span>, Tom Massie & Matt Rosendale voted against it.",
    "author": "DML News App",
    "title": "REPORT: House passes resolution backing Ukraine, 3 Republicans vote nay"
  },
  {
    "id": 12666,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "",
    "author": "Sarah K. Burris",
    "title": "'Unhealthy and unhinged': Marjorie Taylor Greene blasted for 'reprehensible' response to Biden's State of the Union"
  },
  {
    "id": 12499,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "While Lake did not respond to questions about Rogers, she has not distanced herself from Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who spoke at the same Nick Fuentes' white nationalist America First Political Action Conference in Florida.",
    "author": "Bob Brigham",
    "title": "Censured Republican is so toxic she’s become an issue in Arizona governor’s race: report"
  },
  {
    "id": 13338,
    "mediaId": 5308,
    "date": "2022-03-02",
    "sentence": "In addition to Rogers, two current members of Congress, Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, spoke at the conference.",
    "author": "Paul Blest",
    "title": "Republicans Have Finally Had Enough of Wendy Rogers"
  },
  {
    "id": 12990,
    "mediaId": 8369,
    "date": "2022-03-02",
    "sentence": "McCarthy told a CNN reporter on Monday that it was “appalling and wrong” for Republican Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., to speak to the annual America First Political Action Conference, or AFPAC.",
    "author": "Michelle Malkin",
    "title": "AFPAC vs. America Last GOP"
  },
  {
    "id": 12846,
    "mediaId": 2621,
    "date": "2022-03-02",
    "sentence": "Reps. <span class='selected-term'>Paul Gosar</span> (R-AZ), Matt Rosendale (R-MT), and Thomas Massie (R-KY) were the only three members to vote against a resolution that overwhelmingly passed the House of Representatives on Wednesday to condemn Russia over its military invasion of Ukraine.",
    "author": "Jackson Richman",
    "title": "Republicans Paul Gosar, Matt Rosendale, and Thomas Massie Are Sole Votes Against House Resolution Condemning Russia"
  },
  {
    "id": 12864,
    "mediaId": 2643,
    "date": "2022-03-03",
    "sentence": "He said it was in response to Johnson's voting against censuring Republican Representative <span class='selected-term'>Paul Gosar</span> for posting a video on Twitter of a violent cartoon that showed him killing a character who looked like New York Representative Alexandria Ocasio-Cortez.",
    "author": "Katie Wermus",
    "title": "Dem Candidate for U.S. House Seat Withdraws Because of Inappropriate Tweets"
  },
  {
    "id": 12944,
    "mediaId": 8387,
    "date": "2022-03-03",
    "sentence": "A guy, by the way, who Rep. <span class='selected-term'>Paul Gosar</span> calls a friend.",
    "author": "Laurie Roberts",
    "title": "Matt Salmon blasts Wendy Rogers as unfit to serve. Where you been, Matt?"
  },
  {
    "id": 12951,
    "mediaId": 2529,
    "date": "2022-03-03",
    "sentence": "Jonathan Hullihan said he was \"blessed and honored\" to have received the endorsement of Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, a top Trump supporter who the US House in November censured for tweeting an edited anime video depicting him killing Rep. Alexandria Ocasio-Cortez of New York with a sword.",
    "author": "Camila DeChalus",
    "title": "Less Trump, more winning: Why the results of one Republican primary in Texas could give hope to new conservative candidates who don't endlessly venerate the former president"
  },
  {
    "id": 13046,
    "mediaId": 2629,
    "date": "2022-03-03",
    "sentence": "The three no votes came from Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky, and Matt Rosendale of Montana.",
    "author": "Laura Clawson",
    "title": "Three MAGA Republicans Vote No On Resolution Backing Ukraine"
  },
  {
    "id": 12506,
    "mediaId": 2550,
    "date": "2022-03-03",
    "sentence": "https://t.co/0OXQ8wQVqo\n— Rep. <span class='selected-term'>Paul Gosar</span>, DDS (@RepGosar) March 2, 2022\nRosendale has been silent, but in view of the Ukraine resolution’s lines about assisting refugees, it’s worth noting that he vocally opposed the resettlement of 75 Afghan refugees in Montana.",
    "author": "Laura Clawson",
    "title": "Three Republicans voted against supporting Ukraine, and it's surprisingly hard to guess which"
  },
  {
    "id": 12518,
    "mediaId": 2594,
    "date": "2022-03-03",
    "sentence": "The Republicans who voted against the resolution - Reps <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky, and Matt Rosendale of Montana - were swiftly attacked on social media.",
    "author": "Sravasti Dasgupta",
    "title": "Three Republicans under fire for voting against House resolution to ‘stand with Ukraine’ amid Russia invasion"
  },
  {
    "id": 12645,
    "mediaId": 2590,
    "date": "2022-03-03",
    "sentence": "Their heckling came on the same day that House Minority Leader Kevin McCarthy (R-Calif.) dodged questions about whether Greene and another member of his conference, Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.), would face any punishment for participating in a white nationalist event over the weekend.",
    "author": "Jennifer Bendery",
    "title": "Nancy Pelosi To GOPers Who Interrupted Biden’s State Of The Union Speech: ‘Shut Up’"
  },
  {
    "id": 12594,
    "mediaId": 2621,
    "date": "2022-03-03",
    "sentence": "The petition, from a group called Faithful America, is addressed to “RNC Chair Ronna McDaniel” and says “As grassroots Christians from across the country, we call on the RNC to censure Representatives Marjorie Taylor Green and <span class='selected-term'>Paul Gosar</span> for taking part in the explicitly white nationalist America First Political Action Conference.”\nMcDaniel did issue a statement over the weekend condemning “white supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nBoth Greene and Gosar have been roundly condemned for addressing the conference hosted by white nationalist and Holocaust-denier Nick Fuentes.",
    "author": "Alex Griffing",
    "title": "Nearly 13,000 Christians Sign Petition Calling on the RNC to Censure Reps. Greene and Gosar For Addressing White Nationalist Group"
  },
  {
    "id": 12747,
    "mediaId": 2520,
    "date": "2022-03-03",
    "sentence": "No less than Senate Minority Leader Mitch McConnell and House Minority Leader Kevin McCarthy are leading the stampede to distance themselves from Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene for speaking at a conference for white nationalists last week.",
    "author": "Laurie Roberts",
    "title": "Rep. Paul Gosar cozies up to white nationalists (again) and now GOP leaders are upset?"
  },
  {
    "id": 12749,
    "mediaId": 2614,
    "date": "2022-03-03",
    "sentence": "One of the three Republicans in question, Rep. <span class='selected-term'>Paul Gosar</span>, delivered a clapback to Rep. Kinzinger that reiterated his America first stance.",
    "author": "Red Voice Media",
    "title": "Rep Gosar Owns RINO Kinzinger For Crying On Twitter Over Ukraine Support Resolution Vote Differences"
  },
  {
    "id": 12510,
    "mediaId": 2550,
    "date": "2022-03-04",
    "sentence": "— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\nDear Gosar, Rosendale, and Massie, you are not anti-war: https://t.co/U0XK7Szp9N\n— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\n<span class='selected-term'>Paul Gosar</span> joins with two other Republicans to vote no on a resolution supporting the people of Ukraine pic.twitter.com/7WZM4CFyuz\n— Acyn (@Acyn) March 2, 2022\nx\nFascist pro-Putin MAGA traitors Paul Gosar, Thomas Massie, & Matt Rosendale just voted against a resolution to help the people of Ukraine.",
    "author": "",
    "title": "Disgust abounds after three House Republicans vote no on resolution supporting Ukraine"
  },
  {
    "id": 13184,
    "mediaId": 4032,
    "date": "2022-03-04",
    "sentence": "McCarthy told a CNN reporter on Monday that it was “appalling and wrong” for Republican Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., to speak to the annual America First Political Action Conference, or AFPAC.",
    "author": "Michelle Malkin",
    "title": "AFPAC Versus America Last GOP"
  },
  {
    "id": 13298,
    "mediaId": 2607,
    "date": "2022-03-04",
    "sentence": "In a similar abdication, few GOP leaders have been as outspoken and categorical as Romney in castigating Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, who recently shared their madcap musings with an audience of white supremacists in Florida.",
    "author": "Mark Barabak",
    "title": "Romney speaks harshly but honestly about Putin and GOP’s crackpots"
  },
  {
    "id": 12947,
    "mediaId": 2664,
    "date": "2022-03-05",
    "sentence": "Also in attendance was Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who received widespread condemnation for attending a white nationalist conference the previous weekend.",
    "author": "Bob Brigham",
    "title": "WATCH: Mike Lindell sells a GOP candidate — and his pillows — at Arizona rodeo"
  },
  {
    "id": 12620,
    "mediaId": 8369,
    "date": "2022-03-06",
    "sentence": "Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don’t know them, but I’m reminded of that old line from the ‘Butch Cassidy and the Sundance Kid’ movie where—where one character says, ‘Morons, I’ve got morons on my team.’ And I have to think anybody that would sit down with White nationalists and speak at their conference was certainly missing a few IQ points” [Romney blasts fellow GOP members for attending White nationalist event, by Chandelis Duster, CNN, February 27, 2022].",
    "author": "Gregory Hood",
    "title": "GOP’s Reaction to America First Conference Shows They Can’t Resist Cucking"
  },
  {
    "id": 12585,
    "mediaId": 2512,
    "date": "2022-03-07",
    "sentence": "He recently promised that he's going to have a talk with Reps. Marjorie Taylor Greene (R-GA.) and and <span class='selected-term'>Paul Gosar</span> (R-AZ) about their \"appalling\" decision to speak at a conference organized by a far-right fringe figure and self-proclaimed white nationalist Nick Fuentes.",
    "author": "Timothy Evans",
    "title": "'I want them to shut up': Republicans angry Kevin McCarthy is impotent in dealing with GOP extremism"
  },
  {
    "id": 12686,
    "mediaId": 2664,
    "date": "2022-03-07",
    "sentence": "More forceful and specific condemnation by GOP leaders against Republican Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> for participating in a recent white nationalist event in Florida, for example, would go a long way toward conveying that message and countering this toxic propaganda,\" they wrote.",
    "author": "Tom Boggioni",
    "title": "Top midwestern paper calls out the GOP for allowing white nationalists to 'flourish' in scathing editorial"
  },
  {
    "id": 11045,
    "mediaId": 2746,
    "date": "2022-03-07",
    "sentence": "Mr. Ryder told The Associated Press that the tweet was a reaction to Mr. Johnson’s November 2021 House vote against censuring fellow Republican Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Kerry Picket",
    "title": "Offensive tweets force South Dakota Democrat out of House race after one day"
  },
  {
    "id": 15397,
    "mediaId": 8345,
    "date": "2022-03-07",
    "sentence": "WASHINGTON - Republican leaders in Congress are torn over what to do with Rep. Marjorie Taylor Greene after the congresswoman spoke at a an event last month organized by a white nationalist who marveled over Russia’s invasion of Ukraine as the crowd erupted in chants of “Putin!” Rep. <span class='selected-term'>Paul Gosar</span> (R-Arizona), who represents the Kingman area, spoke to the group by video.",
    "author": "Associated Press",
    "title": "GOP torn as Green, Gosar speak to far right group"
  },
  {
    "id": 11406,
    "mediaId": 2629,
    "date": "2022-03-08",
    "sentence": "However, the House Freedom Caucus — a group of the most far-right members of the House, including Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) — wants to delay passage of the aid, urging \"a collective resolve among Republicans\" to \"not pass a government funding bill that includes aid to Ukraine or for COVID-19 relief efforts.\"",
    "author": "Emily Singer",
    "title": "Far-Right House ‘Freedom’ Caucus Seeks To Delay Aid To Ukraine"
  },
  {
    "id": 11556,
    "mediaId": 2607,
    "date": "2022-03-09",
    "sentence": "House Republican leader Kevin McCarthy waited days before castigating Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona — who once sought to create a whites-only congressional caucus — for speaking to a white supremacist gathering in Florida.",
    "author": "Mark Barabak",
    "title": "Dealing with extremists, some GOP leaders find sorry is the hardest word"
  },
  {
    "id": 11529,
    "mediaId": 2646,
    "date": "2022-03-09",
    "sentence": "We recently wrote about pariah members of Congress, Rep. Marjorie Taylor Greene (R-GA), and <span class='selected-term'>Paul Gosar</span>’s (R-AZ) appearances at the American First Political Action Conference, an event organized by neo-nazis and white nationalists.",
    "author": "Thomas Kennedy",
    "title": "NAZIS WELCOME: House GOP leader promises reward for racist Representatives"
  },
  {
    "id": 11068,
    "mediaId": 2664,
    "date": "2022-03-09",
    "sentence": "The newspaper singled out DeSantis for taking part in the GOP's whitewashing of the deadly riot by refusing to call the attack an insurrection, although two days later Oath Keepers leader Stewart Rhodes was charged with seditious conspiracy, and other Republicans also minimized the violent attack at this year's Conservative Political Action Conference in Orlando -- where GOP lawmakers Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> took part in a white nationalist conference.",
    "author": "Travis Gettys",
    "title": "'Republicans have a white nationalist problem': Florida newspaper lays waste to the GOP"
  },
  {
    "id": 11035,
    "mediaId": 2590,
    "date": "2022-03-09",
    "sentence": "Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) won’t face punishment for participating in a white nationalist conference, House Republican leader Kevin McCarthy (R-Calif.) said Wednesday.",
    "author": "Arthur Delaney",
    "title": "Kevin McCarthy Won't Punish Republicans Who Joined White Nationalist Conference"
  },
  {
    "id": 10922,
    "mediaId": 2664,
    "date": "2022-03-10",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "Jan. 6 committee reveals why it subpoenaed RNC fundraising records"
  },
  {
    "id": 11009,
    "mediaId": 2699,
    "date": "2022-03-10",
    "sentence": "And Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who also backed the bill, told The Daily Beast he still thinks southern border security should take precedence over Ukraine.",
    "author": "Shannon Vavra",
    "title": "Conservatives Try to Hold Up Ukraine Aid for Bullshit Reason"
  },
  {
    "id": 10830,
    "mediaId": 2590,
    "date": "2022-03-10",
    "sentence": "Ron DeSantis seeking to downplay the Jan. 6 insurrection and the participation of Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) in a white nationalist conference in Orlando.",
    "author": "Lee Moran",
    "title": "Miami Herald Rips GOP’s ‘Terrifying Tolerance Of White Supremacy’"
  },
  {
    "id": 11042,
    "mediaId": 2664,
    "date": "2022-03-10",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), a recent speaker to a group of white supremacists who cheered Vladimir Putin, echoed the demand for Ukraine to take care of itself while Washington deals with the border.",
    "author": "Sarah K. Burris",
    "title": "A group of Republicans is still trying to stop aid to Ukraine"
  },
  {
    "id": 11193,
    "mediaId": 5308,
    "date": "2022-03-10",
    "sentence": "While Republican congressional leaders condemned the invasion, Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene both spoke at a white nationalist conference last month whose organizer favorably compared Russian President Vladimir Putin to Adolf Hitler.",
    "author": "Paul Blest",
    "title": "GOP Rep. Madison Cawthorn Called President Zelenskyy a ‘Thug’"
  },
  {
    "id": 15378,
    "mediaId": 8345,
    "date": "2022-03-10",
    "sentence": "U.S. Rep. <span class='selected-term'>Paul Gosar</span> (R-Prescott), who represents the Kingman area in Congress, needs to be ejected from the GOP if they are interested in the survival of this country as a democracy.",
    "author": "",
    "title": "Rants and Raves | March 11, 2022"
  },
  {
    "id": 10728,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "After Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> spoke at the America First Political Action Conference, it took McCarthy 10 days to get around to having a chat with Greene.",
    "author": "Laura Clawson",
    "title": "Greene and Gosar won't face punishment for speaking at white nationalist event"
  },
  {
    "id": 15534,
    "mediaId": 8345,
    "date": "2022-03-12",
    "sentence": "Daniel Wood letter: A couple of questions for <span class='selected-term'>Paul Gosar</span> – Daniel Wood wants Gosar to answer a few questions.",
    "author": "",
    "title": "Rants and Raves | March 13, 2022"
  },
  {
    "id": 11190,
    "mediaId": 2592,
    "date": "2022-03-13",
    "sentence": "Even after the invasion, two Trump allies in the House - Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> - participated in a white nationalist conference at which participants applauded Russia's move on Ukraine and chanted Putin's name.",
    "author": "David Morgan",
    "title": "Ukraine War Becomes A Cudgel In Republican Party's Internal Conflict"
  },
  {
    "id": 11041,
    "mediaId": 2564,
    "date": "2022-03-13",
    "sentence": "Even after the invasion, two Trump allies in the House - Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> - participated in a white nationalist conference at which participants applauded Russia's move on Ukraine and chanted Putin's name.",
    "author": "",
    "title": "American governor hopeful Kari Lake labels 60 Minutes journalist Liam Bartlett a JOKE"
  },
  {
    "id": 11516,
    "mediaId": 2911,
    "date": "2022-03-14",
    "sentence": "The Senate has also censured nine of its own members, and in 2021, the U.S. House of Representatives censured its 24th member, Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, for, among other things, posting an anime video of himself killing a fellow member.",
    "author": "Seth Masket",
    "title": "How An Uptick In Censures Among Local Republicans Signals A Growing Radicalism"
  },
  {
    "id": 11066,
    "mediaId": 2590,
    "date": "2022-03-15",
    "sentence": "The group has taken out ads against House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) and others, and has vowed to support candidates who challenge Trump’s enablers in the primaries.",
    "author": "",
    "title": "Republican Group Burns Trump Supporters In Mock PSA To Air On Fox News"
  },
  {
    "id": 11073,
    "mediaId": 2664,
    "date": "2022-03-16",
    "sentence": "“They know Trump’s lies about the 2020 election and actions on January 6 were wrong, but they lack the courage to take a stand and say they won’t support him.”\nThe latest ad is one of the Republican Accountability Project's many efforts criticizing Republican lawmakers like House Minority Leader Kevin McCarthy (R-Calif.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for their continuous enabling of Trump.",
    "author": "Meaghan Ellis",
    "title": "GOP group torches Trump supporters in scathing new ad set to air on Fox News"
  },
  {
    "id": 11179,
    "mediaId": 2676,
    "date": "2022-03-16",
    "sentence": "Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> or Arizona will not be punished for their participation in a white nationalist conference, according to House Republican leader Kevin McCarthy.",
    "author": "Madeleine Beck",
    "title": "Kevin McCarthy quietly gets away with holding Republicans to a lower standard than Donald Trump"
  },
  {
    "id": 11028,
    "mediaId": 2512,
    "date": "2022-03-16",
    "sentence": "“They know Trump’s lies about the 2020 election and actions on January 6 were wrong, but they lack the courage to take a stand and say they won’t support him.”\nThe latest ad is one of the Republican Accountability Project's many efforts criticizing Republican lawmakers like House Minority Leader Kevin McCarthy (R-Calif.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for their continuous enabling of Trump.",
    "author": "Meaghan Ellis",
    "title": "'Partisan Derangement Syndrome': GOP group torches Trump supporters in scathing new ad set to air on Fox News"
  },
  {
    "id": 11317,
    "mediaId": 2629,
    "date": "2022-03-16",
    "sentence": "“They know Trump’s lies about the 2020 election and actions on January 6 were wrong, but they lack the courage to take a stand and say they won’t support him.”\nThe latest ad is one of the Republican Accountability Project's many efforts criticizing Republican lawmakers like House Minority Leader Kevin McCarthy (R-Calif.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for their continuous enabling of Trump.",
    "author": "Meaghan Ellis",
    "title": "'Partisan Derangement Syndrome': Never Trumper Group Takes Their Ad To Fox News (VIDEO)"
  },
  {
    "id": 11301,
    "mediaId": 2528,
    "date": "2022-03-16",
    "sentence": "Republican Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> made appearances at the event, prompting condemnation from other party members.",
    "author": "Kelsey Vlamis",
    "title": "White nationalist Nick Fuentes praised Putin for trying to 'liberate Ukraine' 2 weeks after GOP lawmakers attended an event he hosted"
  },
  {
    "id": 11496,
    "mediaId": 2637,
    "date": "2022-03-18",
    "sentence": "Representatives Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> participated in a white nationalist conference last month where participants applauded Russia and chanted Putin’s name.",
    "author": "",
    "title": "Top U.S. House Republican slams party hardliner over Zelenskiy 'thug' comment"
  },
  {
    "id": 10884,
    "mediaId": 2512,
    "date": "2022-03-18",
    "sentence": "She tweeted a photograph at AFPAC with Fuentes and United States Representative Marjorie Taylor Greene (R-Georgia), who along with Congressman <span class='selected-term'>Paul Gosar</span> (R-Arizona) was a guest of honor.",
    "author": "Brandon Gage",
    "title": "Twitter torches Idaho's Republican lieutenant governor for kanoodling with White supremacists"
  },
  {
    "id": 10710,
    "mediaId": 2664,
    "date": "2022-03-18",
    "sentence": "Rep. Ted Lieu (D-CA) on Friday took some time on the House floor to shame his Republican colleagues for failing to do anything to discipline Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) for being featured speakers at a white nationalist conference last month.",
    "author": "Brad Reed",
    "title": "WATCH: Ted Lieu hilariously shames GOP's failure to discipline members who attended white nationalist conference"
  },
  {
    "id": 9098,
    "mediaId": 2643,
    "date": "2022-03-19",
    "sentence": "\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Wyoming Representative Liz Cheney tweeted.",
    "author": "Andrew Stanton",
    "title": "Trump-Backed McGeachin Stands by Appearance at 'White Nationalist' Event"
  },
  {
    "id": 9611,
    "mediaId": 2528,
    "date": "2022-03-20",
    "sentence": "Democrats also removed Rep. <span class='selected-term'>Paul Gosar</span>, a Republican from Arizona, from his committee assignments after he posted an edited anime video showing him killing Rep. Alexandria Ocasio-Cortez.",
    "author": "Yelena Dzhanova",
    "title": "Kevin McCarthy says Democratic Rep. Adam Schiff will be removed from House Intelligence Committee if GOP wins majority in midterms"
  },
  {
    "id": 9071,
    "mediaId": 2664,
    "date": "2022-03-21",
    "sentence": "In fact, Republicans have made clear they are itching to do this in part as revenge for Democrats taking the step of stripping Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) of their committee assignments for extremist behavior, something that was itself unprecedented because generally both parties have policed their own members and revoked assignments themselves when members are this embroiled in controversy.",
    "author": "Matthew Chapman",
    "title": "Kevin McCarthy slammed for plans to boot Adam Schiff from the House Intelligence Committee"
  },
  {
    "id": 9190,
    "mediaId": 2724,
    "date": "2022-03-21",
    "sentence": "— Kevin McCarthy (@GOPLeader) March 20, 2022\nRELATED: McCarthy May Give Marjorie Taylor Greene, <span class='selected-term'>Paul Gosar</span> ‘Better’ Committee Assignments If GOP Takes Back Congress\nWill McCarthy Boot Omar and Swalwell Too?",
    "author": "Rusty Weiss",
    "title": "McCarthy Vows To Kick Adam Schiff Off Intel Committee If GOP Wins Back The House"
  },
  {
    "id": 8985,
    "mediaId": 3997,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "Hannah Hudnall",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 9773,
    "mediaId": 2548,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 9226,
    "mediaId": 8484,
    "date": "2022-03-24",
    "sentence": "+6\nView gallery\nA spokesperson for Republican Rep. Liz Cheney slammed the House's GOP Leader Kevin McCarthy for endorsing Cheney's primary challenger instead of condemning the right-wing members of his party\n+6\nView gallery\nCheney shared Adler's statement in a tweet and linked it to the CNN story it appeared in that called McCarthy's endorsement of Harriet Hageman, Cheney's Trump-backed GOP challenger, a 'special case'\nThe story notes that McCarthy has backed only one primary challenger ahead of the 2022 midterms - that of Cheney's - and not anyone trying to take out controversial Republican members including Reps. Marjorie Taylor Greene or <span class='selected-term'>Paul Gosar</span>.",
    "author": "Nikki Schwab",
    "title": "Cheney knocks McCarthy for backing her rival but not those of 'pro-Putin' lawmakers"
  },
  {
    "id": 9244,
    "mediaId": 2664,
    "date": "2022-03-25",
    "sentence": "In a now-deleted Periscope video posted in December 2020, Alexander also claimed that Brooks was one of three members of Congress — along with Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs, both of Arizona — who had helped plan the activities of Jan. 6.",
    "author": "Kathryn Joyce",
    "title": "MAGA purge: Jan. 6 organizer labels former ally Rep. Mo Brooks as 'LOSER' and 'piece of crap'"
  },
  {
    "id": 9357,
    "mediaId": 2679,
    "date": "2022-03-25",
    "sentence": "She has been defending her decision to address a white supremacist gathering in Florida — which put her in the company of extremist GOP Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> — and gone on the attack against authorities over a mistreated 10-month-old being taken from his family and put in protective custody.",
    "author": "Mark Z. Barabak",
    "title": "Is Trump losing his mojo?"
  },
  {
    "id": 9648,
    "mediaId": 2676,
    "date": "2022-03-25",
    "sentence": "In a now-deleted Periscope video posted in December 2020, Alexander also claimed that Brooks was one of three members of Congress — along with Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs, both of Arizona — who had helped plan the activities of Jan. 6.",
    "author": "Kathryn Joyce",
    "title": "MAGA purge: Jan. 6 organizer labels former ally Rep. Mo Brooks as \"LOSER\" and \"piece of crap\""
  },
  {
    "id": 9051,
    "mediaId": 2522,
    "date": "2022-03-25",
    "sentence": "He has also thrown his political weight behind Reps. Marjorie Taylor Greene, Madison Cawthorn, and <span class='selected-term'>Paul Gosar</span>, who are very popular in the Republican Party, not so much in Democratic circles.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Girl, you mad? Cheney blasts McCarthy for not rejecting MAGA candidates, and ultimate snub"
  },
  {
    "id": 9061,
    "mediaId": 2512,
    "date": "2022-03-27",
    "sentence": "In a now-deleted Periscope video posted in December 2020, Alexander also claimed that Brooks was one of three members of Congress — along with Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs, both of Arizona — who had helped plan the activities of Jan. 6.",
    "author": "Kathryn Joyce",
    "title": "Jan. 6 organizer labels former ally Rep. Mo Brooks a 'LOSER'"
  },
  {
    "id": 9057,
    "mediaId": 2551,
    "date": "2022-03-29",
    "sentence": "The effort is also backed by Reps. Andy Biggs (R-Ariz.), Dan Bishop (R-N.C.), Louie Gohmert (R-Texas), <span class='selected-term'>Paul Gosar</span> (R-Ariz.), Marjorie Taylor Greene (R-Ga.) and Thomas Massie (R-Ky.).",
    "author": "Elizabeth Elkind",
    "title": "GOP Rep. Matt Gaetz presses FBI's cyber chief on the whereabouts of Hunter Biden's laptop"
  },
  {
    "id": 9671,
    "mediaId": 2741,
    "date": "2022-03-29",
    "sentence": "So we thought it was time to start a list of all the things McCarthy has had to pull a lawmaker aside for:\nThe time Representative <span class='selected-term'>Paul Gosar</span> made and disseminated a video depicting him swinging a sword at Joe Biden’s head and decapitating Alexandria Ocasio-Cortez (McCarthy told CNN he spoke to Gosar, without condemning Gosar’s behavior)\nThe time Representative Marjorie Taylor Greene called for Nancy Pelosi to be executed for treason, harassed a school-shooting survivor on the street, blamed the California wildfires on Jewish laser beams, and espoused the ideas of QAnon (McCarthy refused to discipline the congresswoman and claimed that, during a private conversation, she “recognized” that she needed to hold herself to a higher standard)\nThe time Greene spoke at a white nationalist conference (McCarthy admitted this was bad but, following a conversation with Greene, declined to hold her accountable, saying, “my conversations with my members are exactly that.”)\nThe time Representative Lauren Boebert made Islamophobic comments about Representative Ilhan Omar (McCarthy obviously refused to condemn her but, rest assured, they had a chat!)",
    "author": "Bess Levin",
    "title": "Orgies, Beheadings, Jewish Space Lasers: Everything Kevin McCarthy Has Had to “Speak” to Republican Lawmakers About"
  },
  {
    "id": 9543,
    "mediaId": 2629,
    "date": "2022-03-29",
    "sentence": "It took him a week to speak to Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who had tweeted a violent video featuring Rep. Alexandria Ocasio-Cortez.",
    "author": "Emily Singer",
    "title": "House Republicans Enraged By Cawthorn’s ‘Orgy’ And 'Cocaine Bump' Claims"
  },
  {
    "id": 9436,
    "mediaId": 2894,
    "date": "2022-03-30",
    "sentence": "Of course, Cawthorn isn't the only controversial member in the GOP ranks: Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, for example, both recently addressed a conference organized by a White nationalist, and received little more than a verbal rebuke from their leaders and colleagues.",
    "author": "",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 9511,
    "mediaId": 2872,
    "date": "2022-03-30",
    "sentence": "This is a man, after all, who vowed to re-seat Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> after they were stripped of their committee assignments for palling around with Nazis and joking (??)",
    "author": "Rafi Schwartz",
    "title": "Madison Cawthorn’s coke orgy comments earned him a very stern talking-to"
  },
  {
    "id": 9289,
    "mediaId": 2643,
    "date": "2022-03-30",
    "sentence": "Arizona Republican <span class='selected-term'>Paul Gosar</span> was also at the America First Political Action Conference (AFPAC) in Florida.",
    "author": "Alexandra Hutzler",
    "title": "McCarthy Slammed for Being Harsher on Cawthorn Than Marjorie Taylor Greene"
  },
  {
    "id": 9196,
    "mediaId": 2512,
    "date": "2022-03-30",
    "sentence": "You can see the report for a few examples that include US Reps. Matt Gaetz, <span class='selected-term'>Paul Gosar</span> and Madison Cawthorn.",
    "author": "",
    "title": "The Republican Party is soaked in white supremacy. But is it a hate group?"
  },
  {
    "id": 9114,
    "mediaId": 2594,
    "date": "2022-03-30",
    "sentence": "In recent weeks that has included public rebukes of Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> for their attendance at a white nationalist-led far right conference hosted during CPAC in Florida.",
    "author": "John Bowden",
    "title": "Trump pours cold water on House speaker idea floated by Matt Gaetz"
  },
  {
    "id": 9083,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "You can see the report for a few examples that include US Reps. Matt Gaetz, <span class='selected-term'>Paul Gosar</span> and Madison Cawthorn.",
    "author": "John Stoehr",
    "title": "The Republican Party is soaked in white supremacy -- but is it a hate group?"
  },
  {
    "id": 9778,
    "mediaId": 2532,
    "date": "2022-03-31",
    "sentence": "McCarthy's rebukes came after House Democrats had lambasted him for not doing enough to address behavior from other Republican members, namely Rep. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, who both spoke at a gathering of white nationalists last month.",
    "author": "Melissa Quinn",
    "title": "McCarthy rebukes Cawthorn over his claims that lawmakers have invited him to orgies and use drugs"
  },
  {
    "id": 7782,
    "mediaId": 2699,
    "date": "2022-03-31",
    "sentence": "Yet another Freedom Caucus member, Rep. <span class='selected-term'>Paul Gosar</span>, has emerged essentially unscathed after speaking at a white supremacist conference and posting a violent anime depicting the murder of Rep. Alexandria Ocasio-Cortez.",
    "author": "Wajahat Ali",
    "title": "The GOP Was Hard to Embarrass. Then Came Madison Cawthorn."
  },
  {
    "id": 7337,
    "mediaId": 2547,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Steve M.",
    "title": "GOP Insiders Want You To Think Ginni Thomas Is An Incompetent Hack"
  },
  {
    "id": 7123,
    "mediaId": 2724,
    "date": "2022-03-31",
    "sentence": "The Republican’s proposal reads, “The 51 signatories of the letter who publicly and falsely decried Hunter Biden’s laptop to be Russian disinformation should be barred from holding any level of security clearances indefinitely.”\nGaetz’s resolution is co-sponsored so far by fellow Republican Reps. Thomas Massie, Dan Bishop, Andy Biggs, <span class='selected-term'>Paul Gosar</span>, Louie Gohmert, and Marjorie Taylor Greene.",
    "author": "John Hanson",
    "title": "Rep. Gaetz Introduces Resolution To Strip Security Clearances From Officials Who Called Hunter Biden Laptop Story ‘Russian Disinformation’"
  },
  {
    "id": 7076,
    "mediaId": 2512,
    "date": "2022-03-31",
    "sentence": "AFPAC also featured prerecorded speeches from Rep. <span class='selected-term'>Paul Gosar</span> of Arizona and Idaho Lt.",
    "author": "Alex Henderson",
    "title": "Nick Fuentes praises 'thinly veiled racism' of GOP attacks on Ketanji Brown Jackson"
  },
  {
    "id": 7054,
    "mediaId": 2594,
    "date": "2022-03-31",
    "sentence": "But the final straw for McCarthy was that Cawthorn dared to impugn the character of a caucus that includes the likes of <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene and Lauren Boebert.",
    "author": "Eric Garcia",
    "title": "Kevin McCarthy is to blame for Madison Cawthorn. He deserves the consequences"
  },
  {
    "id": 7098,
    "mediaId": 2621,
    "date": "2022-04-01",
    "sentence": "“And there was miscommunication.”\nGosar spoke to AFPAC in-person in 2021:\nRep. <span class='selected-term'>Paul Gosar</span> is helping Nick Fuentes recruit young conservatives to his white nationalist, Christian nationalist ideology https://t.co/1yZuAV3oq4 pic.twitter.com/8rzfAhSv5S\n— Right Wing Watch (@RightWingWatch) March 12, 2021\nWhen asked about addressing the White nationalists again this year, Gosar reportedly shrugged it off.",
    "author": "Kipp Jones",
    "title": "Paul Gosar Blames ‘Miscommunication’ With Staffer For His Address to White Nationalist Nick Fuentes’ AFPAC"
  },
  {
    "id": 7729,
    "mediaId": 2550,
    "date": "2022-04-01",
    "sentence": "Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> spoke at a white nationalist event and McCarthy had a private chat with them, then went to reporters and explicitly promised that they’d get their committee assignments back if Republicans take the House.",
    "author": "Laura Clawson",
    "title": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies"
  },
  {
    "id": 7674,
    "mediaId": 2790,
    "date": "2022-04-01",
    "sentence": "This was a swifter-than-usual response from the GOP leader\nMcCarthy has had to step in to condemn various rhetoric and actions taken by members of his conference, from denouncing language used by Rep. Marjorie Taylor Greene that equated COVID-19 safety measures with the treatment of Jews during the Holocaust and more recently calling it \"appalling\" that Greene and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona attended an event led by a white nationalist.",
    "author": "Barbara Sprunt",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 7362,
    "mediaId": 2520,
    "date": "2022-04-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> sought to distance himself from Nick Fuentes in remarks Friday, saying he didn't intend to make a videotaped greeting for the white nationalist's annual conference in February, though he appeared in person at the gathering last year.",
    "author": "Ronald J. Hansen",
    "title": "'Nick's got a problem with his mouth': Rep. Paul Gosar seeks distance from white nationalist"
  },
  {
    "id": 7324,
    "mediaId": 2594,
    "date": "2022-04-02",
    "sentence": "Arizona Republican Representative <span class='selected-term'>Paul Gosar</span> has blamed his video appearance at a conference organised by a white nationalist last month on a staff error prompted by “miscommunication”.",
    "author": "Gustaf Kilander",
    "title": "Paul Gosar blames video appearance at white nationalist conference on staff error"
  },
  {
    "id": 7627,
    "mediaId": 2699,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Ben Burgis",
    "title": "Republicans Just Proved ‘Right-Wing Populism’ Is a Con Job"
  },
  {
    "id": 7385,
    "mediaId": 2664,
    "date": "2022-04-05",
    "sentence": "Many of those who opposed at least one of the bills were frequent far-right allies of former President Donald Trump, like Reps. <span class='selected-term'>Paul Gosar</span> (R-AZ), Lauren Boebert (R-CO), Marjorie Taylor Greene (R-GA), and Madison Cawthorn (R-NC).",
    "author": "Matthew Chapman",
    "title": "Republicans shredded for voting against Ukraine relief: They 'love Russia and hate America'"
  },
  {
    "id": 7635,
    "mediaId": 2676,
    "date": "2022-04-06",
    "sentence": "Only three Republicans declined to support it: Matt Rosendale, R-Mt., Thomas Massie, R- Ky., and <span class='selected-term'>Paul Gosar</span>, R-Az.",
    "author": "Heather Digby Parton",
    "title": "Trump's trashing of Ukraine pays off for Russia: Republicans vote to reject NATO — and democracy"
  },
  {
    "id": 7757,
    "mediaId": 2859,
    "date": "2022-04-06",
    "sentence": "Also, Romney referred to Greene and Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz., as “morons” for attending a conference put on by a white supremacist where people cheered for Russian President Vladimir Putin after the invasion of Ukraine.",
    "author": "Dennis Romboy",
    "title": "Mitt Romney’s support of Ketanji Brown Jackson unleashes conservative vitriol"
  },
  {
    "id": 7838,
    "mediaId": 2676,
    "date": "2022-04-06",
    "sentence": "UPDATE: A representative of Congressman <span class='selected-term'>Paul Gosar</span>'s campaign spoke with the Arizona Mirror after publication of their story to say the congressman would not be attending the white nationalist group's event on April 20.",
    "author": "Kelly McClure",
    "title": "GOP Rep. Paul Gosar promoted appearance at white nationalist event, but now says he is not attending"
  },
  {
    "id": 8549,
    "mediaId": 8345,
    "date": "2022-04-07",
    "sentence": "",
    "author": "",
    "title": "Gosar moves to Mohave County"
  },
  {
    "id": 7895,
    "mediaId": 2520,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> has once again brought national attention to a far-right group and its efforts with his name dangled as a participant, only to be later disavowed.",
    "author": "Ronald J. Hansen",
    "title": "Rep. Paul Gosar promotes, then disavows, extremist group's event"
  },
  {
    "id": 7620,
    "mediaId": 2738,
    "date": "2022-04-07",
    "sentence": "Arizona Rep. <span class='selected-term'>Paul Gosar</span> chose the latter.",
    "author": "Jennifer Wood",
    "title": "Rep. Paul Gosar Was Planning To Celebrate Hitler’s Birthday At A White Nationalist Bash, But Has Since Backed Out"
  },
  {
    "id": 7358,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Now Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) are getting the same challenge.",
    "author": "Sarah K. Burris",
    "title": "Two more GOP ‘insurrectionists’ face ballot challenges as voters seek to disqualify them from office"
  },
  {
    "id": 7377,
    "mediaId": 2590,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> was reportedly scheduled to attend a far-right conference with ties to white nationalists the day of Adolf Hitler’s birthday before his campaign appeared to back out.",
    "author": "Sebastian Murdock",
    "title": "Rep. Paul Gosar Was Scheduled To Attend Far-Right Event On Hitler's Birthday: Report"
  },
  {
    "id": 7533,
    "mediaId": 2741,
    "date": "2022-04-07",
    "sentence": "Arizona conservative representative <span class='selected-term'>Paul Gosar</span> is once again attempting to brush off ties to far-right organizations.",
    "author": "Caleb Ecarma",
    "title": "Déjà Vu: House Republican Paul Gosar Was Tied to Yet Another Far-Right Event"
  },
  {
    "id": 7105,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Greene recently escaped meaningful rebuke from Republican leaders when she and Rep. <span class='selected-term'>Paul Gosar</span> spoke at a white nationalist event.",
    "author": "Laura Clawson",
    "title": "Jimmy Kimmel claps back after Marjorie Taylor Greene says she reported his joke to the police"
  },
  {
    "id": 7096,
    "mediaId": 2636,
    "date": "2022-04-07",
    "sentence": "In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives <span class='selected-term'>Paul Gosar</span> and Andy Biggs and State Representative Mark Finchem, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement.",
    "author": "",
    "title": "Legal Effort Expands to Disqualify Republicans as ‘Insurrectionists’"
  },
  {
    "id": 7287,
    "mediaId": 2512,
    "date": "2022-04-08",
    "sentence": "Telegram is a conspiracy & white nationalist fantasy land\\u2014that\\u2019s where Gosar hangs evidently.\\n\\nA dangerous time.pic.twitter.com/KNFe8otj31\n— Denver Riggleman (@Denver Riggleman) 1624929656\nHere's another bit from the Nick Fuentes speech at AFPAC, delivered right after Rep. <span class='selected-term'>Paul Gosar</span> got off the stage.",
    "author": "Alex Henderson",
    "title": "Paul Gosar just can’t stay away from white nationalists: journalist"
  },
  {
    "id": 8863,
    "mediaId": 8347,
    "date": "2022-04-08",
    "sentence": "LAKE HAVASU CITY, Ariz. (AP) — Republican U.S. Rep. <span class='selected-term'>Paul Gosar</span> says he now lives in Mohave County, putting his residence in Arizona’s newly redrawn 9th Congressional District as he runs for a seventh term.",
    "author": "Associated Press",
    "title": "Rep. Gosar shifts residence to Mohave County in new district"
  },
  {
    "id": 7284,
    "mediaId": 2547,
    "date": "2022-04-09",
    "sentence": "Prescott Republican Congressman <span class='selected-term'>Paul Gosar</span> was listed as a “special guest” with the white nationalist American Populist Union at an event that will be on a date popular among white nationalists and Neo-Nazis: Hitler’s birthday.",
    "author": "Ed Scarce",
    "title": "Paul Gosar Is GOP's Designated White Nationalist"
  },
  {
    "id": 6097,
    "mediaId": 2668,
    "date": "2022-04-11",
    "sentence": "The thinking behind this is that it would show Democrats that if they remove Republican representatives from their assignments for politically-motivated reasons as they did with Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ), then they would be given the same treatment.",
    "author": "Jeff Charles",
    "title": "Yes, We Absolutely Should Impeach President Biden"
  },
  {
    "id": 6509,
    "mediaId": 8345,
    "date": "2022-04-14",
    "sentence": "",
    "author": "",
    "title": "Kutz pitches platform"
  },
  {
    "id": 5227,
    "mediaId": 2664,
    "date": "2022-04-16",
    "sentence": "In a video made before the insurrection, Ali Alexander claimed that he and US Reps. Mo Brooks, Andy Biggs and <span class='selected-term'>Paul Gosar</span> “schemed up putting maximum pressure on Congress while they were voting.”\nThe video circulated on social media but was later deleted.",
    "author": "Lindsay Beyerstein",
    "title": "We now have undeniable proof of a coordinated Republican effort to subvert the 2020 election"
  },
  {
    "id": 5557,
    "mediaId": 2629,
    "date": "2022-04-16",
    "sentence": "In a video made before the insurrection, Ali Alexander claimed that he and Reps. Mo Brooks, Andy Biggs, and <span class='selected-term'>Paul Gosar</span> “schemed up putting maximum pressure on Congress while they were voting.”\nThe video circulated on social media but was later deleted.",
    "author": "Lindsay Beyerstein",
    "title": "Former Stone Aide Confirms GOP Plot To Steal 2020 Election"
  },
  {
    "id": 5553,
    "mediaId": 2621,
    "date": "2022-04-17",
    "sentence": "“But Lauren Boebert, and Marjorie Taylor Greene, and <span class='selected-term'>Paul Gosar</span>.",
    "author": "Ken Meyer",
    "title": "GOP Congressman Says the Republican Party is in ‘Troubled Waters’ Thanks to the Marjorie Taylor Greene ‘Element’"
  },
  {
    "id": 5347,
    "mediaId": 2557,
    "date": "2022-04-17",
    "sentence": "Host Chuck Todd posed the question, “Lauren Boebert, and Marjorie Taylor Green, and <span class='selected-term'>Paul Gosar</span>, is that a different element than you’ve ever seen before?”\nUpton replied, “I don’t think we’ve had as many folks in that sort of wing of the party elected as we have before, but I think they’re very popular back at home.”\nTodd then pressed Upton to explain his answer further.",
    "author": "DML News App",
    "title": "VIDEO: GOP Rep. who voted to impeach Trump warns party in ‘troubled waters’"
  },
  {
    "id": 5264,
    "mediaId": 2578,
    "date": "2022-04-17",
    "sentence": "‘Lauren Boebert, and Marjorie Taylor Green, and <span class='selected-term'>Paul Gosar</span>, is that a different element than you’ve ever seen before?’ host Chuck Todd asked.",
    "author": "Jim Hoft",
    "title": "Dirtbag RINO Fred Upton Goes on Meet the Press and Says Republican Party Is in “Troubled Waters” Because of Marjorie Taylor Greene and Lauren Boebert (VIDEO)"
  },
  {
    "id": 6109,
    "mediaId": 2732,
    "date": "2022-04-17",
    "sentence": "Her colleagues in the House include <span class='selected-term'>Paul Gosar</span> and Matt Gaetz and Lauren Boebert and Louie Gohmert and, sigh, many more.",
    "author": "Mona Charen",
    "title": "Mona Charen: How to disarm the crazies"
  },
  {
    "id": 5441,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "That’s in part because the conservative Christian political party may be having all kinds of non-Christian-style drug-fueled orgies (if Madison is to be believed), and also because Cawthorn and other Republican members of Congress like Lauren Boebert and <span class='selected-term'>Paul Gosar</span> represent a new tea party-inspired rat that has climbed aboard the sinking Republican ship.",
    "author": "",
    "title": "GOP civil war: conservative outlet reports Madison Cawthorn’s outrageous spending of taxpayer money"
  },
  {
    "id": 5760,
    "mediaId": 2716,
    "date": "2022-04-18",
    "sentence": "But traditional dynamics in the House have already begun to shift — consider how Democrats kicked Rep. Majorie Taylor Greene (R-Ga.) off her committees over past comments, or censured and removed Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) from his assignments after he promoted an animated video depicting violence against Democrats, including President Biden.",
    "author": "Brigid Kennedy",
    "title": "House GOP reportedly considering term limits for all committee leaders"
  },
  {
    "id": 5250,
    "mediaId": 2662,
    "date": "2022-04-19",
    "sentence": "HERE IS THE SILLY VIDEO Rep. <span class='selected-term'>Paul Gosar</span> Posted that Tyrant Pelosi Is Using to Demand He is Removed from His Congressional Committees — What a Joke\nNow Republicans are weighing in on imposing term limits on committee leadership positions if the GOP retakes the House of Representatives next year.",
    "author": "Jim Hoft",
    "title": "Kevin McCarthy Says GOP Could Strip Crooked Democrats from Committee Leadership Positions — DON’T BELIEVE IT"
  },
  {
    "id": 5240,
    "mediaId": 2664,
    "date": "2022-04-21",
    "sentence": "“Can’t they take their Twitter accounts away, too?”\nThe Times notes that among those pushing the 2020 election conspiracy theories is Boebert as well as other members like Reps. <span class='selected-term'>Paul Gosar</span>, Andy Biggs, Mo Brooks, Matt Gaetz, Madison Cawthorn, and Marjorie Taylor Greene.",
    "author": "Sarah K. Burris",
    "title": "Kevin McCarthy was furious with Republican colleagues for pushing Trump's 'Big Lie': new book"
  },
  {
    "id": 5983,
    "mediaId": 8428,
    "date": "2022-04-21",
    "sentence": "According to Axios, Trump-appointed U.S. District Judge Richard Myers blocked a similar case brought against Rep. Madison Cawthorn, R-N.C.\nAdditionally, as reported by ABC News:\n“Similar challenges are being brought against GOP Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs of Arizona and theoretically could be brought against Trump if he decides to run for office again in 2024.",
    "author": "Elad Hakim",
    "title": "Democrats seek to disqualify Republicans using an obscure constitutional provision"
  },
  {
    "id": 5917,
    "mediaId": 2629,
    "date": "2022-04-21",
    "sentence": "“It is absurd to claim that a sitting member of the United States Congress advocated for the overthrown of the United States government,” said Arizona attorney Alexander Kolodin, who represents Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), whose public support of the insurrection is also well-known, during an April 20 state court hearing in Phoenix where the group’s lawsuit challenging the candidacy of Gosar and two other pro-insurrection candidates was heard.",
    "author": "Steven Rosenfeld",
    "title": "Marjorie Taylor Greene Facing Questions Under Oath Over January 6 Role"
  },
  {
    "id": 6128,
    "mediaId": 2608,
    "date": "2022-04-22",
    "sentence": "Asked whether she knew activist Ali Alexander—whose suspected connection to Jan. 6 is currently being scrutinized by Congress and the Department of Justice—Greene replied that she didn’t “really.”\nThe non-profit group Free Speech for People brought similar against Rep. Madison Cawthorn (R-N.C.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) on the same grounds.",
    "author": "Adam Klasfeld",
    "title": "Seeking to Prevent Her Disqualification, Rep. Marjorie Taylor Greene Claims Under Oath That She Can’t Remember Much About Talks Before Jan. 6"
  },
  {
    "id": 5573,
    "mediaId": 2644,
    "date": "2022-04-22",
    "sentence": "Only the People have the right to choose who they send to Congress.”\nSimilar challenges have been brought up against other Republican members of Congress, including Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs of Arizona as well as North Carolina Rep. Madison Cawthorn.",
    "author": "Callie Patteson",
    "title": "Marjorie Taylor Greene first congressperson to testify about Jan. 6"
  },
  {
    "id": 4798,
    "mediaId": 2754,
    "date": "2022-04-23",
    "sentence": "There are similar efforts to block members like Arizona GOP Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs from appearing on state ballots.",
    "author": "Tyler Durden",
    "title": "Destroying Democracy To Save It? Court Advances Effort To Block GOP Candidates From Ballots"
  }
]