[
  {
    "id": 5886,
    "mediaId": 2547,
    "date": "2022-04-20",
    "sentence": "And you wonder why Ron DeSantis, Greg Abbott, and others are so keen to burn math textbooks...\nArizona's Republican Congresswoman <span class='selected-term'>Debbie Lesko</span> said on Twitter that Border Patrol agents had arrested a billion people at the U.S.-Mexico border over the past six months—wrongly adding three zeros to the correct number of a million people.",
    "author": "Ed Scarce",
    "title": "AZ Rep Bashed On Twitter, Says A Billion Migrants Apprehended At Border"
  },
  {
    "id": 5743,
    "mediaId": 2738,
    "date": "2022-04-20",
    "sentence": "Well, both of them have been distracted with Boebert tweeting about masks and Ted fretting about Mickey and Pluto getting it on, so House Freedom Caucus member Rep. <span class='selected-term'>Debbie Lesko</span> (R-AZ) stepped in and fill the void.",
    "author": "Kimberly Ricci",
    "title": "Rep. Debbie Lesko Gave Lauren Boebert A Run For Her Mockery With A Claim About Migrants That’s Being Dragged Hard"
  },
  {
    "id": 5771,
    "mediaId": 2596,
    "date": "2022-04-20",
    "sentence": "Congresswoman <span class='selected-term'>Debbie Lesko</span>, who represents Arizona's 8th congressional district, hugely overstated the arrest figures in the US over the last six months with an erroneous social media post.",
    "author": "",
    "title": "Republican says 'one billion people' have been caught at the southern border"
  },
  {
    "id": 4793,
    "mediaId": 2627,
    "date": "2022-04-21",
    "sentence": "This came to mind on Tuesday night when Republican Rep. <span class='selected-term'>Debbie Lesko</span> of Arizona published a related tweet — which has since been deleted — which read:\nPart of the problem, of course, is that the GOP congresswoman used a few too many zeroes: As Lesko saw it, more than a billion migrants were apprehended at the border.",
    "author": "Steve Benen",
    "title": "GOP has a weird habit of debunking its own ‘open borders’ claims"
  }
]