[
  {
    "id": 4239,
    "mediaId": 2522,
    "date": "2022-01-26",
    "sentence": "— Congresswoman <span class='selected-term'>Debbie Lesko</span> (@RepDLesko) January 25, 2022\nTexas Senator Ted Cruz wrote on Twitter, “The Biden-Harris Administration is rolling out the red carpet for illegal aliens.”\nThe Biden-Harris Administration is rolling out the red carpet for illegal aliens.",
    "author": "Chris Donaldson",
    "title": "Shocking video shows mostly adult male illegals released and then taken to TX airport"
  },
  {
    "id": 3239,
    "mediaId": 2644,
    "date": "2022-01-28",
    "sentence": "Disgraceful.”\nAnd Rep. <span class='selected-term'>Debbie Lesko</span> (R-Ariz.) said: “President Biden and VP Harris obviously want open borders!",
    "author": "Callie Patteson",
    "title": "US braces for record arrests at border as Biden continues flights of migrants"
  },
  {
    "id": 1859,
    "mediaId": 2520,
    "date": "2022-02-10",
    "sentence": "\"As federal regulators make major decisions about companies doing business here in the U.S., they should fully understand the national security implications.”\nThe Ministry of Foreign Affairs and of the People’s Republic of China held a news conference Monday during which spokesperson Zhao Lijan said that the China-related measures in the America COMPETES Act are “steeped in Cold War mentality.”\nRepublican Reps. Andy Biggs, Paul Gosar, <span class='selected-term'>Debbie Lesko</span> and Dave Schweikert of Arizona on Friday voted against the passage of the COMPETES Act while Stanton and fellow Democratic Reps. Tom O’Halleran, Ann Kirkpatrick, Raúl Grijalva and Ruben Gallego voted for it.",
    "author": "Cami Parrish",
    "title": "Stanton legislation aims to curb China influence on US markets"
  },
  {
    "id": 10750,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Rep. <span class='selected-term'>Debbie Lesko</span>, an Arizona Republican, said her state has been on standard time for nearly 40 years.",
    "author": "Ariana Figueroa",
    "title": "Congress hates changing the clocks just like everyone else"
  },
  {
    "id": 10839,
    "mediaId": 2520,
    "date": "2022-03-14",
    "sentence": "By U.S. Reps. <span class='selected-term'>Debbie Lesko</span> and Dan Newhouse\nIt is increasingly clear on issues ranging from energy independence to national security that Arizona’s priorities are America’s priorities.",
    "author": "Debbie Lesko and Dan Newhouse",
    "title": "Western U.S. has a voice to break through the D.C. bureaucracy"
  },
  {
    "id": 8974,
    "mediaId": 2724,
    "date": "2022-03-21",
    "sentence": "pic.twitter.com/6ATt9waaxN\n— Congresswoman <span class='selected-term'>Debbie Lesko</span> (@RepDLesko) January 24, 2022\nBloomberg isn’t the first media outlet to scold Americans to change their ways when it comes to the Biden economy.",
    "author": "Rusty Weiss",
    "title": "Bloomberg Lectures Americans On Inflation: Eat Lentils, Take The Bus, And Let Your Pets Die"
  },
  {
    "id": 7888,
    "mediaId": 6511,
    "date": "2022-04-05",
    "sentence": "Por su parte, <span class='selected-term'>Debbie Lesko</span>, representante de Arizona acusó a la administración de Joe Biden, de eliminarlo y declaró que: “Querer una frontera totalmente para cualquiera y para todos, de cualquier país, en todo el mundo: terroristas, violadores, criminales”.",
    "author": "",
    "title": "Republicanos de la Cámara dicen que 18,000 migrantes cruzarán la frontera cuando expire Título 42"
  },
  {
    "id": 7192,
    "mediaId": 2526,
    "date": "2022-04-05",
    "sentence": "https://t.co/aUG6nnPheE\n— Senator Todd Young (@SenToddYoung) April 4, 2022\n“Over TWO million illegal immigrants have crossed into our nation since President Biden took office,” wrote Rep. <span class='selected-term'>Debbie Lesko</span> (R-AZ).",
    "author": "Joshua Klein",
    "title": "Republicans Warn of ‘Biggest Migration Crisis in U.S. History’ as Joe Biden Nixes Title 42"
  },
  {
    "id": 5771,
    "mediaId": 2596,
    "date": "2022-04-20",
    "sentence": "Congresswoman <span class='selected-term'>Debbie Lesko</span>, who represents Arizona's 8th congressional district, hugely overstated the arrest figures in the US over the last six months with an erroneous social media post.",
    "author": "",
    "title": "Republican says 'one billion people' have been caught at the southern border"
  },
  {
    "id": 5886,
    "mediaId": 2547,
    "date": "2022-04-20",
    "sentence": "And you wonder why Ron DeSantis, Greg Abbott, and others are so keen to burn math textbooks...\nArizona's Republican Congresswoman <span class='selected-term'>Debbie Lesko</span> said on Twitter that Border Patrol agents had arrested a billion people at the U.S.-Mexico border over the past six months—wrongly adding three zeros to the correct number of a million people.",
    "author": "Ed Scarce",
    "title": "AZ Rep Bashed On Twitter, Says A Billion Migrants Apprehended At Border"
  },
  {
    "id": 4793,
    "mediaId": 2627,
    "date": "2022-04-21",
    "sentence": "This came to mind on Tuesday night when Republican Rep. <span class='selected-term'>Debbie Lesko</span> of Arizona published a related tweet — which has since been deleted — which read:\nPart of the problem, of course, is that the GOP congresswoman used a few too many zeroes: As Lesko saw it, more than a billion migrants were apprehended at the border.",
    "author": "Steve Benen",
    "title": "GOP has a weird habit of debunking its own ‘open borders’ claims"
  }
]