{
  "id": 2346,
  "mediaId": 2534,
  "date": "2022-02-08",
  "headline": "Who’s crafting public policy? A push to diversify Capitol Hill staff.",
  "image": "https://images.csmonitor.com/csm/2022/02/0208-CDIVERSITY-JenniferDeCasper.jpg?alias=standard_900x600",
  "link": "https://www.csmonitor.com/USA/Politics/2022/0208/Who-s-crafting-public-policy-A-push-to-diversify-Capitol-Hill-staff?icid=rss",
  "mediaOutlet": "Christian Science Monitor",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christa Case Bryant",
  "authorUrl": "https://www.csmonitor.com/About/People/Christa-Case-Bryant",
  "termIds": [
    0
  ],
  "sentences": [
    "“Each one of us looks out of a house through a certain set of windows.”\nThe issue has gotten particular attention in Congress this month, driven by an Instagram account called @dear_white_staffers that chronicles minorities’ raw tales of mistreatment – including some who were paid so little they lived on food stamps or brought Tupperware to take home leftover office food.",
    "Detachment from issues can lead politicians to parrot talking points without really understanding root causes, he says, “and we get policies that further exacerbate the situation.”\nMarshaling people who feel passionately about certain causes because of their experiences can help move ideas through the Washington bureaucracy, too.",
    "“I truly think that Dulles was necessary for me to be who I am today as the chief of staff.”\nWhy We Wrote This\nMany argue that staffing Capitol Hill with people from a wider array of backgrounds could help address one of the biggest critiques about Washington – that it’s elitist and out of touch with average Americans.",
    "“But how long can someone be in that role and do that work and not be compensated as someone who can grow into a higher-level position and make a true impact on decision-making?”\nBroadening the range of voices in senior positions could change how Congress operates and the kind of legislation that gets drafted.",
    "“Congress serves as a feeder for both the federal government, like the executive branch agencies, but also local mayors, city council members, and state legislators,” says Carlos Mark Vera, co-founder of Pay Our Interns, a group that advocates for equitable hiring and eliminating unpaid internships.",
    "“Dulles was probably my greatest job, because it taught me the most in terms of humility, in terms of the way you treat people, the way you see people,” says Ms. DeCasper, who a year later landed a position with GOP lawmaker Tim Scott of South Carolina, and is today the senator’s right-hand woman.",
    "The stories are legendary of interns and young staffers trying to survive Washington – the nation’s fifth most expensive city – as an unpaid intern or on a junior Hill salary, from subsisting on 10-cent Buffalo chicken wings to carrying pepper spray in the only neighborhood they could afford.",
    "Ms. DeCasper, too, after her experience on the tarmac, strives to treat everyone with respect regardless of their station in life – from the kitchen staff and janitors to fresh faces like Dominique McKay, who came to the Hill a decade ago and connected early on with Ms. DeCasper.",
    "“You go into this hallowed place and you’re working on these pieces of legislation, and you end the night going to a poorer part of D.C. and you’re providing customer service to people who are using their [electronic benefits transfer] card and pinching pennies,” says Mr. Bell.",
    "It’s just, diversity is good government.”\nCapitol Hill is but one of numerous arenas – including journalism, academia, and nonprofits – that are difficult for working-class students to enter because of low starting pay and the concentration of jobs in expensive coastal cities.",
    "“There continues to be a pervasive view in this country that if you’re working on Capitol Hill, or if you’re working for the government, you’re probably making too much money,” says Ms. Hoffman, now vice president of federal affairs at Assurant, an insurance provider.",
    "“‘It’s actually dealing with real-life issues, like access to housing.’”\nThat resonated with Ms. Smith, who had grown up in public housing, and she ended up playing a key role in shaping bipartisan legislation (still pending) on lead-safe public housing for children.",
    "“As I progressed from intern to staffer, I realized the harmful effects that come from groupthink and from letting only the elites control our government,” says Ms. Henson, a Republican who founded C2C and is now running for Congress from Florida.",
    "While many offices hire from within their own networks, she looks outside the usual Capitol Hill circles, searching for people with interesting life stories, a sense of purpose and passion, and the integrity her father exemplified in his work.",
    "On the Hill, she says, it’s important for senior managers to ensure minorities feel heard and supported, particularly when their communities or families are hit by incidents such as raids by U.S. immigration officials and police killings.",
    "“Right now, we’re watching our society become very fractured, very siloed,” says Rep. Chrissy Houlahan of Pennsylvania, an Air Force veteran and Teach for America alum whose office emphasizes hiring interns from low-income backgrounds.",
    "“It reminds you constantly of why you are getting up every morning and trying to make this work.”\nThe rate of attrition among young staff often means talented people never gain the experience needed to move into senior positions.",
    "Veronica Duron, who came to Congress on a fellowship from the Congressional Hispanic Caucus Institute, had been working on the Hill about six years when she decided to look up the publicly available salaries of other staffers.",
    "Such structural issues, critics say, have contributed to these professions becoming silos of relatively elitist, homogeneous thinking, in which many individuals have never experienced the issues they’re tasked with addressing.",
    "A new report from Issue One, a nonprofit that focuses on political reform, found that 1,200 congressional staffers aren’t paid a living wage, including 70% of those working in the entry-level job of staff assistant.",
    "“You lay 400 eggs and try to get as many as possible past the gauntlet.”\nAlexandria Smith remembers the guidance she got early on from Mr. Alety when he was Senator Scott’s staff director for a banking subcommittee.",
    "“We just want to see equal representation in lobbying,” says Monica Almond, co-founder of the Diversity in Government Relations Coalition, which is currently compiling statistics on diversity among lobbying firms.",
    "He put himself through his first year of community college working from 2 a.m. to 10 a.m. at UPS – on top of taking classes, participating in speech and debate activities, and spending late nights in the library.",
    "Over the past half-century, there’s been “an enormous shift of responsibility” toward staffers, who now do “95% of the nitty-gritty work of drafting [bills],” wrote the late Sen. Ted Kennedy in his 2009 memoir.",
    "“Jennifer DeCasper continues to be one of the best examples in the entire Senate of a staffer who takes on this role,” says Don Bell, a former Democratic aide who led the Senate Black Legislative Staff Caucus.",
    "In 2017, Senator Scott and Ms. DeCasper, his chief of staff, went to the White House and secured the president’s backing for an initiative to encourage private investment in “opportunity zones” in urban areas.",
    "She was working for a GOP lawmaker and overheard others in her office talking about “welfare queens” who would take advantage of the food subsidies in the measure to buy hot meals instead of foodstuffs.",
    "A 2019 report from Pay Our Interns found that private university students held three-quarters of the paid internships in Congress – 50% more than their share of the national undergraduate population.",
    "In building an inclusive environment, she also searches for potential hires who go out of their way to talk to everyone, from the person picking up the trash to the Republican down the hall.",
    "“A lot of people think that this is just an issue that the Republican Party has, which is not the case,” says LaShonda Brenson, senior fellow of diversity and inclusion at the Joint Center.",
    "Nearly half of House staffers think they are underpaid, and more than 4 in 10 have seriously considered leaving, according to a 2021 survey by the House Office of Diversity and Inclusion.",
    "“My mom was juggling two jobs – selling used cars and getting home at 8 p.m.” – that’s why she wanted to buy rotisserie chicken with her food stamps, not because she was too lazy to cook.",
    "While statistics on the class and educational backgrounds of congressional staffers are difficult to come by, studies hint at how much of a one-dimensional culture the Hill really is.",
    "And Shay Hawkins, the man who had told Ms. DeCasper he wanted to make an “outsized contribution,” played a key role in getting the legislation into the GOP tax cut package that year.",
    "After enrolling in college against her mother’s wishes, she was mistaken for a cleaning woman and confronted by campus groups offering rewards for turning in unauthorized immigrants.",
    "When Jennifer DeCasper quit her job as a Colorado prosecutor to move to Washington, D.C., and serve the American people, she didn’t imagine doing it on the tarmac of Dulles Airport.",
    "Mr. Bruce says his firsthand experience with gang violence gave him insights that he didn’t often hear from the experts brought up to the Hill to talk about gun control or crime.",
    "Ja’Ron Smith, a former Scott staffer who had become the Trump administration’s director of urban affairs and revitalization, helped mobilize support within the executive branch.",
    "“The world we’re in is incredibly complex and multidimensional,” says Scott Page, a political science professor at the University of Michigan in Ann Arbor who studies diversity.",
    "If the people building dating apps or writing newspaper stories come from relatively advantaged backgrounds, he says, that could inadvertently perpetuate societal inequities.",
    "“That’s our long-term vision.”\nFinances remain a key impediment to attracting a broad range of young people to Washington – and keeping them on the Hill once they are there.",
    "Advocates say that broadening the talent pool would help congressional offices better reflect the country they represent and craft more effective solutions to problems.",
    "Amid a growing movement to broaden the ranks of congressional staffers, Ms. DeCasper stands out not only for who she is, but also for how she cultivates diversity.",
    "C2C alum Jalen Johnson recounts that both his white and Black peers were surprised to hear that food stamps were crucial to keeping himself and his siblings alive.",
    "He stuck out his internship and went on to work as a staffer on the Hill, a Facebook employee, and a lobbyist before returning to C2C as director of development.",
    "“The impact is way beyond itself.”\nCongress is also a talent pipeline for the lobbying sector, which wields growing influence, doubling its spending since 2000.",
    "With the help of College to Congress (C2C), an organization that funds internships for high-achieving, low-income congressional interns, he came to Washington.",
    "“It’s kind of like sea turtles on the beach,” says Saat Alety, a former GOP Hill staffer who is now director for federal affairs and public policy at Allstate.",
    "So Ms. Duran suggested her superiors allocate $8,000 per semester, establish a base stipend for each intern, and divide the rest according to financial need.",
    "“So there’s a lot of political pressure to keep salaries low.”\nMr. Bell, the former Democratic staffer, struggled when he first arrived in Washington, too.",
    "But at least until recently, few staffers had received housing, food, or unemployment assistance, which Congress spent more than $650 billion on last year.",
    "To make ends meet, she shopped at T.J. Maxx, grabbed free food at receptions, and worked at a patent law firm at night while babysitting on the weekends.",
    "With a greater spotlight on Capitol Hill’s lack of diversity, efforts have sprung up to improve pay and encourage staffing that better reflects America.",
    "“It’s not just about creating a diverse office, but a community of people,” says Ms. McKay, who now works under Ms. DeCasper as communications director.",
    "So there she was, wearing a fluorescent vest and waiting at the foot of the stairs to a plane, when a former law firm colleague handed over her bag.",
    "“A lot of people stay here because they’re passionate about the work,” says Jazmine Bonner, president of the Senate Black Legislative Staff Caucus.",
    "Enter Rosario Duran, a young Democratic staffer who came up with a way to stretch the funds that her office used to pay congressional interns.",
    "Like the lawyer whose experience living in his car due to financial challenges gave him a different perspective on banking and housing issues.",
    "She hired them all, helping Senator Scott build a staff with a wide range of backgrounds and life experiences, as well as racial diversity.",
    "But amid the 2008-09 Great Recession, the only job she could get was guiding planes to their gates with orange batons and handling baggage.",
    "Over the past few years, Congress has appropriated $48 million for paid internships, due in part to lobbying from C2C and Pay Our Interns.",
    "Less than 15% of senior staff positions are held by people of color, according to the Joint Center for Political and Economic Studies.",
    "She found empowerment by joining a Latina sorority and other student organizations, eventually becoming president of the Greek system.",
    "The result was that her office was able to not only create year-round opportunities for low-income interns, but also pay them better.",
    "“People are not taking time to look at, ‘Oh, is there a pay discrepancy between the white staff in my office and the staff of color?",
    "“And we really need to break that up.”\nDaQuawn Bruce from Chicago’s South Side had wanted to be president since he was 4 years old.",
    "Ms. DeCasper brings a different worldview to an institution traditionally staffed by upper-class graduates of elite universities.",
    "When she returned to Washington, she had a University of Michigan law degree but was a single mother working a blue-collar job.",
    "Now, among the Senate’s 100 chiefs of staff, she is likely the only former luggage handler – and one of only two who are Black.",
    "“Socioeconomic diversity transcends color, for sure,” says Mr. Johnson, now a Republican city commissioner in Albany, Georgia.",
    "No human resources department exists to oversee hiring and pay in Congress, leaving the 535 members to set their own policies.",
    "Other interns were renting vacation homes in Annapolis, Maryland, for the weekend and going out for steak-and-wine dinners.",
    "It could also counteract a growing disconnect between average Americans and elites – and maybe even temper partisan rancor.",
    "They should be doing not just as good as Republicans, but even better.”\nThe Hill’s lack of diversity has ripple effects.",
    "Is there an opportunity discrepancy?’” says Ms. Duron, now chief of staff for Democratic Sen. Cory Booker of New Jersey.",
    "SNAP benefits, the food subsidies dispersed to 39 million Americans in 2020 at a cost of nearly $80 billion, is the No.",
    "Programs like C2C could be tapped for supplemental funds, and interns could apply for financial aid from their schools.",
    "Or the Black man using a wheelchair who had a desire to make “an outsized contribution” but had zero Hill experience.",
    "The Hill already has a tightknit culture, which she believes can be leveraged to create a greater sense of community.",
    "She’s also become known for tapping her network to assist other legislative offices in diversifying their rosters.",
    "It’s not something you do just because you’re afraid of what people would say to you if they look at your numbers.",
    "By the time he got a full-time position on the Hill, he was two weeks away from defaulting on his student loans.",
    "Yet offices struggle to make that money go very far – and don’t necessarily funnel it to those who need it most.",
    "Greater diversity could bring different perspectives to other issues as well, from housing to criminal justice.",
    "When she first came to Capitol Hill, it was as a graduate of what is now Colorado Mesa University in Montrose.",
    "Advocacy groups say it’s imperative that congressional offices pay higher wages to staffers at all levels.",
    "1 issue cited by Hill staffers for why more people from varied backgrounds are needed to shape policies.",
    "In addition to better pay, mentoring can play a key role in helping promising young staffers develop.",
    "That’s particularly true for those from low-income homes, some of whom are supporting their parents.",
    "That meant fall and spring semester internships would be out of reach for most low-income students.",
    "Jill Hoffman came to the nation’s capital in 1999 with a sense of idealism and $500 in her pocket.",
    "“I was like, ‘OK, well, I have,’” Ms. Henson, who grew up in a mobile home, recalls telling them.",
    "Mr. Alety urged her to develop an expertise in banking – one of the least diverse policy areas.",
    "She focused on the ones who, like her, worked on health care for the Senate Finance Committee.",
    "“If you talk to all those people the same – those are the type of people I want,” she says.",
    "Others are changing hiring practices and trying to build a sense of community on the Hill.",
    "She was born to a teenage mother in Lincoln, Nebraska, and her dad worked as a garbageman.",
    "White lawmakers from both parties have similarly low levels of diversity on their staffs.",
    "It had a $25,000 annual intern budget to work with and was only paying summer workers.",
    "To pay the bills, he took a job as a cashier from 6:30 p.m. to 12:30 a.m. at Walmart.",
    "Or the female Marine from Puerto Rico who had the backbone to deal with the press.",
    "“People from our side of the track were able to play a big role,” says Mr. Smith.",
    "Then he won a full scholarship to a private school, but still worked full time.",
    "The law school graduate was working as an unpaid fellow in a senator’s office.",
    "Blacks and Latinos, meanwhile, were represented at less than half their share.",
    "... You mean to tell me that they don’t get an opportunity?” asks Mr. Bruce.",
    "Improving racial diversity helps, but other dimensions matter, too, he adds.",
    "Now, she’s the legislative director for GOP Rep. Byron Donalds of Florida.",
    "“If it’s all about who you know, what about the kids who have the talent?",
    "Mr. Bruce, from Chicago’s South Side, has seen his share of adversity.",
    "At the least, it might change the tone in some Capitol Hill cubicles.",
    "Audrey Henson recalls when Congress was debating the 2013 Farm Bill.",
    "Still, it’s a long journey from interning to becoming a senior aide.",
    "Senior Democratic leaders are now supporting their push to unionize.",
    "“He said, ‘Banking isn’t just about numbers,’” recalls Ms. Smith.",
    "“It’s not something you do just because you want to check a box.",
    "She strode over and asked if they had ever been on food stamps.",
    "Still, she racked up thousands of dollars in credit-card debt.",
    "Ms. Duron, for one, knows how that can help unleash potential.",
    "(Her family has lived in Texas since it was a part of Mexico.)",
    "“I want somebody that has a heart for this place,” she says.",
    "Yet staffers play a critical role in shaping such policies.",
    "He was shot in his front yard after his C2C internship.",
    "Many say K Street is even less diverse than the Hill.",
    "“Democrats rely on people of color to vote for them.",
    "More needs to be done to close inequities as well.",
    "The lack of diversity worsens among senior ranks.",
    "He would order an appetizer and stick with water.",
    "But he also felt a sense of urgency and purpose.",
    "The woman didn’t even recognize Ms. DeCasper.",
    "Armed with the data, she asked for a raise.",
    "Besides, she said, she wasn’t good at math.",
    "His cousin was killed a few months later.",
    "“I think it’s ripe for that,” she says.",
    "Or is there a treatment discrepancy?",
    "In a way he felt he didn’t belong.",
    "At first, she wasn’t interested.",
    "So she left after 18 months.",
    "Her boss readily agreed.",
    "She was the lowest paid.",
    "Many of them don’t.",
    "They hadn’t."
  ]
}