{
  "id": 8434,
  "mediaId": 19,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "Michigan Board of Canvassers Knocks Five Republican Candidates for Governor off Ballot",
  "image": "https://media.breitbart.com/media/2022/02/James-Craig-former-Detroit-Police-Chief-Michigan-Sept14-21-ap-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/28/michigan-board-of-canvassers-knocks-five-republican-candidates-for-governor-off-ballot/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    651,
    773,
    1844,
    146,
    428,
    6098,
    2791
  ],
  "sentences": [
    "Five Republican candidates for governor in Michigan will be kept off the state's primary election ballot after the state Board of Canvassers deadlocked along party lines when determining the validity of the candidates' signatures.",
    "The BOE staff determined that the sheets had invalid signatures because the petitions contained the names of voters who weren't registered in the correct jurisdiction or had valid voters with forged signatures.",
    "According to a Michigan Bureau of Elections report, 36 individuals who submitted stacks of petitions turned in at least 68,000 invalid signatures submitted across 10 sets of nominating petitions.",
    "The board's two Republicans voted against the staff's recommendations that the GOP candidates be kept off the ballot over allegedly fraudulent signatures on their petitions to get on the ballot.",
    "The deadlocked vote keeps former Detroit Police Chief James Craig and businessman Perry Johnson off the ballot, two of the GOP's top candidates in the race to replace Democrat Gov.",
    "They failed to carry their burden of establishing the invalidity of enough of Mr. Johnson's signatures by clear, competent and convincing evidence, the lawsuit said.",
    "We are disappointed in the Board of Canvassers decision, but we are not surprised the partisan Democrats on the committee ruled against Michigan voters, Craig said.",
    "Craig is expected to follow a move by Johnson, who filed a lawsuit on Friday asking the state's Court of Appeals to order the board to put his name on the ballot.",
    "After those signatures were thrown out, the candidates failed to reach the 15,000 signature threshold required to get on the ballot.",
    "It is a travesty that partisans in a position to uphold democracy and the will of the people allowed politics to get in the way.",
    "Johnson's lawsuit alleges the board should have inspected each petition line by line instead of striking entire sheets.",
    "However, because the two Democrats voted in favor of the staff recommendation, it stayed in place due to the tie vote.",
    "Michigan law requires gubernatorial hopefuls to get at least 15,000 valid signatures to get their names on the ballot.",
    "Craig said he's disappointed with the board's decision and called it a travesty in a statement.",
    "Craig allegedly turned in 9,879 fraudulent signatures, while Johnson turned in 6,983.",
    "Gretchen Whitmer."
  ]
}