{
  "id": 924,
  "mediaId": 19,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Poll: Former Detroit Police Chief James Craig Holds Double-Digit Lead in Michigan Governor's Primary",
  "image": "https://media.breitbart.com/media/2021/08/AP_20107742010993-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/01/poll-former-detroit-police-chief-james-craig-holds-double-digit-lead-in-michigan-governors-primary/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    651,
    1228,
    1844,
    2002,
    2298,
    3075,
    152,
    2748,
    2791,
    2958
  ],
  "sentences": [
    "Cook noted at the time that Craig looks like an early favorite.?\nWhile former President Donald Trump has not weighed in on the Republican primary race at this stage, the polling results come one day ahead of a rally Trump is planning to hold Saturday night in Washington Township, Michigan, which will feature several candidates from the state that he has already endorsed.",
    "Craig celebrated his campaign's strong position in a statement, saying, Our message of solving problems and leading from the front resonates with Michiganders as I travel across the state.?\nThe momentum is behind us, and I hear it all the time  Michiganders want real leadership in Lansing to rebuild our economy and bring good-paying jobs back to Michigan,? Craig added.",
    "Trailing Craig and Soldano were several other candidates in the packed primary race, including businessman Perry Johnson at eight percent, real estate broker and activist Ryan Kelly at six percent, conservative commentator Tudor Dixon at three percent, and former car dealership owner Kevin Rinke at two percent, according to the poll.",
    "Gretchen Whitmer, who has spent the last two years fending off Republican criticisms of her notoriously stringent coronavirus lockdowns and mandates in 2020 and 2021 that were coupled with repeated instances of Whitmer defying her own policies and recommendations.",
    "The results of the McLaughlin poll coincide with a Trafalgar poll that was also released Friday that found Craig again with a wide lead over his closest opponent, this time Johnson, with Craig receiving 34 percent compared to Johnson's 16 percent.",
    "The polling memo, sent out by Craig's campaign, reveals a McLaughlin & Associates poll found Craig with 31 percent support compared to Soldano's 14 percent support, while 34 percent of respondents said they were undecided on a candidate.",
    "Former Detroit Police Chief James Craig is leading his closest opponent, Garrett Soldano, by 17 points in the Republican primary race for Michigan governor, according to a polling memo released Friday.",
    "The poll also weighed the image rating? of candidates and found Craig, who served as chief of the Detroit Police Department for eight years, had the most name recognition, at 72 percent.",
    "The election analysis outlet Cook Political Report rates the general election race a toss-up,? a rating it moved from lean democrat? in December.",
    "Johnson had 60 percent name recognition, Soldano had 51 percent, Rinke had 47 percent, and Dixon rounded out the list at 37 percent.",
    "The McLaughlin poll was taken March 22 to 24 among 500 likely primary voters and had a margin of error of +/- 4.4 percent.",
    "Soldano came in third at 15 percent, followed by Kelly at seven percent and Dixon at three percent.",
    "The primary takes place August 2, and the winner will face incumbent Democrat Gov.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "Follow her on Twitter at @asholiver."
  ]
}