{
  "id": 29,
  "mediaId": 63,
  "date": "4/3/2022 12:00:00 AM",
  "headline": "Checks & Imbalances: MyPillow CEO Covered Some Travel Expenses For Kristi Noem's PAC",
  "image": "https://imageio.forbes.com/specials-images/imageserve/62491400d91f109a4ea440a1/0x0.jpg?format=jpg&crop=3000,1689,x0,y88,safe&width=1200",
  "link": "https://www.forbes.com/sites/zacheverson/2022/04/03/checks--imbalances-mypillow-ceo-covered-some-travel-expenses-for-kristi-noems-pac/",
  "sentiment": "0.0",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Everson",
  "authorUrl": "https://www.forbes.com/sites/zacheverson/",
  "termIds": [
    769,
    1021,
    1148,
    1523,
    1850,
    2211,
    3085,
    3087,
    3094,
    329
  ],
  "sentences": [
    "and Eric Swalwell (D-Calif.), Erik Huey, Joe Crowley, Irish Ambassador Daniel Mulhall...? (Politico)\nTrump-tied Bush scheduler heads back to Sen. Portman? (LegiStorm)\nDemocratic adviser heads to amusement-park trade group? (LegiStorm)\nRepublican Rep. Diana Harshbarger bought and sold defense contractor stocks in the days after Russia invaded Ukraine? (Insider)\nMichigan AG hopeful Tom Leonard's fundraising draws fairness concerns? (Bridge Michigan)\nOh look who's the introductory speaker at the Koch-backed small biz group's Tax Summit: Kyrsten Sinema.? (Twitter/Jesse Eisinger of ProPublica)\nIntuit spends millions lobbying amid accusations of deceptive TurboTax advertising? (OpenSecrets)\nHow IFA brought down Biden's labor nominee? (Politico)\nBitcoin Makes QAnon Candidate's Fundraising Even Sadder? (The Daily Beast)\nMichigan House candidate Mellissa Carone has been disqualified from the Macomb County ballot after she submitted a faulty affidavit attesting that she had no outstanding campaign finance issues.? (The Detroit News)\nIn Closing\nI wish that I could fly\nInto the sky\nSo very high\nJust like a dragonfly\nI'd fly above the trees\nOver the seas in all degrees\nTo anywhere I please, oh?",
    "Tommy Thompson and Donald Trump meet at Mar-a-Lago to talk politics,' ex-aide says? (WIZM)\nEditor's Picks\nInside Hunter Biden's multimillion-dollar deals with a Chinese energy company? (The Washington Post)\nFacebook paid GOP firm to malign TikTok? (The Washington Post)\nBusiness, Highway Lobbies Fight Gas-Tax Holidays? (The Wall Street Journal)\nFederal campaign watchdog fines DNC, Clinton campaign over dossier spending disclosure? (Politico)\nSecretive Christian group at heart of D.C. politics ready for its close-up in Netflix docuseries? (NBC News)\nOver $215K was raised at tonight's fundraiser for Liz Cheney primary challenger Harriet Hageman, per person familiar.",
    "Ron DeSantis (R) continued to go after Disney on Friday over its opposition to the state's Parental Rights In Education Act (known to critics as the Don't Say Gay' law), saying he's receptive' to the state legislature revoking special privileges the company's received,? reports Alison Durkee for Forbes:\nDeSantis was asked at a press conference Friday about corporate tax breaks Disney receives from the state, including what the Orlando Sentinel reports could be up to $570 million in tax breaks for a new office complex the company is opening, as well as corporate tax refunds that the state is set to issue to companies in May.",
    "Kevin McCarthy and More than 100 House Republicans hosted the event, held at the home of McCarthy lieutenant Jeff Miller.? (Twitter/Alex Isenstadt of Politico)\nCrypto industry dives into the midterms, raising millions to court Democrats? (The Washington Post)\nLegal spending significantly increases at PAC run by Mark Meadows' wife? (The Raleigh News & Observer)\nJen Psaki planning to leave White House this spring for MSNBC gig? (Axios)\nCMD has learned that the dark money group the Honest Elections Project and the Heritage Foundation will hold a Secretaries of State Conference in DC on April 12-13, 2022.",
    "In Case You Missed It\nTrump's Truth Social Still Plagued With Glitches Despite March 31 Goal To Be Fully Operational'\nFormer President Donald Trump's new Truth Social platform appears to have whiffed on a self-imposed March 31 deadline to be fully operational,'? reports Nicholas Reimann for Forbes:\nTrump Media & Technology Group (TMGT) CEO Devin Nunes said just before the app's Presidents' Day launch it would have a slow rollout, but he expected it would be fully operational in the U.S. by the end of March.",
    "In December, the House Committee on January 6 subpoenaed records and testimony from Miller, stating he met with the former President in his private dining room off the Oval Office on January 4th, 2021 to discuss the January 6th Ellipse rally.?\nDarlene Swaffar, a QAnon-promoting Republican running for Congress in Florida, held a $1,000-per-person fundraiser at Mar-a-Lago on Tuesday.",
    "CMD has obtained a Save the Date' for the event.? (Twitter/David Armiak of the Center for Media and Democracy)\nFeds Slap Disgraced Rep. Duncan Hunter With Measly Fine After Trump Pardon? (The Daily Beast)\nOUT AND ABOUT  SPOTTED at Platinum Advisors' welcome party for Billy Tranghese at Sonoma on Wednesday night: Reps. Richie Neal (D-Mass.)",
    "DeSantis said that while he's in favor of the state taking away privileges that are unique to Disney, those tax breaks are ones that any business would be eligible for,? and insisted there are no special tax breaks that are Disney-specific that we would contemplate? taking away.",
    "At least four other Republicans running for the House were at the president's private club that night too: Darius Mayfield of New Jersey, Ohio's J.R. Majewski, Courtney Geels from North Carolina and Cait Corrigan of New York.",
    "Top right-wing figures like Sean Hannity, Marjorie Taylor Greene and Donald Trump Jr. were able to quickly join the platform after its launch, but the waiting list for the public to sign up has grown to more than 1.3 million.",
    "There is no listed in-kind contribution from May of last year because nothing was in-kind contributed to the Governor's committees from that RGA meeting.?\nA spokesperson for Lindell did not respond to an inquiry.",
    "Governor Noem's campaign finance reports are accurate, and as a longstanding rule we do not disclose additional information beyond what is legally required,? said Joe Desilets, Noem's campaign manager.",
    "Trump Moved to Take the Profit.? (The New York Times)\nThat is not an official CIA account': Trump's social media platform is filled with fake government profiles? (The Daily Dot)\nFormer Wisconsin Gov.",
    "South Dakota Governor Kristi Noem's (R) PAC, Noem Victory Fund, recently reported receiving an in-kind contribution of $2,850 worth of travel from MyPillow CEO Mike Lindell on Oct. 14.",
    "It's not clear how she characterized that trip, but no in-kind donation from Lindell appears on either her campaign's or PAC's financial disclosures covering that period.",
    "Continuing Irresolutions\nUpdates on Checks & Imbalances' previous reporting\nRep. Filemon Vela (D-Texas) resigned from Congress at 11:59 p.m. on Thursday.",
    "Thanks For Reading Checks & Imbalances\nThis is the Saturday, April 2 edition of the Checks & Imbalances newsletter, usually sent Mondays and Thursdays.",
    "A former Trump White House staffer now running for Congress in Ohio, Max Miller, was at Mar-a-Lago again this week, according to posts on social media.",
    "On Friday, the House Committee on Ethics announced it closed its investigation into Fortenberry, as the panel no longer has jurisdiction over him.",
    "While the invitation plugged former National Security Advisor Michael Flynn as a featured guest, there don't seem to be any photos of him there.",
    "By 9 a.m. the following morning, the law firm known for its lobbying had already issued a press release and headshot announcing Vela's hiring.",
    "In May, Noem caught a ride on Lindell's private jet, to a Republican Governors Association meeting, Politico reported at the time.",
    "And we once again check in on the many, many Republicans running for Congress whose campaign trail goes through Mar-a-Lago.",
    "Earlier last month, a jury convicted him of lying to the FBI about an illegal campaign donation from a foreign national.",
    "Tracking Trump\nJohn Gibbs, a GOP candidate for Congress in Michigan, held a fundraiser at Mar-a-Lago on Wednesday.",
    "Lindell has been one of the leading supporters of former President Donald Trump's false claims of election fraud.",
    "McFarland reportedly had a wonderful conversation? with a candidate for state rep in Florida at Mar-a-Lago.",
    "DeSantis Wants To Punish DisneyBut Won't Go After Its Corporate Tax Breaks\nFlorida Gov.",
    "It does not appear that he's publicly backed any of the other four candidates.",
    "Former President Trump and ex-HUD Secretary Ben Carson spoke at the event.",
    "Fortenberry's campaign reported spending $158,000 on legal fees last year.",
    "Vela vacated his seat with nine months left in his term to join Akin Gump.",
    "Spokespeople for Swaffar and Flynn did not respond to inquiries.",
    "Please support this work, if you can, by subscribing to Forbes.",
    "resignation from Congress took effect on Thursday, as planned.",
    "A Mar-a-Lago guest claimed she spoke with Trump about QAnon.",
    "Trump's former Deputy National Security Advisor K.T.",
    "He also launched a legal expense trust in August.",
    "To make sure you don't miss an issue, subscribe.",
    "And you can follow me on Twitter at @z_everson.",
    "Welcome to the Checks & Imbalances newsletter.",
    "Today we revisit South Dakota Gov.",
    "Trump endorsed Gibbs in November.",
    "She Took the White House Photos.",
    "Rep. Jeff Fortenberry's (R-Neb.)",
    "Email me at zeverson@forbes.com.",
    "Any tips or suggestions?",
    "Kristi Noem's travel.",
    "Florida Gov.",
    "It's free.",
    "Thanks!"
  ]
}