{
  "id": 66,
  "mediaId": 238,
  "date": "2/2/2022 12:00:00 AM",
  "headline": "Opinion: Trump-endorsed candidates are having trouble fundraising. That's a bad sign for the former president.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/02/trump-endorsed-candidates-are-having-trouble-fundraising-thats-bad-sign-former-president/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    2095,
    2475,
    3085,
    3087,
    3094,
    4325,
    254,
    428,
    2791,
    2945
  ],
  "sentences": [
    "In it, Trump speaks directly to camera, bashing Kemp over his certification of the 2020 election results and giving Perdue his complete and total endorsement.? Perdue trails Kemp in a recent Quinnipiac poll, even though Trump's endorsement was widely publicized when Perdue entered the race.",
    "Most have little to distinguish themselves from their Republican opponents other than Trump's complete and total endorsement.? But recent poll data shows that Republican voters are increasingly moving away from blind personal devotion to the former president.",
    "In Texas's special election for the 6th Congressional District last summer, Trump's super PAC waited until the last weekend before the election to spend $100,000 in support of his candidate, Susan Wright.",
    "Trump's PAC upped its buy in the next special election featuring a Trump endorsement, spending $300,000 to back coal executive Mike Carey for Ohio's 15th Congressional District.",
    "A recent poll by the Atlanta Journal-Constitution found that less than half of Republicans say a Trump endorsement would make them somewhat likelier to vote for that candidate.",
    "Combined with polling data suggesting a decline in Trump's relevance to Republican voters, they might just indicate that Trump's ice-like grip on the party is slowly thawing.",
    "Fundraising reports for the fourth quarter of 2021 are in, and they don't paint a pretty picture for candidates endorsed by former president Donald Trump.",
    "As Josh Kraushaar notes for National Journal, not a single Trump-backed federal candidate raised $1 million in the last three months of the year.",
    "Their most recent January poll showed the numbers reversed, with GOP voters saying they backed the party more than Trump by a 56-36 margin.",
    "But the same is true of professional wrestling, and no one thinks wrestling is about to supplant pro football as America's favorite sport.",
    "Trump's favorite in the Alabama Senate primary, Rep. Mo Brooks, raised only $386,000; both of his major competitors topped $1 million.",
    "That makes it interesting that former Georgia senator David Perdue, facing off against his state's incumbent Republican Gov.",
    "counterpoint\nThey might also be lacking the other factor that winning candidates need: a persuasive message.",
    "These candidates may expect Trump to spend on their behalf, but history does not necessarily show he will.",
    "Her campaign was also plagued by poor fundraising, and she ended up losing to then-State Rep. Jake Ellzey.",
    "Even a poll of North Carolina Republicans found that only 25 percent would definitely back Trump's choice.",
    "But Carey spent more on his own behalf  at least $460,000 before the crucial GOP primary  than Trump did.",
    "That's a solid number, but it's far from what a candidate in a two- or three-way race needs to triumph.",
    "Only 11 percent said Trump's endorsement would make them much more likely to back the endorsed person.",
    "The NBC News poll has for years tracked whether Republicans are more supporters of Trump or the party.",
    "Even Harriet Hageman, Trump's favorite to take out Wyoming Rep. Liz Cheney, brought in only $443,000.",
    "Clearly, endorsees waiting for Trump to spend liberally on their races could be waiting a long time.",
    "If Trump's endorsement is all Perdue has, the data suggest that Kemp will ultimately prevail.",
    "Many Republican candidates have hitched their political carts to Trump's horse this cycle.",
    "John Gibbs, Trump's pick for Michigan's 3rd Congressional District, raised only $51,000.",
    "If money is the mother's milk of politics, Trump's acolytes are severely malnourished.",
    "So far, the data suggest that might be worth less than they had originally thought.",
    "An intensely devoted group of people can make a businessperson fabulously wealthy.",
    "They wouldn't be the first people to have lost big by believing Trump's bluster.",
    "None of this means that Trump is finished as a leading national or party figure.",
    "If Team Trump can't even raise money to beat Cheney, something's going wrong.",
    "He retains the devotion of millions of people, and that counts for a lot.",
    "Even Trump's endorsement isn't the sure winner many seem to think it is.",
    "If that's all they have in politics, it only makes them a loser.",
    "In October 2020, that measure favored Trump by a 54-38 margin.",
    "Brian Kemp, decided to feature Trump in his most recent ad.",
    "If most of them lose, they just might be the last.",
    "Many raised abysmally pitiful totals."
  ]
}