{
  "id": 85,
  "mediaId": 129,
  "date": "1/5/2022 12:00:00 AM",
  "headline": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6",
  "image": "https://static01.nyt.com/images/2022/01/05/us/politics/05dc-republicans-1/merlin_182053863_e0185ffb-fd18-4152-89af-5c5b418735e5-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/01/05/us/politics/republican-impeachment-votes-trump-jan-6.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1248,
    1609,
    1614,
    1765,
    1901,
    2005,
    2006,
    2125,
    2214,
    3085,
    3087,
    3094,
    428
  ],
  "sentences": [
    "Mr. Gonzalez, deluged with threats and fearing for the safety of his wife and children, announced in September that he would not seek re-election  and called Mr. Trump a cancer for the country.?\nA Cuban American who starred as a wide receiver at Ohio State, Mr. Gonzalez had been considered the kind of politician who would ensure the Republican Party's future in a multiethnic, multiracial country after his election in 2018.",
    "Representative Kevin McCarthy of California, the House Republican leader, voted against impeachment but declared, The president bears responsibility for Wednesday's attack on Congress by mob rioters.?\nThe Senate Republican leader, Mitch McConnell of Kentucky, orchestrated Mr. Trump's acquittal after a hasty Senate impeachment trial.",
    "But he had let it be known that he considered the president culpable, and said as much in a scathing speech afterward: There's no question  none  that President Trump is practically and morally responsible for provoking the events of the day.?\nBut the rhetorical cover fire proved as ephemeral as it was useless.",
    "But he has turned his opposition to Mr. Trump into a capstone of his career, defying Republican leaders to join the House committee investigating the Jan. 6 attack, laying into Mr. Trump and his defenders at every opportunity, and promising not to leave the political stage once his House career ends this year.",
    "The fate of the 10 over the past year has offered a bracing reality check about the nature of today's Republican Party, one that has fully embraced the lie of a stolen election and its main purveyor, and sidelined the few remaining members who have dared to publicly question Mr. Trump or his actions.",
    "Senate Republicans had an opportunity to banish Mr. Trump permanently from politics; if 17 of them had joined Democrats in voting to convict him at this impeachment trial, it would have yielded the two-thirds majority needed to remove him and paved the way for a separate vote to bar him from office.",
    "But he has tempered such statements with criticism of Democrats, saying, authoritarian populism is alive and well in both parties.?\nThe system is not providing the recourse that we need,? Mr. Meijer said, tying together Jan. 6 and racial justice protests in 2020 that sometimes turned violent.",
    "But his nomination stalled after CNN uncovered tweets that he posted promoting the conspiracy theory that John Podesta, Hillary Clinton's 2016 presidential campaign chairman, took part in a satanic ritual and defending the antisemitic Twitter account of the alt-right figure Ricky Vaughn.",
    "Ms. Cheney has soldiered on, becoming the vice chairwoman of the House select committee investigating the riot, the face of Republican resistance to Trumpism and a one-woman wrecking crew for Mr. McCarthy's ambitions to become speaker next year if the party retakes control of the House.",
    "WASHINGTON  The 10 House Republicans who voted to impeach Donald J. Trump did so with the same conviction  that a president of their party deserved to be charged with inciting insurrection on Jan. 6, 2021  and the same hope  that his role in doing so would finally persuade the G.O.P.",
    "The daughter of a former vice president who was once the embodiment of confrontational conservatism, for better or worse, Ms. Cheney started 2021 as the chairwoman of the House Republican Conference, a political knife fighter believed by many to be destined for the speakership.",
    "I was simply not willing to look the other way and accept what he did.?\nMr. McCarthy, by contrast, visited Mr. Trump at his Mar-a-Lago club in Palm Beach, Fla, near the end of January, making it pretty clear the path that he had chosen,? Ms. Cheney added.",
    "Looking back, Ms. Cheney said in an interview that her fall from Republican leadership was inevitable as long as she had to share the stage with Mr. McCarthy, whose brief denunciation of Mr. Trump after Jan. 6 quickly gave way to a resumption of fealty.",
    "They lied to the American people and continue to push the big lie and echo the conspiracy theories that line their pockets, keeping them in power.?\nMr. Upton has never been one for flash, yet his future is no more secure, despite 35 years in the House.",
    "Four others  John Katko of New York, Dan Newhouse of Washington, Tom Rice of South Carolina and David Valadao of California  have gone to ground, silent if not silenced, in the apparent hope that the entire episode will be forgotten.",
    "She was ousted from her leadership post, ejected from the Wyoming Republican Party and targeted repeatedly by the former president, who has tried to unite Wyoming voters around the primary opponent he has endorsed, Harriet Hageman.",
    "And right now, there are far too many Republicans who are trying to enable the former president, embrace the former president, look the other way and hope that the former president goes away.?\nFor now, he is very much present.",
    "I am ever the optimist when it comes to the greatness of our country, and I want to continue to have that level of optimism, that when we get too close to the brink, we have the ability to pull ourselves back,? she said.",
    "He could face Steve Carra, a state representative endorsed by Mr. Trump, who would have to move homes to mount a primary challenge against Mr. Upton because of new congressional maps drafted by a bipartisan commission.",
    "Since they cast their impeachment votes on Jan. 13, Representatives Anthony Gonzalez of Ohio and Adam Kinzinger of Illinois have announced their retirements amid death threats from voters and hostility from colleagues.",
    "There's been this waiting game and an arbitrage between an individual's political future and the trajectory of that guy, assuming the apex has passed,? Mr. Meijer said in a lengthy interview, referring to Mr. Trump.",
    "I've never seen anything like this before.?\nNone of the 10 have fallen so far in the Republican firmament as Ms. Cheney, nor risen so high in the esteem of many in both parties who fear and loathe Mr. Trump.",
    "In September, he endorsed a square-jawed, Army Special Forces veteran, Joe Kent, to challenge Ms. Herrera Beutler, who before her vote had revealed one of the most damning vignettes of Jan. 6 for Mr. Trump.",
    "But in the year since the deadliest attack on the Capitol in centuries, none of the 10 lawmakers have been able to avoid the consequences of a fundamental miscalculation about the direction of their party.",
    "Despite the threat, Mr. Meijer  a political neophyte who cast what may prove to be the most consequential vote of his career days after he was sworn in  says he has no regrets about his vote to impeach.",
    "Mr. Trump's chief of staff, who initially provided the panel with a trove of documents that showed the extent of his role in the efforts to overturn the election, is now refusing to cooperate.",
    "Representatives Jaime Herrera Beutler of Washington, Peter Meijer of Michigan and Fred Upton of Michigan have Trump-endorsed primary challengers on their heels and uncertain political futures.",
    "But she has since embraced him, calling Mr. Trump the greatest president of her lifetime and claiming that there are legitimate questions? about the outcome of the 2020 election.",
    "It was one that was not faithful to the Constitution.?\nNever one to let bygones be bygones, Mr. Trump has relentlessly pursued retribution against those who voted to impeach him.",
    "Her vote to impeach, and her outspoken denunciations of the lie  pushed by Mr. Trump and embraced by many of her colleagues  that the 2020 election was stolen,? cost her dearly.",
    "I'm 100 percent running for Congress, it's an honor to have President Trump's endorsement, and Fred Upton will not be a congressman in 2023,? Mr. Carra said in a text message.",
    "Ms. Hageman, the candidate whom Mr. Trump endorsed to unseat Ms. Cheney, is more of a political insider: She was part of the Republican resistance to his ascent in 2016.",
    "Mr. Trump had responded, Well, Kevin, I guess these people are more upset about the election than you are.?\nKey Figures in the Jan. 6 Inquiry\nCard 1 of 10\nMark Meadows.",
    "The 2020 election was not stolen,? Mr. Kinzinger said in a lengthy video message on Wednesday for the anniversary of Jan. 6. Joe Biden won, and Donald Trump lost.",
    "One of them, Senator Lisa Murkowski of Alaska, lamented that in her party's haste to get this behind us,? Republicans lost the opportunity to do just that.",
    "Mr. Kent has heartily embraced the lie that Mr. Trump won the 2020 election and has said that the former president bears no responsibility for the attack.",
    "The former president is very much the leader of the Republicans, and it is those who stood against him whom the party has thrust into the role of pariah.",
    "That's one of the reasons that I'm signing up to run again  because I feel it's important to be one of those voices that hopefully can pull us back.?",
    "But he found little support from the party that recruited him into politics once Mr. Trump endorsed a primary challenger and the threats began.",
    "It was increasingly clear that staying as conference chair was going to require me to perpetuate the lie about the election,? Ms. Cheney said.",
    "Like so many of her House Republican counterparts, Ms. Murkowski is facing a primary challenge this year from a Trump-endorsed candidate.",
    "Representative Liz Cheney of Wyoming has gone from a star in the House Republican leadership to an exiled party gadfly and truth teller.",
    "She recounted a phone call in which Mr. McCarthy had personally pleaded with the president to call off the rioters during the assault.",
    "The new map pushed Mr. Upton into the same district as Bill Huizenga, a more conservative congressman who voted against impeachment.",
    "John Gibbs, Mr. Trump's choice to unseat Mr. Meijer, was the former president's pick to lead the Office of Personnel Management.",
    "In the immediate aftermath of the Capitol riot, some of Mr. Trump's most stalwart allies quit the government in disgust.",
    "The view among some was that this would be essentially a self-correcting issue,? and that Mr. Trump's power would fade.",
    "The system itself has been delegitimized.?\nMs. Cheney, by contrast, laid the responsibility with Republicans alone.",
    "Based on demonstrated public behavior, of course Jan. 6 was a step toward authoritarianism,? Mr. Meijer said.",
    "The tone gets, you know, tougher and tougher, and it's a pretty toxic place,? he said last month on CNN.",
    "We can either be loyal to Donald Trump, or we can be loyal to the Constitution, but we cannot be both.",
    "The 10 could be forgiven for believing that their votes last January would not leave them so exposed.",
    "He has spoken frankly about the sinister forces in his party that gave rise to the Capitol riot.",
    "Even if Mr. Upton does not have to face Mr. Carra, his impeachment vote has placed him at risk.",
    "Mr. Kinzinger, who announced his retirement in October, has faced similar threats.",
    "The House voted to recommend holding Mr. Meadows in criminal contempt of Congress.",
    "That's the through line between the riots of last summer, Jan. 6 and now.",
    "Under the circumstances, Mr. Upton is showing clear signs of fatigue.",
    "I think that's proven overly optimistic,? Mr. Meijer added.",
    "You've got metal detectors now going on the House floor.",
    "But the leadership of the Republican Party won't.",
    "But only seven Republicans voted to convict.",
    "We get really nasty threats at home.",
    "Our party has to choose,? she said.",
    "We have to admit it.",
    "to repudiate him."
  ]
}