{
  "id": 2293,
  "mediaId": 43,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Video Of A Rightfully Pissed Off Sen. Elizabeth Warren (D. MA) Hits 4.2 Million Views",
  "image": "https://images.dailykos.com/images/1065647/story_image/2022_0503-elizabeth-warren-scotus-1200x800.jpeg?1651620868",
  "link": "https://www.dailykos.com/story/2022/5/3/2095652/-Video-Of-A-Rightfully-Pissed-Off-Sen-Elizabeth-Warren-D-MA-Hits-4-2-Million-Views",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    704,
    741,
    802,
    1341,
    1568,
    2039,
    2058,
    2505,
    141,
    482,
    545,
    571,
    2550,
    2945
  ],
  "sentences": [
    "Click below to donate and get involved with these Democratic Senate candidates and incumbents campaigns:\nArizona\nMark Kelly\nGeorgia\nRaphael Warnock\nNevada\nCatherine Cortez Masto\nNew Hampshire\nMaggie Hassan\nPennsylvania:\nJohn Fetterman\nWisconsin:\nMandela Barnes\nTom Nelson\nAlex Lasry\nSarah Godlewski\nOhio:\nTim Ryan\nNorth Carolina:\nCheri Beasley\nFlorida:\nVal Demings\nMissouri:\nLucas Kunce",
    "Murkowski told reporters on Capitol Hill that if the direction of the draft becomes the final opinion, I will just tell you that it rocks my confidence in the court right now.?\nThe Congress, however, can do little to stop the court from undoing Roe v. Wade unless more Republicans join Democrats in voting to protect abortion access, which is almost certainly unlikely.",
    "I thought I was past the point of identifying with (or, to be honest, caring much about) what politicians had to say, but as it turns out, on this grim and frightening Tuesday, what I needed was to hear from an elected official willing to sacrifice her composure in order to underscore just how much is currently on the line for pregnant people in America.",
    "But this will certainly be a campaign issue for November:\nAmid fallout from a leaked draft Supreme Court opinion, Senate Majority Leader Chuck Schumer said the conservative justices lied? to the Senate during confirmation hearings when they assured senators the case that since 1973 has allowed abortion access was settled law.",
    "More to add from Vogue's Emma Spencer:\nWhat I really want to see is my rage and sorrow reflected and magnified by the people I've elected to represent me in office, and that's exactly what I got on Tuesday, when Massachusetts Sen. Elizabeth Warren addressed a crowd of pro-choice protestors outside of the Supreme Court.",
    "They have been out there plotting, carefully cultivating these Supreme Court justices so they could have a majority on the bench who would accomplish something that the majority of Americans do not want.?\nAs of today, that video has 4.2 million views and we certainly need to make sure that everyone sees that video.",
    "And two Republican senators who publicly support abortion access, Lisa Murkowski of Alaska and Susan Collins of Maine, but have voted to confirm conservative justices vented their frustrations at the court's draft document and pushed their own bill to turn the Roe v. Wade ruling into law.",
    "Protections in the Senate safeguarding against the erosion of women's access to health care have been used half-a-dozen times in the past 10 years, and are more important now than ever.?\nA woman's health care choices should be between her, her family, and her doctor.",
    "Senator Kyrsten Sinema (D. AZ):\nSinema: While Sinema is supportive of abortion rights, her spokesperson said her views on preserving the filibuster are unchanged and pointed to seven Senate votes where a 60-vote threshold ultimately protected abortion rights.",
    "pic.twitter.com/5lE8rCQz5U\n Elizabeth Warren (@SenWarren) May 3, 2022\nWarren said her anger was driven by concern for the poor women in Republican-controlled states who lack the resources to travel to Democratic states that maintain legal abortion rights.",
    "This will fall on mothers who are already struggling to work three jobs, to be able to support their children they have.?\nWarren, who ran for president in 2020, argued that Congress should pass a federal law protecting abortion rights.",
    "Schumer said the Senate would vote next week on emerging legislation, but facing a certain filibuster by Republicans, the Democrats signaled they prefer to fight over the issue on the campaign trail this fall, rather than in Congress.",
    "the first e-ail I received is from the Progressive Change Campaign Committee:\nFox reports that in the House, \"Every Democrat except Rep. Henry Cuellar\" voted for the Women's Health Protection Act that would enshrine Roe nationally.",
    "pic.twitter.com/Kt3bP0kzqU\n President Biden (@POTUS) May 3, 2022\nx\nhttps://t.co/4o8cpkjE06\n Max Burns (@themaxburns) May 3, 2022\nIt's also important to help make sure Warren has more colleague she can rely on in the U.S. Senate.",
    "I'm going to keep fighting in every way I can to defend abortion rights  including ending the filibuster so we can codify Roe into federal law, and expanding the Supreme Court so we can stop them from ripping our rights away.",
    "Manchin declined several times on Tuesday to address a leaked Supreme Court draft opinion, written by Justice Samuel Alito, that would overturn Roe v. Wade, the landmark case that guarantees a right to the procedure.",
    "By making sure abortion funds have the reources they need, we can support those who are hit the hardest by abortion bans  low-income people and people of color who don't have the means to travel across state lines.",
    "Senator Joe Manchin (D. WV):\nSen. Joe Manchin (D-W.Va.) defended the filibuster on Tuesday as some members of the Senate Democratic Caucus called for nixing the 60-vote hurdle in order to codify abortion rights.",
    "Meanwhile, conservative Democrat Rep. Kurt Schrader, the \"Joe Manchin of the House,\" called the Hyde Amendment that bars the use of federal funds to pay for abortion a good balance\" for a \"diversity of views.\"",
    "They have been out there plotting [and] carefully cultivating these Supreme Court justices so they could have a majority on the bench who would accomplish something that the majority of Americans do not want.",
    "\"We've heard enough from the extremists, and we're tired,? Warren continued, as anti-choice protestors attempted to drown out her words in a sadly apt metaphor for the state of abortion discourse as a whole.",
    "In just 2 weeks, bold progressive Jamie McLeod-Skinner has a chance to unseat Schrader in Oregon's Democratic primary -- and a week later Jessica Cisneros goes up against Cuellar in a tight runoff in Texas.",
    "But asked about getting rid of the filibuster, Manchin defended it, saying that the filibuster is the only protection we have in democracy.?\nWe've protected women's rights with the filibuster,? he added.",
    "ABC News reports that \"Schrader opposed a $15 minimum wage and a proposal to contain prescription drug prices, and he initially voted against last year's $1.9 trillion COVID relief bill.\"",
    "Wealthy women can get on an airplane, they can fly to another state, they can fly to another country, they can get the protection they need,? she told the rally before the court building.",
    "RSVP here and get your ticket for a virtual fundraiser for Jessica Cisneros hosted by the PCCC, Senator Elizabeth Warren, and End Citizens United on Zoom -- TODAY, May 3, at 7pm Eastern.",
    "Click here to split a contribution between abortion funds in states with trigger laws that will immediately ban abortion  100% of your donation will support these grassroots groups.",
    "That effort faces an uphill battle, as Republicans would be sure to filibuster the measure in the Senate, and moderate Democrats in the chamber are unlikely to buck the filibuster.",
    "With a 50-50 Senate and two traitors that refuse to budge no matter what, it's time to make both of them irrelevant and clean expand our Majority in the Senate and save the House.",
    "When a reporter asked her Tuesday how she's feeling about the leaked U.S. Supreme Court draft opinion to overturn Roe v. Wade, the typically reserved legislator didn't hold back.",
    "FYI:\nx\nThe draft opinion calls into question the fundamental right to privacy  the right to make personal choices about marriage, whether to have children, and how to raise them.",
    "Here's the other e-mail I received from Warren today:\nLast night's news  that an extremist Supreme Court majority has drafted an opinion overruling Roe v. Wade  was devastating.",
    "She also had this to add:\nx\nI am angry because an extremist Supreme Court thinks they can impose their extremist views on all of the women of this country and they are wrong.",
    "And a past president of the National Organization for Women warns \"A vote for Kurt Schrader is a vote against women's ability to realistically make their own life choices.\"",
    "The United States Congress can keep Roe v. Wade the law of the land  they just need to do it,? Warren said, also endorsing expanding the number of Supreme Court justices.",
    "\"The Supreme Court is poised to inflict the greatest restriction of rights in the past 50 years  not just on women, but on all Americans,? Schumer said.",
    "When a reporter remarked that they had never seen the senator so upset, she responded: The Republicans have been working toward this day for decades.",
    "Please pitch in $15 if you can today to support abortion funds in states that have trigger laws that will ban abortions if Roe v. Wade is overturned.",
    "Sen. Elizabeth Warren (D. MA)\nIn case you needed to see this:\nx\nA visibly shaken and angry Senator Elizabeth Warren just spoke in-front of #SCOTUS.",
    "Angry and upset and determined.?\nThe United States Congress can keep Roe v. Wade the law of the land  they just need to do it,? she continued.",
    "Then, RSVP here to meet Jamie on Zoom at the PCCC's Meet the Candidates event and ask her your questions this Thursday, May 5, at 7pm Eastern.",
    "Then, RSVP here to meet Jamie on Zoom at PCCC's Meet the Candidates event and ask her your questions on Thursday, May 5, at 7pm Eastern.",
    "First, let's be clear: This is only a draft opinion until the Supreme Court releases its final ruling, expected sometime this summer.",
    "RSVP here for the online fundraiser for Jessica hosted by the PCCC, Senator Warren, and End Citizens United TODAY at 7pm Eastern!",
    "If someone has an appointment to get an abortion right now, they can still keep that appointment and legally get an abortion.",
    "It's also important that you contact your Senator and let them know you support ending the filibuster to codify Roe v Wade.",
    "#TX28\"\nAnd Jamie tweeted today: \"In Congress, I will fight to make sure abortion rights are codified into federal law.\"",
    "Can you make a $15 donation to support local abortion funds that are still connecting patients to abortion care today?",
    "@TheNationalNews pic.twitter.com/KzQ2Z0Lg3b\n Willy Lowry (@willy_lowry) May 3, 2022\nSen. Elizabeth Warren (D-Mass.)",
    "Moments ago, Jessica Cisneros said on Twitter, \"I'll always stand for our health care and the right to choose.",
    "Overturning Roe v. Wade endangers the health and wellbeing of women in Arizona and across America,? she said.",
    "Red states and blue states, old people and young peoplewant Roe v. Wade to maintain as the law of the land.",
    "The United States can make Roe v. Wade the law of the land, they just need to do it,? declared Warren.",
    " President Biden (@POTUS) May 3, 2022\nx\nMy statement on the reported Supreme Court decision draft.",
    "-- The PCCC Team (@BoldProgressive)\nClick here to donate to Jessica Cisneros' runoff campaign.",
    "Now of course the two traitors in the U.S. Senate aren't going to get rid of the filibuster.",
    "Second, we've got to support people and organizations on the front lines of this fight.",
    "The event will include a Q&A so you can ask Jessica and Senator Warren your questions.",
    "This will fall on the young women who have been abused, who are victims of incest.",
    "Abortion funds help make sure that the right to an abortion is a reality for all.",
    "These are fundamental rights for Americans  a critical part of who we are.",
    "And his campaign is being propped up by none other than Joe Manchin's PAC.",
    "He even likened the Trump impeachment trial for Jan 6 to a \"lynching.\"",
    "In these painful times, it's sometimes hard to know what we can do.",
    "- Elizabeth\nClick here to donate to these grassroots organizations.",
    "In 21 days, Cuellar and I will face off in the Democratic runoff.",
    "But the most vulnerable had their freedom constricted the most.",
    "The Republicans have been working toward this day for decades.",
    "Let's defeat the last anti-choice Democrat in the US House.",
    "Look: I've lived in an America where abortion was illegal.",
    "There's a couple of things that Warren is already doing.",
    "I am angry because of who will pay the price for this.",
    "69% of people across this countryacross this country!",
    "Cuellar also opposed the Democratic economic agenda.",
    "This will fall on the poorest women in our country.",
    "They need our support today, and into the future.",
    "I have seen the world where abortion is illegal.",
    "Click here to RSVP to meet Jamie McLeod-Skinner.",
    "This will fall on those who have been raped.",
    "Roe v. Wade is still the law of the land.",
    "Cuellar's issues are not limited to Roe.",
    "We need to do that, and we have a right.",
    "We're not going backnot now, not ever.",
    "Thanks for being a bold progressive.",
    "Chip in to Jessica's campaign here.",
    "Click here to contact your Senator.",
    "Wealthy women still got abortions.",
    "Chip in to Jamie's campaign here.",
    "Angry and upset and determined.",
    "He's under FBI investigation.",
    "It will not be wealthy women.",
    "The House is away this week.",
    "Can't make it on Thursday?",
    "But we are not powerless.",
    "And Schrader's no better.",
    "I am angry,? Warren said.",
    "We can still fight back.",
    "But one thing is easy.",
    "Can't make it today?",
    "is mad as hell.",
    "He's horrible.",
    "And we must.",
    "I am angry.",
    "And U.S.",
    "U.S."
  ]
}