{
  "id": 2394,
  "mediaId": 367,
  "date": "1/31/2022 12:00:00 AM",
  "headline": "Democratic U.S. Senate candidate Alex Lasry pours in $1.55 million more into race, while Sarah Godlewski adds $750,000",
  "image": "https://www.gannett-cdn.com/presto/2021/07/30/PMJS/1f772750-7d6a-4cf5-ac41-874600ef627f-lasry_godlewski_barnes.jpg?crop=660,371,x0,y2&width=660&height=371&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/politics/elections/2022/01/31/democrats-alex-lasry-sarah-godlewski-pour-big-money-into-senate-race/9288027002/",
  "sentiment": "0.0",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "https://www.jsonline.com/staff/2646086001/bill-glauber/",
  "termIds": [
    741,
    802,
    1568,
    1925,
    2039,
    2468,
    146,
    571
  ],
  "sentences": [
    "Lasry, on leave from his executive job with the Milwaukee Bucks, poured in another $1.55 million into the race during the final three months of 2021, while Godlewski added another $750,000, their campaigns said Monday.",
    "With Republican U.S. Sen. Ron Johnson entering the race for a third term, Democrats in a crowded primary field are increasingly eager to show they have the fundraising muscle for the lengthy and expensive campaign.",
    "Godlewski's campaign said: \"Ron Johnson and the Republican political machine will unleash an avalanche of right-wing special-interest cash to smear Democrats and spread lies to the people of Wisconsin.",
    "Mandela Barnes' campaign previously reported raising $1.23 million in the quarter and has raised $2.3 million since the candidate entered the race, with much of it coming from small-dollar donors.",
    "We have received contributions from every corner of Wisconsin, raised more money than any other campaign in the Democratic primary, and I have invested in my campaign as well.\"",
    "During last year's fourth quarter the Lasry campaign raised $473,000 and has now taken in $2.8 million, the highest total among the Democratic front-runners.",
    "With the contributions  and the Lasry cash  the campaign had total receipts of $5.1 million last year and ended December with $1.12 million cash on hand.",
    "Besides Godlewski's big check, her campaign raised around $360,000 more from donations last quarter and ended December with $1.3 million cash on hand.",
    "Democrats Alex Lasry and Sarah Godlewski aren't completely self-funding their campaigns for U.S. Senate, but they're each throwing in a lot of cash.",
    "Overall, Lasry has loaned $2.35 million to his campaign since entering the race while Godlewski, the state treasurer, has put in $1.795 million.",
    "Stephen Olikara raised $110,000 during the last three months of 2021 and had $108,000 cash on hand, according to his public filing.",
    "I've said from the beginning that this campaign will have the resources necessary to beat Ron Johnson,? Lasry said in a statement.",
    "Outagamie County Executive Tom Nelson reported raising $215,522 in the fourth quarter and finished with $484,372 cash on hand.",
    "Sarah knows we can't be outgunned in this election, and she's making sure her campaign has the resources needed to win.\"",
    "The campaign had nearly $1.1 million cash on hand at the end of December, according to a federal filing.",
    "Johnson reported raising $711,000 during the fourth quarter and ended with $2.4 million cash on hand.",
    "Since January of 2017 Johnson has raised more than $5 million, according to campaign filings.",
    "The big bucks from multimillionaires Lasry and Godlewski didn't come as a huge surprise.",
    "Over the past year, we have built a statewide team to do just that.",
    "Overall, Nelson has raised $1.15 million since entering the race.",
    "The Lasry campaign also went up with significant TV ad buys.",
    "The primary is Aug. 9 with the general election Nov. 8.",
    "They have both promised to \"invest\" in their races.",
    "Among the other Democrats, Lt. Gov."
  ]
}