{
  "id": 2400,
  "mediaId": 1390,
  "date": "1/24/2022 12:00:00 AM",
  "headline": "Dem Senate candidates campaign on higher federal spending, despite inflation fears",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/ab713b70-6632-4998-89dd-1180a3fd2d97/f1d9ca8b-65bd-4944-b0fe-7e6bba151e80/1280x720/match/image.jpg",
  "link": "https://www.foxbusiness.com/politics/dem-senate-candidates-federal-spending",
  "sentiment": "0.0",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Houston Keene",
  "authorUrl": "https://www.foxbusiness.com/person/k/houston-keene",
  "termIds": [
    741,
    781,
    815,
    1136,
    1925,
    2039,
    2087,
    146,
    571
  ],
  "sentences": [
    "\"As I've done throughout my career, I'll fight to bring common-sense solutions to the United States Senate like a Medicare-for-all plan that helps us realize the dream of health care for every American, a Green New Deal that benefits the people of Wisconsin and creates good jobs right here at home, and ensuring rich corporations and ultra-millionaires finally pay their fair share in taxes, so we can provide tax relief to Wisconsin families who have borne the brunt of the tax burden from Washington for far too long,\" Barnes said in August of last year.",
    "Additionally, Democratic Senate candidate and Milwaukee Bucks senior vice president Alex Lasry  son of billionaire hedge fund manager and Bucks owner Marc Lasry  said he supports \"Medicare for all who want it\" and more federal spending to \"increase the United States contribution to the Green Climate Fund, invest in additional research and development, and share technology and technical assistance with countries across the world.\"",
    "Among them is Rep. Tim Ryan  a 2020 Democratic presidential primary candidate  who has boasted about his push to \"pass a robust infrastructure plan that will put thousands of Ohioans to work modernizing our grid\" while \"going big on clean energy, and preparing for the challenges of the 21st century, all while using American-made materials.\"",
    "Additionally, state Rep. Malcolm Kenyatta  another prominent Pennsylvania progressive running for the vacating seat  applauded the introduction of the Green New Deal in 2019 and supports \"shifting our resources to fund a just transition and investments in green energy technology\" as well as \"Medicare-for-all.\"",
    "Ryan also supports \"expanding Medicare by lowering the eligibility age to 60, and allowing people to buy into the program at 50, along with creating a public option that will increase competition and bring down costs,\" and \"allowing Medicare to negotiate prescription drug prices.\"",
    "\"That means taking bold action  like lowering the cost of prescription drugs; combatting climate change by creating well-paying, clean union jobs; providing tax relief for the middle class; and funding universal pre-K across the country,\" Kenyatta continued.",
    "Lasry made news after returning a $10,000 campaign donation he received from Golden State Warriors part-owner Chamath Palihapitiya after the Democrat megadonor's comments dismissing the ongoing state-sponsored Uyghur Muslim genocide in China.",
    "RON JOHNSON REVEALS EXACTLY WHY HE BROKE HIS TWO-TERM PLEDGE\nWisconsin\nRepublican Sen. Ron Johnson broke his pledge to limit himself to two terms in the Senate earlier this month, plunging into an electoral field full of hungry Democrats.",
    "Progressive Lieutenant Governor John Fetterman is one of the leading Democratic candidates in the race and supports increased government spending, including both Medicare-for-all and parts of the Green New Deal.",
    "Lieutenant Governor Mandela Barnes, one of the top Democrat contenders, has boasted his \"progressive credibility\" in the Democratic primary, being a vocal supporter of the Green New Deal and Medicare-for-all.",
    "Amid the rising gas and food prices, though, several Democratic candidates for Senate in 2022 swing states are advocating for more federal spending, particularly on environmental and health care issues.",
    "Inflation has been on the rise due to the supply chain crisis facing America due to the COVID-19 pandemic and President Biden's economic policies, which have included billions in federal spending.",
    "Warnock has called for the expansion of Medicare \"including through a public option and early Medicare buy-in\" and is running on a platform to \"invest in infrastructure\" to combat climate change.",
    "The Georgia Democrat is facing a robust Republican primary field looking to unseat him, a field that includes former Georgia Bulldog and National Football League (NFL) star Herschel Walker.",
    "GET FOX BUSINESS ON THE GO BY CLICKING HERE\nRunning on more federal spending may turn off more conservative and moderate voters in the states that are becoming more purple by the day.",
    "Georgia\nThe trend continues in Georgia, where incumbent Democrat Sen. Raphael Warnock looks to defend his seat in a race that has quickly become less safe for the senator.",
    "Johnson said his decision to renege on his self-imposed term limit is because he believes the Democrats' \"complete takeover of government\" has put America in \"peril.\"",
    "Rob Portman is another GOP senator retiring at the end of this year, bringing in a whirlpool of Democrats with dollar signs in their eyes looking to pick up the seat.",
    "Atlanta, Georgia has also been one of the hardest-hit cities by inflation, with food and gas prices rising through the roof as the value of the dollar goes lower.",
    "Kenyatta told FOX Business in a Monday statement that he is \"running for Senate so that we can finally have a government that works for working people.\"",
    "Rising inflation and higher prices are the top areas of concern among Americans, with a new poll showing 85% of Americans place it as their top issue.",
    "\"Right now, the only thing standing in our way is an obstructionist Senate that refuses to allow the federal government to help working families.\"",
    "Democratic candidates in key Senate races across the country are campaigning on even more federal spending, despite soaring inflation.",
    "Ambassador Carla Sands to celebrity physician Dr. Mehmet Oz and a plethora of Democrats compete to replace the outgoing senator.",
    "\"These are reforms and investments that are popular not just with Democrats, but also Republicans and Independents,\" he added.",
    "\"We can do all this and pay for it by making sure that corporations and super-rich finally pay their fair share in taxes.\"",
    "Pennsylvania\nDemocratic candidates in the Keystone State are also running on platforms pushing more government spending.",
    "The Cheese State's selection of Democratic Senate candidates has several who are doubling down on government spending.",
    "Republican Senator Pat Toomey's retirement has ignited a primary frenzy as Republican candidates from former U.S.",
    "None of the Democrats' campaigns except for Kenyatta's responded to FOX Business' request for comment.",
    "Fox News' Jessica Chasmar contributed reporting.",
    "Ohio\nRepublican Sen."
  ]
}