{
  "id": 3963,
  "mediaId": 6571,
  "date": "2022-03-01",
  "headline": "Ohio Governor Signs Athletes' Religious Expression Bill",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/07/19/9fdd16f2-f5d8-4550-b089-d54455b30260/thumbnail/1200x630/9107393dcc2dc7726e0c38196f3b0314/GettyImages-1056577032.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/ohio-governor-signs-athletes-religious-expression-bill/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1688,
    2704,
    4916,
    5212,
    5356
  ],
  "sentences": [
    "COLUMBUS, Ohio (AP) — Schools and school sports regulators could no longer require advance waivers or otherwise restrict participants' religious apparel unless it causes a \"legitimate danger\" for fellow competitors, under a bill signed into law Monday by Gov.",
    "Bill sponsor Sen. Theresa Gavarone, a Bowling Green Republican, researched the legislation after learning of the experience of Noor Abukaram, a runner at Sylvania Northview in suburban Toledo who was disqualified over her hijab in 2019.",
    "At the time, Ohio High School Athletic Association rules banned most head coverings and caps unless competitors received religious exemption waivers in advance.",
    "Abukaram's coach acknowledged making a mistake by not obtaining a waiver but said he didn't think it was needed because it hadn't been an issue at prior races.",
    "OHSAA has since changed its rules to let referees approve use of religious head coverings if a coach asks before a competition, without a formal waiver.",
    "The measure was inspired by an Ohio teen disqualified from a cross-country race because she was wearing a hijab without a required waiver.",
    "Despite that change, Abukaram continued having problems with race officials, making the legislation necessary, according to Gavarone.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "(Copyright 2022 The Associated Press.",
    "All rights reserved.",
    "Mike DeWine."
  ]
}