{
  "id": 5397,
  "mediaId": 2537,
  "date": "2022-02-21",
  "headline": "Gov. DeWine signs Ohio law allowing students to wear hijab while competing in HS sports",
  "image": "https://www.gannett-cdn.com/presto/2022/02/09/NCOD/5af9acaa-2879-4dc3-bc11-dac6f022f503-ceb_hijab_bill_AGS_04.jpg?crop=6782,3815,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/2022/02/22/mike-dewine-sign-law-ohio-hs-athletes-can-compete-wearing-hijabs/6722312001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Jane Sanese",
  "authorUrl": "https://www.dispatch.com/staff/9156230002/mary-jane-sanese/",
  "termIds": [
    0
  ],
  "sentences": [
    "It feels really humiliating.”\nIn 2020 OHSAA changed the rule to permit athletes to compete while wearing a religious head covering unless the official deems it will fundamentally alter the sport or is dangerous for the participant, such as dangling jewelry.",
    "After confiding in her big sister, they both agreed their little sister would one day want to play sports just as they did, and speaking out would hopefully mean no other girls would have to experience what Abukaram did.",
    "Noor Alexandria Abukaram identifies as being both an athlete and a Muslim – two elements that clashed in a disappointing and humiliating manner at an Ohio high school cross country meet in 2019.",
    "\"The law that prohibits organizations from implementing discriminatory policies is so important because rule books are subject to change and law needs to protect athletes from that.\"",
    "At the time of her 2019 race, Ohio High School Athletic Association rules required student athletes wearing religious headgear to get permission prior to the event.",
    "She knew a rule change would not be enough, and if she did not share her story, other girls would fall victim to the same discrimination she had experienced.",
    "She started her own movement, hoping to bring support to others who had experienced what she has, and to advocate for religious freedoms in sports.",
    "The #LetNoorRun initiative took off, garnering national attention on social media and being covered in The New York Times and The Washington Post.",
    "So, when that tries to be taken away from me, especially for something like my hijab, which is something that I love and hold so dear to my heart.",
    "“This piece of legislation really brought the Christian, the Jewish, the Muslim community all together in support of this,\" Gavarone said.",
    "They met in a coffee shop for what they both described as an electric meeting which was the catalyst for real change in Ohio.",
    "She has been there every step of the way, from the drop off at the clerk's office to both Senate and House votes on the bill.",
    "Sen. Theresa Gavarone, R-Bowling Green, reached out to Abukaram and her family when she heard her story on the news.",
    "But Abukaram's coach didn't get permission and it hadn't been an issue all season until the regional qualifier meet.",
    "Abukaram, then 16, had just run the best 5K of her life, finishing the course in 22 minutes and 22 seconds.",
    "\"Let's open some doors so that she can walk through a little bit easier than me or my older sister had.\"",
    "“It was really just a beautiful thing.”\nAbukaram is a now a first year student at Ohio State University.",
    "She is determined to continue her work advocating for religious freedoms and fighting discrimination.",
    "Senate Bill 181, sponsored by Gavarone, passed both the Senate and the House unanimously.",
    "But an official at the meet disqualified Abukaram because she wore a hijab while running.",
    "Abukaram said during the last few years the rule book has been changed numerous times.",
    "The Ohio association worked with its national counterpart to rework the rule.",
    "A hijab is a traditional covering of the hair and neck worn by Muslim women.",
    "“I feel like as an athlete, I'm a person that competes,” Abukaram said.",
    "\"OHSAA clearly displayed how much this bill was needed,\" Abukaram said.",
    "Scripps School of Journalism Statehouse News Bureau program.",
    "\"Let's just like make the path easier for her,\" she said.",
    "Mary Jane Sanese is a fellow in Ohio University's E.W.",
    "Gov Mike DeWine signed the bill into law Monday.",
    "Abukaram thinks of this bill as her baby.",
    "Abukaram took the pain and ran with it.",
    "“And that's just a part of who I am.",
    "It symbolizes modesty and religion."
  ]
}