[
  {
    "id": 6468,
    "mediaId": 238,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "Roman and Brown, according to Thompsons letters, were aware of, and participated in, efforts to promote unsupported allegations of fraud? and encouraged state legislators to alter the outcome of the November 2020 election by, among other things, appointing alternate slates of electors to send competing electoral votes to the United States Congress.?\nAmong the state officials subpoenaed were a prominent legislator from Pennsylvania, state Sen. <span class='selected-term'>Douglas Mastriano</span> (R), who has long advocated an audit of the 2020 results and was praised by Trump for his efforts.",
    "author": "",
    "title": "Jan 6 panel issues six new subpoenas"
  },
  {
    "id": 6471,
    "mediaId": 1164,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "Pennsylvania State Sen. <span class='selected-term'>Douglas Mastriano</span> was subpoenaed as the committee said he was part of a plan to arrange for alternate electors from Pennsylvania and \"reportedly spoke with President Trump about post-election activities.\"",
    "author": "Daniel Uria",
    "title": "Jan. 6 committee issues subpoenas seeking information on alternate elector plots"
  },
  {
    "id": 6472,
    "mediaId": 178,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "The other four individuals are Pennsylvania State Sen. <span class='selected-term'>Douglas Mastriano</span>, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. Mark Finchem and Arizona Republican Party chair Kelli Ward.",
    "author": "FARNOUSH AMIRI",
    "title": "Jan. 6 panel subpoenas 6 more in fake GOP electors scheme"
  },
  {
    "id": 6457,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Some Democrats were alarmed that <span class='selected-term'>Douglas Mastriano</span>, who has repeatedly raised debunked claims of election fraud and was present at the Jan. 6 insurrection at the U.S. Capitol, won the Republican nomination for governor in Pennsylvania Tuesday.",
    "author": "Alexander Bolton",
    "title": "Klobuchar, Warren introduce bill to provide $20 billion for election administration"
  }
]