{
  "id": 10157,
  "mediaId": 2679,
  "date": "2022-03-31",
  "headline": "Arizona passes proof-of-citizenship law for voting in presidential elections",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/arizona-passes-proof-of-citizenship-law-for-voting-in-presidential-elections/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NICK CORASANITI",
  "authorUrl": "https://www.seattletimes.com/author/nick-corasaniti/",
  "termIds": [
    0
  ],
  "sentences": [
    "A bipartisan group of local election officials asked Ducey in a letter last week to veto the bill, criticizing its “unconstitutionality” and saying that it would put “county recorders and election officials in the untenable position of trying to comply with state law while at the same time clearly violating the federal National Voter Registration Act.”\nMost Read Nation & World Stories\nLocal election officials warned of another logistical headache: The law, as signed, would go into effect 90 days after the Legislature adjourns for the year, which could be as late as June.",
    "In testimony before the Arizona House’s Rules Committee last month, Jennifer Holder, a lawyer for the Legislature, told Speaker Rusty Bowers that the issue had “been squarely addressed by that Supreme Court case.”\nAdvertising\n Skip Ad\nLegal experts said the new law could be a vehicle to challenge the 2013 Supreme Court ruling, and could push the court to reexamine broader voting laws and regulations.",
    "“They’ve been planning on this election for a year and a half now,” Fontes said, “and for these curveballs to get thrown at election administrators at the last second to impact so many tens of thousands of voters across the entire state — there’s a lot of county recorders out there that are just going to be scrambling, and I feel for them.”\nThis story was originally published at nytimes.com.",
    "“They may go try and vote and they’ll find out they’re no longer registered and it’s too late to register, and they will in fact be disenfranchised for this election in November.”\nThe worries about tens of thousands of additional voters losing their registration are rooted in a 1996 state law that requires proof of citizenship to obtain a driver’s license.",
    "“Election administrators have been fighting misinformation and disinformation for years now, and they’ve been trying desperately to keep up with the shenanigans of the extreme political right,” said Adrian Fontes, former election administrator for Maricopa County and a Democratic candidate for secretary of state in Arizona.",
    "Doug Ducey of Arizona has signed legislation requiring voters to prove their citizenship in order to vote in a presidential election, swiftly drawing a legal challenge from voting rights activists who argued that it could keep tens of thousands of voters from casting a ballot.",
    "“And maybe part of this is thinking you’ve got a new Supreme Court now, and that Supreme Court may look at things differently.”\nCritics of the Arizona law say that its effect extends far beyond 31,500 voters and that it could cause many more people to be pushed off the rolls.",
    "The law is one of several new voting restrictions that the Republican-led Legislature in Arizona is working to pass this year, despite multiple investigations and a partisan election review that found no evidence of widespread fraud in the state in the 2020 election.",
    "There are now roughly 31,500 “federal-only” voters in the state, or people who are not eligible to vote in state elections because they have not provided documents that prove citizenship as required by Arizona law, according to the secretary of state’s office.",
    "The Arizona measure, passed into law Wednesday, also requires newly registered voters to provide proof of address, which could have a disproportionate effect on students, older voters who no longer drive, low-income voters and Native Americans.",
    "Sam Almy, a Democratic strategist, sought to estimate a partisan breakdown of who would be affected by the new law by comparing those who had not updated their voter registration in Arizona since 2004 with a Democratic voter file.",
    "“Nothing’s unconstitutional unless it’s an enumerated right, and that’s not what this law is.”\nBut lawyers for the Republican-controlled Legislature had previously suggested that the bill could flout federal law.",
    "Advertising\n Skip AdSkip AdSkip Ad\n“Election integrity means counting every lawful vote and prohibiting any attempt to illegally cast a vote,” Ducey said in a letter explaining his support for the legislation.",
    "“It certainly is attempting to undo the Arizona v. ITC decision,” said Jon Greenbaum, chief counsel for the Lawyers’ Committee for Civil Rights Under Law, referring to the 2013 Supreme Court decision.",
    "In 2013, the Supreme Court ruled that Arizona could require proof of citizenship in state elections but that it must accept the federal voter registration form for federal elections.",
    "But Arizona’s primary election is set for Aug. 2, which could mean that the primary would be held under the old laws and the general election would have to abide by the new law.",
    "As in other states, local election officials in Arizona have been strained by limited funding, threats to their safety and new, graver penalties for mistakes.",
    "Advertising\n Skip AdSkip AdSkip Ad\nGreenbaum said it was unclear whether the new law would immediately be applied retroactively to affected voters.",
    "Because of that law, the state could assume that anyone registering to vote with a driver’s license had already proved their citizenship status.",
    "The new law essentially contradicts the Supreme Court decision, forcing all voters to meet the state’s requirements for a presidential election.",
    "Arizona Republicans said that the law would shore up election security, although they did not point to any evidence of significant fraud.",
    "“Those people won’t get their ballot in the mail,” said Alex Gulotta, state director for All Voting Is Local, a voting rights group.",
    "It is the latest sign that the push by Republican lawmakers to tighten voting rules after the 2020 election has not abated.",
    "But 192,000 people in Arizona have pre-1996 driver’s licenses, according to the state’s Department of Transportation.",
    "According to Almy, 45% of potentially affected voters were Republicans, compared with 36% who were Democrats.",
    "GOP lawmakers in Mississippi, Idaho and other states have also proposed new identification requirements.",
    "“If somebody on the left wants to challenge it, have at it,” he said, according to The Arizona Republic.",
    "And legislators in Georgia and Florida have advanced a second round of major changes to election laws.",
    "Legal experts said the new rules might run afoul of federal law and recent Supreme Court decisions.",
    "He also said that it was unclear if any would be notified if their registration had become invalid.",
    "On Wednesday, Mi Familia Vota, a voting rights group, filed a federal lawsuit challenging the law.",
    "Those forms ask voters to attest that they are citizens but do not require documentation.",
    "Speaking to local reporters, he defended the constitutionality of the law.",
    "The decision set up a bifurcated system in Arizona.",
    "Nearly 90% of the voters were older than 50.",
    "Read it here.",
    "Gov."
  ]
}