{
  "id": 12008,
  "mediaId": 2658,
  "date": "2022-03-26",
  "headline": "Trump backers push election change that would make counting slower, costlier and less accurate",
  "image": "https://static.politico.com/93/5a/be30ced24669815d34d67cff8e60/210629-maricopa-county-audit-ap-773.jpg",
  "link": "https://www.politico.com/news/2022/03/26/trump-allies-elections-vote-counting-00020574",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He said that review was not a perfect analogy: He and many other election administrators were sharply critical of its haphazard processes and winks toward conspiracy theories — and that the review looked at only two races, as opposed to the dozens that are typically on a Maricopa ballot\n“At well over 2.6 million voters, if we got 80 percent turnout, you could expect a hand count to take something in the neighborhood of two to three months, at best,” he continued.",
    "Moving to hand counting in midsize jurisdictions like Nevada’s Nye County, let alone a megacounty like Maricopa County, Ariz., where more than 2 million people cast ballots in the 2020 election, would spike the cost of elections, drastically extend the amount of time it takes to get results and make final tallies potentially less accurate.",
    "For in-person votes, much of the state uses what’s called a direct-recording electronic voting machine: Voters input their choices into the machine, and the machine spits out a “voter verifiable paper audit trail” — a tape or printout on which the voter can check to make sure their choices were accurately recorded.",
    "“There’s not a serious person anywhere in or adjacent to election administration who will tell you that hand counting is better than machine counting.”\nFontes pointed to the GOP-led review of the 2020 election in Maricopa, where volunteers tried to tally ballots by hand and went months behind schedule.",
    "| Matt York, Pool/AP Photo\nBy Zach Montellaro\n 03/26/2022 07:01 AM EDT\nTrump supporters are pushing to prohibit machine counting of ballots in future elections around the country, which election officials say could make vote-counting slower, more expensive and — most importantly — less accurate.",
    "“Now they’re hitting other counties … everybody’s hopping on the bandwagon.”\nThe Nye County board passed a resolution urging Merlino to consider the hand counting of ballots after the county attorney told the board that it couldn’t demand the clerk switch to hand counting, she said.",
    "“When you talk to anybody who does any kind of repetitive work, especially counting under severe time constraints, computers are absolutely better when it comes to counting than are humans,” said Matthew Weil, the director of the elections project at the Bipartisan Policy Center.",
    "A bit more than 800 jurisdictions nationwide — covering 0.6 percent of registered voters — primarily count either in-person or mail ballots by hand, according to Warren Stewart, a data analyst at the Verified Voting Foundation, which advocates for election security measures.",
    "The sponsor of the Arizona bill — which would also almost entirely eliminate mail voting in the state — said he would consider amendments to allow for some machine counting after pushback during a committee hearing, the Arizona Republic reported.",
    "Election tabulation machinery typically goes through rigorous testing, including preelection logic and accuracy testing — in which test ballots with a known vote total are run through the machines to make sure they produce the expected result.",
    "What do you do, hand count three or four times until you hopefully come up with a consensus on the votes?”\nAbove all else, election experts say that hand-counting large numbers of ballots is simply less reliable than a machine count.",
    "The proposals stem from baseless conspiracy theories stoked by former President Donald Trump since the 2020 election, in which he and others contended that election machines around the country were hacked and votes were flipped.",
    "“We’re going to do our best to get rid of the voting machines in Nye County, and then we are going to go to other counties here in Nevada,” he told former Trump senior adviser Steve Bannon on Bannon’s streaming show last week.",
    "“I’m just very nervous as a voter — or a clerk — going to a hand count.”\nThe actions in Nye were encouraged by Jim Marchant, a former Republican state lawmaker who is running for Nevada secretary of state.",
    "And in Nevada, a deep-red county’s board of commissioners — spurred on by a Trump-aligned candidate to be the state’s top election officer — formally urged its election clerk to abandon machine counting.",
    "‘It would be an abject disaster’\nMore than 90 percent of registered voters live in jurisdictions where in-person voters use a paper ballot of some form, but hand counting of ballots is extremely rare.",
    "Marchant is part of a national coalition of pro-Trump candidates running for election offices on a platform including false assertions that the 2020 election was stolen from the former president.",
    "States around the country are increasingly adopting post-election risk-limiting audits, in which a sample of actual ballots are examined by hand to ensure that the machine counts are accurate.",
    "Typically, election workers work in bipartisan pairs, and election offices would need significantly more workers to actually count the ballots than to oversee a machine tabulation process.",
    "While the vocal push among prominent election conspiracy theorists to move to hand counting has gotten louder, it remains to be seen where and whether it will actually be implemented.",
    "Marchant told Bannon that he wanted to get voting machines out of all the counties in Nevada, but said he didn’t expect Washoe and Clark — the two most populous counties — to do so.",
    "New Hampshire Public Radio reported that at least 10 towns had questions about hand-counting votes on the ballot during March elections, and the measures failed in all of them.",
    "Merlino said she told the board that it wouldn’t be feasible to consider ahead of the June primary, but she would discuss the practicality with the board for November.",
    "Nevada recently became a universal mail voting state — every active registered voter gets a ballot in the mail — and those votes are counted via machine tabulators.",
    "“It would be an abject disaster,” said Adrian Fontes, the former Maricopa County recorder now running in the Democratic primary for secretary of state in Arizona.",
    "“It would probably cost into the tens of millions of dollars.”\nHiring ballot counters would drive much of that cost increase, election officials say.",
    "And even if it were to pass the state Senate, it faces incredibly long odds in the state House, where the Republican speaker has set up roadblocks.",
    "Indeed, the Washoe County board voted 4-1 on Tuesday to reject a motion calling for hand counting ballots, among other procedural changes.",
    "Employees of Florida-based Cyber Ninjas conducted a controversial hand recount of 2020 presidential ballots in Maricopa County, Ariz.",
    "Legislators in at least six states this year have introduced proposals to prohibit the use of ballot tabulating machines.",
    "In Arizona, a bill that would require hand counts of ballots for all elections passed out of a legislative committee.",
    "A recent push in New Hampshire, where some small jurisdictions already count ballots by hand, fell flat as well.",
    "“Some of those states have specific requirements that you keep counting until you get to your final results.",
    "Many of those jurisdictions that hand count ballots have small numbers of voters — hundreds, not thousands.",
    "Local jurisdictions in Nevada, New Hampshire and elsewhere have also been considering similar measures.",
    "The recount fell months behind schedule because of the difficulties of making an accurate hand recount.",
    "“Imagine hand counting 31,000 ballots … I really have no idea how long it would take.",
    "Such an effort would also require more physical space for all the counting teams.",
    "“It’s kind of going like wildfire,” said Nye County, Nev., Clerk Sandra Merlino.",
    "I just imagine we would miss our deadline for canvassing our votes,” she said.",
    "“If you machine count, then you can do an audit,” said Merlino.",
    "Election officials say there is a very good reason for that.",
    "“But if you hand count, what do you check it against?",
    "The push has gained some traction in the last month.",
    "There are going to be all kinds of errors.”",
    "Now, the push is spreading across Nevada.",
    "But she said she had serious concerns."
  ]
}