{
  "id": 12646,
  "mediaId": 2662,
  "date": "2022-03-01",
  "headline": "Judge Denies Arizona Secretary of State Katie Hobbs’ Request To Block Arizona AG Brnovich From Potentially Prosecuting Election Law Violations",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/654E115F-2CEB-470C-80B2-14E9CBAC17F1.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/03/judge-denies-arizona-secretary-state-katie-hobbs-request-block-arizona-ag-brnovich-potentially-prosecuting-election-law-violations/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    3401,
    4267,
    4623,
    2765,
    1394,
    5949
  ],
  "sentences": [
    "pic.twitter.com/P873oM7MBU\n— Secretary Katie Hobbs (@SecretaryHobbs) February 25, 2022\nKatie Hobbs will seek to violate the law despite her warning from the Arizona Attorney General’s office:\na public officer upon whom a duty is imposed by Title 16, who knowingly fails or refuses to perform that duty in the manner prescribed by law or knowingly acts in violation of any provision of such law, is guilty of either a class 6 felony or class 3 misdemeanor.",
    "Last week, the court declared,\nInjunctions shall not be granted to “prevent enforcement of a public statute by officers of the law for the public benefit” or to “prevent the exercise of a public or private office in a lawful manner by the person in possession.”\n— Mark Finchem (@RealMarkFinchem) February 25, 2022\nHobbs responded to this ruling, admitting her plans to subvert elections laws and interpret them how she sees fit.",
    "In the complaint, Hobbs claims that Brnovich threatened her with “unprecedented criminal prosecution for performing her duties as Arizona’s Chief Elections Officer.”\nThe day before Donald Trump was scheduled to visit Arizona three weeks ago, @GeneralBrnovich threatened to charge me with a crime for simply doing my job.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nCrooked Katie Hobbs stole the 2020 election from President Trump, and she is doing everything in her power to do it again in 2022.",
    "The court declared,\n“But when public officials, in the middle of an election, change the law based on their own perceptions of what they think it should be, they undermine public confidence in our democratic system and destroy the integrity of the electoral process.",
    "The Gateway Pundit reported that Arizona Attorney General Mark Brnovich threatened to prosecute Hobbs if she violates election law and shuts down the secure internet portal for candidate petitions through the remainder of the filing period.",
    "On November 5th, 2020, The Arizona Supreme Court ruled that leftist Maricopa County Recorder Adrian Fontes also “acted unlawfully” by exceeding his constitutional authority and making up his own election instructions.",
    "Arizona law states,\nthe secretary of state shall provide a system for qualified electors to sign a nomination petition … for [candidates for statewide and legislative offices] by way of a secure internet portal.",
    "pic.twitter.com/ULWsZc8qRV\n— Secretary Katie Hobbs (@SecretaryHobbs) February 8, 2022\nMaricopa County Superior Court Judge Joan Sinclair denied her request for protection when breaking the law.",
    "Contact Arizona Attorney General Brnovich to demand indictments for the stolen 2020 election and potential 2022 law violations before Katie Hobbs can steal another election!",
    "The Gateway Pundit reported that Arizona Attorney General Brnovich rejected Hobbs’ 2021 Elections Procedures Manual draft because it made cheating easier.",
    "The Attorney General is required to enforce the provisions of Title 16 through civil and criminal actions in any election for members of the legislature.",
    "Last week, a judge denied radical Soros-funded Secretary of State Katie Hobbs’ request to protect her from prosecution for breaking the law.",
    "In a letter from the Attorney General’s office last month, Hobbs was notified of potential law violations and urged to correct them.",
    "TGP reported that the Arizona GOP is suing Katie Hobbs for failing to perform non-discretionary elections duties in 2020.",
    "Arizona will now operate under the 2019 Elections Procedures Manual, which they used to steal the last election!",
    "The lawsuit seeks to mandate her compliance with the Arizona Constitution and elections statutes in 2022.",
    "Secretary of State's Office responds to today's ruling on a request for a preliminary injunction.",
    "Hobbs responded with a lawsuit against the AG for declaratory and injunctive relief.",
    "This is exactly what Katie Hobbs did in 2020 and what she is trying to do in 2022.",
    "Now, I’m taking him to court.",
    "§§ 16-1009, -1010.",
    "§ 16-1021.",
    "A.R.S.",
    "A.R.S."
  ]
}