{
  "id": 12733,
  "mediaId": 2662,
  "date": "2022-02-28",
  "headline": "BREAKING: Arizona GOP Sues Secretary of State Katie Hobbs To Ban Unconstitutional Drop Boxes, And No-Excuse Mail-In Voting In Arizona",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/0B61E2F5-863E-4914-BBA9-83BC96DEF672.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/breaking-arizona-gop-sues-secretary-state-katie-hobbs-ban-unconstitutional-drop-boxes-no-excuse-mail-voting-arizona/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    4623,
    4267,
    2370,
    104,
    99,
    5949,
    6360
  ],
  "sentences": [
    "Absentee voting naturally lends itself to these and other abuses, which is why Arizona’s constitution is a product of the national movement to implement the “Australian ballot system,” a secure system quickly adopted by several states with little controversy and containing the following four essential provisions: (1) ballots printed and distributed at public expense; (2) ballots containing the names of all the candidates duly nominated by law (a “blanket ballot”); (3) ballots distributed “only by election officers at the polling place (‘exclusive’ or ‘official ballot’)”; and (4) detailed provisions for compartments and “other physical arrangements to ensure secrecy in casting the vote.” John C. Fortier & Norman J. Ornstein, The Absentee Ballot and the Secret Ballot: Challenges for Election Reform, 36 U. Mich. J. L. Reform 483, 488 (2003) (emphasis added).",
    "AZGOP v. Hobbs – APPLICATION FOR ISSUANCE OF WRIT UNDER EXERCISE OF ORIGINAL JURISDICTION by Jordan Conradson on Scribd\nThe lawsuit concludes,\nPetitioners request that this Court accept original and special action jurisdiction and grant them the relief they are requesting by: (1) ordering the Secretary to include the Signature Verification Guide in the current EPM or an addendum thereto and submit it to the Governor and Attorney General for their review and approval; (2) prohibiting the Secretary from authorizing drop-boxes in the 2022 general election and beyond; (3) either striking down no-excuse mail-in voting as unconstitutional or providing the alternative relief Petitioners request in Part C above.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe lawsuit states,\nIn July 2020, Arizona Secretary of State Katie Hobbs (“Secretary”) issued a Signature Verification Guide (“2020 Guide”) outlining procedures for verifying signatures on early ballot envelopes.",
    "When any initiative or referendum…shall be filed…with the secretary of state, he shall cause to be printed on the official ballot at the next regular general election the title and number of said measure, together with the words ‘yes’ and ‘no’ in such manner that the electors may express at the polls their approval or disapproval of the measure.",
    "On the other hand, exceeding her legal authority, the Secretary has prescribed rules in the EPM allowing county officials to “develop and implement procedures” for placing drop-boxes, including “unstaffed drop-box[es],” in various locations throughout the several counties.",
    "Accordingly, the Arizona Constitution prescribes that “Official Ballot[s]” are to be provided “at the next regular general election” in “such manner that the electors may express at the polls their approval or disapproval of [a] measure.” Ariz. Const.",
    "Importantly, Petitioners are not challenging Arizona election statutes that implement the Uniformed and Overseas Citizens Absentee Voting Act, because providing for absentee voting for soldiers is now expressly required by federal law.",
    "For when public officials “change the law based on their own perceptions of what they think it should be, they undermine public confidence in our democratic system and destroy the integrity of the electoral process.” Ariz. Pub.",
    "On November 5th, 2020, The Arizona Supreme Court ruled that leftist Maricopa County Recorder Adrian Fontes “acted unlawfully” by creating his own voter guidelines that were not authorized by the Elections Procedures Manual.",
    "Dinesh D’Souza’s upcoming documentary will expose the illegal ballot trafficking operations that occurred at drop boxes in Arizona and other key swing states where they stole the election from President Trump.",
    "Failure to include the procedures in the EPM also means the Secretary can modify them at will without the checks and balances that approval by the Governor and Attorney General provides.",
    "Moreover, the legislature may not delegate this authority to the Secretary, nor may the Secretary delegate a portion of this authority to county recorders, as the EPM purports to do.",
    "If adopted into the EPM and approved by the Governor and Attorney General, the procedures would have the force of law, and their violation would be punishable as a misdemeanor.",
    "Arizona Republicans are now pushing for decertification of the fraudulent 2020 election after investigations across the state discovered massive evidence of voter fraud.",
    "The full forensic audit of Maricopa County discovered numerous election law violations, including lack of signature verification and chain of custody documentation.",
    "The Arizona Constitution clearly states that voting must take place in person, at the polls, on a fixed date, and this was previously found by the court to be true.",
    "Stated simply, Arizona’s “early voting” statutes—which provide for “absentee” or “no-excuse mail-in” voting—violate the Arizona Constitution, in whole or in part.",
    "These recent abuses are possible because of a longstanding deviation from Arizona’s constitutional mandates regarding the time, place, and manner of elections.",
    "Thus, the Secretary’s signature verification procedures do not ensure that “the maximum degree of correctness, impartiality, uniformity and efficiency,” A.R.S.",
    "However, the Secretary has never added these procedures to the operative Elections Procedures Manual (“EPM”), or an addendum thereto, as required by A.R.S.",
    "The Arizona GOP has filed a lawsuit against radical leftist Arizona Secretary of State Katie Hobbs to protect Arizona’s elections from bad actors.",
    "Even if they were, the Secretary’s procedures purport to authorize counties to supplement her rules with their own See, e.g., 2020 Guide at 1.",
    "It will also require the Arizona Secretary of State to include signature verification guidelines in the Arizona Elections Procedures Manual.",
    "The lawsuit was filed in the Arizona Supreme Court on Friday seeking to ban unconstitutional drop boxes and no-excuse mail-in voting.",
    "All evidence was delivered to Arizona Attorney General Mark Brnovich, and Arizona awaits indictments and decertification.",
    "Neither the Secretary nor county recorders have statutory authority to implement “drop-box” voting under Arizona law.",
    "§ 16-452(B) to include the procedures in the EPM means county recorders are not required to follow them.",
    "The request also makes it clear that this move will not disenfranchise military and overseas voters.",
    "Contact Attorney General Brnovich and Arizona Legislators to encourage them to do the right thing.",
    "However, this provision still serves to illuminate the framers’ original intent in this regard.",
    "Arizona’s election officials must not continue to run Arizona elections however they see fit.",
    "§ 16-452(A), will be achieved among Arizona counties in the 2022 state general election.",
    "Democrats subverted election laws in 2020 and stole the election from President Trump.",
    "at (C);\nThe Secretary’s failure to execute her non-discretionary duty under A.R.S.",
    "Auditors identified over 700,000 ballot discrepancies during the audit.",
    "Integrity All., 250 Ariz. at 61.",
    "See EPM at 60–61.",
    "Official ballot.",
    "§ 20301 et seq.",
    "See 52 U.S.C.",
    "4, § 1(10).",
    "§ 16-452.",
    "art.",
    "Id."
  ]
}