{
  "id": 177,
  "mediaId": 2520,
  "date": "2022-02-22",
  "headline": "Mezcal in metro Phoenix: Here are some places to sample the Mexican spirit",
  "image": "https://www.gannett-cdn.com/presto/2021/05/28/PPHX/2f4ca8a3-33b4-4cb9-a05d-c8427d45afc0-cent02-7fzfzlhimj7mny07hle_original.jpg?crop=2999,1687,x0,y0?width=1200",
  "link": "https://www.azcentral.com/in-depth/news/local/arizona/2022/02/22/where-drink-buy-mezcal-metro-phoenix-arizona/9217904002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "And at 15 Salsas, a Mexican restaurant in the Sunnyslope section of Phoenix that features moles, tlayudas and other Oaxacan specialties, you can try budget-friendly cocktails made from Mezcal Carreño, imported by two Phoenix entrepreneurs, and other top-shelf artisanal mezcals mixed with authentic ingredients such as hibiscus flowers, known as \"jamaica\" in Spanish.",
    "602-812-2100. https://www.themexicano.com/\nFine-dining restaurant off Seventh Street that serves locally imported Ensamble 7, crowned best overall mezcal at the 2020 San Francisco World Spirits Competition, in a clay copita paired with sal de gusano and chapulines, fried grasshoppers that are a delicacy in Oaxaca.",
    "Here is a partial list:\nOaxaca-owned restaurant in Phoenix's Sunnyslope area, serving tlayuda, open-faced tortillas topped with mole or other ingredients that resemble pizzas, and other authentic Oaxacan dishes that also features a Mezcal bar stocked with high-end mezcals priced far below trendier spots.",
    "602-636-0240. https://www.barriocafe.com/\nA taco tour of Calle 16 in Phoenix: Street tacos, quesabirria and make-your-own platters\nLocated inside the historic San Carlos Hotel in downtown Phoenix, this modern Mexican restaurant specializes in hand-crafted mezcal and tequila cocktails.",
    "602-699-3015. https://www.chanticophx.com/\nThis family-owned Mexican restaurant on Grand Avenue serves coffee drinks, juices and smoothies in addition to some hip mezcal cocktails including The Antonio Banderas made with mezcal, spheres of hibiscus, lime juice, and cucumber bitters.",
    "602-612-4018. https://www.bacanoraphx.com/\nThis bar near Roosevelt Row off First Avenue features two levels, an upstairs cantina-style bar and a basement level room stocked with a huge selection of mezcals, tequilas and other agave spirits to sip neat, or in a craft cocktail.",
    "602-954-2507. https://renatashearth.com\nA basement speakeasy and intimate music hall in the heart of downtown Phoenix that offers cocktails in honor of Arizona luminaries and politicos including \"The (John) McCain\" and \"The Adrian Fontes,\" two drinks made with mezcal.",
    "602-730-3247. https://elcharrohipster.com/\nThis Latinx-owned restaurant on 16th Street developed by chef Leo Madrigal, the former corporate chef at Z-Tejas Grill, offers the entire lineup of locally imported Mezcal Carreño bottles, among other top shelf mezcals.",
    "602-237-0880. https://galloblancocafe.com/\nPart of the Genuine Concepts group of restaurants that includes The Vig and The Little Woody, this modern Mexican restaurant in the Sunnyslope area of Phoenix has a wall dedicated to bottles of mezcal and tequila.",
    "602-870-2056. https://las-15-salsas-restaurant-oaxaqueno.negocio.site/\nNamed after the agave spirit produced in Sonora, Arizona's neighbor to the south in Mexico, this Grand Avenue restaurant features cocktails made with bacanora, mezcal and tequila.",
    "480-398-8129. https://www.espiritumesa.com/\nThis East Valley restaurant and craft cocktail bar offers an opportunity to drinks made with sotol, a Mexican spirit made from a type of shrub, in contrast to mezcal and tequila made from agave.",
    "Chantico in north-central Phoenix is one of the many Mexican restaurants that have popped up in Arizona that feature an Old Fashioned, one of the most classic of American cocktails, made not with the traditional bourbon but with mezcal.",
    "https://exocoffee.com/\nRestaurant in downtown Tucson that offers traditional and modern Central American cuisine that is also a great place to sample mezcal, bacanora and other agave spirit cocktails featuring pre-Colombian ingredients.",
    "At Barcoa Agaveria, a new bar in downtown Phoenix that specializes in mezcal and other agave spirits, you can sip a glass of El Jolgorio Pechuga distilled with spices and fruits and, get this — a raw turkey breast.",
    "520-327-0452. http://westboundtucson.com/\nFounded by the creators of Mezcalistas, a website dedicated to mezcal, Mexico in a Bottle offers the opportunity to learn about and sample many types of mezcal.",
    "602-243-9000. https://www.cocinamadrigal.com/\nRestaurant featuring creative tacos offers 1-ounce pours of a variety of mezcals, so you can try several without breaking the bank.",
    "602-935-2932. https://www.persepshenarizona.com/\nModern Latin restaurant at the Arizona Biltmore in Phoenix offers mezcal cocktails and flights of mezcal as part of its lineup.",
    "602-606-2258. https://laderaphx.com/\nMore innovative tequila and mezcal cocktails at this newly opened Mexican restaurant on Cactus Road including the \"best f#*%ing margarita.\"",
    "480-550-6300. https://sotolmck.com/\nWith seven locations around the Valley, this local chain is known for its tequila drinks, but also features a number of mezcal cocktails.",
    "602-687-7777. https://www.crutacos.com/\nNeighborhood Mexican restaurant that serves tacos, tortas and great selection of mezcal in the Garfield neighborhood of Phoenix.",
    "520-203-7681. https://pencarestaurante.com/\nThe Old West saloon anchors the historic Monte Vista hotel in downtown Flagstaff and features an array of mezcal cocktails.",
    "https://barrioqueen.com/\nWith two locations in Old Town and Kierland Commons mall, this modern Latin restaurant features a long list of mezcals and tequilas.",
    "602-254-8226. https://www.centricophx.com/\nA restaurant that harnesses the vibe of Mexico City on Camelback Road is known for its large selection of mezcals.",
    "https://barcoaphx.com/\nThe restaurant that helped set the standard for authentic Mexican cuisine in Phoenix offers a great selection of mezcal and tequilas.",
    "The list of bars and restaurants to sample cocktails made with mezcal or to enjoy pours of high-end artisanal mezcal neat keeps growing.",
    "https://valleybarphx.com/\nMexican seafood restaurant that features an array of creative mezcal, tequila, bacanora and sotol cocktails.",
    "https://hotelcongress.com/family/century-room/\nThis Mezcal focused bar in Tucson offers mezcal tastings every Thursday night.",
    "480-636-5005. https://www.themissionaz.com/\nA new jazz club and mezcal lounge located at Hotel Congress in downtown Tucson.",
    "480-834-5050. https://downtownmesa.com/go/bad-habits\nCellars Fine Wine and Spirits: 10660 N. 32nd St., Phoenix.",
    "480-926-4478. https://www.facebook.com/gcm.liquor.3/\nGrand Canyon Spirits: 982 N. Fort Valley Road, Flagstaff.",
    "928-779-6423. https://grandcanyonspirits.com/\nMajestic Marketplace: 601 Piccadilly Drive #95, Flagstaff.",
    "A mezcal drink here is about half the price of some or the more trendy mezcal spots around the Valley.",
    "https://hotelmontevista.com/rendezvous/\nLiquor Stores\nBad Habits: 235 N. Country Club Drive, Mesa.",
    "520-326-0121. http://www.rumrunnertucson.com/\nTops Liquors: 403 W. University Drive, #104, Tempe.",
    "928-773-0313. https://majesticmarketplaceaz.com/\nPlaza Liquors and Fine Wines, Tucson.",
    "480-967-5643. http://www.topsliquors.com/\nWestbound: 2642 N. Campbell Ave., Tucson.",
    "For more information, visit the group's website at https://www.mezcalistas.com.",
    "(\"Pechuga\" means \"breast\" in Spanish) The 1.5 ounce pour will set you back $33.",
    "Reach the reporter at daniel.gonzalez@arizonarepublic.com or at 602-444-8312.",
    "It also has an agave room where classes on agave spirits are offered.",
    "https://www.plazatucson.com/\nRumrunner: 3131 E. First St., Tucson.",
    "The growing event makes its debut in Phoenix on Sept. 18, 2022.",
    "Details: 7122 E. Greenway Parkway, Suite 140, Scottsdale.",
    "Located on Camelback Road in the Arcadia area of Phoenix.",
    "Details: 7114 E. Stetson Drive, Suite 105, Scottsdale.",
    "Gilbert Convenient Mart: 118 N. Gilbert Road, Gilbert.",
    "Multiple other locations across metro Phoenix.",
    "Details: 100 N. San Francisco St., Flagstaff.",
    "Details: 1325 NW Grand Ave. Suite 4, Phoenix.",
    "Details: 1301 NW Grand Ave. Unit 1, Phoenix.",
    "Details: 50 E. Broadway Boulevard, Tucson.",
    "Details: 1051 E. Camelback Road, Phoenix.",
    "Details: 3961 E. Camelback Road, Phoenix.",
    "Details: 2400 E. Missouri Ave., Phoenix.",
    "Details: 8729 N. Central Ave., Phoenix.",
    "Details: 4700 N. Central Ave., Phoenix.",
    "Details: 4801 E. Cactus Road, Phoenix.",
    "Details: 130 N. Central Ave., Phoenix.",
    "Details: 313 N. Gilbert Road, Gilbert.",
    "Details: 202 N. Central Ave., Phoenix.",
    "Details: 722 W. Hatcher Road, Phoenix.",
    "Details: 311 E. Congress St., Tucson.",
    "Follow him on Twitter @azdangonzalez.",
    "Details: 829 N. First Ave., Phoenix.",
    "Details: 928 E. Pierce St., Phoenix.",
    "Details: 2814 N. 16th St., Phoenix.",
    "Details: 4044 S. 16th St., Phoenix.",
    "It's called a Oaxaca Old Fashioned.",
    "914 E. Camelback Road # 2, Phoenix.",
    "Details: 403 N. Sixth Ave., Tucson.",
    "3815 N. Brown Ave., Scottsdale.",
    "Details: 123 W. Main St., Mesa.",
    "480-656- 4197.",
    "480-292-7800.",
    "602-992-7010.",
    "602-265-9463."
  ]
}