{
  "id": 3219,
  "mediaId": 8396,
  "date": "2022-02-01",
  "headline": "Democratic Club Welcomes Adrian Fontes as February 2 Meeting Speaker",
  "image": "https://pebblecreekpost.com/wp-content/uploads/2021/01/cropped-favicon-PC512-1-32x32.png",
  "link": "https://pebblecreekpost.com/democratic-club-welcomes-adrian-fontes-as-february-2-meeting-speaker/",
  "mediaOutlet": "Pebble Creek Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Adrian’s work has been lauded for professionalizing the operation and implementation of a comprehensive plan in advance of Election Day: securing polling locations, recruiting and training poll workers, and educating voters on where, when, and how to vote.",
    "Adrian is a former Marine, an attorney who served as a prosecutor and with the Arizona attorney general’s office, the first Democratic Maricopa County recorder in 50 years, and first-ever Latino to hold an office in Arizona’s largest county.",
    "Among the social activities in January were the first Singles Group meeting on Jan. 8, a huge newcomers event on Jan. 16, the Ladies’ Luncheon at Bella Luna on Jan. 19, and The Hello Girls theatre event on Jan. 30.",
    "Adrian worked with political and community organizations across the political spectrum to increase registered voters by 500,000 people, making Maricopa County the second-largest voting jurisdiction in the country.",
    "The members brought more than 750 pounds of food to the meeting on Jan. 5 to contribute to Agua Fria, and we contributed more than 5,500 pounds of food, diapers, and paper goods to the food bank in 2021.",
    "The Saturday Morning Breakfasts (8 a.m. at Eagle’s Nest) have started again after the holiday break, and the monthly Men’s Breakfast is on the second Wednesday at 8:15 a.m. at Eagle’s Nest.",
    "In 2021, the club members contributed $4,000 to Agua Fria Food and Clothing Bank, plus the checks the food bank received from our members directly after they were solicited.",
    "Jumping right into the 2022 election, the PebbleCreek Democratic Club will hear from Adrian Fontes, candidate for Arizona secretary of state at their Feb. 2 meeting.",
    "He served from 2016 to 2020, and, as recorder, he revolutionized an outdated voting system by making elections more accessible and more secure than ever before.",
    "We meet the first Wednesday of the month, usually at the Tuscany Falls Ballroom (changes are noted on the club’s website at www.PCDemClub.org).",
    "Even amid the COVID-19 pandemic, Adrian’s administration set up an elections infrastructure that led to record voter turnout in 2020.",
    "Because Agua Fria stopped accepting clothing last year, the club members’ 1,600 pounds of contributions went to the Phoenix Mission.",
    "We also contributed more than 1,500 books to the Maricopa jails, plus magazines, greeting cards, puzzles, CDs, DVDs, and cassettes.",
    "Coming up in February are an event at TopGolf on Feb. 15 and the Mardi Gras Dinner Dance on Feb. 26.",
    "The PebbleCreek Democratic Club is committed to the betterment of our community and of our country.",
    "The Democratic Club continues its hectic social and community support activities.",
    "You don’t have to be a registered Democrat to attend or join our club.",
    "In addition, our community service commitments are substantial!",
    "The social hour begins at 6 p.m. and the meeting at 7 p.m.",
    "The club is open to all residents of PebbleCreek.",
    "Please join us!"
  ]
}