{
  "id": 3566,
  "mediaId": 2658,
  "date": "2022-01-24",
  "headline": "Trump followers zero in on secretary of state campaigns",
  "image": "https://static.politico.com/71/35/8502e0e840b08b73b0c031954d49/capitol-riot-weakening-the-guardrails-07383.jpg",
  "link": "https://www.politico.com/news/2022/01/24/trump-secretary-of-state-campaigns-00000473",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    4345,
    2175,
    2246,
    2765,
    2782,
    5949,
    6175,
    6360
  ],
  "sentences": [
    "“These races will be expensive investments given many of the battlegrounds this year also will have competitive gubernatorial and U.S. Senate races,” RSLC spokesperson Andrew Romero said in a statement, where he said Democrats were running candidates “as a way to change the rules.”\nDemocrats running for or working on the races say the party needs to focus on them — especially amid Trump’s drive to both relitigate his 2020 loss and install loyalists in key posts ahead of 2024.",
    "Jon Seaton, a consultant working on Lane’s campaign, said the businessman was motivated to run because “voters of both parties have in a lot of ways lost faith in our elections.” Seaton declined to say if Lane believed if Biden was legitimately elected, noting that Lane voted for Trump but was “going to focus on the next race and not spend a lot of time focusing on the last one.”\nCandidate funding is not a complete picture.",
    "“Arizona, Nevada, Michigan, Georgia: These secretary of state races are going to be much more important in the national conversation than many governor races are going to be.”\nFinchem — who did not respond to an interview request from POLITICO — is part of a trio of Trump-endorsed secretary of state candidates in battlegrounds so far, alongside Rep. Jody Hice in Georgia and Kristina Karamo in Michigan.",
    "| AP\nBy Zach Montellaro\n 01/24/2022 04:31 AM EST\nDonald Trump’s pick to become Arizona’s top elections official raised more campaign cash in 2021 than his two potential Democratic opponents combined — a sign of MAGA-world’s deep engagement in taking over under-the-radar positions in charge of running battleground state elections.",
    "Secretary of state duties vary from place to place but can include coordinating election policy across their states, investigating wrongdoing and certifying the final vote counts in state elections — once-invisible responsibilities that have gained prominence since the attempts to subvert the 2020 election.",
    "Having failed to prevent certification of the 2020 election, Trump and his followers are targeting state and local offices that will be involved in running the next presidential election, boosting loyalists who cast doubt on the 2020 vote and pouring energy into races that typically see little engagement.",
    "Finchem has said repeatedly, and without providing legitimate evidence, that the election was tainted by fraud, and he was a major backer of the GOP-led review of the vote in Maricopa County, which election experts and the county’s own Republican officials trashed as an unprofessional fishing expedition.",
    "Finchem — who was at the U.S. Capitol during Jan. 6 and is affiliated with the far-right group the Oath Keepers — advocated for “decertifying” President Joe Biden’s 2020 win in the state, a process that doesn’t actually exist, throughout his speech.",
    "And, in large part, it’s because we’ve also seen the energy on the other side of this.”\nOn the GOP side, the Republican State Leadership Committee and an affiliated nonprofit set an odd-year record for its fundraising, raising over $33 million.",
    "That’s more than the combined fundraising totals of the two leading Democrats, former Maricopa County Recorder Adrian Fontes and state House Minority Leader Reginald Bolding, who respectively raised about $385,000 and $200,000 for the year.",
    "While Trump’s endorsement has injected energy and money into some campaigns — new fundraising reports for Michigan and Georgia are due at the end of the month — a Trump endorsement has not necessarily cleared out GOP primaries.",
    "We need to keep this office away from Donald Trump,” said Fontes, who noted that his fundraising was running well ahead of where the current secretary of state, Katie Hobbs, was at this time before the 2018 election.",
    "State Rep. Mark Finchem, whom Trump endorsed for Arizona secretary of state in September of last year, has made the former president’s lies about the 2020 election results a cornerstone of his campaign.",
    "Washington has its first Democratic secretary of state in decades after Republican incumbent Kim Wyman resigned to take an election security role in the Biden administration last year.",
    "Democratic groups — including iVote, the Democratic Association of Secretaries of State and End Citizens United — have already committedtens of millions to secretary of state races.",
    "Hice is challenging Republican Secretary of State Brad Raffensperger in a primary, while Karamo is looking to challenge Democratic Secretary of State Jocelyn Benson in November.",
    "But the financial haul from Trump’s pick, which included thousands of donations under $100 that poured in from around the country, points to a broader trend across the states.",
    "“The numbers did scare me in Arizona too, but I wasn’t surprised,” said Ellen Kurz, the president of iVote, a group that works to boost Democratic secretaries of state.",
    "On Friday, DASS said it and affiliated organizations raised $4.5 million in 2021 — its biggest year ever — and was on track to meet its $15 million goal for the cycle.",
    "Marchant said on former Trump adviser Steve Bannon’s podcast that there is a “coalition” of like-minded candidates working together, including the three Trump backed.",
    "And Finchem was outraised by Beau Lane, an advertising executive and first-time candidate who touted the support of 50 local business leaders when entering the race.",
    "Democrats say they are watching races including Minnesota, Colorado and even Washington state as part of a more expansive battlefield of secretary of state races.",
    "In Arizona, Finchem is one of three Republican state lawmakers running for the office, including state Rep. Shawnna Bolick and state Sen. Michelle Ugenti-Rita.",
    "“Ladies and gentleman, we know it and they know it: Donald Trump won,” Finchem said during a speech last weekend at Trump’s first political rally of the year.",
    "The RSLC is the major GOP group focused on secretary of state races, among a wide array of down-ballot and state-level positions for which it raises money.",
    "Kurz, of iVote, said that she has been happy with how her organization’s fundraising went in 2021, including more from small donors than in past elections.",
    "Lane raised over $716,000, the most out of any secretary of state candidate in the state last year, which included about $38,000 worth of self-funding.",
    "“And this is where Democrats locally and across the county have to be focused on these races, to make sure that we understand what’s at stake.”",
    "Drafting off Trump’s endorsement, Finchem brought in more than $660,000 for his campaign in 2021, according to new campaign finance reports.",
    "Trump has yet to endorse in other battlegrounds like Nevada, where former state Assemblyman Jim Marchant has tried to run in the same mold.",
    "Operatives on both sides of the aisle expect outside spending to play a significant role in secretary of state races across the country.",
    "They’re going to try to do in 2024 what they couldn’t do in 2020,” said Bolding, the Arizona Democratic candidate.",
    "“I think the level of awareness continues to ramp up,” said Kim Rogers, the executive director of DASS.",
    "State Rep. Mark Finchem of Arizona speaks during an election rally in Richmond, Va., on Oct. 13, 2021.",
    "In interviews, both Democratic hopefuls said they were not overly concerned by Finchem’s fundraising.",
    "But it’s another sign, they say, that Democrats need to take these races incredibly seriously.",
    "But the fundraising numbers do give a sense of how much attention these races are getting.",
    "I think people are finally starting to focus on it in a way that they haven’t previously.",
    "Another Republican with business ties actually raised even more than Finchem.",
    "“It’s apparent that Republicans are focused on secretary of state races.",
    "“We’ve seen increased engagement, even since the beginning of this year.",
    "But “the next three months are really going to be the tell,” she said.",
    "Each of the candidates backs Trump’s view of the 2020 election.",
    "“We need to win."
  ]
}