{
  "id": 4126,
  "mediaId": 8475,
  "date": "2022-01-25",
  "headline": "Lies about the 2020 election propel Arizona bills aimed at combating non-existent fraud",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/012522_audit-protesters-pedroza-getty-pool.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/012522_az_election_bills/lies-2020-election-propel-arizona-bills-aimed-combating-non-existent-fraud/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    0
  ],
  "sentences": [
    "Local\nCheered on by an enthusiastic crowd that espoused conspiracy theories about fraud in the 2020 presidential vote and touted the largely debunked findings of the so-called Maricopa County “audit,” the Senate Government Committee on Monday advanced a slew of bills aimed at curbing or alleviating concerns about election fraud in Arizona, despite little evidence of such incidents.",
    "“With the governor’s support and with the impact that bill can have on future elections that are very close, I think it’s going to garner the same level of support,” she said, adding, “I can’t guarantee.”\nAs to whether Ducey will support other election measures, chief of staff Daniel Ruiz told reporters that the governor will let that process play out in the legislature.",
    "Townsend’s Senate Bill 1012 would require the Secretary of State’s Office to provide the Attorney General’s Office and a legislative designee with access to the state’s voter registration database so they can investigate federal-only voters, and would require each county to submit an annual report to the legislature regarding those voters.",
    "State law has permitted mail-only balloting in off-year elections — the only elections in which the practice is permitted here — for nearly 30 years, though the issue attracted renewed attention from critics last year due to concerns over mail-in voting that were largely spurred by false allegations Trump made during his 2020 campaign.",
    "Senate Bill 1013, also sponsored by Townsend, would attempt to eliminate the requirement that Arizona register federal-only voters by mandating that the secretary of state ask the U.S. Election Assistance Commission to include Arizona’s proof-of-citizenship requirement on federal voter registration forms for the state.",
    "Dozens of advocates of the proposed laws packed the committee hearing room at the Senate, many of them making wild, baseless claims about the 2020 election or espousing conspiracy theories about the vote, such as that the count included many counterfeit ballots or illegally cast votes, throughout the four-hour hearing.",
    "The legislation included laws mandating counter-fraud security measures, probes into people who can’t prove their citizenship when they register to vote, reviews of election equipment, prohibiting all-mail balloting, changing mandatory recount rules and requiring images of all ballots to be posted online.",
    "The bill, sponsored by Sen. Sonny Borrelli, R-Lake Havasu City, would require that if counties opt to use anti-fraud security measures on their ballots, they must use ballots that have specific types of features, such as watermarks, holographic foil, special inks, microprinting or others.",
    "The passage of this bill will sow the seeds of distrust in our democratic processes,” said Dana Allmond, an Oro Valley woman who is running for the state House of Representatives as an independent, of a bill that would require counties to post digital images of voted ballots online.",
    "The findings of the review, which was led by unqualified companies and individuals who had been heavily involved in the effort to falsely portray the election as rigged against former President Donald Trump, have been largely debunked and discredited.",
    "Several people cited the thoroughly debunked “Sharpiegate” allegations, which held that election officials intentionally gave Trump supporters markers that bled through the paper on their ballots in order to invalidate their votes.",
    "Sen. Teresa Hatathlie, D-Coal Mine Canyon, said the counties would have to engage in voter education if the bill passes into law to ensure that people know any personal information they write on their ballots will be made public.",
    "Election officials also check driver’s license records, jury duty questionnaires, Social Security records, foreign identifications and other records to determine citizenship for voters who submit federal-only registration forms.",
    "Several of the bills included measures that were part of last year’s state budget but were later thrown out by the Arizona Supreme Court on the grounds that they violated the single-subject provision of the state constitution.",
    "Just because federal-only voters don’t prove their citizenship doesn’t necessarily mean they’re not U.S. citizens; it only means that they haven’t provided the proof of citizenship needed to vote in state-level elections.",
    "Conspiracy theorists claimed without a shred of evidence that counterfeit ballots were inserted into Maricopa County’s count in 2020, and the audit at one point inspected ballots for bamboo fibers and secret watermarks.",
    "The governor rarely takes a position on legislation until he’s acted on it, and has repeatedly defended the security and integrity of Arizona’s election system, though he hasn’t closed the door to changes to the law.",
    "Among the speakers who falsely claimed the 2020 election was marred by fraud was Republican gubernatorial hopeful Kari Lake, who has made bogus claims about the last election a centerpiece of her campaign.",
    "Ugenti-Rita ran a similar bill last year, but that legislation died when Townsend, who’d initially supported the proposal, voted against it after Ugenti-Rita killed one of her election bills in committee.",
    "Fontes said that, although Finchem and other right-wing election conspiracy theorists believe the measure will “find their invisible smoking gun to prove election fraud,” it will actually do the opposite.",
    "She said counties would need a way to ensure that ballots complied with the 17 approved counter-fraud measures, and that they would need money to ensure their machines could read the new ballots.",
    "Sen. Martin Quezada, a Glendale Democrat, noted that more than a half dozen lawsuits alleging fraud or misconduct in the 2020 election were filed, and all were thrown out for a lack of evidence.",
    "Like the other bills the committee heard on Monday, SB1008 passed on a party-line vote, with the panel’s four Republican members voting in favor and the three Democrats voting against it.",
    "In addition to the committee’s regularly scheduled hearing on Monday, she said she hopes to hold an additional special hearing to help get through all the legislation she wants to hear.",
    "Currently, state law only mandates a recount if the margin of victory is within either one-tenth of a percentage point, or within 10-200 votes, depending on what kind of race it is.",
    "Several committee members left before they’d finished with the day’s agenda, depriving the committee of a quorum and forcing Townsend to hold several bills for hearings next week.",
    "Fontes, a Democrat who is now running for secretary of state, issued a statement earlier this month supporting an identical proposal sponsored in the House by Rep. Mark Finchem.",
    "“To be able to have a visual record of a ballot, while still respecting the privacy of voters, is a great way to improve transparency and accountability in our state elections.",
    "“This last election was shady, it was shoddy, it was corrupt, and our vote was taken from us.”\nSupport TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "She said Maricopa County’s ballot tabulation machines, which are provided by Dominion Voting Systems, already have the capability of creating digital images of the ballots.",
    "“We vote in private but we count in public,” said Borrelli, the bill’s sponsor, who emphasized that people would be unable to tie ballots to individual voters.",
    "As a result, people who can’t provide proof of citizenship can register to vote only in federal races, but not in state-level or other elections in Arizona.",
    "Some claimed that ballots were printed on different types of paper, potentially signifying fraud, though no evidence of such problems has actually emerged.",
    "Jennifer Marson, executive director of the Arizona Association of Counties, said county election officials had concerns about implementation and logistics.",
    "Had the proposed threshold been in place in 2020, the state would have had to recount the presidential race, which President Joe Biden won by 10,457 votes.",
    "Sen. Wendy Rogers, a Flagstaff Republican who has been a leading proponent of bogus election fraud claims, filled in on the committee in place of Sen. J.D.",
    "This will make it harder not easier for right-wing conspiracy theorists to sow doubt about our elections,” he said in a written statement backing the bill.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "One woman, for example, claimed that county election officials didn’t send her an early ballot in 2020 because she’d voted for Trump four years earlier.",
    "Anyone who is found to have knowingly registered to vote despite not being eligible would be referred to the attorney general and the county attorney.",
    "That bill didn’t get any Democratic backing on the committee but had support from an unlikely source, former Maricopa County Recorder Adrian Fontes.",
    "She noted that some people sign their names or even write their names and addresses on ballots, which would eliminate the secrecy of their ballots.",
    "Of the nearly 23,000 federal-only voters in Arizona, 7,628 cast ballots in the 2020 general election, according to the Secretary of State’s Office.",
    "All seven of the bills passed on party-line votes, with the committee’s four Republicans voting in favor and its Democratic members in opposition.",
    "Two of the bills, both sponsored by committee chairwoman Kelly Townsend, R-Apache Junction, dealt with the issue of “federal-only” voters.",
    "Many of the speakers said they’d worked on the “audit” that Senate President Karen Fann ordered for the 2020 election in Maricopa County.",
    "But the counties don’t want to redact anything, she said, which could give people the impression that they were hiding something.",
    "Senate Bill 1119 would require counties to make available to the public digital images of all ballots cast in an election.",
    "“Saying that the election was stolen — I mean that’s great for a campaign speech, but that’s not reality,” Quezada said.",
    "She also said it was concerning that the paper is only available from one vendor, an issue that Quezada raised as well.",
    "The committee passed seven bills that proponents described as measures that would prevent fraud in future elections.",
    "The overwhelming majority of the speakers supported the bills, though some questioned the motivation behind them.",
    "Like other voters, federal-only voters need identification in order to vote in person or request an early ballot.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "“Conspiracy theories do not take away from the fact that our election processes are already safe and secure.",
    "Doug Ducey is supportive of expanding the recount threshold, his staff told reporters earlier this month.",
    "Rogers’ Senate Bill 1133 would prohibit cities and school districts from conducting all-mail elections.",
    "The bill, sponsored by Sen Michelle Ugenti-Rita, would lower the threshold to a half percentage point.",
    "Republican Attorney General Mark Brnovich investigated the claims and found them to be without merit.",
    "“Any illegal ballot that gets injected into the system suppresses a legal vote,” Borrelli said.",
    "Townsend said the bill would reduce conspiracy theories by making the tally publicly available.",
    "“I’m worried about what happened to President Trump happening to me,” Lake told the committee.",
    "Senate Bill 1008 would loosen the rules for when a full recount of a race must be conducted.",
    "One of their concerns was that they be released from any legal liabilities that may arise.",
    "State law requires people to prove their U.S. citizenship when registering to vote.",
    "Redaction is a whole other ball of wax that’s not really contemplated right now.",
    "Mesnard, and was there to vote on one of her bills that the committee advanced.",
    "“The governor’s going to prioritize adjusting the recount threshold,” he said.",
    "Even Fann’s “audit” concluded that Biden had more votes than Trump, he said.",
    "Townsend “killed it out of spite,” Ugenti-Rita told the Arizona Mirror.",
    "Marson said the counties had some concerns they hoped to see addressed.",
    "We don’t want to be in the business of redaction,” Marson said.",
    "Ugenti-Rita was optimistic about her bill’s chances this year.",
    "There are roughly 23,000 federal-only voters in Arizona.",
    "Those ballots would have to be searchable by precinct.",
    "But that requirement does not exist in federal law.",
    "Doing so is already a crime under state law.",
    "Donate to TucsonSentinel.com today!",
    "Donate to TucsonSentinel.com today!",
    "One of those was Senate Bill 1120.",
    "“Redaction is tough.",
    "- 30 -",
    "Gov."
  ]
}