{
  "id": 47,
  "mediaId": 2658,
  "date": "2022-02-22",
  "headline": "Dems fear for democracy. Their big donors aren’t funding one of its main election groups.",
  "image": "https://static.politico.com/a0/92/23be62fa418d98b4b3c2de365dae/nerdwallet-in-your-debt-money-red-flags-21966.jpg",
  "link": "https://www.politico.com/news/2022/02/22/big-dem-donors-secretary-state-00010413",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5292,
    392,
    648,
    1132,
    6175
  ],
  "sentences": [
    "“Frankly, we have to introduce the role of secretary of state to a lot of people, and frankly their impact on elections, and I think that it takes time to build that connective tissue.”\nDuring the middle of the Trump administration, DASS was still establishing itself in Washington, according to a person who has been involved in fundraising to support Democratic secretaries of state.",
    "“That’s a lot sexier than saying I gave money to ensure that the election administration office in Akron, in Ohio is able to ensure that the vote count is accurate.”\nIn an interview, Rogers, who was named to her post in April, said that donor attention had shifted from the states to Congress as lawmakers there launched a now-stalled push to pass voting rights legislation.",
    "Democrats’ failure to energize large-dollar donors behind the association directly involved in electing state election administrators threatens to undermine whatever momentum the party had been hoping to build around protecting voting rights heading into the midterms and the 2024 campaign.",
    "A report published earlier this month from the Brennan Center, a left-leaning think tank, found that contributions to candidates in six states, including Arizona, Georgia, Michigan, Minnesota, Nevada and Wisconsin, were three times higher than at this point in the 2018 election cycle.",
    "Edwards, an alumnus of Google who is now on the board of a democracy-related software and data nonprofit, said he had formed an informal group with four or five donors or donor advisors around how to direct funds to election administration-related efforts.",
    "But the lack of attention on DASS underscores that Democrats have struggled to turn that rhetoric into action and big checks, even as a number of battleground states — including Georgia, Arizona, and Michigan — will elect their secretary of state in 2022.",
    "That figure included money given to “affiliated organizations” including a 501(c)(4) nonprofit voting rights group known as Every Eligible American, the organization’s PAC (which reported $124,663.60 in contributions), and the allied DASS Victory Fund.",
    "During the last six months of 2021, just one person, Democratic financier George Soros, gave more than $25,000 to the main association involved in electing the party’s candidates for secretaries of state, according to a review of the group’s filings.",
    "“I also think that there are so many things in play in 2022 and it’s just really hard … to break through.”\nWhile big Democratic donors have yet to stuff DASS’ coffers, record money is flowing into races related to election administration.",
    "“In some cases, it’s self affirmation, ‘Oh you know, I supported Senator so and so, and we went to breakfast, and that was great, and I helped democracy and got an opportunity to have one on one time with an elected official,’” he said.",
    "Donors, though “susceptible to the charms of U.S. senators and Nancy Pelosi,” are simply not in the habit of giving to secretaries of state, said Colm O’Comartun, a former executive director of the Democratic Governors Association.",
    "| Elise Amendola/AP Photo\nBy Hailey Fuchs\n 02/22/2022 04:30 AM EST\nDemocratic secretaries of state say they’re at the vanguard of protecting democracy, pushing back against election disinformation and attempts to suppress the vote.",
    "“DASS is not being paid attention to in any way, shape or form as well as it ought to be, and I don’t know if that’s an issue with the donors or an issue with that organization or an issue with Democrats writ large,” he said.",
    "One major Democratic donor, Shekar Narasimhan, who founded the super PAC AAPI Victory Fund and did not give to DASS last year, said that there were still questions to be answered about how best to use the party’s resources.",
    "Direct comparisons to what Republicans are doing are inexact, since the group’s GOP counterpart, the Republican State Leadership Committee, fundraises for other state races as well as candidates for secretary of state.",
    "The list includes unions — such as Service Employees International Union ($100,000) and the American Federation of Teachers ($50,000) — as well as the Pharmaceutical Research and Manufacturers of America ($100,000).",
    "But this election cycle was supposed to be different, owing to fear that former president Donald Trump and his political allies were attempting to get 2020 election skeptics elected to key state office posts.",
    "A person who has worked in secretary of state campaigns said that the group was consumed with turnover of its chair at the start of 2021, even as issues around election administration became a flashpoint.",
    "Rogers also noted that there was a “significant difference” in the cost of a secretary of state race compared to that of a governor, and that her group is only starting to build out its fundraising arm.",
    "But, he added, the current moment required that they become “aggressively political.”\nOperatives involved in Democratic secretary of state races said DASS has long struggled to hold donors’ attention.",
    "“I was operating under the assumption that people were recognizing this problem and we’re going to be flooding them with cash,” said Doug Edwards, one of those four individuals who gave $25,000.",
    "The absence of more big checks is notable considering that the Democratic Association of Secretaries of State, a 527 organization, has no limit on the size of the donations it can receive.",
    "… I’m going to start worrying about DASS again.”\nDASS’ executive director, Kim Rogers, said that 2021 was a record fundraising year, with the group touting $4.5 million in donations.",
    "Secretaries of state races in Arizona, Nevada, Michigan and Georgia are receiving lots of attention, said Adrian Fontes, a candidate for secretary of state in Arizona.",
    "Beyond the $500,000 check written by Soros’ super PAC, Democracy PAC, the biggest donations to DASS came from politically active institutions, not individual donors.",
    "Democrats have a long history of neglecting those contests, choosing instead to prioritize presidential, Senate and high-profile congressional elections.",
    "During that time, Colorado Secretary of State Jena Griswold, who positioned herself as a voting rights steward, was selected to lead the organization.",
    "The same can not be said for the committee raising money for those races’ Democratic campaigns, added the former Maricopa, Ariz., County Recorder.",
    "She maintained that last month was the group’s “best [fundraising] month ever,” though she declined to give any names of donors or amount raised.",
    "For operatives who have worked on statewide races, the lack of attention from the party’s biggest benefactors is part of a much longer trend.",
    "You don’t get anything else like access to people with regulatory oversight or governors who have oversight over all kinds of agencies.",
    "But, over the same time period, that group and its subsidiary for state courts reported raising $28 million, according to IRS filings.",
    "The RSLC and “its strategic policy partner” the State Government Leadership Foundation together raised $33.3 million, the RSLC said.",
    "Sen. Alex Padilla (D-Calif.), the association’s former chair, was appointed to the Senate to replace Vice President Kamala Harris.",
    "Still, Democrats said that even with new laws taking effect, there was a need for urgency in funding candidates for these offices.",
    "The goal was originally to focus on “election administration further down the food chain” at the county or precinct levels.",
    "You don’t give to secretary of state races for access,” said one donor advisor with clients who support DASS.",
    "In Georgia, recent legislation stripped away the secretary of state’s power over that state’s election board.",
    "O’Comartun noted that Democratic secretaries of state have been reluctant to appear partisan in the past.",
    "But some Democrats speculated that the group has also suffered from donor fatigue after the 2020 races.",
    "Among them: Exactly what powers secretaries of state have over election administration in each state?",
    "“We are at a significant enthusiasm disadvantage, and we need to correct that very quickly.”",
    "But while the party’s base has largely rallied behind them, its biggest donors have not.",
    "The amount that DASS itself took in, according to IRS filings, was $2.4 million.",
    "The right to vote has emerged as a rallying cry among the party’s base.",
    "Fundraising took a backseat amid the reorganization, the person said.",
    "“Secretary of state races are just fundamentally about democracy.",
    "Rogers is DASS’ first permanent full-time executive director.",
    "He said he was surprised at the lack of attention to DASS.",
    "“Our fundraising program is relatively new,” she said.",
    "Four other individuals gave $25,000 precisely.",
    "Twenty dollar bills are counted.",
    "“That’s clearly not the case."
  ]
}