{
  "id": 701,
  "mediaId": 8476,
  "date": "2022-02-24",
  "headline": "Trust Busters: A Slate of New Election Laws Sweeps Arizona in Response to ‘Voter Fraud’ Conspiracy Theories",
  "image": "https://media2.fdncms.com/tucsonweekly/imager/u/slideshow/32012208/mark_finchem_by_gage_skidmore.jpg",
  "link": "https://www.tucsonweekly.com/tucson/trust-busters-a-slate-of-new-election-laws-sweeps-arizona-in-response-to-voter-fraud-conspiracy-theories/Content?oid=32012203",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Dean",
  "authorUrl": "https://www.tucsonweekly.com/author/jake-dean",
  "termIds": [
    0
  ],
  "sentences": [
    "In a released statement, Fontes argued that while far-right Republicans believe this will allow them to “find their invisible smoking gun to prove election fraud ... it will actually prove once and for all how well our election processes actually work.”\nOr take SB 1133 from Sen. Wendy Rogers, which follows in the far-right footstep of Sen. Kelly Townsend, who attempted last year to force early mail-in ballots to be returned in person.",
    "In the words of the final Maricopa County Elections Department report on the topic: “After an in-depth analysis and review of the reports and presentations issued by the Senate’s contractors, we determined that nearly every finding included faulty analysis, inaccurate claims, misleading conclusions, and a lack of understanding of federal and state election laws.” The only tangible result of the audit?",
    "While proponents of SB 1119 like Borrelli have argued the ballot images would not tie them to individual voters, Arizona Association of Counties Executive Director Jennifer Marson has expressed several concerns including possible legal liability for counties releasing records, given that some people sign their names or write their addresses on ballots.",
    "In a continuing demonstration of poor taste, Rep. Fillmore compared this behavior to a “lynching.” Speaker Bowers, a fellow Republican, referred to the bill as unacceptable and called its supporters a “screaming, demanding, arrogant, self-righteous bunch.” A refreshingly honest take in an era of hyper-partisan politics.",
    "Some of the less insidious proposals include SB 1008, which proposes amending the threshold to trigger an automatic recount, and SB 1120 (of which Finchem is a co-sponsor) that requires the use of special watermarked ballots in an apparent attempt to limit the fraud that was never found by the Maricopa County audit.",
    "It will cost almost twice as much to do an election and then the turnout is very low.”\nThis avalanche of election proposals will not make Arizona democracy stronger; it will simply drive down turnout and cost taxpayers more money—all in a response to fraud that never existed to begin with.",
    "Despite bringing in a host of contractors—including the now infamous Cyber Ninjas (whose CEO Doug Logan has openly advocated for the “Stop the Steal” movement)—Fann and election conspiracy theorists failed to produce any legitimate evidence of widespread fraud.",
    "Finchem’s obviously unconstitutional and profoundly unwise proposal will receive all of the consideration it deserves.”\nWhile there simply is not enough space in this piece to cover every piece of election-related legislation, the overall takeaway is simple.",
    "We don’t want to be in the business of redaction.”\nInterestingly, Democrat Adrian Fontes, the former Maricopa County recorder and current candidate for Arizona Secretary of State, has come out in favor of this legislation.",
    "These include rule changes for residents requiring new proof of citizenship requirements for federal voter registration forms and allowing the Legislature to appoint a designated outside entity for voter roll verification.",
    "I reported for The Weekly back in October and November on attempts to bring an election audit to Pima County and the democratic dangers of electing far-right Secretary of State candidate Mark Finchem.",
    "And the Legislature has been busy in 2022, with state lawmakers filing more than 100 pieces of election legislation including attacks on early voting and jail penalties for election worker missteps.",
    "Here at The Weekly, we intend to bring you continuing coverage of these legislative efforts aimed at hampering electoral participation throughout the lead-up to the midterms later this year.",
    "As Leslie Hoffman, the County Recorder from the Republican stronghold of Yavapai County, explains: “Some of the bills coming through will be all but impossible to administer or implement ...",
    "The bill from Republican Sen. Sonny Borrelli requires nearly 20 security features including holographic foil, watermarks and other features generally reserved for anti-counterfeit currency.",
    "Or the proposal dubbed SB 1119 (introduced by the likes of Borrelli, Fann and Finchem), which mandates the online publication of electronic ballot images as part of the public record.",
    "This despite evidence from leading election experts that vote-by- mail options do not increase voter fraud, but do increase voter participation and trust in the electoral process.",
    "Critics of the legislation have noted that there is only one known company even capable of producing the ballots—and of course these ballots come at a far higher cost.",
    "In early February, he introduced House Concurrent Resolution 2033, which would decertify the Arizona general election and “reclaim” the state’s presidential electors.",
    "For example, he assigned one bill, Rep. John Fillmore’s proposal to allow state lawmakers to reject election results, to every single committee at the Legislature.",
    "While the legislation is problematic on face value, there is also no process under current law for the legislature to decertify a previously certified election.",
    "In fact, the Maricopa County elections team rebuked 76 of the claims made by the audit in a damning four-hour presentation to the County Board of Supervisors.",
    "Logan and his former company were also ordered to pay compensation to watchdog group American Oversight for forcing them to compel his deposition in court.",
    "(As of Monday, Feb. 21, the fines had climbed to $230,000, although Logan has made it clear he eventually plans to appeal the decision to a higher court.)",
    "Bowers has not only rejected the idea that Trump won Arizona, he has dismissed at least some of the so-called election reform legislation at the Capitol.",
    "During a flurry of election-related legislation, former television anchor and GOP gubernatorial candidate Kari Lake claimed “This election was shady.",
    "Determining some 50 ballots have been double-counted—hardly the widespread fraud claimed by Republicans in a state with millions of cast ballots.",
    "“Saying that the election was stolen, that’s great for a campaign speech but that’s not reality ... it’s our job as members to focus on reality.”",
    "Logan has dissolved the company and has been facing fines of $50,000 per day since Jan. 6 for failing to turn over records related to the audit.",
    "While expensive and entirely unnecessary, frivolous expenditures are nothing compared to several of the other Republican-backed proposals.",
    "This is a political ploy to decrease trust in democratic institutions that should have no place in the chambers of our state legislature.",
    "Cyber Ninjas, which had no experience in auditing elections (and little experience in anything else), has completely collapsed.",
    "Since the Donald Trump-supported audit of Pima County failed to gain traction, state Republicans turned to the legislature.",
    "The only reason they could be justified is if there were significant concerns with election integrity in the status quo.",
    "State senate president Karen Fann tried her hardest to overturn the legitimate 2020 presidential election in Arizona.",
    "SB 1133 puts a blanket prohibition on all-mail balloting for elections in cities, towns and school districts.",
    "However, the assault on legitimate elections in Arizona was far from over with the clownish Maricopa audit.",
    "At the end of January, seven bills related to elections passed through committee in the Arizona Senate.",
    "This rare procedural move makes it near impossible for the bill to ever reach the House floor.",
    "To argue otherwise is not just to lie, but to show a disdain for a government by the people.",
    "And the theory that there were thousands of magically appearing ballots in Maricopa County?",
    "It should be noted that House Speaker Rusty Bowers did not bow to the mob, as Fann did.",
    "There is no proof of widespread voter fraud in the Arizona General Election of 2020.",
    "Redaction is a whole other ball of wax that’s not really contemplated right now.",
    "There are also no significant concerns with the past election’s integrity.",
    "Counties are seriously concerned with maintaining voters’ privacy.",
    "In January, Marson explained further that “Redaction is tough.",
    "Theories that Dominion voting colluded to stop the audit?",
    "And the vote was taken from us.” Except, it was not.",
    "Of course, recounts require time and money to hold.",
    "The hacking conspiracy theory was also debunked.",
    "Sen. Martin Quezada hit this issue on the nose.",
    "Do not let Fann, Finchem, and Lake fool you.",
    "However, SB 1120 could be even more costly.",
    "Finchem took the game to a whole new level.",
    "So, I’ll say it once more: There are not.",
    "The sharpie theory was debunked.",
    "As he said to reporters, “Mr.",
    "Speaker Bowers knows that.",
    "You guessed it, debunked.",
    "Both of them, actually.",
    "It was corrupt.",
    "It was shoddy.",
    "Debunked."
  ]
}