{
  "id": 7332,
  "mediaId": 2578,
  "date": "2022-04-06",
  "headline": "BREAKING: Arizona Attorney General Releases Maricopa County 2020 Election Interim Report – Individuals To Be Prosecuted For Election Fraud",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/19887ABD-528B-49DC-8E21-E3DE60265A4E.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/04/breaking-arizona-attorney-general-releases-maricopa-county-2020-election-interim-report-individuals-prosecuted-election-fraud/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Assistant Editor",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    3401,
    3019,
    1394,
    6360,
    5949
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe letter to Karen Fann said, “The EIU’s review has uncovered instances of election fraud by individuals who have been or will be prosecuted for various elections crimes.”\nMark Brnovich tweeted, “We can report that there are problematic system-wide issues that relate to early ballot handling and verification.”\nI just dropped off our initial review of the 2020 election audit to President Fann.",
    "The Attorney General concluded that “Maricopa County failed to follow the EPM procedures when transporting 20% of the early ballots from drop box locations to MCTEC.”\nThe Attorney General alleges that 381 out of 1,895 Early Voting Ballot Transport Statements were missing required information such as ballot counts, audit signatures, courrier signatures, election department receiver signals, and documentation of security seals.",
    "Regarding signature verification standards, the report states, “the early ballot affidavit signature verification system in Arizona, and particularly when applied to Maricopa County, may be insufficient to guard against abuse.”\nUnder County Recorder Adrian Fontes, Maricopa County saw a massive decrease in the number of ballots rejected due to missing signatures or mismatched signatures.",
    "The entire investigation has been delayed by Maricopa County’s ‘document preservation & production issues.’ The Attorney General reported to Arizona Senate President Karen Fann that his office is still receiving new information and that Maricopa County has still not fully complied with document requests.",
    "Due to the large volume of mail-in ballots in the 2020 election, the limited training of elections workers, and time restrictions, the AG’s office determined that 206,648 early ballot signatures were verified on November 4, 2020, with an average time of 4.6 seconds per signature.",
    "DECERTY DAMN IT\n— Wendy Rogers (@WendyRogersAZ) April 6, 2022\nWE WANT ARRESTS NOW\n— Wendy Rogers (@WendyRogersAZ) April 6, 2022\nBrnovich also indicated that this investigation could take “years to complete.” Brnovich must finish this investigation before the 2022 election!",
    "https://t.co/0Abo7ekVO0 pic.twitter.com/kQQqH2olO6\n— Rasmussen Reports (@Rasmussen_Poll) April 6, 2022\nThe report showed some of the massive evidence of election fraud, but it did not give any recommendations on rectifying the stolen 2020 election and saving our country.",
    "https://t.co/Pgogo9A7uO\n— Mark Brnovich (@GeneralBrnovich) April 6, 2022\nThe report reveals that “between 100,000 and 200,000 ballots were transported without a proper chain of custody,” and signature verification standards were greatly decreased in the 2020 election.",
    "This is inconsistent with the Verity Vote investigation findings, which used public records requests for all ballot box retrieval and chain of custody forms utilized in Maricopa County during the 2020 General Election.",
    "This investigation found that Maricopa County failed to record the number of ballots on 1,514 out of 1,895 unique EVBTS and failed to record signatures on 48 of these documents.",
    "As The Gateway Pundit reported, Dr. Shiva’s extensive study of Maricopa County’s signature verification standards found an additional 200,000 signature discrepancies.",
    "This is similar to noncompliance issues faced by the Arizona Senate and Cyber Ninjas while conducting the full forensic audit of Maricopa County’s 2020 election.",
    "The Arizona Attorney General has finally released an interim report on his investigation into the Maricopa County November 3rd, 2020 General Election.",
    "Arizona State Senator Wendy Rogers responded to this news, calling for immediate arrests and decertification of the fraudulent 2020 election.",
    "— Wendy Rogers (@WendyRogersAZ) April 6, 2022\nThere is something else we can use to deter crime but I would get censured again if I said it.",
    "2020 Election Integrity: Arizona – Brnovich Has Bupkis\nCounterfeit ballots, ballot trafficking ballrooms & trafficking mules, nope.",
    "2020 Election Integrity: Arizona – Brnovich Has Bupkis\nCounterfeit ballots, ballot trafficking ballrooms & trafficking mules, nope.",
    "This report also failed to mention any crimes committed by ballot traffickers and discovered by True The Vote and Dinesh DSouza.",
    "DSouza’s upcoming film is set to expose the nationwide operation that was used to steal the 2020 election from President Trump.",
    "We can report that there are problematic system-wide issues that relate to early ballot handling and verification.",
    "6 mths of total silence & then technical excuses on records production don’t get you into the U.S. Senate.",
    "6 mths of total silence & then technical excuses on records production don't get you into the U.S. Senate.",
    "Contact Arizona Attorney Mark Brnovich to demand free and fair elections before November 2022.",
    "Our nation burns and people write damn letters that don’t do a damn thing!",
    "Rassmussen Reports noted the AG’s silence on this key election fraud scam.",
    "— Wendy Rogers (@WendyRogersAZ) April 6, 2022\nRead the full report here.",
    "It only suggested changes to elections law in the future.",
    "There was no mention of this groundbreaking report.",
    "\"The constitutional punishment for treason.\"",
    "Thank you for playing, Mark!",
    "Thank you for playing, Mark!",
    "What have they been hiding?",
    "No sense of urgency.",
    "Fix it now!",
    "Flaccid.",
    "Slow."
  ]
}