{
  "id": 9522,
  "mediaId": 2875,
  "date": "2022-03-29",
  "headline": "More than 80 election-denying candidates running for governor, attorney general and secretary of state in 2022’s primaries",
  "image": "https://i2.wp.com/www.nationofchange.org/wp-content/uploads/2022/03/primary-election-1321269_1x.jpeg?fit=560%2C315&ssl=1",
  "link": "https://www.nationofchange.org/2022/03/29/more-than-80-election-denying-candidates-running-for-governor-attorney-general-and-secretary-of-state-in-2022s-primaries/",
  "mediaOutlet": "nationofchange.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Rosenfeld",
  "authorUrl": "https://www.nationofchange.org/author/steven-rosenfeld/",
  "termIds": [
    2765,
    5534,
    4262,
    611
  ],
  "sentences": [
    "Shades of election denial\nStates United defines an “election denier” as a candidate who meets one of the following criteria: They “[f]alsely claimed former President Trump won the 2020 election instead of the legitimate winner”; they “[s]pread lies about the legitimacy of the 2020 presidential election in public fora”; they “[c]alled for a ‘forensic audit’ of the 2020 presidential election after the results were certified and/or officially audited and/or stood up to multiple legal challenges”; they “[p]romoted conspiracies about the 2020 presidential election in public fora”; and they “[t]ook actions to undermine the integrity of the 2020 presidential election” by backing lawsuits seeking to overturn the results, or organizing or taking part in “Stop the Steal” events.",
    "In Colorado’s gubernatorial race, Laurie Clark claimed that one voting system maker, Dominion, has stolen elections “since 2005,” while another Colorado candidate, Danielle Neuschwanger, repeated false claims about the election from Pennsylvania and Georgia, pledging, “When I am elected Governor of Colorado, on day one my priority will be restoring election integrity.” Much the same claims were made by Republican candidate for Georgia’s governor David Perdue, a former U.S. senator who in a January 2021 runoff election lost his 2020 re-election bid and who in November 2020 had called for the resignation of his secretary of state, Brad Raffensperger, also a Republican, for rejecting Trump’s demand to find enough votes so that he’d win the state in 2020.",
    "In 2021, some Election Deniers won their seats—and in 2022, certain candidates are running on election lies as a campaign issue and earning the endorsement of former President Donald Trump and others who promote the myth that the 2020 election was ‘stolen.’ In fact, there is a coalition of ‘America First’ Secretary of State candidates—a group of at least eight people running for the post this cycle—that all backed former President Trump’s efforts to undermine the will of the voters in 2020.”\nThe candidates for secretary of state have garnered the most attention because they oversee their state’s elections.",
    "Abraham Hamadeh, a Republican candidate in Arizona’s attorney general election, attacked the former recorder in the state’s most populous county (Adrian Fontes, a Democrat now running for secretary of state in Arizona) for unspecified “unconstitutional” actions “to hijack our elections.” Ashley Moody, the Republican incumbent in Florida’s attorney general race, urged the U.S. Supreme Court to hear a motion from Texas’ attorney general seeking to overturn the Electoral College results from other battleground states, saying “the process” was not followed, but not citing evidence.",
    "“The temperature from 2020 had carried over and gotten worse… [and] just keeps escalating because of all of the mistrust from this misinformation, and questions about the security and fairness of our voting systems.”\nThose worries were echoed by current and former top officials from Colorado, Virginia, and the U.S. Cybersecurity and Infrastructure Security Agency, who recounted their responses but cited new developments, including ongoing threats to election officials by Trump backers and an exodus of those officials and poll workers.",
    "“I can give you all the facts in the world, but if your confirmation bias is ‘elections are rigged,’ then the facts are only going to serve to help bolster their [mistaken] case.”\nBut one trend not cited by the career civil servants on the March 17 webinar was that scores of 2020 election-denying candidates are on 2022’s primary ballots, where they are vying to be this fall’s Republican nominee for governor, attorney general and secretary of state.",
    "Georgia Republican Congressman Jody Hice, also running for secretary of state in Georgia, boasted of voting against ratifying Georgia’s 2020 Electoral College votes, and has said that “[t]hey stole the presidential race” and that his candidacy “means being vigilant to all fraud and irregularities.”\nThe other candidates have spread similar misinformation, saying that denying the 2020 election results is patriotic.",
    "Partisan propaganda about the untrustworthiness of elections was worse in 2021 than during the 2020 presidential election, when Donald Trump claimed that he won and incited a riot at the U.S. Capitol to block ratification of Joe Biden’s victory, according to state election directors who fear that 2022’s elections will see deepening disinformation from losing GOP candidates.",
    "Matthew DePerno, a Republican candidate for Michigan’s attorney general, attacked the Democratic incumbent “Dana Nessel, the Radical Left, and the RINOs [Republicans in name only]” and touted his role (“he gets results”) in an error-filled and debunked post-2020 “audit” in Antrim County, as he reiterated Trump’s September 16, 2021, endorsement in February 2022.",
    "Charlie Pierce, who is also running to be Alaska’s Republican nominee for governor, said on social media that problems ranged from “100,000+ Alaskan’s [sic] data being stolen at the State Level to vote dumps in the middle of the night in Swing States.” (The stolen data was voter lists, which are unrelated to counting ballots.",
    "Colorado’s Tina Peters, a county clerk who shared proprietary voting-system data with pro-Trump activists—drawing wide criticism from election professionals—is running against David Winney, another promoter of stolen election conspiracies, for the GOP nomination in the Colorado secretary of state race.",
    "“The lies about the 2020 election, the January 6 insurrection, the corrupt election reviews we are seeing happen all over the country, the election hijacking and interference attempts we are seeing happen in state legislatures, the threats against election workers, election deniers running for office.",
    "“To put it simply, the future of fair, professional and nonpartisan elections is on the line,” said a 2021 year-end report that tracked anti-voter legislation in 41 states produced by States United, Law Forward and Protect Democracy, all groups that support inclusive and accurate elections.",
    "In March, States United Action published a more troubling report, “Replacing the Refs,” that showed how the post-2020 trend of pro-Trump Republicans pushing for more restrictive voting legislation has morphed into scores of election-denying candidates running for state office.",
    "As of March 1, there were “at least 53 election deniers” running for governor in 24 states, “at least 11 election deniers” running for attorney general in 11 states, and “at least 22 election deniers” running for secretary of state in 18 states.",
    "It is so important to our system of democracy, and how the people of this country are represented, and their votes are counted, that we have nonpartisan trusted election officials in these positions that are making these decisions.",
    "“The Real Lie is Brad looking us in the eyes and telling us that 2020 was the most secure election in Georgia’s history,” said David Belle Isle, one of the Republican candidates in Georgia’s secretary of state race.",
    "“2021 was far worse than 2020,” said Minnesota Elections Director David Maeda, speaking at an election security webinar at the Hubert Humphrey School of Public Affairs at the University of Minnesota.",
    "Many of the election-denying candidates will not emerge as Republican nominees on the fall 2022 general election ballot, as some states have multiple candidates vying for the same statewide post.",
    "Many of their election-denying statements were made on social media platforms and podcasts that cater to right-wing audiences, screenshots of which States United included in its reports.",
    "Like-minded candidates also are running in Arizona, California, Florida, Idaho, Illinois, Kansas, Maine, Massachusetts, Michigan, Minnesota, Nebraska, Nevada, New York and Ohio.",
    "Nonetheless, Steve Marshall, the Republican incumbent in Alabama’s attorney general race, showed up at the White House in December 2020 to support Trump’s post-election fight.",
    "In 2021, these platforms championed post-2020 partisan audits (led by the Cyber Ninjas’ review in Arizona) and skepticism about vaccines in response to the COVID-19 pandemic.",
    "States United’s Ulmer said that the election-denying candidacies and the false beliefs they present about American elections pose a continuing threat to American democracy.",
    "And what we are seeing happen across the country is putting that system at risk.”\nThis article was produced by Voting Booth, a project of the Independent Media Institute.",
    "Arizona’s Shawnna Bolick, a state legislator running for secretary of state, sponsored a (failed) bill allowing the legislature to reject the voters’ presidential choice.",
    "The candidates for top statewide election administrator were most explicit in perpetuating the stolen election narrative and attacking key features of the voting process.",
    "“Politicians who continue to deny the results of the 2020 election want the power to overturn the will of American voters in the future if they don’t like the results.",
    "Those things are all connected, and they all drive distrust in our system.”\nThe candidates for attorney general were most oblique in their election-denial statements.",
    "Another Arizona Republican lawmaker running for secretary of state, Mark Finchem, has regularly invited other election conspiracy theorists to the state.",
    "Many have continued to claim that Trump was robbed of a second term despite numerous lawsuits in their states that never produced any proof that he won.",
    "These stances, which reflect their hoped-for office’s authority, are seen in their statements on social media, on podcasts, and in press clips.",
    "“Research suggests that hyper-partisan or poorly trained election administrators can negatively impact voter experience and affect outcomes.",
    "Today, Election Deniers are lining up to oversee voting at all levels of the system—from top state offices to precinct-level poll workers.",
    "The candidates for the different offices appear to have slightly different strategies with casting doubt on the 2020 election’s results.",
    "Wes Allen, a Republican candidate in Alabama’s secretary of state election, supported suing to overturn other states’ election results.",
    "Alaska’s Christopher Kurka said that questioning the results was patriotic and called for an audit and hand count of all 2020 ballots.",
    "Beyond driving media narratives, attorneys general participate in post-election litigation and governors certify presidential victors.",
    "“It’s so important to remember that it’s all connected,” said Lizzie Ulmer, senior vice president of communications for States United.",
    "“The anti-democracy playbook is simple: Change the rules, change the referees, in order to change the results,” their report said.",
    "“It’s a warning sign that the challenges that we saw launched at our free and fair elections in 2020 are far from over,” she said.",
    "Eddie Joe Williams, a former Arkansas state senator now running for secretary of state, won’t say that Biden won the election.",
    "And they have continued to claim that hidden hands secretly manipulated vote totals, even though they have produced no proof.",
    "In 2021, legislators introduced more than 260 bills that would interfere with the nonpartisan administration of elections.",
    "The candidates for governor were more explicit in their attacks on the voting process and President Biden’s legitimacy.",
    "Some of these platforms and personalities are now promoting Russia’s perspective on the war in Ukraine.",
    "This May and June, nearly 30 states will hold primary elections, including for these statewide offices.",
    "They’re dealing in emotion,” said Chris Piper, the former Virginia election commissioner, whom Gov.",
    "Georgia, similarly, has two candidates attacking the Republican incumbent, Brad Raffensperger.",
    "Top Republican election officials in Arizona and Georgia said there were no vote dumps.)",
    "“And while some have tried to downplay those threats, or move on from 2020, we cannot.",
    "Glenn Youngkin, a Republican elected last fall, recently replaced with Susan Beals.",
    "It’s all connected.”\n“It’s critical to pay attention to this trend,” it continued.",
    "They have attacked media outlets that report that Biden’s victory was legitimate.",
    "But governors and attorneys general also have roles in elections.",
    "“They’re not dealing with facts, obviously.",
    "Conspiracy-minded secretaries of state?"
  ]
}