{
  "id": 10692,
  "mediaId": 8322,
  "date": "2022-03-10",
  "headline": "Stefanik endorses Schumer's challenger for Senate",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Stefanik.jpg",
  "link": "https://www.foxnews.com/politics/stefanik-endorses-schumer-challenger-new-york-senate",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marisa Schultz",
  "authorUrl": "https://www.foxnews.com/person/s/marisa-schultz",
  "termIds": [
    4905,
    2272,
    2714,
    2976,
    392,
    1489,
    1126,
    1433,
    6678,
    6441
  ],
  "sentences": [
    "\"I am grateful for Elise’s friendship, her counsel, and I look forward to working alongside her to push back against Democrat one-party rule as we work to fight for the forgotten middle class, break the back of government sanction neglect, and build an America that works for ‘We The People’ once again,\" Pinion said in a statement.",
    "STEFANIK, IN FIRST SENATE ENDORSEMENT OF 2022 MIDTERMS, THROWS SUPPORT BEHIND OHIO GOP CANDIDATE JANE TIMKEN\n\"Senator Schumer has never been more vulnerable to defeat, and our party has never fielded a candidate more capable in that quest than Joe Pinion.",
    "EXCLUSIVE: Rep. Elise Stefanik, R-N.Y., endorsed Republican Joe Pinion for New York's U.S. Senate seat in his bid to defeat Senate Majority Leader Chuck Schumer, D-N.Y., in November and to retire the longtime politician from Congress.",
    "While New York is a traditional stronghold for Democrats, both Stefanik and Pinion hope Republicans will make inroads this November based on President Biden's low approval rating and the new perspective Pinion can offer.",
    "\"Joe Pinion brings fresh ideas and a renewed perspective to a state crying out for a new generation of vibrant, principled, conservative leadership in the U.S. Senate,\" Stefanik said.",
    "Joe has the skills and vision necessary to articulate the reasons why Chuck Schumer can no longer be trusted to represent the people of New York,\" Stefanik said.",
    "\"I am proud to endorse Joe Pinion for U.S. Senate in my home state of New York,\" Stefanik said in an exclusive statement to Fox News Digital.",
    "Pinion, an entrepreneur and former TV anchor on Newsmax, earned the support of New York Republicans last week at the state party convention.",
    "\"For 24 years, Chuck Schumer has been on the wrong side of practically every major issue plaguing New Yorkers and Americans alike.\"",
    "He started in Washington in 1981 as a congressman and has risen through the ranks to become the most powerful man in the Senate.",
    "Pinion said he was \"honored\" to receive Stefanik's support and predicted he'll be one day working with her to help New Yorkers.",
    "That made Pinion the first Black candidate nominated by either major party for the U.S. Senate in New York, Stefanik noted.",
    "A recent Siena College poll found 47% of registered New York voters had a favorable opinion of Schumer.",
    "Schumer is running for a fifth term in the U.S. Senate.",
    "A Schumer spokesperson declined to comment.",
    "Stefanik is the No.",
    "3 House Republican."
  ]
}