{
  "id": 10979,
  "mediaId": 2702,
  "date": "2022-03-12",
  "headline": "Bipartisan group of senators to meet with officials, visit refugee sites in Poland",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/ukrainerefugees_030722ap.jpg?w=1280",
  "link": "https://thehill.com/policy/international/597988-bipartisan-group-of-senators-to-meet-with-officials-visit-refugee-sites/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Dress",
  "authorUrl": "https://thehill.com/author/brad-dress/",
  "termIds": [
    0
  ],
  "sentences": [
    "Portman said in a statement that the delegation will send a “clear message” about the U.S.’s gratitude to the Polish people “for their support of Ukraine and their offer of providing fighter jets, as the people of Ukraine continues to endure brutal Russian atrocities.”\nBlumenthal said during the trip he will “continue pressing for America to provide more ammunition, Javelin and Stinger missiles, fighter airplanes, and other lethal aid.”\n“The Ukrainian people are inspiring the world in their bold, brave fight for freedom,” the Connecticut senator said in a statement, calling the assault on Ukraine a “brutal, savage invasion.”\n“I will bring back to Connecticut an eyewitness account of how we can help offer more support,” he said.",
    "“Poland has been a stalwart ally to Ukraine, welcoming Ukrainian refugees and providing critical resources during this unprovoked attack.”\n“We will make clear our commitment to stand with the Ukrainian and Polish people against Vladimir Putin,” she continued.",
    "), Rob Portman (R-Ohio), Richard Blumenthal (D-Conn.) and Amy Klobuchar (D-Minn.) traveled to Poland to reaffirm the U.S.’s commitment to assisting Poland, Ukraine and other allies during the conflict, according to a press release from Wicker’s office.",
    "“I am glad to visit Poland as we work together to halt Putin’s advance.”\nMore than 2 million people have fled Ukraine since Russian forces invaded on Feb. 24, with hundreds of thousands of refugees crossing the border into neighboring Poland.",
    "The Defense Department pushed back against the offer, however, calling it “untenable.” A U.S. defense official said Wednesday that American and Polish officials were still discussing how Poland could transfer the jets to Ukraine.",
    "A bipartisan group of U.S. senators on Saturday traveled to Poland, where they will visit refugee sites in the country and meet with Polish officials as Russia’s invasion of Ukraine extends into its third week.",
    "In a statement, Wicker said Russian President Vladimir Putin’s “unprovoked assault on Ukraine has threatened to plunge Europe into the deadliest conflict” since World War II.",
    "This comes after Poland earlier this week proposed sending its MiG-19 fighter jets to a U.S. air base in Germany so that the U.S. could then transfer them to Ukraine.",
    "She said the senators will meet with Ukrainian refugees and aid workers, military and government leaders and U.S. soldiers stationed in Poland.",
    "“I am proud to stand with my colleagues from both sides of the aisle with our friend and ally Poland,” Klobuchar said in a statement.",
    "“Putin’s continued attack on a sovereign nation demands a strong and united response from the U.S and our NATO allies,” Wicker said.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Vice President Harris also traveled to Poland this week, where she met with displaced people from Ukraine.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Roger Wicker (R-Miss.",
    "Sens."
  ]
}