{
  "id": 11559,
  "mediaId": 2702,
  "date": "2022-03-12",
  "headline": "??Sunday shows preview: Russian invasion in Ukraine extends into third week",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/biden_g7_ap_0311.jpg?w=1280",
  "link": "https://thehill.com/homenews/sunday-talk-shows/597979-sunday-shows-preview-russian-invasion-in-ukraine-extends-into/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Vakil",
  "authorUrl": "https://thehill.com/author/caroline-vakil/",
  "termIds": [
    0
  ],
  "sentences": [
    "Kirby is scheduled to appear on ABC’s “This Week” while Portman is set to appear on CNN’s “State of the Union” and Risch on “Fox News Sunday.”\nWhite House national security adviser Jake Sullivan is scheduled to appear on NBC’s “Meet the Press,” CBS’ “Face the Nation” and CNN’s “State of the Union.”\nThe Biden administration also took steps this week to further isolate Russia from the world economy by announcing a ban on Russian oil, natural gas and coal imports following vocal bipartisan support for such a move.",
    "“Fox News Sunday” — Deputy Secretary of State Wendy Sherman; Sen. Jim Risch (R-Idaho)\nFox News Channel’s “Sunday Morning Futures” — Former Secretary of State Mike Pompeo; Sen. Lindsey Graham (R-S.C.); former director of national intelligence John Ratcliffe; Stephen Miller, Founder, America First Legal; Garry Kasparov, Chairman of Renew Democracy Initiative\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "International Monetary Fund managing director Kristalina Georgieva and Allianz chief economic adviser Mohamed El-Eria are both scheduled to appear on CBS’ “Face the Nation.”\nBelow is the full list of guests scheduled to appear on this week’s Sunday talk shows:\nABC’s “This Week” — Defense Department spokesman John Kirby; Maksym Kozytskyy, governor of Lviv Province, Ukraine.",
    "That idea, too, was met with resistance from the Biden administration, with Pentagon press secretary John Kirby saying on Tuesday “we do not believe Poland’s proposal is a tenable one.”\nKirby later elaborated that there was concern that Russia could perceive the move as escalatory.",
    "“The intelligence community has assessed that the transfer of MiG-29s to Ukraine may be mistaken as escalatory and could result in significant Russian reaction that might increase the prospects of a military escalation with NATO,” the Pentagon press secretary said.",
    "Ukrainian officials have urged for a no-fly zone – something that has been met with resistance in the United States over concerns it could segue into a larger armed conflict involving U.S and its allies – and military planes.",
    "That move prompted over 40 Republican senators, including Senate Ukraine Caucus co-chair Rob Portman (Ohio) and Sen. James Risch (Idaho) to call on President Biden to expedite airpower and air defense systems to Ukraine.",
    "The world should join together in calling on President Putin and his regime to immediately stop its ongoing assault against Ukraine and withdraw its military forces,” the nations said in a joint statement on Friday.",
    "Americans are bracing for higher prices at the pump, though a Wall Street Journal poll from earlier this week indicates the move has approval from a majority of Americans in both parties despite the rising prices.",
    "The Russian invasion in Ukraine, now in its third week, and the recent moves by the Biden administration and its allies to further economically isolate Moscow are expected to dominate this Sunday show circuit.",
    "“If they carry out carpet-bombings and wipe off the historic memory of the entire region, the history of Kyivan Rus, the history of Europe, they could enter Kyiv,” Zelensky said, according to NBC News.",
    "Biden on Friday also announced that the Group of Seven (G-7) nations would be ending Russia’s preferential trade status, also known as the “Permanent Normal Trade Relations” (PNTR).",
    "CBS’ “Face the Nation” — Sullivan; International Monetary Fund Managing Director Kristalina Georgieva; Allianz Chief Economic Adviser Mohamed El-Erian; Pfizer CEO Albert Bourla.",
    "“We are united in our determination to hold President Putin and his regime accountable for this unjustified and unprovoked war that has already isolated Russia in the world.",
    "Ukrainian President Volodymyr Zelensky vowed in a news conference on Saturday that it would take carpet bombings for Russian soldiers to enter the capital of Kyiv.",
    "Rob Portman (R-Ohio); Vitali Klitschko, mayor of Kyiv, Ukraine; (noon EDT) Sen. Amy Klobuchar (D-Minn.); Latvian President Egils Levits.",
    "NBC’s “Meet the Press” — White House national security adviser Jake Sullivan; former Attorney General William Barr; former U.S.",
    "Poland offered to deploy its fleet of MiG-29 fighter jets to Germany so that they could be transferred by the U.S. to Ukraine.",
    "In the U.S., it allows for Russia goods to be subject to lower tariffs than goods from other countries not under that status.",
    "Biden also said that the U.S. would be banning Russian diamond, seafood and spirits imports.",
    "On Saturday, Biden directed the drawdown of $200 million in defense aid to Ukraine.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "CNN’s “State of the Union” — (9 a.m. EDT) Sullivan; Sen.",
    "Ambassador to Ukraine Marie Yovanovitch."
  ]
}