{
  "id": 13467,
  "mediaId": 8379,
  "date": "2022-03-19",
  "headline": "Top Ohio Republican Senate candidates to debate on Monday",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/03/1-2.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/your-local-election-hq/ohio-gop-senate-candidates-square-off-for-first-time-monday/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jen Steer",
  "authorUrl": "https://fox8.com/author/jensteer8/",
  "termIds": [
    4839,
    2290,
    1126,
    1489,
    6067,
    6077,
    6104,
    6474,
    6721
  ],
  "sentences": [
    "CLEVELAND (WJW) — The top five Republican candidates battling to appear on the November ballot for Ohio’s Senate seat will square off during a debate at Fox 8 News in Cleveland Monday.",
    "Those stations are WDTN 2 News in Dayton, NBC4 in Columbus, WKBN/WYTV in Youngstown, WTRF in Wheeling, West Virginia/Steubenville and FOX 8 News.",
    "If there is a follow-up question or rebuttal, the candidate will have 30 seconds to respond and 15 seconds for clarification, if needed.",
    "The same debate opportunity was offered to the Democratic Senate candidates, however, not enough candidates met the requirements.",
    "Rob Portman endorsed Timken, many of the candidates are still courting the endorsement of former President Donald Trump.",
    "The candidates:\nMatt Dolan: state senator, former state representative, son of Cleveland Guardians owner Larry Dolan.",
    "JD Vance: venture capitalist, author of “Hillbilly Elegy.”\nEach candidate will get 60 seconds to answer a question.",
    "It comes days after a heated exchange between two candidates, Mike Gibbons and Josh Mandel, at a forum in Columbus.",
    "Josh Mandel, former Ohio treasurer, former state representative, previously ran for U.S. Senate in 2012 and 2018.",
    "A February poll from Emerson College and The Hill showed 39% of Republican primary voters are undecided.",
    "Mike Gibbons: investment banker, Ohio Finance Co-Chair for Donald J. Trump for President in 2016.",
    "He’s followed by Mandel with 15%, Vance with 8%, and Timken and Dolan with 6% each.",
    "We will be reminding the candidates of those times throughout the night.",
    "The debate can be viewed on Nexstar stations across the Buckeye state.",
    "How to watch:\nThe hour-long debate starts at 7 p.m. at FOX 8 News.",
    "It’s hosted by NBC4’s Colleen Marshall and FOX 8’s Joe Toohey.",
    "The debate will also stream on each station’s website.",
    "Jane Timken: former chair of the Ohio Republic Party.",
    "A bell will ring when time is up.",
    "Gibbons led GOP voters with 22%.",
    "The polls:\nWhile outgoing Sen."
  ]
}