{
  "id": 17805,
  "mediaId": 8372,
  "date": "2022-03-02",
  "headline": "Morrow County Republicans host candidates at Lincoln Day Dinner",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/29/2022/03/web1_Gibbons.jpeg",
  "link": "https://www.morrowcountysentinel.com/news/42500/morrow-county-republicans-host-candidates-at-lincoln-day-dinner",
  "mediaOutlet": "morrowcountysentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "morrowcountysentinel",
  "authorUrl": "https://www.morrowcountysentinel.com/author/englewoodindependent-2-13",
  "termIds": [
    0
  ],
  "sentences": [
    "Candidates speaking at the event included: Gary Stewart for Joe Blystone for governor, Ted Coulter for Jim Renacci for governor, Jim Shaw for Dave Yost for Ohio attorney general, Mike Gibbons for U.S. Senate, Neil Patel for U.S. Senate, Mark Pukita for U.S. Senate, Jane Timken for U.S. Senate, Pat DeWine for re-election for Ohio Supreme Court Justice, Andrew King for 5th District Court of Appeals, and Craig Baldwin for 5thDistrict Court of Appeals.",
    "And candidates for districts included Troy Balderson for U.S. Congress, Darrell Kick for Ohio House 70th District, Beth Lear for Ohio House 61stDistrict, Shawn Stevens for Ohio House 61st District, Riordan McClain for Ohio House, Jack Etheridge for State Central Committee Man, Fred Daily for State Central Committee Man, Melanie Lengehan for State Central Committee Woman, and Carol O’Brien for State Central Committee Woman.",
    "“As an Army Green Beret who still serves as a reservist, I hate to use a famous Marine line from a movie but I have to tell you: You want me on that wall to fight back and make sure we keep our elections honest; and that’s exactly what we’re going to do,” he said.",
    "MARENGO – With Ohio ‘s legislative and congressional districts maps still in deliberation by the Redistricting Commission, the May 3 primary is in question too – whether the primary will be delayed or if there will be more than one primary are two possibilities.",
    "“The first time I met Frank LaRose he was running for Secretary of State, and he told me he was in the Army in the 101st Airborne, and he was a Green Beret — to me that was enough; I was going to vote for this guy,” he said.",
    "Special thanks were attended to Highland Local School District staff and students, Somerlot Catering for the dinner, Morrow County Republican Women, and the Morrow County Dairy Association.",
    "County candidates in attendance included Jon Mason for county commissioner, Tom Whiston for re-election for county commissioner, and Patricia Davies for county auditor.",
    "The annual event was held Feb. 21 at Highland High School with Ohio Secretary of State Frank LaRose as quest speaker and numerous candidates or proxies attending.",
    "We have to keep doing that work because our elections are under threat.”\nHe said it was important for Ohioans to understand the source of the election threats.",
    "The second threat to the election process, according to LaRose, is “activists trying to take over the way elections are administered at the federal level.",
    "LaRose cited the efforts of Democrat Eric Holder, U.S. Attorney General under President Obama, who is now a litigator addressing gerrymandering reform.",
    "“He does a great job as Secretary of State.”\n“I have two main missions in this office,” LaRose said, “One is to help people start new businesses.",
    "He outlined considerations the commission is pursuing to finalize the district maps, which include possibly postponing the primary election.",
    "It’s something you don’t often hear about but we’ve had a couple of record setting years the last two years in entrepreneurship.",
    "The first one, he said, is activist lawsuits – activists filing lawsuits, rather than creating change by passing legislation.",
    "But at the Morrow County Republican Party’s Lincoln Day Dinner, candidates knew why they should have constituents’ votes.",
    "In 2020 we had 176,000 new Ohio businesses started and last year we had 196,000 new Ohio businesses started.",
    "In a national interview I called it the ‘zombie bill’ because it keeps coming back from the dead,” he added.",
    "I have a job of making it easy to vote and hard to cheat; and that’s exactly what we do in Ohio.",
    "“Eric Holder has committed to raising $15 billion to defeat Republican Secretaries of State.",
    "Thankfully we’ve been able to defeat it three times but it keeps coming back from the dead.",
    "And the third threat to the election process is defeating Republican Secretaries of State.",
    "“The other side of this office,” LaRose continued, “is my role as chief elections officer.",
    "That’s great news that people are engaging in the free market economy in Ohio.",
    "I want to get government out of the way and keep taxes low so they can thrive.",
    "“They want to put Washington bureaucrats in charge of how we run elections.",
    "He listed his first five that he wants to defeat, and I’m on that list.",
    "I don’t have to tell you what an unmitigated disaster that would be.",
    "They want to put a liberal activist in charge of your elections.",
    "Morrow County Republican Chair Dan Osborne introduced LaRose.",
    "LaRose is a member of the Redistricting Commission.",
    "Now, why do they want to do that you might ask.",
    "It’s very simple."
  ]
}