{
  "id": 276,
  "mediaId": 8491,
  "date": "2022-02-24",
  "headline": "Ukraine poses test for fractured GOP",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/02/AP21201695723273-1.jpg?w=1280",
  "link": "https://www.wkbn.com/news/national-world/ukraine-poses-test-for-fractured-gop/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Hill via Nexstar Media Wire",
  "authorUrl": "https://www.nxsttv.com/nmw/?post_type=profile&p=173669",
  "termIds": [
    0
  ],
  "sentences": [
    "“But there’s also the tension with Republicans who’ve been around for a while, remember the Cold War, remember the fight for freedom for when the Soviet Union broke up and all the breakaway republics moving towards democracy.”\nThat intraparty dispute is playing out in real time in Washington and across the U.S. as Russian troops and equipment roll into Ukrainian land controlled by Moscow-backed rebels, which Russian President Vladimir Putin this week recognized as independent.",
    "Meanwhile, popular Fox News host Tucker Carlson has taken that view a step further, asking on air, “Why is it disloyal to side with Russia but loyal to side with Ukraine?”\n“Hillbilly Elegy” author and another Ohio GOP Senate candidate JD Vance has been arguably the most outspoken on the campaign trail against involvement, saying on Steve Bannon’s podcast last week that “I don’t really care what happens to Ukraine” and pushing for more focus on the U.S. southern border.",
    "When critics rebuked the statement, he issued a defensive clarification, saying “we all pray for peace for the innocent Ukrainians caught up in this” but that “the Russia-Ukraine border dispute has nothing to do with our national security….”\nThose comments have caused alarm for some Republicans more aligned with the establishment flank of the GOP who believe in a strong foreign policy – particularly when it comes to Russia.",
    "Senate Minority Leader Mitch McConnell (R-Ky.) praised Biden’s deployment of troops but this week pressed for the “toughest possible sanctions.”\nSen. Lindsey Graham (R-S.C.), a longtime Russia hawk, said Biden’s early sanctions on Russian banks, prominent individuals and the country’s sovereign debt did not go far enough and pressed for more forceful U.S. involvement on Ukraine’s behalf.",
    "“One can be critical of decisions that Biden makes or decisions he doesn’t make without taking the step of essentially suggesting that whatever Putin wants to do is fine.”\nNot helping Republicans’ overall messaging efforts is former President Donald Trump, who called Putin’s invasion “genius” Tuesday before saying that an invasion “never would have happened” had he been in office.",
    "He’s walking all over you and our allies.”\nAnd on the campaign trail, Ohio Senate GOP candidate Jane Timken said “the U.S. must respond with strength and stand with Ukraine.”\nThose statements fall largely within a historical GOP tenet that a foreign policy guided by robust involvement overseas best keeps America safe.",
    "“As long as we operate in a space of politics being performance art, that’s going to continue to go in very different places than where Republicans have traditionally been.”\nIt’s still unclear if the disagreement will make a difference on the midterm election map.",
    "Veteran GOP senators have voiced support for a strong response to Moscow’s aggression, pushing President Joe Biden to enact stricter sanctions and backing the deployment of thousands of U.S. troops to European allies to deter Russian advancement beyond Ukraine.",
    "Opinions favoring more isolationist policies bubbled among some Republicans after lengthy wars in Iraq and Afghanistan before exploding during Trump’s administration, when he advocated for an “America First” foreign policy to limit foreign imbroglios.",
    "The Republican establishment is vocally advocating for muscular U.S. sanctions against Moscow after Russia invaded two breakaway areas in Ukraine controlled by separatist militants, bashing the first tranche from the Biden administration as too weak.",
    "“The contrast between those two ideas and Democrats who have failed in the last two major foreign policy tests could not be starker,” one GOP strategist working on Senate races said, also noting last year’s bloody withdrawal from Afghanistan.",
    "“It’s no surprise that as Trump has, to some extent, receded from the front pages of politics that other people are going to take up that mantle and take it either in the direction that Trump was going in or veer it slightly,” Heye said.",
    "And while part of that is likely a partisan response to the fact that the deployments were ordered by Biden, it still stands in stark contrast to the legacy of a party that has previously not shied away from leaning on the U.S. military.",
    "On top of that, foreign policy has historically not significantly moved the needle in election years, and while Republicans are divided on what the U.S. should do regarding Ukraine, they almost universally bash Biden’s early response.",
    "Trump upended Republican policies on issues across the board, but he made a large mark on foreign policy, instigating fights with European allies over trade while seeking warmer relations with autocracies like Russia and North Korea.",
    "But populist GOP lawmakers and candidates are downplaying Ukraine’s significance to the U.S and advocating for a lighter touch, marking a reversal from the party’s orthodoxy, which historically favored heavy U.S. involvement abroad.",
    "As somebody who grew up at a time and came of age politically at a time when we defined ourselves in part in opposition to the Soviet Union, it’s a troubling way to move forward,” said Doug Heye, a former House leadership aide.",
    "“That’s the contrast that voters are looking at.”\nBut still, the midterms will offer valuable tea leaves over where the GOP is heading – and how a future Republican president could view America’s position in the world.",
    "(The Hill) — Republicans in Washington and on the campaign trail find themselves riven with divisions over Russia’s invasion of Ukraine, exposing the power of a newly emboldened isolationist strain within the GOP.",
    "“You’ve seen a big split in the party, and it’s clear that the more restrained view is a dominant view in the Republican Party today.”\nThat trend could continue given Republicans’ fierce loyalty to Trump.",
    "It’s unclear if those attitudes will change now that a more significant Russian offensive against Ukraine is underway, but the divisions mark a culmination of a years-long internal dispute.",
    "Republicans are bullish about their chances to retake both the House and Senate this year, given Biden’s low approval ratings and grumbling over inflation and mask and vaccine mandates.",
    "Even if Republicans don’t believe that a more isolationist foreign policy is beneficial, candidates may lean into it to appeal to the former president’s fervent supporters.",
    "“You said a couple of years ago that Putin does not want you to win because you’re the only person that can go toe-to-toe with him,” he said of Biden at a press conference.",
    "“Obviously, the more vigorous wing of the party was in charge during the George W. Bush years, and the more restrained view prevailed during the Trump years.",
    "And I think that’s always going to be a debate within the party,” said Darling, who used to serve as an aide to Sen. Rand Paul (R-Ky.), a vocal isolationist.",
    "But in the halls of Congress and elsewhere, a growing wing of Republicans pushing for fewer foreign entanglements also made its voice heard.",
    "“Many Republicans are concerned about getting too engaged in this faraway conflict because it’s not something that’s immediate,” he added.",
    "In a Quinnipiac Poll released last week, 47 percent of Republicans opposed sending troops to Europe, while just 43 percent backed it.",
    "Russia launched a more sprawling invasion Thursday morning local time, with explosions heard in the Ukrainian capital of Kyiv.",
    "earlier this month pressed Biden to refrain from deploying more troops to Europe and said that Ukraine should not join NATO.",
    "That’s where obviously general elections will play a role.”\nCopyright 2022 Nexstar Media Inc. All rights reserved.",
    "“I think Republicans have mixed feelings about it,” said Brian Darling, a GOP strategist and former Senate aide.",
    "“We’re going to have to find out,” Heye said when asked which GOP school of thought will prevail.",
    "“Well right now, Mr. President, you’re playing footsy with Putin and you’re losing.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "“There are some who are taking a more pro-Russian posture.",
    "“That’s where primaries will play a role.",
    "Sen. Josh Hawley (R-Mo.)"
  ]
}