{
  "id": 368,
  "mediaId": 2745,
  "date": "2022-02-21",
  "headline": "Opinion J.D. Vance’s attack on Gen. Barry McCaffrey is obscene. It’s also not unusual for today’s GOP.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/H244OYUPVMI6ZDO5KIJWTCGSMM.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/02/21/jd-vance-attack-on-barry-mcaffrey-shows-decline-of-gop-ohio/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5848,
    2143,
    2290,
    5047,
    4306,
    2736,
    3054,
    1126
  ],
  "sentences": [
    "The debased tone was set by Trump in 2015 when he insulted Sen. John McCain, another war hero, by saying, “I like people who weren’t captured.” When Trump went on to win the nomination and the presidency, the message received by junior-league strivers, such as Vance and Mandel, was that campaigns should be conducted with no regard for truth or decency, that restraint is for “losers,” and that the more deranged your Twitter feed, the better, to show that you’re not — horrors — a creature of the “establishment.”\nTo read the Twitter feeds of Mandel and Vance is to see where this nihilistic mind-set leads.",
    "Mandel, who is Jewish, caters to Christian fundamentalists by saying, “Separation of church and state is a myth.” As chronicled in Politico, he has also called Reps. Ilhan Omar (D-Minn.) and Rashida Tlaib (D-Mich.) “terrorist spokesmen,” described Rep. Alexandria Ocasio-Cortez (D-N.Y.) as “a pollutant,” and compared Afghan refugees to “alligators.” Naturally, both Vance and Mandel have embraced the ”big lie” that Trump won the 2020 election.",
    "Vance, who once called Trump “cultural heroin” and a demagogue leading “the white working class to a very dark place,” today tweets that “Trump not having social media right now is a genuine loss for the country.” Mandel, who endorsed Sen. Marco Rubio (R-Fla.) in the 2016 primaries and once held Trump at arm’s length, now says: “I’m pro-God, pro-gun, pro-Trump.”\nThere is no line these shameless opportunists will not cross.",
    "These right-wing performance artists trash Anthony S. Fauci (“Why is it that Anthony Fauci is still walking free?” Vance demands); denounce Canadian Prime Minister Justin Trudeau as a dictator for clearing roads of truckers protesting vaccine mandates; promote discredited theories about Hillary Clinton spying on Trump; and engage in cringing servility to Trump, whose endorsement they desperately covet.",
    "While Vance was spending his time in the military writing news releases about aircraft maintenance, McCaffrey was earning four stars on his epaulets and receiving three Purple Hearts, two Distinguished Service Crosses (the Army’s second-highest award for valor) and two Silver Stars.",
    "It all began when Vance said during an appearance on a right-wing podcast: “I don’t really care what happens to Ukraine.” That led to a withering riposte from retired Gen. Barry McCaffrey: “JD Vance is a shameful person unsuitable for public office.",
    "Oh, by the way, how much do you stand to gain financially from a war with Russia, Barry?”\nVance may think his brief stint in the Marine Corps (where he did public affairs work) gives him the standing to insult one of America’s greatest war heroes.",
    "She hasn’t gone nearly as far as they have, but she is playing catch-up: Her new commercial implies that Vance and Mandel are trying to compensate for sexual inadequacies and shows her cozying up to Trump and carrying a shotgun.",
    "These faux populists, who are, in fact, exemplars of elitist striving, are locked in a race to the bottom to see who can say the dumbest, vilest things to rouse the MAGA hordes.",
    "His comments are those of a stooge for Russian aggression.”\nRather than slink off in shame, Vance shot back: “Your entire time in military leadership we won zero wars.",
    "Ohio demonstrates that, while some GOP candidates will act Trumpier than others, there is simply no room in the party for anyone who isn’t at least a bit Trumpy.",
    "If you want to see the calamitous impact of Trumpism on the GOP, look no further than the party’s primary to succeed Portman, who is retiring.",
    "In the latter conflict, he commanded the 24th Infantry Division as it executed the “left hook” that pulverized Iraqi forces in Kuwait.",
    "Vance may have just won the offensiveness Olympics — and lost his soul — by trashing one of America’s most distinguished soldiers.",
    "The nod might go to a more establishment candidate, such as former state party chair Jane Timken, who has Portman’s endorsement.",
    "There are no words to describe what Vance said about McCaffrey, accusing the storied general of cowardice and corruption.",
    "Which means that there is no hope for the party of eminent Ohioans such as Ulysses S. Grant and William Howard Taft.",
    "You drank fine wine at bull---- security conferences while thousands of working class kids died on the battlefield.",
    "Ohio is sometimes called the “Mother of Presidents” because it has produced seven occupants of the White House.",
    "Both are onetime moderate conservatives doing their best imitation of Trump — or is it Marjorie Taylor Greene?",
    "That was, in fact, a war that we won — in no small part because of McCaffrey’s inspired leadership.",
    "Rob Portman, former governor John Kasich — have been of the bland, mainstream variety.",
    "Of course, it’s possible that neither Vance nor Mandel will win the GOP nomination.",
    "Until recently, it has been a battleground state whose Republicans — e.g., Gov.",
    "They are also all too characteristic of Republican politics today.",
    "The two loudest voices in the contest belong to J.D.",
    "He served in both the Vietnam and Gulf wars.",
    "They are monstrous, despicable, obscene.",
    "His animadversions are not just false.",
    "Vance and Josh Mandel.",
    "Mike DeWine, Sen.",
    "He is wrong."
  ]
}