{
  "id": 5417,
  "mediaId": 2919,
  "date": "2022-04-19",
  "headline": "North Canton City Schools address criticism of campaign ad filmed at Hoover High School",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/4ad5385/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fd0%2Fde%2F4986aa264a96b1e5e16abe06cca3%2F04-19-22-timken-campaign-ad-controversy.jpg",
  "link": "https://www.news5cleveland.com/news/local-news/north-canton-city-schools-address-criticism-of-campaign-ad-filmed-at-hoover-high-school",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Catherine Ross",
  "authorUrl": "https://www.news5cleveland.com/catherine-ross",
  "termIds": [
    5722,
    3074,
    5581,
    601,
    1513,
    6454,
    6455
  ],
  "sentences": [
    "It says, “The rental of our facilities is a business transaction and should not be interpreted as an endorsement of political candidates, organizations, or their beliefs or platform.”\nBarros said despite the district saying any rental is not an endorsement, many LGBTQ+ students feel the ad filmed in Hoover’s gym associates the school with the political message.",
    "When News 5 reached out, the district provided a copy of the comments read by North Canton City Schools Superintendent Jeff Wendorf during a recent Board of Education meeting:\n“At North Canton City Schools, we value and respect each student, which is reflected in our district values of relationships, respect, and integrity.",
    "as a former college athlete, mom to a daughter, and Ohio’s next senator, Jane will always protect opportunities for women that are under attack.” Mandi Merritt\nThe superintendent said in his remarks during the Board of Education meeting that the district is currently reviewing its facility use and rental policies.",
    "“If they do allow outsiders to use the school facilities, then they have to have neutral, non-discriminatory use,” he said, explaining there must be a clear policy that allows all forms of free speech and does not pick and choose which outside parties have access to the facilities.",
    "We are currently reviewing our facility use and rental policies, guidelines, forms, and processes.”\nBarros, who represented the Hoover GSA at the meeting, said many members were not satisfied with the district’s response.",
    "Case Western Reserve University law professor Jonathan Entin explained public schools, like Hoover High School, are able to allow outside parties to rent their facilities for non-school functions.",
    "NORTH CANTON, Ohio — A Northeast Ohio school district is promising to review its rental policies after controversy surrounding a campaign advertisement filmed in a high school gym.",
    "Some students at Hoover High School in North Canton are raising questions about whether political candidates should be allowed to use public schools for campaign ads at all.",
    "Others see the criticism of transgender athletes as discrimination against a small group of students who are already more likely to face bullying and depression.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "Barros and his fellow board members from the Hoover Gay-Straight Alliance (GSA) brought their concerns to the school administration and superintendent.",
    "Barros, who is transgender, explained he and other LGBTQ+ students at the high school were surprised and disappointed when they saw the Timken ad.",
    "It is regrettable that some of our students, especially our LGTBQ+ community, have felt hurt by the content of the message filmed at our school.",
    "A Jane Timken spokesperson issued the following statement on the subject:\n“This is about standing up for fundamental fairness in girls’ sports.",
    "In March, the University of Pennsylvania swimmer became the first openly transgender NCAA Division 1 athlete to win a national championship.",
    "We do not endorse or support messages, ideals, beliefs, or platforms of individual political candidates or political organizations.",
    "Some conservative politicians believe transgender female athletes have an unfair biological advantage over their cisgender peers.",
    "“I think the student voices are the most important in this and it’s ridiculous that they would allow this to happen,” he said.",
    "“You’re letting them into our school, you’re letting them film this video and you’re letting Hoover represent this,” he said.",
    "“School officials might be a little reluctant because they don’t want it to look like they’re taking sides,” Entin said.",
    "The North Canton City Schools facility rentals webpage provides a disclaimer, similar to the superintendent’s statement.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "But I knew for a lot of students, this was going to be a huge deal,” said Ash Barros, a Hoover High School senior.",
    "He explained many public school districts avoid renting facilities to politicians to avoid appearing partisan.",
    "And almost immediately every single person online knew it was Hoover and wanted to do something about it.",
    "“But the Biden Democrats want to force our daughters to compete against men in the pool and on the court.",
    "Timken is standing in front of girls practicing basketball in a gymnasium as she introduces herself.",
    "The ad in question is a 30-second TV spot from Republican U.S. Senate candidate Jane Timken.",
    "The win triggered public debate over what’s become a highly politicized issue.",
    "As a mom and former college athlete, I know how important women’s sports are.",
    "Download now on your Apple device here, and your Android device here.",
    "“For me personally, I’m used to getting a lot of backlash.",
    "It was outrage, just from everybody who I knew,” he said.",
    "It’s outrageous.”\nThe ad shows a clip of Lia Thomas.",
    "They teach our girls to be winners,” she said.",
    "Learn more about our streaming options here.",
    "“It was very obviously Hoover High School.",
    "We're also on Amazon Alexa devices.",
    "“I’m Jane Timken."
  ]
}