{
  "id": 8976,
  "mediaId": 2537,
  "date": "2022-03-22",
  "headline": "Gender dominates GOP Ohio Senate debate as Mike Gibbons dismisses women's oppression",
  "image": "https://www.gannett-cdn.com/presto/2021/10/25/NCOD/7eedcb97-fc90-4e17-bfd8-5c381e65e41e-Senate_Forum_NJG_006.JPG?crop=2999,1687,x0,y152&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/03/22/ohio-senate-race-gender-takes-center-stage-during-gop-primary-debate/7125825001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    0
  ],
  "sentences": [
    "Gibbons was addressing questions about a previous interview, in which he said former Ohio Republican Party chair and GOP Senate challenger Jane Timken \"barely worked\" and insinuated that her money comes from her husband.",
    "U.S. Senate candidate Mike Gibbons said Monday that women were \"probably\" oppressed when they didn't have the right to vote as he defended previous claims that his only female opponent has never worked.",
    "Haley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "State Sen. Matt Dolan used the occasion to criticize Timken's time as party chair, saying Republicans lost Ohio Supreme Court seats now playing a key role in the redistricting process.",
    "The event came days after Gibbons and former state treasurer Josh Mandel sparred on stage during another debate, one of them appearing to use a derogatory term for women as an insult.",
    "Gender takes center stage\nTimken is married to former TimkenSteel CEO Ward Timken, Jr. and worked as an attorney and magistrate after graduating from Harvard University.",
    "In a statement Tuesday, she blasted Gibbons' remarks as \"misogynistic and anti-women\" and said his behavior at recent debates should disqualify him from the race.",
    "Timken is the only woman running in the GOP primary and released an ad earlier this year painting her rivals as \"guys who overcompensate for their inadequacies.\"",
    "Gibbons doubled down on his position Tuesday, saying Ohio needs a senator with experience who isn't \"spending family wealth on vanity runs for office.\"",
    "His comments fueled a larger discussion about women and gender during a debate in Cleveland between the five leading contenders in the GOP primary.",
    "\"You saw it on display on Friday night: two candidates who are more concerned about themselves and their bloviating and their bravado.\"",
    "Mandel highlighted her experience working at \"very challenging law firms doing complex cases\" and called Gibbons' comments insulting.",
    "\"I am sick and tired of hearing my opponents use the same tired tactics used by the left to label people as oppressed or oppressors.\"",
    "Mandel denies saying it, and Gibbons told a Cleveland radio host he doesn't remember the exchange because he went into \"fight mode.\"",
    "When asked about the ad on Monday, she argued some levity is allowed but said the race is ultimately serious business.",
    "Other candidates on stage Monday swept in to defend Timken and tout their pro-woman credentials as a knock on Gibbons.",
    "\"I think when (women) weren’t allowed to vote, they were probably oppressed,\" Gibbons said during Monday's debate.",
    "\"There were not a lot of women that were in combat in World War I or World War II,\" he said Monday.",
    "\"The left is hellbent our dividing our nation based on race, gender, and ethnicity,\" he said.",
    "To preface that, he noted: \"My wife has a master’s degree, so I respect women.\"",
    "\"I was pointing out exactly what’s going on in this race,\" Timken said.",
    "It’s like judging George Washington according to today’s standards.\"",
    "He also said he believes women haven't been oppressed.",
    "Were men oppressed because they had to go to war?",
    "I don’t know if oppressed is the right word.",
    "It was a different world, that’s all.\"",
    "Women were not subjected to that.",
    "\"That was men’s job at the time.",
    "\"But it was a different culture."
  ]
}