{
  "id": 9404,
  "mediaId": 2553,
  "date": "2022-03-28",
  "headline": "GOP Senate Candidate Blasts Transgender Swimmer Lia Thomas Competing In Women’s Sports In New Campaign Ad",
  "image": "https://dw-wp-production.imgix.net/2022/03/Untitled-design-21-copy-2-6.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/gop-senate-candidate-blasts-transgender-swimmer-lia-thomas-competing-in-womens-sports-in-new-campaign-ad",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dillon Burroughs",
  "authorUrl": "https://www.dailywire.com/author/dillon-burroughs",
  "termIds": [
    1679,
    2998,
    1489,
    392,
    855,
    1126,
    6589
  ],
  "sentences": [
    "“In Florida, we reject these lies and recognize Sarasota’s Emma Weyant as the best women’s swimmer in the 500y freestyle.”\nBy allowing men to compete in women's sports, the NCAA is destroying opportunities for women, making a mockery of its championships, and perpetuating a fraud.",
    "The 30-second ad called “Compete” shows Timken highlighting her background as a former female college athlete, blaming rules by the NCAA for allowing biological males to compete in women’s sports on the failed leadership of President Joe Biden and the Democratic Party.",
    "I am a 2016 Rio Olympian, represented Virginia Tech for the past 5 years, a 2 time ACC champion, 2 time All-American and 3 time honorable mention All-American,” wrote Virginia Tech swimmer Reka Gyorgy in a letter to the NCAA that she posted on Instagram.",
    "“Everyone has heard and known about transgender [swimmer], Lia Thomas, and her case including all the issues and concerns that her situation brought into our sport.”\n“She is doing what she is passionate about and deserves that right,” Gyorgy wrote.",
    "“On the other hand, I would like to critique the NCAA rules that allow her to compete against us, who are biologically women.”\n“I’m writing this letter right now in hopes that the NCAA will open their eyes and change these rules in the future.",
    "The Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "Florida Republican Governor Ron DeSantis signed a proclamation on Tuesday declaring that Sarasota native and Olympic silver medalist Emma Weyant was “the best women’s swimmer in the 500y freestyle” in last week’s NCAA championship.",
    "The Daily Wire reported:\nWeyant, who is a freshman at the University of Virginia, clocked a time of 4:34.99 last Thursday, falling behind Thomas during the final stretch of the 500-yard event.",
    "“By allowing men to compete in women’s sports, the NCAA is destroying opportunities for women, making a mockery of its championships, and perpetuating a fraud,” DeSantis said in a tweet.",
    "Ohio Republican Senate candidate Jane Timken blasted the NCAA and Democrats over transgender swimmer Lia Thomas competing in women’s sports in a new campaign ad released on Monday.",
    "It doesn’t promote our sport in a good way and I think it is disrespectful against the biologically female swimmers who are competing in the NCAA,” she added.",
    "“With all due respect, I would like to address something that is a problem in our sport right now and hurting athletes, especially swimmers,” Gyorgy wrote.",
    "pic.twitter.com/tBmFxFE3q6\n— Ron DeSantis (@GovRonDeSantis) March 22, 2022\nA variety of athletes have spoken out against the issue as well.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "In Florida, we reject these lies and recognize Sarasota's Emma Weyant as the best women's swimmer in the 500y freestyle.",
    "“But the Biden Democrats want to force our daughters to compete against men in the pool and on the court,” she added.",
    "The ad is expected to air on Ohio outlets and is available on YouTube and other locations online.",
    "The video then cuts to footage of Thomas competing in a women’s swimming event.",
    "“As a mom and former college athlete, I know how important women’s sports are.",
    "Timken is not the only Republican to speak out on the issue recently.",
    "They teach our girls to be winners,” Timken said in the video.",
    "Become a member now and join our mission.",
    "“My name is Reka Gyorgy from Hungary.",
    "Believe the same?"
  ]
}