{
  "id": 3292,
  "mediaId": 261,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Higher education funding highlights divisions among GOP candidates for governor at debate",
  "image": "https://www.gannett-cdn.com/presto/2022/04/19/PDTF/aed517e1-708e-4b57-9b99-60e8be7aacd2-Gop_candidats.jpg?crop=1065,599,x58,y704&width=1065&height=599&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/elections/2022/05/12/republican-governor-debate-livingston-county-howell/9750032002/",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Egan",
  "authorUrl": "https://www.freep.com/staff/2646657001/paul-egan/",
  "termIds": [
    2002,
    1844,
    428,
    2980,
    3064,
    3066,
    2791,
    2863
  ],
  "sentences": [
    "Mike Brown, of Stevensville; Norton Shores businesswoman Tudor Dixon; Oakland County \"quality guru\" and businessman Perry Johnson; Ottawa County real estate agent Ryan Kelley; Grand Haven financial adviser Michael Markey; Rebandt; Bloomfield Hills businessman Kevin Rinke; and Kalamazoo chiropractor Garrett Soldano.",
    "The Republican Party has historically been seen as the party of big business and CEO groups such as Business Leaders for Michigan have long pushed for improved university funding as a way of attracting top talent to Michigan and diversifying the state's economy to feature more higher-paying jobs.",
    "Some of the candidates Thursday spoke out against universities' diversity, equity and inclusion efforts, the fact that their campuses include large numbers of foreign students and the fact that many universities have large private endowments while charging high tuition.",
    "Laura Reyes Kopack, the association's government affairs director, said the annual meeting was Thursday and Craig was scheduled to speak at 5:45 p.m.  two hours ahead of the scheduled start of the Livingston County Republican Party debate.",
    "HOWELL  A Republican candidate for governor of Michigan said during a debate Thursday he would end state funding for public universities, and several other candidates said they would significantly cut funding for higher education.",
    "Though they differ on many details, the Republican candidates are generally critical of Whitmer for her handling of the coronavirus pandemic, saying she placed too many restrictions on businesses and schools for too long.",
    "Dixon and Johnson also face challenges to the validity of signatures on their nominating petitions, which, like the Craig challenges, are expected to be adjudicated by the Board of State Canvassers late this month.",
    "Though polls still show Craig leading the crowded field, his campaign has been buffeted by staff turnover, other signs of disarray, and challenges to the validity of his nominating petition signatures.",
    "But Craig spokesman Ted Goodman denied Thursday that Craig made such a commitment and said he had a prior commitment to speak at the annual meeting of the Mechanical Contractors Association of Detroit.",
    "Michigan Information & Research Service, one of the organizers, reported that Craig's campaign earlier confirmed he would participate in the debate and reserved a table for supporters.",
    "Almost without exception, they railed against vaccine mandates which have generally not existed in Michigan outside of requirements for certain employees in the health care sector.",
    "The higher education issue provided a rare point of division among the eight candidates who participated in the debate sponsored by the Livingston County Republican Party.",
    "Johnson took a middle stance on the higher education issue, saying \"education is critical,\" but \"I agree with much of what has been said\" by the other candidates.",
    "They are some of our greatest assets,? said Dixon, who cited Wayne State University's national reputation and innovations emerging from research at MSU.",
    "The business group announced Thursday that participation in the debate will be limited to five candidates  Craig, Johnson, Kelley, Rinke and Soldano.",
    "Some of the candidates  Soldano, Rinke, and Kelley  did not go as far as Rebandt but said they would make big cuts to university funding.",
    "More than 700 Republicans packed a Howell banquet hall for the Livingston County Republican Party debate, which lasted about two hours.",
    "The Detroit Regional Chamber is planning a June 2 Republican gubernatorial debate at its Mackinac Policy Conference on Mackinac Island.",
    "Notably absent from the debate was former Detroit Police Chief James Craig, who was once seen as the clear Republican front-runner.",
    "Significant cuts should be made and some public universities should be private ones, based on their endowments,? Rinke said.",
    "But Dixon, Brown, and Markey all said universities should be supported, because of the importance of education.",
    "Byron Center businesswoman Donna Brandenburg also declined to participate in Thursday's debate.",
    "Farmington Hills Pastor Ralph Rebandt said he would end state funding to public universities.",
    "They have huge endowments,? and in some cases research programs with ties to China, he said.",
    "The winner of the Aug. 2 Republican primary faces Whitmer in the Nov. 8 general election.",
    "There was more agreement than disagreement among the eight candidates who participated.",
    "University \"costs too much,\" and \"we do need to look at the costs,\" Johnson said.",
    "But universities have also become an object of scorn for many conservatives.",
    "Gretchen Whitmer for Michigan nursing home deaths arising from the pandemic.",
    "Read more on Michigan politics and sign up for our elections newsletter.",
    "Higher education was a rare point of sharp division in the debate.",
    "They also called for the criminal investigation of Democratic Gov.",
    "We need to fund our students; not the universities,? Rebandt said.",
    "Participating Thursday were: Michigan State Police Capt.",
    "Contact Paul Egan: 517-372-8660 or pegan@freepress.com.",
    "Follow him on Twitter @paulegan4.",
    "They also oppose abortion rights."
  ]
}