{
  "id": 7302,
  "mediaId": 261,
  "date": "5/23/2022 12:00:00 AM",
  "headline": "Michigan's DeVos family throws its support behind Tudor Dixon for governor",
  "image": "https://www.gannett-cdn.com/-mm-/52b01365712dccf3181e49ad690fdbf505ae5887/c=273-84-2720-1467/local/-/media/2018/06/30/DetroitFreeP/DetroitFreePress/636659874182297094-AP-17038828269051.jpg?width=2447&height=1383&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/elections/2022/05/23/devos-tudor-dixon-michigan-governor/9890524002/",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Egan",
  "authorUrl": "https://www.freep.com/staff/2646657001/paul-egan/",
  "termIds": [
    1838,
    2002,
    5506,
    5544,
    307,
    308,
    428,
    2645,
    2791
  ],
  "sentences": [
    "President Joe Biden won Michigan by about 154,000 votes, and despite numerous claims and court challenges by Trump and others, there has been no credible evidence of fraud or other irregularities that would come anywhere close to overturning that result.",
    "In a statement, Dixon said she is \"honored to have the DeVos family's support as we enter this new phase of our campaign to defeat Gretchen Whitmer and forge a family-friendly future for Michigan.\"",
    "Dixon supports those positions, and \"it's no wonder her harmful agenda has gotten the attention\" of the DeVos family, said Rodericka Applewhaite, a spokeswoman for the Michigan Democratic Party.",
    "At a May 12 debate in Livingston County, Dixon was one of six Republican candidates  of eight who participated  who falsely claimed that Trump won Michigan's presidential election in 2020.",
    "\"The DeVos family have decided to stand with Tudor Dixon as being the next right governor for the state of Michigan,\" Dick DeVos said Monday on the Paul W. Smith show on WJR-AM in Detroit.",
    "Michigan has strict limits on how much individual donors can give to candidate committees, but rules are looser for supportive political action committees and nonprofit organizations.",
    "School choice and public tax dollar support for private schools, which would generally require a state constitutional amendment, are major issues for the DeVos family.",
    "His wife, Betsy DeVos, is a former chair of the Michigan Republican Party and served in the administration of former President Donald Trump as education secretary.",
    "Jennifer Granholm in 2006, said Michigan paid a price for reelecting what he saw as a failed governor and the state should not make the same mistake again.",
    "Michigan's families deserve good schools, good jobs, safe neighborhoods, reliable infrastructure, and a responsive government that serves their interests.\"",
    "LANSING  The billionaire DeVos family is endorsing Norton Shores businesswoman Tudor Dixon in the Republican race for governor, Dick DeVos said Monday.",
    "DeVos said that as a businesswoman and a mom, Dixon has \"the experience, the leadership and the passion and a plan to put the state back on track.\"",
    "The statement continued: \"We want Michigan to be the best state in the country to live in, work, run a business, raise a family, and retire.",
    "Dixon is one of three GOP candidates whose petitions to qualify for the August primary ballot are currently under challenge.",
    "The endorsement is a significant boost for Dixon in what is currently a 10-candidate field and should help her fundraising.",
    "Mike Brown and Grand Haven financial adviser Michael Markey, accurately answered that Trump lost Michigan in 2020.",
    "They are major donors to Republican candidates and causes and are considered power brokers in the state party.",
    "Gretchen Whitmer's \"ridiculous shutdowns and manipulations\" and \"failed leadership,\" he said.",
    "Read more on Michigan politics and sign up for our elections newsletter.",
    "As the mother of school-age children, Dixon has been impacted by Gov.",
    "At the debate, only two candidates, Michigan State Police Capt.",
    "Dick DeVos was the 2006 Republican candidate for governor.",
    "Contact Paul Egan: 517-372-8660 or pegan@freepress.com.",
    "DeVos, who was defeated by incumbent Gov.",
    "\"We want to stand with her,\" he said.",
    "Follow him on Twitter @paulegan4."
  ]
}