{
  "id": 7473,
  "mediaId": 157,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29845352&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/massive-signature-fraud-scandal-upends-michigan-gop-gubernatorial-race/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    651,
    815,
    1147,
    1682,
    1844,
    2002,
    2087,
    2171,
    2298,
    3075,
    3095,
    3099,
    307,
    428,
    5615,
    2791
  ],
  "sentences": [
    "It appears that after my campaigns signature gathering was complete, individuals independently contracted for a portion of our signature gathering and validation jumped onto other campaigns and went on a money grab, Brown said in a statement Tuesday morning, after his campaign manager initially contested the report the night before.",
    "The Bureau is unaware of another election cycle in which this many circulators submitted such a substantial volume of fraudulent petition sheets consisting of invalid signatures, nor an instance in which it affected as many candidate petitions as at present, the bureaus report reads.",
    "Brown, as well as financial adviser Michael Markey, former Detroit Police Chief James Craig, businesswoman Donna Brandenburg and self-described quality guru Perry Johnson, all had signatures that the bureau recommended to be deemed insufficient as many were fraudulent.",
    "This comes after many Republicans  including many in the GOP gubernatorial field  have questioned whether former President Donald Trump lost the 2020 election, despite President Joe Biden winning by more than 154,000 votes in Michigan.",
    "In total, elections staff identified 36 individual petition circulators who submitted fraudulent petition sheets with invalid signatures in at least 10 petition drives  submitting at least 68,000 invalid signatures total.",
    "The Michigan Board of State Canvassers  which is evenly divided between Democrats and Republicans  is set to meet and take up the recommendations Thursday morning in whats expected to be a contentious meeting in Lansing.",
    "The bureau said staff began to review nominating petitions at the end of March, and discovered early on that a large number of petition sheets submitted by certain circulators appeared fraudulent.",
    "Paul Junge and state Sen. Tom Barrett (R-Charlotte), Republicans who are both running for the U.S. House, cleared the elections bureau hurdle and are recommended as having sufficient petitions.",
    "Michigan Democratic Party (MDP) Chair Lavora Barnes issued a statement Tuesday morning calling for all candidates whose campaigns were touched by the fraud, including Dixon, to drop out.",
    "Michigan families deserve better than an irresponsible, radical slate of candidates who have repeatedly refused accountability for their lawless campaigns.",
    "The bureau noted in the report that there is currently no reason to believe that any of the candidates or campaigns were aware of the fraudulent activity.",
    "Because of this, the bureau took on a more intensive process of review and released a supplemental report on the fraudulent activity Monday night.",
    "The bureau OKd petitions for Dixon, who is being backed by the billionaire DeVos family and had signatures that also were challenged by Democrats.",
    "Michigan Advance is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "A Livingston County GOP debate earlier this month featured eight of the 10 candidates, with Craig and Brandenburg not attending.",
    "Gretchen Whitmer should be kicked off the ballot prior to the Aug. 2 primary due to tens of thousands of forged signatures.",
    "Previously, signatures of dubious authenticity have been scattered throughout petitions and relatively small in number.",
    "The state Bureau of Elections has recommended that five of the 10 Republican candidates hoping to oust Democratic Gov.",
    "Craigs signatures had been challenged by Democrats and a superPAC supporting right-wing media personality Tudor Dixon.",
    "The bureaus unprecedented report Monday night has already prompted at least one candidate, Michigan State Police Capt.",
    "It went on to recommend that candidates and campaigns implement a quality control process prior to filing petitions.",
    "A number of nominations for circuit judges, district judges and congressional races were also deemed insufficient.",
    "During a lightning round, hopefuls were asked if they believe Donald Trump legitimately won the 2020 election.",
    "Staff are working to refer incidents of apparent fraud to law enforcement for criminal investigation.",
    "I will exit the race for Michigans Governor with my integrity and this principle intact, Brown said.",
    "Businessman Kevin Rinke, chiropractor Garrett Soldano, far-right activist Ryan Kelley and the Rev.",
    "If they refuse to withdraw, the Board of Canvassers should  [refuse] to certify these candidates.",
    "Ralph Rebandt were the only other candidates to have their petitions recommended as sufficient.",
    "Rinke and Johnson declined to answer with a simple yes or no, eliciting boos from the audience.",
    "NOW WATCH: Herschel Walker argues with reporter Trump 'never said' election was stolen",
    "Those petition drives included those for governor, circuit judge and district judge.",
    "Their refusal to adhere to Michigan election law is disqualifying, Barnes said.",
    "Contact Editor Susan Demas for questions: info@michiganadvance.com.",
    "Many have spread conspiracy theories about unproven election fraud.",
    "Some consisted entirely of forged or otherwise invalid signatures.",
    "Dixon, Kelley, Johnson, Rebandt and Soldano all said that he did.",
    "Brown and Markey directly said he did not win the election.",
    "I cannot and will not be associated with this activity.",
    "The filing deadline for the signatures was April 19.",
    "Michigan Advance maintains editorial independence.",
    "Michael Brown, to formally withdraw from the race.",
    "Follow Michigan Advance on Facebook and Twitter.",
    "Democrats also challenged Johnsons petitions."
  ]
}