[
  {
    "id": 849,
    "mediaId": 2684,
    "date": "2022-02-22",
    "sentence": "Nancy Mace (R-SC), Alexandria Ocasio-Cortez (D-NY), Cori Bush (D- MO) Pramila Jayapal (D-WA), Ilhan Omar (D-MN), Matt Gaetz (R-FL) and <span class='selected-term'>Warren Davidson</span> (R-OH) are among the 43 lawmaker-signees.",
    "author": "Evan Craighead",
    "title": "US Lawmakers Urge Biden to Get Congressional Approval Before Involving Troops in Ukraine Crisis"
  },
  {
    "id": 873,
    "mediaId": 2735,
    "date": "2022-02-23",
    "sentence": "“Our nation’s laws are highly relevant to the ongoing situation in Ukraine,” 43 U.S. House members led by Reps. Peter DeFazio (D-Ore.) and <span class='selected-term'>Warren Davidson</span> (R-Ohio) wrote in a letter to the White House on Tuesday.",
    "author": "Jake Johnson",
    "title": "Lawmakers Warn Biden He Can’t Unilaterally Send US Troops to Fight Russia"
  },
  {
    "id": 12,
    "mediaId": 2572,
    "date": "2022-02-23",
    "sentence": "Rep. Peter DeFazio, an Oregon Democrat, and Rep. <span class='selected-term'>Warren Davidson</span>, an Ohio Republican, led the diverse group of 43 members of Congress in a letter to Biden, urging him to follow the Constitution when considering deploying U.S. troops.",
    "author": "Marisa Schultz",
    "title": "Lawmakers urge Biden to get congressional approval before stationing US troops in Ukraine"
  },
  {
    "id": 5918,
    "mediaId": 2621,
    "date": "2022-04-13",
    "sentence": "Others who were not sanctioned are Andrew Barr (R-KY); Steny Hoyer (D-MD); James McGovern (D-MA); William Keating (D-MA); Chris Smith (R-NJ); Frank Pallone (D-NJ); Tom Malinowski (D-NJ); Albio Sires (D-NJ); Gregory Meeks (D-NY); Jerry Nadler (D-NY); Richard Hudson (R-NC); <span class='selected-term'>Warren Davidson</span> (R-OH); Marcy Kaptur (D-OH); Michael Turner (R-OH); Brian Fitzpatrick (R-PA); Joe Wilson (R-SC).",
    "author": "Kipp Jones",
    "title": "Here Are All House Members Russia Didn’t Sanction"
  }
]