{
  "id": 1082,
  "mediaId": 2662,
  "date": "2022-04-09",
  "headline": "THOUSANDS Expected at Trump NC Rally Tonight with Ted Budd, Madison Cawthorn, Dan Bishop and Greg Murphy at 7 PM ET",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/trump-rally-az.jpg",
  "link": "https://www.thegatewaypundit.com/2022/04/thousands-expected-trump-nc-rally-tonight-ted-budd-madison-cawthorn-kari-lake-7-pm-et/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/jim-hoft/",
  "termIds": [
    1643,
    1872,
    2201,
    2869,
    3267,
    4035,
    4384,
    4955,
    5308
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nAccording to the Charlotte Observer — Speakers for the outdoor event include Budd along with U.S. Reps. Madison Cawthorn of North Carolina’s 11th Congressional District, Dan Bishop of North Carolina’s 9th Congressional District and Greg Murphy of the 3rd District.",
    "President Donald J. Trump, 45th President of the United States of America, Delivers Remarks in support of Ted Budd, Candidate for U.S. Senate, and other endorsed candidates\nPopular MAGA Republican Madison Cawthorn will speak at the rally tonight.",
    "The American People Should Tune In Today Saturday April 9th, 2022 At SAVE AMERICA RALLY to Hear Another Phenomenal Speech Delivered By Our Great 45th U.S. President Donald J. Trump In Selma, North Carolina Beginning At 2:00 p.m.",
    "Watch right now on Rumble or through my app!https://t.co/yVIDSuHsyr\n— Kari Lake for AZ Governor (@KariLake) April 9, 2022",
    "pic.twitter.com/RVrojDrSuh\n— Dueces (@CamelwalkJump) April 9, 2022\nKari Lake from Arizona is attending tonight’s rally.",
    "President Donald Trump is holding another “Save America” rally tonight in Selma, North Carolina.",
    "I’m LIVE right now with @RSBNetwork before President Trump takes the stage in North Carolina!",
    "The president is expected to speak at 7 PM ET.",
    "????",
    "ET."
  ]
}