{
  "id": 1227,
  "mediaId": 2528,
  "date": "2022-04-06",
  "headline": "Trump hosted a movie night at Mar-a-Lago to premiere an election conspiracy-theory film about Mark Zuckerberg — starring himself",
  "image": "https://i.insider.com/624e4d7af0e4a00018c3fb13?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/trump-hosted-premiere-zuckerberg-conspiracy-theory-film-mar-a-lago-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cheryl Teh",
  "authorUrl": "https://www.businessinsider.com/author/cheryl-teh",
  "termIds": [
    0
  ],
  "sentences": [
    "The film's synopsis does not overtly accuse Zuckerberg of being involved in election fraud but makes the claim that the Meta CEO funded \"nearly $400 million\" in grants that he \"spent nationally in voter operation efforts, particularly in the battleground states of Wisconsin, Arizona, and Georgia.\"",
    "The film screening on April 5 was attended by the former president, controversial Arizona gubernatorial candidate Kari Lake, and Peter Navarro, who was on Wednesday held in contempt of Congress for failing to cooperate with the January 6 panel.",
    "Former President Donald Trump held a movie night at Mar-a-Lago and screened for his guests an election conspiracy-theory film alleging that Meta CEO Mark Zuckerberg was part of a plot to help Democratic lawmakers get elected in 2020.",
    "—Josh Dawsey (@jdawsey1) April 5, 2022\nThe film was produced by Citizens United Productions, a conservative group headed up by Trump ally David Bossie, who told The Post that people should keep talking about voter fraud.",
    "This is likely a reference to how donations from the Meta CEO and his wife, Priscilla Chan, helped fund grants that enabled local election offices to scale up their budgets to better handle mail-in ballots.",
    "Zuckerberg previously responded to queries on his private donations through a spokesperson, who said the couple \"did not participate in the process to determine which jurisdictions received funds.\"",
    "Trump appeared to be in good spirits before the screening, saying he was anticipating watching the film more than \"Citizen Kane,\" \"Titanic,\" and \"Gone With the Wind,\" per The Washington Post.",
    "It includes an interview with Trump, as well as interviews with Sen. Ted Cruz and other conservative figures like Trump-allied lawyer Cleta Mitchell and former Trump advisor Kellyanne Conway.",
    "A poster of the flick — featuring what appeared to be a sinister image of Zuckerberg putting money into a ballot box — was also displayed near a pool on the Trump property.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Former President Donald Trump hosted the premiere of \"Rigged: The Zuckerberg Funded Plot to Defeat Donald Trump\" at his Mar-a-Lago resort in Florida on April 5.",
    "\"Rigged: The Zuckerberg Funded Plot to Defeat Donald Trump\" is a 41-minute film that pushes conspiracy theories about Zuckerberg's role in the election.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Getty\nTrump hosted the premiere of \"Rigged: The Zuckerberg Funded Plot to Defeat Donald Trump\" at Mar-a-Lago.",
    "\"Some of the people here say we shouldn't be talking about 2020,\" said Bossie, according to the Post.",
    "It claims, among other things, that Zuckerberg influenced the election through his donations.",
    "It's a 41-minute election conspiracy-theory film starring Trump and other conservatives.",
    "If we don't prove what happened in 2020, how can we stop it from happening again?\"",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"I think it's vital that we do.",
    "Loading Something is loading."
  ]
}