{
  "id": 1415,
  "mediaId": 4418,
  "date": "2022-04-01",
  "headline": "Arizona Bans Youth Gender Reassignment Surgery And Boys in Girls Sports – Democrats Rally To “Protect Trans Youth”",
  "image": "",
  "link": "https://conservativepapers.com/news/2022/04/01/arizona-bans-youth-gender-reassignment-surgery-and-boys-in-girls-sports-democrats-rally-to-protect-trans-youth/",
  "mediaOutlet": "conservativepapers.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Lambert",
  "authorUrl": "https://conservativepapers.com/news/author/kalel/",
  "termIds": [
    0
  ],
  "sentences": [
    "#TransAlly #TransRightsAreHumanRights #TransDayOfVisibility pic.twitter.com/go9xiTsYo4\n— Rep. Jennifer Longdon (@JenLongdon) March 31, 2022\nDemocratic State Senators also rallied on the capitol lawn, holding signs that said, “Protect trans youth.”\nAdvertisement – story continues below\nToday is #TransDayOfVisibility.",
    "All Transgender people deserve to be loved, protected and safe from the bullying of politicians #TransDayOfVisibility pic.twitter.com/3UfgRPLSgs\n— Arizona Senate Democrats (@AZSenateDems) March 31, 2022\nWhy do these people want to ram sex and gender reassignment down childrens’ throats?",
    "They went online to show their support for “transgender youth.”\nToday, Republicans chose to attack transgender youth, roll back reproductive health care and voting rights all while ignoring the real problems facing our state.",
    "— Daniel Hernandez Jr (@danielforaz) March 31, 2022\nDemocratic State Representative Jennifer Longdon shared a creepy image that said, “You cannot make a trans kid feel cis.” This is propaganda made for children.",
    "Advertisement – story continues below\nSB 1138 will prohibit physicians from performing irreversible gender reassignment surgeries on minors, and SB 1165 will keep biological males out of women’s sports.",
    "TRENDING: “Bill Barr Broke the Law… The Fix Is In… Bill Barr Did Not Do His Job” – EXCLUSIVE VIDEO: Tony Shaffer on Barr’s Actions After the 2020 Election\nThis should have been Bi-partisan.",
    "Republicans in the Arizona Legislature recently passed new laws protecting children from permanent gender reassignment surgery and woke gender theory in sports.",
    "@HRCaz press conference today declaring that #TransRightsAreHumanRights after Gov @DougDucey signed two bills attacking Transgender youth yesterday.",
    "Advertisement – story continues below\nThe sick and perverted Democratic Party expressed outrage over these bills to protect our youth.",
    "— Kari Lake for AZ Governor (@KariLake) March 31, 2022\nThe radical left in Arizona had a meltdown over this new legislation.",
    "Arizona’s next Governor, Trump-endorsed Kari Lake, has been an outspoken champion for this conservative legislation.",
    "On Wednesday, Lake released a statement thanking Republican legislators for getting the job done.",
    "Horrific bills signed by the governor today do not reflect the Arizona I know and love.",
    "pic.twitter.com/SBq5pfWfo0\n— Sen. Sean Bowie (@seanbowie) March 31, 2022\n.",
    "In these uncertain times, please know that we see you for who you are.",
    "To our Arizona transgender community, we hear you and we support you.",
    "The two bills were signed into law by the Governor on Wednesday.",
    "We are lucky to have some great Republicans in the legislature.",
    "The Democratic Party is sick and out of touch.",
    "Source material can be found at this site.",
    "You are deserving of dignity and respect.",
    "You are perfect and enough as you are.",
    "We love you.",
    "??????????.",
    "We see you.",
    "?????"
  ]
}