{
  "id": 1434,
  "mediaId": 2642,
  "date": "2022-04-04",
  "headline": "[VIDEO] Trump’s AZ Candidate Kari Lake Wants Hunter Charged With “Child Molestation”",
  "image": "https://waynedupree.com/wp-content/uploads/2022/04/HUNTER-KARI-LAke-01.jpg",
  "link": "https://waynedupree.com/2022/04/kari-lake-hunter-jail/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Missy Crane",
  "authorUrl": "https://waynedupree.com/author/missycrane/",
  "termIds": [
    1951,
    2153,
    2201,
    3102,
    3975,
    4830,
    5082
  ],
  "sentences": [
    "MORE NEWS: One Journalist Has a Totally Wild Theory About How The Handlers Will Oust Kamala and Joe\nKari appeared on “Real America’s Voice” and called out authorities and officials for covering and protecting Hunter Biden.",
    "It is outrageous what is on that laptop, and the media withholding that information from the good people of this country, I think that is a crime as well,” Lake added.",
    "Just like his father, Hunter also takes zero responsibility or accountability for anything that he’s done, and hasn’t had to answer for a singlet thing.",
    "pic.twitter.com/t5mnazMv8x\n— Kari Lake for AZ Governor (@KariLake) March 29, 2022\nIf this was me or you, we’d be in solitary confinement by now.",
    "Former local news anchor Kari Lake is running for governor of Arizona, and she’s an America First firecracker in all the right ways.",
    "But Hunter has that elite Biden liberal privilege that allows him to get away with murder and pay no price.",
    "Meanwhile, crackhead Hunter Biden has underage porn on his laptop, and he’s at home fingerpainting.",
    "The fact that Hunter Biden is not sitting in a prison cell right now is outrageous,” she continued.",
    "@KariLake: \"The fact that Hunter Biden is not sitting in a Prison Cell right now is outrageous.\"",
    "“It’s pretty obvious, [the media] wanted Biden to win, they wanted Trump out of the White House.",
    "If that would have gotten out, there was no way Joe Biden would have won anywhere,” Lake said.",
    "Lake says that proves there’s a secret conspiracy working to undermine the rule of law.",
    "“And I remember reading a couple stories, I was always pushing to get that story out.",
    "But Joe will move like lightening to imprison January 6th rally attendees.",
    "“Hunter Biden should be behind bars, charged for child molestation.",
    "They withheld that incredibly damaging information.",
    "Lake can’t believe Hunter Biden is not behind bars.",
    "He should be charged for the Logan Act violations.",
    "President Trump has backed a winner in Arizona.",
    "He should be charged for treason.",
    "You can watch the video below:\n.",
    "I thought it was appalling.",
    "We agree, it’s shameful."
  ]
}