{
  "id": 1491,
  "mediaId": 2642,
  "date": "2022-04-04",
  "headline": "Fox Business Reporter Shares Insider Info on Elon Musk Twitter Move, And a BIG Prediction Dems Won’t Like…",
  "image": "https://waynedupree.com/wp-content/uploads/2022/04/elon-twit-fox-business-biden-01.jpg",
  "link": "https://waynedupree.com/2022/04/elon-fox-business-prediction/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Missy Crane",
  "authorUrl": "https://waynedupree.com/author/missycrane/",
  "termIds": [
    2219,
    4787,
    347,
    403,
    1094,
    4959
  ],
  "sentences": [
    "Here’s what people online are saying:\n“Hopefully Musk will use his stake to end Twitter’s Orwellian censorship of half the country, rather than something like forcing Twitter’s data center to go solar using panels and batteries from Musk’s other companies.”\n“It’s a real shame they have to be forced into doing the right thing.”\n“Credit where credit is due.",
    "My bet is he tries to force Twitter to accept more diverse views and stop censoring conservatives https://t.co/iH2DY3TMCV\n— Charles Gasparino (@CGasparino) April 4, 2022\n***FOLLOW US ON CLOUDHUB***\nWell, let’s hope Charlie is right.",
    "@elonmusk\n— Rep. Marjorie Taylor Greene (@RepMTG) April 4, 2022\nThe other school of thought is that Elon bought the 9% shares to increase the stock, and will sell it for a profit and call it a day.",
    "However, you can imagine that if he goes through with this bold Twitter move, and he takes away this powerful social media weapon from the Regime, he will be the new #1 target for the Deep State.",
    "It’s kind of like a “coup.”\nHowever, according to Fox Business reporter Charlie Gasparino, anyone who thinks Elon will remain “passive,” doesn’t understand how the billionaire operates.",
    "So, even though Elon is the largest shareholder, he’s not in a position to make decisions in the day-to-day going’s on at Twitter and to go from “passive” to “active” takes some work.",
    "Over the past few weeks, Elon has been lashing out at Twitter and hosting online polls, asking people if they think Twitter is politically biased, and suppressing free speech.",
    "However, what people need to keep in mind is that the shares Elon holds are “passive.”\nPassive investing means buying a security to own it long-term.",
    "My bet is he tries to force Twitter to accept more diverse views and stop censoring conservatives”\nAnyone who thinks ??@elonmusk?",
    "Promoted Content\nAs you may know by now, Elon Musk has purchased 9% of Twitter, making him the largest shareholder to date.",
    "Unlike active traders, passive investors do not seek to profit from short-term price fluctuations or market timing.",
    "It will require courage bc the regime is heavily investing in a certain industry and threats will undoubtedly come.",
    "A passive investor is one who does not participate in the day-to-day decisions of running a company.",
    "In partnerships, such investors may be deemed limited partners rather than general partners.",
    "I have been canned more than Tuna…..”\n“Elon puts his money where his mouth.",
    "Just get the censorship of alternative narratives and ideas out of twitter.",
    "Will the new majority shareholder return freedom of speech to Twitter?",
    "Yet the freedom of speech restored will enable us all to defeat them.",
    "Either way, we should know in pretty short time what his plans are.",
    "I agree with Charlie’s analysis.”\n“I am on my 16th Twitter Account!",
    "Here’s what Charlie said in a recent tweet:\n“Anyone who thinks ??",
    "@elonmusk is going to be a passive investor doesn’t know the man.",
    "is going to be a passive investor doesn’t know the man.",
    "He doesn’t F around.”\n“No point starting another one.",
    "I am so happy that Musk is getting involved.",
    "So, it’s clear that Elon is up to something.",
    "“\nWe’ll see what happens.",
    "Lord help him…"
  ]
}