{
  "id": 1522,
  "mediaId": 2593,
  "date": "2022-04-09",
  "headline": "Trump Predicts Arizona Candidate Will Become the 'Greatest Governor in American History'",
  "image": "https://ijr.com/wp-content/uploads/2022/04/Kari-Lake-Donald-Trump.jpg",
  "link": "https://ijr.com/trump-predicts-arizona-candidate-will-become-the-greatest-governor-in-american-history/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Richard Moorhead",
  "authorUrl": "https://ijr.com/author/wj/ ",
  "termIds": [
    0
  ],
  "sentences": [
    "She has promised to finish construction on the border wall started under the Trump administration and has proposed an interstate compact to “engage in joint border security operations.”\n“If Washington intends to abandon Arizona, we will exercise a federalist remedy with like-minded states across our great nation to deal with the crisis ourselves,” Lake said in a January statement to The Western Journal.",
    "“I think she’ll go down as the greatest governor in American history.”\n“She will be the greatest Governor in history.” – President Donald J. Trump @KariLake pic.twitter.com/OsZLmjMrMH\n— Students for Kari (@StudentsForKari) April 8, 2022\nLake has pledged to tackle the border crisis brought on in part by the lack of immigration enforcement on the part of the Biden administration.",
    "pic.twitter.com/KvhYInBH6N\n— Kari Lake for AZ Governor (@KariLake) September 28, 2021\nArizona is slated to hold some of the most competitive state elections in the country in the November midterms, with a U.S Senate seat and the governor’s office up for grabs.",
    "Even Democrats are sounding the alarm over the Biden administration’s decision to end Title 42, an immigration policy that allows for the quick expulsion of illegal aliens on public health grounds.",
    "Trump went so far as to claim that Kari Lake will be the “greatest governor in American history.”\nLake, a former local Fox News anchor, is a Republican candidate for governor of Arizona.",
    "“I will say that I think that’s going to be one of the great things that I’ve done — endorsing a woman and helping her get elected,” Trump said.",
    "After President Joe Biden narrowly won the state in 2020, Republicans have seen voter registration gains over Democrats in the thousands.",
    "Arizona will likely be hit with another surge of illegal migrants this spring after being swamped with aliens last year.",
    "The new governor would succeed Doug Ducey, a Republican whose relationship with Trump went sour after the 2020 election.",
    "This means so much to me because I know how much you love America and how much the people of this country love you!",
    "Former President Donald Trump had high praise on Thursday night for a gubernatorial candidate he’s supporting.",
    "Polling from January showed Lake with a 4-point lead over her primary opponent, former U.S. Rep. Matt Salmon.",
    "Trump made the remarks at a fundraiser for Lake at his Mar-a-Lago resort in Florida.",
    "I promise to fight as hard for the people of Arizona as you have fought for us.",
    "Secretary of State Katie Hobbs is the favorite for the Democratic nomination.",
    "We are committed to truth and accuracy in all of our journalism.",
    "This article appeared originally on The Western Journal.",
    "Lake managed to secure a Trump endorsement in September.",
    "Thank you, President Trump, for your endorsement.",
    "Read our editorial standards."
  ]
}