{
  "id": 1859,
  "mediaId": 2550,
  "date": "2022-03-27",
  "headline": "county abruptly resigns, triggering special election",
  "image": "https://images.dailykos.com/images/595421/story_image/GettyImages-1041760240.jpg?1538491582",
  "link": "https://www.dailykos.com/stories/2022/3/27/2088101/-Top-prosecutor-in-America-s-fourth-biggest-county-abruptly-resigns-triggering-special-election?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1577,
    2128,
    2144,
    2153,
    2321,
    2725,
    584,
    1178,
    4830,
    5128
  ],
  "sentences": [
    "Rachel Mitchell, hired by Senate Republicans during the Brett Kavanaugh hearings, is running for Maricopa County attorney\nArizona Republican Allister Adel announced Monday that she was resigning as the top prosecutor of Maricopa County, a move that the Arizona Republic writes came after negative attention \"over her sobriety and absences from the office, which prompted investigations by the State Bar of Arizona and the Maricopa County Board of Supervisors.\"",
    "Arizona is critical in 2022—in every way possible\nDaily Kos' The Brief\nFollowShare\n0:0058:29\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nGodbehere on Tuesday earned a supportive tweet from former TV anchor Kari Lake, the far-right conspiracy theorist that Donald Trump is supporting for governor.",
    "The Maricopa County Board of Supervisors will also be tasked with picking an interim county prosecutor, who by law must share Adel's party affiliation (the body picked Adel herself this way in 2019), but it remains to be seen whether the board selects a caretaker or someone who might compete in the special.",
    "Finally, Mitchell is a longtime sex crimes prosecutor who attracted national attention during Brett Kavanaugh's 2018 Supreme Court hearings when the all-male Republican members of the Senate Judiciary Committee brought her in as a \"female assistant\" to question him and accuser Christine Blasey Ford.",
    "The next year Mitchell temporarily served as Maricopa County attorney after Bill Montgomery resigned to join the state Supreme Court: Both she and Godbehere were named as finalists for the appointment for the final year of his term, but Adel was ultimately selected.",
    "Her situation grew worse last week when Attorney General Mark Brnovich asked her to provide more information about 180 misdemeanor cases that were dropped because Adel's office failed to file charges before it was too late.",
    "A special election will take place this November, but Adel's would-be successors as county attorney have only until the April 4 filing deadline to turn in the signatures they need to make the August primary ballot.",
    "Check out Montserrat Arredondo of One Arizona, which worked with partner organizations to register over 250,000 new voters in the 2020 cycle, talking with Markos and Kerry on Daily Kos’ The Brief podcast.",
    "Mitchell made news again last month when she was one of the five division chiefs to tell their boss to resign due to serious questions about her ability to serve as the county's top prosecutor.",
    "Doug Ducey's general counsel, and she was quickly joined by three others: City of Goodyear Prosecutor Gina Godbehere, attorney James Austin Woods, and prosecutor Rachel Mitchell.",
    "Democratic contenders need to turn in 4,300 valid petitions, while Republicans, who enjoy a voter registration advantage in America's fourth-largest county, need to submit 4,500.",
    "On the Democratic side, 2020 nominee Julie Gunnigle said Tuesday that she'd already collected the requisite petitions in less than 24 hours.",
    "That link may not be helpful with GOP primary voters, though, as the elder Woods was a vocal Trump critic who became a Democrat in 2018.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "She went on to tell the GOP senators that no \"reasonable prosecutor\" would prosecute Kavanaugh for sexual assault.",
    "Woods, for his part, is the son of the late Grant Woods, who served as state attorney general from 1991 to 1999.",
    "Gunnigle, who is a defense attorney, challenged Adel last cycle and lost by a close 51-49.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n43.",
    "The first to launch a bid was Anni Foster, who is Gov.",
    "Things are considerably more crowded on the GOP side.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}