{
  "id": 1976,
  "mediaId": 2664,
  "date": "2022-03-25",
  "headline": "GOP civil war escalates as Republicans keep slamming each other in meaner and meaner terms",
  "image": "https://www.rawstory.com/media-library/trump-refuses-to-concede-while-lying-about-winning-at-georgia-maga-rally.jpg?id=27625165&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/trump-georgia-2657041928/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    2201,
    3103,
    3129,
    3434,
    4192,
    4284,
    4537,
    878,
    4984
  ],
  "sentences": [
    "\\u201cI think when someone\\u2019s convicted, it\\u2019s time to resign.\\u201d\\n\\n\\u2014 House Minority Leader Kevin McCarthy on Rep. Jeff Fortenberry (R-NE) being found guilty of campaign finance violations and lying to the FBIpic.twitter.com/mnckdsjAL6\n— The Recount (@The Recount) 1648219575",
    "Greitens comments came one day after Trump's endorsed candidate for Arizona governor, Kari Lake, attacked Ronna Romney McDaniel, who remains as chairwoman of the RNC after being picked by Trump.",
    "Republicans are openly feuding as Donald Trump prepares to travel to Georgia for a Saturday campaign rally where he is expected to campaign against two sitting, statewide elected Republicans.",
    "Trump's rally comes amid escalating rhetoric as Republicans vie for control of the Grand Old Party during the same week Trump un-endorsed Rep. Mo Brooks (R-AL) for U.S. Senate.",
    "Now we know, in fact, something did go wrong, and we have evidence to the effect,\" Lake claimed, despite her \"evidence\" having been long ago debunked.",
    "Also on Friday, House GOP Leader Kevin McCarthy urged Rep. Jeff Fortenberry (R-NE) to resign after being convicted of crimes.",
    "On Friday, Missouri Senate candidate Eric Greitens trashed Senate Majority Leader Mitch McConnell as a \"disgusting coward.\"",
    "Trump is also backing Republican Rep. Jody Hice in his campaign against Secretary of State Brad Raffensperger.",
    "We will not forget who stood beside us, got to the bottom of this corrupt election, and did the right thing.",
    "\"Ronna McDaniel is trying to save her career after failing to do the right thing with the 2020 election.",
    "And we will not forget who did the wrong thing and stood on the wrong side of history,\" she charged.",
    "The symbol of the Republican Party is the elephant, and elephants have excellent memories.",
    "Perdue and Hice are expected to address Trump's MAGA followers at the rally Commerce.",
    "Trump has endorsed former Georgia Sen. David Perdue in his campaign against GOP Gov.",
    "More importantly, she walked away from the voters who knew something went wrong.",
    "Controversial Rep. Marjorie Taylor Greene (R-GA) is also expected to attend.",
    "She walked away from President Trump after that obviously rigged election.",
    "And I’ll tell you what; Trump Republicans have a memory like an elephant.",
    "\"And now Ronna thinks we forgot because a couple of years have gone by.",
    "We haven’t forgotten.",
    "Brian Kemp."
  ]
}