{
  "id": 2928,
  "mediaId": 2578,
  "date": "2022-03-18",
  "headline": "EXCLUSIVE: Teneo Network, FDD, Koch, And Bill Kristol – AZ Attorney General Mark Brnovich Caught Hanging Out With #NeverTrumpers at Secret AZ Gathering",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/546827E4-0DC4-478E-82BB-8553B54FEB9A.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/03/exclusive-teneo-network-fdd-bill-kristol-az-attorney-general-mark-brnovich-caught-hanging-nevertrumpers-secret-az-gathering/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    2654,
    2725,
    3137,
    399,
    585,
    1011,
    1012,
    4830
  ],
  "sentences": [
    "Alliance for Justice reports that “since 2010, Teneo has received at least $250,000 from the Koch donor-advised fund, Donors Trust.”\nNews articles on The Foundation for Defense of Democracies’ website refer to the historic January 6 rally and march on our nation’s capital, “The Jan. 6 mob assault on the Congress and the stain on the image of American democracy… The Jan. 6 assault on the U.S. Capitol by supporters of former President Trump”, and “The Jan. 6 U.S. Capitol insurrection“.",
    "Through events and retreats with top business leaders and leading policy experts, Teneo provides opportunities for members to learn about and discuss both key issues facing our country and world as well as five pillar ideas: (1) limited, constitutional government; (2) individual liberty and free enterprise; (3) robust civic society; (4) a strong national defense; and (5) belief in a transcendent order, whether founded in tradition, philosophy, or theology.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nAccording to the Teneo webpage,\nTeneo is a nonpartisan, nonprofit organization that educates, connects and equips a network of outstanding leaders working to develop practical solutions to pressing global issues.",
    "After multiple attempts to reach the office and media contacts of Brnovich and Richer and multiple direct messages on Twitter, TGP correspondent Jordan Conradson tweeted at the two for comment on this backyard meetup.",
    "Although Stephen Richer was not the acting County Recorder until January 2021, the coverup is worse than the crime, and it certainly appeared to us that Richer was fully committed to covering it up.",
    "This could be a campaign stop, but a closer look at the bottom right of the image will show what appears to be the unmistakable clown hair of Maricopa County Recorder Stephen Richer.",
    "We previously reported on the shocking photograph of Maricopa County Recorder Stephen Richer hanging out in somebody’s backyard with Arizona Attorney General Mark Brnovich.",
    "BREAKING – LEAKED AUDIO: Maricopa County Supervisor Steve Chucri Admits: “I DON’T FEEL COMFORTABLE WITH DOMINION” – And County Recorder Stephen Richer AGREES!",
    "TGP reported that Kristol is leading an effort to stop election integrity efforts and cover up the fraudulent 2020 election with RINOs in Maricopa County.",
    "On their substack page, Teneo advertises and encourages members to apply for the Foundation for Defense of Democracies (FDD) Media Fellows Program.",
    "The Teneo Digest on November 20th contains a photo of a private backyard meeting between Arizona Attorney General Mark Brnovich and others.",
    "It appears that another ASU Professor and Foundation for Defense of Democracies advisor, David Kilcullen is in attendance.",
    "The Gateway Pundit reported that Stephen Richer ran on exposing former Recorder Adrian Fontes’ “criminal” actions.",
    "The Gateway Pundit received exclusive access to “The Teneo Digest” on Teneo Network‘s invite-only substack page.",
    "No matter what state you live in, contact Arizona Attorney General Mark Brnovich to demand answers and arrests!",
    "Another FDD article says, “Trump’s term in office will forever be defined by the terrible events of January 6.",
    "Why is Mark Brnovich hanging out with never Trumpers and possible witnesses in election fraud investigations?",
    "This gathering took place at Teneo affiliate and Arizona State University law Professor Ilan Wurman‘s home.",
    "Mark Brnovich is supposed to be investigating these people, not drinking beers and winning their votes!",
    "There is an open criminal investigation into the stolen 2020 election and the 2020 elections officials.",
    "— Kari Lake for AZ Governor (@KariLake) March 18, 2022\nArizona is watching their every move.",
    "Teneo calls itself a Civic and Social Organization based in Austin, Texas, on its LinkedIn.",
    "As a matter of Fact, Never-Trumper Bill Kristol sits on the board of advisors for FDD.",
    "Hey @brnoforaz do you still care about the crimes committed during our 2020 election?",
    "The Gateway Pundit previously reported on the Marxist indoctrination camp called ASU.",
    "Nothing will change that.”\nThese RINO leftists are anti-election integrity.",
    "Vocal never-Trumper Ben Shapiro is also part of this secretive group.",
    "Is Attorney General Brnovich taking this investigation seriously?",
    "Teneo takes no positions on legislation or candidates.",
    "We demand justice in our corrupt, rigged elecitons.",
    "Still no answers…\nRead the full newsletter below.",
    "Why is Mark Brnovich hanging out with his perps?",
    "We don’t know because they refuse to comment.",
    "It appears to be quite an exclusive group.",
    "I can tell you that Arizona still cares!",
    "Both are to the left of Mark Brnovich.",
    "Or at least we think there is.",
    "What exactly is this?",
    "Please DO YOUR JOB."
  ]
}