{
  "id": 3472,
  "mediaId": 2660,
  "date": "2022-03-17",
  "headline": "Jan. 6 defendants “are being held in prison without being charged.”",
  "image": "https://static.politifact.com/politifact/rulings/meter-false.jpg",
  "link": "https://www.politifact.com/factchecks/2022/mar/17/kari-lake/arizona-gop-candidate-kari-lake-wrongly-says-jan-6/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amy Sherman",
  "authorUrl": "https://www.politifact.com/staff/amy-sherman/",
  "termIds": [
    2153,
    2201,
    3975,
    4284,
    4830,
    5082
  ],
  "sentences": [
    "A defendant can be held in jail on a complaint, but would be tried on the indictment filed by the grand jury, or the information filed by the prosecutor, said Bruce Green, a former federal prosecutor and law professor at Fordham University.",
    "More than 245 individuals have been charged with assaulting, resisting, or impeding police officers or employees, with over 80 of those charged with using a deadly or dangerous weapon or causing serious bodily injury to an officer.",
    "She predicted a review of ballots in Maricopa County would show Trump as \"the real winner of Arizona,\" but that review, orchestrated by state Senate Republicans, confirmed the official results that Biden won.",
    "Kari Lake, a TV journalist turned Republican candidate for Arizona governor, is running with Donald Trump’s endorsement on a platform of rehashing falsehoods about the 2020 presidential election.",
    "Featured Fact-check\nBrian Kemp and Secretary of State Brad Raffensperger “perhaps in collusion with the Radical Left Democrats” are attempting to “unseat” U.S. Rep. Marjorie Taylor Greene.",
    "The U.S. Attorney’s Office publicly shows online the charges filed against more than 775 defendants, including violent offenses such as using deadly weapons or assaulting police officers.",
    "Court records show charges filed against hundreds of people who assaulted or resisted police and disrupted Congress in an effort to overturn the election results in favor of Donald Trump.",
    "Daniel Richman, a Columbia law school professor and former federal prosecutor, said it’s wrong to suggest that Jan. 6 defendants are \"sitting in there not knowing what they are in for.\"",
    "Lake said she would have no say in that as a candidate for governor, then added, \"What I don’t like is that people are being held in prison without being charged.",
    "The complaint is usually followed by another type of charging document, an indictment from a grand jury, or what’s called an \"information\" filed by a prosecutor.",
    "The majority of Jan. 6 defendants have been released from jail pending trial, but between 75 and 85 are in jail at any given time while their cases are pending.",
    "There has been one defendant, Texas resident Lucas Denney, whose attorneys filed a motion for release due to lack of a formal indictment by a grand jury.",
    "The U.S. Attorney’s Office said that all defendants who have been detained by the court are charged in complaints or indictments with criminal offenses.",
    "Lake is one of many Republicans running in Arizona’s Aug. 2 Republican primary, while the best known Democrat running is Secretary of State Katie Hobbs.",
    "The complaint itself includes criminal charges, but it’s filed earlier in the court process without a grand jury agreeing on charges.",
    "Lake disputes that President Joe Biden received 81 million votes even though the results were certified and accepted by Congress.",
    "Lake did not cite any particular defendants during her interview, and her campaign didn’t respond to our request for evidence.",
    "The number of defendants detained pretrial is between 75 and 85 at any given time, according to the U.S. Attorney's Office.",
    "Lake said defendants were being held in \"prison\" without being charged, but defendants are held pre-trial in jails.",
    "Falsehoods about the 2020 presidential election culminated in the Jan. 6, 2021, violent attack on the U.S. Capitol.",
    "The complaint is accompanied by a statement of facts by a law enforcement officer detailing the alleged crimes.",
    "So has the government imprisoned people associated with Jan. 6 without showing any evidence of alleged crimes?",
    "If Your Time is short\nMore than 775 people have been arrested in the Jan. 6, 2021, attack on the U.S. Capitol.",
    "Typically the cases begin with a complaint signed by a judge that states the charges faced by the defendant.",
    "The majority of defendants awaiting trial have been released from jail pending the outcome of their case.",
    "Lake has spoken favorably of \"decertification\" of the vote in Arizona, a process that does not exist.",
    "\"The complaint is a charge, (even if) it’s not a charge for certain formal purposes,\" Richman said.",
    "Federal prosecutors have filed charging documents that show the alleged crimes by the individuals.",
    "As of March 6, more than 775 defendants had been arrested in connection with the Capitol attack.",
    "Approximately 224 individuals have pleaded guilty to federal charges, including 29 for felonies.",
    "\"They have a piece of paper by government officials alleging certain crimes they committed.\"",
    "\"We don’t take kindly on Americans being locked up for months on end without being charged.",
    "Approximately 224 people have pleaded guilty to federal charges, including 29 for felonies.",
    "The U.S. Attorney’s Office in Washington, D.C., summarized the charges in a recent update.",
    "Lake was asked if she thinks the defendants should be pardoned, an idea floated by Trump.",
    "Denney’s attorneys said he intended to plead guilty rather than face additional charges.",
    "Lake downplayed the cases of the defendants in an interview with 60 Minutes Australia.",
    "We contacted Lake’s campaign to ask for her evidence and did not get a response.",
    "Lake said Jan. 6 defendants \"are being held in prison without being charged.\"",
    "We found no evidence of defendants being imprisoned without being charged.",
    "Prosecutors said it was an unintentional procedural error, however.",
    "PolitiFact researcher Caryn Baird contributed to this fact-check.",
    "Lake posted a longer version of the interview on Rumble.",
    "More than 110 Jan. 6 defendants have been sentenced.",
    "So charge them, or get off the pot,\" she added.",
    "More than 110 defendants have been sentenced.",
    "Many of the defendants have pleaded guilty.",
    "Doug Ducey is term limited.",
    "We rate her claim False.",
    "That’s un-American.\"",
    "Gov.",
    "No."
  ]
}