{
  "id": 3988,
  "mediaId": 2621,
  "date": "2022-02-25",
  "headline": "Trump-Backed Candidate For Governor of Arizona Campaigning With Felon Who ‘Plotted to Kill’ FBI Informant: Report",
  "image": "https://www.mediaite.com/wp-content/uploads/2021/09/Screen-Shot-2021-09-29-at-10.51.01-AM.jpg",
  "link": "https://www.mediaite.com/politics/trump-backed-candidate-for-governor-of-arizona-campaigning-with-felon-who-plotted-to-kill-fbi-informant-report/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Griffing",
  "authorUrl": "https://www.mediaite.com/author/alex-griffing/",
  "termIds": [
    2153,
    2201,
    2486,
    4600,
    370,
    4830,
    5245,
    5305
  ],
  "sentences": [
    "Igor Derysh reported that “Ulibarri, a repeat violent offender who pleaded guilty after the DOJ accused him of trying to hire a hitman to kill an FBI informant and an unrelated state charge of battery on a peace officer, spoke at Lake’s “Stand for Freedom” rally in Scottsdale last July.”\nDerysh notes Ulibarri “was introduced as a man who’s ‘been addicted to drugs, imprisoned, and totally hopeless’ before a ‘miracle came’ and he became a small business owner ‘on a mission to help others break free from addiction.’”\nLake, who is running on a pro-law enforcement platform, was documented by CNN in November of 2021 for her ties to fringer far-right figures.",
    "CNN’s K-File reported that in August, Lake met with and posed for photos with Greyson Arnold, a “Nazi sympathizer who has a history of making White nationalist, racist, antisemitic and pro-Nazi statements, including once calling Adolf Hitler ‘a complicated historical figure which many people misunderstand.’”\nHave a tip we should know?",
    "She inspires me with her tenacity and willingness to lead the fight to take back Arizona from do-nothing RINOs.”\nAlso, last month Lake’s campaign invited Mary Ann Mendoza, an activist who lost her police officer son in a crash involving an undocumented immigrant, to speak at an event.",
    "In 2020, Mendoza was dropped from speaking at the Republican National Convention after it came to light she pushed QAnon conspiracy theories on social media, including a claim that Jews were plotting to take over the world.",
    "Kari Lake, the longtime Phoenix-area news anchor turned Trump-backed candidate for Arizona governor, has been campaigning with a man who pleaded guilting to trying to hire a hitman to kill an FBI informant.",
    "CNN reported that Lake campaigned last summer with Ron Watkins, who is running for Congress in Arizona’s 1st Congressional District and played a key role in promoting the far-right QAnon conspiracy theory.",
    "Salon documented Lake’s latest campaign scandal, noting that her campaign even paid the convicted felon, Kenneth Ulibarri, $2,000, according to recent filings.",
    "Lake, who is no stranger to controversy, has previously been documented campaigning with QAnon followers and Nazi sympathizers.",
    "Watkins wrote in an October post on Telegram, “Just had dinner with Kari Lake, the next Governor of Arizona.",
    "tips@mediaite.com"
  ]
}