{
  "id": 4006,
  "mediaId": 2590,
  "date": "2022-03-06",
  "headline": "Mike Lindell Vows 'Class Action' Suit Against 'All Machines' Over Rigged Election Lie",
  "image": "https://img.huffingtonpost.com/asset/622470af240000420d96bfdc.jpeg?cache=z3E3Ut7Xle&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/mike-lindell-class-action-all-machines-defective_n_62246ecfe4b04a0545d7a400",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Papenfuss",
  "authorUrl": "",
  "termIds": [
    2153,
    2201,
    3771,
    4190,
    329,
    659,
    944,
    1094
  ],
  "sentences": [
    "Advertisement\nLindell is being sued by Dominion Voting Systems for more than $1.3 billion in damages for defamation in what the suit calls his “viral disinformation campaign.”\nThe Smartmatic voting machine company also filed a defamation lawsuit against Lindell, alleging that he deliberately concocted lies about a rigged presidential election to sell his products.",
    "Mike Lindell, the increasingly off-the-rails MyPillow CEO and Donald Trump acolyte, announced Saturday that he’s filing a “class action lawsuit” against “all machines” to support his and Trump’s lie that the 2020 presidential election was rigged.",
    "Mike Lindell announces a class action lawsuit against “all machines” pic.twitter.com/ZokLXQhNuN\n— Acyn (@Acyn) March 5, 2022\nHe later insisted to The Daily Beast that he was talking about voting machines, though that’s not what he said.",
    "(@HelenKennedy) March 5, 2022\nI didn't have Mike Lindell is actually Sarah Connor from the future on my batshit Q card pic.twitter.com/amjZt4GCSO\n— Donald ??????????????????????????",
    "Advertisement\nLindell seemed perfectly serious when he made the announcement during a speech endorsing Arizona GOP gubernatorial candidate Kari Lake.",
    "One wondered if Lindell had located a “time machine” to eliminate all machines for “any election in history,” as he’d promised to do.",
    "His lawyers have been working on the suit for five months, and will argue that “all machines” are “defective devices,” Lindell said.",
    "“We’re going to get rid of these machines once and for all, for any election in history,” he added, to cheers from the audience.",
    "One Twitter user quipped that his washing machine and dryer have hired an attorney in response.",
    "(@007__NIL) March 5, 2022\nMy toaster is counter suing for libel.",
    "My Nespresso has been acting up and needs a little discipline.",
    "Twitter critics had a laugh over Lindell’s latest stunt.",
    "(@Leslieoo7) March 6, 2022",
    "— Leslieoo7 ???????",
    "— Helen Kennedy ??",
    "Good."
  ]
}