{
  "id": 4025,
  "mediaId": 2662,
  "date": "2022-03-06",
  "headline": "EXCLUSIVE: Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “I’m The ONLY Candidate Who’s Vowing To And Will Get To The Bottom Of What Happened In 2020.” (VIDEO)",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/81811105-B4BE-4A49-94CC-E11E5824AC8C.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/03/exclusive-trump-endorsed-arizona-gubernatorial-candidate-kari-lake-candidate-vowing-will-get-bottom-happened-2020-video/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1872,
    2153,
    2201,
    3267,
    3736,
    3839,
    4830,
    5353
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe Gateway Pundit recently reported on a new poll showing Trump-endorsed Kari Lake is the only candidate who can win the general election against Soros-funded socialist frontrunner Katie Hobbs.",
    "Arizona Gubernatorial Candidate Kari Lake DESTROYS Fake News Media – Kari’s First Political Ad Will Expose the BS on Arizona Stations During Their News Programs\nKari Lake, a former career news anchor for 27 years, knows how fake news works and how to destroy them.",
    "I am the only governor candidate on the GOP side who can beat Katie Hobbs, and if we don’t get somebody who can get us past the finish line in November, We’re gonna end up with a socialist.",
    "Lake told the crowd, she “will seek justice.”\nhttps://twitter.com/RSBNetwork/status/1500263608567148545\nThe Gateway Pundit correspondent Jordan Conradson spoke with Kari after the rally.",
    "Trump favorite, Arizona Gubernatorial candidate Kari Lake hosted a rock and roll rodeo rally yesterday in Morristown, Arizona, featuring incredible speakers, live music, and bull riding.",
    "If we had the person who we voted for in the Oval Office, we would have never had an exit from Afghanistan that left $80 billion of our best equipment and supplies in Afghanistan.",
    "Kari Lake’s first TV campaign ad exposed the corrupt mainstream media and the suffering caused by their cover-up of the stolen 2020 election.",
    "I’ve covered this state for 27 years, and the people of Arizona know me, and they know that I am going to be a governor who represents them.",
    "It’s been a long time since we’ve had a candidate or a governor who’s done that, and I’m so honored to have President Trump’s endorsement.",
    "I recognized the field that was running, and I said, “I don’t think they can get us past the finish line, and I can.” We have a movement.",
    "People want America first, and these other guys I’m running against are not America first, even though they’re trying to say they are.",
    "These are hardworking people that have been hurt by the policies of the left, hurt by Joe Biden’s policies, and they’re sick of it.",
    "Lake has also vowed to finish the southern border wall and arrest the evil human and drug traffickers pouring into our country.",
    "And the people of Arizona know I’m the only candidate who’s vowing to and will get to the bottom of what happened in 2020.",
    "Lake: No, if we had the person who was duly elected in the Oval Office, do you think we would have forced vaccines?",
    "I talked to him yesterday, and the conservative movement loves it, but you know, the people of America love it.",
    "I want secure, honest elections for our Democrat citizens of Arizona, our Independents, and our Republicans.",
    "Do you think we’d have people losing their job because they wanted to make their own medical decisions?",
    "We would have never had Americans abandoned, and we would never have unvetted people coming over here.",
    "We’re seeing it in Afghanistan, we’re seeing it on the southern border, we’re seeing it with Ukraine.",
    "Kari Lake vowed to get to the bottom of the rigged 2020 election herself as Governor of Arizona.",
    "They think if they keep lying to us that we’ll just go, “Oh okay, it’s over.” No, it’s not over.",
    "The people of Arizona trust him, and they know when he picks a candidate, he’s picking a winner.",
    "The power of a Trump endorsement in Arizona further shows us that the 2020 election was a sham.",
    "And I hope we have enough courageous lawmakers currently in office who will do the right thing.",
    "We would never have this happening in our country right now if had the right person in office.",
    "It looks like you’re the only candidate who can beat Katie Hobbs in the general election.",
    "Conradson: So you recently exposed the fake news lies on their own stations with a TV ad.",
    "When you steal our vote, when you’re still an election, we’re not going to forget that.",
    "They know that they’re being lied to; they’re being lied to about the rigged election.",
    "We’re all sick of it, and we’re gonna get in there and vote, and vote America first.",
    "Like President Trump, Kari Lake knows how to draw a crowd and make it a party!",
    "We would never have a border that’s wide open, allowing fentanyl to pour in.",
    "And we’re seeing the fraud all the way up in Wisconsin and Georgia.",
    "The enormous crowd was estimated to be over 2200 patriots in size.",
    "Would any of this have happened under President Trump’s watch?",
    "Conradson: you have taken a considerable lead in the primary.",
    "We would have never had those 13 military members killed.",
    "Conradson: Stolen elections have serious consequences.",
    "Oh my gosh, we just got to poll numbers up over 43%.",
    "What kind of reactions are you getting from that?",
    "We can’t have that, and that’s why I’m running.",
    "I’m going to do right by the people of Arizona.",
    "We’re not going to have fraudulent elections.",
    "It’s horrible what happened in this country.",
    "No other candidate for Governor can do this.",
    "This is not a Democrat, Republican thing.",
    "It’s about the great people you saw here.",
    "We’re not going to have our vote stolen.",
    "We’re going to get to the bottom of it.",
    "And our poll numbers are showing it.",
    "Kari Lake will put America first.",
    "Lake: Well, we have a movement.",
    "What do you attribute that to?",
    "It’s pretty plain and simple.",
    "I think that goes a long way.",
    "Lake: It’s been pretty great.",
    "The President loved it.",
    "It’s an American thing.",
    "Recent Posts\nContact",
    "I talked to him.",
    "I know Arizona.",
    "I love Arizona.",
    "INCREDIBLE!",
    "No.",
    "No."
  ]
}