{
  "id": 4224,
  "mediaId": 2752,
  "date": "2022-03-06",
  "headline": "My Pillow Guy Just Gonna Sue All Of The Machines, Okay? All Of Them. Stupid Machines.",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzU2MTA4OS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY2MjY1NTQyNH0.Ovz6Xft6SEfN-HgZcIeEaTyjvDC9xMRoqfucZbv0Jg8/img.png?width=1200&coordinates=0%2C12%2C0%2C12&height=600",
  "link": "https://www.wonkette.com/my-pillow-guy-just-gonna-sue-all-of-the-machines-okay-all-of-them-stupid-machines",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robyn Pennacchia",
  "authorUrl": "https://www.wonkette.com/u/robyn_pennacchia",
  "termIds": [
    0
  ],
  "sentences": [
    "“We’re gonna get rid of these machines once and for all for any election in history.” In a late-night exchange with the Daily Beast after this story was posted, Lindell added one qualifier: “All voting machines!",
    "Yesterday, during a rally to support support of Arizona GOP gubernatorial candidate Kari Lake Lindell announced his intentions to sue \"the machines” that stole Donald Trump's rightful presidency from him.",
    "At the 2022 Conservative Political Action Conference, she asked the crowd to boo the media and unironically people to “tell the truth” about the election Donald Trump lost.",
    "America's most famous pillow impresario (largely due to a lack of other pillow impresarios) has not yet given up on his dream of Making Donald Trump President Again.",
    "It is a defective product class action lawsuit.” Lake, too, is also a proponent of the false idea that the 2020 election was stolen from Donald Trump.",
    "Perhaps his best bet is just to curl up with a nice MyPillow and MyBlanket in his MyPajamas and have a good hard cry and a good long nap.",
    "In an statement following the appearance, Lindell clarified to The Daily Beast that he was speaking about voting machines.",
    "He's so desperate that it's hard not to feel badly for him for a moment before remembering what his deal actually is.",
    "“They’re defective devices,” he said, claiming he’s already gotten about 300 county officials nationwide on board.",
    "Although just to be safe, we should all keep a close eye on our dishwashers.",
    "Hide your robots, hide your toaster — Mike Lindell is coming!",
    "Wonkette is independent and fully funded by readers like you.",
    "He's such a sad person.",
    "Click below to tip us!"
  ]
}