{
  "id": 4370,
  "mediaId": 2522,
  "date": "2022-03-06",
  "headline": "Mike Lindell to file class action lawsuit ‘to get rid of’ defective voting machines; libs deflect with ridicule",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/03/SG-Lindell.jpg",
  "link": "https://www.bizpacreview.com/2022/03/06/mike-lindell-to-file-class-action-lawsuit-to-get-rid-of-defective-voting-machines-libs-deflect-with-ridicule-1209158/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Haggerty",
  "authorUrl": "https://www.bizpacreview.com/author/kevin-haggerty/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ron DeSantis (R) commented on outside influences impacting policies in America saying, “If you’re somebody that will light your hair on fire because Georgia is requiring voter ID but yet you’re lining your pocket with money from China and not a peep about the slave labor that’s going on over there, you, my friend, are a hypocrite, and you’re not somebody that should be taken seriously.”\nAlong with the jabs at Lindell, there was also signs of support:\nI hope this includes those colorful iMacs from 90s computer labs https://t.co/FgxcEeyK0m\n— Phil Kennedy (@BuffaloKennedy) March 6, 2022\n– there were still showings of support for the stalwart businessman.",
    "Comparing the voting machines used in the 2020 election to bad brakes on a car, he explained that the suit charges the machines are “considered defective devices.”\nRegardless of the severity of the claims, or perhaps because of them, liberals couldn’t help but tear into the entrepreneur over his explanation that the suit was against “all machines.”\nmy apartment building washer unit isn’t going to know what hit it!",
    "“It’s a class action lawsuit against all machines and that they’re defective devices.”\nMike Lindell announces a class action lawsuit against “all machines” pic.twitter.com/ZokLXQhNuN\n— Acyn (@Acyn) March 5, 2022\n“We’re getting county commissioners, county clerks, they’re all the plaintiffs,” he added.",
    "Minnesota Bank & Trust and Heartland Financial USA announcement that they were de-banking Lindell prompted him to state, “These guys have an agenda, there’s something wrong, or they would’ve done something before.”\nLindell doesn’t stand alone in his fight to shore up the integrity of the elections.",
    "https://t.co/7ipTwB2OJh\n— Brian Tyler Cohen (@briantylercohen) March 5, 2022\nWhile some mused about their appliances needing good legal representation, others suggested that this would be part of a future war with machines so often depicted in cinema.",
    "(@liberalpuppy) March 6, 2022\n— Mountain Man (@Mountai45028575) March 6, 2022\nDespite repeatedly coming under fire, Lindell has persisted in his challenges against corruption throughout the United States government.",
    "Lindell, founder and CEO of MyPillow, was in attendance at the “Kari Lake Rock and Roll Rodeo” in Morristown, AZ to support Lake, a former journalist, in her bid to be the Republican nominee for governor of Arizona.",
    "And we’re gonna get rid of these machines once and for all for any election in history.”\nLindell had taken time to speak with RSBN’s Brian Glenn before his on stage appearance to provide details on the lawsuit.",
    "SIGN UP HERE\nMike Lindell announced Saturday that he would be launching an historic class-action lawsuit to protect voter integrity and earned himself ridicule from liberals over his word choice.",
    "The coming war between man and machines will be handled in the courts\n— James Urbaniak (@JamesUrbaniak) March 5, 2022\nThe machines win the suit and THAT begins the Terminator origin story…\n— ?",
    "In January it was reported that Lindell had filed a lawsuit against House Speaker Nancy Pelosi (D-CA) and the January 6 committee to prevent Verizon from releasing his phone records.",
    "BREAKING: Mike Lindell announces he is filing a class-action lawsuit next week to get rid of 'defective' voting machines pic.twitter.com/RZ6IJB46Le\n— RSBN ????",
    "— bevy (@bevy72953890) March 6, 2022\nGreat news it’s about time\n— mike navarro (@mikenav36221825) March 5, 2022\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "(@RSBNetwork) March 5, 2022\n“It’s the most important class-action lawsuit in American history – in world history,” Lindell expressed.",
    "Governors across the nation have signed new laws since 2020 and some have spoken up about their motivations.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "— Zachary Petrizzo (@ZTPetrizzo) March 6, 2022\nMy sewing machine has a real good lawyer, Mike.",
    "— Russell Holly (@russellholly) March 6, 2022\nI hope everyone's microwaves are lawyering up.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "The attempt to gain access to his records was followed by his banks cutting ties with him.",
    "Lindell took the stage during the rally to inform the crowd of his new litigation.",
    "(Mike Lindell)\n— Karen Kline (@ConsiderThis1) March 6, 2022\nLove this man!",
    "Get the latest BPR news delivered free to your inbox daily.",
    "“I’ve been working on it five months…” Lindell explained.",
    "The public will not see it and we do not share it.",
    "“And we’ve already got about 300 onboard.",
    "I love that guy!!!",
    "?Liberal Puppy??",
    "Florida Gov.",
    "Good luck.",
    "??"
  ]
}