{
  "id": 4851,
  "mediaId": 2641,
  "date": "2022-02-15",
  "headline": "Trump: 'RINO' Gov. Ducey Wouldn't Win GOP Senatorial Primary",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=a3f862e0-4dca-48b8-97e5-a3816ad1cf20&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/donald-trump-doug-ducey-arizona-senate/2022/02/15/id/1056893/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlie McCarthy",
  "authorUrl": "",
  "termIds": [
    1941,
    2201,
    2321,
    3975,
    878,
    4830,
    5128
  ],
  "sentences": [
    "Arizona Attorney General Mark Brnovich, businessman Jim Lamon, venture capitalist Blake Masters, and Mick McGuire, former adjutant general of the Arizona National Guard are campaigning to win the GOP senatorial primary, the Washington Examiner reported.",
    "Although Ducey has signaled he's inclined to pass on a Senate run, some Republicans remain hopeful he will reverse course and jump into the primary before the early April deadline for candidates to file their intent to run.",
    "A Republican-backed review of the 2020 presidential election in Maricopa County, Arizona's largest county, ended in late September without proof supporting Trump's claims of a stolen election.",
    "Trump and allies insist voter fraud in Maricopa County led to President Joe Biden's victory in the state by little more than 10,000 votes, and that Ducey did nothing about it.",
    "Senate Minority Leader Mitch McConnell, R-Ky., last week said Ducey \"would be a star candidate\" in the Republican field for the 2022 election.",
    "\"MAGA will never accept RINO Governor Doug Ducey of Arizona running for the U.S. Senate — So save your time, money, and energy, Mitch!\"",
    "Former President Donald Trump on Monday warned that his strongest supporters would not back a senatorial campaign by Arizona Gov.",
    "Kari Lake, a former TV news anchor endorsed by Trump, led in a late-November poll of the 2022 GOP gubernatorial candidates.",
    "Ducey, who won reelection in 2018 in a landslide, could be the Republican with the best chance of defeating Kelly.",
    "Several Republicans already are vying to run against Sen. Mark Kelly, D-Ariz., in the key battleground state.",
    "The former president blames Ducey for not helping to overturn his 2020 presidential election loss in Arizona.",
    "Trump also has criticized Brnovich for not doing more to investigate claims of a stolen election.",
    "Trump said in a statement released by his Save America joint fundraising committee.",
    "Term limits prevent Ducey from seeking another term.",
    "Trump disagreed.",
    "Doug Ducey."
  ]
}