{
  "id": 4932,
  "mediaId": 2578,
  "date": "2022-02-21",
  "headline": "INCREDIBLE! Arizona Gubernatorial Candidate Kari Lake DESTROYS Fake News Media – Kari’s First Political Ad Will Expose the BS on Arizona Stations During Their News Programs",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/A667597F-3208-44E2-9BF9-C6CC35A5E344.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/incredible-arizona-gubernatorial-candidate-kari-lake-destroys-fake-news-media-bold-first-political-ad-will-expose-bs-shows/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    1872,
    2153,
    2201,
    1094,
    4830
  ],
  "sentences": [
    "Watch this “60 Minutes” Australia Reporter B*tch and Whine After He Just GOT SCHOOLED by Kari Lake — Then GETS SCHOOLED Again (VIDEO)\nThe video, titled “Rigged Elections Have Consequences” calls out the fake news media for their silence on the 2020 election and lists the terrible consequences we face, including our weak southern border and rampant inflation.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nKari Lake proves her point by including footage of several ballot harvesters from the upcoming movie “2000 Mules”.",
    "KPHO 6:30am & 7:58am\nKTVK 12:28p\nKSAZ 6:22p\nKNXV 4:23p\nKPNX 10:22\nKOLD 6:58a\nKVOA 6:51a & 5:22p\nKYMA 6:45a, 4:45p $ 6:18p\nNYMA 6:18a, 5:17p & 6:04p\nKari Lake gave The Gateway Pundit this statement.",
    "The fake news outlets will be required under FCC guidelines to air the commercial that absolutely exposes their companies and sheds light on the stolen 2020 election.",
    "We’ll get the homeless out of our parks and off our streets, and no more masks, swabs, or shots to go to work or go to school.",
    "As a walkaway FOX 10 news anchor, Kari Lake knows the tactics of the lying fake news media, and she is always one step ahead.",
    "I am not a conventional, boring Politician so it should surprise no one that I don’t have conventional, boring campaign ads.",
    "I am the only Candidate with bold solutions to the problems we face and I lay many of them out in our first ad.",
    "Trump-endorsed Arizona Gubernatorial Candidate Kari Lake‘s first television campaign advertisement will air.",
    "Today, Kari Lake will tell Arizona news viewers,\nI’m Kari Lake, the Trump-endorsed candidate for governor.",
    "Lake has a history of exposing fake news BS and she is doing it now with a commercial that they must play.",
    "If you’re watching this Ad right now, it means you’re in the middle of watching a fake news program.",
    "When I’m Governor I will finish the wall and criminals who cross our border will be sent back.",
    "Kari Lake: My first TV Ad, titled “Rigged Elections Have Consequences” airs this Monday!",
    "Because they won’t even cover the biggest story out there, the rigged election of 2020.",
    "The commercial will play on the following news channels at the following times.",
    "I’m the only candidate with a plan to tackle all of those issues and more.",
    "Soaring prices, a spike in homelessness, and an invasion on our border.",
    "Her ad will only run during news shows on news stations across Arizona.",
    "If the Fake News refuses to tell the truth, it’s up to us to do so.",
    "Now let’s send the corrupt news the lesson and turn them off.",
    "To see where I stand on all the issues go to KariLake.com.",
    "Our kids will get a real education, not a brainwashing.",
    "And it will ONLY air during fake news programs.",
    "And rigged elections have consequences.",
    "You know how to know it’s fake?",
    "And she is right to do so.",
    "We’re all feeling it.",
    "Get ready!",
    "WATCH:",
    "EPIC!"
  ]
}