{
  "id": 5115,
  "mediaId": 2664,
  "date": "2022-02-22",
  "headline": "Pro-Trump Arizona candidate gets promptly smacked down after falsely claiming her ads were being censored",
  "image": "https://www.rawstory.com/media-library/kari-lake.jpg?id=27567204&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/kari-lake-2656771541/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    1284,
    2153,
    3736,
    371,
    1094,
    4830,
    5245
  ],
  "sentences": [
    "She has also campaigned with a number of fringe figures, including Ethan Schmidt-Crockett, an outspoken Nazi sympathizer who terrorized a wig shop for cancer patients over their COVID masking policy, and Ron Watkins, who has been accused by some cyber experts of being the mysterious \"Q\" behind the QAnon conspiracy theory movement (although he denies this.)",
    "On Tuesday, former local news anchor and pro-Trump Arizona gubernatorial candidate Kari Lake took to Twitter to accuse Phoenix's 12 News of illegally refusing to air her political ad — which if true would run afoul of Federal Communications Commission rules prohibiting broadcasters from censoring political ads based on their content.",
    "?\\n(Federal law requires broadcasters accept candidates' political ads regardless of content)https://twitter.com/KariLake/status/1495892762985570306\\u00a0\\u2026\n— Kari Lake for AZ Governor (@Kari Lake for AZ Governor) 1645510298\nBut 12 News swiftly handed down a response.",
    "She has endlessly promoted Donald Trump's \"Big Lie\" that the 2020 election was stolen, even calling for the arrest of her most prominent Democratic opponent, current Arizona Secretary of State Katie Hobbs.",
    "My campaign ad was scheduled to air at 1022pm on @12News (the station that employs the Leftist political reporter @brahmresnik who once called AZ GOP Nazis) \\nI heard it didn't air.",
    "\"Lake's media buying company, Strategic Media Placement, Inc., placed one commercial spot on 12 News for the week of Feb. 21-27.",
    "The order indicates the singular spot could air Monday or Tuesday evening during the 10 p.m. news,\" wrote the station.",
    "They had not, in fact, censored Lake's ad — she had just been confused about the time range in which the ad could air.",
    "she tweeted, adding that 12 News \"employs the Leftist political reporter Brahm Resnik who once called AZ GOP Nazis.\"",
    "Lake's candidacy for governor of Arizona has been fraught with controversy from the start.",
    "NOW WATCH: This is official correspondence’: Trump emails ‘TOP SECRET’ fundraising video",
    "\"The purchase was made with 12 News on Friday, Feb.",
    "\"I heard it didn't air.",
    "Why??\"",
    "Why?",
    "18.\""
  ]
}