{
  "id": 5127,
  "mediaId": 2547,
  "date": "2022-02-14",
  "headline": "Is There Any Such Thing As An Unelectable Republican Now?",
  "image": "https://crooksandliars.com/files/primary_image/22/02/mcconnell_trump_trouble_in_paradise.jpg",
  "link": "https://crooksandliars.com/2022/02/there-any-such-thing-unelectable",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve M.",
  "authorUrl": "https://crooksandliars.com/team/steve-m",
  "termIds": [
    1684,
    1941,
    2201,
    2321,
    2725,
    2737,
    3434,
    4397,
    878,
    4830
  ],
  "sentences": [
    "Eric Greitens has been credibly accused of financial crimes and sexual assault and was forced to resign as governor of Missouri a few years back; he now leads in primary polls and has internal polling from a reputable pollster showing him with significant leads against both unnamed and named Democrats.",
    "“We changed the business model in 2014, and have not had one of these goofballs nominated since,” he told a group of donors on a private conference call last year, according to a recording obtained by The New York Times.",
    "I wrote about this on Tuesday -- about McConnell's frustration that he can't get outgoing anti-Trump governor Larry Hogan to run for the Maryland Senate seat or Governor Chris Sununu to run for the one in New Hampshire.",
    "The Times story tells us:\nMr. Trump has made clear he wants the Senate candidates he backs to oust Mr. McConnell from his leadership perch, and even considered making a pledge to do so a condition of his endorsement.",
    "As Mr. Trump works to retain his hold on the Republican Party, elevating a slate of friendly candidates in midterm elections, Mr. McConnell and his allies are quietly, desperately maneuvering to try to thwart him.",
    "Trump has vowed never to endorse Ducey, who wouldn't help Trump overturn Arizona's 2020 election results, but Trump has also criticized Brnovich in the past for the same reason, though they're friendlier now.",
    "The Senate Republican leader has been worried that Mr. Trump will tap candidates too weak to win in the general election, the sort of nominees who cost the party control of the Senate in 2010 and 2012.",
    "I think McConnell is worried about nothing -- unless what he's really worried about is the possibility that Republicans will win back the Senate and depose him as party leader, following Trump's lead.",
    "It’s all aimed at recapturing the Senate majority, but the election also represents what could be Republicans’ last chance to reverse the spread of Trumpism before it fully consumes their party.",
    "In blue states, sure -- Lee Zeldin, the probable Republican candidate for governor of New York who just nominated Jared Kushner for a Nobel Peace Prize, is not likely to win in November.",
    "For example, no matter who wins the Republican Senate primary in Arizona, the gubernatorial primary (Ducey is term-limited) will probably be won by a Trumpist lunatic named Kari Lake.",
    "A recent poll shows the current GOP front-runner in that race, Attorney General Mark Brnovich, within two points of the incumbent Mark Kelly, while Ducey is within three points.",
    "establishment, for months has been engaged in a high-stakes candidate recruitment campaign, full of phone calls, meetings, polling memos and promises of millions of dollars.",
    "But Herschel Walker, who threatened his ex-wife's life on more than one occasion and has other baggage, is slightly ahead of incumbent Raphael Warnock in most polls.",
    "“Only two of them have taken me on,” he crowed, alluding to [Kelly] Tshibaka in Alaska, and Eric Greitens, the former Missouri governor running for an open seat.",
    "If she loses the primary, it'll be to this guy:\nLake was trailing her likely Democratic opponent by only 4 in a November poll.",
    "Jonathan Martin of The New York Times tells us that Mitch McConnell is trying to outmaneuver Donald Trump in 2022.",
    "Today's story cites McConnell's effort to recruit Doug Ducey, yet another governor, in the Arizona Senate race.",
    "McConnell seems to believe that Trumpy candidates could jeopardize his chances of being majority leader again.",
    "(Trump is demanding that Brnovich indict election officials for doing their jobs in 2020.",
    "In a GOP wave year, a ver Trumpy candidate could prevail in a general election.",
    "Few have done so to date, a fact Mr. McConnell considers a victory.",
    "In the latter case, I'm not sure what McConnell is worried about.",
    "The loose alliance, which was once thought of as the G.O.P.",
    "But are there unelectable \"goofball\" candidates anymore?",
    "(McConnell, as the Times story notes, now backs Walker.)",
    "Don't imagine that he's trying to save the country.",
    "He can't stop the overall trend toward Trumpism.",
    "McConnell might just be trying to save his job.",
    "But pressure could build after the election.",
    "But McConnell will try to save his job.",
    "It hasn't happened yet.)",
    "(Salmon trailed by 8.)",
    "Topics:"
  ]
}