{
  "id": 5554,
  "mediaId": 2662,
  "date": "2022-02-03",
  "headline": "“When You’re Lying to the People and You’re the Media, It’s a Bad Business Model” — MUST SEE: AZ Gubernatorial Candidate Kari Lake ABSOLUTELY DESTROYS ABC Rookie Reporter in Attempted Hit Job (VIDEO)",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/kari-lake-epic-abc-.jpg",
  "link": "https://www.thegatewaypundit.com/2022/02/lying-people-media-bad-business-model-must-see-az-gubernatorial-candidate-kari-lake-absolutely-destroys-abc-rookie-reporter-attempted-hit-job-v/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/jim-hoft/",
  "termIds": [
    1872,
    2153,
    3267,
    33,
    878,
    1094,
    4830,
    5287
  ],
  "sentences": [
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nKari Lake: Well he’s obviously sitting in the White House.",
    "Media is doing a huge disservice to this country and the people aren’t getting the full story…\n…Media, whose numbers are dropping, dropping like a rock, are going to continue to drop.",
    "ABC News, CNN, MSNBC, spent more than three years lying to the American people saying that Russia colluded with Donald J. Trump to steal an election in 2016.",
    "The far left reporter tried to set Kari up instead she got a bruising tongue lashing by one of the rising stars in the Republican Party.",
    "pic.twitter.com/KnDC2jHXVB\n— Kari Lake for AZ Governor (@KariLake) February 3, 2022\nKari Lake is acting like a seasoned professional.",
    "The problem is that the American people don’t have all the answers because the media is part of the problem.",
    "Taping the interview herself is something most weak-kneed Republican losers would never think of.",
    "Arizona gubernatorial candidate Kari Lake was recently interviewed by an ABC rookie journalist.",
    "They’re not reporting on these ballot traffickers that are being paid to drop off ballots.",
    "Because the media has turned their back on the people of America and not been honest.",
    "pic.twitter.com/KnDC2jHXVB\n— Kari Lake for AZ Governor (@KariLake) February 3, 2022",
    "I did an interview with @ABC… will they include this portion of it in their piece?",
    "I did an interview with @ABC… will they include this portion of it in their piece?",
    "When you’re lying to the people and you’re the media, it’s a bad business model.",
    "They continue to try and stump me, but I know their game better than they do.",
    "They continue to try and stump me, but I know their game better than they do.",
    "We have evidence of corruption in our election and they refuse to cover it.",
    "They knew they were peddling lies and they did nothing to stop it.",
    "Kari Lake: Do you think Joe Biden garnered 81 million votes?",
    "And I think their days are numbered surviving all of this.",
    "Why won’t they just do their job and report the truth?",
    "Why won’t they just do their job and report the truth?",
    "They refuse to be honest with people of this country.",
    "They’re not reporting what’s happening in Georgia.",
    "Reporter: Do you think Joe Biden is the president?",
    "Media’s never reported our forensic audit fairly.",
    "Reporter: Do you think the election was stolen?",
    "WATCH: The Media just won’t learn their lesson.",
    "WATCH: The Media just won’t learn their lesson.",
    "It is disgusting what thee media has done.",
    "ABC sent out a child to take down a giant.",
    "It was a complete hoax and it was a lie.",
    "And pretty soon nobody will be watching.",
    "Kari Lake: Do you think it was stolen?",
    "Do you think the elections were fair?",
    "And now they’re doing the opposite.",
    "And they knew that was false.",
    "Reporter: I have no comment.",
    "Do you think he’s president?",
    "Media’s not reporting it.",
    "Kari Lake is EXCEPTIONAL!",
    "This wasn’t even fair.",
    "This was BRUTAL!",
    "GO KARI LAKE!"
  ]
}