{
  "id": 5652,
  "mediaId": 2557,
  "date": "2022-02-04",
  "headline": "WATCH: GOP governor candidate turns tables on reporter regarding 2020",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/02/GettyImages-1364899579-e1643993656539.jpg",
  "link": "https://dennismichaellynch.com/watch-gop-governor-candidate-turns-the-tables-on-news-reporter/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    2153,
    2201,
    878,
    4830,
    5082,
    5245
  ],
  "sentences": [
    "In her resignation from the news industry, Lake said she was being forced to report information on air that “I didn’t believe was fully truthful or only told part of the story, and I began to feel that I was contributing to the fear and division in this country by continuing on in this profession.”\nIn September, Lake released a campaign video, thanking former President Donald Trump for his endorsement of her race for the governor of Arizona.",
    "Kari Lake, a Trump-endorsed Republican candidate for governor in Arizona, consented to an interview with ABC News this week, and shared footage from that interview in a Twitter post on Thursday, as she fired back at the reporter who attempted to catch her off guard.",
    "“The media, whose numbers are dropping like a rock are going to continue to drop, and pretty soon nobody will be watching because the media has turned their back on the people of America,” Lake said.",
    "“ABC News, CNN, MSNBC… spent more than three years lying to the American people, saying Russia colluded with Donald Trump to steal an election in 2016, and they knew that was false.",
    "In the video clip of her interview with ABC News, the reporter, asked, “Do you think Joe Biden is the current president?”\n“He’s obviously sitting in the White House.",
    "DONATE: https://t.co/wIM2GTDtG0 pic.twitter.com/543NQOeXS3\n— Kari Lake for AZ Governor (@KariLake) September 28, 2021\nListen to the latest daily DML podcasts below!",
    "— Kari Lake for AZ Governor (@KariLake) February 3, 2022\nLake, 52, worked as a television news anchor in Phoenix for 22 years until she stepped down in March 2021.",
    "Why won’t they just do their job and report the truth?”\n“Will @MarthaRaddatz put some of the substantive portions of the interview in her story?",
    "The problem is the American people don’t have all the answers because the media is part of the problem.”\n“The media is not reporting it.",
    "Lake retorted, “Do you think the election was stolen?”\nThen Lake unleashed, saying, “Do you think Joe Biden garnered 81 million votes?",
    "WATCH the full exchange in the video below:\nWill @MarthaRaddatz put some of the substantive portions of the interview in her story?",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "They knew they were peddling lies and they did nothing to stop it,” she told the reporter.",
    "Sharing the video clip on Twitter, Lake wrote, “The Media just won’t learn their lesson.",
    "They’re not reporting on the ballot traffickers who are being paid to drop off ballots.",
    "I did an interview with @ABC… will they include this portion of it in their piece?",
    "They continue to try and stump me, but I know their game better than they do.",
    "President Trump, you inspired MILLIONS of Americans — myself included.",
    "“Do you think the 2020 election was stolen?” the reporter tried again.",
    "The media is doing a huge disservice to this country,” she continued.",
    "The media has never reported our forensic audit fairly.",
    "The media is not reporting what’s happening in Georgia.",
    "We filmed the whole thing just in case!” Lake added.",
    "I will never let the Great People of Arizona down.",
    "Do you think he’s the president?” Lake fired back.",
    "Thank you so much for your Endorsement.",
    "We filmed the whole thing just in case!",
    "Do you think the elections were fair?",
    "I will never let you down.",
    "We have a Country to save.",
    "Then please share."
  ]
}