{
  "id": 5939,
  "mediaId": 2557,
  "date": "2022-02-07",
  "headline": "BREAKING: Former State Dept spokesperson announces run for Congress, setting up fiery GOP primary battle",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/02/GettyImages-1176665442-e1644245595739.jpg",
  "link": "https://dennismichaellynch.com/breaking-former-state-dept-spokesperson-announces-run-for-congress-setting-up-fiery-gop-primary-battle/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    2153,
    2201,
    3483,
    4464,
    305,
    878,
    1124,
    5348
  ],
  "sentences": [
    "Morgan was fantastic in her her role working with Secretary Mike Pompeo at the U.S. State Department and understands the threats posed by China, Russia, Iran and others, and will be tough, not just roll over like the Democrats and RINOs.",
    "Morgan Ortagus, who served as a spokesperson for the State Department during the Trump administration, announced Monday morning during a Fox & Friends appearance that she is running for Congress in Tennessee.",
    "He’s a God-fearing man who loves his wonderful family–he’s a true “citizen politician.” Robby will serve the people of Tennessee well.”\nBelow is a campaign ad video Starbuck posted in November.",
    "@robbystarbuck is the correct pick for Tennessee’s 5th district and Tennesseans have his back.”\nKari Lake, Trump-endorsement GOP candidate for governor of Arizona, also objected, tweeting, “.",
    "On Jan. 25, Trump released the following statement: “I am told the very strong and impressive Morgan Ortagus is exploring a run for Congress in Tennessee’s 5th Congressional District.",
    "https://t.co/JR4l5iMScW pic.twitter.com/1OJuhAqEBW\n— Morgan Ortagus (@MorganOrtagus) February 7, 2022\nAfter Trump endorsed Ortagus last month, many other Trump supporters hit back.",
    "Morgan Ortagus will have my Complete and Total Endorsement if she decides to run!”\nOn Twitter Monday morning, Ortagus announced: “I’m running for Congress in TN’s Fifth District!",
    "Former President Donald Trump announced his endorsement for Ortagus last month, before she ever confirmed she would even run.",
    "pic.twitter.com/CAW0ixRq9w\n— Robby Starbuck (@robbystarbuck) November 4, 2021\nListen to the latest daily DML podcasts below!",
    "Now, I’m ready to push back against the Democrats’ extremism in Congress.”\nI’m running for Congress in TN’s Fifth District!",
    "I’m very confident that we’re going to take the House back in November, Ortagus said on Fox & Friends Monday morning.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "Trump’s Admin, I fought for conservative policies that put #AmericaFirst and I’m honored to have his support.",
    "Trump’s Admin, I fought for conservative policies that put #AmericaFirst and I’m honored to have his support.",
    "The MAGA movement needs him in Congress!”\nCandace Owens responded to Trump’s endorsement, saying, “Nope.",
    "I’m running for Congress to ensure tyrants can’t do to what they did to Cuba, where my family fled from.",
    "Rep. Madison Cawthorn tweeted, “I endorsed @robbystarbuck months ago and I stand by my endorsement.",
    "Trump’s endorsement angered many conservatives, who are already staunchly behind Robby Starbuck.",
    "I endorsed Robby months ago & believe he’s exactly what we need in these difficult times.",
    "Ronald Reagan once said it was a time for choosing and it’s a time for choosing again.",
    "I couldn’t be happier because she’s an absolute warrior for America First and MAGA!",
    "Starbuck, 32, a Cuban American, announced his campaign in June of last year.",
    "Now, I’m ready to push back against the Democrats’ extremism in Congress.",
    "She serves in the U.S. Navy Reserves and will fight for our Military.",
    "“I’m raising my hand to run for Congress in Tennessee District 5.",
    "“She won’t bow to the Woke Mob or the Leftist LameStream Media.",
    "This is an increasingly exciting year to run for the House.",
    "We can’t let America fall into the hands of tyrants.",
    "He is the best candidate in the country right now.",
    "@RobbyStarbuck is a patriot who loves America.",
    "The people of Tennessee are amazing.",
    "Trump has this completely wrong.",
    "Will you choose freedom with me?",
    "Then please share.",
    "In Pres.",
    "In Pres."
  ]
}