{
  "id": 5941,
  "mediaId": 2642,
  "date": "2022-02-11",
  "headline": "[VIDEO] CNN Forced to Read Brandon’s New Cratering Approval Numbers on Live TV… And it Was a CNN Poll!",
  "image": "https://waynedupree.com/wp-content/uploads/2022/02/Untitled-819-conflict-14.jpg",
  "link": "https://waynedupree.com/2022/02/cnn-biden-poll/",
  "mediaOutlet": "newsninja2012.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sophie O’Hara",
  "authorUrl": "https://waynedupree.com/author/sophieohara/",
  "termIds": [
    0
  ],
  "sentences": [
    "He’s in mid 30’s.”\n“Can’t put a positive spin on the facts!”\n“The White House is about to call his producer.”\n“When CNN admits 56% of Americans say Biden has done nothing for them”\n“Love how they try to justify the negatives with a somewhat off the wall let’s give it a positive spin?",
    "A shockingly bad new poll showed that a staggering number of Americans disapprove of the way Biden is handling the economy, COVID, and inflation.",
    "During a recent segment, CNN’s John King was forced to stand there and read off horrific recent polling numbers for Biden…and it was THEIR POLL.",
    "It’s great to watch CNN squirm and users online really reveled in it:\n“CNN poll, you can subtract at least 6 points from approval.",
    "?”\nAnd the best part is that you know these numbers are actually a helluva lot worse than what the pollster are showing.",
    "Watch the video:\nCNN Forced to Read Joe Brandon's FAILING Poll Numbers on LIVE TV— Biden Regime is OVER.",
    "Just when you think Bumbling Joe has hit rock bottom, he does the impossible and goes even lower.",
    "What’s happening to CNN right now is so pathetic, yet hilarious at the same time.",
    "They’re being forced to eat their own words, and it’s really a sight to see.",
    "Most Americans think Biden has done literally NOTHING since being in office.",
    "The Biden/CNN partnership is definitely coming to a very climactic end.",
    "— Benny (@bennyjohnson) February 10, 2022\nPretty rough, right?",
    "Biden is cratering in ways that nobody thought possible.",
    "Their “king” has fallen, and they can’t hide it anymore.",
    "And CNN now must report on the abysmal failure, LIVE.",
    "?”\n“Numbers don’t lie, folks.”\n“This was HILARIOUS!!",
    "So much for those “81 million legal votes,” right?",
    "It wasn’t pretty, but it’s pretty amusing.",
    "And they have a lot to talk about.",
    "Best part: It was a **CNN** poll!",
    "Good riddance to fake rubbish.",
    "And the worst part?",
    "Sad but true.",
    "?????"
  ]
}