{
  "id": 6114,
  "mediaId": 2594,
  "date": "2022-02-03",
  "headline": "How members of Congress plan to stop the next Trump from stealing a presidential election",
  "image": "https://static.independent.co.uk/2022/02/02/15/urnpublicidap.org2be7ee7312ca41969922ebe4a1b2bfeb.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/electoral-college-count-act-trump-b2006237.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Woodward",
  "authorUrl": "https://www.independent.co.uk/author/alex-woodward",
  "termIds": [
    1402,
    1552,
    2153,
    2187,
    2201,
    2783,
    2906,
    3713,
    1124
  ],
  "sentences": [
    "One group of senators – Dick Durbin, Angus King and Amy Klobuchar – said the Electoral Count Act “needs to be updated to reflect the current realities and threats facing the United States and our election process.”\n“Taken together, the proposed legislation would confront electoral subversion at both the state and federal levels by helping ensure that partisan politicians cannot substitute their own preferences for the judgment of the American people in presidential elections,” they said.",
    "Instead, the proposed reforms would prohibit the executive branch and members of Congress from rejecting election outcomes, after dozens of Republican members of Congress objected to state results from 2020, and the former president pressured Mike Pence to reject them entirely – all of which fuelled violence in the halls of Congress from a pro-Trump mob that sought to stop the process on 6 January, 2021.",
    "Ms Lake has baselessly called for the imprisonment of the state’s Democratic secretary of state, amplified bogus election fraud conspiracy theories, and characterised the results of the 2020 election as “stolen”, while Mr Perdue is running against Georgia’s Republican Governor Brian Kemp, a frequent target of Mr Trump for inadequate loyalty to his attempts to overturn the state’s results.",
    "US Rep Zoe Lofgren, the chair of a House committee reviewing changes to the law, called it “antiquated, incomplete, vague, and open to exploitation.”\n“But to be clear, reforming the Electoral Count Act, necessary as it is, would not restrain the erosion of democracy or the dishonest efforts across the nation to diminish and impede the equal freedom to vote,” she said.",
    "Vulnerabilities in the law could also potentially set up a scenario in which a Republican governor and a hyperpartisan House of Representatives could work together to “reverse the results of the election in a critical swing state, and with it the outcome of the Electoral College,” according to Yale Law School Center for Private Law fellow Matthew Seligman.",
    "GOP officials and election deniers in several states have proposed replacing election administrators with conspiracy theorists, stripping oversight from nonpartisan election officials, and running for secretaries of state or governors’ offices that could have final say on whether to approve the slate of electors for a presidential candidate.",
    "Another bipartisan group of 16 senators – including Republicans Susan Collins and Lisa Murkoswki with Democrat Joe Manchin – is also looking at the Electoral Count Act reform with an eye on voting rights and protecting election workers, who have faced increased threats and harassment as they help run the nation’s elections.",
    "Though then-vice president Pence ignored Mr Trump’s commands that day, the former president has falsely insisted that he “could have overturned the election” – weaponising ambiguities in a confusingly worded law, and manipulated by his allies who pushed plans for states to send conflicting slates of electors to Congress.",
    "He could have overturned the Election!”\nWhile American voters do ultimately cast their ballots for a presidential candidate, they do so indirectly – they are voting for a slate of electors who were selected by their respective parties, who then cast their votes when the Electoral College convenes in December.",
    "Meanwhile, Republican-dominated legislatures and local governments have introduced dozens of measures to put electoral oversight, vote counting and certification into the hands of GOP officials, who could end up wielding more influence over the results handed to Congress in future elections.",
    "Following Donald Trump’s ongoing attempts to overturn the results of the 2020 presidential election, members of Congress are working on legislation to update an archaic 19th century law in the hopes of preventing lawmakers and the White House from undermining future elections.",
    "Revisions to the 135-year-old Electoral Count Act come on the heels of Congress’ failure to pass federal voting rights legislation, which advocates argue is critical to stop a wave of subversive, anti-democratic threats to US elections playing out in nearly every state.",
    "Members of Congress are working with some urgency – as 2024 approaches – to review changes to the law that would make it more difficult to challenge results and explicitly clarify that, no, the vice president cannot toss out the results of an election.",
    "The law’s passage came a decade after the contested 1876 election between Rutherford Hayes and Samuel Tilden, marred by widespread disenfranchisement, violence and intimidation against Black voters in the South in the post-Civil War Reconstruction era.",
    "Both parties from three southern states sent their own set of electoral votes to Congress, forcing legislators to create a commission to resolve the election and allegations of fraud – from states that violently disenfranchised Black voters.",
    "At least 51 people who denied the outcome of the 2020 presidential election are running for governor in 24 states, and at least 21 others are running for secretary of state in 18 states, according to States United Democracy Center.",
    "Recommended\nWhile the law ostensibly solved how Congress could handle contested results, despite its ambiguous framework, the nation’s electoral dysfunction – often at the expense of disenfranchising Black voters – has persisted.",
    "“How come the Democrats and RINO Republicans, like Wacky Susan Collins, are desperately trying to pass legislation that will not allow the Vice President to change the results of the election?” he said in a statement on Sunday.",
    "The story of the Electoral Count Act of 1887 emerged from some of the same anti-democratic themes surrounding contemporary voting rights battles – racism, voter suppression and bureaucratic dysfunction fuelling discrimination.",
    "The growing urgency to reform the law came as the former president made his most unambiguous admission yet that he wanted his vice president to toss out votes representing millions of Americans to keep him in power.",
    "The various what-if scenarios worrying democratic groups and legal experts – illustrated by Insider’s Grace Panetta – have added urgency to members of Congress hoping to prevent chaos in 2024.",
    "Among them are Trump-endorsed candidates running for governor in closely watched states that voted for Joe Biden: Kari Lake of Arizona and former US Senator David Perdue of Georgia.",
    "The Electoral Count Act establishes a timetable for the counting process as well as a formal process for states to submit their Electoral College votes to Congress.",
    "Federal voting rights legislation, which included some provisions to block that kind of partisan interference, was repeatedly blocked by Republican senators.",
    "“Actually, what they are saying, is that Mike Pence did have the right to change the outcome, and they now want to take that right away.",
    "It also establishes a convoluted framework for resolving disputes in the event state officials submit multiple slates of electors.",
    "Neither Ms Lake nor Mr Perdue said they would have certified the results of the 2020 election if they were in office at the time.",
    "What happens if they reject the outcome of future presidential elections in their states, if they’re elected?",
    "In all, election denialism is fuelling dozens of campaigns for public office across the US.",
    "It took a decade to draft a law to prevent a similar electoral crisis.",
    "Unfortunately, he didn’t exercise that power.",
    "Additional reporting by Eric Garcia"
  ]
}