{
  "id": 6146,
  "mediaId": 2752,
  "date": "2022-02-02",
  "headline": "Is Trump-Endorsed Kari Lake Too Coup-Coup For Arizona Gov?",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTIyMTgzOC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY3MjE1MDEzN30.q9DGGCbEgF8lP1m_7afSKfUiFUkxfgZb_A63OeKn1YA/img.png?width=1200&coordinates=0%2C0%2C0%2C144&height=600",
  "link": "https://www.wonkette.com/is-trump-endorsed-gov-candidate-kari-lake-too-coup-coup-for-arizona-gop",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    0
  ],
  "sentences": [
    "Lake later replied to a tweet from Senator Tom Cotton who demanded to know when “the left wing mob will call on [Dr. Anthony Fauci] to be censored?” I presume he meant censured because Dr. Fauci’s a doctor, not a podcaster like Joe Rogan, who also enjoys the smooth, refreshing taste of Ivermectin.",
    "Hobbs has apologized for the \"real harm I caused Ms. Adams and her family.” She’s admitted that her initial response to the jury verdict was \"short-sighted,” “unnecessarily defensive” and “failed to meet the moment.” That’s something, right?",
    "A federal jury ruled unanimously in November that Talonya Adams, a former legislative staffer, was fired in 2015 for complaining that she was paid less than her white and male colleagues in the Arizona state Senate.",
    "SALMON: [Lake] is a lifelong member of the liberal media who knows how to put on a show, and she will parrot whatever convenient political slogan is on the teleprompter in front of her to get ahead.",
    "Republican consultant Chris Baker told the Arizona Republic that her polling fall suggests there’s a limit to the appeal of a candidate who pals around with QAnon activists and Nazi sympathizers.",
    "However, Matt Salmon is still a Republican, and he’s predictably attacked Lake’s conservative credentials (as if MAGA has a consistent ideology other than hatred and resentment).",
    "There is no doubt in my mind that Lake would betray President Trump and Republicans writ large the moment things get tough, just like she has done so many times in the past.",
    "Meanwhile, Lake has claimed that the January 6 insurrection suspects were welcome guests at the Capitol, whom the police waved inside like nightclub bouncers.",
    "The former Fox News anchor and January 6 “truther” has Donald Trump’s endorsement, but she’s dropped seven points in GOP primary polling since November.",
    "Secretary of State Katie Hobbs is the likely Democratic nominee, but she has considerable baggage from her involvement in a wrongful termination suit.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Dr. Fauci has committed zero criminal offenses, but locking up your political enemies for BS is a common practice in fascist states.",
    "Embracing the Big Lie means not accepting that Joe Biden actually won Arizona and that the state is more purple now than deep red.",
    "Let’s check in on Arizona gubernatorial candidate Kari Lake, the Republican turned independent then Democrat now MAGA loon.",
    "Lake started out strong (and banana pants) but she’s sucked at outreach to voters who aren’t already on the Trump train.",
    "She has smeared President Trump as ‘vulgar’ and ‘offensive’ and admitted in late 2016 that she was ‘not supporting’ him.",
    "She should’ve taken one of President Joe Biden’s free COVID-19 tests before popping Ivermectins like they’re Tic Tacs.",
    "The OH Predictive Insights survey released last Thursday has Lake ahead at just 21 percent to 17 percent.",
    "We’d love to see Lake flame out in the primary, as that might help weaken Trump’s hold over the GOP.",
    "BAKER: She’s got a ceiling, and my sense is that it will ultimately end up somewhere in the 20s.",
    "Over the course of this campaign, Lake will be revealed for exactly what she is: a fraud.",
    "The FDA keeps telling these fools that they shouldn’t take Ivermectin to treat COVID-19.",
    "Monday, she tweeted this infomercial:\nI caught a head cold and felt miserable Sunday.",
    "Democrats (and Kyrsten Sinema of the Sinema Party) have won statewide since 2018.",
    "Former state House Rep. Matt Salmon has gained on Lake in the GOP primary polls.",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "This is a candidate for governor, not the teenage lead in an anti-drug PSA.",
    "C’mon, Arizona, just please vote for whoever isn’t the Republican nominee.",
    "Right now, we just need a governor who won’t overturn Joe Biden’s victory.",
    "Jeff Flake and John McCain were conservative but presented as normal.",
    "Right now, the most extreme in the GOP get all the attention.",
    "What is the punishment for keeping the cure from the people??",
    "He's also on the board of the Portland Playhouse theatre.",
    "Someday Dr. Fauci is going to wish he told us about this.",
    "Today I feel like a million bucks thanks to Ivermectin.",
    "He’s obviously not the kingmaker he imagines himself.",
    "(I took 6 pills & I feel even better than before!)",
    "She can’t even remember how many pills she took!",
    "I dislike every Republican running in this race.",
    "Hobbs was Senate minority leader at the time.",
    "She just says she \"caught a bad a head cold.\"",
    "His son describes him as a “play typer guy.\"",
    "It’s not even clear that Lake had COVID-19.",
    "No wonder she’s feeling under the weather.",
    "Please click the clickie, if you are able.",
    "How often would you like to donate?",
    "Both are now considered weak RINOS.",
    "She might need an intervention.",
    "He writes reviews for the A.V.",
    "How about arrested?",
    "LAKE: Censored??",
    "It’s distorting.",
    "That's you!"
  ]
}