{
  "id": 6219,
  "mediaId": 3987,
  "date": "2022-02-11",
  "headline": "Arizona Republican Candidates Embrace Violence and Racist Conspiracy Theory with Direct Ties to Mass Murder",
  "image": "http://americasvoice.org/wp-content/uploads/2020/12/1920px-Flag_of_Arizona.svg_.png",
  "link": "https://americasvoice.org/blog/arizona-republican-candidates-embrace-violence-and-racist-conspiracy-theory-with-direct-ties-to-mass-murder/?utm_source=rss&utm_medium=rss&utm_campaign=arizona-republican-candidates-embrace-violence-and-racist-conspiracy-theory-with-direct-ties-to-mass-murder",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Mueller",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Steve Gaynor, who was seated next to Salmon on stage, called for Joe Biden’s impeachment and conviction for what is allegedly “happening at the border.” Gaynor followed up on Tuesday, in an op-ed in The Washington Times, where he too amplifies the racist conspiracy theory falsely claiming, “Arizona and our fellow border states are subject to a full-scale invasion caused by his policies.”\nKarrin Taylor Robson has made this lie the thrust of her campaign.",
    "Undeterred, Taylor Robson’s second TV ad, which hit the airwaves at the end of January, begins with the false assertion of a “border invasion.”\nLamon himself has run several ads similarly warning of this fictional “invasion.”\nThe delusions and appeals to violence and white nationalist tropes in Arizona’s Republican gubernatorial primary is far from an outlier.",
    "All the other top candidates jockeying for the gubernatorial nomination have also promoted this same white nationalist conspiracy about an “invasion.” At a debate hosted by the right-wing Center for Arizona Policy Action in partnership with Hugh Hewitt on Saturday, candidate Matt Salmon was emphatic about his belief in the racist conspiracy theory.",
    "This week, Kari Lake, a leading candidate in Arizona’s Republican gubernatorial primary, took to Twitter to defend her commitment to a false racist conspiracy theory – that our nation is somehow experiencing an “invasion” because there has been an increase in people from other nations who are fleeing violence to seek safety and freedom in America.",
    "Republican candidates and office holders must either aggressively repudiate their parties’ demonstrated commitment to this white nationalist lie, or they too will own it, whether or not they walk in lock step with extremists as we are now seeing frome Arizona’s Republican gubernatorial pool.",
    "From Charlottesville, Virginia in 2017 to Pittsburgh, Pennsylvania in 2018 to El Paso, Texas in 2019 to the United States Capital in 2021, the racist fiction that non-white migrants are “invading” and will “replace” white Americans should have no place in mainstream politics.",
    "In her tweet, Lake only had to reach as far as Arizona’s current Attorney General, and GOP candidate for the U.S. Senate, whose office issued a “legal opinion” on Monday supporting the “invasion” claim, which amounts to real-world action based on the white nationalist fraud.",
    "In response to the fictitious “invasion,” Salmon suggested he wanted to reinstate “Joe Arpaio’s tent city” – an outdoor prison that Arpaio himself once referred to as a “concentration camp.” None of the other three candidates on stage challenged Salmon.",
    "Arizona has long been at the center of the debate about immigration, producing some of the most extreme and ugly voices, from Joe Arpaio to Jan Brewer to the violent border posse.",
    "In her first TV ad, Taylor Robson falsely claims “the invasion is well underway.” Fox Sports 1 refused to air Taylor Robson’s “invasion” ad, concerned about its authenticity.",
    "This is the Republican Party now, fully immersed in racist conspiracy theories, while amplifying and legitimizing these ideas in spite of the deadly harm they have inspired.",
    "Unfortunately, Lake’s efforts to double down on this racist fiction is not out of step with the leadership of the national Republican Party or her fellow primary candidates.",
    "Yes, two law enforcement officials, including the President of the federal Border Union appear in an ad that shows shots being fired at the President of the United States.",
    "It’s craven and violent as it is, but Kelly’s wife, Gabby Giffords, was seriously wounded by a gunman back in 2011 when she was a Congresswoman representing Arizona.",
    "No Republican candidate this cycle should be able to sidestep owning up to and explaining their party’s dangerous delusions about race and a hostile invasion.",
    "Speaker Pelosi’s office was broken into on January 6 2021 and many believe she would have been targeted for violence had the rioters had the chance.",
    "At issue here is the fictitious idea that there is an “invasion” of non-white migrants presenting a coordinated threat to the United States.",
    "Lamon’s violent and threatening ad, depicting shots fired at our elected leaders, while extreme, fits a pattern for Republicans this year.",
    "The continued embrace of such ideas by one of the two major political parties presents a real threat to public safety for all Americans.",
    "Republican Senate candidate Jim Lamon produced an ad where he shoots at President Biden, Speaker Pelosi, and Senator Mark Kelly.",
    "Lake’s comments were a response to AZ Central’s alleged refusal to print her op-ed unless she removed the “invasion” reference.",
    "Most are requesting an opportunity to apply for refugee status under our laws and most have been expelled or detained.",
    "They have fully embraced this cynical and deadly message believing it will help them recapture majorities in Congress.",
    "Lamon’s ad features Pinal County Sheriff Mark Lamb and Brandon Judd, who is the President of the Border Patrol Union.",
    "This year, we’re seeing Republican elected officials and candidates pushing even more dangerous xenophobic rhetoric.",
    "This ridiculous story would be laughable if not for the deadly acts it has inspired recently on American soil.",
    "Republicans, from elected leadership to primary contenders, however, clearly disagree.",
    "And, Arizona Republicans are at the forefront.",
    "The GOP primary isn’t until August 2nd.",
    "And, it’s just getting started.",
    "Lake enthusiastically refused.",
    "Kari Lake isn’t alone."
  ]
}