{
  "id": 6275,
  "mediaId": 3987,
  "date": "2022-02-11",
  "headline": "Why Jim Lamon’s Despicable Ad Is Part of a Larger Trend Among Republicans in Arizona and Across U.S.",
  "image": "http://americasvoice.org/wp-content/uploads/2020/12/1920px-Flag_of_Arizona.svg_.png",
  "link": "https://americasvoice.org/press_releases/why-jim-lamons-despicable-ad-is-part-of-a-larger-trend-among-republicans-in-arizona-and-across-u-s/?utm_source=rss&utm_medium=rss&utm_campaign=why-jim-lamons-despicable-ad-is-part-of-a-larger-trend-among-republicans-in-arizona-and-across-u-s",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AV Press Releases",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In a new analysis posted to the America’s Voice website, Mueller highlights why the Jim Lamon ad encapsulates a dangerous trend for Arizona Republicans, with candidates and elected officials embracing the fiction of the racist “Great Replacement Theory” and related “invasion” rhetoric despite the proven deadly consequences (read the whole analysis here and find key excerpts below):\nArizona has long been at the center of the debate about immigration, producing some of the most extreme and ugly voices, from Joe Arpaio to Jan Brewer to the violent border posse.",
    "All the other top candidates jockeying for the gubernatorial nomination have also promoted this same white nationalist conspiracy about an ‘invasion.’ At a debate hosted by the right-wing Center for Arizona Policy Action in partnership with Hugh Hewitt on Saturday, candidate Matt Salmon was emphatic about his belief in the racist conspiracy theory.",
    "This week, Kari Lake, a leading candidate in Arizona’s Republican gubernatorial primary, took to Twitter to defend her commitment to a false racist conspiracy theory – that our nation is somehow experiencing an “invasion” because there has been an increase in people from other nations who are fleeing violence to seek safety and freedom in America.",
    "Republican candidates and office holders must either aggressively repudiate their parties’ demonstrated commitment to this white nationalist lie, or they too will own it, whether or not they walk in lock step with extremists as we are now seeing from Arizona’s Republican candidates.",
    "From Charlottesville, Virginia in 2017 to Pittsburgh, Pennsylvania in 2018 to El Paso, Texas in 2019 to the United States Capital in 2021, the racist fiction that non-white migrants are ‘invading’ and will ‘replace’ white Americans should have no place in mainstream politics.",
    "Washington, DC – Arizona Republican Senate candidate Jim Lamon’s despicable ad where he depicts shooting the President, the Speaker of the House and Arizona Senator Mark Kelly is being widely condemned by observers in his state and across the country (read our take here).",
    "Yet elements of the ad – the endorsement of violence, the inclusion of the “open borders” trope, and the participation of National Border Patrol Union head Brandon Judd – fit into a larger pattern for Republicans in general and the Arizona GOP in particular.",
    "In response to the fictitious ‘invasion,’ Salmon suggested he wanted to reinstate ‘Joe Arpaio’s tent city’ – an outdoor prison that Arpaio himself once referred to as a ‘concentration camp.’ None of the other three candidates on stage challenged Salmon.",
    "According to Zachary Mueller, Senior Political Manager for America’s Voice:\nThis is the Republican Party now, fully immersed in racist conspiracy theories, while amplifying and legitimizing these ideas in spite of the deadly harm they have inspired.",
    "Violence is not just depicted in their ads and encouraged by their leaders, it is seen as a legitimate form of political discourse by too many in the right-wing echo chamber.",
    "Judd also recently cut an ad with Texas Republican Governor Greg Abbott and featured prominently in recent anti-immigrant content from House Minority Leader Kevin McCarthy.",
    "No Republican candidate this cycle should be able to sidestep owning up to and explaining their party’s dangerous delusions about race and a hostile invasion.",
    "…At issue here is the fictitious idea that there is an ‘invasion’ of non-white migrants presenting a coordinated threat to the United States.",
    "…Lamon’s violent and threatening ad, depicting shots fired at our elected leaders, while extreme, fits a pattern for Republicans this year.",
    "Just this week, Judd appeared on Senator Ted Cruz’s podcast and held a border event with Pennsylvania GOP Senate candidate David McCormick.",
    "The continued embrace of such ideas by one of the two major political parties presents a real threat to public safety for all Americans.",
    "Check out ongoing examples of Republicans’ anti-immigrant ads at the America’s Voice GOP Ad Tracker: http://gopadtracker.com/",
    "As America’s Voice Senior Political Manager Zachary Mueller reports, Brandon Judd is a popular figure in Republican circles.",
    "They have fully embraced this cynical and deadly message believing it will help them recapture majorities in Congress.",
    "This year, we’re seeing Republican elected officials and candidates pushing even more dangerous xenophobic rhetoric.",
    "This ridiculous story would be laughable if not for the deadly acts it has inspired recently on American soil.",
    "Republicans, from elected leadership to primary contenders, however, clearly disagree.",
    "And, Arizona Republicans are at the forefront.",
    "The GOP primary isn’t until August 2nd.",
    "And, it’s just getting started.",
    "Kari Lake isn’t alone."
  ]
}