{
  "id": 6303,
  "mediaId": 2701,
  "date": "2022-02-03",
  "headline": "We Need More Suave Conservatives Who Can And Will Call Out Corrupt Media’s B.S.",
  "image": "https://thefederalist.com/wp-content/uploads/2022/02/46983396235_94e2385c34_k-e1643908778926.jpg",
  "link": "https://thefederalist.com/2022/02/03/we-need-more-suave-conservatives-who-can-and-will-call-out-corrupt-medias-b-s/?utm_source=rss&utm_medium=rss&utm_campaign=we-need-more-suave-conservatives-who-can-and-will-call-out-corrupt-medias-b-s",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Boyd",
  "authorUrl": "https://thefederalist.com/author/jordandavidson/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Well, he’s obviously sitting in the White House,” she responded calmly before asking the reporter, “Do you think he’s the president?”\nThe female reporter had no comment but that didn’t stop Lake from politely yet firmly asking whether she and ABC News thought the 2020 election was fair.",
    "Former President Donald Trump gained his popularity during the 2016 primaries for calling out the “fake news.” Trump rose to the top of a crowded Republican primary by criticizing the fake new media, questioning their motives, and denouncing their lies.",
    "… There is an obsession with this amongst the D.C., New York journalist class and again I think it’s because it allows them to spin a narrative that they want to spin.”\nUnfortunately, people like Trump, Paul, and DeSantis are still few and far between.",
    "A business — when you’re lying to the people and you’re in media, it’s a bad business model.”\nI don’t know much about Lake, but I do know that her response to the corrupt media’s twisted questions was perfect.",
    "When an ABC reporter asked Kari Lake, a Republican running for governor in Arizona, if she believed that Joe Biden is the president of the United States, the Republican knew just what to say.",
    "He was one of the few candidates willing to fight the enemy of the people, a characterization of the corrupt corporate media which 58 percent of Americans agreed with in a recent poll.",
    "The corporate press needs to be held accountable for its disgusting lack of transparency and integrity and conservative politicians should use their platforms to do just that.",
    "Media is doing a huge disservice to this country and the people aren’t getting the full story.”\nLake noted that this isn’t an isolated problem, it’s an orchestrated one.",
    "We need more conservatives to recognize that the corporate media isn’t on the side of regular Americans and call them out for contorting narratives for political gain.",
    "“ABC News, CNN, MSNBC, spent more than three years lying to the American people saying that Russia colluded with Donald J. Trump to steal an election in 2016.",
    "More recently, DeSantis called out the corporate media and Democrats for overhyping the Jan. 6 Capitol riot and using it as a tool to hoax more Americans.",
    "Even before Trump assumed office, people such as Sen. Rand Paul possessed and used the boldness required to fight the corporate media’s false narratives.",
    "The corporate press needs to be held accountable for its lack of transparency and integrity and conservative politicians should do just that.",
    "Last year, he vigorously defended his state when CBS’ “60 Minutes” fabricated a scandal about Florida’s Covid-19 vaccination plan.",
    "“The problem is that the American people don’t have all the answers because the media is part of the problem,” Lake said.",
    "Lake called out the corporate media for what they are: perverted, prejudiced leftists who don’t care about Americans.",
    "He repeatedly noted their intentional efforts to undermine his presidency using the now-discredited Steele Dossier.",
    "“People here in Florida, they care about inflation and they care about gas prices and education and crime.",
    "Jordan graduated from Baylor University where she majored in political science and minored in journalism.",
    "“I think that this is something that has really been used for political narrative and posturing purposes.",
    "Ron DeSantis is another Republican who isn’t afraid to call out the media on their rubbish reporting.",
    "During his time in office, Trump made it clear that the corporate press was not on Americans’ side.",
    "As history shows, the corrupt press exists to serve Democrats, coastal elites, and their agendas.",
    "Jordan Boyd is a staff writer at The Federalist and co-producer of The Federalist Radio Hour.",
    "We need more suave Republicans who can remind the corrupt media of how out of touch they are.",
    "They’re not reporting on these ballot traffickers that are being paid to drop off ballots.",
    "He also called them out for regularly lying about his presidency and bashing his goals.",
    "They are propagandists who aren’t afraid to lie through their teeth to get to the top.",
    "“We have evidence of corruption in our election and they refuse to cover it.",
    "And I think their days are numbered when it comes to surviving all of this.",
    "They knew they were peddling lies and they did nothing to stop it.",
    "Her work has also been featured in The Daily Wire and Fox News.",
    "I don’t think it’s been effective,” DeSantis said last month.",
    "They refuse to be honest with the people of this country.",
    "Media has never reported our forensic audit fairly.",
    "They’re not reporting what’s happening in Georgia.",
    "And now they’re doing the opposite,” she said.",
    "It is disgusting what the media has done.",
    "It was a complete hoax and it was a lie.",
    "Follow her on Twitter @jordanboydtx.",
    "And they knew that was false.",
    "“Media is not reporting it.",
    "Florida Gov."
  ]
}