{
  "id": 6438,
  "mediaId": 2550,
  "date": "2022-01-28",
  "headline": "Morning Digest: Former College Democrats head joins",
  "image": "https://images.dailykos.com/images/428892/story_image/KN.png?1501091726",
  "link": "https://www.dailykos.com/stories/2077197",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1480,
    1909,
    2090,
    2573,
    2716,
    2828,
    2962,
    3266,
    237,
    5402
  ],
  "sentences": [
    "Scott, a vocal advocate for police accountability and one of the most progressive members of the state legislature, launched her campaign in July—at a time when most politicos assumed Yarmuth would be running again; she would be Kentucky's first Black member of Congress as well as the first woman to represent the state since Yarmuth unseated Republican Rep. Anne Northup in the 2006 blue wave.",
    "Morgan won back her seat in the state House in 2020 by defeating her Democratic successor, but she made news for all the wrong reasons last month when she tweeted that a \"black friend\" had become \"hostile and unpleasant\" to her—due to critical race theory, of course—adding, \"I am sure I didn't do anything to her, except be white.\"",
    "As the Boston Globe wrote, Tran lost re-election in 2020 months after he \"was stripped of his leadership post within the Senate GOP caucus and, in an extraordinary step, barred from interacting with his staff except through official e-mails after fellow senators accused him of breaking Senate rules and potentially state law.\"",
    "Of note, the plan maintains the state's lone Black congressional district (Democratic Rep. Jim Clyburn's 6th District), but it could readily create a second district where Black voters would be able to elect their candidate of choice, as demonstrated in this hypothetical map drawn by Stephen Wolf.",
    "Last October, after the former lieutenant governor suggested that Republicans \"hire mercenaries\" for \"ballot harvesting\" in order to compete with (entirely lawful) Democratic get-out-the-vote efforts, Nicholson replied that anyone who supported that idea was \"as dumb as a bag of hammers.\"",
    "HI-Gov: Huh: Freshman Rep. Kai Kahele, whose name had not previously come up as a potential candidate for governor, told Hawaii News Now that he's thinking about entering the race in a new interview, saying his constituents \"are having a difficult time with any of the current candidates.\"",
    "MA-03: Former state Sen. Dean Tran has announced that he'll seek the Republican nomination to take on Democratic Rep. Lori Trahan, but as we wrote last month when he first filed with the FEC, an unresolved scandal makes Tran anything but a top-tier candidate for this 62-35 Biden seat.",
    "The firm did not test Kelly's three other notable would-be rivals in head-to-head matchups—venture capitalist Blake Masters, energy executive Jim Lamon, and retired Air Force Maj. Gen. Mick McGuire—but it did ask about their favorability ratings, finding all of them virtually unknown.",
    "Opt in to email updates from Daily Kos Elections\nSponsored by: Daily Kos Elections\nOver the weekend, Nicholson also told state GOP chairman Paul Farrow, who simultaneously serves as county executive of populous Waukesha County, \"You represent a broken machine—you're part of it.\"",
    "Wisconsin Republican Kevin Nicholson\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "RI-02: Republican state Rep. Patricia Morgan said Wednesday that she would take a few weeks to decide if she'll run for this open seat, though few members of the GOP establishment will likely want to see her as their standard bearer in what's currently a 56-43 Biden district.",
    "KY-03: While several Democrats initially expressed interest in running to succeed retiring Rep. John Yarmuth after he announced his retirement in October, the May primary will be a duel between state Rep. Attica Scott and state Senate Minority Leader Morgan McGarvey.",
    "Republicans in the legislature barely made any alterations to this solidly blue constituency, which includes almost all of Louisville, so the eventual nominee will almost certainly take Yarmuth's place as the Bluegrass State's lone Democratic member of Congress.",
    "The Marine veteran—and onetime president of the College Democrats of America—once again has the backing of conservative megadonor Dick Uihlein, who threw down $11 million to aid Nicholson's unsuccessful campaign for the GOP's Senate nomination in 2018.",
    "WI-Gov: Businessman Kevin Nicholson announced Thursday that he'll run for governor, a move that guarantees Wisconsin Republicans will have to slog through an expensive and ugly August primary before they can focus on Democratic incumbent Tony Evers.",
    "GA-Sen, GA-Gov: A new poll from the Atlanta Journal-Constitution conducted by the University of Georgia finds former NFL star Herschel Walker, the likely Republican nominee in November's Senate race, leading Democratic Sen. Raphael Warnock 47-44.",
    "However, Milwaukee TV news station Fox6 did some ace sleuthing and found out that only one voter in Nicholson's precinct had voted \"no preference,\" but that person had cast an early ballot while Nicholson is recorded as voting on Election Day.",
    "MI-10: Sterling Heights Mayor Michael Taylor, a recent party-switcher Republican whose potential candidacy was greeted with wariness by a number of local Democrats, has decided not to run for Michigan's open 10th Congressional District.",
    "Nicholson, as we noted, is indeed an outsider to Republican politics, seeing as he was head of the College Democrats of America in 2000 and even delivered a speech at that year's Democratic National Convention in support of Al Gore.",
    "Already seeking the GOP nod is former federal prosecutor Jesse Reising, while two notable Democrats, financial planner David Palmer and former Obama administration official Nikki Budzinski, are running for their party's nomination.",
    "The winner of the May 17 Democratic primary will be the heavy favorite to prevail in the November general election for a city that supported Joe Biden 59-39 (the city of Louisville merged with the rest of Jefferson County in 2003).",
    "CO-07: Businessman Timothy Reichert has announced that he'll seek the Republican nomination to succeed retiring Democratic Rep. Ed Perlmutter and self-fund $500,000 to start his campaign for this redrawn 56-42 Biden constituency.",
    "A well-funded group backing Nicholson’s primary foe, state Sen. Leah Vukmir, aired an ad reminding viewers that Nicholson \"spoke at the same Democratic National Convention as Hillary Clinton\" and even wrote a letter praising her.",
    "The candidate claimed during his Senate bid that he'd left that gathering \"absolutely sure\" he wasn't a Democrat, but reporters uncovered plenty of evidence indicating that the lesson took a lot longer to seep in than he let on.",
    "While it may seem strange for a mayor of one city to be running for mayor of another city, it's possible because the merger agreement allowed Jefferson County's existing suburbs to remain intact and keep their local governments.",
    "TN-05: Former state House Speaker Beth Harwell, who unsuccessfully sought the GOP nod for governor in 2018, says she'll decide on whether to run for Tennessee's freshly gerrymandered 5th Congressional District by mid-February.",
    "Nicholson heard but very much did not listen: He used his Thursday announcement to say of the speaker's suggestion, \"That's like taking political advice from Scooby-Doo, except Scooby-Doo actually gets the guy in the end.\"",
    "And while Nicholson is trying to position himself as a conservative outsider campaigning against a failed GOP political establishment, his last campaign uncovered one big weakness that Kleefisch's side can exploit.",
    "Gina Raimondo in 2018, but she lost the primary 56-40 to 2014 nominee Allan Fung; Morgan responded to that defeat by endorsing conservative independent Joe Trillo over Fung, a move that got her ejected as leader.",
    "VA-05: Former Henry County Supervisor Andy Parker, whose daughter Alison was murdered on air during a live TV news broadcast in 2015, has announced a bid for Virginia's 5th Congressional District as a Democrat.",
    "Republican Sen. Rand Paul is unlikely to have much trouble winning re-election in a state that backed Donald Trump 62-36, but he does face noteworthy Democratic opposition from former state Rep. Charles Booker.",
    "Former state Sen. Don Huffines and ex-state party chair Allen West took in about $2 million each during the latter portion of last year, but Huffines had $3.7 million to spend compared to $166,000 for West.",
    "Last week, she released an internal from the Tarrance Group that showed her demolishing Nicholson 61-8 and soon thereafter earned an endorsement from the influential Wisconsin Manufacturers and Commerce.",
    "Kleefisch, who launched her campaign all the way back in September, hasn't echoed her intra-party rival's brash talk as yet, but she's sought to establish herself as the dominant primary frontrunner.",
    "IL-13: Activist Regan Deering, whose family ran the agribusiness giant Archer-Daniels-Midland for more than 40 years, has joined the Republican primary for Illinois' open 13th Congressional District.",
    "A dozen Republicans are seeking their party's nod, including former Detroit Police Chief James Craig, chiropractor Garrett Soldano, businessman Kevin Rinke, and conservative radio host Tudor Dixon.",
    "Kahele added that he's \"committed to serving my second year in Congress\" but said he'd \"reassess what my political future looks like,\" though he didn't say when that reassessment might take place.",
    "Bookmark our Daily Kos Elections 2022 primary calendar for a complete list of filing deadlines-the next is set for Jan. 29 in West Virginia-as well as primaries and, where applicable, runoffs.",
    "KY-Sen: Candidate filing closed Tuesday for Kentucky's May 17 party primaries, which is the second state in the nation where the deadline has passed (filing ended in Texas over a month ago).",
    "A lawsuit arguing that the Voting Rights Act mandated a second such district be established in Alabama recently proved successful, and a similar case in South Carolina could prevail as well.",
    "AZ-Sen: A new survey from the progressive pollster Data for Progress finds Democratic Sen. Mark Kelly narrowly beating two Republican opponents—one who's actually running and one who isn't.",
    "Reichert, the Colorado Sun reports, wrote a 2010 piece in which he called contraception \"socially damaging\" and \"contrary to the rhetoric of the sexual revolution, deeply sexist in nature.\"",
    "Louisville, KY Mayor: Democratic Mayor Greg Fischer is termed out after almost 12 years leading Kentucky's largest city, and eight Democrats and four Republicans have filed to succeed him.",
    "Last week, Assembly Speaker Robin Vos said at an event, \"If Kevin Nicholson is listening—you need to not run for governor,\" adding, \"I think if he runs, it hurts our chances to defeat Gov.",
    "The redrawn 5th remains conservative turf: It would have voted 53-45 for Donald Trump, compared to Trump's 54-45 win in the old district, which is represented by Republican Rep. Bob Good.",
    "Jefferson Circuit Court Clerk David Nicholson, who had the second-largest war chest at $320,000, has sought to portray Greenberg as someone who \"wants to bring in billionaire values.\"",
    "Nicholson insisted he supported Republican John McCain in 2007 but couldn't switch his party registration at the polls and therefore voted \"no preference\" in the Democratic contest.",
    "FL Redistricting: A committee in Florida's Republican-run state House has advanced a new map for its own chamber, making adjustments to one approved by a subcommittee last week.",
    "Vukmir ended up defeating Nicholson, whose polls initially showed him far ahead, by a 49-43 margin, though she badly lost the general election to Democratic Sen. Tammy Baldwin.",
    "Greg Abbott is running a spot tying his likely Democratic foe, former Rep. Beto O'Rourke, to Joe Biden, a message Texans should expect to see a whole lot of over the next year.",
    "He also claimed \"that increased use of contraception among African American women and their partners increases mistrust between the partners due to higher risk of infidelity.\"",
    "The survey did not test either primary, but a Quinnipiac poll released a day earlier showed Walker with a 75-point lead over Black but Kemp only holding off Perdue 43-36.",
    "Democrats redrew the 13th to make it considerably bluer: The new version would have voted 54-43 for Joe Biden, while the previous iteration went 51-47 for Donald Trump.",
    "Booker ran against Kentucky's other GOP senator, Mitch McConnell, last cycle and came unexpectedly close to denying national party favorite Amy McGrath the nomination.",
    "It also showed a clip of Nicholson's 2000 speech in which the then-president of the College Democrats of America proclaimed, \"The Democratic Party shares our values.\"",
    "It also remains anchored in central and southern Virginia, though it's considerably more compact than its predecessor, which reached all the way to the D.C. suburbs.",
    "Former TV anchor Kari Lake, who has Donald Trump's backing, leads former Rep. Matt Salmon 21-17, while Board of Regents member Karrin Taylor Robson trails with 6%.",
    "He wasn't much nicer on Thursday, saying that Kleefisch was a \"broken record\" whose nomination would only result in more Democratic victories in the Badger State.",
    "Tom Wolf has vetoed the new congressional map passed by Republicans in the legislature earlier this week, ensuring that new districts will be drawn by the courts.",
    "Democrats criticized the map for not increasing the number of Black and Hispanic districts, even though most of the state's growth has come from people of color.",
    "He also registered to vote as a Democrat in 2005 when he moved to North Carolina, and he voted in that state's Democratic presidential primary three years later.",
    "Litigation is currently pending before Pennsylvania's Commonwealth Court, an intermediate appellate court that handles most election law disputes in the state.",
    "The 80-year-old Thompson, who went on to lose that campaign to Baldwin, also hasn't ruled out trying to reclaim the governorship he gave up two decades ago.",
    "United StatesUnited States\nAttribution: Stephen Wolf / Daniel Donner\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "Brian Kemp beats Democrat Stacey Abrams 48-41, while Kemp's rival for the nomination, former Sen. David Perdue, has a smaller 47-43 advantage over Abrams.",
    "Josh Green, who held a wide lead in the only public poll of the primary, as well as businesswoman Vicky Cayetano and former Honolulu Mayor Kirk Caldwell.",
    "The Senate Committee on Ethics later found evidence he'd directed his legislative staff to do campaign work for him, a report Tran called \"libelous.\"",
    "In fact, Nicholson had to acknowledge that he'd been paid $7,300 by the Democratic Party in Minnesota for salary and mileage reimbursements in 2002.",
    "MD Redistricting: Maryland's Democratic-run state House passed new legislative maps on Thursday that were previously approved by the state Senate.",
    "Redistricting\nStay on top of the map-making process in all 50 states by bookmarking our invaluable redistricting timeline tracker, updated daily.",
    "MI-Gov: Wealthy businessman Perry Johnson, who reportedly may be able to self-fund, has joined the crowded GOP primary to take on Democratic Gov.",
    "Gen. Kurt Winstead, also says he's looking at the race, adding that \"we will be listening over these next few days as we make a final decision.\"",
    "The firm also tested the Democratic primary, but its sample of 274 respondents falls below the minimum 300 we require for reporting on a poll.",
    "But there’s some high-priced discord in the Uihlein household as Uihlein's wife, Liz, has already contributed $220,000 to aid former Lt. Gov.",
    "Kelly holds a 49-47 edge over state Attorney General Mark Brnovich, who's been campaigning since June, and a 50-47 lead on term-limited Gov.",
    "On the Democratic side, the top fundraiser by far is Craig Greenberg, a businessman and developer who ended 2021 with $800,000 in the bank.",
    "AZ-Gov: An in-house survey for OH Predictive Insights finds Arizona's Republican primary for governor still a very much unsettled affair.",
    "The allegations were turned over to state authorities, who this week would neither confirm nor deny that they are investigating Tran.",
    "This new district just to the north of Detroit is very evenly divided and would have voted for Donald Trump by just a 50-49 margin.",
    "The secretary of state has a list of contenders in every race, and we’ll run down the key contests below, starting with the Senate.",
    "Hurst defeated a Republican incumbent to win a seat in the state House in 2017 but lost his bid for re-election last year 55-45.",
    "Those living within Louisville's pre-2003 boundaries, meanwhile, pay a higher property tax but receive more government services.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Abbott raised $18.9 million during the second half of 2021 while O'Rourke, who launched in mid-November, took in $7.2 million.",
    "Legislative redistricting is in the hands of a bipartisan commission with a tiebreaker who was appointed by the Supreme Court.",
    "Even before Nicholson officially launched his new effort, he was engaged in a match of trading insults with Kleefisch allies.",
    "For the GOP, the only candidate with a notable amount of money is Jeffersontown Mayor Bill Dieruf, who had $235,000 to spend.",
    "Nicholson and Kleefisch are currently the only major Republicans running for governor, though that could change before long.",
    "Affected residents were also allowed to vote in Louisville elections and benefit from many of the unified city's services.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Scott Walker's running mate in 2018 when their ticket lost to Evers and Mandela Barnes, who is now running for Senate.)",
    "Henry McMaster has signed the new congressional map that South Carolina's GOP-run legislature passed earlier this week.",
    "None of the other six Democrats, however, reported having as much as $10,000 on-hand at the conclusion of last year.",
    "Abbott faces two notable intra-party foes on March 1, though neither of them have anything resembling his resources.",
    "Also check out our guide to the common pitfalls and key things to look out for as filing season gets underway.",
    "Unsurprisingly, Kleefisch herself has been on the receiving end of Nicholson's attacks for months as well.",
    "He also swore he voted for McCain that November and released a photo—undated—of himself at a McCain rally.",
    "Larry Hogan does not have the power to veto legislative redistricting plans, so the new maps are now law.",
    "The parties involved recently submitted proposed maps to the court—14 in all—which you can view here.",
    "Nicholson responded at the time by claiming—without proof—that the state's voting records were wrong.",
    "The governor ended the year with $65.2 million on-hand, while the Democrat had $4.8 million to spend.",
    "Parker is being advised by Christ Hurst, who was his daughter's boyfriend at the time of her killing.",
    "Reichert's spokesperson insisted to the Sun last week that he doesn't support banning contraception.",
    "That photo, you won’t be surprised to learn, failed to ward off attacks over his Democratic ties.",
    "McGarvey, meanwhile, launched his campaign minutes after the incumbent announced his retirement.",
    "Any appeals would be handled by the state Supreme Court, which has a 5-2 Democratic majority.",
    "Morgan served as the minority leader for the tiny GOP caucus when she challenged then-Gov.",
    "Wealthy businessman Eric Hovde, who narrowly lost the 2012 Senate primary to former Gov.",
    "Doug Ducey, who just the other day reiterated that he's not interested in the race.",
    "Among the actual candidates, Brnovich is the best-known, with favorables of 26-32.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "(Nicholson got into a public dispute with the chairman's mother, former Lt. Gov.",
    "A former top adviser to Craig, consultant John Yob, is now working for Johnson.",
    "Ducey, though, is deep under water at 39-57, while Kelly earns a 46-49 score.",
    "Quinnipiac also found the various general election matchups much tighter.",
    "Warnock, however, leads state Agriculture Commissioner Gary Black 46-41.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Wisconsin's candidate filing deadline isn't until the start of June.",
    "However, nearly half of all voters—46% in total—remain undecided.",
    "This time, though, Booker has no notable intra-party opposition.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Already seeking the Democratic nod to replace term-limited Gov.",
    "Get the Daily Kos Elections Morning Digest over email\n Sign up!",
    "Rebecca Kleefisch, who is Nicholson's main intra-party foe.",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "Another Republican, former Tennessee National Guard Brig.",
    "(Raimondo beat Fung 53-37, with Trillo taking 4%.)",
    "Tommy Thompson, is publicly considering a bid.",
    "PA Redistricting: As promised, Democratic Gov.",
    "Margaret Farrow, during his last campaign.)",
    "In the race for governor, Republican Gov.",
    "This is a short blurb about Daily Kos.",
    "SC Redistricting: Republican Gov.",
    "Under state law, Republican Gov.",
    "You may unsubscribe at any time.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Here's our privacy policy.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "TX-Gov: Republican Gov.",
    "David Ige is Lt. Gov.",
    "(Kleefisch was Gov.",
    "Gretchen Whitmer.",
    "Please read it.",
    "Leading Off\n?",
    "Governors\n?",
    "Mayors\n?",
    "Sign up!",
    "Senate\n?",
    "Evers.\"",
    "House\n?",
    "P.S.",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}