{
  "id": 6492,
  "mediaId": 2512,
  "date": "2022-01-20",
  "headline": "‘Culture war’ bills from far-right Arizona Republicans are becoming increasingly ‘extreme’: report",
  "image": "https://www.alternet.org/media-library/image.jpg?id=28868134&width=1200&coordinates=0%2C0%2C0%2C213&height=600",
  "link": "https://www.alternet.org/2022/01/culture-war-bills-from-arizona-republicans-are-becoming-increasingly-extreme-report/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    2399,
    2668,
    3337,
    4638,
    4777,
    82,
    878,
    4830,
    4887
  ],
  "sentences": [
    "Darrell Hill, policy director for the Arizona American Civil Liberties Union, told the Phoenix New Times, “We’re seeing a lot of ‘culture war’ bills, a lot of bills that would impact the civil rights of Arizonans — and we’re worried.”\nDemocrat Rebecca Rios, former minority leader in the Arizona House of Representatives, told the New Times, “The current Arizona GOP have turned into extremists who care more about attacking democracy, attacking our teachers and schools, and working on bills like ‘Donald Trump Day.’”\nOne of the extremist bills sponsored by Arizona State Sen. Wendy Rogers, a MAGA Republican and member of the far-right militia group the Oath Keepers, is Arizona Senate Bill 1047.",
    "Sinema, a frequent source of frustration to Democratic progressives, has often praised McCain as her hero and is on very friendly terms with his daughter: GOP activist Meghan McCain, formerly of the popular ABC talk show “The View.”\nMeanwhile, the chair of the Arizona Republican Party is Kelli Ward, a far-right MAGA extremist who hated John McCain and considered him a RINO: Republican In Name Only.",
    "If it passed, Schwenk notes, “Schools could face thousands in civil penalties if they do not display American flags in every classroom and recite the pledge of allegiance.”\n“It’s already law in Arizona that public schools must display a large American flag in each classroom and display, next to it, a copy of the Constitution and the Bill of Rights,” Schwenk observes.",
    "The Arizona Attorney General would be directed to collect up to $1000 in civil penalties from schools — for every violation identified.”\nUnder the Rogers-sponsored Arizona Senate Bill 1045, Schwenk notes, “Any health professional that provides gender-affirming care to trans youth could be charged with a felony.”",
    "Schwenk explains, “Felony charges for providing healthcare for transgender youth, a statewide ‘Donald J. Trump Day’ holiday, hundreds of millions in funding for the U.S.-Mexico border wall — these are just a few bills that the Arizona legislature will be considering in the coming months….",
    "Although Republicans hold a trifecta in Arizona — control of both chambers and the governor’s office — their majorities in both the House and the Senate are relatively slim.”\nNonetheless, the fact that MAGA Republicans are even proposing such bills in the first place is troubling.",
    "Ward is so far to the right that if Goldwater were a young Republican in 2022, she would surely consider him a liberal or a RINO — which is ironic in light of the fact that during the 1960s and 1970s, Goldwater was considered an arch-conservative.",
    "On one hand, Arizona — once a deep red state that was synonymous with the GOP conservatism of Sen. Barry Goldwater and his successor, Sen. John McCain — has evolved into a swing state.",
    "Anti-vaxxer Kari Lake, who appears to the frontrunner in Arizona’s 2022 GOP gubernatorial primary, is right out of the Marjorie Taylor Greene/Lauren Boebert school of MAGA lunacy.",
    "The fact that Arizona has become more Democrat-friendly than it was in the past is evident in some statewide victories of the late 2010s and early 2020s.",
    "And Arizona-based journalist Katya Schwenk describes some of those dangers in an article published by the Phoenix New Times on January 11.",
    "And as Schwenk’s article shows, some Republicans in the Arizona State Legislature are becoming increasingly unhinged.",
    "Whether such legislation will successfully wind its way through House and Senate committees is more of an unknown.",
    "would cause schools to face thousands of dollars in fines for violations of any of those requirements.",
    "Arizona’s political landscape has changed considerably from what it was 30 or 40 years ago.",
    "The state now has two Democratic U.S. senators: Sen. Kyrsten Sinema and Sen. Mark Kelly.",
    "Ward is hardly the only MAGA Republican in Arizona who is pushing an extremist agenda.",
    "But on the other hand, Arizona’s far right has become increasingly dangerous.",
    "Doug Ducey is a conservative Republican, and Sinema and Kelly are centrists.",
    "But Arizona still isn’t a deep blue state like California or Massachusetts.",
    "“Schools must also set aside time to recite the National Anthem each day.",
    "And President Joe Biden won Arizona in 2020’s presidential election.",
    "But SB 1047….",
    "Gov."
  ]
}