{
  "id": 7069,
  "mediaId": 2874,
  "date": "2022-01-26",
  "headline": "'It's just plain unconstitutional': Wisconsin GOP leaders again reject resolution to 'pull back' 2020 electoral votes",
  "image": "https://www.gannett-cdn.com/presto/2021/05/26/PMJS/5d1f8bf3-ba2d-455b-8f82-7155d74e4c58-MJS_trans_8.jpg_transA.JPG?crop=2999,1687,x0,y275&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/politics/elections/2022/01/26/wisconsin-gop-rejects-resolution-pull-back-2020-electoral-votes/9223622002/",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Molly Beck",
  "authorUrl": "https://www.jsonline.com/staff/2647036001/molly-beck/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ramthun, the Legislature's most vocal denier of the 2020 election outcome, was disciplined by Assembly Speaker Robin Vos last week after Ramthun falsely accused Vos of signing a deal with attorneys for former Democratic presidential candidate Hillary Clinton to authorize ballot drop boxes, according to Vos's office.",
    "It reads: \"The Wisconsin Legislature enacted statutes establishing the process for selecting and appointing presidential electors, which involves the political parties each nominating a slate of electors, and the results of the popular vote for president in Wisconsin determining which slate will be appointed.\"",
    "More:A who's who guide to the Republican review of Wisconsin's 2020 presidential election\nVos last summer hired former state Supreme Court Justice Michael Gableman to review the presidential election at a cost of $676,000 to taxpayers on behalf of Assembly Republicans.",
    "\"Instead, except in the case of presidential incapacity, impeachment is the only mechanism for removing a sitting U.S. President,\" Katie Bender-Olson and Peggy Hurley, attorneys with the nonpartisan Legislative Council, wrote in a Nov. 1, 2021, memo.",
    "Assembly leaders referred the resolution to a committee used to schedule floor votes for bills, a required action for such proposals under Assembly rules, and the committee chairman quickly said Ramthun's resolution won't be taken up.",
    "Rep. Timothy Ramthun, a Republican from Campbellsport, introduced a resolution during a floor session Tuesday to take the impossible step of retracting the state's 10 electoral votes cast for President Joe Biden in 2021.",
    "When host Joe Giganti asked Kleefisch if Vos should resign over the matter and other election-related issues, Kleefisch said \"no, but I will say this: the people in the Legislature are the ones who choose their speaker.",
    "The U.S. Constitution authorizes state legislatures to “direct” how presidential electors are appointed, which the Wisconsin Legislature has done by specifying an appointment procedure in state law, the memo said.",
    "Kari Lake, a Republican candidate for governor in Arizona, then tweeted to her 107,315 followers \"**HUGE BREAKING NEWS** -- Wisconsin Assembly Votes to Withdraw Its 10 Electors for Joe Biden in 2020 Election.\"",
    "Tony Evers and the head of Wisconsin's elections board certified Joe Biden's victory in the state on Nov. 30 as Republicans contended they should have waited to act because of a likely lawsuit from Trump.",
    "But according to the Legislature's attorneys, \"there is no mechanism in state or federal law for the Legislature to reverse certified votes cast by the Electoral College and counted by Congress.\"",
    "Ultimately, the results of the Nov. 3, 2020, presidential election, which declared Biden the winner, were certified on Jan. 6, 2021, when Congress met to tabulate the Electoral College vote.",
    "But Trump's claims alleging otherwise have fueled a significant number of complaints from Wisconsin Republican voters to lawmakers, seeking a review of how the 2020 election was conducted.",
    "MADISON – Assembly leaders for the second time have rejected a proposal from a Republican lawmaker to pull back Wisconsin's electoral votes cast in the 2020 election, which is illegal.",
    "Vos has become a target of the far-right, where discontent is growing among some who believe Vos is not conservative enough and has not investigated the 2020 election thoroughly.",
    "Last week, two Assembly Republican lawmakers were surreptitiously filmed in their state Capitol offices by a group critical of Vos's decision to discipline Ramthun.",
    "There is no procedure under Wisconsin law for “decertifying” or “pulling back” a slate of presidential electors who have been appointed pursuant to state statutes.",
    "On Dec. 14, 10 Democratic electors also met inside Evers' office to finalize the state's 10 electoral votes for Biden and Vice President Kamala Harris.",
    "Not only is it illegal, it’s just plain unconstitutional,\" Assembly Majority Leader Jim Steineke, who leads the committee, said in a tweet.",
    "\"I disagree with the speaker's decision last week,\" Kleefisch said Monday in an appearance on WTAQ's \"The Regular Joe Show.\"",
    "One of the legislators, Rep. John Spiros, slammed his office door in the face of a man distributing a petition to oust Vos.",
    "Vos stripped Ramthun of his only staff position, a move criticized by Republican candidate for governor Rebecca Kleefisch.",
    "As of Tuesday morning, the tweet reporting inaccurate information was still up despite Gateway Pundit recasting the story.",
    "Since the election results were certified, Ramthun has called to \"pull the electoral ballots back from Wisconsin.\"",
    "Recounts and court rulings found Biden beat former President Donald Trump by nearly 21,000 votes in Wisconsin.",
    "#EndofStory\"\nBut popular conservative website Gateway Pundit falsely reported the move had been successful.",
    "\"Rep Ramthun just attempted to pass an Assembly resolution to recall WI’s presidential electors.",
    "\"As chair of the Rules Committee, there is ZERO chance I will advance this illegal resolution.",
    "Members of the group captured in one of the new videos called the review too secretive.",
    "The tweet had been liked more than 11,000 times and shared by more than 5,000 people.",
    "The Legislature could change this process, but it would require amending state law.",
    "At the same time, Republicans convened to cast votes for President Donald Trump.",
    "Independent reviews have found no signs of widespread voter fraud.",
    "\"My fear is over his constituents ...",
    "I urge them to choose wisely.\"",
    "I wouldn't have done that.\"",
    "Democratic Gov."
  ]
}