{
  "id": 7229,
  "mediaId": 2875,
  "date": "2022-01-29",
  "headline": "Key battleground states considering using digital ballot images to boost voter trust",
  "image": "https://i2.wp.com/www.nationofchange.org/wp-content/uploads/2022/01/26031053-f128-4e69-aea1-2ec27851b38e_1920x1080.jpg?fit=1920%2C1080&ssl=1",
  "link": "https://www.nationofchange.org/2022/01/29/key-battleground-states-considering-using-digital-ballot-images-to-boost-voter-trust/",
  "mediaOutlet": "nationofchange.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Rosenfeld Is The Editor, Chief Correspondent Of Voting Booth, A Project Of The Independent Media Institute. He Has Reported For National Public Radio, Marketplace, Christian Science Monitor Radio, As Well As A Wide Range Of Progressive Publications Including Salon, Alternet, The American Prospect, Many Others.",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "202 states that ballot images are public records and says, “the Secretary of State shall create pilot program for the posting of digital images of the scanned paper ballots created by the voting system.”\n\nTaking a closer look\n\nWhen Lake criticized Maricopa County’s adjudication process, she was referring to the way that software on scanners flagged sloppily marked or unreadable paper ballots and set them aside for human review.",
    "Preservation of the digital ballot images and the CVRs serve as public transparency and audit measures to confirm the accuracy of the official results.”\n\nThe Democrats’ suit comes as Florida’s Division of Elections is finalizing new rules and procedures to use ballot images in recounts, which is a different process than the initial counting of votes (the target of the Democrats’ lawsuit).",
    "“The votes are counted from the ballot images, not from the paper ballots themselves, making the digital images a necessary and automatic part of the chain of custody and audit trail of official election records that produce the vote count.”\n\n“While paper ballots show the voters’ choices, they do not show how and if the voting machines counted those votes,” the complaint explained.",
    "During an afternoon of public hearings where the Arizona Senate sent seven new election bills to the next stage of legislative review, Kari Lake, leaned into the podium, and, after introducing herself as “the Trump-endorsed candidate for governor,” told the Government Committee how she felt her 2020 presidential election vote had been stolen.",
    "“We’ve actually gone through and checked every other contest [in addition to the presidential results] and verified that it’s an absolute match with no deviations between them.”\n\nLutz did find some one-off errors in Bartow County, such as one ballot image where the voter’s intent was not accurately adjudicated—out of 50,000 ballots cast.",
    "In Bartow County, Georgia, a ballot image analysis done by Citizens’ Oversight, a non-partisan, non-profit, technology firm, of every contest in the 2020 general election only found one race on one ballot, among 50,000 ballots cast, where the adjudication by a county election worker clashed with the ballot image.",
    "One day after Lake’s testimony, the Florida Democratic Party, five legislators—all Democrats—and two voters sued Miami-Dade County to force it to treat the ballot images in their counting systems as public records, and save them for 22 months, which is the retention standard in federal and state election law.",
    "It’s also notable that opposition to making ballot images public records in Florida—such as election officials saying they add to their workload, incur added expenses of buying computer memory cards, or slow down precinct voting as the images are saved—were rejected as inconsequential by supporters of S.B.",
    "Transparency and Trust\n\nIt’s also notable that partisans on both sides of the aisle—Trump supporters in Arizona and Democrats in Florida—are both calling for more transparency and are citing ballot images as a crucial data set among public election records.",
    "At the hearing, Senate Government Committee Chair, Republican Kelly Townsend, explained that the voting system manufacturer, Dominion, wanted Maricopa County to use sharpie pens because they left less ink residue on the scanner glass than regular pens.",
    "And that’s unacceptable.”\n\nLake urged the panel to approve Senate Bill 1119, a transparency measure that would require counties to treat digital images of every scanned paper ballot as a public record, and publish them after an election.",
    "“I urge you to support this and any other piece of legislation that would shore up our vote.”\n\nLake’s stolen-vote scenario in Maricopa County, home to Phoenix and most Arizona’s voters, has been rebutted by county election officials.",
    "In Maricopa County’s 2020 presidential contest, where 2.1 million ballots were cast, scanners flagged about 11,900 ballots for adjudication, a trio of retired election auditors found in their analysis of the public election records.",
    "This is especially important in the case of ballots determined to be overvotes [more than one vote in a race] and undervotes [no vote], some of which may be lawful votes that are not initially counted by the voting machines.",
    "“What we found, mainly, was they did a hell of a good job in this election,” said Raymond Lutz, executive director of Citizens’ Oversight Projects and lead developer of AuditEngine, the ballot image-reading software tool.",
    "“By contrast, retained digital ballot images and their corresponding electronic CVRs [cast vote record, or the text file of the votes detected on each ballot] show how the voting machine counted those votes.",
    "Under Florida’s new recount rules, paper ballots would be rescanned by an entirely separate electronic system, creating a new set of ballot images that would become the basis for the recount’s results.",
    "202, its election reform bill that has been challenged by the U.S. Department of Justice for sections that the DOJ said have a racially discriminatory intent, which would be illegal.",
    "What’s remarkable about Townsend’s comments was that deeper looks at the county’s public election records have already revealed why this line of conspiratorial thinking is unfounded.",
    "The images, which show every side of every ballot card, and have an appended text file listing all of the votes, are the first electronic record created in the vote-counting process.",
    "In other words, Maricopa County’s adjudication process would have had no impact on the presidential race’s statewide outcome, where Joe Biden defeated Donald Trump by 10,457 votes.",
    "A ballot image analysis could have even more specifically addressed Lake’s accusation—as it would be examining records that were immediately created as the paper ballot is scanned.",
    "Two red-run presidential battleground states, Georgia, and Florida are taking steps to use digital ballot images in more public ways at the finish line of their 2022 elections.",
    "“The digital [voting] systems used in Miami-Dade County and throughout Florida function by capturing an electronic digital image of every ballot,” the lawsuit said.",
    "In Georgia, Florida, and Arizona, the GOP and Democrats are weighing a wider use of an essential election record to confirm the accuracy of controversial results.",
    "The paper ballots, digital images, and the final results database—which include all of the votes from every ballot cast—can all be compared for consistency.",
    "(Others at the hearing said the ballot layouts were designed so any bleed-through would not affect accurately reading the other side of the ballot card.)",
    "“I believe that the vote of an American citizen is the most precious item that a human being on the face of this Earth has,” said Celia Laughlin.",
    "For several years, Maryland also has used digital ballot images to double-check the vote totals from every contest before certifying winners.",
    "Some voters will make all kinds of marks on ballots, or also write in a candidate’s name, Lutz said, which no electronic system can process.",
    "However, she would not be able to retrieve the image of her ballot, as ballots have no personally identifying information printed on them.",
    "Pass these bills that are going to secure the election and free our hands to build trust in this election, build trust in our elections.”",
    "They rely on essential public records to confirm election results, which is an emerging trend in swing states.",
    "(The voting system logs those decisions, which become part of the final database of every vote in every race.)",
    "It also was previously refuted by independent analysts who examined the county’s 2020 public election records.",
    "Lutz also has begun to analyze ballot images from the presidential election in metro Atlanta’s Fulton County.",
    "“And your ballot is a public record, and it should be made that transparent.”\n\n“The last election was shady.",
    "Voters apparently returned them via the wrong drop box, not realizing that they had crossed county lines.",
    "There, among an initial batch of 148,000 ballots, he found five ballots from neighboring Dekalb County.",
    "“We vote in private, but we count in public,” said Sen. Sonny Borrelli, a Republican and panel member.",
    "(The scanned paper ballots would be archived as a library, where disputed ballots could be retrieved.)",
    "(This analysis came from looking at the final spreadsheet of every vote in the presidential race.)",
    "“I was handed a ballot and the Sharpie that was given to me bled right through [the paper ballot].",
    "Many of the Trump supporters testifying in Arizona urged legislators to require more transparency.",
    "Lake said that county workers were stealing votes at this stage of the process, including hers.",
    "County election workers look at ballot images to determine, or adjudicate, the voter’s intent.",
    "1119 would allow skeptics like Lake to see the individual building blocks of election results.",
    "These responses, notably, share a common feature with the Arizona Senate’s ballot image bill.",
    "So I believe that my vote may have been adjudicated; somebody else decided who I voted for.",
    "But Townsend, playing to a pro-Trump audience, said that too many ballots were adjudicated.",
    "She reminded her audience that she had referred the matter to Arizona’s attorney general.",
    "Several counties in western states, blue- and red-run, use ballot images to verify votes.",
    "There was only a 533-vote difference between the adjudicated ballots for Biden and Trump.",
    "This article was produced by Voting Booth, a project of the Independent Media Institute.",
    "However, making ballot images public records in Arizona could address these concerns.",
    "“I am still waiting to hear from the attorney general—anxiously waiting,” she said.",
    "Of those ballots, two-thirds were “write-ins,” or voters writing candidate’s names.",
    "Preserving and making the images public are also part of Georgia’s S.B.",
    "“So, yes, invest whatever money it takes… Get the digital images.",
    "That was suspicious, she said, rejecting Dominion’s explanation.",
    "However, election workers make sense of most of those ballots.",
    "Their complaint explained the image’s role and significance.",
    "Bartow and Maricopa Counties use Dominion voting systems.",
    "If the intent is clear, that vote is added to the tally.",
    "“I thought my vote was taken,” Lake said on January 24.",
    "Some counties post their ballot images online.",
    "That is intentional to keep voting secret.",
    "It was corrupt,” Lake said.",
    "It was shoddy.",
    "In short, S.B.",
    "1119.",
    "S.B."
  ]
}