{
  "id": 914,
  "mediaId": 2636,
  "date": "2022-04-11",
  "headline": "Gosar, Far-Right Incumbent, Faces G.O.P. Challengers in Arizona",
  "image": "https://static01.nyt.com/images/2022/04/06/us/00arizona-repubs-1/00arizona-repubs-1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/11/us/politics/arizona-republicans-paul-gosar.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this year’s map is poised to be surprisingly fair\nGovernors’ Races: Georgia’s contest will be at the center of the political universe, but there are several important races across the country.",
    "The insurgents in Arizona are part of a crop of long-shot primary challengers trying to oust some of the most polarizing far-right members of Congress, arguing that their opponents’ embrace of conspiracy theories, lies about election fraud and headline-grabbing provocations are poisoning America’s politics.",
    "The question of whether Arizona’s Republicans choose Mr. Gosar or a more mainline Republican reflects broader tensions about which faction will prevail as Republican standard-bearers as the party tries to hold control of the Arizona governorship and unseat one of the Senate’s more vulnerable Democrats.",
    "Logan Marsh, a Republican, and his husband moved from Washington State to an empty patch of desert in Mohave County three years ago, joining an exodus of conservatives fleeing what they called high costs and onerous local government regulations on the liberal coasts.",
    "Mr. Morgan, who works in cybersecurity and moved to Arizona only a year ago, said the idea to run came after Mr. Gosar was censured and stripped of his congressional committees in November for posting an animated video of himself killing a Democratic congresswoman.",
    "The message is resonating with at least some Republican and independent voters who count themselves among the nearly 80 percent of Americans who say they disapprove of Congress and want to register their disgust of both parties by voting out any incumbent.",
    "President Biden’s win here and a fast-growing, closely divided electorate have made Arizona one of the most competitive 2022 battlegrounds in the country, with Democrats defending a Senate seat and both parties eyeing an open governor’s seat.",
    "The latest upstarts are trying to tap into something different: a sense of voter exasperation with fringe views and the unending cycles of provocation and outrage that feel tailor-made to maximize social media clicks and donor response.",
    "These challenger campaigns are largely quixotic, run by veterans, political newcomers and local elected leaders who can muster barely a small fraction of the money, organization and news media attention as their incumbent opponents.",
    "But he said he was fed up and wanted a change, so he started calling local Republican groups and began driving around to car dealerships, salons and gun shops to gather the 1,450 signatures needed to get on Arizona’s primary ballot.",
    "“We need somebody who can just go in and do something different.”\nMr. Morgan is one of three Republican challengers on the ballot against Mr. Gosar, a six-term incumbent, in this deeply conservative swath of western Arizona.",
    "But in this election year, as Republicans seek to capitalize on the sour national mood to win control of Congress, there are also seeds of anti-incumbent rebellion sprouting in some heavily Republican districts.",
    "He says the southern border is overrun and the 2020 election was stolen — views that would normally make a voter like him a lock to re-elect his staunchly conservative congressman, Representative Paul Gosar.",
    "“The Republican Party stinks, too,” said Dale Kelley, a real estate agent in Bullhead City, Ariz., who signed Mr. Morgan’s petition largely because he was an outsider and veteran untethered to Washington.",
    "Some Republican voters said they had grown embarrassed by members of Congress who promoted QAnon conspiracy theories, jeered at Mr. Biden’s State of the Union address or talked of cocaine-fueled orgies.",
    "Doug Ducey, a conservative Republican, recently signed laws banning abortions after 15 weeks, prohibiting surgeries for transgender minors and requiring that voters provide proof of citizenship.",
    "Some also disapproved of a handful of far-right Republicans who voted against measures such as sending American aid to Ukraine, economically punishing Russia or investigating it for war crimes.",
    "After voting for Mr. Gosar in previous elections, Mr. Hall is now supporting Adam Morgan, a former Army captain and political novice trying to oust Mr. Gosar in Arizona’s Republican primary.",
    "After he gave a video speech to a conference organized by a white nationalist, he blamed his staff for a “miscommunication,” telling Politico that the video had gone to the wrong group.",
    "In Georgia, Jennifer Strahan, a health care consultant who is challenging Ms. Taylor Greene in the Republican primary, has sharply criticized the congresswoman’s rhetoric on Ukraine.",
    "Chuck Coughlin, an Arizona political analyst, said that challengers like Mr. Morgan were not just fighting Mr. Gosar but going against the DNA of most Republican primary voters.",
    "But the sprawling western Arizona district where Mr. Gosar and his rivals are running is still solidly Republican terrain, and the primaries may be the only competitive race.",
    "Mr. Morgan, who said he had seen no evidence the vote was stolen, wants to shift the focus to more traditional conservative fare like border security and small government.",
    "Outside Arizona, challengers are also running against Representatives Marjorie Taylor Greene in Georgia, Madison Cawthorn in North Carolina and Lauren Boebert in Colorado.",
    "Coylynn Colbaugh, who runs a turquoise mine with her husband outside Kingman, said the antics “give us a bad name.” She is planning to vote for Mr. Morgan in the primary.",
    "“Our congresswoman is serving as a megaphone for Putin and communist Russia, parroting Putin talking points and belittling Ukrainian freedom fighters,” Ms. Strahan said.",
    "He said he would be conservative but not combative, adding that Mr. Gosar’s ties to white nationalists and censure have tarnished voters and cost the district clout.",
    "Because that’s the constituency that votes.”\nStill, Mr. Gosar recently sought to distance himself from white nationalists who have become his allies and supporters.",
    "Nevertheless, he still received the ire of the state’s Republican Party for affirming Mr. Biden’s narrow win and for defending how Arizona had run its elections.",
    "Just two years ago, Ms. Boebert was a restaurant owner with no elected experience when she ousted a Republican incumbent by running a savvy pro-Trump campaign.",
    "Jeanne Kentch, the chairwoman of the Mohave County Republican Central Committee, said most conservative voters in the area were still devoted to Mr. Gosar.",
    "Some of the Republican voters in western Arizona who signed the petition to put Mr. Morgan on the ballot said they just wanted to get past all of that.",
    "Ray Vazquez, a car salesman, said he was working 12-hour shifts five or six days a week but spending larger chunks of his paycheck on gas and basics.",
    "Kari Lake, a former television anchor and a leading Republican contender to succeed Mr. Ducey, has promoted falsehoods that the election was stolen.",
    "Yes, people are worried about inflation and housing scarcity and looming water shortages from climate change and uncontrolled groundwater drilling.",
    "Rory McShane, a political consultant who works for Mr. Gosar, said Mr. Morgan and another primary challenger were not serious political threats.",
    "One of the Republican candidates for Senate, Jim Lamon, falsely claimed to be an elector able to cast Arizona’s electoral votes for Mr. Trump.",
    "KINGMAN, Ariz. — Inside a flag-covered roadside pizzeria, Robert Hall slings dough with a handgun on his hip and his politics on his sleeve.",
    "“I think people are ready to get along again, to come back together,” he said, sounding almost Bidenesque at times in his appeal to comity.",
    "Mr. Morgan describes himself as an earnest outsider — a former soldier who opposes abortion and wants to finish Mr. Trump’s border wall.",
    "The insurgent campaigns offer a test of the Republican electorate’s appetite for candidates not as far to the right as Mr. Gosar.",
    "They also lack endorsements from former President Donald J. Trump, a critical weakness for Republican voters still loyal to him.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle’s defining topics.",
    "“Stuff just needs to get back to normal,” he said, adding that he was planning to cast a vote against “a lot of negativity.",
    "“We’ve got to move on.”\nThat message may resonate in a state like Arizona, full of newcomers, liberal and conservative.",
    "And he was tired of feeling unserved by combative politicians that he felt did not care about his family’s life.",
    "He pointed out that Mr. Morgan, who moved to Arizona just over a year ago, had never voted in an election here.",
    "“I understand people are upset about 2020, but there’s nothing in replaying the past,” Mr. Morgan said.",
    "Mr. Gosar and other Republicans being challenged did not return multiple email and telephone messages.",
    "But she said his hard-right conservative views were the most important factor in earning her vote.",
    "Democrats do not even have a congressional candidate on the ballot for the general election.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "“We’re looking for somebody who’s new, who’s fresh, who has our voice,” Mr. Marsh said.",
    "“Those Republican primary voters believe the election was stolen,” Mr. Coughlin said.",
    "Midterms Begin: The Texas primaries officially opened the 2022 election season.",
    "“I need a change,” Mr. Hall said one afternoon as he dished out slices.",
    "“He’s the only one who would guarantee America first,” Ms. Kentch said.",
    "“The more extreme the candidate is, you’re rewarded for that behavior.",
    "Still, there is precedent for upset wins against powerful incumbents.",
    "Mr. Morgan had no money, no organization, no political experience.",
    "Mr. Gosar spoke in person to the same group a year earlier.",
    "He said the challenger campaigns were likely to fail.",
    "Diaper prices for his 15-month-old have soared.",
    "Here are the four incumbents most at risk.",
    "Everyone just needs to come together.”",
    "See the full primary calendar.",
    "Gov."
  ]
}