{
  "id": 928,
  "mediaId": 2512,
  "date": "2022-04-06",
  "headline": "'Petitioners have not persuaded the Court': Arizona Supreme Court tosses GOP lawsuit to eliminate early voting",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29645910&width=1200&coordinates=0%2C0%2C0%2C30&height=600",
  "link": "https://www.alternet.org/2022/04/arizona-supreme-court-early-voting/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Gage",
  "authorUrl": "https://www.alternet.org/author/brandongage",
  "termIds": [
    3736,
    4515,
    84,
    305,
    587,
    878,
    4830
  ],
  "sentences": [
    "Republican gubernatorial candidate Kari Lake – whom former President Donald Trump has endorsed because she supports his \"Big Lie\" that the 2020 election was stolen by President Joe Biden – believes that absentee voting should be reserved for people who are unable to physically cast a ballot on Election Day.",
    "“Drop boxes are also not voting centers — which, like polling places, are staffed so that a voter may present identification ‘to receive the appropriate ballot for that voter on election day.”\nBrutinel quashed that argument too, citing a lack of evidence.",
    "Arizona voters will still be able to vote early, access drop boxes, and make their voices heard.pic.twitter.com/awWo5A6PF3\n— Secretary Katie Hobbs (@Secretary Katie Hobbs) 1649203544\nHobbs is currently seeking the Democratic gubernatorial nomination.",
    "Democratic Arizona Secretary of State Katie Hobbs, who oversees the Grand Canyon State's elections, wrote in a tweet that the \"dangerous lawsuit threatened early voting in the state and challenged provisions of the Elections Procedures Manual.\"",
    "Brutinel stated in his ruling, however, that the complainants \"are free to refile the case in Maricopa County Superior Court where they can provide some factual basis for their allegations,\" according to the Star.",
    "\"And a 'reason' does not include that the able-bodied, physically present voters simply does not want to take the minimally burdensome step of presenting him or herself at a polling place on Election Day.''",
    "The Arizona Supreme Court has dismissed a lawsuit filed by the state Republican Party and its secretary Yvonne Cahill to declare early voting unconstitutional, The Arizona Daily Star reported on Wednesday.",
    "Chief Justice Robert Brutinel wrote in a brief order late Tuesday night that the plaintiffs \"have not persuaded the Court\" that the Arizona State Constitution permits only in-person voting on Election Day.",
    "\"Absent an actual reason why the voter cannot vote at the polls, voting occurs at the polls on Election Day, not election Month,\" wrote her attorney Tim La Sota, per the Star's reporting.",
    "The case was also panned as \"ill-conceived\" and \"poorly crafted\" by Arizona's incumbent Republican Governor Doug Ducey, whose second and final term ends in January of 2023.",
    "Today, the Arizona Supreme Court dismissed a dangerous lawsuit that threatened early voting in the state and challenged provisions of the Elections Procedures Manual.",
    "The petitioners also asked the Court to deny voters access to absentee ballots without specifying why they need one and to eliminate drop boxes.",
    "“A drop box is not an office of the county recorder, nor is it a ‘polling place,’” attorney Alexander Kolodin told the justices in February.",
    "\"It would undo the work of many Republican governors and secretaries of state over the past several decades,'' he said in March.",
    "She noted that “Arizona voters will still be able to vote early, access drop boxes, and make their voices heard.\"",
    "The issue is part of the GOP's wider assault on voting rights in dozens of states.",
    "Arizona bills embrace Trump conspiracy theories — could allow ... ›",
    "But Ducey was an outlier inside the GOP."
  ]
}