{
  "id": 2154,
  "mediaId": 2745,
  "date": "2022-03-24",
  "headline": "The Trailer: They're running for mayor of L.A. Protesters want them to shut up already.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/27DJ3GQPJII6ZPEKRWNFWU2BSQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/24/trailer-they-running-mayor-la-protesters-want-them-shut-up-already/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2888,
    3403,
    4471,
    4513,
    4671,
    564,
    4887,
    5104
  ],
  "sentences": [
    "“This is clearly out of hand,” L.A. City Council member Joe Buscaino, another candidate for mayor, said last month, as six protesters disrupted a candidate debate in West L.A. “We have our First Amendment rights that we embrace, but at the same time, the First Amendment does not give you a right to disrupt and be an idiot.”\nKevin de León, a mayoral candidate whose staff was heckled by protesters last weekend as the city cleared a homeless encampment in Little Tokyo, said the protesters were attempting to “stifle democracy” and shut down the campaign.",
    "Cranley's first spot pitched his city as a model for the state; Whaley focuses more her on biography, walking through a factory while talking about her father getting laid off from General Motors and her mother “pick[ing] up slack at the laundromat.”\n“Do you approve or disapprove of the way Joe Biden is handling his job as president?” (Gallup, March 1-18, 1,017 adults)\nA month of momentous events, from a war in Eastern Europe to the Supreme Court nomination of Judge Ketanji Brown Jackson, haven't really changed how Americans view the president.",
    "Is that compassionate?”\nFormer president Donald Trump retracted his endorsement of Rep. Mo Brooks (R-Ala.) on Wednesday, explaining in a pair of statements that the conservative U.S. Senate candidate had gone “woke” and “decided to drop everything he stood for.” Brooks fired back, explaining that Trump had “asked me to rescind the 2020 elections” and “immediately remove Joe Biden from the White House,” and that he'd told the ex-president that was impossible, “knowing full well” that it might cost him Trump's support.",
    "Beat them in 2024!” The jeering kept up, and he changed course: “All right — well, look back at it, but go forward and take advantage of it.”\nWhy did Trump say that Brooks had made a “horrible mistake recently,” when the rally remark was made 213 days earlier — a rally at which Brooks called a 2024 Trump campaign “the second coming?” Brooks had meant it, and repeated it even as he lagged behind Britt's fundraising and depended on the Club for Growth's ad spending to compete with Britt and pro-Britt PACs.",
    "We had an adverse U.S. Supreme Court decision the day before our April 2020 election, another eight days before our November 2020 election — and now here we are again.”\nThe state legislature's redistricting process seemed to be over before Republicans appealed to the state Supreme Court, after a Republican-backed justice joined the court's three liberals to sign off on a map preferred by Gov.",
    "I don't know about you, but I couldn't fit all of my life belongings into two plastic garbage bags.”\nSupporters of more policing and tougher anti-homelessness laws were mobilizing, too, with a campaign to recall Gascón and a failed recall effort against a city council member, Mike Bonin, over his support for housing homeless residents of Venice in beach parking lots.",
    "In an unsigned opinion, the Supreme Court's conservatives wrote that the state court didn't consider whether a “race-neutral alternative” map “would deny Black voters equal political opportunity.”\nThere was no challenge to the state's new congressional maps, which left the current balance in place — six seats carried by Trump and two carried by landslides by Biden.",
    "Do you approve or disapprove of the U.S. response to Russia's invasion of Ukraine (Fox, March 18-21, 1,004 registered voters)\nThis poll, like Gallup's, finds slightly higher support for Biden overall than support for his response to the Russian invasion — even though that response has more bipartisan support in Congress than nearly anything else on Biden's agenda.",
    "“The same anarchists demanded tiny home villages, and now tiny home villages are not good enough for them.”\nBuscaino had been one of two council members who opposed cutting police funding in 2020, and he was campaigning for a ballot measure that would make it easier for the city to clear camps and throw out tents if the residents refused to accept shelter.",
    "Garcetti had faced increasingly well-organized protests during his final term, including a NOlympics coalition that brought Black Lives Matter, Democratic Socialists of America and the LA Tenants Union together to oppose the city's hosting of the 2028 Games and the disruption they feared it would cause to the poor and working class.",
    "“If you arrest people,” said Bass, one of four candidates for mayor of Los Angeles at the Monday night discussion, “they'll be in jail for a couple of days, then they'll be right out.”\nSim-Marcel Bilal leaped out of his seat, using an expletive in calling Bass a “liar,” saying she didn't care about the homeless and poor at all.",
    "It’s 2 a.m., I have depositions the next day, but there I was, waiting with everyone else, because we knew the city of Milwaukee had tens of thousands of absentee ballots that would be reported at any moment, because we knew, in Wisconsin, you’re not allowed to start counting those ballots until 7 a.m. on Election Day.",
    "“So as long as they continue to ignore the people, we will continue to disrupt, and we will continue to make them feel uncomfortable in spaces when they show up in public.”\nAs the race for mayor took shape, every leading candidate was talking about hiring more police or making it harder to live on the street.",
    "Earlier this month, Jacobs invited The Trailer to her home to talk about the commission, the Republican case against it, and the threat of prosecution or jail time that's come from both Racine County and from Michael Gableman, the ex-judge who Republicans in Madison put in charge of an election probe.",
    "Still the strongest and promoting free enterprise over socialism, hands down.”\nGibbons for Ohio, “Get to Work.” Republican investment banker Mike Gibbons has run ad after self-funded ad with the same footage of him in a c-suite and making deals to distinguish himself as a non-politician.",
    "By early 2021, Garcetti was supporting more funds for the LAPD and a police action that cleared the homeless out of Echo Park; by the summer, the council had overwhelmingly passed an anti-camping law designed to get tens of thousands of people off of sidewalks and out of tents.",
    "I break my sworn oath for no man.”\nBrooks kept talking to reporters and holding events after Trump's decision, reiterating several times that the dispute over 2020 wasn't whether it was rigged — which he thinks it was — but that Trump asked for something impossible.",
    "But in Missouri, where conservative GOP state senators had filibustered to stop the approval of a map that retained the current 6-2 GOP advantage instead of creating a 7-1 advantage, legislators advanced a map that largely retained the current district lines.",
    "The most striking takeaway is that the recent documents that were just disclosed, which are supposedly all the documents they were working on in the beginning part of this investigation, say they did nothing but issue subpoenas and order office supplies.",
    "It was exactly what the protesters wanted to prevent, 90 minutes of candidates distancing themselves from slogans like “defund the police” and one-upping each other with how many homeless Angelenos they promised to relocate in their first years.",
    "Friends of Whaley/Stevens, “The Line.” The Democratic primary for governor of Ohio pits former Cincinnati mayor John Cranley against ex-Dayton mayor Nan Whaley, two center-left politicians whose cities got bluer as the state got redder.",
    "As Trump had said on the record, many times, that he believed that it was possible for states Biden had won narrowly, but where Republicans controlled state legislatures, to nullify the election and put the ex-president back in office.",
    "In Ohio, Republicans delayed state legislative primaries past May, in an ongoing legal battle over district lines, which has seen maps drawn by the GOP-led redistricting commission rejected multiple times by the Ohio Supreme Court.",
    "That's not hyperbole — in Racine County, Sheriff Christopher Schmaling has asked prosecutors to file charges against Jacobs and other commission members, saying their actions led to potential voter fraud in nursing homes.",
    "LOS ANGELES — The shouting started 29 minutes into the San Fernando Valley Faith Forum, just as Rep. Karen Bass (D-Calif.) was explaining why she would never support “criminalizing poverty” as a solution to homelessness.",
    "Brooks was struggling ahead of the May 24 primary, raising less than half as much money for his race as Katie Britt, a former chief of staff to Sen. Richard Shelby (R-Ala.) who got the retiring senator's endorsement.",
    "Since February, his rating on handing “the situation with Russia” and the “response to the coronavirus” have both ticked up by six points, giving him his first positive rating on the pandemic in this poll all year.",
    "In this edition: Why the candidates for mayor of Los Angeles keep getting interrupted, what happened to Mo Brooks, and what the chair of the Wisconsin Elections Commission thinks of the campaign to put her in jail.",
    "People's City Council, another left-wing coalition, formed at the start of the pandemic, organizing and documenting protests for pandemic relief and police reform, and against the clearing of homeless encampments.",
    "I've never experienced this before in my entire life.”\nDe León, Buscaino, Bass and the other competitive candidates for mayor are Democrats, though billionaire developer Rick Caruso only recently joined the party.",
    "One allegation is that by relaxing the rules about voting in nursing homes — because of the pandemic, bipartisan witnesses were no longer required to witness the vote — the board broke the law and enabled fraud.",
    "In July 2020, the city council voted to cut $150 million out of the LAPD's $1.8 billion budget, and in November, reform candidate George Gascón won a decisive victory to become the city's new district attorney.",
    "He was the only candidate in the race who'd fought to overturn the 2020 election, but he was looking less like he'd ride Trump's endorsement to victory — and soon enough, he didn't have the endorsement anymore.",
    "So we're going to bring those voices, those unheard voices, to these politicians because, for far too long, they've been running away.”\nThe candidates have also begun taking precautions to limit confrontation.",
    "“What I can't handle is when a small group of protesters assumes that their voices are more important than the voices of a couple of hundred people who came to hear about homelessness and engage on that issue.",
    "I don't think it's reasonable to think that some state Assembly member is going to run the computer system necessary to manage 1,850 local municipal clerks and 3 million voters here in the state of Wisconsin.",
    "But Brooks got booed first, awkwardly making a point that other Republicans had been booed for, too: that Republicans who believed the 2020 election had been stolen should come out and vote in the midterms.",
    "Brooks spoke at Trump's rally in Washington on Jan. 6, 2021, and has been probed by the committee that Democrats had set up to investigate the riot at the Capitol that unfolded when the speeches were over.",
    "On Tuesday, when Caruso, Bass, Feuer, Buscaino and de León met for a televised debate, the University of Southern California restricted access to people who had been invited by the school, mostly students.",
    "This approval rating is comparable to the one Biden closed out his first year with — the same heavy opposition from Republicans, overwhelming support from Democrats and negative views from independents.",
    "In November, polling found Britt catching up in polls, and Politico first reported that Trump was “souring” on a candidate who might lose and raise questions about the power of a MAGA endorsement.",
    "Democrats who talk about hiring more police and clearing the city's homeless encampments are confronted by people who see the policy changes of 2020 being thrown away out of fear and expediency.",
    "At last month's debate, when one of the six protesters began moving toward the stage, Buscaino leaped up and headed toward him — a moment that featured prominently in coverage of the event.",
    "There's a faction of Democrats who want more action taken against Russia, as we've seen in polls that quiz people on potential military options, and they're not satisfied at the moment.",
    "But Democrats had seen a more balanced state legislative map as key to preventing the GOP from winning a supermajority that could, if Evers wins again in November, override his vetoes.",
    "The race to replace Mayor Eric Garcetti (D) has seen debates, news conferences and even TV ad tapings interrupted by activists, accusing the candidates of racism, dishonesty and graft.",
    "“We're talking about carceral conditions,” said Gianna Furumoto, an organizer with JTown Action and Solidarity, who was among the people disrupting Monday's forum at an L.A. synagogue.",
    "They were met by protesters, who said the candidates were making excuses for police and defending housing programs, like Project Roomkey, that they felt did not respect the homeless.",
    "In 2016, there were a lot of people on the left in Wisconsin who had all of these Excel spreadsheets, saying that the exit poll interviews weren't jibing with the election results.",
    "The footage reappears in this spot, with one important addition: Gibbons stands at the end of a conference table, leaning forward, borrowing the look of “The Apprentice”-era Trump.",
    "He demonstrated what he meant with a trip to a homeless shelter, which many locals had opposed, and a visit to a block that had been crowded with tents until a sweep removed them.",
    "As it moved more into the mainstream, it actually got wackier, and you had (U.S. Sen.) Ron Johnson basically advocating for the right of the legislature to overrule an election.",
    "[In the statute, if special voting deputies make two unsuccessful attempts to assist nursing home residents with their ballots, residents are then sent the ballots to fill out.]",
    "“I can handle questions and give direct answers,” said Mike Feuer, the city attorney and a candidate for mayor, who was on the stage for both of the candidate forum disruptions.",
    "In an interview in his council district, Buscaino said the disruptions represented a very small number of people, who simply weren't being realistic about the city's problems.",
    "The 2nd Congressional District, which covers suburbs and exurbs of St. Louis and shifted left in the Trump years, got more Republican precincts in an attempt to shore it up.",
    "There's not a lot of room between those two, although the number of people who want us to be hanged for treason seems to be directly proportionate to having an AOL account.",
    "Buscaino, a former police officer, has cited protests as proof that he won't back down on his campaign for a tough anti-camping policy and a bigger law enforcement budget.",
    "(Launched in early 2020, the project was designed to get medically vulnerable members of the homeless community into hotels and motels for as long as the pandemic lasted.)",
    "Brooks would continue to run as the only Senate candidate with a reliable conservative voting record, testing whether that still matters when Donald Trump isn't on board.",
    "But in 2021, as we were listening to people attacking the right of a person's vote to be counted, it genuinely felt like democracy was in a fragile position in Wisconsin.",
    "In just a few months, activists who'd organized around providing relief for those financially hurt by the pandemic and police reform were watching their gains roll back.",
    "It's beyond me,” de León said, comparing the protests to the ones he faced when he was president of the state Senate passing a bill to make California a sanctuary state.",
    "Politicians were more concerned with making the city look good to wealthy homeowners, they said, than with housing the homeless or respecting them as human beings.",
    "One reason is that nearly a quarter of Biden voters tell Fox that they disapprove of how he's handled the crisis, and nearly a third of Black voters say the same.",
    "But People's City Council shared a short clip of Reedy standing in front of Caruso's black SUV and its vanity plate, calling him a “coward,” until it pulled away.",
    "The Trailer: What were you thinking when Sheriff Schmaling recommended a criminal investigation into the board, over allegations of voter fraud in nursing homes?",
    "It didn't take long for a media and political backlash to build, with the reformers taking the blame for higher homicide rates and growing homeless encampments.",
    "The Trailer: What do you make of the idea that the legislature can nullify the election if it determines there were enough questionable ballots to swing it?",
    "“You focus on providing more support for your rich constituents!”\nWithin minutes, the room was cleared and the forum was over, drowned out by protesters.",
    "Most of the media attention that followed the rally focused on the boos Trump got after urging members of the audience to get a coronavirus vaccination.",
    "Last week Jason Reedy, an organizer with the Stop LAPD Spying coalition, confronted Caruso while he was taping an ad in Skid Row in downtown L.A.",
    "“A lot of folks in our community are just barely surviving,” said Reedy, who considered Caruso to be the “most dangerous” candidate in the race.",
    "Jacobs: That’s sort of the Eastman memo theory, which says that only the legislature itself has the right to do anything related to an election.",
    "Jacobs, a Milwaukee attorney, joined the Wisconsin Elections Commission during Trump's presidency and became its chair during the 2020 election.",
    "Since Trump's defeat, his party has accused the commission of breaking the law by relaxing some of the state's ballot laws during the pandemic.",
    "“I am convinced now, more than ever, that bold action is needed to make our city safer for everyone, regardless of housing status,” he said.",
    "Two years ago, most of them were supportive of police reform and the protests that followed the murder of George Floyd, as were most voters.",
    "“These are the same anarchists that demanded Project Roomkey, and now Project Roomkey is not good enough,” Buscaino said of the protesters.",
    "The Trailer: What do you make of what's happened in Texas, where the state was able to pass a law with new restrictions on absentee voting?",
    "And as he talked about the policy, a barefoot woman, talking loudly to herself, walked onto the street, wandering on and off the sidewalk.",
    "When protesters crashed last week's encampment clearing in de León's district, the candidate did his media interviews behind closed doors.",
    "The real answer is that legislatures are given all sorts of powers and then they delegate them to the agencies that actually carry it out.",
    "I remember that I’m proud of the fact that I always vote.” She says she always votes Republican, and someone helps her cast the ballot.",
    "[Schmaling has continued to say that the commission “violated the law” and “admitted” that it did so with its nursing homes decision.]",
    "That hasn't canceled out the drag from voters' economic views — just 36 percent view his handling of the economy favorably, a new low.",
    "“I haven’t changed,” he told AL.com as he set off for a series of rallies, focused on replacing Mitch McConnell as Senate GOP leader.",
    "“These are people who are being criminalized, who are harmed on the regular, and they don't have the capacity to do what we're doing.",
    "“I’ve told President Trump the truth knowing full well that it might cause President Trump to rescind his endorsement,” said Brooks.",
    "The Trailer: When was it clear to you that this wasn’t over, and that there’d be people continuing to investigate the 2020 election?",
    "Last June, when he announced his candidacy next to an encampment in Venice, a woman pulled out a knife and was tackled by security.",
    "She is clearly under the influence, and these Democratic Socialists are telling me, you can't force her to go into treatment.",
    "Ann Jacobs: Right away, you started to see this drumbeat of completely false allegations about what happened in the election.",
    "We want to punish them for daring to be minority, daring to be poor, daring to be tired or poor or dealing with child care.",
    "Brooks's response, in part, was that Trump had asked him to do the impossible, and he was responding to that at the rally.",
    "“It was a Hail Mary's Hail Mary, not something we were very focused on,” said Wisconsin Democratic Party Chair Ben Wikler.",
    "Brooks was getting jeered at a rally in his (and Trump's honor), and he tried to talk over the din to win the crowd back.",
    "You’re allowed to vote because you like somebody’s TV show — you don’t need to know the ins and outs of their tax policy.",
    "I thought: I shouldn't be driving through Racine County because somebody that was as wrong as he was could be dangerous.",
    "Last April, Trump officially backed Brooks for Senate, and in August, Trump rallied in Brooks's congressional district.",
    "“This is fine example of how meth is taking over our streets and hurting those who are the most vulnerable among us.",
    "“Your policies are focused on harming people who are poor,” Bilal yelled as a security guard began to remove him.",
    "The Supreme Court's decision to reject new legislative maps from Wisconsin this week took Democrats by surprise.",
    "My family has lived here for a very, very, very long time, and I didn't want to see us go down that rabbit hole.",
    "We've got to have robust fair, safe, honest elections, with the goal of having as many people vote as possible.",
    "Most of the video of the confrontation, said Reedy, was lost after the candidate's security “body-checked” him.",
    "What they want to do is say: Okay, we'll delegate all that stuff, but then we're just going to decide who wins.",
    "The idea that whether or not your vote counts depends on who's in the legislature is a really scary thought.",
    "What I’m now most upset with, actually, is Gableman literally calling us criminals in front of the Assembly.",
    "First of all, no one in Wisconsin, nobody has to answer a push poll question in order to be allowed to vote.",
    "They come in, Evers wins, but you don’t get two years of complaints from Scott Walker that it was stolen.",
    "“There are some people who are despondent about the voter fraud and election theft in 2020,” said Brooks.",
    "But several of the Democrats running for mayor, including Caruso and Buscaino, support the Gascón recall.",
    "“I had hardcore Trump supporters make numerous death threats, so it's not unusual to me,” de León said.",
    "The idea that there was 100 percent turnout in Milwaukee nursing homes, for example — that's not true.",
    "The response, for many of them, was to show up and give their politicians hell — ideally, on camera.",
    "People didn’t remember the number they used to register 25 years ago, so their vote gets thrown out.",
    "The Trailer: What’s the current state of the Gableman investigation, and what it’s asking from you?",
    "It seemed like he didn't know what the second half of it said, because he didn't mention it at all.",
    "We do audits, we do canvasses, we do all this other stuff to verify the accuracy of the elections.",
    "Another factor: Just 47 percent of voters say they're confident of Biden's “judgment” in a crisis.",
    "“To spew epithets in a house of worship or disrupt efforts to house the unhoused — it's baffling.",
    "We put these roadblocks up all the time and we do it because we are othering the people involved.",
    "“But in regards to shutting down democracy and shouting down any attempts to house the unhoused?",
    "MILWAUKEE — If Wisconsin Republicans have their way next year, Ann Jacobs will be out of a job.",
    "The drama ended with Trump recanting the endorsement and blaming the months-old rally gaffe.",
    "Jacobs: My initial reaction was: Why isn't he talking about the other parts of the statute?",
    "Old people, including people with dementia or memory problems, have good days and bad days.",
    "But they don't care what we say,” said Ricci Sergienko, a People's City Council organizer.",
    "Now, it would depend on who's doing the arresting, why they're doing it, and all of that.",
    "But Biden's numbers on a few issues have improved at a level outside the margin of error.",
    "“Let's tell politicians: You're fired,” says Gibbons, in case the image was too subtle.",
    "The Republican map created five majority-Black districts; the Evers map created seven.",
    "That is the most arrogant thing in the world.”\nThat's not how the disrupters see it.",
    "And they may have opinions about things, even if they don't always remember things.",
    "The Trailer: What is it that the critics are asking of you and the commission now?",
    "Jacobs: I have been subpoenaed, and the Department of Justice is litigating that.",
    "Still the strongest on protecting family incomes from tax increases, hands down.",
    "“Folks, put that behind you!”\nIt was clear right away that the line didn't land.",
    "Jacobs: I thought those videos were incredibly exploitative and a little gross.",
    "Jacobs: I did see that something like 10 percent of mail ballots were rejected.",
    "Secondly, I have no idea what condition these folks were in, in November 2020.",
    "He either knows he can’t arrest us, or is so dumb he thinks he can arrest us.",
    "(As in Wisconsin, a Republican justice has been voting with the Democrats.)",
    "There has to be an agency to do the work of administering elections, right?",
    "Look, I don't want to make this sound as grandiose as it's going to sound.",
    "None have anything good to say about People's City Council or its allies.",
    "“You're not allowed to bring many of your belongings into your shelter.",
    "There isn't a name, there's not a single citation, it’s just asserted.",
    "“But I took a sworn oath to defend and protect the U.S. Constitution.",
    "“I still am the strongest candidate on border security, hands down.",
    "“Helen, would you like a ballot?” Helen says: “Yes, I always vote.",
    "The Trailer: Is there nothing legitimate about the investigation?",
    "Watching someone exploit these people is just so disappointing.",
    "Obviously, this is not a housing issue for her,” Buscaino said.",
    "I think that colors how I look at law enforcement in many ways.",
    "We're going to allow her to get hit by a car and die out here.",
    "It's crazy stuff, and people should be rebelling against that.",
    "We do try to go through this coordinated democratic process.",
    "There’s an allegation in his report of noncitizens voting.",
    "The Trailer: Well, given what’s happening, why not quit?",
    "Jacobs: Rule number one is get someone to bail you out.",
    "Trump's condemnation of Brooks wasn't based on much.",
    "First of all, some of them seem pretty darn with it.",
    "The Trailer: What would you do if you got arrested?",
    "Two years later, I’m at the victory party for Gov.",
    "Maybe the Supreme Court will decide that's true.",
    "Jacobs: I actually re-upped for five more years.",
    "All the other things that go on in normal lives.",
    "It'd be kind of shocking, but maybe they will.",
    "We punish people for that and we shouldn’t.",
    "Jacobs: They would like us to quit or die.",
    "You don't like it, but we need to move on.",
    "Rule number two is that call your lawyer.",
    "I was a public defender for nine years.",
    "(Bonin is not running for reelection.)",
    "And then we had a full state recount.",
    "The law is crystal clear on that.",
    "They fabricated a lot of things.",
    "The protesters are sick of them.",
    "My attitude was: Come on, guys.",
    "The candidates are sick of it.",
    "“We do try to set up meetings.",
    "At first, it was very fringy.",
    "There was no jurisdiction.",
    "You're heavily surveilled.",
    "It still feels that way.",
    "This is very different.",
    "Look forward!” he said.",
    "“This lady down here?",
    "That is the way I am.",
    "And I love my state.",
    "How dare he do that?",
    "It can go like this.",
    "This is the result.",
    "“Beat them in 2022!",
    "That can't happen.",
    "“But here we are.",
    "I honor my oath.",
    "I don't like it.",
    "That is insane.",
    "Tony Evers (D).",
    "“Look forward!",
    "Look forward!",
    "Sort of.",
    "Evers.",
    "Why?"
  ]
}