{
  "id": 2838,
  "mediaId": 2658,
  "date": "2022-03-16",
  "headline": "POLITICO Playbook: What Zelenskyy wants vs. what he'll get",
  "image": "https://static.politico.com/a3/4b/e7e837d0436fa93367d0feeadcaa/220316-zelenskyy-ap-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/03/16/what-zelenskyy-wants-vs-what-hell-get-00017668",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2409,
    2693,
    2807,
    2976,
    3975,
    831,
    1124,
    4995,
    5366
  ],
  "sentences": [
    "PHOTO OF THE DAY\nPLAYBOOK READS\nBEYOND THE BELTWAY\nPOLL: ‘DON’T SAY GAY’ BILL HAS SLIM MAJORITY SUPPORT — Gary Fineout dives into more results from the latest POLITICO/Morning Consult poll, finding that nationwide, “American voters are sharply divided over two contentious bills Florida’s state Legislature recently passed that deal with the teaching of race and gender identity.”\n— On Florida’s “Parental Rights in Education” legislation, which opponents have dubbed the “Don’t Say Gay” bill: “A slim majority of U.S. voters who were polled — 51 percent — support ‘banning the teaching of sexual orientation and gender identity from kindergarten through third grade,’ while 35 percent are opposed … The GOP-backed measure has garnered national attention and condemnation from LGBTQ supporters, including President Joe Biden, with opponents saying it could further marginalize some students and lead to bullying and even suicide.”\n— On banning “critical race theory” from schools: National respondents were split — 40% supported a ban, while 43% opposed it.",
    "Many Ukrainians would argue that their people didn’t fight and die to achieve neutrality.”\n— The latest intelligence update from the U.K. government, posted early this morning, says “Russian forces are struggling to overcome the challenges posed by Ukraine’s terrain.” On the ground Russian vehicles don’t often venture off-road, and in the skies “Russia’s continued failure to gain control of the air has drastically limited their ability to effectively use air manoeuvre, further limiting their options.”\n— Fox News mourned the death of two beloved colleagues covering the war in Ukraine: Pierre Zakrzewski, a cameraman, and Oleksandra “Sasha” Kuvshynova, a consultant who was 24 years old.",
    "SPOTTED:Sally Quinn, Margaret Carlson, Doug Holladay, Phil Rucker, Steve Clemons, Karen Pierce and Charles Roxburgh, Betsy Woodruff Swan and Jonathan Swan, Elsa Walsh and Bob Woodward, Olivia Nuzzi and Ryan Lizza, Quinn and Fabiola Bradlee, Pamela Reeves and Jeff Goldberg, Mary Jordan, Bob Costa, Remi Yamamoto, Sharyn Rothstein, Paul Glastris, Steve Weisman, Lucky Roosevelt, C. Boyden Gray, John Negroponte, Keslue Marshall, Greek Ambassador Alexandra Papadopoulou, Fillipos Letsas, Harry Andreades and Vassilis Coutifaris, Helen Philon, and historian Peter Frankopan, who will deliver a free public lecture today at Georgetown University on the impact of Greek culture.",
    "Pic … Another pic\nHAPPY BIRTHDAY: Reps. Ron Kind (D-Wis.) and Yvette Herrell (R-N.M.) … NATO Secretary-General Jens Stoltenberg … AP’s Julie Pace (4-0) … MSNBC’s Amy Shuster … Art Collins … White House’s Jeff Nussbaum … former Rep. Joe Crowley (D-N.Y.) of Squire Patton Boggs (6-0) … Rebecca Coffman … SKDKnickerbocker’s Jason Rosenbaum … Andy Lewin of BGR Group … Ian McCaleb … WaPo’s Dalton Bennett and Ellen McCarthy … Scott Simon (7-0) … Boeing’s Kevin Varney … Adam Blickstein … TechNet’s Carl Holshouser … Enrique Marquez … Jordana Cutler … Brian Young … NYT’s Neil Vigdor and Brian Rosenthal … Gary Emerling … Alexandra Stabler\nDid someone forward this email to you?",
    "The letter\nOHIO’S GIBBONS USED OFFENSIVE STEREOTYPES — NYT’s Blake Hounshell and Leah Askarinam scoop that MIKE GIBBONS, who is leading in the crowded Ohio GOP Senate primary, “employed offensive stereotypes about Asian people in a 2013 podcast, citing a widely discredited book, ‘The Bell Curve,’ that has drawn allegations of racism and sloppy research.”\n— What he said, per the story: “I’ve often thought that when I’ve run into Asians they’re all — you know, if you’ve ever read ‘The Bell Curve’ … And it said that the smartest people in the world as far as measurable I.Q.",
    "Beyond the MIG fighter planes, Ukrainian officials have crafted a list of additional matériel the Biden administration might be more willing to give, one of the diplomats said.”\n— Other items on the list, per the Times: more Stingers and Javelins, “long-range, anti-ship missiles, improved satellite navigation technology, tactical military radios, communications jamming equipment and other electronic warfare equipment.”\nBUT HE STILL MAY SHAME BIDEN A BIT — Zelenskyy addressed the U.K. parliament last week and the Canadian parliament Tuesday.",
    "): “It does seem to me that the administration has to be dragged along and pushed to do the right thing … Zelenskyy’s courageous leadership is making a significant difference.”\nMore on Ukraine:\n— Dan Balz calls Zelenskyy “a beacon to the world, a wartime leader rallying his country, a symbol of courage in the face of personal danger, a politician who has shown anew the power of words and language.”\n— Bret Stephens argues: “Arming Ukraine with Javelin and Stinger missiles has wounded and embarrassed the Russian military.",
    "… Forty-five percent of those who responded were opposed to letting parents sue, while 36 percent supported the idea.”\n— Related op-ed: “I object to Florida’s ‘Don’t Say Gay’ bill as a lesbian mom — and as a conservative,” by Sarah Longwell in WaPo\nALL POLITICS\nTHE MODERATE SQUEEZE — The Arizona Coalition to End the Filibuster, which helped push EMILY’s List to drop its support of Sen. KYRSTEN SINEMA (D-Ariz.), is now pressuring the Human Rights Campaign to do the same, Holly Otterbein scoops this morning.",
    "More from Vajdich: “Those in the Biden administration who advocated for minimizing security assistance to Ukraine before the invasion were wrong then and they’re wrong now in refusing to provide the Ukrainians with the support they need … Without naming anyone explicitly, Zelenskyy will call on these people to wake up before it’s too late.” For more from Vajdich, listen to our interview on the latest episode of “Playbook Deep Dive”\nThe White House reacted a bit testily to Vajdich’s preview.",
    "“It seemed whenever I got in trouble, all of a sudden, I read these articles with senator after senator making positive remarks — and I know who was behind that, and I really appreciate that.”\nBarr also lamented the arc of Donald Trump’s presidency: “I was very deeply frustrated by the second year of the administration, because I felt that a lot of people worked very hard” to help Trump win the “eminently winnable election,” he said.",
    "But he said any Russian pullback would have to be, ‘in effect, irreversible.’”\n— David Ignatius has an important piece about the diplomatic track that includes this revelation: “Diplomats have been working overtime this past week to craft a formula for a neutral Ukraine on the model of Austria, whose security would be guaranteed by Germany, France, Russia, the United States and perhaps other nations.",
    "Since the war, lawmakers have tripped over each other to satisfy Zelenskyy’s requests, and Biden has generally followed along:\n“Through his private Zoom meetings with lawmakers and his dramatic public pleas, Zelenskyy got Capitol Hill on board for additional military assistance and a ban on Russian oil imports within days — unheard-of speed for Congress.”\n— Said Sen. JOHN BARRASSO (R-Wyo.",
    "WHAT ZELENSKYY WILL SAY — Betsy Woodruff Swan interviews DANIEL VAJDICH, a longtime lobbyist for Ukrainian interests, who says “he has consulted with Zelenskyy’s advisers about the speech.”\n“Zelenskyy is going to express gratitude to the U.S. for what it’s done to support Ukraine and punish Russia, but he’s also going to name and shame, or at least shame, and rightly so,” he tells Betsy.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Keep up:\n1) BARR’S BOOK BASH — At a book party in his honor Tuesday night, former A.G. Bill Barr thanked “the people who stood up for me” during his time leading the DOJ — specifically name-checking McConnell and Sen. Lindsey Graham (R-S.C.), who were among the attendees at the Ristorante Tosca soiree in downtown D.C.\n“I always had the senators in my pocket,” Barr said.",
    "‘They’re very good at copying,’ Gibbons added.”\nSpeaking of headaches for RICK SCOTT …\nWALKER QUESTIONS EVOLUTION, IVF — During an appearance Sunday at Georgia’s Sugar Hill Church, GOP Senate candidate HERSCHEL WALKER expressed doubt about the theory of evolution, reports HuffPost’s Amanda Terkel: “At one time, science said man came from apes, did it not?” Walker said.",
    "He most recently was special operations coordinator for Rep. Matt Gaetz (R-Fla.), for whom he created and directed the video podcast “Firebrand,” and previously produced Steve Bannon’s “War Room.” … Tom Foulkes is joining Platinum Advisors as SVP, working on its new “50 State Program.” He currently is senior director of state advocacy at BSA | The Software Alliance.",
    "PLAYBOOKERS\nAfter Mark Warner suggested that Jon Tester’s bracket prediction of a Montana State University NCAA basketball championship was unlikely (they’re a 16-seed in the women’s tourney and a 14-seed in the men’s), Tester challenged him to a game of one-on-one while sharing an instantly classic gif of the Montana senator flagrantly fouling Cory Booker in 2018.",
    "SPOTTED: Reps. Kathleen Rice (D-N.Y.) and Debbie Wasserman Schultz (D-Fla.), Joe Cunningham, Ben McAdams, Dennis Cardoza,Tom Graves, Bob Van Heuvelen, Tait Becker, Suzanne Beall, Alisa La, Ryan Guthrie, Heather McHugh, Michael Lukso, Libby Greer, Jennifer Walsh, Kristen Hawn, Michael Castellano, Chris Davis, Peter Filon, Grace Rodden and Courtney Lee-Ashley.",
    "“The fact is President Biden authorized a record amount of security assistance over the past year to Ukraine, $1.2 billion, including $650 million before Russia’s invasion.”\nShortly after Betsy’s piece went live, the WSJ reported that Biden would announce another $1 billion in security assistance to Ukraine today after Zelenskyy speaks.",
    "POLITICO Playbook: What Zelenskyy wants vs. what he'll get\nBy RYAN LIZZA, RACHAEL BADE and EUGENE DANIELS\n03/16/2022 06:17 AM EDT\n Updated 03/16/2022 11:09 AM EDT\n 2022-03-16T11:09-0400\nPresented by\nDRIVING THE DAY\nZELENSKYY SPEAKS — Ukrainian President VOLODYMYR ZELENSKYY will address Congress virtually at 9 a.m. today.",
    "His approach is to prick the conscience of his audience by bringing the horror of the war home to his audience and asking them to imagine Russian bombs striking famous monuments, like the CN Tower in Toronto, and then shaming leaders for expressing solidarity with Ukraine without fufilling his most urgent requests.",
    "ICYMI: SAVING DAYLIGHT — The Senate on Tuesday “passed legislation that would make daylight saving time permanent starting in 2023, ending the twice-annual changing of clocks in a move promoted by supporters advocating brighter afternoons and more economic activity,” Reuters’ David Shepardson writes.",
    "— Second, the debate over a no-fly zone and Polish MiGs has obscured the fact that the real fight in Congress is now over whether to facilitate the transfer to Ukraine of long range surface to-air-missiles, such as S-300s, which three NATO countries — Bulgaria, Greece and Slovakia — all have.",
    "— The timing: As our Nancy Vu and Sarah Ferris write for Congress Minutes, this mini-outbreak comes about two weeks after Democrats moved to eliminate the Capitol’s mask mandate, which itself followed a party-wide decision to separate themselves from politically unpopular pandemic mandates.",
    "The open letter from “more than 100 Arizona-based LGBTQ activists and national supporters … charges that Sinema’s position on the filibuster is preventing the Equality Act from passing.” It also advocates for HRC donors to stop giving to the organization until it cuts ties with Sinema.",
    "‘And when we ran into a word problem — and you know, I think this is a function of the educational track they put them on — they got lost in the weeds.’ As the discussion continued, his co-host asserted that the Chinese education system did a poor job of teaching critical thinking.",
    "But most Republicans in Congress say they will not approve another aid package unless the White House finds a way to pay for it.”\n— Nugget: As the House moves forward trying to pass their own version of this funding, we’re told that House Minority Whip STEVE SCALISE (R-La.)",
    "Refusing to do so may only prolong Ukraine’s agony.”\n— Secretary of State ANTONY BLINKEN told NPR in an interview that just posted “that U.S. sanctions against Russia are ’not designed to be permanent,’ and that they could ‘go away’ if Russia should change its behavior.",
    "— The NYT reports: “Ukrainian officials plan to present the United States with a list of military equipment they need, including armed drones and mobile air-defense systems, as Mr. Zelenskyy addresses Congress, according to two European diplomats briefed on the request.",
    "— And this morning, Marianne LeVine and Burgess Everett write that at least two Senate Democrats are undecided on whether to support ED GONZALEZ’s nomination to lead Immigration and Customs Enforcement after the discovery of domestic abuse allegations against him.",
    "Eight Senate Dems — including several up for reelection this fall — voted with the GOP: MICHAEL BENNET (Colo.), CATHERINE CORTEZ MASTO (Nev.), MAGGIE HASSAN (N.H.), MARK KELLY (Ariz.), JOE MANCHIN (W.Va.), JACKY ROSEN (Nev.), Sinema and JON TESTER (Mont.).",
    "— On Tuesday, SARAH BLOOM RASKIN withdrew her nomination to be the Federal Reserve’s top Wall Street watchdog “amid a clash over her climate views, ending a monthlong standoff that held up a slate of Fed nominees,” our Kate Davidson reports.",
    "VP KAMALA HARRIS’ WEDNESDAY — The VP will speak about “making communities safer, including on the campuses of Historically Black Colleges and Universities,” at 3 p.m., with Garland and Education Secretary MIGUEL CARDONA also speaking.",
    "— First, the $1 billion figure includes $200 million in previously appropriated funds that Biden already announced over the weekend, and $800 million in new funds from the $13.6 billion aid package signed into law on Tuesday.",
    "ENGAGED — Nick Iacovella, SVP for public affairs and comms at the Coalition for a Prosperous America, proposed to Chelsea Pezzola, a former professional golfer and media personality, on Feb. 28 at Nobu Los Cabos in Mexico.",
    "Pic … Another pic\nWELCOME TO THE WORLD — Ryan McCormack, chief of staff to Rep. Scott Fitzgerald (R-Wis.), and Anna McCormack, chief of staff to Rep. David Rouzer (R-N.C.), welcomed daughter Maeve McCormack on March 6.",
    "And then right below them was basically everybody in China, India and, you know, throughout the Asian countries.”\n“About a minute later, Gibbons… described being in a class with ‘mostly Asians’ during graduate school.",
    "— 11:45 a.m.: Biden will speak about U.S. assistance to Ukraine, with Secretary of State ANTONY BLINKEN, Deputy Secretary of Defense KATHLEEN HICKS and the Joint Chiefs of Staff Chair Gen. MARK MILLEY in attendance.",
    "But there is increasing pressure on Biden to help beef up Ukrainian air defenses beyond Stingers and Javelins, and behind the scenes, Zelenskyy’s wish list is more realistic than his public remarks have suggested.",
    "They are: Reps. JARED GOLDEN (Maine), MADELEINE DEAN (Pa.), KIMBERLY SCHRIER (Wash.), ZOE LOFGREN (Calif.), ROSA DELAURO (Conn.), GERRY CONNOLLY (Va.), ANDY KIM (N.J.), JOE NEGUSE (Colo.) and PETER WELCH (Vt.).",
    "SPEAKING OF COVID — The standoff between the White House and Congress over the administration’s request for more Covid relief money continues, and NYT’s Sheryl Gay Stolberg has a good recap of the latest.",
    "CONGRESS\nPANDEMIC SPLIT SCREEN — Days after returning from their caucus-wide retreat, nine House Democrats have tested positive for the coronavirus — a number that’s probably only going to increase.",
    "There is nothing Zelenskyy can say today that will change Biden’s mind about a no-fly zone or the transfer of the Polish MiGs — administration officials repeatedly emphasized that point on Tuesday.",
    "How many more missiles must fall on our cities?’ And in response, you hear that someone does not want to do it … But they are deeply concerned!”\n“‘Then give us planes,’ we tell our partners.",
    "Before the war, his efforts were a bit clumsy, and he ran afoul of the Biden administration when he backed Sen. TED CRUZ’s (R-Texas) legislation to sanction the Nord Stream 2 gas pipeline.",
    "Meanwhile, “the White House announced on Tuesday that public tours would resume in April, after being suspended at the start of the pandemic,” write NYT’s Emily Cochrane and Anushka Patil.",
    "Doug Emhoff had an eventful Tuesday: first, picking kale in a Northeast D.C. community garden (“We did it, Joe!” he said, turning to the press) — then testing positive for the coronavirus.",
    "Instapics\nWEEKEND WEDDING — Melissa Brown, comms director for the House Freedom Caucus, and James Braid, chief of staff for Rep. Ken Buck (R-Colo.), got married Saturday in Washington.",
    "They’re still trying to do it, but they can’t, because there has to be a God.’”\n— Why it’s important: These sorts of comments may play well with evangelical portions of the GOP base.",
    "According to a House of Representatives fact sheet, only $3.5 billion of it is for military aid to Ukraine (“to replenish U.S. stocks of equipment sent to Ukraine through drawdown”).",
    "Think about it.”\nIn the same conversation, Walker “also appeared to question in vitro fertilization and other forms of assisted reproductive technology,” per WaPo’s Felicia Sonmez.",
    "— 1:45 p.m.: Biden will speak at an event celebrating the Violence Against Women Act reauthorization, with A.G. MERRICK GARLAND and HHS Secretary XAVIER BECERRA in attendance.",
    "), Lachlan Murdoch, Rod Rosenstein, Jeff Rosen, Pat Cipollone, Robert Thompson, Samantha Dravis, Virginia Boney, Kerri Kupec, Jack Keane, Will Levi, Jon Karl and Josh Dawsey.",
    "2) A GOODBYE — Rep. Stephanie Murphy (D-Fla.) held a supporter “Thank You” event Tuesday night, where she also honored chief of staff Brad Howard, who’s leaving her office.",
    "— Biden got his (runner-up) pick for OMB director: On Tuesday, the Senate voted to confirm SHALANDA YOUNG to run the budget agency after NEERA TANDEN pulled out last year.",
    "The poll also asked whether “parents should be allowed to sue school districts if they allowed critical race theory to be taught in schools, an idea first touted by [Gov.",
    "The remarks are also a distraction from the issues Senate Minority Leader MITCH MCCONNELL wants Republicans to focus on, like inflation, gas prices and crime.",
    "Omarosa Manigault Newman is getting hit with a $61,585 penalty for failing to file a financial disclosure report after she was fired from Trump’s White House.",
    "The headlines will likely focus on the red lines that President JOE BIDEN won’t cross: Zelenskyy’s request for a no-fly zone and the transfer of Polish MiGs.",
    "Despite it all, Barr said he didn’t regret joining the administration, because he was worried about Trump being “stampeded out” by the Russia investigation.",
    "THE HOUSE will meet at 10 a.m. CAROLE KING will be among those testifying before an Oversight subcommittee at 10 a.m. on forest management and wildfires.",
    "3) A DINNER — Alexander Philon and A. Phokion Potamianos hosted a dinner at the Cosmos Club on Tuesday night to promote the Gennadius Library in Athens.",
    "They just don’t want to.”\nHOW ZELENSKYY CONQUERED CONGRESS — Andrew Desiderio traces the history of Zelenskyy’s three-year effort lobbying Congress.",
    "Mehmet Oz said he’d waive security clearances that senators automatically receive if it means he could maintain his dual citizenship with Turkey.",
    "“The president was told by everybody just to tone it down a little bit, some of his behavior,” or else he risked losing support in the suburbs.",
    "“Until now, both the Trump and Biden administrations have been able to secure emergency money for coronavirus relief with no strings attached.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "MEDIA MOVE — Gina Chua will be executive editor of the new startup Ben Smith and Justin Smith are launching, per NYT’s Katie Robertson.",
    "This formula would reflect a major concession by Putin, but it could also diminish the heroic status of President Volodymyr Zelensky.",
    "But what about the swing voters Republicans need to take back Georgia, a state they’re depending on to win the Senate majority?",
    "‘It was astounding to me how much they studied, how they were incredibly bright, but they memorized formulas,’ Gibbons said.",
    "Here’s how he did it with Canadian PM JUSTIN TRUDEAU on Tuesday:\n“I know that you support Ukraine, sincerely, effectively.",
    "Eugene has more on this here\nKamala Harris subsequently bowed out of an Equal Pay Day event, lest she also test positive.",
    "TRANSITIONS —Vish Burra is joining Logan Circle Group as executive producer as they expand their investment in podcasts.",
    "It’s unclear what the House will do — or Biden, for that matter — but it’s safe to say the sudden vote (and passage!)",
    "Providing Kyiv with MIG-29 fighter jets and other potentially game-changing weapon systems could help turn the tide.",
    "“I want you to feel what it’s like when you call your friends and say: ‘Close the sky, stop the shelling.",
    "— 7:45 p.m.: Biden will speak at the Ireland Funds 30th national gala at the National Building Museum.",
    "Ewing will be director of the political department and remain as a political adviser to Virginia Gov.",
    "… Tom Carpenter is joining Mastercard as SVP for industry and standards engagement in North America.",
    "“The impasse is a major change in Washington’s approach to the two-year-old pandemic,” she writes.",
    "On Tuesday, the Senate passed a RAND PAUL-sponsored bill repealing federal travel mask mandates.",
    "…\n… Poolhouse is adding Jonathan Ewing, Bradley Leonard, MaryGrace Downey and Natalie Bell.",
    "He previously was director of public affairs and marketing at the Financial Data Exchange.",
    "OUT AND ABOUT — Washington is lit, y’all, as people are coming out of their Covid caves.",
    "BIDEN’S WEDNESDAY:\n— 9:30 a.m.: The president will receive the President’s Daily Brief.",
    "But don’t expect this to trigger a reversal of the new Democratic position on masks.",
    "“We have no idea what this quote is referencing,” NSC spokeswoman EMILY HORNE said.",
    "Leonard is joining the post-production team and is an NRCC, NRSC and Youngkin alum.",
    "(This won’t move in the House, but it suggests where the politics are right now.)",
    "But the White House has otherwise had a hard week with its nominees.",
    "is gearing up to whip Republican members against this legislation.",
    "Utah Republican MITT ROMNEY was the sole GOP vote against it.",
    "Downey is joining the political team and is a Youngkin alum.",
    "RON] DESANTIS but that was not included in the final bill.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "Bell will be production coordinator and is an RNC alum.",
    "She most recently has been executive editor of Reuters.",
    "Be patient a little.’ Everyone is deeply concerned.",
    "“‘And then, the conception of a baby,’ Walker said.",
    "But that $13.6 billion figure is a bit misleading.",
    "Hillary Clinton mocked Russia for sanctioning her.",
    "Press secretary JEN PSAKI will brief at 2:30 p.m.",
    "But I want you to understand me, and to feel it.",
    "Send Playbookers tips to playbook@politico.com.",
    "“If that is true, why are there still apes?",
    "That means Democrats will be on their own.",
    "‘Let me tell you, science can’t do that.",
    "But the devil will be in the details.",
    "No matter which way, just do it.",
    "SPOTTED: Sen. Tom Cotton (R-Ark.",
    "caught the Senate by surprise.",
    "Thanks for reading Playbook.",
    "We are friends with Justin.",
    "But the debate has shifted.",
    "She later tested negative.",
    "Feel how we want to live.",
    "And how we want to win.",
    "Good Wednesday morning.",
    "were Ashkenazi Jews.",
    "They answer: ‘Soon.",
    "Feel what we feel.",
    "Stop the bombing.",
    "THE SENATE is in.",
    "NOMINATION WOES?",
    "Glenn Youngkin.",
    "Sign up here.",
    "Win for life."
  ]
}