{
  "id": 5489,
  "mediaId": 2641,
  "date": "2022-02-04",
  "headline": "GOP Campaign Ads Vilify Fauci: 'Freedom Over Flip-Flops'",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=40da015a-14e0-452d-b688-490d18a28005&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/AnthonyFauci-Republicans-Midterms-CampaignAds/2022/02/04/id/1055558/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Theodore Bunker",
  "authorUrl": "",
  "termIds": [
    2131,
    2576,
    677,
    831,
    878
  ],
  "sentences": [
    "Fauci's office did not respond to Politico's request for comment, but he previously said before the Senate Health Committee that Paul's frequent attacks and allegations, which Fauci denies, encourage \"the crazies\" to send death threats to him and his family.",
    "Sen. Rand Paul, R-Ky., a vocal critic of Fauci, recently released an ad endorsing Ohio GOP Senate candidate Mike Gibbons in a video noting his support for firing the nation's top expert on infectious disease.",
    "Republicans across the country are targeting National Institute of Allergy and Infectious Diseases Director Anthony Fauci in campaign ads ahead of the 2022 midterm elections, Politico reports.",
    "Pennsylvania GOP Senate candidate Mehmet Oz also released an ad attacking Fauci, saying: \"The big government medical establishment came after me because I dared to challenge Fauci on COVID.\"",
    "Another Ohio GOP Senate candidate, Jane Timken, released an ad last fall saying, \"Let's fire Fauci and take back our freedoms.\"",
    "Ron DeSantis of Florida put out an ad saying, \"Fauci can pound sand,\" and offering \"freedom over Fauci flip-flops.\"",
    "\"I know Mike Gibbons will join me in demanding that Fauci is immediately fired and removed from office.\"",
    "That's why I'm endorsing Mike Gibbons for Senate,\" Paul says in the ad.",
    "\"I've stood strong against the mandates of Dr. Fauci, but I need help.",
    "Republican Gov."
  ]
}