{
  "id": 619,
  "mediaId": 2731,
  "date": "2022-04-14",
  "headline": "If You Like Donald Trump Then You Want a Real Primary",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2022/101/6204819b-e8ec-4147-90ca-d6a425b2314a.jpg",
  "link": "https://townhall.com/columnists/kurtschlichter/2022/04/14/if-you-like-donald-trump-then-you-want-a-real-primary-n2605798",
  "mediaOutlet": "townhall.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kurt Schlichter",
  "authorUrl": "https://townhall.com/columnists/kurtschlichter/",
  "termIds": [
    1269,
    2104,
    2131,
    2201,
    2248,
    2367,
    3481,
    4433,
    1094
  ],
  "sentences": [
    "Seven years after coming down the escalator and revolutionizing American politics by advocating the conservative/populist agenda that the bipartisan ruling caste had ignored for decades as our country swirled around the bowl, it is looking like we in the base have evolved while Trump is stuck in 2016, hitting golf balls, sending out his communiqués, and attending rallies that evoke but do not match the good old days.",
    "In fact, just moments before the announcement that he had elected to bestow his blessing upon a guy with a record of supporting gun control, tolerating CRT, accepting abortion and playing along with the Mommy Munchhausen-driven trans kid mutilation fad, I was on Twitter listing him as being tied with Ronald Reagan as the greatest president of my long life.",
    "Trump, under the vilest and most hateful attacks imaginable by an enraged ruling class, rescued our Constitution by beating that bitter harridan Felonia Milhous von Pantsuit and, against great odds, moved this country back toward freedom.",
    "But holy cow, did he ever do great things – remaking SCOTUS, firing up the economy, no dumb new wars, tax cuts, and even solving the Middle East conflict we had been watching unfold on TV for our entire lives.",
    "Maybe he'll decide to pass over JD Vance in the #OHSEN race for that knucklehead \"businessman\" Mike Gibbons, who decided the big problem in America today is that the middle class is not paying enough in taxes.",
    "He's not physically soft and flabby – I saw him up close recently at an event, and he is in terrific physical shape and mentally sound, unlike that dust puppet currently occupying the Oval Office.",
    "He was the avatar of something bigger than himself that has kept growing even as Trump has treaded water in a swamp of (justifiable) election grievances, unfocused tangents, and tired habits.",
    "His failure to fire Fauci and reject the pandemic fascism are black marks, as is his failure to adequately prepare for and handle the 2020 election and the legal aftermath.",
    "Trending\nTime for some real talk about our favorite ex-president – this Dr. Oz endorsement reaffirms what we have all been seeing, that Donald Trump is losing his edge.",
    "The sixth, The Split, is now out, but get all these action-packed bestsellers, including \"People's Republic,\" \"Indian Country,\" \"Wildfire,\" \"Collapse,\" and \"Crisis\"!",
    "And also get my Kelly Turnbull conservative action thriller series about America splitting into red and blue countries with the large-caliber chaos that follows.",
    "At least early on, and with some notable exceptions, Trump was to savvy personnel decisions as Brian Stelter (who is a potato) is to the Chippendales dancers.",
    "He'll win some, but at this rate, he'll lose a bunch – PA conservatives are not going to vote for a lib in cons clothing just because Trump says to.",
    "This Dr. Oz fiasco is really emblematic of the fact that Trump is down in Mar-a-Lago, growing out of touch with the moment he spearheaded.",
    "In his late seventies, Trump is going to have trouble accepting that the world he grew up and thrived in is no longer the world of today.",
    "Leaving aside that none of them defended him in print or fought for election integrity, they are simply enabling Trump's worst instincts.",
    "Maybe Ted Cruz will hit Trump as hard as he's been hitting the libs lately (Cruz's speech on the pedo-tolerating KBJ was legendary).",
    "And, if he wants to run again, he needs a bunch of opponents to fight with, and not just cruise ship con dorks like Larry Hogan.",
    "It seems like he wants to run again in 2024, but Trumpworld is giving off the definite impression that he expects a coronation.",
    "His bizarre endorsement of Dr. Oz for the Pennsylvania Senate seat, greeted with a collective \"What the hell was he thinking?\"",
    "He can still turn it around, but right now, the truth is that he's messing up – and someone needs to tell him the truth.",
    "Ignoring America First Alex Gray, who worked for him for years, in the #OKSEN race in favor of some establishment hack?",
    "I consider politicians fungible tools to be deployed, and my interest is in America, not any individual's ambition.",
    "Maybe he earns the right to a rematch against whatever Democrat loser they select to replace Grandpa Badfinger.",
    "I argued for America First policies here and on social media and lawyered against election fraud in Nevada.",
    "Look at the announcement he made explaining why he selected the ridiculous Dr. Oz as his #PASEN champion.",
    "I have a new book coming out that (among other things) explores how he might pull a Grover Cleveland.",
    "But he has no power over who chooses to run against him if he does run himself (I think it's 50/50).",
    "But the last time he had a coronation, and as a result, he's getting his mail in Florida and not DC.",
    "In his statement, he stressed that Oz is a Harvard graduate who wrote New York Times bestsellers.",
    "We in the base are far beyond crediting these failing progressive institutions with any prestige.",
    "You need to get your head right and get back in the game, whether as a candidate or a kingmaker.",
    "So, with all that in mind, here's the hard truth that it seems no one around him will tell him.",
    "Passing over Eric Schmitt in the #MOSEN race for bondage guy/impeachment dodger Eric Greitens?",
    "He needs someone around him who can shut the door and ask, \"What the hell are you thinking?\"",
    "And if he earns the nom, he will be sharp and in shape for the bloody battle in the general.",
    "This tough love does not come from an opponent, but it also does not come from a minion.",
    "Sadly, at his age, he's unlikely to change and start welcoming people telling him \"No.\"",
    "We've grown totally alienated by, and opposed to, the institutions that have failed us.",
    "It is not too much to observe that he may have saved our country from leftist tyranny.",
    "Pre-order my upcoming non-fiction book, \"We'll Be Back: The Fall and Rise of America.\"",
    "It talks about national divorce, civil war, and whether we will see Donald Trump 2.0.",
    "View Cartoon\nStill, it's not unreasonable to require that he learn from his mistakes.",
    "Understand what the libs don't – Trump did not create the America First movement.",
    "This kind of error squanders his mystique and makes him look weak and vulnerable.",
    "And Check Out Last Week's Stream of Kurtiousness, The Left Has Lost the Fight.",
    "An Ivy League degree remains a plus to Trump, but it's a huge negative to us.",
    "I don't work for Trump, and he's never given me so much as a Christmas card.",
    "Maybe Ron DeSantis, his wife thankfully cancer-free, steps up and takes it.",
    "His vibe was great in 2016 when he was the right man at the right time.",
    "He chose not to endorse America First stalwart Robby Starbuck in TN-5.",
    "Trump desperately needs a primary to get back in touch with the base.",
    "So what I say here comes from a place of respect and appreciation.",
    "A lot of his endorsements are easy, with obvious, sure winners.",
    "I've never met him or gotten one of his legendary phone calls.",
    "It illustrates how the movement has, to some extent, moved on.",
    "among the base, is only the latest of his tone-deaf maneuvers.",
    "If you like Trump, you want him to fight for it and earn it.",
    "Maybe we will see Pompeomania ignite the base's imagination.",
    "Now, plenty of Trump fans will be furious about this column.",
    "Demand he earns what he seeks instead of handing it to him.",
    "It's been seven years, and Trump seems not to have changed.",
    "If you support Donald Trump, you want him to be primaried.",
    "If you like Trump, the last thing you want is a cakewalk.",
    "But he's not cutting it with the harder endorsements.",
    "If you like Trump, as I do, you want him at his best.",
    "And I'll happily fight anyone who says differently.",
    "And that's fine – our relationship is utilitarian.",
    "You can't be a kingmaker if you can't make kings.",
    "He bungled the Alabama endorsement of Mo Brooks.",
    "But he is off his game and making bad decisions.",
    "I don't owe Trump anything – politicians owe me.",
    "I wrote a book about the false attacks on him.",
    "What he needs is some pushback, some pressure.",
    "Conservatives Must Stand Together and Fight.",
    "His bad decisions risk devaluing his brand.",
    "And his best is when he is fighting back.",
    "A primary will sharpen him and test him.",
    "Then there's this Dr. Oz clusterfark.",
    "Or maybe Trump succeeds once again.",
    "Mr. President, you are screwing up.",
    "As if those are impressive things.",
    "And he needs a war to be his best.",
    "If you dig Trump, do him a favor.",
    "Sure, Trump wants a coronation.",
    "We were blessed to have him.",
    "And my podcast, Unredacted.",
    "I doubt he knows I exist.",
    "That remains to be seen.",
    "And maybe he fails.",
    "Trump is a fighter.",
    "Demand excellence.",
    "Join Townhall VIP.",
    "Don't coddle him.",
    "He is a warrior.",
    "Was he perfect?",
    "I like Trump.",
    "Give him one.",
    "But in 2024?",
    "But who is?",
    "What next?",
    "No."
  ]
}