{
  "id": 6435,
  "mediaId": 2550,
  "date": "2022-01-24",
  "headline": "Morning Digest: GOP establishment rallies behind challenger to indicted Nebraska congressman",
  "image": "https://images.dailykos.com/images/1029777/story_image/AP22021707176590.jpeg?1642944720",
  "link": "https://www.dailykos.com/stories/2076307",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1480,
    1636,
    2090,
    3651,
    4230,
    4342,
    878,
    5175,
    5176
  ],
  "sentences": [
    "To begin with, the survey asks any respondents who say they plan to vote in the Democratic primary, don't plan to vote in any nomination contest, or are unsure, if they'd support Greene's \"Republican opponent this one time to hold Marjorie Taylor Greene accountable for repeatedly ignoring problems in her own district and inserting herself into the national news, knowing that you could still vote for a different candidate in the general election.\"",
    "Opt in to email updates from Daily Kos Elections\nSponsored by: Daily Kos Elections\nThe congressman, who is under federal indictment for allegedly lying to investigators as part of a probe into a foreign billionaire who used straw donors to illegally funnel a total of $180,000 to Fortenberry and three other GOP candidates, quickly put out a statement making it clear just how angry he was.",
    "In a 2015 report, the Office of Congressional Ethics concluded that Azerbaijan's state-owned oil company had used AFAZ and another nonprofit to funnel $750,000 that was used to \"secretly fund[] an all-expenses-paid trip\" to a conference in the Azeri capital of Baku attended by 10 members of Congress and their staffs in the spring of 2013, according to the Washington Post.",
    "That year, an underfunded El Paso County commissioner named Darryl Glenn wowed the delegates with a speech and secured so much support that no one else competing at the assembly advanced; Glenn ended up winning the nomination before losing the general election to Sen. Michael Bennet, the Democrat that O'Dea, Campana, and several others are now trying to unseat.",
    "According to an unnamed source who spoke with ABC News' Mike Levine, the matter concerns \"a wide-ranging federal probe relating to the former Soviet state of Azerbaijan and several U.S. businessmen\" for which a grand jury has been impaneled in Washington, D.C. Levine says, though, that it's \"unclear if Cuellar is a target\" of the grand jury's inquiry.",
    "CO-Gov: University of Colorado Regent Heidi Ganahl, who is the Republican frontrunner, actually ended 2021 with a $341,000 to $205,000 cash-on-hand lead over Democratic incumbent Jared Polis, but that edge will almost certainly disappear whenever the extremely wealthy governor decides to pour more of his own money into his bid.",
    "Candidates from each party can try to reach the primary in one of two ways: Either by winning the support of at least 30% of the delegates at their party's biennial convention (also known locally as an \"assembly\") or by collecting enough signatures to appear on the June ballot, regardless of what happens at the convention.",
    "GA-14: Jewish Insider has obtained a Republican primary survey from TargetPoint that it says was done for \"a group of Georgia Republicans who want to show that there is a viable, conservative alternative to\" the infamous Rep. Marjorie Taylor Greene, but it shows just how tough it would be to deny her renomination.",
    "MI-10: Politico reports that both the DCCC and Sen. Gary Peters are trying to recruit Sterling Heights Mayor Michael Taylor to run for the new and open 10th District, a suburban Detroit seat that would have backed Donald Trump by a narrow 50-49 spread, but local unions and other Democrats are wary of Taylor.",
    "CO-Sen: Construction company owner Joe O'Dea said Thursday that he planned to reach the June Republican primary ballot by collecting signatures, while one of his intra-party rivals, real estate developer Gino Campana, previously revealed that he'd go through the party's convention process instead.",
    "NV-SoS: Both parties are taking a serious interest in the race to succeed termed-out Secretary of State Barbara Cegavske, who was the only Nevada Republican to prevail statewide during the 2018 Democratic wave, and the GOP got a new candidate Friday when Reno-area developer Jesse Haw jumped in.",
    "Former state Rep. Aaron Lieberman took in about $1 million, put in $150,000 more of his own money, and had $765,000 on-hand; former homeland security official Marco López also raised $765,000 and self-funded another $235,000, but he had only about $255,000 left going into the new year.",
    "The former governor also echoed Flood's argument that Fortenberry's legal problems could jeopardize the GOP's chances against the Democrats, who are likely to nominate state Sen. Patty Pansing Brooks, in an eastern Nebraska constituency that would have supported Donald Trump 54-43.",
    "At the same time, to prevent the surrounding 2nd District from getting bluer, the map has sprawled westward to gobble up a wide swath of rural turf while the extremely conservative 1st District would extend a finger to the east to snatch up the liberal college town of Lawrence.",
    "However, there's still some bad blood between progressives and the mayor even though an unnamed \"Democratic operative familiar with his thinking\" tells Politico Taylor has become far more friendly to labor groups while in office and has abandoned his old anti-abortion views.",
    "Heineman in particular wasn't subtle when he laid out the case for why Republicans should fire the nine-term incumbent, saying, \"In modern political times in Nebraska, Jeff Fortenberry is the only Nebraska congressman that has ever been indicted on felony criminal charges.",
    "Donald Trump responded to the Politico story by not-tweeting, \"Rumors are that Doug Ducey, the weak RINO Governor from Arizona, is being pushed by Old Crow Mitch McConnell to run for the U.S. Senate … He will never have my endorsement or the support of MAGA Nation!\"",
    "MD-AG: Rep. Anthony Brown announced in late October that he had chosen to run for attorney general over seeking a fourth term in the House, and he's found himself in an expensive June Democratic primary against former Judge Katie Curran O'Malley, the wife of ex-Gov.",
    "NY-01: Republicans so far have had a pretty quiet race to succeed Rep. Lee Zeldin, who is leaving to seek the GOP nod for governor, but things are moving even though no one knows what this eastern Long Island constituency will look like following redistricting.",
    "Taylor went on to give Joe Biden a high-profile endorsement in 2020 out of disgust for what he called Trump's \"deranged\" tenure; he also backed Peters' successful re-election effort that year against James, who is now looking at running in the 10th himself.",
    "Marchant lost the 2020 race for the 4th Congressional District to Democratic Rep. Steven Horsford by a 51-46 margin, but he responded to that clear defeat by claiming he was the \"victim of election fraud\" and unsuccessfully suing to overturn that election.",
    "Dave Heineman\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "New Jersey's new congressional map dramatically changed the partisan makeup of this coastal South Jersey seat: While the old 3rd District supported Donald Trump by a narrow 49.4-49.2, the reconfigured constituency would have gone for Joe Biden 56-42.\n?",
    "The nature of the reported probe into Azeri activity is unknown, and Cuellar's alleged connection to the former Soviet republic on the Caspian Sea is similarly murky, though Rolling Stone's William Vaillancourt offers some helpful background details.",
    "Polis, who almost entirely self-funded his 2018 campaign, raised just $38,000 from donors during the last three months of the year (the Colorado Sun says the Democrat doesn't accept contributions larger than $200) and gave himself another $300,000.",
    "It remains to be seen if Haw will echo so many other GOP secretary of state candidates nationwide in advocating for the Big Lie, but there's no question where former Assemblyman Jim Marchant, who looks like his main foe in the June primary, stands.",
    "National and Arizona Republicans recently speculated to Politico that the governor will take on Democratic Sen. Mark Kelly despite his public lack of interest, but Ducey recently got a reminder of the kind of abuse a campaign would bring him.",
    "As Levine notes, Cuellar is a member of the Congressional Azerbaijan Caucus, a development that, as Vaillancourt points out, a Texas-based nonprofit called the Assembly of the Friends of Azerbaijan took credit for encouraging in 2013.",
    "RI-02: Multiple media outlets report that former state Democratic Party chair Ed Pacheco will announce a bid for this open seat in the coming week, while former state Sen. James Sheehan also says he's considering running himself.",
    "\"Today's announcement is particularly disappointing because I have counted these people as friends and you hope you can rely on your friends to stand by you when you face adversity like a false and unjust accusation,\" he wrote.",
    "AZ Redistricting: Arizona's Independent Redistricting Commission at last completed its work on Friday, following a chaotic meeting earlier in the week that was unexpectedly adjourned before any final votes could take place.",
    "That necessitated the panel reconvene in order to approve the state's new legislative map, which it did by a 3-2 vote, with the commission's tiebreaking member and two Republicans voting in favor and both Democrats against.",
    "Candidates can opt to try both methods, but doing so still doesn't offer a guarantee: If a contender takes less than 10% of the vote at the convention, then their campaign is over no matter how many signatures they turn in.",
    "Contenders who want to petition their way onto the ballot for U.S. Senate or governor must collect 1,500 valid signatures in each of Colorado's eight congressional districts from registered members of their political party.",
    "Suozzi's claims about Alvin Bragg, the borough's new district attorney, are a histrionic overreaction, but more to the point, in calling for his ouster, he's taken the side of all of the Republican candidates for governor.",
    "CNN further adds (again, based on an anonymous source) that the Department of Justice's Public Integrity unit, which investigates corruption allegations concerning elected officials, is \"involved with the investigation.\"",
    "Suozzi claims that \"the Manhattan DA is actually proposing to downgrade armed robbery to a misdemeanor and to stop prosecuting resisting arrest\" and declares, \"If any DA refuses to enforce the law, I'll remove them.\"",
    "Politico says the DCCC is also talking to former state Sen. Steve Bieda, Macomb County judge Carl Marlinga, and Warren Council member Angela Rogensues, though there's no word from any of them about their interest.",
    "That's because the mayor is a former Republican who supported Trump in 2016 and 2018 GOP Senate nominee John James and has previously both voiced anti-abortion views and supported legislation hostile to labor.",
    "That still gave him more money to spend than Donald Trump's endorsed candidates, former TV anchor-turned conspiracy theorist Kari Lake, who raised $1.5 million but held only $375,000 at the end of the year.",
    "The Nevada Independent writes that Haw, who was appointed to fill a vacant state Senate seat for a few months in 2016, is \"expected to bring at least half a million of dollars in campaign cash in the bank.\"",
    "If a voter signs petitions for multiple contenders, it only counts in favor of the first candidate to turn in their signatures, so there's a rush for everyone to submit—which introduces even more problems.",
    "Arballo abandoned his bid for that orphaned district, which has no proper successor to speak of, to instead focus on the 13th, a decidedly bluer seat to the north that doesn't overlap the old 22nd at all.",
    "NJ-03: Mount Holly school board member Will Monk has dropped out of the Republican primary to take on Democratic Rep. Andy Kim, which leaves yacht manufacturer Robert Healey as the only notable contender.",
    "Businesswoman Paola Tulliani Zen, who founded a biscotti company, attracted little attention when she launched her bid last year, but she self-funded $1.2 million and had about that much left to spend.",
    "The board had split the same way on the congressional map in its prior meeting, but on the advice of counsel, it held a re-vote given the abrupt adjournment, again yielding an identical 3-2 breakdown.",
    "Under the current lines, the 3rd, represented by Democratic Rep. Sharice Davids, went for Joe Biden 54-44 in 2020; the new version, however, would have voted for Biden by about a 51-47 margin instead.",
    "Cuellar was not a participant and only joined the Azerbaijan Caucus later that same year, but as Vaillancourt observes, \"the trip demonstrates how the nation has tried to influence American politics.\"",
    "Another Democrat, New Bedford Mayor Jon Mitchell, didn't rule out a bid last month, but he now seems far more interested in running to succeed gubernatorial candidate Maura Healey as attorney general.",
    "TX-35: Austin City Council member Greg Casar has released a new poll from Lake Research showing him with a wide lead in the March 1 Democratic primary for Texas' open (and safely blue) 35th District.",
    "SC Redistricting: South Carolina's Republican-run state Senate passed its version of a new congressional map on Thursday, but it differs somewhat from the map that the state House recently approved.",
    "The convention route is considerably cheaper and, because the contender with the most delegate support gets the top spot on the primary ballot, it offers another enticing advantage to candidates.",
    "The former assemblyman, who has repeatedly addressed QAnon gatherings, has also said that he would not have certified Joe Biden's victory in the state had he been secretary of state at the time.",
    "The survey later finds the incumbent's lead plunging to 45-44, but only after respondents are quizzed about her various antics and are provided information about the little-known Strahan.",
    "KS Redistricting: Kansas' GOP-run state Senate has passed a new congressional map with every Democrat and one Republican voting against (two Republicans and three Democrats were absent).",
    "That's a time-consuming undertaking that can become quite expensive, with consultants telling Colorado Politics that Senate candidates could spend close to $500,000 to make the ballot.",
    "On the Democratic side, former Athletic Commission member Cisco Aguilar is going up against former Assemblywoman Ellen Spiegel; Aguilar outraised Spiegel $485,000 to $36,000 last year.",
    "Taylor, who has said he's not affiliated with any party anymore, merely didn't rule out the idea of running as a Democrat when asked, though the story says he is considering the idea.",
    "The story adds that national Democrats are taking a look at some other people in addition to Taylor including attorney Huwaida Arraf, who is the only notable candidate currently in.",
    "They key question for Democrats is how the state House proceeds, and whether or not at least two Republicans will dissent—enough to allow them to sustain a veto by Democratic Gov.",
    "Government relations firm executive Anthony Figliola, who previously worked in Brookhaven's town government as a Democrat before switching parties, announced earlier this month.",
    "TX-28: A full day after Democratic Rep. Henry Cuellar's home and campaign headquarters were raided by the FBI, we finally got a hint as to what the investigation might be about.",
    "CA-13, CA-22 (special): Two of California's biggest political guns have come out for Democratic Assemblyman Adam Gray's bid for the newly open 13th District in recent days: Gov.",
    "Doug Ducey, who said over year ago that \"I'm not running for the United States Senate,\" was asked about his interest again on Thursday and replied, \"The answer hasn't changed.\"",
    "He's also responded to judges dismissing Trump supporters' many attempts to overturn his defeat by saying, \"A lot of judges were bought off too—they are part of this cabal.\"",
    "Even with this expanded electorate, though, Greene still fends off healthcare executive Jennifer Strahan 60-30; the poll did not ask about Greene's other two primary foes.",
    "Steve Gaynor, who was the 2018 nominee for secretary of state, raised less than $10,000 from donors but self-funded $5 million, and he had $4.7 million in the bank.",
    "One chamber will now either have to adopt the other's proposal, or the two sides will have to iron out their disagreements and reach a compromise on a single map.",
    "NY-Gov: Rep. Tom Suozzi, who trails badly in polls of the Democratic primary for governor, is using his first ad of the race to attack criminal justice reformers.",
    "A decade ago, a bitter dispute between the House and Senate almost led to redistricting getting punted to the courts, but tensions seem much lower this time.",
    "Unsurprisingly, candidates often sue-sometimes even successfully-if election authorities rule that they failed to turn in the requisite number of petitions.",
    "Board of Regents member Karrin Taylor Robson, meanwhile, raised $1.7 million, threw in almost $2 million more of her own money, and had $3 million on-hand.",
    "But Gray just got some company from financial advisor Phil Arballo, a fellow Democrat who'd been running in the special election for the old 22nd District.",
    "United StatesUnited States\nAttribution: Stephen Wolf / Daniel Donner\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "FL Redistricting: A subcommittee in Florida's Republican-run state House advanced a new map for its own districts in a largely party-line vote on Friday.",
    "AZ-Gov: Campaign finance reports are in for all the candidates ahead of the August primary, and there was one big surprise in the Republican contest.",
    "The survey finds Casar taking 48% of the vote, with state Rep. Eddie Rodriguez at 20 and former San Antonio City Councilwoman Rebecca Viagran at 14.",
    "Andy Beshear, who previously called it \"less egregious\" than the GOP's maps for Congress and the state House, both of which he vetoed on Thursday.",
    "OH-Sen: Wealthy businessman Mike Gibbons' newest spot for the May Republican primary features him blaming the Biden administration for inflation.",
    "(Hopefuls for other statewide office, such as attorney general, need 1,000 per district, while there are different requirements for other posts.)",
    "Redistricting\nStay on top of the map-making process in all 50 states by bookmarking our invaluable redistricting timeline tracker, updated daily.",
    "The GOP field also includes Sparks City Councilman Kristopher Dahir, former TV anchor Gerard Ramalh, and ex-District Court Judge Richard Scotti.",
    "The Lincoln Journal-Star interpreted this as a reference to Fortenberry's upcoming trial in Los Angeles, which is tentatively set for Feb. 15.",
    "The eventual nominee should have little trouble holding onto an office that the GOP last won in 1918 in a state that backed Joe Biden 65-32.",
    "State Sen. Anna Caballero previously didn't rule out a run, but on Friday, she announced she'd seek re-election to the legislature.",
    "Former Rep. Matt Salmon, who has not done a significant amount of self-funding, took in $1.2 million and had just $490,000 on-hand.",
    "The plan would make the 3rd District, the state's lone Democratic seat, considerably redder by carving up the Kansas City suburbs.",
    "Casar, a member of the Democratic Socialists of America, has sought to present himself as the most progressive option in the race.",
    "Brookhaven Town Councilman Neil Foley, meanwhile, says he's \"absolutely ready to run,\" while hedge fund head John Thaler is a no.",
    "FL-07: Retired Navy Captain Mac McGovern has joined the Republican primary to succeed retiring Democratic Rep. Stephanie Murphy.",
    "Fortenberry, notably, backed then-state Sen. Mike Foley over his \"friend\" Ricketts in the competitive 2014 primary for governor.",
    "CO-07: Jefferson County Commissioner Lesley Dahlkemper has announced that she won't seek the Democratic nod for this open seat.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Typically, the conventions take place about two to three months before the primary, and the GOP gathering is set for April 9.",
    "MA-Gov: U.S. Secretary of Labor Marty Walsh said Thursday that he would remain in the cabinet rather than run for governor.",
    "Ganahl, meanwhile, raised $271,000 and self-funded another $200,000, which put her well ahead of her intra-party opponents.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The commissioners then voted unanimously to transmit their final maps to the secretary of state, making them official.",
    "On the Democratic side, Secretary of State Katie Hobbs brought in close to $3 million and had $1.5 million to spend.",
    "He joins Navy veteran Robert Cornicelli, who launched in August but had a mere $80,000 on-hand at the end of 2021.",
    "Ricketts, meanwhile, declared, \"We need to make sure the 1st District gets the full-time attention it deserves.\"",
    "KY Redistricting: Kentucky's new state Senate map became law on Friday without a signature from Democratic Gov.",
    "Brown has outraised O'Malley by a small $647,000 to $626,000 margin, and they each have about $615,000 on-hand.",
    "This is an important decision in Colorado, and as we'll discuss, both options have big potential drawbacks.",
    "We'll have a full breakdown of the new districts, and what they mean for both parties, in the next Digest.",
    "NE-01: State Sen. Mike Flood on Friday unveiled endorsements from two prominent Nebraska Republicans, Gov.",
    "Ron DeSantis has sent signals he might reject a congressional map that recently passed the state Senate.",
    "Dave Heineman, in his campaign to deny indicted Rep. Jeff Fortenberry renomination in the May primary.",
    "However, party assemblies can be very unpredictable events, as the GOP found out in the 2016 race.",
    "AFAZ, as the group is known, found itself in the crosshairs of U.S. investigators not long after.",
    "Legislative maps are not subject to a gubernatorial veto—notable because Republican Gov.",
    "To make things even more complicated, voters can only sign one petition for each race.",
    "Prosecutor Andrew Janz, meanwhile, said Thursday that he would not enter the race.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "On the GOP side, state Sen. Jessica de la Cruz has publicly expressed interest.",
    "Still, two other wealthy Republicans ended the year with far larger war chests.",
    "Two other Democrats, however, are staying away from the battle for the 13th.",
    "The Grand Canyon State's candidate filing deadline isn't until early April.",
    "Those vetoes were immediately overturned by Republicans in the legislature.",
    "His actions have resulted in a dilemma for Nebraska's 1st District voters.\"",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Get the Daily Kos Elections Morning Digest over email\n Sign up!",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "State Sen. Mike Flood (center) being endorsed by Gov.",
    "This is a short blurb about Daily Kos.",
    "(No blurry videos this time, though.)",
    "Gavin Newsom and Sen. Alex Padilla.",
    "You may unsubscribe at any time.",
    "Hochul refuses to act, I will.\"",
    "Pete Ricketts and former Gov.",
    "Pete Ricketts and former Gov.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Here's our privacy policy.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "AZ-Sen: Republican Gov.",
    "He concludes, \"If Gov.",
    "Secretaries of State\n?",
    "Attorneys General\n?",
    "Martin O'Malley.",
    "Please read it.",
    "Leading Off\n?",
    "Laura Kelly.",
    "Governors\n?",
    "Senate\n?",
    "Sign up!",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}