[
  {
    "id": 831,
    "mediaId": 63,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "A request from the committee to view Trump Administration documents awaits a Supreme Court ruling after Trump sued to block their release, and Trump has often derided the group as the Unselect Committee? and questioned the intentions of the two Republicans on the panel, Reps. <span class='selected-term'>Liz Cheney</span> (Wy.)",
    "author": "Derek Saul",
    "title": "Trump Calls Off Press Conference On Capitol Attack Anniversary"
  },
  {
    "id": 815,
    "mediaId": 165,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Pro-democracy Republicans like Reps. Adam Kinzinger and <span class='selected-term'>Liz Cheney</span> have become pariahs, censured and shunned and attacked for daring to refute the Big Lie and hold Trump accountable for helping foment the unrest that led to the Jan. 6 attack.",
    "author": "Andy Kroll",
    "title": "They Helped Save Democracy  and Are Being Tormented for It"
  },
  {
    "id": 792,
    "mediaId": 112,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "Associated Press",
    "title": "Sen. Thune of South Dakota, the No. 2 Republican, says he'll seek 4th term"
  },
  {
    "id": 773,
    "mediaId": 238,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Indeed, this is the context for understanding McCarthy's new endorsement of the primary challenger to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: Susan Collins tries to Trump proof' the 2024 election  behind Trump's back"
  },
  {
    "id": 746,
    "mediaId": 238,
    "date": "1/22/2022 12:00:00 AM",
    "sentence": "), and Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Arizona Democratic Party votes to censure Sinema, citing filibuster vote"
  },
  {
    "id": 605,
    "mediaId": 409,
    "date": "2/5/2022 12:00:00 AM",
    "sentence": "The Republican National Committee has voted to formally censure <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for actions in their positions as members of the January 6th Select Committee not befitting Republican members of Congress.? This is both morally repellent and politically self-destructive.",
    "author": "The Editors",
    "title": "RNC Should Take a Lesson from Mike Pence"
  },
  {
    "id": 571,
    "mediaId": 441,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "After the Republican National Committee censured Representatives <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger and claimed that the Jan. 6 committee they're serving on is persecuting people for legitimate political discourse,? several Republican senators were quick to criticize their own party's leadership.",
    "author": "Jonathan Bernstein",
    "title": "What Can Anti-Trump Republicans Actually Do?"
  },
  {
    "id": 535,
    "mediaId": 21,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who has now been censured by state party officials and the Republican National Committee, is running for reelection against Trump pick Harriet Hageman.",
    "author": "Warren Rojas",
    "title": "Trump is on an endorsement spree and has now put his MAGA stamp on more than 100 political candidates since leaving the White House"
  },
  {
    "id": 499,
    "mediaId": 234,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "As Vanity Fair reported last month, Thiel hosted a January fundraiser at his Miami compound for Wyoming Republican Harriet Hageman, the Trumpbacked candidate running a primary challenge against <span class='selected-term'>Liz Cheney</span> after Cheney refused to endorse Trump's big lie? and voted to impeach him.",
    "author": "Caleb Ecarma",
    "title": "Peter Thiel Is MAGA's Big Money Man"
  },
  {
    "id": 491,
    "mediaId": 25,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "The Republican National Committee censured the two Republicans on that committee, Representatives <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, earlier in February.",
    "author": "Adam Brewster",
    "title": "Senator Rick Scott says he will \"absolutely\" vote for McConnell to be leader"
  },
  {
    "id": 391,
    "mediaId": 25,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n What to watch for in Texas' primary elections\n Trump's response to Putin's invasion of Ukraine reveals GOP fissures\n Democrats seize on GOP Senator Rick Scott's plan to tax more Americans\n Congressman Colin Allred discusses Democrats' midterm prospects\n Kevin McCarthy backs <span class='selected-term'>Liz Cheney</span>'s primary challenger Harriet Hageman\n More\n Caitlin Huey-Burns\nCaitlin Huey-Burns is a political reporter for CBS News.",
    "author": "",
    "title": "Biden's low approvals worry Democrats campaigning in midterm elections"
  },
  {
    "id": 376,
    "mediaId": 33,
    "date": "3/6/2022 12:00:00 AM",
    "sentence": "He was then censured by the House and stripped of his committee assignments, but only two Republicans -- Illinois Rep. Adam Kinzinger and Wyoming Rep. <span class='selected-term'>Liz Cheney</span> -- voted to censure Gosar for promoting violence.",
    "author": "Andrew Kaczynski",
    "title": "Rep. Paul Gosar's lengthy ties to White nationalists, pro-Nazi blogger and far-right fringe received little pushback for years"
  },
  {
    "id": 371,
    "mediaId": 195,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "There's one person in particular that I can think of that has their own lane and has said that they will not support Trump in 2024, and that's <span class='selected-term'>Liz Cheney</span>,? he added.",
    "author": "Brett Samuels",
    "title": "Barr becomes latest former ally to escalate feud with Trump"
  },
  {
    "id": 360,
    "mediaId": 237,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "He's endorsing earlier and trying to oust at least 10 members of his party from the federal government, such as Wyoming Rep. <span class='selected-term'>Liz Cheney</span> and Alaska Sen. Lisa Murkowski.",
    "author": "Virginia Aabram",
    "title": "Has Trump's seal lost its appeal?"
  },
  {
    "id": 311,
    "mediaId": 129,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "And then there's a primary this summer in Wyoming, where <span class='selected-term'>Liz Cheney</span> is fighting to keep her House seat .",
    "author": "",
    "title": "It's Never a Good Time for the Hunter Biden Story"
  },
  {
    "id": 295,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "\"A leader with honor would be rejecting -- not protecting -- the pro-Putin, anti-Semitic, white nationalist members of the party, instead of fighting against <span class='selected-term'>Liz Cheney</span> for telling the truth,\" Jeremy Adler, Cheney's spokesman, said in a statement to CNN.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  },
  {
    "id": 159,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Listen for yourself\nWhat happens on the tape: McCarthy essentially conspires with Rep. <span class='selected-term'>LIZ CHENEY</span> (R-Wyo.)",
    "author": "POLITICO Playbook: Is Kevin McCarthy toast?\nBy",
    "title": "POLITICO Playbook: Is Kevin McCarthy toast?"
  }
]