[
  {
    "id": 850,
    "mediaId": 223,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "The other shows featured members from the select committee on January 6, including Reps. Adam Schiff (D-CA), <span class='selected-term'>Liz Cheney</span> (R-WY), and Bennie Thompson (D-MS).",
    "author": "Rebecca Downs",
    "title": "Sunday Shows Were Hyperfocused on Reminding Everyone About January 6"
  },
  {
    "id": 854,
    "mediaId": 43,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/LD0nMmJofP\n The Hill (@thehill) January 2, 2022\nx\nJan. 6 panel chair says \"significant testimony\" shows White House \"had been told to do something\" https://t.co/3yriFIuQDW pic.twitter.com/oFhvo1mQDx\n The Hill (@thehill) January 2, 2022\nREPUBLICAN REP. <span class='selected-term'>LIZ CHENEY</span>\nx\n.",
    "author": "",
    "title": "BIDEN---DAY347---Evening"
  },
  {
    "id": 845,
    "mediaId": 33,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Vice Chair <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican, told ABC News of \"firsthand testimony\" that Trump's daughter Ivanka, then a West Wing adviser, twice asked him to intervene in a melee in which police officers were beaten by his crowd.",
    "author": "Stephen Collinson",
    "title": "January 6 committee gets inside Trump's West Wing wall of obstruction"
  },
  {
    "id": 835,
    "mediaId": 33,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Committee Vice Chair <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican, revealed that there was \"firsthand\" testimony that Trump's daughter Ivanka, then a White House official, twice asked her father to call off the rioters.",
    "author": "Stephen Collinson",
    "title": "Call for Pence cooperation shows ambition of January 6 panel ahead of anniversary"
  },
  {
    "id": 804,
    "mediaId": 65,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Asked a month ago during a stop in New Hampshire whether he'll cooperate with the committee, Pence told Fox News and The Associated Press that \"we'll evaluate any of those requests as they come\"\nRep. <span class='selected-term'>Liz Cheney</span> of Wyoming, a vocal anti-Trump Republican and one of only two GOP representatives on the committee, told NBC News on Thursday: \"We look forward to continuing the cooperation that we've had with members of the former vice president's team, and I look forward as well to his cooperation.\"",
    "author": "Paul Steinhauser",
    "title": "Former Vice President Pence quiet on one-year mark of Capitol attack"
  },
  {
    "id": 731,
    "mediaId": 223,
    "date": "1/26/2022 12:00:00 AM",
    "sentence": "Riggleman is listed as a sponsor of a fundraiser for Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), despite how he works as an advisor for the January 6 select committee, where Cheney serves as vice chair.",
    "author": "Rebecca Downs",
    "title": "Former Rep. Hosting Fundraiser for Liz Cheney, Even Though He Works for Jan. 6 Select Committee"
  },
  {
    "id": 496,
    "mediaId": 409,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "This is the third and final column in a three-column series on the House Select January 6 Committee, prompted by the Republican National Committee's censure of <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, the House committee's two GOP members, and Senate minority leader Mitch McConnell's rebuke of the censure resolution.",
    "author": "Andrew C. McCarthy",
    "title": "Fix the January 6 Committee"
  },
  {
    "id": 440,
    "mediaId": 21,
    "date": "2/19/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump is pushing Wyoming lawmakers to back legislation that would bar Democrats and other non-Republicans from casting ballots in statewide GOP primaries, in a move widely seen as a way to sink Rep. <span class='selected-term'>Liz Cheney</span>'s prospects for renomination by the party.",
    "author": "John L. Dorman",
    "title": "Trump wants Wyoming lawmakers to change their election laws to block Liz Cheney from receiving crossover votes in the state's GOP primary"
  },
  {
    "id": 430,
    "mediaId": 43,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "In a statement following the committee's request to the GOP leader, McCarthy said: As a representative and the leader of the minority party, it is with neither regret nor satisfaction that I have concluded to not participate with this select committee's abuse of power that stains this institution today and will harm it going forward.?\nMcCarthy has dodged questions around Jan. 6 from reporters, even running away from one during an exchange this February in the Capitol after the Republican National Committee agreed to censure the probe's only Republican members: Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "",
    "title": "Who's who: A rolling guide to the targets of the Jan. 6 committee"
  },
  {
    "id": 266,
    "mediaId": 19,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "Speaker of the House Nancy Pelosi (D-CA) took the unprecedented step of rejecting House Minority Leader Kevin McCarthy's recommended list of Republican participants, and appointed only two Republicans  Reps. <span class='selected-term'>Liz Cheney</span> (R-WY) and Adam Kinzinger (R-IL)  alongside seven Democrats.",
    "author": "Joel B. Pollak",
    "title": "Contempt Charge Against Dan Scavino Based on False Claims by January 6 Committee"
  },
  {
    "id": 111,
    "mediaId": 151,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "and Vice Chair <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Jan. 6 committee asks three pro-Trump GOP lawmakers for testimony"
  }
]