[
  {
    "id": 834,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "critics, such as Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, who was purged from House leadership for refusing, in her words, to spread his destructive lies? about 2020.",
    "author": "",
    "title": "A Year After Capitol Riot, Trump's Hold on G.O.P. Is Unrivaled"
  },
  {
    "id": 807,
    "mediaId": 195,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "And I was happy to welcome him back, and to congratulate him on the courage of <span class='selected-term'>Liz Cheney</span>.",
    "author": "Rebecca Beitsch",
    "title": "Dick Cheney visits Capitol for Jan. 6, criticizes GOP leadership"
  },
  {
    "id": 80,
    "mediaId": 124,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Rep. Cheney showed great deal of moral courage' on Jan. 6, says Rep. Sherrill\nJan. 6, 202201:17\n\"It's appropriate to point out one person who I think has shown a great deal of moral courage, someone who stood up for her country at great personal cost, and that is <span class='selected-term'>Liz Cheney</span>,\" Sherrill said of the Wyoming congresswoman who is one of two Republicans serving on the House committee investigating the Capitol attack.",
    "author": "",
    "title": "Jan. 6 Capitol riot: Full anniversary coverage"
  },
  {
    "id": 799,
    "mediaId": 12,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Indeed, during a moment of silence held in honor of law enforcement officers, only two Republicans were present in the House chamber: Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who has become a pariah in her party over her criticism of Trump's actions, and her father, former Vice President Dick Cheney.",
    "author": "JILL COLVIN",
    "title": "Top Republicans mark Jan. 6 with silence, deflection"
  },
  {
    "id": 7029,
    "mediaId": 32,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "The Republican National Committee, in censuring GOP Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for participating in the House probe, approved a resolution that appeared to describe the events of Jan. 6 as legitimate political discourse.? RNC Chairwoman Ronna McDaniel later sought to clarify that that language applied not to the violent Trump supporters who attacked Capitol police officers, but rather to the GOP activists who purported to be alternate electors.?\nFederal prosecutors are reviewing those fake certifications, a senior Biden administration Department of Justice official told CNN last month.",
    "author": "Kevin Breuninger",
    "title": "House probe of Jan. 6 Capitol riot subpoenas Arizona GOP leader Kelli Ward, 5 others over alternate electors"
  },
  {
    "id": 3127,
    "mediaId": 195,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "The <span class='selected-term'>Liz Cheney</span>'s of the world, we got to get rid of them,? Trump said at the rally.",
    "author": "Olafimihan Oshin",
    "title": "Audio: Graham knocked Trump in wake of Jan. 6 attack"
  },
  {
    "id": 3355,
    "mediaId": 238,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "The other member, Republican Vice Chair <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "Josh Dawsey",
    "title": "Inside the Jan. 6 committee, key questions remain as hearings loom"
  }
]