[
  {
    "id": 745,
    "mediaId": 19,
    "date": "1/23/2022 12:00:00 AM",
    "sentence": "Wyoming Republican Harriet Hageman, endorsed by former President Donald Trump, showed a commanding lead against the Democrat-allied Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) in a Saturday straw poll full of House candidates held by the Wyoming Republican State Central Committee.",
    "author": "Jacob Bliss",
    "title": "Liz Cheney Loses Wyoming Straw Poll to Trump-Backed Harriet Hageman"
  },
  {
    "id": 551,
    "mediaId": 129,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "We don't agree with what <span class='selected-term'>Liz Cheney</span> is doing.?\nMs. Hageman said she didn't know who the legitimate winner of the 2020 election was (I don't know the answer?) and couldn't say if former Vice President Mike Pence had the authority to block congressional certification of President Biden's election (I'm not an elections attorney?).",
    "author": "",
    "title": "Where's Liz Cheney? The Wyoming Republican's Exile From Wyoming Republicans"
  },
  {
    "id": 109,
    "mediaId": 65,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming sits high atop Donald Trump's list of GOP enemies.",
    "author": "Paul Steinhauser",
    "title": "Trump to target Cheney at May 28 rally in Wyoming"
  },
  {
    "id": 110,
    "mediaId": 195,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Harriet has my Complete and Total Endorsement in replacing the Democrats number one provider of sound bites, <span class='selected-term'>Liz Cheney</span>,? Trump said in September, using an acronym for Republican in name only.?\nCheney has boasted strong fundraising throughout her campaign, hauling in $2.94 million in the first quarter of 2022, and hails from a famous political family with deep ties to Wyoming.",
    "author": "Tal Axelrod",
    "title": "Trump to rally for Cheney challenger in Wyoming"
  },
  {
    "id": 114,
    "mediaId": 19,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Harriet has my Complete and Total Endorsement in replacing the Democrats' number one provider of sound bites, <span class='selected-term'>Liz Cheney</span>,? Trump wrote at the time.",
    "author": "Charlie Spiering",
    "title": "Donald Trump Announces Rally with Liz Cheney Challenger Harriet Hageman in Casper, Wyoming"
  }
]