[
  {
    "id": 470,
    "mediaId": 21,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "He can largely ruin a Republican's standing within his or her own party  just ask Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois.",
    "author": "Kimberly Leonard",
    "title": "A Trump-free 2024 race would trigger Republican chaos: 'Everybody is running.'"
  },
  {
    "id": 371,
    "mediaId": 195,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "There's one person in particular that I can think of that has their own lane and has said that they will not support Trump in 2024, and that's <span class='selected-term'>Liz Cheney</span>,? he added.",
    "author": "Brett Samuels",
    "title": "Barr becomes latest former ally to escalate feud with Trump"
  },
  {
    "id": 364,
    "mediaId": 409,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "Somebody such as Larry Hogan or <span class='selected-term'>Liz Cheney</span> might enter the race and face the same problem.",
    "author": "Dan McLaughlin",
    "title": "Is Mike Pence Preparing a Kamikaze Campaign?"
  },
  {
    "id": 218,
    "mediaId": 21,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Christie responded: \"Whatever it is, it wasn't like she was looking to protect her position, and the first time that Republicans inside that caucus had a chance to vote on <span class='selected-term'>Liz Cheney</span> they voted the keep her  overwhelmingly.\"",
    "author": "John L. Dorman",
    "title": "Chris Christie says Liz Cheney 'wanted to be kicked out' of House Republican leadership"
  },
  {
    "id": 219,
    "mediaId": 223,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Host Jonathan Karl offered that Cheney \"says the point she's making is to defend the Constitution of the United States,\" prompting Christie to respond \"look, whatever it is, it wasn't like she was looking to protect her position and the first time that Republicans inside that caucus had a chance to vote on <span class='selected-term'>Liz Cheney</span>, they voted to keep her, overwhelmingly.\"",
    "author": "Rebecca Downs",
    "title": "Chris Christie Has a Theory About Liz Cheney"
  },
  {
    "id": 107,
    "mediaId": 25,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "That group, united by criticism of Trump and their ties to traditional Republican politics, includes New Hampshire Governor Chris Sununu and Wyoming Congresswoman <span class='selected-term'>Liz Cheney</span>, who is vice chair of the House select committee investigating the attack on the Capitol.",
    "author": "Robert Costa",
    "title": "Hogan says Trump should not run in 2024 and GOP should \"move on,\" resist \"cheap impersonation\""
  }
]