[
  {
    "id": 715,
    "mediaId": 65,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "That certain Republicans like, you know, <span class='selected-term'>Liz Cheney</span> or Adam Kinzinger, you know, they are not quite in the mainstream, but I've never heard people call the names that they are calling --\nTURNER: Yes.",
    "author": "Fox News Staff",
    "title": "'The Five' on struggles facing Democrats ahead of midterm elections"
  },
  {
    "id": 654,
    "mediaId": 33,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Salt Lake City (CNN)In a resolution formally censuring GOP Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, the Republican National Committee on Friday described the events surrounding the January 6, 2021 insurrection -- which have been at the center of a House probe -- as \"legitimate political discourse.\"",
    "author": "Gabby Orr",
    "title": "In censure of Cheney and Kinzinger, RNC calls events of January 6 'legitimate political discourse'"
  },
  {
    "id": 592,
    "mediaId": 157,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "Addressing the RNC's censure vote on Reps. Adam Kinzinger (R-IL) and <span class='selected-term'>Liz Cheney</span> (R-WY), she added, \"They passed a resolution essentially calling January 6th 'legitimate political discourse.'",
    "author": "Tom Boggioni",
    "title": "A lot of Republicans 'want out of the Trump situation': CNN analyst"
  },
  {
    "id": 450,
    "mediaId": 65,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "Continue reading \nWEGMAN EARNS NOD - House Minority Leader Kevin McCarthy is endorsing Harriet Hageman in her Wyoming primary challenge to Rep. <span class='selected-term'>Liz Cheney</span>, a rare move by a sitting party leader to back an attempt to unseat one of his members.",
    "author": "Jack Durschlag",
    "title": "California's 'endemic' approach"
  },
  {
    "id": 358,
    "mediaId": 157,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Barr would not specify which Republican candidates he would get behind, although he told Tapper that he didn't believe Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) had any shot at actually getting the nomination.",
    "author": "Brad Reed",
    "title": "Bill Barr tells CNN he'll get involved in GOP primary to prevent Trump from winning nomination"
  },
  {
    "id": 139,
    "mediaId": 233,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Fox's Sean Hannity and Meadows had been texting since Election Day\nEarlier this year Rep. <span class='selected-term'>Liz Cheney</span> read text messages between Meadows and several Fox News hosts during the Jan. 6 Capitol riot, including Sean Hannity.",
    "author": "Bart Jansen",
    "title": "Marjorie Taylor Greene said some lawmakers talked martial law after Jan. 6, according to texts released by CNN"
  }
]