[
  {
    "id": 859,
    "mediaId": 195,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "Wyoming's At-Large Congressional District\nWyoming's at-large House seat, currently held by Rep. <span class='selected-term'>Liz Cheney</span> (R), is in safe Republican hands.",
    "author": "Tal Axelrod",
    "title": "Eleven interesting races to watch in 2022"
  },
  {
    "id": 773,
    "mediaId": 238,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Indeed, this is the context for understanding McCarthy's new endorsement of the primary challenger to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: Susan Collins tries to Trump proof' the 2024 election  behind Trump's back"
  },
  {
    "id": 711,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Too bad Republicans missed their opportunity to convict Trump and do away with him forever or, as GOP Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming put it, \"made themselves willing hostages\" to a man who just fessed up to trying to stage a coup.",
    "author": "",
    "title": "Trump's endorsement ad of David Perdue is perfectly divisive and comically awful"
  },
  {
    "id": 66,
    "mediaId": 238,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Even Harriet Hageman, Trump's favorite to take out Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, brought in only $443,000.",
    "author": "",
    "title": "Opinion: Trump-endorsed candidates are having trouble fundraising. That's a bad sign for the former president."
  },
  {
    "id": 586,
    "mediaId": 151,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "The RNC censured Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger and deemed Jan. 6 legitimate political discourse.?\nFor all the energy he creates at the party's grassroots,? Trump's stranglehold on the party is emerging as one of the biggest threats to the GOP's otherwise bright prospects in November,? David and Natalie wrote.",
    "author": "",
    "title": "Mask wars claim another pol"
  },
  {
    "id": 576,
    "mediaId": 1343,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Finally, until lately, the only high profile opponent to Trumpat least rhetoricallywas Rep. <span class='selected-term'>Liz Cheney</span>, who has been adamant in opposition to the Big Lie and is getting tons of air time as she announces the work of the select committee investigating January 6.",
    "author": "Elaine Kamarck",
    "title": "Is Trump's hold on the Republican Party getting weaker?"
  },
  {
    "id": 543,
    "mediaId": 238,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "He did nothing to fight for his constituents and stop the most fraudulent election in American history.?\nTrump's statement, in which he continued to repeat false claims about election fraud, came a day after McConnell became the highest-ranking Republican elected official to criticize the RNC for the resolution censuring Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Trump attacks McConnell after he criticizes RNC censure of two House Republicans probing Jan. 6 insurrection"
  },
  {
    "id": 493,
    "mediaId": 195,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "The rift within the GOP was on full display earlier this month when the Republican National Committee (RNC) voted to censure Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Max Greenwood",
    "title": "No 'mass exodus,' but GOP sees Trump grip loosening"
  },
  {
    "id": 491,
    "mediaId": 25,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "The Republican National Committee censured the two Republicans on that committee, Representatives <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, earlier in February.",
    "author": "Adam Brewster",
    "title": "Senator Rick Scott says he will \"absolutely\" vote for McConnell to be leader"
  },
  {
    "id": 301,
    "mediaId": 63,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Polling suggests Trump-endorsed Republican Harriet Hageman leads Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Nicholas Reimann",
    "title": "Trump Rescinds Support For BrooksLatest Mishap In His Bid To Control Midterms"
  },
  {
    "id": 280,
    "mediaId": 1576,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Meanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 269,
    "mediaId": 65,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "TRUMP RETURNING TO GEORGIA TO CAMPAIGN WITH DAVID PERDUE, HERSCHEL WALKER\nMeanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 258,
    "mediaId": 237,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "In Wyoming, a ruby red, rural state that delivered nearly 70% of its vote to Trump in 2020, the former president can claim some momentum in his bid to oust Republican Rep. <span class='selected-term'>Liz Cheney</span>.",
    "author": "David M. Drucker",
    "title": "Trump's GOP stranglehold faces major test in four primary battles"
  },
  {
    "id": 193,
    "mediaId": 237,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "It's possible he will turn his focus to the Wyoming House race next, where Rep. <span class='selected-term'>Liz Cheney</span>, one of the former president's harshest critics within the GOP, is facing off against Trump-endorsed Harriet Hageman.",
    "author": "Cami Mondeaux",
    "title": "Trump invests $500,000 in bid to unseat Georgia Gov. Kemp: Report"
  },
  {
    "id": 194,
    "mediaId": 151,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "It is unclear where else Save America PAC will make significant investments, though Trump advisers say another top priority is unseating Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, a high-profile Trump nemesis.",
    "author": "",
    "title": "Trump pours money into a midterm race for the first time"
  },
  {
    "id": 196,
    "mediaId": 25,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Trump PAC gives $500K to group to defeat Georgia's GOP governor\n Pence decries cancel culture amid protests, praises Zelenskyy at University of Virginia\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n More\nIn:\nGeorgia\nDonald Trump\n Fin Gmez\nFin Gmez is a CBS News White House producer.",
    "author": "Fin Gómez",
    "title": "Trump's political committee gives $500,000 to group aiming to defeat Georgia's GOP governor"
  },
  {
    "id": 198,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "Outside of Georgia, another top priority? target of Trump's whom the former president is expected to direct big dollars toward unseating is Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), Politico noted.",
    "author": "Ashley Oliver",
    "title": "Trump's First Major Midterm Donation Aims to Unseat Brian Kemp in Georgia"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 154,
    "mediaId": 238,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "In the phone call with Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "Why Trump might give McCarthy a pass on Jan. 6"
  },
  {
    "id": 141,
    "mediaId": 163,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "One thing is certain: Trump will make the final decisions and will surely spend money to defeat Republicans like <span class='selected-term'>Liz Cheney</span> who voted to impeach him following the Jan. 6, 2020 assault by his supporters on the U.S. Capitol, the sources said.",
    "author": "Alexandra Ulmer",
    "title": "Exclusive: Trump weighs how deeply to dig into his war chest for midterms"
  },
  {
    "id": 143,
    "mediaId": 593,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "One thing is certain: Trump will make the final decisions and will surely spend money to defeat Republicans like <span class='selected-term'>Liz Cheney</span> who voted to impeach him following the Jan. 6, 2020 assault by his supporters on the U.S. Capitol, the sources said.",
    "author": "Jarrett Renshaw and Alexandra Ulmer",
    "title": "Exclusive-Trump Weighs How Deeply To Dig Into His War Chest For November Elections"
  },
  {
    "id": 127,
    "mediaId": 238,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Behind Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "May: The month that will decide Trump's kingmaker status"
  },
  {
    "id": 105,
    "mediaId": 223,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "And, in the GOP House primary race in Wyoming, he has backed attorney Harriet Hageman over Rep. <span class='selected-term'>Liz Cheney</span>, the most prominent Republican in Congress to vote for Trump's second impeachment.",
    "author": "Salena Zito",
    "title": "Why Georgia Gov. Kemp Tops the Polls Despite Trump's Bid to Take Him Down"
  },
  {
    "id": 89,
    "mediaId": 195,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "And perhaps most prominently in Wyoming, Rep. <span class='selected-term'>Liz Cheney</span> (R) is in the fight for her political life in a primary against Trump-backed attorney Harriet Hageman later in August.",
    "author": "Tal Axelrod",
    "title": "Pro-Trump candidates look to harness populist energy after Ohio"
  }
]