[
  {
    "id": 845,
    "mediaId": 33,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Vice Chair <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican, told ABC News of \"firsthand testimony\" that Trump's daughter Ivanka, then a West Wing adviser, twice asked him to intervene in a melee in which police officers were beaten by his crowd.",
    "author": "Stephen Collinson",
    "title": "January 6 committee gets inside Trump's West Wing wall of obstruction"
  },
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "And Rep. <span class='selected-term'>Liz Cheney</span>, the Republican vice-chair of the House Select Committee probing the January 6 insurrection, will face Trump-backed Harriet Hageman in Wyoming's at-large House seat.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP"
  },
  {
    "id": 806,
    "mediaId": 169,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "It would have been an odd scene just a few years ago: Congressional Democrats lining up to greet and exchange kind words with former vice president Dick Cheney, who along with his daughter, Rep. <span class='selected-term'>Liz Cheney</span>, were the only two Republican members present for an event held at the U.S. Capitol Thursday to commemorate the attempted Jan. 6 insurrection.",
    "author": "Brett Bachman",
    "title": "Democrats embrace Dick Cheney during Jan. 6 remembrance event"
  },
  {
    "id": 807,
    "mediaId": 195,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "And I was happy to welcome him back, and to congratulate him on the courage of <span class='selected-term'>Liz Cheney</span>.",
    "author": "Rebecca Beitsch",
    "title": "Dick Cheney visits Capitol for Jan. 6, criticizes GOP leadership"
  },
  {
    "id": 810,
    "mediaId": 187,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Trump has endorsed a series of primary challengers to Republicans who resisted his false claims in 2020, including Representative <span class='selected-term'>Liz Cheney</span> in Wyoming and Georgia's Brian Kemp and Brad Raffensperger, the governor and secretary of state, respectively.",
    "author": "Ronald Brownstein",
    "title": "It's Time for Democrats to Break the Glass"
  },
  {
    "id": 811,
    "mediaId": 193,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Instead, she said, there were people defending the insurrectionists and defending Trump and continuing with the challenge and the Big Lie.?\nRep. Adam Kinzinger of Illinois, a Republican who, with Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, has emerged as one of the few GOP anti-Trump critics in Congress, had predicted Trump's hold on the party would be gone? by the summer.",
    "author": "Jill Colvin",
    "title": "Trump maintains grip on GOP despite violent insurrection"
  },
  {
    "id": 821,
    "mediaId": 178,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Rep. Adam Kinzinger of Illinois, a Republican who, with Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, has emerged as one of the few GOP anti-Trump critics in Congress, had predicted Trump's hold on the party would \"be gone\" by the summer.",
    "author": "JILL COLVIN Associated Press",
    "title": "A year after Capitol riot, Trump maintains grip on GOP"
  },
  {
    "id": 793,
    "mediaId": 32,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "",
    "title": "GOP Sen. John Thune of South Dakota says he'll seek a fourth term"
  },
  {
    "id": 795,
    "mediaId": 178,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "STEPHEN GROVES",
    "title": "GOP Sen. John Thune of South Dakota says he'll seek 4th term"
  },
  {
    "id": 779,
    "mediaId": 65,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Yesterday, Tom Friedman wrote a piece calling on Joe Biden to replace Kamala Harris with <span class='selected-term'>Liz Cheney</span> in the next election.",
    "author": "Tucker Carlson",
    "title": "Tucker Carlson: Hillary Clinton isn't old news, she may be the future for Democrats"
  },
  {
    "id": 766,
    "mediaId": 195,
    "date": "1/16/2022 12:00:00 AM",
    "sentence": "In the past week alone, New York Times columnist Thomas Friedman held out the possibility of anti-Trump Republican Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "Niall Stanage",
    "title": "The Memo: 2024 chatter reveals Democratic nervousness"
  },
  {
    "id": 763,
    "mediaId": 195,
    "date": "1/17/2022 12:00:00 AM",
    "sentence": "Ideas such as a third Hillary Clinton candidacy or adding Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - Presented by Facebook - Democrats see victory in a voting rights defeat"
  },
  {
    "id": 764,
    "mediaId": 223,
    "date": "1/17/2022 12:00:00 AM",
    "sentence": "SO WE THOUGHT you'd help us give <span class='selected-term'>Liz Cheney</span> the support she needs to see the investigation through.?\nAre these left-wing groups really raising money to help reelect Liz Cheney?",
    "author": "Derek Hunter",
    "title": "Democrats Claim Liz Cheney As One Of Their Own; They Can Have Her"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>\nWyoming's lone representative voted with Trump's position an estimated 93% of the time while he was in office, but she became a vocal critic of his actions leading up to and during the Jan. 6 riot and his efforts to overturn the results of the 2020 presidential election.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 758,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "He first earned the MAGA crowd's ire in January 2021 when he defended Rep. <span class='selected-term'>Liz Cheney</span>, disliked by pro-Trump elements for her strident opposition to the former president.",
    "author": "Moshe Hill",
    "title": "Republicans need Dan Crenshaw"
  },
  {
    "id": 756,
    "mediaId": 19,
    "date": "1/19/2022 12:00:00 AM",
    "sentence": "(Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) claims she is playing that role.)",
    "author": "Joel B. Pollak",
    "title": "January 6 Committee Subpoenas Phone Records of Eric Trump, Kimberly Guilfoyle; Trump Lawyers, Too"
  },
  {
    "id": 746,
    "mediaId": 238,
    "date": "1/22/2022 12:00:00 AM",
    "sentence": "), and Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Arizona Democratic Party votes to censure Sinema, citing filibuster vote"
  },
  {
    "id": 745,
    "mediaId": 19,
    "date": "1/23/2022 12:00:00 AM",
    "sentence": "Wyoming Republican Harriet Hageman, endorsed by former President Donald Trump, showed a commanding lead against the Democrat-allied Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) in a Saturday straw poll full of House candidates held by the Wyoming Republican State Central Committee.",
    "author": "Jacob Bliss",
    "title": "Liz Cheney Loses Wyoming Straw Poll to Trump-Backed Harriet Hageman"
  },
  {
    "id": 738,
    "mediaId": 195,
    "date": "1/24/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wy.)",
    "author": "Dominick Mastrangelo",
    "title": "Cheney hits Gingrich for saying Jan. 6 panel members may be jailed"
  },
  {
    "id": 728,
    "mediaId": 65,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "The obstinance of these two moderate lawmakers has drawn comparisons to Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger who also exist at odds with the powers that be in the Republican Party.",
    "author": "David Marcus",
    "title": "Democrats throw Manchin, Sinema under the bus and court electoral disaster"
  },
  {
    "id": 729,
    "mediaId": 19,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Venture capitalist and Republican megadonor Peter Thiel on Wednesday hosted a fundraiser for Democrat-allied Rep. <span class='selected-term'>Liz Cheney</span>'s (R-WV) primary opponent, Harriet Hageman.",
    "author": "Wendell Husebø",
    "title": "Big Money Donor Peter Thiel Hosts Fundraiser for Liz Cheney's Primary Opponent, Harriet Hageman"
  },
  {
    "id": 70,
    "mediaId": 881,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Trump antagonist and Wyoming Rep. <span class='selected-term'>Liz Cheney</span> hauled in $2 million in the last three months, a massive haul for a House race in an off-year election, and has $4.7 million in the bank.",
    "author": "Cameron Joseph",
    "title": "Trump's Favorite Candidates Are Getting Crushed in Fundraising"
  },
  {
    "id": 694,
    "mediaId": 195,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Max Greenwood and Reid Wilson -",
    "title": "Five big takeaways from year-end FEC filings"
  },
  {
    "id": 702,
    "mediaId": 124,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "And on the House side, Trump gave to Harriet Hageman, who is running a primary challenge to Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "Trump gave $1M to Meadows nonprofit weeks after Jan. 6 panel's creation"
  },
  {
    "id": 707,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "As a result, we are faced with a very simple choice: <span class='selected-term'>Liz Cheney</span>, who despite having political ideologies and beliefs that probably all of us find absolutely repugnant, but still believes in American liberal Democracy and will continue to fight for it till the bitter end no matter the consequences, or a sycophantic rabid trumper who holds even more repugnant ideologies, on top of NOT believing in American liberal Democracy.",
    "author": "",
    "title": "Now entering Bizarro World; Democrats must help Cheney win"
  },
  {
    "id": 713,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "An ally of Donald Trump and a former campaign adviser is pressuring the Republican National Committee (RNC) to officially expel Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois from the party, according to The Washington Post.",
    "author": "",
    "title": "Trump ally pushes Republican Party to expel Cheney, who issues blistering rebuke"
  },
  {
    "id": 679,
    "mediaId": 65,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "And last September, after Trump endorsed Harriet Hageman's primary challenge against Rep. <span class='selected-term'>Liz Cheney</span> in the race for Wyoming's at-large House seat, he and his allies successfully urged some, but not all, of the other anti-Cheney GOP candidates to drop out of the primary and coalesce around Hageman.",
    "author": "Paul Steinhauser",
    "title": "After meeting with Trump, Georgia's Vernon Jones likely to exit GOP gubernatorial primary"
  },
  {
    "id": 60,
    "mediaId": 237,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The Republican National Committee issued a rebuke of Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, taking the remarkable step in part because of their participation in the House select committee formed to investigate the Jan. 6 Capitol riot.",
    "author": "Emily Brooks",
    "title": "Republican National Committee censures Liz Cheney and Kinzinger"
  },
  {
    "id": 615,
    "mediaId": 151,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "| AP Photo/Amanda Andrade-Rhoades\nBy Associated Press\n 02/04/2022 03:00 PM EST\nSALT LAKE CITY  Republican Party officials on Friday voted to punish GOP Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for their work on the House committee investigating the Jan. 6 insurrection and advanced a rule change that would prohibit candidates from participating in debates organized by the Commission on Presidential Debates.",
    "author": "",
    "title": "GOP censures Cheney, Kinzinger, moves to pull out of debates"
  },
  {
    "id": 617,
    "mediaId": 163,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Representatives <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for joining Congress' probe of then-President Donald Trump's efforts to overturn the 2020 election, calling the Jan. 6 Capitol attack \"legitimate political discourse.\"",
    "author": "Doina Chiacu",
    "title": "Republican Party censures Cheney, Kinzinger, calls Jan. 6 attack 'legitimate political discourse'"
  },
  {
    "id": 618,
    "mediaId": 124,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Honor attaches to <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.?\nSen. Bill Cassidy, R-La., also tweeted late Thursday, The RNC is censuring Liz Cheney and Adam Kinzinger because they are trying to find out what happened on January 6th  HUH??\nMeanwhile, the Democratic National Committee said McDaniel and the GOP keep reminding voters that there is no low they will not go to to protect Donald Trump and his chaos.?\nTheir decision to prioritize politics over our country is disgusting and voters will not soon forget,? Ammar Moussa, the DNC rapid response director, said in a statement.",
    "author": "",
    "title": "RNC votes to censure Cheney, Kinzinger for investigating Capitol riot"
  },
  {
    "id": 622,
    "mediaId": 21,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The Republican National Committee voted on Friday to formally censure Republican Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois for their participation in the House select committee investigating the January 6 assault on the US Capitol.",
    "author": "Bryan Metzger",
    "title": "Republican National Committee votes to censure Reps. Liz Cheney and Adam Kinzinger for participating in the January 6 committee"
  },
  {
    "id": 623,
    "mediaId": 65,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "In an overwhelming voice vote by committee members gathered for the general session of their winter meeting in Salt Lake City, Utah, the RNC rebuked Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois.",
    "author": "Paul Steinhauser",
    "title": "Republican National Committee overwhelming votes to censure Cheney, Kinzinger for sitting on Jan. 6 committee"
  },
  {
    "id": 624,
    "mediaId": 233,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger are the only Republicans on the House committee investigating the violent mob of Trump supporters last year.",
    "author": "David Jackson",
    "title": "GOP censures Reps. Liz Cheney and Adam Kinzinger, calls Jan. 6 riot 'legitimate political discourse'"
  },
  {
    "id": 631,
    "mediaId": 1164,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Feb. 4 (UPI) -- The Republican National Committee on Friday approved a resolution censuring Reps. <span class='selected-term'>Liz Cheney</span>, R-Wyo., and Adam Kinzinger, R-Ill., for their participation on the House select committee investigating the Jan. 6, 2021, attack on the U.S. Capitol.",
    "author": "Danielle Haynes",
    "title": "RNC censures Liz Cheney, Adam Kinzinger for Jan. 6 committee participation"
  },
  {
    "id": 637,
    "mediaId": 881,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The RNC has a planned vote to censure Wyoming GOP Rep. <span class='selected-term'>Liz Cheney</span> and Illinois GOP Rep. Adam Kinzinger, the two Republicans who bucked their party and joined the House Select Committee investigating the causes of the Jan. 6, 2021, attack on Congress.",
    "author": "Cameron Joseph",
    "title": "The GOP Is Now Officially Pushing Jan. 6 Conspiracy Theories"
  },
  {
    "id": 638,
    "mediaId": 21,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "McDaniel made the remarks about the committee in a joint interview with The Washington Post alongside David Bossie, a fellow RNC official and former Trump campaign aide, with whom she co-authored a resolution to censure Republican Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois over their participation in the congressional committee.",
    "author": "Bryan Metzger",
    "title": "RNC Chairwoman Ronna McDaniel says January 6 committee is a 'Democrat-led persecution of ordinary citizens who engaged in legitimate political discourse'"
  },
  {
    "id": 640,
    "mediaId": 112,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The initial draft, obtained by The Associated Press, had accused Cheney and Kinzinger of serving as pawns to parrot Democrat talking points? on the Jan. 6 House committee and chided them for deposing their colleagues and pursuing what amounts to a third political impeachment of President Trump.?\nThe Conference must not be sabotaged by Rep. <span class='selected-term'>Liz Cheney</span> and Rep. Adam Kinzinger who have demonstrated, with actions and words, that they support Democrat efforts to destroy President Trump more than they support winning back a Republican majority in 2023,? it said.",
    "author": "Associated Press",
    "title": "Republican officials now look to censure Cheney and Kinzinger, not oust them"
  },
  {
    "id": 659,
    "mediaId": 238,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Honor attaches to <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.?\nNot mentioned in that tweet, however, was the name of the party in question or the fact that the RNC chairwoman who engineered the resolution was Romney's own niece Ronna McDaniel.",
    "author": "",
    "title": "Opinion: A party that censures its defenders of the Constitution has lost its way"
  },
  {
    "id": 662,
    "mediaId": 178,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "GOP officials took a voice vote to approve censuring Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger at the party's winter meeting in Salt Lake City.",
    "author": "SAM METZ Associated Press",
    "title": "GOP censures Cheney, Kinzinger as it assails Jan. 6 probe"
  },
  {
    "id": 665,
    "mediaId": 178,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "GOP officials took a voice vote to approve censuring Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois at the party's winter meeting in Salt Lake City.",
    "author": "SAM METZ Associated Press",
    "title": "GOP censures Cheney, Kinzinger as it assails Jan. 6 probe"
  },
  {
    "id": 666,
    "mediaId": 43,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The party said the behavior of Cheney and Kinzinger has been destructive to the institution of the U.S. House of Representatives, the Republican Party and our republic.? [...]\nIn addition to Friday's formal censure at the party's winter meeting in Salt Lake City, the RNC also made plans to fund a primary challenge against Cheney in Wyoming  after state Republican leaders passed a special rule to recognize Harriet Hageman, her challenger, as the party's presumptive nominee\nThis short commentary on Hageman appeared previously as part of the Jan. 20 Earth Matters:\n Harriet Hageman\nRight-wing land-use attorney Harriet Hageman is keen to export clean coal? from Wyoming and export Rep. <span class='selected-term'>Liz Cheney</span> back to the private sector in the state's Republican primary next August.",
    "author": "",
    "title": "Nat'l GOP is funding this woman in Wyoming primary against Liz Cheney, whom the party condemned"
  },
  {
    "id": 667,
    "mediaId": 25,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "This is not legitimate political discourse.? pic.twitter.com/lKgbVyVcJr\n Rep. <span class='selected-term'>Liz Cheney</span> (@RepLizCheney) February 4, 2022\nA previous version of the resolution would have called on House Republicans to remove Cheney and Kinzinger from the GOP conference, but the measure was changed to a censure.",
    "author": "Adam Brewster",
    "title": "RNC approves measure to censure Liz Cheney and Adam Kinzinger"
  },
  {
    "id": 596,
    "mediaId": 65,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "Pence delivered his speech in Florida a couple of hours after the Republican National Committee (RNC)  gathered at its winter meeting in Salt Lake City, Utah  took the rare step of censuring GOP Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois for their participation in a Democrat-dominated House select committee investigating the attack on the Capitol.",
    "author": "Paul Steinhauser",
    "title": "2024 Watch: Trump-Pence chasm over Capitol attack widens amid fight for GOP future"
  },
  {
    "id": 600,
    "mediaId": 19,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "The Times also describes Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming as an instigating force: Some of the Democrats on the committee were concerned that if the panel was too aggressive, Republicans might turn the tables on the Democrats whenever they took back control of the House.",
    "author": "Joel B. Pollak",
    "title": "NY Times Warns: Republicans Can Use January 6 Committee's Precedent to Pursue Democrats After Midterm Elections"
  },
  {
    "id": 582,
    "mediaId": 65,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "RNC MAKES RARE MOVE TO CENSURE TWO OF ITS OWN: REPUBLICAN REPS. CHENEY AND KINZINGER\nLost amid the headlines generated by the Republican National Committee's (RNC) move on Friday to censure GOP Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for their participation on the House committee investigating the riot of Jan. 6, 2021, was the unanimous passage by an RNC panel of a report that makes no changes to the traditional top of the party's presidential nominating calendar.",
    "author": "Paul Steinhauser",
    "title": "With two years to go until Iowa caucuses, little GOP appetite to upend presidential nominating calendar"
  },
  {
    "id": 567,
    "mediaId": 237,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Senate Minority Leader Mitch McConnell said it was not the job? of the Republican National Committee to be singling out members? with differing views, as it did by censuring Republican Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "Emily Brooks",
    "title": "McConnell: 'Not the job of the RNC' to censure Liz Cheney and Adam Kinzinger"
  },
  {
    "id": 574,
    "mediaId": 129,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Then on Friday, the Republican National Committee voted to censure Representatives <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, the two House Republicans on the congressional committee investigating the Jan. 6 attack on the Capitol.",
    "author": "",
    "title": "Censure Vote Has Republicans Battling Themselves Again"
  },
  {
    "id": 546,
    "mediaId": 238,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "On Saturday morning, a measure to formally censure <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger and no longer support them as members of the Republican Party? was finally introduced at the RNC's winter meeting, alongside resolutions to hold Communist China accountable? for the covid-19 pandemic and to oppose noncitizen voting.",
    "author": "",
    "title": "The Trailer: Coming soon to a Democratic primary fight: Israel"
  },
  {
    "id": 551,
    "mediaId": 129,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "We don't agree with what <span class='selected-term'>Liz Cheney</span> is doing.?\nMs. Hageman said she didn't know who the legitimate winner of the 2020 election was (I don't know the answer?) and couldn't say if former Vice President Mike Pence had the authority to block congressional certification of President Biden's election (I'm not an elections attorney?).",
    "author": "",
    "title": "Where's Liz Cheney? The Wyoming Republican's Exile From Wyoming Republicans"
  },
  {
    "id": 552,
    "mediaId": 43,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "It is one of those Am I rooting for <span class='selected-term'>Liz Cheney</span>?? moments, as SOS Schwab, who again was a far far right legislator, actually appears to know what he is doing and is on the side of truth vs. the Big Lie proponents.",
    "author": "",
    "title": "Watch KS Legislative Committee Grill Republican SOS on Big Lie nonsense"
  },
  {
    "id": 533,
    "mediaId": 238,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Which made the decision of the Republican National Committee to censure Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Republicans are attacking each other at the worst possible time"
  },
  {
    "id": 534,
    "mediaId": 195,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "The Republican National Committee's move to censure Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Julia Manchester",
    "title": "GOP falters in effort to recruit star governors for Senate"
  },
  {
    "id": 508,
    "mediaId": 238,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "For several days, the big running story was the fallout from the decision by the Republican National Committee to censure Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Republicans may be divided over Trump, but that's of little solace to Biden and the Democrats"
  },
  {
    "id": 501,
    "mediaId": 223,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "The 2024 Republican presidential primary may see RINO candidates running like Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, and now potentially Gov.",
    "author": "Rebecca Downs",
    "title": "Yet Another RINO May Run for President in 2024"
  },
  {
    "id": 503,
    "mediaId": 43,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "The Republican National Committee (RNC) is the institutional arm of the Republican Party and, as such, it passed a resolution to censure Republicans <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, declaring the Party \"must not be sabotaged by Representatives Liz Cheney and Adam Kinzinger who have demonstrated, with actions and words, that they support Democrat efforts to destroy President Trump\".",
    "author": "",
    "title": "Fash And Furious"
  },
  {
    "id": 492,
    "mediaId": 238,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "There are a few exceptions  Sen. Lisa Murkowski in Alaska, Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming  but in the vast majority of races, no matter the outcome, Trumpism will win.",
    "author": "",
    "title": "Opinion: Democrats fight about policy. Republicans fight over who's most loyal to Trump."
  },
  {
    "id": 464,
    "mediaId": 233,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "WASHINGTON  House Minority Leader Kevin McCarthy, R-Calif., on Thursday endorsed Harriet Hageman, a primary challenger to GOP Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, the latest skirmish between Cheney and her party over her forceful criticism of former President Donald Trump.",
    "author": "Dylan Wells",
    "title": "House GOP leader Kevin McCarthy endorses Liz Cheney challenger in continuing fallout over Trump"
  },
  {
    "id": 469,
    "mediaId": 237,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "When Trump endorsed Hageman last fall, the former president said she has \"my Complete and Total Endorsement in replacing the Democrats number one provider of sound bites, <span class='selected-term'>Liz Cheney</span>.? Hageman told the Washington Examiner in an interview the same month that Cheney \"betrayed Wyoming\" and \"betrayed me.\"",
    "author": "Asher Notheis",
    "title": "Kevin McCarthy endorses Liz Cheney primary challenger"
  },
  {
    "id": 478,
    "mediaId": 223,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "There is the 99% of the GOP that wants to crush the Dems, and the 1% that wants to ogle the <span class='selected-term'>Liz Cheney</span> centerfold in this month's edition of Swamp Creature.",
    "author": "Kurt Schlichter",
    "title": "The Media Desperately Wants a Republican Civil War"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "All face challenging roads to reelection, particularly Rep. <span class='selected-term'>Liz Cheney</span>, the most outspoken of them, who has enraged so many Wyoming Republicans that they are plotting to alter state election laws to cut off one potential route to political survival.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries"
  },
  {
    "id": 437,
    "mediaId": 19,
    "date": "2/21/2022 12:00:00 AM",
    "sentence": "Adam Kinzinger will be retiring from Congress later this year, and <span class='selected-term'>Liz Cheney</span> faces a difficult primary challenge in her home state of Wyoming against Harriet Hageman, who has been endorsed by top GOP leaders like House Minority Leader Kevin McCarthy (R-CA).",
    "author": "Paul Bois",
    "title": "Anti-Trumpers Liz Cheney, Adam Kinzinger to Attend CPAC Counterprogramming' Summit"
  },
  {
    "id": 391,
    "mediaId": 25,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n What to watch for in Texas' primary elections\n Trump's response to Putin's invasion of Ukraine reveals GOP fissures\n Democrats seize on GOP Senator Rick Scott's plan to tax more Americans\n Congressman Colin Allred discusses Democrats' midterm prospects\n Kevin McCarthy backs <span class='selected-term'>Liz Cheney</span>'s primary challenger Harriet Hageman\n More\n Caitlin Huey-Burns\nCaitlin Huey-Burns is a political reporter for CBS News.",
    "author": "",
    "title": "Biden's low approvals worry Democrats campaigning in midterm elections"
  },
  {
    "id": 386,
    "mediaId": 25,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Biden's low approvals worry Democrats campaigning in midterm elections\n Trump's response to Putin's invasion of Ukraine reveals GOP fissures\n Democrats seize on GOP Senator Rick Scott's plan to tax more Americans\n Congressman Colin Allred discusses Democrats' midterm prospects\n Kevin McCarthy backs <span class='selected-term'>Liz Cheney</span>'s primary challenger Harriet Hageman\n More\nIn:\ntexas\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "CBS News projects Abbott and O'Rourke win Texas primaries and will face off in November"
  },
  {
    "id": 387,
    "mediaId": 129,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, Senator Lisa Murkowski of Alaska and Republicans who voted for impeachment from Michigan, South Carolina and Washington State are all vulnerable and the subject of Mr. Trump's obsession.",
    "author": "",
    "title": "Takeaways From the Texas Primary Elections"
  },
  {
    "id": 363,
    "mediaId": 237,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "The former president has particularly targeted 10 Republicans who voted to impeach him in the aftermath of the Jan. 6 riot at the U.S. Capitol, including Rep. <span class='selected-term'>Liz Cheney</span>, Wyoming's lone representative in the House.",
    "author": "Kate Scanlon",
    "title": "Trump-backed Wyoming elections bill fails to pass, in boon to Liz Cheney"
  },
  {
    "id": 364,
    "mediaId": 409,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "Somebody such as Larry Hogan or <span class='selected-term'>Liz Cheney</span> might enter the race and face the same problem.",
    "author": "Dan McLaughlin",
    "title": "Is Mike Pence Preparing a Kamikaze Campaign?"
  },
  {
    "id": 350,
    "mediaId": 409,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "A similar dynamic could save Representative <span class='selected-term'>Liz Cheney</span>, a vocal Trump critic, who faces several challengers in her August primary in Wyoming.",
    "author": "John Fund",
    "title": "Democratic Interlopers Could Diminish Trump's Clout in GOP Primaries"
  },
  {
    "id": 353,
    "mediaId": 19,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "Donald Trump Jr., previously called her the Alabama <span class='selected-term'>Liz Cheney</span>.?\nThe Republican primary in the race is on May 24.",
    "author": "John Binder",
    "title": "Exclusive  Mo Brooks: Biden Failing to Protect U.S. from Invasion' at Border, Violating Constitution"
  },
  {
    "id": 343,
    "mediaId": 151,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "I'll tell you this, there's only one way <span class='selected-term'>Liz Cheney</span> wins, and that's if you let Democrats vote in your primary, so you need to call your state rep and let them know,? he said just days before the bill died.",
    "author": "",
    "title": "Liz Cheney turns to Democrats to save her hide"
  },
  {
    "id": 331,
    "mediaId": 223,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Fifteen years later, his daughter Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Matt Vespa",
    "title": "Oh, So That's Who Liz Cheney Is Banking on Saving Her in Wyoming"
  },
  {
    "id": 325,
    "mediaId": 223,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "Trump has an opportunity in 2024, but so does DeSantis, and you gotta love the idea of a primary where Godzilla fights King Kong, and they only pause to jointly pummel the tacky Rodan that is <span class='selected-term'>Liz Cheney</span> or Adam Kinzinger or whatever other Bulwark-approved weenie tries to run in the Democrat lane of the Republican primaries.",
    "author": "Kurt Schlichter",
    "title": "The DeSantis Doctrine"
  },
  {
    "id": 319,
    "mediaId": 43,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "Images then flash by of Senate Minority Leader Mitch McConnell, Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, and Katie Boyd Britt, the former Business Council of Alabama head who is Brooks' main rival in the May primary, as the congressman decries \"debt junkie, weak-kneed, open-border RINOs who sell out our conservative values.\"",
    "author": "",
    "title": "Morning Digest: New Hampshire's Republican governor threatens to veto Republican gerrymander"
  },
  {
    "id": 314,
    "mediaId": 43,
    "date": "3/19/2022 12:00:00 AM",
    "sentence": "While it would be unfair to dismiss Cheney's opposition to Trumpism as insincereshe's surely seen little political benefit for taking the stances she's takenthis might be a good occasion for Democrats to consider how much longer they want to be in the <span class='selected-term'>Liz Cheney</span> business, given what a poor defender of democracy she has actually been during her career.",
    "author": "",
    "title": "The Democrats' complicated dance with neoconservative heiress Liz Cheney"
  },
  {
    "id": 300,
    "mediaId": 237,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "PONTE VEDRA BEACH, Fla.  House Minority Leader Kevin McCarthy said he does not believe Republicans will pay a price at the ballot box for increasingly rejecting Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger over their criticism of former President Donald Trump.",
    "author": "Juliegrace Brufke",
    "title": "McCarthy says GOP criticisms of Cheney and Kinzinger won't dissuade swing voters"
  },
  {
    "id": 289,
    "mediaId": 195,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "More than 100 House Republicans are set to host a fundraiser later this month for Rep. <span class='selected-term'>Liz Cheney</span>'s (R-Wyo.)",
    "author": "Max Greenwood",
    "title": "House GOP keeps Trump at arm's length as it hones midterm strategy"
  },
  {
    "id": 269,
    "mediaId": 65,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "TRUMP RETURNING TO GEORGIA TO CAMPAIGN WITH DAVID PERDUE, HERSCHEL WALKER\nMeanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 255,
    "mediaId": 237,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Dozens of House Republicans are expected to attend House Minority Leader Kevin McCarthy's fundraiser for Rep. <span class='selected-term'>Liz Cheney</span>'s Wyoming GOP primary opponent, Harriet Hageman, on Wednesday evening in an increasingly bitter contest over fealty by party members to former President Donald Trump.",
    "author": "Juliegrace Brufke",
    "title": "Liz Cheney primary opponent fundraiser draws scores of GOP House incumbents"
  },
  {
    "id": 250,
    "mediaId": 237,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "\"<span class='selected-term'>Liz Cheney</span>, is she manipulating the voters?",
    "author": "Andrew Kerr",
    "title": "Democrats block trans candidate from primary for trying to 'manipulate voters'"
  },
  {
    "id": 24,
    "mediaId": 238,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "The six other Republicans who voted to impeach Trump who are running again  including Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "Amy B Wang",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection"
  },
  {
    "id": 27,
    "mediaId": 238,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "The six other Republicans who voted to impeach Trump who are running again  including Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection"
  },
  {
    "id": 238,
    "mediaId": 136,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Trump took a similar route of endorsing a Republican challenger over Wyoming Representative <span class='selected-term'>Liz Cheney</span>, one of the group of 10 who has taken the additional step of serving on the House committee investigating the Capitol attack.",
    "author": "Zoe Strozewski",
    "title": "Trump Asks 'Who's Next' Among GOP Who Voted to Impeach as Upton Retires"
  },
  {
    "id": 234,
    "mediaId": 43,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Overnight News Digest: Ruble recovers as Russian oil flows; IPCC act now to prevent climate disaster"
  },
  {
    "id": 229,
    "mediaId": 19,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "The ringleader of the establishment Republicans, Sen. Mitch McConnell (R-KY), announced on Thursday a donation to Democrat ally Rep. <span class='selected-term'>Liz Cheney</span>'s (R-WY) reelection campaign.",
    "author": "Wendell Husebø",
    "title": "Mitch McConnell Donates to Liz Cheney"
  },
  {
    "id": 214,
    "mediaId": 25,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n Trump endorses Oz in Pennsylvania Senate primary race\n Judge declines to slow N.Y. primary elections despite ongoing redistricting battle\n More\nIn:\nIowa\nchuck grassley\n Adam Brewster\nCBS News political reporter.",
    "author": "Adam Brewster",
    "title": "Iowa Democratic Senate candidate to appeal judge's decision to keep her off ballot"
  },
  {
    "id": 203,
    "mediaId": 43,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "1Q Fundraising\nNH-Sen: Chuck Morse (R): $750,000 raised\nSC-Gov: Joe Cunningham (D): $404,000 raised, $536,000 cash-on-hand\nCA-21: Jim Costa (D-inc): $248,000 raised, $1.23 million cash-on-hand\nIL-17: Eric Sorensen (D): $200,000 raised\nMN-02: Angie Craig (D-inc): $1 million raised, $3.7 million cash-on-hand\nMT-01: Ryan Zinke (R): $1.1 million raised, $1.2 million cash-on-hand\nOR-05: Jamie McLeod Skinner (D): $305,000 raised\nTN-05: Morgan Ortagus (R): $600,000 raised (in six weeks), $550,000 cash-on-hand\nWY-AL: <span class='selected-term'>Liz Cheney</span> (R-inc): $2.94 million raised, $6.8 million cash-on-hand\nRedistricting\n? FL Redistricting: State legislative leaders said Monday that they would allow their fellow Republican, Gov.",
    "author": "",
    "title": "Morning Digest: Why Trump pick needs to defend her 'bona fides' to get back on primary ballot"
  },
  {
    "id": 191,
    "mediaId": 25,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Democrat Abby Finkenauer to remain on ballot for U.S. Senate in Iowa\n Trump PAC gives $500K to group to defeat Georgia's GOP governor\n Pence decries cancel culture amid protests, praises Zelenskyy at University of Virginia\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n More\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "Democrat Abby Finkenauer to remain on ballot for U.S. Senate in Iowa"
  },
  {
    "id": 188,
    "mediaId": 195,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Lexi Lonas",
    "title": "Five takeaways from last quarter's fundraising"
  },
  {
    "id": 172,
    "mediaId": 223,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "But there's no grand plan right now.?\nSkalka, to her credit, also acknowledges that Kinzinger appears to be obsessed with the former president, especially when it comes to his vote in favor of Trump's second impeachment and the fact that Kinzinger is one of only two Republicans to serve on the January 6 Select Commitee, along with fellow RINO Rep. <span class='selected-term'>Liz Cheney</span> (R-WY).",
    "author": "Rebecca Downs",
    "title": "Is He a Masochist? Kinzinger Says It Would Be 'Fun' to Run Against Trump in 2024, Even If He Gets 'Crushed'"
  },
  {
    "id": 175,
    "mediaId": 19,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "In 2022, both men have supported anti-American First primary candidates, such as warmonger Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), who is in a tough primary fight against Trump-endorsed Harriet Hageman.",
    "author": "Wendell Husebø",
    "title": "Poll: Donald Trump Commands GOP's Greatest Favorability Rating, Romney and McConnell Lowest"
  },
  {
    "id": 163,
    "mediaId": 312,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "In February, she earned the ire of Senate Minority Leader Mitch McConnell after she participated in a conference organized by a white nationalist, and in October, she drew criticism for announcing, on the House floor, that her moderate Republican colleague Rep. <span class='selected-term'>Liz Cheney</span> was a joke? for participating in an investigation of the Jan. 6 Capitol attack, which Greene has been accused of helping to incite.",
    "author": "Nik Popli",
    "title": "One of Marjorie Taylor Greene's Primary Challengers is Raking in Republican Cash"
  },
  {
    "id": 170,
    "mediaId": 209,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "The DNC could formally censure both senators, as the RNC did with GOP Reps. <span class='selected-term'>Liz Cheney</span> (Wy.)",
    "author": "David Faris",
    "title": "The case for exiling Manchin and Sinema from the Democratic Party"
  },
  {
    "id": 107,
    "mediaId": 25,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "That group, united by criticism of Trump and their ties to traditional Republican politics, includes New Hampshire Governor Chris Sununu and Wyoming Congresswoman <span class='selected-term'>Liz Cheney</span>, who is vice chair of the House select committee investigating the attack on the Capitol.",
    "author": "Robert Costa",
    "title": "Hogan says Trump should not run in 2024 and GOP should \"move on,\" resist \"cheap impersonation\""
  },
  {
    "id": 99,
    "mediaId": 65,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "They believe Biden is a return to normalcy and that the next presidential contest will include a mannerly Republican they can abide because the party platform will go back to being bait only used to deceptively snare enough votes without any intention of it guiding action (echoes of McCain and Romney with a side of <span class='selected-term'>Liz Cheney</span>.)",
    "author": "Matt Schlapp",
    "title": "JD Vance's victory proves the old GOP has been transformed"
  },
  {
    "id": 4053,
    "mediaId": 195,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "If you think that Trump will stop with Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Kristin Tate",
    "title": "Trump is Democrats only hope in 2024"
  },
  {
    "id": 93,
    "mediaId": 238,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion Our democracy at home depends on preserving freedom in Ukraine"
  },
  {
    "id": 91,
    "mediaId": 19,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "Hageman is a Donald Trump-endorsed candidate and has a strong shot at defeating Cheney in the open primary on August 16.\nWe're currently working on a new project in Wyoming, where we're asking for people to explain why <span class='selected-term'>Liz Cheney</span> is their ideal representative, regardless of their party affiliation,? an email from People First to a Wyoming resident reads.",
    "author": "Wendell Husebø",
    "title": "Liz Cheney Aided in GOP Primary by Ad Agency Linked to Biden, BLM, Planned Parenthood"
  },
  {
    "id": 92,
    "mediaId": 19,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "Biden's respective ratings are important because Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) and Sen. Joe Manchin (D-WV) are facing political headwinds.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden's Approval Rating in Delaware Underwater by 3 Points"
  },
  {
    "id": 5510,
    "mediaId": 195,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "And among the loudest voices denouncing the GOPs flirtation with fringe nationalism are a pair of Capitol Hill Republicans  Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "Mike Lillis",
    "title": "Democrats hit GOP over replacement theory"
  },
  {
    "id": 5516,
    "mediaId": 881,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Wyoming Republican Rep. <span class='selected-term'>Liz Cheney</span> took aim at Stefanik, who replaced her in GOP House leadership after an ugly fight last year.",
    "author": "",
    "title": "MORE LIKE THIS"
  },
  {
    "id": 7186,
    "mediaId": 25,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Full transcript of \"Face the Nation\" on May 22, 2022"
  }
]