[
  {
    "id": 806,
    "mediaId": 169,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "It would have been an odd scene just a few years ago: Congressional Democrats lining up to greet and exchange kind words with former vice president Dick Cheney, who along with his daughter, Rep. <span class='selected-term'>Liz Cheney</span>, were the only two Republican members present for an event held at the U.S. Capitol Thursday to commemorate the attempted Jan. 6 insurrection.",
    "author": "Brett Bachman",
    "title": "Democrats embrace Dick Cheney during Jan. 6 remembrance event"
  },
  {
    "id": 807,
    "mediaId": 195,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "And I was happy to welcome him back, and to congratulate him on the courage of <span class='selected-term'>Liz Cheney</span>.",
    "author": "Rebecca Beitsch",
    "title": "Dick Cheney visits Capitol for Jan. 6, criticizes GOP leadership"
  },
  {
    "id": 764,
    "mediaId": 223,
    "date": "1/17/2022 12:00:00 AM",
    "sentence": "SO WE THOUGHT you'd help us give <span class='selected-term'>Liz Cheney</span> the support she needs to see the investigation through.?\nAre these left-wing groups really raising money to help reelect Liz Cheney?",
    "author": "Derek Hunter",
    "title": "Democrats Claim Liz Cheney As One Of Their Own; They Can Have Her"
  },
  {
    "id": 732,
    "mediaId": 195,
    "date": "1/26/2022 12:00:00 AM",
    "sentence": "Sen. Mitt Romney (R-Utah) is participating in a fundraiser for Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Romney participating in fundraiser for Liz Cheney"
  },
  {
    "id": 726,
    "mediaId": 19,
    "date": "1/29/2022 12:00:00 AM",
    "sentence": "I. Lewis Scooter? Libby, former chief of staff to Vice President Richard Cheney, is reportedly planning to attend a fundraiser in March for embattled Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), who is targeting Trump on the January 6 Committee.",
    "author": "Joel B. Pollak",
    "title": "Report: Scooter' Libby, Pardoned by Trump, to Attend Liz Cheney Fundraiser"
  },
  {
    "id": 719,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "Repeated attacks by former President Donald Trump as he tries to oust Rep. <span class='selected-term'>Liz Cheney</span> from Congress are fueling a massive fundraising haul by the Republican lawmaker from Wyoming.",
    "author": "Paul Steinhauser",
    "title": "Liz Cheney hauls in over $7 million last year as she fends off push by Trump to oust her from Congress"
  },
  {
    "id": 721,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: Harriet Hageman, the leading Republican candidate challenging Rep. <span class='selected-term'>Liz Cheney</span> as Wyoming's at-large member of the House runs for re-election this year, reports that she's hauled in over $1 million in fundraising since declaring her candidacy for Congress less than five months ago.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in $1 million since launching congressional bid"
  },
  {
    "id": 696,
    "mediaId": 151,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "This is also the perfect strategy to keep Rep. <span class='selected-term'>Liz Cheney</span> in Congress if she loses her primary in August and must run as an independent.",
    "author": "",
    "title": "How a Bipartisan Alliance Can Take On Trumpism in the Midterms"
  },
  {
    "id": 698,
    "mediaId": 21,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Former President George W. Bush gave the maximum allowed political contributions to Wyoming Rep. <span class='selected-term'>Liz Cheney</span> and Alaska Sen. Lisa Murkowski, two Republicans who supported impeaching former President Donald Trump over the January 6 Capitol riot.",
    "author": "Bryan Metzger",
    "title": "George W. Bush maxes out political donations to Trump impeachment supporters Liz Cheney and Lisa Murkowski"
  },
  {
    "id": 464,
    "mediaId": 233,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "WASHINGTON  House Minority Leader Kevin McCarthy, R-Calif., on Thursday endorsed Harriet Hageman, a primary challenger to GOP Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, the latest skirmish between Cheney and her party over her forceful criticism of former President Donald Trump.",
    "author": "Dylan Wells",
    "title": "House GOP leader Kevin McCarthy endorses Liz Cheney challenger in continuing fallout over Trump"
  },
  {
    "id": 469,
    "mediaId": 237,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "When Trump endorsed Hageman last fall, the former president said she has \"my Complete and Total Endorsement in replacing the Democrats number one provider of sound bites, <span class='selected-term'>Liz Cheney</span>.? Hageman told the Washington Examiner in an interview the same month that Cheney \"betrayed Wyoming\" and \"betrayed me.\"",
    "author": "Asher Notheis",
    "title": "Kevin McCarthy endorses Liz Cheney primary challenger"
  },
  {
    "id": 341,
    "mediaId": 65,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "FIRST ON FOX - Harriet Hageman, the GOP congressional candidate waging a primary challenge against Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., with the backing of former President Donald Trump, argues in a new digital campaign that the Republican incumbent is out of touch with voters and is \"obsessed with her personal war\" against Trump.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Wyoming GOP primary challenger Hageman urges sending Cheney home to Virginia'"
  },
  {
    "id": 343,
    "mediaId": 151,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "I'll tell you this, there's only one way <span class='selected-term'>Liz Cheney</span> wins, and that's if you let Democrats vote in your primary, so you need to call your state rep and let them know,? he said just days before the bill died.",
    "author": "",
    "title": "Liz Cheney turns to Democrats to save her hide"
  },
  {
    "id": 349,
    "mediaId": 19,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Wyoming voters will have to pay for an audience with embattled Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) during one of her infrequent visits to her home state next week.",
    "author": "Wendell Husebø",
    "title": "Wyoming Voters Have to Pay for an Audience with Liz Cheney"
  },
  {
    "id": 331,
    "mediaId": 223,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Fifteen years later, his daughter Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Matt Vespa",
    "title": "Oh, So That's Who Liz Cheney Is Banking on Saving Her in Wyoming"
  },
  {
    "id": 336,
    "mediaId": 19,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Such a person is <span class='selected-term'>Liz Cheney</span>.?\nCBS News reportedly spotted Romney leaving the event with former Vice President Dick Cheney and her mother, Lynne Cheney.",
    "author": "Wendell Husebø",
    "title": "Mitt Romney Lies About Supporting GOP Primary Candidates"
  },
  {
    "id": 255,
    "mediaId": 237,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Dozens of House Republicans are expected to attend House Minority Leader Kevin McCarthy's fundraiser for Rep. <span class='selected-term'>Liz Cheney</span>'s Wyoming GOP primary opponent, Harriet Hageman, on Wednesday evening in an increasingly bitter contest over fealty by party members to former President Donald Trump.",
    "author": "Juliegrace Brufke",
    "title": "Liz Cheney primary opponent fundraiser draws scores of GOP House incumbents"
  },
  {
    "id": 227,
    "mediaId": 65,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: Harriet Hageman, the leading Republican candidate challenging Rep. <span class='selected-term'>Liz Cheney</span> as Wyoming's at-large member of the House runs for re-election this year, reports that she's raked in over $1.3 million during the January-March first quarter of fundraising.",
    "author": "",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in over $1.3 million past three months"
  },
  {
    "id": 205,
    "mediaId": 65,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Repeated attacks by former President Donald Trump as he tries to oust Rep. <span class='selected-term'>Liz Cheney</span> from Congress keep fueling massive fundraising by the Republican lawmaker from Wyoming.",
    "author": "Paul Steinhauser",
    "title": "Targeted by Trump, Cheney hauls in nearly $3 million the past three months for her re-election run"
  },
  {
    "id": 206,
    "mediaId": 124,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who has risen to national prominence as one of the most vocal opponents of former President Donald Trump, raised $2.94 million in toward her re-election bid the first quarter of 2022, her campaign confirmed to NBC News on Monday.",
    "author": "",
    "title": "Cheney capitalizes off national profile to raise $2.9 million in first quarter of 2022"
  },
  {
    "id": 207,
    "mediaId": 195,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Campaign\nRep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Mychael Schnell",
    "title": "Cheney sets personal fundraising record"
  },
  {
    "id": 109,
    "mediaId": 65,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming sits high atop Donald Trump's list of GOP enemies.",
    "author": "Paul Steinhauser",
    "title": "Trump to target Cheney at May 28 rally in Wyoming"
  },
  {
    "id": 114,
    "mediaId": 19,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Harriet has my Complete and Total Endorsement in replacing the Democrats' number one provider of sound bites, <span class='selected-term'>Liz Cheney</span>,? Trump wrote at the time.",
    "author": "Charlie Spiering",
    "title": "Donald Trump Announces Rally with Liz Cheney Challenger Harriet Hageman in Casper, Wyoming"
  },
  {
    "id": 3130,
    "mediaId": 65,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: An outside group chaired by Donald Trump Jr. is going up with a three-week long ad blitz in Wyoming in support of Harriet Hageman, the Republican congressional candidate who with former President Donald Trump's backing is primary challenging GOP Rep. <span class='selected-term'>Liz Cheney</span>.",
    "author": "Paul Steinhauser",
    "title": "Donald Trump Jr. takes aim at Cheney, supports Hageman in new ad running in Wyoming's GOP House primary"
  }
]