[
  {
    "id": 859,
    "mediaId": 195,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "Wyoming's At-Large Congressional District\nWyoming's at-large House seat, currently held by Rep. <span class='selected-term'>Liz Cheney</span> (R), is in safe Republican hands.",
    "author": "Tal Axelrod",
    "title": "Eleven interesting races to watch in 2022"
  },
  {
    "id": 849,
    "mediaId": 147,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "Fellow Republican <span class='selected-term'>Liz Cheney</span> and others have raised the possibility of criminal conduct.",
    "author": "PBS NewsHour",
    "title": "A history of presidential attempts to return to office and what it means for 2024"
  },
  {
    "id": 853,
    "mediaId": 187,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "I cannot fathom a possible scenario where <span class='selected-term'>Liz Cheney</span> wins.?\nTrump is also 100 percent committed to defeating Georgia Governor Brian Kemp and Senator Lisa Murkowski of Alaska, according to Michael Wolff's book Landslide.",
    "author": "David Catanese",
    "title": "Trump Is Making the Midterms a Referendum on Himself"
  },
  {
    "id": 847,
    "mediaId": 43,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "they have firsthand evidence Ivanka Trump asked Donald Trump twice to stop the violence, <span class='selected-term'>Liz Cheney</span> says\n Nicholas Wu (@nicholaswu12) January 2, 2022\nAJC:\nInside the campaign to undermine Georgia's election Part II\nBy late December, state Sens.",
    "author": "",
    "title": "Abbreviated Pundit Roundup: January 6 anniversary edges closer"
  },
  {
    "id": 772,
    "mediaId": 124,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "And Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who is serving on the Democratic-led House committee investigating the Jan. 6 attack on the Capitol, is in danger of losing a primary to Trump-endorsed Harriet Hageman.",
    "author": "",
    "title": "Inside Trump's secretive endorsement operation"
  },
  {
    "id": 773,
    "mediaId": 238,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Indeed, this is the context for understanding McCarthy's new endorsement of the primary challenger to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: Susan Collins tries to Trump proof' the 2024 election  behind Trump's back"
  },
  {
    "id": 753,
    "mediaId": 151,
    "date": "1/19/2022 12:00:00 AM",
    "sentence": "Here's our Burgess Everett with why:\n<span class='selected-term'>Liz Cheney</span> is aware, and finds it \"concerning\" that the Wyoming GOP chief aiding her party's bid to unseat her is an alleged member of the far-right Oath Keepers.",
    "author": "",
    "title": "Joe Biden said he wants to break up his stalled $1.7T social spending bill into legislative \"chunks.\" That likely means one smaller bill."
  },
  {
    "id": 736,
    "mediaId": 21,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "One feature of this micro-coalition of more dedicated Trump disciples is their ability to help cast out ideological dissenters, such as Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who was ousted from her House GOP leadership post after repeatedly criticizing Trump for inciting the January 6 insurrection.",
    "author": "Jake Lahut",
    "title": "How Marjorie Taylor Greene's endorsement of J.D. Vance shows what it takes to make it into the next generation's MAGA clique"
  },
  {
    "id": 710,
    "mediaId": 33,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Among them: Rep. Jody Hice of Georgia, who voted against certifying the election on January 6 and is running in the Republican primary against Georgia Secretary of State Brad Raffensperger, who has defended the state's election results; and Harriet Hageman, a Republican primary challenger to Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, who voted to impeach Trump for his actions on January 6 and is a member of the House select committee investigating the January 6 attack.",
    "author": "Eric Bradner",
    "title": "Trump's PAC gave $1 million to Meadows' non-profit weeks after House formed January 6 committee"
  },
  {
    "id": 711,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Too bad Republicans missed their opportunity to convict Trump and do away with him forever or, as GOP Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming put it, \"made themselves willing hostages\" to a man who just fessed up to trying to stage a coup.",
    "author": "",
    "title": "Trump's endorsement ad of David Perdue is perfectly divisive and comically awful"
  },
  {
    "id": 679,
    "mediaId": 65,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "And last September, after Trump endorsed Harriet Hageman's primary challenge against Rep. <span class='selected-term'>Liz Cheney</span> in the race for Wyoming's at-large House seat, he and his allies successfully urged some, but not all, of the other anti-Cheney GOP candidates to drop out of the primary and coalesce around Hageman.",
    "author": "Paul Steinhauser",
    "title": "After meeting with Trump, Georgia's Vernon Jones likely to exit GOP gubernatorial primary"
  },
  {
    "id": 586,
    "mediaId": 151,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "The RNC censured Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger and deemed Jan. 6 legitimate political discourse.?\nFor all the energy he creates at the party's grassroots,? Trump's stranglehold on the party is emerging as one of the biggest threats to the GOP's otherwise bright prospects in November,? David and Natalie wrote.",
    "author": "",
    "title": "Mask wars claim another pol"
  },
  {
    "id": 576,
    "mediaId": 1343,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Finally, until lately, the only high profile opponent to Trumpat least rhetoricallywas Rep. <span class='selected-term'>Liz Cheney</span>, who has been adamant in opposition to the Big Lie and is getting tons of air time as she announces the work of the select committee investigating January 6.",
    "author": "Elaine Kamarck",
    "title": "Is Trump's hold on the Republican Party getting weaker?"
  },
  {
    "id": 516,
    "mediaId": 193,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "In Wyoming, a slew of candidates dropped out after he announced his support for Harriet Hageman's bid against a top Trump critic, Rep. <span class='selected-term'>Liz Cheney</span>.",
    "author": "Jill Colvin",
    "title": "Donald Trump turns to endorsements to keep bending GOP to his will"
  },
  {
    "id": 492,
    "mediaId": 238,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "There are a few exceptions  Sen. Lisa Murkowski in Alaska, Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming  but in the vast majority of races, no matter the outcome, Trumpism will win.",
    "author": "",
    "title": "Opinion: Democrats fight about policy. Republicans fight over who's most loyal to Trump."
  },
  {
    "id": 393,
    "mediaId": 409,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "Earlier this month, McCarthy endorsed the GOP primary challenger to Wyoming representative <span class='selected-term'>Liz Cheney</span> because of Cheney's role in serving on the committee investigating the January 6 attack on the Capitol.",
    "author": "John McCormack",
    "title": "Marjorie Taylor Greene's Justification for Appearing at a White-Nationalist Conference Is Preposterous"
  },
  {
    "id": 320,
    "mediaId": 25,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "The only lawmaker who has faced lingering consequences is Wyoming Republican Rep. <span class='selected-term'>Liz Cheney</span>, who was removed from her leadership position in the House Republican conference after repeatedly criticizing former President Trump for his role in the January 6 riot.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy"
  },
  {
    "id": 295,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "\"A leader with honor would be rejecting -- not protecting -- the pro-Putin, anti-Semitic, white nationalist members of the party, instead of fighting against <span class='selected-term'>Liz Cheney</span> for telling the truth,\" Jeremy Adler, Cheney's spokesman, said in a statement to CNN.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  },
  {
    "id": 284,
    "mediaId": 129,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "In House races, Mr. Trump is most determined to oust the 10 Republicans who voted for his impeachment, particularly Representative <span class='selected-term'>Liz Cheney</span> of Wyoming.",
    "author": "",
    "title": "How the 2022 Primaries Are Testing Trump's Role as the G.O.P. Kingpin'"
  },
  {
    "id": 274,
    "mediaId": 302,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Meanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "Associated Press",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 280,
    "mediaId": 1576,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Meanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 269,
    "mediaId": 65,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "TRUMP RETURNING TO GEORGIA TO CAMPAIGN WITH DAVID PERDUE, HERSCHEL WALKER\nMeanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 246,
    "mediaId": 881,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Because Rep. <span class='selected-term'>Liz Cheney</span> voted for impeachment and is investigating Jan. 6, more than 50 of her House GOP colleagues attended a D.C. fundraiser for her primary opponent.",
    "author": "",
    "title": "T.W.I.S. Notes"
  },
  {
    "id": 216,
    "mediaId": 25,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Trending News\n U.S. processed 9,926 undocumented Ukrainians in last 2 months, data show\n Stacey Abrams-backed election lawsuit heads to trial\n Texas DA drops murder charge against woman for self-induced abortion\n Some Jan. 6 defendants turn to trial by judge instead of jury\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary",
    "author": "",
    "title": "Stacey Abrams-backed election lawsuit heads to trial"
  },
  {
    "id": 193,
    "mediaId": 237,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "It's possible he will turn his focus to the Wyoming House race next, where Rep. <span class='selected-term'>Liz Cheney</span>, one of the former president's harshest critics within the GOP, is facing off against Trump-endorsed Harriet Hageman.",
    "author": "Cami Mondeaux",
    "title": "Trump invests $500,000 in bid to unseat Georgia Gov. Kemp: Report"
  },
  {
    "id": 194,
    "mediaId": 151,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "It is unclear where else Save America PAC will make significant investments, though Trump advisers say another top priority is unseating Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, a high-profile Trump nemesis.",
    "author": "",
    "title": "Trump pours money into a midterm race for the first time"
  },
  {
    "id": 196,
    "mediaId": 25,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Trump PAC gives $500K to group to defeat Georgia's GOP governor\n Pence decries cancel culture amid protests, praises Zelenskyy at University of Virginia\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n More\nIn:\nGeorgia\nDonald Trump\n Fin Gmez\nFin Gmez is a CBS News White House producer.",
    "author": "Fin Gómez",
    "title": "Trump's political committee gives $500,000 to group aiming to defeat Georgia's GOP governor"
  },
  {
    "id": 198,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "Outside of Georgia, another top priority? target of Trump's whom the former president is expected to direct big dollars toward unseating is Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), Politico noted.",
    "author": "Ashley Oliver",
    "title": "Trump's First Major Midterm Donation Aims to Unseat Brian Kemp in Georgia"
  },
  {
    "id": 188,
    "mediaId": 195,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Lexi Lonas",
    "title": "Five takeaways from last quarter's fundraising"
  },
  {
    "id": 180,
    "mediaId": 136,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Anti-Trump Republicans including Kinzinger, Wyoming Representative <span class='selected-term'>Liz Cheney</span> and Maryland Governor Larry Hogan, however, typically secure less than 10 percent of the GOP primary vote in most polls.",
    "author": "Andrew Stanton",
    "title": "Adam Kinzinger Says He 'Would Love' to Run Against Donald Trump"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 163,
    "mediaId": 312,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "In February, she earned the ire of Senate Minority Leader Mitch McConnell after she participated in a conference organized by a white nationalist, and in October, she drew criticism for announcing, on the House floor, that her moderate Republican colleague Rep. <span class='selected-term'>Liz Cheney</span> was a joke? for participating in an investigation of the Jan. 6 Capitol attack, which Greene has been accused of helping to incite.",
    "author": "Nik Popli",
    "title": "One of Marjorie Taylor Greene's Primary Challengers is Raking in Republican Cash"
  },
  {
    "id": 2766,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": ": Per the WaPo story, Rep. <span class='selected-term'>LIZ CHENEY</span>'s (R-Wyo.)",
    "author": "",
    "title": "POLITICO Playbook PM: McCarthy gets a lifeline (and another leak)"
  },
  {
    "id": 141,
    "mediaId": 163,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "One thing is certain: Trump will make the final decisions and will surely spend money to defeat Republicans like <span class='selected-term'>Liz Cheney</span> who voted to impeach him following the Jan. 6, 2020 assault by his supporters on the U.S. Capitol, the sources said.",
    "author": "Alexandra Ulmer",
    "title": "Exclusive: Trump weighs how deeply to dig into his war chest for midterms"
  },
  {
    "id": 142,
    "mediaId": 881,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Just two days after the attack on the Capitol, McCarthy told other top House Republicans, including then-conference chair Rep. <span class='selected-term'>Liz Cheney</span>, that he was seriously considering? having a conversation with Trump to urge the president to resign.",
    "author": "Paul Blest",
    "title": "Kevin McCarthy Is Now Straight-Up Lying About Wanting Trump to Resign"
  },
  {
    "id": 134,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "AUGUST 16\nStates holding primaries: Alaska, Wyoming\nKey races to watch: In Wyoming, Representative <span class='selected-term'>Liz Cheney</span>, the most visible anti-Trump Republican in Congress, faces Trump-endorsed GOP activist Harriet Hageman.",
    "author": "Steve Friess",
    "title": "These Are Key Races to Watch In Every State Primary This Election Season"
  },
  {
    "id": 128,
    "mediaId": 237,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Just a few weeks later, McCarthy was in Mar-a-Lago meeting with Trump and declaring that the former president's popularity has never been stronger.? He endorsed a primary challenger to Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming over her criticism of Trump, but not to Gaetz, Greene, or any of the other GOP caricatures he privately criticized.",
    "author": "Zachary Faria",
    "title": "McCarthy's spinelessness bodes ill for future of the House GOP"
  },
  {
    "id": 2,
    "mediaId": 163,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "* Versus U.S. Representative <span class='selected-term'>Liz Cheney</span>\n* Aug. 16 Wyoming at-large-district Republican primary\nTrump threw his backing behind Hageman, a land-use lawyer, in September 2021, looking to punish Cheney, who was stripped of her role as the No.",
    "author": "Reuters",
    "title": "Factbox: Trump's endorsement power faces test in key elections"
  },
  {
    "id": 108,
    "mediaId": 151,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Bush last year appeared at a fundraiser for Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "George W. Bush to appear at fundraiser for Trump nemesis Kemp"
  },
  {
    "id": 105,
    "mediaId": 223,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "And, in the GOP House primary race in Wyoming, he has backed attorney Harriet Hageman over Rep. <span class='selected-term'>Liz Cheney</span>, the most prominent Republican in Congress to vote for Trump's second impeachment.",
    "author": "Salena Zito",
    "title": "Why Georgia Gov. Kemp Tops the Polls Despite Trump's Bid to Take Him Down"
  },
  {
    "id": 89,
    "mediaId": 195,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "And perhaps most prominently in Wyoming, Rep. <span class='selected-term'>Liz Cheney</span> (R) is in the fight for her political life in a primary against Trump-backed attorney Harriet Hageman later in August.",
    "author": "Tal Axelrod",
    "title": "Pro-Trump candidates look to harness populist energy after Ohio"
  },
  {
    "id": 3301,
    "mediaId": 238,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "America Rising did opposition research work in 2021 for Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Josh Dawsey",
    "title": "More Republicans are working to undermine Trump endorsements"
  },
  {
    "id": 7288,
    "mediaId": 136,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "The former president has endorsed a number of their challengers, including Harriet Hageman, who is running against U.S. Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, one of Trump's most outspoken critics in the Republican Party.",
    "author": "Daniel Bush",
    "title": "Georgia Primaries Will Test Trump's Revenge Campaign Against GOP Incumbents"
  },
  {
    "id": 7289,
    "mediaId": 129,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "One ad flashes a tweet from Donald Trump Jr. in 2021  back when his father still liked Mr. Brooks  calling Ms. Britt the Alabama <span class='selected-term'>Liz Cheney</span>.",
    "author": "",
    "title": "Democrats are mindful of headwinds in Georgia, and everywhere else."
  },
  {
    "id": 7294,
    "mediaId": 129,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Bret: Whatever happens to <span class='selected-term'>Liz Cheney</span>  and things don't look great for her right now  she's earned her own chapter in some future sequel to John F. Kennedy's Profiles in Courage.",
    "author": "",
    "title": "The Depp-Heard Trial Isn't Even the Weirdest Thing About America Right Now"
  }
]