[
  {
    "id": 806,
    "mediaId": 169,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "It would have been an odd scene just a few years ago: Congressional Democrats lining up to greet and exchange kind words with former vice president Dick Cheney, who along with his daughter, Rep. <span class='selected-term'>Liz Cheney</span>, were the only two Republican members present for an event held at the U.S. Capitol Thursday to commemorate the attempted Jan. 6 insurrection.",
    "author": "Brett Bachman",
    "title": "Democrats embrace Dick Cheney during Jan. 6 remembrance event"
  },
  {
    "id": 726,
    "mediaId": 19,
    "date": "1/29/2022 12:00:00 AM",
    "sentence": "I. Lewis Scooter? Libby, former chief of staff to Vice President Richard Cheney, is reportedly planning to attend a fundraiser in March for embattled Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), who is targeting Trump on the January 6 Committee.",
    "author": "Joel B. Pollak",
    "title": "Report: Scooter' Libby, Pardoned by Trump, to Attend Liz Cheney Fundraiser"
  },
  {
    "id": 719,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "Repeated attacks by former President Donald Trump as he tries to oust Rep. <span class='selected-term'>Liz Cheney</span> from Congress are fueling a massive fundraising haul by the Republican lawmaker from Wyoming.",
    "author": "Paul Steinhauser",
    "title": "Liz Cheney hauls in over $7 million last year as she fends off push by Trump to oust her from Congress"
  },
  {
    "id": 698,
    "mediaId": 21,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Former President George W. Bush gave the maximum allowed political contributions to Wyoming Rep. <span class='selected-term'>Liz Cheney</span> and Alaska Sen. Lisa Murkowski, two Republicans who supported impeaching former President Donald Trump over the January 6 Capitol riot.",
    "author": "Bryan Metzger",
    "title": "George W. Bush maxes out political donations to Trump impeachment supporters Liz Cheney and Lisa Murkowski"
  },
  {
    "id": 701,
    "mediaId": 195,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Former President George W. Bush gave money to the reelection campaigns of Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Max Greenwood",
    "title": "Ex-President Bush backs two high-profile Republicans slammed by Trump"
  },
  {
    "id": 705,
    "mediaId": 151,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "| Getty Images\nBy Brittany Gibson\n 01/31/2022 08:23 PM EST\nFormer President George W. Bush contributed to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "George W. Bush sends cash to GOP impeachment voters facing challengers"
  },
  {
    "id": 706,
    "mediaId": 129,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Mr. Bush made one other symbolic donation: the legal maximum of $5,800 to Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, one of the most outspoken anti-Trump Republicans in Congress.",
    "author": "",
    "title": "Billionaires and Big Checks Shape Battle for Congress"
  },
  {
    "id": 708,
    "mediaId": 188,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "It's worth noting that <span class='selected-term'>Liz Cheney</span> is the daughter of Bush's longtime vice president, Dick Cheney.",
    "author": "Phil Shiver",
    "title": "George W. Bush donates to GOP lawmakers who voted to impeach Trump after Jan. 6 riot"
  },
  {
    "id": 678,
    "mediaId": 65,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Campaign finance reports, first reported by Politico, show that Bush donated thousands of dollars to Republicans Rep. <span class='selected-term'>Liz Cheney</span> and Sen. Lisa Murkowski in 2021.",
    "author": "Andrew Mark Miller",
    "title": "George W. Bush donated thousands to Trump impeachment supporters Cheney, Murkowski"
  },
  {
    "id": 686,
    "mediaId": 237,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Here are some highlights from 2021 fourth-quarter fundraising, covering October through the end of December and 2021 as a whole:\n<span class='selected-term'>Liz Cheney</span> out-raises Trump-endorsed challenger Harriet Hageman\nThe Republican congresswoman is Public Enemy No.",
    "author": "Emily Brooks",
    "title": "Fundraising highlights: GOP rakes in dough and Trump foes show strength"
  },
  {
    "id": 397,
    "mediaId": 43,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "Some had stated their objections to the unwarranted invasion, but almost none, save Adam Kinzinger and <span class='selected-term'>Liz Cheney</span>, have spoken out about Trump's disloyalty.",
    "author": "",
    "title": "None Dare Call It Treason"
  },
  {
    "id": 382,
    "mediaId": 195,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "Just two Republicans, Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Niall Stanage",
    "title": "The Memo: Boebert's antics blasted as another twist in politics' downward spiral"
  },
  {
    "id": 333,
    "mediaId": 558,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "The event was held to raise funds for <span class='selected-term'>Liz Cheney</span>, the Wyoming Republican whose opposition to Donald Trump over his attempt to overturn his election defeat and the January 6 riot has attracted a far-right challenger backed by the former president and the House Republican leader, Kevin McCarthy, in her primary this year.",
    "author": "Martin Pengelly",
    "title": "Mitt Romney warns of extraordinary challenge' in preserving democracy"
  },
  {
    "id": 259,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Last month, when Stefanik endorsed a primary opponent of Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, whose GOP leadership post she now holds, Stefanik went above and beyond to turn the knife.",
    "author": "",
    "title": "Elise Stefanik is the human embodiment of how the GOP went down the tubes"
  },
  {
    "id": 207,
    "mediaId": 195,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Campaign\nRep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Mychael Schnell",
    "title": "Cheney sets personal fundraising record"
  },
  {
    "id": 209,
    "mediaId": 209,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "The <span class='selected-term'>Liz Cheney</span> campaign is holding on quite well, it seems.",
    "author": "Brigid Kennedy",
    "title": "Liz Cheney rakes in cash in fight against Trump-backed challenger"
  },
  {
    "id": 210,
    "mediaId": 151,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "POLITICO Playbook: SCOOP: <span class='selected-term'>Liz Cheney</span>'s record fundraising haul\nBy RYAN LIZZA and EUGENE DANIELS\n04/11/2022 06:29 AM EDT\nPresented by\nDRIVING THE DAY\nFIRST IN PLAYBOOK  Rep. LIZ CHENEY has set another personal fundraising record.",
    "author": "",
    "title": "POLITICO Playbook: SCOOP: Liz Cheney's record fundraising haul"
  },
  {
    "id": 215,
    "mediaId": 118,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Noah Y. Kim",
    "title": "Liz Cheney Is Getting a Ton of MoneyFrom People Who Can't Vote for Her"
  },
  {
    "id": 108,
    "mediaId": 151,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Bush last year appeared at a fundraiser for Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "George W. Bush to appear at fundraiser for Trump nemesis Kemp"
  },
  {
    "id": 104,
    "mediaId": 239,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "Earlier this year, Mr. Bush donated to Republican Sen. Lisa Murkowski of Alaska and Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming.",
    "author": "Haris Alic",
    "title": "George W. Bush to headline $5K-a-head fundraiser for Trump foe Brian Kemp"
  }
]