[
  {
    "id": 729,
    "mediaId": 19,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Venture capitalist and Republican megadonor Peter Thiel on Wednesday hosted a fundraiser for Democrat-allied Rep. <span class='selected-term'>Liz Cheney</span>'s (R-WV) primary opponent, Harriet Hageman.",
    "author": "Wendell Husebø",
    "title": "Big Money Donor Peter Thiel Hosts Fundraiser for Liz Cheney's Primary Opponent, Harriet Hageman"
  },
  {
    "id": 480,
    "mediaId": 25,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Trending News\n U.S. proposes limiting consideration of public benefits for green cards\n Russia expels U.S. embassy's second-in-command amid Ukraine tensions\n All members of Congress can attend State of the Union address, with restrictions\n Kevin McCarthy backs <span class='selected-term'>Liz Cheney</span>'s primary challenger Harriet Hageman\n Information warfare expert says U.S. is finally countering Russia at its own game\n Eleanor Watson\nCBS News reporter covering the Pentagon.",
    "author": "Eleanor Watson",
    "title": "Reports of sexual assault at U.S. military academies rose over the past year"
  },
  {
    "id": 220,
    "mediaId": 21,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "GOP Rep. <span class='selected-term'>Liz Cheney</span> on Sunday said House Minority Leader Kevin McCarthy has put his own political ambitions first and failed to defend democracy.",
    "author": "Sarah Al-Arshani",
    "title": "Rep. Liz Cheney says GOP leader Kevin McCarthy has failed to defend democracy at home after he backed Ukraine in Poland"
  },
  {
    "id": 155,
    "mediaId": 32,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Jabin Botsford | The Washington Post | Getty Images\nRep. <span class='selected-term'>Liz Cheney</span> on Friday denied recording or leaking audio from a phone call that appears to show House Minority Leader Kevin McCarthy saying he would tell then-President Donald Trump to resign after the Jan. 6 Capitol riot.",
    "author": "Kevin Breuninger",
    "title": "Liz Cheney denies recording bombshell tape of Kevin McCarthy saying he would urge Trump to resign after Jan. 6 riot"
  },
  {
    "id": 3376,
    "mediaId": 19,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "During the rally, Arrington compared Mace to Never Trump Rep. <span class='selected-term'>Liz Cheney</span> (R-WY).",
    "author": "Sean Moran",
    "title": "Report: Crazy Erratic' Nancy Mace Would Often Lambast Donald Trump"
  }
]