[
  {
    "id": 859,
    "mediaId": 195,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "Wyoming's At-Large Congressional District\nWyoming's at-large House seat, currently held by Rep. <span class='selected-term'>Liz Cheney</span> (R), is in safe Republican hands.",
    "author": "Tal Axelrod",
    "title": "Eleven interesting races to watch in 2022"
  },
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "And Rep. <span class='selected-term'>Liz Cheney</span>, the Republican vice-chair of the House Select Committee probing the January 6 insurrection, will face Trump-backed Harriet Hageman in Wyoming's at-large House seat.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP"
  },
  {
    "id": 748,
    "mediaId": 19,
    "date": "1/22/2022 12:00:00 AM",
    "sentence": "Kristi Noem, and Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) saw two percent support or less:\nGOP Presidential Polling:\nTrump: 53%\nDeSantis: 13%\nPence: 9%\nHaley: 4%\nRomney: 3%\nOwens: 2%\nRubio: 2%\nMcLaughlin / January 18, 2022 / n=468 / Onlinehttps://t.co/OnEooPIlLn\n Polling USA (@USA_Polling) January 19, 2022\nThe field shakes up rather significantly, though, when Trump is taken out of the mix and replaced with his son, Donald Trump Jr.",
    "author": "Hannah Bleau",
    "title": "Poll: Donald Trump Sees 40-Point Lead in Hypothetical GOP Primary"
  },
  {
    "id": 476,
    "mediaId": 151,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "In Alaska, state Republican Party leaders have endorsed a primary challenge to the state's incumbent senator, Lisa Murkowski, while GOP officials in Wyoming have disowned their incumbent congresswoman, Rep. <span class='selected-term'>Liz Cheney</span>.",
    "author": "",
    "title": "GOP plunges into season of self-hate' that will rewire the party"
  },
  {
    "id": 442,
    "mediaId": 238,
    "date": "2/19/2022 12:00:00 AM",
    "sentence": "), Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "",
    "title": "The top 10 GOP presidential candidates for 2024, ranked"
  },
  {
    "id": 384,
    "mediaId": 151,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "And the true measure of Trump's influence on the Republican primaries won't come until more prominent politicians he's marked for extinction come up in other states  people like Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming and Gov.",
    "author": "",
    "title": "The establishment strikes back: 5 takeaways from the Texas primary"
  },
  {
    "id": 386,
    "mediaId": 25,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Biden's low approvals worry Democrats campaigning in midterm elections\n Trump's response to Putin's invasion of Ukraine reveals GOP fissures\n Democrats seize on GOP Senator Rick Scott's plan to tax more Americans\n Congressman Colin Allred discusses Democrats' midterm prospects\n Kevin McCarthy backs <span class='selected-term'>Liz Cheney</span>'s primary challenger Harriet Hageman\n More\nIn:\ntexas\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "CBS News projects Abbott and O'Rourke win Texas primaries and will face off in November"
  },
  {
    "id": 387,
    "mediaId": 129,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, Senator Lisa Murkowski of Alaska and Republicans who voted for impeachment from Michigan, South Carolina and Washington State are all vulnerable and the subject of Mr. Trump's obsession.",
    "author": "",
    "title": "Takeaways From the Texas Primary Elections"
  },
  {
    "id": 355,
    "mediaId": 43,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "However well-known Republican never-Trumpers such as Rep. <span class='selected-term'>Liz Cheney</span>, Sen. Lisa Murkowski, and Rep. Adam Kinzinger, as well as Republican moderates who have been less outspoken about Trump like Sen. Mitt Romney, might very well run against him.",
    "author": "",
    "title": "If Cheney and Murkowski run against Trump they won't win but will hurt him by tying him to Putin"
  }
]