[
  {
    "id": 856,
    "mediaId": 718,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "Our campaign looks forward to educating voters on how Rodney is an effective conservative member of Congress and Mary is not.?\nMiller, in her release, also noted her efforts to throw out of the House Republican conference Rep. Adam Kinzinger, R-Ill., and Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "Lynn Sweet",
    "title": "Trump jumps into Illinois politics, endorsing Rep. Mary Miller over Rep. Rodney Davis"
  },
  {
    "id": 828,
    "mediaId": 718,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Kinzinger and Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "Lynn Sweet",
    "title": "Rep. Kinzinger to focus on fighting right-wing extremism, won't run for governor or Senate"
  },
  {
    "id": 73,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Leading the pack was Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who pulled in more than $1.97 million during the last three months of 2021, bringing her yearly total to nearly $6.5 million.",
    "author": "",
    "title": "Overnight News Digest February 1, 2022"
  },
  {
    "id": 711,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Too bad Republicans missed their opportunity to convict Trump and do away with him forever or, as GOP Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming put it, \"made themselves willing hostages\" to a man who just fessed up to trying to stage a coup.",
    "author": "",
    "title": "Trump's endorsement ad of David Perdue is perfectly divisive and comically awful"
  },
  {
    "id": 63,
    "mediaId": 151,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "House Republicans close money gap in hunt for the majority"
  },
  {
    "id": 683,
    "mediaId": 65,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Also grabbing plenty of attention is a proposed resolution that would endorse removing from the House Republican Conference Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois  two vocal Donald Trump critics who voted to impeach the then-president and the only two Republicans sitting on a Democratic- dominated House select committee investigating the deadly Jan. 6, 2021, attack on the U.S. Capitol.",
    "author": "Paul Steinhauser",
    "title": "2024 debates, convention city, primary calendar on RNC winter meeting agenda"
  },
  {
    "id": 684,
    "mediaId": 112,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "He is actively trying to defeat his colleagues and no longer believes in our shared conservative Republican values.?\nFrom the archives (November 2021): Wyoming Republicans vote that <span class='selected-term'>Liz Cheney</span> is no longer a member of their party\nKinzinger, a 43-year-old military pilot, addressed his new strategy publicly for the first time in an interview with The AP on Tuesday  almost exactly one year after launching his political organization Country First, which aims to purge Trump from the GOP.",
    "author": "Associated Press",
    "title": "Adam Kinzinger advocates uneasy alliance' to thwart Trump and his allies in upcoming Republican primaries"
  },
  {
    "id": 669,
    "mediaId": 237,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "The Republican National Committee is set to vote on a resolution Friday to censure Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "Ryan King",
    "title": "RNC censure resolution against Cheney and Kinzinger advances"
  },
  {
    "id": 589,
    "mediaId": 43,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. <span class='selected-term'>Liz Cheney</span>, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. Madison Cawthorn, Lauren Boebert, and Paul Gosar ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump is the worst president the U.S. ever had'"
  },
  {
    "id": 490,
    "mediaId": 193,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "This cringe-worthy incident occurred just days after the Republican National Committee censured Wyoming Congresswoman <span class='selected-term'>Liz Cheney</span> and Illinois Rep. Adam Kinzinger for participating in the persecution of ordinary citizens engaged in legitimate political discourse.? The aforementioned good citizens were those who tried to sack the U.S. Capitol in hopes of reversing the election.",
    "author": "Krista Kafer",
    "title": "Kafer: In a promising year for GOP candidates, don't let the weak links spoil it"
  },
  {
    "id": 429,
    "mediaId": 43,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "Related articles:\nMore bad news for Trump: His hand-picked gubernatorial candidate in Georgia is flopping\n<span class='selected-term'>Liz Cheney</span> and other Trump targets trounce his endorsees in the fundraising race\nIt's starting to occur to Trump that some of his endorsements have proven subpar\nThis is a short blurb about Daily Kos.",
    "author": "",
    "title": "Two Republicans who certified 2020 are winning money race against two"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Hours later, Mr. McCarthy did what the fringe wanted: He endorsed the woman running in Wyoming's Republican primary to oust the far right's archnemesis, Representative <span class='selected-term'>Liz Cheney</span>, a former member of his leadership team who has earned pariah status in her party by speaking out against former President Donald J. Trump and the deadly attack on the Capitol that he helped inspire with lies of a stolen election.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 368,
    "mediaId": 65,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Stefanik also made one endorsement in the Senate for GOP candidate Jane Timken in Ohio and last month joined House GOP Leader Kevin McCarthy, R-Calif., in taking the rare step of backing a primary challenger to a GOP colleague when they endorsed Harriet Hageman in her race against Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming.",
    "author": "",
    "title": "Elise Stefanik unveils new endorsements for 2022 midterm elections"
  },
  {
    "id": 38,
    "mediaId": 237,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "McCarthy asserted that he is largely standing by incumbents in their races, with the exception of endorsing against Wyoming Rep. <span class='selected-term'>Liz Cheney</span> due to her decision to join the select committee tasked with investigating the Jan. 6 Capitol riot.",
    "author": "Juliegrace Brufke",
    "title": "Kevin McCarthy not worried about Trump endorsements in GOP primaries"
  },
  {
    "id": 297,
    "mediaId": 21,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "More than 100 House Republicans are set to cohost a fundraiser for Harriet Hageman, the leading primary challenger against GOP Rep. <span class='selected-term'>Liz Cheney</span>, according to Politico.",
    "author": "John L. Dorman",
    "title": "More than 100 House Republicans will cohost a fundraiser for Rep. Liz Cheney's leading primary challenger"
  },
  {
    "id": 251,
    "mediaId": 124,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50: The number of House Republicans who attended a fundraiser last night for Harriet Hageman, the Republican (who is endorsed by former President Donald Trump) challenging Wyoming GOP Rep. <span class='selected-term'>Liz Cheney</span>, per NBC's Vaughn Hillyard.",
    "author": "",
    "title": "Potential new border surge presents one more challenge for Biden administration"
  },
  {
    "id": 254,
    "mediaId": 25,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50 House Republicans were at a Washington, D.C., fundraiser on Wednesday night for Harriet Hageman, Rep. <span class='selected-term'>Liz Cheney</span>'s challenger in Wyoming.",
    "author": "Aaron Navarro",
    "title": "Over 50 House Republicans attend fundraiser for Liz Cheney's challenger, Harriet Hageman"
  },
  {
    "id": 179,
    "mediaId": 237,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "He joined the House committee investigating the Capitol riot alongside GOP Rep. <span class='selected-term'>Liz Cheney</span> and has regularly berated the former president's efforts to overturn the 2020 election.",
    "author": "Ryan King",
    "title": "Kinzinger toys with primary challenge against Trump in 2024"
  },
  {
    "id": 180,
    "mediaId": 136,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Anti-Trump Republicans including Kinzinger, Wyoming Representative <span class='selected-term'>Liz Cheney</span> and Maryland Governor Larry Hogan, however, typically secure less than 10 percent of the GOP primary vote in most polls.",
    "author": "Andrew Stanton",
    "title": "Adam Kinzinger Says He 'Would Love' to Run Against Donald Trump"
  },
  {
    "id": 182,
    "mediaId": 21,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "But if he were to run for president as a Republican, he would be running for the nomination of a party that has censured him and Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming for participating in the House Select Committee investigating the January 6 attack on the US Capitol.",
    "author": "Bryan Metzger",
    "title": "Republican Rep. Adam Kinzinger says he 'would love' to run against Trump in 2024 'even if he crushed me'"
  },
  {
    "id": 172,
    "mediaId": 223,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "But there's no grand plan right now.?\nSkalka, to her credit, also acknowledges that Kinzinger appears to be obsessed with the former president, especially when it comes to his vote in favor of Trump's second impeachment and the fact that Kinzinger is one of only two Republicans to serve on the January 6 Select Commitee, along with fellow RINO Rep. <span class='selected-term'>Liz Cheney</span> (R-WY).",
    "author": "Rebecca Downs",
    "title": "Is He a Masochist? Kinzinger Says It Would Be 'Fun' to Run Against Trump in 2024, Even If He Gets 'Crushed'"
  }
]