[
  {
    "id": 742,
    "mediaId": 195,
    "date": "1/23/2022 12:00:00 AM",
    "sentence": "\"I heard and believed the lies the Democrats and <span class='selected-term'>Liz Cheney</span>'s friends in the media were telling at the time, but that is ancient history as I quickly realized that their allegations against President Trump were untrue,\" she said.",
    "author": "Joseph Choi -",
    "title": "Cheney challenger wins Wyoming Republican activists' straw poll"
  },
  {
    "id": 745,
    "mediaId": 19,
    "date": "1/23/2022 12:00:00 AM",
    "sentence": "Wyoming Republican Harriet Hageman, endorsed by former President Donald Trump, showed a commanding lead against the Democrat-allied Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) in a Saturday straw poll full of House candidates held by the Wyoming Republican State Central Committee.",
    "author": "Jacob Bliss",
    "title": "Liz Cheney Loses Wyoming Straw Poll to Trump-Backed Harriet Hageman"
  },
  {
    "id": 544,
    "mediaId": 124,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "WASHINGTON  House Speaker Nancy Pelosi, D-Calif., said Wednesday that it was \"disturbing\" to see video of House Minority Leader Kevin McCarthy, R-Calif., walking away from the press when asked about the Republican National Committee's resolution censuring GOP Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "",
    "title": "Pelosi rips McCarthy for walking away, declining to comment on RNC censure resolution"
  },
  {
    "id": 521,
    "mediaId": 163,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "Feb 11 (Reuters) - When Idaho nurse Joan West received a fundraising mailer from U.S. Representative <span class='selected-term'>Liz Cheney</span>, she saw a way to address her regret for having voted for Donald Trump in 2016 and her worry about the future of U.S. democracy: She wrote a $500 check.",
    "author": "Nathan Layne",
    "title": "Surge of out-of-state donors boost Trump critic Cheney's campaign -but cannot vote for her"
  },
  {
    "id": 524,
    "mediaId": 593,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "When Idaho nurse Joan West received a fundraising mailer from U.S. Representative <span class='selected-term'>Liz Cheney</span>, she saw a way to address her regret for having voted for Donald Trump in 2016 and her worry about the future of U.S. democracy: She wrote a $500 check.",
    "author": "Nathan Layne",
    "title": "Surge Of Out-of-state Donors Boost Trump Critic Cheney's Campaign -but Cannot Vote For Her"
  },
  {
    "id": 461,
    "mediaId": 151,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Some Republicans believe House Minority Leader Kevin McCarthy's actions against Rep. <span class='selected-term'>Liz Cheney</span>  or silence when the party moves to punish her  undermine his claim that the GOP is a big tent? party.",
    "author": "",
    "title": "McCarthy picks his path on Cheney: Try to boot her from Congress"
  },
  {
    "id": 464,
    "mediaId": 233,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "WASHINGTON  House Minority Leader Kevin McCarthy, R-Calif., on Thursday endorsed Harriet Hageman, a primary challenger to GOP Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, the latest skirmish between Cheney and her party over her forceful criticism of former President Donald Trump.",
    "author": "Dylan Wells",
    "title": "House GOP leader Kevin McCarthy endorses Liz Cheney challenger in continuing fallout over Trump"
  },
  {
    "id": 481,
    "mediaId": 129,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Representative Kevin McCarthy, the House Republican leader, on Thursday endorsed Representative <span class='selected-term'>Liz Cheney</span>'s G.O.P.",
    "author": "",
    "title": "Kevin McCarthy Backs Liz Cheney's Challenger, Escalating a Party Feud"
  },
  {
    "id": 486,
    "mediaId": 25,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-CA) whispers to Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) during a House Republican Leadership news conference in the U.S. Capitol on February 24, 2021 in Washington, DC.",
    "author": "Robert Costa",
    "title": "House GOP Leader Kevin McCarthy backs Liz Cheney's primary challenger Harriet Hageman"
  },
  {
    "id": 295,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "\"A leader with honor would be rejecting -- not protecting -- the pro-Putin, anti-Semitic, white nationalist members of the party, instead of fighting against <span class='selected-term'>Liz Cheney</span> for telling the truth,\" Jeremy Adler, Cheney's spokesman, said in a statement to CNN.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  }
]