[
  {
    "id": 843,
    "mediaId": 169,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Wyoming state Sen. Anthony Bouchard, who is running to unseat Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., earlier this year suggested executing White House chief medical adviser Dr. Anthony Fauci, which the state's Democratic Party reported to the FBI.",
    "author": "Igor Derysh",
    "title": "Meet the scariest Republican candidates of 2022: It wasn't easy to pick 'em"
  },
  {
    "id": 85,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Liz Cheney</span> of Wyoming has gone from a star in the House Republican leadership to an exiled party gadfly and truth teller.",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6"
  },
  {
    "id": 77,
    "mediaId": 195,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "And Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "Cristina Marcos",
    "title": "The fates of the 10 House Republicans who voted to impeach Trump"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>\nWyoming's lone representative voted with Trump's position an estimated 93% of the time while he was in office, but she became a vocal critic of his actions leading up to and during the Jan. 6 riot and his efforts to overturn the results of the 2020 presidential election.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 68,
    "mediaId": 163,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Representative Elise Stefanik, who replaced Representative <span class='selected-term'>Liz Cheney</span> as the No.",
    "author": "Alexandra Ulmer",
    "title": "Republican U.S. lawmakers funnel money to colleagues who crossed Trump"
  },
  {
    "id": 70,
    "mediaId": 881,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Trump antagonist and Wyoming Rep. <span class='selected-term'>Liz Cheney</span> hauled in $2 million in the last three months, a massive haul for a House race in an off-year election, and has $4.7 million in the bank.",
    "author": "Cameron Joseph",
    "title": "Trump's Favorite Candidates Are Getting Crushed in Fundraising"
  },
  {
    "id": 73,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Leading the pack was Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who pulled in more than $1.97 million during the last three months of 2021, bringing her yearly total to nearly $6.5 million.",
    "author": "",
    "title": "Overnight News Digest February 1, 2022"
  },
  {
    "id": 64,
    "mediaId": 124,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Leading the pack was Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who pulled in more than $1.97 million during the last three months of 2021, bringing her yearly total to nearly $6.5 million.",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul"
  },
  {
    "id": 690,
    "mediaId": 129,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "In Wyoming, Representative <span class='selected-term'>Liz Cheney</span>, who was all but exiled by her party for bluntly condemning Mr. Trump's false election claims and has emerged as one of the lead lawmakers on the special committee investigating the Jan. 6 attack, raked in $2 million during the last quarter, entering 2022 with nearly $5 million in cash on hand.",
    "author": "",
    "title": "Republicans Who Voted to Impeach Trump Out-Raised Primary Rivals"
  },
  {
    "id": 61,
    "mediaId": 165,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "William Vaillancourt",
    "title": "Republicans Who Voted to Impeach Trump Are Fundraising Laps Around Their MAGA Primary Opponents"
  },
  {
    "id": 609,
    "mediaId": 19,
    "date": "2/5/2022 12:00:00 AM",
    "sentence": "For the 2022 midterms, nearly 100 Republican lawmakers have accepted donations from the Koch Industries PAC, including Reps. <span class='selected-term'>Liz Cheney</span> (R-WY), Jeff Duncan (R-SC), Don Bacon (R-NE), Tony Gonzalez (R-TX), Adam Kinzinger (R-IL), Ashley Hinson (R-IA), Julia Letlow (R-LA), Jackie Walorski (R-IN), Garret Graves (R-LA), Jim Banks (R-IN), Byron Donalds (R-FL), Yvette Herrell (R-NM), and Jim Jordan (R-OH), among others.",
    "author": "John Binder",
    "title": "Axios: Breitbart News Readers, Trump's Small-Dollar Donors Steer Modern' GOP as Corporate Class Fades"
  },
  {
    "id": 497,
    "mediaId": 129,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "The fund-raiser at Mr. Thiel's Miami Beach compound last month was for a conservative candidate challenging Representative <span class='selected-term'>Liz Cheney</span> of Wyoming for a spot on the ballot in November's midterm elections.",
    "author": "",
    "title": "The Right's Would-Be Kingmaker"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "All face challenging roads to reelection, particularly Rep. <span class='selected-term'>Liz Cheney</span>, the most outspoken of them, who has enraged so many Wyoming Republicans that they are plotting to alter state election laws to cut off one potential route to political survival.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Hours later, Mr. McCarthy did what the fringe wanted: He endorsed the woman running in Wyoming's Republican primary to oust the far right's archnemesis, Representative <span class='selected-term'>Liz Cheney</span>, a former member of his leadership team who has earned pariah status in her party by speaking out against former President Donald J. Trump and the deadly attack on the Capitol that he helped inspire with lies of a stolen election.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>'s (R-Wyo.)",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 20,
    "mediaId": 124,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "\"If you're a Republican running in a swing seat, are you a little annoyed that a bunch of money is going to be wasted on <span class='selected-term'>Liz Cheney</span> in a Republican seat instead of winning those swing seats that will get us a majority in the House?\"",
    "author": "",
    "title": "Trump is sitting on a fortune. Republicans want it for the midterms."
  },
  {
    "id": 225,
    "mediaId": 129,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Liz Cheney</span>, the Wyoming Republican and frequent Trump critic, describes it as the Putin wing of the G.O.P.? It both admires him as a strong leader and likes his right-wing nationalism, including his opposition to NATO, Western liberalism and L.G.B.T.",
    "author": "",
    "title": "The G.O.P.'s Putin Wing'"
  },
  {
    "id": 186,
    "mediaId": 129,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "You are doing great!? he wrote last October to Harriet Hageman, who is challenging Representative <span class='selected-term'>Liz Cheney</span> of Wyoming.",
    "author": "",
    "title": "Mar-a-Lago Machine: Trump as a Modern-Day Party Boss"
  },
  {
    "id": 11,
    "mediaId": 376,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, who was ousted from the House GOP leadership for refusing to support Trump's false claim of widespread fraud in the 2020 election, raised more than $2.9 million and finished the quarter with $6.8 million.",
    "author": "Herb Jackson",
    "title": "Trump targets outraise challengers, unlike some other incumbents"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Wyoming's At-Large Congressional District Rep. <span class='selected-term'>Liz Cheney</span> (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising"
  },
  {
    "id": 2,
    "mediaId": 163,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "* Versus U.S. Representative <span class='selected-term'>Liz Cheney</span>\n* Aug. 16 Wyoming at-large-district Republican primary\nTrump threw his backing behind Hageman, a land-use lawyer, in September 2021, looking to punish Cheney, who was stripped of her role as the No.",
    "author": "Reuters",
    "title": "Factbox: Trump's endorsement power faces test in key elections"
  },
  {
    "id": 95,
    "mediaId": 33,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Thiel himself also hosted a fundraiser for Hageman, the Wyoming GOP hopeful who is looking to unseat Rep. <span class='selected-term'>Liz Cheney</span>, at his Miami Beach mansion earlier this year that featured Donald Trump Jr. as a guest.",
    "author": "Gabby Orr and Michael Warren",
    "title": "Peter Thiel plans to wind down his involvement in 2022 after Vance's victory in Ohio"
  },
  {
    "id": 3301,
    "mediaId": 238,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "America Rising did opposition research work in 2021 for Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Josh Dawsey",
    "title": "More Republicans are working to undermine Trump endorsements"
  }
]