[
  {
    "id": 80,
    "mediaId": 124,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Rep. Cheney showed great deal of moral courage' on Jan. 6, says Rep. Sherrill\nJan. 6, 202201:17\n\"It's appropriate to point out one person who I think has shown a great deal of moral courage, someone who stood up for her country at great personal cost, and that is <span class='selected-term'>Liz Cheney</span>,\" Sherrill said of the Wyoming congresswoman who is one of two Republicans serving on the House committee investigating the Capitol attack.",
    "author": "",
    "title": "Jan. 6 Capitol riot: Full anniversary coverage"
  },
  {
    "id": 777,
    "mediaId": 19,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Friday's reported reset for Harris is the second reset in two months, and it comes after a New York Times columnist suggested Biden should replace Harris with Democrat-allied Rep. <span class='selected-term'>Liz Cheney</span> (R-WY).",
    "author": "Wendell Husebø",
    "title": "Kamala Harris Resets Political Shitshow', Twice in Two Months"
  },
  {
    "id": 561,
    "mediaId": 233,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "More:GOP censures Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, calls Jan. 6 riot 'legitimate political discourse'\nWith the Senate deadlocked 50-50 between the parties  and controlled by the Democrats because of Vice President Kamala Harris' tie-breaking vote  the Republicans face toss-up Senate elections in places like Pennsylvania, Georgia and Arizona, states that Biden carried.",
    "author": "David Jackson",
    "title": "Mitch McConnell calls Jan. 6 a 'violent insurrection,' hits Republicans for censure of Cheney, Kinzinger"
  },
  {
    "id": 55,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "Though Rep. <span class='selected-term'>LIZ CHENEY</span>'s (R-Wyo.)",
    "author": "",
    "title": "POLITICO Playbook: Harris declares unity,' while Zelenskyy accuses appeasement'"
  },
  {
    "id": 369,
    "mediaId": 65,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Tell us how he's a Putin stooge, Lindsey Graham and David Frum and Anne Applebaum, <span class='selected-term'>Liz Cheney</span>.",
    "author": "",
    "title": "Tucker: We are at war with Russia, whether or not Congress has declared it"
  },
  {
    "id": 217,
    "mediaId": 25,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Trending News\n Some Jan. 6 defendants turn to trial by judge instead of jury\n Biden announces new rule on \"ghost guns\" aimed at preventing gun crimes\n Ukrainian girl taken into U.S. border custody moved to shelter\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n U.S. processed 9,926 undocumented Ukrainians in last 2 months, data show\n Bo Erickson\nBo Erickson is a reporter covering the White House for CBS News Digital.",
    "author": "",
    "title": "Biden announces new rule on \"ghost guns\" aimed at preventing gun crimes"
  }
]