[
  {
    "id": 531,
    "mediaId": 376,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Corrected, 5:49 p.m. | The Republican National Committee's resolution censuring Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois for their membership on the House select committee investigating Jan. 6 has forced Republicans on the Hill to answer some uncomfortable questions and given Democrats a new line of attack in fundraising emails invoking the phrase legitimate political discourse.?\nIt's also led to another back-and-forth between former President Donald Trump and Senate Minority Leader Mitch McConnell of Kentucky, who said this week that the attack on the Capitol was a violent insurrection? and that, historically, party committees have supported members regardless of their positions on some issues.?\nMitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters,? Trump said in a statement Wednesday through his Save America PAC.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley",
    "title": "At the Races: Political diss-course"
  },
  {
    "id": 517,
    "mediaId": 124,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "She also said she backed Rep. <span class='selected-term'>Liz Cheney</span> and hoped she remained in GOP leadership.",
    "author": "",
    "title": "GOP congresswoman shows Republicans can't have it both ways with Trump"
  },
  {
    "id": 406,
    "mediaId": 237,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Many Republicans viewed Youngkin as a model for future candidates and officeholders, somewhere in between <span class='selected-term'>Liz Cheney</span> and Matt Gaetz, both of whose political fortunes are tied one way or another to Trump's standing among voters.",
    "author": "W. James Antle III",
    "title": "Past Trump"
  },
  {
    "id": 385,
    "mediaId": 323,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "But unlike Ms. Mace, most of them voted to impeach the former president and some including Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming have continued to criticize him.",
    "author": "",
    "title": "Nancy Mace Tries to Survive Criticizing Trump"
  },
  {
    "id": 356,
    "mediaId": 19,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "Arrington joined the stage after Fry and took the opportunity to attack Rep. Nancy Mace (R-SC), who she called <span class='selected-term'>Liz Cheney</span> of the South.?\nSo, you know, I have a name for Nancy Mace,? Arrington said.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Katie Arrington and Russell Fry Join Trump on Stage at South Carolina Rally"
  },
  {
    "id": 357,
    "mediaId": 19,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "Speaking over the booing crowd, Trump then hit at <span class='selected-term'>Liz Cheney</span> for her participation on the January 6 committee, which he denounced as a witch hunt.?\nCheney joined the phony narrative about January 6, she voted to hold Steve Bannon in contempt, which was terrible, she's totally manipulated by raging Never Trumpers and the radical left  Democrats that are poisoning our country.",
    "author": "Paul Bois",
    "title": "Trump Blasts Reps. Nancy Mace, Liz Cheney at South Carolina Rally"
  },
  {
    "id": 350,
    "mediaId": 409,
    "date": "3/13/2022 12:00:00 AM",
    "sentence": "A similar dynamic could save Representative <span class='selected-term'>Liz Cheney</span>, a vocal Trump critic, who faces several challengers in her August primary in Wyoming.",
    "author": "John Fund",
    "title": "Democratic Interlopers Could Diminish Trump's Clout in GOP Primaries"
  },
  {
    "id": 340,
    "mediaId": 124,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Elsewhere on the campaign trail:\nPolitico caught up with Wyoming voters to explore how GOP Rep. <span class='selected-term'>Liz Cheney</span> needs support from Democrats and independents to fend off her Trump-backed primary challenger.",
    "author": "",
    "title": "Trump attempts to fix his Putin problem"
  },
  {
    "id": 309,
    "mediaId": 124,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Arrington described Mace as \"the <span class='selected-term'>Liz Cheney</span> of the South,\" invoking the Wyoming Republican who has become the most vocal critic of Trump in the party.",
    "author": "",
    "title": "Trump is trying to oust one of South Carolina's rising GOP stars"
  },
  {
    "id": 11,
    "mediaId": 376,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, who was ousted from the House GOP leadership for refusing to support Trump's false claim of widespread fraud in the 2020 election, raised more than $2.9 million and finished the quarter with $6.8 million.",
    "author": "Herb Jackson",
    "title": "Trump targets outraise challengers, unlike some other incumbents"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 3376,
    "mediaId": 19,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "During the rally, Arrington compared Mace to Never Trump Rep. <span class='selected-term'>Liz Cheney</span> (R-WY).",
    "author": "Sean Moran",
    "title": "Report: Crazy Erratic' Nancy Mace Would Often Lambast Donald Trump"
  }
]