[
  {
    "id": 531,
    "mediaId": 376,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Corrected, 5:49 p.m. | The Republican National Committee's resolution censuring Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois for their membership on the House select committee investigating Jan. 6 has forced Republicans on the Hill to answer some uncomfortable questions and given Democrats a new line of attack in fundraising emails invoking the phrase legitimate political discourse.?\nIt's also led to another back-and-forth between former President Donald Trump and Senate Minority Leader Mitch McConnell of Kentucky, who said this week that the attack on the Capitol was a violent insurrection? and that, historically, party committees have supported members regardless of their positions on some issues.?\nMitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters,? Trump said in a statement Wednesday through his Save America PAC.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley",
    "title": "At the Races: Political diss-course"
  },
  {
    "id": 324,
    "mediaId": 165,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "It opens with the congressman declaring in his speech at the Jan. 6 Stop the Steal rally that America does not need any more weakling, cowering, wimpy Republican congressmen and senators.? After reminding viewers that on Jan. 6 he proudly stood with President Trump in the fight against voter fraud,? Brooks criticized others in his party whom he deems not onboard the MAGA agenda, including Kentucky Sen. Mitch McConnell and Wyoming Rep. <span class='selected-term'>Liz Cheney</span>  both frequent targets of Trump.",
    "author": "William Vaillancourt",
    "title": "MAGA Fave Mo Brooks Drops Groveling Ad to Try to Get Back in Trump's Good Graces"
  },
  {
    "id": 135,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "His fury at Wyoming Representative <span class='selected-term'>Liz Cheney</span>, who voted to impeach him and sits on the House Select Committee investigating the January 6 attack on the U.S. Capitol, led him to endorse her primary opponent, corporate lawyer Harriet Hageman.",
    "author": "Steve Friess",
    "title": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not"
  }
]