[
  {
    "id": 852,
    "mediaId": 25,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "We now turn to the Congressional Committee investigating Jan. 6, Republican <span class='selected-term'>Liz Cheney</span> of Wyoming is the vice chair of the committee, and she joins us now from Capitol Hill.",
    "author": "",
    "title": "Full transcript: Representative Liz Cheney on \"Face the Nation,\" January 2, 2022"
  },
  {
    "id": 848,
    "mediaId": 25,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Liz Cheney</span> said Sunday on \"Face the Nation\" that she expects former President Trump to \"make the same false claims about the election that he knows to be false and the same false claims about the election that he knows caused violence on January 6\" at his event on the one-year anniversary of the attack on the U.S. Capitol.",
    "author": "Caroline Linton",
    "title": "Cheney says House January 6 panel \"will not be deterred\" despite dangers from Trump claims"
  },
  {
    "id": 83,
    "mediaId": 165,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tim Dickinson",
    "title": "Republicans Promised to Banish Jan. 6 Insurrectionists. A Year Later, They've Purged Jan. 6 Critics"
  },
  {
    "id": 85,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Liz Cheney</span> of Wyoming has gone from a star in the House Republican leadership to an exiled party gadfly and truth teller.",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6"
  },
  {
    "id": 828,
    "mediaId": 718,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Kinzinger and Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "Lynn Sweet",
    "title": "Rep. Kinzinger to focus on fighting right-wing extremism, won't run for governor or Senate"
  },
  {
    "id": 834,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "critics, such as Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, who was purged from House leadership for refusing, in her words, to spread his destructive lies? about 2020.",
    "author": "",
    "title": "A Year After Capitol Riot, Trump's Hold on G.O.P. Is Unrivaled"
  },
  {
    "id": 835,
    "mediaId": 33,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Committee Vice Chair <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican, revealed that there was \"firsthand\" testimony that Trump's daughter Ivanka, then a White House official, twice asked her father to call off the rioters.",
    "author": "Stephen Collinson",
    "title": "Call for Pence cooperation shows ambition of January 6 panel ahead of anniversary"
  },
  {
    "id": 811,
    "mediaId": 193,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Instead, she said, there were people defending the insurrectionists and defending Trump and continuing with the challenge and the Big Lie.?\nRep. Adam Kinzinger of Illinois, a Republican who, with Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, has emerged as one of the few GOP anti-Trump critics in Congress, had predicted Trump's hold on the party would be gone? by the summer.",
    "author": "Jill Colvin",
    "title": "Trump maintains grip on GOP despite violent insurrection"
  },
  {
    "id": 821,
    "mediaId": 178,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Rep. Adam Kinzinger of Illinois, a Republican who, with Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, has emerged as one of the few GOP anti-Trump critics in Congress, had predicted Trump's hold on the party would \"be gone\" by the summer.",
    "author": "JILL COLVIN Associated Press",
    "title": "A year after Capitol riot, Trump maintains grip on GOP"
  },
  {
    "id": 796,
    "mediaId": 112,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "I am deeply disappointed at the failure of many members of my party to recognize the grave nature of the January 6 attacks and the ongoing threat to our nation.?\nFrom the archives (November 2021): Wyoming Republicans vote that <span class='selected-term'>Liz Cheney</span> is no longer a member of their party\nKarl Rove, who served as deputy chief of staff in the Bush administration and advised Trump at points during the 2020 campaign, wrote an op-ed in the Wall Street Journal addressing those in his own party who for a year have excused the actions of the rioters who stormed the Capitol, disrupted Congress as it received the Electoral College's results, and violently attempted to overturn the election.?\nThere can be no soft-pedaling what happened and no absolution for those who planned, encouraged and aided the attempt to overthrow our democracy.",
    "author": "Associated Press",
    "title": "Absence, silence, pugnacity: How Republicans marked anniversary of Jan. 6 siege on U.S. Capitol"
  },
  {
    "id": 797,
    "mediaId": 147,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Indeed, during a moment of silence held in honor of law enforcement officers, only two Republicans were present in the House chamber: Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who has become a pariah in her party over her criticism of Trump's actions, and her father, former Vice President Dick Cheney.",
    "author": "Jill Colvin",
    "title": "One year ago, Republicans condemned Jan. 6 insurrection. Yesterday, their response was far more muted."
  },
  {
    "id": 799,
    "mediaId": 12,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Indeed, during a moment of silence held in honor of law enforcement officers, only two Republicans were present in the House chamber: Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who has become a pariah in her party over her criticism of Trump's actions, and her father, former Vice President Dick Cheney.",
    "author": "JILL COLVIN",
    "title": "Top Republicans mark Jan. 6 with silence, deflection"
  },
  {
    "id": 801,
    "mediaId": 19,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) claimed Thursday on Fox News' Special Report that she is the ranking member? of the U.S. House Select Committee on the January 6 Attack, in an apparent effort to defend the committee's subpoenas against legal challenges.",
    "author": "Joel B. Pollak",
    "title": "Liz Cheney Claims She is Ranking Member' of January 6 Committee"
  },
  {
    "id": 786,
    "mediaId": 409,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "It is worrisome on its face that partisan interest so overwhelms honesty that <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger are somehow controversial for refusing to meekly shut up, or for wanting the events of 1/6 and the things that preceded it to be investigated, while Elise Stefanik and Kevin McCarthy are in good standing.",
    "author": "Jason Lee Steorts",
    "title": "Belated 1/6-Anniversary Thoughts, with Mountain Lions"
  },
  {
    "id": 780,
    "mediaId": 43,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "At the national level Republicans retaliated against Congresswoman <span class='selected-term'>Liz Cheney</span> for voting her conscience.",
    "author": "",
    "title": "Trump Supporters: Deceivers and the Deceived"
  },
  {
    "id": 77,
    "mediaId": 195,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "And Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "Cristina Marcos",
    "title": "The fates of the 10 House Republicans who voted to impeach Trump"
  },
  {
    "id": 770,
    "mediaId": 558,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Trump and his allies have targeted the other Republican legislators who voted for his impeachment, with Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming a top target.",
    "author": "Christopher Wilson",
    "title": "Rep. Katko joins exodus of GOP lawmakers who voted to impeach Trump"
  },
  {
    "id": 771,
    "mediaId": 558,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Trump and his allies have targeted the other Republican legislators who voted for his impeachment, with Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming a top target.",
    "author": "Christopher Wilson",
    "title": "Rep. Katko joins exodus of GOP lawmakers who voted to impeach Trump"
  },
  {
    "id": 773,
    "mediaId": 238,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Indeed, this is the context for understanding McCarthy's new endorsement of the primary challenger to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: Susan Collins tries to Trump proof' the 2024 election  behind Trump's back"
  },
  {
    "id": 767,
    "mediaId": 151,
    "date": "1/15/2022 12:00:00 AM",
    "sentence": "Jim Banks said it is long past time? for Kevin McCarthy to expel <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger from the House Republican Conference.",
    "author": "",
    "title": "POLITICO Playbook: Civil rights leaders fume after meeting with Sinema"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>\nWyoming's lone representative voted with Trump's position an estimated 93% of the time while he was in office, but she became a vocal critic of his actions leading up to and during the Jan. 6 riot and his efforts to overturn the results of the 2020 presidential election.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 758,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "He first earned the MAGA crowd's ire in January 2021 when he defended Rep. <span class='selected-term'>Liz Cheney</span>, disliked by pro-Trump elements for her strident opposition to the former president.",
    "author": "Moshe Hill",
    "title": "Republicans need Dan Crenshaw"
  },
  {
    "id": 697,
    "mediaId": 21,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Bush cut checks to both Rep. <span class='selected-term'>Liz Cheney</span>, the eldest daughter of his former vice president, and Murkowski, both of whom face reelection this November.",
    "author": "Brent D. Griffiths",
    "title": "Trump endorses primary challenger to GOP Rep. Tom Rice, continuing his effort to rid the party of anyone who supported his impeachment"
  },
  {
    "id": 699,
    "mediaId": 376,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Rep. Elise Stefanik of New York, who replaced Wyoming Rep. <span class='selected-term'>Liz Cheney</span> as chairwoman of the House Republican Conference, raised $5.1 million total for 2021, compared with $4.6 million in 2019.",
    "author": "Kate Ackley\nStephanie Akin\nRyan Kelly",
    "title": "House GOP feels no fundraising backlash for opposing electors"
  },
  {
    "id": 669,
    "mediaId": 237,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "The Republican National Committee is set to vote on a resolution Friday to censure Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "Ryan King",
    "title": "RNC censure resolution against Cheney and Kinzinger advances"
  },
  {
    "id": 671,
    "mediaId": 237,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "A push from hard-right conservatives to oust Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger from the House Republican Conference is simmering in Congress as party leaders at the Republican National Committee debate whether to condemn the two members.",
    "author": "Emily Brooks",
    "title": "Push to oust Cheney and Kinzinger from GOP simmers in Congress as RNC debates it"
  },
  {
    "id": 674,
    "mediaId": 238,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "On Friday, the Republican National Committee voted to censure Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Opinion: The GOP's vile new punishment of Liz Cheney shows Trump's true impact"
  },
  {
    "id": 675,
    "mediaId": 19,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "The Republican National Committee (RNC) will reportedly move forward with a resolution on Friday to censure Reps. <span class='selected-term'>Liz Cheney</span> (R-WY) and Adam Kinzinger (R-IL) for their conduct on the January 6 committee.",
    "author": "Paul Bois",
    "title": "Republican National Committee Will Vote Friday to Censure Liz Cheney, Adam Kinzinger"
  },
  {
    "id": 613,
    "mediaId": 21,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy said on Friday that Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger's congressional careers are effectively over, declining to support them after the Republican National Committee's censure.",
    "author": "Brent D. Griffiths",
    "title": "Kevin McCarthy says Trump foes Liz Cheney and Adam Kinzinger will 'have a hard time ever' returning to Congress"
  },
  {
    "id": 620,
    "mediaId": 112,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "From the archives (November 2021): Wyoming Republicans vote that <span class='selected-term'>Liz Cheney</span> is no longer a member of their party\nThat, said Michael Steele, former lieutenant governor of Maryland who served as Republican National Committee chairman from 2009 to 2011, was beyond despicable.?\nSteele, speaking on MSNBC at midday Monday, said the censure showed depravity? and capitulation to the whims of Trump.",
    "author": "Associated Press",
    "title": "A defining moment': Kinzinger says Republican National Committee censure of him and Cheney shows McCarthy's weakness as House leader"
  },
  {
    "id": 622,
    "mediaId": 21,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The Republican National Committee voted on Friday to formally censure Republican Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois for their participation in the House select committee investigating the January 6 assault on the US Capitol.",
    "author": "Bryan Metzger",
    "title": "Republican National Committee votes to censure Reps. Liz Cheney and Adam Kinzinger for participating in the January 6 committee"
  },
  {
    "id": 623,
    "mediaId": 65,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "In an overwhelming voice vote by committee members gathered for the general session of their winter meeting in Salt Lake City, Utah, the RNC rebuked Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois.",
    "author": "Paul Steinhauser",
    "title": "Republican National Committee overwhelming votes to censure Cheney, Kinzinger for sitting on Jan. 6 committee"
  },
  {
    "id": 631,
    "mediaId": 1164,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Feb. 4 (UPI) -- The Republican National Committee on Friday approved a resolution censuring Reps. <span class='selected-term'>Liz Cheney</span>, R-Wyo., and Adam Kinzinger, R-Ill., for their participation on the House select committee investigating the Jan. 6, 2021, attack on the U.S. Capitol.",
    "author": "Danielle Haynes",
    "title": "RNC censures Liz Cheney, Adam Kinzinger for Jan. 6 committee participation"
  },
  {
    "id": 603,
    "mediaId": 187,
    "date": "2/5/2022 12:00:00 AM",
    "sentence": "The best way to understand a controversial new resolution from the Republican National Committee censuring Representatives <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger is not, as some people have suggested, to legitimize the January 6 attack on the Capitol, but as something more primal: Trump service.",
    "author": "David A. Graham",
    "title": "The End of the Republicans' Big Tent"
  },
  {
    "id": 605,
    "mediaId": 409,
    "date": "2/5/2022 12:00:00 AM",
    "sentence": "The Republican National Committee has voted to formally censure <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for actions in their positions as members of the January 6th Select Committee not befitting Republican members of Congress.? This is both morally repellent and politically self-destructive.",
    "author": "The Editors",
    "title": "RNC Should Take a Lesson from Mike Pence"
  },
  {
    "id": 581,
    "mediaId": 312,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "And did we get it right that the RNCwith no debate or recorded votealso said in the resolution that Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger engaged in the persecution of ordinary citizens engaged in legitimate political discourse? simply by looking into the details of the deadly attempt to keep Donald Trump in power?",
    "author": "Philip Elliott",
    "title": "Why the RNC's Embrace of Trump and the January Sixers Will Backfire"
  },
  {
    "id": 589,
    "mediaId": 43,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. <span class='selected-term'>Liz Cheney</span>, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. Madison Cawthorn, Lauren Boebert, and Paul Gosar ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump is the worst president the U.S. ever had'"
  },
  {
    "id": 567,
    "mediaId": 237,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Senate Minority Leader Mitch McConnell said it was not the job? of the Republican National Committee to be singling out members? with differing views, as it did by censuring Republican Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "Emily Brooks",
    "title": "McConnell: 'Not the job of the RNC' to censure Liz Cheney and Adam Kinzinger"
  },
  {
    "id": 574,
    "mediaId": 129,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Then on Friday, the Republican National Committee voted to censure Representatives <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, the two House Republicans on the congressional committee investigating the Jan. 6 attack on the Capitol.",
    "author": "",
    "title": "Censure Vote Has Republicans Battling Themselves Again"
  },
  {
    "id": 544,
    "mediaId": 124,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "WASHINGTON  House Speaker Nancy Pelosi, D-Calif., said Wednesday that it was \"disturbing\" to see video of House Minority Leader Kevin McCarthy, R-Calif., walking away from the press when asked about the Republican National Committee's resolution censuring GOP Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "",
    "title": "Pelosi rips McCarthy for walking away, declining to comment on RNC censure resolution"
  },
  {
    "id": 522,
    "mediaId": 881,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "The one calling the Jan. 6 riot and coup attempt an example of ordinary citizens engaged in legitimate political discourse.?\nThe story, you see, is that the resolution censuring Republican Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for participating on the January 6 select committee was edited late at night.",
    "author": "",
    "title": "The RNC's resolution didn't just celebrate Trump's authoritarianism and condemn its critics; it showed that it's working."
  },
  {
    "id": 511,
    "mediaId": 195,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "The two men took opposite tacts this week to the Republican National Committee censure resolution of Reps. Adam Kinzinger (Ill.) and <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "Jordain Carney",
    "title": "McConnell-McCarthy split heading into November"
  },
  {
    "id": 502,
    "mediaId": 195,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "In a voice vote (rather than a roll call, where individuals reveal their yeas and nays), the Republican National Committee censured <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Glenn C. Altschuler",
    "title": "Republicans do not have a right to remain silent"
  },
  {
    "id": 491,
    "mediaId": 25,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "The Republican National Committee censured the two Republicans on that committee, Representatives <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, earlier in February.",
    "author": "Adam Brewster",
    "title": "Senator Rick Scott says he will \"absolutely\" vote for McConnell to be leader"
  },
  {
    "id": 460,
    "mediaId": 195,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-Calif.) on Thursday endorsed Harriet Hageman, the Wyoming Republican waging a primary challenge against Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.).",
    "author": "Tal Axelrod",
    "title": "McCarthy endorses Cheney primary challenger"
  },
  {
    "id": 461,
    "mediaId": 151,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Some Republicans believe House Minority Leader Kevin McCarthy's actions against Rep. <span class='selected-term'>Liz Cheney</span>  or silence when the party moves to punish her  undermine his claim that the GOP is a big tent? party.",
    "author": "",
    "title": "McCarthy picks his path on Cheney: Try to boot her from Congress"
  },
  {
    "id": 462,
    "mediaId": 238,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy on Thursday endorsed attorney Harriet Hageman in her primary race in Wyoming against Rep. <span class='selected-term'>Liz Cheney</span>, a rebuke of the Republican incumbent and former member of House leadership who has denounced Donald Trump.",
    "author": "",
    "title": "McCarthy endorses Cheney's primary rival in rebuke of Republican incumbent who has denounced Trump"
  },
  {
    "id": 463,
    "mediaId": 65,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy is endorsing Harriet Hageman in her Wyoming primary challenge to Rep. <span class='selected-term'>Liz Cheney</span>, a rare move by a sitting party leader to back an attempt to unseat one of his members.",
    "author": "Kelly Phares",
    "title": "McCarthy backs Cheney challenger Hageman in Wyoming House Republican primary"
  },
  {
    "id": 464,
    "mediaId": 233,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "WASHINGTON  House Minority Leader Kevin McCarthy, R-Calif., on Thursday endorsed Harriet Hageman, a primary challenger to GOP Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, the latest skirmish between Cheney and her party over her forceful criticism of former President Donald Trump.",
    "author": "Dylan Wells",
    "title": "House GOP leader Kevin McCarthy endorses Liz Cheney challenger in continuing fallout over Trump"
  },
  {
    "id": 465,
    "mediaId": 593,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "U.S. House Republican leader Kevin McCarthy on Thursday endorsed a primary challenger to Republican Representative <span class='selected-term'>Liz Cheney</span>, a prominent critic of former President Donald Trump.",
    "author": "Tyler Clifford",
    "title": "Top U.S. House Republican Endorses Cheney Challenger In Party Primary"
  },
  {
    "id": 467,
    "mediaId": 21,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy formally endorsed a right-wing candidate, also backed by former President Donald Trump, who's running in the GOP primary against Wyoming Rep. <span class='selected-term'>Liz Cheney</span>.",
    "author": "Grace Panetta",
    "title": "House Minority Leader Kevin McCarthy endorses Liz Cheney's Trump-backed primary challenger"
  },
  {
    "id": 468,
    "mediaId": 376,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy endorsed Harriet Hageman, the primary challenger of Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, a rare and significant move that is the latest Republican act of retribution directed at Cheney for her criticism of former President Donald Trump and her integral role on the Jan. 6 select committee.",
    "author": "Chris Marquette",
    "title": "McCarthy backs Cheney's challenger in Wyoming primary"
  },
  {
    "id": 469,
    "mediaId": 237,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "When Trump endorsed Hageman last fall, the former president said she has \"my Complete and Total Endorsement in replacing the Democrats number one provider of sound bites, <span class='selected-term'>Liz Cheney</span>.? Hageman told the Washington Examiner in an interview the same month that Cheney \"betrayed Wyoming\" and \"betrayed me.\"",
    "author": "Asher Notheis",
    "title": "Kevin McCarthy endorses Liz Cheney primary challenger"
  },
  {
    "id": 472,
    "mediaId": 98,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy endorsed the GOP primary challenger to Wyoming Rep. <span class='selected-term'>Liz Cheney</span> on Thursday, his latest show of fealty to former President Trump as Republicans try to take control of Congress.",
    "author": "Seema Mehta",
    "title": "In solidarity with Trump, McCarthy backs Rep. Cheney's primary challenger"
  },
  {
    "id": 473,
    "mediaId": 558,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-Calif.) has officially endorsed attorney Harriet Hageman, the top challenger to incumbent GOP Rep. <span class='selected-term'>Liz Cheney</span>, in the race for Wyoming's one and only House seat, The Federalist reports Thursday.",
    "author": "Brigid Kennedy",
    "title": "Kevin McCarthy endorses top Liz Cheney challenger in Wyoming House race"
  },
  {
    "id": 481,
    "mediaId": 129,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Representative Kevin McCarthy, the House Republican leader, on Thursday endorsed Representative <span class='selected-term'>Liz Cheney</span>'s G.O.P.",
    "author": "",
    "title": "Kevin McCarthy Backs Liz Cheney's Challenger, Escalating a Party Feud"
  },
  {
    "id": 486,
    "mediaId": 25,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-CA) whispers to Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) during a House Republican Leadership news conference in the U.S. Capitol on February 24, 2021 in Washington, DC.",
    "author": "Robert Costa",
    "title": "House GOP Leader Kevin McCarthy backs Liz Cheney's primary challenger Harriet Hageman"
  },
  {
    "id": 487,
    "mediaId": 33,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "(CNN)House Minority Leader Kevin McCarthy has endorsed Harriet Hageman, the Trump-backed opponent of incumbent Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming -- a rare endorsement from leadership in a divisive GOP primary, and one that marks the culmination of a simmering feud between the two powerful Republicans battling over the future of their party.",
    "author": "Ryan Nobles, Manu Raju and Melanie Zanona",
    "title": "McCarthy endorses Cheney foe in Wyoming GOP primary"
  },
  {
    "id": 488,
    "mediaId": 188,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "\"<span class='selected-term'>Liz Cheney</span> has completely lost the ability to do her job of representing Wyoming as our only member of the House of Representatives.",
    "author": "Carlos Garcia",
    "title": "GOP leader Kevin McCarthy endorses pro-Trump primary challenger to Liz Cheney"
  },
  {
    "id": 445,
    "mediaId": 124,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy endorsed Harriet Hageman yesterday in her primary race against Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "Conor Lamb makes his contrast argument for Pennsylvania Senate bid"
  },
  {
    "id": 446,
    "mediaId": 169,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy, R-Calif., has backed the primary challenger to Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "Jon Skolnik",
    "title": "Kevin McCarthy breaks political tradition, endorses Liz Cheney's pro-Trump primary challenger"
  },
  {
    "id": 449,
    "mediaId": 129,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "Kevin McCarthy, the House Republican leader, endorsed a primary challenger to <span class='selected-term'>Liz Cheney</span>, a Trump-critical Republican.",
    "author": "",
    "title": "Red Covid, an Update"
  },
  {
    "id": 454,
    "mediaId": 124,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "In a highly unusual move, House Minority Leader Kevin McCarthy on Thursday endorsed Harriet Hageman, the Trump-backed candidate challenging Rep. <span class='selected-term'>Liz Cheney</span> in the Wyoming Republican primary.",
    "author": "",
    "title": "House GOP leader McCarthy endorses Cheney challenger in Wyoming primary"
  },
  {
    "id": 456,
    "mediaId": 43,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "x\n@EliseStefanik, who replaced @Liz_Cheney as GOP conference chair, out with a statement this morning endorsing Cheney's primary opponent for her Wyoming seat: <span class='selected-term'>Liz Cheney</span> abandoned her constituents to become a Far-Left Pelosi puppet.? pic.twitter.com/TpfQi09S8x\n Elizabeth Landers (@ElizLanders) February 18, 2022\nThis is a short blurb about Daily Kos.",
    "author": "",
    "title": "Doing Trump's bidding, House GOP leadership endorses Liz Cheney's primary challenger"
  },
  {
    "id": 457,
    "mediaId": 98,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy endorsed the GOP primary challenger to Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, his latest show of fealty to former President Trump.",
    "author": "Laura Blasey",
    "title": "Today's Headlines: A new poll finds that L.A. isn't as unpopular as you might think"
  },
  {
    "id": 439,
    "mediaId": 112,
    "date": "2/19/2022 12:00:00 AM",
    "sentence": "From the archives (January 2021): Kevin McCarthy becomes poster boy for Republicans walking back their recent Trump criticism\nFrom the archives (November 2021): Wyoming Republicans vote that <span class='selected-term'>Liz Cheney</span> is no longer a member of their party\nAs McCarthy weighs in, the GOP leader's fundraising skills are perhaps an even bigger draw than his name, an ability to lend the kind of hefty campaign support to Hageman that will be needed to counter Cheney's own political strength as a nationally known political figure.",
    "author": "Associated Press",
    "title": "House Republican leader Kevin McCarthy backs primary challenger to Rep. Liz Cheney in Wyoming"
  },
  {
    "id": 440,
    "mediaId": 21,
    "date": "2/19/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump is pushing Wyoming lawmakers to back legislation that would bar Democrats and other non-Republicans from casting ballots in statewide GOP primaries, in a move widely seen as a way to sink Rep. <span class='selected-term'>Liz Cheney</span>'s prospects for renomination by the party.",
    "author": "John L. Dorman",
    "title": "Trump wants Wyoming lawmakers to change their election laws to block Liz Cheney from receiving crossover votes in the state's GOP primary"
  },
  {
    "id": 436,
    "mediaId": 25,
    "date": "2/21/2022 12:00:00 AM",
    "sentence": "A group of Republican critics of former President Donald Trump will gather in Washington, D.C., this week to cheer on the two GOP members of the House select committee investigating the January 6 assault on the U.S. Capitol, <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois.",
    "author": "Robert Costa",
    "title": "Trump's GOP critics to gather in Washington with an eye on 2024 presidential race"
  },
  {
    "id": 437,
    "mediaId": 19,
    "date": "2/21/2022 12:00:00 AM",
    "sentence": "Adam Kinzinger will be retiring from Congress later this year, and <span class='selected-term'>Liz Cheney</span> faces a difficult primary challenge in her home state of Wyoming against Harriet Hageman, who has been endorsed by top GOP leaders like House Minority Leader Kevin McCarthy (R-CA).",
    "author": "Paul Bois",
    "title": "Anti-Trumpers Liz Cheney, Adam Kinzinger to Attend CPAC Counterprogramming' Summit"
  },
  {
    "id": 430,
    "mediaId": 43,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "In a statement following the committee's request to the GOP leader, McCarthy said: As a representative and the leader of the minority party, it is with neither regret nor satisfaction that I have concluded to not participate with this select committee's abuse of power that stains this institution today and will harm it going forward.?\nMcCarthy has dodged questions around Jan. 6 from reporters, even running away from one during an exchange this February in the Capitol after the Republican National Committee agreed to censure the probe's only Republican members: Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "",
    "title": "Who's who: A rolling guide to the targets of the Jan. 6 committee"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Hours later, Mr. McCarthy did what the fringe wanted: He endorsed the woman running in Wyoming's Republican primary to oust the far right's archnemesis, Representative <span class='selected-term'>Liz Cheney</span>, a former member of his leadership team who has earned pariah status in her party by speaking out against former President Donald J. Trump and the deadly attack on the Capitol that he helped inspire with lies of a stolen election.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 414,
    "mediaId": 238,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Other than Romney, Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: Romney is right: MAGA Republicans are almost treasonous'"
  },
  {
    "id": 393,
    "mediaId": 409,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "Earlier this month, McCarthy endorsed the GOP primary challenger to Wyoming representative <span class='selected-term'>Liz Cheney</span> because of Cheney's role in serving on the committee investigating the January 6 attack on the Capitol.",
    "author": "John McCormack",
    "title": "Marjorie Taylor Greene's Justification for Appearing at a White-Nationalist Conference Is Preposterous"
  },
  {
    "id": 389,
    "mediaId": 209,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "One of them, Rep. Adam Kinzinger (R-Ill.), is retiring next year, but McCarthy is backing the primary challenger to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.).",
    "author": "Peter Weber",
    "title": "Will GOP leader Kevin McCarthy back Marjorie Taylor Greene's primary challenger, too? National Review asks"
  },
  {
    "id": 390,
    "mediaId": 195,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "The Republicans who publicly denounced Greene's and Gosar's appearances at the conference largely included the handful who have been more willing to denounce far-right extremism and the party's continued embrace of former President Trump, such as Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "Cristina Marcos",
    "title": "McCarthy criticizes GOP members who spoke at white nationalist conference: 'Unacceptable'"
  },
  {
    "id": 383,
    "mediaId": 120,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "The party could also announce that it will not support the members' re-election campaigns  akin to what the party has already done to <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, because of their efforts to help lead the investigation into the Jan. 6 attack.",
    "author": "Steve Benen",
    "title": "Pressed for answers on two radical GOP members, McCarthy hedges"
  },
  {
    "id": 378,
    "mediaId": 409,
    "date": "3/4/2022 12:00:00 AM",
    "sentence": "McCarthy has endorsed the opponent of <span class='selected-term'>Liz Cheney</span> in the Wyoming GOP primary.",
    "author": "Jay Nordlinger",
    "title": "Phil and the Saudis, &c."
  },
  {
    "id": 372,
    "mediaId": 120,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "The party could also announce that it will not support the members' re-election campaigns  akin to what the party has already done to Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, because of their efforts to help lead the investigation into the Jan. 6 attack.",
    "author": "Steve Benen",
    "title": "Greene, Gosar go unpunished after appearance at radical event"
  },
  {
    "id": 374,
    "mediaId": 151,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "No matter what happens during that conversation, if it occurs, some of his members saw a potential upside for McCarthy thanks to outside calls for Greene and Gosar to be removed from the conference outright: less right-wing pressure to oust Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Why Republicans may let Greene and Gosar's latest brushfire burn itself out"
  },
  {
    "id": 344,
    "mediaId": 424,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Stefanik, a formerly (and putatively) moderate House member, leveraged her fealty to Trump to earn a promotion to the House conference chair after minority leader Kevin McCarthy booted <span class='selected-term'>Liz Cheney</span> from the number-three GOP slot over Cheney's role in investigating January 6.",
    "author": "Tom Gogola",
    "title": "And the Winner of a Safe Seat in Congress Is Elise Stefanik!"
  },
  {
    "id": 349,
    "mediaId": 19,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Wyoming voters will have to pay for an audience with embattled Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) during one of her infrequent visits to her home state next week.",
    "author": "Wendell Husebø",
    "title": "Wyoming Voters Have to Pay for an Audience with Liz Cheney"
  },
  {
    "id": 333,
    "mediaId": 558,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "The event was held to raise funds for <span class='selected-term'>Liz Cheney</span>, the Wyoming Republican whose opposition to Donald Trump over his attempt to overturn his election defeat and the January 6 riot has attracted a far-right challenger backed by the former president and the House Republican leader, Kevin McCarthy, in her primary this year.",
    "author": "Martin Pengelly",
    "title": "Mitt Romney warns of extraordinary challenge' in preserving democracy"
  },
  {
    "id": 334,
    "mediaId": 25,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Romney was the introductory speaker at a closed fundraiser for Republican Congresswoman <span class='selected-term'>Liz Cheney</span> of Wyoming.",
    "author": "Robert Costa",
    "title": "In private speech, Romney warns of 'extraordinary challenge' to preserve American democracy"
  },
  {
    "id": 315,
    "mediaId": 881,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "He encouraged voters to support his Trump-picked opponent if they prefer a candidate who backs political violence? and a would-be tyrant.? Rep. <span class='selected-term'>Liz Cheney</span>, also on Trump's target list, obviously, chimed in.",
    "author": "Todd Zwillich",
    "title": "Trump's Jan. 6 Cronies Might Never Have to Face Any Consequences"
  },
  {
    "id": 317,
    "mediaId": 33,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "I think it's disgraceful,? said Rep. <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican on the outs with her conference over her vocal criticism of Trump.",
    "author": "Melanie Zanona",
    "title": "Madison is wrong': GOP backlash over Cawthorn grows after Zelensky insult"
  },
  {
    "id": 320,
    "mediaId": 25,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "The only lawmaker who has faced lingering consequences is Wyoming Republican Rep. <span class='selected-term'>Liz Cheney</span>, who was removed from her leadership position in the House Republican conference after repeatedly criticizing former President Trump for his role in the January 6 riot.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy"
  },
  {
    "id": 321,
    "mediaId": 33,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "I think it's disgraceful,\" said Rep. <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican on the outs with her conference over her vocal criticism of Trump.",
    "author": "Melanie Zanona",
    "title": "'Madison is wrong': GOP backlash over Cawthorn grows after Zelensky insult"
  },
  {
    "id": 38,
    "mediaId": 237,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "McCarthy asserted that he is largely standing by incumbents in their races, with the exception of endorsing against Wyoming Rep. <span class='selected-term'>Liz Cheney</span> due to her decision to join the select committee tasked with investigating the Jan. 6 Capitol riot.",
    "author": "Juliegrace Brufke",
    "title": "Kevin McCarthy not worried about Trump endorsements in GOP primaries"
  },
  {
    "id": 297,
    "mediaId": 21,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "More than 100 House Republicans are set to cohost a fundraiser for Harriet Hageman, the leading primary challenger against GOP Rep. <span class='selected-term'>Liz Cheney</span>, according to Politico.",
    "author": "John L. Dorman",
    "title": "More than 100 House Republicans will cohost a fundraiser for Rep. Liz Cheney's leading primary challenger"
  },
  {
    "id": 299,
    "mediaId": 151,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "| Andrew Harnik-Pool/Getty Images\nBy Alex Isenstadt\n 03/23/2022 03:24 PM EDT\nFirst House Republicans kicked Rep. Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "More than 100 House Republicans to cohost fundraiser for Cheney challenger"
  },
  {
    "id": 300,
    "mediaId": 237,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "PONTE VEDRA BEACH, Fla.  House Minority Leader Kevin McCarthy said he does not believe Republicans will pay a price at the ballot box for increasingly rejecting Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger over their criticism of former President Donald Trump.",
    "author": "Juliegrace Brufke",
    "title": "McCarthy says GOP criticisms of Cheney and Kinzinger won't dissuade swing voters"
  },
  {
    "id": 304,
    "mediaId": 195,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Weeks after the 2021 retreat, Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "Emily Brooks -",
    "title": "A more unified House GOP aims to get everyone on same page"
  },
  {
    "id": 305,
    "mediaId": 376,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was kicked out of her role as conference chair just weeks after last year's retreat in Orlando.",
    "author": "Chris Marquette",
    "title": "House GOP heads to Florida to narrow in on policy plans"
  },
  {
    "id": 37,
    "mediaId": 157,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "\"House Minority Leader Kevin McCarthy said he won't be wading into any other primaries to oust incumbents in his own party, after taking the unprecedented step of endorsing Rep. <span class='selected-term'>Liz Cheney</span>'s primary opponent last month,\" CNN's Melanie Zanona reported from the caucus's annual policy retreat in Ponte Vedra Beach, Florida.",
    "author": "Bob Brigham",
    "title": "Kevin McCarthy is directly at odds' with Trump's revenge tour' against Republicans: report"
  },
  {
    "id": 292,
    "mediaId": 19,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-CA) will host a fundraiser next week for Rep. <span class='selected-term'>Liz Cheney</span>'s (R-WY) opponent, Harriet Hageman.",
    "author": "Wendell Husebø",
    "title": "Kevin McCarthy to Host Huge Fundraiser for Liz Cheney's Opponent, Harriet Hageman"
  },
  {
    "id": 294,
    "mediaId": 239,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "PONTE VEDRA, Fla.  Rep. <span class='selected-term'>Liz Cheney</span> is a no-show at this year's annual House Republican retreat.",
    "author": "Kerry Picket",
    "title": "Rep. Liz Cheney ditches House Republican retreat"
  },
  {
    "id": 295,
    "mediaId": 33,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "\"A leader with honor would be rejecting -- not protecting -- the pro-Putin, anti-Semitic, white nationalist members of the party, instead of fighting against <span class='selected-term'>Liz Cheney</span> for telling the truth,\" Jeremy Adler, Cheney's spokesman, said in a statement to CNN.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  },
  {
    "id": 281,
    "mediaId": 195,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-Calif.) revealed that more than 100 House Republicans had signed on to host a fundraiser later this month for Rep. <span class='selected-term'>Liz Cheney</span>'s (R-Wyo.)",
    "author": "Max Greenwood",
    "title": "Five takeaways from the House GOP's annual retreat"
  },
  {
    "id": 282,
    "mediaId": 223,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "You're not one of us anymore (via Daily Caller):\nHouse Minority Leader Kevin McCarthy said over 100 Republicans from Congress will be supporting Republican Wyoming Rep. <span class='selected-term'>Liz Cheney</span>'s primary opponent, Harriet Hageman, in an exclusive interview with the Daily Caller.",
    "author": "Matt Vespa",
    "title": "Scores of Congressional Republicans Are Coming to Wyoming to Let Liz Cheney Know How Much She Sucks"
  },
  {
    "id": 283,
    "mediaId": 239,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "A leader with honor would be rejecting  not protecting  the pro-Putin, anti-Semitic, white nationalist members of the party, instead of fighting against <span class='selected-term'>Liz Cheney</span> for telling the truth,? Cheney campaign spokesman Jeremy Adler said Thursday.",
    "author": "Kerry Picket",
    "title": "Cheney spokesman says GOP lawmakers support Putin for endorsing her primary opponent"
  },
  {
    "id": 255,
    "mediaId": 237,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Dozens of House Republicans are expected to attend House Minority Leader Kevin McCarthy's fundraiser for Rep. <span class='selected-term'>Liz Cheney</span>'s Wyoming GOP primary opponent, Harriet Hageman, on Wednesday evening in an increasingly bitter contest over fealty by party members to former President Donald Trump.",
    "author": "Juliegrace Brufke",
    "title": "Liz Cheney primary opponent fundraiser draws scores of GOP House incumbents"
  },
  {
    "id": 252,
    "mediaId": 120,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "In other words, while the party isn't pleased with Cawthorn, it's still far angrier with Rep. <span class='selected-term'>Liz Cheney</span>  whom the Republican National Committee has formally denounced, and whose primary rival now enjoys official GOP backing.",
    "author": "Steve Benen",
    "title": "Under pressure, Cawthorn changes his story about orgies, cocaine"
  },
  {
    "id": 254,
    "mediaId": 25,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50 House Republicans were at a Washington, D.C., fundraiser on Wednesday night for Harriet Hageman, Rep. <span class='selected-term'>Liz Cheney</span>'s challenger in Wyoming.",
    "author": "Aaron Navarro",
    "title": "Over 50 House Republicans attend fundraiser for Liz Cheney's challenger, Harriet Hageman"
  },
  {
    "id": 246,
    "mediaId": 881,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Because Rep. <span class='selected-term'>Liz Cheney</span> voted for impeachment and is investigating Jan. 6, more than 50 of her House GOP colleagues attended a D.C. fundraiser for her primary opponent.",
    "author": "",
    "title": "T.W.I.S. Notes"
  },
  {
    "id": 248,
    "mediaId": 151,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "The North Carolina conservative appeared alongside other House Republicans at a fundraiser for Harriet Hageman, the Trump-backed opponent of Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.).",
    "author": "",
    "title": "Cloud of notoriety builds over Cawthorn after sex-and-drugs claims"
  },
  {
    "id": 249,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "And when Cawthorn attended a Wednesday night fundraiser for Harriet Hageman, Rep. <span class='selected-term'>Liz Cheney</span>'s primary challenger, his own GOP colleagues spent some of the fundraiser, feet away, quietly joking at his expense, according to people in the room,? Politico's Olivia Beavers reports.",
    "author": "Laura Clawson",
    "title": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies"
  },
  {
    "id": 245,
    "mediaId": 43,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "As Politico's Olivia Beavers wrote, Cawthorn showed up at a fundraiser on Wednesday night for Harriet Hageman, who is opposing Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) for the GOP nomination for Wyoming's one House seat after being endorsed by Donald Trump.",
    "author": "",
    "title": "DKos Asheville Open Thread: He just can't stop"
  },
  {
    "id": 227,
    "mediaId": 65,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: Harriet Hageman, the leading Republican candidate challenging Rep. <span class='selected-term'>Liz Cheney</span> as Wyoming's at-large member of the House runs for re-election this year, reports that she's raked in over $1.3 million during the January-March first quarter of fundraising.",
    "author": "",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in over $1.3 million past three months"
  },
  {
    "id": 229,
    "mediaId": 19,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "The ringleader of the establishment Republicans, Sen. Mitch McConnell (R-KY), announced on Thursday a donation to Democrat ally Rep. <span class='selected-term'>Liz Cheney</span>'s (R-WY) reelection campaign.",
    "author": "Wendell Husebø",
    "title": "Mitch McConnell Donates to Liz Cheney"
  },
  {
    "id": 218,
    "mediaId": 21,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Christie responded: \"Whatever it is, it wasn't like she was looking to protect her position, and the first time that Republicans inside that caucus had a chance to vote on <span class='selected-term'>Liz Cheney</span> they voted the keep her  overwhelmingly.\"",
    "author": "John L. Dorman",
    "title": "Chris Christie says Liz Cheney 'wanted to be kicked out' of House Republican leadership"
  },
  {
    "id": 220,
    "mediaId": 21,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "GOP Rep. <span class='selected-term'>Liz Cheney</span> on Sunday said House Minority Leader Kevin McCarthy has put his own political ambitions first and failed to defend democracy.",
    "author": "Sarah Al-Arshani",
    "title": "Rep. Liz Cheney says GOP leader Kevin McCarthy has failed to defend democracy at home after he backed Ukraine in Poland"
  },
  {
    "id": 222,
    "mediaId": 195,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Mychael Schnell",
    "title": "Cheney says McCarthy failed to put oath to the Constitution ahead of his own personal political gains'"
  },
  {
    "id": 206,
    "mediaId": 124,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who has risen to national prominence as one of the most vocal opponents of former President Donald Trump, raised $2.94 million in toward her re-election bid the first quarter of 2022, her campaign confirmed to NBC News on Monday.",
    "author": "",
    "title": "Cheney capitalizes off national profile to raise $2.9 million in first quarter of 2022"
  },
  {
    "id": 207,
    "mediaId": 195,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Campaign\nRep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Mychael Schnell",
    "title": "Cheney sets personal fundraising record"
  },
  {
    "id": 209,
    "mediaId": 209,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "The <span class='selected-term'>Liz Cheney</span> campaign is holding on quite well, it seems.",
    "author": "Brigid Kennedy",
    "title": "Liz Cheney rakes in cash in fight against Trump-backed challenger"
  },
  {
    "id": 210,
    "mediaId": 151,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "POLITICO Playbook: SCOOP: <span class='selected-term'>Liz Cheney</span>'s record fundraising haul\nBy RYAN LIZZA and EUGENE DANIELS\n04/11/2022 06:29 AM EDT\nPresented by\nDRIVING THE DAY\nFIRST IN PLAYBOOK  Rep. LIZ CHENEY has set another personal fundraising record.",
    "author": "",
    "title": "POLITICO Playbook: SCOOP: Liz Cheney's record fundraising haul"
  },
  {
    "id": 212,
    "mediaId": 25,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n Trump endorses Oz in Pennsylvania Senate primary race\n Judge declines to slow N.Y. primary elections despite ongoing redistricting battle\n Wisconsin governor vetoes Republican election bills\n More\nIn:\nUnited States Congress\nwyoming\nLiz Cheney\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "Liz Cheney sets personal fundraising record ahead of August primary"
  },
  {
    "id": 215,
    "mediaId": 118,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Noah Y. Kim",
    "title": "Liz Cheney Is Getting a Ton of MoneyFrom People Who Can't Vote for Her"
  },
  {
    "id": 201,
    "mediaId": 558,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "Congresswoman <span class='selected-term'>Liz Cheney</span> raised almost $3 million in campaign contributions over the first three months of the midterm election year, continuing her record-breaking fundraising streak as she attempts to defend her seat against a Trump-backed challenger.",
    "author": "SAM METZ",
    "title": "Cheney again breaks fundraising record in Wyoming House race"
  },
  {
    "id": 164,
    "mediaId": 136,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "He has rejected the committee's two Republican members  Representatives <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois  saying he no longer views them as part of the GOP.",
    "author": "Jason Lemon",
    "title": "Donald Trump's Jan. 6 Actions Qualify as 'Treason': Glenn Kirschner"
  },
  {
    "id": 149,
    "mediaId": 147,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "It is a conversation between Kevin McCarthy and <span class='selected-term'>Liz Cheney</span>.",
    "author": "Lisa Desjardins",
    "title": "GOP's McCarthy and Greene are confronted by their own words after Jan. 6"
  },
  {
    "id": 150,
    "mediaId": 195,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Rep. Matt Gaetz (R-Fla.), who has called for Trump to run for Speaker instead of McCarthy, took a dig at McCarthy for sticking with Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Emily Brooks",
    "title": "McCarthy's future hangs in limbo as Washington awaits Trump response"
  },
  {
    "id": 151,
    "mediaId": 124,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Rep. Matt Gaetz, R-Fla., a Trump loyalist who has repeatedly raised questions about McCarthy's leadership tweeted Friday: While I was rallying in Wyoming against <span class='selected-term'>Liz Cheney</span>  Kevin McCarthy was defending Liz Cheney among House Republicans.?\nGaetz only represents a minority of House Republicans.",
    "author": "",
    "title": "McCarthy's leaked Trump remarks complicate quest to be House speaker"
  },
  {
    "id": 152,
    "mediaId": 21,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Republicans who are openly critical of Trump, including Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, have been rebuked by their party members.",
    "author": "Oma Seddiq",
    "title": "Biden blasts the Republican Party after tapes show McCarthy privately criticized Trump over January 6: 'This is a MAGA party now'"
  },
  {
    "id": 153,
    "mediaId": 195,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "McCarthy never said he'd call Trump to say he should resign,' Mr. Bednar said.? https://nyti.ms/37toXAU\n^ Well, the Times then shared the audio with MSNBC's The Rachel Maddow Show': Listen to the audio:\nBY THE WAY  <span class='selected-term'>LIZ CHENEY</span> SAYS IT WASN'T HER WHO LEAKED THE AUDIO:\nA spokesperson for Rep. Liz Cheney (R) said that the Wyoming congresswoman is not the person behind a recording of a Jan. 10, 2021, call with top Republicans that exposed House Minority Leader Kevin McCarthy (R-Calif.) saying that he would recommend former President Trump resign if he was impeached.? https://bit.ly/3v6v3Qx\nNEW UPDATE  TRUMP AND MCCARTHY SPOKE LAST NIGHT:\nVia The Washington Post's Jacqueline Alemany, Marianna Sotomayor, Felicia Sonmez and Julian Mark: https://wapo.st/3k5tpIu\nThe gist: Trump  was not upset about McCarthy's remarks and was glad the Republican leader didn't follow through, which Trump saw as a sign of his continued grip on the Republican Party.",
    "author": "Cate Martel",
    "title": "The Hill's 12:30 Report  More leaked McCarthy audio post-Jan. 6"
  },
  {
    "id": 154,
    "mediaId": 238,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "In the phone call with Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "Why Trump might give McCarthy a pass on Jan. 6"
  },
  {
    "id": 155,
    "mediaId": 32,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Jabin Botsford | The Washington Post | Getty Images\nRep. <span class='selected-term'>Liz Cheney</span> on Friday denied recording or leaking audio from a phone call that appears to show House Minority Leader Kevin McCarthy saying he would tell then-President Donald Trump to resign after the Jan. 6 Capitol riot.",
    "author": "Kevin Breuninger",
    "title": "Liz Cheney denies recording bombshell tape of Kevin McCarthy saying he would urge Trump to resign after Jan. 6 riot"
  },
  {
    "id": 156,
    "mediaId": 32,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "(CNBC)\nJust days after the Jan. 6, 2021 riot, House GOP leader Kevin McCarthy told a fellow Republican lawmaker, Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, that he would recommend to then-President Donald Trump that he resign, according to audio of a call obtained by MSNBC and aired Thursday night.",
    "author": "Matthew J. Belvedere,Peter Schacknow",
    "title": "What to watch today: Futures mixed after Fed's Powell knocked markets for a loop"
  },
  {
    "id": 157,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "QUICK LINKS\nRepublican congressional candidate's wildly homophobic fundraising blast accuses his enemies of being 'sodomite predators' and 'LGBT groomers', from Warren Rojas at Business Insider\nUkrainian President Zelensky, Rep. <span class='selected-term'>Liz Cheney</span> among 5 recipients of JFK Profile in Courage Award, from Travis Andersen at The Boston Globe\nSenate front-runner in Pennsylvania embraces Biden and progressive agenda amid Democrats' midterm dilemma, from Manu Raju, Alex Rogers and Ali Zaslav at CNN\nTRANSITIONS\nGrace Bobertz is now director of scheduling for Sen. Michael Bennet (D-Colo.).",
    "author": "Oh Kevin",
    "title": "Oh Kevin, my Kevin"
  },
  {
    "id": 158,
    "mediaId": 238,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "But the MAGA squad,? made up of Reps. Marjorie Taylor Greene (R-Ga.), Matt Gaetz (R-Fla.) and others, have long kept mum on whether they would support him as their speaker in the majority.McCarthy has said he would put Greene and Rep. Paul A. Gosar (R-Ariz.) back on better committees after Democrats ousted them, a move many colleagues saw as a peace offering.But the group has heavily criticized him since, insinuating he's a weak leader for allowing Republicans to vote with Democrats on infrastructure and not showing his cards on kicking Reps. Adam Kinzinger (R-Ill.) and <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Post Politics Now Leader McCarthy, Rep. Greene both have some explaining to do about Jan. 6"
  },
  {
    "id": 159,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Listen for yourself\nWhat happens on the tape: McCarthy essentially conspires with Rep. <span class='selected-term'>LIZ CHENEY</span> (R-Wyo.)",
    "author": "POLITICO Playbook: Is Kevin McCarthy toast?\nBy",
    "title": "POLITICO Playbook: Is Kevin McCarthy toast?"
  },
  {
    "id": 161,
    "mediaId": 25,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "In the January 10 meeting, Wyoming Rep. <span class='selected-term'>Liz Cheney</span>  who was the chairwoman of the Republican conference at the time  asks McCarthy if there's any chance Trump would resign.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy told fellow GOP leaders he was \"seriously thinking\" about telling Trump to resign after Jan. 6, recording shows"
  },
  {
    "id": 162,
    "mediaId": 25,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "In the January 10 meeting, Wyoming Rep. <span class='selected-term'>Liz Cheney</span>  who was the chairwoman of the Republican conference at the time  asks McCarthy if there's any chance Trump would resign.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy told fellow GOP leaders he was \"seriously thinking\" about telling Trump to resign after Jan. 6, recording shows"
  },
  {
    "id": 2766,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": ": Per the WaPo story, Rep. <span class='selected-term'>LIZ CHENEY</span>'s (R-Wyo.)",
    "author": "",
    "title": "POLITICO Playbook PM: McCarthy gets a lifeline (and another leak)"
  },
  {
    "id": 6246,
    "mediaId": 238,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "But the MAGA squad,? made up of Reps. Marjorie Taylor Greene (R-Ga.), Matt Gaetz (R-Fla.) and others, have long kept mum on whether they would support him as their speaker in the majority.McCarthy has said he would put Greene and Rep. Paul A. Gosar (R-Ariz.) back on better committees after Democrats ousted them, a move many colleagues saw as a peace offering.But the group has heavily criticized him since, insinuating hes a weak leader for allowing Republicans to vote with Democrats on infrastructure and not showing his cards on kicking Reps. Adam Kinzinger (R-Ill.) and <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Mariana Alfaro",
    "title": "Leader McCarthy, Rep. Greene both have some explaining to do about Jan. 6"
  },
  {
    "id": 148,
    "mediaId": 129,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "The lie Mr. McCarthy told was that he had said no such thing and that The New York Times had made it up, a statement that was quickly refuted by his taped voice telling Representative <span class='selected-term'>Liz Cheney</span>, Republican of Wyoming, exactly what The Times said he had said.",
    "author": "",
    "title": "For Trump's G.O.P., Crossing Lines Has Few Consequences"
  },
  {
    "id": 6172,
    "mediaId": 195,
    "date": "4/24/2022 12:00:00 AM",
    "sentence": "These  along with his hate-filled campaign to defeat Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, will enhance or diminish Trumps clout.",
    "author": "Albert Hunt",
    "title": "McConnells dilemma: What if Trumps candidates win?"
  },
  {
    "id": 142,
    "mediaId": 881,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Just two days after the attack on the Capitol, McCarthy told other top House Republicans, including then-conference chair Rep. <span class='selected-term'>Liz Cheney</span>, that he was seriously considering? having a conversation with Trump to urge the president to resign.",
    "author": "Paul Blest",
    "title": "Kevin McCarthy Is Now Straight-Up Lying About Wanting Trump to Resign"
  },
  {
    "id": 133,
    "mediaId": 238,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The actions of Rep. Matt Gaetz (R-Fla.) and Rep. Mo Brooks (R-Ala.) in particular had crossed a line, McCarthy suggested, noting that Brooks used incendiary language during a Jan. 6 speech and that Gaetz had singled out Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Post Politics Now McCarthy faces House Republicans in wake of audio tape leak"
  },
  {
    "id": 128,
    "mediaId": 237,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Just a few weeks later, McCarthy was in Mar-a-Lago meeting with Trump and declaring that the former president's popularity has never been stronger.? He endorsed a primary challenger to Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming over her criticism of Trump, but not to Gaetz, Greene, or any of the other GOP caricatures he privately criticized.",
    "author": "Zachary Faria",
    "title": "McCarthy's spinelessness bodes ill for future of the House GOP"
  },
  {
    "id": 109,
    "mediaId": 65,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming sits high atop Donald Trump's list of GOP enemies.",
    "author": "Paul Steinhauser",
    "title": "Trump to target Cheney at May 28 rally in Wyoming"
  },
  {
    "id": 111,
    "mediaId": 151,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "and Vice Chair <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Jan. 6 committee asks three pro-Trump GOP lawmakers for testimony"
  },
  {
    "id": 97,
    "mediaId": 195,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Conservative commentator Meghan McCain pointed to a double standard for men, saying that Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Emily Brooks",
    "title": "Cawthorn ramps up defense as crass videos add to mountain of bad press"
  },
  {
    "id": 91,
    "mediaId": 19,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "Hageman is a Donald Trump-endorsed candidate and has a strong shot at defeating Cheney in the open primary on August 16.\nWe're currently working on a new project in Wyoming, where we're asking for people to explain why <span class='selected-term'>Liz Cheney</span> is their ideal representative, regardless of their party affiliation,? an email from People First to a Wyoming resident reads.",
    "author": "Wendell Husebø",
    "title": "Liz Cheney Aided in GOP Primary by Ad Agency Linked to Biden, BLM, Planned Parenthood"
  },
  {
    "id": 3128,
    "mediaId": 129,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "If you follow politics, you can probably tick off the most prominent names: <span class='selected-term'>Liz Cheney</span>, the House member from Wyoming; Mitt Romney, a senator representing Utah; and Larry Hogan, the governor of Maryland.",
    "author": "",
    "title": "Last night's elections"
  },
  {
    "id": 3123,
    "mediaId": 21,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>, once the No.",
    "author": "Brent D. Griffiths",
    "title": "House Jan. 6 committee subpoenas Kevin McCarthy for his communications with Trump around time of the Capitol attack"
  },
  {
    "id": 3300,
    "mediaId": 65,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "STEFANIK SAYS BECOMING A MOTHER MADE HER 'MORE EFFECTIVE LEADER,' SAYS MOMS IN CONGRESS 'ON A MISSION'\nWith Trump's backing, Stefanik successfully challenged Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., last May for the No.",
    "author": "Marisa Schultz",
    "title": "Elise Stefanik says Republicans are on track to win 'a historic majority'"
  },
  {
    "id": 3301,
    "mediaId": 238,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "America Rising did opposition research work in 2021 for Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Josh Dawsey",
    "title": "More Republicans are working to undermine Trump endorsements"
  },
  {
    "id": 3379,
    "mediaId": 136,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "The House select committeewhich includes two Republicans, <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinoisaims to determine how the events of January 6, and Trump's effort to overturn the 2020 election, were coordinated, as well as how the attack unfolded.",
    "author": "Jason Lemon",
    "title": "Trump Heads to Texas Rally as Allies Face Subpoenas, Pence Clash Ramps Up"
  },
  {
    "id": 3359,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "One Republican, Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, on Monday called out her colleagues for not doing enough to squash the extremist wing of her own party.",
    "author": "",
    "title": "Republicans Play on Fears of Great Replacement' in Bid for Base Voters"
  },
  {
    "id": 6522,
    "mediaId": 376,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Republican Reps. Adam Kinzinger of Illinois and <span class='selected-term'>Liz Cheney</span> of Wyoming have meanwhile blasted GOP leadership for enabling such attitudes among members and voters.",
    "author": "Stephanie Akin\nKate Ackley\nMary Ellen McIntire",
    "title": "At the Races: NY state of turmoil"
  },
  {
    "id": 7292,
    "mediaId": 98,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "The impending primary has split this district, but there's not the deeply felt acrimony of the battle awaiting Wyoming Republican Rep. <span class='selected-term'>Liz Cheney</span>, who also supported impeachment.",
    "author": "Melanie MasonStaff Writer",
    "title": "California Rep. David Valadao voted to impeach. Can he keep his seat if Trump stays quiet?"
  }
]