[
  {
    "id": 83,
    "mediaId": 165,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tim Dickinson",
    "title": "Republicans Promised to Banish Jan. 6 Insurrectionists. A Year Later, They've Purged Jan. 6 Critics"
  },
  {
    "id": 828,
    "mediaId": 718,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Kinzinger and Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "Lynn Sweet",
    "title": "Rep. Kinzinger to focus on fighting right-wing extremism, won't run for governor or Senate"
  },
  {
    "id": 834,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "critics, such as Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, who was purged from House leadership for refusing, in her words, to spread his destructive lies? about 2020.",
    "author": "",
    "title": "A Year After Capitol Riot, Trump's Hold on G.O.P. Is Unrivaled"
  },
  {
    "id": 797,
    "mediaId": 147,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Indeed, during a moment of silence held in honor of law enforcement officers, only two Republicans were present in the House chamber: Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who has become a pariah in her party over her criticism of Trump's actions, and her father, former Vice President Dick Cheney.",
    "author": "Jill Colvin",
    "title": "One year ago, Republicans condemned Jan. 6 insurrection. Yesterday, their response was far more muted."
  },
  {
    "id": 799,
    "mediaId": 12,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Indeed, during a moment of silence held in honor of law enforcement officers, only two Republicans were present in the House chamber: Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who has become a pariah in her party over her criticism of Trump's actions, and her father, former Vice President Dick Cheney.",
    "author": "JILL COLVIN",
    "title": "Top Republicans mark Jan. 6 with silence, deflection"
  },
  {
    "id": 792,
    "mediaId": 112,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "Associated Press",
    "title": "Sen. Thune of South Dakota, the No. 2 Republican, says he'll seek 4th term"
  },
  {
    "id": 793,
    "mediaId": 32,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "",
    "title": "GOP Sen. John Thune of South Dakota says he'll seek a fourth term"
  },
  {
    "id": 795,
    "mediaId": 178,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "STEPHEN GROVES",
    "title": "GOP Sen. John Thune of South Dakota says he'll seek 4th term"
  },
  {
    "id": 723,
    "mediaId": 234,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "Susan Collins of Maine, who did vote to convict Trump in his second impeachment trial, said in response to Trump's pardon comments: We should let the judicial process proceed.? She also called January 6 a dark day in our history.?\nRep. <span class='selected-term'>Liz Cheney</span>, the top Republican on the House select committee investigating the Capitol attack (and one of ten out of 211 Republicans in the House who voted to impeach Trump), also spelled out the dangerous implications of Trump's recent statements on Twitter:\nWhether pardons for convicted rioters willlike Republicans' watering down the seriousness of January 6become something of an adopted party line remains to be seen, the Washington Post's Philip Bump pointed out.",
    "author": "",
    "title": "At Least Some Republicans Realize It's Batshit for Trump To Dangle Pardons for Capitol Rioters"
  },
  {
    "id": 578,
    "mediaId": 238,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "If it were, Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: Can Alaska save democracy?"
  },
  {
    "id": 545,
    "mediaId": 12,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "As former President Donald Trump has downplayed the attack by his supporters last year  the worst attack against the Capitol in two centuries  the RNC last week took a voice vote to approve censuring Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois at the party's winter meeting in Salt Lake City.",
    "author": "",
    "title": "McConnell rebukes RNC, calls Jan. 6 'violent insurrection'"
  },
  {
    "id": 547,
    "mediaId": 195,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "An RNC vote last week to censure two GOP Trump critics, Reps. Adam Kinzinger (Ill.) and <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "Max Greenwood",
    "title": "Trump tightens grip on RNC"
  },
  {
    "id": 498,
    "mediaId": 43,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "When Wyoming's <span class='selected-term'>Liz Cheney</span> lost her GOP leadership position by signing on to discover the truth behind the J6 insurrection, Elise Stefanik ingratiated herself into the job.",
    "author": "",
    "title": "Chinless wonder Lindsey Graham calls Trump dominant'"
  },
  {
    "id": 422,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "The U.S. and our allies must take immediate actions to cripple his regime.?\nRep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., a Trump critic who he is targeting for defeat this fall, responded Tuesday: Former President Trump's adulation of Putin today  including calling him a genius'  aids our enemies.",
    "author": "",
    "title": "Trump praises Putin's 'genius' as GOP fissures grow on Ukraine crisis"
  },
  {
    "id": 40,
    "mediaId": 157,
    "date": "3/20/2022 12:00:00 AM",
    "sentence": "According to the report, the term is being flung around without regard to a lawmaker's conservative background and has been applied to Trump for Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) as well as Trump defender Sen. Lindsey Graham (R-SC) depending on the circumstances.",
    "author": "Tom Boggioni",
    "title": "Trump sicced his followers on the GOP's 'RINOs' -- and it's tearing the party apart: report"
  },
  {
    "id": 311,
    "mediaId": 129,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "And then there's a primary this summer in Wyoming, where <span class='selected-term'>Liz Cheney</span> is fighting to keep her House seat .",
    "author": "",
    "title": "It's Never a Good Time for the Hunter Biden Story"
  },
  {
    "id": 133,
    "mediaId": 238,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The actions of Rep. Matt Gaetz (R-Fla.) and Rep. Mo Brooks (R-Ala.) in particular had crossed a line, McCarthy suggested, noting that Brooks used incendiary language during a Jan. 6 speech and that Gaetz had singled out Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Post Politics Now McCarthy faces House Republicans in wake of audio tape leak"
  },
  {
    "id": 3127,
    "mediaId": 195,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "The <span class='selected-term'>Liz Cheney</span>'s of the world, we got to get rid of them,? Trump said at the rally.",
    "author": "Olafimihan Oshin",
    "title": "Audio: Graham knocked Trump in wake of Jan. 6 attack"
  },
  {
    "id": 3129,
    "mediaId": 21,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "The term has been used often against Trump critics like GOP Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "Cheryl Teh",
    "title": "New audio tapes have leaked of Sen. Lindsey Graham saying that Trump 'went too far' and 'plays the TV game,' while calling Biden the 'best person to have' post-January 6"
  }
]