[
  {
    "id": 853,
    "mediaId": 187,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "I cannot fathom a possible scenario where <span class='selected-term'>Liz Cheney</span> wins.?\nTrump is also 100 percent committed to defeating Georgia Governor Brian Kemp and Senator Lisa Murkowski of Alaska, according to Michael Wolff's book Landslide.",
    "author": "David Catanese",
    "title": "Trump Is Making the Midterms a Referendum on Himself"
  },
  {
    "id": 83,
    "mediaId": 165,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tim Dickinson",
    "title": "Republicans Promised to Banish Jan. 6 Insurrectionists. A Year Later, They've Purged Jan. 6 Critics"
  },
  {
    "id": 828,
    "mediaId": 718,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Kinzinger and Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "Lynn Sweet",
    "title": "Rep. Kinzinger to focus on fighting right-wing extremism, won't run for governor or Senate"
  },
  {
    "id": 782,
    "mediaId": 65,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "Friedman wrote a piece extensively focused on Israeli politics and the \"most diverse national unity government in Israel's history,\" something he suggested, \"might be a harbinger for politics in the U.S.\"\nNYT COLUMNIST DOUBLES DOWN ON DEFENDING RANDI WEINGARTEN AS A CHAMPION OF KEEPING SCHOOLS OPEN\n\"Is that what America needs in 2024  a ticket of Joe Biden and <span class='selected-term'>Liz Cheney</span>?\"",
    "author": "",
    "title": "Biden-Cheney? Twitter melts down over NYT columnist's proposed 2024 ticket"
  },
  {
    "id": 70,
    "mediaId": 881,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Trump antagonist and Wyoming Rep. <span class='selected-term'>Liz Cheney</span> hauled in $2 million in the last three months, a massive haul for a House race in an off-year election, and has $4.7 million in the bank.",
    "author": "Cameron Joseph",
    "title": "Trump's Favorite Candidates Are Getting Crushed in Fundraising"
  },
  {
    "id": 697,
    "mediaId": 21,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Bush cut checks to both Rep. <span class='selected-term'>Liz Cheney</span>, the eldest daughter of his former vice president, and Murkowski, both of whom face reelection this November.",
    "author": "Brent D. Griffiths",
    "title": "Trump endorses primary challenger to GOP Rep. Tom Rice, continuing his effort to rid the party of anyone who supported his impeachment"
  },
  {
    "id": 698,
    "mediaId": 21,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Former President George W. Bush gave the maximum allowed political contributions to Wyoming Rep. <span class='selected-term'>Liz Cheney</span> and Alaska Sen. Lisa Murkowski, two Republicans who supported impeaching former President Donald Trump over the January 6 Capitol riot.",
    "author": "Bryan Metzger",
    "title": "George W. Bush maxes out political donations to Trump impeachment supporters Liz Cheney and Lisa Murkowski"
  },
  {
    "id": 701,
    "mediaId": 195,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Former President George W. Bush gave money to the reelection campaigns of Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Max Greenwood",
    "title": "Ex-President Bush backs two high-profile Republicans slammed by Trump"
  },
  {
    "id": 702,
    "mediaId": 124,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "And on the House side, Trump gave to Harriet Hageman, who is running a primary challenge to Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "Trump gave $1M to Meadows nonprofit weeks after Jan. 6 panel's creation"
  },
  {
    "id": 705,
    "mediaId": 151,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "| Getty Images\nBy Brittany Gibson\n 01/31/2022 08:23 PM EST\nFormer President George W. Bush contributed to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "George W. Bush sends cash to GOP impeachment voters facing challengers"
  },
  {
    "id": 708,
    "mediaId": 188,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "It's worth noting that <span class='selected-term'>Liz Cheney</span> is the daughter of Bush's longtime vice president, Dick Cheney.",
    "author": "Phil Shiver",
    "title": "George W. Bush donates to GOP lawmakers who voted to impeach Trump after Jan. 6 riot"
  },
  {
    "id": 64,
    "mediaId": 124,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Leading the pack was Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who pulled in more than $1.97 million during the last three months of 2021, bringing her yearly total to nearly $6.5 million.",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul"
  },
  {
    "id": 67,
    "mediaId": 43,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "One of the starkest examples comes out of Wyoming, where Rep. <span class='selected-term'>Liz Cheney</span> raised $2 million in the fourth quarter of 2021more than quadrupling the cash haul of her Trump-backed opponent, Harriet Hageman, who brought in $443,000, according to Axios.",
    "author": "",
    "title": "Liz Cheney and other Trump targets trounce his endorsees in the fundraising race"
  },
  {
    "id": 678,
    "mediaId": 65,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Campaign finance reports, first reported by Politico, show that Bush donated thousands of dollars to Republicans Rep. <span class='selected-term'>Liz Cheney</span> and Sen. Lisa Murkowski in 2021.",
    "author": "Andrew Mark Miller",
    "title": "George W. Bush donated thousands to Trump impeachment supporters Cheney, Murkowski"
  },
  {
    "id": 686,
    "mediaId": 237,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Here are some highlights from 2021 fourth-quarter fundraising, covering October through the end of December and 2021 as a whole:\n<span class='selected-term'>Liz Cheney</span> out-raises Trump-endorsed challenger Harriet Hageman\nThe Republican congresswoman is Public Enemy No.",
    "author": "Emily Brooks",
    "title": "Fundraising highlights: GOP rakes in dough and Trump foes show strength"
  },
  {
    "id": 690,
    "mediaId": 129,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "In Wyoming, Representative <span class='selected-term'>Liz Cheney</span>, who was all but exiled by her party for bluntly condemning Mr. Trump's false election claims and has emerged as one of the lead lawmakers on the special committee investigating the Jan. 6 attack, raked in $2 million during the last quarter, entering 2022 with nearly $5 million in cash on hand.",
    "author": "",
    "title": "Republicans Who Voted to Impeach Trump Out-Raised Primary Rivals"
  },
  {
    "id": 593,
    "mediaId": 21,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "The Alaska Republican's response came after the Republican National Committee (RNC) on Friday censured GOP Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois for serving on the January 6 panel.",
    "author": "John L. Dorman",
    "title": "GOP Sen. Lisa Murkowski pushes back against RNC characterization of January 6 as 'legitimate political discourse'"
  },
  {
    "id": 594,
    "mediaId": 151,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "The National Review published a much-discussed editorial on Saturday calling the RNC's censure of Reps. <span class='selected-term'>LIZ CHENEY</span> (R-Wyo.)",
    "author": "",
    "title": "POLITICO Playbook: A Manchin-Murkowski mindmeld"
  },
  {
    "id": 595,
    "mediaId": 124,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "WASHINGTON  Several Republicans are pushing back against the Republican National Committee's vote to formally censure two of their own party members  Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois  over of their work investigating the Jan. 6 attack on the Capitol.",
    "author": "",
    "title": "Several Republicans criticize RNC censure of Cheney, Kinzinger"
  },
  {
    "id": 601,
    "mediaId": 239,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "So, when there is a conflict, when the party is taking an approach or saying things that I think are just absolutely wrong, I think it's my responsibility, as an Alaskan senator speaking out for Alaskans, to just speak the truth,? Ms. Murkowski said on CNN's State of the Union.?\nThe RNC turned heads on Friday when the 168-member body passed a resolution by voice vote that censured Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois for participating in the House select committee investigation into the Jan. 6 attack on the U.S. Capitol.",
    "author": "Seth McLaughlin",
    "title": "Murkowski: RNC absolutely wrong' to call Jan 6 legitimate political discourse'"
  },
  {
    "id": 578,
    "mediaId": 238,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "If it were, Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: Can Alaska save democracy?"
  },
  {
    "id": 502,
    "mediaId": 195,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "In a voice vote (rather than a roll call, where individuals reveal their yeas and nays), the Republican National Committee censured <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Glenn C. Altschuler",
    "title": "Republicans do not have a right to remain silent"
  },
  {
    "id": 491,
    "mediaId": 25,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "The Republican National Committee censured the two Republicans on that committee, Representatives <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, earlier in February.",
    "author": "Adam Brewster",
    "title": "Senator Rick Scott says he will \"absolutely\" vote for McConnell to be leader"
  },
  {
    "id": 360,
    "mediaId": 237,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "He's endorsing earlier and trying to oust at least 10 members of his party from the federal government, such as Wyoming Rep. <span class='selected-term'>Liz Cheney</span> and Alaska Sen. Lisa Murkowski.",
    "author": "Virginia Aabram",
    "title": "Has Trump's seal lost its appeal?"
  },
  {
    "id": 355,
    "mediaId": 43,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "However well-known Republican never-Trumpers such as Rep. <span class='selected-term'>Liz Cheney</span>, Sen. Lisa Murkowski, and Rep. Adam Kinzinger, as well as Republican moderates who have been less outspoken about Trump like Sen. Mitt Romney, might very well run against him.",
    "author": "",
    "title": "If Cheney and Murkowski run against Trump they won't win but will hurt him by tying him to Putin"
  },
  {
    "id": 188,
    "mediaId": 195,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Lexi Lonas",
    "title": "Five takeaways from last quarter's fundraising"
  },
  {
    "id": 108,
    "mediaId": 151,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Bush last year appeared at a fundraiser for Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "George W. Bush to appear at fundraiser for Trump nemesis Kemp"
  },
  {
    "id": 104,
    "mediaId": 239,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "Earlier this year, Mr. Bush donated to Republican Sen. Lisa Murkowski of Alaska and Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming.",
    "author": "Haris Alic",
    "title": "George W. Bush to headline $5K-a-head fundraiser for Trump foe Brian Kemp"
  }
]