[
  {
    "id": 529,
    "mediaId": 129,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Mr. Frias was among the estimated two dozen of 168 Republican National Committee members who voted last week against the party's resolution to censure Representatives <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, the two Republicans working with congressional Democrats to investigate the Jan. 6 riot.",
    "author": "",
    "title": "How the G.O.P.'s Censure Fight Exposes the Party's Deeper Divide"
  },
  {
    "id": 535,
    "mediaId": 21,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who has now been censured by state party officials and the Republican National Committee, is running for reelection against Trump pick Harriet Hageman.",
    "author": "Warren Rojas",
    "title": "Trump is on an endorsement spree and has now put his MAGA stamp on more than 100 political candidates since leaving the White House"
  },
  {
    "id": 497,
    "mediaId": 129,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "The fund-raiser at Mr. Thiel's Miami Beach compound last month was for a conservative candidate challenging Representative <span class='selected-term'>Liz Cheney</span> of Wyoming for a spot on the ballot in November's midterm elections.",
    "author": "",
    "title": "The Right's Would-Be Kingmaker"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "All face challenging roads to reelection, particularly Rep. <span class='selected-term'>Liz Cheney</span>, the most outspoken of them, who has enraged so many Wyoming Republicans that they are plotting to alter state election laws to cut off one potential route to political survival.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "One of the event's expected highlights: Rep. Jim Jordan, R-Ohio, a top Trump ally in the House, is scheduled to interview congressional candidate Harriet Hageman, who was recruited by Trump and his allies to challenge Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>'s (R-Wyo.)",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Wyoming's At-Large Congressional District Rep. <span class='selected-term'>Liz Cheney</span> (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising"
  },
  {
    "id": 2,
    "mediaId": 163,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "* Versus U.S. Representative <span class='selected-term'>Liz Cheney</span>\n* Aug. 16 Wyoming at-large-district Republican primary\nTrump threw his backing behind Hageman, a land-use lawyer, in September 2021, looking to punish Cheney, who was stripped of her role as the No.",
    "author": "Reuters",
    "title": "Factbox: Trump's endorsement power faces test in key elections"
  }
]