[
  {
    "id": 838,
    "mediaId": 129,
    "date": "1/4/2022 12:00:00 AM",
    "sentence": "But some, including Harriet Hageman, who is mounting a primary challenge against Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, one of Mr. Trump's harshest Republican critics, and Kelly Tshibaka, who is running in the primary against Senator Lisa Murkowski, Republican of Alaska, have been asked to hold the date, according to a person familiar with the planning who was not authorized to discuss it.",
    "author": "",
    "title": "As Midterms and 2024 Loom, Trump Political Operation Revs Up"
  },
  {
    "id": 831,
    "mediaId": 63,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "A request from the committee to view Trump Administration documents awaits a Supreme Court ruling after Trump sued to block their release, and Trump has often derided the group as the Unselect Committee? and questioned the intentions of the two Republicans on the panel, Reps. <span class='selected-term'>Liz Cheney</span> (Wy.)",
    "author": "Derek Saul",
    "title": "Trump Calls Off Press Conference On Capitol Attack Anniversary"
  },
  {
    "id": 482,
    "mediaId": 19,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Trump's son, Donald Trump Jr., previously called her the Alabama <span class='selected-term'>Liz Cheney</span>.?\nBrooks has been a fierce opponent of the Chamber's mass immigration agenda, and U.S. free trade with China initiatives.",
    "author": "John Binder",
    "title": "Mo Brooks Scores Fundraiser with Trump as Primary Opponent Fumbles Mar-a-Lago Meeting"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "One of the event's expected highlights: Rep. Jim Jordan, R-Ohio, a top Trump ally in the House, is scheduled to interview congressional candidate Harriet Hageman, who was recruited by Trump and his allies to challenge Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores"
  },
  {
    "id": 422,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "The U.S. and our allies must take immediate actions to cripple his regime.?\nRep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., a Trump critic who he is targeting for defeat this fall, responded Tuesday: Former President Trump's adulation of Putin today  including calling him a genius'  aids our enemies.",
    "author": "",
    "title": "Trump praises Putin's 'genius' as GOP fissures grow on Ukraine crisis"
  },
  {
    "id": 186,
    "mediaId": 129,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "You are doing great!? he wrote last October to Harriet Hageman, who is challenging Representative <span class='selected-term'>Liz Cheney</span> of Wyoming.",
    "author": "",
    "title": "Mar-a-Lago Machine: Trump as a Modern-Day Party Boss"
  },
  {
    "id": 150,
    "mediaId": 195,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Rep. Matt Gaetz (R-Fla.), who has called for Trump to run for Speaker instead of McCarthy, took a dig at McCarthy for sticking with Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Emily Brooks",
    "title": "McCarthy's future hangs in limbo as Washington awaits Trump response"
  },
  {
    "id": 151,
    "mediaId": 124,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Rep. Matt Gaetz, R-Fla., a Trump loyalist who has repeatedly raised questions about McCarthy's leadership tweeted Friday: While I was rallying in Wyoming against <span class='selected-term'>Liz Cheney</span>  Kevin McCarthy was defending Liz Cheney among House Republicans.?\nGaetz only represents a minority of House Republicans.",
    "author": "",
    "title": "McCarthy's leaked Trump remarks complicate quest to be House speaker"
  },
  {
    "id": 161,
    "mediaId": 25,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "In the January 10 meeting, Wyoming Rep. <span class='selected-term'>Liz Cheney</span>  who was the chairwoman of the Republican conference at the time  asks McCarthy if there's any chance Trump would resign.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy told fellow GOP leaders he was \"seriously thinking\" about telling Trump to resign after Jan. 6, recording shows"
  },
  {
    "id": 162,
    "mediaId": 25,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "In the January 10 meeting, Wyoming Rep. <span class='selected-term'>Liz Cheney</span>  who was the chairwoman of the Republican conference at the time  asks McCarthy if there's any chance Trump would resign.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy told fellow GOP leaders he was \"seriously thinking\" about telling Trump to resign after Jan. 6, recording shows"
  },
  {
    "id": 141,
    "mediaId": 163,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "One thing is certain: Trump will make the final decisions and will surely spend money to defeat Republicans like <span class='selected-term'>Liz Cheney</span> who voted to impeach him following the Jan. 6, 2020 assault by his supporters on the U.S. Capitol, the sources said.",
    "author": "Alexandra Ulmer",
    "title": "Exclusive: Trump weighs how deeply to dig into his war chest for midterms"
  },
  {
    "id": 143,
    "mediaId": 593,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "One thing is certain: Trump will make the final decisions and will surely spend money to defeat Republicans like <span class='selected-term'>Liz Cheney</span> who voted to impeach him following the Jan. 6, 2020 assault by his supporters on the U.S. Capitol, the sources said.",
    "author": "Jarrett Renshaw and Alexandra Ulmer",
    "title": "Exclusive-Trump Weighs How Deeply To Dig Into His War Chest For November Elections"
  },
  {
    "id": 3129,
    "mediaId": 21,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "The term has been used often against Trump critics like GOP Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "Cheryl Teh",
    "title": "New audio tapes have leaked of Sen. Lindsey Graham saying that Trump 'went too far' and 'plays the TV game,' while calling Biden the 'best person to have' post-January 6"
  },
  {
    "id": 3363,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "The former president said he was not sure if McIntosh remained an ally and declined to say whether he'd taken his calls, but did note he was working with him on some races, such as ousting Republican Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming.",
    "author": "Isaac Arnsdorf",
    "title": "How Trump's pact with the Club for Growth turned into a grudge match"
  }
]