[
  {
    "id": 834,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "critics, such as Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, who was purged from House leadership for refusing, in her words, to spread his destructive lies? about 2020.",
    "author": "",
    "title": "A Year After Capitol Riot, Trump's Hold on G.O.P. Is Unrivaled"
  },
  {
    "id": 810,
    "mediaId": 187,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Trump has endorsed a series of primary challengers to Republicans who resisted his false claims in 2020, including Representative <span class='selected-term'>Liz Cheney</span> in Wyoming and Georgia's Brian Kemp and Brad Raffensperger, the governor and secretary of state, respectively.",
    "author": "Ronald Brownstein",
    "title": "It's Time for Democrats to Break the Glass"
  },
  {
    "id": 600,
    "mediaId": 19,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "The Times also describes Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming as an instigating force: Some of the Democrats on the committee were concerned that if the panel was too aggressive, Republicans might turn the tables on the Democrats whenever they took back control of the House.",
    "author": "Joel B. Pollak",
    "title": "NY Times Warns: Republicans Can Use January 6 Committee's Precedent to Pursue Democrats After Midterm Elections"
  },
  {
    "id": 379,
    "mediaId": 33,
    "date": "3/4/2022 12:00:00 AM",
    "sentence": "A potential criminal prosecution, however, could represent a significant return for the two GOP members of the panel, Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, who have put their political careers on the line to oppose Trump.",
    "author": "Stephen Collinson",
    "title": "January 6 committee's aggressive approach on Trump may put Merrick Garland in a tight spot"
  },
  {
    "id": 373,
    "mediaId": 195,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "She instead tapped Reps. Adam Kinzinger (R-Ill.) and <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Alexander Bolton",
    "title": "Republicans warn Justice Department probe of Trump would trigger political war"
  }
]