[
  {
    "id": 66,
    "mediaId": 238,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Even Harriet Hageman, Trump's favorite to take out Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, brought in only $443,000.",
    "author": "",
    "title": "Opinion: Trump-endorsed candidates are having trouble fundraising. That's a bad sign for the former president."
  },
  {
    "id": 67,
    "mediaId": 43,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "One of the starkest examples comes out of Wyoming, where Rep. <span class='selected-term'>Liz Cheney</span> raised $2 million in the fourth quarter of 2021more than quadrupling the cash haul of her Trump-backed opponent, Harriet Hageman, who brought in $443,000, according to Axios.",
    "author": "",
    "title": "Liz Cheney and other Trump targets trounce his endorsees in the fundraising race"
  },
  {
    "id": 690,
    "mediaId": 129,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "In Wyoming, Representative <span class='selected-term'>Liz Cheney</span>, who was all but exiled by her party for bluntly condemning Mr. Trump's false election claims and has emerged as one of the lead lawmakers on the special committee investigating the Jan. 6 attack, raked in $2 million during the last quarter, entering 2022 with nearly $5 million in cash on hand.",
    "author": "",
    "title": "Republicans Who Voted to Impeach Trump Out-Raised Primary Rivals"
  },
  {
    "id": 628,
    "mediaId": 238,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "So we reach the recent apex: the party trying to rationalize a condemnation of Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "The GOP's rationale for condemning Cheney and Kinzinger is predictably Trumpian"
  },
  {
    "id": 33,
    "mediaId": 675,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., has raised more than $7 million, the vast majority of it from outside of the state she is supposed to be representing, Wyoming.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!"
  },
  {
    "id": 34,
    "mediaId": 675,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., has raised more than $7 million, the vast majority of it from outside of the state she is supposed to be representing, Wyoming.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!"
  },
  {
    "id": 259,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Last month, when Stefanik endorsed a primary opponent of Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, whose GOP leadership post she now holds, Stefanik went above and beyond to turn the knife.",
    "author": "",
    "title": "Elise Stefanik is the human embodiment of how the GOP went down the tubes"
  },
  {
    "id": 243,
    "mediaId": 43,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "As Politico's Olivia Beavers wrote, Cawthorn showed up at a fundraiser on Wednesday night for Harriet Hageman, who is opposing Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) for the GOP nomination for Wyoming's one House seat after being endorsed by Donald Trump.",
    "author": "",
    "title": "North Carolina Open Thread: Usual cast of villains, Rooftop solar, pharmaceutical waste and more"
  },
  {
    "id": 28,
    "mediaId": 157,
    "date": "4/4/2022 12:00:00 AM",
    "sentence": "But you look at <span class='selected-term'>Liz Cheney</span>, Liz is not concerned.",
    "author": "Matthew Chapman",
    "title": "Trump's power over GOP could disappear in just four months: MSNBC analysts"
  },
  {
    "id": 24,
    "mediaId": 238,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "The six other Republicans who voted to impeach Trump who are running again  including Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "Amy B Wang",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection"
  },
  {
    "id": 238,
    "mediaId": 136,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Trump took a similar route of endorsing a Republican challenger over Wyoming Representative <span class='selected-term'>Liz Cheney</span>, one of the group of 10 who has taken the additional step of serving on the House committee investigating the Capitol attack.",
    "author": "Zoe Strozewski",
    "title": "Trump Asks 'Who's Next' Among GOP Who Voted to Impeach as Upton Retires"
  },
  {
    "id": 240,
    "mediaId": 19,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Reps. Tom Rice (R-SC) and <span class='selected-term'>Liz Cheney</span> (R-WY) are facing tough reelection campaigns.",
    "author": "Wendell Husebø",
    "title": "40 Percent of House Republicans Who Voted to Impeach Trump to Exit Congress, Fred Upton the Latest"
  },
  {
    "id": 21,
    "mediaId": 120,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Wyoming's <span class='selected-term'>Liz Cheney</span> has been formally rejected by the Republican National Committee, and her House Republican colleagues have endorsed  and extended financial support to  her GOP primary rival.",
    "author": "Steve Benen",
    "title": "What members of the House GOP's Impeachment 10 have in common"
  },
  {
    "id": 234,
    "mediaId": 43,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Overnight News Digest: Ruble recovers as Russian oil flows; IPCC act now to prevent climate disaster"
  },
  {
    "id": 11,
    "mediaId": 376,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, who was ousted from the House GOP leadership for refusing to support Trump's false claim of widespread fraud in the 2020 election, raised more than $2.9 million and finished the quarter with $6.8 million.",
    "author": "Herb Jackson",
    "title": "Trump targets outraise challengers, unlike some other incumbents"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 167,
    "mediaId": 209,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "The John F. Kennedy Library Foundation will, for the first time ever, honor 5 individuals with the John F. Kennedy Profile in Courage Award this year, including Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Brigid Kennedy",
    "title": "Zelensky, Liz Cheney among recipients of JFK Profile in Courage Award"
  },
  {
    "id": 137,
    "mediaId": 19,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "So lets stop election deniers  who might refuse to certify accurate election results they disagree with  from taking over our democracy.https://t.co/uhNKFMPNMD\n Jocelyn Benson (@JocelynBenson) April 3, 2022\nThe four other award recipients ran the gamut of courageous,? from Ukrainian President Volodymyr Zelensky, whose country is involved in a deadly conflict with Russia, to Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), who has severed ties with her party through her nonstop condemnations of Trump over the 2020 election.",
    "author": "Ashley Oliver",
    "title": "Top Michigan Democrats Questioned Election Outcomes That Favored Republicans"
  }
]