[
  {
    "id": 470,
    "mediaId": 21,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "He can largely ruin a Republican's standing within his or her own party  just ask Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois.",
    "author": "Kimberly Leonard",
    "title": "A Trump-free 2024 race would trigger Republican chaos: 'Everybody is running.'"
  },
  {
    "id": 455,
    "mediaId": 43,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": " John Collins (@Logically_JC) February 18, 2022\nFormer Vice President Mike Pence on Thursday defended the Republican National Committee's February 4th resolution that censured United States Representatives <span class='selected-term'>Liz Cheney</span> (R-Wyoming) and Adam Kinzinger (R-Illinois) and designated the January 6th, 2021 Capitol insurrection as legitimate political discourse.?\n[...]\nSpeaking at a College Republicans event at Stanford University as reported by The Washington Post, Pence said that the RNC was not talking about people that engaged in violence against persons or property that day.? Rather, the diktat was meant to stand up for a whole range of people that have been set upon? by the bipartisan congressional panel.",
    "author": "",
    "title": "'legitimate political discourse'? Lord HeeHawley or Lando Cotton: better than Mike Pence in 2024?"
  },
  {
    "id": 286,
    "mediaId": 19,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "Former Vice President Mike Pence placed third with ten percent support, followed by former U.S. ambassador to the U.N. Nikki Haley (8 percent), Rep. <span class='selected-term'>Liz Cheney</span> (8 percent), and Sen. Ted Cruz (R-TX):\nThat survey also found Trump leading President Biden by four percentage points  47 percent to 43 percent.",
    "author": "Hannah Bleau",
    "title": "Poll: Majority Support Trump in Republican Primary"
  },
  {
    "id": 175,
    "mediaId": 19,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "In 2022, both men have supported anti-American First primary candidates, such as warmonger Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), who is in a tough primary fight against Trump-endorsed Harriet Hageman.",
    "author": "Wendell Husebø",
    "title": "Poll: Donald Trump Commands GOP's Greatest Favorability Rating, Romney and McConnell Lowest"
  }
]