[
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "And Rep. <span class='selected-term'>Liz Cheney</span>, the Republican vice-chair of the House Select Committee probing the January 6 insurrection, will face Trump-backed Harriet Hageman in Wyoming's at-large House seat.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP"
  },
  {
    "id": 780,
    "mediaId": 43,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "At the national level Republicans retaliated against Congresswoman <span class='selected-term'>Liz Cheney</span> for voting her conscience.",
    "author": "",
    "title": "Trump Supporters: Deceivers and the Deceived"
  },
  {
    "id": 716,
    "mediaId": 157,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "And in Wyoming, GOP Rep. <span class='selected-term'>Liz Cheney</span> raised $2 million in the last quarter, compared to Trump back challengers Harriet Hageman's $443,000.",
    "author": "John Wright",
    "title": "MAGA candidates getting trounced in fundraising -- and showing limits of Trump's power: report"
  },
  {
    "id": 644,
    "mediaId": 25,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Trending News\n The January 6 trial that will set the standard for hundreds to follow\n Pence says \"Trump is wrong\" that he could have overturned election\n Lawmaker wants Yellowstone's \"zone of death\" loophole fixed\n What's behind the push for a fourth stimulus check\n RNC approves measure to censure <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "North Carolina Supreme Court orders redrawing of congressional map"
  },
  {
    "id": 586,
    "mediaId": 151,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "The RNC censured Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger and deemed Jan. 6 legitimate political discourse.?\nFor all the energy he creates at the party's grassroots,? Trump's stranglehold on the party is emerging as one of the biggest threats to the GOP's otherwise bright prospects in November,? David and Natalie wrote.",
    "author": "",
    "title": "Mask wars claim another pol"
  },
  {
    "id": 504,
    "mediaId": 43,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "NC's Rep. Ted Budd: Jan. 6 committee is in the way of freedom-loving Americans'\nNews&Observer, DANIELLE BATTAGLIA, 2/12/2022\nU.S. Rep. Ted Budd called his House colleagues <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger divisive? Wednesday and said their work on the Jan. 6 committee is getting in the way of freedom-loving Americans.? His comments came during a segment on a conservative talk radio show about whether President Joe Biden is using a back-door plan to influence elections.",
    "author": "",
    "title": "North Carolina Open Thread: McCrory love story, Lumber River, Book banning, Redistricting, Cawthorn"
  },
  {
    "id": 339,
    "mediaId": 151,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "GOP candidates are already pummeling each other in monthslong advertising free-for-alls, fights intensified by unprecedented television spending.?\nTHE COWBOY STATE  <span class='selected-term'>Liz Cheney</span> turns to Democrats to save her hide,? by Tara Palmeri, POLITICO: In 2007, in this blue bastion of one of the reddest states in the country, liberal activists wheeled a giant statue of Dick Cheney through town to protest his star role in the Iraq War  before toppling it, Saddam Hussein style, for good measure.",
    "author": "STEPHANIE MURRAY",
    "title": "Biden hits the fundraising circuit"
  },
  {
    "id": 320,
    "mediaId": 25,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "The only lawmaker who has faced lingering consequences is Wyoming Republican Rep. <span class='selected-term'>Liz Cheney</span>, who was removed from her leadership position in the House Republican conference after repeatedly criticizing former President Trump for his role in the January 6 riot.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy"
  },
  {
    "id": 280,
    "mediaId": 1576,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Meanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 269,
    "mediaId": 65,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "TRUMP RETURNING TO GEORGIA TO CAMPAIGN WITH DAVID PERDUE, HERSCHEL WALKER\nMeanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 245,
    "mediaId": 43,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "As Politico's Olivia Beavers wrote, Cawthorn showed up at a fundraiser on Wednesday night for Harriet Hageman, who is opposing Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) for the GOP nomination for Wyoming's one House seat after being endorsed by Donald Trump.",
    "author": "",
    "title": "DKos Asheville Open Thread: He just can't stop"
  },
  {
    "id": 243,
    "mediaId": 43,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "As Politico's Olivia Beavers wrote, Cawthorn showed up at a fundraiser on Wednesday night for Harriet Hageman, who is opposing Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) for the GOP nomination for Wyoming's one House seat after being endorsed by Donald Trump.",
    "author": "",
    "title": "North Carolina Open Thread: Usual cast of villains, Rooftop solar, pharmaceutical waste and more"
  },
  {
    "id": 135,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "His fury at Wyoming Representative <span class='selected-term'>Liz Cheney</span>, who voted to impeach him and sits on the House Select Committee investigating the January 6 attack on the U.S. Capitol, led him to endorse her primary opponent, corporate lawyer Harriet Hageman.",
    "author": "Steve Friess",
    "title": "GOP Races Dominated by MAGA CandidatesWhether Trump Has Backed Them or Not"
  }
]