[
  {
    "id": 735,
    "mediaId": 21,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "One feature of this micro-coalition of more dedicated Trump disciples is their ability to help cast out ideological dissenters, such as Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who was ousted from her House GOP leadership post after repeatedly criticizing Trump for inciting the January 6 insurrection.",
    "author": "Jake Lahut",
    "title": "How Marjorie Taylor Greene's endorsement of J.D. Vance shows what it takes to make it into the next generation's MAGA clique"
  },
  {
    "id": 736,
    "mediaId": 21,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "One feature of this micro-coalition of more dedicated Trump disciples is their ability to help cast out ideological dissenters, such as Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who was ousted from her House GOP leadership post after repeatedly criticizing Trump for inciting the January 6 insurrection.",
    "author": "Jake Lahut",
    "title": "How Marjorie Taylor Greene's endorsement of J.D. Vance shows what it takes to make it into the next generation's MAGA clique"
  },
  {
    "id": 644,
    "mediaId": 25,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Trending News\n The January 6 trial that will set the standard for hundreds to follow\n Pence says \"Trump is wrong\" that he could have overturned election\n Lawmaker wants Yellowstone's \"zone of death\" loophole fixed\n What's behind the push for a fourth stimulus check\n RNC approves measure to censure <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "North Carolina Supreme Court orders redrawing of congressional map"
  },
  {
    "id": 516,
    "mediaId": 193,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "In Wyoming, a slew of candidates dropped out after he announced his support for Harriet Hageman's bid against a top Trump critic, Rep. <span class='selected-term'>Liz Cheney</span>.",
    "author": "Jill Colvin",
    "title": "Donald Trump turns to endorsements to keep bending GOP to his will"
  },
  {
    "id": 447,
    "mediaId": 195,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "LEADING THE DAY\nPOLITICS: House Minority Leader Kevin McCarthy (R-Calif.) on Thursday endorsed Harriet Hageman, the primary challenger looking to unseat Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - One day, two continents, words of war"
  },
  {
    "id": 419,
    "mediaId": 65,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "Vance said the statements from Gibbons and Timken reflect the foreign policy of Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., rather than former President Donald Trump.",
    "author": "",
    "title": "Russia's Ukraine invasion makes waves in Ohio Senate race"
  },
  {
    "id": 335,
    "mediaId": 238,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Opinion: How to defeat the MAGA cult: Build a coalition that transcends party"
  },
  {
    "id": 238,
    "mediaId": 136,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Trump took a similar route of endorsing a Republican challenger over Wyoming Representative <span class='selected-term'>Liz Cheney</span>, one of the group of 10 who has taken the additional step of serving on the House committee investigating the Capitol attack.",
    "author": "Zoe Strozewski",
    "title": "Trump Asks 'Who's Next' Among GOP Who Voted to Impeach as Upton Retires"
  },
  {
    "id": 227,
    "mediaId": 65,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: Harriet Hageman, the leading Republican candidate challenging Rep. <span class='selected-term'>Liz Cheney</span> as Wyoming's at-large member of the House runs for re-election this year, reports that she's raked in over $1.3 million during the January-March first quarter of fundraising.",
    "author": "",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in over $1.3 million past three months"
  },
  {
    "id": 176,
    "mediaId": 151,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Thiel, a close Trump ally, earlier this year held a fundraiser for Wyoming Republican Harriet Hageman, who is running to unseat GOP Rep. <span class='selected-term'>Liz Cheney</span>, an outspoken Trump critic.",
    "author": "",
    "title": "Vance parlays Trump endorsement into new Thiel money"
  },
  {
    "id": 141,
    "mediaId": 163,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "One thing is certain: Trump will make the final decisions and will surely spend money to defeat Republicans like <span class='selected-term'>Liz Cheney</span> who voted to impeach him following the Jan. 6, 2020 assault by his supporters on the U.S. Capitol, the sources said.",
    "author": "Alexandra Ulmer",
    "title": "Exclusive: Trump weighs how deeply to dig into his war chest for midterms"
  },
  {
    "id": 142,
    "mediaId": 881,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Just two days after the attack on the Capitol, McCarthy told other top House Republicans, including then-conference chair Rep. <span class='selected-term'>Liz Cheney</span>, that he was seriously considering? having a conversation with Trump to urge the president to resign.",
    "author": "Paul Blest",
    "title": "Kevin McCarthy Is Now Straight-Up Lying About Wanting Trump to Resign"
  },
  {
    "id": 138,
    "mediaId": 33,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Trump has been especially annoyed, one ally said, that the Club has not endorsed or lent assistance to Wyoming congressional hopeful Harriet Hageman, who is challenging incumbent Rep. <span class='selected-term'>Liz Cheney</span> in one of the former President's highest-profile efforts to oust his foes inside the GOP.",
    "author": "Gabby Orr",
    "title": "Trump unleashes his temper on GOP allies over Ohio Senate primary split"
  },
  {
    "id": 130,
    "mediaId": 129,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Mr. Trump made clear that he considers Mr. McIntosh to be by his side on a fight he cares most about: We're fighting <span class='selected-term'>Liz Cheney</span>,? Mr. Trump said of the Wyoming congresswoman who is a key figure in the committee investigating the Jan. 6, 2021 attack on the Capitol and Mr. Trump's role in the events leading to it.",
    "author": "",
    "title": "A big G.O.P. group amplifies its attacks on a Trump-backed Ohio candidate."
  },
  {
    "id": 122,
    "mediaId": 129,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "Fourth, expect the remains of the establishment to divide over whether to rally around a candidate of anti-Trump principle  from <span class='selected-term'>Liz Cheney</span> to certain incarnations of Mike Pence  or to make their peace with a harder-edged figure like DeSantis.",
    "author": "",
    "title": "The Ohio Primary and the Return of the Republican Civil War"
  },
  {
    "id": 123,
    "mediaId": 65,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "Mandel also called out anti-Trump Republican Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, as well as Sen. Mitt Romney, R-Utah, saying: \"we need to do everything we can to eliminate them from the Republican Party and from politics.\"",
    "author": "Tyler Olson",
    "title": "With Cruz backing, Mandel brushes off RINO' attacks after book alleges dishonesty"
  },
  {
    "id": 99,
    "mediaId": 65,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "They believe Biden is a return to normalcy and that the next presidential contest will include a mannerly Republican they can abide because the party platform will go back to being bait only used to deceptively snare enough votes without any intention of it guiding action (echoes of McCain and Romney with a side of <span class='selected-term'>Liz Cheney</span>.)",
    "author": "Matt Schlapp",
    "title": "JD Vance's victory proves the old GOP has been transformed"
  },
  {
    "id": 5772,
    "mediaId": 238,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Mandel, and hes doing great.?\nAfter the endorsement was made official, Trump Jr. launched a vicious attack against Vances competitors, alluding to two-faced Republicans who  sell out our America First agenda to the swamp,? and adding that the other Republicans in this race have more in common with Bill Kristol and <span class='selected-term'>Liz Cheney</span>s foreign policy, than the America First foreign policy of my father.? The snubs didnt deter the others from professing their continued allegiance to Trump, like jilted lovers hoping for another chance.",
    "author": "",
    "title": "Opinion The bottom line in Ohio? Trump wins."
  },
  {
    "id": 94,
    "mediaId": 424,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "It's even possible that Representative <span class='selected-term'>Liz Cheney</span>, a neoconservative firebrand who broke with Trump following the insurrection, could win another term in Wyoming.",
    "author": "John Nichols",
    "title": "Meet the Poster Boy for the GOP's Trumpian Cult of Personality"
  },
  {
    "id": 95,
    "mediaId": 33,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Thiel himself also hosted a fundraiser for Hageman, the Wyoming GOP hopeful who is looking to unseat Rep. <span class='selected-term'>Liz Cheney</span>, at his Miami Beach mansion earlier this year that featured Donald Trump Jr. as a guest.",
    "author": "Gabby Orr and Michael Warren",
    "title": "Peter Thiel plans to wind down his involvement in 2022 after Vance's victory in Ohio"
  },
  {
    "id": 89,
    "mediaId": 195,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "And perhaps most prominently in Wyoming, Rep. <span class='selected-term'>Liz Cheney</span> (R) is in the fight for her political life in a primary against Trump-backed attorney Harriet Hageman later in August.",
    "author": "Tal Axelrod",
    "title": "Pro-Trump candidates look to harness populist energy after Ohio"
  },
  {
    "id": 3363,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "The former president said he was not sure if McIntosh remained an ally and declined to say whether he'd taken his calls, but did note he was working with him on some races, such as ousting Republican Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming.",
    "author": "Isaac Arnsdorf",
    "title": "How Trump's pact with the Club for Growth turned into a grudge match"
  }
]