[
  {
    "id": 401,
    "mediaId": 238,
    "date": "2/26/2022 12:00:00 AM",
    "sentence": "The main attractions on Saturday were Rep. <span class='selected-term'>Liz Cheney</span>, the Wyoming Republican and fierce Trump critic recently removed from GOP House leadership, and Brad Raffensperger, the Republican secretary of state of Georgia who rebuffed Trump's claims of widespread voter fraud.",
    "author": "",
    "title": "A MAGA gala, a far-right rally, and a plea for Jan. 6 justice: Trio of summits tests GOP's future"
  },
  {
    "id": 402,
    "mediaId": 124,
    "date": "2/26/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump will address his supporters at an annual meeting of conservative activists in Orlando, Florida, while his Republican critics will hear from the congresswoman he's hellbent on defeating  Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "With Liz Cheney's re-election prospects in doubt, her national profile grows"
  },
  {
    "id": 396,
    "mediaId": 223,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "While <span class='selected-term'>Liz Cheney</span> was cavorting with Never Trump sissies and squeezing donors, her opponent Harriet Hageman was at CPAC and word is that the Beltway Cowgirl is doomed.",
    "author": "Kurt Schlichter",
    "title": "The Big News Out of CPAC 2022 Is That Trump Is Back"
  },
  {
    "id": 305,
    "mediaId": 376,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was kicked out of her role as conference chair just weeks after last year's retreat in Orlando.",
    "author": "Chris Marquette",
    "title": "House GOP heads to Florida to narrow in on policy plans"
  },
  {
    "id": 283,
    "mediaId": 239,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "A leader with honor would be rejecting  not protecting  the pro-Putin, anti-Semitic, white nationalist members of the party, instead of fighting against <span class='selected-term'>Liz Cheney</span> for telling the truth,? Cheney campaign spokesman Jeremy Adler said Thursday.",
    "author": "Kerry Picket",
    "title": "Cheney spokesman says GOP lawmakers support Putin for endorsing her primary opponent"
  },
  {
    "id": 247,
    "mediaId": 99,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Amodei  along with about 100 other Republicans  endorsed and co-hosted a fundraiser for Harriet Hageman, who is running against Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., a member of the House committee investigating Jan. 6 and a fierce Trump critic.",
    "author": "Steve Sebelius",
    "title": "PARTY LINES: Mayoral term limits, again?"
  }
]