[
  {
    "id": 88,
    "mediaId": 151,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "Some of our favorite zingers on this year's card: Quit swearing, start saying come on, man'? and Explain to my early 2000s self that <span class='selected-term'>Liz Cheney</span> is a resistance hero.?\nTRANSITION  Andrew Isenhour is now deputy comms director for Georgia Gov.",
    "author": "",
    "title": "POLITICO Playbook: Welcome to 2022"
  },
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "And Rep. <span class='selected-term'>Liz Cheney</span>, the Republican vice-chair of the House Select Committee probing the January 6 insurrection, will face Trump-backed Harriet Hageman in Wyoming's at-large House seat.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP"
  },
  {
    "id": 83,
    "mediaId": 165,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "Tim Dickinson",
    "title": "Republicans Promised to Banish Jan. 6 Insurrectionists. A Year Later, They've Purged Jan. 6 Critics"
  },
  {
    "id": 84,
    "mediaId": 43,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "So far, Trump has endorsed primary opponents for at least five of them, including Gonzalez (who's retiring), Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming, Jaime Herrera Beutler of Washington, and Peter Meijer and Fred Upton of Michigan, who serve neighboring districts on the west side of the state.",
    "author": "",
    "title": "Ten House Republicans voted to impeach Trump. Some then fell silent while others spoke up"
  },
  {
    "id": 85,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Liz Cheney</span> of Wyoming has gone from a star in the House Republican leadership to an exiled party gadfly and truth teller.",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6"
  },
  {
    "id": 832,
    "mediaId": 1343,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Republican politicians who condemned the insurrection, even with impeccable conservative credentials like <span class='selected-term'>Liz Cheney</span>, were shunned by the Republican Party or decided not to run again.",
    "author": "John Hudak",
    "title": "Around the Halls: One year since the January 6 insurrection"
  },
  {
    "id": 80,
    "mediaId": 124,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Rep. Cheney showed great deal of moral courage' on Jan. 6, says Rep. Sherrill\nJan. 6, 202201:17\n\"It's appropriate to point out one person who I think has shown a great deal of moral courage, someone who stood up for her country at great personal cost, and that is <span class='selected-term'>Liz Cheney</span>,\" Sherrill said of the Wyoming congresswoman who is one of two Republicans serving on the House committee investigating the Capitol attack.",
    "author": "",
    "title": "Jan. 6 Capitol riot: Full anniversary coverage"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>\nWyoming's lone representative voted with Trump's position an estimated 93% of the time while he was in office, but she became a vocal critic of his actions leading up to and during the Jan. 6 riot and his efforts to overturn the results of the 2020 presidential election.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 68,
    "mediaId": 163,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Representative Elise Stefanik, who replaced Representative <span class='selected-term'>Liz Cheney</span> as the No.",
    "author": "Alexandra Ulmer",
    "title": "Republican U.S. lawmakers funnel money to colleagues who crossed Trump"
  },
  {
    "id": 70,
    "mediaId": 881,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Trump antagonist and Wyoming Rep. <span class='selected-term'>Liz Cheney</span> hauled in $2 million in the last three months, a massive haul for a House race in an off-year election, and has $4.7 million in the bank.",
    "author": "Cameron Joseph",
    "title": "Trump's Favorite Candidates Are Getting Crushed in Fundraising"
  },
  {
    "id": 73,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Leading the pack was Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who pulled in more than $1.97 million during the last three months of 2021, bringing her yearly total to nearly $6.5 million.",
    "author": "",
    "title": "Overnight News Digest February 1, 2022"
  },
  {
    "id": 697,
    "mediaId": 21,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Bush cut checks to both Rep. <span class='selected-term'>Liz Cheney</span>, the eldest daughter of his former vice president, and Murkowski, both of whom face reelection this November.",
    "author": "Brent D. Griffiths",
    "title": "Trump endorses primary challenger to GOP Rep. Tom Rice, continuing his effort to rid the party of anyone who supported his impeachment"
  },
  {
    "id": 63,
    "mediaId": 151,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "House Republicans close money gap in hunt for the majority"
  },
  {
    "id": 64,
    "mediaId": 124,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Leading the pack was Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who pulled in more than $1.97 million during the last three months of 2021, bringing her yearly total to nearly $6.5 million.",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul"
  },
  {
    "id": 67,
    "mediaId": 43,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "One of the starkest examples comes out of Wyoming, where Rep. <span class='selected-term'>Liz Cheney</span> raised $2 million in the fourth quarter of 2021more than quadrupling the cash haul of her Trump-backed opponent, Harriet Hageman, who brought in $443,000, according to Axios.",
    "author": "",
    "title": "Liz Cheney and other Trump targets trounce his endorsees in the fundraising race"
  },
  {
    "id": 690,
    "mediaId": 129,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "In Wyoming, Representative <span class='selected-term'>Liz Cheney</span>, who was all but exiled by her party for bluntly condemning Mr. Trump's false election claims and has emerged as one of the lead lawmakers on the special committee investigating the Jan. 6 attack, raked in $2 million during the last quarter, entering 2022 with nearly $5 million in cash on hand.",
    "author": "",
    "title": "Republicans Who Voted to Impeach Trump Out-Raised Primary Rivals"
  },
  {
    "id": 61,
    "mediaId": 165,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "William Vaillancourt",
    "title": "Republicans Who Voted to Impeach Trump Are Fundraising Laps Around Their MAGA Primary Opponents"
  },
  {
    "id": 60,
    "mediaId": 237,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "The Republican National Committee issued a rebuke of Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois, taking the remarkable step in part because of their participation in the House select committee formed to investigate the Jan. 6 Capitol riot.",
    "author": "Emily Brooks",
    "title": "Republican National Committee censures Liz Cheney and Kinzinger"
  },
  {
    "id": 55,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "Though Rep. <span class='selected-term'>LIZ CHENEY</span>'s (R-Wyo.)",
    "author": "",
    "title": "POLITICO Playbook: Harris declares unity,' while Zelenskyy accuses appeasement'"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "All face challenging roads to reelection, particularly Rep. <span class='selected-term'>Liz Cheney</span>, the most outspoken of them, who has enraged so many Wyoming Republicans that they are plotting to alter state election laws to cut off one potential route to political survival.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "One of the event's expected highlights: Rep. Jim Jordan, R-Ohio, a top Trump ally in the House, is scheduled to interview congressional candidate Harriet Hageman, who was recruited by Trump and his allies to challenge Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Hours later, Mr. McCarthy did what the fringe wanted: He endorsed the woman running in Wyoming's Republican primary to oust the far right's archnemesis, Representative <span class='selected-term'>Liz Cheney</span>, a former member of his leadership team who has earned pariah status in her party by speaking out against former President Donald J. Trump and the deadly attack on the Capitol that he helped inspire with lies of a stolen election.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 39,
    "mediaId": 151,
    "date": "3/20/2022 12:00:00 AM",
    "sentence": "Another Republican strategist who has poll-tested the effectiveness of RINO messaging found <span class='selected-term'>Liz Cheney</span> Republican? may be just as effective for a stand-in when RINO gets old.",
    "author": "",
    "title": "How the GOP's dirtiest slur got a new life"
  },
  {
    "id": 38,
    "mediaId": 237,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "McCarthy asserted that he is largely standing by incumbents in their races, with the exception of endorsing against Wyoming Rep. <span class='selected-term'>Liz Cheney</span> due to her decision to join the select committee tasked with investigating the Jan. 6 Capitol riot.",
    "author": "Juliegrace Brufke",
    "title": "Kevin McCarthy not worried about Trump endorsements in GOP primaries"
  },
  {
    "id": 33,
    "mediaId": 675,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., has raised more than $7 million, the vast majority of it from outside of the state she is supposed to be representing, Wyoming.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!"
  },
  {
    "id": 34,
    "mediaId": 675,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., has raised more than $7 million, the vast majority of it from outside of the state she is supposed to be representing, Wyoming.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>'s (R-Wyo.)",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 24,
    "mediaId": 238,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "The six other Republicans who voted to impeach Trump who are running again  including Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "Amy B Wang",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection"
  },
  {
    "id": 25,
    "mediaId": 233,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Ten Republican impeachment votes: OnPolitics: Republicans who voted to impeach Trump face his 2022 picks\nU.S. Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyoming, the highest ranking Republican to vote for impeachment, is still seeking re-election, but faces a Trump-backed challenger in an August primary.",
    "author": "David Jackson",
    "title": "Rep. Fred Upton - another Donald Trump Republican impeacher - announces his retirement"
  },
  {
    "id": 27,
    "mediaId": 238,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "The six other Republicans who voted to impeach Trump who are running again  including Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection"
  },
  {
    "id": 11,
    "mediaId": 376,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Wyoming Rep. <span class='selected-term'>Liz Cheney</span>, who was ousted from the House GOP leadership for refusing to support Trump's false claim of widespread fraud in the 2020 election, raised more than $2.9 million and finished the quarter with $6.8 million.",
    "author": "Herb Jackson",
    "title": "Trump targets outraise challengers, unlike some other incumbents"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Wyoming's At-Large Congressional District Rep. <span class='selected-term'>Liz Cheney</span> (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising"
  },
  {
    "id": 2,
    "mediaId": 163,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "* Versus U.S. Representative <span class='selected-term'>Liz Cheney</span>\n* Aug. 16 Wyoming at-large-district Republican primary\nTrump threw his backing behind Hageman, a land-use lawyer, in September 2021, looking to punish Cheney, who was stripped of her role as the No.",
    "author": "Reuters",
    "title": "Factbox: Trump's endorsement power faces test in key elections"
  },
  {
    "id": 3375,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Four of the 10 have decided to retire, but the six others  Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "",
    "title": "Senate primaries to watch"
  }
]