[
  {
    "id": 792,
    "mediaId": 112,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "Associated Press",
    "title": "Sen. Thune of South Dakota, the No. 2 Republican, says he'll seek 4th term"
  },
  {
    "id": 795,
    "mediaId": 178,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "STEPHEN GROVES",
    "title": "GOP Sen. John Thune of South Dakota says he'll seek 4th term"
  },
  {
    "id": 697,
    "mediaId": 21,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Bush cut checks to both Rep. <span class='selected-term'>Liz Cheney</span>, the eldest daughter of his former vice president, and Murkowski, both of whom face reelection this November.",
    "author": "Brent D. Griffiths",
    "title": "Trump endorses primary challenger to GOP Rep. Tom Rice, continuing his effort to rid the party of anyone who supported his impeachment"
  },
  {
    "id": 385,
    "mediaId": 323,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "But unlike Ms. Mace, most of them voted to impeach the former president and some including Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming have continued to criticize him.",
    "author": "",
    "title": "Nancy Mace Tries to Survive Criticizing Trump"
  },
  {
    "id": 356,
    "mediaId": 19,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "Arrington joined the stage after Fry and took the opportunity to attack Rep. Nancy Mace (R-SC), who she called <span class='selected-term'>Liz Cheney</span> of the South.?\nSo, you know, I have a name for Nancy Mace,? Arrington said.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Katie Arrington and Russell Fry Join Trump on Stage at South Carolina Rally"
  },
  {
    "id": 357,
    "mediaId": 19,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "Speaking over the booing crowd, Trump then hit at <span class='selected-term'>Liz Cheney</span> for her participation on the January 6 committee, which he denounced as a witch hunt.?\nCheney joined the phony narrative about January 6, she voted to hold Steve Bannon in contempt, which was terrible, she's totally manipulated by raging Never Trumpers and the radical left  Democrats that are poisoning our country.",
    "author": "Paul Bois",
    "title": "Trump Blasts Reps. Nancy Mace, Liz Cheney at South Carolina Rally"
  },
  {
    "id": 327,
    "mediaId": 19,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "Two years ago, she begged for my endorsement and then she pledged to be America First.?\nHowever, Trump said, Mace went to D.C., where she started attacking Republicans and [held] a fundraiser for wacky <span class='selected-term'>Liz Cheney</span>.? Yet, Mace has attempted to position herself as one of Trump's earliest supporters but has yet to explain why she believes Trump chose to endorse her primary challenger, Katie Arrington, instead.",
    "author": "Hannah Bleau",
    "title": "Donald Trump: Nancy Mace Is Nasty, Disloyal, and Bad for the Republican Party'"
  },
  {
    "id": 39,
    "mediaId": 151,
    "date": "3/20/2022 12:00:00 AM",
    "sentence": "Another Republican strategist who has poll-tested the effectiveness of RINO messaging found <span class='selected-term'>Liz Cheney</span> Republican? may be just as effective for a stand-in when RINO gets old.",
    "author": "",
    "title": "How the GOP's dirtiest slur got a new life"
  },
  {
    "id": 309,
    "mediaId": 124,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Arrington described Mace as \"the <span class='selected-term'>Liz Cheney</span> of the South,\" invoking the Wyoming Republican who has become the most vocal critic of Trump in the party.",
    "author": "",
    "title": "Trump is trying to oust one of South Carolina's rising GOP stars"
  },
  {
    "id": 311,
    "mediaId": 129,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "And then there's a primary this summer in Wyoming, where <span class='selected-term'>Liz Cheney</span> is fighting to keep her House seat .",
    "author": "",
    "title": "It's Never a Good Time for the Hunter Biden Story"
  },
  {
    "id": 90,
    "mediaId": 136,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican, who also voted to impeach Trump and has become one of his harshest conservative critics, retweeted the video and praised the congressman.",
    "author": "Jason Lemon",
    "title": "Video of GOP Rep. Tom Rice Blasting Trump for Jan. 6 Role Tops 670K Views"
  }
]