[
  {
    "id": 845,
    "mediaId": 33,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Vice Chair <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican, told ABC News of \"firsthand testimony\" that Trump's daughter Ivanka, then a West Wing adviser, twice asked him to intervene in a melee in which police officers were beaten by his crowd.",
    "author": "Stephen Collinson",
    "title": "January 6 committee gets inside Trump's West Wing wall of obstruction"
  },
  {
    "id": 785,
    "mediaId": 238,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "Ryan O'Toole, who at the time was cloakroom director for House Minority Leader Kevin McCarthy (R-Calif.) and now is an aide to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "Mo Brooks urged a Jan. 6 crowd to fight.' Now his actions long before the insurrection face new scrutiny."
  },
  {
    "id": 761,
    "mediaId": 43,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "One of their spots tries to portray Britt as an anti-Trumper in the mold of <span class='selected-term'>Liz Cheney</span>, but as the Washington Post's Dave Weigel notes, \"The evidence that Britt will become a Trump critic ... is that Donald Trump Jr. said so in a tweet.\"",
    "author": "",
    "title": "Morning Digest: Ohio Court orders new House map after striking down gerrymandered GOP districts"
  },
  {
    "id": 737,
    "mediaId": 237,
    "date": "1/24/2022 12:00:00 AM",
    "sentence": "They may be on opposite poles among House Republicans in their attitudes toward former President Donald Trump, but Rep. <span class='selected-term'>Liz Cheney</span> got an unexpected compliment from firebrand freshman Rep. Marjorie Taylor Greene on her conservative voting record.",
    "author": "Emily Brooks",
    "title": "Marjorie Taylor Greene: Liz Cheney has more conservative' voting record than some in GOP"
  },
  {
    "id": 61,
    "mediaId": 165,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "William Vaillancourt",
    "title": "Republicans Who Voted to Impeach Trump Are Fundraising Laps Around Their MAGA Primary Opponents"
  },
  {
    "id": 669,
    "mediaId": 237,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "The Republican National Committee is set to vote on a resolution Friday to censure Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "Ryan King",
    "title": "RNC censure resolution against Cheney and Kinzinger advances"
  },
  {
    "id": 671,
    "mediaId": 237,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "A push from hard-right conservatives to oust Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger from the House Republican Conference is simmering in Congress as party leaders at the Republican National Committee debate whether to condemn the two members.",
    "author": "Emily Brooks",
    "title": "Push to oust Cheney and Kinzinger from GOP simmers in Congress as RNC debates it"
  },
  {
    "id": 497,
    "mediaId": 129,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "The fund-raiser at Mr. Thiel's Miami Beach compound last month was for a conservative candidate challenging Representative <span class='selected-term'>Liz Cheney</span> of Wyoming for a spot on the ballot in November's midterm elections.",
    "author": "",
    "title": "The Right's Would-Be Kingmaker"
  },
  {
    "id": 499,
    "mediaId": 234,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "As Vanity Fair reported last month, Thiel hosted a January fundraiser at his Miami compound for Wyoming Republican Harriet Hageman, the Trumpbacked candidate running a primary challenge against <span class='selected-term'>Liz Cheney</span> after Cheney refused to endorse Trump's big lie? and voted to impeach him.",
    "author": "Caleb Ecarma",
    "title": "Peter Thiel Is MAGA's Big Money Man"
  },
  {
    "id": 451,
    "mediaId": 881,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "I look forward to serving with Harriet for years to come.?  House Minority Leader Kevin McCarthy in his endorsement of Harriet Hageman against Trump's GOP bte noire, Rep. <span class='selected-term'>Liz Cheney</span>.",
    "author": "Cameron Joseph",
    "title": "The Big Lie Is Turning Fringe Candidates Into MAGA Stars"
  },
  {
    "id": 422,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "The U.S. and our allies must take immediate actions to cripple his regime.?\nRep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., a Trump critic who he is targeting for defeat this fall, responded Tuesday: Former President Trump's adulation of Putin today  including calling him a genius'  aids our enemies.",
    "author": "",
    "title": "Trump praises Putin's 'genius' as GOP fissures grow on Ukraine crisis"
  },
  {
    "id": 399,
    "mediaId": 195,
    "date": "2/27/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Joseph Choi -",
    "title": "Cheney on Ukraine: Isolationism has 'always been wrong'"
  },
  {
    "id": 378,
    "mediaId": 409,
    "date": "3/4/2022 12:00:00 AM",
    "sentence": "McCarthy has endorsed the opponent of <span class='selected-term'>Liz Cheney</span> in the Wyoming GOP primary.",
    "author": "Jay Nordlinger",
    "title": "Phil and the Saudis, &c."
  },
  {
    "id": 357,
    "mediaId": 19,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "Speaking over the booing crowd, Trump then hit at <span class='selected-term'>Liz Cheney</span> for her participation on the January 6 committee, which he denounced as a witch hunt.?\nCheney joined the phony narrative about January 6, she voted to hold Steve Bannon in contempt, which was terrible, she's totally manipulated by raging Never Trumpers and the radical left  Democrats that are poisoning our country.",
    "author": "Paul Bois",
    "title": "Trump Blasts Reps. Nancy Mace, Liz Cheney at South Carolina Rally"
  },
  {
    "id": 309,
    "mediaId": 124,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Arrington described Mace as \"the <span class='selected-term'>Liz Cheney</span> of the South,\" invoking the Wyoming Republican who has become the most vocal critic of Trump in the party.",
    "author": "",
    "title": "Trump is trying to oust one of South Carolina's rising GOP stars"
  },
  {
    "id": 33,
    "mediaId": 675,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., has raised more than $7 million, the vast majority of it from outside of the state she is supposed to be representing, Wyoming.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!"
  },
  {
    "id": 34,
    "mediaId": 675,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., has raised more than $7 million, the vast majority of it from outside of the state she is supposed to be representing, Wyoming.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!"
  },
  {
    "id": 259,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Last month, when Stefanik endorsed a primary opponent of Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, whose GOP leadership post she now holds, Stefanik went above and beyond to turn the knife.",
    "author": "",
    "title": "Elise Stefanik is the human embodiment of how the GOP went down the tubes"
  },
  {
    "id": 210,
    "mediaId": 151,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "POLITICO Playbook: SCOOP: <span class='selected-term'>Liz Cheney</span>'s record fundraising haul\nBy RYAN LIZZA and EUGENE DANIELS\n04/11/2022 06:29 AM EDT\nPresented by\nDRIVING THE DAY\nFIRST IN PLAYBOOK  Rep. LIZ CHENEY has set another personal fundraising record.",
    "author": "",
    "title": "POLITICO Playbook: SCOOP: Liz Cheney's record fundraising haul"
  },
  {
    "id": 2766,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": ": Per the WaPo story, Rep. <span class='selected-term'>LIZ CHENEY</span>'s (R-Wyo.)",
    "author": "",
    "title": "POLITICO Playbook PM: McCarthy gets a lifeline (and another leak)"
  },
  {
    "id": 138,
    "mediaId": 33,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Trump has been especially annoyed, one ally said, that the Club has not endorsed or lent assistance to Wyoming congressional hopeful Harriet Hageman, who is challenging incumbent Rep. <span class='selected-term'>Liz Cheney</span> in one of the former President's highest-profile efforts to oust his foes inside the GOP.",
    "author": "Gabby Orr",
    "title": "Trump unleashes his temper on GOP allies over Ohio Senate primary split"
  }
]