[
  {
    "id": 782,
    "mediaId": 65,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "Friedman wrote a piece extensively focused on Israeli politics and the \"most diverse national unity government in Israel's history,\" something he suggested, \"might be a harbinger for politics in the U.S.\"\nNYT COLUMNIST DOUBLES DOWN ON DEFENDING RANDI WEINGARTEN AS A CHAMPION OF KEEPING SCHOOLS OPEN\n\"Is that what America needs in 2024  a ticket of Joe Biden and <span class='selected-term'>Liz Cheney</span>?\"",
    "author": "",
    "title": "Biden-Cheney? Twitter melts down over NYT columnist's proposed 2024 ticket"
  },
  {
    "id": 709,
    "mediaId": 157,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Eight impeachment-backing GOP lawmakers who are seeking re-election have outpaced their primary challengers, as the Republican National Committee debates ousting House select committee members Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), who is running this year, and Rep. Adam Kinzinger (R-IL), who is leaving Congress.",
    "author": "Travis Gettys",
    "title": "NYT reporter breaks down bombshell new revelations about Trump's vote-stealing scheme"
  },
  {
    "id": 685,
    "mediaId": 195,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "The Hill: Former President George W. Bush donated to the campaigns of Sen. Lisa Murkowski (R-Alaska) and Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - Dems jolted by senator's stroke, majority status"
  },
  {
    "id": 600,
    "mediaId": 19,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "The Times also describes Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming as an instigating force: Some of the Democrats on the committee were concerned that if the panel was too aggressive, Republicans might turn the tables on the Democrats whenever they took back control of the House.",
    "author": "Joel B. Pollak",
    "title": "NY Times Warns: Republicans Can Use January 6 Committee's Precedent to Pursue Democrats After Midterm Elections"
  },
  {
    "id": 572,
    "mediaId": 63,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "In January, Thiel and Donald Trump Jr. co-hosted two fundraisers for Harriet Hageman, a Republican primary challenger to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Zachary Snowdon Smith",
    "title": "Peter Thiel Leaving Meta Board To Focus On Pro-Trump Politics"
  },
  {
    "id": 445,
    "mediaId": 124,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy endorsed Harriet Hageman yesterday in her primary race against Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "Conor Lamb makes his contrast argument for Pennsylvania Senate bid"
  },
  {
    "id": 142,
    "mediaId": 881,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Just two days after the attack on the Capitol, McCarthy told other top House Republicans, including then-conference chair Rep. <span class='selected-term'>Liz Cheney</span>, that he was seriously considering? having a conversation with Trump to urge the president to resign.",
    "author": "Paul Blest",
    "title": "Kevin McCarthy Is Now Straight-Up Lying About Wanting Trump to Resign"
  }
]