[
  {
    "id": 777,
    "mediaId": 19,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Friday's reported reset for Harris is the second reset in two months, and it comes after a New York Times columnist suggested Biden should replace Harris with Democrat-allied Rep. <span class='selected-term'>Liz Cheney</span> (R-WY).",
    "author": "Wendell Husebø",
    "title": "Kamala Harris Resets Political Shitshow', Twice in Two Months"
  },
  {
    "id": 700,
    "mediaId": 195,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Members of the Republican National Committee (RNC) will reportedly debate a resolution put forth by a Trump ally this week that calls for expelling Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Mychael Schnell",
    "title": "RNC to debate Trump ally's resolution to expel Cheney, Kinzinger: report"
  },
  {
    "id": 645,
    "mediaId": 43,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "According to The Washington Post, leaders of the Wyoming GOP have privately signed an unprecedented agreement that opens the door to them funding a challenger to Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) in a primary this year.",
    "author": "",
    "title": "NOT A POLITICAL PARTY"
  },
  {
    "id": 664,
    "mediaId": 43,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": " Gabriel Sterling (@GabrielSterling) February 4, 2022\nx\nRep. <span class='selected-term'>Liz Cheney</span>: \"I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "author": "",
    "title": "GOP claims 1/6 \"legitimate political discourse\" because truth is fiction and patriots are turncoats"
  },
  {
    "id": 253,
    "mediaId": 195,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Furthermore, this week U.S. District Judge David Carter said that he found it more likely than not? that Trump and legal adviser John Eastman engaged in criminal conduct.?\nAs vice-chair of the Jan. 6 Committee, <span class='selected-term'>Liz Cheney</span> is a role model helping to save America and keep our nation great by boldly standing for truth.",
    "author": "Myra Adams",
    "title": "America needs Liz Cheney"
  },
  {
    "id": 178,
    "mediaId": 238,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Return to menu\nCareful readers of the latest campaign finance report from Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Post Politics Now Biden's bicoastal push to sell the bipartisan infrastructure law"
  },
  {
    "id": 158,
    "mediaId": 238,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "But the MAGA squad,? made up of Reps. Marjorie Taylor Greene (R-Ga.), Matt Gaetz (R-Fla.) and others, have long kept mum on whether they would support him as their speaker in the majority.McCarthy has said he would put Greene and Rep. Paul A. Gosar (R-Ariz.) back on better committees after Democrats ousted them, a move many colleagues saw as a peace offering.But the group has heavily criticized him since, insinuating he's a weak leader for allowing Republicans to vote with Democrats on infrastructure and not showing his cards on kicking Reps. Adam Kinzinger (R-Ill.) and <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Post Politics Now Leader McCarthy, Rep. Greene both have some explaining to do about Jan. 6"
  },
  {
    "id": 133,
    "mediaId": 238,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The actions of Rep. Matt Gaetz (R-Fla.) and Rep. Mo Brooks (R-Ala.) in particular had crossed a line, McCarthy suggested, noting that Brooks used incendiary language during a Jan. 6 speech and that Gaetz had singled out Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Post Politics Now McCarthy faces House Republicans in wake of audio tape leak"
  }
]