[
  {
    "id": 531,
    "mediaId": 376,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Corrected, 5:49 p.m. | The Republican National Committee's resolution censuring Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois for their membership on the House select committee investigating Jan. 6 has forced Republicans on the Hill to answer some uncomfortable questions and given Democrats a new line of attack in fundraising emails invoking the phrase legitimate political discourse.?\nIt's also led to another back-and-forth between former President Donald Trump and Senate Minority Leader Mitch McConnell of Kentucky, who said this week that the attack on the Capitol was a violent insurrection? and that, historically, party committees have supported members regardless of their positions on some issues.?\nMitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters,? Trump said in a statement Wednesday through his Save America PAC.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley",
    "title": "At the Races: Political diss-course"
  },
  {
    "id": 368,
    "mediaId": 65,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Stefanik also made one endorsement in the Senate for GOP candidate Jane Timken in Ohio and last month joined House GOP Leader Kevin McCarthy, R-Calif., in taking the rare step of backing a primary challenger to a GOP colleague when they endorsed Harriet Hageman in her race against Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming.",
    "author": "",
    "title": "Elise Stefanik unveils new endorsements for 2022 midterm elections"
  },
  {
    "id": 182,
    "mediaId": 21,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "But if he were to run for president as a Republican, he would be running for the nomination of a party that has censured him and Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming for participating in the House Select Committee investigating the January 6 attack on the US Capitol.",
    "author": "Bryan Metzger",
    "title": "Republican Rep. Adam Kinzinger says he 'would love' to run against Trump in 2024 'even if he crushed me'"
  }
]