[
  {
    "id": 88,
    "mediaId": 151,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "Some of our favorite zingers on this year's card: Quit swearing, start saying come on, man'? and Explain to my early 2000s self that <span class='selected-term'>Liz Cheney</span> is a resistance hero.?\nTRANSITION  Andrew Isenhour is now deputy comms director for Georgia Gov.",
    "author": "",
    "title": "POLITICO Playbook: Welcome to 2022"
  },
  {
    "id": 854,
    "mediaId": 43,
    "date": "1/2/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/LD0nMmJofP\n The Hill (@thehill) January 2, 2022\nx\nJan. 6 panel chair says \"significant testimony\" shows White House \"had been told to do something\" https://t.co/3yriFIuQDW pic.twitter.com/oFhvo1mQDx\n The Hill (@thehill) January 2, 2022\nREPUBLICAN REP. <span class='selected-term'>LIZ CHENEY</span>\nx\n.",
    "author": "",
    "title": "BIDEN---DAY347---Evening"
  },
  {
    "id": 727,
    "mediaId": 129,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "(Bloomberg Opinion)\nIn billionaire donor news, Ken Langone gave money to the PAC of Senator Joe Manchin, Democrat of West Virginia, after the lawmaker opposed President Biden's social spending plan; and Peter Thiel hosted a fund-raiser for a primary challenger to Representative <span class='selected-term'>Liz Cheney</span>, Republican of Wyoming.",
    "author": "",
    "title": "Marcelo Claure Leaves Masa Son's Orbit"
  },
  {
    "id": 587,
    "mediaId": 195,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "The Republican National Committee continued to receive criticism for adopting a resolution on Friday that censures GOP Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - Presented by Facebook - Anticipating an invasion of Ukraine 'any day'"
  },
  {
    "id": 549,
    "mediaId": 209,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "The New York Times\nSenate Minority Leader Mitch McConnell (R-Ky.) on Tuesday became the most prominent Republican to criticize the Republican National Committee's decision to censure GOP Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "Harold Maass",
    "title": "10 things you need to know today: February 9, 2022"
  },
  {
    "id": 514,
    "mediaId": 147,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "Judy Woodruff:\nWell, speaking of politics, another question I want to raise with both of you, and that is the move by the Republican National Committee last weekend, David, to censure two of its own, Congresswoman <span class='selected-term'>Liz Cheney</span>, Congressman Adam Kinzinger, because of their role on the January 6 investigative committee, and then their statement that what happened, the assault on the Capitol January 6, was just normal political discourse.",
    "author": "",
    "title": "Brooks and Capehart on the Ukraine crisis, Republican divisions over Jan. 6"
  },
  {
    "id": 505,
    "mediaId": 43,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/sJdT7rtwnK\n The Recount (@therecount) February 13, 2022\nREPUBLICAN REP. ADAM KINZINGER\nx\nKinzinger says January 6 committee \"fully\" expects Giuliani to comply with subpoena https://t.co/xjK5oYXPn4\n CBS News (@CBSNews) February 13, 2022\nREPUBLICAN REP. <span class='selected-term'>LIZ CHENEY</span>\nx\nRep. Liz Cheney: \"I'm not going to convince the crazies and I reject the crazies.\"",
    "author": "",
    "title": "BIDEN---DAY389---SECOND"
  },
  {
    "id": 495,
    "mediaId": 129,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "How Should Biden Deal With Russia on Ukraine?"
  },
  {
    "id": 447,
    "mediaId": 195,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "LEADING THE DAY\nPOLITICS: House Minority Leader Kevin McCarthy (R-Calif.) on Thursday endorsed Harriet Hageman, the primary challenger looking to unseat Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - One day, two continents, words of war"
  },
  {
    "id": 449,
    "mediaId": 129,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "Kevin McCarthy, the House Republican leader, endorsed a primary challenger to <span class='selected-term'>Liz Cheney</span>, a Trump-critical Republican.",
    "author": "",
    "title": "Red Covid, an Update"
  },
  {
    "id": 458,
    "mediaId": 129,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "Representative Kevin McCarthy, the House Republican leader, endorsed Harriet Hageman, a pro-Trump candidate and primary challenger to Representative <span class='selected-term'>Liz Cheney</span>.",
    "author": "",
    "title": "Explaining Putin's Decades-Long Obsession With Ukraine"
  },
  {
    "id": 55,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "Though Rep. <span class='selected-term'>LIZ CHENEY</span>'s (R-Wyo.)",
    "author": "",
    "title": "POLITICO Playbook: Harris declares unity,' while Zelenskyy accuses appeasement'"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "One of the event's expected highlights: Rep. Jim Jordan, R-Ohio, a top Trump ally in the House, is scheduled to interview congressional candidate Harriet Hageman, who was recruited by Trump and his allies to challenge Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores"
  },
  {
    "id": 422,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "The U.S. and our allies must take immediate actions to cripple his regime.?\nRep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., a Trump critic who he is targeting for defeat this fall, responded Tuesday: Former President Trump's adulation of Putin today  including calling him a genius'  aids our enemies.",
    "author": "",
    "title": "Trump praises Putin's 'genius' as GOP fissures grow on Ukraine crisis"
  },
  {
    "id": 425,
    "mediaId": 151,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "Sen. LINDSEY GRAHAM (R-S.C.) said the move should immediately be met with forceful sanctions to destroy the ruble and crush the Russian oil and gas sector.? Rep. <span class='selected-term'>LIZ CHENEY</span> (R-Wyo.",
    "author": "",
    "title": "POLITICO Playbook: Today's conundrum: What's an invasion'?"
  },
  {
    "id": 419,
    "mediaId": 65,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "Vance said the statements from Gibbons and Timken reflect the foreign policy of Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., rather than former President Donald Trump.",
    "author": "",
    "title": "Russia's Ukraine invasion makes waves in Ohio Senate race"
  },
  {
    "id": 421,
    "mediaId": 195,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Brad Dress",
    "title": "Cheney: Trump's 'adulation' of Putin 'aids our enemies'"
  },
  {
    "id": 407,
    "mediaId": 238,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "And he sided against a member of his own conference in throwing his support behind the Wyoming primary challenger, Harriet Hageman, whose central message is that [Representative <span class='selected-term'>Liz Cheney</span>] should be ousted for breaking with Mr. Trump and daring to investigate the most brutal attack on the Capitol in centuries,? the NYT's Annie Karni and Jonathan Weisman report.",
    "author": "",
    "title": "After Afghanistan, Biden faces another wary public on Ukraine"
  },
  {
    "id": 409,
    "mediaId": 302,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "You can criticize policy, but this is insane and feeds into Putins narrative.?\nRep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who was voted out of GOP leadership for opposing Trump and whose primary opponent is backed by Trump and House Minority Leader Kevin McCarthy, R-cALIF., said Trump's adulation? of Putin aids our enemies.?\nTrump's interests don't seem to align with the interests of the United States of America,? she said.",
    "author": "",
    "title": "Trump splinters Republicans with praise of Vladimir Putin"
  },
  {
    "id": 414,
    "mediaId": 238,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Other than Romney, Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: Romney is right: MAGA Republicans are almost treasonous'"
  },
  {
    "id": 399,
    "mediaId": 195,
    "date": "2/27/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Joseph Choi -",
    "title": "Cheney on Ukraine: Isolationism has 'always been wrong'"
  },
  {
    "id": 394,
    "mediaId": 124,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "Recorded remarks from Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., aired at a dueling Principles First? event.",
    "author": "",
    "title": "Texas primaries will be the first 2022 test of Trump's endorsement power"
  },
  {
    "id": 397,
    "mediaId": 43,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "Some had stated their objections to the unwarranted invasion, but almost none, save Adam Kinzinger and <span class='selected-term'>Liz Cheney</span>, have spoken out about Trump's disloyalty.",
    "author": "",
    "title": "None Dare Call It Treason"
  },
  {
    "id": 380,
    "mediaId": 409,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "McCarthy has endorsed the primary opponent of <span class='selected-term'>Liz Cheney</span>, the GOP congresswoman from Wyoming.",
    "author": "NR Editors",
    "title": "The Week"
  },
  {
    "id": 377,
    "mediaId": 43,
    "date": "3/5/2022 12:00:00 AM",
    "sentence": "pic.twitter.com/Orz8krh1it\n <span class='selected-term'>Liz Cheney</span> (@Liz_Cheney) March 5, 2022\nSaturday, Mar 5, 2022  5:10:14 PM Pacific Standard Time  Mark Sumner\nx\nPer the White House, President Biden spoke with President Zelenskyy this evening from 6:18 till 6:50 EST.",
    "author": "Mark Sumner",
    "title": "Ukraine update: Oh, Cassandra, thy curse still holds true"
  },
  {
    "id": 367,
    "mediaId": 165,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Nevertheless, Carlson introduced him last week as an honest man,? after which Macgregor pushed more Putin propaganda, arguing he is simply trying to prevent further attempts to influence or change Ukraine into effectively a platform for the projection of U.S. and Western power into Russia.?\nHis subsequent comments about Russia being too gentle?  which Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Ryan Bort",
    "title": "Fox News' Invasion Expert Is a Trump-Appointed Putin Propagandist Who Thinks Russia Is Being Too Gentle'"
  },
  {
    "id": 365,
    "mediaId": 238,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "If the measure had become law, voters may not have known for certain who was running before having to register with a certain party.? That's a big boost to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "Opinion: MAGA loyalists run into trouble"
  },
  {
    "id": 355,
    "mediaId": 43,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "However well-known Republican never-Trumpers such as Rep. <span class='selected-term'>Liz Cheney</span>, Sen. Lisa Murkowski, and Rep. Adam Kinzinger, as well as Republican moderates who have been less outspoken about Trump like Sen. Mitt Romney, might very well run against him.",
    "author": "",
    "title": "If Cheney and Murkowski run against Trump they won't win but will hurt him by tying him to Putin"
  },
  {
    "id": 340,
    "mediaId": 124,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Elsewhere on the campaign trail:\nPolitico caught up with Wyoming voters to explore how GOP Rep. <span class='selected-term'>Liz Cheney</span> needs support from Democrats and independents to fend off her Trump-backed primary challenger.",
    "author": "",
    "title": "Trump attempts to fix his Putin problem"
  },
  {
    "id": 317,
    "mediaId": 33,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "I think it's disgraceful,? said Rep. <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican on the outs with her conference over her vocal criticism of Trump.",
    "author": "Melanie Zanona",
    "title": "Madison is wrong': GOP backlash over Cawthorn grows after Zelensky insult"
  },
  {
    "id": 320,
    "mediaId": 25,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "The only lawmaker who has faced lingering consequences is Wyoming Republican Rep. <span class='selected-term'>Liz Cheney</span>, who was removed from her leadership position in the House Republican conference after repeatedly criticizing former President Trump for his role in the January 6 riot.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy"
  },
  {
    "id": 308,
    "mediaId": 195,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - All eyes on Supreme Court"
  },
  {
    "id": 302,
    "mediaId": 237,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Wyoming Rep. <span class='selected-term'>Liz Cheney</span> on Tuesday forcefully backed GOP campaign reforms, including voter identification, but ruled out public financing, warning that it means tax dollars would fund all candidates, even Rep. Marjorie Taylor Greene, one of her top critics.",
    "author": "Paul Bedard",
    "title": "Liz Cheney rejects public campaign financing, warns it would fund Marjorie Taylor Greene"
  },
  {
    "id": 286,
    "mediaId": 19,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "Former Vice President Mike Pence placed third with ten percent support, followed by former U.S. ambassador to the U.N. Nikki Haley (8 percent), Rep. <span class='selected-term'>Liz Cheney</span> (8 percent), and Sen. Ted Cruz (R-TX):\nThat survey also found Trump leading President Biden by four percentage points  47 percent to 43 percent.",
    "author": "Hannah Bleau",
    "title": "Poll: Majority Support Trump in Republican Primary"
  },
  {
    "id": 225,
    "mediaId": 129,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Representative <span class='selected-term'>Liz Cheney</span>, the Wyoming Republican and frequent Trump critic, describes it as the Putin wing of the G.O.P.? It both admires him as a strong leader and likes his right-wing nationalism, including his opposition to NATO, Western liberalism and L.G.B.T.",
    "author": "",
    "title": "The G.O.P.'s Putin Wing'"
  },
  {
    "id": 219,
    "mediaId": 223,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Host Jonathan Karl offered that Cheney \"says the point she's making is to defend the Constitution of the United States,\" prompting Christie to respond \"look, whatever it is, it wasn't like she was looking to protect her position and the first time that Republicans inside that caucus had a chance to vote on <span class='selected-term'>Liz Cheney</span>, they voted to keep her, overwhelmingly.\"",
    "author": "Rebecca Downs",
    "title": "Chris Christie Has a Theory About Liz Cheney"
  },
  {
    "id": 220,
    "mediaId": 21,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "GOP Rep. <span class='selected-term'>Liz Cheney</span> on Sunday said House Minority Leader Kevin McCarthy has put his own political ambitions first and failed to defend democracy.",
    "author": "Sarah Al-Arshani",
    "title": "Rep. Liz Cheney says GOP leader Kevin McCarthy has failed to defend democracy at home after he backed Ukraine in Poland"
  },
  {
    "id": 222,
    "mediaId": 195,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Mychael Schnell",
    "title": "Cheney says McCarthy failed to put oath to the Constitution ahead of his own personal political gains'"
  },
  {
    "id": 199,
    "mediaId": 25,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Pence decries cancel culture amid protests, praises Zelenskyy at University of Virginia\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n Trump endorses Oz in Pennsylvania Senate primary race\n More\nIn:\nMike Pence\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "Pence decries cancel culture amid protests and praises Zelenskyy at University of Virginia"
  },
  {
    "id": 200,
    "mediaId": 25,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Pence decries cancel culture amid protests, praises Zelenskyy at University of Virginia\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n Trump endorses Oz in Pennsylvania Senate primary race\n More\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "Pence decries cancel culture amid protests and praises Zelenskyy at University of Virginia"
  },
  {
    "id": 189,
    "mediaId": 43,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "Jan. 6 Panel Has Evidence for Criminal Referral of Trump\nThe committee's vice chairwoman, Representative <span class='selected-term'>Liz Cheney</span>, said on CNN on Sunday that the committee had not reached a final decision about making referrals and downplayed any divisions on the committee, but acknowledged there was significant evidence of criminality.",
    "author": "",
    "title": "We Are A Tiny But Essential Link In The Chain of Freedom, Equality, Truth, And Love: Saturday's GNR"
  },
  {
    "id": 165,
    "mediaId": 238,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Ukrainian President Volodymyr Zelensky and Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Zelensky, Rep. Cheney to receive JFK Profile in Courage award"
  },
  {
    "id": 167,
    "mediaId": 209,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "The John F. Kennedy Library Foundation will, for the first time ever, honor 5 individuals with the John F. Kennedy Profile in Courage Award this year, including Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Brigid Kennedy",
    "title": "Zelensky, Liz Cheney among recipients of JFK Profile in Courage Award"
  },
  {
    "id": 157,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "QUICK LINKS\nRepublican congressional candidate's wildly homophobic fundraising blast accuses his enemies of being 'sodomite predators' and 'LGBT groomers', from Warren Rojas at Business Insider\nUkrainian President Zelensky, Rep. <span class='selected-term'>Liz Cheney</span> among 5 recipients of JFK Profile in Courage Award, from Travis Andersen at The Boston Globe\nSenate front-runner in Pennsylvania embraces Biden and progressive agenda amid Democrats' midterm dilemma, from Manu Raju, Alex Rogers and Ali Zaslav at CNN\nTRANSITIONS\nGrace Bobertz is now director of scheduling for Sen. Michael Bennet (D-Colo.).",
    "author": "Oh Kevin",
    "title": "Oh Kevin, my Kevin"
  },
  {
    "id": 2766,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": ": Per the WaPo story, Rep. <span class='selected-term'>LIZ CHENEY</span>'s (R-Wyo.)",
    "author": "",
    "title": "POLITICO Playbook PM: McCarthy gets a lifeline (and another leak)"
  },
  {
    "id": 93,
    "mediaId": 238,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion Our democracy at home depends on preserving freedom in Ukraine"
  },
  {
    "id": 3125,
    "mediaId": 65,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "Of course, there was <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger and their friend Elise Stefanik.",
    "author": "",
    "title": "Tucker: Our leaders believe protecting Ukraine is more important than protecting you"
  },
  {
    "id": 3367,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "The Post's Marianna Sotomayor takes a look at the controversy and what it tells us about Stefanik, who has sought to firmly align herself with former president Donald Trump and his nativist Make America Great Again? agenda over the last year after she replaced Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Mariana Alfaro",
    "title": "Post Politics Now Ukraine aid, baby formula shortages, high gas prices on agenda for Congress"
  }
]