[
  {
    "id": 846,
    "mediaId": 19,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Now, <span class='selected-term'>Liz Cheney</span> is pursuing the next generation of political victims for working for Trump and exposing the effort to villainize voter ID.",
    "author": "Matthew Boyle",
    "title": "Exclusive  Mitch McConnell Led Effort to Trash Bob Dole Aide's Career over Peripheral Tie to January 6"
  },
  {
    "id": 837,
    "mediaId": 238,
    "date": "1/4/2022 12:00:00 AM",
    "sentence": "The most vocal, Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "",
    "title": "How Jan. 6 could shape the 2022 midterm elections"
  },
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "And Rep. <span class='selected-term'>Liz Cheney</span>, the Republican vice-chair of the House Select Committee probing the January 6 insurrection, will face Trump-backed Harriet Hageman in Wyoming's at-large House seat.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP"
  },
  {
    "id": 797,
    "mediaId": 147,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Indeed, during a moment of silence held in honor of law enforcement officers, only two Republicans were present in the House chamber: Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who has become a pariah in her party over her criticism of Trump's actions, and her father, former Vice President Dick Cheney.",
    "author": "Jill Colvin",
    "title": "One year ago, Republicans condemned Jan. 6 insurrection. Yesterday, their response was far more muted."
  },
  {
    "id": 792,
    "mediaId": 112,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "Associated Press",
    "title": "Sen. Thune of South Dakota, the No. 2 Republican, says he'll seek 4th term"
  },
  {
    "id": 793,
    "mediaId": 32,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "",
    "title": "GOP Sen. John Thune of South Dakota says he'll seek a fourth term"
  },
  {
    "id": 795,
    "mediaId": 178,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "In addition, Wyoming Rep. <span class='selected-term'>Liz Cheney</span> was removed from her House GOP leadership job and at least two others face Trump-backed primary challengers.",
    "author": "STEPHEN GROVES",
    "title": "GOP Sen. John Thune of South Dakota says he'll seek 4th term"
  },
  {
    "id": 767,
    "mediaId": 151,
    "date": "1/15/2022 12:00:00 AM",
    "sentence": "Jim Banks said it is long past time? for Kevin McCarthy to expel <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger from the House Republican Conference.",
    "author": "",
    "title": "POLITICO Playbook: Civil rights leaders fume after meeting with Sinema"
  },
  {
    "id": 764,
    "mediaId": 223,
    "date": "1/17/2022 12:00:00 AM",
    "sentence": "SO WE THOUGHT you'd help us give <span class='selected-term'>Liz Cheney</span> the support she needs to see the investigation through.?\nAre these left-wing groups really raising money to help reelect Liz Cheney?",
    "author": "Derek Hunter",
    "title": "Democrats Claim Liz Cheney As One Of Their Own; They Can Have Her"
  },
  {
    "id": 746,
    "mediaId": 238,
    "date": "1/22/2022 12:00:00 AM",
    "sentence": "), and Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Arizona Democratic Party votes to censure Sinema, citing filibuster vote"
  },
  {
    "id": 738,
    "mediaId": 195,
    "date": "1/24/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wy.)",
    "author": "Dominick Mastrangelo",
    "title": "Cheney hits Gingrich for saying Jan. 6 panel members may be jailed"
  },
  {
    "id": 735,
    "mediaId": 21,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "One feature of this micro-coalition of more dedicated Trump disciples is their ability to help cast out ideological dissenters, such as Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who was ousted from her House GOP leadership post after repeatedly criticizing Trump for inciting the January 6 insurrection.",
    "author": "Jake Lahut",
    "title": "How Marjorie Taylor Greene's endorsement of J.D. Vance shows what it takes to make it into the next generation's MAGA clique"
  },
  {
    "id": 68,
    "mediaId": 163,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Representative Elise Stefanik, who replaced Representative <span class='selected-term'>Liz Cheney</span> as the No.",
    "author": "Alexandra Ulmer",
    "title": "Republican U.S. lawmakers funnel money to colleagues who crossed Trump"
  },
  {
    "id": 70,
    "mediaId": 881,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Trump antagonist and Wyoming Rep. <span class='selected-term'>Liz Cheney</span> hauled in $2 million in the last three months, a massive haul for a House race in an off-year election, and has $4.7 million in the bank.",
    "author": "Cameron Joseph",
    "title": "Trump's Favorite Candidates Are Getting Crushed in Fundraising"
  },
  {
    "id": 694,
    "mediaId": 195,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Max Greenwood and Reid Wilson -",
    "title": "Five big takeaways from year-end FEC filings"
  },
  {
    "id": 702,
    "mediaId": 124,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "And on the House side, Trump gave to Harriet Hageman, who is running a primary challenge to Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo.",
    "author": "",
    "title": "Trump gave $1M to Meadows nonprofit weeks after Jan. 6 panel's creation"
  },
  {
    "id": 706,
    "mediaId": 129,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Mr. Bush made one other symbolic donation: the legal maximum of $5,800 to Representative <span class='selected-term'>Liz Cheney</span> of Wyoming, one of the most outspoken anti-Trump Republicans in Congress.",
    "author": "",
    "title": "Billionaires and Big Checks Shape Battle for Congress"
  },
  {
    "id": 711,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Too bad Republicans missed their opportunity to convict Trump and do away with him forever or, as GOP Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming put it, \"made themselves willing hostages\" to a man who just fessed up to trying to stage a coup.",
    "author": "",
    "title": "Trump's endorsement ad of David Perdue is perfectly divisive and comically awful"
  },
  {
    "id": 685,
    "mediaId": 195,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "The Hill: Former President George W. Bush donated to the campaigns of Sen. Lisa Murkowski (R-Alaska) and Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - Dems jolted by senator's stroke, majority status"
  },
  {
    "id": 625,
    "mediaId": 195,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Sen. Mitt Romney (R-Utah) on Friday criticized the Republican National Committee's (RNC) effort to censure Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Sarakshi Rai",
    "title": "Romney rips GOP censure effort against Cheney, Kinzinger"
  },
  {
    "id": 626,
    "mediaId": 238,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Honor attaches to <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.?\nMcDaniel is Romney's niece.",
    "author": "",
    "title": "RNC votes to condemn Cheney, Kinzinger for serving on House committee investigating Jan. 6 attack on the Capitol by pro-Trump mob"
  },
  {
    "id": 630,
    "mediaId": 195,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "\"The RNC is censuring <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger because they are trying to find out what happened on January 6th,\" Cassidy wrote in a tweet.",
    "author": "Sarakshi Rai",
    "title": "GOP Sen. Cassidy questions RNC censure of Kinzinger, Cheney"
  },
  {
    "id": 593,
    "mediaId": 21,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "The Alaska Republican's response came after the Republican National Committee (RNC) on Friday censured GOP Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois for serving on the January 6 panel.",
    "author": "John L. Dorman",
    "title": "GOP Sen. Lisa Murkowski pushes back against RNC characterization of January 6 as 'legitimate political discourse'"
  },
  {
    "id": 581,
    "mediaId": 312,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "And did we get it right that the RNCwith no debate or recorded votealso said in the resolution that Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger engaged in the persecution of ordinary citizens engaged in legitimate political discourse? simply by looking into the details of the deadly attempt to keep Donald Trump in power?",
    "author": "Philip Elliott",
    "title": "Why the RNC's Embrace of Trump and the January Sixers Will Backfire"
  },
  {
    "id": 556,
    "mediaId": 147,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "As former President Donald Trump has downplayed the attack by his supporters last year  the worst attack against the Capitol in two centuries  the RNC last week took a voice vote to approve censuring Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois at the party's winter meeting in Salt Lake City.",
    "author": "Mary Clare Jalonick",
    "title": "Sen. Mitch McConnell rebukes RNC, calls Jan. 6 violent insurrection'"
  },
  {
    "id": 557,
    "mediaId": 302,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "As former President Donald Trump has downplayed the attack by his supporters last year  the worst attack against the Capitol in two centuries  the RNC last week took a voice vote to approve censuring Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois at the party's winter meeting in Salt Lake City.",
    "author": "Associated Press",
    "title": "McConnell rebukes RNC, calls Jan. 6 violent insurrection'"
  },
  {
    "id": 561,
    "mediaId": 233,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "More:GOP censures Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, calls Jan. 6 riot 'legitimate political discourse'\nWith the Senate deadlocked 50-50 between the parties  and controlled by the Democrats because of Vice President Kamala Harris' tie-breaking vote  the Republicans face toss-up Senate elections in places like Pennsylvania, Georgia and Arizona, states that Biden carried.",
    "author": "David Jackson",
    "title": "Mitch McConnell calls Jan. 6 a 'violent insurrection,' hits Republicans for censure of Cheney, Kinzinger"
  },
  {
    "id": 562,
    "mediaId": 112,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "It was a violent insurrection for the purpose of trying to prevent the peaceful transfer of power, after a legitimately certified election, from one administration to the next.'\n Sen. Mitch McConnell\nAs former President Donald Trump has downplayed the attack by his supporters last year  the worst attack against the Capitol in two centuries  the RNC last week took a voice vote to approve censuring Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois at the party's winter meeting in Salt Lake City.",
    "author": "Associated Press",
    "title": "McConnell says U.S. Capitol siege was a violent insurrection' and not legitimate political discourse'"
  },
  {
    "id": 565,
    "mediaId": 132,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "As former President Donald Trump has downplayed the attack by his supporters last year  the worst attack against the Capitol in two centuries  the RNC last week took a voice vote to approve censuring Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming and Adam Kinzinger of Illinois at the party's winter meeting in Salt Lake City.",
    "author": "The Associated Press",
    "title": "McConnell rebukes RNC, calls Jan. 6 'violent insurrection'"
  },
  {
    "id": 567,
    "mediaId": 237,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Senate Minority Leader Mitch McConnell said it was not the job? of the Republican National Committee to be singling out members? with differing views, as it did by censuring Republican Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger.",
    "author": "Emily Brooks",
    "title": "McConnell: 'Not the job of the RNC' to censure Liz Cheney and Adam Kinzinger"
  },
  {
    "id": 541,
    "mediaId": 223,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "Source: Jim Lo Scalzo/Pool via AP\nThe censure of Reps. <span class='selected-term'>Liz Cheney</span> (R-WY) and Adam Kinzinger (R-IL), two particularly fierce Trump critics, by the RNC, has caused something of a stir and often a misinformed and distorted one at that, as RNC Chairwoman Ronna McDaniel went into detail about in a column published with Townhall on Tuesday.",
    "author": "Rebecca Downs",
    "title": "Some Laughably Irrelevant Figures Are Trying to Insert Themselves into the Liz Cheney Censure Conversation"
  },
  {
    "id": 543,
    "mediaId": 238,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "He did nothing to fight for his constituents and stop the most fraudulent election in American history.?\nTrump's statement, in which he continued to repeat false claims about election fraud, came a day after McConnell became the highest-ranking Republican elected official to criticize the RNC for the resolution censuring Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Trump attacks McConnell after he criticizes RNC censure of two House Republicans probing Jan. 6 insurrection"
  },
  {
    "id": 533,
    "mediaId": 238,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Which made the decision of the Republican National Committee to censure Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Republicans are attacking each other at the worst possible time"
  },
  {
    "id": 534,
    "mediaId": 195,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "The Republican National Committee's move to censure Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Julia Manchester",
    "title": "GOP falters in effort to recruit star governors for Senate"
  },
  {
    "id": 535,
    "mediaId": 21,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming, who has now been censured by state party officials and the Republican National Committee, is running for reelection against Trump pick Harriet Hageman.",
    "author": "Warren Rojas",
    "title": "Trump is on an endorsement spree and has now put his MAGA stamp on more than 100 political candidates since leaving the White House"
  },
  {
    "id": 516,
    "mediaId": 193,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "In Wyoming, a slew of candidates dropped out after he announced his support for Harriet Hageman's bid against a top Trump critic, Rep. <span class='selected-term'>Liz Cheney</span>.",
    "author": "Jill Colvin",
    "title": "Donald Trump turns to endorsements to keep bending GOP to his will"
  },
  {
    "id": 519,
    "mediaId": 237,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "The Republican National Committee recently censured GOP Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger for their work on the House committee investigating the riot.",
    "author": "Kate Scanlon",
    "title": "Minnesota GOP attorney general hopeful boasts staffers were Jan. 6 participants"
  },
  {
    "id": 507,
    "mediaId": 21,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "The leading Republican challenging Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming for the party's primary told The New York Times during an interview this week that she was unsure who lawfully won the 2020 presidential election.",
    "author": "John L. Dorman",
    "title": "Rep. Liz Cheney's leading GOP primary challenger says she doesn't know who lawfully won the 2020 presidential election"
  },
  {
    "id": 511,
    "mediaId": 195,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "The two men took opposite tacts this week to the Republican National Committee censure resolution of Reps. Adam Kinzinger (Ill.) and <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "Jordain Carney",
    "title": "McConnell-McCarthy split heading into November"
  },
  {
    "id": 501,
    "mediaId": 223,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "The 2024 Republican presidential primary may see RINO candidates running like Reps. <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger, and now potentially Gov.",
    "author": "Rebecca Downs",
    "title": "Yet Another RINO May Run for President in 2024"
  },
  {
    "id": 504,
    "mediaId": 43,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "NC's Rep. Ted Budd: Jan. 6 committee is in the way of freedom-loving Americans'\nNews&Observer, DANIELLE BATTAGLIA, 2/12/2022\nU.S. Rep. Ted Budd called his House colleagues <span class='selected-term'>Liz Cheney</span> and Adam Kinzinger divisive? Wednesday and said their work on the Jan. 6 committee is getting in the way of freedom-loving Americans.? His comments came during a segment on a conservative talk radio show about whether President Joe Biden is using a back-door plan to influence elections.",
    "author": "",
    "title": "North Carolina Open Thread: McCrory love story, Lumber River, Book banning, Redistricting, Cawthorn"
  },
  {
    "id": 493,
    "mediaId": 195,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "The rift within the GOP was on full display earlier this month when the Republican National Committee (RNC) voted to censure Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Max Greenwood",
    "title": "No 'mass exodus,' but GOP sees Trump grip loosening"
  },
  {
    "id": 335,
    "mediaId": 238,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Opinion: How to defeat the MAGA cult: Build a coalition that transcends party"
  },
  {
    "id": 308,
    "mediaId": 195,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - All eyes on Supreme Court"
  },
  {
    "id": 311,
    "mediaId": 129,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "And then there's a primary this summer in Wyoming, where <span class='selected-term'>Liz Cheney</span> is fighting to keep her House seat .",
    "author": "",
    "title": "It's Never a Good Time for the Hunter Biden Story"
  },
  {
    "id": 281,
    "mediaId": 195,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "House Minority Leader Kevin McCarthy (R-Calif.) revealed that more than 100 House Republicans had signed on to host a fundraiser later this month for Rep. <span class='selected-term'>Liz Cheney</span>'s (R-Wyo.)",
    "author": "Max Greenwood",
    "title": "Five takeaways from the House GOP's annual retreat"
  },
  {
    "id": 284,
    "mediaId": 129,
    "date": "3/25/2022 12:00:00 AM",
    "sentence": "In House races, Mr. Trump is most determined to oust the 10 Republicans who voted for his impeachment, particularly Representative <span class='selected-term'>Liz Cheney</span> of Wyoming.",
    "author": "",
    "title": "How the 2022 Primaries Are Testing Trump's Role as the G.O.P. Kingpin'"
  },
  {
    "id": 274,
    "mediaId": 302,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Meanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "Associated Press",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 280,
    "mediaId": 1576,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Meanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 269,
    "mediaId": 65,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "TRUMP RETURNING TO GEORGIA TO CAMPAIGN WITH DAVID PERDUE, HERSCHEL WALKER\nMeanwhile, some top national Trump antagonists, including Republican Rep. <span class='selected-term'>Liz Cheney</span> of Wyoming and Sen. Lisa Murkowski of Alaska, have not backed away from seeking reelection despite Trump promising for more than a year that he'd make sure they were defeated.",
    "author": "",
    "title": "Trump returns to Georgia confronting test of his grip on GOP"
  },
  {
    "id": 244,
    "mediaId": 43,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "That message to DOJ was only amplified by committee Chair Bennie Thompson, a Mississippi Democrat, and Vice Chair <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican, casting the committee's probe as a struggle for the future of democracy.",
    "author": "",
    "title": "THIS WEEK IN CONGRESS: Insulin, Legal Weed, 1/6 Contempt, Eastman Ruling & Senate Action?"
  },
  {
    "id": 20,
    "mediaId": 124,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "\"If you're a Republican running in a swing seat, are you a little annoyed that a bunch of money is going to be wasted on <span class='selected-term'>Liz Cheney</span> in a Republican seat instead of winning those swing seats that will get us a majority in the House?\"",
    "author": "",
    "title": "Trump is sitting on a fortune. Republicans want it for the midterms."
  },
  {
    "id": 226,
    "mediaId": 195,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Lawmakers voted almost entirely along party lines, 220-203, with Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report  Congress eyes votes on high court and virus"
  },
  {
    "id": 227,
    "mediaId": 65,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: Harriet Hageman, the leading Republican candidate challenging Rep. <span class='selected-term'>Liz Cheney</span> as Wyoming's at-large member of the House runs for re-election this year, reports that she's raked in over $1.3 million during the January-March first quarter of fundraising.",
    "author": "",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in over $1.3 million past three months"
  },
  {
    "id": 229,
    "mediaId": 19,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "The ringleader of the establishment Republicans, Sen. Mitch McConnell (R-KY), announced on Thursday a donation to Democrat ally Rep. <span class='selected-term'>Liz Cheney</span>'s (R-WY) reelection campaign.",
    "author": "Wendell Husebø",
    "title": "Mitch McConnell Donates to Liz Cheney"
  },
  {
    "id": 214,
    "mediaId": 25,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n Trump endorses Oz in Pennsylvania Senate primary race\n Judge declines to slow N.Y. primary elections despite ongoing redistricting battle\n More\nIn:\nIowa\nchuck grassley\n Adam Brewster\nCBS News political reporter.",
    "author": "Adam Brewster",
    "title": "Iowa Democratic Senate candidate to appeal judge's decision to keep her off ballot"
  },
  {
    "id": 198,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "Outside of Georgia, another top priority? target of Trump's whom the former president is expected to direct big dollars toward unseating is Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), Politico noted.",
    "author": "Ashley Oliver",
    "title": "Trump's First Major Midterm Donation Aims to Unseat Brian Kemp in Georgia"
  },
  {
    "id": 191,
    "mediaId": 25,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Democrat Abby Finkenauer to remain on ballot for U.S. Senate in Iowa\n Trump PAC gives $500K to group to defeat Georgia's GOP governor\n Pence decries cancel culture amid protests, praises Zelenskyy at University of Virginia\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n More\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "Democrat Abby Finkenauer to remain on ballot for U.S. Senate in Iowa"
  },
  {
    "id": 185,
    "mediaId": 43,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Most of the current coverage that portrays Pence and Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Joan McCarter\nDaily Kos Staff",
    "title": "Sitting senator shown to have colluded in coup attempt. Sunday shows yawn"
  },
  {
    "id": 176,
    "mediaId": 151,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Thiel, a close Trump ally, earlier this year held a fundraiser for Wyoming Republican Harriet Hageman, who is running to unseat GOP Rep. <span class='selected-term'>Liz Cheney</span>, an outspoken Trump critic.",
    "author": "",
    "title": "Vance parlays Trump endorsement into new Thiel money"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 175,
    "mediaId": 19,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "In 2022, both men have supported anti-American First primary candidates, such as warmonger Rep. <span class='selected-term'>Liz Cheney</span> (R-WY), who is in a tough primary fight against Trump-endorsed Harriet Hageman.",
    "author": "Wendell Husebø",
    "title": "Poll: Donald Trump Commands GOP's Greatest Favorability Rating, Romney and McConnell Lowest"
  },
  {
    "id": 163,
    "mediaId": 312,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "In February, she earned the ire of Senate Minority Leader Mitch McConnell after she participated in a conference organized by a white nationalist, and in October, she drew criticism for announcing, on the House floor, that her moderate Republican colleague Rep. <span class='selected-term'>Liz Cheney</span> was a joke? for participating in an investigation of the Jan. 6 Capitol attack, which Greene has been accused of helping to incite.",
    "author": "Nik Popli",
    "title": "One of Marjorie Taylor Greene's Primary Challengers is Raking in Republican Cash"
  },
  {
    "id": 154,
    "mediaId": 238,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "In the phone call with Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "Why Trump might give McCarthy a pass on Jan. 6"
  },
  {
    "id": 155,
    "mediaId": 32,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Jabin Botsford | The Washington Post | Getty Images\nRep. <span class='selected-term'>Liz Cheney</span> on Friday denied recording or leaking audio from a phone call that appears to show House Minority Leader Kevin McCarthy saying he would tell then-President Donald Trump to resign after the Jan. 6 Capitol riot.",
    "author": "Kevin Breuninger",
    "title": "Liz Cheney denies recording bombshell tape of Kevin McCarthy saying he would urge Trump to resign after Jan. 6 riot"
  },
  {
    "id": 157,
    "mediaId": 151,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "QUICK LINKS\nRepublican congressional candidate's wildly homophobic fundraising blast accuses his enemies of being 'sodomite predators' and 'LGBT groomers', from Warren Rojas at Business Insider\nUkrainian President Zelensky, Rep. <span class='selected-term'>Liz Cheney</span> among 5 recipients of JFK Profile in Courage Award, from Travis Andersen at The Boston Globe\nSenate front-runner in Pennsylvania embraces Biden and progressive agenda amid Democrats' midterm dilemma, from Manu Raju, Alex Rogers and Ali Zaslav at CNN\nTRANSITIONS\nGrace Bobertz is now director of scheduling for Sen. Michael Bennet (D-Colo.).",
    "author": "Oh Kevin",
    "title": "Oh Kevin, my Kevin"
  },
  {
    "id": 162,
    "mediaId": 25,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "In the January 10 meeting, Wyoming Rep. <span class='selected-term'>Liz Cheney</span>  who was the chairwoman of the Republican conference at the time  asks McCarthy if there's any chance Trump would resign.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy told fellow GOP leaders he was \"seriously thinking\" about telling Trump to resign after Jan. 6, recording shows"
  },
  {
    "id": 143,
    "mediaId": 593,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "One thing is certain: Trump will make the final decisions and will surely spend money to defeat Republicans like <span class='selected-term'>Liz Cheney</span> who voted to impeach him following the Jan. 6, 2020 assault by his supporters on the U.S. Capitol, the sources said.",
    "author": "Jarrett Renshaw and Alexandra Ulmer",
    "title": "Exclusive-Trump Weighs How Deeply To Dig Into His War Chest For November Elections"
  },
  {
    "id": 130,
    "mediaId": 129,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Mr. Trump made clear that he considers Mr. McIntosh to be by his side on a fight he cares most about: We're fighting <span class='selected-term'>Liz Cheney</span>,? Mr. Trump said of the Wyoming congresswoman who is a key figure in the committee investigating the Jan. 6, 2021 attack on the Capitol and Mr. Trump's role in the events leading to it.",
    "author": "",
    "title": "A big G.O.P. group amplifies its attacks on a Trump-backed Ohio candidate."
  },
  {
    "id": 94,
    "mediaId": 424,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "It's even possible that Representative <span class='selected-term'>Liz Cheney</span>, a neoconservative firebrand who broke with Trump following the insurrection, could win another term in Wyoming.",
    "author": "John Nichols",
    "title": "Meet the Poster Boy for the GOP's Trumpian Cult of Personality"
  },
  {
    "id": 3131,
    "mediaId": 238,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "Return to menu\nFormer president Donald Trump's political operation formed a joint fundraising committee Monday with the Republican challenger seeking to oust Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming's August primary, according to a filing with the Federal Election Commission.",
    "author": "",
    "title": "Post Politics Now Senate Democrats tee up a doomed vote to write abortion protections into law"
  }
]