[
  {
    "id": 719,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "Repeated attacks by former President Donald Trump as he tries to oust Rep. <span class='selected-term'>Liz Cheney</span> from Congress are fueling a massive fundraising haul by the Republican lawmaker from Wyoming.",
    "author": "Paul Steinhauser",
    "title": "Liz Cheney hauls in over $7 million last year as she fends off push by Trump to oust her from Congress"
  },
  {
    "id": 721,
    "mediaId": 65,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: Harriet Hageman, the leading Republican candidate challenging Rep. <span class='selected-term'>Liz Cheney</span> as Wyoming's at-large member of the House runs for re-election this year, reports that she's hauled in over $1 million in fundraising since declaring her candidacy for Congress less than five months ago.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in $1 million since launching congressional bid"
  },
  {
    "id": 625,
    "mediaId": 195,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Sen. Mitt Romney (R-Utah) on Friday criticized the Republican National Committee's (RNC) effort to censure Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Sarakshi Rai",
    "title": "Romney rips GOP censure effort against Cheney, Kinzinger"
  },
  {
    "id": 656,
    "mediaId": 238,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "A star chamber rendering judgment on Reps. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: The RNC turns into an Orwellian horror show"
  },
  {
    "id": 506,
    "mediaId": 238,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "In other words, six out of every seven Republicans are unwilling to say that Biden definitely won.?\nTo understand the swell of anger and lunacy that has washed over her party, one need only see the grass-roots reaction to Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.",
    "author": "",
    "title": "Opinion: Stop indulging the fantasy of a sane GOP majority"
  },
  {
    "id": 335,
    "mediaId": 238,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Opinion: How to defeat the MAGA cult: Build a coalition that transcends party"
  },
  {
    "id": 323,
    "mediaId": 223,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "He also spoke at a fundraiser in support of Rep. <span class='selected-term'>Liz Cheney</span> (R-WY).",
    "author": "Rebecca Downs",
    "title": "Mitt Romney Could Soon Be Getting a Primary Challenger"
  },
  {
    "id": 254,
    "mediaId": 25,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "More than 50 House Republicans were at a Washington, D.C., fundraiser on Wednesday night for Harriet Hageman, Rep. <span class='selected-term'>Liz Cheney</span>'s challenger in Wyoming.",
    "author": "Aaron Navarro",
    "title": "Over 50 House Republicans attend fundraiser for Liz Cheney's challenger, Harriet Hageman"
  },
  {
    "id": 227,
    "mediaId": 65,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: Harriet Hageman, the leading Republican candidate challenging Rep. <span class='selected-term'>Liz Cheney</span> as Wyoming's at-large member of the House runs for re-election this year, reports that she's raked in over $1.3 million during the January-March first quarter of fundraising.",
    "author": "",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in over $1.3 million past three months"
  },
  {
    "id": 205,
    "mediaId": 65,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Repeated attacks by former President Donald Trump as he tries to oust Rep. <span class='selected-term'>Liz Cheney</span> from Congress keep fueling massive fundraising by the Republican lawmaker from Wyoming.",
    "author": "Paul Steinhauser",
    "title": "Targeted by Trump, Cheney hauls in nearly $3 million the past three months for her re-election run"
  },
  {
    "id": 207,
    "mediaId": 195,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Campaign\nRep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Mychael Schnell",
    "title": "Cheney sets personal fundraising record"
  },
  {
    "id": 212,
    "mediaId": 25,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n Trump endorses Oz in Pennsylvania Senate primary race\n Judge declines to slow N.Y. primary elections despite ongoing redistricting battle\n Wisconsin governor vetoes Republican election bills\n More\nIn:\nUnited States Congress\nwyoming\nLiz Cheney\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "Liz Cheney sets personal fundraising record ahead of August primary"
  },
  {
    "id": 215,
    "mediaId": 118,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Noah Y. Kim",
    "title": "Liz Cheney Is Getting a Ton of MoneyFrom People Who Can't Vote for Her"
  },
  {
    "id": 185,
    "mediaId": 43,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Most of the current coverage that portrays Pence and Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Joan McCarter\nDaily Kos Staff",
    "title": "Sitting senator shown to have colluded in coup attempt. Sunday shows yawn"
  }
]