[
  {
    "id": 672,
    "mediaId": 238,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "At the Republican National Committee's winter meeting in Salt Lake City, party leaders censured Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Opinion: The Republican Party formally declares that truth is fiction and patriots are traitors"
  },
  {
    "id": 442,
    "mediaId": 238,
    "date": "2/19/2022 12:00:00 AM",
    "sentence": "), Rep. <span class='selected-term'>Liz Cheney</span> (Wyo.",
    "author": "",
    "title": "The top 10 GOP presidential candidates for 2024, ranked"
  },
  {
    "id": 391,
    "mediaId": 25,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n What to watch for in Texas' primary elections\n Trump's response to Putin's invasion of Ukraine reveals GOP fissures\n Democrats seize on GOP Senator Rick Scott's plan to tax more Americans\n Congressman Colin Allred discusses Democrats' midterm prospects\n Kevin McCarthy backs <span class='selected-term'>Liz Cheney</span>'s primary challenger Harriet Hageman\n More\n Caitlin Huey-Burns\nCaitlin Huey-Burns is a political reporter for CBS News.",
    "author": "",
    "title": "Biden's low approvals worry Democrats campaigning in midterm elections"
  },
  {
    "id": 368,
    "mediaId": 65,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Stefanik also made one endorsement in the Senate for GOP candidate Jane Timken in Ohio and last month joined House GOP Leader Kevin McCarthy, R-Calif., in taking the rare step of backing a primary challenger to a GOP colleague when they endorsed Harriet Hageman in her race against Rep. <span class='selected-term'>Liz Cheney</span> in Wyoming.",
    "author": "",
    "title": "Elise Stefanik unveils new endorsements for 2022 midterm elections"
  },
  {
    "id": 366,
    "mediaId": 19,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "And so we're seeing an uprising with teachers, with students, with parents, with working class America  these are the people that are going to propel an America First Win in 2022.?\nHowever, Presler stressed that electing America First conservatives is priority  not so-called Republicans in the same vein as Rep. <span class='selected-term'>Liz Cheney</span> (R-WY) and Rep. Adam Kinzinger (R-IL).",
    "author": "Hannah Bleau",
    "title": "Exclusive  Scott Presler: Every Aspect of Our Lives' Is Affected by Biden's Feckless and Reckless Agenda'"
  },
  {
    "id": 341,
    "mediaId": 65,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "FIRST ON FOX - Harriet Hageman, the GOP congressional candidate waging a primary challenge against Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., with the backing of former President Donald Trump, argues in a new digital campaign that the Republican incumbent is out of touch with voters and is \"obsessed with her personal war\" against Trump.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Wyoming GOP primary challenger Hageman urges sending Cheney home to Virginia'"
  },
  {
    "id": 199,
    "mediaId": 25,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Pence decries cancel culture amid protests, praises Zelenskyy at University of Virginia\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n Trump endorses Oz in Pennsylvania Senate primary race\n More\nIn:\nMike Pence\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "Pence decries cancel culture amid protests and praises Zelenskyy at University of Virginia"
  },
  {
    "id": 200,
    "mediaId": 25,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n Pence decries cancel culture amid protests, praises Zelenskyy at University of Virginia\n Democratic Senate candidate to appeal decision to keep her off ballot\n <span class='selected-term'>Liz Cheney</span> sets personal fundraising record ahead of August primary\n Coalition celebrates Judge Jackson's confirmation with record ad buy\n Trump endorses Oz in Pennsylvania Senate primary race\n More\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "author": "Aaron Navarro",
    "title": "Pence decries cancel culture amid protests and praises Zelenskyy at University of Virginia"
  },
  {
    "id": 3354,
    "mediaId": 132,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Stefanik is the third-ranking leader of the House Republican caucus, replacing Rep. <span class='selected-term'>Liz Cheney</span>, R-Wyo., who angered the party with her denunciations of Trump after the Jan. 6 attack on the Capitol.",
    "author": "",
    "title": "In Buffalo, Biden to confront the racism he's vowed to fight"
  }
]