[
  {
    "id": 317,
    "mediaId": 33,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "I think it's disgraceful,? said Rep. <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican on the outs with her conference over her vocal criticism of Trump.",
    "author": "Melanie Zanona",
    "title": "Madison is wrong': GOP backlash over Cawthorn grows after Zelensky insult"
  },
  {
    "id": 320,
    "mediaId": 25,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "The only lawmaker who has faced lingering consequences is Wyoming Republican Rep. <span class='selected-term'>Liz Cheney</span>, who was removed from her leadership position in the House Republican conference after repeatedly criticizing former President Trump for his role in the January 6 riot.",
    "author": "Rebecca Kaplan",
    "title": "McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy"
  },
  {
    "id": 321,
    "mediaId": 33,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "I think it's disgraceful,\" said Rep. <span class='selected-term'>Liz Cheney</span>, a Wyoming Republican on the outs with her conference over her vocal criticism of Trump.",
    "author": "Melanie Zanona",
    "title": "'Madison is wrong': GOP backlash over Cawthorn grows after Zelensky insult"
  },
  {
    "id": 322,
    "mediaId": 43,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "Now here's your Sunday morning lineup:\nMeet the Press: Sen. Chris Murphy (D-CT); Rep. <span class='selected-term'>Liz Cheney</span> (R-WY); NATO Secretary General Jens Stoltenberg.",
    "author": "",
    "title": "Cheers and Jeers: Rum and Granny's Canned Drone Killers FRIDAY!"
  },
  {
    "id": 311,
    "mediaId": 129,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "And then there's a primary this summer in Wyoming, where <span class='selected-term'>Liz Cheney</span> is fighting to keep her House seat .",
    "author": "",
    "title": "It's Never a Good Time for the Hunter Biden Story"
  },
  {
    "id": 303,
    "mediaId": 195,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Last year's retreat was hampered by questions surrounding the future of Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report - Jackson fends off attacks; Biden to Europe"
  },
  {
    "id": 248,
    "mediaId": 151,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "The North Carolina conservative appeared alongside other House Republicans at a fundraiser for Harriet Hageman, the Trump-backed opponent of Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.).",
    "author": "",
    "title": "Cloud of notoriety builds over Cawthorn after sex-and-drugs claims"
  },
  {
    "id": 234,
    "mediaId": 43,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Reps. <span class='selected-term'>Liz Cheney</span> (Wyo.)",
    "author": "",
    "title": "Overnight News Digest: Ruble recovers as Russian oil flows; IPCC act now to prevent climate disaster"
  },
  {
    "id": 165,
    "mediaId": 238,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Ukrainian President Volodymyr Zelensky and Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "",
    "title": "Zelensky, Rep. Cheney to receive JFK Profile in Courage award"
  },
  {
    "id": 167,
    "mediaId": 209,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "The John F. Kennedy Library Foundation will, for the first time ever, honor 5 individuals with the John F. Kennedy Profile in Courage Award this year, including Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Brigid Kennedy",
    "title": "Zelensky, Liz Cheney among recipients of JFK Profile in Courage Award"
  },
  {
    "id": 97,
    "mediaId": 195,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Conservative commentator Meghan McCain pointed to a double standard for men, saying that Rep. <span class='selected-term'>Liz Cheney</span> (R-Wyo.)",
    "author": "Emily Brooks",
    "title": "Cawthorn ramps up defense as crass videos add to mountain of bad press"
  }
]