[
  {
    "id": 860,
    "mediaId": 98,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "GOP Reps. <span class='selected-term'>Liz Cheney</span> of Wyoming or Adam Kinzinger of Illinois, members of a House committee investigating the Jan. 6 insurrection, are often dismissed as party apostates.",
    "author": "NICHOLAS RICCARDI",
    "title": "Slow-motion insurrection': How GOP seizes election power"
  },
  {
    "id": 455,
    "mediaId": 43,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": " John Collins (@Logically_JC) February 18, 2022\nFormer Vice President Mike Pence on Thursday defended the Republican National Committee's February 4th resolution that censured United States Representatives <span class='selected-term'>Liz Cheney</span> (R-Wyoming) and Adam Kinzinger (R-Illinois) and designated the January 6th, 2021 Capitol insurrection as legitimate political discourse.?\n[...]\nSpeaking at a College Republicans event at Stanford University as reported by The Washington Post, Pence said that the RNC was not talking about people that engaged in violence against persons or property that day.? Rather, the diktat was meant to stand up for a whole range of people that have been set upon? by the bipartisan congressional panel.",
    "author": "",
    "title": "'legitimate political discourse'? Lord HeeHawley or Lando Cotton: better than Mike Pence in 2024?"
  },
  {
    "id": 391,
    "mediaId": 25,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "2022 Midterm Elections\n More\n What to watch for in Texas' primary elections\n Trump's response to Putin's invasion of Ukraine reveals GOP fissures\n Democrats seize on GOP Senator Rick Scott's plan to tax more Americans\n Congressman Colin Allred discusses Democrats' midterm prospects\n Kevin McCarthy backs <span class='selected-term'>Liz Cheney</span>'s primary challenger Harriet Hageman\n More\n Caitlin Huey-Burns\nCaitlin Huey-Burns is a political reporter for CBS News.",
    "author": "",
    "title": "Biden's low approvals worry Democrats campaigning in midterm elections"
  },
  {
    "id": 5516,
    "mediaId": 881,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Wyoming Republican Rep. <span class='selected-term'>Liz Cheney</span> took aim at Stefanik, who replaced her in GOP House leadership after an ugly fight last year.",
    "author": "",
    "title": "MORE LIKE THIS"
  }
]