{
  "id": 14021,
  "mediaId": 2892,
  "date": "2022-03-18",
  "headline": "Open Borders Chaos: Thousands of Illegals Set Loose by Biden Overwhelm Phoenix Airport",
  "image": "",
  "link": "https://www.westernjournal.com/open-borders-chaos-thousands-illegals-set-loose-biden-overwhelm-phoenix-airport/",
  "mediaOutlet": "Western Journalism Center",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Richard Moorhead",
  "authorUrl": "https://www.westernjournal.com/author/rmoorhead/",
  "termIds": [
    0
  ],
  "sentences": [
    "The airport spokeswoman said that some of the migrants are arriving “unprepared for travel.”\nAccordingly, airport staff are compelled to assist the large groups of travelers with purchasing plane tickets or even arranging for them to seek services from open-borders group International Rescue Committee.",
    "The Biden administration has adopted a policy of releasing illegal immigrants en masse, encouraging even more economic migrants from Central America and across the world who take the opportunity to skirt American immigration laws.",
    "“We actually pick up a lot of families at the detention center.”\nAguirre says that her group has moved more than 16,700 migrants from the border to Phoenix in the past year, after they were released from immigration detention.",
    "“We appreciate efforts to establish a system which ensures that everyone who arrives at the airport has a flight reservation and is prepared to travel,” said the airport’s Heather Shalbrack.",
    "The nongovernmental organizations involved in facilitating migrant travel are often over capacity, placing airport workers in the situation of dealing with the migrants, often after hours.",
    "A spokeswoman for the airport indicated that as many as 300 to 400 illegal immigrants are arriving every day, according to a statement provided to KPNX-TV.",
    "Since her group members can’t legally detain anybody or tell them what they can do, they go along with their wishes and drop them off at Sky Harbor.",
    "Workers at Phoenix Sky Harbor International Airport have been overwhelmed for months with illegal aliens bused in from the southern border.",
    "Pennsylvania Republican Lou Barletta has slammed the Biden administration for sending secretive ‘ghost flights’ of migrants to his state.",
    "The illegal immigrants are being transported from the border by Regional Center for Border Health, another open-borders organization.",
    "Immigration and Customs Enforcement also told KPNX that they’ve taken to dropping off illegal immigrants at the airport.",
    "Once they reach Phoenix, Aguirre said, the immigrants have the option to go to a shelter, a bus station or the airport.",
    "Aguirre said some still ask to be taken to the airport even if they haven’t made solidified travel plans.",
    "President Joe Biden’s border policies have drawn a flow of migrants that’s broken all-time records.",
    "Many of them don’t have the money necessary to purchase basic necessities such as food or diapers.",
    "The organization picks up the migrants directly from federal immigration detention centers.",
    "“We’re serving 300 people a day more or less,” said Amanda Aguirre, the CEO of RCBH.",
    "The group has six buses that can transport 50 people at a time."
  ]
}