{
  "id": 1708,
  "mediaId": 8438,
  "date": "2022-02-16",
  "headline": "Briefs: February 16th, 2022",
  "image": "https://cdn.centraljersey.com/wp-content/uploads/sites/25/2022/02/spr-briefs-Fulton-Bank-1111-S-Broad-St-Philadelphia-exterior.jpg",
  "link": "https://southphillyreview.com/2022/02/16/briefs-february-16th-2022/",
  "mediaOutlet": "southphillyreview.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "South Philly Review -",
  "authorUrl": "https://southphillyreview.com/author/southphillyreview/",
  "termIds": [
    0
  ],
  "sentences": [
    "Typical left-wing tactics\nLou Barletta, a Republican candidate for governor, criticized the Biden administration for its Department of Homeland Security issuing a “Terrorism Advisory Bulletin” warning that people who oppose vaccine and mask mandates, who have questions about the integrity of the 2020 election, or who are concerned about Afghan nationals being relocated to America are also potential “domestic violent extremists.”\nBarletta issued a statement saying the bulletin is typical of leftists.",
    "Yet again, the Biden administration and Democrat leaders fail to keep our streets safe.”\nApply for community council\nThe Office of the City Controller is seeking community leaders, religious leaders, business owners and residents to join the Community Advisory and Accountability Council that will support its review of the Philadelphia Police Department.",
    "Unsafe streets\nU.S. Senate candidate Jeff Bartos issued the following statement in response to a report that Immigration and Customs Enforcement will not deport an illegal immigrant who is alleged to have desecrated property with swastikas, and who has a lengthy criminal record, because of Washington, D.C.’s sanctuary city status.",
    "Fulton Bank opens financial center on Broad Street\nFulton Bank continued its expansion in Philadelphia by opening a new full-service banking center at 1111 S. Broad St.\nOver the last four years, Fulton Bank has opened three financial centers in the city and is planning another at 4101 Market St.",
    "Theatre Exile opens new play\nTheatre Exile at 1430 S. 13th St. will present The Motherf**ker with the Hat by Pulitzer Prize-winning playwright Stephen Adly Guirgis through Feb. 27 with Theatre Exile’s new theater limited-capacity audience of 60 guests, reduced from the usual 125-seat capacity.",
    "Top award for Compassus hospice\nThe Compassus hospice program serving the five counties in Southeastern Pennsylvania and surrounding communities has been awarded Community Health Accreditation Partner accreditation under the Hospice Standards of Excellence.",
    "Visitors can also fly a remotely operated vehicle over a model of the Titanic’s deck and, in another display, see how currents created by superheated water erupting from thermal vents carry nutrients that support life forms few ever dreamed existed.",
    "HS class of ‘68 reunion\nThe South Philadelphia High School Class of 1968 will hold its 55th reunion on Saturday, Oct. 21, 2023, from noon to 4 p.m. at the Waterfall Room, 2015 S. Water St. Tickets cost $60 and include buffet dinner and open bar.",
    "Tickets available for Southern Class of 1976 reunion\nThe South Philadelphia High School Class of 1976 will hold its 45th reunion on March 18 at the Lazaretto Ballroom, located at 99 Wanamaker Ave. in Essington, from 7-11 p.m. All are welcome.",
    "Here is the schedule through next summer: Hadestown (through Feb. 20, Academy of Music); Beautiful – The Carole King Musical (Feb. 22-27, Academy of Music); Rent: 25th Anniversary Farewell Tour (March 4-6, Merriam Theater); Oklahoma!",
    "(March 8-20, Forrest Theatre); Waitress (March 29 to April 3, Academy of Music); Hairspray (May 16-22, Merriam Theater); To Kill A Mockingbird (July 12-24, Academy of Music); and Dear Evan Hansen (Aug. 16-28, Forrest Theatre).",
    "We look forward to working with more individuals and businesses in Philadelphia,\nhelping them to achieve their financial goals.”\nFulton named Bill King as its financial center manager at the new Broad Street location.",
    "They can test their skill at manipulating a robotic arm of a replica of the submersible Alvin to pick up lava rocks and clams similar to what scientists do to gather samples of creatures from the ocean floor.",
    "Explore ocean depths\nA new exhibition opening this spring at the Academy of Natural Sciences of Drexel University, 1900 Benjamin Franklin Parkway, reveals the mysteries of the ocean’s greatest depths.",
    "Extreme Deep: Mission to the Abyss, opening April 2, invites museum visitors to explore newly discovered life forms, thermal vents, deep-sea research submersibles and shipwrecks including the Titanic.",
    "Water exhibit opens\nThe Academy of Natural Sciences of Drexel University, 1900 Benjamin Franklin Parkway, is presenting Invisible World of Water, on view through May 1 and free with general admission.",
    "The review will focus on the Police Department’s operational and resource deployment as well as how Philadelphia compares to other police departments across the country and best practices in policing.",
    "Upcoming cruises\nThe Bristol Cultural and Historical Foundation is sponsoring a cruise to Charleston and Bermuda, June 2-12, 2022, on the Celebrity Summit, sailing from Cape Liberty, in North Jersey.",
    "CHAP-accredited home health and hospice providers demonstrate compliance with the Centers for Medicare & Medicaid Conditions of Participation for Medicare Certification and CMS Quality Standards.",
    "Compassus is committed to achieving CHAP accreditation across the country as a testament to each community-based program’s commitment to quality as a cornerstone of operational excellence.",
    "Museum visitors will observe firsthand the technology that only recently has allowed scientists to travel to the ocean floor and discover the creatures that thrive in total darkness.",
    "For more information, contact the Class of 1976 reunion coordinators Michele T. at impizazz143@gmail.com or 267-971-4386 or contact Maria S. at mshonesty747@aol.com or 215-463-3215.",
    "Murder mystery dinner on March 15\nSouth Philadelphia Lions Club presents Death of a Gangster, a murder mystery dinner, on Tuesday, March 15, at 6 p.m. at IATSE, 2401 S. Swanson St.",
    "Activities at Academy of Natural Sciences\nThe Academy of Natural Sciences of Drexel University, 1900 Benjamin Franklin Parkway, is hosting several current and upcoming exhibits.",
    "Hidden Works of Nature: The Microscopic World in the Library & Archives will be on exhibit on the following Fridays, hourly from 11 a.m. to 4 p.m.: Feb. 18 and March 4 and 18.",
    "He’s working to overcome his addictions with the help of his sponsor, Ralph D, but is soon confronted by familiar demons when he discovers another man’s hat in his apartment.",
    "The rigorous evaluation required focuses on program structure and function, quality of services and products, human and financial resources and long-term viability.",
    "The exhibit coincides with “Water Year,” an initiative of the Academy of Natural Sciences and Drexel University aimed to increase public attention of the resource.",
    "“We are excited to continue our expansion in Philadelphia,” said E. Philip Wenger, chairman\nand CEO of the bank’s holding company, Fulton Financial Corporation.",
    "In achieving CHAP accreditation, Compassus has demonstrated it meets the industry’s highest nationally recognized standards for both quality and compliance.",
    "Horsey, Buckner & Heffler, a minority-controlled financial firm, will also provide assistance with interviews and budget and spending data analysis.",
    "Any American citizen would be punished for the long list of offenses this man has committed, including this anti-Semitic hate crime,” Bartos said.",
    "A junior scientist workshop titled Water Bugs, geared to kids in third to fifth grades, is scheduled for Saturday, March 19, from 10 a.m. to noon.",
    "Flower show tickets available\nThe Pennsylvania Horticultural Society announced that tickets are on sale for the Philadelphia Flower Show.",
    "People want to return to normal life, and telling everyone to shut up or be called a terrorist is not the way to get there,” he said.",
    "For tickets and more information, call Arleen Liberi [609-922-2419], Maria Leati [856-287-3734] or Stephen Michielli [267-252-2740].",
    "At the pit party, fans can see the massive 12,000-pound trucks up close, meet their favorite drivers and crews, and take pictures.",
    "The show will take place at Franklin Delano Roosevelt Park, 1500 Pattison Ave., from Saturday, June 11, through Sunday, June 19.",
    "The discussion Growing Art from Science will take place on Wednesday, Feb. 23, at 6:30 p.m. Register at https://bit.ly/3rRiQOe.",
    "After his release from prison, Jackie moves in with his childhood sweetheart Veronica as he tries to start his life anew.",
    "Currently it operates 20 financial centers in Philadelphia and its neighboring counties in southeastern Pennsylvania.",
    "The application and nomination form is at https://controller.phila.gov/about/opportunity-join-our-community-council/.",
    "Meanwhile, a fully escorted Holy Lands & Aegean Majesty cruise will sail Oct. 6-17, 2023, featuring 10 ports-of-call.",
    "CHAP is a nationally approved accrediting organization that assesses the quality of health care providers.",
    "Apply for scholarship\nThe deadline is March 1 to apply for the Children’s Scholarship Fund Philadelphia.",
    "The cost is $100 per person, and includes a four-course sit-down dinner, open bar and interactive show.",
    "For more information, visit https://theatreexile.org/shows/the-mfer-with-the-hat/ or call 215-218-4022.",
    "“These dangerous sanctuary city policies prevent ICE from deporting criminals with lengthy rap sheets.",
    "“Fulton Bank is headquartered here in Pennsylvania, with a long legacy of relationship-based\nbanking.",
    "Adherence to CHAP standards leads to better quality hospice care and better business performance.",
    "The Community Council’s members will be determined through an application/nomination process.",
    "“When I’m governor of Pennsylvania, we will restore the freedoms our residents are born with.",
    "Monster Jam at the Linc\nMonster Jam returns to Lincoln Financial Field on Saturday, April 16.",
    "Scholarships are available to income-eligible kids in kindergarten through eighth grade.",
    "“Sanctuary cities are havens for criminals – and this report is just the latest example.",
    "Kimmel schedule\nThe Kimmel Cultural Campus has returned to live Broadway programming.",
    "Rates, including airfare, range from $4,198 to $7,998 per person, double occupancy.",
    "The show starts at 7 p.m., with a pit party for fans going from 2:30 to 5:30.",
    "The final report is expected to be released publicly by summer 2022.",
    "Extreme Deep: Mission to the Abyss will run from April 2 to July 24.",
    "Extreme Deep: Mission to the Abyss will be on view through July 24.",
    "For more information, call 215-893-1955 or visit kimmelcenter.org.",
    "Rates range from $1,577 to $2,387 per person, double occupancy.",
    "The review will be supported by the Center for Policing Equity.",
    "For more information, visit compassus.com or call 215-557-7300.",
    "The review will be performed by Stout, an advisory firm.",
    "Proceeds benefit the Lions Club, a service organization.",
    "Call 215-788-9408 for information and reservations.",
    "Ocean Bound will run from Aug. 20 to Jan. 15, 2023.",
    "For tickets, go to PHSonline.org/the-flower-show.",
    "Tickets are available at www.ticketmaster.com.",
    "Applications will be accepted through Feb. 16.",
    "Invisible World of Water runs through May 1.",
    "For more information, visit ansp.org.",
    "Sea Change is running indefinitely.",
    "Register at https://bit.ly/3pbrMLq.",
    "They are awarded by random lottery.",
    "Call Lion Louise at 610-304-5674.",
    "The theme is In Full Bloom.",
    "Tickets are $50 per person.",
    "Reservations are required.",
    "South Phila."
  ]
}