{
  "id": 2971,
  "mediaId": 8489,
  "date": "2022-01-31",
  "headline": "Despite a court battle, Pennsylvania voters can still apply for mail ballots without an excuse",
  "image": "https://whyy.org/wp-content/uploads/2022/01/AP20297680596895-e1634679519857-1920x1075.jpeg",
  "link": "https://whyy.org/articles/despite-a-court-battle-pennsylvania-voters-can-still-apply-for-mail-ballots-without-an-excuse/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sam Dunklau",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We were woefully behind every state in the nation before we implemented vote by mail,” Murphy said “Now we have it, [and] now we have a chance to catch up on some of other modernizations and conveniences other states have known for years, like same day voter registration or early voting.”\nSusan Gobreski of the League of Women Voters said examining the state’s voting laws is fine, but added her group won’t support any plan to restrict mail ballot access, which some Republicans support and separately sued over last September.",
    "Air Date: February 1, 2022 10:00 am\nListen 49:12\nThe Department of State declined to say whether it would hold off on mailing out ballots pending the court case, citing the “ongoing litigation.” But it addressed the court decision in a statement on its website Friday:\n“[Friday’s] ruling on the use of mail-in ballots has no immediate effect on mail-in voting.",
    "3 months ago\nState Sen. Jake Corman (R-Centre), the chamber’s President Pro Tempore, said in a statement last week that now is a great time to re-examine the state’s voting laws – because some judges think the law around mail ballots should change.",
    "Separately, the Republican-controlled legislature is considering a number of state constitutional amendments aimed at changing the state’s voting laws, including requiring voters to show government-issued identification each time they vote.",
    "Ray Murphy of voter advocacy group Keystone Votes said that conversation should be targeted at making the ballot box easier for voters to access, rather than scaling back any of the changes that have been made in the last few years.",
    "Tom Wolf appealed the lower court’s decision to the state Supreme Court on Friday, voters can still apply for a mail-in ballot without having a legally-approved excuse: being in the military, away from home, ill or disabled.",
    "It said a foundational part of Act 77, the state’s major voting law overhaul approved in 2019, may run afoul of the state constitution, and that lawmakers would have to amend the document to remedy the issue.",
    "“Until and unless the Supreme Court of Pennsylvania upholds this case, you can still vote by mail and you should feel very comfortable doing so,” lawyer Ben Geffen of The Public Interest Law Center said.",
    "Commonwealth Court did not weigh in on the merits of voting by mail, stating it “expresses no view on whether such a system should, or should not, be implemented as a matter of public policy.",
    "“Today’s ruling should serve as a call to action to open up a serious conversation about the reforms necessary to make voting both accessible and secure for all Pennsylvanians,” Corman wrote.",
    "“If we start down the road of talking about this, I think our collective responsibility is to continue to figure out how to make sure that every eligible voter can vote,” Gobreski said.",
    "We talk Pennsylvania politics this hour - the challenge to mail-in voting and redistricting maps, false Electoral College certifications and the Senate and governor races.",
    "Commonwealth Court declared Pennsylvania’s no excuse vote-by-mail law unconstitutional late last week, setting off a legal battle in the state Supreme Court.",
    "Bruce Ledewitz, a Duquesne University law professor, said he believes the High Court will move quickly to decide the case to eliminate any confusion.",
    "A number of gubernatorial candidates, like former Congressman Lou Barletta, have pledged to roll back the no-excuse provision if elected.",
    "Tom Wolf has pledged to appeal the ruling to the state Supreme Court, which recent history suggests will reverse the decision.",
    "Lawmakers would have to approve those proposals twice before sending them to voters, who would also have to approve them.",
    "All mail ballots must be returned to county election offices by Primary Day on May 17th by 8 p.m.to be counted.",
    "Go ahead and request your mail-in ballot for the May primary election,” the statement read.",
    "The Supreme Court case may, however, affect timelines for mailing ballots to voters.",
    "The 3-2 ruling was delivered in Judge Mary Hannah Leavitt’s 49 page opinion.",
    "The Department of State is accepting applications online until then.",
    "Registered voters have until May 10th to apply for a mail ballot.",
    "“It’s a closed question, and it really is not partisan.",
    "It’s a pure issue of law,” Ledewitz said.",
    "But since Gov.",
    "Gov."
  ]
}