{
  "id": 2989,
  "mediaId": 4024,
  "date": "2022-01-31",
  "headline": "Trump, Republicans vindicated after Pennsylvania mail-in voting law struck down",
  "image": "https://www.lifesitenews.com/wp-content/uploads/2021/03/GettyImages-1145318135.jpg",
  "link": "https://www.lifesitenews.com/news/trump-republicans-vindicated-as-pennsylvanias-mail-in-voting-law-ruled-unconstitutional/",
  "mediaOutlet": "LifeSiteNews",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Raymond\nWolfe",
  "authorUrl": "https://www.lifesitenews.com/author/raymond-wolfe/",
  "termIds": [
    0
  ],
  "sentences": [
    "Writing for the majority, Judge Mary Leavitt said that “a constitutional amendment must be presented to the people and adopted into our fundamental law before legislation authorizing no-excuse mail-in voting can ‘be placed upon our statute books.’”\nThe Pennsylvania Constitution requires voters to cast ballots at polling places except in cases of illness, disability, observance of religious holidays, or “occupation or business.” The constitution exempts election workers as well.",
    "In addition, we should require sound signature matching and identification for every voter and clear the rolls of people who have died or moved out of state.”\nThe Commonwealth Court previously ruled in November 2020 that former Pennsylvania election chief Kathryn Boockvar violated state law with last-minute guidance that gave counties an extra week to verify voter ID.",
    "HARRISBURG, Pennsylvania (LifeSiteNews) – A state court stuck down Pennsylvania’s mail-in voting law last week, declaring it unconstitutional and vindicating Republicans’ concerns about the legality of mail-in voting in the 2020 Pennsylvania election.",
    "“We all know the answer—it wasn’t!”\nCongressional Republicans who declined to certify the 2020 election also pointed to Act 77, like Missouri Republican Sen. Josh Hawley, whose objection centered largely around concerns about the Pennsylvania law.",
    "Millions of dollars of private election process funding by Facebook CEO Mark Zuckerberg exacerbated disparities between counties’ election resources, disproportionately benefiting Democratic-leaning areas, according to election watchdogs.",
    "Pennsylvania’s unconstitutional election\nFollowing the 2020 president election, then-President Donald Trump and other Republicans raised concerns that Act 77 violated the Pennsylvania Constitution and opened the door to voter fraud.",
    "“Here is the key question: If widespread mail-in balloting is unconstitutional in Pennsylvania now, how could mail-in balloting have been constitutional in the RIGGED 2020 Presidential Election then?” Trump added.",
    "“Turns out the Pennsylvania mail-in balloting law from 2020 was unconstitutional, according to a statewide court today – as I said when I objected to certifying PA’s electoral votes,” Hawley tweeted Friday.",
    "“If Act 77 remains on the books after court appeals are exhausted, I will repeal it as governor, because I believe mail-in voting should be preserved only for those who cannot vote on Election Day.",
    "Boockvar, a Democrat, also faced criticism for instructing election officials to inspect ballots before Election Day and contact voters to fix flaws, which Republican counties said was illegal.",
    "The act will remain in place for now, as the Wolf administration appealed Friday’s ruling to the majority-Democrat Pennsylvania Supreme Court, which is expected to hand down a decision quickly.",
    "A five-judge panel of the Commonwealth Court ruled Friday that no-excuses absentee voting, which Pennsylvania adopted in a 2019 law titled Act 77, would require a constitutional amendment.",
    "The 2020 election in Pennsylvania was plagued by a host of other issues, like the unexplained loss of thousands of mail ballots and widespread voting machine breakdowns and delays.",
    "Violent Antifa activists harassed Hawley’s family at his D.C. home and publisher Simon & Schuster dropped the senator’s book deal after his vote against election certification.",
    "Wolf, whose second and final term ends January 2023, vetoed Republican-backed measures last year to outlaw private election process funding and tighten voting safeguards.",
    "A group of 14 Republican Pennsylvania House lawmakers, including 11 who voted in favor of Act 77, sued the Pennsylvania Department of State in August to overturn the law.",
    "“Now we know that not only was Act 77 a terrible law, it was also unconstitutional and shouldn’t have been passed in the first place,” former Rep. Lou Barletta said.",
    "Leavitt cited “binding precedent of the Pennsylvania Supreme Court,” noting rulings in 1839 and 1923 that overturned laws attempting to expand absentee voting.",
    "The law additionally lengthened submission deadlines, expanded voter registration, and set aside $90 million in state funding for new voting machines.",
    "Out of nearly 6.9 million Pennsylvanians who voted in the 2020 election, more than 2.5 million did so by mail – around 80 percent of them Democrats.",
    "“All American Patriots are thanking the Commonwealth Court of Pennsylvania for having the courage to do the right thing!” he wrote in a statement.",
    "Any legislation “that relaxes the in-person voting requirement must be preceded by an amendment to the Constitution,” she wrote.",
    "The Democratic National Committee, Pennsylvania Democratic Party, and three Republican county committees defended the law.",
    "Tom Wolf, allowed voters to request a mail ballot for any reason and submit ballots up to 50 days before an election.",
    "The case was consolidated with another lawsuit brought by a Republican county commissioner in Bradford County.",
    "Election investigations in other states, including Wisconsin and Arizona, reported similar irregularities.",
    "Act 77, passed by the Republican-controlled state legislature in 2019 and signed by Democratic Gov.",
    "Republican candidates for the Pennsylvania gubernatorial race also blasted Act 77.",
    "Most of Joe Biden’s 2020 votes in the Keystone State came from mail-in ballots.",
    "The panel’s two other Republicans sided with Leavitt.",
    "Trump celebrated the Pennsylvania ruling Friday.",
    "Pennsylvania holds primary elections in May.",
    "Two Democrats on the panel dissented.",
    "Gov."
  ]
}