{
  "id": 315,
  "mediaId": 8356,
  "date": "2022-02-26",
  "headline": "Pa. prosecutor refuses to investigate Mastriano for alleged campaign finance violations",
  "image": "https://www.gannett-cdn.com/presto/2021/03/22/PPPO/5ed5f74b-6251-44e4-a075-1247381a981c-AP21078531437730.jpg?crop=2999,1687,x0,y152&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.publicopiniononline.com/story/news/2022/02/26/mastriano-campaign-finance-pa-prosecutor-refuses-investigate/6945543001/",
  "mediaOutlet": "ldnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amber South",
  "authorUrl": "https://www.publicopiniononline.com/staff/4395887002/amber-south/",
  "termIds": [
    0
  ],
  "sentences": [
    "Jan. 6 committee:Pa. Sen. Doug Mastriano, Republican candidate for governor, subpoenaed\nDoug Mastriano running for governor:What we know about his ties to Jan. 6\nMastriano's finance report raises questions\nMastriano raised eyebrows earlier this week when it was revealed that his campaign had filed a finance report showing it spent less than $15,000 in 2021 and had $550,000 on hand to start the new year.",
    "\"Both Corman and Mastriano are members of the GOP in Pennsylvania, rhetorically fighting to win the Republican nomination for Governor from within that party,\" said Fogal, who left the GOP last year and registered as an Independent after the Jan. 6 insurrection at the U.S. Capitol and a fallout with the county's Republican committee over his support for Black Lives Matter.",
    "He continued: \"I have taken a limited amount of time away from my official duties in order to review and research the applicable law concerning the Elections Code and the criminal offense of perjury (as an aside, ask any prosecutor, and you will be told that this offense is rarely charged due to the difficulty in successfully proving the requisite intent element).",
    "Mastriano's gubernatorial opponent and state Senate Leader Jake Corman this week asked Franklin County District Attorney Matt Fogal to open a probe into whether Mastriano violated campaign finance law and committed perjury in connection with an amended finance report that showed he spent and raised hundreds of thousands of dollars more than previously reported.",
    "Soon after The Philadelphia Inquirer reported that the campaign had not revealed basic expenses found on most finance reports, Mastriano filed an updated report showing he had $1 million in his campaign account at the end of 2021 and had spent about $215,000 that year, about 15 times more than what was originally shown.",
    "Primary 2022:Hot races for governor, U.S. Senate, plus what you need to know about voting\nPa. Sen. Doug Mastriano:What we know about his fight with fellow Republicans\nRepublican race for Pa. governor\nMastriano and Corman are among a dozen candidates running in the Republican primary for Pennsylvania governor.",
    "In a letter to Fogal, a lawyer for Corman's campaign accused Mastriano of committing \"flagrant and willful violations of Pennsylvania's Election Code by submitting an obviously deficient and incomplete campaign finance report that failed to disclose hundreds of pages of transactions.\"",
    "Through the letter from his lawyer, Corman said \"this is exactly the type of offense that should be investigated if the Commonwealth's rules governing election fairness and transparency are to have any real application to the Commonwealth's elections.\"",
    "A county prosecutor in southcentral Pennsylvania says he will not investigate state Sen. Doug Mastriano, a frontrunner for the Republican nomination for governor, for alleged violations of campaign finance law.",
    "He made a name for himself speaking out against COVID-19 restrictions and has been a big supporter of former President Donald Trump and his efforts to overturn the 2020 presidential election.",
    "I have likewise reviewed the initial Campaign Finance report submitted by Mastriano and his campaign, as well as the amended filing for which they paid a late fee to the Department of State.",
    "He referred to Corman's letter as a stunt for attention, saying he only learned of it through media inquiries and never received any direct communication from the lawmaker or his attorneys.",
    "The report included 239 additional pages of contributions and expenditures, yet there was no apparent explanation as to how they had not been accounted for previously, the letter states.",
    "The congressional committee investigating the Jan. 6 insurrection at the U.S. Capitol recently subpoenaed Mastriano to testify about his involvement in efforts to overturn the election.",
    "It gives an example of one donor -- the owner of Martin's Famous Potato Rolls, based in Chambersburg -- whose contributions totaling more than $100,000 were not previously included.",
    "Pennsylvania's election code states that candidates running for state office must sign affidavits saying their campaign committee has not violated state law.",
    "A staunch conservative and a retired Army colonel, Mastriano has become well known during his first term as an elected state senator from Franklin County.",
    "Any false or misleading statement or report made under oath, whether by a candidate or their committee treasurer, constitutes perjury.",
    "In a letter Friday evening, Fogal called Corman's request for an investigation \"frivolous\" and \"shameful.\"",
    "\"There will be no further investigation of this matter, and no criminal prosecution.\"",
    "A recent poll found nearly 20% of respondents favored Mastriano, just behind U.S.",
    "Mastriano's and Corman's campaigns could not be reached Friday evening.",
    "Amber South can be reached at asouth@publicopinionnews.com.",
    "Corman came in a distant third, at 5.1%.",
    "Congressman Lou Barletta at 24%."
  ]
}