{
  "id": 4957,
  "mediaId": 8490,
  "date": "2022-04-21",
  "headline": "Rep. Kelly Visits WISR To Discuss Range Of Issues",
  "image": "https://butlerradio.com/wp-content/uploads/2022_04_21_KELLY-AT-WISR-e1650549728806.jpg",
  "link": "https://butlerradio.com/rep-kelly-visits-wisr-to-discuss-range-of-issues/",
  "mediaOutlet": "WISR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Friel",
  "authorUrl": "https://butlerradio.com/author/tyler/",
  "termIds": [
    4999,
    1476,
    1126,
    1477
  ],
  "sentences": [
    "“Let’s make sure that we don’t effect the economy in a way that’s negative.”\nHe also maintained that he has questions about the 2020 election and took issue with how the Supreme Court handled a lawsuit that was filed after the election.",
    "“To me, when the Supreme Court failed to even look at…it just added again to the belief in a lot of peoples hearts and minds that this voting process we go through isn’t right, fair, and isn’t just,” Kelly said.",
    "He detailed that one of the reasons he is seeking re-election is that he believes as a member of the Ways and Means Committee—he can have a major influence on policies in the 16th District.",
    "He also did not endorse candidates for the Republican primaries for senate and governor, however did say that he would be voting for Dr. Mehmet Oz for senate and Lou Barletta for governor.",
    "If the voters send me back to Washington, I will be third in line when it comes to the Chairmanship of Ways and Means, and I’m sitting on the sub-committee for taxes,” Kelly said.",
    "He added that since arriving in Washington, he’s worked his way up in the committee that has a say in taxes, trade, healthcare, and more.",
    "Not something that hinders people from being successful, but makes it easier for them to get there,” Kelly said.",
    "Let’s not put policies in place to make it cost more to take it out of the ground then to sell it,” Kelly said.",
    "I think the fact that we drew out the election three days created a lot of doubt,” Kelly said.",
    "The Republican from Butler joined our newsroom for an extensive conversation yesterday.",
    "Kelly believes that no-excuse mail-in ballots are unconstitutional in Pennsylvania.",
    "“It’s taken me awhile to work my way up in seniority with Ways and Means.",
    "“We’re always looking for some policies that are pro-growth policies.",
    "Congressman Mike Kelly is seeking his seventh term in Washington D.C.",
    "Kelly also advocated for more natural gas production in the area.",
    "“Pennsylvania has been dubbed the Saudi Arabia of natural gas.",
    "We have a wonderful opportunity with Marcellus Shale.",
    "Hear the full interview with Tyler Friel below:",
    "“The numbers just don’t make sense."
  ]
}