{
  "id": 579,
  "mediaId": 2603,
  "date": "2022-02-23",
  "headline": "Republicans' War on Trans Kids Keeps Getting Darker",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/4dd61d6e3898deacb45534c51b10dd5b.jpg",
  "link": "https://jezebel.com/republicans-war-on-trans-kids-keeps-getting-darker-1848582623",
  "mediaOutlet": "Jezebel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Leibert",
  "authorUrl": "https://jezebel.com/author/emilyleibert",
  "termIds": [
    5078,
    3846,
    1303,
    5928,
    5949,
    6159,
    6474,
    6653,
    6678
  ],
  "sentences": [
    "Abbott has completely dismissed the validity of gender-affirming surgeries, calling them “so-called ‘sex change’ procedures [that] constitute child abuse,” and also dismissed the lived experience of Texas’ trans children by noting that “it is already against the law to subject Texas children to a wide variety of elective procedures for gender transitioning,” including “removals of otherwise healthy body parts.” Those who fail to “report” the mere existence of trans kids in their vicinity will be subject to criminal penalties or the risk of job loss.",
    "On Tuesday, Texas Governor Greg Abbott reached a new dystopian low this week when he sent a wildly offensive directive to the commissioner of the Texas Department of Family and Protective Services asking the commissioner to prosecute the parents of trans kids as child abusers.",
    "The entire GOP is cruel for continuing to roll out this strategy without seeing the genocidal wave of hate that carries it through one conservative state after the next—or, perhaps, even more cruel for seeing that wave and thinking that, yup, spot on, absolutely crushed it.",
    "At least seven states have introduced legislation to limit the rights of trans and nonbinary people since the start of 2022 alone, and Republican lawmakers in Arizona, Alabama, Indiana, Kentucky, Oklahoma, New Hampshire, and Ohio are all seeking to push anti-trans bills.",
    "At this point, any sort of logic attributed to the argument that gender-affirming healthcare is child abuse is a sort of dystopian logic lifted straight out of the Handmaid’s Tale, which has proven to be closer to fact than fiction with each passing year.",
    "Yup—in the year 2022, smackdab in the middle of America, Land of the Free, an elected official has proudly mandated that teachers, doctors, and caregivers must report any trans students they interact with to the DFPS for investigation.",
    "As Atlantic writer Adam Serwer famously wrote about our country’s horrifying treatment of migrant kids, “the cruelty is the point.” Greg Abbott is beyond cruel for attacking kids that already have shockingly high suicide rates.",
    "Last month, Pennsylvania Governor candidate Lou Barletta pledged to “protect girls’ and women’s sports from biological male competitors,’’ exploiting the debate surrounding trans swimmer Lia Thomas for political steam.",
    "And the fear-mongering people who cheer these inflammatory developments on are equally as guilty in the war against trans kids, which has ramped up at an alarming rate in the last twelve months.",
    "And on Monday, a new amendment to Florida’s notorious “Don’t Say Gay” bill debuted amid nationwide political attacks on queer and trans youth.",
    "What we should be focusing our political efforts on is reaffirming trans kids, not criminalizing them or the adults that support them.",
    "These people are finding every possible way to weaponize these kids for political gain.",
    "?he first anti-trans bill of 2022 into law.",
    "Last week, Kristi Noem signed t?",
    "What the fuck."
  ]
}