{
  "id": 6224,
  "mediaId": 8254,
  "date": "2022-04-12",
  "headline": "Trump calls GOP governor candidate McSwain a coward, will not endorse",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/04/AP22091702994730.jpg?w=1280",
  "link": "https://www.abc27.com/pennsylvania-governor-election-2022/trump-will-not-endorse-gop-governor-candidate-william-mcswain/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    4905,
    5665,
    2765,
    3926,
    1126,
    1452,
    6506,
    6512
  ],
  "sentences": [
    "HARRISBURG, Pa. (WHTM) — Former President Donald Trump slammed Pennsylvania GOP gubernatorial candidate Bill McSwain on Tuesday, complaining the former federal prosecutor did “absolutely nothing” to investigate Trump’s false claims of widespread election fraud after Democrat Joe Biden won the state in 2020.",
    "McSwain, who spent nearly three years as the top federal prosecutor in Philadelphia under Trump, had been seeking Trump’s endorsement, calling the presidential election in Pennsylvania a “partisan disgrace” as he sought to curry favor with the former president.",
    "Trump’s false claims of a stolen election have been debunked by the courts, his own Justice Department and numerous recounts, and no prosecutor, judge or election official in Pennsylvania has raised a concern about widespread fraud.",
    "When he asked for Trump’s endorsement last summer, McSwain criticized the manner in which Pennsylvania’s presidential election was run but claimed that Trump’s attorney general, Bill Barr, had blocked him from investigating.",
    "Trump, who has endorsed celebrity surgeon and former TV host Mehmet Oz in Pennsylvania’s Republican U.S. Senate primary, has yet to make an endorsement in the crowded and competitive governor’s race.",
    "McSwain “told me that he had to do this because he was under pressure from Trump and for him to have a viable candidacy he couldn’t have Trump attacking him,” Barr told the paper last year.",
    "He knew what was happening and let it go.”\nMcSwain served as Trump’s-appointed U.S. Attorney for the Eastern District of Pennsylvania from April 6, 2018, to January 22, 2021.",
    "He was the U.S. Attorney who did absolutely nothing on the massive Election Fraud that took place in Philadelphia and throughout the commonwealth,” Trump said in a statement.",
    "In a recently published WHTM/Emerson College Polling/The Hill Pennsylvania primary poll of 1,000 likely Republican Pennsylvania voters, McSwain finished fourth with 7.9%.",
    "Barr told him to pass along any “serious allegations” of election fraud to the state’s attorney general’s office, McSwain said in a letter seeking Trump’s endorsement.",
    "So McSwain “tried to thread the needle” by saying “things that were technically true” without giving “support to Trump’s stolen election narrative,” Barr said.",
    "Former Senate candidate Sean Parnell and York County Republican Chairman Jeff Piccola have previously endorsed McSwain.",
    "McSwain has often touted his connection to Trump as he campaigns for the GOP nod in a crowded primary field.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "You’re fired,” Sam Newton, spokesperson for the Democratic Governors Association, said in a statement.",
    "Eight Republicans are seeking the party’s nomination to face Shapiro in November’s general election.",
    "He told The Philadelphia Inquirer that McSwain was never told to “stand down” from investigating.",
    "A message was sent by the Associated Press to McSwain’s campaign spokesperson seeking comment.",
    "“One person in Pennsylvania who I will not be endorsing is Bill McSwain for Governor.",
    "Barr disputed McSwain’s account, saying the order came from a top deputy, not him.",
    "Attorney General Josh Shapiro is the presumptive Democratic nominee for governor.",
    "Former congressman Lou Barletta received over double McSwain, receiving 19.8%.",
    "“Do not vote for Bill McSwain, a coward, who let our Country down.",
    "Democrats were gleeful about Trump’s snub of McSwain.",
    "The Associated Press contributed to this report",
    "Instead, Trump turned on him.",
    "Sign up here.",
    "“Sorry Bill."
  ]
}