{
  "id": 6975,
  "mediaId": 8489,
  "date": "2022-04-12",
  "headline": "Jake Corman was getting out of the race for governor, then Trump called",
  "image": "https://whyy.org/wp-content/uploads/2022/04/AP22102570099780.jpg",
  "link": "https://whyy.org/articles/jake-corman-was-getting-out-of-the-race-for-governor-then-trump-called/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Meyer",
  "authorUrl": "https://whyy.org/person/katie-meyer/",
  "termIds": [
    0
  ],
  "sentences": [
    "But ahead of his formal campaign announcement, he sent a widely-discussed letter to Trump — which Trump promptly publicized — asking for Trump’s support and claiming that former Trump Attorney General Bill Barr had prevented him from publicizing his concerns about election “irregularities.”\nBarr disputed McSwain’s re-telling, calling his letter “deceptive” and saying McSwain was simply trying to keep Trump from publicly insulting him.",
    "“He encouraged me to keep fighting, and that’s what I’m going to do.”\nSamuel Chen, a GOP political consultant and professor at Northampton Community College, hadn’t been surprised when Corman dropped out — in his view, the writing was on the wall, and it appeared to be a move that could help consolidate establishment support around a different candidate.",
    "But just hours later, he reversed the attempt and released a statement saying he would “continue to fight for Pa. families.”\n“Two developments today have led me to decide to remain in the race for governor: President Trump’s statement on the race and my conversation directly with the president,” Corman said.",
    "“Whether the candidate is a more Trump-esque candidate, or a more establishment candidate, the shadow of the Trump endorsement still holds a lot of power in this party.”\nThat’s a constant in the rest of the field, too.",
    "Former Congressman Lou Barletta, who lost a U.S. Senate race to Sen. Bob Casey in 2018 and has long been closely aligned with Trump, has led the GOP field in most polls, closely followed by State Sen. Doug Mastriano.",
    "Mastriano is widely seen as the most extreme politician in the race, having spent nearly two years preoccupied with disproven theories of widespread fraud in the 2020 election.",
    "Corman, who as Senate President Pro Tempore is the most powerful member of his chamber, had failed to build traction in a crowded, mostly politically extreme field.",
    "Trump’s obsession with his re-election loss also seems to be the force behind his anti-endorsement of McSwain, who he nominated to serve as U.S. Attorney in 2017.",
    "Calling McSwain a ‘coward’ for failing to act on Trump’s claim of ‘massive fraud’ in the 2020 presidential election, the ex-president rejects an endorsement.",
    "He’s an establishment guy.” He added, the entire episode just serves as a demonstration of the hold Trump has over all corners of the Republican party.",
    "And though Chen doesn’t necessarily think a Trump endorsement is make or break, he does think an anti-endorsement is hard to ignore in a crowded field.",
    "McSwain had already lagged Barletta, Mastriano, and former Delaware County Councilman Dave White in the polls, despite his healthy campaign finances.",
    "Before the 2020 election, the then-U.S. Attorney issued a pointed statement saying he intended to watch carefully for potential election issues.",
    "However, nearly every major candidate in the race has, in some capacity, signaled that they too believe there’s some truth to those theories.",
    "2 weeks ago\nFacing single-digit polling and flagging fundraising, he filed his paperwork to withdraw from the race Tuesday afternoon.",
    "A staffer on the campaign noted, the event doesn’t constitute an endorsement, and Trump himself isn’t on the official list of guests.",
    "The former president called him “a coward, who let our country down” because he didn’t focus enough on election fraud theories.",
    "Pennsylvania’s GOP gubernatorial primary had a tumultuous Tuesday — and all of that chaos can be traced back to Donald Trump.",
    "Barletta’s campaign is holding an event at Mar-a-Lago Tuesday evening — something that can only happen with Trump’s approval.",
    "Corman, who was generally seen as a pragmatist, himself spearheaded a vaguely-defined review of the 2020 election.",
    "Then he convinced another candidate, Jake Corman, to reverse his decision to drop out of the race.",
    "“I think you see in this race, and in other races, [Trump’s] imprint is just there,” he said.",
    "He ultimately didn’t file any fraud cases, as there was no evidence fraud had happened.",
    "Trump issued an anti-endorsement of one candidate, Bill McSwain, Tuesday morning.",
    "This episode seems to be at the heart of Trump’s recent rejection of McSwain.",
    "Corman also isn’t the only candidate with a chance at one-on-one Trump time.",
    "Perceived allegiance with Trump has, at least so far, been essential.",
    "McSwain had always sought to tie himself to Trump in voters’ eyes.",
    "So he was taken aback when Corman quickly reversed his decision.",
    "Corman, Chen said, “is not the kind of guy who is very Trumpy.",
    "“I certainly think it hurts McSwain significantly,” he said.",
    "But, the staffer added, he may drop by."
  ]
}