{
  "id": 7170,
  "mediaId": 2641,
  "date": "2022-04-07",
  "headline": "Emerson Poll: Oz Stalks Lead, but Undecided Voters Lean Toward McCormick",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=46b6da35-3726-4352-b19b-44220e7a294f&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/mehmet-oz-david-mccormick-pennsylvania-senate/2022/04/07/id/1064838/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Mack",
  "authorUrl": "",
  "termIds": [
    5862,
    4656,
    2950,
    2911,
    2540,
    446,
    6506
  ],
  "sentences": [
    "\"McCormick has a strong base of support across most demographics that increases when undecided voters are asked who they lean toward, compared to Oz who seems to lack a clear base, and sees less growth than McCormick, Bartos, or Barnette,\" wrote Spencer Kimball, executive director of Emerson College Polling, in a statement Thursday.",
    "While Dr. Mehmet Oz is within the margin of error for the lead in Emerson College's Pennsylvania Senate GOP primary poll, the very likely undecided voters are siding heavily with David McCormick.",
    "McCormick leads Oz in polling by 1 point (18%-17%) when undecided is an option, but is an overwhelming favorite among those likely voters, leading by 6.6 points when undecided is not an option.",
    "\"Barletta holds the plurality of support among suburban (28%) and urban (24%) voters, while Mastriano leads Barletta among rural voters 30% to 25%,\" Kimball noted.",
    "The Pennsylvania GOP gubernatorial primary is similarly shaping up as a two-candidate race, according to the Emerson poll:\nLou Barletta: 20%.",
    "The Emerson College/The Hill Pennsylvania Republican primary poll was conducted April 3-4 among 1,000 very likely Republican primary voters.",
    "When very likely GOP primary voters were forced to make a choice, McCormick's lead widens considerably:\nMcCormick: 27.2%.",
    "\"Barletta also leads all age groups except those aged 50-64, where Mastriano holds 29% of this age bloc's support.\"",
    "When undecided voters were forced to choose, the leader expanded his edge here, too:\nBarletta: 26.2%.",
    "This race is one of the most hotly contested GOP primaries in this election cycle.",
    "Early April polling for Pennsylvania's Senate GOP primary:\nMcCormick: 18%.",
    "It has a margin of error of plus or minus 3 percentage points.",
    "Carla Sands: 8%\nGeorge Bochetto: 4%\nSean Gale: 3%.",
    "Hart: 6.9%\nGale: 4.1%\nGerow: 3.6%\nZama: 3.1%.",
    "Doug Mastriano: 19%\nDavid White: 12%.",
    "Melissa Hart: 3%\nJoseph Gale: 3%.",
    "Charles Gerow: 3%\nNche Zama: 2%.",
    "Jake Corman III: 4%.",
    "Kathy Barnette: 10%.",
    "All rights reserved.",
    "Mastriano: 22.4%.",
    "Bill McSwainL 8%.",
    "Barnette: 14.8%.",
    "Jeff Bartos: 9%.",
    "Undecided: 33%.",
    "Undecided: 27%.",
    "McSwain: 11.9%.",
    "© 2022 Newsmax.",
    "Special Links:",
    "Bartos: 17.1%.",
    "Bochetto 4.6%.",
    "Sands: 11.4%.",
    "Corman: 7.6%.",
    "White: 14.2%.",
    "Gale 4.3%.",
    "Oz: 20.6%.",
    "Oz: 17%."
  ]
}