{
  "id": 9372,
  "mediaId": 6570,
  "date": "2022-03-23",
  "headline": "GOP governor candidates take magic wand approach to fix one thing in Pennsylvania",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/Vote-voter-voting-election-day-primary-booth-logo-american-patriotic-STOCK-GENERIC-1648063254.jpg",
  "link": "https://www.post-gazette.com/news/politics-state/2022/03/23/gop-governor-candidates-take-magic-wand-approach-fix-one-thing-pennsylvania/stories/202203230115",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julian Routh",
  "authorUrl": "",
  "termIds": [
    3926,
    4081,
    4811,
    1659,
    2911,
    2148,
    1126,
    6506
  ],
  "sentences": [
    "Getting the first wave of the wand was Mr. McSwain, the former U.S. attorney, who wasted no precious seconds before reiterating something he had said earlier: that he would “turn on the spigot for natural gas.” It’s the key to Pennsylvania’s economic future, he said — and the way for the state to supercharge its economy and contribute to American energy independence.",
    "It was a lighthearted reprieve from an hour of consensus, as Lou Barletta, Bill McSwain, Jake Corman and Dave White — those in the field who have registered by name in recent polling — mostly agreed on the need to unleash Pennsylvania’s energy sector, cut the corporate net income tax rate and make the state less of a regulatory maze for businesses.",
    "This week, Indiana’s Republican governor vetoed a bill by the GOP-dominated legislature banning transgender females from participating in girls school sports — a bill that the state’s American Civil Liberties Union affiliate deemed “hateful legislation.”\nPennsylvania’s primary is May 17.",
    "Though it was unclear if the wand would allow it, Mr. White, a businessman and former Delaware County councilman, said he’d go back eight years and ensure that Mr. Wolf lost his first election, then go back and ensure that former President Donald Trump won in 2020.",
    "The task of stuffing the numerous Republican gubernatorial contenders into one camera frame continued to prove difficult on Wednesday at a business forum, but voters were able to pinpoint some easy differences between the candidates with one quirky question.",
    "But when given 30 seconds to answer — and the symbolic magic wand that could cut through even the strictest of bureaucratic holdups — voters were given a straightforward look at the priorities and worldviews of the candidates who hope to succeed Gov.",
    "Shifting gears, Mr. Barletta, a former U.S. congressman and mayor of Hazleton, added that he would stand up for the privacy of young women and protect their sports from “biological” males — referring to transgender females competing in girls sports.",
    "“We need to take advantage of all the God-given resources we have in the state,” Mr. McSwain said, echoing a common reprieve by GOP office-seekers who blame Democrats like Mr. Wolf and President Joe Biden for discouraging natural gas production.",
    "Mr. Corman, who has long criticized the perceived over-reach of Mr. Wolf’s powers during the COVID-19 pandemic, brought it up again, decrying a governor that — he said — governed through executive order the last two years.",
    "The magic wand made its way down the line — which also included GOP strategist Charlie Gerow, former U.S. Rep. Melissa Hart and heart surgeon Nche Zama — to Mr. White, who indicated that he’d use it more as a time machine.",
    "At the end of the line, Mr. Barletta, ushering the wand into retirement, said he’d use it to make sure Pennsylvania Attorney General Josh Shapiro does not become governor.",
    "His comments come as Republican politicians across the country push efforts — some legislative — in what they say is an attempt to protect the integrity of female sports.",
    "Next up with the magic wand — fresh off its role as spigot-bender — was Senate President Pro Tempore Jake Corman, who said he’d use his powers to protect freedoms.",
    "But in the end, Mr. White — a realist — pointed out that Pennsylvania doesn’t have a magic wand, and needs a leader who has ideas to get people back to work.",
    "Advocates insist such efforts would have little impact on sports but would send a wider, deeply painful message to many who are already vulnerable.",
    "Though he’s registered in the top tier of recent gubernatorial polling, state Sen. Doug Mastriano did not participate in the forum.",
    "Julian Routh: jrouth@post-gazette.com; Twitter: @julianrouth\nFirst Published March 23, 2022, 12:20pm",
    "“There’s no magic wand to get it done — just hard work, integrity and honesty,” Mr. White said.",
    "If you could wave a magic wand to fix one thing in Pennsylvania, what would it be?",
    "The government should not tell people how they should live, Mr. Corman added.",
    "“We need to be able to govern in a way that puts people first,” he said.",
    "Mr. Shapiro is the lone Democrat seeking his party’s nomination.",
    "Tom Wolf, even in such a crowded field."
  ]
}