[
  {
    "id": 4467,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "New Joint Fundraisers\nNittany-Buckeye Joint Committee (Reps. <span class='selected-term'>Brian Fitzpatrick</span>, Brad Wenstrup, BRINGING AMERICA TOGETHER PAC, BUILDING AND RESTORING THE AMERICAN DREAM FUND)\nWinning Red Committee (Sens.",
    "author": "",
    "title": "Pelosi aide joins theGROUP"
  },
  {
    "id": 3600,
    "mediaId": 2512,
    "date": "2022-01-21",
    "sentence": "and Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-Penn.",
    "author": "Meaghan Ellis",
    "title": "Michael Flynn's allies allegedly plotted to uncover dirt on GOP lawmakers who refused to back Trump's voter fraud claims"
  },
  {
    "id": 4217,
    "mediaId": 2740,
    "date": "2022-01-27",
    "sentence": "Reps. Marcy Kaptur, D-Ohio, <span class='selected-term'>Brian Fitzpatrick</span>, R-Penn., Mike Quigley, D-Ill., and Andy Harris, R-Md., are co-chairs of the bipartisan Congressional Ukraine Caucus.",
    "author": "",
    "title": "Putin plans to crush liberty in Ukraine. Free World must unite to stop him."
  },
  {
    "id": 1012,
    "mediaId": 2664,
    "date": "2022-02-11",
    "sentence": "Pompeo’s PAC donated $2,500 to at least three Republican congressmen — <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, Don Bacon of Nebraska and Andrew Garbarino of New York — among the 13 GOP members voting in support of the $1.2 trillion infrastructure bill.",
    "author": "Tim Carpenter",
    "title": "Pompeo's PAC spends $2.2 million as he lays the foundation for a presidential campaign"
  },
  {
    "id": 10,
    "mediaId": 2658,
    "date": "2022-02-25",
    "sentence": "), Terri Sewell (D-Ala.), Buddy Carter (R-Ga.), <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.), Don Bacon (R-Neb.)",
    "author": "",
    "title": "CDC makes a new map"
  },
  {
    "id": 12835,
    "mediaId": 2546,
    "date": "2022-02-28",
    "sentence": "The 1st District in the Philadelphia suburbs, held by Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span>, will remain one of the state’s most competitive.",
    "author": "Michael Macagnone",
    "title": "Pennsylvania GOP urges Supreme Court to toss congressional map"
  },
  {
    "id": 12779,
    "mediaId": 2746,
    "date": "2022-03-01",
    "sentence": "Mr. Gottheimer will deliver that “perspective” alongside Rep. <span class='selected-term'>Brian Fitzpatrick</span>, a Pennsylvania Republican, with whom he chairs the Congressional Problem Solvers Caucus.",
    "author": "Haris Alic",
    "title": "Democrats’ divisions spill into view with competing responses to Biden’s State of the Union"
  },
  {
    "id": 12750,
    "mediaId": 2528,
    "date": "2022-03-01",
    "sentence": "Then, on Monday night, the centrist group No Labels announced that \"immediately following\" the speech, it would host \"an unprecedented bipartisan perspective\" panel featuring Democratic Rep. Josh Gottheimer of New Jersey and Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, the two co-chairs of the bipartisan Problem Solvers Caucus in Congress.",
    "author": "Grace Panetta",
    "title": "3 Democratic members of Congress are giving responses to Biden's State of the Union"
  },
  {
    "id": 13085,
    "mediaId": 2619,
    "date": "2022-03-01",
    "sentence": "In addition, moderate Democratic Rep. Josh Gottheimer of New Jersey had been due to give his “perspective” immediately following the State of the Union, as he participated in an event hosted by the “No Labels,” a nonpartisan group whose stated goal is to “break the gridlock and dysfunction.”\nRepublican Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsyvlania also had been scheduled to take part in the No Labels event.",
    "author": "Victor Reklaitis",
    "title": "‘Biden and his party have sent us back,’ says Republican after State of the Union, as Democrats also respond to speech"
  },
  {
    "id": 13045,
    "mediaId": 2671,
    "date": "2022-03-01",
    "sentence": "Then, on Monday night, the centrist group No Labels announced that “immediately following” the speech, it would host “an unprecedented bipartisan perspective” panel featuring Democratic Rep. Josh Gottheimer of New Jersey and Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, the two co-chairs of the bipartisan Problem Solvers Caucus in Congress.",
    "author": "The Right Scoop",
    "title": "THREE Democrats will be responding to Joe Biden’s SOTU address"
  },
  {
    "id": 12501,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "And No Labels “will host an unprecedented bipartisan response” from Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> and Democratic Rep. Josh Gottheimer, co-chairs of the House Problem Solvers Caucus (which creates more problems than it solves).",
    "author": "Laura Clawson",
    "title": "and the economy in first State of the Union"
  },
  {
    "id": 12537,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "Several members were wearing scarves in either of the two colors on Ukraine’s flag, while others carried miniature flags reportedly being handed out by Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.), a co-chair of the congressional Ukraine and Ukrainian American Caucus.",
    "author": "",
    "title": "Lawmakers wear blue and yellow to State of the Union in nod to Ukraine"
  },
  {
    "id": 12633,
    "mediaId": 2528,
    "date": "2022-03-01",
    "sentence": "Gottheimer will be speaking alongside Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> and the director of No Labels.",
    "author": "Bryan Metzger",
    "title": "Josh Gottheimer says it's 'massively unproductive' for Rashida Tlaib to give a State of the Union response even though he's also giving one"
  },
  {
    "id": 13315,
    "mediaId": 2634,
    "date": "2022-03-01",
    "sentence": "But Gottheimer was scheduled to deliver his own response to the speech on behalf of No Labels, a centrist group, along with Republican Representative <span class='selected-term'>Brian Fitzpatrick</span>.",
    "author": "Grace Segers",
    "title": "Biden Searches for a Big Reset in His State of the Union"
  },
  {
    "id": 12784,
    "mediaId": 2745,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.) who had worked in Kyiv as an FBI agent, handed out Ukrainian flags, while Rep. Mike Quigley (D-Ill.), whose district has a strong Ukrainian American community, distributed blue-and-yellow ribbons.",
    "author": "",
    "title": "Ukrainian ambassador gets standing ovation, as Biden praises Ukraine’s strength in State of the Union"
  },
  {
    "id": 12954,
    "mediaId": 2745,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.), who worked in Kyiv as an FBI agent, handed out Ukrainian flags while Rep. Mike Quigley (D-Ill.), whose district has a strong Ukrainian American community, distributed blue and yellow ribbons.”\nFirst Lady Jill Biden, who donned a satin sheath Sally LaPointe dress in the color blue of Ukraine's flag, had an embroidered sunflower — the national flower of Ukraine — added to the right sleeve of her dress.",
    "author": "",
    "title": "Biden doubles down on Russian sanctions, domestic agenda in State of the Union address"
  },
  {
    "id": 12963,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "“If you hit him in the oil and gas sector of his economy, he will fail.”\nReps. Josh Gottheimer (D-N.J.) and <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.) have introduced a matching House version of the bill.",
    "author": "",
    "title": "Bipartisan bill banning Russian oil sets up clash with White House"
  },
  {
    "id": 12480,
    "mediaId": 8322,
    "date": "2022-03-03",
    "sentence": "",
    "author": "Tyler Olson",
    "title": "White House asks Congress for $10B in Ukraine aid as Putin's brutal war ratchets up"
  },
  {
    "id": 12772,
    "mediaId": 2745,
    "date": "2022-03-04",
    "sentence": "All speakers echoed the remarks of Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.), who praised federal workers as “dedicated and hard-working public servants that play an incredibly vital role in all of our communities and our nation.”\nHis appearance demonstrated a level of federal workforce support uncommon among his Republican partisans but one informed by his experience as a federal prosecutor and FBI agent.",
    "author": "",
    "title": "Biden has been good to federal unions. But one of the biggest ones says he needs to improve pay and benefits."
  },
  {
    "id": 12992,
    "mediaId": 2746,
    "date": "2022-03-06",
    "sentence": "Other lawmakers in the House who support a ban include Reps. Josh Gottheimer, New Jersey Democrat and <span class='selected-term'>Brian Fitzpatrick</span>, Pennsylvania Republican.",
    "author": "",
    "title": "Blinken: U.S. in talks with allies about banning Russian oil imports"
  },
  {
    "id": 11205,
    "mediaId": 8401,
    "date": "2022-03-08",
    "sentence": "READ MORE:\nRep. <span class='selected-term'>Brian Fitzpatrick</span> acknowledges that while, at least for now, this ban will cost Americans, he says it is the only way to break Russia’s grip on our wallets.",
    "author": "Alicia Roberts",
    "title": "Pennsylvania Congressman Says Decision To Ban Russian Energy Imports Needed To Happen"
  },
  {
    "id": 11091,
    "mediaId": 2572,
    "date": "2022-03-08",
    "sentence": "US, POLAND IN TALKS TO HELP UKRAINE ACQUIRE WARPLANES\nThe letter was led by Himes, and signed by Democratic congressmen, including Reps. Adam Schiff, Raja Krishnamoorthi, Adriano Espaillat, Tom Malinowski, Eric Swalwell, Brad Sherman and Jackie Speier, and Republican congressmen, including Reps. Brad Wenstrup, Chris Stewart, Mike Turner, <span class='selected-term'>Brian Fitzpatrick</span>, Andy Barr, Brian Mast, Burgess Owens and Mike Waltz.",
    "author": "Brooke Singman",
    "title": "Lawmakers urge Biden to work with NATO allies to provide aircraft to Ukraine to 'defend and secure its skies'"
  },
  {
    "id": 11143,
    "mediaId": 2573,
    "date": "2022-03-08",
    "sentence": "Rep. <span class='selected-term'>Brian Fitzpatrick</span>, R-Pa., slammed the Biden administration for its energy policy as the White House faces growing calls to ban Russian oil imports.",
    "author": "Fox News Staff",
    "title": "Rep. Fitzpatrick slams Biden for refusing to change course on oil production: 'You can't reason with crazy'"
  },
  {
    "id": 11084,
    "mediaId": 2572,
    "date": "2022-03-08",
    "sentence": "Continue reading …\nINVASION EXPLAINED - Rep. <span class='selected-term'>Brian Fitzpatrick</span> said Putin's appetite to reconstitute the former Soviet Union and his advanced age are reasons for Ukraine invasion.",
    "author": "Jack Durschlag",
    "title": "RT editor resigns, cites 'nuclear war' over Ukraine invasion; Dems projected to face bloodbath in midterms"
  },
  {
    "id": 10928,
    "mediaId": 2745,
    "date": "2022-03-10",
    "sentence": "In October, Sen. Brian Schatz (D-Hawaii) and Reps. Earl Blumenauer (D-Ore.) and <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.) introduced legislation to ban commodities from illegally deforested land from entering the United States.",
    "author": "",
    "title": "Heat pumps can counter Putin and the climate crisis, advocates say"
  },
  {
    "id": 15408,
    "mediaId": 8418,
    "date": "2022-03-11",
    "sentence": "The VAWA Reauthorization includes Kayden’s Law, which U.S. Representative <span class='selected-term'>Brian Fitzpatrick</span> (PA-01) authored to honor the memory of Kayden Mancuso of Lower Makefield.",
    "author": "Bucks Local News",
    "title": "House and Senate pass Fitzpatrick-authored Kayden’s Law; legislation heads to President’s desk"
  },
  {
    "id": 10978,
    "mediaId": 2732,
    "date": "2022-03-12",
    "sentence": "“The trail and this special designation will allow Pennsylvanians to harness the great outdoors to forever commemorate our heroes and memorialize the innocent lives our nation lost on 9/11,” said U.S. Rep. <span class='selected-term'>Brian Fitzpatrick</span>, R-Bucks County.",
    "author": "Mary Ann Thomas",
    "title": "DCNR names 9/11 National Memorial Trail as Statewide Major Greenway"
  },
  {
    "id": 10695,
    "mediaId": 2572,
    "date": "2022-03-14",
    "sentence": "(AP Photo/Evgeniy Maloletka)\nThe letter to Biden was signed by Republicans and Democrats, including Reps. Jared Golden, D-Maine, Jason Crow, D-Colo., Don Bacon, R-Neb., <span class='selected-term'>Brian Fitzpatrick</span>, R-Pa., James Baird, R-Ind., John Katko, R-N.Y., Bill Johnson, R-N.C., Conor Lamb, D-Pa., Mariannette Miller-Meeks, R-Iowa, Victoria Spartz, R-Ind., Chris Pappas, D-N.H., Chrissy Houlahan, D-Pa., Michael Waltz, R-Fla., Jim Costa, D-Calif., and Kaiali’i Kahele, D-Hawaii.",
    "author": "Brooke Singman",
    "title": "Russia-Ukraine: Bipartisan lawmakers urge Biden to work with Poland to provide MiG-29s to Ukraine"
  },
  {
    "id": 11549,
    "mediaId": 2644,
    "date": "2022-03-14",
    "sentence": "The group, led by Reps. <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.) and Josh Gottheimer (D-NJ), called for sending Stinger surface-to-air missiles to help Ukraine combat Russian aircraft as well as drones that have been found to be particularly effective against ground troops.",
    "author": "Mark Moore",
    "title": "Bipartisan group of lawmakers urge Biden to send jets to Ukraine"
  },
  {
    "id": 11315,
    "mediaId": 2748,
    "date": "2022-03-17",
    "sentence": "On Wednesday’s broadcast of the Fox News Channel’s “Fox & Friends,” Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-PA) argued that it doesn’t make sense for the Biden administration to argue that Ukraine doesn’t need MiGs from Poland while also arguing that the MiGs would be provocative.",
    "author": "Blarp Blog",
    "title": "GOP Rep. Fitzpatrick: Biden Arguing MiGs Are Both Ineffective and Provocative Doesn’t Make Sense"
  },
  {
    "id": 9751,
    "mediaId": 8322,
    "date": "2022-03-28",
    "sentence": "The House also saw several high-profile GOP lawmakers sign onto the bill, including Reps. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, Bryan Steil of Wisconsin, and Ken Buck of Colorado.",
    "author": "Kelly Laco",
    "title": "Republicans introduce bill requiring DOJ to disclose info on felony pre-trial releases"
  },
  {
    "id": 7691,
    "mediaId": 2528,
    "date": "2022-03-31",
    "sentence": "Here are the 12 House Republicans that approved the measure:\nRep. Don Bacon of Nebraska\nRep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania\nRep. Andy Harris of Maryland\nRep. Jaime Herrera Beutler of Washington\nRep. Richard Hudson of North Carolina\nRep. John Katko of New York\nRep. Nicole Malliotakis of New York\nRep. Daniel Meuser of Pennsylvania\nRep. Mariannette Miller-Meeks of Iowa\nRep. Bill Posey of Florida\nRep. Christopher Smith of New Jersey\nRep. Fred Upton of Michigan\nThe measure would cap the out-of-pocket cost of insulin at $35 per month starting in 2023.",
    "author": "Joseph Zeballos-Roig",
    "title": "Here are the 12 House Republicans that voted for a key piece of Biden's stalled economic agenda on prescription drugs"
  },
  {
    "id": 7360,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "Among the bipartisan signatories are: Reps. Lloyd Doggett, D-Texas; Zoe Lofgren, D-Calif.; <span class='selected-term'>Brian Fitzpatrick</span>, R-Pa.; Andy Harris, R-Md.",
    "author": "Eric Mack",
    "title": "Lawmakers Call on Biden to Cut Red Tape on Ukraine Refugees"
  },
  {
    "id": 7238,
    "mediaId": 2526,
    "date": "2022-04-08",
    "sentence": "Now, Reps. Andy Harris (R-MD) and <span class='selected-term'>Brian Fitzpatrick</span> (R-PA) are joining a swath of House Democrats to ask Biden to extend TPS to potentially tens of thousands more Ukrainians who are arriving at the border.",
    "author": "John Binder",
    "title": "House Republicans, Democrats Beg Biden to Open U.S. Borders to Ukrainians"
  },
  {
    "id": 5855,
    "mediaId": 3986,
    "date": "2022-04-13",
    "sentence": "The new sanctions list also excluded Foreign Affairs Committee Chairman Gregory Meeks (D-NY), House Intelligence Committee Chair Adam Schiff (D-CA), House Judiciary Chair Jerry Nadler (D-NY), Reps. Michael McCaul (R-TX), Christopher Smith (R-NJ), Joe Wilson (R-SC), Adam Kinzinger (R-IL), <span class='selected-term'>Brian Fitzpatrick</span> (R-PA) and Andy Barr (R-KY).",
    "author": "Ryan Morgan",
    "title": "Russia sanctions 398 members of Congress"
  }
]