[
  {
    "id": 12501,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "And No Labels “will host an unprecedented bipartisan response” from Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> and Democratic Rep. Josh Gottheimer, co-chairs of the House Problem Solvers Caucus (which creates more problems than it solves).",
    "author": "Laura Clawson",
    "title": "and the economy in first State of the Union"
  },
  {
    "id": 12633,
    "mediaId": 2528,
    "date": "2022-03-01",
    "sentence": "Gottheimer will be speaking alongside Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> and the director of No Labels.",
    "author": "Bryan Metzger",
    "title": "Josh Gottheimer says it's 'massively unproductive' for Rashida Tlaib to give a State of the Union response even though he's also giving one"
  },
  {
    "id": 13045,
    "mediaId": 2671,
    "date": "2022-03-01",
    "sentence": "Then, on Monday night, the centrist group No Labels announced that “immediately following” the speech, it would host “an unprecedented bipartisan perspective” panel featuring Democratic Rep. Josh Gottheimer of New Jersey and Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, the two co-chairs of the bipartisan Problem Solvers Caucus in Congress.",
    "author": "The Right Scoop",
    "title": "THREE Democrats will be responding to Joe Biden’s SOTU address"
  },
  {
    "id": 13085,
    "mediaId": 2619,
    "date": "2022-03-01",
    "sentence": "In addition, moderate Democratic Rep. Josh Gottheimer of New Jersey had been due to give his “perspective” immediately following the State of the Union, as he participated in an event hosted by the “No Labels,” a nonpartisan group whose stated goal is to “break the gridlock and dysfunction.”\nRepublican Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsyvlania also had been scheduled to take part in the No Labels event.",
    "author": "Victor Reklaitis",
    "title": "‘Biden and his party have sent us back,’ says Republican after State of the Union, as Democrats also respond to speech"
  },
  {
    "id": 12779,
    "mediaId": 2746,
    "date": "2022-03-01",
    "sentence": "Mr. Gottheimer will deliver that “perspective” alongside Rep. <span class='selected-term'>Brian Fitzpatrick</span>, a Pennsylvania Republican, with whom he chairs the Congressional Problem Solvers Caucus.",
    "author": "Haris Alic",
    "title": "Democrats’ divisions spill into view with competing responses to Biden’s State of the Union"
  },
  {
    "id": 12750,
    "mediaId": 2528,
    "date": "2022-03-01",
    "sentence": "Then, on Monday night, the centrist group No Labels announced that \"immediately following\" the speech, it would host \"an unprecedented bipartisan perspective\" panel featuring Democratic Rep. Josh Gottheimer of New Jersey and Republican Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania, the two co-chairs of the bipartisan Problem Solvers Caucus in Congress.",
    "author": "Grace Panetta",
    "title": "3 Democratic members of Congress are giving responses to Biden's State of the Union"
  },
  {
    "id": 15512,
    "mediaId": 8489,
    "date": "2022-03-07",
    "sentence": "Two local representatives – House Republican <span class='selected-term'>Brian Fitzpatrick</span> of Bucks County and Democratic Representative Josh Gottheimer from Bergen County New Jersey introduced the bill to block Russian oil.",
    "author": "Susan Phillips",
    "title": "As gas prices rise, Philadelphia area residents rethink how they work"
  },
  {
    "id": 11549,
    "mediaId": 2644,
    "date": "2022-03-14",
    "sentence": "The group, led by Reps. <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.) and Josh Gottheimer (D-NJ), called for sending Stinger surface-to-air missiles to help Ukraine combat Russian aircraft as well as drones that have been found to be particularly effective against ground troops.",
    "author": "Mark Moore",
    "title": "Bipartisan group of lawmakers urge Biden to send jets to Ukraine"
  },
  {
    "id": 7712,
    "mediaId": 2700,
    "date": "2022-04-05",
    "sentence": "A bipartisan coalition led by Reps. Josh Gottheimer, ?D-N.J., and <span class='selected-term'>Brian Fitzpatrick</span>, R-Penn., is mobilizing to ensure the federal government drives a hard bargain with Iran.",
    "author": "L. Roger Hutson",
    "title": "Guest commentary: Reliable, affordable energy supply and a carbon-free future are all possible for the U.S."
  }
]