[
  {
    "id": 3754,
    "mediaId": 2562,
    "date": "2022-01-24",
    "sentence": "There are 25 House Democrats and two Republicans — Gaetz and Rep. <span class='selected-term'>Brian Fitzpatrick</span>, R-Pa. — signing on to ban stock trading in Congress.",
    "author": "NationalWatch",
    "title": "Rep. Matt Gaetz to Newsmax: Congress Trading Stocks ‘Swampy, Icky’"
  },
  {
    "id": 4151,
    "mediaId": 2641,
    "date": "2022-01-24",
    "sentence": "There are 25 House Democrats and two Republicans — Gaetz and Rep. <span class='selected-term'>Brian Fitzpatrick</span>, R-Pa. — signing on to ban stock trading in Congress.",
    "author": "Eric Mack",
    "title": "Rep. Matt Gaetz to Newsmax: Congress Trading Stocks 'Swampy, Icky'"
  },
  {
    "id": 2,
    "mediaId": 2572,
    "date": "2022-02-22",
    "sentence": "Glenn Youngkin and Attorney General Jason Miyares to Arkansas Senate candidate Sarah Huckabee Sanders and House Problem Solvers Caucus Co-Chair <span class='selected-term'>Brian Fitzpatrick</span>, R-Pa.",
    "author": "Tyler Olson",
    "title": "Pompeo endorses former State Department spokesperson Ortagus in Tennessee House race"
  },
  {
    "id": 10,
    "mediaId": 2658,
    "date": "2022-02-25",
    "sentence": "), Terri Sewell (D-Ala.), Buddy Carter (R-Ga.), <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.), Don Bacon (R-Neb.)",
    "author": "",
    "title": "CDC makes a new map"
  },
  {
    "id": 12537,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "Several members were wearing scarves in either of the two colors on Ukraine’s flag, while others carried miniature flags reportedly being handed out by Rep. <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.), a co-chair of the congressional Ukraine and Ukrainian American Caucus.",
    "author": "",
    "title": "Lawmakers wear blue and yellow to State of the Union in nod to Ukraine"
  },
  {
    "id": 13315,
    "mediaId": 2634,
    "date": "2022-03-01",
    "sentence": "But Gottheimer was scheduled to deliver his own response to the speech on behalf of No Labels, a centrist group, along with Republican Representative <span class='selected-term'>Brian Fitzpatrick</span>.",
    "author": "Grace Segers",
    "title": "Biden Searches for a Big Reset in His State of the Union"
  },
  {
    "id": 12586,
    "mediaId": 2746,
    "date": "2022-03-03",
    "sentence": "“[Putin], you’ve done something nobody else can do.”\nThe list also included House Problem Solvers Caucus leaders Josh Gottheimer, New Jersey Democrat, and <span class='selected-term'>Brian Fitzpatrick</span>, Pennsylvania Republican.",
    "author": "Ramsey Touchberry",
    "title": "Biden faces bipartisan pressure to ban Russian oil and ramp up U.S. production"
  },
  {
    "id": 12914,
    "mediaId": 2745,
    "date": "2022-03-04",
    "sentence": "A companion bill was introduced in the House by Reps. Josh Gottheimer (D-N.J.) and <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.).",
    "author": "",
    "title": "White House, Congress wrestle with U.S. imports of Russian oil"
  },
  {
    "id": 13057,
    "mediaId": 2740,
    "date": "2022-03-04",
    "sentence": "They are now seeking help from Congressman <span class='selected-term'>Brian Fitzpatrick</span> and Pennsylvania Senators Bob Casey and Pat Toomey to ask the Ukrainian government for an expedited visa for their boy “that would increase the chance of our son not only coming home to us but remaining alive,” Maryana said.",
    "author": "Peg Quann",
    "title": "They adopted their son, but then war began. Now the teen waits in Ukraine hoping to get out before call to serve."
  },
  {
    "id": 12672,
    "mediaId": 8322,
    "date": "2022-03-05",
    "sentence": "REP. <span class='selected-term'>BRIAN FITZPATRICK</span> HEADS TO UKRAINE BORDER: 'I WILL GO AS FAR AS THEY WILL ALLOW ME TO GO'\nRep. Liz Cheney, R-Wyo., also spoke out against any restart of a deal, calling it \"exceedingly dangerous and exceedingly misguided\" on the \"The Guy Benson Show\" on Fox News Radio.",
    "author": "Marisa Schultz",
    "title": "Republicans troubled by ongoing talks to revive Iran nuclear deal: 'Russia should not be at any table'"
  },
  {
    "id": 12992,
    "mediaId": 2746,
    "date": "2022-03-06",
    "sentence": "Other lawmakers in the House who support a ban include Reps. Josh Gottheimer, New Jersey Democrat and <span class='selected-term'>Brian Fitzpatrick</span>, Pennsylvania Republican.",
    "author": "",
    "title": "Blinken: U.S. in talks with allies about banning Russian oil imports"
  },
  {
    "id": 15512,
    "mediaId": 8489,
    "date": "2022-03-07",
    "sentence": "Two local representatives – House Republican <span class='selected-term'>Brian Fitzpatrick</span> of Bucks County and Democratic Representative Josh Gottheimer from Bergen County New Jersey introduced the bill to block Russian oil.",
    "author": "Susan Phillips",
    "title": "As gas prices rise, Philadelphia area residents rethink how they work"
  },
  {
    "id": 11387,
    "mediaId": 2626,
    "date": "2022-03-10",
    "sentence": "",
    "author": "Kyle Drennen",
    "title": "GOP Congressman Dismantles MSNBC Attempt to Blame War for Inflation, High Gas Prices"
  },
  {
    "id": 10928,
    "mediaId": 2745,
    "date": "2022-03-10",
    "sentence": "In October, Sen. Brian Schatz (D-Hawaii) and Reps. Earl Blumenauer (D-Ore.) and <span class='selected-term'>Brian Fitzpatrick</span> (R-Pa.) introduced legislation to ban commodities from illegally deforested land from entering the United States.",
    "author": "",
    "title": "Heat pumps can counter Putin and the climate crisis, advocates say"
  },
  {
    "id": 10695,
    "mediaId": 2572,
    "date": "2022-03-14",
    "sentence": "(AP Photo/Evgeniy Maloletka)\nThe letter to Biden was signed by Republicans and Democrats, including Reps. Jared Golden, D-Maine, Jason Crow, D-Colo., Don Bacon, R-Neb., <span class='selected-term'>Brian Fitzpatrick</span>, R-Pa., James Baird, R-Ind., John Katko, R-N.Y., Bill Johnson, R-N.C., Conor Lamb, D-Pa., Mariannette Miller-Meeks, R-Iowa, Victoria Spartz, R-Ind., Chris Pappas, D-N.H., Chrissy Houlahan, D-Pa., Michael Waltz, R-Fla., Jim Costa, D-Calif., and Kaiali’i Kahele, D-Hawaii.",
    "author": "Brooke Singman",
    "title": "Russia-Ukraine: Bipartisan lawmakers urge Biden to work with Poland to provide MiG-29s to Ukraine"
  },
  {
    "id": 15407,
    "mediaId": 8253,
    "date": "2022-03-14",
    "sentence": "On the topic of the Russian invasion, Host Tamala Edwards talks with Congressman <span class='selected-term'>Brian Fitzpatrick</span> (R) and Congressperson Susan Wild (D) about their recent travels to the Poland/Ukraine border with a bipartisan U.S. delegation.",
    "author": "Niki Hawkins",
    "title": "Inside Story 3/13/22 - U.S. Reps Susan Wild and Brian Fitzpatrick on the Ukraine-Russian War"
  },
  {
    "id": 11341,
    "mediaId": 2627,
    "date": "2022-03-18",
    "sentence": "Republicans including Sen. Roger Wicker of Mississippi and Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania have called for a no-fly zone in general, and Sen. Lindsey Graham of South Carolina, a foreign policy hawk if there ever was one, has called for one if Russia uses chemical weapons.",
    "author": "Zeeshan Aleem",
    "title": "Why increasing talk of a no-fly zone over Ukraine is troubling"
  },
  {
    "id": 7820,
    "mediaId": 2594,
    "date": "2022-04-01",
    "sentence": "Rep. Daniel Meuser of Pennsylvania, Rep. Mariannette Miller-Meeks of Iowa, Rep. Bill Posey of Florida, Rep. Christopher Smith of New Jersey, Rep. Fred Upton of Michigan, Rep. Andy Harris of Maryland, Rep. Jaime Herrera Beutler of Washington, Rep. Richard Hudson of North Carolina, Rep. John Katko of New York, Rep. Nicole Malliotakis of New York, Rep. Don Bacon of Nebraska, and Rep. <span class='selected-term'>Brian Fitzpatrick</span> of Pennsylvania were the only Republicans to join the vote in favour.",
    "author": "Johanna Chisholm",
    "title": "Most House Republicans vote against lowering the price of insulin"
  },
  {
    "id": 7712,
    "mediaId": 2700,
    "date": "2022-04-05",
    "sentence": "A bipartisan coalition led by Reps. Josh Gottheimer, ?D-N.J., and <span class='selected-term'>Brian Fitzpatrick</span>, R-Penn., is mobilizing to ensure the federal government drives a hard bargain with Iran.",
    "author": "L. Roger Hutson",
    "title": "Guest commentary: Reliable, affordable energy supply and a carbon-free future are all possible for the U.S."
  },
  {
    "id": 7238,
    "mediaId": 2526,
    "date": "2022-04-08",
    "sentence": "Now, Reps. Andy Harris (R-MD) and <span class='selected-term'>Brian Fitzpatrick</span> (R-PA) are joining a swath of House Democrats to ask Biden to extend TPS to potentially tens of thousands more Ukrainians who are arriving at the border.",
    "author": "John Binder",
    "title": "House Republicans, Democrats Beg Biden to Open U.S. Borders to Ukrainians"
  }
]