{
  "id": 3467,
  "mediaId": 65,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Liberal media outlets 'shaming' companies into taking abortion stance 'isnt reporting,' critics say",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/6a43ce2d-85cb-43e8-be0c-404237fa78a6/6faafed1-3d91-42ab-8eb3-03341c35fad6/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/washington-post-fast-company-cbs-news-pressure-companies-abortion",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2322,
    4125,
    200,
    525
  ],
  "sentences": [
    "In recent years, large corporations have entered the political arena and taken stances on social causes like the Black Lives Matter movement following the 2020 murder of George Floyd and companies like Coca-Cola and Delta denouncing Georgia's election reform that was signed into law in 2021, which promptly led the MLB to pull its All-Star game from Atlanta (whose Braves coincidentally won the World Series months later).",
    "WASHINGTON POST ACCUSED OF ACTIVISM FOR URGING VIDEO GAME COMPANIES TO TAKE A STAND ON ROE V. WADE\nThe report highlighted what's been called the \"Mother's Day strike,\" a week-long protest from May 8-15 that urged participants to \"stop working, shopping and eating out as a way to protest the possibility that Roe v. Wade could be overturned,\" something several video game employees told the Post they were partaking.",
    "Fast Company also published the questions included in the survey, which asked businesses what percentage of their workforce are women, if their healthcare policy covers birth control and abortion care in states where it's illegal (and those who don't cover abortion care are asked to explain why they don't) and whether employees expressed concern about abortion access or the pending SCOTUS decision on abortion.",
    "Additionally, the survey provided a checklist of how businesses planned on responding to the overturning of Roe v. Wade like considering moving its corporate location to a state with better access to abortion, \"lobby the governor/state legislature to advocate for abortion access,\" \"support employees who require abortion access by (providing financial support for abortion, time off to travel, etc.)\"",
    "The survey also included a checklist of whether the businesses have communicated their support for abortion access to all employees, provide comprehensive abortion coverage to employees, \"donate to organizations that support abortion rights and promote abortion access\" or \"make financial contributions to politicians who support abortion.\"",
    "WASHINGTON POST COLUMNIST SAYS OVERTURNING ROE V. WADE IS A 9/11 ATTACK ON AMERICAS SOCIAL FABRIC'\nIn one exchange earlier this month, CBS host Nate Burleson pressed Bank of America CEO Brian Moynihan about whether his company will cover travel expenses for women to get abortions in other states.",
    "\"When a company has not announced a position on a matter of public controversy, such requests for comment can carry an implicit threat of exposing the company to the internet and social media mobs if the company remains silent or doesn't take a progressive stance,\" Jacobson told Fox News.",
    "NPR ABORTION FACT-CHECK CRITICIZED AS WRONG, DECEPTIVE: ITS REALLY JUST SPIN'\nFox News previously reported Fast Company's efforts to get these businesses on the record regarding their abortion stances, which began in March, weeks before the Supreme Court draft opinion was leaked.",
    "\"Not every game developer in support of abortion rights has been able to take the week off work to strike,\" the Post wrote, later adding, \"Right now, game workers just want some semblance of stability with Roe v. Wades potential repeal threatening to rock their foundation.",
    "A report released Monday revealed that Fast Company sent the survey to 191 of the largest corporations in the U.S. to inquire how they \"view abortion access, the policies they have in place around abortion care, and how they plan to respond to the likely fall of Roe v.",
    "(AP Photo/Anna Johnson)\nLast week, The Washington Post published a report on how the video game industry has been \"mostly silent\" on the fight to preserve Roe v. Wade and tried to get some of the biggest names in gaming to plant their flag on the battlefield.",
    "Moynihan told the CBS host Roe v. Wade is \"the settled law of the land\" and that Bank of America believes\" \"people should have that access\" but acknowledged \"there's going to be a lot of discussion about what this case says and means\" going forward.",
    "Cornell Law School professor and media critic William A. Jacobson told Fox News that journalists contacting companies \"can be a perfectly legitimate journalistic method\" but suggested it crosses the line if they put political pressure on them.",
    "\"The Washington Post contacted 20 major video game companies about whether they planned to make a statement regarding Roes potential repeal or provide employees with monetary aid in places where abortions would no longer be available.",
    "The country was engulfed in a political firestorm ever since a Supreme Court majority draft opinion was leaked signaling the overturning of Roe v. Wade, fueling angry protests outside the homes of Supreme Court justices.",
    "Ron DeSantis may have corporations think twice before entering the fray after the House of Mouse objected to an education bill that would bar instruction on sexual orientation and gender identity to young children.",
    "\"At the end of the day, most people care most about airlines getting them safely to their destination without crashing, not whether theyre paying for employees to travel to get abortions,\" Houck told Fox News.",
    "CBS' Gayle King then followed by asking Kirby if he intends to \"speak out publicly about these issues,\" which he responded by \"when we need to, we will\" but cautioned how divisive politics has gotten.",
    "Then on Tuesday, Burleson similarly pressed United Airlines CEO Scott Kirby whether he thinks it's the \"obligation\" for corporations \"to step in when these issues arise for your employees.\"",
    "BUSINESS MAG PRESSURING COMPANIES TO TAKE SURVEY FOR REPORT ON ABORTION STANCE, WILL OUT THOSE WHO DON'T\nThe recent fallout Disney has had from its ugly feud with Republican Florida Gov.",
    "It reports what companies are doing or not doing in the wake of the leaked opinion and sets those reactions in the context of controversies in the industry over the treatment of women.\"",
    "NewsBusters managing editor Curtis Houck predicts \"things will get a lot worse\" as companies are \"hounded by the mob\" and forced to either bend the knee or face financial blowback.",
    "Moynihan first responded by suggesting Bank of America will let the Supreme Court ruling play out before deciding on what to do, but that wasn't enough for co-host Tony Dokoupil.",
    "Concha told Fox News these media organizations are \"trying to shame these companies\" to take a position on abortion only for them to \"alienate\" a huge swath of the country.",
    "\"On this issue before the Supreme Court of access to an abortion as a constitutional right, do you think it is correct that women should have that access or not?\"",
    "There has been a growing wave of liberal news outlets putting Corporate America's feet to the fire when it comes to taking a stance on the heated abortion debate.",
    "In response to accusations of activism, a spokesperson for The Washington Post previously told Fox News, \"The piece itself doesnt take a side on abortion rights.",
    "\"This is why trust in the media is so low because the isms have shifted from journalism to activism,\" Fox News contributor Joe Concha told Fox News Digital.",
    "Like the Washington Post, business magazine Fast Company similarly sought out corporations to take a stand on abortion by urging them to take a \"survey.\"",
    "\"You said a few years ago that the role of a CEO is now driving or includes driving what you think is right,\" Dokoupil told the Bank of America boss.",
    "An email from Fast Company to the companies seen by Fox News showed the magazine vowed to \"disclose\" those who choose not to complete the survey.",
    "But that won't stop the media from pressuring companies to speak out on the big issues of the day, in this case, abortion.",
    "A commitment to reproductive health care from their employers, in their eyes, would at least be something.\"",
    "\"CBS Mornings\" grilled visibly uncomfortable CEOs to place their marker in the abortion fight.",
    "Kirby answered by saying his \"obligation\" is \"to do the right thing\" for his employees.",
    "On Monday, Fast Company published a lengthy list of those who opted out of the survey.",
    "Only Microsoft and Activision Blizzard responded with statements,\" the paper wrote.",
    "Story tips can be sent to joseph.wulfsohn@fox.com and on Twitter: @JosephWulfsohn.",
    "Fast Company previously did not respond to Fox News' request for comment.",
    "and \"expand insurance coverage to include access to abortion pill.\"",
    "Joseph A. Wulfsohn is a media reporter for Fox News Digital.",
    "\"This isnt reporting the news, its an attempt to shape it.",
    "The pressure on these companies didn't just come in print.",
    "Only 15 of them actually took the survey.",
    "And its shameful,\" Concha added.",
    "Wade.\""
  ]
}