{
  "id": 3470,
  "mediaId": 1546,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Looming Midterm Elections Put US Voting Rights in Spotlight",
  "image": "https://gdb.voanews.com/834386C9-04C9-4F23-B640-8A1C8B9F2F44_cx1_cy11_cw98_w1023_r1_s.jpg",
  "link": "https://www.voanews.com/a/looming-midterm-elections-put-us-voting-rights-in-spotlight-/6579663.html",
  "sentiment": "0.0",
  "mediaOutlet": "VOA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Simkins",
  "authorUrl": "https://www.voanews.com/author/chris-simkins/ygqqm",
  "termIds": [
    661,
    879,
    1147,
    2087,
    146,
    2945
  ],
  "sentences": [
    "The bill passed the Democratic-controlled House of Representatives but was ultimately shelved in the politically divided Senate\nThe John Lewis Voting Rights Advancement Act, named for the late Georgia Democratic representative and civil rights leader, would restore Justice Department review of changes in election laws in states with a history of discrimination.",
    "Lets be clear, this law in Florida undoes the progress that voting rights groups have made and targets the very tools minority communities like ours use to increase voter turnout,? Jasmine Burney-Clark, founder of the Florida-based voting rights group Equal Ground, said in a statement.",
    "Establishing methods to increase voting participation is one of the major ways in which we see change come about in Black communities.?\nFlorida example\nA U.S. federal appeals court recently cleared the way for a restrictive voting law in Florida to go into effect.",
    "Not only are key minority constituencies that tend to vote Democratic registering frustration and low levels of voter enthusiasm in current polls, those who do intend to vote in November may find it more difficult to do so in many states.",
    "The new measure is the second major overhaul of Floridas election laws since the November 2020 election in which Democrat Joe Biden defeated then-President Donald Trump, and Democrats narrowly won control of both houses of Congress.",
    "The new measures included tighter rules on mailed ballots, paring back the number of ballot dropoff boxes, limiting voter registration drives and barring people from giving food or other assistance to those waiting in line to vote.",
    "Earlier this year, Senate Republican Leader Mitch McConnell, who played a critical role in blocking the voting legislation, took issue with any suggestion that state legislatures were seeking to disenfranchise Black voters.",
    "I think our democracy is under threat by these new laws,? former U.S. Attorney General Eric Holder, a Democrat, said at a Washington, D.C., event to unveil his new book that chronicles the countrys fight for voting rights.",
    "Immediately after the Supreme Court decision, you saw states around the country putting in place voter suppression measures that would have been prohibited had part of the (Voting Rights) Act stayed intact,? said Holder.",
    "In broad terms, Democrats favor making it easier and more convenient to vote, while Republican lawmakers in some states have passed laws to restrict voting access and heighten scrutiny of those who cast ballots.",
    "But while Walker found that the right to vote is under siege? in Florida, the appeals court argued for a presumption of legislative good faith? among Floridas elected state representatives who crafted the bill.",
    "Despite an increasingly challenging legal landscape, voting rights groups say they will work even harder to get Americans to turn out to vote  and to overcome any obstacles they may face to cast a ballot.",
    "An Associated Press investigation found fewer than 475 potential cases of voter fraud out of 25.5 million ballots cast in the six states where Trump and his allies disputed his loss to Biden.",
    "The provisions the high court nixed required states with a history of voting discrimination to get pre-approval from the Justice Department before changes are made to state election laws.",
    "I think many African Americans are concerned about more voting restrictions,? said Jatia Wrighten, a political science professor at Virginia Commonwealth University in Richmond, Virginia.",
    "I dont think there is any other place in the country where you should have more confidence that your vote counts than in the state of Florida,? he said during a recent news conference.",
    "U.S. District Court Judge Mark Walker, who blocked the voting law last March, said Florida state legislators had deliberately written provisions to suppress turnout by Black voters.",
    "Florida and other Republican-led states have acted amid persistent false claims by Trump and his supporters that his election defeat was the result of widespread election fraud.",
    "However, the department has limited powers following a 2013 U.S. Supreme Court decision (Shelby County v. Holder) that dismantled part of the 1965 Voting Rights Act.",
    "With barely six months until the 2022 midterms, fierce debate has emerged over voting rights and voting integrity, topics that have long stirred passions in America.",
    "The decision had a negative impact on our democracy.?\nEfforts to win congressional approval for nationwide voting rights protections stalled in Congress last year.",
    "Democrats and voting rights advocates counter that the new laws will disproportionately impact the ability of African Americans and other minority groups to vote.",
    "This year, at least 27 Republican-led states have introduced or enacted a total of 250 pieces of voting legislation, according to the Brennan Center for Justice.",
    "The court said earlier this month that a lower court order blocking parts of the law had been issued too close to the states primary elections in August.",
    "Washington \nMillions of U.S. voters are casting ballots in state primary races to determine which candidates face off in Novembers midterm elections.",
    "The stakes are high for Democrats and Republicans, as the outcome will determine which political party controls both houses of Congress next year.",
    "The case centered around an Alabama county that sued Holder to stop the Justice Department from enforcing key sections of the Voting Rights Act.",
    "The concern is misplaced because if you look at the statistics, Black people vote at similar rates to all American voters,? McConnell said.",
    "He recently pushed the states Republican-controlled legislature to adopt a new law creating an Office of Election Crimes and Security.",
    "Its staff of 15 people would conduct preliminary investigations of suspected election fraud and investigate voting-related complaints.",
    "Another measure called The Freedom to Vote Act set nationwide standards for how elections are conducted and expands voting access.",
    "The contest will be a test of new voting laws in many states that restrict access to the ballot in the name of election security.",
    "Voting protections\nVoting rights advocates have called on the Justice Department to ensure free and fair elections nationwide.",
    "The initiatives range from limiting early or absentee balloting to implementing stricter voter identification requirements.",
    "Republican lawmakers oppose attempts to federalize voting in America with uniform rules set in Washington.",
    "Not so, according to Florida Governor Ron DeSantis, a potential 2024 Republican presidential candidate.",
    "We just want to make sure whatever laws are on the books that those laws are enforced,? DeSantis said.",
    "Extensive research has found that voter fraud in the U.S. is exceedingly rare and generally detected.",
    "The flurry of activity comes after 19 state legislatures in 2021 approved 34 restrictive voting laws.",
    "Republicans maintain the measures are designed to prevent voter fraud and ensure election integrity.",
    "Now, there are efforts to make it harder to vote, not easier,? Holder told VOA earlier this month.",
    "Historically, it has been left up to individual states to determine how to conduct elections.",
    "Those claims were rejected by multiple courts and state election authorities.",
    "Many citizens have only had unfettered access to the ballot since the 1960s.",
    "The laws add to Democrats apprehensions ahead of the midterms.",
    "DeSantis has made voting legislation a key priority.",
    "Reaction outside the courts has been swift."
  ]
}