{
  "id": 3473,
  "mediaId": 302,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Clerk sues Pinellas County for spending on election lawsuit",
  "image": "https://www.tampabay.com/resizer//T-39im9zZBzyMmLvgvD8tgxX9jY=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/GMJIWEJOONASDLI6U7R5LXTP4Q.jpg",
  "link": "https://www.tampabay.com/news/pinellas/2022/05/18/clerk-sues-pinellas-county-for-spending-on-election-lawsuit/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3888,
    3968,
    4326,
    4476,
    4488,
    4556,
    3472,
    2661,
    5098
  ],
  "sentences": [
    "When Commissioner Pat Gerard asked him to clarify what was said, Burton responded to her with his interpretation: If you open it up, Im going to increase the costs.?\nIn a statement to the Times, the Cross Bay Ferry stated the financial data HMS Ferries previously gave the county was a dated pro forma summer 2021 projection? and not an actual profit and loss statement for the past six months.",
    "Local governments have been subsidizing the ferry since its pilot season in 2017, which Pinellas County Administrator Barry Burton said was intended just to get them up and running.?\nIn June 2021, Hillsborough County and HMS Ferries Inc. entered into a four-year operating agreement that would gradually expand the service from an October-May season to a 12-month operation by 2024.",
    "Ed Turanchik, an attorney for HMS Ferries, told commissioners that when Pinellas withdraws from the interlocal agreement among the four governments, the terms of the operating agreement between Hillsborough County and HMS Ferries will automatically expire.?\nHe said absent the governments figuring out how to do this,? the ferry service will not be able to begin in October.",
    "Commissioner Kathleen Peters said the ferry is not transportation, this is entertainment.?\nThis is not transit, this is not taking people to work or back, this is not taking people or cars off the road during the heaviest time of traffic because this is weekends and evenings,? Peters said.",
    "During a discussion on the topic at a work session last week, Deputy County Administrator Jill Silverboard presented data showing that HMS Ferry earned a $334,425 profit in 2021-22 while receiving $700,000 in subsidies from the four governments and charging $9.16 for an average ticket.",
    "This is a whole different conversation and animal than it is transit.?\nBurton stressed the need for the company to explore advertising and sponsorship opportunities that could offset government subsidies, which is one of the terms he wants to discuss during the negotiations.",
    "In a statement to the Times, Commission Chairperson Charlie Justice said officials feel that we are pursuing the proper course of action based on a thorough legal analysis.?\nPersonally I am disappointed that (Burke) would pursue this litigious path,? Justice said.",
    "As the countys accountant, Burke questioned whether it would be legal for him to release public funds for the lawsuit expenses because its not clear how Pinellas County, as opposed to the affected commissioners, needs a court determination on the new state law.",
    "Are there other ways of funding this, advertising and other things like that, to make the subsidy on the taxpayers less or zero??\nBurton said he will be arranging for elected officials from the four local governments to meet and talk about new terms.",
    "In Burkes lawsuit, filed in Pinellas County Circuit Court on Monday, he argues it is established common law that public agencies must presume legislation affecting their duties to be valid? and dont have standing to challenge a statute.",
    "On Tuesday, Burke requested the ability to intervene in the Leon County case so that he can file a motion asking the judge to halt the litigation until the Pinellas County court decides on the legality of the countys expenditures.",
    "Pinellas County sued then-Florida Secretary of State Laurel Lee and Attorney General Ashley Moody in Leon County Circuit Court three days later, asking the judge to prevent the state officials from enforcing the laws provision.",
    "The Pinellas County Commission on Tuesday voted unanimously to terminate its agreement supporting the Cross Bay Ferry in order to negotiate better terms and potentially lower the amount taxpayers contribute to the service.",
    "In its complaint, the county argued that the provision targeting Pinellas County, as opposed to the state as a whole, amounts to a local bill, which the Florida Constitution prevents the Legislature from passing.",
    "Commissioner Rene Flowers highlighted the need for elected officials from Tampa, St. Petersburg and Pinellas and Hillsborough counties to come together so that they can negotiate together for the first time.",
    "Read inspiring stories about ordinary lives\nCandidates must file qualifying paperwork between June 13 and June 17 in order to get on the November ballot, so Pinellas County asked for an expedited response.",
    "On April 26, the Board of County Commissioners voted 4-2 to sue the state over the provision they say illegally targets Pinellas to accommodate the political ambitions of Latvala, a Clearwater Republican.",
    "Pinellas has so far spent $571.50 to file the April 29 lawsuit and $15.96 to obtain records from other counties for research, according to invoices provided to the Tampa Bay Times by Pinellas County.",
    "Before the vote Thursday, HMS Ferry President Matthew Miller disputed the data and said the company will absorb a significant operating loss? this year due to higher fuel, labor and insurance costs.",
    "Pinellas County Clerk of Court Ken Burke has sued the county, questioning whether it can use public dollars to pay for its recent lawsuit challenging a portion of Floridas new election law.",
    "The disputed provision uniquely affects the Board of County Commissioners, giving state Rep. Chris Latvala a quicker path to the commission seat he is seeking as he departs the Legislature.",
    "The law includes a provision requiring county commissioners in single-member districts to run again for their seats following a redistricting process, which Pinellas completed in December.",
    "Residents elected commissioners to four-year terms in 2020, so their votes will not be given full force and effect? if those officials have to run again in 2022, according to the lawsuit.",
    "While commissioners highlighted the importance of the ferry to the region, they questioned the lack of opportunity they had last year to provide input to the original four-year agreement.",
    "With the first season of the four-year agreement completed, Burton said the county had to state its intent to terminate by June 1 and enter into new terms by Aug. 1, per the contract.",
    "Read inspiring stories about ordinary lives\nIf the county wants to open up the agreement, so be it, that will help us recoup our losses,? Miller told the commission by phone.",
    "If the provision remains, five of the seven commissioners will be up for election in 2022 and six of the seven will have to run in 2032 after the next redistricting process.",
    "As a result, District 5 Commissioner Karen Seel and District 7 Commissioner Rene Flowers must run again for their seats in November, two years into their four years terms.",
    "Burton said he was given no opportunity to weigh in on the operating agreement ahead of time and found out it had been reached by reading about it in the Tampa Bay Times.",
    "The data showed the ferry is projected to earn a $495,495 profit in the 2024-25 season while charging $15.16 a ticket and receiving $1.02 million in government subsidies.",
    "Earlier this year, Cross Bay Ferry received $4.9 million from the federal government for a new boat that will link southern Hillsborough County to MacDill Air Force Base.",
    "Under the agreement, the municipalities agreed to each provide a subsidy of $175,000 in the first year, increasing incrementally to $255,000 in the fourth.",
    "Single-member district commissioners Eggers in District 4 and Peters in District 6 were already up for reelection in November before the laws passage.",
    "He is asking a judge to determine whether he should pay the litigation costs, and if not, then prevent the county from making further expenditures.",
    "This does not say that we dont want it, this says that we want to be fiscally responsible for our role as it relates to the ferry,? Flowers said.",
    "Last year, Latvala filed to run for District 5 in 2024, when Seel, a fellow Republican, had planned to step down at the end of her sixth term.",
    "The Pinellas County Charter also mandates staggered terms for commissioners, which will be disrupted by the provision, the lawsuit states.",
    "He said it was too late to negotiate changes when the interlocal agreement came before the four local government partners in September.",
    "We want to see the Cross Bay Ferry continue but we want to make sure its done right by our taxpayers,? Burton said in an interview.",
    "The ferry hosted 62,130 riders this season, which is 10,000 more than its previous record, according to a May 4 news release.",
    "Turanchik said that grant depends on having an existing operating system.?\nSo theres a lot of risk here,? Turanchik said.",
    "The law now allows him to run for District 5 in November, when he will be term-limited out of the Florida House.",
    "Ron DeSantis signed a bill that created an office within the executive branch to investigate election crime.",
    "The language included multiple exceptions so that Pinellas County is the only Florida government affected.",
    "The company will be providing updated financial information to Hillsborough County, its operating partner.",
    "He just presented to the Commission on our outstanding audit and mentioned no objections.?\nIn April, Gov.",
    "Commissioner Pat Gerard, who represents the at-large District 2, was also already up for reelection.",
    "Pinellas signed on to the interlocal agreement with Hillsborough County, Tampa and St. Petersburg.",
    "Hm, so now theyre going to threaten us,? Burton could be heard whispering on the dais in response.",
    "He took issue with the county attempting profit projections without consulting with the company.",
    "He underscored the benefits the service has provided to small businesses and the local economy.",
    "A hearing on Pinellas Countys request for an injunction is scheduled for Monday in Tallahassee.",
    "According to the countys presentation, 85 percent of riders use the service on the weekends.",
    "County attorney Jewel White disagreed with that interpretation of the contract.",
    "Commissioners Dave Eggers and Kathleen Peters voted no and Seel abstained.",
    "Burton said the county received the data directly from HMS Ferry.",
    "Turanchik noted another problem."
  ]
}