{
  "id": 3572,
  "mediaId": 157,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Florida judge orders election officials to use court-ordered fix to Ron DeSantis' racial gerrymander",
  "image": "https://www.rawstory.com/media-library/florida-s-ron-desantis-claims-vaccine-shipments-are-on-hold-but-pfizer-says-he-s-wrong.jpg?id=26436575&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/florida-gerrymander/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    661,
    4701,
    4748,
    2661,
    2926,
    4991
  ],
  "sentences": [
    "DeSantis stonewalled the legislature for weeks, demanding they adopt a map that split up the Tallahassee-to-Jacksonville Black opportunity district that had been in place in the state for decades, claiming instead that a different split that creates three Republican seats would be more racially neutral.",
    "\"Circuit Judge J. Layne Smith ordered the new map last Wednesday, saying that he found 'the enacted map is unconstitutional because it diminishes African Americans ability to elect candidates of their choice,'\" said the report.",
    "On Monday, according to The Tributary, a Florida judge in Tallahassee ordered state election officials to move forward with a court-picked remedial congressional map to fix a racial gerrymander recently signed into law by Gov.",
    "\"This only affects the North Florida congressional districts, re-instating a Duval-to-Gadsden 5th Congressional District to protect Black voters ability to elect their preferred candidates,\" reported Andrew Pantazi.",
    "The legislature initially resisted these calls but eventually caved and passed a map that eliminated the district, triggering outrage among voting rights and civil rights experts.",
    "\"The new map, drawn by a Harvard professor, mostly follows an earlier version preferred by the Legislature.\"",
    "The map was initially ruled unconstitutional by Judge Layne Smith, herself an appointee of DeSantis.",
    "The litigation is ongoing and can still go to the 1st Appellate Court, or the state Supreme Court.",
    "The DeSantis administration has signaled it intends to appeal.",
    "Ron DeSantis."
  ]
}