{
  "id": 3583,
  "mediaId": 302,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Here is a fair compromise on abortion | Letters",
  "image": "https://www.tampabay.com/resizer//4YMWbQ5s4F1-IRUon9zDeZSUWv0=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/TMXPWVZM5SZOLCACZCUVNNL2WE.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/15/here-is-a-fair-compromise-on-abortion-letters/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Maybe next he can teach our children about the dangers of pandemics and the 70,000 who died in the state because of the incompetence of publicly elected officials.",
    "So, heres the compromise: Women suffering (and suffering is the correct term) from unwanted pregnancies have 16 weeks (four months) to abort safely and legally.",
    "Yet racism has had a far more persistent and profoundly damaging effect on our nation than communism, and our schools are forbidden to teach all of those facts.",
    "With todays technology, no one can say, after four missed periods, nausea, etc., that they didnt think to take a pregnancy test.",
    "Let me preface that suggestion with a few facts: Republicans, you will never end abortion; you can only end legal abortion.",
    "A compromise on abortion\nI am an educated, retired teacher and educational leader who is politically Independent.",
    "But its not going to stop happening, and we need to meet in the middle to respect everyones needs and rights.",
    "So our governor is touting a new law requiring schools to offer lessons on victims of communism.",
    "Of course, conservatives object to late-term abortions and partial-birth abortions.",
    "Not a fence-sitter, as many on both sides would call me, but a true Independent.",
    "But heaven forbid a teacher should even so much as mention victims of racism.",
    "Ron DeSantis wants children to learn about the dangers of communism.",
    "Even rape and incest should be able to be addressed in four months.",
    "You may not even substantially reduce the number of abortions.",
    "I see positives (and negatives) on both sides of the table.",
    "The exception, of course, is a risk to the mothers health.",
    "To that end, I would like to suggest a compromise.",
    "Democrats, you need to come closer to the middle.",
    "Elenora Sabin, St. Petersburg\nAnd the pandemic?",
    "Women must take that much responsibility.",
    "This way, everyone wins/loses equally.",
    "Unwanted pregnancy is a true tragedy.",
    "Lynn Rourke, Dunedin\nCommunism?",
    "There are no great solutions.",
    "Michael Zaccardi, Palm Harbor",
    "They are inhumane.",
    "How about racism?",
    "How admirable!",
    "Most of us do.",
    "Im glad Gov."
  ]
}