{
  "id": 3586,
  "mediaId": 238,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Key issues",
  "image": "https://img.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5HKQ5IMGGNH4VBWHM46OPXNWTQ.png&w=1800",
  "link": "https://www.washingtonpost.com/politics/interactive/2022/key-issues-voting-2022-midterms/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1174,
    2058,
    2087,
    2305,
    146,
    149,
    482,
    571,
    2934
  ],
  "sentences": [
    "Abortion\nAbortion was catapulted to the forefront in May after Politico published an authentic draft of an opinion written by Justice Samuel A. Alito Jr., showing that the Supreme Court was positioned to strike down Roe v. Wade in the case involving Mississippis restrictive abortion law.",
    "The Biden administration has yet to bring this under control, and there is now a split within the party over the administrations proposal to lift Title 42, a public health regulation instituted during the Trump administration that prevents asylum seekers from crossing the border.",
    "The risk for Republicans is that their focus on divisive culture issues could backfire in swing states and districts with more moderate voters, such as in Pennsylvania, where some traditionally Republican voters have changed their identification in recent years to independent.",
    "The Democratic Congressional Campaign Committee believes continued attacks by the GOP on womens rights will help them in 25 competitive races taking place in largely suburban districts that also have a significant minority and college-educated population.",
    "But since last year, Republican strategists had been weighing the negative effects overturning Roe could have on them electorally, possibly depressing recent GOP gains with suburban women, who in turn could influence their husbands not to vote Republican.",
    "So far, despite the media attention it receives and the public revulsion over Russias invasion and atrocities, Ukraine has not become a dominant U.S. political issue, in part because of support for Ukraine and advocacy of U.S. assistance in both parties.",
    "Sen. Rick Scott (Fla.), chair of the National Republican Senatorial Committee, argued that the issue will not tank the GOPs advantage because most voters are not where Democrats are? on abortion and continue to feel the daily burden of inflation.",
    "[The Supreme Courts draft opinion on overturning Roe v. Wade, annotated]\nToppling Roe could boost Democrats by mobilizing abortion rights supporters and potentially narrowing the enthusiasm gap that exists between Republicans and Democrats.",
    "Now its absolutely incumbent that you elect senators that share your values, who are going to protect a womans right to reproductive freedom,? said Sen. Gary Peters (Mich.), chair of the Democratic Senatorial Campaign Committee.",
    "Republican strategists are wary about injecting CRT as an issue into every race, instead encouraging candidates to determine the niche education issue in their districts or states and framing them around parental rights.",
    "Democrats and Republicans agree that inflation has been the preeminent political issue this spring  at least until the leak of a draft ruling that suggested the Supreme Court might overturn Roe v. Wade.",
    "Democrats recognize they are on the defensive on many of these issues but argue there are contrasts they can draw with Republicans that will force voters to think anew about their choices this fall.",
    "But there have always been more voters motivated by opposition to abortion rights than those who support those rights, and the issue ahead is how much that could change if the court overturns Roe.",
    "Some Democratic strategists pointed to 2018, when Democrats raised fears that Republicans would eliminate coverage for preconditions in health insurance as a way to motivate their voters.",
    "Now the politics of education have changed, as Republicans have seized on the issue of critical race theory as a shorthand to attack Democrats on a range of education-related grievances.",
    "The issue overshadows what is otherwise an economic story that the Biden administration would like to talk about, especially the number of jobs created and low unemployment rate.",
    "The midterm elections determine control of Congress: The party that has the House or Senate majority gets to organize the chamber and decide what legislation Congress considers.",
    "Several Democratic senators in competitive races have spoken out against the change, fearing such action would spur additional border crossings and threaten them politically.",
    "Nor has the praise Biden has won from the foreign policy establishment or European allies translated into positive marks for his overall handling of national security issues.",
    "Inflation and the economy\nInflation is a constant presence in the minds of voters when buying groceries, filling their gas tanks or paying their home heating bills.",
    "Echoes of the defund the police? rhetoric in the months after the 2020 killing of George Floyd by a White police officer in Minneapolis continue to haunt Democrats.",
    "New York City Mayor Eric Adams (D) ran on reducing the crime rate, but his early months have seen the issue remain at the forefront in Americas most populous city.",
    "Here are the most interesting Democratic primaries and Republican primaries to watch as Republicans and Democrats try to nominate their most electable candidates.",
    "Scotts ideas have been denounced by Senate Minority Leader Mitch McConnell (R-Ky.) and other Republicans, but that isnt stopping Democrats from going after them.",
    "Novembers midterm elections are likely to shift the political landscape and impact what President Biden can accomplish during the remainder of his first term.",
    "Still, the overhang from covid continues to affect the political environment, contributing to what one strategist referred to as an ornery? electorate.",
    "Ron DeSantis (R) signed legislation restricting the teaching of gender identity and related issues to students in kindergarten through the third grade.",
    "Democrats say critical race theory isnt actually taught in public schools, but the label of CRT has become a proxy for a variety of education issues.",
    "Democrats also see possible ways to soften concerns about rising prices by talking about their efforts to lower the cost of, say, prescription drugs.",
    "There is no escaping from it, and unless there is a significant easing in the next few months, it will continue as one of the top issues of concern.",
    "The most recent Washington Post-ABC News poll finds nearly 7 in 10 Americans disapprove of the way President Biden has handled the inflation issue.",
    "These include how race and racism are taught in the schools, a charged debate at a time when racism has become more visible in the country.",
    "They also include the role of parents in schools, the power of teachers unions and lingering anger over school shutdowns and mask mandates.",
    "Crime is one such issue, at a time when many major cities are suffering from rising homicide rates and increases in other types of crime.",
    "Democrats find themselves in the unusual position of being thrown on the defensive on a topic where they long have had the high ground.",
    "A recent NBC News survey showed a 21-point drop in the percentage of people who call it a top issue between January and March.",
    "They are trying hard to focus voters on an agenda pushed by Scott that calls for middle-class Americans to pay more taxes.",
    "Redistricting is the process of drawing congressional and state legislative maps to ensure everyones vote counts equally.",
    "Fifty percent say they trust Republicans to handle the issue, compared with 31 percent who say they trust Democrats more.",
    "Some of Bidens best ratings now come on the coronavirus pandemic, according to the latest Washington Post-ABC poll.",
    "Dozens of House members have already announced they will be retiring from Congress instead of seeking reelection.",
    "Education and identity\nFor years, Democrats were the party favored by voters to deal with issues of education.",
    "But voters will also be hearing about crime, education, immigration and jobs before they cast their ballots.",
    "The answer is to fund the police.? The fact that he had to say it underscores the Democrats vulnerability.",
    "Republicans see the issues as helping to attract suburban parents unhappy with various school policies.",
    "As of April 25, 46 of the 50 states had settled on the boundaries for 395 of 435 U.S. House districts.",
    "In Texas, there have been efforts to restrict gender-affirming care by parents of trans adolescents.",
    "The border\nRelated to that is the surge of undocumented immigrants along the U.S.-Mexico border.",
    "Every seat in the House and a third of the seats in the 100-member Senate are up for election.",
    "Multiple states have sought to ban transgender students from participating in school sports.",
    "The answer is not to defund the police,? he said in his State of the Union address.",
    "Another set of issues that have risen on the GOP agenda encompass LGBTQ rights.",
    "Thirty six governors and thousands of state legislators are also on the ballot.",
    "Up next: Five primaries on May 17, including North Carolina and Pennsylvania.",
    "The general election is Nov. 8, but the primary season is already underway.",
    "But no one is ready to predict where this issue will be by next fall.",
    "The abortion issue now threatens to upend election calculations.",
    "Crime\nRepublicans see other issues to exploit beyond inflation.",
    "The Nebraska and West Virginia primaries took place on May 10.",
    "Heres a complete calendar of all the primaries in 2022.",
    "But covid has declined as an issue mentioned by voters.",
    "Other issues\nThe war in Ukraine is a wild-card issue.",
    "Biden has repeatedly taken the opposite view.",
    "Which primaries are the most competitive?",
    "Which seats are up for election?",
    "When are the midterm elections?",
    "Why are the midterms important?",
    "It could be a hard sell.",
    "What is redistricting?",
    "Heres what to know.",
    "Florida Gov.",
    "Show More"
  ]
}