{
  "id": 3590,
  "mediaId": 98,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Column: Ron DeSantis is setting the agenda for the GOP, and Democrats should worry",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/cf1c5a2/2147483647/strip/true/crop/3000x2000+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F16%2F2b%2Ff39ea57a4a32bbc41472105ce201%2Fap22087694374789.jpg",
  "link": "https://www.latimes.com/politics/story/2022-05-15/ron-desantis-setting-agenda-for-gop-democrats-should-worry",
  "sentiment": "0.0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Doyle McManusWashington Columnist",
  "authorUrl": "https://www.latimes.com/people/doyle-mcmanus",
  "termIds": [
    661,
    718,
    1147,
    1765,
    4177,
    146,
    428,
    524,
    2590,
    2661
  ],
  "sentences": [
    "The laws official name is the Parental Rights in Education Act,? not Dont Say Gay.?\nRepublican strategists believe DeSantis description appeals to parents of young children, including suburban parents who voted against Trump in the 2020 presidential election.",
    "Republican pollster Whit Ayres offered a more succinct explanation: Hes Trump without the craziness.?\nDeSantis broke into national prominence early in the COVID-19 pandemic, when he became the nations most powerful opponent of lockdowns and vaccine mandates.",
    "And, most recently, he signed a bill banning discussions of sexual orientation and gender identity in the first four years of elementary school, and potentially limiting the subjects in higher grades  the act that opponents dubbed the Dont Say Gay? law.",
    "That could cost him some support.?\nIt may be worth noting, though, that DeSantis has confined his attacks on business largely to firms not headquartered in Florida  and that Disney World, one of the states largest employers, is unlikely to move.",
    "I dont know if its by luck or by smarts, but that guy has a gift for framing issues and finding the right enemies,? said Republican strategist Scott Jennings, a longtime advisor to Senate Minority Leader Mitch McConnell (R-Ky.).",
    "Originally a tea party-style fiscal conservative, hes embraced a series of hard-edged positions that have boosted him into second place in early  OK, way-too-early  polls for the 2024 GOP presidential nomination.",
    "He passed another law limiting what schools can teach about racism and other painful aspects of American history, and launched a state review that banned several math textbooks for purported political content.",
    "Hes taken on the left more aggressively than any U.S. governor in modern history,? Fox News pundit Laura Ingraham enthused last month when she devoted an entire hour of her prime-time program to DeSantis.",
    "A Fox News poll this month reported that 55% of voters said they agreed with a ban on teaching about sexual orientation in the early grades, with even larger majorities among parents and Latino voters.",
    "Some states, like California, kept schools closed for a full year or more; DeSantis ordered Floridas schools to reopen in August 2020 and threatened to withhold money from districts that rebelled.",
    "He pushed through a bill to strip Disney World, the companys giant amusement park near Orlando, of its special tax status, which had given Disney broad authority over its holdings.",
    "Since 2020, the former president has seemed stuck in an endless loop of grievances about the presidential election, which he claims (without evidence) was stolen from him.",
    "WASHINGTON \nThe most intriguing politician in the Republican Party is an uncharismatic governor whos trying to make the GOPs culture war appealing to suburban mothers.",
    "He has denounced not only Disney executives but social media companies as part of a cultural elite whose values are far different from those of his voters.",
    "When the CEO of the Walt Disney Co., under pressure from employees, declared that the company would fight to repeal the bill, DeSantis retaliated.",
    "The results werent as clear as he sometimes claimed; Floridas economy has grown more slowly than Californias over the last two years.",
    "One is framing: In the governors telling, his restrictions on teaching are about parents rights, not animus toward LGBTQ rights.",
    "Hes gone too far in attacking Disney, especially on the tax district,? a GOP lobbyist told me, refusing to be quoted by name.",
    "The governor took the scientific debate over vaccine mandates and turned it into a high-visibility political cause.",
    "He ordered state agencies to audit businesses to determine whether their workers were in the country legally.",
    "DeSantis third quality has been his relentless search for new causes to champion in an expanding culture war.",
    "Whether he intends to run or not, hes already built the foundation hed need to seek the GOP nomination.",
    "Hes canny, hardworking, relentless and often ruthless  a populist without Trumps self-defeating flaws.",
    "Having that sort of feel for timing and when to jump on issues is hard to teach,? Jennings said.",
    "Floridas death rate from COVID rose more steeply than those of states with tougher regulations.",
    "DeSantis clearly gets it.?\nThat, more than any other factor, has distinguished him from Trump.",
    "DeSantis has moved beyond 2020 to define Republicans agenda for 2022  and probably 2024.",
    "A second strength is DeSantis readiness to attack business leaders when they oppose him.",
    "But many parents were grateful that they could send their children to school.",
    "Many businesses were grateful too; DeSantis allowed them to remain open.",
    "Ron DeSantis, the 43-year-old governor of Florida, has been on a tear.",
    "(First place is still occupied by former President Donald Trump.)",
    "He has never directly confronted Trump, but he hasnt needed to.",
    "The episode reflected three of DeSantis political strengths.",
    "Florida chose freedom over Fauci-ism,? he declared.",
    "Thats made some traditional Republicans nervous.",
    "But DeSantis moved on to other targets.",
    "It was something of a gamble.",
    "Democrats should be worried.",
    "Hes outflanked him."
  ]
}