{
  "id": 3604,
  "mediaId": 147,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Former presidential adviser David Gergen discusses leadership and the next generation",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/assets/images/placeholder.jpg",
  "link": "https://www.pbs.org/newshour/show/former-presidential-adviser-david-gergen-discusses-leadership-and-the-next-generation",
  "sentiment": "0.0",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "PBS NewsHour",
  "authorUrl": "https://www.pbs.org/newshour/author/newshourvideo",
  "termIds": [
    661,
    1147,
    1303,
    1813,
    1970,
    2087,
    4058,
    2945
  ],
  "sentences": [
    "And, frankly, as there are many good people who are Baby Boomers, there are very fine public servants, but, as a whole, the generation has been a disappointment, by contrast to the World War II generation, which left behind an America that was the strongest since the days of ancient Rome, culturally, militarily, economically.",
    "Judy Woodruff:\nAnd what would that mean for the two men who are the most powerful in our country right now, President Biden\nDavid Gergen:\nWell, I do think that, as much as we don't like to talk about age, age is an issue if those are the two nominees, because we would have Biden and Trump.",
    "Read the Full Transcript\nJudy Woodruff:\nDavid Gergen is known to many viewers of this program as a longtime Friday night commentator on the \"NewsHour,\" but he's perhaps best known for his role serving as a senior adviser to four American presidents, Nixon, Ford, Reagan and Clinton.",
    "But both she and Senator McConnell, who is also 80 years old, I think it's important that people not be clinging to power, but yet trying to nourish and improve and help the younger generations.",
    "You could be looking  there are any number of scenarios, but you could be looking at a match, say, between the Florida governor, Ron DeSantis, and, say, Elizabeth Warren of Massachusetts.",
    "And that winner would be becoming president with what is the hardest job in the world with health that is just unreliable and a vulnerability that is out there and potential weaknesses.",
    "I think we ought to see it as something that's appropriate in a democracy, when this is one of the best  the office of the presidency is the most complex, but yet the most powerful.",
    "Judy Woodruff:\nIn fact, she's given credit right now for holding her party together in ways that members of Congress say there are few others who could do that.",
    "We  and there's a real growing sense now that the path we're on is unsustainable, and we have to get back to being strong, like the World War II generation.",
    "And I think people like Biden and Trump ought to both step back and leave open the door to younger people from the next generations to serve as president.",
    "Listen, I think that it's very clear now that the generation that was ruling a couple of generations ago, the World War II generation, did a terrific job.",
    "They gave the baton to the Baby Boom population, to the generation, many of them being the parents of the Baby Boomers, obviously.",
    "Would it be better for her to step aside, even if you didn't know who could take over the Democratic Party right now in the House?",
    "There are a lot of people who are millennials who are seen as arrogant and difficult and just  they act as if they're entitled.",
    "David Gergen:\nWell, you remember, a couple of years ago, she said she was going to step down now, and she wasn't afraid of it.",
    "And, by the way, it would be healthy if we have donnybrook among a number of different candidates with different perspectives.",
    "But he is perhaps best known for his role serving as an adviser to four American presidents, Republicans and Democrats alike.",
    "Contrast that with the legacy of the Baby Boomers, crisis upon crisis that we haven't solved, actions we haven't taken.",
    "Judy Woodruff spoke to Gergen this week about his new book, \"Hearts Touched With Fire: How Great Leaders Are Made.\"",
    "I spoke with David earlier this week about his new book, \"Hearts Touched With Fire: How Great Leaders are Made.\"",
    "If they did step aside, David Gergen, there would be a free-for-all\nJudy Woodruff:\n in each political party.",
    "Some of them are going to be vulnerable in this midterm election because they do come from purple districts.",
    "(LAUGHTER)\nJudy Woodruff:\nI mean, you actually say it's time for people driving the bus to return the keys.",
    "And I have been involved in efforts to persuade some of them to run for office on both sides of the aisle.",
    "David Gergen is known to many PBS NewsHour NewsHour viewers as a long time commentator on the program.",
    "David Gergen, Author, \"Hearts Touched With Fire: How Great Leaders are Made\": Well, I believe that.",
    "But I want to get to the headline, which is telling older people essentially to get out of the way.",
    "They have taken the moral high ground, and they  with the MeToo movement and Black Lives Matter.",
    "And that is people of color, who are  I think are coming together, especially Black women.",
    "David Gergen:\nYou know, it may sound unfair to say Biden or Trump ought to both step back.",
    "Judy Woodruff:\nThe book is \"Hearts Touched With Fire: How Great Leaders are Made.\"",
    "But I celebrate the fact that they're out there in the arena working for change.",
    "We will always look back at them as sort of the role model, the gold standard.",
    "I think  I think it's an orderly transition to some  to the next generation.",
    "She's been a little less obvious since then about what her intentions are.",
    "But there's another stream I want to mention, Judy, which is less noticed.",
    "One is made up of veterans who are coming back from Iraq and Afghanistan.",
    "We just can't take the risks that are involved, and especially on health.",
    "There is a lot to ask you about here, your advice for young people.",
    "I feel very much like I'm coming home, being with you like this.",
    "And I can just  I can tell you, you lose your  you lose a step.",
    "But I think, for the good of the country, that's what's needed.",
    "And we have some splendid people in those younger generations.",
    "There are some wonderful people now in the Congress.",
    "David Gergen:\nOh, I'm sure there will be resistance.",
    "I think there are two streams of people that I see.",
    "You can't  that's too old to be in the presidency.",
    "You got to plant a seed and raise the question.",
    "But I think, overall, they impress me so much.",
    "They're just like the World War II generation.",
    "So, I don't think we ought to be afraid of it.",
    "We should welcome diversity in our politics.",
    "David Gergen:\nI don't think it leaves chaos.",
    "Judy Woodruff:\nFormer President Trump is 75.",
    "I just  I'm a big, big fan of some of them.",
    "You're not quite sure where you're going.",
    "And it requires a keen sense of judgment.",
    "And so we will have to see what happens.",
    "David Gergen, welcome to the \"NewsHour.\"",
    "But, first of all, Judy, thank you.",
    "And that is beginning to take hold.",
    "I don't agree with their politics.",
    "And congratulations on the book.",
    "I think it's inappropriate.",
    "They are to the left of me.",
    "I have no doubt about that.",
    "And you  I just turned 80.",
    "They're not all terrific.",
    "One of the men would win.",
    "David Gergen, thank you.",
    "You are more forgetful.",
    "You're not as sharp.",
    "David Gergen:\nSure.",
    "Thank you."
  ]
}