{
  "id": 3613,
  "mediaId": 302,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Florida rejected dozens of math textbooks. But only 3 reviewers found CRT violations.",
  "image": "https://www.tampabay.com/resizer//Ka-ulz5wnjZ0wieSz_pAfjx5rkg=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/4EHNRMYMCZFEHIDLUDP6YOSZQQ.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/13/florida-rejected-dozens-of-math-textbooks-but-only-3-reviewers-found-crt-violations/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4680,
    4753,
    3279,
    3410,
    2661,
    2945,
    5018
  ],
  "sentences": [
    "While he did not find any critical race theory in the textbooks, he thought one book example could lead to a discussion of race.?\nThe problem, he said, talked about how government agencies and civil rights groups monitor enrollment data at universities to ensure they fully represent different groups.?\nAnother reviewer said a different lesson could easily open up an uncomfortable conversation about racial disparity in (the) 1950s based on the vagueness of the statements.? Another underscores a book example that asked: Should colleges reserve a certain number of scholarships for minorities.?\nRobin OBrien, a 6-12 instructional specialist for the Palm Beach County School District, meanwhile, said the books she reviewed met all of the states standards on critical race theory because most pictures are white people, unless sports-related.? In a separate review, OBrien said there were no violations of critical race theory content, however, most of the examples with cartoon people are white people.?\nJordan Adams, a civics education specialist from the conservative Hillsdale College in Michigan, was more clear-cut on what his concerns were in the books he reviewed.",
    "Chris Allen, who is part of the Indian River County chapter of Moms for Liberty, a group started during the pandemic to increase parental involvement in schools and took part in the Conservative Political Action Conference in Orlando, said the two books she reviewed were agenda driven? and biased.?\nAllen, an aerospace engineer whose education credentials include a stint as a substitute teacher years ago, pointed to lessons that focused on vaccinations, which she said should not be discussed in schools because its a parents choice.? She said one of the books was biased? because it talked about climate change as if its fact,? and also warned the books contained critical race theory elements,? citing a few lesson plans, including one that stated racism and poverty still exist in the United States.",
    "Adams is a civics education specialist at the college and Apel, the college sophomore, is listed as the secretary of the Hillsdale College Republicans, a group whose mission includes connecting students to the political arena? and changing the United States in accordance with truth, liberty and human flourishing.?\nQuestions on how Florida selected its textbook reviewers\nAdams and Apel both declined to be interviewed by the Herald about their role in reviewing the books, referring all questions to the Department of Education.",
    "Yet, she flagged one lesson plan and wrote that most pictures are of white people, unless sports-related.?\n(When it came to questions about critical race thinking, reviewers assigned the book a number rating of 1-5, with 1 representing very poor/no alignment and 5 representing very good alignment.)\nAnother reviewer, Isabella Murphy, whose occupation could not be confirmed by the Herald, simply wrote intermarriage,? in her review of Elementary Statistics: Painting the World,? by Pearson.",
    "While reviewing Stats: Modeling the World,? by Pearson, he said the material may violate the states rule that prohibits ideas that argue racism is embedded in society because some examples talked about race and college plans,? racial profiling in policing,? discrimination in magnet school admissions? and that there are too many? white police in the New York Police Department compared to the racial makeup of the community.",
    "Textbook reviewer credentials set forth by state\nTo be accepted as an expert reviewer, the state requires an applicant to have at least one of four credentials in math: A masters degree or higher; an educator certification; substantial experience with evidence of mathematics content expertise and student achievement; or, recognition as a math content expert, such as receiving awards or being published in math.",
    "We want to make sure were focusing on teaching kids how to get the right answer and not being diverted by ideologies and other types of stuff that really isnt pertinent to any of this.?\nYet, records show the three individuals who warned the state about critical lessons of race in the math textbooks are themselves linked to conservative political circles.",
    "Cassie Palelis, a spokeswoman for the department, only said the reviewers the state picked were qualified.?\nAs is always the case during the instructional materials adoption process, the Florida Department of Education sought reviewers to evaluate materials, and the reviewers who conducted these evaluations were qualified,? she said.",
    "The reviewers, which included teachers, curriculum experts and university professors, answered more than 100 questions that focused on whether the book aligned with the states math standards, such as solving mathematical and real-world problems using addition, subtraction, multiplication or division of polynomials.",
    "A Miami Herald review of nearly 6,000 pages of textbook examinations, however, shows just three state reviewers  including a sophomore studying politics at a conservative college in Michigan  said four math books violated a state rule that prohibits the teaching of critical race theory.",
    "When the Florida Department of Education announced it was rejecting 54 math textbooks, it pointed to a thorough review? process that found more than half of those books included prohibited topics,? including critical race theory and social-emotional learning.",
    "Allen defended her findings in an interview with the Herald, saying she wished other state reviewers couldve seen the information I saw.?\nIm very happy that the state found that my findings were accurate enough to reject the books,? she said.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nThe other two reviewers  Jordan Adams and Jonah Apel  are from Hillsdale College in Michigan, a Christian school that has become influential in conservative politics.",
    "In his review of an algebra and trigonometry textbook, he said he found several places where CRT could be said to be present, albeit usually indirectly? and said the book was poorly aligned with state standards, according to his review.",
    "The state defines the theory as a concept that racism is embedded in American society and its legal system in order to uphold the supremacy of white persons.?\nThe three represent 2.4 percent of the 125 math textbook reviewers.",
    "The department later approved 19 of the 54 books that were initially rejected, claiming that publishers removed woke content.? But the state has not provided specific examples of what the publishers fixed or removed.",
    "The department did not respond when asked if the state directed or allowed reviewers to give greater attention to concerns about critical race theory, over issues within the math textbook lesson plans.",
    "The Department of Education did not directly respond to questions from the Herald about how the state selected Adams, Apel or Allen to review its books, or specified what their qualifications were.",
    "The Herald review also showed the department zeroed in on potential violations in race-related content, yet the overwhelming majority of state reviewers found no evidence of prohibited topics.",
    "Overall, of the 18 books where reviewers raised concerns or questions about race-related lessons, 13 were included on the states rejection list, despite the majority rating the book favorably.",
    "Greater scrutiny for CRT question\nThe department also gave greater scrutiny to one question: Do materials align to a state rule that prohibits critical race theory in instructional materials?",
    "Some books rejected, others not\nThe more than 500 reviews for 132 math textbooks point to a vague and seemingly arbitrary approach to why certain books were rejected, while others were not.",
    "Another group of reviewers focused on the books presentation and usability for both teachers and students, but those reviewers did not answer questions about critical race theory.",
    "David Aldred, an adjunct professor of law at Hillsborough Community College on the states west coast, reviewed several math textbooks and only responded to that one question.",
    "The departments criteria specifically said reviewers should have at least five years of experience teaching in the grade levels of the books they would be considering.",
    "Fifteen others raised questions about potential problems with race-related lessons, but said the books had fair,? good? or very good? alignment with the states rule.",
    "Ron DeSantis and Republican leaders to fight what they claim is the indoctrination? of students, from K-12 to the university system to local school boards.",
    "The Herald determined a review violated state rule? when a reviewer rated the book a very poor? or poor? regarding its alignment with the state standard.",
    "I found no evidence of any instruction or indoctrination of social issues.?\nMiami Herald Research Director Monika Leal contributed to this report.",
    "In a May 2021 speech at Hillsdale College, Corcoran spoke of the need to get crazy liberal stuff? out of the states instructional materials.",
    "Despite the rhetoric put forward by the state, an overwhelming majority of reviewers agreed there was no evidence of CRT in the curriculum.",
    "The math textbook review process took place when former education commissioner Richard Corcoran was still at the helm of the department.",
    "OBrien, the instructional specialist in Palm Beach County, for example, gave one textbook  Florida Reveal Math, Grade 7  a rating of 5.",
    "Assistant professor Carl Clark of Indian River State College, for instance, responded bluntly to questions about critical race theory.",
    "After reviewing a high school-level algebra and trigonometry book that was rejected by the state, Clark wrote: It is a math textbook.",
    "Its not two plus two and lets have a struggle over that,? DeSantis said at a press conference after the departments announcement.",
    "The department has not released the input from the public comment, so it remains unclear how much feedback came from that front.",
    "Records show that 90 out of the 516 math textbook reviews  or 17 percent of all book reviews  only answered that one question.",
    "The three were the only ones who said the books they reviewed had very poor? or poor? alignment to the states CRT rule.",
    "The states math textbook review process has drawn national attention and underscores the escalating effort by Gov.",
    "Sen. Manny Diaz, R-Hialeah, will serve as Floridas next education commissioner, effective June 1.",
    "The department has only provided a few examples of texts that the public deemed inappropriate.",
    "Most were educators with a background in math, but a small group, including Allen, were not.",
    "The book Murphy reviewed was rejected by the state; the book OBrien reviewed was not.",
    "Corcoran left the department in May to join a lobbying firm based out of Washington.",
    "Three reviewers linked to conservative politics\nYou know, two plus two equals four.",
    "Apel, however, confirmed Thursday he was a student at Hillsdale College.",
    "Its unclear what criteria he met to qualify as a state expert.",
    "One example about algebraic expressions, titled: What?",
    "Racist?? the department highlighted on its website.",
    "Allen cited it in one of her reviews.",
    "She rated it a 4.",
    "Me?"
  ]
}