{
  "id": 3615,
  "mediaId": 558,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Disney's fight with Florida's governor reflects a 'new paradigm,' Republican lawmaker says",
  "image": "https://s.yimg.com/uu/api/res/1.2/BlCtbf9YP0nMdRndyJRF9Q--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-05/690038b0-d233-11ec-9797-90dc40ec35cb",
  "link": "https://ph.news.yahoo.com/amphtml/disneys-desantis-new-paradigm-kevin-brady-163608789.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Werschkul",
  "authorUrl": "https://www.yahoo.com/author/ben-werschkul",
  "termIds": [
    661,
    921,
    2248,
    428,
    524,
    2661
  ],
  "sentences": [
    "The dispute heated up last month when the governor successfully lobbied for the Florida legislature to revoke Disney's special tax status in the Sunshine State because of its opposition to the law, which is formally called the Floridas Parental Rights in Education Act.?\nFor his part, Brady  a key architect of that slashed the corporate tax rate  says he is more eager to have businesses focus on developing the economy over social issues.",
    "Transportation Secretary Pete Buttigieg, the first openly gay man who has served in a presidential Cabinet, , noting that if his own young children grew up in Florida, the law might stop them from mentioning they had a great time over the weekend with their dads.?\nFor its part, Disney says the bill \"\" and that the company will work to ensure the legislature repeals the law or courts strike it down.",
    "I think the new paradigm today is that if businesses are engaged in social issues, they are entering a part of politics fairly new to them and I think there will be pushback from parties, depending on where the businesses stand,? he added, during a wide-ranging conversation on Thursday.",
    "In a new interview with Yahoo Finance, U.S. Rep. Kevin Brady, a Texas Republican, suggested the latter is true and that, more broadly, America's corporations are weighing in on social issues when they should be sticking to their lane while engaging with lawmakers.",
    "DeSantis says, which goes into effect this summer, aims to combat gender ideology? and seeks to avoid turning schools into \"a playground for ideological disputes.? Still, the new law has attracted widespread criticism  and not just from businesses like Disney.",
    "We live in a political world and I think businesses do best when they really focus, at least on their relationship with us, on these key issues of the economy,? he said in response to a question about the relationship between conservatives and businesses.",
    "The battle over the dont say gay law\nDeSantis has battled with Disney for weeks now following the companys stance against a new Florida law that bans the teaching of issues related to sexual orientation or gender identity to kids younger than third grade.",
    "Disney (DIS) saw positive news this week when it announced that its streaming service added 7.9 million subscribers, far exceeding analysts' estimates of 4.5 million.",
    "The new sign-ups came despite Disney being in conservatives' crosshairs amid its battle with Florida's governor over the state's so-called \"don't say gay bill.\"",
    "Ron DeSantis has raised the question of whether it represents a one-off battle or a fundamental change in the relationship between corporations and politicians.",
    "by introducing a bill to strip Disney of special copyright protections, though the Democratic-controlled Senate isn't expected to advance the bill.",
    "Like all media companies, Disneys stock has taken a hit in recent months following Netflixs recent announcement that it has lost subscribers.",
    "Gorbachev, tear this wall down. Todays Republicans say, Tear down Mickey Mouses house,? Biden .",
    "Pretty soon, theyll be storming Cinderellas Castle, you can be sure of it,? he added.",
    "The back and forth between Disney and politicians won't likely die down anytime soon.",
    "However, Disney has been a relative winner during the recent tough economic climate.",
    "In Washington, Sen. Josh Hawley (R-Mo.)",
    "The back and forth with Gov.",
    "Ronald Reagan said, Mr."
  ]
}