{
  "id": 3643,
  "mediaId": 558,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Governor: Florida Secretary of State Laurel M. Lee to resign",
  "image": "https://s.yimg.com/ny/api/res/1.2/YoHhVZisVAvGw0p07HfuDw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTUzODtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/MLU.MsGJG.7clS.Hd1jXIA--~B/aD0yMzU4O3c9MzA4OTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/25e8a56476c39e94b0189b1f3b7debb8",
  "link": "https://news.yahoo.com/governor-florida-secretary-state-laurel-192536959.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4047,
    2661,
    2926,
    5012
  ],
  "sentences": [
    "As Secretary of State, she helped ensure Florida had an efficient election in 2020, with accurate results.?\nPrior to becoming secretary of state, Lee was a judge in Hillsborough County, a former federal prosecutor and federal public defender.",
    "I will continue to seek what's best for the citizens of Florida and will always be proud of what we accomplished together.?\nDeSantis' office said it would soon have an announcement on Lee's replacement.",
    "Over the past 20 years, Florida has become one of the best states in the nation at administering elections, and Secretary Lee built on that tradition,? said DeSantis spokeswoman Taryn Fenske.",
    "\"I am grateful for your support throughout my tenure, and I am honored to have been part of your vision for our state,\" she wrote in her resignation letter to DeSantis.",
    "TALLAHASSEE, Fla. (AP)  Florida Secretary of State Laurel M. Lee is resigning her post as the state's top election official, Gov.",
    "In a resignation letter, Lee, a Republican, said she would step down Monday and thanked the governor, who appointed her in 2019.",
    "Her predecessor, Michael Ertel, abruptly stepped down after a newspaper obtained photos of him in blackface at a party in 2005.",
    "Her letter did not specify a reason for leaving but news outlets have reported that she is considering a run for Congress.",
    "Related video: Oklahoma Dems demand governor ask education secretary to resign",
    "DeSantis appointed Lee in early 2019.",
    "Ron DeSantis' office said Thursday.",
    "Ertel later apologized."
  ]
}