{
  "id": 3648,
  "mediaId": 151,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Taddeo insists she's staying in Florida's governor's race",
  "image": "https://static.politico.com/d3/05/ba68c9f5400bbef72003544b41ba/fineoutlogo.jpg",
  "link": "https://www.politico.com/newsletters/florida-playbook/2022/05/12/taddeo-insists-shes-staying-in-floridas-governors-race-00032003",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    724,
    3992,
    4758,
    146,
    2661,
    2788,
    2790
  ],
  "sentences": [
    "A group of Republican lawmakers has vowed to oppose any effort to extend the protection  already extended twice since the original expiration date in 1984  as a way to punish Disney, which some conservatives have cast as an outsize cultural force with a progressive agenda they have recently taken to describing as dangerous.?\n Attorneys for textbook whistleblower sends evidence that Florida school districts were overcharged millions,? by The Capitolists Brian Burgess\nODDS, ENDS AND FLORIDA MEN\n Pilot down, passenger takes over with no idea how to fly,? by The Associated Press: A passenger with no flying experience radioed an urgent plea for help when the pilot of a small plane suddenly fell ill off Floridas Atlantic coast, and was able to land the plane safely with the help of air traffic controllers.",
    "Miami-based CGI Merchant is partnering with Hilton to turn the Pennsylvania Avenue property into a Waldorf Astoria hotel, ending a more than five-year run in which the hotel became a power center in Trumps Washington and a symbol of how he mixed business and politics like no other president in history.?\nHEFTY FINES  Judge lifts contempt order against Trump in civil inquiry,? by The New York Times Jonah E. Bromwich and Ben Protess: Donald J. Trump was released from a judicial order holding him in contempt of court on Wednesday, ending an embarrassing two-week period for the former president, whose business practices are under civil investigation by the New York state attorney general.",
    "Some of the Democratic candidates soundbites that have garnered attention have come at a cost: Fried at one point compared DeSantis to Adolf Hitler and Crist got pushback after saying DeSantis was trying to gin up support from the toothless crowd.?\nWHAT WE DO IN THE SHADOWS  Mystery group behind ads in 20 Central Florida primary must reveal donors, judge rules,? by Orlando Sentinels Annie Martin: A group that sent attack ads in a Central Florida state Senate primary without disclosing its donors, listing only a $250,000 'starting balance' in its reports to the state, must reveal its contributors and make its chairman available for a deposition, a judge ruled Wednesday.",
    "Theres absolutely no amount of money that will compensate for the loss of my daughter, Pablo Langesfeld said.?\n $1 billion settlement for victims of Surfside condo collapse ranks among highest in Florida,? by Miami Heralds Jay Weaver\n Miami-Dade closer to 30-year building inspections in proposal after Surfside collapse,? by Miami Heralds Douglas Hanks\nBY THE NUMBERS  Disney theme park revenues double even amid scuffle with DeSantis, GOP,? by Orlando Sentinels Katie Rice: Walt Disney Co. executives boasted about another blockbuster quarter Wednesday at its theme parks even as they remained mum about the feud with Gov.",
    "The companies, U.S. Sugar and Florida Crystals, have given $3.8 million and $2.2 million respectively to state candidates and their political committees in the 2022 election cycle, according to first-quarter reports posted by the Florida Division of Elections and analyzed by the Times/Herald Tallahassee Bureau.?\nNOT FLORIDA  NRSC reserves $53 million in Senate battleground ads,? by POLITICOs Natalie Allison\n Ben Diamond bows out of CD 13 fight,? by Florida Politics Jacob Ogles\n Parties positioning for another battle over Senate seat in Seminole County,? by Florida Politics Scott Powers\n... DATELINE TALLAHASSEE ...",
    "I have not gotten a lot of calls from caucus members yet, or been able to talk to him [Alexander].?\n What we know about Rep. Alexanders sexual harassment allegations, his connection to FAMU,? by Tallahassee Democrats Jeff Burlew\nWERE WATCHING  FLDOE flags Lee officials for discussions to circumvent controversial education laws,? by POLITICOs Andrew Atterbury: Florida education officials are calling out a school board for allegedly plotting to circumvent? the implementation of controversial measures like the Parental Rights in Education? bill during a recent workshop meeting.",
    "It comes six weeks before the first anniversary of the tragedy on June 24. Im shocked by this result  I think its fantastic, said Judge Michael A. Hanzman of the Circuit Court in Miami-Dade County.?\nAFTERMATH  Father of Surfside victim says $1 billion settlement wont bring families closure,? by Miami Heralds Martin Vassolo: The father of a victim of the Surfside condo collapse said the nearly $1 billion legal settlement reached Wednesday wont buy closure for his family.",
    "I have no idea how to fly the airplane.?\nBIRTHDAYS: Florida Supreme Court Justice Alan Lawson  Leslie Dughi with Metz, Husband & Daughton\nFollow us on Twitter\nGary Fineout @fineout\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Lets get together  Christian Ulvert, a campaign consultant for Higgins (who used to work for Taddeo until recently  hmm) gave a statement to the Miami Herald that Higgins would stay on the county commission because I believe having a united front is critical in taking this seat back.?\nNot our problem  Taddeo didnt respond directly to the chatter, but her campaign insisted  including publicly on Twitter  that is not the case.",
    "DeSantis still hasnt made decision over sheriffs lies,? by The Associated Press\n Laura Branker, former health official in Jeb Bush administration, dies,? by Florida Politics Christine Jordan Sexton\nTRUMPLANDIA AND THE SWAMP\nUNDER NEW MANAGEMENT  Trump sells D.C. hotel lease to Miami investment group,? by Washington Posts Jonathan OConnell: Donald Trump is leaving Pennsylvania Avenue again.",
    "Decision  Circuit Judge J. Layne Smith, who DeSantis appointed to the circuit court two years ago, said during a three-hour hearing Wednesday that arguments the map violated the state Constitution were persuasive? because it diminishes the ability of African Americans to elect candidates of their choice.? He said he intended to put in place a map that would keep Lawsons district intact.",
    " Surfside condo collapse victims reach $997 million settlement,? by The New York Times Patricia Mazzei and Livia Albeck-Ripka: Families of the victims of the collapse of the Champlain Towers South condominium in Surfside, Fla., that killed 98 people last year have reached a $997 million settlement to compensate them for their staggering losses of life.",
    "MINORITY VIEWPOINT  Matt Gaetz wants Congress to decide if U.S. should go to war with Russia,? by Newsweeks Jon Jackson: Republican Representative Matt Gaetz of Florida on Wednesday criticized government support of Ukraine, stating that if members of Congress recklessly assert that the U.S. is at war with Russia then it should be officially declared.",
    "CAMPAIGN MODE\nTHE SHAPE IM IN  Florida Democrats struggle to find spotlight in race against DeSantis,? by Tampa Bay Times Kirby Wilson and Romy Ellenbogen: The three leading Democratic candidates in the Florida governors race  U.S. Rep. Charlie Crist, Agriculture Commissioner Nikki Fried and state Sen. Annette Taddeo  have a Ron DeSantis problem.",
    " Merlino also mocked the talk of Taddeo switching races: Lets hope there arent rumors Annette is going to play for the Buccaneers, it may force Brady to retire again.?\nWhy it matters  The bottom line is that Salazars seat is one of the few competitive races in Florida under the currently adopted map (which is in the middle of being challenged.",
    "Now theyre gunning for Mickey Mouse himself,? by Los Angeles Times Hugo Martin: But in 2024, the copyright protection for Mickey Mouse will expire, putting the original, old-timey version of the mouse from the Steamboat Willie animation in the public domain, freeing it for artists, creators and everyday fans to use in their own creative work.",
    "While speaking on the House floor, Gaetz warned of a dangerous bipartisan consensus that is walking us into war with Russia. The congressman, who was among the 57 House Republicans who voted against a new $40 billion aid package for Ukraine, said the government should prioritize domestic issues.?\nPENINSULA AND BEYOND\nFINAL RESOLUTION?",
    "During an earnings call, executives did not mention the widespread criticism levied at Disney for its response to Floridas so-called dont say gay bill in March  which intensified after the bill passed the Legislature and Disney CEO Bob Chapek vowed to fight it.?\nMORE FALLOUT  Republicans took away Disneys special status in Florida.",
    "STANDING PUT  House Democrats plan no leadership change amid Alexanders sexual harassment allegations,? by POLITICOs Matt Dixon: Florida House Democrats have no immediate plans to shake up their leadership amid allegations that incoming Minority Leader Ramon Alexander sexually harassed a former Florida A&M University official.",
    "The judge ordered Mr. Trump to pay $10,000 a day until he complied, leading to a $110,000 penalty.?\n Florida man pleads guilty to role in Capitol riot,? by The Associated Press\n Role in Jan. 6 Capitol riot earns Boynton-area man house arrest, 100 hours of community service,? by Palm Beach Posts Jane Musgrave\nDATELINE D.C.",
    " Florida Big Sugars campaign donations reach $6M in state races,? by Miami Heralds Mary Ellen Klas: Coming off a pivotal legislative session and heading into election season, Floridas largest sugar growers have given more than $6 million in campaign contributions to state races and thousands more to federal campaigns.",
    "The Florida Department of Education  and one Florida Board of Education member  both criticized the Lee County School Board for comments made last month, demonstrating how closely the state is tracking local school leaders who have often been a thorn in the side of the Republican Legislature and Gov.",
    "Though political committees are required to list their contributions publicly, Floridians for Equality and Justice reported just one contribution to the Florida Division of Elections, a $249,925 starting balance from a dark money nonprofit organization of the same name.?\nWHATS IN YOUR WALLET?",
    "Brown: Floridas State Board of Education, stationed in Tallahassee, traveled all the way down to Key West for a meeting Wednesday, partly at taxpayer expense for transportation and lodging in a tourist destination known for stray cats and chickens, flip-flops, and dive bars.",
    "A New York State judge, Arthur F. Engoron, held Mr. Trump in contempt late last month after finding that he had failed to comply with the terms of a December subpoena sent by the attorney general, Letitia James, requesting documents from his personal files.",
    "The Trump name at the former presidents D.C. hotel  on facade signs, linens, bar napkins and coasters  is set to be removed after the sale of his government lease for the property to CGI Merchant Group for a record-setting $375 million.",
    "The seven-member board asked several local school district leaders to join them at the southernmost point in the continental United States to discuss topics such as teacher salaries, the cost of living, and high gas prices.?\n Gov.",
    "Ron DeSantis bid to remake the states congressional map was dealt a major setback on Wednesday after a state judge said he would block the plan because of the way it scattered Black voters among several north Florida districts.",
    "Smiths announcement, however, doesnt settle the issue and is likely the start of a drawn-out legal fight that could eventually wind up before the state Supreme Court, which DeSantis has reshaped with a conservative majority.",
    "Bowing out  Multiple South Florida media outlets reported that Miami-Dade County Commissioner Eileen Higgins announced on Wednesday that she was ending her less-than-two week-old congressional campaign against Salazar.",
    "Response  But the Miami Democrats campaign made that pronouncement after a strange set of incidents led to mounting speculation she was going to switch races and challenge Republican Rep. Maria Elvira Salazar.",
    "The incumbent Republican governor has massively out-fundraised his Democratic opponents, and  despite constant negative messaging from Democrats  approval polling shows the governor is popular with voters.",
    "The settlement, revealed at a court hearing on Wednesday and still pending final approval, includes insurance companies, developers of an adjacent building and other defendants in the extensive civil case.",
    "Here I am  State Sen. Annette Taddeo  who jumped into the governors race months after the two main Democratic contenders and has lagged in fundraising and momentum  insists she isnt going anywhere.",
    "Ive got a serious situation here, the man said Tuesday afternoon, according to audio on LiveATC.net, a website that broadcasts and archives air traffic controller communications.",
    "Get in touch: gfineout@politico.com\nMAPMAKER, MAPMAKER\nOPENING ROUND  Florida judge blocks DeSantis congressional redistricting effort,? by POLITICOs Gary Fineout: Florida Gov.",
    "These are serious allegations, but right now, I dont know, there is not plan for that,? current House Minority Leader Evan Jenne told POLITICO on Wednesday.",
    "DeSantis personally pushed the GOP-led Legislature to approve the map, which boosts the number of Republican-held seats in the nations third-largest state.",
    "His daughter, 27-year-old Miami attorney Nicole Langesfeld, was among the 98 people who died in the June 24 tragedy at the Champlain Towers South.",
    "Even without taking an official action, the discussions in Lee County prompted a letter from the state and a rebuke Wednesday by the state board.",
    "HMM  Taxpayers help pay bill for State Board of Ed meeting in Key West: Would a Zoom call have sufficed?? by Florida Phoenixs Danielle J.",
    "Nick Merlino, Taddeos campaign manager, told POLITICOs Matt Dixon in a text message that we cant control what Higgins says or does.",
    "and it wouldnt be surprising if the Democratic Congressional Campaign Committee was making inquiries to find a decent challenger.",
    "Taddeo insists she's staying in Florida's governor's race\nBy GARY FINEOUT\n05/12/2022 06:58 AM EDT\nHello and welcome to Thursday.",
    "Meanwhile, many Democrats continue to express discomfort over the fractured nature of the primary for governor.",
    "Have a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for Playbook?",
    "The map also dismantles the north Florida seat held by Rep. Al Lawson, a Black Democrat.",
    "Will there be more fallout between now and when qualifying ends a month from now?",
    "Her husband Luis Sadovnic, 28, died in the collapse as well.",
    "(Yes, there are other Democrats in the race.)",
    "Annette Taddeo is a candidate for governor.",
    "Higgins didnt want to run against Taddeo.",
    " Nothing official scheduled for Gov.",
    "Period.?\nWhat number would she wear?",
    "My pilot has gone incoherent.",
    "More on that below.)",
    "The stated reason?",
    " WHERE'S RON?",
    "Ron DeSantis.",
    "Ron DeSantis.",
    "DeSantis."
  ]
}