{
  "id": 3688,
  "mediaId": 302,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Florida judge says DeSantis congressional map unconstitutional, says hell block it",
  "image": "https://www.tampabay.com/resizer//Xp728JEawEPmFn-FGSv8KbRyOEM=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/66ODFJGFR2GINTU2NY6CZJQUJQ.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/11/florida-judge-says-desantis-congressional-map-unconstitional-says-hell-block-it/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2305,
    3804,
    3879,
    478,
    3288,
    2661,
    2926,
    4991
  ],
  "sentences": [
    "But when you present real-world scenarios like a case of rape or incest, if the fetus is viable, if carrying the pregnancy to term will harm the patients future fertility or bring other health risks, if the patient has unsafe living conditions, if the patient is financially unstable, if the patient has as many children as desired, etc., women are likely to peel off that hard line faster than men.?\nPeople have complicated views about abortion\nUltimately, analyzing abortion-related poll questions is tricky because people are honestly conflicted about their views on abortion.",
    "I dont have in front of me what I think I would need to say this violates the 14th Amendment,? he said, adding We have a lot of law between 1965 and now, including even on the Fair District amendments since it was enacted and added to the Constitution.?\nGet insights into Florida politics\nSubscribe to our free Buzz newsletter\nThe governors map was fiercely opposed by Democrats, many of whom have supported a previous map drawn by Senate Republicans.",
    "Gallup has been asking the same question about abortion almost since Roe was decided: Do you think abortions should be legal under any circumstances, legal only under certain circumstances, or illegal in all circumstances??\nOver nearly five decades, legal under any circumstances? has generally attracted between 20 percent and 30 percent support, while illegal in all circumstances? has pulled between 10 percent and 20 percent support.",
    "However, the plaintiffs countered that the U.S. Supreme Court ruled in the 2019 case, Rucho v. Common Cause, that provisions in state statutes and state constitutions can provide standards and guidance for state courts to apply.?\nPlaintiffs attorney John Delaney also suggested that Republicans delayed the process to leave less time ahead of the November elections to deliberate whether to keep DeSantis map.",
    "And in either the first or third trimester, only a minority of respondents said they would support access to abortion for a fetus with Down syndrome or if the woman wanted an abortion for any reason.?\nPolls offering specific scenarios will often elicit a different response than generalities, said Janine A. Parry, director of the Arkansas Poll at the University of Arkansas.",
    "...The district that has since been enacted and signed into law by the governor does disperse 367,000 African American votes between four different districts.?\nHe acknowledged that the governors proposed Congressional District 5 may be a more compact district but said it is not in line with the minority voting rights protections in the state Constitution.",
    "Judge Layne Smith, in a ruling from the bench after a four-hour hearing, found DeSantis map unconstitutional under the Fair Districts Amendment of the Florida Constitution because it diminishes the African Americans ability to select the representative of their choice.?\nSmith, who served in the administration of former Gov.",
    "He said it he will try to get the order released on Thursday, and it doesnt matter how much coffee I gotta drink to make it happen.?\nWith the news leaked of a possible Supreme Court ruling overturning Roe v. Wade, politicians and commentators of all stripes claimed public opinion was on their side when it came to abortion.",
    "These realities make it quite difficult to sum up abortion attitudes in one or two sentences or with one or two questions.?\nBroadly, views of abortion have been largely stable over time\nPrior to the Roe decision in 1973, abortion was illegal in many states, but states were gradually choosing to legalize it.",
    "Different questions tend to provoke different answers\nFor pollsters, abortion is an incredibly difficult issue to measure,? since the results can be affected by question wording, question order and other variables, said Andrew Smith, director of the University of New Hampshire survey center.",
    "They argued that the governors proposal was blatantly partisan and violated the Fair Districts provisions by favoring Republicans in 20 of the 28 seats and diminishing the ability of Black voters to elect representatives of their choice in at least two of the proposed districts.",
    "Survey summaries can be misleading and should be interpreted with caution.?\nOften, the researchers found, surveys miss the ways that Americans offer disclaimers and caveats, contradict themselves, hedge their responses, change their minds, and think through things in real time.",
    "Most Americans, moreover, do not hold bipolar views toward abortion but multidimensional ones.?\nThe challenge with abortion polling is two-fold: First, how do survey respondents frame and summarize their own views, and second, how do the pollsters interpret those responses?",
    "The plaintiffs argued that the district drawn by the governors staff, and approved by the Legislature along mostly partisan lines, violated the provisions that prohibit the state from diminishing the ability of minority voters from electing candidates of their choice.",
    "People have a right to participate and the jury looks like the community.?\nHowever, an attorney for the state, Mohammad Omar Jazil, argued that recent decisions by the U.S. Supreme Court have restricted the use of race as a guiding factor in redistricting cases.",
    "Surveys taken by four pollsters since 2020 have asked whether Roe should be kept or overturned, and each found between 54 percent and 63 percent favored keeping the decision on the books, compared to 27 percent to 31 percent who preferred overturning it.",
    "They know if they delay maybe a court will be more reluctant.?\nSmith indicated that he considered the legislatures process open and transparent? and noted that after the governor vetoed lawmakers map they chose not to override his veto.",
    "Ron DeSantis bold political gambit, a Leon County Circuit Court judge on Wednesday threw out the new congressional map drawn by the governor and approved by legislators, ordering a new map drawn by a Harvard expert to be put in place.",
    "We look forward to defending it.?\nThe ruling leaves in place Congressional District 5, which stretches along the northern part of the state to link together Black communities from Gadsden County, west of Tallahassee, to Jacksonville.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nAttitudes on nearly all abortion questions have been remarkably stable for decades,? said Karlyn Bowman, a polling analyst at the American Enterprise Institute.",
    "As a protest to the governors attempt to force the map through, several Democratic lawmakers staged a one-hour sit-in, temporarily shutting down the House floor proceedings and resulting in an accelerated end to the special session.",
    "Voting rights groups, such as the League of Women Voters of Florida, and individual plaintiffs filed the lawsuit April 22 and asked the court for a temporary injunction and to order the Legislature to redraw a constitutional map.",
    "We will undoubtedly be appealing\nThe ruling is another legal blow to DeSantis, who vetoed a compromise map drawn by Republicans and then called lawmakers into a special session in April to approve a map his staff had drawn.",
    "But in an effort to get precincts set for candidates to qualify, he ordered a map drawn by the plaintiffs expert, Harvard professor Stephen Ansolabehere, to replace the one approved by the governor and Legislature.",
    "There is ample evidence that many people are ambivalent about the issue or experience significant cross-pressures in formulating an opinion,? said Scott Keeter, a senior survey adviser to the Pew Research Center.",
    "A subsequent case that was decided in 1992, Planned Parenthood of Southeastern Pennsylvania v. Casey, generally upheld the right to an abortion but moved away from strict adherence to the trimester system.",
    "A team of Notre Dame University researchers conducted 217 in-depth interviews with Americans across six states in 2019. Abortion attitudes are more complex than survey statistics suggest,? they concluded.",
    "But when asked a different question  should abortion be legal in all cases, legal in most cases, illegal in most cases, or illegal in all cases  support for abortion rights comes across as more nuanced.",
    "Lets get it to the appellate court, so we can make the determination as soon as possible, so that whatever the final answer is gets out to the people that need to put this into practice,? he said.",
    "One of the reasons courts want to make sure juries represent society is that people are more confident and trusting of courts if juries arent all-white or all-Black or all-anything,? he said.",
    "But if you group together the two middle categories  those who accept the need for some abortion rights along with a desire to limit access  these results add up to 54 percent to 60 percent.",
    "In the first trimester, Gallup found, support for allowing a legal abortion was overwhelming in the case of danger to the woman (83 percent) and in the event of rape or incest (77 percent).",
    "In a 7-2 ruling, the court found that the due process clause of the 14th Amendment protects the right to privacy from state action, including a womans right to choose to have an abortion.",
    "Some states have already acted to protect abortion access by passing their own laws, while others have adopted trigger? laws that would severely restrict abortion if Roe were overturned.",
    "Majorities also supported access to a first-trimester abortion for a child facing a life-threatening illness (67 percent) and if the child was mentally disabled (56 percent).",
    "If support for having abortion legal in all cases and legal in most cases is grouped together, the results in three recent surveys range from 59 percent to 62 percent.",
    "Overturning Roe, as the leaked draft would do, would get rid of the national right to an abortion and leave it up to each state to decide on what its policy should be.",
    "As Judge Smith implied, these complex constitutional matters of law were always going to be decided at the appellate level,? said DeSantis spokesperson Taryn Fenske.",
    "But the governor and lawyers arguing on behalf of the state called it an illegal gerrymander? that violates the equal protection provisions of the U.S. Constitution.",
    "They argued that since the Florida courts approved the 2015 map, there have been at least two rulings that undermine the protections in the 1965 Voting Rights Act.",
    "Despite that, she said, Americans have always been willing to put significant restrictions on its use.?\nAnother seeming paradox pops up in a recent Fox News poll.",
    "We will undoubtedly be appealing his ruling and are confident the constitutional map enacted by the Florida Legislature and signed into law passes legal muster.",
    "It moved to a system by which restrictions on abortion would be allowed unless they were determined to place an undue burden? on the woman seeking an abortion.",
    "For instance, in the wake of the draft rulings leak, abortion-rights advocates have touted polls showing Americans high rates of opposition to overturning Roe.",
    "Is the respondent for abortion only for a good reason, or for most abortions??\nBowman said that polling may never fully capture Americans views on abortion.",
    "The district was drawn and approved by the Florida Supreme Court in 2015 after the court rejected the Legislatures map during the 2010 redistricting cycle.",
    "Similar portions of men and women tend to respond affirmatively to broad questions like should Roe be overturned or should abortion be illegal,? she said.",
    "Some exceptions to hypothetical abortion bans are widely accepted, such as access to an abortion after rape or incest; others are not as widely supported.",
    "He said it would be up to lawmakers to decide if they want to enact a new map when the Legislature convenes for a week-long special session on May 23.",
    "Consistently, the support for access to abortion drops depending on whether the abortion would be done in the third trimester, rather than the first.",
    "My gut tells me that when people hold contradictory or complicated views about an issue such as abortion, most pull away from the debate,? she said.",
    "The results on other types of abortion-related questions, by Gallup and other polling groups, have shown similar degrees of consistency over time.",
    "But a narrow majority of 50 percent supported laws that would ban abortion after six weeks of pregnancy, except in the case of medical emergency.",
    "He said that adhering to the Fair District provisions would not be considered a compelling interest as required in the federal Constitution.",
    "An appellate court could put a hold on the decision or certify it immediately to the Florida Supreme Court or U.S. Supreme Court for review.",
    "The parties in this case couldnt have done anything quicker than they did,? he said, noting that the plaintiffs appealed the case swiftly.",
    "A slightly larger majority of 54 percent supported laws that would ban abortion after 15 weeks of pregnancy except in a medical emergency.",
    "On the one hand, 63 percent of respondents said Roe should be kept in place, compared with 27 percent who said it should be overturned.",
    "Its just we have a very short period of time to get this right.?\nSmith said he is hoping a resolution to the case will happen quickly.",
    "The top choice has always been legal only under certain circumstances,? which has generally polled between 50 percent and 60 percent.",
    "The reality is that the data is murkier and more contradictory than either supporters or opponents of abortion rights care to admit.",
    "The polling results suggest that Americans lack a nuanced view of what Roe permits and what would happen if it were overturned.",
    "He compared the value of representing diverse communities in redistricting to picking a diverse jury in a legal proceeding.",
    "Every question I have seen that asks whether the Supreme Court should overturn Roe shows a majority against,? Bowman said.",
    "The map was approved by Florida lawmakers during a special session after DeSantis vetoed the Legislatures original plan.",
    "Complicating matters further, these views may be tallied differently depending on how the pollster asks the question.",
    "In the third trimester, the government could regulate or outlaw abortions, with some exceptions for medical reasons.",
    "Support, however, dropped by between 8 and 25 percentage points if the scenario required a third-trimester abortion.",
    "The reason for an abortion and the timing of a procedure can play a major role in how people think about the issue.",
    "That leaves the playing field to the activists on both sides who dont really capture public opinion, but claim to.?",
    "While subsequent rulings allowed states to impose some restrictions on abortion, they could not outlaw it entirely.",
    "Smith said he will release a written order by Thursday, anticipating the state will appeal his ruling immediately.",
    "I do find persuasive the arguments that were made about the diminishment of African American votes,? Smith said.",
    "Rick Scott, was appointed to the county bench by Scott and later appointed to the circuit court by DeSantis.",
    "Smith acknowledged that another court might agree with them but, he added: Im not going to be that court.",
    "No court has ever held that complying with a state constitution is a compelling interest,? Jazil said.",
    "They dont want to resolve, or see the need to resolve, the contradictory impulses in their thinking.",
    "The Roe decision said that during the first trimester, the woman had full discretion to abort.",
    "Partly, thats because views on abortion are intensely personal, and often paradoxical.",
    "During the second trimester, the state could regulate, but not outlaw, abortions.",
    "He rejected the plaintiffs suggestion the process was intentionally delayed.",
    "Either policy would be considered an aggressive restriction on abortion.",
    "How do you interpret the middle response categories?? Smith said.",
    "And this may track with the gender of the respondent, she said.",
    "The middle category seems to be where opinion is,? Bowman said.",
    "Views on abortion are complicated or ambivalent,? Bowman said.",
    "Some of the most detailed data come from a 2018 Gallup poll.",
    "This is a timing circumstance of their own making,? he said.",
    "There is no discernible long-term trend in any direction.",
    "Nobody has drug their feet in a gotcha game, I think.",
    "Thats similar to support for keeping Roe in place.",
    "Thats basically a 2-to-1 edge for keeping Roe.",
    "TALLAHASSEE  In a swift reversal of Gov.",
    "That seems like strong support.",
    "These are not naive people.",
    "Smith ultimately agreed."
  ]
}