{
  "id": 3690,
  "mediaId": 195,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Florida judge strikes down part of DeSantis House map",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/desantisron_010621getty_budowsky.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3484699-florida-judge-strikes-down-part-of-desantis-house-map/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson",
  "authorUrl": "https://thehill.com/author/reid-wilson/",
  "termIds": [
    661,
    1587,
    4758,
    146,
    428,
    2661,
    2724,
    2788,
    2926
  ],
  "sentences": [
    "Judge Layne Smith on Wednesday ruled in favor of Democratic plaintiffs, who had sued over map lines that eliminated a historically Black congressional district stretching from Jacksonville west to Tallahassee.",
    "I am finding the enacted map is unconstitutional under the Fair District Amendment because it diminishes African Americans ability to elect candidates of their choice,? Smith said from the bench.",
    "Ron DeSantis (R), ruling that the version approved by the Republican-controlled state legislature unduly diminished the rights of African American voters in the northern part of the state.",
    "DeSantiss intervention in the redistricting process was unprecedented for a governor in modern times, and it took many Republican legislators aback after they had passed their own maps.",
    "His version of the maps effectively added four Republican seats, bolstering the GOPs chances of reclaiming control of the U.S. House of Representatives in this years midterm elections.",
    "DeSantiss proposed map created 18 Republican-leaning seats and just eight Democratic-leaning seats in what is typically one of the most narrowly divided swing states in America.",
    "The remaining two districts, both in the Miami area, would be competitive, though they would feature two Republican incumbents, Reps. Maria Elvira Salazar and Carlos Giminez.",
    "The legislature had initially approved a map that maintained the Black-majority district in north Florida, currently held by Rep. Al Lawson (D).",
    "Smith, appointed to his current post by DeSantis, said he would race to finish the written ruling so that the state could immediately appeal.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "A Florida circuit court judge on Wednesday struck down elements of a new congressional district map pushed by Gov.",
    "Smith cited a voter-approved amendment to the state constitution that requires maps to be drawn in a fair manner.",
    "But DeSantis vetoed that map and insisted the legislature pass his own version, which drew Lawson out of a seat.",
    "Smith opted to adopt a map proposed by plaintiffs, which leaves much of the rest of DeSantiss map intact.",
    "The revised version redraws northern Florida to maintain Lawsons district.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}