{
  "id": 3702,
  "mediaId": 558,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "How women could access abortions in a post-Roe world",
  "image": "https://s.yimg.com/ny/api/res/1.2/yLXOPGKWRuF543iz3J88GQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-05/e1bce2c0-d13f-11ec-ab3a-11732cb1addc",
  "link": "https://au.news.yahoo.com/how-women-could-access-abortions-in-a-post-roe-world-190414062.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2058,
    243,
    482,
    2661
  ],
  "sentences": [
    "Ushma Upadhyay, an associate professor in obstetrics, gynecology and reproductive sciences at the University of California, San Francisco, told Yahoo News that the abortion pill method, which is a way to conduct self-managed abortions, is now the most common type of abortion that exists.",
    "The final opinion is expected to land in late June or early July, and if it aligns with Alitos initial draft, the federal right to abortion will disappear, and it will be left to individual states to decide how to regulate the procedure.",
    "Last week, a leaked first-draft opinion written by Supreme Court Justice Samuel Alito revealed that the nations highest court is poised to overturn Roe v. Wade, the 1973 decision that legalized abortion nationwide.",
    "Hochul said one of the reasons the fund is necessary is the influx of out-of-state patients who are expected to seek abortions in New York if the Supreme Court draft decision becomes final.",
    "The Guttmacher Institute, a research group focused on reproductive health, estimates that as many as 26 states are certain or likely to ban abortion if Roe v. Wade is overturned.",
    "that over the past four years, it has delivered abortion medication to more than 30,000 Americans across all 50 states and that its work will continue in a post-Roe world.",
    "The state had a pre-Roe abortion ban that was modified in the 1960s allowing for abortions in the first 20 weeks of pregnancy, but it has remained unenforceable.",
    "One such place is an organization based in Austria called , which offers women in the U.S. online consultations and prescriptions from European doctors.",
    "However, if Roe v. Wade is struck down, DeSantis or other Florida legislators could try to pass even stricter limits, or a total ban on abortions.",
    "Thirteen states have already launched so-called trigger laws, which will make abortion bans go into effect almost immediately if that is the case.",
    "Our most recent data available is from 2020, and weve learned that medication abortion accounts for 54% of all abortions,? Upadhyay said.",
    "Abortion access in these states will certainly become more difficult, but experts say the bans wont stop women from getting an abortion.",
    "connects women with organizations that can support them financially and with any logistical needs as they arrange for an abortion.",
    "There are two main ways in which women, in states where it will be illegal, seek to terminate a pregnancy in the post-Roe world.",
    "The organization requests for pills and information about them have already tripled since Alitos draft opinion was leaked.",
    "The other is obtaining a medication abortion, which includes taking two pills, through telemedicine and mail delivery.",
    "Finally, people who wont be able to afford to travel out of state will be able to seek assistance from abortion funds.",
    "Under this law, anyone convicted of performing the procedure would face up to 10 years in prison and a $100,000 fine.",
    "Instead, women have turned to international organizations and online pharmacies overseas that sell these medications.",
    "And the second is misoprostol, which allows the uterine to contract and empty the contents of the uterus,? she said.",
    "For women who live in states where abortion pill access is limited, the group has become an important resource.",
    "Similarly, that would charge women who get an abortion  and those who assist them  with homicide.",
    "Ron DeSantis signed a bill into law that bans most abortions after 15 weeks of pregnancy.",
    "that prohibits legal action against people seeking an abortion and those who aid them.",
    "On Tuesday, that her state was launching a $35 million fund for abortion services.",
    "These restrictions, however, have not stopped people from getting abortion pills.",
    "Abortion pills, Upadhyay explained, involve the use of two types of medications.",
    "Some states have already started to pass laws to criminalize abortion care.",
    "Many women in America will be impacted by this highly anticipated ruling.",
    "Of those, 10 have passed laws that make no exceptions for rape or incest.",
    "So how would women in these states access abortion in a post-Roe world?",
    "The first is mifepristone, which stops a pregnancy from growing.",
    "One is traveling to a state where abortion is legal.",
    "is currently legal until the 24th week of pregnancy.",
    "Kevin Stitt recently signed a bill into law .",
    "In some states such as Indiana and Texas, .",
    "However, if Roe v. Wade is overturned, .",
    "What are abortion pills?",
    "It takes effect July 1.",
    "But last month, Gov.",
    "Oklahoma Gov."
  ]
}