{
  "id": 3709,
  "mediaId": 558,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Gov. DeSantis still hasn't made decision over sheriff's lies",
  "image": "https://s.yimg.com/ny/api/res/1.2/CBGV2VbIiV7rY3UI9JR3rA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTYxODtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/CCTqMXlDlzG9uQd0vUmJqA--~B/aD0zMjQ4O3c9NTA0ODthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/4de48001618c89720fcfdc7aa14cdd69",
  "link": "https://nz.finance.yahoo.com/amphtml/news/gov-desantis-still-hasnt-made-173941716.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    925,
    4205,
    3161,
    3281,
    2582,
    2661,
    2721,
    4985
  ],
  "sentences": [
    "DeSantis said on Feb. 1 that he and his staff would in the coming days? consider a Florida Department of Law Enforcement report that concluded Broward County Sheriff Gregory Tony lied repeatedly on police applications about the shooting, his teenage drug use and his driving record.",
    "Ron DeSantis still has not said whether he will discipline a major county sheriff he appointed who state investigators found lied repeatedly about killing another teenager almost 30 years ago despite saying more than three months ago that he would soon review the case.",
    "DeSantis said on Feb. 1 that he and his staff would in the coming days? review a state report that found the sheriff he appointed lied repeatedly about killing another teenager almost 30 years ago, his past drug use and his driving record.",
    "Ben Wilcox, co-founder of the government watchdog group Integrity Florida, said to a layperson, 100 days seems more than sufficient for DeSantis to decide, particularly since the investigation is complete.",
    "But he has also removed people from office quickly.?\nThat's what happened in 2019 when DeSantis, three days after taking office , fired Broward County's then-sheriff, Scott Israel, and appointed Tony.",
    "Under Florida law, a governor can permanently or temporarily suspend any local elected official for malfeasance or other infractions, with the official having the right to appeal to the Senate.",
    "That was 100 days ago on Wednesday, May 11, 2022 and neither DeSantis nor his staff have made any announcement about whether he will discipline Gregory Tony.",
    "DeSantis-Sheriff\nFILE - In this Jan. 11, 2019 file photo, acting Broward County sheriff Gregory Tony, right, speaks after being introduced by Florida Gov.",
    "The father of a Stoneman Douglas victim who is a staunch DeSantis supporter had recommended him; the dad and Tony worked out at the same gym.",
    "The vetting process was completed in days and did not uncover the fatal shooting, which happened in Tony's hometown of Philadelphia.",
    "DeSantis' press office did not respond to an email sent Tuesday by The Associated Press or a Wednesday phone call seeking an update.",
    "DeSantis said Israel mishandled the February 2018 massacre at Parkland's Marjory Stoneman Douglas High School that left 17 dead.",
    "The firing was anticipated, but Tony's appointment was not  he was a former suburban police sergeant with little public profile.",
    "But, he said, it is hard to say for sure without knowing what the governor and his staff are doing with their review.",
    "Tony, then 14, fatally shot an 18-year-old neighbor during a 1993 fight at his family's home using his father's gun.",
    "He was charged with murder, but was acquitted in juvenile court after arguing self-defense.",
    "Ron DeSantis, left, at the Broward County Sheriff's Office in Fort Lauderdale, Fla. Gov.",
    "(AP Photo/Wilfredo Lee, File)\nFORT LAUDERDALE, Fla. (AP)  Florida Gov.",
    "The Broward County Sheriff's Office declined comment Wednesday.",
    "I want to give him the benefit of the doubt.",
    "As of Wednesday, that was 100 days ago.",
    "It is a weighty case,? Wilcox said.",
    "."
  ]
}