{
  "id": 3755,
  "mediaId": 136,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Some Florida School Yearbooks Delayed Over Student Protest Photos",
  "image": "https://d.newsweek.com/en/full/2035053/yearbook-delay-florida-dont-say-gay.webp?w=790&f=1a4ee96a237a46152097c1695e42a509",
  "link": "https://www.newsweek.com/some-florida-school-yearbooks-delayed-over-student-protest-photos-1705397",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thomas Kika",
  "authorUrl": "https://www.newsweek.com/authors/thomas-kika",
  "termIds": [
    661,
    3450,
    2661,
    5120
  ],
  "sentences": [
    "Unfortunately, the pictures and descriptions that depicted this event did not meet school board policy and were not caught earlier in the review process...I look forward to everyone getting to see the yearbook and having the opportunity to enjoy it themselves.\"",
    "Signed by Republican Governor Ron DeSantis in March, the \"Don't Say Gay\" bill, officially known as the Parental Rights in Education Act, has been widely criticized as blocking all discussion of gender identity and sexual orientation in public schools.",
    "Now, the school will have to cover up several images in each copy, including shots from a walk-out protest of the controversial \"Don't Say Gay\" bill in which students can be seen displaying rainbow flags and a sign reading \"Love Is Love.\"",
    "Skye Tiedemann, co-editor-in-chief of the yearbook, also spoke with the outlet about the decision, highlighting the discrepancy between the decision to hide the images and the school's frequent celebration of its diversity.",
    "The distribution is being delayed in order to assure the yearbook meets all aspects of Seminole County School Board policies, particularly as it pertains to non-school sponsored events contained in school publications.",
    "\"Every single morning on the announcements Mr. Hunter says that we are historic, we are diverse and we are inclusive and clearly in our yearbook we are trying to portray that with the LGBTQ community.\"",
    "Yearbook distribution at one Florida high school has been delayed after they were discovered to contain images protesting the state's \"Don't Say Gay\" legislation.",
    "The statement from the principal said, according to WEST News:\n\"Earlier today I announced that the distribution of the Lyman Yearbook would be delayed.",
    "Several members of the Lyman High School yearbook club are planning to attend a Tuesday school board meeting to share their issues with the decision.",
    "\"These are my photos and I think the students should be able to see them because taking away these photos is silencing their voices,\" Koesler said.",
    "\"This was a protest that wasn't met with much resistance by administration and we were easily able to take pictures of the kids in the courtyard.",
    "Lyman High School students in Seminole County, Florida, were meant to receive their yearbooks for the 2021-2022 school year on Monday.",
    "Photographer Madi Koesler, a recent graduate of the school herself, took the walk-out photos that were included in the yearbooks.",
    "Hunter explained further that reprinting the books without the photos would be too costly and time-consuming for the school.",
    "Without the image, he claimed that the books would still represent the high school's \"history, diversity, and inclusivity.\"",
    "\"When my teacher first told me [about the stickers covering the pictures] I was just completely shocked,\" Tiedemann said.",
    "Students have also launched a \"Stop the Stickers\" campaign in opposition to the school's yearbook decision.",
    "She spoke to WESH about the school's decision to censor her images.",
    "Newsweek reached out to Lyman High School for comment.",
    "They were celebrated; they were chanting.\""
  ]
}