{
  "id": 3766,
  "mediaId": 65,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Karol Markowicz on NYC Jewish museum canceling DeSantis speaking event: 'Political games'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/d63a6ebb-aac4-42e5-a8e7-16bb10cecb22/533db9ac-ce17-4671-b37e-0952a33f0221/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/ron-desantis-jewish-museum-cancels-event-markowicz",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amy Nelson",
  "authorUrl": "https://www.foxnews.com/person/n/amy-nelson",
  "termIds": [
    661,
    4298,
    4302,
    523,
    539,
    3426,
    2661,
    2826
  ],
  "sentences": [
    "Elliot Abrams and Eric Cohen, who were working closely with the museum to plan the event, wrote in a Wall Street Journal op-ed that museum staff claimed DeSantis didnt \"align with the museums values and its message of inclusivity.\"",
    "The Museum of Jewish Heritage responded to the claims with a statement on Twitter: \"This is not a free speech or censorship issue This was simply a contractual and logistical decision.",
    "New York Post columnist Karol Markowicz sounded the alarm Tuesday after the Museum of Jewish Heritage in New York City canceled an event that was slated to feature Florida Gov.",
    "NYC POLITICIAN PULLS FUNDING FROM JEWISH MUSEUM OVER ALLEGED DESANTIS SNUB\nMarkowicz said on \"Fox & Friends\" Tuesday that DeSantis was an \"obvious choice\" for the event.",
    "New York City councilwoman Inna Vernikov announced that she is withholding her $5,000 donation to the museum, claiming DeSantis was barred from the speaking event.",
    "Markowicz said canceling the event sends the message that the museum doesnt prioritize Jewish heritage or Holocaust education, rather, it pushes a leftist agenda.",
    "We welcome Governor DeSantis and elected officials from across the spectrum to visit the Museum of Jewish Heritage.\"",
    "She explained that if DeSantis is not welcome at the museum, then she isnt welcome either.",
    "Markowicz argued the move is an example of the leftist agenda being pushed in America.",
    "\"They can no longer push far-left policies and beliefs and expect no consequences.",
    "\"I am a Jew who does not feel comfortable going to the Museum of Jewish Heritage.",
    "\"We have to make it risky for them to play these political games,\" she said.",
    "Theyre the ones driving us apart,\" she told host Steve Doocy.",
    "If hes not welcome, that means something for the rest of us.\"",
    "\"Its not just about Governor DeSantis,\" she said.",
    "There are consequences, and here they are.\"",
    "I think thats a real problem for them.\"",
    "Markowicz said the statement is a lie.",
    "\"This is really about the rest of us.",
    "Markowicz said shes had enough.",
    "\"Theyre the ones pushing hate.",
    "Ron DeSantis."
  ]
}