{
  "id": 3775,
  "mediaId": 409,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Woke Inc. Author Launches Financial Firm to Compete with Ideological Cartel of BlackRock, Vanguard",
  "image": "https://www.nationalreview.com/wp-content/uploads/2020/07/blackrock.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/woke-inc-author-launches-financial-firm-to-compete-with-ideological-cartel-of-blackrock-vanguard/",
  "sentiment": "0.0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brittany Bernstein",
  "authorUrl": "https://www.nationalreview.com/author/brittany-bernstein/",
  "termIds": [
    661,
    1448,
    2524,
    3714,
    523,
    524,
    3153,
    3546,
    3580,
    2661
  ],
  "sentences": [
    "The Big 3 asset managers have fueled this polarizing new trend in corporate America, and thats why were going to compete with them head-on to refocus American companies on the shared pursuit of excellence over politics.?\nRamaswamy told the Wall Street Journal he views BlackRock, Vanguard, and State Street as an ideological cartel,? with the group having pushed companies to improve diversity, cut their climate emissions, and other changes in the name of stakeholder capitalism,? according to the report.",
    "The new firm aims to solve what it says is a fiduciary problem created by BlackRock, Vanguard and State Street, which have used clients funds to exercise decisive influence over nearly every U.S. public company to advance political ideologies that many of their clients disagree with.?\nOver the last two years, I have traveled the country and listened to the concerns of everyday Americans who want to be heard in the places where they shop, work and invest,? Ramaswamy said in a statement.",
    "Disney has been an outspoken critic of the measure, going so far as to say its goal as a company? is having the bill repealed by the legislature or struck down in the courts.?\nIn return, Florida stripped Disney of its independent special district? status, with Governor Ron DeSantis warning that if the company chose to use its economic might to attack the parents of my state,? he would treat it as a provocation? and fight back.?\nSenator Josh Hawley (R., Mo.)",
    "The launch comes amid an ongoing battle between Disney and Republicans after the company inserted itself into the conversation around Floridas Parental Rights in Education law, which prohibits instructors from teaching about sexual orientation and gender identity in kindergarten through third-grade classrooms.",
    "He criticized the so-called big three for siding against Exxon Mobil in its fight against a small hedge fund that had criticized its climate-change strategy and was seeking board seats, telling the Wall Street Journal he would not have done the same.",
    "We want iconic American brands like Disney, Coca-Cola and Exxon, and U.S. tech giants like Twitter, Facebook, Amazon and Google to deliver high-quality products that improve our lives, not controversial political ideologies that divide us.",
    "Woke, Inc., author Vivek Ramaswamy recently announced the launch of his new financial firm that will focus on excellence capitalism? rather than encouraging American corporations to get involved in social or environmental issues.",
    "Ramaswamy, an entrepreneur in the healthcare and technology sectors, said he raised $20 million to launch the Ohio-based financial firm called Strive, including investments from Peter Thiel and Thiels Founders Fund.",
    "We will tell oil companies to be excellent oil companies and coal companies to be excellent coal companies and solar companies to be excellent solar companies,? he told the outlet.",
    "also recently proposed new legislation to end special copyright protections for Disney and to cap all federal copyright protections at 56 years, according to Fox News.",
    "Thanks to special copyright protections from Congress, woke corporations like Disney have earned billions while increasingly pandering to woke activists.",
    "Its time to take away Disneys special privileges and open up a new era of creativity and innovation,? Hawley told Fox.",
    "The age of Republican handouts to Big Business is over."
  ]
}