{
  "id": 3807,
  "mediaId": 129,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "States Turn to Tax Cuts as Inflation Stays Hot",
  "image": "https://static01.nyt.com/images/2022/05/04/business/00dc-statesinflation02/merlin_206384844_28343f3b-0534-4f02-ba8b-77a5ec211e28-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/10/us/politics/states-tax-cuts-inflation.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4525,
    2661,
    2706,
    2945,
    2957
  ],
  "sentences": [
    "The problem is, from any governors perspective, a lot of the inflation it is adding is nationwide and a lot of the benefits of the tax cuts are to the states.?\nStates are awash in cash after a faster-than-expected economic rebound in 2021 and a $350 billion infusion of stimulus funds that Congress allocated to states and cities last year.",
    "Its very difficult for policymakers to see the inflationary pressures that taxpayers are burdened by right now while sitting on significant cash reserves without some desire to return that,? said Jared Walczak, vice president of state projects with the Center for State Tax Policy at the Tax Foundation.",
    "A combination of flush state budget coffers and rapid inflation has lawmakers across the country looking for ways to ease the pain of rising prices, with nearly three dozen states enacting or considering some form of tax relief, according to the Tax Foundation, a right-leaning think tank.",
    "The White House declined to assess the merits of states cutting taxes but pointed to the administrations measures to expand fuel supplies and proposals for strengthening supply chains and lowering health and child care costs as evidence that Mr. Biden was taking inflation seriously.",
    "According to the Tax Foundation, which has been tracking proposals this year, some would be phased in, some would be permanent and others would be temporary holidays.?\nNext month, New York will suspend some of its state gas taxes through the end of the year, a move that Gov.",
    "Jason Furman, an economist at Harvard University who was an economic adviser under the Obama administration, said that the United States economy was producing at full capacity right now and that any additional spending power would only drive up demand and prices.",
    "David Herzig, a partner at Ernst & Young, said that, in theory, taking money out of the economy with higher taxes would depress rising prices, but that if that led workers to demand higher wages it could have the unintended effect of driving prices even higher.",
    "Grover Norquist, president of Americans for Tax Reform, a group that promotes lower taxes, has been encouraging governors to eliminate their income taxes altogether and said inflation was changing the calculus of how state officials thought about tax policy.",
    "In Pennsylvania, Attorney General Josh Shapiro, a Democrat who is running for governor, has proposed eliminating the states 11 percent cellphone tax, expanding a property tax and rent and rebate program, and providing a $250-per-vehicle gas tax refund.",
    "Tom Wolf, a Democrat, has called for gradually lowering the states corporate tax rate to 5 percent from 10 percent  taking a decidedly different stance from many of his political peers in Congress, who have called for raising corporate taxes.",
    "But while the policies are aimed at helping Americans weather the fastest pace of inflation in 40 years, economists warn that, paradoxically, cutting taxes could exacerbate the very problem lawmakers are trying to address.",
    "Its easier to move, and the places you can move to are much more cosmopolitan than they used to be.?\nStates with high taxes such as New York have been grappling with concerns about residents fleeing for tax purposes.",
    "While the Biden administration has restricted states from using relief money to directly subsidize tax cuts, many governments have been able to find budgetary workarounds to do just that without violating the rules.",
    "The problem was there was just too much money for states and localities.?\nA new report from the Tax Policy Center, a left-leaning think tank, said total state revenues rose by about 17.6 percent last year.",
    "Adding to the urgency is the political calendar: Many governors and state legislators face elections in November, and voters have made clear they are concerned about rising prices for gas, food and rent.",
    "The administration has responded by primarily trying to ease supply chain logjams that have created shortages of goods and cracking down on price gouging, but taming inflation falls largely to the Fed.",
    "Substantial tax policy changes can negatively affect revenues and lead to long-term structural budget challenges, especially when enacted all at once in an uncertain economic environment,? Fitch said.",
    "The challenge for policymakers is that simply cutting checks to taxpayers can feed the inflationary environment rather than offsetting it.?\nThe tax cuts are coming in a variety of forms and sizes.",
    "Ms. Hochul said this year that she would not support any tax increases, noting that she did not want those who support art, culture and philanthropy in New York City moving to Miami.",
    "He favored the gas tax refund, which would be paid for with unused pandemic relief money, over a tax holiday because it ensured that oil companies would not reap the benefits.",
    "Its more painful to live in a high-tax state,? Mr. Norquist said, suggesting that more mobility because of remote work has forced states to keep their taxes more competitive.",
    "Republicans have yet to settle on a candidate for governor and will decide during a primary election this month, but some of those running have called for cutting gas taxes.",
    "Stocks fell for another session on Monday, with the S&P 500 down 3.2 percent, as investors fretted about a slowdown in global growth, high inflation and other economic woes.",
    "So far, the White House has resisted calls for a gas tax holiday, though Jen Psaki, the White House press secretary, said in April that President Biden was open to the idea.",
    "State rainy day funds  money that is set aside to cover unexpected costs  have reached new record levels,? according to the National Association of State Budget Officers.",
    "The Tax Policy Center said its state tax revenue forecasts for the rest of this year and next year were alarmingly weak? as states enacted tax cuts and spending plans.",
    "The Federal Reserve has begun raising interest rates in an attempt to cool economic growth, and there are growing concerns about the potential for another recession.",
    "Floridas economy has consistently outpaced the nation, but we are still fighting against inflationary policies imposed on us by the Biden administration,? he said.",
    "Laura Kelly backed a bill last month that would phase out the 6.5 percent grocery sales tax in Kansas, lowering it next January and bringing it to zero by 2025.",
    "Officials say they do not yet see evidence that rapid inflation is turning into a permanent feature of the economic landscape, even as prices rise very quickly.",
    "Yet with recent polling showing that inflation is a top worry among voters this year, policies that address higher prices could be critical to political races.",
    "Inflation can be especially hard to shoulder for poor households because they spend a bigger chunk of their budgets on necessities like food, housing and gas.",
    "But when it comes to cutting taxes, he acknowledged, the incentives for states do not always appear to be aligned with what is best for the national economy.",
    "The bill signed by Mr. DeSantis will also spend $200 million of pandemic relief money to suspend its gas tax during October, ahead of the November elections.",
    "President Biden is taking aggressive action to lower costs for American families and address inflation,? Emilie Simons, a White House spokeswoman, said.",
    "It is typically expressed as the annual change in prices for everyday goods and services such as food, furniture, apparel, transportation and toys.",
    "By putting more money in peoples pockets, policymakers risk further stimulating already rampant consumer demand, pushing prices higher nationally.",
    "Mr. Furman pointed to the budget surpluses as evidence that the $1.9 trillion pandemic relief package handed too much money to local governments.",
    "Fitch, the credit rating agency, said recently that immediate and permanent tax cuts could be risky in light of evolving economic conditions.",
    "As Russias war in Ukraine drives up energy prices, many states have been debating whether to enact gas tax holidays or send out rebates.",
    "In many cases, Democrats are joining Republicans in supporting permanently lower taxes or temporary cuts, including for high earners.",
    "On the campaign trail, Mr. Shapiro said, voters view higher prices as a major concern and are looking to politicians for answers.",
    "As prices continue to rise for the essentials like groceries, we need to provide relief swiftly,? Ms. Kelly said on Twitter.",
    "There are plenty of reasons to believe that the inflationary burst will fade, but some concerning signs suggest it may last.",
    "Republicans in the state pushed for the gradual reduction despite calls from Democrats to cut the tax to zero by July.",
    "The degree to which state tax relief fuels inflation depends in large part on how quickly the moves go into effect.",
    "Inflation is a loss of purchasing power over time, meaning your dollar will not go as far tomorrow as it did today.",
    "We dont know all the knock-on consequences of these decisions,? Mr. Herzig, a former tax law professor, said.",
    "The state tax cuts are taking place as the Biden administration struggles to respond to rising prices.",
    "WASHINGTON  In Kansas, the Democratic governor has been pushing to slash the states grocery sales tax.",
    "Last month, New Mexico lawmakers provided $1,000 tax rebates to households hobbled by high gas prices.",
    "They talk about the stuff they buy at the grocery store and gas and all of that,? Mr. Shapiro said.",
    "Mr. Wolf said in April that the proposal was intended to make Pennsylvania more business friendly.",
    "Ron DeSantis of Florida signed a $1.2 billion tax cut that was made possible by budget surpluses.",
    "Kathy Hochul, a Democrat, said would save families and businesses an estimated $585 million.",
    "Mr. DeSantis, a Republican, hailed the tax cuts as the largest in the states history.",
    "This month, Delaware will begin sending out $300 relief payments? to adult residents.",
    "The states coffers were bolstered by $8.8 billion in federal pandemic relief money.",
    "Legislatures in Iowa, Indiana and Idaho have all cut state income taxes this year.",
    "Candidates are increasingly focused on how to help people deal with bigger bills.",
    "And Alaska is considering a suspension of its motor fuel taxes through mid-2023.",
    "I think all these tax cuts in states are adding to inflation,? Mr. Furman said.",
    "Yet those rosy budget balances may not last if the economy slows, as expected.",
    "Cutting taxes too deeply now could put states on weaker financial footing.",
    "The efforts are blurring typical party lines when it comes to tax policy.",
    "The broad effects of tax policy on inflation are not easy to forecast.",
    "It just costs more, and they want someone to do something about it.?",
    "He noted that few Democrats were talking about raising taxes.",
    "How does inflation affect the poor?",
    "Card 1 of 6\nWhat is inflation?",
    "Where is inflation headed?",
    "In Pennsylvania, Gov.",
    "Inflation F.A.Q.",
    "Last week, Gov.",
    "Gov."
  ]
}