{
  "id": 3814,
  "mediaId": 323,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Why Many Brands Have Kept Their Voices Down on Roe v. Wade (So Far)",
  "image": "https://images.wsj.net/im-540978?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/why-many-brands-have-kept-their-voices-down-on-roe-v-wade-so-far-11652140246",
  "sentiment": "0.0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ann-Marie Alcántara",
  "authorUrl": "https://www.wsj.com/news/author/ann-marie-alcantara",
  "termIds": [
    661,
    3746,
    3896,
    4886,
    4895,
    482,
    539,
    3134,
    3388,
    3668
  ],
  "sentences": [
    "And, given that, one would expect that certain brands will have to take a stanceand not a weak stance.?\nWhile it remains unclear whether more companies will release public statements in the coming days or weeks, some might communicate related policies to employees or develop a long-term strategy, Ms. Hagelgans of Edelman said.",
    "Public-relations agency Zeno Group instructed staff to tell clients that if they do take a position, they should avoid taking a stand that they cannot reverse, especially when the decision is not final.?\nThe subject of abortion is a particularly divisive issue, a Zeno executive wrote in an email to the agencys client leaders.",
    "Some companies are still considering the expectations of employees and others with an interest in their business, said Andrea Hagelgans, U.S. managing director of social issues engagement at communications firm Edelman, which has been consulting with clients on the issue since the draft opinion emerged.",
    "Open Queue\nMost marketers have stayed quiet about the draft opinion that indicated the Supreme Court might overturn Roe v. Wade in the week since it was revealed, a decision that stands out in a time when brands increasingly speak out about public issues.",
    "Illustration: Jacob Reynolds\nThe goal is to reinforce existing brand identities on issues that matter to customers and employees, said Marisa Mulvihill, partner and head of brand and activation at Prophet Brand Strategy Inc., a marketing consulting firm.",
    "More From CMO Today\nExpectations around corporate citizenship are changing, with many consumers and employees looking for companies to become engaged in social issues, said Chris Miller, global head of activism strategy at Ben & Jerrys.",
    "The Roe v. Wade Opinion Draft: How the Supreme Court Decides CasesPlay video: The Roe v. Wade Opinion Draft: How the Supreme Court Decides Cases\n A leaked draft of an opinion overturning Roe v. Wade could change before it is finalized.",
    "Ron DeSantis last month signed into law a bill stripping Walt Disney Co. of a special tax status, a move that followed the companys public opposition to a state bill limiting classroom instruction on gender and sexuality.",
    "Some consumers might use the leaked opinion as a litmus test, said Aimee Drolet Rossi, professor of marketing and behavioral decision making at the University of California, Los Angeless Anderson School of Management.",
    "And then the audience for whom that resonates will stand with them.?\nBut Roe v. Wade in particular involves religious beliefs that can make companies more concerned about offending peoples views, Ms. Mulvihill said.",
    "It was meant to advise clients within the first 24 hours of breaking news, and its intent was to counsel clients to be measured in their immediate response to a complex developing story,? Ms. Siegel said.",
    "Subjects that divide the country can sometimes be no-win situations for companies because regardless of what they do they will alienate at least 15 to 30 percent of their stakeholders,? the email said.",
    "There have been defenses of Roe v. Wade from a small group of marketers, including Levi Strauss & Co., Kerings Gucci, Yelp Inc., Match Group Inc.s OkCupid, Bumble Inc. and Unilever PLCs Ben & Jerrys.",
    "A variety of factors is likely at play, including fear of alienating consumers or other constituencies and the fact that the Supreme Court hasnt yet ruled on the case, some marketing experts said.",
    "Gender equality is at stake and more brands need to step up.?\nNewsletter Sign-up\n WSJ | CMO Today\n CMO Today delivers the most important news of the day for media and marketing professionals.",
    "Consumers will take note and they will remember and we can see the chatter on Twitter and on Snap and on TikTok of people saying, Why hasnt my company spoken up for me?? Ms. Hobley said.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nPlayback speed\nListen to article\nLength (6 minutes)\nAD\nLoading advertisement...\n00:00 / 05:32\n1x\nThis article is in your queue.",
    "That might mean gathering opinions internally from employees and employee resource groups, for example, before deciding whether to release a public statement, Ms. Hagelgans said.",
    "And more than a dozen brands that have previously taken positions on other issues either declined to comment on the draft opinion or didnt respond to requests for comment.",
    "It is going to become increasingly hard for them to stay on the sidelines on it,? Mr. Miller said of companies choosing not to comment on the leaked draft opinion.",
    "Zeno Chief Executive Officer Barby Siegel said the email was sent soon after the leak and only concerned clients potential initial reactions.",
    "Protecting access to the full range of reproductive health care, including abortion, is a critical business issue,? the apparel maker wrote.",
    "OkCupid has proudly supported reproductive rights for years, and were not stopping now,? the dating service wrote on Twitter, for example.",
    "Expressing convictions on public issues can be good business in itself, said Melissa Hobley, global chief marketing officer at OkCupid.",
    "The Roe v. Wade Opinion Draft: How the Supreme Court Decides Cases\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Write to Ann-Marie Alcntara at ann-marie.alcantara@wsj.com\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "If theyre authentic in what they stand for and they reinforce it consistently, then its credible,? Ms. Mulvihill said.",
    "WSJ explains how the Supreme Court makes decisions and what could follow if the right to an abortion is rescinded.",
    "And there can be consequences to taking on social issues, beyond alienating consumers who take a different view.",
    "Levis sought to defend Roe v. Wade on business grounds in its statement following the leak of the draft opinion.",
    "Companies should take stands on major issues when it is consistent with their values and actions, she added.",
    "0:00 / 5:19\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "I would not take the silence to mean that it is going to be permanent silence,? she said.",
    "There is no question that this is an enormous sea change,? Prof. Drolet Rossi said.",
    "The email was previously reported by the newsletter Popular Information.",
    "PREVIEW\nSUBSCRIBE\nBut many more companies have kept to the sidelines.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "Nat Ives contributed to this article.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Florida Republican Gov."
  ]
}