{
  "id": 3835,
  "mediaId": 558,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Even Disney Cant Shake Wall Streets Recession Fears About Hollywood Stocks | Analysis",
  "image": "https://s.yimg.com/ny/api/res/1.2/LrcBxABYQf3.VY9g6yCvXA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NTtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/Wr6QZ4nOhmjMITuNh4Zrpw--~B/aD01MTE7dz03Mzg7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/thewrap.com/6d244035605797ad431c69ec59def9ce",
  "link": "https://sg.news.yahoo.com/even-disney-t-shake-wall-133000424.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Bel Bruno",
  "authorUrl": "",
  "termIds": [
    661,
    524,
    2700
  ],
  "sentences": [
    "Even the venerable Disney stock has been hit hard, which has one analyst seeing a harbinger of doom and gloom.?\nInvestors worry a significant drop in consumer spending would hurt Hollywood as TV advertisers slash budgets, families cancel summer theme park vacations and subscribers cancel streaming services to save cash.",
    "The 1,000-point nosedive in the Dow Jones industrial average is poised to continue on Monday on fears the economy is skidding into an unavoidable recession, with entertainment stocks among the industries hit hard as analysts expect consumers to tighten their belts.",
    "Exacerbating any potential recession-related drop is that the industry has already been under significant pressure, with one key barometer  the S&P 500 Media & Entertainment index  down 33% from its all-time high last August.",
    "We are in that period of it being doom and gloom.?\nMultiples, the metrics that Wall Street uses to assign companies a value, have been eroding for the past year and curbed investor appetite for entertainment companies.",
    "Ron DeSantis so-called Dont Say Gay? bill (which has evolved into a battle over the companys special tax status in Florida), but the company has also run afoul of the kind of metrics analysts want to see.",
    "But one top Wall Street analyst worries that not even Walt Disney Co., the worlds largest and most financially fortified entertainment conglomerate, has been able to convince investors to buy the stock.",
    "The leading streaming service said inflation and more competition contributed to a loss of subscribers for the first time in more than a decade  and warned of steeper losses ahead as .",
    "The fact that Disney is trading at $110 is stunning, its hard to believe,? said Jessica Reif Ehrlich, senior U.S. media and entertainment analyst at Bank of America Securities.",
    "And that kind of steep drop is almost unheard of among the blue-chip members of the Dow Jones index that tracks stock performance of the nations 30 largest companies.",
    "The stock market hasnt had much to cheer about in a parade of quarterly results since Netflix kicked off the entertainment industrys earnings season two weeks ago.",
    "Shares of all five companies were near 52-week lows lows on Friday, though Warner Bros. Discoverys stock has only been trading since April 4 after of WarnerMedia.",
    "He was referring to metrics used to judge the performance of entertainment and media companies, such as advertising, streaming subscriptions and cable bundling.",
    "Further, if you strip out the two years of pandemic-related market volatility, Disney is trading at levels not seen since December 2018.",
    "The stocks declines are partly related to recent entanglements in hot-button social issues such as Florida Gov.",
    "Disney shares have suffered a 41% decline this year, landing at $108.68 at time of publishing.",
    "Lackluster streaming subscriber growth crimped enthusiasm for Warner Bros.",
    "Discovery, Comcasts NBCUniversal, Amazon, Paramount and AMC Networks.",
    "The company reports fiscal second-quarter results on Wednesday.",
    "Is anything good happening?? analyst Rich Greenfield wrote .",
    "Wall Street has been rattled since on April 19.",
    "As the market collapses, multiples collapse."
  ]
}