{
  "id": 3859,
  "mediaId": 124,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "Utilities push back against growth of rooftop solar panels",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1120w,f_auto,q_auto:best/rockcms/2022-05/220502-mississippi-solar-panels-mn-1415-3486bf.jpg",
  "link": "https://www.nbcnews.com/news/us-news/rooftop-solar-panels-utilities-rcna26726",
  "sentiment": "0.0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Schuppe",
  "authorUrl": "https://www.nbcnews.com/author/jon-schuppe-ncpn75216",
  "termIds": [
    661,
    4589,
    4707,
    3416,
    2661,
    5004
  ],
  "sentences": [
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nRooftop solar is not economic for the majority of customers, and any efforts of the Commission to artificially enhance these economics will be financially shouldered by the non-participating customers,? Mississippi Power said in a February filing.",
    "In Mississippi, the dispute pits environmentalists and solar companies against the states largest utilities, Mississippi Power and Entergy Mississippi, regional monopolies whose business models depend on building power plants and transmission lines that deliver electricity to homes.",
    "One, performed by Lawrence Berkeley National Laboratory in 2017, found that rooftop solars effect on electricity prices will likely remain negligible for the foreseeable future? but that the costs could rise in states with exceptionally high? rates of rooftop solar adoption.",
    "One of the biggest thrills Lynn Krell and her husband felt after they installed solar panels on the roof of their Hattiesburg, Mississippi, home was watching their power meter run backward as their utility credited them for excess power they sold back to the grid.",
    "But as solar power has become cheaper and more widespread, utilities in some states have pushed to curb the payments, said Autumn Proudlove, senior policy program director at the NC Clean Energy Technology Center at North Carolina State University.",
    "The battle is one of several around the country that could determine the future of home solar panels, which advocates say are crucial to weaning the energy system off power sources that emit carbon dioxide, a major cause of global warming.",
    "In North Carolina, utility-backed proposals to change the states relatively generous rooftop solar subsidies have split environmentalists, with opponents saying the plan puts solar customers and installers in financial risk.",
    "Katherine Egland, an environmental justice activist in Gulfport, Mississippi, said utilities are wrong to argue that solar subsidies hurt low-income customers  including people of color  who cant afford the technology.",
    "Rooftop solar has a huge potential? to cut air pollution, create jobs, protect against outages and shrink utility bills, said Mark Jacobson, a professor of civil and environmental engineering at Stanford University.",
    "Bryan Tarnowski for NBC News\nSolar advocates say the rebates are a good idea but wouldnt be enough to spark a wave of new investment in rooftop solar systems, which typically cost homeowners $11,000 to $16,000.",
    "Otherwise, youll have a program with some good parts but not enough oomph to get the market started,? said Will Geise, the Southeast regional director of the Solar Energy Industries Association, a trade group.",
    "Those credits also showed up on their electricity bill, helping to cut their average monthly payments by $11  in addition to the $250 or so they saved during peak summer months by using solar power themselves.",
    "The Krells learned that Mississippi regulations allowed utility companies to buy roof-generated solar power at a small fraction of the retail rate they charge to deliver that power back to customers homes.",
    "Mississippi, which gets a lot of sun, was one of the last states to give subsidies to people who install solar panels on their roofs in 2015, and those subsidies remain among the stingiest in the country.",
    "Mississippi Power argued against the rebates in a February filing to the commission; Entergy Mississippi, which hasnt opposed the rebates, said its acceptance depends on what the final rules say.",
    "They have resisted competition from rooftop panels, in part by asking regulators to limit the financial incentives for customers to install them, saying they are unfair to low-income customers.",
    "In recent filings with the Mississippi Public Service Commission, the companies argued that sweetening solar subsidies would lead to higher costs for customers who cant afford solar panels.",
    "But higher credit rates for excess energy dont appear achievable? in part because of the utilities concerns that they would shift costs to people who dont have rooftop solar, he said.",
    "In January, the Mississippi Public Service Commission proposed new rules that would add $3,000 cash rebates for low- and middle-income customers who install rooftop solar systems.",
    "But there are people who want to have clean energy and the right to self-generate.?\nRepresentatives of Mississippi Power and Entergy Mississippi declined requests for interviews.",
    "We hope that through this process we find a balanced pathway that addresses a lot of the needs of solar advocates and addresses the needs and concerns of utilities,? Bailey said.",
    "Brent Bailey, one of three elected members of the Mississippi Public Service Commission, said in an interview that the proposed rules aim to expand adoption of rooftop solar.",
    "In February, she wrote a letter urging the Mississippi Public Service Commission to require utilities to pay a retail rate in their reimbursements to rooftop customers.",
    "How to fix that is the subject of a fight before the Mississippi Public Service Commission, which is considering rules that would expand subsidies for rooftop solar.",
    "It is such a tremendous feeling not only to be saving money but also saving the planet, as well, and doing our part in reducing carbon emissions,? Egland said.",
    "Despite efforts from solar installers and environmentalists, it seems unlikely that reimbursement rates for rooftop panel owners will increase in Mississippi.",
    "The Krells talked to rooftop solar owners in other states where more generous compensation rules allowed them to offset their entire electricity bills.",
    "The utilities are kicking and screaming, crying foul, saying this is horrible,? said Louie Miller, the Mississippi director of the Sierra Club.",
    "Bryan Tarnowski for NBC News\nAlmost every state offers some kind of credit to rooftop solar owners who send excess power to the grid.",
    "Egland, 70, who is Black, and her husband, 80, are retired, and she said they pay $59 a month to lease solar panels on their roof.",
    "In Florida, the states largest utility persuaded lawmakers to vote to gut the states rooftop solar credits, a measure that Gov.",
    "Most of that power is created by burning fossil fuels, but the utilities are also expanding their own solar offerings.",
    "In California, state regulators, at utilities urging, are considering whether to cut rooftop solar incentives.",
    "The technology will be vital for the U.S. to make the transition to all-renewable energy by 2050, he said.",
    "There are other ways that people who are unable to buy solar panels can still benefit from them, she said.",
    "Its such a low-hanging fruit, such an easy thing to do, to put panels on peoples roofs,? Jacobson said.",
    "I spoke up to the Public Service Commission in the hope that I would not be a lone voice,? Krell said.",
    "For that to happen, the utilities should pay more for power sold back to the grid, the advocates say.",
    "The meter helps regulate and monitor how much electricity her panels are putting back onto the grid.",
    "Their summertime electricity bills have been cut in half, from about $400 to about $200, she said.",
    "Thirty-seven states reimburse at the full retail rate, but Mississippi offers significantly less.",
    "We are really shooting ourselves in the foot by not doing it.?\nThe question is who pays for it.",
    "Breaking news emails\nBe the first to know about breaking news and other NBC News reports.",
    "Lynn Krell doesnt expect to recoup the $19,000 she spent to install solar panels.",
    "What they buy from us should not be of less value than what we buy from them.?",
    "Ron DeSantis, a Republican, vetoed last week, saying it would hurt consumers.",
    "That, experts say, is one of the reasons rooftop solar hasnt caught on there.",
    "A new meter was installed when solar panels were put on Lynn Krells roof.",
    "Some studies have supported the utilities argument, while others havent.",
    "The two other commission members didnt respond to requests for comment.",
    "The commission is expected to vote on the change in the coming weeks.",
    "But eventually the Krells began to question the value of the credits.",
    "That includes reimbursements for solar power she doesnt use.",
    "But she wants rooftop solar to become more affordable.",
    "I want them to push back against the power companies.",
    "But the utilities may have to offer other incentives.",
    "Only 586 Mississippi households have the technology.",
    "Lynn Krell at her home in Hattiesburg.",
    "Im royally ticked,? Krell, 63, said.",
    "They are a monopoly, for Gods sake.",
    "That question remains unsettled.",
    "They have a protected market.",
    "It felt unfair."
  ]
}