{
  "id": 3875,
  "mediaId": 223,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "DeSantis: Disney Does Not Run Florida",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/55/26da936b-89b9-4db0-bc18-159f8ba63715.png",
  "link": "https://townhall.com/tipsheet/saraharnold/2022/05/07/desantis-disney-does-not-run-florida-n2606911",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Arnold",
  "authorUrl": "https://townhall.com/tipsheet/saraharnold/",
  "termIds": [
    661,
    524,
    3508,
    2661
  ],
  "sentences": [
    "During a press conference, DeSantis vowed the woke company will not have its own government in Florida.? adding, the state will no longer subsidize Disneys corporate speech.? He made it very clear he is not bluffing.",
    "pic.twitter.com/KFdM8wDDTs\n Forbes (@Forbes) May 6, 2022\nDeSantis stood firm that the corporation will have to pay its fair share of taxes, and will be held responsible for all of the debt it has tallied up.",
    "Since creating a mass outcry throughout the nation about DeSantis parental rights in education bill,? Disney has lost nearly 63 billion dollars in market capitalization.",
    "While signing the biggest tax relief package in the states history, DeSantis slammed the so-called happiest place on earth? for sexualizing children through its content.",
    "Touting his efforts in leading the country away from indoctrination,? DeSantis continued to stand by his word of protecting children from woke ideologies.",
    "Disney is surely digging its own grave, as even several Disney employees admit that the corporation cares more about money than its company values.",
    "In just one day, his campaign received almost a thousand donations totaling $30,000 to go towards taking Mickey Mouses house down.",
    "They've also pointed out that ticket prices at the park have gone up, while the quality of rides have gone tremendously down.",
    "Ron DeSantis is not backing down from Disney when it comes to the parks special VIP treatment it has been given for years.",
    "Ron DeSantis (R-FL): \"Disney is going to have to live under the same laws that everybody else lives under in Florida.",
    "Disney will pay its fair share of taxes, and Disney is going to be responsible for all the debt it's racked up.\"",
    "Source: AP Photo/John Raoux\nDisney is going to have to play by the same rules as the rest of Florida.",
    "Sources close to the governor say to expect the outline for those proposals in the coming weeks.",
    "People from across the country have showed their support for DeSantis fight against leftism.",
    "The governor has certainly showed Disney whos is charge of the Sunshine State.",
    "It is not only Florida who is done with Disney.",
    "Florida's Gov.",
    "DISNEY: Gov."
  ]
}