{
  "id": 3890,
  "mediaId": 19,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "CBS CEO Responds to Low Morale After Staffers Lament Toxic Working Conditions",
  "image": "https://media.breitbart.com/media/2022/05/cbs1-640x480.jpg",
  "link": "https://www.breitbart.com/the-media/2022/05/07/cbs-ceo-responds-to-low-morale-after-staffers-lament-toxic-working-conditions/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Ng",
  "authorUrl": "https://www.breitbart.com/author/dng/",
  "termIds": [
    661,
    3916,
    4044,
    4306,
    4858,
    88,
    89
  ],
  "sentences": [
    "He also said he was advising managers to schedule no-meeting? days in response to employees complaining that they were often forced to work outside normal business hours and on weekends, and were denied the opportunity to unplug.?\nCheeks memo was followed up by a memo from Khemlani and his CBS News co-president Wendy McMahon, who said thewell-being of every CBS employee is a top priority.?\nWeve heard from many of you that you feel the lines between work time and personal time became blurred when the pandemic began and we were forced to reinvent on the fly how to do our jobs in an unprecedented and difficult environment,? the memo said, according to the Post.",
    "And were mindful of the fact that the past year has being an especially busy time for all of us as we have brought our CBS News and Stations businesses under one umbrella.?\nThe changes come after the Post published a report in January on Khemlanis allegedly ruthless leadership style, which has included brutal cost-cutting measures and micromanagement.",
    "60 Minutes star Lesley Stahl falsely told President Trump in 2020 that Hunters laptop from hell? could not be verified, when in fact it has always been authentic and has since been verified by multiple news outlets.",
    "The network also received flack for burying a YouGov poll showing a majority of Americans believe the January 6 Capitol Hill riot resulted from a protest that went too far? rather than a coordinated insurrection.",
    "Network boss George Cheeks recently sent off a written memo and video message to staff members, pledging to focus more on employee wellbeing, according to a report in the New York Post.",
    "Ron DeSantis (R) backfired after the Publix grocery store chain denied the reports central contention that DeSantis was involved in a pay-for-play scheme with the company.",
    "CBS is reportedly addressing complaints from employees about toxic working conditions, with some pointing the finger at recently installed CBS News chief Neeraj Khemlan.",
    "We need to set a goal [of avoiding] sending emails, texts or otherwise engaging on routine matters after hours or over the weekend,? Cheeks reportedly said.",
    "The Post said the report has prompted several employees to file complaints to human resources and to express their complaints through their agents.",
    "In recent years, CBS News has been caught in embarrassing attempts to slant the news against conservatives.",
    "60 Minutes hit another low last year when its hit piece on Florida Gov.",
    "Follow David Ng on Twitter @HeyItsDavidNg.",
    "Contact me at dng@breitbart.com",
    "Have a tip?"
  ]
}