{
  "id": 3945,
  "mediaId": 1164,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Appeals court temporarily reinstates Florida voting law",
  "image": "https://cdnph.upi.com/svc/sv/upi/9771651877761/2022/1/ba44d50f57086464e273e4a2d507e2ce/Appeals-court-temporarily-reinstates-Florida-voting-law.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/05/06/appeals-court-temporarily-reinstates-florida-unconstitutional-voting-law/9771651877761/",
  "sentiment": "0.0",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Schrader",
  "authorUrl": "",
  "termIds": [
    661,
    879,
    553,
    3288,
    3601,
    2661
  ],
  "sentences": [
    "\"And although the district court satisfied itself that its injunction -- including the requirement that the state preclear new voting rules -- was not too draconian, we are reminded that 'even seemingly innocuous late-in the-day judicial alterations to state election laws can interfere with the administration of an election and cause unanticipated consequences,\" the panel wrote, citing Kavanaugh.",
    "In March, Judge Mark Walker of the U.S. District Court for the Northern District of Florida blocked Florida from enforcing parts of the law that he said intentionally discriminated against Black voters and ordered the state to submit to preclearance when making certain changes to election procedures.",
    "Ron DeSantis signed into law legislation known as Senate Bill 90 which required Florida residents to provide a government identification number such as a driver's license or Social Security number to receive a mail ballot.",
    "The appellate court largely cited Justice Brett Kavanaugh writing a concurring opinion for the Supreme Court in a case between the Democratic National Committee and the Wisconsin State Legislature.",
    "The judges said that when the district court issued its injunction, \"voting in the next statewide election was set to begin in less than four months\" and that local elections were ongoing.",
    "\"At some point, when the Florida Legislature passes law after law disproportionately burdening Black voters, this court can no longer accept that the effect is incidental.\"",
    "Circuit Court of Appeals on Friday temporarily reinstated a Florida voting law that had been declared unconstitutional by a federal judge ahead of the midterm elections.",
    "The judges on the circuit court panel -- Kevin Newsom, Barbara Lagoa and Andrew Brasher -- were all appointed by former President Donald Trump.",
    "The League of Women Voters and other civil rights groups sued Florida in a bid to stop the law, claiming it disenfranchised minority voters.",
    "It also restricted ballot drop boxes to early voting and prevented groups from providing voters with food and water while in line to vote.",
    "Florida appealed and requested a stay from the three-judge panel of the 11th Circuit court pending the decision on the appeal.",
    "\"After careful consideration, we grant the state's motion,\" the judges wrote in their stay order.",
    "\"Florida has a grotesque history of racial discrimination,\" Walker said.",
    "May 6 (UPI) -- The 11th U.S.",
    "Last May, Gov."
  ]
}