{
  "id": 3976,
  "mediaId": 223,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Fact-Checker's Own Website Proves DeSantis Accurate in 'Mostly False' Entry",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2022/125/66fbb8d3-a712-4029-9ed3-329460992e27.png",
  "link": "https://townhall.com/columnists/bradslager/2022/05/05/factcheckers-own-website-proves-desantis-accurate-in-mostly-false-entry-n2606845",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Slager",
  "authorUrl": "https://townhall.com/columnists/bradslager/",
  "termIds": [
    661,
    683,
    1024,
    1223,
    2517,
    4057,
    4161,
    4590,
    3195
  ],
  "sentences": [
    "https://t.co/bciCJDWGGP\n The New York Times (@nytimes) May 5, 2022\n- \"It is unclear what role his childhood  coming up in a time and place in which there was hardly a free exchange of ideas and where government misinformation was used to demonize Black South Africans  may have played in that decision.\"",
    " Tom Gara (@tomgara) May 5, 2022\nBody Checking the Fact-Checkers  CNN\nInstead of looking into administration issues, such as the WH Press Secretary claiming schools are segregating LGBT+ students, CNN's Daniel Dale decided he needed to fact check some Republicans on an issue from last Fall, no less.",
    "While very technically true, the NSBA did say this and asked for the Patriot Act and other agency directives to be employed, and to go along, the DOJ did send agents out from the domestic terrorism division to monitor school board meetings.",
    "More on @PolitiFact: https://t.co/QSSsXSlscf\n Yacob Reyes (@yacob_reyes) May 5, 2022\nPre-Written Field Reports  CNBC\nThe news of the SCOTUS leak that shows a possibility of Roe vs. Wade being overturned has many in the country on edge.",
    "It would appear that The Times became appraised of the conflicting nature of the headline and premise of the article, with the evidence and testimony showing a completely different side of the man in their crosshairs.",
    "After finding that few companies were issuing statements about the news, writers Melissa Repko and Lauren Feiner and their staff reached out to a large number of companies, hoping to provoke comment.",
    "You would think including Disney on their list would have triggered a reason in their minds for the hesitation, but then I am not a business reporter reaching out to dozens of corporate PR divisions.",
    "CNBC Pushes Corporate Signaling as Companies Run Away From SCOTUS Abortion Issue\nhttps://t.co/Vd6VVxnWmC\n RedState (@RedState) May 5, 2022\nPresentation Paradox  THE NEW YORK TIMES (Pt.",
    "Legalized Press-titution  MSNBC\nIt was made official today that Jen Psaki will be leaving her position at the White House, and she will be replaced by Karine Jean-Pierre.",
    "1)\nFresh off its hot epic takedown of Tucker Carlson this weekend  who, by the way, is still on the air in the #1-rated position  The Times went after Elon Musk.",
    "Dale resorts to a lame method, where a particular detail can be picked out and shown to be wrong, and therefore the entire story is to be tossed out.",
    "We'll look to bring accountability to the mishaps, malaprops, misdeeds, manipulations, malpractice, and manufactured narratives in mainstream media.",
    "Governor Ron DeSantis recently gave a speech where he declared that \"the student debt that is out there, almost 60% of it is graduate school debt.\"",
    "With such a hot-button third-rail issue generating extreme passions, it is understandable that any company would want to refrain from commenting.",
    "- \"Dozens of companies, including Walmart, American Airlines and Disney, have yet to issue statements or respond to CNBC requests for comment.\"",
    "First, DeSantis Press Secretary Christina Pushaw revealed she was contacted by the site, asking where the governor found such a statistic?",
    "Then this piece came out today  after writer Yakob Reyes had said he was on a quick deadline  and he performed just as poorly as expected.",
    "Elon Musk grew up in elite white communities in South Africa, detached from apartheids atrocities and surrounded by anti-Black propaganda.",
    "Then, if any Republican is to cite said story, they are automatically trafficking in \"misinformation\" for using a \"debunked\" story.",
    "This means that the current press secretary is leaving to go to MSNBC, and the new press secretary steps in after working at MSNBC.",
    "\"Riffed from the Headlines\" is Townhall's daily VIP feature with coverage of the deeply flawed aspects of journalism in the nation.",
    "Ron DeSantis said: the student debt that is out there, almost 60% of it is graduate school debt.?\nWe found his claim Mostly False.",
    "The paper leaned heavily on the Apartheid/racist side of things, with a nice side dish of the piping hot issue of misinformation.",
    "Next, Christina predicted that DeSantis saying \"About 60%\" when the actual figure was 56% would become graded as \"Mostly False.\"",
    "Then, some of the most revealing evidence they have in the piece  shows Elon to be a pointedly not-racist type of individual.",
    "At issue is the case of a national school board group trying to get the Feds to stop parents from shouting at meetings.",
    "He sees his takeover of Twitter as a free speech win but in his youth did not suffer the effects of misinformation.",
    "Jean-Pierre will be the first Black woman to hold the position, as well as the first openly gay press secretary.",
    "PolitiFact decided this needed to be verified, and thus begins another round of a DeSantis Debunking Debacles.",
    "Dale calls the story false because Attorney General Merrick Garland never called school parents \"terrorists.\"",
    "NEW: President Biden names Karine Jean-Pierre as the new White House press secretary, replacing Jen Psaki.",
    "Later in the day, some quiet edits were discovered to have occurred in the deeply important profile.",
    "Only a cynic and a crank would suggest there is any kind of conflict of interest to be found.",
    " Peter Hamby (@PeterHamby) May 5, 2022\nStealth Story Evolution  THE NEW YORK TIMES (Pt.",
    "05.05.22\nBody Checking the Fact-Checkers  POLITIFACT\nThis one was a while in coming.",
    "Pushaw gently had to direct the intrepid fact-checker tohis own website.",
    "2)\nMaybe the editing should take place BEFORE publication?",
    "This is not something reporters at CNBC can understand.",
    "https://t.co/WVqnmSb7oT\n MSNBC (@MSNBC) May 5, 2022",
    "In other words, it is a rather valid story.",
    "Gov."
  ]
}