{
  "id": 3994,
  "mediaId": 136,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Florida Teacher Fired for Discussing Sexual Orientation Sparks Debate",
  "image": "",
  "link": "https://www.newsweek.com/florida-teacher-fired-discussing-sexual-orientation-pansexual-sparks-debate-1703691",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gerrard Kaonga",
  "authorUrl": "https://www.newsweek.com/authors/gerrard-kaonga",
  "termIds": [
    661,
    4138,
    539,
    3202,
    3450,
    3508,
    2661,
    4944,
    5117
  ],
  "sentences": [
    "The bill's entire seven pages essentially establish into law the idea that \"classroom instruction by school personnel or third parties on sexual orientation or gender identity may not occur in kindergarten through grade 3 or in a manner that is not age appropriate or developmentally appropriate for students in accordance with state standards.\"",
    " ' #FAAFOhttps://t.co/d2ex6IW6WM\n Vic DeGrammont (@votedegrammont) May 5, 2022\n\"Florida middle school teacher blames 'Don't Say Gay' bill for being fired after she told students she is pansexual and got them to draw gay pride flag,\" Former Florida GOP Congressional Candidate, Vic DeGrammont tweeted.",
    "Advocates in the community have argued it will be used to silence LGBTQ+ people, while supporters of the legislation say young children shouldn't be taught about sexuality while in school.",
    "The bill prevents topics including sexual orientation and gender identity from being taught to the state's youngest students and resulted in significant backlash from the LGBTQ+ community.",
    "Scott also said children asked to draw pictures illustrating their sexuality, but after putting them up on display she was asked to remove them by the school staff before she was fired.",
    "\"This pansexual middle school teacher was fired for letting her students draw LGBTQ flags, answering their questions about her,\" Florida Congress candidate Dr. Cindy Banyai tweeted.",
    "The Cape Coral art teacher, Casey Scott, was employed at Trafalgar Middle School and said that she and her students were discussing sexuality and she told them she was pansexual.",
    "Florida is serious about protecting the sexual innocence of students,\" former Director of Issues Analysis for the American Family Association Bryan Fischer tweeted.",
    "The Teachers Union of Lee County president, Kevin Daly, also explained that Scott could legally be fired and confirmed she didn't belong to the teachers' union.",
    "Florida middle school teacher blames 'Don't Say Gay' bill for being fired after she told students she is pansexual and got them to draw gay pride flag.",
    "https://t.co/kV5cg9DAtB\n Dr. Cindy Banyai for Congress FL19 (@Cindy_Banyai_FL) May 4, 2022\n\"This is Florida, only one month into Don't Say Gay.",
    "\"So [the school] fired a middle school teacher for telling her class she's pansexual,\" Florida high school activist Jack Petocz tweeted.",
    "Her termination has sparked a debate on social media about free speech as well as the state's attitude to discussions around sexuality.",
    "This pansexual #SWFL middle school teacher was fired for letting her students draw #LGBTQ flags, answering their questions about her.",
    "\"A lot of the kids came up to me and said I'm non-binary and a couple kids said I'm bi and one kid said they were gay.\"",
    "NBC2 News said that the Lee County School District showed them complaints from parents and students over the activity.",
    "This comes after Florida Republican Governor Ron DeSantis signed the so-called \"Don't Say Gay\" bill into law in March.",
    "She added that the school told her \"it would be in [her] best interest if she got rid of these [pictures] now.\"",
    "Scott did so and also took pictures after she had scrunched up the pieces of paper and thrown them in the bin.",
    "On Twitter, some people praised the school for their actions to fire Scott while others condemned the school.",
    "\"A discussion happened in class and because of that now I'm fired,\" Scott said, while speaking to NBC2 News.",
    "After being sent home she got a call saying that the school was releasing her from her contract.",
    "She went on to say that some of the students asked to create art expressing their sexuality.",
    "A Florida teacher said she was fired because she spoke to her students about her sexuality.",
    "Scott added that some of the students wondered about her and asked her sexual orientation.",
    "He added that \"During that probationary period they can let you go without cause.\"",
    "\"I am pansexual, I like anyone despite female, male,\" Scott told NBC2 News.",
    "Ron DeSantis, Florida GOP are using culture wars to consolidate power.",
    "Ron DeSantis, Florida GOP are using culture wars to consolidate power.",
    "Stop policing our education and bowing to parental fringe groups.",
    "After they did this she hung the pictures on her classroom door.",
    "Keep playing with our children, and more of this will happen.\"",
    "Keep playing with our children, and more of this will happen.",
    "Newsweek has contacted Trafalgar Middle School for comment.",
    "\"This is the reality of queer people in Florida.",
    "Only one month into Dont Say Gay.",
    "She can't say she wasn't warned.",
    "We must stop them.\"",
    "We must stop them.",
    "This is Florida.",
    "\"Well deserved.",
    "Well Deserved!",
    "#SayGay."
  ]
}