{
  "id": 4115,
  "mediaId": 558,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Crypto-Backed Mortgages on the Rise Despite Crypto Market Pullback",
  "image": "https://s.yimg.com/ny/api/res/1.2/6.mD6MyYZyU9exuDqhOUlg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/aR8pR9MtpF2OFeky96GXwA--~B/aD00MTA7dz02MTU7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/fx_empire_176/0900bbfa45466ed80f48a64e5bbb888a",
  "link": "https://nz.finance.yahoo.com/news/crypto-backed-mortgages-rise-despite-015541601.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Mason",
  "authorUrl": "",
  "termIds": [
    661,
    4442,
    3144,
    3654,
    2661,
    2945
  ],
  "sentences": [
    "With Bitcoin and the broader market showing a strong correlation with the NASDAQ and the Fed about to embark on a journey toward monetary policy normalization, crypto-backed mortgages could be in for a hard landing.",
    "The report highlights that a Miami startup is racing to securitize home loans with cryptocurrency.\nFlorida-based digital bank Milo is accepting crypto to secure home loans.",
    "Weiss Ratings Sounds Alarm Bell over Crypto-Backed Mortgages\nOn Tuesday, Weiss Ratings published an article raising concerns over crypto-backed mortgages.",
    "Powered by Stacks (), CityCoins is a protocol that enables smart contracts on the Bitcoin network.? Miners can forward STX into the Stacks protocol.",
    "US house prices have also risen sharply, while mortgage rates have surged in response to inflation and market sentiment toward Fed monetary policy.",
    "The demand is unsurprising when considering homebuyers can borrow up to 100% of the purchase price, with mortgage rates as low as 3.95%.",
    "With the State of Florida and the City of Miami looking to become an innovative crypto hub, Weiss Ratings sounds the alarm bell.",
    "In April, FX Empire that XBTO was in the process of completing a multi-million-dollar Bitcoin-collateralized mortgage in Miami.",
    "Milo plans to expand this further by offering these as mortgage-backed securities to asset managers and insurance companies.",
    "In the final week of April, US mortgage rates stood at 5.10%, up a whopping 212 basis points compared with April 2021.",
    "While house prices and mortgage rates have been on the risen, Bitcoin (BTC) and the broader crypto market have fallen.",
    "The increase in crypto-backed mortgages comes despite a bearish start to 2022, raising concerns for one rating agency.",
    "Homebuyers dont need to sell their crypto, with Milo accepting Bitcoin, Ethereum (), and stablecoin as collateral.",
    "Crypto-backed mortgages are the latest product to hit the US housing market, which enjoyed a stellar 2021.",
    "The City of Miami also launched MiamiCoin () in June 2021, the first CityCoins to market.",
    "Weiss Ratings refers to the pooling of risky home loans and the Great Recession of 2009.",
    "Homebuyers can avoid capital gains tax by placing crypto as collateral for home loans.",
    "Increased crypto adoption has given rise to digital asset banks and mortgage lenders.",
    "Mayor Francis Suarez and Florida State Governor Ron DeSantis are crypto advocates.",
    "In January, Mayor Suarez that he would take his first three paychecks in BTC.",
    "In February, the S&P/CS HPI Composite  20 n.s.a was up 20.2% year on year.",
    "Following Milo into the crypto-backed mortgage space is crypto firm XBTO.",
    "CityCoins miners receive 70% of all stacked STX tokens in MiamiCoin.",
    "The City of Miami is particularly active in the digital asset space.",
    "Key Insights:\nIn the US, crypto-backed mortgages are on the rise.",
    "Miners can then mine the rewarded MIA to earn BTC rewards."
  ]
}