{
  "id": 4117,
  "mediaId": 65,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Hillary Clinton mocked for maskless Met Gala photos while being doted on by masked staff",
  "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/05/1862/1048/2022-05-03T033216Z_596781537_HP1EI5309TPE9_RTRMADP_3_FASHION-MET-GALA.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/media/hillary-clinton-mocked-maskless-met-gala-photos-while-being-doted-masked-staff",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1158,
    3843,
    4049,
    4473,
    539,
    3408,
    2826,
    2945
  ],
  "sentences": [
    "The failed presidential candidate was all smiles, posing for the camera without wearing a mask, while a masked African American gentleman  who appeared to be one of the events staff  doted on her, adjusting her dress.",
    "The Spectator contributing editor Stephen L. Miller similarly mocked Clintons attendance at the gala in light of the Supreme Court leak, \"Hillary partying with elite celebrities as this leaks is absolutely perfect.",
    "British journalist Dominique Samuels shared the photo, tweeting, \"So thats what the Covid theatre was really about Have the elite swanning around able to show their faces whilst the lowly servers must mask up.\"",
    "Ron DeSantis spokesperson Christina Pushaw, referencing the SCOTUS opinion draft leak on Roe v Wade that immediately overpowered all other news stories after it dropped Monday evening.",
    "Referencing the liberal trend to view the gesture as a symbol of white supremacy, Cheong tweeted, \"Hillary Clinton flashes the white power gesture at the Met Gala.",
    "Cheong also mocked another photo of Clinton from the gala, one which showed her flashing an \"OK\" hand gesture to someone off-screen at the event.",
    "Conservative vlogger Blaire White commented on Kashuvs post, tweeting, \"This photo should be in history books that discuss Covid regulations.\"",
    "[Hillary] spent more time with the cast of Hamilton and Hollywood than she spent in Wisconsin in 2016 and here we are,\" he stated.",
    "A photo of Hillary Clinton attending the Met Gala received some brutal reaction from Twitter users on Monday evening.",
    "\"This photo perfectly encapsulates the current state of our country,\" tweeted conservative commentator Kyle Kashuv.",
    "\"From the Antebellum South, to Jim Crow, to modern America, Democrats haven't really changed all that much.",
    "Right-wing radio host Austin Petersen remarked on what he perceived as the photos racist connotations.",
    "The photo depicted Clinton walking the red carpet at the celebrity-studded event in a red ball gown.",
    "Conservative radio host Ari Hoffman blasted the image, tweeting, \"The elites at the Met Gala.",
    "\"They are better than you,\" commentator Ian Miles Cheong tweeted in response to the photo.",
    "Critics slammed the image as the perfect encapsulation of elitist privilege.",
    "\"Well, the leak was certainly well-timed to distract from this,\" wrote Gov.",
    "One said it looked like something out of \"The Hunger Games.\"",
    "Truly sickening @HillaryClinton,\" Samuels added.",
    "\"Its like something out of the Hunger Games.",
    "#HillaryClinton,\" he tweeted.",
    "Hiding in plain sight.\"",
    "This pic sums it up.\""
  ]
}