{
  "id": 4181,
  "mediaId": 302,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Pasco school employees, district agree on contract. Talks lasted 8 months.",
  "image": "https://www.tampabay.com/resizer//gGutvg0d5WSJAgTzp-sy5e7yyCM=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/RUK5OSUYLFG4DKNGURESDH2MOM.jpg",
  "link": "https://www.tampabay.com/news/education/2022/05/02/pasco-school-employees-district-agree-on-contract-talks-lasted-8-months/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "When meeting Friday, representatives for the United School Employees of Pasco had requested an extra bump for those workers, noting 4 percent is less for people making below $15 an hour than it is for teachers who earn more than $40,000 a year.",
    "We will continue to try to negotiate for additional salary.?\nFor the support staff, union negotiator Lynn Cavall said she was gratified that the district took steps to meet the needs of workers at the low end of the scale.",
    "They had agreed to wait until after the state distributed updated funding information in January, at which point the district learned it had less money to put into pay than it had anticipated.",
    "Tom Neesham, the districts negotiator for the support staff contract, predicted those employees will likely see the biggest impact? in their pay in the coming year.",
    "The terms also guarantee teachers will receive a permanent raise of about 2.7 percent on or about the first day of their next contract, which begins in August.",
    "LAND OLAKES  After eight months of talks, Pasco County school teachers and support staff have a tentative contract deal for the year that ends within weeks.",
    "The important piece is that, as weve said from the beginning, this is not a good year,? said Nora Light, the districts teacher contract negotiator.",
    "Our teachers deserve more.?\nJeff Larsen, who represented the union, said he was disappointed not to have gotten teachers a raise this year.",
    "The agreement will provide 4 percent one-time supplements across the board, with the paychecks expected to be delivered some time in June.",
    "Negotiators for both sides said they were pleased to have concluded the bargaining, which lasted longer than in any other year in memory.",
    "Its critical to improve their pay, he said, so we can compete to keep our best employees here.?\n  \nSign up for the Gradebook newsletter!",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "Full-time workers at the lowest end of the salary scale will be guaranteed a supplement of at least $700, before taxes.",
    "She looked forward to quickly returning to the table to begin discussing a living wage? for the staff moving forward.",
    "That amount will come from the states budgeted salary increase allocation, if Gov.",
    "Offering a supplement instead of a raise is not what the district ever intended.",
    "That is not the end of the 2022-23 negotiations,? he said.",
    "He was encouraged about the raise guarantee for August.",
    "Ron DeSantis signs it as expected.",
    "Click here to sign up."
  ]
}