{
  "id": 4193,
  "mediaId": 136,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Steven Crowder Tells Teachers Not to Be Groomers During Appreciation Week",
  "image": "https://d.newsweek.com/en/full/2029383/new-york-city-schools-vaccination-mandate-temporarily.webp?w=790&f=018ba466eef83fd1f1e2178fe5b43ee2",
  "link": "https://www.newsweek.com/steven-crowder-tells-teachers-do-not-groomers-during-appreciation-week-1702670",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emma Mayer",
  "authorUrl": "https://www.newsweek.com/authors/emma-mayer",
  "termIds": [
    661,
    3957,
    4868,
    122,
    539,
    3431
  ],
  "sentences": [
    " John Pavlovitz (@johnpavlovitz) May 2, 2022\nThe Rape, Abuse, and Incest National Network defined the term grooming as \"manipulative behaviors that the abuser uses to gain access to a potential victim, coerce them to agree to the abuse, and reduce the risk of being caught.\"",
    "On the opposite side, John Pavlovitz, an author and pastor, tweeted on Monday, \"A reminder: It's #TeacherAppreciationWeek and Republicans have spent the past five years assaulting our education system and several months accusing teachers of grooming.",
    "Some conservatives have used the term groomermore recently in the last several months, accusing those who want to educate students on gender identity and sexual orientation of trying to \"groom\" and sexualize children.",
    "In March, Florida Governor Ron DeSantis' press secretary Christina Pushaw wrote on Twitter, \"The bill that liberals inaccurately call 'Don't Say Gay' would be more accurately described as an Anti-Grooming Bill.",
    "Crowder, a former Fox News contributor who has 5.63 million followers on YouTube and 1.6 million followers on Twitter, has previously made headlines after being accused of using racist and homophobic language.",
    "John Fuglesang, a comedian, actor and political commentator, joked online on Monday that in honor of Teacher Appreciation Week, DeSantis \"is celebrating\" by \"taking 7 days off from calling them 'groomers.'\"",
    "One educator, Sari Beth Rosenberg, wrote, \"Let's make teaching a profession that no longer needs a #TeacherAppreciationWeek because we finally receive the pay & respect that we deserve.\"",
    "On Monday, he tweeted, \"The best way to appreciate the good teachers out there is to point out and punish the others who are out trying to corrupt and groom our children.\"",
    "A reminder: It's #TeacherAppreciationWeek and Republicans have spent the past five years assaulting our education system and several months accusing teachers of grooming.",
    "Despite the accusations of grooming behavior, teachers are using the week to point out the pay disparity and hardships they have faced since the pandemic.",
    "The best way to appreciate the good teachers out there is to point out and punish the others who are out trying to corrupt and groom our children.",
    "Conservative commentator Steven Crowder took to Twitter on Monday in honor of Teacher Appreciation week, telling teachers to not be groomers.",
    "If you're against the Anti-Grooming Bill, you are probably a groomer or at least you don't denounce the grooming of 4-8 year-old children.\"",
    "One user replied, \"Thank you for recognizing that some of us are still trying to do our actual job and teach kids, not indoctrinate them!\"",
    "Some of the rhetoric has been spurred on by Florida's HB 1557 law which critics have dubbed the \"Don't Say Gay\" legislation.",
    "Newsweek reached out to Steven Crowder and the National Education Association, a labor union for teachers, for for comment.",
    "\"Maybe teachers and people who love and appreciate them and their students shouldn't vote Republican.\"",
    "You've said a lot of stuff on your show that groups the good with the bad when it comes to teachers.\"",
    " Steven Crowder (@scrowder) May 2, 2022\nMany users on Twitter were appreciative of Crowder's stance.",
    "Maybe teachers and people who love and appreciate them and their students shouldn't vote Republican.",
    "He added the hashtag, TeacherAppreciationWeek, and continued, \"not Groomer Appreciation Week.\"",
    "Another wrote, \"I'm glad you are saying there are good teachers out there.",
    "#TeacherAppreciationWeek not Groomer Appreciation Week."
  ]
}