{
  "id": 4194,
  "mediaId": 65,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "DeSantis accuses Disney of cozying up to CCP, making 'a fortune' without mentioning atrocities",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/cc987b04-6d5d-4148-867d-1a386f86b94b/e79ae65d-c4ca-4dfd-83f3-626e001e4433/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/desantis-accuses-disney-cozying-china-atrocities",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly Laco",
  "authorUrl": "https://www.foxnews.com/person/l/kelly-laco",
  "termIds": [
    661,
    2087,
    112,
    524,
    611,
    2661,
    2863,
    2945
  ],
  "sentences": [
    "Ron DeSantis and Disney continues as the governor slammed the company for profiting off of its relationship with Communist China, without condemning its human rights abuses, and warned that the country is \"flexing muscle\" over the Western Hemisphere in part due to President Biden's \"floundering\" leadership.",
    "\"Disney has done a lot to partner with the Chinese Communist Party (CCP) and has really made a fortune over there without raising a peep about any of their atrocities,\" DeSantis said Monday during a press conference announcing $30 million for manatee protection.",
    "\"I think that we need to have strong alliances with the Japanese, South Koreans, I think India needs to be in our orbit to try to check China's influence around the world, but particularly when you start talking about the Western Hemisphere, it's a big problem.",
    "DESANTIS BLASTS DISNEY EXECS' ATTACK ON PARENTS: WALT DISNEY WOULD NOT WANT THAT\nDeSantis continued to say that Chinese President Xi Jinping is \"tougher\" than any leader China has ever had, which makes the country even more hostile to the U.S. and its allies.",
    "But we have somebody who clearly isn't capable of exercising the type of leadership on the world stage that is going to inspire confidence from our allies and that is going to inspire fear from our adversaries.\"",
    "The new legislation bans Florida school employees or third parties from giving classroom instruction on \"sexual orientation\" or \"gender identity\" in kindergarten through third grade.",
    "Despite their activism on the parental rights bill, Disney has garnered criticism for remaining silent on the ongoing Uyghur Muslim genocide in China  even as they film movies there.",
    "DeSantis responded to a question about how the U.S. could fix its image on the world stage: \"It's sad, but we have a floundering president, there's no leadership right now.",
    "In addition, DeSantis signed legislation last month stripping Walt Disney World of a decades-old special agreement that allowed the theme park to govern itself.",
    "\"It's a hostile regime and their influence in our hemisphere is not something that is in the best interest of the United States of America,\" he said.",
    "I think you've had the ruling elite in this country for decades have basically done all they can to elevate China.",
    "Disney did not immediately respond to Fox News Digital's request for comment on DeSantis' remarks.",
    "The governor said Putin's invasion of Ukraine was a result of a projection of American weakness.",
    "The Walt Disney Company has used its voice to campaign against DeSantis parental rights law.",
    "The governor also took a shot at Biden and his \"floundering\" leadership against the CCP.",
    "\"I think China is the number one geopolitical threat that this country faces,\" he said.",
    "But it's made our country weaker, it's eroded our industrial base,\" the governor said.",
    "It's not just South America, you see them in the Caribbean flexing their muscle.\"",
    "\"[Putin] would not have done that if he didn't think Biden was a pushover.\"",
    "\"So, we need to get real here and understand that China's a threat.",
    "That's just the reality, I wish that wasn't the case.",
    "And a lot of them made a fortune off it.",
    "The feud between Florida Gov."
  ]
}