{
  "id": 4210,
  "mediaId": 223,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Dispatches from the Journo Cotillion Show They Have Learned Little of Their Demise",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2022/122/b22b151d-02b3-4f8d-83b4-b114d434f94f.png",
  "link": "https://townhall.com/columnists/bradslager/2022/05/02/dispatches-from-the-journo-cotillion-show-they-have-learned-little-of-their-demise-n2606639",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Slager",
  "authorUrl": "https://townhall.com/columnists/bradslager/",
  "termIds": [
    661,
    1304,
    2087,
    2282,
    4210,
    4531,
    517,
    3410
  ],
  "sentences": [
    "There have been all types of conflicting commentaries about the Biden administration forming a Disinformation Governance Board, with those in the press praising such an onerous entity, with the pragmatic minds seeing it as a nefarious attempt to have the government controlling accepted narratives.",
    "@donlemon, Dr. #TonyFauci, and @CapehartJ at the 2022 White House Correspondents' #GardenBrunch @whca pic.twitter.com/JmRkVZo0rq\n White House Insider (@whcinsider) April 30, 2022\nRushing to the defense of the vacillating virus expert was today's Politico Playbook, explaining it all for us.",
    "Lifetime Subscriber to CNN+ (@MartiniShark) May 1, 2022\nArtisanally-Crafted Narrative  MIAMI HERALD\nOne of the not-surprising segments of the night was Trevor Noah using the event to scorch the media's new favorite target, Florida Governor Ron DeSantis.",
    "Cupp (@secupp) April 29, 2022\nA great theory, but her Cupp runneth under once you realize she is seemingly oblivious that Musk being born in South Africa means her conspiracy is unwound by Article II, Section 1, Clause 5 in the Constitution.",
    "She attempted to draw a horror-film scenario of the event  which she attended willingly, mind you  but then managed to forget she had previously raved about the glamor shot moment she experienced while gushing over her fashions.",
    "Normally when we see a terrorist or other dangerous political figure meeting their demise, the press sneaks out a sympathetic obituary before tweaking it, following reactions from the public pointing out their sympathies.",
    "This time, however, with the passing of a homicidal member of the Weather Underground, the paper put out an accurate synopsis of the life of Kathy Boudin before altering the text to frame the killer in a softer presence.",
    "- \"At the 27th Annual White House Correspondents Weekend Garden Brunch, the most buzzworthy attendee was Anthony Fauci, who said earlier this week that he would not attend the dinner over Covid concerns.",
    "Read more: https://t.co/9bZ2cSzoxz\n POLITICO Press (@POLITICOPress) May 2, 2022\nBlue Anon  CNN\nIgnoring the Constitution in order to build up a conspiracy claim over the current villain of journalists.",
    "05.02.22\nLegalized Press-titution  WHITE HOUSE CORRESPONDENTS ASSOCIATION\nSaturday night brought the return of the one-time annual event known as the \"Nerd Prom,\" the White House Correspondents Dinner.",
    "(@ChristinaPushaw) May 1, 2022\nDNC PR Firm  POLITICCO\nAs we covered on Friday, Dr. Anthony Fauci caused a stir by electing to not attend the Correspondents Dinner out of Covid caution.",
    "Now, we see Doc Tony changing course yet again, as he was spotted at some of the preparties on Saturday, maskless and snuggling up close to media celebrities like Don Lemon.",
    "Yes, we need to be fairto the man who cannot keep his own narrative straight and gives numerous contradictions about the settled science within the span of just a few days.",
    "The good news is that if @BrianStelter is supporting this state-run thought crime agency, it means that this whole enterprise is likely to blow up in about 3 weeks.",
    "Noah repeatedly referenced DeSantis as being in attendance as he bravely hurled insults from the bully dais, receiving supportive laughter from the journalists.",
    "Lifetime Subscriber to CNN+ (@MartiniShark) May 2, 2022\nStealth Story Evolution  THE NEW YORK TIMES\nCannot offend the violent extremist activists, after all.",
    "We'll look to bring accountability to the mishaps, malaprops, misdeeds, manipulations, malpractice, and manufactured narratives in mainstream media.",
    "\"Riffed from the Headlines\" is Townhall's daily VIP feature with coverage of the deeply flawed aspects of journalism in the nation.",
    "CNN's Brian Stelter is among the former group, and he cannot fathom why anyone would oppose such a common-sense proposal as this.",
    "Its May 2, just over six months until the midterm elections, which are generally a referendum on the presidents performance.",
    "The Miami Herald's David Smiley wanted desperately for the governor to have been there, providing what he considered proof.",
    "This decision flew directly in the face of his comments the day prior, when he declared we were out of the pandemic phase.",
    "Trevor Noah was the speaker, and President Biden was in attendance, forcing his way through the scripted mirth-free jokes.",
    "These same arbiters of the facts seemed unable to contest one piece of reality  Ron DeSantis did not attend the event.",
    "Anti-Social Media  CNN\nIs anyone really shocked that Brian Stelter would cheer a thought crime state-run agency?",
    "Cupp thought she had her knee on the pulse of the whole recent uproar over the Twitter purchase last week.",
    "However, with 2,600 in attendance, no one managed to get a quote or a picture of DeSantis the whole night.",
    "As the governor's press secretary attested, there was sound reason for this lack of evidence.",
    "To be fair, the Saturday brunch had considerably fewer attendees and was held outside.\"",
    "The best takeaway of the night might be from Jada Yuan of the Washington Post.",
    "@playbookdc looks at how it happened, and how he hopes to prevent a wipeout.",
    "Yeah, you sure look terrified, as you send out this virtue signaling post.",
    "https://t.co/JgvmfuDFJd pic.twitter.com/KfzQmuF2G3\n Brad Slager ????????",
    "Lol he wasnt there, why would he go to that\n Christina Pushaw ??",
    "This is the type of content fitting for CNN+.",
    "https://t.co/S1qKR3fkUA\n Brad Slager ????????",
    "Credit to The Times for bucking the pattern.",
    " Stephen L. Miller (@redsteeze) May 2, 2022",
    "Biden is in rough shape.",
    " S.E.",
    "S.E.",
    "????"
  ]
}