{
  "id": 4227,
  "mediaId": 65,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "WaPo reporter caught maskless at White House Correspondents' Dinner despite expressing COVID fears",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/5b8166c4-bbe1-46e1-83fb-d7fb140111be/10b54cae-8b27-4e1f-aa17-24168d609d6f/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/washington-post-reporter-caught-maskless-white-house-correspondents-dinner-covid-fears",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Gillespie",
  "authorUrl": "https://www.foxnews.com/person/g/brandon-gillespie",
  "termIds": [
    661
  ],
  "sentences": [
    "Whats insane is you feeling compelled to both attend and then stay..\" wrote Fox Nation host Piers Morgan, while writer Bethany Mandel likened Juan's reaction about the event's crowd to \"mental illness.\"",
    "Journalist Ksenija Pavlovic McAteer pointed out that attendance at the event was voluntary, while American Majority CEO Ned Ryun wrote, \"I am so sorry that you were forced to go and then held hostage.",
    "A Washington Post reporter was caught maskless at the White House Correspondents' Dinner on Saturday despite complaining about the crowd and expressing fears about the spread of the coronavirus.",
    "Creeping sense that youre the only one who know this is insane,\" Jada Yuan wrote on Twitter during the event, including a picture that showed a crowd of people seated at tables close together.",
    "Critics took to social media to mock Juan, with some pointing out the maskless photo, and others her decision to attend the event and remain there despite her expressed concerns.",
    "Democratic strategist Madeline Conway argued that by Juan's logic \"people would literally sit inside their homes doing nothing forever.\"",
    "Yuan was, however, later seen in a photo taken at the event showing her maskless, smiling and standing in a crowd of people.",
    "Cooke, senior writer at the National Review, with Christina Pushaw, press secretary for Republican Florida Gov.",
    "c) as a reporter roaming the party, I felt the crush of the crowd more than those sitting at tables.",
    "Saturday's dinner was the event's first following a two-year hiatus due to the coronavirus pandemic.",
    "Juan responded to the criticism on Sunday, writing, \"A few things: a) I was on assignment to cover.",
    "Ron DeSantis, responding with the maskless photo of Juan and saying, \"Doesn't look like it.\"",
    "Fear of breathing near people but people are everywhere.",
    "b) everyone was vaxxed, boosted & same-day tested.",
    "d) my sense of doom is no judgment on anyone else.",
    "Literally getting trapped between tables.",
    "\"This room is like a horror film.",
    "\"Were you being held hostage?\"",
    "wrote Charles C.W.",
    "Live your life!\"",
    "\"Do get a grip.",
    "No exits.",
    ".\"",
    "."
  ]
}