{
  "id": 4270,
  "mediaId": 19,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "HBOs John Oliver: Disney Should Pay More Taxes but Not Because of Dipsh*t DeSantis",
  "image": "https://media.breitbart.com/media/2022/05/johnoliverdesantisdisney1-640x480.jpg",
  "link": "https://www.breitbart.com/entertainment/2022/05/02/john-oliver-disney-should-pay-more-taxes-but-not-because-of-dipsht-desantis/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Ng",
  "authorUrl": "https://www.breitbart.com/author/dng/",
  "termIds": [
    661,
    4275,
    4780,
    524,
    3338,
    2661,
    2849,
    2944
  ],
  "sentences": [
    "Oliver called DeSantis a right-wing dipshit? and falsely accused the governor of being scared? of gay people, presumably because of Floridas Parental Rights in Education law, which prohibits the teaching of sexuality and gender ideology to children in kindergarten through third grade.",
    "Do not fall for another partisan political lie being amplified by media.g?\nMore to come pic.twitter.com/B7xpktBYav\n Christina Pushaw g? gg (@ChristinaPushaw) April 28, 2022\nFollow David Ng on Twitter @HeyItsDavidNg.",
    "But hey, ends, means, what are you gonna do??\nWatch below:\nOliver also repeated establishment media claims that Florida taxpayers could end up footing Disneys $1 billion in outstanding bond debt.",
    "I dont love that it might happen not through meaningful tax reform but on the whim of one right-wing dipshit whos scared of gay people and doesnt understand the First Amendment.",
    "Do not fall for another partisan political lie being amplified by media.?\nAbout the Reedy Creek special district: Disney will pay its fair share of taxes.",
    "HBOs Last Week Tonight host John Oliver said hes pleased at the prospect of Disney paying more taxes in Florida but doesnt like the fact that it was Gov.",
    "Disney will pay its fair share of taxes,? said DeSantis spokeswoman Christina Pushaw in a recent tweet.",
    "DeSantis office has refuted these reports, saying state taxpayers wont be stuck with the bill.",
    "Floridians, including residents of Orange and Osceola Counties, will not be on the hook.",
    "Floridians, including residents of Orange and Osceola Counties, will not be on the hook.",
    "That would be a good thing,? the British comedian said on Sundays episode.",
    "Ron DeSantis (R) who successfully brought down the hammer on the company.",
    "Look, do I think its bad if Disney pays more taxes?",
    "Contact me at dng@breitbart.com",
    "Have a tip?",
    "No I dont.",
    "Gov."
  ]
}