{
  "id": 4304,
  "mediaId": 302,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Learn from our history  the heroic and the uncomfortable | Letters",
  "image": "https://www.tampabay.com/resizer//OqaBY7cUOKrb4eDSf9Ge61_Uq68=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/X3J6PK3WKFBF3HCFBQAX2YHZAY.JPG",
  "link": "https://www.tampabay.com/opinion/2022/05/01/learn-from-our-history-the-heroic-and-the-uncomfortable-letters/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    64,
    2661,
    2945
  ],
  "sentences": [
    "Carol Hess, Hudson\nGive us data\nFlorida adds 20,860 COVID cases in past week as infections climb | April 23\nNow that individuals in Florida have the freedom? to protect themselves from the spread of COVID, it would be helpful if the state would start publishing daily COVID data and trends again, so we have information on the concentration of infections in our county and state.",
    "They want to believe that Native American genocide, cruel slavery and abusive treatment of women as well as laws, procedures and customs that unfairly affect minorities (institutional racism) never happened other than as exceptions by a few bad actors.?\nThe U.S. Constitution enshrines wonderful principles, but we have not always lived up to them.",
    "Georgia Earp, St. Petersburg\nUp to the voters\nDisney bout ignites donors | April 27\nSpend your days with Hayes\nSubscribe to our free Stephinitely newsletter\nIn the long run it doesnt matter how many out-of-state hedge fund billionaires contribute to the DeSantis campaign.",
    "It must be nice to never have to worry that your vote could be suppressed, or that you could be killed in a police encounter or that you could be fired for your differences from a job that puts food on your table and keeps a roof over your head.",
    "Unfortunately, the governor is too busy fighting culture wars, preventing election fraud that doesnt exist (but not candidate fraud, which does exist) and preempting local governments from serving their citizens.",
    "Rattling chains and causing havoc is a way to get noticed so hopefully voters are noticing what is not right about one branch that runs roughshod over another branch of government.",
    "But we are responsible to learn about the objective reality of our society and history, and do what we can to make America a better place for everyone today and tomorrow.",
    "My concern: If Gov Ron DeSantis were to lose, would he accept that result or would his newly formed election fraud division cry foul and claim the election was stolen?",
    "Carol Maples, Seminole\nMust be nice\nIt must be nice to be a white guy who has never had to worry that America could be a hostile place for people not like you.",
    "It must be nice to never been brutalized for wanting to attend a public school or demonstrating for safe neighborhoods or the very right to exist.",
    "Rather than stand and fight for whats right for the citizenry of Florida, the Legislature just bends to the governors wants, wishes and needs.",
    "DeSantis and youll pay a price | Perspective, April 24\nColumnist Anthony Man said exactly what Ive been trying to put into words for weeks.",
    "Perfectly stated, the writers letter is spot on with how most of us are thinking, the silent majority that will not be silent much longer.",
    "Robert More, Riverview\nWe are fed up\nA red wave is coming | Letter, April 24\nThank you for publishing this letter.",
    "History, good and bad\nThe #MeToo, Black Lives Matter and woke? movements are uncomfortable for many white persons.",
    "Todays white persons (me included) are not responsible for the decisions and actions of our ancestors.",
    "But sweeping the latter under the rug will not make our country a better place for all our citizens.",
    "So is the concept of sexual orientation and gender identity as both a continuum and a fact of birth.",
    "Who is this chief executive who is bullying the Legislature to pass unnecessary legislation?",
    "What kind of people would keep other Americans from having access to the American dream?",
    "Karen Hodgen, St. Petersburg\nBy the people, for the people\nCross Gov.",
    "They are angry that advocates and the media keep talking about them.",
    "Our factual history is a mix of great, good, not so good and tragic.",
    "Its representation elected by the people, for the people.",
    "As the writer says, there are millions of us out here.",
    "Its the voters who will make the final decision.",
    "That is not what a democratic republic is about.",
    "There is enough to go around for everyone.",
    "Basically, we are fed up.",
    "Susan Bullard, Gulfport"
  ]
}