{
  "id": 4309,
  "mediaId": 151,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Trevor Noah's best jokes at the WHCD",
  "image": "https://www.politico.com/dims4/default/af68b65/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F6e%2F24%2Fde8fe01a4c6a997c06607cc564cd%2Fbiden-correspondents-dinner-02722.jpg",
  "link": "https://www.politico.com/news/2022/05/01/trevor-noah-white-house-correspondents-highlights-best-moments-00029073",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    906,
    2087,
    2282,
    2303,
    106,
    200,
    3656,
    2888,
    2945,
    2959
  ],
  "sentences": [
    "The headliner took the stage after the events two-year pandemic hiatus to deliver the traditional WHCA dinner roast, quipping that it was his great honor? to speak at the nations most distinguished super-spreader event.?\nHere are 15 of Noahs best lines.",
    "Apparently, Jeff [Zucker] got fired after he tried to keep his workplace relationship secret, which is weird because if he really didnt want anyone to know about it, he could have just made a show about it on CNN plus.",
    "| Patrick Semansky/AP Photo\nBy Myah Ward\n 05/01/2022 12:25 AM EDT\nDaily Show? host Trevor Noah didnt discriminate when it came to the receiving end of his roasts during Saturdays White House Correspondents Dinner.",
    "I think everyone will agree that its actually nice to once again have a president whos not afraid to come to the White House Correspondents Dinner, and hear jokes about himself.",
    "John King  your magic wall can predict how every person in the country is going to vote in every county, but it couldnt give you a heads up that nobody wanted more CNN?",
    "Trevor Noah, host of Comedy Central's \"The Daily Show,\" speaks at the annual White House Correspondents' Association dinner, Saturday, April 30, 2022, in Washington.",
    "Yeah, its relatively normal in the afternoon, but as soon as the sun goes down, theres a drunk lady named Jeanine threatening to fight every Mexican who comes in.",
    "The real reason that its such an honor to be here tonight is that we all get to be in the same room as the most powerful man in the United States.",
    "For four years, it was exclusives on the Russia investigation, corruption, the president doesnt read his daily briefings, on and on.",
    "Ill be honest, if you didnt come, I totally would have understood because these people have been so hard on you, which I dont get.",
    " Whenever theres a disaster anywhere in the world, chef Jos is there, which I guess is why hes sitting at the CNN table tonight.",
    "Now, you might think its because she loves teaching so much, but its actually because shes still paying off her student debt.",
    "It was very, very upsetting to Russia until someone explained to them that none of the stuff Biden wants actually gets done.",
    "Whoever thought wed see the day in American politics when a senator could be openly bisexual, but closeted Republican?",
    "Thats why Ron DeSantis is one step ahead  first you ban the math textbooks, then nobody knows how to count the votes.",
    "Jen [Psaki], its nice that youre willing to come over here and risk getting Covid for like, what, the 10th time now?",
    "The comedian went after President Joe Biden, Democrats, Republicans and members of the media from CNN to Fox News.",
    "Fox News in the house  I know Fox has a bad reputation  I can even feel you tense up now when I talk about them.",
    "What if I make a really mean joke about Kellyanne Conway, and her husband rushes up on the stage and thanks me?",
    "Trump said he won the election, but everyone was just able to look at the numbers and see that he was wrong.",
    "Last month, he caused a huge international incident saying that Vladimir Putin should be removed from power.",
    "It is my great honor to be speaking tonight at the nations most distinguished super spreader event.",
    "Please be careful leaving tonight, we all know this administration doesnt handle evacuations well.",
    "She spends all day fighting with random people on Twitter like a common political reporter.",
    "Its not as exciting as Madison Cawthorn made it sound, but its still very sexy.",
    "They actually have really good journalists, it just depends on when you watch.",
    "And I think ever since youve come into office, things are really looking up.",
    " The second someone offers you a free dinner you all turn into Joe Rogan.",
    "President Bidens lack of a filter does get him into hot water sometimes.",
    "To be at this swanky party full of Washingtons most powerful people.",
    "Even as first lady, Dr. Biden continued her teaching career.",
    "You know, gas is up, rent is up, food is up, everything.",
    "Did none of you learn anything from the Gridiron Dinner?",
    "The first time a presidential spouse has done so, ever.",
    "Im really excited because the kings of cable are here.",
    "Like your boss hooked us all up with free tests.",
    "Let me ask, how do you keep getting Covid, Jen?",
    "So lets give it up for Joe Manchin, everybody.",
    "Ive actually been a bit worried about tonight.",
    " By the way, give it up for Kyrsten Sinema.",
    "Im not doing this just for the attention.",
    "Ive just got to say, this is so exciting.",
    "The great chef Jos Andrs is here tonight.",
    "Fox News is sort of like a Waffle House.",
    "We all saw what happened at the Oscars.",
    "I guess you shouldve voted for Bernie.",
    "You know, I think they get a bad rap.",
    "Im a comedian, not Kyrsten Sinema.",
    "Youve ruined her Mr. President.",
    "Does he not have your address?",
    "What about Maggie Haberman?",
    "You know who I blame, CNN?",
    "Im sorry about that, Jill.",
    "CNN+, gone but forgotten.",
    "Because its a mixed bag.",
    "They really do crush it.",
    "Whats going on there?",
    "You know who I blame?",
    "Im not going to lie.",
    "Congratulations.",
    "Now look at her.",
    "Thats progress.",
    "I really dont.",
    " Its so sad.",
    "All right?",
    "My man!",
    "Boom."
  ]
}