{
  "id": 4310,
  "mediaId": 195,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Trevor Noah roasts lawmakers on both sides of aisle in correspondents dinner remarks",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/trevornoah_joebiden_correspondentsdinner-e1651374463314.jpg?w=979&h=551&crop=1",
  "link": "https://thehill.com/blogs/in-the-know/in-the-know/3472822-trevor-noah-roasts-lawmakers-on-both-sides-of-aisle-in-correspondents-dinner-remarks/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Judy Kurtz",
  "authorUrl": "https://thehill.com/author/judy-kurtz/",
  "termIds": [
    661,
    1147,
    2087,
    2282,
    2505,
    3775,
    3832,
    3656
  ],
  "sentences": [
    "Very upsetting to Russia  until someone explained to them that none of the stuff Biden wants actually gets done.?\nKnocking a number of news outlets and journalists  including Fox News, Meet the Press? moderator Chuck Todd and the now-defunct CNN+  Noah expressed empathy for journalists who are battling conspiracy theories.?\nThis is truly the golden era of conspiracy theories  whether its the right-wing who believe Trump can still win the 2020 election, or the left believe that Joe Biden could still win the 2024 election.?\nThanking the dinner for choosing him as its headliner after two years of the event being nixed amid the pandemic, the 38-year-old comic, who was born in South Africa, cracked to Biden, I was told you get your highest approval ratings with a biracial African guy standing next to you.? He then offered a short impression of former President Obama.",
    "Whoever thought wed see the day in American politics when a senator could be openly bisexual but a closeted Republican??\nNoah, a frequent critic of former President Trump, said of DeSantis, If Trump was the original Terminator, then DeSantis is like the T-1000.?\nCalling DeSantis, whose state generated controversy earlier this month for banning dozens of math textbooks, smarter? and slicker? than the 45th president, Noah noted Trumps false claims about the 2020 election.",
    "Boom!?\nTurning his attention to Biden, Noah said, I think everyone will agree that its actually nice to once again have a president whos not afraid to come to the White House Correspondents dinner.?\nTrump, who often savagely sparred with the press  calling the fake news media? the enemy of the people?  bucked tradition and skipped the journalist-, Hollywood- and lawmaker-filled dinner throughout his years in the White House.",
    "Journalists are risking and even losing their lives to show the world whats really happened.?\nNoah noted how amazing? it is that reporters have the right to seek the truth and speak the truth, even if it makes people in power uncomfortable.?\nI stood here tonight and I made fun of the president of the United States, and Im going to be fine,? Noah said, before turning with mock anxiety to Biden.",
    "People have been so hard on you, which I dont get,? Noah said to Biden, before continuing with an inflation-related punchline: Ever since youve come into office, things are really looking up: Gas is up, rent is up, food is up.?\nBidens lack of a filter does get him into hot water sometimes,? Noah told the crowd.",
    "In The Know\nTrevor Noah took aim at lawmakers on both sides of the aisle and hailed the important role played by journalists Saturday night as he marked the return of the White House Correspondents Association (WHCA) dinner following two years of cancellations due to COVID-19.",
    "[Anthony] Fauci thought it was too dangerous to come tonight,? Noah said, referencing the nations leading infectious diseases specialist saying he would be skipping the highly buzzed-about affair, which included more than 2,600 guests gathered at the Washington Hilton hotel.",
    "Journalists are risking and even losing their lives to show the world what is happening.?\nIf you ever begin to doubt your responsibilities,? Noah advised, then look no further than whats happening in Ukraine? since Russia invaded the country in February.",
    "It is my great honor to be speaking tonight at the nations most distinguished superspreader event,? the Daily Show? host quipped as he took to the dais Saturday following Bidens remarks at the annual gala.",
    "If they had basically what you have, would they be using it in the same way that you do??\nAsk yourself that question every day, because you have one of the most important roles in the world,? Noah said.",
    "Give it up for Krysten Sinema,? Noah said of the Arizona lawmaker, often a target of progressives because of her role as a frequent stumbling block for Democratic priorities in the Senate.",
    "The reason we are here is to honor and celebrate the Fourth Estate and what you stand for,? Noah said at the dinner, which raises money for journalism scholarships.",
    "Im not here to tear anybody down,? Noah insisted, saying he preferred to roast you gently,? before launching barbs about Sen. Kyrsten Sinema (D-Ariz.), Florida Gov.",
    "Ask yourself this question: If Russian journalists were losing their livelihoods and their freedom for daring to report what their own government was doing.",
    "Pete Davidson thinks its OK,? Noah said of the Saturday Night Live? star, who attended the dinner alongside girlfriend Kim Kardashian.",
    "Biden caused a huge international incident saying that [Russian President Vladimir Putin] should be removed from power,? Noah said.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Trump said he won the election, but everyone was able to look at the numbers and see that he was wrong.",
    "Every single one of you, whether you like it or not, is a bastion of democracy,? he told the press.",
    "If they had the freedom to write any words, to show any stories, or to ask any questions.",
    "Im going to be fine, right?? he said with mock anxiety, as he turned his gaze to Biden.",
    "Noah later took on a more sober tone in his remarks, lauding the medias work.",
    "Thats why Ron DeSantis is one step ahead: First, you ban the math textbooks.",
    "Do you really understand what a blessing it is?? Noah exclaimed.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Ron DeSantis (R) and President Biden, among others.",
    "Then nobody knows how to count the votes.",
    "And we all went with Pete,? Noah joked."
  ]
}