{
  "id": 4334,
  "mediaId": 65,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "Free speech concerns mount over DHS 'disinformation' board as lawmakers, critics weigh in",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a893115e-c43a-45b9-b699-0e705efc586a/53b81c8b-6022-46e8-b469-28398192a822/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/free-speech-concerns-dhs-disinformation-board-lawmakers-critics",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly Laco",
  "authorUrl": "https://www.foxnews.com/person/l/kelly-laco",
  "termIds": [
    661,
    805,
    1022,
    1609,
    1989,
    2066,
    2087,
    549,
    3620
  ],
  "sentences": [
    "House Permanent Select Committee on Intelligence Ranking Member Rep. Mike Turner, R-Ohio, and House Homeland Security Committee Ranking Member Rep. John Katko, R-N.Y., also sent a letter to Mayokras Friday, expressing \"serious concerns\" about the lack of information about the activities of the board under Jankowicz's leadership.",
    "In the letter, Schmitt states that the focus of the \"Orewellian\" board to focus resources on the threat of \"mis/disinformation\" should \"shock the very core of the American belief system, a threat to free speech that will rightly alarm freedom-loving people across America, including those in my home state of Missouri.\"",
    "Oversight Committee Ranking Member Rep. James Comer, R-Ky., organized a letter Friday to Mayorkas, obtained exclusively by Fox News Digital, to \"conduct oversight\" on the new board and \"continued efforts within the Biden Administration to suppress free speech and discredit legitimate criticism as misinformation.\"",
    "\"It sounds like the objective of the board is to prevent disinformation and misinformation from traveling around the country in a range of communities,\" White House press secretary Jen Psaki said in response to Republican criticism of the board during a daily press briefing.",
    "\"The same party that spent years promoting the Russia collusion hoax, suppressed the Hunter Biden laptop story, & equated parents to terrorists believes it has credibility to control your speech,\" House Minority Leader Kevin McCarthy, R-Calif., tweeted on Friday.",
    "\"That the Biden Admin casually announced today that the Dept of Homeland Security  a domestic security agency  has created a disinformation board is indescribably dystopian and chilling,\" Independent journalist Glenn Greenwald tweeted Thursday.",
    "\"The goal is to bring the resources of (DHS) together to address this threat,\" Mayorkas said during the hearing, adding that the department is focused on the spread of disinformation in minority communities ahead of the 2022 midterm elections.",
    "Federal and state lawmakers, constitutional scholars and other experts are expressing concerns with the Department of Homeland Security's new misinformation board, which they say is the Biden administration's attempt to stifle free speech.",
    "MAYORKAS TESTIFIES DHS IS CREATING 'DISINFORMATION GOVERNANCE BOARD'\nIn addition, Rep. Lauren Boebert, R-Colo., tweeted, \"I dont think people are fully understanding the severity of what a Ministry of Truth organized by DHS truly means.",
    "Mayorkas announced during testimony Wednesday before the House Appropriations Subcommittee on Homeland Security that DHS had created a Disinformation Governance Board to combat online disinformation.",
    "Sen. Tom Cotton, R-Ark., was quick to condemn this latest action by the Biden administration, promising to introduce legislation to defund the new disinformation board.",
    "Sen. Rick Scott, R-Fla., plans to ask Mayorkas more about the board in a hearing next week before the Senate Homeland Security and Governmental Affairs Committee.",
    "The Department of Homeland Security's \"Disinformation Board\" is unconstitutional and unamerican, and I'll be introducing a bill to defund it,\" he tweeted Friday.",
    "\"So lets get real here, lets make sure were doing things to benefit Floridians and Americans, but were not going to let Biden get away with this one.\"",
    "Sen. Marco Rubio, R-Fla., similarly tweeted, \"Nothing else we are working on will matter if we dont put an end to the Bidens Ministry of Truth.\"",
    "\"Clearly, our entire principles that the country was founded on you cannot have a Ministry of Truth in this country,\" Florida Republican Gov.",
    "The White House defended the DHS board Thursday, saying its objective is to prevent disinformation in a \"range\" of communities.",
    "Missouri Attorney General Eric Schmitt wrote a letter to Mayorkas Friday that was obtained exclusively by Fox News Digital.",
    "Brookings Institute Senior Fellow Shadi Hamid said the disinformation board is \"not exactly a reassuring thought.\"",
    "The government should not be involved in deciding what is true and false,\" Hamid continued.",
    "And Sen. Cynthia Lummis, R-Wyo., stated, \"I trust the common sense of the American people.",
    "\"That Democrats think this is good and normal tells you all you need to know about them.\"",
    "A government arbiter of 'truth' department is a [red flag] for free thinking people.\"",
    "\"Biden must immediately abandon his plan to create an Orwellian Ministry of Truth.\"",
    "The issue has spread to states, with GOP lawmakers and leaders pushing back.",
    "\"The Federal Government has no business creating a Ministry of Truth.",
    "All 19 House Oversight Republicans signed the letter.",
    "Not all the critics are Republicans or conservatives.",
    "Ron DeSantis said during a press conference Friday.",
    "\"I'm not sure who opposes that effort.\"",
    "\"How is this even up for debate?",
    "This is the hill to die on.\"",
    "This is Stalin level.",
    "This is Mao level."
  ]
}