{
  "id": 4353,
  "mediaId": 163,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Disney's corporate affairs head, Morrell, to leave company",
  "image": "https://www.reuters.com/resizer/oI6ha62eXlts3q0PkIz_4hT-pZ0=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/OF3G2AMUNVIRLOXGAJWOPIDOSQ.jpg",
  "link": "https://www.reuters.com/business/media-telecom/disneys-chief-corporate-affairs-officer-geoff-morrell-is-leaving-company-2022-04-29/",
  "sentiment": "0.0",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lisa Richwine",
  "authorUrl": "https://www.reuters.com/authors/lisa-richwine/",
  "termIds": [
    661,
    1241,
    2429,
    4542,
    4704,
    4728,
    524,
    3447,
    2661,
    2826
  ],
  "sentences": [
    "REUTERS/Brendan McDermid\nLOS ANGELES, April 29 (Reuters) - Walt Disney Co's (DIS.N) head of corporate affairs, Geoff Morrell, is leaving the company three months after joining from oil and energy company BP Plc (BP.L), according to an email on Friday from Chief Executive Officer Bob Chapek.",
    "Disney's public condemnation opened a new front in the nation's culture wars, with DeSantis signing a bill on April 22 that would strip the company of its self-governing authority at its Orlando-area parks in apparent retaliation.",
    "When Florida Governor Ron DeSantis signed the Parental Rights in Education bill into law on March 28, Disney issued a statement saying it \"should never have passed\" and said that it should be repealed.",
    "Morrell's brief tenure has been marked by controversy over the company's response to Floridas law barring classroom instruction of sexual orientation and gender identity for some younger students.",
    "Her 30-plus years of experience include heading up President Joe Biden's vaccine education program, as well as communications for Instagram and work in the Obama administration.",
    "He later voiced disappointment with the measure and apologized to the company's LGBTQ employees for failing to be a \"stronger ally in the fight for equal rights.\"",
    "A screen shows the logo and a ticker symbol for The Walt Disney Company on the floor of the New York Stock Exchange (NYSE) in New York, U.S., December 14, 2017.",
    "Disney became the focus of criticism for initially failing to speak out publicly against the Florida legislation, which critics call the Dont Say Gay? bill.",
    "read more\n\"It has become clear to me that for a number of reasons it is not the right fit,\" Morrell wrote in a separate email to his staff.",
    "The company said it worked behind the scenes to influence the legislation, an approach Chapek admitted had failed.",
    "read more\nThe company has yet to issue a statement on the new law, which would take effect on June 1, 2023.",
    "Government relations and global public policy will be led by Disney's general counsel, Horacio Gutierrez.",
    "Kristina Schake will lead the company's communications efforts, Chapek said in the email.",
    "\"I have decided to leave the company to pursue other opportunities.\"",
    "Both emails were seen by Reuters."
  ]
}