{
  "id": 4369,
  "mediaId": 63,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Biden May Cancel At Least $10,000 Of Student Loan Debt For Some Individuals, Report Says",
  "image": "https://imageio.forbes.com/specials-images/imageserve/626c1a9eeb96465694b393f7/Biden/0x0.jpg?fit=crop&format=jpg&crop=2858,1609,x0,y71,safe",
  "link": "https://www.forbes.com/sites/madelinehalpert/2022/04/29/white-house-reportedly-weighing-canceling-at-least-10000-of-student-loan-debt-for-some-individuals/",
  "sentiment": "0.0",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Halpert",
  "authorUrl": "https://www.forbes.com/sites/madelinehalpert/",
  "termIds": [
    661,
    1341,
    2087,
    3929,
    146,
    3154,
    2590
  ],
  "sentences": [
    "Why would you make a truck driver, or a waitress, or a construction worker pay off the debt for somebody that did a PhD program in gender studies?? he said, adding such a move would be wrong.? Graduate students borrow about 37% of all federal student loan dollars, according to the Education Data Initiative, a research group that uses data from the Department of Education and other government sources to provide analysis on higher education in the U.S.\n43.4 million.",
    "Topline\nThe Biden administration may forgive at least $10,000 of student loan debt for some individuals, Bloomberg reported on Friday, citing sources familiar with the discussions, a day after President Joe Biden signaled he plans to take some kind of action soon on the issue.",
    "Biden to date has taken several steps to address student debt reliefa major political issue for Democratsincluding by repeatedly extending the pause on student loan payments, which is set to remain in effect until at least August 31 under the latest order signed by Biden.",
    "The report comes a day after Biden said he was not looking to cancel $50,000 in debt per borrower as some top congressional Democrats had pushed for, but said he is considering canceling some? debt, adding that he would have an answer on the matter next month.",
    "It also comes two days after Rep. Tony Cardenas (D-Calif.) told the Washington PostBiden was incredibly positive? about the possibility of canceling at least $10,000 in debt per person, an idea he also supported on the campaign trail.",
    "Many Democratic lawmakers have been urging the president to take action to cancel some of the debt, with some, including Senate Majority Leader Chuck Schumer (D-N.Y.), pushing for the administration to forgive $50,000 per borrower.",
    "Key Facts\nThe White House could relieve the debt through an executive order that would target lower and middle-income people, Bloomberg reported, noting the administration had yet to flesh out the specifics of a proposal.",
    "Im in the process of taking a hard look at whether there will be debt forgiveness, and Ill have an answer in the next couple weeks,? Biden said at a news conference on Thursday.",
    "Many have re-upped their calls for Biden to address the issue before the midterm elections and the pause on payments expires in August.",
    "Thats how many people have federal student loan debt, with an average balance of $37,113, according to the Education Data Initiative.",
    "Ron DeSantis criticized the idea at a news conference on Friday, claiming 60% of student loan debt belonged to graduate students.",
    "Several Republicans took aim at Biden after he said this week he was considering canceling some student loan debt.",
    "Some Republicans, meanwhile, have argued student loan forgiveness would add to inflation.",
    "Floridas GOP Gov."
  ]
}