{
  "id": 4388,
  "mediaId": 323,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Disney Dispute Reflects Wider Rift Between Republicans, Big Companies",
  "image": "https://images.wsj.net/im-533082/?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/disney-dispute-reflects-wider-rift-between-republicans-big-companies-11651247143",
  "sentiment": "0.0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Leary",
  "authorUrl": "https://www.wsj.com/news/author/alex-leary",
  "termIds": [
    661,
    1765,
    2305,
    3920,
    428,
    524,
    571,
    2661,
    2672
  ],
  "sentences": [
    "In Georgia last year, when a voting law drew public opposition from companies including Georgia-based Coca-Cola Co. and Delta Air Lines Inc., Senate Minority Leader Mitch McConnell (R., Ky.) told them to stay out of politics.?\nCompanies have come out against other Republican state bills, including Arkansass first-in-the-nation ban on gender-transition treatment for childrenopposed by Mars Inc., Nestl USA and Unilever PLC, among otherswhich has since been blocked by a court.",
    "Texas recent abortion law was decried by companies including the dating app Bumble Inc., ride-sharing service Lyft Inc. and cloud-storage company Box Inc.\nFor some Republicans, particularly those considering 2024 presidential bids, the rise of President Donald Trump had already inspired more criticism of big multinationals amid a backlash against globalization policies that often led to offshoring of jobs.",
    "Pay for it by just slightly edging up the corporate tax rate or the upper level, after it was dramatically brought down five years ago[Republicans say], Im sorry, we cant go there. ?\nStill, theres little doubt the party has traveled some distance from the days when Republicans worked more closely with big business with priorities like broad global trade agreements.",
    "The entertainment giant, a large employer in Florida, at first said it would keep out of the fray over Mr. DeSantiss controversial Parental Rights in Education billdubbed by opponents Dont Say Gay?which prohibits classroom instruction about gender identity or sexual orientation through third grade.",
    "Mr. Hawley, who said last year that he no longer would accept corporate PAC donations and has advocated for breaking up major technology companies, said the shift away from big business has already taken place among GOP voters, and elected officials are now catching up to their base.",
    "Grover Norquist, longtime president of Americans for Tax Reform, which advocates for low taxes and small government, calls the current rift overstated, with most rhetoric coming from a handful of Republicans who lack the numbers in Congress to force anticorporate measures.",
    "At a recent Senate Commerce Committee hearing, Florida Sen. Rick Scott pressed Intel Corp. Chief Executive Pat Gelsinger over the companys work in China and questioned why the company needs a slice of the $52 billion Congress is considering for the semiconductor industry.",
    "Theyre finding out that its different, much different.?\nIn a recent interview, Mr. Trump told The Wall Street Journal: Corporate America is trying to be politically correct, but actually they are going against what this country really wants and being very foolish.",
    "I hope that from a social point of view, these companies wont think that, Well, we could take all these government benefits and so forth and push a very political agendathats also a very left agendabut keep getting all of our special handouts, ? he said.",
    "Its fertile ground: Pew Research Center surveys show that the share of Republicans who say big companies have a positive impact on the way things are going in the U.S. has dropped 24 percentage points between 2019 and 2021, to 30% from 54%.",
    "Theyre certainly not trying to cater to elites.?\nMr. Geduldig noted the Republican coalition now includes parents upset with masking in schools, those who oppose abortion and favor gun rights, and a growing number of Hispanic voters.",
    "Overall in 2020, contributions from people giving $200 or less made up 22.1% of all campaign funds for Republican House members and 30.3% for Senate Republicans, according to data from the nonpartisan Center for Responsive Politics.",
    "Whether companies like it or not, in todays world, particularly among big, well-known companies, they are in the spotlight.?\nBeyond politics, the rift extends into policy areas where business and Republican long forged alliances.",
    "Daryl Brewster, head of Chief Executives for Corporate Purpose, a nonprofit of more than 200 business leaders focusing on companies social strategy, said he has heard from about a dozen CEOs since the Disney conflict began.",
    "A handful of Republicans have said they are open to the possibility of higher corporate tax rates, which were cut to 21% under a landmark, Trump-backed bill in 2017. I would not rule that out,? Sen. Josh Hawley (R., Mo.)",
    "Recalling the 1992 presidential election, he said: Everybody watched George Herbert Walker Bush throw away a perfectly good presidency for one mistakethe tax hike.?\nSome Democrats also scoff.",
    "Rising competition with China has added fuel to the fire, and Republicans have criticized the dealings of Nike Inc. and Apple Inc. in a country accused of human rights abuses.",
    "After the Jan. 6, 2021, riot at the U.S. Capitol, a number of companies paused donations to Republican lawmakers who objected to ratifying electoral votes for President Biden.",
    "The Journal reported this week that the company has embraced a low profile in hopes Republicans in Tallahassee will reconsider the move to dissolve the special tax district.",
    "The murder of George Floyd by Minneapolis police officers and harsh battles over social issues like school curricula have elevated those topics in political campaigns.",
    "Some Republicans on the stump this primary year are seeking traction with base voters by portraying big companies as woke,? elitist entities backing liberal policies.",
    "The emergence of the tea party movement followed by the ascension of Mr. Trump, a supporter of tariffs, steered many Republicans toward more protectionist policies.",
    "It is no longer a wealthy party, theyre not trying to appeal to wealthy voters,? said Sam Geduldig, a Republican lobbyist for CGCN Group, a public affairs firm.",
    "Disney was a great company, but itll destroy itself if it keeps going down this line.?\nDisney has declined to comment on its Florida imbroglio in recent days.",
    "He notes that an overwhelming majority of GOP lawmakers in Congress have signed his no-new-taxes pledge, which would apply to raising rates on companies.",
    "Another change is the rise of online, individual political donations, which have lessened the importance of business and industry PAC campaign donations.",
    "According to Federal Election Commission filings, PAC contributions accounted for about 1 in 20 donations in 2020where previously they were about 1 in 5.",
    "Disney is hardly alone in recent years in taking public stances, often against Republican-backed measures, on behalf ofor under pressure fromits workers.",
    "Sen. Marco Rubio (R., Fla.) also has said he doesnt see the current corporate tax rate as sacrosanct and has proposed curbs on corporate stock buybacks.",
    "Another turn came on immigration, which many companies have long backed as essential to growth but against which Mr. Trump drew sharp lines.",
    "More recently, cultural and political flashpoints like abortion laws, race, LGBT rights and voting laws have at times divided the two camps.",
    "Among Democrats, for whom attacks on companies have long been more common, positive views of big business have gone up, to 28% from 23%.",
    "But after vocal pressure from some employees, Disney came out against the law, which it said would unfairly target the LGBT community.",
    "They think because Republicans have always been pro-business that well tolerate their high-jinks,? said Sen. John Kennedy (R., La.).",
    "In response, Mr. DeSantis called Disney a woke corporation? and promptly pushed lawmakers to eliminate special Disney tax benefits.",
    "But we as policy makers need to be acting in the best interests of the country.?\nNot everyone sees the divide as so deep.",
    "Write to Alex Leary at alex.leary@wsj.com, Lindsay Wise at lindsay.wise@wsj.com and Emily Glazer at emily.glazer@wsj.com",
    "Its very simple, and that is we need to stop thinking about major American corporations as American,? Mr. Rubio said.",
    "Once more closely aligned, the two find themselves at odds on economic issues like trade, immigration and energy.",
    "Mr. Gelsinger countered that Intel is creating high-paying U.S. jobs and can address supply-chain problems.",
    "Both of those figures were the highest since at least 2000, the earliest year for which data was available.",
    "As if its their right to have these handouts.?\nChad Day and Cameron McWhirter contributed to this article.",
    "In some instances, CEOs have said they feel obliged to speak on important issues such as gender or race.",
    "As the Republican Party embraces more populist policies, some politicians warn of a deepening divide.",
    "The campaign of House Minority Leader Kevin McCarthy (R., Calif.) followed a similar pattern.",
    "Mr. McConnell, in his 2020 campaign, raised $27.8 million from donors who gave $200 or less.",
    "Its no longer reflexively big business but its small business, its rural America,? he said.",
    "Ron DeSantis is the latest sign of a widening rift between Republicans and big business.",
    "Its a freebie, because youre not firing with real bullets,? Mr. Norquist said.",
    "Every time they have a chance to prove itOK, support the child tax credit.",
    "They act in the best interest of the shareholders, and thats their job.",
    "In his prior races in 2008 and 2014, the figure was about $900,000.",
    "That response still makes some Republicans angryas do other issues.",
    "Theres no genuineness to it,? said Sen. Sherrod Brown (D., Ohio).",
    "He said he hopes and expects the change to be permanent.",
    "They dont act in the best interests of the country.",
    "The fight between Walt Disney Co. and Florida Gov.",
    "Many are happy its Disney, not them,? he said.",
    "Thats just not happening,? Mr. Norquist said.",
    "The Disney dust-up captures the conflict.",
    "But the drama has been closely watched.",
    "told the Journal."
  ]
}