{
  "id": 4394,
  "mediaId": 151,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "What Californias massive budget surplus could mean",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/california-playbook/2022/04/29/what-californias-massive-budget-surplus-could-mean-00028872",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2087,
    3734,
    3883,
    3886,
    3998,
    4587,
    2590,
    2895
  ],
  "sentences": [
    "But after the driest-ever start to the year in California history, conditions today are far more critical than theyve ever been, officials said.?\nHE SAID, HE SAID  Ron DeSantis feud with Gavin Newsom ramps up amid San Francisco dumpster fire insult,? by the SF Chronicles Sophia Bollag: DeSantis made the comments several days after Newsom criticized him on Twitter for punishing Disney over its opposition to Floridas new law banning discussion of sexual orientation in early grades.?\n Bias, far-right sympathies among California law enforcement going unchecked, audit finds,? by the LA Times Kevin Rector: In California, a recent Times investigation found that police agencies across the state upheld just 49 racial profiling complaints from 2016 to 2019, or less than 2% of the roughly 3,500 allegations filed.?\n Debate Heats Up Over Effort to Pilot Safe Injection Sites in California,? by KQEDs Lesley McClurg: The last time supervised injection facilities were on the table in California, in 2018, a bill progressed all the way to Governor Jerry Browns desk.",
    "HOLLYWOODLAND\nBOARDROOM DRAMAS  How TV Got So Obsessed With Tech Downfalls,? by Vanity Fairs David Canfield: The new explosion of rise-and-fall tales about tech moguls and entrepreneurs  speaks just as powerfully to our own moment in time  the gig economy, the start-up fantasies, and the virtual world in which new kings and queens are crowned, only to be taken down.?\nCANNABIS COUNTRY\n California bill allowing pot farmers to sell directly at farmers markets advances,? by the Sac Bees Randy Diamond: The bill only allows farmers to sell at eight cannabis farmers markets a year but Callahan and other farmers see ii as a way to add to their profits in difficult times by allowing them to collect the fees normally paid to distributor middlemen and dispensaries.?\nMIXTAPE\n San Diego County immigrant legal defense program launches,? by inewsources Sofa Mejas-Pascoe.",
    "Rob Bonta said Thursday that his office has subpoenaed Exxon Mobil Corp. seeking information related to the companys historic and ongoing efforts? to minimize the publics understanding of the harmful consequences of plastic.?\n Lower cost, slower gains: California prepares controversial new climate strategy,? by CalMatters Nadia Lopez: The plan, which aims for an 80% reduction of greenhouse gases below 1990 levels by 2050, would cost an estimated $18 billion in 2035 and $27 billion in 2045.?\n Southern California braces for less water and a browner landscape,? by the LA Times Hayley Smith, Ian James and Jaimie Ding: For some Californians, the sight of brown lawns may harken back to to the previous drought, when then-Gov.",
    " Survivors  desperate to rebuild, clutching insurance payouts that dwarf their life savings  are vulnerable.?\n First eyewitness account of Sheriff Villanueva lying in a cover-up revealed in filing,? by the LA Times Alene Tchekmedyian: The filing by former Assistant Sheriff Robin Limon, once one of Villanuevas closest advisors, alleges that she personally brought a DVD containing a video of a deputy kneeling on a handcuffed inmates neck to Villanueva  and watched it with him and two others five days after the incident happened.?\nCAMPAIGN MODE\nENDORSEMENT  Endorsement: Marc Levine for state insurance commissioner,? by the LA Times editorial board.",
    "A campaign fixture in some states, his name is nearly absent in California,? by CalMatters Alexei Koseff: Jim Brulte, a former chairperson for the state party, said GOP candidates have no need to cling to Trump because they have a better message to sell to voters this year about the failures of Democratic President Joe Biden.?\n DNC seeks to boost California election outreach ahead of anticipated red wave,? by the Sac Bees Gillian Brassil: Targeted districts are decided on by a team of elected officials, party leadership and data analysts at the local, state and national levels, the DNC spokesperson said.?\n G.O.P.",
    "On Thursday, Senate Democrats unveiled their updated budget priorities in anticipation of the upcoming May revise, in which they predicted California would have an eye-popping $68 billion in surplus funds, up from the January estimate of $29 billion from the Legislative Analysts Office (Those figures dont include Proposition 98 education funds for you budget wonks).",
    "White @JeremyBWhite\nLara Korte @lara_korte\nPOLITICO California @politicoca\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "What Californias massive budget surplus could mean\nBy LARA KORTE, CHRIS RAMIREZ and JUHI DOSHI\n04/29/2022 09:10 AM EDT\n Updated 04/29/2022 10:48 AM EDT\n 2022-04-29T10:48-0400\nPresented by Californians for Solutions to Homelessness and Mental Health Support\nTHE BUZZ  HERE WE GO A-GANN: Californias wealthiest residents are doing well.",
    "Senate Democrats said California needs to pass a constitutional amendment by 2024 in order to ensure core programs can continue to be funded and not artificially constrained by the out-of-date Gann limit.?\nIn the meantime, there are other budget priorities that need attention, starting with sending $8 billion back to Californians.",
    "Concocts Fake Threat: Voter Fraud by Undocumented Immigrants,? by NYTs Jazmine Ulloa: Political scientists and historians say Republicans harnessing of the unease stirred by demographic shifts and a two-year-old pandemic could mobilize their most ardent voters.?\nCALIFORNIA AND THE CAPITOL CORRIDOR\nNEXT BIG CASE?",
    "They've Had Two This Year,? by RealClearPolitics Philip Wegmann:  Biden has tried to duplicate the dynamic with Harris that he enjoyed with Obama, but he reportedly hasnt been able to recreate the same sense of camaraderie.?\nSILICON VALLEYLAND\n The mean tweets are coming from inside the House?",
    "QUOTE OF THE DAY  The pros of it are that its good PR the cons are that there's no guarantee that the saving  the reduction in the federal tax  that would be passed on to the consumer.? House Speaker Nancy Pelosi taking the air out of a federal gas tax holiday proposed by Democrats.",
    "Gavin Newsoms suggestion to pause the scheduled gas tax increase never took hold in the Legislature, and now a bipartisan group of lawmakers say theyre prepared to introduce a bill that would completely suspend the states $0.51 per gallon tax for a year.",
    "But the findings attribute more of the shift to members themselves changing over time and posting more provocative tweets.?\nHEEERE WE GO  Elon Musk Sells About $4 Billion in Tesla Stock After Agreeing to Buy Twitter,? by WSJs Rebecca Elliott.",
    "The limit is adjusted every year according to inflation and population growth, but any revenues that go over the limit must be spent in specific ways, by either returning that money directly to taxpayers or spending it on education.",
    "Twitter incivility up among politicians, study says,? by the LA Times Melanie Mason: To some degree, the increasingly antagonistic tone is due to more civil members of Congress being replaced by less civil ones, the study says.",
    "Alex Stack, a spokesperson for Newsom, said there's no guarantee under the proposal that the benefits will be passed on to Californians and not just go back to oil companies and corporations.?\nBUENOS D?AS, good Friday morning.",
    "Morris: The new boundaries have already been strongly resisted by some of the citys leading progressives who said it would break up like-minded communities and dilute their influence.?\nBIDEN, HARRIS AND THE HILL\nRAIN CHECK?",
    "Atkins and Skinner also want to put a huge chunk of that surplus, $8.1 billion, toward building up the state's budget reserves to a total of $43 billion, which would protect ongoing programs from future economic downturns.",
    "From Sacramento to Silicon Valley, POLITICO California Pro provides policy professionals with the in-depth reporting and tools they need to get ahead of policy trends and political developments shaping the Golden State.",
    "But they had more to lose in the rebuilding process,? by the Sac Bees Dale Kasler and Ryan Sabalow: Just about every year, a California community burns down, leaving hundreds if not thousands of people homeless.",
    "Senate President Pro Tem Toni Atkins (D-San Diego) and budget chair Sen. Nancy Skinner (D-Berkeley) have proposed rebates as a way to offset the rising cost of energy and consumer goods.",
    "Legislative leadership says the best way to do that is with direct payments, and theyre concerned cutting the gas tax would deplete critical funds for road repair.",
    "The reasoning is that the state needs the flexibility to spend those extra funds on things that arent allowed by the limit, like health care or homelessness.",
    "The states once-again-overflowing-coffers are thanks to Californias aggressive income taxes and its high-earning residents, who clearly had a good year.",
    "POLITICO California has a variety of solutions available for partners looking to reach and activate the most influential people in the Golden State.",
    " State accuses Exxon Mobil of deceiving public, perpetuating myth of plastics recycling,? by the LA Times Susanne Rust and Rosanna Xia: Atty.",
    "Stay tuned.? @GavinNewsom weighs in on a new law in Oklahoma that mimics a Texas law allowing civil enforcement of a six-week abortion ban.",
    "Seth Smith, most recently of Charlie Mike, a Santa Cruz-based veteran organization, joins the rideshare giant as public policy manager.",
    "POLITICOs Alexander Nieves has all the details on how the Senate wants to fund education, housing and climate resiliency programs.",
    "Earlier this week the LAO released a report warning that the state is likely to run into a serious budget problem by 2025.",
    " Pornography and racist messages disrupt online Sacramento City Council debate,? by the Sac Bees Alexandra Yoon-Hendricks.",
    " San Francisco is one of the rattiest cities in America. Will rat birth control help?? by the SF Chronicles Carolyn Said.",
    "In California, a surplus like this raises concerns that the state may hit the 1979 spending cap known as the Gann limit.",
    "John Finley, previously with ValorUS, a national anti-sexual violence group, will join as senior policy associate.",
    "Eligibility would be limited to those making less than $125,000 for individuals and $250,000 for joint filers.",
    "Hit us up jwhite@politico.com and lkorte@politico.com or follow us on Twitter @JeremyBWhite and @Lara_Korte.",
    "Sen. Alex Padilla is heading to the Bay Area today to meet with striking Stanford nurses on the picket line.",
    "To learn more about the exclusive insight and analysis this subscriber-only service offers, click here.",
    "supervisor districts get final approval over Tenderloin and SoMa objections,? by the SF Chronicles J.D.",
    "Lawmakers could also avoid hitting the limit by spending more on things like infrastructure projects.",
    "Under the plan, California would send $200 to every taxpayer, with another $200 per dependent.",
    "Share your message with our influential readers to foster engagement and drive action.",
    "There have been talks recently of reforming or repealing the Gann limit altogether.",
    "And gasoline price relief for taxpayers continues to be a budget priority.",
    "TRANSITIONS\nFIRST IN PLAYBOOK  Uber is deepening its bench in California.",
    " Interactive: Inside DA Chesa Boudins Office,? via the SF Standard.",
    "Its time to think big and protect choice.California is stepping up.",
    "Seeking to increase brand awareness amongst this key audience?",
    "Contact Jesse Shapiro to find out how: jshapiro@politico.com.",
    "CALIFORNIA POLICY IS ALWAYS CHANGING: Know your next move.",
    "Jerry Brown imposed mandatory water cuts across the state.",
    "The governor, it seems, isnt a fan of that idea either.",
    "[State Sen. Scott] Wiener is trying again.?\n New S.F.",
    "TWEET OF THE DAY  More attacks on abortion rights.",
    "Got a tip or story idea for California Playbook?",
    "Top Talkers\n The Camp Fire took their homes.",
    " Biden Promised Harris Lunch 'Once a Week.'",
    "But as they say, more money, more problems.",
    "Have a petition you want signed?",
    "Follow us on Twitter\nJeremy B.",
    "Nothing official announced.",
    "A cause youre promoting?",
    "Want to make an impact?",
    "This time in Oklahoma.",
    "Like, really well.",
    " Wheres Trump?",
    "WHERES GAVIN?",
    "He vetoed it.",
    "NEAT!",
    "Gen.",
    "Gov."
  ]
}