{
  "id": 4395,
  "mediaId": 65,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Twitter users shocked by ridiculous TikTok of new disinformation czar singing: God help us",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/3e9d35a7-89c9-4e43-b200-bd6149c8e2a6/c18a64b4-538f-4374-a593-a32f205e8143/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/twitter-users-tiktok-disinformation-czar-singing-media",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nikolas Lanum",
  "authorUrl": "https://www.foxnews.com/person/l/nikolas-lanum",
  "termIds": [
    661,
    2066,
    2087,
    4596,
    4742,
    3583,
    2934
  ],
  "sentences": [
    "Jankowicz tweeted on Wednesday that she was \"Honored to be serving in the Biden Administration @DHSgov and helping shape our counter-disinformation efforts,\" after which interested users began digging into past tweets of the new board leader to discover more about the mysterious new segment of the Department of Homeland Security.",
    "Florida Governor Ron DeSantis press secretary also weighed in on the video: \"I mean, she wrote a whole book based on the premise that you can be a CIA agent and also ~marginalized~ at the same time so shes the perfect censor kween for the Biden regime,\" Christina Pushaw wrote.",
    "Twitter users erupted after an unearthed TikTok video showed the Biden administration's new Disinformation Governance Board executive director singing a revised version of Mary Poppins \"Supercalifragilisticexpialidocious\" tailored around \"information laundering.\"",
    "Author and political commentator Ajit Datta reacted with snarky nihilism when he said ,\"Who would have thought the collapse of the world's greatest empire would be so funny...\"\nMeanwhile, RealClearPolitics Co-founder and President Tom Bevan reacted in disbelief.",
    "WHITE HOUSE DEFENDS DHS 'DISINFORMATION' BOARD: 'NOT SURE WHO OPPOSES THAT EFFORT'\nA number of accounts reacted in disbelief, amusement and concern after discovering Jankowiczs disinformation jingle.",
    "DHS Secretary Alejandro Mayorkas broke the news when he testified Wednesday that the DHS was forming a \"Disinformation Governance Board\" to combat misinformation ahead of the 2022 midterms.",
    "\"You can just call me the Mary Poppins of disinformation,\" Nina Jankowicz tweeted in February 2021, attaching a link to her musical reprisal.",
    "\"This is who the government is trying to put in charge of regulating YOUR speech,\" wrote Sen. Ted Cruz, R-Texas.",
    "\"Id like to apologize for this on behalf of all theater people,\" author and columnist David Marcus quipped.",
    "Every time you think the Biden administration cant get more ridiculous,\" added OutKick founder Clay Travis.",
    "Former Georgia congressional candidate Barrington Martin II asked \"is this a joke?\"",
    "\"This is the new Biden administration head of Ministry of Truth, Nina Jankowicz.",
    "#MinistryOfTruth,\" tweeted veteran Hollywood actor James Woods.",
    "I thought it was a joke or a deep fake or something,\" he wrote.",
    "\"This one absolutely has to go into the 2022 Time Capsule.",
    "She is in charge of whats truth and fiction in America.",
    "But it is\" tweeted The Hill columnist Joe Concha.",
    "\"God help us,\" author Mark Davis bluntly tweeted.",
    "\"Wait, this is real?",
    "\"This cant be real."
  ]
}