{
  "id": 4401,
  "mediaId": 65,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Jack Brewer files police report on Joy Reid for putting kids in danger, demands apology",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/2e377bd0-6973-4d23-9dbd-a3842cc4f3d2/45eb7a70-b96e-4802-8306-a8fdfa95e748/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/jack-brewer-police-report-joy-reid-kids-danger-letter-apology",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3819,
    4496,
    4715,
    2661,
    2788,
    2826
  ],
  "sentences": [
    "Brewer explained to Fox News Digital that the boys in the photo knew why they attended the DeSantis event, and said in his letter to Reid that his program launched \"an in-depth CRT event for our students and parents which prepared them for the realities of Critical Race Theory\" at the start of the 2021 school year.",
    "Retired NFL player and philanthropist Jack Brewer has filed a police report and sent a letter to MSNBC host Joy Reid demanding an apology over her claims young Black children associated with his education and mentorship programs were subjected to child abuse when pictured with Florida Gov.",
    "\"Update: heard from a Florida source today that these Black boys who Americas most racist governor used as props came from a Miami charter school (I wont name the school to spare them from MAGA harassment/threats) & that they may not have known in advance why they were there,\" Reid wrote.",
    "MSNBC'S JOY REID CALLS PHOTOS OF BLACK KIDS AT DESANTIS EVENT AS CHILD ABUSE\n\"Ms. Reid should know the kids she exposed are victims of schools that limit their educational success based on their demographic makeup, as a result of public schools embracing CRT,\" he continued.",
    "Fox News Digital also spoke to an aunt and guardian to one of the boys in the photo amplified by Reid, who recounted that \"people are upset on our behalf because they know that these kids have been taught to love, not hate and animosity toward other people.\"",
    "JACK BREWER GIVES JOY REID A CHOICE: APOLOGIZE FOR 'MISUSE OF BLACK BOYS' COMMENT OR FACE 'LEGAL STRATEGY'\n\"I tell them that as long as they're doing things for righteousness and for good, just like they persecuted Christ, they will persecute them.",
    "The letter and police report follow Reid retweeting a message from Florida state Sen. Shevrin Jones last Friday attacking DeSantis for Black children being photographed at the event where the governor signed the \"Stop Woke\" bill into law.",
    "\"I just think it's pretty outrageous that Joy Reid's thought process is that people can't have independent thinking about matters like CRT,\" Jane Halbritter told Fox News Digital in a phone interview Monday.",
    "\"Our kids are very aware of the divisive ideology of CRT and are instead trained on biblical based principles of equality and pouring into their anointing as mighty children of God,\" he wrote in the letter.",
    "Brewer states in his letter to Reid that \"the only thing extra sick is the offensive tweet by Ms. Reid that slandered my name as a child abuser, and recklessly and maliciously placed young kids in danger.\"",
    "Reid updated her tweet last weekend saying that sources informed her the boys in the photo were from a Miami charter school and claimed they may not have known why they were at the DeSantis event.",
    "CLICK HERE TO GET THE FOX NEWS APP\nBrewer said earlier this week that Reid and MSNBC will have to apologize or \"I'm going to have to pursue my legal strategy that my lawyers are putting together.\"",
    "The tweet included a photo focusing on three Black children holding anti-CRT signs, who are members of programs Brewer founded, including The Serving Institute and The Heroes program.",
    "\"Now they're questioning why people are saying that by them going and standing against things that we're teaching them is wrong and  that's really unfortunate,\" he added.",
    "Certain people motivated by Reids comments are furiously trying to figure out their identities,\" Brewer wrote in his letter to Reid demanding a public apology by May 2.",
    "Brewer, founder of The Jack Brewer Foundation, also filed a police report with the Coral Springs Police Department this week, which was reviewed by Fox News Digital.",
    "He explained that several of the students have come to him and other program leaders about the matter, but hes kept them positive by leaning on scripture.",
    "\"The families are forced to deal with harassment by the media, and being shamed by members of the community, for their presence at the event.",
    "Police officers are now present at Brewers facilities and are helping protect children commuting to and from tutoring and sports programs.",
    "Brewer sent the letter both through email and by mail, and will hand-deliver the letter to MSNBC's office in New York City this weekend.",
    "Brewer said Friday that the children are facing blowback from within their own communities following Reid's comments.",
    "I would really like to hear the back-story on who these kids were and how they wound up at a DeSantis event.",
    "Well, now my kids are feeling bad in their circles and in their community, and I don't like that,\" he said.",
    "Given how anti-Black DeSantis is, using Black children this way is extra sick,\" Reid said in her tweet.",
    "\"I've had to deal with people just because I happen to support conservative Christian views.",
    "My foundation was forced to add security and police presence at our facilities.\"",
    "And that that's really helped them kind of understand the situation,\" he said.",
    "The letter was exclusively shared with Fox News Digital early Friday morning.",
    "Reid's tweets are still posted on her Twitter account as of Friday morning.",
    "Ron DeSantis during the signing of an anti-critical race theory bill.",
    "MSNBC has not responded to Fox News Digital's requests for comment.",
    "\"Ms. Reids reckless statements placed these kids in danger.",
    "\"This mis-use of Black boys is tantamount to child abuse.",
    "I get a lot of heat."
  ]
}