{
  "id": 4422,
  "mediaId": 136,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "'Math is Racist' Crowd Runs Rampant in Seattle, Portland | Opinion",
  "image": "https://d.newsweek.com/en/full/2027171/math-lesson.webp?w=790&f=a7d5a9657d96b142812df53afdea2ddd",
  "link": "https://www.newsweek.com/math-racist-crowd-runs-rampant-seattle-portland-opinion-1701491",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Rantz",
  "authorUrl": "https://www.newsweek.com/authors/jason-rantz",
  "termIds": [
    661,
    3857,
    2902,
    5119
  ],
  "sentences": [
    "The toolkit warns educators that \"white supremacy culture\" shows up in the classroom every time teachers \"treat mistakes as problems by equating them with wrongness\" because it \"reinforces the ideas of perfectionism (that students shouldn't make mistakes) and paternalism (teachers or other experts can and should correct mistakes)\"both among the ideas commonly ascribed to \"white supremacy culture.\"",
    "The activists pushing to create anti-racist math classes seem to believe that if minority students underperform in a subject, schools must penalize high achievers (usually white and Asian students) to ensure they aren't at an academic advantage.",
    "And you won't see word problems like, \"If black student David is 10 times more likely to suffer microaggressions than white student Stephanie, and Stephanie suffered seven microaggressions today, how many microaggressions did David endure?\"",
    "Meanwhile, the Democrat-controlled Oregon legislature passed a law ending a high school graduation requirement that students demonstrate proficiency in math (along with reading and writing) after minority students failed at high rates.",
    "That includes millions to The Education Trust, a fringe education advocacy group that refers to student loan debt for black students as \"Jim Crow debt,\" and Teach Plus, which encourages teachers to become \"social agents of change.\"",
    "But if Rahman is injecting this toolkit into his classroompretending it's white supremacy culture to use money in a math problem because it \"uphold[s] capitalist and imperialist ways of being\"he's not serving his students.",
    "Progressive writer Judd Legum, for example, claimed DeSantis was overstating the presence of critical race theory (CRT) in curricula, noting that it \"is not something you typically find discussed in a K-12 math textbook.\"",
    "\"There's something I might be doing that could be problematic, so just looking inside and trying to make sure I'm the best version of myself and make sure I'm teaching the best way I can to my students,\" Rahman explained.",
    "A coalition of left-wing educators introduced A Pathway to Equitable Math Instruction, a toolkit introducing \"an integrated approach to mathematics that centers Black, Latinx, and Multilingual students in grades 6-8.\"",
    "\"When we're only teaching them that one master narrative, that's the master narrative that is around in society too, because they grow up, and then they teach their kids that, and that's how they approach the world.",
    "The text even argues that \"requiring students to raise their hand before speaking can reinforce paternalism and powerhoarding, in addition to breaking the process of thinking, learning, and communicating.\"",
    "Its founder believes that math is a \"harbor for whiteness\" and \"the very nature of the knowledge and who's produced it, and what has counted as mathematics is itself dominated by whiteness and racism.\"",
    "The framework claims that \"mathematical knowledge has been appropriated by Western culture\" and that \"math has been and continues to be used to oppress and marginalize people and communities of color.\"",
    "After years of consistent progress at John Muir Elementary, for example, the passing rate for black students fell from 28 percent to 18 percent after the introduction of the ethnic studies framework.",
    "The basic argument from the \"math is racist\" crowd is that \"white supremacy culture\" is endemic to mathematics classrooms, and it's why black students' math scores are lagging white students'.",
    "Seattle math teacher Shraddha Shirude is a believer, using ethnic studies in her high school course Mathematics for Liberation to tell students that the subject is \"used to oppress people.\"",
    "The group hopes educators will help remove white supremacy culture from math classes \"as they navigate the individual and collective journey from equity to anti-racism.\"",
    "Last year, the Oregon Department of Education promoted and legitimized this fringe resource in a training session for teachers, igniting a firestorm of controversy.",
    "In 2019, the department released guidelines for K-12 math teachers to use in the classroom as part of a pilot program at a handful of Seattle public schools.",
    "Judging by East Coast liberals' attacks on Florida Governor Ron DeSantis for fighting against woke math textbooks, you'd think the battle is a new one.",
    "Though DeSantis pointed to some specific examples of CRT-inspired teaching materials, it's not as simple as pointing to math problems in a textbook.",
    "As noted in Luke Rosiak's book Race To The Bottom, black students' state math exam scores in these pilot programs plummeted to shocking lows.",
    "The Vancouver, Washington, school board director moved to dramatically alter advanced classes because too many white kids were enrolled.",
    "But the math war has been raging for years on the West Coast, where progressives have almost total control over school curricula.",
    "The Bill and Melinda Gates Foundation funded the groups behind A Pathway to Equitable Math Instruction with nearly $140 million.",
    "Jason Rantz is a frequent guest on Fox News and is the host of the Jason Rantz Show on KTTH Seattle, heard weekday afternoons.",
    "She says she enjoys teaching through the ethnic studies lens because it dismantles the \"toxic\" white culture of math classes.",
    "Momentum is on the side of the Left, which seeks to dismantle our education systems and rebuild them on their own terms.",
    "Oregon math teacher Muhammad Rahman told a local news outlet that he's been using the toolkit to inform his instruction.",
    "Seattle Public Schools introduced the CRT lens into math classes through the district's ethnic studies department.",
    "One could forgive DeSantis for not being able to quickly release a mountain of examples of CRT in math textbooks.",
    "And there's big money flooding CRT education groups, ensuring that it will continue to spread across the country.",
    "He would force the higher achievers into classrooms with underachievers to meet the district's equity commitment.",
    "The governor's critics were skeptical, arguing this move was little more than contrived political theater.",
    "CRT is a lens that tints every subject, and it's endemic to classrooms in the Pacific Northwest.",
    "It's all based on white supremacy culture,\" Shirude explained to the South Seattle Emerald.",
    "It takes a close examination of the textbooks' framing to understand where CRT exists.",
    "How do you provide easy-to-digest snapshots from a textbook framed around CRT?",
    "You can subscribe to his podcast here and follow him on Twitter: @jasonrantz.",
    "You won't find a textbook titled \"Math: A Critical Race Theory Examination.\"",
    "TeachingWorks is another recipient of Gates Foundation funding.",
    "They immediately demanded examples of problematic textbooks.",
    "The views expressed in this article are the writer's own.",
    "Left-wing educators were quick to embrace the \"pathway.\"",
    "They've seen victories in the Pacific Northwest.",
    "Despite the results, the district doubled down.",
    "DeSantis should be lauded for taking them on.",
    "This framework has hurt Seattle students.",
    "That's how they engage with other people.",
    "That's what they see as standard.",
    "That's what they see as normal.",
    "That's what they see as law."
  ]
}