{
  "id": 4425,
  "mediaId": 237,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Florida reinstates nine math textbooks after removal of 'woke content'",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/a2c85cb/2147483647/strip/true/crop/2332x1224+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F2b%2F27%2F438c3adc40de8ace1bf04a2ca71e%2Fap22061640569470.jpg",
  "link": "https://www.washingtonexaminer.com/policy/education/florida-reinstates-nine-math-textbooks-after-removal-of-woke-content",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Hutton",
  "authorUrl": "https://www.washingtonexaminer.com/author/christopher-hutton",
  "termIds": [
    661,
    2095,
    613,
    3223,
    3279,
    2661,
    2672
  ],
  "sentences": [
    "Im grateful that Commissioner Corcoran and his team at the department have conducted such a thorough vetting of these textbooks to ensure they comply with the law.?\nThe decision drew national attention, particularly in light of DeSantis's campaign to reject critical race theory, which holds that U.S. institutions are systemically racist, in Florida's educational institutions.",
    "It seems that some publishers attempted to slap a coat of paint on an old house built on the foundation of Common Core, and indoctrinating concepts like race essentialism, especially, bizarrely, for elementary school students,? DeSantis said.",
    "\"Publishers are aligning their instructional materials to state standards and removing woke content, allowing the department to add nine more books to the state adoption list over the past 11 days,\" the department said in a statement.",
    "Nine of the 54 textbooks banned due to references to racial or social justice will be allowed into Florida's schools in the coming school year, the state's Department of Education announced Thursday.",
    "The department announced on April 17 that it was removing 54 of the 132 math textbooks submitted for Florida's 2022-23 curriculum, a move that Florida Gov.",
    "Florida officials are allowing some of the math textbooks it initially banned over allegations of \"woke content\" to be reinstated.",
    "Representatives from the Florida Department of Education did not respond to a request for comment from the Washington Examiner.",
    "These updates included revising content related to measurements of racial prejudice and a portion of a book that read, \"What?",
    "Brian Kemp signed into law a prohibition on \"divisive concepts\" from classroom education, including CRT.",
    "\", under a subheading of a math textbook that read, \"Adding and Subtracting Polynomials.\"",
    "Other states have taken similar action to ban CRT from schools.",
    "On Thursday, Georgia Gov.",
    "Ron DeSantis praised.",
    "Racist?",
    "Me?"
  ]
}