{
  "id": 5235,
  "mediaId": 65,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "Ron DeSantis says if Stacey Abrams wins election it will create a Florida-Georgia 'cold war'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/3df92c92-c872-43e2-9c05-cb68285919df/6e1e571f-b512-4353-8820-f4d97fe42110/1280x720/match/image.jpg",
  "link": "https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LmZveG5ld3MuY29tL3BvbGl0aWNzL3Jvbi1kZXNhbnRpcy1zdGFjZXktYWJyYW1zLXdpbnMtZWxlY3Rpb24tZmxvcmlkYS1nZW9yZ2lhLWNvbGQtd2Fy0gFmaHR0cHM6Ly93d3cuZm94bmV3cy5jb20vcG9saXRpY3Mvcm9uLWRlc2FudGlzLXN0YWNleS1hYnJhbXMtd2lucy1lbGVjdGlvbi1mbG9yaWRhLWdlb3JnaWEtY29sZC13YXIuYW1w?oc=5/",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1951,
    2095,
    2230,
    146,
    2661,
    2672
  ],
  "sentences": [
    "\"If Stacey Abrams is elected governor of Georgia, I just want to be honest, that will be a cold war between Florida and Georgia,\" DeSantis said at a press conference about infrastructure, according to The Hill.",
    "Since then, she has become a star for the Democratic Party who was credited by liberals for bringing more Black voters to the polls and helping elect Democratic Georgia Sens.",
    "In a statement to Newsweek, a spokesperson for DeSantis said, \"The governor was simply making an analogy to the stark ideological differences that underpinned the Cold War.",
    "If Stacey Abrams wins the governorship of Georgia, we know that her approach to leadership will involve more heavy-handed government, taxes, and bureaucrat influence.",
    "Ron DeSantis on Friday said that if Stacey Abrams wins Georgia's gubernatorial election this fall it would cause a \"cold war\" between the two states.",
    "\"I cant have Castro to my south and Abrams to my north, that would be a disaster,\" he continued, referencing Cuba.",
    "In Florida, Governor DeSantis will continue to keep Florida free and put citizens first.\"",
    "Kemp and Perdue are both leading Abrams in the latest polling, according to The Hill.",
    "DeSantis' office didn't immediately return Fox News' late-night request for comment.",
    "Abrams lost to Kemp in a narrow election in 2018 in a race she has yet to concede.",
    "\"So I hope you guys take care of that and well end up in good shape.\"",
    "Former Republican Sen. David Perdue is also running against Kemp.",
    "Abrams, a Democrat, is running against Republican Gov.",
    "He added that he \"really appreciates our Georgians.\"",
    "Raphael Warnock and Jon Ossoff.",
    "Florida Gov.",
    "Brian Kemp."
  ]
}