{
  "id": 5236,
  "mediaId": 21,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "DeSantis says 'Cold War' could ensue between Florida and Georgia if Stacey Abrams wins governor race",
  "image": "https://i.insider.com/62510e77ee61990018dde72a?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/ron-desantis-cold-war-possible-florida-georgia-stacey-abrams-governor-2022-4",
  "sentiment": "0.0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Getahun",
  "authorUrl": "https://www.businessinsider.com/author/hannah-getahun",
  "termIds": [
    661,
    1951,
    2095,
    4844,
    78,
    2661,
    2672,
    2851
  ],
  "sentences": [
    "During a press conference Friday in Gulf County, Florida, while promoting a workforce development event, DeSantis spoke about the race in Georgia, seemingly encouraging Georgia residents to make sure they cost Abrams the election.",
    "\"I can't have Castro to my south and Abrams to my north, that would be a disaster,\" he said, adding: \"So I hope you guys take care of that and we'll end up in good shape.\"",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "\"If Stacey Abrams is elected governor of Georgia, I just want to be honest, that will be a cold war between Florida and Georgia,\" he said.",
    "Florida Governor Ron DeSantis said that a southern \"cold war\" could happen if Stacey Abrams wins Georgia's governor's race in November.",
    "The bill, touted as a tool for parental rights in schools, is just one of the numerous bills affecting LGBTQ rights across the country.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "In late March, he signed into law a controversial bill commonly known by critics as the \"Don't Say Gay\" bill.",
    "Ron DeSantis predicted a cold war between Florida and Georgia if Stacey Abrams wins the governor's race.",
    "DeSantis was apparently referencing Raul Castro, the former Cuban president who retired in April 2021.",
    "Ron DeSantis delivers remarks at the 2022 CPAC conference at the Rosen Shingle Creek in Orlando.",
    "Brian Kemp and former Sen. David Perdue in Georgia for the midterm elections in November.",
    "He went on to reference Raul Castro, former communist leader of Cuba, during his speech.",
    "DeSantis is also running his own race as he seeks reelection for governor of Florida.",
    "Both Abrams and DeSantis are running election campaigns in their respective states.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Abrams ran for governor in a highly publicized race in 2018 but lost to Kemp.",
    "Joe Burbank/Orlando Sentinel/Tribune News Service via Getty Images\nGov.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Abrams and DeSantis could not immediately be reached for comment.",
    "Stay up to date with what you want to know.",
    "Abrams is running against incumbent Gov.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "Florida Gov."
  ]
}