{
  "id": 6173,
  "mediaId": 151,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "POLITICO Playbook: Remembering Orrin Hatch",
  "image": "https://www.politico.com/dims4/default/f857403/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fe6%2F6b%2Ff14abe4a4ec9920d0f3d0c57425c%2F181005-orrin-hatch-gty-773.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/04/24/remembering-orrin-hatch-00027368",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    1164,
    2106,
    2159,
    2243,
    3103,
    403,
    571,
    2666,
    2744,
    2942
  ],
  "sentences": [
    "HAPPY BIRTHDAY: Rep. Mike Garcia (R-Calif.)  White Houses Mike Gwin  The Hills Al Weaver  Vanity Fairs Abigail Tracy  Andrew Kirtzman  Erin DeLullo  Zack Roday  Clark Packard  Alyssa Betz  Ruth Guerra  Meredith Shue ... Terron Sims II ... Jesica Wagstaff  Hillary Lassiter  POLITICOs Griffin Taylor  E&E News Miranda Wilson  Megan Sowards Newton of Jones Day  Conner Prochaska ... Stuart Chapman of Thorn Run Partners ... Megan Nashban Kenney  Robb Walton of BGR Group  Jameson Cunningham ... PayPals Megan Hannigan  Edelmans Luis Betanzo ... Smithsonians Gabriella Kahn  former Rep. Jack Kingston (R-Ga.)  Dana Wechsler Linden\nDid someone forward this email to you?",
    "Please dont turn your gaze away.?\n In a new profile of Austin, WaPos Dan Lamothe and Karoun Demirjian report that the Defense secretarys quiet public persona belies his forceful role behind the scenes, including warning his Russian counterpart shortly before the invasion: I know what youre doing, Austin told SERGEI SHOIGU in an icy, deep baritone.?\n Fascinating story: The Russian advance in Ukraine was slowed in part by a clandestine network of railway workers, hackers and dissident security forces? who sabotaged Belarusian railways that were key pieces of Russian supply lines, WaPos Liz Sly reports.",
    "Related read on CHRISTOPHER RUFO: The activist think tanker who helped put critical race theory? on the lips of every Fox News viewer now sees taking on LGBTQ issues in schools as even more politically potent,? NYTs Trip Gabriel reports in a new profile from Gig Harbor, Wash. Rufos seen major successes in Florida, and his cable news interviews tap into a similar playbook as he did on race.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "You saw what the attorney said, and were going to follow that advice.? Sandra Smith: So youre going to cooperate, meaning theres an ongoing investigation?? Cuellar: We will cooperate with law enforcement when they ask us to do that.? Smith: Why was there a raid?? Cuellar: Well again, as I said, we will cooperate if theres any questions on that issue.?\n Sen. ELIZABETH WARREN (D-Mass.)",
    "But with immigration politics perpetually a charged issue, theres backlash too, as Latino state legislators resigned from party leadership posts: To some Democrats, it appeared to be an embrace of GOP tactics and an unnecessary doubling down on an issue that Republicans are going to criticize her on regardless.?\n8.",
    "A lot of people, a lot of countries are actually bringing [diplomats] back to Kyiv, but the least we can do [is] actually bring it maybe to Lviv.?\n Rep. HENRY CUELLAR (D-Texas) on whether hes involved in any investigation after the FBI raided his home, on Fox News Sunday?: I have deep respect for law enforcement.",
    "And yet at the same time, Hatch, in his farewell speech on the Senate floor, lamented the political hardening of the country, while maintaining that his Senate service had been the honor of his life.?\nKSLs Lisi Merkley has a roundup of many of the tributes to Hatch that poured in from Utah politicians Saturday.",
    "Related read: A North Carolina GOP county chair threatened to get a county elections director fired or have her pay cut unless she helped him gain illegal access to voting equipment,? part of a drive to audit? the 2020 election results fueled by false conspiracy theories, Reuters Nathan Layne scoops.",
    "SUNDAY BEST \n IGOR ZHOVKVA, an adviser to Ukrainian President VOLODYMYR ZELENSKYY, on what they need from the U.S., on NBCs Meet the Press?: We definitely need some more weapons in terms of defending the sky over Ukraine, because NATO countries refuse to close the skies over Ukraine.",
    "What they want is they want power for themselves rather than to help the American people.?\nMore from Warren on Meet the Press?: Im not running for president in 2024, Im running for Senate.?\nABOUT LAST NIGHT  At Trumps Ohio rally Saturday night, the former president touted J.D.",
    "HOT ON THE RIGHT: Paging through the Obama White House visitor logs, N.Y. Posts Jon Levine and Miranda Devine report that ERIC SCHWERIN, the business partner of HUNTER BIDEN, met with top officials including then-VP Biden across 19 government visits from 2009 to 2015.",
    "The news has not gone over well at CNN, roiled by a series of recent shocks, where employees remain stunned.?\nPLAYBOOKERS\nIn Las Vegas tonight, the National Association of Broadcasters will induct NBCs Lester Holt and NPRs All Things Considered? into its Hall of Fame.",
    "TITLE 42 FALLOUT: Sen. MAGGIE HASSAN (D-N.H.) has angered progressives and immigration advocates back home with her recent trip to the southern border and push for the Biden administration to reverse its Title 42 decision, Sabrina Rodrguez reports this morning.",
    "The companys execs had experienced bad luck with single-topic streaming services; their niche platforms dedicated to cars, food and golf were costly and ended in failure,? and low initial numbers for CNN+ raised a red flag as they looked to elevate HBO Max.",
    "A conservative champion who retired in 2019 after helping to shepherd Republicans major tax reform law, Hatch played a big role in confirming Supreme Court nominees and was a stalwart of the right on many issues, notably religious liberty and labor unions.",
    "The high-profile Republican bills in several states to limit classroom instruction about sexual orientation and gender identity, along with the false groomer? rhetoric, is starting to worry some GOP strategists, WaPos Annie Linskey and Casey Parks report.",
    "POLITICO Playbook: Remembering Orrin Hatch\nBy ELI OKUN\n04/24/2022 11:24 AM EDT\nPresented by\nDRIVING THE DAY\nELECTION DAY IN FRANCE  Will MARINE LE PEN send a Brexit-like shock tremor through the world, or will French President EMMANUEL MACRON hold on?",
    "More from NBC\n Just posted: Russian President VLADIMIR PUTIN has soured on the idea of a peace deal, which he was seriously considering? last month, and now just wants to capture as much of Ukraine as he can, FTs Max Seddon and Henry Foy report.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nLATEST DEVELOPMENTS IN UKRAINE \n On Orthodox Easter, Secretary of State ANTONY BLINKEN and Defense Secretary LLOYD AUSTIN will be in Kyiv today to meet with Zelenskyy, the Ukrainian president announced Saturday.",
    "Among the landmark legislation he helped champion were the Americans with Disabilities Act, the Childrens Health Insurance Program, a law that created the generic drug industry and one that slapped health warnings on cigarette packs.",
    "The Russian president appears to hold a distorted view of the war as set out by his generals and depicted on Russian television.?\n Russia is continuing to bomb the Azovstal steel plant, the last holdout in Mariupol, per the NYT.",
    "REGARDING TRUMPS GRIP ON THE GOP: Michigan Republicans officially endorsed MATT DEPERNO for A.G. and KRISTINA KARAMO for secretary of state in high-profile battles for the future of the GOP at their party convention Saturday.",
    "In his later years in the Senate, Hatch lost much of his deal-making persona,? becoming a strong backer of DONALD TRUMP, The Salt Lake Tribunes Matt Canham and Thomas Burr write in a comprehensive obituary.",
    "His tenure spanned the end of the Ford administration to the middle of the Trump administration, including stints chairing multiple powerful committees and serving as the chambers president pro tempore.",
    "An upcoming biography from William Doyle declares him a Titan of the Senate.?\nHatchs humble beginnings included a childhood in poverty in Pittsburgh, where his family didnt have indoor plumbing.",
    "But awareness of the pills and access to them are limited, prompting a scramble among advocates to educate the public in the next few months, Alice Miranda Ollsten and Megan Messerly report.",
    "9 THINGS FOR YOUR RADAR:\n1. MY KEVIN IN THE SPOTLIGHT: House Minority Leader KEVIN MCCARTHY may have been spared for now from Trumps rage over his private break with Trump post-Jan. 6.",
    "DePerno and Karamo, both Trump-backed, rose to political prominence levying unproven claims of fraud in the November 2020 presidential election,? notes The Detroit News Craig Mauger.",
    "Balz is even more unsparing: In his ceaseless drive to become the next speaker of the House, he has demonstrated weakness, hypocrisy and a willingness to lie to save his skin.?\n2.",
    "MISINFORMATION IN THE MIDTERMS: Election officials say that after 2020, theyre anticipating another onslaught of misinformation during the fall campaign, APs Amanda Seitz reports.",
    "Were trying to lower costs for the family whos standing there at the grocery checkout line and trying to figure out what to send back because they dont have enough money to cover.",
    ": If the Supreme Court strikes down Roe v. Wade, medication abortion pills ordered in the mail could become the method of choice for many people seeking to end their pregnancies.",
    "CNN+ TICK-TOCK: NYTs John Koblin, Michael Grynbaum and Benjamin Mullin delve into the streaming services quick death, which came shortly after DAVID ZASLAV took over Warner Bros.",
    "So we also need anti-missile systems and anti-aircraft systems, because daily and nightly Ukrainian cities are bombarded by the cruise missiles.?\n Rep. VICTORIA SPARTZ (R-Ind.)",
    "With a newly expanded conservative majority thats been particularly aggressive on religious liberty, the coachs backers are feeling hopeful about a ruling in their favor.",
    "Weisman writes that McCarthys lie would once have been considered career-ending for a politician,? until the Trump-era GOP stopped punishing people who cross such lines.",
    "The White House didnt respond to requests for comment, but you can bet this will be a focus of investigation for House Republicans if they retake the chamber this fall.",
    "If the party seems anti-gay, it could invite a political backlash among moderate voters who might otherwise be open to a parental rights in the classroom? pitch.",
    "But the fallout from McCarthys lying about the situation continues, exemplified by a pair of brutal new analyses from NYTs Jonathan Weisman and WaPos Dan Balz.",
    "Keep up with live updates from our colleagues in Europe\nIN MEMORIAM  Utahs ORRIN HATCH, the longest-serving Republican senator in history, died Saturday at 88.",
    "Some Republican strategists are concerned enough about the new laws and rhetoric that they are working to launch campaigns against the measures,? they write.",
    "And thousands of volunteers will work with advocacy groups like Common Cause to bat down false rumors and flag them to social media platforms in real time.",
    "And we cant help but link to the classic moment when Hatch tried to take off glasses he wasnt wearing, which the senator himself enjoyed afterward.",
    "In fact, if I went by that standard, I dont think I wouldve ever endorsed anybody in the country.? Vance was both booed and cheered by the crowd.",
    "The pills are already the most common abortion method, but not many Americans know about them, and new laws in many Republican states ban them.",
    "Playbook couldnt happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Bethany Irvine, Eli Okun and Garrett Ross.",
    "The justices will consider the story of JOE KENNEDY, a Washington state high school football coach who was fired for praying on the field.",
    "The reservoir of sentiment on the sexuality issue is deeper and more explosive than the sentiment on the race issues,? Rufo tells Gabriel.",
    "The Kitsap Suns Andrew Binion has a thorough primer on the case and the question of whether Kennedys prayers pressured players to join.",
    "offering up what could be a Democratic midterm message, on State of the Union?: The Democrats are out there trying to do something.",
    "TRANSITIONS  After almost two years in retirement, Mark Pettitt has returned to be chief of staff for Rep. Mo Brooks (R-Ala.).",
    "SCOTUS WATCH: The Supreme Court on Monday will take up a case with the potential for a major religious freedom ruling.",
    "The big question for Republicans: Will they be able to get enough independent voters to unseat Democratic incumbents?",
    " Russian attacks continued elsewhere, as Ukrainian officials said a strike in Odesa killed eight, including a baby.",
    "Hatch passed more bills into law than any other living senator at the time of his retirement, his foundation said.",
    "Ukraine claimed Russia was forcibly deporting Mariupol civilians to Vladivostok, at the far end of Asia, per CNN.",
    "on whether the U.S. should reopen diplomatic facilities in Ukraine, on CNNs State of the Union? from Kyiv: Yeah.",
    "VANCE for Senate and brushed aside Vances past criticisms of him, The Columbus Dispatchs Haley BeMiller reports.",
    "POLITICOs poll of polls showed Macron gaining ground in the final week: As of Friday, he led Le Pen 55% to 45%.",
    "Drop me a line here, or get in touch with the rest of the team: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "Joe Biden put out a statement officially recognizing the Armenian genocide for the second year in a row.",
    "In one of this falls key swing Senate races, Hassans trip could help shore up support from independents.",
    "But he also retained an independent streak and a prominent bipartisan friendship with Sen. TED KENNEDY.",
    "They have no ideas on the economy other than to impose pain on American families and small businesses.",
    "A WHCD CALLOUT: The White House Correspondents Dinner is coming up Saturday, in case you lost track.",
    "Some offices are getting proactive, offering explainers and responding to false claims in real time.",
    "On Monday well be publishing a comprehensive guide to all the festivities  and we need your help!",
    " Kiara Kearney is now deputy press secretary/digital director for Rep. Lisa McClain (R-Mich.).",
    "Next up: Hes launching a series of articles on classroom practices he deems outrageous.?\n6.",
    "The Ukrainian counteroffensive continued too, claiming a Russian command post in Kherson.",
    "Now the election deniers are seeking to oversee election administration and prosecutions.",
    "VP KAMALA HARRIS SUNDAY  The VP is in Los Angeles and has nothing on her public schedule.",
    "More from the AP\n CNNs Jim Sciutto: Russian forces are proving ruthless in Ukraine.",
    "He variously had stints as a lawyer, an amateur boxer and a pop/folk songwriter.",
    "PRESIDENT JOE BIDENS SUNDAY  The president has nothing on his public schedule.",
    "Biden has previously said he had nothing to do with his sons overseas work.",
    "The French election is underway today, with low turnout reported thus far.",
    "Its the first trip by senior American leaders to Ukraine during the war.",
    "She most recently was a staff assistant for Sen. Deb Fischer (R-Neb.).",
    " Sam Wright will be a managing director at Husch Blackwell Strategies.",
    "RON DESANTIS may have gone too far? in his latest attack on Disney.",
    "There is evidence virtually every day of WW2-level war crimes here.",
    "You know what, every one of the others did also,? Trump said.",
    "The U.S. has declined to confirm it publicly thus far.",
    "Several towns were shelled, and several others taken.",
    "Hatch briefly ran for president in the 2000 election.",
    "Others dont have the capacity to tackle such a task.",
    "He previously was an associate at Targeted Victory.",
    "Send Playbookers tips to playbook@politico.com.",
    "GOP donor DAN EBERHART tells them Florida Gov.",
    "Theyre saying, lets fight the culture wars.",
    "The Library of Congress turns 222 today.",
    "Were trying to save small businesses.",
    "Please send us details of your event.",
    "And what are the Republicans doing?",
    "Polls close at 2 p.m. D.C. time.",
    "Thanks for reading Playbook.",
    "Were going to cooperate.",
    "THE FUTURE OF ABORTION?",
    "Good Sunday morning.",
    "HOW FAR IS TOO FAR?",
    "Thats not an idea.",
    "Sign up here.",
    "Discovery.",
    "9.",
    "7.",
    "4.",
    "5.",
    "3."
  ]
}