{
  "id": 6375,
  "mediaId": 21,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Trump endorses 'Never Trump guy' JD Vance, ignoring many Ohio Republicans who wanted him to pick a different candidate in a key Senate race",
  "image": "https://i.insider.com/618994c7326b26001835526e?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/trump-endorses-jd-vance-ignoring-ohio-republicans-in-senate-race-2022-4",
  "sentiment": "0.0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brent D. Griffiths",
  "authorUrl": "https://www.businessinsider.com/author/brent-d-griffiths",
  "termIds": [
    661,
    1147,
    1766,
    1801,
    2466,
    3103,
    428,
    571,
    2845
  ],
  "sentences": [
    "\"While we were working hard in Ohio to support you and Make America Great Again, JD Vance was actively working against your candidacy,\" the letter said, adding Vance did not support Trump in 2016 and saying \"he referred to your supporters as 'racists.'\"",
    "Republicans are hopeful that they can retake Congress, but as Senate Minority Leader Mitch McConnell has warned the GOP's past nomination of flawed candidates ultimately doomed their chances at the Senate majority in 2010 and 2012.",
    "Trump's decision to back Vance fits with a frequent trend of granting endorsements to candidates that are often outside the GOP establishment and may not have ever held elected office.",
    "\"He was an incredible fighter for hard working Americans in the White House, he will be again, and I'll fight for the America First Agenda in the Senate,\" Vance wrote on Twitter.",
    "This cycle the former president has already had to yank his backing from Rep. Mo Brooks, an Alabama Senate candidate who never caught fire after Trump's early endorsement.",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "The most recent Fox News poll conducted in early March showed businessman Mike Gibbons (22%) and former state Treasurer Josh Madel (19%) locked in a virtual dead heat.",
    "It doesn't help matters that Trump's first pick in the key Pennsylvania US Senate race, Sean Parnell, dropped out amid claims that he abused his estranged wife.",
    "Vance on Friday, backing the \"Hillbilly Elegy\" author and venture capitalist even after top Ohio Republicans tried to convince him not to endorse him.",
    "Dozens of local GOP officials sent a letter to Trump, obtained by Politico, listing off the scorching anti-Trump comments Vance had made in the past.",
    "As news of Trump's impending endorsement leaked, Ohio Republicans mounted a last-minute effort to get the former president to change his mind.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,\" Trump said.",
    "Trump takes his endorsements seriously and how his favored-picks fare will be a key storyline as the 2022 midterm elections unfold.",
    "Vance (11%) was either in third or fourth with a too close to call margin between him and former Ohio GOP chair Jane Timken (9%).",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Jeffrey Dean/AP Photo\nTrump endorsed \"Hillbilly Elegy\" author JD Vance in a closely contested Ohio GOP Senate race.",
    "Independent polling of the race has been sparse, but it shows Vance is far from running away with the nomination.",
    "The former president's backing comes despite a last-minute campaign to convince him to support someone else.",
    "On Twitter, Vance later touted his support for independent candidate Evan McMullin in the general election.",
    "On CNN, Vance said that Trump's 2016 campaign was \"actively antagonizing a lot of the Black voters.\"",
    "While the former president has rankled some Pennslyvania Republicans by endorsing Dr. Mehmet Oz.",
    "Ohio has been good to me, I won it twice, really BIG, and I have likewise been GREAT for Ohio.",
    "Then-Rep. Ron DeSantis was not the legacy-favored GOP pick before Trump endorsed him.",
    "Vance was once a frequent Trump critic, but now portrays himself as a close ally.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Now, DeSantis' star is so bright that he might even challenge Trump in 2024.",
    "Timken herself was within the margin of error of State Sen. Matt Dolan (7%).",
    "\"He is our best chance for victory in what could be a very tough race.\"",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Vance is involved in a hotly contested Republican Senate primary.",
    "Or as Vance once put it to Charlie Rose, \"I'm a Never Trump guy.\"",
    "Vance said he was \"incredibly honored\" to have Trump's support.",
    "Former President Donald Trump endorsed his one-time critic J.D.",
    "As the letter pointed out, Vance was a frequent Trump critic.",
    "Sometimes this works out well for the former president.",
    "But other times, it has risked Trump's political brand.",
    "The poll had a plus/minus 3% margin of error.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Vance, Ohio gets both brains and brawn.",
    "Loading Something is loading.",
    "Trump said in a statement.",
    "\"Like some others, J.D.",
    "Let's keep it going!\"",
    "\"With J.D."
  ]
}