{
  "id": 6942,
  "mediaId": 43,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Overnight News Digest: Russia attempts to grind Ukraine down; Sec. Clinton warns of fascism in US",
  "image": "https://images.dailykos.com/images/724510/story_image/ond-trainwreck1.jpg?1570215182",
  "link": "https://www.dailykos.com/story/2022/4/27/2094466/-Overnight-News-Digest-Russia-attempts-to-grind-Ukraine-down-Sec-Clinton-warns-of-fascism-in-US",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3102,
    5256,
    5310,
    5404,
    5405,
    5240,
    2870,
    2888,
    2942
  ],
  "sentences": [
    "The Daily Beast\nPutins Stooges: He May Nuke Us All but We Are Ready to Die\nRussian President Vladimir Putin ominously warned on Wednesday that if any other country intervenes in Ukraine, Russia will respond with instruments nobody else can boast of, and we will use them if we have to.?\nIn recent days, Russian state media has been hyping up the same rhetoric, bombarding audiences with jarring declarations that World War III is imminent.",
    "Weve proven that, but now this movement is a response to the movement that is trying to silence voices.?\nMilwaukee Independent\nOpEd: The Attack on Disney: A Case Study for How Fascism Progresses Toward Tyranny in America\nFloridas Republican Governor Ron DeSantis has declared war on Disney, while his colleague in Texas, Republican Governor Greg Abbott, is on a jihad against the parents of trans children.",
    "ABC News\nDHS secretary grilled on ending Title 42, preparation for immigrant influx\nHomeland Security Secretary Alejandro Mayorkas faced blunt questions from lawmakers on Wednesday about how the Biden administration is handling and preparing for the eventual end of pandemic-justified border restrictions that have reduced humanitarian relief options for asylum seekers at the border.",
    "Last week in Gettysburg, a far-right Christian conference called Patriots Arise for God and Country? drew State Sen. Doug Mastriano, a GOP front-runner for Pennsylvania governor; Teddy Daniels, a candidate for lieutenant governor; Maryland gubernatorial candidate Dan Cox; Liz Harrington, a spokesperson for  Donald Trump; and former Trump campaign attorney Jenna Ellis.",
    "Los Angeles Times\nMcCarthy defends Jan. 6 audio as House GOP backs next speaker\nHouse Republican leader Kevin McCarthy told colleagues Wednesday he never asked  Trump to resign over the Jan. 6, 2021, insurrection at the Capitol as he defended private conversations around the siege that have spilled into the open and jeopardized his leadership.",
    "He added that the coming events would determine the future of our state.?\nCNN\nRussia shifts tactics, steps up pace of assault in Ukraines east and south\nThe war in eastern Ukraine appears to be entering a critical phase, as Russia pours in more fighting units and Ukrainian forces try to hold lines battered by weeks of shelling and rocket fire.",
    "Business Insider\nJoe Manchin all but shuts the door on supporting Biden's social plans like universal pre-K and affordable childcare\nSen. Joe Manchin of West Virginia all but closed the door on reviving swaths of social spending from the defunct Build Back Better legislation, ensuring any Democratic bill will be far smaller in scope.",
    "On Monday, a federal judge in Louisiana indicated he would pause the rollback of Title 42 -- the Trump-era policy that allowed migrants seeking asylum along the southern border to be expelled under the public health emergency authority of the Centers for Disease Control and Prevention -- in order to mitigate the spread of COVID-19.",
    "Another voiced confidence that McCarthy would be the next speaker.?\nThe Verge\nConservative Twitter accounts got boost in followers after Musk acquisition, data shows\nIts not your imagination: follower counts on Twitter really have been shifting wildly in response to news that Elon Musk had finalized a deal to acquire the platform.",
    "Gizmodo\nIndia Swelters Under Heatwave, With Temperatures Set to Hit 118 Degrees\nPeople in India continue to sweat under a blistering heatwave, with temperatures forecasted to max out at 118 degrees Fahrenheit (48 degrees Celsius) over the coming days, the India Meteorological Department said in a press release today.",
    "Houston Chronicle\nBook smugglers plan caravans from Houston, San Antonio to start underground library for banned books\nA decade ago, Tony Diaz and four other Latinos organized a caravan to deliver forbidden books and history to Tucson, Ariz., where a Mexican-American studies program had been banned from schools.",
    "Reuters\nBelarus eyes wider death penalty use after anti-war railway sabotage\nBelarus moved on Wednesday to make attempted acts of terrorism punishable by the death penalty after activists tried to sabotage parts of the railway network to make it harder for Russia to deploy forces into Ukraine for its invasion.",
    "It has reduced my earnings but what alternative do I have??\nNPR News\nFauci says the U.S. is 'out of the pandemic phase'\nThe U.S. is no longer in the grip of the COVID-19 pandemic, despite the coronavirus's continuing global threat, according to Dr. Anthony Fauci, chief medical adviser to President Biden.",
    "Italy and the Netherlands were also big importers, with about 6.8bn and 5.6bn respectively, but as those countries operate major ports, which take in products for refining and use in the chemical industries as well as for domestic consumption, many of those imports were probably used elsewhere.",
    "Data compiled by The Verge from social media statistics site Social Blade shows that in the two days since the deal was completed, influential conservative accounts have increased their follower counts at roughly ten times the average daily rate for the month leading up to the acquisition.",
    "Roll Call\nBiden, Clintons remember Albright, and her warnings about threats to democracy\nGenerations of dignitaries, including three U.S. presidents and many members of Congress, gathered Wednesday to remember the late Secretary of State Madeleine Albright, who died last month at age 84.",
    "But if we do deliver, if we can get some tangible results that touch peoples lives, then we can go to the polls in November with our heads held high.? []\nSumming up her role in the fractious Democratic Party at the moment, Warren said: My job right now is to light the fire of urgency.",
    "We cant waste a single day.?\nAP News\nDem lawmaker: Biden suggests hell ease student loan burden\nPresident Joe Biden has signaled he might forgive some student loan debt and further extend the federal moratorium on repayments, a lawmaker who discussed the issue with him said Wednesday.",
    "South China Morning Post\nCoronavirus: China urged to be more precise and scientific with controls as economic toll mounts\nChina has been urged to avoid excessive pandemic controls and provide a clear exit strategy from its hardline zero-Covid policy to mitigate damage to the economy.",
    "The Metropolitan Water Districts board voted unanimously today to require six major water providers and the dozens of cities and local districts they supply to impose one of two options: limit residents to outdoor watering once a week or reduce total water use below a certain target.",
    "It was the first time McCarthy (R-Bakersfield), who is in line to become House speaker if Republicans win control in the fall midterm election, addressed his colleagues face-to-face as he works to stem the fallout from his criticisms of Trump and far-right members of their party.",
    "The coronavirus pandemic interrupted vaccination campaigns for many diseases around the world, creating a perfect storm? that could now put millions of childrens lives at risk, the United Nations Childrens Fund (UNICEF) and the World Health Organization (WHO) said in a statement.",
    "Cal Matters\n6 million Southern Californians face unprecedented order to conserve water\nUnprecedented water restrictions are in store for about 6 million Southern Californians, a sign of deepening drought in counties that depend on water piped from the states parched reservoirs.",
    "The New York Times\n20 Percent of Reptiles Risk Extinction\nAbout 20 percent of reptile species risk extinction, mainly because people are taking away their habitats for agriculture, urban development and logging, according to the first global reptile assessment of its kind.",
    "The text from Greene (R-Ga.), revealed this week, brought to the fore the chorus of Republicans who were publicly and privately advocating for Trump to try to use the military and defense apparatus of the U.S. government to strong-arm his way past an electoral defeat.",
    "Almost 17,338 measles cases were reported worldwide in January and February 2022, compared to 9,665 during the first two months of 2021,? the UN agencies said, adding that cases of highly-transmissible measles tend to show up quickly when vaccination levels decline.",
    "Al Jazeera\nMeasles cases surge worldwide, UN agencies warn\nMeasles cases have surged by nearly 80 percent worldwide this year, the United Nations said on Wednesday adding that the rise in cases of measles was a forewarning of the likely outbreaks of other diseases.",
    "AFP\nUkraine faces extremely difficult weeks ahead: defense minister\nUkraines Defence Minister Oleksiy Reznikov on Wednesday said Kyiv faced extremely difficult weeks? ahead, warning of major destruction? in a developing Russian offensive in the east of the country.",
    "That came after Representative Mike Turner, the top Republican on the House Intelligence Committee, and Senator Marco Rubio, the vice chairman of the Senate Intelligence Committee, wrote separate letters urging the Biden administration to remove the restrictions.",
    "The Guardian\nRussia doubles fossil fuel revenues since invasion of Ukraine began\nRussia has nearly doubled its revenues from selling fossil fuels to the EU during the two months of war in Ukraine, benefiting from soaring prices even as volumes have been reduced.",
    "Ars Technica\nRussia wages relentless and destructive? cyberattacks to bolster Ukraine invasion\nOn March 1, Russian forces invading Ukraine took out a TV tower in Kyiv after the Kremlin declared its intention to destroy disinformation? in the neighboring country.",
    "The Atlantic\nTheres No Scenario in Which 2050 Is Normal\nEarlier this month, the United Nationsled Intergovernmental Panel on Climate Change released the latest volume of its current synthesis report,? its omnibus summary of what humanity knows about the climate.",
    "Young voters are an especially important group for Democrats: They delivered Bidens biggest margins in 2020, a year that saw half of them turn out (an 11 percentage-point increase from 2016), including in battleground states that will feature competitive races.",
    "\"And yes, once again, we must heed the wisdom of her life and the cause of her public service: Stand up to dictators and demagogues from the battlefields of Ukraine to the halls of our own Capitol, defend democracy at home just as vigorously as we do abroad.\"",
    "Sharing More Intelligence With Ukraine for Fight in Donbas\nThe U.S. has lifted some restrictions on sharing intelligence with Ukraine as it confronts a renewed Russian military assault in the east and south, according to two people familiar with the matter.",
    "The Librotraficantes, which translates to book traffickers, plan to lead a pair of caravans loaded with banned books to Austin from Houston and San Antonio Friday with a similar mission to 10 years ago: spread the words others have sought to suppress.",
    "The Philadelphia Inquirer\nA top Republican candidate for governor campaigned at an event promoting QAnon and conspiracy theories about 9/11\nWhen candidates for public office indulge in conspiracy theories like QAnon, its often with a wink and a nod.",
    "Some extremely difficult weeks lie ahead Russia has already gathered forces for a large-scale offensive in eastern Ukraine,? he added, saying Moscow will try to inflict as much pain as possible? and warned of destruction and painful casualties?.",
    "On Wednesday, the Ukrainian military acknowledged losing territory in two different areas of the long front lines they are defending, a reflection perhaps of the sheer volume of Russian forces being deployed as well as improving Russian tactics.",
    "\"Destructive forces are continuing terrorist (and) extremist activity by trying to rock the situation in Belarus, provoking domestic instability and conflicts,\" house speaker Vladimir Andreychenko said, alluding to acts sabotage on the railway.",
    "I am hoping that this is going to open the eyes of our community members,? said Diaz, who 24 years ago founded Nuestra Palabra, which started as a group of Latino writers and has evolved into a mission to promote Latino literature and culture.",
    "[]\nThe research, published Wednesday in Nature, adds another dimension to a substantial body of scientific evidence that points to a human-caused biodiversity crisis similar to climate change in the vast effect it could have on life on Earth.",
    "[]\nHost Olga Skabeeva described a summit hosted by the U.S. in Germany that day to discuss upping Ukraines defense capabilities as a sign that this is indeed World War III, no longer just a special operation, with forty countries against us.",
    "They declared a war.? Portraying global opponents of Russian aggression as evil incarnate, political scientist Mikhail Markelov claimed: The representatives of those forty different countries are todays collective Hitler.?\nBloomberg\nU.S.",
    "A growing number of communities across China are being placed under lockdown immediately after a new infection is detected, as local officials prioritise containment of the Omicron outbreak sweeping the country over economic performance.",
    "In subpoenas, document requests and court filings, the panel has demanded information about any Trump administration plans to use presidential emergency powers to invoke martial law or take other steps to overturn the 2020 election.",
    "The flow of production factors are the presumptions for growth,? said Yang Weimin, deputy director of the economic affairs committee under the Chinese Peoples Political Consultative Conference, a political advisory body.",
    "Russia has received about 62bn from exports of oil, gas and coal in the two months since the invasion began, according to an analysis of shipping movements and cargos by the Centre for Research on Energy and Clean Air.",
    "It would also be a win for Democratic and progressive leaders who have long pressed Biden to carry through on a 2020 campaign promise that as president he would immediately? cancel up to $10,000 in debt per student.",
    "x\nx\nx\nThe Washington Post\nTalk of martial law, Insurrection Act draws notice of Jan. 6 committee\nThree days before Joe Bidens inauguration, Rep. Marjorie Taylor Greene texted White House Chief of Staff Mark Meadows.",
    "The Democratic Chair of the House Appropriations Committee, Rep. Lucille Roybal-Allard, asked Mayorkas directly if he believes it's time to end Title 42 and, as he has done before, Mayorkas deferred to the CDC.",
    "[]\nHillary Clinton  turned to Albright's 2018 book \"Fascism: A Warning,\" published during Trump's time in the White House, about the risks of authoritarianism coming even to the shores of the United States.",
    "Now, discussions involving the Trump White House about using emergency powers have become an important  but little-known  part of the House Jan. 6 committees investigation of the 2021 attack on the Capitol.",
    "Every major channel is promoting the idea of an inevitable, never-before-seen escalation over Russias invasion of Ukraine, which is being portrayed as a war waged against the Kremlin by the collective West.",
    "The Security Service of Ukraine (SBU) is working with the national and local police, Territorial Defense units and the State Emergency Service to find suspected collaborators and prosecute them for treason.",
    "Since shortly before the invasion began, the company said, hackers in six groups aligned with the Kremlin have launched no fewer than 237 operations in concert with the physical attacks on the battlefield.",
    "The White House was notably more measured about Bidens stance, but such moves would be a boon to many of the 43 million Americans carrying student loans worth $1.6 trillion, according to federal figures.",
    "High heat in India began earlier this month, and data from the Copernicus Sentinel-3A satellite showed ground temperatures exceeding 122 degrees F (50 degrees C) in some parts of the country on April 12.",
    "She told him that some Republican members of Congress believed the only path for President Donald Trump to change the outcome of the 2020 election and stay in power was for him to declare martial law.",
    "Deutsche Welle\nRussia's Gazprom halts gas supplies to Poland, Bulgaria\nRussian energy giant Gazprom on Wednesday halted gas supplies to Bulgaria and Poland over a failure to pay for gas in rubles.",
    "[]\nWith midterms around the corner, this dissatisfaction could drag Democratic candidates already expected to struggle (the presidents party historically does poorly in midterms) down further.",
    "That public act of kinetic destruction accompanied a much more hidden but no less damaging action: targeting a prominent Ukrainian broadcaster with malware to render its computers inoperable.",
    "It usually happens from within, and is driven by an alliance between demagogic politicians, corrupt religious leaders, bigoted street brawlers, and some of the wealthiest people in society.",
    "According to the World Health Organization, Indias heatwave season begins in March and can last until June (or July in some cases), with upwards of five or six individual heatwave events.",
    "The expanded sharing is intended to help Ukraine defend and potentially retake territory in those regions, the person said, speaking on condition of anonymity about the sensitive matter.",
    "The Kyiv Independent\nUkrainian law enforcers search for collaborators who helped Russians\nThe Russian soldiers that occupied settlements in Kyiv Oblast killed over a thousand civilians.",
    "The book smugglers? return this week, spurred by the wave of book challenges and bans that has spread across the country over the last year, with some parts of Texas leading the charge.",
    "Its another drumbeat on the path to ecological catastrophe,? said Bruce Young, co-leader of the study and a senior scientist at NatureServe, a nonprofit conservation research group.",
    "But the energy-system models used in the most recent IPCC report tell us something else too: The path to avoiding the worst impacts of climate change requires something impossible.",
    "Many people were hunted down systematically for being local political leaders, Donbas combat veterans, Territorial Defense joinees or other people of interest to the Russians.",
    "If we dont deliver, if we dont get up off our rear ends and make it happen, were in real trouble,? the Massachusetts Democrat said in an interview in her office on Tuesday.",
    "Crew-4 boarded a brand new Crew Dragon capsule and launched on a SpaceX Falcon 9 rocket to the ISS at 3:52 a.m. EDT from launch Pad 39A at Kennedy Space Center in Florida.",
    "[]\nThese models are useful because they produce scenarios: story lines that show how the world can meet its energy needs while gradually zeroing out its carbon pollution.",
    "NASA astronauts Kjell Lindgren, Bob Hines and Jessica Watkins are joined by European Space Agency astronaut Samantha Cristoforetti on the mission to the space station.",
    "The dual action is one of many examples of the hybrid war? Russia has waged against Ukraine over the past year, according to a report published Wednesday by Microsoft.",
    "Patriotic citizens are now being primed for the idea that even the worst outcome is a good thing, because those dying for the motherland will skyrocket to paradise.",
    "UPI\nNASA's Crew-4 prepares to dock at ISS following delayed launch\nNASA and SpaceX launched four astronauts to the International Space Station early Wednesday.",
    "[]\nGermany was the biggest importer in the last two months, despite repeated avowals by the government that halting dependence on Russian oil was a priority.",
    "Politico\nWarren tries to 'light the fire of urgency' for Democrats\nAs Elizabeth Warren surveys the landscape for her party, she does not like what she sees.",
    "Meanwhile, popular liberal accounts have suffered, collectively losing hundreds of thousands of followers on April 25th and 26th after a month of gains.",
    "These collaborators helped Russian forces either track down targets, locate wealthy homes to loot or get information about Ukrainian military positions.",
    "Essentially Ukrainian forces are defending three sides of a slowly shrinking pocket in the east, with their only supply lines running in from the west.",
    "Almost 40 of them targeting hundreds of systems used wiper malware, which deletes essential files stored on hard drives so the machines cant boot.",
    "Gazprom said that it hadn't received payments in rubles since April 1 from Poland and Bulgaria and was suspending deliveries as of Wednesday.",
    "The decline has been worse among young people of color, and like the country in general, young Americans dissatisfaction with him is growing.",
    "First, fascists identify groups of people they believe are both vulnerable and sufficiently powerless that they wont be able to fight back.",
    "As I wrote at the time, while the other volumes focus on the impacts of climate change, this newest report narrows in on how to prevent it.",
    "The risk  if the Russians make progress  is that some of the Ukrainian armys best units, lacking protection from the air, could be cut off.",
    "\"Namely, we don't have 900,000 new infections a day and tens and tens and tens of thousands of hospitalizations and thousands of deaths.",
    "And high-profile Republican candidates for statewide office are treating talk of a global satanic blood cult? like regular campaigning.",
    "Among reptiles, particularly hard hit are turtles, with almost 60 percent of species at risk of extinction, and crocodiles, with half.",
    "If you look at just about any poll from the last year, the presidents support among Americans aged 18-34 has dropped significantly.",
    "Such a collapse threatens humans because healthy ecosystems provide necessities like fertile soil, pollination and water supplies.",
    "The Belarusian lower house of parliament approved the change to the criminal code in two readings, the Belta news agency reported.",
    "Manchin wants any social policy changes to attract Republican support and reach 60 votes in the Senate to overcome a filibuster.",
    "One of the main tools that the volume uses to estimate how we might avert climate catastrophe is so-called energy-system models.",
    "[]\nGerman President Frank-Walter Steinmeier reacted to the announcement by saying it was a \"blackmail attempt\" by Russia.",
    "The Overnight News Digest is a nightly, community series chronicling the days news and the American dystopia since 2007.",
    "Director of National Intelligence Avril Haines told Congress of the moves this month, according to one of the people.",
    "\"We are certainly right now in this country out of the pandemic phase,\" Fauci said in an interview with PBS NewsHour.",
    "The change now needs backing from the upper house and Belarusian leader Alexander Lukashenko before entering force.",
    "[]\nIts become impossible to work after 10 oclock in the morning,? Sunil Das, a rickshaw puller, told Quartz India.",
    "After a brutal winter surge, Fauci added, \"we've now decelerated and transitioned into more of a controlled phase.",
    "\"If Madeleine were here with us today, she would also remind us this must be a season of action,\" Clinton said.",
    "Vox\nBidens support among Gen Z and millennials is collapsing\nPresident Joe Biden has a young voter problem.",
    "But just weeks before Pennsylvanias May 17 primary election, such ideas are being promoted in plain sight.",
    "In the coming days we will need all our resilience and extraordinary unity,? Reznikov told Ukrainians.",
    "It marks Russia's stiffest reaction yet to sanctions imposed by the West over the conflict in Ukraine.",
    "Young Americans never really loved Biden, and they think hes broken a lot of his campaign pledges.",
    "I head back home after 10 and resume in the evening when the heat has subsided a bit,? Das said.",
    "But in an interview with The Associated Press on Wednesday, Fauci said the pandemic isn't over.",
    "[]\nPandemic controls require people to stay put, but economic development requires mobility.",
    "Democracies typically do not turn into fascist oligarchies by being invaded or losing wars.",
    "Theyre also still recovering from two of the most disruptive years in American history.",
    "Now, a hunt for alleged collaborators is underway in recaptured parts of the country.",
    "Typically, these are racial, religious, political or gender/sexuality minorities.",
    "Clinton referenced the Bible's lesson that \"For everything there is a season.\"",
    "In addition to habitat loss, both groups are depleted by hunting and fishing.",
    "To find them, Russian forces carried lists with peoples names and addresses.",
    "Everyone is encouraged to share their 2 or articles, stories, and tweets.",
    "One Republican in the room said the meeting was cathartic? for lawmakers.",
    "\"So if you're saying, 'Are we out of the pandemic phase in this country?'",
    "But Fauci also warns that people should still be mindful of the disease.",
    "\"There's not a Build Back Better revival,\" he told reporters on Tuesday.",
    "This is how fascism progresses through its later stages toward tyranny.",
    "Well, not actually impossible, but exceptionally difficult to imagine.",
    "\"These major social changes should go through the process.",
    "Tonights collection of news stories awaits your comments.",
    "The country paid about 9bn for imports during the period.",
    "\"We are in a different moment of the pandemic,\" he said.",
    "Democrats only have 50 votes in the upper chamber.",
    "By no means does that mean the pandemic is over.\"",
    "We proved that we are here for decades-long work.",
    "But they also made use of local informants.",
    "[]\nOf course, that has long been clear.",
    "\"You have to build consensus,\" he said.",
    "We are at a low level right now.\"",
    "That's what the process is for.\"",
    "He received a standing ovation.",
    "The drop isnt that surprising.",
    "This is not a one-shot deal.",
    "Weve got nearly 200 days.",
    "This is an open thread.",
    " we are,\" he said."
  ]
}