{
  "id": 7108,
  "mediaId": 238,
  "date": "5/21/2022 12:00:00 AM",
  "headline": "House Democrats scramble after redistricting lessens competitive edge",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/21/democrats-redistricting/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Colby Itkowitz",
  "authorUrl": "https://www.washingtonpost.com/people/colby-itkowitz/",
  "termIds": [
    661,
    1226,
    1587,
    2087,
    5288,
    140,
    146,
    562,
    3292,
    2661
  ],
  "sentences": [
    "Democratic leaders in states like California, Colorado and Oregon established independent commissions to more transparently draw new district lines that they hoped would be less partisan and more representative  but doing so seems to have put the party at a disadvantage given that Republicans in several states, including DeSantis, were still determined to draw maps as favorably as possible for their party.",
    "Stay tuned.?\nIn a statement issued by the DCCC on Saturday, Maloney accused the judge of unfair bias that favored Republicans, saying Democrats will continue fighting to get fair maps that reflect the will of the voters of New York.? Court proceedings, however, could take months, making it incredibly difficult to enact finalized maps during this election.",
    "In a scathing statement Thursday, Rep. Jamaal Bowman (D-N.Y.) directly blamed Maloney for seeking a slightly easier district for himself? as a reason two Black men who worked hard to represent their communities? could be pitted against each other, had Jones decided to run in the 16th Congressional District.",
    "Jones made a surprising announcement shortly after the judges finalized map was made public: Rather than defend his home turf in the Hudson Valley from Maloney, Jones said he has decided to seek reelection in the new 10th Congressional District, which envelopes Lower Manhattan and parts of liberal Brooklyn.",
    "Many New York Democrats are angry with Rep. Sean Patrick Maloney (D-N.Y.) as well as Jonathan Cervas, a redistricting expert and the special master? who drew the latest map, which initially placed eight Democrats homes outside their current districts and forced two member-on-member primaries.",
    "I promise you no one was suggesting we be less aggressive.?\nNew York congressional Democrats were seething at the outcome, calling it a racist gerrymander because it breaks up communities of color, diluting Latino communities and forcing Black members to determine where to run, they said.",
    "A senior New York Democratic official, who spoke on the condition of anonymity to talk candidly, said the courts hijacked the redistricting process.? The Democrat scoffed at complaints that the legislatures gerrymander was too extreme and thus exposed it to a legal challenge.",
    "The Florida House then drew new lines intended to appease DeSantis, dramatically shrinking a majority Black district that ran across the states entire northern border  currently represented by Democratic Rep. Al Lawson  to a smaller one surrounding Jacksonville.",
    "Outrageous.?\nMaloneys decision inflamed tensions within the House Democratic caucus, with many members privately musing whether he could lead as DCCC chairman  whose role is to protect the majority  while also challenging a member who could lose his seat.",
    "Ultimately this is up to the voters, and thats what it should be.?\nHis allies defended Maloneys decision, noting he was better suited for the district because Jones, a member of the Congressional Progressive Caucus, is too liberal to represent the area.",
    "While the overall map is less favorable to Democrats, Rep. Darren Soto (D)  who is from the Orlando area  said Democrats can still be competitive over the next decade given that seats in the Tampa Bay and Miami areas remain swing districts.",
    "But their worry sharply returned this month as favorable maps in Florida and New York were struck down and replaced with district lines that are likely to make it even more difficult to keep their already slim majority in the House.",
    "In New York, a judge approved a widely disputed map early Saturday that, if upheld, would lead to Democrats losing at least one colleague amid an internal party fight this past week over who was to blame and who would run where.",
    "So, the state Democrats  with control over all of government for the first time in 100 years  took the reins and drew a map that removed a district and could have grown their congressional delegation by as many as three seats.",
    "In the November midterm election, Republicans need to net only five seats to regain the House majority, a possibility that is likely given the historic trend of a first-term presidents party losing in the midterm election.",
    "But the setup was deeply flawed, voting rights advocates have argued, because the commission could be overruled by the legislature and was composed of an equal number of Democrats and Republicans, creating a deadlock.",
    "Even with the map changes this month, independent analysts say that Democrats remain competitive nationwide after adding three new districts more favorable to Biden versus the current lines that were drawn in 2010.",
    "Maloney declared Monday that he would run in the proposed 17th District, challengingJones , saying that he does not want to uproot his family from their home, which is based within the current district lines.",
    "The approved map also pits Reps. Carolyn B. Maloney (D-N.Y.) and Jerrold Nadler (D-N.Y.) against each other, two members from Manhattan who serve as the top Democrats on high-ranking committees.",
    "Democrats unexpectedly breathed a sigh of relief earlier this year when it became clear that newly redrawn congressional districts would give them a slight competitive edge over the next decade.",
    "But severe problems remain with historically Black, Latino and Jewish districts throughout New York City,? House Democratic Caucus Chairman Hakeem Jeffries (N.Y.) said in a tweet Saturday.",
    "Ohio Republicans, whose congressional map has repeatedly been ruled by the state Supreme Court an unconstitutional gerrymander, are still being allowed to use it for this years elections.",
    "Since long before the Stonewall Uprising, queer people of color have sought refuge within its borders,? tweeted Jones, who is Black, gay and widely considered a rising star in the party.",
    "Several House members privately expressed their frustration toward leaders, particularly Pelosi for not twisting some members arms about whether its worth challenging certain incumbents.",
    "That appears to have had some influence by rejoining some minority neighborhoods that were split in Mondays proposed map and moving some members residences back into their districts.",
    "Redistricting, however, has eliminated 18 competitive seats according to a Washington Post analysis, making it less likely that either party can have more of an edge in future races.",
    "Alabama Republicans persuaded the Supreme Court to override a lower courts ruling that would have forced the state to draw two congressional districts with large Black voting blocs.",
    "The Democratic Congressional Campaign Committee had publicly suggested a version that was more partisan than the one the New York Democrats ultimately drew, the state official said.",
    "Speaker Nancy Pelosi (D-Calif.) defended Maloney at a news conference Thursday, telling reporters she remains very proud? of him and declining to get involved in any of the races.",
    "The commissioners, most appointed by state politicians, ended up entrenched in their own partisan stalemate and never were able to agree on one map to send to Albany.",
    "But DeSantis, days before the vote, threw the process into chaos by presenting his own version, which drastically altered districts at the expense of Black voters.",
    "Ron DeSantis (R) vetoed the maps passed by the state legislature and pressed for one favorable to the GOP by erasing a Black-majority district around Jacksonville.",
    "A decision made by Rep. Mondaire Jones (D-N.Y.) to run in another district may have quelled tensions between lawmakers that permeated this past week in Washington.",
    "The states high court struck down the congressional lines, ruling them invalid because the constitution directed the advisory commission to first draw the maps.",
    "Many groups, including the DCCC, submitted letters making these points for the Steuben County Supreme Court to consider before its final decision issued Friday.",
    "Democrats were hoping that new congressional maps, especially in predominantly blue states like New York, could make up for likely losses in swing districts.",
    "In a good year, Democrats could win two more seats than they have now, but in a difficult year, as 2022 is expected to be, they could lose as many as three.",
    "A black man is ideologically ill suited to represent a Westchester County District that he represents presently and won decisively in 2020?",
    "In response to such assertions, Rep. Ritchie Torres (D-N.Y.) tweeted Wednesday: The thinly veiled racism here is profoundly disappointing.",
    "Several members and aides pondered whether it would be possible to recall Maloney because he was elected by members to the position.",
    "Our delegation was thrilled with us and wanted us to go further, we were getting pats on the backs and hurrahs,? the Democrat said.",
    "The courts have been a check on those sorts of efforts, and Democrats notched some early wins  which have since been reversed.",
    "The Florida Senate in January agreed on a map that both parties determined was fair and wouldnt be challenged in court.",
    "If someone else is looking at the district as well, obviously well try and work through that as colleagues and friends.",
    "A GOP-appointed circuit court judge recently ruled that Lawsons seat should be reinstated, which DeSantis appealed.",
    "[DeSantis] said he didnt think that race should be considered, but those maps ended up tearing communities in half.",
    "In 2014, New York voters overwhelmingly passed a ballot initiative intended to make redistricting less partisan.",
    "It set up a 10-member advisory commission outside the legislature to draw maps for state lawmakers to approve.",
    "The iconic neighborhood of Bedford Stuyvesant has been restored to its rightful place in Central Brooklyn.",
    "On Friday, a Florida appellate court reinstated DeSantiss map, eliminating the district once again.",
    "He will face former New York Mayor Bill de Blasio in the primary, after he announced a run Friday.",
    "DeSantis vetoed both maps, and the legislature eventually passed a map drawn by the governor.",
    "So he really sought to put his thumb on the scales here,? Rep. Kathy Castor (D-Fla.) said.",
    "The real drama is playing out in New York, where ample time was given to propose maps.",
    "The current lines encompass roughly 75 percent of the district Jones won in 2020.",
    "Im excited to make my case for why Im the right person to lead this district.?",
    "Im just running where I landed,? Maloney said at a news conference Tuesday.",
    "His children are of college age, and one commutes to school from home.",
    "This is the birthplace of the LGBTQ+ rights movement.",
    "The judges also found the map to be overly partisan.",
    "And that violated our fair districting standards.",
    "Florida Gov."
  ]
}