{
  "id": 7120,
  "mediaId": 302,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Appeals court puts Florida congressional redistricting decision on hold",
  "image": "https://www.tampabay.com/resizer//1yDIcStcrH-lPcvIAFWH27mtLIc=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/ZQFOBUJZERRPUWAPUVEEPADAPQ.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/20/appeals-court-puts-florida-congressional-redistricting-decision-on-hold/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    428,
    478,
    482,
    545,
    562,
    2661,
    2926
  ],
  "sentences": [
    "He wrote, in part, that compliance with the Fair Districts amendments non-diminishment provision is a compelling state interest.?\nAlso, he wrote that addressing the history of voting-related racial discrimination and a lack of representation in North Florida in itself constitutes a compelling state interest.?\nThe appeals court order Friday reinstating the stay did not delve into details of the federal and state constitutional issues.",
    "But Smith ruled that the plan violated a 2010 state constitutional amendment  known as the Fair Districts amendment  that barred diminishing the ability of minority voters to elect representatives of their choice.?\nThe overall redistricting plan passed by the Republican-controlled Legislature is expected to increase the number of GOP members of the states congressional delegation from 16 to 20, based on past voting patterns.",
    "As adopted by the circuit court, Congressional District 5 does not serve any compelling state interest that could be consistent with the federal Constitutions guarantee of equal protection.?\nThe states attorneys also argued that Smith erred by issuing an injunction to require use of a different map so close to this years elections.",
    "Based on a preliminary review, the court has determined there is a high likelihood that the temporary injunction is unlawful, because by awarding a preliminary remedy to the appellees (the plaintiffs) on their claim, the order frustrated the status quo, rather than preserved it,? the appeals court said, quoting a legal precedent.",
    "The appeals court also cited the exigency of the circumstances and the need for certainty and continuity as election season approaches.?\nReinstating the stay substantially increases the chances that the DeSantis-backed redistricting plan will be in effect for this years elections.",
    "Smith, who was appointed as a circuit judge by DeSantis, wrote that the plaintiffs had shown a substantial likelihood of proving that the enacted plan (passed by the Legislature) violates the non-diminishment standard? of the Fair Districts amendment.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nSmiths temporary injunction ordered use of a map that would keep the current sprawling shape of the district, which stretches from Jacksonville to west of Tallahassee.",
    "In the temporary injunction, however, Smith rejected the DeSantis administrations arguments about the Equal Protection Clause and whether a compelling interest existed for keeping the east-west shape of District 5.",
    "The plaintiffs, however, have asked that the underlying legal battle about the temporary injunction be put on a fast track to the Florida Supreme Court, a move known as seeking certification? to the Supreme Court.",
    "But Smith followed up Monday by lifting the automatic stay at the request of voting rights groups and other plaintiffs who have challenged the constitutionality of the redistricting plan.",
    "They also took aim at Smiths temporary injunction, saying the sprawling configuration of District 5 is not narrowly tailored to achieve a compelling interest? as required by federal law.",
    "TALLAHASSEE  An appeals court Friday reinstated a stay against a circuit judges decision that blocked a congressional redistricting plan pushed through the Legislature by Gov.",
    "The 1st District Court of Appeal, in a four-paragraph order, put on hold a temporary injunction issued last week by Leon County Circuit Judge Layne Smith.",
    "DeSantis argued that continuing with such a district would involve racial gerrymandering and violate the Equal Protection Clause of the U.S. Constitution.",
    "The case centers on Congressional District 5, a sprawling North Florida district that was drawn in the past to help elect a Black member of Congress.",
    "But in a filing Wednesday, attorneys for the state requested that the appeals court reinstate the stay while the underlying appeal moves forward.",
    "In reinstating the stay, however, the Tallahassee-based appeals court signaled that it did not agree with the temporary injunction.",
    "District 5 is currently held by U.S. Rep. Al Lawson, a Black Democrat, but the revamped district likely would flip to Republicans.",
    "The move increases the chances that the DeSantis-backed redistricting plan will be in effect for this years elections.",
    "There is no compelling justification for a racially gerrymandered district in North Florida,? the 67-page filing said.",
    "The temporary injunction blocked a redistricting plan that the Legislature passed during an April special session.",
    "The Legislature approved DeSantis proposal to revamp the district, condensing it in the Jacksonville area.",
    "The candidate-qualifying period for the elections will be held in mid-June, with primaries on Aug. 23.",
    "The states appeal of Smiths decision triggered an automatic stay of the temporary injunction.",
    "Ron DeSantis, pointing to a high likelihood? that the judge erred.",
    "Using that map also would affect some other districts."
  ]
}