{
  "id": 7122,
  "mediaId": 302,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "DeSantis signs bill targeting fentanyl, meth dealers",
  "image": "https://www.tampabay.com/resizer//3w_PZvEGWGfhARCltjT1zfRGZF4=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/5HX3FSKJQUHUMHSXWKJ6OR2UHE.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/20/desantis-signs-bill-targeting-fentanyl-meth-dealers/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2661
  ],
  "sentences": [
    "But were also doing things like the first lady (Casey DeSantis) is doing, the outreach to the young kids.?\nIncoming House Speaker Paul Renner, R-Palm Coast, added that if you come and sell fentanyl to our citizens, you will spend the best years of your life here in Florida in prison.?\nThe law, which will go into effect Oct. 1, follows recommendations from the Statewide Task Force on Opioid Abuse, which DeSantis created in 2019.",
    "Ron DeSantis on Thursday signed into law a measure that will increase sentences for trafficking fentanyl and could lead to dealers facing death sentences or life in prison if methamphetamine they distribute kills someone.",
    "The new law also will increase penalties for selling controlled substances within 1,000 feet of substance-abuse treatment centers, as well as hospitals and health care facilities that provide substance abuse treatment.",
    "One change adds methamphetamine to a list of controlled substances that can subject dealers to capital first-degree felony murder charges if the drug is the proximate cause? of a persons death.",
    "Another change in the law will increase minimum mandatory prison terms for people convicted of trafficking different amounts of fentanyl.",
    "Under the new measure, people trafficking between 14 and 28 grams of fentanyl will face 15 years to 20 years.",
    "The list already includes cocaine, opium, methadone, alfentanil, carfentanil, fentanyl and sufentanil.",
    "Yes, someone dealing fentanyl is murdering people, and theyre going to prison in the state of Florida.",
    "DeSantis signed the bill (HB 95) during a ceremony at Polk County Fire Rescue Station 23 in Lakeland.",
    "The event focused on fentanyl, a highly potent synthetic opioid that is often mixed with other drugs.",
    "And that is appropriate,? DeSantis said.",
    "Gov."
  ]
}