{
  "id": 7131,
  "mediaId": 302,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Tampa residents want a Citizen Review Board driven by community values, not politicians | Column",
  "image": "https://www.tampabay.com/resizer//qlKn3Y19FD6lgbJjToMtXFQVdwA=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/RCF3PSJCQ5HLLNXD5DNLM6C65Q.JPG",
  "link": "https://www.tampabay.com/opinion/2022/05/20/tampa-residents-want-a-citizen-review-board-driven-by-community-values-not-politicians-column/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2322,
    3702,
    3555,
    5234,
    5235,
    2661,
    5138
  ],
  "sentences": [
    "John Starkey, South Pasadena\nCareful what you wish for\nTaking aim at libel laws | May 19\nLegislators who may consider toying with the idea of making it easier to sue their critics for libel should consider that whats sauce for the goose is sauce for the gander.",
    "In 2015, the Tampa Bay Times uncovered an appalling statistic: Though Black residents made up just 26 percent of Tampas population, Black cyclists received 79 percent of the tickets issued by the Tampa Police Department in 12 years.",
    "These civil traffic citations, which overwhelmingly affected low-income Black Tampa neighborhoods, accounted for more than the total number of bicycle tickets issued in four of Floridas largest cities combined between 2012 and 2015.",
    "On May 23, the Tampa City Council will host a workshop to discuss whether or not a provision to amend the charter, thus giving the Citizen Review Board subpoena power and an independent attorney, will appear on the 2022 ballot.",
    "The latest poll on this reveals that 68 percent of Tampa voters agree that the Citizen Review Board should have independent counsel so that the board members do not have to rely on legal guidance from the city.",
    "A closer look at the ticketing revealed that the Tampa police used the stops as a pretext to question and search as many residents as they could, employing racial profiling to fish for evidence of crimes.",
    "In 2021, we learned that the Tampa Police Department was collaborating with landlords on a program that identified renters who were arrested and targeted them and their families for eviction.",
    "Nearly 82 percent of voters believe that the City Council and mayor should not be the ones to decide whether the Citizen Review Board should have subpoena power and independent counsel.",
    "Ron DeSantis decision to veto the bill that would have raised the energy bills of people using solar power by cutting what they are paid for electricity their panels feed into the grid.",
    "The ability to subpoena evidence would also allow the Citizen Review Board to access important evidence, instead of being limited to evidence solely presented by the police.",
    "Others were ticketed for minor infractions, the cost of which quickly ballooned into unaffordable fines and drivers license suspensions because of those unaffordable fines.",
    "These tools would ensure that the Citizen Review Board would have access to an independent attorney free of potential conflicts of interest, such as ties to the city.",
    "When the 2020 murder of George Floyd sparked nationwide calls to reduce the role and power of police in our communities, we pushed again to get those necessary tools.",
    "Robin Lockett, who lives in Tampa, is Tampa Bay regional director of Florida Rising, an organization that aims to advance economic and racial justice across Florida.",
    "Its a shame that school administrators and civil rights groups never learned the definition of desegregation, which is simply the opposite of segregation.",
    "Despite Tampa police justifications at the time, the Department of Justice found that the tickets did not improve safety on the street or lower crime.",
    "Worse, as the article points out, many students academic performance declined as a result of being bused to hostile environments at other schools.",
    "In many Florida cities, a strong appetite exists for a healthy, effective and sustainable citizen review process of law enforcement actions.",
    "We advocated for a Citizen Review Board with teeth, meaning that it would have its own attorney and the ability to subpoena evidence.",
    "I was among the group of local individuals and advocates who worked to establish a Citizen Review Board following the Times report.",
    "If I go into a shop and decline to buy anything, can the shopkeeper then tell me that I owe him/her $17.55 for not buying anything?",
    "All that was legally required was the elimination of the dual systems that existed, but historically Black schools were sacrificed.",
    "Former council member John Dingfelder then suggested that the Tampa city charter should be amended to let Tampa residents decide.",
    "The Tampa police confiscated the bicycle of one 54-year-old man after he was unable to provide a receipt to prove his ownership.",
    "The bill states that I have a $17.55 minimum bill adjustment.? So is Duke Energy charging me for not using their electricity?",
    "They mistakenly believed it was integration, and it was forced on these alumni of Gibbs High School when most didnt want it.",
    "Ninety-one percent of those targeted for evictions were Black, when Black people are only 23 percent of the city population.",
    "And while we waited, more egregious actions by the Tampa police continued to happen without community oversight.",
    "Without the right tools, the Citizens Review Board doesnt have the teeth to get to the bottom of what happened.",
    "I have just had solar panels installed at a personal cost of over $22,000, so I was very happy to see his veto.",
    "This accountability is long overdue, and we urge the City Council to finally let Tampa residents decide.",
    "This accountability is long overdue, and we urge the City Council to finally let Tampa residents decide.",
    "What desegregation isnt\nThank you for the story on the all-Black Classes of 1970? in St. Petersburg.",
    "Instead, they would have a democratic say in their local governments practices, or so we thought.",
    "And as for former President Donald Trump returning to Twitter...\nGregory McColm, Temple Terrace",
    "For 12 years, several facets of the Tampa government preyed on Black residents without cause.",
    "But city governments, not just Tampa, are making the establishment of such boards difficult.",
    "But I have just had my first bill from Duke Energy since our solar panels started working.",
    "They focused on who appoints members to the board instead of what Tampa residents wanted.",
    "Its been eight years since the beginning of this process, and we are still waiting.",
    "Some residents were ticketed multiple times, even on the same day in some cases.",
    "We are being billed $17.55, despite producing more energy that we have used.",
    "Spend your days with Hayes\nOnce again, we saw political theater.",
    "The practice also targeted children as young as 11 years old.",
    "No longer would residents be targeted without accountability.",
    "Energy creation belongs to the state, not private companies.",
    "Many people may look forward to taking Fox News to court.",
    "We can only hope this sad history doesnt repeat itself.",
    "It was time for residents to advocate for themselves.",
    "Joseph Brown, Tampa\nMy solar story\nI applaud Gov.",
    "The Tampa City Council and mayors office punted.",
    "They believe it should be left up to the voters.",
    "In what other universe does this exist?",
    "Nationalize the utilities.",
    "It didnt happen.",
    "My advice?",
    "Why?"
  ]
}