{
  "id": 7147,
  "mediaId": 19,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Ron DeSantis: Biden Administration Wants to Punish Americans for Using Carbon with Higher Gas Prices",
  "image": "https://cdn.jwplayer.com/v2/media/RvYwv2sq/poster.jpg?width=1280",
  "link": "https://www.breitbart.com/politics/2022/05/20/ron-desantis-biden-administration-wants-to-punish-americans-using-carbon-higher-gas-prices/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    661,
    1448,
    1805,
    2087,
    4885,
    2661,
    2945,
    2950
  ],
  "sentences": [
    "Ron DeSantis (R) said on Friday, noting that the administration is totally out of touch, I think, with the realities that people are dealing with.?\nDeSantis briefly walked through some of the issues that have surfaced since Biden took office, highlighting his series of policy errors? which have made life more difficult for the average American and the average Floridian.?\nThey have an energy policy that is deliberately trying to suppress production here in the United States, even though they inherited a country that was energy independent for the first time in an awful long time,? he said, explaining that they have reduced supply, canceled leases, and made it abundantly more difficult to produce domestically.",
    "They garble their words and the reason is they want higher prices, because their view is you need to be punished for using this carbon and you need to just go out and buy an electric car,? DeSantis said, likely referencing Secretary of Energy Jennifer Granholm, who told Sen. Josh Hawley (R-MO) on Thursday that Bidens policies have not affected energy costs.",
    "Hawley dismissed her excuses as utter nonsense.?\nWATCH:\nThat is totally out of touch, I think, with the realities that people are dealing with,? DeSantis said, noting that Bidens bad policy decisions are affecting the entire economy and fueling inflation.",
    "Thats gonna put a downward pressure on the growth of the economy and you very well could end up seeing this country plunged into a recession,? he said, expressing hope that it does not come to that.",
    "But I think our job  here in the state of Florida is to make sure that were positioned to deal with some of these things that are beyond our control and protect Floridians as best we can,? he added.",
    "If you look at the true inflation for people in terms of what theyre doing in their daily lives, its much higher than 8.5 percent,? he said, blasting Democrats for spending trillions of dollars.",
    "Its a deliberate attempt to make prices higher, and you actually have people testifying in front of Congress saying, you know, is this, is this a problem with the high prices?? he said.",
    "I think whats gonna happen  youre seeing interest rates go up, youre gonna probably continue to see that.",
    "All the while, Biden is more than willing to run to dictators such as Venezuelas Nicols Maduro for help.",
    "President Biden and Democrats want to punish? Americans via high gas prices, Florida Gov.",
    "Rather, she placed much of the blame on Russian President Vladimir Putin."
  ]
}