{
  "id": 7708,
  "mediaId": 129,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "Will Alaskans Welcome Sarah Palins Political Comeback?",
  "image": "https://static01.nyt.com/images/2022/04/18/multimedia/18onpolitics-palin02/18onpolitics-palin02-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/20/us/politics/sarah-palin-alaska.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    815,
    1549,
    2137,
    5800,
    5823,
    5965,
    5981,
    571,
    2538,
    2544,
    6061
  ],
  "sentences": [
    "He was also pulling on a string that threatened to unravel an arrangement the state made with Disney in 1967 that granted the company extraordinary power over a 39-square-mile patch of former swampland in Central Florida  an unusual experiment in local governance that has few American counterparts.",
    "It is a story that has long since grown threadbare from Palins own retelling, but if you lived in Alaska, as I did, at the time of Palins primary election victory over the incumbent and Alaskan institution Frank Murkowski, it was a genuinely astonishing moment of political transformation.",
    "An Arctic political machine\nRepublican candidates today frequently denounce a greatly weakened party establishment, but the line is more jarring coming from Palin, who in 2006 did fight and beat one of the countrys most entrenched and clubby state-level Republican establishments.",
    "helped, too, of course, mounting a yearslong investigation of more than half a dozen lawmakers suspected of having taken bribes from the VECO Corporation, an oil-field contractor, that happened to come to a head shortly after Palins primary triumph.",
    "Aside from backing an ultimately unsuccessful challenger to Senator Lisa Murkowski in 2010 (and the same candidate four years later, in the race for the states other Senate seat), she was mostly a nonparticipant in Alaskas affairs.",
    "She concedes to having been shocked when Palin came out in the lead at 31 percent: five percentage points ahead of her nearest rival, Al Gross, an independent who has in past races been endorsed by the state Democratic Party.",
    "Return from the wilderness\nThe governors relationship with her state changed forever with her resignation, which seemed to represent the exchange of Sarah Palins Alaska for Sarah Palins Alaska: a place for a personal brand.",
    "So it was a surprise when Palin emerged from a decade in the cable-talking-head wilderness to hint at and, on April 1, announce her candidacy for Alaskas lone House seat, which had opened up with Don Youngs death in March.",
    "Later I watched the Nome episode, and sure enough: There was Hafner standing alongside Palin as she admired a gold nugget the size of a fingernail that he and Palins brother, Chuck, had sucked up from the seafloor.",
    "And yet when the pollster asked about respondents favorable or unfavorable views of Palin, the numbers  37 percent to 51 percent  were not much changed from when Ivan Moore asked the same question a decade ago.",
    "Alaska in 2006 still possessed something resembling a political machine, which cannily husbanded the states all-important relationships with the oil and gas industry and the federal government.",
    "Alaskans did not always love the stalwarts of this mostly Republican machine, but they understood that deposing them would potentially cost the state a great deal, so they kept electing them.",
    "Im sorry if that narrative is out there, because its inaccurate, she told The A.P., offering by way of bona fides the fact that she had recently been shoveling moose poop in her fathers yard.",
    "Disney runs everything from the fire department and emergency services to electricity, gas, water and wastewater, subject to the supervision of a five-member board dominated by the company.",
    "Which raises another possibility: that Palins political celebrity is so all-devouring and all-polarizing that even Alaskans, with their very particular history with Palin, cant see past it.",
    "Ron DeSantis of Florida urged lawmakers this week to consider ending Disneys special administrative status, he wasnt just escalating his cultural standoff with his states largest employer.",
    "Ivan Moore, a pollster in Anchorage, recalls that when he asked people who viewed her negatively why they felt that way, the most common response, streaks ahead of the rest, was: She quit.",
    "The charter for the special municipality, the Reedy Creek Improvement District, even allows Disney to build and operate an airport or a power plant using nuclear fission if it so chooses.",
    "It was more surprising still to see Palin give a lengthy interview to Nathaniel Herz of The Anchorage Daily News, in which she excoriated the establishment machine that would oppose her.",
    "Barack Obama, who has waded more and more into the public fray over misinformation and disinformation, is expected to give a speech on the subject at Stanford University on Thursday.",
    "Palin was filmed communing with enough commercial fishermen, loggers and bush pilots that the odds of randomly encountering one of them on the road in Nome were probably pretty good.",
    "There was a note of desperation in this strenuous on-screen Alaska-ing, and in Palins voice-over declaration during the opening montage that I love this state like I love my family.",
    "I was working on an article about the boom in reality TV shows celebrating rugged blue-collar jobs, which seemed to be in production in every corner of Americas most rugged state.",
    "Early this month, Downing commissioned a poll of the comically large field for the June primary  the ballot for which, with its 48 candidates, looks like a page from a phone book.",
    "At the time of the districts creation, the brothers Walt and Roy Disney were searching for the ideal site for the successor resort to Disneyland, their California theme park.",
    "For one thing, The Miami Herald noted on Wednesday that residents of Orange and Osceola Counties might be on the hook for a hefty tax bill should DeSantis get what he wants.",
    "Four years after the 2008 presidential election and three years after her resignation as governor, the waterfront tourist shops in Valdez hawked Bailin Palin T-shirts.",
    "The other was a veneer of local particularity, stretched over the same national politics that seemed to offer few potential surprises, only deepening entrenchment.",
    "Its almost like a sovereign state inside another state, said Aaron Goldberg, the author of a book on the origins of Disney World, the companys Florida resort.",
    "Her most prominent return to the arena, in 2016, was a stemwinder in service of a politician who would all but supplant her role within the Republican Party.",
    "Its possible  Moore thinks this  that the longer half-life of Palins numbers reflects the depth of the betrayal Alaskans still feel about her resignation.",
    "Her political action committee still took in millions of dollars, but spent a tiny fraction of the money on candidates or independent expenditures.",
    "Disney has gotten away with special deals from the state of Florida for way too long, the governor said in an email to his supporters on Wednesday.",
    "Alaska, she reminded me, is extraordinarily transient: 12.8 percent of the population turns over in an average year, more than in any other state.",
    "With the help of Paul Helliwell, a lawyer and longtime intelligence operative, they secretly acquired portions of Orange and Osceola Counties.",
    "But her most recent national polling  admittedly nine years old  shows an almost identical breakdown of favorable and unfavorable responses.",
    "It had to be somewhere warm and near major highways  but not too near the ocean, because the company didnt want to compete with the beach.",
    "Downing, who now edits the right-leaning Must Read Alaska blog, added, She hasnt lifted a finger for Alaska since she left office.",
    "A decade ago, I caught a ride in a pickup truck on the outskirts of Nome, Alaska, with Bob Hafner, a burly, tattooed gold dredger.",
    "And over half a century later, DeSantis is re-evaluating the states bargain as he contemplates some grand ambitions of his own.",
    "This is unusual: For ordinary politicians, favorability and unfavorability tend to soften as time passes and headlines fade.",
    "In an interview with The Associated Press this week, Palin objected to the suggestion that she had left the state behind.",
    "To fulfill that vision, Disney demanded sovereignty over its own land and, to make a long story short, Florida said yes.",
    "In fact, Moore told me that Palins numbers had not moved appreciably in intermittent polls over the intervening years.",
    "In recent years, she had been in the news most often on account of her libel lawsuit against The New York Times.",
    "Were joined tonight by our colleague Charles Homans, who writes about Sarah Palin and Alaskas changing politics.",
    "It took a look under the hood to see what Disney has become to truly understand their inappropriate influence.",
    "Today, Alaskan Republican politics dont much resemble the hierarchy that Palin tilted against 16 years ago.",
    "said Suzanne Downing, a former speechwriter for Palins lieutenant and successor as governor, Sean Parnell.",
    "Herschel Walker, a Republican contender for Senate in Georgia, is a risky candidate for the G.O.P.",
    "to run, but he has nevertheless surged to the top of the field, our colleague Maya King reports.",
    "Many of the Alaskans taking the measure of Palin today were not Alaskans when she was in office.",
    "They are, in other words, less familiar with Sarah Palins Alaska than with Sarah Palins Alaska.",
    "Her political ambitions seemed entirely national, though even these appeared to flag quickly.",
    "Probably only someone like Palin, with her messianic conviction, had a shot at toppling it.",
    "Sarah Palins Alaska, produced by Mark Burnett, had recently run for nine episodes on TLC.",
    "Only 36 percent of Alaskans viewed her positively, and 61 percent viewed her negatively.",
    "I dont know, Downing said, if she can get a single voter that she doesnt already own.",
    "It decides what is built, and how, and has the power to raise bonds and assess taxes.",
    "They look, for better or worse, a lot more like Republican politics everywhere else.",
    "As Goldberg put it, How do you dissolve a government thats been there for 50 years?",
    "Ron DeSantis, which would give Republicans an even greater advantage in the state.",
    "Most serious Republican figures in Alaska, their question is, Where have you been?",
    "Announcing the project, Disney spoke of his ambition to build a city of tomorrow.",
    "As Hafners truck bounced along the rutted coast road, I asked what he made of it.",
    "Portions became Epcot Center, and the special district has under 50 residents.",
    "Palins campaign did not respond to emails and phone calls requesting comment.",
    "What to read\nThe Florida Senate passed a congressional map proposed by Gov.",
    "But taking apart Disneys magical Florida kingdom might prove complicated.",
    "But they do not necessarily reflect the will of the people.",
    "Me and my diving partner, we did that Sarah Palin show.",
    "Her 2012 presidential campaign ended before it began.",
    "How Disney got its own state-within-a-state\nWhen Gov.",
    "Downing brought up another possible explanation.",
    "Others have called it a Vatican with mouse ears.",
    "Blake\nIs there anything you think were missing?",
    "Im probably partly responsible for it, he said.",
    "Greetings from your host Blake Hounshell.",
    "Can a much-changed state still surprise?",
    "One was a place of heady transformation.",
    "Disneys futuristic city never happened.",
    "A jury rejected her claims in February.",
    "They have a loud voice, she told Herz.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "He laughed, a little ruefully.",
    "Leah Askarinam is off today.",
    "Wed love to hear from you.",
    "They have the medias ear.",
    "the former governor said.",
    "They hold purse strings.",
    "Shes a quitter.",
    "Thats neat!",
    "The F.B.I."
  ]
}