{
  "id": 8369,
  "mediaId": 147,
  "date": "5/26/2022 12:00:00 AM",
  "headline": "Florida passes condo safety bill in wake of Surfside collapse",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2021/07/tragiccollapse2-1200x761.jpg",
  "link": "https://www.pbs.org/newshour/nation/florida-passes-condo-safety-bill-in-wake-of-surfside-collapse",
  "sentiment": "0.0",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.pbs.org/newshour/author/associated-press",
  "termIds": [
    661,
    428,
    2582,
    2661,
    2790,
    2926,
    5488
  ],
  "sentences": [
    "While some Democratic lawmakers complained that the special session on insurance didn't go far enough to help relieve homeowners, they did praise the addition of the condominium safety legislation.",
    "The condominium measure was attached to a bill that would forbid insurers from automatically denying coverage because of a roof's age if the roof is less than 15 years old.",
    "It would also require condominium associations to provide inspection reports to owners, and if structural repairs are needed, work must begin within a year of the report.",
    "The Champlain Towers South was 40 years old and was going through the 40-year-recertification process required by Miami-Dade County when it collapsed last June.",
    "TALLAHASSEE, Fla. (AP)  Florida would require statewide recertification of condominiums over three stories tall under a bill sent Wednesday to Republican Gov.",
    "Recertification would be required after 30 years, or 25 years if the building is within 3 miles (5 kilometers) of the coast, and every 10 years thereafter.",
    "The bill would require that condominium associations have sufficient reserves to pay for major repairs and conduct a study of the reserves every decade.",
    "The House unanimously passed the bill during a special session originally called to address skyrocketing property insurance rates.",
    "We have actually made positive change knowing that condominiums will be safer moving forward, said Republican Rep. Daniel Perez.",
    "At the time, Miami-Dade and Broward counties were the only two of the state's 67 that had condominium recertification programs.",
    "This bill makes this trip worth it, at least for me, said Democratic Rep. Michael Grieco, whose district borders Surfside.",
    "The condominium safety bill was added to the agenda Tuesday after an agreement was reached between the House and Senate.",
    "Homeowners with roofs 15 years or older would be allowed to get an inspection before insurers deny them coverage.",
    "Ron DeSantis by lawmakers, their legislation a response to the Surfside building collapse that killed 98 people.",
    "He recalled the first day families were allowed to go to the site of the collapse.",
    "Similar legislation failed during the regular session that ended in March.",
    "They were screaming to people who might still be alive.",
    "To hear the folks screaming into the rubble, He said.",
    "WATCH: Condo boards can be notoriously secretive.",
    "I know folks who lost people in that building.",
    "Will the Surfside collapse change that?",
    "I'll never forget that sound."
  ]
}