{
  "id": 8542,
  "mediaId": 302,
  "date": "5/27/2022 12:00:00 AM",
  "headline": "Charlie Crist's flawed debate strategy must change | A Sun Sentinel editorial",
  "image": "https://www.tampabay.com/resizer//q6PC5seSzUnhNmv2CwXItB6QQNY=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/EB27HR4VN5DA7KPGDVABKFWDGA.JPEG",
  "link": "https://www.tampabay.com/opinion/2022/05/27/charlie-crists-flawed-debate-strategy-must-change-a-sun-sentinel-editorial/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1451,
    1761,
    2305,
    3992,
    6224,
    3547,
    2661,
    2790
  ],
  "sentences": [
    "That obviously means that Venezuela and Cuba will be discussed, including President Joe Biden's recent shifts in policy toward the two nations and Crist's own little-publicized trip to Cuba in April 2019 where he was photographed with the island nation's foreign minister.",
    "The St. Petersburg congressman probably has higher name recognition than any Democrat in the state, and limited polling shows him well ahead of rivals Nikki Fried and Annette Taddeo in the race to challenge Gov.",
    "So he has agreed to one hour-long taped TV debate, in the Miramar studios of Miami's NBC-6 on July 21, to be simulcast on Telemundo 51 and its affiliates in Tampa, Orlando and Fort Myers.",
    "But he knows that in a debate, Fried is likely to be the aggressor, and will attack the many inconsistencies in Crist's political past as a Republican who was anti-abortion and pro-gun.",
    "That doesn't change the fact that on balance, debates are good for democracy, and what we need more than ever right now is anything that makes democracy a little stronger.",
    "Democratic voters, independents and moderate Republicans need to see how well all candidates perform at an unscripted event with tough and spontaneous questions.",
    "Spend your days with Hayes\nCrist counts the NBC-6 debate as two debates, even though it's an English-language debate translated for Spanish-speaking viewers.",
    "Fried, the agriculture commissioner and a fierce critic of DeSantis, is the only current Democrat elected statewide  something Crist has yet to accomplish.",
    "Taddeo, a state senator from Miami-Dade who was Crist's running mate against Rick Scott in 2014, told the Sun Sentinel: We shouldn't be afraid of debates.",
    "One debate that Crist has rejected is sponsored by Spectrum Bay News 9/Central Florida 13 and the Tampa Bay Times, Sun Sentinel and Orlando Sentinel.",
    "He always looks good on TV, and a televised debate is his best opportunity to talk straight to people about his evolution and his complicated record.",
    "Crist risks alienating women by appearing to take female opponents lightly as he did eight years ago, when he ignored a little-known rival, Nan Rich.",
    "It's especially surprising that Crist would snub his hometown paper, the Times  something that would have been unthinkable when Crist was governor.",
    "Whoever wins the Democratic nomination  and the most likely winner is Crist  will surely challenge DeSantis to a series of debates in the fall.",
    "But Crist has made a tired and age-old calculation: As a frontrunner, he figures he can only lose by giving lesser-known opponents a platform.",
    "It sends a signal, however unintended, that it's beneath him to share a stage with women, and it comes off as disrespectful.",
    "Here's why the Democratic gubernatorial front-runner should debate his rivals at least twice, or perhaps three times.",
    "Crist is one of the party's best assets, but has not run statewide since 2014  an eternity in Florida politics.",
    "But in an interview with the Sun Sentinel Editorial Board, Crist sounded committed to rejecting more debates.",
    "As a weakened minority party, Democrats should take advantage of every opportunity to connect with voters.",
    "Crist should reconsider and debate his rivals at least twice, or perhaps three times, for several reasons.",
    "DeSantis' nearly total lack of transparency with voters and the media is one of his many vulnerabilities.",
    "The people of our state need to know who their elected officials are and what they're going to fight for.",
    "But by his reluctance to debate now, Crist gives DeSantis an opening to give him the same treatment.",
    "It's not going to happen, because I have other stuff I have to do, like talk to voters, Crist said.",
    "It's good practice, because one of them must face the heavily favored, lavishly financed DeSantis.",
    "He's been a fixture for three decades in Florida politics, mostly as a former Republican.",
    "Democrats should set a new standard for transparency about everything, debates included.",
    "They need to have their day in court, so to speak, Crist told us, and I'm granting it.",
    "The typically sleepy midterm Democratic electorate must be fired up as never before.",
    "Charlie Crist is clearly the man to beat in the Democratic primary for governor.",
    "His three statewide victories in 2000, 2002 and 2006 were all as a Republican.",
    "Crist told us he's not the least bit afraid of his Democratic opponents.",
    "Most Democrats who have arrived since then have never voted for Crist.",
    "The dictatorial DeSantis is well-positioned for a presidential run.",
    "Democrats have a better chance if Crist welcomes these challenges.",
    "What makes headlines is likely to be a gaffe, not a revelation.",
    "An affable former governor, he has run statewide six times.",
    "In this election year, three debates are better than one.",
    "Democracy is on the line, Fried told the Sun Sentinel.",
    "I'm not going to convince my opponents to vote for me.",
    "For Florida, in 2022, this is no typical election.",
    "The way you win is go out and talk to voters.",
    "The importance of debates is overrated, sure.",
    "Too many voters ignore them.",
    "That's more important to me.",
    "That's the wrong decision.",
    "Ron DeSantis in November.",
    "Democracy is under siege.",
    "* Total transparency.",
    "* Exposure matters.",
    "* Primary voters.",
    "* It's dangerous.",
    "2022 Sun Sentinel",
    "Sorry, Charlie.",
    "I want to win.",
    "She's right."
  ]
}