{
  "id": 8550,
  "mediaId": 157,
  "date": "5/27/2022 12:00:00 AM",
  "headline": "New court ruling appears to favor DeSantis' plan to abolish Black-access district in North Florida",
  "image": "https://www.rawstory.com/media-library/desantis.jpg?id=29534610&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/new-court-ruling-appears-to-favor-desantis-plan-to-abolish-black-access-district-in-north-florida/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Moline",
  "authorUrl": "https://www.rawstory.com/u/michaelmoline-floridaphoenix",
  "termIds": [
    661,
    1058,
    3636,
    5177,
    5201,
    6107,
    2661,
    2926
  ],
  "sentences": [
    "Rather than proceed by respecting the separation of powers and the historical limits of its authority, the circuit court here improperly fast-tracked the case  in essence, to judgment  and it did so in the context of a constitutional writ of injunction absent a full evidentiary hearing and final adjudication, Tanenbaum wrote.",
    "In explaining the outcome for a three-judge appellate panel, Judge A.S. Tanenbaum wrote that Circuit Judge Layne Smith in Leon County improperly imposed a plan retaining Congressional District 5 as a vehicle for Blacks in Florida's old plantation belt to elect a representative of their choice.",
    "With time running out before the Aug. 23 primary and Nov. 8 general elections, the decision seems to amount to another weight on the scale in favor of the governor's plan  which also would deliver 20 of the 28 seats to which Florida is entitled under the 2020 U.S. Census to Republicans.",
    "A Florida appellate court ruled Friday that a trial judge abused his authority in ordering state government to retain a Black-access congressional district in North Florida before holding a full trial on whether the state's Fair District amendment required doing so.",
    "The opinion made clear the panel was not ruling on the merits of the DeSantis' congressional map raised by voting rights groups including Black Voters Matter, the League of Women Voters of Florida, the Equal Ground Education Fund, and five individual voters.",
    "The 20-page opinion (docket here) from the First District Court of Appeal in Tallahassee arrived exactly one week after the same court reinstated an injunction against enforcing a congressional redistricting plan forced upon the Legislative by Gov.",
    "The circuit court's use of a temporary injunction in this way  to draw up a remedial redistricting plan and force its implementation in the upcoming election without a trial and final adjudication on the merits  was legally unsupported.",
    "The grant of this provisional remedy, unmoored from an adjudication, was an unauthorized exercise of judicial discretion, making the temporary injunction unlawful on its face, Tanenbaum wrote.",
    "Whether there is merit to the constitutional challenge at the center of the appellees' complaint is a question for another day, after a trial in the circuit court.",
    "The voting-rights groups have asked the Florida Supreme Court to hear the case on an emergency basis but that court has not done anything about it at this point.",
    "Lambasted\nBut it lambasted Smith's handling of the case from the very start, including his decision not to stage a full trial on the case's merits.",
    "Unauthorized exercise'\nIn the order, the circuit court even acknowledges that it is crafting a remedy for the appellees until there can be a trial.",
    "Florida Phoenix is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "It also dilutes Black voting strength in Central Florida and the Tampa Bay area, although those districts weren't at issue in the case.",
    "This abuse of authority by the circuit court, by itself, is enough support for our disposition of the motion to reinstate the stay.",
    "That's notwithstanding the Fair Districts amendment, which forbids partisan gerrymandering or diminishment of Black representation.",
    "Tanenbaum wrote that the panel procedurally couldn't reach the merits of the case because of the lack of on-the-record evidence.",
    "A separate federal legal attack on the DeSantis map is pending in the U.S. District Court for the Northern District of Florida.",
    "Smith held a Zoom hearing and then ordered the state to plan for the election using the Black-access district.",
    "The DeSantis map divides those Black voters among four districts dominated by white voters.",
    "Also signing the opinion were judges Harvey Jay III and M. Kemmerly Thomas.",
    "Contact Editor Diane Rado for questions: info@floridaphoenix.com.",
    "The other two were placed on the court by former Gov.",
    "Ron DeSantis that abolished the district in question.",
    "Florida Phoenix maintains editorial independence.",
    "Follow Florida Phoenix on Facebook and Twitter.",
    "Rick Scott, not Florida's junior U.S. senator.",
    "Tanenbaum is a DeSantis appointee.",
    "Stories Chosen For You"
  ]
}