[
  {
    "id": 87,
    "mediaId": 43,
    "date": "d2022-01-04T00:00",
    "sentence": "Meijer, who was one of 10 House Republicans who voted to impeach Donald Trump, will need to turn back a primary challenge from Trump-backed conservative commentator <span class='selected-term'>John Gibbs</span> before he can focus on a potentially challenging general election, though.",
    "author": "",
    "title": "Morning Digest: Redistricting scrambled California's House map. Here's our guide to unscrambling it",
    "sentiment": "0.0"
  },
  {
    "id": 65,
    "mediaId": 43,
    "date": "d2022-02-02T00:00",
    "sentence": "The incumbent was one of the 10 House Republicans who voted to impeach Donald Trump, which is why Trump is backing conservative commentator <span class='selected-term'>John Gibbs</span>' bid to deny Meijer renomination in the August primary.",
    "author": "",
    "title": "Morning Digest: Democrat announces rematch against House Republican under fire for impeachment vote",
    "sentiment": "0.0"
  },
  {
    "id": 54,
    "mediaId": 43,
    "date": "d2022-02-22T00:00",
    "sentence": "? MI-03: The Democratic group EMILY's List has released a mid-January survey from Impact Research arguing that Rep. Peter Meijer is in real danger of losing his August Republican primary to conservative commentator <span class='selected-term'>John Gibbs</span>.",
    "author": "",
    "title": "Morning Digest: An old scandal resurfaces for Texas attorney general one week ahead of GOP primary",
    "sentiment": "0.0"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "d2022-04-21T00:00",
    "sentence": "We turn next to Michigan's 3rd in the Grand Rapids area, where Trump's forces have consolidated behind conservative commentator <span class='selected-term'>John Gibbs</span>' bid to deny renomination to freshman Rep. Peter Meijer in August.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising",
    "sentiment": "0.0"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "d2022-04-25T00:00",
    "sentence": "? MI-03: Rep. Peter Meijer, who was one of the 10 House Republicans to vote to impeach Trump, faces primary opposition from conservative commentator <span class='selected-term'>John Gibbs</span>, who is Trump's endorsed candidate.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid",
    "sentiment": "0.0"
  }
]