[
  {
    "id": 70,
    "mediaId": 881,
    "date": "2022-00-01",
    "sentence": "Michigan Rep. Peter Meijer brought in more than a half-million dollarsten times the amount Trump-backed challenger <span class='selected-term'>John Gibbs</span> brought in from the time he launched his campaign in early November through the end of 2021.",
    "author": "Cameron Joseph",
    "title": "Trump's Favorite Candidates Are Getting Crushed in Fundraising",
    "sentiment": "0.0"
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "2022-00-02",
    "sentence": "Expect most of those locally who have been endorsed by Trump to be in attendance, though it's only certain that two others are speaking  U.S. Rep. Lisa McClain, R-Bruce Township, who represents the area where the rally is being held, and <span class='selected-term'>John Gibbs</span>, a former Trump administration official who is running for the Republican nomination against U.S. Rep. Peter Meijer, R-Grand Rapids, who also voted to impeach Trump.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know",
    "sentiment": "0.0"
  },
  {
    "id": 66,
    "mediaId": 238,
    "date": "2022-00-02",
    "sentence": "",
    "author": "",
    "title": "Opinion: Trump-endorsed candidates are having trouble fundraising. That's a bad sign for the former president.",
    "sentiment": "0.0"
  },
  {
    "id": 67,
    "mediaId": 43,
    "date": "2022-00-02",
    "sentence": "Freshman Rep. Peter Meijer of Michigan, another Trump target, raised $530,000, which far outpaced the $51,000 that his Trump-backed challenger <span class='selected-term'>John Gibbs</span> raised after entering the race in early November.",
    "author": "",
    "title": "Liz Cheney and other Trump targets trounce his endorsees in the fundraising race",
    "sentiment": "0.0"
  },
  {
    "id": 8197,
    "mediaId": 43,
    "date": "2022-00-02",
    "sentence": "Duty To Warn  (@duty2warn) February 1, 2022\nx\nOf the 93 candidates endorsed by Trump for 2022 so far, a majority of them have questioned the 2020 election results, according to an NBC News analysis.https://t.co/ZM17HYahZZ pic.twitter.com/BrPkY57Omn\n Meet the Press (@MeetThePress) January 14, 2022\nHouse of Representatives\nGus Bilirakis of Florida\nLauren Boebert of Colorado\nVern Buchanan of Florida\nMichael Burgess of Texas\nSteve Carra of Michigan\nJohn Carter of Texas\nMichael Cloud of Texas\nAndrew Clyde of Georgia\nRick Crawford of Arkansas\nMario Diaz-Balart of Florida\nByron Donalds of Florida\nPat Fallon of Texas\nChuck Fleischmann of Tennessee\nVirginia Foxx of North Carolina\n<span class='selected-term'>John Gibbs</span> of Michigan\nCarlos Gimnez of Florida\nPaul Gosar of Arizona\nHarriet Hageman of Wyoming\nDiana Harshbarger of Tennessee\nRonny Jackson of Texas\nJoe Kent of Washington\nAnna Paulina Luna of Florida\nMichael McCaul of Texas\nMax Miller of Ohio\nMary Miller of Illinois\nAlex Mooney of West Virginia\nGary Palmer of Alabama\nAugust Pfluger of Texas\nMatt Rosendale of Montana\nBeth Van Duyne of Texas\nDerrick Van Orden of Wisconsin\nRoger Williams of Texas\nMike Waltz of Florida\nRyan Zinke of Montana\nSenate\nJohn Boozman of Arkansas\nMo Brooks of Alabama\nTed Budd of North Carolina\nMike Crapo of Idaho\nChuck Grassley of Iowa\nRon Johnson of Wisconsin\nJohn Kennedy of Louisiana\nAdam Laxalt of Nevada\nJerry Moran of Kansas\nHerschel Walker of Georgia\nRand Paul of Kentucky\nMarco Rubio of Florida\nTim Scott of South Carolina\nKelly Tshibaka of Alaska\nwww.msn.com/...\nx\nA series of recent Trump comments and disclosures  including his discussing federal agencies seizing voting machines  have stripped away any pretense that 1/6 was anything but the culmination of his single-minded pursuit of retaining power.",
    "author": "",
    "title": "Previous Guy recruits a GOP that will crime for him and divert attention from his prosecution",
    "sentiment": "0.0"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "2022-00-05",
    "sentence": "Rep. Peter Meijer (R-Mich.) faces <span class='selected-term'>John Gibbs</span>, a former Trump administration official.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump",
    "sentiment": "0.0"
  },
  {
    "id": 85,
    "mediaId": 129,
    "date": "2022-00-05",
    "sentence": "",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6",
    "sentiment": "0.0"
  },
  {
    "id": 20,
    "mediaId": 124,
    "date": "2022-00-07",
    "sentence": "Senate\nSteve Carra*\nMich. House - Ended campaign\n<span class='selected-term'>John Gibbs</span>\nMich. House 3\nRyan Zinke\nMont.",
    "author": "",
    "title": "Trump is sitting on a fortune. Republicans want it for the midterms.",
    "sentiment": "0.0"
  },
  {
    "id": 77,
    "mediaId": 195,
    "date": "2022-00-14",
    "sentence": "Trump in November backed former Housing and Urban Development official <span class='selected-term'>John Gibbs</span> to challenge Meijer.",
    "author": "Cristina Marcos",
    "title": "The fates of the 10 House Republicans who voted to impeach Trump",
    "sentiment": "0.0"
  },
  {
    "id": 16,
    "mediaId": 558,
    "date": "2022-00-16",
    "sentence": "Another endorsee has big tech ties: <span class='selected-term'>John Gibbs</span> is running in Michigan after a career in Silicon Valley.",
    "author": "Ben Werschkul",
    "title": "Business resumes of J.D. Vance and other Trump-backed candidates",
    "sentiment": "0.0"
  },
  {
    "id": 57,
    "mediaId": 238,
    "date": "2022-00-17",
    "sentence": "Trump's pick against the personally wealthy Meijer, <span class='selected-term'>John Gibbs</span>, was also in bad financial shape.",
    "author": "",
    "title": "Opinion: Republicans who voted to impeach Trump might be in less peril than people think",
    "sentiment": "0.0"
  },
  {
    "id": 11,
    "mediaId": 376,
    "date": "2022-00-20",
    "sentence": "Michigan Rep. Peter Meijer raised $553,000, compared to the $123,000 raised by opponent <span class='selected-term'>John Gibbs</span>, a former acting assistant secretary in the Department of Housing and Urban Development in the Trump administration.",
    "author": "Herb Jackson",
    "title": "Trump targets outraise challengers, unlike some other incumbents",
    "sentiment": "0.0"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "2022-00-20",
    "sentence": "The former president endorsed <span class='selected-term'>John Gibbs</span>, a former official in his Department of Housing and Urban Development who has a history of promoting conspiracy theories and has signed a pledge to subpoena and investigate Biden's Covid-19 advisor, Anthony Fauci, if elected.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries",
    "sentiment": "0.0"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "2022-00-21",
    "sentence": "We turn next to Michigan's 3rd in the Grand Rapids area, where Trump's forces have consolidated behind conservative commentator <span class='selected-term'>John Gibbs</span>' bid to deny renomination to freshman Rep. Peter Meijer in August.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising",
    "sentiment": "0.0"
  },
  {
    "id": 10,
    "mediaId": 43,
    "date": "2022-00-21",
    "sentence": "But he is facing a primary, as you said, against <span class='selected-term'>John Gibbs</span> who is a former Trump administration official that Donald Trump has endorsed.",
    "author": "",
    "title": "The Downballot: Why House Democrats' best defense is a good offense (transcript)",
    "sentiment": "0.0"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "2022-00-22",
    "sentence": "It's like Magapalooza One.?\nThe list of candidates scheduled to attend include: Katie Arrington, candidate for South Carolina's 1st Congressional District; Ted Budd, candidate for U.S. Senate in North Carolina; Loren Culp, candidate for Washington state's 4th Congressional District; Russell Fry, candidate for South Carolina's 7th Congressional District; <span class='selected-term'>John Gibbs</span>, a former Housing and Urban Development official under Trump running to represent Michigan's 3rd Congressional District; Harriet Hageman, candidate for Wyoming's only congressional district; Adam Laxalt, candidate for U.S. Senate in Nevada; Max Miller, the former Trump White House aide and candidate for Ohio's 13th Congressional District; Morgan Ortagus, a former State Department spokeswoman running to represent Tennessee's 5th Congressional District; Kelly Tshibaka, candidate for U.S. Senate in Alaska; Derrick Van Orden, candidate for Wisconsin's 3rd Congressional District; Herschel Walker, candidate for U.S. Senate in Georgia; Ryan Zinke, the former Interior Secretary running in Montana's only congressional district.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores",
    "sentiment": "0.0"
  },
  {
    "id": 50,
    "mediaId": 21,
    "date": "2022-00-25",
    "sentence": "",
    "author": "Kimberly Leonard",
    "title": "Trump is gearing up for a major speech and MAGA-world wants him to bash Biden over Russia's invasion of Ukraine",
    "sentiment": "0.0"
  },
  {
    "id": 49,
    "mediaId": 21,
    "date": "2022-00-28",
    "sentence": "The political process was like a \"budding flower\" and CPAC networking was one piece, said <span class='selected-term'>John Gibbs</span>, who is running in a Republican primary against Rep. Peter Meijer of Michigan.",
    "author": "Kimberly Leonard",
    "title": "Inside the nation's most MAGA political boot camp where budding candidates work to build their conservative brand and score a few seconds with Donald Trump",
    "sentiment": "0.0"
  }
]