[
  {
    "id": 87,
    "mediaId": 43,
    "date": "1/4/2022 12:00:00 AM",
    "sentence": "Meijer, who was one of 10 House Republicans who voted to impeach Donald Trump, will need to turn back a primary challenge from Trump-backed conservative commentator <span class='selected-term'>John Gibbs</span> before he can focus on a potentially challenging general election, though.",
    "author": "",
    "title": "Morning Digest: Redistricting scrambled California's House map. Here's our guide to unscrambling it"
  },
  {
    "id": 85,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6"
  },
  {
    "id": 70,
    "mediaId": 881,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Michigan Rep. Peter Meijer brought in more than a half-million dollarsten times the amount Trump-backed challenger <span class='selected-term'>John Gibbs</span> brought in from the time he launched his campaign in early November through the end of 2021.",
    "author": "Cameron Joseph",
    "title": "Trump's Favorite Candidates Are Getting Crushed in Fundraising"
  },
  {
    "id": 71,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "The incumbent was one of the 10 House Republicans who voted to impeach Donald Trump, and Trump is backing conservative commentator <span class='selected-term'>John Gibbs</span>' bid to deny Meijer renomination in the August primary.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 2/1"
  },
  {
    "id": 65,
    "mediaId": 43,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "The incumbent was one of the 10 House Republicans who voted to impeach Donald Trump, which is why Trump is backing conservative commentator <span class='selected-term'>John Gibbs</span>' bid to deny Meijer renomination in the August primary.",
    "author": "",
    "title": "Morning Digest: Democrat announces rematch against House Republican under fire for impeachment vote"
  },
  {
    "id": 66,
    "mediaId": 238,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: Trump-endorsed candidates are having trouble fundraising. That's a bad sign for the former president."
  },
  {
    "id": 67,
    "mediaId": 43,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Freshman Rep. Peter Meijer of Michigan, another Trump target, raised $530,000, which far outpaced the $51,000 that his Trump-backed challenger <span class='selected-term'>John Gibbs</span> raised after entering the race in early November.",
    "author": "",
    "title": "Liz Cheney and other Trump targets trounce his endorsees in the fundraising race"
  },
  {
    "id": 57,
    "mediaId": 238,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Trump's pick against the personally wealthy Meijer, <span class='selected-term'>John Gibbs</span>, was also in bad financial shape.",
    "author": "",
    "title": "Opinion: Republicans who voted to impeach Trump might be in less peril than people think"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "The former president endorsed <span class='selected-term'>John Gibbs</span>, a former official in his Department of Housing and Urban Development who has a history of promoting conspiracy theories and has signed a pledge to subpoena and investigate Biden's Covid-19 advisor, Anthony Fauci, if elected.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "It's like Magapalooza One.?\nThe list of candidates scheduled to attend include: Katie Arrington, candidate for South Carolina's 1st Congressional District; Ted Budd, candidate for U.S. Senate in North Carolina; Loren Culp, candidate for Washington state's 4th Congressional District; Russell Fry, candidate for South Carolina's 7th Congressional District; <span class='selected-term'>John Gibbs</span>, a former Housing and Urban Development official under Trump running to represent Michigan's 3rd Congressional District; Harriet Hageman, candidate for Wyoming's only congressional district; Adam Laxalt, candidate for U.S. Senate in Nevada; Max Miller, the former Trump White House aide and candidate for Ohio's 13th Congressional District; Morgan Ortagus, a former State Department spokeswoman running to represent Tennessee's 5th Congressional District; Kelly Tshibaka, candidate for U.S. Senate in Alaska; Derrick Van Orden, candidate for Wisconsin's 3rd Congressional District; Herschel Walker, candidate for U.S. Senate in Georgia; Ryan Zinke, the former Interior Secretary running in Montana's only congressional district.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores"
  },
  {
    "id": 54,
    "mediaId": 43,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "? MI-03: The Democratic group EMILY's List has released a mid-January survey from Impact Research arguing that Rep. Peter Meijer is in real danger of losing his August Republican primary to conservative commentator <span class='selected-term'>John Gibbs</span>.",
    "author": "",
    "title": "Morning Digest: An old scandal resurfaces for Texas attorney general one week ahead of GOP primary"
  },
  {
    "id": 50,
    "mediaId": 21,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kimberly Leonard",
    "title": "Trump is gearing up for a major speech and MAGA-world wants him to bash Biden over Russia's invasion of Ukraine"
  },
  {
    "id": 49,
    "mediaId": 21,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "The political process was like a \"budding flower\" and CPAC networking was one piece, said <span class='selected-term'>John Gibbs</span>, who is running in a Republican primary against Rep. Peter Meijer of Michigan.",
    "author": "Kimberly Leonard",
    "title": "Inside the nation's most MAGA political boot camp where budding candidates work to build their conservative brand and score a few seconds with Donald Trump"
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "Expect most of those locally who have been endorsed by Trump to be in attendance, though it's only certain that two others are speaking  U.S. Rep. Lisa McClain, R-Bruce Township, who represents the area where the rally is being held, and <span class='selected-term'>John Gibbs</span>, a former Trump administration official who is running for the Republican nomination against U.S. Rep. Peter Meijer, R-Grand Rapids, who also voted to impeach Trump.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know"
  },
  {
    "id": 29,
    "mediaId": 63,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "Tracking Trump\n<span class='selected-term'>John Gibbs</span>, a GOP candidate for Congress in Michigan, held a fundraiser at Mar-a-Lago on Wednesday.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: MyPillow CEO Covered Some Travel Expenses For Kristi Noem's PAC"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Rep. Peter Meijer (R-Mich.) faces <span class='selected-term'>John Gibbs</span>, a former Trump administration official.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 26,
    "mediaId": 261,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Also voting to impeach was U.S. Rep. Peter Meijer, R-Grand Rapids, who is running for reelection this year despite Trump's endorsement of another candidate, <span class='selected-term'>John Gibbs</span>.",
    "author": "Todd Spangler",
    "title": "Rep. Fred Upton announces retirement from Congress, has been in US House since 1987"
  },
  {
    "id": 20,
    "mediaId": 124,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Senate\nSteve Carra*\nMich. House - Ended campaign\n<span class='selected-term'>John Gibbs</span>\nMich. House 3\nRyan Zinke\nMont.",
    "author": "",
    "title": "Trump is sitting on a fortune. Republicans want it for the midterms."
  },
  {
    "id": 11,
    "mediaId": 376,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Michigan Rep. Peter Meijer raised $553,000, compared to the $123,000 raised by opponent <span class='selected-term'>John Gibbs</span>, a former acting assistant secretary in the Department of Housing and Urban Development in the Trump administration.",
    "author": "Herb Jackson",
    "title": "Trump targets outraise challengers, unlike some other incumbents"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "We turn next to Michigan's 3rd in the Grand Rapids area, where Trump's forces have consolidated behind conservative commentator <span class='selected-term'>John Gibbs</span>' bid to deny renomination to freshman Rep. Peter Meijer in August.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising"
  },
  {
    "id": 10,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "But he is facing a primary, as you said, against <span class='selected-term'>John Gibbs</span> who is a former Trump administration official that Donald Trump has endorsed.",
    "author": "",
    "title": "The Downballot: Why House Democrats' best defense is a good offense (transcript)"
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Friday, Apr 22, 2022  11:30:12 AM Pacific Daylight Time  Jeff Singer\nMI-03: Rep. Peter Meijer, who was one of the 10 House Republicans to vote to impeach Trump, faces primary opposition from conservative commentator <span class='selected-term'>John Gibbs</span>, who is Trump's endorsed candidate.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "? MI-03: Rep. Peter Meijer, who was one of the 10 House Republicans to vote to impeach Trump, faces primary opposition from conservative commentator <span class='selected-term'>John Gibbs</span>, who is Trump's endorsed candidate.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid"
  },
  {
    "id": 3124,
    "mediaId": 376,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "The only Republican freshman who voted to impeach Trump in January 2021, he drew a Trump-backed primary challenger, <span class='selected-term'>John Gibbs</span>.",
    "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley\nNiels Lesniewski",
    "title": "Multiple threats mean there's no shortage of vulnerable House members"
  }
]