{
  "id": 2448,
  "mediaId": 65,
  "date": "1/3/2022 12:00:00 AM",
  "headline": "Two GOP senators have yet to say if they're running for reelection in November",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f6cae015-856f-423d-8559-1881a8a25514/eab076a3-948e-487a-9819-3771cb50d6b5/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/the-two-senators-whove-yet-to-say-if-theyre-running-for-reelection-in-november",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1147,
    1925,
    1963,
    2039,
    2087,
    146,
    428,
    562,
    571,
    2911,
    2972
  ],
  "sentences": [
    "Johnson stirred controversy in 2021 by questioning COVID-19 vaccines, seemingly downplaying the effects of climate change, and asserting that he never felt threatened by the rioters that stormed the U.S. Capitol on Jan. 6 of last year as they attempted to disrupt congressional certification of Biden's Electoral College victory over then-President Donald Trump.",
    "CLICK HERE FOR THE LATEST FOX NEWS REPORTING FROM THE CAMPAIGN TRAIL\nThe Senate is currently split 50-50 between the two major parties, but Democrats hold a razor-thin majority due to the tie-breaking vote of Vice President Kamala Harris through her constitutional duty as president of the chamber.",
    "The Senate contest in Wisconsin  a key battleground state that President Biden narrowly carried in the 2020 election  is one of a handful of contests that could ultimately decide which party controls the Senate.",
    "That means Republicans merely need a net gain of one seat to retake the Senate in November to regain control of the chamber they lost a year ago when they were narrowly swept in Georgia's twin Senate runoffs.",
    "Johnson vowed as he ran for reelection in 2016 to only serve two-terms, but with the Democrats controlling the White House and both houses of Congress, the senator says times have changed.",
    "Thune, a three-term senator who as minority whip is the number two ranking Republican in the chamber, told reporters on Capitol Hill that he would make a decision by the end of 2021.",
    "Thune, who remains very popular in South Dakota., raised eyebrows early last month when he told a reporter in his home state that his wife Kimberley wants him to return home.",
    "With 10 months to go until the 2022 midterms, two of the 34 senators up for reelection in November have yet to announce whether they'll seek another term on Capitol Hill.",
    "Johnson defeated three-term Democratic Sen. Russ Feingold in the Tea Party fueled GOP wave election of 2010, and then edged Feingold again in a 2016 rematch.",
    "Thune earned Trump's ire a year ago, for publicly speaking out against the then-president's efforts to overturn his 2020 election loss to Biden.",
    "While the Senate race in Wisconsin's considered a toss-up, the contest in solidly red South Dakota is considered safe for the Republicans.",
    "Ron Johnson of Wisconsin and John Thune of South Dakota say announcements on their pending decisions are expected soon.",
    "\"That decision will be made here shortly,\" the two-term Johnson told Fox 11 News in Green Bay, Wisconsin two weeks ago.",
    "If you're in a position to offer some improvement, help the situation out, would you just walk away?\"",
    "Kristi Noem, a close ally of the former president, to launch a primary challenge against Thune.",
    "But Noem dismissed any bid for Senate and is running next year for reelection as governor.",
    "\"She is done with it,\" Thune said in an interview with the Black Hills Pioneer.",
    "He praised those who attacked the Capitol as people who \"love this country.\"",
    "\"That's certainly one of the things that's weighing on my mind.",
    "Mandela Barnes  are seeking their party's Senate nomination.",
    "A dozen Democratic candidates  including Wisconsin Lt. Gov.",
    "Trump briefly urged South Dakota Gov.",
    "Johnson told Fox 11 News.",
    "But both Republican Sens."
  ]
}