[
  {
    "id": 3720,
    "mediaId": 2658,
    "date": "2022-01-22",
    "sentence": "HAPPY BIRTHDAY: Reps. <span class='selected-term'>Steve Chabot</span> (R-Ohio) and Rick Crawford (R-Ark.)",
    "author": "",
    "title": "POLITICO Playbook: A Saturday morning grab bag"
  },
  {
    "id": 3832,
    "mediaId": 2589,
    "date": "2022-01-26",
    "sentence": "(Free Beacon)\nA top Democratic Party recruit to run for Congress in an Ohio swing district wrote a proposal to defund Cincinnati police as the city experienced a spike in murders…\nLandsman’s proposal to defund police did not deter the Democratic Congressional Campaign Committee (DCCC) from recruiting the councilman to challenge Ohio Republican congressman <span class='selected-term'>Steve Chabot</span> this November.",
    "author": "Jazz Shaw",
    "title": "Democrats running \"defund the police\" fan in Ohio swing district"
  },
  {
    "id": 4062,
    "mediaId": 8459,
    "date": "2022-01-27",
    "sentence": "They participated in the March and also prayed on the steps of the Capital with Congressman <span class='selected-term'>Steve Chabot</span>.",
    "author": "The Catholic Telegraph",
    "title": "Photo Essay: Royalmont Academy at the March for Life"
  },
  {
    "id": 3244,
    "mediaId": 8285,
    "date": "2022-02-01",
    "sentence": "I loved the idea of the picture.”\nPureval thought he could ride his newfound political momentum to challenge U.S. Rep. <span class='selected-term'>Steve Chabot</span> in 2018, but the gerrymandered 1st District wasn’t ready for a fresh-faced Democrat.",
    "author": "John Fox",
    "title": "The Importance of Being Mayor Aftab"
  },
  {
    "id": 3097,
    "mediaId": 2511,
    "date": "2022-02-01",
    "sentence": "“This bill is an attempt to look tough on China without taking any real action,” said GOP Representative <span class='selected-term'>Steve Chabot</span> of Ohio.",
    "author": "Billy House and Daniel Flatley",
    "title": "House Democrats press for vote on US-China competition bill"
  },
  {
    "id": 2853,
    "mediaId": 2636,
    "date": "2022-02-01",
    "sentence": "Representative Carolyn Bourdeaux of Georgia, a Democrat, praised the program for giving local mainstays like the Aurora Theater, an arts venue, “the resources they need to get back on their feet.”\nAnd Representative <span class='selected-term'>Steve Chabot</span>, an Ohio Republican, brought Dr. Rich Coleman, owner of Four Paws Animal Hospital, to a House hearing.",
    "author": "",
    "title": "Little of the Paycheck Protection Program’s $800 Billion Protected Paychecks"
  },
  {
    "id": 2854,
    "mediaId": 2574,
    "date": "2022-02-02",
    "sentence": "Rep. <span class='selected-term'>Steve Chabot</span> (R., Ohio), also a member of the House Foreign Affairs Committee, said any bill that includes demands made by Code Pink and other far-left fringe organizations will not pass.",
    "author": "Adam Kredo",
    "title": "House Dem Parrots Radical Anti-War Coalition Working To Water Down China Bill"
  },
  {
    "id": 2757,
    "mediaId": 2746,
    "date": "2022-02-02",
    "sentence": "“As this committee in Congress considers this issue, we need to be cautious that our actions don’t further endanger broadcasters, particularly when it’s estimated that they provide billions of dollars in promotional value to artists,” said Rep. <span class='selected-term'>Steve Chabot</span>, Ohio Republican who served as the committee’s interim ranking member on Wednesday.",
    "author": "Mica Soellner",
    "title": "Gloria Estefan urges Congress to pass bill requiring artists to be paid for radio song plays"
  },
  {
    "id": 2253,
    "mediaId": 2679,
    "date": "2022-02-05",
    "sentence": "Rep. Carolyn Bourdeaux, D-Ga., praised the program for giving local mainstays like the Aurora Theater, an arts venue, “the resources they need to get back on their feet.”\nAnd Rep. <span class='selected-term'>Steve Chabot</span>, R-Ohio, brought Dr. Rich Coleman, owner of Four Paws Animal Hospital, to a House hearing.",
    "author": "STACY COWLEY",
    "title": "Little of the Paycheck Protection Program’s $800 billion protected paychecks"
  },
  {
    "id": 2455,
    "mediaId": 2649,
    "date": "2022-02-10",
    "sentence": "?<span class='selected-term'>Steve Chabot</span> and Brad Wenstrup.",
    "author": "Anna Massoglia",
    "title": "Rams and Bengals team owners pour money into political giving"
  },
  {
    "id": 2444,
    "mediaId": 8358,
    "date": "2022-02-10",
    "sentence": "But the latest map reduces the number of incumbents living in the same district, from four in the previous version to just one — Republican Reps. <span class='selected-term'>Steve Chabot</span> and Brad Wenstrup of Cincinnati — according to a caucus spokeswoman.",
    "author": "",
    "title": "Ohio Republicans regroup, postpone congressional map plan after latest Ohio Supreme Court redistricting rebuke"
  },
  {
    "id": 1716,
    "mediaId": 8290,
    "date": "2022-02-15",
    "sentence": "There is a concerted bipartisan effort in Congress, involving figures from Rep. Madeleine Dean, D-Pa., on the left to Rep. <span class='selected-term'>Steve Chabot</span>, R-Ohio, on the right.",
    "author": "Brian McNicoll",
    "title": "Why is a Patriotic American Businessman being harassed by Kuwait?"
  },
  {
    "id": 27,
    "mediaId": 8322,
    "date": "2022-02-24",
    "sentence": "BIDEN'S ‘BYSTANDER IN CHIEF’ APPROACH TO UKRAINE MAY EMBOLDEN CHINA IN ATTACKING TAIWAN; EXPERT WARNS\nWATCH HERE:\nRep. <span class='selected-term'>Steve Chabot</span> echoed similar sentiments.",
    "author": "Joe Schoffstall",
    "title": "Russia emboldened by Biden's diplomatic 'weakness,' delayed sanctions, House Foreign Affairs Republicans say"
  },
  {
    "id": 682,
    "mediaId": 6627,
    "date": "2022-02-24",
    "sentence": "Rep. <span class='selected-term'>Steve Chabot</span> echoed similar sentiments.",
    "author": "",
    "title": "Putin Pulled the Trigger: Ukraine and Russia at War"
  },
  {
    "id": 33,
    "mediaId": 2641,
    "date": "2022-02-26",
    "sentence": "The Ukrainian people are passionate and willing to fight for their country, but they need more help from the United States by way of tougher sanctions, more lethal weapons, and a halt to the United States' import of oil from Russia, Reps. <span class='selected-term'>Steve Chabot</span> and Brian Fitzpatrick said in a joint interview on Newsmax Saturday.",
    "author": "Sandy Fitzgerald",
    "title": "Reps. Fitzpatrick, Chabot to Newsmax: Ukraine Needs More from United States"
  },
  {
    "id": 12927,
    "mediaId": 2679,
    "date": "2022-03-01",
    "sentence": "Jamie Schwartz, 42, admitted embezzling the money while working for the campaigns of Rep. <span class='selected-term'>Steve Chabot</span>, R-Cincinnati, during 2011-2019.",
    "author": "The Associated Press",
    "title": "Ex-campaign chief for Ohio US rep sentenced in $1.4M theft"
  },
  {
    "id": 17611,
    "mediaId": 8491,
    "date": "2022-03-01",
    "sentence": "Schwartz admitted embezzling the money while working for the campaigns of Republican <span class='selected-term'>Steve Chabot</span> of Ohio.",
    "author": "The Associated Press",
    "title": "Ex-campaign chief for Ohio US rep sentenced in $1.4M theft"
  },
  {
    "id": 12895,
    "mediaId": 2537,
    "date": "2022-03-02",
    "sentence": "The only seat that would flip from Republican-leaning to Democratic-leaning is the 1st congressional district, currently represented by Rep. <span class='selected-term'>Steve Chabot</span>, but the seat is still very competitive.",
    "author": "Jessie Balmert",
    "title": "Ohio Republicans pass a new congressional map. Will it pass Ohio Supreme Court scrutiny?"
  },
  {
    "id": 10900,
    "mediaId": 2537,
    "date": "2022-03-08",
    "sentence": "Rick Rotundo, Loveland\nChabot's criticism of Supreme Court nominee unfair\nI heard Congressman <span class='selected-term'>Steve Chabot</span> on the radio attempting to ridicule President Biden's nominee to the Supreme Court.",
    "author": "",
    "title": "Letters: Pray for peace in Ukraine"
  },
  {
    "id": 10991,
    "mediaId": 2537,
    "date": "2022-03-08",
    "sentence": "Remember that the congressmen of our present gerrymandered districts, <span class='selected-term'>Steve Chabot</span> and Brad Wenstrup, voted against funding the replacement of the Brent Spence Bridge and the Western Hills Viaduct.",
    "author": "Letters to editor",
    "title": "Letters: Hit Russian oligarchs in their wallet if invasion continues"
  },
  {
    "id": 11122,
    "mediaId": 2746,
    "date": "2022-03-10",
    "sentence": "His GOP opponent, <span class='selected-term'>Steve Chabot</span>, has spent his entire career voting against the interests of his constituents.",
    "author": "Ramsey Touchberry",
    "title": "House Democrats unveil districts they hope to flip from red to blue"
  },
  {
    "id": 10817,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "The DCCC has also placed two Ohio candidates in the program: state Rep. Emilia Sykes, who is running for an open Akron seat, and Cincinnati Councilmember Greg Landsman, who is challenging GOP Rep. <span class='selected-term'>Steve Chabot</span>.",
    "author": "",
    "title": ""
  },
  {
    "id": 10815,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "According to Rep. <span class='selected-term'>Steve Chabot</span> (R-OH), the reason is simple: \"There’s zero support for Putin.\"",
    "author": "Tom Boggioni",
    "title": "Republicans are using Trump's Putin praise as a way to distance themselves from him: report"
  },
  {
    "id": 11212,
    "mediaId": 2694,
    "date": "2022-03-11",
    "sentence": "“There’s zero support for Putin,” Representative <span class='selected-term'>Steve Chabot</span> of Ohio told me Wednesday.",
    "author": "Elaine Godfrey",
    "title": "Congressional Republicans Have Found Their Red Line"
  },
  {
    "id": 11376,
    "mediaId": 2746,
    "date": "2022-03-14",
    "sentence": "• Greg Landsman, a member of the Cincinnati City Council, who is challenging longtime Rep. <span class='selected-term'>Steve Chabot</span> in Ohio’s First District, which includes parts of the city.",
    "author": "Mica Soellner",
    "title": "House Democrats go on offense against vulnerable Republicans with liberal challengers"
  },
  {
    "id": 9789,
    "mediaId": 2537,
    "date": "2022-03-21",
    "sentence": "I have a question for <span class='selected-term'>Steve Chabot</span>: Why did you vote against getting our veterans the health care they need?",
    "author": "",
    "title": "Letters: Training teaches how to handle a gun properly"
  },
  {
    "id": 9650,
    "mediaId": 2537,
    "date": "2022-03-21",
    "sentence": "Williams in his column points out that <span class='selected-term'>Steve Chabot</span> will attack Landsman about his proposal in their campaign this year for the U.S. House seat.",
    "author": "Letters to editor",
    "title": "Letter: More pressing issues in Delhi than men in skirts"
  },
  {
    "id": 9167,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "), Peter Meijer (R-Mich.), Young Kim (R-Calif.), Michelle Steel (R-Calif.), Brian Fitzpatrick (R-Pa.) and <span class='selected-term'>Steve Chabot</span> (R-Ohio).",
    "author": "",
    "title": "The new midterm math: How redistricting, Biden and Trump shaped the battle for the House"
  },
  {
    "id": 11716,
    "mediaId": 8463,
    "date": "2022-03-23",
    "sentence": "It threatens Rep. Marcy Kaptur, a Toledo Democrat, and Rep. <span class='selected-term'>Steve Chabot</span>, a Cincinnati Republican.",
    "author": "Jessie Balmert",
    "title": "Will Ohio Redistricting Commission's new approach yield better results? Optimism varies"
  },
  {
    "id": 9117,
    "mediaId": 2537,
    "date": "2022-03-29",
    "sentence": "Tellingly, my current congressional representative, <span class='selected-term'>Steve Chabot</span>, opposed the House version of the infrastructure bill.",
    "author": "Arnie Miller",
    "title": "Opinion: Gerrymandered districts set elected reps up for failure"
  },
  {
    "id": 7860,
    "mediaId": 2569,
    "date": "2022-04-01",
    "sentence": "The caucus, which boasts more than 200 members, is led by Díaz-Balart, Ohio Republican <span class='selected-term'>Steve Chabot</span>, Virginia Democrat Gerry Connolly and New Jersey Democrat Albio Sires.",
    "author": "",
    "title": "Delegation for 4.1.22: Map mania — China watch — Senate spotlight — hunting Hunter — traffic control"
  },
  {
    "id": 7861,
    "mediaId": 3987,
    "date": "2022-04-08",
    "sentence": "Republican Rep. <span class='selected-term'>Steve Chabot</span> recently stated during a hearing that “Republicans support legal immigration,” but as the Cato Institute’s David Bier noted, “They’re just against any bill that makes it even a tiny little bit easier and for any bill that makes it harder, even impossible.”\nMichelle Hackman of the Wall Street Journal recently explored the economic toll of the declining immigrant population, finding that our economy and demographic trends argue for exactly the opposite: we need more immigrant workers rather than fewer.",
    "author": "AV Press Releases",
    "title": "All Americans Pay a Price for Republicans’ Nativism"
  },
  {
    "id": 6500,
    "mediaId": 8358,
    "date": "2022-04-14",
    "sentence": "“The problem with the bill is it’s all talk and no action,” Rep. <span class='selected-term'>Steve Chabot</span>, R-Cincinnati, said in a February hearing.",
    "author": "",
    "title": "U.S. semiconductor funding might move forward"
  },
  {
    "id": 4811,
    "mediaId": 2562,
    "date": "2022-04-23",
    "sentence": "\"Congressman <span class='selected-term'>Steve Chabot</span> is delivering results for the incredible people of southwest Ohio,\" Trump said in a statement.",
    "author": "NationalWatch",
    "title": "Trump Sends Out Flurry of Endorsements Prior to Saturday Rally"
  }
]