[
  {
    "id": 3720,
    "mediaId": 2658,
    "date": "2022-01-22",
    "sentence": "HAPPY BIRTHDAY: Reps. <span class='selected-term'>Steve Chabot</span> (R-Ohio) and Rick Crawford (R-Ark.)",
    "author": "",
    "title": "POLITICO Playbook: A Saturday morning grab bag"
  },
  {
    "id": 2853,
    "mediaId": 2636,
    "date": "2022-02-01",
    "sentence": "Representative Carolyn Bourdeaux of Georgia, a Democrat, praised the program for giving local mainstays like the Aurora Theater, an arts venue, “the resources they need to get back on their feet.”\nAnd Representative <span class='selected-term'>Steve Chabot</span>, an Ohio Republican, brought Dr. Rich Coleman, owner of Four Paws Animal Hospital, to a House hearing.",
    "author": "",
    "title": "Little of the Paycheck Protection Program’s $800 Billion Protected Paychecks"
  },
  {
    "id": 33,
    "mediaId": 2641,
    "date": "2022-02-26",
    "sentence": "The Ukrainian people are passionate and willing to fight for their country, but they need more help from the United States by way of tougher sanctions, more lethal weapons, and a halt to the United States' import of oil from Russia, Reps. <span class='selected-term'>Steve Chabot</span> and Brian Fitzpatrick said in a joint interview on Newsmax Saturday.",
    "author": "Sandy Fitzgerald",
    "title": "Reps. Fitzpatrick, Chabot to Newsmax: Ukraine Needs More from United States"
  },
  {
    "id": 11122,
    "mediaId": 2746,
    "date": "2022-03-10",
    "sentence": "His GOP opponent, <span class='selected-term'>Steve Chabot</span>, has spent his entire career voting against the interests of his constituents.",
    "author": "Ramsey Touchberry",
    "title": "House Democrats unveil districts they hope to flip from red to blue"
  },
  {
    "id": 9650,
    "mediaId": 2537,
    "date": "2022-03-21",
    "sentence": "Williams in his column points out that <span class='selected-term'>Steve Chabot</span> will attack Landsman about his proposal in their campaign this year for the U.S. House seat.",
    "author": "Letters to editor",
    "title": "Letter: More pressing issues in Delhi than men in skirts"
  }
]