{
  "id": 1112,
  "mediaId": 376,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "At the Races: KBJ OK TBD",
  "image": "https://i0.wp.com/cdn.media.rollcall.com/author/2019/10/AT-THE-RACES-LOGO-20202400x1300.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/03/24/at-the-races-kbj-ok-tk/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley",
  "authorUrl": "",
  "termIds": [
    753,
    753,
    812,
    812,
    1448,
    1448,
    1333,
    1333,
    2162,
    2162,
    2261,
    2261,
    2347,
    2347,
    577,
    577,
    400,
    400,
    2621,
    2621
  ],
  "sentences": [
    "Endorsements II: Michigan Rep. Andy Levin, who faces fellow Democratic Rep. Haley Stevens in the 11th District, touted endorsements from 12 colleagues, including Natural Resources Chair Ral M. Grijalva, Judiciary Chair Jerrold Nadler and Small Business Chair Nydia M. Velzquez, as well as Reps. Pramila Jayapal of Washington, Mark Pocan of Wisconsin, Steve Cohen of Tennessee, Lloyd Doggett of Texas, Dwight Evans of Pennsylvania, Jess Chuy? Garca of Illinois, Al Green of Texas, Jamie Raskin of Maryland and Eleanor Holmes Norton of Washington, D.C.\nEndorsements III: Value In Electing Women PAC, or VIEWPAC, which supports female GOP candidates, endorsed Jennifer Strahan, who is challenging Georgia Republican Rep. Marjorie Taylor Greene.",
    "Endorsement Watch: Planned Parenthood Action Fund, the advocacy and political arm of Planned Parenthood Federation of America, announced nine Democratic House endorsements Friday: Sydney Kamlager, in California's 37th District; Jay Chen, in California's 45th District; Yadira Caraveo, in Colorado's 8th District; Christina Bohannan, in Iowa's 1st District; Liz Mathis, in Iowa's 2nd District; Nikki Budzinski, in Illinois' 13th District; Erica Smith, in North Carolina's 1st District; Val Hoyle, in Oregon's 4th District; and Andrea Salinas, in Oregon's 6th District.",
    "What that means to me is really investing not only in where someone sees themselves, but also making sure that from the person that comes into our office who generously cleans our trash and our recycling, to knowing the name of my interns and making sure that I invest in the next generation of who is going to take on what we started, because that really is important to me.? She added, I want to make sure that the personal development is really at the core of everything.?\nDo you know someone who works in campaigns whom we should feature for Shop Talk?",
    "GOP conference readout: House Republicans are gathered to work on their legislative agenda should they win back the majority later this year but are also focused on criticizing President Joe Biden for rising gas prices and inflation, CQ Roll Call's Chris Marquette reports from Ponte Vedra Beach, Fla.\nICYMI\nMidterm stakes: Republicans are already preparing for a showdown in 2023 with the Biden administration over raising the debt limit, and Democrats are talking about blaming them for a global economic collapse,? CQ Roll Call's David Lerman reports.",
    "Eric Greitens' past was again thrust into the center of his bid for the GOP nomination for the state's open Senate seat when his ex-wife accused him during a child custody dispute of being physically abusive and demonstrating such unstable and coercive behavior' that steps were taken to limit his access to firearms.? Some prominent Republicans had already been trying to convince Trump not to endorse Greitens because of the sex scandal that led to his resignation as governor in 2018.",
    "Speaking of the DCCC: Chairman Sean Patrick Maloney of New York recently told Axios: I'm completely over mask mandates.? He added that, I'm for whatever gets rid of mask mandates as quickly as possible.? The airline lobby, Airlines for America, is over them, too, urging the White House to lift such mandates as well as COVID-19 testing requirements for international travelers.",
    "District docket: The Supreme Court decided not to overturn a state court order creating a congressional map in Wisconsin that might allow the GOP to pick up one seat, but it threw out a court-ordered Wisconsin legislative map that would have created a new district in which Black voters would have more influence, CQ Roll Call's Michael Macagnone reports.",
    "Intraparty conflict: Departing Florida Democratic Rep. Stephanie Murphy didn't mince words, apparently, in her criticism of her party's House campaign arm, saying its structure makes it difficult for you to also then protect moderates and create space for them to do what they need to do to win and hold seats,? according to Politico's Playbook.",
    "The poll comes as an NRCC memo this week says Democrats face an increasingly challenging political environment.?\nWhat we're reading\nStu says: A fundraising email from Georgia GOP Rep. Marjorie Taylor Greene led Stu Rothenberg to wonder if a member of Congress can go so far that he or she starts to sound ignorant and radical.?\nGoing Negative?",
    "When she's not working, her favorite way of de-stressing is morning walks with her dog, which she says put her in a meditative state,? giving her time to be thankful for the opportunity to wake up and do the work all over again.?\nStarting out: Her interest in politics was strong by the time Ortiz arrived at the University of Texas at Austin.",
    "Ted Cruz of Texas, Josh Hawley of Missouri and Tom Cotton of Arkansas were among the Republicans with the sharpest questioning for Jackson on issues including critical race theory and sentences she gave in a handful of child pornography cases as a federal district court judge, CQ Roll Call's Todd Ruger and Jim Saksa reported.",
    "So I think out of something very painful for all of us, who worked in the movement, came this incredible opportunity to create a new movement.?\nBiggest campaign regret: She worked for the presidential campaign of former New Jersey Democratic Sen. Bill Bradley, who had played professional basketball for the New York Knicks.",
    "Making noise: Gino Campana, a developer who is running in the GOP Senate primary in Colorado, was warned by police that he risked being arrested for obstruction after he became argumentative with them about being cited for a noise violation during his daughter's high school graduation party in 2013, The AP reported.",
    "House calls: Former White House photographer Pete Souza has used his Twitter feed to taunt White House physician-turned-House member from Texas' 13th District Ronny Jackson, sometimes sharing embarrassing personal stories to counter Jackson's unsubstantiated claims about Biden's health, The New York Times reports.",
    "Coming up\nSpecial guest speakers? at Trump's rally Saturday at a race track in Commerce, Ga., include former Sen. David Perdue, the former president's pick for governor; Senate candidate Herschel Walker; Rep. Jody Hice, who is running for secretary of state; and Reps. Marjorie Taylor Greene and Andrew Clyde.",
    "Nathan's notes\nRural voters' shift away from Democrats means the GOP could flip a Wisconsin seat, but a Supreme Court decision blocking a lower court's order regarding districts where Black voters have more influence means primaries will be the main source of drama in Alabama and Mississippi, Nathan writes.",
    ": The Democratic Senate primary in the Keystone State has been tame compared to the state's Republican campaigns, but a slide deck obtained by Politico shows that a super PAC supporting Pennsylvania Rep. Conor Lamb highlights the testing of aggressive negative messaging against [Senate rival and Lt. Gov.",
    "Starting gate\nBack to normal-ish: As mask and other requirements lift across the country, and with people reengaging more in social and civic life, candidates, political organizers and D.C. lobbyist donors say in-person events are coming back, making the 2022 midterm campaigns more of a return to normal.",
    "By Mary Ellen McIntire, Stephanie Akin and Kate Ackley\nJudge Ketanji Brown Jackson's nomination to the Supreme Court appears on track after hours of testimony before the Senate Judiciary Committee this week, which also featured a few 2022 candidates in safe seats and some likely presidential hopefuls.",
    "Sh*t show: Katie Arrington, a Trump-endorsed Republican challenging GOP Rep. Nancy Mace in South Carolina's 1st District, called Trump's former acting White House chief of staff Mick Mulvaney a piece of sh*t? two times in a fiery text message exchange, the Columbia newspaper The State reports.",
    "And so it was just an incredible experience, and I was bitten by the bug.?\nMost unforgettable campaign moment: At Equality California, she worked for years toward making same-sex marriage legal, through losses and wins, as the state first permitted same-sex marriage and then prohibited it.",
    "Trump responded, saying the sooner McConnell leaves the leadership, the better off the Republican Party will be.?\nSuccession plans: The death of Alaska Rep. Don Young at age 88 will set in motion a special election to replace him and will be the state's first with ranked-choice voting.",
    "Candidate confessions\nMichigan state Sen. Tom Barrett, a Republican hoping to challenge Democratic Rep. Elissa Slotkin in the state's newly drawn 7th District, is the great-grandson of former Rep. Louis Rabaut, who was first elected to represent Michigan in the House in the 1930s.",
    "Foreign influence: The Securities and Exchange Commission should adopt regulations to identify foreign-owned companies that spend corporate funds to influence elections, Maryland Rep. Jamie Raskin and 15 other House Democrats say in a new letter first shared with CQ Roll Call.",
    "Already, two candidates have said they're in the race, including Nick Begich III, whose grandfather, Nick Begich, Young replaced after the elder Begich was presumed dead in a plane crash along with Louisiana Rep. Hale Boggs, who at the time was House majority leader.",
    "Mulvaney had been quoted in an NBC News story saying that Arrington was not the best candidate by any stretch of the imagination.?\nDidn't stay in Vegas: The wife of Nevada Democratic Rep. Steven Horsford took to Twitter to air some family problems.",
    "The Judicial Crisis Network launched a $1.5 million ad buy this week criticizing a previous Jackson comment, reported by ABC News, in which she said she doesn't understand? Justice Clarence Thomas, and highlighting a documentary about his life.",
    "Democratic Sen. Alex Padilla, who is on the ballot in California for his first full term after being appointed to fill Vice President Kamala Harris' seat, took an opportunity to speak in Spanish and focused on Latino issues related to the law.",
    "Higher ambition: New York Rep. Elise Stefanik, who has built up a fundraising network and has made her fidelity to Trump a key strategy, has her eye on rising in the House GOP leadership ranks, according to CNN.",
    "Border messaging: Facing tough electoral headwinds this year, some vulnerable Democrats have begun to emphasize border security as a key part of their immigration message, CQ Roll Call's Caroline Simon reports.",
    "Fresh polling: Registered voters are equally split on whether they would vote for a Republican or a Democrat in this year's midterm elections, according to a poll released Thursday by the Pew Research Center.",
    "I know that probably most people would answer this [unforgettable campaign moment] question with the success of the campaign, and mine was ... losing marriage equality in the state of California,? Ortiz said.",
    "Republican charges that Jackson is soft on crime echo arguments the GOP has made against calls to defund the police and signals that they will blame Democrats for rising crime ahead of this year's elections.",
    "On Tuesday and Wednesday, Jackson answered questions from Republicans on topics that the party's candidates could bring up on the campaign trail this year, including the ways schools teach about racism.",
    "Part of what drew her to the university was that she wanted to attend a class taught by Sarah Weddington, who represented Jane Roe? in the 1973 landmark abortion rights Supreme Court case Roe v. Wade.",
    "I said I would do anything, and I got to do absolutely everything  between travel and comms and picking up fried chicken for her Wednesdays to, you know, stamping postcards with her mother on Fridays.",
    "Before, it was something that people were afraid to discuss.? But after the reversal in California, it was really being taken on in the country, in the world as something that was at the forefront.",
    "Early exit: Democratic Rep. Filemon Vela plans to resign from Congress in the coming weeks to take a post at the Akin Gump Strauss Hauer & Feld lobbying firm, according to reports Thursday morning.",
    "The former president issued a lengthy statement saying the conservative lawmaker had gone \"woke\" by suggesting that Trump should move beyond claims that he lost the 2020 election because of fraud.",
    "John] Fetterman.?\nRepresenting: USA Today looks at the rise of Black women running for elective office, how they approach fundraising and what has motivated some to launch their campaigns.",
    "Democrats sought to defend Jackson, with New Jersey Sen. Cory Booker delivering a personal speech about the historic nature of Jackson's nomination as questioning neared its end Wednesday.",
    "You go to Old Navy, and it would be love is love.' You would go to Target and you would be able to buy, you know, bags or T-shirts that had pride symbols on it around marriage equality.",
    "Calling all bitcoiners: Bruce Fenton, a political newcomer who is a financial adviser with a focus on bitcoin, could enter the New Hampshire Republican Senate primary, Politico reports.",
    "Brooks, in a subsequent statement, said Trump had asked him to rescind the 2020 elections, immediately remove Biden from the White House? and had made other seemingly illegal requests.",
    "Voting probe: Authorities in North Carolina are reviewing former White House Chief of Staff Mark Meadows' use of a mobile home as his address to get an absentee ballot, WRAL reports.",
    "Shop talk: Michelle Ortiz\nOrtiz, who serves as the executive director of the Democratic Attorneys General Association, has a long history of working on political and issue campaigns.",
    "Squire Patton Boggs' roster of lobbyists includes former House Speaker John A. Boehner, who represented Ohio in the House, and New York Democratic ex-Rep. Joe Crowley, among others.",
    "The count: $50,000\nThat's how much Trump's Save America PAC disclosed paying for legal consulting? to Squire Patton Boggs on Feb. 25, according to a recent federal campaign filing.",
    "Photo finish\nSupreme Court nominee Ketanji Brown Jackson greets Sen. Josh Hawley, R-Mo., upon arriving for her confirmation hearing before the Senate Judiciary Committee on Monday.",
    "In so doing she learned a great deal about the policies and procedures that affect women.? Her first campaign job came shortly after arriving on campus, working for Texas Gov.",
    "UNendorsed: The Alabama Senate GOP primary took a dramatic turn this week, as Donald Trump withdrew his previous endorsement of Rep. Mo Brooks, who has lagged in recent polls.",
    "When she worked for EMILY's List, she said she attended an event at the home of singer Katy Perry, who invited Ortiz and then-Sen. Kamala Harris to play Ms. Pac-Man.",
    "My father is also involved in politics, so I like to say it's something that's in my blood,? he told the state County Roads Association journal Crossroads in 2019.",
    "As Barrett tells the story, Rabaut is best known for introducing the first resolution to add the words under God? to the Pledge of Allegiance in the early 1950s.",
    "According to a 1954 account from United Press International, Rabaut and Michigan Sen. Homer Ferguson sponsored bills proposing identical changes to the wording.",
    "Among those polled, 43 percent said they would vote for the Republican in their district, while 43 percent said they would vote for the Democratic candidate.",
    "Republicans were more likely to say their vote was against Biden (71 percent), while fewer Democrats said their vote would be for the president (46 percent).",
    "Rabaut and Ferguson read the new pledge together during a Flag Day ceremony on the Capitol steps to show they had formally ended the dispute,? UPI reported.",
    "Iowa Sen. Charles E. Grassley, who is up for reelection for an eighth term this year in a race Inside Elections rates as Solid Republican, mostly laid low.",
    "Brooks, who will face primary voters May 24, has also urged fellow GOP candidates to pledge to oppose Mitch McConnell as the party's leader in the Senate.",
    "I really regret that I didn't really take my A game and make more three-pointers.? That's not her only should-have moment from her career in politics.",
    "But Rabaut blocked House approval of the Senate measure, arguing that his bill had been introduced a year before, so it should be the one enacted.",
    "The Senate bowed to Rabaut's pride of authorship the next day and approved and sent the change to the White House,? according to the UPI account.",
    "Sonya Douglass Horsford said she was speaking out about the impact of her husband's affair on their family after he filed to run for reelection.",
    "It marks the first time in its 25-year history that the group has endorsed someone running against a sitting member of Congress in a primary.",
    "Republicans bringing up hot-topic issues had to balance exciting their base without alienating swing voters, John T. Bennett wrote this week.",
    "And so I chose to ask if I could just sit in without making any noise, just to absorb the greatness of what I had read about,? she said.",
    "After Jackson was nominated last month, the liberal group Demand Justice announced a $1 million ad buy supporting her nomination.",
    "Vela, who represents the 34th District along the Mexican border, had already announced he would not seek reelection this year.",
    "(Tom Williams/CQ Roll Call)\nSubscribe now using this link so you don't miss out on the best news and analysis from our team.",
    "And he would take us out, and we would do pickup games, and I really regret that I took it so easy on him,? Ortiz recalled.",
    "Meadows' wife, Debra Meadows, also appears to have filed two voter forms from that address, The Washington Post reports.",
    "Grassley ceded the GOP spotlight to a trio of Republicans who are considered potential 2024 presidential candidates.",
    "Unconventional wisdom: The most important thing for me is building my team; they become my family,? Ortiz said.",
    "Potential candidates must file by April 1 to run in a June 11 special primary that will be entirely by mail.",
    "The ad wars around the nomination have been more subdued than some recent Supreme Court nomination fights.",
    "Fellow Democratic Rep. Vicente Gonzalez, who represents the 15th District, is running for the seat.",
    "I really regret sticking to the schedule and the run of show because it would have been really fun.",
    "The special election is set to take place Aug. 16, the same day as the state's all-party primary.",
    "A spokesman for the firm did not respond to a request for comment about the nature of the work.",
    "A Fox News poll found that 56 percent of registered voters asked would vote to confirm Jackson.",
    "Inside Elections with Nathan L. Gonzales rates the 34th District race Solid Democratic.",
    "Previously, she spent more than seven years with EMILY's List as its western director.",
    "Barrett cites Rabaut's legacy as one of the reasons he became interested in politics.",
    "They cite Russia's invasion of Ukraine to underscore the urgent need for the action.",
    "Fenton, a libertarian, said he expects to make a final decision by early next month.",
    "The elder Begich and Boggs were Democrats, while the younger Begich is a Republican.",
    "Democrat Christopher Constant plans to run, too, according to The Associated Press.",
    "The public filing listed Squire Patton Boggs' Atlanta office as the firm's address.",
    "Inside Elections with Nathan L. Gonzales rates Padilla's race as Solid Democratic.",
    "Ann Richards' reelection campaign against George W. Bush in 1994, which Bush won.",
    "Each week we'll bring you news and analysis from the CQ Roll Call campaign team.",
    "He would join a primary that includes three lesser-known Republicans after Gov.",
    "But Rabaut almost missed getting credit for the change to the flag pledge.",
    "Senate Democrats hope to hold a floor vote on her nomination by mid-April.",
    "Chris Sununu opted to seek reelection rather than run for the Senate.",
    "Begich III had already filed paperwork to challenge Young last year.",
    "But Weddington's class had a two-year waiting list, Ortiz recalled.",
    "Most recently, she was a consultant for End Citizens United.",
    "Know someone who'd like to get this newsletter?",
    "Another 10 percent said they weren't sure.",
    "That would have been amazing,? Ortiz said.",
    "Email us at attheraces@cqrollcall.com.",
    "#MO Senate: Former Missouri Gov.",
    "Or, at least, normal-ish.",
    "They can subscribe here.",
    "Welcome to At the Races!",
    "Sens."
  ]
}