{
  "id": 1549,
  "mediaId": 21,
  "date": "1/26/2022 12:00:00 AM",
  "headline": "Biden vowed to nominate a Black woman to the Supreme Court. Here's a look at his shortlist.",
  "image": "https://i.insider.com/61f19250792e7300116bbdee?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/biden-supreme-court-shortlist-names-first-black-woman-2022-1",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brent D. Griffiths",
  "authorUrl": "https://www.businessinsider.com/author/brent-d-griffiths",
  "termIds": [
    2429,
    2429,
    2408,
    2087,
    2347,
    2347,
    2408,
    2087,
    2034,
    2034,
    1865,
    1865,
    477,
    477,
    482,
    482,
    546,
    546
  ],
  "sentences": [
    "Clyburn was instrumental in getting Biden to commit to naming a Black woman to the court and his endorsement of Biden before the South Carolina primary is widely regarded as the springboard that powered Biden to the Democratic Party's presidential nomination.",
    "\"I'm afraid that some in our party are lapsing into this notion that can only result in an elitist court, so that's a problem for me,\" Clyburn told the Post and Courier, a local South Carolina newspaper, in December 2021.",
    "Education: University of South Carolina Law School; University of South Carolina School of Business (Masters); University of South Florida (BS)\nChilds currently serves as a federal court judge in South Carolina.",
    "Education: Harvard Law School; Harvard University\nJackson replaced Attorney General Merrick Garland on the DC Circuit Court of Appeals, often referred to as the nation's second-highest court, in June 2021.",
    "Leondra Kruger\n In this Dec. 22, 2014 file photo Leondra Kruger addresses the Commission of Judicial Appointments during her confirmation hearing to the California Supreme Court in San Francisco.",
    "Education: Princeton University; Yale Law School\nEunice C. Lee\nAge: 51\nExperience: Judge Lee sits on the US Second Circuit Court of Appeals, which oversees New York, Connecticut, and Vermont.",
    "Kruger also helped with the Obama administration's defense of the Affordable Care Act, which later resulted in Roberts' landmark 5-4 ruling that save Obama's signature domestic achievement.",
    "Insider previously reported that Kruger twice turned down the White House's offer to name her as solicitor general, another job that has at times served as a stepping stone to the court.",
    "\"She's the odds-on favorite\" to be Biden's first pick, Jonathan Adler, a law professor at Case Western Reserve University and a former clerk at the DC Circuit, told Insider in 2020.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "From 2000-2006, she served as a gubernatorial appointee on South Carolina's Department of Labor, Licensing and Regulation and later its Worker's Compensation Commission.",
    "\"She's a very good choice based on her performance as a state supreme court justice,\" Frank Ravitch, a law professor at Michigan State University, told Insider in 2020.",
    "Tom Williams/AP\nAge: 42\nExperience: Jackson-Akiwumi currently serves as a circuit court judge on the Seventh Circuit, which oversees Illinois, Indiana, and Wisconsin.",
    "3 House Democrat, previously confirmed reporting that he's told Biden's staff and people around the president that Childs would be an ideal candidate for the court.",
    "If appointed and confirmed, she would be the first justice who attended a public law school since Justice Sherman Minton, who retired from the court in 1956.",
    "Here's a look at some of the top names on a possible shortlist:\nKetanji Brown Jackson\n Ketanji Brown Jackson was a former clerk for Justice Stephen Breyer.",
    "DC Circuit Court Judge Ketanji Brown Jackson, California Supreme Court Justice Leondra Kruger, and federal court judge J. Michelle Childs are pictured.",
    "Kevin Lamarque-Pool/Getty Images; S. Todd Rogers/AP; Charles Dharapak/AP\nJustice Stephen Breyer is reportedly stepping down from the Supreme Court.",
    "She is the first former federal defender to serve on the second circuit and the longest-serving public defender to be an appeals court judge.",
    "President Joe Biden has previously promised that his first pick would be the first-ever Black woman to serve on the nation's highest court.",
    "The most recent example of this is Justice Brett Kavanaugh, who replaced his one-time boss Justice Anthony Kennedy on the high court.",
    "She worked at the Justice Department during President George W. Bush's administration and later under President Barack Obama as well.",
    "Chief Justice John Roberts wrote a unanimous opinion for the court that rejected Kruger and the Obama Justice Department's view.",
    "From 1992-2000, she worked in private practice where she became the first black female partner at a major law firm in the state.",
    "She combines an understated and easygoing manner with a keen legal mind and unquestioned integrity,\" Clement said at the time.",
    "The Senate confirmed her 2013 nomination by voice vote, which is often typical for presumed uncontroversial lower-court picks.",
    "Biden nominated Lee for the second circuit last May and the Senate confirmed her to the position in August by a vote of 50-47.",
    "According to Scotusblog.com, one of those cases involved a high-profile dispute over employment discrimination laws in 2011.",
    "She received unanimous support from Senate Democrats and three Republican votes for her confirmation to the circuit court.",
    "Previously, she worked in the private sector from 2007-2010, when she worked as a litigation associate for Skadden Arps.",
    "\"Ms. Jackson has established herself as both a top-flight attorney and a dedicated public servant,\" Obama said in 2009.",
    "Historically speaking, Supreme Court justices often ask presidents to consider their former clerks when they retire.",
    "There may soon be an open seat on the Supreme Court as Justice Stephen Breyer is reportedly retiring from the court.",
    "According to her biography, Lee worked at the Office of the Appellate Defender in New York City from 1998 to 2019.",
    "Candace Jackson-Akiwumi\n Candace Jackson-Akiwumi testifies during her Senate confirmation hearing in April 2021.",
    "Education: Yale Law School; Harvard University\nKruger currently serves on the California state Supreme Court.",
    "Kevin Lamarque-Pool/Getty Images\nAge: 51\nExperience: Jackson joined the DC Circuit Court of Appeals in 2021.",
    "Charles Dharapak/AP\nAge: 55\nExperience: Childs has served on the federal bench in South Carolina since 2010.",
    "\"She's very methodical and she's able to give really solid analysis of the legal issues she's dealing with.\"",
    "She rose to become Acting Deputy Solicitor General and argued 12 cases in front of the US Supreme Court.",
    "\"Leondra is an outstanding lawyer and was an even better colleague at the Office of Solicitor General.",
    "Obama, in a statement at the time, praised Jackson when he nominated her to the Sentencing Commission.",
    "She clerked for a district judge and an appeals court judge after graduating from law school in 1996.",
    "J. Michelle Childs\n Judge J. Michelle Childs listens during her Senate confirmation hearing in 2010.",
    "Todd Rogers, Pool, File\nAge: 45\nExperience: Kruger joined California's state Supreme Court in 2015.",
    "Jerry Brown said in 2014 that Kruger was \"a distinguished lawyer and uncommon student of the law.\"",
    "Of the current nine justices, only Justice Amy Coney Barrett attended a non-Ivy League law school.",
    "Jackson would not need a single Republican vote if all 50 Senate Democrats supported her again.",
    "She also clerked for former Supreme Court Justice John Paul Stevens during the 2003-2004 term.",
    "Notably, Paul Clement, who served as one of Bush's solicitor generals, praised Kruger as well.",
    "President Biden previously promised to make a Black woman his first selection to the court.",
    "As Clyburn pointed out, Supreme Court justices typically hail from Ivy League law schools.",
    "Education: Ohio State University; Yale Law School\n Sign up for notifications from Insider!",
    "Susan Collins, Lisa Murkowski, and Lindsey Graham all voted for Jackson's confirmation.",
    "From 2007-2013, she served in both the George W. Bush and Obama Justice Departments.",
    "Childs, who is from Detroit, attended the University of South Carolina Law School.",
    "From 2006-2010, she served as a state-level circuit court judge in South Carolina.",
    "Jackson was already viewed as a potential future justice during her confirmation.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Minton attended both the University of Indiana Law School and Yale Law School.",
    "Biden recently nominated Childs for a seat on the DC Circuit Court of Appeals.",
    "Barrett received her law degree from the University of Notre Dame Law School.",
    "She was also the first Black woman to serve as editor of the Yale Law Review.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "Previously, she served on the DC federal district court from 2013 to 2021.",
    "Biden recently nominated her to serve on the DC Circuit Court of Appeals.",
    "Justice Elena Kagan is the most recent person to have followed that path.",
    "Insider has a look at some of the names reportedly on Biden's shortlist.",
    "The DC circuit has long been a stepping stone to the US Supreme Court.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "She also worked in the public sector as a law clerk from 2005-2007.",
    "In announcing her appointment to the California Supreme Court, Gov.",
    "From 2010-2014, she served on the US Sentencing Commission.",
    "\"Clarence Thomas is an Ivy League school graduate.",
    "Stay up to date with what you want to know.",
    "Thurgood Marshall was an HBCU graduate.",
    "Jackson also once clerked for Breyer.",
    "Loading Something is loading.",
    "She also clerked for Breyer.",
    "Obama appointed her in 2010.",
    "Rep. Jim Clyburn, the No.",
    "Which would you prefer?\"",
    "AP Photo/S.",
    "Sens."
  ]
}