{
  "id": 1570,
  "mediaId": 21,
  "date": "1/22/2022 12:00:00 AM",
  "headline": "The Arizona Democratic Party unanimously voted to censure Sen. Kyrsten Sinema for voting to uphold the filibuster",
  "image": "https://i.insider.com/60b23bb0bee0fc0019d5a6bf?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/arizona-democratic-party-unanimously-censure-sen-kyrsten-sinema-filibuster-2022-1",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kayla Epstein",
  "authorUrl": "https://www.businessinsider.com/author/kayla-epstein",
  "termIds": [
    958,
    1138,
    1896,
    2505,
    33,
    146,
    428,
    562,
    571,
    2550,
    2866
  ],
  "sentences": [
    "Their censure indicates growing frustration from state party officials with their sitting senator, and could portend trouble for Sinema as progressives clamor for a progressive to challenge her in a primary in 2024.State parties typically help raise funds, knock on doors, register voters, and arrage rallies, providing a major boost to a statewide candidate.",
    "\"While we take no pleasure in this announcement, the ADP executive board has decided to formally censure Senator Sinema as a result of her failure to do whatever it takes to ensure the health of our democracy,\" said party chair Raquel Tern in a statement.",
    "In October, the ADP issued a resolution that urged Sinema to vote with the rest of her colleagues to abolish the Senate filibuster, which allows the minority party to block unfavorable legislation.",
    "Rep. Ruben Gallego, a congressman representing the Phoenix area, is emerging as an early favorite to primary Sinema in two years and has left the door open to a run in statements to the press.",
    "The Arizona Democratic Party unanimously voted to censure Sen. Kyrsten Sinema on Saturday in one of the most significant rebukes yet for her vote to uphold the Senate filibuster.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "The Democrats had hoped to pass two key voting rights bills this month, but with the filibuster in place, the bills faced an impassible Republican blockade in the Senate.",
    "Tom Williams/CQ-Roll Call Inc. via Getty Images\nThe Arizona Democratic Party voted to censure Sen. Kyrsten Sinema, one of its own, on Saturday.",
    "\"I've never, ever in my time organizing in the Arizona Democratic Party seen such a large amont of Democrats upset,\" Slugocki told Insider.",
    "Arizona Democratic Party officials were enraged when she voted along with Republicans on Wednesday to keep the Senate filibuster intact.",
    "The vote took place during an executive board meeting on Saturday, according to Michael Slugocki, vice chair of the Arizona Democrats.",
    "Sinema held firm in her refusal to vote to change Senate rules, arguing that it would increase partisanship in the chamber.",
    "They had also warned of a possible vote of no confidence should Sinema choose to uphold the filibuster.",
    "Sinema enraged local and national Democrats for voting to uphold the Senate filibuster on Wednesday.",
    "The vote is the latest sign of growing tension between Sinema and her home state's party apparatus.",
    "Subscribe to push notifications\n Deal icon An icon in the shape of a lightning bolt.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "For you\n Close icon Two crossed lines that form an 'X'.",
    "Stay up to date with what you want to know.",
    "\"It's never been at these levels, ever.\"",
    "Sign up for notifications from Insider!",
    "Senator Kyrsten Sinema of Arizona.",
    "Loading Something is loading.",
    "The vote was unanimous."
  ]
}