{
  "id": 1578,
  "mediaId": 881,
  "date": "1/21/2022 12:00:00 AM",
  "headline": "People Need to Know She Sucks': Kyrsten Sinema's Volunteers, Ex-Staff Are Fed Up",
  "image": "https://video-images.vice.com/articles/61eabc4960250b009a8c4935/lede/1642773917275-gettyimages-1236185467.jpeg?crop=1xw:0.8421xh;0xw,0.0301xh&resize=1800:*",
  "link": "https://www.vice.com/en_us/article/z3nzay/kyrsten-sinema-volunteers-staffers-feel-betrayed",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2505,
    2505,
    1896,
    1896,
    1551,
    1551,
    1138,
    1138,
    571,
    571,
    33,
    33,
    146,
    146,
    428,
    428,
    2550,
    2550,
    2874,
    2874
  ],
  "sentences": [
    "Her favorable rating was at 70 percent with Arizona Democrats as recently as the 2020 elections, but it took a nosedive when she voted against raising the federal minimum wage early last year and plunged again when she skipped the Senate vote to create a bipartisan commission to investigate the Jan. 6 Capitol riot (she said she missed it because of a personal family matter?).",
    "I feel betrayed.?\nSinema's Wednesday vote against changing the filibuster, which kept the 60-vote margin for most major bills and effectively killed Democrats' efforts to pass voting rights legislation, is the latest in a long line of votes that have enraged and upset some of the people who worked hard to put her in office.",
    "She's long been a moderate Democrat, joining the Blue Dog Coalition as soon as she won her House seat a decade ago, and this isn't the first time she's broken with leadership and backed the GOP on key bills, including some changes to Obamacare and keeping the individual tax cuts passed under President Trump.",
    "Indivisible, the national grassroots Democratic organization, says its volunteers sent a half-million text messages, made a quarter-million calls, and knocked on at least 5,000 doors for Sinemaand that's not counting their volunteers' work directly for Sinema's campaign and the state Democratic Party.",
    "We believe the decision by Sen. Sinema is not only a blow to voting rights and our electoral system but also to the work of all of the partners who supported her victory and her constituents who tried to communicate the importance of this bill,? EMILY's List said in a statement.",
    "I'm crushed that she won't support doing away with the filibuster, and especially that she won't explain any of her decisions,? Denis told VICE News on Thursday, saying Sinema's vote on this and other issues has been a slap in the face? to those who helped elect her.",
    "Others said her decision to give a speech defending the filibuster right before President Biden was set to arrive at the Senate to try to convince Democrats to back him on the carve-out for the voting rights legislation infuriated them.",
    "Dunn, a leader in the local chapter of the Indivisible progressive activist group in Prescott, Arizona, was introduced to Sinema at a campaign event and was blown away by the Senate candidate's poise and her impressive life story.",
    "She's delivered for Arizonans and has always been honest about where she stands, and has said that different people of good faith can have honest disagreements about policy and strategy, and that honest disagreements are normal.\"",
    "\"During three terms in the U.S. House, and now in the Senate, Kyrsten has always promised Arizonans she would be an independent voice for the statenot for either political party,? Sinema spokeswoman Hannah Hurley told VICE News.",
    "She failed to do it.?\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "Only 8 percent of Arizona's registered Democrats held a favorable opinion of Sinema as of Jan. 14, according to a tracking poll from the Democratic firm Civiqsand that was before she voted to uphold the filibuster this week.",
    "It's not just a handful of local progressive activists who are fed up with Sinema, who with their help won a close race in 2018 and became the first Democratic senator elected in the state in more than three decades.",
    "I can only call her a turncoat.?\nThe people who supported her and who did work for her campaign put in a lot of hours in canvassing and getting signatures for her are bitterly disappointed,? she continued.",
    "It was such an obvious tweak on Biden, a needless show of power in the way where she was obviously trying to humiliate the president,? said Chris Vaaler, who heads Indivisible's Scottsdale chapter.",
    "Dunn said for her, it was the last straw.?\nVICE News talked to more than a dozen Arizona Democratic activists and former staffers who actively worked to elect Sinema during her 2018 race.",
    "Dunn first met Sinema at an event hosted at the home of her friend Toni Denis, who chaired the Yavapai County Democratic Party and now heads the Arizona Federation of Democratic Women.",
    "Many expressed their frustration not just with her voting record but also with her inaccessibility, her seeming delight at infuriating her party's base, and her unwillingness to meet.",
    "Denis donated more than $3,000 to Sinema in 2018 and says she spent roughly 30 hours a week for months working to elect Sinema and the rest of the Democratic ticket that election.",
    "They said they went to work for Sinema over two other candidates, and looking back on it, wish they'd taken a different job even though those two other candidates lost that cycle.",
    "They're glad Sinema's 2018 defeat of Republican Sen. Martha McSally helped give Democrats Senate control, but they told VICE News they've been disappointed with her as a senator.",
    "Personally and professionally I just feel betrayed, like I've been stabbed.?\nShe campaigned that way in 2018, too, running immigration ads that frustrated some local activists.",
    "EMILY's List, which backs Democratic women who support abortion rights, spent $1.7 million on her last race and helped funnel much more to her with their fundraising network.",
    "But at the end of the day, the win didn't feel good,? said the former campaign staffer who asked to remain nameless because they could get in trouble at their current job.",
    "Her hesitation about parts of the Build Back Better plan, the vehicle Biden and Democrats are using to try to pass their top legislative priorities, hasn't helped either.",
    "But that was when it went over the edge.?\nSinema's staff point out that she's been consistent on her support for the filibuster and has long had a centrist voting record.",
    "I certainly don't think she deserves to be reelected,? said the former staffer, who asked to remain anonymous because of their current job in Democratic politics.",
    "The Primary Sinema Project, a group that launched last summer, has raised $330,000including $100,000 in just the last week since her filibuster speech.",
    "There is a running joke that Sinema staffers text each other: That line on the resume gets worse and worse by the day,'? said a former staffer.",
    "But that positioning undoubtedly helped her: She won by two percentage points, even as the much more liberal candidate for governor lost by 14.",
    "David Lucier said he's known Sinema for a decade, going back to their work together on a bill to provide in-state tuition to military veterans.",
    "When Indivisible asked its Arizona members this week if they'd support a primary against Sinema, 94 percent of those who responded said yes.",
    "There is a running joke that Sinema staffers text each other: That line on the resume gets worse and worse by the day,'? said that staffer.",
    "But he grew increasingly frustrated with her stances, and was one of five veterans who resigned in protest from the council in October.",
    "But they publicly warned Sinema this week that if she didn't change her position on the filibuster, they wouldn't support her anymore.",
    "It'd been a slow process, a gradual process of just becoming more and more nervous, a feeling of unease that was steadily increasing.",
    "They were among the groups pushing hardest for Sinema to change her filibuster position, and their local leaders are furious.",
    "And to be fair, most other Senate Democrats agreed with Sinema that the filibuster shouldn't be changed just a few years ago.",
    "One former Sinema staffer said she could be really rough on people? and likes to have somebody she's pissed off at? on staff.",
    "Multiple former supporters also say it's not just Sinema's votes that have pissed them offit's how she's conducted herself.",
    "Dunn volunteered, by her estimation, for more than 100 hours to elect Sinema and other Democrats that election cycle.",
    "Many pointed to her enthusiastic, meme-ready thumbs-down when she voted against raising the minimum wage last May.",
    "Sen. Kyrsten Sinema, D-Ariz., arrives for a senate vote in the U.S. Capitol on Thursday, October 28, 2021.",
    "People need to know she sucks.?\nSinema will almost certainly face a primary in 2024 if she runs again.",
    "He volunteered on Sinema's race in 2018, then was invited to serve on her veterans' advisory council.",
    "People need to know she sucks.?\nSome of Sinema's biggest national backers are done with her too.",
    "Rep. Ruben Gallego has been publicly making noises about a bid, and slammed her Wednesday vote.",
    "I'm extremely disappointed in her.?\nAnother former staffer was even harsher in their criticism.",
    "Here in Arizona and especially our area, you have to be realistic over who you could elect.",
    "She had all the way up until last night to do something, revise her position or compromise.",
    "I feel betrayed.?\nWhen Maria-Elena Dunn first met Kyrsten Sinema, she said she was elated.",
    "We knew she was a Democrat who had centrist tendencies, and that wasn't a bad thing.",
    "That wasn't enough for them to stop supporting herbut her Senate votes have been.",
    "All said that they'd likely vote against her in a primary if she runs in 2024.",
    "Personally and professionally I just feel betrayed, like I've been stabbed.",
    "I had literature, I did canvassing for her, I contributed, I campaigned.",
    "(Photo By Tom Williams / CQ-Roll Call, Inc via Getty Images)\nI'm livid.",
    "So did NARAL Pro-Choice America, a major abortion rights group.",
    "I can only call her a turncoat,? one former volunteer said.",
    "We did everything we possibly could to get her elected.",
    "But she's never been in the spotlight like this before.",
    "She seemed like the real thing,? she told VICE News.",
    "Her group hosted Sinema multiple times for events.",
    "I cannot wait to donate to her primary challenger.",
    "I still feel badly about it,? he said Thursday.",
    "There is absolutely no trust at this point.",
    "I can only call her a turncoat,? Dunn said.",
    "Some former staffers are frustrated too.",
    "It's a horrible, horrible feeling.",
    "We were very excited about her.",
    "She's done with Sinema too.",
    "I really wanted to win.",
    "I was very impressed.",
    "We were thrilled.",
    "I was outraged.",
    "I'm livid.",
    "I'm livid.",
    "But now?"
  ]
}