{
  "id": 1619,
  "mediaId": 1390,
  "date": "1/13/2022 12:00:00 AM",
  "headline": "Competing bills by Sens. Hawley and Ossoff banning lawmaker stock trading introduced",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/23442955-871a-415c-ae89-2150bb096e92/c99d3c57-51a6-4be6-b46a-0ca725d78e34/1280x720/match/image.jpg?pubId=854081161001",
  "link": "https://www.foxbusiness.com/politics/hawley-ossoff-bills-ban-lawmaker-stock-trading",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Brown",
  "authorUrl": "https://www.foxbusiness.com/person/b/jon-brown",
  "termIds": [
    886,
    1335,
    1448,
    1737,
    1896,
    2230,
    545,
    562,
    571,
    2959
  ],
  "sentences": [
    "(Tom Williams-Pool/Getty Images / Getty Images)\nRegarding claims that Ossoff's bill is stronger because it applies to dependent children and also requires offending members of Congress to surrender their congressional salary, Hawley pointed out that his bill would mandate that they disgorge their investments to the U.S. Treasury.",
    "(Jessica McGowan/Getty Images / Getty Images)\nThe proposed legislation comes as House Speaker Nancy Pelosi, D-Calif., has faced criticism from both sides of the aisle for saying members of Congress and their spouses should be allowed to trade stock as part of a \"free market economy.\"",
    "Hawley's office pinpointed a section in Ossoff's bill that says, \"An investment that achieves compliance with applicable environmental, social and governance criteria shall not be considered to be a covered investment solely by reason of that compliance.\"",
    "Ossoff's bill is also being supported by Sen. Mark Kelly, D-Ariz., who said he hopes it \"will put an end to corrupt insider trading and ensure that leaders in Congress focus on delivering results for their constituents, not their stock portfolios.\"",
    "But under the STOCK Act, which was passed in 2012, members of Congress and their families are forbidden to profit from inside information, and lawmakers are also required to report stock trades to Congress within 45 days.",
    "A source in Ossoff's office pushed back, telling FOX Business that their version \"goes above and beyond to specifically say that these funds follow the same rules as other investments\" outlined in the bill.",
    "\"Members of Congress should not be playing the stock market while we make federal policy and have extraordinary access to confidential information,\" Ossoff said in a Wednesday press release.",
    "Hawley's version is titled, ''Banning Insider Trading in Congress Act'' and Ossoff's is called the \"Ban Congressional Stock Trading Act.\"",
    "Two separate bills that would ban stock trading by members of Congress and their spouses were introduced in the Senate on Wednesday.",
    "Given Pelosi's stance on the issue, Hawley applauded Ossoff for introducing such a bill during an interview with FOX Business.",
    "He said his primary concern with the competing legislation is what he considers a carveout for progressive-based investments.",
    "There was an attempt for a bipartisan measure, but Hawley's talks with Ossoff's office fizzled, as first reported by Axios.",
    "It would also give relevant congressional ethics committees additional power to levy additional fines and penalties.",
    "Lawmakers' spouses are currently allowed to trade in companies or industries that their partner may help regulate.",
    "Sen. Josh Hawley, R-Mo., and Sen. Jon Ossoff, D-Ga., introduced different versions of similar legislation.",
    "\"So it's pretty tough, but I think making the taxpayers the winner is a strong way to go here,\" he added.",
    "Up to 76% of the public supports such a ban, according to recent polling reported by Business Insider.",
    "The move to ban Congress from trading stock has been met with bipartisan support in both chambers.",
    "\"This is not a carveout, but a clarification to ensure no special treatment,\" the source added.",
    "(Stefani Reynolds/Bloomberg via Getty Images / Getty Images)\nThe bills differ in a few ways.",
    "Make them give them up and give them to the taxpayers and punish them in that way.\"",
    "Similar legislation has been introduced in the House of Representatives.",
    "Ossoff had been seeking a GOP cosponsor for his bill.",
    "\"Don't let them keep the profits,\" said Hawley.",
    "\"Make them disgorge those profits."
  ]
}