{
  "id": 1682,
  "mediaId": 32,
  "date": "1/4/2022 12:00:00 AM",
  "headline": "CDC shortens waiting period for Pfizer Covid boosters to 5 months",
  "image": "https://image.cnbcfm.com/api/v1/image/106972776-1636472271345-gettyimages-1235695960-pfizer_booster350_100421.jpeg?v=1636473681&w=740&h=416",
  "link": "https://www.cnbc.com/2022/01/04/cdc-shortens-waiting-period-for-pfizer-covid-boosters-to-5-months.html",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Spencer Kimball",
  "authorUrl": "",
  "termIds": [
    1304,
    1896,
    91,
    196,
    275,
    276,
    395,
    2945
  ],
  "sentences": [
    "CNBC Health & Science\nRead CNBC's latest global coverage of the Covid pandemic:\nCDC shortens waiting period for Pfizer Covid boosters to 5 months\nFDA expands Pfizer booster eligibility to kids ages 12 to 15\nU.S. considers recommending negative Covid test before people end isolation period, Fauci says\nBiden says Covid surge needs to be solved at state level, vows full federal support\nFauci says U.S. should consider vaccine mandate for domestic air travel\nThe CDC's new recommendations come a day after the Food and Drug Administration authorized Pfizer boosters at 5 months and third shots for kids 5 to 11 with compromised immune systems.",
    "Today's recommendations ensure people are able to get a boost of protection in the face of Omicron and increasing cases across the country, and ensure that the most vulnerable children can get an additional dose to optimize protection against COVID-19,? CDC Director Rochelle Walensky said in a statement, strongly urging people to get a third dose or booster if eligible.",
    "(Photo By Tom Williams/CQ-Roll Call, Inc via Getty Images)\nTom Williams | CQ-Roll Call, Inc. | Getty Images\nPeople who received the Pfizer and BioNTech Covid vaccine can now get a booster shot five months after their second dose, a month sooner than the federal government's previous guidance.",
    "The shortened waiting period for Pfizer boosters reflects the greater urgency federal health authorities in the U.S. have placed on getting third shots in people's arms as the highly contagious omicron variant spreads at an unprecedented pace throughout the country.",
    "People who received the Moderna vaccine must still wait at least six months after their second dose before getting a booster, while people who received the Johnson & Johnson vaccine must wait at least two months after their first shot before getting a booster.",
    "The CDC also now recommends that children ages 5 to 11 who have moderate or severely compromised immune systems receive a third shot as part of their primary vaccination series 28 days after their second dose.",
    "UNITED STATES - OCTOBER 4: Hattie Pierce, 75, receives a Pfizer covid-19 vaccine booster shot from Dr. Tiffany Taliaferro at the Safeway on Capitol Hill in Washington, D.C., on Monday, October 4, 2021.",
    "The U.S. Centers for Disease Control and Prevention on Tuesday updated its recommended waiting period for people who completed their primary Covid-19 vaccination series with Pfizer's shots.",
    "However, the shots are only about 10% effective at preventing symptomatic infection from omicron 20 weeks after the second dose, according to the U.K. Health Security Agency study.",
    "Real-world data from the United Kingdom and lab data from Pfizer have demonstrated that booster doses significantly increase protection against infection from omicron.",
    "The CDC's vaccine advisory committee has also scheduled a meeting Wednesday to review the FDA's recommendation to distribute boosters to all adolescents aged 12 to 15.",
    "More than 56 million people in the U.S. have been infected since the start of the pandemic, and more than 827,000 people in the U.S. have died from the virus.",
    "A study published by the U.K. Health Security Agency last week found that boosters are up to 75% effective at preventing symptomatic infection.",
    "The U.S. reported a more than 1 million new cases on Monday alone, according to data compiled by Johns Hopkins University.",
    "Currently, Pfizer is the only recommended and authorized vaccine for kids in that age group.",
    "Covid infections are increasing at a pace unseen at any previous point in the pandemic.",
    "The original two-dose series still provides good protection against severe illness."
  ]
}