{
  "id": 1754,
  "mediaId": 195,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "The Hill's 12:30 Report  Dems, GOP process potential abortion rights' rollback",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/WarrenElizabeth_050322_AP-JoseLuisMagana.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/1230-report/3477071-the-hills-1230-report-dems-gop-process-potential-abortion-rights-rollback/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cate Martel",
  "authorUrl": "https://thehill.com/author/cate-martel/",
  "termIds": [
    781,
    1341,
    1801,
    1879,
    1896,
    146,
    428,
    511
  ],
  "sentences": [
    "is visibly rattled: Here is video of her responding to the draft opinion, via journalist Willy Lowry: https://bit.ly/3KQf5ig\nPhotos of protesters outside the Alabama State House: From CNN's Betsy Klein: https://bit.ly/3w49orp\n? IF ROE IS STRUCK DOWN, HERE ARE FIVE CONSEQUENCES:\n1. Abortion is likely to be banned in about half the country.?\n2. Poorer women will feel the sharpest effects.?\n3. Democrats will try, but likely fail, to codify Roe in federal law.?\n4. The Supreme Court's standing will take a hit.?\n5. Abortion will be a big issue in the midterms.?\nExplanations for each, via The Hill's Niall Stanage: https://bit.ly/3saREJW\n? REPUBLICANS ARE SO ANGRY ABOUT THE LEAK THAT THEY ARE PRETTY QUIET ABOUT THEIR WIN:\nNew York Magazine's Ed Kilgore writes: It's safe to say that most left-of-center Americans who follow political news are pretty freaked out by the leaked draft opinion  But the reaction of conservative opinion leaders and of most Republican politicians  nearly all of whom have, in theory, been anticipating this day like a child looks forward to Christmas morning  has been weirdly evasive.? https://nym.ag/3KHDUwD\nThe full read on how the GOP has responded to the news  it's pretty interesting: https://nym.ag/3KHDUwD\n? IF YOU'RE INTERESTED IN READING THE DRAFT OPINION, BUT WANT SOME CONTEXT AND HIGHLIGHTS:\nThe Washington Post's Aaron Blake published an annotated version: https://wapo.st/3OWPBTC\nCue my digital, muffled, robotic-sounding voice.",
    "Sign up here to receive The Hill's 12:30 Report in your inbox daily: https://bit.ly/3qmIoS9\n? A FEW MORE PERSPECTIVES ON THE LEAKED DRAFT OPINION:\nDemocrats hope leaked court doc serves as wake up call' for women's movement': Via The Hill's Morgan Chalfant and Amie Parnes\nThe Supreme Court draft leak set off shock, jubilation and outrage on both sides of the abortion debate.': Via The New York Times's Kate Zernike, Elizabeth Dias and Ruth Graham\nWith Roe at risk, GOP faces pressure to support families after birth': Via The Washington Post's Jeff Stein\nLeaked draft abortion opinion throws bombshell into midterms': Via The Hill's Julia Manchesterand Hanna Trudo\nIn the White House\nU-S-A, U-S-A, U-S-A!",
    "g Latest with COVID\n? BY THE NUMBERS\nCases to date: 81,307,595\nDeath toll: 991,439\nCurrent hospitalizations: 11,411\nShots administered: 576 million\nFully vaccinated: 66.2 percent of Americans\ng?Notable tweets\nNothing tops the adrenaline rush of sprinting through a closing door  and making it:\nRoll Call's Tom Williams tweeted a series of photos of Sen. Lisa Murkowski (R-Alaska) barely making the Senate subway before the doors shut.",
    "Vance was projected to win Ohio's GOP Senate primary Tuesday, scoring the nomination after a brutal race and handing former President Trump a key victory after a late endorsement.? https://bit.ly/3yaat3x\nIf you haven't been following the race but are familiar with the name: Vance is the author of Hillbilly Elegy.?\nWas this a surprise?",
    "The NYT says in its Q1 earnings report that Wordle brought an unprecedented tens of millions of new users to The Times, many of whom stayed to play other games which drove our best quarter ever for net subscriber additions to Games' ? https://bit.ly/3MP6KMV\n?On tap\nThe gist: The Senate is in.",
    "https://bit.ly/3kC4LQ2\nWhere Senate Majority Leader Charles Schumer (D-N.Y.) stands: Schumer accused Republicans of now trying to duck responsibility for a decision that has enraged liberals and could turn off suburban women voters, a key electoral block, ahead of the 2022 midterm election.",
    ": The Hill's Alex Gangitano tweeted a photo of the buses of Olympians arriving at the White House complex: https://bit.ly/3MTbkcX\nIn Washington, D.C.\nDC foxes are causing so much trouble these days:\nThe Smithsonian National Zoo said a wild fox broke into the zoo and killed 25 flamingos.",
    "To view past editions of The Hill's 12:30 Report, click here: https://bit.ly/30ARS1U\nTo receive The Hill's 12:30 Report in your inbox, please sign up here: https://bit.ly/3qmIoS9\n> A midday take on what's happening in politics and how to have a sense of humor about it.",
    "And to leave you with an afternoon adventure, here's a puppy planning its escape: https://bit.ly/3LJ7ROh\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "7:15 p.m. EDT: First lady Jill Biden speaks at the Kuwait-America Foundation Gala Dinner in Washington, D.C.\ngWhat to watch\n11:30 a.m. EDT: President Biden and first lady Jill Biden welcomed Team USA to the White House.",
    "TALK OF THE MORNING\nDemocrats are FUMING:\nDemocrats are seething as the Supreme Court appears poised to overturn federal abortion rights that have been in place for nearly 50 years.",
    "Photos: https://bit.ly/3LLI1ZM\n^ From a reporter who watched it unfold: The Washington Post's Paul Kane tweeted, As an [eyewitness], this [Murkowski] move was so agile.",
    "From the zoo: In the early morning of May 2, Bird House staff arrived to discover the deceased flamingos and sighted a fox in the Zoo's outdoor flamingo yards.",
    "The fox escaped the yard.?\nRead the zoo's full statement: https://s.si.edu/3KGFkr1\n\nOn the campaign trail\nTrump's adVance:\nVia The Hill's Tal Axelrod, J.D.",
    "He predicted that Republicans would suffer a backlash from voters this fall.?\n? TIDBITS AFTER THE REPORT:\nSen. Elizabeth Warren (D-Mass.)",
    "A 10/10 for execution and daring.? https://bit.ly/3kJKnfK\nTidbit about Wordle:\nCNN's Brian Stelter tweeted, Just how popular is Wordle?",
    "Livestream: https://bit.ly/3ydP2yH\n2:30 p.m. EDT: Homeland Security Secretary Alejandro Mayorkas testifies on U.S. border security.",
    "Livestream: https://bit.ly/3w3N6Gj\n2 p.m. EDT: President Biden delivers remarks on economic growth, jobs and deficit reduction.",
    "The Senate's full agenda today: https://bit.ly/3s9Zl2M\n10:15 a.m. EDT: President Biden received the President's Daily Brief.",
    ":\nThe Bidens are hosting Team USA at the White House today to celebrate the 2020 Tokyo and 2022 Beijing Olympic Game.",
    "Livestream: https://bit.ly/3yhCYwi\n2:30 p.m. EDT: White House press secretary Jen Psaki holds a press briefing.",
    ": Well, Vance had struggled to break out in the crowded primary until Trump endorsed him a few weeks ago.",
    "Moving onto the finals: Vance will face Rep. Tim Ryan (D-Ohio) in the general election to replace Sen.",
    "Look who is out and about again: Vice President Harris, who recently had COVID-19, will be attending.",
    "She went sideways to slide into a subway car with an auto-closing door that left no room for error.",
    "President Biden and Vice President Harris are in Washington, D.C.\n10 a.m. EDT: The Senate met.",
    "It's Wednesday and I'm Cate Martel with a quick recap of the morning and what's coming up.",
    "https://bit.ly/3saTWZE\nFor context: The zoo had 74 flamingos before the incident.",
    "Livestream: https://bit.ly/39uY145\ngIn lighter news\nToday is National Hoagie Day.",
    "Vice President Harris and second gentleman Doug Emhoff also attended.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "We are giving The Hill's 12:30 Report a little facelift.",
    "Email cmartel@thehill.com to tell us your thoughts!",
    "Livestream: https://bit.ly/3w3N6Gj\nSo many buses!",
    "Watch the event: It began around 11:30 a.m. EDT.",
    "25 were killed and three were injured.",
    "We are always looking for feedback.",
    "Habreaks down crying hysterically.",
    "Did someone forward this to you?",
    "https://bit.ly/3w5sAoQ\nOh, hey.",
    "Have a suggestion for us?",
    "May the 4th be with you!",
    "Rob Portman (R-Ohio).",
    "Notice our new look?",
    "Want your own copy?",
    "The House is out.",
    "Like it?",
    "Sniff.",
    "*\n*Ha.",
    "Hahah.",
    "Sniff.",
    "Haha.",
    "Haha."
  ]
}