{
  "id": 1947,
  "mediaId": 195,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "The Hill's Morning Report  Dr. Oz aims to win over skeptical' voters",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/MR_ozmehmet_040222_ap-matt-rourke.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/morning-report/3462009-the-hills-morning-report-will-dr-ozs-metamorphosis-be-enough-to-win/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    704,
    1147,
    1189,
    1248,
    1646,
    1653,
    1896,
    1988,
    2087,
    2095,
    2491,
    183,
    296,
    428,
    601,
    2672,
    2845,
    2862,
    2945
  ],
  "sentences": [
    "Hatch, who retired from the Senate in 2018 after 42 years in office, sponsored or cosponsored more than 750 bills and chaired three powerful committees during his tenure (the Judiciary, Finance, and the Health, Education, Labor and Pensions committees)\nIn a statement on Sunday, Biden, who served alongside Hatch in the Senate for more than three decades, hailed the Utah Republican as an American original? and his work on a number of subjects, including the Americans with Disabilities Act and the Children's Health Insurance Program.",
    "The Hill Events\nJoin Tuesday's, Accelerated Approvals & Pathways to Treatment,? at 1 p.m. with Rep. Brian Higgins (D-N.Y.), co-sponsor of the Comprehensive Care for Alzheimer's Act, and Mark McClellan, a physician, academic and former commissioner of both the Food and Drug Administration and the Centers for Medicare and Medicaid Services, plus other experts in conversation about expedited drug approvals for major diseases.",
    "Our job while we are here in the majority is to deliver on behalf of those families, and that means making government work for them,? Warren told CNN's State of the Union.?\nAs The Hill's Hanna Trudo writes, Warren and Sen. Bernie Sanders (I-Vt.) are once again attracting some presidential speculation from progressive circles, especially if President Biden decides against seeking a second term.",
    "The New York Times reported early this morning that the first group of more than 50 Ukrainian artillery soldiers on Sunday completed Pentagon-furnished training on 155-millimeter howitzers provided by the United States, which differ in design compared with the Soviet-era 152-millimeter guns that have been used by Ukrainian forces since the country gained independence.",
    "LEADING THE DAY\n? UKRAINE CRISIS\nSecretary of State Antony Blinken and Defense Secretary Lloyd Austin met for three hours in Kyiv on Sunday night with Ukrainian President Volodymyr Zelensky in the highest-level and semi-clandestine visit to the war-torn nation by an American delegation since the start of Russia's invasion (The Associated Press).",
    "In Shanghai, which has imposed some of the strictest COVID-19 restrictions possible in recent weeks and months, metal fences were erected to block off small streets and entrances to apartment complexes as part of the nation's zero-COVID? approach amid rising complaints from many of the city's 25 million citizens (The Associated Press).",
    "We want to see Russia weakened to the degree it cannot do the kind things that it has done in invading Ukraine,? Austin said, noting that the United States on Tuesday will be in Germany for a meeting of allies to discuss what more is needed to deter Russia's aggression in Ukraine and ambitions elsewhere in Eastern Europe.",
    "Russian forces on Sunday attempted to storm the Ukrainian-held Azovstal steel plant, according to Ukrainian officials, despite Russian President Vladimir Putin's comments last week that the complex would not be seized but instead would be cut off until Ukrainian forces surrender (Reuters).",
    "I want you coming in here skeptical.?\nAnd plenty of Pennsylvania GOP voters are at least dubious as they attempt to choose from Oz, his rival David McCormick or someone else in the battle for the party's nod in November, which is being waged across television screens in the Keystone State.",
    "During our interview, he was animated about Jay Wright's surpriseretirement from Villanova University's men's basketball program, said he was watching the Philadelphia 76ers playoff series and reminisced about his experience watching Super Bowl LII alongside Sixers star Joel Embiid.",
    "ET each day to gain insights from Energy Secretary Jennifer Granholm, actress and activist Sigourney Weaver, White House Council on Environmental Quality Chairwoman Brenda Mallory, author Joshua Fields Millburn, Rep. John Curtis (R-Utah), Misfits Market CEO Abhi Ramesh, and more.",
    "Here's what else we're watching this week:\n On Monday, a New York City judge will consider whether to hold Trump in contempt for failing to comply with a subpoena issued by the New York attorney general tied to a civil investigation into his business practices (The Hill).",
    "Less than four weeks away from primary day, the questions and comments by potential GOP primary voters about Oz's past stances  including comments on abortion, gun control and transgender issues  are streaming in from Pennsylvania GOP primary voters.",
    "Speaking to supporters in front of the Eiffel Tower in Paris, the president thanked French voters for trusting him after five years of hard times.? Macron acknowledged many voted for him only to block the far right and vowed to govern for all (BBC).",
    " On Thursday, members of the House Judiciary Committee will grill Homeland Security Secretary Alejandro Mayorkas about border security and the administration's preparations next month to lift immigration restrictions known as Title 42 (The Hill).",
    "The additional funding was expected to pass before the break but was held up over the GOP's demand for Democrats to put a vote on the floor concerning the future of Title 42, the Trump-era policy that blocks migrants from seeking asylum (CNN).",
    "? SUPREME COURT\nJustices today will hear arguments in a case involving a high school football coach who was reprimanded over his practice of holding a brief prayer on the field's 50-yard line following games at his Seattle-area public school.",
    "capped a big week in the news with multiple Sunday show appearances, saying that Democrats are going to lose? in the November midterm elections if more isn't delivered in the coming months by the Democratic-controlled Congress (The Hill).",
    "Only six years ago, Trump, who had a lengthy track record of donating to Democratic politicians, holding pro-choice and other liberal views, became the first GOP presidential candidate to win the Keystone State in nearly three decades.",
    "The situation is also worsening in Beijing, which recorded 22 new cases on Sunday  its highest single-day total this year as authorities try to crackdown on the outbreak among school students and a tour group (The Wall Street Journal).",
    "At Thursday's event with former Housing and Urban Development Secretary Ben Carson, Oz made a point to bring up when Sen. Ted Cruz's (R-Texas) campaign spread a rumor on the day of the 2016 Iowa caucuses that Carson was dropping out.",
    "As of today, 76.7 percent of the U.S. population has received at least one dose of a COVID-19 vaccine and 65.4 percent is fully vaccinated,? according to the Bloomberg News global vaccine tracker and the government's definition.",
    "Oz has put himself in a solid position heading into the stretch run, having seen his campaign buoyed by the support of former President Trump, which has put him on even terms or ahead of McCormick, depending on who you believe.",
    "Blinken told Zelensky that Congress was notified on Sunday about a sale of up to $165 million for ordnance used by Soviet-designed weapons, such as rockets, assault rifles and machine guns still used by the Ukrainian army.",
    "IN FOCUS/SHARP TAKES\n? CONGRESS\nLawmakers return to Washington this week after a two-week recess facing questions over the future of $10 billion being sought by the administration in funds to combat the COVID-19 pandemic.",
    "At a town hall event before an attentive crowd of 400 in Bucks County on Thursday, Oz, faced with a steady dose of questions of that variety, told them something you don't usually hear at political events of this kind.",
    "The Cabinet officials told Zelensky and other Ukrainian officials that the United States is expanding military training for Ukrainian forces on the ground with certain U.S.-supplied weapons that will be arriving soon.",
    "On Friday, he'll hold a rally in Greenwood, Neb., with GOP gubernatorial candidate Charles Herbster, who denies allegations of inappropriate touching leveled by seven women, including a Republican state senator (CNN).",
    "Putin, who has shown no interest in abandoning his ambition to liberate? Ukraine by bringing territory under Russian control, agreed to meet Tuesday with the United Nations Secretary-General Antnio Guterres in Moscow.",
    "The secretary will testify before the Senate Foreign Relations Committee (Tuesday), the Senate Appropriations Subcommittee on State and Foreign Operations (Wednesday) and House Foreign Affairs Committees (Thursday).",
    "Ambassador to Slovakia, will be nominated by Biden to be the next U.S. ambassador to Ukraine and that U.S. diplomats will be returning this week to Kyiv from their temporary quarters in Poland (The New York Times).",
    "Blinken plans a rapid return to Washington to practice a different sort of diplomacy  answering questions posed by U.S. lawmakers about Ukraine and Russia, international policy and his department's budgetary needs.",
    "Before the meeting with Blinken and Austin, Zelensky said he was expecting specific things and specific weapons? from world leaders who come to the country, after announcing he would meet Biden's emissaries (CNN).",
    "I look forward to our continued close cooperation  including on supporting Ukraine, defending democracy, and countering climate change.?\n Associated Press / Lewis Joly | French President Emmanuel Macron on Sunday.",
    "It's the first time the French have reelected a president in two decades, and analysts said Macron's promise of relative stability prevailed over Le Pen's campaign for a rightward reset (The New York Times).",
    "ET, Pennsylvania GOP candidates competing in the May 17 Senate primary face off during a live debate in Harrisburg, Pa., broadcast by Nexstar Media, which owns The Hill (where to watch/listen info HERE).",
    "Ukraine seeks more powerful weapons from the West to use against Russia in the Donbas region, where Moscow's forces want to dislodge the last Ukrainian troops in the battered southern port of Mariupol.",
    "? AVIAN FLU\nThis year, dozens of U.S. bald eagles have died from infection with avian flu, which is spreading across the country, killing poultry as well as spectacular wild birds, including waterfowl.",
    "Zelensky adviser Igor Zhovkva said Sunday on NBC's Meet the Press? that Guterres's efforts would be better focused on the U.N.'s humanitarian support to Ukraine, which he said has lagged (The Hill).",
    "The U.S., responding with a new urgency sparked by Russia's amended war goals in the east and threats to seize territory beyond Ukraine, will ask Congress for additional funding beginning this week.",
    "Among those who are expected to be greenlighted by senators are Lael Brainard's to become vice chairman and Lisa DeNell Cook's nomination to be a member of the Federal Reserve's board of governors.",
    "The Hill: Warren on tapes featuring House Minority Leader Kevin McCarthy (R-Calif.): Kevin McCarthy is a liar and a traitor.?\nNiall Stanage: The Memo: McCarthy furor underlines Trump's grip on GOP.",
    "? UNIONS\nToday, workers at an Amazon sorting facility in Staten Island, N.Y., will begin voting in the second union election being held at one of the e-commerce giant's locations in the borough.",
    "The White House daily press briefing is scheduled at 3 p.m.\ng Hill.TV's Rising? program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    " The bird flu has also forced free-range hens indoors after the Department of Agriculture recommended the birds be moved inside as a precaution against contagion (The Associated Press).",
    "? CORONAVIRUS\nWhite House COVID-19 response coordinator Ashish Jha on Sunday said the U.S. should not be overreacting? to the rising number of coronavirus cases due to the BA.2 variant.",
    "The U.S. has committed roughly $3.7 billion in security assistance and has provided more than $4.3 billion since the start of the Russian invasion, according to the government's tally.",
    "ELSEWHERE\n? INTERNATIONAL\nFrench President Emmanuel Macron, 44, won reelection on Sunday against nationalist challenger Marine Le Pen, who conceded the race shortly after polls closed.",
    "There cannot be a nuclear war.?\n The Washington Post: At the outset of Russia's invasion of Ukraine, a network of Belarusian railway saboteurs helped thwart Moscow's attack on Kyiv.",
    "However, Democratic leaders were hesitant to make that move given that a number of senators at the time had criticized the administration's decision to end the program in late May.",
    "That problem has only grown in the meantime as vulnerable Senate incumbents, traditional administration allies and even key committee chairman have raised issues with the decision.",
    "In an interview with the Morning Report, Oz said the push for the endorsement came over the course of three meetings with Trump following his leap into the contest in December.",
    "CNN: The Utah Democratic Party on Saturday threw its support behind the independent candidacy of former presidential contender Evan McMullin to take on Sen. Mike Lee (R-Utah).",
    "Senate Homeland Security and Governmental Affairs Committee Chairman Gary Peters (D-Mich.) noted that he will come before his panel as part of the department's budget request.",
    "The number of daily COVID-19 cases in the U.S. has been on the rise, hitting roughly 66,000 infections on Friday, according to the Centers for Disease Control and Prevention.",
    "He receives the President's Daily Brief at 11:30 a.m. Biden will welcome the Tampa Bay Lightning to the South Lawn to celebrate their 2020 and 2021 Stanley Cup championships.",
    " The court this week will also consider a case centered around the Trump-era Remain in Mexico? policy that was implemented to deter asylum-seekers from Central America.",
    "https://bloom.bg/3k8g3eB\nHow to avert a 2024 election disaster in 2023, by David B. Rivkin Jr. and Andrew M. Grossman, opinion contributors, The Wall Street Journal.",
    "Former Sen. Orrin Hatch (Utah), the longest serving GOP senator in the chamber's history, died at age 88 on Saturday, bringing to a close an extraordinary life.",
    "The 2019 policy was ended on the first day of Biden's White House tenure but was subsequently reinstated by a federal judge in December (The Associated Press).",
    "Eventually, Oz took the question but passed off answering most of it to conservative radio host John Fredericks (who was more than pleased to do the honors).",
    "That would be a steep drop from 6.9 percent in the fourth quarter of 2021 and would mark the slowest growth since the contraction of 2020 (Financial Times).",
    "After an unprecedented victory in the first vote at the warehouse known as JFK8, the Amazon Labor Union is hoping for a similar result at the LDJ5 facility.",
    " In a tweet Sunday night, Biden congratulated his French counterpart, writing, France is our oldest ally and a key partner in addressing global challenges.",
    "I didn't even ask for the endorsement in the first meeting,? Oz said, adding that he made the official endorsement request during their third get-together.",
    "The Agriculture Department has reported 41 dead bald eagles infected with the virus since February, and two more were infected in New York in late March.",
    "Oz said that he got the tie from Rep. Fred Keller (R-Pa.), who told him to simplify the look.?\n There's no love lost between Team Oz and Team McCormick.",
    "When a staffer mentioned that an attendee was getting the final question, a man stood up and demanded to know what Oz was going to do about voter fraud.",
    "The city was turned into one big cemetery.?\n The Atlantic: Impossible choices in the battle for the Donbas, by Ukrainian journalist Nataliya Gumenyuk.",
    "As The Hill's Jordain Carney writes, Mayorkas's appearance before the House committee isn't expected to be his only congressional hearing this month.",
    "The Morning Report's Al Weaver adds some color commentary from his coverage:\n Oz is looking a lot like Trump these days: blue suit, solid red tie.",
    "The Associated Press: COVID shots still work but researchers hunt new improvements\nMeanwhile, the situation in China continues to be problematic.",
    "The administration was pressured to send Biden or a high-level official to the capital after recent visits to Kyiv by a host of European leaders.",
    "In addition, Senate Majority Leader Charles Schumer (D-N.Y.) also teed up a vote on Alvaro Bedoya's nomination to be Federal Trade Commissioner.",
    "Related Articles\n The New York Times: Four children and their parents walked for days to flee Mariupol, making their way to Lviv, Ukraine.",
    "There's a lesson from Trump in '16: They'll forgive you for a lot if you're willing to stand in front of them and talk to them about it.",
    "They don't care how he got there anymore,? one Pennsylvania-based political operative who is unaffiliated with the race told The Hill.",
    "\n Also on Thursday, analysts expect the Commerce Department to report U.S. growth of 1 percent in the first three months of this year.",
    "Hatch is survived by his wife, Elaine Hatch, six children and dozens of grandchildren and great-grandchildren (The Salt Lake Tribune).",
    "Polling from sources involved in the race shows Oz with a slight lead following Trump's endorsement, but within the margin of error.",
    "Slower U.S. growth will challenge Democratic narratives about the economy and invigorate Republican outreach to voters (The Hill).",
    "The former president's 2022 rally calendar is evolving; (plans for a Mobile, Ala., visit in July have been canceled (AL.com).",
    "Also in question is another potential supplemental aid package in support of Ukraine, which the White House is supporting.",
    " The Washington Post: Pennsylvania Democratic Senate candidate John Fetterman tries to rally blue votes in Trump country.",
    "Morning Report\nBRISTOL, Pa.  In a previous life, Mehmet Oz's job was to convince his audience not to change the channel.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "This month, bald eagles have been infected in Ohio, South Dakota, Illinois, Wisconsin, Vermont, Maine and North Dakota.",
    "Introducing The Hill's latest newsletters:\ng? NotedDC, The Hill's insider take on the heartbeat of politics and policy.",
    "Warren on Sunday shut down any idea of a primary against Biden, saying that she is supporting him in 2024 (The Hill).",
    "One House Democrat seeking reelection in Texas said on Sunday that border communities are worried about such plans.",
    "So we are going to have to change our behavior and respond in a different way as the pandemic evolves? (The Hill).",
    "Current average U.S. COVID-19 daily deaths are 311, according to the Centers for Disease Control and Prevention.",
    " Opinion by The Washington Post editorial board: Macron's win is cause for great relief  and modest celebration.",
    "Rep. Henry Cuellar (D-Texas) is running as a moderate and faces a runoff primary challenge in May (The Hill).",
    "Total U.S. coronavirus deaths reported as of this morning, according to Johns Hopkins University: 991,254.",
    "On the Senate floor, members are set to finally confirm a number of Biden nominees to the Federal Reserve.",
    "A win could further prove the viability of the worker-led union and secure key protections for employees.",
    "OPINION\nAmerica's era of free-lunch politics is over, by Matthew Yglesias, columnist, Bloomberg Opinion.",
    "Our base isn't, Oh, this guy was pro-choice 10 years ago.' They just want someone who is on their side.",
    "Three Senate Democratic primary candidates debated in Pennsylvania last week (The Associated Press).",
    "It's what he wore on Thursday and in almost all of his recent appearances on Fox News and Newsmax.",
    "A second group of Ukrainian artillery specialists will soon begin another six-day training course.",
    "https://on.wsj.com/3EGEkBU\nWHERE AND WHEN\nThe House meets for a pro forma session at 12:30 p.m.",
    "A second victory also could prove damaging to Amazon, reports The Hill's Chris Mills Rodrigo.",
    "Follow us on Twitter (@alweaver22 & @asimendinger) and suggest this newsletter to friends!",
    " Associated Press / Mark Schiefelbein | A COVID-19 testing line in Beijing on Saturday.",
    "Guterres has been under some international pressure to play a stronger role in the war.",
    "Trump's blessing also gives Oz something he desperately needs at this point: cover.",
    "We've got less than 200 days until the election, and American families are hurting.",
    "[Rising cases] mean something different because people are vaccinated and boosted.",
    " Associated Press / J. Scott Applewhite | The late Sen. Orrin Hatch of Utah, 2017.",
    "In addition, Peters is also eyeing a separate hearing on the border more broadly.",
    "They mean something different because we have a lot more therapeutics available.",
    "g Evening Report, The Hill's roundup of major news from morning, noon and night!",
    "Brian Kemp (R), former Sen. David Perdue (R-Ga.) clash over elections in debate.",
    " Associated Press / Tom Williams pool via AP | Sen. Elizabeth Warren in March.",
    "The percentage of Americans who have received third or booster doses is 29.7.",
    "Ron DeSantis (R) tests limits of his combative GOP style in his Disney feud.",
    "Now, Oz's job centers around convincing people that he is who he says he is.",
    "As Jha noted, the situation is far different at this stage of the pandemic.",
    "Join Wednesday's and Thursday's, Sustainability Imperative,? at 2 p.m.",
    "A recent Trafalgar Group poll has the former TV doctor up by 3 points.",
    "Related Articles\n The Associated Press: Cash windfalls to Oz, J.D.",
    "Elsewhere on the political scene, Sen. Elizabeth Warren (D-Mass.)",
    "We would have reacted to this differently a year ago,? Jha said.",
    " Trump is eager to play the role of a midterm endorsement king.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The ambassadorial post has been vacant for more than a year.",
    "Some of Cruz's top aides are running the show for McCormick.",
    " Der Spiegel: Interview with German Chancellor Olaf Scholz.",
    "They also announced that Bridget Brink, currently the U.S.",
    "The total dollars, however, are unknown at this point.",
    "Lawmakers return from their spring recess on Tuesday.",
    "There is no effective treatment (The New York Times).",
    "THE CLOSER\nAnd finally  RIP to a political legend.",
    "The president returns from Delaware at 10:50 a.m.",
    " Finally, Oz really wanted to talk about sports.",
    "Vance campaigns follow Trump endorsements.",
    " The voter fraud issue is alive and well.",
    "Also, check out the Rising? podcast here.",
    "Email: Alexis Simendinger and Al Weaver.",
    "Everyone plays a role in sustainability!",
    "The Hill's John Kruzel has the details.",
    "Stay Engaged\nWe want to hear from you!",
    "(Side note: 2016 just will never end).",
    "RSVP today to save your virtual spot.",
    "These are not pep rallies,? Oz said.",
    " The Associated Press: Georgia Gov.",
    "The Associated Press: Florida Gov.",
    "The Senate convenes at 3 p.m.",
    "It was not a hard sell.",
    " Tonight at 8 p.m.",
    "See all Video",
    "The reason?",
    "RSVP.",
    "ET."
  ]
}