{
  "id": 2000,
  "mediaId": 21,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Wells Fargo projects it will save $1 billion over the next 10 years by migrating to the public cloud, according to a top exec",
  "image": "https://i.insider.com/62607207478dfc001859e4aa?width=1300&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/wells-fargo-save-1-billion-over-10-years-public-cloud-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carter Johnson",
  "authorUrl": "https://www.businessinsider.com/author/carter-johnson",
  "termIds": [
    2095,
    2195,
    2195,
    2095,
    2409,
    2409,
    1434,
    1434,
    1484,
    1484,
    1727,
    1727,
    1801,
    1801,
    1896,
    1896,
    1951,
    1951,
    1147,
    1147,
    616,
    616,
    428,
    428,
    59,
    59,
    78,
    312,
    312,
    236,
    236,
    78
  ],
  "sentences": [
    "And it will look to have 50% of its engineers be cloud-certified\nLike other banks, Wells Fargo is also no stranger to questions about its spending, especially because the bank has been on a well-publicized mission to cut costs under CEO Charlie Scharf.",
    "In 2019, Bank of America said it saved roughly $2 billion by forgoing partnerships with big cloud providers like Google and Microsoft to build its own private clouds, although the bank has since partnered with IBM on public cloud efforts.",
    "\"Money is one part of it, but then the amount of time you end up expending and building out an infrastructure before something productive happens on it shrinks significantly when you have something like cloud,\" he said.",
    "After revealing the outlines of what the firm called a new \"digital infrastructure strategy\" last fall, Wells Fargo is gearing up to retire much of its on-premise tech stack and kick off a multi-cloud migration.",
    "Rebuilding Wells Fargo tech stacks for the public cloud  where the bank will need to rewire its security and privacy protocols  will involve \"heavy capital outlay\" and \"heavy opex outlay,\" Mehta said.",
    "Putting the so-called customer experience engine on the public cloud will allow the bank to scale the platform and perform \"billions\" of calculations a day while still protecting data, Mehta said.",
    "Chintan Mehta, Wells Fargo's chief information officer and head of digital technology & innovation, said that while the efforts will involve \"heavy capital outlay,\" time savings is the target.",
    "This is something that we're embedding in the DNA of how we run the place and it continues to evolve, and we feel good about executing on that,\" Santomassimo told industry analysts.",
    "Wells Fargo's chief financial officer, Mike Santomassimo, underscored the evolving nature of the firm's efficiency goals during the bank's first-quarter earnings call this April.",
    "Wells has forged partnerships with both Microsoft Azure, who now serves as Wells' primary public cloud provider, and Google Cloud, and will also rely on third-party data centers.",
    "Wells Fargo As part of a renewed focus on digital tech, Wells Fargo has also touted a new virtual assistant  aptly named Fargo  that's slated for launch at the end of this year.",
    "Behind the scenes, Mehta and his team are re-architecting a key data platform that the bank uses to personalize online customer experiences and anticipate customer needs.",
    "As Wall Street integrates the public cloud into its tech stacks it's begun to experience a sea change in how people do their jobs and, subsequently, its talent pool.",
    "The bank is hiring 2,500 technologists to its 42,000-strong tech org this year, the company's chief technology officer, Steve Hagerman, recently told Insider.",
    "Wells Fargo's move to the cloud could save the bank as much as $1 billion over the next decade, one of the bank's top tech executives told Insider.",
    "Wells Fargo; Tom Williams/CQ-Roll Call, Inc via Getty Images; Samantha Lee/Insider\n This story is available exclusively to Insider subscribers.",
    "Banks, once hesitant to make the jump to the public cloud, have deepened relationships with Big Tech firms providing the infrastructure.",
    "The nation's largest banks have long signaled the importance of the cloud as a driver of both innovation and, crucially, efficiency.",
    "Meanwhile, buy-side firms like hedge funds, asset managers, and private equity firms have also widely opened up to the tech.",
    "But Google Cloud will handle its \"advanced workloads,\" which includes its efforts in big data and artificial intelligence.",
    "Other firms like Bank of America have also pegged the cost savings tied to cloud projects in the billions of dollars.",
    "And Wells Fargo is no exception, as the bank is actively upskilling its employees to reflect its cloud ambitions.",
    "In January, for example, the bank said it planned to reduce expenses across the firm by $1.6 billion in 2022.",
    "Azure will bear the bulk of the bank's cloud tools, including those that face customers and employees alike.",
    "Chintan Mehta, the chief information officer and head of digital technology and innovation at Wells Fargo.",
    "Cloud is now playing a critical role in how these firms scale compute capacity, use and find data.",
    "A top Wells exec told Insider moving to the cloud could trim $1 billion over the next decade.",
    "Wells Fargo is working with Microsoft Azure and Google Cloud to migrate to the public cloud.",
    "It's equally about ripping and replacing legacy tech as it is about spurring new innovation.",
    "\"As I said a number of times over the last couple of quarters, it's not a static program.",
    "Wells Fargo's move to the cloud comes as Wall Street powerhouses embrace the technology.",
    "Wells Fargo's move to the public cloud comes as Wall Street at large embraces the tech.",
    "Subscribe to push notifications\n Deal icon An icon in the shape of a lightning bolt.",
    "Stay up to date with what you want to know.",
    "But the end goal, however, is time savings.",
    "Become an Insider and start reading now.",
    "Sign up for notifications from Insider!",
    "For you"
  ]
}