{
  "id": 2057,
  "mediaId": 65,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Former Trump EPA chief Scott Pruitt files to run for Senate in Oklahoma",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/5712e84a-a6ec-4320-9b89-3fd1e7fa9c5c/4d4bdb6b-9674-4e47-abb1-ae82a957f494/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/former-trump-official-scott-pruitt-files-to-run-for-senate-in-oklahoma",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Mark Miller",
  "authorUrl": "https://www.foxnews.com/person/m/andrew-mark-miller",
  "termIds": [
    2302,
    2302,
    2102,
    2102,
    1290,
    1290,
    1619,
    1619,
    1147,
    1147,
    557,
    557,
    571,
    571,
    381,
    381,
    2939,
    2939,
    2846,
    2846
  ],
  "sentences": [
    "US BELIEVES UKRAINE'S ACTIONS LEAD TO SINKING OF RUSSIA'S MOSKVA WARSHIP, OFFICIAL SAYS\nDemocrats praised the news of Pruitt's resignation with Vermont Sen. Bernie Sanders calling him the \"the worst EPA administrator in the history of the agency\" and Delaware Sen. Tom Carper claiming that \"history will not look kindly on this era.\"",
    "\"And I will tell you, from my perspective, I offer the experiences I've had serving in (former President Donald Trump's) cabinet, serving as attorney general, making a difference in behalf of these issues that matter to Oklahomans today and I think matter to this country.",
    "Pruitt told The Associated Press on Friday, that he \"led with conviction in Washington, D.C.\" and chalked up the criticism against him as resulting from leading an agency that was the \"Holy Grail of the American left.\"",
    "(AP Photo/Andrew Harnik, File)\nPruitt resigned from Trump's EPA in July 2018 amid a string of controversies that included alleged ethics violations and controversial spending on travel and ties to lobbyists.",
    "(Tom Williams/CQ-Roll Call, Inc via Getty Images)\n\"And I made a difference in the face of that,\" Pruitt, who prioritized the dismantling of several Obama-era regulations during his time at the EPA, said.",
    "Pruitt will face a crowded GOP primary field seeking to replace Inhofe, 87, who shook up Oklahoma politics with his announcement that he would step down in January, just two years into his six-year term.",
    "Former Democratic U.S. Rep. Kendra Horn was the only Democrat to file for the seat by early afternoon on Friday, the final day of the three-day candidate filing period.",
    "Shannon, Inhofe's longtime Chief of Staff Luke Holland, state Sen. Nathan Dahm and Alex Gray, former chief of staff of the National Security Council under Trump.",
    "\"As I look at the race, all good folks,\" Pruitt told reporters at the Oklahoma state capitol after filing paperwork on Friday, according to the Oklahoman.",
    "Scott Pruitt, former head of the Environmental Protection Agency during a portion of the Trump administration, has filed to run for Senate in Oklahoma.",
    "Pruitt served as Oklahoma's attorney general from 2011 to 2017 and sued the Environmental Protection agency on multiple occasions during his tenure.",
    "Ten Republican hopefuls have filed to run for the seat, including U.S. Rep. Markwayne Mullin, former Speaker of the Oklahoma House T.W.",
    "At the time Pruitt stepped down from his position at the EPA, then President Trump praised the \"outstanding job\" Pruitt had done.",
    "\"I think Oklahomans know when the New York Times and CNN and MSNBC and those places are against you, Oklahomans are for you.\"",
    "Pruitt filed paperwork as a Republican this week to run for the U.S. Senate seat being vacated by Sen. Jim Inhofe.",
    "Because of Inhofe's announcement, both of Oklahoma's U.S. Senate seats are up for grabs this cycle.",
    "And other candidates have their experiences, and they're going to offer their experiences.\"",
    "Four Democrats, a Libertarian and an independent also filed this week to seek the post.",
    "Associated Press contributed to this report\nAndrew Mark Miller is a writer at Fox News.",
    "Find him on Twitter @andymarkmiller and email tips to AndrewMark.Miller@Fox.com.",
    "Pruitt did not immediately respond to a request for comment from Fox News.",
    "Lankford will face Tulsa pastor Jackson Lahmeyer in the GOP primary.",
    "Current U.S. Sen. James Lankford is seeking another six-year term.",
    "\"I will always be thankful to him for this,\" Trump said."
  ]
}