{
  "id": 3173,
  "mediaId": 21,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Voter fatigue takes center stage in Pennsylvania as Mehmet Oz tries to woo the MAGA base and Trump looms large",
  "image": "https://i.insider.com/62792836a6a880001828046c?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/pennsylvania-voters-primary-date-fetterman-oz-trump-may-17-2022-5",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Lahut",
  "authorUrl": "https://www.businessinsider.com/author/jake-lahut",
  "termIds": [
    1147,
    1653,
    2087,
    3017,
    428,
    2682,
    3060,
    2862,
    2868
  ],
  "sentences": [
    "To the east in Allegheny County  where record turnout not seen since 1964 helped deliver Pennsylvania's 20 electoral votes to President Joe Biden in 2020  voters from rusted-out steel towns to ritzy suburbs said they're feeling increasingly alienated from the state's closed primary system, which several Pennsylvanians blamed for producing more extreme candidates in the general election.",
    "Jeff Swensen/Getty Images\nWhile the Trump rally attendees weren't sold on Oz either, those who spoke with Insider also eschewed skepticism over McCormick, tending instead to back Barnette, a conservative author and commentator who would become the first Black woman to represent Pennsylvania in the Senate.",
    "Unwilling to entertain any candidate vying for a Trump endorsement  or even a goateed, 6-foot 11-inch tall Democrat who wears shorts everywhere  Wright acknowledged that he's in the minority of the GOP, and that the fired-up base in each party ultimately gets to decide who goes on the ballot, not him.",
    "Whoever the Keystone State voters end up picking to replace the retiring Republican Sen. Pat Toomey, their next senator will either be a key addition for Democrats defending the thinnest of majorities, or a Trump acolyte about as far as one can get from Toomey in the reshaped GOP.",
    "Even in one of the nation's most pivotal battleground states, even with TV celebrity-level name recognition, and even with the coveted Trump endorsement, the Oz campaign is running into the same problem as other statewide Republican and Democratic operations: voter burnout.",
    "Outside of the frosty reception Oz received at the Trump rally in Greensburg, more than two-dozen Pennsylvanians Insider spoke with across Pittsburgh and its surrounding towns had no idea he was running for office in their state, much less as a Republican.",
    "But when the topic of the midterm elections came up, Wright furrowed his brow and adjusted his seat in the stands from where he was watching a lacrosse game between Sewickley Academy, his grandson's middle school, and St. Edmonds Academy.",
    "More than an hour west from the gun store where Bahleda lauded Fetterman's record as the former mayor of Braddock, Wright echoed many of the McKeesport retiree's qualms with Trump, only this time within view of a Porsche dealership.",
    "Rather than risk the optics of empty seats along the grandstand of the fairgrounds, rally organizers chose to cover almost all of the bleachers with two massive American flags  much to the chagrin of attendees hoping to stay dry.",
    "In an RV on the outskirts of the fairgrounds in Greensburg, Trump merchandise salesman Reggie Jones told Insider that as far as he's concerned, nothing's really dimmed the appeal of the former host of \"The Celebrity Apprentice.\"",
    "A Pew Research survey on the 2020 election found that moderate voters in particular are especially susceptible to voter fatigue and subsequent lower turnout than the most ideologically extreme coalitions in both major parties.",
    "'I don't wanna lose sleep thinking about this guy'\n Pennsylvania Republican U.S. Senate candidate Dr. Mehmet Oz listens as former President Donald Trump speaks on behalf of his campaign at the Westmoreland County Fairgrounds.",
    "But above all, Jones said, Obama, Trump's original nemesis, remains the driving force for his customers  not inflation, the US's messy withdrawal from Afghanistan, the Russian invasion of Ukraine, or any other current issues.",
    "After watching the candidates debate, he said he's leaning toward real estate developer Jeff Bartos, who's polling at an average of just 4.5% in the race behind Oz, McCormick, and Kathy Barnette in the top three.",
    "Rolling hills and valleys guide winding roads through tunnels that lead to steeper hills and deeper valleys, culminating in the final approach when the city's skyline and myriad bridges finally come into view.",
    "GREENSBURG, Pa.  From the comfort of a VIP tent backstage, Republican Senate candidate Mehmet Oz was insulated from the torrents of rain and scores of soaked Trump supporters booing every mention of his name.",
    "\"I just want somebody from Pennsylvania, someone who actually grew up here,\" Lynn Johnson, a 55-year-old restaurant server from Ligonier, Pennsylvania, said while making her way across the muddy fairgrounds.",
    "\"I've been watching the attack ads,\" Frank Lascola, an independent 82-year-old Army veteran who votes Democratic \"as a habit,\" told Insider over a cup of coffee at a Pittsburgh diner, shaking his head.",
    "Bernard Bahleda, a 72-year-old retired postal worker, was buying a gun for his wife ahead of Mother's Day in a post-industrial landscape marked by abandoned buildings and rusted-out steel mills.",
    "Those who bore the elements did so out of what they described as a fervent desire to see former President Donald Trump and show their support for a possible third White House run in 2024.",
    "There's also a larger overall trend of heightened anxiety among Americans, with a FiveThirtyEight analysis finding a jump in feelings of burnout and worries for what 2022 would hold.",
    "Agreeing with the three men behind the counter at Legion Arms, Bahleda said he's sick of all the ads for the Senate and gubernatorial primaries, but he's even more done with Trump.",
    "Lascola said he \"can't remember all this bullshit\" at his age, and that he misses candidates like the late Sen. John McCain shutting down conspiracy theories among voters.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "But Bahleda was much more sympathetic to Biden  whom he said has few options to address inflation, a global problem  from his vantage point in post-industrial McKeesport.",
    "\"I never thought I'd see this in my lifetime,\" Lascola, a retired mechanical engineer, told Insider as his coffee cooled, referring to the January 6, 2021 Capitol siege.",
    "In the ornate hamlet along the Ohio River, Wright said a recent influx of young professionals is about the only big change he's seen as a lifelong Sewickley resident.",
    "Unlike the MAGA faithful at the Greensburg rally, Lascola was adamant that he doesn't want Trump to run again in 2024, but he's unable to muster the will to care.",
    "Despite an estimated $7.8 billion that will be spent on ads by Election Day in November, the Pennsylvania voters who spoke to Insider were already sick of them.",
    "A registered Republican and retired trial lawyer, Wright told Insider he doesn't want to support Oz or his biggest rival, former hedge fund CEO David McCormick.",
    "Still shaken by the violent insurrection, Lascola said he fears the return of McCarthyism and its paranoia among neighbors if Trump retakes the White House.",
    "In the heart of downtown Pittsburgh at Cherries Diner, Lascola sat at his usual spot at a table off to the side of the counter, back turned to the TV news.",
    "'I just want somebody from Pennsylvania'\n A flag covers seats under the grandstand roof at the Westmoreland County Fairgrounds in Greensburg, Pennsylvania.",
    "Anti-Biden merchandise may have been slow to catch on, Jones said, but \"Let's Go Brandon\" items have caught up to the 2016 interest in Hillary Clinton.",
    "Tom Williams/CQ-Roll Call, Inc via Getty Images\nLife has always been good in the ritzy suburb of Sewickley, 79-year-old Thomas Wright told Insider.",
    "Wright refused to vote for Trump at the top of the GOP ticket in 2016 and 2020, but hasn't been able to stomach any Democratic candidates, either.",
    "\"He changed me around completely because of his lies,\" Bahleda told Insider, adding that he voted for Trump in 2016 but switched to Biden in 2020.",
    "Lascola said he's scratched his head seeing friends and acquaintances continue to support the former president, but he tries not to judge them.",
    "Others, like Michelle Sinsabaugh, a 62-year-old bus driver from nearby Mont Pleasant, were undecided but also firmly in the never-Oz camp.",
    "\"Now Obama stuff has been great,\" Jones told Insider as a few Trump supporters bought ponchos and umbrellas in anticipation of the rain.",
    "Just down the Monongahela River in McKeesport, the second-largest city in Allegheny County, a former Trump supporter was less forgiving.",
    "Tayfun Coskun/Anadolu Agency via Getty Images\nPennsylvania's primaries are a week away on May 17, and voters are already exhausted.",
    "Don't like his leanings,\" Wright said, still holding onto a slight smile from his grandson scoring a goal in the number 11 jersey.",
    "\"Well, I'll be honest with you, I may not like it, but I don't wanna lose sleep over this guy,\" Lascola said, referring to Trump.",
    "Fetterman has held onto a roughly 30 percentage point lead over challengers US Rep. Conor Lamb and state Rep. Malcolm Kenyatta.",
    "\"I say they pick him because they've been bullied all their life, and they see a guy that they think won't take any bullies.\"",
    "\"Ten years ago he says this, now he's sayin' this  and I don't even know if he's from Pennsylvania,\" Sinsabaugh told Insider.",
    "He said he voted for President Barack Obama twice as well and voted for Trump's Democratic opponent in both 2016 and 2020.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "\"If my people wanna elect this guy,\" he continued, \"then I have to obey the law, but I'm not gonna ruin my health.",
    "Jeff Swensen/Getty Images\nThe journey into Pittsburgh from the east feels like a never-ending descent.",
    "Republicans, Democrats, and independents told Insider that they feel burned out by all of the ads.",
    "John Fetterman wins the Democratic primary on May 17 so he can back him in the general election.",
    "Loathing any candidate seeking Trump's endorsement, Bahleda said he hopes Pennsylvania Lt. Gov.",
    "This, despite Trump costing Republicans the House, Senate, and White House in just four years.",
    "Trump endorsed Dr. Mehmet Oz but he's struggled to connect with the MAGA faithful.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Between a Trump GOP and a hard place\n Democratic US Senate candidate Lt. Gov.",
    "\"I don't take a shot at those people,\" he said of voters in favor of Trump.",
    "I can't help the way I feel about this, but I can help the way I behave.\"",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Both Wright and Bahleda said inflation is a primary concern for them.",
    "It's a hunch backed up by political science research.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"I'd have trouble supporting Fetterman.",
    "Loading Something is loading.",
    "\"Off the roof, man.\"",
    "John Fetterman.",
    "It's hard."
  ]
}