{
  "id": 368,
  "mediaId": 65,
  "date": "3/8/2022 12:00:00 AM",
  "headline": "Elise Stefanik unveils new endorsements for 2022 midterm elections",
  "image": "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a0b8d158-4d00-45fb-94aa-b7135da93a63/3da9f280-cb94-4d69-8a98-46304c16d199/1280x720/match/931/524/image.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/politics/elise-stefanik-unveils-endorsements-2022-midterm-elections",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2216,
    2216,
    2068,
    2068,
    1248,
    1248,
    1095,
    1095,
    562,
    562,
    600,
    600,
    428,
    428,
    2707,
    2707,
    2953,
    2953
  ],
  "sentences": [
    "Stefanik also made one endorsement in the Senate for GOP candidate Jane Timken in Ohio and last month joined House GOP Leader Kevin McCarthy, R-Calif., in taking the rare step of backing a primary challenger to a GOP colleague when they endorsed Harriet Hageman in her race against Rep. Liz Cheney in Wyoming.",
    "Her latest endorsements are for Tanya Wheeless in Arizona, Anna Paulina Luna in Florida, Erin Houchin in Indiana, Annie Black in Nevada, Liz Joy in New York, Madison Gesiotto Gilbert in Ohio, Lori Chavez-DeRemer in Oregon, Morgan Ortagus in Tennessee, Cassy Garcia in Texas and Mayra Flores in Texas.",
    "Those 10 are in addition to eight previous E-PAC House endorsements for Esther Joy King in Illinois, Amanda Adkins in Kansas, Karoline Leavitt in New Hampshire, April Becker in Nevada, Lisa Scheller in Pennsylvania, Monica De La Cruz in Texas, and Jen Kiggans and Jeanine Lawson, both in Virginia.",
    "They are: Jan Kulmann of Colorado, Barbara Kirkmeyer of Colorado, Catalina Lauf of Illinois, Cassandra Tanner Miller of Illinois, Regan Deering of Illinois, Theresa Gavarone of Ohio, Jessica De La Cruz of Rhode Island, Kalena Bruce of Missouri, Sarah Walsh of Missouri and Yesli Vega of Virginia.",
    "It's clear there is no shortage of all-star Republican women this cyclewe have a record-shattering 260+ Republican women who are already running for Congress, which surpasses our record in 2020 during the historic Year of the Republican Woman,'\" Stefanik said in a statement to Fox News Digital.",
    "STEFANIK, IN FIRST SENATE ENDORSEMENT OF 2022 MIDTERMS, THROWS SUPPORT BEHIND OHIO GOP CANDIDATE JANE TIMKEN\n\"I'm thrilled to add to E-PAC's impressive slate of Republican women candidates by officially endorsing 10 more Rising Star GOP women for Congress.",
    "(Photo By Tom Williams/CQ-Roll Call, Inc via Getty Images)\n\"E-PAC's endorsed candidates are determined to build on the historic success of last cycle, when we more than doubled the Republican women elected to Congress,\" Stefanik told Fox News in November.",
    "Stefanik revealed 10 new endorsements for female Republican House candidates that she says are \"rising stars\" and have already demonstrated an ability to build a winning campaign through strong fundraising, grassroots support and digital programs.",
    "FIRST ON FOX: Rep. Elise Stefanik, the House Republican Conference Chair, Tuesday announced her latest slate of endorsements for the 2022 midterms in her bid to help Republicans retake the House and elect more GOP women.",
    "UNITED STATES - NOVEMBER 17: Reps. Kat Cammack, R-Fla., and August Pfluger, R-Texas, attend a rally on the House steps of the U.S. Capitol to oppose the Build Back Better Act, on Wednesday, November 17, 2021.",
    "3 House Republican when the GOP conference voted out Cheney for her impeachment vote against former President Trump and her ongoing criticism of his actions surrounding the Jan. 6 riot at the U.S. Capitol.",
    "The endorsement means that Stefanik will help the candidates by holding events, spending money on digital fundraising and her team will help their campaign with strategic advice.",
    "Stefanik founded E-PAC after the 2018 midterm elections and has raised and donated more than $3 million for GOP women candidates through her political action committee.",
    "In 2020, however, Republicans made a comeback and elected the highest number of GOP women in history, with Trump dubbing it \"The Year of the Republican Women.\"",
    "\"I look forward to supporting these Rising Stars across the finish line in both their primaries and general elections,\" Stefanik said.",
    "\"GOP women made history in 2020, and in 2022, Republican women are leading the Red Tsunami to Fire Nancy Pelosi once and for all.\"",
    "In the years since, Stefanik has risen through the GOP ranks and made it a priority to recruit and elect more Republican women.",
    "That brings the total number of endorsements through her E-PAC fundraising arm to 18 candidates for battleground House seats.",
    "Her record was shattered in 2018 by New York City Democratic Rep. Alexandria Ocasio-Cortez, who was 29 when she got elected.",
    "There are 125 women in the House (including 3 Delegates and the Resident Commissioner), 92 Democrats and 33 Republicans.",
    "As of January 28, 149 women are serving in the 117th Congress, according to the Congressional Research Service.",
    "STEFANIK JOINS MCCARTHY IN ENDORSING CHENEY'S REPUBLICAN PRIMARY CHALLENGER\nStefanik replaced Cheney as the No.",
    "Stefanik made history in 2014 when at the age of 30 she was the youngest woman ever elected to the House.",
    "These candidates have not yet earned a full endorsement, but they have impressed Stefanik.",
    "\"In 2020, GOP women were history makers, and in 2022, GOP women will be majority makers.\"",
    "Eleven out of the 15 seats that flipped red were won by E-PAC endorsed Republican women.",
    "Stefanik also announced Tuesday 10 new \"Women to Watch\" 2022 E-PAC candidates.",
    "There are 24 women in the Senate, 16 Democrats and 8 Republicans.",
    "Cammack was endorsed by E-PAC in 2020 and won election.",
    "In 2019, only 13 Republican women served in the House.",
    "Fox News' Brooke Singman contributed to this report.",
    "Her efforts have paid off."
  ]
}