{
  "id": 531,
  "mediaId": 376,
  "date": "2/10/2022 12:00:00 AM",
  "headline": "At the Races: Political diss-course",
  "image": "https://i0.wp.com/cdn.media.rollcall.com/author/2019/10/AT-THE-RACES-LOGO-20202400x1300.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/02/10/at-the-races-political-diss-course/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Ellen McIntire\nStephanie Akin\nKate Ackley",
  "authorUrl": "",
  "termIds": [
    1109,
    1147,
    1248,
    1765,
    1896,
    2117,
    2214,
    2303,
    2510,
    3094,
    428,
    2738
  ],
  "sentences": [
    "Corrected, 5:49 p.m. | The Republican National Committee's resolution censuring Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois for their membership on the House select committee investigating Jan. 6 has forced Republicans on the Hill to answer some uncomfortable questions and given Democrats a new line of attack in fundraising emails invoking the phrase legitimate political discourse.?\nIt's also led to another back-and-forth between former President Donald Trump and Senate Minority Leader Mitch McConnell of Kentucky, who said this week that the attack on the Capitol was a violent insurrection? and that, historically, party committees have supported members regardless of their positions on some issues.?\nMitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters,? Trump said in a statement Wednesday through his Save America PAC.",
    "And it boomeranged to the point that Rogan's finance chairman, who was a Pakistani Muslim, actually participated in a press conference denouncing me and demanding he fire me, right in front of our campaign headquarters.? It was hard to know whether the episode contributed to Rogan's loss, Roe said, noting that Rogan's position as an impeachment manager during former President Bill Clinton's Senate trial had made him a prime Democratic target, and the race broke records for campaign spending.",
    "I mean, she was very sweet and kind to an idiot 20-something staffer.?\nBiggest campaign regret: Roe was helping former California Rep. James Rogan defend his seat against a young upstart named Adam Schiff when Roe was quoted in the LA Times saying a local Muslim leader seem[ed] to be an apologist for terrorists.? I shot my mouth off to the media attacking Schiff for appearing with him.",
    "But even after the new map changed Rep. Andy Harris' district from one Trump won by 20 points to one Biden won by less than 1 point, the lone surviving Republican in the delegation still has a decent chance of winning this cycle.?\nCandidate confessions\nForget the maddening speed of downhill skiers and lugers, and the skaters and skiers and snowboarders twirling through the air.",
    "I think he wanted to make sure that something like that didn't happen to me where, you know, if I got out of favor with a power structure I might find myself financially stressed.?\nMost unforgettable campaign moment: Roe spent the last weekend of Bob Dole's 1996 presidential campaign jetting around Southern California with movie star Bo Derek, who was campaigning for Dole.",
    "It used to be associated with people drinking a lot, but really it's very athletic, very precise.?\nShop talk: Jason Cabel Roe\nIn a career spanning almost 30 years, Roe has worked as a political and communications strategist for numerous Republican candidates for president, Congress, governor, and state and local office, as well as corporations and political parties.",
    "Child's play: The GOP-aligned outside groups State Government Leadership Foundation and N2 America are out with a six-figure ad running in Colorado, Michigan, Minnesota and Washington, D.C., hitting Democrats and teachers' unions for promoting pandemic protocols in the classroom while politicians and celebrities party unmasked.",
    "Home is where the voters are: Oregon Democratic Rep. Kurt Schrader, who faces a primary challenge from Jamie McLeod-Skinner, is not only fielding criticism for being out of touch with his district but also may have a residency problem, listing his home in Washington, D.C., as his primary address, according to the Intercept.",
    ": The House Ethics Committee is looking at a second report from the Office of Congressional Ethics about Rep. Alex X. Mooney but likely won't announce anything more about it until May 23  or about two weeks after the May 10 Republican primary between Mooney and Rep. David McKinley, CQ Roll Call's Chris Marquette reports.",
    "Cutting it close: After a state Supreme Court order last week gave the Republican-controlled legislature in North Carolina a Feb. 18 deadline to submit new congressional maps and promised a decision by Feb. 23, the state Board of Elections on Wednesday said candidates can file to run from Feb. 24 through March 4.",
    "Bar fight: Missouri GOP Senate candidate and attorney Mark McCloskey and his wife, Patricia McCloskey, had their law licenses suspended indefinitely by the state Supreme Court after they pleaded guilty to misdemeanors for waving guns as Black Lives Matter protesters were marching near their home.",
    "Weighing in: Contributions from the cryptocurrency industry were higher in 2021 than they were at the same point in the 2020 cycle, a possible sign that a tax reporting provision in the infrastructure law enacted last year stirred up donors, CQ Roll Call's Caitlin Reilly reports.",
    "Not so fast: After a three-judge federal court panel threw out Alabama's new congressional map and ordered a new one drawn before the May 24 primary, the Supreme Court in a 5-4 decision blocked that order and said the 2022 election could go ahead with the map in question.",
    "The awful events of that day do not justify Cheney or Kinzinger enabling a partisan committee whose real purpose seems to be helping Democrats' electoral prospects at the cost of potentially ruining innocent people's lives,? she wrote in an opinion piece for Townhall.com.",
    ": Political trickster Roger Stone is raking in cash? from newcomer politicians eager for an endorsement from the far right's favorite martini-swashing popinjay,? as his consulting company fends off a multimillion-dollar tax evasion lawsuit, the Daily Beast reports.",
    "Voter analysis: Efforts by Republican-controlled state legislatures to suppress turnout of Democratic-leaning voter groups are unlikely to bear fruit? and may even backfire, according to a new report from the University of Virginia's Center for Politics.",
    "The count: $7.6 million\nThat's how much the American Federation of Teachers Committee on Political Education gave to political committees and candidates in 2021, more than the union doled out in all of the 2019-20 election cycle, federal reports show.",
    "Pandemic bogeyman: Republican congressional candidates are making National Institutes of Allergy and Infectious Diseases Director Anthony Fauci the star of their new campaign ads and attacking him for his handling of the pandemic, Politico reports.",
    "Under the surface: National Journal looks at a collection of races that would only be competitive under extraordinary circumstances? and would signal a big red wave, such as the reelection bid of DCCC Chairman Sean Patrick Maloney of New York.",
    "ICYMI\nLow Country highlights: South Carolina Republican Katie Arrington was endorsed by Trump within hours of announcing she would leave her controversial Pentagon post to challenge GOP Rep. Nancy Mace in South Carolina's 1st District.",
    "I had TV cameras camping outside of my apartment in West Hollywood.?\nUnconventional wisdom: There are more votes to be gained by Republicans in urban areas than there are for Democrats in suburban, exurban and rural areas,? Roe said.",
    "We need to get Calvert out of Congress before he destroys our democracy,? Shrina Kurani's campaign wrote in an email, before asking supporters to donate $10 to her effort to oust GOP Rep. Ken Calvert in California's 41st District.",
    "Coming up\nThere's some football game playing in between expensive commercials on Sunday, and if the NFL's your thing, catch host Jason Dick chatting with The New York Times' Jane Coaston on the latest Political Theater podcast.",
    "What we're reading\nStu says: Despite former Vice President Mike Pence saying Trump was wrong? about what the veep could do on Jan. 6, 2021, don't expect much of the party to turn on the former president, Stu Rothenberg writes.",
    "Laura Kelly's veto of a state congressional map that would dilute minority voters' strength in the state's lone Democratically held district and weaken Democratic Rep. Sharice Davids' chance of holding on to the seat in 2022.",
    "Mapmaking approved: New Jersey's Supreme Court dismissed a Republican challenge to the state's redrawn congressional maps, setting up districts that are expected to shield several Democrats from tough challenges this year.",
    "Here in Louisiana, and all over the South, Jim Crow never really left, and the remnants of the Confederacy remain,? Chambers says in a voiceover that cites methodical? attacks against Black people and their right to vote.",
    "Parent politics: A growing number of Democratic voters are voicing frustration over the mounting toll of pandemic protocols, particularly those affecting kids and their education, writes The Christian Science Monitor.",
    "Mace, who defeated Cunningham in 2020, responded with a Twitter video filmed in front of Trump Tower in which she extolled Trump's policies but warned that Arrington is more than qualified? to lose to a Democrat.",
    "My dad's favorite movie was 10' when I was growing up,? he said, referencing a 1979 romantic comedy that featured Derek as the young love interest of what he called a twirpy millionaire,? played by Dudley Moore.",
    "Staying put: Rep. Jason Smith won't enter the crowded Republican Senate primary in Missouri and instead plans to aim for the top GOP slot on the House Ways and Means Committee, CQ Roll Call's Peter Cohn writes.",
    "Election law experts tell CQ Roll Call's Todd Ruger and Michael Macagnone that the high court's action could also affect court challenges in several states, even as state courts continue to order maps redrawn.",
    "But they have also attracted potentially serious primary challengers who are pitching a return to civility and a more traditional style of lawmaking in a party that is still heavily influenced by Trump.",
    "Bad news: Congressional Democrats held a roundtable in Miami to raise alarms about what they described as continuing disinformation in Spanish-language media that contributed to their 2020 losses.",
    "On the campaign calendar, early voting starts Monday and runs through Feb. 25 ahead of the March 1 Texas primary, while preprimary reports are due to the Federal Election Commission next Thursday.",
    "Top fundraisers: Six of the 10 congressional candidates who raised the most money during the final quarter of 2021 were Black or Latino, led by Georgia Sen. Raphael Warnock's $9.8 million haul.",
    "Starting gate\nFirebrands meet friendly fire: Republican lightning rods Marjorie Taylor Greene, Madison Cawthorn and Lauren Boebert have raised millions of dollars flouting political norms.",
    "RNC Chairwoman Ronna McDaniel has since tried to clarify that the censure was more about Cheney's and Kinzinger's participation on the Democratic-led committee, rather than Jan. 6 itself.",
    "And frankly, I think you've got to blame the Democrats for becoming, after spending most of their modern history defined as a working people's party, they are now the party of the elites.",
    "The incident is a reminder that while Republicans would rather focus on issues like Thursday's inflation numbers, Democrats will continue to focus on the rifts in the party and Jan. 6.",
    "Unity: While they disagree on other issues, Democrats and Republicans in a new poll agree on one thing: They're worried about partisanship, CQ Roll Call's Jim Saksa reports.",
    "Everybody's watching everything else, and I'm watching curling,? she said, adding that competitors are really very athletic now? and deserve to be treated as athletes.",
    " I still remember when I told my father, he told me it was ridiculous, because it's seasonal work and I could never make a year-round living doing something like this.",
    "Larry Hogan, who had a 78 percent job approval rating in a Gonzales Research & Media Services poll released last month, said he would not run for Senate this year.",
    "Speakers included former Miami-area Rep. Debbie Mucarsel-Powell, who lost her seat to Republican Carlos Gimenez and is reportedly considering another run in 2022.",
    "Inflame the campaign: Democrat Gary Chambers, who rolled a blunt in his first ad for his Louisiana Senate campaign, is out with another attention-grabbing spot.",
    "The chief justice suggested in the ruling that the state reconsider how it approaches redistricting, which is currently done by a political commission.",
    "Nathan's notes\nDemocrats in Maryland have a long history of trying to craft congressional maps to get rid of Republicans, Nathan L. Gonzales writes.",
    "I want to have a fundraiser or event at this curling club in Maryland, and I could show you all how to throw the stone  it's not easy,? Tenney said.",
    "Some of the AFT PAC's biggest expenditures included $1 million each to two major Democratic super PACs, House Majority PAC and Senate Majority PAC.",
    "He was right to call out our own party leaders for not being clear and concise about what we mean by legitimate political discourse,? McCrory said.",
    "It's a result of diversity in pivotal races and a shift in the focus and strategy of political fundraising overall, a CQ Roll Call analysis found.",
    "The select committee has continued to subpoena Trump administration officials, most recently former White House trade adviser Peter Navarro.",
    "I think Republicans have ceded urban areas and basically given up on votes that are gettable if they would just invest some time and effort.",
    "And Republicans sit around wondering what we need to do, and think there's some secret sauce to getting more diverse votes from urban areas.",
    "(Tom Williams/CQ Roll Call file photo)\nSubscribe now using this link so you don't miss out on the best news and analysis from our team.",
    "And if you're a voter in a heavily Democratic urban area, you get a 100 percent flow of information from Democrats about the election.",
    "Asked to rank national divisions on a scale from 0 to 100, with 100 meaning on the edge of a civil war,? the mean response was 70.36.",
    "While the contents of the second report are unclear, the first concerned whether Mooney used campaign funds for personal pursuits.",
    "So I was out walking precincts and was around fundraisers and campaign rallies and all that kind of stuff as soon as I could walk.",
    "This is the second bid for Arrington, who defeated former Rep. Mark Sanford in a 2018 primary but lost to Democrat Joe Cunningham.",
    "Donations from both unions spiked early last year as lawmakers debated school funding as part of COVID-19 relief legislation.",
    "Another teachers union PAC, the NEA Fund for Children and Public Education, reported spending just shy of $900,000 in 2021.",
    "The former teenage curling champion? from Utica told CQ Roll Call's Jim Saksa that it's her favorite part of the Olympics.",
    "Photo finish\nDemocratic Sen. Chris Van Hollen of Maryland was probably doing some smiling this week after Republican Gov.",
    "Filing was supposed to happen in December, but that was postponed, and the March 8 primary was rescheduled for May 17.",
    "Dropping out: Republican Bernie Moreno suspended his campaign for Ohio's Senate seat being vacated by Republican Sen.",
    "And that is their fault.?\nDo you know someone who works in campaigns whom we should feature for Shop Talk?",
    "Pat McCrory, who is seeking the Republican nomination for Senate, complimented McConnell for his stance.",
    " You've got to give Trump credit for realigning the traditional coalitions within the two parties.",
    "Starting out: My father was executive director of the Michigan GOP the first 10 years of my life.",
    "In his own career trajectory, he found himself too dependent on politics for his livelihood.",
    "To actually meet her and spend an evening running around with her was kind of thrilling.",
    "1 with New York GOP Rep. Claudia Tenney is that frozen form of shuffleboard: curling.",
    "In Pennsylvania, Val Arkoosh also said she would drop out of the Democratic primary.",
    "Meanwhile, Democrats have pointed to the resolution to try to solicit donations.",
    "Each week we'll bring you news and analysis from the CQ Roll Call campaign team.",
    "I decided in my senior year in high school that I wanted to become a consultant.",
    "He also served as a senior adviser to the Congressional Leadership Fund in 2018.",
    "That prompted at least one congressional candidate to take sides in their feud.",
    "The number of Rep. Ken Calvert's district has been corrected in this report.",
    "Rob Portman and said he would support whichever candidate Trump endorses.",
    "John Engler before he became governor were, let's say, not close friends.",
    " He wanted me to go make money first and then get involved in politics.",
    "Mark McCloskey said the couple may appeal to the U.S. Supreme Court.",
    "Trump previously backed his rival for the nomination, Rep. Ted Budd.",
    "The OCE is a fact-finding office that cannot impose any discipline.",
    "Simply engaging would actually, I think, produce a lot of results.",
    "My sister worked on the Hill for former Congressman Buck McKeon.",
    "They met working at the Michigan Republican Party in the '60s.",
    "Veto override: The Kansas Legislature overrode Democratic Gov.",
    "The map is now likely to face a challenge in federal court.",
    "Know someone who'd like to get this newsletter?",
    "But it was a rough couple of days,? he said.",
    "Engler surprised everyone and won in 1990.",
    "It was not good for my father's fortunes.",
    "In this one he burns a Confederate flag.",
    "Email us at attheraces@cqrollcall.com.",
    "It's always been the family business.",
    "My parents actually met in politics.",
    "And he and [former Michigan] Gov.",
    "The Olympic sport that's No.",
    "Former North Carolina Gov.",
    "They can subscribe here.",
    "Welcome to At the Races!",
    "What's a popinjay?",
    "Double trouble?",
    "...",
    "..."
  ]
}