[
  {
    "id": 32,
    "mediaId": 261,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "As for the others, Kalamazoo chiropractor <span class='selected-term'>Garrett Soldano</span> is on a spring break vacation with his two young sons and is unable to attend, and Michigan State Police Capt.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know",
    "sentiment": "0"
  },
  {
    "id": 7473,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Businessman Kevin Rinke, chiropractor <span class='selected-term'>Garrett Soldano</span>, far-right activist Ryan Kelley and the Rev.",
    "author": "",
    "title": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race",
    "sentiment": "0"
  },
  {
    "id": 8663,
    "mediaId": 238,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "The five remaining GOP gubernatorial candidates include Tudor Dixon, Ryan Kelley, Ralph Rebandt, Kevin Rinke and <span class='selected-term'>Garrett Soldano</span>.",
    "author": "Amy B Wang",
    "title": "Mich. GOP candidate ruled ineligible for ballot after fraudulent petitions",
    "sentiment": "0"
  },
  {
    "id": 8656,
    "mediaId": 261,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "Joining Rinke onstage outside the Grand Hotel on Mackinac Island were Norton Shores businesswoman and conservative commentator Tudor Dixon, Oakland County pastor Ralph Rebandt and Kalamazoo chiropractor <span class='selected-term'>Garrett Soldano</span>.",
    "author": "Dave Boucher",
    "title": "Michigan GOP gubernatorial candidates eager for Donald Trump's endorsement",
    "sentiment": "0"
  },
  {
    "id": 8655,
    "mediaId": 157,
    "date": "6/3/2022 12:00:00 AM",
    "sentence": "Businessman Kevin Rinke, right-wing media personality Tudor Dixon, chiropractor <span class='selected-term'>Garrett Soldano</span> and the Rev.",
    "author": "",
    "title": "Michigan GOP gov. candidates infuse debate with conspiracies about Whitmer and voting",
    "sentiment": "0"
  }
]