[
  {
    "id": 1026,
    "mediaId": 19,
    "date": "d2022-01-12T00:00",
    "sentence": "Craig led, with about 45 percent of respondents recognizing his name, followed by businessman Kevin Rinke and chiropractor <span class='selected-term'>Garrett Soldano</span> at about 20 percent name recognition each.",
    "author": "Ashley Oliver",
    "title": "Poll: Republicans Face Uphill Battle to Unseat Michigan Democrat Gov. Gretchen Whitmer",
    "sentiment": "0.0"
  },
  {
    "id": 1024,
    "mediaId": 19,
    "date": "d2022-01-13T00:00",
    "sentence": "Both businessman Kevin Rinke and chiropractor <span class='selected-term'>Garrett Soldano</span> each trail Whitmer by seven points, while conservative media personality Tudor Dixon is ten points behind Whitmer.",
    "author": "Ashley Oliver",
    "title": "Poll: Democrat Gretchen Whitmer Tied with Former Detroit Police Chief James Craig in Michigan Governor's Race",
    "sentiment": "0"
  },
  {
    "id": 1006,
    "mediaId": 261,
    "date": "d2022-01-27T19:49",
    "sentence": "Other Republican candidates for Michigan governor are Oakland County businessman Kevin Rinke; Norton Shores businesswoman and conservative commentator Tudor Dixon; Kalamazoo chiropractor <span class='selected-term'>Garrett Soldano</span>; Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor",
    "sentiment": "0.0"
  },
  {
    "id": 1002,
    "mediaId": 238,
    "date": "d2022-02-01T12:03",
    "sentence": "When <span class='selected-term'>Garrett Soldano</span> was asked on a right-wing podcast how he would ensure the sanctity of life? in Michigan, the Republican candidate for governor said he would stop at nothing to protect a fetus.",
    "author": "",
    "title": "Mich. GOP governor candidate said rape victims shouldn't have abortions: Baby inside them may be the next president'",
    "sentiment": "-0.905"
  },
  {
    "id": 1001,
    "mediaId": 124,
    "date": "d2022-02-01T14:57:36",
    "sentence": "",
    "author": "",
    "title": "Michigan GOP governor candidate says rape victims shouldn't have abortions, baby might be 'next president'",
    "sentiment": "0.0"
  },
  {
    "id": 1000,
    "mediaId": 237,
    "date": "d2022-02-01T15:47",
    "sentence": "Abortion remarks by <span class='selected-term'>Garrett Soldano</span>, a Republican candidate for Michigan governor, went viral, creating controversy in a crowded gubernatorial primary race.",
    "author": "Kate Scanlon",
    "title": "Republican candidate for Michigan governor sparks abortion controversy",
    "sentiment": "-0.602"
  },
  {
    "id": 998,
    "mediaId": 43,
    "date": "d2022-02-02T00:00",
    "sentence": "On April Moss' right-wing podcast Face The Facts, <span class='selected-term'>Garrett Soldano</span>, a chiropractor and candidate for Michigan governor, said: We must focus on ... defending the DNA when it's created,? adding that women need to understand and know how heroic they are, and how unbelievable they are, that God put them in that moment.?\nSoldano argued that abortions should not be considered for survivors because they don't know if that baby inside of them could be the next president.?\nHe even shared a story of an alleged mentor who found out later in life that his birth mother had been raped by several men in a subway station.",
    "author": "",
    "title": "Michigan GOP governor candidate says rape victims shouldn't have abortions",
    "sentiment": "-0.5"
  },
  {
    "id": 949,
    "mediaId": 19,
    "date": "d2022-02-25T00:00",
    "sentence": "The poll found that Craig holds 32 percent of the vote, with the closest Republican candidate being <span class='selected-term'>Garrett Soldano</span> with only ten percent of the vote.",
    "author": "Jacob Bliss",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Wide Lead over Republican Rivals",
    "sentiment": "0.0"
  },
  {
    "id": 924,
    "mediaId": 19,
    "date": "d2022-04-01T00:00",
    "sentence": "Former Detroit Police Chief James Craig is leading his closest opponent, <span class='selected-term'>Garrett Soldano</span>, by 17 points in the Republican primary race for Michigan governor, according to a polling memo released Friday.",
    "author": "Ashley Oliver",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Double-Digit Lead in Michigan Governor's Primary",
    "sentiment": "0.0"
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "d2022-04-02T10:00",
    "sentence": "As for the others, Kalamazoo chiropractor <span class='selected-term'>Garrett Soldano</span> is on a spring break vacation with his two young sons and is unable to attend, and Michigan State Police Capt.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know",
    "sentiment": "0.0"
  },
  {
    "id": 917,
    "mediaId": 157,
    "date": "d2022-04-07T00:00",
    "sentence": "There are 12 Republicans running for the GOP nomination in the August primary, including chiropractor <span class='selected-term'>Garrett Soldano</span>, right-wing commentator Tudor Dixon, former Detroit Police Chief James Craig, businessman Perry Johnson and businessman Kevin Rinke.",
    "author": "Allison R. Donahue",
    "title": "Whitmer files suit to enshrine abortion rights, asks Michigan Supreme Court to take the case",
    "sentiment": "0.0"
  },
  {
    "id": 901,
    "mediaId": 157,
    "date": "d2022-04-19T00:00",
    "sentence": "Mike Brown; businesswomen Donna Brandeburg and Tudor Dixon; businessman Perry Johnson; real estate agent Ryan Kelley; financial advisor Michael Markey; pastor Ralph Rebandt, businessman Kevin Rinke; and chiropractor <span class='selected-term'>Garrett Soldano</span>.",
    "author": "Bob Brigham",
    "title": "Meatgrinder' GOP Gov. primary in Michigan will leave nominee broke, bloodied, and disliked': expert",
    "sentiment": "0.0"
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "d2022-04-19T18:39",
    "sentence": "Mike Brown, of Stevensville, who submitted 21,837 signatures last Tuesday;\nNorton Shores businesswoman Tudor Dixon, who submitted 29,735 signatures Tuesday;\nOakland County \"quality guru\" and businessman Perry Johnson, who submitted close to 23,000 signatures Tuesday;\nOttawa County real estate agent Ryan Kelley, who filed 20,100 signatures last Wednesday;\nGrand Haven financial adviser Michael Markey, who submitted 21,862 signatures March 18;\nFarmington Hills pastor Ralph Rebandt, who turned in 16,342 signatures last Tuesday;\nBloomfield Hills businessman Kevin Rinke, who filed 21,000 signatures on Monday, and\nKalamazoo chiropractor <span class='selected-term'>Garrett Soldano</span>, who was the first to turn in his petition, when he submitted 20,200 signatures Jan. 19.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says",
    "sentiment": "0"
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "d2022-04-22T00:00",
    "sentence": "Also in the running are chiropractor <span class='selected-term'>Garrett Soldano</span>, Michigan State Police Captain Mike Brown, and five others.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22",
    "sentiment": "0.0"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "d2022-04-25T00:00",
    "sentence": "Also in the running are chiropractor <span class='selected-term'>Garrett Soldano</span>, Michigan State Police Captain Mike Brown, and five others.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid",
    "sentiment": "0.0"
  },
  {
    "id": 886,
    "mediaId": 43,
    "date": "d2022-04-25T00:00",
    "sentence": "He was the former chair of the Antrim Republican Party and promotes the BIG LIE and is a supporter of <span class='selected-term'>Garrett Soldano</span>!",
    "author": "",
    "title": "'Trucker Randy' gives truckers a bad name with racist podcast claim",
    "sentiment": "0.0"
  },
  {
    "id": 4136,
    "mediaId": 238,
    "date": "d2022-05-03T11:19",
    "sentence": "In January, <span class='selected-term'>Garrett Soldano</span>, a Michigan gubernatorial candidate, told a podcast host that rape victims shouldnt have abortions because the baby inside them may be the next president.?\nAnother lawmaker said last month that a baby born after a rape could be an opportunity? for the victim.",
    "author": "",
    "title": "Florida lawmaker says abortion bans help sex-trafficking victims escape",
    "sentiment": "0"
  },
  {
    "id": 861,
    "mediaId": 19,
    "date": "d2022-05-06T00:00",
    "sentence": "Craig is the current frontrunner in the Republican primary, but the primary field is packed with other candidates, including chiropractor <span class='selected-term'>Garrett Soldano</span>, businessman Perry Johnson, real estate broker and activist Ryan Kelley, conservative commentator Tudor Dixon, and former car dealership owner Kevin Rinke.",
    "author": "Ashley Oliver",
    "title": "Poll: Michigan Democrat Gretchen Whitmer Trails Republican on Generic Ballot for Governor's Race",
    "sentiment": "0.0"
  },
  {
    "id": 3293,
    "mediaId": 261,
    "date": "d2022-05-12T20:36",
    "sentence": "More:Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says\nCandidates James Craig, Perry Johnson, Ryan Kelley, Kevin Rinke and <span class='selected-term'>Garrett Soldano</span> made the cut, according to a news release.",
    "author": "Dave Boucher",
    "title": "Detroit chamber limits field for Michigan GOP gubernatorial debate in June on Mackinac",
    "sentiment": "0.0"
  },
  {
    "id": 3292,
    "mediaId": 261,
    "date": "d2022-05-13T01:52",
    "sentence": "Mike Brown, of Stevensville; Norton Shores businesswoman Tudor Dixon; Oakland County \"quality guru\" and businessman Perry Johnson; Ottawa County real estate agent Ryan Kelley; Grand Haven financial adviser Michael Markey; Rebandt; Bloomfield Hills businessman Kevin Rinke; and Kalamazoo chiropractor <span class='selected-term'>Garrett Soldano</span>.",
    "author": "Paul Egan",
    "title": "Higher education funding highlights divisions among GOP candidates for governor at debate",
    "sentiment": "0.0"
  },
  {
    "id": 3455,
    "mediaId": 19,
    "date": "d2022-05-16T00:00",
    "sentence": "Former Detroit Police Chief James Craig is leading his closest opponent, <span class='selected-term'>Garrett Soldano</span>, by 17 points in the Republican primary race for Michigan governor, according to a polling memo released Friday.",
    "author": "Ethan Letkeman",
    "title": "Exclusive  She Has Failed Miserably: Former Detroit Police Chief James Craig on Democrat Gov. Gretchen Whitmer",
    "sentiment": "0.0"
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "d2022-05-23T22:03",
    "sentence": "Those qualifying for the ballot would be Dixon, a former conservative TV news host who netted the DeVos family endorsement earlier Monday; chiropractor and grass-roots activist <span class='selected-term'>Garrett Soldano</span>; wealthy self-funding businessman Kevin Rinke; real estate broker and anti-coronavirus lockdown activist Ryan Kelley; and pastor Ralph Rebandt.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures",
    "sentiment": "0.0"
  },
  {
    "id": 7473,
    "mediaId": 157,
    "date": "d2022-05-24T00:00",
    "sentence": "Businessman Kevin Rinke, chiropractor <span class='selected-term'>Garrett Soldano</span>, far-right activist Ryan Kelley and the Rev.",
    "author": "",
    "title": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race",
    "sentiment": "0.0"
  },
  {
    "id": 7300,
    "mediaId": 261,
    "date": "d2022-05-24T02:09",
    "sentence": "Also on the ballot, and suddenly in much stronger positions, are:Ottawa County real estate agent Ryan Kelley; Farmington Hills pastor Ralph Rebandt; Bloomfield Hills businessman Kevin Rinke, and Kalamazoo chiropractor <span class='selected-term'>Garrett Soldano</span>.",
    "author": "Paul Egan",
    "title": "State elections report: James Craig and Perry Johnson filed too few signatures for ballot",
    "sentiment": "0.0"
  }
]