[
  {
    "id": 1000,
    "mediaId": 237,
    "date": "2022-00-01",
    "sentence": "Abortion remarks by <span class='selected-term'>Garrett Soldano</span>, a Republican candidate for Michigan governor, went viral, creating controversy in a crowded gubernatorial primary race.",
    "author": "Kate Scanlon",
    "title": "Republican candidate for Michigan governor sparks abortion controversy",
    "sentiment": "-0.602"
  },
  {
    "id": 1001,
    "mediaId": 124,
    "date": "2022-00-01",
    "sentence": "",
    "author": "",
    "title": "Michigan GOP governor candidate says rape victims shouldn't have abortions, baby might be 'next president'",
    "sentiment": "0.0"
  },
  {
    "id": 1002,
    "mediaId": 238,
    "date": "2022-00-01",
    "sentence": "When <span class='selected-term'>Garrett Soldano</span> was asked on a right-wing podcast how he would ensure the sanctity of life? in Michigan, the Republican candidate for governor said he would stop at nothing to protect a fetus.",
    "author": "",
    "title": "Mich. GOP governor candidate said rape victims shouldn't have abortions: Baby inside them may be the next president'",
    "sentiment": "-0.905"
  },
  {
    "id": 937,
    "mediaId": 169,
    "date": "2022-00-02",
    "sentence": "In the same state, Republican gubernatorial candidate <span class='selected-term'>Garrett Soldano</span> said rape victims should not be allowed abortions, but instead should be told to be happy because, \"God put them in this moment\" and that we should \"protect that DNA\" instead.",
    "author": "Amanda Marcotte",
    "title": "Why aren't Republicans worried their fanatical culture war will hurt them in the midterms?",
    "sentiment": "0.0"
  },
  {
    "id": 998,
    "mediaId": 43,
    "date": "2022-00-02",
    "sentence": "On April Moss' right-wing podcast Face The Facts, <span class='selected-term'>Garrett Soldano</span>, a chiropractor and candidate for Michigan governor, said: We must focus on ... defending the DNA when it's created,? adding that women need to understand and know how heroic they are, and how unbelievable they are, that God put them in that moment.?\nSoldano argued that abortions should not be considered for survivors because they don't know if that baby inside of them could be the next president.?\nHe even shared a story of an alleged mentor who found out later in life that his birth mother had been raped by several men in a subway station.",
    "author": "",
    "title": "Michigan GOP governor candidate says rape victims shouldn't have abortions",
    "sentiment": "-0.5"
  },
  {
    "id": 879,
    "mediaId": 120,
    "date": "2022-00-28",
    "sentence": "The Ohioan described such pregnancies as inconvenient.?\nAs we've discussed, it was a few months later when <span class='selected-term'>Garrett Soldano</span>, a GOP gubernatorial candidate also said he'd oppose rape exceptions for abortion bans.",
    "author": "Steve Benen",
    "title": "Ohio Republican sees pregnancy after rape as an opportunity'",
    "sentiment": "0.0"
  }
]