{
  "id": 1335,
  "mediaId": 129,
  "date": "2/19/2022 12:00:00 AM",
  "headline": "Site Information Navigation",
  "image": "https://static01.nyt.com/images/2022/02/19/opinion/19Coaston-image/19Coaston-image-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/19/opinion/kandiss-taylor-jesus.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2429,
    2429,
    1689,
    1689,
    1740,
    1740,
    1181,
    1181,
    1147,
    1147,
    428,
    428,
    2672,
    2672
  ],
  "sentences": [
    "More recent presidential campaigns have relied on slogans that seem more illusory, the ideas compressed and minimized into phrases that act more as talismans than as promises  Jesse Jackson's Keep hope alive? or Barack Obama's Yes we can.?\nPerformative religiosity is just as old hat.",
    "I'm reminded of Matthew 6:5-6, in which Jesus explains to his disciples how to pray, telling them that there is no need to do so publicly, showing off their religious devotion for the purpose of garnering attention (or polarizing the people around them).",
    "It's enough to flash a cultural symbol for being the right kind of Christian.? And you certainly don't need to prove your knowledge of Scripture or your adherence to the actual faith painstakingly described in it.",
    "Suffice it to say, faith is hard  faith in the unseen, faith in something that encourages you to act against your first instinct, faith that, no matter what you want to do, tells you what you should do instead.",
    "A lot of people mocked the bus online, seeing as Jesus, Guns, Babies? doesn't exactly make, you know, sense on its own (a friend joked that it sounded like Jesus was heaving babies out of a cannon).",
    "Some will see the word and pump their fist in agreement with what they perceive it to mean  the equivalent of putting a Go Blue? sticker on your bumper or waving a Red Sox flag at a baseball game.",
    "Saying nobody reads the Bible more than me? doesn't tell me if you've grappled with the Psalms or contemplated your own sins or spent a dark night of the soul wondering what God thinks of you.",
    "In the Republican primary in Georgia, religious faith  the faith I share, or at least, I might share  evidently isn't meant to be followed or abided by or lived or rejected or challenged.",
    "It was like the time he told the MSNBC host Chris Matthews that women who have abortions should receive some form of punishment,? a viewpoint that even anti-abortion groups resisted.",
    "I believe that Jesus Christ is the Son of God, the savior of all, who was born to the Virgin Mary and suffered and died on the cross at Calvary for the sake of the sins of humanity.",
    "And your Father, who sees what is done in secret, will reward you.? And, I would guess (but never assume), that these instructions include Don't put Jesus' name on a campaign bus.?",
    "I read the Bible regularly (from Genesis to Revelation to the Acts of the Apostles, my favorite book of the Bible) and I think a lot about my faith and its role in my life.",
    "I believe he then rose from the grave, and as the Nicene Creed, an ancient statement of faith, puts it, he will come again in glory to judge the living and the dead.",
    "A campaign based entirely on Jesus, Guns, Babies? sounds like a parody, like what a TV writer would think a Georgia Republican voter wants  a little too on the nose.",
    "It is not hard to be a Christian in America since the majority of Americans identify as Christian and virtually every public institution bends over backward for us.",
    "Woodrow Wilson ran for re-election in 1916 with the line, He kept us out of war.? And while the claim eventually turned false, it was at least a clear argument.",
    "But it is hard to live a Christian life  to exist as a person who has a belief in an eternal savior but spends a lot of time wondering what that really means.",
    "Others will shake their heads, and both sides wind up pushed further apart for no reason whatsoever except that performative religiosity is polarizing.",
    "The Bible is the story of people being people  at their best, worst and most mindbendingly irritating (see: Aaron and the golden calf.)",
    "On Thursday, I saw tweets featuring the debut of a campaign bus for Kandiss Taylor, a Republican candidate for governor of Georgia.",
    "In 2016, Trump said, Nobody reads the Bible more than me,? and he accused Secretary of State John Kerry of having never read it.",
    "This is what our politics has become: We're often just fans of a party  or even a religion  not believers in actual tenets.",
    "We wave our giant foam hands and chant the cheers without really having any idea what we're saying or why we're saying it.",
    "In a way, it's so honest about how dumb our political process has become  how crass and empty  that I almost admire it.",
    "It's a posture we all recognize and understand, but it's ultimately meaningless outside of weak political hand waving.",
    "Few people were more adept at understanding the power of displaying belief for political reasons than Donald Trump.",
    "With that list, she's not even pretending to have read Scripture or to have engaged with Christianity in any way.",
    "She is an example of how a lot of the biggest things that spark polarization in this country are performative.",
    "Polling at 3 percent, Taylor's not a major factor in the race, but I am fascinated by what she represents.",
    "But when you pray, go into your inner room, shut your door, and pray to your Father, who is unseen.",
    "As someone who has covered politics, I can appreciate the brutal simplicity of Taylor's messaging.",
    "For they love to pray standing in the synagogues and on the street corners to be seen by men.",
    "I believe that as much as I believe that the sun will rise in the east and set in the west.",
    "No further explanation needed, or perhaps more accurately, no further explanation given.",
    "It is emblazoned with what is evidently her platform: Jesus, Guns, Babies.? That's it.",
    "Did any of us think it was possible that Trump had wrestled with such questions?",
    "No one can learn anything about Jesus Christ from that campaign bus.",
    "Christ tells them: And when you pray, do not be like the hypocrites.",
    "She's got three words, and that's all she thinks she owes voters.",
    "But somehow, Taylor and her bus seem like a new nadir.",
    "Putting the word Jesus? on a campaign bus is not hard.",
    "Truly I tell you, they already have their full reward.",
    "Sloganeering is not new to politics, of course.",
    "Instead, it's a cudgel, waved at passers-by.",
    "Either you're in the club, or you're not.",
    "But as a Christian, I'm  depressed by it.",
    "It reminds me of being at a big game.",
    "And it is not an exercise in faith.",
    "She's even got the bus ready.",
    "She's on Team Jesus.",
    "No matter."
  ]
}