{
  "id": 1739,
  "mediaId": 129,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "A War for the Minds of Our Children'",
  "image": "https://static01.nyt.com/images/2022/05/04/opinion/04blow1/04blow1-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/04/opinion/republicans-parental-rights.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1646,
    1650,
    1842,
    1850,
    2095,
    2213,
    3082,
    428,
    2672
  ],
  "sentences": [
    "Maybe the fact that the Supreme Court seems poised to overturn Roe v. Wade will dramatically alter the outcome of this year's elections, pushing women  including many of the suburban white women Republicans are so desperate to win over  to vote against the Republicans in protest.",
    "Elect me governor of Georgia, and I will bring the Satanic Regime to its knees.?\nAs ominous music plays in the background, she shifts from satanic cabals to human sacrifice, saying: Back in biblical times, human sacrifice was a form of demonic worship.",
    "and comprehensive sex education teaching transgender perversion to our children,? she said, referring to critical race theory and social-emotional learning, we also have anti-white racism that has not been addressed by the current administration.",
    "I'm not sure that liberals and Democrats fully appreciate the degree to which Republicans are promoting parental rights as a way of wooing back some of the suburban white women who strayed from the party during the Trump years.",
    "There was even a reference to the communist, liberal, leftist agenda of the Green New Deal.? (One candidate suggested that the government was pushing Chinese solar panels on Georgia farmers as part of its communist? agenda.)",
    "There were five candidates onstage during the debate, and four of the five  including the sitting governor, Brian Kemp, and his chief competitor, former Senator David Perdue  rattled on about classroom indoctrination.",
    "It's just a different time.?\nShe is endorsed by Mike Lindell, the Trump-supporting MyPillow C.E.O., and L. Lin Wood, the Trump lawyer who spun ludicrous conspiracies about the 2020 election being stolen from Trump.",
    "In her closing comments, Taylor ratcheted up her inflammatory language: We're going to ensure that boys aren't in our girls' bathrooms and girls aren't in our boys' bathrooms, and people aren't being raped.",
    "It might be tempting to laugh off people like Taylor as fringe candidates and thinkers, but Republicans have a way of folding those people's ideas  scrubbed of the originators' taint  into the mainstream.",
    "When they're trying to teach first graders about gender choice, that's the thing that we've got to stand up to.?\nAnother candidate, Kandiss Taylor, an educator herself, went further still.",
    "But instead of being met with praise and stickers, they are met by an electorate in which an alarming number frowns on fact and is electrified by emotions  fear, anger and envy.",
    "We have a fraudulent pedophile in the White House because Governor Kemp failed.? The idea that Satan-worshiping pedophiles are running the country is a central belief of QAnon.",
    "We're going to get back to being moral in Georgia.?\nAs a white woman, and mother of three, Taylor is in the demographic that Republicans are trying to attract.",
    "The day after the debate, Taylor tweeted a video with a caption that read in part: I am the ONLY candidate bold enough to stand up to the Luciferian Cabal.",
    "Some promoted the lie that Donald Trump had won in 2020 and called for tighter election security (another way of articulating a desire to suppress votes).",
    "The question will be whether the oppression of women's rights will outweigh what the Republicans are pushing: oppression as a parental right.",
    "That we protect them from obscene materials and a lot of the other things.?\nPerdue followed up by going even further: Right now, the No.",
    "1 thing we can do for our teachers and our parents and most of all our children is to get the woke mob out of our schools in Georgia.",
    "As Kemp put it: We're going to make sure that we pass a bill this year that our kids aren't indoctrinated in the classroom.",
    "Georgia's race for governor perfectly captures the degree to which the classroom has become a conservative battleground.",
    "But Republicans are more than a year into this parental rights campaign, so I doubt their strategy will be much altered.",
    "And we're going to get rid of kindergarten teachers  men with beards and lipstick and high heels  teaching our children.",
    "But it is a practice that conservatives view with suspicion, thinking it could abet lessons about race and gender.",
    "During the debate, she chastised Kemp for not contesting the 2020 results in Georgia, saying: Donald Trump won.",
    "On Sunday, the Republican candidates gathered for their third and final debate before the May 24 primary.",
    "But, more than anything else, the supposed indoctrination of children in schools took center stage.",
    "Democrats wave their list of policies at voters like a self-satisfied child waves their homework.",
    "Several railed against Covid mandates (especially masks) and stoked fears of rising crime.",
    "There were the obligatory mentions of the woke mob? and random mentions of George Soros.",
    "is a teaching technique that, research suggests, can boost academic performance.",
    "Even when the messenger is wrong, the party often views the message as right.",
    "The Times is committed to publishing a diversity of letters to the editor.",
    "Their empathy might grow, and with it a better understanding of others.",
    "But she is also a near-perfect encapsulation of the party's fringe.",
    "We'd like to hear what you think about this or any of our articles.",
    "God forbid children should become more emotionally intelligent.",
    "In that way, I can understand why it would unnerve oppressors.",
    "It has taken over our schools, and it's ruining the students.",
    "We're still doing it, in present day, by killing our unborn.",
    "It could affect not only party alignments, but also turnout.",
    "We have a war for the minds of our children.",
    "I mean, that's what's happening right now.",
    "And here's our email: letters@nytimes.com.",
    "It's ruining the environment.?\nS.E.L.",
    "It's the same sacrifice.",
    "We not only have C.R.T.",
    "It's the same demons.",
    "Here are some tips.",
    "It's the same sin.",
    "and S.E.L.",
    "He won.",
    "Maybe."
  ]
}