{
  "id": 2109,
  "mediaId": 19,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Georgia Poll: Brian Kemp Has Wide Lead over David Perdue in Governor's Primary",
  "image": "https://media.breitbart.com/media/2022/02/GettyImages-1058497456-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/13/georgia-poll-brian-kemp-has-wide-lead-over-david-perdue-in-governors-primary/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1646,
    1646,
    1147,
    1147,
    1248,
    1248,
    2095,
    2355,
    2355,
    1951,
    2095,
    1951,
    234,
    234,
    428,
    428,
    571,
    501,
    501,
    571,
    2672,
    2661,
    2661,
    2672
  ],
  "sentences": [
    "The memo warned, A costly runoff would be devastating for the Republican Party ahead of what will surely be a bruising general election versus Stacey Abrams.? Abrams, who narrowly lost to Kemp in the 2018 gubernatorial race, is the uncontested Democrat candidate the winner of the Republican primary will face in the general election.",
    "Perdue launched his campaign against Kemp in December and was quickly endorsed by former President Donald Trump, who has weighed in heavily on Georgia's primary races with the ultimate mission of unseating Kemp, whom Trump has targeted over Georgia's 2020 election process.",
    "The poll was conducted about two weeks ago, March 3031, among 824 likely Republican primary voters and found Kemp receiving 49 percent support compared to Perdue's 33 percent support, while 12 percent of respondents said they were undecided.",
    "Other top issues were growing the economy and bringing more jobs to Georgia? at 22 percent, making healthcare more affordable? at 17 percent, improving education? at 11 percent, and stopping illegal immigration? at eight percent.",
    "Another recent poll, taken by Emerson College Polling and the Hill, had found Kemp farther away from the 50 percent mark and in a more vulnerable position in the event of a runoff.",
    "The poll's findings are significant in that Kemp could potentially avoid a runoff election, which would occur if a candidate does not attain 50 percent of the vote in the primary.",
    "The polling memo was published by Cygnal and first provided to the Atlanta Journal-Constitution by Hardworking Georgians, which the outlet described as a pro-Kemp group.",
    "Kandiss Taylor, who is running to the right of both candidates, received five percent support, and another Republican candidate, Catherine Davis, received one percent.",
    "Brian Kemp has a commanding 16-point lead over former Sen. David Perdue in Georgia's Republican gubernatorial primary, according to a polling memo released Tuesday.",
    "That poll also asked respondents about priority issues and revealed combatting inflation and lowering gas prices? was the number one issue, receiving 23 percent.",
    "The general election poll found Kemp ahead of Abrams by six points, 50 percent to 44 percent, and Perdue trailing Abrams by one point, 47 percent to 48 percent.",
    "The primary poll had a margin of error of plus or minus 3.36 percent, and the general election poll had a margin of error of plus or minus 3.44 percent.",
    "The Cygnal poll painted a more optimistic picture for Kemp, showing that in the case of a runoff between Kemp and Perdue, the governor led by 15 points.",
    "A second Cygnal poll, conducted April 69 among 800 likely general election voters, measured Kemp's and Perdue's winnability against Abrams.",
    "The Cygnal poll noted the Trump effect is baked in? as 87 percent of Republican voters were aware that Trump was backing Perdue.",
    "That poll found that if Kemp and Perdue faced off in a runoff, Kemp led Perdue by a slim margin of five points.",
    "The primary takes place on May 24, and early voting begins in less than a month, on May 2.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "Follow her on Twitter at @asholiver.",
    "Gov."
  ]
}