[
  {
    "id": 84,
    "mediaId": 43,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "So far, Trump has endorsed primary opponents for at least five of them, including Gonzalez (who's retiring), Reps. Liz Cheney of Wyoming, Jaime Herrera Beutler of Washington, and <span class='selected-term'>Peter Meijer</span> and Fred Upton of Michigan, who serve neighboring districts on the west side of the state.",
    "author": "",
    "title": "Ten House Republicans voted to impeach Trump. Some then fell silent while others spoke up"
  },
  {
    "id": 85,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Representatives Jaime Herrera Beutler of Washington, <span class='selected-term'>Peter Meijer</span> of Michigan and Fred Upton of Michigan have Trump-endorsed primary challengers on their heels and uncertain political futures.",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6"
  },
  {
    "id": 80,
    "mediaId": 124,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Share this -\nAllan Smith\n9h ago / 8:32 PM UTC\nGOP Rep. who voted to impeach Trump shares video of House evacuation\nRep. <span class='selected-term'>Peter Meijer</span>, R-Mich., posted to Twitter a video he shot from the House gallery as the chamber was being evacuated during the Capitol riot.",
    "author": "",
    "title": "Jan. 6 Capitol riot: Full anniversary coverage"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>\nMeijer, Upton's Michigan colleague, cast his impeachment vote just days after being sworn in for his first term in Congress.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 60,
    "mediaId": 237,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "It just doesn't seem productive,? Michigan Republican Rep. <span class='selected-term'>Peter Meijer</span> told the Washington Examiner.",
    "author": "Emily Brooks",
    "title": "Republican National Committee censures Liz Cheney and Kinzinger"
  },
  {
    "id": 58,
    "mediaId": 19,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "Chambers is a frequent donor to the Republican National Committee (RNC), as well as moderates such as Rep. <span class='selected-term'>Peter Meijer</span> (R-MI), Sen. Lisa Murkowski (R-AK), and Rep. Adam Kinzinger (R-IL).",
    "author": "John Binder",
    "title": "Political Establishment with Obama, Lincoln Project Ties Spending Millions Against Mo Brooks"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.) faces John Gibbs, a former Trump administration official.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 25,
    "mediaId": 233,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Trump has also vowed revenge on the other GOP impeachment supporters: Rep. Tom Rice of South Carolina, Jaime Herrera Beutler of Washington, Dan Newhouse of Washington, <span class='selected-term'>Peter Meijer</span> of Michigan and David Valadao of California.",
    "author": "David Jackson",
    "title": "Rep. Fred Upton - another Donald Trump Republican impeacher - announces his retirement"
  }
]