[
  {
    "id": 87,
    "mediaId": 43,
    "date": "d2022-01-04T00:00",
    "sentence": "? MI-03: Republican Rep. <span class='selected-term'>Peter Meijer</span> announced last week that he would defend the newly drawn 3rd District, which Michigan's new map transforms from a 51-47 Trump seat to a constituency Joe Biden would have carried 53-45.",
    "author": "",
    "title": "Morning Digest: Redistricting scrambled California's House map. Here's our guide to unscrambling it",
    "sentiment": "0.0"
  },
  {
    "id": 76,
    "mediaId": 120,
    "date": "d2022-01-17T13:40",
    "sentence": "As for the rest of the contingent  Washington's Jaime Herrera Beutler, Wyoming's Liz Cheney, Michigan's <span class='selected-term'>Peter Meijer</span>, Washington's Dan Newhouse, South Carolina's Tom Rice, and California's David Valadao  each appear to be running for re-election this year.",
    "author": "Steve Benen",
    "title": "Another GOP member of the Impeachment 10 heads for the exits",
    "sentiment": "0.0"
  },
  {
    "id": 64,
    "mediaId": 124,
    "date": "d2022-02-02T02:59:38",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>, R-Mich., brought in eight times what his Trump-endorsed primary challenger secured last quarter, while Rep. Fred Upton, R-Mich., raised more than five times what Trump-backed state Rep. Steve Carra brought in from October through December.",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul",
    "sentiment": "0.0"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "d2022-02-24T00:00",
    "sentence": "Leader McCarthy is very astute, sharp and savvy,? said Representative <span class='selected-term'>Peter Meijer</span> of Michigan, another of the 10 Republicans who voted to impeach Mr. Trump.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker",
    "sentiment": "0.0"
  },
  {
    "id": 48,
    "mediaId": 151,
    "date": "d2022-03-03T12:56",
    "sentence": "Freshman Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.), a veteran told Olivia that the veteran community is incensed? and that failing to mention the conclusion of a 20-year conflict could be an encouraging sign for the Taliban.Think of the message that sends to the Taliban,? he added, noting how the extremists are blocking SIVs from leaving the country now.",
    "author": "Hope springs eternal",
    "title": "Hope springs eternal on Dems' domestic dreams",
    "sentiment": "0.0"
  },
  {
    "id": 38,
    "mediaId": 237,
    "date": "d2022-03-23T21:02",
    "sentence": "That's nothing new  same thing happened last time.?\nTrump has come out against GOP Reps. Nancy Mace and Tom Rice of South Carolina, Jaime Herrera Beutler of Washington, and <span class='selected-term'>Peter Meijer</span> of Michigan, among others.",
    "author": "Juliegrace Brufke",
    "title": "Kevin McCarthy not worried about Trump endorsements in GOP primaries",
    "sentiment": "0.0"
  }
]