[
  {
    "id": 85,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Representatives Jaime Herrera Beutler of Washington, <span class='selected-term'>Peter Meijer</span> of Michigan and Fred Upton of Michigan have Trump-endorsed primary challengers on their heels and uncertain political futures.",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>\nMeijer, Upton's Michigan colleague, cast his impeachment vote just days after being sworn in for his first term in Congress.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 64,
    "mediaId": 124,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>, R-Mich., brought in eight times what his Trump-endorsed primary challenger secured last quarter, while Rep. Fred Upton, R-Mich., raised more than five times what Trump-backed state Rep. Steve Carra brought in from October through December.",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul"
  },
  {
    "id": 67,
    "mediaId": 43,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Freshman Rep. <span class='selected-term'>Peter Meijer</span> of Michigan, another Trump target, raised $530,000, which far outpaced the $51,000 that his Trump-backed challenger John Gibbs raised after entering the race in early November.",
    "author": "",
    "title": "Liz Cheney and other Trump targets trounce his endorsees in the fundraising race"
  },
  {
    "id": 61,
    "mediaId": 165,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "NBC News points out that Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.) hauled in over eight times what his Trump-endorsed challenger did in the fourth quarter.",
    "author": "William Vaillancourt",
    "title": "Republicans Who Voted to Impeach Trump Are Fundraising Laps Around Their MAGA Primary Opponents"
  },
  {
    "id": 33,
    "mediaId": 675,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Both inherited family fortunes, to which few can relate: RINO Fred Upton is an heir to the Whirlpool washing machine fortune, while his fellow pro-impeachment Republican <span class='selected-term'>Peter Meijer</span> benefits from his ancestors' supermarket chain wealth.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!"
  },
  {
    "id": 34,
    "mediaId": 675,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "Both inherited family fortunes, to which few can relate: RINO Fred Upton is an heir to the Whirlpool washing machine fortune, while his fellow pro-impeachment Republican <span class='selected-term'>Peter Meijer</span> benefits from his ancestors' supermarket chain wealth.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.) faces John Gibbs, a former Trump administration official.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 24,
    "mediaId": 238,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "and <span class='selected-term'>Peter Meijer</span> (Mich.)  face tough primary challenges.",
    "author": "Amy B Wang",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection"
  },
  {
    "id": 25,
    "mediaId": 233,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Trump has also vowed revenge on the other GOP impeachment supporters: Rep. Tom Rice of South Carolina, Jaime Herrera Beutler of Washington, Dan Newhouse of Washington, <span class='selected-term'>Peter Meijer</span> of Michigan and David Valadao of California.",
    "author": "David Jackson",
    "title": "Rep. Fred Upton - another Donald Trump Republican impeacher - announces his retirement"
  },
  {
    "id": 26,
    "mediaId": 261,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Also voting to impeach was U.S. Rep. <span class='selected-term'>Peter Meijer</span>, R-Grand Rapids, who is running for reelection this year despite Trump's endorsement of another candidate, John Gibbs.",
    "author": "Todd Spangler",
    "title": "Rep. Fred Upton announces retirement from Congress, has been in US House since 1987"
  },
  {
    "id": 27,
    "mediaId": 238,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "and <span class='selected-term'>Peter Meijer</span> (Mich.)  face tough primary challenges.",
    "author": "",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection"
  },
  {
    "id": 18,
    "mediaId": 151,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "I think there's always a strong benefit to having people who can reach back and say, You know what, I remember when this happened 20 years ago,'? said first-term Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.), pointing to Katko's and Upton's wisdom and sage experience.?\nBut he added that as much as his departing colleagues will be missed, the ebb and flow of retirements and new additions helps prevent the body from becoming stagnant.",
    "author": "",
    "title": "Seeking: GOP dealmakers who won't 'burn the House down'. Apply to: Kevin McCarthy."
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Friday, Apr 22, 2022  11:30:12 AM Pacific Daylight Time  Jeff Singer\nMI-03: Rep. <span class='selected-term'>Peter Meijer</span>, who was one of the 10 House Republicans to vote to impeach Trump, faces primary opposition from conservative commentator John Gibbs, who is Trump's endorsed candidate.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22"
  }
]