[
  {
    "id": 68,
    "mediaId": 163,
    "date": "2022-00-01",
    "sentence": "Scalise gave money in September to at least three House members who voted to impeach Trump: <span class='selected-term'>Peter Meijer</span> of Michigan and Jaime Herrera Beutler of Washington state - who are both facing Trump-endorsed challengers - as well as David Valadao of California.",
    "author": "Alexandra Ulmer",
    "title": "Republican U.S. lawmakers funnel money to colleagues who crossed Trump",
    "sentiment": "0.0"
  },
  {
    "id": 71,
    "mediaId": 43,
    "date": "2022-00-01",
    "sentence": "Tuesday, Feb 1, 2022  11:10:41 AM Pacific Standard Time  Jeff Singer\nMI-03: 2020 Democratic nominee Hillary Scholten announced Tuesday that she would seek a rematch against Republican Rep. <span class='selected-term'>Peter Meijer</span> in Michigan's 3rd Congressional District, a Grand Rapids-based constituency that the state's new map transformed from a 51-47 Trump seat to one Joe Biden would have carried 53-45.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 2/1",
    "sentiment": "0.0"
  },
  {
    "id": 88,
    "mediaId": 151,
    "date": "2022-00-01",
    "sentence": " Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.)  Fiona Hill  Barton Gellman.",
    "author": "",
    "title": "POLITICO Playbook: Welcome to 2022",
    "sentiment": "0.0"
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "2022-00-02",
    "sentence": "Expect most of those locally who have been endorsed by Trump to be in attendance, though it's only certain that two others are speaking  U.S. Rep. Lisa McClain, R-Bruce Township, who represents the area where the rally is being held, and John Gibbs, a former Trump administration official who is running for the Republican nomination against U.S. Rep. <span class='selected-term'>Peter Meijer</span>, R-Grand Rapids, who also voted to impeach Trump.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know",
    "sentiment": "0.0"
  },
  {
    "id": 30,
    "mediaId": 261,
    "date": "2022-00-03",
    "sentence": "The former president also went after U.S. Rep. <span class='selected-term'>Peter Meijer</span>, R-Grand Rapids, who voted to impeach Trump for instigating the Jan. 6, 2021, attack on the U.S. Capitol.",
    "author": "Dave Boucher",
    "title": "Trump hammers at false claims of voter fraud in return to Michigan",
    "sentiment": "0.0"
  },
  {
    "id": 86,
    "mediaId": 147,
    "date": "2022-00-04",
    "sentence": "I mean, what does it  what do\n(CROSSTALK)\nRep. <span class='selected-term'>Peter Meijer</span>:\nYes, to clarify, when asked about whether  why there was the reversion back after January 6 to supporting Donald Trump, I said because individuals did not see an alternative, they did not see another path, not that there is no choice, but that we need to be creating the path.",
    "author": "",
    "title": "Death threats, primary challenge followed Rep. Meijer's vote to impeach Trump after Jan. 6",
    "sentiment": "0.68"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "2022-00-05",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.) faces John Gibbs, a former Trump administration official.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump",
    "sentiment": "0.0"
  },
  {
    "id": 24,
    "mediaId": 238,
    "date": "2022-00-05",
    "sentence": "and <span class='selected-term'>Peter Meijer</span> (Mich.)  face tough primary challenges.",
    "author": "Amy B Wang",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection",
    "sentiment": "0.0"
  },
  {
    "id": 26,
    "mediaId": 261,
    "date": "2022-00-05",
    "sentence": "Also voting to impeach was U.S. Rep. <span class='selected-term'>Peter Meijer</span>, R-Grand Rapids, who is running for reelection this year despite Trump's endorsement of another candidate, John Gibbs.",
    "author": "Todd Spangler",
    "title": "Rep. Fred Upton announces retirement from Congress, has been in US House since 1987",
    "sentiment": "0.0"
  },
  {
    "id": 27,
    "mediaId": 238,
    "date": "2022-00-05",
    "sentence": "and <span class='selected-term'>Peter Meijer</span> (Mich.)  face tough primary challenges.",
    "author": "",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection",
    "sentiment": "0.0"
  },
  {
    "id": 22,
    "mediaId": 151,
    "date": "2022-00-06",
    "sentence": "And in Michigan, Democrat Hillary Scholten, an immigration attorney, is seeking a rematch against GOP Rep. <span class='selected-term'>Peter Meijer</span> in a much bluer seat.",
    "author": "",
    "title": "Dem moderates get choosy in midterm recruits as GOP headwinds grow",
    "sentiment": "0.0"
  },
  {
    "id": 59,
    "mediaId": 195,
    "date": "2022-00-06",
    "sentence": "And two GOP freshmen  <span class='selected-term'>Peter Meijer</span> of Michigan and Nancy Mace in South Carolina  were among the few Republicans who sided against Trump in January of last year.",
    "author": "Albert Hunt",
    "title": "Midterm primaries might be critical to balance of the Senate",
    "sentiment": "0.0"
  },
  {
    "id": 81,
    "mediaId": 25,
    "date": "2022-00-06",
    "sentence": "Four other congressional candidates also attended Trump's rally: Audra Johnson, who's challenging Republican <span class='selected-term'>Peter Meijer</span> in Michigan's 3rd District, Annie Black in Nevada's 4th District, Jo Rae Perkins, a Republican Senate candidate in Oregon linked to the QAnon conspiracy group and Colorado State Representative Ron Hanks, who's running for Colorado's U.S. Senate seat.",
    "author": "Aaron Navarro",
    "title": "Over 30 people who rallied in Washington on January 6, 2021 are running for state and federal offices",
    "sentiment": "0.0"
  },
  {
    "id": 18,
    "mediaId": 151,
    "date": "2022-00-15",
    "sentence": "I think there's always a strong benefit to having people who can reach back and say, You know what, I remember when this happened 20 years ago,'? said first-term Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.), pointing to Katko's and Upton's wisdom and sage experience.?\nBut he added that as much as his departing colleagues will be missed, the ebb and flow of retirements and new additions helps prevent the body from becoming stagnant.",
    "author": "",
    "title": "Seeking: GOP dealmakers who won't 'burn the House down'. Apply to: Kevin McCarthy.",
    "sentiment": "0.0"
  },
  {
    "id": 42,
    "mediaId": 129,
    "date": "2022-00-15",
    "sentence": "It's grounding,? said Representative <span class='selected-term'>Peter Meijer</span>, Republican of Michigan, who was once an intelligence analyst in Afghanistan and now faces a challenger on his right endorsed by former President Donald J. Trump.",
    "author": "",
    "title": "Ukraine War Shifts the Agenda in Congress, Empowering the Center",
    "sentiment": "0.0"
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "2022-00-22",
    "sentence": "Friday, Apr 22, 2022  11:30:12 AM Pacific Daylight Time  Jeff Singer\nMI-03: Rep. <span class='selected-term'>Peter Meijer</span>, who was one of the 10 House Republicans to vote to impeach Trump, faces primary opposition from conservative commentator John Gibbs, who is Trump's endorsed candidate.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22",
    "sentiment": "0.0"
  },
  {
    "id": 8,
    "mediaId": 43,
    "date": "2022-00-22",
    "sentence": "And if you want to keep the gavel out of Kevin McCarthy's hands, this is the place to start.?\nThese 10 targeted U.S. House races are:\nAZ-01: David Schweikert (eastern Phoenix and suburbs)\nCA-22: David Valadao (southern Central Valley)\nCA-27: Mike Garcia (northern Los Angeles suburbs)\nCA-45: Michelle Steel (western Orange County)\nCO-08: OPEN (northern Denver suburbs)\nNC-13: OPEN (southern Raleigh suburbs)\nNE-02: Don Bacon (Omaha area)\nNY-01: OPEN (eastern Long Island)\nMI-03: <span class='selected-term'>Peter Meijer</span> (Grand Rapids area)\nNM-02: Yvette Herrell (southern New Mexico)\nThe Downballot comes out every Thursday everywhere you listen to podcasts.",
    "author": "",
    "title": "Highlights from The Downballot: Primaries heating up and why House Democrats should go on offense",
    "sentiment": "0.0"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "2022-00-22",
    "sentence": "Three more Trump-endorsed candidates running against Republican House members who voted to impeach Trump over Jan. 6 will have a spot on stage: Loren Culp, who is challenging Rep. Dan Newhouse of Washington state; former Housing and Urban Development official John Gibbs, who is challenging Rep. <span class='selected-term'>Peter Meijer</span> of Michigan; and Russell Fry, who is challenging Rep. Tom Rice of South Carolina.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores",
    "sentiment": "0.0"
  },
  {
    "id": 33,
    "mediaId": 675,
    "date": "2022-00-29",
    "sentence": "Both inherited family fortunes, to which few can relate: RINO Fred Upton is an heir to the Whirlpool washing machine fortune, while his fellow pro-impeachment Republican <span class='selected-term'>Peter Meijer</span> benefits from his ancestors' supermarket chain wealth.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!",
    "sentiment": "0.0"
  },
  {
    "id": 34,
    "mediaId": 675,
    "date": "2022-00-29",
    "sentence": "Both inherited family fortunes, to which few can relate: RINO Fred Upton is an heir to the Whirlpool washing machine fortune, while his fellow pro-impeachment Republican <span class='selected-term'>Peter Meijer</span> benefits from his ancestors' supermarket chain wealth.",
    "author": "Andy Schlafly",
    "title": "Trumpify the GOP  defeat all RINOs!",
    "sentiment": "0.0"
  }
]