[
  {
    "id": 85,
    "mediaId": 129,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Representatives Jaime Herrera Beutler of Washington, <span class='selected-term'>Peter Meijer</span> of Michigan and Fred Upton of Michigan have Trump-endorsed primary challengers on their heels and uncertain political futures.",
    "author": "",
    "title": "A Long, Hard Year for Republicans Who Voted to Impeach After Jan. 6"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>\nMeijer, Upton's Michigan colleague, cast his impeachment vote just days after being sworn in for his first term in Congress.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 68,
    "mediaId": 163,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Scalise gave money in September to at least three House members who voted to impeach Trump: <span class='selected-term'>Peter Meijer</span> of Michigan and Jaime Herrera Beutler of Washington state - who are both facing Trump-endorsed challengers - as well as David Valadao of California.",
    "author": "Alexandra Ulmer",
    "title": "Republican U.S. lawmakers funnel money to colleagues who crossed Trump"
  },
  {
    "id": 70,
    "mediaId": 881,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Michigan Rep. <span class='selected-term'>Peter Meijer</span> brought in more than a half-million dollarsten times the amount Trump-backed challenger John Gibbs brought in from the time he launched his campaign in early November through the end of 2021.",
    "author": "Cameron Joseph",
    "title": "Trump's Favorite Candidates Are Getting Crushed in Fundraising"
  },
  {
    "id": 73,
    "mediaId": 43,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>, R-Mich., brought in eight times what his Trump-endorsed primary challenger secured last quarter, while Rep. Fred Upton, R-Mich., raised more than five times what Trump-backed state Rep. Steve Carra brought in from October through December.",
    "author": "",
    "title": "Overnight News Digest February 1, 2022"
  },
  {
    "id": 64,
    "mediaId": 124,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>, R-Mich., brought in eight times what his Trump-endorsed primary challenger secured last quarter, while Rep. Fred Upton, R-Mich., raised more than five times what Trump-backed state Rep. Steve Carra brought in from October through December.",
    "author": "",
    "title": "Republicans who impeached Trump outpace challengers in latest fundraising haul"
  },
  {
    "id": 61,
    "mediaId": 165,
    "date": "2/3/2022 12:00:00 AM",
    "sentence": "NBC News points out that Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.) hauled in over eight times what his Trump-endorsed challenger did in the fourth quarter.",
    "author": "William Vaillancourt",
    "title": "Republicans Who Voted to Impeach Trump Are Fundraising Laps Around Their MAGA Primary Opponents"
  },
  {
    "id": 57,
    "mediaId": 238,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Reps. Dan Newhouse (Wash.) and <span class='selected-term'>Peter Meijer</span> (Mich.) are two other Republicans who voted for impeachment and look well placed to turn back Trump-backed challengers.",
    "author": "",
    "title": "Opinion: Republicans who voted to impeach Trump might be in less peril than people think"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "2/20/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.) is the only other member in a swing district  Biden carried his seat by 9 points.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Leader McCarthy is very astute, sharp and savvy,? said Representative <span class='selected-term'>Peter Meijer</span> of Michigan, another of the 10 Republicans who voted to impeach Mr. Trump.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.) faces John Gibbs, a former Trump administration official.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 11,
    "mediaId": 376,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "Michigan Rep. <span class='selected-term'>Peter Meijer</span> raised $553,000, compared to the $123,000 raised by opponent John Gibbs, a former acting assistant secretary in the Department of Housing and Urban Development in the Trump administration.",
    "author": "Herb Jackson",
    "title": "Trump targets outraise challengers, unlike some other incumbents"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "We turn next to Michigan's 3rd in the Grand Rapids area, where Trump's forces have consolidated behind conservative commentator John Gibbs' bid to deny renomination to freshman Rep. <span class='selected-term'>Peter Meijer</span> in August.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising"
  },
  {
    "id": 2,
    "mediaId": 163,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "* Versus U.S. Representative <span class='selected-term'>Peter Meijer</span>\n* Aug 2 Republican primary for Michigan's 3rd congressional district\nGibbs, a former housing official under Trump, saw his nomination to head the U.S. Office of Personnel Management flounder after lawmakers from both parties questioned his history of inflammatory tweets, including references to baseless conspiracy theories about Democrats and Satanism.",
    "author": "Reuters",
    "title": "Factbox: Trump's endorsement power faces test in key elections"
  }
]