[
  {
    "id": 86,
    "mediaId": 147,
    "date": "1/4/2022 12:00:00 AM",
    "sentence": "I mean, what does it  what do\n(CROSSTALK)\nRep. <span class='selected-term'>Peter Meijer</span>:\nYes, to clarify, when asked about whether  why there was the reversion back after January 6 to supporting Donald Trump, I said because individuals did not see an alternative, they did not see another path, not that there is no choice, but that we need to be creating the path.",
    "author": "",
    "title": "Death threats, primary challenge followed Rep. Meijer's vote to impeach Trump after Jan. 6"
  },
  {
    "id": 87,
    "mediaId": 43,
    "date": "1/4/2022 12:00:00 AM",
    "sentence": "? MI-03: Republican Rep. <span class='selected-term'>Peter Meijer</span> announced last week that he would defend the newly drawn 3rd District, which Michigan's new map transforms from a 51-47 Trump seat to a constituency Joe Biden would have carried 53-45.",
    "author": "",
    "title": "Morning Digest: Redistricting scrambled California's House map. Here's our guide to unscrambling it"
  },
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>, one of the Republicans who voted to impeach Trump over January 6, is also set to face a Trump-backed primary challenger.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP"
  },
  {
    "id": 84,
    "mediaId": 43,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "So far, Trump has endorsed primary opponents for at least five of them, including Gonzalez (who's retiring), Reps. Liz Cheney of Wyoming, Jaime Herrera Beutler of Washington, and <span class='selected-term'>Peter Meijer</span> and Fred Upton of Michigan, who serve neighboring districts on the west side of the state.",
    "author": "",
    "title": "Ten House Republicans voted to impeach Trump. Some then fell silent while others spoke up"
  },
  {
    "id": 75,
    "mediaId": 237,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>\nMeijer, Upton's Michigan colleague, cast his impeachment vote just days after being sworn in for his first term in Congress.",
    "author": "Kate Scanlon",
    "title": "A year later, where 10 House Republicans who voted to impeach Trump stand politically"
  },
  {
    "id": 63,
    "mediaId": 151,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Fellow Michigan Republican Rep. <span class='selected-term'>Peter Meijer</span> raised $529,000.",
    "author": "",
    "title": "House Republicans close money gap in hunt for the majority"
  },
  {
    "id": 60,
    "mediaId": 237,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "It just doesn't seem productive,? Michigan Republican Rep. <span class='selected-term'>Peter Meijer</span> told the Washington Examiner.",
    "author": "Emily Brooks",
    "title": "Republican National Committee censures Liz Cheney and Kinzinger"
  },
  {
    "id": 59,
    "mediaId": 195,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "And two GOP freshmen  <span class='selected-term'>Peter Meijer</span> of Michigan and Nancy Mace in South Carolina  were among the few Republicans who sided against Trump in January of last year.",
    "author": "Albert Hunt",
    "title": "Midterm primaries might be critical to balance of the Senate"
  },
  {
    "id": 52,
    "mediaId": 129,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "Leader McCarthy is very astute, sharp and savvy,? said Representative <span class='selected-term'>Peter Meijer</span> of Michigan, another of the 10 Republicans who voted to impeach Mr. Trump.",
    "author": "",
    "title": "Courting G.O.P.'s Mainstream and Extreme, McCarthy Plots Rise to Speaker"
  },
  {
    "id": 31,
    "mediaId": 118,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "MY-jer?' They said it's `MY-er.' How the hell do you get `MY-er' out of it??\nTrump attacking <span class='selected-term'>Peter Meijer</span> for the spelling of his last name pic.twitter.com/klNHboIKF8\nWhile Trump may have thought he was making a great joke, people in Michigan may not have been so amused.",
    "author": "Stephanie Mencimer",
    "title": "At a Campaign Rally, Trump Mocked a Congressman's Name"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.) faces John Gibbs, a former Trump administration official.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump"
  },
  {
    "id": 24,
    "mediaId": 238,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "and <span class='selected-term'>Peter Meijer</span> (Mich.)  face tough primary challenges.",
    "author": "Amy B Wang",
    "title": "GOP Rep. Upton, who voted to impeach Trump, will not seek reelection"
  },
  {
    "id": 26,
    "mediaId": 261,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Also voting to impeach was U.S. Rep. <span class='selected-term'>Peter Meijer</span>, R-Grand Rapids, who is running for reelection this year despite Trump's endorsement of another candidate, John Gibbs.",
    "author": "Todd Spangler",
    "title": "Rep. Fred Upton announces retirement from Congress, has been in US House since 1987"
  },
  {
    "id": 18,
    "mediaId": 151,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "I think there's always a strong benefit to having people who can reach back and say, You know what, I remember when this happened 20 years ago,'? said first-term Rep. <span class='selected-term'>Peter Meijer</span> (R-Mich.), pointing to Katko's and Upton's wisdom and sage experience.?\nBut he added that as much as his departing colleagues will be missed, the ebb and flow of retirements and new additions helps prevent the body from becoming stagnant.",
    "author": "",
    "title": "Seeking: GOP dealmakers who won't 'burn the House down'. Apply to: Kevin McCarthy."
  },
  {
    "id": 14,
    "mediaId": 43,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Here's our complete target list:\nDistrict\nIncumbent\nLocation\nAZ-01\nDavid Schweikert\nEastern Phoenix and suburbs\nCA-22\nDavid Valadao\nSouthern Central Valley\nCA-27\nMike Garcia\nNorthern Los Angeles suburbs\nCA-45\nMichelle Steel\nWestern Orange County\nCO-08\nOPEN\nNorthern Denver suburbs\nNC-13\nOPEN\nSouthern Raleigh suburbs\nNE-02\nDon Bacon\nOmaha area\nNY-01\nOPEN\nEastern Long Island\nMI-03\n<span class='selected-term'>Peter Meijer</span>\nGrand Rapids area\nNM-02\nYvette Herrell\nSouthern New Mexico\nIf we can win across this battleground, then we can vastly improve our odds of holding our House majority and ensuring that President Biden gets at least two more years to enact his agenda.",
    "author": "",
    "title": "When it comes to protecting the House, the best defense is a good offense"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "We turn next to Michigan's 3rd in the Grand Rapids area, where Trump's forces have consolidated behind conservative commentator John Gibbs' bid to deny renomination to freshman Rep. <span class='selected-term'>Peter Meijer</span> in August.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising"
  },
  {
    "id": 8,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "And if you want to keep the gavel out of Kevin McCarthy's hands, this is the place to start.?\nThese 10 targeted U.S. House races are:\nAZ-01: David Schweikert (eastern Phoenix and suburbs)\nCA-22: David Valadao (southern Central Valley)\nCA-27: Mike Garcia (northern Los Angeles suburbs)\nCA-45: Michelle Steel (western Orange County)\nCO-08: OPEN (northern Denver suburbs)\nNC-13: OPEN (southern Raleigh suburbs)\nNE-02: Don Bacon (Omaha area)\nNY-01: OPEN (eastern Long Island)\nMI-03: <span class='selected-term'>Peter Meijer</span> (Grand Rapids area)\nNM-02: Yvette Herrell (southern New Mexico)\nThe Downballot comes out every Thursday everywhere you listen to podcasts.",
    "author": "",
    "title": "Highlights from The Downballot: Primaries heating up and why House Democrats should go on offense"
  }
]