[
  {
    "id": 82,
    "mediaId": 21,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Rep. <span class='selected-term'>Peter Meijer</span>, one of the Republicans who voted to impeach Trump over January 6, is also set to face a Trump-backed primary challenger.",
    "author": "Grace Panetta",
    "title": "A guide to the most important primary elections of the 2022 midterms, which will test Trump's influence over the GOP"
  },
  {
    "id": 68,
    "mediaId": 163,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Scalise gave money in September to at least three House members who voted to impeach Trump: <span class='selected-term'>Peter Meijer</span> of Michigan and Jaime Herrera Beutler of Washington state - who are both facing Trump-endorsed challengers - as well as David Valadao of California.",
    "author": "Alexandra Ulmer",
    "title": "Republican U.S. lawmakers funnel money to colleagues who crossed Trump"
  },
  {
    "id": 70,
    "mediaId": 881,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Michigan Rep. <span class='selected-term'>Peter Meijer</span> brought in more than a half-million dollarsten times the amount Trump-backed challenger John Gibbs brought in from the time he launched his campaign in early November through the end of 2021.",
    "author": "Cameron Joseph",
    "title": "Trump's Favorite Candidates Are Getting Crushed in Fundraising"
  },
  {
    "id": 59,
    "mediaId": 195,
    "date": "2/6/2022 12:00:00 AM",
    "sentence": "And two GOP freshmen  <span class='selected-term'>Peter Meijer</span> of Michigan and Nancy Mace in South Carolina  were among the few Republicans who sided against Trump in January of last year.",
    "author": "Albert Hunt",
    "title": "Midterm primaries might be critical to balance of the Senate"
  },
  {
    "id": 58,
    "mediaId": 19,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "Chambers is a frequent donor to the Republican National Committee (RNC), as well as moderates such as Rep. <span class='selected-term'>Peter Meijer</span> (R-MI), Sen. Lisa Murkowski (R-AK), and Rep. Adam Kinzinger (R-IL).",
    "author": "John Binder",
    "title": "Political Establishment with Obama, Lincoln Project Ties Spending Millions Against Mo Brooks"
  },
  {
    "id": 41,
    "mediaId": 65,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "FIRST ON FOX NEWS: REPUBLICAN NATIONAL COMMITTEE SHATTERS FUNDRAISING RECORDS IN FEBRUARY\nThe RJC is also endorsing Republican Reps. David Schweikert of Arizona (AZ-01), David Valadao of California (CA-22), Andy Harris of Maryland (MD-01), <span class='selected-term'>Peter Meijer</span> of Michigan (MI-03), Don Bacon of Nebraska (NE-02), Yvette Herrell of New Mexico (NM-02), Nicole Malliotakis of New York (NY-11), Brian Fitzpatrick of Pennsylvania (PA-01) and Nancy Mace of South Carolina (SC-01).",
    "author": "Paul Steinhauser",
    "title": "Sen. Ron Johnson tops list of Republicans endorsed by top Jewish GOP organization"
  },
  {
    "id": 10,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "This is a seat held by freshman Republican <span class='selected-term'>Peter Meijer</span>.",
    "author": "",
    "title": "The Downballot: Why House Democrats' best defense is a good offense (transcript)"
  }
]