{
  "id": 10402,
  "mediaId": 8483,
  "date": "2022-04-02",
  "headline": "One-on-one with Pennsylvania gubernatorial candidate Melissa Hart",
  "image": "https://kubrick.htvapps.com/vidthumb/images/melissa-hart-1648768585.jpg?crop=1xw:1xh;center,top&resize=1200:*",
  "link": "https://www.wgal.com/article/one-on-one-with-pennsylvania-gubernatorial-candidate-melissa-hart/39600946",
  "mediaOutlet": "wgal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Lehman",
  "authorUrl": "https://www.wgal.com/news-team/f2045d51-727e-451e-b547-f5dfa705624f",
  "termIds": [
    0
  ],
  "sentences": [
    "The former congresswoman and state senator from Allegheny County thinks her experience running there could help her take on Democrat Josh Shapiro in November.",
    "Hart also said she backs charter school expansion and giving parents more options for how their children can learn skills to find employment.",
    "Two of them are running for governor, but there's really no good explanation as to why they made such a wholesale change,\" she said.",
    "A woman has never been elected governor of Pennsylvania, but a Republican candidate for that office is hoping to change that.",
    "\"There's a lot of young women and girls who would see an opportunity that's something they may be interested in,\" she said.",
    "\"My goal would be to get us to the point where we only can abort if the mother's life is in danger,\" she said.",
    "Hart said small businesses, particularly in rural areas, are overburdened by corporate taxes and regulations.",
    "\"We need the pipelines and we need to make sure that we have safe manner to move to the markets,\" she said.",
    "Hart said she could bring fresh leadership to Harrisburg and more representation for women in government.",
    "\"Those districts were all majority Democrat registered, and I'm a fairly conservative Republican.",
    "On no-excuse mail voting, Hart said the law enabling it should have never been passed.",
    "\"I see it as an opportunity to help Pennsylvania move forward,\" Melissa Hart said.",
    "On abortion, Hart wants to work with lawmakers to put more restrictions in place.",
    "When I look at that issue, it's electability that's important for us,\" she said.",
    "She wants to expand the liquid and natural gas industries in Pennsylvania.",
    "\"I think there's a lot of legislators who voted for Act 77 who regret it.",
    "One-on-one with Pennsylvania gubernatorial candidate Jake Corman",
    "She would work to reverse it."
  ]
}