{
  "id": 10443,
  "mediaId": 2831,
  "date": "2022-04-03",
  "headline": "Laboratories of Anti-Monopoly",
  "image": "https://washingtonmonthly.com/wp-content/uploads/2022/03/Apr-22-DougPeterson-Wolfe.jpg",
  "link": "https://washingtonmonthly.com/2022/04/03/laboratories-of-anti-monopoly/",
  "mediaOutlet": "Washington Monthly",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rob Wolfe",
  "authorUrl": "https://washingtonmonthly.com/author/rob-wolfe/",
  "termIds": [
    4920,
    2113,
    3197,
    554,
    43,
    6428,
    6074,
    6532
  ],
  "sentences": [
    "“The states can get out in front of the federal government and serve as laboratories to prove that new policies can work.”\nMeanwhile, in one of the most David-versus-Goliath battles playing out in the antitrust world, District of Columbia Attorney General Karl Racine is pitting his city of 700,000 against Amazon in a suit that targets core aspects of its business: its control over sellers in its online marketplace and the market power it wields through its extensive distribution network.",
    "The bill, which passed the New York Senate last year and was reintroduced this year, requires companies to obtain regulators’ approval when making mergers over $9.2 million in valuation, authorizes private class-action suits, raises criminal penalties for anticompetitive behavior, and prohibits “abuse of dominance” by companies that control more than 30 or 40 percent of a market, depending on the industry.",
    "“If your co-pay suddenly becomes more expensive, if you can’t go to the doctor you want, then it becomes very real to you.” Another factor is that many hospital systems, even if they relentlessly seek profits and pay their executives millions, are technically charities, governed by laws protecting the public good that don’t apply to for-profit companies such as Google.",
    "In 1882, Samuel C. T. Dodd, a high-ranking attorney for Standard Oil, conceived of a corporate structure that would allow Rockefeller to coordinate central control over his many acquisitions while concealing their interactions under the shield of an overarching “trust.” The arrangement allowed him to rule over entire markets without accountability.",
    "The states since the 1920s had ceded more and more of their antitrust responsibilities to Washington; starting in the ’80s, President Ronald Reagan and subsequent presidents of both parties radically dialed back federal enforcement, and even encouraged consolidation, either directly (in the defense industry) or indirectly (in banking).",
    "Last July, President Joe Biden issued a sweeping executive order directing federal agencies to start prosecuting long-neglected antitrust cases and offering competition-friendly prescriptions for a wide range of industries: technology, medical devices, ocean shipping, internet and phone access, and financial services, to name a few.",
    "He thought to himself, “Data is the new oil.”\nA few months after that presentation, Phil Weiser, a wonkish lawyer who quite literally wrote the book on 21st-century consumer protection—Digital Crossroads: Telecommunications Law and Policy in the Internet Age—was elected Colorado’s 39th attorney general.",
    "You have to go into court and make the case in front of a very smart federal judiciary.”\nThough antitrust regulators across America are now taking up their long-neglected mantle, they face 40 years of judicial precedent that narrows most cases to an almost meaningless measurement of consumer prices.",
    "As their investigation revealed how Google uses its dominance in online search and advertising—the company sold 28.6 percent of digital ads last year, followed by Facebook’s 23.8 percent—to starve competitors of traffic and block them from the ad market, Peterson felt a growing sense of outrage.",
    "Whether or not it succeeds, the show of cooperation between Weiser, a Democrat, and Peterson, a Republican, along with the involvement of 36 other states and territories, is a powerful statement that the American people no longer believe that the tech giant’s actions are in their interest.",
    "And just as 19th-century Kansas offered direct incentives to enforce antitrust law, today’s public can better see the value in these cases if antitrust settlements are allocated more directly to victims or to relevant public goods, rather than socked away in states’ general funds.",
    "Also in 1889, a series of federal hearings revealed the secretive ownership structure of Standard Oil, leading Ohio Attorney General David K. Watson to sue, arguing that the company had violated its state charter by placing control in the hands of out-of-state trustees.",
    "“The District of Columbia has led the way in bringing antitrust enforcement actions against the world’s largest tech companies, including Amazon, Google, and Facebook, as well as local companies whose business practices hurt D.C. residents,” he said in a statement.",
    "This last provision Gianaris calls a “game changer”—an abuse-of-dominance standard is unheard of in the United States these days but has allowed regulators in the European Union to score meaningful victories where narrower consumer protection models fall short.",
    "In the 1870s, a handful of the biggest industrialists—John D. Rockefeller, Andrew Carnegie—started buying up competitors, taking advantage of their already deep wells of capital and the demand for centralized production that arose during the Civil War.",
    "They had different priorities: Roosevelt believed that it was impractical to prevent companies from growing too large, and thus it was better to work with them, whereas Wilson believed that they threatened democracy unless they were broken up.",
    "Shapiro’s right-hand man, Executive Deputy Attorney General James Donahue, told me that this kind of antitrust action is easier to bring in part because health care is more immediate to consumers than the abstractions of internet marketplaces.",
    "Gone are easy-to-apply bright lines standards; now, antitrust is the domain of exorbitantly paid economists who use calculus and regression analysis to determine what consumer prices might look like, if companies were allowed to merge.",
    "Half of America’s industries are dominated by their four largest companies, and the tech giants’ control over their respective spheres is even more crushing; Google, for instance, accounted for 87 percent of internet searches in 2018.",
    "In the ensuing “Brandeisian” period of jurisprudence, courts and federal regulators struck down any mergers of companies whose total market share exceeded 30 percent—a simple rule of thumb now known as a “bright lines” standard.",
    "Meanwhile, the Biden administration’s enforcement is only just getting started, and is likely to face stiff opposition in federal courts from laissez-faire judges who have been greenlighting mergers for their entire careers.",
    "But as Pennsylvania proved through its hospital case, threatening nonprofit charters remains a powerful tool to restrain anticompetitive behavior on the part of large “charities” that act more like traditional businesses.",
    "The UPMC had previously denied Highmark’s patients access to its doctors in hopes of forcing the insurer to pay higher rates; Shapiro countered by threatening to revoke the hospital chain’s nonprofit, tax-exempt status.",
    "In 1914, Congress passed the Clayton Act, adding specificity to what constituted illegal and anticompetitive behavior, and the Federal Trade Commission Act, creating a new agency to protect competition in U.S. markets.",
    "And bipartisan legislation is working its way through Congress, including a bill from Senator Amy Klobuchar that would provide federal prosecutors new resources and relaxed evidence standards to bring antitrust cases.",
    "Though regulators across America are now taking up their long-neglected mantle, they face 40 years of judicial precedent that narrows most antitrust challenges to an almost meaningless measurement of consumer prices.",
    "By the end of the last decade, however, as the disastrous results of industry consolidation became too obvious to ignore, public officials, especially at the state level, began to reject the whole Borkian paradigm.",
    "The chain is now banned from engaging in so-called all-or-nothing agreements, which required insurers to include all of the chain’s medical facilities, even if they wanted to do business with just a few hospitals.",
    "Looking back at history reveals not just the trust-busting of Teddy Roosevelt and Woodrow Wilson, but also the vital role of the states as a proving ground for antitrust policy and an inducement to federal action.",
    "In Kansas, where many public servants didn’t collect salaries, instead relying on fines and fees, the law offered direct monetary rewards to officials who brought antitrust action—and punishments if they didn’t.",
    "In December 2019, Becerra reached a $575 million settlement with Sutter Health, a network of 24 hospitals and 5,500 doctors, over allegations that it used market power to raise prices for patients and insurers.",
    "“While we welcome collaboration with our federal partners, we will not hesitate to use state and local antitrust and competition laws to hold bad actors accountable.”\nThe road ahead is far from straightforward.",
    "Ousters haven’t been possible since the mid-20th century, when the Supreme Court limited states’ oversight over charters in response to some southern states’ attempts to use that power to fight desegregation.",
    "In the 1970s, after three decades of vigorous antitrust enforcement, Bork, an influential jurist, argued that government intervention had gone too far, and was now stifling the natural efficiency of markets.",
    "The conference where Peterson had his epiphany was organized by the National Association of Attorneys General, a professional group that began, appropriately enough, as an interstate meeting about antitrust.",
    "And as the nation around the turn of the century started to look toward regulating or breaking up the trusts, monopolists like J. P. Morgan fought back by getting even bigger—too big, he hoped, to regulate.",
    "The lawsuits were merged in federal court, but Weiser and Peterson have jealously guarded state control over settlement terms, thereby preserving the ability to keep fighting if the feds decide to give up.",
    "Throughout this time, the courts steadily narrowed their interpretation of what constitutes an illegal monopoly, focusing almost exclusively on whether a given company’s dominance affects consumer prices.",
    "Kansas, Ohio, Texas, and others tested new antitrust laws and courtroom arguments throughout the 1880s and ’90s, acting out a Darwinian selection process that brought the best solutions to the top.",
    "Weiser says he’d like to see an update to the Sherman and Clayton Acts that clarifies that illegal monopoly is more than just price manipulation—it’s the use of market power to crush competition.",
    "Texas and Kansas became particularly aggressive in revoking the charters of monopolistic corporations, a practice that became known as an “ouster” because it effectively kicked a company out.",
    "Most states have strong antitrust laws that have mostly gone unused for the past few decades, as economists, politicians, and jurists nationwide took a benign view of corporate megamergers.",
    "In both cases, the District’s complaint alleges, Amazon uses its clout to stifle competitors’ access to the market, and in a way that ultimately hurts consumers, not just rival businesses.",
    "In fact, they are the laboratories that will synthesize a new generation of antitrust policies and provide the catalyst that pushes the nation—and its highest levels of government—to act.",
    "The show of cooperation between Weiser, a Democrat, and Peterson, a Republican, is a powerful statement that the American people no longer believe Google’s actions are in their interest.",
    "Meanwhile, in addition to co-leading the Google suit, Peterson and Weiser have become major players in a 48-state lawsuit seeking to break up Facebook, led by New York’s Letitia James.",
    "The top 0.01 percent of Americans held roughly 11 percent of the nation’s wealth in 2012, compared to 9 percent in 1913 and only 2 percent in 1977, just before Reagan-era deregulation.",
    "At about the same time Donahue and Becerra were taking on hospital monopolies, a state senator in New York, Michael Gianaris, began setting his sights on a far bigger target: Amazon.",
    "The groundswell of anti-monopoly sentiment eventually reached the highest level of the federal government, which used its power to bring companies such as Standard Oil to its knees.",
    "The episode led Gianaris to sponsor the 21st Century Antitrust Act, a bill that would modernize New York law by pushing its anti-monopoly provisions far beyond consumer protection.",
    "Some AGs—in Washington, D.C., and Ohio, for instance—are going it alone against the tech giants, while others are scoring antitrust victories against more conventional monopolists.",
    "Google, Facebook, Amazon—these companies’ constant surveillance over legions of users gives them a commodity more valuable than anything that comes out of the ground: information.",
    "A decade of furious consolidation followed, culminating in an innovation that would make the likes of Rockefeller some of the richest and most powerful men in history: the trust.",
    "The tale of late-20th-century deregulation has been told many times in recent years, but in short, we have two major figures to thank: the University of Chicago and Robert Bork.",
    "Chicago economists backed him up with studies purporting to show that larger companies, with greater market shares, provide better services with little to no cost to consumers.",
    "In San Francisco, a Sutter area, a hospital visit for a heart attack cost roughly $25,000 in 2019, compared to $15,000 in parts of Los Angeles where the chain didn’t hold sway.",
    "For decades, federal authorities left it up to the states to enforce the Sherman Act, which mainly became a cudgel to smash unions for “conspiring” to control the labor market.",
    "His target: giant hospital chains whose monopoly control of health care markets had helped drive up American health care costs per capita at twice the rate of wages for years.",
    "Of note are recent settlements in California and Pennsylvania that curbed anticompetitive behavior from large hospital chains—a major contributor to soaring health care costs.",
    "“We fortunately have remedies that are much broader in scope.”\nMeanwhile, the federal Department of Justice was limbering up its own substantial antitrust enforcement powers.",
    "California obtained these concessions in a fairly traditional way: by suing under antitrust statute while working with the federal government, which brought a separate case.",
    "By the end of the last decade, as the disastrous results of industry consolidation became too obvious to ignore, public officials began to reject the whole Borkian paradigm.",
    "When filing the suit, in December 2020, he proclaimed to the press that he wouldn’t be content with a monetary settlement, and even floated the idea of forced asset sales.",
    "Standard Oil assembled a crack legal team and brought considerable political pressure against Watson, an elected official, but he prevailed before the Ohio Supreme Court.",
    "Whether or not he succeeds, the novelty of his argument is what matters: Acting independently, the states will test out ideas that Washington could never dream of.",
    "The behemoth retailer first drew the lawmaker’s ire when, in 2019, it announced that it had chosen Long Island City, Queens—his district—for its new headquarters.",
    "State attorneys general are aware that, whether in the Gilded Age or today, only the federal government has enough power to bring the biggest monopolists to heel.",
    "Meanwhile, the states helped build a groundswell of public opinion against the 19th-century robber barons, pushing Washington ultimately to break their backs.",
    "And lawsuits are just the beginning; states like New York and Illinois are updating their century-old antitrust statutes and lobbying Congress to do the same.",
    "The senator rankled at “that ridiculous nationwide contest they put everybody through,” with cities scrabbling to offer ever-larger tax breaks and subsidies.",
    "In 2020, Shapiro forced the University of Pittsburgh Medical Center, a 40-hospital system, to stop bullying a major insurer, Highmark Blue Cross Blue Shield.",
    "The Republican attorney general, Dave Yost, is arguing that the company is so dominant in internet search that it should be regulated as a public utility.",
    "Weiser’s experience was critical to dusting off those tools as the pair built their case and recruited more states to their cause over the next two years.",
    "It was at that meeting that Peterson first realized the power in knowing what millions—billions—of people search for, buy, click on, and “like” online.",
    "In June 2018, Doug Peterson of Nebraska sat with other state attorneys general in a hotel ballroom in Portland, Oregon, and listened to the bad news.",
    "So if you want to see where this generation’s fight against oppressive monopolies is headed, don’t just look at Capitol Hill or the White House.",
    "The settlement wasn’t a mere payoff to the state and to the employee unions that joined the suit—it also required Sutter to change its behavior.",
    "But in Pennsylvania, Attorney General Josh Shapiro showed how states can corral rapacious hospital chains without even invoking antitrust law.",
    "He fought back hard, criticizing the deal in public and eventually securing a seat on a key regulatory board that allowed him to shut it down.",
    "If you want to see where this generation’s fight against oppressive monopolies is headed, don’t just look at Capitol Hill or the White House.",
    "Standard’s ouster from the Lone Star State helped companies such as Texaco, founded in 1902, to thrive in an otherwise monopolized industry.",
    "Surveys of state attorneys general in recent years indicate that many employ just one or two dedicated antitrust lawyers, or even none.",
    "Despite all the current antitrust energy, then, Washington is likely to deliver incremental victories at best for some years to come.",
    "He named Lina Khan, a young lawyer and antitrust warrior who has written for this magazine, as chair of the Federal Trade Commission.",
    "In 1907, state regulators gathered at that inaugural conference to discuss a joint strategy addressing the dominance of Standard Oil.",
    "One of the first to act was Xavier Becerra, then attorney general of California and now U.S. secretary of health and human services.",
    "Last June, for instance, Ohio again took the lead in antitrust history by filing the first “common carrier” lawsuit against Google.",
    "For decades to come, states played a game of whack-a-mole as corporations changed jurisdictions to avoid tightening restrictions.",
    "The first Gilded Age produced powerful antitrust tools for states today to use, but over the past 40 years they’ve gotten rusty.",
    "Gianaris became skeptical about the potential economic benefits for his constituents, as well as concerned about Amazon’s power.",
    "The 1890 Sherman Act was too broad at first, and for decades it wasn’t enforced except to punish labor unions for organizing.",
    "Big Tech, a presenter told them, has spawned a new cohort of monopolies rivaling the power of the 19th-century robber barons.",
    "New Jersey, for example, saw an opportunity after the Ohio suit and welcomed Standard Oil with friendly incorporation rules.",
    "Eleven other states followed with their own statutes as Congress continued to gather information, much as it’s doing today.",
    "The legislation banned harmful monopolies and industry collusion, but left open the question of how to define those terms.",
    "Weiser had no idea that his background in antitrust, which he himself considered a niche corner of law, would be relevant.",
    "(Weiser and Peterson also are going after Google’s attempts to dominate smart appliances and vehicles, among other areas.)",
    "In the early 20th century, Presidents Teddy Roosevelt and Woodrow Wilson enthusiastically embraced antitrust enforcement.",
    "D.C. is active in the Facebook and Google cases, too, but Racine said he wasn’t afraid to take on the giants by himself.",
    "The states can afford to be bolder, however, and attorneys general have some ideas about how to maximize their efforts.",
    "It’s not necessarily a money-losing proposition, either; antitrust suits often pay for themselves through settlements.",
    "After some states kicked out monopolists, others, such as New Jersey, welcomed them with friendly incorporation rules.",
    "Second, states may no longer be able to “oust” troublesome corporations by revoking their articles of incorporation.",
    "In 1890, Congress passed the first federal antitrust law: the Sherman Act, sponsored by Ohio Senator John Sherman.",
    "The best way to do that may be a “shotgun” approach: to bring many lawsuits, advancing a host of novel arguments.",
    "Beefing up their budgets can help them go toe-to-toe with the phalanxes of corporate lawyers on the other side.",
    "In 1911, the Supreme Court ordered Standard Oil dissolved, arguing that it was in violation of the Sherman Act.",
    "The settlement also avoids surprise medical bills by limiting what Sutter can charge for out-of-network visits.",
    "In October 2020, the agency launched a similar, but slightly narrower, complaint against Google’s market abuse.",
    "Nevertheless, over just a few years, all three branches of government made a historic run of antitrust action.",
    "It also mirrors the early days of antitrust, at the turn of the 20th century, when states first led the way.",
    "Meanwhile, states passed increasingly aggressive laws that pushed their own officials to fight monopolies.",
    "Standard owned oil wells; it owned refineries; it owned the railroads that carried petroleum to customers.",
    "Competitors in oil extraction who used those railroads suddenly saw their transportation costs skyrocket.",
    "Other states responded by requiring companies to be incorporated in-state in order to do business there.",
    "(Sutter did not admit wrongdoing and denies that it forced insurers into all-or-nothing agreements.)",
    "Our present-day antitrust protections, disused as they may be, were won through decades of struggle.",
    "The entire country watched these developments with alarm, but it was states that first took action.",
    "Today, after 40 years of regulatory neglect, the story is much the same, but with different names.",
    "Sooner or later, Gianaris hopes, the federal government will follow what he’s doing in New York.",
    "Though Congress has the power to push back, its action is often slow and incremental.",
    "(Peterson, who’s suing one of the biggest companies in the world, says he has four.)",
    "But even if it passes—which is far from certain—that legislation is quite moderate.",
    "What followed in the middle of the century was an era of widespread prosperity.",
    "And finally, if history is a guide, don’t expect it to get better all at once.",
    "That’s why what’s happening in the states is so important—and always has been.",
    "The court ordered Standard to dissolve the trust; instead, it fled the state.",
    "“Fines are like kicking gorillas in the shin,” he said at the time.",
    "“This is the way our government has always functioned,” he says.",
    "In 1916, Wilson appointed Louis Brandeis to the Supreme Court.",
    "(It would not, for instance, break up existing monopolies.)",
    "In 1889, Kansas enacted the nation’s first antitrust law.",
    "That’s not to say that states are helpless—they aren’t.",
    "“Health care is real,” he said in a recent interview.",
    "Many observers are calling this a second Gilded Age.",
    "But a week after he took office, Weiser got a call.",
    "They went out of business, or sold to Rockefeller.",
    "Third, new laws might be able to move the courts.",
    "But Donahue, of Pennsylvania, had other thoughts.",
    "“Thank God for Phil Weiser,” Peterson says today.",
    "(New York eventually offered Amazon $3 billion.)",
    "And the best place to do that is in the states.",
    "“Congress ain’t gonna do squat,” he told me.",
    "State initiative spurred federal action.",
    "The case is now in pretrial maneuvers.",
    "History offers some lessons, as well.",
    "Watson’s victory was short-lived.",
    "“You gotta convince the courts.",
    "Look to the states, as well.",
    "Look to the states, as well.",
    "And that process has begun.",
    "Doug Peterson needed help.",
    "Who is your first witness?",
    "But so can new arguments.",
    "First, resources are key.",
    "He wanted to sue Google.",
    "And they usually are."
  ]
}