{
  "id": 10499,
  "mediaId": 8393,
  "date": "2022-03-31",
  "headline": "Pennsylvania 2022 Poll: Voters largely undecided in critical Senate, Governor races",
  "image": "https://www.pahomepage.com/wp-content/uploads/sites/91/2022/03/YLEHQ-full-1-1.jpg?w=1280",
  "link": "https://www.pahomepage.com/news/pennsylvania-2022-poll-voters-largely-undecided-in-critical-senate-governor-races/",
  "mediaOutlet": "pahomepage.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/?post_type=profile&p=1032698",
  "termIds": [
    0
  ],
  "sentences": [
    "Spencer Kimball, Executive Director of Emerson College Polling noted, “former President Donald Trump’s potential endorsement holds significant weight in the Republican primary: 61% of Republican primary voters say they are more likely to vote for a candidate if he endorses them, while 13% say it makes them less likely to vote for that candidate, and 26% report that it makes no difference.”\nSeventy-three percent of Republicans say it is important a candidate lives in Pennsylvania.",
    "McCormick and Dr. Oz Tied, Fetterman Lead Senate Primaries; Doug Mastriano leads GOP Gubernatorial primary; Biden has 47% approval among PA voters; Democrats think Pennsylvania runs fair elections, Republicans do not\nEYEWITNESS NEWS (WBRE/WYOU) – A new Eyewitness News/Emerson College Polling/The Hill poll shows most Pennsylvania voters are undecided in the critical 2022 primary races for Senate and Governor.",
    "Kimball continued, “Republican voters are unified in support of more fracking in the state with\n75%, whereas Democratic voters are more split: 44% think there should be less fracking and 36% think there should be more.”\nLegalizing marijuana\nA plurality, 49%, of Pennsylvania voters think marijuana should be legalized for recreational purposes with 36% opposed and 16% unsure.",
    "A majority (54%) of Pennsylvania voters think Pennsylvania should allow more hydraulic fracturing (“fracking”) for oil and natural gas in the state, while 29% think there should be less, and 18% think it should stay the same amount.",
    "When asked what is to blame for the increase in gas prices, 46% blame the Biden administration, 19% blame gas, and oil companies, and 18% blame gas and oil sanctions levied against Russia following the invasion of Ukraine.",
    "The plurality (38%) of Pennsylvania voters say the economy, including jobs, inflation, and taxes, is the most important issue facing the country, followed by healthcare (17%); no other issue reaches double digits.",
    "Democrats and Republicans disagree on whether Pennsylvania runs fair elections: 75% of Democrats think the state runs fair elections compared to 42% of Independents and just 28% of Republicans.",
    "The general election sample consisted of registered voters in Pennsylvania, n=1,069 with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/- 3 percentage points.",
    "It is important to remember that subsets based on gender, age, party breakdown, ethnicity, and region carry with them higher margins of error, as the sample size is reduced.",
    "There are nuances of support for legalization within Democratic primary voters: 75% of Fetterman voters support legalization compared to 48% of Lamb voters,” Kimball said.",
    "Republican Primary\nThe poll of 408 Pennsylvanian Republican voters shows 51% are undecided in the Senate primary race with David McCormick and Dr. Mehmet Oz tied at 14%.",
    "The Republican primary sample consisted of likely voters, n=372, with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/-5.0 percentage points.",
    "The Democratic primary sample consisted of likely voters, n=471, with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/-4.5 percentage points.",
    "Data was collected using a cellphone sample of SMS-to-web, an online panel provided by Amazon MTurk, and an Interactive Voice Response (IVR) system of landlines.",
    "Candidates who receive at least 5% in either poll can qualify for a debate hosted by Nexstar Media Inc. and our media partners, WPXI-TV in Pittsburgh.",
    "Biden received 50% of the Pennsylvania vote in the 2020 Presidential Election, flipping a state won by former President Donald Trump in 2016.",
    "President Biden and the issues\nPresident Joe Biden’s job approval is at 47% in Pennsylvania, while 50% disapprove of the job he is doing.",
    "The poll was conducted from March 26-28, 2022, interviewing 1,069 Pennsylvanians with a margin of error (MOE) of +/- 3 percentage points.",
    "Biden has 77% approval among Democrats while 84% of Republicans and 67% of Independents disapprove of the job he is doing as President.",
    "Democratic Primary\nIn the Democratic primary race for Senate, John Fetterman holds a significant lead with 33% over Connor Lamb at 10%.",
    "Melissa Hart, Jake Corman, Charlie Gerow, and Nche Zama each received less than 3%, but nearly 49% said they were undecided.",
    "Polling methodology\nThe WHTM/Emerson College Polling/The Hill Pennsylvania poll was conducted from March 26-28, 2022.",
    "Similar to the Republican race, a majority of Democratic voters are undecided with 37% still weighing their choice.",
    "Lou Barletta is second in the polling at just over 12% and no other candidates receiving double-digit support.",
    "The data sets were weighted by gender, age, education, race, and region based on 2020 turnout modeling.",
    "William McSwain, Dave White, and Joe Gale round out the top five receiving at least three percent.",
    "In the Republican race for Governor, 49% are undecided with Doug Mastriano leading at 14%.",
    "No other Republican candidate received double digits in the Republican Senate polling.",
    "Kathy Barnette, Carla Sands, and Jeff Bartos each received between 5-6.4% in the poll.",
    "“Among Democratic primary voters, 62% support recreational legalization of marijuana.",
    "Emerson College will be releasing a second poll of Republican voters in early April.",
    "Dr. Kevin Baumlin and Malcolm Kenyatta finished third and fourth, respectively.",
    "Democrat Josh Shapiro is running unopposed in the Governor race.",
    "The Pennsylvania primary is on May 17, 2022.",
    "Does Pennsylvania run fair elections?"
  ]
}