{
  "id": 10501,
  "mediaId": 8315,
  "date": "2022-03-30",
  "headline": "Petitions Submitted for 2022 Primary Election",
  "image": "https://WICU.images.worldnow.com/images/12828826_G.jpg?lastEditedDate=1510060211000",
  "link": "https://www.erienewsnow.com/story/46191250/petitions-submitted-for-2022-primary-election",
  "mediaOutlet": "erietvnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Ten candidates filed to run on the Republican side:\nLou Barletta, the GOP's nominee for U.S. Senate in 2018 and a former congressman known for his crusade against illegal immigration\nJake Corman, the top-ranking state senator\nJoe Gale, a Montgomery County commissioner\nCharlie Gerow, a marketing consultant and longtime conservative activist\nMelissa Hart, a lawyer and former congresswoman\nState Sen. Doug Mastriano, a force in Pennsylvania's right-wing politics who aligned himself with Trump and pushed to overturn 2020's presidential election\nBill McSwain, a lawyer who was the Trump-appointed U.S. attorney in Philadelphia\nJason Richey, a Pittsburgh-based lawyer who specializes in commercial and contract litigation\nDave White, who runs a large plumbing and HVAC firm and is a former Delaware County councilman\nNche Zama, a heart surgeon who has directed units at various hospitals in Pennsylvania\nBoth parties have contests for the open seat with Fetterman seeking higher office.",
    "John Brown, a former elected executive of Northampton County and the party's 2016 nominee for auditor general\nJeff Coleman, a former state lawmaker and political and marketing consultant\nTeddy Daniels, a former police officer and Army combat veteran who is aligned with Trump and says he was outside the U.S. Capitol on the afternoon of the Jan. 6 insurrection\nCarrie DelRosso, a freshman state lawmaker from suburban Pittsburgh\nRuss Diamond, a state lawmaker from Lebanon County who was prominent in resistance to pandemic-era government measures\nChristopher Frye, the mayor of New Castle\nJames Jones, who runs an oil and petroleum products trading business\nRick Saccone, a former state lawmaker from the Pittsburgh area who also was outside the U.S. Capitol on Jan. 6\nClarice Schillinger, a Bucks County resident who got politically involved in school board races last year in a push against pandemic-era measures\nCopyright Erie News Now.",
    "On the Republican side are seven candidates:\nConservative activist Kathy Barnette, who has aligned herself with leading figures in the Trump-led push to overturn 2020's presidential election\nReal estate investor Jeff Bartos, who was the party's nominee for lieutenant governor in 2018\nLawyer George Bochetto\nLawyer Sean Gale\nFormer hedge fund CEO David McCormick\nMehmet Oz, the self-styled health and wellness guru and author best-known as host of daytime TV's “The Dr. Oz Show\"\nCarla Sands, Trump's former ambassador to Denmark who ran her late husband's commercial real estate empire in California\nGOVERNOR\nThe Democratic Party's presumed nominee, Josh Shapiro, filed to run for governor in the midst of serving his second term as Pennsylvania's elected attorney general.",
    "Now that the petition deadlines have passed to get on the ballot in Pennsylvania, here's a look at who has filed to run for office in the 2022 primary election.",
    "John Fetterman\nSecond-term state Rep. Malcolm Kenyatta of Philadelphia\nLiberal activist Alex Khalil\nThird-term U.S. Rep. Conor Lamb of suburban Pittsburgh.",
    "PENNSYLVANIA HOUSE OF REPRESENTATIVES\nPENNSYLVANIA SENATE\nU.S. REPRESENTATIVE IN CONGRESS\nU.S. SENATE\nEmergency room physician Kevin Baumlin\nLt. Gov.",
    "On the Democratic side, three filed, including two state lawmakers:\nDavis is running on a ticket with Shapiro.",
    "There is still time for candidates to withdraw or people to file objections to nomination petitions.",
    "This material may not be published, broadcast, rewritten or redistributed.",
    "He has a clear lane to the party's nomination with no opposition.",
    "Get Erie News Now anytime, anywhere",
    "All rights reserved."
  ]
}