{
  "id": 11687,
  "mediaId": 6571,
  "date": "2022-03-26",
  "headline": "Congressional Candidate Arrested In Ohio On Menacing Charge",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/12/26/d04261a5-70e9-4ebf-87d7-639efa042844/thumbnail/1200x630/38712d1d1ea5297b7162fb6812099d4b/handcuffs-gun-generic.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/congressional-candidate-arrested-in-ohio/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4559,
    111,
    6159,
    6077,
    6385,
    6474,
    6665,
    6556
  ],
  "sentences": [
    "Lt. Todd Tennant of the Miami County sheriff's office said deputies stopped the car of Michael Neary, 28, of Columbus at about 2:30 a.m. Wednesday after a sport utility vehicle driver reported having been followed from Columbus to Troy, more than 60 miles (100 kilometers) away.",
    "Authorities said Neary told them that he had recently returned from Rhode Island, where he said he was running for a political position, and was very stressed and had been focusing on the Ohio registration on the vehicle in front of him.",
    "Neary is among a large field of candidates seeking the Democratic nomination in Rhode Island's 2nd congressional district following incumbent Democrat Jim Langevin's announcement in January that he is not seeking reelection.",
    "Tennant said the SUV driver reported that Neary's car had followed them the whole way, mimicking their every move, matching speed and lane changes and even stopping at a rest area after they did.",
    "TROY, Ohio (AP) — A Rhode Island congressional candidate has been arrested on a menacing charge after a driver reported being followed for scores of miles in Ohio.",
    "Neary was arrested on a misdemeanor charge of menacing by stalking, as well as drug counts after marijuana and drug paraphernalia were allegedly found in his car.",
    "The other driver had just returned from Florida and reported no prior relationship or acquaintance with Neary.",
    "It's unclear whether Neary has an attorney; a message was left Saturday at a number listed in his name.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "(Copyright 2022 The Associated Press.",
    "All rights reserved.",
    "In:\nOhio"
  ]
}