{
  "id": 11912,
  "mediaId": 8449,
  "date": "2022-03-24",
  "headline": "Inicia la carrera por figurar en las boletas de las primarias",
  "image": "https://media.telemundo62.com/2019/09/Pa-State-House.jpg?quality=85&strip=all&fit=640%2C480",
  "link": "https://www.telemundo62.com/noticias/decision/local-decision/inicia-la-carrera-por-figurar-en-las-boletas-de-las-primarias/2202337/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Trevor Southerland, director ejecutivo del Comité de Campaña Demócrata de la Cámara, calcula que más de dos docenas de miembros republicanos de la Cámara actualmente representan distritos en los que al menos el 45% de los votantes apoyaron a Joe Biden o Josh Shapiro, el fiscal general demócrata que no tiene oposición para la gobernación de su partido.",
    "Los republicanos tienen una mayoría de 113-90 en la Cámara, aunque tres de esos escaños están vacantes por renuncias y se llenarán en una elección especial del cinco de abril: los escaños demócratas de Allegheny County que quedaron vacantes cuando el representante Ed Gainey fue elegido alcalde y nombrado representante.",
    "“Para ser completamente honesto, este es un momento difícil”, dijo la representante Sheryl Delozier, republicana de Cumberland, quien estuvo siete mandatos, después de pasar varios días tocando puertas en un distrito suburbano de Harrisburg que experimentó cambios significativos en la redistribución.",
    "Pero tanto en 2016 como en 2020, el estado estuvo dividido equitativamente en las contiendas presidenciales, y este año los demócratas de la Cámara de Representantes del estado jugarán a la defensiva en al menos cuatro distritos indecisos donde se jubilarán los titulares de larga data.",
    "Aunque los cinco retiros entre los 25 escaños del Senado este año son republicanos, el presidente de la campaña republicana del Senado, el senador David Argall de Schuylkill County, dijo que está alentado por la cosecha de candidatos que ha surgido.",
    "El fin de semana comenzó una carrera de candidatos a nivel estatal para recolectar suficientes firmas para calificar para la boleta primaria, dando inicio a lo que seguramente será un año de cambio político en la Legislatura de Pensilvania.",
    "Los representantes Mike Carroll y Gerald Mullery en Luzerne County, la representante Pam Snyder en Greene County y el representante Mark Longietti en Mercer County están dejando áreas con un sólido desempeño del voto republicano.",
    "El quinto y desempate miembro de la Comisión de Reasignación Legislativa fue un demócrata elegido por la Corte Suprema estatal de mayoría demócrata, y el crecimiento de la población se ha concentrado en el sureste demócrata.",
    "Los jueces mantuvieron la fecha de las primarias del 17 de mayo, pero dieron a los candidatos hasta el 28 de marzo para obtener las firmas requeridas para la boleta: 500 para el Senado estatal y 300 para la Cámara.",
    "Uno de los principales objetivos de Southerland, el representante republicano de Montgomery County, Todd Stephens, quien ha estado en el punto de mira de los demócratas ciclo tras ciclo electoral, sigue ganando.",
    "El representante Tim Briggs de Montgomery County, un demócrata de la Cámara de Representantes, dijo que existe la sensación entre su grupo de que los republicanos no han dirigido la cámara de manera justa.",
    "Stephens tuvo que cancelar los planes para ver baloncesto universitario el fin de semana pasado por un esfuerzo de petición que describió como \"más una carrera de velocidad que un maratón\".",
    "Decisión Local\nEl representante Andrew Lewis, un republicano de segundo mandato del condado de Dauphin, se involucró en un distrito con una compañera republicana, la representante Sue Helm.",
    "La Corte Suprema del estado redujo a la mitad el período normal de recopilación de peticiones de tres semanas la semana pasada, cuando la corte aprobó nuevos mapas de la Asamblea General.",
    "Southerland ve un camino para dos escaños demócratas adicionales en el área de Harrisburg y posibles recolecciones en los suburbios de Filadelfia, Poconos y el área de State College.",
    "El lanzamiento de la reunión de peticiones estuvo acompañado de una nueva ola de anuncios de retiro: al menos 22 republicanos y siete demócratas en la Cámara no buscan otro mandato.",
    "Pensilvania ha tenido un gobernador demócrata y una legislatura republicana durante 16 de los últimos 20 años, y es posible que los votantes vuelvan a dividir el poder entre ellos.",
    "“Creo que también hay un caso grave de fatiga de Tom Wolf”, dijo Argall, refiriéndose al gobernador demócrata del estado por dos mandatos, ahora en su último año en el cargo.",
    "Jake Wheatley, uno de los principales miembros del personal, y un escaño en Luzerne disponible desde que la representante republicana Tarah Toohil ganó una carrera judicial.",
    "Luego de varios ciclos de redistribución de distritos en los que los republicanos tenían el control, este año el proceso fue más favorable a los demócratas.",
    "“En realidad, es porque analicé todos los precintos de ese distrito y, estadísticamente, creo que es imposible que un republicano gane allí”, dijo Lewis.",
    "“Si somos mayoría, será un margen estrecho, y dependiendo de quién gane gobernador, intentaremos gobernar y lograr un compromiso”, dijo Briggs.",
    "Es una gran cantidad de salidas para llegar a la Cámara de 203 miembros con un par de meses antes de que se emitan los primeros votos.",
    "Cinco senadores estatales, cuatro republicanos y un independiente que forma parte del Partido Republicano también se están retirando.",
    "Junto con la gran cantidad de jubilaciones republicanas, cree que los demócratas tienen una variedad de objetivos potenciales.",
    "Como muchos otros, predice que los demócratas obtendrán escaños este año, pero no los suficientes para recuperar la mayoría.",
    "“Los nuevos mapas no nos garantizan una mayoría de ninguna manera, pero lo que hacen es darnos una oportunidad.",
    "“Escuché a mucha gente decir que es probable que se estreche, que es así como sucede, lo he visto ir y venir”.",
    "Él cuenta con la ira por los precios de la gasolina y otras tendencias políticas nacionales para ayudar.",
    "La pandemia y la cautela general sobre la divulgación de información personal no facilitan el proceso.",
    "“No he escuchado demasiada preocupación por perder la mayoría”, dijo Stephens.",
    "“Va a ser un desafío en sí mismo, porque habrá gente que quiera vengarse.",
    "Ninguno busca la reelección en el nuevo distrito de tendencia demócrata.",
    "“La gente tiene miedo de estar firmando algo fraudulento”.",
    "Que, en un estado cambiante, es lo que deberíamos tener”.",
    "“Entonces, no se trata solo de los problemas nacionales”.",
    "Los candidatos tienen sólo una semana y media.",
    "Tenemos que hacer lo mejor para Pensilvania”.",
    "“Pone la cámara en juego”, dijo Southerland."
  ]
}