{
  "id": 11945,
  "mediaId": 2680,
  "date": "2022-03-29",
  "headline": "Nurse pleads guilty in fatal fall of McMaster's father",
  "image": "https://s.hdnux.com/photos/01/24/70/02/22249614/3/rawImage.jpg",
  "link": "https://www.sfgate.com/news/article/Nurse-pleads-guilty-in-fatal-fall-of-McMaster-s-17036810.php",
  "mediaOutlet": "sfchronicle",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "CLAUDIA LAUER",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We have several active and ongoing investigations into long term care facilities and nursing homes across Pennsylvania, and will hold anyone who knowingly neglects a care-dependent person in Pennsylvania accountable.”\nPennsylvania Health Department officials released a report in 2018 that also placed blame for the incident on administrators at the facility who investigators said had failed in their essential duties and responsibilities.",
    "The Pennsylvania Attorney General's office announced Tuesday that 34-year-old Christann Gainey had pleaded guilty in a Monday court appearance to the charges related to the death of Herbert R. McMaster Sr. Gainey had initially been charged with additional counts of felony neglect and involuntary manslaughter, which were dropped as part of the plea agreement.",
    "The investigators did not name the older McMaster as the patient described in the fatality report, but the details of the incident including the date and manner of his death, his medical information and the check-in date at the facility match information provided by authorities and by an attorney for the McMaster family.",
    "The report said staff failed to develop a fall prevention plan even though his medical records indicated it was required; failed to complete required neurological checks after his falls; and did not attempt to perform CPR to resuscitate McMaster when he was found unresponsive, according to facility records.",
    "Prosecutors said Gainey, who was assigned to the facility through a staffing agency and was the Licensed Practical Nurse on duty that night, was required by facility medical policy to perform neurological and vital sign checks on McMaster periodically after the fall.",
    "During preliminary hearings prosecutors played several hours of surveillance footage from the that night, showing Gainey was not near McMaster at the times she recorded the alleged neurological checks, including one that would have happened after he had died.",
    "PHILADELPHIA (AP) — A former nurse at a Philadelphia senior care facility has pleaded guilty to misdemeanor neglect of a care-dependent person and tampering with records in the 2018 death of the father of former Trump national security advisor H.R.",
    "The 141-page report said the fatal fall was McMaster Sr.'s fifth during a four-day stay at the Cathedral Village retirement community, where he was admitted for rehabilitation following a stroke.",
    "Prosecutors contend the 84-year-old McMaster fell and struck his head in April 2018, just days after arriving at the Cathedral Village senior living facility in Philadelphia.",
    "“The defendant has now been held accountable for her actions that led to the tragic death of Mr. McMaster,” Attorney General Josh Shapiro wrote in an emailed release.",
    "It said the director of nursing and facility administrators failed to provide adequate supervision or implement interventions to prevent accidents and falls.",
    "The Attorney General's office said she was sentenced to six months under house arrest, with another four years of probation, according to court records.",
    "Gainey will also be barred from seeking reinstatement of her license or working in a care facility during that time.",
    "A message left with an attorney representing Gainey was not immediately returned Tuesday.",
    "Gainey pleaded guilty to falsifying records to show she had done those checks.",
    "He died hours later as the result of bleeding in his brain.",
    "McMaster Jr."
  ]
}