{
  "id": 12036,
  "mediaId": 8493,
  "date": "2022-03-23",
  "headline": "Shapiro: I’ll Cut the Cellphone Tax, and Give Gas Tax Rebates",
  "image": "https://www.wkok.com/wp-content/uploads/2020/07/SBC-APP-KO-CAR-PLAY-New.jpg",
  "link": "https://www.wkok.com/596302-2/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    0
  ],
  "sentences": [
    "So, what I want to do is take a portion of that money and give it back to the people so they can put it to use.”\nUnlike the adversity of Governor Tom Wolf and the GOP controlled legislature, Shapiro says his campaign is about working together with Republicans and Democrats, especially when it comes to future elections, “I’ve heard from Republican and Democratic county commissioners, who want what’s known as pre-canvassing; the ability to go through mail-in ballots and organize them, not count them yet, so that on election night, we can give the voters of the commonwealth or that district some answers.",
    "That’s an example of a commonsense, bipartisan thing that needs to be done.”\nAsked why he is campaigning in the republican rich middle of Pennsylvania, he said, “If you go back and look at my two races for Attorney General, we outperformed nearly every other Democrat in ‘The T.’ So, I don’t write off any Pennsylvanian.",
    "I actually think its important to show up and listen, so you’ll see me continue to show up in the so-called ‘T.’” The T refers to GOP heavy middle and top tier of Pennsylvania, minus the Democratic strongholds of Philadelphia and Pittsburgh.",
    "Talked about on WKOK’s On The Mark program Wednesday, the current state Attorney General, who is the lone democratic candidate for governor of Pennsylvania, said the state has accumulated billions in state tax dollars and federal funds.",
    "He said he’ll eliminate the 11% cellphone tax, and while he said he doesn’t favor a much talked about temporary gas tax holiday, he does say his tax plan calls for giving every Pennsylvanian with a vehicle, a $250 gas tax rebate.",
    "Money for the tax cuts and rebates will come from the state’s abundant surplus, “We’re sitting on about $7 billion in state accounts that’s doing absolutely nothing to help the people of Pennsylvania.",
    "Winning ‘The T’ Are Part of Shapiro’s Campaign\nHARRISBURG – Using the state’s multi-billion-dollar surplus to cut taxes and pay for gas tax givebacks, are part of the Josh Shapiro tax plan.",
    "Additionally, he said it’s also important to continue investigating into the education system, and wants to reinstate vocational, technical and computer training back in classrooms.",
    "Shapiro said also wants to protect rural communities, by investing in farmers and helping provide rural high speed internet access.",
    "You can hear much more from Josh Shapiro on the WKOK.com Podcast Page or wherever you listen to podcasts.",
    "It’s your money that was sent to Harrisburg and it’s not helping you.",
    "He said if you have two cars, you’ll get $500, and so on.",
    "I don’t write off any community."
  ]
}