{
  "id": 12061,
  "mediaId": 8500,
  "date": "2022-03-29",
  "headline": "Pennsylvania AFL-CIO holding convention in Pittsburgh this week",
  "image": "https://kubrick.htvapps.com/vidthumb/f33b0562-5df6-4c1f-b138-3250c46b091e/f33b0562-5df6-4c1f-b138-3250c46b091e_image.jpg?crop=0.793xw:0.791xh;0.199xw,0&resize=1200:*",
  "link": "https://www.wtae.com/article/pennsylvania-afl-cio-convention-pittsburgh/39573745",
  "mediaOutlet": "wtae.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Garris",
  "authorUrl": "https://www.wtae.com/news-team/c6353627-f936-4484-8385-65f19d036c2b",
  "termIds": [
    4560,
    2086,
    21,
    990,
    6520,
    6506
  ],
  "sentences": [
    "\"A lot of important resolutions on health and safety, political action, legislation, work and family issues, all the things that workers deal with every day,\" said Rick Bloomingdale, president of the Pennsylvania AFL-CIO.",
    "PITTSBURGH —\nPennsylvania's AFL-CIO started its annual constitutional convention in Pittsburgh on Tuesday with delegates from different unions planning to vote on resolutions and elect officers.",
    "Mayor Ed Gainey addressed a crowded room of delegates at the Omni William Penn Hotel downtown, noting recent unionization efforts by coffee shop employees in the city.",
    "\"We're going to expand union membership in Pennsylvania, and give everyone the chance to join a union, if they so desire,\" Shapiro said.",
    "\"The backbone of the middle class has always been the strength and power of unions,\" Gainey said Tuesday.",
    "In late December, workers with Coffee Tree Roasters voted to unionize, joining UFCW Local 1776.",
    "Starbucks workers in the city's Bloomfield neighborhood this month rallied for unionization.",
    "The PA AFL-CIO's executive council endorsed his gubernatorial run earlier this year.",
    "Watch the report from downtown Pittsburgh: Click the video player above.",
    "Attorney General Josh Shapiro also spoke.",
    "The convention will wrap up on Thursday.",
    "Gainey attended to support them."
  ]
}