{
  "id": 12151,
  "mediaId": 8489,
  "date": "2022-03-23",
  "headline": "What’s behind GOP gov candidates’ ‘bizarre’ new demand to keep debates insular",
  "image": "https://whyy.org/wp-content/uploads/2021/10/pa-state-capitol-harrisburg-102821.jpeg",
  "link": "https://whyy.org/articles/whats-behind-gop-gov-candidates-bizarre-new-demand-to-keep-debates-insular/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Meyer",
  "authorUrl": "https://whyy.org/person/katie-meyer/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The media aren’t motivated to select the best candidate to beat [Attorney General and assumed Democratic nominee] Josh Shapiro, but Republicans are.”\nDavid La Torre, a spokesman for Corman’s campaign, gave a similar explanation, saying that the parameters were established “to ensure Republican candidates for governor could robustly debate one another — not Democratic or partisan moderators — about the issues that are important to Pennsylvania families and job creators.”\nRachel Tripp, a spokesperson for McSwain, also said the campaigns want to “ensure that voters are not misled or unfairly influenced by moderators with a hostile or partisan agenda.”\nThis isn’t standard for Republican — or any — political candidates.",
    "Addressed to “members of the Pennsylvania press” and circulated among media outlets and political insiders, the demand from the campaigns of State Sen. Jake Corman, former Delaware County Council member Dave White, former congressman Lou Barletta, and former U.S. Attorney Bill McSwain lists four requirements that must be met for these candidates to participate in any primary debate:\nModerators must be registered Republicans who live in Pennsylvania.",
    "It’s kind of astounding.”\nSpokespeople for the Corman, White, Barletta, and McSwain campaigns didn’t clarify how they had drafted the letter or decided who would be involved, though Tim Murtaugh, an adviser for Barletta, said that “any candidate is welcome to sign on.”\nMurtaugh said the campaigns believe that Republicans should fully control any GOP primary.",
    "But Gerow, one of the lagging candidates and a longtime commentator on Pennsylvania politics, said he thinks the conditions set forth by Corman, White, Barletta, and McSwain are “bizarre.”\nPart of the point of a debate, Gerow noted, is that candidates prove they will be able to handle unfriendly questions in the general election.",
    "Along with Corman, White, Barletta, and McSwain, they are right-wing State Sen. Doug Mastriano, Montgomery County Commissioner Joe Gale, GOP consultant Charlie Gerow, former U.S. Rep. Melissa Hart, lawyer Jason Richey, and heart surgeon Nche Zama.",
    "But candidates for the competitive Democratic U.S. Senate primary have agreed to one debate at Muhlenberg College, moderated by journalists and a professor, and another at Harrisburg TV station ABC27 that will be moderated by two local anchors.",
    "When Republican political consultant Samuel Chen first saw a missive from four Republican gubernatorial candidates, laying out their exacting joint criteria for participating in primary election debates, he was a little baffled.",
    "They must not have “spoken negatively about any of the candidates on stage,” or work “for an organization that has maligned one of the candidates.” Plus, they don’t want questions that require answers shorter than 30 seconds.",
    "They’re just very ambiguous, these rules.”\nClearly, Chen added, there’s also another motive underlying the criteria: Corman, White, Barletta, and McSwain are trying to set themselves apart from the sprawling GOP field.",
    "He actually thinks longer answers are nice because they allow for more depth, and said it makes sense for moderators to live in Pennsylvania and not be closely associated with any particular candidate.",
    "In the Republican gubernatorial primary in 2018, for instance, all three candidates for the nomination attended a debate hosted at Harrisburg Area Community College and moderated by local reporters.",
    "But Mastriano — the candidate who is most associated with Donald Trump and his efforts to overturn the 2020 presidential election — has consistently polled near the top of the pack.",
    "Chen, who also works as a political science professor at Northampton Community College, isn’t unsympathetic to candidates trying to set friendly parameters for debates.",
    "Most of those candidates have lagged the four debate allies in the limited polling that has been done on the primary.",
    "“Is it considered a negative statement if you pointed out they had the least grassroots support in the primary?",
    "There is no real Democratic primary for governor this year, with Shapiro having successfully cleared the field.",
    "Ultimately, Chen said, this all seems related to a trend that even GOP operatives like him acknowledge.",
    "Asked whether he’d known about the candidates’ letter or been asked to sign on, he said he hadn’t.",
    "A GOP U.S. Senate debate — forgone by several top candidates — also had conservative moderators.",
    "“How are you going to decide if anyone has spoken negatively about any of the candidates?",
    "All told, 10 candidates have qualified to be on the GOP gubernatorial primary ballot.",
    "That one, hosted by Dickinson College, was moderated by a panel of conservatives.",
    "“None of these four like him.”\nMastriano didn’t respond to a request for comment.",
    "“There is certainly the idea of, we don’t trust the mainstream media,” he said.",
    "“He’s not one that the insiders like,” Chen said of Mastriano’s exclusion.",
    "They must not have endorsed or donated to any of the participants.",
    "The GOP gubernatorial field has already had one debate.",
    "“Whoever cooked this idea up wasn’t thinking real well.",
    "“That’s kind of prevalent in the Republican Party.”",
    "What constitutes a negative statement?” he asked.",
    "“It’s as simple as that,” he wrote in an email.",
    "“I would love to know” who wrote it, he said.",
    "That happens all the time.",
    "Or are those just facts?",
    "But as for the rest?"
  ]
}