{
  "id": 12227,
  "mediaId": 8393,
  "date": "2022-03-22",
  "headline": "Former sanitation employee charged for improperly disposing of 60 tons of human waste",
  "image": "https://www.pahomepage.com/wp-content/uploads/sites/91/2022/03/CHARGES-FILED-GENERIC-7.jpg?w=1280",
  "link": "https://www.pahomepage.com/news/crime-courts/former-sanitation-employee-charged-for-improperly-disposing-of-60-tons-of-human-waste/",
  "mediaOutlet": "pahomepage.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nico Rossi",
  "authorUrl": "https://www.pahomepage.com/author/nico-rossi/",
  "termIds": [
    0
  ],
  "sentences": [
    "According to the police criminal complaint, James McKinnon Muir, 78, of Lancaster, dumped or permitted the dumping of solid waste, mostly processed sewage sludge and grit, to be dumped or buried onto or under the ground at Pike County Environmental Inc. (PCE) from May 13, 2014, through October 4, 2016.",
    "If you violate our environmental laws, my office will hold you accountable.”\nInvestigators have discovered debris and sludge in and around every single building on the property, which was sold to a new owner in 2017.",
    "MATAMORAS, PIKE COUNTY (WBRE/WYOU) — A former Pike County sanitation employee is being charged by Attorney General Josh Shapiro, for repeatedly violating the Solid Waste Management Act.",
    "The defendant’s choice to cut corners in the treatment process to save money not only endangered a clean and safe environment in Pike County it was against the law,” said AG Shapiro.",
    "The new owner showed proof that documented the four truckloads of grit removed weighed 60.35 tons and an additional 61 truckloads of sludge had been improperly disposed of by Muir.",
    "According to a former co-worker of Muir, George Weber Jr. who worked for Muir from 1990 through 2017, Muir described waste as debris, which would be placed into one-ton bags.",
    "“Let this send a clear message to others about how seriously we take protecting our environment and public health.",
    "AG Shapiro says Muis is charged with four counts of unlawful conduct under the Solid Waste Management Act.",
    "The new owner says he excavated around 50 sacks of debris that were all buried on the property.",
    "Weber Jr. says he estimates there to be 50-75 of these bags containing debris buried on site.",
    "The new owner says he also removed an additional 50-75 sacks from the building."
  ]
}