{
  "id": 1234,
  "mediaId": 8305,
  "date": "2022-02-10",
  "headline": "A.G.’s integrity unit urges new look at ‘Avon Lady’ murder",
  "image": "https://www.delcotimes.com/wp-content/uploads/2022/02/20220210_174424.jpg?w=943&h=890",
  "link": "https://www.delcotimes.com/2022/02/10/a-g-s-integrity-unit-urges-new-look-at-avon-lady-murder/",
  "mediaOutlet": "delconewsnetwork.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Rose",
  "authorUrl": "https://www.delcotimes.com/author/alex-rose/",
  "termIds": [
    0
  ],
  "sentences": [
    "He has the greatest spirit, for him to be in this type of situation, me never hearing malice, or never hearing vengeance or revenge coming out of his mouth, has been something special for me because it has allowed me to understand what being a man is all about.”\nChester Mayor Thaddeus Kirkland, who has likewise pushed for the case to be reopened, also thanked Malloy for his diligence on the case and the members of DCBC who are committed to seeing the litigation out.",
    "“He looked at the facts, not just his bias, not his political leanings, not his party affiliation, not who voted for him – he looked at the facts, which is what the judicial system is supposed to be about in this country – he looked at the facts and discovered oh my God, we have the wrong man.”\nWilliams said the Delaware County Black Caucus, which organized Thursday’s rally, would not be satisfied with a simple review, however.",
    "“So we stand in solidarity to try to bring home someone who is innocent, someone who did not commit a crime.”\nJohn Kaisner, a retired Chester police officer and husband of one of Leo’s few remaining relatives, could not be reached for comment Thursday, but previously said that he still believes Evans is complicit for destroying evidence and should remain in prison.",
    "“(T)he petitioner respectfully requests in the interest of justice the petitioner be granted a hearing on the within PCRA petition and a status conference be scheduled forthwith.”\n“We are grateful that the AG’s office agreed to review the case, and we appreciate the hard work of everyone who contributed to that review,” Stollsteimer said in a statement Thursday.",
    "“(A)fter conducting a full review of the case, the Conviction Integrity Section in the Pennsylvania Office of the Attorney General suggest(s) that the information contained in the sworn statement given by co-defendant Anthony Jones constitutes newly discovered evidence and should be considered by the court,” the petition says.",
    "“But once it’s thoroughly and justly done – we all know he’s innocent – we will not finish, it will not be complete until he puts his feet outside those bars.”\nEvans’ nephew Eric thanked the DCBC, Stollsteimer and Malloy, who he said has become a family member during the pendency of the case.",
    "“Jones has changed his story so many times and it’s never been upheld.”\nMost Popular\nDom & Mia’s gets ready to ‘dom-inate’ Delaware County’s dining scene\nMorning Briefing: 12-year old child dead in murder-suicide; Another community hospital may be closing; Bad signs for 76ers after loss",
    "Assistant District Attorney William Toal III argued at a hearing concerning those issues in 2017 that the relief being sought is well outside the statute of limitations for Evans’ case and that there are no “new facts” that would justify reopening the investigation.",
    "They don’t arrive at that point without facts driving them to, ‘We have to look at this,’ so it’s very significant.”\nLeroy Evans was found guilty of murder in the first degree, criminal conspiracy to murder and robbery following a jury trial in 1980.",
    "“We are aware that the section determined that certain evidence may form the basis for post-conviction relief for Mr. Evans, and we look forward to the court’s decision regarding his petition for relief.”\n“He did something that every other D.A.",
    "CHESTER – A city man serving a life sentence for the 1980 slaying of “Avon Lady” Emily Leo might have a renewed shot at freedom thanks to a recommendation from a relatively new Conviction Integrity Unit in the state Attorney General’s Office.",
    "Democratic District Attorney Jack Stollsteimer vowed to take a new look at the facts of Evans’ case during his 2019 campaign, saying the statement Jones provided in 2016 better conforms to the evidence at trial and should be reviewed.",
    "Jones was also subpoenaed to testify in 2018 to provide testimony consistent with his statement, but invoked his 5th Amendment right to remain silent in response to any question regarding Evans’ involvement, the petition says.",
    "Leo, a resident of the McCaffery Village public housing project, was a sales representative with Avon and made a house call on the morning of Nov. 11 to Jones’ home in the 3000 block of West 11th Street.",
    "Evans has always maintained his innocence and said he was at home at the time of Leo’s murder, but did admit to later taking clothing from the home of co-defendant Anthony Jones and burning it.",
    "Malloy appealed Bradley’s decision to the Superior Court, but later withdrew that appeal in 2020 when Attorney General Josh Shapiro announced the creation of the Conviction Integrity Section.",
    "While he concedes that the absence of Evans’ DNA on the clothesline would not automatically exonerate him, Malloy said it does open the question of whether Evans was there at all that day.",
    "Jones said he strangled Leo with a clothesline that he snapped off the back of the house, then put what he believed was her lifeless body into a trashcan and took her to a nearby field.",
    "Malloy said this story better lined up with the evidence at the scene, which did not have the large amount of blood present that one would expect if Leo had been beaten in the head.",
    "Jones told Malloy that he called Leo himself and set up an appointment using a phony name, “Eddie Jones.” He said he did not tell Evans or anyone else his plan to rob Leo that day.",
    "Malloy has also been seeking DNA testing on the clothesline, the victim’s clothing, two pocketbooks, the planner and other items allegedly grabbed by Evans during the murder.",
    "He said Evans choked Leo with a clothesline in the kitchen and beat her about the head with an iron before Jones put her into a trashcan and took her to a nearby vacant lot.",
    "Though some of the other evidence has degraded, Malloy contends that the absence of Evans’ DNA on the rope could be a compelling enough reason to reopen the case.",
    "Jones, who was 17 at the time, made a deal with prosecutors to plead guilty and name his alleged accomplice in order to avoid the death penalty.",
    "When Shapiro established the Conviction Integrity Unit, Stollsteimer made good on his promise by asking the A.G. to look into the matter.",
    "Jones testified at trial in 1981 that it was Evans’ idea to lure Leo into the house under the pretense of buying Avon products.",
    "Defense attorney Michael Malloy said the only thing tying Evans to the actual murder, however, was Jones’ testimony at trial.",
    "“Understand something: This is equivalent to man landing on the moon,” said state Sen. Anthony Williams, D-8 of Philadelphia.",
    "It was there that Jones sucker-punched Leo in the head, sending her to the ground unconscious, according to the deposition.",
    "Evans has unsuccessfully appealed his conviction for years, but Malloy said many of those were denied on technical grounds.",
    "Malloy secured a statement from Jones in 2016 recanting that testimony, but Jones has since gone back on his statement.",
    "But Jones provided a statement to Malloy in 2016 indicating Evans was not involved with any aspect of the murder.",
    "When Leo knocked at the front door, Jones said he had her come around to the back, which enters into the kitchen.",
    "The fact that this one is actually engaged, being directed by the DA to do the work, is past encouraging.",
    "“Integrity units were created, frankly, as a result of public pressure, and they frankly didn’t do much.",
    "“Forty-one years is a long time and it gets even longer when you know you did no wrong,” said Kirkland.",
    "And if Jones’s DNA is present, Malloy added, that gives further weight to his story in the deposition.",
    "Evans finally filed a motion in June 2014 seeking DNA testing on fingernail scrapings taken from Leo.",
    "It’s a statement; a statement that there needs to be a correction because the facts are revealing.",
    "Leo remained in critical condition at Crozer-Chester Medical Center until her death Nov. 28.",
    "A truck driver called police after seeing Jones throwing rocks at Leo’s near-lifeless body.",
    "“It has to be complete, it has to be thorough, it has to be just,” said Williams.",
    "He has now served more than 41 years of a life sentence imposed in October 1981.",
    "“My uncle has been behind bars being a father, a husband, an uncle, a brother.",
    "It also explains the name “Eddie Jones” in Leo’s date planner, he said.",
    "Jones said he hit Leo in the head with a rock when she began to stir.",
    "Testimony at trial indicated the victim had scratched Evans’ face.",
    "The iron identified as the murder weapon is not in custody.",
    "“I think he’s as responsible as Jones,” said Kaisner.",
    "Judge James Bradley agreed and denied the petition.",
    "Jones ran off but was arrested later that same day.",
    "“We’ve been crying out for 42 years,” he said.",
    "for four … decades did not do,” said Williams.",
    "He named Evans."
  ]
}