{
  "id": 1294,
  "mediaId": 6571,
  "date": "2022-02-15",
  "headline": "Arrests Made In Alleged Scheme To Defraud Pandemic Unemployment Assistance Program",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/08/27/071bd072-74c1-4702-96e7-8bd79198c98c/thumbnail/1200x630/98795844b37e9d86abd82c0d98fdf9d2/cashdl1-e1530814352369.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/arrests-in-scheme-to-defraud-pandemic-unemployment-assistance-program/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The Office of Inspector General prosecutes allegations of unemployment insurance fraud and says it continues to investigate and prosecute those who exploit a national emergency to steal taxpayer-funded resources.",
    "Agents say seven people allegedly claimed to have worked for the same trucking company between January 2020 and March 2020 and that their employment ended due to the COVID-19 pandemic.",
    "The investigation by Pennsylvania Attorney General Josh Shapiro showed the group of alleged co-conspirators allegedly tried to rip off PUA funds in excess of almost $1 million.",
    "To date, the state attorney general's office has charged 44 individuals across Pennsylvania for submitting fraudulent PUA applications totaling more than $4 million.",
    "PITTSBURGH (KDKA) -- Pennsylvania's attorney general accused a group of stealing hundreds of thousands of dollars in COVID-19 relief funds.",
    "Prosecutors allege they not only didn't work for the company, but there were no records of them being employed in Pennsylvania.",
    "The alleged co-conspirators are believed to have filed 145 false applications, of which nearly $500,000 was paid out to them.",
    "They are accused of conspiring to provide false information to obtain Pandemic Unemployment Assistance funds.",
    "Shapiro, along with local law enforcement and the FBI, announced the arrests of five people on Tuesday.",
    "The attorney general said the group \"took advantage of the public health emergency to cash in.\"",
    "In:\nPennsylvania\nfraud"
  ]
}