{
  "id": 13390,
  "mediaId": 8254,
  "date": "2022-03-16",
  "headline": "Lancaster DA says cop’s arrest ‘impacted some cases’",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/Lancaster-County-Voucher-Forms.png?w=1280",
  "link": "https://www.abc27.com/news/local/lancaster/lancaster-da-says-cops-arrest-impacted-some-cases/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Schad",
  "authorUrl": "https://www.abc27.com/author/ben-schad/",
  "termIds": [
    3926,
    6296,
    6297
  ],
  "sentences": [
    "More specifically, with the news that money that went missing from 2015 through 2020 at the Lancaster County Drug Task Force was allegedly stolen by its leader, “If there was something that prohibited us from moving forward with that prosecution, then we were required to notify the prosecution and dismiss the case,” Adams said.",
    "She said during the two years between the revelation of the theft and Monday’s naming of Burkhart as the lone suspect, other task force members “feel like they’ve been operating under a cloud of suspicion” and are relieved to move forward.",
    "“Every year since I’ve been in office, we’ve posted those on our Crimewatch site so the public can go on and see how that money is being spent and how much money we are seizing from drug dealers across the county,” Adams said.",
    "Addressing broader criticism about asset forfeitures and what some critics call a lack of transparency related to them, Adams said she believes in asset forfeitures but also believes in more transparency surrounding them.",
    "LANCASTER, Pa. (WHTM) — The fallout from the arrest of Officer John Burkhart — for allegedly stealing $200,000 in seized cash from the drug task force he ran — includes more than just missing money and broken trust.",
    "Adams said new leadership — and new “checks and balances, particularly around evidence — the way it’s held, stored, kept, maintained, tracked” — will prevent a similar heist in the future.",
    "“We can’t eliminate someone from wanting to commit a crime, but we can control the ability and opportunity to do so,” Adams said.",
    "“It impacted some cases,” Lancaster County District Attorney Heather Adams (R) confirmed Tuesday to abc27 News.",
    "A statement from the office of Pa. Attorney General Josh Shapiro (D) said Burkhart acted alone.",
    "“They take their work to heart and they’re incredibly proud of what they do,” Adams said.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "Sign up for the abc27 newsletters here."
  ]
}