{
  "id": 13460,
  "mediaId": 8254,
  "date": "2022-03-18",
  "headline": "Test your knowledge: March 18 weekly news quiz",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/Weekly-News-quiz-02-e1645743057119.png?w=1280",
  "link": "https://www.abc27.com/news/pennsylvania/test-your-knowledge-march-18-weekly-news-quiz/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Avery Van Etten",
  "authorUrl": "https://www.abc27.com/author/avery-van-etten/",
  "termIds": [
    3926,
    1022,
    6506
  ],
  "sentences": [
    "With the exception of its Ticketing Services, parking booths, and roaming food and beverage carts, Hersheypark shared that it will no longer be accepting a certain type of payment when it reopens this spring.",
    "John Burkhart, the former Officer in Charge of the Lancaster County Drug Task Force, has been charged with stealing more than $200,000 from what/whom between 2015 and 2020?",
    "Pennsylvania Attorney General Josh Shapiro said of the incident, “These funds should have been used to help law enforcement in Lancaster County battle the opioid epidemic.",
    "One of the motorists involved in the pileup said the main thing that caused the series of accidents “came out of nowhere.” So what was it that caused the pileup?",
    "Instead, this money went into John Burkhart’s pocket.”\nA pileup on Route 581 in Cumberland County last Saturday involved 73 vehicles, 43 of which were damaged.",
    "Using 2019 census data, Stacker compiled a list of the Pennsylvania counties with the most residents who were born in the counties in which they lived.",
    "Pennsylvania had 5,065 new COVID-19 cases between Friday, March 11, and Thursday, March 17, according to the state’s Department of Health.",
    "Answer these questions in the quiz above to see how much you caught in Pennsylvania news this week.",
    "Which Midstate county did Stacker find has the most “born-and-bred” residents?",
    "The state’s percent positivity for the week of March 11 to March 17 was 3%.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "Is that higher or lower than the previous week’s percent positivity?",
    "PENNSYLVANIA (WHTM) — How much did you catch in the news this week?",
    "Sign up for the abc27 newsletters here.",
    "Test your news knowledge in this quiz!",
    "See this page for the latest quiz!",
    "Which type of payment is that?",
    "This quiz has been archived."
  ]
}