{
  "id": 13755,
  "mediaId": 8469,
  "date": "2022-03-18",
  "headline": "Shapiro rolls out first tax relief plan of governor’s race",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2017/11/cropped-web1_22-TL-Logo.jpg.webp",
  "link": "https://www.timesleader.com/wire/state-wire/1545456/shapiro-rolls-out-first-tax-relief-plan-of-governors-race-2",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MARC LEVY",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "HARRISBURG, Pa. (AP) — Democrat Josh Shapiro is rolling out the first tax proposal of his candidacy for governor, saying Friday that he would use surplus state cash and federal pandemic aid to eliminate state taxes on cell phone bills, send payments to car-owning households and expand Pennsylvania’s rent and property tax rebate program.",
    "The legislation would tap $500 million in federal pandemic aid to make up for the lost revenue, and would require the state Department of Transportation to borrow $650 million to ensure critical infrastructure projects remain funded during the period of the gas tax reduction, Corman said in a memo to fellow lawmakers.",
    "“So while they’re working to put money in the pockets of oil and gas executives, I’m working to put money in the pockets of Pennsylvanians who right now are dealing with these high costs.”\nFollow Marc Levy on Twitter at www.twitter.com/timelywriter",
    "It also comes as Pennsylvania’s bank accounts are flush from an economy juiced with federal pandemic subsidies and multibillion-dollar surpluses after a decade of stubborn deficits dating back to the recession.",
    "“In states that have actually cut the gas tax, what we’ve seen is that the gas and oil executives, they’ve kept 30% of that savings, meaning they don’t pass that savings on to the consumers,” Shapiro said.",
    "At an estimated 8 million passenger vehicles in Pennsylvania, the cost would be $2 billion, but Shapiro’s campaign said some of those are corporate or government vehicles and won’t count.",
    "Applications to the property tax and rent rebate program have declined in recent years as more households exceed income limits that have not changed since 2006, according to state data.",
    "His proposal to expand the property tax and rent rebate program would roughly triple the cost, by an estimated $424 million, and possibly expand the number of applicants by about 60%.",
    "Shapiro, however, criticized Republican plans to cut gas taxes, saying the experience in other states shows that the savings of a tax cut does not entirely trickle down to motorists.",
    "Another Republican candidate, Jake Corman, proposed cutting gas taxes, reducing the rate by one-third, or nearly 20 cents per gallon, through the end of 2022.",
    "The program received about 467,000 applications in 2019 and is open to people 65 and over, widows and widowers 50 and over and the disabled 18 and over.",
    "Among Republicans, Bill McSwain has pledged to make a “permanent and drastic reduction” in Pennsylvania’s gas tax, but without offering more details.",
    "Eliminating state sales and gross receipts taxes on cell phone bills — a total of 11% — would cost $317 million, Shapiro’s campaign said.",
    "Shapiro said he wants to double the income limit for renters to $30,000 a year and for property owners from $35,000 to $50,000 a year.",
    "“My plan is fully paid for and would provide real relief for Pennsylvanians today,” Shapiro said at a news conference in Pittsburgh.",
    "The Republican field is nine-deep after Tuesday’s deadline to file paperwork to get on the primary ballot.",
    "Under the plan, households could get a $250 payment for each vehicle, paid for by federal pandemic aid.",
    "Shapiro’s plan comes out as gas prices rocket upward, and cutting gas taxes have become a hot topic.",
    "Tom Wolf, a Democrat, is constitutionally barred from seeking a third term and has endorsed Shapiro.",
    "Corman, the president pro tempore of the state Senate, is drafting legislation to that effect.",
    "The gas tax is the primary way that Pennsylvania funds road and bridge construction projects.",
    "The combined cost would be footed by surplus state tax collections, Shapiro’s campaign said.",
    "Shapiro, Pennsylvania’s two-time elected attorney general, in the May 17 primary election.",
    "3 in the nation at 58.7 cents per gallon, according to the Tax Foundation, .",
    "His plan would increase the maximum standard rebate from $650 to $1,000.",
    "Pennsylvania is No.",
    "Gov."
  ]
}