{
  "id": 13865,
  "mediaId": 8254,
  "date": "2022-03-15",
  "headline": "Former Lancaster County Drug Task Force leader charged with stealing $200K",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/Screen-Shot-2022-03-15-at-6.45.08-PM-e1647514910498.png?w=1280",
  "link": "https://www.abc27.com/news/local/former-lancaster-county-drug-task-force-charged-with-stealing-200k/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Hamburg",
  "authorUrl": "https://www.abc27.com/author/daniel-hamburg/",
  "termIds": [
    0
  ],
  "sentences": [
    "Public officials have a special responsibility to serve the people with integrity, and my office will continue to hold anyone who breaks the law, no matter how powerful or well-connected, accountable for their actions.”\nLancaster County Commissioner Josh Parsons said in a statement, “This arrest confirms exactly why the Board of Commissioners for years asked questions about where the Drug Task Force money was going and why we fought for transparency over those funds despite attacks and attempts to silence us.”\nabc27 has reached out to Burkhart’s attorney for comment but has not yet received a response.",
    "On March 4, 2022, the Forty-Ninth Statewide Investigating Grand Jury issued a presentment and determined that from at least 2015 through 2020, Burkhart “repeatedly stole money that had been seized during drug investigations using two separate schemes.”\nThe AG’s office alleges Burkhart stole approximately $150,000 in seized cash from the Lancaster County Drug Task Force safe where seized money was stored before it was formally forfeited and placed into the Lancaster County general fund bank account for use by the Task Force.",
    "The Forty-Ninth Statewide Investigating Grand Jury recommended the following charges: Theft by Unlawful Taking or Disposition, Theft by Deception, Theft by Failure to Make Required Disposition of Funds, Forgery, Tampering with Records or Identification, and Tampering with or Fabricating Physical Evidence.",
    "LANCASTER, Pa. (WHTM) – John Burkhart, the former Officer in Charge of the Lancaster County Drug Task Force, has been charged with stealing more than $200,000 from the Task Force and depositing at least $170,000 into his personal bank account between 2015-2020.",
    "Second, the Grand Jury found that Burkhart was allegedly solely responsible for recording and delivering cash deposits from the Drug Task Force to the county treasurer after the seized assets were forfeited by court order.",
    "When a bank account was seized by the Drug Task Force, the procedure was for the bank to send a check to the Drug Task Force, and the check would be deposited into Lancaster County’s general fund account.",
    "Burkhart abused his position of public trust to scam and defraud the citizens of Lancaster County and the Lancaster County Drug Task Force out of desperately needed funds,” said AG Shapiro.",
    "During the investigation, the AG’s office says it was discovered that evidence envelopes containing seized cash were missing, which included funds seized from bank accounts.",
    "The Office of Attorney General assumed jurisdiction over the case in April 2020 following a conflict referral from the Lancaster County District Attorney’s Office.",
    "The Theft by Unlawful Taking or Disposition, Theft by Deception, Theft by Failure to Make Required Disposition of Funds, and Forgery charges are each felonies.",
    "Burkhart allegedly recorded false deposit amounts before they could be recorded by the treasurer and skimmed approximately $50,000 from 2015 through 2020.",
    "The charges were announced by Pennsylvania Attorney General Josh Shapiro and the Forty-Ninth Statewide Investigating Grand Jury on Tuesday.",
    "Burkhart was solely responsible for cashing those checks and placing the money into the safe until they were forfeited by court order.",
    "“These funds should have been used to help law enforcement in Lancaster County battle the opioid epidemic.",
    "The Controller’s office would then provide a check to the Drug Task Force in the care of John Burkhart.",
    "Burkhart was arrested and preliminarily arraigned before Magisterial District Judge Bruce A. Roth.",
    "The Grand Jury learned that Burkhart had nearly exclusive control of the safe and its contents.",
    "Lancaster County District Attorney Heather Adams is expected to provide comment on Wednesday.",
    "This case is being prosecuted by Senior Deputy Attorney General Megan Madaffari.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "According to court documents, Burlhart’s bail was set at $25,000.",
    "Instead, this money went into John Burkhart’s pocket.",
    "Enforcing the law does not put you above it.",
    "Sign up for the abc27 newsletters here.",
    "“Mr."
  ]
}