{
  "id": 13870,
  "mediaId": 8504,
  "date": "2022-03-17",
  "headline": "Political forecaster shares thoughts on Pa. Senate and Gov. races",
  "image": "https://www.yourerie.com/wp-content/uploads/sites/27/2022/03/WHTM_530PM_DENNIS_STATE_OF_PA_RACES_PKG.mp4.00_01_00_22.Still001.jpg?w=1280",
  "link": "https://www.yourerie.com/news/local-news/your-local-election-hq/political-forecaster-shares-thoughts-on-pa-senate-and-gov-races/",
  "mediaOutlet": "yourerie.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dennis Owens",
  "authorUrl": "https://www.abc27.com/author/dennis-owens/",
  "termIds": [
    3989,
    3926,
    1724,
    2147,
    2765,
    1489,
    1126,
    392,
    6506
  ],
  "sentences": [
    "Donald Trump continues to stump across the country but Pennsylvania-based syndicated columnist and author Salena Zito insists 2022 will not be about the Donald but the frustrated and overlooked voters who embraced him and are still out there.",
    "For news delivered right to you, subscribe to JET 24/FOX 66/YourErie.com’s breaking, daily news & severe weather email lists\nThose statewide candidates must gather signatures to get on the ballot and those signatures are due on Tuesday.",
    "“They’re doing the things that Pennsylvania voters like in that they’re going to small towns, they’re going to their festivals, their fish fries, their community events, and they’re trying to earn votes,” Zito said.",
    "In the race for U.S. Senate, Zito said if the election were held today, she believes John Fetterman and Dave McCormick would win their respective primaries.",
    "Zito says there are too many Republicans running and an assumption that Democrat Attorney General Josh Shapiro is a shoe-in.",
    "“There’s an absence in newsrooms of people who are pro-gun or own a gun or are pro-life or sit in a pew every Sunday.",
    "abc27 spoke with a nationally known syndicated columnist who specializes in spotting electoral trends before most.",
    "This is a year where the country is moving right, it’s not gonna be a good year for Democrats,” Zito said.",
    "Zito saw and wrote about the Trump wave before the 2016 election and wrote a book about it afterward.",
    "That’s the thing people misunderstand he was the result of it, he didn’t cause it,” Zito said.",
    "So when journalists go out and cover people like that, they’re abnormal to them,” Zito said.",
    "She says too many candidates ignore large swaths of the country, like rural Pennsylvania.",
    "Candidates must file the required number of signatures or they won’t get on the ballot.",
    "HARRISBURG, Pa. (WHTM) — Tuesday is a big day in the races for Governor and U.S.",
    "Trump has yet to endorse a candidate in the Pa. race for Governor.",
    "The coalition was formed long before he stepped on that escalator.",
    "“Everybody thinks Donald Trump won because he’s Donald Trump.",
    "“You should never assume anything in politics.",
    "He was the result of this coalition.",
    "So how are those races shaping up?",
    "She says the media is guilty too.",
    "He didn’t.",
    "Senator."
  ]
}