{
  "id": 13929,
  "mediaId": 6570,
  "date": "2022-03-18",
  "headline": "During Pittsburgh stop, Josh Shapiro promises to cut costs for Pennsylvania families if he's elected governor",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/20220318ppShapiro2LOC-1-1647762120.jpg",
  "link": "https://www.post-gazette.com/news/politics-state/2022/03/18/pittsburgh-stop-josh-shapiro-says-get-money-pennsylvania-citizens-pockets-elected-governor/stories/202203180124",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julian Routh",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In a visit to Forest Hills on Friday, Mr. Shapiro, joined by two working moms who said they’re feeling the stresses of rising gas and grocery prices, pledged to eliminate a state tax on cell phone bills, expand a popular property tax rent rebate program for seniors and give drivers a $250 gas tax refund for each car they own.",
    "Labeling the prospect of cutting the state’s gas tax a “political talking point” that won’t actually help working Pennsylvanians, state Attorney General Josh Shapiro, the lone Democratic contender for governor, said “real relief” from rising costs will come from his plan to put money back into the pockets of individuals.",
    "“While they’re working to put money in the pockets of oil and gas executives, I’m working to put money in the pockets of Pennsylvanians who right now are dealing with these high costs,” Mr. Shapiro said.",
    "Pennsylvania Senate President Pro Tempore Jake Corman, a Republican candidate for governor, recently said he’d be introducing legislation to lower the state’s liquid fuels tax by one third.",
    "Mr. Shapiro said his plan would be funded by the stash of federal money in the state’s coffers and an anticipated budget surplus that he’d have, if elected, in his first year in office.",
    "His plan would raise the maximum rebate, from $650 to $1000, for the homeowners and renters — mostly seniors — who take advantage of the property tax rebate program.",
    "Asked by the Post-Gazette if that means he’d take executive action or if he’d negotiate with the Republican majorities differently, he appeared to signal the latter.",
    "Mr. Shapiro, acknowledging that many people don’t want to wait until the election to get relief from rising prices, called on the Legislature to pass the plan now.",
    "Mr. Shapiro pitched the plan as an alternative to cutting the gas tax, which has become a staple of the Republican Party’s platform in Pennsylvania specifically.",
    "The attorney general said the idea would compromise public safety, noting that the gas tax covers the cost of state police and infrastructure investments.",
    "The cell phone tax amounts to 11% of each bill, Mr. Shapiro said — and his plan would put $317 million back into consumers’ pockets in total.",
    "In other states that have cut the gas tax, oil and gas executives haven’t passed the financial benefits on to consumers, Mr. Shapiro said.",
    "He said he knows how to work with legislators on both sides of the aisle and is “confident” he can get the plan passed.",
    "He said Pennsylvania has “too many nuisance taxes on the books” and that this would be a permanent elimination.",
    "“Let them put their money where their mouth is and actually stand up and vote for it,” Mr. Shapiro said.",
    "Julian Routh: jrouth@post-gazette.com; Twitter: @julianrouth\nFirst Published March 18, 2022, 9:56am",
    "It won’t require tapping into the $3 billion in the state’s rainy day fund, he added.",
    "If they don’t, he’ll be ready “on day one” to put it into action, he said.",
    "It would also make 275,000 more Pennsylvanians eligible for the program.",
    "Pennsylvania’s 57.6-cent-a-gallon gas tax is the highest in the nation.",
    "Plus, the GOP talks a “good game” on wanting to cut taxes, he added."
  ]
}