{
  "id": 13954,
  "mediaId": 2631,
  "date": "2022-03-20",
  "headline": "In Pa. gov. race, Democrat Josh Shapiro banks on abortion rights as a winning issue",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220316-josh-shapiro-jm-1418-bbf791.jpg",
  "link": "https://www.nbcnews.com/politics/politics-news/pa-govs-race-democrat-josh-shapiro-banks-abortion-rights-winning-issue-rcna20324",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Federal abortion rights are in question like never before, with the Supreme Court appearing likely to roll back, or completely strike down, Roe v. Wade this summer (in December, the court appeared prepared to uphold a Mississippi law that would ban almost all abortions after 15 weeks of pregnancy, which would mark a dramatic break from 50 years of rulings).",
    "He’s challenged restrictive abortion bans in other states in court, including Texas’ six-week ban, Mississippi’s 15-week ban, and South Carolina’s “heartbeat law,” During the Trump years he challenged the administration’s gag rule that barred funding for clinics that made referrals to or informed patients about abortion providers.",
    "Control comes down to governors, to determine whether to veto the kind of extremist legislation that my opponents would sign, in order to protect a woman’s right to choose.”\nAbortion rights proponents pointed to a handful of Democratic candidates whose emphasis on the issue they said was a decisive factor in helping them win.",
    "Democrats in the upper Midwest have largely seen success when they focus hard on kitchen table issues, not social issues (last month, the likely Democratic Senate candidate in neighboring Ohio suggested he’d prefer to not unnecessarily discuss his support of abortion rights because voters care more about economic issues).",
    "It appears to be part of a strategy that it’s more important to fire up the base than it is to go after independents, but, given that he has no competition in the primary, it feels, possibly, a bit unnecessary do that at this stage,” said Vince Galko, a GOP strategist who’s worked in Pennsylvania politics for 20 years.",
    "“Who we elect as our next governor in Pennsylvania quite literally decides whether a woman’s right to choose continues to exist in our commonwealth.”\nHe said that if Pennsylvanians want to keep the right to choose, only the veto of a pro-choice Democrat would keep it in place.",
    "“The only thing standing between Pennsylvania and a Texas-style abortion ban is a governor who is prepared to veto legislation that would infringe on a women’s reproductive freedoms,” said Kristin Ford, who heads research and communications at NARAL Pro-Choice America.",
    "Support for abortion in Pennsylvania is higher than the national average: an NBC News poll in September showed that 54 percent of Americans felt abortion should be legal in all or most cases (while 44 percent said they felt it should be illegal in all or most cases).",
    "Sen. Bob Casey, D-Pa., has called himself a “pro-life Democrat,” though he has voted in support of several bills that support abortion rights throughout his three terms in the Senate, including one last month that would have codified abortion rights into federal law.",
    "Josh Shapiro, Pennsylvania’s Democratic attorney general who is running to become the state’s next governor, has no opponents in his primary, a loaded war chest and a record of accomplishments to run on that back up the promises he’s made on the campaign trail.",
    "Put together, strategists, former lawmakers and Pennsylvania politics watchers told NBC News, it could mean that a focus on abortion rights — traditionally a white-hot motivator for Republican voters — could help Democrats, even in purple states, like Shapiro.",
    "As a candidate, he’s mentioned his support frequently, tweeting and saying at events often that “abortion is health care.”\nThat has earned him the ire of various pro-life groups, which have already announced aggressive measures to oppose his campaign.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nThat kind of early pushback suggests how perilous it is for Shapiro, especially so early in the campaign and without any competition, to press on such a divisive issue.",
    "Since the beginning of the year, Republican lawmakers have advanced bills to bar state funding to health care entities that perform abortion services, and to amend the state’s constitution to say that there is no constitutional right to abortion.",
    "“Assuming the Supreme Court rules on the Mississippi case in a way that severely restricts abortion rights, or even tosses Roe, it’s going to be a huge, huge issue, one that can really turn out Democratic voters in an off year,” he added.",
    "And in Pennsylvania, where the Republican-controlled legislature has passed several restrictive reproductive measures in recent years, a governor’s veto is the only thing preventing the state from enacting harsh anti-abortion laws.",
    "The Susan B. Anthony List, a nonprofit that seeks to end abortion in the U.S., has already vowed to dispatch volunteers to reach 500,000 voters across the state in an attempt to use his position against him with pro-life voters.",
    "I’d be looking to sound the alarm on this issue, because it’s a turnout issue for Democrats and progressives, and Josh Shapiro might be worried, with good reason, that they don’t come out,” said former Democratic Gov.",
    "If the Supreme Court overturns or guts abortion rights when it rules on the Mississippi law this summer, such restrictive abortion laws in Pennsylvania could subsequently go into effect in a Republican administration.",
    "He frequently and loudly discusses his record, as the state’s top law enforcement officer, in protecting women's reproductive rights, and the actions he’s taken to fight restrictive abortion laws in other states.",
    "Locked in a close race, Peters, just days before the election, shared a harrowing story about his wife requiring a medically necessary abortion at four months pregnant — and being denied the procedure initially.",
    "“It cuts both ways,” he added, “because at some point you’re firing up both of your bases.”\nShapiro, for his part, said he’s not concerned with any political risks of talking so loudly about abortion rights.",
    "“It’s a gamble in Pennsylvania.”\nGalko added that the issue will still remain an energizer for Republican voters in Pennsylvania, and nationally, meaning it could backfire, or neutralize Shapiro's approach.",
    "Shapiro’s emphasis on a traditionally divisive culture war issue, so outspokenly and so early in the campaign, comes with large political risks in a purple state with a large population of Catholic voters.",
    "Rep. Conor Lamb, among the leading Democrats running to replace Sen. Pat Toomey, R-Pa., has said he personally holds pro-life views but has voted repeatedly voted in support of protecting abortion rights.",
    "All of that could boost Democratic turnout in the November midterms — which would help Shapiro overcome the historical pattern of the president’s party tending to suffer big losses in midterm elections.",
    "Get in front of the issue, the ruling, drum up the base vote, because it’s one that can be fickle in the midterm cycle,” said David Dix, a political strategist who works with candidates in both parties.",
    "That reality means Shapiro’s aggressive posture on the issue is likely to get Democratic voters to the polls at levels higher than in typical midterm cycles, strategists and former lawmakers said.",
    "Among all Pennsylvania voters, 53 percent said abortion should be legal under certain circumstances, according to a Franklin & Marshall College poll released this month.",
    "Several mentioned Sen. Gary Peters’, D-Mich., decision to go on offense on the abortion rights issue as the main reason he won a tight re-election race in 2020.",
    "Added Rendell, “A serious threat to abortion rights will move the needle.”\n“Josh knows he needs to get Democratic voters energized and engaged,” he said.",
    "Shapiro’s sharp and early focus on abortion rights, however, is likely to boost his campaign, strategists and politics watchers in Pennsylvania said.",
    "“The reason I talk about it as frequently as I do is because the stakes couldn’t be higher,” he told NBC News in an interview last month.",
    "Thirty-one percent said it should be legal under all circumstances, while 13 percent said it should be illegal in all circumstances.",
    "Many of the dozen Republican candidates jockeying to be the party’s nominee have said they would sign such bills into law.",
    "Tom Wolf vetoed three that passed in 2021 (and has vowed to veto more throughout the remainder of his time in office).",
    "Shapiro, as attorney general, has repeatedly come down firmly in support of protecting or expanding abortion rights.",
    "Republican lawmakers have advanced at least six bills in recent years seeking to restrict abortion access.",
    "“It’s definitely something that has perplexed a lot of Republicans as well as onlookers in his own party.",
    "“It is clear to all observers that we can no longer rely on the courts to protect reproductive rights.",
    "If that occurred, states would once again control whether or in what circumstances abortion was legal.",
    "Abortion rights advocates said the move helped him narrowly edge John James, his pro-life opponent.",
    "His campaign offers a glimpse into what could be the nation’s shifting politics on abortion.",
    "Under current Pennsylvania law, abortions are allowed up to the 24th week of pregnancy.",
    "In Pennsylvania, abortion has long been an issue many Democrats approach with nuance.",
    "Abortion has typically energized Republican voters more than Democratic ones.",
    "It’s a risky approach, but it may end up being a key to victory in November.",
    "He also has been uniquely outspoken about his support for abortion rights.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Both men, like approximately 25 percent of the state, are Catholic.",
    "“If I was a Democrat running in 2022, I’d be worried about turnout.",
    "The nonpartisan Cook Political Report rates the race as a toss up.",
    "“It seems to be a clear part of his strategy to boost turnout.",
    "Incumbent Democratic Gov.",
    "Ed Rendell."
  ]
}