{
  "id": 14209,
  "mediaId": 8469,
  "date": "2022-03-18",
  "headline": "Shapiro pitches tax plans, including gas refund",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2022/03/128312925_web1_JOSH-1.jpg.optimal.jpg",
  "link": "https://s24526.pcdn.co/news/1545388/shapiro-pitches-tax-plans-including-gas-refund",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill OBoyle boboyle@timesleader.com",
  "authorUrl": "",
  "termIds": [
    3926,
    392,
    6727
  ],
  "sentences": [
    "As governor, I’ll always have Pennsylvanians’ backs, and I’ll bring people together in Harrisburg to eliminate the cell phone tax, expand the property tax and rent rebate, and send a gas tax refund to Pennsylvanians to ensure we deliver real relief for working families across our Commonwealth.”\nThroughout his career, Shapiro said he has prioritized fiscal responsibility and worked to put money back in Pennsylvanians’ pockets.",
    "If they do not, I will be ready on Day One to bring people together, deliver for Pennsylvanians, and put money back in folks’ pockets.”\nCrossing the Commonwealth\nShapiro said he has been campaigning throughout the Commonwealth, talking to voters and “listening to their struggles.” He said he has been “super encouraged” by the enthusiasm of voters from all walks of life.",
    "That’s why Shapiro said he is releasing a three-part plan to cut taxes, protect consumers, and put money “back in folks’ pockets.”\n“Pennsylvanians are being crushed under a mountain of rising prices – the cost of everything from food to gas keeps going up, and I know it’s weighing on folks all across the Commonwealth,” Shapiro said.",
    "“Voters want to elect someone who will get things done and I have done that.”\nShapiro said the aftermath of the 2020 election was “a scary time,” stating that “our democracy was at risk.” He said he sees Luzerne County as a key inn his election chances, adding that he carried county in his last two campaigns.",
    "Shapiro’s plan to cut taxes and put money back in Pennsylvanians’ pockets includes:\n• Eliminating the Commonwealth’s “Cell Phone Tax”\nAs governor, Shapiro said he would sign legislation to eliminate the gross receipt and sales tax portions of the state cell phone taxes.",
    "Pennsylvania’s taxes on cell phone service are the 7th highest in the country, and by eliminating them, Shapiro said he will save every Pennsylvanian 11% on their monthly cell phone bill and reduce the overall tax burden by $317 million.",
    "• Sending a gas tax refund to Pennsylvania drivers\nAs governor, Shapiro said he would work with the Legislature to send Pennsylvania drivers a gas tax refund of $250 per personal passenger vehicle — up to four per household.",
    "As the chair of the Montgomery County Board of Commissioners, Shapiro said he led a fiscal turnaround, keeping taxes among the lowest in the region, while closing a $10 million budget gap within two years of taking office.",
    "As governor, Shapiro said he would sign legislation to expand this program by raising the income threshold to $30,000 for renters and $50,000 for homeowners, so that 275,000 more Pennsylvanians are eligible to apply.",
    "• Expanding the Property Tax and Rent Rebate program\nPennsylvania has a property tax and rent rebate program used by many elderly, widowed, and disabled people to help afford their property tax or rent.",
    "Unlike other plans, Shapiro said his proposal would put money directly into people’s pockets, while ensuring we continue to fully fund our roads and bridges, as well as the Pennsylvania State Police.",
    "In an interview at the Times Leader, Shapiro said he knows Pennsylvanians are struggling with and worried about rising costs — as the prices of food, gas, and other staples continue to climb.",
    "“They’re being forced to stretch their paychecks further, and that’s why we need to take real action to cut taxes, protect consumers, and put money back in Pennsylvanians’ pockets.",
    "As gas prices rise, Pennsylvanians are paying more at the pump, and Shapiro said he would use unspent American Rescue Plan funds to issue a gas tax refund to Pennsylvania drivers.",
    "He said he has secured more than $328 million in relief for everyday consumers, seniors who’ve been scammed, and students preyed upon by private lenders in the Commonwealth.",
    "Shapiro said he would also increase the total rebate amount so that qualified individuals can receive up to $1,000, putting up to $500 more back in Pennsylvanians’ pockets.",
    "Currently, this program is available only to renters who make below $15,000 and homeowners making below $35,000, and it provides a maximum standard rebate of $650.",
    "WILKES-BARRE — Attorney General Josh Shapiro Thursday released a plan to tackle rising costs and cut taxes for Pennsylvanians if he is elected governor.",
    "More than 97% of Americans report owning a cell phone and Shapiro believes it’s time to make it cheaper for Pennsylvanians to stay connected.",
    "Shapiro said he knows that Pennsylvanians are struggling to get by amid rising prices — and as governor, he said he will have their backs.",
    "“The Legislature should immediately take up this plan to provide relief and reduce costs at a time of rising prices.",
    "Shapiro noted that he received more votes in his 2020 reelection campaign than anyone in Pennsylvania history.",
    "As attorney general, Shapiro said he has stood up to powerful corporations in defense of taxpayers.",
    "Shapiro, 48, is the presumptive Democratic candidate for governor in the May 17 Primary.",
    "While costs have risen 43%, Shapiro said the program hasn’t changed since 2006.",
    "“What I’ve seen is not so much partisanship, but frustration,” he said.",
    "“I will listen to voters and I will offer specific solutions,” he said.",
    "Democratic gubernatorial hopeful meets with Times Leader\nTired of ads?",
    "Reach Bill O’Boyle at 570-991-6118 or on Twitter @TLBillOBoyle.",
    "Subscribers enjoy a distraction-free reading experience.",
    "“Pennsylvanians are hurting right now,” Shapiro said.",
    "Click here to subscribe today or Login."
  ]
}