{
  "id": 15205,
  "mediaId": 2658,
  "date": "2022-03-06",
  "headline": "The Democratic Party’s emerging priority: Save the governors",
  "image": "https://static.politico.com/ea/b7/3b0bbb1b448083ee7ba467470792/election-2022-democratic-governors-27297.jpg",
  "link": "https://www.politico.com/news/2022/03/06/democratic-party-priority-save-governors-00014364",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4967,
    4971,
    4635,
    2716,
    1489,
    392,
    390,
    6729
  ],
  "sentences": [
    "“The Republican attacks on democracy and revelations about Republicans’ attempts to overturn the 2020 election have made clear that preserving American democracy requires electing Democratic governors, especially in Wisconsin, Michigan and Pennsylvania,” said Wisconsin state Democratic Party Chair Ben Wikler, who called the shift in donors interested in state races “a night and day difference.”\nDemocratic Association of Secretaries of State Executive Director Kim Rogers said she’s seen “talk moving into action,” noting that she expects to raise $15 million this cycle.",
    "“Of the pool of major donors — of big, institutional donors behind the DNC and the DCCC — I’d say 50 to 60 percent of them are now putting that same effort into governors, and I expect that group of donors to only grow.”\nMuch of the focus from donors on down has centered on the governor races in key battleground states, though there is an expectation that more money and support will also trickle down to candidates for secretaries of state and attorney general as well.",
    "Democratic governors in Pennsylvania, Wisconsin and Michigan — states President Joe Biden narrowly won in 2020 — have all touted their roles as bulwarks for free elections, and those running for governor in Republican-held state capitals of Arizona and Georgia are pitching themselves as the last opportunity for the party to ensure that those states aren’t lost to Donald Trump-supporting election conspiracists.",
    "“For those that also care about the presidential election and races,” said Guy Cecil, chair of Priorities USA, a major Democratic super PAC, “these governor’s races are absolutely must-wins.”\nDemocrats contend that they can prioritize governor’s offices as well as the races for state elections chiefs without it coming at the expense of Senate and House contests.",
    "“This is critical for us to win in 2024.”\nA coordinated, and well-funded push from Democrats centered around these contests would amount to a role-reversal of sorts for a party whose major and grassroots donors are often criticized for sinking large sums into long-shot candidates for the House and Senate.",
    "But party operatives stressed that they’re far more attentive to these races than were during the early Obama years, when a lack of resources and attention doomed them in down-ballot races — losing a dozen governor’s mansions and nearly a 1,000 state legislative seats during his two terms.",
    "The DNC, meanwhile, is spending $20 million via coordinated campaigns in targeted battleground states — including Arizona, Georgia, Michigan, Pennsylvania and Wisconsin — for voter protection efforts, data and tech infrastructure, and state party-building around governor’s races.",
    "Biden “wanted to ensure that on the ground, lessons learned from what we did in ’20, his list, his volunteers, were put to use in the midterms and that we were doing everything possible,” a top Biden adviser said of the president’s early involvement in the 2022 elections.",
    "One example is Democratic megadonor George Soros, who seeded his super PAC with $125 million to focus on pro-democracy efforts and cut big checks to the Democratic Association of Secretaries of State, a group that focuses on electing Democrats to these offices.",
    "But a DNC official stressed the committee is helping to fund state coordinated campaigns and pay for additional staff in states like Maryland (where Democrats are likely to flip the governorship) and Kansas (where the party is trying to hang on to the office).",
    "“Republicans figured out that if you can rule locally, you can control a lot of the process federally, and we’re finally, finally, seeing national Democrats come around to realizing that, too,” said Morgan Jackson, a senior adviser to North Carolina Gov.",
    "Ahead of the midterm elections, Democrats are expanding their scope far beyond congressional contests and on to governor races in battleground states, seeing them as existential for the party’s presidential prospects, if not democratic governance itself.",
    "A Washington, D.C.-based bundler said that “‘save the House’ messaging is not working on high-level donors because no one believes it.”\nOvershadowing all these considerations is the party’s failure to pass voting rights legislation this past year.",
    "Without legislative action, Democrats are hoping that governors can serve as a blockade of sorts on GOP-led laws to further dial back pandemic-era voting expansions, restrict voting access and curtail participation in future elections.",
    "“My entire donating life has always been centered around Congress, but I really think that if you care about democracy, you need to worry about these governors’ races,” said Steve Elmendorf, a Democratic donor and lobbyist.",
    "But should he bow out, a few donors noted that the party could — indeed, should — look to governors for “the next generation of Democratic leadership,” said a New York Democratic donor, citing North Carolina Gov.",
    "Arizona Secretary of State Katie Hobbs, a candidate for governor, became a national figure and regular on cable TV after challenging Trump-inspired election challenges and a controversial “audit” in her state.",
    "Interviews with a dozen Democratic donors, bundlers and donor advisers echoed that sentiment, with many citing the intersection of 2022 gubernatorial races with certification of the 2024 presidential results.",
    "In Wisconsin, operatives embedded in the state to help protect the vote have been on the ground since last year, and officials pointed to their coordinated work in New Jersey, where incumbent Democratic Gov.",
    "“There is no doubt that we are in a very different terrain when it comes to voting rights in these states and in a number of these states where Democratic governors are critical,” the Biden adviser said.",
    "Biden advisers and other party officials sought to cast the governor’s races as important not purely for political reasons, but also to maintain key partnerships on administrative and policy matters.",
    "Party leaders, deep-pocketed donors and leading super PACS were already planning to prioritize November’s gubernatorial contests, which have long been an afterthought on national election maps.",
    "American Bridge 21st Century, a Democratic group, is launching a new super PAC, Bridge to Democracy, starting with $10 million to focus exclusively on races related to election administration.",
    "Among the Republicans running to challenge him is state Rep. Timothy Ramthun, who has been carrying a (legally impossible) resolution to claw back the state’s 10 electoral votes from Biden.",
    "But their focus has intensified this past year after Republicans attempted to undermine and overturn the last election and Democratic-led federal voting rights legislation went up in smoke.",
    "“A lot of the Democratic donor base didn’t see governor’s races as very sexy, compared to federal ones, but I think we’re going to see historic investments this year,” he added.",
    "He and other top dignitaries — including the first lady, Vice President Kamala Harris and her spouse — are expected to sign quarterly emails and texts for fundraising purposes.",
    "But quietly, some in the party view the increased focus on governor contests as at least a tacit acknowledgement that they’re unlikely to keep control of the House in 2023.",
    "Some donors are even casting an eye toward 2024, seeing the Democratic bench of governors as among the party’s strongest standard-bearers and, quite possibly, its future.",
    "Pennsylvania Attorney General Josh Shapiro has been directly involved in nearly 50 lawsuits about the 2020 election that involved Trump, his allies, or other parties.",
    "The $15 million transfer the DNC made to campaign committees did not include the Democratic Governors Association or other groups affiliated with state races.",
    "Several officials pointed to the incumbent governors’ support throughout the Covid-19 pandemic and in passing the massive infrastructure bill as evidence.",
    "Cooper Teboe, a donor adviser based in Silicon Valley, said he’s “seen a real shift” among major Democratic donors in their approach to state-based races.",
    "And along with Michigan, they are some of the places that Biden and other officials have kept particularly close to in terms of frequent travel.",
    "But the party’s major campaign institutions are also prioritizing gubernatorial races with an urgency that they say they haven’t felt before.",
    "Phil Murphy was reelected in a closer-than-expected off-year race, as a model for the unprecedented level of resources in the party.",
    "“But it’s also a factor that we want more democratic governors, and that governors are the ones who are executing on programs.”",
    "Amongst donors, “there’s a real pessimism” for “the federal outlook in 2022,” said one New York-based Democratic donor adviser.",
    "But the contests in Pennsylvania, Wisconsin and Georgia also coincide with marquee Senate and some battleground House races.",
    "“People are looking for something at the gubernatorial level that they’re not finding in Congress,” the donor added.",
    "Biden issued an early commitment through the Democratic National Committee to help fund House and Senate races.",
    "Roy Cooper, Shapiro and Georgia gubernatorial candidate Stacey Abrams as potential POTUS material.",
    "His race has taken on added significance because the governor there appoints a secretary of state.",
    "They also hold outsized importance for Democrats’ Electoral College math ahead of 2024.",
    "They’ve lost winnable open-seat contests, including the Virginia race last year.",
    "Since 2014, Democrats have managed to reelect all of their incumbent governors.",
    "Tony Evers has vetoed numerous Republican-backed bills to change election laws.",
    "Biden also pledged to headline a marquee fundraiser for the DGA.",
    "Biden and his advisers insist he is running for re-election.",
    "Roy Cooper, chair of the Democratic Governors Association.",
    "Overall, 36 races for governor are happening this year.",
    "In 2018, the group raised $1.5 million.",
    "In Wisconsin, Gov."
  ]
}