{
  "id": 15494,
  "mediaId": 6571,
  "date": "2022-03-08",
  "headline": "Pennsylvania Average Gas Price Jumps To Over $4.30 Per Gallon",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/03/08/866dded7-6c71-481d-8aa2-2af449deea33/thumbnail/1200x630/1950601eaf0af94c4c45c3d67213e71d/image_from_ios-2.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/pennsylvania-average-gas-price-jumps-to-over-4-per-gallon/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4232,
    185,
    6117,
    6506,
    5933,
    6520,
    6567
  ],
  "sentences": [
    "RELATED STORIES:\nUber Adding Surcharge To Help Drivers Deal With Soaring Gas Prices\nGiant Eagle Extends Expiration Of Perks Through 2022 In Response To Gas Prices, Inflation\nAttorney General Josh Shapiro Says He Lacks Power To Investigate Price Gouging At The Pump\nSmall Business Owners Absorbing Cost Of Rising Gas Prices For Now\nSpike In Gas Prices Making It Harder For Delivery And Rideshare Services\nAs Gas Prices Soar, Pittsburghers Looking Into Alternative Forms Of Transportation\n\"I would hope they would all come together and give us the authority we need to protect consumers at the pump, to protect them at the grocery store, or wherever they're seeing significant spikes in cost,\" said Shapiro.",
    "Attorney General Josh Shapiro says he lacks the power to investigate price gouging at the pump -- but would like both the Governor and the legislature to give any attorney general the standalone power to look into the gouging of gas prices.",
    "(Photo Credit: KDKA Photojournalist Brian Smithmyer)\nA question that many are wondering now -- is it possible some are taking advantage of the Russian invasion of Ukraine to unfairly jack up prices?",
    "PITTSBURGH (KDKA) -- With average gas prices reaching record highs in Pennsylvania, the prices are hurting everyday drivers, and even those who make a living on the road.",
    "READ MORE:\nAverage gas prices across the country\nFinding cheap gas in Allegheny County\nA break in the surging gas prices isn't expected anytime soon.",
    "Pennsylvania's average is $4.31 per gallon, with average prices in Allegheny County and Pittsburgh a tick lower at $4.28 and $4.26, respectively.",
    "At a BP gas station along McKnight Road in Ross Township, prices were listed as high as $4.39 per gallon early Tuesday morning.",
    "\"I filled up my Toyota Highlander for $4.19 a gallon and that wasn't pleasant,\" said Mark Niskosky of Donora.",
    "According to AAA, the national average for a gallon of regular unleaded gasoline is now $4.17.",
    "Drivers are really feeling the pain of sticker shock when they need to re-fill their tanks.",
    "The Oil Price Information Service says a national average of $5.00 per gallon is possible.",
    "Drivers in the United States have never paid this much for gasoline.",
    "In:\nAllegheny County\nGas Prices"
  ]
}