{
  "id": 15573,
  "mediaId": 6571,
  "date": "2022-03-07",
  "headline": "Attorney General Josh Shapiro Says He Lacks Power To Investigate Price Gouging At The Pump",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/11/28/64172f5b-9c44-4a2f-9c1f-7dff51cfde1e/thumbnail/1200x630/67302f2619498e72642dedd58f1f3742/gasoline-pump.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/josh-shapiro-says-he-lacks-power-to-investigate-price-gouging-gas-prices/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"My office was able to engage in thousands of investigations into price-gouging, whether it was for Purel or masks or other things that were associated with really significant price spikes at the time, and we held a lot of businesses and companies accountable,\" he said.",
    "With so many players in the gasoline market -- producers who drill for oil, refiners who turn it into gasoline, distributors who get the gas to various regions and your neighborhood service station dealer -- it's not easy to tell who, if anyone, is cheating.",
    "\"When Republicans in the Legislature put forward that constitutional amendment, which was ultimately supported by the people, to end the governor's declaration, it also ended the attorney general's ability to go after price gouging,\" Shapiro said.",
    "\"It's the idea that some seller is taking advantage of an extreme event to charge a price that is totally disconnected of producing or providing the product,\" says Prof. Jeremy Weber, an economist at the University of Pittsburgh.",
    "\"I would hope they would all come together and give us the authority we need to protect consumers at the pump, to protect them at the grocery store, or wherever they're seeing significant spikes in cost,\" Shapiro said.",
    "PITTSBURGH (KDKA) -- With gasoline prices spiking so dramatically over the last week, it's only natural to wonder if someone is taking advantage of the Russian invasion of Ukraine to jack up prices unfairly.",
    "Pennsylvania Rep. Ryan Warner, a Fayette County Republican who chairs the House energy subcommittee, supports legislation to give the attorney general power to investigate price gouging.",
    "WATCH: Jon Delano reports\nPennsylvania is one of those states that links an attorney general's investigation of price gouging to a governor's declaration of an emergency.",
    "In the meantime, the state does have some consumer protection and deceptive trade practices laws, so Shapiro still wants to know of suspected price gouging at the pump.",
    "Shapiro says he really would like both the governor and the Legislature to give any attorney general the stand-alone power to investigate price gouging.",
    "In an exclusive interview seen only on KDKA-TV, money editor Jon Delano spoke with Attorney General Josh Shapiro about price gouging in Pennsylvania.",
    "When gasoline prices jump 40 to 50 cents a gallon in seven days, it's hard not to suspect something illegal is going on.",
    "So far, no decision on whether to declare an emergency over energy pricing or the impact of the war in Pennsylvania.",
    "Shapiro says he can't know for sure because he no longer has the power to investigate price gouging.",
    "But Warner adds, \"There is nothing that prevents the governor from declaring a state of emergency.",
    "Other links\nState By State Gas Prices\nCheap Gas In Allegheny County\nIn:\nPennsylvania\nGas Prices",
    "It's certainly putting a pain on people's purses and wallets and family budgets, no question.",
    "If you suspect you are the victim of price gouging, contact the attorney general's office.",
    "Shapiro had that power during the COVID emergency until the Legislature ended it.",
    "\"And so it's made it actually harder for us to go out and protect consumers.\"",
    "WATCH: One-On-One With Shapiro reports\nWhat exactly is price gouging?",
    "But it doesn't necessarily mean it is price gouging,\" Shapiro said.",
    "KDKA also reached out to the governor's office.",
    "Click here for more about filing a complaint.",
    "\"Not all price increases are price gouging.",
    "I don't know if we're at that stage yet.\"",
    "\"The problem is today we can't do that.\"",
    "But is it?"
  ]
}