{
  "id": 15598,
  "mediaId": 8468,
  "date": "2022-03-06",
  "headline": "Bridgeport residents, Saints Peter and Paul Ukrainian Catholic Church rally to support Ukraine",
  "image": "https://www.timesherald.com/wp-content/uploads/2022/03/concluding-remarks-IMG_1353.jpg?w=1024&h=768",
  "link": "https://www.timesherald.com/2022/03/06/bridgeport-residents-saints-peter-and-paul-ukrainian-catholic-church-rally-to-support-ukraine/",
  "mediaOutlet": "timesherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Russell Rubert",
  "authorUrl": "https://www.timesherald.com/author/russell-rubert/",
  "termIds": [
    0
  ],
  "sentences": [
    "The rally ended with Ukrainian American children and adults holding the American and Ukrainian flags together in a sign of unity\nThe rally was planned and organized by Father Popivchak and Bridgeport Borough council president Kyle Shenk, who posted of the event on social media.",
    "UPPER MERION — The “Rally to Support the People of Ukraine” was held at Saints Peter and Paul Ukrainian Catholic Church, 519 Union Avenue, the corner of Hurst and Union in Bridgeport on Sunday, March 6, 2022.",
    "Text of the flyer distributed to the crowd entitled “Virtue, Liberty and Independence” concluded with the words:\n“The promise of liberty, the preservation of independence is a long and difficult journey.",
    "A large crowd gathered for a Ukrainian-language mass in the church, many holding small Ukrainian flags or clothed in the Ukrainian national colors of blue and yellow to demonstrate their unity.",
    "U.S. Rep. Scanlon said “Putin wasn’t expecting a united front” Included on the dais were local state representatives, State Rep. Tim Briggs and State Senator Amanda Cappelletti.",
    "Final speaker Boris Pawluk brought the crowd to its feet with his mention of how the capital of the Ukraine was expected to fall within 48 hours yet still stands.",
    "Father Popivchak is the author of the book “Bishop for a Day” and live streams the holy mass in the Ukrainian language every week for a nationwide audience.",
    "In prepared remarks PA Attorney General Josh Shapiro spoke of being the great-grandson of an immigrant and expressed solidarity with the Ukrainian people.",
    "The rally began with introductions by Bridgeport Borough Council President Kyle Shenk and an emotional anecdote and appeal by Father Popivchak.",
    "Afterwards they filed out and down the sidewalk a short distance to the school building where the rally was held due to the inclement weather.",
    "His impromptu call for an “Iron Dome” of air cover and other calls for American assistance brought the audience to its feet in applause.",
    "They were followed with brief and sincere remarks of support by United State Representatives Madeleine Dean and Mary Gay Scanlon.",
    "Father Ron Popivchak took donations for Ukrainian relief and told the rally attendees how they can help in the future.",
    "Yellow and blue flyers were handed out urging support for the beleaguered Ukrainian nation and its battered citizens.",
    "The church was founded in 1924 to minister Ukrainian immigrants to the greater Bridgeport area.",
    "U.S. Rep. Dean condemned the Russian invasion as “Not a War, but a series of War Crimes”.",
    "Determined that as free people we claim the right to be masters of our own destiny.",
    "Dr. Ronald Popivchak has served the community as pastor for more than 50 years.",
    "Donations will go to the Ukrainian bishop, currently on the Polish border.",
    "That as independent, virtuous souls we claim the right to live in peace.”",
    "Bridgeport Mayor Beth Jacksier expressed her gratitude for all attending.",
    "She called for air cover and significant aid of aircraft and weaponry.",
    "According to police over 300 people attended the event.",
    "Only with virtue can we prevail.",
    "Steadfast, united and strong.",
    "The Rev."
  ]
}