{
  "id": 15608,
  "mediaId": 8356,
  "date": "2022-03-11",
  "headline": "Wondering how you can help the people of Ukraine? Look no further.",
  "image": "https://www.gannett-cdn.com/presto/2022/03/02/PPYR/38af58ec-69e1-47cd-8a74-1068c840773f-cap.jpg?crop=1004,565,x1,y589&width=1004&height=565&format=pjpg&auto=webp",
  "link": "https://www.ydr.com/story/news/2022/03/11/central-pennsylvania-wondering-how-you-can-help-people-ukraine-look-no-further/9437932002/",
  "mediaOutlet": "ldnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaity Assaf",
  "authorUrl": "https://www.ydr.com/staff/7585021002/kaity-assaf/",
  "termIds": [
    2583,
    6672,
    6364,
    6506
  ],
  "sentences": [
    "That means that you will get a 60-minute family or maternity photo session (immediate family members only) with styling service and all her prep guides, all the digital images from your session, and a $300 print credit for use in your gallery shop.",
    "Tips on donations to help Ukraine\nIn a news release, Attorney General Josh Shapiro on Thursday encouraged Pennsylvanians to follow three simple steps to avoid being scammed:\nStep 1 — Ask Questions:\nWhere will your donation go specifically?",
    "If you believe you have been a victim of a scam, contact your local police to file a report and to file a complaint with the Office of Attorney General’s Bureau of Consumer Protection at: 800-441-2555 or at www.attorneygeneral.gov/scams.",
    "Items needed for humanitarian aid:\nsleeping bags\ntowels\nraincoats\nunderwear\nsocks\ndiapers\ncoolers\ncanned food\nbatteries\nMonetary donations are also accepted and will be distributed to churches and organizations in Ukraine.",
    "If you would like to contribute to this effort, you can do so via www.bethanyslavic.org or mail a check to Bethany Slavic Church, 864 Dawn Ave, Ephrata, PA 17522 and indicate that this is for the Ukraine Refugee Fund.",
    "Bethany Slavic Church\nThe church is partnering with local churches on the Ukrainian border to get food and clothing and to find temporary housing while refugees wait to get cleared to cross the borders.",
    "York College\nYork College has a partnership with a university in Poland, the State University of Applied Science in Wloclawek, which was created by Klaudia Lewis of the Stabler Department of Nursing.",
    "Businesses, churches, organizations, colleges and even photographers are coming together throughout the central Pennsylvania region to raise money and collect donations to help the people of Ukraine.",
    "Nexterus\nA freight forwarding service in New Freedom will be allowing community members across the region to donate relief supplies and place them in a drop-box in their lobby, 802 Far Hills Drive.",
    "Also of interest:Schools are desperate for substitute teachers: Here's how you can help\nNaomi Boyer, family photographer in Lebanon\nNaomi Boyer is holding a raffle to benefit Ukrainian refugees.",
    "If you are looking to donate to this effort, here are some to choose from:\nAmerican Red Cross\nRed Cross teams are working tirelessly to help people and communities impacted by conflict.",
    "Step 2 — Double Check:\nCheck with the IRS or the Pennsylvania Department of State registries to see if this organization is registered and if donations are tax deductible.",
    "Over the past week in Ukraine, Red Cross Teams have:\nDistributed more than 90,000 food and hygiene parcels to families on the move across Ukraine, including Mariupol.",
    "Lewis has set up an Amazon gift registry account in her name that anyone can use to purchase items to be sent to the State University of Applied Sciences.",
    "Supplies will be accepted in the lobby Monday through Friday from 8:30 a.m. to 6:30 p.m. and will be available outside after-hours, weather permitting.",
    "The collection will continue through Friday evening and the committee will pick up the supplies to be sent to Ukraine.",
    "Delivered more than 32 tons of food, blankets, medicine, medical supplies, trauma kits and household items.",
    "In Pennsylvania, all non-religious non-profit organizations must register with the Department of State.",
    "House of Prayer\nThe Slavic Christian Church in Wrightsville is accepting donations through March 26.",
    "Purchase a ticket by making a £15 ($20) donation to www.rescue.org/ International Rescue Committee.",
    "Distributed critical care items to over 7,000 people seeking safety from shelling in bomb shelters.",
    "Charities should always be able to give you specific information on what your donation will fund.",
    "Kaity Assaf is a regional news reporter at York Daily Record, part of the USA Today Network.",
    "The prize will be her highest collection — the Keepsake Collection — with all expenses paid.",
    "Provided first aid training to more than 12,000 people in metro stations and bomb shelters.",
    "Send your receipt from IRC to naomi@naomiboyerphotography.com to claim your ticket numbers.",
    "All donations are tax-deductible; 100% of your donations will go directly to help refugees.",
    "To donate, go to the www.redcross.org/donate/donation and select \"disaster relief.\"",
    "Contact her at kassaf1@ydr.com, on Twitter @kaitythekite or by phone, 717-472-0960.",
    "The session will be transferable, so if you win, you can gift it to someone else.",
    "People can donate funds to the committee itself on their website, www.uuarc.org.",
    "The company is partnering with the United Ukraine American Relief Committee.",
    "Step 3 — Be Careful How You Pay:\nNever donate in cash or on your debit card.",
    "Venmo @HouseofPrayerWrightsville or make checks payable to House of Prayer.",
    "These items will be sent to Poland but charged to an individual’s account.",
    "Please support local journalism with a digital subscription.",
    "Assisted with the evacuation of people with disabilities.",
    "Contact Lewis at klewis18@ycp.edu for instructions.",
    "The raffle will take place on Saturday, March 19.",
    "Credit cards are best."
  ]
}