{
  "id": 1561,
  "mediaId": 8314,
  "date": "2022-02-16",
  "headline": "Your semi-regular reminder to VOTE",
  "image": "",
  "link": "https://epgn.com/2022/02/16/your-semi-regular-reminder-to-vote/",
  "mediaOutlet": "epgn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Villemez",
  "authorUrl": "https://epgn.com/author/jason-villemez/",
  "termIds": [
    0
  ],
  "sentences": [
    "Even if one opens up in 2023, a full two years before the next election, it’s a near certainty that a Mitch McConnell-led Senate would not bring a Biden candidate up for a vote.",
    "First, we have a U.S. Senate race, featuring openly gay candidate Malcolm Kenyatta, that may very well determine which party controls power in the too-influential body.",
    "The reason we don’t have statewide nondiscrimination protections in Pennsylvania is because Democrats have not controlled both houses of government since 1993.",
    "Three seats currently held by Democrats — Georgia (Rafael Warnock), Arizona (Mark Kelly), and New Mexico (Catherine Cortez Masto) — are all tossups.",
    "There are several vital races that will determine the course of lot of vital issues, including ones that will greatly impact the LGBTQ community.",
    "If all three of those seats switch to Republican, that means Democrats will need to flip three seats in order to maintain control of the Senate.",
    "Pennsylvania is probably the “easiest” seat to potentially flip, with Wisconsin and North Carolina being the other two most likely candidates.",
    "So mark May 17th on your calendar, request your mail-in ballot if you want to vote by mail, and tell all your friends to do the same.",
    "If Democrats don’t maintain control of the Senate, they won’t be able to appoint a new Supreme Court Justice should a spot open up.",
    "In less than three months, people will decide which candidates they want to represent their party in November’s general election.",
    "(That fact is probably one reason why Justice Stephen Breyer decided to retire this year rather than later.)",
    "Which brings us to the second important race in the 2022 primary, the race for Governor of Pennsylvania.",
    "It helps campaigns see which regions and demographics they need to focus on in the general election.",
    "We have an incredible amount to lose if candidates who don’t support our community are elected.",
    "Our rights and, to be honest, our lives, are always on the line, both federally and statewide.",
    "It’s a lot easier to vote if it becomes a habit and not a once-every-four-years event.",
    "But that doesn’t mean that voting for governor in the primary isn’t without benefits.",
    "It’s highly likely we will never have a nondiscrimination bill until that happens.",
    "And the only way for that to happen is for as many people to vote as possible.",
    "Josh Shapiro is the only candidate for Governor in the Democratic primary.",
    "He’s going to win the primary regardless of the number of people who vote.",
    "To be perfectly honest, 100% of eligible LGBTQ voters need to go and vote.",
    "There are also State Senate and House races happening in the Primary.",
    "Those races are equally as important as a U.S. Senate or House race.",
    "As high as LGBTQ turnout was in 2020, it needs to be higher in 2022.",
    "It’s incumbent on every single one of us to do our part and vote.",
    "It’s possible that Republicans will be able to flip those seats.",
    "Pennsylvania’s 2022 primary elections are coming up on May 17th.",
    "Voter turnout in the primary is good for momentum building.",
    "And in 2022, it’s easier than ever to vote in Pennsylvania.",
    "There’s no reason that percentage shouldn’t be that high.",
    "That includes, especially and importantly, LGBTQ people.",
    "And primaries help to normalize voting.",
    "There is truly no excuse not to do it.",
    "But rest assured, it won’t be easy.",
    "Then, when the time comes, VOTE."
  ]
}