{
  "id": 15737,
  "mediaId": 8253,
  "date": "2022-03-06",
  "headline": "Hundreds attend rally for Ukraine in Montgomery County",
  "image": "https://cdn.abcotvs.com/dip/images/11626081_030622-wpvi-beccah-ukraine-rally-noon-video-vid.jpg?w=1600",
  "link": "https://6abc.com/ukrainian-rallies-montgomery-county-saints-peter-and-paul-catholic-church-bridgeport/11625873/",
  "mediaOutlet": "6abc.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Beccah Hendrickson",
  "authorUrl": "https://6abc.com/about/newsteam/beccah-hendrickson",
  "termIds": [
    3926,
    3048,
    2763,
    5729,
    1022,
    6407,
    6007,
    6672
  ],
  "sentences": [
    "\"We want to give our people here a chance to express themselves in prayer because we are praying people,\" said Father Ronald Popivchak, who has served the Ukrainian community in Bridgeport for over 50 years.",
    "\"This is just so unfair to the Ukrainian people that had their freedom for so many years and it's just taken away from them,\" said Groff, who now lives in King of Prussia.",
    "At the rally she heard from local leaders and politicians too, like Congresswomen Madeleine Dean and Mary Gay Scanlon and Pennsylvania Attorney General Josh Shapiro.",
    "The rally was held at Saints Peter and Paul Ukrainian Catholic Church in Bridgeport, a center point for the Ukrainian community there for decades.",
    "BRIDGEPORT, Pennsylvania (WPVI) -- More than a hundred people gathered in Montgomery County Sunday morning for a rally in support of Ukraine.",
    "Draped in flags and carrying signs, Ukrainian-Americans said as they stood at the rally, they were also standing with their home country.",
    "\"We want to tell them, as loud as we can, that we're with them, love them, and didn't forget them,\" he said.",
    "\"We want a life with dignity, we want to see and kiss our children,\" Congresswoman Dean told the crowd.",
    "Thinking of her family on the frontline of war, Natalia Symoni said the emotion is hard to contain.",
    "He will accept donations for the next week and they will be sent to refugees currently in Poland.",
    "Popivchak said the church will also be collecting money for Ukrainian refugees.",
    "Lauren Groff said she was thinking of her family currently in a bomb shelter.",
    "He said it's important for his people to have an outlet.",
    "Neighbors stressed how much the support means to them.",
    "\"I am from Ukraine, my family is from Ukraine.",
    "I support my country,\" she said.",
    "I was born in Ukraine."
  ]
}