{
  "id": 15732,
  "mediaId": 8254,
  "date": "2022-03-07",
  "headline": "Barletta leads in latest Pennsylvania Governor GOP race poll",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AP22019776198323.jpg?w=1280",
  "link": "https://www.abc27.com/pennsylvania-governor-election-2022/barletta-leads-in-latest-pennsylvania-governor-gop-race-poll/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    0
  ],
  "sentences": [
    "The survey of 600 Pennsylvania Republican voters conducted by TargetPoint Consulting and published by The Washington Free Beacon, found Barletta with 17 percent support, followed by State Senator Doug Mastriano at 14 percent.",
    "Former U.S. Attorney William McSwain (7 percent) and President Pro Tempore of Pennsylvania’s Senate Jake Corman (6 percent) follow in the TargetPoint Consulting poll in third and fourth, respectively.",
    "(WHTM) – Former Congressman Lou Barletta leads the latest poll of Pennsylvania Republicans in a heavily-contested race for Governor, though a majority remain undecided.",
    "In a favorability poll of notable Republicans, former President Donald Trump had an 80 percent favorability, followed by former Vice President Mike Pence at 76 percent.",
    "Eight percent of respondents said they favored another candidate in the race, which features about a dozen candidates on the GOP side.",
    "Barletta was the Republican party’s Donald Trump-endorsed nominee for U.S. Senate and also served as Mayor of Hazleton.",
    "Forty-five percent of Republican voters say there are undecided on how they will vote in the May 17 primary.",
    "Fifty-two percent were 55 or older and the majority lived in or around Philadelphia or Pittsburgh.",
    "Both Senator Ted Cruz and Florida Governor Ron DeSantis had more than 60 percent favorability.",
    "Scott Martin, who dropped out of the race due to a leg injury, finished with three percent.",
    "Pennsylvania Attorney General Josh Shapiro is running unopposed on the Democratic ticket.",
    "Barletta had 24 percent support in a February poll conducted by The Trafalgar Group.",
    "Ninety-four percent of the respondents were white and 52 percent were male.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "Governor Tom Wolf is unable to run in 2022 due to term limits.",
    "Sign up for the abc27 newsletters here."
  ]
}