{
  "id": 16060,
  "mediaId": 8437,
  "date": "2022-03-08",
  "headline": "LETTER: To get action, sometimes Mariner East protests are helpful",
  "image": "https://www.dailylocal.com/wp-content/uploads/2021/08/dnews.jpg",
  "link": "https://www.dailylocal.com/2022/03/08/to-get-action-sometimes-mariner-east-protests-are-helpful/",
  "mediaOutlet": "southernchestercountyweeklies.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MediaNews Group",
  "authorUrl": "https://www.dailylocal.com/author/medianews-group/",
  "termIds": [
    0
  ],
  "sentences": [
    "Suzanne Walker, a Tennessee pipeliner, wrote an editorial on 2/12/22 criticizing protesters and touting all that ET has brought to PA. She never mentions that ethane shipped overseas to make plastic won’t provide “affordable, steady energy sources”.",
    "Despite 49 charges and 126 violations, she applauds the pipeline for “stringent environmental precautions” and “meeting or exceeding regulatory requirements “.",
    "Poor planning left ET far to the right and many feet below the point where they’d hoped to connect to pipes on the other side of the stream.",
    "She praises ET for jobs created, failing to mention that many workers arrive at the job in trucks bearing Texas plates.",
    "Giant sink holes risked property and lives, as the ground subsided around active pipelines carrying explosive gases.",
    "We protest because we refuse to be steamrolled by an out of state corporation wreaking havoc on our community.",
    "To solve that problem, for months they pumped up to a million gallons of water from the ground daily.",
    "In my neighborhood, Energy Transfer came through after promising us we’d never know they were here.",
    "ET spilled over 20,000 gallons of bentonite and secret proprietary ingredients into Marsh Creek.",
    "ET has the worst safety record and in 2018 had a pipeline explode just 7 days into operation.",
    "Like a giant mouse trap game, they had to use elbows and pieces to complete this section.",
    "ET’s bore pit filled like a swimming pool as they struggled to get through our wetlands.",
    "We discovered water choked with brown sediment pouring into the local trout stream.",
    "They set up equipment, clogged streets, tore up lawns, and knocked over mailboxes.",
    "The jury-rigged fence collapsed, thankfully avoiding the children who play there.",
    "We contacted the DEP, alerting them to illegal grouting in wetlands and streams.",
    "There’s no emergency plan for escape, besides run half a mile, upwind, on foot.",
    "Standing on ladders, we saw sinkholes in the wetlands being filled with grout.",
    "The Valley Creek stream bed opened and water flowed furiously into sinkholes.",
    "ET set up fences to keep the public from seeing into their own backyards.",
    "Just up the road, on Lisa Dr., ET forced 5 families from their homes.",
    "The AG, Josh Shapiro, charged them with 48 crimes and one felony.",
    "What is left behind after the horrors of construction have ended?",
    "ET kept trying different techniques and running into obstacles.",
    "We met our Attorney General at the lake and we protested.",
    "A large arm of the lake is still coated in their sludge.",
    "I’m not a rabble-rouser who enjoys stirring things up.",
    "ET has accrued 126 notices of violation from the DEP.",
    "One neighbor set up a camera to see over the fence.",
    "Eventually, the fence reached a height of 18 feet.",
    "It took them 7 months to install 300 ft. of pipe.",
    "Then, in my neighborhood, sinkholes opened up.",
    "The integrity of the pipe may be compromised.",
    "We don’t have any faith in Energy Transfer.",
    "We protest because we fear for our safety.",
    "I like to kayak, and photograph nature.",
    "With the water, came tons of sediment.",
    "ET fought to stop it with more grout.",
    "I protest the Mariner East Pipeline.",
    "The wetlands was a huge challenge.",
    "The neighbor raised the camera.",
    "We are so tired of protesting.",
    "Libby Madarasz\nWest Whiteland",
    "We were angry and frightened.",
    "We documented each incident.",
    "They created 13 sinkholes.",
    "ET built the fence higher.",
    "We are ordinary citizens.",
    "I don’t like to protest.",
    "A bomb beneath our feet.",
    "ET raised the fence.",
    "Yet, I protest.",
    "We were afraid.",
    "We protested.",
    "We protested.",
    "We protested.",
    "We protested.",
    "No one acted.",
    "We protested.",
    "We protested."
  ]
}