{
  "id": 1667,
  "mediaId": 8401,
  "date": "2022-02-17",
  "headline": "EXCLUSIVE: Pennsylvania Attorney General Again Determines Mysterious Death Of Ellen Greenberg A Suicide After Review",
  "image": "https://philadelphia.cbslocal.com/wp-content/uploads/sites/15116066/2021/10/ellen-greenberg.jpeg?w=1280",
  "link": "https://philadelphia.cbslocal.com/2022/02/17/ellen-greenberg-pennsylvania-ag-suicide-ruling-stabbed-manayunk/",
  "mediaOutlet": "philadelphia.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Petrillo",
  "authorUrl": "https://philadelphia.cbslocal.com/personality/matt-petrillo",
  "termIds": [
    0
  ],
  "sentences": [
    "“That’s just a basic medical proposition that no one disputes.”\nBut the attorney general’s letter suggests the medical examiner misspoke when she gave that answer, adding, “After reviewing the material, the facts still support the medical examiner’s finding of suicide.”\nGreenberg’s parents disagree.",
    "PHILADELPHIA (CBS) — Eyewitness News has exclusively learned the Pennsylvania Attorney General’s Office has finished reviewing the mysterious death of Ellen Greenberg, a Philadelphia school teacher who was found stabbed nearly 20 times in 2011.",
    "READ MORE:\nThe file of Ellen Greenberg is being closed by the office of Pennsylvania Attorney General Josh Shapiro, according to a letter sent to the attorney of Greenberg’s parents.",
    "The letter shows the AG’s Office still supports suicide as the manner of death after it reviewed the case again, between December 2021 and January of this year.",
    "Part of that new evidence is the deposition of a medical expert who reexamined a part of Greenberg’s spinal tissue, which found some interesting results.",
    "MORE NEWS:\nThe Greenbergs are now suing Philadelphia, trying to change Ellen’s manner of death from suicide to homicide or undetermined.",
    "“What’s significant here is that there’s no hemorrhage,” Lyndsey Emery, a neuropathologist, said in her deposition.",
    "“I just can’t believe what’s coming out of the office of a person that’s trying to run for governor,” Sandra said.",
    "The letter comes after the Greenbergs asked the office to review the manner of death of their daughter.",
    "The AG’s Office previously reviewed the case in 2019 and had determined the death was a suicide.",
    "The Greenberg’s attorney uncovered what Podraza called new evidence in the case last year.",
    "She was found in her Manayunk apartment with almost 20 stab wounds back in 2011.",
    "Her death had been ruled a suicide by the medical examiner for the past decade.",
    "In December, he provided it to the state attorney general’s office to review.",
    "“These people disappointed me,” Josh Greenberg, Ellen’s father, said.",
    "“I’m completely disgusted,” Sandra Greenberg, Ellen’s mother, said.",
    "“You don’t stab yourself when you’re dead,” Podraza said.",
    "The office reaffirmed that her death was a suicide.",
    "“I think this is a vicious homicide,” Josh said.",
    "READ MORE:\n“This cannot be suicide,” he said.",
    "Their attorney, Joseph Podraza, agrees.",
    "Ellen’s parents never believed it."
  ]
}