{
  "id": 17318,
  "mediaId": 8254,
  "date": "2022-03-03",
  "headline": "AG Shapiro puts commonwealth car dealers on notice",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/Used-car.jpg?w=1280",
  "link": "https://www.abc27.com/news/pennsylvania/ag-shapiro-puts-commonwealth-car-dealers-on-notice/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Corey Morris",
  "authorUrl": "https://www.yourerie.com/?post_type=profile&p=981636",
  "termIds": [
    3926,
    1588,
    1580,
    6506
  ],
  "sentences": [
    "The news release specifically outlined some areas in the Commonwealth’s Consumer Protection Law and regulations that dealerships must follow:\n• Represent and advertise goods or services at their actual price, comply with the terms of warranties given to the buyer; and not engage in fraudulent or deceptive conduct which creates a likelihood of confusion or misunderstanding.",
    "• Not increase the price of a motor vehicle after the contract has been accepted by the dealer or an authorized representative, unless the increase is due to a change in the law which requires the addition of new equipment or increases transportation costs or existing taxes.",
    "For news delivered right to you, subscribe to JET 24/FOX 66/YourErie.com’s breaking, daily news & severe weather email lists\nIf you believe a dealership has violated the law, you can file a complaint online at www.attorneygeneral.gov or by calling (800) 441-2555.",
    "“We’ve seen a large increase in demand for new and used cars here in Pennsylvania, and while the vast majority of dealerships are following the rules, there has also been an increase in complaints from consumers noticing bad practices,” Shapiro said.",
    "In a March 3 news release, Attorney General Josh Shapiro highlighted potential unfair and deceptive practices of car dealerships that violate the commonwealth’s Consumer Protection Law.",
    "• Honor the terms of any contract with a consumer regarding the lease of a vehicle, including a consumer’s right to purchase the vehicle under the specific terms of the contract.",
    "• Sell a motor vehicle under the terms or conditions, including price or warranty, which a motor vehicle manufacturer or dealer has advertised or otherwise represented.",
    "(WJET/WFXP/YourErie.com) — With new and used vehicle prices soaring, the commonwealth’s Attorney General is warning dealers to keep their practices on the level.",
    "“We are putting these dealerships on notice: shift gears and be sure that you are following the law and treating consumers fairly,” Shapiro said.",
    "• Disclose any hidden charges in any advertised price of a vehicle, as well as the expiration date of any advertised price.",
    "The warning comes on the heels of an increase in complaints from consumers."
  ]
}