{
  "id": 17562,
  "mediaId": 8254,
  "date": "2022-03-03",
  "headline": "Pa. joins states investigating TikTok’s effect on kids’ mental health",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/2ad19a5b114b4e619d2f0dc0ed2a2790.jpg?w=1280",
  "link": "https://www.abc27.com/news/pennsylvania/states-begin-investigating-tiktoks-effect-on-kids-mental-health/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Wesser",
  "authorUrl": "https://www.abc27.com/author/james-wesser/",
  "termIds": [
    4721,
    3926,
    1369,
    6650,
    6279,
    6026,
    6506,
    6709
  ],
  "sentences": [
    "Critics of TikTok have pointed, for example, to incidents around the country that came to light last fall in which students vandalized school bathrooms and other equipment, and stole supplies — apparently in response to a viral TikTok challenge called “devious licks.” Also, last fall, The Wall Street Journal reported that teenage girls had been seeking medical care for the sudden onset of tics, such as jerky motions and verbal outbursts; doctors said TikTok videos on Tourette syndrome could be a factor.",
    "“We look forward to providing information on the many safety and privacy protections we have for teens.”\nEarly last year, after federal regulators ordered TikTok to disclose how its practices affect children and teenagers, the platform tightened its privacy practices for users under 18.",
    "And if TikTok is found to have prioritized business growth over the physical and emotional well-being of Pennsylvania’s children, they will be held responsible for that.”\nThe investigation will look into the harm TikTok usage causes young users and what TikTok knew about those harms.",
    "In his State of the Union address on Tuesday night, President Joe Biden asked Congress to bolster privacy protections for children, including by banning advertising targeted at them and with measures aimed at reducing the promotion of content that contributes to addiction.",
    "“We care deeply about building an experience that helps to protect and support the well-being of our community, and appreciate that the state attorneys general are focusing on the safety of younger users,” the company said Wednesday.",
    "“Our children are growing up in the age of social media — and many feel like they need to measure up to the filtered versions of reality that they see on their screens,” California Attorney General Rob Bonta said in a news release.",
    "WASHINGTON (AP) — State attorneys general have launched a nationwide investigation into TikTok and its possible harmful effects on young users’ mental health, widening government scrutiny of the wildly popular video platform.",
    "“TikTok threatens the safety, mental health and well-being of our kids,” Rep. Cathy McMorris Rodgers of Washington, the senior Republican on the House Energy and Commerce Committee, said at a hearing Tuesday.",
    "Late last year a similar coalition of state attorneys general began an investigation into the Instagram photo-sharing platform, owned by Facebook parent Meta Platforms, and its effects on young people.",
    "“We know this takes a devastating toll on children’s mental health and well-being.”\nBonta said the investigation aims determine if TikTok is violating the law in promoting its platform to young people.",
    "Government officials and child-safety advocates maintain that TikTok’s computer algorithms pushing video content to users can promote eating disorders and even self-harm and suicide to young viewers.",
    "U.S. lawmakers and federal regulators have criticized TikTok, citing practices and computer-driven promotion of content they say can endanger the physical and mental health of young users.",
    "Leading the investigation is a bipartisan coalition of Attorneys General from California, Florida, Kentucky, Massachusetts, Nebraska, New Jersey, Tennessee, and Vermont.",
    "The company says it has tools in place, such as screen-time management, to help young people and parents moderate how long children spend on the app and what they see.",
    "As its popularity has swelled, TikTok has come under a barrage of criticism from state officials, federal regulators, consumer advocates and lawmakers of both parties.",
    "The action came after former Facebook product manager Frances Haugen revealed internal company research showing apparent harm to some teen users of Instagram.",
    "TikTok has said it focuses on age-appropriate experiences, noting that some features, such as direct messaging, are not available to younger users.",
    "Last month, Texas opened an investigation into TikTok’s alleged violations of children’s privacy and facilitation of human trafficking.",
    "The platform has an estimated 1 billion monthly users and is especially popular with teens and younger children.",
    "Pennsylvania is one of the states launching this investigation, led by Attorney General Josh Shapiro.",
    "“My job is to protect all Pennsylvanians, especially children, from online threats,” AG Shapiro said.",
    "“Parents and children deserve to know the risks associated with these platforms.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "Republicans have especially homed in on the company’s ties to China.",
    "TikTok is owned by Beijing-based ByteDance.",
    "Sign up for the abc27 newsletters here."
  ]
}