{
  "id": 17759,
  "mediaId": 8500,
  "date": "2022-03-03",
  "headline": "Pennsylvania AG Josh Shapiro launching investigation into TikTok",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/vlcsnap-2022-03-03-18h26m46s229-1646350016.png?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wtae.com/article/tiktok-pennsylvania-josh-shapiro-launching-investigation/39316271",
  "mediaOutlet": "wtae.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chandi Chapman",
  "authorUrl": "https://www.wtae.com/news-team/eed4f53d-7899-4f25-b735-209d3a8d8374",
  "termIds": [
    0
  ],
  "sentences": [
    "\"If you are 16 or 17, maybe you are going through a severe bout of depression or struggling with your body image, you start clicking 'like' and commenting on people going through that same thing you are, maybe aren't dealing with in the best ways,\" McKivigan said.",
    "\"You can just scroll and scroll and they are giving you stuff that's interesting to you and we are seeing teenagers coming to school more tired and irritable and they didn't get their homework done,\" McKivigan said.",
    "A behavioral health therapist with Allegheny Health Network said TikTok can be utilized in a good way, but Joshua McKivigan also said it can also be harmful to young people.",
    "He said his office will look into techniques the company may have used to boost young user engagement, including increasing time spent on the platform.",
    "Shapiro has also taken action against Facebook's parent company Meta for planning to set up an Instagram version for children under 13 years old.",
    "Shapiro is taking action with a coalition of attorneys general who said they are concerned about children and young people using the popular app.",
    "Pennsylvania Attorney General Josh Shapiro has launched an investigation into the TikTok social media platform.",
    "Shapiro said he is protecting people in the state from online threats, especially children.",
    "\"Anything that hurts kids shouldn't be on the TV or computer or anything,\" Siko said.",
    "Shapiro said he is examining whether TikTok violated state consumer protection laws.",
    "Paul Siko is a parent of a 12-year-old and called the investigation \"a good idea.\"",
    "He said it could hurt children and young adults both mentally and physically.",
    "\"The app is just going to keep feeding you more of that material.\"",
    "The algorithm is tailored to a person's interests, experts say.",
    "There's a ton of apps on the app store that kids could be on.",
    "\"I think it's a little ridiculous,\" Jack Roach said.",
    "He said it can affect your body, mind and behavior.",
    "Why TikTok has to be the one that is focused on.\"",
    "\"It's just an app."
  ]
}