{
  "id": 1842,
  "mediaId": 6571,
  "date": "2022-02-08",
  "headline": "Attorney General Josh Shapiro Files Legal Action Against Used Car Dealer In Penn Hills",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/02/09/9b0a9afe-446e-467b-a378-125ded618cb3/thumbnail/1200x630/a15ba2c20e1a979e688ddd99bf718fda/martino-motors.png",
  "link": "https://www.cbsnews.com/pittsburgh/news/attorney-general-josh-shapiro-penn-hills-used-car-dealer/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "According to AG Shapiro, follow the below tips:\nAssess Your Needs: consider how long you will use the vehicle, how long you will keep the vehicle, what size and features you will need, and also determine your budget for the purchase, operation, and maintenance costs.",
    "Voss wanted to pass along these tips for buyers to keep in mind before heading to the lot:\n\"We say the Carfax report, the independent inspection and the test drive -- you really need to do all three of those things,\" said Voss.",
    "Take it for an independent inspection, have a trained mechanic put their eyes on it to make sure there aren't any red flags and that everything adds up, the reading on the odometer matches the wear and tear,\" said Voss.",
    "\"The legal action seeks to permanently ban Mr. Martino and Martino Motors from selling motor vehicles in Pennsylvania, and seeks restitution, civil penalties, cost and other equitable relief from them,\" Shapiro said.",
    "\"This time of year we call the unofficial start of the used car buying season because people are starting to get their tax refunds and looking to invest those,' said Voss.",
    "He said he has a court appearance in April and plans to speak his truth, saying he did not want to settle in advance and wanted to share his story in court.",
    "In addition, ask for any available repair and maintenance records, and always check the title to make sure the person selling the car is the legal owner.",
    "Know Your Seller: whether you buy from a used car dealer, private owner, or an auto auction, check on the seller's reputation and reliability first.",
    "KDKA Investigator Meghan Schiller learned the two dealerships include Cars R Us Erie and Martino Motors, which sits along Rodi Road in Penn Hills.",
    "Check the Car: while you shouldn't expect perfection, make sure the car does not have any serious defects and make safety a top priority.",
    "Inspect the tires, battery, doors, windows, heating and cooling, lights, exhaust, and fluids to make sure they are functioning properly.",
    "PENN HILLS, Pa. (KDKA) - The state's top lawyer said he's taking legal action against two used car lots, including one in Penn Hills.",
    "If you are required to make a deposit, ask if it is refundable, and make sure the deposit is included in the contract.",
    "\"We're seeing used car prices right now up about 40% from the same time last year,\" said Emilie Voss with Carfax.",
    "This action comes at a time when the American consumer purchasing a used car is paying significantly more.",
    "KDKA's Meghan Schiller visited Martino Motors on Tuesday and the man inside said he \"did nothing wrong.\"",
    "Another customer found parts of the car rusted out, covered in duct tape and painted to appear normal.",
    "He claimed one customer's brakes failed with her children in the car two weeks after she bought it.",
    "(Photo: KDKA)\nAccording to Shapiro, Martino Motors is selling vehicles that are not \"roadworthy.\"",
    "Attorney General Josh Shapiro claims he's acting because the dealerships scammed the public.",
    "\"We've seen an increase in demand for used cars here in Pennsylvania,\" said Shapiro.",
    "Voss points out a $20,000 car in 2021 will now be priced around $28,000 on the lot.",
    "Read Before You Sign: take the time to read and understand any written agreement.",
    "\"They can see things that you and I can't see and also take it for a test drive.\"",
    "Pick-up trucks jumped from just under $31,000 in 2021 to nearly $40,000 in 2022.",
    "Have a trusted mechanic thoroughly inspect the care before you purchase it.",
    "If you are not allowed to test drive the vehicle, don't buy it.",
    "Understand if there is a warranty and what it covers.",
    "\"It's important to understand the vehicle's history.",
    "Voss said these numbers matter now more than ever.",
    "\"A lot of times people end up buying used cars.\"",
    "Road test the care before you commit to buying.",
    "\"And with that comes an increase in scammers.\"",
    "Inspect the car in daylight and good weather.",
    "Check the body for rust or cracks.",
    "Be sure to ask questions.",
    "In:\nPenn Hills"
  ]
}