{
  "id": 2177,
  "mediaId": 8469,
  "date": "2022-02-05",
  "headline": "Our view: It’s time for Barletta to admit Biden won",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2022/02/128169536_web1_BARLETTA-TRUMP.jpg.optimal.jpg",
  "link": "https://s24526.pcdn.co/uncategorized/1538395/our-view-its-time-for-barletta-to-admit-biden-won",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "But he also said of the alternate electors that “their rhetoric and policy were intentionally misleading and purposefully damaging to our democracy.”\nA campaign spokesperson released a statement saying Barletta and others signed the ballots “in case it was later determined that different electors were needed.” The statement added “At the time there were still outstanding issues and pending litigation with respect to the outcome of the 2020 presidential election.",
    "When we wrote an editorial asking if local media outlets were “fake news” and “the enemy of the people” as Donald Trump claimed at rallies everywhere, including in our area, Barletta penned a response that basically said local outlets are honest, it’s the national media that’s bad — a distinction Trump never made.",
    "To this day, millions of people have legitimate questions about that election.”\nMillions question it because Republicans and the ex-president can’t stop making accusations and pushing for audits and investigations into an election now 14 months past and counting.",
    "During a meeting with the editorial board, we pressed him about a Republican vote to repeal the Affordable Care Act without a replacement — a move that would eliminate the ban on denying coverage due to pre-existing conditions.",
    "We believe Barletta is again trying to have it both ways, to appear to support the questioning of election results without committing to the full blown “Big Lie.” We also believe Shapiro characterized the effort accurately.",
    "Barletta repeatedly insisted that the GOP would have approved a new law with the pre-existing mandate, but ultimately had to concede he had voted to eliminate the mandate without that replacement law existing.",
    "This week Barletta hit the news again with state Attorney General Josh Shapiro making statements about the “alternate electors” effort undertaken by Republicans in several states, including Pennsylvania.",
    "At first it was in the illegal immigration debate, but since 2016 it’s been his embrace of the former president — most recently, in the quest to de-legitimize the 2020 election results.",
    "The most consistent praise: In person, Bareltta always comes across as sincere and very much in touch with his Hazleton roots, especially when he is not talking politics.",
    "Barletta should unequivocally acknowledge the legitimacy of the 2020 results, apologize for signing the conditional ballot and promise to move forward.",
    "Democrat Shapiro and Republican Barletta are hoping to win nomination to be the candidate for governor for their respective parties.",
    "While we have argued his fight against illegal immigration has been at times misguided, the basic notion was sound.",
    "Shapiro found nothing illegal in the PA effort, thanks to some conditional language in the ballots submitted.",
    "And he helped bring the SHINE after school program to Luzerne County, a valuable aid to at-risk children.",
    "At least 60-plus cases were filed on this issue in front of many judges from both parties.",
    "The most persistent criticism: He has hewed too closely and too often to party lines.",
    "In the past we have both praised and chastised former representative Lou Barletta.",
    "The man has an easy going charm coupled with a winning, toothy smile.",
    "The fact remains: No evidence of widespread fraud has been found.",
    "There have been times Barletta tried hard to have it both ways.",
    "Barletta signed the conditional ballots submitted in this ploy.",
    "Subscribers enjoy a distraction-free reading experience.",
    "Click here to subscribe today or Login.",
    "A “forensic audit” was done in Arizona.",
    "And he’s done some serious good.",
    "– Times Leader",
    "Tired of ads?"
  ]
}