{
  "id": 2238,
  "mediaId": 2608,
  "date": "2022-02-08",
  "headline": "Pa. Man Who Beat His Wife to Death with Fire Poker in Jealous Rage and Left Her Body in Basement Is Sentenced to Life in Prison",
  "image": "https://lawandcrime.com/wp-content/uploads/2022/02/Daniel-Barrett.jpg",
  "link": "https://lawandcrime.com/crime/pa-man-who-beat-his-wife-to-death-with-fire-poker-in-jealous-rage-and-left-her-body-in-basement-is-sentenced-to-life-in-prison/",
  "mediaOutlet": "lawnewz.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerry Lambe",
  "authorUrl": "https://lawandcrime.com/author/jlambe/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I grieve for her loved ones and hope this helps bring some justice and closure for this terrible loss.”\nAccording to a press release from Shapiro’s office, Barrett on Jan. 11, 2021 confessed to the murder during an interview with officers from the Plymouth Police Department.",
    "Pennsylvania newspaper the Times Leader reported that Barrett declined an offer from prosecutors that would have required him to plead guilty to third-degree murder in exchange for a sentencing recommendation of 35 to 70 years in prison with the possibility for parole.",
    "Luzerne County President Judge Michael T. Vough on Monday sentenced Daniel Barrett, 41, to life in prison without the possibility of parole for the brutal January 2021 slaying of Mary Barrett, 43, the Pennsylvania Attorney General’s Office announced.",
    "During a subsequent interview with police, Barrett told detectives that while he and his wife were arguing, he “proceeded to repeatedly strike her with a blunt force object, stabbed her, and dragged her into the basement,” the release states.",
    "After continuing to hit her several more times, Barrett reportedly said that he went to the kitchen and grabbed a knife, then returned and stabbed Mary in the back before dragging her body down into the basement.",
    "“Today, Daniel Barrett pled guilty to the horrific murder of his wife, and was sentenced to life in prison for his unthinkable crimes,” Pennsylvania District Attorney Josh Shapiro (D) said in a statement.",
    "He also admitted that when Mary’s friends tried to contact her, he pretended to be her and communicated with them through her Facebook account to make it seem as though she was still alive.",
    "The Times Leader reported that both her father and sister referred to Barrett as a “master manipulator” and a “narcissist.”\n[image via Luzerne County Jail]\nHave a tip we should know?",
    "A Pennsylvania man will spend the rest of his life behind bars for murdering his wife in a jealous rage by beating and stabbing her with a fire poker in their Plymouth home.",
    "“I know my words won’t mean much, I’m really sorry,” he said, adding, “I wish I could take it back.”\nMary’s father, mother, sister, and aunt also addressed the court.",
    "When she finally conceded that she had been “spending time” with another man, Barrett reportedly punched her, causing her to land on the floor near their fireplace.",
    "Scranton ABC affiliate WNEP-TV previously reported that the argument between Barrett and his wife arose after he accused her of having an affair.",
    "Investigators were then able to obtain a search warrant for the Barretts’ home located in the 100 block of Gaylord Avenue.",
    "Police reportedly located her body easily by following a trail of blood that led from the fireplace down to the basement.",
    "Upon searching the residence they discovered Mary’s “clearly deceased” body in the basement covered with a sheet.",
    "Barrett addressed the court near the end of the proceeding and apologized for his conduct, per the Times Leader.",
    "The sentencing came after Judge Vough accepted Barrett’s guilty plea to one count of first-degree murder.",
    "He reportedly told police that when he came to, he had the fire poker in his hands and was beating Mary.",
    "The Daily Voice reported that investigators later found no evidence that Mary was having an affair.",
    "The charade lasted for two days before Barrett finally decided to turn himself in.",
    "Barrett reportedly said that he blacked out after hitting Mary.",
    "tips@lawandcrime.com"
  ]
}