{
  "id": 2245,
  "mediaId": 8401,
  "date": "2022-02-04",
  "headline": "3 Men Arrested In Philadelphia For Allegedly Straw Purchasing, Trafficking 19 Firearms, Officials Say",
  "image": "https://philadelphia.cbslocal.com/wp-content/uploads/sites/15116066/2022/01/guns.jpg?w=1500",
  "link": "https://philadelphia.cbslocal.com/2022/02/04/philadelphia-guns-straw-purchasing-traffic-firearms-men-arrested/",
  "mediaOutlet": "philadelphia.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "MORE NEWS:\n“I’m grateful for the tireless efforts of everyone on the Gun Violence Task Force for getting these three individuals off of our streets and for shutting down a significant gun trafficking operation occurring throughout Philadelphia,” District Attorney Larry Krasner said in a release.",
    "Our Gun Violence Task Force works every day to follow up on these guns and hold straw purchasers accountable to the fullest extent of the law.”\nThe attorney general’s gun violence task force agents investigated the trio from March 2020 to Nov. 2021.",
    "Pennsylvania Attorney General Josh Shapiro announced on Friday that Bryan Johnson, Dajuan Coffee, and Quadir Burley have each been arrested and charged with multiple counts of illegal transfer for a firearm, conspiracy, and other related offenses.",
    "“The majority of these straw purchases were made at gun dealers with electronic records of sale, making it easier for law enforcement to track straw purchasers and trace crime guns thanks to our Track + Trace Initiative.",
    "READ MORE:\n“The defendants coordinated the illegal purchases and transfer of 19 firearms into the hands of criminals to be used on the streets of Philadelphia,” Attorney General Shapiro said in a release.",
    "Officials say, Johnson, who had no criminal record at the time, purchased 19 firearms from 15 different locations across Bucks, Montgomery, Philadelphia, and Lehigh counties.",
    "PHILADELPHIA (CBS) — Three men have been arrested in Philadelphia for their alleged roles in illegal straw purchasing and conspiracy to traffic 19 firearms.",
    "Burley, a convicted felon, was under the supervision of the Pennsylvania Board of Parole during the time period when the straw purchases occurred.",
    "Investigators observed a pattern of Johnson purchasing one firearm at a location spaced out over time to avoid detection, according to a release.",
    "Law enforcement was able to track the majority of gun shops and vendors Johnson purchased the firearms at due to them keeping electronic records.",
    "A person who illegally transfers two or more firearms is subject to the Brad Fox Mandatory Minimum of five to 10 years in state prison.",
    "The investigation revealed he continued to arrange for the purchase and illegal transfer of firearms.",
    "The investigation was conducted by Pennsylvania State Police and the Philadelphia Police Department.",
    "Investigators determined that he would then illegally transfer the weapons to Coffee and Burley.",
    "So far, five of the firearms straw purchased by Johnson have been recovered by police.",
    "The case is being prosecuted by the Philadelphia District Attorney’s Office.",
    "READ MORE:\nCoffee and Burley both are not legally able to purchase firearms.",
    "The two would then traffic the firearms to other individuals."
  ]
}