{
  "id": 2399,
  "mediaId": 2650,
  "date": "2022-02-09",
  "headline": "He's Fallen and He Can't Get Up: Joe Biden Poll Average Slumps to Under 40 for the First Time",
  "image": "https://media.townhall.com/townhall/reu/o/2021/343/769ebdaf-0649-4251-a0f5-95a2359d8fcf-1110x740.jpg",
  "link": "https://pjmedia.com/vodkapundit/2022/02/09/collapse-joe-biden-poll-average-slumps-to-under-40-for-the-first-time-n1557764",
  "mediaOutlet": "Pajamas Media ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Green",
  "authorUrl": "https://pjmedia.com/columnist/stephen-green",
  "termIds": [
    0
  ],
  "sentences": [
    "What might be most terrifying to the White House — run by those overly-ambitious progressives that constantly put lie to “Moderate Joe” — is the spread between Biden’s approve and disapprove numbers.",
    "Two leading Pennsylvania Dems — Lieutenant Governor John Fetterman and Attorney General Josh Shapiro — also somehow had their dance cards filled when Biden visited to tout his infrastructure law.",
    "His attempt to bust the filibuster is, too, and that means that unlike Westley in The Princess Bride, Biden’s progressive agenda isn’t just “mostly dead.”\nIt’s doorknob dead.",
    "Biden’s disapproval figure is in “lose by a landslide” territory, and there are only about 5% of voters left who don’t have a strong opinion about Biden one way or the other.",
    "That West Virginia thorn in Biden’s side, Joe Manchin, could just as well have used the same word to describe the alleged president’s standing with the American people.",
    "Presidentish Joe Biden, who just had his Build Back Bolshevik agenda declared “dead” by a senator from his own Democrat party, has just hit an all-time polling low.",
    "Democrat politicians are already snubbing the president, a rude fate usually reserved for second-term lame ducks in the heat of the inevitable second-term scandal.",
    "Recommended: Facebook’s Faceplant, Zuck Threatens to Cut Off Europe After HUGE Losses\nGood luck establishing a new narrative once another one is already in place.",
    "For the first time — and barely a year after he was sworn into office — the RCP polling average shows Biden below the crucial 40% threshold of support.",
    "That means his public perception — his narrative as a successful or unsuccessful president, to use the more modern word — is largely set.",
    "As you’ve seen from one campaign after another, rarely does even the most pro-union Dem support letting their own people unionize.",
    "Everything he touches turns to… you know… but like a three-year-old in a candy store, he just can’t keep his fingers to himself.",
    "Stacey Abrams, The Real Governor of Georgia™ and full-time publicity hound, had a “prior engagement” when Biden came a-calling.",
    "An averaged 39.8% of adult Americans, registered voters, and likely voters give the near-octogenarian a passing grade.",
    "Doing that would require a big win, somewhere, with someone or something, to turn things around.",
    "Biden, kind of out of the blue, came out in support of letting Capitol Hill staffers unionize.",
    "Just when Biden needs support on Capitol Hill to turn things around, do you know what he did?",
    "But that’s been Presidentish Biden for more than a year now: He’s got the Merde Touch.",
    "It’s nearly 15 points, with the “Disapproves” at a jaw-dropping 54.4%.",
    "Sorry to bug you with so many numbers but this is important.",
    "Beta O’Rourke doesn’t want Biden coming to Texas.",
    "You know, the one that doesn’t build much (any?)",
    "Corn Pop still loves him, but that’s about it.",
    "Biden is, you know, the thing with voters.",
    "Biden’s legislative agenda is dead.",
    "actual infrastructure.",
    "Coffin-nail dead.",
    "Completely dead.",
    "C’mon, man!"
  ]
}