{
  "id": 2711,
  "mediaId": 2572,
  "date": "2022-01-29",
  "headline": "DNC chair reportedly looking to leave amid tensions with Biden White House",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/2020-10-24T233432Z_655483284_RC2BPJ92EY3F_RTRMADP_3_USA-ELECTION-SENATE-SOUTH-CAROLINA-e1643485224396.jpg",
  "link": "https://www.foxnews.com/politics/dnc-chair-leave-tensions-biden-white-house",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Aitken",
  "authorUrl": "https://www.foxnews.com/person/a/peter-aitken",
  "termIds": [
    5877,
    4905,
    3989,
    392,
    391,
    1126,
    6158
  ],
  "sentences": [
    "But a report citing current and former DNC officials revealed a strained relationship between Harrison and the White House and uncertainty that he will remain in his role ahead of the midterms, which political pundits have forecast to spell disaster for Democrats.",
    "GOP POLITICIANS SLAM BIDEN AS HE VISITS PITTSBURGH TO PROMOTE INFRASTRUCTURE PACKAGE\nBiden has taken a beating in polls as his approval rating continues to drop, hitting 41.8% approval and 52.9% disapproval, according to the latest aggregation from pollster 538.",
    "The question remained \"whether he gets out before the curtain comes down in November,\" as staying in his seat would position him as the prime scapegoat should Republicans succeed in flipping both the House and Senate.",
    "The chairman of the Democratic National Committee (DNC) has reportedly considered an early exit as fears of a Republican rout in the midterms leave him vulnerable amid plummeting approval ratings for President Biden.",
    "HISPANIC LEADERS BLAST THE LEFT'S PORTRAYAL OF LATINO ELECTORATE: ‘A DEGREDATION TO WHO WE ARE’\nOne former DNC official said that Harrison has been \"marginalized\" because he’s \"not out there fighting the fight.\"",
    "Prominent Pennsylvania Democrats Lieutenant Governor John Fetterman and Attorney General Josh Shapiro declined to appear in a photo-op with Biden during his visit to the state this week.",
    "\"?We have a lot of important work left to do, which is why we want Jaime out there more, not less – more television, more campaign rallies, more fundraising,\" a Biden adviser said.",
    "In an interview with NBC News, DNC Chairman Jaime Harrison pledged to fulfill his full four-year term, saying he \"made a commitment to the president.\"",
    "The pair cited scheduling conflicts, which some analysts noted as fairly unusual, particularly as both men are gunning for new positions this year.",
    "\"He’s an asset and we will need him out there for the work we have ahead.\"",
    "\"You don’t hear about him,\" another former party official said.",
    "\"You don’t hear about him.",
    "There’s nothing there.\"",
    "You don’t see him.",
    "?"
  ]
}