{
  "id": 2755,
  "mediaId": 2590,
  "date": "2022-02-02",
  "headline": "Jamaican Killed On Camping Trip To Be Honored At Pittsburgh Vigil",
  "image": "https://img.huffingtonpost.com/asset/61fb165e360000321d24defa.jpeg?ops=1778_1000",
  "link": "https://www.huffpost.com/entry/peter-bernardo-spencer-death-pennsylvania-cabin-co-worker_n_61fabec9e4b02136b6eecf46",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The report identifies one 25-year-old suspect along with “three additional identified individuals.” The four were “detained and questioned” at the station and were all released “pending additional investigation.”\nBut nearly two months later, Spencer’s family is still searching for answers, and a growing number of community members are pressing officials to intensify their investigation.",
    "Spencer’s mother, Icilda Spencer-Henry, told Jamaican newspaper The Gleaner that her son wasn’t perfect, but “he did not like anyone around him who did not work.”\nA candlelight vigil will take place Sunday to honor Jamaican immigrant Peter \"Bernardo\" Spencer, who was found dead after being invited by a co-worker on a camping trip north of Pittsburgh.",
    "According to their police report, they were responding to a call about a shooting at 2:26 a.m. when they found Spencer “in the front yard of a residence” with “apparent gunshot wounds to his body.”\nTroopers said they seized “multiple firearms, ballistic evidence” and “controlled substances” at the scene.",
    "A candlelight vigil will take place Sunday in Pittsburgh to honor Peter “Bernardo” Spencer, a Jamaican immigrant whose shooting death in December, after being invited to a cabin by a co-worker, has amplified questions being raised about how police handle investigations of Black people’s deaths.",
    "“Public information must be tempered with the obligation of a complete and thorough investigation.”\nNearly 100 faith and community leaders sent a letter to local and state authorities urging that the investigation be handled by state Attorney General Josh Shapiro, according to WTAE-TV.",
    "@Justice4JimJim pic.twitter.com/WFahfa6d7V\n— Pittsburgh Protests (@PghProtests) February 2, 2022\nThe Venango County District Attorney’s Office said in a press release that the investigation “would conclude in 4-6 weeks from the date of January 25,” according to CBS Pittsburgh.",
    "Pittsburgh Protests, an activist group that typically focuses on police violence against Black people, announced the family-hosted vigil on Twitter on Wednesday, urging people to join them in their call for justice over Spencer’s unexplained killing.",
    "Advertisement\nNew Action For: Sunday, February 6\n\"People's Justice for Peter Spencer: Candelight Vigil\"\nHighland Park PGH (Meet at Fountain)\n5PM\nDetails: Join Peter \"Bernardo\" Spencer's family to honor his life & continue the call for justice.",
    "Advertisement\nSpencer’s fiancée, Carmela King, said he was slain after going on the camping trip with his friend and that he was the “only black individual at the camp site,” according to a GoFundMe campaign launched by King.",
    "Advertisement\nThe calls for a more thorough investigation echo ones in Connecticut, where two detectives at the Bridgeport Police Department have been suspended over their handling of two Black women’s deaths.",
    "Relatives of one of the victims, Lauren Smith-Fields, accused Bridgeport police of being “racially insensitive” toward their family and failing to complete a full investigation into her death.",
    "“His blood keeps crying out to us.”\nSpencer’s brother, Tehilah, said “something about this case is different.” He added, “They don’t want another George Floyd.",
    "He was always trying to improve himself.”\nSpencer’s family, in their search for answers, has hired their own medical examiner, CBS Pittsburgh reported.",
    "Venango County, 80 miles north of Pittsburgh, has a 1.1% Black population out of nearly 55,000 residents, according to the U.S. Census Bureau.",
    "D-Keine via Getty Images\n“He worked hard, and he was always encouraging others, motivating them to do better,” she said.",
    "Larry Picken, the executive director of the Pennsylvania Council of Churches, said at a Wednesday press conference.",
    "“Our voices will continue to stir and uncover and speak out until we learn what has happened to our brother,” Rev.",
    "Pennsylvania state troopers found the 29-year-old dead of apparent gunshot wounds in Venango County on Dec. 12.",
    "HuffPost has reached out to the Spencer family attorney, Paul Jubas, for further comments.",
    "“He was a force of nature,” Tehilah Spencer told Yahoo News.",
    "They want to sweep it under the rug,” he told Yahoo News.",
    "“He wanted the American dream for himself.",
    "Post Credit: ."
  ]
}