{
  "id": 2785,
  "mediaId": 2590,
  "date": "2022-01-28",
  "headline": "Court Strikes Down Pennsylvania Law Making It Easier To Vote By Mail",
  "image": "https://img.huffingtonpost.com/asset/61f44a40250000e1092b0b53.jpeg?ops=1778_1000",
  "link": "https://www.huffpost.com/entry/pennsylvania-vote-by-mail-law_n_61f43518e4b067cbfa1cc505",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lydia O'Connor",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Advertisement\nThough the law passed through the state legislature with widespread support from both parties, Republicans began turning on mail-in voting in the aftermath of the 2020 election and filed the lawsuit, which is backed by 14 state GOP lawmakers and a county commissioner.",
    "If that’s done, she added, such a change is “likely to be adopted.”\nNotably, the court did not comment on the merits of the law, which aims to simplify voting by mail by allowing people to do so without any specified reason and establishing a permanent mail-in voter list.",
    "It also lowers the voter registration deadline from 30 days before an election to 15 days and removes straight-ticket voting, wherein people can vote for a party’s entire slate of candidates with a single stroke.",
    "A conservative court in Pennsylvania ruled Friday that a state law making it easier to vote by mail is unconstitutional, issuing a setback for progressive voting policies in the key battleground state.",
    "Former president Donald Trump, who’s spearheaded the movement against mail-in voting and spent the past year propagating baseless voter fraud conspiracy theories, applauded the court’s decision Friday.",
    "The state’s Commonwealth Court ruled 3-2 in favor of a group of Republican lawmakers who sued the state over the 2019 law, which passed through a GOP-controlled legislature at the time.",
    "In the majority opinion, Judge Mary Hannah Leavitt concluded that the state’s constitution requires voters to cast their votes in person unless they qualify for certain exceptions.",
    "Advertisement\nA law like the one in question, she continued, must be presented to the people of Pennsylvania and established through the constitutional amendment process.",
    "Proponents for mail-in voting, meanwhile, point to evidence that it makes voting more accessible to people from lower socioeconomic backgrounds and people of color.",
    "Advertisement\nFriday’s decision comes just over a week after Congress’ attempt to establish federal voting protections ended in the Senate after Democratic Sens.",
    "The state immediately appealed to Pennsylvania Supreme Court, automatically prompting a stay allowing the law to stay in place as legal proceedings continue.",
    "“This opinion is based on twisted logic and faulty reasoning, and is wrong on the law,” Pennsylvania Attorney General Josh Shapiro said in a statement.",
    "“Big news out of Pennsylvania, great patriotic spirit is developing at a level that nobody thought possible,” he said in a statement.",
    "Joe Manchin (W.Va.) and Kyrsten Sinema (Ariz.) sided with the 50 Republicans against changing Senate filibuster rules.",
    "That court has sided with the state on voting issues in recent years."
  ]
}