{
  "id": 2870,
  "mediaId": 8469,
  "date": "2022-01-28",
  "headline": "Pennsylvania court strikes down expansive mail-in voting law",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2022/01/128147706_web1_128147706-95acf87683fc4f819de5b8f3cfb386bc.jpg.optimal.jpg",
  "link": "https://s24526.pcdn.co/news/1536752/pennsylvania-court-strikes-down-expansive-mail-in-voting-law",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3926,
    4905,
    2765,
    1126,
    6208,
    6506
  ],
  "sentences": [
    "Shapiro, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional, and criticized the lower court’s opinion as “based on twisted logic and faulty reasoning, and is wrong on the law.”\nIn 2019, the Republican-controlled Legislature authorized no-excuse mail-in voting for all voters, expanding upon a provision in the state constitution that required the state to provide the option for people to vote if they are unable to vote in person for specific reasons.",
    "However, Republican challengers say the constitution intended that absentee voting be strictly limited, citing a passage that says voters must live in an election district for at least 60 days where they “shall offer to vote.”\nIn the opinion, the three Republican judges agreed, saying that passage had been cited in two prior state Supreme Court decisions to invalidate laws passed in 1839 and 1923 to expand absentee voting.",
    "That provision says “All elections by the citizens shall be by ballot or by such other method as may be prescribed by law.”\nIn addition to baselessly attacking mail-in voting through much of 2020, Trump also later claimed, without evidence, that the election was stolen from him in critical battleground states including Pennsylvania when Democrats manufactured mail-in ballots.",
    "HARRISBURG (AP) — A statewide court declared Friday that Pennsylvania’s expansive two-year-old mail-in voting law is unconstitutional, agreeing with challenges by Republicans who soured on mail-in voting after then-President Donald Trump began baselessly attacking it as rife with fraud in 2020’s campaign.",
    "The three Republican judges agreed with Republican challengers — including 11 Republican lawmakers who actually voted for the law — and ruled that no-excuse mail-in voting is prohibited under the state constitution, until the constitution is changed to allow it.",
    "The state Supreme Court threw it out, saying the plaintiffs — including U.S. Rep. Mike Kelly and defeated congressional candidate Sean Parnell — “failed to act with due diligence” in waiting to challenge the law until after they saw Trump had lost the election.",
    "In one post-election lawsuit in 2020, Republicans sought to invalidate the mail-in voting law and throw out all ballots cast under it, which would have effectively overturned Biden’s victory in Pennsylvania.",
    "In exchange, Wolf agreed to get rid of the straight-ticket voting option that Republicans had sought as a way to protect their suburban candidates from an anti-Trump wave in 2020’s election.",
    "Pennsylvania’s attorney general, Josh Shapiro, said in a statement the opinion will be immediately appealed and will not have any immediate impact on Pennsylvania’s upcoming elections.",
    "Still, the decision throws Pennsylvania’s voting laws into doubt as the presidential battleground state’s voters prepare to elect a new governor and a new U.S. senator in 2022.",
    "Just over 2.5 million people voted under the law’s expansion of mail-in voting in 2020's presidential election, most of them Democrats, out of 6.9 million total cast.",
    "The decision, by a five-judge Commonwealth Court panel of three Republicans and two Democrats, could be put on hold immediately by an appeal from Gov.",
    "The dissenting Democrats on the panel say a separate provision of the constitution empowered lawmakers to provide no-excuse mail-in voting by law.",
    "Those reasons include being out of town on business, illness, physical disability, election day duties or a religious observance.",
    "Every Republican lawmaker, except one, voted for the bill in a deal with Wolf, who had sought the mail-in voting provision.",
    "The U.S. Supreme Court refused appeals to intervene in the case or reverse Pennsylvania’s certification of Biden’s victory.",
    "“Big news out of Pennsylvania, great patriotic spirit is developing at a level that nobody thought possible.",
    "The Constitution does not explicitly say that the Legislature cannot extend absentee voting to others.",
    "The state Supreme Court — where an appeal was expected shortly — has a 5-2 Democratic majority.",
    "Make America Great Again!” he said in a statement through his political action committee.",
    "Tom Wolf’s administration to the state Supreme Court.",
    "Wolf’s office had no immediate comment Friday.",
    "The two Democrats on the panel dissented.",
    "Trump quickly lauded the decision."
  ]
}