{
  "id": 2893,
  "mediaId": 2540,
  "date": "2022-01-28",
  "headline": "Joe Biden is going to Pennsylvania today. Top Democrats are avoiding him.",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/220126133126-03-biden-admin-to-send-russia-written-responses-as-soon-as-wednesday.jpg?c=16x9&q=w_800,c_fill",
  "link": "https://www.cnn.com/2022/01/28/politics/joe-biden-pittsburgh-trip-infrastructure/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    0
  ],
  "sentences": [
    "“I think the American people are focusing on this administration, what it’s doing to the country, and it’s my hope the ’22 election will be a referendum on the performance of the current administration, not a rehash of suggestions about what may have happened in 2020.”\nMcConnell, as Axios reported in December, “has told colleagues and donors Senate Republicans won’t release a legislative agenda before next year’s midterms, according to people who’ve attended private meetings with the minority leader.”\n(Sidebar: The wild card in McConnell’s plan to make 2022 all about Biden is former President Donald Trump, who seems to always want to make everything about himself.)",
    "“Swing-state Senate candidates like Abby Finkenauer in Iowa, Val Demings in Florida and Cheri Beasley in North Carolina, who might face tough general election races if they win their primaries, have avoided tweeting about Biden.”\nIf past is prologue, this attempted distancing is unlikely to succeed.",
    "The truth is that if Biden was at 60% approval – either nationally or in Pennsylvania – those scheduling conflicts would likely resolve themselves and Fetterman and Shapiro would be in Pittsburgh to bask in Biden’s reflected glow.",
    "“Democrats in swing states and vulnerable districts in this year’s pivotal midterms are distancing themselves from President Biden on social media as his poll numbers hit their lowest point,” writes Axios’ Sarah Mucha.",
    "Photographer: Michael Reynolds/EPA/Bloomberg via Getty Images\nCNN —\nPresident Joe Biden’s planned visit to Pennsylvania on Friday tells you everything you need to know about his current dismal political standing.",
    "U.S. President Joe Biden speaks while meeting with the White House Competition Council in the East Room of the White House in Washington, D.C., U.S., on Monday, Jan. 24, 2022.",
    "Shapiro is the de facto Democratic nominee for the state’s open gubernatorial seat, while Fetterman is the early front-runner for the Democratic Senate nomination.",
    "Neither man is terribly eager to have a bunch of pictures taken of them standing with Biden or a slew of media stories about them supporting the President.",
    "Biden highlighted his administration's efforts to lower prices for Americans from his Promoting Competition in the American Economy executive order.",
    "“I do think we need to be thinking about the future and not the past,” Senate Minority Leader Mitch McConnell told CNN’s Manu Raju in late 2021.",
    "Both Pennsylvania Lt. Gov, John Fetterman and Attorney General Josh Shapiro are not slated to appear with Biden, citing scheduling conflicts.",
    "That he is some 15-20 points below that mark guarantees that candidates on the ballot in 2022 are comfortable ghosting him.",
    "Given that, Fetterman and Shapiro are acutely aware of Biden’s standing in the battleground state – and are staying away.",
    "The first midterm election of a presidency tends to function as a referendum on the current occupant of the White House.",
    "Biden is set to be in Pittsburgh for an event designed to promote the infrastructure package passed into law last year.",
    "It’s not just in-person visits where Democrats are avoiding the political stench Biden is giving off right now.",
    "It’s why the average House seat loss for the president’s party in the post-World War II era is 29 seats.",
    "(Biden is still going forward with the trip following a bridge collapse in the city Friday morning.)",
    "(One of Fetterman’s primary opponents, Rep. Conor Lamb, is expected to attend Biden’s event.)",
    "When he stops by the Steel City, two of the state’s top Democrats won’t be there.",
    "After all, Fetterman and Shapiro are running for higher office this November.",
    "Republican leaders are doing their damndest to make 2022 all about Biden.",
    "In short: Fetterman and Shapiro can avoid Biden in Pittsburgh today.",
    "And usually that judgment goes against the president’s party.",
    "But they won’t be able to run from him all year.",
    "Which, well, riiiiight."
  ]
}