{
  "id": 2899,
  "mediaId": 6571,
  "date": "2022-02-03",
  "headline": "Arguments Set For March On Pennsylvania's Mail-In Voting Law",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/10/09/7940e47f-5f63-400d-abd6-97f00b3c2094/thumbnail/1200x630/02b2609ba3f96f4db61e7187cea59719/mail-in-ballot.png",
  "link": "https://www.cbsnews.com/pittsburgh/news/arguments-set-for-march-on-pennsylvanias-mail-in-voting-law/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "HARRISBURG, Pa. (AP) — Pennsylvania's highest court said Wednesday that it will hear arguments on the constitutionality of Pennsylvania's expansive 2-year-old mail-in voting law, whose fate is in doubt after a lower court ruled the law violates the state constitution.",
    "They wrote that the constitution empowered lawmakers to provide no-excuse mail-in voting through a provision says elections \"shall be by ballot or by such other method as may be prescribed by law.\"",
    "Three Republican judges on a Commonwealth Court panel of five judges agreed Friday with Republican challengers and ruled that no-excuse mail-in voting is prohibited under the state constitution.",
    "The mail-in voting law — which allows no-excuse mail-in voting by any registered voter — remains in force while the state Supreme Court hears the appeal by Gov.",
    "Attorney General Josh Shapiro, a Democrat, has said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "Any decision to throw out the law would not affect the millions of votes already cast under it in the past four elections.",
    "The constitution does not explicitly say that the Legislature cannot extend absentee voting to others.",
    "The state Supreme Court said it will hear oral arguments at its March 8 session in Harrisburg.",
    "The state Supreme Court — which will hear the appeal — has a 5-2 Democratic majority.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "The two Democratic judges on the panel dissented.",
    "(Copyright 2022 The Associated Press.",
    "Written briefs are due before then.",
    "Tom Wolf's administration.",
    "All rights reserved.",
    "In:\nMail In Voting"
  ]
}