{
  "id": 2919,
  "mediaId": 8401,
  "date": "2022-02-02",
  "headline": "Pennsylvania Supreme Court To Decide Congressional District Map",
  "image": "https://philadelphia.cbslocal.com/wp-content/uploads/sites/15116066/2020/04/harrisburg-2.jpg?w=1440",
  "link": "https://philadelphia.cbslocal.com/2022/02/02/pennsylvania-supreme-court-congressional-district-map/",
  "mediaOutlet": "philadelphia.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "READ MORE:\nIt’s the second time in four years the state’s high court has stepped in to direct congressional districting in the politically polarized state, and the latest example around the country of state courts potentially giving Democrats a boost in highly charged battles over redistricting.",
    "“The threat of any appeal period from the Commonwealth Court decision to this court reduces the scant days available for this court to obtain briefs, study this complex and important matter, and render a decision,” Baer wrote, noting the pressures of the state’s elections calendar.",
    "And a federal court last month ordered Alabama Republicans to draw a congressional map with a second congressional district in which Black voters could choose their representative, which would likely net Democrats a new seat in the deeply conservative state.",
    "Democrats last week asked the Supreme Court to take over the process from McCullough, arguing that its own precedent holds that the Supreme Court should select a new map when the executive and legislative branches are deadlocked, not a lower court judge.",
    "READ MORE:\nThe court majority said it was acting because of the impasse between Wolf and the General Assembly, adding that they see “time being of the essence.” McCullough also was directed to give the justices a proposal to revise election deadlines.",
    "HARRISBURG, Pa. (AP) — Pennsylvania’s Democratic-majority Supreme Court wrested control Wednesday of choosing new district lines for the state’s shrinking congressional delegation, a process that deadlocked the governor and Legislature.",
    "North Carolina’s Supreme Court heard arguments Wednesday in a case in which Democrats and civil rights groups argue that state’s GOP-drawn maps violate their state constitution’s prohibition on drawing lines to benefit one party.",
    "Commonwealth Court Judge Patricia McCullough, a Republican, will serve as a “special master.” Parties in the redistricting case she has been handling who object to her report can do so before the Supreme Court by Feb. 14.",
    "Justice Sallie Mundy, a Republican, said she would prefer to let McCullough render a decision and opinion and then expedite an appeal, rather than have the court exercise its jurisdiction at this point.",
    "In Ohio, the state Supreme Court struck down aggressively pro-Republican maps drawn by the GOP-controlled Legislature, ruling they violated a 2018 ballot measure against partisan gerrymandering.",
    "The five Democratic justices issued an order directing a lower judge to give them a report by Monday that recommends a new map, along with her legal and factual findings that support it.",
    "Rather, they said, the court should follow its 1992 precedent, when it appointed a Commonwealth Court judge as a special master to provide a recommendation to the state Supreme Court.",
    "Comparatively slow population growth over the past decade has cost Pennsylvania a congressional seat, so the new map must account for a drop in the delegation from 18 to 17.",
    "Democrats had argued that it would go against that precedent to allow McCullough to issue an order adopting a particular map that she selects.",
    "In Pennsylvania, justices in 2018 threw out a Republican-crafted map that had produced a durable 13-5 GOP advantage in congressional seats.",
    "The court replaced it with a map that has since produced nine Republican and nine Democratic members of Congress from Pennsylvania.",
    "Signature-gathering for petitions to get on the May 17 primary ballot is scheduled to begin Feb. 15 but may be delayed.",
    "Tom Wolf vetoed a proposed map that passed the Republican-majority Legislature on nearly party lines.",
    "Chief Justice Max Baer, a Democrat, said the court was stepping in to move the process more quickly.",
    "MORE NEWS:\n(©Copyright 2021 by The Associated Press.",
    "Both Republicans on the Supreme Court dissented.",
    "The decision came after Democratic Gov.",
    "Oral arguments will occur Feb. 18.",
    "All Rights Reserved.)"
  ]
}