{
  "id": 2935,
  "mediaId": 2732,
  "date": "2022-01-27",
  "headline": "Key Pennsylvania Dems to miss Biden visit, cite scheduling conflicts",
  "image": "",
  "link": "https://triblive.com/news/politics-election/key-pennsylvania-dems-to-miss-biden-visit-cite-scheduling-conflicts/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://triblive.com/author/the-associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "“He’ll highlight the 367,000 manufacturing jobs that our economy has created since he took office, and he’ll underscore the vital role the federal government can play in bringing workers and businesses together.”\nThe visit will take Biden, a Pennsylvania native, to a key battleground in this year’s midterm congressional elections.",
    "Casey, a three-term senator who will next face voters in 2024, said he’s urging elected Democrats to do a better job talking about Biden’s first-year accomplishments, such as the infrastructure bill, distributing vaccines, getting money to keep schools open, expanding the child tax credit and bringing down unemployment.",
    "People end up thinking less of you for not showing up.”\nFetterman, the outspoken lieutenant governor whose campaign headquarters is based in Pittsburgh, said he’ll miss Biden’s visit in that city to attend the Democratic state committee, which begins Friday evening 200 miles to the east in Harrisburg.",
    "And while Fetterman and Shapiro indicated that politics had no bearing on their schedules, their decisions to avoid Biden, particularly in his home state, could fuel further questions among anxious Democratic candidates elsewhere as they decide whether to embrace the struggling president.",
    "3 House Democrat, refused to say whether vulnerable Democrats on the ballot this fall should embrace the label “Biden Democrat.”\n“I want every Democrat to run as Democrats who deliver,” Hoyer told Politico when asked directly about “Biden Democrats.”\nFormer Pennsylvania Gov.",
    "“President Biden first announced his infrastructure plan in Pittsburgh, and Conor looks forward to welcoming him back and talking about all the good jobs that bill will create in the Pittsburgh area and all over Pennsylvania,” said Lamb campaign manger Abby Nassif Murphy.",
    "Christopher Borick, director of the Muhlenberg College Institute of Public Opinion, said diminished enthusiasm among Democrats throughout the country is a worrying sign for Pennsylvania Democrats’ hopes of capturing Toomey’s seat and holding on to the governor’s office.",
    "Ed Rendell said he’s not surprised that some Democratic candidates might want to distance themselves from Biden, but he said those who do so are “stupid.”\n“They’re stupid because things can turn around in politics pretty dramatically,” Rendell told The Associated Press.",
    "Biden, who has seen his poll numbers sink in the midst of an unrelenting pandemic and high inflation, said it was important that he “go out and talk to the public” about what he’s accomplished and about why Congress needs to get behind the rest of his domestic agenda.",
    "Along with Biden’s legislative setbacks, Borick noted that the president’s advanced age (he’s 79) and uncertainty among voters about whether he’ll run for a second term — though he has said he will — are affecting the 2022 campaign.",
    "I have always considered myself a do-something Democrat.”\nThe White House announced Biden’s trip on Monday after the president said last week he would look to get out of Washington more in the second year of his presidency.",
    "John Fetterman, a leading Senate candidate, and state Attorney General Josh Shapiro, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "Earlier in the month, Georgia Democrat Stacey Abrams, a leading candidate for governor in another swing state, skipped a chance to appear with the president in the state, citing an unspecified scheduling conflict.",
    "The high-profile absences come as Democrats in other states have begun taking modest steps to distance themselves from the first-term president, whose approval ratings have fallen sharply in recent months.",
    "But two of the three leading Democrats on Pennsylvania’s statewide ballot this spring who were invited to appear with Biden will not attend, their campaigns confirmed on the eve of the president’s visit.",
    "“He’ll be talking about how far we’ve come in getting our economy moving again, making more right here in America, and ensuring all workers benefit,” Psaki told reporters at the White House on Thursday.",
    "HARRISBURG — President Joe Biden will appear Friday in Pittsburgh as an opening step in a broader campaign to promote the White House’s achievements in key states before the midterm elections.",
    "“I’m not interested in any national politician — anyone outside of Texas — coming into this state to help decide the outcome of this,” O’Rourke said, according to The Dallas Morning News.",
    "Malcolm Kenyatta, another prominent Democratic Senate contender, was not invited to Biden’s appearance because he represents a different part of the state in the state Legislature.",
    "Just 28% of Americans say they want Biden to run for reelection in 2024, including only 48% of Democrats, according to an Associated Press-NORC Center for Public Affairs Research.",
    "Lamb, meanwhile, one of Fetterman’s chief primary opponents in the state’s marquee Senate contest, is eager to hear Biden’s remarks on his sweeping infrastructure bill in person.",
    "“Josh Shapiro is running to be the governor of Pennsylvania and he’s focused on the issues that matter to Pennsylvania families,” Shapiro spokesperson Will Simons said.",
    "“Like every American should, Josh wants our president to be successful and we’ll continue welcoming President Biden to his home state of Pennsylvania,” Simons said.",
    "“I think we all want to make sure that we’re working with, listening to and voting with one another here in Texas.”\nAnd this week, Rep. Steny Hoyer, the No.",
    "The battle to replace Republican Sen. Pat Toomey, who is not seeking reelection, is expected to be one of the most competitive Senate races this year.",
    "But Borick said Biden “could have some rallying effect for Democrats” if he notches some legislative successes closer to the election.",
    "Another top Senate candidate, Rep. Conor Lamb, a longtime Biden supporter based in Pittsburgh, will attend, his office confirmed.",
    "Last week, Texas Democrat Beto O’Rourke said he didn’t need the Democratic president’s assistance in his campaign for governor.",
    "Like Lamb, Kenyatta traveled to early voting states during the 2020 presidential primary to campaign on Biden’s behalf.",
    "But the gubernatorial hopeful has a scheduling conflict this time, Simons said, without detailing the conflict.",
    "Leading Pennsylvania Democrats who are not on the ballot this year did not have the same scheduling conflicts.",
    "And in the weeks since, several other notable Democrats have seemed to distance themselves from Biden as well.",
    "While in Pittsburgh, Biden will focus on the economy, according to White House press secretary Jen Psaki.",
    "Shapiro made three appearances with Biden last summer and fall when the president’s numbers were better.",
    "“It’s great that President Biden is coming to Pittsburgh to talk about infrastructure,” Fetterman said.",
    "Tom Wolf, who is term-limited, and Sen. Bob Casey, whose current term runs through 2024.",
    "It’s been a different calculation for vulnerable Democrats who will face voters in 2022.",
    "But he said he’ll be at the Harrisburg meeting to talk to Democrats about the midterms.",
    "All three had been invited to participate in a photo line with the president.",
    "“We have to do a much better job, and we’re starting to do it,” Casey said.",
    "But he heaped praise on the president when given the opportunity.",
    "“I would not be offended to be called a Biden Democrat.",
    "Those who will appear with Biden on Friday include Gov.",
    "Categories: News | Politics Election | Top Stories",
    "“The more he’s here, the better,” Kenyatta said.",
    "“You can’t hide.",
    "Lt. Gov."
  ]
}