{
  "id": 2998,
  "mediaId": 2574,
  "date": "2022-01-28",
  "headline": "Biden Emerges as Dividing Line for Dems in Pennsylvania Senate Primary",
  "image": "https://freebeacon.com/wp-content/uploads/2022/01/pjimage-32.jpg",
  "link": "https://freebeacon.com/democrats/biden-emerges-as-dividing-line-for-dems-in-pennsylvania-senate-primary/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chuck Ross",
  "authorUrl": "https://freebeacon.com/author/chuck-ross/",
  "termIds": [
    0
  ],
  "sentences": [
    "Though Fetterman is considered the most progressive candidate in the Democratic primary, he has struggled to appeal to black voters, in large part because of a 2013 incident in which he pulled a shotgun on an unarmed black jogger.",
    "President Joe Biden has emerged as a dividing line for Democratic Senate candidates in his home state of Pennsylvania, with frontrunner John Fetterman planning to skip Biden's Friday infrastructure event in Pittsburgh.",
    "Abrams, who is running for governor of Georgia, denied that she is upset with Biden, but the incident raised concerns that the president is being increasingly viewed as a political liability.",
    "Fetterman, who in 2020 endorsed Sen. Bernie Sanders (I., Vt.) for president, said he will miss the Biden event to attend a Democratic state committee meeting in Harrisburg on Friday evening.",
    "While Fetterman will be a no-show, Rep. Conor Lamb, another Senate hopeful, plans to attend the event, where Biden is expected to tout his $1.2 trillion infrastructure bill.",
    "Biden, who was born in Scranton, has a 39 percent approval rating in national polls and a negative favorability rating in the Keystone State.",
    "Lamb, a longtime Biden supporter, will share the stage at the infrastructure event with the president and Sen. Bob Casey (D., Pa.).",
    "Fetterman came under fire this week for backing out of meetings he had scheduled with Democratic groups and black clergy members.",
    "He was in Pittsburgh early Friday morning, miles away from the Biden speech venue, to survey the collapse of an area bridge.",
    "Progressive darling Stacey Abrams declined an invitation to appear at a Biden event in Georgia earlier this month.",
    "The brushoff comes as Biden's poll numbers crater over his handling of the economy and coronavirus pandemic.",
    "German chancellor Olaf Scholz turned down Biden's overture to meet to discuss ongoing tensions in Ukraine.",
    "Fetterman, Pennsylvania's lieutenant governor, cited scheduling conflicts for skipping Biden's visit.",
    "Pennsylvania attorney general Josh Shapiro (D.), a gubernatorial candidate, will also miss the event.",
    "For Biden, the Pittsburgh event will mark the third time he's been snubbed this month alone.",
    "Fetterman's campaign did not respond to a request for comment.",
    "The snub fits a pattern for both Fetterman and Biden."
  ]
}