{
  "id": 3053,
  "mediaId": 8489,
  "date": "2022-01-29",
  "headline": "Split among 4 candidates, Pa. Democrats fail to endorse one for U.S. Senate",
  "image": "https://whyy.org/wp-content/uploads/2022/01/AP22028526224733.jpg",
  "link": "https://whyy.org/articles/split-among-4-candidates-pa-democrats-fail-to-endorse-one-for-u-s-senate/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Meyer",
  "authorUrl": "https://whyy.org/person/katie-meyer/",
  "termIds": [
    0
  ],
  "sentences": [
    "Taking the stage after coasting to a unanimous endorsement, Shapiro told the assembled Democrats that he is thankful that they had “unified behind my candidacy in a way that is really unprecedented,” and that he’s “keenly aware of the responsibility that comes with it.”\nNamely, he said, that responsibility is to win the race against whichever candidate emerges from the Republicans’ chaotic 15-person primary.",
    "Speaking ahead of the vote, Lamb pitched himself as a safe bet, urging fellow Democrats not to “underestimate the depth of the commitment of the people we are up against.”\n“On January 6, there was one less vote in the House of Representatives to overturn that election because I beat a guy named Sean Parnell, and I beat two of their other guys as well,” he said.",
    "Going into the endorsement vote, party insiders generally agreed that Lamb — a moderate from the Pittsburgh suburbs who has sought to make the case that he has a record of winning close races in a conservative-leaning area — was the favorite to get the nomination, if anyone would.",
    "As in 2022, there were multiple candidates who were considered formidable: McGinty, who had served as Pennsylvania’s Department of Environmental Protection secretary; former congressman Joe Sestak, and Fetterman, who was then mayor of Braddock and running as a long shot.",
    "3 months ago\nThe voters in the endorsement process are Democrats who have been elected to four-year committee terms on the county level, with each county’s allocation of members based on Democratic Party registration numbers and balanced between men and women.",
    "In fact, over the years, more candidates that have been endorsed have lost the Democratic primary than have won the Democratic primary.”\nMikus served as campaign manager during the primary for Katie McGinty’s 2016 U.S. Senate run against GOP Sen. Pat Toomey.",
    "Also given votes are the party chairs from each county, Democratic National Committee members from Pennsylvania, and a member each from the Pennsylvania Federation of Democratic Women, the Pennsylvania Young Democrats, and high school Democrats.",
    "“You’ve got the African American community, you’ve got Latinos, you’ve got labor, you’ve got environmentalists, you can just go on and on … the Democratic Party, just in terms of interests, is very fragmented.”\n?",
    "Kenyatta obliquely rebutted that argument, saying that “there are some people who want you to vote for them because they think you ought to be scared, because there are Republicans knocking down the door.",
    "But look back in history, when have we ever had an easy election?”\nFetterman, meanwhile, suggested that his grassroots support might be more important than an endorsement from party insiders.",
    "At an official endorsement meeting Saturday in Harrisburg, members of the state Democratic Committee were charged with choosing among Montgomery County Commissioner Val Arkoosh; Lt. Gov.",
    "Attorney General Josh Shapiro, who previously served as a state representative and a Montgomery County commissioner, is the only major candidate running for the Democratic nomination.",
    "“There is no endorsed candidate for United States Senate,” concluded State Sen. Sharif Street, who serves as vice chair of the state party and presided over the meeting.",
    "He beat Philadelphia State Rep. Brian Sims and Montgomery County banker Ray Sosa, and would be the highest-ranking Black public official in Pennsylvania history.",
    "How about the number of donors … our campaign has 180,000 grassroots donors.”\nPittsburgh-based Democratic strategist Mike Mikus noted that Fetterman has a point.",
    "Though Lamb gathered the most votes, followed by Fetterman, Kenyatta, and then Arkoosh, his lead wasn’t decisive enough to clinch the official endorsement.",
    "The body holds up to two voting rounds, and any candidate who doesn’t get at least 15% of the vote in the first round is eliminated from the second.",
    "Pennsylvania’s Democratic Party insiders are officially too split between the four major U.S. Senate primary candidates to make an endorsement.",
    "The final tally in the second round, which saw 267 ballots cast overall, put Kenyatta at 42 votes, Fetterman at 64, and Lamb at 159.",
    "John Fetterman, of Allegheny County; Philadelphia State Rep. Malcolm Kenyatta; and U.S. Rep. Conor Lamb, also of Allegheny County.",
    "Speaking at Saturday’s meeting, she said she has been “overlooked and underestimated” before, and has proven doubters wrong.",
    "She has made her status as the only woman in the race a big part of her campaign, as well as her training as a physician.",
    "Party insiders have said it appears unlikely they’ll be unified enough to endorse anyone in either of the two top races.",
    "Shapiro’s chosen running mate, Allegheny County State Rep. Austin Davis, won the endorsement for lieutenant governor.",
    "Correlations between party support and overall support vary a lot year to year in the Democratic Party, Mikus said.",
    "For any candidate to win Pennsylvania Democrats’ official backing, two-thirds of the committee’s votes are needed.",
    "Republicans plan to hold their own endorsement vote for governor, U.S. Senate, and lieutenant governor on Feb. 5.",
    "?The Democratic Committee did come together enough to make endorsements for governor and lieutenant governor.",
    "That year, McGinty won the most endorsement votes but came up short of getting the actual endorsement.",
    "Arkoosh, who received 17 votes out of 290 in the initial round, was knocked out of the second round.",
    "It’s why endorsements in the party tend to carry less weight than Republican Party endorsements do.",
    "It’s generally understood that a Democratic Party endorsement doesn’t make or break a campaign.",
    "Additional voters can also be elected at-large to ensure gender balance across the committee.",
    "“The state Democratic Committee doesn’t have the power that it once had,” Mikus said.",
    "“The Democratic Party is comprised of a much more diverse population,” he said.",
    "She went on to win the primary, but lost the general election.",
    "“While it’s helpful, it doesn’t guarantee a victory.",
    "“How do you evaluate the strength of a campaign?",
    "Lamb would have needed 176 for the endorsement.",
    "The gubernatorial vote was largely a formality.",
    "The bar is high for a party endorsement.",
    "Is it votes in this room?",
    "How about fundraising?",
    "“How about polls?",
    "Sure,” he said."
  ]
}