{
  "id": 3082,
  "mediaId": 2748,
  "date": "2022-01-29",
  "headline": "Democrats Are Already Making Excuses To Not Appear In Public With Joe Biden",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4Eyjr5u2-p18KMEW4mGVEeZRRnv9KT1mHJxtqsG4SFP8O1w2RQpmfwibptUoxt0CdYu-MfR0jVU79ZJazPNmy3BGzstDhfyp5H1GSAW-IFVrOEDbfWiMZQ8JZfWPlUwsymk2CgHdS7x9Uw2I=w1200-h630-p-k-no-nu",
  "link": "http://www.womensystems.com/2022/01/democrats-are-already-making-excuses-to.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Women System",
  "authorUrl": "https://www.blogger.com/profile/03123176379654101986",
  "termIds": [
    4905,
    4765,
    3989,
    3926,
    392,
    1489,
    6175
  ],
  "sentences": [
    "And while Fetterman and Shapiro indicated that politics had no bearing on their schedules, their decisions to avoid Biden, particularly in his home state, could fuel further questions among anxious Democratic candidates elsewhere as they decide whether to embrace the struggling president.",
    "The Associated Press reports:\nKey Pa. Dems to miss Biden visit, cite scheduling conflicts\nPresident Joe Biden will appear in Pittsburgh on Friday as an opening step in a broader campaign to promote the White House’s achievements in key states before the midterm elections.",
    "John Fetterman, a leading Senate candidate, and state Attorney General Josh Shapiro, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "The high-profile absences come as Democrats in other states have begun taking modest steps to distance themselves from the first-term president, whose approval ratings have fallen sharply in recent months.",
    "But two of the three leading Democrats on Pennsylvania’s statewide ballot this spring who were invited to appear with Biden will not attend, their campaigns confirmed on the eve of the president’s visit.",
    "Another top Senate candidate, Rep. Conor Lamb, a longtime Biden supporter based in Pittsburgh, will attend, his office confirmed.",
    "A few weeks ago, when he gave his awful speech about voting reform in Georgia, Stacey Abrams was strangely missing.",
    "Now some Democrats in Pennsylvania are also having scheduling problems, preventing them from appearing with Biden.",
    "Joe Biden has only been president for a year and he is already becoming a toxic figure for his party.",
    "All three had been invited to participate in a photo line with the president.",
    "She claimed to have a scheduling conflict.",
    "Do you think this is a coincidence?",
    "American Lookout asks.",
    "This is pretty sad.",
    "Lt. Gov."
  ]
}