{
  "id": 3088,
  "mediaId": 2570,
  "date": "2022-01-28",
  "headline": "Fake GOP Electors Subpoenaed By January 6 Committee",
  "image": "",
  "link": "https://www.forbes.com/sites/alisondurkee/2022/01/28/fake-gop-electors-subpoenaed-by-january-6-committee/?sh=7d8c63b15a96",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alison Durkee",
  "authorUrl": "https://www.forbes.com/sites/alisondurkee/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Pennsylvania certificate, for instance, says the GOP officials may “ultimately be recognized” as the “duly elected and qualified electors” in the event of a court order “or other proceeding prescribed by law.” Pennsylvania AG Josh Shapiro told CNN that means the state couldn’t prosecute the GOP electors for committing forgery, as other states might be able to do.",
    "Republicans in Arizona, Georgia, Michigan, New Mexico, Nevada, Pennsylvania, and Wisconsin—which were all won by President Joe Biden—submitted false slates of electors to the National Archives, which falsely claimed they were the state’s electors and their states had elected Trump and Vice President Mike Pence.",
    "CNN reported Friday afternoon the committee had also issued a subpoena for former White House spokesman Judd Deere, seeking information about a staff meeting Trump reportedly held on January 5, 2021 where he repeatedly asked: “What are your ideas for getting the RINOs to do the right thing tomorrow?",
    "The meetings of “alternate” electors in battleground states were publicly known when they took place in December 2020—with the Trump campaign saying at the time they were involved in the effort—and watchdog group American Oversight published copies of the fake elector certificates in March 2021.",
    "The false elector slates were part of a broader campaign by Trump and his allies to overturn the presidential election, which included dozens of failed lawsuits, efforts to persuade state officials to buck the will of the voters and, ultimately, the January 6 riot at the U.S. Capitol building.",
    "State officials in Michigan and New Mexico have also said they’ve looked into the certificates for possible violations of state law, with Michigan AG Dana Nessel noting the false documents could constitute illegal forgery of public records and election documents.",
    "The issue has resurfaced and come under greater scrutiny in recent weeks, however, after the House committee released documents in December showing former White House Chief of Staff Mark Meadows was involved in discussions about the alternate electors plot.",
    "The U.S. Department of Justice is also investigating the fake elector slates, Deputy Attorney General Lisa Monaco told CNN Tuesday, after multiple states’ attorneys general referred the certificates to the DOJ and asked them to look into it.",
    "In Pennsylvania and New Mexico, however, Republicans hedged by presenting themselves as an alternate slate of electors should Biden’s win in the states be invalidated, according to documents published by American Oversight.",
    "Topline\nThe House’s January 6 committee issued subpoenas Friday for 14 Republicans who submitted “alternate” Electoral College votes to Congress falsely claiming then-President Donald Trump had won their states.",
    "The Trump campaign then tried to use those “alternate” electors as a justification to delay or block Congress from certifying the Electoral College votes on January 6, the committee said in a statement.",
    "Key Facts\nThe House select committee investigating last January’s Capitol riot subpoenaed the state GOP officials listed as the “chairperson” and “secretary” for each of the fake elector certificates.",
    "The committee is seeking “information about how these so-called alternate electors met and who was behind that scheme,” chair Rep. Bennie Thompson (D-Miss.)",
    "Most of the fake certificates claimed the Republicans were the state’s “duly elected” electors—which they weren’t, since Biden was the actual winner.",
    "The fake GOP electors in Pennsylvania and New Mexico may face fewer legal ramifications than Republican officials in other states.",
    "As Giuliani coordinated plan for Trump electoral votes in states Biden won, some electors balked (Washington Post)",
    "said in a statement."
  ]
}