{
  "id": 3121,
  "mediaId": 2716,
  "date": "2022-01-28",
  "headline": "Trump praises Pennsylvania ruling against mail-in voting: 'Big news'",
  "image": "https://mediacloud.theweek.com/image/private/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1608668456/gettyimages-1229312707.jpg",
  "link": "https://theweek.com/donald-trump/1009543/trump-praises-pennsylvania-ruling-against-mail-in-voting-big-news",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    0
  ],
  "sentences": [
    "A Pennsylvania state law allowing any voter to cast their ballot by mail was struck down on Friday, \"handing a victory to Republican lawmakers who sought to curtail the practice amid former President Donald Trump's attacks on mail voting,\" reports The Philadelphia Inquirer and Politico.",
    "The battle will continue, however — the decision will almost certainly be appealed to the Pennsylvania Supreme Court, notes the Inquirer, \"triggering an automatic stay of that decision and leaving Act 77 in place while the high court considers the case.\"",
    "In its 3-2 decision on Friday, the Republican-leaning state court ruled the legislature \"could not make changes to voting laws without amending the constitution,\" per the Times.",
    "\"This opinion is based on twisted logic and faulty reasoning, and is wrong on the law,\" said state Attorney General Josh Shapiro, a Democrat, per Politico.",
    "\"Big news out of Pennsylvania, great patriotic spirit is developing at a level that nobody thought possible,\" Trump wrote online after the news broke.",
    "\"The issue will now go before the Pennsylvania Supreme Court, and we are confident that Act 77 will ultimately be upheld as constitutional.\"",
    "Though the bipartisan 2019 law was heralded when it was passed, \"it became a target of conservatives during the 2020 election.\"",
    "Tom Wolf (D) in 2019, allowed for \"no-excuse absentee voting,\" among other things, writes The New York Times.",
    "The law, known as Act 77 and passed by state Gov."
  ]
}