{
  "id": 3180,
  "mediaId": 2553,
  "date": "2022-01-28",
  "headline": "Pennsylvania Court Rules State’s Mail-In-Voting Law Is ‘Unconstitutional’",
  "image": "https://dw-wp-production.imgix.net/2022/01/A781F38E-7E5D-470D-ABAB-6CAE2CEC51E8-scaled-e1641769013297.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/pennsylvania-court-rules-states-mail-in-voting-law-is-unconstitutional",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Meads",
  "authorUrl": "https://www.dailywire.com/author/tim-meads",
  "termIds": [
    0
  ],
  "sentences": [
    "A Pennsylvania court ruled on Friday that the commonwealth’s 2019 voting law, which allowed anybody to apply for and receive a mail-in ballot to vote at least 50 days in advance, was “unconstitutional” because the legislature did not have permission to alter voting laws without amending the constitution, according to a five-judge panel.",
    "That law became a point of contention in the 2020 presidential election after incumbent President Donald Trump and other Republicans accused left-wing actors of using the commonwealth’s lenient mail-in ballot rules to enact massive voter fraud, alleging the change swung the Keystone State to Democrat Joe Biden.",
    "Approximately 1.38 million voters have expressed their interest in voting by mail permanently.”\n“If presented to the people, a constitutional amendment to end the Article VII, Section 1 requirement of in-person voting is likely to be adopted,” the court added.",
    "In the ruling, Judge Mary Hannah Leavitt wrote that “No-excuse mail-in voting” — as it had been nicknamed by critics and supporters alike — “makes the exercise of the franchise more convenient and has been used four times in the history of Pennsylvania.",
    "“The Administration will immediately appeal this decision to the state Supreme Court and today’s lower court ruling will have no immediate effect on mail-in voting pending a final decision on the appeal,” Wolf’s office said in a statement.",
    "“The simple fact is that despite near-unanimous Republican legislative support for this historic update to Pennsylvania election law, they now want to strip away mail-in voting in the service of the ‘big lie.",
    "Act 77, as the voting law is officially known, “allowed voters to submit a ballot by mail up to 50 days before an election and placed voters on a list to permanently receive a ballot application by mail.",
    "“The Republican-controlled legislature passed Act 77 with strong bipartisan support in 2019 to make voting more safe, secure, and accessible and millions of Pennsylvanians have embraced it,” Wolf added.",
    "“But a constitutional amendment must be presented to the people and adopted into our fundamental law before legislation authorizing no-excuse mail-in voting can ‘be placed upon our statute books.",
    "A five-judge Commonwealth Court panel of three Republicans and two Democrats made the decision, but as noted by the Associated Press, would be put on hold immediately if Democratic Gov.",
    "'”\nThe Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "It also established 15 more days to register to vote and extended mail-in and absentee submission deadlines,” ABC 27 News reported.",
    "Wolf and the state’s Attorney General Josh Shapiro (D) pledged to appeal the ruling to Pennsylvania’s Supreme Court.",
    "Tom Wolf’s administration files an appeal to the state Supreme Court as promised.",
    "Get inside access to The Daily Wire by becoming a member.",
    "'”\nIn response, Gov."
  ]
}