{
  "id": 3316,
  "mediaId": 2570,
  "date": "2022-01-28",
  "headline": "Pennsylvania’s Mail-In Voting Law Struck Down",
  "image": "",
  "link": "https://www.forbes.com/sites/alisondurkee/2022/01/28/pennsylvanias-mail-in-voting-law-struck-down/?sh=313c5d6c776e",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alison Durkee",
  "authorUrl": "https://www.forbes.com/sites/alisondurkee/",
  "termIds": [
    0
  ],
  "sentences": [
    "But a constitutional amendment must be presented to the people and adopted into our fundamental law before legislation authorizing no-excuse mail-in voting can ‘be placed upon our statute books.’”\n“This opinion is based on twisted logic and faulty reasoning, and is wrong on the law,” Pennyslvania Attorney General Josh Shapiro said Friday, noting the case’s appeal means the ruling “won’t have any immediate impact on Pennsylvania’s upcoming elections.”\nThe Trump campaign and its allies baselessly alleged that mail-in voting in Pennsylvania in the 2020 election led to widespread voter fraud and unsuccessfully challenged the state’s mail-in voting rules at the Supreme Court.",
    "The Pennsylvania Department of State said in a statement to Forbes it “disagrees with today’s ruling and is working to file an immediate appeal to the Pennsylvania Supreme Court.”\nThe State Department also emphasized the ruling “has no immediate effect on mail-in voting” and that voters will still be able to vote by mail in the state’s upcoming primary election in May.",
    "Topline\nA state appeals court struck down a Pennsylvania law allowing no-excuse mail-in voting as unconstitutional Friday, with potentially strong implications for the battleground state—though the ruling will not impact the state’s upcoming primary elections and could be reversed by the State Supreme Court.",
    "Judges on the Pennsylvania Commonwealth Court, which has a Republican majority, ruled that while no-excuse mail-in voting makes voting “more convenient,” it conflicts with the state’s Constitution and its requirement that people vote in person.",
    "Democratic voting rights advocates told the Philadelphia Inquirer before the ruling they believed even a temporary loss could be damaging, however, as it could further sow people’s distrust in the state’s electoral system.",
    "The legal challenge against Act 77 is part of a broader GOP effort to restrict voting access in the wake of the 2020 election, including both in court and by enacting more restrictive voting laws.",
    "Any changes to Pennsylvania’s mail-in voting procedures could carry heavy implications in the battleground state, which President Joe Biden narrowly won in 2020 with just 50.01% of the vote.",
    "Key Facts\nRepublicans in Pennsylvania challenged Act 77, which allows residents to vote by mail without an excuse, among other voting measures, alleging the law is unconstitutional.",
    "Outside of Pennsylvania, a judge in Wisconsin blocked the state’s use of ballot drop boxes, though that order has since been temporarily paused by an appeals court.",
    "Of the 14 Republican state lawmakers who sued to block Act 77, 11 actually voted for the law when it passed in 2019, the New York Times notes.",
    "That’s how many mail-in ballots were counted in Pennsylvania in the 2020 general election, according to the Pennsylvania Department of State.",
    "“Approximately 1.38 million voters have expressed their interest in voting by mail permanently,” the court wrote in its opinion.",
    "Unlike the Commonwealth Court, the State Supreme Court has a Democratic majority and has upheld mail-in voting laws in the past.",
    "If the state wants to allow no-excuse absentee voting, it can only do so by amending the state Constitution, the court ruled.",
    "Republican lawsuits over Pennsylvania’s mail voting law have some Democrats quietly worried (Philadelphia Inquirer)",
    "Once it does, the ruling will be immediately put on hold, the Associated Press notes.",
    "The state said Friday it will appeal the ruling to the Pennsylvania Supreme Court.",
    "“If presented to the people, a constitutional amendment to end the .",
    "requirement of in-person voting is likely to be adopted.",
    "2.6 million.",
    ".",
    "."
  ]
}