{
  "id": 3426,
  "mediaId": 8449,
  "date": "2022-02-02",
  "headline": "Josh Shapiro: “Nuestra democracia está siendo amenazada”",
  "image": "https://media.telemundo62.com/2020/11/5282393896-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.telemundo62.com/noticias/decision/local-decision/josh-shapiro-nuestra-democracia-esta-siendo-amenazada/2190949/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Mandatos de uso de mascarillas y restricciones por el Covid\n“Ahora mismo tenemos una decisión a nivel estatal relacionada al uso de mascarillas en las escuelas, basada en data científica… Estaré preparado para asegurarme de que nuestras empresas tengan el poder de mantener seguros a sus clientes; que nuestras escuelas estén en condiciones de mantener seguros a nuestros estudiantes y mantener abiertas las puertas de nuestros comercios y las puertas de nuestros estudiantes”.",
    "“Se necesita a alguien que pueda unir a las personas y que haga lo que se tiene que hacer: crear empleos, hacer crecer la economía, proteger los derechos de las personas… el derecho al voto está bajo ataque, nuestra democracia está siendo amenazada, los derechos reproductivos están enfrentando desafíos… tenemos que asegurarnos de que todas estas cosas sean protegidas”.",
    "Quienquiera que resulte ser, creo que lo primero que tiene que reconocer es que el Covid estableció barreras e iniquidades en nuestro sistema: educación, seguro médico, fuerza laboral, nuestro gobierno respondió a eso.",
    "Sobre el voto por correo\nDecisión Local\n“Reforzaré el estatuto del voto por correo, pero hay que tener una conversación honesta y abierta con los republicanos y los demócratas antes de que esto ocurra”.",
    "Josh Shapiro, ex comisionado de Montgomery County y actual fiscal general de Pensilvania, se postula para gobernador en 2022 como demócrata sucesor de Tom Wolf, quien no puede ir a un tercer término.",
    "En esta carrera a la gobernación, donde hay un claro contraste, es entre mi oponente republicano y yo.",
    "Pero ese claro contraste quien lo tiene soy yo con mi oponente republicano”.",
    "Shapiro compartió brevemente cómo se perfila como candidato.",
    "¿Su gobierno será una extensión del gobierno de Tom Wolf?",
    "Tom Wolf y yo, obviamente, somos personas diferentes.",
    "Esto se trata de movernos hacia adelante.",
    "“Esto no se trata de Tom Wolf.",
    "¿Por qué debería ser elegido?"
  ]
}