{
  "id": 3441,
  "mediaId": 8449,
  "date": "2022-01-31",
  "headline": "Tribunal pone en duda la ley de votación por correo",
  "image": "https://media.telemundo62.com/2020/11/GettyImages-1284290058.jpg?quality=85&strip=all&crop=0px%2C91px%2C3000px%2C1687px&resize=1200%2C675",
  "link": "https://www.telemundo62.com/noticias/decision/local-decision/tribunal-pone-en-duda-la-ley-de-votacion-por-correo/2190411/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Incluso los republicanos que evitan repetir las afirmaciones de fraude electoral de Trump han perpetuado la idea de que los demócratas hicieron trampa en las elecciones presidenciales de 2020, distorsionando rutinariamente las acciones de los jueces y funcionarios estatales como \"inconstitucionales\" o \"ilegales\" al resolver disputas legales en la ley de votación.",
    "En la decisión del viernes, los tres jueces republicanos estuvieron de acuerdo con los opositores republicanos, incluidos 11 legisladores que realmente votaron a favor de la ley, y dictaminaron que la constitución estatal prohíbe la votación por correo sin excusas, hasta que se modifique la constitución para permitirla.",
    "Un tribunal declaró el viernes que la ley de votación por correo de Pensilvania viola la constitución estatal, y estuvo de acuerdo con los republicanos que rechazaron la práctica después de que el expresidente Donald Trump comenzara a atacarla en su campaña de reelección de 2020, por alegar que estaba plagada de fraude.",
    "Sin embargo, los opositores republicanos dicen que la constitución tenía la intención de que el voto en ausencia estuviera estrictamente limitado, citando un pasaje que dice que los votantes deben vivir en un distrito electoral durante al menos 60 días donde \"deberán ofrecer votar\".",
    "En 2019, la Legislatura controlada por los republicanos autorizó la votación por correo sin excusas para todos los votantes, ampliando una disposición de la constitución estatal que requería que el estado brindara la opción a los votantes en circunstancias específicas.",
    "La oficina de Wolf dijo que su apelación significa que el fallo de la corte inferior no tiene un efecto inmediato y criticó a los republicanos por tratar de matar la ley \"al servicio de la 'gran mentira'\" de las afirmaciones de fraude electoral sin fundamento de Trump.",
    "La administración del gobernador demócrata Tom Wolf apeló rápidamente a la Corte Suprema del estado, poniendo inmediatamente en suspenso la decisión de línea partidaria de un panel de tres jueces republicanos y dos demócratas y evitando que revocara la ley.",
    "En la opinión, los tres jueces republicanos estuvieron de acuerdo y dijeron que la aprobación había sido citada en dos decisiones anteriores de la Corte Suprema estatal que invalidaban las leyes aprobadas en 1839 y 1923 para expandir el voto en ausencia.",
    "En una demanda posterior a las elecciones en 2020, los republicanos intentaron invalidar la ley de votación por correo y descartar todas las boletas emitidas en virtud de ella en un intento por anular la victoria del demócrata Joe Biden en Pensilvania.",
    "Una investigación de Associated Press sobre posibles casos de fraude electoral en Pensilvania y los otros cinco estados en disputa donde Trump cuestionó su derrota ante el presidente Joe Biden en 2020 encontró una cantidad minúscula de casos.",
    "La ley de votación por correo se ha convertido en un tema candente en la campaña electoral, con casi todos los candidatos republicanos a gobernador, incluidos dos de los tres senadores estatales que votaron a favor, prometiendo derogarla.",
    "A cambio, Wolf acordó deshacerse de la opción de boleta de votación directa que los republicanos habían buscado como una forma de proteger a sus candidatos suburbanos de una ola anti-Trump en las elecciones de 2020.",
    "Raff Donelson, profesor asociado de derecho en la Facultad de Derecho Dickinson de Penn State que enseña derecho constitucional, dijo que no estaba de acuerdo con la opinión de la mayoría en un par de puntos.",
    "El fiscal general de Pensilvania, Josh Shapiro, un demócrata que se postula para gobernador, dijo que confía en que la Corte Suprema del estado mantendrá la ley de votación por correo como constitucional.",
    "Un poco más de 2.5 millones de personas votaron bajo la expansión de la ley de la votación por correo en las elecciones presidenciales de 2020, la mayoría de ellos demócratas, de un total de 6.9 ?",
    "Además, la constitución parece otorgar sin rodeos a los legisladores el poder de prescribir el voto por cualquier método, y eso no puede ser negado por otra disposición de la constitución, dijo.",
    "Además de atacar infundadamente la votación por correo durante gran parte de 2020, Trump también afirmó más tarde, sin pruebas, que le robaron la elección en estados cruciales como Pensilvania.",
    "Los funcionarios electorales en 11 de los 67 condados del estado identificaron un total de 26 posibles casos de fraude electoral, lo que representa el 0,03 % del margen de victoria de Biden.",
    "Aún así, pone en duda las leyes electorales de Pensilvania mientras los votantes del estado se preparan para elegir un nuevo gobernador y un nuevo senador de Estados Unidos en 2022.",
    "La Corte Suprema del estado lo desestimó y dijo que los demandantes “no actuaron con la debida diligencia” al esperar para impugnar la ley hasta que Trump perdió las elecciones.",
    "Todos los legisladores republicanos, excepto uno, votaron a favor de la legislación en un acuerdo con Wolf, quien había buscado la disposición de votación por correo.",
    "Los demócratas disidentes dicen que una disposición separada de la constitución facultaba a los legisladores para proporcionar una votación por correo sin excusas.",
    "Esas circunstancias incluyen estar fuera de la ciudad por negocios, enfermedad, discapacidad física, deberes el día de las elecciones u observancia religiosa.",
    "En última instancia, cualquier decisión de anular la ley no afectaría los millones de votos ya emitidos en virtud de ella en las últimas cuatro elecciones.",
    "“Necesitamos líderes que apoyen la eliminación de más barreras para votar, no que intenten silenciar a la gente”, dijo la oficina de Wolf.",
    "Decisión Local\n“Grandes noticias desde Pensilvania, se está desarrollando un gran espíritu patriótico a un nivel que nadie creía posible.",
    "Criticó la opinión del tribunal inferior como \"basada en una lógica retorcida y un razonamiento defectuoso\" e \"incorrecta en la ley\".",
    "Un punto, dijo Donelson, es que no tiene sentido leer la constitución como una restricción del derecho a emitir un voto en ausencia.",
    "¡Haz que Estados Unidos vuelva a ser grandioso!” dijo Trump en un comunicado a través de su comité de acción política.",
    "Esa disposición dice que las elecciones “serán por votación o por cualquier otro método que prescriba la ley”.",
    "La constitución no dice explícitamente que la Legislatura no puede extender el voto en ausencia a otros.",
    "La Corte Suprema del estado, que escuchará la apelación, tiene una mayoría demócrata de 5-2.",
    "En materia de votación, no es así como suele funcionar la constitución, dijo Donelson.",
    "La Corte Suprema de los Estados Unidos rechazó las apelaciones para intervenir.",
    "Trump y los republicanos elogiaron rápidamente la decisión.",
    "Derrotó a Trump en Pensilvania por más de 80,000 votos.",
    "Los dos demócratas en el panel discreparon.",
    "?millones emitidos."
  ]
}