{
  "id": 3457,
  "mediaId": 8254,
  "date": "2022-01-30",
  "headline": "Pennsylvania Democrats unable to endorse candidate for U.S. Senate",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/01/SANIKA-PKG-FOR-DAYBREAK.00_01_00_57.Still001.jpg?w=1280",
  "link": "https://www.abc27.com/election/pennsylvania-democrats-unable-to-endorse-candidate-for-u-s-senate/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sanika Bhargaw",
  "authorUrl": "https://www.abc27.com/author/sanika-bhargaw/",
  "termIds": [
    0
  ],
  "sentences": [
    "Davis said, “We’re ready to go out and build a coalition that’s going to win in November.”\nWith a crowded Republican field, the state GOP is unlikely to endorse a candidate for governor or Senate, according to Nicholas.",
    "SWATARA TOWNSHIP, Pa. (WHTM) — The Pennsylvania Democratic Committee met Saturday to endorse candidates for three statewide races: governor, lieutenant governor and U.S. Senate.",
    "“You’re going to have a very competitive Senate race, Senate primary on both sides, and I think that Senate race is going to overshadow the governor’s race,” Nicholas said.",
    "The state Democratic committee endorsed Attorney General Josh Shapiro for governor and State Rep. Austin Davis for lieutenant governor, both in the first round of voting.",
    "“I think we showed that we have the strongest argument not just to win the primary, but to win in November, which is what everybody cares about,” he said.",
    "Republican political consultant Christopher Nicholas said the second place finish was a surprise for the number two Democrat in the state.",
    "Governor John Fetterman finished second, with less than a quarter of the vote, and State Rep. Malcolm Kenyatta finished third.",
    "“We’re going to take this message, meet people where they are, visit with them, listen to them,” Shapiro said.",
    "I’ve been delivering for people in Washington, which is not an easy place to get results from,” he said.",
    "Lamb is confident he is in a good position to be the next senator, citing his experience in Washington.",
    "“It’s hard for state committee members…to really winnow the field when it’s so large,” Nicholas said.",
    "None of the candidates running reached the two-thirds vote threshold necessary for endorsement.",
    "“I’ve cast a lot of votes, gotten bills passed under both President Trump and President Biden.",
    "There are at least 14 Republicans running for governor, and eight candidates for Senate.",
    "After two rounds of voting, state Democrats offered no endorsement for U.S. Senate.",
    "He also said it is rare for Republicans not to endorse candidates for these races.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "“The non-endorsement in the Senate race is a big rebuff,” Nicholas said.",
    "Austin Davis is the first Black candidate to be endorsed for the role.",
    "U.S. congressman Conor Lamb fell just a few votes short at 60 percent.",
    "Both candidates are looking past the primary to November.",
    "Democrats made endorsements for only two of those races.",
    "This leaves much up to voters in the spring primary.",
    "Other endorsements went smoothly Saturday.",
    "Sign up for the abc27 newsletters here.",
    "The spring primary is on May 17.",
    "Lt."
  ]
}