{
  "id": 3494,
  "mediaId": 8493,
  "date": "2022-01-28",
  "headline": "PA Headlines: Maps Examined by Courts, Pres. Biden in Pittsburgh",
  "image": "https://www.wkok.com/wp-content/uploads/2020/07/SBC-APP-KO-CAR-PLAY-New.jpg",
  "link": "https://www.wkok.com/594649-2/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    0
  ],
  "sentences": [
    "“This court need not and should not turn this into a beauty contest of selecting the prettiest map,” Tucker said, saying “fair is in the eye of the beholder and determined by how you define ‘fair.’” The Senate Democrats’ lawyer, Marco Attisano, described the vetoed map as the product of a failed legislative process.",
    "In his veto message, he argued that the legislation “fails the test of fundamental fairness.” McCullough, an elected Republican judge, could pick a plan or recommend one, but any decision she makes is highly likely to be appealed to the state Supreme Court, where a 5-2 Democratic majority currently sits.",
    "Biden in December said he plans to run for reelection “if I’m in good health.” A Wednesday poll from Politico and Morning Consult found that 45 percent of registered voters would support Biden if the election were held today, and 44 percent would support Trump, which would make for a tight rematch.",
    "And while Fetterman and Shapiro indicated that politics had no bearing on their schedules, their decisions to avoid Biden, particularly in his home state, could fuel further questions among anxious Democratic candidates elsewhere as they decide whether to embrace the struggling president.",
    "A Harvard CAPS-Harris Poll survey shared with The Hill earlier this week found that in a hypothetical eight-person GOP primary, Trump raked in 57 percent support followed by DeSantis at 11 percent and former Vice President Mike Pence at 11 percent.",
    "PA Headlines 1/28/22\nHARRISBURG, Pa. (AP) — AP is reporting… Pennsylvania judge on Thursday launched a review of competing proposals to redraw the boundaries of the state’s congressional districts, the morning after Democratic Gov.",
    "“I think we all want to make sure that we’re working with, listening to and voting with one another here in Texas.”\n(The Hill) — The Hill is reporting… President Joe Biden is leading former President Donald Trump and Florida Gov.",
    "The survey, conducted by Marquette Law School, found that 43 percent of adults nationwide would support Biden if the 2024 presidential election were held today, while 33 percent would vote for Trump in a one-on-one match-up.",
    "HARRISBURG, Pa. (AP) — AP is reporting… President Joe Biden will appear in Pittsburgh on Friday as an opening step in a broader campaign to promote the White House’s achievements in key states before the midterm elections.",
    "John Fetterman, a leading Senate candidate, and state Attorney General Josh Shapiro, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "Commonwealth Court Judge Patricia McCullough warned the parties the hearing could go into the weekend, reflecting the pressure to draw new boundaries for 17 congressional districts in time for the May 17 primary election.",
    "Earlier in the month, Georgia Democrat Stacey Abrams, a leading candidate for governor in another swing state, skipped a chance to appear with the president in the state, citing an unspecified scheduling conflict.",
    "The high-profile absences come as Democrats in other states have begun taking modest steps to distance themselves from the first-term president, whose approval ratings have fallen sharply in recent months.",
    "But two of the three leading Democrats on Pennsylvania’s statewide ballot this spring who were invited to appear with Biden will not attend, their campaigns confirmed on the eve of the president’s visit.",
    "In a hypothetical race against DeSantis, however, Biden polls slightly better: 41 percent of adults nationwide said they would throw their support behind Biden, while 33 percent would support DeSantis.",
    "The polling comes as tensions between Trump and DeSantis are stewing amid a possibility that the two GOP figures could face off against one another in a Republican primary to lead the ticket in 2024.",
    "With gridlock in the statehouse, McCullough has to consider at least a dozen different proposed maps that must account for demographic shifts over the past decade in the politically divided state.",
    "Recent media reports have taken a microscope to the relationship between the two GOP leaders, one that has been characterized as confrontational and marked by private but personal attacks.",
    "“I’m not interested in any national politician — anyone outside of Texas — coming into this state to help decide the outcome of this,” O’Rourke said, according to The Dallas Morning News.",
    "Complicating the matter is Pennsylvania’s loss of a congressional seat because the state grew more slowly than the rest of the country since 2010, according to U.S. Census findings.",
    "In 1992, a new map of congressional districts was picked by a Commonwealth Court judge and subsequently upheld by the state Supreme Court in a similar process that lasted six weeks.",
    "“Josh Shapiro is running to be the governor of Pennsylvania and he’s focused on the issues that matter to Pennsylvania families,” Shapiro spokesperson Will Simons said.",
    "“Like every American should, Josh wants our president to be successful and we’ll continue welcoming President Biden to his home state of Pennsylvania,” Simons said.",
    "Only 29 percent of those polled said they want to see Trump run for president again in 2024, while 71 percent said they did not want to see him seek a second term.",
    "Additionally, the Florida governor has refused to say publicly whether he will or will not challenge the former president should he wage a reelection campaign.",
    "Wolf on Wednesday evening announced he vetoed the plan that passed the Republican-controlled Legislature with every Democratic lawmaker opposing it.",
    "The hearing began with brief arguments from parties backing their own proposals, including Wolf, Democratic and Republican lawmakers and others.",
    "Congressional redistricting in Pennsylvania is handled as regular legislation, requiring passage by both chambers and the governor’s signature.",
    "The former president appeared to knock DeSantis earlier this month for refusing to disclose if he has received his COVID-19 booster shot.",
    "Robert Tucker, a lawyer for House Republican leaders, told McCullough the map passed by the Legislature was fair to both parties.",
    "Another top Senate candidate, Rep. Conor Lamb, a longtime Biden supporter based in Pittsburgh, will attend, his office confirmed.",
    "Eighteen percent of respondents said they would vote for a different candidate, and 8 percent said they would not cast a ballot.",
    "Last week, Texas Democrat Beto O’Rourke said he didn’t need the Democratic president’s assistance in his campaign for governor.",
    "“They’re asking you to promote the Legislature over the executive branch in the normal legislative process,” Attisano said.",
    "Ron DeSantis (R) in two hypothetical, head-to-head match-ups for the 2024 presidential election, according to a new poll.",
    "But the gubernatorial hopeful has a scheduling conflict this time, Simons said, without detailing the conflict.",
    "And in the weeks since, several other notable Democrats have seemed to distance themselves from Biden as well.",
    "Leading Pennsylvania Democrats who are not on the ballot this year did not have the same scheduling conflicts.",
    "Trump, during an interview, criticized “gutless” politicians who will not reveal their booster shot status.",
    "Shapiro made three appearances with Biden last summer and fall when the president’s numbers were better.",
    "Sixteen percent said they would choose a different candidate, while 6 percent said they would not vote.",
    "Trump has been grumbling behind the scenes for months regarding DeSantis’s rise in the party.",
    "Trump and DeSantis have not revealed if they will launch bids for the White House in 2024.",
    "Tom Wolf, who is term-limited, and Sen. Bob Casey, whose current term runs through 2024.",
    "It’s been a different calculation for vulnerable Democrats who will face voters in 2022.",
    "The Marquette Law School poll surveyed 1,000 adults nationwide from Jan. 10 to Jan. 21.",
    "All three had been invited to participate in a photo line with the president.",
    "No other candidate in the poll pulled in double-digit support.",
    "McCullough should defer to the General Assembly, Tucker said.",
    "Tom Wolf vetoed a plan sent to him by Republican lawmakers.",
    "The margin of error is plus or minus 4 percentage points.",
    "Those who will appear with Biden on Friday include Gov.",
    "Courts, however, drew or picked maps in 1992 and 2018.",
    "Eleven percent said they would not vote.",
    "About The Author",
    "Lt. Gov."
  ]
}