{
  "id": 3544,
  "mediaId": 8401,
  "date": "2022-02-02",
  "headline": "Pennsylvania Attorney General Josh Shapiro Sets Campaign Cash Record To Start Election Year",
  "image": "https://philadelphia.cbslocal.com/wp-content/uploads/sites/15116066/2021/10/josh-shapiro-gov-announcement.jpg?w=1280",
  "link": "https://philadelphia.cbslocal.com/2022/02/02/josh-shapiro-pennsylvania-governor-campaign-cash-record/",
  "mediaOutlet": "philadelphia.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "However, Bill McSwain, a white-collar defense attorney who was the top federal prosecutor in Philadelphia under former President Donald Trump, has the endorsement of an organization that is a conduit for campaign cash from billionaire Jeffrey Yass, who is perhaps the biggest force now in underwriting Republican campaigns in Pennsylvania.",
    "READ MORE:\nThe organization is the Commonwealth Partners Chamber of Entrepreneurs, a relative newcomer to Harrisburg’s deep ranks of advocacy organizations, and McSwain told a Republican audience listening to a candidates’ forum last week that it is prepared to spend up to $20 million on his campaign.",
    "Shapiro, whose campaign report was posted online by the state after Monday night’s reporting deadline, is not expected to face opposition in the primary and has unified the party, getting endorsements from its state committee, top officials and biggest allies, including the AFL-CIO.",
    "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General Josh Shapiro, headed into 2022 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "The double-digits deep field of Republican candidates vying for the party’s nomination reported relatively anemic fundraising through Dec. 31, producing totals that are well behind where candidates were at the same point in 2018 and 2014.",
    "“They are going to spend up to $20 million on my campaign because they believe in my message and there’s nobody up here on this stage, or even the people who didn’t show up for the debate, who can compete with that,” McSwain said.",
    "But Brouillette said Wednesday that the organization has purchased $800,000 worth of TV ads for McSwain and that another $4 million “is in the works.”\nThe primary election is May 17.",
    "Commonwealth Partners’ president and chief executive, Matt Brouillette, would not discuss how much money the organization will spend on McSwain’s campaign.",
    "Dave White, who runs a large plumbing and HVAC firm in Delaware County, loaned himself $3 million and led the field with almost $2.5 million in the bank.",
    "READ MORE:\nHe reported raising $13.4 million in 2021, boosted by labor unions and big checks in a state that puts no limits on individual contributions.",
    "For comparison, upwards of $65 million was spent on the last race for governor, in 2018, according to campaign reports filed with the state.",
    "Labor unions gave Shapiro more than $3 million in 2021, while donors who gave at least $50,000 kicked in more than $5.4 million.",
    "The most a gubernatorial candidate in Pennsylvania has carried into an election year was $12.5 million by Democratic Gov.",
    "Jake Corman, the state Senate’s ranking Republican, reported just over $2 million in the bank.",
    "The most a gubernatorial candidate carried into an election year for an open seat was Gov.",
    "Ed Rendell in 2006, according to state campaign finance records.",
    "MORE NEWS:\n(©Copyright 2021 by The Associated Press.",
    "No other reports on file came close.",
    "Tom Wolf’s $11.8 million in 2014.",
    "All Rights Reserved.)"
  ]
}