{
  "id": 3577,
  "mediaId": 2658,
  "date": "2022-01-24",
  "headline": "Senators counting on Electoral Count Act",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/01/24/senators-counting-on-electoral-count-act-00001009",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5879,
    5810,
    4839,
    4597,
    4060,
    3173,
    2082,
    1489
  ],
  "sentences": [
    "QUICK LINKS\nTop Jan. 6 Investigator Fired From Post at the University of Virginia, from The New York Times\nTaxpayers face overloaded IRS as filing season opens Monday, from The AP\nA 'Reset In Black Politics’: Retirements Set Up Battle Over Congressional Black Caucus’s Direction, from HuffPost\nTwo veterans, one decade, Tom Brady, and a congressman: An unlikely Afghan escape leads to reunion at the playoffs, from CNN\nFlorida man pleads guilty to threatening to kill, behead Pelosi, Ocasio-Cortez, from NBC News\nTRANSITIONS\nAdam Jardine is now a senior legislative assistant and appropriations associate for Rep. Debbie Wasserman Schultz (D-Fla.), replacing Michael Harris, who recently joined the U.S.",
    "SINEMA CENSURE — The Arizona Democratic Party’s executive board slapped a censure on Sen. Kyrsten Sinema (D-Ariz.) over the weekend, stating: \"While we take no pleasure in this announcement, the ADP Executive Board has decided to formally censure Senator Sinema as a result of her failure to do whatever it takes to ensure the health of our democracy.” The rebuke is rooted in Sinema’s refusal to change the Senate’s filibuster rules to pass sweeping voting rights legislation.",
    "RHODES' ROAD TO TRIAL— Federal prosecutors head to court Monday to make their case to keep Oath Keeper Stewart Rhodes in jail pending his trial for “seditious conspiracy” and building the plot to storm the Capitol to delay and possibly derail the certification of President Joe Biden’s victory in the 2020 presidential race, with a huge stockpile of weapons at the ready in Arlington, Va. Josh Gerstein and Kyle Cheny have a preview of the Rhodes case from Plano, Texas.",
    "Senators counting on Electoral Count Act\nBy KATHERINE TULLY-MCMANUS\n01/24/2022 07:46 AM EST\nPresented by\nWith help from Marianne LeVine\nELECTIONS ACTION: SENATE GROUP MEETS — Senators are taking the Democrats’ bruising (and predictable) loss last week on election reforms and voting rights legislation and turning it into momentum for a narrower bipartisan effort to reexamine the 1887 law that governs how Congress counts Electoral College votes from each state.",
    "TOUGH CALLS IN KYIV — The State Department announced Sunday that amid increasing concerns about a possible Russian invasion of Ukraine, it has ordered family members of U.S. Embassy personnel in Kyiv to leave the country along with some diplomats.",
    "Other ideas for broader elections reform include giving poll workers additional protections from harassment and expanding the use of grants from the Election Assistance Commission, which provides guidance to state and local election officials.",
    "EMINENT EMMER— Rep. Tom Emmer, head of the House Republican campaign arm, has a hot ticket heading into the midterms with expectations high for GOP gains and barring a collapse the Minnesota Republican could have his pick of roles in 2023.",
    "HUDDLE HOTDISH\nAssisting the staff assistants…The Congressional Women’s Staff Association and the Modernization Staff Association are holding a joint “skills-building workshop” for staff assistants in both the House and Senate, on Tuesday.",
    "TRIVIA\nFRIDAY’S WINNER: Patrick Delaney correctly answered that President and former Sen. James Monroe used cover crops on his farm, a practice which the Biden Administration and USDA have communicated a commitment to promote.",
    "“If you talk to some of my colleagues, I'm sure they told you that I'm a little adamant about staying focused in the moment.” Don’t miss Olivia’s exploration of Emmer’s strategy and what’s next for the campaign chief.",
    "A bipartisan group of senators, led by Sen. Susan Collins (R-Maine), will meet this afternoon over Zoom to talk about potential reforms to the Electoral Count Act, according to a person familiar with the matter.",
    "Matt Dolan, a state senator and part owner of the Cleveland Guardians baseball team, has contributed $10.5 million to his campaign while investment banker Mike Gibbons has loaned himself $11.4 million.",
    "He’s managed to unite disparate wings of the House Republican Conference, from firebrand conservatives to pro-impeachment moderates, by keeping them laser focused on taking control of the House.",
    "BIG SENATE SPENDING — This year’s Senate midterm election cycle is being fueled by unrivaled piles of dough, from big ad buys to millionaires padding their coffers with personal cash.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Monday, January 24, where we know NFL overtime rules may get more attention than any legislation today.",
    "Members of the group are considering updating the 1887 law to clarify that the vice president's role in overseeing Congress' certification of election results is ministerial (i.e.",
    "Senate and House GOP leaders are signaling they're open to the concept but the group is in its early stages and it could be weeks before a concrete proposal comes together.",
    "Plus, best practices for constituent services and administrative duties that will help you build a more effectively run the office,” say the two hosting orgs.",
    "Mitt Romney (R-Utah), Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.), Thom Tillis (R-N.C.), Jeanne Shaheen (D-N.H.) and Roger Wicker (R-Miss.).",
    "“Over the last decade, just seven Senate candidates nationwide have put $10 million or more of their own funds into their races.",
    "It came under scrutiny in the wake of last year's January 6 attack on the Capitol, which was aimed at disrupting that process.",
    "TODAY’S QUESTION from Patrick: The American Horticultural Society’s headquarters are on one of George Washington’s five farms.",
    "Jonathan Older is the new scheduler in Rep. Josh Gottheimer’s (D-N.J.) office, as Josh Shapiro moves to be staff assistant.",
    "Other Americans in Ukraine are being urged to leave as soon as possible via private and commercial transportation options.",
    "Jardine was previously Senior Legislative Assistant and Appropriations Associate to Rep. Sanford Bishop (D-Ga.).",
    "on the Senate Judiciary Committee’s Federal Courts, Oversight, Agency Action, and Federal Rights Subcommittee.",
    "For bonus points, what nation tried to buy it in 1971 before Congress and the State Department intervened?",
    "In addition, the group is looking at potentially raising the threshold for challenging election results.",
    "This year, however, at least two Republicans in Ohio have already done so,” notes Natalie Alison.",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "Ellie Turner is now communications director for Rep. Sharice Davids (D-Kan).",
    "Nathan Williams is now counsel to ranking member Sen. John Kennedy (R-La.)",
    "He previously was investigations counsel on the Senate Commerce Committee.",
    "Strike a pose…Those Capitol Hill glamor shots your friend took of you?",
    "“The only thing I have in mind right now is winning a majority.",
    "The censure is mainly symbolic, with little practical effect.",
    "Brandon Naylor is now deputy chief of staff for Davids.",
    "Check out Alison’s dive into senate campaign spending.",
    "The Senate convenes at 1 p.m. for a pro forma session.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "In addition to Collins, the group includes Sens.",
    "That's it,” Emmer told Olivia in an interview.",
    "GET HUDDLE emailed to your phone each morning.",
    "TODAY IN CONGRESS\nThe House is not in session.",
    "AROUND THE HILL\nNot much on a recess Monday.",
    "Send your answers to ktm@politico.com.",
    "“Discover resources available to SAs.",
    "they can't overturn the results.)",
    "Fish and Wildlife Service.",
    "They aren’t anything new.",
    "What’s it called?",
    "Who are they?",
    "GOOD MORNING!"
  ]
}