{
  "id": 3645,
  "mediaId": 8438,
  "date": "2022-01-18",
  "headline": "Briefs: January 18th, 2022",
  "image": "https://cdn.centraljersey.com/wp-content/uploads/sites/25/2022/01/Conviser.jpg",
  "link": "https://southphillyreview.com/2022/01/18/briefs-january-18th-2022/",
  "mediaOutlet": "southphillyreview.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "South Philly Review -",
  "authorUrl": "https://southphillyreview.com/author/southphillyreview/",
  "termIds": [
    0
  ],
  "sentences": [
    "Interested veterans should go to https://is.gd/PA3Vet for more information on how to apply, or visit www.usajobs.gov and search for “Wounded Warrior Fellowship Program.”\nTheatre Exile opens new play in February\nTheatre Exile at 1430 S. 13th St. will present The Motherf**ker with the Hat by Pulitzer Prize-winning playwright Stephen Adly Guirgis from Feb. 3-27 with Theatre Exile’s new theater limited-capacity audience of 60 guests, reduced from the usual 125-seat capacity.",
    "“Helping our veterans has always been a top priority for me in Congress, so I’m proud that the House of Representatives has this Wounded Warrior Program to create employment opportunities for veterans with the House and provide veterans with experience and exposure to broaden career opportunities,” Evans said.",
    "Barletta said a charter flight landed in Harrisburg on Jan. 10, and buses carried the illegals to the former Moshannon Valley Correctional Facility, near Philipsburg, which is now being used as a U.S. Immigration and Customs Enforcement detention center.",
    "I approve this message because it’s time we protect our citizens and enforce our immigration laws.”\nNo voting by non-citizens\nJeff Bartos, a Republican candidate for U.S. Senate, opposes allowing non-citizens to vote in American elections.",
    "Fiedler partners in food drive for South Philly families\nState Rep. Elizabeth Fiedler recently partnered with local groups to provide food to senior citizens and families across her district, which includes parts of South Philadelphia.",
    "Here is the schedule through next summer: Hadestown (Feb. 9-20, Academy of Music); Beautiful – The Carole King Musical (Feb. 22-27, Academy of Music); Rent: 25th Anniversary Farewell Tour (March 4-6, Merriam Theater); Oklahoma!",
    "(March 8-20, Forrest Theatre); Waitress (March 29 to April 3, Academy of Music); Hairspray (May 16-22, Merriam Theater); To Kill A Mockingbird (July 12-24, Academy of Music); and Dear Evan Hansen (Aug. 16-28, Forrest Theatre).",
    "Dozens of holiday hams and groceries were provided to seniors from the South Philadelphia Older Adult Center, and to children and their families from the Discovery Place Pre-School, in partnership with IBEW Local 98 and Acme.",
    "The presentation Invisible Worlds and the Cycle of Life is scheduled for Sunday, Jan. 30, at 2 p.m.\nA junior scientist workshop, How Do Plants Communicate?, is set for Saturday, Feb. 12, from 10 a.m. to noon.",
    "Water exhibit opens\nThe Academy of Natural Sciences of Drexel University, 1900 Benjamin Franklin Parkway, is presenting Invisible World of Water, on view through May 1 and free with general admission.",
    "Upcoming cruises\nThe Bristol Cultural and Historical Foundation is sponsoring a cruise to Charleston and Bermuda, June 2-12, 2022, on the Celebrity Summit, sailing from Cape Liberty, in North Jersey.",
    "Hidden Works of Nature: The Microscopic World in the Library & Archives will be on exhibit on the following Fridays, hourly from 11 a.m. to 4 p.m.: Jan. 21, Feb. 4 and 18 and March 4 and 18.",
    "“This tradition of holiday giving is particularly meaningful as we end such a difficult year, full of hardship and loss, and continue to struggle through challenging times,” Fiedler said.",
    "Activities at Academy of Natural Sciences\nThe Academy of Natural Sciences of Drexel University, 1900 Benjamin Franklin Parkway, is hosting several current and upcoming exhibits.",
    "He’s working to overcome his addictions with the help of his sponsor, Ralph D, but is soon confronted by familiar demons when he discovers another man’s hat in his apartment.",
    "We need to secure our border and build the wall.”\nIn the ad, Sands says, “The Biden administration wants to give amnesty and huge taxpayer checks to illegal immigrants.",
    "Sands wants secure border\nCarla Sands, former economic adviser and Ambassador to Denmark under President Donald Trump, released her newest ad, Protect Our Citizens.",
    "More illegals coming to PA\nLou Barletta, a Republican candidate for governor, is complaining about adult illegal immigrants secretly being brought to Pennsylvania.",
    "The exhibit coincides with “Water Year,” an initiative of the Academy of Natural Sciences and Drexel University aimed to increase public attention of the resource.",
    "We need a national, federal constitutional amendment to make it very clear that only United States citizens may vote in elections in the United States,” he said.",
    "North alums awarding grants\nThe Northeast Catholic Alumni Association awards tuition grants to the sons, daughters, grandsons and granddaughters of its members.",
    "“Many of you probably know that New York City now put into law, with the new mayor, legislation that allows 800,000 non-citizens to vote in municipal elections.",
    "Barletta said the Biden administration is flying illegals to Pennsylvania and other states to clear the overflowing detention centers near the southern border.",
    "Distinguishing itself outside of utilitarian use, this show explores the materiality and form in the traditionally domestic media of ceramic and fiber art.",
    "The stitching helped Rebecca to recover her arm and hand strength, while the infinite range of beautifully colored yarns filled her with optimism.",
    "A junior scientist workshop titled Water Bugs, geared to kids in third to fifth grades, is scheduled for Saturday, March 19, from 10 a.m. to noon.",
    "Students can apply for a grant if their father or grandfather attended Northeast Catholic and is a dues-paying member of the alumni association.",
    "Tom Wolf and state attorney General Josh Shapiro, a Democratic candidate for governor, have dismissed Barletta’s complaints as a federal issue.",
    "This collection will balance on the contrast of the physical nature of these two mediums and the similarities in their connotations to craft.",
    "Weaving her life experience through the yarn, each tapestry became an homage to her life and the relationships she has formed along the way.",
    "Flea market vendor alert\nSt. Hubert, 7320 Torresdale Ave., will host an indoor flea market on Saturday, Feb. 5, from 7:30 a.m. to 12:30 p.m.",
    "Flower show tickets available\nThe Pennsylvania Horticultural Society announced that tickets are on sale for the Philadelphia Flower Show.",
    "The checks are awarded to students who meet criteria, and the monies are sent to the Catholic school that they are choosing to attend.",
    "At the pit party, fans can see the massive 12,000-pound trucks up close, meet their favorite drivers and crews, and take pictures.",
    "The show will take place at Franklin Delano Roosevelt Park, 1500 Pattison Ave., from Saturday, June 11, through Sunday, June 19.",
    "The dramatic contrast of light and dark, the bold colors, the intricate patterns, all working together to tell Rebecca’s story.",
    "The discussion Growing Art from Science will take place on Wednesday, Feb. 23, at 6:30 p.m. Register at https://bit.ly/3rRiQOe.",
    "Grants are given to 32 students annually for their four years in high school or college and three years in elementary school.",
    "A junior scientist workshop, What’s So Amazing About a Diatom?, will take place on Saturday, Jan. 22, from 10 a.m. to noon.",
    "After his release from prison, Jackie moves in with his childhood sweetheart Veronica as he tries to start his life anew.",
    "At the same time, there will be a group exhibition on display called “Concentric Craft” which is juried by Ashley York.",
    "Aid is sent to Catholic elementary and high schools and universities in the Philadelphia, Camden and Trenton dioceses.",
    "Meanwhile, a fully escorted Holy Lands & Aegean Majesty cruise will sail Oct. 6-17, 2023, featuring 10 ports-of-call.",
    "Da Vinci Art Alliance opens 2 exhibitions\nThe Da Vinci Art Alliance at 704 Catharine St. opened two new exhibitions.",
    "Rebecca Conviser: Creative Expressions opened on Jan 13, and will soon also be available as a video walkthrough.",
    "To reserve vendor space or for more information, email fleamarket@huberts.org or visit huberts.org/fleamarket/.",
    "To qualify, a veteran must be honorably discharged and released from active duty within the last five years.",
    "Apply for scholarship\nThe deadline is March 1 to apply for the Children’s Scholarship Fund Philadelphia.",
    "For more information, visit https://theatreexile.org/shows/the-mfer-with-the-hat/ or call 215-218-4022.",
    "Evans Seeking ‘Wounded Warrior’ Veteran for Job in Philly office\nCongressman Dwight Evans (D-3rd dist.)",
    "“It’s time to bring back the America First policies that I fought for in the Trump administration.",
    "Every day there is a new headline about drugs and criminals pouring over our border,” Sands said.",
    "is seeking a medically retired veteran for a two-year paid fellowship in his Philadelphia office.",
    "Conviser began making needlepoint tapestries in order to process her battle with breast cancer.",
    "Monster Jam at the Linc\nMonster Jam returns to Lincoln Financial Field on Saturday, April 16.",
    "Scholarships are available to income-eligible kids in kindergarten through eighth grade.",
    "Kimmel schedule\nThe Kimmel Cultural Campus has returned to live Broadway programming.",
    "Rates, including airfare, range from $4,198 to $7,998 per person, double occupancy.",
    "The show starts at 7 p.m., with a pit party for fans going from 2:30 to 5:30.",
    "As your next senator, I will fight back against Biden’s open border policies.",
    "Extreme Deep: Mission to the Abyss will run from April 2 to July 24.",
    "For more information, call 215-893-1955 or visit kimmelcenter.org.",
    "Bartos wants a constitutional amendment prohibiting the practice.",
    "“We fought for policies that worked and helped secure our border.",
    "Is it any wonder illegal border crossings are at a 20-year high?",
    "No taxpayer-funded checks for illegal immigrants and no amnesty.",
    "Rates range from $1,577 to $2,387 per person, double occupancy.",
    "Let’s finish President Trump’s wall and ban sanctuary cities.",
    "The workshop is geared to kids in third to fifth grades.",
    "Ocean Bound will run from Aug. 20 to Jan. 15, 2023.",
    "Proceeds will benefit the Faculty Scholarship Fund.",
    "Call 215-788-9408 for information and reservations.",
    "The workshop is for kids in third to fifth grades.",
    "For tickets, go to PHSonline.org/the-flower-show.",
    "For information, visit davinciartalliance.org.",
    "Call 215-543-1051 or email necathalum@aol.com.",
    "Tickets are available at www.ticketmaster.com.",
    "Applications are accepted until Jan 31, 2022.",
    "Invisible World of Water runs through May 1.",
    "The Biden administration is failing us.",
    "For more information, visit ansp.org.",
    "Both exhibitions run through Feb. 2.",
    "Sea Change is running indefinitely.",
    "Register at https://bit.ly/3pbrMLq.",
    "Register at https://bit.ly/3Da6brG.",
    "They are awarded by random lottery.",
    "Register at https://bit.ly/3E9nVEZ.",
    "The theme is In Full Bloom.",
    "I’m Carla Sands.",
    "Gov."
  ]
}