{
  "id": 3846,
  "mediaId": 2562,
  "date": "2022-01-27",
  "headline": "‘Scheduling Conflicts’ to Keep Democratic Candidates From Biden’s Pa. Visit",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/01/getfile.aspxguidA3C39FB2-102B-4738-A552-D94E40A9FB3D.jpg",
  "link": "https://donaldjtrumppolls.com/scheduling-conflicts-to-keep-democratic-candidates-from-bidens-pa-visit/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "'Scheduling Conflicts' to Keep Democratic Candidates From Biden's Pa. Visit (Danielfela/Dreamstime.com)\nBy Luca Cacciatore | Thursday, 27 January 2022 09:20 PM\nTwo statewide Democratic candidates in Pennsylvania will not be on hand for President Joe Biden's visit to Pittsburgh on Friday, as low approval ratings make the president a liability in the midterms, The Associated Press reported on Thursday.",
    "\"President Biden first announced his infrastructure plan in Pittsburgh, and Conor looks forward to welcoming him back and talking about all the good jobs that bill will create in the Pittsburgh area and all over Pennsylvania,\" said Lamb campaign manager Abby Nassif-Murphy.",
    "The absences of Fetterman and Shapiro come as Democrats have begun to distance themselves from Biden, whose average approval rating stands at 41.5% and disapproval rating above 53.6% among likely or registered voters, according to FiveThirtyEight.",
    "John Fetterman, who is running for U.S. Senate in 2022, and state Attorney General Josh Shapiro, who is seeking the Democratic nomination for governor the same year, will not attend due to \"scheduling conflicts,\" their spokespeople told AP.",
    "\"Josh Shapiro is running to be the governor of Pennsylvania, and he's focused on the issues that matter to Pennsylvania families,\" the attorney general's spokesperson, Will Simons, told AP.",
    "\"Like every American should, Josh wants our president to be successful, and we'll continue welcoming President Biden to his home state of Pennsylvania,\" Simons said.",
    "Fetterman said he would miss Biden's visit to attend the Democratic state committee, which begins Friday in Harrisburg.",
    "Shapiro made three appearances with Biden last summer and fall when the president's approval rating was over 50%.",
    "\"It's great that President Biden is coming to Pittsburgh to talk about infrastructure,\" Fetterman said.",
    "Another Democratic Senate candidate, Rep. Conor Lamb, confirmed that he would attend the gathering.",
    "But he said he'll be in Harrisburg to talk to Democrats about the midterms.",
    "The two have indicated that politics had no bearing on their decisions.",
    "Original Article",
    "Lt. Gov."
  ]
}