{
  "id": 4035,
  "mediaId": 8325,
  "date": "2022-01-27",
  "headline": "PA Pension Fund Says It Won’t Require Board to Sign Secrecy Oaths to Hear Key Report",
  "image": "https://i0.wp.com/gantnews.com/wp-content/uploads/2022/01/image-13.jpeg?fit=2400%2C1600&ssl=1",
  "link": "https://gantnews.com/2022/01/27/pa-pension-fund-says-it-wont-require-board-to-sign-secrecy-oaths-to-hear-key-report/",
  "mediaOutlet": "gantdaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gant Team",
  "authorUrl": "https://gantnews.com/author/gantadmin/",
  "termIds": [
    0
  ],
  "sentences": [
    "Williams, in her statement, left the question of public disclosure unresolved: She wrote only that, during the meeting, “the board will determine the appropriate next steps.”\nOther critical reports have gone public with rebuttals\nIn a key 1996 ruling, Simon v. Commonwealth of Pennsylvania, Commonwealth Court blocked a state crime commission from identifying people as being linked to mobsters without giving them the right to defend themselves in advance.",
    "“Given the massive amounts of public dollars involved in PSERS’ operations, the scales weigh heavily in favor of transparency.”\nBurke, who has sought PSERS records on behalf of The Inquirer, added: When taxpayers help pay for a report of a “public institution … they are entitled to see how their money is spent.”\nHow the Womble report might be disclosed\nPSERS is financed by working educators, taxpayers, and investment returns.",
    "While Womble has so far revealed little of its work to the board, sources say the firm has told the panel that it has found no evidence of criminal wrongdoing by PSERS staff — points echoed by lawyers for executive director Glen Grell and former chief investment officer James H. Grossman Jr.\nGrell and Grossman announced their retirement in November in a shakeup of fund leadership.",
    "He has praised the call for NDAs, saying they would protect the reputations of staff and prevent the board from “being unfairly criticized.”\nIn response to a query from The Inquirer, Evelyn Williams, PSERS’ spokesperson, wrote Tuesday that “PSERS board members have been asked to sign an NDA but are not required to sign it to attend the January 31st meeting.” The emphasis was hers.",
    "“Half the battle is getting the public to believe what you’re saying is true and accurate.”\nThe agency had “indicated last week that the price of admission to attend a significant closed-door session was to be signing a non-disclosure agreement,” added Mutchler, a former head of Pennsylvania’s state Office of Open Records.",
    "“Furthermore, our client has not engaged in any action that would or could form the basis of any civil liability.”\nOf Grossman, his lawyer Matthew Haverstick has said, “As an employee of the organization, he did what he was told to do and didn’t do anything wrong.”\nHaverstick could not be reached for comment Wednesday.",
    "Angela Couloumbis of Spotlight PA, Joseph N. DiStefano of The Inquirer and Craig R. McCoy of The Inquirer\nSpotlight PA is an independent, nonpartisan newsroom powered by The Philadelphia Inquirer in partnership with PennLive/The Patriot-News, TribLIVE/Pittsburgh Tribune-Review, and WITF Public Media.",
    "At one point, a top Womble lawyer cautioned the board that transparency might not be “the right answer.”\nBoard member Katie Muth, a Democratic state senator from Montgomery County, has sharply criticized the call for NDAs and said she would not sign one.",
    "But the board leaders grew skittish about receiving it, setting and resetting dates to do so, after the law firm warned in early November that PSERS officials who are criticized in the report have strong legal rights to defend their reputations.",
    "In 2018, about a dozen priests who were among hundreds to be identified and criticized in a massive report by Attorney General Josh Shapiro about child abuse in six Catholic dioceses filed legal challenges to the document before its release.",
    "HARRISBURG — Members of the board of Pennsylvania’s $73 billion school pension fund won’t be required to sign non-disclosure agreements before hearing on Monday the long-awaited findings of an internal investigation into the mammoth plan.",
    "The firm, Womble Bond Dickinson, was hired 10 months ago to conduct a parallel probe into issues that have also been the subject of investigations by federal prosecutors, the FBI, and federal financial regulators.",
    "“We’re very happy they have now stated that the NDA is not a requirement.”\nAnother board member, State Treasurer Stacy Garrity, will not sign any NDA, according to Samantha Galvez, the treasurer’s spokesperson.",
    "The inquiries have been looking into the fund’s adoption of an exaggerated number for investment profits as well as PSERS’ purchase of real estate near its Harrisburg offices.",
    "In 2014, then-Attorney General Kathleen Kane released a lengthy report exploring whether prosecutors had made missteps in the investigation of child molester Jerry Sandusky.",
    "WHILE YOU’RE HERE… If you learned something from this story, pay it forward and become a member of Spotlight PA so someone else can in the future at spotlightpa.org/donate.",
    "In an opinion, the high court acknowledged that the censorship might be “unsatisfying to the public and to the victims,” but said that fairness demanded the redactions.",
    "Still, state officials have previously found ways to make explosive investigative reports public while looking out for the interests of those identified in the reports.",
    "The Public School Employees’ Retirement System is still asking the board to sign the secrecy pacts, but is not insisting upon it, the plan’s spokesperson says.",
    "The board later corrected the profits figure, forcing school staff to pay more to the pension fund, but has otherwise said nothing for months about any issue.",
    "Paula Knudsen Burke, a lawyer with the national Reporters Committee for Freedom of the Press, said that the report should be released widely and not censored.",
    "Her statement clarified a previous controversial email from the board’s chairman, asking members to sign NDAs without saying they had the option to refuse.",
    "A law firm is set to unveil the findings of an internal investigation into the mammoth plan at a private session for the PSERS board next week.",
    "“Based on my extensive review of the facts, I know that Mr. Grell has not engaged in any criminal conduct,” wrote his lawyer, Marc S. Raspanti.",
    "Christopher Santa Maria, the PSERS board chair, cited the decision in his original email to members, asking them to sign secrecy oaths.",
    "“There must be a balancing that weighs the public’s interest in disclosure against employees’ claimed reputational concerns,” she said.",
    "But the board has yet to decide whether, how soon, and how completely those findings will be made public after the meeting.",
    "Spotlight PA is funded by foundationsand readers like you who are committed to accountability journalism that gets results.",
    "A law firm is to unveil the results of its investigation at a closed-door session for the PSERS board on Monday morning.",
    "“I’m not signing because it’s unnecessary and redundant since the executive session is already confidential,” she said.",
    "The report includes written responses from 13 former prosecutors and others whose actions were explored in the probe.",
    "However, it had many sections blacked out, including the names of the priests who had questioned the report.",
    "Garrity and Muth have called for the agency to make a prompt public report of the investigation findings.",
    "As the ruling noted, the Pennsylvania Constitution enumerates reputation as a fundamental right.",
    "Womble lawyers said at one point that they could deliver their report on Nov. 18.",
    "Her lawyer, Terry Mutchler, said it was “the right move” not to require them.",
    "Tom Wolf and Democratic and Republican candidates intent on succeeding him.",
    "It also included a further 400 pages of rebuttals from those it criticized.",
    "The fund sends $6 billion in pension checks to 250,000 retirees yearly.",
    "In the end, Shapiro released an 884-page report that drew headlines.",
    "“I’m glad to hear they clarified this,” Mutchler said.",
    "It is one of few state constitutions to do so.",
    "The state Supreme Court backed the priests.",
    "Sign up for our free newsletters.",
    "So have Gov."
  ]
}