{
  "id": 4045,
  "mediaId": 8449,
  "date": "2022-01-19",
  "headline": "¿Quién corre por la gobernación en 2022?",
  "image": "https://media.telemundo62.com/2022/01/GettyImages-534819466.jpg?quality=85&strip=all&resize=1024%2C675",
  "link": "https://www.telemundo62.com/noticias/decision/local-decision/quien-corre-por-la-gobernacion-en-2022/2187762/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Joe Soloski (Libertario): Un contador que vive en el centro de Pensilvania, al oeste de Harrisburg, el defensor del gobierno pequeño quiere despenalizar la marihuana, vender las licorerías estatales, promulgar límites de mandato para los funcionarios electos, quitarle poderes de emergencia al gobernador y convertir la Legislatura estatal en un trabajo de medio tiempo para políticos.",
    "El actual gobernador, el demócrata Tom Wolf, deja el cargo en enero de 2023 y no puede postularse para un tercer mandato, por lo que su partido tiene un candidato esperando entre bastidores: se espera que el actual fiscal general de Pensilvania, Josh Shapiro, no enfrente un gran desafío por la nominación demócrata en las elecciones primarias de mayo.",
    "Doug Mastriano (republicano): Como senador estatal que representa a un distrito central de Pensilvania a lo largo de la frontera con Maryland, Mastriano ha ascendido rápidamente en el último año al apoyar firmemente las refutaciones del expresidente Trump a los resultados de las elecciones de 2020.",
    "Joe Gale (republicano): el segundo mandato del comisionado de Montgomery County se llama a sí mismo con orgullo \"el único republicano que no está controlado por jefes parciales del Partido Republicano\", y durante mucho tiempo ha promocionado su apoyo inicial al expresidente Trump.",
    "Shawn Berger (republicano): El propietario de un negocio y restaurante de Lehigh Valley se postula como un conservador pro-vida y pro-marihuana que quiere brindar capacitación sobre seguridad con armas de fuego a las escuelas públicas y proporcionar más fondos para la educación.",
    "Jason Richey (republicano): Como abogado en Pittsburgh y nativo del oeste de Pensilvania, Richey quiere reducir los impuestos a la propiedad y al mismo tiempo garantizar que se financien los departamentos de la Policía y la seguridad pública.",
    "Jake Corman (republicano): Senador estatal durante más de 20 años, ocupando un escaño que antes ocupaba su padre, Corman representa un distrito central de Pensilvania que incluye el campus principal de la Universidad Estatal de Pensilvania.",
    "Candidatos en la contienda para la gobernación de Pensilvania 2022\nJosh Shapiro (demócrata): El fiscal general del estado, quien vive en Abington Township, en las afueras de Filadelfia, es el presunto candidato del Partido Demócrata.",
    "Tres de las organizaciones nacionales más grandes que califican la competitividad de las elecciones estatales han calificado la contienda por el gobernador como un \"sueldo\", lo que significa que sigue siendo una contienda para ganar.",
    "William McSwain (republicano): El exfiscal federal para el este de Pensilvania es un residente de Chester County que se desempeñó como fiscal federal en la región de Filadelfia para el expresidente Trump.",
    "Nche Zama (republicano): Cirujano cardiotorácico de Lehigh Valley, el Dr. Zama emigró a los Estados Unidos con una visa de estudiante y obtuvo una maestría en administración de la Universidad de Harvard.",
    "Melissa Hart (republicana): la excongresista del oeste de Pensilvania sirvió en la Cámara de Representantes de los Estados Unidos de 2001 a 2007 antes de perder la reelección ante un retador demócrata.",
    "Charlie Gerow (Republicano): Como uno de los consultores políticos republicanos de más alto perfil del estado, Gerow ha estado involucrado en campañas políticas estatales y nacionales durante décadas.",
    "Actualmente no enfrenta ningún contendiente en las primarias del 17 de mayo por la nominación de su partido para presentarse a las elecciones generales de noviembre contra el candidato republicano.",
    "John Ventre (republicano): El ejecutivo empresarial del oeste de Pensilvania tiene un lema de campaña de \"Nunca socialista\" y se postula con una plataforma de gobierno cada vez más reducido.",
    "Mientras tanto, los republicanos están tratando de encontrar el oponente adecuado para Shapiro y superar las deficiencias de su partido en el número total de votantes registrados.",
    "Si un republicano gana las elecciones para la gobernación este año, podría significar que el partido controlaría tanto la Legislatura como la mansión del gobernador.",
    "Aquí hay un vistazo a los candidatos que están actualmente en carrera y lo que los votantes necesitan saber con la elección primaria a solo unos meses de que se dé.",
    "Guy Ciarrocchi (republicano): El nativo del sur de Filadelfia ahora se desempeña como director ejecutivo de la Cámara de Comercio e Industria de Chester County.",
    "Scott Martin (republicano): El residente de toda la vida de Lancaster County es un ex comisionado del condado que cumple su primer mandato como senador estatal.",
    "Asistió a las protestas del seis de enero de 2021 en Washington D.C., pero dice que no participó en la insurrección en el Capitolio de los Estados Unidos.",
    "Sin embargo, los votantes independientes aún pueden votar sobre las preguntas de la boleta electoral, de las cuales se espera que haya muchas este año.",
    "Encuestas de la carrera del gobernador de Pensilvania 2022, hasta ahora\nSe han realizado muy pocas encuestas sobre la contienda hasta el 19 de enero.",
    "Comenzó su carrera trabajando para el ex presidente Ronald Reagan después de graduarse de la Facultad de Derecho de la Universidad de Villanova.",
    "Dave White (republicano): el hombre de negocios de Delaware County, justo al sur de Filadelfia, sirvió anteriormente en el consejo del condado.",
    "Decisión Local\nLou Barletta (republicano): exalcalde de Hazleton en el noreste de Pensilvania que luego representó a su región en el Congreso.",
    "Barletta se hizo conocido por sus puntos de vista contra la inmigración y como uno de los primeros partidarios del presidente Donald Trump.",
    "Christina \"Tina\" Olson (Green): la copresidenta del Green Party de Pensilvania vive en Hellertown, en Northampton County, en Lehigh Valley.",
    "Los republicanos actualmente tienen la mayoría de los escaños tanto en la Cámara de Representantes estatal como en el Senado estatal.",
    "Su plataforma incluye mejorar la respuesta al COVID-19 y deshacerse de las regulaciones comerciales estatales.",
    "También propone usar el dinero de los contribuyentes para que las familias paguen escuelas privadas.",
    "Está a favor de la vida, de la elección de escuelas y apoya la producción de energía de Pensilvania.",
    "El último día para registrarse para votar antes de las primarias del 17 de mayo es el dos de mayo.",
    "Para votar por candidatos específicos de un partido, debe registrarse como miembro de ese partido.",
    "Aquí hay una lista de todas las fechas importantes que los votantes deben tener en cuenta en 2022.",
    "También bloqueó con éxito la apertura de un sitio de inyección supervisado en la ciudad.",
    "Propone la contracción radical de la Legislatura de Pensilvania, de 253 miembros a 84.",
    "Jugó fútbol profesional en la Arena Football League y está en contra de la marihuana.",
    "Está a favor de las escuelas autónomas cibernéticas y en contra de la regulación.",
    "Sin embargo, durante 16 de los últimos 20 años, un demócrata ha sido gobernador.",
    "¿Cuándo es la fecha límite para registrarse para votar en las primarias de mayo?",
    "El expresidente Donald Trump aún no ha respaldado a ninguno de los candidatos.",
    "Promete dirigir el estado como un negocio y usar a Chester County como modelo.",
    "Está en contra de la votación por correo y las restricciones de COVID-19.",
    "En Pensilvania, hay 600,000 demócratas registrados más que republicanos.",
    "A menudo chocaba con el fiscal de distrito de la ciudad, Larry Krasner.",
    "Tiene el respaldo del ex entrenador de fútbol profesional Mike Ditka.",
    "El último día para solicitar una boleta por correo es el 10 de mayo.",
    "Una persona sólo puede ser gobernador por dos mandatos seguidos.",
    "Se incluyen enlaces a los sitios web oficiales de sus campañas.",
    "El mandato de un gobernador en Pensilvania es de cuatro años.",
    "¿Cuál es el último día para solicitar una boleta por correo?",
    "¿Cuándo son las elecciones primarias y generales en 2022?",
    "¿Cuánto dura el mandato de un gobernador en Pensilvania?",
    "La elección primaria en Pensilvania es el 17 de mayo.",
    "La elección general es el ocho de noviembre.",
    "Ella es una abogada que nació en Pittsburgh.",
    "Actualmente hay 14 candidatos republicanos.",
    "El cargo electo tiene un término limitado."
  ]
}