{
  "id": 407,
  "mediaId": 8271,
  "date": "2022-02-25",
  "headline": "The engineer in Philly’s deadly 2015 Amtrak crash was found not guilty after 7 years of debate",
  "image": "https://billypenn.com/wp-content/uploads/2022/02/train-derailed-1200x630.jpg",
  "link": "https://billypenn.com/2022/03/04/brandon-bostian-criminal-trial-amtrak-188-crash-philadelphia/",
  "mediaOutlet": "billypenn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Asha Prihar",
  "authorUrl": "https://billypenn.com/about/asha-prihar/",
  "termIds": [
    0
  ],
  "sentences": [
    "Bostian’s yearslong legal saga\nThe issue of whether to hold Bostian criminally responsible has been batted back and forth between courts and potential prosecutors over the years, ultimately landing in the Philadelphia Common Pleas Court this week.",
    "The crash almost immediately sparked discussion over something called “positive train control,” a safety system that forces trains to stay below the speed limit, which some experts said could have prevented the derailment altogether.",
    "But a lawyer for the husband of one of the passengers who died files a private criminal complaint against the engineer, and President Judge Marsha Neifield of the Philadelphia Municipal Court orders criminal charges.",
    "Whether the engineer, Brandon Bostian, should face criminal consequences for his role was a question tossed about the legal system for years, with a string of prosecutors and judges contradicting one another.",
    "PTC eventually went live on Amtrak routes between Washington, D.C. and New York by December 2015, and by August 2020, it was implemented on all Amtrak-owned and -operated tracks throughout the country.",
    "At the start of the trial last week, Bostian rejected a deal that would’ve allowed him to plead “no contest” to nine counts of reckless endangerment in exchange for all other charges being dropped.",
    "What happened on that fatal Tuesday\nAmtrak 188 was carrying 250 passengers and eight employees as it passed through North Philadelphia Station and headed toward Frankford Junction on May 12, 2015.",
    "Nearly seven years after the fatal derailment of an Amtrak train as it rounded a curve in Northeast Philadelphia, the engineer involved has been found not guilty by a jury in Common Pleas Court.",
    "The NTSB concluded Bostian likely lost his “situational awareness” when his radio started buzzing with around two dozen messages about a nearby SEPTA train that was being hit by thrown rocks.",
    "Here’s an overview of the timeline:\nMay 2017: Then-Philadelphia District Attorney Seth Williams decides not to not bring charges against Bostian, saying there’s not enough evidence to do so.",
    "But instead of slowing down, on that day the train sped up, accelerating to upward of 90 miles per hour on the straightaway and screaming along at 106 miles per hour as it entered the curve.",
    "The victims’ lawyers have questioned the NTSB report, dismissing the conclusion that Bostian had lost his bearings as “truly speculation.”\nWhy weren’t safety measures already in place?",
    "Around 120 claims were filed against the service within the year following the crash, and Amtrak later agreed to pay $265 million (the legal limit) in settlements related to the crash.",
    "After fewer than 90 minutes of deliberation on Friday, the jury decided Bostian’s innocence on counts of involuntary manslaughter, reckless endangerment, and causing a catastrophe.",
    "May 2020: Superior Court Judge Victor Stabile overturns the lower court’s decision after another appeal from the AG’s office, stating that fact-finding is still needed.",
    "The system had already been installed on the tracks, but officials said technical problems, budget issues, and bureaucracy prevented it from being operational.",
    "It was the worst crash on the Northeast Corridor since 1987, when 16 people died in a collision between an Amtrak train and two Conrail engines in Baltimore.",
    "In that stretch, the train goes along a straightaway with a speed limit of 70 miles per hour, followed by a curve with a speed limit of 50 miles per hour.",
    "Instead, he decided to move forward with the trial, which held the chance of “more than a lifetime of incarceration,” Judge Barbara McDermott told him.",
    "Eight people died — Justin Zemser, Jim Gaines, Rachel Jacobs, Abid Gilani, Derrick Griffith, Bob Gildersleeve, Giuseppe Piras, and Laura Finamore.",
    "July 2019: Common Pleas Court Judge Barbara McDermott dismisses the charges against Bostian, who was scheduled to go on trial in September 2019.",
    "September 2017: Philadelphia Municipal Court Judge Thomas F. Gehret dismisses the case, saying it was likely an accident rather than criminal.",
    "Federal investigators found no mechanical issues with the train, and noted that Bostian wasn’t drowsy, using substances, or on his cell phone.",
    "The DA’s office recuses itself, instead handing prosecution in the case over to the office of Pennsylvania Attorney General Josh Shapiro.",
    "February-March 2022: Bostian goes on trial in the Court of Common Pleas after rejecting a plea deal, again in front of Judge McDermott.",
    "February 2018: Common Pleas Court Judge Kathryn Streeter Lewis agrees with the AG’s appeal and reinstates the charges against Bostian.",
    "He and his lawyers said a head injury he sustained from the crash prevented him from clearly remembering most of what happened.",
    "Since the derailment, Amtrak has settled with injury victims and instituted a safer braking system on all of its tracks.",
    "After a week-long trial and about an hour and a half of deliberation, the jury finds him not guilty on all counts.",
    "Here’s a recap of what happened before, during, and after the derailment, all leading up to the jury’s decision.",
    "Amtrak also began to add in-cab cameras facing train engineers on some routes in the weeks following the crash.",
    "Bostian eventually hit the emergency brake, but not soon enough to stop the train from running off the tracks.",
    "Some details are still unclear\nThe National Transportation Safety Board spent a year investigating the crash.",
    "Sign up for the free Billy Penn newsletter to get everything you need to know about Philadelphia, every day.",
    "Eight people who’d been heading to New York City died in the wreck, and over 200 were injured.",
    "Following the derailment, Amtrak reckoned with some safety-related measures on its trains.",
    "Six months after the crash, he shared a different account than his original story..",
    "October 2017: Shapiro files an appeal of the dismissal with the Common Pleas Court.",
    "What do we know about the 2015 tragedy, and what’s unfolded in the years since?",
    "The first car crumpled like an accordion, and several others overturned.",
    "Another couple of hundred people were injured, some very seriously.",
    "During the process, engineer Bostian was interviewed several times.",
    "The fallout also had financial consequences for the rail service.",
    "Later, he chose not to take the stand in his own defense.",
    "200 police personnel went to the scene.",
    "That reinstates the charges once again.",
    "Love Philly?"
  ]
}