{
  "id": 4192,
  "mediaId": 8427,
  "date": "2022-01-25",
  "headline": "Matthew J. Brouillette: Counting down to a new direction in Pa.",
  "image": "https://www.timesherald.com/wp-content/uploads/2021/09/timesheraldfall.jpeg",
  "link": "https://www.timesherald.com/2022/01/25/matthew-j-brouillette-counting-down-to-a-new-direction-in-pa/",
  "mediaOutlet": "Roxborough Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew J. Brouillette",
  "authorUrl": "https://www.timesherald.com/author/matthew-brouillette/",
  "termIds": [
    0
  ],
  "sentences": [
    "Democrat Attorney General and gubernatorial candidate Josh Shapiro defended Wolf’s shutdowns in court, targeted the natural gas industry with trumped-up criminal charges, and stands proudly with the government union executives who oppose empowering parents to control their children’s education.",
    "Matthew J. Brouillette is president and CEO of Commonwealth Partners Chamber of Entrepreneurs, an independent, non-partisan organization dedicated to improving the economic environment and educational opportunities in Pennsylvania.",
    "But this election year, we have the chance to reverse Pennsylvania’s decline that Wolf has perpetuated, learn lessons from more attractive states, and create a welcoming climate for people’s lives and livelihoods.",
    "What’s more, under Shapiro’s watch, violent crime in our cities has skyrocketed, with murders hitting a record high in Philadelphia in 2021 — despite Shapiro receiving more ability to protect citizens.",
    "He’s failed all but twice (a $650 million tax hike on things including cigarettes and digital downloads in 2016 and a $113 million tax hike on things including fireworks and online shopping in 2017).",
    "EdChoice Director of National Research Michael McShane writes that in 2021, three states (Indiana, New Hampshire, and West Virginia) created new education savings accounts programs (ESAs).",
    "He vetoed legislation that would have given thousands of students an opportunity to attend a better school, and he tried to cut nearly $230 million in funding from public charter schools.",
    "Let’s choose well, so we don’t have to continue counting down not only the number of economic opportunities but also the number of our kids and grandkids living in Pennsylvania.",
    "Here’s another countdown opportunity: This November, voters have a choice: Will we perpetuate the policies that are driving families, businesses, and jobs out of Pennsylvania?",
    "Whatever Pennsylvania has been doing, it isn’t working, like jobs, our kids, and our future prosperity flee to more economically hospitable states.",
    "In his first budget address, Wolf proposed the biggest tax hike in state history, a jaw-dropping $4.6 billion, or $1,400 per family of four.",
    "And who can forget when he made schoolchildren a political pawn by withholding tax credit scholarships during a state budget impasse?",
    "Wolf has also spent the last seven years fighting against empowering parents to choose the best education options for their children.",
    "Thankfully, Republican lawmakers have pushed back, forcing Wolf’s hand in expanding school choice programs despite his opposition.",
    "Instead, he’s worsened it by pushing policies that hurt families, children, employees, and employers and blocking efforts to help.",
    "Tom Wolf’s eight-year tenure, we’re in the midst of another countdown: the size of Pennsylvania’s congressional delegation.",
    "Under Shapiro, his party didn’t need to defund the police because the attorney general refused to prosecute the crimes.",
    "He failed because Republican lawmakers pulled double duty to advance good policies while blocking Wolf’s harmful ones.",
    "We are losing yet another congressional seat — dropping from 18 to 17 — after a decade of population outmigration.",
    "Last year alone, 11 states enacted laws reducing income tax rates, according to the non-partisan Tax Foundation.",
    "But since taking office, Wolf has targeted the natural gas industry with attempts to double- and triple-tax it.",
    "His Covid restrictions forced 30% of Pennsylvania businesses to close — the second-highest among the 50 states.",
    "It is clear that a Shapiro administration would only be a third term of Wolf’s record of failure.",
    "And two states (Kentucky and Missouri) created first-in-the-nation tax credit-funded ESAs.",
    "Notably, states with the strictest Covid restrictions saw the greatest exodus of people.",
    "Wolf has had over seven years to work with the Legislature to reverse this trend.",
    "But other states have gone much further to help kids and empower parents.",
    "Then there’s Wolf battle against Pennsylvania’s energy potential.",
    "He couldn’t even get any Democrats to vote in favor of his plan.",
    "Job creators have also borne the brunt of Wolf’s governance.",
    "Drawing people back to Pennsylvania won’t happen overnight.",
    "As lawmakers push to establish ESAs in Pennsylvania, Gov.",
    "We are a top natural gas-producing state, behind Texas.",
    "Since then, he’s tried 13 more times to raise taxes.",
    "As Pennsylvanians count down the final year of Gov.",
    "Here, too, the Legislature has blocked him.",
    "Meanwhile, other states are cutting taxes.",
    "www.thecommonwealthpartners.com.",
    "Or will we chart a new course?",
    "Wolf opposes the idea.",
    "Gov."
  ]
}