{
  "id": 4350,
  "mediaId": 2540,
  "date": "2022-01-27",
  "headline": "What to know about the Trump 'fake electors' scheme",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/210106120954-2017-electoral-college-congress-count-1-super-tease.jpg",
  "link": "https://www.cnn.com/2022/01/27/politics/fake-electors-explainer/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marshall Cohen",
  "authorUrl": "https://www.cnn.com/profiles/marshall-cohen",
  "termIds": [
    0
  ],
  "sentences": [
    "Washington (CNN)In the last few weeks, more details about how former President Donald Trump tried to overturn the 2020 election have come to light, specifically about an effort by his campaign to subvert the Electoral College process and install fake GOP electors in seven swing states.",
    "Their plan was to have then-Vice President Mike Pence throw out Biden's authentic electors and replace them with the GOP electors on January 6, while he presided over the joint session of Congress to count the electoral votes.",
    "Deputy Attorney General Lisa Monaco told CNN in an exclusive interview that the Justice Department received the referrals and that \"our prosecutors are looking at those and I can't say anything more on ongoing investigations.\"",
    "Here's a breakdown of what you need to know about the \"fake electors\" plot:\nThis was an attempt by Trump campaign officials, led by Trump's then-attorney Rudy Giuliani, to subvert the Electoral College process.",
    "The Trump campaign lined up supporters to fill elector slots, secured meeting rooms for the fake electors to meet on December 14, 2020, and circulated drafts of fake certificates that they later signed.",
    "But Michigan Attorney General Dana Nessel, a Democrat, has publicly said she is \"confident we have enough evidence to charge\" people under state law for \"forgery of a public record,\" and other crimes.",
    "In a recent article about the situation, The New York Times said some potential crimes could include falsifying voting documents, mail fraud or potentially a conspiracy to defraud the United States.",
    "Trump allies tried to supplant President Joe Biden's authentic electors with fake Republican electors in seven key states, who could've theoretically thrown the entire election to Trump.",
    "It involves arcane laws governing the presidential transition process and a behind-the-scenes effort by Trump's allies to exploit weaknesses in the system so he could remain in office.",
    "The Trump backers met at statehouses, or nearby, and signed certificates that used similar language as the real certificates, proclaiming their votes for President and Vice President.",
    "The fake electors in these states were pawns in a bigger plan -- which Trump supported in public and private -- to overturn the results of the 2020 election and steal a second term.",
    "Legal experts have said that the GOP electors who sent the fake certificates to the National Archives, or anyone who facilitated the plot, could be vulnerable to prosecution.",
    "Unlike the other states, which claimed in the documents to be real electors, the Pennsylvania group said they were electors-in-waiting if Trump's legal challenges prevailed.",
    "According to CNN's reporting, there were multiple planning calls between Trump campaign officials and GOP state operatives, and Giuliani participated in at least one call.",
    "The Electoral College is composed of 538 individual electors -- people from all 50 states and the District of Columbia, who represent the popular vote in each state.",
    "Voters go to the polls in November, but that's only the first step of a convoluted process to formally pick the next president and initiate the transfer of power.",
    "This all played out more than a year ago, but it's still extremely relevant, because both state and federal prosecutors are looking into the matter.",
    "Attorneys general from the seven states with fake electors have said that they're aware of the reports and reviewing the matter under state law.",
    "The pro-Trump group essentially pretended to do all the things that the real electors are required to do, as spelled out in the Constitution.",
    "(In very rare cases, an elector goes \"faithless,\" by voting for someone other than the candidate who won the popular vote in their state.)",
    "Some referred the matter to the Justice Department, because it relates to a federal election, and it happened across several states.",
    "Some have said they did this to preserve all potential legal options for their candidate, no matter how unlikely they were to win.",
    "When a candidate wins a state, their designated slate of electors gets to participate in the Electoral College process.",
    "Pennsylvania Attorney General Josh Shapiro, also a Democrat, said he concluded that charges weren't warranted.",
    "Anyone can type out whatever they want in Microsoft Word, and make it look official with a signing ceremony.",
    "CNN previously reported that Trump allies hoped to gin up coverage on the right-wing OAN network.",
    "CNN reported last week that the scheme was overseen by Trump campaign officials, led by Giuliani.",
    "The GOP electors in the Keystone State used hedged legal language in their fake certificate.",
    "But she also said she'll wait to see the outcome of the federal probe before moving further.",
    "This wasn't something organic that just happened out of nowhere on the state level.",
    "This is a ceremonial process, and the outcome is essentially a foregone conclusion.",
    "Pence refused to go along with the plan, saying that it violated the Constitution.",
    "This group of electors meets in the statehouse at a designated date in December.",
    "Federal prosecutors are typically very tight-lipped about ongoing matters.",
    "They sign certificates, officially casting their vote for president.",
    "A bipartisan array of legal scholars agreed with Pence's reasoning.",
    "Trump allies involved in the scheme have denied wrongdoing.",
    "That's likely the last we'll hear from them for a while.",
    "In plain English, this was an attempted coup of sorts.",
    "But these fake certificates served no legal purpose.",
    "The situation is far from self-explanatory.",
    "But that doesn't make it real.",
    "That's the Electoral College.",
    "Is anyone investigating?",
    "But it was for show.",
    "It was a PR stunt.",
    "It's possible."
  ]
}