{
  "id": 4368,
  "mediaId": 2594,
  "date": "2022-01-27",
  "headline": "Top Pa. Dems to miss Biden visit, cite scheduling conflicts",
  "image": "https://static.independent.co.uk/2022/01/27/20/Biden_88328.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/joe-biden-conor-lamb-democratic-pittsburgh-beto-o-rourke-b2002366.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Via AP news wire",
  "authorUrl": "https://www.independent.co.uk/author/via-ap-news-wire",
  "termIds": [
    0
  ],
  "sentences": [
    "3 House Democrat, refused to say whether vulnerable Democrats on the ballot this fall should embrace the label “Biden Democrat.”\n\"I want every Democrat to run as Democrats who deliver,\" Hoyer said in an interview with Politico when asked directly about “Biden Democrats.”\nFormer Pennsylvania Gov.",
    "And while Fetterman and Shapiro indicated that politics had no bearing on their schedules, their decisions to avoid Biden, particularly in his home state, could fuel further questions among anxious Democratic candidates elsewhere as they decide whether to embrace the struggling president.",
    "“President Biden first announced his infrastructure plan in Pittsburgh, and Conor looks forward to welcoming him back and talking about all the good jobs that bill will create in the Pittsburgh area and all over Pennsylvania,” said Lamb campaign manger Abby Nassif Murphy.",
    "Ed Rendell said he's not surprised that some Democratic candidates might want to distance themselves from Biden, but he said those who do so are “stupid.”\n“They're stupid because things can turn around in politics pretty dramatically,” Rendell told The Associated Press.",
    "Fetterman, the outspoken lieutenant governor whose campaign headquarters is based in Pittsburgh, will miss Biden's visit in that city to attend the Democratic state convention, which begins Friday evening 200 miles to the east, according to spokesperson Joe Calvello.",
    "John Fetterman, a leading Senate candidate, and state Attorney General Josh Shapiro, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their respective spokespeople.",
    "Earlier in the month, Georgia Democrat Stacey Abrams, a leading candidate for governor in another swing state, skipped a chance to appear with the president in the state, citing an unspecified scheduling conflict.",
    "But two of the three leading Democrats on Pennsylvania's statewide ballot this spring who were invited to appear with Biden will not attend, their campaigns confirmed on the eve of the president's appearance.",
    "The high-profile absences come as Democrats in other states have begun taking modest steps to distance themselves from the first-term president, whose approval ratings have fallen sharply in recent months.",
    "“I’m not interested in any national politician — anyone outside of Texas — coming into this state to help decide the outcome of this,” O’Rourke said, according to the Dallas Morning News.",
    "President Joe Biden will appear in Pittsburgh on Friday as an opening step in a broader campaign to promote the White House's achievements in key states ahead of the midterm elections.",
    "Lamb, meanwhile, one of Fetterman’s chief primary opponents in the state’s marquis Senate contest, is eager to hear Biden's remarks on his sweeping infrastructure bill in person.",
    "“Josh Shapiro is running to be the governor of Pennsylvania and he’s focused on the issues that matter to Pennsylvania families,\" Shapiro spokesperson Will Simons said.",
    "“Like every American should, Josh wants our president to be successful and we’ll continue welcoming President Biden to his home state of Pennsylvania,” Simons said.",
    "“I think we all want to make sure that we’re working with, listening to and voting with one another here in Texas.”\nAnd this week, Rep. Steny Hoyer, the No.",
    "Another top Senate candidate, Rep. Conor Lamb a longtime Biden supporter based in Pittsburgh, will attend, his office confirmed.",
    "Last week, Texas Democrat Beto O'Rourke said he didn't need the Democratic president's assistance in his campaign for governor.",
    "And in the weeks since, a handful of high-profile Democrats have seemed to distance themselves from Biden as well.",
    "But the gubernatorial hopeful has a scheduling conflict this time, Simons said, without detailing the conflict.",
    "Shapiro made three appearances with Biden last summer and fall when the president's numbers were better.",
    "Associated Press writer Aamer Madhani in Washington contributed to this report.",
    "People end up thinking less of you for not showing up.\"",
    "Peoples reported from New York.",
    "“You can’t hide.",
    "Lt. Gov."
  ]
}