{
  "id": 4397,
  "mediaId": 8322,
  "date": "2022-01-27",
  "headline": "Republican Governors Association hauls in record $75M last year",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/AP21231022806452.jpg",
  "link": "https://www.foxnews.com/politics/republican-governors-association-2021-fundraising-75m",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    0
  ],
  "sentences": [
    "EXCLUSIVE: The group dedicated to electing Republican gubernatorial candidates and re-electing incumbent governors reports that it set an off-election year fundraising record in 2021 as it builds resources for this November’s elections, when 36 of the 50 states hold gubernatorial contests.",
    "The RGA noted that its record 2021 fundraising allowed it to already make major investments in key 2022 battlegrounds, including TV investments in Michigan and Wisconsin, digital investments in Kansas, Michigan and New Mexico, and supporting its incumbents running for reelection.",
    "FIRST ON FOX NEWS: THE TOP OUTSIDE GROUP BACKING SENATE REPUBLICANS BRINGS IN A RECORD HAUL IN 2021\nThe RGA’s energized in the wake its strong showing in last November’s elections, when Republican businessman Glenn Youngkin defeated former Democratic Gov.",
    "Democratic incumbent governors are running for re-election in all those states, other than the key battleground of Pennsylvania, where the Democrats seem to be coalescing around state Attorney General Josh Shapiro in the race to succeed term-limited Gov.",
    "And RGA executive director Dave Rexrode argued that \"our increased support is proof that Americans are tired of the hypocrisy, record high cost of living increases, and soft on crime approach being seen from Democrat governors.\"",
    "While Republicans lost the White House and the Senate majority in the 2020 election cycle, they took a big bite out of the Democrats' House majority, and they also flipped Montana’s governor’s office from blue to red.",
    "IN WAKE OF VIRGINIA VICTORY, GOP ENERGIZED TO FLIP MORE GOVERNORSHIPS IN NOVEMBER\nThe RGA noted that its cash haul was partially fueled by what it said was a \"significant growth in digital fundraising.\"",
    "Brian Kemp – who's gearing up for a rematch with Democrat Stacey Abrams – first has to fend off a serious primary challenge from former Sen. David Perdue, who's backed by former President Donald Trump.",
    "Looking ahead to this year’s elections, the RGA eyes flipping Democratic-held governorships in eight states -- Kansas, Maine, Michigan, Minnesota, Nevada, New Mexico, Pennsylvania and Wisconsin.",
    "The Republican Governors Association (RGA) raked in $75 million last year across all its fundraising entities, according to figures shared first with Fox News on Thursday.",
    "The RGA highlighted that its 2021 haul topped its previous record of $63 million raised at this point in the 2018 cycle, the last time 36 governorships were up for grabs.",
    "The record-breaking haul last year will ensure our message and our strong conservative positions are delivered to voters in our 36 races,\" Arizona Gov.",
    "The group touted that it tripled its online donations, increasing the number of donors by 350%, and increasing total donations by 550% from 2020.",
    "\"The financial support the RGA has received is indicative of how motivated people are to put more Republicans in governor’s offices in 2022.",
    "Republicans will also be playing plenty of defense in the purple state of Arizona and the blue state of Maryland, where Ducey and Gov.",
    "Now, in the wake of the Virginia pickup this past November, Republicans control 28 of the 50 state governorships.",
    "Youngkin became the first Republican to win a gubernatorial election in Virginia in a dozen years.",
    "Terry McAuliffe of Virginia in a state that President Biden carried by 10 points a year earlier.",
    "Charlie Baker, an anti-Trump Republican, decided against running for a third term this year.",
    "Biden carried all those states – other than Kansas – in the 2020 presidential election.",
    "The RGA edged out the rival Democratic Governors Association (DGA) in 2021 fundraising.",
    "And GOP gubernatorial nominee Jack Ciattarelli nearly upset Democratic Gov.",
    "The DGA on Wednesday reported bringing in a record $73 million last year.",
    "Doug Ducey, the RGA co-chair, told Fox News in a statement.",
    "Phil Murphy of New Jersey in the very blue Garden State.",
    "In the key battleground of Georgia, Republican Gov.",
    "Larry Hogan are term-limited incumbents.",
    "And in Massachusetts, popular GOP Gov.",
    "Tom Wolf."
  ]
}