{
  "id": 4459,
  "mediaId": 2551,
  "date": "2022-01-27",
  "headline": "Democratic candidates say 'scheduling conflicts' will keep them away from Biden visit to Pittsburgh on Friday, as plunging poll numbers make president an election liability",
  "image": "https://i.dailymail.co.uk/1s/2022/01/27/22/53461771-0-image-a-32_1643322115911.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10449621/Democratic-candidates-say-scheduling-issues-away-Biden-visit-Pittsburgh.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rob Crilly",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Rob+Crilly,+Senior+U.S.+Political+Reporter+For+Dailymail.Com",
  "termIds": [
    0
  ],
  "sentences": [
    "+6\nView gallery\nPresident Joe Biden will visit Pittsburgh on Friday, but two high-profile Democratic candidates running in Pennsylvania will not be there - the latest to keep away from a presidential visit\n+6\nView gallery\n+6\nView gallery\nPennsylvania Lieutenant Governor and U.S. Senate candidate John Fetterman said he had a party meeting 200 miles away on Friday, while state Attorney General and gubernatorial candidate Josh Shapiro gave no reason other than a scheduling conflict\n+6\nView gallery\nA Monmouth University Poll this week showed just how far Biden's numbers have dropped\nThe numbers have Republicans licking their lips in anticipation of sweeping gains in Novembers midterm elections - and Democrats apparently avoiding their party's biggest name.",
    "'If state Republicans continue to run on being the last line of defense against President Biden’s failed leadership and promote policies that stimulate the economy and ease the cost of living, make their communities safer, and empower parents to have more control of their children’s educations, they will have a major advantage on the issues in 2022 in battleground states,' an accompanying memo said.",
    "+6\nView gallery\nBeto O'Rourke, carrying Democrats' hope for governor in Texas, made clear he wanted no help from the White House in his campaign\nLast week, Beto O'Rourke, who carries party hopes of turning Texas blue with his campaign for governor, put distance between himself and the White House.",
    "John Fetterman, a leading Senate candidate, and state Attorney General Josh Shapiro, who is likely to win the party nomination for governor, will be absent because of scheduling conflicts, their spokespeople told the Associated Press.",
    "It represents a new strategy to get the president out of Washington, to trumpet victories - such as the bipartisan infrastructure bill - after seeing other legislation killed off by Republican opposition and Democratic infighting.",
    "Fetterman, whose campaign headquarters is in Pittsburgh, told the Associated Press he was already scheduled to attend the Democratic State Committee meeting which begins on Friday evening 200 miles away in Harrisburg.",
    "Two high-profile Democratic candidates in Pennsylvania will skip President Joe Biden's visit to Pittsburgh on Friday, in the latest sign that his dire poll numbers could be disastrous in November's midterm elections.",
    "'He'll highlight the 367,000 manufacturing jobs that our economy has created since he took office, and he'll underscore the vital role the federal government can play in bringing workers and businesses together.'",
    "Both Monmouth University and Harvard CAPS/Harris found that only 39 percent of voters approved of Biden's performance in office, crashing from figures of 54 and 61 percent respectively after he was sworn in.",
    "Earlier this month, Georgia Democrat Stacey Abrams, a leading candidate for governor in another swing state, also claimed a scheduling conflict when Biden came to town to deliver a voting rights speech.",
    "'Biden’s go-to image during the campaign was ‘Joe from Scranton,'\" said Patrick Murray, director of the independent Monmouth University Polling Institute when it unveiled its latest poll this week.",
    "'He'll be talking about how far we've come in getting our economy moving again, making more right here in America, and ensuring all workers benefit,' White House Press Secretary said on Thursday.",
    "'I'm not interested in any national politician - anyone outside of Texas — coming into this state to help decide the outcome of this,' he said, according to The Dallas Morning News.",
    "It is another hint that Biden is seen as a liability by candidates who would otherwise soak up the exposure and fundraising opportunities that accompany a presidential visit.",
    "'Josh Shapiro is running to be the governor of Pennsylvania and he's focused on the issues that matter to Pennsylvania families,' said his spokesman Will Simons.",
    "In an interview with Politico, Steny Hoyer, the third most senior Democrat in the House, would not be drawn on whether candidates should run as 'Biden Democrats.",
    "A poll commissioned by the Republican State Leadership Committee gave GOP candidates a six-point advantage because of Biden's unpopularity, among other factors.",
    "'Like every American should, Josh wants our president to be successful and we'll continue welcoming President Biden to his home state of Pennsylvania,' he said.",
    "And it comes in territory Biden once thought of as his own, playing up his 'Scranton Joe' roots to win over blue collar voters.",
    "But analysts say his tone deaf approach to rising prices during the past year has undermined his appeal to blue-collar voters.",
    "However, one of his opponents in the primary, Rep. Conor Lamb, will be present in Pittsburgh, according to his office.",
    "'I think we all want to make sure that we're working with, listening to and voting with one another here in Texas.'",
    "'It's great that President Biden is coming to Pittsburgh to talk about infrastructure,' he said.",
    "'It's great to come to the city that helped build America to talk about rebuilding America.'",
    "Shapiro appeared with Biden three times last summer (when Biden's numbers were above water).",
    "Biden made much of his early life in Scranton, Pennsylvania, during the 2020 campaign.",
    "But this week, two major polls showed how far the president's support has cratered.",
    "'The public view now is he's lost the connection to those working-class roots.'",
    "'I want every Democrat to run as \"Democrats who deliver,\"' he said.",
    "But Simons offered no further details on the scheduling conflict.",
    "The party's congressional leadership is getting the message.",
    "Her office has yet to explain the nature of the conflict.",
    "Republicans are preparing to strike in down-ballot races.",
    "Biden's visit was announced at the start of the week.",
    "Point to what was done.'",
    "'Point to the record.",
    "Lt. Gov."
  ]
}