{
  "id": 4497,
  "mediaId": 8399,
  "date": "2022-01-14",
  "headline": "Pa. borrowers to see relief after $1.85B settlement with Navient for ‘predatory’ practices",
  "image": "https://media2.fdncms.com/pittsburgh/imager/u/slideshow/20921634/josh-shapiro-governor-pennsylvania.jpg",
  "link": "https://www.pghcitypaper.com/pittsburgh/pa-borrowers-to-see-relief-after-185b-settlement-with-navient-for-predatory-practices/Content?oid=20921629",
  "mediaOutlet": "pghcitypaper.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marley Parish",
  "authorUrl": "https://www.pghcitypaper.com/author/marley-parish",
  "termIds": [
    0
  ],
  "sentences": [
    "“I mean, they’re putting $2 billion up to try and make up for the schemes that they engaged in to rip students off over the course of many years.”\nBorrowers receiving private loan debt cancellation will receive notice from Navient by July 2022, along with refunds of any payments made on the canceled loans after June 30, 2021.",
    "The agreement, announced by a group of state attorneys general on Jan. 13, will deliver $1.7 billion in private student loan cancellation to 66,000 borrowers nationwide and $95 million in restitution payments to 350,000 borrowers placed on certain long-term forbearances.",
    "The settlement marks the end of 39 state probes into claims that Navient, formerly known as Sallie Mae, spent more than a decade steering borrowers into costly, long-term forbearances instead of informing them about more affordable and income-driven repayment options.",
    "And instead of helping them, they ran a multi-billion dollar scam,” Pennsylvania Attorney General Josh Shapiro, who sued Navient in 2017 and co-led the litigation and settlement negotiations with four other states, said during a virtual press conference on Jan. 13.",
    "Navient, one of the country’s largest student loan servicers, has reached a $1.85 billion settlement with a coalition of state attorneys general, including Pennsylvania, to resolve years-long allegations of abusive and predatory practices.",
    "Navient could have provided interest subsidies or helped attain forgiveness of any remaining debt after 20 to 25 years of qualifying payments — or 10 years for borrowers who qualified under the Public Service Loan Forgiveness Program.",
    "Shapiro did not directly answer whether Navient admits any wrongdoing in the settlement, saying that “it doesn’t matter what they admit or don’t admit.”\n“Actions speak louder than words,” Shapiro told reporters.",
    "The loan servicer allegedly originated predatory subprime private loans to students attending for-profit schools with low graduation rates, even though Navient knew borrowers were unlikely to repay the loans.",
    "As part of the agreement, Navient must explain the benefits of income-driven repayment plans and offer estimated income-driven payment amounts before placing borrowers into optional forbearances.",
    "The coalition of state prosecutors said that the accrued interest resulting from Navient’s practices was added to borrowers’ loan balances, sinking them further into debt.",
    "The servicer must train specialists to educate borrowers on alternative repayment options and counsel public service workers about forgiveness programs.",
    "Borrowers qualified for relief should update their studentaid.gov account to ensure that the U.S. Department of Education has their current address.",
    "Approximately 13,000 Pennsylvania borrowers will receive $3.5 million in restitution, and another 2,467 will see $67 million in debt cancellation.",
    "Federal borrowers eligible for a $260 restitution payment will receive a postcard in the mail from the settlement administration this spring.",
    "If the company offered more affordable options, income-driven repayment plans could have reduced payments to as low as $0 per month.",
    "The settlement also includes prohibitions on incentivizing customer service agents for minimizing time counseling borrowers.",
    "“Navient knew that people relied on their loans to make a better life for themselves and for their children.",
    "Marley Parish is a reporter with the Pennsylvania Capital-Star, where this story first appeared."
  ]
}