{
  "id": 4519,
  "mediaId": 2590,
  "date": "2022-01-13",
  "headline": "Major Student Loan Processor Cancels $1.7 Billion In Debt",
  "image": "https://img.huffingtonpost.com/asset/61e05bb2260000f4e63d2a13.jpeg?ops=1778_1000",
  "link": "https://www.huffpost.com/entry/student-loan-processor-navient-cancels-17-billion-debt_n_61e05b23e4b09724bb985fe8",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Robillard",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Navient repeatedly and deliberately put profits ahead of its borrowers — it engaged in deceptive and abusive practices, targeted students who it knew would struggle to pay loans back, and placed an unfair burden on people trying to improve their lives through education,” said Pennsylvania Attorney General Josh Shapiro, a Democrat and one of the attorneys general suing the company.",
    "The lawsuits against Navient began five years ago and focused on charges that Sallie Mae, Navient’s predecessor company, made loans to borrowers it knew were likely to default as well as claims that Navient steered borrowers toward expensive forbearance programs instead of cheaper income-based repayment options.",
    "Andrew Kelly via Reuters\nNavient, one of the nation’s largest student loan processors, will cancel $1.7 billion worth of debt for 66,000 students following an agreement to settle a lawsuit with 39 states and the District of Columbia.",
    "Borrowers who are eligible for relief simply need to make sure the Education Department has up-to-date addresses for them, Shapiro’s office said, and should be notified if they are receiving relief in the spring or early summer.",
    "Navient will also make $95 million worth of restitution payments to 350,000 federal student loan borrowers who were placed in certain long-term forbearance programs.",
    "The company has long managed federal student loans on behalf of the Department of Education, though it is handing those duties off to a different servicer in 2022.",
    "Most of the loans being canceled are “subprime loans” that were given to students attending for-profit colleges, which often had graduation rates below 50%.",
    "Advertisement\nThe $1.7 billion in canceled debt is entirely for private student loans, which are not guaranteed by the federal government.",
    "Another lawsuit against Navient, filed by the federal Consumer Financial Protection Bureau, is still going forward.",
    "That lawsuit alleges that Navient deceived borrowers, forcing them to make higher payments than necessary.",
    "Navient did not admit any fault in the settlement and maintains that it did nothing illegal.",
    "That made it unlikely students would ever be able to pay the loans back.",
    "Advertisement\nA federal court must still approve the settlement.",
    "Navient did not admit to wrongdoing in the settlement."
  ]
}