{
  "id": 4545,
  "mediaId": 2690,
  "date": "2022-01-05",
  "headline": "BOOM! Judge Allows Inspection Of 2020 Dominion Voting Machines",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/boom-judge-allows-inspection-of-2020-dominion-voting-machines-472706/",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The court recognized that it was improper to demand that the county – which owns the machines, and has the responsibility of running the election along with the legislature – can’t determine whether the machines worked properly,” said Phill Kline, director of The Amistad Project.",
    "“As the judge noted, there’s no justification for preventing the county from looking at their own machines.”\nThe inspection had been scheduled for earlier this month but the state Attorney General Josh Shapiro along with the Secretary of State sued to prevent the inspection.",
    "The Amistad Project has been fighting for election integrity since 2018 and now reports it has ongoing litigation “against a shadow government that interfered with the 2020 election.”\nThat “shadow government” has been controlling the Biden regime since Day 1.",
    "(TeaParty.org Exclusive) – Though the left and their mainstream media sycophants have done everything in their power to block any investigation into the 2020 election, there are still freedom-loving Americans who aren’t willing to let it go so easily.",
    "January 10 is shaping up to be a big day:\nPA State Senate investigators will inspect Fulton County's voting machines\nAND\nA WI judge will rule on whether Special Counsel Gableman can compel private testimony from public officials.",
    "“Executive branch officials were trying to stop the inspection altogether, but the judge did not grant their emergency motion to stop the inspection,” explained Amistad Project attorney Tom King.",
    "AG Josh Shapiro is running and given his shady conduct concerning the 2020 election, Pennsylvanians would not be doing themselves any favors by electing him to the state’s highest office.",
    "The Project announced that the Commonwealth Court of Pennsylvania is allowing them and Fulton County to send the county’s Dominion voting machines to the state Senate for inspection.",
    "— Phillip Kline (@PhillDKline) December 28, 2021\nThe 2020 election was rigged using so many different tactics, it’s about time the leftist shenanigans were exposed.",
    "The judge rules that the review must be allowed to go on with a short delay to allow experts from both sides to come up with a formal protocol for the inspection.",
    "“They did not go to court seeking a delay; they sought to stop it, and they lost.”\nThankfully we can still have a little hope in the judicial system in America.",
    "Of course, we all know that the reason they’re fighting so hard to stop these types of investigations is because they know Joe Biden did not legitimately win.",
    "Now the inspection is set for Jan. 10 and it doesn’t seem there will be any way for Shapiro and the state’s Democrats to stop it this time.",
    "The ruling went in favor of the Amistad Project which has been fighting for election integrity before the 2020 election ever happened.",
    "You really have to wonder why on earth leftists are so hell-bent on preventing any kind of closer look into the 2020 election results.",
    "We can only hope that the election machine inspection turns up some kind of tangible proof that the election was rigged.",
    "Now we might be one step closer to uncovering the truth about what happened during the less than fair election.",
    "Whoever thought we’d see the day in America when election integrity would be a two-sided issue?",
    "A judge in a Pennsylvania court has ruled that a county’s voting machines can be inspected.",
    "Phil Kline noted on social media that Jan. 10 is shaping up to be a pretty important day.",
    "Pennsylvanians need to keep this in mind when it comes time to elect a new governor.",
    "If Joe Biden really won, what does it hurt to affirm those results.",
    "What’s sad is that this issue has two sides.",
    "Copyright 2021.",
    "TeaParty.org"
  ]
}