{
  "id": 4612,
  "mediaId": 6571,
  "date": "2022-04-19",
  "headline": "Race for lieutenant governor heats up over endorsement claim",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/01/04/de141d9d-aa09-4c2e-9b38-69a0e1e223ad/thumbnail/1200x630/b013c7ff031d8ef2cd5e4cd69b1e52dc/austin-davis-josh-shapiro.png",
  "link": "https://www.cbsnews.com/pittsburgh/news/pennsylvania-lieutenant-governor-endorsement-claim/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Delano",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Davis, who is Shapiro's choice to be lieutenant governor, says Sims refuses to correct the ad, while Sims says his ad merely notes that he, Sims, endorses Shapiro for governor, not the other way around.",
    "In a television campaign ad for lieutenant governor, state Rep. Brian Sims of Philadelphia posted a picture of Democratic governor candidate Josh Shapiro with the words \"endorsed Josh Shapiro.\"",
    "In September 2001, Jon joined KDKA full time as the Money & Politics Editor and this region's only political analyst who covers national and local issues that affect hometown residents.",
    "I think this is why, quite frankly, people can't stand politicians,\" said state Rep. Austin Davis, a Democratic candidate for lieutenant governor.",
    "HARRISBURG (KDKA) - Attorney General Josh Shapiro has asked a candidate for lieutenant governor to stop using his name and image in a campaign ad.",
    "While Davis would prefer to talk about strategies to combat gun violence, it's the endorsement issue that has stirred up the race.",
    "Sims tells KDKA that Shapiro reached out to him for his endorsement and he looks forward to being Shapiro's running mate.",
    "I can remember very vividly my mother running outside to help, to aid this person while 911 and the ambulance was coming.",
    "Davis is also highlighting his early exposure to gun violence in McKeesport when a young man was shot near him.",
    "Jon Delano\nJon Delano is a familiar face on KDKA, having been the station's political analyst since 1994.",
    "In Pennsylvania, lieutenant governor candidates run in a separate primary from the governor candidates.",
    "But it's Davis, not Sims, that Shapiro has endorsed, and Davis says his own ad will correct the record.",
    "And I remember thinking that no community should have to live with this kind of violence,\" Davis said.",
    "\"He was shot three times on the corner, literally one door down from where my parents and I lived.",
    "Davis calls that misleading and is releasing his own TV ad.",
    "\"Brian's ad is misleading and unethical.",
    "That was a traumatic incident.",
    "Twitter Facebook"
  ]
}