{
  "id": 4639,
  "mediaId": 8254,
  "date": "2022-04-19",
  "headline": "Pennsylvania Governor race: Shapiro & White lead Q1 fundraising",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AP22013582071176.jpg?w=1280",
  "link": "https://www.abc27.com/pennsylvania-governor-election-2022/pennsylvania-governor-race-nearly-30m-raised-shapiro-white-lead-fundraising/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    3926,
    4811,
    4539,
    4946,
    1659,
    2650,
    6208,
    6108,
    6506
  ],
  "sentences": [
    "The candidates will debate for one hour on Wednesday, April 27 at 8 p.m. and will both air and live-stream in 10 markets across Pennsylvania, New York, Ohio, and Maryland, reaching 9.8 million TV and streaming households in every county of the Keystone State.",
    "Shapiro has collected more than $4.5 million in the first three months of the year and his war chest currently sits at $16 million as he prepares for a Republican opponent this fall.",
    "Doug Mastriano and Nche Zama are the only candidates with no singular donations of over $250 from political committees in their financial report from the first quarter.",
    "Corman has spent nearly $1.6 million on television commercials and also paid KA Consulting $86,760 for “general political consulting,” polling, and research.",
    "WHTM abc27 News anchor and Capitol Bureau Reporter Dennis Owens and WPXI Anchor Lisa Sylvester will co-host the debate from the abc27 studio in Harrisburg.",
    "Jake Corman, who temporarily dropped out of the race and re-entered earlier this month, raised nearly $600,000 in the first three months of the year.",
    "Nexstar Media Inc. will host an exclusive multi-market prime time debate between the Republican Party candidates for Governor of Pennsylvania.",
    "HARRISBURG, Pa. (WHTM) – Tens of millions of dollars have been raised by the candidates for Governor of Pennsylvania this election cycle.",
    "William McSwain has the most cash on hand among the Republicans with about $1.7 million and raised the second-most among Republicans.",
    "Democrat Josh Shapiro, who is running unopposed, has $12 million more cash on hand than all nine Republican candidates combined.",
    "According to his financial records, White has spent $3.5 million on television ads and $151,729 on digital media campaigns.",
    "Five candidates (Charlie Gerow, White, Zama, Joe Gale, and Melissa Hart) now have less than $200,000 cash on hand.",
    "Leading the Republicans is Delaware County businessman Dave White, who raised $1.7 million in the first quarter.",
    "White has raised $588,800 in political committee donations over $250, the most among the Republican candidates.",
    "Candidates who have committed to attend include: Lou Barletta, Doug Mastriano, Bill McSwain, and Dave White.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "All candidates on the ballot who meet eligibility criteria will be invited to participate.",
    "He’s loaned the campaign $4 million since Sept. 2021, including $1 million in March 2022.",
    "Each candidate’s individual financial report can be found by clicking their name below.",
    "White has spent a significant portion of that money with only $171,000 still on hand.",
    "Senator from Pennsylvania is scheduled to take place on May 17.",
    "Gale and Hart each have less than $35,000 on hand.",
    "Voters must register to vote by May 2.",
    "The primary election for U.S.",
    "Sign up here."
  ]
}