{
  "id": 4795,
  "mediaId": 2602,
  "date": "2022-04-23",
  "headline": "Jewish organizations are gearing up as midterm elections nears",
  "image": "",
  "link": "https://www.jpost.com/international/article-704915",
  "mediaOutlet": "Jerusalem Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "OMRI NAHMIAS",
  "authorUrl": "https://www.jpost.com/author/omri-nahmias",
  "termIds": [
    3203,
    4466,
    5310,
    5439,
    392,
    280,
    57,
    1126,
    6709
  ],
  "sentences": [
    "AIPAC described five house races as a “key race”: in one case, Democratic primary candidate Steve Irwin was endorsed for an open seat in Pennsylvania’s 12th congressional district, which is considered “solid democratic.” In addition, the group endorsed Don Davis for the primaries of an open seat in North Carolina’s first congressional district, which is considered “lean Democratic.”\nThree other Democrats who received “key race” support are Haley Stevens for Michigan’s 11th district; Valerie Foushee for North Carolina’s fourth district, and Shontel Brown for Ohio’s 11th district.",
    "“RJC is laser-focused on continuing to play a major role in helping the GOP retake majorities in the House and Senate, to fix all the crises caused by the Democrats – from skyrocketing inflation, to rising crime, and fecklessness on the world stage.”\n“In the key battleground state of Florida, RJC is proud to have endorsed Sen. Marco Rubio for reelection in 2022,” Markstein continued.",
    "AIPAC defines a key race as one which “involves a strong supporter of the US-Israel relationship who is opposed by a candidate who is not.”\n“I am proud to report that just four months after launching the AIPAC PAC, we have raised more than $6 million for pro-Israel candidates across the country,” Marilyn Rosenthal, AIPAC’S political action committees director, said in a statement.",
    "“The erosion of Jewish voters’ support for Democrats in Florida – and across the country – bodes very well for Senator Rubio and other Republicans as we work to take back the House and Senate this November.”\nDemocratic Majority for Israel PAC endorsed 35 candidates, including House speaker Nancy Pelosi, House majority leader Steny Hoyer, and Rep. Ritchie Torres.",
    "“Indeed, we can never let the things that divide Americans politically determine whether the United States will support the Jewish state.”\nThe Progressive group J Street slammed AIPAC for its endorsements in a statement on Thursday, saying that 109 of the Republican names on its list voted to overturn the 2020 election results.",
    "“We hope to play a key role in helping to elect candidates like Andy Levin in Michigan, Donna Edwards in Maryland, Jessica Ciseros in Texas, and many more.” The group already contributed nearly $200,000 to the Levin campaign and spent over $125,000 on independent political expenditures on behalf of Cisneros.",
    "We’re proud we chose to support her in 2021 and look forward to continuing doing so.”\nTHE JEWISH Democratic Council of America PAC has endorsed 48 candidates so far this cycle, from Senate majority leader Chuck Schumer’s Senate race to Stacey Abrahams’ gubernatorial race in Georgia.",
    "“In the House, we’re focused on defending our pro-Israel, pro-peace, pro-democracy incumbents, and on supporting principled, progressive challenger candidates who back strong American diplomatic leadership to achieve a better future for both Israelis and Palestinians,” he said.",
    "“JStreetPAC has endorsed the leading Democratic candidates for Senate in nearly every key swing state this cycle, including Georgia, Arizona, Nevada, New Hampshire, North Carolina, Ohio, Colorado and Pennsylvania,” said J Street VP of Communications Logan Bayroff.",
    "The PAC also stated that its support for candidates is “exclusively based on their demonstrated record of voting, leadership and stated positions on the US-Israel relationship.”\n“We proudly stand with those in Washington who stand with Israel,” Rosenthal stated.",
    "We’re proud to support candidates who are both pro-Israel and pro-democracy, and we unequivocally reject the false choice that Jewish voters have to choose between the two.”\nLike DFMI and AIPAC, JDCA PAC supports Shontel Brown in her Ohio-11 race as well.",
    "“The voting trends are undeniable, and incredibly promising for Republicans: in 2020, President Trump received a record-breaking level of support in Florida’s Jewish community– 43%, according to exit polls from the Associated Press/New York Times.",
    "“Now, AIPAC’s support for these 109 candidates threatens to break our democracy as well, directly undermining the shared values which underpin the US-Israel relationship they claim to support.”\nAIPAC responded to the criticism with a tweet.",
    "“Members have delivered millions of dollars in direct contributions to candidates, and the PAC has supported – directly with a PAC check – 326 Democratic and Republican members of Congress and candidates,” the statement reads.",
    "“They are also all competing in races that are crucial to cementing and expanding Democratic majorities in Congress and protecting against Republican legislatures which threaten voting rights and abortion access.",
    "RJC’s current and future endorsees in the 2022 Biden midterms are at the center of the political battlefield, and their races will determine control of both chambers of Congress this November, he said.",
    "“With 22,000 Jewish voters in the district, we knew the Jewish vote would make a critical difference in the outcome of this competitive Democratic primary in support of Rep. Brown,” said Soifer.",
    "“Congresswoman Brown’s defeat of Nina Turner last summer sent an unambiguous message that being pro-Israel is not just wise policy but also good politics,” said DMFI PAC president Mark Mellman.",
    "“In a state that is famous for close elections, and where the Jewish community makes up roughly 3%-4% of the statewide vote, any shift towards the GOP makes a meaningful difference,” he said.",
    "WASHINGTON – With midterm elections less than seven months away, and the primaries season underway, Jewish organizations’ political action committees (PACs) are announcing their endorsements.",
    "Its endorsement list includes 115 House Democrats who are seeking reelection and ten more Senate incumbents, including Maryland Sen. Chris Van Hollen and Georgia Democrat Raphael Warnock.",
    "THE REPUBLICAN Jewish Coalition has endorsed 20 members to date – two senators (Marco Rubio in Florida and Ron Johnson in Wisconsin), 14 members of the House and four House candidates.",
    "In Wisconsin, for example, it supports four primary candidates to run against incumbent Republican Ron Johnson and three candidates to run for an open Senate seat in Pennsylvania.",
    "“As Republicans threaten our democracy, Democrats in the House, Senate and state capitols are providing a critical line of defense,” said Halie Soifer, the organization’s CEO.",
    "“JDCA’s endorsed candidates are all defenders of democracy, supporters of Israel, and aligned with our Jewish and Democratic values on a wide range of issues,” she said.",
    "And while the vast majority of them are incumbents, 10 are candidates who are not currently serving in Congress – all of whom are running for open seats.",
    "AIPAC, the largest group among them, is also the only one that endorsed candidates from both parties – including Democratic and Republican House leaders.",
    "“AIPAC is now fundraising for 109 candidates who threaten our democracy – and they’re doing it in the name of standing up for Israel,” J Street charged.",
    "However, not all incumbents are endorsed by the group, and Senate majority leader Chuck Schumer does not appear on J Street’s list.",
    "Playing partisan politics with Israel’s security risks lives.”\nJ STREET also has its own PAC, supporting 141 candidates overall.",
    "“AIPAC stands with pro-Israel leaders in Congress, Democrats and Republicans, to help ensure these rockets don’t kill Israelis.",
    "“In 2020, RJC made a significant impact in highly competitive races across the country, with RJC PAC raising over $10m.",
    "The PAC continued to support incumbent Shontel Brown after supporting her special election campaign in March 2021.",
    "The group also supports Pennsylvania’s attorney-general Josh Shapiro in his gubernatorial race, and Michigan Gov.",
    "for our endorsed House and Senate candidates,” said Sam Markstein, the coalition’s national political director.",
    "Brown has proven herself an effective legislator and a tenacious advocate for the people of northeast Ohio.",
    "DMFI PAC also backs Rep. Val Demings, who is challenging Marco Rubio for Florida’s Senate seat.",
    "“Confirming that message with another victory in May is vital for our movement,” he said.",
    "“JDCA played a critical role in ensuring her win in 2021 and we’ll do it again in 2022.”",
    "So far, AIPAC’s PAC has thrown its support behind 188 Republicans and 137 Democrats.",
    "Rubio currently leads by 9% according to the Real Clear Politics average.",
    "The group marked Ohio’s 11th congressional district as a key race.",
    "The group also decided to back several challengers.",
    "Gretchen Whitmer.",
    "“Rep."
  ]
}