{
  "id": 482,
  "mediaId": 8254,
  "date": "2022-02-25",
  "headline": "Pa. nurse charged with writing illegal prescriptions, insurance fraud",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/The-Center-for-Holistic-and-Integrative-Mental-Health-athens-nurse-fraud.jpg?w=1280",
  "link": "https://www.abc27.com/news/pennsylvania/pa-nurse-charged-with-writing-illegal-prescriptions-insurance-fraud/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carl Aldinger",
  "authorUrl": "https://www.mytwintiers.com/?post_type=profile&p=873678",
  "termIds": [
    0
  ],
  "sentences": [
    "The criminal complaint also alleged that unlicensed employees of King also provided services to Medicaid patients and billed them under King’s name “as if [King] was the one that rendered the services.”\nThe investigation found that King allegedly falsely billed private insurers more than $300,000 and billed the Commonwealth of Pennsylvania $100,000 “for services below acceptable medical treatment standards.” The AG’s office also alleged that King issued over 3,750 prescriptions to patients while not meeting requirements to write those prescriptions.",
    "She was charged with the following 22 felonies:\nViolation of the Controlled Substance, Drug, Device and Cosmetic Act (3 counts)\nInsurance Fraud (2 counts)\nMedicaid Fraud (6 counts)\nForgery (6 counts)\nTampering with Public Records (2 counts)\nTheft by Deception (3 counts)\nShe was processed and released and granted $75,000 unsecured bail, according to the Magisterial District Court and the Bradford County Jail.",
    "Under Pennsylvania law, nurses are required to collaborate with licensed Pa. physicians in order to diagnose patients and prescribe controlled substances, as well as “provide the expanded treatment functions” of her practice, according to the criminal complaint.",
    "ULSTER, Pa. (WETM) – A Bradford County nurse who allegedly had sexual relationships with patients is facing 22 felony charges for allegedly prescribing more than 3,700 illegal prescriptions and charging private insurers hundreds of thousands of dollars.",
    "Pennsylvania Attorney General Josh Shapiro announced that Stephanie King, Registered Nurse and owner and operator of The Center for Holistic and Integrative Mental Health (CHIMH) was accused of the felony fraud charges.",
    "According to the criminal complaint filed, the relationship continued for several months until she started a sexual relationship with another patient in the spring of 2017.",
    "The AG said that King discontinued his medical care but continued to prescribe controlled substances to him without collaborating with any physicians.",
    "According to the AG, King allegedly entered into a sexual relationship with a patient during his therapy sessions in 2016.",
    "18 News will continue to follow this story and provide details as they become available.",
    "She later allegedly billed a private insurer for their “rendezvous during this time”.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "The full criminal complaint and affidavit can be read below:",
    "Sign up for the abc27 newsletters here."
  ]
}