{
  "id": 4845,
  "mediaId": 8402,
  "date": "2022-04-21",
  "headline": "Shapiro: Dem candidate’s ad wrongly implies endorsement",
  "image": "https://www.philasun.com/wp-content/uploads/2022/04/stateside_04-24-22a.jpg",
  "link": "https://www.philasun.com/stateside/shapiro-dem-candidates-ad-wrongly-implies-endorsement/",
  "mediaOutlet": "philasun.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philadelphia Sun Staff",
  "authorUrl": "https://www.philasun.com/author/donnell/",
  "termIds": [
    3007,
    3270,
    3283,
    3926,
    2609,
    3989,
    1022,
    6506,
    6512
  ],
  "sentences": [
    "Nine Republicans want their party’s nomination for lieutenant governor in the May 17 primary: John Brown, a former elected executive of Northampton County; Jeff Coleman, a former state lawmaker and consultant; Teddy Daniels, a former police officer and Army combat veteran; Carrie Lewis DelRosso, a freshman state lawmaker from suburban Pittsburgh; Russ Diamond, a state lawmaker from Lebanon County; Christopher Frye, the mayor of New Castle; James Jones, who runs an oil and petroleum products trading business; Rick Saccone, a former state lawmaker from the Pittsburgh area; and Clarice Schillinger, a Bucks County political activist.",
    "(AP Photo/Matt Rourke, File)\nASSOCIATED PRESS\nHARRISBURG, Pa. — An ad by one of three people seeking the Democratic nomination for Pennsylvania lieutenant governor this year drew a complaint Friday and a sharply worded letter from the party’s presumed nominee for governor.",
    "By spring 2016, Wolf had responded to complaints about Stack’s treatment of state employees by stripping him of state police protection and limiting cleaning, grounds keeping and maintenance by state employees at Stack’s official residence.",
    "Shapiro took the unusual step earlier this year of endorsing and running with state Rep. Austin Davis of Allegheny County, even though in Pennsylvania candidates for governor and lieutenant governor are not paired on the primary ballot.",
    "An ad by Rep. Brian Sims seeking the Democratic nomination for Pennsylvania lieutenant governor this year drew a complaint Friday, April 15, 2022 and a sharply worded letter from Josh Shapiro, the party’s presumed nominee for governor.",
    "Stack’s office later said his wife had entered treatment for an undisclosed mental health issue, and Stack lost a multicandidate primary in 2018 to the current lieutenant governor, John Fetterman.",
    "It said Shapiro’s campaign has included Sims’ backing in a public list of endorsements, but a Shapiro campaign spokesperson said he was unaware of any public use of Sims’ endorsement.",
    "So, when the Shapiro camp noticed “ENDORSED JOSH SHAPIRO,” along with a check-marked ribbon, appeared at the end of Sims’ new statewide ad, lawyers fired off a cease-and-desist order.",
    "“Not only does the ad mislead voters, it also places Attorney General Shapiro in a false light,” argued Courtney Weisman, a lawyer for Shapiro, in the letter sent Friday.",
    "The dispute pits Attorney General Josh Shapiro against state Rep. Brian Sims over Sims’ ad that the Shapiro campaign says falsely implies Shapiro has endorsed Sims.",
    "Sims was proud to endorse Shapiro then and has continued to promote and endorse Shapiro for Governor while on the campaign trail,” the campaign statement said.",
    "ABOVE PHOTO: Pennsylvania Attorney General Josh Shapiro speaks with members of the media during a news conference, in Philadelphia, Tuesday, March 15, 2022.",
    "Because they run separately in the primary but as a ticket in the fall, governors and lieutenant governors can essentially end up in a forced relationship.",
    "The Shapiro team had asked Sims to endorse Shapiro before the campaign began, Sims’ campaign said in a statement to The Associated Press.",
    "The current governor, Democrat Tom Wolf, was elected with former state Sen. Mike Stack of Philadelphia in 2014.",
    "The ad began running on streaming services in markets around Pennsylvania this week, Sims’ spokesperson said.",
    "Shapiro is the only candidate for governor in the Democratic primary this year.",
    "Some have worked together productively but others have struggled.",
    "She said Sims’ wording was designed to mislead Pennsylvanians.",
    "“Rep."
  ]
}