{
  "id": 5066,
  "mediaId": 8489,
  "date": "2022-04-24",
  "headline": "What you need to know ahead of the 2022 Pa. primary election",
  "image": "https://whyy.org/wp-content/uploads/2020/06/phillyvoters-primaryelection-pollingplace-crop.jpg",
  "link": "https://whyy.org/articles/pa-primary-election-2022-voter-guide-deadlines/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maria Pulcinella",
  "authorUrl": "https://whyy.org/person/maria-pulcinella/",
  "termIds": [
    5254,
    5862,
    4811,
    3926,
    2802,
    1659,
    6512,
    6506
  ],
  "sentences": [
    "Voters who choose to vote by mail should submit their application as soon as possible to allow enough time for their ballot to be mailed to them, then returned to their county election office in time to be counted.",
    "Deadline to register to vote: Monday, May 2\nDeadline to apply for a mail or absentee ballot: 5 p.m. Tuesday, May 10\nDeadline to return mail or absentee ballot: 8 p.m. Tuesday, May 17\nCan I still register to vote?",
    "Anyone can register to vote, so long as they will have been a U.S. citizen for at least 30 days before the election, are a resident of Pennsylvania, and are going to be at least 18 on or before Election Day.",
    "Voters can opt for an all-in-one visit to their county election office, where they can apply for a mail ballot, have an election official verify their eligibility, and cast their ballot.",
    "If ballots are available, voters can apply for a mail or absentee ballot at their county election board or another designated location and cast their ballot in the same visit.",
    "Regardless of party affiliation, all registered voters in the 5th Senatorial District can vote in that district’s special election, which coincides with the primary on May 17.",
    "The special election will determine who will replace former City Councilmember Bobby Henon, who resigned after being convicted of federal corruption and bribery charges.",
    "It’s still a little early for drop box location information, but once known, the drop-off locations for Bucks, Chesco, Delco, Montco, and Philly can be found online.",
    "Pennsylvania has a closed primary system, which means that only Democrats and Republicans can vote for their party’s nominees to run in the Nov. 8 general election.",
    "John Fetterman, State Rep. Malcolm Kenyatta, and U.S. Rep. Conor Lamb are among those fighting to be the Democratic nominee for Pennsylvania’s U.S. Senate seat.",
    "Calling McSwain a ‘coward’ for failing to act on Trump’s claim of ‘massive fraud’ in the 2020 presidential election, the ex-president rejects an endorsement.",
    "If there isn’t enough time to mail the ballot, voters can drop it off in person at their county elections office or, if available, at a county drop box.",
    "Pennsylvanians who would prefer to vote the old-fashioned way can do so in person on Election Day at the polls, which will be open from 7 a.m. to 8 p.m.",
    "Voters who request a mail ballot but don’t receive it, or don’t have it to surrender, may vote by provisional ballot at their polling place.",
    "In a wild day where Trump denied candidate Bill McSwain an endorsement in the GOP primary race, Jake Corman will stay in at Trump’s request.",
    "Voters are encouraged to check their county’s website or call their county election office to see if ballots are finalized and available.",
    "That includes re-election races for every congressional member who represents Southeastern Pennsylvania’s seven U.S. House districts.",
    "The provisional ballot will be reviewed by the county board of elections post-Election Day to determine whether it will be counted.",
    "People who are serving time for lesser charges or are out on probation, parole, or house arrest are eligible.",
    "After they surrender their ballot and envelope and sign a declaration, they can vote using a regular ballot.",
    "Two massive races on the ballot include those for Pennsylvania governor and the state’s U.S. Senate seat.",
    "In the gubernatorial race, Pennsylvania Attorney General Josh Shapiro is the lone Democrat on the ballot.",
    "Outside of the governor and U.S. Senate races, voters will choose the state’s next lieutenant governor.",
    "Nine Republicans are vying for that party’s nomination to face Shapiro in November’s general election.",
    "On the Republican side are seven candidates, including Jeff Bartos, David McCormick, and Mehmet Oz.",
    "However, People who don’t belong to the two major parties can still vote on local ballot questions.",
    "For those who choose to vote by mail, counties are providing secure drop box locations for ballots.",
    "To do so, voters must bring their ballot and the pre-addressed outer return envelope to be voided.",
    "Completed mail ballots must be received by county boards of elections by 8 p.m. on Election Day.",
    "The two top-polling candidates are former U.S. Rep. Lou Barletta and state Sen. Doug Mastriano.",
    "The deadline for Pennsylvanians to register to vote for the primary election is Monday, May 2.",
    "Voters who receive an absentee or mail ballot can opt to vote in person on Election Day.",
    "Pennsylvania’s primary election is fast approaching, as are election-related deadlines.",
    "Voters will also choose representatives across Pennsylvania’s 17 U.S. House districts.",
    "What if I received an absentee or mail ballot but want to vote in person?",
    "Pennsylvanians can also vote early in person by mail ballot until May 10.",
    "Pennsylvanians can find out whether they are registered to vote online.",
    "Here’s what you should know ahead of Election Day on Tuesday, May 17.",
    "The deadline to request a mail or absentee ballot is Tuesday, May 10.",
    "People who are incarcerated for felonies can’t vote under state law.",
    "Registered Pennsylvania voters may choose to vote early in person.",
    "Spotlight PA breaks down that crowded, if overlooked, race here.",
    "Both races will have enormous implications for Pennsylvanians.",
    "What happens if I request a mail ballot and don’t receive it?",
    "2 weeks ago\nCan I still apply for a mail or absentee ballot?",
    "Below are deadlines specific to voting in the May primary.",
    "Voters can look up a sample ballot based on their address.",
    "Jump to a section\nWhat are the deadlines I need to know?",
    "The last day to vote early in person is Tuesday, May 10.",
    "How will I know if my mail ballot was processed?",
    "Voters can find their polling place online.",
    "Voters can find their polling place online.",
    "Where can I drop off my mail ballot?",
    "When must mail ballots be received?",
    "What does a ‘closed primary’ mean?",
    "What if I want to vote in person?",
    "What else is on the ballot?",
    "Can I vote early in person?",
    "Where is my polling place?",
    "Who can register to vote?",
    "Postmarks do not count.",
    "Voter info & resources",
    "Who is on the ballot?",
    "Lt. Gov."
  ]
}