{
  "id": 528,
  "mediaId": 8270,
  "date": "2022-02-26",
  "headline": "Ciarrocchi takes aim at Pa. 6th Congressional seat held by Houlahan",
  "image": "https://www.readingeagle.com/wp-content/uploads/2022/02/Guy-3.jpg?w=1024&h=682",
  "link": "https://www.readingeagle.com/2022/02/26/ciarrocchi-takes-aim-at-houlahans-seat/",
  "mediaOutlet": "berksmontnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fran Maye",
  "authorUrl": "https://www.readingeagle.com/author/fran-maye/",
  "termIds": [
    0
  ],
  "sentences": [
    "“When I first decided to run (for governor), my concern was that the candidates weren’t talking about small business, weren’t talking about the kids, weren’t talking about mandate relief, and now most of them are,” Ciarrocchi said Friday night on his way to a campaign kickoff fundraiser in Downingtown.",
    "I felt as though my work was done there, but the fight for those things goes on.”\nThe 6th Congressional District will stay largely unchanged following a Pennsylvania Supreme Court decision last week on a new map of congressional districts.",
    "WEST CHESTER — Guy Ciarrocchi, who last week dropped his bid to become the Republican nominee for Pennsylvania governor, has filed to run in the 6th Congressional District, a seat currently held by second-term Democrat Chrissy Houlahan.",
    "Sure, a lot of other things are important, but if the economy is not moving and kids are not in school, all the other issues are secondary.”\nCiarrocchi said his campaign will focus on the economy, education and the size of government.",
    "“I have never heard her (Houlahan) speak out and object to anything being done, not through the lockdown, not the mandates, not the masking, not though paying people not to work and stay home,” Ciarrocchi said.",
    "“I was one of the first chamber presidents in the state and one of the first in this community to say government is hurting business and harming our kids, and we need to correct that,” Ciarrocchi said.",
    "“I would like to take the same message to Congress and make sure we have an opportunity to change members of Congress because the economy is too important for us not to fight for.",
    "The GOP candidates are competing for the nomination to take on presumed Democratic Party nominee and two-term state Attorney General Josh Shapiro in November’s general election.",
    "Though Ciarrocchi’s bid for governor was brief, he gained an advantage over other candidates with his message of getting people back to work and championing small businesses.",
    "Government has grown too big and too powerful, and we need to fight back.”\nIn making his announcement public Friday night, Ciarrocchi took aim at Houlahan’s voting record.",
    "Ciarrocchi will be running against businessman Steve Fanelli, Realtor Ron Vogel and businesswoman Regina Mauro for the Republican nomination in the May 17 primary.",
    "The economy is issue one and education is the other.”\nThe 6th District includes all of Chester County and parts of Berks County, including the City of Reading.",
    "“Everyone who is buying gas and everybody who is grocery shopping — this is because of decisions are being made by the president and governors and Congress.",
    "“The issues that I care deeply about are now at center stage at the governor’s race, but not at center stage in this race for Congress,” Ciarrocchi said.",
    "Position sought: U.S. representative for the 6th District, which includes all of Chester County and parts of Berks County, including the City of Reading.",
    "I will not sit by and let that happen.”\nCiarrocchi said if elected, he will not vote around party lines, rather will make decisions based on the issues.",
    "Ciarrocchi, 57, who previously served as president and CEO of the Chester County Chamber of Commerce and was a top official in former Gov.",
    "Tom Corbett’s administration, as the director of public affairs for the Archdiocese of Philadelphia and as a township supervisor.",
    "“Chrissy Houlahan has yet to raise one objection to anything that Joe Biden, Tom Wolf or Nancy Pelosi have done.",
    "“We need to get the economy back up and running and parents have to be welcomed back at school board meetings.",
    "Tom Corbett’s administration, left a crowded Republican field of more than a dozen hopefuls for governor.",
    "Background: Ciarrocchi previously served as president and CEO of the Chester County Chamber of Commerce.",
    "In a field of 15 people and everyone is saying the same thing, many of those people share my thoughts.",
    "U.S. representatives serve a two-year term and receive an annual salary of $174,000.",
    "“We are watching the challenges of the economy right before our eyes,” he said.",
    "Of 15 Republican hopefuls, Ciarrocchi raised the fifth-highest amount of money.",
    "Meet the candidate\nCandidate: Guy Ciarrocchi, 57, Chester County.",
    "We are too far in debt, and we need to correct this.",
    "He has also served as a top official in former Gov.",
    "Current salary for position: $174,000.",
    "Website: OurGuyForCongress.com",
    "“Now, almost all of them are."
  ]
}