{
  "id": 6192,
  "mediaId": 2658,
  "date": "2022-04-11",
  "headline": "Biden’s solution to the politics of rising crime: Focus on guns",
  "image": "https://static.politico.com/55/aa/c52092c54bff85c490e772ec045c/20220411-biden-ap-773.jpg",
  "link": "https://www.politico.com/news/2022/04/11/biden-guns-crime-00024593",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2932,
    4747,
    4767,
    4905,
    392
  ],
  "sentences": [
    "“If we’re worried about whether or not Democrats just rented the suburbs, or if we’ve made real substantial progress, if those are sort of top political concerns for Democrats, they need to look at gun safety, gun violence prevention, taking on the gun lobby as core parts of the strategy in advance of the midterms.”\nBiden’s ghost gun rule, which requires new background checks and serial numbers, was unveiled alongside his new pick to lead the Bureau of Alcohol, Tobacco, Firearms and Explosives.",
    "Republicans have blamed Biden for the increase in crime in the U.S. — though crime report data compiled by center-left sources shows murder rates were higher in Republican-run states than Democratic ones in 2020 — and have sought to label him as “soft on crime” ahead of the midterms, which could flip control of one or both congressional chambers to the GOP.",
    "White House officials also defend the president’s use of his platform, to date, to amplify the gun violence epidemic, citing his calls for Congress to act in his State of the Union address and his trip to New York City earlier this year highlighting efforts to fund police departments and community violence intervention programs in schools and hospitals.",
    "“There’s been nothing for the base to latch on to for the last year, nothing to ignite the base or get them excited, at least on gun violence, which we know remains a major priority for Democrats and independents.”\nYahya said the “number one priority” moving forward is to push the White House to name a director for gun violence prevention.",
    "Jim Pasco, executive director of the Fraternal Order of Police, described ghost guns as a “huge public safety threat.”\n“The fact that these guns are untraceable means that the perpetrators continue to inflict further damage even after they’ve dropped those ghost guns,” Pasco said on the sidelines of the White House event.",
    "Zeenat Yahya, policy director for March For Our Lives, an advocacy group founded after the mass shooting at a 2018 shooting in Parkland, Fla., said that Democrats “are missing a major opportunity.”\n“This is the first major action the president has taken since last spring,” said Yahya, who attended Monday’s event.",
    "The White House has no plans, according to a person familiar with the administration’s thinking, to tinker with its messaging around gun violence and believes that Biden’s actions — from the ghost gun rule to pushing for increased funding for police and violence prevention programs — will resonate with voters.",
    "Speaking from the Rose Garden, Biden held up a so-called ghost gun kit, displaying what law enforcement and lawmakers have labeled as the new weapon of choice for criminals because of its lack of a serial number and its ability to be purchased without buyers undergoing a background check.",
    "Some 63 percent backed Biden’s executive action to regulate ghost guns when he first announced the step last year, according to a Morning Consult survey; an overwhelming majority of Americans are in favor of expanded or universal background checks, too, according to the same pollster.",
    "Though Democrats and advocates are pushing for continued executive action on guns — aware of the roadblocks in an evenly divided Senate where the vast majority of Republicans oppose expanded background checks legislation — they praised the finalized ghost gun regulation on Monday.",
    "| Carolyn Kaster/AP Photo\nBy Laura Barrón-López\n 04/11/2022 09:58 PM EDT\nWith big cities seeing spikes in crime and Republicans making it an election year issue, President Joe Biden on Monday sought to recast guns — specifically, untraceable ones — as a root cause of the problem.",
    "The policies, largely popular with the Democratic base and key segments of the electorate, could eventually improve the president’s approval rating on crime without a change to messaging strategy, said the person familiar with the White House’s thinking.",
    "But Democrats and gun safety advocates see a renewed focus on gun control as a potential midterm boon, arguing that it is antiquated to believe that the topic riles up conservatives and not Democrats or independents too.",
    "“Is it extreme to protect police officers, extreme to protect our children, extreme to keep guns out of the hands of people who couldn’t even pass a background check?” Biden said from the Rose Garden, his voice rising.",
    "In a recent interview, Stephanie Feldman, deputy assistant to the president and senior adviser to the director of the Domestic Policy Council, said such an appointee would not speed up White House actions on the issue.",
    "“It’s long overdue.”\nPennsylvania Attorney General Josh Shapiro, who also attended the White House announcement, said Philadelphia had seen a nearly 500 percent increase in recovered ghost guns in the past two years.",
    "Not our government, but people who are elected.”\nUnderscoring the White House’s internal belief that policy could help create a useful and salient contrast on the issue of crime prevention was the president himself.",
    "“We can’t wait that long for the next major White House announcement on gun violence prevention.”\nThe White House has said it doesn’t need a director to oversee a new interagency task force on gun violence.",
    "Biden on Monday challenged Republican opponents to his ghost gun rule, which imposes new background checks, requires serial numbers on gun-kit components and cracks down on online sales of such firearms.",
    "“Democrats are on the defensive on violent crime, but they have a built-in trust advantage on gun violence prevention policies,” said Peter Ambler, executive director for the gun safety group Giffords.",
    "The president spoke to an audience of White House and Justice Department staff, gun violence survivors, parents whose children were killed in mass shootings, and law enforcement officials.",
    "They’ve also called on Biden to introduce more executive actions on gun control and to name a gun violence prevention czar to oversee the administration’s response to the epidemic.",
    "Though voters have poor perceptions of the job Biden is doing to address violent crime, polls consistently show that the majority support a number of Democratic proposals.",
    "The president would “love to be having an event in the Rose Garden today signing legislation into law,” Psaki told reporters on Monday about universal background checks.",
    "The ATF hasn’t had a permanent director since 2015, and the confirmation process for Biden’s second nominee, Steve Dettelbach, is sure to draw Republican opposition.",
    "Some gun safety advocates are skeptical, however, noting that the Biden White House has not previously sustained momentum or interest behind a push for gun control.",
    "Biden’s policy push on guns comes as he continues to fight the Republican-fed perception that the Democratic Party is invested in lowering budgets for local police.",
    "President Joe Biden speaks in the Rose Garden of the White House on April 11 to announce a final version of his administration's ghost gun rule.",
    "It was an effort to put some political muscle behind a finalized ghost gun rule that has been praised by advocates and law enforcement alike.",
    "The president has long been an ally of law enforcement despite receiving less support from major police unions during his presidential bid.",
    "Pressed on why Biden’s proposals score well but his handling of crime doesn’t, White House press secretary Jen Psaki pointed to Congress.",
    "It doesn’t make a lot of sense except for the hold the NRA still seems to have over components of government at this point in time.",
    "White House officials noted that two of the three network morning shows produced segments on the Rose Garden event on gun violence.",
    "More broadly, it was an attempt by Biden to regain his footing on a political front that is currently bedeviling him and Democrats.",
    "Key to cracking down on gun violence, they say, is an ATF director who supports enforcing and expanding background checks.",
    "Both had been long in the offing, with gun advocates and fellow Democrats applying pressure for faster action for months.",
    "Only 38 percent of voters approve of the president’s handling of crime, according to a new ABC-Ipsos poll.",
    "And emphasizing his support for larger police budgets is a core part of the White House’s strategy.",
    "And they raise the prospect of gun policy taking a more central role during the midterm elections.",
    "But the administration thinks that Biden’s policy proposals are a key political component, too.",
    "“These are the weapons of choice for criminals, and we need to get them out of their hands.”",
    "“This loophole has cost our commonwealth too many lives,” Shapiro said in an interview.",
    "He pushed for increased police funding both during his campaign and once in office.",
    "“It took over 200 days to name this [ATF] nominee,” she said.",
    "Law enforcement officials also applauded the regulation.",
    "“It’s hugely popular."
  ]
}