{
  "id": 6392,
  "mediaId": 8254,
  "date": "2022-04-11",
  "headline": "Pa. gun owners, state officials react to new federal ‘ghost gun’ rule",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/04/AP22101712681483.jpg?w=1280",
  "link": "https://www.abc27.com/news/local/pa-gun-owners-state-officials-react-to-new-federal-ghost-gun-rule/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Schad",
  "authorUrl": "https://www.abc27.com/author/ben-schad/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The individual was a prohibited purchaser, so didn’t have to submit to a background check, bought these guns, brought them back to Philadelphia, then assembled them in a rowhome and then the act of selling them, that was the criminal act,” Shapiro said.",
    "“It’s long past time for gun violence reduction to be prioritized at the federal level—I’m grateful that President Biden shares my concern for this issue and is working to protect our nation from further unnecessary loss,” said Gov.",
    "“When they show up at a crime scene they can’t be traced, harder to find to prove who used them, meaning you can’t connect the gun to the shooter and hold them accountable,” said President Joe Biden.",
    "“Is it extreme to protect police officers, extreme to protect our children, extreme to keep guns out of the hands of people who couldn’t even pass a background check?” Biden said.",
    "“The ATF reports that they’ve been able to trace less than one percent, less than one percent of ghost guns reported by law enforcement,” Biden said.",
    "Now, the U.S. Department of Justice is making it illegal for a business to manufacture one of these make-your-own gun kits without a serial number.",
    "LOWER PAXTON TOWNSHIP, Pa. (WHTM) — President Biden announced a new rule targeting so-called ghost guns, homemade guns without serial numbers.",
    "Attorney General Josh Shapiro points to a bust in the Kensington area where someone left a gun show with duffle bags of gun kits.",
    "Shapiro said there has been a 489% increase in just the last two years in ghost gun recoveries in the City of Philadelphia.",
    "Gun control advocates say this is a major step in reducing shootings, but many gun owners say it’s unconstitutional.",
    "“There is absolutely no reason for unserialized guns to be in our communities, carried by unvetted individuals.",
    "The new rule is supposed to take effect sometime this summer but it most certainly will be challenged in court.",
    "Biden said last year alone, law enforcement reported approximately 20,000 suspected ghost guns to the ATF.",
    "And if a business buys a ghost gun from someone, they’ll have to stamp it with a serial number.",
    "Joseph Staudt runs a gun shop that doesn’t sell these kits but has no issue with them.",
    "The Constitution does allow for individuals to build their own firearm,” Staudt said.",
    "If sold as separate parts, they were not required to have a traceable serial number.",
    "The issue of so-called ghost guns has become more problematic in the past few years.",
    "Ghost guns are basically build-your-own gun kits or 80 percenters as they’re known.",
    "There have been reports of ghost guns confiscated by police in Harrisburg and York.",
    "“The founding fathers gave us the constitutional right to keep and bear arms.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "The new rule would require dealers to run background checks on customers.",
    "Ghost guns have become the weapon of choice for criminals,” Shapiro said.",
    "“The term ghost gun is a term that’s used to try to make it sound scary.",
    "So I would say any gun control is infringement,” Staudt said.",
    "This final rule on ghost guns today is just common sense.”",
    "Sign up for the abc27 newsletters here.",
    "Staudt thinks it’s unconstitutional.",
    "“It’s necessary now more than ever.",
    "The NRA calls the new rule extreme.",
    "And I’m for that.",
    "Tom Wolf."
  ]
}