{
  "id": 6413,
  "mediaId": 8489,
  "date": "2022-04-12",
  "headline": "Pa. Elections: Political Roundtable",
  "image": "https://whyy.org/wp-content/uploads/2022/04/AP22092680012900.jpg",
  "link": "https://whyy.org/episodes/pa-elections-political-roundtable/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4549,
    3926,
    839,
    1126,
    1022,
    1489,
    6506
  ],
  "sentences": [
    "Guests:\nJohn Baer, Columnist for Patriot News/Pennlive\nChris Borick, Professor of Political Science and Director of the Muhlenberg College Institute of Public Opinion\nKatie Meyer, political reporter for WHYY News\nBrought to you by Radio Times\nWHYY's Radio Times is an engaging and timely call-in program that tackles wide-ranging issues of concern to listeners in the Delaware Valley.",
    "On this episode of Radio Times, we’ll talk Pennsylvania politics and the primary election: the candidates, the endorsements, the fundraising and where they land when it comes to the issues most important to their Democratic and Republican voters.",
    "3 weeks ago\nThe proposals directly oppose the wishes of advocates who have for years pushed to remove elected officials from the process and give the power to average Pennsylvanians.",
    "In the race for governor, Democrats across the Keystone State are hoping to keep their party in office with the election of lone candidate Pennsylvania Attorney General Josh Shapiro.",
    "Subscribe for free\nFrom the millionaires to the candidates just collecting a paycheck, a look at the earnings disclosures of Dems and Republicans running for U.S. Senate.",
    "4 weeks ago\nUntil Wednesday, Oz said he’d keep his dual citizenship so he has legal power in Turkey to make health care decisions for his Alzheimer’s-stricken mother.",
    "Senator Pat Toomey’s retirement after more than a decade is leaving an open seat that could ultimately determine which party wins majority in the Senate next year.",
    "On the GOP side, it’s a crowded field of candidates and no clear frontrunner, with recent polls showing almost half of registered Republican voters as undecided.",
    "Pennsylvanians will head to the polls May 17th for what is being called one of the most consequential primary elections in the country.",
    "1 month ago"
  ]
}