{
  "id": 6465,
  "mediaId": 8503,
  "date": "2022-04-14",
  "headline": "Doug Mastriano could ride 2020 election denial into the PA governor's mansion",
  "image": "https://www.gannett-cdn.com/presto/2020/10/30/PPYR/c217831e-3c0f-456b-9721-6377384045a0-HES-DR-103020-don-13.jpg?crop=4070,2290,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.ydr.com/story/news/politics/2022/04/14/pa-governors-race-doug-mastriano-leading-election-denier/65349168007/",
  "mediaOutlet": "ydr.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4345,
    4539,
    5207,
    5208,
    4905,
    2765,
    3926,
    2911,
    1126,
    6506
  ],
  "sentences": [
    "Steve Bannon spoke to the crowd virtually and made false claims that Pennsylvania’s election was unconstitutional and “stolen.”\nLong before Mastriano launched his bid for higher office, he repeated unproven claims about the 2020 presidential election and held an investigatory hearing without sworn testimony.",
    "Mastriano has pushed for an Arizona-style audit in Pennsylvania and kicked off his gubernatorial campaign in January with former Army Gen. Michael Flynn, who peddled unproven conspiracy theories that voting machines were hacked by the Chinese government to make Trump lose.",
    "Then he organized a trip to the Capitol\nHe organized buses and attended the “Save America” rally for former President Donald Trump on Jan. 6, 2021, that preceded the violent attack on the U.S. Capitol, but Mastriano has condemned the violence that occurred that day.",
    "Mastriano and his supporters, including My Pillow founder Mike Lindell, have repeatedly made the false claim that the number of votes counted in the 2020 Pennsylvania presidential election exceeded the number of registered voters in the state.",
    "The state senator held a campaign event in Gettysburg last month and called it a “voter integrity conference,” where attendees signed a petition upon entering the venue that would decertify Pennsylvania’s 2020 election results.",
    "Mastriano leads GOP candidates among rural voters who are typically in the 50-64 age range, according to polls, but former Congressman Lou Barletta leads in all other age groups and among suburban and urban voters.",
    "Mastriano recently released a campaign platform that focuses on \"election integrity,\" rolling back COVID-19 mandates, banning critical race theory in schools, cutting taxes and slashing state bureaucracy.",
    "He generally ignores or refuses interview requests with mainstream media and hasn’t taken questions from the USA TODAY Network Pennsylvania Capital Bureau about his actions, efforts or candidacy.",
    "President Joe Biden won Pennsylvania by more than 80,000 votes in the same 2020 election in which Republicans did well, picking up statewide seats for treasurer, auditor general and House seats.",
    "AP reporters contacted election officials in all 67 counties in Pennsylvania, and 11 of those officials counted a combined 26 cases of fraud, which represent 0.03% of Biden’s margin of victory.",
    "His supporters love him for it, but critics say his base of supporters won’t help him carry the suburban and urban voters he will need to win a general election against Democrat Josh Shapiro.",
    "The Associated Press reviewed every potential case of voter fraud in six battleground states and determined the numbers wouldn’t have changed the outcome of the election.",
    "Mastriano, 58, has portrayed himself as a martyr in Pennsylvania, fighting for true “patriots” and anyone who stands up to the political establishment.",
    "The fraud claim has been categorically debunked and rejected by courts, which said the Trump campaign failed to produce evidence of widespread fraud.",
    "County election officials identified 26 possible cases of voter fraud in Pennsylvania, according to an Associated Press report in December.",
    "More than 60 judges, including Republican judges, either dismissed or ruled against Trump campaign cases alleging widespread voter fraud.",
    "Jenna Ellis, a Trump attorney who worked to overturn election results, also appeared with Mastriano at his January announcement.",
    "Most often his crusade is tied to overturning Pennsylvania’s legitimate election results or trying to ban ballot drop boxes.",
    "The margin between Mastriano and Barletta is razor thin, according to the latest poll from Emerson College and The Hill.",
    "One of the biggest ways Mastriano stands out is with the unproven election fraud claims he has pushed for 16 months.",
    "That false claim started with state Rep. Frank Ryan, R-Lebanon, who said there were 205,000 more votes than voters.",
    "Doug Mastriano, a leading Republican candidate for Pennsylvania governor, is also a leading election denier.",
    "It’s a claim that has been repeated by Trump, Mastriano and several of their far-right supporters.",
    "Last month, he was subpoenaed by the U.S. House committee investigating what led to Jan. 6.",
    "More:Pa. Sen. Doug Mastriano said the fight wasn't over."
  ]
}