{
  "id": 6480,
  "mediaId": 8271,
  "date": "2022-04-12",
  "headline": "Philadelphia’s mask mandate makes national headlines and sparks local debate",
  "image": "https://billypenn.com/wp-content/uploads/2022/02/phillyskyline-lookingnorth-may2021-1200x630.jpg",
  "link": "https://billypenn.com/2022/04/18/philadelpha-mask-mandate-returns/",
  "mediaOutlet": "billypenn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Billy Penn Staff",
  "authorUrl": "https://billypenn.com/about/billy-penn-staff/",
  "termIds": [
    3232,
    158,
    6512,
    6678
  ],
  "sentences": [
    "“If we fail to act now, knowing that every previous wave of infections has been followed by a wave of hospitalization, and then a wave of deaths, it will be too late for many of our residents.”\nDespite omicron’s milder symptoms, almost 750 Philadelphians died of COVID during the recent three-month wave, per the health commissioner, out of more than 5,000 since the pandemic first hit.",
    "Throughout the pandemic, the Health Department has relied on individual businesses to enforce the mask mandates, and the way that plays out is one of the sticking points raised by the industry group Pennsylvania Restaurant & Lodging Association, which put out a statement decrying the policy and calling it “a major blow” to city food establishment operators.",
    "“We never dropped the vaccine requirement, either.”\nAsked about Philly’s mask mandate while at a gun safety forum in Washington, Pa. Attorney General Josh Shapiro, who is running for governor, reportedly called it “counterproductive.”\nMayor Jim Kenney, meanwhile, distanced himself from the announcement.",
    "For this level, two or more of the following must be true:\nAverage new daily cases are higher than 100 and fewer than 225\nHospitalizations are between 50 and 100\nCases have risen more than 50% in the previous 10 days\n“I expect this wave will be smaller than the one we saw in January,” Bettigole said.",
    "As the news splashed across the homepages of the New York Times, CNN, and Washington Post, most articles noted that under CDC guidelines, Philly is considered to have a “low” community level, for which the federal agency does not advise required masking.",
    "Though a quote from him was included in the press release that accompanied the decision, he did not participate in the Health Department’s virtual press conference, something he has done on past occasions that brought major changes in city COVID policy.",
    "Under the mandate, customers have to be masked when they enter or move around restaurants, but are allowed to take off their masks to eat and drink when seated, creating a confusing atmosphere that can be difficult for staff to maintain.",
    "At the time of her announcement Bettigole said the city was recording an average case count of 142 per day, which is less than 5% of the huge numbers Philly saw during this winter’s omicron surge, but nearly 70% higher than 10 days ago.",
    "City officials said they couldn’t comment on this specific case, but Kenney administration spokesperson Kevin Lessard pointed out that a previous effort to get an emergency injunction stopping the mandate was denied.",
    "“[T]he courts once again confirmed that city has both the legal authority and requisite flexibility to enact the precautionary measures necessary to control the spread of COVID-19,” Lessard told the AP.",
    "“It looks like we may be at the start of a new wave.”\nFive days after the announcement, a group of businesses and residents filed a lawsuit to stop the mandate from taking effect, the AP reported.",
    "She stressed that people should get boosted and vaccinated, and recommended keeping a few tests at home to use if you’re feeling sick or preparing to visit someone who is older or vulnerable.",
    "The city’s mandate was announced a week early to give time for businesses to “dig up” their mask-required signs, she said, and to talk with staff about enforcing the new rule.",
    "They’re represented by Thomas W. King III, a lawyer who was part of last year’s effort that ended with the Pa. Supreme Court overturning a statewide school mask mandate.",
    "“We’ve been watching cases rise in several European countries and several places in the U.S.,” said Health Commissioner Chery Bettigole in her announcement on April 11.",
    "“Restaurant workers have suffered severe backlash when enforcing these rules in the past and, unfortunately, this time will be no different,” the PRLA statement said.",
    "City hospitals had 82 COVID patients as of Sunday, which is nearly double two weeks ago and the highest since mid-March, when the first omicron wave was subsiding.",
    "“If we see a different pattern than other waves,” Bettigole said, “we will review our metrics to see if there are opportunities to be less restrictive.”",
    "Philadelphia became the first U.S. city to announce the return of a mask mandate as a new COVID-19 variant threatens.",
    "By afternoon, a photo of him supposedly having a drink at a Center City restaurant was circulating on social media.",
    "Sign up for the free Billy Penn newsletter to get everything you need to know about Philadelphia, every day.",
    "As of Monday, masking is again required indoors at all businesses and institutions in the city.",
    "It also brought dissent from the local restaurant association, and from some Pa. politicians.",
    "The speed of the rise is one of the triggers in the city’s established COVID response levels.",
    "Health officials will carefully watch the numbers over the next few weeks, Bettigole said.",
    "Hospitalizations are still relatively low, but have also started to rise.",
    "“Totally fine with it,” said Julie Keener of Bar Hygge in Fairmount.",
    "Not all restaurant workers and owners were upset by the mandate.",
    "The city will be in Level 2: Mask Precautions Only.",
    "The previous mandate was dropped on March 2.",
    "The move instantly made national news.",
    "Love Philly?"
  ]
}