{
  "id": 6496,
  "mediaId": 8325,
  "date": "2022-04-13",
  "headline": "Dept. of Drug and Alcohol Programs, AG Shapiro Discuss Opioid Settlement Funding in PA",
  "image": "https://i0.wp.com/gantnews.com/wp-content/uploads/2015/02/grant-money.jpg?fit=304%2C202&ssl=1",
  "link": "https://gantnews.com/2022/04/13/dept-of-drug-and-alcohol-programs-ag-shapiro-discuss-opioid-settlement-funding-in-pa/",
  "mediaOutlet": "gantdaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gant Team",
  "authorUrl": "https://gantnews.com/author/gantadmin/",
  "termIds": [
    0
  ],
  "sentences": [
    "A list of approved uses can be found in Exhibit E of the settlement and include expanding/supporting the use of naloxone and medication-assisted treatment, treatment/screening for pregnant/post-partum women and babies with Neonatal Abstinence Syndrome, warm hand-off programs, treatment for incarcerated population, prevention and education, harm reduction strategies such as syringe service programs, data collection and research, enhancing connections to care, drug courts and diversion programs, supporting first responders, and training.",
    "The attorney general and his team listened to the needs of the communities, afforded us the opportunity to make the best use of those funds on a local level, and will continue to fight against this deplorable disease.”\n“The additional resources available through the opioid settlement are vital for us to more effectively implement our local strategy to combat the ongoing overdose crisis in our community,” said Berks County Council on Chemical Abuse Executive Director Stanley Papademetriou.",
    "“This funding will provide opportunities to reach underserved individuals struggling with substance use disorder and provide the necessary tools to find and complete treatment, and go on to live a healthy, fulfilling life in recovery.”\n“These settlement funds will provide more treatment and more capacity to county and local organizations, help provide important ancillary services — like transportation for people trying to access treatment, and save lives,” said Attorney General Shapiro.",
    "HARRISBURG – Today, Department of Drug and Alcohol Programs (DDAP) Secretary Jen Smith virtually joined Pennsylvania Attorney General Josh Shapiro, Butler County Commissioner and County Commissioners Association of Pennsylvania Board Chairman Kevin Boozel, and Berks County Council on Chemical Abuse to discuss the incoming opioid settlement funding in Pennsylvania.",
    "Pennsylvania is slated to receive a maximum of $1.07 billion from the $26 billion agreement with the nation’s three major pharmaceutical distributors – Cardinal, McKesson, and AmerisourceBergen – and Johnson & Johnson over the companies’ role in creating and fueling the nationwide opioid crisis.",
    "In addition to taking part in this roundtable, DDAP is conducting an SUD Listening Tour, meeting with local leaders, SUD treatment providers, members of the recovery community, and other stakeholders to discuss SUD trends at the local level.",
    "Pennsylvania’s total allocation will be distributed as follows:\n15% to litigating counties, subdivisions, district attorneys, and special districts; and\n15% to the commonwealth as a whole to be appropriated by the legislature.",
    "I’m looking forward to the next steps and getting funds out to the communities that need them.”\nThis week, the Office of Attorney General is filing consent decrees with Commonwealth Court to make the settlement effective.",
    "It was very important to the counties and Attorney General Shapiro, a former county commissioner, to ensure that we maximize the effectiveness of these funds at the county level,” said Butler County Commissioner Boozel.",
    "In January, AG Shapiro announced that all 67 counties, including more than 240 local governments with a population of 10,000 or more, have signed on to the national settlement.",
    "To date, DDAP has held five listening sessions throughout various regions of the state and will be continue holding sessions in the coming weeks and months.",
    "Overall settlement dollars will be distributed to Pennsylvania counties as well as the state level, to be appropriated by the General Assembly.",
    "Once those are approved, the Pennsylvania Opioid Misuse and Addiction Abatement Trust will be stood up to oversee disbursement of payments.",
    "“We must have continued urgency to address this crisis at the community level, as that is where change begins,” said DDAP Secretary Smith.",
    "“Counties are ultimately responsible for the delivery of the quality of drug and alcohol services to our local communities.",
    "The first payments should be made to local governments by early summer with a second round of payments in early fall.",
    "This tour is in response to the increase in overdose deaths and polysubstance use throughout the commonwealth.",
    "The settlement provides that funds are to be used for opioid remediation programs and initiatives.",
    "“We have come together as a team to commit the funds that were garnered from the settlement.",
    "To learn more about DDAP’s efforts in combating the addiction crisis, visit ddap.pa.gov.",
    "This would not have happened without their cooperation and expertise.",
    "“I’m thankful for all of our partners in this process."
  ]
}