{
  "id": 6573,
  "mediaId": 8314,
  "date": "2022-04-13",
  "headline": "Candidates make their case to LGBTQ voters",
  "image": "",
  "link": "https://epgn.com/2022/04/13/candidates-make-their-case-to-lgbtq-voters/",
  "mediaOutlet": "epgn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michele Zipkin -",
  "authorUrl": "https://epgn.com/author/michele-zipkin/",
  "termIds": [
    3989,
    4932,
    3926,
    3270,
    3094,
    2709,
    1252,
    6512
  ],
  "sentences": [
    "My office still was one of the top offices in terms of responding to unemployment, getting people rent assistance… and also all the random things that come up on a daily basis that people expect their elected officials to help them with and show up and do.”\nAttorney General Josh Shapiro, who is running unopposed in the gubernatorial primary, spoke via Zoom about his work enacting LGBTQ nondiscrimination laws in Montgomery County, and fighting to preserve marriage equality.",
    "Fairness Act, legislative attacks on trans youth, affordable housing and rent control, the need for a livable wage, boosting hate crimes laws, preserving marriage equality, ensuring broad access to healthcare and the need to combat police violence against people of color and LGBTQ folks, finding solutions for LGBTQ youth who have aged out of the shelter system, the need for comprehensive sex education in Pa., and the need for safe injection sites.",
    "I’ll gladly tell you about all the people that we helped get to the polls in the most important election of our lives.”\nAnother Liberty City member who is a retired teacher on a fixed income, asked several candidates, including Lovitz, Waxman and Gross, about their plans to secure rent control in Philadelphia.",
    "“We had 39 candidates apply for endorsement this year, and our membership is excited to make their voices heard and weigh in on important elections happening up and down the ballot.” Liberty City board co-chair Tariem Burroughs said a few introductory words at the start of each candidate night.",
    "That’s a reality that we need to face and we need to experience protections across the state.”\nAnother high-profile race in the upcoming Pa. election is the race to represent the 182nd House district, which encompasses Center City, the Gayborhood, Bella Vista and parts of Fairmount.",
    "“As your next lieutenant governor, I will fight alongside Josh every single day to pass nondiscrimination legislation here in Pennsylvania as well as [strengthening] hate crime laws to protect our LGBTQ sisters and brothers here in Pennsylvania,” Davis said.",
    "I have a plan to address that and do it responsibly as a small business owner.”\nWhen it was time for questions, Waxman and several other candidates, including Sims, were asked whether they would commit to fighting for justice in the Nizah Morris case.",
    "Raised by his single-parent grandmother, Carroll said he’s the product of “the war on poverty and the war on drugs.” Carroll’s father spent most of his son’s life in prison, and his mother struggled with substance abuse since before Carroll was born.",
    "The member also asked Davis about the fact that he has not outwardly supported House Bill 729, which would make conversion therapy illegal in Pa. “These two points – doesn’t sound too much like an ally,” the member said.",
    "“Liberty City’s candidate nights offer candidates an opportunity to make the pitch for support directly to Philadelphia’s LGBTQ community,” said Liberty City board member Ted Bordelon, who moderated the event.",
    "“Look at the work that my colleague and I have done to register over 1,000 new voters in less than three months with the use of one of these,” Lovitz said at the forum as he held up a digital voter ID card.",
    "So I think my record is clear.”\nAnother Liberty City member asked Davis if he would meet with local Black Lives Matter and LGBTQ activists to fight police brutality toward people of color and queer people.",
    "“I am a fundamentally different legislator than my colleague when it comes to introducing policy, when it comes to leadership in the legislature and when it comes to constituent services,” Sims said.",
    "Liberty City member Bordelon asked Fetterman about “the elephant in the room,” referring to the 2013 incident that happened when Fetterman was mayor of Braddock, Pa., that has recently resurfaced.",
    "“As governor… I will put my political capital behind finally passing a nondiscrimination law here in the Commonwealth of Pennsylvania, something that is long overdue,” Shapiro said at the forum.",
    "Although the Pennsylvania governor and lieutenant governor are elected independently of one another in the primary election, Shapiro endorsed Davis earlier this year as his preferred candidate.",
    "I’ll do what I can to figure out justice in that case.”\nAlvarez was asked at the forum about how she would use her boots-on-the-ground approach to serve her constituents in a tangible way.",
    "“When somebody calls you, sends you a text message or sends you an email, if you don’t respond within a timely period, it could be literally life or death,” Alvarez responded.",
    "“I know what it means to suffer in silence; I know what it means to be the only boy in class who doesn’t have a parent who comes to the parent teacher conference lounge.",
    "For the first time since 2020, Liberty City LGBT Democratic Club hosted its two-part candidate forum in person this year at the Pennsylvania Ethical Society building.",
    "At the end, one Liberty City member asked him, “when you first ran for representative, you said you would succeed where your predecessor Babette Josephs did not.",
    "Where have you succeeded where she was unable to?”\nIn response, Sims said that he chairs two of the largest caucuses in the Pa. General Assembly, including Gov.",
    "Gubernatorial candidate Attorney General Josh Shapiro; Reps. Austin Davis and Brian Sims, who are running for Pa. lieutenant governor; Rep. Mary Isaacson (Dist.",
    "A Liberty City member asked Davis about why he only recently joined the Equality Caucus in Harrisburg even though he’s been in the state legislature since 2018.",
    "Over two dozen candidates running for state and federal office made their case to Liberty City members about why they deserve the organization’s endorsement.",
    "“Can you explain that?”\n“I’m proud of my record in the five years that I’ve served in the Pennsylvania House of Representatives,” Davis said in response.",
    "Kenyatta, who has been a state representative since 2018, was asked by a Liberty City member, “have you completely forgotten about your 181st district?",
    "Morris received a head wound in December 2002, shortly after receiving a “courtesy ride” from Philadelphia Police, and she passed away two days later.",
    "Governor, made his pitch to members about why his 10 years of experience in the state House makes him the prime candidate for that position.",
    "You’re still very new, still learning who this city is.”\nLovitz responded by saying that his work on voting rights should speak for itself.",
    "“I’m lucky to have an incredibly strong team of all Black [people] who run my district office and who are serving folks every single day.",
    "He added that he’s done more training for women, LGBTQ and Black and Brown candidates than his predecessor did in almost three decades.",
    "That’s the same experience that I’m going to take into Harrisburg.”\nCandidates who spoke at the forum include Rep. Pam Delissio (Dist.",
    "At the time, Fetterman heard gunshots close to his home, where he was outside with his young son, and saw a man fleeing from the area.",
    "“I come from a community where a lot of times I have to choose between being Black and also being gay,” Carroll said at the event.",
    "At the forum, two Liberty City members asked Lovitz: “How can you represent Philly if you only voted here in the 2020 election?",
    "I’m happy that throughout this process, we still contribute and champion and try to advance serious, significant legislation.",
    "“I have voted against every single right wing bill that’s come to the House floor and targets our LGBTQ brothers and sisters.",
    "Due to technical interference with Fetterman’s Zoom connection, it was difficult to understand his response to the question.",
    "I understand that protections for LGBTQIA+ people in Philadelphia, it doesn’t exist for all those across the Commonwealth.",
    "Deja Lynn Alvarez, Will Gross, Jonathan Lovitz and Ben Waxman are vying for the seat currently held by Rep. Brian Sims.",
    "“You never have to doubt that with me, because you’ve seen me put in the work to make sure everyone has access to it.",
    "Fetterman had previously addressed the incident in 2021 when responding to questions from a New York Times reporter.",
    "If elected governor, Shapiro has committed to pass bills banning LGBTQ discrimination and expanding hate crime laws.",
    "We’re stuck in the stone ages in a lot of ways in this state; we’re stuck at $7.25 an hour as minimum wage.",
    "182 candidates Deja Lynn Alvarez, Will Gross, Jonathan Lovitz and Ben Waxman; Rep. Elizabeth Fiedler (Dist.",
    "Davis, who currently represents the 35th district in Allegheny County, is running for lieutenant governor.",
    "Shapiro also talked about building trust between police and citizens and working to enact police reform.",
    "“I know a lot about that case,” said Waxman, who previously worked for District Attorney Larry Krasner.",
    "Even before that in my work as county governor, to expand same-sex benefits… in Allegheny County.",
    "The Black and Brown people desperately need representation.”\n“No, I haven’t,” Kenyatta responded.",
    "54 candidates Rochelle Culbreath and Greg Scott; Lisa Borowski, who’s running to represent Dist.",
    "In the Pa. House, Germantown native Andre Carroll is running to represent the 201st district.",
    "Because Miyares is Black, the issue of race came up in the discourse surrounding the issue.",
    "He hopes to bring his lived experience as a Black, queer, working-class man to Harrisburg.",
    "That could make the difference in whether someone reports a rape or doesn’t report a rape.",
    "Liberty City members plan to vote on endorsements during the week of April 18, 2022.",
    "Fetterman called the police and detained the man, Christopher Miyares, using a gun.",
    "State Rep. Austin Davis also appeared via Zoom to speak with Liberty City members.",
    "175); Pa. Congressperson Mary Gay Scanlon; Pa. Congressperson Dwight Evens; Dist.",
    "It turned out that Miyares was unarmed and ultimately did not press charges.",
    "Questions and themes throughout the two evenings included those on the Pa.",
    "“I always try to make sure that I get back to them in a 24-hour period.",
    "Two candidates for U.S. Senate, Rep. Malcolm Kenyatta and Lt. Gov.",
    "John Fetterman and Rep. Malcolm Kenyatta; Rep. Chris Rabb (Dist.",
    "184) and Michael Giangiordano, running to represent Dist.",
    "I also know what it means to have to be assumed straight.",
    "3 candidates Michael Cogbill and Alexandra Hunt; Dist.",
    "“It’s my understanding that that case is not closed.",
    "“We need rent control,” Gross said in his response.",
    "“In other states that have rent control; it works.",
    "177); Tarik Kahn, who’s running to represent Dist.",
    "State Rep. Brian Sims, who is also running for Lt.",
    "Candidates appeared either in-person or via Zoom.",
    "200); Andre Carroll, running to represent Dist.",
    "203); U.S. Senate candidates Lt. Gov.",
    "194; Rep. Isabella Fitzgerald (Dist.",
    "I am an ally to the LGBTQ community.",
    "John Fetterman, attended the forum.",
    "Wolf’s Commission on LGBTQ Affairs.",
    "Davis essentially agreed to do so.",
    "194); Rep. Joe Hohenstein (Dist.",
    "201; Rep. Danilo Burgos (Dist.",
    "197); Attorney Pa.",
    "168; Dist.",
    "184."
  ]
}