{
  "id": 6577,
  "mediaId": 8314,
  "date": "2022-04-12",
  "headline": "Your equal rights might be gone soon, in Pa. and elsewhere",
  "image": "",
  "link": "https://epgn.com/2022/04/12/your-equal-rights-might-be-gone-soon-in-pa-and-elsewhere/",
  "mediaOutlet": "epgn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Villemez",
  "authorUrl": "https://epgn.com/author/jason-villemez/",
  "termIds": [
    5066,
    5311,
    3026,
    3686,
    3926,
    1269,
    392,
    6650,
    6175
  ],
  "sentences": [
    "While the hope was always that the fight for equality would be a path forward, with each new victory — Lawrence, Don’t Ask Don’t Tell, Obergefell — leading to another more impressive triumph, that comparison might be over.",
    "The things we do in private might still be legal, but teachers in some states are going to have to be extremely careful about what they reveal in public, lest they be subject to discipline or expulsion.",
    "And, if you’ve been reading PGN for any length of time, you’ve seen the stories of people who were subject to unjust discrimination at their place of employment or even their place of residence.",
    "The election of Senators Raphael Warnock and Jon Ossoff in Georgia might have helped stave off what seems like an inevitable reckoning, but the side pulling for equality is getting exhausted.",
    "The backlash is a result of decades of blind victories, of celebrating our triumphs without being realistic about the anger — and the power that comes with it — of those opposed to us.",
    "Meanwhile, Donald Trump’s judges are silently battling back the tides of equality, and those elected on his coattails are now trying, and succeeding, to undo decades of political work.",
    "Josh Shapiro is a good candidate, but even he can’t control certain things in a world governed more by those who make headlines than those who make an actual difference.",
    "Now, states with Democratic majorities are having to enshrine marriage equality into their constitutions in case the Supreme Court wipes it out nationally.",
    "Sure, it’s a shinier and newer square one, with more visibility and a comfier seat at the table, but the view is worse and our seat is far from the center.",
    "If all of them are going to be supportive of LGBTQ issues, why not give money to liberal candidates in tighter races with more conservative challengers?",
    "Or perhaps we’d be better off giving our political dollars to moderate democrats in suburban and rural districts rather than liberal urban districts.",
    "We can’t just assume that Justice Neil Gorsuch wouldn’t vote to strip us of marriage equality because he voted for us in Bostock v. Clayton County.",
    "Now the backlash is a creature that stands all on its own, a creature of fear, of ignorance, of political trickery and the worst kind of cynicism.",
    "It doesn’t help that we have to work against a side that has, and will continue to have, an oversized share of political power in this country.",
    "A Democratic governor, while useful for the veto power, is not foolproof if conservative Republicans gain seats in the house and senate.",
    "That might sound ridiculous, but if that is the only way to get level-headed Republicans to win in a primary, maybe we need to do it.",
    "Perhaps we’d be better off switching our party registration to Republican and voting for the most moderate ones in the primary.",
    "A more apt comparison for LGBTQ rights in 2022 is a circle, and we’re coming around and arriving again, sadly, at square one.",
    "If that is the only way to get a moderate Republican instead of Dr. Oz in the general election, maybe we have to do it.",
    "The most hopeful souls will try to put a positive spin on things; after all, you can’t have progress without backlash.",
    "We celebrated Stonewall 50, the largest Gay Pride event in history, and thought: nothing will bring us down again.",
    "(Even if they don’t, they might be able to muster a veto override, as the Utah legislature did recently.)",
    "We need to be more strategic about how we approach the fight for equality in the year 2022.",
    "We’ve been on overdrive since 2010, and even the most sturdy of hands get blistered.",
    "We can’t just shout ‘you’re wrong’ over and over and over again and expect results.",
    "But that’s assuming Pennsylvania can even elect a Democratic governor in November.",
    "Ask people in Tennessee or Alabama or Oklahoma how their equal rights are looking.",
    "We can’t just believe that one person in one office is going to change the game.",
    "In Pennsylvania, we need to start acting like the worst has already happened.",
    "(You can still vote for the Democrat in the general election, don’t worry.)",
    "Pennsylvania is not far off from becoming Texas or Tennessee or Alabama.",
    "We’re in the midst of a tipping point, a precarious game of tug of war.",
    "Any human will grow tired competing against an entrenched machine.",
    "But we can’t shrug off the latter as a mere byproduct anymore.",
    "Why give money to a race that has multiple liberal candidates?",
    "We got married and thought it would be that way forever.",
    "So far, in fact, that we have to scream to be heard.",
    "Ask anybody who wants to get an abortion in Texas.",
    "At this point, we need to think out of the box.",
    "Scratch that: that comparison is over.",
    "You’re not going to get good answers.",
    "It’s not hyperbolic to say all this.",
    "The time for such idealism is over.",
    "In some places, it already has.",
    "This is a new world.",
    "No."
  ]
}