{
  "id": 6644,
  "mediaId": 8449,
  "date": "2022-04-13",
  "headline": "Pareja se declara culpable de robar cientos de autos",
  "image": "https://media.telemundo62.com/2022/04/chicago-carjackings.png?resize=1200%2C675&quality=85&strip=all",
  "link": "https://www.telemundo62.com/noticias/local/pareja-se-declara-culpable-de-robar-cientos-de-autos/2206474/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    6512,
    6506,
    6015,
    6016
  ],
  "sentences": [
    "Gracias al trabajo incansable de nuestra oficina en asociación con el Departamento de Policía del Municipio de Buckingham, los residentes pueden estar seguros de que estas personas ya no dañarán a nuestras comunidades”, lee el comunicado de Shapiro.",
    "Los investigadores señalaron que descubrieron que en la noche de Navidad de 2019, la pareja cometió un robo en una casa de Filadelfia durante el cual cargaron con $150,000 en efectivo, que representaban los ahorros de toda la vida del propietario.",
    "Una pareja de Yardley, Pensilvania, se declaró culpable de robar cientos de vehículos en el estado, así como de un allanamiento de morada en el que cargaron con miles de dólares, informó el fiscal general, Josh Shapiro.",
    "Johnson y Fletcher se declararon culpables de robo, hurto y otros cargos relacionados en el Centro de Justicia Penal de Bucks County ante el juez Raymond McHugh.",
    "Según las autoridades, la ola de crímenes de Johnson y Fletcher se extendió por los condados del sureste de Pensilvania, incluido Montgomery County y Filadelfia.",
    "La investigación comenzó después de que se diera una serie de robos de automóviles en Bucks County, en el transcurso de varios meses.",
    "Los acusados fueron identificados como Keith Johnson y Jessica Fletcher y, se dijo en un comunicado de prensa, que habrían hurtado??",
    "La oficina del procurador general informó que Johnson fue sentenciado a entre cuatro y 12 años en una prisión estatal.",
    "?robaron a cientos de víctimas y ahora deben rendir cuentas por sus crímenes.",
    "Fletcher fue sentenciada a cinco años de libertad condicional.",
    "También se les ordenó pagar más de $140,000 en restitución.",
    "Ambos se declararon culpables en Bucks County.",
    "más de 250 vehículos en Pensilvania.",
    "“Estos acusados ?"
  ]
}