{
  "id": 6692,
  "mediaId": 8325,
  "date": "2022-04-14",
  "headline": "PA Primary Election 2022: See How Much Money the GOP Candidates for Governor Have Raised",
  "image": "https://i0.wp.com/gantnews.com/wp-content/uploads/2022/04/image-6.jpeg?fit=1206%2C803&ssl=1",
  "link": "https://gantnews.com/2022/04/14/pa-primary-election-2022-see-how-much-money-the-gop-candidates-for-governor-have-raised/",
  "mediaOutlet": "gantdaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gant Team",
  "authorUrl": "https://gantnews.com/author/gantadmin/",
  "termIds": [
    0
  ],
  "sentences": [
    "Here’s what we know about the Republican field’s donors, based on their most recent campaign finance reports covering the first three months of 2022 (the next report is due in early May):\nLou Barletta\nCash raised overall: $1.3 million\nCash raised in 2022: $430,745\nCash on hand: $356,292\nTop donors who gave at least $25,000 at one time:\nChange PA PAC ($198,000)\nNorman Arthur Dick ($30,800)\nRestore The Dream ($30,000)\nWhere America Started ($30,000)\nBarletta, the former mayor of Hazleton and an ex-U.S. representative, has received the most money from a likely source: Change PA PAC, a political action committee that he launched last year as he was mulling a run for governor.",
    "Tied for second place are five donors who have each given Corman $100,000: state Sen. John DiSanto’s political action committee; Galen E. Dreibelbis, a commercial and residential real-estate developer in Centre County who formerly served in the state legislature; Laura M. Pegula, a geologist and daughter of Terry Pegula, a Penn State University alumnus who runs a multimillion-dollar energy industry acquisition company; Sandra L. Poole, a designer with a Centre County home building company run by her husband, Robert Poole; and hotel developer, owner, and operator Lance Shaner.",
    "Bill McSwain\nCash raised overall: $2.4 million\nCash raised in 2022: $1.4 million\nCash on hand: $1.7 million\nTop donors who gave at least $25,000 at one time:\nWalter W. Buckley Jr. ($1 million)\nJon Lubert ($125,000)\nDavid E. Barensfeld ($100,000)\nMcSwain, a former Trump-appointed U.S. attorney in Philadelphia, has attracted big-name cash donors, including Walter Buckley Jr., an investment fund managing partner, and hedge fund manager Jon Lubert.",
    "Jake Corman\nCash raised overall: $2.8 million\nCash raised in 2022: $589,627\nCash on hand: $270,846\nTop donors who gave at least $25,000 at one time:\nUniversity City Housing Company ($500,000)\nJohn DiSanto ($100,000)\nGalen E. Dreibelbis ($100,000)\nCorman, a state senator from Centre County, has received multiple six-figure donations over the past 15 months.",
    "Joe Gale\nCash raised overall: $99,095\nCash raised in 2022: $58,496\nCash on hand: $33,133\nTop donors who gave at least $25,000 at one time:\nNo donors who meet that criteria\nGale, a current Montgomery County commissioner, has branded himself as a political outsider, claiming that the Pennsylvania Republican Party is not conservative enough.",
    "Charlie Gerow\nCash raised overall: $468,574\nCash raised in 2022: $46,907\nCash on hand: $179,073\nTop donors who gave at least $25,000 at one time:\nAmerican Conservative Union ($100,000)\nLouis A. Esposito ($25,000)\nGerow, a Republican strategist and former lobbyist, has raised less than half a million over the course of his campaign.",
    "Doug Mastriano\nCash raised overall: $1.4 million\nCash raised in 2022: $372,555\nCash on hand: $1.1 million\nTop donors who gave at least $25,000 at one time:\nJames Martin ($110,000)\nClayton Black ($50,000)\nSteven Latta ($50,000)\nMastriano, a state senator from Franklin County, has largely received small donations — those under $500.",
    "Melissa Hart\nCash raised overall: $37,060\nCash raised in 2022: $34,310\nCash on hand: $7,200\nTop donors who gave at least $25,000 at one time:\nNone\nHart, a former state senator and congressional representative from Western Pennsylvania, has seen most of her campaign cash come from individual donations under $5,000.",
    "Nche Zama\nCash raised overall: $263,052\nCash raised in 2022: $35,448\nCash on hand: $134,455\nTop donors who gave at least $25,000 at one time:\nNo donors who meet that criteria\nZama, a Harvard-educated surgeon who has lived in the Poconos for more than a decade, has primarily received smaller donations.",
    "Angela Couloumbis of Spotlight PA, Ethan Edward Coston of Spotlight PA and Kate Huangpu of Spotlight PA\nSpotlight PA is an independent, nonpartisan newsroom powered by The Philadelphia Inquirer in partnership with PennLive/The Patriot-News, TribLIVE/Pittsburgh Tribune-Review, and WITF Public Media.",
    "The Commonwealth Leaders Fund — a political action committee founded by prominent conservative Matthew Brouillette and funded in large part by billionaire Jeffrey Yass — has bet big on McSwain, donating almost $6 million in TV and digital ads as well as other items like mailers.",
    "PAC ($200,000)\nSteamfitters Local Union 420 COPE Fund ($100,000)\nWhite, a business owner from Delaware County, has received his top donations from a PAC controlled by Bob Asher, a candy magnate and powerful figure in Republican politics from Montgomery County.",
    "Dave White\nCash raised overall: $5.1 million\nCash raised in 2022: $1.8 million\nCash on hand: $171,308\nTop donors who gave at least $25,000 at one time:\nPA Future Fund ($202,000)\nUA Union Plumbers & Pipefitters Vote!",
    "HARRISBURG — With just over a month to go until the May primary election of 2022, the nine candidates vying for the Republican nomination for governor have collectively raised more than $13 million.",
    "That money has helped them crisscross the state, hit the television airwaves, cut digital ads, print mailers, and pay steep salaries to a bevy of consultants and campaign finance advisors.",
    "Yet others have poured millions of dollars of their own money into their campaign war chests in the hopes of pulling ahead of the pack, according to the latest campaign finance reports.",
    "As the Republicans have fought for campaign superiority, Shapiro began the year with $13.4 million on hand — and raised another $4.5 million in the first three months of this year.",
    "The largest donation ($100,000) came from the American Conservative Union, the group that organizes the annual meeting known as CPAC and of which Gerow serves as the vice-chairman.",
    "The nine candidates vying for the Republican nomination in Pennsylvania’s 2022 primary governor election have collectively raised more than $13 million over the past 15 months.",
    "WHILE YOU’RE HERE… If you learned something from this story, pay it forward and become a member of Spotlight PA so someone else can in the future at spotlightpa.org/donate.",
    "His top donor is James Martin, owner of Martin’s Famous Pastry Shoppe, a bread and roll manufacturer in Chambersburg, who has contributed $110,000 in two donations.",
    "White on his campaign website says he worked for “decades as a union pipefitter,” and he has also seen large donations from PACS associated with that industry.",
    "The PAC has not raised money since 2018, when Mango made his unsuccessful run for governor, but it donated the majority of the money it had left to Barletta.",
    "To Barletta’s current campaign, Norman Arthur Dick, who runs a kitchen and bathroom products company in Mountain Top, contributed $30,800 in two donations.",
    "Though the race to lure more and bigger donors is only expected to intensify as the May 17 primary draws closer, it appears unlikely to shatter records.",
    "The Republican candidate who emerges victorious in the primary will face state Attorney General Josh Shapiro, a Democrat who is running unopposed.",
    "Pennsylvania in recent years has made national headlines for its expensive primary contests for governor — at least on the Democratic side.",
    "In 2021, the biggest donors were Jodey Mutchler and Richard Mutchler, the president of pharmaceutical firm Biospectra, who gave $100,000.",
    "He has also received sizable donations from David E. Barensfeld, board chair of Commonwealth Partners, a conservative advocacy group.",
    "Where America Started received its largest donations last year from executives from construction, coal, and real estate companies.",
    "Gale has raised nearly $100,000 throughout his campaign, over half of which was given during the first three months of this year.",
    "Spotlight PA is funded by foundationsand readers like you who are committed to accountability journalism that gets results.",
    "The candidate himself, with his wife Debra Ann, has loaned his campaign $4 million, according to his most recent report.",
    "Going back to 2018, it was affiliated with the political action committee of onetime gubernatorial candidate Paul Mango.",
    "Restore The Dream is chaired by G. Reeder Patton II, whose family runs an indoor sports complex center in Harrisburg.",
    "Businessman David Z. Abel, the owner of a truck and auto supply company in Palmyra, was third, contributing $25,000.",
    "Corman has also moved $200,00 from his senatorial PAC, Friends of Jake Corman, to support his gubernatorial bid.",
    "His largest contributor was the political action committee of Bryn Mawr’s University City Housing Company.",
    "Barletta also received $36,000 in an in-kind donation from James Ertle of Ertle Subaru in Stroudsburg.",
    "The PAC’s largest donors last year were executives from construction, coal, and real estate companies.",
    "In 2014, for instance, Tom Wolf edged out three opponents in a primary race that cost $36.6 million.",
    "Tied for third are two political action committees: Restore The Dream and Where America Started.",
    "Car dealership owners Clayton Black and Steven Latta tied for second, giving him $50,000 each.",
    "This year’s general election, however, could quickly make history when it comes to spending.",
    "Some of their campaigns have been fueled primarily by small donations of $25 to $250.",
    "His third-largest donor is a political action committee called Where America Started.",
    "The candidate had loaned $140,000 to his own campaign, his most recent report showed.",
    "The company is run by Michael Karp, a major Philadelphia-area real estate developer.",
    "(Spotlight PA will soon publish a separate analysis of Shapiro’s donors.)",
    "Ed Rendell and now U.S. Sen. Bob Casey cost an eye-popping $30 million.",
    "He also loaned $85,000 of his own money to his campaign last year.",
    "Others have benefited from multimillion-dollar infusions of cash.",
    "Before that, the bruising primary between former Democratic Gov.",
    "He has loaned his own campaign $25,000 of that total.",
    "His mother has also loaned his campaign $90,000.",
    "Change PA did not get contributions this year.",
    "He eventually won the general election.",
    "These are known as in-kind donations.",
    "Asher was a major backer of Trump.",
    "Sign up for our free newsletters.",
    "Each donated $30,000."
  ]
}