{
  "id": 6879,
  "mediaId": 2754,
  "date": "2022-04-10",
  "headline": "Gun Advocacy Groups Demand Investigation Of Potentially Unlawful NBC News \"Ghost Gun\" Segment",
  "image": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2022-04/2022-04-10_09-39-41.png?itok=vLu_B6bM",
  "link": "https://www.zerohedge.com/political/gun-advocacy-groups-demand-investigation-potentially-unlawful-nbc-news-ghost-gun-segment",
  "mediaOutlet": "Zero Hedge",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Durden",
  "authorUrl": "",
  "termIds": [
    3297,
    4648,
    3858,
    3926,
    1190,
    1022,
    850,
    887,
    888
  ],
  "sentences": [
    "A new ATF rule re-classifying these kits as firearms is pending, but until then, the market is burgeoning as # of them recovered at crime scenes jumps.pic.twitter.com/9FRmOnyI1N https://t.co/2K00kUgWWS\n— Vaughn Hillyard (@VaughnHillyard) March 18, 2022\nLast week, the heads of the Second Amendment Foundation, Gun Owners of America, American Firearms Association, National Association for Gun Rights, and Pennsylvania Firearms Association sent a three-page letter to the Pennsylvania House of Representatives to investigate Attorney General Josh Shapiro and his special agents who manufactured and transferred an un-serialized weapon to the Hillyard (the NBC reporter).",
    "Firearms website The Reload says NBC reporter Vaughn Hillyard, who lives in New York, purchased a Polymer80 80% lower kit at a gun show near Philadelphia (outside his home state) and then gave the kit to special agents of the Pennsylvania Office of Attorney General to finish the firearm may have violated state and federal laws.",
    "Gun-rights groups called on authorities to investigate the purchase and transfer:\n\"We call on the Biden Justice Department to investigate possible violations of federal gun law, same as that agency would investigate any private citizen who had done the same thing.",
    "\"Earlier this year, NBC News Reporter Vaughn Hillyard, purchased two firearms build kits at the Oaks Gun Show, as part of a \"hidden camera\" investigation attempting to show the public how easy it was to manufacture a firearm from a kit.",
    "NBC News appears to have violated state and federal laws while producing a television special hit piece on \"ghost guns,\" according to a coalition of five gun rights organizations.",
    "The letter went on to say: \"There is no 'law enforcement exception' to justice, and Mr. Shapiro and his agents must be held to the same standard that they hold our citizens to.\"",
    "\"Our alarms were raised because of the possible felonies that may have been committed by the reporter and the office of Pennsylvania Attorney General Josh Shapiro.",
    "Thereafter, Mr. Hillyard met up with 'special agents from the AG's office, who agreed to use the kit [he] purchased from the show and build it into a ghost gun.'",
    "Gun rights groups want the investigation because no liberal elites (including government officials and biased NBC reporters) should be above the law.",
    "\"You cannot violate federal gun laws to complain about gun laws and promote a gun control agenda, even as a working journalist,\" Gottlieb stated.",
    "As explained by gun advocacy group The Machine Gun Nest, the Biden administration will soon announce significant rule changes on 80% lowers.",
    "Ironically, Mr. Hillyard was apparently unable to finish the kit [himself] and reached out to Attorney General Shapiro for assistance.",
    "Once the kit was complete, the agents of the Attorney General gave Mr. Hillyard, a resident of New York State, a finished firearm.",
    "\"You don't get a pass simply by working for NBC,\" Alan Gottlieb, head of the Second Amendment Foundation, said in a statement.",
    "Gottlieb said NBC's reporting is \"sensationalism that is designed to generate ratings and raise viewer alarms.\"",
    "Our Latest Story:\nA look at easy-to-acquire ghost gun kits that can be built into firearms in 30 mins.",
    "Under the Biden administration, the story count for ghost guns has exploded.",
    "This investigation was broadcast [by NBC News] on/about March 17th, 2022.\"",
    "Well, maybe Hunter Biden's illegal gun purchase...",
    "And there's a reason for that.",
    "A short clip of NBC's report."
  ]
}