{
  "id": 802,
  "mediaId": 8493,
  "date": "2022-02-25",
  "headline": "PA Headlines: GOP Gubernatorial Candidate Ciarrocchi Drops Out",
  "image": "https://www.wkok.com/wp-content/uploads/2020/07/SBC-APP-KO-CAR-PLAY-New.jpg",
  "link": "https://www.wkok.com/pa-headlines-gop-gubernatorial-candidate-ciarrocchi-drops-out/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    0
  ],
  "sentences": [
    "HARRISBURG — Spotlight PA is reporting… Independent investigations of deaths or injuries caused by Pennsylvania State Police would require a change to state law, the agency claims, rebuffing a recommendation by a state panel that would require an outside agency to investigate such cases.",
    "The Pennsylvania State Law Enforcement Citizen Advisory Commission called for the change in response to a 2016 incident in which State Police shot a man in Beaver County after consulting with the local district attorney about whether the action would be legal.",
    "The current process ensures “every officer involved shooting or other serious police incident involving a member is thoroughly investigated, both criminally and administratively,” State Police Commissioner Robert Evanchick wrote to the commission.",
    "Evanchick said that the State Police is one of the few agencies in Pennsylvania that is fully accredited to handle use-of-force incidents and that it helms most investigations when another police department in the state shoots someone.",
    "Even with Ciarrocchi’s exit, the Republican primary field remains double-digits deep as GOP rivals vie for the nomination to take on the presumed Democratic nominee, two-term state Attorney General Josh Shapiro, in November’s election.",
    "The advisory commission released its first three reports to the public earlier this month, proposing eight changes to policies and practices, most of which the agency agreed to modify or consider.",
    "Tom Wolf created the panel after the murder of George Floyd and authorized it to review incidents involving state-run police agencies after all criminal and civil cases are completed.",
    "Guy Ciarrocchi, who stepped down as president and CEO of the Chester County Chamber of Business and Industry to run, said Thursday that he is ending his campaign.",
    "The recommendations in the commission’s reports cover use of force, bias-based policing, and “critical incidents” where someone is killed or seriously injured.",
    "Currently, if a trooper kills or injures someone, the State Police assign troopers from another jurisdiction to conduct an investigation..\nAbout The Author",
    "PA Headlines 2/25/22\nHARRISBURG, Pa. (AP) — Another candidate is dropping out of the crowded field for the GOP nomination for governor of Pennsylvania.",
    "Candidates can begin circulating paperwork on Friday to gather the 2,000 voter signatures necessary to qualify for primary ballots across Pennsylvania.",
    "Ciarrocchi is a long-time advocate for parochial and charter schools, and was a former congressional staffer and top aide to former Lt. Gov.",
    "That same district attorney later ruled that the trooper’s actions were justified based on a State Police investigation.",
    "State Police said a legislative change would be needed to allow for external investigations.",
    "Tom Wolf, a second-term Democrat, is constitutionally restricted from serving a third term.",
    "Jim Cawley before he joined the Chester County chamber.",
    "The primary election is May 17.",
    "He has endorsed Shapiro.",
    "Gov.",
    "Gov."
  ]
}