{
  "id": 834,
  "mediaId": 2732,
  "date": "2022-02-23",
  "headline": "Jake Corman’s campaign calls for probe into GOP gubernatorial opponent’s campaign finance filings",
  "image": "",
  "link": "https://triblive.com/news/pennsylvania/jake-cormans-campaign-calls-for-probe-into-gop-gubernatorial-opponents-campaign-finance-filings/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In a letter sent on Wednesday to Franklin County District Attorney Matt Fogel, Corman’s campaign counsel questions whether Mastriano complied with the law when he initially submitted a 2021 year-end campaign finance report that was later corrected following media scrutiny with a 239-page amendment filled with previously omitted details including hundreds of thousands of dollars of contributions.",
    "The Philadelphia Inquirer reported on Monday that Mastriano’s initial 2021 year-end campaign financial report showed only a single expense of $14,415.87 for an online fundraising service’s processing fees and no in-kind contributions despite a flurry of campaign events last year.",
    "Corman accused Mastriano of engaging in “politics and showmanship” when it came to the review “and not actually getting things done.” He further stripped Mastriano of his Capitol staff for a few weeks and continues to ban him from Senate Republican closed-door caucus meetings.",
    "Another flap arose over Corman’s call for the House of Representatives to begin impeachment proceedings against Philadelphia District Attorney Larry Krasner over his “failed policies” that Corman believes contribute to the spike in violent crime in that city.",
    "He further points out in his letter that the responsibility for investigating the matter may fall on the county prosecutor since state Attorney General Josh Shapiro likely is conflicted since he is the presumed Democratic gubernatorial nominee.",
    "Corman’s campaign counsel questioned how 239 pages of additional transactions didn’t get reported or why there was no “readily apparent explanation” as to how they went unaccounted for in the initial filing, the letter states.",
    "Doug is not above the law.”\nCorman and Mastriano are among a crowded field of Republicans vying for the party’s nomination in the governor’s race that will be decided in the primary election which is scheduled for May 17.",
    "They like him.”\nTying that to his call for an investigation into Mastriano’s campaign finance filings, Corman said, “Unfortunately, this isn’t surprising coming from the leading Republican defender of Larry Krasner.",
    "“What is clear, however, is that submitting a false campaign finance report ‘constitute[s] the crime of perjury’ under Pennsylvania law.”\nThis isn’t the first time Corman has had a dust-up with Mastriano.",
    "Corman’s campaign is calling on Franklin County District Attorney Matt Fogal to investigate the matter since Mastriano is a resident of the county and Friends of Doug Mastriano has an address there.",
    "“The Pennsylvania Election Code empowers your office with the power to investigate and, if appropriate, prosecute these violations,” Corman’s campaign counsel Zachary Wallen states in his letter.",
    "He accused the Senate leader of stonewalling his efforts and has discredited the quality of the election review that subsequently was reassigned to Sen. Cris Dush, R-Jefferson County, to oversee.",
    "On Tuesday, Mastriano submitted a lengthy amendment to his earlier campaign filings showing he had raised over $1 million — almost twice as much as the $550,000 he initially reported last year.",
    "Republican gubernatorial candidate Jake Corman is calling for an investigation into suspected violations of the state’s campaign finance law by opponent and Senate colleague Doug Mastriano.",
    "Last summer, Corman, who is Senate president pro tempore, yanked Mastriano’s chairmanship of a committee as it was set to launch an Arizona-style audit of the 2020 election.",
    "“Frankly, the amended campaign finance report raises more questions than answers, given the enormity of the additional transactions,” Wallen’s letter states.",
    "Mastriano — who lent his voice to false claims that the last presidential election was stolen from former President Donald Trump — fired back at Corman.",
    "Further, the article said the Department of State, which collects campaign filings, received Mastriano’s report a week after the filing deadline.",
    "“Doug Mastriano has clearly and flagrantly ignored the law that every other candidate in the race has followed,” Corman said in a statement.",
    "Mastriano said in a televised interview with Newsmax it was “political grandstanding, sadly.",
    "Attempts to contact Mastriano on Wednesday via email, text and phone were unsuccessful.",
    "Further, it shows he spent almost 15 times as much, or more than $215,000.",
    "Krasner’s camp has called Corman’s actions a political stunt.",
    "Categories: News | Pennsylvania | Politics Election",
    "You know Philadelphia, they want Krasner."
  ]
}