{
  "id": 8583,
  "mediaId": 8452,
  "date": "2022-04-08",
  "headline": "Temple president highlights university brand through social media platforms",
  "image": "https://ttn-media.s3.amazonaws.com/wp-content/uploads/2022/04/07213749/4.5_News_WingardEngagement_NoelChacko-1-scaled.jpg",
  "link": "https://temple-news.com/temple-president-highlights-university-brand-through-social-media-platforms/",
  "mediaOutlet": "temple-news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fallon Roth",
  "authorUrl": "https://temple-news.com/author/fallonroth/",
  "termIds": [
    3926,
    2610,
    2220,
    5662,
    1394,
    1291,
    716,
    641
  ],
  "sentences": [
    "“I want to use Instagram and Twitter and LinkedIn, and I want to go on to CNBC and other news channels, ABC and others, to make sure that I’m messaging and telling the story about why we are a selective value proposition for students to attend, for faculty to come and teach, for donors to give, for fans to come and watch, all of the above,” Wingard said in a one-on-one interview with The Temple News on March 23.",
    "“If he’s close enough to people you know, like, trust and respect, then he will hopefully generate some of that for himself.”\nAnderson thinks Wingard could do more to display his personal life outside of the presidency to connect more with students.",
    "Dave Anderson, an advertising professor and social media expert, believes Wingard is following a nontraditional outreach path, centered around meeting stakeholders, especially students, where their attention lies — in social media.",
    "It is for you to get out to the people.”\nWhile riding his bike on Broad Street on his way to class, Kyle Adams, a senior media studies and production major, met Wingard, and they started discussing Adams’ fine art business.",
    "“So I feel like whenever President Wingard’s out and people talk to him he’s affecting the culture in a positive way.”\nAs a young Black man, Adams is glad to see representation in the university presidency.",
    "Just 10 months into his presidency, Wingard has more than 4,000 followers on Instagram and uses his social media presence to promote Temple students’ stories and the value of attending the university.",
    "Wingard wants to continue promoting Temple’s mission to prove the university is a worthy financial investment for students and parents, especially as he embarks on university fundraising strategies.",
    "Rather than intermittently holding press conferences, social media allows Wingard to invite the public to see his daily life, said Jason Del Gandio, a communication and social influence professor.",
    "Presenting himself as open and relatable, Wingard is moving into unchartered territory and developing a social media strategy far more advanced than previous university presidents.",
    "If you scroll through Instagram, you might stumble across a post from Temple University President Jason Wingard, smiling next to students, university stakeholders or celebrities.",
    "Alana Aninipot, a senior media studies and production major, is president of Temple’s Talking Hands club, which promotes the learning of American Sign Language and deaf culture.",
    "She was ultimately featured in a March 17 Instagram video, tagged as #WingardOwlProwl, showing Wingard walking around campus and interacting with students.",
    "He also makes a point to post about meeting celebrities, like Spike Lee, and politicians, like Pennsylvania Attorney General Josh Shapiro.",
    "It’s important for Wingard to put himself out on display so people know who he is and can better identify with him, Del Gandio said.",
    "“So, the quickest way to get to know somebody is not for you to sit in your office behind your secretary and hope they come to you.",
    "“It’s important for me as the chief ambassador to leverage all those channels to be able to tell our story,” Wingard said.",
    "When she ran into Wingard at the Bell Tower last month, Aninipot was wearing a shirt that said “Temple University” in ASL.",
    "“I think he’s setting a good precedent for himself, especially since it’s his first year being president,” Aninipot said.",
    "The next week, Wingard’s assistant called Adams and asked him to commission artwork for his office.",
    "“If he got people to understand who the man was, then they get behind the mission,” Anderson said.",
    "He calls it a necessary messaging strategy for Temple to achieve recognition for its value.",
    "Last month, Wingard named Mary Burke as his vice president for institutional advancement.",
    "“He has to make up a lot of ground because he’s new, nobody knows him,” Anderson said.",
    "“That one connection made me feel more connected to Temple as a college,” Adams said.",
    "Burke is charged with handling major gifts and leading fundraising campaigns.",
    "Wingard then featured Adams and his business in a March 10 Instagram post.",
    "“Look at it like osmosis,” Anderson wrote in an email to The Temple News.",
    "“I think it’s almost a rebranding of Temple itself,” Del Gandio added.",
    "Wingard is Temple’s first Black president in its 137-year history."
  ]
}