{
  "id": 9271,
  "mediaId": 2732,
  "date": "2022-03-24",
  "headline": "Editorial: GOP candidates should embrace better debates",
  "image": "",
  "link": "https://triblive.com/opinion/editorial-gop-candidates-should-embrace-better-debates/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2148,
    1659,
    3131,
    2911,
    4811,
    1489,
    392,
    1126
  ],
  "sentences": [
    "A cherry-picked process prepares them for nothing, and defining the rules without the other five candidates in the primary could offend some supporters — especially as state Sen. Doug Mastriano recently polled behind Barletta but ahead of McSwain and Corman in a TargetPoint Consulting poll.",
    "Former congressman Lou Barletta, state Senate President Pro Tempore Jake Corman, former U.S. Attorney Bill McSwain and former Delaware County councilman Dave White won’t take part in any debate that is not moderated by a Republican who lives in the state.",
    "The primary process puts them up against all of the other people in their division — sorry, party — to duke it out and see who scores the most points, knocks out the lower seeds or gets tripped up by a plucky underdog.",
    "Barletta spokesman Tim Murtaugh went one step further, saying they also won’t debate with journalists asking questions so the process “doesn’t get hijacked by the media or liberal activists.”\nWell, OK then.",
    "The Republican gubernatorial candidates who are pushing away a real, moderated, journalistic debate are not only doing themselves a disservice but also are doing the same to their party and constituents.",
    "But without a rigorous, uninsulated forum to play out the questions and issues, will they find the candidate best capable of taking on the only man standing on the Democratic side?",
    "On Monday, four members of the jam-packed field of GOP candidates vying for the top spot in Pennsylvania politics made a joint announcement.",
    "By this chunk of the GOP field deciding how it will play the game, it may end up with the very most Republican candidate possible.",
    "The Republicans would be better served by standing up, thumping their chests, inviting all questions and answering them honestly.",
    "Winning the whole show requires picking up more than just Republican votes and answering more than just conservative questions.",
    "The problem with that is something that has plagued a number of campaigns in recent years nationwide for both major parties.",
    "Attorney General Josh Shapiro, after all, will come through the primary season without a scratch.",
    "A lot of Pennsylvania issues are broadly beyond party and need to be addressed as such.",
    "The candidates at this point are nominated only by themselves and their backers.",
    "The election process is bigger than what happens in the first round.",
    "They win their bracket by playing to the most people on their side.",
    "Everyone uses the roads, pays the taxes and breathes the air.",
    "They are in the ring because they threw their hats in.",
    "However, the next step is playing to everyone.",
    "Let’s look at it like March Madness.",
    "Categories: Editorials | Opinion"
  ]
}