{
  "id": 960,
  "mediaId": 8254,
  "date": "2022-02-15",
  "headline": "Five facing charges for pandemic unemployment fraud; AG",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/Court-Ordered-Restitution-Money.jpg?w=1280",
  "link": "https://www.abc27.com/news/pennsylvania/five-facing-charges-for-defrauding-pa-pandemic-unemployment-assistance-program/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    0
  ],
  "sentences": [
    "The following individuals were named in criminal complaints filed in the Pennsylvania Courts of Common Pleas and arrested today by the Pennsylvania Office of Attorney General:\nRegine Ford, 26, of Newark, DE\nJohn Rivers III, 35, of Loganville, GA\nJose Thomas, 43, of Sicklerville, NJ\nShammiere Lackey, 28, of Pennsville, NJ\nAdrian Hambrick, 38, of Salem, NJ\nThree of the suspects are expected to be charged within the next week and one remains at large.",
    "We will continue to work with our partners to hold these scammers accountable to the law, and ensure that our unemployment benefits are going to those that need them.”\nTo date, the Office of Attorney General has charged 44 individuals, including 24 inmates and their accomplices, across the Commonwealth for submitting fraudulent PUA applications amounting to more than $4 million in fraudulent PUA funds.",
    "HARRISBURG, Pa. (WHTM) – Attorney General Josh Shapiro announced Tuesday five people are facing charges for allegedly conspiring to provide false information in an attempt to illegally obtain Pandemic Unemployment Assistance (PUA) through the Coronavirus Aid, Relief, and Economic Security Act (CARES) Act.",
    "Through the course of the investigation, the AG’s office says agents learned that seven of the defendants allegedly claimed to have worked for the same trucking company between January 2020 and March 2020, and claimed that their employment ended due to the COVID-19 pandemic.",
    "The alleged co-conspirators are believed to have filed 145 false applications, many of which using a Chester address, that resulted in $925,273 in allegedly false unemployment claims, $455,513 of which was paid out to these defendants.",
    "The FBI, IRS, the U.S Department of Labor – Office of Inspector General, and the Pennsylvania Department of Labor & Industry provided significant assistance in this investigation.",
    "Upon further investigation, prosecutors allege that these individuals did not work for this company nor had any record of being employed in the Commonwealth of Pennsylvania.",
    "Individuals found to be involved with organized efforts to obtain emergency unemployment benefits illegally can face significant prison time and financial penalties.",
    "“This program was designed to help people get back on their feet after the severe disruption caused by the COVID-19 pandemic,” said AG Josh Shapiro.",
    "“These defendants instead targeted Pennsylvania’s program to rip off our residents and took advantage of the public health emergency to cash in.",
    "Individuals who apply for emergency unemployment benefits when they are employed or incarcerated are breaking federal and state law.",
    "The investigation showed nine individuals conspired to illegally obtain PUA funds in excess of $925,000.",
    "This case is being prosecuted by Pennsylvania Deputy Attorney General Suzanne Edwards.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "Sign up for the abc27 newsletters here."
  ]
}