{
  "id": 9813,
  "mediaId": 8322,
  "date": "2022-03-31",
  "headline": "Pennsylvania officer, suspect killed, 2 officers wounded in gunfire exchange",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/5915f140-Lebanon.jpg",
  "link": "https://www.foxnews.com/us/pennsylvania-officer-killed",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    6506,
    6303,
    6208
  ],
  "sentences": [
    "The shooting occurred in Lebanon, about 30 miles east of Harrisburg, where officers responded to reports of a domestic disturbance just after 3:35 p.m. at the 1100 block of Forest Street, Lebanon Mayor Sherry Capello told reporters.",
    "The Pennsylvania Democrat Party said that \"tragic events like today’s are a reminder that men and women of law enforcement heroically put themselves in harm’s way every day.\"",
    "Pennsylvania state Sen. Chris Gebhard, a Republican, offered his prayers to any Lebanon officers injured and their families.",
    "A Pennsylvania police officer and suspect were killed Thursday and two other officers were wounded, authorities said.",
    "\"With the help of our families and every other law enforcement officer around this country, we’ll get through it.",
    "The suspect was not identified but was described by Lebanon police Chief Todd Breiner as a 34-year-old man.",
    "Just after 4:20 p.m., there was a gunfire exchange between officers and a gunman, she said.",
    "\"A sobering reminder of the dangers our brave men and women in uniform face day after day.",
    "State Attorney General Josh Shapiro tweeted his support of the officers.",
    "\"This is an extremely difficult moment for everyone,\" Capello said.",
    "Both of the surviving officers were in hospitals Thursday night.",
    "\"My heart goes out to Lebanon City Police Department,\" he wrote.",
    "Capello said another news conference will be held tomorrow.",
    "One remains in critical condition and the other was stable.",
    "And they keep showing up, running *towards* danger anyway.",
    "My thoughts are with the officers and their families.\"",
    "\"Our guys are strong, but we’re human,\" Breiner said.",
    "Authorities declined to provide information.",
    "One officer and the suspect both died."
  ]
}