[
  {
    "id": 4518,
    "mediaId": 129,
    "date": "d2022-05-13T13:04:38",
    "sentence": "The opponent, a QAnon-linked retired military officer and state senator, <span class='selected-term'>Doug Mastriano</span>, is leading the nine-person field by about 10 percentage points, according to the RealClearPolitics average of polls in the race.",
    "author": "",
    "title": "Pence will headline a rally for Kemp in Georgia, splitting with Trump.",
    "sentiment": "0.0"
  },
  {
    "id": 4483,
    "mediaId": 238,
    "date": "d2022-05-17T19:09",
    "sentence": "Thats what could happen in Pennsylvania, where state Sen. <span class='selected-term'>Doug Mastriano</span> and Kathy Barnette could capture the partys nods for governor and U.S. senator, respectively.",
    "author": "Henry Olsen",
    "title": "Opinion Republicans have only themselves to blame for unelectable big lie candidates",
    "sentiment": "0"
  },
  {
    "id": 4473,
    "mediaId": 195,
    "date": "d2022-05-18T09:16",
    "sentence": "Trump backed Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> (R) only in the closing days of the Commonwealths primary, long after it became clear Mastriano  who was in Washington during the Jan. 6 insurrection  would win the Republican nod.",
    "author": "Reid Wilson",
    "title": "Governors races spoil Trumps once-unblemished endorsement record",
    "sentiment": "0.0"
  },
  {
    "id": 4468,
    "mediaId": 129,
    "date": "d2022-05-18T22:38",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0"
  },
  {
    "id": 4469,
    "mediaId": 129,
    "date": "d2022-05-18T22:38",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0"
  },
  {
    "id": 6605,
    "mediaId": 33,
    "date": "d2022-05-19T00:00",
    "sentence": "The former President waited until later in the campaign to throw his weight behind Vance in Ohio and gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> in Pennsylvania, and he would be late to intervene if he endorses Britt or Durant in Alabama in the coming days.",
    "author": "Gabby Orr",
    "title": "Trump may hold off on more endorsements for coming primaries, advisers say",
    "sentiment": "0.0"
  },
  {
    "id": 6608,
    "mediaId": 234,
    "date": "d2022-05-19T00:00",
    "sentence": "It helped Pennsylvanias <span class='selected-term'>Doug Mastriano</span> claim a double-digit victory in his Republican gubernatorial race.",
    "author": "Eric Lutz",
    "title": "Donald Trumps Georgia Revenge Fantasy Isnt Quite Panning Out",
    "sentiment": "0.0"
  },
  {
    "id": 4458,
    "mediaId": 129,
    "date": "d2022-05-19T13:29:47",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0"
  },
  {
    "id": 6583,
    "mediaId": 195,
    "date": "d2022-05-19T21:30",
    "sentence": "The contest for governor will feature the Democratic Attorney General Ben Shapiro and GOP State Sen. <span class='selected-term'>Doug Mastriano</span>, another Republican endorsed by Trump.",
    "author": "Brad Bannon",
    "title": "Party primaries test power of Trumps backing and progressive platform",
    "sentiment": "0.0"
  },
  {
    "id": 6582,
    "mediaId": 323,
    "date": "d2022-05-19T22:37",
    "sentence": "Open Queue\nThis weeks conventional wisdom holds that state Sen. <span class='selected-term'>Doug Mastriano</span> won the Pennsylvania Republican gubernatorial primary by inciting voters with claims of a stolen 2020 election.",
    "author": "Kimberley A. Strassel",
    "title": "The Limits of Stop the Steal",
    "sentiment": "0"
  },
  {
    "id": 6575,
    "mediaId": 129,
    "date": "d2022-05-20T00:00",
    "sentence": "The Republican nominee for governor in Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, won his race on the strength of his enthusiastic support for Donald Trumps effort to subvert and overturn the results of the 2020 presidential election.",
    "author": "",
    "title": "Its Trumps Party, and Hell Lie if He Wants To",
    "sentiment": "0.0"
  },
  {
    "id": 6539,
    "mediaId": 409,
    "date": "d2022-05-20T09:47",
    "sentence": "That count doesn't include the endorsement of Oz yet, or <span class='selected-term'>Doug Mastriano</span> in the GOP gubernatorial primary, because Trump endorsed Mastriano three days before the election, when polling indicated Mastriano was well ahead.",
    "author": "Jim Geraghty",
    "title": "Trump's Gambling Isn't Paying Off",
    "sentiment": "0.506"
  },
  {
    "id": 6538,
    "mediaId": 195,
    "date": "d2022-05-20T10:00",
    "sentence": "In Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, who backs Trump's false claims of election fraud and marched to the Capitol on Jan. 6, will be the GOP's gubernatorial candidate.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump faces critical popularity test in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 6532,
    "mediaId": 21,
    "date": "d2022-05-20T19:00",
    "sentence": "Trump boasted another win with the victory of state Sen. <span class='selected-term'>Doug Mastriano</span>, an additional endorsement that roiled some Pennsylvania Republicans due to the candidate's extreme views.",
    "author": "Grace Panetta",
    "title": "Trump may stop endorsing candidates for competitive GOP primaries, report says: 'This is not how he expected this to go'",
    "sentiment": "0.0"
  },
  {
    "id": 7224,
    "mediaId": 129,
    "date": "d2022-05-22T00:00",
    "sentence": "Vance, the Hillbilly Elegy? author and U.S. Senate candidate from Ohio, and <span class='selected-term'>Doug Mastriano</span>, a candidate for Pennsylvania governor who echoes Mr. Trumps untrue claims of election fraud.",
    "author": "",
    "title": "What Donald Trump Didnt Count On in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7194,
    "mediaId": 136,
    "date": "d2022-05-22T19:11",
    "sentence": "Vance, Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> and North Carolina Senate candidate Ted Budd all won their primaries.",
    "author": "Andrew Stanton",
    "title": "Trump Endorsement More 'Matchbox Car' Than 'Freight Train': Geoff Duncan",
    "sentiment": "0.0"
  },
  {
    "id": 7329,
    "mediaId": 33,
    "date": "d2022-05-23T00:00",
    "sentence": "And his falsehoods about election fraud have paved the way for restrictive new voting laws in states such as Georgia, Florida, Texas and Iowa, and have led to the party nominating candidates such as state Sen. <span class='selected-term'>Doug Mastriano</span>, an election denier, for Pennsylvania governor, positioning them to potentially take over the election machinery of key swing states if they win in November.",
    "author": "Eric Bradner",
    "title": "Republicans look to Georgia for a path beyond Trump's 2020 grievances",
    "sentiment": "0.0"
  },
  {
    "id": 7288,
    "mediaId": 136,
    "date": "d2022-05-23T13:35",
    "sentence": "The races are being closely watched to see if more far-right candidates across the country can follow in the footsteps of <span class='selected-term'>Doug Mastriano</span>, who won Pennsylvania's Republican primary race for governor last week by running a campaign focused on pushing Trump's election falsehoods.",
    "author": "Daniel Bush",
    "title": "Georgia Primaries Will Test Trump's Revenge Campaign Against GOP Incumbents",
    "sentiment": "0.0"
  },
  {
    "id": 7326,
    "mediaId": 1546,
    "date": "d2022-05-23T17:21",
    "sentence": "Last week, Trump-endorsed <span class='selected-term'>Doug Mastriano</span>, who supports Trump's claims of election fraud, won the Pennsylvania gubernatorial nomination.",
    "author": "Ken Bredemeier",
    "title": "Trump's Election Fraud Claims Face a Test in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7481,
    "mediaId": 147,
    "date": "d2022-05-23T22:40",
    "sentence": "You have someone like <span class='selected-term'>Doug Mastriano</span> in Pennsylvania, who is  part of his stock and trade and what made him a promising candidate for the Republicans is and what got him Trump's endorsement is his really strong commitment to the big lie, the fact that he went on January 6 to Washington, D.C., and marched toward the Capitol, though he says he didn't go in or he didn't break the law.",
    "author": "PBS NewsHour",
    "title": "Tamara Keith and Amy Walter on whats at stake in Georgias primary election",
    "sentiment": "0.0"
  },
  {
    "id": 7350,
    "mediaId": 129,
    "date": "d2022-05-24T08:59:18",
    "sentence": "",
    "author": "",
    "title": "Live Updates: What to Watch For in Today's Elections in Georgia and Beyond",
    "sentiment": "0.0"
  },
  {
    "id": 7349,
    "mediaId": 32,
    "date": "d2022-05-24T13:54:55",
    "sentence": "Others, such as Pennsylvania's Republican gubernatorial nominee <span class='selected-term'>Doug Mastriano</span>, received Trump's endorsement right before the election, once they had already emerged as frontrunners.",
    "author": "Kevin Breuninger",
    "title": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch",
    "sentiment": "0.0"
  },
  {
    "id": 7348,
    "mediaId": 238,
    "date": "d2022-05-24T22:40",
    "sentence": "Pennsylvania Republicans last week chose as their gubernatorial nominee <span class='selected-term'>Doug Mastriano</span>, a state senator who marched on the Capitol on Jan. 6 and who wrote his master's thesis on the need for the military to protect the country from a Hitlerian Putsch by the left, The Post's Greg Jaffe reported.",
    "author": "Dana Milbank",
    "title": "Opinion As Trump loses kingmaker status, he becomes more dangerous",
    "sentiment": "0"
  },
  {
    "id": 7345,
    "mediaId": 1576,
    "date": "d2022-05-25T00:00",
    "sentence": "Trump has scored some primary victories with election deniers  most significantly last week in Pennsylvania, when Republican voters there chose his preferred gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, who said he wouldn't have certified Biden's 2020 win of the state.",
    "author": "",
    "title": "Takeaways: Trump's big primary defeat; scandals for the win",
    "sentiment": "0.0"
  },
  {
    "id": 8468,
    "mediaId": 151,
    "date": "d2022-05-26T18:05",
    "sentence": "Some Republican candidates are true believers, like Pennsylvania gubernatorial nominee <span class='selected-term'>Doug Mastriano</span> and the out-of-nowhere serious contender for the Senate nomination in Pennsylvania, Kathy Barnette, both of whom were outside the U.S. Capitol on Jan. 6.",
    "author": "",
    "title": "Why Trump's Fantasies Couldn't Doom Kemp and Raffensperger",
    "sentiment": "0.0"
  },
  {
    "id": 8426,
    "mediaId": 881,
    "date": "d2022-05-27T08:22",
    "sentence": "And Pennsylvania Republicans just nominated state Sen. <span class='selected-term'>Doug Mastriano</span>, a Christian nationalist who attended the Jan. 6 riot, for governor.",
    "author": "Todd Zwillich",
    "title": "Trump's Candidates Took a Beating in GeorgiaBut Don't Get Too Excited",
    "sentiment": "0.0"
  },
  {
    "id": 8498,
    "mediaId": 129,
    "date": "d2022-05-28T00:00",
    "sentence": "",
    "author": "",
    "title": "The Good News in Georgia Thats Bad News for Trump",
    "sentiment": "0"
  }
]