[
  {
    "id": 7054,
    "mediaId": 237,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span>, who made headlines for his efforts to review the integrity of the 2020 election, entered the race at an event in Gettysburg that also featured former Trump national security adviser Michael Flynn and Jenna Ellis, who was a senior legal adviser to the Trump 2020 campaign.",
    "author": "Elizabeth Faddis",
    "title": "Pennsylvania senator who sought 2020 'forensic' audit announces candidacy for governor",
    "sentiment": "0"
  },
  {
    "id": 7045,
    "mediaId": 65,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "\"If the federal government is not willing to provide extra dollars to communities that have experienced increased strain on their healthcare systems, increased number of students in school districts and education costs and other services within our communities, then they shouldnt be forced to take on more illegal immigrants and the additional financial responsibility,\" he said\nAnother Pennsylvania Republican, state Sen. <span class='selected-term'>Doug Mastriano</span> of Chambersburg, said Thursday he will be co-sponsoring Scavello's legislation.",
    "author": "",
    "title": "Pennsylvania Republicans to draft bill to relocate migrants on Biden DHS flights to Delaware",
    "sentiment": "0"
  },
  {
    "id": 7044,
    "mediaId": 157,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> was outed Thursday after American Oversight requested 2020 election documents in the state that involved the Republican leader.",
    "author": "Sarah K. Burris",
    "title": "Republican Doug Mastriano threatened a Pennsylvania county if they didn't do an election 'audit'",
    "sentiment": "0"
  },
  {
    "id": 7041,
    "mediaId": 237,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "While former President Donald Trump and GOP lawmakers in the state, such as Sen. <span class='selected-term'>Doug Mastriano</span>, welcomed the ruling, Attorney General Josh Shapiro expressed disappointment.",
    "author": "Elizabeth Faddis",
    "title": "Pennsylvania court declares mail-in voting law unconstitutional",
    "sentiment": "0"
  },
  {
    "id": 7042,
    "mediaId": 129,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "I welcome the end of no-excuse mail-in voting in Pennsylvania,? said <span class='selected-term'>Doug Mastriano</span>, a Republican state senator who is also running for governor, in a statement.",
    "author": "",
    "title": "Pennsylvania Court Says States Mail Voting Law Is Unconstitutional",
    "sentiment": "0"
  },
  {
    "id": 7038,
    "mediaId": 43,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Friday, Feb 4, 2022  8:14:13 AM Pacific Standard Time  Jeff Singer\nPA-Gov: Campaign finance reports were due Monday covering all of 2021, and they give us our first real look into which of the many Republican candidates for governor have the resources to run a serious race in this very expensive state:\nState Senate President Pro Tempore Jake Corman: $3 million raised, $2.7 million cash-on-hand\n2018 Senate nominee Lou Barletta: $1.1 million raised, $245,000 cash-on-hand\nU.S. Attorney Bill McSwain: $900,000 raised, additional $100,000 self-funded, $815,000 cash-on-hand\nGOP strategist Charlie Gerow: $420,000 raised, $250,000 cash-on-hand\nformer Chester County Chamber of Business and Industry President Guy Ciarrocchi: $305,000 raised, $240,000 cash-on-hand\nState Sen. Scott Martin: $300,000 raised, $270,000 cash-on-hand\nBusinessman Dave White: $350,000 raised, additional $3 million self-funded, $2.5 million cash-on-hand\nSurgeon Nche Zama: $200,000 raised, $145,000 cash-on-hand\nAttorney Jason Richey: $160,000 raised, additional $1.45 million self-funded, $1.5 million cash-on-hand\nMontgomery County Commissioner Joe Gale: $40,000 raised\nThe list does not include two other declared Republican candidates: former Rep. Melissa Hart, whose numbers were not available days after the deadline, and state Sen. <span class='selected-term'>Doug Mastriano</span>, who announced last month.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 2/4",
    "sentiment": "0"
  },
  {
    "id": 7024,
    "mediaId": 124,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "Among those being subpoenaed are Kelli Ward, the Arizona GOP chair who has already filed suit to block the committee from getting her phone records, and Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span>, an outspoken purveyor of the false claim that there was widespread fraud in the presidential election.",
    "author": "",
    "title": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers",
    "sentiment": "0"
  },
  {
    "id": 7030,
    "mediaId": 237,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "The latest bevy of subpoenas includes those sent to Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> and Arizona state Rep. Mark Finchem, two Trump allies who the committee says boosted efforts to send alternate electors who would vote for Trump.",
    "author": "Virginia Aabram",
    "title": "'False electors' targeted in new round of Jan. 6 committee subpoenas",
    "sentiment": "0"
  },
  {
    "id": 7031,
    "mediaId": 25,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "Mark Finchem, an Arizona state House member, said in a press release the following week that he was there \"to deliver an evidence book and letter to Vice President Pence showing key evidence of fraud in the Arizona Presidential Election, and asking him to consider postponing the award of electors\"\n<span class='selected-term'>Doug Mastriano</span>, a Pennsylvania state senator, publicly called for the Republican-controlled legislature in his state to appoint its own electors to change the outcome of the presidential election there because of \"mounting evidence that the PA presidential election was compromised.\"",
    "author": "Zak Hudak",
    "title": "January 6 committee subpoenas others tied to false elector scheme",
    "sentiment": "0"
  },
  {
    "id": 7019,
    "mediaId": 238,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "Arizona Republican Party chairwoman Kelli Ward\nArizona state Rep. Mark Finchem (R), who is running for Arizona secretary of state\nPennsylvania state senator and gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> (R)\nFormer Michigan Republican Party chair Laura Cox\nMichael Roman and Gary Brown, the director and deputy director of Election Day operations for Trumps reelection campaign\nThe committee previously subpoenaed Trump electors from multiple states won by Biden that sent paperwork to Washington certifying their votes for Trump,? Tom and Jacqueline write.",
    "author": "",
    "title": "The cyber fight in Ukraine is getting more serious",
    "sentiment": "0"
  },
  {
    "id": 7022,
    "mediaId": 43,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "The subpoenas went to Arizona Republican Party Chairwoman Kelli Ward, a longtime Trump supporter, as well as Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span>, now running for governor there, and Arizona State House Rep. Mark Finchem, now running to be the next secretary of state in Arizona.",
    "author": "",
    "title": "State officials pushing Trump alternate elector scheme come into focus",
    "sentiment": "0"
  },
  {
    "id": 7023,
    "mediaId": 157,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "The House committee investigating the Jan. 6, 2021, attack on the U.S. Capitol and efforts to overturn the 2020 election issued subpoenas for six more people Tuesday, including state Sen. <span class='selected-term'>Doug Mastriano</span>, R-Franklin.",
    "author": "",
    "title": "Trump ally hit with Jan. 6 subpoena as committee digs into GOP's phony electors scheme",
    "sentiment": "0"
  },
  {
    "id": 7017,
    "mediaId": 165,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "As he runs for lieutenant governor, Daniels has the support of <span class='selected-term'>Doug Mastriano</span>, a MAGA-minded legislator and gubernatorial candidate whos a close second in early primary polling.",
    "author": "Hunter Walker",
    "title": "Domestic-Abuse Allegation Haunts Law-and-Order MAGA Candidate",
    "sentiment": "0"
  },
  {
    "id": 7010,
    "mediaId": 65,
    "date": "2/26/2022 12:00:00 AM",
    "sentence": "Another candidate in the primary is <span class='selected-term'>Doug Mastriano</span>, a state senator whos been subpoenaed by the January 6th committee over his possible role in working to change the results of the 2020 presidential election.",
    "author": "Teny Sahakian",
    "title": "Pennsylvania gubernatorial candidate gets private sit-down with Trump at CPAC; will seek endorsement",
    "sentiment": "0"
  },
  {
    "id": 7002,
    "mediaId": 43,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "Theres COVID-19 super-spreader, state Sen. <span class='selected-term'>Doug Mastriano</span>, who participated in the Jan. 6 festivities and has had to face calls for his resignation and an investigation for his part of the attempted coup detat.",
    "author": "",
    "title": "Some in MAGAworld think hes JFK Jr. resurrected, so of course this QAnon star is running for Senate",
    "sentiment": "0"
  },
  {
    "id": 6994,
    "mediaId": 19,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "Recent polls show the Republican primary race as very much a two-man battle between himself and State Sen. <span class='selected-term'>Doug Mastriano</span>.",
    "author": "Hannah Bleau",
    "title": "Exclusive  Gubernatorial Candidate Lou Barletta: Illegal Immigration Ends When Im Governor of Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 6992,
    "mediaId": 157,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Writing for Religion Dispatches, Grand View University professor Thomas Lecaque revealed the strange QAnon undertones in the sermon from a \"gun church\" tied to Republican Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>.",
    "author": "Matthew Chapman",
    "title": "Professor dissects bizarre QAnon sermon from 'gun church' linked to pro-Trump Pennsylvania candidate",
    "sentiment": "0"
  },
  {
    "id": 6993,
    "mediaId": 34,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Subverting Democracy Plan B: <span class='selected-term'>Doug Mastriano</span>\nThe second phase of the subversion plan contemplated that Congress might not accept the phony Trump electors when it met to certify Biden's election on January 6, 2021.",
    "author": "Steven Harper",
    "title": "The War on Democracy Is Here",
    "sentiment": "0"
  },
  {
    "id": 6983,
    "mediaId": 675,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "U.S. Sen. Ron Johnson of Wisconsin and Pennsylvania State Sen. <span class='selected-term'>Doug Mastriano</span> met with members of the convoy to talk about their goals.",
    "author": "Michael Letts",
    "title": "Do D.C. Democrats fear the convoy truckers?",
    "sentiment": "0"
  },
  {
    "id": 6984,
    "mediaId": 675,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "U.S. Sen. Ron Johnson of Wisconsin and Pennsylvania State Sen. <span class='selected-term'>Doug Mastriano</span> met with members of the convoy to talk about their goals.",
    "author": "Michael Letts",
    "title": "Do D.C. Democrats fear the convoy truckers?",
    "sentiment": "0"
  },
  {
    "id": 6979,
    "mediaId": 19,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "Recent polls, Barletta said, are a reflection on what were seeing on the ground,? as he has a huge grassroots campaign.?\nA poll conducted by the Trafalgar Group from February 1 to 4 among 1,070 likely Republican primary voters found Barletta leading state Sen. <span class='selected-term'>Doug Mastriano</span> by 4.2 percent, receiving 24.1 percent support compared to Mastrianos 19.9 percent.",
    "author": "Katherine Hamilton",
    "title": "Report: Pennsylvania State Sen. Doug Mastriano Wanted Government to Publicly Report Identities of Everyone Who Got Coronavirus",
    "sentiment": "0"
  },
  {
    "id": 6976,
    "mediaId": 43,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "The four Republican frontrunners whove registered at more than 10% in recent polling  former U.S. attorney Bill McSwain, State Sen. <span class='selected-term'>Doug Mastriano</span>, former U.S. Rep. Lou Barletta and businessman Dave White  brought in a combined $4.62 million from Jan. 1 to March 28, according to new campaign finance filings.",
    "author": "",
    "title": "While The GOP Primary Is A MAGA Sh*t Show, Josh Shapiro (D) Brings In $4.5 Million Q1 Haul",
    "sentiment": "0"
  },
  {
    "id": 6974,
    "mediaId": 65,
    "date": "4/8/2022 12:00:00 AM",
    "sentence": "The legislation, in the form of an amendment to the Money Transmission Business Licensing Law of 1965, was sponsored by 2022 gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a state senator from Gettysburg.",
    "author": "",
    "title": "Pennsylvania Republicans seek to levy illegal immigrants' remittances to fund property tax relief",
    "sentiment": "0"
  },
  {
    "id": 6968,
    "mediaId": 157,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "And, theres an excellent chance the nuttiest bunny of them all, <span class='selected-term'>Doug Mastriano</span>, is going to win the primary.\"",
    "author": "Matthew Chapman",
    "title": "Former Ted Cruz staffer slams Pennsylvania GOP: Every governor candidate is an 'election conspiracist' down the 'rabbit hole'",
    "sentiment": "0"
  },
  {
    "id": 6961,
    "mediaId": 65,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "The legislation, in the form of an amendment to the Money Transmission Business Licensing Law of 1965, was sponsored by 2022 gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a state senator from Gettysburg.",
    "author": "Elizabeth Heckman",
    "title": "Pennsylvania gubernatorial candidate: Illegal immigrant workers are skipping taxes, should have to 'pay up'",
    "sentiment": "0"
  },
  {
    "id": 6962,
    "mediaId": 43,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "The Republican governors race also remains close with state Sen. <span class='selected-term'>Doug Mastriano</span>, R-33, Franklin County, at 15%; former U.S. Attorney Bill McSwain, 12%; former congressman and Hazleton Mayor Lou Barletta, 10%; HVAC company owner Dave White, 5%; former congresswoman Melissa Hart and Montgomery County Commissioner Joe Gale, each 3%; former state Senate President Pro Tempore Jake Corman, R-33, Centre County, 2%; communications consultant Charlie Gerow, 1%; and cardiothoracic surgeon Nche Zama, 0%.",
    "author": "",
    "title": "New F&M Poll Gives John Fetterman (D) A Double Digit Lead In The Democratic Primary",
    "sentiment": "0"
  },
  {
    "id": 6955,
    "mediaId": 19,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "The poll found that Pennsylvanias GOP primary for governor is also statistically tied between candidates <span class='selected-term'>Doug Mastriano</span> and former Rep. Lou Barletta.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Poll: Oz Takes Slight Lead in PA Senate Primary, Locked in Statistical Tie with McCormick",
    "sentiment": "0"
  },
  {
    "id": 6957,
    "mediaId": 656,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Senator <span class='selected-term'>Doug Mastriano</span> (R-Gettysburg) introduced Senate Bill (SB) 1158 on March 24.",
    "author": "",
    "title": "Pennsylvania State Senator Proposes Fee for Remittances",
    "sentiment": "0"
  },
  {
    "id": 6954,
    "mediaId": 675,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "(RED VOICE MEDIA)  In March of 2022, Pennsylvania Senator <span class='selected-term'>Doug Mastriano</span> held a panel discussing Covid-19, treatments, and related topics.",
    "author": "WND News Services",
    "title": "Dr. Bryan Ardis: Remdesivir was never 'safe' and Fauci knew it",
    "sentiment": "0"
  },
  {
    "id": 6949,
    "mediaId": 237,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Other Republican candidates in the race include state Sen. <span class='selected-term'>Doug Mastriano</span>, a combat veteran who has sought to campaign as a supporter of Trump.",
    "author": "Kate Scanlon",
    "title": "Pennsylvania GOP gubernatorial candidates vie to show strongest fealty to Trump",
    "sentiment": "0"
  },
  {
    "id": 6947,
    "mediaId": 43,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "One of them is State Sen. <span class='selected-term'>Doug Mastriano</span>, a Trump-loving guy who attended the Jan. 6 insurrection at the Capitol in Washington last year.",
    "author": "",
    "title": "Is Pennsylvania a Dead State Walking?",
    "sentiment": "0"
  },
  {
    "id": 6940,
    "mediaId": 881,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Other speakers included former Trump attorney Jenna Ellis, Trump-endorsed Maryland GOP gubernatorial candidate and Delegate Dan Cox, and Pennsylvania gubernatorial candidate and state Sen. <span class='selected-term'>Doug Mastriano</span>and Michael Peroutka, a pro-secession Confederate sympathizer who is running as a Republican to be attorney general of Maryland.",
    "author": "Cameron Joseph",
    "title": "Trumps Spokeswoman Calls For Arrests Over 2020 Election at QAnon Rally",
    "sentiment": "0"
  },
  {
    "id": 6943,
    "mediaId": 157,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The candidate, state Sen. <span class='selected-term'>Doug Mastriano</span>, attended the conference called Patriots Arise for God and Country,? according to Right Wing Watch, a website that monitors the far right.",
    "author": "John L. Micek",
    "title": "Pennsylvania GOP governor hopeful Doug Mastriano campaigned at event promoting QAnon",
    "sentiment": "0"
  },
  {
    "id": 6913,
    "mediaId": 43,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "And for good reason:\nGOP gubernatorial candidate state Sen. <span class='selected-term'>Doug Mastriano</span> abruptly ended a podcast interview with Delaware Valley Journal, angry over questions about his participation in a rally linked to QAnon conspiracy advocates.",
    "author": "",
    "title": "New F&M Poll Has John Fetterman (D) Increasing His Lead In The Democratic Primary",
    "sentiment": "0"
  },
  {
    "id": 6900,
    "mediaId": 237,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Just In...\nDemocrat Josh Shapiro wants <span class='selected-term'>Doug Mastriano</span> to win the Pennsylvania Republican primary for governor on May 17.",
    "author": "Salena Zito",
    "title": "In Pennsylvania, a Doug Mastriano win would cost the GOP the House and Senate in that state",
    "sentiment": "0"
  },
  {
    "id": 6903,
    "mediaId": 237,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Democratic gubernatorial candidate Pennsylvania Attorney General Josh Shapiro recently launched a campaign advertisement designed to boost state Sen. <span class='selected-term'>Doug Mastriano</span>, a Republican candidate some in the party worry may not fare well in the general election.",
    "author": "Kate Scanlon",
    "title": "Shapiro ad seeks to boost Doug Mastriano in Pennsylvania gubernatorial contest",
    "sentiment": "0"
  },
  {
    "id": 6904,
    "mediaId": 558,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Im going to go see my son.?\nDaniels, 47, is one of nine candidates seeking the GOP nomination in the states May 17 primary, running with the endorsement of a leading candidate for governor, Republican state Sen. <span class='selected-term'>Doug Mastriano</span>.",
    "author": "",
    "title": "Protective order against lieutenant gov candidate tossed",
    "sentiment": "0"
  },
  {
    "id": 6905,
    "mediaId": 239,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Im going to go see my son.?\nDaniels, 47, is one of nine candidates seeking the GOP nomination in the states May 17 primary, running with the endorsement of a leading candidate for governor, Republican state Sen. <span class='selected-term'>Doug Mastriano</span>.",
    "author": "Michael Rubinkam",
    "title": "Protective order against lieutenant gov candidate tossed",
    "sentiment": "0"
  },
  {
    "id": 6892,
    "mediaId": 129,
    "date": "5/8/2022 12:00:00 AM",
    "sentence": "Lou Barletta, a former congressman and one of two front-runners in the race, has said he would sign any bill that comes to my desk that would protect the life of the unborn.?\nAnother top candidate, <span class='selected-term'>Doug Mastriano</span>, said in a recent debate that he was opposed to any exceptions  for rape, incest or the health of the mother  in an abortion ban.",
    "author": "",
    "title": "Midterms Biggest Abortion Battleground: Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 6878,
    "mediaId": 98,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "Their closing line is if Mastriano wins, its a win for what Donald Trump stands for.?\n<span class='selected-term'>Doug Mastriano</span> will drag our commonwealth backward with an extreme agenda; he belongs nowhere near the governorship,? Shapiros campaign said in a statement.",
    "author": "MARC LEVY",
    "title": "GOP fears far-right candidate will be Pennsylvania governor nominee",
    "sentiment": "0"
  },
  {
    "id": 6880,
    "mediaId": 65,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "Gottheimer isnt the only Democrat who appears to be throwing up primary smokescreens trying to tie Republicans to Trump  the Pennsylvania gubernatorial race is seeing television ads from the presumptive Democrat nominee, state Attorney General Josh Shapiro, targeting GOP state Sen. <span class='selected-term'>Doug Mastriano</span> as \"one of Donald Trumps strongest supporters.\"",
    "author": "",
    "title": "Moderate Dem accused of trying to 'confuse' GOP primary voters with mailers tying candidate to Trump",
    "sentiment": "0"
  },
  {
    "id": 5582,
    "mediaId": 129,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "With less than a week until the states primary election on Tuesday, polls show that State Senator <span class='selected-term'>Doug Mastriano</span>  one of the states central figures in the former presidents efforts to overturn the 2020 election  has emerged as the clear front-runner in the G.O.P.",
    "author": "",
    "title": "Hard-Liners Gain in Pennsylvania G.O.P. Races, Worrying Both Parties",
    "sentiment": "0"
  },
  {
    "id": 6865,
    "mediaId": 323,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Next week Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> might pull off the same trick in the primary for Governor, and Democrats couldnt be happier to help him do it.",
    "author": "The Editorial Board",
    "title": "The Mastriano Pileup in the Pennsylvania Elections",
    "sentiment": "0"
  },
  {
    "id": 6866,
    "mediaId": 409,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "The governors race poll has <span class='selected-term'>Doug Mastriano</span> with a ten-point lead, 27.6 percent to Lou Barlettas 17.6 percent, with Dave White at 15.1 percent, William McSwain at 14.4 percent, 11.3 percent undecided, and four candidates in single digits.",
    "author": "Dan McLaughlin",
    "title": "Pennsylvanias Senate Enigma",
    "sentiment": "0"
  },
  {
    "id": 6872,
    "mediaId": 157,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Last week when the presumptive [Democratic] nominee, Josh Shapiro, and the State Democratic Party used campaign resources to assist the candidacy of <span class='selected-term'>Doug Mastriano</span> in the Republican primary, it raised concerns among the campaigns.",
    "author": "Meaghan Ellis",
    "title": "Pennsylvania GOP scrambling behind closed doors to ensure Trump-backed candidate loses",
    "sentiment": "0"
  },
  {
    "id": 6853,
    "mediaId": 238,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "This question arises now that <span class='selected-term'>Doug Mastriano</span> is surging in the GOP primary for Pennsylvania governor.",
    "author": "Greg Sargent",
    "title": "Opinion An openly pro-coup Trumpist could become Pennsylvanias next governor",
    "sentiment": "0"
  },
  {
    "id": 6859,
    "mediaId": 129,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "Recent polling shows State Senator <span class='selected-term'>Doug Mastriano</span>, a retired Army colonel with a Ph.D. in history, leading the rest of the Republican candidates.",
    "author": "",
    "title": "The Most Pivotal Elections in 2022 Are Not the Ones You Think",
    "sentiment": "0"
  },
  {
    "id": 3326,
    "mediaId": 157,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "But the GOP's frontrunner for governor in Pennsylvania's crowded May 17 primary field, state Sen. <span class='selected-term'>Doug Mastriano</span>, is an entirely different Republican: a man of deep religious and political convictions who, if he wins the nomination and the general election, could be problematic for Americans who do not want elected officials to impose their personal beliefs on the wider public, whether the topic is abortion, vaccines, denying election results, or calling on God's help to seize political power.",
    "author": "",
    "title": "Another extreme wing of the Republican Party is emerging  and it's not all Trump",
    "sentiment": "0"
  },
  {
    "id": 6846,
    "mediaId": 19,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "As National Committeeman, I have spoken regularly with almost all of the gubernatorial campaigns over the past [three] months,? Andy Reilly told Politico:\nLast week when the presumptive [Democratic] nominee, Josh Shapiro, and the State Democratic Party used campaign resources to assist the candidacy of <span class='selected-term'>Doug Mastriano</span> in the Republican primary, it raised concerns among the campaigns.",
    "author": "John Binder",
    "title": "7 Issues Facing Doug Mastriano in Pennsylvania Governor Race",
    "sentiment": "0"
  },
  {
    "id": 6847,
    "mediaId": 157,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "On Friday, Axios reported that former President Donald Trump is considering giving an endorsement of <span class='selected-term'>Doug Mastriano</span> for governor of Pennsylvania.",
    "author": "Matthew Chapman",
    "title": "Democrats are 'salivating': Trump considers backing pro-QAnon Capitol riot witness for PA governor",
    "sentiment": "0"
  },
  {
    "id": 6849,
    "mediaId": 19,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "Pennsylvania Attorney General Josh Shapiro (D), who will face a Republican opponent in the gubernatorial election in November, is currently running an ad to boost GOP primary candidate <span class='selected-term'>Doug Mastriano</span> based on the perception that he would be the easiest to defeat, the New York Times reports.",
    "author": "John Binder",
    "title": "NY Times: Democrat Runs Ad Intended to Help Doug Mastriano Win Pennsylvania GOP Gubernatorial Primary",
    "sentiment": "0"
  },
  {
    "id": 3399,
    "mediaId": 409,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Today, Donald Trump endorsed <span class='selected-term'>Doug Mastriano</span> for governor in Tuesdays Pennsylvania Republican primary.",
    "author": "Fred Bauer",
    "title": "Trump as GOP Kingmaker",
    "sentiment": "0"
  },
  {
    "id": 5541,
    "mediaId": 323,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Ms. Barnette has the support of state Sen. <span class='selected-term'>Doug Mastriano</span>, the front-runner in the crowded Republican primary for governor.",
    "author": "John McCormick",
    "title": "Kathy Barnette Scrambles Pennsylvania GOP Senate Primary, Drawing Trump Ire",
    "sentiment": "0"
  },
  {
    "id": 6820,
    "mediaId": 195,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "He also endorsed state Sen. <span class='selected-term'>Doug Mastriano</span> (R) in Pennsylvanias governor race and California State Assembly member Kevin Kiley in the House race in Californias 3rd Congressional District ahead of the states June 7 primary election.",
    "author": "Caroline Vakil",
    "title": "Trump makes series of Saturday endorsements",
    "sentiment": "0"
  },
  {
    "id": 6822,
    "mediaId": 136,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump endorsed Pennsylvania's Republican gubernatorial hopeful <span class='selected-term'>Doug Mastriano</span> on Saturday, just days before he faces off against GOP opponents in the state's primary on Tuesday.",
    "author": "Jason Lemon",
    "title": "Trump-Endorsed Doug Mastriano's Chances of Beating GOP Rivals: Polls",
    "sentiment": "0"
  },
  {
    "id": 6824,
    "mediaId": 558,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "When asked to clarify his views on abortion in the Saturday interview, Oz distanced himself from for Pennsylvania governor, <span class='selected-term'>Doug Mastriano</span>, a far-right conservative who has called abortion the No.",
    "author": "STEVE PEOPLES",
    "title": "'Reprehensible': Oz condemns GOP opponent's tweet on Islam",
    "sentiment": "0"
  },
  {
    "id": 6825,
    "mediaId": 147,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "HARRISBURG, Pa. (AP)  Donald Trump on Saturday endorsed <span class='selected-term'>Doug Mastriano</span> in Pennsylvanias Republican primary for governor, siding with a far-right candidate who was outside the U.S. Capitol during the Jan. 6 insurrection and has worked with determination to overturn the results of the 2020 presidential election.",
    "author": "Marc Levy",
    "title": "Trump endorses Doug Mastriano ahead of Pennsylvania GOP governor primary",
    "sentiment": "0"
  },
  {
    "id": 6827,
    "mediaId": 65,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Former President Trump threw his support behind Republican <span class='selected-term'>Doug Mastriano</span> for Pennsylvania governor just three days before the primary election, citing Mastriano's efforts to go after the 2020 election \"theft.\"",
    "author": "Marisa Schultz",
    "title": "Pennsylvania governor's race: Trump endorses Mastriano over Barletta in GOP primary",
    "sentiment": "0"
  },
  {
    "id": 6829,
    "mediaId": 136,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump endorsed <span class='selected-term'>Doug Mastriano</span> in Pennsylvania's GOP gubernatorial primary Saturday, again alienating state leaders in the Republican Party.",
    "author": "Andrew Stanton",
    "title": "Trump Further Alienates Pennsylvania GOP by Backing Mastriano for Governor",
    "sentiment": "0"
  },
  {
    "id": 6830,
    "mediaId": 151,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "| Matt Rourke/AP Photo\nBy Zach Montellaro, Meridith McGraw and Holly Otterbein\n 05/14/2022 09:57 AM EDT\nPennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> on Saturday landed the coveted endorsement of former President Donald Trump with days to go before the gubernatorial primary.",
    "author": "",
    "title": "Trump endorses Mastriano for Pennsylvania governor",
    "sentiment": "0"
  },
  {
    "id": 6831,
    "mediaId": 195,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator <span class='selected-term'>Doug Mastriano</span>,? Trump said in a statement issued through his Save America PAC, before echoing a baseless claim about the 2020 presidential election results.",
    "author": "Caroline Vakil",
    "title": "Trump endorses Doug Mastriano for Pennsylvania governor",
    "sentiment": "0"
  },
  {
    "id": 6834,
    "mediaId": 223,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "President Donald J. Trump announces his Endorsement of <span class='selected-term'>Doug Mastriano</span> for Governor of Pennsylvania pic.twitter.com/HrGKVKb7BY\n Liz Harrington (@realLizUSA) May 14, 2022\nAs I highlighted last July, Mastriano had initiated a forensic audit of the 2020 presidential election, which he outlined in an op-ed posted to his official Senate website.",
    "author": "Rebecca Downs",
    "title": "Donald Trump Made His Endorsement in the PA Gubernatorial Race and People Definitely Have Thoughts",
    "sentiment": "0"
  },
  {
    "id": 6835,
    "mediaId": 558,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "By Pete Schroeder\nWASHINGTON (Reuters) - Former President Donald Trump announced Saturday he was backing Pennsylvania state Senator <span class='selected-term'>Doug Mastriano</span> in that state's 2022 governor's race.",
    "author": "",
    "title": "Trump endorses Mastriano for Pennsylvania governor",
    "sentiment": "0"
  },
  {
    "id": 6839,
    "mediaId": 129,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Former President Donald J. Trump on Saturday endorsed <span class='selected-term'>Doug Mastriano</span>, a retired colonel and state senator who has propagated myriad false claims about the 2020 election and attended the protest leading up to the Capitol riot, in the Republican primary race for governor of Pennsylvania.",
    "author": "",
    "title": "Trump Backs Doug Mastriano, a Far-Right Loyalist, to Lead Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 6840,
    "mediaId": 19,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Republicans across Pennsylvania are questioning former President Trumps last-minute endorsement of State Sen. <span class='selected-term'>Doug Mastriano</span> (R) in the gubernatorial race.",
    "author": "John Binder",
    "title": "Republicans Very Disappointed in Trumps Mastriano Endorsement, Continue Lining Up Behind Lou Barletta",
    "sentiment": "0"
  },
  {
    "id": 6841,
    "mediaId": 19,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "I really hope that Dave White and Bill McSwain would see that as well that Im the one person, Ive been at the top of every poll with <span class='selected-term'>Doug Mastriano</span> since the day I announced.?\nAnd they have spent over $20-something million on their campaigns and havent gotten above me once,? he continued.",
    "author": "John Binder",
    "title": "Exclusive: Pennsylvanias Lou Barletta Calls on Fellow GOP Candidates to Drop Out, Endorse Him in Gubernatorial Race",
    "sentiment": "0"
  },
  {
    "id": 6842,
    "mediaId": 157,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Donald Trump's endorsement of controversial lawmaker <span class='selected-term'>Doug Mastriano</span> to be the Republicans Party's nominee to be the next governor of Pennsylvania got off to a rough start just moments after he made his choice known through his spokesperson on Twitter.",
    "author": "Tom Boggioni",
    "title": "'Too far right: Former adviser slams Trump's endorsement of PA's Mastriano",
    "sentiment": "0"
  },
  {
    "id": 6843,
    "mediaId": 157,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump has endorsed state Sen. <span class='selected-term'>Doug Mastriano</span>, R-Frankin, in Pennsylvanias high-stakes primary for governor, dealing a potentially fatal blow to establishment Republicans who had hoped to head off a victory by the far-right politician who has trafficked in false claims of election fraud.",
    "author": "John L. Micek",
    "title": "Trump endorses Jan. 6 participant in Pa.s GOP governor primary days before election",
    "sentiment": "0"
  },
  {
    "id": 6808,
    "mediaId": 238,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "Leading GOP gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a state senator, has said he would appoint a secretary of state who would require all voters to re-register before casting their ballots, a move that could dramatically reshape the electorate  and would likely violate federal law.",
    "author": "Rosalind S. Helderman",
    "title": "Leading GOP candidates in Pennsylvania were in Washington on Jan. 6",
    "sentiment": "0"
  },
  {
    "id": 6809,
    "mediaId": 409,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "State senator <span class='selected-term'>Doug Mastriano</span> has a solid lead in the latest polling.",
    "author": "The Editors",
    "title": "Throwing Away Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 3387,
    "mediaId": 195,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Pennsylvanias GOP gubernatorial primary\nPennsylvania Republicans appeared poised to nominate state Sen. <span class='selected-term'>Doug Mastriano</span> on Tuesday to take on Democrat Josh Shapiro in the November general election, stirring concern among some GOP officials who fear that Mastriano may prove unelectable.",
    "author": "Max Greenwood",
    "title": "Seven primary races to watch on Tuesday",
    "sentiment": "0"
  },
  {
    "id": 3422,
    "mediaId": 129,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "The far-right candidate, <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded state senator, leads polls ahead of the Tuesday primary.",
    "author": "",
    "title": "A Republican megadonor scrambled to stop Doug Mastriano in the Pennsylvania governor's race.",
    "sentiment": "0"
  },
  {
    "id": 3434,
    "mediaId": 25,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "State Senator <span class='selected-term'>Doug Mastriano</span>, the leading candidate for the Republican gubernatorial nomination, was subpoenaed in February by the House Select Committee investigating the Jan. 6 attack at the Capitol.",
    "author": "Adam Brewster",
    "title": "Kathy Barnette, Pennsylvania Republican Senate candidate, campaign believes photos of her on Jan. 6 are genuine",
    "sentiment": "0"
  },
  {
    "id": 3538,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "The tally in the Poconos borough that night was overwhelming: state Sen. <span class='selected-term'>Doug Mastriano</span>, 17.",
    "author": "Michelle Boorstein",
    "title": "Christian nationalism is shaping a Pa. primary  and a GOP shift",
    "sentiment": "0"
  },
  {
    "id": 6777,
    "mediaId": 147,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "In the governors race, some Republicans are wringing their hands over the prospect that a far-right candidate, state Sen. <span class='selected-term'>Doug Mastriano</span>, could emerge as the winner in the crowded field.",
    "author": "Associated Press",
    "title": "2022 Pennsylvania Primary Election Results",
    "sentiment": "0"
  },
  {
    "id": 6788,
    "mediaId": 881,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "(Michael M. Santiago/Getty Images)\nMAGA <span class='selected-term'>Doug Mastriano</span> and Kathy Barnette both look poised to win, in what one GOP former congressman calls a double-nightmare scenario.?\nA pair of fringe conspiracy theorists have seized the momentum to be the Republican Partys nominees for governor and senator in Pennsylvaniaa prospect thats alarming to Republicans who think theyll lose the general election, and even more concerning for democracy if they win it in the nations largest swing state.",
    "author": "",
    "title": "A MAGA star is born",
    "sentiment": "0"
  },
  {
    "id": 6790,
    "mediaId": 157,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Fringe candidate <span class='selected-term'>Doug Mastriano</span> has been enthusiastically endorsed by former President Donald Trump and appears likely to prevail in the primary on Tuesday.",
    "author": "Sarah K. Burris",
    "title": "Republicans are already accepting defeat in Pa. governor's race -- and are looking for someone to blame",
    "sentiment": "0"
  },
  {
    "id": 6793,
    "mediaId": 234,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Three weeks after the 2020 election was called for Joe Biden, Pennsylvania State Senator <span class='selected-term'>Doug Mastriano</span> introduced a resolution to throw out the results of the popular vote and to have the Republican-controlled state chambers appoint their own electorsones that would presumably hand the state to Donald Trump, who was cheated? out of reelection through a corrupt? election process, he said.",
    "author": "Eric Lutz",
    "title": "Pennsylvanias Republican Primary Clown Show Is Coming Down to the Wire",
    "sentiment": "0"
  },
  {
    "id": 6796,
    "mediaId": 157,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "",
    "author": "Matthew Chapman",
    "title": "Pa. Senate GOP candidate Kathy Barnette photographed marching toward Capitol with Proud Boys on Jan. 6",
    "sentiment": "0"
  },
  {
    "id": 6798,
    "mediaId": 157,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Over the weekend, an aide to far-right gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> blocked press members from entering an event with Mastriano and GOP Senate candidate Kathy Barnette.",
    "author": "Sarah K. Burris",
    "title": "Doug Mastriano aide uncovered as Jan. 6 protestor after he blocks press from weekend campaign event",
    "sentiment": "0"
  },
  {
    "id": 3407,
    "mediaId": 323,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Josh Shapiro, the state's attorney general, is unopposed for the Democratic nomination, while state Sen. <span class='selected-term'>Doug Mastriano</span>, a leading figure in pushing the state to review Mr. Biden's victory in the state's 2020 vote count over Mr. Trump, holds a lead in public opinion surveys for the GOP nomination over seven other candidates.",
    "author": "Aaron Zitner",
    "title": "Pennsylvania Senate GOP Contest Headlines Crucial Slate of Primaries",
    "sentiment": "0"
  },
  {
    "id": 3409,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "A late endorsement\nOn Saturday, Trump finally endorsed <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "author": "",
    "title": "Live Updates: What to Watch for in the Pennsylvania and North Carolina Primaries",
    "sentiment": "0"
  },
  {
    "id": 3410,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "A late endorsement\nOn Saturday, Trump finally endorsed <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "author": "",
    "title": "Live Updates: What to Watch for in the Pennsylvania and North Carolina Primaries",
    "sentiment": "0"
  },
  {
    "id": 4483,
    "mediaId": 238,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Thats what could happen in Pennsylvania, where state Sen. <span class='selected-term'>Doug Mastriano</span> and Kathy Barnette could capture the partys nods for governor and U.S. senator, respectively.",
    "author": "Henry Olsen",
    "title": "Opinion Republicans have only themselves to blame for unelectable big lie candidates",
    "sentiment": "0"
  },
  {
    "id": 4490,
    "mediaId": 98,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Election lies pay off  for now\nPennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> proved his loyalty to Trump by relentlessly trying to undermine the 2020 election.",
    "author": "",
    "title": "7 takeaways from primaries in Pennsylvania, North Carolina, Oregon",
    "sentiment": "0"
  },
  {
    "id": 5481,
    "mediaId": 409,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Pennsylvania state senator <span class='selected-term'>Doug Mastriano</span>, who secured former President Trumps endorsement just a few days ago, was declared the victor in the states GOP gubernatorial primary Tuesday night.",
    "author": "Caroline Downey",
    "title": "Trump-Backed Doug Mastriano Wins Pennsylvania GOP Primary for Governor",
    "sentiment": "0"
  },
  {
    "id": 5509,
    "mediaId": 19,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "ET:\nThose 26 Trump endorsements on the line on Tuesday night are as follows, according to Trumps team:\nIdaho-Governor: Janice McGeachin\nIdaho-Senate: Mike Crapo\nIdaho-01: Russ Fulcher\nKentucky-Senate: Rand Paul\nKentucky-01: James Comer\nKentucky-02: Brett Guthrie\nKentucky-04: Thomas Massie\nKentucky-05: Hal Rogers\nKentucky-06: Andy Barr\nNorth Carolina-Senate: Ted Budd\nNorth Carolina-03: Greg Murphy\nNorth Carolina-05: Virginia Foxx\nNorth Carolina-07: David Rouzer\nNorth Carolina-08: Dan Bishop\nNorth Carolina-09: Richard Hudson\nNorth Carolina-10: Patrick McHenry\nNorth Carolina-11: Madison Cawthorn\nNorth Carolina-13: Bo Hines\nPennsylvania-Governor: <span class='selected-term'>Doug Mastriano</span>\nPennsylvania-Senate: Mehmet Oz\nPennsylvania-08: Jim Bognet\nPennsylvania-10: Scott Perry\nPennsylvania-11: Lloyd Smucker\nPennsylvania-13: John Joyce\nPennsylvania-14: Guy Reschenthaler\nPennsylvania-16: Mike Kelly\nUPDATE 7:21 p.m.",
    "author": "Matthew Boyle",
    "title": "*** Election Night Livewire *** Pennsylvania, North Carolina, Kentucky, Idaho, Oregon Vote in Contentious Primaries",
    "sentiment": "0"
  },
  {
    "id": 6459,
    "mediaId": 19,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> (R), endorsed by former President Donald Trump days ago, has won the states Republican gubernatorial primary and will face Democrat Josh Shapiro in the general election.",
    "author": "John Binder",
    "title": "Doug Mastriano Wins Pennsylvania Republican Gubernatorial Primary",
    "sentiment": "0"
  },
  {
    "id": 6715,
    "mediaId": 132,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "HARRISBURG, Pa.  <span class='selected-term'>Doug Mastriano</span> won the Republican nomination for Pennsylvania governor on Tuesday, beating eight other candidates and a party establishment that had tried to head off his nomination over fears that he is too extreme to win the general election in the presidential battleground.",
    "author": "",
    "title": "Trump-backed Mastriano wins GOP Pennsylvania governor nod",
    "sentiment": "0"
  },
  {
    "id": 6716,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "The former president also endorsed <span class='selected-term'>Doug Mastriano</span>, a far-right loyalist who has promoted conspiracy theories and is the leading Republican candidate for governor.",
    "author": "",
    "title": "Your Tuesday Evening Briefing",
    "sentiment": "0"
  },
  {
    "id": 6722,
    "mediaId": 223,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "57% in): PA Governor GOP\n<span class='selected-term'>Doug Mastriano</span>* 293,046 (43%)\nLou Barletta 151,709 (22%)\nBill McSwain 103,520 (15%)\n*Race called for Mastriano\nMore results here: https://t.co/4prVQOLzzB\n Decision Desk HQ (@DecisionDeskHQ) May 18, 2022\nThe GOP tweeted congratulations with regards to Mastriano and noted the party is \"unified\" behind him \"to win in November.\"",
    "author": "Rebecca Downs",
    "title": "Trump's Endorsement Comes Through as State Sen. Doug Mastriano Wins PA Gubernatorial Primary",
    "sentiment": "0"
  },
  {
    "id": 6724,
    "mediaId": 558,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "And in Pennsylvanias GOP race for governor, Trump's endorsed candidate, the far-right <span class='selected-term'>Doug Mastriano</span>, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "author": "",
    "title": "Takeaways: Election denier wins, bad behavior dooms Cawthorn",
    "sentiment": "0"
  },
  {
    "id": 6726,
    "mediaId": 441,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "In Pennsylvanias governors race, Trump has endorsed state Senator <span class='selected-term'>Doug Mastriano</span>, a staunch supporter of his false 2020 election claims, in a crowded Republican primary for the open seat.",
    "author": "Mark Niquette",
    "title": "Pennsylvanias Primary Circus Clatters Toward Unruly Close",
    "sentiment": "0"
  },
  {
    "id": 6727,
    "mediaId": 323,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "It really came down to who I thought could beat Fetterman.?\nIn the governors race, Mr. Mautino said he voted for <span class='selected-term'>Doug Mastriano</span> after the state senator and retired Army colonel drew former President Donald Trumps endorsement on Saturday.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters in Pennsylvania and North Carolina Cast Ballots",
    "sentiment": "0"
  },
  {
    "id": 6728,
    "mediaId": 21,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Pennsylvania Governor Republican Primary\nCounty Results\narrow_drop_down\nCandidate\nVotes\nPercent\n <span class='selected-term'>Doug Mastriano</span> check_circle\n 364,860\n 43.70%\n Lou Barletta\n 181,522\n 21.74%\n William M McSwain\n 127,693\n 15.29%\n David White\n 65,907\n 7.89%\n Melissa Hart\n 38,253\n 4.58%\n Show More Candidates\n* = Incumbent\n 834,994 votes.",
    "author": "Grace Panetta",
    "title": "RESULTS: Republican Doug Mastriano wins Republican primary in a crucial race for Pennsylvania governor",
    "sentiment": "0"
  },
  {
    "id": 6731,
    "mediaId": 558,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "PITTSBURGH  State Sen. <span class='selected-term'>Doug Mastriano</span>, who attended the Jan. 6 Stop the Steal? rally and worked with former President Trumps legal team to overturn the 2020 election results, won the Republican governors primary in Pennsylvania Tuesday night.",
    "author": "Christopher Wilson",
    "title": "Jan. 6 rally attendee Doug Mastriano wins Republican primary for Pennsylvania governor",
    "sentiment": "0"
  },
  {
    "id": 6732,
    "mediaId": 238,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Many in the Republican Party at the state and national level are deeply concerned about <span class='selected-term'>Doug Mastriano</span> and Kathy Barnette becoming the nominees for governor and Senate.",
    "author": "Paul Waldman",
    "title": "Opinion Disturbing primary elections show how the GOP normalizes extremism",
    "sentiment": "0"
  },
  {
    "id": 6733,
    "mediaId": 65,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Barnettes rise in the polls may have been partially fueled by her alliance with Sen. <span class='selected-term'>Doug Mastriano</span>, the polling front-runner for Pennsylvanias GOP gubernatorial primary.",
    "author": "Paul Steinhauser",
    "title": "Oz, Barnette, McCormick cast votes in crucial Pennsylvania GOP Senate primary",
    "sentiment": "0"
  },
  {
    "id": 6737,
    "mediaId": 238,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "On Jan. 6, both the front-runner in Pennsylvanias Republican gubernatorial primary  state Sen. <span class='selected-term'>Doug Mastriano</span> (R)  and one of the leading candidates for the states Republican Senate nomination  Kathy Barnette  were in Washington.",
    "author": "Philip Bump",
    "title": "In a GOP primary, support for Jan. 6 isnt an obstacle. Is it an asset?",
    "sentiment": "0"
  },
  {
    "id": 6740,
    "mediaId": 223,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Aligning with Trump's endorsements would mean voting for <span class='selected-term'>Doug Mastriano</span> and Dr. Oz.",
    "author": "Guy Benson",
    "title": "Place Your Bets: Who Wins the Heated GOP Senate Primary in Pennsylvania Tonight?",
    "sentiment": "0"
  },
  {
    "id": 6741,
    "mediaId": 233,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Taylor Wilson:\nIn Pennsylvania's Republican primary for governor, state Senator <span class='selected-term'>Doug Mastriano</span> leads the pack in polling.",
    "author": "Taylor Wilson",
    "title": "Key races in PA, NC highlight busy primary day, Biden heads to Buffalo: 5 Things podcast",
    "sentiment": "0"
  },
  {
    "id": 6742,
    "mediaId": 409,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Its GOP contest has been a three-way race between Trump-endorsed state Senator <span class='selected-term'>Doug Mastriano</span>, Trump-ally and Congressman Lou Barletta, and former Trump-appointed U.S. Attorney Bill McSwain.",
    "author": "Arjun Singh",
    "title": "Voters Head to the Polls in Closely Watched Primary Races",
    "sentiment": "0"
  },
  {
    "id": 6744,
    "mediaId": 65,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Trump made a late game endorsement on Saturday of state Sen. <span class='selected-term'>Doug Mastriano</span>, the polling front-runner.",
    "author": "",
    "title": "Trump's GOP clout on the line in high profile Republican primaries in Pennsylvania, North Carolina, Idaho",
    "sentiment": "0"
  },
  {
    "id": 6751,
    "mediaId": 943,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "And in Pennsylvanias GOP race for governor, far-right contender <span class='selected-term'>Doug Mastriano</span> was already leading before Trump backed him over the weekend.",
    "author": "WILL WEISSERT",
    "title": "Primary voters head to polls in Pennsylvania, North Carolina and 3 other states: Heres what to watch",
    "sentiment": "0"
  },
  {
    "id": 6753,
    "mediaId": 151,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "With far-right state Sen. <span class='selected-term'>Doug Mastriano</span> on the verge of capturing the Pennsylvania GOP gubernatorial nomination, Republicans are lashing out, furious that he could cost them a shot at a competitive race in the perennial swing state.",
    "author": "",
    "title": "GOP blame game erupts in Pennsylvania governor's race",
    "sentiment": "0"
  },
  {
    "id": 6765,
    "mediaId": 98,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Thats especially true in the perennial political battleground of Pennsylvania, where some Republicans are already worried that state Sen. <span class='selected-term'>Doug Mastriano</span> is too extreme to woo moderates, who are often decisive in general elections there.",
    "author": "WILL WEISSERT",
    "title": "Fetterman easily wins Democratic Senate race in Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 6766,
    "mediaId": 157,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "\"There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator <span class='selected-term'>Doug Mastriano</span>,\" Trump said in his endorsement.",
    "author": "Bob Brigham",
    "title": "Trump-endorsed Jan. 6 protestor Doug Mastriano secures Pa. nomination",
    "sentiment": "0"
  },
  {
    "id": 3484,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, state Sen. <span class='selected-term'>Doug Mastriano</span>, a Trump-endorsed candidate who led an effort to overturn the election in his state and attended the Stop the Steal rally on Jan. 6, 2021, the day a pro-Trump mob attacked U.S. Capitol, won the Republican nomination for governor.",
    "author": "David Weigel",
    "title": "Victories by Mastriano, Budd show potency of Trumps false stolen election claims in GOP",
    "sentiment": "0"
  },
  {
    "id": 3493,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In the governors race, Republican voters chose to nominate <span class='selected-term'>Doug Mastriano</span>, a.k.a.",
    "author": "",
    "title": "Americas Doug Mastriano Problem",
    "sentiment": "0"
  },
  {
    "id": 3494,
    "mediaId": 234,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Eric Lutz",
    "title": "Doug Mastrianos GOP Primary Victory Puts Democracy on the Ballot in Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 4468,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0"
  },
  {
    "id": 4469,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0"
  },
  {
    "id": 4476,
    "mediaId": 943,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "And in Pennsylvanias GOP race for governor, Trumps endorsed candidate, the far-right <span class='selected-term'>Doug Mastriano</span>, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "author": "",
    "title": "Election denier wins GOP nomination for Pennsylvania governor: Takeaways from Tuesdays primaries",
    "sentiment": "0"
  },
  {
    "id": 4479,
    "mediaId": 1576,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "And in Pennsylvanias GOP race for governor, Trumps endorsed candidate, the far-right <span class='selected-term'>Doug Mastriano</span>, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "author": "",
    "title": "Takeaways: Election denier wins, bad behavior dooms Cawthorn",
    "sentiment": "0"
  },
  {
    "id": 5468,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span> was running well ahead of the field with a 29 percent to 17 percent advantage in the Fox News poll and a 42 percent to 24 percent lead in the Emerson poll over former Congressman Lou Barletta just before Trump jumped on the bandwagon.",
    "author": "Keith Naughton",
    "title": "Kasich Effect propping up Trump, but for how long?",
    "sentiment": "0"
  },
  {
    "id": 5473,
    "mediaId": 136,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Khaleda Rahman",
    "title": "How Donald Trump's Candidates Fared in Latest Primary Elections",
    "sentiment": "0"
  },
  {
    "id": 5476,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Trump-endorsed state Sen. <span class='selected-term'>Doug Mastriano</span> also won the nomination for Pennsylvania governor, but he was already well on track to victory before Trump backed him in recent days.",
    "author": "Aaron Blake",
    "title": "6 takeaways from primaries in Pennsylvania, North Carolina and more",
    "sentiment": "0"
  },
  {
    "id": 6475,
    "mediaId": 151,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In a last-minute endorsement that rattled members of Pennsylvanias Republican party, Trump backed Mastriano, a leading force in trying to overturn the 2020 election results who was pictured outside the Capitol on Jan. 6. There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator <span class='selected-term'>Doug Mastriano</span>,? Trump said last week.",
    "author": "",
    "title": "How Trump-backed candidates fared on the busiest primary day",
    "sentiment": "0"
  },
  {
    "id": 6508,
    "mediaId": 25,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "<div>https://www.cbsnews.com/live-updates/primaries-2022-results-pennsylvania-senate-republicans-david-mccormick-dr-oz-north-carolina-idaho-oregon-kentucky/#post-update-5ee836f1</div>\n link copied\nUpdated 9:56 PM\nPennsylvania Governor Republican primary results: CBS News projects <span class='selected-term'>Doug Mastriano</span> wins\nCBS News projects Doug Mastriano wins the Republican primary for governor.",
    "author": "",
    "title": "Pennsylvania, North Carolina, Kentucky, Idaho and Oregon primary results",
    "sentiment": "0"
  },
  {
    "id": 6609,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "As a Pennsylvania state senator and gubernatorial candidate, <span class='selected-term'>Doug Mastriano</span> railed against the rampant fraud that he believes was responsible for Donald Trumps 2020 defeat.",
    "author": "Josh Dawsey",
    "title": "Doug Mastrianos Pa. victory could give 2020 denier oversight of 2024",
    "sentiment": "0"
  },
  {
    "id": 6610,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Some pointed to Budd and <span class='selected-term'>Doug Mastriano</span>, the newly minted GOP Pennsylvania gubernatorial nominee, as two who, while benefiting from Trumps endorsement, could have won their primaries without it.",
    "author": "Julia Manchester",
    "title": "Primaries fuel questions about potency of Trump endorsements",
    "sentiment": "0"
  },
  {
    "id": 6611,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "The aftershocks of Tuesdays big primaries are still rumbling across Pennsylvania, but one impact is already clear: Republican voters choice of <span class='selected-term'>Doug Mastriano</span> in the governors race is giving the G.O.P.",
    "author": "",
    "title": "Republican Panic Grows After Mastriano Wins",
    "sentiment": "0"
  },
  {
    "id": 6613,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Similarly on the GOP gubernatorial side, State Sen. <span class='selected-term'>Doug Mastriano</span> of Chambersburg defeated his closest opponent ex-Rep. Lou Barletta of Hazleton.",
    "author": "",
    "title": "Pennsylvania primary favorites notably bucked party establishments: 'The Five'",
    "sentiment": "0"
  },
  {
    "id": 6614,
    "mediaId": 147,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "]Lisa Desjardins:\nYesterday, Republicans chose one of their most conservative candidates, state Senator <span class='selected-term'>Doug Mastriano</span>, bolstered by a last-minute endorsement from former President Donald Trump.",
    "author": "Lisa Desjardins",
    "title": "Abortion access becomes central issue in Pennsylvanias race for governor",
    "sentiment": "0"
  },
  {
    "id": 6618,
    "mediaId": 323,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Republican gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> gives a victory speech at his election-night party at The Orchards on May 17, 2022 in Chambersburg, Pa.\n Photo: Michael M. Santiago/Getty Images\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nPlayback speed\nListen to article\nLength (5 minutes)\nAD\nLoading advertisement...\n00:00 / 04:35\n1x\nThis article is in your queue.",
    "author": "The Editorial Board",
    "title": "The Democrats Get Their Man in Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 6619,
    "mediaId": 233,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Republicans were sharply divided in Tuesday primaries\n<span class='selected-term'>Doug Mastriano</span>, a state senator and outspoken election denier, won the GOP bid for Pa. governor\nA winner in Pa. said he wouldn't have certified Biden's victory in 2020\nAnalyst says Trump is a \"cancer on the Republican Party\"\nWASHINGTON  If the latest primaries are any indication, the wounds from the 2020 election and the violent insurrection that followed it still run deep  and figure to get worse during the 2022 midterm elections.",
    "author": "David Jackson",
    "title": "In primaries, a spotlight on the unhealed wounds of 2020 - and the ongoing divisions in America",
    "sentiment": "0"
  },
  {
    "id": 6620,
    "mediaId": 151,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "| Carolyn Kaster/AP Photo\nBy Meridith McGraw and Holly Otterbein\n 05/18/2022 05:50 PM EDT\nDonald Trump and some of his top lieutenants spent the last year privately disparaging Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span>.",
    "author": "",
    "title": "Inside the last-minute Trump endorsement that enraged Pa. Republicans",
    "sentiment": "0"
  },
  {
    "id": 6621,
    "mediaId": 943,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span>  who secured a late endorsement from Trump and has trumpeted the former presidents lies about nonexistent, widespread fraud costing him the 2020 election  won the Republican nomination for Pennsylvanias open governors office.",
    "author": "WILL WEISSERT",
    "title": "Pennsylvania Lt. Gov. John Fetterman, who suffered a stroke days before primary, wins Democratic nomination for US Senate",
    "sentiment": "0"
  },
  {
    "id": 6623,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Republican voters overwhelmingly nominated state Sen. <span class='selected-term'>Doug Mastriano</span>, one of the countrys most ardent deniers of the 2020 presidential election result.",
    "author": "Editorial Board",
    "title": "Opinion After the Pennsylvania primary, the threat to U.S. democracy rises",
    "sentiment": "0"
  },
  {
    "id": 6624,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "The most important and frightening outcome is the decision of Pennsylvanias Republicans  by a big margin  to make extremist state Sen. <span class='selected-term'>Doug Mastriano</span> their partys nominee for governor.",
    "author": "E.J. Dionne Jr.",
    "title": "Opinion Tuesday primaries show that Trumpism has metastasized",
    "sentiment": "0"
  },
  {
    "id": 6626,
    "mediaId": 409,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Yesterdays gubernatorial primary elections  won by <span class='selected-term'>Doug Mastriano</span> for the GOP and Josh Shapiro for the Democrats  only made this clearer.",
    "author": "Arjun Singh",
    "title": "In Pennsylvania, Will the 2022 Gubernatorial Election Just Be about the 2020 Presidential Election?",
    "sentiment": "0"
  },
  {
    "id": 6627,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In the gubernatorial election, President Trumps endorsement propelled conservative State Sen. <span class='selected-term'>Doug Mastriano</span> to victory.",
    "author": "David N. Bossie",
    "title": "Pennsylvania proves Republicans still want 'America First'",
    "sentiment": "0"
  },
  {
    "id": 6631,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Now that <span class='selected-term'>Doug Mastriano</span> has won the GOP nomination for governor in Pennsylvania, countless news accounts are describing him with that phrase.",
    "author": "Greg Sargent",
    "title": "Opinion Say it clearly: Republicans just nominated a pro-Trump insurrectionist",
    "sentiment": "0"
  },
  {
    "id": 6633,
    "mediaId": 136,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "\"After 8 years of the disastrous policies of Tom Wolf, Republican voters in Pennsylvania have chosen <span class='selected-term'>Doug Mastriano</span> as their nominee for Governor,\" RGA Executive Director Dave Rexrode said after the gubernatorial primary.",
    "author": "Katherine Fung",
    "title": "Donald Trump Scored Key Ally for 2024 Election Last Night",
    "sentiment": "0"
  },
  {
    "id": 6634,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Trump's grip on the GOP was further illustrated Tuesday night when Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a strong supporter of Trumps repeated attempts the past year and a half to re-litigate his 2020 election loss, won his primary.",
    "author": "Tyler Olson",
    "title": "Stefanik, Mullin introduce House resolution to expunge second Trump impeachment",
    "sentiment": "0"
  },
  {
    "id": 6635,
    "mediaId": 881,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Cameron Joseph",
    "title": "A QAnon-Loving Election Denier Just Won Pennsylvanias GOP Governor Primary",
    "sentiment": "0"
  },
  {
    "id": 6639,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> won the GOP gubernatorial primary after pushing unsubstantiated claims of widespread voter fraud in the 2020 election.",
    "author": "Sarakshi Rai",
    "title": "Kinzinger says Cawthorn loss good for the country",
    "sentiment": "0"
  },
  {
    "id": 6640,
    "mediaId": 323,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Democrats and some Republicans believe that could be the case for <span class='selected-term'>Doug Mastriano</span>, a strong supporter of the former presidents false allegations of widespread fraud in the 2020 presidential election.",
    "author": "John McCormick",
    "title": "Pennsylvania GOP Senate Race Might Be Headed for Recount",
    "sentiment": "0"
  },
  {
    "id": 6642,
    "mediaId": 136,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Right-wing Candidates and the 'Big Lie'\nRight-wing Republican candidates have performed well in Tuesday's elections, in particular Pennsylvania state Senator <span class='selected-term'>Doug Mastriano</span> who will now be the party's nominee for governor.",
    "author": "Darragh Roche",
    "title": "Five Key Takeaways From Primary Election Results",
    "sentiment": "0"
  },
  {
    "id": 6643,
    "mediaId": 558,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "HARRISBURG, Pa. (AP)  <span class='selected-term'>Doug Mastriano</span> is not the only candidate who won a Republican primary on Tuesday after embracing Donald Trump's lie that the 2020 election was stolen.",
    "author": "",
    "title": "How Pa. GOP gov pick could turn election lies into action",
    "sentiment": "0"
  },
  {
    "id": 6644,
    "mediaId": 558,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Election 2022 Pennsylvania Governor\nState Sen. <span class='selected-term'>Doug Mastriano</span>, R-Franklin, a Republican candidate for Governor of Pennsylvania, speaks at a primary night election gathering in Chambersburg, Pa., Tuesday, May 17, 2022.",
    "author": "STEVE PEOPLES",
    "title": "How Pa. GOP gov pick could turn election lies into action",
    "sentiment": "0"
  },
  {
    "id": 6648,
    "mediaId": 21,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Also in Pennsylvania, Trump-endorsed gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, an ardent backer of Trump's baseless claims victory was stolen from him in the 2020 presidential election, won the primary.",
    "author": "Tom Porter",
    "title": "High-profile candidates endorsed by Trump lost their primaries, showing the limits of his power over the party",
    "sentiment": "0"
  },
  {
    "id": 6650,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "The latest results\nIn the primaries for Pennsylvania governor, <span class='selected-term'>Doug Mastriano</span>  a far-right state senator endorsed by Trump  won the Republican nomination, while Josh Shapiro, the state attorney general, won the Democratic race.",
    "author": "",
    "title": "Unfussy and Plain-Spoken",
    "sentiment": "0"
  },
  {
    "id": 6651,
    "mediaId": 169,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Last night, Pennsylvania Republicans nominated a Big Lie proponent and January 6th \"Stop the Steal\" attendee named <span class='selected-term'>Doug Mastriano</span> to run for governor of Pennsylvania in November.",
    "author": "Heather Digby Parton",
    "title": "2022 GOP primaries prove that MAGA is now bigger than Donald Trump",
    "sentiment": "0"
  },
  {
    "id": 6657,
    "mediaId": 233,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In a win for former President Donald Trump, state senator and retired Army colonel <span class='selected-term'>Doug Mastriano</span> won the Republican nomination for governor of Pennsylvania Tuesday night.",
    "author": "David Jackson",
    "title": "Tuesday primary takeaways: Madison Cawthorn loses, election denier wins GOP gov primary in Penn.",
    "sentiment": "0"
  },
  {
    "id": 6658,
    "mediaId": 409,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "This being so, I do not want to hear a single thing from the Democratic Party about the threat? that <span class='selected-term'>Doug Mastriano</span> presents to the Commonwealth of Pennsylvania, or to the republic in general.",
    "author": "Charles C. W. Cooke",
    "title": "The Democrats Wanted Doug Mastriano, and Now Theyve Got Him",
    "sentiment": "0"
  },
  {
    "id": 6660,
    "mediaId": 943,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, a Trump-backed candidate who has spread lies about the 2020 vote count, won the GOP nomination for governor.",
    "author": "Chicago Tribune staff",
    "title": "Daywatch: Heres what the GOP candidates for Illinois governor said at a Tribune Editorial Board session",
    "sentiment": "0"
  },
  {
    "id": 6664,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Election denialism\nAnother of the more emphatic results of the night was notched up by state Sen. <span class='selected-term'>Doug Mastriano</span>, who became the GOPs gubernatorial nominee in Pennsylvania.",
    "author": "Niall Stanage",
    "title": "Winners and losers from Tuesdays primaries",
    "sentiment": "0"
  },
  {
    "id": 6668,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "The same was true for many in the governor's race, where State Sen. <span class='selected-term'>Doug Mastriano</span> of Gettysburg was projected the winner by the Associated Press.",
    "author": "",
    "title": "Conway: Pennsylvania primary GOP bids embraced Trump while Democrats shunned Biden",
    "sentiment": "0"
  },
  {
    "id": 6669,
    "mediaId": 21,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "JD Vance won his primary for the Ohio Senate on May 4, while <span class='selected-term'>Doug Mastriano</span>, a clear front-runner backed by Trump, won his race in the Pennsylvania governor primary.",
    "author": "Cheryl Teh",
    "title": "Madison Cawthorn's loss in his North Carolina primary race undermines the myth surrounding the power of a Trump endorsement",
    "sentiment": "0"
  },
  {
    "id": 6673,
    "mediaId": 21,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "She's also running on an unofficial ticket with Republican gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a state senator and vocal leader in efforts to overturn Trump's election loss in the state.",
    "author": "Grace Panetta",
    "title": "LIVE RESULTS: John Fetterman wins the Democratic primary for Pennsylvania's Senate race",
    "sentiment": "0"
  },
  {
    "id": 6674,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The G.O.P. Senate primary in Pennsylvania remains a tossup as an election denier wins the Republican primary for governor.",
    "sentiment": "0"
  },
  {
    "id": 6676,
    "mediaId": 147,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "HARRISBURG, Pa. (AP)  <span class='selected-term'>Doug Mastriano</span> won the Republican nomination for Pennsylvania governor on Tuesday, beating eight other candidates and a party establishment that had tried to head off his nomination over fears that he is too extreme to win the general election in the presidential battleground.",
    "author": "Associated Press",
    "title": "Trump pick Doug Mastriano wins Pennsylvania GOP primary",
    "sentiment": "0"
  },
  {
    "id": 6677,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Instead of focusing on kitchen-table issues like strengthening the economy and investing in education, <span class='selected-term'>Doug Mastriano</span> is an extremist running on a dangerous agenda that would devastate Pennsylvania families,? said Democratic Governors Association Executive Director Noam Lee.",
    "author": "Tal Axelrod",
    "title": "Mastriano wins Pennsylvania GOP governor primary despite party concerns",
    "sentiment": "0"
  },
  {
    "id": 6680,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "\"Instead of focusing on kitchen-table issues like strengthening the economy and investing in education, <span class='selected-term'>Doug Mastriano</span> is an extremist running on a dangerous agenda that would devastate Pennsylvania families,\" Democrat Governors Association executive director Noam Lee said.",
    "author": "Paul Steinhauser",
    "title": "Fetterman takes Pennsylvania Dem Senate nomination despite stroke, as GOP race too close to call",
    "sentiment": "0"
  },
  {
    "id": 6681,
    "mediaId": 409,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Barnette, who got into some trouble for past anti-Muslim and anti-gay comments, had joined Trump-backed Republican Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> on the campaign trail this past week.",
    "author": "Caroline Downey",
    "title": "Pennsylvania GOP Senate Primary Race Too Close to Call",
    "sentiment": "0"
  },
  {
    "id": 6688,
    "mediaId": 157,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "On Tuesday, May 17, the Big Lie and the Stop the Steal? movement enjoyed a major victory when Pennsylvania State Sen. <span class='selected-term'>Doug Mastriano</span>  a far-right Christian nationalist and QAnon ally  won the 2022 GOP gubernatorial nomination in the Keystone State.",
    "author": "Alex Henderson",
    "title": "A Las Vegas paper just published a stunning editorial: 'We are struggling to identify' Republicans 'who are not an active threat' to democracy",
    "sentiment": "0"
  },
  {
    "id": 6689,
    "mediaId": 178,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Trump is poised to notch several easy wins, including in Pennsylvania's much-watched GOP race for governor, which far-right contender <span class='selected-term'>Doug Mastriano</span> was already leading before the former president backed him over the weekend.",
    "author": "WILL WEISSERT",
    "title": "Election 2022: Budd, Beasley to face off for N.C. Senate",
    "sentiment": "0"
  },
  {
    "id": 6693,
    "mediaId": 157,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "During an interview on CNN, Schmidt said it would perilous to democracy if the state were to elect Trump-backed candidate <span class='selected-term'>Doug Mastriano</span> to be its next governor.",
    "author": "Brad Reed",
    "title": "'Really terrible scenario': Pennsylvania Republican raises alarm about his own party's nominee for governor",
    "sentiment": "0"
  },
  {
    "id": 6705,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "He did endorse <span class='selected-term'>Doug Mastriano</span>, the state senator who won the gubernatorial primary in the state, but only after it was obvious Mastriano was going to win handily.",
    "author": "Philip Bump",
    "title": "Pennsylvania Republicans identify the real kingmaker: Sean Hannity",
    "sentiment": "0"
  },
  {
    "id": 6707,
    "mediaId": 157,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Republicans in Pennsylvania have expressed fears that Trump-backed gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> has no shot in this November's general election.",
    "author": "Sarah K. Burris",
    "title": "Many Republicans think Doug Mastriano is 'a threat to democracy' and secretly 'pray Dems win': Ex-Ted Cruz aide",
    "sentiment": "0"
  },
  {
    "id": 6711,
    "mediaId": 234,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "If youre not familiar with <span class='selected-term'>Doug Mastriano</span>, a quick primer on the state senator turned gubernatorial candidate:\nOn November 5, 2020, he called for the resignation of Kathy Boockvar, the then secretary of the Pennsylvania Commonwealth, claiming that Pennsylvanians no longer feel secure in casting their vote?;\nHe wrote an email to a Department of Justice official, and asked that it be passed on to the then acting attorney general, in which he raised a litany of false and debunked claims of widespread election fraud in Pennsylvania, which Mastriano had previously aired at a November 25, 2020, hearing at a hotel in Gettysburg featuring Trump campaign lawyers Rudy Giuliani and Jenna Ellis,? as well as Trump himself via phone;\nAfter Bidens PA win was official, he introduced a resolution to throw out the votes and just appoint Trump electors;\nHe used campaign funds to charter busses to the Stop the Steal? rally that preceded the violent riot;\nVideo footage shows that he and his wife took part in the...insurrection,? having crossed police lines and breaching the barricades set up at the Capitol;\nOn March 30, 2022, while campaigning for governor, he said: Im Doug Mastriano, and [if elected] I get to appoint the secretary of state whos delegated from me the power to make the corrections to elections, the voting logs and everything.",
    "author": "Bess Levin",
    "title": "Report: Trump Thinks Truth Social Is a Failure Because Google Is Trying to F--k Him",
    "sentiment": "0"
  },
  {
    "id": 6712,
    "mediaId": 157,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "CNN commentator Ana Navarro had harsh words after Republican primary voters in Pennsylvania after they nominated state Sen. <span class='selected-term'>Doug Mastriano</span> for governor.",
    "author": "Bob Brigham",
    "title": "Ana Navarro goes off on Trump-backed nutcase Doug Mastriano: One of the wackiest acceptance speeches Ive ever heard",
    "sentiment": "0"
  },
  {
    "id": 6713,
    "mediaId": 157,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "It is true that Republican strategists are sweating the winner of the GOP gubernatorial primary, <span class='selected-term'>Doug Mastriano</span>, who tends to be more loudmouthed about his insurrectionist views than other Republican candidates.",
    "author": "Amanda Marcotte",
    "title": "GOP drops the flash but keeps the fascism",
    "sentiment": "0"
  },
  {
    "id": 4456,
    "mediaId": 238,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Republicans are in full-scale panic about <span class='selected-term'>Doug Mastriano</span>, the right-wing extremist who won the GOP primary for Pennsylvania governor this week.",
    "author": "Greg Sargent",
    "title": "Opinion Trumps alarming GOP primary wins demand a serious response",
    "sentiment": "0"
  },
  {
    "id": 4458,
    "mediaId": 129,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0"
  },
  {
    "id": 6582,
    "mediaId": 323,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Open Queue\nThis weeks conventional wisdom holds that state Sen. <span class='selected-term'>Doug Mastriano</span> won the Pennsylvania Republican gubernatorial primary by inciting voters with claims of a stolen 2020 election.",
    "author": "Kimberley A. Strassel",
    "title": "The Limits of Stop the Steal",
    "sentiment": "0"
  },
  {
    "id": 6585,
    "mediaId": 238,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "As the partys nominee for governor, GOP voters chose Trumps preferred pick, a state senator named <span class='selected-term'>Doug Mastriano</span> who trumpets the big lie? about the 2020 election being stolen; was present at the U.S. Capitol on Jan. 6, 2021 (though he says he left before the insurrectionary portion of the events); and appeared at an event associated with the hallucinatory QAnon conspiracy theory about the nation somehow being run by a cabal of pedophiles.",
    "author": "Eugene Robinson",
    "title": "Opinion Cult or a conspiracy? The GOP sure isnt a normal political party.",
    "sentiment": "0"
  },
  {
    "id": 6587,
    "mediaId": 323,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "His advice to Mr. Oz is also a warning about how <span class='selected-term'>Doug Mastriano</span>, the GOPs gubernatorial nominee, might react to a loss in the fall.",
    "author": "The Editorial Board",
    "title": "Welcome to Stop the Steal, 2022",
    "sentiment": "0"
  },
  {
    "id": 6589,
    "mediaId": 409,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "The <span class='selected-term'>Doug Mastriano</span> win should remind us that the Republican Party is still capable of blowing the coming midterms.",
    "author": "Charles C. W. Cooke",
    "title": "Republicans Can Still Blow the 2022 Midterms",
    "sentiment": "0"
  },
  {
    "id": 6591,
    "mediaId": 409,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "It has allowed insurgents like <span class='selected-term'>Doug Mastriano</span>, now the nominee for governor, to gain the foothold they have.",
    "author": "Arjun Singh",
    "title": "Dr. Oz Defies Trump, for Once",
    "sentiment": "0"
  },
  {
    "id": 6597,
    "mediaId": 136,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "In a very last-minute endorsement, Trump on May 14 threw his support behind <span class='selected-term'>Doug Mastriano</span>, now the Republican candidate for governor in Pennsylvania after Tuesday's primary  to the frustration of the GOP establishment in the state.",
    "author": "Bill Powell",
    "title": "Democrats Want to Campaign Against MAGA Candidates",
    "sentiment": "0"
  },
  {
    "id": 6598,
    "mediaId": 98,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "This is Republican state Sen. <span class='selected-term'>Doug Mastriano</span>,? said the spot that blazed across Pennsylvanias television airwaves, touting the candidates staunch opposition to abortion and mail-in balloting and his whole-hog embrace of the stolen 2020 election lie.",
    "author": "",
    "title": "Column: A Pennsylvania Democrat pays to pick his GOP opponent? Californias got the playbook",
    "sentiment": "0"
  },
  {
    "id": 6599,
    "mediaId": 157,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump privately trashed Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> before changing his mind last week and endorsing his gubernatorial campaign, throwing the state's Republican Party into turmoil.",
    "author": "Travis Gettys",
    "title": "Trump 'wearing out his welcome' with Pennsylvania GOP over his endorsements of 'difficult' candidates: report",
    "sentiment": "0"
  },
  {
    "id": 6539,
    "mediaId": 409,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "That count doesn't include the endorsement of Oz yet, or <span class='selected-term'>Doug Mastriano</span> in the GOP gubernatorial primary, because Trump endorsed Mastriano three days before the election, when polling indicated Mastriano was well ahead.",
    "author": "Jim Geraghty",
    "title": "Trump's Gambling Isn't Paying Off",
    "sentiment": "0"
  },
  {
    "id": 6561,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Pennsylvania Republican gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> wrote a thesis in 2001 saying a left-wing putsch? against the U.S. military would destabilize the country.",
    "author": "Lexi Lonas",
    "title": "Pa. GOP governor hopeful Mastriano wrote thesis warning of left-wing Hitlerian Putsch",
    "sentiment": "0"
  },
  {
    "id": 6565,
    "mediaId": 223,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, State Senator <span class='selected-term'>Doug Mastriano</span>, who was running to be the GOP's nominee for governor, was polling 30 points ahead, and two days before the election, Trump goes, \"Ahhh, I'm endorsing Mastriano.\"",
    "author": "Kurt Schlichter",
    "title": "I'm Concerned That Trump Is Going to Lose His Influence",
    "sentiment": "0"
  },
  {
    "id": 6568,
    "mediaId": 238,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Two decades before he was Republican nominee for Pennsylvania governor, <span class='selected-term'>Doug Mastriano</span> warned in a masters thesis that the United States was vulnerable to a left-wing Hitlerian Putsch? that would begin with the dismantling of the U.S. military and end with the destruction of the countrys democracy.",
    "author": "Greg Jaffe",
    "title": "Doug Mastriano warned of left-wing Hitlerian Putsch in 2001 paper",
    "sentiment": "0"
  },
  {
    "id": 6573,
    "mediaId": 558,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "As Donald Trump tried to overturn the results of the 2020 election, there were few officials more willing to help than <span class='selected-term'>Doug Mastriano</span>, then a little-known Pennsylvania state senator.",
    "author": "Sam Levine",
    "title": "Trump loyalists primary win prompts election fears in Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 6578,
    "mediaId": 157,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> wrote a master's thesis two decades ago warning of a left-wing Hitlerian Putsch.\"",
    "author": "Travis Gettys",
    "title": "Trump-loving Doug Mastriano aired 'poisonous' conspiracies in old thesis calling for military takeover of US society",
    "sentiment": "0"
  },
  {
    "id": 6579,
    "mediaId": 234,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "In November, Shapiro, who ran unopposed in the Democratic primary, will face Republican <span class='selected-term'>Doug Mastriano</span>, the Trump-backed far-right candidate who wanted to overturn the 2020 election results, whom Shapiro calls extremely dangerous.? Fox and Shapiro dive into his opponents role in the January 6 insurrection and how to message to voters who believe in the big lie.? Plus, Shapiro speaks to what he learned from Democrats campaigning mistakes in 2016, why he believes freedom is on the ballot, and his thoughts on how to win in a swing state.",
    "author": "Emily Jane Fox",
    "title": "This Is a Razor-Thin State: PA Gubernatorial Candidate Josh Shapiro on His All-Important, Closely Watched Race",
    "sentiment": "0"
  },
  {
    "id": 6581,
    "mediaId": 157,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "His advice to Mr. Oz is also a warning about how <span class='selected-term'>Doug Mastriano</span>, the GOPs gubernatorial nominee, might react to a loss in the fall.",
    "author": "Tom Boggioni",
    "title": "WSJ editors smack down Trump for pushing 'Stop the Steal 2022' in Pennsylvania race",
    "sentiment": "0"
  },
  {
    "id": 7205,
    "mediaId": 18,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "In the gubernatorial primary, the Trump-backed far-right candidate <span class='selected-term'>Doug Mastriano</span> was able to drub his opponents and win 44% of the vote in a 3-way race, even in the face of staunch opposition from the Republican establishment.",
    "author": "Douglas Schoen",
    "title": "Schoen: It's still Donald Trump's Republican party",
    "sentiment": "0"
  },
  {
    "id": 7210,
    "mediaId": 19,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Now, again, that's going to be a couple days here, but they'll be done this coming week is my suspicion.\n<span class='selected-term'>Doug Mastriano</span> secured the Republican gubernatorial nomination in Pennsylvania following a late endorsement from former President Donald J. Trump over the weekend.",
    "author": "Nick Gilbertson",
    "title": "Trump-Endorsed Candidates 81-3 in Primaries Ahead of Races in Alabama, Arkansas, Georgia",
    "sentiment": "0"
  },
  {
    "id": 7215,
    "mediaId": 21,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Pennsylvania Attorney General Josh Shapiro, the state's Democratic gubernatorial nominee, blasted his Republican general election opponent, conservative state Sen. <span class='selected-term'>Doug Mastriano</span>, as \"dangerous\" and \"divisive.\"",
    "author": "John L. Dorman",
    "title": "Pennsylvania Democratic gubernatorial nominee Josh Shapiro blasts GOP opponent Doug Mastriano as 'dangerous' and 'extreme'",
    "sentiment": "0"
  },
  {
    "id": 7217,
    "mediaId": 195,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Pennsylvania Attorney General Josh Shapiro (D) on Sunday said Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> (R), whom he will face in the commonwealths gubernatorial race, is dangerous? and divisive.?\nDuring an interview with co-anchor Dana Bash on CNNs State of the Union,? Shapiro called out Mastriano for a number of policy stances, including abortion, and noted the state lawmakers presence in Washington on Jan. 6, 2021.\nHe is extreme and he is dangerous.",
    "author": "Mychael Schnell",
    "title": "Shapiro calls Mastriano dangerous and divisive",
    "sentiment": "0"
  },
  {
    "id": 7219,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "How Trumps 2020 Election Lies Have Gripped State Legislatures",
    "sentiment": "0"
  },
  {
    "id": 7227,
    "mediaId": 19,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Democratic nominee for Pennsylvania governor Josh Shapiro said Sunday on CNNs State of the Union? that his Republican opponent <span class='selected-term'>Doug Mastriano</span> is too divisive to be the governor.",
    "author": "Pam Key",
    "title": "Josh Shapiro: Mastriano Wants to Take Us to a Divisive and Dark Place",
    "sentiment": "0"
  },
  {
    "id": 7229,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Not when people like Pennsylvania State Senator <span class='selected-term'>Doug Mastriano</span>  an election denier who marched with the Jan. 6 crowd at the Capitol  just won the G.O.P.",
    "author": "",
    "title": "My Lunch With President Biden",
    "sentiment": "0"
  },
  {
    "id": 7193,
    "mediaId": 157,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Prevailing there, was <span class='selected-term'>Doug Mastriano</span>, someone that is so far right that even Donald Trump wouldn't endorse him until the final week of the campaign.",
    "author": "Sarah K. Burris",
    "title": "John Oliver reveals why Republicans assume Doug Mastriano will lead them into a disastrous election in November",
    "sentiment": "0"
  },
  {
    "id": 7348,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Pennsylvania Republicans last week chose as their gubernatorial nominee <span class='selected-term'>Doug Mastriano</span>, a state senator who marched on the Capitol on Jan. 6 and who wrote his master's thesis on the need for the military to protect the country from a Hitlerian Putsch by the left, The Post's Greg Jaffe reported.",
    "author": "Dana Milbank",
    "title": "Opinion As Trump loses kingmaker status, he becomes more dangerous",
    "sentiment": "0"
  },
  {
    "id": 8471,
    "mediaId": 558,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "When 2020 election denialist <span class='selected-term'>Doug Mastriano</span> won last week's GOP primary for Pennsylvania governor, a Guardian op-ed called him one of the most radical gubernatorial candidates ever to receive a major party nomination.",
    "author": "Andrew Romano",
    "title": "Struggling Dems look to a risky strategy: Meddling in GOP primaries to boost 'unelectable' Republicans",
    "sentiment": "0"
  },
  {
    "id": 8472,
    "mediaId": 129,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "Just look at <span class='selected-term'>Doug Mastriano</span>, who won the Republican governor's primary in Pennsylvania.",
    "author": "",
    "title": "The G.O.P. Has Gone Even Farther to the Right Than I Expected': Three Writers Talk About the Midterms",
    "sentiment": "0"
  },
  {
    "id": 8473,
    "mediaId": 157,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "Vance in Ohio and <span class='selected-term'>Doug Mastriano</span> in Pennsylvania, but the intra-party conflicts sparked by Trump's endorsements of unpopular loyalists has made GOP heavyweights more willing to challenge the twice-impeached former president, reported Politico.",
    "author": "Travis Gettys",
    "title": "Republicans talk trash about Trump as endorsements flop",
    "sentiment": "0"
  },
  {
    "id": 8498,
    "mediaId": 129,
    "date": "5/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "The Good News in Georgia Thats Bad News for Trump",
    "sentiment": "0"
  },
  {
    "id": 8416,
    "mediaId": 98,
    "date": "5/29/2022 12:00:00 AM",
    "sentence": "PITTSBURGH \nThe victory party took on the feel of an evangelical worship service after <span class='selected-term'>Doug Mastriano</span> won Pennsylvania's Republican gubernatorial primary this month.",
    "author": "PETER SMITH and DEEPA BHARATH",
    "title": "Christian nationalism on the rise in some GOP campaigns",
    "sentiment": "0"
  },
  {
    "id": 8417,
    "mediaId": 178,
    "date": "5/29/2022 12:00:00 AM",
    "sentence": "PITTSBURGH  The victory party took on the feel of an evangelical worship service after <span class='selected-term'>Doug Mastriano</span> won Pennsylvania's Republican gubernatorial primary this month.",
    "author": "Peter Smith and Deepa Bharath Associated Press",
    "title": "Christian nationalism on the rise in some GOP campaigns",
    "sentiment": "0"
  },
  {
    "id": 8692,
    "mediaId": 675,
    "date": "5/31/2022 12:00:00 AM",
    "sentence": "Titled \"Christian nationalism on the rise in some GOP campaigns,\" the article Sunday featured the remarks of <span class='selected-term'>Doug Mastriano</span> during a victory celebration after he won the Republican primary in Pennsylvanias gubernatorial race last week.",
    "author": "Art Moore",
    "title": "News-media giant warns of rise of 'white Christian nationalism'",
    "sentiment": "0"
  },
  {
    "id": 8706,
    "mediaId": 157,
    "date": "5/31/2022 12:00:00 AM",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span> took part in the Jan. 6, 2021, \"Stop the Steal\" rally and went to the U.S. Capitol afterward, and his ideology can be summed up as Christian nationalism -- so it's not surprising that he has spoken at events hosted by the apocalyptic \"Rod of Iron Ministries\" founded by the Rev.",
    "author": "Travis Gettys",
    "title": "Gun-worshiping MAGA 'cult' moves closer into GOP mainstream with Pennsylvania primary win: historian",
    "sentiment": "0"
  },
  {
    "id": 8688,
    "mediaId": 234,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "But it is only one such threat: From anti-voting legislation enacted on the basis of Trumps lies to a gubernatorial candidate in Pennsylvanias <span class='selected-term'>Doug Mastriano</span> who has indicated he would not respect election results, Republicans are building on the former presidents 2020 efforts to overturn his loss.",
    "author": "Eric Lutz",
    "title": "Steve Bannon's Election-Takeover Dream Is Starting to Take Shape",
    "sentiment": "0"
  },
  {
    "id": 8676,
    "mediaId": 195,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "Mastriano agrees to interview with Jan. 6 panel\n<span class='selected-term'>Doug Mastriano</span>, Pennsylvanias Republican gubernatorial nominee, will testify before the committee investigating the Jan. 6, 2021, attack on the Capitol about his role aiding the Trump campaign in challenging the results of the 2020 presidential election.",
    "author": "Jordan Williams",
    "title": "Defense & National Security  Biden, Harris huddle with NATO head",
    "sentiment": "0"
  },
  {
    "id": 8679,
    "mediaId": 147,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "HARRISBURG, Pa. (AP)  Pennsylvanias Republican nominee for governor, <span class='selected-term'>Doug Mastriano</span>, has offered to sit for an interview with the congressional committee investigating the Jan. 6 attack on the U.S. Capitol and was interviewed by FBI agents last year about it, his lawyer said Thursday.",
    "author": "Farnoush Amiri",
    "title": "Republican nominee for PA governor Doug Mastriano willing to talk to Jan. 6 committee",
    "sentiment": "0"
  },
  {
    "id": 8681,
    "mediaId": 195,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rebecca Beitsch",
    "title": "Mastriano agrees to interview with Jan. 6 panel",
    "sentiment": "0"
  },
  {
    "id": 8682,
    "mediaId": 151,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "Receipts provided to the Jan. 6 panel confirm that Mastrianos campaign committee, Friends of <span class='selected-term'>Doug Mastriano</span>, paid $3,354 to a charter bus company in late December 2020, as the progressive news site The American Independent has noted.",
    "author": "",
    "title": "Pa. GOP gubernatorial nominee shares documents with Jan. 6 panel, agrees to interview",
    "sentiment": "0"
  },
  {
    "id": 8686,
    "mediaId": 157,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> has turned over evidence to the House Select Committee, including documents showing his arrangements for buses carrying to Donald Trump supporters to Washington, D.C., on Jan. 6, 2021.",
    "author": "Travis Gettys",
    "title": "Far-right GOP candidate Doug Mastriano turns over documents and receipts to Jan. 6 committee",
    "sentiment": "0"
  },
  {
    "id": 8687,
    "mediaId": 234,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "Elsewhere in conservative bullshit re: guns, on Wednesday, <span class='selected-term'>Doug Mastriano</span>, the Pennsylvania GOP nominee for governor, shared and doubled down on a 2018 video of him likening gun control to the policies of Adolf Hitler.",
    "author": "Bess Levin",
    "title": "Republican Congressman Blames Mass Shootings on Women Having Rights",
    "sentiment": "0"
  }
]