[
  {
    "id": 7054,
    "mediaId": 237,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span>, who made headlines for his efforts to review the integrity of the 2020 election, entered the race at an event in Gettysburg that also featured former Trump national security adviser Michael Flynn and Jenna Ellis, who was a senior legal adviser to the Trump 2020 campaign.",
    "author": "Elizabeth Faddis",
    "title": "Pennsylvania senator who sought 2020 'forensic' audit announces candidacy for governor",
    "sentiment": "0"
  },
  {
    "id": 7047,
    "mediaId": 234,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "(By way of example, the GOP field includesamong other Trumpy characters<span class='selected-term'>Doug Mastriano</span>, a Republican state senator who personally attended and used campaign funds to pay for buses to travel to the U.S. Capitol for the Stop the Steal? rally on January 6.)",
    "author": "",
    "title": "The Stakes Could Not Be Higher: All Eyes on Pennsylvania as Key Elections Loom",
    "sentiment": "0"
  },
  {
    "id": 7045,
    "mediaId": 65,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "\"If the federal government is not willing to provide extra dollars to communities that have experienced increased strain on their healthcare systems, increased number of students in school districts and education costs and other services within our communities, then they shouldnt be forced to take on more illegal immigrants and the additional financial responsibility,\" he said\nAnother Pennsylvania Republican, state Sen. <span class='selected-term'>Doug Mastriano</span> of Chambersburg, said Thursday he will be co-sponsoring Scavello's legislation.",
    "author": "",
    "title": "Pennsylvania Republicans to draft bill to relocate migrants on Biden DHS flights to Delaware",
    "sentiment": "0"
  },
  {
    "id": 6953,
    "mediaId": 19,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "You dont have to wonder what Lou will do tomorrow  just look at what he did yesterday.?\nA recent Emerson College Poll showed Barletta leading his GOP opponents with 20 percent support, closely followed by State Sen. <span class='selected-term'>Doug Mastriano</span>, who garnered 19 percent.",
    "author": "Hannah Bleau",
    "title": "PA Gubernatorial Candidate Lou Barletta Launches TV Ad Highlighting His Record",
    "sentiment": "0"
  },
  {
    "id": 6861,
    "mediaId": 19,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "I am proven, road-tested, and ready to lead the great Pennsylvania comeback.?\nLast month, Barletta held a slight lead against <span class='selected-term'>Doug Mastriano</span>, a state senator.",
    "author": "John Binder",
    "title": "Republican Jake Corman Drops Out of Pennsylvania Gubernatorial Race, Endorses Lou Barletta",
    "sentiment": "0"
  },
  {
    "id": 6819,
    "mediaId": 195,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Operatives in the state are sounding the alarm that state Sen. <span class='selected-term'>Doug Mastriano</span>, the front-runner gubernatorial candidate whose bid is centered around unfounded allegations of voter fraud in 2020, is making the top office in Harrisburg out of reach.",
    "author": "Tal Axelrod",
    "title": "GOP sounds alarm in Pennsylvania as hard-line candidates rise",
    "sentiment": "0"
  },
  {
    "id": 6813,
    "mediaId": 195,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "When asked to clarify his views on abortion in the Saturday interview, Oz distanced himself from Trumps newly minted pick for Pennsylvania governor, <span class='selected-term'>Doug Mastriano</span>, a far-right conservative who has called abortion the No.",
    "author": "",
    "title": "Reprehensible: Oz condemns GOP opponents tweet on Islam",
    "sentiment": "0"
  },
  {
    "id": 3431,
    "mediaId": 129,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "A late endorsement\nOn Saturday, Trump finally endorsed <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "author": "",
    "title": "Republican Chaos' in Pennsylvania Threatens to Upend the Midterms",
    "sentiment": "0"
  },
  {
    "id": 6715,
    "mediaId": 132,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "HARRISBURG, Pa.  <span class='selected-term'>Doug Mastriano</span> won the Republican nomination for Pennsylvania governor on Tuesday, beating eight other candidates and a party establishment that had tried to head off his nomination over fears that he is too extreme to win the general election in the presidential battleground.",
    "author": "",
    "title": "Trump-backed Mastriano wins GOP Pennsylvania governor nod",
    "sentiment": "0"
  },
  {
    "id": 6765,
    "mediaId": 98,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Thats especially true in the perennial political battleground of Pennsylvania, where some Republicans are already worried that state Sen. <span class='selected-term'>Doug Mastriano</span> is too extreme to woo moderates, who are often decisive in general elections there.",
    "author": "WILL WEISSERT",
    "title": "Fetterman easily wins Democratic Senate race in Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 6643,
    "mediaId": 558,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "HARRISBURG, Pa. (AP)  <span class='selected-term'>Doug Mastriano</span> is not the only candidate who won a Republican primary on Tuesday after embracing Donald Trump's lie that the 2020 election was stolen.",
    "author": "",
    "title": "How Pa. GOP gov pick could turn election lies into action",
    "sentiment": "0"
  },
  {
    "id": 6677,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Instead of focusing on kitchen-table issues like strengthening the economy and investing in education, <span class='selected-term'>Doug Mastriano</span> is an extremist running on a dangerous agenda that would devastate Pennsylvania families,? said Democratic Governors Association Executive Director Noam Lee.",
    "author": "Tal Axelrod",
    "title": "Mastriano wins Pennsylvania GOP governor primary despite party concerns",
    "sentiment": "0"
  },
  {
    "id": 6679,
    "mediaId": 147,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Shapiros advertising in recent weeks has included spots introducing him to voters, but he also has targeted state Sen. <span class='selected-term'>Doug Mastriano</span> as the Republican gubernatorial candidate emerged from the large primary field as a front-runner.",
    "author": "Associated Press",
    "title": "Josh Shapiro wins unopposed Democratic primary for Pennsylvania governor",
    "sentiment": "0"
  },
  {
    "id": 6682,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Shapiro has also benefited from a messy GOP primary, with Republican campaigns and officials waging last-minute talks to coalesce around an alternative to front-runner <span class='selected-term'>Doug Mastriano</span>, a state senator whose campaign is mostly centered around unfounded claims of widespread voter fraud in 2020.",
    "author": "Tal Axelrod",
    "title": "Shapiro skates to Democratic governors nod in Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 8696,
    "mediaId": 129,
    "date": "5/31/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, a leading voice against certifying the 2020 election, won the primary for governor in a landslide last week  even as the partys old guard warned that he was too extreme to win in November.",
    "author": "",
    "title": "Lawyer who plotted to overturn Trumps 2020 loss recruits election deniers to watch over the vote.",
    "sentiment": "0"
  }
]