[
  {
    "id": 6971,
    "mediaId": 151,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "On the Republican side, Dave White raised $1.8 million, Bill McSwain raised $1.4 million, Jake Corman raised $590,000, Lou Barletta raised $431,000 and <span class='selected-term'>Doug Mastriano</span> raised $373,000.",
    "author": "",
    "title": "Crypto's campaign year"
  },
  {
    "id": 5933,
    "mediaId": 195,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "Pennsylvania Republicans will have to wade through a massive field of contenders, apparently led by state Sen. <span class='selected-term'>Doug Mastriano</span> (R), an election denialist who was in Washington during the Jan. 6 insurrection, and former Rep. Lou Barletta (R).",
    "author": "Reid Wilson",
    "title": "Busy month of primaries to set stage for midterms"
  },
  {
    "id": 4468,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots"
  },
  {
    "id": 4469,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots"
  },
  {
    "id": 5466,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In the Pennsylvania governors race, Mr. Trump backed <span class='selected-term'>Doug Mastriano</span> last week over Lou Barletta, a former congressman who was an early supporter of Mr. Trumps 2016 campaign.",
    "author": "",
    "title": "Primaries Show Limits, and Depths, of Trumps Power Over G.O.P. Base"
  },
  {
    "id": 4458,
    "mediaId": 129,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots"
  },
  {
    "id": 6582,
    "mediaId": 323,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Open Queue\nThis weeks conventional wisdom holds that state Sen. <span class='selected-term'>Doug Mastriano</span> won the Pennsylvania Republican gubernatorial primary by inciting voters with claims of a stolen 2020 election.",
    "author": "Kimberley A. Strassel",
    "title": "The Limits of Stop the Steal"
  },
  {
    "id": 7548,
    "mediaId": 129,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, <span class='selected-term'>Doug Mastriano</span>s win in the Republican primary for governor is causing alarm in the G.O.P.",
    "author": "",
    "title": "Your Thursday Evening Briefing"
  },
  {
    "id": 6538,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, who backs Trump's false claims of election fraud and marched to the Capitol on Jan. 6, will be the GOP's gubernatorial candidate.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump faces critical popularity test in Georgia"
  },
  {
    "id": 6539,
    "mediaId": 409,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "That count doesn't include the endorsement of Oz yet, or <span class='selected-term'>Doug Mastriano</span> in the GOP gubernatorial primary, because Trump endorsed Mastriano three days before the election, when polling indicated Mastriano was well ahead.",
    "author": "Jim Geraghty",
    "title": "Trump's Gambling Isn't Paying Off"
  },
  {
    "id": 6556,
    "mediaId": 151,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "CONCERN IN THE KEYSTONE: Republican operatives in Pennsylvania mounted an all-out blitz to stop state Sen. <span class='selected-term'>DOUG MASTRIANO</span> from winning the GOP gubernatorial nomination.",
    "author": "",
    "title": "POLITICO Playbook: Sean Patrick Maloney dodges a bullet"
  },
  {
    "id": 7194,
    "mediaId": 136,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Vance, Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> and North Carolina Senate candidate Ted Budd all won their primaries.",
    "author": "Andrew Stanton",
    "title": "Trump Endorsement More 'Matchbox Car' Than 'Freight Train': Geoff Duncan"
  },
  {
    "id": 7202,
    "mediaId": 151,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "And in Pennsylvania last week, <span class='selected-term'>Doug Mastriano</span>, the far-right election denier Trump endorsed, won the gubernatorial primary.",
    "author": "",
    "title": "'No one's paying any attention': The week that Republicans ignored Trump's election lies"
  },
  {
    "id": 7224,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Vance, the Hillbilly Elegy? author and U.S. Senate candidate from Ohio, and <span class='selected-term'>Doug Mastriano</span>, a candidate for Pennsylvania governor who echoes Mr. Trumps untrue claims of election fraud.",
    "author": "",
    "title": "What Donald Trump Didnt Count On in Georgia"
  },
  {
    "id": 7228,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Republicans have already elevated candidates like State Senator <span class='selected-term'>Doug Mastriano</span>, a far-right 2020 election denier who is the Republican nominee for governor in Pennsylvania.",
    "author": "",
    "title": "Democrats Fight Headwinds in Georgia and Beyond: The Problem Is Reality"
  },
  {
    "id": 7289,
    "mediaId": 129,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "During the Republican primary in Pennsylvania, Mr. Shapiro, the state's attorney general, ran an ad that called State Senator <span class='selected-term'>Doug Mastriano</span> one of Donald Trump's strongest supporters.",
    "author": "",
    "title": "Democrats are mindful of headwinds in Georgia, and everywhere else."
  },
  {
    "id": 7329,
    "mediaId": 33,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "And his falsehoods about election fraud have paved the way for restrictive new voting laws in states such as Georgia, Florida, Texas and Iowa, and have led to the party nominating candidates such as state Sen. <span class='selected-term'>Doug Mastriano</span>, an election denier, for Pennsylvania governor, positioning them to potentially take over the election machinery of key swing states if they win in November.",
    "author": "Eric Bradner",
    "title": "Republicans look to Georgia for a path beyond Trump's 2020 grievances"
  },
  {
    "id": 7481,
    "mediaId": 147,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "You have someone like <span class='selected-term'>Doug Mastriano</span> in Pennsylvania, who is  part of his stock and trade and what made him a promising candidate for the Republicans is and what got him Trump's endorsement is his really strong commitment to the big lie, the fact that he went on January 6 to Washington, D.C., and marched toward the Capitol, though he says he didn't go in or he didn't break the law.",
    "author": "PBS NewsHour",
    "title": "Tamara Keith and Amy Walter on whats at stake in Georgias primary election"
  },
  {
    "id": 7349,
    "mediaId": 32,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Others, such as Pennsylvania's Republican gubernatorial nominee <span class='selected-term'>Doug Mastriano</span>, received Trump's endorsement right before the election, once they had already emerged as frontrunners.",
    "author": "Kevin Breuninger",
    "title": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch"
  },
  {
    "id": 7350,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Live Updates: What to Watch For in Today's Elections in Georgia and Beyond"
  },
  {
    "id": 7345,
    "mediaId": 1576,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Trump has scored some primary victories with election deniers  most significantly last week in Pennsylvania, when Republican voters there chose his preferred gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, who said he wouldn't have certified Biden's 2020 win of the state.",
    "author": "",
    "title": "Takeaways: Trump's big primary defeat; scandals for the win"
  },
  {
    "id": 8357,
    "mediaId": 129,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, the Republican nominee for governor, <span class='selected-term'>Doug Mastriano</span>, was deeply involved in Mr. Trump's plot to overturn the state's 2020 results, while the two leading Senate candidates, Dr. Mehmet Oz and David McCormick, have equivocated about whether Mr. Biden was fairly elected.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters Reject Trump Endorsed Candidates in Georgia"
  }
]