[
  {
    "id": 7006,
    "mediaId": 169,
    "date": "2022-00-03",
    "sentence": "The Berks County Patriots last year also hosted the two frontrunners in the crowded Republican governor's race: state Sen. <span class='selected-term'>Doug Mastriano</span> and former Rep. Lou Barletta, both of whom have ties to Trump supporters charged in the Capitol riot.",
    "author": "Igor Derysh",
    "title": "Is Pennsylvania losing it? Hate groups proliferate as state GOP descends into MAGA paranoia",
    "sentiment": "0.0"
  },
  {
    "id": 6897,
    "mediaId": 43,
    "date": "2022-00-07",
    "sentence": "This isnt the only race with a high profile GOP candidate though could do more harm than good to the GOPs chances in November:\nDemocrat Josh Shapiro wants <span class='selected-term'>Doug Mastriano</span> to win the Pennsylvania Republican primary for governor on May 17.",
    "author": "",
    "title": "LOL! Watch Members Of The MAGA Crowd Boo Dr. Oz (R. NJ) At Trump Rally",
    "sentiment": "0.0"
  },
  {
    "id": 7052,
    "mediaId": 151,
    "date": "2022-00-09",
    "sentence": "ICYMI: On Friday, Andrew Desiderio, Burgess Everett and Marianne LeVine broke down Johnsons thinking for Congress Minutes\n2022 WATCH  Trumpy Pennsylvania state Sen. <span class='selected-term'>DOUG MASTRIANO</span> officially jumped into the governors race Saturday.",
    "author": "",
    "title": "POLITICO Playbook: Does Trump need Twitter?",
    "sentiment": "0.0"
  },
  {
    "id": 6880,
    "mediaId": 65,
    "date": "2022-00-10",
    "sentence": "Gottheimer isnt the only Democrat who appears to be throwing up primary smokescreens trying to tie Republicans to Trump  the Pennsylvania gubernatorial race is seeing television ads from the presumptive Democrat nominee, state Attorney General Josh Shapiro, targeting GOP state Sen. <span class='selected-term'>Doug Mastriano</span> as \"one of Donald Trumps strongest supporters.\"",
    "author": "",
    "title": "Moderate Dem accused of trying to 'confuse' GOP primary voters with mailers tying candidate to Trump",
    "sentiment": "0.0"
  },
  {
    "id": 6884,
    "mediaId": 33,
    "date": "2022-00-10",
    "sentence": "En un debate de candidatos a la gobernacin, el senador estatal <span class='selected-term'>Doug Mastriano</span> pareci comparar la lucha para abolir el aborto con el movimiento para abolir la trata de esclavos, a fines del siglo XVIII y principios del XIX, al invocar a William Wilberforce, un poltico britnico que lider ese movimiento.",
    "author": "",
    "title": "ANLISIS | La filtracin del borrador sobre el aborto de la Corte Suprema ya ha transformado la poltica en todo Estados Unidos",
    "sentiment": "0.0"
  },
  {
    "id": 6853,
    "mediaId": 238,
    "date": "2022-00-12",
    "sentence": "This question arises now that <span class='selected-term'>Doug Mastriano</span> is surging in the GOP primary for Pennsylvania governor.",
    "author": "Greg Sargent",
    "title": "Opinion An openly pro-coup Trumpist could become Pennsylvanias next governor",
    "sentiment": "0.0"
  },
  {
    "id": 6859,
    "mediaId": 129,
    "date": "2022-00-12",
    "sentence": "Recent polling shows State Senator <span class='selected-term'>Doug Mastriano</span>, a retired Army colonel with a Ph.D. in history, leading the rest of the Republican candidates.",
    "author": "",
    "title": "The Most Pivotal Elections in 2022 Are Not the Ones You Think",
    "sentiment": "0.0"
  },
  {
    "id": 6967,
    "mediaId": 239,
    "date": "2022-00-12",
    "sentence": "The blow to Mr. McSwains campaign, coupled with the expected decision by state Senate President Pro Tempore Jake Corman to quit the race, leaves former U.S. Rep. Lou Barletta and state Sen. <span class='selected-term'>Doug Mastriano</span> as the two most prominent GOP candidates for governor.",
    "author": "Dave Boyer",
    "title": "Trump slams GOP candidate in Pa. governors race for not going after 2020 election fraud",
    "sentiment": "0.0"
  },
  {
    "id": 7048,
    "mediaId": 238,
    "date": "2022-00-12",
    "sentence": "Heres a rundown, per Politico:\nIn Pennsylvania, state Sen. <span class='selected-term'>Doug Mastriano</span> launched his gubernatorial campaign by touting his support from two Trump associates  former campaign lawyer Jenna Ellis and former national security adviser Michael Flynn  who are loud proponents of conspiracy theories and lies about the 2020 election.",
    "author": "",
    "title": "Opinion: Will 2022 be all about Trump? Direct that question at Republicans, not Democrats.",
    "sentiment": "0.0"
  },
  {
    "id": 6961,
    "mediaId": 65,
    "date": "2022-00-13",
    "sentence": "The legislation, in the form of an amendment to the Money Transmission Business Licensing Law of 1965, was sponsored by 2022 gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a state senator from Gettysburg.",
    "author": "Elizabeth Heckman",
    "title": "Pennsylvania gubernatorial candidate: Illegal immigrant workers are skipping taxes, should have to 'pay up'",
    "sentiment": "0.0"
  },
  {
    "id": 7032,
    "mediaId": 675,
    "date": "2022-00-13",
    "sentence": "Republican State Sen. <span class='selected-term'>Doug Mastriano</span> and others sought answers from Pennsylvania Gov.",
    "author": "WND News Services",
    "title": "The mystery of the migrant kids",
    "sentiment": "0.0"
  },
  {
    "id": 6822,
    "mediaId": 136,
    "date": "2022-00-14",
    "sentence": "Former President Donald Trump endorsed Pennsylvania's Republican gubernatorial hopeful <span class='selected-term'>Doug Mastriano</span> on Saturday, just days before he faces off against GOP opponents in the state's primary on Tuesday.",
    "author": "Jason Lemon",
    "title": "Trump-Endorsed Doug Mastriano's Chances of Beating GOP Rivals: Polls",
    "sentiment": "0.0"
  },
  {
    "id": 6825,
    "mediaId": 147,
    "date": "2022-00-14",
    "sentence": "HARRISBURG, Pa. (AP)  Donald Trump on Saturday endorsed <span class='selected-term'>Doug Mastriano</span> in Pennsylvanias Republican primary for governor, siding with a far-right candidate who was outside the U.S. Capitol during the Jan. 6 insurrection and has worked with determination to overturn the results of the 2020 presidential election.",
    "author": "Marc Levy",
    "title": "Trump endorses Doug Mastriano ahead of Pennsylvania GOP governor primary",
    "sentiment": "0.0"
  },
  {
    "id": 6827,
    "mediaId": 65,
    "date": "2022-00-14",
    "sentence": "Former President Trump threw his support behind Republican <span class='selected-term'>Doug Mastriano</span> for Pennsylvania governor just three days before the primary election, citing Mastriano's efforts to go after the 2020 election \"theft.\"",
    "author": "Marisa Schultz",
    "title": "Pennsylvania governor's race: Trump endorses Mastriano over Barletta in GOP primary",
    "sentiment": "0.0"
  },
  {
    "id": 6829,
    "mediaId": 136,
    "date": "2022-00-14",
    "sentence": "Former President Donald Trump endorsed <span class='selected-term'>Doug Mastriano</span> in Pennsylvania's GOP gubernatorial primary Saturday, again alienating state leaders in the Republican Party.",
    "author": "Andrew Stanton",
    "title": "Trump Further Alienates Pennsylvania GOP by Backing Mastriano for Governor",
    "sentiment": "0.0"
  },
  {
    "id": 6835,
    "mediaId": 558,
    "date": "2022-00-14",
    "sentence": "By Pete Schroeder\nWASHINGTON (Reuters) - Former President Donald Trump announced Saturday he was backing Pennsylvania state Senator <span class='selected-term'>Doug Mastriano</span> in that state's 2022 governor's race.",
    "author": "",
    "title": "Trump endorses Mastriano for Pennsylvania governor",
    "sentiment": "0.0"
  },
  {
    "id": 6840,
    "mediaId": 19,
    "date": "2022-00-14",
    "sentence": "Republicans across Pennsylvania are questioning former President Trumps last-minute endorsement of State Sen. <span class='selected-term'>Doug Mastriano</span> (R) in the gubernatorial race.",
    "author": "John Binder",
    "title": "Republicans Very Disappointed in Trumps Mastriano Endorsement, Continue Lining Up Behind Lou Barletta",
    "sentiment": "0.0"
  },
  {
    "id": 6843,
    "mediaId": 157,
    "date": "2022-00-14",
    "sentence": "Former President Donald Trump has endorsed state Sen. <span class='selected-term'>Doug Mastriano</span>, R-Frankin, in Pennsylvanias high-stakes primary for governor, dealing a potentially fatal blow to establishment Republicans who had hoped to head off a victory by the far-right politician who has trafficked in false claims of election fraud.",
    "author": "John L. Micek",
    "title": "Trump endorses Jan. 6 participant in Pa.s GOP governor primary days before election",
    "sentiment": "0.0"
  },
  {
    "id": 6993,
    "mediaId": 34,
    "date": "2022-00-14",
    "sentence": "Subverting Democracy Plan B: <span class='selected-term'>Doug Mastriano</span>\nThe second phase of the subversion plan contemplated that Congress might not accept the phony Trump electors when it met to certify Biden's election on January 6, 2021.",
    "author": "Steven Harper",
    "title": "The War on Democracy Is Here",
    "sentiment": "0.0"
  },
  {
    "id": 7045,
    "mediaId": 65,
    "date": "2022-00-14",
    "sentence": "\"If the federal government is not willing to provide extra dollars to communities that have experienced increased strain on their healthcare systems, increased number of students in school districts and education costs and other services within our communities, then they shouldnt be forced to take on more illegal immigrants and the additional financial responsibility,\" he said\nAnother Pennsylvania Republican, state Sen. <span class='selected-term'>Doug Mastriano</span> of Chambersburg, said Thursday he will be co-sponsoring Scavello's legislation.",
    "author": "",
    "title": "Pennsylvania Republicans to draft bill to relocate migrants on Biden DHS flights to Delaware",
    "sentiment": "0.0"
  },
  {
    "id": 3445,
    "mediaId": 238,
    "date": "2022-00-15",
    "sentence": "Return to menu\nIn Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, a state senator who leads the polls going into Tuesday's GOP gubernatorial primary, is emblematic of the rising intensity of Christian nationalism that has rooted itself firmly in the Republican Party.",
    "author": "Mariana Alfaro",
    "title": "Midterm primaries live updates Voters to pick key nominees in Pa., N.C., three other states",
    "sentiment": "0.0"
  },
  {
    "id": 6808,
    "mediaId": 238,
    "date": "2022-00-15",
    "sentence": "Leading GOP gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a state senator, has said he would appoint a secretary of state who would require all voters to re-register before casting their ballots, a move that could dramatically reshape the electorate  and would likely violate federal law.",
    "author": "Rosalind S. Helderman",
    "title": "Leading GOP candidates in Pennsylvania were in Washington on Jan. 6",
    "sentiment": "0.0"
  },
  {
    "id": 6810,
    "mediaId": 65,
    "date": "2022-00-15",
    "sentence": "Trump also endorsed Republican <span class='selected-term'>Doug Mastriano</span> for Pennsylvania governor over Republican primary candidates Lou Barletta, Bill McSwain, and Dave White.",
    "author": "Lawrence Richard",
    "title": "Dr. Oz says 2015 tweet should disqualify Barnette from Republican primary: 'reprehensible'",
    "sentiment": "0.0"
  },
  {
    "id": 6817,
    "mediaId": 25,
    "date": "2022-00-15",
    "sentence": "And on Saturday at what was billed as her final campaign rally, Barnette spoke to supporters in Bucks County alongside <span class='selected-term'>Doug Mastriano</span>, who was endorsed hours earlier by Trump in the race for governor.",
    "author": "",
    "title": "Full transcript of \"Face the Nation\" on May 15, 2022",
    "sentiment": "0.0"
  },
  {
    "id": 7024,
    "mediaId": 124,
    "date": "2022-00-15",
    "sentence": "Among those being subpoenaed are Kelli Ward, the Arizona GOP chair who has already filed suit to block the committee from getting her phone records, and Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span>, an outspoken purveyor of the false claim that there was widespread fraud in the presidential election.",
    "author": "",
    "title": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers",
    "sentiment": "0.0"
  },
  {
    "id": 7028,
    "mediaId": 63,
    "date": "2022-00-15",
    "sentence": "The committee also subpoenaed Pennsylvania gubernatorial candidate and state Sen. <span class='selected-term'>Doug Mastriano</span> (R), Arizona GOP chairwoman Kelli Ward, former Michigan Republican State Committee chairwoman Laura Cox and Arizona state Rep. Mark Finchem (R), who is also a member of the far-right militia group the Oath Keepers.",
    "author": "Nicholas Reimann",
    "title": "Jan. 6 Committee Subpoenas Trump Campaign Officials Over Fake Electors Scheme",
    "sentiment": "0.0"
  },
  {
    "id": 7029,
    "mediaId": 32,
    "date": "2022-00-15",
    "sentence": "Brandon Bell | Getty Images\nThe House select committee investigating the Jan. 6 Capitol riot issued subpoenas Tuesday to Arizona Republican Party Chairwoman Kelli Ward, GOP State Sen. <span class='selected-term'>Doug Mastriano</span> of Pennsylvania and four others over their alleged efforts to interfere with the certification of the 2020 election results.",
    "author": "Kevin Breuninger",
    "title": "House probe of Jan. 6 Capitol riot subpoenas Arizona GOP leader Kelli Ward, 5 others over alternate electors",
    "sentiment": "0.0"
  },
  {
    "id": 7031,
    "mediaId": 25,
    "date": "2022-00-15",
    "sentence": "Mark Finchem, an Arizona state House member, said in a press release the following week that he was there \"to deliver an evidence book and letter to Vice President Pence showing key evidence of fraud in the Arizona Presidential Election, and asking him to consider postponing the award of electors\"\n<span class='selected-term'>Doug Mastriano</span>, a Pennsylvania state senator, publicly called for the Republican-controlled legislature in his state to appoint its own electors to change the outcome of the presidential election there because of \"mounting evidence that the PA presidential election was compromised.\"",
    "author": "Zak Hudak",
    "title": "January 6 committee subpoenas others tied to false elector scheme",
    "sentiment": "0.0"
  },
  {
    "id": 3431,
    "mediaId": 129,
    "date": "2022-00-16",
    "sentence": "A late endorsement\nOn Saturday, Trump finally endorsed <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "author": "",
    "title": "Republican Chaos' in Pennsylvania Threatens to Upend the Midterms",
    "sentiment": "0.0"
  },
  {
    "id": 3538,
    "mediaId": 238,
    "date": "2022-00-16",
    "sentence": "The tally in the Poconos borough that night was overwhelming: state Sen. <span class='selected-term'>Doug Mastriano</span>, 17.",
    "author": "Michelle Boorstein",
    "title": "Christian nationalism is shaping a Pa. primary  and a GOP shift",
    "sentiment": "0.0"
  },
  {
    "id": 6779,
    "mediaId": 65,
    "date": "2022-00-16",
    "sentence": "Also helping Barnette may be that she and state Sen. <span class='selected-term'>Doug Mastriano</span>, the front-runner for Pennsylvania's GOP gubernatorial nomination, endorsed each other and have joined forces on the campaign trail.",
    "author": "",
    "title": "Three-way Oz-Barnette-McCormick clash for GOP Senate nomination on eve of Pennsylvania primary",
    "sentiment": "0.0"
  },
  {
    "id": 6784,
    "mediaId": 21,
    "date": "2022-00-16",
    "sentence": "She and state-Sen. <span class='selected-term'>Doug Mastriano</span>, the frontrunner in the Republican Party's gubernatorial race, were both in Washington and attended the rally on January 6.",
    "author": "Brent D. Griffiths",
    "title": "Republican Senate candidate Kathy Barnette marched alongside a Proud Boy on January 6: report",
    "sentiment": "0.0"
  },
  {
    "id": 6786,
    "mediaId": 195,
    "date": "2022-00-16",
    "sentence": "Across the aisle in the Keystone State, former President Trump made his long-awaited play in the gubernatorial contest by endorsing state Sen. <span class='selected-term'>Doug Mastriano</span> (R), who has echoed Trumps false claims that there was widespread voter fraud in the 2020 election (The Hill).",
    "author": "Alexis Simendinger",
    "title": "The Hills Morning Report  Biden to visit Buffalo after mass shooting",
    "sentiment": "0.0"
  },
  {
    "id": 6788,
    "mediaId": 881,
    "date": "2022-00-16",
    "sentence": "(Michael M. Santiago/Getty Images)\nMAGA <span class='selected-term'>Doug Mastriano</span> and Kathy Barnette both look poised to win, in what one GOP former congressman calls a double-nightmare scenario.?\nA pair of fringe conspiracy theorists have seized the momentum to be the Republican Partys nominees for governor and senator in Pennsylvaniaa prospect thats alarming to Republicans who think theyll lose the general election, and even more concerning for democracy if they win it in the nations largest swing state.",
    "author": "",
    "title": "A MAGA star is born",
    "sentiment": "0.0"
  },
  {
    "id": 6790,
    "mediaId": 157,
    "date": "2022-00-16",
    "sentence": "Fringe candidate <span class='selected-term'>Doug Mastriano</span> has been enthusiastically endorsed by former President Donald Trump and appears likely to prevail in the primary on Tuesday.",
    "author": "Sarah K. Burris",
    "title": "Republicans are already accepting defeat in Pa. governor's race -- and are looking for someone to blame",
    "sentiment": "0.0"
  },
  {
    "id": 6793,
    "mediaId": 234,
    "date": "2022-00-16",
    "sentence": "Three weeks after the 2020 election was called for Joe Biden, Pennsylvania State Senator <span class='selected-term'>Doug Mastriano</span> introduced a resolution to throw out the results of the popular vote and to have the Republican-controlled state chambers appoint their own electorsones that would presumably hand the state to Donald Trump, who was cheated? out of reelection through a corrupt? election process, he said.",
    "author": "Eric Lutz",
    "title": "Pennsylvanias Republican Primary Clown Show Is Coming Down to the Wire",
    "sentiment": "0.0"
  },
  {
    "id": 7018,
    "mediaId": 124,
    "date": "2022-00-16",
    "sentence": "The Jan. 6 committee has issued six new subpoenas related to the push to appoint alternate electors,? including Arizona Republican Party Chair Kelli Ward, Pennsylvania Republican State Sen. <span class='selected-term'>Doug Mastriano</span>, who is running for governor, and Arizona GOP Secretary of State candidate Mark FInchem.",
    "author": "",
    "title": "In Ukraine, Biden faces a crisis with little political benefit back home",
    "sentiment": "0.0"
  },
  {
    "id": 7019,
    "mediaId": 238,
    "date": "2022-00-16",
    "sentence": "Arizona Republican Party chairwoman Kelli Ward\nArizona state Rep. Mark Finchem (R), who is running for Arizona secretary of state\nPennsylvania state senator and gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> (R)\nFormer Michigan Republican Party chair Laura Cox\nMichael Roman and Gary Brown, the director and deputy director of Election Day operations for Trumps reelection campaign\nThe committee previously subpoenaed Trump electors from multiple states won by Biden that sent paperwork to Washington certifying their votes for Trump,? Tom and Jacqueline write.",
    "author": "",
    "title": "The cyber fight in Ukraine is getting more serious",
    "sentiment": "0.0"
  },
  {
    "id": 7023,
    "mediaId": 157,
    "date": "2022-00-16",
    "sentence": "The House committee investigating the Jan. 6, 2021, attack on the U.S. Capitol and efforts to overturn the 2020 election issued subpoenas for six more people Tuesday, including state Sen. <span class='selected-term'>Doug Mastriano</span>, R-Franklin.",
    "author": "",
    "title": "Trump ally hit with Jan. 6 subpoena as committee digs into GOP's phony electors scheme",
    "sentiment": "0.0"
  },
  {
    "id": 3407,
    "mediaId": 323,
    "date": "2022-00-17",
    "sentence": "Josh Shapiro, the state's attorney general, is unopposed for the Democratic nomination, while state Sen. <span class='selected-term'>Doug Mastriano</span>, a leading figure in pushing the state to review Mr. Biden's victory in the state's 2020 vote count over Mr. Trump, holds a lead in public opinion surveys for the GOP nomination over seven other candidates.",
    "author": "Aaron Zitner",
    "title": "Pennsylvania Senate GOP Contest Headlines Crucial Slate of Primaries",
    "sentiment": "0.0"
  },
  {
    "id": 3408,
    "mediaId": 195,
    "date": "2022-00-17",
    "sentence": "Likewise, in the state's GOP gubernatorial primary, Republican <span class='selected-term'>Doug Mastriano</span>, who advocated for the 2020 presidential election results to be overturned, appears to be the favorite to clinch the nomination to take on Democrat Josh Shapiro in November.",
    "author": "Max Greenwood",
    "title": "Five things to watch in North Carolina, Pennsylvania primaries",
    "sentiment": "0.0"
  },
  {
    "id": 4483,
    "mediaId": 238,
    "date": "2022-00-17",
    "sentence": "Thats what could happen in Pennsylvania, where state Sen. <span class='selected-term'>Doug Mastriano</span> and Kathy Barnette could capture the partys nods for governor and U.S. senator, respectively.",
    "author": "Henry Olsen",
    "title": "Opinion Republicans have only themselves to blame for unelectable big lie candidates",
    "sentiment": "0.0"
  },
  {
    "id": 6503,
    "mediaId": 43,
    "date": "2022-00-17",
    "sentence": "A recent poll for Fox found the GOP primary very wide open with former Rep. Lou Barletta, who badly lost the 2018 Senate race to Democratic incumbent Bob Casey, posting a tiny 19-18 edge over state Sen. <span class='selected-term'>Doug Mastriano</span>, an ardent election denier who was filmed on Jan. 6 apparently passing breached barricades at the Capitol.",
    "author": "",
    "title": "Morning Digest: This swing seat in Pittsburgh suburbs went blue in 2018, but will it stay that way?",
    "sentiment": "0.0"
  },
  {
    "id": 6715,
    "mediaId": 132,
    "date": "2022-00-17",
    "sentence": "HARRISBURG, Pa.  <span class='selected-term'>Doug Mastriano</span> won the Republican nomination for Pennsylvania governor on Tuesday, beating eight other candidates and a party establishment that had tried to head off his nomination over fears that he is too extreme to win the general election in the presidential battleground.",
    "author": "",
    "title": "Trump-backed Mastriano wins GOP Pennsylvania governor nod",
    "sentiment": "0.0"
  },
  {
    "id": 6716,
    "mediaId": 129,
    "date": "2022-00-17",
    "sentence": "The former president also endorsed <span class='selected-term'>Doug Mastriano</span>, a far-right loyalist who has promoted conspiracy theories and is the leading Republican candidate for governor.",
    "author": "",
    "title": "Your Tuesday Evening Briefing",
    "sentiment": "0.0"
  },
  {
    "id": 6721,
    "mediaId": 65,
    "date": "2022-00-17",
    "sentence": "FAST FACTS\nTrump-backed Pennsylvania Senate candidate Mehmet Oz is in a tight race with former hedge fund executive Dave McCormick and conservative commentator Kathy Barnette\nThe GOP establishment, including Trump, has attacked Barnette as not sufficiently vetted and warned she may not be able to win the general election in Pennsylvania\nTrump-backed Pennsylvania governor candidate <span class='selected-term'>Doug Mastriano</span>, who's focused on Trump's false claims the 2020 election was stolen, surged ahead of primary day.",
    "author": "Tyler Olson",
    "title": "Voters decide Pennsylvania, North Carolina, Idaho primaries, in test of Trump's clout: LIVE UPDATES",
    "sentiment": "0.0"
  },
  {
    "id": 6723,
    "mediaId": 558,
    "date": "2022-00-17",
    "sentence": "Pennsylvania state Senator <span class='selected-term'>Doug Mastriano</span>, who has amplified Trump's false claims of 2020 voter fraud, will face Democratic Attorney-General Josh Shapiro in a high-profile governor's race.",
    "author": "",
    "title": "Trump-backed candidates win midterm nods",
    "sentiment": "0.0"
  },
  {
    "id": 6731,
    "mediaId": 558,
    "date": "2022-00-17",
    "sentence": "PITTSBURGH  State Sen. <span class='selected-term'>Doug Mastriano</span>, who attended the Jan. 6 Stop the Steal? rally and worked with former President Trumps legal team to overturn the 2020 election results, won the Republican governors primary in Pennsylvania Tuesday night.",
    "author": "Christopher Wilson",
    "title": "Jan. 6 rally attendee Doug Mastriano wins Republican primary for Pennsylvania governor",
    "sentiment": "0.0"
  },
  {
    "id": 6733,
    "mediaId": 65,
    "date": "2022-00-17",
    "sentence": "Barnettes rise in the polls may have been partially fueled by her alliance with Sen. <span class='selected-term'>Doug Mastriano</span>, the polling front-runner for Pennsylvanias GOP gubernatorial primary.",
    "author": "Paul Steinhauser",
    "title": "Oz, Barnette, McCormick cast votes in crucial Pennsylvania GOP Senate primary",
    "sentiment": "0.0"
  },
  {
    "id": 6741,
    "mediaId": 233,
    "date": "2022-00-17",
    "sentence": "Taylor Wilson:\nIn Pennsylvania's Republican primary for governor, state Senator <span class='selected-term'>Doug Mastriano</span> leads the pack in polling.",
    "author": "Taylor Wilson",
    "title": "Key races in PA, NC highlight busy primary day, Biden heads to Buffalo: 5 Things podcast",
    "sentiment": "0.0"
  },
  {
    "id": 6744,
    "mediaId": 65,
    "date": "2022-00-17",
    "sentence": "Trump made a late game endorsement on Saturday of state Sen. <span class='selected-term'>Doug Mastriano</span>, the polling front-runner.",
    "author": "",
    "title": "Trump's GOP clout on the line in high profile Republican primaries in Pennsylvania, North Carolina, Idaho",
    "sentiment": "0.0"
  },
  {
    "id": 4468,
    "mediaId": 129,
    "date": "2022-00-18",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0.0"
  },
  {
    "id": 4469,
    "mediaId": 129,
    "date": "2022-00-18",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0.0"
  },
  {
    "id": 5469,
    "mediaId": 129,
    "date": "2022-00-18",
    "sentence": "A victory in Pennsylvania, and one key race was too close to call\n<span class='selected-term'>Doug Mastriano</span>, a state senator and retired Army colonel who has propagated myriad false claims about the 2020 election and attended the protest leading up to the Capitol riot, won the Republican nomination for Pennsylvania governor.",
    "author": "",
    "title": "Heres where Trumps endorsement record stands so far.",
    "sentiment": "0.0"
  },
  {
    "id": 6609,
    "mediaId": 238,
    "date": "2022-00-18",
    "sentence": "As a Pennsylvania state senator and gubernatorial candidate, <span class='selected-term'>Doug Mastriano</span> railed against the rampant fraud that he believes was responsible for Donald Trumps 2020 defeat.",
    "author": "Josh Dawsey",
    "title": "Doug Mastrianos Pa. victory could give 2020 denier oversight of 2024",
    "sentiment": "0.0"
  },
  {
    "id": 6611,
    "mediaId": 129,
    "date": "2022-00-18",
    "sentence": "The aftershocks of Tuesdays big primaries are still rumbling across Pennsylvania, but one impact is already clear: Republican voters choice of <span class='selected-term'>Doug Mastriano</span> in the governors race is giving the G.O.P.",
    "author": "",
    "title": "Republican Panic Grows After Mastriano Wins",
    "sentiment": "0.0"
  },
  {
    "id": 6612,
    "mediaId": 147,
    "date": "2022-00-18",
    "sentence": "In Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, the now Republican nominee for the gubernatorial contest in Pennsylvania, was endorsed kind of in the 11th hour by President Trump.",
    "author": "Lisa Desjardins",
    "title": "Breaking down the primary results and what they mean for midterm elections",
    "sentiment": "0.0"
  },
  {
    "id": 6619,
    "mediaId": 233,
    "date": "2022-00-18",
    "sentence": "Republicans were sharply divided in Tuesday primaries\n<span class='selected-term'>Doug Mastriano</span>, a state senator and outspoken election denier, won the GOP bid for Pa. governor\nA winner in Pa. said he wouldn't have certified Biden's victory in 2020\nAnalyst says Trump is a \"cancer on the Republican Party\"\nWASHINGTON  If the latest primaries are any indication, the wounds from the 2020 election and the violent insurrection that followed it still run deep  and figure to get worse during the 2022 midterm elections.",
    "author": "David Jackson",
    "title": "In primaries, a spotlight on the unhealed wounds of 2020 - and the ongoing divisions in America",
    "sentiment": "0.0"
  },
  {
    "id": 6623,
    "mediaId": 238,
    "date": "2022-00-18",
    "sentence": "Republican voters overwhelmingly nominated state Sen. <span class='selected-term'>Doug Mastriano</span>, one of the countrys most ardent deniers of the 2020 presidential election result.",
    "author": "Editorial Board",
    "title": "Opinion After the Pennsylvania primary, the threat to U.S. democracy rises",
    "sentiment": "0.0"
  },
  {
    "id": 6624,
    "mediaId": 238,
    "date": "2022-00-18",
    "sentence": "The most important and frightening outcome is the decision of Pennsylvanias Republicans  by a big margin  to make extremist state Sen. <span class='selected-term'>Doug Mastriano</span> their partys nominee for governor.",
    "author": "E.J. Dionne Jr.",
    "title": "Opinion Tuesday primaries show that Trumpism has metastasized",
    "sentiment": "0.0"
  },
  {
    "id": 6625,
    "mediaId": 558,
    "date": "2022-00-18",
    "sentence": "In Pennsylvania, state senator and election denier <span class='selected-term'>Doug Mastriano</span>, who helped Trump try to overturn the state's 2020 results that favored Biden, swatted away several less controversial Republicans Tuesday to win the party's nomination for governor.",
    "author": "Frankie TAGGART",
    "title": "US midterms and the strange demise of the political center",
    "sentiment": "0.0"
  },
  {
    "id": 6627,
    "mediaId": 65,
    "date": "2022-00-18",
    "sentence": "In the gubernatorial election, President Trumps endorsement propelled conservative State Sen. <span class='selected-term'>Doug Mastriano</span> to victory.",
    "author": "David N. Bossie",
    "title": "Pennsylvania proves Republicans still want 'America First'",
    "sentiment": "0.0"
  },
  {
    "id": 6631,
    "mediaId": 238,
    "date": "2022-00-18",
    "sentence": "Now that <span class='selected-term'>Doug Mastriano</span> has won the GOP nomination for governor in Pennsylvania, countless news accounts are describing him with that phrase.",
    "author": "Greg Sargent",
    "title": "Opinion Say it clearly: Republicans just nominated a pro-Trump insurrectionist",
    "sentiment": "0.0"
  },
  {
    "id": 6633,
    "mediaId": 136,
    "date": "2022-00-18",
    "sentence": "\"After 8 years of the disastrous policies of Tom Wolf, Republican voters in Pennsylvania have chosen <span class='selected-term'>Doug Mastriano</span> as their nominee for Governor,\" RGA Executive Director Dave Rexrode said after the gubernatorial primary.",
    "author": "Katherine Fung",
    "title": "Donald Trump Scored Key Ally for 2024 Election Last Night",
    "sentiment": "0.0"
  },
  {
    "id": 6634,
    "mediaId": 65,
    "date": "2022-00-18",
    "sentence": "Trump's grip on the GOP was further illustrated Tuesday night when Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a strong supporter of Trumps repeated attempts the past year and a half to re-litigate his 2020 election loss, won his primary.",
    "author": "Tyler Olson",
    "title": "Stefanik, Mullin introduce House resolution to expunge second Trump impeachment",
    "sentiment": "0.0"
  },
  {
    "id": 6635,
    "mediaId": 881,
    "date": "2022-00-18",
    "sentence": "",
    "author": "Cameron Joseph",
    "title": "A QAnon-Loving Election Denier Just Won Pennsylvanias GOP Governor Primary",
    "sentiment": "0.0"
  },
  {
    "id": 6637,
    "mediaId": 169,
    "date": "2022-00-18",
    "sentence": "It is true that Republican strategists are sweating the winner of the GOP gubernatorial primary, <span class='selected-term'>Doug Mastriano</span>, who tends to be more loudmouthed about his insurrectionist views than other Republican candidates.",
    "author": "Amanda Marcotte",
    "title": "Less Madison Cawthorn, more dumpy fascists in bad suits: Republicans embrace covert Big Liars",
    "sentiment": "0.0"
  },
  {
    "id": 6640,
    "mediaId": 323,
    "date": "2022-00-18",
    "sentence": "Democrats and some Republicans believe that could be the case for <span class='selected-term'>Doug Mastriano</span>, a strong supporter of the former presidents false allegations of widespread fraud in the 2020 presidential election.",
    "author": "John McCormick",
    "title": "Pennsylvania GOP Senate Race Might Be Headed for Recount",
    "sentiment": "0.0"
  },
  {
    "id": 6642,
    "mediaId": 136,
    "date": "2022-00-18",
    "sentence": "Right-wing Candidates and the 'Big Lie'\nRight-wing Republican candidates have performed well in Tuesday's elections, in particular Pennsylvania state Senator <span class='selected-term'>Doug Mastriano</span> who will now be the party's nominee for governor.",
    "author": "Darragh Roche",
    "title": "Five Key Takeaways From Primary Election Results",
    "sentiment": "0.0"
  },
  {
    "id": 6647,
    "mediaId": 238,
    "date": "2022-00-18",
    "sentence": "The Posts Annie Linskey and David Weigel report that in Pennsylvania, state Sen. <span class='selected-term'>Doug Mastriano</span>, a Trump-endorsed candidate who led an effort to overturn the election in his state and attended the Stop the Steal? rally on Jan. 6, 2021, the day a pro-Trump mob attacked the U.S. Capitol, won the Republican nomination for governor.",
    "author": "Mariana Alfaro",
    "title": "Midterms live updates Oz, McCormick neck and neck in Pa. GOP Senate race",
    "sentiment": "0.0"
  },
  {
    "id": 6653,
    "mediaId": 65,
    "date": "2022-00-18",
    "sentence": "Trump was a winner in Pennsylvanias GOP gubernatorial primary, as state Sen. <span class='selected-term'>Doug Mastriano</span> bested a crowded field of contenders.",
    "author": "",
    "title": "Trump-backed Dr. Oz and Dave McCormick go into overtime in Pennsylvanias crucial GOP Senate primary",
    "sentiment": "0.0"
  },
  {
    "id": 6655,
    "mediaId": 169,
    "date": "2022-00-18",
    "sentence": "They'll join Trump-backed gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a state senator who attended the Jan. 6 rally ahead of the Capitol riot and served as a phony Trump elector in an effort to overturn his loss.",
    "author": "Igor Derysh",
    "title": "Cawthorns loss highlights Trumps waning influence but election deniers win big in GOP primaries",
    "sentiment": "0.0"
  },
  {
    "id": 6668,
    "mediaId": 65,
    "date": "2022-00-18",
    "sentence": "The same was true for many in the governor's race, where State Sen. <span class='selected-term'>Doug Mastriano</span> of Gettysburg was projected the winner by the Associated Press.",
    "author": "",
    "title": "Conway: Pennsylvania primary GOP bids embraced Trump while Democrats shunned Biden",
    "sentiment": "0.0"
  },
  {
    "id": 6692,
    "mediaId": 238,
    "date": "2022-00-18",
    "sentence": "Second, the nominee he backed for governor, <span class='selected-term'>Doug Mastriano</span>, won the primary and if he wins the election in November, Mastriano would have considerable influence over how the state's presidential election results are handled in 2024 when Trump may be on the ballot as our colleague's Rosalind S. Helderman, Isaac Arnsdorf and Josh Dawsey explain.",
    "author": "Theodoric Meyer",
    "title": "Trump uses Pa. primary to continue effort to undermine electoral system",
    "sentiment": "0.0"
  },
  {
    "id": 6694,
    "mediaId": 33,
    "date": "2022-00-18",
    "sentence": "Un negador de elecciones podra tener poder sobre las elecciones de Pensilvania de 2024\nEn el senador estatal <span class='selected-term'>Doug Mastriano</span>, los republicanos de Pensilvania han nominado para gobernador a una voz destacada que promueve las mentiras de Trump sobre el fraude electoral, lo que aumenta la posibilidad de que alguien que ya intent anular la voluntad de los votantes en 2020 tendra poder sobre la maquinaria electoral de uno de los estados de campo de batalla presidencial ms importantes de la nacin en 2024.",
    "author": "Dan Merica",
    "title": "6 conclusiones de las primarias en Pensilvania, Carolina del Norte y ms",
    "sentiment": "0.0"
  },
  {
    "id": 6695,
    "mediaId": 1576,
    "date": "2022-00-18",
    "sentence": "His pick for governor, state Sen. <span class='selected-term'>Doug Mastriano</span>, won the nomination.",
    "author": "",
    "title": "With a key race too close to call, here are 4 takeaways from Tuesday's primaries",
    "sentiment": "0.0"
  },
  {
    "id": 6704,
    "mediaId": 129,
    "date": "2022-00-18",
    "sentence": "",
    "author": "",
    "title": "Your Wednesday Evening Briefing",
    "sentiment": "0.0"
  },
  {
    "id": 6711,
    "mediaId": 234,
    "date": "2022-00-18",
    "sentence": "If youre not familiar with <span class='selected-term'>Doug Mastriano</span>, a quick primer on the state senator turned gubernatorial candidate:\nOn November 5, 2020, he called for the resignation of Kathy Boockvar, the then secretary of the Pennsylvania Commonwealth, claiming that Pennsylvanians no longer feel secure in casting their vote?;\nHe wrote an email to a Department of Justice official, and asked that it be passed on to the then acting attorney general, in which he raised a litany of false and debunked claims of widespread election fraud in Pennsylvania, which Mastriano had previously aired at a November 25, 2020, hearing at a hotel in Gettysburg featuring Trump campaign lawyers Rudy Giuliani and Jenna Ellis,? as well as Trump himself via phone;\nAfter Bidens PA win was official, he introduced a resolution to throw out the votes and just appoint Trump electors;\nHe used campaign funds to charter busses to the Stop the Steal? rally that preceded the violent riot;\nVideo footage shows that he and his wife took part in the...insurrection,? having crossed police lines and breaching the barricades set up at the Capitol;\nOn March 30, 2022, while campaigning for governor, he said: Im Doug Mastriano, and [if elected] I get to appoint the secretary of state whos delegated from me the power to make the corrections to elections, the voting logs and everything.",
    "author": "Bess Levin",
    "title": "Report: Trump Thinks Truth Social Is a Failure Because Google Is Trying to F--k Him",
    "sentiment": "0.0"
  },
  {
    "id": 6713,
    "mediaId": 157,
    "date": "2022-00-18",
    "sentence": "It is true that Republican strategists are sweating the winner of the GOP gubernatorial primary, <span class='selected-term'>Doug Mastriano</span>, who tends to be more loudmouthed about his insurrectionist views than other Republican candidates.",
    "author": "Amanda Marcotte",
    "title": "GOP drops the flash but keeps the fascism",
    "sentiment": "0.0"
  },
  {
    "id": 4456,
    "mediaId": 238,
    "date": "2022-00-19",
    "sentence": "Republicans are in full-scale panic about <span class='selected-term'>Doug Mastriano</span>, the right-wing extremist who won the GOP primary for Pennsylvania governor this week.",
    "author": "Greg Sargent",
    "title": "Opinion Trumps alarming GOP primary wins demand a serious response",
    "sentiment": "0.0"
  },
  {
    "id": 4458,
    "mediaId": 129,
    "date": "2022-00-19",
    "sentence": "In Pennsylvania, Republican voters united behind a nominee for governor, <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots",
    "sentiment": "0.0"
  },
  {
    "id": 4466,
    "mediaId": 302,
    "date": "2022-00-19",
    "sentence": "And in Pennsylvanias GOP race for governor, Trumps endorsed candidate, the far-right <span class='selected-term'>Doug Mastriano</span>, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "author": "Associated Press",
    "title": "Biden invokes Defense Production Act for baby formula shortage",
    "sentiment": "0.0"
  },
  {
    "id": 6583,
    "mediaId": 195,
    "date": "2022-00-19",
    "sentence": "The contest for governor will feature the Democratic Attorney General Ben Shapiro and GOP State Sen. <span class='selected-term'>Doug Mastriano</span>, another Republican endorsed by Trump.",
    "author": "Brad Bannon",
    "title": "Party primaries test power of Trumps backing and progressive platform",
    "sentiment": "0.0"
  },
  {
    "id": 6587,
    "mediaId": 323,
    "date": "2022-00-19",
    "sentence": "His advice to Mr. Oz is also a warning about how <span class='selected-term'>Doug Mastriano</span>, the GOPs gubernatorial nominee, might react to a loss in the fall.",
    "author": "The Editorial Board",
    "title": "Welcome to Stop the Steal, 2022",
    "sentiment": "0.0"
  },
  {
    "id": 6589,
    "mediaId": 409,
    "date": "2022-00-19",
    "sentence": "The <span class='selected-term'>Doug Mastriano</span> win should remind us that the Republican Party is still capable of blowing the coming midterms.",
    "author": "Charles C. W. Cooke",
    "title": "Republicans Can Still Blow the 2022 Midterms",
    "sentiment": "0.0"
  },
  {
    "id": 6592,
    "mediaId": 558,
    "date": "2022-00-19",
    "sentence": "I would think that he [Trump] would be very interested in <span class='selected-term'>Doug Mastriano</span> moderating his message and trying to run as someone who can appeal to all Pennsylvanians,? said David Urban, a former Trump campaign adviser who helped him win Pennsylvania in 2016 (Trump lost the state in 2020).",
    "author": "",
    "title": "Trump leaves Pennsylvania GOP fuming over 'cockamamie election.' Next up: Georgia.",
    "sentiment": "0.0"
  },
  {
    "id": 6597,
    "mediaId": 136,
    "date": "2022-00-19",
    "sentence": "In a very last-minute endorsement, Trump on May 14 threw his support behind <span class='selected-term'>Doug Mastriano</span>, now the Republican candidate for governor in Pennsylvania after Tuesday's primary  to the frustration of the GOP establishment in the state.",
    "author": "Bill Powell",
    "title": "Democrats Want to Campaign Against MAGA Candidates",
    "sentiment": "0.0"
  },
  {
    "id": 6600,
    "mediaId": 33,
    "date": "2022-00-19",
    "sentence": "As does the runaway victor in the commonwealth's GOP gubernatorial primary -- state Sen. <span class='selected-term'>Doug Mastriano</span>, who ran a campaign rooted in Trump's falsehoods about the last presidential election being stolen and who could oversee the 2024 White House race in the state if he wins in November.",
    "author": "Stephen Collinson",
    "title": "Trump taints Pennsylvania GOP Senate primary with fresh fraud lies",
    "sentiment": "0.0"
  },
  {
    "id": 6602,
    "mediaId": 33,
    "date": "2022-00-19",
    "sentence": "Una situacin parecida al del vencedor en las primarias republicanas para gobernador, el senador estatal <span class='selected-term'>Doug Mastriano</span>, quien dirigi una campaa basada en las falsedades de Trump sobre el robo de las ltimas elecciones presidenciales y quien podra supervisar la carrera por la Casa Blanca de 2024 en el estado si gana en noviembre.",
    "author": "",
    "title": "ANLISIS | Trump contamina las primarias republicanas del Senado de Pensilvania con nuevas mentiras sobre fraude electoral",
    "sentiment": "0.0"
  },
  {
    "id": 6608,
    "mediaId": 234,
    "date": "2022-00-19",
    "sentence": "It helped Pennsylvanias <span class='selected-term'>Doug Mastriano</span> claim a double-digit victory in his Republican gubernatorial race.",
    "author": "Eric Lutz",
    "title": "Donald Trumps Georgia Revenge Fantasy Isnt Quite Panning Out",
    "sentiment": "0.0"
  },
  {
    "id": 6987,
    "mediaId": 129,
    "date": "2022-00-19",
    "sentence": "Meanwhile, some Republican politicians and candidates have come to pay their respects at the speedway camp, including Senator Ted Cruz of Texas and <span class='selected-term'>Doug Mastriano</span>, a Pennsylvania state senator and candidate for governor who chartered buses to Mr. Trumps Jan. 6 rally preceding the storming of the Capitol.",
    "author": "",
    "title": "Trucker Protest Moved by More Than Opposition to Covid Mandates",
    "sentiment": "0.0"
  },
  {
    "id": 7548,
    "mediaId": 129,
    "date": "2022-00-19",
    "sentence": "In Pennsylvania, <span class='selected-term'>Doug Mastriano</span>s win in the Republican primary for governor is causing alarm in the G.O.P.",
    "author": "",
    "title": "Your Thursday Evening Briefing",
    "sentiment": "0.0"
  },
  {
    "id": 6538,
    "mediaId": 195,
    "date": "2022-00-20",
    "sentence": "In Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, who backs Trump's false claims of election fraud and marched to the Capitol on Jan. 6, will be the GOP's gubernatorial candidate.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump faces critical popularity test in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 6564,
    "mediaId": 132,
    "date": "2022-00-20",
    "sentence": "It would be a terrible legacy for this to be the American generation that hands nearly 250 years of sacrosanct democratic tradition to the <span class='selected-term'>Doug Mastriano</span>s of the moment and say, \"Here, you throw this away.\"",
    "author": "Gene Collier",
    "title": "Are the 2022 primaries America's last legit election?",
    "sentiment": "0.0"
  },
  {
    "id": 6566,
    "mediaId": 238,
    "date": "2022-00-20",
    "sentence": "Return to menu\nTwo decades before he was the Republican nominee for Pennsylvania governor, <span class='selected-term'>Doug Mastriano</span> warned in a masters thesis that the United States was vulnerable to a left-wing Hitlerian Putsch? that would begin with the dismantling of the U.S. military and end with the destruction of the countrys democracy.",
    "author": "Mariana Alfaro",
    "title": "Post Politics Now Senate primary in Pa. still unresolved as other tests of Trumps influence loom",
    "sentiment": "0.0"
  },
  {
    "id": 6573,
    "mediaId": 558,
    "date": "2022-00-20",
    "sentence": "As Donald Trump tried to overturn the results of the 2020 election, there were few officials more willing to help than <span class='selected-term'>Doug Mastriano</span>, then a little-known Pennsylvania state senator.",
    "author": "Sam Levine",
    "title": "Trump loyalists primary win prompts election fears in Pennsylvania",
    "sentiment": "0.0"
  },
  {
    "id": 6575,
    "mediaId": 129,
    "date": "2022-00-20",
    "sentence": "The Republican nominee for governor in Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, won his race on the strength of his enthusiastic support for Donald Trumps effort to subvert and overturn the results of the 2020 presidential election.",
    "author": "",
    "title": "Its Trumps Party, and Hell Lie if He Wants To",
    "sentiment": "0.0"
  },
  {
    "id": 6576,
    "mediaId": 33,
    "date": "2022-00-20",
    "sentence": "Algunos de ellos, por ejemplo, el recin nombrado candidato republicano a gobernador de Pensilvania, <span class='selected-term'>Doug Mastriano</span>, han adoptado posiciones extremas sobre el fraude electoral de 2020 que plantean serios desafos para el propio sistema poltico de Estados Unidos.",
    "author": "",
    "title": "ANLISIS | Los golpes econmicos siguen llegando mientras el regreso a la normalidad prometido por Biden sigue eludiendo Estados Unidos",
    "sentiment": "0.0"
  },
  {
    "id": 6556,
    "mediaId": 151,
    "date": "2022-00-21",
    "sentence": "CONCERN IN THE KEYSTONE: Republican operatives in Pennsylvania mounted an all-out blitz to stop state Sen. <span class='selected-term'>DOUG MASTRIANO</span> from winning the GOP gubernatorial nomination.",
    "author": "",
    "title": "POLITICO Playbook: Sean Patrick Maloney dodges a bullet",
    "sentiment": "0.0"
  },
  {
    "id": 6557,
    "mediaId": 129,
    "date": "2022-00-21",
    "sentence": "As Reid Epstein wrote in The Times, Republican voters in Pennsylvania anointed right-wing gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.?\nMastriano spread conspiracies about 2020 phantom ballots, hacked machines and dead voters.",
    "author": "",
    "title": "Johnny Depp and Other Pirates",
    "sentiment": "0.0"
  },
  {
    "id": 7216,
    "mediaId": 195,
    "date": "2022-00-22",
    "sentence": "He will now face state Sen. <span class='selected-term'>Doug Mastriano</span> (R), who has the backing of former President Trump, in the general election.",
    "author": "Mychael Schnell",
    "title": "Shapiro says he would welcome Biden to Pennsylvania amid gubernatorial race",
    "sentiment": "0.0"
  },
  {
    "id": 7219,
    "mediaId": 129,
    "date": "2022-00-22",
    "sentence": "",
    "author": "",
    "title": "How Trumps 2020 Election Lies Have Gripped State Legislatures",
    "sentiment": "0.0"
  },
  {
    "id": 7220,
    "mediaId": 129,
    "date": "2022-00-22",
    "sentence": "",
    "author": "Nick Corasaniti",
    "title": "How Trumps 2020 Election Lies Have Gripped State Legislatures",
    "sentiment": "0.0"
  },
  {
    "id": 7228,
    "mediaId": 129,
    "date": "2022-00-22",
    "sentence": "Republicans have already elevated candidates like State Senator <span class='selected-term'>Doug Mastriano</span>, a far-right 2020 election denier who is the Republican nominee for governor in Pennsylvania.",
    "author": "",
    "title": "Democrats Fight Headwinds in Georgia and Beyond: The Problem Is Reality",
    "sentiment": "0.0"
  },
  {
    "id": 7229,
    "mediaId": 129,
    "date": "2022-00-22",
    "sentence": "Not when people like Pennsylvania State Senator <span class='selected-term'>Doug Mastriano</span>  an election denier who marched with the Jan. 6 crowd at the Capitol  just won the G.O.P.",
    "author": "",
    "title": "My Lunch With President Biden",
    "sentiment": "0.0"
  },
  {
    "id": 7193,
    "mediaId": 157,
    "date": "2022-00-23",
    "sentence": "Prevailing there, was <span class='selected-term'>Doug Mastriano</span>, someone that is so far right that even Donald Trump wouldn't endorse him until the final week of the campaign.",
    "author": "Sarah K. Burris",
    "title": "John Oliver reveals why Republicans assume Doug Mastriano will lead them into a disastrous election in November",
    "sentiment": "0.0"
  },
  {
    "id": 7212,
    "mediaId": 195,
    "date": "2022-00-23",
    "sentence": " Politico: Dem-allied groups drop an A-bomb on state Sen. <span class='selected-term'>Doug Mastriano</span> (R) to start Pennsylvania governors race.",
    "author": "Alexis Simendinger",
    "title": "The Hills Morning Report  Biden: US economy has problems; vows Taiwan defense",
    "sentiment": "0.0"
  },
  {
    "id": 7288,
    "mediaId": 136,
    "date": "2022-00-23",
    "sentence": "The races are being closely watched to see if more far-right candidates across the country can follow in the footsteps of <span class='selected-term'>Doug Mastriano</span>, who won Pennsylvania's Republican primary race for governor last week by running a campaign focused on pushing Trump's election falsehoods.",
    "author": "Daniel Bush",
    "title": "Georgia Primaries Will Test Trump's Revenge Campaign Against GOP Incumbents",
    "sentiment": "0.0"
  },
  {
    "id": 7289,
    "mediaId": 129,
    "date": "2022-00-23",
    "sentence": "During the Republican primary in Pennsylvania, Mr. Shapiro, the state's attorney general, ran an ad that called State Senator <span class='selected-term'>Doug Mastriano</span> one of Donald Trump's strongest supporters.",
    "author": "",
    "title": "Democrats are mindful of headwinds in Georgia, and everywhere else.",
    "sentiment": "0.0"
  },
  {
    "id": 7326,
    "mediaId": 1546,
    "date": "2022-00-23",
    "sentence": "Last week, Trump-endorsed <span class='selected-term'>Doug Mastriano</span>, who supports Trump's claims of election fraud, won the Pennsylvania gubernatorial nomination.",
    "author": "Ken Bredemeier",
    "title": "Trump's Election Fraud Claims Face a Test in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7351,
    "mediaId": 223,
    "date": "2022-00-24",
    "sentence": "The governor's race between Democrat and current Attorney General Josh Shapiro and Republican state Sen. <span class='selected-term'>Doug Mastriano</span> is the only major race in the state that heavily favors the Democrats.",
    "author": "Salena Zito",
    "title": "The Conservative Populist Coalition Has Grown in Pennsylvania. What That Means Going Forward Is Important",
    "sentiment": "0.0"
  },
  {
    "id": 6946,
    "mediaId": 43,
    "date": "2022-00-26",
    "sentence": "Clements filing contends conservative state Sen. <span class='selected-term'>Doug Mastriano</span> is disqualified from seeking public office because of his efforts to overthrow the election of President Joe Biden.",
    "author": "",
    "title": "Dr. Mehmet Oz (R. NJ), \"We cannot move on from the 2020 election\"",
    "sentiment": "0.0"
  },
  {
    "id": 6947,
    "mediaId": 43,
    "date": "2022-00-26",
    "sentence": "One of them is State Sen. <span class='selected-term'>Doug Mastriano</span>, a Trump-loving guy who attended the Jan. 6 insurrection at the Capitol in Washington last year.",
    "author": "",
    "title": "Is Pennsylvania a Dead State Walking?",
    "sentiment": "0.0"
  },
  {
    "id": 8468,
    "mediaId": 151,
    "date": "2022-00-26",
    "sentence": "Some Republican candidates are true believers, like Pennsylvania gubernatorial nominee <span class='selected-term'>Doug Mastriano</span> and the out-of-nowhere serious contender for the Senate nomination in Pennsylvania, Kathy Barnette, both of whom were outside the U.S. Capitol on Jan. 6.",
    "author": "",
    "title": "Why Trump's Fantasies Couldn't Doom Kemp and Raffensperger",
    "sentiment": "0.0"
  },
  {
    "id": 8471,
    "mediaId": 558,
    "date": "2022-00-26",
    "sentence": "When 2020 election denialist <span class='selected-term'>Doug Mastriano</span> won last week's GOP primary for Pennsylvania governor, a Guardian op-ed called him one of the most radical gubernatorial candidates ever to receive a major party nomination.",
    "author": "Andrew Romano",
    "title": "Struggling Dems look to a risky strategy: Meddling in GOP primaries to boost 'unelectable' Republicans",
    "sentiment": "0.0"
  },
  {
    "id": 8462,
    "mediaId": 558,
    "date": "2022-00-27",
    "sentence": "In Pennsylvania, voters chose his preferred candidate for governor, <span class='selected-term'>Doug Mastriano</span>, who said he would not have certified Joe Biden's 2020 win of the state.",
    "author": "David Smith",
    "title": "Republican primaries offer look into future of Trumpism without Trump",
    "sentiment": "0.0"
  },
  {
    "id": 8463,
    "mediaId": 195,
    "date": "2022-00-27",
    "sentence": "There, Republican primary voters nominated extremist <span class='selected-term'>Doug Mastriano</span> for governor.",
    "author": "Dennis Aftergut",
    "title": "Rays of a much-needed, principled GOP shine through",
    "sentiment": "0.0"
  },
  {
    "id": 7008,
    "mediaId": 124,
    "date": "2022-00-28",
    "sentence": "Then there is state Sen. <span class='selected-term'>Doug Mastriano</span>, who was outside the U.S. Capitol last year when a pro-Trump mob overran it and who was recently subpoenaed by the House committee investigating the riot.",
    "author": "",
    "title": "Inside the chaotic GOP primary for governor in Pennsylvania",
    "sentiment": "0.0"
  },
  {
    "id": 8498,
    "mediaId": 129,
    "date": "2022-00-28",
    "sentence": "",
    "author": "",
    "title": "The Good News in Georgia Thats Bad News for Trump",
    "sentiment": "0.0"
  },
  {
    "id": 8417,
    "mediaId": 178,
    "date": "2022-00-29",
    "sentence": "PITTSBURGH  The victory party took on the feel of an evangelical worship service after <span class='selected-term'>Doug Mastriano</span> won Pennsylvania's Republican gubernatorial primary this month.",
    "author": "Peter Smith and Deepa Bharath Associated Press",
    "title": "Christian nationalism on the rise in some GOP campaigns",
    "sentiment": "0.0"
  }
]