[
  {
    "id": 3408,
    "mediaId": 195,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Likewise, in the state's GOP gubernatorial primary, Republican <span class='selected-term'>Doug Mastriano</span>, who advocated for the 2020 presidential election results to be overturned, appears to be the favorite to clinch the nomination to take on Democrat Josh Shapiro in November.",
    "author": "Max Greenwood",
    "title": "Five things to watch in North Carolina, Pennsylvania primaries",
    "sentiment": "0"
  },
  {
    "id": 6727,
    "mediaId": 323,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "It really came down to who I thought could beat Fetterman.?\nIn the governors race, Mr. Mautino said he voted for <span class='selected-term'>Doug Mastriano</span> after the state senator and retired Army colonel drew former President Donald Trumps endorsement on Saturday.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters in Pennsylvania and North Carolina Cast Ballots",
    "sentiment": "0"
  },
  {
    "id": 6642,
    "mediaId": 136,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Right-wing Candidates and the 'Big Lie'\nRight-wing Republican candidates have performed well in Tuesday's elections, in particular Pennsylvania state Senator <span class='selected-term'>Doug Mastriano</span> who will now be the party's nominee for governor.",
    "author": "Darragh Roche",
    "title": "Five Key Takeaways From Primary Election Results",
    "sentiment": "0"
  },
  {
    "id": 6647,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "The Posts Annie Linskey and David Weigel report that in Pennsylvania, state Sen. <span class='selected-term'>Doug Mastriano</span>, a Trump-endorsed candidate who led an effort to overturn the election in his state and attended the Stop the Steal? rally on Jan. 6, 2021, the day a pro-Trump mob attacked the U.S. Capitol, won the Republican nomination for governor.",
    "author": "Mariana Alfaro",
    "title": "Midterms live updates Oz, McCormick neck and neck in Pa. GOP Senate race",
    "sentiment": "0"
  },
  {
    "id": 6695,
    "mediaId": 1576,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "His pick for governor, state Sen. <span class='selected-term'>Doug Mastriano</span>, won the nomination.",
    "author": "",
    "title": "With a key race too close to call, here are 4 takeaways from Tuesday's primaries",
    "sentiment": "0"
  }
]