[
  {
    "id": 7057,
    "mediaId": 33,
    "date": "d2022-01-06T00:00",
    "sentence": "El condado tambin est cerca de los distritos de dos republicanos electos que fueron fundamentales para ayudar a Trump a intentar subvertir las elecciones: el representante estadounidense Scott Perry y el senador estatal <span class='selected-term'>Doug Mastriano</span>, que provienen de distritos al oeste de Lancaster y participaron en los esfuerzos de Trump para presionar al Departamento de Justicia para que apoyara sus falsas afirmaciones sobre el fraude electoral.",
    "author": "Por Jeremy Herb",
    "title": "Cmo el asalto al Capitolio del 6 de enero cambi lo que significa ser republicano en un condado de Pensilvania",
    "sentiment": "0.0"
  },
  {
    "id": 6726,
    "mediaId": 441,
    "date": "d2022-05-17T20:24",
    "sentence": "In Pennsylvanias governors race, Trump has endorsed state Senator <span class='selected-term'>Doug Mastriano</span>, a staunch supporter of his false 2020 election claims, in a crowded Republican primary for the open seat.",
    "author": "Mark Niquette",
    "title": "Pennsylvanias Primary Circus Clatters Toward Unruly Close",
    "sentiment": "0"
  },
  {
    "id": 6721,
    "mediaId": 65,
    "date": "d2022-05-17T21:30",
    "sentence": "FAST FACTS\nTrump-backed Pennsylvania Senate candidate Mehmet Oz is in a tight race with former hedge fund executive Dave McCormick and conservative commentator Kathy Barnette\nThe GOP establishment, including Trump, has attacked Barnette as not sufficiently vetted and warned she may not be able to win the general election in Pennsylvania\nTrump-backed Pennsylvania governor candidate <span class='selected-term'>Doug Mastriano</span>, who's focused on Trump's false claims the 2020 election was stolen, surged ahead of primary day.",
    "author": "Tyler Olson",
    "title": "Voters decide Pennsylvania, North Carolina, Idaho primaries, in test of Trump's clout: LIVE UPDATES",
    "sentiment": "0.0"
  },
  {
    "id": 6714,
    "mediaId": 65,
    "date": "d2022-05-17T22:56",
    "sentence": "",
    "author": "Paul Best",
    "title": "Pennsylvania county says some mail-in ballots won't scan due to printing error",
    "sentiment": "0.0"
  },
  {
    "id": 5475,
    "mediaId": 233,
    "date": "d2022-05-18T01:23",
    "sentence": "Leading the Republican primary is state Sen. <span class='selected-term'>Doug Mastriano</span>, whose efforts to overturn the 2020 election in favor of Trump and ties to QAnon have raised concerns both in and outside the party.",
    "author": "David Jackson",
    "title": "Fetterman wins Pennsylvania Democratic Senate primary; NC polls close; live primary results",
    "sentiment": "0.0"
  },
  {
    "id": 6527,
    "mediaId": 21,
    "date": "d2022-05-19T17:52:55",
    "sentence": "Those efforts culminated in 2020 election denier and January 6 rally attendee state Sen. <span class='selected-term'>Doug Mastriano</span> with Trump's backing, easily securing the Republican nomination for governor.",
    "author": "Grace Panetta",
    "title": "Pennsylvania's Republican Senate primary is likely headed for a recount with Trump adding to the chaos",
    "sentiment": "0.0"
  }
]