[
  {
    "id": 3387,
    "mediaId": 195,
    "date": "d2022-05-16T09:19",
    "sentence": "Pennsylvanias GOP gubernatorial primary\nPennsylvania Republicans appeared poised to nominate state Sen. <span class='selected-term'>Doug Mastriano</span> on Tuesday to take on Democrat Josh Shapiro in the November general election, stirring concern among some GOP officials who fear that Mastriano may prove unelectable.",
    "author": "Max Greenwood",
    "title": "Seven primary races to watch on Tuesday",
    "sentiment": "0.0"
  },
  {
    "id": 6527,
    "mediaId": 21,
    "date": "d2022-05-19T17:52:55",
    "sentence": "Those efforts culminated in 2020 election denier and January 6 rally attendee state Sen. <span class='selected-term'>Doug Mastriano</span> with Trump's backing, easily securing the Republican nomination for governor.",
    "author": "Grace Panetta",
    "title": "Pennsylvania's Republican Senate primary is likely headed for a recount with Trump adding to the chaos",
    "sentiment": "0.0"
  },
  {
    "id": 6532,
    "mediaId": 21,
    "date": "d2022-05-20T19:00",
    "sentence": "Trump boasted another win with the victory of state Sen. <span class='selected-term'>Doug Mastriano</span>, an additional endorsement that roiled some Pennsylvania Republicans due to the candidate's extreme views.",
    "author": "Grace Panetta",
    "title": "Trump may stop endorsing candidates for competitive GOP primaries, report says: 'This is not how he expected this to go'",
    "sentiment": "0.0"
  },
  {
    "id": 7205,
    "mediaId": 18,
    "date": "d2022-05-22T00:38",
    "sentence": "In the gubernatorial primary, the Trump-backed far-right candidate <span class='selected-term'>Doug Mastriano</span> was able to drub his opponents and win 44% of the vote in a 3-way race, even in the face of staunch opposition from the Republican establishment.",
    "author": "Douglas Schoen",
    "title": "Schoen: It's still Donald Trump's Republican party",
    "sentiment": "0.0"
  },
  {
    "id": 7202,
    "mediaId": 151,
    "date": "d2022-05-22T11:00",
    "sentence": "And in Pennsylvania last week, <span class='selected-term'>Doug Mastriano</span>, the far-right election denier Trump endorsed, won the gubernatorial primary.",
    "author": "",
    "title": "'No one's paying any attention': The week that Republicans ignored Trump's election lies",
    "sentiment": "0.0"
  }
]