[
  {
    "id": 6897,
    "mediaId": 43,
    "date": "2022-00-07",
    "sentence": "This isnt the only race with a high profile GOP candidate though could do more harm than good to the GOPs chances in November:\nDemocrat Josh Shapiro wants <span class='selected-term'>Doug Mastriano</span> to win the Pennsylvania Republican primary for governor on May 17.",
    "author": "",
    "title": "LOL! Watch Members Of The MAGA Crowd Boo Dr. Oz (R. NJ) At Trump Rally",
    "sentiment": "0.0"
  },
  {
    "id": 6888,
    "mediaId": 558,
    "date": "2022-00-09",
    "sentence": "Not all Republican politicians are as reticent: In Pennsylvania, the frontrunner for the Republican gubernatorial nomination, state Sen. <span class='selected-term'>Doug Mastriano</span>, favors .",
    "author": "Ben Adler",
    "title": "Some Republican states set to ban abortion without exceptions for rape and incest",
    "sentiment": "0.0"
  },
  {
    "id": 6884,
    "mediaId": 33,
    "date": "2022-00-10",
    "sentence": "En un debate de candidatos a la gobernacin, el senador estatal <span class='selected-term'>Doug Mastriano</span> pareci comparar la lucha para abolir el aborto con el movimiento para abolir la trata de esclavos, a fines del siglo XVIII y principios del XIX, al invocar a William Wilberforce, un poltico britnico que lider ese movimiento.",
    "author": "",
    "title": "ANLISIS | La filtracin del borrador sobre el aborto de la Corte Suprema ya ha transformado la poltica en todo Estados Unidos",
    "sentiment": "0.0"
  },
  {
    "id": 6885,
    "mediaId": 33,
    "date": "2022-00-10",
    "sentence": "In a gubernatorial debate, state Sen. <span class='selected-term'>Doug Mastriano</span> seemed to liken the fight to abolish abortion to the movement to abolish the slave trade in the late 18th and early 19th centuries by invoking William Wilberforce, a British politician who led that movement.",
    "author": "Stephen Collinson",
    "title": "The Supreme Court abortion leak has already transformed politics all over America",
    "sentiment": "0.0"
  },
  {
    "id": 6876,
    "mediaId": 157,
    "date": "2022-00-11",
    "sentence": "Barnette is also backing state Senator <span class='selected-term'>Doug Mastriano</span> for governor and his support for her senate bid.",
    "author": "Bob Brigham",
    "title": "Longshot Republican surging against Dr. Oz has leaders of both parties worried: report",
    "sentiment": "0.0"
  },
  {
    "id": 3401,
    "mediaId": 151,
    "date": "2022-00-14",
    "sentence": "I wonder how long were going to have these institutions at the rate were undermining them and then I wonder when theyre gone or destabilized what we will have as a country and I dont think the prospects are good if we continue to lose them.\nKEYING IN ON THE KEYSTONE STATE  New this morning: Trump endorsed <span class='selected-term'>Doug Mastriano</span> in the Pa. governors race, a late boost for the far-right front-runner, by the Philly Inquirers Andrew Seidman\nA batch of good stories out today digging into the wild, must-watch GOP Senate primary Tuesday in Pennsylvania, where largely unvetted conservative commentator KATHY BARNETTE is mounting a late surge against celebrity doctor MEHMET OZ and hedge fund exec DAVID MCCORMICK:\n On what it will say about Trumps sway over the GOP: Trump is increasingly finding that his grip and ability to clear the field may be waning.",
    "author": "",
    "title": "POLITICO Playbook: Clarence Thomas speaks",
    "sentiment": "0.0"
  },
  {
    "id": 6807,
    "mediaId": 195,
    "date": "2022-00-15",
    "sentence": "It is completely in her wheelhouse.?\nMadonna, the academic expert, added that Barnette has benefitted from a close, if informal, alliance with gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, who is cut from similar cloth.",
    "author": "Niall Stanage",
    "title": "The Memo: Barnette roils Pennsylvania Senate race",
    "sentiment": "0.0"
  },
  {
    "id": 4483,
    "mediaId": 238,
    "date": "2022-00-17",
    "sentence": "Thats what could happen in Pennsylvania, where state Sen. <span class='selected-term'>Doug Mastriano</span> and Kathy Barnette could capture the partys nods for governor and U.S. senator, respectively.",
    "author": "Henry Olsen",
    "title": "Opinion Republicans have only themselves to blame for unelectable big lie candidates",
    "sentiment": "0.0"
  },
  {
    "id": 4461,
    "mediaId": 195,
    "date": "2022-00-19",
    "sentence": "OPINION\n Americas <span class='selected-term'>Doug Mastriano</span> problem, by Ross Douthat, columnist, The New York Times.",
    "author": "Alexis Simendinger",
    "title": "The Hills Morning Report  Recount looms in Pennsylvania",
    "sentiment": "0.0"
  }
]