[
  {
    "id": 3447,
    "mediaId": 195,
    "date": "2022-00-14",
    "sentence": "Meanwhile, in the GOP primary for the state's gubernatorial race, Sen. <span class='selected-term'>Doug Mastriano</span> (R), who Trump endorsed Saturday, is up against former Rep. Lou Barletta (R-Pa.), Montgomery County commissioner Joseph Gale, former U.S. Attorney William McSwain and Ridley Township Commissioner Dave White, among other candidates.",
    "author": "Lexi Lonas",
    "title": "Sunday shows preview: Democrats' abortion rights bill blocked; Pennsylvania, N.C. primaries near",
    "sentiment": "0.0"
  },
  {
    "id": 6820,
    "mediaId": 195,
    "date": "2022-00-14",
    "sentence": "He also endorsed state Sen. <span class='selected-term'>Doug Mastriano</span> (R) in Pennsylvanias governor race and California State Assembly member Kevin Kiley in the House race in Californias 3rd Congressional District ahead of the states June 7 primary election.",
    "author": "Caroline Vakil",
    "title": "Trump makes series of Saturday endorsements",
    "sentiment": "0.0"
  },
  {
    "id": 3387,
    "mediaId": 195,
    "date": "2022-00-16",
    "sentence": "Pennsylvanias GOP gubernatorial primary\nPennsylvania Republicans appeared poised to nominate state Sen. <span class='selected-term'>Doug Mastriano</span> on Tuesday to take on Democrat Josh Shapiro in the November general election, stirring concern among some GOP officials who fear that Mastriano may prove unelectable.",
    "author": "Max Greenwood",
    "title": "Seven primary races to watch on Tuesday",
    "sentiment": "0.0"
  },
  {
    "id": 3408,
    "mediaId": 195,
    "date": "2022-00-17",
    "sentence": "Likewise, in the state's GOP gubernatorial primary, Republican <span class='selected-term'>Doug Mastriano</span>, who advocated for the 2020 presidential election results to be overturned, appears to be the favorite to clinch the nomination to take on Democrat Josh Shapiro in November.",
    "author": "Max Greenwood",
    "title": "Five things to watch in North Carolina, Pennsylvania primaries",
    "sentiment": "0.0"
  },
  {
    "id": 3409,
    "mediaId": 129,
    "date": "2022-00-17",
    "sentence": "A late endorsement\nOn Saturday, Trump finally endorsed <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "author": "",
    "title": "Live Updates: What to Watch for in the Pennsylvania and North Carolina Primaries",
    "sentiment": "0.0"
  },
  {
    "id": 3410,
    "mediaId": 129,
    "date": "2022-00-17",
    "sentence": "A late endorsement\nOn Saturday, Trump finally endorsed <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "author": "",
    "title": "Live Updates: What to Watch for in the Pennsylvania and North Carolina Primaries",
    "sentiment": "0.0"
  },
  {
    "id": 3412,
    "mediaId": 129,
    "date": "2022-00-17",
    "sentence": "",
    "author": "",
    "title": "What to Watch For in the Pennsylvania and North Carolina Primaries",
    "sentiment": "0.0"
  },
  {
    "id": 4490,
    "mediaId": 98,
    "date": "2022-00-17",
    "sentence": "Election lies pay off  for now\nPennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> proved his loyalty to Trump by relentlessly trying to undermine the 2020 election.",
    "author": "",
    "title": "7 takeaways from primaries in Pennsylvania, North Carolina, Oregon",
    "sentiment": "0.0"
  },
  {
    "id": 5484,
    "mediaId": 1546,
    "date": "2022-00-17",
    "sentence": "But Trump was undaunted by such fears, saying in a statement endorsing Mastriano, There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator <span class='selected-term'>Doug Mastriano</span>.",
    "author": "Ken Bredemeier",
    "title": "Trumps Republican Political Clout Faces Another Test on Tuesday",
    "sentiment": "0.0"
  },
  {
    "id": 5509,
    "mediaId": 19,
    "date": "2022-00-17",
    "sentence": "ET:\nThose 26 Trump endorsements on the line on Tuesday night are as follows, according to Trumps team:\nIdaho-Governor: Janice McGeachin\nIdaho-Senate: Mike Crapo\nIdaho-01: Russ Fulcher\nKentucky-Senate: Rand Paul\nKentucky-01: James Comer\nKentucky-02: Brett Guthrie\nKentucky-04: Thomas Massie\nKentucky-05: Hal Rogers\nKentucky-06: Andy Barr\nNorth Carolina-Senate: Ted Budd\nNorth Carolina-03: Greg Murphy\nNorth Carolina-05: Virginia Foxx\nNorth Carolina-07: David Rouzer\nNorth Carolina-08: Dan Bishop\nNorth Carolina-09: Richard Hudson\nNorth Carolina-10: Patrick McHenry\nNorth Carolina-11: Madison Cawthorn\nNorth Carolina-13: Bo Hines\nPennsylvania-Governor: <span class='selected-term'>Doug Mastriano</span>\nPennsylvania-Senate: Mehmet Oz\nPennsylvania-08: Jim Bognet\nPennsylvania-10: Scott Perry\nPennsylvania-11: Lloyd Smucker\nPennsylvania-13: John Joyce\nPennsylvania-14: Guy Reschenthaler\nPennsylvania-16: Mike Kelly\nUPDATE 7:21 p.m.",
    "author": "Matthew Boyle",
    "title": "*** Election Night Livewire *** Pennsylvania, North Carolina, Kentucky, Idaho, Oregon Vote in Contentious Primaries",
    "sentiment": "0.0"
  },
  {
    "id": 6478,
    "mediaId": 136,
    "date": "2022-00-17",
    "sentence": "Pennsylvania Gubernatorial Primary\nIn a highly divisive race, Trump gave an 11th hour endorsement to <span class='selected-term'>Doug Mastriano</span>, a far-right candidate who was part of the January 6 \"stop the steal\" protests and had attempted to overturn the 2020 Election results.",
    "author": "Ewan Palmer",
    "title": "Trump Endorsements Face Toughest Test Yet in 27 Primary Election Battles",
    "sentiment": "0.0"
  },
  {
    "id": 6511,
    "mediaId": 25,
    "date": "2022-00-17",
    "sentence": "<div>https://www.cbsnews.com/live-updates/pennsylvania-north-carolina-kentucky-idaho-and-oregon-primary-results-2022-05-17/#post-update-5ee836f1</div>\n link copied\n6:07 PM\nPennsylvania Governor Republican primary results\n<span class='selected-term'>Doug Mastriano</span>, Lou Barletta, Bill McSwain and Dave White are competing for the Republican nomination.",
    "author": "",
    "title": "Pennsylvania, North Carolina, Kentucky, Idaho and Oregon primary results",
    "sentiment": "0.0"
  },
  {
    "id": 6721,
    "mediaId": 65,
    "date": "2022-00-17",
    "sentence": "FAST FACTS\nTrump-backed Pennsylvania Senate candidate Mehmet Oz is in a tight race with former hedge fund executive Dave McCormick and conservative commentator Kathy Barnette\nThe GOP establishment, including Trump, has attacked Barnette as not sufficiently vetted and warned she may not be able to win the general election in Pennsylvania\nTrump-backed Pennsylvania governor candidate <span class='selected-term'>Doug Mastriano</span>, who's focused on Trump's false claims the 2020 election was stolen, surged ahead of primary day.",
    "author": "Tyler Olson",
    "title": "Voters decide Pennsylvania, North Carolina, Idaho primaries, in test of Trump's clout: LIVE UPDATES",
    "sentiment": "0.0"
  },
  {
    "id": 6723,
    "mediaId": 558,
    "date": "2022-00-17",
    "sentence": "Pennsylvania state Senator <span class='selected-term'>Doug Mastriano</span>, who has amplified Trump's false claims of 2020 voter fraud, will face Democratic Attorney-General Josh Shapiro in a high-profile governor's race.",
    "author": "",
    "title": "Trump-backed candidates win midterm nods",
    "sentiment": "0.0"
  },
  {
    "id": 6724,
    "mediaId": 558,
    "date": "2022-00-17",
    "sentence": "And in Pennsylvanias GOP race for governor, Trump's endorsed candidate, the far-right <span class='selected-term'>Doug Mastriano</span>, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "author": "",
    "title": "Takeaways: Election denier wins, bad behavior dooms Cawthorn",
    "sentiment": "0.0"
  },
  {
    "id": 6725,
    "mediaId": 558,
    "date": "2022-00-17",
    "sentence": "And in Pennsylvanias GOP race for governor, Trump's endorsed candidate, the far-right <span class='selected-term'>Doug Mastriano</span>, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "author": "",
    "title": "Takeaways: Election denier wins, bad behavior dooms Cawthorn",
    "sentiment": "0.0"
  },
  {
    "id": 6726,
    "mediaId": 441,
    "date": "2022-00-17",
    "sentence": "In Pennsylvanias governors race, Trump has endorsed state Senator <span class='selected-term'>Doug Mastriano</span>, a staunch supporter of his false 2020 election claims, in a crowded Republican primary for the open seat.",
    "author": "Mark Niquette",
    "title": "Pennsylvanias Primary Circus Clatters Toward Unruly Close",
    "sentiment": "0.0"
  },
  {
    "id": 6727,
    "mediaId": 323,
    "date": "2022-00-17",
    "sentence": "It really came down to who I thought could beat Fetterman.?\nIn the governors race, Mr. Mautino said he voted for <span class='selected-term'>Doug Mastriano</span> after the state senator and retired Army colonel drew former President Donald Trumps endorsement on Saturday.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters in Pennsylvania and North Carolina Cast Ballots",
    "sentiment": "0.0"
  },
  {
    "id": 6744,
    "mediaId": 65,
    "date": "2022-00-17",
    "sentence": "Trump made a late game endorsement on Saturday of state Sen. <span class='selected-term'>Doug Mastriano</span>, the polling front-runner.",
    "author": "",
    "title": "Trump's GOP clout on the line in high profile Republican primaries in Pennsylvania, North Carolina, Idaho",
    "sentiment": "0.0"
  },
  {
    "id": 6751,
    "mediaId": 943,
    "date": "2022-00-17",
    "sentence": "And in Pennsylvanias GOP race for governor, far-right contender <span class='selected-term'>Doug Mastriano</span> was already leading before Trump backed him over the weekend.",
    "author": "WILL WEISSERT",
    "title": "Primary voters head to polls in Pennsylvania, North Carolina and 3 other states: Heres what to watch",
    "sentiment": "0.0"
  },
  {
    "id": 6765,
    "mediaId": 98,
    "date": "2022-00-17",
    "sentence": "Thats especially true in the perennial political battleground of Pennsylvania, where some Republicans are already worried that state Sen. <span class='selected-term'>Doug Mastriano</span> is too extreme to woo moderates, who are often decisive in general elections there.",
    "author": "WILL WEISSERT",
    "title": "Fetterman easily wins Democratic Senate race in Pennsylvania",
    "sentiment": "0.0"
  },
  {
    "id": 3484,
    "mediaId": 238,
    "date": "2022-00-18",
    "sentence": "In Pennsylvania, state Sen. <span class='selected-term'>Doug Mastriano</span>, a Trump-endorsed candidate who led an effort to overturn the election in his state and attended the Stop the Steal rally on Jan. 6, 2021, the day a pro-Trump mob attacked U.S. Capitol, won the Republican nomination for governor.",
    "author": "David Weigel",
    "title": "Victories by Mastriano, Budd show potency of Trumps false stolen election claims in GOP",
    "sentiment": "0.0"
  },
  {
    "id": 4472,
    "mediaId": 302,
    "date": "2022-00-18",
    "sentence": "And in Pennsylvanias GOP race for governor, Trumps endorsed candidate, the far-right <span class='selected-term'>Doug Mastriano</span>, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "author": "Associated Press",
    "title": "Primary takeaways: Election denier wins, bad behavior dooms Cawthorn",
    "sentiment": "0.0"
  },
  {
    "id": 4476,
    "mediaId": 943,
    "date": "2022-00-18",
    "sentence": "And in Pennsylvanias GOP race for governor, Trumps endorsed candidate, the far-right <span class='selected-term'>Doug Mastriano</span>, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "author": "",
    "title": "Election denier wins GOP nomination for Pennsylvania governor: Takeaways from Tuesdays primaries",
    "sentiment": "0.0"
  },
  {
    "id": 4479,
    "mediaId": 1576,
    "date": "2022-00-18",
    "sentence": "And in Pennsylvanias GOP race for governor, Trumps endorsed candidate, the far-right <span class='selected-term'>Doug Mastriano</span>, easily won the nomination  though he was already well ahead in the polls when Trump weighed in just days before the primary.",
    "author": "",
    "title": "Takeaways: Election denier wins, bad behavior dooms Cawthorn",
    "sentiment": "0.0"
  },
  {
    "id": 5475,
    "mediaId": 233,
    "date": "2022-00-18",
    "sentence": "Leading the Republican primary is state Sen. <span class='selected-term'>Doug Mastriano</span>, whose efforts to overturn the 2020 election in favor of Trump and ties to QAnon have raised concerns both in and outside the party.",
    "author": "David Jackson",
    "title": "Fetterman wins Pennsylvania Democratic Senate primary; NC polls close; live primary results",
    "sentiment": "0.0"
  },
  {
    "id": 5476,
    "mediaId": 238,
    "date": "2022-00-18",
    "sentence": "Trump-endorsed state Sen. <span class='selected-term'>Doug Mastriano</span> also won the nomination for Pennsylvania governor, but he was already well on track to victory before Trump backed him in recent days.",
    "author": "Aaron Blake",
    "title": "6 takeaways from primaries in Pennsylvania, North Carolina and more",
    "sentiment": "0.0"
  },
  {
    "id": 6475,
    "mediaId": 151,
    "date": "2022-00-18",
    "sentence": "In a last-minute endorsement that rattled members of Pennsylvanias Republican party, Trump backed Mastriano, a leading force in trying to overturn the 2020 election results who was pictured outside the Capitol on Jan. 6. There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator <span class='selected-term'>Doug Mastriano</span>,? Trump said last week.",
    "author": "",
    "title": "How Trump-backed candidates fared on the busiest primary day",
    "sentiment": "0.0"
  },
  {
    "id": 6508,
    "mediaId": 25,
    "date": "2022-00-18",
    "sentence": "<div>https://www.cbsnews.com/live-updates/primaries-2022-results-pennsylvania-senate-republicans-david-mccormick-dr-oz-north-carolina-idaho-oregon-kentucky/#post-update-5ee836f1</div>\n link copied\nUpdated 9:56 PM\nPennsylvania Governor Republican primary results: CBS News projects <span class='selected-term'>Doug Mastriano</span> wins\nCBS News projects Doug Mastriano wins the Republican primary for governor.",
    "author": "",
    "title": "Pennsylvania, North Carolina, Kentucky, Idaho and Oregon primary results",
    "sentiment": "0.0"
  },
  {
    "id": 6610,
    "mediaId": 195,
    "date": "2022-00-18",
    "sentence": "Some pointed to Budd and <span class='selected-term'>Doug Mastriano</span>, the newly minted GOP Pennsylvania gubernatorial nominee, as two who, while benefiting from Trumps endorsement, could have won their primaries without it.",
    "author": "Julia Manchester",
    "title": "Primaries fuel questions about potency of Trump endorsements",
    "sentiment": "0.0"
  },
  {
    "id": 6621,
    "mediaId": 943,
    "date": "2022-00-18",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span>  who secured a late endorsement from Trump and has trumpeted the former presidents lies about nonexistent, widespread fraud costing him the 2020 election  won the Republican nomination for Pennsylvanias open governors office.",
    "author": "WILL WEISSERT",
    "title": "Pennsylvania Lt. Gov. John Fetterman, who suffered a stroke days before primary, wins Democratic nomination for US Senate",
    "sentiment": "0.0"
  },
  {
    "id": 6627,
    "mediaId": 65,
    "date": "2022-00-18",
    "sentence": "In the gubernatorial election, President Trumps endorsement propelled conservative State Sen. <span class='selected-term'>Doug Mastriano</span> to victory.",
    "author": "David N. Bossie",
    "title": "Pennsylvania proves Republicans still want 'America First'",
    "sentiment": "0.0"
  },
  {
    "id": 6637,
    "mediaId": 169,
    "date": "2022-00-18",
    "sentence": "It is true that Republican strategists are sweating the winner of the GOP gubernatorial primary, <span class='selected-term'>Doug Mastriano</span>, who tends to be more loudmouthed about his insurrectionist views than other Republican candidates.",
    "author": "Amanda Marcotte",
    "title": "Less Madison Cawthorn, more dumpy fascists in bad suits: Republicans embrace covert Big Liars",
    "sentiment": "0.0"
  },
  {
    "id": 6642,
    "mediaId": 136,
    "date": "2022-00-18",
    "sentence": "Right-wing Candidates and the 'Big Lie'\nRight-wing Republican candidates have performed well in Tuesday's elections, in particular Pennsylvania state Senator <span class='selected-term'>Doug Mastriano</span> who will now be the party's nominee for governor.",
    "author": "Darragh Roche",
    "title": "Five Key Takeaways From Primary Election Results",
    "sentiment": "0.0"
  },
  {
    "id": 6657,
    "mediaId": 233,
    "date": "2022-00-18",
    "sentence": "In a win for former President Donald Trump, state senator and retired Army colonel <span class='selected-term'>Doug Mastriano</span> won the Republican nomination for governor of Pennsylvania Tuesday night.",
    "author": "David Jackson",
    "title": "Tuesday primary takeaways: Madison Cawthorn loses, election denier wins GOP gov primary in Penn.",
    "sentiment": "0.0"
  },
  {
    "id": 6659,
    "mediaId": 1546,
    "date": "2022-00-18",
    "sentence": "In the race for Pennsylvania governor, Trump endorsed Republican state Senator <span class='selected-term'>Doug Mastriano</span>, who easily defeated a crowded field of Republican candidates in Tuesdays primary.",
    "author": "Ken Bredemeier",
    "title": "Trumps Republican Political Clout Yields Split Results in Primary Test",
    "sentiment": "0.0"
  },
  {
    "id": 6665,
    "mediaId": 195,
    "date": "2022-00-18",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span> did win the GOP nod in Pennsylvanias gubernatorial race.",
    "author": "Max Greenwood",
    "title": "Five takeaways from the Pennsylvania, North Carolina primaries",
    "sentiment": "0.0"
  },
  {
    "id": 6669,
    "mediaId": 21,
    "date": "2022-00-18",
    "sentence": "JD Vance won his primary for the Ohio Senate on May 4, while <span class='selected-term'>Doug Mastriano</span>, a clear front-runner backed by Trump, won his race in the Pennsylvania governor primary.",
    "author": "Cheryl Teh",
    "title": "Madison Cawthorn's loss in his North Carolina primary race undermines the myth surrounding the power of a Trump endorsement",
    "sentiment": "0.0"
  },
  {
    "id": 6683,
    "mediaId": 178,
    "date": "2022-00-18",
    "sentence": "___\nHARRISBURG, Pa.  <span class='selected-term'>Doug Mastriano</span> has won the Republican nomination for Pennsylvania governor, overcoming an eleventh-hour push by the state's GOP political establishment to consolidate support around an alternative in the crowded primary.",
    "author": "The Associated Press Associated Press",
    "title": "Midterm updates | Idaho Gov. Little defeats Trump-backed foe",
    "sentiment": "0.0"
  },
  {
    "id": 6694,
    "mediaId": 33,
    "date": "2022-00-18",
    "sentence": "Un negador de elecciones podra tener poder sobre las elecciones de Pensilvania de 2024\nEn el senador estatal <span class='selected-term'>Doug Mastriano</span>, los republicanos de Pensilvania han nominado para gobernador a una voz destacada que promueve las mentiras de Trump sobre el fraude electoral, lo que aumenta la posibilidad de que alguien que ya intent anular la voluntad de los votantes en 2020 tendra poder sobre la maquinaria electoral de uno de los estados de campo de batalla presidencial ms importantes de la nacin en 2024.",
    "author": "Dan Merica",
    "title": "6 conclusiones de las primarias en Pensilvania, Carolina del Norte y ms",
    "sentiment": "0.0"
  },
  {
    "id": 6697,
    "mediaId": 25,
    "date": "2022-00-18",
    "sentence": "Topping that list, in Pennsylvania, is Republican state Senator <span class='selected-term'>Doug Mastriano</span> who has been projected by CBS as the winner of the GOP gubernatorial nomination.",
    "author": "Adam Brewster",
    "title": "Takeaways from Tuesday's primaries",
    "sentiment": "0.0"
  },
  {
    "id": 6704,
    "mediaId": 129,
    "date": "2022-00-18",
    "sentence": "",
    "author": "",
    "title": "Your Wednesday Evening Briefing",
    "sentiment": "0.0"
  },
  {
    "id": 6713,
    "mediaId": 157,
    "date": "2022-00-18",
    "sentence": "It is true that Republican strategists are sweating the winner of the GOP gubernatorial primary, <span class='selected-term'>Doug Mastriano</span>, who tends to be more loudmouthed about his insurrectionist views than other Republican candidates.",
    "author": "Amanda Marcotte",
    "title": "GOP drops the flash but keeps the fascism",
    "sentiment": "0.0"
  },
  {
    "id": 6582,
    "mediaId": 323,
    "date": "2022-00-19",
    "sentence": "Open Queue\nThis weeks conventional wisdom holds that state Sen. <span class='selected-term'>Doug Mastriano</span> won the Pennsylvania Republican gubernatorial primary by inciting voters with claims of a stolen 2020 election.",
    "author": "Kimberley A. Strassel",
    "title": "The Limits of Stop the Steal",
    "sentiment": "0.0"
  },
  {
    "id": 6583,
    "mediaId": 195,
    "date": "2022-00-19",
    "sentence": "The contest for governor will feature the Democratic Attorney General Ben Shapiro and GOP State Sen. <span class='selected-term'>Doug Mastriano</span>, another Republican endorsed by Trump.",
    "author": "Brad Bannon",
    "title": "Party primaries test power of Trumps backing and progressive platform",
    "sentiment": "0.0"
  },
  {
    "id": 6596,
    "mediaId": 195,
    "date": "2022-00-19",
    "sentence": "Pennsylvania Republicans picked state Sen. <span class='selected-term'>Doug Mastriano</span> (R) as their nominee for governor, nearly three months to the day after the select House committee investigating the insurrection issued him a subpoena seeking his testimony.",
    "author": "Reid Wilson",
    "title": "Republican election deniers make gains in primary contests",
    "sentiment": "0.0"
  },
  {
    "id": 6538,
    "mediaId": 195,
    "date": "2022-00-20",
    "sentence": "In Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, who backs Trump's false claims of election fraud and marched to the Capitol on Jan. 6, will be the GOP's gubernatorial candidate.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump faces critical popularity test in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7194,
    "mediaId": 136,
    "date": "2022-00-22",
    "sentence": "Vance, Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> and North Carolina Senate candidate Ted Budd all won their primaries.",
    "author": "Andrew Stanton",
    "title": "Trump Endorsement More 'Matchbox Car' Than 'Freight Train': Geoff Duncan",
    "sentiment": "0.0"
  },
  {
    "id": 7205,
    "mediaId": 18,
    "date": "2022-00-22",
    "sentence": "In the gubernatorial primary, the Trump-backed far-right candidate <span class='selected-term'>Doug Mastriano</span> was able to drub his opponents and win 44% of the vote in a 3-way race, even in the face of staunch opposition from the Republican establishment.",
    "author": "Douglas Schoen",
    "title": "Schoen: It's still Donald Trump's Republican party",
    "sentiment": "0.0"
  },
  {
    "id": 7210,
    "mediaId": 19,
    "date": "2022-00-22",
    "sentence": "Now, again, that's going to be a couple days here, but they'll be done this coming week is my suspicion.\n<span class='selected-term'>Doug Mastriano</span> secured the Republican gubernatorial nomination in Pennsylvania following a late endorsement from former President Donald J. Trump over the weekend.",
    "author": "Nick Gilbertson",
    "title": "Trump-Endorsed Candidates 81-3 in Primaries Ahead of Races in Alabama, Arkansas, Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 8472,
    "mediaId": 129,
    "date": "2022-00-26",
    "sentence": "Just look at <span class='selected-term'>Doug Mastriano</span>, who won the Republican governor's primary in Pennsylvania.",
    "author": "",
    "title": "The G.O.P. Has Gone Even Farther to the Right Than I Expected': Three Writers Talk About the Midterms",
    "sentiment": "0.0"
  },
  {
    "id": 8462,
    "mediaId": 558,
    "date": "2022-00-27",
    "sentence": "In Pennsylvania, voters chose his preferred candidate for governor, <span class='selected-term'>Doug Mastriano</span>, who said he would not have certified Joe Biden's 2020 win of the state.",
    "author": "David Smith",
    "title": "Republican primaries offer look into future of Trumpism without Trump",
    "sentiment": "0.0"
  }
]