[
  {
    "id": 6503,
    "mediaId": 43,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "A recent poll for Fox found the GOP primary very wide open with former Rep. Lou Barletta, who badly lost the 2018 Senate race to Democratic incumbent Bob Casey, posting a tiny 19-18 edge over state Sen. <span class='selected-term'>Doug Mastriano</span>, an ardent election denier who was filmed on Jan. 6 apparently passing breached barricades at the Capitol.",
    "author": "",
    "title": "Morning Digest: This swing seat in Pittsburgh suburbs went blue in 2018, but will it stay that way?"
  },
  {
    "id": 6953,
    "mediaId": 19,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "You dont have to wonder what Lou will do tomorrow  just look at what he did yesterday.?\nA recent Emerson College Poll showed Barletta leading his GOP opponents with 20 percent support, closely followed by State Sen. <span class='selected-term'>Doug Mastriano</span>, who garnered 19 percent.",
    "author": "Hannah Bleau",
    "title": "PA Gubernatorial Candidate Lou Barletta Launches TV Ad Highlighting His Record"
  },
  {
    "id": 6851,
    "mediaId": 238,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "",
    "author": "David Weigel",
    "title": "The Trailer: The Empire Strikes Back: A wave of PAC money buries left-wing Democrats"
  },
  {
    "id": 6732,
    "mediaId": 238,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Many in the Republican Party at the state and national level are deeply concerned about <span class='selected-term'>Doug Mastriano</span> and Kathy Barnette becoming the nominees for governor and Senate.",
    "author": "Paul Waldman",
    "title": "Opinion Disturbing primary elections show how the GOP normalizes extremism"
  },
  {
    "id": 6733,
    "mediaId": 65,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Barnettes rise in the polls may have been partially fueled by her alliance with Sen. <span class='selected-term'>Doug Mastriano</span>, the polling front-runner for Pennsylvanias GOP gubernatorial primary.",
    "author": "Paul Steinhauser",
    "title": "Oz, Barnette, McCormick cast votes in crucial Pennsylvania GOP Senate primary"
  },
  {
    "id": 6739,
    "mediaId": 195,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "On Saturday, former President Trump announced his endorsement of state Sen. <span class='selected-term'>Doug Mastriano</span>.",
    "author": "Maureen Breslin",
    "title": "Pennsylvania gubernatorial candidate Josh Shapiro tests positive for COVID-19"
  }
]