[
  {
    "id": 7052,
    "mediaId": 151,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "ICYMI: On Friday, Andrew Desiderio, Burgess Everett and Marianne LeVine broke down Johnsons thinking for Congress Minutes\n2022 WATCH  Trumpy Pennsylvania state Sen. <span class='selected-term'>DOUG MASTRIANO</span> officially jumped into the governors race Saturday.",
    "author": "",
    "title": "POLITICO Playbook: Does Trump need Twitter?",
    "sentiment": "0"
  },
  {
    "id": 6846,
    "mediaId": 19,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "As National Committeeman, I have spoken regularly with almost all of the gubernatorial campaigns over the past [three] months,? Andy Reilly told Politico:\nLast week when the presumptive [Democratic] nominee, Josh Shapiro, and the State Democratic Party used campaign resources to assist the candidacy of <span class='selected-term'>Doug Mastriano</span> in the Republican primary, it raised concerns among the campaigns.",
    "author": "John Binder",
    "title": "7 Issues Facing Doug Mastriano in Pennsylvania Governor Race",
    "sentiment": "0"
  },
  {
    "id": 3401,
    "mediaId": 151,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "I wonder how long were going to have these institutions at the rate were undermining them and then I wonder when theyre gone or destabilized what we will have as a country and I dont think the prospects are good if we continue to lose them.\nKEYING IN ON THE KEYSTONE STATE  New this morning: Trump endorsed <span class='selected-term'>Doug Mastriano</span> in the Pa. governors race, a late boost for the far-right front-runner, by the Philly Inquirers Andrew Seidman\nA batch of good stories out today digging into the wild, must-watch GOP Senate primary Tuesday in Pennsylvania, where largely unvetted conservative commentator KATHY BARNETTE is mounting a late surge against celebrity doctor MEHMET OZ and hedge fund exec DAVID MCCORMICK:\n On what it will say about Trumps sway over the GOP: Trump is increasingly finding that his grip and ability to clear the field may be waning.",
    "author": "",
    "title": "POLITICO Playbook: Clarence Thomas speaks",
    "sentiment": "0"
  },
  {
    "id": 6658,
    "mediaId": 409,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "This being so, I do not want to hear a single thing from the Democratic Party about the threat? that <span class='selected-term'>Doug Mastriano</span> presents to the Commonwealth of Pennsylvania, or to the republic in general.",
    "author": "Charles C. W. Cooke",
    "title": "The Democrats Wanted Doug Mastriano, and Now Theyve Got Him",
    "sentiment": "0"
  },
  {
    "id": 6556,
    "mediaId": 151,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "CONCERN IN THE KEYSTONE: Republican operatives in Pennsylvania mounted an all-out blitz to stop state Sen. <span class='selected-term'>DOUG MASTRIANO</span> from winning the GOP gubernatorial nomination.",
    "author": "",
    "title": "POLITICO Playbook: Sean Patrick Maloney dodges a bullet",
    "sentiment": "0"
  },
  {
    "id": 8376,
    "mediaId": 151,
    "date": "5/29/2022 12:00:00 AM",
    "sentence": "Most recently, this trend was on display in <span class='selected-term'>DOUG MASTRIANO</span>s victory in the Pennsylvania GOP gubernatorial primary (though he rejects the label).",
    "author": "",
    "title": "POLITICO Playbook: Trumps new obsession",
    "sentiment": "0"
  },
  {
    "id": 8688,
    "mediaId": 234,
    "date": "6/1/2022 12:00:00 AM",
    "sentence": "But it is only one such threat: From anti-voting legislation enacted on the basis of Trumps lies to a gubernatorial candidate in Pennsylvanias <span class='selected-term'>Doug Mastriano</span> who has indicated he would not respect election results, Republicans are building on the former presidents 2020 efforts to overturn his loss.",
    "author": "Eric Lutz",
    "title": "Steve Bannon's Election-Takeover Dream Is Starting to Take Shape",
    "sentiment": "0"
  },
  {
    "id": 8681,
    "mediaId": 195,
    "date": "6/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Rebecca Beitsch",
    "title": "Mastriano agrees to interview with Jan. 6 panel",
    "sentiment": "0"
  }
]