[
  {
    "id": 7001,
    "mediaId": 65,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Four candidates receive double-digit support: Lou Barletta (19%), <span class='selected-term'>Doug Mastriano</span> (18%), Dave White (14%), and Bill McSwain (11%).",
    "author": "Dana Blanton",
    "title": "Fox News Poll: McCormick tops Dr. Oz in Pennsylvania GOP senate primary poll"
  },
  {
    "id": 6985,
    "mediaId": 237,
    "date": "3/22/2022 12:00:00 AM",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span>; Joe Gale, a commissioner from Montgomery County; Jason Richey, a Pittsburgh attorney; and Dr. Nche Zama, a cardiothoracic surgeon, are also participating in the crowded GOP primary, according to City and State Pennsylvania.",
    "author": "Elizabeth Faddis",
    "title": "Pennsylvania GOP gubernatorial candidates unveil list of demands for debate moderators"
  },
  {
    "id": 6968,
    "mediaId": 157,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "And, theres an excellent chance the nuttiest bunny of them all, <span class='selected-term'>Doug Mastriano</span>, is going to win the primary.\"",
    "author": "Matthew Chapman",
    "title": "Former Ted Cruz staffer slams Pennsylvania GOP: Every governor candidate is an 'election conspiracist' down the 'rabbit hole'"
  },
  {
    "id": 6970,
    "mediaId": 157,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "Some insiders worry state Sen. <span class='selected-term'>Doug Mastriano</span> could seize the nomination and give Democrats an opening in November.",
    "author": "Bob Brigham",
    "title": "'Whiplash-inducing': Trump is 'still sowing chaos' in Pennsylvania GOP politics"
  },
  {
    "id": 6949,
    "mediaId": 237,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Other Republican candidates in the race include state Sen. <span class='selected-term'>Doug Mastriano</span>, a combat veteran who has sought to campaign as a supporter of Trump.",
    "author": "Kate Scanlon",
    "title": "Pennsylvania GOP gubernatorial candidates vie to show strongest fealty to Trump"
  },
  {
    "id": 6943,
    "mediaId": 157,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The candidate, state Sen. <span class='selected-term'>Doug Mastriano</span>, attended the conference called Patriots Arise for God and Country,? according to Right Wing Watch, a website that monitors the far right.",
    "author": "John L. Micek",
    "title": "Pennsylvania GOP governor hopeful Doug Mastriano campaigned at event promoting QAnon"
  },
  {
    "id": 5588,
    "mediaId": 65,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "CLICK TO GET FOX NEWS APP\nIn the GOP gubernatorial primary, <span class='selected-term'>Doug Mastriano</span> has broken away from the pack and now leads with 29% support.",
    "author": "",
    "title": "Fox News Poll: Three-way race in Pennsylvania GOP Senate primary election"
  },
  {
    "id": 6872,
    "mediaId": 157,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Last week when the presumptive [Democratic] nominee, Josh Shapiro, and the State Democratic Party used campaign resources to assist the candidacy of <span class='selected-term'>Doug Mastriano</span> in the Republican primary, it raised concerns among the campaigns.",
    "author": "Meaghan Ellis",
    "title": "Pennsylvania GOP scrambling behind closed doors to ensure Trump-backed candidate loses"
  },
  {
    "id": 6846,
    "mediaId": 19,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "As National Committeeman, I have spoken regularly with almost all of the gubernatorial campaigns over the past [three] months,? Andy Reilly told Politico:\nLast week when the presumptive [Democratic] nominee, Josh Shapiro, and the State Democratic Party used campaign resources to assist the candidacy of <span class='selected-term'>Doug Mastriano</span> in the Republican primary, it raised concerns among the campaigns.",
    "author": "John Binder",
    "title": "7 Issues Facing Doug Mastriano in Pennsylvania Governor Race"
  },
  {
    "id": 6849,
    "mediaId": 19,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "Pennsylvania Attorney General Josh Shapiro (D), who will face a Republican opponent in the gubernatorial election in November, is currently running an ad to boost GOP primary candidate <span class='selected-term'>Doug Mastriano</span> based on the perception that he would be the easiest to defeat, the New York Times reports.",
    "author": "John Binder",
    "title": "NY Times: Democrat Runs Ad Intended to Help Doug Mastriano Win Pennsylvania GOP Gubernatorial Primary"
  },
  {
    "id": 5541,
    "mediaId": 323,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Ms. Barnette has the support of state Sen. <span class='selected-term'>Doug Mastriano</span>, the front-runner in the crowded Republican primary for governor.",
    "author": "John McCormick",
    "title": "Kathy Barnette Scrambles Pennsylvania GOP Senate Primary, Drawing Trump Ire"
  },
  {
    "id": 6825,
    "mediaId": 147,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "HARRISBURG, Pa. (AP)  Donald Trump on Saturday endorsed <span class='selected-term'>Doug Mastriano</span> in Pennsylvanias Republican primary for governor, siding with a far-right candidate who was outside the U.S. Capitol during the Jan. 6 insurrection and has worked with determination to overturn the results of the 2020 presidential election.",
    "author": "Marc Levy",
    "title": "Trump endorses Doug Mastriano ahead of Pennsylvania GOP governor primary"
  },
  {
    "id": 6829,
    "mediaId": 136,
    "date": "5/14/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump endorsed <span class='selected-term'>Doug Mastriano</span> in Pennsylvania's GOP gubernatorial primary Saturday, again alienating state leaders in the Republican Party.",
    "author": "Andrew Stanton",
    "title": "Trump Further Alienates Pennsylvania GOP by Backing Mastriano for Governor"
  },
  {
    "id": 5481,
    "mediaId": 409,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Pennsylvania state senator <span class='selected-term'>Doug Mastriano</span>, who secured former President Trumps endorsement just a few days ago, was declared the victor in the states GOP gubernatorial primary Tuesday night.",
    "author": "Caroline Downey",
    "title": "Trump-Backed Doug Mastriano Wins Pennsylvania GOP Primary for Governor"
  },
  {
    "id": 6733,
    "mediaId": 65,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Barnettes rise in the polls may have been partially fueled by her alliance with Sen. <span class='selected-term'>Doug Mastriano</span>, the polling front-runner for Pennsylvanias GOP gubernatorial primary.",
    "author": "Paul Steinhauser",
    "title": "Oz, Barnette, McCormick cast votes in crucial Pennsylvania GOP Senate primary"
  },
  {
    "id": 6753,
    "mediaId": 151,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "With far-right state Sen. <span class='selected-term'>Doug Mastriano</span> on the verge of capturing the Pennsylvania GOP gubernatorial nomination, Republicans are lashing out, furious that he could cost them a shot at a competitive race in the perennial swing state.",
    "author": "",
    "title": "GOP blame game erupts in Pennsylvania governor's race"
  },
  {
    "id": 6640,
    "mediaId": 323,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Democrats and some Republicans believe that could be the case for <span class='selected-term'>Doug Mastriano</span>, a strong supporter of the former presidents false allegations of widespread fraud in the 2020 presidential election.",
    "author": "John McCormick",
    "title": "Pennsylvania GOP Senate Race Might Be Headed for Recount"
  },
  {
    "id": 6676,
    "mediaId": 147,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "HARRISBURG, Pa. (AP)  <span class='selected-term'>Doug Mastriano</span> won the Republican nomination for Pennsylvania governor on Tuesday, beating eight other candidates and a party establishment that had tried to head off his nomination over fears that he is too extreme to win the general election in the presidential battleground.",
    "author": "Associated Press",
    "title": "Trump pick Doug Mastriano wins Pennsylvania GOP primary"
  },
  {
    "id": 6677,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Instead of focusing on kitchen-table issues like strengthening the economy and investing in education, <span class='selected-term'>Doug Mastriano</span> is an extremist running on a dangerous agenda that would devastate Pennsylvania families,? said Democratic Governors Association Executive Director Noam Lee.",
    "author": "Tal Axelrod",
    "title": "Mastriano wins Pennsylvania GOP governor primary despite party concerns"
  },
  {
    "id": 6681,
    "mediaId": 409,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Barnette, who got into some trouble for past anti-Muslim and anti-gay comments, had joined Trump-backed Republican Pennsylvania gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> on the campaign trail this past week.",
    "author": "Caroline Downey",
    "title": "Pennsylvania GOP Senate Primary Race Too Close to Call"
  },
  {
    "id": 6706,
    "mediaId": 188,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In the state's gubernatorial contest, Democratic Attorney General Josh Shapiro will face Republican State Sen. <span class='selected-term'>Doug Mastriano</span>.",
    "author": "Chris Pandolfo",
    "title": "Pennsylvania GOP Senate race appears to be headed for a recount"
  },
  {
    "id": 6592,
    "mediaId": 558,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "I would think that he [Trump] would be very interested in <span class='selected-term'>Doug Mastriano</span> moderating his message and trying to run as someone who can appeal to all Pennsylvanians,? said David Urban, a former Trump campaign adviser who helped him win Pennsylvania in 2016 (Trump lost the state in 2020).",
    "author": "",
    "title": "Trump leaves Pennsylvania GOP fuming over 'cockamamie election.' Next up: Georgia."
  },
  {
    "id": 6599,
    "mediaId": 157,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Former President Donald Trump privately trashed Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> before changing his mind last week and endorsing his gubernatorial campaign, throwing the state's Republican Party into turmoil.",
    "author": "Travis Gettys",
    "title": "Trump 'wearing out his welcome' with Pennsylvania GOP over his endorsements of 'difficult' candidates: report"
  },
  {
    "id": 6600,
    "mediaId": 33,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "As does the runaway victor in the commonwealth's GOP gubernatorial primary -- state Sen. <span class='selected-term'>Doug Mastriano</span>, who ran a campaign rooted in Trump's falsehoods about the last presidential election being stolen and who could oversee the 2024 White House race in the state if he wins in November.",
    "author": "Stephen Collinson",
    "title": "Trump taints Pennsylvania GOP Senate primary with fresh fraud lies"
  }
]