[
  {
    "id": 7045,
    "mediaId": 65,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "\"If the federal government is not willing to provide extra dollars to communities that have experienced increased strain on their healthcare systems, increased number of students in school districts and education costs and other services within our communities, then they shouldnt be forced to take on more illegal immigrants and the additional financial responsibility,\" he said\nAnother Pennsylvania Republican, state Sen. <span class='selected-term'>Doug Mastriano</span> of Chambersburg, said Thursday he will be co-sponsoring Scavello's legislation.",
    "author": "",
    "title": "Pennsylvania Republicans to draft bill to relocate migrants on Biden DHS flights to Delaware"
  },
  {
    "id": 7032,
    "mediaId": 675,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "Republican State Sen. <span class='selected-term'>Doug Mastriano</span> and others sought answers from Pennsylvania Gov.",
    "author": "WND News Services",
    "title": "The mystery of the migrant kids"
  },
  {
    "id": 7033,
    "mediaId": 675,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "Republican State Sen. <span class='selected-term'>Doug Mastriano</span> and others sought answers from Pennsylvania Gov.",
    "author": "WND News Services",
    "title": "The mystery of the migrant kids"
  },
  {
    "id": 7018,
    "mediaId": 124,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "The Jan. 6 committee has issued six new subpoenas related to the push to appoint alternate electors,? including Arizona Republican Party Chair Kelli Ward, Pennsylvania Republican State Sen. <span class='selected-term'>Doug Mastriano</span>, who is running for governor, and Arizona GOP Secretary of State candidate Mark FInchem.",
    "author": "",
    "title": "In Ukraine, Biden faces a crisis with little political benefit back home"
  },
  {
    "id": 6971,
    "mediaId": 151,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "On the Republican side, Dave White raised $1.8 million, Bill McSwain raised $1.4 million, Jake Corman raised $590,000, Lou Barletta raised $431,000 and <span class='selected-term'>Doug Mastriano</span> raised $373,000.",
    "author": "",
    "title": "Crypto's campaign year"
  },
  {
    "id": 6942,
    "mediaId": 43,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Last week in Gettysburg, a far-right Christian conference called Patriots Arise for God and Country? drew State Sen. <span class='selected-term'>Doug Mastriano</span>, a GOP front-runner for Pennsylvania governor; Teddy Daniels, a candidate for lieutenant governor; Maryland gubernatorial candidate Dan Cox; Liz Harrington, a spokesperson for  Donald Trump; and former Trump campaign attorney Jenna Ellis.",
    "author": "",
    "title": "Overnight News Digest: Russia attempts to grind Ukraine down; Sec. Clinton warns of fascism in US"
  },
  {
    "id": 3671,
    "mediaId": 157,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "The former president took about a third of the vote in his first Republican primary in the state, with a gaggle of opponents splitting up the rest, and Trump-loving election conspiracist <span class='selected-term'>Doug Mastriano</span> might do the same thing in his GOP gubernatorial primary.",
    "author": "Travis Gettys",
    "title": "Pennsylvania's primaries are getting crazier by the day -- and here are some highlights"
  },
  {
    "id": 3445,
    "mediaId": 238,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "Return to menu\nIn Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, a state senator who leads the polls going into Tuesday's GOP gubernatorial primary, is emblematic of the rising intensity of Christian nationalism that has rooted itself firmly in the Republican Party.",
    "author": "Mariana Alfaro",
    "title": "Midterm primaries live updates Voters to pick key nominees in Pa., N.C., three other states"
  },
  {
    "id": 3431,
    "mediaId": 129,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "A late endorsement\nOn Saturday, Trump finally endorsed <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "author": "",
    "title": "Republican Chaos' in Pennsylvania Threatens to Upend the Midterms"
  },
  {
    "id": 3538,
    "mediaId": 238,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "The tally in the Poconos borough that night was overwhelming: state Sen. <span class='selected-term'>Doug Mastriano</span>, 17.",
    "author": "Michelle Boorstein",
    "title": "Christian nationalism is shaping a Pa. primary  and a GOP shift"
  },
  {
    "id": 3409,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "A late endorsement\nOn Saturday, Trump finally endorsed <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "author": "",
    "title": "Live Updates: What to Watch for in the Pennsylvania and North Carolina Primaries"
  },
  {
    "id": 3410,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "A late endorsement\nOn Saturday, Trump finally endorsed <span class='selected-term'>Doug Mastriano</span>, a conspiracy-theory-minded retired military officer who leads polls in the governor's race, in an apparent attempt to hedge his bets.",
    "author": "",
    "title": "Live Updates: What to Watch for in the Pennsylvania and North Carolina Primaries"
  },
  {
    "id": 3484,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, state Sen. <span class='selected-term'>Doug Mastriano</span>, a Trump-endorsed candidate who led an effort to overturn the election in his state and attended the Stop the Steal rally on Jan. 6, 2021, the day a pro-Trump mob attacked U.S. Capitol, won the Republican nomination for governor.",
    "author": "David Weigel",
    "title": "Victories by Mastriano, Budd show potency of Trumps false stolen election claims in GOP"
  },
  {
    "id": 3493,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In the governors race, Republican voters chose to nominate <span class='selected-term'>Doug Mastriano</span>, a.k.a.",
    "author": "",
    "title": "Americas Doug Mastriano Problem"
  },
  {
    "id": 3494,
    "mediaId": 234,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Eric Lutz",
    "title": "Doug Mastrianos GOP Primary Victory Puts Democracy on the Ballot in Pennsylvania"
  },
  {
    "id": 6607,
    "mediaId": 129,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "And as Pennsylvania Republicans rejected Barnette, they tightly embraced her kindred spirit <span class='selected-term'>Doug Mastriano</span> as their nominee for governor: According to incomplete results, he won about 44 percent of the votes in a three-way race.",
    "author": "",
    "title": "David Graham pondered"
  },
  {
    "id": 6573,
    "mediaId": 558,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "As Donald Trump tried to overturn the results of the 2020 election, there were few officials more willing to help than <span class='selected-term'>Doug Mastriano</span>, then a little-known Pennsylvania state senator.",
    "author": "Sam Levine",
    "title": "Trump loyalists primary win prompts election fears in Pennsylvania"
  }
]