[
  {
    "id": 3387,
    "mediaId": 195,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "Pennsylvanias GOP gubernatorial primary\nPennsylvania Republicans appeared poised to nominate state Sen. <span class='selected-term'>Doug Mastriano</span> on Tuesday to take on Democrat Josh Shapiro in the November general election, stirring concern among some GOP officials who fear that Mastriano may prove unelectable.",
    "author": "Max Greenwood",
    "title": "Seven primary races to watch on Tuesday"
  },
  {
    "id": 5484,
    "mediaId": 1546,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "But Trump was undaunted by such fears, saying in a statement endorsing Mastriano, There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator <span class='selected-term'>Doug Mastriano</span>.",
    "author": "Ken Bredemeier",
    "title": "Trumps Republican Political Clout Faces Another Test on Tuesday"
  },
  {
    "id": 6478,
    "mediaId": 136,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Pennsylvania Gubernatorial Primary\nIn a highly divisive race, Trump gave an 11th hour endorsement to <span class='selected-term'>Doug Mastriano</span>, a far-right candidate who was part of the January 6 \"stop the steal\" protests and had attempted to overturn the 2020 Election results.",
    "author": "Ewan Palmer",
    "title": "Trump Endorsements Face Toughest Test Yet in 27 Primary Election Battles"
  },
  {
    "id": 6751,
    "mediaId": 943,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "And in Pennsylvanias GOP race for governor, far-right contender <span class='selected-term'>Doug Mastriano</span> was already leading before Trump backed him over the weekend.",
    "author": "WILL WEISSERT",
    "title": "Primary voters head to polls in Pennsylvania, North Carolina and 3 other states: Heres what to watch"
  },
  {
    "id": 3484,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In Pennsylvania, state Sen. <span class='selected-term'>Doug Mastriano</span>, a Trump-endorsed candidate who led an effort to overturn the election in his state and attended the Stop the Steal rally on Jan. 6, 2021, the day a pro-Trump mob attacked U.S. Capitol, won the Republican nomination for governor.",
    "author": "David Weigel",
    "title": "Victories by Mastriano, Budd show potency of Trumps false stolen election claims in GOP"
  },
  {
    "id": 5469,
    "mediaId": 129,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "A victory in Pennsylvania, and one key race was too close to call\n<span class='selected-term'>Doug Mastriano</span>, a state senator and retired Army colonel who has propagated myriad false claims about the 2020 election and attended the protest leading up to the Capitol riot, won the Republican nomination for Pennsylvania governor.",
    "author": "",
    "title": "Heres where Trumps endorsement record stands so far."
  },
  {
    "id": 5473,
    "mediaId": 136,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "",
    "author": "Khaleda Rahman",
    "title": "How Donald Trump's Candidates Fared in Latest Primary Elections"
  },
  {
    "id": 5475,
    "mediaId": 233,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Leading the Republican primary is state Sen. <span class='selected-term'>Doug Mastriano</span>, whose efforts to overturn the 2020 election in favor of Trump and ties to QAnon have raised concerns both in and outside the party.",
    "author": "David Jackson",
    "title": "Fetterman wins Pennsylvania Democratic Senate primary; NC polls close; live primary results"
  },
  {
    "id": 6475,
    "mediaId": 151,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In a last-minute endorsement that rattled members of Pennsylvanias Republican party, Trump backed Mastriano, a leading force in trying to overturn the 2020 election results who was pictured outside the Capitol on Jan. 6. There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator <span class='selected-term'>Doug Mastriano</span>,? Trump said last week.",
    "author": "",
    "title": "How Trump-backed candidates fared on the busiest primary day"
  },
  {
    "id": 6610,
    "mediaId": 195,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Some pointed to Budd and <span class='selected-term'>Doug Mastriano</span>, the newly minted GOP Pennsylvania gubernatorial nominee, as two who, while benefiting from Trumps endorsement, could have won their primaries without it.",
    "author": "Julia Manchester",
    "title": "Primaries fuel questions about potency of Trump endorsements"
  },
  {
    "id": 6621,
    "mediaId": 943,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span>  who secured a late endorsement from Trump and has trumpeted the former presidents lies about nonexistent, widespread fraud costing him the 2020 election  won the Republican nomination for Pennsylvanias open governors office.",
    "author": "WILL WEISSERT",
    "title": "Pennsylvania Lt. Gov. John Fetterman, who suffered a stroke days before primary, wins Democratic nomination for US Senate"
  },
  {
    "id": 6627,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "In the gubernatorial election, President Trumps endorsement propelled conservative State Sen. <span class='selected-term'>Doug Mastriano</span> to victory.",
    "author": "David N. Bossie",
    "title": "Pennsylvania proves Republicans still want 'America First'"
  },
  {
    "id": 6651,
    "mediaId": 169,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Last night, Pennsylvania Republicans nominated a Big Lie proponent and January 6th \"Stop the Steal\" attendee named <span class='selected-term'>Doug Mastriano</span> to run for governor of Pennsylvania in November.",
    "author": "Heather Digby Parton",
    "title": "2022 GOP primaries prove that MAGA is now bigger than Donald Trump"
  },
  {
    "id": 6653,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Trump was a winner in Pennsylvanias GOP gubernatorial primary, as state Sen. <span class='selected-term'>Doug Mastriano</span> bested a crowded field of contenders.",
    "author": "",
    "title": "Trump-backed Dr. Oz and Dave McCormick go into overtime in Pennsylvanias crucial GOP Senate primary"
  },
  {
    "id": 6655,
    "mediaId": 169,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "They'll join Trump-backed gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a state senator who attended the Jan. 6 rally ahead of the Capitol riot and served as a phony Trump elector in an effort to overturn his loss.",
    "author": "Igor Derysh",
    "title": "Cawthorns loss highlights Trumps waning influence but election deniers win big in GOP primaries"
  },
  {
    "id": 6689,
    "mediaId": 178,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Trump is poised to notch several easy wins, including in Pennsylvania's much-watched GOP race for governor, which far-right contender <span class='selected-term'>Doug Mastriano</span> was already leading before the former president backed him over the weekend.",
    "author": "WILL WEISSERT",
    "title": "Election 2022: Budd, Beasley to face off for N.C. Senate"
  },
  {
    "id": 6695,
    "mediaId": 1576,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "His pick for governor, state Sen. <span class='selected-term'>Doug Mastriano</span>, won the nomination.",
    "author": "",
    "title": "With a key race too close to call, here are 4 takeaways from Tuesday's primaries"
  },
  {
    "id": 4456,
    "mediaId": 238,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Republicans are in full-scale panic about <span class='selected-term'>Doug Mastriano</span>, the right-wing extremist who won the GOP primary for Pennsylvania governor this week.",
    "author": "Greg Sargent",
    "title": "Opinion Trumps alarming GOP primary wins demand a serious response"
  },
  {
    "id": 6585,
    "mediaId": 238,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "As the partys nominee for governor, GOP voters chose Trumps preferred pick, a state senator named <span class='selected-term'>Doug Mastriano</span> who trumpets the big lie? about the 2020 election being stolen; was present at the U.S. Capitol on Jan. 6, 2021 (though he says he left before the insurrectionary portion of the events); and appeared at an event associated with the hallucinatory QAnon conspiracy theory about the nation somehow being run by a cabal of pedophiles.",
    "author": "Eugene Robinson",
    "title": "Opinion Cult or a conspiracy? The GOP sure isnt a normal political party."
  },
  {
    "id": 6575,
    "mediaId": 129,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "The Republican nominee for governor in Pennsylvania, <span class='selected-term'>Doug Mastriano</span>, won his race on the strength of his enthusiastic support for Donald Trumps effort to subvert and overturn the results of the 2020 presidential election.",
    "author": "",
    "title": "Its Trumps Party, and Hell Lie if He Wants To"
  },
  {
    "id": 7205,
    "mediaId": 18,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "In the gubernatorial primary, the Trump-backed far-right candidate <span class='selected-term'>Doug Mastriano</span> was able to drub his opponents and win 44% of the vote in a 3-way race, even in the face of staunch opposition from the Republican establishment.",
    "author": "Douglas Schoen",
    "title": "Schoen: It's still Donald Trump's Republican party"
  },
  {
    "id": 7210,
    "mediaId": 19,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Now, again, that's going to be a couple days here, but they'll be done this coming week is my suspicion.\n<span class='selected-term'>Doug Mastriano</span> secured the Republican gubernatorial nomination in Pennsylvania following a late endorsement from former President Donald J. Trump over the weekend.",
    "author": "Nick Gilbertson",
    "title": "Trump-Endorsed Candidates 81-3 in Primaries Ahead of Races in Alabama, Arkansas, Georgia"
  }
]