[
  {
    "id": 6983,
    "mediaId": 675,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "U.S. Sen. Ron Johnson of Wisconsin and Pennsylvania State Sen. <span class='selected-term'>Doug Mastriano</span> met with members of the convoy to talk about their goals.",
    "author": "Michael Letts",
    "title": "Do D.C. Democrats fear the convoy truckers?"
  },
  {
    "id": 6984,
    "mediaId": 675,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "U.S. Sen. Ron Johnson of Wisconsin and Pennsylvania State Sen. <span class='selected-term'>Doug Mastriano</span> met with members of the convoy to talk about their goals.",
    "author": "Michael Letts",
    "title": "Do D.C. Democrats fear the convoy truckers?"
  },
  {
    "id": 6968,
    "mediaId": 157,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "And, theres an excellent chance the nuttiest bunny of them all, <span class='selected-term'>Doug Mastriano</span>, is going to win the primary.\"",
    "author": "Matthew Chapman",
    "title": "Former Ted Cruz staffer slams Pennsylvania GOP: Every governor candidate is an 'election conspiracist' down the 'rabbit hole'"
  },
  {
    "id": 3352,
    "mediaId": 195,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "Oz with a slim lead, but he's by no means out of the woods,? one Keystone State-based GOP operative told the Morning Report on Monday, adding that the worst-case scenario involves Barnette and state Sen. <span class='selected-term'>Doug Mastriano</span> (R), the Trump-endorsed candidate for governor, emerging victorious and handing Democrats a lifeline in November.",
    "author": "Alexis Simendinger",
    "title": "The Hill's Morning Report  Primary night: All eyes on Pennsylvania"
  },
  {
    "id": 6692,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Second, the nominee he backed for governor, <span class='selected-term'>Doug Mastriano</span>, won the primary and if he wins the election in November, Mastriano would have considerable influence over how the state's presidential election results are handled in 2024 when Trump may be on the ballot as our colleague's Rosalind S. Helderman, Isaac Arnsdorf and Josh Dawsey explain.",
    "author": "Theodoric Meyer",
    "title": "Trump uses Pa. primary to continue effort to undermine electoral system"
  },
  {
    "id": 6707,
    "mediaId": 157,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Republicans in Pennsylvania have expressed fears that Trump-backed gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> has no shot in this November's general election.",
    "author": "Sarah K. Burris",
    "title": "Many Republicans think Doug Mastriano is 'a threat to democracy' and secretly 'pray Dems win': Ex-Ted Cruz aide"
  },
  {
    "id": 7202,
    "mediaId": 151,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "And in Pennsylvania last week, <span class='selected-term'>Doug Mastriano</span>, the far-right election denier Trump endorsed, won the gubernatorial primary.",
    "author": "",
    "title": "'No one's paying any attention': The week that Republicans ignored Trump's election lies"
  }
]