[
  {
    "id": 7018,
    "mediaId": 124,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "The Jan. 6 committee has issued six new subpoenas related to the push to appoint alternate electors,? including Arizona Republican Party Chair Kelli Ward, Pennsylvania Republican State Sen. <span class='selected-term'>Doug Mastriano</span>, who is running for governor, and Arizona GOP Secretary of State candidate Mark FInchem.",
    "author": "",
    "title": "In Ukraine, Biden faces a crisis with little political benefit back home",
    "sentiment": "0"
  },
  {
    "id": 7019,
    "mediaId": 238,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "Arizona Republican Party chairwoman Kelli Ward\nArizona state Rep. Mark Finchem (R), who is running for Arizona secretary of state\nPennsylvania state senator and gubernatorial candidate <span class='selected-term'>Doug Mastriano</span> (R)\nFormer Michigan Republican Party chair Laura Cox\nMichael Roman and Gary Brown, the director and deputy director of Election Day operations for Trumps reelection campaign\nThe committee previously subpoenaed Trump electors from multiple states won by Biden that sent paperwork to Washington certifying their votes for Trump,? Tom and Jacqueline write.",
    "author": "",
    "title": "The cyber fight in Ukraine is getting more serious",
    "sentiment": "0"
  },
  {
    "id": 7021,
    "mediaId": 43,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "State Sen. <span class='selected-term'>Doug Mastriano</span> is a candidate for Pennsylvania governor, and state Rep. Mark Finchem is running to be the next secretary of state in Arizona.",
    "author": "",
    "title": "Full Moon Wednesday GNR",
    "sentiment": "0"
  },
  {
    "id": 6993,
    "mediaId": 34,
    "date": "3/14/2022 12:00:00 AM",
    "sentence": "Subverting Democracy Plan B: <span class='selected-term'>Doug Mastriano</span>\nThe second phase of the subversion plan contemplated that Congress might not accept the phony Trump electors when it met to certify Biden's election on January 6, 2021.",
    "author": "Steven Harper",
    "title": "The War on Democracy Is Here",
    "sentiment": "0"
  },
  {
    "id": 6942,
    "mediaId": 43,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Last week in Gettysburg, a far-right Christian conference called Patriots Arise for God and Country? drew State Sen. <span class='selected-term'>Doug Mastriano</span>, a GOP front-runner for Pennsylvania governor; Teddy Daniels, a candidate for lieutenant governor; Maryland gubernatorial candidate Dan Cox; Liz Harrington, a spokesperson for  Donald Trump; and former Trump campaign attorney Jenna Ellis.",
    "author": "",
    "title": "Overnight News Digest: Russia attempts to grind Ukraine down; Sec. Clinton warns of fascism in US",
    "sentiment": "0"
  },
  {
    "id": 6716,
    "mediaId": 129,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "The former president also endorsed <span class='selected-term'>Doug Mastriano</span>, a far-right loyalist who has promoted conspiracy theories and is the leading Republican candidate for governor.",
    "author": "",
    "title": "Your Tuesday Evening Briefing",
    "sentiment": "0"
  },
  {
    "id": 4461,
    "mediaId": 195,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "OPINION\n Americas <span class='selected-term'>Doug Mastriano</span> problem, by Ross Douthat, columnist, The New York Times.",
    "author": "Alexis Simendinger",
    "title": "The Hills Morning Report  Recount looms in Pennsylvania",
    "sentiment": "0"
  },
  {
    "id": 6557,
    "mediaId": 129,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "As Reid Epstein wrote in The Times, Republican voters in Pennsylvania anointed right-wing gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.?\nMastriano spread conspiracies about 2020 phantom ballots, hacked machines and dead voters.",
    "author": "",
    "title": "Johnny Depp and Other Pirates",
    "sentiment": "0"
  },
  {
    "id": 7229,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Not when people like Pennsylvania State Senator <span class='selected-term'>Doug Mastriano</span>  an election denier who marched with the Jan. 6 crowd at the Capitol  just won the G.O.P.",
    "author": "",
    "title": "My Lunch With President Biden",
    "sentiment": "0"
  }
]