[
  {
    "id": 6959,
    "mediaId": 169,
    "date": "d2022-04-14T09:31",
    "sentence": "Leading GOP candidates <span class='selected-term'>Doug Mastriano</span> and Lou Barletta even took part in Trump's fraudulent elector scheme.",
    "author": "Igor Derysh",
    "title": "Trump admits he wanted Barr to take the fall for election scheme: I said look, get impeached",
    "sentiment": "0.0"
  },
  {
    "id": 6766,
    "mediaId": 157,
    "date": "d2022-05-17T00:00",
    "sentence": "\"There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator <span class='selected-term'>Doug Mastriano</span>,\" Trump said in his endorsement.",
    "author": "Bob Brigham",
    "title": "Trump-endorsed Jan. 6 protestor Doug Mastriano secures Pa. nomination",
    "sentiment": "-0.592"
  },
  {
    "id": 6716,
    "mediaId": 129,
    "date": "d2022-05-17T22:48",
    "sentence": "The former president also endorsed <span class='selected-term'>Doug Mastriano</span>, a far-right loyalist who has promoted conspiracy theories and is the leading Republican candidate for governor.",
    "author": "",
    "title": "Your Tuesday Evening Briefing",
    "sentiment": "0"
  },
  {
    "id": 6623,
    "mediaId": 238,
    "date": "d2022-05-18T18:49",
    "sentence": "Republican voters overwhelmingly nominated state Sen. <span class='selected-term'>Doug Mastriano</span>, one of the countrys most ardent deniers of the 2020 presidential election result.",
    "author": "Editorial Board",
    "title": "Opinion After the Pennsylvania primary, the threat to U.S. democracy rises",
    "sentiment": "-0.221"
  },
  {
    "id": 6604,
    "mediaId": 238,
    "date": "d2022-05-19T00:00",
    "sentence": "But it's limited: still doesn't stop bad-faith lawsuits or states (Missouri, for example) from charging cybersecurity researchers.https://t.co/S0scT01bG7\n Kevin Collier (@kevincollier) May 19, 2022\nAs I read it, prosecutors should decline? to prosecute good-faith security research, but still have the discretion to do so\n Marcia Hofmann (@marciahofmann) May 19, 2022\n<span class='selected-term'>Doug Mastriano</span> has vowed to decertify some of his states voting machines and has asserted that Pennsylvanias Republican legislature has the power to decide which presidential electors to send to Washington, Rosalind S. Helderman, Isaac Arnsdorf and Josh Dawsey report.",
    "author": "Joseph Marks",
    "title": "Ransomware payments spiked 70 percent last year",
    "sentiment": "0.0"
  }
]