[
  {
    "id": 7049,
    "mediaId": 43,
    "date": "2022-00-11",
    "sentence": "And Pennsylvania has a perfect solution for energy, a bridge fuel, natural gas.?\nAlso, heres the latest on the GOP primary in the Governors race:\nMichael Flynn suggested this weekend that Democrats would refer to Jesus Christ as a \"domestic terrorist\" during a speech in which he endorsed Republican state Senator <span class='selected-term'>Doug Mastriano</span> for Pennsylvania governor.",
    "author": "",
    "title": "The Hill, \"John Fetterman (D) calls for ban on congressional stock trading\"",
    "sentiment": "0.0"
  },
  {
    "id": 7024,
    "mediaId": 124,
    "date": "2022-00-15",
    "sentence": "Among those being subpoenaed are Kelli Ward, the Arizona GOP chair who has already filed suit to block the committee from getting her phone records, and Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span>, an outspoken purveyor of the false claim that there was widespread fraud in the presidential election.",
    "author": "",
    "title": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers",
    "sentiment": "0.0"
  },
  {
    "id": 6642,
    "mediaId": 136,
    "date": "2022-00-18",
    "sentence": "Right-wing Candidates and the 'Big Lie'\nRight-wing Republican candidates have performed well in Tuesday's elections, in particular Pennsylvania state Senator <span class='selected-term'>Doug Mastriano</span> who will now be the party's nominee for governor.",
    "author": "Darragh Roche",
    "title": "Five Key Takeaways From Primary Election Results",
    "sentiment": "0.0"
  },
  {
    "id": 6556,
    "mediaId": 151,
    "date": "2022-00-21",
    "sentence": "CONCERN IN THE KEYSTONE: Republican operatives in Pennsylvania mounted an all-out blitz to stop state Sen. <span class='selected-term'>DOUG MASTRIANO</span> from winning the GOP gubernatorial nomination.",
    "author": "",
    "title": "POLITICO Playbook: Sean Patrick Maloney dodges a bullet",
    "sentiment": "0.0"
  }
]