{
  "id": 10759,
  "mediaId": 2573,
  "date": "2022-03-09",
  "headline": "Republicans demand TSA allow COVID mask mandate to expire",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2020/12/4ef7b96e-TSA-Officer-Kenneth-Ordenana-TSA-MCO.jpg",
  "link": "https://www.foxnews.com/politics/republicans-demand-tsa-allow-covid-mask-mandate-expire",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Audrey Conklin",
  "authorUrl": "https://www.foxnews.com/person/c/audrey-conklin",
  "termIds": [
    2714,
    4509,
    4066,
    4698,
    4939,
    1380,
    1126,
    473
  ],
  "sentences": [
    "In late February, various travel groups including the U.S. Travel Association, the American Hotel and Lodging Association, Airlines for America and the U.S. Chamber of Commerce sent a letter to White House Coronavirus Response Coordinator Jeffrey Zients, asking the administration to repeal mask requirements, pre-departure COVID-19 testing, the use of travel bans and other regulations in the coming months.",
    "\"Given travel’s slow economic recovery, and in light of the improved public health metrics in the U.S. and medical advancements to prevent the worst outcomes of COVID-19, we encourage the Administration to immediately remove travel requirements that no longer fit with the current environment and to set clear timelines and metrics for when others will be lifted,\" the letter stated.",
    "\"Given strong declines in COVID-19 cases and the Center for Disease Control and Prevention’s (CDC) latest guidance eliminating indoor mask requirements for much of the population, we believe TSA’s mask mandate should be allowed to expire later this month,\" Republican Reps.",
    "FIRST ON FOX: Republicans are demanding the Transportation Security Administration (TSA) to end its COVID-19 mask mandate on March 18 — the date its mandate was set to expire when it was initially extended in August 2021.",
    "Ninety-two Republicans signed the letter in total, including House GOP Leader Kevin McCarthy of California, GOP Whip Steve Scalise of Louisiana and House Republican Conference Chair Elise Stefanik of New York.",
    "The Federal Aviation Administration (FAA) has recorded 535 unruly passenger reports related to face masks, which represents 65% of the total 814 unruly passenger reports the FAA recorded as of March 1.",
    "As of last week, more than 90% of Americans live in low or moderate COVID-19-transmission areas, meaning they can stop wearing masks indoors and social distancing in line with CDC guidance.",
    "US PUSHED PARTNERSHIP WITH WUHAN LAB SINCE 2017 — WITH PROMISE OF ‘PANDEMIC PREPAREDNESS,’ DOCUMENTS SHOW\nTSA has not given any indication that it will further extend mandates by March 18.",
    "Guy Reschenthaler of Pennsylvania and Doug LaMalfa of California wrote in a letter to TSA Administrator David Pekoske exclusively obtained by Fox News Digital.",
    "The lawmakers added that since the agency extended its mandate in August 2021, \"the rolling average of new COVID-19 cases has declined by nearly two-thirds.\"",
    "TSA extended the mandate last summer until March 18 across all transportation networks in the United States, including airports, airplanes, buses and trains.",
    "\"No airline employee should have to deal with unruly passengers, and we support the FAA continuing to take a hard stance against these passengers.",
    "It is past time that we follow the science and allow Americans to return to normalcy,\" the Republicans wrote.",
    "We believe that eliminating the mask mandate will provide a safer travel experience for everyone involved.",
    "Currently, not wearing a mask in airports is a federal offense that can result in fines up to $3,000.",
    "Fox News' Kelly Laco contributed to this report."
  ]
}