{
  "id": 11126,
  "mediaId": 2699,
  "date": "2022-03-16",
  "headline": "Dr. Oz’s PA Senate Rival Sure Was ‘Woke’ While He Was a CEO",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1647402727/220315-sollenberger-oz-tease-01_copy_yjmisa",
  "link": "https://www.thedailybeast.com/dr-ozs-anti-woke-gop-rival-david-mccormick-has-a-trans-positive-past?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Roger Sollenberger",
  "authorUrl": "https://www.thedailybeast.com/author/roger-sollenberger",
  "termIds": [
    5862,
    5905,
    3929,
    2802,
    1489,
    190,
    1126,
    1032,
    6506
  ],
  "sentences": [
    "The New York Times also reported that McCormick has knocked the America First worldview, endorsed Democrat Amy McGrath during her 2020 challenge against Minority Leader Mitch McConnell (though the MAGAworld often hates McConnell), called the Jan. 6 attack on the U.S. Capitol “horrific” and “a dark chapter in American history,” and skewered Trump’s inner circle for having “no sense of how the world works.”\nBut now that he’s in pursuit of the MAGA dream, McCormick has hired three top Trump advisers: Cliff Sims, Hope Hicks, and white nationalist Stephen Miller.",
    "McCormick’s own highlights included equal parental leave for “all new parents regardless of gender or path to parenthood (with additional medical recovery time for those who give birth),” and fertility coverage for “anyone” who wanted to become a parent—be it “via IVF, adoption, and/or egg freezing which is especially important for LGBTQ+ families.”\n(While McCormick used “LGBTQ+” in his open letter, the Association of LGBTQ Journalists uses “LGBTQ,” as does the advocacy group GLAAD in its media reference guide.",
    "And the album cover that introduces the transgender TV segment is titled in the ad “TRANSGENDER KIDS.”\nIn the video, Oz sits onstage with a little girl and her mother and asks the child, “Do you remember when your parents thought you were a boy?”\nThe clip ends there, without the show’s additional context, which as the Associated Press noted included interviews with parents and a pediatrician about the broader experience of raising a transgender child.",
    "David McCormick, the leading candidate in Pennsylvania’s Republican Senate primary, claims he’s running to challenge “the weakness and wokeness that you see across the country.”\nBut as McCormick and his allies ramp up their culture-war crusade, it’s McCormick’s record as a former hedge-fund manager—and the inclusive policies he championed while leading his company—that could quickly become a political liability in a rabid GOP primary.",
    "The diversity and inclusion page continues that Bridgewater has a “dedicated diversity and inclusion team reporting directly to CEO David McCormick, several affinity groups to empower our diverse communities, and a senior council charged with continuing to make Bridgewater a vibrant, inclusive community.”\nThese kinds of corporate statements have been criticized as “virtue signaling,” a term conservatives often apply to liberals.",
    "Oz spokesperson Brittany Yanick provided a statement saying that McCormick “doesn’t have a conservative bone in his body.”\n“While Wall Street Insider David McCormick touts himself as a ‘conservative,’ he has a history of betting millions on China to succeed, ripping off PA taxpayers, and offering employee benefits packages that included full coverage for transgender surgeries.",
    "“Given our mission to have the deepest possible understanding of global economies, we seek to find, retain, and grow the best talent across gender identity, race and ethnicity, sexual orientation, gained experiences, and more,” reads Bridgewater’s “diversity and inclusion” landing page, archived from November 2020.",
    "“David McCormick doesn’t have a conservative bone in his body and Pennsylvanians aren’t falling for his repeated attempts to take Dr. Oz out of context.”\nA McCormick spokesperson referred The Daily Beast to Honor Pennsylvania, citing the fact that candidates cannot coordinate with super PACs.",
    "Bridgewater joined some of the largest U.S. corporations, including Starbucks, Salesforce, Amazon, and Disney—all of which conservatives have criticized as “woke.”\nMcCormick said he embarked on the overhaul in January 2020, about a month after taking over as CEO.",
    "As the former CEO of the largest hedge fund in the world, Bridgewater Associates, McCormick boasted about his company’s inclusiveness, which extended to full paid coverage for gender transition surgery and earned a perfect score as an LGBTQ-friendly workplace.",
    "And McCormick himself stated in an open letter about his “employee benefits journey” that he wanted Bridgewater’s programs to “signal our values.”\nStill, the hedge fund was no pioneer in providing gender-affirming benefit programs.",
    "A recent attack ad against McCormick’s big rival—pop surgeon Dr. Mehmet Oz—is spotlighting the talk-show host’s position on transgender issues, slamming him as a “Republican in Name Only” for engaging on the topic in the past.",
    "According to the filing, the super PAC drew most of its initial financial firepower from billionaire Ken Griffin, another hedge-fund maven and GOP megadonor, who ponied up $5 million of the $5,450,000 raised last year.",
    "The super PAC also labeled Oz a “liberal RINO” because he “posted about Black Lives Matter on social media” and danced around with Michelle Obama and a bunch of kids on one of his shows several years ago.",
    "Bridgewater’s website, which lists “the ability to be who you are” as one of its three “core values,” also showcased its diversity and inclusion programs, including transgender affirming groups.",
    "The ad in question, called “Greatest Hits,” came from a pro-McCormick super PAC that wants viewers to believe Oz has a MAGA credibility gap—specifically when it comes to transgender issues.",
    "A dedicated diversity and inclusion team reported “directly to CEO David McCormick,” and in 2021 those issues became a “Top Strategic Priority.” (McCormick stepped down in January 2022.)",
    "He didn’t want to “chase trends,” he wrote, but create programs “built for the long term.”\nWhat emerged was a robust benefits program, with a focus on gender inclusivity.",
    "Oz caught backlash from conservatives after The Daily Beast reported in December that the daytime TV superstar had pulled an about-face on his stance on abortion.",
    "That record isn’t stopping a pro-McCormick super PAC from going after his Republican competition for their past support of transgender rights, however.",
    "McCormick also wrote at length about Bridgewater’s diversity and inclusion programs more broadly, which he took credit for spearheading and nurturing.",
    "Honor Pennsylvania highlighted that move in multiple ads, along with previous Oz positions on so-called red-flag gun laws and Obamacare.",
    "As one case in point, he’s been forced to spin Bridgewater’s ties to China—which run $5 billion deep—as an asset, not a liability.",
    "The western Pennsylvania native’s attempt to fashion himself as a populist clangs against his decade-plus corporate career.",
    "The next day, ahead of publication, the spokesperson asked whether The Daily Beast had been in touch with the super PAC.",
    "Oz and McCormick are the leading candidates, and both entered the race recently, after Sean Parnell’s departure.",
    "The super PAC behind the ads, “Honor Pennsylvania Inc,” has already spent $7.7 million to boost McCormick.",
    "And it takes Oz to task for a show about raising transgender children that aired more than a decade ago.",
    "The group’s next report is due mid-April, also the first filing deadline for the McCormick campaign.",
    "The ad’s conceit is a review of “hit” records, where the “hits” are Oz’s previous positions.",
    "McCormick’s perceived MAGA transgressions, however, appear more politically substantive.",
    "Both candidates have found their personal history at odds with right-wing grievances.",
    "But Pennsylvania MAGA purists may have to do some real nose-holding in that primary.",
    "The only available Honor PA campaign-finance report covers through the end of 2021.",
    "Now he’s flip-flopping and railing against the ‘woke mob,’” the statement said.",
    "Honor Pennsylvania did not reply to a request for comment.",
    "But the super PAC has picked a curious topic for a fight.",
    "(This rule does not apply to public comments generally.)",
    "More accurately, the money has gone to attacking Oz.",
    "The primary will be held one month later.",
    "The Daily Beast uses both acronyms.)"
  ]
}