{
  "id": 11129,
  "mediaId": 2679,
  "date": "2022-03-18",
  "headline": "Dr. Oz’s heritage is targeted as Pennsylvania rivals vie for Trump backing",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/dr-ozs-heritage-is-targeted-as-rivals-vie-for-trump-backing/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Shane Goldmacher",
  "authorUrl": "https://www.seattletimes.com/author/shane-goldmacher/",
  "termIds": [
    5905,
    5862,
    5641,
    4540,
    4941,
    2802,
    2765,
    6159,
    6506
  ],
  "sentences": [
    "Late last year, before he had formally entered the Pennsylvania Senate race, David McCormick flew to Florida for a private meeting with Donald Trump, angling to get in the former president’s good graces before a Republican primary that would soon pit him against Dr. Mehmet Oz, a celebrity surgeon and television personality.",
    "McCormick, then the CEO of the world’s largest hedge fund, had an edge in pitching Trump: His wife, Dina Powell McCormick, had been a senior national security official in the Trump White House, and she accompanied him to the meeting at Mar-a-Lago.",
    "At one point, Powell McCormick, an Egyptian-born Coptic Christian who is fluent in Arabic, showed a picture of Oz alongside others wearing Muslim head coverings, according to four people briefed on the exchange, not previously reported.",
    "“This is an anonymous, false smear on a candidate’s wife who is an Arab American immigrant woman who fled the Middle East to escape religious persecution,” Szymanski said of the account of the McCormicks’ meeting with Trump.",
    "As McCormick and his wife, a top Goldman Sachs executive, made their case, the topic soon turned to electability and Oz’s Turkish American heritage, which has become a central point of contention in the campaign.",
    "The McCormick campaign has publicly made Oz’s heritage an issue from McCormick’s first day as a candidate in January, when he called on Oz to renounce his Turkish citizenship.",
    "The people briefed on the conversation said Powell McCormick told Trump the fact that Oz was Muslim would be a political liability in parts of Pennsylvania.",
    "With polls showing a competitive Republican contest, the race is awash in negative ads and on pace to be one of the nation’s most expensive primaries.",
    "His campaign has since accused Oz of harboring “dual loyalties.”\nMcCormick spokesperson Jess Szymanski echoed the concerns he has raised publicly.",
    "A spokesperson for Trump confirmed that the private meeting with the McCormicks took place but declined to comment on anything said.",
    "The McCormick campaign denied that account and insisted the McCormicks have focused only on Oz’s ties to Turkey as a liability.",
    "The early meeting with Trump was one sign of the intensity of the race to succeed retiring Sen. Pat Toomey, a Republican.",
    "Advertising\n Skip AdSkip AdSkip Ad\nTrump’s blessing is widely seen as potentially decisive.",
    "The Pennsylvania seat is a linchpin in both parties’ pursuit of the Senate majority.",
    "This story was originally published at nytimes.com.",
    "Read it here."
  ]
}