{
  "id": 11138,
  "mediaId": 2572,
  "date": "2022-03-14",
  "headline": "Dr. Oz, now a GOP Senate candidate, had Jazz Jennings, transgender parents, transgender surgeon on his show",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Dr.-Oz-Pennsylvania-Senate-Race.jpg",
  "link": "https://www.foxnews.com/politics/dr-oz-now-a-gop-senate-candidate-had-jazz-jennings-transgender-parents-transgender-surgeon-on-his-show",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler O'Neil",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-oneil",
  "termIds": [
    5644,
    5169,
    3325,
    3497,
    3890,
    2802,
    339,
    1126
  ],
  "sentences": [
    "Dr. Mehmet Oz, a former surgeon and TV personality, has presented a conservative platform in the race for the Republican U.S. Senate nomination in Pennsylvania, but in spite of his conservative platform on social and transgender issues, he repeatedly gave a platform to transgender activists, transgender parents, and a surgeon who performs transgender surgery.",
    "\"A review of his broadcasts suggests Dr. Oz has used his show to promote transgender ideology, including things like mastectomies on healthy teen girls and using pharmaceutical drugs to prevent puberty on healthy children,\" Michael Geer, president and CEO of the Pennsylvania Family Institute, told Fox News Digital.",
    "GEORGIA GOP CANDIDATE, A RETIRED MARINE COLONEL, URGES MILITARY TO REVERSE TRANSGENDER POLICY AMID UKRAINE WAR\nConservatives criticized Dr. Oz's history with transgender guests on his show, and they urged him to take strong stances against pro-transgender medical interventions for children.",
    "CLICK HERE TO DOWNLOAD THE FOX NEWS APP\n\"The good news for Dr. Oz is that elections are about the future, and he can clarify his position by making a pledge to Pennsylvanians to, at the very least, protect their children from this agenda and uphold parental rights,\" Scholling added.",
    "During the show, Dr. Oz also spoke with pediatrician Dr. Robert Garofalo, who later credited his appearance on the show for enabling a change in his \"career path to think more broadly about the transgender health and specifically to the inclusion of children and families.\"",
    "PAXTON CLAPS BACK AFTER BIDEN CONDEMNS ‘STATE LAWS TARGETING TRANSGENDER AMERICANS’\nIn 2015, Dr. Oz brought on the show Jazz Jennings, a transgender teen and activist whose parents started a pro-transgender nonprofit and whom Oprah Winfrey had previously featured.",
    "While a search for \"transgender\" brought up these examples on Dr. Oz's show's website, searches for \"detransition,\" \"ex-transgender,\" and critics of the transgender movement like Abigail Shrier and Ryan T. Anderson did not turn up any relevant hits.",
    "\"Doctor Oz is a conservative who doesn’t believe biological men should play women’s sports, and he’s running a TV ad presently to that effect,\" Brittany Yanick, a spokeswoman for the Oz campaign, told Fox News Digital in a statement Sunday.",
    "\"The left's attempt to impose its radical gender ideology on the rest of society is shaping up to be one of the most important issues in this year's midterms,\" American Principles Project President Terry Schilling told Fox News Digital.",
    "CONSERVATIVES DEFEND TEXAS' POLICY INVESTIGATING TRANSGENDER ‘TREATMENTS’ AS CHILD ABUSE AMID COURT BATTLE\nDr. Oz has gained a broad conservative following in part due to his vocal opposition of many COVID-19 mandates.",
    "\"To assuage the concerns of Pennsylvania families, we would invite Dr. Oz to sign our Big Family Pledge and make clear he stands with them against this leftist cultural extremism,\" Schilling concluded.",
    "Yet Dr. Oz gave a platform to transgender children, parents who changed their gender identities, and a surgeon who performs transgender surgery, even before Bruce Jenner's transgender splash in 2015.",
    "\"Such actions permanently alter healthy bodies, can result in irreversable sterilization, and lead to more suicidal ideation, not less, as studies have shown,\" Geer added.",
    "Oz does not appear in the videos, but one video discusses \"the importance of pronouns,\" in which \"J,\" who identifies as non-binary and transgender, discusses pronouns.",
    "Dr. Oz also hosted two fathers who \"had become moms,\" discussed a couple's sex life, and said it was \"wonderful\" that a child now called her dad-to-mom \"mom-squared.\"",
    "\"Parents are especially upset about how their children are being indoctrinated into this ideology through the public schools, sometimes even without their knowledge.",
    "He has also taken firm conservative stances against abortion, for the Second Amendment, for energy independence, and against leftist \"indoctrination\" in education.",
    "\"Voters need to know: Does Oz believe, for example, that kids should undergo sex changes, or that biological males should be allowed to compete in girls' sports?",
    "\"He has treated transgender people with dignity and he’s covered the high suicide rates with transgender people, and takes it very seriously,\" Yanick added.",
    "Josie, 8, and her mother Vanessia claimed that Josie's life improved once the child – born male – rejected a masculine identity and embraced a feminine one.",
    "Isaac, 15, and his parents Arturo and Monica said they decided that the teen – born female – should take hormone blockers and undergo a double mastectomy.",
    "\"Pennsylvanians are rightly concerned that Dr. Oz holds to this ideology, but if he does not, they need to hear him publicly repudiate those views.\"",
    "Dr. Oz also hosted two segments with Dr. Christine McGinn, a surgeon who performs transgender surgeries and who also identifies as transgender.",
    "In most polls, he is running second behind former Undersecretary to the Treasury David McCormick, who served under President George W. Bush.",
    "The LGBTQ activist group GLAAD praised the \"groundbreaking\" content and urged supporters to contact Dr. Oz and thank him.",
    "For these parents, Dr. Oz's past record of seemingly promoting gender confusion is an understandable cause for concern.\"",
    "The Oz campaign did not present any instances where Dr. Oz invited a critic of transgenderism to appear on his program.",
    "\"In fact, Doctor Oz has repeatedly praised JK Rowling’s brave stance for stating the truth about this important issue.\"",
    "Does he believe the dubious concept of 'gender identity' should replace biological reality in our civil rights law?\"",
    "In 2010, Dr. Oz had two transgender kids on his show for a program called \"Transgender Kids: Too Young to Decide?\"",
    "He reportedly started a transgender clinic, giving minors cross-sex hormones and surgeries, in 2013.",
    "During the show, Dr. Oz told Jennings' mother, \"I love the support you've given your daughter.",
    "Dr. Oz also hosted an online series on \"Oz Tube\" called the Queer Family Tree.",
    "And you can see the beautiful young woman she's becoming because of it.\"",
    "McGinn discussed how to change male sex organs into female sex organs.",
    "Jennings shared experiences of taking cross-sex hormones.",
    "News tips can be sent to: tyler.oneil@fox.com.",
    "Tyler O'Neil is an editor at Fox News.",
    "On Twitter: @Tyler2ONeil.",
    "It's wonderful."
  ]
}