{
  "id": 11282,
  "mediaId": 2644,
  "date": "2022-03-07",
  "headline": "Dr. Oz accuses sister of stealing millions, forging dad’s will",
  "image": "https://pagesix.com/wp-content/uploads/sites/3/2022/03/oz-comp.jpg?quality=75&strip=all&w=1200",
  "link": "https://pagesix.com/2022/03/07/dr-oz-accuses-sister-of-stealing-millions-forging-dads-will/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Priscilla DeGregory",
  "authorUrl": "",
  "termIds": [
    4657,
    2802,
    905,
    6043,
    6240,
    6430,
    6669,
    6682
  ],
  "sentences": [
    "The television personality-turned-aspiring politician detailed his family’s legal dispute in an affidavit asking a judge to pause sister Nazlim Oz’s suit accusing him of wrongfully withholding rent payments from a pair of Upper East Side apartments owned by their dad, Mustafa, who died in 2019, the court papers say.",
    "“We are attempting to recover the funds from those accounts, at least a portion of which represent the very rental payments from the Oz LLC tenants that she now accuses me in this New York litigation of failing to distribute to her,” Dr. Oz’s affidavit alleges.",
    "The host of “The Dr. Oz Show” host — which ended last month — says Turkish prosecutors have tracked down some of the cash in bank accounts in three other countries, including the Cayman Islands, according to a Manhattan Supreme Court filing from Friday.",
    "The rental income has been going to Nazlim and their other sister, Seval — but Dr. Oz, as the manager of the apartments, said he cut Nazlim off pending another legal dispute that’s playing out in Turkish courts, the filing says.",
    "Oz ceased the distributions because he, Seval, and their mother (Suna Oz) uncovered evidence that Nazlim had been stealing her father’s money,” Dr. Oz’s lawyer, Michael J. Cohen, wrote in court papers.",
    "Health guru Mehmet Oz is in the midst of a family feud with his sister, who he claims has swiped millions of dollars from their late father’s estate, according to a new court papers.",
    "The sibling squabble stems from allegations that Nazlim took over their father’s account without permission in the year leading up to his death, Dr. Oz claims in the affidavit.",
    "Nazlim — who lives in Turkey — allegedly hid money “from her father’s estate to her own use and to the ongoing detriment of her sister, Seval Oz,” the affidavit alleges.",
    "In December, Sony announced that Dr. Oz’s show was ending Jan. 14 as he prepared to run for Pennsylvania’s open US Senate seat.",
    "Nazlim also allegedly “deprived our mother of funds with which to live, and deprived her of her inheritance,” the papers say.",
    "Dr. Oz claims Nazlim forged their dad’s will in 2018 in an attempt to override the real one, according to the affidavit.",
    "Dr. Oz is asking a Manhattan judge to stay his sister’s suit against him pending the resolution of the Turkish matter.",
    "That money is being held in a separate account and he insists he doesn’t “benefit” from the rental income in any way.",
    "The office found that Nazlim has accounts in the Netherlands, India and the Cayman Islands, the affidavit alleges.",
    "The Istanbul Chief Prosecutor’s Office launched a probe to track down Mustafa’s money.",
    "Lawyers for Nazlim did not immediately return a request for comment.",
    "Dr. Oz needs to call in Dr. Phil.",
    "“Dr."
  ]
}