{
  "id": 1139,
  "mediaId": 8493,
  "date": "2022-02-12",
  "headline": "PA Headlines: Dr. Mehmet Oz Receives Star on Hollywood Walk of Fame",
  "image": "https://www.wkok.com/wp-content/uploads/2020/07/SBC-APP-KO-CAR-PLAY-New.jpg",
  "link": "https://www.wkok.com/595138-2/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    0
  ],
  "sentences": [
    "Oz Show” to run for U.S. Senate in Pennsylvania, got a star Friday on the Hollywood Walk of Fame — just as he was being attacked 2,000 miles away in a rival’s TV ad saying he’s too “Hollywood.” The star underscores how successful Oz was before he gave up his TV show to run for public office in one of the nation’s premier Senate contests.",
    "Oz was introduced at the ceremony by TV personality Maria Menounos and actor Dean Cain, and gave a seven-minute speech that echoes his campaign trail characterization of him as a crusader to empower his viewers with medical information to challenge the medical establishment.",
    "“Doctors weren’t always happy when I would have patients educated from my show walk in with lots of extra questions asking about alternative approaches, things that just weren’t part of the traditional medical upbringing,” Oz said.",
    "That same career, however, is being used against him by rivals who are picking apart his TV shows and his past as a self-styled wellness and anti-obesity advocate to fuel doubt about his conservative credentials as a Republican.",
    "He said he used a “bold, brave voice” on his TV show — although critics said he often promoted questionable products and medical advice — to also take on “Big Pharma,” chemical companies, “Big Tech” and the federal government.",
    "Oz was a longtime resident of Cliffside Park, New Jersey, before running for Senate in Pennsylvania, saying he is now renting a home owned by his in-laws in the suburban Philadelphia town of Bryn Athyn.",
    "The chamber of commerce retains a $50,000 sponsorship fee for celebrities who are nominated and selected for a star, though that price is subject to change.",
    "“Preliminary investigation indicates that the fire was accidental in nature with nothing suspicious being observed,” state police said in a news release.",
    "Bethlehem Area School District Superintendent Joseph Roy told the newspaper LaBarre had been a family and consumer sciences teacher since 2008.",
    "He also gave a shoutout to Republican icons — former Presidents Donald Trump and Ronald Reagan — who also have stars on the Walk of Fame.",
    "The Hollywood Chamber of Commerce lauds Oz as having won 10 Daytime Emmy Awards and authoring New York Times bestsellers on wellness.",
    "The Morning Call newspaper reported the victims were Rosemarie LaBarre, 53, and her grandchildren, who ranged in age from 2 to 7.",
    "KRESGEVILLE, Pa. (AP) — PA is reporting… A woman and four children died in a house fire in Pennsylvania, authorities said.",
    "The Walk of Fame website says the money is used to create and install the star, as well as maintain the Walk of Fame.",
    "HARRISBURG, Pa. (AP) — AP is reporting… Mehmet Oz, the celebrity heart surgeon who recently ended his daytime TV “Dr.",
    "Then, in photos that may show up on TV screens in Pennsylvania, Oz knelt down to pose with the star and kiss it.",
    "The show launched in 2009, after Oz rocketed to fame as a regular guest on Oprah Winfrey’s show.",
    "The fire broke out late Thursday night in the ranch-style home on Brook Road in Polk Township.",
    "It aired its last episode Jan. 14, barely seven weeks after Oz announced his candidacy.",
    "Photos from the scene showed extensive fire damage to a section of the home.",
    "LaBarre had worked at East Hills Middle School, the newspaper reported.",
    "Autopsies were pending."
  ]
}