{
  "id": 11552,
  "mediaId": 2716,
  "date": "2022-03-16",
  "headline": "Dr. Mehmet Oz suggests he would give up Senate security clearances to keep Turkish dual citizenship",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1638553534/GettyImages-1341720611.jpg",
  "link": "https://theweek.com/2022-election/1011356/dr-mehmet-oz-suggests-he-would-give-up-senate-security-clearances-to-keep",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Weber",
  "authorUrl": "https://theweek.com/authors/peter-weber",
  "termIds": [
    3925,
    4594,
    2802,
    1433,
    1489,
    52,
    6669,
    6506
  ],
  "sentences": [
    "If Oz ultimately makes it to Congress, Steven Aftergood at the Federation of American Scientists told Politics PA, he \"would expect congressional leaders to reach an understanding with the new, dual citizen member that would authorize classified information sharing under certain ground rules and with some limitations.\"",
    "At the same time, \"never before has our country experienced a senator who has dual citizenship, served in a foreign military, and maintains deep ties to the other nation where he holds citizenship,\" as Oz does, Josh Rogan argues at The Washington Post.",
    "Pennsylvania Republican Senate candidate and TV personality Dr. Mehmet Oz told reporters Tuesday that if elected in November, he would be willing to give up certain security clearances in order to keep his U.S.-Turkish dual citizenship.",
    "At the very least, \"Oz's dual citizenship — and his reluctance to renounce Turkish citizenship — will keep the FBI and security managers up at night,\" American Enterprise Institute senior fellow Michael Rubin tells Rogan.",
    "\"The only qualifications for serving in Congress are age, being a U.S. citizen for at least nine years for the Senate, and living in the state you represent at the time of election.\"",
    "Oz is in a competitive Republican primary race against hedge fund millionaire David McCormick, and the winner will face whoever ends on top in the competitive Democratic primary.",
    "Oz, born in Cleveland to Turkish parents, meets all legal requirements for serving in the Senate, the Brooking Institution's Molly Reynolds told PolitiFact.",
    "Sen. Ted Cruz (R-Texas) renounced his Canadian citizenship in 2014, after he was already serving in the Senate, for example.",
    "Oz again said he keeps his dual citizenship so he can care for his mother, who lives in Turkey and has Alzheimer's disease.",
    "And unlike other federal officials, members of Congress \"do not have security clearances per se,\" Roll Call reports.",
    "\"Rather, members of Congress are by tradition deemed inherently trustworthy by dint of the offices they hold.\"",
    "And Turkish President Recep Tayyip Erdogan \"is notorious for punishing those who cross him.\"",
    "\"I can love my country and love my mom,\" Oz said, according to Politics PA's Steve Ulrich.",
    "Senators aren't even obligated to disclose they have dual citizenship."
  ]
}