{
  "id": 12001,
  "mediaId": 8493,
  "date": "2022-03-25",
  "headline": "PA Headlines: AP Reports on Last Minute Petition Signing for Legislators",
  "image": "https://www.wkok.com/wp-content/uploads/2022/02/Dr-Oz-Star-Hollywood-300x200.jpg",
  "link": "https://www.wkok.com/596337-2/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    0
  ],
  "sentences": [
    "Republicans have a 113-90 majority in the House, although three of those seats are vacant from resignations and will be filled in an April 5 special election: Allegheny County Democratic seats that became open when Rep. Ed Gainey was elected mayor and named Rep. Jake Wheatley a top staffer, and a Luzerne County seat available since Republican Rep. Tarah Toohil won a judicial race.",
    "HARRISBURG, Pa. (AP) — AP is reporting… The White House has removed Dr. Mehmet Oz — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "HARRISBURG, Pa. (AP) — AP is reporting… A scramble to collect enough signatures over just a week and a half to make it onto the primary ballot began over the weekend, kicking off what is certain to be a year of political change in the Pennsylvania Legislature.",
    "“People are afraid they’re signing a fraudulent something-or-the-other.” The launch of petition gathering has been accompanied by a new wave of retirement announcements — at least 22 Republicans and seven Democrats in the House are not seeking another term.",
    "“To be perfectly honest, this is a tough time,” said seven-term Rep. Sheryl Delozier, R-Cumberland, after spending several days knocking on doors in a suburban Harrisburg district that underwent significant changes in reapportionment.",
    "The White House on Wednesday posted two new appointments to the council, while a White House official said Oz and Walker were asked to resign because the White House doesn’t permit candidates for federal office to serve on boards.",
    "The fifth and tie-breaking member of the Legislative Reapportionment Commission was a Democrat chosen by the Democratic-majority state Supreme Court, and population growth has been concentrated in the Democratic southeast.",
    "The justices left in place the May 17 primary date but gave candidates until Monday to get the signatures required to make the ballot — 500 for state Senate and 300 for the House.",
    "“In all reality, it’s because I’ve analyzed every precinct of that district and statistically, I think it’s impossible for a Republican to win there,” Lewis said.",
    "The state Supreme Court cut in half the normal three-week petition-gathering period last week, when the court approved new General Assembly maps.",
    "The letter from the White House Office of Presidential Personnel asked the men to resign Wednesday or be removed by the end of the day.",
    "Rep. Andrew Lewis, a second-term Republican from Dauphin County, got drawn into a district with a fellow Republican, Rep. Sue Helm.",
    "“It’s beyond sad that Joe Biden would politicize such an important issue like health,” Oz said in a video he posted to Twitter.",
    "It’s a large number of departures to hit the 203-member House with a couple of months to go before the first votes are cast.",
    "After several redistricting cycles in which Republicans had control, this year the process was more favorable to Democrats.",
    "Oz said he had no intention of resigning and “if President Biden wants to politicize health, he’ll have to fire me.”",
    "Walker announced his candidacy in Georgia on Aug. 25 and Oz announced his candidacy in Pennsylvania on Nov. 30.",
    "The pandemic and general wariness about disclosing personal information are not making the process any easier.",
    "Oz and Walker — both are Republicans — were appointed by President Joe Biden’s predecessor, Donald Trump.",
    "Five state senators, four Republicans and an independent who caucuses with the GOP, are also bowing out.",
    "Oz quickly went to social media to claim that he was being removed for political reasons.",
    "Neither are seeking reelection in the newly Democratic-leaning district."
  ]
}