{
  "id": 1254,
  "mediaId": 2745,
  "date": "2022-02-17",
  "headline": "The Trailer: In Texas, Republicans battle for room on the right",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KEEB3IEBSII6ZDGIW2LFMS5HSY.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/02/17/trailer-texas-republicans-battle-room-right/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5040,
    5518,
    5078,
    2798,
    1126,
    6579,
    6653,
    6226,
    5965
  ],
  "sentences": [
    "“Radical policies are killing Texans,” she says, promising to use the powers of the AG's office to prosecute crimes and stop the left from weakening any more laws on behalf of “every girl who's been trafficked, every police officer who's been gunned down.”\nAllen West Campaign, “I Am Searching.” The Republican candidate for governor of Texas has run less advertising than his main competitors, but the spots he's running feature West quoting a line often incorrectly attributed to Anglo-Irish philosopher-statesman Edmund Burke: “The only thing necessary for the triumph of evil is for good men to do nothing.” (West is the latest in a long line of politicians to say that and cite Burke.)",
    "Last year, when Brown went missing, Booker called him a “brilliant young scholar.” After the arrest, Booker said in a statement that he hadn't seen Brown since that campaign: “The young man I knew then was working to end violence in our city, not carry it out.”\nBooker didn't get more specific, but Brown's attorney had told the Courier-Journal on Tuesday that the activist was wrestling with undefined “mental and emotional health issues.” Sen. Rand Paul (R-Ky.), whom Booker is challenging, wrote on Facebook that, “as someone who has faced gunfire from a political assassin,” he wished Greenberg well.",
    "The New York Post introduced her as “a champion of ‘defunding’ the police” who'd called cops “soulless.” Another Democrat in the race called her “a Defund the Police extremist.” The state's Democratic Party chair, fresh off disastrous losses in Long Island last year, said Biaggi's record would be a “problem for her in this district.”\nThe anger and angst aimed at Biaggi is rooted in two issues: the implementation of bail reform, which she supported and some in her party have turned against, and several 2020 tweets she sent with the hashtag #defundthepolice.",
    "“If Russia invades Ukraine, do you think the United States should send troops into Ukraine, or not?” (Quinnipiac, 1321 adults)\nSome Republicans, seeing a cynical motive in the standoff between NATO allies and Russia, have speculated that the White House might want conflict to distract from the president's bad poll numbers or — more confusingly — to obtain clandestine information about Hunter Biden.",
    "“Abbott’s primary opponents have run dreadful campaigns, failing to make [him] play defense or even feel the need to acknowledge their existence.”\nAfter the San Antonio event, Abbott pointed out that Texas had passed “constitutional carry,” or the ability to carry a weapon without a permit, when Florida hadn't gotten its act together on it.",
    "In November, state Rep. Ryan Guillen, a Latino from the Rio Grande Valley, crossed the aisle to join the GOP, saying that the Democrats had lost him over the “ideology of defunding the police, of destroying the oil and gas industry, and the chaos at our border.”\nWhen would Democrats know whether any of the GOP's moves were losing voters?",
    "While Republican polling suggests that Abbott is heavily favored to win on March 1, and unlikely to be forced to a runoff, conservatives say that the constant demands on the governor, including the primary challenges, built momentum for bills he had not prioritized at first — and that are now central to his campaign.",
    "Greenberg was not injured, telling reporters after the attack that he and his team had been “blessed.”\nBrown's arrest and release could affect the race for U.S. Senate: Democrat Charles Booker, a former state legislator, has called for an end to cash bail, and had invited Brown to his 2020 campaign launch.",
    "You don't wait until after an election, which is what Ken Paxton did, filing the most frivolous lawsuit in Texas history.”\nTuesday’s recall elections in San Francisco turned into a left-wing rout, with all three members of the city’s school board who were eligible for removal losing by landslide margins.",
    "It's really important that if you are going to be a leader of any level of any government that you show the people you're representing, number one, that you can learn; number two, that you have an open mind; number three, that there's an evolution of your thinking so that you can actually lead better.",
    "Five seconds of me scantily clad on top of a pump jack.”\nGreg Abbott, “Complete and Total Endorsement.” Texas's Republican governor got a mixed-crowd reception when he appeared with Donald Trump last month, but any footage of a GOP candidate with the ex-president is destined for campaign advertising.",
    "O'Rourke, who has abandoned some of the left-wing proposals from his 2020 presidential campaign, said in an interview that he met not just independents but ex-Republicans who weren't fully on board with the Democratic Party, but were alienated by the GOP's continuing moves to the right.",
    "And when it comes to Paxton's best-known decision, to sue to challenge Pennsylvania's electoral votes on the grounds that the state's bipartisan vote-by-mail reform violated the state's Constitution, the challengers say that the incumbent had the right idea and the wrong skill set.",
    "Less than 48 hours after this activist tried to literally murder a politician, the radical left bailed their comrade out of jail.”\nGreenberg condemned it, too, calling the entire criminal justice system “broken” and asking why the alleged shooter was even eligible for bail.",
    "“I am hoping to free the subjects, serfs and those who hope to regain their freedom,” West adds, as he's pictured standing next to Michael Flynn, the ex-national security adviser to Trump who has become a campaigner against Democrats and for decertifying the 2020 election.",
    "Notably, it also suggests that Oz has been too permissive about transgender rights, using a short 2010 clip of Oz asking a young female guest on his show if she remembers “when you thought you were a boy.”\nState Solutions, “Safe.” Ten months ago, New Mexico Gov.",
    "That reform is at the center of this ad by one of the Republican Governors Association's state-specific groups: Here, it's described as the governor “strip[ping] away legal protections for police” and putting that together with the state's rising crime rate.",
    "Club for Growth, “Caras.” The conservative Club for Growth launched English- and Spanish-language versions of an ad that portrays Biden's Supreme Court selection process as discriminatory, because of his promise to appoint a Black woman for the vacancy.",
    "After a year of conservative victories in Austin, from voting restrictions that survived a Democratic walkout to abortion restrictions that activists had demanded for years, Texas's March 1 primaries have found Republicans moving further to the right.",
    "“We have to do better than that!”\nAnd in his TV ads, former state senator Don Huffines (R) has accused Abbott of more conservative sins — tuition for “illegals,” failing to audit the 2020 election and signing away taxpayer funding for LGBT education.",
    "This pro-McCormick spot hits Oz with a number of clips that conservatives have already used to attack him, like an interview in which he made some now-abandoned arguments for abortion rights, and a shot of him dancing on his show with Michelle Obama.",
    "There's a clear, stark difference between that governing style and priority of Ron DeSantis and others as opposed to our governor here in Texas.”\nWest and Huffines haven't accused Abbott of being a closeted liberal; they've pressured him to do more.",
    "As Trailer readers learned last month, the coalition that worked to recall Alison Collins, Gabriela López and Faauuga Moliga was broad, and mostly Democratic, building a 20-to-1 cash advantage as recall opponents struggled to mobilize their voters.",
    "After being ordered to redraw its maps by the state Supreme Court, North Carolina produced state legislative district maps that gave Republicans less of advantage than the current lines, with a three-judge panel deciding their fate next week.",
    "The Recall SF School Board campaign raised nearly $2 million, registered hundreds of voters and worked in particular to turn out Asian voters — citizens and noncitizens who could apply to vote in the recall if they had children in school.",
    "Crime/violence/guns: 36% (+18 since 2019)\nHousing: 14% (-9)\nCoronavirus pandemic: 7% (+7)\nPoverty: 7% (-2)\nThe economy: 7% (+2)\nMayor Muriel Bowser (D), who has led the nation's capital since 2015, has never been unpopular with voters.",
    "“While he was pressured on items like constitutional carry and the transgender sports bill, the voting majority on those issues came together during the special sessions,” said Matt Mackowiak, an Austin-based Republican strategist.",
    "Texans for Eva Guzman, “Won't Rest.” Guzman is trying to oust Attorney General Ken Paxton (R) in the March 1 primary, or to climb into a runoff with him, but she doesn't mention any of her opponents in her statewide advertising.",
    "TT: The congressman who represents this seat right now, Rep. Thomas Suozzi (D-N.Y.), is running for governor and saying he'd remove district attorneys who use their prosecutorial discretion to let violent criminals out of jail.",
    "What do you tell someone who stands up when you're campaigning and says, “I can't vote for you because you did that?”\nAB: Crime has gone up in areas across this country that have passed bail reform and in areas that have not.",
    "And it's the highest that “crime” has rated in this poll since it was conducted, with the current level of voter worry doubling since 2019 and surpassing the 34 percent rating when, amid fairly low crime, Bowser took office.",
    "But the son of former Florida governor Jeb Bush is running a conservative campaign, emphasizing his endorsement from the National Border Patrol Council and running ads that show him riding along the U.S.-Mexico border fence.",
    "Abbott is running not just as a conservative governor, but as the country's most conservative governor, ignoring attacks from West and Huffines that accuse him of doing less to enforce the movement's values than Florida Gov.",
    "I think that as a Democratic Party, we lack an agenda, a holistic approach, a response about how we want to combat gun violence and prioritize public safety that aligns with our values, because we want people to be safe.",
    "Just 27,485 ballots were cast to keep Collins, who never recovered politically from tweets she sent in 2016, suggesting that “Asian Americans” and the “Chinese community” were not speaking out enough for racial justice.",
    "Honor Pennsylvania, “Greatest Hits.” The PAC wars keep escalating between allies of TV personality Mehmet Oz and former Treasury official David McCormick, the two biggest-spending Republicans running for U.S. Senate.",
    "That helped Democrats draw a map, currently being challenged in court, that created more safe blue seats — and stretched the 3rd Congressional District from Long Island to Biaggi's Bronx and Westchester County turf.",
    "Two of these judges, U.S. District Judge Fernando Rodriguez Jr. and Florida Supreme Court Justice Barbara Lagoa, were elevated by Trump, and are not likely to ever appear on a Democratic president's shortlist.",
    "Sarah Stogner, a Republican candidate for Texas railroad commissioner, released a short clip of herself, semi-naked, gyrating on an oil pump, as the wedding reception floor-filler “Apache (Jump on It)” played.",
    "Since the passage last summer of legislation that bans abortions at six weeks of pregnancy, Republicans had lost no ground in special elections, the proving grounds where Democrats in 2017 and 2018 made gains.",
    "The Republican-trending 1st Congressional District, covering the southern tier of the state, got slightly redder; the Democratic-trending 2nd Congressional District outside of Minneapolis grew slightly bluer.",
    "They might just say: “Well, we need something to blame it on.” The reality is that the more that we blame it on something that's not causing it, the less likely we're going to be able to solve this problem.",
    "At a Republican luncheon in Houston, former state party chairman Allen West warned that Abbott was letting the socialists get away with far too much, and said it was time for a conservative to replace him.",
    "In this edition: The race to the right in Texas Republican primaries, the aftermath of San Francisco's school board recalls and gunshots fired at a Kentucky Democrat kick off a debate about bail reform.",
    "Texas doesn't have one.”\nIt's a different mood than the state's last midterm election, when Democrats capitalized on Donald Trump's unpopularity in cities and suburbs and became shockingly competitive.",
    "Alessandra Biaggi: The interesting part of your question is that we're in a Democratic primary, and that's still true — a lot of Democrats have also bought into the fear around criminal justice reform.",
    "So in 2020, I was advocating, and am still advocating, an investment of funds into, like, social welfare programs, into education, into mental health resources, into gun violence prevention programs.",
    "Moliga — who was appointed by San Francisco Mayor London Breed (D), becoming the first Pacific Islander on the school board, and distanced himself from other members — did better, with 35,671 votes.",
    "When asked about the 2020 election in an interview, Bush contrasted Paxton's unsuccessful lawsuit with what lawyers for his “Uncle George” did to prevail in Florida's recount of the 2000 election.",
    "He warns that a set of allegations against the incumbent could make him vulnerable to a Democrat — as Bush puts it, to fulfill Rep. Alexandria Ocasio-Cortez's (D-N.Y.) “prophecy” of a blue Texas.",
    "“He's gone, really, to the very fringe of his party.” Swing voters, he believes, “want to see us get back to supporting public education, creating great jobs, focusing on Medicaid expansion.",
    "“James Baker built an incredible legal team that went into the jurisdictions in question and challenged the legal standard that was applied to counting ballots,” Bush said in an interview.",
    "“This far-left Black Lives Matter activist and defund-the-police cheerleader walked into a Jewish Democrat’s campaign headquarters and opened fire,” McConnell said from the Senate floor.",
    "Gohmert has criticized Paxton for not pursuing other voter fraud allegations earlier; the attorney general's office spent over $2 million last year while closing just three fraud cases.",
    "We can make policing better, just like legislatures can be made better and be more ethical, just like education can be made better and be stronger and have better outcomes for children.",
    "Texas is the conservative leader in America.”\nDemocrats, battling uphill as President Biden's approval ratings sink in Texas, say the GOP is giving them more territory to compete in.",
    "Biden carried the new 3rd District by double digits, but Democrats lost in places just as blue last year, and are now in a round-the-clock panic about being blamed for rising crime.",
    "and former state Supreme Court Justice Eva Guzman, have run as conservatives who'll oppose the left and the Biden administration, but haven't been accused of bribery like Paxton.",
    "The reason I dislike the phrase is because it doesn't define the solution to the problem that we're facing regarding public safety, and it really has scrambled people's brains.",
    "“Texas is turning blue because Abbott is actively funding the spread of Marxist ideology in our schools and our state agencies,” Huffines says in his straight-to-camera spots.",
    "Instead, there's outrage at criminal justice reforms in Democratic-led cities, mockery of the Biden administration and debates about who's best equipped to demolish the left.",
    "“There have been 30 legislators, grass-roots activists, myself, other candidates calling for the governor to enact a fourth special session to get rid of the vaccine mandate.",
    "Support among everybody else is much lower, and there's no education gap, with 31 percent of both college-educated and non-college-educated voters disapproving of the idea.",
    "The judge has the discretion to set the bail, and the judge authorized the discretion to set the bail on the lower end or the higher end, depending upon the circumstances.",
    "Nobody in my family was like: “Okay, now we're all going to talk about why we don't like police officers.” But in my family, what I was taught to do is to tell the truth.",
    "“We've gotten way too soft on crime,” said state Land Commissioner George P. Bush, a candidate for attorney general, at a stop near Texas A&M University on Wednesday.",
    "Some people who say “defund” talk about police abolition; what a lot of Democrats said they meant was redirecting some money from law enforcement to social services.",
    "That was enough for the San Antonio Express-News to pull back its support for Stogner — while the Republican got the first sustained press coverage of her campaign.",
    "“Biden chose radical racial politics over qualified judges,” the ad claims, as photos of five current or former judges, all Latinos, play over mournful piano music.",
    "Michelle Lujan Grisham (D) signed a bill rolling back qualified immunity for police officers, a goal of criminal justice reformers that's gone nowhere federally.",
    "Greg Abbott (R) pledged to keep building the border wall, ban “the teaching of critical race theory in any grade,” and stop Democrats from confiscating guns.",
    "“We're giving kids as young as the age of 8 in the state of Texas puberty blockers, hormonal therapies, even gender transition surgeries,” West said Tuesday.",
    "The attorney general race hasn't seen the same accusations of weak conservatism, because Paxton's opponents don't substantially disagree with his agenda.",
    "“In Georgia and Florida, they called for a special session to tackle the issue of vaccine mandates, and they passed the law,” West said in an interview.",
    "The Trailer: When you were getting into this race, how much did you expect bail reform and the rhetoric from the 2020 protests to be used against you?",
    "Let's try to get to show that we care about this child.” If I had the ability to transform a prosecutor's mind, compassion is really what I hope for.",
    "Greenberg identified the alleged shooter as Quintez Brown, a Black Lives Matter activist who would be charged later that day and detained by police.",
    "On Monday morning, Louisville mayoral candidate Craig Greenberg, a Democrat, was shot at by a man who fired a gun inside his campaign headquarters.",
    "Texas, not Florida, had passed the country's sharpest abortion restrictions, and the state had defended them before the conservative Supreme Court.",
    "House Republicans have begun to speculate about removing D.C.'s home rule powers, on the grounds that they don't think the city can manage itself.",
    "In addition to the cost of gun violence, which is the most direct cause, any more delay in getting to the root cause actually costs us more lives.",
    "“It is nearly impossible to believe that someone can attempt murder on Monday and walk out of jail on Wednesday,” Greenberg said in a statement.",
    "These are the common things that bring us together at a very divided moment.”\nBut Democrats had hoped for a backlash to be underway by now.",
    "Bush is challenging Attorney General Ken Paxton (R), who bested a more moderate Republican to win the job eight years ago, from the right.",
    "I'm talking about people who responded with more aggression and more violence — they weren't able to allow their humanity to come through.",
    "I am not ashamed of using that phrase, because that was what the world was experiencing emotionally at that time and, frankly, still is.",
    "I think that it's important to note that this is a coordinated campaign of fear by the Republican Party, and we should not fall for it.",
    "I have to go into spaces not being afraid to dismantle this false choice between improving policing and also increasing public safety.",
    "While 62 percent of adults say Russia “poses a military threat to the United States,” just a fraction want an intervention in Ukraine.",
    "And within 48 hours, the Louisville Community Bail Fund had paid the $100,000 bond and gotten Brown released into home incarceration.",
    "While he did slightly better in majority-Asian precincts than his colleagues, he did not have enough support to remain on the board.",
    "In 2018, she ousted a fellow Democrat who had caucused with Republicans and kept liberals locked out of power in the state Senate.",
    "Democrats are the most hawkish demographic, relatively speaking, with 42 percent of them willing to support a military response.",
    "“Please tell me how I am supposed to get the media’s attention so I can discuss these important issues,” she told Texas Monthly.",
    "Not many candidates release campaign ads on TikTok, and until this week, none had lost an endorsement over what they'd posted.",
    "(The way she phrased it, with a reference to a Malcolm X speech about the “house Negro,” led to demands for her resignation.",
    "TT: The criticism is that crime is spiking because of bail reform — Democrats passed it, and they let criminals out of jail.",
    "I'm also not ashamed of having an evolution of thought, which a lot of people in public office seem to have a problem with.",
    "Many voters were furious about the board’s attempt to end merit-based admission in the district’s best-testing high school.",
    "There's no fear that Democrats might use that against them, and few worries about former congressman Beto O'Rourke (D-Tex.)",
    "“Attempted murder on Monday, go home on Wednesday,” tweeted Anthony Piagentini, a Republican member of the city council.",
    "We should actually make sure that police are doing the job that they are intended to do, like solving violent crimes.",
    "“If someone is struggling with a mental illness and is in custody, they should be evaluated and treated in custody.",
    "And on Thursday morning, Senate Minority Leader Mitch McConnell (R-Ky.) condemned the attack and the bail payment.",
    "It's been so politicized and so many people believe that it is solely about cutting funds to police departments.",
    "“It seems like the craziest idea that any of his opponents come up with, he adopts as his own,” O'Rourke said.",
    "Last year in New York, around 30 percent of shootings were resolved, and only 40 percent of rapes resolved.",
    "If they're sitting in jail for years, what we're doing is causing more harm than stealing with a backpack.",
    "In Minnesota, a five-judge panel approved new maps that make few changes to the maps created a decade ago.",
    "That horrific video that we watched during 2020 was something that I think traumatized an entire country.",
    "“Obviously, every aspect of this is still under investigation, including the suspect’s mental condition.",
    "Trump's voice is the only one in the commercial, and every image in it shows Trump and Abbott together.",
    "This is the first poll of her tenure where satisfaction with how things are going is under 50 percent.",
    "”\nOver her brief political career, New York state Sen. Alessandra Biaggi has surfed Democratic waves.",
    "The more that we allow this fear to take a life of its own, the more lives that are going to be lost.",
    "“I don't think there's an answer,” said O'Rourke, “until you get to Nov. 8,” the day of the election.",
    "It means addressing things like our homelessness crisis, expanding access to mental health services.",
    "We watched a lot of police across the country, of course, respond with more aggression and violence.",
    "I'm not saying anything revolutionary here: They shouldn't be responding to a mental health crisis.",
    "Maybe we can focus on Manhattan District Attorney Alvin Bragg's memo on what he wouldn't prosecute.",
    "With most ballots counted, at least 72 percent of voters opted to recall at least one board member.",
    "(The elder Bush, running for president in 2016, had called Trump's border wall plans unworkable.)",
    "SAN ANTONIO — At Chris Madrid's, a burger bar with a patio full of Republican voters, Texas Gov.",
    "In 2020, Democratic victories across New York put her in the party's first modern supermajority.",
    "If the harm being caused is greater than the action that was taken, then we're causing trauma.",
    "But even the organizers did not predict how little support was left for the three incumbents.",
    "I would hope a prosecutor would look at a young teenager and say, “Hmm, he stole a backpack.",
    "The New York Post exists; it's been their focus since the moment you announced for the seat.",
    "(Last summer, Paxton’s office cleared him of bribery allegations made by former staffers.)",
    "That was so disappointing and it was so — it was such a moment where we lost the thread.",
    "But there's no political upside to the Ukraine crisis or the administration's position.",
    "Getting to the root causes of violence means addressing things like income inequality.",
    "And I really think at the end of the day that the reason for that is because of fear.",
    "Don't you, the person at home reading this, want your child to have the best future?",
    "Even though there were police officers who did speak up about how terrible that was.",
    "What was happening to people was: If I have the means to post bail, I will go home.",
    "And this coordinated campaign by the Republicans is actually costing us more lives.",
    "Stealing a backpack and sitting in jail for three years waiting for your trial?",
    "We're asking police to respond to things that they should not be responding to.",
    "Biaggi talked to The Trailer about her votes, her tweets and the crime issue.",
    "They protested for Black lives, and they protested against police brutality.",
    "Instead, a group of Republicans, including Bush, Rep. Louie Gohmert (R-Tex.)",
    "Other Republicans focused on how Brown was able to get released so quickly.",
    "It means increasing access to education and having after-school programs.",
    "I don't think that there's a person on Earth that could really disagree.",
    "So, to blame every single criminal outcome or crime on bail is not true.",
    "Others were frustrated that it took so long to reopen schools last year.",
    "This is also just about flight risk, and we just don't talk about that.",
    "And Americans responded to that horrific murder by doing a few things.",
    "He was the most decorated police officer in NYPD history, at one time.",
    "… I think that, unfortunately, the phrase doesn't fully capture that.",
    "A left-wing bail fund partnered with BLM Louisville to bail him out.",
    "“A hundred babies are being saved every single day,” Abbott said.",
    "Are we talking about nonviolent crimes, that are being alleged?",
    "Will this person return to court when their day in court comes?",
    "AB: Using that phrase, at that time, was an act of solidarity.",
    "The world watched a man, George Floyd, get murdered by police.",
    "Let me actually back up one step: We're talking about bail.",
    "We are not going to fall for the frame of — this is taboo.",
    "On Feb. 7, Biaggi entered the race for that new district.",
    "That's the conversation we don't get to have in public.",
    "That is what we are saying, that at the end of the day.",
    "TT: Let's finish on the “defund the police” question.",
    "And I'm going to go on a limb here, on that question.",
    "He was shot and stabbed 10 times in the line of duty.",
    "And so people may not care whether it's true or not.",
    "But guess what: He’s already been let out of jail.",
    "This is an edited transcript of the conversation.",
    "And you can still set bail for violent felonies.",
    "I would go back to the Kalief Browder example.",
    "When you said that in 2020, what did you mean?",
    "We are not talking about convictions of crime.",
    "That means that my family can still be fed.",
    "We are talking about allegations of crime.",
    "We're actually destroying a person's life.",
    "“We need a law enforcement bill of rights.",
    "She apologized but remained on the board.)",
    "My grandpa was literally a police officer.",
    "Don't we want to invest in our community?",
    "Literally, that is the purpose of bail.",
    "It means that my life is not upended.",
    "I'll be 100 percent honest with you.",
    "What are we actually responding to?",
    "Most people don't represent a jail.",
    "Who doesn't want people to be safe?",
    "Are we talking about misdemeanors?",
    "That's an important distinction.",
    "I think that's what we all want.",
    "“That does not exist in Florida.",
    "We need that to be 100 percent.",
    "Where do you disagree with him?",
    "AB: I represent Rikers Island.",
    "It depends what the facts are.",
    "Are we talking about stealing?",
    "But if I can't post that bail?",
    "rebuilding his 2018 coalition.",
    "And guess what finally worked?",
    "That means I can keep my job.",
    "Let's try to figure out why.",
    "TT: Do you regret saying it?",
    "Because here's the reality.",
    "It's fundamentally untrue.",
    "The rise in violent crime.",
    "AB: Think back to 2020.",
    "That's all it's about.",
    "“That's how you do it.",
    "We lost our humanity.",
    "That's the problem.",
    "He has not done so.",
    "“I’ve been trying.",
    "What did you mean?",
    "How do we stop it?",
    "That is the cost.",
    "Ron DeSantis (R).",
    "For years.",
    "Kentucky."
  ]
}