{
  "id": 12701,
  "mediaId": 2570,
  "date": "2022-02-28",
  "headline": "Dr. Oz Challenged Dr. Fauci To A Debate, Here’s How Others Responded",
  "image": "",
  "link": "https://www.forbes.com/sites/brucelee/2022/02/28/dr-oz-challenged-dr-fauci-to-a-debate-heres-how-others-responded/?sh=1d24045355ef",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bruce Y. Lee",
  "authorUrl": "https://www.forbes.com/sites/brucelee/",
  "termIds": [
    0
  ],
  "sentences": [
    "Oz did this not once, on January 13, but twice, repeating the challenge on February 26:\nOz’s first challenge to Fauci prompted what was essentially a “hey, what about me” response from Kathy Barnette, a Republican who’s actually competing for the same seat as Oz:\nIt certainly would make sense for Oz to debate Barnette.",
    "And Led Zeppelin guitarist Jimmy Page must be “Dazed and Confused” to not want in on this proposed guitar duel:\nAs you can see, Joe, who clearly has a lot of thoughts, stated in the tweet reply above that All-Star forward Lebron James used the whole “middle of season” excuse to not partake in the challenge.",
    "It would kind of like Fauci claiming that he is too busy dealing with the ongoing public health emergency that’s killed over 947,000 people in the U.S. already to engage in such a challenge:\nSo, naturally, fear would be the only reason why anyone would fail to accept a challenge, right?",
    "That’s why the best way to discuss Covid-19 policies and precautions would be in a scientific forum, moderated by scientists where participants are required to cite real peer-reviewed scientific studies to support whatever claims they make.",
    "Anyone who saw the Presidential debates from 2020, otherwise known as dumpster fires, as I described them for Forbes, will realize that these days many political debates are not about discussing the facts or offering hard evidence.",
    "You’d think both Kansas City Chiefs quarterback Patrick Mahomes and celebrity chef Gordon Ramsay would have the balls to engage in these proposed contests:\nUltimately, it’s not clear what would be gained from an Oz-Fauci debate.",
    "For example:\nJust because you drop a challenge to someone, doesn’t mean that you’ll get a “challenge excepted.” Maybe that works when being challenged to put Tide Pods in your mouth, which, by the way, you shouldn’t do.",
    "As you can see, Oz followed up on February 26 with a “still haven’t heard a thing from him…” While not everyone may have a Valentine, Dr. Oz doesn’t seem to have a shortage of people willing to debate him.",
    "For example, what could possibly be keeping tennis star Serena Williams and star quarterback Tom Brady, who should have much more time now that he’s retired, from responding to the following:\nShocking.",
    "The only thing worse than being forgotten on Valentine’s Day is to have someone wish everyone else in the world a Happy Valentine’s Day and specifically tell you that you are not included.",
    "For example, when Donald Trump was running for President of the United States, he debated Joe Biden and not reality TV star Snooki even though Trump himself was a reality TV star.",
    "Since Oz didn’t specify any boundaries on who should debate debate whom, others who aren’t medical doctors and aren’t running for political office laid down the gauntlet as well.",
    "Throughout the pandemic, the scientific community has continued to conduct more and more studies to generate more and more evidence to guide Covid-19-related decision making.",
    "While trying to respond to the needs of the public, one of the biggest challenges has been politicians getting in the way and not listening to scientists and science.",
    "Therefore, here’s a challenge if you are in a political office or running for such an office: how willing are you to listen to real science and scientists?",
    "Otherwise, more often than naught, such challenges will go unaccepted, especially when the other person is, once again, not running for the same position.",
    "Real scientists have been working tirelessly, having to put up with the seemingly endless tidal wave of misinformation and anti-science rhetoric.",
    "For example, here’s what pediatric infectious disease specialist Alastair McAlpine, MD, tweeted:\nWho would be up for a McAlpine- Oz debate?",
    "Deciding how best to respond to the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is not like politics.",
    "Perhaps in an effort to comfort Oz, others responded to Oz’s challenge with their own tales of unheeded challenges.",
    "Mehmet Oz, MD, has been campaigning as a Republican candidate for one of Pennsylvania’s two U.S. Senate seats.",
    "Fauci is currently the Director of the National Institutes of Allergy and Infectious Diseases (NIAID).",
    "Let’s assume that this were true, (which must be the case since someone said it on Twitter, right?)",
    "Seems like that un-Valentine’s Day wish didn’t get Fauci to respond to Oz’s january 13 challenge.",
    "After all, typically, in a political race, you debate your opponents rather than someone else.",
    "Or perhaps you’ll always get a reply from someone named Barney Stinson.",
    "Instead, they descend into issuing sound bites and personal attacks.",
    "It could be dubbed the “M-O” debate, as in who wants “mo” debate?",
    "On Valentine’s Day, he even wrote a poem that included Fauci.",
    "Others on the Twittersphere did respond to Oz’s challenge.",
    "Nevertheless, it looks like Oz has got Fauci on his mind.",
    "Yet, Oz has for some reason challenged Fauci to a debate.",
    "Anthony Fauci, MD, is not running for this same position.",
    "It would then be a pretty weak excuse.",
    "Or, rather, excluded Fauci:\nOuch.",
    "At least, it shouldn’t be."
  ]
}