{
  "id": 12974,
  "mediaId": 2548,
  "date": "2022-03-04",
  "headline": "Dr. Oz’s Ties To Pharma, Tech Complicate Anti-Corporate Campaign Claims",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/03/oz-e1646438028748.jpg",
  "link": "https://dailycaller.com/2022/03/04/dr-oz-pennsylvania-david-mccormick-republican-senate/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ailan Evans",
  "authorUrl": "https://dailycaller.com/author/Ailan+Evans",
  "termIds": [
    0
  ],
  "sentences": [
    "Oz has also billed himself as an opponent of China, criticizing McMormick’s ties to China in a campaign ad which calls the hedge fund manager “China’s friend, not ours.”\nThe celebrity doctor has himself frequently done business in China; in addition to his financial relationship with Usana, Oz has also promoted major Chinese technology companies including Weibo and WeChat, and distributed his show on Chinese entertainment platforms.",
    "“While Mehmet has been silent on China until he needed to knock down Dave’s credentials, Dave was serving our country in combat and the highest levels of government and standing up to the CCP.”\n“Oz spent his entire career cozying up to the Hollywood elite, China and big corporations and his track record on important conservative issues makes it clear that Mehmet Oz fights for Mehmet Oz – not for Pennsylvania,” she added.",
    "(RELATED: Democrat-Linked Group Pushes Ads Hitting Republican Candidate For Not Being Endorsed By The NRA)\nOz Media, the production company behind The Dr. Oz Show, reportedly had deals with pharmaceutical giants Bayer, Novartis and Aventis, according to a screenshot of corporate clients obtained by The Huffington Post.",
    "Oz’s campaign spokeswoman Brittany Yanick pushed back on the implication that the candidate’s work with major technology and pharmaceutical companies undercut his campaign rhetoric, pointing to primary opponent and hedge fund manager David McMormick’s relationship with Chinese business interests.",
    "The celebrity doctor has frequently done business in China; in addition to his financial relationship with Usana Health Services, Oz has also promoted major Chinese technology companies including Weibo and WeChat, and distributed his show on Chinese entertainment platforms.",
    "“Unlike David McCormick, Dr. Oz has taken on big pharma, agrochem, big tech, and the government on many occasions throughout his career, and he will take those experiences to fight for Pennsylvanians in the U.S. Senate,” she added.",
    "The celebrity doctor has made opposition to major technology and pharmaceutical companies a hallmark of his campaign, pitching his experience working in television and exposing scams as an example of his anti-corporate positions.",
    "Show your support and get your Dr. OZ merch here.”\nYet while Oz’s messaging has frequently invoked his opposition to Big Tech and Big Pharma, the celebrity doctor has been linked to major technology and pharmaceutical companies.",
    "“Beijing’s favorite candidate David McCormick outsourced PA jobs to Asia, he made millions investing in China in partnership with the CCP, and he gave speeches in China about his desire for China to succeed,” Yannick said.",
    "The Dr. Oz Show also had a lucrative sponsorship deal with wellness company Usana Health Services, which reportedly netted the show earnings in the tens of millions, according to a review of public records by Politico.",
    "While Republican Pennsylvania Senate candidate Dr. Mehmet Oz has billed himself as a staunch opponent of big corporations, his ties to major technology and pharmaceutical corporations complicate his campaign rhetoric.",
    "While Republican Pennsylvania Senate candidate Dr. Mehmet Oz has billed himself as a staunch opponent of big corporations, his ties to major technology and pharmaceutical corporations complicate his campaign rhetoric.",
    "The comments echo previous remarks made in tweets and merchandising efforts, with Oz promoting his campaign through a tweet that read: “Want a Senator who will stand up to the Washington establishment and Big Tech?",
    "Oz Media, the production company behind The Dr. Oz Show, reportedly had deals with pharmaceutical giants Bayer, Novartis and Aventis, according to a screenshot of corporate clients obtained by The Huffington Post.",
    "“Mehmet Oz – citizen of Turkey, creature of Hollywood – has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,” Szymanski said.",
    "“I’ve taken on Big Government, Big Tech, Big Pharma, Big Ag chemical companies on the show 13 years running, being a porcupine when I needed to be,” Oz said in an interview last week with Newsmax.",
    "“I’ve taken on Big Government, Big Tech, Big Pharma, Big Ag chemical companies on the show 13 years running, being a porcupine when I needed to be,” Oz said in an interview Saturday with Newsmax.",
    "The deals were arranged through tech and entertainment giant Sony and involved integrating the Novartis and Bayer brands into The Dr. Oz Show, according to a person familiar with the matter.",
    "“Aofei Media will be distributing new episodes of my show beginning 12/25 on digital platforms including Youku, Tencent Penguin, iQiyi, Sohu Video & Sina Weibo,” Oz wrote.",
    "“Tune in!”\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "Oz, who announced his candidacy in late November, is running for the empty Senate seat left by retiring Republican Pennsylvania Sen. Pat Toomey.",
    "Oz also earned $1.5 million from pharmaceutical sponsorships in five months between 2013 and 2014, according to a ProPublica review.",
    "Usana primarily sells its products in China, according to a filing with the Securities and Exchange Commission (SEC).",
    "McCormick campaign spokeswoman Jess Szymanski dismissed the Oz campaign’s allegations in a statement to the DCNF.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "According to a 2018 tweet, Oz had launched WeChat and Weibo accounts.",
    "Oz himself was never directly paid by the pharmaceutical companies."
  ]
}