{
  "id": 17636,
  "mediaId": 8412,
  "date": "2022-03-02",
  "headline": "The path back to US energy dominance, economic ‘renewal’: Ex-CEO of world’s largest hedge fund",
  "image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/10/0/0/joe-biden-oil-field-1-AP-istock.jpg?ve=1&tl=1",
  "link": "https://www.foxbusiness.com/economy/path-back-to-energy-dominance-economic-renewal-david-mccormick",
  "mediaOutlet": "Pocono News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristen Altus",
  "authorUrl": "https://www.foxbusiness.com/person/a/kristen-altus",
  "termIds": [
    0
  ],
  "sentences": [
    "\"In one year, [Biden's energy policy] took us from being an energy exporter to an energy importer,\" the ex-CEO said, \"and took us off the path of energy dominance that America was on and Pennsylvania was on.\"",
    "McCormick further asserted that inflation is driven by Biden’s regulations causing high oil and gas prices, and urged that the administration work to reverse anti-American energy legislation.",
    "U.S. Senate Republican candidate for Pennsylvania and former Bridgewater Associates CEO David McCormick detailed the path for U.S. energy independence on \"Mornings with Maria\" Wednesday.",
    "Reversing President Biden’s energy policies could be the key to unlocking America’s sector and solving record-high oil prices, according to the ex-CEO of the world’s largest hedge fund.",
    "ENERGY EXPERT WARNS OIL PRICES COULD GET EVEN HIGHER\n\"We need to streamline the pipeline permitting process, which is one of the big constraints in Pennsylvania,\" McCormick said.",
    "Bringing back energy \"dominance\" is a leading issue for McCormick, who’s battling for the Pennsylvania Senate seat against leading contender, television’s popular Dr. Mehmet Oz.",
    "\"Ironically, Biden's policies have been terrible for the environment because they've really curtailed the development of our natural resources here in the United States.\"",
    "McCormick’s comments come as global oil prices surged over $110 per barrel Wednesday while Russian forces continue attacks on Ukraine.",
    "The U.S. Senate candidate put the blame for record-high prices on Biden and his ban against domestic drilling on federal land.",
    "As the nation’s second-largest natural gas producer, McCormick pointed out there is \"untapped potential\" across Pennsylvania.",
    "\"The regulatory blanket and the uncertainty has stopped capital investment,\" McCormick told FOX Business’ Maria Bartiromo.",
    "\"As a matter of economic renewal, but also as a matter of national security, we need to really unlock our energy sector.\"",
    "\"Energy will unlock the Pennsylvania economy and unlock the national economy,\" McCormick noted.",
    "\"That would be a huge boon for our economy and a huge boon for Pennsylvania,\" he explained.",
    "McCormick pleaded for Biden to present meaningful solutions to the inflation crisis.",
    "\"It's the cleanest natural gas in the world,\" he said.",
    "\"We need to pull back on the regulatory blanket.\""
  ]
}