{
  "id": 1999,
  "mediaId": 2732,
  "date": "2022-02-07",
  "headline": "Editorial: Constables have to follow law to enforce it",
  "image": "",
  "link": "https://triblive.com/opinion/editorial-constables-have-to-follow-law-to-enforce-it/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1964,
    6506,
    6458,
    6434,
    6366,
    5956,
    6720
  ],
  "sentences": [
    "Maybe this doesn’t seem like a big deal when talk show host Dr. Mehmet Oz, a longtime New Jersey resident, is running for Pennsylvania’s U.S. Senate seat after changing his address to his in-laws’ Philly-area home, per the Philadelphia Inquirer, but it does matter.",
    "“As with previous matters handled by this office, these investigations were prompted by outside complaints and investigated by the county detectives.”\nDemocrat Daniel Goodson, 48, of New Kensington won his seat in November by 54 votes over Republican Ron Balla.",
    "There were times that multiple leaders in the department were charged with crimes or on suspension or both all at the same time, not the least of which was the guy elected to do the job, Jonathan Held.",
    "“The need to file such actions is rarely presented, and the filing of these complaints does not represent a new investigative focus for my office,” Ziccarelli said in a statement released Wednesday.",
    "The offices are not always filled, and if you look at the bottom of your ballot in a municipal election year, you may very well see an empty slot where no one is running for the job.",
    "The former sheriff is still scheduled for trial in March on three felony counts of restricted activities-conflict of interest and one misdemeanor count of diversion of services.",
    "Ziccarelli’s suit says he can’t serve in that position because of a felony history dating to 1997 in not only Pennsylvania but Maryland and in federal court as well.",
    "But now newly installed Westmoreland County District Attorney Nicole Ziccarelli is taking aim at two constables who she says don’t qualify for their jobs.",
    "Sworn law enforcement officers, they are able to make arrests or serve warrants but are not part of a police department or sheriff’s office.",
    "Another Democrat, Walter Geiger, 61, was reelected by write-in votes to his position as constable in Arona.",
    "The problem there is that Ziccarelli said he no longer lives in Arona but in North Huntingdon instead.",
    "Why does Westmoreland County have so much trouble with the people enforcing the rules playing by them?",
    "It matters for any officeholder to follow the rules, but especially for one enforcing the law.",
    "Constables are the often forgotten officers of Pennsylvania’s court system.",
    "For years, it was the sheriff’s office that was the problem.",
    "Instead, they are elected by voters in a municipality.",
    "Categories: Editorials | Opinion",
    "Now it’s constables."
  ]
}