{
  "id": 2685,
  "mediaId": 2572,
  "date": "2022-01-30",
  "headline": "Dr. Oz rushes to help unconscious man at Pennsylvania GOP event: 'It's my calling'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Dr.-Oz-Pennsylvania-Senate-Race.jpg",
  "link": "https://www.foxnews.com/politics/dr-mehmet-oz-seizure-unconscious-man-pennsylvania-republican-event",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2802,
    1126,
    1131,
    6506
  ],
  "sentences": [
    "Oz, who is running as a Republican for Senate in Pennsylvania, was slated to deliver a speech at the Pennsylvania Republican Caucus meeting Saturday morning near Pittsburgh when an unidentified committee member with the caucus called for a doctor and reportedly had a seizure and lost consciousness.",
    "\"I'm a doctor, it's my calling, I'll always be a doctor, and whether I go into politics or any other profession, I'll always be a physician,\" said Oz, according to Fox 56.",
    "DR. OZ CHALLENGES 'PETTY TYRANT' FAUCI TO A DEBATE IN 'KILMEADE SHOW' INTERVIEW\nThe man was taken to a hospital and Oz ultimately delivered his speech on Saturday.",
    "Oz announced his Senate run in November, and Pictures Television later confirmed that it was retiring his long-running show, \"The Dr. Oz Show.\"",
    "Dr. Mehmet Oz aided a man who called out for a doctor and then collapsed at a Pennsylvania Republican event this weekend.",
    "Are they breathing, that's the B, and then C is their circulation, is their blood flowing,\" Oz said, Fox 56 reported.",
    "Oz, a cardiothoracic surgeon, was able to stabilize the man until emergency medical personnel arrived on the scene.",
    "\"I'm optimistic that we'll find out what's happening and be able to address it expeditiously,\" said Oz.",
    "\"I started practicing the ABCs, and it's a bit of a teachable moment.",
    "He says he's doing okay, and I'll keep checking up on him,\" said Oz.",
    "So, the first thing you do is check the airway, that's the A.",
    "\"Once he got to the emergency room, he got stabilized.",
    "Oz said he will keep checking in on the man."
  ]
}