{
  "id": 2742,
  "mediaId": 2641,
  "date": "2022-02-03",
  "headline": "Dr. Oz to Newsmax: 'Pennsylvania Deserves a Big Voice, a Strong Voice'",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=594f6250-4648-4ee2-a208-9a8543a473e1&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/dr-mehmet-oz-senate-gop-primary/2022/02/03/id/1055443/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Mack",
  "authorUrl": "",
  "termIds": [
    5734,
    3217,
    2802,
    392,
    1126,
    910,
    1215,
    6506,
    6276,
    6709
  ],
  "sentences": [
    "Hailing his name recognition, media chops, and medical background to take it to the failed health advisers in Washington, D.C., Dr. Mehmet Oz told Newsmax he is the Pennsylvania Senate GOP primary candidate who can beat the Democrat in the general election next November.",
    "\"And I was going to stand up to them even if they intimidated me and tried to use the media against me, which, by the way, Fauci did numerous times during COVID to silence dissent, which is, again, what Republicans have been tolerant of, but we can't anymore.",
    "\"I have the best chance of beating the Democrats in the fall because I will bring together a coalition of independents and conservative Democrats who come along with all the Republicans who know what's going on,\" he added to host Sean Spicer.",
    "As a heart doctor and television host, Oz boasts having taken on Big Pharma, Big Tech, and Big Government most recently challenging Dr. Anthony Fauci and the health experts in Washington, D.C.\n\"I even fought the U.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nRelated Stories:",
    "\"President [Donald] Trump put me on the President's Council for Sports, Fitness & Nutrition for a reason, because he knew I could make noise and Pennsylvania deserves a big voice, a strong voice.\"",
    "\"We were taught not to be treated like mushrooms: Don't sit in the dark and be fed manure all day long, and that's what Republicans have tolerated over the past few years.\"",
    "While he has a national medical, media, and now political cachet, Oz also stressed he has the true values of a man from Pennsylvania.",
    "\"People know who I am,\" Oz told Thursday's \"Spicer & Co.\" \"I've been in your living room every day for 13 years.",
    "\"I grew up near Kennett Square, Pennsylvania, which is the mushroom capital of the world,\" he said.",
    "S government because they were doing things that I thought were reprehensible,\" he continued.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "And when you fight on that stage, you learn how to take your lumps.",
    "\"Sean, I fought these battles, I've got scars to prove it.",
    "And I think it could be that bold, loud voice.",
    "You also know what it takes to actually win.",
    "You understand how to deal with the media.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "I've got a big megaphone.",
    "349, Dish Network Ch.",
    "I cannot be bought.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}