{
  "id": 2960,
  "mediaId": 2660,
  "date": "2022-02-03",
  "headline": "No, Dr. Phil and these celebrities are not endorsing CBD gummies",
  "image": "https://static.politifact.com/politifact/rulings/meter-false.jpg",
  "link": "https://www.politifact.com/factchecks/2022/feb/03/blog-posting/no-these-celebrities-arent-endorsing-cbd-gummies/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ciara O'Rourke",
  "authorUrl": "https://www.politifact.com/staff/ciara-orourke/",
  "termIds": [
    2058,
    1921,
    5629,
    2910,
    3779,
    5023
  ],
  "sentences": [
    "Before you go out and buy CBD gummies that purportedly help to treat diabetes or to quit smoking, please know that these people are not endorsing or selling them: Baptist pastor Charles Stanley, TV evangelists Joel Olsteen and Pat Robertson, former Shark Tank contestants Donna and Rosy Khalife, neurosurgeon and CNN medical correspondent Dr. Sanjay Gupta, actor Kevin Costner, and celebrity surgeon and Senate candidate Dr. Mehmet Oz.",
    "If you click on the post’s link, which has a picture of Dr. Phil standing in front of a gummy bears with the words \"bye bye dementia…\" written above, it brings you to what looks like a news article with this headline: \"Dr. Phil & Dr. Oz discuss how Martha Stewart’s 20 second ritual for restoring forgotten memories has gone viral.\"",
    "A Jan. 31 Facebook post suggesting that Dr. Phil McGraw was endorsing CBD gummies to fight dementia has inspired us to set the record straight about posts you might see on social media touting a celebrity-backed CBD gummy product: those posts are scams, including the one about Dr. Phil.",
    "We’ve fact-checked claims about all of these people — blog posts that look like news articles that are actually advertisements falsely claiming celebrity endorsements — and yet the cannabidiol misinformation continues to spread online.",
    "However, in February 2021 both he and Dr. Oz appeared on TMZ Live to warn people not to fall for scams using their names to sell CBD and that they don’t endorse CBD products.",
    "However, previous posts that we have debunked have falsely claimed that Eagle Hemp Gummies CBD were created by the Shark Tank contestants, Costner, and Gupta.",
    "Oz told TMZ Live that he tested some of the products sold online that falsely claim to have his endorsement and that a lab testing showed high lead levels.",
    "The Jan. 31 post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed.",
    "The story goes on to say that \"the breakthrough product Martha produced is called Eagle Hemp Gummies CBD.\"",
    "We rate claims that celebrities are creating, selling or endorsing this product False.",
    "We reached out to the Dr. Phil show and didn’t immediately hear back.",
    "(Read more about our partnership with Facebook.)",
    "Buyer beware."
  ]
}