{
  "id": 3955,
  "mediaId": 2889,
  "date": "2022-01-18",
  "headline": "Limitless X Founder and CEO Jas Mathur Teams Up With HealthCorps for Partnership to Empower Youth",
  "image": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2022/01/Jas-mathur01.jpeg?crop=0px%2C159px%2C1440px%2C756px&resize=1200%2C630&ssl=1&quality=86&strip=all",
  "link": "https://www.usmagazine.com/celebrity-body/news/limitless-x-founder-jas-mathur-teams-up-with-healthcorps/",
  "mediaOutlet": "US Weekly",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Us Weekly Staff",
  "authorUrl": "https://www.usmagazine.com/author/us-weekly-staff/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I feel I’ve done that in my life and I want to help them be able to accomplish the same along their own personal health journeys.”\nListen to Us Weekly's Hot Hollywood as each week the editors of Us break down the hottest entertainment news stories!",
    "“I basically reinvented myself by reinventing my mindset.”\nAs a result of that transformation, he has become a successful investor and entrepreneur who has developed various brands across the marketing and health and wellness industries.",
    "As part that announcement, Mathur spoke with HealthCorps founder and Chair Emeritus Dr. Mehmet Oz to reflect on his own personal health journey, which is one of the reasons why he was so interested in partnering with HealthCorps.",
    "In telling the story of his reinvention as a health and wellness expert from a teen tech mogul, Jas explained why he’s an advocate for HealthCorps mission and why he is looking forward to working with them on key initiatives.",
    "Entrepreneur and Limitless X founder and CEO Jas Mathur announced this week that he is teaming up with nonprofit organization HealthCorps to jumpstart health and wellness programs that are targeted at teens and young adults.",
    "“I’m excited to support HealthCorps as they help others who find themselves stuck in bad health choices or who don’t have access to good nutrition or training programs to get that same opportunity,” Mathur said.",
    "It is truly limitless, if you see the world that way.”\nMathur, in telling his story noted that he had to completely overhaul his life and outlook to get there.",
    "The nonprofit organization is committed to saving lives with health-based educational leadership, programming and service learning in at-risk communities.",
    "Mathur has also become an expert in developing fitness and training programs, and has helped celebrities with their own personal health journeys.",
    "Mathur’s wellness journey is what helped him become a leader in the health industry and, in turn, get the chance to work alongside HealthCorps.",
    "After turning his health around, he started running multiple health and wellness businesses and became a sought after fitness expert.",
    "Now, Mathur’s marketing and branding firm, Limitless, is responsible for launching top dietary and CBD supplement products.",
    "“You figured out the challenges, you got through them, and you continued to expand your horizons,” he said.",
    "Their initiatives are launched both in and out of school settings to help teens improve their health.",
    "“What’s often limitless is when you look at the horizon, at the vista of opportunities out there.",
    "As a young adult, Mathur sacrificed his personal health and, at one point, weighed 450 pounds.",
    "During this process, he also built a massive platform with seven million Instagram followers.",
    "For access to all our exclusive celebrity videos and interviews – Subscribe on YouTube!",
    "“HealthCorps helps young people achieve their goals and dreams,” Mathur said.",
    "During their discussion, Dr. Oz praised Mathur for his “limitless” journey.",
    "As a teen, Mathur specialized in internet advertising and website creation.",
    "So, teaming up with HealthCorps to share his expertise was a no-brainer."
  ]
}