{
  "id": 4706,
  "mediaId": 8489,
  "date": "2022-04-21",
  "headline": "Wilmington prep school leader charged with child porn 8 years after headmaster faced same allegation",
  "image": "https://whyy.org/wp-content/uploads/2022/04/tower-hill-school-wilmington-CB-042122.jpg",
  "link": "https://whyy.org/articles/william-ushler-child-porn-tower-hill-school/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cris Barrish",
  "authorUrl": "https://whyy.org/person/cris-barrish/",
  "termIds": [
    0
  ],
  "sentences": [
    "“There is nothing — nothing — more important than protecting our kids.”\nJennings’ spokesperson Mat Marshall said those words “will be the extent of our comment during the pendency of the investigation.”\nSpeers’ email did not mention former headmaster Wheeler by name but referenced the prior scandal, writing that Ushler’s arrest “may have reverberations and echoes of the school’s previous crisis with the head of school almost a decade ago.”\nIn November 2013, Wheeler was arrested on 25 counts of dealing with child pornography after a search led by then-Attorney General Beau Biden and Jennings.",
    "Delaware authorities determined that Ushler lived in the suburban neighborhood of Graylyn Crest in northern New Castle County, and obtained a Superior Court warrant to raid Ushler’s house and conduct “a forensic examination of all computers and digital related media devices at the residence.”\nUshler told authorities he had an iPhone and a MacBook Pro at the house, and authorities seized them.",
    "Calling the arrest “deeply troubling,’’ Head of School Bessie Speers wrote that Ushler was arrested after authorities “executed a search warrant Tuesday morning on Tower Hill’s premises.” The search at the school was not noted on the arrest affidavit that Attorney General Kathy Jennings released Thursday morning.",
    "We were advised that law enforcement authorities know the source of the images in question, and these images do not depict Tower Hill students or children who were in contact with Mr. Ushler.”\nState police have not not responded to a request to provide information on the arrest or their case.",
    "Tower Hill is the same school where then-headmaster Christopher D. Wheeler was charged in 2013 with dealing in child pornography after prohibited images and videos were seized from the computer at the school-owned mansion where he lived and his Tower Hill office.",
    "The Delaware high court ruled that the warrants used to search Wheeler’s home and office were unconstitutionally broad, despite the fact that Wheeler is an “unsympathetic figure” and “sexual exploitation of children is a dreadful scourge in our society.”",
    "Now, more than eight years later, authorities were informed that another Tower Hill administrator — the 58-year-old Ushler — was allegedly using his Yahoo email account on various computers to get and send lewd photos of minors since the summer of 2019.",
    "“Our fundamental commitment as a school is to ensure that child predatory behavior has no place within our walls,’’ Speers wrote in the email with Dr. Eric T. Johnson, an orthopedic surgeon who chairs Tower Hill’s board.",
    "In one image Ushler received by email on March 21, a naked teen of about 14 or 15 sat on a bed, court records showed, and a second image showed a clothed teen of about 13 to 15 after an apparent sex act.",
    "‘Child predatory behavior has no place within our walls’\nThe arrest wasn’t immediately announced, however, by state police or the Attorney General’s Office, which jointly conducted the investigation.",
    "The user of a computer assigned to the prominent Tower Hill School in Wilmington had been receiving and sending out images of naked teenagers in March, police said in court records.",
    "“We have done everything in our power to make certain that no Tower Hill child was harmed or named as a victim in this matter and this has been confirmed by investigators.",
    "But Wheeler’s attorney, Thomas Foley, challenged the legality of the search and in 2016, the state Supreme Court overturned the conviction and he was released from prison.",
    "The computer user was identified as William R. Ushler, high school admissions director at K-12 Tower Hill, where annual tuition for 9th through 12th graders is $33,800.",
    "Instead, Tower Hill families learned about the “deplorable crimes” Ushler is accused of committing in an email from the school’s current leader Wednesday afternoon.",
    "But Jennings released a brief statement that said the arrest is a “result of the thorough work” by the Internet Crimes Against Children Task Force.",
    "A week ago Delaware authorities who investigate child predators received an alarming tip from the National Center for Missing & Exploited Children.",
    "Graduates include U.S. Sen. Chris Coons and television medical personality Dr. Mehmet Oz, now a candidate for the U.S. Senate in Pennsylvania.",
    "After he was informed of his right to remain silent, Ushler told investigators his Yahoo account was suspended in March, court records show.",
    "Ushler was arrested and sent to Howard Young Correctional Institution in Wilmington, where he is being held in lieu of $250,000 cash bail.",
    "John Messick wrote, Ushler admitted “he chats online with unknown persons and they send him nude images” of teenagers.",
    "Later that year, after a lengthy jury trial, Wheeler was convicted on all counts and sentenced to 50 years in prison.",
    "“We moved swiftly, especially once it became clear that the target worked around children,” Jennings said.",
    "Authorities charged Ushler later Tuesday with five felony counts of dealing in child pornography.",
    "That occurred about 15 times in the past three years, Ushler allegedly told investigators.",
    "The charge is a Class B felony, with each count punishable by two to 25 years in prison.",
    "A search of Ushler’s iPhone found three naked images of teens, court records show.",
    "Speers wrote that Ushler was “immediately barred from campus’’ and fired.",
    "Beau Biden, the son of President Biden, died from brain cancer in 2015.",
    "State police routinely issue releases in high-profile arrests.",
    "At the time Jennings was the state prosecutor.",
    "She was elected attorney general in 2018.",
    "A source shared the email with WHYY News.",
    "More importantly, Det."
  ]
}