{
  "id": 4749,
  "mediaId": 8393,
  "date": "2022-04-19",
  "headline": "Dr. Mehmet Oz tours ‘Wood-Mode’ in Snyder County",
  "image": "https://www.pahomepage.com/wp-content/uploads/sites/91/2022/04/Dr.-oz-snyder-county-1-1.jpg?w=1280",
  "link": "https://www.pahomepage.com/top-news/dr-mehmet-oz-tours-wood-mode-in-snyder-county/",
  "mediaOutlet": "pahomepage.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jazzmyn Allen",
  "authorUrl": "https://www.pahomepage.com/author/jazzmyn-allen/",
  "termIds": [
    2802,
    1489,
    1126,
    1594,
    6506,
    6608
  ],
  "sentences": [
    "KREAMER, SNYDER COUNTY (WBRE/WYOU) — From Your Local Election Headquarters, the push was on for Dr. Mehmet Oz as the Republican candidate for the U.S. Senate, from the Keystone state, made another stop in Northcentral Pennsylvania.",
    "“Energy prices are driving a lot of the inflation that we see and it angers Pennsylvanians because they know they have the solution right beneath their feet with the natural gas that’s clean,” Dr. Oz stressed.",
    "Dr. Oz came to Snyder Country for a look around a cabinetry company called ‘Wood-Mode.’ He says businesses like this are crucial to the people of Pennsylvania.",
    "You see what people can do if they’re not overregulated and give them the freedom to build something unique,” said Dr. Mehmet Oz, (r) candidate, U.S. Senate.",
    "We’re doing okay, and I’m saying okay but it would be nice to get some more applicants,” stated Paul Hitesman, training manager, Wood-Mode, LLC.",
    "Wood-Mode specializes in custom cabinets, but, like many businesses across the state, they’ve struggled to hire more employees.",
    "Dr. Oz believes that keeping the workforce in the states and utilizing our resources will help the rising issues of inflation.",
    "If elected Dr. Oz says he’ll continue to push for more use of natural gas, as a cleaner source of energy that will help.",
    "Known around the country for his medical show, Dr. Mehmet Oz is running for Pennsylvania’s U.S. Senate seat.",
    "He has been campaigning throughout the commonwealth and toured a local cabinetry company in Kreamer.",
    "Only one company in all my travels has been fully employed,” Dr. Mehmet Oz explained.",
    "“I’ve been out to Pittsburgh, Philadelphia, and everywhere in between.",
    "“You look at wood mode and you see an example of American ingenuity.",
    "This is the most unique job market I’ve ever seen in my life.",
    "Definitely an employee’s market.",
    "Up north, the southwest."
  ]
}