{
  "id": 5209,
  "mediaId": 2618,
  "date": "2022-04-10",
  "headline": "Disney's Colossal Political Error in Challenging DeSantis Will Cost It Dearly",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/10/disneys_colossal_political_error_in_challenging_desantis_will_cost_it_dearly_82987.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Arama",
  "authorUrl": "",
  "termIds": [
    2880,
    1679,
    1357,
    1056,
    1555,
    414
  ],
  "sentences": [
    "How sick is it to \"honor\" a mentally ill group who defines themselves first and foremost by their deviant sexual desires -- especially in amusement parks designed for children and families?!?!?!?!?!?",
    "DeSantis, but we actually stopped having anything to do with Disney about 15 years ago when we first heard they were having \"gay days\" in their parks.",
    "We haven't gone to a park, bought our kids or grandkids any merchandise, or even watched a Disney or Pixar movie or TV show in those past 15 years.",
    "The board of directors need to be asking themselves what other future dumb mistakes will he make jeopardizing the company’s financial well-being.",
    "He should be smart enough to know that a business is not an employee’s private play toy or to be used as their own private political pulpit.",
    "Satan will be giving the sodomite groomer perverts all of his support -- and he never hesitates to be extremely active in that support!!!",
    "He has demonstrated poor judgement for a man at his level of management by allowing this abuse of the company to occur.",
    "With their response to DeSantis on this, they have officially gone out of business, as far as I'm concerned.",
    "Teach them how decent people enjoy real things and never give your money to the greedy, unprincipled mouse.",
    "Last thought about visiting Disney about 20 years ago, but thought some day I'd go for nostalgia's sake.",
    "Now we do but the park is a shameless ripoff and I refuse to be scammed by a woke corporation.",
    "Robert Chapek should know better than to mix business with politics (and religion).",
    "Before that, we did take our kids to both Disney Land and Disney World.",
    "But that was before the pervert groomers decided to destroy Disney!!!",
    "This bill has nothing to do with the day to day operations at Disney.",
    "If he doesn't rid himself of these creatures, Disney is finished.",
    "Chapek has got to stop looking at these activists as LGBTQ.",
    "Stockholders would be wise to ask for his resignation.",
    "We didn’t have the money in our early marriage years.",
    "Desantis and the sane and moral people of Florida.",
    "They are predatory pedophiles masquerading as Gay.",
    "Never took the grandkids or kids to Disney.",
    "The Fox is in the hen house, so to speak.",
    "Take your kids fishing or camping.",
    "Is keeping him worth such a risk?",
    "We have a wonderful time at both.",
    "They would startle an oil sheik.",
    "I would love to help Gov.",
    "Look at the prices.",
    "Good luck Gov."
  ]
}