{
  "id": 5214,
  "mediaId": 2618,
  "date": "2022-04-10",
  "headline": "Biden to push tougher rules on sale of ghost guns that would make manufacturers add serial number to all firearms and require background checks before selling kits",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/10/biden_to_push_tougher_rules_on_sale_of_ghost_guns_that_would_make_manufacturers_add_serial_number_to_all_firearms_and_require_background_checks_before_selling_kits_82992.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt McNulty",
  "authorUrl": "",
  "termIds": [
    4794,
    4905,
    6678
  ],
  "sentences": [
    "The Biden administration is set to release long-awaited rule changes for the sale of ghost guns under growing pressure to crack down on a nationwide spike in the use of the deadly weapons.The new rules, which could be unveiled as soon as Monday, are designed to get privately made firearms without serial numbers off the streets, three people familiar with the matter told The Associated Press.The stiffer measures would require firearms dealers to run background checks before they sell ghost gun kits that contain the necessary parts needed to assemble a firearm.",
    "Fun fact, it is already illegal to make a gun without a serial number on the lower receiver, this new change will only make things more difficult for small scale manufacturers who make custom guns...instead of being able to buy partially completed lower receivers, finish them and put a serial number on them, they will have to buy them with a serial number already on them...meaning that the serial number will not tell the police much about the gun since it will be applied by a manufacturer who does not know what the completed gun will look like.",
    "Gun grabbers just have their next target in mind and immediately go to their pre-determined talking points whenever a headline producing shooting occurs, never bothering to determine if their proposed new laws would have had any effect on the recent incident.",
    "As I understand it, under existing rules there is only one part of a gun that is required to be stamped with a serial number, and every one of those that a manufacturer makes must be stamped with a serial number.",
    "The \"concern\" is that anybody with a CNC mill and the skill to use it can make that part for themselves and buy all of the other parts, putting together a gun without a serial number.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Instead let’s leave a billion dollars worth of arms for the terrorists in Afghanistan and get Congress to send billions more to Ukraine where who knows who ends up with them.",
    "Some two-bit teenage gangbanger isn't going to delve into the ghost gun market this is the ATF with permission from the government to aggravate legal gun owners.",
    "Why would a banger bother to obtain and assemble a \"ghost gun\" when other fully functional versions are readily available?",
    "Like some 17 year old gangbanger is going to order separate parts for an AR-15 and then assemble them in his bedroom.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "The only way to make sure that every gun has a serial number is to stamp a serial number on every part.",
    "So, if I made a gun and put \"007\" or \"12345\" on it....how in heck does that change anything at all?",
    "What is going to end up happening is that you are going to have guns with multiple serial numbers.",
    "I used to be an FFL holder for many years until the ATF became unbearable and full of themselves.",
    "These are called \"ghost\" guns because the federal government does not even know they exist.",
    "With these morons in charge Americans need all the guns and ammo they can get.",
    "This is probably aimed at honest citizens who simply don’t want to be tracked.",
    "They really, really want to know who the gun owners are in this country.",
    "Do we even know how often one of these \"ghost guns\" is used in a crime?",
    "Your donation helps keep our discussions going and our voices heard.",
    "What a crock 'Defund the ATF' remember Waco and Ruby Ridge.",
    "Most people don't purchase a \"kit\" , just parts.",
    "And \"parts is parts\"....NOT controlled items.",
    "I don't own a 'ghost' gun and I ain't Casper.",
    "And ,of course, leave our borders wide open.",
    "I'm a ghost alright the ATF can't find me.",
    "They just buy their guns on the street.",
    "I would bet the number is miniscule.",
    "In short they are stuck on stupid.",
    "ATF cannot just invent laws.",
    "You get one guess why.",
    "“Ghost” guns.",
    "Thank you."
  ]
}