{
  "id": 5270,
  "mediaId": 2618,
  "date": "2022-04-10",
  "headline": "America is still paying the price for Hillary Clinton’s treachery",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/10/merica_is_still_paying_the_price_for_hillary_clintons_treachery_82967.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Goodwin",
  "authorUrl": "",
  "termIds": [
    2073,
    2178,
    2674,
    2743,
    3054,
    1518,
    427,
    6159,
    6074,
    6348,
    6149,
    6678
  ],
  "sentences": [
    "“Students are having extreme difficulty with the structure of the school day: following directions, sitting in their seat for hours, working independently, being quiet and even sharing space with other students,” Vanessa Brancato, 30, who teaches preschool\nA strike pitting WTTW-Channel 11 against members of the electricians union took a bitter turn Tuesday, with the public television station serving notice that it is cutting off the workers’ health insurance.",
    "District 65, located in Evanston, Illinois, has dedicated a significant portion of the academic year to “equity weeks.” (Snip)During BLM month in February, the district presented slides on being a “Transgender ally” that told special needs kids they may choose to be “a boy or girl or both or neither, or something else”\nTema Bauer made delicious kreplach, borscht, chicken matzoh ball soup and mandel bread.",
    "Evanston–Skokie School District 65 has adopted a radical gender curriculum that teaches pre-kindergarten through third-grade students to celebrate the transgender flag, break the “gender binary” established by white “colonizers,” and experiment with neo-pronouns such as “ze,” “zir,” and “tree.” (Snip) In kindergarten, the lessons on gender and trans identity go deeper.",
    "As part of its ongoing LGBTQ+ Equity study month this April, an Illinois school district has suggested that Pre-K students “identify the colors in the rainbow flag” and “participate in making” their own “rainbow and/or trans pride flag,” according to curriculum materials reviewed by The Daily Wire.",
    "Early childhood educators say that post-pandemic preschoolers and kindergarteners are struggling with behavior issues, emotional resilience, motor skill development and language acquisition after spending their formative years wearing masks, distance learning and having limited social interactions.",
    "Brett Lyons, business representative for Local 1220, said the union is exploring ways to help the workers\nA new documentary examining moral campaigner Mary Whitehouse has divided opinion after revealing how she predicted the corrosive impact of online pornography.",
    "It is now the home of migrants (Snip) Duncan Sharkey, chief executive of the local council, said he had recently been informed by the Home Office that the Holiday Inn would be used for ‘the foreseeable’ future to accommodate migrants ‘claiming sanctuary’.",
    "Stocks plunged on Friday, with the Dow Jones Industrial Average suffering its worst one-day loss since the throes of the pandemic, as the latest raft of corporate earnings and the prospect of rising rates spurred a wave of selling.",
    "Officials believe the UI to be one of the first — if not the first — “research 1” university to explicitly implement a diversity, equity and inclusion requirement into the formal faculty promotion process.",
    "Covered services include doctor and hospital visits, lab tests, physical and occupational therapy, mental health, substance abuse disorder services, dental and vision services, and prescription drugs.",
    "Urbana - Candidates for promotion and tenure at the University of Illinois will have to submit a one-page summary of their on-the-job contributions to diversity, equity and inclusion come fall 2025.",
    "“In CO, we don’t meddle in affairs of companies like @Disney or @Twitter.”\nAt Easter, the four-star hotel close to Britain’s most popular theme park, Legoland, is usually full of holidaymakers.",
    "The members of Local 1220 of the International Brotherhood of Electrical Workers said they received notice from WTTW saying their employer-subsidized insurance will end as of Friday, April 1.",
    "A Holocaust survivor, she’d lost most of her right arm in an explosion at a factory in Leipzig, Germany, where she and other slave laborers were forced to make munitions during World War II.",
    "(Snip) The justification for the statement is to incentivize faculty as early as possible to do societally impactful work, said Bill Bernhard, executive vice provost for academic affairs.",
    "Jared Polis is openly lobbying The Walt Disney Co. to relocate its theme park from Orlando to his state over what he calls “authoritarian socialist attacks” from the Republican Party.",
    "However viewers were surprised at how modern the campaigner's views were when it came to pornography - considering erotic material 'a male commodity, made by men' to 'exploit' women.",
    "Whitehouse was a Christian fundamentalist who harbored various bigoted views, campaigning against social liberalism, feminism and the gay liberation movement throughout her career.",
    "The Mary Whitehouse Story, which aired last night on BBC, detailed how the former Midlands housewife raged against an increasingly permissive society in the 1960s and 70s.",
    "Visitors rave about the spa and the swimming pool plus the fact that it’s a short hop to Windsor Castle, Ascot racecourse and the moorings of river Thames pleasure boats.",
    "Instead of building on our unprecedented prosperity and role as the world’s ultimate superpower, we declared war — cultural, political and social — on each other.",
    "The workers can continue health coverage by enrolling in the federal COBRA program, which carries high premiums because there is no employer subsidy.",
    "We can call these children TRANSGENDER.”\nWill the Magic Kingdom leave the swamplands of Florida for the clean, cool air of the Rocky Mountains?",
    "Chicago - The State of Illinois has launched a new program that will provide free health care to undocumented immigrant adults ages 55 to 64.",
    "However this era of angry polarization, crime and violence ends, it will be left to historians to decipher how America got so far off track.",
    "“Florida’s authoritarian socialist attacks on the private sector are driving businesses away,” the Democratic governor tweeted on Tuesday.",
    "“We were eating the grass, the dirty grass, from the fields,” Mrs. Bauer said\nThe kids may be back in school, but they are not all right.",
    "But this weekend, the Holiday Inn in Maidenhead, Berkshire, was closed to tourists, outraging Britons who were hoping to stay there.",
    "(Snip)Those losses put the Dow down 1.9% for the week, its fourth straight weekly decline and its ninth losing week of the last 11.",
    "(Snip) Two months after she lost her arm, she and other women laborers were ordered on a six-day death march toward the Elbe River.",
    "“When we show whether we feel like a boy or a girl or some of each, we are expressing our GENDER IDENTITY,” the lesson begins.",
    "Just when you think you’ve seen the worst of her, proof emerges that she was even more duplicitous than we knew.",
    "With both developments centering on Hillary Clinton, they underscore her role and the depths of her venality.",
    "(snip)The free health care will expand even further on July 1 to cover eligible adults ages 42 to 54.",
    "(Snip) Two recent developments illustrate how that campaign remains a radioactive hot spot.",
    "It is an expansion of Illinois' program to provide health benefits for immigrant seniors.",
    "“There are also children who feel like a girl AND a boy; or like neither a boy OR a girl.",
    "Everyone wanted second helpings of her cinnamon-scented kugel and apple slices.",
    "The S&P 500 was 2.8% lower at 4,271.78, for its worst day since March.",
    "The free health care program was approved by lawmakers in Spring 2021.",
    "(Snip) At times, Mrs. Bauer needed a little help lifting a heavy pot.",
    "Friday’s loss was the biggest for the Dow since Oct. 28, 2020.",
    "No talks have taken place since the strike began March 16.",
    "The Nasdaq Composite declined by 2.6% to 12,839.29.",
    "The Dow fell 981.36 points, or 2.8%, to 33,811.40.",
    "Even our nation’s Founders are not spared.",
    "Colorado Gov.",
    "Banned!"
  ]
}