{
  "id": 5295,
  "mediaId": 2618,
  "date": "2022-04-10",
  "headline": "Fauci says it’s now up to Americans to assess their own COVID-19 risk",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/10/fauci_says_its_now_up_to_americans_to_assess_their_own_covid-19_risk_82999.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jackie Salo",
  "authorUrl": "",
  "termIds": [
    4794,
    3217,
    6678
  ],
  "sentences": [
    "Dr. Anthony Fauci on Sunday appeared to throw in the towel on more government restrictions over COVID-19 — insisting it’s now up to Americans to make their own medical risk assessments.“This is not going to be eradicated, and it’s not going to be eliminated,” Fauci told ABC’s “This Week.” “And what’s going to happen is that we’re going to see that each individual is going to have to make their calculation of the amount of risk that they want to take.”The White House chief medical adviser said Americans will have to consider factors such as their age, vaccination status and whether they live with vulnerable individuals when it comes to\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "On the very serious side - the undiagnosed cancer and treatment tor cancer, therefore again unnecessary deaths due to cancer, the learning disablities caused by isolation and I can go on for the very damaging isolation imposed by the biden regime.",
    "Neither my wife nor I took their dangerous shots, and other than 6 weeks when our idiot county commissioners closed all the restaurants, we have continued to eat out two or more times every week, as before.",
    "Up to now, Fauci has maintained that his mask, social distancing, vaccine and lock-downs were mandated by the science and that disobedience be punished by harsh penalties.",
    "Now about those people refused life saving medical intervention, college admission or various employment positions just for being smart enough to decline the “vaccine”.",
    "We figured this out for ourselves and ignored this Dr. Fraud entirely after about the third week when it became clear that he was full of manure and lies.",
    "If they had been, my wife wouldn't have spent the last 5 months in her hospital bed, unable to walk, sign her name, or do almost anything else.",
    "My wife is dying a slow, horrible death from Creutzfeldt-Jacob Disease from the Covid shot she had, even though we both had natural immunity.",
    "Told my doctor about it, and they said people have been getting A-fib that don't even have a history of it (after being vaccinated).",
    "Americans have failed to hold government to account for its ever-increasing usurpation of liberty, even denial of natural rights.",
    "For instance, graduation from high school and college, Sweet 16 birthdays parties which are just fun, can never be replaced.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Can I dare ask what good you, Fauci, and the scarf dr, WHO, CDC, this gov't has done for the country?",
    "We told our grown children we do know how to take care of ourselves because we've lived this long.",
    "The damage they have caused is unbelievable- the unnecessary deaths from the shot is unbelievable.",
    "The only time I have had flu like symptoms was after getting the vaccination and the booster.",
    "Americans have gone from that \"Greatest Generation\" to \"Gutless Generation\" in a few decades.",
    "Dr Fauci, you and your vaccine are nothing but worthless toxic trash that should be banned.",
    "I guess he has made some many conflicting pronouncements that people no longer believe him.",
    "Americans are not serfs to the government...well, maybe we are seen that way for a reason.",
    "The step stones they have taken from our children and grandchildren can never be replaced.",
    "Rather, you obstructed everything that could help, and only promoted things that harmed.",
    "Lawyers, politicians and other rule makers have us surrounded whichever way we turn.",
    "Those shots should have been pulled as soon as there were 200 adverse effects.",
    "I have been getting irregular heartbeat again which is a symptom of my A-fib.",
    "Many times we ignored \"masks required\" signs and nobody did anything.",
    "Your donation helps keep our discussions going and our voices heard.",
    "We have failed every civics test administered over recent years.",
    "The government does not know everyone's medical backgrounds.",
    "Where does she go, \"Dr.\" Fraud-Chi, to get her life back?",
    "If I'm not sick, there is no need for me to get tested.",
    "If I do not have any flu like symptoms, I'm not sick.",
    "I am still dealing with the aftereffects of that.",
    "We NEVER wore masks unless harassed into it.",
    "We don't need to isolate, get the shot etc.",
    "I'm fairly certain I have never had COVID.",
    "Nothing you promoted did anything to help.",
    "To hell with this arrogant, corrupt fool.",
    "None of this stuff should be mandatory.",
    "Their tune will change after it's over.",
    "Fauci and his minions belong in jail.",
    "We did this from the start.",
    "It's an election year.",
    "Do they have to sue?",
    "FAnthonyFraud-Chi!",
    "That's funny.",
    "Thank you.",
    "Good!"
  ]
}