{
  "id": 532,
  "mediaId": 2540,
  "date": "2022-02-25",
  "headline": "Trump may offer help to Katie Britt in Alabama Senate primary -- even though he's already endorsed Mo Brooks",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220224172620-katie-britt-mo-brooks-split-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/25/politics/alabama-senate-race-trump-brooks-britt/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabby Orr and Melanie Zanona",
  "authorUrl": "",
  "termIds": [
    5110,
    5493,
    5592,
    5011,
    3815,
    2765,
    36,
    5928,
    6094
  ],
  "sentences": [
    "One of the sources said the former President \"has zero interest in lifting a finger for Mo\" and doesn't plan to return to Alabama before the primary in May, but the source simultaneously noted that Trump's team has been in talks with the Brooks campaign about hosting a pair of fundraisers at Mar-a-Lago for the congressman, which would be an easier -- and less visible -- avenue that Trump could use to boost Brooks.",
    "Trump has been wary of endorsing a new candidate in the Pennsylvania Senate GOP primary, especially now that the race has pitted some of his top allies against each other as they back Oz, the former TV personality, and McCormick, a onetime Bridgewater Associates CEO who served in the George W. Bush administration and is married to Trump's former deputy national security adviser Dina Powell.",
    "Should he begin complimenting Britt in public appearances or saying positive things about more than one candidate in other state primaries, Trump would be mirroring his approach at the tail end of the 2017 Alabama special election Senate primary when he started to speak negatively about his preferred candidate's chances.",
    "A former chief of staff to outgoing Alabama GOP Sen. Richard Shelby, Britt has cast herself as a Trump-aligned conservative while arguing that Brooks, a six-term congressman, is a career politician who only recently embraced the former President after heavily criticizing him during the 2016 GOP presidential primary.",
    "There was a time during that contest when then-President Trump considered backing away from his endorsement of former college basketball player and appointed Sen. Luther Strange as Strange's campaign against former state Supreme Court Chief Justice Roy Moore, the anti-establishment favorite, began to stall.",
    "What Trump ultimately does in the Alabama race could pave the way for similar maneuvers in other crowded primary contests, including in Pennsylvania and Ohio, where top allies of the former President have been hired up by different campaigns or have endorsed opposing candidates.",
    "A person close to Trump said that Arizona is the least likely Senate race where Trump would endorse multiple candidates or sit out the primary and that he is currently under tremendous pressure by conservative tech mogul Peter Thiel to get behind his protégé Blake Masters.",
    "The Arizona Senate hopeful held a fundraiser at Mar-a-Lago last November and recently nabbed the endorsement of the conservative Club for Growth's political action committee, which has aligned itself with Trump in other races -- including getting behind Brooks in Alabama.",
    "Though they still speak often by phone, a person familiar with the matter said Trump has recently griped about a February ad by Alabama's Future PAC that highlighted some of Brooks' past criticism of Trump when he was a surrogate for Ted Cruz's 2016 presidential campaign.",
    "Several people close to the former President said he has been consistently disappointed with Brooks and worries that if he doesn't act now to improve the situation, the narrative coming out of the May primary will raise questions about the potency of Trump's endorsement.",
    "\"He knows a runoff contest is now inevitable and thinks it benefits him to say nice things about both candidates before that happens so that he looks good no matter the outcome,\" said a person close to Trump, who requested anonymity to speak about internal discussions.",
    "Brooks campaign chairman Stan McDonald said in a statement to CNN that Brooks \"is the grassroots America First candidate with two Trump endorsements and a backbone of steel,\" referring to Trump's endorsement of Brooks during his congressional reelection bid in 2018.",
    "In an interview with CNN earlier this month, Brooks described Trump's endorsement in deep-red Alabama as \"gold and platinum together\" and suggested that Britt was unlikely to make the runoff contest, which would occur if no candidate receives a majority of the vote.",
    "One Alabama GOP source familiar with the race said Britt's campaign has been jockeying to secure a Trump endorsement, noting that she wasn't even supposed to meet Trump during the rally in Cullman but worked to get face time with the former President backstage.",
    "Given how his early endorsement of Brooks has panned out, those around Trump expect him to stay out of other dogfights until a definitive front-runner has emerged or to simply endorse the winner of the primary as long as the person is a MAGA-aligned candidate.",
    "Those familiar with the former President's thinking cautioned that his willingness to let Brooks host fundraisers at Mar-a-Lago shouldn't indicate that he has closed the door on helping Britt in some fashion -- it may just be a sign Trump is hedging his bets.",
    "Greitens, who resigned from office in 2018 amid allegations of sexual assault and campaign misconduct, is competing against several other Trump-aligned candidates, including Missouri Attorney General Eric Schmitt and US Reps. Billy Long and Vicky Hartzler.",
    "Trump has recently reviewed data from his former campaign pollster Tony Fabrizio that indicated Britt's primary support in the state stems from voters who don't have a favorable view of the former President, according to a person familiar with the matter.",
    "The former President has been weighing double endorsements in other states as well, as he looks to maximize his opportunities to claim victory, though he has been warned by several advisers that such a move could ultimately weaken his influence.",
    "Some of those around Trump believe that while he is more likely to offer tepid support for Britt as the primary approaches, his thinking could change if Durant suddenly looks like he is better positioned to make it to a runoff against Brooks.",
    "Trump previously endorsed Pennsylvania Senate candidate Sean Parnell before the Republican hopeful ended his campaign in November after he lost a custody battle against his estranged wife who had made accusations of spousal abuse.",
    "Allies for Brooks say his opponents are just trying to drive a wedge between the congressman and Trump, and view Brooks' past comments as \"water under the bridge\" given that he has been an unwavering Trump supporter since then.",
    "\"Mo is a rock solid conservative, who has stood shoulder-to-shoulder with us ... and one of my father's greatest allies since the day my father took office,\" Trump Jr. wrote in a fundraising email to Trump supporters last week.",
    "While Trump stopped short of doubling his endorsement in the primary and offering to also back Britt, two people familiar with the matter said he told Britt he would speak positively of her in private and public appearances.",
    "In Pennsylvania, Ohio and Missouri -- where numerous pro-Trump Republicans are competing for open Senate seats -- the current slate of candidates suggests that whoever wins the primary will be an easy endorsement for Trump.",
    "Trump has been surveying aides and allies for their thoughts on dual endorsements but is leaning toward formally endorsing only one candidate or forgoing an endorsement until the general election, people close to him said.",
    "He already had his man in the race -- conservative firebrand Mo Brooks -- and wasn't keen on endorsing a second candidate, despite briefly considering it amid frustrations with Brooks' dull performance so far.",
    "Though his fundraising has paled in comparison to Britt's, Brooks has maintained a slight edge in most polls and believes Trump's support will prove critical in carrying him over the finish line in May.",
    "Even as Brooks has attempted a campaign reset -- crisscrossing the state for town halls and replacing his team with fresh leadership -- Trump has remained upset with the trajectory of the race.",
    "Eric Greitens met briefly with Trump at Mar-a-Lago after hanging around the property for fundraising and political meetings earlier this month, according to a person familiar with the meeting.",
    "The Durant campaign declined to comment and instead pointed to a statement from January in which spokesman Jahan Wilcox accused Brooks and Britt of trying to undercut Durant's campaign.",
    "But then Trump got to talking with New England Patriots coach Bill Belichick at his annual Super Bowl party, and their conversation turned to the contentious GOP primary in Alabama.",
    "Others -- including Trump's eldest son, Donald Trump Jr. -- have been highly critical of Britt and the support she's received from what they believe is the GOP's establishment wing.",
    "A source close to Brooks said his team received confirmation that one of his Mar-a-Lago fundraisers had been greenlighted hours after Britt met with Trump at his Florida residence.",
    "\"Like in Pennsylvania, he's got [Fox News host] Sean Hannity saying positive things about Dr. [Mehmet] Oz, but several of his former aides are working for David McCormick.\"",
    "The former President has complained to allies that Durant is \"a McCain guy\" since he served as a surrogate for the late Arizona senator's 2008 presidential campaign.",
    "\"Belichick coached Wesley Britt and said positive things about the couple when they got to talking about the race,\" said a person familiar with their conversation.",
    "He hasn't endorsed in a Senate race in a long time, but he's constantly hearing competing things from his allies,\" said a person who recently spoke to Trump.",
    "In Alaska, incumbent Republican Sen. Lisa Murkowski ended last year with more than six times the cash on hand as her Trump-backed opponent, Kelly Tshibaka.",
    "Days later, Trump invited Katie Britt to visit him at his Palm Beach estate while she was in town for a donor event with other MAGA-aligned candidates.",
    "But it was during their face-to-face meeting that Trump said he might be open to assisting her campaign despite his endorsement of Brooks last April.",
    "These GOP hopefuls have flocked to Mar-a-Lago for facetime with Trump while clashing over the depth of their MAGA bona fides on the campaign trail.",
    "Still, it is unclear what will happen in Trump's orbit if the former President starts openly questioning Brooks' chances or speaking well of Britt.",
    "Trump has also been monitoring Durant, an Army veteran who is running a competitive campaign despite a late entry into the race last October.",
    "He gets to claim influence no matter who survives the primary and doesn't get burned like he will if Brooks loses,\" said one Trump adviser.",
    "\"If he gets behind another candidate, one could argue that it doubles his chances of winning,\" said the person who spoke to Trump recently.",
    "(CNN)Former President Donald Trump didn't plan to invite Alabama Senate hopeful Katie Britt to meet with him at Mar-a-Lago this month.",
    "At one point during a rally just days before the primary, Trump acknowledged that he \"might have made a mistake\" in backing Strange.",
    "The former President has also been courted by several Senate candidates seeking his endorsement in the Missouri and Ohio primaries.",
    "\"Congressman Brooks and Chief of Staff Katie Boyd Britt have been in politics their entire lives where these games are played.",
    "Trump and Britt had already spoken twice by phone since their first encounter at his August rally in Cullman, Alabama.",
    "They should be ashamed of themselves and condemn this terrible attack on Mike's character immediately,\" Wilcox said.",
    "But nowhere has Trump been more irritated with the performance of his preferred candidate than in Alabama.",
    "Outside of Alabama, there are other Trump-backed candidates who, like Brooks, have struggled to take off.",
    "Lending support to a second candidate and offering a dual endorsement are, of course, two separate moves.",
    "Recent polls have showed a tight three-way race between Brooks, Britt and political newcomer Mike Durant.",
    "\"The people of Alabama are going to stand with President Trump by helping to carry Mo Brooks to victory.\"",
    "And in North Carolina, Rep. Ted Budd is locked in a tight race against former GOP Gov.",
    "(Katie Britt's husband spent four years as an offensive lineman for New England.)",
    "\"At the end of the day, almost all of these guys are supportive of him.",
    "Pat McCrory, despite having received a Trump endorsement in June 2021.",
    "However, it's unclear if the maneuvering will pay off in any way.",
    "But for Trump, one of them would not be without precedent.",
    "Politico was first to report their meeting last week.",
    "\"He's feeling kind of caged right now.",
    "On Tuesday, former Missouri Gov."
  ]
}