{
  "id": 5382,
  "mediaId": 2592,
  "date": "2022-04-13",
  "headline": "Trump Endorsement Of Dr. Oz In Senate Race Stuns Advisers, Divides Loyalists",
  "image": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2022/04/13/u-s-senate-candidate-oz-campaigns-in-york.jpg",
  "link": "https://www.ibtimes.com/trump-endorsement-dr-oz-senate-race-stuns-advisers-divides-loyalists-3473153?utm_source=Public&utm_medium=Feed&utm_campaign=Distribution",
  "mediaOutlet": "IBTimes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jarrett Renshaw",
  "authorUrl": "",
  "termIds": [
    5862,
    5851,
    4905,
    2765,
    2802,
    1489,
    1126,
    6159
  ],
  "sentences": [
    "Donald Trump's decision to endorse celebrity doctor Mehmet Oz in the Pennsylvania Senate race has divided local Republican Party officials and stunned close advisers who thought he had decided to stay out of the contest to pick a Republican candidate, two sources familiar with internal deliberations told Reuters.",
    "Oz, a Turkish American, hosts the syndicated \"The Dr. Oz Show\" and is a household name in the United States, but his public image took a blow in 2014 when he told lawmakers probing bogus diet product ads that some of the products promoted on his show lacked \"scientific muster.\"",
    "Oz and David McCormick, a former hedge fund CEO who has hired many former aides to Trump to work on his campaign, are the top two candidates in the Republican nominating contest that will determine who faces a Democratic candidate in the November congressional elections.",
    "Sean Parnell, who was Trump's first choice in the Senate race before dropping out amid spousal abuse allegations, said Oz lacks a conservative track record and will be burdened by a long list of \"head scratching\" moments from his years on television.",
    "In recent months, top advisers urged Trump to stay out of the Republican primary during routine monthly meetings at his Mar-a-Largo, Florida estate where potential endorsements of candidates were reviewed, according to the sources.",
    "\"It's not like he was knocking out a never-Trumper,\" with his endorsement of Oz, said one of the sources, using a name typically used to describe moderate Republicans who reject Trump's no-holds-barred approach to politics.",
    "While both Oz and McCormick had been vying for Trump's support, the advisers saw no reason for Trump to endorse either of them, as both men have enthusiastically adopted the former president's America First agenda.",
    "Mark Hrutkay, the vice chairman of the Republican Party in Washington County in western Pennsylvania, says callers have been flooding his office phone since Trump announced the endorsement on Saturday night.",
    "Sam DeMarco, who heads the Republican Party in Allegheny County, which includes Pittsburgh, was also surprised that Trump decided to weigh in and doesn't expect it to have a major impact.",
    "\"It certainly carries risk for Trump, whose goal in the end is to look good and there's a good chance he won't when the race is over,\" Borick said.",
    "Chris Borick, a political science professor at Muhlenberg University in Pennsylvania, says Trump \"went out a limb\" with the Oz endorsement.",
    "\"President Trump endorsed Dr. Mehmet Oz because he's a conservative outsider who will stand up to Joe Biden and the woke Left,\" she said.",
    "Still, some Trump loyalists in Pennsylvania fully support his endorsement of Oz and don't understand the blowback it is generating.",
    "In the last meeting, held in March, the former president and advisers agreed to put aside the decision for now, the sources said.",
    "Brittany Yanick, the communications director for the Oz campaign, said there was nothing surprising about Trump's endorsement.",
    "The Senate race could determine control of the Senate and the fate of Democratic President Joe Biden's legislative agenda.",
    "While the primary includes a crowded field of contenders, recent polls show Oz and McCormick as the clear frontrunners.",
    "BLOWBACK\nThe former president's endorsement has confused and riled Republicans in pro-Trump regions of Pennsylvania.",
    "Oz is a great candidate,\" said Lee Snover, a Trump loyalist who chairs the Republican Party in Northampton County.",
    "A third source with knowledge of the situation said Trump's wife Melania had encouraged him to endorse Oz.",
    "\"Voters have a lot of questions about Oz's conservative credentials on issues like guns and abortion.\"",
    "Ultimately, Trump always makes the final call and he \"went with his gut,\" the second source said.",
    "Neither source was able to shed light on why Trump changed his mind and decided to back Oz.",
    "The McCormick campaign did not respond directly to questions about the endorsement.",
    "The internal deliberations on the endorsement have not been previously reported.",
    "A spokesperson for Trump did not immediately respond to a request for comment.",
    "\"I am not quite sure why (Trump) decided to endorse at this point in the race.",
    "\"I got the same treatment when I backed Trump and people criticized me.",
    "\"I have not had one call from a voter who supported the endorsement.",
    "\"This doesn't mean they are abandoning Trump, because they're not.",
    "They were wrong then and they are wrong about Oz,\" Snover said.",
    "They just don't understand the endorsement.\"",
    "He's putting his credibility on the line.\"",
    "They are pissed off,\" says Hrutkay.",
    "\"People are becoming unhinged.",
    "DeMarco said."
  ]
}