{
  "id": 5390,
  "mediaId": 2618,
  "date": "2022-04-10",
  "headline": "China Stockpiling Nuclear Weapons At An Alarming Rate: Report",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/10/china_stockpiling_nuclear_weapons_at_an_alarming_rate_report_82976.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Lenczycki",
  "authorUrl": "",
  "termIds": [
    2938,
    3054,
    4794,
    1356,
    933,
    6509,
    6678
  ],
  "sentences": [
    "China is racing to stockpile nuclear weapons capable of striking North America, The Wall Street Journal reported Saturday.The communist nation is reportedly “accelerating” the development of “more than 100 suspected missile silos,” each reportedly able to house missiles with nuclear tips that have the ability to reach American shores, according to the WSJ report, which cited anonymous sources familiar with Chinese leadership strategy.",
    "Online sources say we have 1,800 \"deployed\" and 2,800 \"retired\" and 4,000 \"stockpiles\" ....whatever that really means - probably scattered in pieces and can't be used without years of work, but we really don't know.",
    "The eggheads at the Los Alamos National Lab were supposed to make a 'pilot production line' and produce something like one or two, \"in preparation for re-establishing this capability\".",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Chinese \"scientists\" were allowed unbelievable access to our nations' greatest secrets, and the Clinton Campaign Fund benefitted then and continues to benefit to this day.",
    "But don't fret my fellow American's our military under the expert command of such stalwarts as Biden, Austin and Miley are getting our men and women in fighting shape.",
    "And the old weapon cores eventually go bad from nuclear decay, it isn't known exactly how much longer our ancient nuclear weapons will continue to function.",
    "The envirowhackos shut down Rocky Flats nuclear manufacturing plant in 1992, and we have no real production capacity to replace what they literally erased.",
    "They claim that they have \"calculated it\".....but since nothing has been tested in 30 years....we really don't know for sure if they will still work.",
    "China will continue to build weapons using refined matter supplied by Iran using our uranium that Hillary sold to the Russians.",
    "The silos are purportedly large enough to accommodate China’s state of the art DF-41 long-range missile, the WSJ reported.",
    "Always remember, it was President Bill Clinton who provided the MIRV technology to China, gratis, via the Los Alamos Lab.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Pretty soon the liberal media will realize they will be responsible for their own deaths if China nukes us.",
    "Oh, and how many folks are aware that we do NOT HAVE THE CAPABILITY to make the nuclear cores any more?",
    "Special thanks to Hillary Clinton for making the Uranium One deal selling our uranium to Russia!",
    "Through the deal, Russia is able to own about 20 percent of U.S. uranium production capacity.",
    "Yes the chicoms are and I'm here to tell you there's one with our name on it.",
    "With the \"shot\", CRT, gender studies, and transgender troops we'll be ready.",
    "Dumping the B83 gravity bomb, so that will be how many more just 'retired'??",
    "See how Democrats FUBAR international relations whenever they are in power.",
    "Your donation helps keep our discussions going and our voices heard.",
    "No certainty that the old ones will actually work, gave up testing.",
    "We modernize the electronics on the very few that we have left.",
    "We can re-use old cores, but cannot manufacture a new one.",
    "They probably will for now....but for how much longer?",
    "No capability to manufacture new nukes.",
    "AFAIK, they have produced NO new cores.",
    "No new nukes.",
    "Thank you.",
    "Right?",
    "."
  ]
}