{
  "id": 5427,
  "mediaId": 2618,
  "date": "2022-04-10",
  "headline": "The FDA's Food Failure",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/10/the_fdas_food_failure_82988.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Helena Bottemiller Evich",
  "authorUrl": "",
  "termIds": [
    2543,
    503,
    1063
  ],
  "sentences": [
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "By the time FDA officials figured out it was spinach that was making people sick in 10 states – sending three people into kidney failure – it was too late.",
    "The fields and the production facilities were empty, which made it impossible to pinpoint the source of contamination.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "(I say \"knowingly\" because I had friends in college who liked to camouflage them in foods I would eat.",
    "By the time FDA officials got inspectors on the ground, spinach season was over.",
    "It was mid-November 2021 and the packaged salad’s short shelf life had passed.",
    "A vegetable has not knowingly passed my lips since I was four years old.",
    "A surprisingly excellent piece of investigative journalism by Politico.",
    "Your donation helps keep our discussions going and our voices heard.",
    "I am healthy, and TK says I'm the strongest woman he's ever known.",
    "God gave mankind the intelligence to come up with multi-vitamins.",
    "We don't need to scrounge plants for needed nutrients.",
    "More evidence for my belief that vegetables are evil.",
    "Whatever caused the outbreak was likely never fixed.",
    "I can throw lumber around with the best of them!",
    "Stop with the nasty stuff - its not necessary.",
    "Comments:\nThis is long, but worth reading.",
    "There was no recall.",
    "Thank you.",
    "Fascists!)",
    "/rant over",
    "Stand up!",
    "Eat meat!",
    "Aha!"
  ]
}