{
  "id": 5430,
  "mediaId": 2618,
  "date": "2022-04-10",
  "headline": "Tennessee governor invites private conservative college to open 50 charter schools whose anti-woke curriculum will teach students that America is 'an exceptionally good country'",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/10/tennessee_governor_invites_private_conservative_college_to_open_50_charter_schools_whose_anti-woke_curriculum_will_teach_students_that_america_is_an_exceptionally_good_country_82996.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrea Cavallier",
  "authorUrl": "",
  "termIds": [
    6423,
    6650,
    6678
  ],
  "sentences": [
    "When our legal system becomes politicized and corrupt; when our politicians become arrogant and depraved; when our law enforcement and entrenched federal bureaucracy work against our citizens, and when our election process becomes dishonest, then we are doomed to become another third-world, tin-pot dictator ruled s--thole country.",
    "Hillsdale College, which has close ties with former President Donald Trump, developed the '1776 Curriculum'\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Make it a policy that any teacher, teacher assigned material, homework assignment, or lesson plan that includes anything to do with CRT, BLM, lbgqxyz material, or some other gender identity BS will immediately be fired on the spot, and escorted out of the building by security.",
    "Bill Lee, a Republican, said that Hillsdale College, whose base is in Michigan, could open the schools using public funds, including $32 million set aside for charter facilities, the New York Times reported.",
    "I believe there are groups of people (so-called citizens) that feel they are left behind and they want to tear down the system our fore-fathers bequeathed us and they will somehow build back better.",
    "The governor of Tennessee has invited a private conservative college to open 50 charter schools whose anti-woke curriculum will teach students that America is 'an exceptionally good country.'",
    "Although our system of government with our freedoms has helped build a productive economic base that has benefited and raised the quality of life around the globe, it is fragile.",
    "If you think leftist nuts running leftist public schools in leftist school districts Is bad, just wait till they put the full brunt of a leftist college at the helm.",
    "Every one of them, every single one has sold the souls of their children and grandchildren to their communist party and that includes Romney, Murkowski and Collins.",
    "They also have a whole group of traditional thinking teachers who would be ripe for the picking because they hate teachers’s unions and only stay for the kids.",
    "city kids are more stupid than their suburban counterparts) when the real problems are social and \"equality\" of outcome impossible under the circumstances.",
    "It is imperative that we teach our children and remind our citizens that we are very fortunate to have been born into the system set up by our founders.",
    "But when you have 8 comprehensive High Schools in your county school district with a less than 60% graduation rate, all options should be on the table.",
    "The Coastal snobs that denigrate us as being 'uneducated' can't approach our average SAT/ACT scores, Graduation Rages, and College attendance rates.",
    "Here in Nashville, sometimes called the Athens of the South, we have great medical colleges which prefer to be called Schools of Medicine.",
    "But, then, the kiddies deserve the best money can muster...\nOur founders were exceptional men that created a unique and wonderful country.",
    "I've been waiting for a state to take the lead and move this forward to save our children from the tyrannical dictates from the Left.",
    "Parents want their children to be educated and they do not want to have to worry about what they are being taught in the classroom.",
    "Public education is largely a political dodge - the amounts spent (national average $13,187) are obscene for the apparent outcome.",
    "In other words, don't get woobly and accept donations from liberals and don't get intimidated by the schoolteachers union thugs.",
    "You see, there is no democratic party anymore, it's the communist party and they have laid out their sick agenda for all to see.",
    "And that does not include capital \"investments\" in so many Taj Mahals of Education with every bell and whistle one can imagine.",
    "My other two sibs and I received wonderful public high school educations before Davidson County merged with Nashville schools.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "The bean counters count, cogitate, and pronounce the systems need more money so Dante and Pablo can learn to read.",
    "I would be surprised if President Larry Arnn took Tennessee up on this since the endeavor would use public funds.",
    "Be thankful you weren't born into a caste system, or a monarchy, or any other rigid system of social hierarchy.",
    "Before becoming our Governor he owned if not the largest, one of the largest HVAC companies in the state.",
    "But watch out for liberal colleges to contact liberal states and try to model the leftist alternative.",
    "Hillsdale has never accepted any public money in order that it remains free to teach as it sees fit.",
    "Being equal under the law doesn't mean equal in wealth, intelligence, strength, good-looks, etc.",
    "I’d like one per county all across the USA, but only if we can sustain excellence throughout.",
    "\"Public\" education plainly sucks in too many places, certainly in American urban centers.",
    "The time is coming when being normal will once again be celebrated rather than ridiculed.",
    "He has raised conservative eyebrows a time or two with not well thought out comments.",
    "These over paid jail wardens we call Metro teachers need to start feeling the pinch.",
    "There is a real need for this and I believe it will take off if given the chance.",
    "And just two or three other colleges should even be considered as possibilities.",
    "Now the next step is vetting the teachers who will be teaching in these schools.",
    "If 100% of the money came from private donations, that would be another matter.",
    "We need to know Hillsdale’s capacity to run with this in other states as well.",
    "Great move and it's the only way to stop the indoctrination of our children.",
    "During academic 2020-21, public school teachers made an average of $65,090.",
    "Life is much better, (and sane) in North East Tennessee, especially today.",
    "Most of the schools in the Tri-Cities area are in the top 5% of the state.",
    "#6 the weeping and gnashing of teeth here in Nashville will be beautiful.",
    "The fact he was a successful businessman gave him a Trump like appeal.",
    "Your donation helps keep our discussions going and our voices heard.",
    "The academic places do seem to run toward the non-conservative side.",
    "Government just spends money with little concern for actual results.",
    "Give them a choice and they will flee the public education system.",
    "No longer under the covers, they are in full view for all to see.",
    "To the leftists at the daily mail; anyone can support Hillsdale.",
    "(Can't bring myself to say ''liberal'' about my own hometown.)",
    "#1, #2 We escaped the People's Republic of NY 10 years ago.",
    "Looking foreword to the liberal tears here in Nashville.",
    "You only have to look around the world to realize that.",
    "I hope you keep parents involved every step of the way.",
    "Por favor stay strong and committed to your mission.",
    "A little background for our non Tennessee Ldotters.",
    "Donations are not restricted to \"conservatives\".",
    "Back then, Latin was required for all freshmen.",
    "Leftists believe they have education sewn up.",
    "This is America, not some 3rd world country.",
    "The $$$ flows to correct \"imbalances\" (i.e.",
    "It’s time to disavow them of that concept.",
    "And it's not that teachers are \"unloved\".",
    "Nothing could be further from the truth.",
    "That ain't hay for nine months.",
    "Thank you for the good news.",
    "All need to be voted out.",
    "Forewarned is forearmed.",
    "Amo, Amas, Amat, ya'll.",
    "Have to agree #11.",
    "Great idea.",
    "Odd, right?",
    "Thank you.",
    "Got it...",
    "Gov."
  ]
}