{
  "id": 5476,
  "mediaId": 5308,
  "date": "2022-04-20",
  "headline": "Senate candidate David McCormick has pledged to “fight the woke mob,” but he once called for “solidarity by denouncing and eradicating structural bigotry.”",
  "image": "https://video-images.vice.com/articles/625ffcb387bbc4009b03b821/lede/1650458113196-david-mccormick-woke-senate-election.png?image-resize-opts=Y3JvcD0xeHc6MC44NDc4eGg7MHh3LDB4aCZyZXNpemU9MTIwMDoqJnJlc2l6ZT0xMjAwOio",
  "link": "https://www.vice.com/en/article/93b74z/pennsylvania-david-mccormick-woke-mob",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron Joseph",
  "authorUrl": "https://www.vice.com/en/contributor/cameron-joseph",
  "termIds": [
    2802,
    5862,
    190,
    1489,
    6506
  ],
  "sentences": [
    "“Wokeness, cancel culture, and the inability to talk and discuss things openly is very detrimental to our future,” McCormick said in a recent interview with the Pittsburgh Quarterly, blasting the concept that companies and CEOs had responsibilities not to just their shareholders but also to customers, employees, and the communities in which they operate because it “opens CEOs up to becoming politicized as opposed to primarily focused on their business.”\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "The Zoom meeting was hosted by the type of affinity group that McCormick championed while at Bridgewater, part of an effort to create a diverse workplace that, as he put it, was an “essential condition of our quest for excellence and our idea of true meritocracy.”\nShortly after becoming co-CEO of the Connecticut hedge fund in 2017, McCormick launched the company’s first Diversity and Inclusion (D&I) initiative, which Bridgewater’s website declared last September “remains a top strategic priority” for him and the company.",
    "The piece was headlined “Hedge Funds Mostly Silent on Black Lives Matter Protests.”\nA few weeks after he penned his open letter following Floyd’s death, McCormick participated in an event organized by the Bridgewater Black Network, an affinity group of the company’s Black employees, titled “Our Lived Experience: A Conversation About Racial Injustice.”\nMcCormick and other non-Black Bridgewater employees read anonymized accounts of discrimination from their Black colleagues during the Zoom event.",
    "McCormick’s Bridgewater work came up in a new ad from a pro-Oz super PAC, American Leadership Action, which says “McCormick’s woke Connecticut hedge fund supported Black Lives Matter and covered transgender surgeries.”\nMcCormick’s allies have pointed out that Oz has flip-flopped on gun control and abortion, and run ads attacking Oz for doing a half-hour TV special that sympathetically portrayed trans youth; Oz’s team has responded with attacks on Bridgewater’s support for trans employees.",
    "McCormick read aloud a colleague’s testimonial about “the nervous and slight fearful glances from my own classmates” that person received, as well as the “very scary” moment “when a police officer slowed his car down by me in the middle of a run to question what exactly was I running away from.”\nThe event then moved to a lengthy presentation on how structural racism, disparate access to wealth, and a legacy of legal and societal discrimination combined to disadvantage Black people.",
    "Those efforts earned him industry accolades: He was named to INvolve’s 2021 “Top 35 Advocates List.” Bridgewater trumpeted the award, saying it recognized McCormick’s “efforts to champion women in business and diversity and inclusion, more broadly—by instituting policies and structural, systemic changes that promote gender equity in the workplace.”\nAs the Daily Beast first reported, Bridgewater under McCormick also prided itself on its LGBTQ and other diversity initiatives.",
    "His campaign website declares that he’ll “stand up against the wokeness taking over our schools, big businesses, and the media.”\n“I’m anti-woke, anti-illegal immigration, anti-political correctness, anti-socialism, anti-Joe Biden, and the radical left,” McCormick said in another ad, adding that he’s “pro-police.”\nBut not long ago, he sounded pretty “woke” himself.",
    "“With empathy and genuine conviction, we can and must show this solidarity by denouncing and eradicating structural bigotry around us.”\nHis open letter was also posted to the company’s website, below an image of a solid black box associated with #BlackoutTuesday, a social media trend that aimed to show support for the Black Lives Matter movement.",
    "He and Oz, who won former President Donald Trump’s endorsement earlier this month, have been locked in an increasingly nasty argument over who’s the biggest phony, repeatedly accusing each other of faking their social conservative bona fides as they race to the right ahead of the state’s May primary.",
    "Shortly after George Floyd’s murder in May 2020, McCormick penned an open letter that denounced what he called “structural bigotry”—one of many steps he took while CEO of Bridgewater Associates to push the company’s diversity and inclusion initiative.",
    "Pennsylvania Republican David McCormick has framed his Senate campaign around a pledge to battle “wokeness.”\n“I’m running for the U.S. Senate to fight the woke mob hijacking America’s future,” McCormick declared in his first campaign ad.",
    "Benefiting from a system that quietly discriminates—without acknowledging it and helping to repair it—only propagates that system,” McCormick wrote in a note to Bridgewater’s employees that he shared on his LinkedIn page.",
    "Like President Trump and others, Dave was a leader who provided reflections following the death of George Floyd,” McCormick campaign spokesperson Jess Szymanski said in a statement to VICE News.",
    "The trade publication Institutional Investor noted that Bridgewater was the only one of the ten largest hedge funds whose leaders publicly commented on Floyd’s death.",
    "The story he read was from a Black immigrant who said they were surprised at the level of discrimination they faced when they moved to the U.S. to attend college.",
    "But in the private world of venture capital, where companies didn’t face the same kind of public pressure to weigh in, McCormick’s statement was unusual.",
    "He also created a full-time team and senior advisory council to drive the effort, including hiring the firm’s first chief diversity officer.",
    "Szymanski also claimed Oz “did an entire show promoting the Black Lives Matter organization,” an attack they’ve featured in ads.",
    "McCormick’s campaign pushed back against the idea that he’d pulled an about-face on racial justice and diversity issues.",
    "McCormick seems well aware that some of his work at Bridgewater might not sit well with Pennsylvania’s GOP base voters.",
    "“Racism and discrimination more broadly thrive not just in overt actions but also in omissions and willful ignorance.",
    "The firm expanded its healthcare program to fully cover gender-transition surgery during McCormick’s time as CEO.",
    "Oz,” are the front-runners in a crowded field of GOP candidates vying to replace retiring GOP Sen. Pat Toomey.",
    "Many publicly traded corporations put out performative pro-Black Lives Matter statements during that period.",
    "“Dave never supported BLM and has always stood with law enforcement as a strong law-and-order candidate.",
    "He is running for Senate to fight the wokeness that liberals like Mehmet Oz have pushed on our society.",
    "In recent days, he has seemed to call out exactly the kind of CEO he was while at Bridgewater.",
    "McCormick and television personality Mehmet Oz, better known as “Dr.",
    "That’s come back to haunt McCormick in his Senate campaign."
  ]
}