{
  "id": 5525,
  "mediaId": 2533,
  "date": "2022-04-11",
  "headline": "Dr. Oz Is Running for Senate and He Just Got Big News From Donald Trump",
  "image": "https://www.analyzingamerica.org/wp-content/uploads/2022/04/Mehmet-Oz.jpg",
  "link": "https://www.chicksonright.com/blog/2022/04/11/dr-oz-is-running-for-senate-and-he-just-got-big-news-from-donald-trump/",
  "mediaOutlet": "chicksontheright.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Staff -",
  "authorUrl": "https://www.chicksonright.com/blog/author/analyzingmeric2/",
  "termIds": [
    2765,
    2802,
    1126,
    1489,
    6520,
    6512,
    6506,
    6678
  ],
  "sentences": [
    "Dr. Oz also passionately believes in high-quality education and protecting parent involvement throughout the process.”\n“Perhaps most importantly, I believe that Mehmet Oz will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\n“Women, in particular, are drawn to Dr. Oz for his advice and counsel.",
    "Transgender adults struggle “to figure out if they want to keep living the lie.”\nDr. Oz says that “Feminists have very eloquently fought for the ability to have women’s sports be on equal [inaudible] as men’s sports.”\n“This takes away that ability,” Oz said, suggesting that transgender athletes possess an unfair advantage in sports.",
    "Trump said Dr. Oz, who is a Republican, is “all about winning elections in order to stop the Radical Left maniacs from destroying our Country.”\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,” Trump said.",
    "Likewise, he will do very well in Philadelphia and Pittsburgh, where other candidates will just not be accepted.”\n“He knows his job is to serve every single Pennsylvanian Dr. Oz is smart, tough, and will never let you down, therefore, he has my Complete and Total Endorsement,” Trump concluded.",
    "Oz is Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts, and will always fight for and support our under-siege Second Amendment,” Trump said.",
    "our Country needs you!”\nDr. Oz recently commented on the controversy surrounding Lia Thomas, formerly William, who is the biological male competing for University of Pennsylvania.",
    "In 2009, Dr. Oz began appearing in his own show, The Dr. Oz Show, which has had a profound impact on medical and health matters facing Americans.",
    "President Donald Trump announced his endorsement of the celebrity doctor, who was widely known as a regular guest on The Oprah Winfrey Show.",
    "The female teammates of the transgender collegiate swimmer Lia Thomas have spoken out in anger about the unfairness of the situation.",
    "Dr. Oz says it’s important that “we have to have compassion” for transgender adults, noting that the suicide rate has increased.",
    "“I would argue that what I just said can’t be said – I definitely couldn’t have said it on [The Dr. Oz Show],” Oz explained.",
    "“I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.”\n“Dr.",
    "World renown cardiothoracic surgeon Mehmet Oz is running in Pennsylvania’s U.S. Senate Race.",
    "Lia competed for the Men’s Team for three years before switching to the women’s swim team.",
    "“He will ensure America will become Energy Independent again.",
    "“And you need to be able to say those things,” he concluded.",
    "They know him, believe in him, and trust him.",
    "I have seen this many times over the years.",
    "“Good luck, Dr. Oz."
  ]
}