{
  "id": 5531,
  "mediaId": 2724,
  "date": "2022-04-11",
  "headline": "I’m Just Going To Say This: Trump’s Endorsement Of Dr. Oz Is The Wrong Move",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/04/2022.04.11-12.14-thepoliticalinsider-62541ba9c961b.jpg",
  "link": "https://thepoliticalinsider.com/im-just-going-to-say-this-trumps-endorsement-of-dr-oz-is-the-wrong-move/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rusty Weiss",
  "authorUrl": "https://thepoliticalinsider.com/author/rusty-weiss/",
  "termIds": [
    5644,
    4284,
    2887,
    5037,
    4905,
    2802,
    2765,
    1489,
    6506
  ],
  "sentences": [
    "“I don’t believe that we should be intruding into the private lives of homosexuals and we should not be creating obstacles during the difficult time that women have when trying to terminate a pregnancy.”\nIn a 2019 interview on the Breakfast Club radio show, he noted that he dislikes abortion on a “personal level” but suggested he would not want to “interfere with everyone else’s stuff” because “it’s hard enough to get into life as it is.”\nWATCH: Dr Oz argues for upholding Roe v Wade abortion standards, 2019 pic.twitter.com/G4xwg0tjRf\n— Jack Posobiec ????",
    "Harriet Hageman was involved in trying to prevent Trump from becoming the nominee at the convention and decried him as “racist and xenophobic.” https://t.co/SCZqXmFfXD\n— Kyle Griffin (@kylegriffin1) September 28, 2021\nThe GOP Needs True Conservatives\nMr. Trump, to quote comedian Sebastian Maniscalco, “What are you doing?”\nThere’s little doubt one of the greatest failures of the Trump presidency was his inability to clear out the deep state riffraff within his own administration.",
    "(@JackPosobiec) December 7, 2021\nDr. Oz On Abortion\nTrump’s endorsement states that Oz is “pro-life,” something the Daily Beast claims is a “shameless flip-flop.”\n“Not only was Oz supportive of abortion rights, he seemed puzzled that people would spend time fighting abortion rights—going so far as to say that, as a physician, he was ‘really worried’ about the anti-abortion movement and that eliminating Roe would have negative effects on women’s health,” they wrote.",
    "#PAsen pic.twitter.com/rkpcYcusgc\n— Matt Wolking (@MattWolking) April 6, 2022\nCNN reports that while he doesn’t fully support Obamacare, “Many of Oz’s statements on health care align with some of the key tenets of the Affordable Care Act.”\nDr. Oz On Fracking\nOz, who is running in a state where fracking is of tantamount importance, often raised concerns about the practice in the past.",
    "Inside Climate News writes that “the two physicians cited the environmental and health risks associated with fracking on several occasions and, in one column, warned expecting mothers who live near natural gas wells against drinking the water and counseled them to keep three kilometers away from fracking fields.”\nNow, he’s fracking’s number one fan.",
    "That’s the Hollywood/Oz position https://t.co/AU4ov4lcAr\n— Matt Wolking (@MattWolking) March 31, 2022\nDr. Oz On Guns\nTrump, aside from lauding Dr. Oz for being pro-life, also claims the Pennsylvania Republican “will always fight for and support our under-siege Second Amendment.”\nBut will he?",
    "pic.twitter.com/XkIE6qV4R0\n— Dr. Mehmet Oz (@DrOz) March 16, 2022\nWe live in a time where too many Republicans try selling their conservative wares just to get elected only to start functioning like barely-disguised left-of-center RINOs once they get into office.",
    "“Look at their Facebook feed or social media postings or comments they’ve made to other co-workers.”\nGovernment surveillance and infringing on God-given rights based on social media posts doesn’t seem like a warrior for conservatism.",
    "In fact, she tried to stop Trump from getting the Republican nomination in 2016, and called him “racist and xenophobic.”\nTurns out the Republican handpicked by Trump to take down Liz Cheney was a vocal opponent of Trump in 2016.",
    "— Kurt Schlichter (@KurtSchlichter) April 9, 2022\nTrump Endorsements All Over Map\nTrump has also thrown his support in Wyoming to Harriet Hageman, the attorney running against Liz Cheney in an upcoming primary.",
    "In multiple columns Oz co-authored with Dr. Mike Roizen, former chief medical officer at the Cleveland Clinic Wellness Institute, the two raised concerns about health risks involved in the practice.",
    "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate.”\nThank you, Mr. President.",
    "Dr. Oz On Obamacare\nOz was a strong advocate during the Obama years of health insurance mandates and even bragged that he helped get Obamacare passed by serving on President Obama’s council.",
    "“Part of the hope I gather is that we’ll make a system so that I can call in and say there’s evidence besides my testimony that this person is dangerous,” he states.",
    "It’s about winning elections with candidates that aren’t useless RINOs like Liz Cheney and Adam Kinzinger, and are, in fact, conservative, America-first politicians.",
    "If Trump wins in 2024, what exactly will change if he continues to hire and support people that actively want to destroy him and conservative values along the way?",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "Trump issued a statement late last week which uncharacteristically did not simply contain the usual soundbites we’ve become accustomed to in his endorsements.",
    "Read this Next on ThePoliticalInsider.com\nElon Musk Declines Twitter Board Seat, LinkedIn Censors Code Of Vets Founder – Is There Still Hope For Free Speech?",
    "Former President Trump has issued a full-throated endorsement of Mehmet Oz – better known as Dr. Oz – in the Pennsylvania GOP primary for the U.S. Senate.",
    "In the same segment, Dr. Oz goes on to suggest he’d like to see an anonymous call-in system for people to report concerns over others’ social media posts.",
    "In a 2008 interview with the National Review of Medicine, Oz actually argued that his politics would be similar to that of Oprah Winfrey in many aspects.",
    "pic.twitter.com/rBhuW46b4j\n— Dr. Mehmet Oz (@DrOz) April 10, 2022\nTrump Endorsement of Oz is a Bad Move\nBut this isn’t just about winning elections.",
    "Rather, it’s a long-winded effort, seemingly designed to convince GOP voters of why they should support Oz even if he isn’t the perfect candidate.",
    "“We should not be creating obstacles during the difficult time that women have when trying to terminate a pregnancy.”\nAbortion to birth.",
    "Here he is in a 2019 interview stating such laws “help protect you and your family” and have been shown to prevent mass shootings.",
    "Hageman vociferously supported Cheney during her 2016 congressional campaign, and strongly opposed President Trump at the time.",
    "“This is all about winning elections in order to stop the Radical Left maniacs from destroying our country,” Trump said.",
    "Here are just a few of Oz’s views that should have made Trump skeptical enough to never endorse the good doctor.",
    "Oz’s campaign site seems to confirm: “He opposes anti-gun measures like red flag laws and liberal gun grabs.",
    "Dr. Oz knows we cannot compromise our ability to protect ourselves.”\nInteresting thing, those red flag laws.",
    "WATCH: In 2009, Mehmet Oz brags on CNN about chairing President Obama’s council to help pass Obamacare.",
    "Sign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "Too many faux conservatives kneecapped his presidency and continue to destroy his legacy to this day.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "It’s pretty hard for me to fully express how disappointed in Trump I am for endorsing Oz.",
    "The same effort to destroy America just so Democrats can get power back in 2028.",
    "And the two don’t need to be mutually exclusive.",
    "Back off Biden and give us the freedom to Frack!",
    "Oz’s comments on abortion alone are alarming.",
    "“I’m not socially conservative,” he added.",
    "Winning them with actual conservatives is.",
    "NEW PROOF RINO Mehmet Oz is pro-abortion.",
    "“I’m not socially conservative,” Oz said.",
    "Go ahead and look at that clip again.",
    "Winning elections isn’t everything.",
    "It’ll be the same stalled agenda.",
    "The same impeachment proceedings.",
    "Trump should know better.",
    "I couldn’t agree more!"
  ]
}