{
  "id": 5538,
  "mediaId": 6570,
  "date": "2022-04-18",
  "headline": "Pa. U.S. Senate Republican primary: Now we know how much Mehmet Oz and David McCormick are personally spending on their campaigns",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/Transgender-Political-Pawns-2-1650298988.jpg",
  "link": "https://www.post-gazette.com/news/politics-state/2022/04/18/pennsylvania-us-senate-election-republican-primary-election-race-dr-mehmet-oz-david-mccormick-spending-ads-tv/stories/202204180063",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5862,
    5497,
    2802,
    1489,
    190,
    392,
    1126,
    6512,
    6506
  ],
  "sentences": [
    "New financial reports filed Friday reveal in detail how Mehmet Oz and David McCormick, the leading Republican candidates in Pennsylvania’s U.S. Senate race, have spent a combined $18 million from their own personal fortunes to fuel their campaigns and make it the most expensive primary election in the country.",
    "The reports, showing campaign finances through March 31, offer the first in-depth look at Mr. Oz’s campaign funding and the first look of any kind at Mr. McCormick’s because he joined the race in January and didn’t have to file previous disclosures.",
    "Ms. Sands, who previously led a major real estate investment company — yet is only the third-wealthiest Republican in the field — had $603,000 left in her campaign fund, after giving it $3.9 million, including $300,000 in the latest quarter.",
    "Mr. McCormick — who grew up in Pennsylvania but lived for years in Connecticut before moving recently to Pittsburgh — collected about 24% of his donor money from Pennsylvania, the most of any single state, and 23% from New York.",
    "Other donors routinely wrote six- and seven-figure checks to fund the barrage of attack ads that reshaped the race, helping Mr. McCormick cut down Mr. Oz’s initial lead and leave them as the two clear front-runners.",
    "The main one, Honor Pennsylvania, raised $15.3 million since forming in late December, more than any candidate or other PAC focused on the Pennsylvania race — including Democratic frontrunner and Lt. Gov.",
    "Their immense riches, and their willingness to spend, will make it even harder for any of their rivals to catch them as the race enters an expensive homestretch before the May 17 primary.",
    "The two candidates and their allies had already spent $33.8 million on TV through Sunday, with much more slated for the coming weeks, pushing most of their rivals into the background.",
    "But Mr. Mack in 2016 gave more than $130,000 combined to Hillary Clinton, the Democratic National Committee and Democratic group American Bridge as they worked to defeat Mr. Trump.",
    "Here are some key points the reports reveal:\nThe bonkers Oz and McCormick money fight\nThe Republican race has been defined by the eye-popping wealth of Mr. Oz and Mr. McCormick.",
    "Almost all its money, $3 million, came from an entity called Defending America Together, for which there is little public information aside from a mailing address in Phoenix.",
    "The largest donors include Mr. Oz’s father-in-law, fellow heart-surgeon Gerald Lemole Sr., who gave $1 million, and former Morgan Stanley CEO John J. Mack, who gave $600,000.",
    "Money raised by super PACs is considered separately from direct campaign contributions in the analysis because campaigns are legally barred from coordinating with super PACs.",
    "Mr. Mack has also given to Trump critics such as U.S. Rep. Liz Cheney, R-Wyo., and donated $5,800 last year to his home-state senator, Majority Leader Chuck Schumer, D-N.Y.",
    "Her latest round of fundraising was still more than the combined amount raised by Ms. Sands ($103,000) and Montgomery County real estate developer Jeff Bartos ($118,000).",
    "The campaign, super PAC and WinRed reports, filed Friday, cover the first quarter of the year; the Inquirer’s analysis combines those with previous quarterly reports.",
    "The group, American Leadership Action, raised $3.1 million since forming late last year and has spent most all of that, leaving it with just $478,000 as of March 31.",
    "Mr. Oz, citing reporting by The Inquirer, has criticized Mr. McCormick’s allies for taking money from donors he calls “never-Trumpers” and Democratic supporters.",
    "Mr. McCormick, who was until recently CEO of the world’s largest hedge fund, Bridgewater Associates, put almost $7 million of his own money into his campaign.",
    "He also raised $4.3 million in his first three months in the race — the largest amount any candidate, Democrat or Republican, has raised in a single quarter.",
    "Conservative commentator Kathy Barnette had the third-largest haul in the GOP, at $346,000 — far below the stratospheric totals for Mr. Oz and Mr. McCormick.",
    "The one exception: The Fetterman campaign has received a large amount of money through small-dollar direct mail donations that aren’t individually reported.",
    "Mr. Oz and Mr. Mack have professional ties: Mr. Mack has sat on the board of New York Presbyterian Hospital, where Mr. Oz has been a cardiothoracic surgeon.",
    "Out-of-state ties\nThe GOP field has three ultra-wealthy candidates who moved back to Pennsylvania relatively recently, and their donations reflect that.",
    "He recently purchased a home in Montgomery County and, according to his campaign, had been living at his in-laws’ house in that county since late 2020.",
    "About the data\nData come from Federal Election Commission reports filed by campaigns, the online donation platforms ActBlue and WinRed, and super PACs.",
    "Mr. McCormick has also been boosted by an astounding level of spending from independent super PACs backed by his wealthy friends and supporters.",
    "Super PACs can accept donations above the federal limits for donations to candidates, but by law, they can’t coordinate with those campaigns.",
    "That was all before he won former President Donald Trump’s endorsement earlier this month, providing a potential boost in the closing weeks.",
    "Mr. Oz raised $1.7 million from donors in the first three months of this year, the fourth-most among all Pennsylvania Senate candidates.",
    "The haul largely came through top-dollar contributions from his array of friends and supporters in the world of banking and investing.",
    "And $1.25 million more came from Walter W. Buckley, the founder of the Bethlehem, Pa., firm Buckley Muething Capital Management.",
    "Other GOP candidates fade\nWith so much attention on Mr. Oz and Mr. McCormick, other Republicans found it hard to get traction.",
    "Of the money Mr. Oz raised from donors, the largest share — about 27% — came from Florida, where he owns a home in Palm Beach.",
    "For most candidates, that means the data cover all but a small amount of small-dollar donations given directly to campaigns.",
    "Campaigns aren’t required to disclose details on individual donations from contributors giving less than $200 in total.",
    "Because most such small-dollar donations are given online, the ActBlue and WinRed filings fill nearly all of that gap.",
    "Close to half of the group’s money — $7.5 million — is from one fellow hedge fund leader: Kenneth Griffin of Citadel.",
    "A new group attacking Mr. Oz, the Pennsylvania Conservative Fund, raised $3.5 million and spent $3.2 million of it.",
    "Mr. Bartos had $2.4 million left in his campaign fund, having previously kicked in $1.2 million of his own money.",
    "Still, he had the third-smallest share of donor money from within Pennsylvania among candidates in both parties.",
    "Ms. Sands, the former ambassador to Denmark, grew up in Pennsylvania but lived for years in California.",
    "Mr. Oz, who has lived for decades in New Jersey, has faced questions about his ties to Pennsylvania.",
    "John Fetterman, who has been in the race for more than a year and has been a fundraising juggernaut.",
    "The latest data from ActBlue, which files on a different schedule, is available through Feb. 28.",
    "Nearly all of the money for both candidates’ super PACs is coming from outside Pennsylvania.",
    "That accounts for the vast majority of the $13.4 million his campaign has received overall.",
    "(Along with Mr. McCormick’s hedge fund experience, his wife is a Goldman Sachs executive.)",
    "Mr. Oz’s report shows that the celebrity surgeon and former talk show host known as “Dr.",
    "Oz” has given his campaign more than $11 million since joining the race in November.",
    "A super PAC boom\nBut candidate spending is only part of the gusher of GOP cash.",
    "They also pay higher rates for TV time, making their spending less efficient.",
    "If Mr. Oz wins, his victory could cost Mr. Schumer leadership of the Senate.",
    "Carla Sands has the largest percentage of money coming from out of state.",
    "He’s raised 19% within Pennsylvania, according to an Inquirer analysis.",
    "Mr. Oz has his own super PAC, but it has much less financial power.",
    "Two groups behind him had spent $13 million as of March 31.",
    "Almost half of her money from donors is from that state.",
    "Of that, the campaign has spent $10.9 million.",
    "PHILADELPHIA — It’s good to be a front-runner.",
    "First Published April 18, 2022, 9:22am",
    "Ms. Barnette had just $261,000 left.",
    "Or just incredibly wealthy."
  ]
}