{
  "id": 5551,
  "mediaId": 2752,
  "date": "2022-04-11",
  "headline": "Trump Thinks TV Quack Dr. Oz Qualified For Elected Office",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY2MzMwMy9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY2OTM1MjMzM30.7g7g6ryVqDq0DZleVbX8L7P8UM471X-KIYQv3mfDUYY/img.png?width=1200&coordinates=0%2C0%2C0%2C118&height=600",
  "link": "https://www.wonkette.com/trump-somehow-thinks-tv-host-fraud-dr-oz-qualified-for-elected-office",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    5851,
    5732,
    4958,
    2802,
    2765,
    2415,
    2189,
    1138
  ],
  "sentences": [
    "We’re going to take back America, and in 2024, most importantly, we’re going to take back our beautiful, beautiful, beautiful White House.”\nYeah, Trump also declared his 2024 candidacy, when in a just society, he would be plotting his escape from prison with his dimwitted son/henchman Donald Trump Jr. We knew he would likely inflict another presidential campaign upon us.",
    "Oz is the antithesis of everything that made Trump the best president of my lifetime\\u2014he\\u2019s the farthest thing from America First & he\\u2019d be very bad for PAhttps://twitter.com/alexsalvinews/status/1512935809703460865\\u00a0\\u2026\n— Sean Parnell (@Sean Parnell) 1649548432\nI have enormous respect for President Trump.",
    "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA\nParnell is right that \"Senator Dr. Oz\" is a bad prospect for the nation, but so is every other Republican running to replace retiring GOP incumbent Pat Toomey.",
    "Garbage human Sean Parnell, who dropped out of the Pennsylvania Senate race after his ex-wife accused him of abuse, tweeted his disappointment with Trump’s endorsement:\nI have enormous respect for President Trump.",
    "NBC News reported last week:\n“But this isn’t just about what Melania wants,” said [a top Republican familiar with the conversation], who is neutral in the race and was not authorized to speak publicly.",
    "He’s on record as complimenting Hillary Clinton and declaring himself “very pro-choice.” It’s a little unfair to expect people to have held Trump’s current views for longer than he actually has.",
    "This is all very bad news for bland lump of sentient mayonnaise David McCormick, the businessman-turned-candidate who dragged himself to Mar-a-Lago on his knees to beg for Trump’s endorsement.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Oz is hardly the “antithesis” of Trump, who personally hobnobbed with the Hollywood elite and was pro-choice until he decided to run for president.",
    "Trump made his announcement in North Carolina, where most of the audience can’t legally vote in Pennsylvania’s primary, but those are just details.",
    "He’ll probably just deny the words that actually came out of his mouth on live TV if he’s informed that they might upset his grifty apple cart.",
    "Saturday, during his latest coup-coup hate rally, Donald Trump officially endorsed Dr. Mehmet Oz in the GOP Pennsylvania Senate primary.",
    "In conclusion, Donald Trump is still just great at making politically strategic endorsements, and so is Melania Trump, the end.",
    "Reportedly, Trump’s most “fervent supporters” aren’t sold on Dr. Oz as a reliable “America First” Republican candidate.",
    "It’s a nice courtesy to networks like us who work hard to provide coverage of Trump-endorsed candidates like yourself.\"",
    "The Right Side Broadcasting Network, which airs this crap live, was miffed: \"We know our videos when we see them.",
    "He’s cozied up to the dreaded Hollywood elite and has only recently realized how much he opposes abortion rights.",
    "That’s not actually news, but there are all sorts of campaign finance issues related to his making it official.",
    "If success on television equaled political support, then Democrats should consider running Dr. Meredith Grey.",
    "[New York Magazine / NBC News]\nYr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "McCormick had once championed diversity and inclusion as Bridgewater CEO, but went full-on MAGA to no avail.",
    "Former Trump adviser Hope Hicks was on McCormick’s team, along with Gollum impersonator Stephen Miller.",
    "PREVIOUSLY: Trumpy Senate Candidate Sean Parnell Seems ... Like Someone Trump Would Endorse All Right!",
    "The gerbil-brained former president continued, “This is the year we’re gonna take back the House.",
    "Trump's endorsement thrilled Dr. Oz so much he posted the video without the broadcaster’s logo.",
    "There are a lot of women, in whose living room and bedroom TVs Dr. Oz has been for a decade.",
    "Why are these women watching Dr. Oz in their bedroom TVs during the middle of the afternoon?",
    "I was honored to have his endorsement in PA. \\nTwice\\nBut I\\u2019m disappointed by this.",
    "Trump declared, “By the way, I endorsed another person today: Dr. Oz in Pennsylvania.",
    "I was honored to have his endorsement in PA.\nTwice\nBut I’m disappointed by this.",
    "They have a very personal relationship with Dr. Oz.”\nWhat kind of image is this?",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "I don’t think Dr. Oz hosted a late-night show with smooth jazz.",
    "When you’re in television for 18 years, that’s like a poll.\"",
    "He's also on the board of the Portland Playhouse theatre.",
    "Apparently, Melania Trump is also a big fan of Dr. Oz.",
    "Dr. Oz himself is barely a Pennsylvania resident.",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able.",
    "Next time, please leave up the graphics.",
    "“There are a lot of Melanias out there.",
    "We’re going to take back the Senate.",
    "How often would you like to donate?",
    "And they liked him for a long time.",
    "(He’s crashing with his in-laws.)",
    "Tremendous, tremendous career.",
    "He writes reviews for the A.V.",
    "That’s nothing like a poll.",
    "Great guy, good man.",
    "That’s like a poll.",
    "Harvard-educated.",
    "That's you!",
    "Dr. Oz."
  ]
}