{
  "id": 5568,
  "mediaId": 2589,
  "date": "2022-04-10",
  "headline": "Why did Trump endorse Dr. Oz? One person's support may hold the answer",
  "image": "https://media.townhall.com/townhall/reu/o/2021/341/b532d24a-8a83-4a05-9ce2-96dff7366954-1110x740.jpg",
  "link": "https://hotair.com/karen-townsend/2022/04/10/why-did-trump-endorse-dr-oz-one-persons-support-may-hold-the-answer-n461329",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Townsend",
  "authorUrl": "https://hotair.com/author/karen-townsend",
  "termIds": [
    5644,
    5851,
    5862,
    4345,
    4958,
    4844,
    2802,
    2765,
    2540,
    2599
  ],
  "sentences": [
    "Steve Bannon, a former White House chief strategist to Trump, ripped into Oz on his podcast recently: “How does Dr. Oz, probably the most anti-MAGA guy, and you got Fox nonstop pimping this guy out and Newsmax pimping this guy out, and that’s what it is — how does Dr. Oz, from New Jersey, [Turkish President Recep Tayyip] Erdogan’s buddy, floating in from Jersey, how does he become a factor in a Senate race in the commonwealth of Pennsylvania?”\nJack Posobiec, a far-right personality who was a guest on Bannon’s show at the time, responded: “This guy wasn’t around in 2020, and he certainly wasn’t around in 2016.",
    "Spencer Kimball, Executive Director of Emerson College Polling noted, “McCormick has a strong base of support across most demographics, whereas Oz seems to lack a clear base.”\nRepublicans are still waiting for former President Trump to weigh in on the race and a majority of voters say they would support a Trump-endorsed candidate.",
    "We’ll see if Trump’s endorsement makes a difference.”\nTeam McCormick includes former Trump White House staffers Hope Hicks and Stephen Miller, as well as ex-Trump campaign adviser David Urban and Trump White House lawyer Jim Schultz.",
    "They have a very personal relationship with Dr. Oz.”\nTrump agrees that Oz’s television success with his daytime audience is a good indication that he can be successful in the race.",
    "Several days after Trump and Melania had dinner with Oz and his wife, Lisa, at Mar-a-Lago in March, Trump asked the crowd at an American Freedom Tour event if they liked Dr. Oz.",
    "In a poll of 1,000 likely Republican Pennsylvania voters, former hedge fund CEO McCormick finished first with 17.8%, followed by the former television personality Oz with 16.6%.",
    "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S.",
    "Senator for Pennsylvania I will only be a U.S. citizen.”…\nOz has been a longtime resident of New Jersey, no doubt due to filming his television show.",
    "“My dual citizenship has become a distraction in this campaign,” Oz, also a U.S. citizen who was born in Ohio, said in a statement from his campaign.",
    "When undecided voters were asked they are leaning towards at this time, McCormick’s lead increased to 27.2%, followed by Mehmet Oz with almost 20.6%.",
    "Wow, that’s news I think to everybody else in the entire movement.”\nMcCormick has made Oz’s dual citizenship with Turkey a campaign issue.",
    "The two front runners in the Pennsylvania Republican primary running for a seat in the U.S. Senate are Dr. Mehmet Oz and David McCormick.",
    "“But this isn’t just about what Melania wants,” said the source, who is neutral in the race and was not authorized to speak publicly.",
    "A new WHTM/Emerson College Polling/The Hill Pennsylvania primary poll shows McCormick with a lead over Oz, though it is a small one.",
    "And that matters,” said a top Republican familiar with the conversation inside Trump’s orbit at his Mar-a-Lago club in Palm Beach.",
    "He’s CEO of one of the world’s largest hedge funds and a former senior official in President George W. Bush’s administration.",
    "When he was asked about the Trump endorsement of Dr. Oz he said, “I think we have a good choice of nominees in that race.",
    "He is a Pennsylvania native, though, and reestablished residency there by purchasing a house in Pittsburgh’s East End.",
    "He and his wife Dina Powell lived in that area before McCormick left in 2005 to serve in the Bush administration.",
    "But suddenly he found his road to Damascus conversion, and he’s been this conservative in hiding the entire time?",
    "Last week’s poll found that 61% of Pennsylvania Republican voters would support Trump’s endorsed candidate.",
    "The second reason Trump endorsed Oz may be because McCormick has the support of establishment Republicans.",
    "Why did he choose Dr. Oz, a television personality whose national career was launched by Oprah Winfrey?",
    "Team Oz includes Sean Hannity and casino mogul Steve Wynn, both of whom lobbied Trump on behalf of Oz.",
    "Trump’s opinion is that since Oz has hosted his own show for years on television, he must be popular.",
    "The simple one that Melania Trump is a big fan of Dr. Oz and encouraged her husband to endorse him.",
    "Kathy Barnette finished third with 10.2%, followed by Jeff Bartos at 8.9% and Carla Sands at 7.7%.",
    "He endorsed Sean Parnell but Parnell dropped out after claims of abuse surfaced from his ex-wife.",
    "The question is whether or not that popularity translates into votes in the Republican primary.",
    "For a man who values loyalty as much as Trump does, he went the other way in this endorsement.",
    "During the Trump administration, she was a deputy national security adviser to the president.",
    "He recommended that Trump lose some weight but overall delivered a positive report on Trump.",
    "There are a lot of women, in whose living room and bedroom TVs Dr. Oz has been for a decade.",
    "Oz has pledged to renounce his Turkish citizenship if he wins the election in November.",
    "Senate Minority Leader Mitch McConnell was interviewed on Fox News Sunday this morning.",
    "Among the undecided voters, Oz finished fourth behind McCormick, Bartos, and Barnette.",
    "On Saturday Trump made his decision known by announcing his endorsement of Dr. Oz.",
    "Trump often refers to her as a top advisor, someone whose opinion he values.",
    "Perhaps Trump is repaying Oz for support in the 2016 presidential campaign.",
    "There are other candidates besides Oz and McCormick in the GOP primary.",
    "The catch here is that many people in Trump World support McCormick.",
    "“The first lady has let the president know that she likes Dr. Oz.",
    "Both men were lobbying hard for the endorsement of Donald Trump.",
    "Oz had Trump on The Dr. Oz Show and conducted a health check-up.",
    "Carla Sands, by the way, was Trump’s U.S. ambassador to Denmark.",
    "George Bochetto received 3.8% and Sean Gale finished with 2.5%.",
    "She also worked in the Bush administration as well as the RNC.",
    "Trump’s first endorsement in the race didn’t end well.",
    "The crowd is reported to have cheered and applauded.",
    "The endorsement has created a chasm in Trump World.",
    "Nearly 33% of voters reported they were undecided.",
    "McCormick has lived in Connecticut since 2009.",
    "Don’t underestimate Melania’s influence here.",
    "The primary election will be held on May 17.",
    "Does the name Dina Powell sound familiar?",
    "“There are a lot of Melanias out there.",
    "“Does anybody like Dr. Oz?,” he asked.",
    "Some are speaking out against Dr. Oz.",
    "There are a couple of answers here.",
    "That’s a bit awkward, right?"
  ]
}