{
  "id": 5584,
  "mediaId": 2548,
  "date": "2022-04-09",
  "headline": "Trump Endorses Dr. Mehmet Oz In Pennsylvania GOP Senate Primary",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/04/mehmet-oz-scaled-e1649550424161.jpg",
  "link": "https://dailycaller.com/2022/04/09/donald-trump-endorses-mehmet-oz-pennsylvania-senate/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Ginsberg",
  "authorUrl": "https://dailycaller.com/author/michael.b.ginsberg1998@gmail.com",
  "termIds": [
    2765,
    2802,
    1489,
    1131,
    1126,
    392,
    6512,
    6506,
    6240
  ],
  "sentences": [
    "pic.twitter.com/kWJl7ll2vb\n— Taylor Budowich (@TayFromCA) April 9, 2022\nOz has stressed his opposition to COVID-19 restrictions and mandates in campaign appearances, claiming in his campaign announcement video that the U.S. “lost too many lives, too many jobs, and too many opportunities because Washington got it wrong.”\nOz has faced criticism from some conservatives over previous show segments on transgender issues, which were praised by the LGBTQ organization GLAAD.",
    "(RELATED: Child Sex Change Treatments Are A Hill Some LGBT Activists Are Will To Die On)\nMcCormick, who also competed for Trump’s endorsement, called on Oz to renounce his Turkish dual-citizenship, citing his alleged ties to the country’s government as a potential national security threat.",
    "“He will do very well in Philadelphia and Pittsburgh, where other candidates will just not be accepted.”\n45: @DrOz is smart, tough, and will never let you down, therefore, he has my Complete and Total Endorsement.",
    "“Perhaps most importantly, I believe that Mehmet Oz will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump added.",
    "The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,” Trump said in a statement.",
    "Former President Donald Trump announced his support for Dr. Mehmet Oz on Saturday, a key endorsement in the wide-open Pennsylvania Republican Senate primary.",
    "Oz, who hosted The Dr. Oz Show on several stations beginning in 2009, announced his candidacy to replace retiring Republican Sen. Pat Toomey in November.",
    "Parnell suspended his campaign in the aftermath of a divorce and custody battle, which included allegations of domestic violence.",
    "He is polling behind former Bridgewater Associates CEO David McCormick, although recent surveys have shown a tightening race.",
    "“This is all about winning elections in order to stop the Radical Left maniacs from destroying our Country.",
    "He hosted a doctor who promotes hormone replacement and sex change operations for children in 2013.",
    "His professional ties to China and major pharmaceutical companies have also come under scrutiny.",
    "Trump previously endorsed Army captain Sean Parnell in the race.",
    "Oz has pledged to do so should he win the general election.",
    "His show ended in January following his declaration.",
    "our Country needs you!",
    "Good luck, Dr. Oz."
  ]
}