{
  "id": 5781,
  "mediaId": 6746,
  "date": "2022-04-14",
  "headline": "Hunter Biden's Wealth: How Rich Is the President's Son After Business Dealings Unearthed?",
  "image": "https://1075914428.rsc.cdn77.org/data/images/full/270044/hunter-bidens-wealth-how-rich-is-the-presidents-son-after-business-dealings-unearthed.jpg",
  "link": "https://www.hngn.com/articles/241562/20220414/hunter-biden-wealth-rich-president-joe-biden-son-business-dealings-unearthed.htm",
  "mediaOutlet": "hngn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madz Dizon",
  "authorUrl": "https://www.hngn.com/reporters/madz-dizon",
  "termIds": [
    2938,
    3858,
    4905,
    2440
  ],
  "sentences": [
    "Hunter Biden, President Joe Biden's second son, has had a varied adult life with many professions and business interests and has become more of a public presence in recent years due in part to his father's successful presidential campaign.",
    "Despite the low sales, Biden informed Bryony Gordon of the Mad World podcast that he would be writing a sequel on his marriage to Melissa Cohen, who helped him overcome his crack addiction and stay clean.",
    "The gallerist will not discuss information about purchases or prospective buyers, including their identities, with Hunter Biden or the administration, according to White House press secretary Jen Psaki.",
    "Hunter Biden received a $2 million advance from Simon & Schuster for his memoir 'Beautiful Things,' which sold just 10,600 copies in its first week, in addition to his consulting pay and his company.",
    "Hunter Biden, best known as the son of the US President, now works with hedge funds and venture capitalists, leveraging his extensive expertise as a lobbyist with close links to Washington politics.",
    "This would assist in avoiding actual or apparent conflicts of interest with bidders who could try to acquire the artwork to earn political favor with the administration, Yahoo Finance reported.",
    "Hunter Biden's Secret Business Deals\nCelebrityNetWorth.com uncovered records on Hunter Biden's laptop that revealed he made $833,000 in 2013, $847,000 in 2014, and $2.5 million in 2016.",
    "The 52-year-old has worked as a banker, lobbyist, and investor in addition to serving in the military, but it is believed that he amassed most of his money during his time as a lawyer.",
    "He's had drug and alcohol problems for a long time, and he blames them on the loss of his mother and sister in a car accident in 1972, according to his biography 'Beautiful Things.'",
    "His first position after graduating from Yale Law School in 1996 was with MBNA, a bank holding corporation that was a big donor to his father's Senate campaigns at the time.",
    "Hunter Biden may have also made money as a professional artist, selling his works on paper and canvas for $75,000 to $500,000 apiece through a New York gallery.",
    "During the Clinton administration, he worked in the US Department of Commerce before being named to the Amtrak board of directors by President George W. Bush.",
    "Hunter's aspirations were jeopardized by the loss of his brother, Beau, in 2015, and he has acknowledged a serious relapse in recent years, according to AS.",
    "He was appointed as part of a program to bring certain coveted capabilities to the military, and his age and prior drug-related offenses were waived.",
    "In 2019, Biden claimed to be living on barely $4,000 per month while paying $37,000 in alimony and child support to his ex-wife Kathleen Buhle.",
    "He has maintained extended periods of abstinence throughout his adult life and has visited rehabilitation facilities to aid in that endeavor.",
    "He was issued an administrative dismissal from the military after testing positive for cocaine during a urine test the following month.",
    "Hunter Biden stated in public that he had taken a cocaine-laced cigarette by mistake, but he opted not to challenge his dismissal.",
    "Hunter Biden's net worth is estimated to be over $1 million by 2021, according to net worth researchers Wealthy Gorilla.",
    "He applied to the US Navy Reserve after working in the lobbying sector and was approved in May 2013 at the age of 43.",
    "Related Article: Elon Musk Net Worth 2022: Tesla CEO's Value Grew from $2 Billion to $279 Billion in 10 Years!",
    "He gave up $320,000 of his money in 2020 to pay back delinquent federal taxes.",
    "If any of the artwork was sold, the gallery did not report it.",
    "Who is Hunter Biden?"
  ]
}