{
  "id": 5786,
  "mediaId": 2741,
  "date": "2022-04-15",
  "headline": "Donald Trump Laments Having No Time to Lose Weight",
  "image": "https://media.vanityfair.com/photos/6224ed983b4f9b2db0035fff/16:9/w_1280,c_limit/Donald-Trump.jpg",
  "link": "https://www.vanityfair.com/news/2022/04/donald-trump-weight-loss-doctor-oz",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bess Levin",
  "authorUrl": "https://www.vanityfair.com/contributor/bess-levin",
  "termIds": [
    0
  ],
  "sentences": [
    "Zelenskyy asks Biden to designate Russia a state sponsor of terrorism (The Washington Post)\nPfizer to soon pursue COVID boosters for kids (Politico)\nFeinstein pushes back on lawmakers’ accounts that she is mentally unfit (The Washington Post)\nFlorida Proposes “Race-Neutral” Congressional Map That Is Incredibly Racist (Jezebel)\nRick Scott’s Ultra-MAGA Agenda Gives Democrats a Midterm Lifeline (Intelligencer)\nMeet the activists who projected a giant Ukrainian flag on Russia’s Embassy in D.C. (NPR)\nOnlyFans model claims to be a witch who dreamt dad’s murder before he was shot (Mirror)\n— Inside the Virus-Hunting Nonprofit at the Center of the Lab-Leak Controversy\n— Jared Kushner and Donald Trump Probably Won’t Be Splitting a Milkshake Anytime Soon\n— CNN Leaves the Drama Behind With Focus on War in Ukraine\n— Trump’s Truth Social Is an Even Bigger Humiliation Than Previous Business Failures\n— The Clock Is Ticking on the January 6 Investigation\n— The Washington Post Checks In, Finds Trump Is Still a Lying Sociopath\n— A Ukrainian Woman Explains the War to Europe’s Skeptics\n— From the Archive: How Playboy Imran Khan Became the Prime Minister of Pakistan\n— Not a subscriber?",
    "Jen Psaki has thoughts about Peter Doocy\nGreg Abbott can’t even get props from The Wall Street Journal editorial board for his anti-immigration stunt\nThe notoriously conservative bunch—which has rejected the consensus on climate change, let Trump push his election lies in its pages, and embraced right-ring culture wars—is not down with the the Texas governor’s dumb idea to protest the Biden administration’s decision to let asylum seekers cross the border.",
    "A few years back, Donald Trump’s weight was in the news when then White House doctor Ronny Jackson claimed that the results of the 45th president’s physical showed he weighed 239 pounds, a stat many people were skeptical of (in addition to the claims by Jackson that Trump had “incredibly good genes” and that there was a scenario in which the doctor could have seen him living to be “200 years old”).",
    "“And to use a favorite term that all of you people really came up with: We will stop the steal.”\nMr. Miller rebutted the implication that the word “we” indicated that Mr. Trump was trying to incite the crowd to action, one of the people said, arguing that it has been used in political speech for decades, including by President John F. Kennedy in reference to the moon landing.",
    "Dr. Oz has said, ‘You should lose weight.’ I said, ‘I don’t have time to lose weight.’” In his endorsement of Oz on Saturday, Trump wrote in a statement, “He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!",
    "Stephen Miller’s January 6 committee interview goes exactly as expected\nIf you expected the right-wing purveyor of evil to simultaneously insist that the 2020 election was stolen and that Trump had nothing to do with the violence that went down at the Capitol.",
    "Per a video posted by the anonymously run Twitter account PatriotTakes, Trump told supporters that the TV doctor, whom he endorsed over the weekend in the Pennsylvania Republican Senate primary, recommended he lose weight.",
    "Last month, Miller, the architect of the Trump administration’s family-separation plan, sued to block the January 6 committee from obtaining his phone records, citing the fact that he is on a family plan with his parents.",
    ").”\nFor most of his life, Trump famously had a terrible diet, with a preference for Big Macs, meatloaf, and KFC; incidentally, Dr. Jackson once said White House staff had to sneak vegetables into his food.",
    "Per The New York Times:\nAmong the most contentious exchanges were over a draft of the speech Mr. Trump delivered that morning at a so-called Stop the Steal rally near the White House….",
    "The 45th president has also expressed some extremely unorthodox views on exercising, like that the human body has a finite amount of energy, which physical exertion can only deplete.",
    "Now the ex-president’s weight is once again in the spotlight because, according to him, he’s been advised to slim down—by none other than celebrity doctor Mehmet Oz.",
    "“This is not solving the border problem, it is increasing the cost of food and adding to supply-chain shortages,” says Texas Agriculture Commissioner Sid Miller.",
    "Republicans and some Democrats running for re-election warn that lifting the policy in May without a backup plan could lead to a surge of illegal immigration.",
    "In now seemingly related news, Trump told The Washington Post earlier this month that his health would play a factor in his decision to run again in 2024.",
    "Mr. Miller, the people familiar with his appearance said, argued that the election had been stolen, claiming that there were several examples of fraud.",
    "During remarks in which he was, for unclear reasons, talking about “women weight lifters,” Trump asked the crowd: “Can you believe I weigh 208?",
    "Fair point, but his truck inspections are costing Texans and Americans dearly while doing nothing to secure the border.",
    "Thousands of trucks are backed up at the border, and commercial traffic has dropped 60% at some ports since last week.",
    "(“You are going to die young because of this,” he reportedly once told an employee training for an Ironman race.)",
    "“Texas should not have to bear the burden of the Biden Administration’s failure to secure our border,” he says.",
    "You look like you’re in good health, but tomorrow, you get a letter from a doctor saying come see me again.",
    "“Such a misguided program is going to quickly lead to $2 lemons, $5 avocados and worse.”\nWay to go, Greg!",
    "Another point of contention with Mr. Miller was Mr. Trump’s false claims of widespread ballot fraud.",
    "If you would like to receive the Levin Report in your inbox daily, click here to subscribe.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "“We will not take it anymore, and that’s what this is all about,” Mr. Trump said.",
    "In response Mr. Abbott has apparently decided to impose his own border control.",
    "Mr. Trump repeatedly used the word “we” in his remarks that day.",
    "That’s not good when they use the word again,” he said.",
    "It looks like we're experiencing playback issues.",
    "“You always have to talk about health.",
    "Now maybe a little more.",
    "Elsewhere!",
    "Our bad!"
  ]
}