{
  "id": 5793,
  "mediaId": 6598,
  "date": "2022-04-09",
  "headline": "Trump endorses Oz in key Senate race",
  "image": "https://static.politico.com/05/8b/690ef2434fb8aeb9bb56545e79d7/211209-oz-getty-1160.jpg",
  "link": "https://www.politico.com/news/2022/04/09/trump-leans-toward-dr-oz-in-pennsylvania-senate-race-00024272",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5851,
    5732,
    5862,
    4958,
    4540,
    4844,
    4345,
    4284,
    2765,
    2802,
    1489
  ],
  "sentences": [
    "Steve Bannon, a former White House chief strategist to Trump, ripped into Oz on his podcast recently: “How does Dr. Oz, probably the most anti-MAGA guy, and you got Fox nonstop pimping this guy out and Newsmax pimping this guy out, and that’s what it is — how does Dr. Oz, from New Jersey, [Turkish President Recep Tayyip] Erdogan’s buddy, floating in from Jersey, how does he become a factor in a Senate race in the commonwealth of Pennsylvania?”\nJack Posobiec, a far-right personality who was a guest on Bannon’s show at the time, responded: “This guy wasn’t around in 2020, and he certainly wasn’t around in 2016.",
    "In a key contest in the battle for the Senate majority this fall, the former president announced Saturday that he is backing Oz, praising the celebrity television doctor in a statement as “Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts, and will always fight for and support our under-siege Second Amendment.”\nPOLITICO previously reported that he had been leaning toward Oz, according to three people familiar with Trump’s thinking, speaking on the condition of anonymity.",
    "A person close to Trump, discussing the former president’s thinking on the Pennsylvania endorsement, noted a phrase that Trump has often repeated when talking about Oz: “He’s been on TV in people’s bedrooms and living rooms for years.”\nTrump at times has used a variation of that phrase, emphasizing in conversations that Oz has “been in women’s bedrooms” for years as they watched his daytime television program, something Trump believes would help Oz win suburban voters.",
    "“However, the major difference is that no candidate, especially one like Oz with an extensive anti-MAGA track record, will be able to galvanize grassroots voters like Trump has done in epic fashion.”\n“President Trump’s continued popularity across Pennsylvania is undeniable, and Dave is proud to be aligned with his America First agenda,” said McCormick spokesperson Jess Szymanski.",
    "Before Trump’s announcement, Fredericks said that Trump’s decision would be based on “what’s best for the country” and which candidate was most closely aligned with “America First policies,” before ripping into McCormick for his work as a hedge fund executive and his ties to the George W. Bush administration.",
    "“Something the president understands intimately because it was key to his rise.”\nMelania Trump’s support for Oz “reinforces that belief and the value of those intangibles” that a celebrity like Oz has, despite McCormick “in some ways being the more impressive candidate,” according to the person.",
    "Fredericks, who met Oz at CPAC in February and just endorsed him, opened the interview with a question about whether Oz is a “MAGA candidate.”\n“He’s a good man, too,” Trump said, describing his positive experience appearing on Oz’s television show for a health check-up during the 2016 election.",
    "Wow, that’s news I think to everybody else in the entire movement.”\nAs host of “The Dr. Oz Show,” Oz in 2016 had then-candidate Trump onto his program to conduct a health check-up, a decision criticized by some as a political stunt and a favor to Trump, who received a mostly positive report.",
    "Jim Worthington, a Pennsylvania Republican appointed by Trump to the President’s Council on Sports, Fitness & Nutrition, along with Oz, told POLITICO earlier this week that he’d spoken with Trump about Oz on several occasions, including most recently Sunday afternoon at Mar-a-Lago.",
    "| Riccardo Savi/Getty Images for Concordia Summit\nBy Holly Otterbein and Natalie Allison\n 04/09/2022 06:44 PM EDT\nUpdated: 04/09/2022 08:10 PM EDT\nDr. Mehmet Oz has won the race for Donald Trump’s coveted endorsement in Pennsylvania’s Senate GOP primary.",
    "But Oz’s success or failure at the polls will also be closely watched as a test of Trump’s own hold on the party ahead of the 2024 presidential election, particularly since some of his candidates have faced challenges this year.",
    "“You ask them, ‘What do you know about Mehmet Oz?’ They’re telling you he’s a Hollywood liberal.”\nHowever, Oz’s campaign released an internal poll showing a different result, with him at 24.8 percent and McCormick at 21.6.",
    "“I’ll be making a decision on that one.” Trump said a decision would come “maybe fairly soon.”\nIn an interview, Fredericks declined to provide details on any private conversations he had with Trump ahead of their talk.",
    "McCormick also hired former Trump White House staffers Hope Hicks and Stephen Miller, and ex-Trump campaign adviser David Urban and Trump White House lawyer Jim Schultz helped McCormick launch his Senate bid.",
    ").”\nMcCormick and Trump met at Mar-a-Lago this past week for an hour, and had a “very productive” meeting that touched on his fundraising, polling and ads, according to a person familiar with their talk.",
    "“It’s understandable that Trump views Oz’s name ID and celebrity status as positive attributes since he launched his 2016 presidential campaign in the same way,” said a former Trump campaign aide.",
    "While Oz started the primary with a clear lead and officially announced his candidacy a month and a half ahead of McCormick, several surveys show the dynamics of the race have since changed.",
    "On Oz’s side are Fox News host Sean Hannity and casino mogul Steve Wynn, who both actively lobbied for Trump to endorse the celebrity doctor, according to people familiar with their efforts.",
    "In his statement endorsing Oz, Trump said, “He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!",
    "Oz and his wife, Lisa, had dinner with the former president and Melania Trump on March 16, a meal at Mar-a-Lago that lasted several hours, according to a person aware of the meeting.",
    "Other candidates in the Republican primary include Carla Sands, a former ambassador under Trump; Kathy Barnette, a conservative commentator; and Jeff Bartos, a real estate developer.",
    "Three days later, while speaking to an American Freedom Tour crowd in Ft. Lauderdale, Trump brought up the Pennsylvania Senate race and mentioned the celebrity television doctor.",
    "Conservative commentator John Fredericks, a Trump friend who served as his Virginia campaign chair in 2016 and 2020, had the former president on his radio show Wednesday.",
    "Some of Trump’s allies have strong opinions on the primary in Pennsylvania, and he risks upsetting friends in choosing Oz, just as he would have had he backed McCormick.",
    "Jim McLaughlin, McCormick’s pollster, said the campaign’s latest internal poll found the former business executive at about 25 percent and Oz at 14 percent.",
    "The choice between Oz and McCormick was even more fraught for the former president because Trumpworld is divided over the two front-running candidates.",
    "With his loyal base and unparalleled popularity among Republican voters, Trump’s decision to pick Oz could have a significant impact on the contest.",
    "In Pennsylvania, Trump initially endorsed Sean Parnell for the Senate seat before Parnell dropped out amid claims of abuse from his estranged wife.",
    "Rob Gleason, a McCormick supporter and former chair of Pennsylvania’s Republican Party, also met recently with Trump at Mar-a-Lago, a source said.",
    "Trump recently met with both Oz and former hedge fund CEO David McCormick in Mar-a-Lago and talked with multiple people about the GOP primary.",
    "An early March Fox News poll had McCormick winning 24 percent and Oz at 15 percent, but another recent poll found a dead heat.",
    "But suddenly he found his road to Damascus conversion, and he’s been this conservative in hiding the entire time?",
    "“Does anybody like Dr. Oz?” Trump asked the crowd gathered in Florida, receiving cheers and applause.",
    "“There’s a certain level of trust usually associated with that,” the person said of Oz’s TV career.",
    "McCormick and Oz, as well as their allies, had been locked in a battle for months over Trump’s nod.",
    "With the primary contest still unsettled, Trump’s decision to endorse is a potential risk.",
    "Dina Powell, McCormick’s wife, served as Trump’s deputy national security adviser.",
    "And, perhaps most notably, Melania Trump is a supporter of Oz in the Senate race.",
    "“I can tell you the president is definitely fond of Oz, for sure,” he said.",
    "“Republican primary voters in Pennsylvania have totally seen through him.",
    "McCormick served as under secretary in Bush’s Department of Treasury.",
    "Dr. Mehmet Oz speaks onstage during the 2021 Concordia Annual Summit.",
    "But other Trump allies are using their platforms to criticize Oz.",
    "They understand he’s not a Pennsylvania conservative,” he said.",
    "He also said Oz has an unfavorable rating of 51 percent.",
    "“He’s a high-quality guy, he is,” Trump continued."
  ]
}