{
  "id": 5877,
  "mediaId": 6497,
  "date": "2022-04-18",
  "headline": "John Oliver Takes on Dr. Oz and His “Sh— Show” Senate Campaign on ‘Last Week Tonight’",
  "image": "https://www.hollywoodreporter.com/wp-content/uploads/2022/04/john-oliver_5-H-2022.jpg?w=1024",
  "link": "https://www.hollywoodreporter.com/tv/tv-news/john-oliver-dr-oz-senate-campiagn-1235131356/",
  "mediaOutlet": "Hollywood Reporter",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kimberly Nordyke",
  "authorUrl": "https://www.hollywoodreporter.com/author/kimberly-nordyke/",
  "termIds": [
    4905,
    5474,
    2765,
    2802,
    1489,
    6506
  ],
  "sentences": [
    "The first growl in that clip is like hearing the sound of a cranky lawnmower you know is about to sexually harass you.”\nAs for the claim that being on TV is like a poll showing that people like someone, Oliver quipped that he’s been on American TV for 16 years and yet gets all sorts of negative comments on his YouTube channel, including “I hope he stops soon,” “why is less fun mr. bean so mad?” and “the most unwatchable thing on television, why does he always look sick?”\n“I don’t know!” Oliver said.",
    "Oliver also showed a clip of Oz buying vegetables for a crudité — broccoli, carrots, asparagus, guacamole, salsa — where he pointed out the expensive costs and said, “We’ve got Joe Biden to thank for this.” Oliver noted that Oz not only got the name of the store he was at wrong, but also was creating a “slap-dash crudité nightmare” with all the wrong ingredients.",
    "“But what he doesn’t get to do, though, is stand in front of gas pumps and pretend he’s personally affected by those numbers.”\nMeanwhile, Oliver noted that his staff has added a sign to the aforementioned alligator should any of Oz’s staff return to the office to gather their things: “I’m sorry, he seems like a fucking nightmare,” it reads.",
    "“It’s a little weird for him to act like it’s specifically straining his budget, but maybe he’s only posting those videos to push slightly less relatable content further down his page,” Oliver said, showing as an example a TikTok video of Oz wake-surfing in Italy with the song “My Life Be Like (Ooh-Aah)” playing over the video.",
    "In fact, Oz’s daytime show (which ended amid Oz’s Senate run) had its office directly across from the Last Week Tonight offices, and the latter staff erected a giant alligator giving the middle finger facing Oz’s office.",
    "But it has, Oliver said, calling it a “shit show.”\nThat includes the fact that Oz has for years lived in New Jersey and based his TV show offices in New York, not Pennsylvania, where he is running for office.",
    "“That means people like you, but he’s a great guy.”\nIn response, Oliver noted on Sunday night’s Last Week Tonight that he “hadn’t heard [Trump’s] voice in a while and to be honest, I really haven’t missed it.",
    "The HBO late night talk show host showed a clip of the former president endorsing Oz ahead of the state’s Republican primary, in which Trump noted that Oz had been on TV for 18 years.",
    "Turning to Oz, Oliver noted that he’s addressed the former’s “daytime snake-oil carnival in detail” before, adding he didn’t think Oz’s campaign could surprise him.",
    "Not surprisingly, Donald Trump’s endorsement of Dr. Mehmet Oz in the Pennsylvania Senate — and Oz’s campaign itself — aren’t sitting well with John Oliver.",
    "Oliver added that Oz also has been trying to connect with voters over high prices by talking about the price of gas, blaming Biden for that as well.",
    "“That is what his like ‘be like’ because he’s fucking rich, which means he gets to do stuff like that,” said Oliver.",
    "But, Oliver noted, Oz is reportedly worth $104 million and shouldn’t personally be worrying about the cost of gas.",
    "“When you’re on television for 18 years, that’s like a poll,” Trump said at a recent rally."
  ]
}