{
  "id": 6016,
  "mediaId": 2526,
  "date": "2022-04-09",
  "headline": "Donald Trump Endorses Mehmet Oz in Pennsylvania U.S. Senate Race",
  "image": "https://media.breitbart.com/media/2022/03/Dr.-Oz-Honored-With-Star-On-The-Hollywood-Walk-Of-Fame-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/09/donald-trump-endorses-mehmet-oz-in-pennsylvania-u-s-senate-race/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    2802,
    2765,
    4958,
    1489,
    6506,
    6678
  ],
  "sentences": [
    "“I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.”\nTrump touted the “thousands of life-saving heart operations” Oz has performed throughout his medical career and the eight New York Times bestsellers he authored.",
    "pic.twitter.com/kWJl7ll2vb\n— Taylor Budowich (@TayFromCA) April 9, 2022\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,” Trump said.",
    "Trump said his endorsement of Oz is “all about winning elections in order to stop the Radical Left maniacs from destroying our Country.”\n45: @DrOz is smart, tough, and will never let you down, therefore, he has my Complete and Total Endorsement.",
    "Former President Donald Trump endorsed celebrity doctor Mehmet Oz in Pennsylvania’s U.S. Senate Race on Saturday after his initial pick, Sean Parnell, dropped out amid a contentious custody battle with his estranged wife last fall.",
    "Trump said:\nDr. Oz is Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts, and will always fight for and support our under-siege Second Amendment.",
    "Trump said:\nPerhaps most importantly, I believe that Mehmet Oz will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.",
    "“He knows his job is to serve every single Pennsylvanian Dr. Oz is smart, tough, and will never let you down, therefore, he has my Complete and Total Endorsement,” Trump concluded.",
    "Trump also pointed to Oz’s pro-life views and his strengths on the border, election fraud, and the military as reasons for his endorsement.",
    "Trump believes that Oz would be the most electable candidate to defeat the Democrat challenger in the November midterm elections.",
    "our Country needs you!”\nRecent polls found that Oz is trailing businessman David McCormick, the current frontrunner in the race.",
    "Dr. Oz also passionately believes in high-quality education and protecting parent involvement throughout the process.",
    "Likewise, he will do very well in Philadelphia and Pittsburgh, where other candidates will just not be accepted.",
    "Women, in particular, are drawn to Dr. Oz for his advice and counsel.",
    "He will ensure America will become Energy Independent again.",
    "The Pennsylvania GOP Senate primary takes place on May 17.",
    "They know him, believe in him, and trust him.",
    "I have seen this many times over the years.",
    "our Country needs you!",
    "“Good luck, Dr. Oz.",
    "Good luck, Dr. Oz."
  ]
}