{
  "id": 6178,
  "mediaId": 8254,
  "date": "2022-04-11",
  "headline": "Al dia con abc27: 48 personas sin vivienda tras incendio en condado de Dauphin",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/04/Image-2.jpeg?w=1280",
  "link": "https://www.abc27.com/es/al-dia-con-abc27-48-personas-sin-vivienda-tras-incendio-en-condado-de-dauphin/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth Kaplan",
  "authorUrl": "https://www.abc27.com/author/seth-kaplan/",
  "termIds": [
    6506,
    6103
  ],
  "sentences": [
    "La estación de bomberos de Chambers Hill está sirviendo como un refugio temporal y el enfoque principal en este momento es suministrar todo desde pañales y ropa hasta materiales escolares para.",
    "También durante el noticiero de hoy – Al Día con abc27 – El ex-presidente Donald Trump ha respaldado a Mehmet Oz en las primarias del senado republicano de Pensilvania.",
    "Trump llamó a Oz “brillante y conocido.”\nEl ex-presidente Donald Trump ha respaldado a Mehmet Oz en las primarias del senado republicano de Pensilvania.",
    "Un traductor está ayudando a las familias que perdieron sus hogares ya que muchos de ellos son nepalíes y birmanes – y hablan muy poco inglés.",
    "SWATARA TWP, CONDADO DE DAUPHIN, Pa. (WHTM) — Casi 50 personas han quedado sin donde vivir después de un incendio en el municipio de Swatara.",
    "Trump llamó a Oz “brillante y conocido.” Y el precio promedio de un galón de gasolina ha bajado 10 centavos durante las últimas dos semanas.",
    "La cruz roja intervió rápidamente para proporcionar ayuda a las 48 personas que perdieron sus viviendas y todas sus pertenencias.",
    "Empezó alrededor de las 9 de la mañana de ayer en un edificio de apartamentos en la cuadra 700 de Garden Drive.",
    "¡Recibe noticias locales y el pronóstico del tiempo directamente en tu buzón de email!",
    "Su pronóstico del tiempo local más preciso: Hoy soleado con 62 grados; esta noche 48.",
    "Algunas de las familias que vivían en el edificio tienen hijos pequeños.",
    "Regístrate aquí para recibir los boletines diarias de AL DÍA CON ABC27.",
    "Mañana: 72 – con temperaturas máximas de casi 80 a medios de la semana.",
    "Las 12 apartamentos del edificio fueron muy dañados por el incendio."
  ]
}