{
  "id": 7053,
  "mediaId": 2573,
  "date": "2022-04-09",
  "headline": "Former President Trump endorses Dr. Oz for US Senate in Pennsylvania",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/Pennsylvania-Senate-Race-Dr.-Mehmet-Oz.jpg",
  "link": "https://www.foxnews.com/politics/trump-endorses-oz-us-senate-pennsylvania",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Sabes",
  "authorUrl": "https://www.foxnews.com/person/s/adam-sabes",
  "termIds": [
    2765,
    2802,
    4905,
    5862,
    1126,
    1489,
    6506
  ],
  "sentences": [
    "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,\" a statement from Trump says.",
    "\"Dr. Oz is Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our vets, Tax Cuts, and will always fight for and support our under-siege Second Amendment.",
    "Trump's announcement comes after David McCormick, another candidate for the Senate seat, met with Trump on Wednesday at Mar-a-Lago.",
    "But President Trump wisely endorsed me because I’m a Conservative who will stand up to Joe Biden and the woke Left,\" Oz said.",
    "Former President Trump has endorsed Dr. Mehmet Oz for the U.S. Senate seat in Pennsylvania, a Saturday announcement states.",
    "During an interview with conservative talk radio host John Fredericks that Oz is \"a good man ... he’s a high-quality guy.\"",
    "\"I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "Oz responded to Trump's endorsement in a statement on Saturday, saying that he's proud to receive his endorsement.",
    "Trump said on Tuesday that he was close to making a decision on an endorsement in the GOP Senate primary race.",
    "\"President Donald J. Trump announces his endorsement of Dr. Oz,\" a tweet from Trump's spokesperson states.",
    "Everyone, especially David McCormick – a pro-China, Wall Street insider, wanted this endorsement.",
    "\"President Trump knows how critical it is to change the kinds of people we send to Washington.",
    "\"President Trump knows how critical it is to change the kinds of people we send to Washington.",
    "He has lived with us through the screen and has always been popular, respected, and smart.\"",
    "Oz also said that \"no one\" will fight as hard as him at President Biden's policies.",
    "Trump also said that Oz is \"very strong\" on issues such as abortion and tax cuts.",
    "\"President Trump carefully reviewed all of the candidates for U.S. Senate.",
    "I thank him for that, and I am proud to receive his endorsement,\" Oz said.",
    "He will ensure America will become Energy Independent again,\" Trump said.",
    "I thank him for that, and I am proud to receive his endorsement.\"",
    "Fox News' Paul Steinhauser contributed to this report",
    "Oz met with Trump on March 16.",
    "I’m ready to fight.",
    "I’m ready to fight."
  ]
}