{
  "id": 7107,
  "mediaId": 2784,
  "date": "2022-04-04",
  "headline": "Republican Senate Candidate Dr. Oz on Abortion: Don’t Stop Women “Trying to Terminate a Pregnancy”",
  "image": "https://www.lifenews.com/wp-content/uploads/2021/12/droz.png",
  "link": "https://www.lifenews.com/2022/04/04/republican-senate-candidate-dr-oz-on-abortion-dont-stop-women-trying-to-terminate-a-pregnancy/",
  "mediaOutlet": "LifeNews",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2802,
    3325,
    5905,
    1126,
    1489
  ],
  "sentences": [
    "…\nOz continued that he believes “we should make it as easy as possible for women to carry a child to term and give it up for adoption,” but noted that “today’s climate makes it difficult for women to do what’s best for them and their fetus.”\nResponding to the 2008 interview, Oz communications director Brittany Yanick told the Daily Wire that the Republican candidate is pro-life and has been “vocal” about his position for “many years.”\n“Dr.",
    "Senate candidate and celebrity Dr. Mehmet Oz once said the government should stay out of a woman’s decision to “terminate a pregnancy.”\nOz, a Republican running for an open U.S. Senate seat in Pennsylvania, now promises to be a pro-life champion who will “always defend the sanctity of life.”\nHis campaign says he has always been pro-life, but a newly uncovered interview casts doubt on this claim, according to a new Daily Wire report.",
    "Click here to sign up for pro-life news alerts from LifeNews.com\nHere’s more from the report:\nHe explained that while pregnancy and childbirth should be made easier for women, he also did not want to impede a woman’s ability to get an abortion.",
    "“I don’t believe that we should be intruding into the private lives of homosexuals, and we should not be creating obstacles during the difficult time that women have when trying to terminate a pregnancy,” he continued.",
    "… I will always defend the sanctity of life.”\nHowever, Oz’s struggle to define when life begins, despite being a medical doctor, in a December interview with Fox News also raised concerns for pro-life advocates.",
    "And for that reason I’m strongly pro-life, with the three exceptions …” Oz said, listing rape, incest and the health of the mother, a broad exception that has historically gutted pro-life laws.",
    "In March, Oz wrote an op-ed promising to be a “bold voice” for life in Washington, D.C.\n“I will be a bold voice in the Senate and a proud champion for the pro-life movement,” Oz wrote.",
    "We need, as a nation, to make sure the Constitution is appropriately followed, and people like me and you may be in the same camp, who are pro-life, have our feelings respected.",
    "Oz told the Canadian medical newspaper that he was not “socially conservative” and did not believe the government should create “obstacles” to abortion.",
    "And I believe it begins when you’re in the mother’s womb.”\nPressed to clarify, Oz added, “… life’s already started when you’re in your mother’s womb.",
    "I don’t like the government telling me what to do and I believe that people should have free will to pursue their dreams,” Oz said at the time.",
    "“I won’t ever shy away from sharing my pro-life beliefs, even as pro-abortion advocates in medicine, the media, and Big Tech try to silence me.",
    "Oz is running for the seat of retiring U.S. Sen. Pat Toomey, a pro-life Republican who also once supported legalized abortion.",
    "And this is something that should not be taken away from us by a judiciary legislating from the bench.”",
    "If I’m pro-life, it’s a decision that comes back to the sanctity of when you think life does begin.",
    "The Daily Wire pointed to a 2008 interview with Oz at the National Review of Medicine.",
    "“That’s how I would vote.”\nWhen asked when life begins, Oz said: “You know, I get it.",
    "“He spent his entire career saving lives.”\nPeople’s minds do change about abortion.",
    "But it’s a rat hole to get trapped in the different ways to talking about it.",
    "Oz is strongly pro-life and adamantly opposed to abortion,” she said.",
    "“I have a very firm belief in individual rights.",
    "“As a doctor, I appreciate the sanctity of life."
  ]
}