{
  "id": 7228,
  "mediaId": 2526,
  "date": "2022-04-02",
  "headline": "Hypocrisy: ‘Republican’ Dr. Oz Has Lavish Fundraiser with ‘Clinton Friend and Epstein Associate’ After Attacking Opponent for ‘Taking Money from Dems’",
  "image": "https://media.breitbart.com/media/2022/02/LOreal-Paris-Women-of-Worth-Celebration-2017-Inside-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/02/hypocrisy-republican-dr-oz-has-lavish-fundraiser-clinton-friend-epstein-associate-after-attacking-opponent-taking-money-dems/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    2802,
    2474,
    3996,
    2938,
    3022,
    3054,
    4975,
    5862,
    392,
    1126
  ],
  "sentences": [
    "Dr. Mehmet Oz, the celebrity doctor running as a Republican in Pennsylvania’s 2022 U.S. Senate race, is accused of being a hypocrite after a reportedly lavish “$250,000-a-head fundraiser with [a] Clinton friend and Epstein associate” when he has attacked his most prominent opponent David McCormick for “taking money from [Democrats].”\nDr. Oz in the past has accused McCormick of taking money from “Clinton-loving Democrats” while trying to appear as a strong Republican.",
    "… There isn’t a single thing about Oz that doesn’t raise major red flags for republican voters.”\nAnd the communications director for the celebrity doctor, Brittany Yanick, told the Daily Mail that there is nothing hypocritical in taking money from the Epstein- and Clinton-connected billionaire sugar baron and throwing the accusation back at McCormick.",
    "At that time, the Daily Mail reported that Clinton and Pepe appeared in Epstein’s “‘black book’ of celebrity, wealthy and influential contacts.”\nThe Daily Mail reported that after the news of the celebrity doctor’s lavish fundraisers, supporters of McCormick in “Trump world” started to call Dr. Oz a hypocrite.",
    "“That’s quite the contrast from the Never Trumpers and liberal Democrats funding Wall Street insider David McCormick’s campaign.”\nBut, as the Daily Mail noted, McCormick has hired many Trump White House alumni, including Cliff Sims and Stephen Miller.",
    "However, he had a fundraiser costing a quarter of a million dollars per head with Pepe Fanjul, a friend of Bill Clinton, both of whom were in Jeffery Epstein’s black book of contacts, according to the Daily Mail.",
    "“Like the hypocritical fraud he truly is, Oz has repeatedly attacked McCormick for receiving donations from former work colleagues who aren’t registered Republicans,” a “Trump world” source told the publication.",
    "… They try to identify someone and make the analogy that somehow they’re bought or sold by a specific interest.”\nJacob Bliss is a reporter for Breitbart News.",
    "Last year, Bill Clinton was seen boarding a yacht with the Epstein-connected billionaire sugar baron Pepe Fanjul and his brother Alfonso.",
    "Former Rep. Mark Foley (R-FL) told the Daily Mail that both sides would portray the other as a product of special interests group.",
    "“Before, it was bankers, lawyers, Wall Street types; now it’s plumbers, pipe fitters, police, firefighters, business owners.",
    "Both candidates have been vying for an endorsement from former President Donald Trump leading up to the May 17 primary.",
    "Fanjul has been a “prominent Republican donor” but has also been cozy with the Clinton family for decades.",
    "“Anti-Trump Hollywood left-wingers, mega-donors to Hillary Clinton and associates of Jeffrey Epstein.",
    "“Pepe Fanjul is a major donor to President Trump and other America First Republicans,” Yanick said.",
    "At the same time, a McCormick-aligned super PAC is working with Kellyanne Conway.",
    "“But who do you see when you look behind Oz’s curtain?” the source questioned.",
    "“The Republican Party has changed so much,” Foley said.",
    "The fundraiser was at Fanjul’s farm in Palm Beach.",
    "You can follow him on Twitter."
  ]
}