{
  "id": 7249,
  "mediaId": 2526,
  "date": "2022-04-06",
  "headline": "David McCormick Trends Upwards in the Pennsylvania Senate Primary Polls as Mehmet Oz Free Falls",
  "image": "https://media.breitbart.com/media/2022/03/david-mccormick-dr-oz-getty-dod-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/06/david-mccormick-trends-upwards-in-the-pennsylvania-senate-primary-polls-as-mehmet-oz-free-falls/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    5862,
    3939,
    4243,
    2802,
    1126,
    1097,
    1328,
    1489,
    6506
  ],
  "sentences": [
    "“That is a very bad place to be in a GOP primary.”\nA Fox News poll conducted in a joint effort with the Democrat polling firm Beacon Research and Republican polling firm Shaw & Company Research in early March, showed a similar trend, with McCormick in the lead.",
    "The most recent poll conducted by Public Opinion Strategies for the McCormick-aligned super PAC, Honor Pennsylvania, which the Washington Examiner first reported, showed McCormick with 22 percent in the poll.",
    "Mark Harris, a strategist with the McCormick-aligned super PAC, told the Examiner that Dr. Oz “has a 49% unfavorable image, and only 17% of those polled think he’s a conservative,” said Harris.",
    "Businessman David McCormick has been trending upwards in the poll as celebrity doctor Mehmet Oz appears to be in free fall as the primary election is roughly one month away.",
    "The poll also showed McCormick in the lead since February and Dr. Oz declining 15 percentage points since January, just before McCormick officially entered the race.",
    "While McCormick and Dr. Oz have traded jabs as the frontrunners, Kathy Barnett, Carla Sands, and Jeff Bartos are also in the race, polling around ten percent.",
    "His favorabilitly reportedly started at 49 percent and is now at 37 percent, and his unfavorability has gone from 24 percent to 49 percent.",
    "The Fox News poll was conducted from March 2 to 6 with 960 Pennsylvania Republican primary voters and a three percent margin of error.",
    "Two separate polls on the Pennsylvania Republican Senate primary show McCormick in the lead, surging ahead of the celebrity doctor.",
    "The poll was conducted from March 29 to April 3 with 600 likely voter respondents and a four percent margin of error.",
    "The Examiner reported that the poll indicated that Dr. Oz’s image had fallen since January.",
    "The other candidates — Barnett, Carla, and Bartos — hovered between six and nine percent.",
    "McCormick showed 24 percent in the poll, while the celebrity doctor showed 15 percent.",
    "Jacob Bliss is a reporter for Breitbart News.",
    "In comparison, Dr. Oz only has 16 percent.",
    "You can follow him on Twitter."
  ]
}