{
  "id": 7343,
  "mediaId": 2641,
  "date": "2022-04-09",
  "headline": "Trump: 'Right Now Our Country Is a Laughingstock'",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=5829f584-8175-45f9-baa6-f7b9bcb3ab5d&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/donald-trump-save-america-rally-north-carolina/2022/04/09/id/1065048/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Mack",
  "authorUrl": "",
  "termIds": [
    4905,
    2802,
    2765,
    1489,
    1126,
    6598,
    6506
  ],
  "sentences": [
    "Stumping for North Carolina GOP Senate primary candidate Ted Budd, former President Donald Trump added an official endorsement of Dr. Mehmet Oz in Pennsylvania's hotly contested GOP Senate primary at Saturday's Save America rally.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\n© 2022 Newsmax.",
    "\"Our children are being indoctrinated; our values are being desecrated; our heritage is being obliterated; and our country is being humiliated by a president who has no idea what the hell is going on.\"",
    "\"There's never been anything like the crime that we're witnessing in the Democrat-run cities, while radical-left judges persecute Republicans and hold political prisoners without trial.",
    "Repeating a common rally mantra, Trump said it is beyond time to start talking about \"greatness\" for our country, because \"right now our country is a laughingstock around the world.\"",
    "\"We have a president who is challenged, but he's surrounded by vicious, evil, and very corrupt people who are doing whatever they want to in running our country to ruin.",
    "\"By the way, I endorsed another person today — Dr. Oz in Pennsylvania,\" Trump told supporters in Selma, North Carolina, in a rally that aired live on Newsmax.",
    "\"This is the year we're going to take back the House, we're going to take back the Senate, and we're going to take back America,\" Trump continued.",
    "\"They declared war on American energy, and now the middle class is being crushed by the highest gas and food prices in the history of our country.",
    "\"If you want high crime, high prices, high taxes, high corruption, and high incompetence, vote for the radical Democrats,\" Trump said.",
    "\"If you want a country that is strong, sovereign, solvent, safe, and secure, you really have to vote for America First Republicans.",
    "\"Dr. Oz is a great guy — good man, good man, Harvard educated, tremendous, tremendous career and they liked him for a long time.\"",
    "\"And, in 2024, most importantly, we are going to take back our beautiful, beautiful, beautiful, White House.\"",
    "\"Biden and the congressional Democrats triggered runaway inflation, the supply chain disaster.",
    "Violent criminals are being set loose in Democrat-run cities to prey on innocent citizens.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"The stakes this November could not be higher,\" Trump told the crowd.",
    "Trump added the \"choice this November is very simple\" for voters.",
    "\"With your vote this November we can stop our nation's decline.",
    "\"Our country is being systematically destroyed,\" Trump said.",
    "You go to a store, you don't have anything on the shelves.",
    "No Biden administration misstep was off limits for Trump.",
    "Trump began with his usual rebuke of President Joe Biden.",
    "We can make America great again.\"",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "Whoever even heard of it?",
    "349, Dish Network Ch.",
    "\"It's common sense.\"",
    "All rights reserved.",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "How about that?",
    "1220, FiOS Ch.",
    "Special Links:"
  ]
}