{
  "id": 7706,
  "mediaId": 2562,
  "date": "2022-04-09",
  "headline": "Trump: ‘Our Country Is Being Systematically Destroyed’",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid5829F584-8175-45F9-BAA6-F7B9BCB3AB5D-1.jpg",
  "link": "https://donaldjtrumppolls.com/trump-our-country-is-being-systematically-destroyed-2/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    2765,
    2802,
    3578,
    4905,
    920,
    1489,
    6678,
    6598,
    6506
  ],
  "sentences": [
    "Trump: 'Our Country Is Being Systematically Destroyed' Former President Donald Trump (Jason Behnken/AP)\nBy Eric Mack | Saturday, 09 April 2022 07:18 PM\nStumping for North Carolina GOP Senate primary candidate Ted Budd, former President Donald Trump added an announcement of his official endorsement of Dr. Mehmet Oz in Pennsylvania's hotly contested GOP Senate primary.",
    "\"Our children are being indoctrinated; our values are being desecrated; our heritage is being obliterated; and our country is being humiliated by a president who has no idea what the hell is going on.\"",
    "There's never been anything like the crime that we're witnessing in the Democrat-run cities, while radical left judges persecute Republicans and hold political prisoners without trial.",
    "\"We have a president who is challenged, but he's surrounded by vicious evil and very corrupt people who are doing whatever they want to in running our country to ruin.",
    "\"Our country is being systematically destroyed,\" Trump told his Save America rally in Selma, North Carolina, on Saturday night, which aired live on Newsmax.",
    "\"They declared war on American energy, and now the middle class is being crushed by the highest gas and food prices in the history of our country.",
    "\"If you want high crime, high prices, high taxes, high corruption, and high incompetence, vote for the radical Democrats,\" Trump said.",
    "\"If you want a country that is strong, sovereign, solvent, safe and secure, you really have to vote for America First Republicans.",
    "\"Biden and the congressional Democrats triggered runaway inflation, the supply chain disaster.",
    "Violent criminals are being set loose in Democrat run cities to prey on innocent citizens.",
    "No Biden administration misstep was off limits for Trump in rebuking President Joe Biden.",
    "\"The stakes this November could not be higher,\" Trump told the crowd.",
    "Trump added the \"choice this November is very simple\" for voters.",
    "\"With your vote this November we can stop our nation's decline.",
    "You go to a store, you don't have anything on the shelves.",
    "We can make America great again.\"",
    "Whoever even heard of it?",
    "\"It's common sense.\"",
    "How about that?"
  ]
}