{
  "id": 7869,
  "mediaId": 2540,
  "date": "2022-04-08",
  "headline": "Fact check: Misleading claims in attack ads against Pennsylvania GOP Senate candidates Oz and McCormick",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/220407160819-dr-oz-david-mccormick-split.jpg?c=16x9&q=w_800,c_fill",
  "link": "https://www.cnn.com/2022/04/08/politics/fact-check-oz-mccormick-attack-ads-pa-senate/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Dale",
  "authorUrl": "https://www.cnn.com/profiles/daniel-dale",
  "termIds": [
    0
  ],
  "sentences": [
    "While McCormick did donate in early 2015 to a political action committee that supported Republican presidential candidate Jeb Bush, there is no indication that McCormick’s money was spent on attacks on Trump or intended for attacks on Trump – especially because McCormick made his $5,000 donation five months before Trump even began his candidacy for president.",
    "Oz campaign spokesperson Brittany Yanick said in an email: “Claiming that Dr. Oz’s participation in a single advertisement for the California Endowment fund constitutes Dr. Oz’s endorsement of a position the organization took 10 years later is both misleading and wrong.”\nCNN could not reach the super PAC behind the ad for comment.",
    "The California Endowment did comment supportively in 2020 about protesters who were calling to defund the police in the wake of the murder of George Floyd, and its chief executive spoke favorably in 2021 about the idea of reducing the number of police officers on the street and instead improving health, jobs and housing programs.",
    "McCormick did say at a Duke University event in early 2017, however, that “I wasn’t particularly involved with the Trump camp – I wasn’t a Trump supporter – but I wanted that president to be successful,” adding that he also would’ve wanted success for Hillary Clinton if she had won.",
    "The fiercest ad battle has been between the primary’s two leading candidates and outside groups targeting them: Mehmet Oz, a surgeon and former television show host, and David McCormick, a former hedge fund chief executive and economic official in the George W. Bush administration.",
    "A McCormick campaign official, speaking on condition of anonymity, said this week that McCormick had gone on to support Trump in the general election, to vote for Trump in both 2016 and 2020 and to serve on the Trump administration’s Defense Policy Board.",
    "Yanick, the Oz campaign spokesperson, said in an email that this claim in the ad was referring to the fact that “McCormick hosted one of the FIRST fundraisers” for Right to Rise, an arm of the pro-Bush operation that spent money attacking Trump.",
    "Rather, Oz appeared in one health care ad for the foundation – in which he urged Californians to visit the foundation’s website to learn how to take advantage of the benefits offered by the Affordable Care Act, also known as Obamacare.",
    "The key fact is that the super PAC ads attempt to use Oz’s appearance in a single health care ad in 2010, years before most Americans had even heard the phrase “defund the police,” to hint that Oz supports police defunding.",
    "While the pro-Bush super PAC Right to Rise USA was funding attack ads against Trump by late 2015, there was a whole lot of elapsed time between those ads and McCormick’s donation at the beginning of the year.",
    "(This week, Reyes would not answer directly when CNN asked if the foundation supports defunding the police, saying, “As a private foundation we are prohibited from taking stands on policy issues.",
    "(In addition, McCormick’s January 2015 donation was to the pro-Bush leadership PAC with a similar name, not the super PAC that raised far more money and led the advertising effort.)",
    "Oz and ‘defund the police’\nTwo television ads from a super PAC called Pennsylvania Conservative Fund try to portray Oz as a phony who is merely pretending to be a conservative.",
    "His brief affiliation with the “group” these ads were referring to, a health-focused foundation called The California Endowment, had nothing at all to do with policing.",
    "We do support prevention and healing.”)\nRegardless, The California Endowment’s stance on defunding the police in the 2020s is beside the fact-check point here.",
    "That’s true – McCormick was a member of the host committee for that January 2015 fundraiser – and the Oz campaign is entitled to criticize McCormick for it.",
    "McCormick and the 2016 election\nAn ad from Oz’s campaign claims that McCormick “paid for attacks on Donald Trump.”\nFacts First: This claim is misleading.",
    "Each of the ads features a narrator who claims Oz “was a spokesman for a group who wanted to defund the police.”\nFacts First: This claim is misleading.",
    "First and foremost, that early Bush fundraiser happened more than five months before Trump launched his candidacy in a speech in June 2015.",
    "Washington CNN —\nPennsylvania’s television viewers have been inundated with attack ads in the state’s Republican primary for the US Senate.",
    "Sarah Reyes, spokesperson for The California Endowment, said in an email that Oz had no involvement with the foundation beyond the ad.",
    "This claim about McCormick funding attacks on Trump was previously fact-checked by FactCheck.org and PolitiFact.",
    "McCormick also donated $2,700 to Bush’s own campaign in June 2015, the month that Bush announced his candidacy.",
    "Second, even after Trump did announce his run, Bush’s allies were reluctant for months to attack him.",
    "The ad came out in 2010, roughly a decade before the “defund the police” movement rose to prominence.",
    "McCormick’s own $5,000 donation was recorded exactly five months before Trump’s announcement event.",
    "Oz has never been employed by us or been a ‘spokesperson’ for our organization,” Reyes said.",
    "But it’s still a big stretch to claim that McCormick himself paid for any attacks on Trump.",
    "This claim about Oz and defunding the police was previously fact-checked by FactCheck.org.",
    "At the time, many observers scoffed at the idea that Trump was actually going to run.",
    "Here’s a look at one of the attacks on Oz and one of the attacks on McCormick.",
    "And some of those attack ads have featured misleading claims.",
    "Oz opposes the concept of defunding the police.",
    "That’s deceptive.",
    "“Dr."
  ]
}