{
  "id": 867,
  "mediaId": 2509,
  "date": "2022-02-26",
  "headline": "No notes, same logo: Dr. Oz's campaign is like his TV show",
  "image": "https://s.abcnews.com/images/Entertainment/WireAP_baad2902ef93416886782a5cc05faba5_16x9_992.jpg",
  "link": "https://abcnews.go.com/Entertainment/wireStory/notes-logo-dr-ozs-campaign-tv-show-83126108",
  "mediaOutlet": "ABC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Dr. Oz is making his way around Pennsylvania as a candidate for U.S. Senate in town hall-style settings that seem very much like the TV studio where he once presided\nNEWTOWN, Pa. -- The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, Mehmet Oz, to take up the microphone and become the center of attention for more than an hour.",
    "And I did, and I have the scars to prove it.”\nLate last year, Oz — a longtime New Jersey resident who rocketed to fame on Oprah Winfrey’s show — announced that he was running as a Republican for Pennsylvania’s open U.S. Senate seat, one of the country's premier races that could determine control of the Senate next year.",
    "Oz is, at least in part, relying on his celebrity and comfort speaking to people extemporaneously to help distinguish himself from his Republican competitors heading into the May primary and position himself as a strong contender for the fall general election.",
    "To a great extent, Oz's political campaign comes off as an extension of his TV show, a 13-year enterprise that he has conjured as a long and successful battle to advocate for the health care needs of average people by going against the medical establishment.",
    "But Oz, 61, told Sunday's audience that he put $10 million of his own money into a race that features a multi-million-dollar TV smackdown between him, former hedge fund CEO David McCormick and a McCormick-aligned super PAC that is fueled by Wall Street cash.",
    "“I know how to use them.”\nStill, he told a questioner, “there are mental health issues we’ve got to be serious about as gun owners.”\nOn abortion, “I believe life starts at conception,” he told a questioner who said she canvasses for pro-life causes.",
    "Oz is supposedly renting from his in-laws in suburban Philadelphia after moving from his impressive, longtime home in Cliffside Park, New Jersey, that overlooks Manhattan, where he until recently filmed his TV show and practiced medicine.",
    "But it’s unclear whether Oz can harness broad appeal — many have never seen his TV show — and the daytime talk show vibe may lack heft at a moment when the country is facing economic headwinds and a burgeoning war in Europe.",
    "He has led off his campaign with a lengthy critique of how the government and medical establishments handled COVID-19, trampolining from the early days of the pandemic when he became a regular guest on Fox News.",
    "Eileen, 75, has watched Oz's show for years and likes his advocacy for “alternative health care.” Bob, 73, heard what he wanted to hear from Oz on issues like illegal immigration.",
    "Yeah, I know him from television, but what is he really about?’”\nThen he took questions, campaign aides with microphones picking their way through the crowd of well over 200.",
    "For a Republican Party accustomed to electing white Christians, Oz would be the first U.S. senator who is a Muslim and possibly the first to maintain dual citizenship.",
    "Oz instead found time for bigger stages: getting a star on the Hollywood Walk of Fame and speaking at this week’s Conservative Political Action Conference in Florida.",
    "At one recent event, he spent more than a half-hour confidently telling people about himself and the world according to Oz, no teleprompter and no notes.",
    "The strategy is similar to the one used to great effect by Donald Trump, a former television star himself, during his successful 2016 presidential bid.",
    "“I know this is not a pep rally,” he said, pacing in front of seated rows in an events room at the Newtown Athletic Club in suburban Philadelphia.",
    "The shows have 10 Emmy Awards, so I’m proud of what we achieved.”\nBut, to do it, he said, “I had to fight hard for you and you and you and you.",
    "He kicked it off, with a bit of self-awareness for a guy who has barely ever lived in Pennsylvania and is being hit by attack ads daily on TV.",
    "Oz Show” is making his way around Pennsylvania in town hall-style settings that seem very much like the TV studio where he once presided.",
    "But where his competitors for the Republican nomination have looked to standard campaign fare, Oz has out-flanked them with showmanship.",
    "They know Oz has barely lived in Pennsylvania, but they don't care: they spend a lot of time in New Jersey, too, at their shore house.",
    "He was born in the United States to Turkish parents, married an American who is Christian and raised his children as Christians.",
    "He is dogged by accusations that he was a charlatan selling quack treatments and miracle cures for profit on his TV show.",
    "Exactly how wealthy is not clear, since he requested an extension to file a financial disclosure statement to the Senate.",
    "His rivals boast about endorsements while Oz generated coverage by challenging Dr. Anthony Fauci to a televised debate.",
    "On Fox News, he played up the possibility that the anti-malarial drug hydroxychloroquine could be a COVID-19 cure.",
    "Then there are questions about whether he adheres to strict Republican positions on things like guns and abortion.",
    "By all accounts, Oz is leading polls, although public polling is scant and the rest is internal campaign polling.",
    "Welcome to Oz's campaign for U.S. Senate, where the celebrity heart surgeon and former host of daytime TV's “Dr.",
    "Bernice Sikora, 78, never saw one of Oz's shows, but said she liked his energy, sincerity and common sense.",
    "“To see if he was believable.”\nOz was, she said, although she is still undecided who she will vote for.",
    "Will you become a porcupine and fight back and do what’s right, even if it has mortal risks to you?",
    "Like his competitors, he has largely concentrated his interviews with conservative media outlets.",
    "... What’s important is, when your audience is in a predicament, will you go to war for them?",
    "Oz’s themes — “a dose of reality” or “the doctor is in” — spin off his TV doctor reputation.",
    "Otherwise, he grew up in Wilmington, Delaware, and went to medical school in Philadelphia.",
    "Then she headed over to get in line to take a photo with the celebrity doctor.",
    "“It really is for you to understand who I am, which is exactly what I want.",
    "“I've got a concealed carry and I've got a lot of guns,” he said Sunday.",
    "Afterward, he spent 45 minutes signing autographs and posing for photos.",
    "If he loses in Pennsylvania, he could run again in New Jersey in 2024.",
    "“That's what I wanted to come here for,” said Jennifer Spillane, 47.",
    "And while rivals committed to candidate forums, he skipped them.",
    "Even his campaign logo looks just like his TV show logo.",
    "The show, he tells the crowd, “had tremendous success.",
    "Number one health show in the world for 13 years.",
    "The crowd leaving the event seemed convinced.",
    "Carpetbaggery was on the minds of some there.",
    "Oz checked one questioner’s blood pressure.",
    "I want skeptical people kicking the tires.",
    "Bob and Eileen Walker will vote for him.",
    "There's the carpetbagging accusations.",
    "“Doctor to doctor,” he said.",
    "Does he represent my values?",
    "He high-fived another.",
    "A hundred countries.",
    "He is also wealthy.",
    "‘Is this guy legit?",
    "Oz faces skeptics."
  ]
}