{
  "id": 8949,
  "mediaId": 2732,
  "date": "2022-03-24",
  "headline": "Herschel Walker, Dr. Oz removed from Biden's sports council",
  "image": "",
  "link": "https://triblive.com/news/politics-election/herschel-walker-dr-oz-removed-from-bidens-sports-council/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://triblive.com/author/the-associated-press/",
  "termIds": [
    4905,
    2802,
    2137,
    2016,
    2765,
    6506,
    6208
  ],
  "sentences": [
    "They are: José Andrés, a chef, restaurant owner and founder of World Central Kitchen, an international relief organization that promotes healthy food and deploys field kitchens to respond to food crises around the world, including Ukraine; and Elena Delle Donne, a two-time winner of the WNBA’s most valuable player award and an Olympic gold medalist for Team USA who founded the Elena Delle Donne Charitable Foundation to raise money for Lyme Disease research and special needs programs.",
    "pic.twitter.com/fJaVLKVWOC\n— Dr. Mehmet Oz (@DrOz) March 24, 2022\nThe White House on Wednesday posted two new appointments to the council, while a White House official said Oz and Walker were asked to resign because the White House doesn’t permit candidates for federal office to serve on boards.",
    "HARRISBURG — The White House has removed Dr. Mehmet Oz — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "Oz and Walker — both are Republicans — were appointed by President Joe Biden’s predecessor, Donald Trump, and Oz quickly went to social media to claim that he was being removed for political reasons.",
    "Oz said he had no intention of resigning and “if President Biden wants to politicize health, he’ll have to fire me.” Walker also took to Twitter on Thursday to attribute his removal to politics.",
    "The letter from the White House Office of Presidential Personnel asked the men to resign Wednesday or be removed by the end of the day.",
    "“It’s beyond sad that Joe Biden would politicize such an important issue like health,” Oz said in a video he posted to Twitter.",
    "I received this letter on behalf of @POTUS requesting I resign from the President's Council on Sports, Fitness & Nutrition.",
    "Walker announced his candidacy in Georgia on Aug. 25 and Oz announced his candidacy in Pennsylvania on Nov. 30.",
    "The White House said it made the announcement once it had appointees with which to replace Oz and Walker.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.",
    "It’s sad that he would politicize such an important issue like health.",
    "Categories: Election | News | Politics Election"
  ]
}