{
  "id": 9003,
  "mediaId": 2562,
  "date": "2022-03-30",
  "headline": "Dr. Oz Formally Fired by Biden White House",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/03/getfile.aspxguidDB0A18FC-9875-4248-93BA-9C1E33C62DF4-1.jpg",
  "link": "https://donaldjtrumppolls.com/dr-oz-formally-fired-by-biden-white-house-2/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "Dr. Oz Formally Fired by Biden White House (Getty)\nBy Newsmax Staff | Wednesday, 30 March 2022 06:37 PM\nDr. Mehmet Oz, the longtime talk show host who's running for a Senate seat in Pennsylvania, said he's been formally fired by the White House from his role as a member of the President's Council on Sports, Fitness and Nutrition.",
    ":\nThe tweet said: \"Inbox: Mehmet Oz says he has now been formally fired from the President's Council on Sports, Fitness and Nutrition – a week after the original threat and demand for his resignation from the Biden admin.\"",
    "Oz and fellow U.S. Senate candidate Herschel Walker on Wednesday were told by Biden assistant Gautam Raghaven to resign from the council or their positions would be \"terminated.\"",
    "CNN reported that a White House official said Oz and Walker were in violation of the Biden administration's policy of federal candidates serving on presidential boards.",
    "Several days ago, Oz wrote President Joe Biden to say he would not resign from the President's Council on Sports, Fitness and Nutrition despite being ordered to do so.",
    "Oz, running in Pennsylvania, and Walker, a candidate in Georgia, both refused to quit the council they were named to by then-President Donald Trump.",
    "\"As I have stated publicly, health should never be politicized, and I do not intend to resign as a Member of the Council,\" Oz wrote Biden on Friday.",
    "A Philadelphia Inquirer national politics writer, Jonathan Tamari, carried the information in a tweet on Wednesday shortly before 6 p.m.",
    "The 1939 Hatch Act also limits the political activity of certain federal employees, such as engaging in partisan political campaigns.",
    "\"Furthermore, I have received no notice that you have exercised your removal power.",
    "I will consider myself a Council Member until otherwise alerted.\"",
    "ET."
  ]
}