{
  "id": 9090,
  "mediaId": 2573,
  "date": "2022-03-23",
  "headline": "Biden demands Dr. Oz, Herschel Walker step down amid Senate runs",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Dr.-Oz-Pennsylvania-Senate-Race.jpg",
  "link": "https://www.foxnews.com/politics/biden-demands-dr-oz-herschel-walker-step-down-amid-senate-runs",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Brown",
  "authorUrl": "https://www.foxnews.com/person/b/jon-brown",
  "termIds": [
    2802,
    2765,
    2137,
    4905,
    1489,
    6506,
    6175
  ],
  "sentences": [
    "President Biden requested that two members of the President's Council on Sports, Fitness & Nutrition, who were appointed by former President Trump, either step down or face termination amid their U.S. Senate runs in Georgia and Pennsylvania.",
    "People who serve on the Council on Sports, Fitness & Nutrition are considered special government employees and are not permitted to engage in partisan election activities under the Hatch Act.",
    "\"President Trump appointed me to two terms on the President’s Council on Sports, Fitness & Nutrition,\" tweeted Dr. Mehmet Oz, who is running for Senate in Pennsylvania.",
    "\"Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling,\" Oz continued.",
    "Trump appointed Oz and Walker in 2018 serve on the council, and he appointed them again in 2020 shortly before he left office.",
    "A similar notification was issued to Herschel Walker, who is running for the Senate in Georgia.",
    "\"The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.\"",
    "\"It’s sad that he would politicize such an important issue like health,\" Oz said.",
    "\"The White House just emailed me demanding my resignation by the end of the day.\"",
    "\"I am proud of my service and will not resign.\""
  ]
}