{
  "id": 9236,
  "mediaId": 2562,
  "date": "2022-03-30",
  "headline": "Dr. Oz’s TV Staff Defend Star Over End of Show",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/03/getfile.aspxguid9867743A-8892-40E1-B3A2-015272E5E387.jpg",
  "link": "https://donaldjtrumppolls.com/dr-ozs-tv-staff-defend-star-over-end-of-show/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "Once \"The Dr. Oz Show\" finished taping its 13th and final season, she said all employees were given the opportunity to \"transition seamlessly\" to work on \"The Good Dish,\" a cooking show starring Oz's daughter, Daphne Oz, as well as Gail Simmons and Jamika Pessoa.",
    "Oz's long-time staffers tell Newsmax that Oz agreed to personally pay employees through the end of their contracts even though filming for his show had already wrapped and guaranteed to cover employees' health insurance through the end of their contracts.",
    "Andrea Chessler, who worked as a title producer on the show since its inception, said she was personally appalled by characterizations in some media and blogs that accused Oz of being a \"heart doctor without a heart.\"",
    "He's been the target of attacks from the New York Times, and even the Biden White House, which just last week fired Oz from the President's Fitness Council after he called on Dr. Anthony Fauci to be fired.",
    "Recognizing that a Senate seat \"doesn't just open up\" every election cycle, and that Oz felt it was time to serve his country in a different way, she said the staff understood that \"this was his chance.\"",
    "\"We were not told we were all out on the street,\" she said, adding that the general sentiment on set was that \"everyone has their path in life\" and this opportunity was rare and hard to pass up for Oz.",
    "Tina Tung, who served as the show's director of marketing for 13 years, said staffers were certainly surprised when they learned Oz decided to pivot to politics, but they didn't feel abandoned.",
    "(JC Olivera/Getty Images)\nBy Marisa Herman | Wednesday, 30 March 2022 05:36 PM\nDr. Oz may not be on TV with his popular show, but his fans may not be the only ones missing out on the star.",
    "Tung said Oz's graciousness, dedication, and appreciation for his staff is what caused her to pass on several job opportunities during the past 13 years and stick with the doctor.",
    "The hit syndicated \"Dr. Oz Show\" lasted thirteen seasons, and long-time employees and staff of the program are speaking out in favor of their colleague and friend.",
    "From reviewing medical records to recommending a surgeon, she said Oz even scrubbed in on the day of her surgery to make sure everything went according to plan.",
    "The show wasn't picked up by a network after its first season, however, which Tung believes led to some employees feeling they weren't \"given a fair shake.\"",
    "After she was diagnosed with a heart condition just over two years ago, she said Oz \"took care of everything\" related to the valve replacement she needed.",
    "Dr. Oz's TV Staff Defend Star Over End of Show Dr. Mehmet Oz receives a star on the Hollywood Walk of Fame on Feb. 11, 2022 in Hollywood, California.",
    "From the executive producer to the associate producer to the hair and makeup people, we truly felt like we were very cohesive as a group.\"",
    "Now the internet is abuzz over rumors the celebrated heart surgeon \"heartlessly\" left employees on his show abandoned and without work.",
    "While Oz sacrificed his highly rated TV show to launch his campaign, Tung said he still took care of his staff as if they were family.",
    "\"It didn't matter if you were the stagehand or supervising producer if you were the wardrobe stylist or the food stylist,\" she said.",
    "Martin Taub, a producer on the show since season seven in 2015, described Oz as \"generous\" and a \"terrific person to work for.\"",
    "Oz announced his candidacy for the Republican nomination in late November and swiftly became a target of corporate media.",
    "\"I watched him over the years treat everyone with such dignity and giving equal credit for their role in the show.",
    "Oz is seeking the Republican Senate nomination in Pennsylvania in a hotly contested GOP primary set for May 17.",
    "Oz also helped staff to transition to jobs on \"The Good Dish\" – a new show that he backed with his own money.",
    "\"All of a sudden, we were given another lease on life to work on another show,\" Tung said.",
    "He was always thanking people and telling them how appreciative he was of them.\"",
    "I know he's a heart surgeon but he didn't have to do what he did.\"",
    "\"I can't tell you how much the man did for me,\" Chessler said.",
    "\"We were all still on payroll, gainfully employed,\" she said.",
    "\"I felt, all the time I was there, like a family,\" she said.",
    "\"I felt like I was working for a family business,\" he said.",
    "Newsmax looked into the matter and found a different story.",
    "\"I did that all because I respect my staff,\" Oz said.",
    "\"We really, really liked working with each other.",
    "She added: \"I'm alive today because of him.\"",
    "\"He actually saved my life,\" she said.",
    "\"I wanted them to feel protected.\"",
    "\"He had to do what he had to do.",
    "I couldn't have asked for more.",
    "\"He took care of everything.",
    "\"I was treated like family.\"",
    "\"We got it,\" Tung said.",
    "The time was right.\"",
    "Original Article"
  ]
}