{
  "id": 9240,
  "mediaId": 2720,
  "date": "2022-03-24",
  "headline": "Biden Demands Herschel Walker and Dr. Oz Quit Presidential Advisory Council or Be Ousted",
  "image": "https://thefederalistpapers.org/wp-content/uploads/2020/06/herschell-walker.jpg",
  "link": "https://thefederalistpapers.org/us/biden-demands-herschel-walker-dr-oz-quit-presidential-advisory-council-ousted",
  "mediaOutlet": "thefederalistpapers.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Davis",
  "authorUrl": "https://thefederalistpapers.org/author/wj",
  "termIds": [
    4905,
    4899,
    3217,
    2802,
    2137,
    2765,
    2016,
    6175
  ],
  "sentences": [
    "On Wednesday, the Biden administration notified former football star Herschel Walker and celebrity physician Dr. Mehmet Oz that they could either resign from the council or be fired, according to NBC News.",
    "pic.twitter.com/uCKGro8iBP\n— Boardroom (@boardroom) March 23, 2022\nWalker, who won the 1982 Heisman Trophy as a star running back at the University of Georgia, had not issued any comment by early Thursday.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons,” Oz said in another tweet, referring to Anthony Fauci, the White House’s chief medical adviser.",
    "pic.twitter.com/fJaVLKVWOC\n— Dr. Mehmet Oz (@DrOz) March 24, 2022\n“I am beyond grateful to President Trump for appointing me to this very prestigious and important position.",
    "As President Joe Biden conducts a purge of the President’s Council on Sports, Fitness & Nutrition, at least one of those he wants off the panel has vowed to fight.",
    "CNN further claimed that members of the fitness panel are covered under the Hatch Act, which bans government employees from certain kinds of political activity.",
    "The White House already has replaced Walker, who was the chairman, with chef José Andrés and WNBA player Elena Delle Donne, who will be co-chairs of the panel.",
    "NEW: Joe Biden has appointed 2x WNBA MVP Elena Delle Donne and Chef José Andrés as Co-Chairs of the President’s Council on Sports, Fitness, & Nutrition.",
    "“Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "In September, former White House press secretary Sean Spicer and former White House budget director Russ Vought were asked to step down from the U.S.",
    "pic.twitter.com/EP1vHWATp4\n— Dr. Mehmet Oz (@DrOz) March 23, 2022\n“It’s sad that he would politicize such an important issue like health.",
    "Walker announced back in August that he was running for a seat in Georgia, while Oz declared his Pennsylvania candidacy in November.",
    "I received this letter on behalf of @POTUS requesting I resign from the President’s Council on Sports, Fitness & Nutrition.",
    "I am also grateful to my colleagues on the committee and council, and the amazing accomplishments we were able to achieve.",
    "The White House told NBC News that it will not allow anyone running for federal office to serve on boards and commissions.",
    "Both had been appointed to two-year terms in December 2020 by then-President Donald Trump.",
    "The Biden administration has acted before to rid advisory boards of Trump appointees.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.",
    "Walker and Oz are both Republican candidates running for the U.S. Senate.",
    "It’s sad that he would politicize such an important issue like health.",
    "“If President Biden wants to politicize health, he’ll have to fire me.",
    "Let Americans see how truly petty and political he truly is,” Oz said.",
    "Naval Academy Board of Visitors, prompting lawsuits from both men.",
    "This article appeared originally on The Western Journal.",
    "I am proud of my service and will not resign,” he said.",
    "Oz said Wednesday on Twitter that he would not quit.",
    "I’ve got no intentions, my friends, of resigning.",
    "I am proud of my service and will not resign.",
    "None,” he said in an accompanying video."
  ]
}