{
  "id": 9266,
  "mediaId": 2522,
  "date": "2022-03-26",
  "headline": "Herschel Walker on Biden demanding resignation: ‘I’m not a quitter so you’re gonna have to fire me’",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/03/SG-Walker-Biden.jpg",
  "link": "https://www.bizpacreview.com/2022/03/26/herschel-walker-on-biden-demanding-resignation-im-not-a-quitter-so-youre-gonna-have-to-fire-me-1217505/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Haggerty",
  "authorUrl": "https://www.bizpacreview.com/author/kevin-haggerty/",
  "termIds": [
    0
  ],
  "sentences": [
    "(Video: NewsMax)\nHerschel Walker echoed the sentiments of Dr. Mehmet Oz this week when he responded to President Joe Biden’s demand that he step down from the President’s Council on Sports, Fitness & Nutrition over Hatch Act violation concerns, stating simply, “I’m not a quitter.”\nWalker, a Republican candidate for U.S. Senate from Georgia, has had a storied career in sports competing in the NFL and the Olympics representing the United States.",
    "So, I’m going to continue to advocate for kids, but I’m going to continue to go out and win the senate seat, and maybe I can do even more, and they may not be happy with that as well.”\nThroughout the rest of the conversation, Walker discussed the naturally divisive nature of Democrat politicians and their surrogates in corporate media and how they insist on doubling down on policies that fail time and time again.",
    "Co-host Lyndsay Keith then laid out the specific details of the email from the administration and reminded the viewers of the legitimate Hatch Act violation by White House press secretary Jen Psaki when she had stated at the daily press briefing, “we’re going to do everything we can to help former governor McAuliffe, and we believe in the agenda he’s representing,” in an endorsement of his campaign in Virginia.",
    "Spicer asked for an update from Walker and said, “My understanding is you had no intention of resigning.”\n“I have no intention of resigning or quitting, so I didn’t quit and I haven’t got my letter yet that they fired me,” Walker said before explaining that he doesn’t talk about his advisory position while campaigning and so hasn’t violated the Hatch Act.",
    "So, I’m OK with it.”\nWhen asked if he considered seeking legal recourse, the senate candidate replied, “I really haven’t because I’ve advocated for kids my whole life.”\n“And first of all,” Walker reminded, “I’m not paid on this.",
    "“With the bad policies that they’re doing right now, I think the people are sort of waking up now and know that this administration is not doing what’s great for the state of Georgia, what’s great for this country.",
    "— Herschel Walker (@HerschelWalker) March 24, 2022\nWalker made clear that he wasn’t being paid for his advisory position on the council and joined “Spicer & Co.,” Friday to further discuss his stance on the matter.",
    "President Biden is so scared about us beating Raphael Warnock that he has asked me to resign from my unpaid position on the President’s Council on Sports, Fitness, and Nutrition.",
    "On Wednesday, Biden officials emailed both Walker and Oz, who is running for U.S. Senate in Pennsylvania, threatening termination of their positions if they did not step down.",
    "(@PeopleDied2Vote) March 24, 2022\nNoting that no action had been taken by the administration for her violation, Keith asked Walker to weigh in on the hypocrisy.",
    "“Right now,” he began, “I’m in a tough race, so I think they’re trying to help out my opponent, which is OK because I’m going to beat him anyway.",
    "Sean Spicer reminded the audience how this “purge” of Trump appointees had included himself after he was forced off of the board of the U.S.",
    "Oz was quick to respond that the president would have to fire him if he wanted to “politicize health” and Walker followed suit on Thursday.",
    "It’s sort of like, what’s good for me is not good for thee, and I think all that they’re doing.”\n“But it’s OK,” Walker went on.",
    "His appointment by President Donald Trump was a milestone marking his continued advocacy for the health and wellness of kids.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "The former president has endorsed his longtime friend in the lead-up to the May 24 primary.",
    "Walker is scheduled to appear at a rally with Trump on Saturday for Georgia candidates.",
    "I think it had more to do with a political move on their part,” he further clarified.",
    "Naval Academy along with others from different military boards.",
    "“I knew it had nothing to do with my work on the council.",
    "I’m not a quitter so you are going to have to fire me.",
    "The public will not see it and we do not share it.",
    "Vote in EVERY election, esp School Board ????",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "I was not even paid at all.",
    "That’s what’s so funny.",
    "— ????"
  ]
}