{
  "id": 9618,
  "mediaId": 4018,
  "date": "2022-03-21",
  "headline": "AIPAC’s pro-democracy ‘super PAC’ does not mention Israel in its mission",
  "image": "https://www.jta.org/wp-content/uploads/2022/03/03-21-2022-AIPAC-superpac.jpg",
  "link": "https://www.jta.org/2022/03/21/politics/aipacs-pro-democracy-super-pac-does-not-mention-israel-in-its-mission",
  "mediaOutlet": "jta.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ron Kampeas",
  "authorUrl": "https://www.jta.org/author/ron-kampeas",
  "termIds": [
    4905,
    5157,
    3268,
    660,
    57,
    392,
    1331,
    6253,
    6709
  ],
  "sentences": [
    "AIPAC PAC’s mission on its website is straightforward: “The AIPAC PAC supports pro-Israel Democratic and Republican members of Congress and congressional candidates to secure the future of the U.S.-Israel relationship.”\nFor most of its history and despite its acronym, AIPAC was a lobbying group that did not and could not contribute to political campaigns.",
    "Regular PACs may contribute a maximum of $5,000 to a candidate per election and may also relay individual contributions to a candidate; the added value for an individual routing his contribution through a PAC rather than directly is that the candidate understands what is motivating the donation.",
    "“United Democracy Project is an organization comprised of American citizens, Democrats and Republicans, united in the belief that we are stronger as a nation when we come together in support of our democracy and other democracies around the world,” says the mission statement on its website.",
    "“United Democracy Project works to elect candidates that share our vision of Americans coming together to support our mutual interests and belief in democracy.”\nAsked why the super PAC does not state that it supports Israel, AIPAC spokesman Marshall Wittmann did not directly answer.",
    "“As we indicated at the time of the announcement of the PAC and Super-PAC, the creation of the PACs is an opportunity to significantly deepen and strengthen the involvement of the pro-Israel community in politics,” Wittmann said Monday in response to an email query.",
    "The ad, seeking a political director, said the super PAC’s emphasis would be on the U.S.-Israel relationship, and that the political director would report to Rob Bassin, the United Democracy Project’s CEO who for 22 years was AIPAC’s political director.",
    "The revelation of the name and mission of the super PAC comes as its sister political action committee, AIPAC PAC, drew fire from Democrats for endorsing several dozen Republicans who voted against affirming Joe Biden as president on Jan. 6, 2021.",
    "When it announced the launch of the two PACs in December, it said that the super PAC had yet to be named, although United Democracy Project has had a Twitter account in its name since last September.",
    "Those critics said a pro-Israel PAC had no business endorsing candidates who, like the insurrectionists who took part in the deadly riot that day at the Capitol, sought to stop Biden’s affirmation.",
    "WASHINGTON (JTA) — AIPAC’s new regular political action committee is self-evident about what it’s all about: It’s called AIPAC PAC, after all, and is committed to supporting pro-Israel candidates.",
    "Super PACs may spend unlimited money promoting a candidate, or opposing a candidate, or promoting or opposing an issue, as long as the super PAC does not directly coordinate with any campaign.",
    "“Restore Common Sense,” which backs a conservative Republican running for Senate in North Carolina, features only a sketch of Thomas Paine and a quote from the founding father on its website.",
    "The “super PAC” that the American Israel Public Affairs Committee launched in December, however, is more opaque: It’s called the United Democracy Project.",
    "United Democracy Project has so far raised close to $10 million, according to the Federal Election Committee, including $8.5 million from AIPAC itself.",
    "“American Leadership Action” was established to back the candidacy of Mehmet Oz, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "The AIPAC super PAC’s aims were further spelled out in an ad in The Hill newspaper, a daily read widely in Congress.",
    "Giving a candidate money through AIPAC’s regular PAC signals that the donors’ primary motivation is pro-Israel.",
    "Its brief mission statement does not mention Israel nor the powerhouse pro-Israel lobby behind its founding.",
    "The ad was removed Monday after reporters started making queries about the new super PAC.",
    "Vague generic names for super PACs are not unusual.",
    "Instead, it emphasizes the promotion of democracy."
  ]
}