{
  "id": 9684,
  "mediaId": 8428,
  "date": "2022-03-26",
  "headline": "Biden orders Herschel Walker to step down from health council – or else",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/03/2GNHJ02-Herschel-Walker-scaled-e1648319203897.jpg",
  "link": "https://www.rsbnetwork.com/news/biden-orders-herschel-walker-to-step-down-from-health-council-or-else/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Ramirez",
  "authorUrl": "https://www.rsbnetwork.com/author/laura-ramirez/",
  "termIds": [
    2137,
    2765,
    4905,
    3026,
    1489,
    6175
  ],
  "sentences": [
    "Walker took to Twitter to respond to the sudden demand: “I’m not a quitter so you are going to have to fire me.”\nDr. Mehmet Oz, candidate for the Senate in Pennsylvania, received the same demand, questioning the political intent behind the decision to oust two Republican candidates from the health council.",
    "While many speculate the reasoning behind Biden’s requests, the New York Posts reports that individuals serving on the council are considered special government employees and, therefore, prohibited from engaging in partisan elections under the federal Hatch Act.",
    "However, as November’s midterms get closer, and Walker is favored to win the Republican Senate primary in the Peach State against Democrat Sen. Raphael Warnock, one must wonder if the White House’s decision has a deeper intent.",
    "Photo credit: Alamy\nJoe Biden Wednesday ordered Trump-endorsed candidate Herschel Walker to either resign or be fired from his position on the President’s Council on Sports, Fitness, and Nutrition.",
    "Walker and Oz were both appointed to the council in 2018 by President Trump and they were re-appointed shortly before Trump left the White House in 2020, according to Fox News.",
    "The Hall of Fame running back has dominated polls since early this year, after having a three-point lead on Warnock in January.",
    "According to a March survey conducted by Blueprint Polling, Walker was leading Warnock by five percent.",
    "Georgia’s primary is scheduled for May 24, 2020, and the primary runoff is planned for June 21, 2022.",
    "Georgians will elect the state’s new senator in the general election on Nov. 8, 2022.",
    "Walker continues to gain steam, raising anticipation for a red wave in Georgia."
  ]
}