{
  "id": 9786,
  "mediaId": 2702,
  "date": "2022-03-24",
  "headline": "Biden ‘hopeful’ China won’t help Russia",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/bidenjoe_nato_032422_ap_evan_vucci.jpeg?w=1280",
  "link": "https://thehill.com/homenews/administration/599623-biden-hopeful-china-wont-help-russia/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Gangitano",
  "authorUrl": "https://thehill.com/author/alex-gangitano/",
  "termIds": [
    4486,
    4905,
    6147,
    5979,
    6569,
    6509
  ],
  "sentences": [
    "Biden said on Thursday that during the conversation, he spoke to Xi about his interests in economic relations with Europe and the U.S.\n“I made no threats, but I pointed out the number of American and foreign corporations that left Russia as a consequence of their barbaric behavior and I indicated that I knew how much he — because we had long discussions in the past — about his interest in making sure he had economic relations and economic growth with Europe and United States and indicated that he would be putting himself in significant jeopardy in those aims if in fact he were to move forward,” Biden said.",
    "Biden added that, during the NATO summit, leaders discussed setting up an organized system to look “at who has violated any of the sanctions and where and when and how they violated them and that’s something we’re going to put in train, it’s not done yet.”\nGroup of Seven leaders and the European Union on Thursday announced an initiative to share information about and coordinate responses to any measures intended to undermine the impact of sanctions, the White House announced.",
    "When asked if he has seen any indications of action or lack of action from China in helping Russia, Biden said he was not going to comment in detail about a consequence of his conversation with Xi last week.",
    "President Biden on Thursday said he is hopeful that China will not aid Russia during its invasion of Ukraine, citing China’s focus on its economic future as a deterrent.",
    "I’m hopeful that he does not get engaged,” Biden said at a press conference in Brussels, referring to Chinese President Xi Jinping.",
    "Biden spoke to Xi last week and warned him that Beijing would face consequences if it provides “material support” to Russia.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "“I think that China understands that its economic future is much more closely tied to the West than it is to Russia.",
    "The initiative would be in an effort to not allow sanction evasions.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}