{
  "id": 9787,
  "mediaId": 2553,
  "date": "2022-03-25",
  "headline": "Herschel Walker’s Son Rips Biden For Firing His Dad From Fitness Council: Who’s Gonna Replace Him, Lia Thomas?",
  "image": "https://dw-wp-production.imgix.net/2022/03/GettyImages-1235196788.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/herschel-walkers-son-rips-biden-for-firing-his-dad-from-fitness-council-whos-gonna-replace-him-lia-thomas",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Prestigiacomo",
  "authorUrl": "https://www.dailywire.com/author/amanda-prestigiacomo",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’m not gonna settle for second place, this is the greatest country in the world.”\nRelated: Herschel Walker Slams Olympic Protests: ‘If People Don’t Like The Rules Here, Why Are You Here?’\nThe Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "“I’m not a quitter so you are going to have to fire me.”\nThe Biden administration apparently fired him on Wednesday, MarketWatch reported, claiming Walker violated a personal “policy” of the president:\nA White House official told MarketWatch that it’s against President Biden’s policy for candidates vying for federal office to serve on such boards.",
    "“I’m not going to quit, so I reckon they’re going to fire me, but I haven’t got the letter that they fired me yet.”\nWalker went on to criticize the administration for “doubling down” and “not trying to make anything better.”\n“They’re going back and blaming everyone else, instead of blaming themselves,” he said.",
    "After President Joe Biden fired famed NFL running back and Republican Senate candidate Herschel Walker from a volunteer position on the White House Council on Sports, Fitness, and Nutrition, the former athlete’s son shot back on Twitter.",
    "— Christian Walker (@ChristianWalk1r) March 24, 2022\nWalker, who is currently running to be a senator in Georgia, forced Biden to fire him from the voluntary position he took under former President Donald Trump.",
    "— Herschel Walker (@HerschelWalker) March 24, 2022\nWalker on Thursday evening, though, told Fox News host Laura Ingraham that he has yet to receive anything from the Biden administration about his firing.",
    "“President Biden is so scared about us beating Raphael Warnock that he has asked me to resign from my unpaid position on the President’s Council on Sports, Fitness, and Nutrition,” Walker wrote.",
    "President Biden is so scared about us beating Raphael Warnock that he has asked me to resign from my unpaid position on the President’s Council on Sports, Fitness, and Nutrition.",
    "“Who is Biden going to replace my dad [Herschel Walker], a Heisman trophy winner, Olympian, NFL and MMA star, with on the Presidential council of fitness and sports?",
    "Who is Biden going to replace my dad @HerschelWalker, a Heisman trophy winner, Olympian, NFL and MMA star, with on the Presidential council of fitness and sports?",
    "“With so much going on in this country, I cannot believe he’s (Biden) going to think that Herschel Walker is going to quit,” Walker told Ingraham.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "Last week, Thomas handily took first over biological female competitors in the NCAA Women’s Swimming Championship 500 yard freestyle.",
    "They continue to hurt Georgia, they continue to hurt the American people.”\nBiden is trying to put America “second,” Walker argued.",
    "Thomas, a biological male who identifies as a woman, has been cheered by the Left for dominating women’s collegiate swimming.",
    "“Well, America is not second, and I’m not gonna settle for second,” he told Ingraham.",
    "So Biden asked Walker and [Dr. Mehmet] Oz to resign or face termination on Wednesday.",
    "Christian’s tweet was shared widely and racked up more than 30,000 likes on Twitter.",
    "Lia Thomas?” mocked Christian Walker, a conservative activist.",
    "I’m not a quitter so you are going to have to fire me.",
    "“Right now, we can be energy independent.",
    "Become a member now and join our mission.",
    "They don’t even wanna do that.",
    "Believe the same?",
    "Lia Thomas?"
  ]
}