{
  "id": 15559,
  "mediaId": 2664,
  "date": "2022-03-12",
  "headline": "Bill Barr's new book trashed as 'Trump-alumni performance art' in brutal review",
  "image": "https://www.rawstory.com/media-library/bill-barr.jpg?id=29529362&width=1200&coordinates=0%2C52%2C0%2C2&height=600",
  "link": "https://www.rawstory.com/bill-barr-donald-trump-2656940276/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    5207,
    4905,
    5665,
    5762,
    1959,
    2409,
    4307,
    2765
  ],
  "sentences": [
    "In what is likely a rare agreement with Donald Trump, the reviewer cites the former president's criticism of Barr since the excerpts of the book began making the rounds, with Trump stating, \"He [Barr] is groveling to the media, hoping to gain acceptance that he doesn’t deserve,\" to which Green added a pithy, \"So true.\"",
    "Barr has received no small measure of criticism over the past few weeks of his book promotion tour as he both harshly criticized Donald Trump as unfit for office while also saying he couldn't bring himself to vote for a Democrat should the former president be on the ballot in 2024.",
    "Writing the behind-the-scenes 591-page book \"delivers the expected\" the columnist pointedly added, \"At the same time, Barr lets us know suburbia came to find Trump offensive and insists that in the end, Trump crashed and burned despite Barr’s best efforts.",
    "Pointing out that conservative judges have been critical of Barr's tenure under Trump, the columnist notes that the attorney blithely omits any mention of them with Green writing that he did find time to attack President Joe Biden instead.",
    "Former Attorney General Bill Barr's literary foray into the Donald Trump administration tell-all genre failed to meet the approval of the Guardian's Lloyd Green who scorched his efforts in a brutal book review on Saturday.",
    "\"But he also offers up a full-throated defense of his own decision to drop government charges against Michael Flynn, despite the Trump ally’s guilty plea to lying to the FBI and, later, demand for martial law.",
    "With that in mind, the Guardian's Green dug into Barr's \"One Damn Thing After Another: Memoirs of an Attorney General\" and then wrote it off as \"Trump-alumni performance art.\"",
    "Barr accuses Walsh, now dead, of torpedoing Bush’s campaign comeback in ’92 by filing election-eve charges against Casper Weinberger, Ronald Reagan’s defense secretary.",
    "Ultimately, like everyone else the 45th president ceased to find useful, Barr was simply spat out – a reality his memoir does at least acknowledge.\"",
    "Calling the book both self-serving a \"score-settling,\" Green labeled the former AG as \"a culture warrior in a Brooks Brother suit.\"",
    "Furthermore, Barr says nary a word in response to the volley of criticism he earned from the federal bench.\"",
    "\"He takes shots at James Comey and Robert Mueller, key figures in the Russia investigation.",
    "He also takes aim at Lawrence Walsh, special counsel in Iran-Contra.",
    "Barr’s ire is understandable,\" Green wrote.",
    "You can read the whole review here.",
    "Of course he does."
  ]
}