{
  "id": 15957,
  "mediaId": 2664,
  "date": "2022-03-08",
  "headline": "After mistakenly scrapping party official elections in 2022, Arizona GOP lawmakers scramble to undo it",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29500985&width=1200&coordinates=0%2C0%2C0%2C0&height=600",
  "link": "https://www.rawstory.com/after-mistakenly-scrapping-party-official-elections-in-2022-gop-lawmakers-scramble-to-undo-it/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.rawstory.com/u/jeremyduda-arizonamirror",
  "termIds": [
    0
  ],
  "sentences": [
    "“Where maintaining the existing election process for PCs would have been detrimental to the parties and their candidates for PC offices is that counties would have provided a new list of number of PC offices per election precinct, including new election precincts, and signature requirements halfway through the candidate filing period,” the statement read.",
    "“Counties believed this was unfair to the parties and candidates and we sought a solution to ensure communities in new election precincts would have accurate party representation.”\nDespite the furor over provision, most precinct committeemen elections are uncontested, in which case they don’t even appear on the ballot.",
    "Yuma County Elections Director Tiffany Anderson, who chairs the Election Officials of Arizona’s legislative committee, said she identified the problem and coordinated with other counties on the proposed legislation, which they had the Arizona Association of Counties convey to Senate staff.",
    "They select the district’s chair and other leadership positions, select members of their party’s state committee, and if legislators from their district and their party vacate their seats, the precinct committeemen select a list of candidates to fill the vacancy.",
    "“With regards to whether or not they’ll receive an emergency clause to kick this in … I would be interested to hear a compelling case they could make to myself and my caucus why we should do that,” Bolding told the Arizona Mirror.",
    "In Maricopa County in 2020, fewer than 50 of about 2,200 possible precinct committeeman elections were canceled because they were fewer candidates than PC slots, according to Maricopa County Recorder Stephen Richer.",
    "Because some counties won’t finish drawing their new precincts until later this month, some PC candidates wouldn’t be able to collect or submit their signatures until late in the filing period, which began Monday.",
    "The legislation was introduced and unanimously approved in less than a day so it would be in place on Monday, when candidates can legally begin submitting their nomination petitions to qualify for the ballot.",
    "So, to guarantee that they have at least one PC for those precincts, Toma said the bill was intended to create an appointment process for them while retaining the other parts of the election process.",
    "The bill also included another provision, misunderstood or unread by many legislators, that makes drastic changes to the process for selecting party officials known as precinct committeemen.",
    "If you’ve looked at Twitter today you know what I’m talking about,” Megan Kintner, a lobbyist for the Arizona Association of Counties, told county election officials in an email on Sunday.",
    "“Members are just being hammered by their PCs right now, many of whom believe that there is some kind of conspiracy to disenfranchise them by canceling the election and appointing them.",
    "And Senate President Karen Fann said the Senate Government Committee will hear a bill to fix the problem on Tuesday, with final passage hopefully coming in the chamber on Wednesday.",
    "Many political activists, largely on the Republican side, went into a rage over the weekend when they realized that a provision of House Bill 2839 eliminated PC elections in 2022.",
    "He also noted that there are varying interpretations of the PC provisions of HB2839, and that Republicans’ reading of the bill now is completely different than it was last week.",
    "Lawmakers last week approved legislation intended to standardize the number of signatures that congressional and legislative candidates need to get their names on the ballot.",
    "The disputed language in Section 4 of the bill, or at least the suggestions that legislative staff used to draft the bill, came from election officials in several counties.",
    "House Minority Leader Reginald Bolding, D-Phoenix, said the Republicans can pass whatever they want with a simple majority, but he wouldn’t commit to supporting the plan.",
    "The process was thrown into disarray and confusion by a combination of changes to election laws in recent years, the redistricting process and delays in the 2020 Census.",
    "Because state law prohibits precincts from covering more than one congressional or legislative district, counties have to redraw some of those precinct boundaries.",
    "Legislators can implement new laws immediately, but that can only be done with an emergency clause, which requires a two-thirds supermajority in each chamber.",
    "Instead, those positions will be appointed by county political party organizations, with the county boards of supervisors signing off to make it official.",
    "The purpose of that section of the bill was to ensure that new precincts that are being redrawn because of the redistricting process get at least one PC.",
    "Undoing an emergency change to the way elected political party activists are chosen is proving more difficult than passing the law in the first place.",
    "All three Democrats in the House Rules Committee on Monday voted against permitting the bill to be introduced after the deadline for new legislation.",
    "Arizona Mirror is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "State law ensures that each precinct gets at least one PC, but also an additional PC for every 125 voters a political party has in a precinct.",
    "That means at least four Democrats in the Senate and nine in the House must support the plan, presuming it has unanimous Republican backing.",
    "“The intent was never to mess with the current process for all the precincts that already exist,” said Toma, a Republican from Peoria.",
    "By early Monday afternoon, a new proposal to eliminate that part of HB2839 had been introduced in the House of Representatives.",
    "Espinoza was one of the three Democrats to vote against allowing the new bill to be introduced in the House Rules Committee.",
    "Many of them are also worried that this gives the parties and their respective (board of supervisors) too much power.",
    "PCs, as they’re known, are elected in primary elections, and form the activist base of Arizona’s political parties.",
    "Though both major parties have PCs, the issue is more central to Republican grassroots activity than to Democrats.",
    "To eliminate what some viewed as the unfairness of that, the positions would all be appointed this year instead.",
    "GOP party officials, activists and others agitated throughout the weekend, hounding lawmakers over the issue.",
    "Fann, R-Prescott, described the issue similarly in a statement she posted on Twitter over the weekend.",
    "Precinct committeemen are voting members of a political party’s legislative district organization.",
    "At the end of the day, our people are our voices, so whatever our people want is what we’ll do.",
    "House Majority Leader Ben Toma said those two provisions were unintentional drafting errors.",
    "Most legislation doesn’t go into effect until 90 days after the legislative session ends.",
    "And whether its intent was to eliminate PC elections depends on who you ask.",
    "Lawmakers now read the bill as eliminating those additional PC positions.",
    "He said Democrats are vetting the bill and are currently neutral on it.",
    "Many interpreted the bill as also eliminating many PC positions.",
    "We serve the people, our people of our great state,” he said.",
    "Rep. Diego Espinoza, D-Tolleson, seemed a bit more receptive.",
    "But Espinoza seemed open to restoring PC elections in 2022.",
    "Contact Editor Jim Small for questions: info@azmirror.com.",
    "However, Democrats could throw a wrench in the plans.",
    "Arizona Mirror maintains editorial independence.",
    "Some of those new precincts have no PCs in them.",
    "Follow Arizona Mirror on Facebook and Twitter.",
    "That Democratic support isn’t guaranteed.",
    "In fact, some have no people at all.",
    "“I think that’s a great way to go."
  ]
}