{
  "id": 17356,
  "mediaId": 2520,
  "date": "2022-03-01",
  "headline": "Arizona Sen. Wendy Rogers censured by Senate after calling for public hangings, attacking Ukraine's president",
  "image": "https://www.gannett-cdn.com/presto/2022/03/01/PPHX/1f6f8dd8-1eff-4100-9302-f6a8d375ca8b-AP22060812352425.jpg?crop=3599,2025,x0,y183&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/03/01/wendy-rogers-republican-censure-arizona-senate/9331363002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stacey Barchenger",
  "authorUrl": "https://www.azcentral.com/staff/2646476001/stacey-barchenger/",
  "termIds": [
    2782,
    4089,
    3019,
    2915,
    1126,
    1489,
    91,
    6157,
    5949,
    6672
  ],
  "sentences": [
    "Still, multiple copies of a draft of the censure obtained by The Arizona Republic show changes were made to remove Rogers’ name from the text, instead calling her the senator from District 6, and removing a reference to “inciting general racial and religious discrimination.” Quintero said she did not know why the language about discrimination was removed.",
    "What led to Rogers' censure\nRogers' Feb. 25 speech to the white nationalist group, calling for public hangings, and her comments on social media over the weekend attacking the president of Ukraine amid the violent invasion of his country, prompted discussions among her peers about taking disciplinary action.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nRogers was no stranger to controversy even before the recent swell of condemnation, however.",
    "Rogers engaged in “conduct unbecoming of a senator, including publicly issuing and promoting social media and video messages encouraging violence against and punishment of American citizens and making threatening statements declaring 'political destruction' of those who disagree with her views.",
    "\"They have yet to be justly punished for the crimes they have committed.”\nRogers doubled down with antisemitic sentiment and conspiracy theories on social media over the weekend, and her criticism of Ukrainian President Volodymyr Zelenskyy set her apart from GOP leaders in Arizona — like Gov.",
    "On Monday, in response to talks about a censure, Rogers wrote on Telegram she would \"personally destroy the career of any Republican who partakes in the gaslighting of me simply because of the color of my skin or opinion about a war I don’t want to send our kids to die in.\"",
    "Republican and Democratic state senators joined together Tuesday in a historic vote to censure Sen. Wendy Rogers following violent and discriminatory comments she made to a white nationalist conference and on social media attacking the president of Ukraine.",
    "Rogers ignored a reporter's questions following the vote and dismissed the censure on her social media as akin to her peers saying “we don’t like your mean tweets.” Petersen quickly left and did not return a call asking him to explain his vote.",
    "Senate President Karen Fann said this was not a freedom of speech issue and that she would not tolerate members threatening each other and calling fellow Republicans \"communists,\" which Rogers did early in the day on social media.",
    "Hit me all you want.”\nGovernor under fire for support\nRogers' appearance at the conference didn’t faze Ducey last week, who was subsequently criticized by media commentators and progressive groups for not condemning Rogers.",
    "Although he believed in the censure and is \"opposed to the kind of rhetoric that we heard\" from Rogers, he's able to separate \"personality from policy\" and he'll work with anybody who comes up with good bills, he said.",
    "And no one should accept this member's winking, transparently false excuses for her behavior.”\nSeparately, in a speech on the House floor, Sen. Alma Hernandez, D-Tucson — who is Jewish — spoke briefly about Rogers.",
    "\"If we try some of these high-level criminals, convict them, and use a newly built set of gallows, it’ll make an example for these traitors who have betrayed our country,\" she said in the video speech.",
    "Two other Republican senators, Kelly Townsend, R-Mesa, and David Gowan, R-Sierra Vista, and one Democratic senator, Victoria Steele, D-Tucson, did not attend the session, and did not vote.",
    "But asked whether he continued to support Rogers, Ducey said he needed governing majorities to get his agenda passed, and that she was better than her Democratic opponent, Felicia French.",
    "I strongly believe our public policy debates should be about creating opportunity for all and making our state a better place, not denigrating and insulting any individual or group.\"",
    "\"So today is the day where we find out if the Communists in the GOP throw the sweet grandma under the bus for being white,\" she wrote on her Telegram channel prior to Tuesday's vote.",
    "While \"everybody\" has the right to free speech, \"that does not give you leeway to threaten people or to say whatever you want then claim it's under freedom of speech,\" she said.",
    "Sen. Raquel Terán, D-Phoenix, who also is chair of the Arizona Democratic Party and voted \"yes,\" said the Senate should have expelled Rogers instead of just censuring her.",
    "She needs their votes, however, to pass legislation she’s championed this year, including changes to the election system that her conspiracy-minded constituents want.",
    "\"I don't believe our action today will have any effect on this behavior, but it must be done,\" Rios said, adding that the bipartisan vote sends a \"powerful message.\"",
    "Rogers serves on the powerful Senate Judiciary and Government committees, as well as Health and Human Services and Natural Resources, Energy and Water committees.",
    "But Rogers has publicly supported AFPAC, as it is known, and its leader Nick Fuentes before, despite him being called a white supremacist by federal prosecutors.",
    "Rogers, R-Flagstaff, was the first to speak about her censure, citing a \"corrupted process\" and painting the issue as one of First Amendment free speech rights.",
    "Ducey’s political action committee, Arizonans for Strong Leadership, spent about $500,000 to elect Rogers to the Senate in 2020, campaign finance records show.",
    "It did not include a specific reference to Rogers' antisemitic or racist statements, nor those about Ukraine's president — or even reference Rogers by name.",
    "The senator from District 6 has damaged the reputation of the Arizona state Senate by her actions,\" Sen. Rick Gray said, reading the censure motion.",
    "\"I stand with the Christians worldwide not the global bankers who are shoving godlessness and degeneracy in our face,\" Rogers posted on Twitter.",
    "Gray, R-Sun City, in his comments to the Senate about the censure, suggested he wanted to see Rogers continue to work with her fellow lawmakers.",
    "But even conservative Center for Arizona Policy President Cathi Herrod did not stay silent about Rogers, and voiced support of the censure.",
    "Sen. Rebecca Rios, Senate Democratic leader, said Rogers' \"default behavior\" was to utter \"racist, bigoted, and antisemitic\" statements.",
    "\"These are incredibly divided times, but picking a side in the fight to protect western democracy is an easy call,\" the statement said.",
    "The Senate has a one-vote Republican advantage, meaning Rogers could take revenge on her colleagues by voting against their bills.",
    "In a statement, the Republican governor said Rogers' statements on Ukraine were \"not only ill-advised, but wrong and dangerous.\"",
    "She claimed Zelenskyy was a \"globalist puppet\" for George Soros, the billionaire Democratic political donor, and the Clintons.",
    "\"But what we do not condone is members threatening each other, to ruin each other, to incite violence, to call us 'communist.'",
    "It was the first time in three decades senators publicly censured one of their own members, and the move was applauded by Gov.",
    "Senate GOP leaders are discussing whether Rogers will be removed from committees, majority spokesperson Kim Quintero said.",
    "House Democrats also weighed in, with party leader Reginald Bolding, D-Laveen, saying Rogers should resign.",
    "\"Public discourse should focus on issues not threats, name calling, etc.,\" Herrod posted on social media.",
    "Removing her would be yet another rebuke that would lessen her influence on legislation at the Capitol.",
    "Arizona law doesn’t define a censure, but it is commonly defined as formal statement of disapproval.",
    "That she spoke to the America First Political Action Conference in Florida on Friday raised concern.",
    "Rogers, Sen. Nancy Barto, R-Phoenix, and Sen. Warren Petersen, R-Gilbert, voted against the measure.",
    "It hurts us; it pains us to have to do this,\" said Fann, R-Prescott, who voted \"yes\" on the censure.",
    "\"In the end, I rejoice in knowing I do and say what is right, and I speak as a free American.\"",
    "Thirteen Democrats and 11 Republicans voted for the censure language read on the Senate floor.",
    "She slammed her peers for \"colluding with the Democrats to attempt to destroy my reputation.\"",
    "She is a serial promoter of false claims that the 2020 election was stolen from Donald Trump.",
    "Reach the reporter at maryjo.pitzl@arizonarepublic.com and follow her on Twitter @maryjpitzl.",
    "“Antisemitic and hateful language has no place in Arizona,\" according to Ducey's statement.",
    "Impact of censure vote\nTime will tell whether the censure will subdue or empower Rogers.",
    "Barto said she would issue a statement later, but had not done so by Tuesday evening.",
    "In her speech, Rogers suggested unspecified “traitors” should be publicly hanged.",
    "Doug Ducey, and Senate leaders — who issued statements in support of the country.",
    "\"You’re either against antisemitism or you’re for antisemitism,\" Hernandez said.",
    "As those discussions took place, Rogers pushed back against her own party.",
    "She added in a separate message she would “not apologize for being white.",
    "\"It’s time for all Arizonans to stand up against this hateful rhetoric.\"",
    "Doug Ducey — who just days ago was criticized for his support of Rogers.",
    "Ducey has stayed silent since, but applauded the Senate's vote Tuesday.",
    "\"I have categorically condemned it in the past and condemn it now.",
    "Reach the reporter at rstern@arizonarepublic.com or 480-276-3237.",
    "The censure might not be the only punishment Rogers faces.",
    "Telegram is a messaging app favored by conservatives.",
    "\"(Thank you) #AZSenate for standing for decency.\"",
    "\"This certainly is not something I wanted to do.",
    "“No one should look the other way on extremism.",
    "“We can't be silent,” Bolding said.",
    "Democrats took a much harder tone.",
    "I will always side with freedom.\"",
    "Follow him on Twitter @raystern.",
    "We don't do that to each other.\"",
    "I will not back down,\" she said.",
    "\"It’s Putin versus freedom.",
    "\"I do not apologize."
  ]
}