{
  "id": 1820,
  "mediaId": 2664,
  "date": "2022-02-04",
  "headline": "AZ Republican says death of his bill allowing lawmakers to reject election results was akin to 'lynching'",
  "image": "https://www.rawstory.com/media-library/rep-john-fillmore-youtube.jpg?id=29243765&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/az-gop-rep-says-death-of-his-bill-allowing-lawmakers-to-reject-election-results-was-akin-to-lynching/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sky Palma",
  "authorUrl": "https://www.rawstory.com/u/sky_palma",
  "termIds": [
    3813,
    2782,
    392,
    1126,
    1477,
    5949
  ],
  "sentences": [
    "“Everybody’s lying to me, and I feel like I have a couple hundred ex-wives hanging around me.”\nFrom Rolling Stone: \"Fillmore’s bill would enable the legislature to 'accept or reject' the results of primary and general elections.",
    "Rolling Stone says Fillmore is a \"2020 truther\" -- meaning he promotes conspiracy theories that claim the 2020 election was \"stolen\" from Donald Trump due to mass voter fraud.",
    "It would also severely curtail ballot access by eliminating early voting and voting by mail — practices that aided turnout in highly populated, Democrat-friendly areas.",
    "Rep. Reginald Bolding, the top Democrat in the House, praised the Republican speaker for halting the bill while slamming Fillmore for comparing it to a lynching.",
    "Bowers “does things like he’s God,” Fillmore said, after saying the bill's demise was akin to a “12-committee lynching,” according to the Arizona Daily Star.",
    "'We should have voting — in my opinion — in person, one day, on paper, with no electronic means and hand counting that day.",
    "An Arizona bill designed to allow state lawmakers to reject election results has died in the state legislature.",
    "When the bill was sunk, Republican Rep. John Fillmore compared the move to a \"lynching,\" AZ Family reports.",
    "I don’t trust ABC, CBS, NBC or Fox or anybody out there,” Fillmore said at a committee hearing least week.",
    "House Speaker Rusty Bowers (R) sent the bill to all 12 standing House committees, sealing its fate.",
    "We need to get back to 1958-style voting,' Fillmore said at the hearing.\"",
    "“I don’t care what the press says."
  ]
}