{
  "id": 1968,
  "mediaId": 2672,
  "date": "2022-02-04",
  "headline": "Arizona Republican Compares Opposition to Anti-Democratic Election Bill to a ‘Lynching’",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/02/AP21176023850063c.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/arizona-republican-overturn-elections-bill-blocked-lynching-1295139/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "William Vaillancourt",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "An Arizona bill that would allow state lawmakers to reject election results was essentially doomed by a parliamentary procedure that the bill’s lead sponsor compared to a “lynching.”\nRepublican House Speaker Rusty Bowers on Tuesday sunk the bill by assigning it not just to one or two House committees, but to all 12 of them, meaning it’s extremely unlikely the bill will ever reach the floor.",
    "“The point is, when we gave a fundamental right to the people, I don’t care if I win or lose, that right was theirs.”\nRep. Reginald Bolding, the top Democrat in the legislature, praised Bowers, and had a fitting response to Fillmore’s poor choice of words.",
    "Republican Rep. John Fillmore lamented the move, describing the effort to block the state legislature from being able to reject election results as a “12-committee lynching,” according to local station KPHO/KTVK.",
    "“Everybody’s lying to me, and I feel like I have a couple hundred ex-wives hanging around me.”\nFillmore’s bill would enable the legislature to “accept or reject” the results of primary and general elections.",
    "“Sometimes there are a great many of the legislators [who] don’t have the intestinal fortitude to do what is right.”\nFillmore is a 2020 truther who has said he doesn’t believe the election results.",
    "“We’ve seen language used by Mr. Fillmore that’s just inappropriate from a lawmaker, and that language leads to those same type of policies,” he said, according to KPHO/KTVK.",
    "Bowers, however, believes the bill is unacceptable, and and called its proponents a “screaming, demanding, arrogant, self-righteous bunch,” according to the Daily Star.",
    "It would also severely curtail ballot access by eliminating early voting and voting by mail — practices that aided turnout in highly populated, Democrat-friendly areas.",
    "“For somebody to say we have plenary authority to overthrow a vote of the people for something we think may have happened, where is [the evidence]?” Bowers said.",
    "“We should have voting — in my opinion — in person, one day, on paper, with no electronic means and hand counting that day.",
    "I don’t trust ABC, CBS, NBC or Fox or anybody out there,” Fillmore said at a committee hearing least week.",
    "Bowers “does things like he’s God,” Fillmore complained, according to the Arizona Daily Star.",
    "We need to get back to 1958-style voting,” Fillmore said at the hearing.",
    "“Jim Crow-type language leads to Jim Crow-type policies.”",
    "“I don’t care what the press says."
  ]
}