{
  "id": 2492,
  "mediaId": 8345,
  "date": "2022-02-04",
  "headline": "GOP bill would require some Arizona early voters to show ID",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2021/10/19/Vote_2022_web.jpg",
  "link": "https://kdminer.com/news/2022/feb/04/gop-bill-would-require-some-arizona-early-voters-s/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://kdminer.com/staff/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "The measure is one of dozens of bills under consideration that would overhaul the way votes are cast and counted in Arizona after former President Donald Trump and his allies falsely claimed that he lost in Arizona and other battleground states because of fraud.",
    "PHOENIX - Arizona Republican lawmakers on Wednesday advanced legislation requiring voters to show identification when they drop off a mail ballot at a polling place, a move that election officials say would lead to longer lines on Election Day.",
    "Meanwhile, the committee Republicans also voted along party lines to outlaw automatic voter registration, a process in several states that uses driver's license data to register voters and update addresses unless they opt out.",
    "Rep. Jake Hoffman, a Queen Creek Republican who sponsored the bill, said it would “provide additional security to guard against illegal voters.”\n“This has nothing to do with voter suppression,” Hoffman said.",
    "She said it would create longer lines at polling places as voters who have always just dropped their completed ballot in a box would have to wait in queue to provide the necessary documentation.",
    "The ballots are collected at a central warehouse, where workers confirm the signature on the outside of the ballot envelope matches signatures on file.",
    "The measure would not apply to ballots returned at dropboxes or through the mail, a differentiation that troubled some of the bill’s critics.",
    "Arizona election laws don't allow for automatic registration, but Hoffman, the bill sponsor, said he wants to ensure it's explicitly banned.",
    "Those delivering ballots for others in their household would also have to sign a statement attesting they're authorized to deliver it.",
    "“This is voter suppression, and it will make our lines much longer,” said Rep. Reginald Bolding, the top Democrat in the House.",
    "Jennifer Marson, executive director of the Arizona Association of Counties, said county election officials oppose the measure.",
    "In 2020, 90% of Arizona voters used a ballot that arrived in the mail, which can be returned through the U.S.",
    "The bill would require poll workers to verify the ID of people delivering mail ballots to polling places.",
    "Democrats said it serves no purpose but would make it harder for people to use the early voting system.",
    "Republicans on the House Government & Elections Committee approved the measure in a party-line vote.",
    "Postal Service, an official drop box run by county election officials or to a polling place."
  ]
}