{
  "id": 2513,
  "mediaId": 5308,
  "date": "2022-02-04",
  "headline": "Arizona Republicans Wanted to Throw Out Election Results. But Everything’s Fine!",
  "image": "https://video-images.vice.com/articles/61fd5a558c339c0093a41b54/lede/1643993958554-arizona-gop-recount.jpeg?image-resize-opts=Y3JvcD0xeHc6MC44NDN4aDsweHcsMHhoJnJlc2l6ZT0xMjAwOiomcmVzaXplPTEyMDA6Kg",
  "link": "https://www.vice.com/en/article/bvnyjd/arizona-republicans-wanted-to-throw-out-election-results-but-everythings-fine",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Blest",
  "authorUrl": "https://www.vice.com/en/contributor/paul-blest",
  "termIds": [
    0
  ],
  "sentences": [
    "The bill would have cracked down on early voting, among other things, but the major point of contention was a provision that the Legislature would come into special session after every primary and general election “to review the ballot tabulating process for the regular primary and general elections and on review shall accept or reject the election results.”\nLast year, the Arizona Senate contracted the Florida-based company Cyber Ninjas, with no previous election auditing experience, to conduct an audit for the 2020 presidential election, but their report found that former President Donald Trump had lost Arizona by an even bigger margin than the official count.",
    "Although his counterpart in the Senate, Sen. Karen Fann, enabled Trump’s conspiracy theories by contracting Cyber Ninjas on behalf of the Senate to audit the election, Bowers said in December 2020 that he supported Trump during the election but that he “cannot and will not entertain a suggestion that we violate current law to change the outcome of a certified election.” Bowers’ house was later picketed by Trump supporters.",
    "“If 20 percent of the people in this country have confidence in the election, the next step could be volatile and dangerous.”\nFillmore denied that he was a pro-Trump fanatic, saying “some of the Trump people have been very upset” with him in the past for endorsing another Republican presidential candidate over Trump.",
    "Rep. Reginald Bolding, the top Democrat in the Arizona House, told KTVK that Fillmore’s comparison of his bill being stopped to lynching was “inappropriate for a lawmaker.”\n“That language leads to these same type of policies, Jim Crow-type language leads to Jim Crow-type policies,\" Bolding, who is Black, told KTVK.",
    "I control the state legislature.”\nAsked if the provision in his bill was motivated by Trump’s false claims about the legitimacy of the 2020 election, Fillmore declined to say but referenced a January ABC News poll that found only 20 percent of Americans had confidence in our elections.",
    "Then, when the state House Speaker from their own party shut it down Tuesday, Rep. John Fillmore, the sponsor of the bill compared the maneuver to a “lynching.” Speaking to VICE News via phone Friday, Fillmore said he “absolutely” stood by his previous comment.",
    "But he said he voted for Trump in 2020, and he was one of dozens of conservative state legislators who wrote a letter to then-Vice President Mike Pence prior to Jan. 6 asking if he would postpone the certification of Joe Biden’s election win.",
    "“For somebody to say we have plenary authority to overthrow a vote of the people for something we think may have happened, where is [the evidence]?”\nThis isn’t Bowers’ first clash with the pro-Trump wing of the party.",
    "Doug Ducey signed legislation last year that could remove thousands from the state’s Permanent Early Voting List, in a state where absentee voting had already been the norm for years before the coronavirus pandemic.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "But House Speaker Russell “Rusty” Bowers—also a Republican—pulled a parliamentary maneuver effectively killing the bill Tuesday, by assigning it to all 12 committees in the Arizona House.",
    "On Wednesday, Bowers told Arizona’s Capitol Media Services that he was tying up the bill in committees because the provision on rejecting election results was unacceptable.",
    "Despite killing the bill, Bowers has helped oversee a tightening on voting rights in Arizona amid GOP fury over Trump’s loss in the former Republican stronghold.",
    "Fillmore said he would have been willing to cut the provision and that his problem was more with Bowers’ unilateral action than with the criticisms of the bill.",
    "And this week, Republicans in the House pushed forward on a bill that would require absentee voters to show their IDs when they drop off ballots.",
    "Arizona Republicans introduced a bill this week that would allow the Legislature to throw out an election.",
    "“This is voter suppression, and it will make our lines much longer,” Bolding told the AP Wednesday.",
    "Fillmore called Bowers’ maneuver a “12-committee lynching” in an interview with KTVK Wednesday.",
    "Fillmore introduced the bill earlier this week along with more than a dozen GOP co-sponsors.",
    "“We gave the authority to the people,’’ Bowers said.",
    "“We’re in a precarious situation,” Fillmore said.",
    "Fillmore said Bowers’ message was that “I’m God.",
    "Follow Paul Blest on Twitter.",
    "Seriously.",
    "Gov."
  ]
}