{
  "id": 3352,
  "mediaId": 8475,
  "date": "2022-02-02",
  "headline": "Az Democrats call on Republicans to support paid leave, affordable housing",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/construction-house-1024x657.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/020222_az_dems_housing/az-democrats-call-republicans-support-paid-leave-affordable-housing/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gloria Gomez",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110050",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Our initial reading suggests this would represent the most aggressive and restrictive zoning preemptions in the country, should it pass,\" Guillen said in an email, adding that it would radically remove decision-making authority from local governments and effectively do away with public input into decisions that directly affect property rights and values.",
    "Glendale Democrat Sen. Martin Quezada announced he has introduced Senate Bill 1586, which would repeal the current ban on rent control and adds a six-month grace period for tenants to pay their unpaid rents after eviction moratoriums expire.",
    "The funding to remedy this inequality and better protect all Arizonans is available in the estimated $2.1 billion dollar legislative surplus and billions of federal pandemic aid from the American Rescue Plan that the state hasn't yet spent.",
    "COVID-19 also influenced her interest in proposing the bill: Expanding leave means people dealing with pandemic-related deaths of family members have more time to spend with those relatives and take a moment to recover from the loss.",
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nKaiser said the housing crisis in Arizona necessitates immediate action.",
    "Arizona Democrats urged their Republican colleagues to support legislation that would ensure paid family and medical leave and greater access to affordable housing at a Tuesday press conference in front of the state Capitol.",
    "Rios criticized what she called \"irresponsible budgetary proposals\" from Republicans that harmed the state's economy, and said recent efforts from fellow Democrats are meeting the real needs of Arizonans.",
    "René Guillen, a deputy director for the organization, told the Arizona Mirror that the bill would harm \"every community in every part of the state\" and do nothing to actually make housing more affordable.",
    "He reprimanded government entities for being \"dormant\", and said HB2674 would take action by eliminating unnecessarily complex zoning processes that prevent the housing industry from remedying the issue.",
    "\"If people are frustrated with not being able to afford a home, not being able to afford an apartment, they need to contact their representatives and senators and say support HB2674,\" he said.",
    "And a 2021 report from the National Low Income Housing Coalition stated that Arizona only has 26 affordable housing options for every 100 low income households.",
    "Frontline workers were the most affected by COVID-19 because they were unable to switch to a remote model and were more likely to be people of color, he said.",
    "The Phoenix Republican introduced House Bill 2674 with Rep. Cesar Chavez, D-Glendale, as an across the aisle effort to increase access to affordable housing.",
    "The bill orders municipalities to construct 8 single family homes or twelve duplexes per acre, at a minimum, on land designated for home construction.",
    "Martinez has been sick twice, and because he doesn't have access to paid leave like full-time teachers do, he was forced to miss out on needed income.",
    "The bill amends zoning laws to make it easier to build homes and invests $89 million into the state Housing Trust Fund to help reduce homelessness.",
    "The bipartisan bill would introduce by-right zoning, letting builders construct homes as long as height and land density requirements are met.",
    "The UA School of Journalism started the fellowship in 1977 to honor Don Bolles, an Arizona Republic reporter killed in a 1976 car bombing.",
    "The bill blindsided the League of Arizona Cities and Towns, which represents the interests of Arizona municipalities at the legislature.",
    "Terán noted that many small businesses are financially unable to provide paid leave to their employees compared to large corporations.",
    "Quezada said that rent in Arizona is enormously outpacing wage increases, and that the state ranks fourth worst in affordable housing.",
    "Chavez noted that crises like the recession and ongoing pandemic have resulted in a housing supply shortage and growing homelessness.",
    "Rep. Reginald Bolding, the Democratic House Minority Leader, called on the governor and republican lawmakers to invest in Arizonans.",
    "Sen. Raquel Terán, D-Phoenix, proposed a measure that would give every Arizonan 24 weeks of paid family and medical leave a year.",
    "Senate Minority Leader Rebecca Rios said that Republican proposals have so far failed to meet the needs of Arizonan workers.",
    "As many as 270,000 houses are needed to meet demand, according to an estimate from the Arizona Department of Housing.",
    "\"I'm not asking for a handout, I'm asking for the bare minimum: respect and dignity for Arizona workers,\" he said.",
    "\"Affordable housing is a human right and the best way to ensure financial stability in our communities,\" he said.",
    "That's why it is so important that, as Democrats, we prioritize investments in Arizona's communities,\" she said.",
    "Kaiser anticipates resistance to the bill, but hopes the public will help convince his colleagues to support it.",
    "Gloria Gomez is a senior at the University of Arizona and the 2022 UA School of Journalism’s Don Bolles Fellow.",
    "\"We're introducing this bill for the 63% of Arizona workers who don't have access to paid leave,\" she said.",
    "\"We know that healthy communities and empowered workers are the backbone of Arizona's economy.",
    "These issues, he said, affect constituents in every legislative district of every politician.",
    "The future of Arizona can be one where everyone has equal opportunity to thrive,\" he said.",
    "Quezada called on legislators to support both his bill and Teran's, which he co-signed.",
    "Rep. Steve Kaiser is one GOP legislator who is answering the call for bipartisanship.",
    "15 in the nation for rent increases last year, with average rent jumping 26% in 2021.",
    "Parents, she said, are forced to return to work almost immediately after childbirth.",
    "A report this week by real-estate tracking firm Redfin found that Phoenix was No.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "\"Every day we delay those 270,000 homes, the problem gets bigger,\" he said.",
    "Eleazar Martinez, a local substitute teacher, is one of those workers.",
    "Senate Bill 1644 is the second attempt to guarantee these benefits.",
    "Nevada, the worst ranked, had just 20 options, by comparison.",
    "Bolding recalled the uneven impact of the pandemic.",
    "\"Our state's potential is unlimited.",
    "- 30 -",
    "."
  ]
}