{
  "id": 3394,
  "mediaId": 8261,
  "date": "2022-02-02",
  "headline": "Black History Month kick off in Chandler",
  "image": "https://azinformant.com/wp-content/uploads/2022/02/IMG_3937-scaled.jpg",
  "link": "https://azinformant.com/2022/02/03/black-history-month-kick-off-in-chandler/",
  "mediaOutlet": "Arizona Informant",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darnell Hill",
  "authorUrl": "https://azinformant.com/author/darnell/",
  "termIds": [
    0
  ],
  "sentences": [
    "Included among speakers were Chandler Mayor Kevin Hartke; City Councilman OD Harris; Congregational Church of the Valley Pastor Victor Hardy, who is co-founder of the Chandler Men of Action; Arizona State Representative Reginald Bolding; Greater Phoenix Urban League Economic Empowerment Director Jerry McPherson; Roy Tatem, community leader/entrepreneur; NAACP East Valley President Kiana Sears; Arizona Informant Newspaper Publisher Cloves Campbell Jr., who is also the Arizona Commission of African American Affairs executive director.",
    "“The beautiful thing about our people is that there isn’t a part of our planet that we haven’t touched.”\nMaricopa residents, Jouven and Danielle Lemorin, brought their 9-year-old twins, Rihanna and Elianna, who participated in a scavenger hunt highlighting Black History Month trivia at the museum.",
    "I never thought I would see it happen this quickly.”\nCalling himself an “OG,” he recognized past individuals who “gave us every opportunity to help us along the way,” and present influencers contributing to the Black community’s growth locally and abroad.",
    "While touting a “visible and vibrant community,” BASE Arizona President Keasha Beach introduced a lineup of motivational speakers arranged by the organization, which has a mission of promoting and addressing opportunity gaps in the Black community.",
    "By Dee Ford Byas\n“Black history is American history” and history in the making, so says several special guests to hundreds who convened outside Chandler Museum, receiving enccouragement to keep growing and exemplifying Black representation.",
    "Adding how the Arizona Informant newspaper is “about reporting Black history,” he stressed for people to continue making history daily since “Black history is our history, every time that you wake up.”\n“It’s all about our history.",
    "BASE — Black Alliance Social Empowerment — nonprofit organization Arizona presented, “The Black Family: Representation, Identity, Diversity, Health & Wellness,” on Friday, Jan. 31, for a Black History Month event in Chandler.",
    "“I want them to learn more of Black history, what Black people have done for this world,” the mother said, adding she also wanted to know specifically about Black history in Arizona since she is not a native.",
    "“I think it’s important that whenever Black people are building community that we connect with the ancestors and help build the connection that they started to build for us,” said Orelias.",
    "“Your children will have to know what our real history is about.”\n“In many schools, there is a movement to take away our history, but I know that Black history is American history.",
    "Similarly, Jasmine Brown, of Phoenix, wanted her children, Jahmon, 5, Jahziah, 6, Ahmoni, 8; and Brooklyn, whose ninth birthday is Feb. 11, to learn more about their history.",
    "She and her soon-to-be in-laws had a food truck with a vegan menu at the affair that was filled with food, entertainment, and activities.",
    "Marcus Orelias, of Chandler, attended the event with his mother Deundra Fenley, of Phoenix, and a friend, Patricia Butts, of Maricopa.",
    "Having so many Black people out here is a feat itself,” Campbell said to the diverse Chandler crowd.",
    "He noted the importance of helping others reach a level of success and benefit the community.",
    "Comment *\nSave my name, email, and website in this browser for the next time I comment.",
    "We have the ability to achieve and do whatever we set our minds to,” said Bolding.",
    "“I never thought I would have seen this many Black folks at one place at one time.",
    "“I am so proud of the city of Chandler for doing what you are doing tonight.",
    "If we talk about white folks’ history, it’s the white man’s story.",
    "“When people move to Arizona, they slide in and just do nothing.",
    "They’re definitely going to know where we come from,” she said.",
    "Teach people about our history … Our history is our history.",
    "They perused the museum’s Black History Month exhibit.",
    "Do something when you get to Arizona,” said Campbell.",
    "We cannot let people change our history right now.",
    "“They need to learn more about their roots.",
    "It’s his story,” Campbell said."
  ]
}