{
  "id": 3640,
  "mediaId": 8475,
  "date": "2022-01-27",
  "headline": "Voting restrictions advance in Arizona statehouse",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/012722_flag-arizona-capitol.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/012722_az_voting_restrictions/voting-restrictions-advance-arizona-statehouse/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael McDaniel",
  "authorUrl": "",
  "termIds": [
    2782,
    3417,
    94,
    1477,
    5949,
    6360,
    6667
  ],
  "sentences": [
    "Whether you're a member of a tribal nation, whether you are someone who's part of any particular party, we've seen that this has been overwhelmingly popular.”\nDemocrats argue the physical monitoring of drop boxes could provide communities with an unreasonable overlay.",
    "Same-day voter registration and ballot chain-of-custody have become hot-button issues in swing states like Arizona since the COVID-19 pandemic forced many to take new measures to provide options for voters to cast their ballots safely.",
    "Both bills sponsored by state Representative Jake Hoffman (R-12) passed by a narrow margin along the party lines (7-6) and will receive consideration from the Rules Committee before it is heard under the final house read.",
    "“I'm a little offended that you think that a woman who works and collects an hourly wage, like I have many a time, just doesn't have the ability to register on time online,” Martinez, a Republican from Maricopa, said.",
    "“We do oppose House Bill 2237 to prohibit same-day voter registration,” said Jody Liggett, a representative of the Arizona League of Women Voters, before the Arizona House Committee on Government and Elections.",
    "Often women, young people, people of color, or low-income voters.”\nLiggett also told lawmakers that child care responsibilities and the demands of hourly work affect women voters’ ability to register.",
    "House Bill 2238, which addresses concerns for the chain of custody of early voting ballots by mandating drop boxes be adequately staffed and physically monitored, was met with criticism by Democrats.",
    "An Arizona House committee voted Wednesday to advance two election reform bills that would prohibit same-day voter registration and the use of unmonitored drop boxes for receipt of early ballots.",
    "“House Bill 2238, I think, is probably one of the most problematic pieces of legislation we've seen thus far,” state Representative Reginald Bolding, D-Phoenix, said.",
    "“Voters who move find themselves purged or thought they updated the registration but find they were mistaken on Election Day should be eligible to vote.",
    "Prohibition of same-day registration disproportionately affects those who find themselves unable to vote because of a name change or change of address.",
    "The bills come after Arizona Republicans contracted the firm Cyber Ninjas last year to conduct an audit of the 2020 election of President Joe Biden.",
    "Proponents of House Bill 2237, which prohibits same-day registration for voters, argue it’s essential to protect the integrity of future elections.",
    "Maricopa County investigated the authenticity of those ballots and found this month that only 37 may have been illegally cast.",
    "“In committee, we know ballot drop boxes provide an opportunity for a number of individuals to have access to democracy.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "Cyber Ninjas found Biden was lawfully elected but identified what it considered to be 53,304 questionable ballots.",
    "Advocates for same-day voter registration argue it is essential to improve voting access for various communities.",
    "“I do believe that this provides an unfunded mandate to our counties,” Bolding said.",
    "From there it may be sent to the State Senate for consideration.",
    "Concerned about keeping quality reporting alive in Tucson?",
    "That drew fire from state Representative Teresa Martinez.",
    "Support TucsonSentinel.com with a contribution today!",
    "- 30 -"
  ]
}