{
  "id": 3895,
  "mediaId": 8261,
  "date": "2022-01-20",
  "headline": "Chandler Holds First MLK Awards Event",
  "image": "https://azinformant.com/wp-content/uploads/2022/01/Screen-Shot-2022-01-20-at-2.13.51-PM.png",
  "link": "https://azinformant.com/2022/01/21/chandler-holds-first-mlk-awards-event/",
  "mediaOutlet": "Arizona Informant",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darnell Hill",
  "authorUrl": "https://azinformant.com/author/darnell/",
  "termIds": [
    2204,
    1640,
    3892,
    4185,
    2782,
    2897,
    260,
    6050
  ],
  "sentences": [
    "They were: Victor Hardy (Lifetime Achivement awardee); Kiana Sears; Monique Hughes; Laura Capello; Ernest Clark, Jr.; Michael Bankston; Juanita Encinas; Angel Encinas; Michael Franklin; Shawn Mitchell; Dr. Bill Crawford; Cianna Kirksey; Dr. Adama Sallu; Faith Johnson; Julia Peixoto-Peters; Lisa Grayer; Ashlee Atkins; Keasha Beach; Crystal Blackwell; Shelby Pedersen; Terri Kimble; Brian Fox; Cristian Brantley; Bardo Brantley; and Derek Kennard.",
    "For the first time in its 110-year history, the City of Chandler hosted the “Keeping the Dream Alive” Awards, in honor of Dr. Martin Luther King Jr.\nCouncilmember OD Harris proposed, spearheaded and organized the initiative on behalf of the Ready Set Go Foundation, with the blessing and support of the Chandler Mayor and Council.",
    "These are Leaders who, among other things, dedicate themselves to level the playing field for disaffected communities across Chandler, provide resources for families in need, educational and wellness programs\nfor children, and the promotion of equal protection under the law.",
    "“Let’s all continue to show Arizona and our elected leaders how Chandler can move past national culture wars by working together, honoring each other, and creating opportunities and policies that foster deeper inclusion,” the Chandler Council stated.",
    "“Bringing a room full of many races and cultures togeth- er to recognize their contributions to our collective goal of diversity, equity and inclusion has meaning.”\nThe event itself was an elegant and moving tribute to the late Dr. King.",
    "Congressman Greg Stanton awarded Congressional accommodations to the award winners, and Councilmembers Harris and Christine Ellis kept the crowd entertained with a jovial and heartfelt back and forth while handing out the awards.",
    "After the tumultuous summer of social and racial reckoning across the country, it was a most welcomed event which honored the ‘unsung heroes” in the Chandler community who work tirelessly to promote meaningful, systemic change.",
    "The honorees were noted as having led the Chandler community forward and having inspired others with their vision, passion, dedication and leadership.",
    "“The beautiful symbolic nature of the many successful and accomplished community members in the City Council Chambers was stunning,” Harris said.",
    "Former state representative Reginald Bolding was given a resounding round of applause after he delivered a dynamic keynote address.",
    "Violinist Bruce Kirkwood gave a moving rendition of “Lift Every Voice and Sing” (often referred to as the Black National Anthem).",
    "They were: Amya Rodriguez (Chandler-Gilbert Community College); Jaylen Jones (Casteele); and Nzinga Lyakaremye (Chandler).",
    "College and high school students associated with Black Student Unions on their campuses also were awarded."
  ]
}