{
  "id": 3929,
  "mediaId": 8476,
  "date": "2022-01-27",
  "headline": "The Daily Agenda: 1958 Is Gonna Be a Good Year",
  "image": "https://media2.fdncms.com/tucsonweekly/imager/u/slideshow/31890792/111806541_l.jpg",
  "link": "https://www.tucsonweekly.com/TheRange/archives/2022/01/27/the-daily-agenda-1958-is-gonna-be-a-good-year",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Leingang and Hank Stephenson",
  "authorUrl": "https://www.tucsonweekly.com/author/rachel-leingang-and-hank-stephenson",
  "termIds": [
    0
  ],
  "sentences": [
    "House Bill 2596 is a multifaceted assault on the concept of democracy, but the top headline-grabbers are provisions to:\nOutlaw mail voting and severely restrict early in-person voting\nRequire humans, rather than machines, to count the millions of ballots cast on Election Day within 24 hours\nRequire the legislature to approve or reject the results of every election\nIt’s hard to overstate the audacity of lawmakers trying to give themselves authority to deny our elections, or their brazenness in trying to outlaw a secure mail-in ballot system that more than 80% of voters utilize.",
    "A small group of racist election deniers under the banner of the Patriot Party rallied at the Capitol yesterday to praise HB2596 (and the “QAnon Shaman”) while badgering the elderly for wearing masks, throwing up Nazi salutes and harassing House Democratic Leader Reginald Bolding, who is Black, for wearing a “slave muzzle.”\nBowers quickly banished the bigot from the building, but we have yet to see any sponsors of the bill denounce the abhorrent behavior of their supporters.",
    "Date - Total\n1/7 - $50,000\n1/10 - $100,000\n1/11 - $150,000\n1/12 - $200,000\n1/13 - $250,000\n1/14 - $300,000\n1/18 - $350,000\n1/19 - $400,000\n1/20 - $450,000\n1/21 - $500,000\n1/24 - $550,000\n1/25 - $600,000\n1/26 - $650,000\n#CyberNinjasFine#CyberNinjasFines pic.twitter.com/J4f9qg56r9\n— CyberNinjasFineTracker (@NinjasTracker) January 27, 2022\nOne day’s worth of Cyber Ninjas’ fines would be enough to ensure our little newsletter’s survival for months.",
    "The records will disappear just like the company: As Doug Logan, the former CEO of the former company formerly known as Cyber Ninjas, is set for a deposition in court today about his refusal to turn over public records, the Arizona Senate’s attorney in the case warned that the records may vanish before the court gets them from a data center that “exists or is rumored to exist,” the Capitol Times’ Kyra Haas reports.",
    "Doug Ducey called on U.S. Department of Homeland Security Secretary Alejandro Mayorkas to resign after Mayorkas acknowledged in a secretly recorded meeting with Border Patrol agents in Yuma that the Biden administration policies are not super popular with agents and said the border situation is “worse now than it, frankly, has been in at least 20 years, if not ever.\"",
    "The resumed voting on the unrelated bill\nStop getting scammed by Gateway Pundit https://t.co/9isqbPWcWv\n— Donny Ferguson (@DonnyFerguson) January 26, 2022\nShe’s a thorn in the side of power, an angel to the homeless: The Republic’s Jessica Boehm really summed up Arizona’s approach to the problem of elderly homelessness with the headline: “You’re old.",
    "So today seems like a good day to highlight Kavanagh’s House Bill 2016, which would beef up laws against protesting outside a person’s house “or dwelling.”\nWe mentioned a few weeks back the case of Tennessee state Rep. Jeremy Faison trying to pull a referee’s pants down at a high school basketball game — and then offering a pretty great apology.",
    "Just when we were worried she would starve: U.S. Sen. Kyrsten Sinema will continue to receive the life-sustaining infusions of attention that she medically requires now that Supreme Court Justice Stephen Breyer is retiring and the fate of the country is once again in her hands.",
    ": Republic columnist Laurie Roberts asks how AG Mark Brnovich can be expected to fairly do his job of investigating claims of fraud — or, for that matter, the national conspiracy to drum up fake electors — while he’s sucking up to the former president on the campaign trail.",
    "Cronkite News’ Camila Pedrosa reports that an Appeals Court panel ordered the lower court to look at Edward Lee Jones’ argument that prison officials unequally applied the ban by confiscating materials from Black artists more often than other types of content.",
    "We’re specifically talking about Republican Sen. Paul Boyer, at very least, who told the Yellow Sheet Report yesterday that he would kill Fillmore’s bill as well as legislation to add “fraud countermeasures” to ballots and to outlaw ballot tabulation machines.",
    "3+ million ballots with 20 to 100 contests on each one and hand counted by what would easily be around 16,000 people with a 9pm deadline for results when polls close at 7 and no one who supports this thinks that adjudicating these properly won't be an issue?",
    ": After five years of work crafting a plan for 100% carbon-free energy by 2050 that appeared on the verge of passage, Arizona Corporation Commissioner Jim O’Connor flipped his vote at the last minute and killed it, the Republic’s Ryan Randazzo reports.",
    "“(I)t seems painfully clear — to me, at least — that you can’t be both the attorney general of Arizona, in charge of investigating all aspects of the 2020 election, and a Senate candidate who is chasing Trump’s endorsement,” she wrote.",
    "It’s equally hard to understate the amount of disinformation required to believe that elections would be more secure and accurate if we allowed results to be ordained by thousands of volunteers essentially counting on their fingers.",
    "Doug Ducey made a big show in August of saying Arizona would soon become home to another 300 Afghan refugees who are fleeing the Taliban and were vetted and granted special visas for working with the United States in the war.",
    "— David Weigel (@daveweigel) January 26, 2022\nWarning, results may vary: The Republic’s Jimmy Jenkins is sussing out more details about former Department of Corrections Director Charles Ryan’s armed standoff with police.",
    "The first clue is its main sponsor: House GOP backbencher John Fillmore, who described the bill to Capitol scribe Howie Fischer as a return to “1958-style voting,” presumably without a hint of self-awareness.",
    "Unfortunately, they wound up in Scottsdale, where confused state Rep. John Kavanagh posted a fear-mongering video he shot outside their hotel saying nobody knew what was happening, 12News’ Joe Dana reports.",
    "Well, now his colleague, Tennessee Republican Rep. Brandon Ogles, has introduced legislation to make it a felony to attack a referee, and it’s causing some controversy in the Volunteer State.",
    "ICYMI, decertification still isn’t a thing: Former local news anchor Kari Lake is among those spreading fake news that Wisconsin lawmakers have voted to decertify the 2020 election.",
    "More book banning: An Arizona inmate’s lawsuit against the Department of Corrections for confiscating his hip-hop CDs and Nation of Islam books as banned materials will proceed.",
    "Some of Arizona’s MAGA-est legislators introduced their fantasy legislation to eliminate voting as most Arizonans know it and allow lawmakers to decide election results instead.",
    "https://t.co/bcgW2cD4O1 pic.twitter.com/MAGRVxdDVQ\n— Dillon Rosenblatt (@DillonReedRose) January 26, 2022\nThe real trouble with bills like HB2596 isn’t that they’ll become law.",
    "House Speaker Rusty Bowers — who stood up to the former president’s lies early on and never backed down — hasn’t even assigned the bill to committee, though that could change.",
    "It’s that they’re designed to breathe life into the lie that the election was stolen and to give a forum to the kind of people who continue to spew that lie.",
    "O’Connor became the second Republican commissioner to abruptly flip against the plan after Lea Marquez Petersen withdrew her support during a vote last year.",
    "BREAKING: Former AZ prisons director Charles Ryan drank 1/2 bottle of tequila the night of an armed standoff with police at his home, according to his wife.",
    "This is fake news\nSomeone interrupted a vote to introduce a resolution withdrawing electors\nBy rule it automatically went to committee, where it's now dead.",
    "While offering up his clueless livestream diatribe against the Afghan refugees, Kavanagh threatened protests at the hotel where the refugees are staying.",
    "But I’m definitely not gonna file a piece of good legislation because somebody’s done something stupid,” Ogles said of his ref-pantsing colleague.",
    "The man asking Bolding a blatantly racist question (and Nazi saluting) has been embraced by the likes of Kari Lake, Wendy Rogers and Paul Gosar.",
    "Go in a corner and die.” Apparently the best policy Arizona can come up with is to let activist Stacey Champion just pay for hotels.",
    "https://t.co/B0TGYrCHKh\n— Jimmy Jenkins (@JimmyJenkins) January 26, 2022\nSpeaking of resignations that ain’t happening: Gov.",
    "And the few Republicans left at the Capitol who haven’t been brainwashed about election fraud will never go along with it.",
    "Jack Wilenchik, who is still the Cyber Ninjas’ attorney despite his best efforts to quit, says the data is in no danger.",
    "— The AZ - abc15 - Data Guru (@Garrett_Archer) January 26, 2022\nBut sometimes the point of a bill isn’t to become law.",
    "But Ogles said the bill is a total coincidence and has nothing to do with the whole pantsing situation, he swears!",
    "And it’s clear which portion of the base Fillmore and others were trying to satisfy with HB2596.",
    "It turns out the bill has been floating around for a few years, the Tennessee Lookout reports.",
    "Police reports say Ryan pointed a gun at officers who feared for their lives.",
    "Unfortunately, the activist court has not agreed to this idea yet.",
    "His vote is enough to stop it, and he has nothing left to lose.",
    "Maybe the real laws are the racists we meet along the way ...",
    "Putting the QAnon Shaman on the Supreme Court Could Fix That.",
    "Resignations all around ... And watch where you protest.",
    "They were super understanding about the whole thing.",
    "It’s to signal to your base that you hear them.",
    "And what did Brno say at that tarmac meeting?",
    "“That was simply coincidental or bad timing.",
    "Luckily, the bill isn’t going to become law.",
    "It’s literally all in the statement: Gov.",
    "Subscribe now to help us fight back!",
    "I don’t know how you’d call that.",
    "She concluded he should resign.",
    "Biden Isn’t Uniting America.",
    "He was never jailed.",
    "Carbon free by 2055?"
  ]
}