{
  "id": 4305,
  "mediaId": 8476,
  "date": "2022-01-17",
  "headline": "Ducey Budget Would Spend $14.25 Billion Next Year",
  "image": "https://media1.fdncms.com/tucsonweekly/imager/u/slideshow/31846836/ducey-doug-sots2020_4-1536x1024.jpg",
  "link": "https://www.tucsonweekly.com/TheRange/archives/2022/01/17/ducey-budget-would-spend-1425-billion-next-year",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonweekly.com/author/jeremy-duda-arizona-mirror",
  "termIds": [
    0
  ],
  "sentences": [
    "Other major items in Ducey’s budget plan include:\n$127 million in new spending on higher education, including $10 million to cover free tuition for veterans’ spouses; $12.5 million for the scholarship grant Arizona Promise Program; $25.7 million for a public-private partnership with Creighton University for a nursing program; and $46 million for a university program to train students for future high-demand jobs.",
    "Bolding and Rios also criticized Ducey for his three-year proposal on water investment, saying it could simply be undone by his successor and by future legislatures, and for criticizing President Joe Biden’s spending policies while using federal dollars to fund his proposed summer camp for learning loss during the pandemic.",
    "Doug Ducey’s final budget proposal calls for $14.25 billion in spending for the 2023 fiscal year that includes nearly $1.4 billion in new spending, the bulk of which will be one-time spending on K-12 education, water infrastructure, beefing up the state’s rainy day fund and expanding Interstate 10.",
    "On the K-12 front, Ducey’s budget also includes $200 million in building renewal for the next fiscal year, along with $93 million in supplemental building renewal funding for the current fiscal year; and more than $98.4 million to complete or begin construction on eight new schools.",
    "Under the program, D and F-rated schools, along with C-rated schools where at least 60% of the students qualify for free or reduced-price lunch, would receive $150 per pupil over the course of three school years for “evidence-based strategies” to increase student performance.",
    "The governor’s budget also includes $100 million in federal funding for his proposed AZ Back on Track Summer Camp, a summer program to help students catch up math, reading and American civics gains they missed out on during the COVID-19 pandemic.",
    "Ducey’s budget also includes $160 million for other, unspecified water augmentation efforts across the state, along with nearly $150 million for rural water projects, increasing groundwater capacity, water banking and other conservation payments.",
    "The Ducey administration said the budget will include future appropriations for the next two years, when the governor will be out of office, so that his successor would have to expressly repeal it through legislation to block that spending.",
    "But House Minority Leader Reginald Bolding and Senate Minority Leader Rebecca Rios, both of Phoenix, described Ducey’s commitment to K-12 funding as inadequate, and questioned whether last year’s tax cut would jeopardize future investments.",
    "Ducey’s plan assumes that last year’s billion-dollar income tax cut, which is on hold after Democrats collected enough signatures to refer it to the November ballot for a citizen referendum, will ultimately go into effect.",
    "And that’s what Governor Ducey is doing about water.”\nAnother major bucket of one-time spending in the governor’s budget is a major increase to the state’s budget stabilization fund, popularly known as the rainy day fund.",
    "Democratic legislative leaders said there were some positives in Ducey’s budget, such as his investments in water, his increase monthly kinship funding for foster parents and highway widening.",
    "That figure includes $323 million in new spending,\nAmong Ducey’s proposed increases in education funding are nearly $61 million in additional money for his results-based funding program.",
    "Following up on last year’s historic tax cut, which aims to eventually reduce individual income tax rates to a flat 2.5%, the governor is budgeting money for two tax relief packages.",
    "While most of Arizona’s border with Mexico is on federal land, the Ducey administration said it will work with property owners along the border who want fencing on their property.",
    "We think now, the time is right to look at this in a very serious way, a way that’s more serious than what we’ve looked at in the past,” Karamargin told the Arizona Mirror.",
    "Republican lawmakers are discussing plans to repeal the tax cuts and replace them with a similar law in order to negate the referendum and keep the proposal off the ballot.",
    "The administration said there are several lawmakers who have their own proposals, so Ducey will negotiate with the legislature to determine what kind of tax cut they pass.",
    "$24.6 million expand the monthly kinship stipend to foster families from $75 to $300, and increase the monthly allowance for the foster children from $63.45 to $126.90.",
    "His budget plan includes a $50 million deposit in his border security fund for additional patrols, detention, prosecution in border counties and physical barriers.",
    "Ducey’s plan also includes $400 million in federal funding to widen a 20-mile stretch of Interstate 10 between Riggs Road and Casa Grande from two lanes to three.",
    "Families with three or more children would be eligible for as much as $325, according to estimates from the governor’s office, depending on their income level.",
    "The governor called for $1.16 billion in one-time spending on water augmentation, with one-third of that spending being spent in each of the next three years.",
    "The largest chunks of new spending are for K-12 education, water and increasing the state’s rainy day fund, which it uses to alleviate budget shortfalls.",
    "If lawmakers don’t approve an override of the cap, which requires a two-thirds vote in each chamber, schools will lose about $1.1 billion in funding.",
    "According to the Joint Legislative Budget Committee, the state still must provide that funding to schools if the legislature doesn’t raise the cap.",
    "Ducey’s office noted that Arizona has the 10th highest industrial property tax rate in the U.S., indicating that the tax cut could be in that area.",
    "Under Ducey’s budget, state spending on K-12 education would increase to nearly $10.9 billion, which the administration touted as a state record.",
    "They also criticized his decision to put $425 million into the rainy day fund rather than use that money for priorities like water and education.",
    "Arizona Mirror is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "$247 million for salary increases for state employees, including $30.8 million to increase salaries for Department of Public Safety troopers.",
    "“The Board will review and take into account the school’s unique situation and select the best course of action,” Ducey’s budget plan states.",
    "Ducey also wants $20 million for a second year of school transportation grants, and $5 million for an incentive program for civics education.",
    "In his State of the State address on Monday, Ducey spoke specifically about desalination as an important policy for Arizona’s water future.",
    "“What Arizona needs is a Governor who takes the COVID-19 pandemic and our school funding crisis seriously,” Rios said in a press statement.",
    "Karamargin, a spokesman for the governor, said desalination will be part of whatever plan the governor crafts with the legislature.",
    "Another $58 million would go toward a program called Operation Excellence, which would boost funding for low-performing schools.",
    "The physical barriers won’t be the bollard-style fencing that is prevalent along the border, according to the administration.",
    "The Ducey administration said the program is intended to provide tax relief to Arizonans while recognizing the value of work.",
    "$2.4 million for the deactivation of the Arizona State Prison, including the relocation of the inmates housed at the prison.",
    "Schools that don’t make progress after three years would be subject to unspecified action by the State Board of Education.",
    "The $425 million that Ducey’s budget would inject into the fund would hit that mark, increasing the fund to $1.4 billion.",
    "The governor’s office said 577,000 Arizonans would be eligible, and that the average recipient would get $128 per year.",
    "Ducey’s office has said it’s not taking a position on what should happen because it is a legislative function.",
    "$92.9 million for infrastructure needs in the Arizona Department of Corrections, Re-entry and Rehabilitation.",
    "“These things don’t happen quickly, but they don’t happen at all if there isn’t a willingness to think big.",
    "The governor’s budget projects a cash balance of about $1 billion remaining at the end of the fiscal year.",
    "Ducey’s budget plan does not contemplate raising the state’s aggregative spending cap for K-12 schools.",
    "About $364 million of that new spending will be ongoing, with nearly a third going toward new tax cuts.",
    "State action on border security was one of the main items Ducey focused on in his speech on Monday.",
    "The Ninth Floor likened the proposed barriers to the style of fencing that surrounds state prisons.",
    "Ducey in 2019 signed legislation allowing the fund to represent 10% of state revenues, up from 7%.",
    "Ducey’s plan would bring total funding for the program to more than $129 million per year.",
    "The administration said it will work with the legislature to determine the best approach.",
    "The earned income tax relief program is expected to cost about $74 million next year.",
    "Nearly $853 million of the $1.16 billion isn’t earmarked for any particular project.",
    "One is a 5% earned income tax credit for low-income working families with children.",
    "Schools are expected to hit the cap, which voters established in 1980, in March.",
    "$176.7 million for state parks, an initiative aimed at increasing rural tourism.",
    "He expects state revenues to hit nearly $13.8 billion during fiscal year 2023.",
    "Ducey penciled in $58 million in his budget, but has no explicit proposal.",
    "$8.2 million for rising caseload costs at Adult Protective Services.",
    "That program provides additional money to high-performing schools.",
    "“The concept of desalination has been around for a long time.",
    "Contact Editor Jim Small for questions: info@azmirror.com.",
    "The second proposal is an undefined corporate tax cut.",
    "That figure includes $118 million in federal funding.",
    "The technology has changed and improved over time.",
    "Arizona Mirror maintains editorial independence.",
    "But the schools won’t be permitted to spend it.",
    "Follow Arizona Mirror on Facebook and Twitter.",
    "SUPPORT NEWS YOU TRUST.",
    "C.J.",
    "Gov."
  ]
}