{
  "id": 5180,
  "mediaId": 8326,
  "date": "2022-04-21",
  "headline": "Supreme Court won't let Arizona voters weigh in on big tax cut; state's highest earners benefit most",
  "image": "https://www.gannett-cdn.com/presto/2022/04/05/PPHX/b7c88703-3b21-4fc7-8120-0327c28d342b-PNI1Brd_11-01-2020_Republic_1_D008__2020_10_30_IMG_Early_Voting_Phoenix_1_1_V0RJDU69_L1548082689_IMG_Early_Voting_Phoenix_1_1_V0RJDU69.jpg?crop=2999,1687,x0,y0&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/04/21/arizona-supreme-court-wont-let-citizens-vote-flat-tax-referendum/7403390001/",
  "mediaOutlet": "Gilbert Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Jo Pitzl",
  "authorUrl": "https://www.azcentral.com/staff/2646647001/mary-jo-pitzl/",
  "termIds": [
    0
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nPraise and scorn for court's order\nReaction was swift, and sharply divided.",
    "\"We have a co-opted Supreme Court, we have a Legislature that is actively attacking family, kids and schools, and we have a governor that is being run by special interests and donors,\" Lewis said, calling Thursday's news the \"end of democracy.\"",
    "The order came two days after the high court heard arguments that the flat tax, which lawmakers approved last June, can't face a voter challenge because it was a money matter that provided for the \"support and maintenance\" of state government.",
    "Although the court's full opinion, which will explain its reasoning, will come later, Mussi said he's confident it will make it clear that tax measures enacted by the Legislature can't be put on hold until voters decide the matter.",
    "A citizen referendum seeking to overturn a $2 billion tax cut is off the November ballot, the state Supreme Court ruled Thursday, exasperating education supporters but delighting proponents of Arizona's new flat-rate income tax.",
    "\"So now it’s time for voters to take their anger to the ballot box.”\nHe said Arizona voters dismayed by the ruling should elect a governor and lawmakers who will not carve millions out of state revenue through tax cuts.",
    "Beth Lewis, president of the Save Our Schools coalition, which helped circulate petitions to refer the flat tax to the ballot, said no branch of state government is looking out for average citizens.",
    "However, because the tax measure was structured to phase in over three years, income earned this calendar year will be taxed at 2.55% for income up to $55,000 and 2.98% for income above that amount.",
    "\"Republicans continue to attack our schools, teachers and students, despite a majority of Arizonans making it clear time and time again that they want meaningful investments in our public schools.\"",
    "\"When Arizona voters have a voice, they support deeper investments in public education and an end to unsustainable tax giveaways to an elite wealthy few,\" said Rep. Reginald Bolding, D-Laveen.",
    "\"The Supreme Court strikes again,\" said David Lujan, executive director and CEO of the Arizona Children's Action Alliance, part of the Invest in Ed coalition that objected to the tax cut.",
    "The immediate impact is Arizona's income tax is on track to drop to 2.5% for all taxpayers by 2024, and Proposition 307, championed by education and civic groups, is off the ballot.",
    "The order comes just one month after Proposition 208, a tax increase on high-income earners intended to benefit schools, was terminated in the wake of another Supreme Court ruling.",
    "That was echoed by Senate Republicans, who said the legal battle to remove the ballot challenge will \"give money back to the men and women who keep our economy thriving.\"",
    "It would drop down slightly for 2023 income and then level out a flat 2.5% for all income levels for 2024 income, which would be reported in state fiscal year 2024-25.",
    "It overturns a ruling from a Maricopa County Superior Court judge who last year rejected that argument since the tax reduced, and did not add, money to state coffers.",
    "However, the tax was put on hold last fall when education supporters submitted thousands of voter signatures to refer the matter to the 2022 general election ballot.",
    "\"A true democracy should have no problem allowing this to go before the voters of Arizona,\" Senate Minority Leader Rebecca Rios, D-Phoenix, said in a statement.",
    "It's possible lawmakers might want to accelerate that part of the tax formula, but Toma said it needs more analysis before he could say anything definitive.",
    "What's next for taxpayers\nEfforts among Republican lawmakers to \"repeal and replace\" the flat tax aren't necessary since the matter is no longer in limbo.",
    "The highest earners in Arizona will see the biggest benefit from the tax change: as much as a $350,000 savings a year when the tax is fully in effect.",
    "The flat tax, which would take nearly $2 billion out of state revenue when fully implemented in 2024, will \"devastate\" Arizona’s future,\" Lujan said.",
    "\"I'm thrilled,\" said House Majority Leader Ben Toma, R-Peoria and the architect of the flat-tax plan, which was part of last year's state budget.",
    "The club argued that the tax measure is part of the state budget and therefore integral to the support and maintenance of state operations.",
    "\"With inflation hitting Arizonans hard, this decision ultimately means more of their hard-earned dollars can stay in their wallets.\"",
    "That happened successfully with Proposition 301 in 2000 and with a temporary 1-cent increase in the sales tax pushed by then-Gov.",
    "The order left others wondering what kind of recourse citizens have if they disagree with tax decisions made by the Legislature.",
    "\"This ruling is another big win for our state’s taxpayers and it couldn’t have come at a better time,\" he said in a statement.",
    "It translates to a $1 billion reduction for education, since the K-12 budget makes up half of the state's overall spending.",
    "It is the largest tax cut in state history, collapsing a four-tier tax rate that tops out at 4.5% down to 2.5% by 2024.",
    "The Free Enterprise Club, which brought the court challenge, applauded the order and called it a big win for taxpayers.",
    "As for people who think education needs more funding than the Legislature provides, Toma said they have options.",
    "He said lawmakers should listen to those voters rather than write policies that benefit only the wealthy.",
    "\"We've always believed that tax measures are not referable,\" said Scot Mussi, the club's president.",
    "Doug Ducey, who appointed five of the seven justices on the Supreme Court, hailed the decision.",
    "Reach the reporter at maryjo.pitzl@arizonarepublic.com and follow her on Twitter @maryjpitzl.",
    "The lowest earners will benefit about $4 a year, according to legislative budget estimates.",
    "“The voters once again have had their voices silenced by the Supreme Court,\" Lujan said.",
    "Her counterpart in the House of Representatives called the court's ruling a \"new low.\"",
    "“Nothing is preventing them from referring tax increases to the ballot,” he said.",
    "Subscribe to azcentral.com today.",
    "Jan Brewer in 2010, he said.",
    "Support local journalism.",
    "Gov."
  ]
}