{
  "id": 6328,
  "mediaId": 8450,
  "date": "2022-04-12",
  "headline": "En camino, aprobación de cambios para aliviar escasez de maestros en Arizona",
  "image": "https://media.telemundoarizona.com/2022/04/tlmd-arizona-maestros-cambios-certificacion-legislatura.jpg?quality=85&strip=all&fit=1200%2C675",
  "link": "https://www.telemundoarizona.com/noticias/en-camino-aprobacion-de-cambios-para-aliviar-escasez-de-maestros-en-arizona/2214534/",
  "mediaOutlet": "telemundoarizona.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "La representante demócrata Kelli Butler estuvo de acuerdo y señaló que hay 180,000 maestros calificados y certificados en el estado que no están en el salón de clases debido a los bajos salarios, el tamaño de las clases que es el más alto de la nación y otros problemas.",
    "La propuesta respaldada por los republicanos ya fue aprobada por el Senado y recibió la aprobación inicial después de un vigoroso debate en la Cámara el lunes sobre las objeciones de los demócratas, quienes dijeron que permitirá que enseñen personas no calificadas.",
    "PHOENIX- La Legislatura de Arizona pronto podría aprobar cambios en el proceso de certificación de maestros diseñado para abordar la escasez de instructores en el aula al permitir que más personas sin capacitación docente regular dirijan una clase.",
    "El representante demócrata Reginald Bolding, el líder de la minoría, dijo que crear más \"flexibilidad\" para que los aspirantes a profesionales en la mitad de su carrera ingresen al aula para abordar la escasez de maestros no ayudará.",
    "El cambio elimina las restricciones de calificación, lo que permite que alguien con experiencia externa y un título universitario también enseñe desde jardín de niños hasta quinto grado.",
    "La propuesta ampliaría una ley de 2017 que permite a las personas con experiencia en el sector privado obtener un \"certificado de materia\" para enseñar en los grados 6-12.",
    "Agregar maestros no calificados empeorará el problema.",
    "¿Qué dicen los demócratas?"
  ]
}