{
  "id": 10003,
  "mediaId": 2526,
  "date": "2022-04-01",
  "headline": "Battleground State Democrats Panic over Biden Ending Trump-Era Border Controls: ‘A Frightening Decision’",
  "image": "https://media.breitbart.com/media/2022/04/GettyImages-1296728710-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/01/battleground-state-democrats-panic-bidens-ending-trump-era-border-controls-frightening-decision/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    5879,
    5510,
    4905,
    2459,
    1973,
    5963,
    6383,
    6678
  ],
  "sentences": [
    "It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border,” Kelly said:\nFrom my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and non-profits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities.",
    "[Emphasis added]\nSen. Maggie Hassan (D-NH), who like Kelly is facing a tough re-election bid this year, blasted Biden for ending Title 42, writing that the decision “will likely lead to a migrant surge that the administration does not appear to be ready for.”\nEnding Title 42 prematurely will likely lead to a migrant surge that the administration does not appear to be ready for.",
    "On Friday, the Center for Disease Control and Prevention (CDC) announced that the Biden administration would end Title 42 — a broad authority that allows federal immigration officials to quickly return border crossers and illegal aliens to their native countries.",
    "House and Senate Democrats, representing battleground and swing states, are panicking over President Joe Biden’s “frightening decision” to end the Title 42 border control — a move expected to spur the largest wave of illegal immigration in American history.",
    "“Earlier this week, I joined my colleagues across the aisle to express concern and request simple information about how the CDC, DHS, and other federal agencies plan to maintain order and prevent border communities from being overwhelmed,” Gonzalez said.",
    "Even the Senate’s most pro-amnesty lawmaker, Sen. Bob Menendez (D-NJ) told the Washington Post that he is concerned the Title 42 end date on May 23 is likely to give foreign nationals an incentive to prepare for border crossings ahead of time.",
    "— Sen. Maggie Hassan (@SenatorHassan) April 1, 2022\nRep. Vicente Gonzalez (D-TX), running in the 34th congressional district against Republican challenger Mayra Flores, said he is asking Biden to rethink the decision to end Title 42.",
    "Kyrsten Sinema (D-AZ) and Mark Kelly (D-AZ), both of who urged Biden to keep Title 42 in place, said the decision shows the depth to which the White House does not understand the toll illegal immigration has on border communities.",
    "Sen. Joe Manchin (D-WV) called the move “a frightening decision.”\n“Title 42 has been an essential tool in combatting the spread of COVID-19 and controlling the influx of migrants at our southern border,” Manchin said.",
    "As Breitbart News exclusively reported on Friday, federal immigration officials have already apprehended more than one million border crossers and illegal aliens in Fiscal Year 2022 which began October 1, 2021.",
    "“I implore the Administration to provide that information without delay and assure South Texas and communities across the U.S.-Mexico Border have the resources they need,” he said.",
    "As a result, Biden officials admit that anywhere from 500,000 to 540,000 border crossers and illegal aliens are expected to show up at the United States-Mexico border every month.",
    "“Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border,” Sinema said.",
    "I'll keep pushing the administration to strengthen border security & look forward to hearing directly from border agents during my upcoming trip to the border.",
    "This is the equivalent of a population the size of Atlanta, Georgia or Fresno, California arriving at the border over the course of just 28 to 30 days.",
    "“We are already facing an unprecedented increase in migrants this year, and that will only get worse if the administration ends the Title 42 policy.",
    "“For an administration afraid of creating ‘pull factors,’ I fear their delay may create the biggest pull factor of them all,” Menendez said.",
    "We are nowhere near prepared to deal with that influx.”\nSens.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "“This is the wrong decision.",
    "Follow him on Twitter here."
  ]
}