{
  "id": 10016,
  "mediaId": 2572,
  "date": "2022-04-01",
  "headline": "Manchin calls Biden lifting Title 42 border policy 'frightening decision'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/09/Manchin-AP-2.jpg",
  "link": "https://www.foxnews.com/politics/manchin-biden-title-42-border-policy-frightening-decision",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    2765,
    2459,
    4873,
    5510,
    4905,
    5949
  ],
  "sentences": [
    "\"After considering current public health conditions and an increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC Director has determined that an Order suspending the right to introduce migrants into the United States is no longer necessary,\" the Centers for Disease Control said in a statement earlier on Friday.",
    "DEM SENATORS SOUND ALARM OVER REPORTS BIDEN ADMINISTRATION WILL END TITLE 42 BORDER POLICY\nBut along with Republicans and border officials, a number of moderate Democrats have expressed concern that such a move will lead to a surge in the already massive numbers being encountered at the border.",
    "Sen. Joe Manchin, D-W.Va., on Friday tore into the Biden administration’s move to lift the Title 42 border policy at the end of May, calling it a \"frightening decision\" and warning that the extraordinary numbers will \"only get worse\" in the months ahead.",
    "The CDC announced that it will be lifting the Title 42 public health policy, that has been used by both the Trump and Biden administrations to quickly expel migrants at the southern border since the start of the COVID-19 outbreak, on May 23.",
    "DHS Secretary Alejandro Mayorkas on Friday claimed that DHS has \"put in place a comprehensive, whole-of-government strategy to manage any potential increase in the number of migrants encountered at our border.\"",
    "\"Until we have comprehensive, bipartisan immigration reform that commits to securing our borders and providing a pathway to citizenship for qualified immigrants, Title 42 must stay in place,\" he said.",
    "While Title 42 is a public health order, not an immigration policy, it has become one of the central border policies in place as the U.S. faces a continuing crisis of numbers at the border.",
    "Manchin, who this week called for the administration to make Title 42 permanent, said on Friday that Title 42 has been \"essential\" in combating COVID-19 and controlling the migrant flows.",
    "\"We are increasing our capacity to process new arrivals, evaluate asylum requests, and quickly remove those who do not qualify for protection,\" he said in a statement.",
    "\"We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy,\" he said.",
    "\"Today’s announcement by the [Centers for Disease Control] and the Biden administration is a frightening decision,\" Manchin said in a statement.",
    "Mark Kelly and Kyrsten Sinema had voiced their concerns to DHS Secretary Alejandro Mayorkas this week about a potential ending of the order.",
    "Over the next two months, we are putting in place additional, appropriate COVID-19 protocols, including ramping up our vaccination program.\"",
    "\"We will increase personnel and resources as needed and have already redeployed more than 600 law enforcement officers to the border.",
    "\"Ending Title 42 prematurely will likely lead to a migrant surge that the administration does not appear to be ready for,\" she said.",
    "In February, approximately 55% of migrants were returned due to the order, rather than being released into the U.S.",
    "Meanwhile, Sen. Maggie Hassan, D-N.H., expressed her fears about a coming migrant wave.",
    "We are referring smugglers and certain border crossers for criminal prosecution.",
    "Left-wing activists and top Democrats have called for such a move for months.",
    "The administration, meanwhile, has sought to downplay those concerns.",
    "We are nowhere near prepared to deal with that influx.\"",
    "He was not the only Democrat to object to the move.",
    "Arizona Sens."
  ]
}