{
  "id": 10079,
  "mediaId": 2730,
  "date": "2022-04-04",
  "headline": "Schumer's Office Hints That Another Biden Nominee Might Be Doomed",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2018/228/b7b1055c-7ba1-412f-9a14-c4337ab2a2b8.jpg",
  "link": "https://townhall.com/tipsheet/spencerbrown/2022/04/04/it-looks-like-exlos-angeles-mayor-eric-garcettis-nomination-is-doomed-in-the-senate-n2605448",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Spencer Brown",
  "authorUrl": "https://townhall.com/tipsheet/spencerbrown/",
  "termIds": [
    0
  ],
  "sentences": [
    "Jacobs has so far denied the allegations and Garcetti denies knowing about them, but the situation has continued to mire Biden's nominee and led to a new week with Democrats in disarray as they now face the decision of whether to hope Garcetti is soon cleared by investigations and able to secure 100 percent support among Senate Democrats or withdraw the nomination and put forward another nominee.",
    "The admission from Schumer's office again highlights his party's problems in the 50-50 Senate: Democrats won't be able to get Garcetti's nomination through a successful floor vote without all of its members being on-board or, perhaps more unlikely, some Republicans voting for Biden's nominee.",
    "Previously, Biden's nominees to lead the Office of the Comptroller of the Currency and Department of Alcohol, Tobacco, Firearms and Explosives were forced to withdraw their names from consideration after their records proved too controversial to secure passage through the Senate.",
    "In addition, Iowa's Republican Senators Chuck Grassley and Joni Ernst have each placed a \"hold\" on Garcetti's nomination pending an investigation into claims that Garcetti's former Deputy Chief of Staff Rick Jacobs sexually harassed a Los Angeles police officer.",
    "Per Axios:\nThe comments also indicate the growing concern — and confusion — within the Democratic Party about the fate of President Biden’s nominee to serve as ambassador to a crucial country resisting the administration’s efforts to get tougher on Russia.",
    "Source: AP Photo/Richard Vogel\nIt's nothing new for President Biden to find his nominees stalled out in the U.S. Senate, but the latest Biden pick to find himself stranded without a clear path forward after being nominated is a bigger name than others.",
    "Democrats including Richard Blumenthal (D-CT), Mark Kelly (D-AZ), Kyrsten Sinema (D-AZ), and Kirsten Gillibrand (D-NY) have voiced their concerns with what Garcetti knew or how his mayoral office is run.",
    "The reservations from Democrats about Biden's nominee lie mostly with the desire for more information about \"allegations of workplace sexual harassment\" that took place within Garcetti's administration.",
    "Now, according to a scoop in Axios, the office of Senate Majority Leader Chuck Schumer (D-NY) seems to think Garcetti's future is looking bleak and \"unlikely to receive a floor vote any time soon.\"",
    "The cold math of a 50-50 Senate may force Biden to pull Garcetti’s nomination and find another candidate who can be seated as his envoy to the world’s largest democracy.",
    "The delay has also created leadership uncertainty for the nation's second-largest city and its 4 million residents.",
    "Eric Garcetti, the mayor of Los Angeles since 2013, was nominated by Biden to be the ambassador to India in July.",
    "But some eight months later, Garcetti is apparently no closer to leaving L.A. to become a diplomat.",
    "No kidding."
  ]
}