{
  "id": 10090,
  "mediaId": 2730,
  "date": "2022-04-02",
  "headline": "McCarthy Says Biden Admin's Title 42 Repeal Will 'Invite a Lawless Surge of Illegal Border Crossings'",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2019/60/1dc830bb-7654-46e6-aad1-79b4a1bad22f.png",
  "link": "https://townhall.com/tipsheet/landonmion/2022/04/02/mccarthy-says-biden-admins-title-42-repeal-will-invite-a-lawless-surge-of-illegal-border-crossings-n2605416",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Landon Mion",
  "authorUrl": "https://townhall.com/tipsheet/landonmion/",
  "termIds": [
    0
  ],
  "sentences": [
    "Title 42, which was initially implemented by the Trump administration during the early days of the COVID pandemic, allowed U.S. border agents to immediately deport migrants who had illegally entered the U.S. in an effort to mitigate the spread of the coronavirus at migrant holding facilities.",
    "Scott Applewhite\nHouse Minority Leader Kevin McCarthy (R-CA) said that President Joe Biden has \"abdicated his responsibilities\" at the U.S.-Mexico border and warned that the surge in migrants entering the U.S. will only become worse now that Title 42 has been lifted.",
    "DHS Secretary Alejandro Mayorkas claimed Friday that the Department of Homeland Security has \"put in place a comprehensive, whole-of-government strategy to manage any potential increase in the number of migrants encountered at our border.\"",
    "During Biden's first year in office, border agents have encountered more than 2 million migrants attempting to enter the U.S. through the southern border, including a record-breaking 213,593 migrant encounters in July of 2021.",
    "\"Today's decision confirms that President Biden has abdicated his responsibilities at our borders and is actively working to make the border crisis worse,\" McCarthy said in a Friday statement to Fox News.",
    "While Title 42 is a public health policy as opposed to an immigration policy, the CDC's announcement comes as the U.S. is facing a massive influx of migrants seeking entry into the country.",
    "The most recent border statistics showed there were 164,973 migrant encounters in February, a 7 percent increase over January's numbers and a 60 percent increase over February of 2021.",
    "\"This decision is wrong and will invite a lawless surge of illegal border crossings to enrich human traffickers and overwhelm our Border Patrol,\" McCarthy said.",
    "\"We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy.",
    "The agency explained that the policy is \"no longer necessary\" because vaccines and other COVID treatments are now widely available.",
    "But the Centers for Disease Control and Prevention announced Friday that Title 42 would be repealed starting May 23.",
    "Last month, about 55 percent of migrants were expelled instead of released into the U.S. as a result of the order.",
    "\"From day one of his administration, he has failed to protect our nation’s security and to secure the border.\"",
    "Mark Kelly and Kyrsten Sinema, have also condemned the administration's decision to repeal Title 42.",
    "\"Make no mistake, the President will own the calamity his policies have created,\" he continued.",
    "We are nowhere near prepared to deal with that influx,\" Manchin said in a statement Friday.",
    "Several Democratic, including West Virginia Sen. Joe Manchin and Arizona Sens.",
    "\"This will inflict suffering, pain, and tragedy throughout our country.\"",
    "And in August 2021, the Biden administration renewed the policy.",
    "Source: AP Photo/J."
  ]
}