{
  "id": 10119,
  "mediaId": 2528,
  "date": "2022-03-30",
  "headline": "Russia brought back a US astronaut from the ISS despite the two countries cutting most ties over the invasion of Ukraine",
  "image": "https://i.insider.com/62441b0671996c00193eb2f4?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/russia-returns-us-astronaut-from-iss-despite-ukraine-tension-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marianne Guenot",
  "authorUrl": "https://www.businessinsider.com/author/marianne-guenot-ins",
  "termIds": [
    0
  ],
  "sentences": [
    "—ISS Research (@ISS_Research) March 25, 2022\nRoscosmos cosmonaut Anton Shkaplerov handed over command of the ISS to NASA astronaut Tom Marshburn on Tuesday in a collegial ceremony, during which he said the crew \"worked together very hard.\"",
    "A heavily edited video aired by the State-Owned RIA Novosti and shared by NASA Watch on March 5 hinted at the possibility that Russia could refuse to return Vande Hei to Earth, stranding him in orbit.",
    "In recent weeks, Russia's space agency chief Dimitry Rogozin has criticized the US sanctions in aggresive social-media posts, including a public spat on Twitter with former US astronaut Mark Kelly.",
    "The trip is an example of increasing rare US-Russian cooperation after the Russian invasion of Ukraine and Western retaliatory sanctions severed many of the ties between the two.",
    "Rogozin, however, said on March 11 that Vande Hei would come back to Earth as planned, and dismissed what he called \"hysterical\" news reports suggesting otherwise, per Space.com.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "—International Space Station (@Space_Station) March 30, 2022\nVande Hei's record-breaking achievement was marred by raised tensions between Russia and the US.",
    "During his trip, he studied muscle loss in space, kidney health, and fire safety among other topics, as shown in a tweet below.",
    "Vande Hei boarded the Russia Soyuz MS-19 spacecraft on Wednesday with Russian cosmonauts Anton Shkaplerov and Pyotr Dubrov.",
    "NASA\nVande Hei's trip broke the longest continuous spaceflight record — previously set by Kelly in 2016 — by 15 days.",
    "It showed Russian cosmonauts seemingly waving goodbye at Vande Hei before boarding a shuttle departing from the ISS.",
    "Vande Hei spent 355 days in the International Space Station (ISS) — the longest continuous trip in low-Earth orbit.",
    "Mark Vande Hei works on an agriculture experiment on the International Space Station, January 6, 2022.",
    "Russia's space chief Rogozin has taken to disparaging the US on social media over its sanctions.",
    "Mark Vande Hei hugging Russian cosmonaut Anton Shkaplerov goodbye on the ISS on March 29, 2022.",
    "US astronaut Mark Vande Hei set off Wednesday to return to Earth on a Russian space capsule.",
    "He left on a Russian Soyuz capsule amid tension between Russia's space program and the US.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "\"We worked very hard, like one crew, and we did not have problems,\" he said.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "NASA\nUS astronaut Mark Vande Hei returned from the ISS on Wednesday.",
    "NASA also confirmed the return would proceed as normal.",
    "The spacecraft landed in Kazakhstan at 7:28 a.m.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "ET on Wednesday."
  ]
}