{
  "id": 10129,
  "mediaId": 8350,
  "date": "2022-04-04",
  "headline": "Federal lawsuit seeks to block end to sweeping asylum limits",
  "image": "https://ktar.com/wp-content/uploads/2022/04/ap_2d2f363c1db6493a980e8c7fb2ec3914.jpg",
  "link": "https://ktar.com/story/4989000/federal-lawsuit-seeks-to-block-end-to-sweeping-asylum-limits/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "PHOENIX (AP) — Conservative-led governments in Arizona, Louisiana and Missouri have sued President Joe Biden’s administration to prevent federal officials from ending a public health rule that allows many asylum seekers to be turned away at the southern U.S. border.",
    "In a separate lawsuit filed Monday, the states of Alabama, Georgia and Florida pushed back against a Biden administration policy that lets discretion be used over whether to detain and deport some people who committed a crime while in the U.S. illegally.",
    "The lawsuit seeking to uphold Title 42 says that even though an end to the public health order is premised on a decrease of COVID-19 cases, the U.S. government has not taken other similar action such as lifting a mask mandate for airline travel.",
    "But Democratic Sheriff David Hathaway in Santa Cruz County, Arizona, said Title 42 should be lifted because asylum seekers currently “don’t get their day in court.” The county includes Nogales, the state’s largest and busiest border crossing.",
    "The lawsuit says the order is “the only safety valve preventing this Administration’s disastrous border policies from devolving into an unmitigated chaos and catastrophe.”\nIt noted that several Democratic senators, including Arizona Sens.",
    "“The Biden administration’s dangerous and unlawful immigration policy encourages illegal border crossings and poses a threat to law-abiding citizens across our state and nation,” said Georgia Attorney General Chris Carr.",
    "Republican Mayor Doug Nicolls in the border city of Yuma, Arizona, last week expressed worries the U.S. government may not be sufficiently prepared for an increase in arrivals that could overwhelm his small community.",
    "The action also pointed to agreements Arizona and Louisiana signed with the federal government in the Trump administration’s last days about future changes to immigration policy or enforcement.",
    "U.S. Customs and Border Protection Commissioner Chris Magnus said Monday that “we will likely face an increase in encounters above the current high levels” once Title 42 is lifted.",
    "Magnus said CBP will also expand coordination with faith-based and other nonprofit groups working with asylum seekers on the border to help with short-term care and transportation.",
    "“There are a significant number of individuals who were unable to access the asylum system for the past two years, and who may decide that now is the time to come,” he said.",
    "“We are doing everything we can to prepare for this increase, ensure we continue to process people humanely, and impose consequences on those who break the law,” he said.",
    "It will also work increasingly with other federal agencies like the Federal Emergency Management Agency and the Department of Health and Human Services, he said.",
    "Kyrsten Sinema and Mark Kelly, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "Nonprofit groups that work with asylum seekers are arguing for an end to the rule, which they say endangers people who are fleeing violence back home.",
    "Republican-led state governments in particular have been increasingly fighting the Democratic administration’s rollback of some immigration policies.",
    "The governors of Arizona and Missouri are Republican while Louisiana has a Republican-led legislature and a conservative Democratic governor.",
    "The lawsuit was filed over the weekend in a Louisiana federal court challenging the planned May 23 end to border controls known as Title 42.",
    "The Department of Homeland Security has said as many as 18,000 migrants could show up daily at the southern border when the order ends.",
    "Previous rises in migration have strained law enforcement agencies and nonprofits on the border trying to provide security and shelter.",
    "“It’s not an immigration, migration enforcement measure and the decision on when to lift Title 42 was made by the CDC,” she said.",
    "The order was imposed nearly two years ago by the U.S. Centers for Disease Control and Prevention over coronavirus concerns.",
    "Magnus said his agency will employ additional technology, including drones and additional support personnel on the border.",
    "White House press secretary Jen Psaki said Monday that Title 42 is a public health directive.",
    "This material may not be published, broadcast, rewritten or redistributed.",
    "Copyright © The Associated Press.",
    "All rights reserved.",
    "Share\nComments"
  ]
}