{
  "id": 10149,
  "mediaId": 2745,
  "date": "2022-03-31",
  "headline": "Biden administration border plan poses midterm danger for Democrats",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RHEYGAVLRUI6ZCUOTRXJ7R5A3Y.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/31/biden-administration-border-plan-poses-midterm-danger-democrats/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "And so what I would say is, you know, our goal is going to be to process migrants in a safe and orderly manner.”\nSenate Foreign Relations Committee Chairman Robert Menendez (D-N.J.) offered a mixed response to a draft plan to wind down the directive that had circulated earlier this week, applauding the end of Title 42 but urging swifter movement.",
    "Menendez said that the May deadline provides potential migrants with a target date to arrive and might incentivize even more people to come here, known to immigration policy wonks as a “pull factor”: “For an Administration afraid of creating ‘pull factors’, I fear their delay may create the biggest pull factor of them all,” Menendez said.",
    "Top Democrats on Thursday lashed out at the administration and each other over the fate of an emergency order that the Biden and Trump administrations have used to expel undocumented immigrants during the pandemic, with some arguing for a quicker policy change and others warning not to move ahead.",
    "That produced an enforcement regime at the border that was neither the kind of aggressive application of Title 42 witnessed under Trump nor a return to full asylum access, leaving immigrant advocates angry at Biden, but his border policies approach far less restrictive than his predecessor’s.",
    "“They should not wait nearly two months before ending Title 42 in its entirety, but rather start doing so in phases.”\nThe plan the White House is expected to adopt would not fully lift Title 42 until late May, which critics point out is roughly tantamount to another 60-day renewal.",
    "The Biden administration’s plan to end a pandemic order barring many migrants from entering the United States could trigger a rush of crossings at the border with Mexico — threatening to exacerbate a political liability for Democrats ahead of November’s midterm elections.",
    "Immigrant advocates and some Democrats called on Biden to end the expulsions and restore full asylum access, but instead his administration opted to make exemptions for vulnerable groups: unaccompanied minors, individuals with medical issues and later, most family groups.",
    "Liberals are dissatisfied because they called for an end to use of the order, known as Title 42, months ago, while vulnerable centrist Democrats fret that he will further expose the party to attacks from Republicans who say he has not effectively controlled the border.",
    "The Title 42 order has been in place since March 2020, when the Trump administration said emergency restrictions were needed to protect U.S. agents, migrants and the public from the spread of the coronavirus inside crowded border stations and detention cells.",
    "Administration officials acknowledged this week that the move could significantly increase the record number of people trying to cross the southern border, where arrests by U.S. Customs and Border Protection have soared to an all-time high.",
    "He discussed the issue briefly in a call Wednesday with Steve Ricchetti, one of Biden’s top aides, according to a person familiar with the conversation who spoke on the condition of anonymity because they were not authorized to discuss it.",
    "“They have been playing craven politics with the lives of desperate people and using public health as an excuses for political expediency.”\n“Many of us applaud opening our arms to Ukrainians who are absolutely deserving,” Castro said.",
    "The order gave U.S. Customs and Border Protection the ability to summarily “expel” border crossers to their home countries or to Mexico, denying most asylum seekers the right to apply for humanitarian refuge in the United States.",
    "“Throwing the floodgates open for an historic spring and summer of illegal immigration would be an unforced error of historic proportions,” said McConnell, who also brought up inflation and Biden’s withdrawal from Afghanistan.",
    "And they have established a command center at Department of Homeland Security headquarters staffed by interagency teams that include Federal Emergency Management Administration officials who have handled major disasters.",
    "After taking office, Biden halted construction of the border wall, ended the “Remain in Mexico” policy and sharply scaled back deportations and arrests by U.S. Immigration and Customs Enforcement, among other measures.",
    "White House communications director Kate Bedingfield distanced Biden from the decision to stop enforcing Title 42, saying “this is a decision that the CDC will make.” But she added, “We are preparing for contingencies.",
    "In Wisconsin, which could have one of the most competitive Senate races in the country, 36 percent of voters said they were “very concerned” over illegal immigration, according to a February Marquette Law School poll.",
    "“There is still not an adequate plan or sufficient coordination to end Title 42,” Kelly said in a statement after a conversation with Homeland Security Secretary Alejandro Mayorkas and Sen. Kyrsten Sinema (D-Ariz.).",
    "The tension was evident in the response from Sen. Mark Kelly (D-Ariz.), who sent a letter to Biden urging him not to lift the order without a more robust blueprint in place for dealing with the aftermath.",
    "The decision, which is expected to be announced by the Centers for Disease Control and Prevention this week, puts Biden in a familiar political bind on an issue he has long struggled to navigate.",
    "Single adults are a far bigger challenge: records show migrants arriving as part of a family group accounted for just 16 percent of those taken into custody in February along the southern border.",
    "But he also said his administration would keep “guardrails” in place to avoid having “2 million people on our border.”\nTitle 42 remained the most significant border policy holdover from Trump.",
    "So are many Central Americans.”\nSen. Joe Manchin III (D-W.Va.), a centrist who is frequently at odds with the president, reiterated his view that Biden should leave the health order in place.",
    "In a preview of the midterm attacks Republicans plan to intensify this fall, Senate Minority Leader Mitch McConnell (R-Ky.) attacked Biden over the border in a speech on the Senate floor.",
    "On Thursday, Democratic unity against Trump’s policies gave way to some infighting, creating an additional challenge for Democrats as they seek to show voters they are a unified party.",
    "The vast majority of those quick deportations have occurred under Biden, who ran for president promising a repudiation of President Donald Trump’s enforcement approach at the border.",
    "Still unclear, however, is how the administration might structure a phased approach to ending Title 42 that would lift the restrictions on families first, and single adults later.",
    "They are hiring contractors to add tent facilities that can help process migrants faster, along with additional buses and aircraft to transfer migrants away from the border.",
    "The current fiscal year, which began Oct. 1, is on pace to eclipse that with the exact scenario Biden said he wanted to avoid, bringing “2 million people” into CBP custody.",
    "The call was focused on Menendez’s desire to get some time with the president to discuss a long-stalled effort to revamp the country’s immigration system, the person said.",
    "Biden officials are making worst-case contingency plans for daily border arrests to more than double from the current volume of more than 7,000 daily apprehensions.",
    "Using social media, Menendez called out his colleague: “Let’s not adopt the ‘they are not sending their best’ hate speech from the right, Joe,” Menendez tweeted.",
    "By setting the date in late May, the administration would have time to reassess its plans if a new coronavirus variant becomes a greater threat to public health.",
    "“It’s an abomination that the Biden administration did not lift Title 42 a long time ago,” said former Housing and Urban Development secretary Julián Castro.",
    "The president initially described the influx as a “seasonal” norm, but by summer 2021 CBP was reporting more than 200,000 border arrests per month.",
    "On the Republican side, some lawmakers used Biden’s decision to highlight what they see as a larger and more intractable immigration framework.",
    "“This is simply unacceptable given they have had more than a year to prepare,” Menendez said in a statement to The Washington Post.",
    "Just watch the news y’all put out every day, what’s coming across,” Manchin said, when asked why he opposes lifting Title 42.",
    "A recent Economist-YouGov poll found that just 33 percent of respondents approve of Biden’s handling of immigration.",
    "Some Democrats gearing up for competitive races are already distancing themselves from the administration’s plans.",
    "The Biden administration’s dependency on Title 42 deepened as border crossings soared during the spring of 2021.",
    "CBP has used Title 42 to carry out more than 1.7 million expulsions over the past 24 months, records show.",
    "This is one of those,” said Doug Sosnik, who was a policy and political adviser to President Bill Clinton.",
    "The agency reported 1.73 million arrests during the 2021 fiscal year, the highest figure ever recorded.",
    "“There are just some issues in which there’s just no easy policy or political way to resolve them.",
    "The only area where the president had a lower rating was on guns, where just 27 percent approved.",
    "His comments, reported by CNN, caused a rare public squabble between two Democratic senators.",
    "Republicans pounced on President Biden, accusing him of inviting chaos and danger.",
    "Either way, Biden faces an uphill climb when it comes to public opinion.",
    "Even voters in areas far from the border are attuned to immigration.",
    "But others in the party did not hold back from criticizing Biden.",
    "“But so are Haitians.",
    "“Oh my goodness."
  ]
}