{
  "id": 10154,
  "mediaId": 2720,
  "date": "2022-04-02",
  "headline": "Four Democrat Senators Turn on Biden for Revoking Key Trump Border Security Policy",
  "image": "https://thefederalistpapers.org/wp-content/uploads/2022/03/Manchin-Sinema-Kelly.jpg",
  "link": "https://thefederalistpapers.org/us/four-democrat-senators-turn-biden-revoking-key-trump-border-security-policy",
  "mediaOutlet": "thefederalistpapers.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Richard Moorhead",
  "authorUrl": "https://thefederalistpapers.org/author/wj",
  "termIds": [
    0
  ],
  "sentences": [
    "Kelly calls it the “wrong decision” as Sinema says it shows a “lack of understanding about the crisis at our border.” pic.twitter.com/Lw0UiYQ7I8\n— Adam Shaw (@AdamShawNY) April 1, 2022\nSinema similarly accused Biden of a lack of foresight in her remarks.",
    "— Sen. Maggie Hassan (@SenatorHassan) April 1, 2022\nThe formal termination of Title 42 follows reports that the Biden administration is considering providing Department of Veterans Affairs health care to illegal aliens crossing the border en masse.",
    "Mark Kelly and Kyrsten Sinema, both of the border state of Arizona, released statements slamming Biden for the move on Friday after the repeal of Title 42 was officially announced.",
    "Four Democrat senators are blasting Biden for revoking Title 42, a Trump-era border policy that permits the quick expulsion of illegal aliens on coronavirus public health grounds.",
    "“It’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities,” said Kelly in tough words for the president.",
    "“Today’s announcement by the [Centers for Disease Control] and the Biden administration is a frightening decision,” said Manchin in a statement provided to Fox News.",
    "I’ll keep pushing the administration to strengthen border security & look forward to hearing directly from border agents during my upcoming trip to the border.",
    "“We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy,” he said.",
    "Some estimates point to as many as two million illegal aliens entering the country through the southern border this spring, following the end of Title 42.",
    "“Just watch the news that y’all put out every day, what’s coming across,” Manchin said of the porous US southern border in defense of the policy.",
    "“We are nowhere near prepared to deal with that influx.”\n“If anything, we ought to be looking for permanency on Title 42,” Manchin said.",
    "NEW: Arizona Democrats @SenMarkKelly and @SenatorSinema release statements criticizing the Biden administration’s move to end Title 42.",
    "Ending Title 42 prematurely will likely lead to a migrant surge that the administration does not appear to be ready for.",
    "Support for President Joe Biden Biden’s porous southern border policies is crumbling within his own party.",
    "A longtime thorn in Biden’s side, Sen. Joe Manchin of West Virginia was even more critical of the move.",
    "Sen. Maggie Hassan, a Democrat from New Hampshire, also called the termination of Title 42 premature.",
    "Both Kelly and Hassan are up for re-election in competitive swing states in November.",
    "Many migrants expect to be granted amnesty in the immigration courts.",
    "This article appeared originally on The Western Journal.",
    "Sens."
  ]
}