{
  "id": 10162,
  "mediaId": 2562,
  "date": "2022-04-04",
  "headline": "Secy. of State Blinken defends end to Title 42, despite border experts warning ‘mass migration event’",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/borderr-315x210-1.jpg",
  "link": "https://donaldjtrumppolls.com/secy-of-state-blinken-defends-end-to-title-42-despite-border-experts-warning-mass-migration-event/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "“So building that kind of opportunity, building what one of my colleagues has called a ‘right to remain’ is our focus.”\nAdditionally, DHS secretary Alejandro Mayorkas hid behind the different mission’s of the CDC and his agency by stressing it’s the CDC’s responsibility to enforce health measures while the DHS focuses on immigration issues.",
    "“We’re focused on making sure that people throughout our hemisphere have opportunities at home going forward, so they’re not faced with this really hard choice of leaving everything behind and trying to come to the United States,” stated the official.",
    "In the meantime, GOP Rep. Mike Gallagher (R-Wis.) said he’s introduced a number of bills to bolster immigration courts and crackdown on criminal enterprises south of the border that he says will combat Biden’s open border policies.",
    "Additionally, political analysts are noting the difference in campaign styles between smart Democrats who are rallying against the economic and political disasters of last year and those who are toeing the party line.",
    "(Photo by Brandon Bell/Getty Images)\nOAN Newsroom\nUPDATED 8:40 AM PT – Monday, April 4, 2022\nTop Biden administration officials have continued to fan the flames of the crisis at the southern border.",
    "Despite the Biden administration’s ardent defense of the move, several Democrat lawmakers, including Senators Mark Kelly (D-Ariz.) and Joe Manchin (D-W.Va.) decried the move.",
    "On Sunday, Secretary of State Antony Blinken defended the CDCs announcement last week that it would end the public health measure called Title 42 on May 23.",
    "The measure was employed by both the Trump and Biden administrations amid the COVID-19 pandemic to turn away migrants at the border due to health concerns.",
    "LA JOYA, TEXAS – JUNE 21: Medical personnel check in with immigrants after they crossed the Rio Grande into the U.S. on June 21, 2021 in La Joya, Texas.",
    "A surge of mostly Central American immigrants crossing into the United States has challenged U.S. immigration agencies along the U.S. Southern border.",
    "The DHS chief went on to claim border agents are well equipped to handle the surge and the agency will actually enforce deportation proceedings.",
    "When asked about the potential downsides to lifting the measure, Blinken pivoted and rambled about the Biden administration’s policy goals.",
    "This comes as U.S. Immigration and Customs Enforcement officials warn when Title 42 officially ends, there will be a mass migration event.",
    "During an interview last week, Mayorkas tried to brush off the fact that border agents allegedly see around 7,000 migrants per day.",
    "After pressure from progressive groups suing Biden over keeping the rule in place, it seems he has caved to their demands.",
    "Gallagher is urging Congress to cancel its upcoming recess to pass measures that will secure the southern border.",
    "MORE NEWS: GOP Senators Warn Biden End Of Title 42 Will Further Border Crisis\nOriginal Article Oann",
    "According to reports, that number could jump to 18,000 encounters per day after Title 42 ends.",
    "Meanwhile, Democrats are struggling to come together on how to promote the end of Title 42.",
    "They stressed Biden’s officials are acting without a plan."
  ]
}