{
  "id": 10200,
  "mediaId": 2930,
  "date": "2022-03-31",
  "headline": "'Body Blow to Working People': Right-Wing Democrats Reject Biden Labor Nominee",
  "image": "",
  "link": "https://www.commondreams.org/news/2022/03/31/body-blow-working-people-right-wing-democrats-reject-biden-labor-nominee",
  "mediaOutlet": "rense.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Conley",
  "authorUrl": "https://www.commondreams.org/author/julia-conley",
  "termIds": [
    2459,
    5510,
    5802,
    5879,
    4905,
    3694,
    1548,
    392
  ],
  "sentences": [
    "Economists and workers' rights advocates on Thursday condemned the latest setback for working people dealt by right-wing Democratic lawmakers, three of whom joined every Republican senator in opposing President Joe Biden's nominee to lead the Labor Department's Wage and Hour Division after being aggressively lobbied by business interests.",
    "Right-wing groups including Americans for Tax Reform (ATR) lobbied Manchin, Sinema, and Kelly after Weil was nominated last year, casting him as a \"radical\" and complaining of Weil's opposition to so-called \"right to work\" laws which strip unions of collective bargaining power.",
    "Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.), and Mark Kelly (D-Ariz.) voted against allowing Dr. David Weil's nomination to move forward Wednesday evening, several months after the former Obama administration official was first nominated for the top wage regulatory role.",
    "Manchin and Sinema have obstructed much of President Joe Biden's agenda since he took office—opposing the elimination of the filibuster in order to pass voting rights legislation and rejecting climate and anti-poverty provisions in the Build Back Better Act.",
    "In the Wage and Hour Division, Weil would have overseen regulation and enforcement of overtime rules, minimum wages, and child labor laws, and could have advanced federal investigations into companies' classification of employees as independent contractors.",
    "Weil is the author of The Fissured Workplace, which examines large corporations that classify workers as subcontractors and rely on franchisees in order to cut costs and avoid responsibility for ensuring fair working conditions.",
    "\"If confirmed, Weil would use his power to implement the anti-worker PRO Act by executive fiat,\" ATR told Kelly and Sinema, referring to the legislation which would protect workers' right to organize their workplaces.",
    "Weil led the Wage and Hour Division for two years under former President Barack Obama—and had Manchin's support when he was nominated for the job in 2014—and now serves as a dean at Brandeis University.",
    "\"This is really infuriating,\" said Chirag Mehta of the grassroots group Community Change, accusing the senators of repeatedly \"delivering body blows to working people on behalf of big business.\"",
    "He has harshly criticized companies like Uber and Lyft for classifying workers as independent contractors rather than employees, exempting them from benefits and workplace protections.",
    "\"The more accurately you diagnose the American economy, the less likely you are to be confirmed to a position with any control over it,\" said journalist Hamilton Nolan.",
    "The senators' opposition to advancing Weil's nomination \"shows the huge power of corporate lobbying,\" said former New York Times labor reporter Steven Greenhouse.",
    "\"David Weil is one of the most innovative, pro-worker, and ambitious policy thinkers we've got,\" said Jake Rosenfeld, author of You're Paid What You're Worth.",
    "\"It was unfortunate his Obama administration initiatives didn't survive the Trump years; it's shameful that Democrats have sunk his chance to try them again.\"",
    "\"The more accurately you diagnose the American economy, the less likely you are to be confirmed to a position with any control over it.\"",
    "Joe Manchin, Kyrsten Sinema, and Mark Kelly were aggressively lobbied by corporate groups regarding Dr. David Weil's nomination.",
    "Despite previously backing Weil, Manchin expressed late last year that he had doubts about the academic's nomination.",
    "They are doing everything they can to defend the status quo, squash dissent and protect the wealthy and the powerful.",
    "On Thursday he claimed he was concerned that Weil would enact policies that would harm small businesses.",
    "Thousands of small donations fund our newsroom and allow us to continue publishing.",
    "Our work is licensed under Creative Commons (CC BY-NC-ND 3.0).",
    "The Common Dreams media model is different.",
    "The 1% own and operate the corporate media.",
    "We cover the news that matters to the 99%.",
    "Feel free to republish and share widely.",
    "To ignite change for the common good.",
    "We can't do it without you.",
    "No selling of your data.",
    "With no advertising.",
    "Free to republish.",
    "Reader-supported.",
    "We've had enough.",
    "Can you chip in?",
    "Free to share.",
    "Free to read.",
    "No paywalls.",
    "Independent.",
    "Our mission?",
    "To inspire.",
    "Nonprofit.",
    "Thank you.",
    "To inform.",
    "Sens.",
    "Sens.",
    "How?"
  ]
}