{
  "id": 10227,
  "mediaId": 2553,
  "date": "2022-03-31",
  "headline": "Nancy Pelosi Shoots Down Gas Tax Holiday, Suggests Rebates And Gas Cards Instead",
  "image": "https://dw-wp-production.imgix.net/2022/03/0E0BC08D-5444-487C-8D4B-405C20501496-scaled.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/nancy-pelosi-shoots-down-gas-tax-holiday-suggests-rebates-and-gas-cards-instead",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Rigolizzo",
  "authorUrl": "https://www.dailywire.com/author/john-rigolizzo",
  "termIds": [
    0
  ],
  "sentences": [
    "But some of the things that looked appealing in the beginning to some, if this were my caucus, one half of the room would say ‘let’s go with that,’ and the other half would say ‘wait a minute — it’s not going to the consumer.’ So there are a number of approaches that are on the table.” Pelosi then suggested that reporters should wait for President Joe Biden to make his announcement on releasing oil from the Strategic Petroleum Reserve before commenting further.",
    "The Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "Calls grew in both chambers to suspend the tax, and the governors of Georgia and Maryland actually signed laws temporarily suspending their state-level taxes, but a federal tax holiday has not gained traction.",
    "House Speaker Nancy Pelosi (D-CA) shot down the idea of a federal gas tax holiday, but said she was instead considering giving consumers rebates or gas cards to offer relief for soaring gas prices.",
    "“‘Okay, let’s just do something, there it is.’ But it is not necessarily landing in the pocket of the consumer, it’s taken out of the Highway Trust Fund, we have to pay for that to return it.",
    "So we have a situation where there’s money coming out of the Highway Trust Fund, it’s going to the oil companies, they may not give it to the consumer, and it has to be paid for.",
    "And so we’re losing the money in the Highway Trust Fund, because we’ve just taken that out, it goes to the oil companies, you cannot write a law that requires them to pass it on.",
    "The White House had also proposed the idea of gas cards earlier this month, but the idea drew criticism from policymakers and mockery from conservatives on social media.",
    "Democrats in Congress originally proposed a suspension of the gas tax in February when Senators Mark Kelly (D-AZ) and Maggie Hassan (D-NH) introduced a bill to do so.",
    "If you’re going to have to pay for it and you don’t want it to come out of the Trust Fund, something could be a rebate card or a direct payment.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "“First of all, the main question had been, ‘Do you support a gas tax holiday?’ And that is immediate, and it has appeal,” Pelosi said.",
    "Pelosi explained that the concept had been floated only after the idea of a gas tax holiday had been proposed and rejected.",
    "During her weekly press briefing, Pelosi was asked by a reporter whether she supported giving gas rebates to consumers.",
    "So we’re paying for something to give a break to the oil companies, that isn’t even going to the consumer.",
    "You could have moral [persuasion], you could encourage, you could incentivize, you cannot require it.",
    "The con is that the oil companies do not necessarily pass that on to the consumer.",
    "Do you have the consumer pay for that?… So you took it to the right place.",
    "‘There’s going to be a reduction in the gas tax.’ That’s the pro.",
    "So that’s the con.”\n“The pro is very showbiz,” Pelosi continued.",
    "That’s just the way it is, I — we’ve tried every which way.",
    "So that takes us to something else: how do you do that?",
    "And those are the things that are being considered.",
    "Create a free account to join the conversation!",
    "Become a member now and join our mission.",
    "Do you do it with a tax on production?",
    "How do we help people directly?",
    "They haven’t in the past.",
    "“People understand it.",
    "Believe the same?"
  ]
}