{
  "id": 10308,
  "mediaId": 2742,
  "date": "2022-03-30",
  "headline": "Ann Coulter On KBJ: Pro-Crime Party Nominates A Justice",
  "image": "https://vdare.com/public_upload/publication/featured_image/57248/VDARE-jackson-biden.jpg",
  "link": "https://vdare.com/articles/ann-coulter-on-kbj-pro-crime-party-nominates-a-justice",
  "mediaOutlet": "VDARE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ann Coulter",
  "authorUrl": "https://vdare.com/writers/ann-coulter",
  "termIds": [
    0
  ],
  "sentences": [
    "We got the sneering:\nWe got the hysterical warnings about right-wing conspiracy theorists:\nHawley’s attacks on Ketanji Brown Jackson fuel a surge in online conspiracy chatter—NPR\nAnd we got the sophistical “fact checks”:\nThe New York Times’ “fact check” noted she was concerned about child porn fiends who were simply motivated by “the technological or social aspects” of child porn.",
    "Perhaps, there’s hope that, someday, the high court will acknowledge that affirmative action is intended to make up for the legacy of slavery and should be available exclusively to GAAs, as opposed to what it is now, which is affirmative action, set-asides, “plus” factors, and do-nothing diversity jobs for everyone except white Americans.",
    "But Judge Jackson also dramatically departed downward in sentencing a couple of ripe perverts—one who attempted to travel across state lines to molest a 9-year-old girl (when his thousands of child porn images weren’t enough); and another who’d distributed more than a hundred pornographic photos and videos of his own daughter.",
    "In United States v. Hawkins, the defendant possessed and distributed multiple images of child abuse of kids, including photos of prepubescent boys engaging in oral and anal sex, a video of an 8-year-old boy masturbating, and one of an 11-year-old boy being anally penetrated by an adult man.",
    "In her favor, KBJ is at least a Generational African American (GAA), i.e., Descendant of American Slaves (DOAS)—unlike Barack Obama, Kamala Harris, Joy Ann Reid and approximately 90% of the “African Americans” in Harvard’s entering class this year, according to the Harvard Crimson.",
    "For the past two years, liberals have been screaming, “Defund the Police!” “All Cops Are Bastards,” “F—k the Police!”—not to mention actually defunding the police and springing criminals in Democratic-run cities around the country.",
    "Kelly can boast about being an astronaut, and Tester can walk around with that buzz-cut and a piece of hay in his teeth—but give them a guy getting off on videos of 11-year-old boys being anally raped, and they say: Three months.",
    "In seven out of seven child pornography cases that came before Judge Jackson, where the sentencing was up to the judge, she imposed sentences that were a fraction of those recommended under the sentencing guidelines.",
    "Josh Hawley, Tom Cotton, Ted Cruz and Lindsey Graham amply demonstrated at the nomination hearings last week, Judge Jackson really likes defendants in child pornography cases.",
    "Apart from the Democrats finally promoting a legacy African American, rather than an immigrant trying to steal the experiences of Black Americans, nothing is unusual here.",
    "COPYRIGHT 2022 ANN COULTER\nDISTRIBUTED BY ANDREWS MCMEEL SYNDICATION\nAnn Coulter is the author of THIRTEEN New York Times bestsellers—collect them here.",
    "If you’d given me a thousand bucks to come up with a question that would stump a Supreme Court nominee, I never would have thought of: What’s a woman?",
    "Of note: Sen. Joe Manchin, your regular, old-time, American values Democrat, is just like the rest of his party when it comes to crime.",
    "The media have also issued reams of “context,” “fact checks” and “debunkings”…all to prove that KBJ is a virtual Eliot Ness on crime!",
    "On average, Judge Jackson gave child porn defendants sentences more than five years below the minimum under the guidelines.",
    "Using that as our guide, President Joe Biden picked the Democrats’ perfect Supreme Court justice: Ketanji Brown Jackson.",
    "The media take the position that it’s rude to ask Judge Jackson questions—at least any questions about her record.",
    "Presidents are entitled to nominate Supreme Court justices who represent their party and its values.",
    "Republicans are welcome to ask her all the questions they like about her family or her travails.",
    "The Left’s Plan To Turn Our Country Into A Third World Hell Hole, was released on June 1, 2015.",
    "In all seven cases, her sentences were also far below those requested by the prosecutor.",
    "The bravest, the strongest, the most heroic—HOW DARE YOU ASK OUR LITTLE LAMB QUESTIONS!",
    ": How the Trump-Hating Left Lost Its Collective Mind, was released on August 21, 2018.",
    "She is the most qualified human being ever, EVER to be nominated to the Supreme Court!",
    "She’s partial to all criminals, but the child porn cases make the point bracingly.",
    "It’s the media’s response to the questioning Judge Jackson that’s been hilarious.",
    "In other words, Judge Jackson is the beau ideal Democratic Supreme Court justice.",
    "Not 2 1/2 years, instead of three—more like three months instead of 10 years.",
    "Same with Arizona’s Sen. Mark Kelly and Montana’s Sen. Jon Tester.",
    "The federal sentencing guidelines recommended eight to 10 years.",
    "We got it: You like criminals and hate the police, Democrats.",
    "Judge Jackson sentenced the defendant to three months.",
    "Yes, yes, he was only 18, and he was remorseful.",
    "Forget everything you know about the Democrats!",
    "What is the point of all these “FACT CHECKS”?",
    "You’re not exactly flying below the radar.",
    "It’s all lies and conspiracy theories!",
    "Her latest book, Resistance Is Futile!",
    "Totally run on that, Democrats.",
    "Her book, ¡Adios America!",
    "Don’t believe your eyes!",
    "Democratic values.",
    "Good for him!",
    "As Sens.",
    "Max."
  ]
}