{
  "id": 10345,
  "mediaId": 8322,
  "date": "2022-04-01",
  "headline": "Biden administration to lift Title 42 at end of May, despite fears of looming migrant wave",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/GettyImages-1358087851.jpg",
  "link": "https://www.foxnews.com/politics/biden-admin-lift-title-42-end-may-despite-fears-looming-migrant-wave",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    0
  ],
  "sentences": [
    "\"After considering current public health conditions and an increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC Director has determined that an Order suspending the right to introduce migrants into the United States is no longer necessary,\" the Centers for Disease Control said in a statement.",
    "The Biden administration on Friday announced that it will be terminating the Title 42 public health policy, that has been used by both the Trump and Biden administrations to quickly expel migrants at the southern border since the start of the COVID-19 outbreak, at the end of May – despite fears of a massive migrant wave in the coming months.",
    "\"If there's a strategy in place, we haven't seen it, it hasn't been disseminated to us and there's no way you can prepare in a month and a half for what is expected to be a mass illegal migration crisis,\" Brandon Judd, head of the National Border Patrol Council, told Fox News Digital this week.",
    "ARIZONA DEM SENATORS WARN BIDEN AGAINST ‘SHARP END’ TO TITLE 42 BORDER RESTRICTIONS WITHOUT PLAN\n\"We are increasing our capacity to process new arrivals, evaluate asylum requests, and quickly remove those who do not qualify for protection,\" he said in a statement.",
    "Border Patrol agents have expressed skepticism that they can prepare for what DHS has estimated could be potentially up to 18,000 migrants a day, even as they are already overwhelmed and overcrowded with the numbers that are already at the border.",
    "But Republican and moderate Democratic lawmakers, as well as law enforcement at the border, have expressed concern that it could lead to a surge in migration that could overwhelm agents and exceed the enormous numbers seen last year.",
    "DHS Secretary Alejandro Mayorkas on Friday claimed that DHS has \"put in place a comprehensive, whole-of-government strategy to manage any potential increase in the number of migrants encountered at our border.\"",
    "Multiple Border Patrol officials have told Fox News that ending Title 42 would lead to what one agent described as a \"surge on top of a surge\" as word spreads among migrants that they will not be deported.",
    "I’m thrilled to see the Biden Administration do the right and moral thing by ending this extremely harmful, xenophobic, and shortsighted policy that disproportionately impacted Black and Brown migrants.\"",
    "The order was implemented by the Trump administration due to the outbreak of COVID-19 and has since been used by both the Trump and Biden administrations to expel a majority of migrants at the border.",
    "While it is a public health order, not an immigration policy, it has become one of the central border policies in place as the U.S. faces a continuing crisis of numbers at the border.",
    "The order will end on May 23, giving the Department of Homeland Security time to prepare for what the Biden administration has admitted will be an \"influx\" in numbers at the border.",
    "\"At every opportunity, Biden has enacted policies that open our southern border, empower drug smugglers and human traffickers, and make American communities less safe.",
    "Activists and left-wing Democrats have been calling for the Biden administration to end the order for months, claiming it is cruel and denied migrants due process.",
    "Mark Kelly, D-Ariz,, and Kyrsten Sinema, D-Ariz., also warned the administration about ending the policy without what they said was a sufficient plan in place.",
    "\"Maybe that would spur us to get a good immigration policy that works for Americans and secure our borders -- the borders have to be secure,\" he said.",
    "\"This is a momentous day for immigrant rights activists, and immigrants and refugees everywhere,\" Rep. Pramila Jayapal, D-Wash., said in a statement.",
    "\"Title 42 was a cruel and discriminatory policy that circumvented U.S. law, preventing people from accessing protections established by Congress.",
    "Joe Biden has overseen the worst border crisis in DHS history,\" Republican National Committee Chairwoman Ronna McDaniel said in a statement.",
    "Over the next two months, we are putting in place additional, appropriate COVID-19 protocols, including ramping up our vaccination program.\"",
    "Sinema, who is Chair of the Senate Subcommittee on Border Management, said she told Mayorkas she intends to hold a hearing on the matter.",
    "\"The only thing this administration is going to be able to do is just release people on a mass scale, that’s it, that’s all they can do.\"",
    "\"We will increase personnel and resources as needed and have already redeployed more than 600 law enforcement officers to the border.",
    "Former Trump White House adviser Stephen Miller said that ending Title 42 would \"open the floodgates on a biblical scale.\"",
    "There are also believed to be a considerable number of migrants waiting in Mexican cities waiting for Title 42 to drop.",
    "In February, approximately 55% of migrants were returned due to the order, rather than being released into the U.S.",
    "\"By removing Title 42, Biden’s doubling down on his commitment to actively worsening the crisis he created.\"",
    "\"We are expecting to get wrecked,\" one Border Patrol agent told Fox News Digital.",
    "We are referring smugglers and certain border crossers for criminal prosecution.",
    "Today is the product of years of advocacy from both inside and outside Congress.",
    "Sen. Joe Manchin, D-W.Va., said the administration should \"reconsider.\"",
    "\"If anything we should be looking at permanency on Title 42,\" he said.",
    "Fox News' Peter Hasson and Bill Melugin contributed to this report.",
    "Moderate Democrats too had expressed concern about the move.",
    "Sens."
  ]
}