{
  "id": 10395,
  "mediaId": 2589,
  "date": "2022-03-30",
  "headline": "Biden administration to announce Title 42 will end in May to give DHS time to prepare for migrant surge to follow",
  "image": "https://media.townhall.com/townhall/reu/o/2022/34/e8a344c7-79e3-4de7-82fc-f55381c373fa-1110x740.jpg",
  "link": "https://hotair.com/john-s-2/2022/03/30/title-42-will-end-on-may-23-n459002",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Sexton",
  "authorUrl": "https://hotair.com/author/john-s-2",
  "termIds": [
    0
  ],
  "sentences": [
    "Mayorkas asking him not to end Title 42 until border apprehensions drop to manageable levels:\nWe strongly urge that DHS retain Title 42 authority until appropriate deterrent measures are put in place to ensure that Federal government facilities and local communities will not be overwhelmed by a sudden increase in migrant apprehensions…\nWe urge that the CDC’s Title 42 order remain in place and that DHS continue to use it until such time as the number of apprehensions along the southwest border drops to a manageable level.",
    "The Biden administration plans to end its use of Title 42, a Trump-era pandemic border policy that allows the government to immediately turn away migrants at the southern border, by the end of May, according to a draft of the order reviewed by The Wall Street Journal and officials familiar with the matter.",
    "The AP is bit less confident but has also seen the same documents:\nThe decision, not yet final, would halt use of public health powers to absolve the United States of obligations under American law and international treaty to provide haven to people fleeing persecution.",
    "The order, which the Centers for Disease Control and Prevention plans to issue later this week, says it is taking the step because “there is no longer a serious danger” that migrants would introduce or spread Covid-19 inside immigration detention facilities.",
    "Is the announcement coming later this week just a gimmick to distract the media from the fact that CDC is effectively granting a 54 day renewal of Title 42 even as the CDC and, presumably, the White House prepare to announce they are ending it now?",
    "The CDC is delaying the implementation of the order until May 23 to allow the Department of Homeland Security to prepare for what the government anticipates will be a sharp rise in crossings this spring.",
    "Yesterday afternoon, a group of Texas elected officials including Sen. Cornyn, Sen Cruz and 19 members of the state’s House delegation including some Democrats, sent a letter to Sec.",
    "But instead of doing that, the CDC is apparently planning to announce the end of Title 42 this week but then delay it’s conclusion until May 23, which is about a week shy of 60 days.",
    "As discussed yesterday, DHS and FEMA are preparing for a surge of as many as 18,000 migrants per day, about 2 1/2 times the current levels which are already near record highs.",
    "The people familiar with the plans saw a draft report that has not been finalized and they spoke to The Associated Press on condition of anonymity to discuss the plans.",
    "DHS says they are planning for the worst case not making a prediction but let’s face it, the worst case is frequently a lot worse than what DHS has planned for.",
    "The authority is up for renewal this week, but officials have not formally decided to terminate it yet and an announcement was expected over the next few days.",
    "Both the Associated Press and the Wall Street Journal are reporting that the Biden administration will announce later this week that it is suspending Title 42.",
    "The Centers for Disease Control and Prevention had extended its asylum-blocking powers for two months in late January, near the height of the omicron variant.",
    "So while the fact that they are preparing for 18,000 per day doesn’t mean the numbers will get that high, it also doesn’t guarantee they won’t go even higher.",
    "Here’s Sen. Mark Kelly earlier today saying he’s “really concerned” that the administration still doesn’t have a plan to deal with the abrupt end of Title 42.",
    "We also ask that you collaborate with Congress to develop an appropriate plan for an orderly transition back to relying exclusively on Title 8 authorities.",
    "However, the date the policy ends will be pushed out to the end of May to give DHS and FEMA time to prepare for the surge of migrants that will follow.",
    "It’s worth noting that the Texas letter essentially does away with the facade that extending Title 42 is needed on health grounds at this point.",
    "Maybe there’s some reason for this approach that doesn’t involve politics but it’s not clear at this moment what that could be.",
    "If the CDC were to extend the use of Title 42 for another 60 days from today that would bring us to May 29.",
    "The Texas letter was preceded by a very similar letter from Arizona’s two Democratic Senators last week.",
    "The letter mostly just argues that DHS isn’t prepared for the surge of migrants that will follow.",
    "They extended it in late November though the end of January and again in January until this week.",
    "Will Sen. Kelly get on board with whatever DHS comes up with between now and May 23?",
    "Reading the stories above I was a bit confused about what the CDC is doing here.",
    "The Biden CDC has been reviewing and renewing Title 42 every 60 days.",
    "Why not delay the end of Title 42 until you actually have a plan?",
    "Is there a reason to end this on May 23 instead of May 29?",
    "Again, it’s not just Republicans who are concerned."
  ]
}