{
  "id": 10405,
  "mediaId": 8347,
  "date": "2022-04-02",
  "headline": "Biden to end Title 42, Arizona bracing for the fallout",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/134e9f2/2147483647/strip/true/crop/960x504+0+108/resize/1200x630!/quality/90/?url=https%3A%2F%2Fx-default-stgec.uplynk.com%2Fausw%2Fslices%2F37a%2F5c3d34b8b29a45469a86c02775b7a2cf%2F37a560c6e28343269343868a630660d7%2Fposter_349a25e0597649c6bf7392f318c50a89.jpg",
  "link": "https://www.kgun9.com/news/state/biden-to-end-title-42-arizona-bracing-for-the-fallout",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Phillips",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He admits a lot is needed to make it successful: Resources and administrators to process asylum seekers, temporary shelter and enough border patrol agents to handle the volume of people who will attempt to enter the U.S.\n\"I suspect there's going to be thousands-maybe hundreds of thousands-who are going to be able to seek asylum thru the legal process,\" Patiño said.",
    "In a letter sent on Thursday, Sinema and Kelly said in part, \"we urge our Administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly and humane process at the border.\"",
    "She plans to hold a hearing to put Homeland Security Secretary Alejandro Mayorkas on record explaining the Administration's plan to deal with the anticipated crush of immigrants once Title 42 goes away.",
    "\"It's something Americans don't think that we should have, an open-borders policy, and that's the policy of the the Biden Administration and all they do is make it more wide open,\" said Governor Ducey.",
    "Arizona Senators Kyrsten Sinema and Mark Kelly say ending Title 42 without a plan puts Arizona communities and migrants at risk.",
    "\"Everything the Biden Administration has done on our Southern Border is a failure,\" said Arizona Governor Doug Ducey.",
    "Many of those immigrants who seek asylum remain on Mexico's side waiting for their chance to enter the United States.",
    "It kept asylum seekers in Mexico for fear they would bring COVID with them if they were allowed to enter the U.S.",
    "Since December, border officials in Yuma report on average there have been 1,000 illegal crossings every day.",
    "Senator Sinema was recently in Yuma where she received a briefing of immigrant crisis in that city.",
    "Many, like Governor Ducey, fear once Title 42 ends on May 23rd those numbers will jump tenfold.",
    "An estimated 1.7 million people were turned away along the U.S. Southern Border last year.",
    "That's something we have to deal with,\" said Jose Patiño, Vice President of Aliento.",
    "So, you have a significant amount of asylum seekers on the U.S. Southern Border.",
    "PHOENIX — The CDC is ending the pandemic border rule known as Title 42.",
    "Patiño believes the Biden Administration will have a plan in place.",
    "Sinema chairs the Senate Subcommittee for Border Management.",
    "\"This program has closed the border almost two years.",
    "Ducey is not alone."
  ]
}