{
  "id": 10453,
  "mediaId": 8251,
  "date": "2022-04-02",
  "headline": "Sinema, Kelly rip White House decision to lift pandemic border restrictions",
  "image": "https://media.12news.com/assets/KPNX/images/1a088a5c-1e68-473a-9d33-4c834c036f12/1a088a5c-1e68-473a-9d33-4c834c036f12_1140x641.jpg",
  "link": "https://www.12news.com/article/news/special-reports/at-the-border/sinema-kelly-rip-white-house-decision-to-lift-pandemic-border-restrictions-title-42/75-6157d271-fc94-4771-b831-a20570948fb9",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Undocumented immigrants will be put into removal proceedings if they can't show a legal basis, such as an asylum claim, to remain in the U.S.\nArizona's two U.S. senators, Kyrsten Sinema and Mark Kelly, urged President Biden a week ago to keep the order in place.",
    "\"The last thing we want is 3,000 families living in the streets in Yuma County after they're dropped off by the Border Patrol,\" said Amanda Aguirre, a former state lawmaker who is chief executive officer of the Regional Center for Border Health in Somerton.",
    "Here's what we know:\nWith the announcement Friday that the federal health order will end on May 23, the U.S. Department of Homeland Security is bracing for a doubling or tripling of daily border apprehensions, which are already at record highs.",
    "\"When the CDC ultimately decides when it is appropriate to lift Title 42, there will be an influx of people at the border,\" White House communications director Kate Bedingfield told reporters this week.",
    "PHOENIX — From the White House on down, there are major concerns about the impact of ending a Trump-era rule that requires the expulsion of undocumented immigrants to prevent the spread of COVID-19.",
    "Greg Abbott, a border hardliner who's called on Biden to reinstate Donald Trump's immigration policies, said, \"Texas must take even more unprecedented action to keep our communities safe.\"",
    "3/\n— Doug Ducey (@DougDucey) April 1, 2022\nAguirre said the community rate of COVID-19 cases in Yuma County was higher than the rate among migrants her agency tests.",
    "There was speculation Friday that the two-month notice before the end of Title 42 could give a state like Texas an opening to ask a judge to keep the order in place.",
    "The order, known as Title 42, has resulted in the removal of more than 1.7 million undocumented immigrants at the Southwest border over the last two years.",
    "States like Texas have been VERY successful in getting federal court judges to undo Biden immigration plans or force them to return to Trump policies.",
    "She plans to schedule a hearing of the Senate border management subcommittee she chairs on DHS's efforts to prepare for the end of Title 42.",
    "\"It's unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border.\"",
    "Once Title 42 is lifted, a DHS official told reporters Friday, the department will be \"scaling up\" COVID-19 vaccinations at the border.",
    "But the health order, issued by the U.S. Centers for Disease Control, has also become a blunt tool to stem the flow of migrants.",
    "After a virtual border roundtable three weeks ago, Sinema said the Biden White House had done \"nothing\" to deal with the crisis.",
    "In a tweet, the governor said the order \"protects the health of Americans\" from undocumented immigrants who might pose a risk.",
    "The lifting of Title 42 means that the government will return to the normal processing of adults and families at the border.",
    "Over the last five months, the number of border apprehensions has soared by more than 1,000% from the year before.",
    "Title 42 critics have argued that there's no longer a need for public health emergency measures at the border.",
    "A DHS official said Friday that the agency had been preparing for the end of Title 42 for \"many, many months.\"",
    "Yuma braces for fallout from the decision to end Title 42's immediate expulsions for undocumented immigrants.",
    "They contended that border authorities and communities weren't prepared for an anticipated surge of migrants.",
    "Even as we emerge out of the pandemic, this is a no-brainer policy that protects the health of Americans.",
    "Title 42 allows federal officials to prohibit the entry of those who potentially pose a health risk.",
    "Doug Ducey said Biden was \"trying to make a political statement\" with the CDC's lifting of Title 42.",
    "Sinema said the decision \"shows a lack of understanding about the crisis at our border.\"",
    "\"We are ready to assist the Border Patrol and ICE if the surge is a massive increase.\"",
    "\"This is the wrong decision,\" said Kelly, who's running for re-election in the fall.",
    "The agency's six buses ferry 300 migrants a day toward their final destination.",
    "Arizona's Yuma sector has become the migrant magnet on the Southwest border.",
    "The non-profit cares for and transports migrants seeking asylum in the U.S.",
    "Public health experts have come to question whether it was ever justified.",
    "Less than 1% of migrants in her agency's care test positive for the virus.",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "Will these states attempt a similar challenge with the end of Title 42?",
    "The removal of Title 42 will cause considerable harm to our country.",
    "Now, she said, she's working closely with DHS and border officials.",
    "Immigration ranks among the top issues for Arizona voters.",
    "\"We are preparing for different scenarios,\" she said.",
    "— Hamed Aleaziz (@Haleaziz) April 1, 2022\nTexas Gov.",
    "All individuals and families are tested for COVID.",
    "The senators issued blistering statements Friday.",
    "\"They are not a public health threat,\" she said.",
    "Aguirre said she, too, opposed ending Title 42.",
    "\"We are doing a lot of work to plan for that.\"",
    "I would not be surprised.",
    "Subscribe today.",
    "Arizona Gov."
  ]
}