{
  "id": 10454,
  "mediaId": 8309,
  "date": "2022-04-01",
  "headline": "Detachment 1 activates at DM under ACC co-lead effort to hone Information Warfare readiness",
  "image": "https://www.aerotechnews.com/davis-monthanafb/wp-content/uploads/sites/6/2022/03/1-Information-Warfare-3.jpg",
  "link": "https://www.aerotechnews.com/davis-monthanafb/2022/04/01/detachment-1-activates-at-dm-under-acc-co-lead-effort-to-hone-information-warfare-readiness/",
  "mediaOutlet": "Desert Lightning News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    24,
    26,
    6,
    370,
    949,
    403,
    1423,
    6579,
    5949
  ],
  "sentences": [
    "“If a unit is unable to participate in an event, they can jump back into a future iteration when available, but the challenges in the information environment continue and the teams have to respond with the capabilities available.”\nThe “build, learn, correct, repeat” model also enables accelerated learning and engagement between operators, researchers, and academic teammates.",
    "“We are experimenting with sustainable processes and events in quick succession to scale conceptual ideas, operationally test them, then integrate these processes across the larger federated enterprise.”\nThis model offers several advantages over traditional events, which are often infrequent and focused on different training audiences with different objectives.",
    "This new Information Warfare Training and Research Initiative Detachment, a subordinate unit of the 55th Wing at Offutt Air Force Base, Nebraska, will conduct IW training and research events to address the growing importance of operations in the information environment and the electromagnetic spectrum, as they relate to strategic power competition.",
    "“This allows the operators to provide immediate feedback, so research and operational efforts move faster at a decreased cost.”\nIn the most recent event, IW Airmen from 34 organizations and teams across 23 geographically separated locations integrated their capabilities within an ISR centric mission.",
    "For the last three years, Air Combat Command, Air Force Research Laboratory, Secretary of the Air Force Concepts, Development and Management, and several academic organizations have been experimenting to change the way the Department of the Air Force conducts IW training and research.",
    "By building environments to test and train IW elements and integrating new tactics, techniques and procedures with existing capabilities, the DAF is preparing for the future of strategic power competition and building the foundations to integrate IW throughout every AF core mission.",
    "These efforts are, in part, a reflection of recent DAF leadership directives on range modernization, Live-Virtual-Constructive efforts, Information Warfare planning and guidance, and Electromagnetic Spectrum Superiority strategies, among others.",
    "The team supports IW experts by designing and building training environments and linking Airmen across the world to enable operators and researchers to experiment, test and train in the information environment and electromagnetic spectrum.",
    "The quality of the events increases with each iteration and helps increase readiness among IW Airmen and the rest of the Air Force, as each event exposes more communities to understanding how IW supports the Air Force missions.",
    "The group organized and executed 22 IW-focused events that spanned the globe, bringing together Airmen, Guardians, joint forces and members of academia and industry to rapidly innovate, experiment and accelerate readiness.",
    "This resulted in the creation of a hybrid, wing-level organization to connect IW Airmen from multiple locations to accelerate readiness through training and research initiatives through its next phases of development.",
    "Additionally, each event provides IW-focused training and research to support a larger Air Force mission, such as air superiority; and intelligence, surveillance, and reconnaissance.",
    "“If we want to be resolute world power, we must not only compete in the global commons but also compete and win in contested sovereigns,” said Gen. Mark Kelly, commander of ACC.",
    "“Because of the relationship we’ve established with the Air Force Research Laboratory and academic organizations, they help plan and participate in each event,” he said.",
    "“The distributed nature of the events means they can be conducted more frequently, can be ongoing, and members can participate in multiple iterations,” said Budde.",
    "Air Combat Command stood up a new organization to accelerate information warfare training and research on March 22, 2022, at Davis-Monthan Air Force Base, Arizona.",
    "Focusing our offensive and defensive capabilities in the digitally-enabled domain is critical to honing our lethality in strategic competition.”",
    "The 55th Wing, Detachment 1 will also have operating locations at the 67th Cyber Wing, Joint Base San Antonio, Texas, and Offutt AFB.",
    "“We’ve adapted a ‘build, learn, correct, repeat’ model,” said Col. Christopher Budde, chief of ACC’s information warfare division.",
    "In each event, Airmen are identifying more application and potential, so the concept, players and capabilities continue to grow.",
    "This approach does not detract from other organizations who are working these efforts, but rather helps accelerate their work.",
    "This approach gives IW teams the training and research repetitions they need to excel in other major exercises.",
    "Integrating elements and capabilities enables the team to re-think traditional training and research models.",
    "“Most competition, if not all combat, will take place in the electromagnetic spectrum."
  ]
}