{
  "id": 10483,
  "mediaId": 2753,
  "date": "2022-03-31",
  "headline": "3 Democrats block Biden's Labor nominee",
  "image": "https://www.wnd.com/wp-content/uploads/2022/03/joe-manchin-troubled-jpg.jpg",
  "link": "https://www.wnd.com/2022/03/3-democrats-block-bidens-labor-nominee/",
  "mediaOutlet": "WorldNetDaily",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    0
  ],
  "sentences": [
    "“As she promised Arizonans, Kyrsten evaluates all nominees based on three criteria: whether or not they are professionally qualified, believe in the missions of their agencies, and can be trusted to faithfully execute and uphold the law,” a spokesperson for Sinema said of the senator’s vote, CNN reported.",
    "Democratic Washington Sen. Patty Murray, chairwoman of the Senate Health, Education, Labor, and Pensions Committee, called Weil “an exceptionally qualified nominee” and lamented that he would not have the opportunity to move forward, CNN reported.",
    "(Video screenshot)\nBy Sebastian Hughes\nDaily Caller News Foundation\nThree Democratic senators joined Republicans on Wednesday to kill the nomination of David Weil to head the Labor Department’s Wage and Hour Division, Politico reported.",
    "In a final vote of 47-53, the Senate chose not to move forward with considering Weil’s nomination after intense criticism from Republicans over his tenure in the Obama administration, Politico reported.",
    "She said Weil had a long track record of “fighting to ensure workers get the wages they have earned.”\nThis story originally was published by the Daily Caller News Foundation.",
    "The group thanked Republicans and the three Democratic senators for standing “up for local franchise businesses and workers across the country” in a statement to The Hill.",
    "Opponents went after Weil for policy choices surrounding independent contractor classification, joint employment designations and overtime pay, Politico reported.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "“Upon reviewing Mr. Weil’s nomination, she has concerns with his ability to faithfully execute and uphold the law,” the spokesperson said.",
    "Kyrsten Sinema and Mark Kelly, along with West Virginia Sen. Joe Manchin, were the only Democrats to vote against Weil.",
    "The International Franchise Association (IFA) was one of the business groups to lobby against Weil’s nomination.",
    "U.S. Sen. Joe Manchin, D-W.Va., at the State of the Union address on Tuesday, March 1, 2022.",
    "For licensing opportunities of our original content, please contact [email protected]",
    "The vote makes Weil the first Biden nominee to fail on the Senate floor.",
    "Arizona Sens."
  ]
}