{
  "id": 10512,
  "mediaId": 2830,
  "date": "2022-03-31",
  "headline": "A Big Defeat for Big Labor",
  "image": "",
  "link": "https://www.wsj.com/articles/a-big-defeat-for-big-labor-david-weil-senate-kyrsten-sinema-joe-manchin-mark-kelly-11648763142",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "Plus, Democrats are calling for the resignation of Supreme Court Justice Clarence Thomas over his wife's texts to Mark Meadows, and David Weil loses a confirmation vote for a position at the Department of Labor.Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nMr. Weil had the same job in the Obama Administration, when he sought to destroy the franchise business model and gig economy as Americans know them.",
    "The U.S. Department of Labor headquarters in Washington, D.C.\n Photo: Al Drago/Bloomberg News\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (2 minutes)\nAD\nLoading advertisement...\n00:00 / 02:18\n1x\nThis article is in your queue.",
    "Mr. Weil also redefined most independent contractors as “employees.” This meant so-called gig economy companies like Uber and Instacart would have to schedule shifts in advance, reducing worker flexibility and customer convenience, and raising costs.",
    "WSJ Opinion: Hits and Misses of the WeekPlay video: WSJ Opinion: Hits and Misses of the Week\n Journal Editorial Report: The week's best and worst from Kim Strassel, Jason Riley, Jillian Melchior and Dan Henninger.",
    "Open Queue\nThe tide is turning politically on Capitol Hill, and the latest evidence is the surprising defeat of David Weil to run the Labor Department’s Wage and Hour Division.",
    "President Biden nominated him for a second stint on the expectation that he would impose via regulation much of Big Labor’s Pro Act that has failed to pass the Senate.",
    "Mr. Weil’s joint-employer guidance during the Obama years held corporations jointly liable for their franchisee minimum-wage and overtime violations.",
    "These regulatory appointees will take on more importance as progressives turn to executive action to impose what they can’t pass in Congress.",
    "They’ve seen the headaches the law has created for business and workers next door, and they don’t want them coming to Arizona.",
    "Mr. Weil’s embarrassing defeat is a sign that, as the November election nears, the political mood on Capitol Hill is shifting.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nCan Joe Biden Solve The Gas Price Problem?",
    "Images: Zuma Press/AFP/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "California’s AB5 law reclassifying most independent contractors as employees was inspired by none other than Mr. Weil.",
    "Three Democrats— Joe Manchin, Kyrsten Sinema and Mark Kelly —opposed the union favorite on the Senate floor.",
    "Joe Biden announced the release of up to 180 million barrels of oil reserve to tackle soaring gas prices.",
    "Unions want to erase the distinction between corporations and franchisees to make it easier to organize.",
    "The next Biden nominee who deserves to be defeated: Gigi Sohn for the Federal Communications Commission.",
    "WSJ Opinion: Hits and Misses of the Week\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "But is this a viable solution to what the administration is calling \"Putin's price hike at the pump?\"",
    "And this may be one reason the two Democratic Senators from Arizona opposed his nomination.",
    "0:00 / 2:36\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "So why would Mr. Biden nominate someone to a top Labor job who wants to kill their jobs?",
    "The President’s radical nominees, at least some of them, are getting more scrutiny.",
    "More workers have embraced freelancing during the pandemic.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8"
  ]
}