{
  "id": 10544,
  "mediaId": 2532,
  "date": "2022-03-30",
  "headline": "Biden expected to end Title 42 border expulsion policy in late May",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/03/30/2dd1f4b4-acef-40fb-9ce2-5ca704e9dc3f/thumbnail/1200x630/a44f242e81e2d7f59601420a65903b59/gettyimages-1239613701.jpg",
  "link": "https://www.cbsnews.com/news/immigration-title-42-biden-border-expulsion-policy-late-may/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camilo Montoya-Galvez",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Immigration\n More\n Supreme Court hears case over \"Remain in Mexico\" asylum rule\n Judge to block U.S. border officials from winding down Title 42 policy\n U.S. launches online portal for sponsoring Ukrainian refugees\n Transcript: CBS News interviews DHS Secretary Alejandro Mayorkas\n Mayorkas says U.S. is preparing for \"significant\" border challenges\n More\n Camilo Montoya-Galvez\nCamilo Montoya-Galvez is the immigration reporter at CBS News.",
    "\"Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your Administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border,\" Democratic Sens.",
    "Salwan Georges/The Washington Post via Getty Images\nDepartment of Homeland Security (DHS) officials have been preparing for a potential sharp increase in border arrivals when Title 42 is lifted, including worst-case scenarios in which 12,000 to 18,000 migrants would enter U.S. custody daily, according to an internal contingency plan.",
    "Such scenarios, the contingency plan indicates, would overwhelm U.S. border agents and require the government to dispatch thousands of federal employees to the southern border, double the number of buses and airplanes used to transport migrants and greatly expand capacity at Customs and Border Protection (CBP) processing centers.",
    "The Biden administration is planning to end a pandemic-era emergency rule known as Title 42 that allows U.S. immigration authorities to quickly expel migrants and asylum-seekers in late May, several people familiar with the plans told CBS News, describing what would be a major shift in U.S. border policy.",
    "Citing directives by the Center for Disease Control and Prevention (CDC), U.S. immigration officials have carried out over 1.7 million expulsions of migrants under Title 42 in the past two years, 70% of them under President Biden, who retained the policy despite reversing other Trump border initiatives.",
    "Starting in late April, that court ruling will require U.S. immigration agents to interview families with children to determine whether they have valid asylum claims before expelling them, a prospect that would undermine Title 42's stated goal of reducing the time migrants stay on U.S. soil.",
    "Katie McTiernan/Anadolu Agency via Getty Images\nLee Gelernt, an American Civil Liberties Union lawyer whose lawsuit triggered that court ruling, said he would welcome Title 42's termination in May, \"provided that the policy actually ends then and a significant wind down begins immediately.\"",
    "On March 4, a federal appeals court in Washington, D.C., said the administration could not use Title 42 to expel families to places where they could be harmed, finding that the measure does not override U.S. laws designed to protect asylum-seekers fleeing persecution or torture.",
    "Named for a 1940s public health law, Title 42 has allowed U.S. border officials to rapidly expel migrants to Mexico or their native countries without allowing them to apply for asylum, a legal safeguard the government has argued it can suspend during a public health emergency.",
    "In her order, Walensky said the U.S. did not need to expel unaccompanied children to protect public health, citing rising vaccination rates in the U.S and migrants' home countries and a drop in COVID-19 deaths and cases since the spread of the Omicron variant in the winter.",
    "Republican lawmakers and some centrist Democrats, however, had urged the administration to continue the expulsions, saying Title 42's rescission could trigger a sharp increase in migrant arrivals that would overwhelm U.S. border authorities and their processing capacity.",
    "The preliminary decision to gradually discontinue the restriction comes after two federal court rulings in early March dealt a major blow to the Biden administration's plan to retain the expulsions, which began in March 2020 under former President Donald Trump.",
    "However, Title 42 was first invoked by the CDC in 2020 over the objections of agency experts who did not believe the measure was necessary to protect public health, according to congressional testimony and CBS News reporting.",
    "High-profile Democratic allies of the president, including Senate Majority Chuck Schumer, had been calling on the administration to stop the Title 42 expulsions, citing the relaxation of other pandemic-related restrictions.",
    "In recent weeks, DHS officials have already mobilized hundreds of additional Border Patrol agents and started building new migrant processing facilities, which are supposed to house individuals for no longer than 72 hours.",
    "Earlier this month, CDC Director Rochelle Walensky terminated the Title 42 orders as they applied to unaccompanied minors in response to another court ruling stemming from a lawsuit by Republican officials in Texas.",
    "\"It is highly regrettable that the Biden administration kept this Trump policy in place for more than a year despite a clear consensus among public health experts that the policy was unjustified,\" Gelernt said.",
    "A group of migrant families from Central America walk along side the border wall between the U.S. and Mexico after crossing in to the U.S. near the city of Sasabe, Arizona, Sunday, January 23, 2022.",
    "For over a year, the Biden administration resisted calls to end Title 42 from advocates for asylum-seekers, saying the policy was necessary to curb the spread of COVID-19 in border processing sites.",
    "While border officials have carried out more expulsions under Mr. Biden than under Trump, the Biden administration has faced an unprecedented number of migrant arrivals at the southern border.",
    "The Biden administration has also exempted vulnerable groups of migrants from Title 42, including unaccompanied children, who were subject to the expulsions under Trump.",
    "Pressure on the administration to end the expulsions, which were always supposed to be temporary, intensified earlier this month following two dueling court rulings.",
    "Asylum-seeking migrants from Colombia, Cuba, and Venezuela arrive on U.S. soil after crossing the Colorado River from Mexico on February 21, 2022, in Yuma, Arizona.",
    "CDC spokesperson Kristen Nordlund said the agency was still working on the review and would \"release more information later this week.\"",
    "In 2021, the U.S. reported a record 2 million migrant arrests, over half of which resulted in Title 42 expulsions, CBP data show.",
    "Since August 2021, the CDC has been charged with reviewing Title 42 every 60 days to determine its continued necessity.",
    "On Monday, CBP also started a new effort to vaccinate thousands of migrants against the coronavirus per day.",
    "Kyrsten Sinema and Mark Kelly of Arizona wrote in a letter to Mr. Biden last week.",
    "But he said the policy should've been discarded earlier by the administration.",
    "The administration has not yet announced an appeal of the order.",
    "Based in Washington, he covers immigration policy and politics.",
    "The latest reassessment was due Wednesday.",
    "Twitter"
  ]
}