{
  "id": 10556,
  "mediaId": 2701,
  "date": "2022-04-04",
  "headline": "Senate Democrats Should Demand Biden Address His Border Disaster Before Giving Him A Supreme Court Justice",
  "image": "https://thefederalist.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-04-at-9.04.23-AM-e1649081161396.png",
  "link": "https://thefederalist.com/2022/04/04/senate-democrats-should-demand-biden-address-his-border-disaster-before-giving-him-a-supreme-court-justice/?utm_source=rss&utm_medium=rss&utm_campaign=senate-democrats-should-demand-biden-address-his-border-disaster-before-giving-him-a-supreme-court-justice",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Boyd",
  "authorUrl": "https://thefederalist.com/author/jordandavidson/",
  "termIds": [
    0
  ],
  "sentences": [
    "Sen. Kyrsten Sinema added that terminating border security policies such as Title 42 “despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border.”\nAnother vulnerable Democrat, Sen. Maggie Hassan of New Hampshire, commentated multiple times that Biden’s desire to “prematurely” lift security measures is going to cause more problems for an already-overwhelmed border.",
    "Cory Booker and Bob Menendez admitted a rapid Title 42 recall “will only incentivize more irregular migration to the border and create an unnecessary bottleneck effect when it finally sunsets.”\nThe Senate Democrats who have spoken out against the administration’s border crisis have immense leverage with the Biden administration due to their newfound opposition to the president’s disastrous agenda.",
    "The decision to repeal one of the only tools left to border officials to combat the growing problems dooms the U.S. to a vulnerable southern perimeter already weakened by Biden’s open border policies, something that some Democrats, especially those in the Senate, say is a dangerous and harmful decision that will only cause more problems.",
    "Keeping Title 42 certainly won’t fix the border crisis, especially since the Biden administration has already started scaling back expulsions, but Democrats threatening to halt the regime’s agenda will certainly warrant further action from the federal government which doesn’t dare risk more of the president’s flailing reputation.",
    "The decision, which will go into effect on May 23, was finalized by the Centers for Disease Control and Prevention last week after months of pressure from activists and far-left Democrats and is expected to only worsen what has quickly become the largest domestic security disaster of President Joe Biden’s presidential career.",
    "Several key Senate Democrats have expressed outrage at the Biden administration’s decision to repeal Title 42 but if they really care about the worsening border crisis, they would threaten to torpedo Ketanji Brown Jackson’s confirmation to the U.S. Supreme Court in exchange for some serious action from the White House.",
    "Sen. Joe Manchin rebuked the policy change last week as “a frightening decision” that would only cause more problems for officials who are “nowhere near prepared to deal with that influx.”\nBoth Democrat senators from Arizona, a border state, also had choice words for the administration’s abrupt Title 42 rollback.",
    "While the president focuses on pushing his party to confirm Jackson to the Supreme Court, the Democrats who publicly shamed the administration for creating such a horrific border crisis have the opportunity to boldly reject KBJ in exchange for demanding more border protection and security.",
    "Jackson’s radical track record should already be alarming for some of these self-appointed “moderate” Democrats so it would be fairly easy for legislators such as Manchin, Kelly, and Sinema to refuse to vote for Biden’s affirmative action nominee on the basis of the border.",
    "Much to the dismay of many Republicans and even some Democrats, the Biden administration announced a repeal of Title 42, a Trump-era policy designed to expedite expelling illegal border crossers during the pandemic, shortly before peak migration season.",
    "Democrats may have repeatedly failed to leverage their concerns about the border before but there’s no time like the present, when border agents have logged at least 1 million encounters just six months into the 2022 fiscal year, to demand change.",
    "It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border,” stated Sen. Mark Kelly, who is considered vulnerable in the upcoming midterms.",
    "In the last 14 months, illegal crossings at the U.S.-Mexico border skyrocketed and traffickers and other criminals have thrived while overwhelmed border officials already struggling with understaffing try to keep up.",
    "Their potential refusal to accept Biden’s empty border promises at face value would force the administration’s hand on the ongoing border crisis or risk losing the KBJ confirmation battle.",
    "The border is an alarming wreck as evidenced by the more than 100,000 illegal alien encounters by border officials each month.",
    "Even New Jersey’s leftist legislators such as Sens.",
    "“This is the wrong decision."
  ]
}