{
  "id": 10562,
  "mediaId": 2695,
  "date": "2022-04-01",
  "headline": "Manchin condemns 'frightening decision' to nix Title 42 order, says it will result in an even greater flow of migrants along the southern border",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTYyNjg3NC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwNDYzNTg0Mn0.k2Qmkq1rTABJ89_Gh1u9fbHuIgtCYSyoW1MrMuttnN8/img.jpg?width=1200&coordinates=0%2C156%2C0%2C0&height=600",
  "link": "https://www.theblaze.com/news/manchin-title-42-southern-border",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Nitzberg",
  "authorUrl": "https://www.theblaze.com/u/alexnitzberg",
  "termIds": [
    2459,
    4873,
    5879,
    5510,
    392,
    5949,
    6718
  ],
  "sentences": [
    "From my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and non-profits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities,\" Kelly said in a statement.",
    "\"We have put in place a comprehensive, whole-of-government strategy to manage any potential increase in the number of migrants encountered at our border,\" Department of Homeland Security Secretary Alejandro Mayorkas said in a statement about the upcoming termination of the Title 42 order.",
    "Until we have comprehensive, bipartisan immigration reform that commits to securing our borders and providing a pathway to citizenship for qualified immigrants, Title 42 must stay in place.\"",
    "\"Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border,\" Sinema said in a statement.",
    "I'll keep pushing the administration to strengthen border security & look forward to hearing directly from border agents during my upcoming trip to the border,\" Hassan tweeted.",
    "Over the next two months, we are putting in place additional, appropriate COVID-19 protocols, including ramping up our vaccination program,\" Mayorkas said.",
    "Even with the policy in place, the U.S. has been facing an ongoing massive flow of migrants, but the move could worsen the already significant problem.",
    "We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy.",
    "\"Today’s announcement by the CDC and the Biden Administration is a frightening decision,\" Sen. Joe Manchin of West Virginia said in a statement.",
    "\"We are increasing our capacity to process new arrivals, evaluate asylum requests, and quickly remove those who do not qualify for protection.",
    "It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border.",
    "Sen. Joe Manchin of West Virginia and other Democrats have issued statements speaking out against the plan to terminate a Title 42 order.",
    "\"Title 42 has been an essential tool in combatting the spread of COVID-19 and controlling the influx of migrants at our southern border.",
    "We will increase personnel and resources as needed and have already redeployed more than 600 law enforcement officers to the border.",
    "Democratic Sen. Maggie Hassan of New Hampshire issued a statement warning that the move will likely result in spike in migrants.",
    "\"Ending Title 42 prematurely will likely lead to a migrant surge that the administration does not appear to be ready for.",
    "The Centers for Disease Control and Prevention announced that the order will be be nixed effective May 23.",
    "Mark Kelly and Kyrsten Sinema of Arizona also raised the alarm about the policy move.",
    "We are referring smugglers and certain border crossers for criminal prosecution.",
    "We are nowhere near prepared to deal with that influx.",
    "“This is the wrong decision.",
    "Democratic Sens."
  ]
}