{
  "id": 10581,
  "mediaId": 2745,
  "date": "2022-04-04",
  "headline": "Opinion: Four things Biden could do to help Democrats in the midterms",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BSR4OOVSVAI6ZHN5BVDATVCMDQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/04/04/biden-midterm-message/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "None of the above recommendations are political rocket science, but each one requires the president to stop placating Republicans and commit to making the midterms a choice between a responsible, pro-democracy party and an authoritarian-minded party under the thumb of a corrupt narcissist.",
    "Meanwhile, focusing on deficit reduction would underscore Republicans’ defense of big corporations and billionaires who pay nothing in federal taxes — at a moment when pay for chief executives is headed for another record, with a median of more than $14 million.",
    "Instead, propose a bill to fight inflation with just two parts: cutting the deficit with new taxes on the uber-rich and cutting prescription drug prices (which would also cut the deficit by reducing government outlays for Medicare and Medicaid).",
    "At the same time, the White House should hammer the 193 House Republicans who voted last week against reducing insulin prices — many of whom voted to support a similar insulin cost-cutting measure under the defeated former president.",
    "Biden managed to slip a critical argument into his remarks last week on the March jobs numbers: “We ended the pandemic unemployment assistance programs because Americans are back to work.” That should be repeated over and over.",
    "Democratic senators and Senate candidates might have the money and profiles to carve out identities independent of the president, but lower-profile House members are uniquely dependent on the White House in the midterms.",
    "And why has the White House not embraced measures to beef up the Hatch Act and give inspectors general protection against dismissal without cause and the tools they need to rigorously root out wrongdoing?",
    "Congress can pull out the administration’s proposals to fund law enforcement and secure the border and put them on the floors of both chambers in a substantial bill to keep Americans safe and secure.",
    "The GOP’s formula, by contrast, would have deprived Americans of desperately needed relief, resulting in mass evictions and business closures that would have prolonged high unemployment.",
    "Here’s how Biden can put it: Republicans not only want to scrap the Affordable Care Act but are happy to see Americans pay unnecessarily high prices for insulin and other medications.",
    "It’s baffling that his administration announced last week its dramatic release of 1 million barrels of oil per day from the Strategic Petroleum Reserve from the White House.",
    "The White House might be nervous about aggravating environmentalists who are not thrilled about reliance on carbon-based fuels, but Biden already made the policy call.",
    "Biden has ample funding for both in his budget request, but it will remain hidden in the mass of spending priorities unless Democrats make an effort to highlight them.",
    "Especially vulnerable are moderate Democrats in swing districts who took hard votes on the Build Back Better package only to see the bill fizzle in the Senate.",
    "Biden seems so insistent on “rising above the fray” that he is doing little to protect his fellow Democrats in the upcoming midterms.",
    "In other words, Biden needs to act as if the reelection of his congressional allies is as urgent a priority as it is.",
    "Jon Ossoff (D-Ga.) and Mark Kelly (D-Ariz.) in the Senate that would ban individual stock ownership among lawmakers.",
    "Apparently denying Biden a win is more important than preventing millions of diabetes patients from getting gouged.",
    "Put differently, it’s Biden who ensured millions were not still dependent on the taxpayers, draining the Treasury.",
    "President Biden’s approval ratings remain a deeply worrying sign for congressional Democrats’ midterm prospects.",
    "Democrats can focus on the GOP’s refusal to fund the Internal Revenue Service to collect taxes already owed.",
    "If voters are mad at Biden, they will likely take out their anger on anyone with a “D” after their name.",
    "A two- or three-day tour around the country focused on cutting fuel prices would boost visibility.",
    "Such bills are essential to democracy and would demonstrate Democrats’ commitment to transparency.",
    "The American Rescue Plan kept the economy from tanking; now the government can spend a lot less.",
    "If he is still holding out for bipartisanship, he’s living in a different political universe.",
    "This includes the bill championed by Rep. Abigail Spanberger (D-Va.) in the House and Sens.",
    "Why not talk to energy workers in Texas or set up a podium somewhere in Pennsylvania?",
    "And Biden can remind voters that he has already brought down government spending.",
    "If Democrats can survive the midterms, they can come back for those items later.",
    "Finally, Biden can call out the GOP’s hypocrisy on crime and border security.",
    "Second, the White House can drop the Build Back Better proposal.",
    "First, he can venture beyond the White House more than he has.",
    "No more talk about child care, universal pre-K and the rest.",
    "Cutting drug prices would be good policy and good politics.",
    "Third, Biden can embrace anti-corruption measures.",
    "Let Republicans vote it down on the Senate floor.",
    "Biden can help these Democrats in four ways.",
    "He might as well get credit for it.",
    "Biden’s covid recovery plan worked.",
    "That’s it."
  ]
}