{
  "id": 1058,
  "mediaId": 8474,
  "date": "2022-02-12",
  "headline": "Candidate slammed for shooting at opponents in ad",
  "image": "",
  "link": "https://www.tucsonpost.com/news/272291855/candidate-slammed-for-shooting-at-opponents-in-ad",
  "mediaOutlet": "tucsonpost.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Republican Senate candidate's ad features an ?Old West?-style showdown with Democratic rivals\nJim Lamon, a Republican candidate for the Senate in Arizona, has been roasted by the media for a campaign ad in which he shoots at Democratic rivals - including President Joe Biden and House Speaker Nancy Pelosi - portrayed by lookalike actors in a stylized 'Old West' scenario.",
    "Anti-gun groups, including Moms Demand Action for Gun Sense in America, have called the ad \"disgusting,\" with some critics likening it to a video posted last year by congressman Paul Gosar (R-Arizona) that showed an anime version of the politician slashing the throat of an anime Alexandria Ocasio-Cortez (D-New York) and then menacing an anime Biden.",
    "A spokesperson pointed out that the candidate \"merely shoots the weapons out of [the DC Gang's] hands\" and promises the Republican will \"shoot straight with Arizonans and take the fight to Biden - and he damn sure won't let the left bully him into backing down.\"",
    "While a hand count of ballots in several counties found the accuracy of the posted numbers to be within the acceptable range and an outside audit later confirmed Biden's victory, many remained suspicious of the results in the once solidly-red state.",
    "Flanked by local sheriff Mark Lamb and National Border Patrol Council president Brandon Judd, the candidate faces down the Democrats, declaring \"The good people of Arizona have had enough of you,\" before stating \"It's time for a showdown.\"",
    "Arizona was controversially called for Biden before many districts had reported their vote totals in 2020, leading to accusations of voter fraud from supporters of incumbent President Donald Trump.",
    "Gosar's sharing of the cartoon led to an official censure by the House, which stripped him of both his committee assignments in a vote that fell largely along party lines.",
    "Kelly's wife, former Arizona congresswoman Gabby Giffords, was left with permanent brain damage after being shot in the head at point blank range in 2011.",
    "As his rivals draw their guns, Lamon shoots the weapons out of their hands, and they run away to the sound of cheers from a crowd of locals.",
    "However, Lamon's campaign has refused to spike the ad, which first aired Thursday, despite the chorus of criticism.",
    "Lamon attracted particular criticism for including incumbent Arizona Senator Mark Kelly (D) as a target.",
    "However, Lamon doesn't actually kill the 'DC Gang' featured in the spot.",
    "(RT.com)"
  ]
}