{
  "id": 10646,
  "mediaId": 2650,
  "date": "2022-04-02",
  "headline": "Manchin: Ending Title 42 Border Protections a 'Frightening Decision'",
  "image": "https://media.townhall.com/townhall/reu/o/2021/348/3626611f-928f-430f-b550-f86535c49910-1110x740.JPG",
  "link": "https://pjmedia.com/news-and-politics/rick-moran/2022/04/02/manchin-ending-title-42-border-protections-a-frightening-decision-n1586373",
  "mediaOutlet": "Pajamas Media ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rick Moran",
  "authorUrl": "https://pjmedia.com/columnist/rick-moran",
  "termIds": [
    0
  ],
  "sentences": [
    "— Sen. Maggie Hassan (@SenatorHassan) April 1, 2022\nSen. Mark Kelly (D-Ariz.) is running for reelection this year and said, “This administration does not have a plan to handle an increase in migrants at our border.”\nThe Biden administration will likely do everything in its power to keep the truth of what’s happening at the border under wraps.",
    "We are nowhere near prepared to deal with that influx.”\nThe number of illegals sent home under Title 42 had been dropping in recent months as the administration adopted a catch-and-release policy for all but a fraction of illegals.",
    "It seemed all but certain that some radical judge wouldn’t care about the chaos that would happen in lifting the Title 42 restrictions because no one should be mean to people trying to sneak into the country.",
    "But along with Republicans and border officials, a number of moderate Democrats have expressed concern that such a move will lead to a surge in the already massive numbers being encountered at the border.",
    "According to Homeland Security officials, once the Trump era restriction on illegal immigrants — Title 42 — is lifted next month, the border patrol will be arresting at least 8,000 illegal aliens a day.",
    "Manchin, who this week called for the administration to make Title 42 permanent, said on Friday that Title 42 has been “essential” in combating COVID-19 and controlling the migrant flows.",
    "No wonder Sen. Joe Manchin (D-W.Va.) called the Biden administration decision “frightening.”\nFox News:\nLeft-wing activists and top Democrats have called for such a move for months.",
    "But if people start dying or if the mass of humanity overruns the border crossings, it will be hard to run interference for a policy that will draw international outrage.",
    "I'll keep pushing the administration to strengthen border security & look forward to hearing directly from border agents during my upcoming trip to the border.",
    "“We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy,” he said.",
    "If 8,000 illegals are arrested every day after the lifting of Title 42 on May 23, more than 240,000 illegals will be arrested in the month following.",
    "As a political issue, this is going to be kryptonite for Democrats in the midterms — especially in states along the Southern border.",
    "Vulnerable Democrats know that and are trying to distance themselves from their party’s toxic inability to protect the borders.",
    "Ending Title 42 prematurely will likely lead to a migrant surge that the administration does not appear to be ready for.",
    "The media will slavishly cooperate and try and distract us with stories of “missing phone calls” and other stupidities.",
    "Otherwise, expect everything that happens at the border to be just another day at the office.",
    "There will be very limited access for the media and opposition members of Congress.",
    "That’s more than double the 2019 surge of illegals during the Trump administration.",
    "The legal challenges to Title 42 had been chipping away at the rule for months.",
    "Contrast that with just 158,000 illegals caught at the border in February."
  ]
}