{
  "id": 10673,
  "mediaId": 6598,
  "date": "2022-04-01",
  "headline": "Biden news: Harris says US ‘not into regime change’ but won’t say whether she agrees Putin must go",
  "image": "https://static.independent.co.uk/2022/04/01/19/SEI96598468.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/biden-news-oil-reserves-trump-putin-hunter-b2048732.html",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maroosha Muzaffar",
  "authorUrl": "https://www.independent.co.uk/author/maroosha-muzaffar",
  "termIds": [
    4905,
    4591,
    2859,
    6678,
    6672,
    6569
  ],
  "sentences": [
    "While inflation remains a huge concern to Americans, Mr Biden has also ordered the release of up 1 million barrels of oil per day from the strategic petroleum reserve for the next six months in a bid to control prices that have spiked since the US and its allies imposed strict sanctions on Russia after it began its war on Ukraine.",
    "Answering questions from reporters on Thursday, Mr Biden said Russian president Vladimir Putin “seems to be self-isolated and there’s some indication that he has fired or put under house arrest some of his advisers”.",
    "President Joe Biden delivered remarks this morning hailing another successful jobs reports that sees employment return to pre-pandemic levels and unemployment to drop to a level not seen since 1969.",
    "At Friday’s press briefing Ms Psaki refused to comment on her plans, other than to say she that if she left she would spend time with her children and would sleep.",
    "Pressed on if she could do be an effective briefer with plans to join a media outlet Ms Psaki said she is abiding by all ethics rules and legal requirements.",
    "Meanwhile, new reports say that White House Press Secretary Jen Psaki will leave her post this spring to take up a job at MSNBC.",
    "It had long been speculated that Ms Psaki would be leaving the administration soon after more than a year in the role."
  ]
}