{
  "id": 10690,
  "mediaId": 2595,
  "date": "2022-04-02",
  "headline": "Sen Manchin Calls Biden’s Rescinding of Title 42 “Frightening”",
  "image": "https://i0.wp.com/www.independentsentinel.com/wp-content/uploads/2021/05/biden-employee-of-the-month.jpg?fit=600%2C687&ssl=1",
  "link": "https://www.independentsentinel.com/sen-manchin-calls-bidens-rescinding-of-title-42-frightening/",
  "mediaOutlet": "independentsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "M Dowling",
  "authorUrl": "https://www.independentsentinel.com/author/freebird/",
  "termIds": [
    4873,
    5510,
    4905,
    5879,
    392,
    1428,
    5949,
    6678
  ],
  "sentences": [
    "“Ending Title 42 expulsions will signal to cartels and migrants alike that our southern border is now wide open—inciting even more violence, more trafficking, and more lawlessness.”\n3/3… As soon as they cross, they change into dry clothing— Every group I have encountered does this.",
    "Until we have comprehensive, bipartisan immigration reform that commits to securing our borders and providing a pathway to citizenship for qualified immigrants, Title 42 must stay in place,” he said.",
    "Sen. Joe Manchin (D-W.Va.) on Friday slammed President Biden’s decision to rescind Title 42, as “a frightening decision” that would likely increase the volume of migrants at the southern border.",
    "“Today’s announcement by the CDC [Centers for Disease Control and Prevention] and the Biden Administration is a frightening decision,” Manchin said in a statement after Biden’s announcement.",
    "We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy,” Manchin warned, according to The Hill.",
    "Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border,” she said in a statement.",
    "Many leave their wet belongings behind, some even leave personal documents— Migrants have told me that they believe those documents can hurt them more than they can help them.",
    "“Prematurely ending Title 42 without a comprehensive, workable plan would put at risk the health and safety of Arizona communities and migrants.",
    "“Title 42 has been an essential tool in combatting the spread of COVID-19 and controlling the influx of migrants at our southern border.",
    "DEMOCRATS WHO WANT TO GET RE-ELECTED\nSen. Kyrsten Sinema (D-Ariz.) joined Manchin in pushing back against the administration.",
    "Border Patrol officers had 838,000 migrant encounters at the southern border during the first three months of the year.",
    "SHE SUDDENLY NOTICED THE INFLUX\nSen. Maggie Hassan (D-N.H.), who wants to get re-elected suddenly found her voice.",
    "TEXAS GOVERNOR ABBOTT\nTexas Governor Abbott issued a statement on border policies and the end of Title42.",
    "About three million have come into the US illegally under Joe Biden, if one includes the ‘Gotaways’.",
    "In doing this, Biden is responding to pressure by communist open borders groups.",
    "She warned that it would “risk the health and safety” of her constituents.",
    "pic.twitter.com/b9RGr0EbnR\n— Ali Bradley (@AliBradleyTV) April 1, 2022",
    "The media gladly lets them without explaining who they really are.",
    "She said “she’ll keep pushing the administration” to not do it.",
    "The difference now is that he wants to get back into office.",
    "Mark Kelly supported her, mentioning the lack of a plan.",
    "They like to refer to themselves as immigration groups.",
    "“We are nowhere near prepared to deal with that influx.",
    "[Let’s not ignore Secretary Mayorkas’s role in this.]",
    "She too criticized the administration’s decision.",
    "However, he never said anything before."
  ]
}