{
  "id": 1113,
  "mediaId": 2618,
  "date": "2022-02-18",
  "headline": "The Death of Muscular American Social Life",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/18/the_death_of_muscular_american_social_life_79447.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anthony Esolen",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "We did not discuss race or any of what now is considered 'woke', because it barely existed.We had no safety officers in school and no 'levels' of administration; in high school a principal, period, and no one wanted to go to her office or have her call your parent.",
    "The birth of rock and roll, live ( and funny ) TV, cars that that had style and didn't all look like each other and you knew you would be safe from an atomic blast if the shades were pulled down in your classroom and you hid under your desk.",
    "In the Catholic churches the women had to wear head coverings.I went to a Catholic High School and we of course wore uniforms and the boys could not wear denim jeans and had to have a collared shirt.",
    "I too grew up in the 50's and 60's in what is today considered one of the most liberal areas of the country, Marin County Calif. Marin was completely different at the time, they voted Republican.",
    "Having thus set up the strawman, they proceed to attack it with vigor, and in the process, retcon our happy, peaceful and productive past into some hellscape of intolerance, hatred and conflict.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Contemporary social critics tend to pick out isolated examples of (alleged) social failures during that period and magnify them so as to seem the rule rather than the exception.",
    "I grew up in the Deep South so that may have been a factor, but there was a standard of decorum that everyone, no matter race, ethnicity, religion or social standing lived by.",
    "I've heard some say that we're looking at the 50s through rose colored glasses but I know that I remember them fondly; I'm glad I was able to experience life in those days.",
    "I do feel sorry that today's children cannot experience the joys of playing outdoors with their friends, for many reasons, mainly their personal safety from predators.",
    "I, too grew up in the 50s and 60s and #4 reminded me of the fact that my mother would don a hat and short white gloves to go to the grocery store or run other errands.",
    "The acceptance that men were the primary protectors and providers gave structure to the community and confidence to everyone who weren’t bullies or thugs themselves.",
    "We don’t have to assert that it was a “golden age,” any more than we have to assert that all of the founders were geniuses of political acumen and farsightedness.",
    "This tendency found its apogee in the so-called \"1619 Project,\" whereby everything about America's past was condemned because of a singular issue, namely slavery.",
    "Each Sunday after church my grandmother cooked a huge meal for everyone and we all sat at her dining room table while the adults talked among themselves.",
    "My mother read to my sister and me every night until we were old enough to read for ourselves, my family played board and card games in the evening.",
    "That this was not only allowed to happen, but was encouraged by those in the ruling elite shows how far we have degenerated as a society.",
    "Their parents never came to the school complaining that their little darlings were being picked on by the school; none threatened to sue.",
    "All my life, I have encountered people who scoff at the notion that the American family was far healthier in the 1950s than it is now.",
    "My dad always wore a suit to church with a hat most of the time and mom never left for service without a nice dress, hat and gloves.",
    "The television was on for specific shows - the evening news, Bonanza, the Wonderful World of Disney, Ed Sullivan and a few others.",
    "He is incredibly knowledgeable on any number of subjects, a great writer and translator, and a great social commentator.",
    "When my mother and I took a trip downtown to shop she always dressed for the occasion in a dress with a hat and gloves.",
    "Kids spent a LOT of time outdoors; with the possible exception of Saturday mornings (remember the old westerns on TV?)",
    "We have deliberately decided to allow these people to beat the rest of us into submission with their lying propaganda.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "A few times a month we'd go to the drive-in movies; when I was really small my mom would put me in pajamas first.",
    "My parents didn't stint on discipline either; I was no stranger to a few swats on the backside if I broke a rule.",
    "They cannot, of course, point to any strong evidence of widespread unhappiness and dysfunction in that time.",
    "Having lived through the entire decade of the 'fifties, I can attest that every word in this essay is true.",
    "The kids today have no idea how much freedom we had, parents couldn't constantly call you on cell phones.",
    "All I had to do was walk out the door and join the group that was playing whatever game I wanted to play.",
    "It is unfortunate that people do not have more self-respect or reverence when it comes to church attire.",
    "Instead, he was forced out of his teaching job at Providence College for being politically incorrect.",
    "Then in the early 70s, someone came in and stole a bunch of the communion vessels and the tabernacle.",
    "I know of parents today that secretly put cameras on their kids cars, so they can follow them around.",
    "When we went to school functions,including sporting events, the girls had to wear dresses or skirts.",
    "I was at the stage in life where I was expected to be seen but not heard (and to clean my plate!!).",
    "Snooping has become a way of life in the United States and it starts from the day you are born.",
    "My father would doff his trilby hat(fedora) to women if he knew them, and to passing hearses.",
    "We definitely were not perfect people, but there was a dignity about how we lived our lives.",
    "All the churches were full, all the men had on ties and jackets and the women wore dresses.",
    "They are not making up their own games and amusing themselves endlessly with simple things.",
    "I suppose it makes such people feel better about themselves and their myriad shortcomings.",
    "Rosie the Riveter usually wanted children and a home, not a new sweatband and more rivets.",
    "At no time did mothers have to call each other to set up \"play dates\" for their children.",
    "I also remember spending some time in the corner at school although I can't remember why.",
    "All of these reminiscences brought tears to my eyes; the 50s were a great time for kids.",
    "Sometimes today I feel like an old fuddy duddy when I am shocked by today’s casualness.",
    "My mother cooked dinner every night and we sat around the table as a family for dinner.",
    "That era was imperfect but people were safer because they looked out for each other.",
    "I walked the streets of lower income and minority areas without a thought of danger.",
    "Now people have cameras and safety features everywhere in their homes and vehicles.",
    "We would tell our mother where we were going, and she told us when to be back home.",
    "The drudgery and boredom of housewifery was offset by the safety of neighborhoods.",
    "Perhaps it is not too late to stand athwart this historical trend and say, \"Stop!\"",
    "Manners were important, one was more often judged if manners were not up to snuff.",
    "I strutted down the street so proud of my first pair, they were green by the way.",
    "As a teenager in post war England, life was definitely very pleasant and safe.",
    "We belonged to a swimming club and spent lots of time there with our friends.",
    "The younger folks have NO IDEA what it was like back in the 'good old days'.",
    "As long as I came home when the street lights came on there were no worries.",
    "She did a lot of housework but never did she do it wearing heels and pearls!",
    "She wore what was called a housedress, a simple easily washed cotton dress.",
    "Toys weren't garishly colored battery operated plastic imagination killers.",
    "We knew all the neighbors and had the same neighbors for close to 50 years.",
    "Being a child of the 50’s and 60’s, was a dream compared to today’s world.",
    "Mother always dressed up to go to London, hat, gloves were ritual for her.",
    "She made 3 meals each day and we ate together as a family every evening.",
    "Back then, responsibility, accountability , morals, and ethics mattered.",
    "At least, it is fervently to be hoped, for the sake of our posterity.",
    "American men and women after the war were eager to resume real life.",
    "Your donation helps keep our discussions going and our voices heard.",
    "It was a slower much less frenetic way of life geared toward family.",
    "Our priest was shocked and the church has had to lock up ever since.",
    "I'd grab a jar and go out hunting lightning bugs with everyone else.",
    "* That alone should tell folks how much our society has diminished.",
    "Teachers then were not afraid to dole out punishment when needed.",
    "I had some classmates who had their knuckles rapped on occasion.",
    "Traveling solo by bus or train in and out London was even fun.",
    "Life was good, family was important and neighborhoods thrived.",
    "Jeans became available in stores , these were a must have.",
    "She had a wardrobe of gloves; a pair to match each outfit.",
    "Tony Esolen should be recognized as a national treasure.",
    "Then we were free to ride all over town on our bicycles.",
    "Swearing was rarely heard in public and never by women.",
    "Divorces were rare, and so were out-of-wedlock births.",
    "We played outside on summer evenings until after dark.",
    "People dressed for dinners out and special occasions.",
    "It was a beautiful sight and not only at church.",
    "The article brought back strong memories for me.",
    "The world has definitely changed for the worse.",
    "My reality was much like those old sitcoms.",
    "I am amazed at how people come to service.",
    "My parish church never locked its doors.",
    "I think she wore white Keds on her feet.",
    "My neighborhood was teeming with kids.",
    "We never locked the car or our houses.",
    "We had a lot of freedom in the summer.",
    "For children it was a wonderful time.",
    "I'm also a child of the 50s and 60s.",
    "It was a very good time to grow up.",
    "It was a wonderful time to grow up.",
    "She was no June Cleaver, though.",
    "I was not raised to be entitled.",
    "To have experienced the 50's.",
    "I grew up in the 50s and 60s.",
    "and today doesn't come close.",
    "* We never locked our doors.",
    "Summer nights were the best.",
    "I admit I broke many rules.",
    "Eating out was a big treat.",
    "She dressed me up as well.",
    "I grew up in those days.",
    "It was an idyllic time.",
    "we didn't stay indoors.",
    "Unbelievable, right??",
    "Reply #4 is point on.",
    "But guess what?",
    "ah nostalgia!",
    "I miss that.",
    "Thank you."
  ]
}