{
  "id": 11441,
  "mediaId": 2790,
  "date": "2022-03-18",
  "headline": "Gas prices are near record highs. A fuel tax holiday could give consumers some relief",
  "image": "https://media.npr.org/assets/img/2022/03/17/img_7742_wide-c9ef1a49ca82a41746dbf6a7cd1c71221317fb67.jpg?s=1400",
  "link": "https://www.npr.org/2022/03/18/1087072629/gas-prices-are-near-record-highs-a-fuel-tax-holiday-could-give-consumers-some-re",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Schaper",
  "authorUrl": "https://www.npr.org/people/2101136/david-schaper",
  "termIds": [
    0
  ],
  "sentences": [
    "Elected officials in about 20 states have proposed gas tax holidays ranging from one month to two years to save consumers money\nThey're among the elected officials in more than 20 states who have proposed gas tax holidays of anywhere from one month to two years, which, depending on how high their state gas tax is, could save consumers 25 to 50 cents a gallon, or more.",
    "\"You have to find replacement revenue from somewhere,\" says Davis, adding that in most states, the transportation budget is already set, \"so every dime that you take out of that (fund), you'll have to find a way to put something else back in there in order to pay for the infrastructure spending.\"",
    "High prices disproportionately affect low wage workers, many of whom must drive to work and live paycheck to paycheck\nThe high prices disproportionately affect low wage workers, many of whom must drive to work and live paycheck to paycheck, so they are unable to absorb price spikes.",
    "It would immensely help these low wage earners who are getting back into the workforce and beginning to commute,\" said Maryland Democratic state comptroller Peter Franchot recently in support of a one month pause of that state's 37-cents a gallon gas tax.",
    "Just because you take away 18.4 cents of the cost of a gallon of gasoline goin out the door of the refinery into a pipeline, there's no guarantee that that savings is going to be passed on through the wholesaler and then to the service station.\"",
    "(@GasBuddyGuy) March 16, 2022\nTemporary relief is better than no relief\nThat seems fine with consumers like Jessica Aguilar of Chicago, who are facing skyrocketing fuel costs on top of sharp prices increases for just about everything else.",
    "Another problem is that like at the federal level, state and local gas taxes are often strictly dedicated to maintaining, repairing and replacing the very aging and crumbling roads and bridges that drivers rely upon.",
    "\"We actually have the power here to reduce gas prices by 28-cents a gallon for every Michigander,\" said Michigan Republican state rep. Steve Johnson as he urged fellow lawmakers to suspend that state's gas tax.\"",
    "So from coast the coast, politicians of both parties see a potential winning issue with voters, and are proposing measures to slash or temporarily suspend state and local gas taxes to give consumers a break.",
    "The national average has room to fall 35-55c/gal over the next 3-5 weeks- the question is: will oil prices stay at these lows and allow it, or do we get a new rally that stops the relief I’m referring to?",
    "Senators, led by Maggie Hassan of New Hampshire, Mark Kelly of Arizona, and Raphael Warnock of Georgia, are calling for a temporary suspension of the 18.4 cents per gallon federal gas tax, as well.",
    "Some states have significant budget surpluses this year, while Florida and a couple of other states plan to use excess federal COVID-19 relief funds to make up for the loss of gas tax revenue.",
    "\"Now is the time to provide immediate relief to the people of Connecticut broadly ... and specifically as it involves drivers getting hit at the pump,\" said that state's Democratic Gov.",
    "\"This body has the opportunity to save Georgians near $157 million each month at the pump,\" said Republican state rep. Jodi Lott, in urging her colleagues to support the measure.",
    "To plug the huge holes in state transportation budgets that a gas tax holiday would create, some governors and lawmakers have proposed shifting funding from other sources.",
    "GasBuddy analyst Patrick De Haan tweeted that he expects the national average price to drop 35 to 55 cents over the next three to five weeks, if oil prices stay down.",
    "Yeah, especially with summer coming up, I'm sure a lot of people will be traveling a lot more, so I'm sure that people are gonna appreciate that temporary tax cut.\"",
    "Others, however, are concerned that what some are calling gas tax \"holidays\" could sharply reduce the funding needed to fix and replace crumbling roads and bridges.",
    "There's no guarantee that the savings is going to be passed on to the consumers\n\"You've got to remember, the federal taxes are levied at the refinery.",
    "And Davis says even if Congress, or some states, reduce or suspend gas taxes, there's no certainty it will trickle down to consumers at the gas pump.",
    "Such proposals are not a surprise, says Jeff Davis of the Eno Center for Transportation, a Washington, D.C.,-based nonpartisan think tank.",
    "\"I've been finding myself getting empty quickly because I'm not filling my tank as I usually would because of the gas prices.\"",
    "The Georgia House last week approved a bill to suspend the state's 28.7 cents a gallon motor fuel tax through the end of May.",
    "\"We need this money to keep our roads going, and repair our roads and make our roads safer,\" DeWine told reporters recently.",
    "She says saving even just a few bucks when filling her tank over for a month or two month would help her make ends meet.",
    "At two stations on Chicago's northwest side, the credit price per gallon at the pump was $4.69 and $4.89 respectively.",
    "Ned Lamont on Monday, after he proposed suspending his state's 25 cents a gallon gas tax through the end of June.",
    "The national average price of a gallon of regular unleaded gas was over $4.29 Thursday, according to AAA .",
    "It's the reason Ohio's Republican governor Mike DeWine opposes a partial repeal of his state's gas tax.",
    "Gonzalez winced as he pumped 10.6 gallons of gas into his car on Chicago's northwest side recently.",
    "The problem, he says, is that cutting the federal gas tax really won't save drivers much money.",
    "Oil prices have plummeted in recent days, with U.S. crude dropping to $95 a barrel Wednesday.",
    "Eliminating that tax would save a driver putting 15 gallons of gas in their car about $2.76.",
    "\"I think it's ridiculous,\" added Jessica Aguilar, 30, of Chicago, \"but what can we do?",
    "That's down slightly from the record high national average price of $4.33 on March 11.",
    "Drivers may soon get the relief they're looking for even without a gas tax holiday.",
    "Since the start of the war in Ukraine, gasoline prices have been skyrocketing.",
    "\"Gas prices are way too much, you know,\" says Meris Gonzalez of Chicago.",
    "Only 18.4 cents of that per gallon is the federal taxes,\" he says.",
    "And for many people, the pain at the pump these days is palpable.",
    "In parts of California, the price is well over $6.00 a gallon.",
    "\"You know, our pay (is) not going up, but the gas is going up!",
    "And so it's what comes up, unfortunately,\" Davis tells NPR.",
    "\"Temporary relief is better than no relief,\" Aguillar says.",
    "They and other drivers are practically begging for relief.",
    "The public wants the politicians doing something about it.",
    "\"Well, you know, we're paying $4 at the pump right now.",
    "But prices vary a lot by state and by region.",
    "Chicagoan Miriam Khoshaba, 26, feels it too.",
    "We really don't have much control over it.\"",
    "\"There you go - 50 bucks,\" he exclaimed.",
    "\"So it would just be a mistake to that.\"",
    "\"It's a lot of money,\" Khoshaba says.",
    "\"Even if it's just for a little bit.",
    "A gas tax holiday is something.",
    "This is ridiculous, you know?\"",
    "Everything is going up!\"",
    "Several Democratic U.S.",
    "It passed unanimously.",
    "— Patrick De Haan ????",
    "\"People can't afford.",
    "\"There's a problem.",
    "We have to pay it."
  ]
}