{
  "id": 1150,
  "mediaId": 2859,
  "date": "2022-02-17",
  "headline": "Are there enough moderate Republicans to take down Trump in the midterms?",
  "image": "https://deseret.brightspotcdn.com/dims4/default/ce392b0/2147483647/strip/true/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FydXXpwW7gnYHEJOx26jKJz5B8-o%3D%2F0x0%3A5747x3831%2F5747x3831%2Ffilters%3Afocal%282874x1916%3A2875x1917%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F23248209%2FAP22046761871345.jpg",
  "link": "https://www.deseret.com/2022/2/16/22933378/are-there-enough-moderate-republicans-to-take-down-trump-in-the-midterms-mcconnell-larry-hogan",
  "mediaOutlet": "Deseret News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "D. Hunter Schwarz",
  "authorUrl": "https://www.deseret.com/authors/hunter-schwarz",
  "termIds": [
    0
  ],
  "sentences": [
    "In a statement Monday, Trump said Republican voters in Arizona “will never accept RINO Governor Doug Ducey of Arizona running for the U.S. Senate,” and called on McConnell to “save your time, money and energy.”\nDucey angered Trump when he certified Arizona’s election results for President Joe Biden after state-mandated audits confirmed Biden narrowly won the state.",
    "And if you want a Republican majority to thwart the radical far-left D.C. Democrat agenda, then we’ve got to keep this seat in Republican hands.” If Republicans want to lose the seat, though, Mace said, “then my opponent is more than qualified to do that.”",
    "All have raised more money than their pro-Trump challengers, according to Federal Election Commission campaign filings, as has Sen. Lisa Murkowski, R-Alaska, the only impeachment Republican in the Senate up for reelection this year.",
    "Larry Hogan, R, to run for Senate, McConnell dispatched Sen. Mitt Romney, R-Utah, Sen. Susan Collins, R-Maine, and his wife and former Transportation Secretary Elaine Chao to make the sell to Hogan, according to The New York Times.",
    "“I was certainly humbled by that and it gave me and my family reason to consider it, but as I have repeatedly said, I don’t aspire to be a United States senator and that fact has not changed.”\nNew Hampshire GOP Gov.",
    "As moderate Republicans plot a path to a post-Trump party in this year’s primaries, they’re desperately seeking new recruits willing to run for Congress who can win in the primaries and the general election.",
    "Rep. Nancy Mace, R-S.C., voted against impeaching Trump, but she said he should be held accountable for his role in the attack during her first speech on the U.S. House floor.",
    "“A number of people said that they thought I could make a difference in the Senate and be a voice of common sense and moderation,” Hogan said at a press conference last week.",
    "Mace’s primary survival strategy includes praising Trump even as she makes the moderate Republican argument that she’s better suited to win in the general election.",
    "Three of the 10 who voted to impeach after the Jan. 6 riot last year aren’t seeking reelection, but those who remain have actually been successful at fundraising.",
    "Senate Minority Leader Mitch McConnell, for example, has been trying to recruit governors capable of winning statewide office, and he’s pulling out all the stops.",
    "McConnell has told Ducey that he shouldn’t worry about Trump in a primary, and his team shared polling data they say proves their point, according to the Times.",
    "In a video filmed in front of Trump Tower and posted to Twitter Thursday, Mace said nominating Arrington would be a victory for Democrats.",
    "The former president has since endorsed a pro-Trump primary challenger against Mace, Republican Katie Arrington.",
    "Criticism of former President Donald Trump is not disqualifying, and the salary is $174,000 a year.",
    "Doug Ducey, has yet to say whether or not he will challenge Democratic incumbent Sen. Mark Kelly.",
    "In the House, however, Republicans who voted for Trump’s impeachment have seen their ranks thin.",
    "“Nancy Pelosi would love nothing more than to win this seat back in a midterm election cycle.",
    "The help wanted ad is easy to write: Come help Republicans win back Congress.",
    "Chris Sununu, has also turned down a Senate run, and Arizona Gov.",
    "She did it in ’18 and she can do it again this cycle,” Mace said.",
    "But Trump’s ire extends beyond just those who voted to impeach.",
    "“I won this seat back for Republicans in 2020.",
    "They’re casting a wide net and pitching hard.",
    "To convince Maryland Gov.",
    "Still, Hogan declined."
  ]
}