{
  "id": 11604,
  "mediaId": 2573,
  "date": "2022-03-29",
  "headline": "GOP to use Jackson hearing to spotlight social issues in midterms: 'Literally can't say what a woman is'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Ketanji-brown-jackson07.jpg",
  "link": "https://www.foxnews.com/politics/republican-national-committee-ketanji-brown-jackson-confirmation-midterms",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    2459,
    3896,
    4905,
    5868,
    5699,
    1489,
    392,
    1126,
    1269
  ],
  "sentences": [
    "FOX NEWS POLL INDICATES A MAJORITY OF VOTERS SUPPORT CONFIRMATION OF JUDGE JACKSON TO THE SUPREME COURT\nThe RNC has already poured significant effort into messaging around Jackson's confirmation, including posting dozens of clips online and doing copious media interviews.",
    "\"Ketanji Brown Jackson has proven to be exactly what Joe Biden promised: a liberal, activist judge who will rubberstamp the far left’s political agenda,\" RNC Chairwoman Ronna McDaniel said in a statement to Fox News Digital.",
    "Republicans likely can't stop Judge Ketanji Brown Jackson from being confirmed to the Supreme Court, but the Republican National Committee (RNC) believes her confirmation is a boon for its Senate candidates this fall.",
    "In addition to a recent social media and surrogate push on Jackson in recent days, a RNC official said it's likely phone bankers and canvassers will be given talking points referencing Jackson's confirmation.",
    "\"Judge Jackson is the most popular Supreme Court nominee since John Roberts was confirmed, and maintains support from everyone from conservative lawyers to the nation's largest group of police officers.\"",
    "\"It's been clear from the start that a number of Senate Republicans are more focused on peddling lies to serve their own partisan interests than they are in conducting a fair and respectful process.",
    "Democratic National Committee spokesman Ammar Moussa, meanwhile, said Republicans will \"light money on fire\" if they plan to attack Democrat candidates using the Jackson confirmation.",
    "That official was referencing, among other moments in Jackson's hearing last week, an instance when Sen. Marsha Blackburn, R-Tenn., asked the nominee to define the word \"woman.\"",
    "A Fox News Poll taken between March 18 and 21, before Jackson's confirmation hearings, showed that 56% of voters supported Jackson compared to 35% who said they opposed her.",
    "But the RNC believes that even if Democrat senators weren't swayed during Jackson's hearings, voters will be in November after seeing what their Democrat senators voted for.",
    "In another instance, Sen. Ted Cruz, R-Texas, pressed Jackson about the curriculum of a private school in Washington, D.C., that she serves at in a leadership role.",
    "The Senate Judiciary Committee is scheduled to take a vote on the nominee next Monday, setting up a possible final confirmation vote just days later.",
    "Voters will also likely see clips from the Jackson hearings in digital ad buys, literature drops and more as November approaches, the official said.",
    "We saw someone who touted critical race theory and who actually… helped oversee a school where critical race theory and its concepts are taught.",
    "WHITE HOUSE OMITTED LIGHT JACKSON CHILD PORN SENTENCE IN DOCUMENT GIVEN TO SENATORS, GOP SAYS: ‘COVER-UP’\n\"We saw someone who's pro-abortion.",
    "\"When you see a nominee who literally can't say what a woman is… it really cuts to the chase for the average voter,\" a RNC official said.",
    "And it doesn't appear that GOP attacks on Jackson had a significant effect on any other Democrats during her confirmation hearings.",
    "\"Someone who literally refuses to define what a woman is is a basic question that the average elementary school kid can answer.\"",
    "They've disrespected, berated, and thrown everything they can at Judge Jackson only to see their attacks fail,\" Moussa said.",
    "He said the books were connected to critical race theory – including one by critical race theorist Ibram X. Kendi.",
    "From now to November, vulnerable Democrats will be held accountable for endorsing Jackson’s radical record.\"",
    "\"The RNC will ensure that Democrats up and down the ballot must answer the questions that Jackson couldn’t.",
    "GOWDY: HOW CONSTRUCTIVE WAS JUDGE KETANJI BROWN JACKSON'S CONFIRMATION HEARING IN THE SENATE?",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "Someone who's soft on crime… soft on child pornography,\" an RNC official told Fox News.",
    "And even more, why should my senator, why should a Democrat senator, vote for them?\"",
    "After last week's marathon hearings, Jackson is inching closer to being confirmed.",
    "\"They own all of those things that Jackson's tied to,\" the RNC official added.",
    "Sen. Joe Manchin, D-W.Va., has already said he will vote for Jackson.",
    "It's even staged protests at the in-state offices of vulnerable Sens.",
    "\"They think, why should that person be on the Supreme Court?",
    "Tyler Olson covers politics for Fox News Digital.",
    "Catherine Cortez-Masto, D-Nev., and Mark Kelly.",
    "\"Not in this context, I'm not a biologist.\"",
    "\"I can't,\" Jackson told Blackburn.",
    "D-Ariz."
  ]
}