{
  "id": 11651,
  "mediaId": 2520,
  "date": "2022-03-25",
  "headline": "Sinema, Kelly urge Biden not to end Title 42 without plan to avoid harm to border cities",
  "image": "https://www.gannett-cdn.com/presto/2021/03/06/PPHX/1e0c25dd-6ed8-4214-a275-dd7432755934-pjimage_6.jpg?crop=1911,1075,x4,y0&width=1911&height=1075&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/border-issues/2022/03/25/sinema-kelly-urge-biden-avoid-abrupt-repeal-title-42-border/9459387002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rafael Carranza",
  "authorUrl": "https://www.azcentral.com/staff/2646553001/rafael-carranza/",
  "termIds": [
    0
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nGiven the outsized role that nonprofits and local governments have played in response to migrant releases, Kelly and Sinema urged the federal government to engage with them before making any changes that could impact the communities they serve.",
    "In parts of the U.S.-Mexico border such as Yuma, the Border Patrol has been releasing large numbers of migrants and asylum seekers under parole since 2018, with instructions to check in with U.S. Immigration and Customs Enforcement at their final destinations in the U.S.\nTheir release in larger numbers in recent months has created transportation bottlenecks at bus stations and airports in cities such as Phoenix.",
    "Kyrsten Sinema and Mark Kelly, both D-Ariz., sent a letter Thursday to the White House saying that doing away with Title 42 without having a plan to ensure a \"secure, orderly, and humane process\" could create additional hardships on border communities.",
    "\"To date, we have not yet seen evidence that (the Department of Homeland Security) has developed and implemented a sufficient plan to maintain a humane and orderly process in the event of an end to Title 42,\" Sinema and Kelly wrote in their letter.",
    "Title 42 has been in place at the U.S.-Mexico border since March 2020, when the U.S. Centers for Disease Control and Prevention under then-President Donald Trump implemented emergency restrictions intended to prevent the spread of COVID-19.",
    "Biden has kept Title 42 in place and has continued to block asylum processing at border crossings, drawing a barrage of criticism from immigration advocates who see the rule as a border enforcement tool rather than public health policy.",
    "Arizona's two senators are asking President Joe Biden to avoid abruptly ending Title 42, a controversial public health rule that has been used to expel more than 1.7 million migrants and asylum seekers along the U.S.-Mexico border.",
    "Since then, U.S. Customs and Border Protection, the nation's border security agency, has expelled 1.7 million migrants along the southwestern U.S. border as of the end of February, according to CBP statistics.",
    "Until the Administration does that type of consultation with local government leaders and nonprofits along the border, it is premature to consider changes to Title 42 authorities,\" Sinema and Kelly said.",
    "\"Chaos at the border in a post-Title 42 scenario also negatively affects migrants’ safety and could further strain an already overwhelmed health care system at the border,\" the senators' letter reads.",
    "Last week, Biden signed a spending bill that set aside $150 million to reimburse nonprofits for expenses tied to the humanitarian assistance they provide to migrants at border communities.",
    "During a press briefing on Wednesday, CDC Director Rochelle Walensky told reporters that the agency could make an announcement on whether to keep the rule in place as soon as next week.",
    "\"DHS must ensure their process at the border prioritizes the health, safety, and security of our border communities and prevents a humanitarian crisis that would harm migrants.\"",
    "Nonprofit organizations along the U.S.-Mexico border have born the brunt of the work in assisting migrants released by the federal government in border communities like Yuma.",
    "As you recall, that was just around or right after the peak of our Omicron surge, and we had hospital capacity challenges really across the country,\" Walensky said.",
    "In their letter, the two senators also asked Biden to provide Congress with a \"full briefing\" about their plans pertaining to the possible repeal of Title 42.",
    "After a massive COVID-19 vaccination campaign, the federal government has begun rolling back pandemic restrictions.",
    "\"That reassessment is due next week again, and we are currently reviewing the data and evaluating it right now.\"",
    "But they cautioned the Biden administration against repealing the policy without having preparations in place.",
    "Reach the reporter at rafael.carranza@arizonarepublic.com, or follow him on Twitter at @RafaelCarranza.",
    "The White House repeatedly has said that the CDC will make any decision about the future of Title 42.",
    "The White House, CDC and DHS did not respond to requests for comment on Sinema and Kelly's letter.",
    "Sinema and Kelly wrote in their letter that they believe Title 42 should not be kept indefinitely.",
    "Approximately 1.3 million of those expulsions took place since Biden took office in January 2021.",
    "They provide COVID-19 testing, food, clothing, and transportation, among other services.",
    "That includes reopening the U.S.-Mexico border to non-essential travel in November.",
    "They pointed to the risks that expelled migrants face on the Mexican side.",
    "\"Such groups in Arizona have not been consulted about Title 42 changes.",
    "They also asked the White House to respond to their letter by March 31.",
    "Have any news tips or story ideas about immigration in the Southwest?",
    "\"We last reassessed Title 42 at the end of January.",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "View in new tab",
    "Sens."
  ]
}