{
  "id": 1168,
  "mediaId": 2748,
  "date": "2022-02-15",
  "headline": "Biden and the Democrats are considering suspending the federal gas tax for a YEAR to save drivers 18 cents a gallon to combat surging prices in the build-up to the midterms",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EyENjTB6Twgh5yoJpWArDdcXwUryfOoQtfIII9mSsOP7Qfe6LF2a6siT2hv7LzXJGnKHW0B4NRB_eJq9_Y9QOQ7blUKUxrbR643XCU43T2-WWVSl5jUz3wJTXL5g4inZwSLvtGOHq9_3qgRYjCEFHGn7zs86S2aSjxQxP0h=w1200-h630-p-k-no-nu",
  "link": "http://www.yourdestinationnow.com/2022/02/biden-and-democrats-are-considering.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Larry Summers, a former treasury secretary who has been critical of the Biden administration's handling of inflation, told The Washington Post that a gas tax holiday is 'short-sighted, ineffective, goofy, and gimmicky.'",
    "'This bill will lower gas prices by suspending the federal gas tax through the end of the year to help Arizona families struggling with high costs for everything from gas to groceries,' he said in a statement.",
    "The Highway Trust Fund faces an annual shortfall in funding, partly because the gas tax hasn't changed since 1993 and more people are driving hybrids or electric vehicles that aren't subject to the gas tax.",
    "Two of the Democrats most vulnerable senators up in 2022 - Mark Kelly of Arizona and Maggie Hassan of New Hampshire - have proposed a bill that would suspend the federal gas tax until Jan. 1, 2023.",
    "However, the Committee for a Responsible Federal Budget estimates the tax holiday would 'would reduce gas tax revenues by roughly $20 billion and could worsen inflation once the holiday expires.'",
    "The watchdog group found that, this year, 'more than $42 billion in revenue is expected to flow into the Highway Trust Fund, over three-fifths of which will come from the federal gas tax.",
    "A federal gas tax holiday that lasts from March through December would decrease trust fund revenue by $20 billion, cutting this year's Highway Trust Fund revenue stream nearly in half.'",
    "At least four other Democratic Senators - Debbie Stabenow of Michigan, Catherine Cortez Masto and Jacky Rosen of Nevada, and Raphael Warnock of Georgia - have signed on as co-sponsors.",
    "President Joe Biden and Democratic lawmakers are weighing a federal gas tax holiday as prices reach record levels and the party faces an uphill battle in November's midterm election.",
    "Gallup's annual Mood of the Nation survey found just 33% are satisfied with the economy - a drop of 10 points over the last year and a whopping 35 points over the past two years.",
    "'Meanwhile, the concern that Russia will react to potential western sanctions by withholding crude oil from the already tight global market puts heavy upward pressure on prices.'",
    "The proposal comes as Americans are expressing their frustration with the state of the economy, the record levels of inflation and the stagnation from the coronavirus pandemic.",
    "'The President already announced an historic release of 50 million barrels from the strategic petroleum reserve, and all options are on the table looking ahead.'",
    "The Biden administration in November released 50 million barrels of oil from the Strategic Petroleum Reserve to help fight high gas prices before the holidays.",
    "The White House is open to the idea as it seeks to combat rising prices Americans face across the board for food, rent, and energy.",
    "The federal gas tax, established in 1932, funds the Highway Trust Fund, which in turn finances federal transportation spending.",
    "In his statement announcing the bill, Kelly pointed to the high prices Americans from from the gas pump to the grocery store.",
    "'Every tool is on the table to reduce prices,' White House spokeswoman Emilie Simons said in a statement to DailyMail.com.",
    "'We need to continue to think creatively about how we can find new ways to bring down costs,' she said in a statement.",
    "But prices remain up and that trend could continue with the cold weather and the Russian threat against the Ukraine.",
    "'The recent cold weather in the U.S increased the demand for heating oil,' AAA wrote in its analysis of gas prices.",
    "California, which has the highest price of any state, is approaching the $5 mark as its average price hits $4.711.",
    "And just 27% are satisfied with the nation's energy policy - a low figure that is blamed on the high gas prices.",
    "'It's terrible policy at a moment we've labeled climate change as an existential threat,' he told the newspaper.",
    "The federal gas tax is 18.4 cents per gallon for standard gasoline and 24.4 cents per gallon for diesel fuel.",
    "Republicans have made inflation and the high cost of living a major part of their 2022 messaging strategy.",
    "Oil prices have risen to well over $90 a barrel - their highest levels since 2014.",
    "Cortez Masto and Warnock are also in difficult re-election bids this fall.",
    "Democrats are fighting to keep control of the House and the Senate.",
    "Inflation hit 7.5% in January - the highest it's been in 40 years.",
    "The overall average price of gas is up $1 over the past year.",
    "Today's gas average is $3.498 a gallon, according to AAA.",
    "Hassan also pointed to high prices."
  ]
}