{
  "id": 11723,
  "mediaId": 2745,
  "date": "2022-03-21",
  "headline": "How senators voted on Ketanji Brown Jackson for the Supreme Court",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CNM7XYFJFEI6ZCUOTRXJ7R5A3Y.jpg&w=1200",
  "link": "https://www.washingtonpost.com/politics/interactive/2022/ketanji-brown-jackson-confirmation-vote/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Read more »\nSusan Collins R-Maine\n\"After reviewing Judge Ketanji Brown Jackson’s extensive record, watching much of her hearing testimony, and meeting with her twice in person, I have concluded that she possesses the experience, qualifications, and integrity to serve as an Associate Justice on the Supreme Court.",
    "Susan Collins R-Maine\n\"After reviewing Judge Ketanji Brown Jackson’s extensive record, watching much of her hearing testimony, and meeting with her twice in person, I have concluded that she possesses the experience, qualifications, and integrity to serve as an Associate Justice on the Supreme Court.",
    "Read more »\nKyrsten Sinema D-Ariz.\nMark R. Warner D-Va.\n“With his historic selection of Judge Ketanji Brown Jackson, President Biden has nominated a qualified jurist with extraordinary credentials and a brilliant legal mind who has been repeatedly confirmed by the Senate on a bipartisan basis.",
    "Justice Jackson is so well grounded in the institutions and traditions that have made our nation great, and it fills me with confidence to know that a person of her character and skill, with her background and judicial temperament will serve on the Supreme Court,\" Coons said on April 7.",
    "Ron Wyden D-Ore.\nBernie Sanders I-Vt.\nMike Crapo R-Idaho\n\"After reviewing her record and taking careful consideration of the Senate Judiciary Committee hearings, I have concluded I cannot vote to confirm her to a lifetime appointment on the United States Supreme Court.",
    "Read more »\nMaggie Hassan D-N.H.\nTim Kaine D-Va.\nAmy Klobuchar D-Minn.\n“I joined both Democrats and Republicans in supporting her three previous nominations, and I look forward to the American people getting to know Judge Jackson during her confirmation hearings.",
    "Lisa Murkowski R-Alaska\n\"After multiple in-depth conversations with Judge Jackson and deliberative review of her record and recent hearings, I will support her historic nomination to be an Associate Justice on the U.S. Supreme Court,\" Murkowski said on April 4.",
    "Mark R. Warner D-Va.\n“With his historic selection of Judge Ketanji Brown Jackson, President Biden has nominated a qualified jurist with extraordinary credentials and a brilliant legal mind who has been repeatedly confirmed by the Senate on a bipartisan basis.",
    "I applaud President Biden for nominating Judge Jackson, who is exceptionally well-qualified and look forward to a prompt confirmation process to ensure the Supreme Court further reflects the diversity of America,” Peters said in a statement on Feb. 25.",
    "Charles E. Schumer D-N.Y.\n“With her exceptional qualifications and record of evenhandedness, Judge Ketanji Brown Jackson will be a Justice who will uphold the constitution and protect the rights of all Americans, including the voiceless and vulnerable.",
    "I applaud President Biden for nominating Judge Jackson, who is exceptionally well-qualified and look forward to a prompt confirmation process to ensure the Supreme Court further reflects the diversity of America,” Peters said in a statement on Feb. 25.",
    "Charles E. Schumer D-N.Y.\nJeanne Shaheen D-N.H.\n“Our courts should look like and reflect our communities, and this historic nomination of the first Black woman selected to serve on the Supreme Court is a long-overdue milestone for our country.",
    "Judge Jackson brings to the bench a wealth of knowledge, more trial court experience than all other current Supreme Court Justices combined, a commitment to respect precedent, and a proven independent, pragmatic approach to judicial decisions.",
    "I questioned a team of investigators who reviewed her record and reputation in detail and who testified under oath that they found no information calling into question Judge Jackson's integrity, competence, or commitment to the rule of law.",
    "I questioned a team of investigators who reviewed her record and reputation in detail and who testified under oath that they found no information calling into question Judge Jackson's integrity, competence, or commitment to the rule of law.",
    "[The process of how a Supreme Court nominee becomes a justice]\nJackson, whom President Biden nominated in February to fill the upcoming Supreme Court vacancy, will replace retiring Justice Stephen G. Breyer after the Court’s current term.",
    "Following our meeting, I am confident they will see that her qualifications, character, fidelity to the Constitution, and respect for the rule of law make her deserving of support on both sides of the aisle,” Klobuchar said on March 3.",
    "Following our meeting, I am confident they will see that her qualifications, character, fidelity to the Constitution, and respect for the rule of law make her deserving of support on both sides of the aisle,” Klobuchar said on March 3.",
    "Mike Crapo R-Idaho\n\"After reviewing her record and taking careful consideration of the Senate Judiciary Committee hearings, I have concluded I cannot vote to confirm her to a lifetime appointment on the United States Supreme Court.",
    "Read more »\nMaggie Hassan D-N.H.\n\"An independent judiciary is one of the hallmarks of a strong and vibrant democracy, and I am confident in Judge Jackson’s commitment to upholding our Constitution and the freedoms of Americans.",
    "With nearly a decade of experience on the federal bench, Judge Jackson has proven that she is not only immensely qualified to serve on the Supreme Court, but that she is committed to fairness and equal justice under the law.",
    "Justice Ketanji Brown Jackson will be a strong supporter of our privacy rights, and her history as both a public defender and a federal judge makes her uniquely and extraordinarily qualified,\" Cantwell said on April 6.",
    "Justice Ketanji Brown Jackson will be a strong supporter of our privacy rights, and her history as both a public defender and a federal judge makes her uniquely and extraordinarily qualified,\" Cantwell said on April 6.",
    "Jeanne Shaheen D-N.H.\n“Our courts should look like and reflect our communities, and this historic nomination of the first Black woman selected to serve on the Supreme Court is a long-overdue milestone for our country.",
    "Amy Klobuchar D-Minn.\n“I joined both Democrats and Republicans in supporting her three previous nominations, and I look forward to the American people getting to know Judge Jackson during her confirmation hearings.",
    "I look forward to supporting her nomination on the Senate floor in the coming weeks, and I am hopeful that a bipartisan majority of my colleagues will join me in doing so,” Carper said in a statement on March 15.",
    "The rulings of our nation’s highest court have a direct and consequential impact on the lives of Michiganders, including women’s reproductive rights, workers’ rights, environmental protections and voting rights.",
    "In the days ahead of her final confirmation vote, I will continue to examine her judicial record and qualifications as a judge, before announcing how I intend to vote on her nomination,\" Rounds said on March 29.",
    "The rulings of our nation’s highest court have a direct and consequential impact on the lives of Michiganders, including women’s reproductive rights, workers’ rights, environmental protections and voting rights.",
    "In the days ahead of her final confirmation vote, I will continue to examine her judicial record and qualifications as a judge, before announcing how I intend to vote on her nomination,\" Rounds said on March 29.",
    "I will vote in the Judiciary Committee next week and then on the Senate floor to confirm Judge Jackson as an Associate Justice of the Supreme Court of the United States,\" Ossoff said in a statement on March 29.",
    "I will vote in the Judiciary Committee next week and then on the Senate floor to confirm Judge Jackson as an Associate Justice of the Supreme Court of the United States,\" Ossoff said in a statement on March 29.",
    "I appreciated the chance to meet with her, and I believe she will work diligently to uphold the Constitution, protect the rule of law, and safeguard the rights of all Americans,\" Cortez Masto said on April 7.",
    "In my view, we need a new member of the Supreme Court who has a strong track record standing up for justice – economic justice, racial justice, social justice, political justice and environmental justice.",
    "Both Judge Jackson’s record and testimony during her confirmation hearings indicate that she does not adhere to originalism as her guiding judicial philosophy,\" Young said in a statement on April 1.",
    "Both Judge Jackson’s record and testimony during her confirmation hearings indicate that she does not adhere to originalism as her guiding judicial philosophy,\" Young said in a statement on April 1.",
    "\"Supreme Court decisions impact the lives of millions of Americans and the health of our system of democracy and the rule of law; it matters who sits on this Court and takes part in these decisions.",
    "Read more »\nKyrsten Sinema D-Ariz.\n\"After meeting with Judge Jackson, reviewing her record, and listening to her testimony, I’m proud to support her nomination to be our next Supreme Court Justice.",
    "Justice Jackson’s dedication to liberty and justice for all, her impressive list of achievements, and her excellent legal expertise will be of great value to the Court,\" Kaine said on April 7.",
    "I believe Judge Jackson’s nomination is one that can unite the Senate in sending a signal to the American people that our courts should not and must not be partisan arms of our government.",
    "I believe Judge Jackson’s nomination is one that can unite the Senate in sending a signal to the American people that our courts should not and must not be partisan arms of our government.",
    "Three Republican senators joined every Democratic and Independent senator to confirm Judge Ketanji Brown Jackson as the Supreme Court’s 116th justice — and its first Black woman justice.",
    "“I am confident that Judge Jackson would serve our nation with distinction on the Supreme Court of the United States, much as she’s already done serving on other courts in this country.",
    "A true public servant and model jurist, Judge Jackson has demonstrated a commitment to America’s foundational principles of freedom, equality, and the rule of law throughout her career.",
    "Circuit, Judge Jackson has shown brilliance, thoughtfulness, a willingness to collaborate, and a dedication to applying the law impartially,” Schumer said in a statement on Feb. 25.",
    "As a clerk for Justice Stephen Breyer, an assistant federal public defender, a federal district court judge, and most recently as a judge on the U.S. Court of Appeals for the D.C.",
    "“It is long past time for the Supreme Court to seat a highly qualified Black female attorney as a member, as we strive to provide equal justice under law to all Americans.",
    "Her parents were both proud HBCU graduates who went on to devote their careers to public education; her uncles and her brother served in law enforcement and the military.",
    "Richard Blumenthal D-Conn.\n“I was so deeply impressed by Judge Jackson—not just her intellect & expertise as a judge & lawyer, but her depth & warmth as a human being.",
    "We will begin immediately to move forward on her nomination with the careful, fair, and professional approach she and America are entitled to,” Durbin said on Feb. 25.",
    "We will begin immediately to move forward on her nomination with the careful, fair, and professional approach she and America are entitled to,” Durbin said on Feb. 25.",
    "I look forward to a timely confirmation hearing in the Senate, fulfilling our constitutional responsibility in a swift manner,” Warner said in a statement on Feb. 25.",
    "I look forward to a timely confirmation hearing in the Senate, fulfilling our constitutional responsibility in a swift manner,” Warner said in a statement on Feb. 25.",
    "Jackson has earned this place in history through her impressive record, and I look forward to considering her nomination in the Senate,” Shaheen said on Feb. 25.",
    "Jackson has earned this place in history through her impressive record, and I look forward to considering her nomination in the Senate,” Shaheen said on Feb. 25.",
    "Catherine Cortez Masto D-Nev.\nRichard J. Durbin D-Ill.\n“From a strong list of prospective candidates, President Biden has chosen an extraordinary nominee in D.C.",
    "I came into our meeting with an open mind and take seriously the Senate’s responsibility to provide ‘advice and consent’ on Judge Jackson’s lifetime nomination.",
    "I came into our meeting with an open mind and take seriously the Senate’s responsibility to provide ‘advice and consent’ on Judge Jackson’s lifetime nomination.",
    "There is no reason for her not to receive a fair and expeditious hearing in the Judiciary Committee and to be confirmed by the Senate as quickly as possible.",
    "Catherine Cortez Masto D-Nev.\n\"Judge Jackson brings an outstanding record to the Supreme Court, and I’m proud to have voted for her historic confirmation.",
    "Read more »\nPatrick J. Leahy D-Vt.\n“The President has done his job, nominating a highly qualified, experienced judge for elevation to the Supreme Court.",
    "Read more »\nPatrick J. Leahy D-Vt.\n“The President has done his job, nominating a highly qualified, experienced judge for elevation to the Supreme Court.",
    "She understands the real world impact of judicial decisions on people & will bring that perspective to the Supreme Court,” Blumenthal said on March 8.",
    "\"I appreciated Judge Jackson’s time during my personal meeting with her, but she was not clear about her own judicial philosophy in our conversation.",
    "\"I appreciated Judge Jackson’s time during my personal meeting with her, but she was not clear about her own judicial philosophy in our conversation.",
    "Ron Wyden D-Ore.\nBernie Sanders I-Vt.\n“Let me congratulate President Biden for nominating Judge Ketanji Brown Jackson to serve on the Supreme Court.",
    "I firmly believe that justices on our nation’s highest Court must be able to identify the framework of how they interpret our fundamental laws.",
    "I firmly believe that justices on our nation’s highest Court must be able to identify the framework of how they interpret our fundamental laws.",
    "Gary Peters D-Mich.\n“The historic nomination of Judge Jackson to serve on the Supreme Court is a barrier-breaking moment in American history.",
    "Gary Peters D-Mich.\n“The historic nomination of Judge Jackson to serve on the Supreme Court is a barrier-breaking moment in American history.",
    "For these reasons and more, I intend to vote for Judge Jackson’s confirmation to the Supreme Court,\" Hassan said in a statement on March 28.",
    "Read more »\nCharles E. Grassley R-Iowa\n\"Throughout this process, I’ve focused on thoroughly and fairly assessing Judge Jackson’s record.",
    "Read more »\nCharles E. Grassley R-Iowa\n\"Throughout this process, I’ve focused on thoroughly and fairly assessing Judge Jackson’s record.",
    "Judge Jackson is a well-respected jurist whose qualifications and wide-ranging legal experience will undoubtedly serve our nation well.",
    "Tim Kaine D-Va.\n\"I am so glad to have helped confirm Judge Jackson to the Supreme Court and to now be able to call her Justice Jackson.",
    "Judge Jackson is a well-respected jurist whose qualifications and wide-ranging legal experience will undoubtedly serve our nation well.",
    "Richard J. Durbin D-Ill.\n“From a strong list of prospective candidates, President Biden has chosen an extraordinary nominee in D.C.",
    "I have serious reservations about her judicial philosophy and willingness to interpret the law as written,\" Crapo said on April 7.",
    "I have serious reservations about her judicial philosophy and willingness to interpret the law as written,\" Crapo said on April 7.",
    "\"After carefully reviewing Judge Ketanji Brown Jackson’s judicial record and statements, I will not be supporting her nomination.",
    "\"After carefully reviewing Judge Ketanji Brown Jackson’s judicial record and statements, I will not be supporting her nomination.",
    "The role of a Supreme Court justice is to apply the law as written and uphold the Constitution, not legislate from the bench.",
    "The role of a Supreme Court justice is to apply the law as written and uphold the Constitution, not legislate from the bench.",
    "I look forward to her full and fair confirmation process in the United States Senate,” Cardin said in a statement on Feb. 25.",
    "In doing so, they must adhere strictly to the text of the Constitution as written without limiting the rights it guarantees.",
    "In doing so, they must adhere strictly to the text of the Constitution as written without limiting the rights it guarantees.",
    "Judge Jackson has exceptional qualifications and will serve our country well in the years to come,\" Sinema said on April 7.",
    "The Senate must now do its job — free of politics and political vitriol — to fairly and objectively evaluate this nominee.",
    "[Jackson takes different path to the Supreme Court from justices]\nBelow is how each senator voted on Jackson’s nomination.",
    "The Senate must now do its job — free of politics and political vitriol — to fairly and objectively evaluate this nominee.",
    "Read more »\nJon Ossoff D-Ga.\n\"Judge Jackson’s qualifications as a District Judge and an Appellate Judge are impeccable.",
    "She instead described certain steps when examining a case, including looking at the ‘public meaning’ of the law’s text.",
    "She instead described certain steps when examining a case, including looking at the ‘public meaning’ of the law’s text.",
    "Judge Jackson has already been confirmed by the Senate three times on a bi-partisan basis – twice by unanimous consent.",
    "Read more »\nJon Ossoff D-Ga.\n\"Judge Jackson’s qualifications as a District Judge and an Appellate Judge are impeccable.",
    "To the contrary, they found that among colleagues on the bench and the bar, Judge Jackson has a sterling reputation.",
    "To the contrary, they found that among colleagues on the bench and the bar, Judge Jackson has a sterling reputation.",
    "We have a true opportunity, after careful review, to provide our advice and consent on this historic nominee.",
    "We have a true opportunity, after careful review, to provide our advice and consent on this historic nominee.",
    "The confirmation process took only 41 days, the second-shortest confirmation process for any sitting justice.",
    "Judge Jackson’s achievements are well known to the Senate Judiciary Committee as we approved her to the D.C.",
    "Judge Jackson’s achievements are well known to the Senate Judiciary Committee as we approved her to the D.C.",
    "When Jackson was confirmed to a federal appeals court last year, she got three Republican votes from Sens.",
    "We will have a new Justice on the highest court of the land that makes the bench look more like America.",
    "Translating this ‘public meaning’ is exactly why it is important to have a specific judicial philosophy.",
    "Translating this ‘public meaning’ is exactly why it is important to have a specific judicial philosophy.",
    "We will have a new Justice on the highest court of the land that makes the bench look more like America.",
    "I will, therefore, vote to confirm her to this position,\" Collins said in a statement on March 30.",
    "I will, therefore, vote to confirm her to this position,\" Collins said in a statement on March 30.",
    "Judge Jackson’s re-interpretation of laws I’ve helped write does not give me that confidence.",
    "Judge Jackson’s re-interpretation of laws I’ve helped write does not give me that confidence.",
    "Read more »\nMaria Cantwell D-Wash.\n\"History is being made in the United States of America.",
    "To be the first to make history in our nation you need to have an exceptional life story.",
    "To be the first to make history in our nation you need to have an exceptional life story.",
    "Angus King (Maine) and Bernie Sanders (Vt.) are independents who caucus with Democrats.",
    "Unfortunately, that means I can’t support her nomination,\" Grassley said on April 4.",
    "Unfortunately, that means I can’t support her nomination,\" Grassley said on April 4.",
    "Given these considerations, I will oppose her nomination,\" Fischer said on April 4.",
    "Given these considerations, I will oppose her nomination,\" Fischer said on April 4.",
    "Maria Cantwell D-Wash.\n\"History is being made in the United States of America.",
    "I look forward to this historic confirmation process,” Leahy said on Feb. 25.",
    "I look forward to this historic confirmation process,” Leahy said on Feb. 25.",
    "The full Senate voted on her nomination on April 7, before the Easter recess.",
    "Lindsey O. Graham (S.C.), Susan Collins (Maine) and Lisa Murkowski (Alaska).",
    "We need confidence that judges will interpret the laws as they are written.",
    "We need confidence that judges will interpret the laws as they are written.",
    "I strongly support her nomination,” Sanders said in a statement on Feb. 25.",
    "Justice Jackson stands on the shoulders of those who went before her.",
    "\"I appreciated the opportunity to visit with Judge Jackson today.",
    "\"I appreciated the opportunity to visit with Judge Jackson today.",
    "All women and women of color should be so proud of this moment.",
    "All women and women of color should be so proud of this moment.",
    "Read more »\nRichard C. Shelby R-Ala.\nTodd C. Young R-Ind.",
    "Read more »\nRichard C. Shelby R-Ala.\nTodd C. Young R-Ind.",
    "Circuit less than a year ago with bipartisan support.",
    "Circuit less than a year ago with bipartisan support.",
    "There is no doubt that Judge Jackson is that person.",
    "Bill Hagerty R-Tenn.\nMike Rounds R-S.D.",
    "Bill Hagerty R-Tenn.\nMike Rounds R-S.D.",
    "Read more »\nChristopher A. Coons D-Del.",
    "Circuit Judge Ketanji Brown Jackson.",
    "Circuit Judge Ketanji Brown Jackson.",
    "Read more »\nThomas R. Carper D-Del.",
    "Christopher A. Coons D-Del.",
    "Benjamin L. Cardin D-Md.",
    "I think I’ve done that.",
    "I think I’ve done that.",
    "Deb Fischer R-Neb.",
    "Deb Fischer R-Neb.",
    "Read more »\nSens."
  ]
}