{
  "id": 11760,
  "mediaId": 8345,
  "date": "2022-03-22",
  "headline": "Rants and Raves | March 23, 2022",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2020/09/21/KDM-Rants-And-Raves_thumbnail.jpg",
  "link": "https://kdminer.com/news/2022/mar/22/rants-and-raves-march-23-2022/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "St. Patrick’s Day is celebrated in bars and restaurants and it’s not a reflection on the Irish; just a matter of keeping inebriated drivers off the road.",
    "– Most regular fast-food eaters also buy already-prepared store foods you nuke at home; most filled with additives, preservatives, sugar and other crap.",
    "Kingman police to provide extra patrols St. Patrick’s Day weekend rant – Extra police patrols aren’t about you and your sober Irish family.",
    "Saturday evening a family was walking across Beale Street and four of those scooters ran right through the middle of them.",
    "Poll: “Would you be willing to pay a property tax to fund street repairs and maintenance in the City of Kingman?” – No.",
    "Unlike your predecessors who ignored our pleas for the past 35 years, you listened to us and responded to our needs.",
    "Thanks Sen. Mark Kelly for earmarking the funds for a much-needed flood control project on Bank Street.",
    "One of the uglier aspects of some neighborhoods is the forest of poles and wires strung everywhere.",
    "UniSource invests $8M – How many residences could $8 million go for undergrounding their services?",
    "Barillaro brings a world of experience to county libraries – Our library is a fabulous resource.",
    "Our library helps people access private, government resources and info local to international.",
    "Five-year-old dies in ATV crash – No 5-year-old child should be operating a motor vehicle.",
    "Submit Rants and Raves at kdminer.com/rants-and-raves or email editorial@kdminer.com.",
    "I hope the arrogant morons that think it’s all a lefty fake news story are right.",
    "If your rant/rave is about a specific story please mention the headline.",
    "– I don’t eat fast food often, but when I do the meal lasts me all day.",
    "When traveling I can access audio and e books anywhere in the world.",
    "Hey, City of Kingman, you need to do something with these scooters!",
    "When I stay home and eat healthy I’m hungry again within six hours.",
    "These people, overall, don’t take good care of themselves, period.",
    "Building permits – Where is the water going to come from?",
    "Everyone benefits from better roads, not just homeowners.",
    "We receive many more rants and raves than we can print.",
    "Let us know what’s on your mind in 40 words or less.",
    "Rants and raves must be original; not plagiarized.",
    "Diet Tip: Fast food can’t be that bad, can it?",
    "Diet Tip: Fast food can’t be that bad, can it?",
    "Tragic event that could have been prevented.",
    "I found that I lose weight when I eat out.",
    "Some look as if they are ready to fall.",
    "Local rants and raves are preferred.",
    "The people inside make it happen.",
    "That’s the real problem.",
    "Birdland needs this.",
    "Maybe a sales tax.",
    "I’m satisfied.",
    "God bless.",
    "Thank you."
  ]
}