{
  "id": 11838,
  "mediaId": 2830,
  "date": "2022-03-23",
  "headline": "Hit Putin’s Generals With Sanctions, Too",
  "image": "",
  "link": "https://www.wsj.com/articles/hit-putins-generals-with-sanctions-too-war-crimes-strategy-mortars-missiles-bombing-11648066123",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Kimmitt",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Plus, the Securities and Exchange Commission proposes to make companies disclose climate risks.Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nThe Biden administration has used sanctions skillfully as its primary means to punish Mr. Putin and his close associates.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nThe Sounds of Ukraine's Refugee Crisis\nJillian Melchior joins the podcast from Lviv, Ukraine, to share what she is seeing on the ground and some of the stories of refugees fleeing the crossfire.",
    "WSJ Opinion: Joe Biden, Ukraine, and the Need to Lead in EuropePlay video: WSJ Opinion: Joe Biden, Ukraine, and the Need to Lead in Europe\n Wonder Land: Vladimir Putin is a modern-day Adolf Hitler and he is attempting to exterminate the Ukrainian people.",
    "I had the privilege of commanding soldiers at every level of the U.S. Army field artillery, from a battery of six howitzers to an artillery corps with hundreds of cannons as well as rocket and missile launchers.",
    "While the generals might argue that how these attacks are conducted is decided by junior commanders, they can’t escape the responsibility for tactical control of the attacks—the what, which and who to target.",
    "Photo: Chris McGrath/Getty Images\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (4 minutes)\nAD\nLoading advertisement...\n00:00 / 04:10\n1x\nThis article is in your queue.",
    "It may be Vladimir Putin’s war and strategy, but the ground operations are being coordinated by Russian generals on the frontlines, and they are every bit as culpable as their commander in the Kremlin.",
    "Most likely, the targeting is done to inflict terror among the population, create massive refugee displacements, and draw frontline Ukrainian solders off the battlefield to assist civilians.",
    "With today’s computers, advanced weapons and precision munitions, it is rare for any artillery unit to miss its target by a significant degree and even rarer for an error to be repeated.",
    "While the generals may delegate authority for technical details, they are responsible for the tactical prosecution of the war, imposing restrictions such as no-fire zones.",
    "They are also responsible for establishing collateral-damage guidelines to ensure that prohibited targets aren’t incidentally struck when an authorized target is engaged.",
    "The bulk of the damage to Ukraine’s towns and cities is being done by munitions that fall from the sky: artillery, rockets and missiles fired far from the front lines.",
    "It takes a willing suspension of disbelief to suggest that generals conducting operations today in Ukraine are unaware of the destruction their weapons are causing.",
    "Every soldier who has ever pulled a lanyard or launched a missile is watching Russia’s total disregard for technical and tactical control in Ukraine with disgust.",
    "Some may argue that the generals are too far removed or too high in the chain of command to bear responsibility for events on the ground.",
    "U.S. artillery commanders have lawyers who carefully review battle plans to ensure they meet long-established rules of land warfare.",
    "Thus any suggestion that the devastation in Ukraine is the result of poor training, outdated equipment or soldier fatigue is absurd.",
    "Mr. Kimmitt, a retired U.S. Army brigadier general, served as assistant secretary of state for political-military affairs, 2008-09.",
    "WSJ Opinion: Joe Biden, Ukraine, and the Need to Lead in Europe\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "It’s their job to identify and declare off-limits civilian sites such as houses of worship, medical facilities and schools.",
    "It takes similar intentional ignorance to believe that the targeting of civilians, hospitals and schools is an accident.",
    "Images: Reuters/AFP/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Sending shells and rockets dozens of miles in the air to hit a target is a straightforward exercise in mathematics.",
    "Mr. Putin is primarily to blame, but so are the generals he counts on to plan, order and carry out the operations.",
    "It is craven and cruel, and it is being orchestrated by the generals conducting the military campaign in Ukraine.",
    "They also bear responsibility for the enormous loss in lives and destruction of infrastructure in Ukraine.",
    "While they have yet to change Mr. Putin’s behavior, the consequences of those sanctions are felt widely.",
    "All Russia’s oligarchs can do is watch as countries seize their yachts, real estate and bank accounts.",
    "People look at damage to a school that was hit by a Russian attack in Zhytomyr, Ukraine, March 20.",
    "Few generals may enjoy great wealth, but travel bans against them and their families sting.",
    "0:00 / 4:35\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "But as Europe tries to reform itself, the American President fails to step up.",
    "Open Queue\nThe scenes of carnage and cruelty in Ukraine are incomprehensible.",
    "The inescapable conclusion is that these attacks on civilians are deliberate.",
    "Those sanctions have disrupted major parts of the Russian economy.",
    "Those generals will be prosecuted as war criminals in the future.",
    "Ukraine isn’t an open desert, and the maps aren’t a blank slate.",
    "These weapons are well-camouflaged and operate beyond impunity.",
    "The time to subject them to sanctions is now.",
    "Your browser does not support HTML5 video.",
    "They should be subjected to sanctions now.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "The time will come to punish them.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Nonsense."
  ]
}