{
  "id": 12027,
  "mediaId": 2522,
  "date": "2022-03-25",
  "headline": "National Republican Senate Comm. targets Democrat ‘energy hypocrisy’ in devastating new swing state ad buy",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2021/10/SG-California-gas-pumps.jpg",
  "link": "https://www.bizpacreview.com/2022/03/25/national-republican-senate-comm-targets-democrat-energy-hypocrisy-in-devastating-new-swing-state-ad-buy-1217144/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "BPR Wire",
  "authorUrl": "https://www.bizpacreview.com/author/bpr-wire/",
  "termIds": [
    0
  ],
  "sentences": [
    "The NRSC, the committee formed to elect Republicans to the Senate, noted that the three Democrats each voted against canceling President Joe Biden’s moratorium on oil and gas leasing, against a measure prohibiting the federal government from banning fracking and against forcing the Biden administration to approve the Keystone XL pipeline.",
    "“Arizonans are paying some of the highest prices for gas we have seen in years and it’s putting a strain on families who need to fill up the tank to get to work and school,“ Kelly said in a statement after the bill was introduced on Feb. 9.",
    "It’s time to cancel Joe Biden and Raphael Warnock.”\nMeanwhile, the three Democrats and Nevada Sen. Catherine Cortez Masto, another vulnerable Democrat, introduced a bill in February that would temporarily suspend the federal gasoline tax.",
    "“This bill will lower gas prices by suspending the federal gas tax through the end of the year to help Arizona families struggling with high costs for everything from gas to groceries.”\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "Raphael Warnock of Georgia, Maggie Hassan of New Hampshire and Mark Kelly of Arizona, who are all facing tough reelection bids, the NRSC told the Daily Caller News Foundation which exclusively reviewed the videos.",
    "Thomas Catenacci, DCNF\nThe National Republican Senate Committee (NRSC) unveiled an ad campaign Thursday, targeting three vulnerable Democrats in swing states over their “energy hypocrisy” on policy votes.",
    "WATCH:\nDuring the most recent vote on Aug. 10, Warnock, Hassan and Kelly voted against a provision that would reverse the Biden administration’s ban on federal oil and gas leasing.",
    "“Democrats working to lower gas prices is like an arsonist showing up to put out a fire.”\n“Senate Democrats aren’t going to fix the problem – they are the problem,” he continued.",
    "Gasoline prices have surged 52.9%, 50.1% and 45.9% over the past year in Georgia, Arizona and New Hampshire respectively as of Thursday, according to AAA data .",
    "Warnock, Kelly and Hassan are locked in three of the four tightest elections involving an incumbent Democrat, according to The Cook Political Report.",
    "“He voted to cancel oil and gas production, voted to cancel fracking that supports American jobs, voted to cancel the Keystone pipeline.",
    "The latest polls from their three states hinted at very close races between the senators and their GOP challengers.",
    "Their anti-American energy agenda has sent gas prices soaring,” NRSC spokesperson Jonathan Turcotte told the DCNF.",
    "The votes cited by the NRSC ads were all recorded between February-August 2021, Senate records showed.",
    "The ads will be sent to local media in the three states and be posted on GOP social media accounts.",
    "The legislation, which has stalled in committee, would lower pump prices as energy costs skyrocket.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "“Joe Biden and Raphael Warnock are the problem,” the NRSC’s Georgia ad seen by the DCNF says.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "“Senate Democrats have spent the past year waging war on American energy production.",
    "The provision narrowly failed by a margin of 49-50.",
    "The public will not see it and we do not share it.",
    "The NRSC ads attack Democratic Sens."
  ]
}