{
  "id": 12044,
  "mediaId": 8292,
  "date": "2022-03-25",
  "headline": "Rodger A. Bierman",
  "image": "https://redfieldpress.com/article/apple-touch-icon.png",
  "link": "https://redfieldpress.com/article/rodger-a-bierman",
  "mediaOutlet": "Copper Country News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He inspired us with his independence and strong will and kept us all smiling with his sense of humor.”\nGrateful for having shared Rodger’s life are wife Elvera Bierman; daughters Marvie (Allen) Spear and Teri (Virgil) Determan; son Bret (Sandy) Bierman; grandchildren Holly (Joe), Heidi (Jeff), Chad, Eric (Nikki), Scott (Susan), Mark, Kelly (Bre), Jarod (Sarah), Brad (Tara), and David (Laura); twenty great-grandchildren; one great-great-grandson; brother Lyle and his sister-in-law Alice Bierman, along with many nieces and nephews.",
    "He is also survived by Elvera’s family: Michelle (Richard) Wilson, Kelly (Denise) Penfield, and Julie (Bruce) Berg; her grandchildren Brandy (Erych), Sadie, Jessie, Tiffany (Lonnie), Hailey, Casey, and Krysta (Wilmer); and eleven great-grandchildren.",
    "Funeral services for Rodger A. Bierman, 88, of Aberdeen, SD, will be 10:30am, Monday, March 28, 2022, at Trinity Lutheran Church, Mansfield, SD, with Pastor Bret Bierman officiating.",
    "Preceding Rodger in death are parents Martin (Otto) and Elsie Bierman; his first wife Beverly; brother Gordon, sisters Marianne and Janene, and great-great-granddaughter Margot.",
    "Visitation will be 3:00-7:00pm, Sunday, with family present from 5:00-7:00pm, followed by a prayer service at 7:00pm at Spitzer-Miller Funeral Home, 1111 South Main Street.",
    "He was a baptized member of Trinity Lutheran Church and held many of the church offices and served as a Sunday School teacher and superintendent for many years.",
    "Rodger enjoyed carpentry and built many of the buildings on the farm, including the house he would call home for forty-eight years.",
    "In lieu of flowers, the family prefers memorials to Dakota Boys Ranch, Lutheran Hour Ministries and Trinity Radio Broadcast.",
    "He enjoyed playing baseball, bowling, and especially spending time with his neighbors and extended family.",
    "Rodger Allen Bierman was born on December 31, 1933, in Aberdeen, SD to Otto and Elsie (Borchard) Bierman.",
    "From an early age he and his brothers helped their dad on the farm, instilling his love for farming.",
    "He grew up on the family farm southwest of Mansfield along with his two brothers and two sisters.",
    "They moved to a farm southwest of Northville where they raised their three children.",
    "Rodger died Saturday, March 19, 2022, at Avera St. Luke’s Hospital in Aberdeen, SD.",
    "On November 2, 1996, he again found joy when he married Elvera (Kuhfeld) Penfield.",
    "In all, Rodger lived sixty-seven years on the farm he molded into his joy.",
    "On May 23, 1950, he married his high school sweetheart, Beverly Penfield.",
    "Through all the years, good or bad, it was his faith that kept him going.",
    "They remained on the farm until 2017, when they moved to Aberdeen.",
    "He was active on the Northville Township board for many years.",
    "Rodger had a deep love of family and a strong faith.",
    "He touched the lives of so many and will be missed.",
    "Rodger loved the land, his family, and his church.",
    "Burial at Trinity Lutheran Cemetery.",
    "“Dad guided us with a gentle hand.",
    "Bev passed away in November 1994.",
    "www.spitzerfuneralhome.com"
  ]
}