{
  "id": 12077,
  "mediaId": 2526,
  "date": "2022-03-25",
  "headline": "Democrats Kyrsten Sinema, Mark Kelly Urge Biden to Enforce Border Controls",
  "image": "https://media.breitbart.com/media/2022/03/KellySinema-640x335.png",
  "link": "https://www.breitbart.com/politics/2022/03/25/democrats-kyrsten-sinema-mark-kelly-urge-joe-biden-to-enforce-border-controls/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border,” Sinema and Kelly wrote:\nTo date, we have not yet seen evidence that DHS has developed and implemented a sufficient plan to maintain a humane and orderly process in the event of an end to Title 42.",
    "“Until the Administration does that type of consultation with local government leaders and nonprofits along the border, it is premature to consider changes to Title 42 authorities,” they wrote:\nAs Arizona’s senators, we urge you to continue providing additional border management and security resources to Arizona so that our border communities do not have to bear any unnecessary burdens from Title 42 changes.",
    "We are aware of the updated Irregular Mass Migration Contingency Plan that DHS has developed, but – with potential changes to Title 42 coming as early as next week – that strategy contains unanswered questions and does not seem likely to allow DHS to secure the border, protect our communities, and ensure migrants are treated fairly and humanely.",
    "In a letter to Biden, Sinema and Kelly urged the Department of Homeland Security (DHS) not to purge the Center for Disease Control and Prevention (CDC) order known as Title 42 — first implemented by former President Trump — which gives federal immigration officials broad authority to quickly return border crossers to their native country.",
    "“One of the things I’ve been working on with my colleagues in both parties is to discuss the fact that the current flow is unsustainable.”\n“[Washington] D.C. has shown little regard for the actual crisis that’s occurring in Arizona, and we know that,” Sinema continued.",
    "“We’ve paid the price for the federal government’s failure to fix our broken immigration system for most of my lifetime.”\nWhile Sinema is not facing re-election until 2024, Kelly is up against a Republican challenge in this year’s November midterm elections.",
    "[Emphasis added]\nIn recent weeks, Sinema has seemingly grown frustrated with Biden’s lax immigration enforcement record where, in 2021, more than two million border crossers and illegal aliens arrived at the southern border.",
    "[Emphasis added]\n…\nDHS must ensure their process at the border prioritizes the health, safety, and security of our border communities and prevents a humanitarian crisis that would harm migrants.",
    "Kyrsten Sinema (D-AZ) and Mark Kelly (D-AZ) are pleading with President Joe Biden to preserve border controls that have stemmed illegal immigration at the United States-Mexico border.",
    "Sinema and Kelly also noted that local governments in Arizona’s border communities have yet to be consulted by DHS or Biden officials about an end to the policy.",
    "Likewise, Axios reports that Biden’s top-level officials are bracing for “a massive influx of more than 170,000” illegal aliens if Title 42 is ended.",
    "Currently, the officials estimate that about 25,000 foreign nationals are waiting on the Mexican side to rush the border when Biden ends Title 42.",
    "[Emphasis added]\nThis week, Breitbart News exclusively reported that Biden’s DHS is considering ending Title 42 on April 1, 2022.",
    "Corporate special interests and both political establishments have lobbied the Biden administration for months to end Title 42.",
    "Such a move, Rep. Tony Gonzalez (R-TX) says, would double monthly illegal immigration levels at the southern border.",
    "In a recent OH Predictive poll, Kelly is behind two points against a generic GOP candidate in the Senate race.",
    "“There’s not been any active steps to stem the flow of migrants from the border,” Sinema said weeks ago.",
    "This year, experts predict more than 2.1 million will arrive.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here.",
    "Sens."
  ]
}