{
  "id": 12115,
  "mediaId": 2649,
  "date": "2022-03-27",
  "headline": "Senators’ bill aims to ban corporate PACs following record-breaking business PAC giving in 2020",
  "image": "https://cdn1.opensecrets.org/news/wp-content/uploads/2022/03/28134615/Screen-Shot-2022-03-28-at-1.09.49-PM.png",
  "link": "https://www.opensecrets.org/news/2022/03/ban-corporate-pacs-act",
  "mediaOutlet": "opensecrets.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Huggins",
  "authorUrl": "https://www.opensecrets.org/news/author/khugginscrp-org/",
  "termIds": [
    0
  ],
  "sentences": [
    "Asked about corporate contributions to super PACs, Ossoff said “we may need to look at legislation that addresses that as well.”\n“[The Ban Corporate PACs Act] focuses on the formation and operation of corporate PACs, but there’s a need for broader campaign finance reform,” he added.",
    "While OpenSecrets’ use of “business PAC” refers to PACs associated with corporations, as well as trade associations and other groups promoting a specific business interest, the Ban Corporate PACs Act would apply only to PACs established and managed by for-profit corporations.",
    "In funding his 2022 reelection bid, Schumer also attracted PAC contributions from companies in the pharmaceutical industry and travel industry in recent years, including $10,000 from American Airlines, Delta Airlines, Jetblue, United Airlines and Marriott.",
    "The Ban Corporate PACs Act follows Ossoff and Kelly introducing a bill that would require members of Congress and their families place their stock portfolios into a blind trust while in Congress, which both Ossoff and Kelly say they have done themselves.",
    "In the 2020 cycle, business interests contributed a record $5.9 billion to candidates, up from $2.8 billion during the 2018 cycle and $3.5 billion in 2016. Business interests have so far contributed $1.5 billion across candidates in the 2022 cycle.",
    "“There is so much corporate money in electoral politics in the United States and elected officials should be accountable to individuals, to the public, not to corporate donors,” Ossoff told OpenSecrets during an interview in early March.",
    "In the 2020 cycle, American Crystal Sugar Company and Comcast were the second and third largest corporate PAC contributors at $2.7 million each, followed by aerospace and defense conglomerate Raytheon Technologies with $2.4 million.",
    "Of the congressional candidates up for reelection in 2022, Senate Majority Leader Chuck Schumer (D-N.Y.) has raked in the most in PAC money — $3.3 million in 2021 — though this figure includes all PACs, not just business interests.",
    "Some of the corporate PACs that contributed to Scott’s total include Aflac, Amgen, Blackrock Funds Services, Exelon Corp, General Motors, Home Depot, Transunion and Visa — all of which contributed $10,000 to Scott’s 2022 bid.",
    "Mark Kelly of Arizona and Jon Ossoff of Georgia introduced legislation in January that would ban for-profit corporations from operating political action committees in an effort to reduce corporate influence in Congress.",
    "“I think that the corporate money in the U.S. electoral system has negatively impacted policymaking by shifting the focus of the legislative branch to corporate donors from the public interest,” Ossoff said.",
    "The PAC made some contributions on the Democratic side as well in the 2020 cycle, giving $30,000 to both the Democratic Senatorial Campaign Committee and the Democratic Congressional Campaign Committee.",
    "So far in the 2022 cycle, the top for-profit corporate-managed PAC is Blue Cross/Blue Shield with $980,000 in contributions, followed by AT&T with $851,000 and American Crystal Sugar with $825,000.",
    "The PAC also contributed $120,000 to the National Republican Senatorial Committee, and $45,000 each to NRSC Victory, National Republican Congressional Committee and Republican National Committee.",
    "In the 2020 cycle, about 43% of all business PAC contributions – including corporate PACs and PACs affiliated with industry trade associations – went to Democrats and 57% went to Republicans.",
    "Read more OpenSecrets News & Analysis: Campaign finance · PACs\nSupport Accountability Journalism\nAt OpenSecrets.org we offer in-depth, money-in-politics stories in the public interest.",
    "Neither he nor Kelly accept contributions from corporate PACs, though Axios notes both have accepted contributions from third-party PACs, some of which accept corporate contributions.",
    "“I ran on a promise to pursue reform and I always knew that would ruffle some feathers, and if it ruffles feathers in my own party, I have no problem with that,” he told Opensecrets.",
    "Although business PAC contributions are generally accepted by members of both parties, Ossoff said he is not concerned about opposition he may face within the Democratic party.",
    "The proposal follows record-breaking contributions from business PACs in the 2020 election cycle despite pledges from many Democratic candidates disavowing corporate PAC money.",
    "In the 2020 cycle, the largest for-profit PAC run by a corporation was AT&T, which gave $2.7 million to candidates — 54% went to Republicans and 46% went to Democrats.",
    "Whether you’re reading about 2020 presidential fundraising, conflicts of interest or “dark money” influence, we produce this content with a small, but dedicated team.",
    "Some of the top business interest PACs that contributed the total maximum of $10,000 in 2021 to Schumer include Blackrock Funds Services, Comcast, Visa and Xerox.",
    "Every donation we receive from users like you goes directly into promoting high-quality data analysis and investigative journalism that you can trust.",
    "Under Ossoff and Kelly’s legislation, any existing corporate PACs would have to fully disburse their funds within one year of the bill taking effect.",
    "In the 2018 cycle, 38% went to Democrats and 62% went to Republicans, close to the 34% Democrat and 66% Republican mark in the 2016 cycle.",
    "First State accepted contributions from PACs affiliated with Capital One Financial Corp., Google, Fox Corporation, Pfizer, UPS and Visa.",
    "Among all business PACs, Democratic and Republican candidates have benefitted fairly equally, as both received a total of $56 million.",
    "On the Republican side, Sen. Tim Scott (R-S.C.) received the most total PAC money in 2021 — $3 million — second only to Schumer.",
    "Ossoff and Kelly each received contributions — $10,000 and $20,000 respectively — from Sen. Tom Carper’s (D-Del.)",
    "So far this cycle, AT&T’s larger PAC contributions include $30,000 to the NRSC, NRCC, DSCC and DCCC each.",
    "His pharmaceutical PAC contributors include Eli Lilly, Merck and Teva Pharmaceuticals.",
    "AT&T’s PAC contributed $140,000 in the 2020 cycle to the McCarthy Victory Fund.",
    "leadership PAC First State since launching their campaigns.",
    "Democratic Sens."
  ]
}