{
  "id": 12239,
  "mediaId": 2650,
  "date": "2022-03-25",
  "headline": "The Morning Briefing: Fauci's Folly Has a Disturbing Non-COVID Body Count",
  "image": "https://media.townhall.com/townhall/reu/o/2020/212/c13211c1-0a28-42f5-b0bf-b541b8d805b6-1110x740.jpg",
  "link": "https://pjmedia.com/columns/stephen-kruiser/2022/03/25/the-morning-briefing-faucis-folly-has-a-disturbing-non-covid-body-count-n1584152",
  "mediaOutlet": "Pajamas Media ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Kruiser",
  "authorUrl": "https://pjmedia.com/columnist/stephen-kruiser",
  "termIds": [
    0
  ],
  "sentences": [
    "USA Today: Science says there’s no simple answer to the definition of ‘woman’\nProg ‘pastor’ John Pavlovitz’s attempt to continue lecturing and shaming Republican women for their beliefs goes REALLY wrong\nGlenn Greenwald gives an update on number of media outlets that have retracted ‘Russian disinformation’ falsehoods\nVIP\nThe Obama Effect and Ketanji Brown Jackson\nJoe Biden: Still Wrong on Foreign Policy\nGOLD THURSDAY AT 4:00PM EASTERN: ‘Five O’Clock Somewhere’ with Kruiser, VodkaPundit, Special Guest Kira Davis – Replay Available\nAround the Interwebz\nReduct This\nMeal Prep?",
    "This Woman Ordered a Pizza Before She Was Even Hungry: https://t.co/vfa2GyPLJ2 pic.twitter.com/GgHe1Wi5oj\n— Reductress (@Reductress) March 24, 2022\nThe Kruiser Kabana\nKabana Gallery\nMay 1968, 1973 #miro #abstractexpressionism pic.twitter.com/2rfo3nn5iS\n— THE MONTMARTE (@themontmarte) March 24, 2022\nKabana Comedy\nPJ Media senior columnist and associate editor Stephen Kruiser is a professional stand-up comic, writer, and recovering political activist who edits and writes PJ's Morning Briefing, aka The Greatest Political Newsletter in America.",
    "There’s a lot of hardcore professional reporting that we can do on the other side of the paywall because it’s away from the prying eyes of the censors,\nYou know me though, I like to have fun as well, and we make sure there’s a lot of it for our VIPs.",
    "The reason I singled out Fauci in the headline today is because the leftists elevated him to god-like status and it’s been obvious from Day One that he’s an attention whore who relishes being the face of the government’s faux battle against COVID.",
    "For a couple more bucks a month, you can be a VIP Gold subscriber and have access to all of the VIP content on every Townhall site (PJ Media, Townhall, RedState, HotAir, Bearing Arms, and Twitchy).",
    "EXPOSED: Tennessee Schools Flagrantly Breaking Anti-CRT Law\nLeftist Chickens Come Home to Roost for Amazon\nBeware of Those Indiscriminately Cheering for Volodymyr Zelenskyy\nVodkaPundit, Part Deux.",
    "For example, yesterday I made a practically perfect martini to enjoy during the weekly “Five O’Clock Somewhere” live chat that my friend Stephen Green and I do with our VIP Gold friends.",
    "Those of us on this side of the political aisle have spent a lot of time over the last couple of years questioning the efficacy of the various government responses to the pandemic.",
    "My column yesterday featured some new data about the rise in non-covid-related deaths during the pandemic, like those from heart disease, stroke, and alcohol-related problems.",
    "Poll: Support for Second Amendment soars after invasion of Ukraine\nBackfire: Florida parental rights sex-ed policy supported by 52% — of Dem primary voters\nDonald Trump Jr.",
    "In the rush to mitigate the spread of the COVID virus, public health policy could have best been described as a lot of throwing the baby out with the bathwater.",
    "As 2020 wore on I found it nigh on impossible to believe that Dr./Career Bureaucrat Anthony Fauci and Company had the slightest interest in my health.",
    "His latest book, Straight Outta Feelings, is a humorous exploration of how the 2016 election made him enjoy politics more than he ever had before.",
    "This was understandable and forgivable in the early stages of the pandemic when officials didn’t have any idea about what they were dealing with.",
    ": catchingupwiththeclarks_ on Instagram pic.twitter.com/ZFF7o5W74m\n— Some Good News (@somegoodnews) March 18, 2022\nPJ Media\nMy latest column.",
    "Here are some of my thoughts on that:\nOne would presume that public health policy would protect or foster some sort of, you know, health.",
    "Just when it looks like we might be emerging from that hell, we’re finding out that there are non-COVID tragedies yet to be discovered.",
    "As I mentioned earlier in the week, the last several days have been full of examples of mainstream media malpractice, past and present.",
    "A really good party (ask any of our VIP friends who hung out with us at CPAC), not some lame thing that you’ll want to leave early.",
    "Click here to subscribe and use the promo code WUHAN to receive a 25% discount (which makes this a bargain extraordinaire).",
    "We’re heading into the weekend with one of those rare Briefings that leads with me pimping one of my own columns.",
    "When not being a reclusive writer, Kruiser has had the honor of entertaining U.S. troops all over the world.",
    "It turns out that scaring people into staying away from hospitals so that people wouldn’t die was deadly.",
    "However, I am also a realist, which, by the way, is often how one becomes a cynic in the first place.",
    "Quarantine Slaughterhouse: Numbers Are Coming in on Non-COVID Deaths During Lockdowns\nVodkaPundit.",
    "Explains Evolution of Democrats on ‘Believe All Women’ in One Brutal Tweet\nYeah, go with that.",
    "As the pandemic wore on, however, it became more about exercising power than saving lives.",
    "Alas, since the government is involved, words don’t always mean what they’re supposed to.",
    "While it was certainly chaos in the early part of 2020, by summertime we had questions.",
    "Through it all, we here at PJ Media have been reporting the truth on all of the above.",
    "Sadly, our fortunes are still tied somewhat to both, and revenues did take a hit.",
    "I remember constantly wondering why Trump was keeping Fauci around, for example.",
    "The Democratic advocates in the MSM have lied about so much: Russia collusion.",
    "It is a terrible story that, in all probability, needn’t have been as tragic.",
    "We’re probably going to get together in Chicago this summer just to hang out.",
    "This is why I keep trying to bring new people into our VIP subscriber fold.",
    "Top O’ the Briefing\nHappy Friday, dear Kruiser Morning Briefing friends.",
    "There have been so many COVID-related tragedies in the last two years.",
    "WATCH: Frustrated Californian Body Slams Shoplifter\nLet’s go Brandon!",
    "We’ve been repeatedly censored for it by the MSM and social media.",
    "For a few dollars a month, you can support what we’re doing here.",
    "Hey, you can’t love anyone else until you learn to love yourself.",
    "Everything Isn’t Awful\nThis is the sweetest birthday party.",
    "Thankfully, our VIP program is growing every week.",
    "Some might say I’m a cynic, which is usually true.",
    "Thanks for hanging around, kids, you’re the best.",
    "Twitter Denies Appeal for The Babylon Bee\nCam&Co.",
    "Townhall Mothership\nCorporate fascism.",
    "Follow on: GETTR, MeWe, Gab, Parler,",
    "Or anyone else’s for that matter.",
    "COVID treatments and statistics.",
    "Have a great weekend everybody.",
    "SCOTUS confirmation hearings.",
    "Here Comes the Food Shortage!",
    "Seriously, it’s a party.",
    "Hunter Biden’s laptop.",
    "And you’re invited.",
    "So tag, he’s it.",
    "All good to me.",
    "Flautist.",
    "Flautas.",
    "Flutist.",
    "??",
    "??",
    "??"
  ]
}