{
  "id": 12392,
  "mediaId": 8352,
  "date": "2022-03-22",
  "headline": "Gila County Supervisors announce federal funding for local projects",
  "image": "https://silverbelt.com/uploads/images/2022/03/ca1556bbfe902223f9a05462209e018d.jpg",
  "link": "https://silverbelt.com/article/gila-county-supervisors-announce-federal-funding-for-local-projects",
  "mediaOutlet": "Lake Powell Chronicle",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In announcing that $609,000 is allocated for Gila County Wildland Fire Prevention, Supervisor Steve Christensen said, “This funding follows conversations and meetings that I have had with both Senators regarding the need for repairing our ‘First Strike’ response infrastructure; I thank them for their support and look forward to working together in the future.”\nBoard of Supervisors Chairman Tim Humphrey added his own thanks for making sure two of Gila County’s highest priorities were included in the omnibus budget bill, which funds the federal government through the end of the fiscal year and was signed by the President on Tuesday, March 15, 2022, saying: “We are appreciative of the funding for fire suppression measures in Gila County.",
    "Improving the road is an essential factor in future development of the veterans center planned for Pleasant Valley.”\nThrough Congressionally Directed Spending (CDS) requests made by Arizona Senators Mark Kelly and Kyrsten Sinema, federal funding was secured for dozens of projects across Arizona -- projects that will better equip law enforcement, invest in job-training programs, upgrade water infrastructure, expand access to healthcare and more.",
    "Strategically written requests, backed up by numerous conversations and meetings, paid off this month when members of the Gila County Board of Supervisors were notified of approval of more than $1 million worth of federal funding earmarked for Gila County projects.",
    "He added his thanks to our Senators for including $472,000 to repave the Young Road, saying: “If you don’t live in Pleasant Valley, you may not realize this is the primary access from Young to Highway 260, and includes 13 miles of dirt road.",
    "This funding targets two high-priority projects - water tanks and storage facilities for fire suppression strategically located throughout the county and working to create an all-weather surface for Forest Road 512 (the Young Road).",
    "In addition to the two county projects, two further projects were included in this funding that will benefit the residents of Gila County; a tunnel wash repair in Globe and sewer repairs in Hayden.",
    "This funding allows Gila County to proceed with working toward an all-weather surface on the Young Road - which will be so much safer for residents, visitors and emergency services.",
    "Read the complete list of Arizona CDS allocations at kelly.senate.gov/press-releases/sens-kelly-and-sinema-major-arizona-priorities-included-in-final-governmentfunding-bill/.",
    "I look forward to working with the federal government on future projects of this kind.”\nSupervisor Woody Cline knows Forest Road 512 better than most.",
    "As a lifelong Young resident he has driven that road in all seasons and all weather.",
    "We need all the help we can get to prevent future catastrophic wildfires."
  ]
}