{
  "id": 124,
  "mediaId": 2512,
  "date": "2022-02-21",
  "headline": "Why giving Congress a raise could actually help fight corruption",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29396745&width=1200&coordinates=0%2C60%2C0%2C60&height=600",
  "link": "https://www.alternet.org/2022/02/congress/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Noah Berlatsky",
  "authorUrl": "https://www.alternet.org/author/noah-berlatsky",
  "termIds": [
    2805,
    1728,
    3859,
    3993,
    3246,
    5868,
    1433,
    6650
  ],
  "sentences": [
    "He and other supporters are no doubt thinking of a suspicious stock transaction made by Georgia Senator David Perdue in January 2020 at a time when Congress People had access to non-public information about the economic and health effects of the growing Covid pandemic.",
    "The GOP has spent the last 70 years cultivating and weaponizing conspiratorial anti-establishment fervor, as Amy Fried and Douglas B. Harris explain in their recent book At War with Government: How Conservatives Weaponized Distrust from Goldwater to Trump.",
    "In the past, she warned pop singer Taylor Swift that Marxists would ban her music and most recently led a moral panic based on false claims that the US Department of Justice was giving addicts free crack pipes.",
    "At worst, Perdue’s transactions suggest how senators with stock can have financial incentives to slow-walk vital public health measures so they can use inside information to reap a financial windfall.",
    "At best, the spectacle of a senator possibly enriching himself from the same tragedy that kills and impoverishes hundreds of thousands of Americans is likely to sow distrust in the political process.",
    "Ultimately, though, a solely anti-establishment focus, based only on mistrust of government actors and institutions, is bound to empower the wealthy establishment it is intended to limit.",
    "The same anti-establishment bipartisanship that powers the stock-ban proposal interferes with equally or more important efforts to end corruption and make government more equitable.",
    "Talented people of relatively modest means could well decide that it’s simply not worth becoming Congressmembers given the opportunity to earn substantially more money elsewhere.",
    "The Congressional Research Service, the Government Accountability Office and the Congressional Budget Office, for example, lost 45 percent of their staffs between 1975 and 2015.",
    "A different bill introduced by US Senators Jon Ossoff, of Georgia, and Mark Kelly, of Arizona, covers only stock trades but includes a broader range of assets.",
    "But there are downsides when “good government” is defined solely in terms of kicking Congresspeople and limiting the personal corruption of office-holders.",
    "“Members shouldn’t be able to make legislative decisions or use their platform and influence to benefit themselves personally,” Senator Daines explained.",
    "House Speaker Nancy Pelosi only recently raised pay caps on Congressional staff in a long sought, and desperately needed, effort to improve retention.",
    "Either way, it’s obvious that the stock ban would reduce the possibility of impropriety and the appearance of impropriety with little downside.",
    "US Senators Elizabeth Warren of Massachusetts and Steve Daines of Montana have introduced a bill banning members of Congress from owning stock.",
    "Alternatively, it attracts rich people who treat it as a hobby — or as an opportunity to get insider information and huge stock windfalls.",
    "When Congressional salaries are low, the job tends to appeal to people who see it as a stepping-stone to more lucrative opportunities.",
    "Since “connected mid-career lawyer” describes most members of Congress, they are effectively taking a pay cut to be Congresspeople.",
    "Or they could enter Congress figuring that they can eventually cash out by becoming lobbyists or consultants in the private sector.",
    "It’s not an accident that Rick Scott, worth hundreds of millions, has been the major advocate for lowering Congressional salaries.",
    "There was no definitive evidence of wrongdoing, but the controversy helped lose him his Senate seat in the January 2021 run-off.",
    "The Warren-Daines bill, by banning ownership rather than just stock trades, makes it harder for Congresspeople to skate around.",
    "But anti-establishment mistrust of government has created an environment in which the proposal can garner bipartisan support.",
    "The legislation is a common-sense good government measure – and it’s obtained a surprising degree of bipartisan support.",
    "A lot of good government requires providing Congresspeople and government actors with more resources to do their jobs.",
    "Ethics experts suggest that combining the two bills could significantly reduce conflicts of interest in the Congress.",
    "If you want to fight corruption, though, you need to do more than keep Congresspeople out of the stock market.",
    "It's good that Congress can find bipartisan enthusiasm for anti-establishment anti-corruption measures.",
    "The stock ban is appealing, even unto Marsha Blackburn, because it is an anti-establishment measure.",
    "As a result, top Congressional staffers can now make more than the Congress People they serve under.",
    "Marsha Blackburn of Tennessee, who is deep in the Republican fever swamp, supports the measure.",
    "It’s certainly less than most connected mid-career lawyers could make in the private sector.",
    "The argument for preventing Congresspeople from owning stock is straightforward.",
    "There’s another, much less popular, change that could complement the stock ban.",
    "The erosion of Congressional pay is part of the erosion of government capacity.",
    "That support has come not just from Republican moderates, but from hardliners.",
    "Funding cuts to the IRS have made it impossible to police wealthy tax cheats.",
    "Congressional pay in 1965 was $30,000 — about $268,000 in current dollars.",
    "An anti-establishment approach to corruption can produce some results.",
    "It’s substantially more than your average freelance writer makes.",
    "Perdue avoided losses and reaped gains totaling in the millions.",
    "It’s consistently turned down pay increases in recent years.",
    "As a result, pay has effectively been falling in real terms.",
    "You need to encourage less wealthy people to enter service.",
    "That’s especially true of Republican congresspeople.",
    "That’s a third again as much as members make today.",
    "This article was paid for by AlterNet subscribers.",
    "Congresspeople love running against the Congress.",
    "But pay increases aren’t on the table either.",
    "But it’s less than most dentists or doctors.",
    "Congress hasn’t gotten a raise since 2009.",
    "That’s raising Congressional salaries.",
    "House members make $174,000 a year.",
    "The stock ban may well be derailed.",
    "Prefer to give a one-time tip?",
    "Try us and go ad-free for $1.",
    "Scott’s proposal didn’t pass.",
    "You need to fund oversight.",
    "For that matter, decades.",
    "That sounds like a lot.",
    "No change is easy.",
    "Not a subscriber?",
    "Click here."
  ]
}