{
  "id": 12455,
  "mediaId": 8295,
  "date": "2022-03-23",
  "headline": "Two Arizona tribal leaders make case for critically needed water projects",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2022/03/watergatewood-1024.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/03/23/two-arizona-tribe-leaders-make-case-for-critically-needed-water-projects/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reagan Priest/Cronkite News",
  "authorUrl": "https://cronkitenews.azpbs.org/people/reagan-priest/",
  "termIds": [
    0
  ],
  "sentences": [
    "“This bill will help us support the native plant and endangered fish restoration programs along other stretches of the river like we do on our reservation.”\nWith the revenue earned from leasing the water to other areas in Arizona, she said, the tribes will be able to invest in water-efficiency programs to help conserve water used from the Colorado River.",
    "“At the same time, tribes hold significant water rights that can position them to lead on water conservation.”\nThe White Mountain Apache bill would give the tribe an additional two years, from 2023 to 2025, to break ground on a rural water system to replace failing wells on the reservation.",
    "“If this issue is not resolved, the completion of the rural water system project will be threatened, thereby increasing the ultimate cost to the tribe and to the United States and delaying delivery of life-sustaining drinking water to our reservation communities,” Lee-Gateweood said.",
    "(Photo by Reagan Priest/Cronkite News)\nWASHINGTON – Leaders of two Arizona tribes asked lawmakers Wednesday to support funding for development of critical water infrastructure and to OK a bill that would let tribal water be sold to others in the drought-stricken state.",
    "White Mountain Apache Chairwoman Gwendena Lee-Gatewood told the Senate Indian Affairs Committee that her tribe needs more time and money to complete a long-delayed rural water system promised by the federal government more than 10 years ago.",
    "The second bill would let the Colorado River Indian Tribes lease some of their Colorado River water allotment to other Arizona communities, and to reinvest the revenue into improving water infrastructure on tribal land.",
    "Sen. Mark Kelly, D-Ariz., who sponsored both bills with fellow Arizona Democratic Sen. Kyrsten Sinema, echoed the need for action both for tribes and for the state in general, as it faces historic water shortages.",
    "“We are in urgent need of a long-term solution for our drinking water needs.”\nLee-Gatewood said that with continued federal support, the plant could provide drinking water to the community as soon as 2028.",
    "“The tribe’s current water sources and infrastructure have continued to be grossly inadequate to meet the current demands and needs of our reservation communities,” Lee-Gatewood said in her testimony.",
    "“The issue is a priority for me because Arizona is on the frontlines of this megadrought, and in many instances, tribal nations are among the most vulnerable to its effects,” Kelly told the committee.",
    "White Mountain Apache Chairwoman Gwendena Lee-Gatewood, left, and Colorado River Indian Tribes Chairwoman Amelia Flores urged a Senate committee to back water legislation critical to their tribes.",
    "Lee-Gatewood also explained how the proposed rural water system would enhance tribal sovereignty for the White Mountain Apache by letting them control their own water on tribal land.",
    "“I cannot overstate the importance of our water rights settlements and the White Mountain Apache Tribe’s rural water system in the health and welfare of our people,” she said.",
    "She said the tribes want to do more, including diverting some of their water to preserve habitat elsewhere on the river, but they cannot do so without congressional approval.",
    "The project was first promised by the federal government in 2010 to settle water claims by the tribe, but has been delayed by environmental review and engineering problems.",
    "The project calls for a dam across the North Fork of the White River and a water treatment and distribution system that will supply water directly to tribal members.",
    "Flores said the tribes have taken steps to reduce the amount of water they take from the river, and leaving more than 200,000 acre feet in Lake Mead since 2016.",
    "And Colorado River Indian Tribes Chairwoman Amelia Flores said her tribe has deals to reallocate some of its water, but needs congressional approval to do so.",
    "Flores said after the hearing that she is optimistic about the passage of both bills, even if they won’t come as quickly as the tribes would like.",
    "“This bill will allow our tribes sovereignty, it’ll enhance and strengthen our sovereignty for our tribal people,” Flores said after the hearing.",
    "“Right now we cannot make water available for off-reservation river habitat that is suffering as water levels drop,” Flores said.",
    "Kelly’s bill would also add another $250 million for the project to account for the delays and cost overruns.",
    "Both Flores and Lee-Gatewood appealed for urgency, citing the megadrought that is gripping Western states.",
    "We are facing a mega-drought and Arizona is Ground Zero,” Flores said in her testimony.",
    "But Flores said the hearing was about more than just water rights and infrastructure.",
    "“We’re at the doorstep, we just haven’t gone through the door yet.”",
    "“This is a critical time in the Colorado River Basin.",
    "“It’s just the beginning,” Flores said."
  ]
}