{
  "id": 1248,
  "mediaId": 2528,
  "date": "2022-02-14",
  "headline": "Democrats are in mask messaging chaos as Republicans gleefully shame AOC and Stacey Abrams for going without face-coverings",
  "image": "https://i.insider.com/620ac87116a6300018c9015b?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/democrats-lifting-face-mask-mandates-messaging-biden-aoc-stacey-abrams-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Gaudiano",
  "authorUrl": "https://www.businessinsider.com/author/nicole-gaudiano",
  "termIds": [
    0
  ],
  "sentences": [
    "At the time, he was looking forward to hitting the Wilmington YMCA a little later than usual on February 11 to take advantage of the state's indoor mask mandate lifting at 8 a.m.\n\"These masks have saved a lot of our lives, probably including my own and my wife's, but I will welcome the day when we no longer have to wear them, and in Delaware it's 8 a.m. on Friday morning,\" he said.",
    "Rank-and-file Democrats, hoping to defend their very tight majority in Congress, are struggling to discuss mask policies as President Joe Biden's administration continues to recommend indoor face-coverings and blue-state governors in New Jersey, Connecticut, California, Oregon, New York, Rhode Island, Illinois, and Biden's home state of Delaware relax different mandates.",
    "The messaging chaos within the party comes as Republicans are ridiculing Democrats for inconsistencies and hypocrisy on masks, highlighting photos on social media of unmasked Democrats such as Rep. Alexandria Ocasio-Cortez of New York, Georgia gubernatorial candidate Stacey Abrams, and California Governor Gavin Newsom.",
    "\"We've got to step up on COVID, and as you've seen Democratic governors do in recent days, start to normalize where we are and transition us from a pandemic,\" said Mark Longabaugh, a longtime Democratic operative who was a senior advisor on Sen. Bernie Sanders' 2016 presidential campaign.",
    "Republicans focus on 'hypocrisy' message\nRepublicans, many of whom have long railed against face mask requirements even during the height of the pandemic, are focused on painting Democrats as hypocrites for breaking their rules with \"masks for thee but not for me\" positions.",
    "When Abrams appeared, maskless, with a group of masked school children in Decatur, Georgia, conservatives like Rep. Marjorie Taylor Greene quickly pounced, labeling the voting rights activist\"hypocritical\" and making not-so-thinly disguised insults about Abrams' appearance.",
    "Marjorie Taylor Greene (@RepMTG) February 7, 2022\nOcasio-Cortez, who posted a video of herself dancing while on the trail for Democratic House candidate Jessica Cisneros in Texas this weekend, caught similar heat from Sen. Ted Cruz, a Republican of that state.",
    "Democrats' political unity on masking and other COVID-19 restrictions is cracking, and the division could have consequences for the party in November and beyond as pandemic-weary voters seek leaders who will help them return to some semblance of normalcy.",
    "Sen. Tim Kaine of Virginia declined to comment on Democratic state senators joining with Republicans in his state on a measure allowing parents to opt out of mask-wearing for their children at school after members of the state party fought Republican Gov.",
    "—Ted Cruz (@tedcruz) February 13, 2022\nAs the Super Bowl played out on Sunday, some conservatives were focused not on the game but on footage of celebrities and Los Angeles Mayor Eric Garcetti milling about VIP rooms with their famous faces unobstructed.",
    "Asked what Biden should do, Carper said \"I think we just follow the numbers, follow the science, listen to good advice and then allow the states to use discretion, governors to use discretion as well, and learn from what the states are doing.\"",
    "While new cases of the omicron variant are receding, Covid still poses a threat to people who are immunocompromised or live with conditions that put them at extra risk for hospitalization or death — even if many are ready to get on with life.",
    "Democratic pollster Celinda Lake, however, said Biden's message on masks is winning with voters, noting that 85 percent of Democrats support mask-mandates and face-coverings in school and a \"solid majority\" of voters overall support masking.",
    "\"We're not out of a pandemic yet, but we gotta talk about and start transitioning our policies to where it's an endemic thing — rather than pandemic — when we can get society back and our country back to some sense of normalcy.\"",
    "Longabaugh said that Democrats focused too much of their time sparring with Republicans over masking and mandates, rather than conveying a message of, \"Let's get schools back to normal, let's get back to a functioning society.\"",
    "Asked whether he feared some cities and states are moving too quickly to loosen indoor mask mandates, Biden said, \"I committed that I would follow the science, the science as put forward by the CDC, and the federal people.",
    "Jon Cherry/Getty Images\n'A tough call'\nDuring an interview with NBC released on February 10, Biden acknowledged what host Lester Holt described as \"restlessness\" and \"leaders bowing to the political winds\" on masks.",
    "During interviews at the Capitol, two Democratic senators facing re-election in states with Republican governors stayed on the pro-science messaging bandwagon when asked about mask mandates.",
    "The daylight between the Biden administration and governors in the president's party on masking in public and in schools has left the party without a clear message on what comes next.",
    "\"Everybody's doing their best to try to meet different circumstances,\" said Sen. Sheldon Whitehouse of Rhode Island, one of the Democrat-led states unwinding its indoor mask policy.",
    "—Alana Mastrangelo (@ARmastrangelo) February 14, 2022\nThe Republican National Committee even cut a video and began a recent issue of its weekly newsletter to the phenomenon.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "And on the Senate floor Monday, Senate Minority Leader Mitch McConnell, a Republican of Kentucky suggested that Democrats' actions on masks were politically-motivated.",
    "Sen. Ron Wyden of Oregon, a Democratic-led state that will soon lift indoor mask mandates, demurred when asked whether Biden needs to change his message on masking.",
    "\"I think we increase our likelihood of making mistakes when we let the politics guide us rather than the science,\" said Democratic Sen. Raphael Warnock of Georgia.",
    "There's discord between Democratic insiders, too, about how party members should talk about COVID-19 if they don't want to suffer major losses in the midterms.",
    "Democratic senators interviewed by Insider recently at the US Capitol were left trying to thread the needle between supporting federal and state responses.",
    "Sen. Mark Kelly, a Democrat of Arizona said, \"I think it's best when it comes to science to listen to the scientists and not listen to the politicians.\"",
    "\"Despite forcing masks because they're 'following the science,' Democrats have no problem taking off their masks when it's inconvenient to themselves.",
    "He instead pivoted to vaccinations, noting that he recently told constituents that his strongest hope is that everyone who can will get vaccinated.",
    "Sen. Tom Carper of Biden's home-state of Delaware seemed to embrace both his governor and president's messages when asked about mandates.",
    "\"And that seemed to be something that brought people together and that's what I'm going to be focused on,\" Wyden told Insider.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "\"I'm going to let the state guys do their state thing,\" Kaine said during an interview at the US Capitol.",
    "\"The best way to deal with Covid fatigue is really deal with Covid,\" she wrote in an email to Insider.",
    "The Biden administration wants to keep some mask requirements, while blue state governors ease them.",
    "\"The only science that's changed in the last two weeks is the political science,\" McConnell said.",
    "Republicans, meanwhile, are mocking Democrats like Stacey Abrams on Twitter for going maskless.",
    "\"All the variants have a profound impact on the psyche of the American people,\" Biden said.",
    "People protesting mask and vaccine mandates on August 28, 2021 in Frankfort, Kentucky.",
    "Win McNamee/Getty Images\nDemocratic messaging on masking is increasingly muddled.",
    "\"The only data that's changed in the last two weeks is Democrats' polling data.\"",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "And I think it's probably premature, but it's, you know, it's a tough call.\"",
    "\"And we certainly shouldn't be stopping too early or before spring breaks.\"",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"Only Dems can be such shameless mask hypocrites,\" Cruz tweeted.",
    "Their hypocrisy is increasingly brazen,\" the RNC wrote.",
    "Joe Biden removes his mask before speaking at an event.",
    "And frankly, I don't have any criticism of anybody.\"",
    "Stay up to date with what you want to know.",
    "That's more than enough to keep me busy.\"",
    "Sign up for notifications from Insider!",
    "\"Some of them are local circumstances.",
    "Some would rather avoid the topic.",
    "\"I'll focus on my federal job.",
    "Loading Something is loading.",
    "Glenn Youngkin on the issue.",
    "—Rep."
  ]
}