{
  "id": 1260,
  "mediaId": 2730,
  "date": "2022-02-17",
  "headline": "Senate Passes Short-Term CR to Fund Government, While Chip Roy Blasts Failure of Vaccine Mandate Amendments",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2020/345/76347021-b870-409c-b19f-fe020f29b867.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/02/17/senate-passes-shortterm-continuing-resolution-to-fund-the-government-n2603464",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    0
  ],
  "sentences": [
    "Another amendment from Sen. Ted Cruz (R-Texas) that would block federal funding for schools and childcare centers that require coronavirus vaccination failed, along with one from Sen. Mike Lee (R-Utah) and other GOP senators to defund vaccine requirements for medical workers, military personnel, federal employees and contractors for the length of the CR.",
    "https://t.co/vw4I6ndqM2\n— Chip Roy (@chiproytx) February 16, 2022\nAs the vote was going on, and shortly after the CR passed, Roy fired off a series of tweets blasting his fellow Republicans, but also expressing appreciation for those who voted in favor of amendments addressing vaccine mandates.",
    "#DefundVaxMandates\n— Chip Roy (@chiproytx) February 17, 2022\nRoy had reason to be frustrated with his fellow Republicans, considering that as Carney also noted in his report, if the Senate voted earlier, the amendments addressing vaccines could have made it into the bill.",
    "Source: AP Photo/Mark Tenally\nOn Thursday night the U.S. Senate managed to avert a government shutdown before the Friday night deadline when it voted 65-27 in favor of a short-term continuing resolution (CR) that will fund the government until March 11.",
    "https://t.co/iMELQIyDWD\n— Chip Roy (@chiproytx) February 17, 2022\nKnow this - the goal of @LeaderMcConnell & Senate GOP leadership was to get the funding bill across the line REGARDLESS of the outcome of the vax mandate vote… & thus it was Kabuki.",
    "That meant if the Senate had voted on the amendments on Thursday, or even Wednesday when Graham was the only GOP senator missing, the vaccine proposals would have had enough support to get added into the government funding bill.",
    "Rep. Chip Roy (R-TX) who vocally opposes vaccine mandates, especially in Washington, D.C., had called on fellow Republicans to take a stand and refuse to fund the government if proper action was not taken on these mandates.",
    "— Ted Cruz (@tedcruz) February 17, 2022\nFrom Carney:\nThe chamber started the day with two GOP senators absent, Sen. Richard Burr (N.C.) and Lindsey Graham (S.C.), along with three Democratic senators: Sens.",
    "As Spencer covered earlier on Thursday, it wasn't entirely certain if the CR would pass, given the complexities of missing members from both parties and the amount of amendments to be considered.",
    "In reporting on the passage of the bill for The Hill, Jordain Carney explained what amendments made it in:\nSenators spent days haggling over what amendments would get votes.",
    "Schumer is panicking right now because Dems WILL LOSE THE VOTE on my amendment & @SenMikeLee amendment to BLOCK BIDEN’s VACCINE MANDATES & BLOCK MANDATES ON KIDS.",
    "#DefundVaxMandates #TakeBackAmerica https://t.co/n4CfRPwWBI\n— Chip Roy (@chiproytx) February 17, 2022\nNO REPUBLICAN SENATOR should leave town this afternoon.",
    "fundraisers, vacations, fancy trips, or even just going home to their families) over standing up for the American people should be shown the door.",
    "The vote was 49-44\n— Chad Pergram (@ChadPergram) February 17, 2022\nSenate defeats Lee amendment to cut off funding for vaccine mandates.",
    "#DefundVaxMandates https://t.co/Wir53zOCmH\n— Chip Roy (@chiproytx) February 17, 2022\nAny Republican who chooses “jet fumes” (i.e.",
    "The 17 R’s who voted to move the bill forward without having locked in amendment votes should have to answer why as well.",
    "— Chad Pergram (@ChadPergram) February 17, 2022\nThe bill is headed to President Joe Biden, who is expected to sign it.",
    "In the end they agreed on three: Two related to Biden’s vaccine mandates and a third from Sen. Mike Braun (R-Ind.)",
    "We have until March 11th to see if Republicans will stand up for the people and earn votes in November.",
    "The U.S. House of Representatives, which is currently on recess, had passed the bill last week.",
    "Senate defeats debate on Cruz amdt to bar money for schools which enforce vaccine mandates.",
    "Lawmakers must work on a further deal to fund the government long-term through September.",
    "Now - EVERY @SenateGOP should be held accountable for voting to fund this government.",
    "The vaccine amendments were narrowly defeated, as Fox News' Chad Pergram tweeted.",
    "Ben Ray Lujan (Calif.), Dianne Feinstein (Calif.) and Mark Kelly (Ariz.).",
    "Romney (UT), Inhofe (OK), Burr (NC), & Graham (SC).",
    "The only way Dems win the vote is if Rs skip town.",
    "It’s not enough to be “less bad” than Democrats.",
    "The Senate defeated the amendment 47-46.",
    "No excuses - they should all be shamed.",
    "Missing R’s keeping vax mandates alive?",
    "For them, it’s process over freedom.",
    "Watch, count the votes, then act.",
    "No excuses for the @SenateGOP.",
    "on balancing the budget.",
    "#DefundVaxMandates now.",
    "Stand Up.",
    "Don’t!",
    "Now."
  ]
}