{
  "id": 1261,
  "mediaId": 2528,
  "date": "2022-02-11",
  "headline": "GOP candidate releases ad showing a faux shootout with husband of Gabby Giffords, the Arizona lawmaker who was shot in the head in 2011",
  "image": "https://i.insider.com/62064ff4e2fe3c0019ea23df?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/gop-candidate-ad-shows-faux-shootout-with-husband-gabby-giffords-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sinéad Baker",
  "authorUrl": "https://www.businessinsider.com/author/sinead-baker",
  "termIds": [
    0
  ],
  "sentences": [
    "An Arizona Republican Senate candidate released an ad that showed him in a mock shootout with an actor playing the husband of Gabby Giffords, a former Arizona lawmaker who was shot in the head while she was with constituents in 2011.",
    "Jim Lamon is running against Giffords' husband, Mark Kelly, and on Thursday released the ad which shows him in a mock Wild-West town, with actors playing the roles of Kelly, President Joe Biden, and House Speaker Nancy Pelosi.",
    "Watch the video here:\n—Jim Lamon (@jim_lamon) February 10, 2022\nGiffords, Kelly's wife, was shot in the head at point-blank range when she was meeting constituents outside a Safeway grocery store.",
    "The three actors walk into the town in a scene reminiscent of traditional Western movies, with the fake Biden carrying a rifle, the fake Pelosi a knife, and the fake Kelly a revolver.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Ross D. Franklin/AP\nA Republican Senate candidate released an ad showing him in a mock shootout with his rival, Mark Kelly.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Lamon then shoots all the weapons out of their hands, the crowd cheers, and the three Democrats run away.",
    "Kelly's wife, Gabby Giffords, a former lawmaker, was shot in the head as she met constituents in 2011.",
    "Jim Lamon's ad shows him in a faux Wild West shootout with actors playing Kelly, Biden, and Pelosi.",
    "Kelly says he has guns, but believes in gun control measures to keep people safe.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "She survived, but six people died that day, including a nine-year-old child.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "She had to learn how to talk again, and uses a wheelchair.",
    "It's time for a showdown,\" Lamon tells them in the video.",
    "\"The good people of Arizona have had enough of you.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Gabby Giffords and Mark Kelly.",
    "Loading Something is loading."
  ]
}