{
  "id": 12969,
  "mediaId": 2605,
  "date": "2022-03-03",
  "headline": "Arizona Gov. Doug Ducey opts out of Senate run — a setback for GOP hopes",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/b39d669/2147483647/strip/true/crop/3600x1890+0+255/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F82%2Fee%2F99ce483f4103a09d968cd2f159f8%2Fvirus-outbreak-arizona-16086.jpg",
  "link": "https://www.latimes.com/politics/story/2022-03-03/arizona-doug-ducey-senate",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melanie MasonStaff Writer",
  "authorUrl": "https://www.latimes.com/people/melanie-mason",
  "termIds": [
    5418,
    4905,
    4026,
    3401,
    2915,
    2459,
    2469,
    1126,
    1489,
    5949
  ],
  "sentences": [
    "“MAGA will never accept RINO Governor Doug Ducey of Arizona running for the U.S. Senate — So save your time, money, and energy, Mitch!” Trump said in a statement last month, branding the governor as a “Republican in name only.”\nDemocrats cheered the news of Ducey’s decision Thursday morning.",
    "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic Senators like Mark Kelly,” Democratic Senatorial Campaign Committee spokesman Patrick Burgwinkle said in a statement.",
    "Ducey, in a letter to donors, said that instead of a Senate run, he would focus on serving out his final term and, through his role as leader of the Republican Governors Assn., help try to win governorships for his party across the country.",
    "Mike Noble, a Phoenix-based pollster, said Ducey’s decision means Brnovich can “breathe a sigh of relief.”\n“However, it also means that any of the current Republicans candidates vying for the GOP nomination can win now,” he said.",
    "On the other side, how-ever, the governor had a key GOP opponent — former President Trump — who remains incensed that Ducey certified President Biden’s razor-thin victory in Arizona in the 2020 presidential race.",
    "With Biden’s slumping approval ratings, his party is still bracing for midterm losses, but the Senate campaign landscape is considered slightly friendlier for Democrats than the battle for control of the House.",
    "Doug Ducey will not run for U.S. Senate this year, the Republican said Thursday, putting an end to speculation that he would hop into one of the most hotly contested battles in the upcoming midterm elections.",
    "“Arizona voters have excellent candidates to choose from in the Republican primary, and the NRSC is confident any of these outstanding candidates can beat Mark Kelly in November,” she said in a statement.",
    "His decision represents a setback for Republicans in their effort to recapture a majority in the Senate, which Democrats currently control by virtue of Vice President Kamala Harris’ tiebreaking vote.",
    "Gen. Mark Brnovich, solar executive Jim Lamon, venture capital executive Blake Masters and retired Air Force Maj. Gen. Michael “Mick” McGuire, who used to lead the state’s National Guard.",
    "Larry Hogan, two Republicans who have mounted successful campaigns in blue states, also opted out of Senate races, indicating little appetite for joining the gridlocked upper chamber.",
    "Ducey is the third GOP governor this year to decline to seek a Senate seat despite dogged recruitment efforts by Senate GOP leader Mitch McConnell of Kentucky.",
    "None, however, has as strong a track record as Ducey, who handily won two races for governor in Arizona, a tightly contested political battleground.",
    "In statements and public appearances, Trump harangued Ducey for not endorsing the false conspiracy theory that Trump had actually won the state.",
    "Katharine Cooksey, spokeswoman for the National Republican Senatorial Committee, said Republicans still remain competitive in taking on Kelly.",
    "Right now, I have the job I want,” Ducey wrote in the letter, which was first reported by the Arizona Republic.",
    "A proven vote-getter in Arizona, Ducey was widely seen as a strong opponent for incumbent Sen. Mark Kelly.",
    "Republicans have a number of candidates already in line to challenge Kelly, including state Atty.",
    "“These days, if you’re going to run for public office, you have to really want the job.",
    "Ducey said last year that he was not planning on running for Senate.",
    "That did not stop McConnell and other Republicans from courting him.",
    "Chris Sununu and Maryland Gov.",
    "New Hampshire Gov.",
    "Arizona Gov."
  ]
}