{
  "id": 1305,
  "mediaId": 2540,
  "date": "2022-02-14",
  "headline": "McConnell is trying to end-run Trump in 2022. It's not working.",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/200207001437-trump-mcconnell-sotu-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/14/politics/mcconnell-recruit-gop-trump/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    0
  ],
  "sentences": [
    "Even if McConnell can convince Ducey to run for Senate, however, there's no guarantee that the Arizona governor could win a Republican primary -- especially with Trump still angry that he didn't overturn the election results in the state.",
    "The stakes, as The New York Times put it in a piece over the weekend, couldn't be higher: \"The election also represents what could be Republicans' last chance to reverse the spread of Trumpism before it fully consumes their party.\"",
    "The Point: Unless and until McConnell can show that the GOP establishment can recruit and deliver primary victories to its preferred candidates, it's a safe bet to assume this is still Donald Trump's party.",
    "But in open seat races like Missouri, Ohio and Pennsylvania, GOP candidates are falling all over themselves to curry favor with Trump, not the Senate's most powerful Republican.",
    "But he's making his feelings very clear as he tries to recruit candidates who have been willing to be critical of the former President into key Senate races.",
    "If the Senate landscape is a proxy battle between Trump and McConnell, then the former President is, at least at the moment, winning easily.",
    "Larry Hogan, who, last week, foreclosed the possibility of taking on Democratic Sen. Chris Van Hollen in November.",
    "Doug Ducey will change his mind about a lack of interest in taking on Democratic Sen. Mark Kelly this year.",
    "That came on the heels of a stunning decision last fall by New Hampshire GOP Gov.",
    "McConnell and his allies still have hope that Arizona Republican Gov.",
    "Chris Sununu to not take on Democratic Sen. Maggie Hassan in 2022.",
    "Now, we are still months from filing deadlines in many states.",
    "(CNN)Mitch McConnell may not like to talk about Donald Trump.",
    "The latest turn-down came from Maryland Republican Gov.",
    "(Hogan seems likely to run for president in 2024.)",
    "So McConnell still has some time."
  ]
}