{
  "id": 1306,
  "mediaId": 8251,
  "date": "2022-02-11",
  "headline": "GOP Senate candidate causes uproar with Wild West TV ad showing him shooting Gabby Giffords' husband Mark Kelly in staged gunfight with actors",
  "image": "https://media.12news.com/assets/KPNX/images/3cee3451-aa5c-4886-bc9a-c82798e2f31a/3cee3451-aa5c-4886-bc9a-c82798e2f31a_1140x641.jpg",
  "link": "https://www.12news.com/article/news/local/arizona/jim-lamon-causes-uproar-with-tv-ad-showing-him-shooting-mark-kelly-in-staged-gunfight/75-002fe9ac-4c92-48f6-a96e-26e0df1a8929",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Two of Lamon's endorsers make cameo appearances in the ad: Pinal County Sheriff Mark Lamb, and Brandon Judd, president of the National Border Patrol Council, the union that represents rank-and-file Border Patrol agents nationwide.",
    "Lamon campaign spokesman Stephen Puetz provided this response to 12 News via text message:\n\"The ad is a tongue-in-cheek, Spaghetti Western-themed Super Bowl ad, where a stagecoach driver complains about gas prices.",
    "\"That's something you really haven't seen in political TV commercials - politicians shooting at each other,\" said Marcus Dell'Artino, a Republican consultant at First Strategic Communications and Public Affairs.",
    "He and the 10 other Trump electors in Arizona signed a document a month after the November 2020 election that falsely claimed they were the legitimate presidential electors for the State of Arizona.",
    "Retired Maj. Gen. Mick McGuire, former adjutant general of the Arizona National Guard, tweeted, \"The ad shows poor judgment and isn't reflective of the values of the Second Amendment.",
    "The Republican candidates are: Lamon; McGuire; Masters, a venture capital investor backed by his boss, billionaire Peter Thiel; and Attorney General Mark Brnovich.",
    "In January, his campaign aired a TV spot that repeated a phrase - \"Let's Go Brandon\" - that has become a synonym for a profane insult of President Joe Biden.",
    "PHOENIX — Arizona U.S. Senate candidate Jim Lamon is taking heat for a new TV ad that shows him firing a gun at an actor depicting U.S. Sen. Mark Kelly.",
    "But Dell'Artino says the ad is a turn-off for the women and independent voters Lamon would need to defeat Kelly in a general election matchup.",
    "Lamon has also been a major benefactor of the Arizona Republican Party and a donor to Arizona Senate Republicans' partisan election review.",
    "\"The ad is going to do exactly what it was designed to do, which is get a lot of people talking and create controversy,\" Dell'Artino said.",
    "Federal Communications Commission regulations bar TV stations from censoring or rejecting campaign ads placed by a candidate's committee.",
    "Kelly is the husband of former Congresswoman Gabby Giffords, who was gravely wounded by an assassin in the Tucson shootings 11 years ago.",
    "Fred Guttenberg, a gun-safety advocate whose daughter was killed in the Parkland school shooting, demanded that Lamon pull the ad.",
    "Puetz said the ad would run during the Super Bowl broadcast Sunday in Tucson and in the Phoenix market starting Monday morning.",
    "Fits his campaign.”\nMasters has contributed to Arizona Republicans' library of Second Amendment-related videos.",
    "Lamon is a first-time political candidate who recently sold his engineering and construction business.",
    "He's writing checks at a rate of a million dollars a month, according to campaign finance reports.",
    "Kelly will face the winner of the four-person GOP Senate primary in the November general election.",
    "In this latest ad, Dell'Artino said, Lamon had to know that Gabby Giffords was Kelly's husband.",
    "He entered the Senate campaign last year with zero name recognition among Republican voters.",
    "GOP rival Blake Masters told the Arizona Republic that Lamon's ad was “Absurd and desperate.",
    "The House's January 6tth Select Committee is now investigating the origin of that document.",
    "Campaign ads featuring Republican candidates wielding weapons are nothing new in Arizona.",
    "\"He is responsible for the ad, and it looks like he's enjoying it very much on Twitter.\"",
    "Gunfire ensues, with Lamon's bullets knocking the trio's weapons out of their hands.",
    "The TV ad shows Lamon in an Old West-style gunfight with actors playing the \"D.C.",
    "\"Disgusting,\" tweeted Shannon Watts of the gun-safety group Moms Demand Action.",
    "More recently, Lamon has found himself ensnared in the \"phony elector\" scandal.",
    "Lamon is cheered by actors depicting citizens \"tired of being pushed around.\"",
    "Some social media users have called for TV stations to reject the Lamon ad.",
    "\"The good people of Arizona have had enough of you,\" Lamon says in the ad.",
    "It'll do more to boost Mark Kelly's fundraising than help Republicans.\"",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "In a November Twitter video, he said: \"This is a short-barreled rifle.",
    "Lamon has pledged to spend $50 million on a statewide Senate campaign.",
    "\"That's what he wants to with this ad, and he's doing it on purpose.\"",
    "Gang\" - Kelly, President Joe Biden and House Speaker Nancy Pelosi.",
    "The DC Gang is disarmed by Lamon, after drawing on Lamon first.\"",
    "Lamon has mocked critics on Twitter as \"left-wing snowflakes.\"",
    "But if you're not a bad guy, I support your right to own one.\"",
    "The Second Amendment is a core issue among GOP voters.",
    "Two of Lamon's primary opponents have spoken up.",
    "This isn't Lamon's first provocative ad.",
    "Kelly's campaign declined to comment.",
    "The social media reaction was swift.",
    "Lamon's TV ad breaks new ground.",
    "This is designed to kill people.",
    "It wasn't designed for hunting.",
    "\"It's time for a showdown.\"",
    "Subscribe today."
  ]
}