{
  "id": 1319,
  "mediaId": 8378,
  "date": "2022-02-15",
  "headline": "RDC advocates for Diné priorities in D.C.",
  "image": "https://navajotimes.com/wp-content/uploads/2022/02/SUBMITTED-RDC-in-DC1.jpg",
  "link": "https://navajotimes.com/rezpolitics/rdc-advocates-for-dine-priorities-in-d-c/?utm_source=rss&utm_medium=rss&utm_campaign=rdc-advocates-for-dine-priorities-in-d-c",
  "mediaOutlet": "Navajo Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rima Krisst",
  "authorUrl": "https://navajotimes.com/author/rkrisst/",
  "termIds": [
    0
  ],
  "sentences": [
    "“They wanted to cover several high-profile topics and their trip was highly productive and successful on behalf of the people in terms of accomplishing their goals.”\nRDC members and Vice President Myron Lizer met with Sen. Martin Heinrich, D-N.M., Sen. Joe Manchin, D-W.V., Sen. Mark Kelly, D-Ariz., Rep. Teresa Ledger Fernandez, D-N.M., Rep. Paul Gosar, R-Ariz., Rep. Tom O’Halleran, D-Ariz., and Rep. Yvette Herrell, R-N.M.\nNelson said the RDC also had the privilege of meeting with White House official PaaWee Rivera, from Pojoaque Pueblo, who is senior adviser to the Office of Intergovernmental Affairs and director of tribal affairs for the Biden administration.",
    "“Congress has a trust obligation to protect the Navajo Nation and clean up the abandoned uranium pits located near many of our homesteads.”\nLast year Delegate Kee Allen Begay sponsored a resolution passed by the Navajo Nation Council that officially requested a U.S. congressional hearing to be conducted within the Navajo Nation on the long-term effects of uranium on the health of the Navajo people.",
    "Topics of discussion included updates on funding for broadband and infrastructure projects, helium and hydrogen development, the cultural significance of Navajo sacred sites, federal cleanup of abandoned uranium mines, and a request for field hearings to allow public testimony both for Navajo allottee families impacted in the Chaco Canyon area and for survivors of the impacts of uranium mining.",
    "Congresswoman Herrell, as a member of the Committee on Natural Resources, serves on the National Parks, Forests and Public Lands Subcommittee and as vice ranking member of the Energy and Minerals Development Subcommittee, shared her support for the field hearings.",
    "We have to keep them on task as far as upholding the trust responsibilities over land, water, people, health, and education, etc.”\nChaco Canyon buffer zone\nAccording to the speaker’s office, in 2019 the Naabik’íyátí’ Committee passed a resolution (No.",
    "RDC Vice Chairman Thomas Walker told the Navajo Times he believes it’s good for each of the Council’s standing committees to routinely and proactively travel to the nation’s capital to share their positions on a variety of issues.",
    "“We must not forget that history and I am committed to working with my colleagues to make sure every voice is heard.”\nDelegate Mark Freeland said RDC appreciated Herrell’s advocacy on behalf of the tribes in New Mexico.",
    "NABIJA 05-20) establishing the official position of the Nation for a five-mile buffer zone around Chaco Canyon that allows allottees to advance development as landowners while protecting Navajo natural resources.",
    "“It is imperative she has an understanding of the situation in the Chaco Canyon area and how our Navajo families with allotments will be severely impacted if we establish a 10-mile buffer zone,” said Freeland.",
    "However, in November, President Joe Biden announced a 20-year ban on oil and gas drilling within a 10-mile radius of the Chaco Culture Heritage Withdrawal Area, which drew an outcry from some local allottees.",
    "SANTA FE\nThe Navajo Nation Council’s Resources and Development Committee was busy lobbying for Diné priorities in Washington, D.C., last week, both in the halls of Congress and at the White House.",
    "Following the announcement from the Department of the Interior, President Jonathan Nez sent a letter to Biden reaffirming the Navajo Nation’s position for a five-mile buffer zone.",
    "“Many of our families are suffering from the legacy of uranium mining and this toxic mineral has poisoned our communities for decades now,” said RDC Chairman Rickie Nez.",
    "“There remain over 500 plus abandoned uranium mines across the Navajo Nation; many remain open and ready to poison our people if not cleaned up,” said Begay.",
    "“The RDC has been planning this trip to our nation’s capital for some months now,” said Navajo Nation speaker’s office Communications Director Alray Nelson.",
    "“As a Council member, part of our responsibilities is advocating, promoting and protecting our interests at the state and national level,” said Walker.",
    "“The Navajo people have a long history of protecting this country and have given so much to the United States,” said Herrell.",
    "“The Navajo Nation has compromised over and over again, so our request for a five-mile buffer zone should be respected.”",
    "“The federal government is our trustee."
  ]
}