{
  "id": 13481,
  "mediaId": 2736,
  "date": "2022-03-17",
  "headline": "Miles Taylor reveals that ‘Top Republicans’ are lining up behind Dem Sen. Mark Kelly in order to ‘save our democracy’ [video]",
  "image": "https://twitchy.com/wp-content/uploads/2021/02/because-of-course-eye-roll_new.jpg",
  "link": "https://twitchy.com/sarahd-313035/2022/03/17/miles-taylor-reveals-that-top-republicans-are-lining-up-behind-dem-sen-mark-kelly-in-order-to-save-our-democracy-video/",
  "mediaOutlet": "Twitchy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah D",
  "authorUrl": "https://twitchy.com/author/sarahd-313035/",
  "termIds": [
    0
  ],
  "sentences": [
    "He’s the “high-level” Trump administration official who authored the “Anonymous” op-ed in the New York Times and went on to write a book, “A Warning.” Well, since revealing his true superhero identity, Taylor has dedicated his life to the Renew America Movement, the organization he cofounded “to defeat extremists and restore a common-sense coalition in American politics.”\nAnd now, he’s asking Republicans to stand with a man who embodies all the values they look for in a Republican: Arizona Democratic Sen. Mark Kelly.",
    "?Votes with BERNIE SANDERS 93% of the time\n?Voted for trillions in partisan spending that drove inflation\n?Voted to end the filibuster (there goes your McCain comparison)\n?Supports late-term abortion pic.twitter.com/IZCFgr4ZE3\n— Matt Whitlock (@mattdizwhitlock) March 17, 2022\nThese are \"top Republicans\" in the same way Miles Taylor was a \"top administration official\" as anonymous.",
    "https://t.co/zxCHPtj59s\n— Matt Whitlock (@mattdizwhitlock) March 17, 2022\nThis campaign is a part of the \"Renew America movement,\" founded by perpetual con artist Evan McMullin, directed by his old campaign manager.",
    "***\n‘Republicans with a plea’ Miles Taylor (aka ‘Anonymous’) and Christine Todd Whitman are begging you to team up with Dems to save America\nRecommended Twitchy Video",
    "— Stars and Stripes (@StarznStrypz) March 17, 2022\nIt does seem like something that should ping Twitter’s misinformation radar.",
    "pic.twitter.com/StuWx4BGYS\n— Miles Taylor (@MilesTaylorUSA) March 17, 2022\n“Top Republicans,” eh?",
    "“Republicans for Mark Kelly”\nReaching across the aisle is what will save our democracy.",
    "Top Republicans are coming together to help a unifying Democrat keep his Senate seat.",
    "Together they stole $700K from campaign vendors in 2016 and never paid it back.",
    "Mark Kelly has never reached across the aisle you grifting charlatans.",
    "Your phone accidentally changed \"grifters\" to \"top republicans.\"",
    "“Grifters” would’ve been a much more appropriate word choice.",
    "If you're for Mark Kelly there's no \"Republican\" left in you.",
    "https://t.co/bqdvsu5KD3\n— RBe (@RBPundit) March 17, 2022\nAh.",
    "— Matt Whitlock (@mattdizwhitlock) March 17, 2022\nAh, yes.",
    "Mark Kelly has voted with Bernie Sanders 93% of the time.",
    "Has this been flagged as misinformation yet?",
    "They sound like a very interesting bunch!",
    "OK, that definitely makes more sense.",
    "He’s as Republican as Mark Kelly!",
    "Who are these “top Republicans”?",
    "Where’s @TwitterSafety on this?",
    "Because we’d like to meet ’em.",
    "Where are the authoritahs?",
    "Remember Miles Taylor?",
    "Shameful gaslighting.",
    "Evan McMullin."
  ]
}