{
  "id": 13524,
  "mediaId": 2553,
  "date": "2022-03-19",
  "headline": "Conservatives Roast White House After Report It Considered Giving Americans Gas Cards",
  "image": "https://dw-wp-production.imgix.net/2022/03/2D994859-B115-49C1-A874-50D8261766C9-scaled.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/conservatives-roast-white-house-after-report-it-considered-giving-americans-gas-cards",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Rigolizzo",
  "authorUrl": "https://www.dailywire.com/author/john-rigolizzo",
  "termIds": [
    1973,
    2459,
    2698,
    4905,
    3045,
    1394,
    6678
  ],
  "sentences": [
    "Biden, meanwhile, has insisted that his policies have not hampered domestic energy production, and that there is little he can do because the price hikes are the fault of Russia’s invasion of Ukraine, despite the fact that he shut down the Keystone XL pipeline on his first day in office and has taken a number of executive actions to restrict domestic energy production in line with his environmental agenda.",
    "The idea was quickly shot down by a House Democratic legal counsel, who pointed out the idea would be expensive and poorly targeted; it would likely make inflation worse and wouldn’t necessarily lower prices; and it would likely bog down the IRS in the middle of tax filing season, which would lead to delays in filing and processing tax returns.",
    "https://t.co/A7p8UHEKR6\n— Dr. Miller-Meeks (@millermeeks) March 19, 2022\n“After losing hundreds of billions in waste and fraud in the COVID relief/stimulus packages, why not send out gas cards that could be even more misused and, ironically enough, help the gas companies the White House is attacking,” market researcher Josh Jordan tweeted.",
    "And you…” https://t.co/OsctSXXqEk\n— John Cooper (@thejcoop) March 19, 2022\nThe Biden admin was considering printing more money as a means to offset inflationary pressures — that were created by their printing of more money…\n— Jeff Carlson (@themarketswork) March 19, 2022\nthey really have no clue what they’re doing.",
    "“Anything except creating jobs in America making us energy independent.”\nAmazing\nJust amazing\nAnything except creating jobs in America making us energy independent https://t.co/LlI2fRNlfK\n— Comfortably Smug (@ComfortablySmug) March 19, 2022\n“WH hasn’t already learned their policies push up inflation?",
    "Prices have come down somewhat after oil futures cooled off this week, but experts predict that prices will spike again as the summer travel season begins in earnest and as producers switch to a summer blends of gasoline, which costs more to refine.",
    "Anybody got any ideas?”\n“Hey, how about we print more money, but make it gift cards?” https://t.co/3n7nT3TfCU\n— Dan McLaughlin (@baseballcrank) March 19, 2022\nOther responses can be found below:\nMake no mistake: they want everyone dependent.",
    "https://t.co/E6ntTcwWyW\n— Virginia Kruta (@VAKruta) March 19, 2022\nAt least this is slightly less stupid than “Just get an electric car, you hillbillies” https://t.co/w7AiVjoNxM\n— jimtreacher.substack.com (@jtLOL) March 19, 2022\nGas cards?",
    "After losing hundreds of billions in waste and fraud in the COVID relief/stimulus packages, why not send out gas cards that could be even more misused and, ironically enough, help the gas companies the White House is attacking.",
    "https://t.co/DMxW6VBbta\n— kaitlin (@thefactualprep) March 19, 2022\nThe White House and Congressional Democrats are weighing a number of options to address gas prices, which soared to record highs earlier this month.",
    "Conservatives on Twitter roasted the Biden administration on Saturday after a report surfaced that the White House had mulled giving Americans gas cards to help alleviate skyrocketing prices at the pump.",
    "That didn’t stop conservatives on Twitter, who pounded Democrats for proposing to make inflation even worse while avoiding the long-term fix of revitalizing American oil and natural gas production.",
    "Axios reported Saturday that the White House floated the idea as part of a package Democrats are brainstorming in an attempt to offer some sort of positive policy response to soaring gas prices.",
    "“There’s a variety of ideas being discussed to ensure that the costs American families are feeling at the pump are as minimal as possible,” White House spokesman Vedant Patel told Axios.",
    "https://t.co/KqbN5AGqwE\n— Gabriella Hoffman (@Gabby_Hoffman) March 19, 2022\nWe are like 5 minutes from Biden sending every American family a few lottery scratch offs.",
    "Democrat Senators Mark Kelly and Maggie Hassan, who are both facing re-election in 2022, authored a bill to suspend the federal gas tax through the end of the year.",
    "Some of the proposals floated by Democrats include stimulus checks, an increase in ethanol use to cut down on oil consumption, and canceling unused drilling leases.",
    "It is not an administratively feasible solution and the Biden Administration is not considering this as a serious option to help American families,” Patel said.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "Let’s make it worse…or maybe they could consider increasing domestic supply?” Republican Iowa Congresswoman Mariannette Miller-Meeks replied.",
    "State lawmakers are also floating proposals to suspend state-level gas taxes, and some Democrats have proposed offering gas rebates.",
    "https://t.co/UnTM7ZCVRk\n— David Marcus (@BlueBoxDave) March 19, 2022\nJoe Biden: Fossil fuels are not the answer!",
    "A White House spokesman admitted that the idea was discussed, but claimed it was not a serious policy proposal.",
    "Just amazing,” conservative influencer and co-host of the “Ruthless” podcast, Comfortably Smug, tweeted.",
    "https://t.co/Yk1gHad1Jz\n— Josh Jordan (@NumbersMuncher) March 19, 2022\n“‘We’re facing runaway inflation.",
    "“‘Hey, how about we print more money, but make it gift cards?’”\n“We’re facing runaway inflation.",
    "Preservationist environmentalism is toxic and needs to be dumped as energy policy immediately.",
    "“However, gas cards being sent to the American people is not seriously under consideration.",
    "While we are sitting on barrels upon barrels of onshore (and offshore) oil and gas?",
    "Anybody got any ideas?’” National Review Senior Writer Dan McLaughlin wrote.",
    "Let’s make it worse…or maybe they could consider increasing domestic supply?",
    "Some lawmakers have also called for a suspension of the gas tax.",
    "WH hasn’t already learned their policies push up inflation?",
    "Get inside access to The Daily Wire by becoming a member.",
    "Also Joe Biden: “You get a gas card!",
    "just no vision, no plan.",
    "And you get a gas card!",
    "“Amazing."
  ]
}