{
  "id": 13636,
  "mediaId": 2644,
  "date": "2022-03-16",
  "headline": "Zelensky invokes Pearl Harbor, 9/11 while asking US for no-fly zone, anti-aircraft weapons",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/zelensky-congress-biden-address-comp-1.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/16/zelensky-to-address-congress-with-biden-set-to-announce-more-aid/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Callie Patteson",
  "authorUrl": "https://nypost.com/2022/03/16/zelensky-to-address-congress-with-biden-set-to-announce-more-aid/#",
  "termIds": [
    0
  ],
  "sentences": [
    "“Russia has attacked not just us, not just our land, not just our cities, it went on a brutal offensive against our values, basic human values,” Zelensky said, accusing the Kremlin of attacking Ukraine’s “right to live freely.”\nZelensky, who has been praised around the world as a strong and brave leader amid the relentless Russian attack, described “strong” leadership as being “ready to fight for the life of his citizens, and the citizens of the world, for human rights, for freedom, for the right to live peaceably and to die when your time comes.”\nAt the end of his remarks, Zelensky spotlighted the thousands of civilian deaths in the conflict, making special note of the killing of dozens of children.",
    "This is a terror that Europe has not seen for 80 years … to create a no-fly zone over Ukraine to save people, is this too much to ask?”\nZelensky recalled both the Japanese attack that forced the US into World War II and the atrocities at the World Trade Center and the Pentagon, telling his American audience that those tragedies should “allow you to understand Ukraine and understand us now.”\n“When evil tried to turn your independent territories into battlefields, when innocent people were attacked from air … [and] you could not stop it.",
    "Ukraine President Volodymyr Zelensky pleaded with America for more help Wednesday in fending off the brutal Russian invasion of his nation, referencing the attack on Pearl Harbor and 9/11 while telling members of Congress that Ukrainians are experiencing “the same every day right now.”\n“You are the leader of the nation – your great nation – I wish you to be the leader of the world,” Zelensky said in a direct message to Biden near the end of his 18-minute remarks to lawmakers.",
    "Zelensky also called for additional sanctions against Moscow, saying they are “needed constantly every week until the Russian military machine stops.”\n“We propose that the United States sanction all politicians in the Russian Federation, who remain in their offices and do not cut ties with those who are responsible for the aggression against Ukraine,” he said, also calling for sanctions against all members of the Russian Duma.",
    "“Being the leader of the world means to be the leader of peace.”\nMembers who gathered in the 450-seat auditorium of the US Capitol’s visitor center greeted Zelensky with a standing ovation before his speech, in which he reiterated his call for the US and NATO to enforce a no-fly zone over Ukraine — a step the West has declined to take out of fear that it would escalate the conflict with Moscow.",
    "In a brief statement to reporters, House Minority Leader Kevin McCarthy (R-Calif.) called Zelensky’s address “very powerful” and urged the White House to revisit Poland’s proposal to transfer approximately two dozen MiG-29 fighter jets to Ukraine via the US — an idea Biden personally nixed last week.",
    "Later Wednesday, Biden is expected to announce an additional $800 million in security assistance for the Kyiv government – adding to billions of dollars in security assistance sent to Ukraine by the US since the annexation of Crimea by Russia in 2014.",
    "“I think there’s a bipartisan movement right here to provide [Ukraine] the MiGs, provide them the planes where they can create a no-fly zone, provide them the armaments that they need to continue to fight a war that they did not create,” he said.",
    "The video concluded with the message, “Close the sky over Ukraine.”\nThe Ukrainian president added that if a no-fly zone was not possible, the US must send S-300 missile systems and other weapons to aid Kyiv’s air defense forces.",
    "We, in Ukraine, want the same for our people.”\nLater in his remarks, Zelensky played a video interspersing images of Ukraine’s cities in peaceful times with graphic footage of Russian airstrikes and harrowing evacuations.",
    "Zelensky also referenced another symbol of America, Mount Rushmore – the massive South Dakota sculpture featuring the faces of George Washington, Thomas Jefferson, Abraham Lincoln and Theordore Roosevelt.",
    "After giving Zelensky a second standing ovation at the close of his remarks, multiple members of Congress appeared ready to answer his call to action, with Sens.",
    "Mitt Romney (R-Utah) and Mark Kelly (D-Ariz.) telling NBC News that they are in favor of delivering the S-300 missile systems and exploring additional sanctions.",
    "“I remember your national memorial … the faces of your prominent presidents who laid the foundation of the United States of America as it is today,” he said.",
    "Additionally, he asked the US to ensure that “Russians do not receive a single penny that [was] used to destroy people in Ukraine.",
    "“Russian troops have already fired nearly 1,000 missiles at Ukraine, countless bombs,” Zelensky said.",
    "At one point, Zelensky even invoked Martin Luther King Jr.’s 1963 “I Have a Dream” speech.",
    "Today my age stopped when the hearts of more than 100 children stopped beating.",
    "Our country experiences the same every day right now,” he said.",
    "I see no sense in life if it cannot stop the deaths,” he said.",
    "“Democracy, independence, freedom, and care for everyone.",
    "“I have a dream: these words are known to each of you.",
    "“They use drones to kill us with precision.",
    "I need to protect our sky,” he said.",
    "Today I can say, I have a need.",
    "“Now I’m almost 45 years old."
  ]
}