{
  "id": 13738,
  "mediaId": 2728,
  "date": "2022-03-15",
  "headline": "Today’s coronavirus news: Premier Doug Ford will keep his mask on in the legislature for ‘first few days’ post-mandate",
  "image": "https://images.thestar.com/AzGCcKSo4aByPW8VuYzzSuSqp3o=/1200x800/smart/filters:cb(1647436360688)/https://www.thestar.com/content/dam/thestar/news/canada/2022/03/15/covid-19-coronavirus-updates-toronto-canada-march-15/strolling.jpg",
  "link": "https://www.thestar.com/news/canada/2022/03/15/covid-19-coronavirus-updates-toronto-canada-march-15.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Star staff",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "10:18 p.m.: The British government said Monday that it would scrap its remaining international travel measures this week, noting it was one of the first major economies to do so and calling the move a “landmark moment.”\nAfter nearly two years, Britain has been at the forefront of efforts to end coronavirus pandemic restrictions and shift toward a strategy of living with the virus, relying on vaccines to offer protections.",
    "President Joe Biden has vowed to veto if it passes there, with the White House saying “the determination of the timeline and circumstances under which masks should be required in these settings should be guided by science, not politics.”\n6:53 p.m.: British Columbia recorded a slight drop in hospitalizations from COVID-19 and no deaths were reported due to the virus Tuesday.",
    "“No masks and a lack of vaccination is clearly not ideal for preventing spread.”\n5:40 p.m. With inflation spiralling, gas prices soaring and the soil of Ukraine now sown with the seeds of another great-powers conflict, the White House issued a pointed reminder Tuesday about another international crisis the United States isn’t quite done with yet: COVID-19.",
    "The Congressional Review Act measure, introduced by Sen. Rand Paul, R-Ky., is the latest salvo in a fight between congressional Republicans and the Biden administration over public health requirements related to the pandemic, which has killed more than 963,000 Americans to date, according to Centers for Disease Control and Prevention statistics.",
    "10:21 p.m.: Prospects looked bleak Tuesday for congressional approval of billions of dollars in new emergency aid to fight COVID-19, and White House officials said they had already scaled back plans to purchase treatments and reimburse doctors who care for uninsured COVID patients because pandemic relief money has run out.",
    "“These changes are possible due to our vaccine rollout,” Grant Shapps, the British transport secretary, said on Twitter, “and mean greater freedom in time for Easter.”\nAccording to the British government, about 86 per cent of the population has received a second vaccine dose and 67 per cent a booster or third dose.",
    "Pfizer’s CEO, Dr. Albert Bourla, said repeatedly over the past week that he believed the additional dose would be necessary to bolster protection against infection, and that Pfizer and its partner BioNTech were submitting data in support of a request for authorization to the Food and Drug Administration.",
    "For more than a year, GOP lawmakers have accused the governor of abusing his executive powers to respond to the crisis and asked legislators to vote to end the emergency in a state Senate committee hearing Tuesday, arguing the declaration was no longer necessary and constituted government overreach.",
    "Jon Tester of Montana, Jacky Rosen and Catherine Cortez Masto of Nevada, Michael Bennet of Colorado, Kyrsten Sinema and Mark Kelly of Arizona, Joe Manchin III of West Virginia and Maggie Hassan of New Hampshire all voted to oppose the mandate — the resolution’s future is uncertain in the House.",
    "Harris spokesperson Sabrina Singh said Harris would not participate in a planned Equal Pay Day event on Tuesday evening at the White House with President Joe Biden “out of an abundance of caution.”\n“The Vice President tested negative for COVID-19 today and will continue to test,” she said.",
    "In an email to The Spectator, city spokesperson Michelle Shantz said bylaw officers have issued a combined 466 charges against businesses and individuals who broke masking and physical distancing rules since they were implemented back in 2020 — as first reported by CBC Hamilton.",
    "9:50 a.m. One of the nicer things to emerge from the pandemic in Toronto is the CaféTO program which provides restaurants and bars in Toronto with the opportunity to expand their outdoor dining space through sidewalk cafés, curb lane cafés or patios on private property.",
    "Zients said the administration was focused on securing emergency funding with “no offsets.” But Sen. John Thune, R-S.D., said a spending bill would be a “much heavier lift” if the administration did not come up with some way to pay for it by repurposing existing funds.",
    "5:45 p.m.: Pfizer-BioNTech is expected to announce as soon as Tuesday that it has asked federal regulators for emergency authorization for a second booster shot of its coronavirus vaccine for adults 65 and older, according to two people familiar with the situation.",
    "“There was unbelievable interest in March break travel,” said Martin Firestone, president of the travel insurance brokerage Travel Secure Inc. That increased demand, coupled with oil sanctions against Russia, will increase the cost of air travel, said Firestone.",
    "“Some beautiful pieces came out of what they did.”\nBrought together by the church’s monthly seniors ministry at 2 Morningview Tr., the women decided to start painting there last spring, “instead of just sitting at home worried about COVID,” Allen-Rowe said.",
    "Senior Biden administration officials have put Congress on notice that the pandemic is still far from over around the world, including in the U.S., and are urging Republican lawmakers to rethink the decision last week to abruptly shut off the funding tap.",
    "Vancouver and Montreal are home to some of Canada’s largest Irish populations, and with COVID-19 protocols being lifted in many jurisdictions, festival organizers are confident that celebrations of St. Patrick’s Day can return to an adjusted normal.",
    "Vancouver and Montreal are home to some of Canada’s largest Irish populations, and with COVID-19 protocols being lifted in many jurisdictions, festival organizers are confident that celebrations of St. Patrick’s Day can return to an adjusted normal.",
    "Hospitalization data taken from Ontario's COVID-19 cases in hospital and ICU, by Ontario Health (OH) region, which corrects any under reporting in previous days, but day-of counts on Sundays, Mondays and days after holidays are partial counts.",
    "The audit details how health officials undercounted deaths in nursing homes by more than 50 per cent at certain points during the height of the pandemic, echoing similar findings reported by Attorney General Letitia James’ office last year.",
    "On Feb. 24, the government stopped legally requiring people in England to self-isolate if they tested positive for the virus; Scotland, Wales and Northern Ireland, which set health measures separately, have also moved to ease restrictions.",
    "They amped up the pressure Tuesday by briefing journalists on background on the subject, a tactic the White House generally only turns to when they’re not getting through to their rivals on Capitol Hill — quite literally, in this case.",
    "As manufacturer to the world, any disruptions to exports resulting in shortages could also drive up inflation internationally, just as central banks begin hiking interest rates, like the Federal Reserve is expected to do on Wednesday.",
    "The move comes amid calls for more doctors in the province, as well as more residency spots for medical school graduates — training they need in order to become physicians — given the mismatch between the two across the country.",
    "The announcement of 160 medical school and 295 postgraduate positions is to be made by Premier Doug Ford on Tuesday — alongside Colleges and Universities Minister Jill Dunlop and Health Minister Christine Elliott — in Brampton.",
    "Government House Leader Paul Calandra is rescinding the mask requirement for the legislative chamber and in committees as of March 21, and the Speaker says the requirements will lift that day for the whole legislative precinct.",
    "The Ministry of Health said there was a 23 per cent increase in appointments from the previous week for COVID-19 shots for kids aged five to 11 on the provincial booking system following the announcement from Dr. Kieran Moore.",
    "The global economy — already struggling with war in Ukraine and the stagflation risks it’s fanning — is bracing for greater disruption as China scrambles to contain its worst outbreak of COVID-19 since the pandemic began.",
    "The United Kingdom is set to drop all remaining COVID-19 travel measures later this week, allowing all travelers — regardless of vaccination status — to enter without a passenger locator form or negative coronavirus test.",
    "The director of Hamilton’s licensing and bylaw services department says she’s confident the city will see the repayment of at least $80,700 in unpaid tickets from people and businesses accused of breaking pandemic rules.",
    "6:45 a.m. Chinese authorities on Tuesday tightened anti-virus controls at ports, raising the risk of trade disruptions after some auto and electronics factories shut down as the government fights coronavirus outbreaks.",
    "The Democratic governor has used that broad authority to waive statutes and laws to facilitate testing and vaccination programs, and to ensure that California had enough capacity in hospitals to handle caseload surges.",
    "9:44 p.m.: The Cuomo administration undercounted COVID deaths in nursing homes by at least 4,100 as the pandemic raged across the Empire State, according to an audit released by Comptroller Thomas DiNapoli on Tuesday.",
    "Biden has been seeking $22.5 billion in COVID relief money for treatments, tests, vaccines and research; senior administration officials, speaking on a conference call with reporters, reiterated that request Tuesday.",
    "See the Star’s full Ontario COVID-19 data tracker here\nStarting at 4 a.m. Friday, travelers will no longer be required to fill out a passenger locator form with details about their trip and their vaccination status.",
    "“If we have (a) surge, we have a plan ... and if the numbers continue to take a downward trend, we will continue on the path we have been.”\nThe provincial mask mandate and other pandemic health orders ended Tuesday.",
    "The province has announced that mask mandates will lift in most public spaces on March 21, including schools, though they will remain in settings such as long-term care and public transit for about a month longer.",
    "Now, the geographic spread of infections and higher transmissibility of the omicron variant is challenging the country’s hawkish pandemic strategy of aggressive testing and locking down whole cities or provinces.",
    "Stock prices in China and Hong Kong sank for a second day following the shutdown on Monday of Shenzhen, a tech and finance hub adjacent to Hong Kong in the south, and Changchun, an auto center in the northeast.",
    "Auditors also found that officials were ill-prepared for such a deadly outbreak in elder care facilities and that the Department of Health intentionally obfuscated information about fatalities as former Gov.",
    "“There’s a number of Republicans who won’t even return our phone calls about the impact of the lack of COVID funding and how that will impact their constituents,” said White House press secretary Jen Psaki.",
    "9:22 a.m. A multi-million dollar transfer dispute caused by the COVID-19 pandemic over a forward who no longer plays for either Leeds and Leipzig went to the Court of Arbitration for Sport on Tuesday.",
    "Travel restrictions to northern Manitoba and isolation requirements for people who test positive for COVID-19 also ended, but it is still recommended they isolate for five days after symptoms start.",
    "5:42 p.m. Vaccination bookings for children jumped after Ontario’s chief medical officer revealed mandatory masking in schools would be lifted next Monday as kids return to school from March break.",
    "People at The Inspiring Seniors Art Show on March 22, from 11 a.m. to 2 p.m., can see what 15 older women from Malvern Methodist created during the pandemic and, if they like, take a painting home.",
    "Some public health experts vigorously opposed additional shots for the general population, but then changed their minds after the omicron variant proved more agile at evading the vaccines’ shield.",
    "Just as COVID induced travel restrictions are lifting, the price of fuel is skyrocketing, and that means Canadians clamouring to getaway are going to feel the brunt of increasing travel costs.",
    "“The protection that you are getting from the third, it is good enough, actually quite good for hospitalizations and deaths,” he told CBS’s Face the Nation Sunday, referring to booster shots.",
    "5:38 p.m.: Manitoba’s health minister says the province is prepared to respond if infections and hospitalizations begin to rise again with the lifting of all remaining COVID-19 restrictions.",
    "Vaccine and masking mandates are slowly being lifted across the country and many parades and festivals are going ahead, with Montreal’s event leading the charge in rejuvenating festivities.",
    "Vaccine and masking mandates are slowly being lifted across the country and many parades and festivals are going ahead, with Montreal’s event leading the charge in rejuvenating festivities.",
    "Some economists say a rise in automation that was accelerated by the COVID-19 pandemic is a healthy part of the evolution of technology, while Statistics Canada warns of rising inequality.",
    "White House officials say the shortfall will soon make it harder to access the vaccines, booster shots, tests and drug therapies that have become vital tools in the fight against COVID-19.",
    "5:46 p.m.: Roughly 17 million Americans received the Johnson & Johnson COVID vaccine, only to be told later that it was the least protective of the options available in the United States.",
    "The restrictions have wider potential ramifications, coming at a time when the global economy is under pressure from Russia’s war on Ukraine, surging oil prices and weak consumer demand.",
    "But the accumulating data nonetheless offer considerable reassurance to recipients of the vaccine and, if confirmed, have broad implications for its deployment in parts of the world.",
    "Officials are reporting 1,023 new COVID-19 cases based on PCR testing, which is limited to certain high-risk groups, and they say 8.3 per cent of tests conducted came back positive.",
    "Health Minister Audrey Gordon says the path forward as of today will be different for each person and some may choose to continue wearing masks despite it no longer being required.",
    "Ontario also logged 1,076 new COVID-19 cases, but the province’s top doctor has said the actual number is likely 10 times higher, given that access to PCR testing is restricted.",
    "Leeds has challenged last year’s FIFA ruling that awarded Leipzig more than 6.7 million euros plus 5 per cent interest for France under-21 international Jean-Kévin Augustin.",
    "Curb lane cafes provide expanded temporary outdoor dining space by reallocating the public right-of-way on curb lanes for use by licensed eating or drinking establishments.",
    "If China fails to contain Omicron’s spread, further movement restrictions would derail the economy’s promising start to the year, weakening a key pillar of global growth.",
    "The province is boosting the number of medical school and residency spots over the next five years, touting it as the largest expansion in a decade, the Star has learned.",
    "Charest says he will be campaigning from home for the next few days, and notes he will remain in his home as per public health guidelines until he tests negative.",
    "9:14 p.m.: The Senate Tuesday voted 57-40 to overturn a federal requirement that passengers on U.S. airplanes and other modes of public transportation wear masks.",
    "The latest deaths involve a person in their 70s in the Saint John region, and two people from the Moncton area — one in their 60s and another over the age of 90.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "Giovanni Gallipoli, a professor at the University of B.C., says advancements in technology are a natural part of an economy’s growth that shouldn’t be feared.",
    "Biden and Harris appeared together Tuesday afternoon and mingled with lawmakers at an event marking the signing of a $1.5 trillion government funding measure.",
    "But new data suggest that the vaccine is now preventing infections, hospitalizations and deaths at least as well as the Pfizer-BioNTech and Moderna vaccines.",
    "The aid was stripped from last week’s deal to keep the government funded, and efforts to pass a separate bill are facing an uphill fight in the 50-50 Senate.",
    "1:30 p.m. With yet another COVID-19 variant on the march, the White House is pleading with Congress to resurrect $15.6 billion in lapsed pandemic funding.",
    "The ministry says 91.3 per cent of those eligible 12 and older have received their second dose of a vaccine while 56.7 per cent have had their third shot.",
    "The Ontario government is planning to soon make permanent an hourly wage increase for personal support workers that was brought in during the pandemic.",
    "The Progressive Conservative government began loosening public health orders last month as key indicators, including hospitalizations, began to drop.",
    "And even for those who lose, in the long term there is an ability to convert to new occupations, to new jobs, to perform new tasks,” Gallipoli said.",
    "But in a two-year report on COVID-19, Statistics Canada warns the longer-lasting impacts of the pandemic on work are likely to increase inequality.",
    "5 a.m. St. Patrick’s Day celebrations are set to return this week, but festival organizers and student unions say people should party with caution.",
    "8:15 a.m. Patrick’s Day celebrations are set to return this week, but festival organizers and student unions say people should party with caution.",
    "The Newsom administration has said that the more than 2-year-old state of emergency must stay in place to continue the state’s pandemic response.",
    "While they can mean job losses in the short term, they typically result in overall increases in wealth and new jobs in the longer term, he said.",
    "It also comes as health professionals have been working all-out the past two years during the COVID-19 pandemic, raising concerns about burnout.",
    "Health authorities say 1,082 people are in hospital after 79 patients were admitted in the previous 24 hours and 74 patients were discharged.",
    "“This sounds like parents might be compensating for a shift in risk levels,” said epidemiologist Todd Coleman of Wilfrid Laurier University.",
    "But Speaker Nancy Pelosi stripped the COVID money from the broader bill in response to pushback from governors and rank-and-file Democrats.",
    "Ford says with the mandates being lifted, if people want to keep wearing a mask, then “God bless you,” but if they don’t that’s fine too.",
    "1:20 p.m. Ontario Premier Doug Ford says he will wear his mask “for the first few days” in the legislature after mandates lift on Monday.",
    "A senior government source confirmed to The Canadian Press that the government intends to introduce legislation on the matter this month.",
    "Congress slashed the amount to $15.6 billion and was poised to pass the measure as part of a broader spending package adopted last week.",
    "In Africa, for example, distribution of a single-dose vaccine that can be refrigerated for months is by far the most practical option.",
    "Eligible population (5+) progress\n* On Dec. 3, the Ontario government added all previous third doses to the total shots for that day.",
    "The wage increase for health workers has been repeatedly extended for months at a time since COVID-19 hit the province two years ago.",
    "11:30 a.m. Quebec is reporting 20 more deaths linked to COVID-19 and a slight increase of five patients in hospital with the disease.",
    "Pfizer’s move could reignite a tortuous debate among scientists that raged late last year over when and if people need booster shots.",
    "“These changes are possible due to our vaccine rollout and mean greater freedom in time for Easter,” Shapps said in a Monday tweet.",
    "The dispute arose because of the delayed finish to the pandemic-hit 2019-20 season when Augustin was on loan at Leeds from Leipzig.",
    "Before Emhoff’s diagnosis was public, White House press secretary Jen Psaki said Biden had tested negative for COVID-19 on Sunday.",
    "Since Wuhan two years ago, China has had relative success in minimizing disruption by bringing virus cases quickly under control.",
    "Pelosi has discussed voting on a stand-alone bill this week but is unlikely to do so without assurance it will pass the Senate.",
    "Meanwhile, Manitoba is lifting all remaining public health orders that were put in place to try to slow the spread of COVID-19.",
    "ICU occupancy includes patients who no longer test positive for COVID-19 but remain in the ICU for COVID-19-related illnesses.",
    "They hadn’t known they had it in them, but seniors at a northeast Scarborough church showed they could bring canvases to life.",
    "5:30 a.m. Manitoba is lifting all remaining public health orders that were put in place to try to slow the spread of COVID-19.",
    "Charest announced the news late Monday on Twitter, saying his symptoms are mild, and his wife, Michele, has tested negative.",
    "And of those tickets, 195 remain unpaid — totalling at least $80,700 (plus late fees) owed to the city, according to Shantz.",
    "Since then, cases have gone up, but the number of deaths has stayed stable, according to data from Johns Hopkins University.",
    "Vice President Kamala Harris tested negative, but is curtailing her schedule as a result of her husband’s positive test.",
    "Canada’s largest celebrations of the holiday were cancelled in 2020 and 2021 because of pandemic-related health risks.",
    "Canada’s largest celebrations of the holiday were cancelled in 2020 and 2021 because of pandemic-related health risks.",
    "Gavin Newsom’s COVID-19 state of emergency was blocked in the Democratic-controlled California Legislature on Tuesday.",
    "“We need to have this money,” Jeffrey Zients, President Joe Biden’s coronavirus response coordinator, said Tuesday.",
    "“Never in their life had they taken up a paint brush before,” Letna Allen-Rowe, one of the artists, said this week.",
    "But the South Africa-based Aspen Pharmacare is gearing up to supply large quantities to the rest of the continent.",
    "“It’s not that good against infections.” The timing of Pfizer’s request was first reported by The Washington Post.",
    "The Health Ministry says in a news release that there were 345 people in hospital and 50 were in intensive care.",
    "10:35 a.m. (updated) Ontario is reporting 688 people in hospital with COVID-19 today, and 220 in intensive care.",
    "It says there are eight health-care facilities with ongoing outbreaks, although no new ones have been reported.",
    "The request is based heavily on data from Israel, where such shots are authorized for a somewhat broader group.",
    "6:12 p.m.: Second gentleman Doug Emhoff has tested positive for COVID-19, the White House announced Tuesday.",
    "The new travel measures will go into effect 4 a.m. on Friday, according to Transport Secretary Grant Shapps.",
    "Hospitalizations includes those in the ICU but only includes patients who still test positive for COVID-19.",
    "Data unavailable for total hospitalizations before April 2, 2020 and for ICU occupancy before May 1, 2020.",
    "Johnson & Johnson has at least temporarily shut down the only plant making usable batches of the vaccine.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "But authorities are enforcing a “zero tolerance” strategy that aims to keep the virus out of the country.",
    "3:39 p.m. Health officials in New Brunswick are reporting three additional COVID-19 deaths since Friday.",
    "Only about 13 per cent of Africans are fully vaccinated, and only about 1% have received a booster dose.",
    "The plan includes a baseline of 110 adult intensive-care beds, up from the pre-pandemic baseline of 92.",
    "The reasons are not clear, and not all experts are convinced that the vaccine has vindicated itself.",
    "Those who are not fully vaccinated will no longer be required to get tested to enter the country.",
    "There have been 320 deaths related to COVID-19 in the province since the start of the pandemic.",
    "“Technological evolution ... results in wealth improvement for the vast majority of people.",
    "Gordon pointed to a recovery plan which she said ensures hospital capacity if cases surge.",
    "5:10 a.m. Conservative leadership candidate Jean Charest has tested positive for COVID-19.",
    "Bus service to Shanghai, China’s business capital and biggest city, was suspended.",
    "Scientists continue to clash over how long the vaccines’ protection really lasts.",
    "China’s case numbers are low compared with other major countries or Hong Kong.",
    "On Monday, the province had 359 people in hospital and 51 in intensive care.",
    "Masks will still have to be worn by anyone going to a health-care facility.",
    "The province said the number of hospitalizations was not available Monday.",
    "It has temporarily shut down major cities to find every infected person.",
    "There are 66 people listed in intensive care, a rise of five patients.",
    "The latest coronavirus news from Canada and around the world Tuesday.",
    "Masks must still be worn by anyone going to a health-care facility.",
    "The death toll from the virus since the pandemic began is 2,946.",
    "That includes 12,160,463 people who have been fully vaccinated.",
    "6:13 p.m.: An effort by Republican state lawmakers to end Gov.",
    "That’s compared with 228 patients in ICUs a day earlier.",
    "There were 13 new deaths from the virus reported today.",
    "There is also capacity to expand that number if needed.",
    "The cost of your long-awaited vacation is set to soar.",
    "Gordon says people should be patient with each other.",
    "“If the need be, we have a plan,” Audrey Gordon said.",
    "Andrew Cuomo sought to control what was made public.",
    "Shots per day includes third doses after that day.",
    "Travel experts say the best bet is to book it now.",
    "CAS did not set a date for a verdict in the case.",
    "Despite the defection of eight Democrats — Sens.",
    "This file will be updated throughout the day.",
    "Neither side, though, seemed willing to bend.",
    "7,288,536 people have received a third dose.",
    "It is currently set to expire on March 31.",
    "The Star does not endorse these opinions.",
    "Web links to longer stories if available.",
    "Attention international travellers.",
    "10:20 a.m.",
    "9:35 a.m.",
    "3:19 p.m.",
    "1:52 p.m.",
    "5:25 a.m.",
    "7:52 a.m.",
    "5:40a.m.",
    "2 p.m."
  ]
}