{
  "id": 1374,
  "mediaId": 2509,
  "date": "2022-02-16",
  "headline": "High gas costs from Ukraine threat pose Biden political risk",
  "image": "https://s.abcnews.com/images/Politics/WireAP_d704d0b6e5c0455f92a6a8610bd5c7db_16x9_992.jpg",
  "link": "https://abcnews.go.com/Business/wireStory/high-gas-costs-ukraine-threat-pose-biden-political-82933682",
  "mediaOutlet": "ABC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JOSH BOAK Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Senate Republican leader Mitch McConnell criticizes the president for higher energy and food prices, contending that “the Biden administration seems less interested in trying to solve this problem than in trying to persuade families the pain is just in their heads.”\nIn a December AP-NORC Center for Public Affairs Research poll, most Americans -- 85% -- said they’d experienced higher than usual prices for both groceries and gas in recent months.",
    "“Given the world that we’re in, any increase in prices of commodities, even if that is transitory, even if the Federal Reserve generally tries to look past obvious supply shocks in making its decisions, it adds to the policy conundrum,\" said Gerard DiPippo, a senior fellow at the Center for Strategic and International Studies.",
    "While the Ukraine crisis presents the U.S. with a foreign policy threat, it's also pushing gasoline prices higher at home\nWASHINGTON -- With the continuing threat of Russia invading Ukraine, a foreign policy crisis is colliding with one of President Joe Biden's political vulnerabilities: Rising gasoline prices at home.",
    "Jason Furman, a former Obama aide, Harvard University economist and senior fellow at the Peterson Institute for International Economics, said that the U.S. economy is at a point where it can withstand higher oil prices, though pockets of the country could be hurt.",
    "“ A certain amount of what the president should do is level with people that these events may drive prices up temporarily and that prices will also come back down.”\nAssociated Press writer Kevin Freking contributed to this report.",
    "“We are taking active steps to alleviate the pressure on our own energy markets and offset rising prices.”\nThe cost of crude oil — and gasoline— began to climb over the past month as Putin massed forces on the Ukrainian border.",
    "The diplomatic back-and-forth has whipsawed financial and commodity markets as investors try to price in what an armed conflict and U.S. sanctions against Russia would mean for the global economy.",
    "Forecasts from JPMorgan and other investment firms suggest that crude oil — already at about $95 a barrel — could exceed $125 a barrel due to tight supplies, which an invasion would intensify.",
    "Average prices were generally higher from 2011 to 2014 during Barack Obama's presidency and during George W. Bush's second term, according to the Energy Information Administration.",
    "This is a ‘we’re going to stop you from thinking about it by giving you a little bit of an offset here.’”\nAdjusted for general inflation, gas prices are not necessarily that high.",
    "It's a recognition of Biden's own risks ahead of the 2022 midterm elections: Inflation has become an albatross for Democrats despite the nation's strong economic growth last year.",
    "And in an open-ended question about top issues for the government to be working on, 10% named gas prices and energy costs, a sign of the political challenge confronting Biden.",
    "Biden wants to put the focus on how the Ukraine situation is contributing to higher gasoline prices, but costs at the pump already were dramatically higher from a year ago.",
    "Americans are already dismayed by Inflation at a 40-year high, and Biden is warning that gas prices could get higher if Russian President Vladimir Putin chooses to invade.",
    "“It puts the White House in a bind.”\nBiden did not spell out what specific steps his administration would take to reduce oil prices should the situation in Ukraine worsen.",
    "“People need relief right now, so this is a short-term way to do it.”\nGas prices are up nearly 40% from a year ago and more than 6% over the past month, according to AAA.",
    "Even though the broad U.S. economy can absorb higher energy prices, American families have been seeing sharp increases in the price of food, energy and other goods.",
    "Gasoline prices did fall in the weeks after the oil was released, though prices have since eclipsed the levels at the time when Biden announced the drawdown.",
    "Mark Kelly of Arizona and Maggie Hassan of New Hampshire — both up for reelection — are already calling for a suspension of the federal gasoline tax.",
    "“We’re prepared to deploy all the tools and authority at our disposal to provide relief at the gas pump,\" the U.S. president declared Tuesday.",
    "Suspending the federal tax of 18.4 cents a gallon would not offset the price increases that occurred recently as Russia threated Ukraine.",
    "Furman said the best choice Biden could make is what he did on Tuesday, warning the American people that prices could rise if war occurs.",
    "In late November he ordered the release of a record 50 million barrels of oil from the U.S. strategic reserve to reduce price pressures.",
    "“What people are focusing on is what we can do immediately,” said Michigan Sen. Debbie Stabenow, a Democrat.",
    "High prices would, in fact, lead to more oil-related investments that could cause prices to eventually fall.",
    "Republican Sen. Lisa Murkowski of Alaska equated it to a one-off “sugar high” that could wear off quickly.",
    "It's also unclear whether there is enough support in the Senate for a gas tax holiday to go forward.",
    "And there is no guarantee that energy companies would pass all of the savings on to consumers.",
    "He could order another release if diplomacy fails to cause the Russians to pull back.",
    "Efforts to coax more oil production in the U.S. and abroad have largely failed.",
    "Republicans most certainly won’t give Biden a pass due to tensions abroad.",
    "\"This doesn’t solve the problem for people paying high prices at the pump.",
    "\"There's just not a lot that the president can do,\" Furman said.",
    "Members of Congress are looking for other ways to ease the pain.",
    "The White House has yet to endorse or rule out this option.",
    "“I don’t think that’s the solution here,\" Murkowski said.",
    "Democratic Sens."
  ]
}