{
  "id": 13804,
  "mediaId": 2732,
  "date": "2022-03-15",
  "headline": "Senate votes to overturn mask mandate on airplanes, transit",
  "image": "",
  "link": "https://triblive.com/news/politics-election/senate-votes-to-overturn-mask-mandate-on-airplanes-transit/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cq-Roll Call",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In a Feb. 25 letter to White House coronavirus response coordinator Jeffrey Zients, Airlines for America, the American Hotel and Lodging Association, the U.S. Chamber of Commerce and the U.S. Travel Association urged the administration to lift the masking requirement or announce a “plan and timeline to repeal the federal mask mandate within the subsequent 90 days.”\nBut speaking on the Senate floor Tuesday, Sen. Tim Kaine, D-Va., cautioned the Senate not to overrule the mask mandate, saying it would be disastrous both to the economy and public health should there be another, dangerous covid-19 variant.",
    "DEMOCRATS WHO VOTED YES\nBennet (re-election in 2022)\nCortez-Masto (re-election in 2022)\nHassan (re-election in 2022)\nKelly (re-election in 2022)\nManchin\nRosen\nSinema\nTester\nREPUBLICANS WHO VOTED NO\nRomney\n— Sahil Kapur (@sahilkapur) March 15, 2022\nThe Senate vote comes less than a week after the White House announced it would extend the current federal mask mandate, which had been set to expire March 18, through April 18.",
    "The Congressional Review Act measure, introduced by Sen. Rand Paul, R-Ky., is the latest salvo in a fight between congressional Republicans and the Biden administration over public health requirements related to the pandemic, which has killed more than 963,000 Americans to date, according to Centers for Disease Control and Prevention statistics.",
    "President Joe Biden has vowed to veto if it passes there, with the White House saying “the determination of the timeline and circumstances under which masks should be required in these settings should be guided by science, not politics.”\nKelly, Bennet, Hassan and Cortez Masto are up for reelection this fall.",
    "At a news conference hours before the vote, a group of GOP senators led by Mississippi’s Roger Wicker, the ranking Republican on the Senate Committee on Commerce, Science and Transportation, said the extension of the mask mandate flies in the face of a general relaxation of covid-19 precautions nationwide.",
    "Jon Tester of Montana, Jacky Rosen and Catherine Cortez Masto of Nevada, Michael Bennet of Colorado, Kyrsten Sinema and Mark Kelly of Arizona, Joe Manchin III of West Virginia and Maggie Hassan of New Hampshire all voted to oppose the mandate — the resolution’s future is uncertain in the House.",
    "In late February, the CDC released guidelines suggesting that roughly 70% of Americans could stop wearing masks, depending on the prevalence of the virus in their communities, and many governors, including some Democrats, have also loosened mask requirements.",
    "“People can sit shoulder to shoulder in restaurants across the land now, without a mask, they can go to shopping centers, they can go to malls — everywhere but an airport, which looks a lot like a shopping mall to me,” Wicker said.",
    "WASHINGTON — The Senate on Tuesday voted 57-40 to overturn a federal requirement that passengers on U.S. airplanes and other modes of public transportation wear masks.",
    "“Don’t use a meat cleaver to bar the CDC from taking necessary public health action should there be a resurgence in covid,” he said.",
    "On March 9, 90 House Republicans also signed a letter urging the administration to allow the mask mandate to expire on March 18.",
    "Wicker led a March 10 letter signed by 30 other Senate Republicans urging Biden to let the mask mandate expire.",
    "That announcement marked the third extension of the mandate since it was imposed in January 2021.",
    "Sen. Mitt Romney of Utah was the lone Republican to vote to retain the mandate.",
    "Senate votes 57-40 to revoke the mask mandate for public transportation.",
    "They join the travel industry in wanting to loosen the requirements.",
    "Despite the defection of eight Democrats — Sens.",
    "Categories: News | Politics Election"
  ]
}