{
  "id": 13826,
  "mediaId": 2830,
  "date": "2022-03-15",
  "headline": "The Message of Sarah Raskin’s Defeat",
  "image": "",
  "link": "https://www.wsj.com/articles/the-message-of-sarah-bloom-raskins-defeat-federal-reserve-nomination-senate-11647382096",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "President Biden blamed Ms. Raskin’s defeat on “baseless attacks from industry and conservative interest groups.” But Ms. Raskin’s most significant opponent was her oft-expressed view that the Fed and other regulators should deny credit to companies that produce or heavily consume fossil fuels.",
    "It would also lead to the corruption of the Fed itself, as the central bank became another avenue for political and industry lobbies to implement their policy goals without having to do the messy business of passing legislation.",
    "Sarah Bloom Raskin\n Photo: Ken Cedeno/Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (2 minutes)\nAD\nLoading advertisement...\n00:00 / 02:19\n1x\nThis article is in your queue.",
    "Open Queue\n Sarah Bloom Raskin on Tuesday withdrew her nomination for vice chairman of the Federal Reserve, and the message of her defeat is more important than the fate of one would-be regulator.",
    "Congress gave the central bank additional regulatory power after the financial panic, but in the name of bank safety and soundness, not to steer capital to one industry or deny it to another.",
    "Her defeat should give Fed Chairman Jerome Powell more confidence to oppose attempts by others on the Fed Board of Governors to politicize financial regulation in the name of climate change.",
    "WSJ Opinion: The Fed's Big Inflation ProblemPlay video: WSJ Opinion: The Fed's Big Inflation Problem\n Journal Editorial Report (01/30/22): With inflation at 7%, is it moving too slowly?",
    "This has been Ms. Warren’s explicit mission since she created the Consumer Financial Protection Bureau and insulated it from Congressional appropriations and executive oversight.",
    "Her defeat is a warning to the Fed that a majority of the Senate doesn’t believe the central bank should use its power to allocate capital for political purposes.",
    "This would be economically destructive if it ever became Fed policy because politicians inevitably distort investment decisions.",
    "It should also instruct the White House not to replace Ms. Raskin with a nominee with the same views, though it probably won’t.",
    "While she and her supporters tried to say she wouldn’t use her powers that way at the Fed, everyone knew that was false.",
    "Images: Getty Images/Reuters Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "WSJ Opinion: The Fed's Big Inflation Problem\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "0:00 / 6:20\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Elizabeth Warren, Sherrod Brown and Sheldon Whitehouse pushed her so hard for the job.",
    "This isn’t part of the Fed’s dual mandate, which is full employment and stable prices.",
    "But Democrats now want the Fed to use those powers to promote their political goals.",
    "Paul Gigot interviews Strategas Chairman and CEO Jason Trennert.",
    "Ms. Raskin was her agent to do the same at the Federal Reserve.",
    "We’ve documented those views in several editorials.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Those views are the reason that Sens.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8"
  ]
}