{
  "id": 13854,
  "mediaId": 8350,
  "date": "2022-03-18",
  "headline": "Gov. Ducey against suspending Arizona’s gas tax to provide drivers relief at the pump",
  "image": "https://ktar.com/wp-content/uploads/2022/03/GettyImages-1372403397-scaled-e1647557342893.jpg",
  "link": "https://ktar.com/story/4954728/gov-ducey-against-suspending-arizonas-gas-tax-to-provide-drivers-relief-at-the-pump/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "GRISELDA ZETINO",
  "authorUrl": "https://ktar.com/story/author/gzetino/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Arizonans are paying some of the highest prices for gas we have seen in years and it’s putting a strain on families who need to fill up the tank to get to work and school,“ Kelly said in a statement last month.",
    "Suspending the gas tax would mean a $540 million per year loss to the Arizona Highway User Revenue Fund, which pays for highway construction, improvements and other related expenses throughout the state.",
    "Doug Ducey told reporters Tuesday recent gas prices are “like nothing we’ve seen in our lifetime,” he doesn’t believe suspending the gas tax in Arizona is the answer.",
    "Ducey said a better long-term solution would be to restart construction on the Keystone XL pipeline project, which President Joe Biden canceled after he took office.",
    "“We should be expanding energy production and not pursuing gimmicks, especially when we have infrastructure projects in the state that need resources,” Ducey said.",
    "Now we’re buying from our enemies.”\nMembers of Congress are also trying to come up with solutions to help consumers struggling with high gas prices.",
    "He added there are “all kinds of opportunities to tap supply.”\n“It wasn’t all that long ago America was independent,” the governor said.",
    "PHOENIX — As Arizona drivers pay a lot more for gas, there is something that could be done at the state level to provide some relief.",
    "That would save the average Arizona driver $103 per year, or $8.60 per month, according to the Arizona Department of Transportation.",
    "Prices in Arizona now hover above $4.60 a gallon for regular gasoline and above $5.10 for diesel, according to AAA in Arizona.",
    "They’re considering a bill to suspend the federal gas tax, which is 18.4 cents per gallon, for the remainder of the year.",
    "Additionally, it would lead to ADOT’s bond ratings being lowered.",
    "The state’s 18 cents per gallon gasoline tax could be suspended.",
    "That would result in an increased cost for borrowing money.",
    "The funds are also shared with cities, towns and counties.",
    "Arizona Sen. Mark Kelly is one of the bill’s co-sponsors.",
    "“We were selling energy to our friends.",
    "While Gov."
  ]
}