{
  "id": 13967,
  "mediaId": 2528,
  "date": "2022-03-16",
  "headline": "Biden calls Putin a 'war criminal' after announcing a blockbuster military-aid package to help Ukraine fight Russia",
  "image": "https://i.insider.com/62323505dc43bd001894ac24?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/biden-calls-putin-war-criminal-strong-condemnation-military-ukraine-russia-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Epstein",
  "authorUrl": "https://www.businessinsider.com/author/jake-epstein",
  "termIds": [
    0
  ],
  "sentences": [
    "Captions On/Offc\nFullscreen/Exit Fullscreenf\nMute/Unmutem\nSeek %0-9\nSettings\nOffAutomated Captions - en-US\nFont Color\nWhite\nFont Opacity\n100%\nFont Size\n100%\nFont Family\nArial\nCharacter Edge\nNone\nBackground Color\nBlack\nBackground Opacity\n50%\nWindow Color\nBlack\nWindow Opacity\n0%\nReset\nWhiteBlackRedGreenBlueYellowMagentaCyan\n100%75%50%25%\n200%175%150%125%100%75%50%\nArialCourierGeorgiaImpactLucida ConsoleTahomaTimes New RomanTrebuchet MSVerdana\nNoneRaisedDepressedUniformDrop Shadow\nWhiteBlackRedGreenBlueYellowMagentaCyan\n100%75%50%25%0%\nWhiteBlackRedGreenBlueYellowMagentaCyan\n100%75%50%25%0%\nLive\n00:00\n08:24\n08:24\n Sign up for notifications from Insider!",
    "Dmitry Peskov, a spokesperson for Putin, responded to Biden's comments on Wednesday, calling them \"unacceptable and unforgivable rhetoric by the leader of a country from whose bombs hundreds of thousands of people have died,\" the Financial Times reporter Max Seddon tweeted, citing the Russian state-owned news agency Ria Novosti.",
    "\"We're united in our abhorrence of Putin's depraved onslaught, and we'll continue to have their backs as they fight for freedom, democracy, their very survival,\" he said earlier while announcing the new aid package.",
    "Since Putin's war declaration on Ukraine almost three weeks ago, Russian attacks on civilians have led Ukrainian officials and leaders to accuse the country of war crimes and crimes against humanity.",
    "C-SPAN captured footage of the impromptu encounter in which Biden initially responded no to a reporter's question of whether the president was ready to call Putin a war criminal.",
    "0 seconds of 8 minutes, 24 secondsVolume 0%\nPress shift question mark to access a list of keyboard shortcuts\nKeyboard ShortcutsEnabledDisabled\nPlay/PauseSPACE\nIncrease Volume?",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "—CSPAN (@cspan) March 16, 2022\nAfter Biden's comments, Jen Psaki, the White House press secretary, told CNN that the president was \"speaking from the heart.\"",
    "Hours earlier, Democratic Sen. Mark Kelly of Arizona told CNN reporter Manu Raju that Putin was a war criminal and urged Biden to \"absolutely\" call him such.",
    "VIDEO: How viral moments are shaping the war in Ukraine\nThe war in Ukraine is not the first one to go viral, but it has been dubbed \"the first TikTok war.\"",
    "Meanwhile, the International Court of Justice ordered Russia on Wednesday to immediately stop its attack on Ukraine as it investigates claims of genocide.",
    "\"He is a war criminal,\" Biden said to reporters briefly at the White House after announcing a sweeping new $800 million military-aid package for Ukraine.",
    "The accusation is the first time Biden has classified Putin as such, and it comes as Russian forces continue to bombard Ukrainian civilians and cities.",
    "President Joe Biden delivered his harshest condemnation yet of Russian President Vladimir Putin, calling him a war criminal on Wednesday afternoon.",
    "Later on Wednesday, Biden tweeted about Putin's \"atrocities\" — though he still refrained from calling the Russian president a war criminal.",
    "Until now, Biden had avoided lobbying the accusation against Putin, citing an ongoing investigation into Russia's actions in Ukraine.",
    "Patrick Semansky/AP; Mikhail Klimentyev/AP\nPresident Joe Biden on Wednesday said Russian President Vladimir Putin was a war criminal.",
    "\"Putin is inflicting appalling devastation and horror on Ukraine — bombing apartment buildings and maternity wards,\" Biden tweeted.",
    "But moments later, Biden returned to clarify, asking the journalist to repeat her question, upon which he made the comments.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "She said Biden's statement was shaped by the \"barbaric\" attacks Russia had committed throughout Ukraine.",
    "\"Yesterday, we saw reports that Russian forces were holding hundreds of doctors and patients hostage.\"",
    "Russia's attacks on civilians have prompted Ukrainian officials to accuse the country of war crimes.",
    "It's the first time Biden has classified Putin as such since Russia's invasion of Ukraine began.",
    "Millions of people around the world are watching surreal TikToks of how life has changed.",
    "And the viral moments have put pressure on companies and countries to take action.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "—President Biden (@POTUS) March 16, 2022\n\"These are atrocities,\" he added.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "US President Joe Biden (left) and Russian President Vladimir Putin.",
    "Stay up to date with what you want to know.",
    "\"It is an outrage to the world.\"",
    "Loading Something is loading.",
    "Decrease Volume?",
    "Seek Backward?",
    "Seek Forward?"
  ]
}