{
  "id": 14003,
  "mediaId": 8350,
  "date": "2022-03-16",
  "headline": "GOP US Senate hopeful Jim Lamon of Arizona distances self from tax-raise plan",
  "image": "https://ktar.com/wp-content/uploads/2022/03/272998014_264363199163768_5366204743206571434_n-e1647471289817.jpg",
  "link": "https://ktar.com/story/4953020/gop-us-senate-hopeful-jim-lamon-of-arizona-distances-self-from-tax-raise-plan/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "Look how many similarities are there.”\nScott, who controls millions of dollars to elect Republicans as head of the GOP’s Senate campaign arm, outlined his proposal late last month, breaking from Senate Majority Leader Mitch McConnell’s strategy of avoiding offering specifics that Democrats could attack.",
    "He added that Lamon strongly believes that Congress must protect the Social Security benefits “that millions of Americans were promised and have built their retirement planning around.”\nThat’s the most detailed response an Arizona Senate candidate has offered to Scott’s plan.",
    "PHOENIX (AP) — Jim Lamon, an Arizona businessman running in the crowded Republican primary for U.S. Senate, is distancing himself from taxation and Social Security proposals in a controversial GOP policy agenda he enthusiastically embraced a week ago.",
    "Lamon told voters in North Phoenix last week that a proposal by Republican Sen. Rick Scott of Florida is “pretty good stuff.” Scott’s 11-point plan calls for raising taxes and, some argue, threatens Social Security and Medicare.",
    "He said the plan bore similarities to his own proposals, but he did not specifically address the most divisive provisions, and he distanced himself from them when asked by the AP to expand on his remarks.",
    "“Jim also feels strongly that no American should have their taxes raised and has signed the Americans for Tax Reform Taxpayer Protection Pledge,” Lamon’s spokesman, Stephen Puetz, said in an email.",
    "And Democrats immediately pounced, optimistic they could capitalize on the plan to motivate voters in a midterm election when they are saddled with an unpopular president and a shaky economy.",
    "“We will not have as part of our agenda a bill that raises taxes on half of the American people and sunsets Social Security and Medicare within five years,” McConnell told reporters.",
    "It has divided mainstream Republicans and energized Democrats who hope their voters will mobilize against it and bolster their party’s bleak electoral prospects this November.",
    "The other Republicans are Attorney General Mark Brnovich, investor Blake Masters, former Arizona National Guard chief Mick McGuire and Corporation Commissioner Justin Olson.",
    "Lamon brought up the plan during a conversation with voters at an IHOP restaurant, which was surreptitiously recorded and provided to The Associated Press.",
    "We have a whole lot of similarities.”\nLater, he added: “Please go read the website of our policies, but also look at Rick’s.",
    "Scott’s plan said “all Americans should pay some income tax to have skin in the game,” noting half of Americans pay none.",
    "It followed Lamon’s enthusiastic remarks about the plan to voters gathered for a grassroots tea party meeting in Phoenix.",
    "He’s running in a crowded Republican primary with no clear frontrunner to take on Democratic Sen. Mark Kelly.",
    "Lamon is a longtime energy industry executive who founded a solar energy firm headquartered in Scottsdale.",
    "The plan fed a simmering feud between Scott and McConnell, who made clear Scott’s plan was not his own.",
    "Democrats say that would amount to a tax increase for millions of low-income and elderly Americans.",
    "The Democrats will lose their Senate majority if the GOP picks up even a single seat this year.",
    "But critics say that would threaten popular programs such as Social Security and Medicare.",
    "Scott’s plan also calls for setting all federal legislation to expire after five years.",
    "“If a law is worth keeping, Congress can pass it again,” he wrote.",
    "I said Rick, have you been reading my website now?",
    "They latched onto two provisions in particular.",
    "Pretty good stuff,” Lamon said of Scott’s plan.",
    "Pass it along to the KTAR News team here.",
    "“I talked to him, what was it, Monday.",
    "We want to hear from you.",
    "Have a story idea or tip?",
    "“It was pretty detailed.",
    "Share\nComments"
  ]
}