{
  "id": 14063,
  "mediaId": 6658,
  "date": "2022-03-15",
  "headline": "‘Gabby Giffords Won’t Back Down’ Review: ‘RBG’ Directors Add Another Shero to Their Formidable Filmography of Impressive Women",
  "image": "https://variety.com/wp-content/uploads/2022/03/Gabby-Giffords-Wont-Back-Down.jpg?w=1000",
  "link": "https://variety.com/2022/film/reviews/gabby-giffords-wont-back-down-review-1235205144/",
  "mediaOutlet": "variety.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lisa Kennedy",
  "authorUrl": "https://variety.com/author/lisa-kennedy/",
  "termIds": [
    0
  ],
  "sentences": [
    "There is a fine amount of levity in “Gabby Giffords Won’t Back Down,” as in a Mother’s Day scene with mom Gloria, in which they jest about the time Giffords kept filling in sentences her speech therapist asked her to make with the word “Chicken.” If you laughed at that scene, you may feel less guilty because Kelly and Giffords smile at that scene, too.",
    "Making deft use of those videos, in addition to fresh interviews and archival footage, Cohen and West build a story that consistently reflects its protagonist’s personality, offering a humbling lesson in resilience, while also\naddressing issues that continue to bedevil the U.S. — gun violence, mental health, the costs of health care.",
    "But then in painstaking, halting sentences that make eloquently clear what she’s lost, Giffords reminds us that the diminutive of her name Gabrielle used to describe her relationship to language, to communicating ideas, to a T.\nThe documentary captures the tension between tragedy and resilience.",
    "In Cohen and West’s most recent documentaries on Ruth Bader Ginsburg, Civil Rights maverick Pauli Murray and Julia Childs, marriage (or in Murray’s case, a long-term romantic relationship with a woman) figures significantly in the story.",
    "Even with former president Barack Obama speaking about a political trajectory on an ascendant course, it is Giffords’s post-shooting tenacity that elicits admiration, including her work to end gun violence and increase gun safety.",
    "Watching the vibrant Arizona native in clips from home movies and photos taken prior to the shooting, it’s hard not to wonder where her smarts, centrist views and verve might have taken her politically — and grow angry.",
    "The filmmakers are judicious in their use of footage from high-profile shootings that occurred since Tucson: Aurora, Colo.; Newtown, Conn.; Las Vegas, Nev.; Orlando, Fl., among them.",
    "With their latest film, documentary duo Julie Cohen and Betsy West (“RBG”) create a portrait of Giffords and her husband, Sen. Mark Kelly, that is both inspiring and infuriating.",
    "A scene of her sitting in their kitchen coaching him on his maiden speech for the senate is hilarious, not least for his good-humored frustration at her stage directions.",
    "It’s clear however from interviews with Kelly’s daughters from his first marriage, Claudia and Claire, that the stepchild part of their saga wasn’t all smooth sailing.",
    "As accomplished as Kelly was in his naval and then NASA careers, he was, in the realm of electoral politics something of an Eliza Dolittle to Gifford’s Henry Higgins.",
    "Somewhat worrisome: Not even a brief mention is made of the 2017 shooting of then House Majority Whip Steve Scalise and three others at a GOP baseball practice.",
    "Giffords and 12 others survived the mass shooting, but six people did not, including civics-interested Christina-Taylor Green, 9, and federal judge John Roll.",
    "After the Arizona mass shooting and the massacre at Sandy Hook Elementary the next year, she and Kelly launched Americans for Responsible Solutions.",
    "“Gabby Giffords Won’t Back Down” begins with the former Arizona representative placing flowers in memorial vases for victims of gun violence.",
    "A former NASA astronaut and space shuttle commander, Kelly was in Houston when he got the call from the representative’s chief of staff.",
    "Thirteen days after the shooting, Giffords was transferred to Houston’s TIRR Memorial Hermann, a rehabilitation hospital nearer to NASA.",
    "A gunman obsessed with the congressperson attempted to assassinate her as she was greeting constituents at a Tucson supermarket.",
    "Instead, it’s a sign of the aphasia Giffords has wrestled with since a bullet ripped through her brain on Jan. 8, 2011.",
    "It takes a first-rate intelligence to hold two opposing ideas in mind at the same time, as F. Scott Fitzgerald wrote.",
    "Instead, she was in surgery and soon to embark on an arduous physical journey with an uncertain outcome.",
    "It’s a sage feminist gesture that vigorously nods to the fact that singular subjects seldom go it alone.",
    "Her musical tastes are reflected in a soundtrack that includes Talking Heads, U2 and, yes, Tom Petty.",
    "In November, Kelly, who won a special election for John McCain’s seat in 2020, is up for reelection.",
    "With a voiceover rife with potent pauses, her cadence sounds for a moment like a spoken word poem.",
    "While her rhythm is indeed intentional and meaningful, it’s not out of a sense of artistry.",
    "Her recovery picks up pace when her speech and physical therapists begin leveraging music.",
    "Kelly admits on-camera to a kind of denial, thinking maybe she had been shot in the arm.",
    "In a film that suggests what might have been and what is, Giffords proves first-rate.",
    "At the time of the shooting, she was considering a run for the U.S. Senate.",
    "Giffords grew up playing the French horn and is a lover of late-’80s rock.",
    "News reports of her condition quickly plummeted before they leveled off.",
    "It was there Kelly began videotaping Giffords incremental recovery.",
    "The story of their meeting — they were married in 2007 — charms.",
    "Initially, it is hard to tell how much Giffords comprehends.",
    "The information was terse, only that Giffords had been shot.",
    "For a short time, outlets were reporting she had died.",
    "Kelly is Giffords’s advocate, caretaker, cheerleader.",
    "Those early days after the shooting were crushing.",
    "Her shaven head is cross-hatched with staples.",
    "Giffords looks so tiny in her hospital bed.",
    "The star here remains Giffords.",
    "(Giffords is a gun owner.)"
  ]
}