{
  "id": 1410,
  "mediaId": 2748,
  "date": "2022-02-16",
  "headline": "Democrats float gas tax holiday to provide inflationary relief",
  "image": "http://www.stationgossip.com/favicon.ico",
  "link": "http://www.stationgossip.com/2022/02/democrats-float-gas-tax-holiday-to.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STATION GOSSIP",
  "authorUrl": "https://www.blogger.com/profile/14290129071922737076",
  "termIds": [
    0
  ],
  "sentences": [
    "\"We need to continue to think creatively about how we can find new ways to bring down costs, and this bill would do exactly that, making a tangible difference for workers and families.”\nInflation and supply chain issues have caused the price of gasoline to surge 40% in 2021, according to data released by the Labor Department.",
    "\"This bill will lower gas prices by suspending the federal gas tax through the end of the year to help Arizona families struggling with high costs for everything from gas to groceries,” Kelly said in a statement last week after introducing the bill.",
    "\"The President already announced an historic release of 50 million barrels from the strategic petroleum reserve, and all options are on the table looking ahead,\" White House spokeswoman Emilie Simons said.",
    "Funds raised through the gas tax goes to the Highway Trust Fund, which pays for highway construction projects and public transit, and which is already projected to become insolvent in five years.",
    "The Washington Post reported Tuesday that White House aides are involved in conversations about whether a gas tax holiday would provide relief to consumers or benefit gas producers instead.",
    "The American Automobile Association reports the national average price for a gallon of gasoline is $3.50 as of Tuesday, nearly a dollar more expensive than it was last year.",
    "While the White House hasn't specifically commented on the bill to suspend the gas tax, a spokeswoman told the Daily Mail \"every tool is on the table to reduce prices.\"",
    "President Joe Biden and congressional Democrats are reportedly considering a federal gas tax holiday to relieve Americans feeling inflationary pain at the pump.",
    "“People want their bridges and their roads, and we have an infrastructure bill we just passed this summer, and they want to take that all away,” Manchin said.",
    "The CRFB warned that a tax holiday could also result in \"even higher rates\" of inflation next year once the policy ends by boosting demand for fuel.",
    "People are feeling a real pinch on everyday goods, and we must do more to help address rising costs, particularly the price of gas,” Hassan added.",
    "Biden's approval rating is hovering at a dismal 41%, with most Americans disapproving of how he's handled the economy and the pandemic.",
    "A federal gas tax holiday may be exactly the sort of short-term band-aid Democrats need to staunch the president's bleeding support.",
    "The Committee for a Responsible Federal Budget said Tuesday the government would lose $20 billion in revenue by suspending the tax.",
    "Mark Kelly (D-Ariz.) and Maggie Hassan (D-N.H.) would suspend the 18.4 cents per gallon gas tax through Jan. 1, 2023.",
    "Still, the Biden administration faces pressure to act on the economy as the 2022 midterm elections approach.",
    "The Democrats say this temporary measure is needed to provide economic relief to families nationwide.",
    "Outside groups warn that a tax holiday would only provide temporary relief and add to the deficit.",
    "Sen. Joe Manchin (D-W.Va.) told reporters Tuesday he had similar concerns about a gas tax holiday.",
    "Consumer prices increased by 7.5% last year, the highest inflation rate reported in 40 years.",
    "\"This legislation is about making sure that we get Granite Staters relief at the gas pump.",
    "Not every Democrat is on board with the plan.",
    "\"It just doesn't make sense.\"",
    "A bill offered by Sens."
  ]
}