{
  "id": 14107,
  "mediaId": 2790,
  "date": "2022-03-21",
  "headline": "Ethics advocates say Senate staffers could be breaking rules on stock ownership",
  "image": "https://media.npr.org/assets/img/2022/03/18/gettyimages-1385734173_wide-a6ab14536b98d224f2f8950bc50cd4fb202f4bb1.jpg?s=1400",
  "link": "https://www.npr.org/2022/03/21/1087234024/ethics-advocates-say-senate-staffers-could-be-breaking-rules-on-stock-ownership",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Deirdre Walsh",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "CLC has filed numerous complaints before the Senate ethics committee and the Office of Congressional Ethics regarding non-compliance of lawmakers with the STOCK Act (Stop Trading on Congressional Knowledge Act), the decade-old law requiring lawmakers and senior aides to disclose stock transactions valued at $1,000 or more within 45 days.",
    "While this letter raises questions about a Senate rule, not the STOCK Act, it gets to an argument that CLC and other advocates have been making — that those in senior staff positions on Capitol Hill, not just elected members, have access to non-public information and could personally profit from their positions.",
    "In a letter to the Senate Select Committee on Ethics sent on Thursday, the Campaign Legal Center said its review of financial disclosure forms found five senior Senate committee aides with stock holdings that could run afoul of a Senate rule and asked the panel to explain if it gave permission to these staffers.",
    "Since the story published, a spokeswoman for the Senate Finance Committee told NPR the aide employed by the panel whom CLC listed in its letter was permitted to hold the stock by the chairman at the time, Republican Sen. Chuck Grassley of Iowa.",
    "The letter quotes from the Senate rule, that saysthe staffers must divest \"any substantial holdings which may be directly affected by the actions of the committee for which they work,\" unless given written permission by the ethics committee.",
    "CLC's researcher combed through financial disclosure forms for the 2020 year for several Senate committees in the office that keeps them and focused on disclosures from senior committee aides, those making roughly above $135,000 per year.",
    "Congress is working on possible legal restrictions for lawmakers, their families and staff\nThere are a number of Senate bills proposed that would extend a ban on individual stock trading to senior staff and to lawmakers' spouses.",
    "The committee aides are not named in the letter, nor is any partisan affiliation, but the nonprofit group reports they are employed by the Senate Agriculture, Banking, Armed Services, Finance and Commerce committees.",
    "Some high-level committee staff own stock in industries they help regulate\nOne Banking Committee aide owned stock in three financial institutions, including stock in Wells Fargo valued between $65,000 and $150,000.",
    "Jeff Merkley, D-Ore., Elizabeth Warren, D-Mass., Jon Ossoff, D-Ga., Sherrod Brown, D-Ohio., Mark Kelly, D-Ariz., — have been working to come up with a bill that could gain support of their caucus and Republicans.",
    "While the Senate already has a ban for committee aides, the House of Representatives does not require any committee staffers to divest from any holdings in financial interests before panels they work on.",
    "A senior Agriculture Committee aide owned stock in a company that is one of the largest fertilizer manufacturers, one of the largest poultry companies, and a company that makes medicine for livestock.",
    "\"Based on CLC's review of Senate committee staff financial disclosures,\nthere is reason to believe that multiple staff members own stock that conflicts\nwith the jurisdiction of their committees.",
    "Similarly, any reform of the congressional stock trading rules should also apply to senior staff,\" Kedric Payne, vice president of the Campaign Legal Center, told NPR in a written statement.",
    "The issue of who should be covered in any new legislation banning individual stock trades or ownership is one of the big sticking points in the discussions about new reforms to ethics laws.",
    "Owning these stocks violates\nSenate Rule 37.7, absent any guidance or written permission from the Ethics\nCommittee,\" the letter concludes, referring to the rule governing staff holdings.",
    "A senior Senate Armed Services Committee aide owns stock in two of the largest defense contractors — Lockheed Martin and General Dynamics — valued between $1,001 and $15,000 each.",
    "Financial disclosure forms for lawmakers and aides who are required to file them are publicly available, but often there is a lag between when they are filed and available online.",
    "But there is already a narrow ban in place for some Senate staffers that was enacted in the 1970s, and an outside legal group believes some aides appear to be violating that ban.",
    "Similarly, NPR asked spokespeople for the five committees cited in the letter for reaction to the letter and inquired whether the aides may have been granted waivers.",
    "Under Ethics Committee guidelines, it was not required to be approved by Chairman Grassley due to the small amount,\" Ashley Schapitl told NPR in a written statement.",
    "\"The committee-staff stock ban is proof that the Senate has recognized the risks of staff owning stock, but it is meaningless without transparency of enforcement.\"",
    "A spokesman for the chair of the panel, Sen. Chris Coons, D-Del., said as a matter of policy Coons does not comment on matters related to the ethics committee.",
    "\"Financial disclosure laws apply to senior staff because of the potential conflicts of interest that exist with their influential positions.",
    "A group of Democratic senators who have proposed banning members of Congress from trading individual stocks — including Sens.",
    "Senate committee staffers are required to divest stock in industries related to the jurisdiction of the panel they work for.",
    "Both the Senate and the House are considering legislation that would ban members of Congress from trading individual stocks.",
    "Lawmakers are also required to file these reports for their spouses and dependent children's financial transactions.",
    "Some current bills cover lawmakers, spouses and dependent children, and others cover lawmakers and senior staffers.",
    "NPR reached out to the Senate ethics panel to ask about the findings cited by CLC but did not get a response.",
    "Several Senate Republicans have also proposed bills to bar members from buying or selling individual stocks.",
    "In the House, there are multiple proposals to reform laws about members' financial transactions.",
    "The ethics committee has not responded to inquiries about any guidance it gave on the matter.",
    "It's unclear whether the ethics committee has given waivers to one or more of the aides.",
    "NPR did not receive any responses from the committees at the time of publication.",
    "\"The purchase adhered to Senate rules."
  ]
}