{
  "id": 145,
  "mediaId": 2553,
  "date": "2022-02-24",
  "headline": "Democratic Senators Respond To Russia Invading Ukraine",
  "image": "https://dw-wp-production.imgix.net/2022/02/CB-scaled.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/democratic-senators-respond-to-russia-invading-ukraine",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daily Wire News",
  "authorUrl": "https://www.dailywire.com/author/daily-wire-news",
  "termIds": [
    0
  ],
  "sentences": [
    "The US, our allies, and the world must make it clear that we will not stand for this.”\nSen. Jeanne Shaheen (D-NH): “Vladimir Putin will face the full wrath of the transatlantic alliance for violating Ukraine’s sovereignty and waging war on the Ukrainian people.”\nSen. Maggie Hassan (D-NH): “Russia’s unprovoked and unconscionable invasion of another sovereign nation is a direct threat not only to the people of Ukraine, but to peace, freedom, and security in every corner of the world.",
    "We stand with them and support President Biden and our allies in enacting severe sanctions against Putin for his unprovoked and dangerous attack on an important democratic ally.”\nSen. Michael Bennett (D-CO): “Putin’s corrupt and self-serving distortion of history and disregard for international law has upended the post WWII order.",
    "The Ukrainian people will fight for as long as it takes to secure their nation from this foreign tyrant, and the United States will stand with them in this fight.”\nSen. Chris Coons (D-DE): “Today, President Putin launched an unprovoked, all-out war against an independent, democratic country that poses no threat to Russia.",
    "We should impose the full weight of economic sanctions right now, explore options to bolster the Ukrainian resistance, and stand resolute in our support of democracy and the rule of law.”\nSen. Chris Murphy (D-CT): “Putin’s decision to invade is an evil, panicked move of weakness and will be his defining mistake.",
    "They will pay a steep cost for Putin’s reckless ambition, in blood and in economic harm.”\nSen. Patty Murray (D-WA): “The Ukrainian people are being plunged into a deadly and devastating war because of the cruel ambition of one dictator—this conflict is totally fabricated but its human toll will be very real.",
    "As we pray for them in this dark moment of uncertainty, it is clear that history will prove Vladimir Putin’s decision to sacrifice the lives of countless Ukrainians and Russians was made out of fear-fear of allowing a neighboring independent, sovereign nation to pursue democracy and freedom.",
    "As someone who has strong ties to the region, my prayers are with the Ukrainian people and all of Eastern Europe.”\nSen. Ben Cardin (D-MD): “One person alone, Vladimir Putin, is responsible for the destruction and likely deaths that will occur from this unprovoked military incursion.",
    "As President Biden said tonight, the world must and will hold Russia accountable.”\nSen. Dick Durbin (D-IL): “Let me be clear: Vladimir Putin’s invasion of Ukraine’s sovereign land is a dire threat to the established international order and must be resolutely deterred.",
    "He will be held accountable for these actions.”\nSen. Chris Van Hollen (D-MD): “We stand by the people of Ukraine against Putin’s unprovoked aggression & must immediately rally our allies to deploy the full weight of punishing economic sanctions & arm the resistance.",
    "As Chairman of the Senate Foreign Relations Committee, I am committed to ensuring that the United States upholds our responsibility to exact maximum costs on Putin, the Russian economy, and those who enabled and facilitated this trampling of Ukraine’s sovereignty.",
    "We stand with the brave people of Ukraine.”\nSen. Cortez Masto (D-NV): “Putin’s decision to launch a violent, unprovoked attack on Ukraine must be met with crushing sanctions and a strong, unified response from the United States and our allies.",
    "Numerous Democratic Senators responded to Russian President Vladimir Putin launching a full-scale invasion in Ukraine during the early morning hours on Thursday with a variety of statements that offered support and called for immediate action.",
    "The Daily Wire reported that the initial wave of Russian attacks against Ukraine targeted military and government facilities, airfields, and installations along the border and large explosions were seen in videos posted on social media.",
    "The democracies of the world must stand united with Ukraine & hold Putin accountable.”\nThe Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "That number is likely to quickly rise as Russian ground forces entered Ukrainian and Russia has launched attacks against targets in multiple cities, including Kyiv, Kharkiv, Odessa, Ivano-Frankivsk, Mariupol, and others.",
    "But tonight, our prayers are with an entire nation, young and old, who refuse to let a tyrant use military might to impose his will on Ukraine.”\nSen. Cory Booker (D-NJ): “My heart is with the people of Ukraine tonight.",
    "The United States and our allies have successfully galvanized an international coalition to counter Russian aggression; now we must refuse to stand by and watch innocent Ukrainian men, women, and children suffer.",
    "The United States and our allies must bring to bear crippling consequences on Vladimir Putin and the Russian economy as a whole, as we also provide support to the Ukrainian people and our NATO allies.",
    "He bears responsibility and must be held to account.”\nSen. Alex Padilla (D-CA): “Just spoke with Ukrainian Consul General Kushneruk to reaffirm our support for the people of Ukraine.",
    "Therefore, we must all, on both sides of the aisle and both sides of the Atlantic, work together to demonstrate to Putin that this aggression will not be allowed to go unpunished.",
    "Americans must stand united, and our NATO alliance must stand strong against Putin’s aggression.”\nSen. Bob Menendez (D-NJ): “Tonight, my heart is heavy for the people of Ukraine.",
    "Now the U.S. and our NATO allies must stand united and resolute against Putin’s efforts to renew the Russian empire at the expense of the Ukrainian people.",
    "We should also continue to bolster the defenses of our NATO allies while exploring how we can further help the Ukrainian people in their time of need.",
    "#StandWithUkraine”\nSen. Jeff Merkley (D-OR): “Russia is not only attacking Ukraine, it is attacking the very foundations of the international order.",
    "While there is still an opportunity for Russia to reverse course, we can no longer hold out hope that this standoff will be resolved peacefully.",
    "President Biden has already imposed an initial tranche of sanctions, and it is now time for us to up the pain level for the Russian government.",
    "The attacks started at approximately the same time that Putin announced that he was launching a “special military operation” in Ukraine.",
    "I support the most punishing costs possible on Russia and its leadership and stand with our allies in support of the Ukrainian people.",
    "This unprovoked attack has brought into sharp focus the need to expel the current Kremlin leadership from the international community.",
    "I am thinking tonight of the Ukrainian people, who want nothing but peace, yet are now under attack and in a war for their homeland.",
    "A senior Ukrainian official told The Wall Street Journal that hundreds of Ukrainian soldiers died in the initial volley of attacks.",
    "Some statements from Democratic senators included:\nSen. Mark Kelly (D-AZ): “Putin’s invasion of Ukraine is unprovoked and unjust.",
    "Russia will pay for its aggression.”\nSen. Mark Warner (D-VA): “For more than 70 years, we have avoided large-scale war in Europe.",
    "This is a fabricated conflict that could have a massive human toll, all spurred by the delusional aspirations of a weak dictator.",
    "Russia made a grave mistake and will be held accountable.”\nSen. Jacky Rosen (D-NV): “My thoughts are with the people of Ukraine.",
    "Ukraine and our NATO allies facing ongoing Russian belligerence have strong bipartisan, bicameral support in the U.S. Congress.",
    "Putin must be made to rue the day he began this bloodletting.”\nSen. Ed Markey (D-MA): “My prayers are with Ukraine tonight.",
    "The world is united against Vladimir Putin.”\nSen. Amy Klobuchar (D-MN): “Putin’s invasion of a free democracy has begun.",
    "President Putin’s unjust invasion is threatening the security of Europe and putting the lives of millions at grave risk.",
    "His violent path will result in grave consequences not only for the Ukrainian people but for the Russian people as well.",
    "The United States, coordinating with our allies & partners, must punish Putin immediately for his unprovoked aggression.",
    "With his illegal invasion of Ukraine, Vladimir Putin has tragically brought decades of general peace to an end.",
    "The United States, alongside our NATO allies, must be resolute in our support for the Ukrainian people.",
    "What is happening in Ukraine is a tragedy not only for Ukraine, but for the Russian people as well.",
    "Vladimir Putin’s unprovoked attack tonight is a significant escalation and cannot go unpunished.",
    "Today must mark a historical shift in how the world views and deals with the despot in Moscow.",
    "And we must work to quickly impose the maximum sanctions on Putin and the Russian government.",
    "Ukraine said that Belarus, which is aligned with Putin, assisted Russia in attacking Ukraine.",
    "We know that they will stand up for their country and their freedom.",
    "There must now be swift sanctions and consequences worldwide.",
    "Get inside access to The Daily Wire by becoming a member.",
    "It is the time for our country and our world to unite.",
    "The warnings from our Intel sources were right.",
    "Create a free account to join the conversation!",
    "Putin has chosen a devastating and illegal war.",
    "Ukrainians are a resilient, determined people.",
    "And we will continue to stand with them.",
    "I stand with the Ukrainian people.",
    "We will hold Russia accountable.",
    "We stand with Ukraine."
  ]
}