{
  "id": 1474,
  "mediaId": 2528,
  "date": "2022-02-16",
  "headline": "Some Democrats are pushing to cut gas taxes through 2022, but Obama torched the idea years ago",
  "image": "https://i.insider.com/620d639976ba0e0019995997?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/democrats-pushing-gas-tax-holiday-obama-mocked-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brent D. Griffiths",
  "authorUrl": "https://www.businessinsider.com/author/brent-d-griffiths",
  "termIds": [
    0
  ],
  "sentences": [
    "Sen. John Thune of South Dakota, the second-ranked Senate Republican, told reporters: \"I think it's just a clearly transparent political move to try and give political cover to a handful of Democrats that are up in states this year where gas prices are going to be a big issue.\"",
    "\"We're having a caucus discussion on it, but we haven't yet taken a caucus position,\" Schumer said, adding that a gas tax suspension was \"one of many things\" senators are considering as they try to lower costs for families.",
    "Senate Majority Leader Chuck Schumer hinted at the politics of the situation when he said that \"eight or nine of our members have introduced this, including many of those that are in tough races in 2022.\"",
    "Vulnerable Senate Democrats are considering an effort to suspend the federal gas tax as a sign to voters that Uncle Sam understands the pinch inflation has inflicted on American families.",
    "\"Well, let me tell you, this isn't an idea designed to get you through the summer, it's designed to get them through an election,\" Obama said, dismissing an idea floated by both Sens.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "But when this same idea was floated in 2008, then-Democratic presidential candidate Barack Obama mocked the suggestion that a gas tax holiday would make a difference.",
    "According to the latest Consumer Price Index report, energy remained the largest contributor to inflation in January, with gas prices up 40% from the previous year.",
    "As an Illinois state senator, he joked in 2000 that he wanted signs saying, \"Senator Obama reduced your gasoline prices\" to be placed on pumps in his district.",
    "If enacted, the proposal by Kelly and Sen. Maggie Hassan, a New Hampshire Democrat who also faces a tough reelection campaign, would last just over 10 months.",
    "Matt Rourke/AP; Ross D. Franklin/AP\nSen. Mark Kelly is leading Democrats in a push for a gas tax holiday that lasts through the end of the year.",
    "Sen. Joe Manchin of West Virginia threw cold water on it and argued temporarily cutting the tax could further swell the federal deficit.",
    "CBS reported that he voted at least three times in support of suspending the state's gas tax but opposed efforts to gut it permanently.",
    "Sen. Mark Kelly of Arizona said on Tuesday that suspending the gas tax through the end of the year was a \"pretty obvious thing to do.\"",
    "Barack Obama, then a presidential candidate, torched a shorter tax holiday in 2008 when John McCain and Hillary Clinton pushed it.",
    "But if you actually got one then prices would barely go down,\" Jason Furman, a former Obama economist, wrote on Twitter.",
    "John McCain, his eventual Republican opponent, and Hillary Clinton, his primary opponent and future Secretary of State.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "At a different rally, Obama, who was poised to become the Democratic Party's presidential nominee, chided McCain.",
    "Congress has not raised the tax since 1993, despite the Highway Trust Fund repeatedly running low on funds.",
    "The Committee for a Responsible Federal Budget estimates that such a holiday would cost $20 billion.",
    "Republicans lambasted the proposal and said it amounted to little more than an election-year stunt.",
    "Representatives for Obama, Kelly, and Hassan did not immediately respond to a request for comment.",
    "The history underlines the skepticism fellow Democrats and some economists have for the proposal.",
    "Obama himself was dogged by attacks that he flip-flopped on the issue during the 2008 campaign.",
    "Kelly and Hassan's proposal calls for general federal money to cover the costs of the holiday.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Barack Obama, seen here in 2008, and Sen. Mark Kelly, a Democrat from Arizona.",
    "In 2008, McCain and Clinton proposed suspending the gas tax for three months.",
    "His legislation would shelve the 18.4 cent-per-gallon tax through 2022.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "It also didn't encounter much support on the other side of the aisle.",
    "\"I could easily see it being popular to propose a gas tax holiday.",
    "The Biden White House did not reply to Insider's inquiry either.",
    "?Half a tank of gas,\" Obama said at a North Carolina rally.",
    "Some economists are also skeptical about the benefits.",
    "Not every Senate Democrat was on board with the plan.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "\"That's his big solution.\"",
    "\"?"
  ]
}