{
  "id": 1481,
  "mediaId": 2520,
  "date": "2022-02-15",
  "headline": "America needs Gov. Doug Ducey to run for US Senate. Seriously. I'm not kidding. Honest",
  "image": "https://www.gannett-cdn.com/presto/2020/10/19/PPHX/55052bf3-daaf-4435-a4a0-1ed3baf804a5-AP20293762278951.jpg?crop=1023,576,x0,y0&width=1023&height=576&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/ej-montini/2022/02/15/doug-ducey-run-senate-mcconnell-republican-convince-him/6793050001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "EJ Montini",
  "authorUrl": "https://www.azcentral.com/staff/2646830001/ej-montini/",
  "termIds": [
    0
  ],
  "sentences": [
    "He issued a brief statement saying, “MAGA will never accept RINO Governor Doug Ducey of Arizona running for the U.S. Senate – So save your time, money, and energy, Mitch!”\nTrump also has taken to calling McConnell an “old crow.”\nArizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "After acquiescing to Trump’s every whim while The Donald was in office, McConnell and others seem to have grown tired of his whining about the election, his crazy conspiracy rants and his autocratic inclinations, and would like to restore some sanity to the GOP.",
    "When 'old crow' is a badge of honor\nTrump either read (doubt it) or was told about (that’s probably it) the Times article describing how McConnell is trying to push Ducey into the Senate race.",
    "A question only Doug Ducey can answer\nThere are questions to be answered, lines to be drawn, or redrawn, or erased altogether, and the only way for that to happen is through an election.",
    "If Ducey were to agree to such a thing, it would mean first getting through a brutal primary and then facing an enormously well-funded, well-positioned opponent in the general election.",
    "The way it is in politics these days (or perhaps this is how it has always been), the very best thing a long-time elected official could do for the country would be to NOT run again.",
    "He knows this is why leaders of a pre-Trump Republican Party are trying to recruit him to run as a possible candidate to face, eventually, Democratic Sen. Mark Kelly.",
    "Ever since the governor followed the law, honored his oath of office and certified Arizona’s 2020 election results, the former president has trashed him.",
    "He even organized a political event in which $5,000 gets a donor an autographed bottle of “Old Crow” Kentucky-produced bourbon.",
    "Opinion: There's a question about Donald Trump that can only be answered by a Republican primary election with Ducey in it.",
    "According to a recent article in The New York Times, however, McConnell and others believe Ducey can win a primary.",
    "A person like Ducey in a state like Arizona has to run as a candidate in a high-profile Republican primary.",
    "Senate Minority Leader Mitch McConnell and others have been trying to convince Ducey to run.",
    "But Ducey is politically intuitive enough to know that a Senate run is more important.",
    "Under Trump, however, the nuttiest Republicans moved closer and closer to the center.",
    "Not too long ago on KTAR radio he said, “I’ve answered this question several times.",
    "Our state needs Ducey to seek the Republican nomination for the U.S. Senate.",
    "McConnell, being from Kentucky, has worn the insult like a badge of honor.",
    "Each party contains crackpots and loons around the edges.",
    "Although, the general election isn’t the important part.",
    "Can Republicans restore sanity, or is it too late?",
    "I’m no fan of the senator, but I’d drink to that.",
    "Reach Montini at ed.montini@arizonarepublic.com.",
    "For more opinions content, please subscribe.",
    "Although “restore” is not the right word.",
    "There really is only one way to find out.",
    "I’m 100% focused on my day job.”\nMaybe.",
    "The important part is the primary.",
    "Hell, our country needs this.",
    "Until they became the center.",
    "… The answer hasn’t changed.",
    "So far, Ducey has declined.",
    "Except … for Arizona Gov.",
    "Ducey understands this.",
    "And I understand why.",
    "Not the same office.",
    "No higher office.",
    "For anything.",
    "Or did they?",
    "Doug Ducey.",
    "Nothing.",
    "Ever."
  ]
}