{
  "id": 15200,
  "mediaId": 2658,
  "date": "2022-03-09",
  "headline": "Feds charge dual national with acting as a Kremlin agent",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/03/09/feds-charge-dual-national-with-acting-as-a-kremlin-agent-00015810",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2274,
    4689,
    2924,
    557,
    474,
    6411,
    6442
  ],
  "sentences": [
    "In a statement on its website dated Nov. 18, the latter organization announced it was suspending activities “after a year of active and nation-wide FBI measures directed at over 300 Russian community members” who reported that “federal agents appear to be searching for” FARA violations, which the group called “a form of pressure reminiscent of the Cold War era.”\n— She allegedly organized meetings so that Russian officials could lobby American politicians and businesspeople, and received “tens of thousands of dollars in funding from” the Russian government while taking “direct orders from Russian officials concerning events and public messaging.” She also allegedly corresponded with Russian President Vladimir Putin directly, the indictment says, and though there is no indication Putin ever responded personally to her correspondence, she was photographed at an event in 2016 with his current press secretary.",
    "“Our closure will effectively conclude our relationship with a number of clients in adherence with our professional obligations.”\n— In a statement to our Hailey Fuchs, Akin Gump, whose namesake Robert Strauss was the final U.S. ambassador to the Soviet Union and the first ambassador to Russia, said it is “deeply saddened and shocked by the events in Ukraine and the tragic and senseless loss of life of so many innocent Ukrainians” and would be “suspending operations in Moscow pending further developments.”\nANNALS OF CAMPAIGN FINANCE — JAN. 6 EDITION: “The House Jan. 6 committee has waged high-profile legal battles with Donald Trump and his closest allies as it tries to uncover every detail of what happened that day and determine what culpability the former president may have for the violent attack on the Capitol,” The Washington Post’s Josh Dawsey, Jacqueline Alemany and Tom Hamburger report.",
    "— Sean Kennedy, the top lobbyist for the National Restaurant Association, accused lawmakers of “walking away from” the grant program known as the Restaurant Revitalization Fund, calling it “a gut punch to the 177,000 restaurants who now have some incredibly difficult decisions ahead of them.”\n— “We are beyond disappointed that this massive government funding proposal ignores the needs of 177,300 neighborhood restaurants and bars impacted by the pandemic,” Erika Polmar, the executive director of the Independent Restaurant Coalition, said in a statement, asserting that “thousands of neighborhood restaurants are going to close as a result of Congressional inaction.”\n— The package also does not include funding for a relief program for the fitness or hospitality industries or aid for minor league sports leagues.",
    "The committee will also consider if any laws were broken and refer those to the Justice Department, which would then decide whether to pursue any prosecutions.”\n— In recent months, investigators “have increased their focus on the vast digital fundraising efforts around overturning the election, trying to pinpoint if the Trump campaign and allied Republicans were engaged in a coordinated effort to raise money on fraudulent and misleading appeals, according to people involved in the probe.”\nGOP SENATORS SPLINTER OVER TAKING ON BIG BEEF: “After years of failed attempts, Washington lawmakers are closer than they've ever been to mandating more competition in the American beef industry — which is dominated by four big meatpackers that control how most cattle are bought and sold,” POLITICO’s Meredith Lee reports.",
    "— “But the politically powerful conglomerates and key farm lobby groups are making a last-ditch push to derail the bipartisan legislation by splitting Republicans on the Senate Agriculture Committee — sparking unusually bitter finger-pointing between GOP lawmakers and their staffs.”\n— “In a rare personal rebuke, Iowa Republican Chuck Grassley, one of the bill’s main proponents who has been trying for decades to pass similar reforms, even recently accused some GOP Agriculture Committee aides of ‘working behind the scenes at the behest’ of the big meatpackers to stall it.”\n— “For the first time in years, a significant segment of Republicans also support efforts to promote more price transparency, giving the bill’s backers a narrow window to get it passed and signed into law.",
    "New Lobbying Terminations\nActive Policy Solutions, LLC: Kids Included Together\nCapitol Core Group, Inc.: Ameresco, Inc.\nEb Consulting LLC: Friends Committee On National Legislation\nGovernment Relations Group, LLC: Lerner And Rowe Business Claims\nGovernment Relations Group, LLC: National Bio+Green Sciences LLC\nGovernment Relations Group, LLC: Seavee Boats, Inc\nJn Strategic, Inc: American Continental Group Obo Septa\nMeridian Hill Strategies Formerly Known As \"Ernest C Baynard Iv\": Tecore Networks\nMr. Ben Droz: Vote Hemp\nSullivan Reberger: Shimmick Contruction Company, Inc.",
    "— Branson is charged with knowingly failing to register under FARA — the indictment references visits to FARA’s eFile system from Branson’s electronic devices during which a registration for the Russian Center was started but never submitted — as well as violating the foreign agent statute sometimes referred to as “espionage lite,” conspiracy to commit visa fraud and lying to the FBI.",
    "Feds charge dual national with acting as a Kremlin agent\nBy CAITLIN OPRYSKO\n03/09/2022 05:00 PM EST\nDUAL U.S.-RUSSIAN CITIZEN CHARGED WITH ACTING AS ILLEGAL FOREIGN AGENT: Federal prosecutors unveiled illegal foreign agent charges on Wednesday against a woman with both U.S. and Russian citizenship who founded what authorities called a “Russian propaganda center” in New York.",
    "The Russell Group, Inc.: United Fresh Produce Association\nThe Sheridan Group: End Citizens United/Let America Vote Action Fund\nWater Strategies, LLC: Bear Paw Development Corporation Of Northern Montana\nWater Strategies, LLC: Candy Mountain\nWater Strategies, LLC: Colorado River Water District\nWater Strategies, LLC: Columbia Basin Development League\nFollow Us",
    "— “But it has also been focused on another part of its inquiry that panel members said is of equal importance to the success of the investigation — tracing every dollar that was raised and spent on false claims that the election was stolen.”\n— “Committee members and aides said the goal of scrutinizing and documenting the money flow is twofold.",
    "— “As alleged, Branson engaged in a wide-ranging influence and lobbying scheme with funding and direction from the Russian government — all while deliberately leaving the American people in the dark,” Matthew Olsen, the head of the Justice Department’s National Security Division, said in a press release announcing the charges against Branson.",
    "But Sen. John Boozman of Arkansas, the senior Republican on the Agriculture Committee, has raised concerns about unintended consequences of mandating how private companies make purchases, effectively slowing the measure’s advance.”\nJobs Report\n— Daniel Bucheli is now communications director for Rep. Victoria Spartz (R-Ind.).",
    "— According to an indictment, Elena Branson has worked on the Russian government’s behalf since at least 2011 to promote Russian interests in the U.S. through an organization she started called the Russian Center New York and her leadership role with a group called the Russian Community Council of the USA.",
    "— “As circumstances surrounding the conflict in Ukraine continue to change rapidly, it has become clear that it is no longer tenable for us to continue our operations in Russia and we have therefore decided to wind down our Moscow office,” said Angelo Kakolyris, a spokesperson for the firm.",
    "In the interview, Branson told Butina that she had “left the United States for Moscow” after being interrogated by the FBI because she was “‘scared’ and thought the ‘probability was very high’ that she would be arrested” if she remained in the U.S.\nGood afternoon and welcome to PI.",
    "Kirsten Gillibrand, Mark Kelly)\nNew PACs\nBlueRock National Committee (PAC)\nCommon Good Fund (Super PAC)\nEngineering America's Future (Super PAC)\nPATRIOTS PAC LLC (PAC)\nStop Collectivism Or Totalitarianism Triumphs PAC (Leadership PAC: Scott Baugh)\nNew Lobbying Registrations\nNone.",
    "AID FOR RESTAURANTS, GYMS DOESN’T MAKE OMNIBUS: Congressional appropriators finally struck a deal Wednesday on a $1.5 trillion bundle of spending bills to fund the federal government through September, and released text for the 2,700-page package early this morning.",
    "The primary objective is to determine whether email solicitations spreading false claims of election fraud served as a powerful source of misinformation, prompting the need to make proposals for strengthening campaign finance laws.",
    "— Prosecutors say Branson left New York for Russia about a month after FBI agents interviewed her, and executed search warrants that resulted in the seizure of 34 electronic devices, including 11 cellphones, and has not returned.",
    "— The indictment also resurfaces a familiar face: In October, authorities say, Branson sat for an interview on state media outlet RT with Maria Butina, who pleaded guilty to acting as an agent of the Kremlin in 2018.",
    "He was previously communications director for the South Dakota Department of Public Health and before that was communications director and deputy chief of staff for former Rep. Mike Coffman (R-Colo.).",
    "Squire, which had represented the now-sanctioned Gazprombank since 2014 — though its last reported lobbying activities on behalf of the bank came in 2017 — filed termination paperwork today.",
    "But even before the text dropped, advocates who had lobbied hard for additional relief for the restaurant industry were blasting lawmakers for leaving more funding out of the package.",
    "SQUIRE, AKIN GUMP SHUTTER RUSSIAN OPERATIONS: Squire Patton Boggs and Akin Gump Strauss Hauer & Feld became the latest major law and lobbying firms to swear off Russian business.",
    "Christine Sur, most recently senior policy adviser for Rep. Jared Huffman (D-Calif.), is also working with ESP Advisors in an advisory capacity as a senior policy adviser.",
    "Nor does it include the reinstatement of the Covid-era Employee Retention Tax Credit, as a broad coalition of business and trade associations have pushed for.",
    "Swarztrauber, a former adviser to former Republican FCC Chair Ajit Pai, will retain his position as a director at Clout Public Affairs.",
    "Hutton was previously vice president of government affairs at drone maker Volansi and a staffer on SASC and Senate Appropriations.",
    "— Pamela Day, most recently chief of staff for Rep. Don Young (R-Alaska), has joined ESP Advisors as a senior policy adviser.",
    "— Jennifer Chronis has joined VMware as vice president for the public sector including federal, state and education.",
    "She was previously senior vice president for the public sector for Verizon and is an Amazon Web Services alum.",
    "— Evan Swarztrauber is a new adviser on tech and telecom policy at the Lincoln Network, Morning Tech reports.",
    "— Church Hutton has joined Mercury Systems as vice president of government affairs, per Morning Defense.",
    "— Laurie McKay has joined the Kennedy Center as vice president of government relations and protocol.",
    "She most recently served as a director in the Government Law and Policy Group at Greenberg Traurig.",
    "— Rina Pal-Goetzen is joining the Semiconductor Industry Association as director of global policy.",
    "— Kara Brooks has been promoted to be vice president for communications at SHRM.",
    "Did you or a client score any major wins or suffer a blow in the spending bill?",
    "She most recently was director for corporate comms at the organization.",
    "— Cori Kramer has been named chief executive officer at Center Forward.",
    "Riley Kilburg will step into Kramer’s role as executive director.",
    "She most recently was general counsel of 3D printed microTEC.",
    "They also say Branson sold her New York apartment last year.",
    "New Joint Fundraisers\nGillibrand Kelly Victory Fund (Sens.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "Get in touch: coprysko@politico.com."
  ]
}