{
  "id": 1527,
  "mediaId": 2614,
  "date": "2022-02-16",
  "headline": "Democrats Propose Gas Tax Holiday To Help Struggling Americans",
  "image": "https://www.lifezette.com/wp-content/uploads/2020/12/2020.12.17-01.06-lifezette-5fdaaefd48838-scaled.jpg",
  "link": "https://www.lifezette.com/2022/02/democrats-propose-gas-tax-holiday-to-help-struggling-americans/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DrewBerquist.com",
  "authorUrl": "https://www.lifezette.com/author/dberquist/",
  "termIds": [
    0
  ],
  "sentences": [
    "Releasing a statement on the bill, Kelly said, “This bill will lower gas prices by suspending the federal gas tax through the end of the year to help Arizona families struggling with high costs for everything from gas to groceries.”\nSenator Hassan added, “This legislation is about making sure that we get Granite Staters relief at the gas pump.",
    "“The President already announced an historic release of 50 million barrels from the strategic petroleum reserve, and all options are on the table looking ahead.”\nOn top of the silence from the White House, the Committee for a Responsible Federal Budget noted that the government could lose upwards of $20 billion if the bill is passed.",
    "We need to continue to think creatively about how we can find new ways to bring down costs, and this bill would do exactly that, making a tangible difference for workers and families.”\nNot speaking on the matter, White House spokeswoman Emilie Simons focused on the efforts already taken by President Biden.",
    "In the first year of his Presidency, America appears to be divided as ever, inflation is hitting record highs, and now simply filling up at the gas pump comes with the dread of gas prices climbing well above $3 a gallon.",
    "Before Joe Biden entered the White House, he promised the American people two things, (1) to unify the country, and (2), to shut down the coronavirus – not the economy.",
    "Headed by both Senator Mark Kelly of Arizona and Senator Maggie Hassan of New Hampshire, the bill would suspend the current gas tax of 18.4 cents a gallon.",
    "But hoping to help struggling Americans with the dilemma they created, Democrats are debating a federal gas tax holiday to help families make ends meet.",
    "People are feeling a real pinch on everyday goods, and we must do more to help address rising costs, particularly the price of gas.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "Not to mention, COVID-19 continues to spread and the Southern border is in shambles.",
    "It originally appeared in DrewBerquist.com and is used by permission.",
    "The temporary measure would be in effect until January of 2023.",
    "This piece was written by Jeremy Porter on February 16, 2022."
  ]
}