{
  "id": 15425,
  "mediaId": 8451,
  "date": "2022-03-08",
  "headline": "Arizona gas prices are going up. Here's how to find the cheapest gas",
  "image": "https://www.gannett-cdn.com/presto/2022/03/08/PPHX/ea98a1aa-c335-4fa6-b37a-9d1f19ee545d-uscp-7k0za3pbzj6oeuw08ef_original.jpg?crop=2999,1687,x1,y180&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/money/business/consumers/2022/03/08/cheapest-gas-metro-phoenix-and-arizona/9415162002/",
  "mediaOutlet": "Tempe Ahwatukee Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Russ Wiles",
  "authorUrl": "https://www.azcentral.com/staff/2646084001/russ-wiles/",
  "termIds": [
    46,
    6678,
    6515,
    6569,
    5949
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nCould the federal gasoline tax be suspended?",
    "Here's what you can do to help ease the pain on your pocketbook, and what to know about the situation:\nHow to find cheap gas with GasBuddy, Waze, Google Maps\nIt pays to shop around, especially if you can do it remotely without driving all over town.",
    "In addition to the U.S., which is actually the largest oil producer, accounting for 20% of global supplies, many other nations produce oil including Saudi Arabia, other Persian Gulf states, Canada, China, Iraq and, of course, Russia, the No.",
    "These range from keeping tires properly inflated and replacing dirty air filters to driving slower on highways, using cruise control if you have it and accelerating and braking gradually.",
    "The economy has run on all cylinders lately, as seen by a robust 7% jump in U.S. GDP in last year's fourth quarter, with nearly full employment in many places including metro Phoenix.",
    "Texas that month accounted for 5 million barrels, followed by New Mexico (1.43 million), North Dakota (1.15 million), Alaska (446,000 barrels) and Colorado (404,000 barrels).",
    "But at 18.4 cents a gallon, that tax represents a small slice of overall gasoline costs, and suspending the tax would worsen funding problems for the federal highway system.",
    "Domestic crude oil prices have surged nearly $52 a barrel over the last year, to a recent price near $116, according to the federal Energy Information Administration.",
    "Other steps include combining trips, carpooling and possibly keeping your vehicle garaged for short trips that you can instead do on a bike or bus or by walking.",
    "That had risen to around 11.6 million barrels a day in late 2021, and the EIA predicts domestic production will hit a record 12.4 million barrels a day in 2023.",
    "The U.S. had around 125 operating oil refineries last year, with those in Texas and Louisiana dominating the list of largest facilities, according to the EIA.",
    "And be mindful of where you drive — the gasoline tax in Arizona is a comparatively light 19 cents a gallon, according to the American Petroleum Institute.",
    "The price spike reflects a combination of strong demand and tight supplies, plus concern about supply disruptions tied to Russia’s invasion of Ukraine.",
    "From a 42-gallon barrel of crude oil, refiners typically produce 19 to 20 gallons of gasoline, plus 11 to 12 gallons of fuel oil, according to the EIA.",
    "People are getting out and about more following the pandemic lockdowns over the past two years, filling commercial aircraft and taking more road trips.",
    "Another possibility is releasing crude oil from strategic national reserves, as the U.S. and various other counties recently announced they would do.",
    "The recent spikes in crude-oil prices aren't yet fully reflected in gasoline prices, and the high-demand summer driving season still lies ahead.",
    "Of that, a whopping $24 a barrel has come over just the past week or so, reflecting anxiety about import bans or supply disruptions from Russia.",
    "Other than that, conservation — driving less, combining trips and driving more slowly on freeways — probably offers the best bang for the buck.",
    "If current trends continue, including concern about Russia's invasion of Ukraine, the pain at the pump could get worse before it gets better.",
    "One proposal, from a group of senators including Sen. Mark Kelly, D-Ariz., would suspend the federal gasoline tax for the rest of 2022.",
    "However, economic activity is projected to moderate a bit this year, and a quick end to Russia-Ukraine hostilities would bode well.",
    "Tips for saving money on gas\nMotorists can take advantage of various mechanical and behavioral tactics to improve fuel economy.",
    "They have, but it takes a while to pump crude oil, send it to refiners, refine it and then distribute it to gasoline stations.",
    "In January, a gallon of regular gasoline sold for about $3.41 on average, with crude-oil costs accounting for 56% of that.",
    "Other helpful sites include Google Maps, if you search for local gas, and Waze.com, which also offers tips on carpooling.",
    "It also helps to remove excess cargo from a vehicle, make sure the gasoline cap is on tight and reduce idling if you can.",
    "The national average price is up by $1.30 a gallon over the past year — and a whopping 45 cents over just the past week.",
    "Yes, but it was well under 1,000 barrels a day as of November — a mere drop in the bucket, according to the EIA.",
    "Nationally, gasoline sold for about $4.07 a gallon on Monday and $4.13 a gallon in Arizona, according to AAA.",
    "For diesel, refining expenses added a bit more and crude oil accounted for a bit less, according to the EIA.",
    "Rising gasoline prices are back, big time, with fuel inflation growing significantly in recent weeks.",
    "One helpful online site is gasbuddy.com, which shows local prices online or if you download its app.",
    "For example, the U.S. was producing as little as 9.8 million barrels of oil a day in February 2021.",
    "The EIA, in a recent forecast, said it expects crude prices will fall over the second half of 2022.",
    "Then there's Mapquest, which features a gasoline icon that you can tap to see prices in your area.",
    "Distribution/marketing expenses accounted for 16%, refining added 14% and taxes contributed 15%.",
    "The U.S. also is the top crude-oil consumer, at 20%, followed by China, India, Japan and Russia.",
    "California, in the Los Angeles suburb of Carson, has the largest refinery west of Texas.",
    "You can take advantage of this service whether or not you're a customer of the insurer.",
    "Middlemen including refineries also have increased their profit margins, the EIA added.",
    "Arizona is flanked by four top-10 states in New Mexico, California, Colorado and Utah.",
    "That's the highest recorded average price on record for the state, according to AAA.",
    "Geico.com is another source, with their search for \"local gas prices.\"",
    "Other high-production states include Oklahoma, California and Wyoming.",
    "Very possibly, at least over the next few weeks or couple of months.",
    "Crude accounts for more than half of the typical price at the pump.",
    "Arizona didn't have any refineries, based on this 2021 tally.",
    "In California, it's a national high of 68 cents a gallon.",
    "Are these the highest gas prices or could costs rise?",
    "Reach the reporter at russ.wiles@arizonarepublic.com.",
    "How do gas and diesel prices relate to oil costs?",
    "Where does the world get its oil besides Russia?",
    "3 producer behind the U.S. and Saudi Arabia.",
    "How many oil refineries are in the U.S.?",
    "Why are gas prices going up in 2022?",
    "Subscribe to azcentral.com today.",
    "Have producers increased output?",
    "Does Arizona produce any oil?",
    "Support local journalism.",
    "Yes."
  ]
}