{
  "id": 1543,
  "mediaId": 2677,
  "date": "2022-02-17",
  "headline": "Senate passes stopgap measure to avert weekend shutdown",
  "image": "https://www.mercurynews.com/wp-content/uploads/2022/02/sjm-nding_94266404.jpg?w=1024&h=683",
  "link": "https://www.mercurynews.com/2022/02/17/senate-passes-stopgap-measure-to-avert-weekend-shutdown/",
  "mediaOutlet": "San Jose Mercury News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "CNN.com Wire Service",
  "authorUrl": "https://www.mercurynews.com/author/cnn-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Luján tweeted on Thursday that he is now completing his recovery in DC and said, “I’m back at work and will return to the Senate floor soon.”\nA similar scenario played out back in December, but the standoff ended with an agreement to hold votes on an earlier stopgap bill as well as a GOP amendment to prohibit the use of federal funding for Covid-19 vaccine mandates, which ultimately failed.",
    "He said that Republicans wanted votes on amendments dealing with vaccine mandates and preventing the federal government from funding the distribution of crack pipes, something the administration denies is happening, but that nevertheless has raised bipartisan concerns.",
    "By Clare Foran, Ted Barrett and Ali Zaslav | CNN\nThe Senate voted on Thursday to pass a stopgap bill to avert a shutdown at the end of the week ahead of a looming Friday deadline when government funding has been set to expire.",
    "Lawmakers are also working to lock in a broader full-year spending package, but have said they need more time to finish and, as a result, needed a short-term funding extension to avert a shutdown at the end of the week.",
    "Senate Republican Whip John Thune of South Dakota said on Wednesday afternoon that bipartisan negotiators were closing in on an agreement over how to process a series of amendments to the funding bill.",
    "Pressed on whether the White House had received any assurances that a shutdown would be avoided, she said it was “clearly a priority for us to make sure that there is not a government shutdown.”",
    "In the Senate, Republican demands and Democratic absences threatened to complicate the effort to lock in a final and bring action down to the wire as the February 18 funding deadline neared.",
    "The House of Representatives voted last week on a bipartisan basis to approve the measure, known as a continuing resolution or CR for short, to extend funding through March 11.",
    "But leaders from both parties projected confidence there would not be a shutdown and ultimately a final vote to pass the measure went forward Thursday evening.",
    "And that’s our path — is to avert a government shutdown,” principal deputy press secretary Karine Jean-Pierre said Thursday.",
    "Now that the Senate has passed the measure it can be sent to President Joe Biden’s desk to be signed into law.",
    "Feinstein’s husband is ill, which is why she missed votes, according to a source familiar with the situation.",
    "The White House on Thursday said it is in “constant communication” with Capitol Hill on government funding.",
    "Sen. Mark Kelly of Arizona was out because his wife, former congresswoman Gabby Giffords, is sick.",
    "“There is still a path, if the Democrats are willing, to get this done,” Thune told reporters.",
    "One Republican senator, Lindsey Graham of South Carolina, is away also, traveling abroad.",
    "Sen. Ben Ray Luján of New Mexico is still away after he had a stroke and is recovering.",
    "“We work closely with the Senate and with Congress, in general.",
    "And 88-year-old Sen. Dianne Feinstein missed votes Wednesday.",
    "Feinstein is not expected to return to the Senate this week."
  ]
}