{
  "id": 15583,
  "mediaId": 8350,
  "date": "2022-03-11",
  "headline": "US Sen. Mark Kelly of Arizona introduces bill to create rural prosperity office",
  "image": "https://ktar.com/wp-content/uploads/2022/03/rural-living-pixabay.jpg",
  "link": "https://ktar.com/story/4942525/us-sen-mark-kelly-of-arizona-introduces-bill-to-create-rural-prosperity-office/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KEVIN STONE",
  "authorUrl": "https://ktar.com/story/author/kstone/",
  "termIds": [
    2459,
    1465,
    392,
    5949,
    6515
  ],
  "sentences": [
    "“Our bipartisan legislation creates a one-stop-shop for Arizona’s rural communities to get the support to create good-paying jobs, get students the skills they need, and invest in their communities.”\nThe Senate bill is cosponsored by two Republicans and a Democrat.",
    "“Rural communities face different challenges and opportunities when it comes to economic development, but too often face a web of red tape and bureaucracy when it comes to federal programs,” Kelly said in a press release.",
    "Democratic U.S. Rep. Tom O’Halleran, who represents Arizona’s sprawling rural 1st Congressional District, cosponsored a companion bill introduced in the House on Wednesday by Rep. Angie Craig (D-Minnesota).",
    "The legislation would established the Office of Rural Prosperity to coordinate federal support for housing, education, health care, small business development and job creation in rural areas.",
    "PHOENIX – Democratic U.S. Sen. Mark Kelly of Arizona introduced a bipartisan bill Thursday that would create a White House office tasked with promoting rural prosperity nationwide.",
    "The legislation has been assigned to the Senate Homeland Security and Governmental Affairs Committee and the House Agriculture Committee.",
    "“Time and time again, we’ve seen the federal government overlook and undervalue rural America,” O’Halleran said in a press release.",
    "The House version is cosponsored by three Democrats, including O’Halleran, and two Republicans."
  ]
}