{
  "id": 15633,
  "mediaId": 8416,
  "date": "2022-03-06",
  "headline": "Yavapai Republican Men’s Forum – Meet Your 2022 Candidates",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/03/06/yavapai-republican-mens-forum-meet-your-2022-candidates-3/?utm_source=rss&utm_medium=rss&utm_campaign=yavapai-republican-mens-forum-meet-your-2022-candidates-3",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Stringer",
  "authorUrl": "https://prescottenews.com",
  "termIds": [
    2459,
    2222,
    4896,
    5678,
    3401,
    392,
    1126,
    6536,
    5949
  ],
  "sentences": [
    "Accomplishments at the Commission include:\nRestoring water service to a local community that had their water removed arbitrarily and capriciously by the local utility\nHelping a customer who was discriminated against by a utility with her formal complaint, and ultimate settlement with the utility\nInitiating a groundbreaking effort within the state of Arizona that culminated in getting an interim manager installed into a Class A utility that had been abusing customers and ratepayer money for over 20 years; ultimately leading to the sale of the utility to a reputable water company\nValues and Examples:\nKnow the Position: Currently a Policy Advisor to Commissioner Justin Olson.",
    "Other speakers include former Arizona Attorney General Tom Horne, who is running for Superintendent of Public Instruction, former LD1 Representative Noel Campbell, who is running for the state senate seat being vacated by Senate President Karen Fann, and Nick Myers who is running for the Arizona Corporation Commission.",
    "I am the only candidate for this office with a lifetime of service to my country and community, plus a legislative track record of getting things accomplished for my constituents.”\nNick Myers – Candidate for Arizona Corporation Commission\nMost importantly, I am a husband and a father.",
    "Limited Government: Advocated for legislative bills HB2248 and HB2737, limiting the power of the Commission\nLow and Fair Utility Rates: Research issues and guide policy at the commission to limit the amount and number of subsidies and mandates issued by the Commission.",
    "Tom Horne – Candidate for Arizona State Superintendent of Public Instruction\nTom Horne, former State Superintendent (2003 -2011) and former State Attorney General (2011-2015), has become upset over the problems in education that have developed since he left office.",
    "He decided to run for State Superintendent again to end critical race theory instruction, as he did before, improve achievement, as he did before, and force schools to teach English to immigrant children, in accordance with the law, as he also did before.",
    "After years as a prosecutor at the local, state, and federal levels, including serving as Assistant United States Attorney and Director of the Arizona Department of Gaming, he took on the challenge of restoring trust in the office of Attorney General.",
    "Additionally, Campbell served as a volunteer helicopter gunship pilot in Vietnam, as a U.S. Customs special agent fighting the drug cartels in Mexico and Central & South America, and later as a tanker pilot fighting forest fires in the SW and Alaska.",
    "He has fought for consumers against corporate fraud, stood up to APS and the Arizona Board of Regents, relieved burdensome regulations to help businesses and encourage innovation, protected religious freedom, and defended life.",
    "Long time Prescott resident, Noel Campbell, represented LD1 in the state legislature from 2014 to 2020, where he established a strong conservative record and chaired the House Transportation Committee.",
    "He enforced the mandate to teach immigrant children English through immersion instruction, instead of bilingual education, raising the students’ yearly rate of English proficiency from 4 to 29 percent.",
    "During Tom’s last year in office as Superintendent, Arizona students performed above the national average on the Scholastic Aptitude Test in all three categories: critical reading, writing and math.",
    "By proving himself serious about taking over Roosevelt district schools due to low achievement, he motivated those schools to improve their instruction so drastic action was no longer necessary.",
    "The Yavapai Republican Men’s Forum will continue their candidate series at their next monthly luncheon on Monday, March 14th, at the Prescott Vibes Event Center, 6200 Hwy 89 (see map at bottom).",
    "He personally represented Arizona before the US Supreme Court on a number of occasions, including the defense of Arizona’s landmark immigration law, SB1070, key portions of which were upheld.",
    "Since this is a new policy, we are allowing non-members to attend two luncheons during 2022, after which they must become a YRMF member or they will denied attendance at any future luncheons.",
    "Brnovich has argued at the United States Supreme Court, to defend Arizona’s election integrity laws, including its requirements for in-precinct voting and restrictions on ballot harvesting.",
    "After sitting out the 2020 election, he is now seeking to return to the legislature to tackle what he terms “unfinished business” and to serve as a “firewall” against government overreach.",
    "Transparency and Accountability: Currently working with commission staff to revamp the Commission website to make it more user friendly and to show voting records of Commissioners.",
    "He recently spent six years in the AZ House of Representatives where he earned numerous legislative awards protecting pro-family, pro-gun, small business, and anti-tax groups.",
    "We are moving to a Members-Only organization in fairness to our members who do pay yearly dues and support the cause and purpose of the Yavapai Republican Men’s Forum.",
    "We need strong state legislators to act as a firewall against government overreach.” Noel continued, “I spent my entire life fighting to make this Nation better.",
    "Constantly fighting to limit the amount of Post Test Year Plant and helping guide amendments to keep the Rate of Return as low as possible for the ratepayers.",
    "Regarding the latter case, the justices reversed the Ninth Circuit Court unanimously, with agreement from the liberal justices as well as the conservatives.",
    "Most important, Tom Horne has the backbone to go after AZ Superintendent Kathy Hoffman for ignoring the parents and forcing her ideology on the children.",
    "Attorney General Mark Brnovich is seeking the Republican nomination for the US Senate to challenge incumbent Democrat and Biden supporter, Mark Kelly.",
    "Prevent Government Abuse: Contributing to possible modifications to the Commission code of ethics preventing clean elections from being weaponized.",
    "In 2003 he was elected Superintendent of Public Instruction where he served two terms and presided over a dramatic expansion in school choice.",
    "Campbell stated, “My decision to run is based on the simple fact I woke up one day and didn’t recognize the country I served my entire life.",
    "He attended ASU for his undergraduate degree, and then went on to receive his law degree from the University of San Diego School of Law.",
    "He played a key role in securing funding for local transportation projects including new lanes on I-17 and the widening of Highway 69.",
    "Born and raised in Arizona, Mark Brnovich took full advantage of the opportunities his parents fled the former Yugoslavia to give him.",
    "As Attorney General, he argued two cases before the U.S. Supreme Court: one on election integrity; the other, on capital punishment.",
    "Mark Brnovich – Candidate for US Senate\nBrnovich (burn-uh-vich) is the son of immigrants who fled communism in search of freedom.",
    "Brnovich is now challenging the Biden Administration’s violations of federal immigration laws and the crisis they have created.",
    "Noel Campbell- Candidate for Arizona State Senate\nNoel Campbell’s entire life embodies service to our country and community.",
    "Also we are anticipating greater participation from membership and the ability to attract a wider range of guest speakers.",
    "This month’s buffet lunch is: Oven Roasted Turkey w/ Mashed Potatoes, Steamed Vegetables, Salad, Dinner Roll and Desert.",
    "He is also an advocate of higher academic standards and a stronger voice for parents in the education of their children.",
    "He will discuss his legislative priorities and the importance of returning the Arizona senate seat to Republican hands.",
    "Tom’s friends think he is going backwards by running for Superintendent again after having served as Attorney General.",
    "His top priorities include election integrity, border security, expanding school choice, and transportation issues.",
    "Mr. Horne began public service with his election to the Paradise Valley School Board, where he served for 24 years.",
    "The centerpiece of his campaign for Arizona’s top education position is his opposition to Critical Race Theory.",
    "His time as Attorney General has been marked by an unflinching commitment to doing what is right for Arizonans.",
    "As Attorney General, Brnovich has been successful in restoring trust in the state’s office of Attorney General.",
    "Brnovich and his wife Susan live in Phoenix with their two daughters in the same neighborhood where he grew up.",
    "I understand first-hand the trials and tribulations of dealing with the Commission from a ratepayer viewpoint.",
    "This experience places me in a unique position to fight for people like you, the customers of the utilities.",
    "His administration has also been instrumental in battling human trafficking and supporting border security.",
    "I have spent the last five years interacting with the Arizona Corporation Commission (ACC or Commission).",
    "As Superintendent, Tom Horne took Horne vs. Flores all the way to the U.S. Supreme Court in 2009 and won.",
    "The deadline for reservations for the March 14th luncheon is Wednesday, March 9th, and can be made HERE.",
    "Arizona needs a commissioner that will keep the Commission on-track and focused primarily on this task.",
    "However, he considers the biggest problems to be in our schools so that is what he wants to work on.",
    "Why I’m Running: Arizonans need someone that is willing to stand up for them now, and in the future.",
    "The ACC has ONE JOB as defined by the constitution, to set “just and reasonable rates and charges”.",
    "Tom Horne worked with the legislature to outlaw the Tucson “ethnic studies” program based on CRT.",
    "Brnovich began his career as a prosecutor and served as a JAG officer in the Army National Guard.",
    "If you are a non-member, these events are only open to registered Republicans—women and men.",
    "In 2014, Mark Brnovich won a highly contested race against the incumbent Attorney General.",
    "The first 4 years were spent working to remedy decades of water issues for my community.",
    "Tom Horne is one of the most distinguished public servants in the history of our state.",
    "Someone who will look out for their best interests proactively instead of reactively.",
    "We have three daughters and have run a family business together for almost a decade.",
    "Lunch is $25 per reservation payable at the door by check or cash (no credit cards).",
    "Starting in 2022, YRMF Luncheons are transitioning to Members-Only events.",
    "Their monthly luncheons are open to the public on a space available basis.",
    "We Arizonans have not experienced statistics like that in recent years.",
    "From 1997 to 2001 he served in the Arizona House of Representatives.",
    "I have been married to my lovely wife, Katerina, for over 18 years.",
    "Membership info and application form can be found by clicking HERE.",
    "The SAT is a national test that cannot be manipulated by states.",
    "The Yavapai Republican Men’s Forum is a membership organization.",
    "From 2012 to 2016 he served as Arizona’s 25th Attorney General.",
    "And I want to continue fighting for the people of LD-1.",
    "The March lineup of candidates is particularly strong.",
    "He was re-elected to a second term in November 2018.",
    "My on-the-job training has already started!",
    "The cost is $25 and an RSVP is required.",
    "The event starts promptly at 11:30am.",
    "Prescott Vibes Events Center Map",
    "An RSVP is required.",
    "Parking is free."
  ]
}