{
  "id": 1563,
  "mediaId": 2627,
  "date": "2022-02-16",
  "headline": "Democrats find a tax their GOP colleagues want to leave intact",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220216-MB-GOP-Dems-Gas-Tax-jg-ef4825.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/democrats-find-tax-gop-colleagues-want-leave-intact-rcna16484",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    0
  ],
  "sentences": [
    "Indeed, it seems likely that voters will be hearing this message quite a bit from these Democrats in the coming months: As public concerns over inflation grow, vulnerable Senate incumbents will say they’re at least making tangible efforts to give consumers a break.",
    "Some senior officials also fear the policy might be difficult to end later, since no politician would want to be seen as raising prices, according to two people familiar with the matter who spoke on the condition of anonymity to describe the internal discussions.",
    "In fact, economists and energy policy analysts agreed that a gas tax “holiday” may have superficial appeal, but it wouldn’t make much of a difference at the pump, and it might even encourage more consumption, which would ultimately drive prices higher.",
    "But they ran into swift opposition Tuesday from Republicans who blasted the proposal as election-year politics aimed at shoring up at-risk Democrats who are encountering growing pressure from voters to address high energy costs and rising inflation.",
    "As a growing number of Democrats rally behind the idea, Senate Minority Whip John Thune conceded yesterday that he “can’t see that scenario” in which Republicans agree to a suspension of the 18.4 cents-per-gallon gas tax until the end of the year.",
    "It was against this backdrop that then-presidential-candidates Hillary Clinton and John McCain added a new idea to their campaign platforms: The then-senators called for a suspension of the federal gas tax.",
    "Behind the scenes, top aides [in the Biden administration] have debated whether it would provide meaningful relief — or ultimately serve to benefit the producers of gas more than the consumers of it.",
    "NBC News reported yesterday:\nSen. Mark Kelly of Arizona and a handful of other Democrats facing tough re-election bids are pitching a plan to suspend the federal gas tax through the end of the year.",
    "Ultimately, the tax wasn’t suspended, and it didn’t much matter: The economic downturn that began in December 2007 intensified; the Great Recession began; and gas prices collapsed.",
    "Recommended\nBut as a political matter, we’re faced with an unusual dynamic: Many Democrats want to suspend a federal tax, while Republicans want to leave it intact.",
    "Barack Obama took the opposite position, making the case that the suspension was a gimmick that sounded nice, but which wouldn’t make much of a difference.",
    "Today’s national average of $3.51 per gallon certainly seems high, but 14 years ago, it cost consumers quite a bit more to fill up their tanks.",
    "A Washington Post report added yesterday:\nFor now, the White House has not offered any official, explicit endorsement of the policy.",
    "And since the federal gas tax finances infrastructure projects, suspending the tax, even temporarily, would require related fixes.",
    "“The easiest thing in the world for a politician to do is tell you exactly what you want to hear,” Obama said in April 2008.",
    "Fourteen years later, gas prices aren’t as high as they were then, but the debate has made a fierce comeback.",
    "By June 2008, the national average reached $4.10 per gallon — which is roughly $5.27 in today’s dollars.",
    "(If you’ve been reading me for ages, you may recall that I agreed with Obama at the time.)",
    "As a legislative matter, the fight appears to be effectively over before it starts.",
    "In the spring and summer of 2008, gas prices became a major national issue.",
    "This, however, isn't the solution Democrats are looking for.",
    "The desperation for solutions is understandable.",
    "But that doesn’t make this a good idea.",
    "The political debate moved on.",
    "The then-senator had a point."
  ]
}