{
  "id": 15775,
  "mediaId": 2556,
  "date": "2022-03-12",
  "headline": "SXSW Review: ‘Gabby Giffords Won’t Back Down’: Inspiring Docu Of Heroic Congresswoman Fighting For Gun Control After Near Fatal Shooting",
  "image": "https://deadline.com/wp-content/uploads/2022/03/gabby.jpg?w=1024",
  "link": "https://deadline.com/2022/03/sxsw-review-gabby-giffords-wont-back-down-inspiring-1234976585/",
  "mediaOutlet": "Deadline",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "At its center is remarkable footage that Kelly facilitated as a way to chart her progress from a state in which her brain injury prevented her from even talking or walking, actually being unrecognizable after dangerous surgery, to slow, very slow progress, and now a decade later a leader in the continuing , if seemingly hopeless fight against gun lobbies and a Republican congress and Senate that resist any attempts to strengthen gun laws.",
    "The docu from filmmakers Betsy West and Julie Cohen (RBG, Julia) manages to take this horrendous tragedy and somehow turn it, and Giffords’ courageous journey back to life and family and purpose, into a truly inspiring movie that also serves as a call to action for sensible gun control with Giffords leading the fight.",
    "Having its premiere today at SXSW, this CNN Films theatrical documentary Gabby Giffords Won’t Back Down is a truly inspirational offering an almost verite kind of fly-on-the-wall account of what can only be termed as a comeback story like no other.",
    "We also get the backstories of some of the victims who didn’t survive, as well as stirring interviews from the likes former President Barack Obama who flew to Arizona to comfort family members of all affected that horrible day in 2011.",
    "What is a gift to these filmmakers is the availability of all this verite footage featuring Giffords in the hospital and elsewhere on the mend and with Kelly and others willing her back to life in tiny increments.",
    "Her own story is augmented by sections involving the aftermath of other gun tragedies, none more heart wrenching than Sandy Hook which is also given much attention in this exceptional film from West and Cohen.",
    "In 2011 Giffords, an Arizona congresswoman and rising star in the Democratic party had the wind at her back with talk of possibly a Senate or Governor run in the future, even maybe a Presidential one.",
    "We also see footage of her emotional return to the U.S. Capitol and the applause of all her colleagues, as well as that determination to make a difference in the fight for gun control.",
    "In addition to the post-shooting, we see this incredible public servant as she came up in the ranks, from her childhood to her work as a TV pitchman leading to her run for office.",
    "When you see someone this bright and promising, and realize the random barrel of a gun could take it all away, it becomes enormously frustrating to say the least.",
    "She was married to astronaut Mark Kelly, and was even looking at adding a new addtion to their family which included his two daughters from a previous marriage.",
    "It is on so many levels, but first and foremost a very human one with a woman who has become the face, or at least one of them, of a movement.",
    "What is also hopeful here is that all was not lost, and Kelly himself became that Senate candidate and won in 2020 with Gabby by his side.",
    "That report was erroneous and in fact doctors told Kelly that she likely would survive, but in what condition they couldn’t say.",
    "Then it all came crashing down when at a campaign event, she and several others attending were felled by a gunman run amok.",
    "Several died that day including a 12 year old girl who was interested in civic studies and tagged along to the rally.",
    "Giffords herself took a single bullet to the head and was actually reported by media as having died.",
    "Subscribe to Deadline Breaking News Alerts and keep your inbox happy.",
    "Did I say inspiring?",
    "1 Comment"
  ]
}