{
  "id": 15964,
  "mediaId": 2859,
  "date": "2022-03-09",
  "headline": "First lady Jill Biden just made a trip out West. Here’s what she said",
  "image": "https://deseret.brightspotcdn.com/dims4/default/6d28417/2147483647/strip/true/crop/1024x585+0+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FRFMv4SPP8d4Axfaxn-oizSsH0R0%3D%2F0x0%3A1024x691%2F1024x691%2Ffilters%3Afocal%28516x176%3A517x177%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F23302336%2FAP22067809339974.jpeg",
  "link": "https://www.deseret.com/2022/3/9/22968970/first-lady-flotus-jill-biden-arizona-trip",
  "mediaOutlet": "Deseret News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "D. Hunter Schwarz",
  "authorUrl": "https://www.deseret.com/authors/hunter-schwarz",
  "termIds": [
    0
  ],
  "sentences": [
    "“The Biden administration is failing on the most important issues in Arizona right now, like record-high gas prices, skyrocketing inflation and the historic border crisis.”\nFirst ladies have been powerful surrogates for their husbands and husbands’ parties before, and Biden’s role this year could be especially important for Democrats this year should her husband’s low approval rating continue.",
    "It’s something that I think our son would want us to do.”\nWhile Biden’s trip out West wasn’t a campaign stop to stump for candidates, she did promote her husband’s record in two states that could both play a crucial role in deciding control of Congress in this year’s midterms.",
    "In Arizona, the first lady toured Intel’s Ocotillo Campus in Chandler, which partnered with local Maricopa County community colleges to provide workforce training programs paid for by the American Rescue Plan Act President Joe Biden signed last year.",
    "“Jill Biden’s visit does nothing to address the real issues facing Arizonans, who are paying $500 more per month in household costs because of inflation,” RNC Arizona communications director Ben Petersen told the Arizona Republic.",
    "During her visit to Arizona on Monday and Tuesday and Nevada on Wednesday, Biden promoted her husband’s record and “building a better America” plan outlined during the State of the Union address to fight inflation.",
    "The nonpartisan Cook Political Report rated Arizona and Nevada’s U.S. Senate races both as toss-ups, where incumbent Sen. Mark Kelly, D-Ariz., and Sen. Catherine Cortez Masto, D-Nev., are defending their seats.",
    "While her school is on spring break, first lady Jill Biden spent three days out West in a pair of battleground states her husband won in 2020 to draw attention to issues like job training and health care.",
    "She also toured the San Xavier Health Center on the Tohono O’odham Nation near Tucson to learn about cancer services and health care challenges tribal nation members face.",
    "Biden, who teaches English at Northern Virginia Community College, is the first first lady in U.S. history to have a full-time job while in the White House.",
    "“It’s my spring break and I’m in a community college!” Biden said Wednesday while speaking at Truckee Meadows Community College in Reno, Nevada.",
    "Biden promoted the Cancer Moonshot there, the administration’s initiative to reduce the cancer death rate by at least 50% in 25 years.",
    "In Reno, she played cheerleader, saying her husband was prepared to bring allies together to respond to Russia’s invasion of Ukraine.",
    "“Joe has such experience and wisdom to lead America and bring these NATO countries together,” she said, according to KRNV.",
    "“We lost our son to cancer and so one of the things that Joe and I decided to do was find purpose in that loss.",
    "She said it is personal to her and her husband because their son Beau died from brain cancer in 2015 at age 46.",
    "In the House, three seats in Nevada and two in Arizona could also potentially be competitive.",
    "Biden departed Nevada on Wednesday for Kentucky, and classes resume at her school on Monday.",
    "“This is really personal for me and Joe,” Biden said."
  ]
}