{
  "id": 15984,
  "mediaId": 3986,
  "date": "2022-03-11",
  "headline": "Russia threatens to abandon US astronaut on space station",
  "image": "https://americanmilitarynews.com/wp-content/uploads/1024px-International_Space_Station_after_undocking_of_STS-132.jpg",
  "link": "https://americanmilitarynews.com/2022/03/russia-threatens-to-abandon-us-astronaut-on-space-station/",
  "mediaOutlet": "americanmilitarynews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Morgan",
  "authorUrl": "https://americanmilitarynews.com/author/staff-writer-15/",
  "termIds": [
    0
  ],
  "sentences": [
    "RIA Novosti reported, “The Roscosmos television studio jokingly demonstrated the possibility of Russia withdrawing from the ISS project—the undocking of the Russian segment of the station, without which the American part of the project cannot exist.”\nThe video came days after Roscosmos Director General Dmitry Rogozin posted another video on Feb. 26 in which he threatened to leave Vande Hei at the station and detach Russia’s section.",
    "In a translated tweet, Rogozin said, “The launchers at Baikonur decided that without the flags of some countries, our rocket would look more beautiful.”\nFormer NASA astronaut Scott Kelly, the twin brother and fellow astronaut of Sen. Mark Kelly (D-AZ) responded to Rogozin with his own Russian tweet, “Dimon, without those flags and the foreign exchange they bring in, your space program won’t be worth a damn.",
    "Maybe you can find a job at McDonald’s if McDonald’s still exists in Russia.”\n“It kind of enraged me that the country that we had been in this international partnership for 20 years would take the time to make a video to threaten to leave behind one of the crew members they are responsible for,” Kelly told the Wall Street Journal in an interview Thursday.",
    "The threat of Russia withdrawing support for ISS missions and leaving Americans in space is particularly concerning as the U.S. and other countries have relied on Russian rockets to travel to the space station ever since the U.S. discontinued its space shuttle program in 2011.",
    "In February, Roscosmos Rogozin shared a series of comments suggesting Russian astronauts could leave ISS and that, without their participation, the space station could crash back down to earth because Russia controls the orbital correction and collision avoidance systems.",
    "On Saturday, the Russian state media outlet RIA Novosti shared a video, reportedly published by the Russian space agency Roscosmos, depicting Russian cosmonauts waving goodbye to a lone American astronaut, Mark Vande Hei, and detaching the Russian section of ISS.",
    "The Wall Street Journal reported the current occupants on ISS include, Russian Roscosmos cosmonauts Anton Shkaplerov and Pyotr Dubrov; European Space Agency astronaut Matthias Maurer; and NASA astronauts Raja Chari, Thomas Marshburn, Kayla Barron and Vande Hei.",
    "For me, that kind of just crossed the line.”\nKelly also told ABC News that he has trusted Russian cosmonauts in the past with his life and hoped Russia would maintain its role in ISS despite tensions between the U.S. and Russia on earth.",
    "Wayne Hale, former program manager of NASA’s Space Shuttle and a member of NASA’s Advisory Council, told the Verge that the possibility of ISS crashing back to earth is real, but likely wouldn’t happen immediately.",
    "On Sunday, Rogozin also shared a video of Roscosmos employees covering the American flag and flags of other nations that have criticized Russia, from the Baikonur Cosmodrome.",
    "“I think one of the biggest successes of the International Space Station is the international aspect of giving us something to work on together, that makes us friends.”",
    "“I just hope people realize and want to keep this partnership together because it is one of the few things that unites all of humanity together,” Kelly said.",
    "Russia recently threatened that its cosmonauts aboard the International Space Station (ISS) could leave a U.S. astronaut without a ride home.",
    "Vande Hei is already scheduled to leave ISS in about three weeks and land in Kazakhstan along with Shkaplerov and Dubrov, ABC News reported.",
    "“If you block cooperation with us, who will save the ISS from an uncontrolled de-orbit and fall into the United States or Europe?",
    "The video is not the only time Russian space officials have alluded to ending cooperation with international partners in space.",
    "The cosmodrome in Kazakhstan is leased to the Russian government and is used to launch international astronauts up to ISS.",
    "The video is comprised partially of historic ISS footage and a CGI animation of the Russian section separating from ISS.",
    "The video depicting Vande Hei staying on board insinuates Russia’s cosmonauts may try to depart without him.",
    "The ISS does not fly over Russia, so all the risks are yours,” Rogozin said in a translated Feb. 24 tweet.",
    "“They agreed to be responsible for his safety, getting him to the space station and getting him home.",
    "There is also the option of dropping a 500-ton structure to India and China.",
    "The video has since been shared on social media sites like Twitter.",
    "“It’s not like a week, it’ll probably be several years,” Hale said.",
    "Do you want to threaten them with such a prospect?"
  ]
}