{
  "id": 15993,
  "mediaId": 2640,
  "date": "2022-03-10",
  "headline": "We Could Get a 'Gas Tax Holiday'",
  "image": "https://img2-azrcdn.newser.com/image/1402615-12-20220406092012.jpeg",
  "link": "https://www.newser.com/story/317906/we-could-get-a-gas-tax-holiday.html",
  "mediaOutlet": "newser.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arden Dier",
  "authorUrl": "https://www.newser.com/bio/83590798/arden-dier.html",
  "termIds": [
    0
  ],
  "sentences": [
    "(Newser) – With gas prices at their highest in years—an average of $4.318 per gallon in the US as of Thursday—and expected to climb higher, some lawmakers are calling on President Biden to back the suspension of a federal gas tax to ease the financial burden.",
    "A bill to suspend Michigan's 27.2-cents-per-gallon excise tax from April through until September at a cost of $725 million has passed the Republican House and is expected to pass the Senate next week, per the Detroit News.",
    "Pending legislation in the House and Senate would offset lost revenue \"by transferring an equal amount of general fund dollars to the accounts that fund state highway and public transit programs,\" per the AP.",
    "White House discussions: The Biden administration has been discussing the pros and cons of such a move for weeks, with some officials arguing it wouldn't be of much help to consumers, per the Journal.",
    "Maggie Hassan of New Hampshire and Mark Kelly of Arizona (both are Democrats in tough re-election fights) are urging the Biden administration to back the suspension, reports the Wall Street Journal.",
    "Alternatives: Officials are also discussing more releases from government oil reserves and strategies to make Europe less dependent on Russian oil while pushing other countries to boost production.",
    "\"The tax on gas contributes the majority of money to federal highway funding of bridges and road construction\" and its removal will lead to more deficit spending, he tells the Tribune-Review.",
    "The nonprofit Committee for a Responsible Federal Budget has predicted the move would cost the government $20 billion in funding for roads—\"a priority of Mr. Biden's,\" per the Journal.",
    "A federal \"gas tax holiday\" would mean Americans save 18.4 cents per gallon for the rest of 2022, a stretch in which gas prices are expected to remain above $4 on average, per the AP.",
    "States take action: States including Pennsylvania, Missouri, Maryland, Minnesota, New York, and Ohio are considering suspending or slashing state gas taxes, per the AP.",
    "Conspiracy theorists' view: All this has led to unfounded speculation that the Biden administration wants gas prices to climb so as to boost sales of electric vehicles.",
    "\"A federal gas tax holiday is a tool in the toolbox to reduce costs for Americans,\" the governors write in a joint letter, per the Pittsburgh Tribune-Review.",
    "And the Democratic governors of Colorado, Michigan, Minnesota, New Mexico, Pennsylvania, and Wisconsin have made the same request of congressional leaders.",
    "As the AP feels compelled to explain, \"electric vehicles work similarly to gas-powered ones; the government cannot shut down individual vehicles at will.\"",
    "Some Republicans are requesting an expansion of US oil and natural-gas production, but the White House says companies already have unused federal leases.",
    "Brian Kemp says he plans to authorize suspension of the state's 28.7-cents-per-gallon excise tax through until the end of May, per Fox News.",
    "Some critics fear that oil companies, which Biden has warned against price gouging, would raise pretax prices in response.",
    "No thanks: Ulrik Boesen, a senior policy adviser at the Tax Foundation think tank, is not a fan of the idea.",
    "Even if Biden does back the suspension, the measure would likely require bipartisan support in Congress.",
    "Some even claim government officials can stop these vehicles from driving whenever they want.",
    "In turn, more deficit spending would likely \"increase the nation's inflationary pressures.\"",
    "The cost: There are concerns from both parties about lost infrastructure funding.",
    "More on the talk:\nGovernors' demand: Sens.",
    "(Read more gas prices stories.)",
    "GOP Georgia Gov."
  ]
}