{
  "id": 1643,
  "mediaId": 2701,
  "date": "2022-02-14",
  "headline": "In 2022, The Torch Will Be Passed Whether You Like It Or Not",
  "image": "https://thefederalist.com/wp-content/uploads/2022/02/8567869290_83793352f9_k.jpg",
  "link": "https://thefederalist.com/2022/02/14/in-2022-the-torch-will-be-passed-whether-you-like-it-or-not/?utm_source=rss&utm_medium=rss&utm_campaign=in-2022-the-torch-will-be-passed-whether-you-like-it-or-not",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Domenech",
  "authorUrl": "https://thefederalist.com/author/bdomenech/",
  "termIds": [
    0
  ],
  "sentences": [
    "This advancement of new blood, even within aged franchises, is one reason why the NFL stays fresh and innovative, why its 2021 season ended with such an amazing run of compelling, competitive games, and why it remains the most dominant sports, television, and common cultural force in America.",
    "That campaign culminated last weekend, when Romney called Hogan to vent about the RNC’s censure, tell him Senate Republicans needed anti-Trump reinforcements and argue that Hogan could have more of a platform in his effort to remake the party as a sitting senator rather than an ex-governor.",
    "But the message that he delivers privately now is unsparing, if debatable: Trump is losing political altitude and need not be feared in a primary, he has told Ducey in repeated phone calls, as the Senate leader’s lieutenants share polling data they argue proves it.",
    "McConnell’s recruiting failures in Maryland, New Hampshire, Georgia, and elsewhere indicate how unwilling he is to adapt to a changing conference, but also how tired his playbook comes across when trying to push politicians to join a Senate under his leadership.",
    "Awkwafina’s ad for Disney+ as having the most Goats was the most friendly wall-breaking acknowledgment of this — when she references Bart hassling Woody, she’s referencing characters from a show that premiered in 1989 and a movie that premiered in 1995.",
    "The New York Times’ Jonathan Martin pushed out one of his narrative-setting pieces yesterday, looking at the GOP’s Senate recruitment battles, and it contains an interesting insight into how our octogenarian leadership class can’t learn new tricks.",
    "This same week last year, a similar McConnell-focused piece was in the WSJ, explicitly comparing the current cycle to the Tea Party moment of 2009 and teased weighing into primaries to help ward off what I guess he’s calling “goofballs” these days.",
    "Even more pointedly, McConnell vowed that if Sen. John Thune of South Dakota, the second-ranking Senate Republican, faces the primary that Trump once promised, Thune “will crush whoever runs against him.” (The most threatening candidate, Gov.",
    "This is the nostalgia for what is now the largest generation in America — you want to share it with your kids now, if you’re a mature adult, or complain about the lack of collectible “Book of Boba Fett” action figures if you’re not.",
    "The loose alliance, which was once thought of as the GOP establishment, for months has been engaged in a high-stakes candidate recruitment campaign, full of phone calls, meetings, polling memos and promises of millions of dollars.",
    "There is nothing new under the sun, and Millennial nostalgia is likely to dominate our culture for decades past its end point in ways that Zoomers will complain about using forums Millennials don’t even recognize as existing.",
    "“We changed the business model in 2014 and have not had one of these goofballs nominated since,” he told a group of donors on a private conference call last year, according to a recording obtained by The New York Times.",
    "In Maryland, Hogan was plainly taken with the all-out push to recruit him, although he declined to take on Sen. Chris Van Hollen, a Democrat…\nMcConnell also dispatched Collins and Sen. Mitt Romney of Utah to lobby Gov.",
    "The three leading candidates vary in how much they are likely to be in favor of a more Trumpian agenda should they end up in the Senate — but the idea that any of the three will be McConnell acolytes seems absurd.",
    "If Sen. Lisa Murkowski of Alaska, who is an outspoken Trump antagonist running for Senate this fall, wins her primary, it will show that “endorsements from some people didn’t determine the outcome,” he said.",
    "But there’s a much more important aspect of what we saw going on in the Super Bowl: the Millennials aren’t just the most sizable generation now in terms of sheer numbers, spending power, and cultural drive.",
    "But McConnell has sometimes decided to pick his battles — in Georgia, he acceded to Herschel Walker, a former football star and Trump-backed candidate, after failing to recruit Perdue to rejoin the Senate.",
    "As Trump works to retain his hold on the Republican Party, elevating a slate of friendly candidates in midterm elections, McConnell and his allies are quietly, desperately maneuvering to try to thwart him.",
    "The sooner its leadership is filled with new blood who reflect this fact, the sooner it will have an impact on the nation that actually lines up with the priorities of the people who put them there.",
    "The Senate Republican leader has been worried that Trump will tap candidates too weak to win in the general election, the sort of nominees who cost the party control of the Senate in 2010 and 2012.",
    "It’s all aimed at recapturing the Senate majority, but the election also represents what could be Republicans’ last chance to reverse the spread of Trumpism before it fully consumes their party.",
    "Deploying Bush-era figures to convince post-Bush candidates to come in for the big win just won’t work, not on potential candidates who actually want a long and relevant future in the party.",
    "Yet a handful of formidable contenders have spurned McConnell’s entreaties, declining to subject themselves to Trump’s wrath all for the chance to head to a bitterly divided Washington.",
    "At a golf tournament luncheon, George W. Bush encouraged him to run against Sen. Mark Kelly, a Democrat, suggesting the Republican Party needs more figures like Ducey to step forward.",
    "You can focus on the halftime show and the plethora of ads playing off of nostalgia for late-Gen Xers and Millennials, with artists performing songs that dominated early-aughts radio.",
    "In conversations with senators and would-be senators, McConnell is blunt about the damage he believes Trump has done to the GOP, according to those who have spoken to him.",
    "“He’s made very clear that you’ve been there for Alaska, you’ve been there for the team, and I’m going to be there for you,” Murkowski said of McConnell’s message to her.",
    "The decisions in primaries in 2022 are likely to come down to a choice between Trumpian candidates and conservatives who have made peace with his popularity in the party.",
    "“You listen respectfully, and that’s what I did.”\nBush and a band of anti-Trump Republicans led by Sen. Mitch McConnell of Kentucky are hoping he does more than listen.",
    "The head coaches of the Vikings, Chargers, Eagles, Falcons, Browns, Packers, Cardinals, Broncos, and 49ers are all elder Millennials, with ages ranging from 36 to 42.",
    "But it is an insult to anyone’s intelligence who has been following politics for the past decade to think that we are going back to the old ways of doing things.",
    "“I’m very interested in changing the party, and that was the most effective argument,” said Hogan, who is believed to be considering a bid for the White House.",
    "Doug Ducey of Arizona, savaging him for refusing to overturn the state’s presidential results and vowing to oppose him should he run for the Senate this year.",
    "In an interview last week, he warded off questions about their conflict, avoiding mentioning Trump’s name even when it was obvious to whom he was referring.",
    "Compare this for a moment to the other powerful force in America — our decrepit political leadership that has learned nothing and forgotten nothing.",
    "The idea that at age 36, Sean McVay already has a “coaching tree” may sound ridiculous — but he does, and his opposing coach last night is in it.",
    "History doesn’t bode well for such behind-the-scene efforts to challenge Trump, and McConnell’s hard sell is so far yielding mixed results.",
    "Murkowski appears well-positioned at the moment, with over $4 million on hand while her Trump-backed rival, Kelly Tshibaka, has $630,000.",
    "Back to the ads: the movies and TV shows being promoted may be streamers, but the formulas are the same and the callbacks are obvious.",
    "You can focus on the two quarterbacks in the game, following a year that saw the retirements of Ben Roethlisberger and Tom Brady.",
    "They are young enough that they are now calling play action fakes for players they once did the same with on Madden dynasty mode.",
    "This crew of Republicans from the past who previously enjoyed relevance are still struggling to grasp how much it has changed.",
    "[…]\nMcConnell has been loath to discuss his recruitment campaign and even less forthcoming about his rivalry with Trump.",
    "“It’s something you have to feel a certain sense of humility about,” the governor said this month of Bush’s appeal.",
    "The former president has rallied behind fewer far-right candidates than initially feared by the party’s old guard.",
    "Larry Hogan of Maryland announced he would not run for Senate, despite a pressure campaign that involved his wife.",
    "Within the world of sports — where, unlike the world of politics, winning actually matters — they are in charge.",
    "Last night’s game featured two Millennial head coaches facing off against each other, both born in the 1980s.",
    "Ducey is expected to make a final decision soon, but he has repeatedly said he has little appetite for a bid.",
    "In early December, though, Ducey received a far friendlier message from another former Republican president.",
    "Chris Sununu passed on a bid after an aggressive campaign that also included lobbying from Bush.",
    "And the political risk in failing to do this is far higher than McConnell seems to think.",
    "Privately, he has declared he won’t let unelectable “goofballs” win Republican primaries.",
    "McConnell for years pushed Trump’s agenda and only rarely opposed him in public.",
    "Last night’s Super Bowl marked the end of an era and the beginning of a new one.",
    "Only the brightest minds saw how it was warping our nation’s very soul.",
    "For more than a year, former President Donald Trump has berated Gov.",
    "The Republican Party of old has passed in and out of rigor mortis.",
    "It’s hardly irritating, because at this point it’s so obvious.",
    "Remember how you loved “The Lord of The Rings” 20 years ago?",
    "He also came up empty-handed in New Hampshire, where Gov.",
    "The party has changed indeed, and quite obviously so.",
    "Grand Old dogs can and sometimes do learn new tricks.",
    "The situation in Missouri is a good example of this.",
    "They are the same age as their veteran players.",
    "Football marked the end of an era in 2022.",
    "And how is that working out for him?",
    "It cannot be raised from the dead.",
    "It’s a gritty reboot rated TV-MA!",
    "It’s back with diverse Hobbits!",
    "This is not an ageist insult.",
    "This is all to be expected.",
    "Kristi Noem, has declined.)",
    "Can I get a GIGLI 2 chant?",
    "Will our politics follow?",
    "Remember “Fresh Prince”?",
    "I thought it was great.",
    "There they are again!",
    "Not well at all.",
    "Last week, Gov.",
    "Remember J.",
    "Lo and Ben?",
    "Not well.",
    "Hogan."
  ]
}