{
  "id": 1670,
  "mediaId": 8450,
  "date": "2022-02-17",
  "headline": "Qué hará el gobierno de Biden para bajar el precio de la gasolina si la situación en Ucrania empeora",
  "image": "https://media.telemundoarizona.com/2022/02/GettyImages-1236549804.jpg?quality=85&strip=all&fit=1024%2C576",
  "link": "https://www.telemundoarizona.com/noticias/eeuu/gobierno-biden-precios-gasolina-rusia-ucrania/2203114/",
  "mediaOutlet": "telemundoarizona.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2459,
    2859,
    4591,
    4267,
    4905,
    392,
    6672
  ],
  "sentences": [
    "Jason Furman, exasesor de Obama, economista de la Universidad de Harvard y miembro principal del Instituto Peterson de Economía Internacional, dijo que la economía estadounidense se encuentra en un punto en el que puede soportar precios más altos del petróleo, aunque algunos bolsillos del país podrían verse afectados.",
    "El líder republicano del Senado, Mitch McConnell, critica al presidente por los precios más altos de la energía y los alimentos, y afirma que “el gobierno de Biden parece menos interesado en tratar de resolver este problema que en tratar de persuadir a las familias de que el dolor está solo en sus cabezas”.",
    "La secretaria de prensa de la Casa Blanca, Jen Psaki, dijo el miércoles que el coordinador de Medio Oriente del Consejo de Seguridad Nacional, Brett McGurk, y el enviado de energía del Departamento de Estado, Amos Hochstein, estaban en Riad el miércoles para reunirse con funcionarios saudíes.",
    "“Dado el mundo en el que estamos, cualquier aumento en los precios de las materias primas, incluso si es transitorio, incluso si la Reserva Federal generalmente trata de mirar más allá de los choques de oferta obvios al tomar sus decisiones, se suma al enigma de la política”, dijo.",
    "En una encuesta de diciembre de AP-NORC Center for Public Affairs Research, la mayoría de los estadounidenses, el 85%, dijeron que habían experimentado precios más altos de lo habitual tanto en comestibles como en gasolina en los últimos meses.",
    "El tira y afloja diplomático ha sacudido los mercados financieros y de materias primas a medida que los inversores intentan valorar lo que significaría un conflicto armado y las sanciones de Estados Unidos contra Rusia para la economía mundial.",
    "Los pronósticos de JPMorgan y otras firmas de inversión sugieren que el petróleo crudo, que ya está a alrededor de $95 por barril, podría superar los $125 por barril debido a la escasez de suministros, que se intensificaría con una invasión.",
    "Es un reconocimiento de los propios riesgos de Biden antes de las elecciones intermedias de 2022: la inflación se ha convertido en un lastre para los demócratas a pesar del fuerte crecimiento económico de la nación el año pasado.",
    "WASHINGTON DC — Con la continua amenaza de que Rusia invada Ucrania, una crisis de política exterior choca con una de las vulnerabilidades políticas del presidente Joe Biden: el aumento de los precios de la gasolina en el país.",
    "Y en una pregunta abierta sobre los principales temas en los que debe trabajar el gobierno, el 10% nombró los precios de la gasolina y los costos de la energía, una señal del desafío político al que se enfrenta Biden.",
    "Aunque la economía estadounidense en general puede absorber los precios más altos de la energía, las familias estadounidenses han visto fuertes aumentos en el precio de los alimentos, la energía y otros bienes.",
    "Los precios promedio fueron generalmente más altos de 2011 a 2014 durante la presidencia de Barack Obama y durante el segundo mandato de George W. Bush, según la Administración de Información de Energía.",
    "Los precios de la gasolina cayeron en las semanas posteriores a la liberación del petróleo, aunque desde entonces los precios han eclipsado los niveles en el momento en que Biden anunció la reducción.",
    "Los estadounidenses ya están consternados por la inflación en un máximo de 40 años, y Biden advierte que los precios de la gasolina podrían subir si el presidente ruso, Vladimir Putin, decide invadir.",
    "“Estamos preparados para desplegar todas las herramientas y la autoridad a nuestra disposición para brindar alivio en la bomba de gasolina”, declaró el martes el presidente de Estados Unidos.",
    "“Una cierta cantidad de lo que el presidente debería hacer es decirle a la gente que estos eventos pueden hacer subir los precios temporalmente y que los precios también volverán a bajar”.",
    "Biden quiere enfocarse en cómo la situación de Ucrania está contribuyendo a precios más altos de la gasolina, pero los costos en la bomba ya eran dramáticamente más altos que hace un año.",
    "Los senadores demócratas Mark Kelly de Arizona y Maggie Hassan de New Hampshire, ambos candidatos a la reelección, ya están pidiendo la suspensión del impuesto federal a la gasolina.",
    "A fines de noviembre, ordenó la liberación de un récord de 50 millones de barriles de petróleo de la reserva estratégica de EEUU para reducir las presiones sobre los precios.",
    "Furman dijo que la mejor elección que Biden podría hacer es lo que hizo el martes, advirtiendo al pueblo estadounidense que los precios podrían subir si ocurre una guerra.",
    "Para ver más de Telemundo, visita https://www.nbc.com/networks/telemundo\nLos republicanos ciertamente no le darán un pase a Biden debido a las tensiones en el extranjero.",
    "Suspender el impuesto federal de 18.4 centavos por galón no compensaría los aumentos de precios que se produjeron recientemente cuando Rusia amenazó a Ucrania.",
    "Los precios altos, de hecho, conducirían a más inversiones relacionadas con el petróleo que podrían causar que los precios eventualmente bajen.",
    "No quiso comentar si estaban presionando a los saudíes para que bombearan más petróleo para ayudar a estabilizar el mercado petrolero mundial.",
    "Biden no explicó el martes qué pasos adicionales tomaría su gobierno para reducir los precios del petróleo si la situación en Ucrania empeora.",
    "“Estamos tomando medidas activas para aliviar la presión sobre nuestros propios mercados energéticos y compensar el aumento de los precios”.",
    "El costo del petróleo crudo y la gasolina comenzó a subir durante el último mes cuando Putin reunió fuerzas en la frontera con Ucrania.",
    "“En lo que la gente se está enfocando es en lo que podemos hacer de inmediato”, dijo la senadora demócrata Debbie Stabenow de Michigan.",
    "La senadora republicana Lisa Murkowski de Alaska lo comparó con un \"subidón de azúcar\" único que podría desaparecer rápidamente.",
    "Los esfuerzos para persuadir a una mayor producción de petróleo en EEUU y en el extranjero han fracasado en gran medida.",
    "Los precios de la gasolina han subido casi un 40% desde hace un año y más del 6% durante el último mes, según AAA.",
    "Tampoco está claro si hay suficiente apoyo en el Senado para que avance una exención del impuesto a la gasolina.",
    "Y no hay garantía de que las empresas de energía transfieran todos los ahorros a los consumidores.",
    "“La gente necesita alivio en este momento, por lo que esta es una forma a corto plazo de hacerlo”.",
    "Gerard DiPippo, investigador principal del Centro de Estudios Estratégicos e Internacionales.",
    "Ajustados a la inflación general, los precios de la gasolina no son necesariamente tan altos.",
    "“Esto no resuelve el problema de las personas que pagan precios altos en la bomba.",
    "Podría ordenar otra liberación si la diplomacia no logra que los rusos retrocedan.",
    "Los miembros del Congreso están buscando otras formas de aliviar el dolor.",
    "“Simplemente no hay mucho que el presidente pueda hacer”, dijo Furman.",
    "La Casa Blanca aún tiene que respaldar o descartar esta opción.",
    "“No creo que esa sea la solución aquí”, dijo Murkowski.",
    "Crece la tensión por una posible invasión rusa.",
    "“Pone a la Casa Blanca en un aprieto”."
  ]
}