{
  "id": 1685,
  "mediaId": 2509,
  "date": "2022-02-17",
  "headline": "Senate averts government shutdown after amendments to repeal COVID mandates fail",
  "image": "https://s.abcnews.com/images/Politics/senate-government-shutdown-chuck-schumer-01-ap-llr-220217_1645138284156_hpMain_16x9_992.jpg",
  "link": "https://abcnews.go.com/Politics/senate-averts-government-shutdown/story?id=82964510",
  "mediaOutlet": "ABC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allison Pecorin",
  "authorUrl": "https://abcnews.go.com/author/allison_pecorin",
  "termIds": [
    0
  ],
  "sentences": [
    "Leaders on both sides of the aisle have assured the public for several days that the government would not shut down on Friday, but negotiations came down to the wire as GOP lawmakers looked to use the budget bill as an opportunity to challenge Democrats' COVID-19 mandates.",
    "If any amendment had been successful, the funding bill would have had to be returned to the House, which is currently on recess and would not have been able to return to pass a modified version of the legislation before government funding expired Friday evening.",
    "Lindsey Graham of South Carolina, Richard Burr of North Carolina, Mitt Romney of Utah and Jim Inhofe of Oklahoma -- were also missing from the chamber, evening out the numbers and allowing Democrats to move the vote forward.",
    "Lawmakers have already passed multiple short-term funding extensions to buy key negotiators in both chambers additional time to agree on a massive bill to keep the government funded through the end of the fiscal year.",
    "But blocking such amendments proved challenging for Democrats, who stalled consideration of the short-term funding bill because several of their members are not currently in Washington.",
    "Challenges to pandemic mandates are becoming increasingly popular among Republican lawmakers, who are looking to capitalize on growing fatigue over COVID-19 across the country.",
    "One amendment, offered by Sen. Ted Cruz, R-Texas, would have revoked federal funds for schools that left mask mandates in place for children.",
    "Neither of the two COVID-19 mandate amendments ultimately passed, but they did receive support from nearly every Republican in the chamber.",
    "Senators narrowly avoided a government shutdown Thursday evening, passing a short-term funding bill one day before funds were set to lapse.",
    "Congressional leaders are hopeful that by that time, negotiators will have ironed out an agreement on a yearlong package of funding bills.",
    "The bill, which continues funding at current levels, will keep the federal government operating until March 11.",
    "Dianne Feinstein of California and Mark Kelly of Arizona are out of town managing family emergencies.",
    "Another amendment, which would have required the United States to balance its budget, also failed.",
    "Leaders say they're narrowing in on a deal, but no formal agreement has been announced.",
    "The other, led by Sen. Mike Lee, R-Utah, would have ended the federal vaccine mandate.",
    "And Sen. Ben Ray Lujan of New Mexico is recovering from a stroke.",
    "Ultimately some Republicans -- Sens.",
    "Sens."
  ]
}