{
  "id": 1691,
  "mediaId": 2628,
  "date": "2022-02-11",
  "headline": "Democratic Lawmakers Want to Temporarily Suspend Federal Gas Tax",
  "image": "https://nationalinterest.org/sites/default/files/main_images/gas%20prices%20reuters.JPG",
  "link": "https://nationalinterest.org/blog/politics/democratic-lawmakers-want-temporarily-suspend-federal-gas-tax-200506",
  "mediaOutlet": "National Interest",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Suciu",
  "authorUrl": "https://nationalinterest.org/profile/peter-suciu",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Federal taxes include excise taxes of 18.3 cents per gallon on gasoline and 24.3 cents per gallon on diesel fuel, and a Leaking Underground Storage Tank fee of 0.1 cents per gallon on both fuels,\" the U.S Energy Information Administration (EIA) explained.",
    "Democrats have long been seen to support a \"tax-and-spend\" policy, and many in the progressive wing of the party have even called for higher taxes on fossil fuels in recent years to help drive support for and innovation towards renewable energy.",
    "Opponents warn that it could require further borrowing, and the bill would further direct the Treasury Department to monitor the program in order to ensure that oil and gas companies pass along the savings to consumers, Fox Business reported.",
    "Debbie Stabenow (D-Mich.), Catherine Cortez Masto (D-Nev.), and Jacky Rosen (D-Nev.), and Raphael Warnock (D-Ga.) – have signed on as co-sponsors of the bill, but it still faces an uphill battle in the 50-50 Senate.",
    "“This bill will lower gas prices by suspending the federal gas tax through the end of the year to help Arizona families struggling with high costs for everything from gas to groceries.”\nFour other Democrats – Sens.",
    "“Arizonans are paying some of the highest prices for gas we have seen in years and it's putting a strain on families who need to fill up the tank to get to work and school,” Kelly said via a statement.",
    "Driving Prices Higher\nWinter weather and the possibility of sanctions against Russia over its potential invasion of Ukraine have both played a role in keeping the price of oil high, according to AAA.",
    "\"We need to continue to think creatively about how we can find new ways to bring down costs, and this bill would do exactly that, making a tangible difference for workers and families.\"",
    "He regularly writes about military small arms, and is the author of several books on military headgear including A Gallery of Military Headdress, which is available on Amazon.com.",
    "The bill would also require the Treasury Department to deposit general funds into the trust fund to make up for the lost tax revenue and to ensure the fund remains solvent.",
    "However, a pair of Democratic Senators on Wednesday unveiled a proposal to temporarily suspend the federal gas tax as a way to help America cope with surging oil prices.",
    "\"People are feeling a real pinch on everyday goods, and we must do more to help address rising costs, particularly the price of gas,\" Hassan said in a statement.",
    "Highway Trust Fund\nThe federal gas tax is used to pay for the Highway Trust Fund, which covers expenses including highway construction and public transit.",
    "In California, drivers are paying well over $4 per gallon, and prices are only expected to climb higher as the country enters peak driving season.",
    "Democratic and Republican governors have already proposed some of their own changes to state gas taxes ahead of the summer driving season.",
    "Peter Suciu is a Michigan-based writer who has contributed to more than four dozen magazines, newspapers and websites.",
    "These proposals included either freezing state gas tax collection or stopping planned increases from taking effect.",
    "The current national average for a gallon of gasoline was $3.45, about $1 more than a year ago according to AAA.",
    "Mark Kelly (D-Ariz.) and Maggie Hassan (D-N.H.), would eliminate federal gas tax for the remainder of 2022.",
    "Cortez Masto, Warnock, Hassan, and Kelly are all up for reelection in November.",
    "Even with these cuts, driving is likely to be a lot more expensive this year.",
    "The Gas Prices Relief Act, which was introduced by Sens.",
    "The gas tax rate has remained constant since 1993.",
    "Image: Reuters."
  ]
}