{
  "id": 1696,
  "mediaId": 2631,
  "date": "2022-02-11",
  "headline": "Congress is passing a wave of bipartisan bills as Biden’s big plans stall",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220210-us-capitol-exterior-2021-ac-751p-edec6a.jpg",
  "link": "https://www.nbcnews.com/politics/congress-passing-wave-bipartisan-bills-bidens-big-plans-stall-rcna15798",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nThe bipartisan victories, which include a $1.2 trillion infrastructure law passed last year, have followed a similar formula: Write bills with input from members of both parties and omit controversial provisions to keep the coalition as broad as possible.",
    "\"What the Democratic leaders seem to have finally realized is that in a 50-50 Senate, the only way you’re going to be able to produce any accomplishments that matter to the American people is to work across the aisle,\" said Sen. Susan Collins, R-Maine.",
    "The Senate approved a bill by voice vote Thursday to end the employment practice of forcing women to resolve sexual assault allegations in closed-door arbitration settings, sending it to Biden's desk after a lopsided House vote to pass it.",
    "It’s become almost a mantra, but we need to actually do it.”\nFor vulnerable Senate Democrats facing tough re-election campaigns this fall, the growing list of bipartisan wins has handed them something to talk about as they stump for votes.",
    "\"But we still have a lot of other very important things to focus on, whether it’s the price of prescription drugs or what’s going on in Europe right now or the cost of gasoline — which I’m trying to address in a bipartisan way.\"",
    "For instance, the Senate compromise on the Violence Against Women Act excludes a policy in the House-passed version to close the \"boyfriend loophole\" by restricting gun rights for dating partners convicted of abuse or stalking.",
    "Pieces of the package are critical to his constituents, he said, including lowering the cost of prescription drugs and provisions to tackle climate change that would directly affect drought-stricken Arizona.",
    "The flurry of bipartisan activity comes as Democrats have hit a wall on many of Biden's campaign promises that lack GOP support, from gun control to liberalizing immigration to overhauling police practices.",
    "Meanwhile, the House and the Senate have each passed their versions of the Make It in America Act, a broad U.S.-China competition bill, and plan to hash out their differences in a conference committee.",
    "\"While we are disappointed, we also recognize how critical the overall bill is and the opportunity we have in this moment,\" said the aide, who requested anonymity to discuss the sensitive topic.",
    "“I think BBB being off the front burner has allowed us to look at the issues that Americans care about and focus on them,\" said Sen. Mitt Romney, R-Utah, referring to the Build Back Better bill.",
    "The same day, top appropriators announced a \"framework\" agreement for a full-year omnibus spending bill after negotiations had stalled out for months and set federal funding on autopilot.",
    "But Congress is suddenly racking up modest yet consequential victories, from protecting victims of sexual abuse and improving mail delivery to making the U.S. more competitive with China.",
    "A day earlier, senators unveiled a compromise to renew the Violence Against Women Act, resolving a host of disputes, from coverage for LGBTQ survivors to jurisdiction on tribal lands.",
    "Put aside the politics,” said Sen. Richard Blumenthal, D-Conn., who worked on the bill with Sen. Lindsey Graham, R-S.C. “What I hear again and again is they want us to get stuff done.",
    "And the House voted 342-92 on Tuesday to pass a bill to straighten out the finances of the Postal Service and improve mail delivery — which the Senate plans to take up next week.",
    "\"And to the extent that people wanted to put Democrats in charge so they can achieve some sense of normalcy in their government — they're seeing a functional legislative branch.",
    "The Judiciary Committee on Thursday passed the EARN IT Act without any objections, aiming to hold tech companies responsible if they host material that shows child sexual abuse.",
    "“It’s really important to the people in my state, where we have a lot of rural people who count on the mail for medications, for packages, for communication,” Shaheen said.",
    "Democratic leaders pivoted after a failed vote to curtail the Senate's 60-vote threshold, which preserves the Republican minority's power to shape — or veto — legislation.",
    "Sen. Jeanne Shaheen, D-N.H., called the bill a “huge accomplishment” on a tangible issue that affects every American, particularly those who live in rural America.",
    "If you want to get something done, you’ve got to work together,” said centrist Sen. Joe Manchin, D-W.Va., an evangelist for bipartisanship on Capitol Hill.",
    "And a Senate group of moderates, which includes Collins and Manchin, is working to bolster federal law to make it harder to steal elections.",
    "A Democratic aide said negotiators ditched the provision after they failed to find the necessary 10 Republican votes for it.",
    "WASHINGTON — President Joe Biden's signature Build Back Better Act has stalled and his voting rights ambitions have fizzled.",
    "That comes atop a new law signed last year to tackle hate crimes and boost infrastructure spending to $1.2 trillion.",
    "\"Our bipartisan advances are supremely important for the American people to have faith in their government.",
    "But one of them, Sen. Mark Kelly, D-Ariz., said he’s refusing to throw in the towel on Build Back Better.",
    "\"It's not either-or,\" said Sen. Alex Padilla, D-Calif. \"Where we can make progress — we can, we should.",
    "We can help the post office get in a fiscal situation that makes sense,\" Kelly said in an interview.",
    "It's cold comfort for many progressives who had bigger ambitions for the Democratic trifecta.",
    "Separately, Congress is buzzing with bipartisan efforts to ban stock trades by lawmakers.",
    "But when push comes to shove, they appear willing to take victories that are attainable.",
    "A large bipartisan group of senators was joined by the actor Angelina Jolie.",
    "\"We're lawmakers, not law-suggesters,\" said Sen. Brian Schatz, D-Hawaii.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "We've passed a number of very important pieces of legislation.\"",
    "Other significant compromise bills have gotten less attention.",
    "“People realize we’re not going to get rid of the filibuster.",
    "\"All of a sudden there is sincere Democratic participation.\"",
    "And we still keep aiming high on the bigger-picture items.\"",
    "\"We can rebuild our infrastructure.",
    "And so I think that's positive.\"",
    "\"The Senate does work."
  ]
}