{
  "id": 16998,
  "mediaId": 2520,
  "date": "2022-02-26",
  "headline": "'I want Arizonans to be aware': Ukrainians in Phoenix call for more 'severe' action from US against Russia",
  "image": "https://www.gannett-cdn.com/presto/2022/02/26/PPHX/57b0ee8a-16e8-458e-a96b-cb4987bf6af7-ukraine-protest-phoenix-tk-03.jpg?crop=3599,2025,x0,y183&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/local/phoenix/2022/02/26/ukrainians-phoenix-call-more-severe-action-us/6955443001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Daniella Sepulveda",
  "authorUrl": "https://www.azcentral.com/staff/7882120002/laura-daniella-sepulveda/",
  "termIds": [
    2459,
    5879,
    4195,
    4037,
    6515,
    6569,
    6672,
    5949,
    6286
  ],
  "sentences": [
    "“It is another clear signal that the United States stands with the people of Ukraine as they defend their sovereign, courageous, and proud nation.”\nThe aid brings the total U.S. assistance to Ukraine to more than $1 billion over the past year, according to Blinken, including $200 million in military assistance in December and $60 million last fall.",
    "“It’s really not the time that Ukrainians around the world can sleep, or do anything except for trying to help the country.”\nShe said she has been in touch with her family since the attacks started in Kyiv on Thursday morning and that she feels relieved there haven’t been internet connection issues that hinder communication.",
    "According to Oli Stokolosa, a Ukraine native and organizer who has lived in Arizona for about 10 years, one of the goals of the protest was to demand action from U.S. Sen. Mark Kelly and Sinema to deliver the urgency of the message to the White House.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nSupport local journalism.",
    "The Ukrainian Congress Committee of America, a nonprofit, community-based organization, invited all supporters of Ukraine in Arizona to attend a meeting today starting at noon at 730 W. Elm St. in Phoenix.",
    "The Ukrainian community in Arizona gathered Saturday to ask the U.S. and European governments to take immediate and more severe actions against the Russian attacks in the capital city of Kyiv.",
    "“My dad and my grandmother are still hiding.”\nIsakova said she has felt anxious and concerned for her family and that she attended the rally to take as much action as she can from abroad.",
    "Secretary of State Antony Blinken announced the drawdown of funds after Biden authorized the emergency military aid late Friday night through the Foreign Assistance Act of 1961.",
    "“This package will include further lethal defensive assistance to help Ukraine address the armored, airborne, and other threats it is now facing,” Blinken said in a statement.",
    "Olya Johnson, who also participated in the rally, said she is concerned that the war will grow into something bigger if other countries don't take immediate action.",
    "Lada Isakova, who also attended the Phoenix rally, said she arrived in Arizona from Kyiv only two weeks ago to start an internship at Arizona State University.",
    "They also held signs with the colors of the Ukrainian flag that read “Ukraine matters,\" \"Stand with Ukraine\" and \"Russia must be stopped.\"",
    "The rally took place at the southeast corner of Camelback Road and North 32nd Street, near the Phoenix office of U.S. Sen. Kyrsten Sinema.",
    "Since then, scores of Ukrainian soldiers and civilians have been killed or injured as Russian forces advance toward the capital of Kyiv.",
    "Isakova and Stokolosa said one of the main goals of the rally was to petition the U.S. government to help shelter Ukraine from the sky.",
    "Russian President Vladimir Putin declared a military operation in eastern Ukraine during a televised address overnight on Wednesday.",
    "\"We are here to try to show to the world that we have to stand united against Russian aggression towards Ukraine,\" Stokolosa said.",
    "The Biden administration announced on Saturday an additional $350 million in immediate U.S. military assistance to Ukraine.",
    "People who attended the rally wore flower headbands and embroidered clothes to represent traditional vestments.",
    "Her mom and sister fled to the Moldavian city of Chi?inau on Friday only a few days after the first attacks.",
    "\"We know that our (Ukrainian) president is having a conversation with Joe Biden on a daily basis.",
    "“There are missiles in Kyiv, so they’re like hiding in the shelters all the nights,” she said.",
    "\"The United States needs to unite and fight because it will be bigger than that.\"",
    "Drivers passing by the intersection also honked in support of the demonstration.",
    "She said her family was still living in Kyiv when the attacks started.",
    "“I was not sleeping the first night when this happened,” she said.",
    "\"We need to stop it now, and I want Arizonans to be aware of that.",
    "We appreciate the support, but it's not enough,\" Stokolosa said.",
    "It feels distant and it feels that it doesn't matter.",
    "\"It has to be more firm and more severe.\"",
    "But it does matter,\" Johnson said.",
    "Subscribe to azcentral.com today."
  ]
}