{
  "id": 17002,
  "mediaId": 2590,
  "date": "2022-03-03",
  "headline": "GOP Senate Recruitment Efforts Continue To Fizzle",
  "image": "https://img.huffingtonpost.com/asset/6220fa891e000032091af64e.jpeg?cache=Rt5OzFjuYw&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/arizona-doug-ducey-senate_n_6220f9ebe4b0ae4ab9c92085",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Bobic",
  "authorUrl": "",
  "termIds": [
    5138,
    5418,
    2459,
    2915,
    1126,
    1312,
    1489,
    872,
    1122,
    5949
  ],
  "sentences": [
    "“Right now I have the job I want, and my intention is to close my years of service to Arizona with a very productive final legislative session AND to help elect Republican governors across the country in my role as chairman of the Republican Governors Association.”\nAdvertisement\nDucey, like several others, was heavily courted by national GOP leaders and donors, but ultimately decided against running for Senate.",
    "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic senators like [Arizona’s] Mark Kelly,” said Democratic Senatorial Campaign Committee spokesperson Patrick Burgwinkle in a press release drawing attention to Republicans’ faltering track record on recruitment.",
    "Larry Hogan and former Georgia Sen. David Perdue have all rebuffed Senate Minority Leader Mitch McConnell and the National Republican Senatorial Committee, deciding either to stick with governor’s races or leaving their plans up in the air for now.",
    "Instead, the Republican fields in many battleground states — Arizona, Missouri, Nevada, Ohio and Pennsylvania — are dominated by far-right lurching candidates who are hazy on whether they would support McConnell as majority leader.",
    "The Arizona governor became a target of former President Donald Trump and his allies when he certified President Joe Biden’s election win, angering the far-right base that falsely believes Trump won the state in 2020.",
    "When announcing that he wouldn’t run for Senate in November, Sununu — who had been the GOP’s top recruit at the time — expressed some frustration with the job of a federal lawmaker in a polarized Congress.",
    "His news comes on the heels of NRSC Chairman Rick Scott (R-Fla.) releasing a far-right campaign manifesto calling for raising taxes on the poor and drastically reducing spending on social services.",
    "Scott’s memo revealed intra-party tension when McConnell rebuked him for releasing the document, which Democrats have slammed as evidence that Republicans want to raise taxes on average Americans.",
    "“I’d rather push myself 120 miles an hour delivering wins for New Hampshire than to slow down and end up on Capitol Hill debating partisan politics without results,” he said then.",
    "Advertisement\nDucey, who’s not running for reelection in his current position, wouldn’t have necessarily had a clear path to the nomination if he did decide to run for Senate.",
    "Republicans need to flip one seat for control of the 50-50 Senate in 2022, which is expected to be a wave election year for the GOP that returns them to power in Congress.",
    "That’s why McConnell and the NRSC, the organization that helps elect Republicans to the Senate, had wanted Ducey and others who have already shown they can win statewide.",
    "Ross D. Franklin/Associated Press\nRepublicans lost another top recruit to the U.S. Senate on Thursday when it was revealed in a leaked donor memo that Arizona Gov.",
    "“We have a strong field of candidates in Arizona and I will be actively supporting our nominee — and perhaps weighing in before the primary,” Ducey wrote.",
    "“They’re top-tier candidates that are hugely impactful in those states but now there’s opportunities for other candidates to emerge,” he told HuffPost.",
    "“If you’re going to run for public office, you have to really want the job,” Ducey wrote in a letter first obtained by the Arizona Republic.",
    "He also praised McConnell’s efforts, and dangled the possibility of an endorsement in a crowded field hoping to take on Kelly.",
    "Scott has maintained that he put out the memo in a personal capacity, not as a member of McConnell’s leadership team.",
    "And that led me to run for treasurer and ultimately governor instead of seeking federal office,” he wrote.",
    "In his letter to donors, Ducey described himself as an executive rather than a legislator.",
    "Republican leaders brushed off any suggestion they might be struggling to sway recruits.",
    "“We’ve got four people running [in Arizona] ... We’ve got good people.”\nThe GOP’s No.",
    "But GOP efforts to recruit more establishment candidates have largely fizzled.",
    "I had dinner with Doug, he’s a good guy,” Scott told HuffPost Thursday.",
    "“The answer was obvious — by nature and training I’m an executive.",
    "said it’s a “bummer” that Ducey and others have passed on running.",
    "Advertisement\n“Everybody’s case is different ...",
    "Doug Ducey will not run for Senate in 2022.",
    "Doug Ducey has no plans to join the race.",
    "2 Senate leader John Thune (R-S.D.)",
    "Chris Sununu, Maryland Gov.",
    "New Hampshire Gov.",
    "Arizona Gov."
  ]
}