{
  "id": 17040,
  "mediaId": 2658,
  "date": "2022-02-28",
  "headline": "American air carriers cut off Russia",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-transportation/2022/02/28/american-air-carriers-cut-off-russia-00012110",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5699,
    4591,
    3021,
    3394,
    2503,
    6678,
    6672,
    6569,
    6411
  ],
  "sentences": [
    "Airlines for America stated that when the TSA mandate expires on March 18, the administration “should use this date as a decision point for either repealing or announcing a plan and timeline to repeal the federal mask mandate within the subsequent 90 days.”\nVACCINE CHANGES TOO: A4A also renewed its petition to ditch a policy requiring pre-departure testing for vaccinated individuals traveling to the United States, and also asked the administration to “develop benchmarks and timelines for a pathway to the new normal that repeals pandemic-focused travel restrictions” by June 1.",
    "I had to visit 27 government offices to get a single dock permit, and realized if we wanted the government to work for the people, not against the people, it was up to us to make a change.”\nKIND WORDS FROM A CLIMATE HAWK: In 2015, Inhofe once threw a snowball on the Senate floor to argue that the planet was not warming, and faced an immediate rebuttal from Sen. Sheldon Whitehouse (D-R.I.), a noted proponent of legislation to fight climate change.",
    "Jackson's contributions to Friday's oral arguments were limited in the railroad case, where lawyers representing two unions argued that the FRA under former Administrator Ronald Batory, a Trump appointee, failed to seek input on the proposed changes beyond those from the railroad industry, which submitted a petition for rulemaking in 2018 that aligned with what became the FRA's final rule.",
    "“Now, I'm lookin' to the sky to save me/Lookin' for a sign of life/Lookin' for somethin' to help me burn out bright/And I'm lookin' for a complication/Lookin' cause I'm tired of lyin'/Make my way back home when I learn to fly high”\nAviation\nCLOSING THE SKIES: Russians trying to fly will have a hard time ignoring their country's aggression toward Ukraine.",
    "Sen. Mark Kelly (D-Ariz.) wrote Biden a letter saying his proposals are “concrete steps that should be taken to drive down gas prices and provide relief to families.” While the White House has said “all options are on the table” the gas tax holiday faces universal opposition from Republicans and has split Democrats on the Hill.",
    "Inhofe, a former EPW chair who championed infrastructure and frequently worked with then-Sen. Barbara Boxer (D-Calif.), said in a statement that he was drawn to politics after trying to secure permits for a loading dock and eventually needing to deal with 27 different government offices.",
    "Tweet of the day\nMASK CHANGES LEAVE OUT PLANES: After the CDC eased its mask-wearing guidance on Friday, the airline industry petitioned the White House to scrap the federal requirement that people wear masks at airports and on board aircraft once it expires next month, Oriana reports.",
    "They include John Boccieri, a current United Airlines pilot and former member of Congress and state representative from Ohio, David Bourne, a pilot and airline division director for the Teamsters and Joseph DePete, a pilot and president of the Air Line Pilots Association.",
    "NEW NEWARK SLOTS: DOT is requesting applications from U.S. low-cost carriers or ultra-low-cost carriers to help address competition issues at Newark International Airport as it reassigns 16 peak afternoon and evening runway times previously operated by Southwest Airlines.",
    "AIR CARGO OFF: UPS and FedEx have suspended air cargo deliveries to Russia indefinitely, a blow to Russian industries and far-flung cities that rely heavily on air shipments (though there is still a significant domestic air cargo industry within Russia).",
    "The European Union and Canada in a show of collective action on Sunday banned all Russian owned, registered or controlled aircraft, including the private jets of oligarchs, cutting Moscow off from most westward air travel in a matter of hours.",
    "Around the Agencies\nTRAIN BRAKING>SCOTUS: As Ketanji Brown Jackson was officially announced as President Joe Biden's Supreme Court pick Friday morning, she was overseeing a Zoom court case on rail braking regulations, your MT host reports.",
    "HOW THE U.S. IS RESPONDING: The FAA, which has not yet imposed a similar flight ban, told U.S. pilots and American air carriers on Thursday that flights over Belarus, Ukraine and parts of western Russia were off-limits indefinitely.",
    "Delta Air Lines suspended its code sharing alliance with Russia’s flag carrier Aeroflot, Betsy Woodruff Swan and Oriana report, the latest effort to isolate big Russian businesses after Vladimir Putin’s invasion of Ukraine.",
    "HOLIDAY PUSH: A Senate cosponsor of the gas tax holiday proposal, S. 3609 (117), is urging Biden to endorse his legislation and coordinate releases of the strategic oil reserve in response to the invasion of Ukraine.",
    "But Canada's move on Sunday essentially cuts off Russian planes from the U.S.\nDELTA SUSPENDS RUSSIA AGREEMENT: While the FAA hasn't yet banned Russian planes, private companies are imposing their own restrictions.",
    "American air carriers cut off Russia\nBy ALEX DAUGHERTY\n02/28/2022 10:00 AM EST\nWith help from Oriana Pawlyk and Tanya Snyder\nQuick fix\n— Delta, UPS and FedEx move to isolate Russia over Ukraine invasion.",
    "Circuit panel who listened to oral arguments on three cases, including a fight between unions and the FRA over a 2020 rule that reduced the number of brake inspections required on trains.",
    "“In the strange ways of the Senate, Jim Inhofe was perhaps my worst foe on climate change issues, yet a key ally on my oceans and infrastructure measures,\" Whitehouse said in a statement.",
    "PILOTS’ FAA WISHLIST: The Allied Pilots Association sent a shortlist of their preferred FAA administrator picks to Biden and Transportation Secretary Pete Buttigieg on Friday.",
    "Jackson may not be part of that decision if her confirmation is successful, as Biden has endorsed a 40-day timeline in the Senate for confirmation hearings and a final vote.",
    "“We have removed our code from Aeroflot-operated services beyond Moscow’s Sheremetyevo Airport and removed Aeroflot’s code from Delta-operated services from New York-JFK.",
    "Russia’s invasion has not led to an immediate groundswell of support for gas tax holiday bills sponsored by Democrats facing tough reelection campaigns this year.",
    "The move forced U.S.-bound Russian jets to turn around midair, and the flight path from Moscow to Kaliningrad on the Baltic coast now resembles a half-circle.",
    "Delta said in a statement it does not directly operate flights in Russia or Ukraine while Aeroflot operated four daily flights to the U.S. from Moscow.",
    "BUTTIGIEG INCOMING: Buttigieg will testify on Wednesday before the Senate EPW Committee regarding the implementation of the infrastructure law.",
    "Follow us on Twitter\nKathryn Wolfe @kathrynwolfe\nAlex Daugherty @alextdaugherty\nOriana Pawlyk @Oriana0214\nTanya Snyder @tsnyderdc\nFollow Us",
    "“This decision to open up access at Newark means lower fares and more choices for the traveling public,” Buttigieg said in a statement.",
    "If Wicker takes Inhofe’s Armed Services spot, that would make Cruz next in line on the Commerce Committee as Sen. John Thune (R-S.D.)",
    "— “Manchester United preparing to end sponsorship deal with Russian airline Aeroflot as Russia attacks Ukraine.” Sports Illustrated.",
    "Inhofe’s announcement sets up the possibility of Sen. Ted Cruz (R-Texas) getting the top GOP spot on the Senate Commerce Committee.",
    "Send tips, pitches, feedback and song lyrics to us at adaugherty@politico.com, tsnyder@politico.com and opawlyk@politico.com.",
    "— Ketanji Brown Jackson was knee-deep into train braking regulations as she was officially announced as Biden’s SCOTUS pick.",
    "On the Hill\nINHOFE OFFICIALLY OUT: Sen. Jim Inhofe (R-Okla.) confirmed Friday that he will retire at the end of this year.",
    "Puro previously worked as a Democratic House Appropriations aide and before that as a transportation advisor at CBO.",
    "— CDC’s new, relaxed mask rules don’t apply to transportation so airlines are asking the White House to intervene.",
    "“For years, Kay and I were focused on our family and building our business together,” Inhofe said in a statement.",
    "What’s next: The D.C. Court of Appeals will make a ruling in the case that was first filed in March of 2021.",
    "The sharing agreement allowed passengers to fly on one another’s flights and book trips on the same ticket.",
    "IT’S MONDAY: You’re reading Morning Transportation, your Washington policy guide to everything that moves.",
    "You’ll also receive daily policy news and other intelligence you need to act on the day’s biggest stories.",
    "Air cargo and passenger airlines are already staying away from Ukrainian airspace due to safety concerns.",
    "“When he’s decided to push for something, he’s had an astounding ability to get it done.”\nCRUZ INCOMING?",
    "Customers affected by the changes will be re-accommodated,” a Delta spokesperson said in a statement.",
    "Current FAA administrator Steve Dickson plans to resign on March 31 to spend more time with family.",
    "Autobahn\n— Hollywood Burbank Airport files environmental lawsuit against California’s bullet train.",
    "— “Uber revamps driver pay algorithm in large U.S. pilot to attract drivers.” Reuters.",
    "But over the weekend Whitehouse had kind words for Inhofe’s infrastructure record.",
    "Shifting Gears\nSarah Puro is starting at NTSB as Senior Advisor to Chair Homendy.",
    "You can also find us on Twitter: @alextdaugherty, @TSnyderDC and @Oriana0214.",
    "is also just behind Inhofe on the Armed Services Committee pecking order.",
    "Current Commerce Committee ranking member Sen. Roger Wicker (R-Miss.)",
    "— “Why Biden is going easy on Russia’s energy industry.” POLITICO.",
    "already holds the minority whip post and Sen. Roy Blunt (R-Mo.)",
    "Jackson was part of a U.S. Court of Appeals for the D.C.",
    "Want to receive this newsletter every weekday?",
    "“Then, one day, I needed a dock permit.",
    "Subscribe to POLITICO Pro.",
    "Los Angeles Times.",
    "is retiring."
  ]
}