{
  "id": 1711,
  "mediaId": 2514,
  "date": "2022-02-16",
  "headline": "Slashing the gas tax is 'a band-aid,' won't stop surging prices, senator says",
  "image": "https://s.yimg.com/ny/api/res/1.2/zOZ_XfLlWhFE642kCjr3kA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/z9GWpiZE_fNY3O2lyEwuwg--~B/aD00NDgwO3c9NjcyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/aol_yahoo_finance_433/c44b83e8cf346e8342555ff27aabdca7",
  "link": "https://www.aol.com/finance/slashing-gas-tax-band-aid-174029725.html",
  "mediaOutlet": "AOL",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Sozzi",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "We can't take energy independence and start chipping away at it through the Keystone XL pipeline, not being [able] to explore on federal land, and just generally an atmosphere of regulation and then go ask OPEC to produce more.\"",
    "WTI crude oil has climbed 13% in the past month to $94 a barrel amid rising geopolitical tensions between Russian, Ukraine and the United States.",
    "Forget about $150 a gallon, I don't know where we will be bv then,\" Energy Word founder Dan Dicker said on Yahoo Finance Live.",
    "Slashing the gas tax to relieve pressure on spiraling higher pump prices isn't the answer, thinks one prominent senator.",
    "Senators Mark Kelly (D-AZ) and Maggie Hassan (D-NH) recently put forth legislation dubbed the Gas Prices Relief Act.",
    "\"My guess is that you are going to see $5 a gallon at any triple-digit [oil prices] ... as soon as you get to $100.",
    "Under the act, the federal tax on gas would be suspended until Jan. 1, 2023 as a means to bring pump prices down.",
    "But that petrol tax holiday is what some of Braun's colleagues on the other side of the aisle are proposing.",
    "The national average is up 16.5 cents a gallon from a month ago and 97.2 cents a gallon from one year ago.",
    "Gas prices are coming off their seventh straight weekly advance, according to data from GasBuddy.",
    "Given recent trends in energy markets, such a tax holiday may not have much of a lasting effect.",
    "\"It's a band-aid in the short-term,\" Senator Mike Braun (R-IN) said on Yahoo Finance Live.",
    "The federal gas tax is 18.4 cents a gallon for standard gas and 24.4 cents for diesel.",
    "Oil experts warn prices could shoot to $150 a barrel if the situation worsens.",
    "The average price nationally for gas currently stands at $3.47.",
    "Brian Sozzi is an editor-at-large and anchor at Yahoo Finance.",
    "\"I am one of the few Republicans that talks about climate.",
    "Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.",
    "Braun said he doesn't support a gas tax holiday.",
    "We need to be engaged in the conversation.",
    "And you might get to $6.50 or $7."
  ]
}