{
  "id": 17199,
  "mediaId": 2569,
  "date": "2022-03-01",
  "headline": "Florida reacts to Joe Biden’s State of the Union address",
  "image": "https://floridapolitics.com/wp-content/uploads/2022/03/biden-joe-sotu.jpeg",
  "link": "https://floridapolitics.com/archives/502844-florida-reacts-to-joe-bidens-state-of-the-union-address/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Schorsch",
  "authorUrl": "https://floridapolitics.com/archives/author/peterdschorsch/",
  "termIds": [
    2459,
    4381,
    4591,
    5138,
    5168,
    4905,
    6159,
    6569,
    6672,
    6678
  ],
  "sentences": [
    "Tonight’s State of the Union was a great reminder of all President Biden has accomplished and we look forward to working with him as we build on these successes in the year to come.”\n“While Republicans propose raising taxes on more than half of Americans, including our seniors, President Joe Biden is fighting every day to lower costs for all of us and taking on corporate monopolies who are price gouging consumers.",
    "That’s why we cannot rest until we’ve turned the popular clean energy investments passed by the House into law, so we can lower the costs of utility bills, free Americans from volatile gas prices, and provide cleaner air for every person.”\nU.S. Rep. Charlie Crist:\n“As we face unprecedented challenges as both a nation and members of the free world, we are in need of strong, decisive leadership now more than ever.",
    "In just one year, President Biden oversaw an unprecedented vaccine rollout that has seen over 550 million shots go into arms, passed a historic bipartisan infrastructure bill that will create thousands more good-paying jobs while expanding broadband access to millions who live in rural communities, and is sending $1 billion to Florida for Everglades restoration.",
    "This State of the Union address is a reminder of how good it is to be a Floridian!”\nProgress Florida Executive Director Mark Ferrulo and Florida Watch Executive Director Josh Weierbach:\n“Under the leadership of President Joe Biden, a record 6.4 million jobs were created in 2021, wages for workers are going up, and America’s economy is back on track.",
    "The President has delivered on his promise to champion a bipartisan, once-in-a-generation investment in infrastructure, creating millions of good-paying jobs and making a real impact on communities, and, thanks to President Biden’s leadership and trust in public health and medical guidance, our country is nearly free from the grips of COVID.",
    "Resolute in the global struggle for freedom and democracy, resolute in fighting inflation and lowering costs, and resolute to address our greatest challenges as one nation, one people, one Florida.”\nU.S. Rep. Brian Mast:\n“President Biden spoke for 62 minutes and didn’t say the one word Americans should’ve heard: sorry.",
    "Doing so will help American consumers get relief at the pump, while sending the strongest possible message to Putin and our other adversaries that the U.S. is serious about defending Ukraine and holding Russia accountable for the damage it has inflicted on the world with its most recent unstable behavior.",
    "#STOU\n— Kat Cammack (@Kat_Cammack) March 2, 2022\nU.S. Rep. Kathy Castor:\n“President Biden’s call to build a stronger and more resilient America through clean energy and more resilient infrastructure provides an extraordinary opportunity to create jobs and lower costs for families and businesses alike.",
    "We are a stronger country today than we were a year ago thanks to the victories the Biden administration has achieved on behalf of the American people during his time in office and tonight’s speech highlighted the President’s vision to improve the lives of all of our citizens in the years to come.”",
    "President Biden demonstrated that leadership tonight, steering us forward with resolve and determination as we rebuild our economy following the COVID-19 pandemic and work alongside our NATO allies to hold the Russian dictator Vladimir Putin accountable for his reprehensible invasion of Ukraine.",
    "At a time when the Republican party is distracted by culture wars, peddling disinformation, and advancing an agenda that increases taxes on working families and the poorest Americans, President Biden continues to focus on uniting the country by addressing real issues facing everyday Americans.",
    "They deserve better than what President Biden gave them tonight.”\nU.S. Rep. Stephanie Murphy:\n“The United States confronts serious challenges at home and abroad — from high inflation and disrupted supply chains to Russia’s unprovoked invasion of Ukraine and increasing competition from China.",
    "Biden declared that he and all members of Congress, whatever their political differences, are joined “with an unwavering resolve that freedom will always triumph over tyranny.” He asked the lawmakers crowding the House chamber to stand and salute the Ukrainians as he began his speech.",
    "Addressing a concerned nation and anxious world, President Joe Biden vowed in his first State of the Union address Tuesday night to check Russian aggression in Ukraine, tame soaring U.S. inflation and deal with the fading but still dangerous coronavirus.",
    "U.S. Rep. Greg Steube:\nJoe Biden says he wants he wants to secure our Southern border, but empty promises won't fix the fact that since he's taken office, two million illegal immigrants have been apprehended and released into our country.",
    "pic.twitter.com/ujoj26zs5S\n— Congressman Greg Steube (@RepGregSteube) March 2, 2022\nU.S. Rep. Mike Waltz:\nIf POTUS can’t bother to say recognize the heroic efforts of veterans to evac Americans and Afghan allies, I certainly can.",
    "#SOTU\n— Shevrin “Shev” Jones (@ShevrinJones) March 2, 2022\nState Rep. Spencer Roach:\n“Somebody needs to remind President Biden that we got rid of masks, opened our schools, and declared victory over COVID a long time ago.",
    "In just over nine months, Americans will send an unmistakable wake-up call and deliver Congress back to the Republicans.”\nU.S. Rep. Gus Bilirakis:\n“Last night, President Biden gave his first State of the Union Address.",
    "“Inflation is at a 40-year high due to Democrats’ economic mismanagement and wasteful spending, yet the President called for more spending which would worsen the problem and significantly increase our national debt.",
    "@POTUS is calling on Congress to bridge our partisan divides and pass a unifying legislative agenda to beat the opioid crisis, take on the mental health crisis, support our veterans, and end cancer as we know it.",
    "Senate Democrats like Raphael Warnock, Mark Kelly, Catherine Cortez Masto, Michael Bennet, and Maggie Hassan have done nothing but rubber stamp Joe Biden’s disastrous agenda that’s hurting American families.",
    "Here is a compilation of reactions from Florida elected officials and politicians:\nU.S. Sen. Rick Scott:\n“Under President Joe Biden and Senate Democrats, the State of Our Union is weak and getting weaker.",
    "They know that the Biden Administration welcomed a crime crisis with open border policies and dangerous slogans like ‘defund the police.’ They know that spending trillions of dollars won’t curb inflation.",
    "@afghanevac https://t.co/Azm7peWiyr\n— Rep. Mike Waltz (@michaelgwaltz) March 2, 2022\nState Sen. Lauren Book:\n“Tonight, President Biden reminded the American people how far we’ve come over the past year.",
    "Additionally, we must reconsider abandoning support for the Eastern Mediterranean Pipeline , which is a vital project that will help our European allies end their dependence on Russia’s oil supply.",
    "“I am proud to call Joe Biden our President and I am grateful for his steady leadership during what are extremely challenging times both domestically and abroad.”\nState Sen. Shevrin Jones:\n.",
    "President Biden is also showing what American leadership on the world stage looks like and has stepped up to provide $17 billion for our veterans facing financial hardships here at home.",
    "President Biden’s policies (stopping the Keystone Pipeline and domestic leases, harsh new FERC rules) have halted U.S. energy production, making us more reliant on foreign adversaries.",
    "We simply should not be filling Putin’s war chest when we can produce energy here in the U.S.”\nU.S. Rep. Kat Cammack:\nTonight’s #StateOfTheUnion was really more the #StateofTheSwamp.",
    "“Building a better America is within our reach, but action is urgent to protect communities from the increasingly costly and deadly consequences of the worsening climate crisis.",
    "“America is headed in the wrong direction, and according to public polling, the only people who haven’t realized it yet are President Biden and his Democrat allies in Congress.",
    "Rising gas prices are exposing the stupid decision to scrap the Keystone pipeline but the President wants to continue down a path towards killing the American energy industry.",
    "“Tonight, the President reminded us that our nation’s strength lies in our unity — and together we can rise to conquer any challenge.”\nU.S. Rep. Darren Soto, via Twitter:\n.",
    "President Biden said something else during his State of the Union Address that I strongly agree with; we can and must be willing to buy products that are made in America.",
    "The President also failed to convey confidence that he has a plan to combat rising crime and the woke culture that is tearing apart our communities and our schools.",
    "By accelerating our clean energy future, we will usher a new era of American prosperity, deliver for vulnerable communities, and give every American a fair shot.",
    "They know that they are less free, less secure and less prosperous than they were 14 months ago, and they know that President Biden is responsible for it.",
    "We believe Putin must be held accountable for this most recent attack and his reckless rhetoric regarding his willingness to consider nuclear options.",
    "Consider these important facts: Russian crude oil and petroleum product imports to the U.S. reached an 11-year high in 2021, totaling $17.5 billion.",
    "“On Inauguration Day, President Biden promised that he would admit when he made mistakes, but he’s broken that promise almost daily for 14 months.",
    "We needed solutions, but instead, we got excuses as he tried to convince the American people that the weakened state of our union was inevitable.",
    "Never has it been more important for America’s leaders to put patriotism over party and to forge bipartisan solutions to difficult problems.",
    "Tonight, he refused to admit that his far-left policies have wrecked the economy and decimated America’s reputation on the world stage.",
    "One of the best ways for the U.S. to apply pressure while promoting peace is to flip the switch and unleash American energy production.",
    "It was a notable show of unity after a long year of bitter acrimony between Biden’s Democratic coalition and the Republican opposition.",
    "This critical legislation would require the President to unleash America’s oil and natural gas production to offset Russian imports.",
    "“President Biden also outlined his vision for the future: making more in America and lowering costs for American families.",
    "We must pull together as Americans to confront these challenges — and it starts by investing in our communities at home.",
    "“The American people deserve a president who will say ‘sorry’ when he should and who won’t make the same mistake twice.",
    "Last week, my colleagues on the Energy and Commerce Committee filed the American Energy Independence from Russia Act.",
    "I agreed with his assessment that the entire civilized world is united against Putin’s escalating aggression.",
    "They know that Vladmir Putin watched what happened in Afghanistan and saw his opportunity in Ukraine.",
    "We stand in solidarity with the people of Ukraine and support their brave defense of their country.",
    "The President’s speech tonight seemed to reflect an alternate reality to that of working Americans.",
    "“Our ability to overcome these challenges is hamstrung by deep political polarization.",
    "We must continue to work with our international allies to hold him accountable.",
    "Divorced from reality and full of carefully crafted, empty rhetoric.",
    "Why should this mindset not also extend to our energy production?",
    "I see the state of our union as resolute.",
    "“But the American people are not stupid.",
    "@POTUS is just what #ThePEOPLE ordered.",
    "Thank you for your leadership, sir!",
    "THANK YOU from a grateful nation!",
    "America deserves better.",
    "They stood and cheered."
  ]
}