{
  "id": 17254,
  "mediaId": 2658,
  "date": "2022-03-01",
  "headline": "Congress returns to normal-ish for Biden’s speech — with cheers, jeers and viral moments",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1155968404/356e9fa5-73ce-4aee-9af3-227ae0eb3943/7debb23f-aae1-4972-b569-bb4a68ec4fbd/1280x720/match/image.jpg",
  "link": "https://www.politico.com/news/2022/03/01/state-of-the-union-reactions-00013093",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5780,
    5252,
    4390,
    4905,
    2187,
    1882,
    2765,
    1433,
    6386,
    6672
  ],
  "sentences": [
    "“And hopefully he understood what I meant.”\nWhile the senator said she didn’t specifically reference Roe v. Wade in that conversation, Biden went there: He discussed “preserving a women’s right to choose” as the Supreme Court takes up a challenge to its landmark abortion-rights ruling that’s leaving liberals nervous about the road ahead.",
    "Sen. Kirsten Gillibrand (D-N.Y.) lobbied Chief Justice John Roberts ahead of the speech to “continue to uphold precedent” — a rare move even for an outspoken progressive like Gillibrand, who said she “felt inspired to do it tonight.”\n“I assured him he has a role in American history that is very important,” Gillibrand said.",
    "Her heckling was followed by chants of “shame” from the Democratic side, including an audible call from Rep. Brenda Lawrence (D-Mich.) to “kick her out!”\nBiden’s speech also gave new openings to progressives who have watched their hopes for a historic party-line safety net bill evaporate this year.",
    "1 enemy we have in America today.”\nBiden’s address was clearly intended to boost his party’s confidence in the run-up to the midterms, as an increasingly hostile Russia compounds the tasks of reviving the Democratic agenda and preventing an election shellacking by the GOP.",
    "The president acknowledged Americans’ frustrations with the pandemic but warned: “We have to stay on guard.”\nThe scene on the House floor wasn’t entirely normal by State of the Union standards: Individual seats were assigned, with most members sitting one chair apart.",
    "“Not until you get your financial house in order can you do that.”\nBiden said his revised take on a signature domestic policy bill would tackle prescription drugs and childcare costs — two key pieces in the more sweeping version that passed the House last year.",
    "By Sarah Ferris and Burgess Everett\n 03/01/2022 11:59 PM EST\nThere’s a war in Europe and economic angst at home, but President Joe Biden’s State of the Union brought Democrats closer to the backdrop they’ve craved ever since he was elected: normalcy.",
    "At another point, Boebert shouted at Biden while he was speaking of “flag-draped coffins” for military members, including his son Beau, in an apparent reference to a militant attack on the Kabul airport last year that killed 13 U.S. soldiers.",
    "When Biden declared that “we are stronger today than we were a year ago,” members of his party broke into cheers of “USA, USA” and “Joe, Joe, Joe!”\nAnd when Biden panned former President Donald Trump’s tax cuts, Republicans booed heartily.",
    "The president’s party is grappling with an entirely new set of public anxieties than last year, challenges that are already taking their toll on Biden’s poll numbers and threatening to zap the party’s bare majorities in Congress.",
    "This time “we had a lot of people upstairs, we were still trying to spread out … we’re getting there.”\nMore in line with the Capitol’s norm, the speech prompted plenty of indelible visual moments, from the lighthearted to tense.",
    "While Biden’s bleak, pandemic-stricken first year in office may be over, Democrats were hoping for a shift in ambitions after several more crises landed in his lap, including rising inflation and Russia’s war against Ukraine.",
    "Individual conservatives also took their opportunities for attention-grabbing plays, with Reps. Lauren Boebert (R-Colo.) and Marjorie Taylor Greene (R-Ga.) shouting audibly at the president during two points in his speech.",
    "We’re getting back, we’re coming back.”\nSome members skipped the speech altogether, mindful of high-risk family members and uncertain about being in the packed Capitol that had removed its mask mandate just two days prior.",
    "While the president sought to infuse new energy into a social spending bill that’s been dead since before Christmas, Senate Democrats’ necessary 50th vote said he had “no idea” where things stood on the party-line effort.",
    "Hundreds of lawmakers crammed into the House chamber Tuesday night, almost entirely maskless for the first time in Biden’s presidency — although somewhat distanced, despite falling Covid cases.",
    "He then sought to explain the dramatic pivot that his administration — and Democrats across the country — have made as they’ve now ditched masks after just weeks ago recommending N-95s.",
    "Many Democrats fear they’re just eight months away from a wipeout without a course correction by the White House, the sort of hard pivot that Biden didn’t quite offer Tuesday night.",
    "It’s been a jarring sight, including at the Capitol, where nearly all Democrats went maskless roughly six hours after many of them donned masks for their usual votes on the floor.",
    "But there were bright spots: Every member could go this year, which means that junior lawmakers could attend their first big Biden speech after attendance was limited last year.",
    "It didn’t hurt that the commander in chief kept things to just over an hour; and in another touch of Washington predictability, the cross-aisle agreement stopped there.",
    "And while last winter’s fears of Covid-shuttered businesses may have vanished, they’ve been replaced by staggering price spikes hitting everything from food to fuel.",
    "Sen. Joe Manchin (D-W.Va.), who has resisted the party-line climate and social spending bill supported by Biden, said plainly after the speech: “Inflation is the No.",
    "Biden earned multiple standing ovations, starting off with a thundering threat to Russian President Vladimir Putin and a clear affirmation of support for Ukraine.",
    "Perhaps the clearest sign that Congress is regaining something of its old rhythms this year, though, was the tried-and-true partisanship that greeted the speech.",
    "Rep. Sheila Jackson Lee (D-Texas) was back in her usual State of the Union aisle spot, within a hearty handshake’s reach of Biden as he entered the chamber.",
    "On a more whimsical note, Senate Majority Leader Chuck Schumer stood up a little too early to clap for one of Biden’s applause lines and went viral.",
    "All attendees were required to test negative for the virus within 24 hours of the speech, and lawmakers were barred from bringing in-person guests.",
    "They stood up after me?”\nBoebert and Greene cast a different tone; both hollered at Biden to “build the wall” when he addressed immigration.",
    "Even as the president himself went unmasked in the Capitol, he held off declaring victory against the pandemic in the longer term.",
    "Dozens of lawmakers were stuck in the upper galleries typically reserved for members’ guests, left out of the schmoozing.",
    "Worries about the virus and the economy, in particular, are near-existential inside the Capitol for Biden’s party.",
    "Americans are feeling a temporary sense of relief from the virus, but there’s no sense how long it will last.",
    "of the short length, praising Biden’s rhetoric on Ukraine, but panning most of his domestic plans.",
    "On inflation, Biden floated ways to stem the pain, but hardly promised to eliminate it entirely.",
    "Manchin, who effectively quashed the bigger legislation in December, has a different suggestion.",
    "It’s harder to lean over and whisper to your colleagues,” said Sen. Elizabeth Warren (D-Mass.)",
    "“There’s been no formal talks, I’ve been honest with you,” Manchin said.",
    "The address wasn’t without its brief moments of bipartisan unity.",
    "Schumer responded gamely when asked about the moment: “Oh no.",
    "And I didn’t have tickets,” said Sen. Mark Kelly (D-Ariz.).",
    "He said he’s fine to talk about starting with tax reform.",
    "Still, she said, “you could see everybody’s faces.",
    "I liked that part,” said Sen. Mike Braun (R-Ind.)",
    "So I think about half of us didn’t have tickets.",
    "Sitting in “every other seat isn’t normal.",
    "“You had to win like a lottery system.",
    "“It was good for most.",
    "What happened?",
    "of the vibe.",
    "Really?"
  ]
}