{
  "id": 17264,
  "mediaId": 8350,
  "date": "2022-03-02",
  "headline": "Ukraine war upends Biden’s agenda on energy, climate change",
  "image": "https://ktar.com/wp-content/uploads/2022/03/ap_56749fa53dcc4931a575c863cd0219bb-6.jpg",
  "link": "https://ktar.com/story/4924473/ukraine-war-upends-bidens-agenda-on-energy-climate-change/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/associated-press/",
  "termIds": [
    2378,
    4905,
    6569,
    6636,
    6672,
    6678,
    6709
  ],
  "sentences": [
    "The White House has yet to state a position on a gas tax holiday, but a spokesman said officials are “coordinating actively with major energy consumers and producers,” with the goal of providing “relief at the gas pump for American households and businesses.” Gas prices averaged nearly $3.65 a gallon on Wednesday, up 93 cents from a year ago, according to the AAA motor club.",
    "“The world is warming slowly, but (Ukraine) is boiling over.”\nJonathan Elkind, who served as assistant energy secretary for international affairs under President Barack Obama, said that while the war inevitably will “dominate over everything´´ in the short term, the climate crisis will remain a key focus for Biden and his administration.",
    "“That’s something that we’re very aware of.”\n“If there was ever a time to be energy independent, it is now,” countered Sen. Joe Manchin, D-W.Va., chairman of the Senate Energy and Natural Resources Committee and a prominent supporter of fossil fuels such as coal and natural gas that are crucial to his energy-producing state.",
    "“It makes no sense at all for us to rely on energy from a country that is actively engaging in acts of war against a freedom-seeking democracy — Ukraine — when we are blessed with abundant energy resources right here in America,” Manchin said Tuesday in comments that were echoed across the political spectrum.",
    "Republican Sen. Dan Sullivan of Alaska made no mention of climate when he called for Biden to end “a holy war against American energy.” Biden’s policies are “driving up the price of energy for working families, laying off workers in my state … and empowering dictators like Putin,” Sullivan told Fox News.",
    "Republicans, seizing the political advantage, clamored for Biden to immediately reverse policies that they said have slowed U.S. energy production — including cancellation of the Keystone XL pipeline from Canada and a moratorium on new oil and gas leases on public lands and waters.",
    "Pompeo, who served under President Donald Trump, called Kerry’s comment “music to Vladimir Putin’s ears to think that America is focused on climate change while the Ukrainian people are dying in Europe.”\nEnvironmental groups said Kerry’s comments were being distorted.",
    "The pair introduced a bill Tuesday that would require Biden to make an “energy security plan” within 30 days and force him to “unleash America’s oil and natural gas production to offset Russian imports´´ that would be banned under the legislation.",
    "Biden announced on Tuesday that he is releasing 30 million barrels of oil from U.S. strategic reserves as part of a 31-nation effort to help ensure that supplies will not fall short after Russia’s invasion of its European neighbor.",
    "The omission was especially notable coming days after a new U.N. report warned that climate change is about to get significantly worse and will likely make the world sicker, hungrier, poorer, gloomier and far more dangerous.",
    "Now, the Ukraine war “seems likely to consume bandwidth that administration officials might otherwise devote to energy transition,” said Kevin Book, an energy analyst and managing director at ClearView Energy Partners.",
    "Former Secretary of State Mike Pompeo ridiculed Biden’s climate envoy, former Secretary of State John Kerry, who said before the invasion that a war in Ukraine could “divert” world attention from climate change.",
    "“Biden must end his war on American energy production so the United States and our allies can have access to affordable, secure energy,” said Louisiana Rep. Steve Scalise, the second-ranking House Republican.",
    "WASHINGTON (AP) — As Russian troops move deeper into Ukraine, President Joe Biden is taking steps to rein in rising energy costs even if those moves run counter to his agenda for addressing climate change.",
    "The White House says all tools remain on the table, but harsh U.S. sanctions against Russia do not target its energy sector, despite bipartisan calls to ban Russian oil imports, at least temporarily.",
    "In 2021, the U.S. imported roughly 245 million barrels of crude oil and petroleum products from Russia — a one-year increase of 24%, according to the U.S. Energy Information Administration.",
    "“You’re going to lose people’s focus, you’re going to lose big-country attention because they will be diverted, and I think it could have a damaging impact,” Kerry told the BBC last week.",
    "Some Democrats, seeking ways to ease pain at the pump and nervous about a potential voter backlash in the November elections, are pushing Biden to temporarily suspend the federal gas tax.",
    "The focus on high gas prices and increased oil flow is a far cry from Biden’s pledge to wean Americans off oil and other fossil fuels and cut planet-warming emissions in half by 2030.",
    "Biden’s $2 trillion social and environmental policy bill, which includes about $550 billion for climate change efforts, has been stalled for months in the evenly divided Senate.",
    "Concern over Russian oil and gas shows the importance of boosting renewable energy such as solar and wind power, said Tiernan Sittenfeld of the League of Conservation Voters.",
    "He and other Republicans urged severe sanctions on Russian energy production to take away leverage and funding that Russian President Vladimir Putin used to attack Ukraine.",
    "Banning Russian imports could restrict global oil supplies and “raise prices at the gas pump for Americans,” White House spokeswoman Karine Jean-Pierre said Wednesday.",
    "“America’s energy dominance is our strongest weapon against Putin,” said Republican Reps. Bruce Westerman of Arkansas and Cathy McMorris Rodgers of Washington state.",
    "The American Petroleum Institute, the industry’s top lobbying group, said U.S. companies play a crucial role in supporting European allies with U.S. exports.",
    "Westerman is the top Republican on House Natural Resources Committee while McMorris Rodgers is the senior GOP member on House Energy and Commerce Committee.",
    "“American energy leadership can serve as a stabilizing force while strengthening global energy security,” said Mike Sommers, the group’s president and CEO.",
    "The climate doesn’t fix itself in the meantime,” said Elkind, now a senior research scholar at Columbia University’s Center on Global Energy Policy.",
    "It was just last fall that Biden’s boasted of historic progress on addressing global warming at a U.N. climate conference in Scotland.",
    "Biden’s hourlong speech Tuesday night touched only lightly on climate and offered no new policy initiatives to address global warming.",
    "Liberal Sen. Ed Markey, D-Mass., a longtime climate hawk, introduced legislation to ban imports of Russian oil and petroleum products.",
    "Nearly 70 percent of U.S. liquefied natural gas exports went to Europe in January, a trend industry officials expect to continue.",
    "“We cannot criticize Europe for its reliance on Russian energy as we pour dirty oil money into Russia,” Markey said.",
    "Oil prices have soared, with U.S. benchmark crude surpassing $110 per barrel — the highest price in a decade.",
    "“Regime change appears to be crowding out climate change, and for good reason,” Book said in an email.",
    "“These steps will help blunt gas prices here at home,” Biden said in his State of the Union address.",
    "The U.S. stands ready to do more if necessary to protect American businesses and consumers, he said.",
    "Even as the world’s attention remains focused on Ukraine, the climate crisis continues, they said.",
    "It remains unclear when or if the bill will come up for a vote or what would be included in it.",
    "Mark Kelly of Arizona and Maggie Hassan of New Hampshire, both in tight races for reelection.",
    "The release follows ones ordered in November that also were coordinated with U.S. allies.",
    "The conflict in Ukraine “underscores the need to get off fossil fuels once and for all.",
    "This material may not be published, broadcast, rewritten or redistributed.",
    "Russia’s invasion of Ukraine has shaken markets worldwide.",
    "A bill to do that is co-sponsored by Democratic Sens.",
    "We do need to do all these things at once.” she said.",
    "Still, it reflects political realities.",
    "“We don’t have a choice of either/or.",
    "Copyright © The Associated Press.",
    "All rights reserved.",
    "We need to do both.",
    "Share\nComments"
  ]
}