{
  "id": 17279,
  "mediaId": 2573,
  "date": "2022-03-01",
  "headline": "Senate votes to block Democrat bill enshrining abortion as Supreme Court reconsiders Roe v. Wade",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/machinspeaking.jpg",
  "link": "https://www.foxnews.com/politics/senate-votes-to-block-democrat-bill-enshrining-abortion-as-supreme-court-reconsiders-roe-v-wade",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler O'Neil",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-oneil",
  "termIds": [
    5595,
    5510,
    3653,
    1489,
    1477,
    1126,
    1269,
    392,
    71
  ],
  "sentences": [
    "CHRISTIANS FROM DIFFERENT RACES, DENOMINATIONS AND PARTIES GATHER TO PRAY BEFORE SUPREME COURT ABORTION CASE\nThe Marist poll presented six options on abortion restrictions: \"abortion should be available to a woman at any time she wants one during her entire pregnancy\"; \"abortion should be allowed only during the first six months of a pregnancy\"; \"abortion should be allowed only during the first three months of a pregnancy\"; \"abortion should be allowed only in cases of rape, incest or to save the life of the mother\"; \"abortion should be allowed only to save the life of the mother\"; and \"abortion should never be permitted under any circumstance.\"",
    "While the bill claims that abortion restrictions \"are a tool of gender oppression,\" it also clarifies that despite using \"the terms ‘woman’ and ‘women,’\" legislators intend to \"protect all people with the capacity for pregnancy—cisgender women, transgender men, non-binary individuals, those who identify with a different gender, and others—who are unjustly harmed by restrictions on abortion services.\"",
    "((Photo by Chip Somodevilla/Getty Images))\nThe bill stipulates that \"a health care provider has a statutory right under this Act to provide abortion services, and may provide abortion services, and that provider’s patient has a corresponding right to receive such services, without\" specific \"limitations or requirements.\"",
    "A Fox News Poll in Sept. 2021 found that 65% of Americans support keeping Roe v. Wade, a Knights of Columbus/Marist poll in Jan. found that most Americans (60%) would either have the Court make abortion illegal (17%) or have the issue determined by each state (44%), both positions that would involve overturning Roe.",
    "(AP Photo/Susan Walsh, Pool)\n\"With a cascade of major crises testing our country, Senate Democrats are prioritizing a show-vote on mandating 9 months of abortion-on-demand across America,\" Senate Minority Leader Mitch McConnell, R-Ky., said on the Senate floor.",
    "It would also invalidate any state law prohibiting \"abortion after fetal viability when, in the good-faith medical judgment of the treating health care provider, continuation of the pregnancy would pose a risk to the pregnant patient’s life or health.\"",
    "\"Congress must codify into law what most Americans have long believed, that abortion is a fundamental right and that women's decisions over women's health care belong to women, not – NOT – to extremist right-wing legislatures.\"",
    "Most Americans (71%) said that abortion should be restricted to the first three months of pregnancy (22%) or in other limited circumstances such as rape and incest (28%), to save the life of the mother (9%) or not at all (12%).",
    "3755, the Women's Health Protection Act, aims \"to protect a person’s ability to determine whether to continue or end a pregnancy, and to protect a health care provider’s ability to provide abortion services.\"",
    "Marjorie Dannenfelser, president of the pro-life organization Susan B. Anthony List, warned that \"those who sided with the abortion lobby to trample the will of the people will face political consequences.\"",
    "The bill would strike down any \"prohibition on abortion at any point or points in time prior to fetal viability, including a prohibition or restriction on a particular abortion procedure.\"",
    "PRO-LIFE ADVOCATES RIP KAMALA HARRIS' PREDICTION THAT ‘WOMEN WILL DIE’ IF ROE V. WADE IS OVERTURNED\n\"Sadly it looks like the Supreme Court will limit abortion rights on the coming months.",
    "The bill also claims that abortion rights qualifies as \"reproductive justice\" seeking to address \"systems of oppression, lack of bodily autonomy, white supremacy, and anti-Black racism.\"",
    "\"Tonight, the hard-left formally kicked the old slogan of ‘safe, legal, and rare’ to the curb and embraced extreme pro-abortion politics,\" Sen. Ben Sasse, R-Neb., said in a statement.",
    "Sen. Joe Manchin, D-W. Va., joined his Republican Senate colleagues in voting to block a bill to protect abortion rights as the Supreme Court reconsiders Roe v. Wade (1973) this term.",
    "The House voted 218-211 in favor of the bill, with every Democrat except Rep. Henry Cuellar, D-Texas, supporting it or not voting, and every Republican opposing it or not voting.",
    "\"Senate Democrats want to go on record supporting the radical and massively unpopular position that we should have functionally no restrictions on abortion whatsoever.\"",
    "Only 17% of Americans said abortion should be available during an entire pregnancy and 12% said it should be restricted to the first six months.",
    "\"This legislation will make Planned Parenthood's army of lobbyists happy, but it's going to alienate a lot of Americans.\"",
    "Meanwhile, Planned Parenthood Action Fund President Alexis McGill Johnson called votes against the bill \"unconscionable.\"",
    "CLICK HERE TO GET THE FOX NEWS APP\n\"People deserve access to abortion no matter their zip code or income,\" Johnson said.",
    "That’s why the bill is essential,\" Senate Majority Leader Charles Schumer, D-N.Y., said before the vote.",
    "Mark Kelly, D-Ariz., Maggie Hassan, D-N.H., Raphael Warnock, D-Ga., and Catherine Cortez-Masto, D-Nev.",
    "The Senate voted 46-48 on whether to bring the bill up for debate, with six senators not voting.",
    "Every Senate Democrat except Manchin and Sen. Bob Casey, D-Pa., cosponsored the legislation.",
    "Several Democrats up for reelection in swing states voted for the bill, including Sens.",
    "Senators voted against their own constituents’ health and rights.\"",
    "Casey voted in favor of debate on the legislation.",
    "News tips can be sent to: tyler.oneil@fox.com.",
    "Tyler O'Neil is an editor at Fox News.",
    "\"It’s unconscionable that so many U.S.",
    "Polling on abortion is mixed.",
    "On Twitter: @Tyler2ONeil.",
    "H.R."
  ]
}