{
  "id": 17344,
  "mediaId": 2594,
  "date": "2022-03-03",
  "headline": "Ducey, Hogan, Sununu: Why GOP governors who spurned Trump are refusing to run for Senate",
  "image": "https://static.independent.co.uk/2022/01/15/05/Election_2022_Republicans_74976.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/trump-gop-governors-senate-ducey-b2028396.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    2915,
    2765,
    2459,
    4026,
    5712,
    5418,
    1489,
    1126,
    5949
  ],
  "sentences": [
    "Similar to their colleagues in the House, Senate Republicans often find themselves answering reporters’ questions about the latest Donald Trump-related controversy while working on lower-profile work like the confirmations of judges and other presidential appointments; there’s also little chance that the GOP could take a 60-vote majority in the chamber in 2022 or 2024, bypassing the need for Democratic votes for major legislation, meaning that few of their priorities will see traction for now.",
    "We have a strong field of candidates in Arizona and I will be actively supporting our nominee – and perhaps weighing in before the primary.”\nThe news was a major blow to efforts that state Republicans and national GOP leaders are undertaking to unseat Mark Kelly, the first-term senator from the state who won a special election to fill the seat of Sen John McCain, a Republican who died in 2018, for the remainder of Mr McCain’s term ending this year.",
    "“Right now I have the job I want, and my intention is to close my years of service to Arizona with a very productive final legislative session AND to help elect Republican governors across the country in my role as chairman of the Republican Governors Association.”\nHe added: “Rest assured, I am fully committed to helping elect a Republican US Senator from Arizona.",
    "The three represented some of the GOP’s top potential candidates for the upper chamber, and the Maryland governor in particular represented a rare opportunity for the party as a widely-popular GOP leader of a traditionally-blue state who is seen as just about the only Republican who could mount a credible bid against first-term Sen Chris Van Hollen.",
    "Mr Ducey’s decision mirrored those of two other would-be GOP Senate candidates, Maryland’s Gov Larry Hogan and New Hampshire’s Chris Sununu, who like their Arizona counterpart underwent months of lobbying from Senate GOP leaders like Minority Leader Mitch McConnell to consider bids for office before turning the party down publicly.",
    "That’s not an attractive scenario for many GOP candidates, who have witnessed their party enact retribution against the two members of their party who dared to take part in the investigation into the attack on Congress and have watched Mr Trump spend months trying to purge the GOP of his enemies.",
    "Like it or not, Senate Republicans face the prospect that many of their best hopes for taking back power in the upper chamber have been turned off from the idea of running due to the political realities of the Senate which Republicans themselves bear much responsibility.",
    "Republicans see Mr Kelly’s seat as one of their best chances for flipping back red in the fall, but those chances diminish if the party is unable to find a nominee with sufficient statewide name recognition or the political savvy to unseat the incumbent.",
    "The Senate, particularly when closely divided, is seen as a legislative graveyard where few major bills pass and majorities in both parties have seen months of legislative efforts frustrated in close votes that sour their reputations with voters.",
    "Mr Ducey has been less critical of the former president, but still drew Mr Trump’s ire by refusing to interfere in the certification of Joe Biden’s victory in the state, which was a surprise pickup for the Democrat in the 2020 election.",
    "Mr Sununu was less critical of the former president, but noted in one interview after January 6 that Mr Trump lost “pretty soundly” in the state and said that the president bore responsibility for the violence of the Capitol riot.",
    "Beyond Mr Trump’s potential opposition, the three governors also faced the reality of a Senate seat being a much less enticing reward for a hard-fought campaign than membership in the upper chamber previously represented.",
    "Given what’s happening in Washington it’s imperative for our party to take back both the Senate and US House to act as a constitutional brake on the excesses and bad policies of the Biden administration.",
    "Mr Hogan and Mr Sununu both publicly distanced themselves from the former president in the wake of the January 6 attack on Congress, with Mr Hogan going as far as calling for Mr Trump’s impeachment.",
    "Arizona’s Doug Ducey on Thursday joined a growing list of Republican governors who have spurned their party’s leadership in the Senate and ruled out bids for the upper chamber this year.",
    "All three share one other characteristic as well: they have all, in one way or another, scorned the de facto leader of the Republican Party, former President Donald Trump.",
    "Mr Ducey made the announcement that he would not seek a Senate seat in a letter to some of his campaign donors that was obtained on Thursday by several news outlets.",
    "The retired-astronaut-turned-lawmaker has largely stayed under the radar as a senator in comparison to his fellow Democratic senator from the state, Kyrsten Sinema.",
    "As such, the three faced the prospect of campaigning for Senate either without the support or, possibly, with direct opposition from the former president.",
    "“[I]n Washington, it seems as if there's just a lot of divisiveness and dysfunction, and not a lot gets done.",
    "Mr Hogan made his announcement last month, while Mr Sununu ruled out a bid as early as last November.",
    "“These days, if you’re going to run for public office, you have to really want the job,” he wrote.",
    "Mr Hogan said as much when he announced his decision not to run in February.",
    "So, it wasn't the right job, right fit for me,” he told CNN’s Jake Tapper."
  ]
}