{
  "id": 17442,
  "mediaId": 2830,
  "date": "2022-03-01",
  "headline": "Asian-Americans Fight Back Against School Discrimination",
  "image": "",
  "link": "https://www.wsj.com/articles/asian-american-fight-school-discrimination-affirmative-action-racial-justice-admissions-standards-testing-charter-schools-achievement-gap-harvard-supreme-court-11646172518",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason L. Riley",
  "authorUrl": "https://www.wsj.com/news/author/jason-l-riley",
  "termIds": [
    0
  ],
  "sentences": [
    "“Emails and text messages between Board members and high-ranking [Fairfax school] officials leave no material dispute that, at least in part, the purpose of the Board’s admissions overhaul was to change the racial makeup to TJ to the detriment of Asian-Americans.”\nThe ruling describes the school board’s actions as “racial balancing for its own sake,” which is “patently unconstitutional.” The Supreme Court has said that a compelling interest is necessary to justify race-based actions by the government, and school officials failed to meet that standard.",
    "WSJ Opinion: Cancel Culture and The Silence of the Moderate DemocratPlay video: WSJ Opinion: Cancel Culture and The Silence of the Moderate Democrat\n Wonder Land: Despite repeated cries of threats to \"our democracy,\" a political fix for November won’t repair the damage progressives have done to the U.S.",
    "Black and Hispanic students at high-performing charter schools in New York City are admitted to selective high schools at double the rate of their peers in traditional public schools, yet progressives side with teachers unions to prevent more charter schools from opening.",
    "Similar efforts to alter the admissions criteria at New York City’s elite public high schools, where Asian enrollment far surpasses that of other groups, have faced a backlash, “especially from a newly active faction of vocal Asian parents,” the New York Post reports.",
    "The recall of three San Francisco school board members last month was fueled by Asian parents who, like their counterparts in Virginia, were upset over a school board vote to change the admissions process at a highly selective high school.",
    "Open Queue\nDespite all the happy talk on the left about the benefits of diversity, America’s real strength has been its ability to transcend problems that have crippled other multiethnic, multireligious and multilingual societies.",
    "“The Board’s main problem is its focus on the goal to have TJ reflect the demographics of the surrounding area, described primarily in racial terms,” Judge Claude Hilton wrote in his summary judgment for the plaintiffs.",
    "Among other things, standardized testing requirements were eliminated, and subjective admission criteria were added in an effort to deny slots to Asian-Americans and boost enrollment among blacks and Hispanics.",
    "Photo: Adam Glanzman/Bloomberg News\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (5 minutes)\nAD\nLoading advertisement...\n00:00 / 05:02\n1x\nThis article is in your queue.",
    "Schools that admit less-prepared students won’t want them to struggle—or some racial groups to do better than others—so teachers and administrators will be under pressure to make classes less demanding.",
    "Read More Upward Mobility\nThe Supreme Court is poised to strike a blow for colorblind college admissions later this year when it considers a case involving alleged anti-Asian discrimination at Harvard.",
    "Two years ago, the school board in Fairfax County, Va., altered the admissions standards at Thomas Jefferson High School for Science and Technology, one of the top-ranked public schools in the country.",
    "And what seems to be uniting a growing number of Americans today is opposition to a Democratic equity agenda that effectively plays racial and ethnic groups against one another.",
    "A 2020 ballot referendum in California that would have reinstated racial preferences in college admissions was defeated by a wide margin, and Asian-Americans led the opposition.",
    "The plaintiffs in the Harvard lawsuit contend that the university is capping Asian enrollment by holding Asian applicants to higher standards than other groups.",
    "Until recently, racial preferences were typically discussed in the context of whites, blacks and Hispanics, while the impact on Asians was an afterthought.",
    "We can only hope that the Supreme Court’s ruling on Harvard’s admissions scheme will be as forceful and clearheaded as Judge Hilton’s in the Fairfax case.",
    "“The Board cannot transform racial balancing into a compelling interest ‘simply by relabeling it ‘racial diversity,’ ” Judge Hilton wrote.",
    "If progressives wanted to do something meaningful about the achievement gap, the focus would be on preparing students for these tests.",
    "WSJ Opinion: Cancel Culture and The Silence of the Moderate Democrat\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Images: Getty Images/MG21/The Met Museum/Vogue Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "It’s also clear that Republicans now have in education an issue that potentially brings together whites, blacks and Asians alike.",
    "And they want policies that treat people equally, not policies that try to undo history by favoring some groups over others.",
    "Following the changes, Asian enrollment in Thomas Jefferson’s freshman class declined from around 73% to less than 50%.",
    "Demonstrators against Harvard University's admission process protest at Copley Square in Boston, Oct. 14, 2018.",
    "They don’t like the way unions leveraged a pandemic to put their members’ interests ahead of the children’s.",
    "But regardless of how the court decides, it’s clear that the affirmative-action wars are far from over.",
    "Parents filed a lawsuit, and last week a federal court ruled that the admissions changes were illegal.",
    "0:00 / 4:20\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Most voters don’t want our elementary schools turned into social-justice boot camps.",
    "Now more Asians are making their voices heard, and it’s a welcome development.",
    "You can’t dumb down admissions without also dumbing down the curriculum.",
    "Eliminating the test will only obscure the learning gap, not erase it.",
    "Making an enemy of testing and grades is barking up the wrong tree.",
    "We’re at our best when the focus is on what unites us as Americans.",
    "Moreover, lowering standards ultimately harms all groups.",
    "But the fight continues at the K-12 level as well.",
    "The test isn’t the cause of these disparities.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "It’s merely a measure of reality.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Go figure.",
    "It worked."
  ]
}