{
  "id": 17451,
  "mediaId": 2830,
  "date": "2022-03-02",
  "headline": "The U.N.’s Dishonor Roll",
  "image": "",
  "link": "https://www.wsj.com/articles/the-united-nations-dishonor-roll-general-assembly-resolution-vote-russia-ukraine-india-china-pakistan-11646261810",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    0
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nNo Tacking in Biden's State of the Union\nJoe Biden began his address to Congress with a message for Vladimir Putin about Ukraine, but then he pivoted to issues like inflation, where many of his proposals were reminiscent of his failed Build Back Better plan.",
    "WSJ Opinion: Ukraine's Fight for Freedom Is a Lesson for the WestPlay video: WSJ Opinion: Ukraine's Fight for Freedom Is a Lesson for the West\n Review & Outlook: The war in Ukraine may be intensifying, but Vladimir Putin’s invasion isn’t going to plan as Ukrainians show a too complacent West what it means to fight for freedom.",
    "AD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nThe vote to denounce the invasion, which is a clear violation of the U.N. Charter, was 141-4 (not counting Russia) with 35 abstentions.",
    "Photo: Lev Radin/Zuma Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (2 minutes)\nAD\nLoading advertisement...\n00:00 / 01:35\n1x\nThis article is in your queue.",
    "Open Queue\nThe United Nations is mostly irrelevant these days, but it’s still worth noting the dishonor roll in Wednesday’s General Assembly vote on Russia’s invasion of Ukraine.",
    "It does not highlight the importance of the principle of indivisible security, or the urgency of promoting political settlement and stepping up diplomatic efforts,” he said.",
    "Members of United Nations cast their votes on a resolution to condemn Russia as they displayed on big screen at Emergency session of General Assembly at U.N. Headquarters.",
    "Indian Prime Minister Narendra Modi, who aspires to a leadership role in the world, can take pride in meeting the standards of Pakistani Prime Minister Imran Khan.",
    "WSJ Opinion: Ukraine's Fight for Freedom Is a Lesson for the West\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "China’s envoy Zhang Jun said the resolution did not undergo “full consultations with the whole membership” of the assembly.",
    "Belarus—which is Russia’s mini me and is aiding the invasion—Eritrea, North Korea and Syria voted against the resolution.",
    "Images: AFP via Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Translation: China is siding with Russia but wants to hedge for the benefit of its European business partners.",
    "Notable among the 35 abstainers were Pakistan, India, China, Vietnam, South Africa, Iraq, Iran and Cuba.",
    "The resolution has no legal consequences, though it gives you the moral flavor of the joint.",
    "“Nor does it take full consideration of the history and complexity of the current crisis.",
    "0:00 / 4:32\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "And what about the Republican response by Iowa Gov.",
    "So what was the takeaway for the American people?",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "What a crowd.",
    "Kim Reynolds?"
  ]
}