{
  "id": 17500,
  "mediaId": 2830,
  "date": "2022-03-02",
  "headline": "War and Rumors of War in Ukraine",
  "image": "",
  "link": "https://www.wsj.com/articles/war-ukraine-russia-invasion-fight-civilian-targets-deaths-food-shortage-starvation-bomb-shelters-genocide-putin-biden-us-aid-11646231970",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yuri Vanetik",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "WSJ Opinion: Ukraine's Fight for Freedom Is a Lesson for the WestPlay video: WSJ Opinion: Ukraine's Fight for Freedom Is a Lesson for the West\n Review & Outlook: The war in Ukraine may be intensifying, but Vladimir Putin’s invasion isn’t going to plan as Ukrainians show a too complacent West what it means to fight for freedom.",
    "Elsewhere, an associate took umbrage at Mr. Putin’s branding the Ukrainians as neo-Nazis: “We are Jewish!” A rabbi seeking help to feed children and widows at his synagogue and its kindergarten, worries the country will soon starve.",
    "Photo: Emilio Morenatti/Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (3 minutes)\nAD\nLoading advertisement...\n00:00 / 03:15\n1x\nThis article is in your queue.",
    "One friend, head of a think tank in Kyiv, told me the Russians are indiscriminately—or incompetently—firing rockets, one of which took out a Holocaust memorial next to a TV tower.",
    "If Mr. Putin installs a puppet government in Kyiv and goes home, dissidents will wage guerrilla warfare, blowing up bridges and museums in Ukraine—and also in Russia.",
    "Another man says that Russian intelligence, the FSB, leaked the locations of Chechen battalions to the Ukraine military because the Russians hate the Chechen army.",
    "As one friend put it, by the time economic sanctions begin to bite, Ukraine will look like the desolation of “Mad Max.” Apparently that film remains popular there.",
    "Even if Russia went on the offensive, they doubted it would last: Why would Vladimir Putin want to take on 43 million new problems?",
    "WSJ Opinion: Ukraine's Fight for Freedom Is a Lesson for the West\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "A wealthy Ukrainian said Mr. Putin’s invasion has barely begun and that the Russian ruler wants to level Ukraine and move west.",
    "A similar view comes from a retailer who told of hiding his frightened wife and children in a storage area of one of his shops.",
    "He cited reports that the Russian ruler takes growth hormones, isolates himself, and fears being poisoned or getting sick.",
    "Open Queue\nIn the weeks before the attack on Ukraine, a dozen different friends there told me it wouldn’t happen.",
    "Images: AFP via Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Some also weren’t confident that their army, much less the cynical citizenry, would pick up arms to fight.",
    "Two days into the Russian invasion, my friends, in equal parts shock and bravado, said Ukraine will win.",
    "He said he has heard that Chechens, known for their brutal tactics, were sent to slaughter Ukrainians.",
    "Ukrainians are world-weary, worn down by high unemployment, slack growth and government corruption.",
    "They fear that entire cities are being leveled and Russia may escalate its attack into a genocide.",
    "All my contacts in Ukraine warn that the U.S. response has been tepid, slow and insufficient.",
    "A woman flees with her family across a destroyed bridge on the outskirts of Kyiv, March 2.",
    "A former prosecutor said his security team caught Russian advance teams scouting targets.",
    "0:00 / 4:32\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "One said this invasion will be worse for Russia than Afghanistan in the 1980s.",
    "Underground bomb shelters nearby have poor ventilation and could collapse.",
    "A few days later, the forecasts in my circle are growing more pessimistic.",
    "Now they say the Russian assault has galvanized and united their people.",
    "“He is paranoid.”\nThe sentiment is spreading that he has lost his mind.",
    "Mr. Vanetik is an energy and real-estate investor in California.",
    "(I was born in Soviet Ukraine; my family fled in the 1970s.)",
    "He feels Mr. Putin won’t stop until Ukraine is obliterated.",
    "“Putin used to be careful, but not anymore,” said one pal.",
    "His crying children hide in their home’s elevator shaft.",
    "They would turn Ukraine into the Somalia of Europe.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8"
  ]
}