{
  "id": 17541,
  "mediaId": 2618,
  "date": "2022-03-04",
  "headline": "The federal government paid hundreds of media companies to advertise the COVID-19 vaccines while those same outlets provided positive coverage of the vaccines",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/04/the_federal_government_paid_hundreds_of_media_companies_to_advertise_the_covid-19_vaccines_while_those_same_outlets_provided_positive_coverage_of_the_vaccines_80468.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Pandolfo",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Not only that, but it would be nutritionally adequate and meet the constraints for what can be feasibly consumed, according to experts\nFollowing reports that Elon Musk may be nearing a deal with the Twitter board to buy the company, leftist “verified” accounts on the platform once again went into meltdown mode at the prospect of the Musk, the self-described free speech absolutist, taking over.“Leaving Twitter” began to trend shortly after the reports of Musk-Twitter talks.",
    "“If he were to come back as the U.S. president, I think it would represent a pretty dramatic departure for the world, and they would rethink whether they can count on the United States to lead NATO to lead other nations as they push back against China and against Russia,” Romney said\nWhile President Joe Biden was in Brussels and Warsaw showing U.S. solidarity with Ukraine, the 38-year-old autocrat who rules North Korea made a bold bid for the president’s attention.",
    "In response to a FOIA request filed by TheBlaze, HHS revealed that it purchased advertising from major news networks including ABC, CBS, and NBC, as well as cable TV news stations Fox News, CNN, and MSNBC, legacy media publications including the New York Post, the Los Angeles Times, and the Washington Post, digital media companies like BuzzFeed News and Newsmax, and hundreds of local newspapers and TV stations.",
    "\"This Wokeness – with its dismissal and replacement of sacrosanct texts – is also anti-Lutheran inasmuch as it defies what I have been teaching and publishing as 'the first principle of Lutheran thought:'\nJeff Bezos on Monday questioned whether his fellow billionaire Elon Musk could be making Twitter vulnerable to pressure from China, as a result of Musk's extensive business liabilities in the Asian nation.",
    "Charles Blow, a New York Times columnist who describes Trump supporters as “angry white men,” said he would “say goodbye” to the platform\nSpotify will not renew its exclusive podcast partnership with Michelle and Barack Obama, according to Bloomberg.Michelle and Barack Obama are leaving Spotify after the audio streaming giant reportedly dropped its podcast deal to the first couple.",
    "As you say your nightly prayers to Saint Elon while you fall asleep tonight, reflect on why you punch down on poor people\nOver the last 16 tortuous months of the Biden presidency, it’s become clear that the Democrats are running on empty.They are not even trying to reset their electorally poisonous policies.Politically this means they are heading for annihilation at the midterms.",
    "According to the Daily Mail, the couple had a clash with the streaming giant over “exclusivity and how much they were expected to appear in episodes.”Newsmax reported: Spotify is not renewing its podcast contract with former President Barack Obama and former First Lady Michelle Obama, which expires this year, Bloomberg reports.",
    "In an essay that was published on Feb. 14 in the Christian News Missouri, Dr. Gregory Schulz wrote the search criteria for a new university president include someone who exhibits a \"demonstrated belief in and commitment to equity and inclusion and who promotes racialized diversity in all its myriad forms.\"",
    "Earlier, Psaki had been asked about the death of Texas Army National Guard member Bishop Evans, who went missing Friday after attempting to rescue two migrants\nOctogenarian House Speaker Nancy Pelosi, the third in line for presidential succession, is slated to appear in a drag show hosted by RuPaul.",
    "And they will feel great – with true greatness – if imposing silence on the voices of passion, whether collective or private, and leaving reason to\nConcordia University Wisconsin officials suspended a professor over an essay he wrote that criticized them as being \"under the influence of Woke-ism.\"",
    "Milwaukee County District Attorney John Chisholm refused a request to sign off on a Milwaukee Police search warrant to search the north-side house where Acting Mayor Cavalier Johnson’s brother, Allen Addison, was holed up during a two-hour standoff last week, Wisconsin Right Now has learned.",
    "Officers were responding to a call for shots fired in the area of Chouteau and 7th around 3 a.m. Saturday morning when police say a man stepped into traffic, walked to the passenger side of the police vehicle and pointed a handgun at them.CORRECTION*\nNothing is lost with peace.",
    "China is Tesla's second largest market,\nFormer Good Place actress turned obnoxious leftist activist Jameela Jamil has quit Twitter over Elon Musk purchasing the platform.Jamil specifically cited her anti-free speech sentiments as the reason for her departure.“Ah he got twitter.",
    "'If we just dial it back a few years to kind of what we inherited here, the former president invested billions of dollars in a border wall that was never going to work or be effective instead of working toward comprehensive immigration reform,' Psaki said at the press briefing.",
    "Surveillance video featured in conservative filmmaker Dinesh D’Souza’s upcoming movie “2000 Mules,” reportedly shows people coming out of their cars “night after night” with piles of ballots, and stuffing them into drop boxes funded by Facebook CEO Mark Zuckerberg.",
    "And I’m going to be talking to him today.”(Snip)It is not the first time foreign leaders\nA Democratic congressional candidate in Washington State is arguing for a $30 per hour minimum wage, claiming that the $15 minimum wage movement is an outdated number.",
    "As a result, the house where the Acting Mayor’s felon brother defied police for hours while wanted on a felony warrant, was not searched for additional occupants (even though it was believed other people were inside), and it was not searched for evidence.",
    "How could Sussmann both simultaneously assert that he was acting on his own accord and not being paid by the Hillary campaign while at the same time having Hillary for America and Fusion GPS assert attorney-client privilege over their communications?",
    "During the 2020 election, ballot traffickers in Georgia allegedly stopped at Democrat gubernatorial candidate Stacey Abrams’ headquarters, and at least one other Democrat Party office in between their runs to stuff unmanned drop boxes with ballots.",
    "never heard my friend William F. Buckley, Jr., opine about the merits or deficiencies of “populism.” But I often heard him discourse about the virtues of liberty and the political, social, and moral liabilities of the Left-liberal consensus.",
    "Speaking last week at the White House about the Affordable Care Act, Barack Obama said that he looks forward to Joe Biden’s “next chapter in our story of progress.” In other words, Biden will make Obamacare even worse.",
    "“I’d rather be governed by the first 2,000 names in the Boston telephone directory,” he said, “than by the 2,000 people on the faculty of Harvard University.” Was this wealthy and sophisticated gadfly pulling our leg?",
    "These outlets were collectively responsible for publishing countless articles and video segments regarding the vaccine that were nearly uniformly positive about the vaccine in terms of both its efficacy and safety.",
    "I mean, I get it on some levels: Oz isn’t great on the issues, isn’t a conservative rockstar (as if Pennsylvania produces any), and is an unknown commodity in electoral politics (see Trump, Donald J., circa 2015).",
    "They found that if people in Europe replaced meat and dairy with foods produced through new technologies, such as making fake steak out of bovine cells, it could significantly reduce all environmental impacts.",
    "?” Jamil tweeted, along with four photos of herself\nPresident Biden said Monday that French President Emmanuel Macron didn’t take his call to congratulate the French leader on his election night victory.",
    "Sen. Mitt Romney on Tuesday criticized his Republican colleagues' attacks against President Joe Biden's Supreme Court nominee Judge Ketanji Brown Jackson's record on child pornography cases.",
    "Observers quickly noted the similarity in sentiment to loud declarations from prominent leftists that they would move to Canada if Donald Trump won the election in 2016 (few, if any, did).",
    "Negotiating with good will and with respect for each other ’ s rights, let them realize that an honorable success is never precluded when there are sincere and active negotiations.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Their own data shows that the jab has killed and injured more people than all other vaccines injuries in history - but apparently, it killed kills US Citizens in a 'safe' way.",
    "Like the Fantastic Mr. Fox, they have a cunning plan.They might not be any good at governing, but when it comes to seizing power by foul means or fair, they are world-class.",
    "Swapping animal products for future foods such as insect protein or cultured milk could reduce global warming, water and land use by over 80 per cent, a new study suggests.",
    "Sen. Mitt Romney, R-Utah, said Tuesday in a CNN interview that if former President Donald Trump won the 2024 election, the NATO alliance would be significantly damaged.",
    "Researchers used computer modelling to find the optimal diet combination to meet nutritional needs, while also minimising global warming potential, water and land use.",
    "White House press secretary Jen Psaki blasted former President Donald Trump on Monday for spending time building a border wall instead of pursuing immigration reform.",
    "For the first time since 2017, Kim Jong Un test-fired an intercontinental ballistic missile, the Hwasong-17, the largest road-mobile missile ever launched.",
    "Ever notice the required-by-law babbling of known side effects, risks, and complications that comes at the end of every prescription medicine commercial?",
    "It will be Joe Biden’s biggest win to date, though it does nothing to solve the inflation, gas price, supply chain, southern border, or Ukraine crises.",
    "\"It struck me that it was off course, meaning the attacks were off course that came from some,\" Romney told The Washington Post's Paul Kane on Tuesday.",
    "They attempted to assert attorney-client privilege over materials that John Durham’s prosecution of Michael Sussmann is seeking to get its hands on.",
    "Xavier Becerra, Biden’s Health and Human Services Secretary, seeks to force them to perform transgender surgeries, among other immoral procedures.",
    "I don’t know where Soros is coming from on this but Russian propaganda is flooding the internet and our gullible media will fall for anything.",
    "'Interesting question,' mused Bezos, who in 2013 bought The Washington Post with a view to protecting free speech and supporting journalism.",
    "While it flew 600 miles from Pyongyang into the Sea of Japan, the mammoth missile flew for 71 minutes, reaching an altitude of 3,852 miles.",
    "Perhaps more amazing than the fact that Pelosi is appearing in this event at all is the fact that this isn’t the first time she’s done it.",
    "Neither country in this war are purely admirable to say the least but Ukraine is a sovereign nation and you have to admire their courage.",
    "Compared with a program it replaced, the Washington College Grant allowed many more students to qualify for free or subsidized tuition.",
    "A transgender pride flag now flies above HHS, the “first federal agency to do so,” the department announced in a recent press release.",
    "The reaction by some to Donald Trump’s endorsement of Dr. Mehmet Oz in the U.S. Senate race in Pennsylvania seems a bit over the top.",
    "Romney, the 2012 GOP presidential nominee, said NATO members would wonder whether they could continue to count on the United States.",
    "Mr. Biden said he spoke with Mr. Macron’s staff when he tried to reach the French president Sunday night and he’ll try again Monday.",
    "I fear this free speech bid is going to help this hell platform reach its final form of totally lawless hate, bigotry, and misogyny.",
    "Rebecca Parson, a candidate for Washington’s 6th District that includes Tacoma, shared the comment recently in a post on Twitter.",
    "“I feel good about the French election,” Mr. Biden told reporters after returning to Washington from a weekend trip in Delaware.",
    "Had it been fired in a normal trajectory, its missile warheads could have reached Washington, D.C., and every city in the USA.",
    "This after the media just spent the last three months broadcasting story after story of fully vaccinated people getting Covid.",
    "But everyone needs to take a deep breath and understand that Oz is 10 times better than former hedgefund CEO Dave McCormick.",
    "Election integrity activists used geospatial technology to track the ballot harvesters’ cellphones to precise locations.",
    "'He commented atop a retweet from a New York Times journalist, noting that Musk's Tesla was extremely exposed to China.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Sen. Mitt Romney (R-UT) will be voting to confirm Judge Ketanji Brown Jackson for the United States Supreme Court.",
    "A glimpse of that next chapter can be seen in the Biden administration’s unfolding war on religious hospitals.",
    "LONGVIEW — In 2019, Washington created one of the most generous college financial aid programs in the country.",
    "A man is in custody after St. Louis police say he tried to carjack two officers in a fully marked police car.",
    "Public four-year institutions saw a collective drop in undergraduates of nearly 7% during that time period",
    "Last Tuesday, RedState reported on two desperate filings put forth by Hillary for America and Fusion GPS.",
    "The most obnoxious one I've seen is one the state of Maryland made using kids pushing the vaccine.",
    "Community and technical colleges experienced a combined 24% drop between fall 2019 and fall 2021.",
    "In my view, what we call “populism” was an important ingredient in liberty as WFB understood it.",
    "One thing you know is that the Dems are not hiding under the duvet sucking their thumbs.",
    "No longer would eligible students be denied aid because of caps tied to limited funds.",
    "The show, titled RuPail’s Drag Race All-Stars, is scheduled to premiere on May 20th.",
    "Yet they appear curiously relaxed, as if winning elections is no longer a priority.",
    "“None of that is normal,” an upset law enforcement source told Wisconsin Right Now.",
    "This type of propaganda is straight out of communist China or the old Soviet Union.",
    "The commercials all assure us that doctors and the government says they are SAFE.",
    "The entire nation has been used just like Fauci used those poor doomed orphans.",
    "'Did the Chinese government just gain a bit of leverage over the town square?",
    "Ever notice how there are never warnings after a COVID \"vaccine\" commercial?",
    "They have a kid saying, \" The vaccine will prevent me from getting Covid\".",
    "By all rights, the state's colleges should have seen a rush of applicants.",
    "I spoke to his staff and he was at the Eiffel Tower having a good time.",
    "[Tweet] “1 adult supporting 1 kid needs $30 an hour across the country.",
    "Now there is a nuclear plant that the Russians bombed and set on fire.",
    "Lisa Murkowski (R-AK) and Susan Collins (R-ME) in confirming Jackson.",
    "Your donation helps keep our discussions going and our voices heard.",
    "This could be a real disaster if a meltdown can’t be controlled.",
    "She will be the first black woman to serve on the Supreme Court.",
    "He won’t get a bump in the polls from this confirmation battle.",
    "These are aggressive-progressive Woke mantras,\" Schulz wrote.",
    "I would like this to be my what lies here as my last tweet.",
    "We have to be patient and dig down for the real facts.",
    "That was the point of one of his most famous mots.",
    "Just really *any* excuse to show pics of Barold.",
    "Europe is already sticking up on iodine pills.",
    "If you’re Trump, you have political capital.",
    "That left the obvious question open, though.",
    "And in Trump’s mind, maybe 50 times better.",
    "“$15 minimum wage is an antiquated demand.",
    "Rural, urban, suburban: $30 is the floor.",
    "It should be $30 per hour,” she tweeted.",
    "The false advertising is still going on.",
    "“I tried to talk to him last night.",
    "Let men return to understanding.",
    "\"And there is no there, there.\"",
    "Landon covered this last night.",
    "It's always those three—always.",
    "Instead, enrollment plummeted.",
    "Let them resume negotiating.",
    "All can be lost with war.",
    "I support Ukraine also.",
    "Outright blatant lies.",
    "Romney will join Sens.",
    "Best of luck.",
    "Thank you.",
    "Well, #5.",
    "?",
    "."
  ]
}