{
  "id": 17565,
  "mediaId": 2830,
  "date": "2022-03-02",
  "headline": "The Lesson of Budapest? Hold On to Your Nuclear Weapons",
  "image": "",
  "link": "https://www.wsj.com/articles/the-lesson-of-budapest-hold-on-to-your-nukes-ukraine-russia-invasion-nuclear-weapons-proliferation-11646257487",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Ullyot and Thomas D. Grant",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Grant served as senior adviser for strategic planning in the State Department’s Bureau of International Security and Nonproliferation, 2019-21, and is author of “Aggression Against Ukraine: Territory, Responsibility, and International Law.”\nWSJ Opinion: Putin’s Ukraine Invasion Exposes Europe's Energy Dilemma\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "WSJ Opinion: Putin’s Ukraine Invasion Exposes Europe's Energy DilemmaPlay video: WSJ Opinion: Putin’s Ukraine Invasion Exposes Europe's Energy Dilemma\n As Vladimir Putin's invasion of Ukraine intensifies, Western markets hold up, but Russia’s financial system takes a beating.",
    "Whatever the endgame, Russia’s invasion of Ukraine sends a powerful signal to all countries with unrealized nuclear ambitions: If you abandon your nuclear program and entrust your security to formal guarantees and conventional deterrence, you gamble with your future.",
    "Photo: Alexander Zemlianichenko/Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (4 minutes)\nAD\nLoading advertisement...\n00:00 / 03:33\n1x\nThis article is in your queue.",
    "Until this week, only two countries since 1945 had faced an attack quite like Russia’s against Ukraine today—that is, an attack aimed at the total eradication of their national sovereignty.",
    "Libya ended its efforts to obtain weapons of mass destruction in the early 2000s, when it became clear that the security risks of continuing those efforts far outweighed any gains.",
    "Mr. Putin has repeatedly declared that Ukraine is not a state, and he insists on surrender terms that would leave the country as nothing more than an appendage to his regime.",
    "Making clear to countries that might contemplate developing or holding nuclear weapons that they are safer without them has been essential to preventing proliferation.",
    "Open Queue\nPowerful images of the Ukrainian people’s unexpectedly stiff resistance to Russian invasion have shined a spotlight on the 1994 Budapest Memorandum.",
    "Vladimir Putin is demonstrating that these weapons give an aggressor license to attack and that without them, a peaceful nation is at the aggressor’s mercy.",
    "Brazil and Argentina in the 1960s through the 1980s were in an escalating race to build their own atomic weapons, but both eventually agreed to stop.",
    "South Africa developed its own atomic bomb and had a small stockpile but got rid of its arsenal voluntarily as it moved toward ending apartheid.",
    "In exchange for this concession, Russia and the West pledged to respect the former Soviet state’s sovereignty and territorial integrity.",
    "Ullyot served as deputy assistant to the president for national security affairs and National Security Council spokesman, 2019-21.?Mr.",
    "Because Mr. Putin’s forces have failed to achieve the quick and easy win in Ukraine that he expected, he hints at nuclear escalation.",
    "Images: Reuters/Sputnik/AFP via Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Naturally, Ukrainians wondered whether they had left themselves exposed by giving up their nuclear deterrent 20 years earlier.",
    "Today, as Russia aims to subjugate the entire country, that question is again on at the front of Ukrainians’ minds.",
    "Russian ballistic missiles roll in Red Square during the Victory Day military parade in Moscow, June 24, 2020.",
    "?Many countries, including malign actors watching Russia’s actions, will inevitably now seek their own nukes.",
    "The U.S. and its allies have an enormous responsibility to get this new security challenge right.",
    "0:00 / 4:46\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Until now, there had been grounds for cautious optimism about nuclear nonproliferation.",
    "Kuwait was saved by prompt, American-led international action against Iraq in 1991.",
    "Meanwhile, Europe's reliance on Russia for energy complicates the West's strategy.",
    "Nuclear-weapons programs in Syria and Iraq were ended by forcible interventions.",
    "Then, in 2014, Russia seized Crimea, territory that was indisputably Ukrainian.",
    "If you give up your nukes, you give up your national security ace-in-the-hole.",
    "Under the agreement, Ukraine gave up the nuclear weapons on its territory.",
    "Israel has saved itself from extinction numerous times.",
    "Now Ukraine is locked in a battle for its existence.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "?Mr."
  ]
}