{
  "id": 17672,
  "mediaId": 2702,
  "date": "2022-03-04",
  "headline": "The Hill’s Morning Report – Russia’s war against Ukraine grinds on",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/nuclearplantukraine.jpg?w=1280",
  "link": "https://thehill.com/homenews/morning-report/596840-the-hills-morning-report/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The president didn’t mention “Build Back Better,” Anthony Fauci, or the U.S. troop withdrawal from Afghanistan during his address, so the best answer from our menu was “all of the above.”\nBiden told Americans (and members of Congress) that “social media platforms” should be held accountable by law for “the national experiment they’re conducting on our children for profit.”\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Champions all: Neil Bergsman, Jeremy Serwer, Pam Manges, Randall S. Patrick, Richard O. Fanning, Jane Heaton, Gary Kalian, Jon Berck, Candi Cee, Ki Harvey, Eric Lanter, Patrick Kavanagh, Jonathan Scheff, Robert Bradley, Jack Barshay, Ilene Kantrov, Mary Frances Truco, Sharon Banitt, Chuck Breidenbach, Lynne Warner, Frank Ballmann, Gary Duncan, Margo Lomax, Sandy Walters, Joe Erdmann, David Tapley, Harry Strulovici, Terry Pflaumer, Jim Pate, John Donato, Jaina Mehta and Stuart Babendir.",
    "Zelensky (pictured below), who has devoted considerable time and technique to keeping his country front-facing in the news media as a way to fortify chances of Ukraine’s survival, is portrayed in Western coverage as a quote-savvy “people’s president” (The Daily Beast), a T-shirted international icon (The Hill) who has “united the world” while photographed amid stacks of sandbags and Ukraine’s flag (TIME).",
    "Following the State of the Union address, Manchin indicated that he would back moving a bill through the cumbersome budget reconciliation process that dramatically cuts Biden’s cornerstone domestic proposal to just climate change provisions, prescription drug reform and tax alterations — a call that has set off liberals, as it would leave a number of top progressive priorities on the cutting room floor.",
    "… On Sunday, Harris will be in Selma, Ala., to commemorate Bloody Sunday on the Edmund Pettus Bridge with a large contingent from the Cabinet, including Housing and Urban Development Secretary Marcia Fudge, Transportation Secretary Pete Buttigieg, Education Secretary Miguel Cardona, Environmental Protection Agency Administrator Michael Regan and Veteran Affairs Deputy Secretary Donald Remy.",
    "Russian forces have made their most significant inroads in the south, where the Kremlin strategy appears to be to try to capture Ukraine’s entire Black Sea coast, including Mariupol, which on Thursday was surrounded by invading troops, although the Ukrainians today still have control there, according to a British intelligence update (Reuters and The New York Times).",
    "Ukrainian President Volodymyr Zelensky held his first press conference since the start of the war, amplifying his frequent appearances in news media interviews and his own statements, videos and pleas posted to social media as the war’s toll mounts and more than a million Ukrainians, mostly women and children, continue to flee across borders.",
    "> Jan. 6 latest: Hundreds of pages of court documents filed by the Jan. 6 committee offer new details about the extent of the Trump team’s pressure campaign on former Vice President Mike Pence as they unsuccessfully pushed numerous tactics to convince him to buck his ceremonial duty to certify the 2020 election results.",
    "What’s more, records filed by the panel also show new details about the “blunt and direct” language used in a January 2021 White House meeting where Trump considered firing Justice Department leaders who would not carry out an investigation into his baseless claims of voter fraud (The Hill).",
    "LEADING THE DAY\nCONGRESS: As the immortal Don Draper once put it: “If you don’t like what’s being said, change the conversation.” And that is now the mission of the White House and Democrats as they seek to rebrand the Build Back Better agenda after failing to move it through the Senate.",
    "“Our interest is in maintaining the strongest unified economic impact campaign on Putin in all history, and I think we’re well on the way to doing that.”\nThe Washington Post: The U.S. granted temporary protected status to tens of thousands of Ukrainian immigrants already in this country.",
    "MBS SPEAKS: Saudi Crown Prince Mohammed bin Salman tells The Atlantic in his first interview to the non-Saudi press in more than two years that he did not order the murder of journalist Jamal Khashoggi (and claims that his own rights have been violated in connection with the killing).",
    "OPIOID SETTLEMENT: OxyContin maker Purdue Pharma reached a nationwide settlement Thursday, which if approved by a bankruptcy court, would mean the Sackler family, owners of the company, would boost their cash contribution to as much as $6 billion in response to the opioid crisis.",
    "Ukrainian air defenses are still intact and have been effective against the missiles, the official said, adding that Russia’s progress in the south has been aided by the country’s eight-year presence in Crimea, where it has built infrastructure and systems to sustain troops.",
    "“Your country will pay dearly because it will end up as an isolated country, weakened and under sanctions for a very long time,” Macron told Putin, according to a French official, who added that Macron “called on Vladimir Putin to not lie to himself” (The Washington Post).",
    "The evidence, filed late Wednesday as part of a court case to compel the release of documents from Trump campaign attorney John Eastman, showcases the exasperation of the Pence team as they pushed back on pleas that only got more desperate leading up to Jan. 6 (The Hill).",
    "> Energy politics: Many Republican candidates this year are critical of administration energy policies, although analysts say higher prices for gasoline are not the result of Biden’s policies tied to the Keystone XL pipeline or domestic oil and gas leasing (The Hill).",
    "Russian and Ukrainian representatives, huddled at an undisclosed location, agreed to the cease-fires but only where humanitarian corridors are established and for the duration of civilian evacuations, according to Ukrainian presidential aide Mykhailo Podolyak (BBC).",
    "White House press secretary Jen Psaki made the name change official on Thursday, telling reporters that “Building a Better America” is now the “formal” successor to the dormant $2 trillion social spending proposal tanked by Sen. Joe Manchin (D-W.Va.) in December.",
    "Russian President Vladimir Putin, speaking publicly on Thursday, again defended the country’s war with Ukraine, saying it was “going to plan” while promising the families of Russian military casualties a special payout of 5 million rubles or nearly $50,000 each.",
    "> Texas turnout: Candidates in majority-Hispanic parts of the Lone Star State set primary turnout records Tuesday — and Democrats counting on favorable demographic trends to flip the state saw slippage among some of their most reliable voters.",
    "The president will receive the President’s Daily Brief at 10 a.m. Biden at 12:25 p.m. will make an announcement related to the “Made in America” focus he mentioned in his State of the Union address (The Hill’s Alex Gangitano has details HERE).",
    "COURTS: A Kentucky jury on Thursday acquitted Brett Hankison, a former police officer, on charges of wanton endangerment after he fired 10 shots into an apartment during the 2020 drug raid that ended with the death of Breonna Taylor.",
    "French President Emmanuel Macron spoke with Putin for 90 minutes on Thursday, telling reporters afterward that he anticipated the worst lies ahead for Ukraine after Putin told him Russia would not stop until it reaches its goals.",
    "“These individuals and their family members will be cut off from the U.S. financial system, their assets in the United States will be frozen and their property will be blocked from use,” the administration announced (The Hill).",
    "> Former Attorney General William Barr has an autobiography he wants to sell you (and a professional reputation he wants to rescue): NBC News anchor Lester Holt will interview Barr during a primetime special on Sunday at 9 p.m.",
    "Russia on Thursday continued its brutal offensive to seize cities and port areas in Ukraine, even as it agreed with Ukrainian officials to create “humanitarian corridors,” or temporary local cease-fires for escaping civilians.",
    "Washington has reportedly sent hundreds of stinger missiles as part of the latest package of defensive aid and has approved the shipment by allied nations of American-made weapons to Ukraine, which is a non-NATO country.",
    "The U.S. has 100,000 troops in Europe, and the Pentagon told lawmakers on Tuesday that the addition of forces to Eastern European NATO-member countries on a long-term basis is under consideration (Defense News).",
    "It calls for members of the family to give up control of the Connecticut-based company so it can be turned into a new entity with profits used to fight the crisis in which OxyContin played a significant role.",
    "Blinken is in Brussels for a NATO foreign ministerial gathering and meetings with EU counterparts and a G7 ministerial event, all tied to the global response to Russia’s invasion of Ukraine.",
    "The U.S. government also sanctioned Kremlin spokesman Dmitry Peskov, described by the White House as a “top purveyor of Putin’s propaganda.” Both men were sanctioned by the European Union.",
    "Zelensky appealed anew to Western allies to create a no-fly zone to fortify defenses from the air, an idea NATO countries have shelved out of fear it could increase Putin’s wrath (Axios).",
    "“The goal was to maximize the impact on Putin and Russia and minimize the harm on us and our allies and friends around the world,” President Biden said during a Thursday Cabinet meeting.",
    "The vice president will hold a bilateral meeting at 1:10 p.m. with the Crown Prince and Prime Minister Salman bin Hamad Al Khalifa of Bahrain in her ceremonial White House office.",
    "Such a seemingly small and obvious change is far from certain to pass, however, underscoring the influence of special interests, even during a national worker shortage (The Hill).",
    "Sen. John Cornyn (R-Texas), a top ally of Senate Minority Leader Mitch McConnell (R-Ky.), tweeted shortly after that, “Rebranding doesn’t change bad policy.” Others were harsher.",
    "THE CLOSER\nAnd finally … Bravo to the Morning Report Quiz winners, who paid attention during the president’s State of the Union address and managed to ace four trivia questions.",
    "> The House on Thursday approved legislation to allow military families to seek justice for decades of water contamination at Marine Corps Base Camp Lejeune, in North Carolina.",
    "He will hold a bilateral meeting in the Oval Office with Sauli Niinistö, president of Finland, at 2:30 p.m. Biden will depart the White House at 5:35 p.m. for Wilmington, Del.",
    "The White House daily press briefing is scheduled at 1:15 p.m.\nHill.TV’s “Rising” program features news and interviews at http://thehill.com/hilltv or on YouTube at 10:30 a.m.",
    "“When asked about a potential run for the U.S. Senate in January 2021, I gave a simple answer: ‘No.’ In the intervening months a number of people have asked me to reconsider.",
    "Major tech companies have sought to deplatform state-owned RT, Sputnik and other Russian outlets known for dispensing misinformation about the invasion in Ukraine (The Hill).",
    "The United States levied new sanctions on eight members of Russia’s elite and imposed visa restrictions on 19 oligarchs and their relatives, the White House said on Thursday.",
    "The Washington Post: The French Finance Ministry announced Thursday that it seized a $120 million yacht owned by Russian oligarch Igor Sechin, the CEO of oil giant Rosneft.",
    "*****\nCORONAVIRUS: Total U.S. coronavirus deaths reported each morning this week: Monday, 948,397; Tuesday, 950,481; Wednesday, 952,509; Thursday, 954,519; Friday, 956,262.",
    "Overnight, Russian forces shelled a Ukrainian nuclear power complex (above), igniting a blaze that was captured on video and later extinguished without radiation leakage.",
    "The Hill: The White House is considering sending Vice President Harris to Warsaw, Poland, and Bucharest, Romania, to show solidarity with Ukrainians, reports Amie Parnes.",
    "There is no football activity underway at club facilities at this point in the offseason, and the earliest it can begin is April 4 for teams that have hired new coaches.",
    "“If we want to have an economy that’s firing on all cylinders, we want people to be able to go back to work.”\nThe Hill: This week’s must-watch moments on Capitol Hill.",
    "One official told reporters the majority of the Russian missile launches since the war began, or more than 230 of them, are coming from mobile systems within Ukraine.",
    "> Recovery: It was hugs galore for Sen. Ben Ray Luján (D-N.M.) on Thursday as he returned to Capitol Hill for the first time since suffering a stroke in late January.",
    "His announcement ended months of speculation and efforts by party leaders, including McConnell and former President George W. Bush, to recruit the governor to run.",
    "“Every one of you that sent me notes, that sent videos, and all the prayers, it worked,” Luján said, adding that it was “an absolute honor to be back” (The Hill).",
    "Doug Ducey (R) told backers in a letter reported on Thursday that he will not be a candidate in this year’s Senate contest to challenge Sen. Mark Kelly (D-Ariz.).",
    "The Hill’s Morgan Chalfant and Laura Kelly report on surprise decisions in Germany and Switzerland to toughen their respective national postures toward Russia.",
    "The U.S. has contributed more than $1 billion to help Ukraine’s military in the past year and the administration is seeking another $10 billion from Congress.",
    "The emergency and Russia’s seizure of the plant, according to Ukraine, renewed international calls for Moscow to cease its assault (The Associated Press).",
    "The Pentagon in recent days has mobilized some 14,000 troops, along with F-35 strike fighters and Apache helicopters to Poland, Hungary and the Baltics.",
    "However, the bigger problem for Democrats remains within their own ranks, and more specifically, in their struggle to cajole Manchin into supporting it.",
    "The Washington Post: The United Kingdom sanctioned two more Russian oligarchs on Thursday said by the government to have “significant” Kremlin ties.",
    "Ron DeSantis, who has presidential ambitions, is supportive of the measure and eager to put his state at the forefront of the nation’s culture wars.",
    "First lady Jill Biden will travel to Boston and San Francisco to attend private memorial services and fly home to Wilmington on Saturday afternoon.",
    "The Western efforts to help expand Ukraine’s international megaphone are concurrent with efforts to shut down Russia’s conduits for disinformation.",
    "New York City was hit hard and early by COVID-19 infections beginning in 2019 and many (but not all) residents say they are now ready to move on.",
    "The U.S. issued a report last year asserting that bin Salman personally approved Khashoggi’s murder, but Biden waived any punishment (ABC News).",
    "The Wall Street Journal: Republican National Committee seeks to choke funding for Commission on Presidential Debates in escalation of dispute.",
    "More than 150 missiles have been fired from within Russia, more than 70 from Belarus and only a very small number from ships in the Black Sea.",
    "“If he wants to focus on an economic package, then he needs to remember childcare is an economic issue,” said Sen. Elizabeth Warren (D-Mass.)",
    "> International corner: In France, Macron found time to file for reelection on Thursday, a day before the deadline to declare his candidacy.",
    "The southern city of Kherson is close to collapse without a civilian corridor for escape, its trapped residents said (The Washington Post).",
    "He’s been essentially running for office amid an international crisis without officially telling his countrymen he will seek another term.",
    "He has cooperated with the House select committee investigating Trump’s role before, during and after the Jan. 6 attack on the Capitol).",
    "Nineteen times during his hour on live television, the president addressed his audience as “folks,” according to a CNN count of ad libs.",
    "STATE WATCH: Oregon and New Jersey are considering abandoning century-old make-work rules in order to let customers pump their own gas.",
    "The result has been waste, expired doses and a determined effort to find providers who can use the unused doses (The Associated Press).",
    "The legislation says those exposed — even in-utero — to water contamination at the base between August 1953 and 1987 can file a claim.",
    "Advocates say that leaving out longtime priorities, such as home health care for the disabled and elderly, is “outrageous” (The Hill).",
    "As a result, the supply lines to troops in the south of Ukraine are much shorter and more effective, according to the administration.",
    "U.S. options to help Ukraine are still on the table short of putting troops on the ground there, which Biden insists will not happen.",
    "The NFL is definitely ready to put pandemic precautions behind it: the league lifted all COVID-19 restrictions effective on Thursday.",
    "The panel returned a verdict, having weighed the shots fired off through sliding-glass side doors and a window in Taylor’s apartment.",
    "Lawyers for Hankinson argued that the shots came because he thought his fellow officers were “being executed” (The Associated Press).",
    "Secretary of State Antony Blinken is scheduled to be in Poland this week before traveling to Moldova, Latvia, Lithuania and Estonia.",
    "The aim is to squeeze Putin by punishing, blocking, inconveniencing and isolating his wealthiest allies and political supporters.",
    "https://wapo.st/3vAJkFE\nPutin, his rat and six ways the war in Ukraine could end, by Andreas Kluth, columnist, Bloomberg News.",
    "The administration targeted Russian billionaire Alisher Usmanov, whose $600 million yacht was seized by Germany on Wednesday.",
    "Here’s how Biden should respond to his nuclear threats, by Michael McFaul, contributing columnist, The Washington Post.",
    "The Supreme Court appears poised this summer to uphold a Mississippi law that similarly bans abortions at 15 weeks.",
    "Sununu, who is seeking reelection, and Hogan, who is seen as a possible 2024 GOP presidential candidate, declined.",
    "The seven-day average of hospitalized patients with COVID-19 is at the lowest level since last July, CNN reports.",
    "The Senate convenes on Monday at 3 p.m. and will resume consideration of the Postal Service Reform Act of 2022.",
    "The president has said U.S. forces would help defend NATO countries against any Russian attacks (The Hill).",
    "U.S. officials told reporters on Thursday that Russia had fired 480 missiles in its war to capture Ukraine.",
    "“The Biden administration’s ‘Build a Better America’ is just a broken-down car with a new coat of paint.",
    "Barr also will appear Tuesday on “CBS Mornings.” (He was AG under Trump and former President George H.W.",
    "We get you up to speed on the most important developments in politics and policy, plus trends to watch.",
    "Economic indicator: The Bureau of Labor Statistics will report at 8:30 a.m. about February employment.",
    "The New York Times: Florida lawmakers on Thursday voted to ban abortions after 15 weeks of pregnancy.",
    "The deal would not shield Sackler family members from future criminal charges (The Associated Press).",
    "They knew that Biden during his big speech said Putin had “badly miscalculated” by invading Ukraine.",
    "But Thursday’s change will still affect life for coaches and other staff members right away (ESPN).",
    "The GOP vote in 35 counties, most of them majority-Hispanic, broke records (The Washington Post).",
    "The bill effectively would override a North Carolina legal hurdle that has blocked such lawsuits.",
    "The New York Times: “Traitors get shot”: Guy Reffitt’s son testifies against him in Jan. 6 trial.",
    "CNN: The first foreign fighters are now in Ukraine to help his country’s defenses, Zelensky said.",
    "In a note to donors, Ducey said that he is unchanged in what he told them back in January 2021.",
    "We invite you to share The Hill’s reporting and newsletters, and encourage others to SUBSCRIBE!",
    "GET ON THE LIST\nIntroducing NotedDC: The Hill’s curated commentary on the beat of the Beltway.",
    "I’m honored by the confidence and interest you’ve shown in my public career,” Ducey wrote.",
    "Luján, 49, received a standing ovation upon entering a Senate Commerce Committee meeting.",
    "States are being left with large stockpiles of COVID-19 vaccine doses as demand falls.",
    "The Associated Press: Neutral Finland and Sweden warm to the idea of NATO membership.",
    "RT America on Thursday announced it ceased production and laid off its staff (CNN).",
    "The magazine’s interview is part of broader reporting about Saudi Arabia’s future.",
    "They care about what it’s going to do,” Psaki said at Thursday’s daily briefing.",
    "It might look new, but it won’t get us very far,” said Sen. Tim Scott (R-S.C.).",
    "McConnell and establishment Republicans had hoped to recruit New Hampshire Gov.",
    "The Morning Report is created by journalists Alexis Simendinger and Al Weaver.",
    "Please recommend the Morning Report to friends and let us know what you think.",
    "Larry Hogan (R) to launch bids for the upper chamber, in addition to Ducey.",
    "“If you’re going to run for public office, you have to really want the job.",
    "https://bloom.bg/3vzIYPP\nWHERE AND WHEN\nThe House meets on Monday at noon.",
    "How ready New Yorkers are depends on whom you ask (The Associated Press).",
    "The secretary is on a six-nation trip through Tuesday (schedule is HERE).",
    "… Right now I have the job I want” (Arizona Central and The Hill).",
    "In all, the plan could be worth more than $10 billion over time.",
    "Take our newsletter survey to provide feedback on our offerings.",
    "The New York Times: Lawmakers push to ban Russian oil imports.",
    "France believes Putin seeks to seize and hold all of Ukraine.",
    "Readers can find us on Twitter @asimendinger and @alweaver22.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "It did not take long for Republicans to pillory the move.",
    "Email: asimendinger@thehill.com and aweaver@thehill.com.",
    "Alexis Simendinger and Al Weaver are the co-creators.",
    "“No one cares about the name in the American public.",
    "The Hill: Zelensky says he wants to talk with Putin.",
    "The Associated Press: Day 9 of war and what to know.",
    "Click here to subscribe to our latest newsletter.",
    "when asked about Manchin’s pared-down proposal.",
    "The bill now moves to the Senate (The Hill).",
    "IN FOCUS/SHARP TAKES\nPOLITICS: Arizona Gov.",
    "Election Day is April 10 (The Guardian).",
    "“My mind hasn’t changed,” he continued.",
    "Welcome to The Hill’s Morning Report.",
    "OPINION\nPutin is menacing the world.",
    "Chris Sununu (R) and Maryland Gov.",
    "Also, we want to hear from you!",
    "The White House is resisting.",
    "We want to hear from you!",
    "ET at Rising on YouTube.",
    "CLICK HERE to subscribe!",
    "Florida Republican Gov.",
    "It is Friday!",
    "ELSEWHERE\n?",
    "Bush.",
    "ET.",
    "?",
    "?",
    "?"
  ]
}