{
  "id": 17691,
  "mediaId": 6406,
  "date": "2022-02-28",
  "headline": "Joe Biden Has to Win Over Members of His Own Party During State of the Union",
  "image": "https://americarisingpac.org/wp-content/uploads/2020/01/GettyImages-1200357959-e1581453045279.jpg",
  "link": "https://americarisingpac.org/joe-biden-has-to-win-over-members-of-his-own-party-during-state-of-the-union/",
  "mediaOutlet": "americarisingpac.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "https://t.co/aXex1L1su9\n— Cheri Beasley (@CheriBeasleyNC) September 3, 2021\nMeanwhile, Mark Kelly (D-AZ), Conor Lamb (D-PA), Raphael Warnock (D-GA), and Catherine Cortez Masto (D-NV), haven’t praised the president since January of this year.",
    "https://t.co/zUYvaEmJnS\n— Abby Finkenauer (@Abby4Iowa) July 28, 2021\nThis investment in 100k new affordable housing units by @POTUS—with plans to create 2 million more—is a historic step in the right direction.",
    "As Joe Biden prepares to deliver his first State of the Union address, he’s grappling with a failing agenda, another international crisis, and a Democratic Party that is avoiding him like the plague.",
    "Vulnerable Democrats have been skipping out on appearances with the president in their home states, and now, many Senate candidates are keeping his name off their social media pages.",
    "For candidates such as Abby Finkenauer (D-IA), Mandela Barnes (D-WI), and Cheri Beasley (D-NC), it’s been months since the last time they embraced Joe Biden on Twitter.",
    "It’s no wonder Democratic Senate candidates are doing whatever they can to keep him and his administration’s record as far away from their campaigns as possible.",
    "When we have Davis Bacon & Made in America attached to our federal projects THAT’s what makes the difference around kitchen tables in Iowa & our country.",
    "Congress must follow in the White House's footsteps to expand access to affordable housing supply nationwide.",
    "Grateful @POTUS is committed to protecting these requirements as states like Iowa try to get around them.",
    "Bottom line: Joe Biden’s agenda is painfully out of touch with the issues faced by everyday Americans.",
    "Share this article:",
    "This is important."
  ]
}