{
  "id": 17857,
  "mediaId": 2548,
  "date": "2022-03-03",
  "headline": "Senate Passes Joint Resolution To End National COVID-19 Emergency",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/03/Photo-by-Anna-MoneymakerGetty-Images-2232111-e1646353063786.jpg",
  "link": "https://dailycaller.com/2022/03/03/senate-passes-joint-resolution-end-national-covid-19-emergency-roger-marshall/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Therefore, the Administration strongly opposes Senate Joint Resolution 38, which would terminate the national emergency declared on March 13, 2020, and unnecessarily and abruptly curtail the ability of the Administration to respond to the COVID-19 pandemic,” the Office of Management and Budget (OMB) said in a statement.",
    "(RELATED: Capitol Attending Physician Announces Face Masks Will Be Optional Ahead Of Biden’s State Of The Union Address)\nThe COVID-19 national emergency was originally declared by former President Donald Trump Trump on March 13, 2020.",
    "The U.S. Senate passed a nonbinding joint resolution Thursday that would end the national COVID-19 emergency after President Joe Biden extended the declaration in February.",
    "Hope our House colleagues join us in returning the ability to make decisions related to the virus back to the American people,” Marshall said in a tweet after the vote.",
    "The Democrats who were not present for the vote were: Arizona Sen. Mark Kelly, California Sen. Dianne Feinstein, and California Sen. Alex Padilla, The Hill reported.",
    "https://t.co/pQSAD4KuTG\n— Dr. Roger Marshall (@RogerMarshallMD) March 3, 2022\nPassed, 48-47: Passage of S.J.Res.38, Marshall National Emergency Designation.",
    "(RELATED: EXCLUSIVE: Rep. Chip Roy Demands Answers From FDA Over Push To Approve COVID Vaccine For Infants, Toddlers)\nThe Senate has spoken.",
    "The Republicans were able to pass the resolution due to missing votes from a number of Democratic Senators, giving Republicans the majority.",
    "The resolution will go nowhere, as the Biden administration has said they would veto the resolution if it were to make it to Biden’s desk.",
    "“Continuing to protect against COVID-19 and ensuring that our response remains nimble are top priorities of this Administration.",
    "Hope our House colleagues join us in returning the ability to make decisions related to the virus back to the American people.",
    "The resolution passed the Senate in a 48-47 and was spearheaded by Republican Kansas Sen. Roger Marshall.",
    "However, it still has to pass the house, which is also highly unlikely, as Democrats have the majority.",
    "We are ready to end the COVID national emergency like more than a majority of Americans.",
    "We are ready to end the COVID national emergency like more than a majority of Americans.",
    "— Senate Cloakroom (@SenateCloakroom) March 3, 2022\n“The Senate has spoken."
  ]
}