{
  "id": 1816,
  "mediaId": 2643,
  "date": "2022-02-09",
  "headline": "With Gas Prices Averaging $3.45 a Gallon, 2 Senators Propose Halting Tax",
  "image": "",
  "link": "https://www.newsweek.com/gas-prices-averaging-345-gallon-2-senators-propose-halting-tax-1677581",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Wermus",
  "authorUrl": "https://www.newsweek.com/authors/katie-wermus",
  "termIds": [
    2459,
    1973,
    46,
    392,
    6366,
    6239,
    6159
  ],
  "sentences": [
    "Arizona Senator Mark Kelly and New Hampshire Senator Maggie Hassan proposed a pause on the federal gas tax, as the average price for a gallon of gas in the U.S. is over $3.45 a gallon, according to AAA, and could even rise higher.",
    "\"We need to continue to think creatively about how we can find new ways to bring down costs, and this bill would do exactly that, making a tangible difference for workers and families,\" Hassan said in a press statement.",
    "The proposed legislation would also require the Secretary of the Treasury Department to monitor the program to make sure the oil and gas companies are passing along the savings at the pumps to the consumers.",
    "To cover for the loss in gas tax revenue, the Treasury Department would take money out of the general fund and transfer it into the Highway Trust Fund to keep it solvent if the bill gets passed.",
    "As gas prices continue to rise, a number of Democratic Senators are calling for a suspension on the federal gas tax for the rest of this year to help consumers amid the high costs.",
    "Land Line magazine reported at least 10 other states have suggested potential legislation to change how much gas tax can continue to be collected.",
    "Hassan said the purpose of the Gas Price Relief Act is to help people get a break from the rising prices while filling up their tanks.",
    "\"People are feeling a real pinch on everyday goods, and we must do more to help address rising costs, particularly the price of gas.\"",
    "Increased costs of goods at the grocery store and higher prices at the gas pumps have been putting a strain on people's wallets.",
    "These states include California, Colorado, Florida, Illinois, Ohio, Virginia, Maryland, Missouri, Tennessee, and Washington.",
    "The proposal also includes stopping the 1 percent groceries sales tax and giving homeowners a property tax credit.",
    "Currently, the cost for a gallon of gas is nearly one dollar more than it was the same time last year, per AAA.",
    "The overall plan could save Illinois families an estimated $1 billion, Newsweek previously reported.",
    "The Gas Price Relief Act would eliminate the 18 cents per gallon gas tax until January 1, 2023.",
    "Consumers across the country are struggling with rising costs from the soaring inflation rate.",
    "That would consist of keeping the gas tax at about 39.2 cents per gallon for one year.",
    "Illinois Governor J.B. Pritzker proposed a similar plan to freeze taxes on gas.",
    "Several other states have been pursuing similar fuel tax relief.",
    "ET: This article has been updated with additional information.",
    "Four other Democratic senators signed on as co-sponsors.",
    "Update 2/9/22, 10:13 a.m."
  ]
}