{
  "id": 1832,
  "mediaId": 2618,
  "date": "2022-02-09",
  "headline": "The Ottawa Mayor Threatened Anyone With A Gas Can Offering Material Support To The Truck Drivers, So This Is How Ottawa Responded (Video)",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/09/the_ottawa_mayor_threatened_anyone_with_a_gas_can_offering_material_support_to_the_truck_drivers_so_this_is_how_ottawa_responded_video_78874.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kellyanne Richardson",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The Mayors statement and purpose for his emergency declaration is funny: “to manage business continuity for essential services for its residents and enables a more flexible procurement process, which could help purchase equipment required by frontline workers and first responders.” Who exactly does the Mayor think will be delivering the equipment and items procured for front line workers under his orders?",
    "“Declaring a state of emergency reflects the serious danger and threat to the safety and security of residents posed by the ongoing demonstrations and highlights the need for support from other jurisdictions and levels of government,” the city said in a statement.",
    "The media said gave virtually no negative news against Antifa & blm during 2020 & 2021 when they were during cites, destroying businesses, killing dozens, injuring thousands, and stealing everything they could get their hands on.",
    "Ottawa Mayor Jim Watson declared a state of emergency Sunday afternoon as approximately 500 trucks and vehicles with the “Freedom Convoy” continue to linger in the streets of the Canadian capital to protest vaccine mandates.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "In Ottawa, authorities have declared a state of emergency over the parked big-rigs, and are now issuing threats to any Canadians who seek to bring supplies to the protesters.",
    "But after seeing this video I hope the people temporarily in power see that their action is only galvanizing the people's movement to include more people!",
    "He is lucky that they have not called a nationwide strike due to his, Trudeau, and other Canadian government actions relating to the truckers protest.",
    "Only a bunch of communist idiots would come up with the idea to order the truckers to leave and then ban anyone from providing them with gasoline.",
    "I HOPE people will take a lesson from the last two years and in the future disabuse themselves of the notion that MSM outlets report honestly.",
    "I used to tell a joke about Canada and the U.S. but from now on I'm switching it around a little bit...The United States borders on Greatness.",
    "They suffer from the same corrupt media corporations that we here in the U.S. do and sadly too many of them believe what is told to them.",
    "I believe many free peoples around the planet are beginning to see the danger & destructiveness of progressives when they are in charge.",
    "I don't like labeling people as stupid when they're just gullible and naive for believing what the left wing media spews out at them.",
    "The government has blown this, and the people are very, very unhappy and getting unhappier with the government thugs by the day.",
    "Sorry #2, but it's those \"benign\" Canadian people that keep electing the lie-beral fascists like Trudeau to govern them.",
    "They haul our goods to our stores for us, and our lives are pretty darn good because of the services that they provide.",
    "Comments:\nIt is time for elected officials to finally acknowledge that THEY serve the people, not the other way around.",
    "If you carry a fuel can filled with water and let them stop you - if they arrested you could you sue for false arrest?",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "I had a bad feeling this would not end well and the government goons will end up doing something really stupid.",
    "And apparently, by having a peaceful protests, they unmask just how fascist certain governments are too!!!",
    "Sadly, the majority if the Canadian people are as evil and stupid as lie-beral American Demon-Rats!!!!",
    "You have shown that your government is pretty much in line with what we saw in Germany in about 1935.",
    "I’m not say most of us aren’t some degree of mediocre but we shouldn’t be bossing everybody around.",
    "The fact our liberal in the US maligns these brave truckers shows their bias and slanted news.",
    "I don't think the truckers will be in any mood to deliver anything for the Mayor in Ottawa.",
    "Rise up do your duty and save your country and restore your God-given freedom and liberty.",
    "I think this is why Fauxi and company are starting to roll up their rugs and back away.",
    "If hundreds did this, interspersed with a percentage carrying fuel, what would happen?",
    "Up she goes in support of Canadian patriots, truckers worldwide and UP YOURS ELIETS!",
    "Most people consider truckers to be \"good old boys\" and basically \"good guys\".",
    "I also hope that we see many other \"news\" networks and papers \"bite the dust\".",
    "People are tired of taking heavy handed orders from incompetent mediocrities.",
    "They could not survive visuals like this with the current 20% poll numbers.",
    "Either that or bow down in obedience and keep getting what you are getting.",
    "That explains their hatred of Trump, since he gave them as good as he got.",
    "I never thought I would find Canadians inspirational, but here we are...",
    "This is fun to watch, and we should all be 'going to school' on this.",
    "Your donation helps keep our discussions going and our voices heard.",
    "God bless everyone of you for challenging these authoritarians.",
    "It is time to overthrow the tyrannical Canadian government.",
    "And they thought Canadians would just give up and give in.",
    "It is time for the pendulum to swing the other way.",
    "We are running it up the flag pole in the morning.",
    "He didn't talk like others in the political class.",
    "Will they arrest EVERYONE for carrying a fuel can?",
    "Do I wish they would do some additional research?",
    "Rebellion against tyranny is obedience to God.",
    "It makes them ignorant, not stupid and evil.",
    "And poster #7, aren't you being a bit harsh?",
    "Now what are you going to do about it?!?!?!?",
    "We went out and bought a new red gas can.",
    "Canadians aren't 'evil and stupid'.",
    "I want to thank #8 for her comment.",
    "No diplomatic language from him.",
    "And there has been no violence.",
    "Congratulations, Canada!!!",
    "My husband and I saw this.",
    "What a bunch of Patriots!",
    "It's what they deserve.",
    "This is really funny.",
    "No, not kidding.",
    "Go truckers!",
    "Oh Canada!",
    "Of course.",
    "Thank you.",
    "Hello”!",
    "McFly?"
  ]
}