{
  "id": 1921,
  "mediaId": 2618,
  "date": "2022-02-09",
  "headline": "Trump says Mitch McConnell 'does NOT speak for the Republican party' and the 'majority of its voters' for calling January 6 an 'insurrection' and criticizing the censure of Liz Cheney and Adam Kinzinger",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/09/trump_says_mitch_mcconnell_does_not_speak_for_the_republican_party_and_the_majority_of_its_voters_for_calling_january_6_an_insurrection_and_criticizing_the_censure_of_liz_cheney_and_adam_kinzinger_78885.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Geoff Earle",
  "authorUrl": "",
  "termIds": [
    4267,
    3896,
    2765,
    2887,
    4794,
    4905,
    5037,
    1126
  ],
  "sentences": [
    "Donald Trump tore into Mitch McConnell on Wednesday and said he does 'not represent the voice of the Republican Party' after the Senate Minority Leader called January 6 an 'insurrection' and criticized the censure of Adam Kinzinger and Liz Cheney.The former president attacked his GOP nemesis for doing nothing to stop the Biden administration, the 'fraudulent election' or the 'persecution of political opponents' in a scathing statement on Wednesday - deepening divisions in a party on the brink of civil war.",
    "Here's another democrat game play...turn republicans against one another...it's a Hail Mary pass play because they are going to get their clocks cleaned in 2022's election...and they are hoping to cause decention among conservatives....not happening nervous nancy and crooked hillary...the botox queens...biden's mind is slipping...but their faces are slipping...notice how old nervous nancy is looking these days without her botox injections...guess the shipment from Ireland hasn't arrived in DC...",
    "- Ronna McDaniel doesn't excite me as head of the RNC, don't give them money and never have - the January 6th event was sabotaged from the very beginning, by the demcommies, who wanted to try to get something else on our President to prevent him from ever holding office, again and if mcconnell had a clear mind he would believe what we all believe and side with our President but, he doesn't and won't.",
    "The existence of RINOs and the deep state resistance within the Trump Administration was well established prior to Jan 6, so I still do not understand why, after four years in office, fending off non-stop, dirty and illegal attacks by democrats, the president held a large, well advertised rally on the mall of the belly of the beast in the first place.",
    "Even though he was technically correct in that an increase of existing taxes, which occurred during his administration, was not the same as \"new\" taxes, which Bush fended off, the fact that existing taxes indeed went up under a democrat controlled Congress, largely served to put Bill Clinton into office.",
    "of course our President is correct and mcconnell is not - mcconnell has been in D.C. for so long he has lost the idea of how the people feel - he is controlled by the lobbyists, who make him very wealthy and very comfortable - whatever happened to Term Limits?",
    "Similarly, as a then supporter of re-electing George H. W. Bush to a second term, I seriously questioned his definitive \"Read my lips: no new taxes\" pledge, written for his RNC acceptance speech by Peggy Noonan.",
    "I believe there are two separate things being talked about here, and that the RNC stated that the tens of thousands of people who were at the rally were expressing their political views in a peaceful protest.",
    "So many are corrupt, including McConnell who has a net worth of 50 million on a senator's salary and a wife who is essentially a Chinese mole and whose family are high ranking members in the CCP.",
    "The president had the additional advantage of the huge red flag of knowing before the events of Jan 6, that Pelosi had refused his offer of federalized backup to the Capitol Police.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Can you tell me with a straight face that their match was a beautiful love story or a marriage of convenience that propelled him to the power he holds today?",
    "'Mitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters, Trump said Wednesday.",
    "Or, did I miss the hours-long standoff that required SWAT to enter and forcefully remove hundreds, or even dozens, of people from the Capitol?",
    "The guy is a sanctimonious backstabber who will defend the deep state with vigor because he knows he is toast and will not get elected again.",
    "Why hand the democrats an actual multi-year \"Kracken\" to be released ad nauseam by the democrat's PR apparatus, poorly disguised as the MSM?",
    "He believes he can rise to make soft spoken speeches in the well of the senate and that we actually believe the old fool’s words.",
    "Here we have a real and present danger to the Republic and he has done little to nothing to go after this lawless administration.",
    "He plans to go out with a bang because he is going to do everything in his power to make sure that President Trump will not run.",
    "All of you who take pains to tell us of the victories of the nominees on the Supreme Court, I ask, what else has he done?",
    "They will flood critical races with faux MAGA \"ringers\" to diffuse our vote and give the RINO candidate the plurality.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "The Republican Party finally showed some spine and cajones by this action, but the RINO's just can't handle that.",
    "I agree that McConnell is way over the top in calling the riot by some of the demonstrators an 'insurrection.'",
    "Did not a high probability of a legal/political ambush occur to the president or his most trusted advisors?",
    "The article states that Trump's statements are \"deepening divisions in a party on the brink of civil war.\"",
    "A few look to have taken it into a more hostile, or violent, tact which needs to be addressed accordingly.",
    "Was I the only Trump voter/supporter who smelled a Jan 6 democrat/deep state set-up before it played out?",
    "While that is admirable, how much political capital has he expended to disrupt the Biden administration?",
    "If this was an 'insurrection,' it was the shortest (6 hours) and least prepared (no guns) in history.",
    "They believe in \"playing nice\" all the time and being the permanent minority party in this country!!!",
    "I bring that up to emphasize that walking into a democrat trap is nothing new in national politics.",
    "It would be interesting to know why it ended peacefully, and without further incident too.",
    "McConnell is for McConnell, just like the Rinos are for the Rinos, the people be damned.",
    "Trump is right, but .. McConnell et al RINOs still control party $$$ and primaries.",
    "His words have power, but he seems to only use them to defame President Trump.",
    "China has demanded it and he is nothing but a puppet they use at will.",
    "A few hundred, maybe around 1000, people entered the Capitol building.",
    "As to the censure of Adam Kinzinger and Liz Cheney, I agree with him.",
    "Mitch McConnell is 100% a \"DC Sewer Creature\" RINO Republi-Can't!!!!",
    "Your donation helps keep our discussions going and our voices heard.",
    "The ONLY solution is a new MAGA party to pre-qualify the candidates.",
    "I hold Mitch McConnell in the same esteem that I hold Nancy Pelosi.",
    "The only gun fired was when a Capitol cop killed an unarmed woman.",
    "C'mon, Mr. President (Trump .. NOT Biden): let's get this started!",
    "In a 50-50 Senate, you need every bit of help you can get.",
    "You have to look no further than his wife and her family.",
    "Who has feathered his nest more than Mitch McConnell?",
    "I am 100% in President Trump's corner on this one!!!",
    "China has certainly gotten their money’s worth.",
    "Why isn't he fighting against election fraud?",
    "And Mitch McConnell is their poster child!!!",
    "Why is siding with Pelosi on Jan 6th psyop?",
    "Two very separate parts of the same day.",
    "Most didn't realize it was not allowed.",
    "Seems like a lot we don't still know.",
    "This is only doing Democrats a favor.",
    "That old soft flaccid man is corrupt.",
    "He is as deep state as you can get.",
    "He needs to retire and go away!!!",
    "How did Mitch become so wealthy?",
    "He's trying to drain the swamp!.",
    "He is no better than Pelosi.",
    "He is not to be trusted.",
    "Deepening divisions?",
    "Thank you."
  ]
}