{
  "id": 1928,
  "mediaId": 2526,
  "date": "2022-02-08",
  "headline": "Poll: Joe Biden Job Approval Rating Crashes to 38 Percent",
  "image": "https://media.breitbart.com/media/2022/01/Impch-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/08/poll-joe-biden-job-approval-rating-crashes-to-38-percent/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Bois",
  "authorUrl": "https://www.breitbart.com/author/pbois/",
  "termIds": [
    4905,
    3026,
    2459,
    2765,
    1373,
    655,
    5949,
    6175
  ],
  "sentences": [
    "Biden Job Approval:\nApprove 38%\nDisapprove 48%\nIBD/TIPP, 1,355 Adults, 2/2-4https://t.co/gHWyowSirp\n— Political Polls (@Politics_Polls) February 8, 2022\nIn January, the same IBD/TIPP poll gave the president a 44 percent job approval rating among adults versus a 45 percent disapproval.",
    "This November, at least two Senate Democrats stand to lose their seats in swing states that Biden won by slim margins: Sen. Raphael Warnock of Georgia and Sen. Mark Kelly of Arizona — neither of whom have called for the president’s aid.",
    "“The index includes questions on presidential job approval, favorability measures of the president’s handling of domestic and foreign policy issues, and whether the president is providing strong or weak leadership,” noted IBD.",
    "Surveying 1,355 adults between February 2-4, the IBD/TIPP poll found the president’s job approval rating stood at 38 percent with a disapproval rating of 48 percent of adults, with another 14 percent undecided.",
    "Now just 37 percent of adults think Biden deserves a good grade for handling Covid, while 40 percent disapprove, reversing January’s slim 41 percent -39 percent approval.",
    "As the president’s disapproval rating continues to decline, vulnerable Democrats have now begun to distance themselves from Biden as the mid-term elections approach.",
    "The presidential leadership index, which tracks how the president is “viewed when it comes to leading the country,” put the president’s approval at 44.4 percent.",
    "IBD noted:\nBiden’s handling of the pandemic, his best issue and almost certainly the reason he beat Trump, has now become a liability.",
    "According to the Washington Post, when Mark Kelly was asked if he wanted Biden to campaign on his behalf, he dodged the question.",
    "The freefall of President Joe Biden’s job approval rating continued this week, dropping to 38 percent over the past month.",
    "“I’m focused on, right now, on things Arizonans care about, like the price of gasoline and groceries,” said Mark Kelly.",
    "The steady drop can largely be attributed to a sudden cratering in support among Democrats – 66 percent to 21 percent.",
    "“What’s going on on our southern border, at least in Arizona — no, it’s not been effective,” said Kelly.",
    "Raphael Warnock was equally evasive when asked if he wanted the president to campaign for him.",
    "For Independents, the president fared even worse with a 55 percent disapproval rating.",
    "Kelly noted that Biden has not been effective on the issue of the southern border.",
    "I really am focused on serving the people of Georgia,” Warnock told the Post.",
    "“I know that the pundits are focused on the campaign."
  ]
}