{
  "id": 194,
  "mediaId": 2540,
  "date": "2022-02-18",
  "headline": "The 2022 midterm primary dates to circle on your calendar",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220214154150-voting-booths-file-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/18/politics/midterm-primary-dates-2022/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Wollner",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "CNN's David Wright noted Friday that more than $72 million total has now been spent on campaign ads in Texas this cycle, with the main focus being on the GOP primaries for governor and attorney general, as well as the Democratic primary in the state's 28th Congressional District.",
    "In Alaska, which uses a top-four primary system, Sen. Lisa Murkowski, who voted to convict Trump in his second impeachment trial, faces Kelly Tshibaka, who is endorsed by the former President.",
    "June 7: The first Tuesday in June is the busiest day on the calendar, with seven states holding primaries: California, Iowa, Mississippi, Montana, New Jersey, New Mexico and South Dakota.",
    "While just about every Election Day this year will host at least one primary battle of note, there were five dates that particularly stood out as loaded with critical races to watch.",
    "In Alabama, Rep. Mo Brooks has struggled out of the gate, despite winning former President Donald Trump's endorsement, in the race to replace retiring GOP Sen. Richard Shelby.",
    "And in Washington, another top-two primary state, two more impeachment supporters, GOP Reps. Jaime Herrera Beutler and Dan Newhouse, go up against Trump-backed challengers.",
    "Elsewhere in the perennial battleground of Pennsylvania, the parties will also pick their nominees in the governor's race, which is also open due to Democratic Gov.",
    "In Arizona, Republicans will choose a nominee to face off against Democratic Sen. Mark Kelly and both parties will choose nominees for the open governor's race.",
    "But it won't be until later this spring and summer that we start to get a clearer picture of the playing field in key Senate, House and governors' races.",
    "May 17: Both parties will select their nominees in two key open seat Senate races this day: Pennsylvania and North Carolina, where GOP Sens.",
    "Our CNN colleagues Gregory Krieg and Ethan Cohen outlined the dates of when each state is slated to hold their primary elections.",
    "In Michigan, two House Republican impeachment backers, Peter Meijer and Fred Upton, confront Trump-supported challengers.",
    "And Wyoming Rep. Liz Cheney, the top GOP target for Trump and his allies, matches up with primary foe Harriet Hageman.",
    "California, which has a top-two primary system, is expected to host several toss-up House races this fall.",
    "Texas officially kicked things off this week, as early voting began ahead of the March 1 primaries.",
    "Georgia Republicans will also vote their candidate to run against Democratic Sen. Raphael Warnock.",
    "Gretchen Whitmer and Reps. Elissa Slotkin and Dan Kildee ahead of competitive general elections.",
    "The Point: In just 11 days, Texas will provide a taste of what's to come this primary season.",
    "In Missouri, Republicans will be watching nervously to see if scandal-plagued former Gov.",
    "Similarly in Georgia, former Sen. David Perdue's Trump-backed primary challenge to Gov.",
    "In Kansas, Republicans will determine who will take on two vulnerable Democrats: Gov.",
    "(Some dates could still change as states complete the redistricting process.)",
    "May 24: Two especially noteworthy Republican primary battles occur this day.",
    "After Texas, there will be a lull in the primary calendar until May.",
    "August 2: This may be the most jam-packed primary day of the year.",
    "Brian Kemp has not caught on the way some in the party expected.",
    "(CNN)Don't look now, but the primary season is already upon us.",
    "August 16: Two more Trump-centric fights headline this Tuesday.",
    "Republicans will also select nominees to take on Gov.",
    "Eric Greitens emerges from a crowded primary field.",
    "Pat Toomey and Richard Burr are retiring.",
    "Laura Kelly and Rep. Sharice Davids.",
    "Tom Wolf being term-limited."
  ]
}