{
  "id": 2106,
  "mediaId": 2748,
  "date": "2022-02-07",
  "headline": "Vulnerable Democrats Distance from Joe Biden Ahead of Midterms",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4ExUqXYgkaXQeh7OpNBW5G299PSfyQbKbyU_m_Mozvb-YexMVooGkUZrd53E29BzwImQkxaZaeMBpB6EXfkUxhekIkOkV7gjAttKLhHjwB7zBXx8ORkDujn3D19st1dxCzTeCbbT1HvtP1KKM6xoZcLZRpj0AWViDm92uxppfTmgq1jSMnxCldk=w1200-h630-p-k-no-nu",
  "link": "https://www.cracknewz.com/2022/02/vulnerable-democrats-distance-from-joe.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Blarp Blog",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "This November, at least two Senate Democrats stand to lose their seats in swing states that the increasingly unpopular President Biden won by slim margins: Sen. Raphael Warnock of Georgia and Sen. Mark Kelly of Arizona — neither of which have called for the president’s aid.",
    "“Over the course of the spring and the summer, we’d love to see President Biden at 47 or 49 or 50 percent — and that will make all the difference in those elections,” said Beyer, who oversees fundraising for the Democratic Congressional Campaign Committee.",
    "While Sen. Catherine Cortez Masto (D-NV), in another swing state, said that the president is “always welcome in my state,” she hesitated to call herself a “Biden Democrat.”\n“I’m a Nevadan first and foremost,” said Cortez Masto.",
    "The people loved or hated Donald Trump, but they don’t hate Joe Biden.”\nThat said, even more left-leaning Democrats, such as Georgia gubernatorial candidate Stacey Abrams, have begun distancing themselves from Joe Biden.",
    "“On Biden’s trip to Georgia for a major voting rights speech, gubernatorial candidate Stacey Abrams was not there, citing a scheduling conflict,” noted the Post.",
    "He will likely be facing off against former pro-football player and prominent Trump supporter Herschel Walker in a state that Biden won narrowly in 2020.",
    "Vulnerable Democrats in purple states have begun distancing themselves from President Joe Biden as the 2022 midterm elections quickly approach.",
    "According to the Washington Post, when Mark Kelly was asked if he wanted Biden to campaign on his behalf, he dodged the question.",
    "Warnock helped tip the scales in the U.S. Senate in the Democrats’ favor in 2021 when he won the Georgia runoff election.",
    "“I’m focused on, right now, on things Arizonans care about, like the price of gasoline and groceries,” said Mark Kelly.",
    "Other Democrats hope that Biden’s fundraising efforts and his overall personality will help win the day come midterms.",
    "Rep. Don Beyer (D-VA) believes the president’s approval rating will increase as the economy gets better.",
    "“What’s going on on our southern border, at least in Arizona — no, it’s not been effective,” said Kelly.",
    "Raphael Warnock was equally evasive when asked if he wanted the president to campaign for him.",
    "Kelly noted that Biden has not been effective on the issue of the southern border.",
    "I really am focused on serving the people of Georgia,” Warnock told the Post.",
    "A recent Reuters/Ipsos poll put Biden’s approval rating at 41 percent.",
    "“He’s still a very likable, understandable human being.",
    "“I know that the pundits are focused on the campaign."
  ]
}