{
  "id": 2123,
  "mediaId": 8350,
  "date": "2022-02-09",
  "headline": "Sen. Mark Kelly, 2nd Democrat call for gas tax suspension to blunt rising prices",
  "image": "https://ktar.com/wp-content/uploads/2022/02/gas-pump-ap-file-16x91-1.jpg",
  "link": "https://ktar.com/story/4879917/sen-mark-kelly-2nd-democrat-call-for-gas-tax-suspension-to-blunt-rising-prices/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/ap_override/",
  "termIds": [
    2459,
    1973,
    392,
    1126,
    1448,
    6709,
    5949
  ],
  "sentences": [
    "“This bill will lower gas prices by suspending the federal gas tax through the end of the year to help Arizona families struggling with high costs for everything from gas to groceries.”\nThe federal gas tax has remained at 18.4 cents per gallon since 1993.",
    "Mark Kelly of Arizona and Maggie Hassan of New Hampshire could prove popular during an election year in which the average price of gas nationally, according to AAA, exceeds about $3.45 a gallon and could go higher during peak driving season.",
    "The bill also would require the Treasury Department to monitor whether oil and gas companies are passing along the savings to consumers and encourages the department’s secretary to take enforcement actions to ensure they do.",
    "“Arizonans are paying some of the highest prices for gas we have seen in years and it’s putting a strain on families who need to fill up the tank to get to work and school,“ Kelly said Wednesday in a press release.",
    "The bill would require the Treasury Department to transfer general funds into the trust fund to make up for the lost gas tax revenue and keep the trust fund solvent, likely requiring additional borrowing.",
    "“We need to continue to think creatively about how we can find new ways to bring down costs, and this bill would do exactly that, making a tangible difference for workers and families,” Hassan said.",
    "It seeks to suspend the gas tax until all emergency health orders related to the COVID-19 pandemic are lifted or for six months after the bill is enacted into law, whichever is longer.",
    "WASHINGTON — Two Democratic senators are calling for suspending the federal gas tax for the remainder of the year to help consumers struggling with rising fuel prices.",
    "Over the years, lawmakers have visited the idea of suspending the gas tax but did not generate enough support to get their bill over the finish line.",
    "The money goes into a trust fund that helps pay for highway construction projects and public transit.",
    "Legislation introduced last year in the House has support from some Republicans.",
    "Other lawmakers are unlikely to go along, but the legislation from Sens.",
    "Four other Democratic senators quickly signed on as co-sponsors.",
    "Still, the bill faces an uphill fight to become law.",
    "Share\nComments"
  ]
}