{
  "id": 2125,
  "mediaId": 2644,
  "date": "2022-02-09",
  "headline": "Push to ban Pelosi-style stock trading in Congress gains steam with new bipartisan bill",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/stock-trading-35.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/09/push-to-ban-pelosi-style-stock-trading-in-congress-gains-steam/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Theo Wayt",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "After defending congressional stock trades as part of the “free-market economy” as recently as December, Pelosi has folded to pressure from both sides of the aisle and is working with other Democratic leaders on a plan to ban the practice, Punchbowl News reported on Wednesday.",
    "“We’ll take a look at that kind of legislation and see what may be appropriate.”\nSome DC sources said any final bill could be watered down and not apply to spouses, leaving people like Paul Pelosi free to keep trading shares of the companies his wife regulates.",
    "Whereas the Ossoff-Kelly bill would require lawmakers and their spouses to give up control of any stocks by putting them in a blind trust for the duration of their time in office, the Warren-Daines bill would make lawmakers sell off their stocks altogether.",
    "Elizabeth Warren and Steve Daines are teaming up on the first bipartisan Senate bill to prohibit stock trading by members of Congress and their spouses — adding to growing momentum on both sides of the aisle for a ban on the practice.",
    "In addition, Senate Majority Leader Chuck Schumer (D-NY) and House Minority Leader Kevin McCarthy (R-Calif.) have both publicly said they would support a ban, although they have not thrown their weight behind any particular bill.",
    "Daines is working to introduce the first bipartisan bill in the Senate to ban Members of Congress and their spouses from owning and trading individual stocks and commodities,” Daines’ press secretary Rachel Dumke told The Post.",
    "One senator who may support a ban on trades by members of Congress but not their spouses could be Sen. Ted Cruz (R-Texas), whose wife is a managing director at Goldman Sachs, according to sources.",
    "“Asking members to completely sell off all their individual stock is never going to happen.”\nThe Ossoff-Kelly bill currently has the backing of eight other Senate Democrats, including Sens.",
    "But even House Speaker Nancy Pelosi (D-Calif.) — whose husband has made as much as $30 million betting on Big Tech stocks — appears to support some kind of ban on stock trading.",
    "They would only be allowed to own stocks through broad exchange-traded funds and mutual funds under the bill, which has not yet been introduced.",
    "The divide between the Ossoff-Kelly and Warren-Daines camps shows that lawmakers still have a ways to go before reaching 60 votes.",
    "The Warren-Daines bill — which was first reported by Axios late Tuesday — would be more stringent than another proposal by Sens.",
    "A Washington, DC, source who backs the Ossoff-Kelly bill said the Warren-Daines bill was too “extreme” to get signed into law.",
    "“I haven’t given that any serious thought yet,” McConnell said of a stock trading ban, according to Punchbowl.",
    "would ban lawmakers and their spouses from owning or trading individual stocks, Senate sources told The Post.",
    "“I would say there’s no way that this happens and it’s a messaging bill,” the source said.",
    "Senate Minority Leader Mitch McConnell (R-Ky.), meanwhile, has been more noncommittal.",
    "“Spouses are a sticking point with the GOP,” a Senate source said.",
    "Kirsten Gillibrand (D-NY) and Patty Murray (D-Wash.).",
    "Jon Ossoff (D-Ga.) and Mark Kelly (D-Ariz.).",
    "The bill from Warren (D-Mass.)",
    "“They think it’s too much.”",
    "and Daines (R-Mont.)",
    "“Sen.",
    "Sens."
  ]
}