{
  "id": 2136,
  "mediaId": 2748,
  "date": "2022-02-09",
  "headline": "Nancy Pelosi finally caves and moves to BAN stock trading in Congress: Democratic Speaker u-turns on members buying shares despite her husband raking in millions and defending the practice just days ago",
  "image": "https://lh3.googleusercontent.com/blogger_img_proxy/ABLy4EwRFzlnoDScEyQ4HdOX80aEV8at22BEnIfNKYgP04_vVObGZODisyP7Aty7JutqcuazxaWGH0yAJu5KEMthKYCh7VScjs_wUsSyh0zzD67eIPbqOKPPPudmNWuB5eHZh-_UEFv-U4LygUPSCN9gUwucVlSi_y1rqaKP48Vg=w1200-h630-p-k-no-nu",
  "link": "http://www.stationgossip.com/2022/02/nancy-pelosi-finally-caves-and-moves-to.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STATION GOSSIP",
  "authorUrl": "https://www.blogger.com/profile/14290129071922737076",
  "termIds": [
    0
  ],
  "sentences": [
    "And on Tuesday it was reported by Axios that progressive Senator Elizabeth Warren and Republican Senator Steve Daines want to go a step further with a potential stock trading ban, limiting members of Congress to only hold stock in wider portfolios like a mutual fund.",
    "Last month it was revealed that the businessman and investor dropped $3.5 million on call options, essentially betting that the stock will go up in value by a certain date and giving an investor the opportunity to buy it at the initial agreed-upon price until then.",
    "Such a measure has found vocal support from a wide range of House lawmakers, from progressive Squad members such as Reps. Alexandria Ocasio-Cortez and Rashida Tlaib, to pro-Trump Rep. Matt Gaetz, and even recently House Republican Leader Kevin McCarthy.",
    "Late last month, more than two dozen House Representatives from across the political spectrum wrote a letter to Pelosi and McCarthy demanding they bring a floor vote on either the Ban Conflicted Trading Act or the TRUST in Congress Act.",
    "Paul Pelosi Jr. was involved in five companies probed by federal agencies before, during or after his time there, and documents recently uncovered by DailyMail.com appear to connect Paul Jr. to a San Francisco bribery and fraud scheme.",
    "Other issues Congress will have to look at will be whether to allow members to keep stocks they owned before coming to Capitol Hill, and whether to waive or defer capital gains tax in a bid to encourage members to sell their shares.",
    "Similar measures are being examined in the Senate as well, with Democrat Senators Jon Ossoff and Mark Kelly putting forward a bill that would put the financial investments of lawmakers and their families into a blind trust.",
    "But the California legislator is now working with other Democratic leaders on how to get it done, according to Punchbowl News, after caving to pressure from both sides of the aisle and both chambers of Congress.",
    "As many as 49 legislators and 182 Congressional staffers had violated the STOCK Act by reporting their trades late from January through September 2021, according to a Business Insider report from last year.",
    "But that could face pushback from Pelosi -- while she herself does not trade stocks, her regular financial disclosures show her husband, Paul Pelosi, regularly making millions off of the financial markets.",
    "I do believe in the integrity of people in public service, I want the public to have that understanding but we have to do this to deter something that we fear is a problem,' the speaker told reporters.",
    "'There's a certain criteria that I wanted to see with whatever whatever design they have for that -- that's one, but the other is we have to tighten the fines on those who violate the STOCK Act.",
    "'IWe have to do this to determine something that we see as a problem -- but it is a confidence issue -- and if that's what the members want to do, then that's what we will do,' Pelosi said.",
    "While it now appears Pelosi is on board, Wednesday's report still indicates there's a myriad of questions that need to be answered about the details of what the House Speaker would support.",
    "The STOCK Act, which makes it illegal for lawmakers to use non-public information for private profit and requires them to publicly disclose stock and bond transactions within 45 days.",
    "She also confirmed tapping House Administration Committee Chair Rep. Zoe Lofgren to come up with pathways on how to enact the stock trading ban and present those to House leaders.",
    "'[Lawmakers] should be able to participate in that,' her husband bought significant shares in Alphabet -- Google's parent company -- worth between $500,001 and $1 million.",
    "The post-Watergate scandal law called for the mandatory public disclosure of financial records and employment history for public officials and their immediate families.",
    "The former would impose limits on lawmakers and their staff, while the latter extends the individual stock trading ban to Congressional spouses and dependent children.",
    "It came one day after her rival, former President Donald Trump, slammed the California Democrat in a Breitbart interview for participating in the financial trade.",
    "Pelosi appeared to begin to budge last month, when she said at a press conference: 'I just don't buy into it, but if members want to do that I'm okay with that.'",
    "The powerful Democrat has shot down the idea multiple times in the past, despite criticism over her husband raking in millions on the stock exchange.",
    "House Speaker Nancy Pelosi is now on board with a potential ban on members of Congress trading stocks, a new report suggested on Wednesday.",
    "Among the most prominent is whether the ban will extend to lawmakers' family members, as some members of Congress have already called for.",
    "Pelosi said that a prospective package would also have to include limitations on federal judges' financial activity.",
    "The push to ban federal lawmakers from trading individual stocks has gained significant momentum in recent months.",
    "Pelosi said there was a 'certain criteria' for any legislation that gets her green light to go to the floor.",
    "Two days after the House Speaker told reporters on December 15 that 'We're a free market economy.",
    "Pelosi has denied having any knowledge of or participating in her husband's trading activity.",
    "Changes to the Ethics in Government Act are also on the table, Wednesday's report suggests.",
    "It has no reporting of stock transactions, and it makes important decisions every day.",
    "Pelosi confirmed it during her Wednesday morning press conference at the US Capitol.",
    "'She should not be allowed to do that with the stocks,' Trump had said of Pelosi.",
    "It could be updated to outright stop lawmakers from trading individual stocks.",
    "And then the third, is just really has to be government wide,' Pelosi said.",
    "He also bought shares in Disney worth between $100,001 and $250,000.",
    "DailyMail.com has reached out to Pelosi's office for comment.",
    "Meanwhile Pelosi's son has had his own financial woes.",
    "The executive branch operates under the latter rule.",
    "But it's simply not sufficient to deter behavior.",
    "'It's not fair to the rest of this country.'",
    "'The Supreme Court has no disclosure.",
    "Both have bipartisan support."
  ]
}