{
  "id": 2155,
  "mediaId": 6423,
  "date": "2022-02-09",
  "headline": "Where The Love Is Blind Season 1 Couples Are Two Years After The Show",
  "image": "https://imgix.bustle.com/uploads/image/2022/2/4/a27da6db-c1e1-4631-8c74-3b3a9ee90cfb-loveisblind_season1_episode1_00_06_59_07_r-1.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg",
  "link": "https://www.bustle.com/entertainment/which-love-is-blind-couples-still-together-broke-up",
  "mediaOutlet": "Bustle",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "It was the longest 24 hours ever, but here we are today, a year-and-a-half later, so it was well worth the wait.”\nNearly four years since filming ended in 2018, Lauren and Cameron are still happily married and continue to build their lives together — in fact, they recently moved into a new home.",
    "Kelly Chase & Kenny Barnes\nLike Jessica and Mark, Kelly and Kenny did make it to the altar, but they didn’t say “I do.” After the show aired, they revealed that they’d never intended to get married and were treating the engagement period as just more time to get to know each other.",
    "But they broke up again in 2021, after Damian began a flirtatious relationship with Too Hot To Handle star Francesca Farago and decided to bring her to the reunion/anniversary party in Love Is Blind: After the Altar — despite the fact he was still dating Giannina at the time.",
    "Though he and Amber still made it down the aisle, the interactions between Jessica and Amber (and Barnett’s choice to completely avoid Jessica) during the Love Is Blind: After the Altar reunion special made it clear that many of those tensions remain.",
    "Giannina Milady Gibelli & Damian Powers\nWhen Damian tried to propose to Giannina in Love Is Blind Season 1, she responded by saying “I see you as my equal and I'm just as strong as you” before getting down on one knee to propose to him instead.",
    "They left the resort separately shortly afterward, and though Diamond said that they’d been trying to establish a friendship after the series ended, a 2021 Instagram post from Carlton suggested that there was still bad blood between them.",
    "But there was a miscommunication: Kelly thought they would continue dating after the show, while Kenny had realized he wasn’t as emotionally available as he wanted to be and told her he needed to take some space from the relationship.",
    "During the pod phase of the show, Barnett was flirtatious with several women but ultimately chose to pursue a relationship with Amber — a decision that was complicated by Jessica’s attempts to pursue him even after he’d proposed.",
    "Amber revealed during the Love is Blind reunion special in 2020 that they almost broke up in the early months of their marriage, but they got past it and are now still happily together.",
    "After the series ended, Mark also dated Lauren “LC” Chamblin, another Love is Blind cast member, but she ended the relationship after rumors arose that he was cheating on her.",
    "“And I have the best girlfriend, for me.” Although Kelly appears to still be single, her reaction to Kenny’s engagement on Instagram suggests that the pair are on good terms.",
    "Matthew Barnett & Amber Pike\nDespite some bumps in their journey to the altar, Barnett and Amber were the second couple to tie the knot at the end of Love Is Blind Season 1.",
    "“This experiment, whether I understood it or not, allowed me to find the person I'm with today because it allowed me to open myself up, to truly be vulnerable,” Kenny said.",
    "The pair bonded quickly while talking in the pods and, after getting engaged sight unseen, eventually became one of the two couples who actually got married on the show.",
    "While Amber and Barnett’s relationship was unfolding on the show, many fans wondered whether or not the couple would be able to make their relationship work longterm.",
    "That means new couples, new engagements, and likely new breakups, but it’s also been a while since we last saw the couples from Season 1, and things have shifted.",
    "Although the couple did seem to connect while in the pods, after they got engaged it appeared that Jessica was more interested in Barnett than her own fianceé.",
    "Carlton’s relationship status is unknown as his Instagram page has seemingly been deactivated and he appears to be taking a break from being in the public eye.",
    "Unsurprisingly, that led to several incredibly awkward interactions between the trio, and Giannina told Bustle that his choice marked a turning point for her.",
    "Although the two hit it off in the pods, their relationship fell apart during their “engagement-moon” in Mexico when Carlton revealed that he was bisexual.",
    "She later said that she’d tried to quit the show before her wedding to Mark, but that she felt pressured to see the relationship through to the end.",
    "“Being able to meet Cameron and learn more about him — that was our introduction, through that mystical wall,” Lauren told Bustle in October 2020.",
    "Lauren Speed-Hamilton & Cameron Hamilton\nOf all the couples on Love Is Blind Season 1 Lauren and Cameron were clearly the fan favorites.",
    "By the time the Love is Blind reunion filmed in 2020, Giannina and Damian were back together and trying to make their relationship work.",
    "Based on his Instagram, Damian appears to still be single after splitting from Giannina (and didn’t end up dating Francesca either).",
    "Jessica Batten & Mark Cuevas\nBasically everyone could tell that Jessica and Mark’s romance on Love is Blind Season 1 was doomed.",
    "Currently, Giannina is rumored to be dating Blake Horstmann, who was a contestant on Becca Kufrin’s season of The Bachelorette.",
    "Jessica claimed that Mark cheated on her during filming for the show, though a representative for Mark denied the allegations.",
    "Diamond Jack & Carlton Morton\nDiamond and Carlton’s explosive breakup was one of the most talked-about moments from Season 1.",
    "She confirmed to ET in August 2021 that the relationship was over for good and that she’d been single for several months.",
    "Post-show interviews also revealed that there was a lot about Jessica and Mark’s relationship that viewers didn’t see.",
    "“The worst part, though, was not being able to touch each other.” “Especially after we got engaged,” Cameron added.",
    "Some of them are married, some are engaged to or dating other people, and others are even not on speaking terms.",
    "Unsurprisingly, Jessica and Mark have gone their separate ways, though they do appear to be on good terms.",
    "The two ultimately made it to their wedding day, but things imploded when Jessica left Mark at the altar.",
    "At the altar, however, Giannina said “I do” while Damian did not — leaving his then-fianceé heartbroken.",
    "During the reunion special, he credited Love is Blind for putting him in the position to meet her.",
    "After spending a year alone, Kenny started dating and then became engaged to Alexandra Garrison.",
    "Streaming\nSome are married, some are dating new people, and some aren’t even on speaking terms.",
    "He and his fianceé, Aubrey Rainey, had a child together in April 2021, who they named Ace.",
    "Jessica is engaged to Dr. Benjamin McGrath, a foot and ankle surgeon and father of two.",
    "Netflix\nAfter a nearly two-year wait, Love is Blind is returning for Season 2.",
    "They’re currently both in long-term relationships with new people.",
    "“That was the end for me as far as just, like, honestly?",
    "Based on her Instagram, Diamond appears to be single.",
    "“We had to wait 24 hours to actually see each other.",
    "Love is Blind Season 2 premieres on Feb. 11.",
    "Being attracted [to him],” Giannina said.",
    "Here’s where they all ended up.",
    "Mark is also engaged."
  ]
}