{
  "id": 2252,
  "mediaId": 2634,
  "date": "2022-02-10",
  "headline": "Congress Has Finally Concluded That Insider Trading Is Bad",
  "image": "https://images.newrepublic.com/2c069514332c535c61e2bfacbacaa85b54542da1.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/165337/stocks-insider-trading-spanberger-ossoff",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grace Segers",
  "authorUrl": "https://newrepublic.com/authors/grace-segers",
  "termIds": [
    0
  ],
  "sentences": [
    "Spanberger argued that this proposal was the best option, in part because it had the most bipartisan support and because she said it was the “most straightforward.” Spanberger said, “If the issue that we’re trying to get at is, the American people think we’re self-dealing, the American people think that we may be focused on our own financial interests, the way to get at that is, we just can’t buy or sell individual stocks.”\nBanning spouses from trading individual stock is a key part of Spanberger’s and Ossoff’s bills.",
    "“Frankly, I have never had a legislative issue that I have gotten more of a forward-leaning response from constituents,” said Representative Abigail Spanberger, who introduced a bill in 2020 to require members of Congress, their spouses, and their dependent children to place their stocks in a blind trust while the member holds office, with the intention of preventing not just insider trading but also the mere appearance of it.",
    "(Senator Mark Kelly, an original co-sponsor of Ossoff’s bill, said that including spouses in legislation would be his preference, but “all these things are subject to negotiation.”)\nAxios reported on Tuesday that Democratic Senator Elizabeth Warren and Republican Senator Steve Daines were collaborating on legislation that would ban lawmakers and spouses from owning and trading individual stock.",
    "Efforts to restrict or ban lawmakers from trading stock are gaining bipartisan momentum on Capitol Hill, with members of Congress introducing competing proposals to ensure that they and even their family members cannot use their position, and their potential access to nonpublic information capable of moving markets, to improperly enrich themselves.",
    "“What I’ve encouraged my colleagues in the Senate to do, Democrats and Republicans, is to submit their notes, concerns, questions, considerations and offer any other potential legislation this week so that we can get all of that out there, continue to build support, and then hammer out some final text, put it on the floor and vote,” Ossoff said.",
    "On Wednesday, Representative Katie Porter and Senator Kirsten Gillibrand reintroduced the STOCK Act 2.0 to strengthen disclosure rules, increase the fine for failing to file transactions, and ban stock trading among members of Congress, the president and vice president, Supreme Court justices, and members of the Federal Reserve.",
    "“The idea that I can look a constituent in the eyes and say, ‘Well, I’m not doing anything untoward, and I can’t have individual stocks, it shouldn’t matter what my spouse does.’ Well, we’ve indicated by virtue of the fact that we are married that there are joint decisions and sharing that occurs,” Spanberger argued.",
    "“By strengthening disclosure requirements and banning top officials from trading stocks, we can help restore faith in our government.”\nDespite the variety of options, Ossoff told reporters on Wednesday that he believes it is possible to find common ground, saying “the more the merrier” with the multitude of bills.",
    "Schumer said Wednesday that he had “asked my Democratic colleagues to come together and come up with a single bill this chamber can work on.” (Senate Democratic leadership has formed a working group that is holding discussions about a potential for compromise legislation, according to Insider.)",
    "“Hopefully we can act on it soon, and hopefully it can be done in a bipartisan way.”\nThe legislation introduced by Spanberger and Republican Representative Chip Roy in 2020 is gaining some traction, after Senators Jon Ossoff and Mark Kelly introduced a similar proposal last month.",
    "Democratic Senator Jeff Merkley and Representative Raja Krishnamoorthi have introduced a bill that would prevent members of Congress and senior staff from buying and owning stocks while in office, allowing them to place stocks in a blind trust, but would not apply to spouses.",
    "“One of the most basic things that we should be able to expect is that people who serve in Congress will be focused on actually doing what the people want and not on lining their own pockets,” Hawley said in an op-ed with GOP Representative Vicky Hartzler on Wednesday.",
    "But now that I know it’s a thing, I’m glad that there’s efforts to try and stop it.’”\nMovement on the issue has been building for years but came to a head after several lawmakers came under scrutiny for some stock sales during the onset of the coronavirus pandemic.",
    "Pelosi said during her weekly press conference on Wednesday that she had tasked the House Administration Committee with evaluating the options for restricting or banning stock trading and said she wanted to see fines tightened for violating the STOCK Act.",
    "The radical notion that lawmakers should not engage in insider trading is becoming almost as popular among members of Congress as it is for their constituents, who could derive no material benefit from elected officials’ side-gigs as day traders.",
    "“It’s time for us to arrive at a consensus across parties in between House and Senate, put legislation on the floor, enact legislation, prevent members of Congress from trading stock while we’re in office, and keep it moving.”",
    "And it’s very possible that conversations over details—blind trust, no blind trust; dependents, not dependent; senior staff, not senior staff; spouses, not spouses—it’s possible for us to get derailed and have no bill at all.",
    "In response to these disclosures, Speaker Nancy Pelosi then appeared to reject the idea that members or their spouses should be banned from owning stock, drawing even more attention to the issue.",
    "(All lawmakers denied any wrongdoing, and the Justice Department dropped investigations into the senators, although Burr’s sales are still being probed by the Securities and Exchange Commission.)",
    "Republican Senator Josh Hawley introduced a competing bill last month that would exclude dependent children and would require lawmakers to return their profits through the Treasury Department.",
    "Warren noted to reporters that it was the first bipartisan bill related to members trading stocks in the Senate, and Daines said that he expected the bill to earn some Republican co-sponsors.",
    "A recent investigation by Insider found that dozens of members of Congress had violated the reporting requirements of the STOCK Act, an Obama-era law intended to prevent insider trading.",
    "Senators Dianne Feinstein and Jim Inhofe, as well as former Georgia Senators David Perdue and Kelly Loeffler, were criticized for stock sales they or their spouses made in early 2020.",
    "Some bills go even further than asking members to put their stocks in a blind trust; a bill from Representative Angie Craig would bar members of Congress from owning stocks at all.",
    "Other congressional leaders have also appeared open to a ban, with Senate Majority Leader Chuck Schumer perhaps offering the most enthusiasm for such a proposal.",
    "And if that’s what the members want to do, then that’s what we will do.”\nPelosi also argued that any ban should be applied on a “government-wide” level.",
    "Senator Richard Burr, then the chair of the Senate Intelligence Committee, sold hundreds of thousands of dollars in stock in February 2020.",
    "“I hope we can pass something, and I want to encourage my colleagues on the Democratic side to reach out across the aisle,” Schumer said.",
    "It’s about making sure that people can’t even do something that feels and looks inappropriate,” Spanberger told reporters on Wednesday.",
    "“Few Americans trust that our government is working for them, and that’s a real problem for our democracy,” Porter said in a statement.",
    "The Supreme Court has no disclosure, it has no reporting of stock transactions, and it makes important decisions every day,” she said.",
    "Merkley told reporters on Wednesday that he was worried including spouses in a stock trading ban could “derail” conversations.",
    "“There’s a real emotional response, with people saying, ‘I can’t believe you guys can actually buy and sell individual stocks.",
    "In these cases, the specific trading activity occurred at the onset of the pandemic, shortly before financial markets tanked.",
    "(According to Insider’s reporting, Pelosi’s husband, Paul, frequently trades significant numbers of stocks.)",
    "But there is not yet one uniform proposal for banning stock trading that all members have coalesced around.",
    "Lawmakers on both sides of the aisle are teeming with ideas to halt the practice of self-enrichment.",
    "But the speaker’s thinking appears to have evolved somewhat in the weeks following her remarks.",
    "“This isn’t about penalizing people more when they do something that seems inappropriate.",
    "Members of Congress often face minimal penalties and low fines for violating the measure.",
    "Ossoff’s bill would fine members of Congress from their salaries if they broke the law.",
    "“I don’t want to end up in a situation where we can’t get a bill to the floor.",
    "“I do believe in the integrity of people in public service,” Pelosi said.",
    "They should be able to participate in that,” Pelosi said in December.",
    "“The third branch of government, the judiciary, has no reporting.",
    "“We have to do this to deter something that we see as a problem.",
    "We’ve got to have 60 members to back a bill to get to the floor.",
    "“I would like to see it done,” Schumer said on Tuesday.",
    "And we don’t want to let that happen,” Merkley said.",
    "Like, I didn’t even know that was a thing.",
    "“We are a free-market economy.",
    "Which one will they choose?"
  ]
}