{
  "id": 2332,
  "mediaId": 2528,
  "date": "2022-02-04",
  "headline": "Senate Democratic leaders are now open to a congressional stock trading ban after initial reluctance",
  "image": "https://i.insider.com/61fdb4eefa4f1f001826290e?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/senate-schumer-vote-banning-lawmakers-trading-stocks-ossoff-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    0
  ],
  "sentences": [
    "Insider also identified numerous conflicts-of-interest issues, as well as discord between lawmakers' personal stock trades and their public responsibilities, such as members who craft anti-tobacco policy but invest in tobacco giants and others who receive plaudits from environmental groups for crafting policy aimed at combating the climate crisis — yet invest in fossil fuel companies.",
    "The movement in the upper chamber comes after Insider released \"Conflicted Congress,\" a five-month investigation which found that dozens of lawmakers and at least 182 senior congressional staffers had failed to comply with the reporting requirements of the 2012 Stop Trading on Congressional Knowledge Act, or STOCK Act.",
    "On the House side, Speaker Nancy Pelosi initially declared her opposition to banning members of Congress and their spouses from trading stocks, telling Insider at a December press conference that \"we are a free-market economy\" and members of Congress \"should be able to participate in that.\"",
    "Ossoff and Kelly's legislation would require all members of Congress, their spouses, and dependent children to place their stock portfolios into a blind trust — a financial vehicle that's independently managed by a trustee and approved by ethics committees in the House or Senate.",
    "Bill Clark/CQ Roll Call\nGrowing momentum\nThe push also comes after House Republicans told several news outlets they plan to run 2022 midterm campaigns with promises to deliver on their own forthcoming proposal to restrict or ban members of Congress from trading individual stocks.",
    "But Senate Democratic leadership has taken an interest in the issue amid growing bipartisan pressure, and they hope to vote on a bill this year if members can agree on what reforms to advance, four Democratic aides familiar with the deliberations told Insider.",
    "In a call Friday, Democratic leadership staff told legislative directors for Democratic senators about their aspirations for bringing a congressional stock-trading ban bill to the floor of the US Senate, Democratic aides confirmed.",
    "Senate Majority Leader Chuck Schumer of New York has asked various members to form a working group so the caucus can coalesce around different proposals, said an outside source who asked not to be named in order to speak candidly.",
    "The Senate Democratic working group includes members who have been working on this issue for years as well as some newcomers who have recently introduced bills to restrict or ban stock trading, including freshmen Democratic Sens.",
    "One Democratic aide said that Democrats are hoping that the group will be able to work in a way that can gain bipartisan support — that the party wants to go beyond making it a political issue and try to actually pass a bill.",
    "She has since softened her position, signaling she won't stop a ban if it's supported by her caucus while directing the House Committee on Administration to consider higher penalties for STOCK Act violations.",
    "—Forbes (@Forbes) January 11, 2022\nSchumer himself was largely silent on the matter during the first weeks of 2022, dodging a question when Insider asked him about a congressional stock-trade ban in January.",
    "A Senate vote on the matter during an election year would help Democrats show they're ready to legislate on an issue that has the support of the vast majority of voters, according to several recent polls.",
    "President Joe Biden punted on the issue — much to the chagrin of some Democratic congressional candidates — with White House press secretary Jen Psaki saying it's up to Congress to decide what to do.",
    "One possibility is the Ban Congressional Stock Trading Act from Ossoff and Kelly, which has slightly more Senate cosponsors than Democratic Sen. Jeff Merkley of Oregon's Ban Conflicted Trading Act.",
    "Bill Clark/CQ-Roll Call, Inc via Getty Images\nSenate Majority Leader Chuck Schumer has asked Democrats to coalesce around a plan to place stricter limits on congressional stock trading.",
    "Warren, a well-known progressive and 2020 presidential candidate, first introduced a sweeping ethics reform bill called the \"Anti-Corruption and Public Integrity Act\" in 2018.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "After weeks of silence, Senate Democratic leaders have asked lawmakers to propose improvements on rules governing congressional stock trading, Insider has learned.",
    "Other Democratic leaders, including House Majority Leader Steny Hoyer, have resisted supporting a ban on federal lawmakers trading stocks.",
    "\"It has been a growing crescendo for the last couple of weeks,\" said one Democratic aide who is not authorized to speak on the record.",
    "Senate Majority Leader Chuck Schumer of New York and House Speaker Nancy Pelosi of California at the US Capitol on February 1, 2022.",
    "Josh Hawley of Missouri and Ben Sasse of Nebraska have also introduced their own bills to ban lawmakers from trading stocks.",
    "Members of both parties have called for reforms in recent weeks, introducing or re-introducing several similar bills.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Peters chairs the Homeland Security and Governmental Affairs Committee, which had purview over the 2012 STOCK Act.",
    "Jeff Merkley of Oregon, Sherrod Brown of Ohio, Elizabeth Warren of Massachusetts, and Gary Peters of Michigan.",
    "Ossoff and Kelly are part of a new working group, along with Sen. Elizabeth Warren and several others.",
    "\"Then the hope is that it could create the wedge that is necessary to get something passed ...",
    "Jon Ossoff and Mark Kelly introduced the Ban Congressional Stock Trading Act last month.",
    "A fifth person familiar with the evolving situation confirmed the deliberations.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Several Republicans have supported stricter limits on stock trading.",
    "There is a small universe of issues that is bipartisan right now.\"",
    "It's not clear whether a specific Senate bill will get a vote.",
    "House Majority Leader Steny Hoyer, a Democrat of Maryland.",
    "Leadership absolutely wants to pass something on this.",
    "Others on the working group include Democratic Sens.",
    "\"They are saying they are for it,\" the person said.",
    "Jon Ossoff of Georgia and Mark Kelly of Arizona.",
    "He noted that he doesn't personally own stocks.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "The work is still in early stages.",
    "Loading Something is loading.",
    "The push comes after Sens.",
    "Republican Sens."
  ]
}