{
  "id": 2392,
  "mediaId": 2548,
  "date": "2022-02-09",
  "headline": "Vulnerable Democrats Introduce Bill To Suspend Gas Tax",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/GettyImages-1235560216-scaled-e1644443215611.jpg",
  "link": "https://dailycaller.com/2022/02/09/democratic-senators-mark-kelly-maggie-hassan-gasoline-tax/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thomas Catenacci",
  "authorUrl": "https://dailycaller.com/author/thomasgcatenacci@gmail.com",
  "termIds": [
    0
  ],
  "sentences": [
    "“We need to continue to think creatively about how we can find new ways to bring down costs, and this bill would do exactly that.”\nIn response to the rising prices in late 2021, President Joe Biden tapped into the nation’s Strategic Petroleum Reserve of crude oil, a move criticized by experts as unnecessary and unhelpful.",
    "“This bill will lower gas prices by suspending the federal gas tax through the end of the year to help Arizona families struggling with high costs for everything from gas to groceries.”\nIn November, gasoline prices started to decline after consistently rising through President Joe Biden’s first 9 months in office.",
    "(RELATED: ‘Will Not Fix The Problem’: Biden Releasing Oil Reserves Due To Politics, Critics Say)\n“Arizonans are paying some of the highest prices for gas we have seen in years and it’s putting a strain on families who need to fill up the tank to get to work and school,“ Kelly said in a statement.",
    "The Cook Political Report rated Hassan’s upcoming race as a “lean D” and the three other senators’ races as “toss up.”\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "(RELATED: Democrats Pop Champagne Corks Over 2-Cent Reduction In Gas Prices, Praise Joe Biden)\n“People are feeling a real pinch on everyday goods, and we must do more to help address rising costs, particularly the price of gas,” Hassan added.",
    "The bill would attempt to nix a federal 18 cents per gallon gasoline tax and lower rising prices at the pump, an issue seen by most Americans as a major problem, according to a Feb. 2 Gallup poll.",
    "The four senators are each facing extremely tight elections in November, which have been rated by The Cook Political Report as the closest midterms involving incumbent Democrats.",
    "Pump prices have surged 49.3%, 44.3%, 40.7% and 38.7% over the past year in Arizona, Georgia, New Hampshire and Nevada respectively as of Wednesday, according to AAA data.",
    "Several Senate Democrats locked in tight midterm races introduced legislation Wednesday that would temporarily suspend the gasoline tax amid surging prices.",
    "However, prices have again started to spike nationwide, hitting $3.44 per gallon on Monday, the highest level since 2014, federal data showed.",
    "Mark Kelly of Arizona and Maggie Hassan of New Hampshire introduced the Gas Prices Relief Act with co-sponsors that included Sens.",
    "Oil prices ticked up after the president’s action, which represented a fraction of the oil consumed daily by Americans.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "Catherine Cortez Masto of Nevada and Raphael Warnock of Georgia.",
    "Democratic Sens."
  ]
}