{
  "id": 2405,
  "mediaId": 2641,
  "date": "2022-02-09",
  "headline": "Pelosi Caves, Backs Stock-Trading Ban",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=ee6b7164-12d9-4716-89fe-12e10cd9ea72&SiteName=Newsmax",
  "link": "https://www.newsmax.com/finance/streettalk/speaker-pelosi-ban-stock-trading-caves/2022/02/09/id/1056174/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlie McCarthy",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Changes also are expected to include new restrictions on investments for federal judges, as well as increases in the fines for lawmakers who are late in filing their annual financial disclosure reports, Punchbowl News said.",
    "The speaker has raked in as much as $30 million personally from insider stock trades on the very Big Tech companies facing an antitrust bill in Congress, the New York Post reported early last month.",
    "Punchbowl News reported that Rep. Zoe Lofgren, D-Calif., chair of the House Administration Committee, has taken the lead on compiling recommendations for the leadership on how to enact such a ban.",
    "Speaker Nancy Pelosi, D-Calif., has done an about face and now is working with House Democrats to ban members of Congress and senior staff from trading stocks, Punchbowl News reported Wednesday.",
    "Democrats intend to amend the STOCK Act, the 2012 law governing how members disclose the purchase or sale of stocks, to eliminate the trading of individual stocks by members of Congress.",
    "Reuters recently reported that Pelosi filed transaction reports showing her husband, financier Paul Pelosi, made trades valued at as much as $5 million at a time in Big Tech companies.",
    "Newsmax host Grant Stinchfield has launched a petition campaign — GiveItBackNancy.com — demanding that Pelosi return $35 million to help poor and working-class families.",
    "House Minority Leader Kevin McCarthy, R-Calif., has said he supports a stock-trading ban and would look into it if Republicans win back the House.",
    "A multimillionaire, she has filed trade disclosures that were shared widely across social media soon after they appeared on the House website.",
    "That's what I advise members to do because I think it prevents such suggestions that you’re going to be engaged in insider trading.",
    "Elizabeth Warren, D-Mass., and Steve Daines, R-Mont., were working to \"to file a stock-ban bill\" in the upper chamber.",
    "Among the challenges:\nWould a lawmaker be able to hold onto stocks that he or she owned before coming to Congress?",
    "Will there be a waiver or deferral on capital gains tax when incoming lawmakers sell stock before being sworn in?",
    "Momentum behind the updated legislation has picked up in an election year with control of Congress up for grabs.",
    "However, Senate Minority Leader Mitch McConnell, R-Ky., has been non-committal on the issue.",
    "\"I haven't given that any serious thought yet,\" McConnell told reporters on Tuesday.",
    "We'll take a look at that kind of legislation and see what may be appropriate.\"",
    "Crafting rules to dictate whether family members of lawmakers can trade stocks.",
    "Sources told Punchbowl News that drafting the legislation has been complicated.",
    "Jon Ossoff, D-Ga., and Mark Kelly, D-Ariz., also have introduced a bill.",
    "\"We're a free-market economy,\" Pelosi told reporters in mid-December.",
    "Pelosi previously said she did not support such a ban.",
    "\"[Lawmakers] should be able to participate in that.\"",
    "Pelosi then will decide how to proceed.",
    "\"I don't own any individual stocks.",
    "Everything is in a mutual fund.",
    "Axios reported that Sens.",
    "All rights reserved.",
    "© 2022 Newsmax.",
    "Special Links:",
    "Sens."
  ]
}