{
  "id": 2420,
  "mediaId": 2630,
  "date": "2022-02-10",
  "headline": "Congressional leaders race to catch up to stock ban momentum",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_06/3534357/220210-nancy-pelosi-al-0820.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/congressional-leaders-race-catch-stock-ban-momentum-n1288917",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The Lamon campaign tells Kapur it’s running the ad as part of an “upper six-figure campaign.” It’s not the first time Lamon has tried to stand out in a crowded primary field with an edgy ad — during last month’s college football national championship, Lamon ran an ad where he used the pejorative conservative rallying cry “Let’s go Brandon.”\nThe New York Times reports there may have been classified material among the boxes taken with former President Trump when he left office, and the National Archives wants the Justice Department to investigate Trump’s handling of White House records.",
    "Pat McCrory, who is running for Senate in a primary field that includes the Trump-backed Rep. Ted Budd, said in a social media video that “‘legitimate political discourse does not include threats against people or property,’” going on to praise Senate Minority Leader Mitch McConnell as “right to call out our own party leaders.”\nA new super PAC is aiming to help Rep. Conor Lamb, D-Pa., in his Senate race, Politico reports.",
    "GOP in-fighting intensified yesterday with Trump endorsing two primary challengers taking on sitting House Republicans: Katie Arrington, who is challenging South Carolina Rep. Nancy Mace, and Loren Culp, who is taking on Washington Rep. Dan Newhouse, one of the 10 House Republicans who voted to impeach Trump after Jan. 6.",
    "pic.twitter.com/LOExvITfLZ\n— NBC News PR (@NBCNewsPR) February 8, 2022\nThat’s the share of Republicans and Republican-leaners who say they have been vaccinated and boosted for Covid, compared to 62 percent of Democrats and Democratic-leaners in a new Pew Research survey.",
    "Two, their response — instead of tackling income inequality or disparities in the workplace — is offering a reform that addresses how the system might benefit elected representatives, rather than addressing how the overall system is rigged against average Americans.",
    "In the spot, Lamon is dressed as a sheriff in a duel with “Old Joe,” “Shifty Kelly,” and “Crazyface Pelosi,” all presumably caricatures of President Joe Biden, Arizona Democratic Sen. Mark Kelly and Speaker of the House Nancy Pelosi.",
    "5: How many House Republicans former President Donald Trump endorsed Wednesday, including Reps. Elise Stefanik and Claudia Tenney of New York; Michigan’s John Moolenar; Virginia’s Morgan Griffith and Ohio’s Warren Davidson.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nWhen Biden travels to Culpepper, Va., today, he’ll be appearing with vulnerable Rep. Abigail Spanberger, D-Va., NBC’s Josh Lederman reports.",
    "Justice Democrats is spending $78,000 on TV ads aimed at boosting Democrat Jessica Cisneros over Texas Democratic Rep. Henry Cuellar in next month’s primary, the group’s independent expenditure arm confirmed to NBC.",
    "And three, that Speaker Nancy Pelosi and Mitch McConnell have reluctantly endorsed or considered this ban on stock trading shows that they see this raw anger — and might be afraid of getting pitch-forked by voters.",
    "Congress facing growing pressure over lawmakers trading stocks\nFeb. 9, 202201:28\nOne, Democratic and Republican lawmakers see plenty of voter anger and distrust in institutions, and they’re responding in kind.",
    "There’s also a significant partisan difference in the portion of Republicans and Democrats who are fully vaccinated — 60 percent of Republicans and leaners, compared to 85 percent of Democrats and leaners.",
    "Republicans scrambled to find enough votes, and one Republican whose undisclosed illness had forced him to miss the entire session so far showed up to vote hooked up to oxygen, per the Kansas City Star.",
    "The ad is part of a $500,000 buy, per the RGA, and is an early example of how Trump’s thirst for primary challenges to sitting incumbents will run him up against the national party apparatus at times.",
    "After villagers complain about “open borders” and “gas prices,” Lamon pulls out his revolver and shoots the weapons out of each politicians’ hands, prompting the three Democrats to run away.",
    "@NBCNEWS EXCLUSIVE: @LesterHoltNBC will sit down with President Joe Biden in an exclusive, wide-ranging interview airing during NBC’s Super Bowl LVI Pregame Show on Sunday, Feb. 13.",
    "A federal judge said yesterday Georgia’s May 24 primary could be delayed until the summer due to ongoing redistricting lawsuits, the Atlanta-Journal Constitution reports.",
    "Vaccinated Republicans are also far less likely to want to get a booster every six months — 42 percent said they’d be willing to compared to 77 percent of Democrats.",
    "Laura Kelly’s veto of the state’s newly drawn congressional map, enacting new lines that could endanger Kansas’ lone Democratic member of Congress, Sharice Davids.",
    "1,055: The number of people shot and killed by police in 2021, according to The Washington Post, the most in one year since the paper started tracking in 2015.",
    "But first: The rare bipartisan activity around banning stock trades by members of Congress tells you a lot about the current state of our politics.",
    "And Times reporter Maggie Haberman’s new book claims White House aides noticed Trump had flushed documents down the toilet in the White House.",
    "GOP Arizona Senate candidate Jim Lamon is set to air an Old Western-style ad during Sunday’s Super Bowl, NBC News’ Sahil Kapur reports.",
    "77,445,818: The number of confirmed cases of Covid in the United States, per the most recent data from NBC News and health officials.",
    "The White House is doing damage control with Latino allies after criticism of Health and Human Services Secretary Xavier Becerra.",
    "... Arizona GOP Senate candidate to release “OK Corral”-themed TV ad that will air during Super Bowl, per NBC’s Sahil Kapur.",
    "WASHINGTON — If it’s Thursday ... President Biden heads to Culpepper, Va., to talk about lowering health care costs.",
    "915,923: The number of deaths in the United States from Covid so far, per the most recent data from NBC News.",
    "It’s all interesting — the anger, the rare bipartisanship and the way lawmakers have decided to respond.",
    "... Biden also meets with Senate Judiciary Democrats to discuss upcoming Supreme Court vacancy.",
    "Portions of the interview will first air on @NBCNightlyNews Thursday, Feb. 10 at 6:30 p.m.",
    "Meanwhile, the Republican Governors Association launched a TV ad to support Georgia Gov.",
    "Brian Kemp, who faces a Trump-backed primary challenger in former Sen. David Perdue.",
    "The Jan. 6 committee has subpoenaed former Trump White House aide Peter Navarro.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "(Trump released a statement Thursday morning denying the allegation.)",
    "The Kansas state House voted to override Democratic Gov.",
    "... Donald Trump endorses two GOP primary challengers.",
    "... And Nathan Chen and Chloe Kim grab gold medals.",
    "... NBC’s Lester Holt interviews the president.",
    "Former North Carolina Republican Gov.",
    "ET.",
    "."
  ]
}