{
  "id": 2423,
  "mediaId": 2636,
  "date": "2022-02-05",
  "headline": "Don’t Touch. Don’t Even Look. Invest Like Your Senators Should.",
  "image": "https://static01.nyt.com/images/2022/02/05/business/04money/04money-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/05/your-money/stock-portfolio-investment-management.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“There are various other easier ways to deal with conflicts of interest.”\nThe simplest is to sell all the stocks and other investments that might pose a problem and replace them with diversified holdings — an approach that any civilian can use without a lawyer or an investment pro, as Mr. Morgan’s colleague Beth Shapiro Kaufman pointed out.",
    "You can buy mutual funds through your app or platform of choice, and you could remove temptation entirely if you invest through a company like Betterment, which puts money only in a selection of funds that it tailors to your tolerance for risk.",
    "It would also be nice if do-it-yourself investment platforms like Robinhood and even Vanguard let you opt into a requirement that you talk to a specially trained representative before you did anything during periods of market turmoil.",
    "Perhaps you’ve lost some money betting on stocks, like MetaZuckerbook, and you feel you ought to do something in the face of a wildly swinging market where a giant company can soar or lose a quarter of its value in a day.",
    "The people who use them tend to have access to a wide variety of information that could cause stocks in many different industries to go up or down, and they often possess it before the general public does.",
    "Blind trusts — or something similar, where you can’t touch or even see what’s happening with your portfolio in the short term — would address the issue, and the more common problem of reactionary trading.",
    "Politicians on both sides of the aisle, already stung by generalized disapproval of everyone in elected office, are sore from suspicions of insider trading, or at least the appearance of it.",
    "This can be a useful thing when you’re younger, and such investors may only now be experiencing the kind of upheaval and losses that can lead them to seek out supervised self-restraint.",
    "Fortunately there’s a sound strategy that even sworn enemies like Senator Josh Hawley and Representative Alexandria Ocasio-Cortez agree on: Take yourself out of the investing equation.",
    "Mr. Yarnway told me about his clients who now want to be less aggressive in the wake of market downdrafts when, just a few months ago, they were aching to buy more at market highs.",
    "Two Senate Democrats, Mark Kelly of Arizona and Jon Ossoff of Georgia, are sponsoring a bill to limit members of Congress’s trading activity, and they have blind trusts themselves.",
    "So in recent weeks, politicians have been racing to propose legislation that would force elected officials to have financial pros do certain kinds of stock investing for them.",
    "The sages at the Federal Reserve already had to restrict the investing activity of some employees after two senior officials resigned after their own eyebrow-raising trades.",
    "“It takes a lot longer than three months to reach your own goals.”\nYou don’t have to react to individual stock movements if you have no individual stocks in the first place.",
    "Unfortunately, their offices would not put me in touch with their lawyers or investment advisers to discuss the trusts’ mechanics or either man’s investing philosophy.",
    "First, goals should dictate your investments, not the Nasdaq’s daily hysterics or whatever happened to Meta’s stock price after it reported a lousy couple of months.",
    "“It’s a little bit of a pain,” said Bryson B. Morgan, who practices with the political law and exempt organizations groups at Caplin & Drysdale in Washington.",
    "They’re seeking restrictions on lawmakers inclined to own individual stocks, ensuring they can’t trade on inside information or even look as if they are.",
    "Even the sitting senator whose trades have drawn particular scrutiny, Richard M. Burr, Republican of North Carolina, is down with the program.",
    "This can protect you from your own baser instincts, whether it’s fear or greed: feelings you’d be wise to recognize but foolish to act upon.",
    "“They can buy a certain set of mutual funds that have their preferred asset allocation and rebalance on a preset, periodic basis,” she said.",
    "The beneficiaries — that is, the people with the inside information — can set basic investment goals and update them from time to time.",
    "In the strangest of spectacles, politicians are raising their hands in unison, begging to have them tied behind their own backs.",
    "They could even charge for it; maybe it would help replace whatever revenue they might lose from more peripatetic traders.",
    "A generation of their gregarious pupils are currently working through a sort of home-school investing curriculum.",
    "Neither of you will be able to mess with your portfolio’s contents, until you’ve checked in at an annual meeting.",
    "Moreover, those professionals would not be able to reveal in the moment which — if any — stocks they had bought.",
    "But they don’t get to see the individual investments that the adviser is buying, holding, selling or shorting.",
    "“Then they just have to be disciplined when they get a pit in their stomachs.”\nThe pit, however, is a problem.",
    "While you feel it in your stomach, it starts in your head — and it’s wise to prime your brain with guidelines.",
    "You each can buy — and hold — individual securities as long-term bets with money that you can afford to lose.",
    "“Think about it,” said Dasarte Yarnway, founder of the wealth management firm Berknell Financial Group.",
    "But other lawyers who have set up blind trusts said the vehicles were often a kind of last resort.",
    "If theirs is an investment portfolio like that, they’ll begin the process by setting up a trust.",
    "And with some guardrails, you can avoid taking actions that you would probably regret later.",
    "“I’ll support whatever they come up with,” he told my colleague Jonathan Weisman this week.",
    "So how would it work for people like him — and how might something like it work for you?",
    "Then, be each other’s trustee: Have your partner change the password on your account.",
    "If you don’t want to pool your money in mutual funds, how about pooling your resolve?",
    "If you prefer not to mingle finances and friends, advisers can handle this job, too.",
    "The advisers must be people who have never managed the beneficiaries’ assets.",
    "Lawyers draw up the documents, and then investment advisers run the trust.",
    "Their fee generally covers mania avoidance and its attendant hand-holding.",
    "They are, quite literally, blind to what is going on in their portfolio.",
    "Blind trusts are not a new concept, but they’re used relatively rarely.",
    "Enlist a trusted friend or relative in a portfolio nonaggression pact.",
    "The buy-high, sell-low thing is just human nature.",
    "“Losses aren’t permanent,” Mr. Yarnway said.",
    "If he’s good with it, you should be, too.",
    "“Unless you click ‘sell.’”",
    "It’s no surprise."
  ]
}