{
  "id": 2437,
  "mediaId": 8340,
  "date": "2022-02-10",
  "headline": "Senators Warren and Daines to File Bipartisan Stock Ban Bill",
  "image": "https://www.investopedia.com/thmb/qjD1WWvPLaKtBzhgtFP9bV2SEpo=/2112x1420/filters:fill(auto,1)/GettyImages-sb10066698qn-001-0e860b9549534932930ebceae00c2260.jpg",
  "link": "https://www.investopedia.com/senators-warren-and-daines-to-file-bipartisan-stock-ban-bill-5218681?utm_campaign=rss_headlines&utm_source=rss&utm_medium=referral",
  "mediaOutlet": "investopedia.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Reiff",
  "authorUrl": "https://www.investopedia.com/contributors/54684/",
  "termIds": [
    0
  ],
  "sentences": [
    "However, this law remains rarely enforced.1 In an investigation, Business Insider has found that 55 members of Congress and more than 180 senior congressional staffers have violated the 2012 law.23\nSeparately, news broke in 2020 that both Democratic and Republican senators had traded healthcare stocks following closed-door information briefings on the emerging COVID-19 pandemic.",
    "Earlier in the week, Sen. Mitt Romney (R-UT) said that he would meet with Sen. Jeff Merkley (D-OR) to review a separate, related bill introduced by the Oregon senator.1\nSenators Jon Ossoff (D-GA) and Mark Kelly (D-AZ) have also proposed similar legislation, which is supported by a group of Democratic senators.",
    "However, lawmakers would still be able to own stock, so long as it was through diversified vehicles like mutual funds.1\nSenators Elizabeth Warren and Steve Daines have partnered to introduce a bill prohibiting lawmakers and certain close contacts from owning or trading individual stocks.",
    "Merkley's bill would not require a blind trust but would ban trades for sitting lawmakers.1\nSeveral Republican lawmakers, including Senate Minority Leader Mitch McConnell, have introduced similar bills or voiced an interest in engaging on the issue as well.",
    "The issue of congressional stock-trading has seen surging interest on both sides of the aisle in recent months.1\nThe bill would go further than existing laws requiring members of Congress to place stocks they own into a blind trust.",
    "Warren has since introduced broad anti-corruption legislation including a ban on stock trading for lawmakers.1\nStock-Ban Issue Heats Up\nNotably, Warren and Daines have received outspoken support from members of both parties.",
    "Senators Elizabeth Warren (D-MA) and Steve Daines (R-MT) will partner to introduce a bipartisan bill prohibiting U.S. lawmakers and their spouses from owning or trading individual stocks.",
    "Still, high thresholds to passing major legislation suggest that more consensus-building may be necessary for a stricter stock-trading ban to be enacted.1",
    "Ossoff and Kelly's bill would obligate members of Congress and certain members of their immediate families to place stock portfolios in a blind trust.",
    "House Speaker Nancy Pelosi and other leaders have hesitated to take up the stock-ban question, signaling that the bill may face some resistance.",
    "2012 Law and Violations\nThe STOCK Act became law in 2012 and prohibits members of Congress from trading stock based on insider information.",
    "The surge in congressional interest mirrors growing scrutiny from the public over lawmaker investment behavior.",
    "The bill goes further than the 2012 STOCK Act, which bans congressperson trades based on inside information.",
    "The bill has already won bipartisan support following increased public scrutiny of lawmaker investments."
  ]
}