{
  "id": 2457,
  "mediaId": 3987,
  "date": "2022-02-10",
  "headline": "America’s Voice Reacts to Arizona GOP Senate Candidate Jim Lamon’s Despicable New Ad",
  "image": "http://americasvoice.org/wp-content/uploads/2022/01/GOP-1200x800.png",
  "link": "https://americasvoice.org/press_releases/americas-voice-reacts-to-arizona-gop-senate-candidate-jim-lamons-despicable-new-ad/?utm_source=rss&utm_medium=rss&utm_campaign=americas-voice-reacts-to-arizona-gop-senate-candidate-jim-lamons-despicable-new-ad",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AV Press Releases",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Washington, DC – An ad released today by Arizona Republican Senate candidate Jim Lamon features Lamon as an Old West Sheriff shooting characters representing President Biden, Senator Mark Kelly (D-AZ), and Speaker of the House Nancy Pelosi.",
    "To add insult to injury, the ad shows a shot fired at Senator Mark Kelly (D-AZ), whose wife Gabby Giffords nearly died after being shot while performing her duties as an elected representative in Arizona.",
    "Lamon’s ad has the Arizona Republican candidate for Senator firing a gun at characters depicting President Biden, Speaker Pelosi and Senator Mark Kelly.",
    "The only appropriate response is for Border Patrol members to rise up and denounce Judd for his stupid and dangerous decision to appear in the ad.",
    "Violence, insurrection and conspiracy might be the future of many in the Republican Party, but it cannot be the future of America.",
    "Check out ongoing examples of Republicans’ anti-immigrant ads at the America’s Voice GOP Ad Tracker: http://gopadtracker.com/",
    "In the ad, Lamon is flanked by National Border Patrol Union head Brandon Judd and Pinal County (Ariz) Sheriff Mark Lamb.",
    "According to Frank Sharry, Executive Director of America’s Voice:\nJim Lamon’s ad is not funny, it’s dangerous.",
    "After appearing in the ad as Lamon shoots American leaders, the questions have to be asked: Have you no shame?",
    "As a nation, we should do all we can to keep from finding out where such outrageous behavior will lead.",
    "The ad depicts violence against elected leaders and should be taken down immediately.",
    "It should be denounced by one and all, especially by his fellow Republicans.",
    "Unless idiots like Lamon are held accountable, it will just get worse.",
    "And then there is Border Patrol union chief Brandon Judd.",
    "If not, the silence will be deafening.",
    "Have you no brains?",
    "Disgusting."
  ]
}