{
  "id": 2505,
  "mediaId": 6511,
  "date": "2022-02-10",
  "headline": "Demócratas piden suspensión temporal del impuesto federal a la gasolina para compensar las alzas",
  "image": "https://laopinion.com/wp-content/uploads/sites/3/2022/02/GettyImages-153883182.jpg?quality=80&strip=all&w=1200",
  "link": "https://laopinion.com/2022/02/10/democratas-piden-suspension-temporal-del-impuesto-federal-a-la-gasolina-para-compensar-las-alzas/",
  "mediaOutlet": "LA OPINIÓN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "De acuerdo con AP, no es la primera vez que se intenta suspender el impuesto a la gasolina, los congresistas han considerado la idea de suspenderlo en contextos como la pandemia de la Covid, pero no generaron suficiente apoyo legislativo para que el proyecto de ley fuera realidad.",
    "BROWN / AFP / Getty Images\nCon el fin de ayudas a las familias estadounidenses a que no les afecte en su economía las constantes alzas de precios en los combustibles, dos senadores demócratas lanzaron la propuesta de suspender temporalmente el impuesto federal a la gasolina.",
    "Hasta el momento, no se informó cuándo se discutiría la propuesta de los senadores y, su eventual votación en la Cámara Alta del Congreso, pero se espera que algunos legisladores republicanos se puedan adherir para con ello garantizar su aprobación.",
    "Para cubrir la pérdida de ingresos por impuestos a la gasolina, el Departamento del Tesoro sacaría dinero del fondo general y lo transferiría al Fondo Fiduciario de Carreteras para mantenerlo solvente si se aprueba el proyecto de ley.",
    "La Asociación Americana de Automóviles (AAA), dio a conocer que, actualmente, el costo de un galón de gasolina es casi $1 dólar más que en la misma época del año pasado, mostrando que las alzas han sido constantes.",
    "“La gente está sintiendo una verdadera presión sobre los bienes cotidianos, y debemos hacer más para ayudar a abordar los costos crecientes, particularmente el precio de la gasolina”, dijo Hassan en un comunicado.",
    "Además, el proyecto de ley de los demócratas también ordena al Departamento del Tesoro que supervise el programa para garantizar que las compañías de petróleo y gas transfieran los ahorros a los consumidores.",
    "De acuerdo con la ley vigente, el impuesto federal a la gasolina se utiliza para pagar el Fondo Fiduciario de Carreteras, que cubre gastos como la construcción de vías y el transporte público.",
    "Mark Kelly y Maggie Hassan son los legisladores que impulsan la medida, la cual de aprobarse se aplicaría para el resto del año, con validez hasta hasta el 1 de enero del 2023.",
    "Según la AAA, un galón de gasolina, en promedio, tiene un costo $3.46 dólares en todo el país al día de hoy, pero en la misma fecha del 2021 representó $2.46 dólares.",
    "También te puede interesar: Aumentos de precios: la inflación llega a 7.5% interanual en enero, el mayor aumento en 40 años",
    "La propuesta ya fue firmada por otros cuatro demócratas y se espera que tenga eco en toda la bancada.",
    "El impuesto representa 18.4 centavos de dólar por galón desde 1993.",
    "Foto: FREDERIC J."
  ]
}