{
  "id": 2506,
  "mediaId": 2790,
  "date": "2022-02-09",
  "headline": "Bipartisan duo say voters want Congress to stop trading stocks, leaders open to a vote",
  "image": "https://media.npr.org/assets/img/2022/02/09/kn21562-edit_wide-f88a84f2f552882651ab8fdc28732e98b7d1501f.jpg?s=1400",
  "link": "https://www.npr.org/2022/02/09/1079364990/bipartisan-duo-say-voters-want-congress-to-stop-trading-stocks-leaders-open-to-a",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Deirdre Walsh",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Saying that we want to affirmatively ensure that the American people can have trust in us, in the decisions we're making and therefore we cannot own individual stocks, or we have to put it in a blind trust, that to me is a choice you make when you choose to run for this office.\"",
    "They decided to work on the issue after talking about news stories about several members of Congress who were under investigation for stock transactions they made following briefings in the early days of the coronavirus pandemic, before the impact on the U.S. economy was clear.",
    "Different proposals being debated in House and Senate\nIn the Senate, there are efforts to find consensus within the Democratic caucus, as well as with GOP senators who have proposed bills, according to multiple sources familiar with the talks.",
    "Sen. Elizabeth Warren, D-Mass., and Sen. Steve Daines, R-Mont., are working on a proposal, while Sen. Ben Sasse, R-Neb., has introduced a broader ethics reform bill and Sen. Josh Hawley, R-Mo., is pushing a bill with a ban on trading.",
    "\"If you are buying calls on Google ... how can American people have confidence that you're going to make a truly objective policy decision on the size and scope of Google with respect to antitrust questions, for example?\"",
    "They didn't campaign on the same issues, but they learned they shared the same alma mater and favorite basketball team, the same birthday, and over a beer learned there are some problems they could try to solve together.",
    "One point Roy and Spanberger make is the process they used to develop the bill — talking across the aisle and being open to changes — is the same one they think needs to happen more often in Washington.",
    "\"I believe this is an important issue that Congress should address and it's something that has clearly raised interest from both sides of the aisle over the last few weeks,\" Schumer said Wednesday.",
    "Roy agreed, \"I think this would be a very, you know, simple statement that you shouldn't be able to get wealthy on the back of the job you are carrying out on behalf of the people you represent.\"",
    "Another bipartisan bill being pushed by Rep. Raja Krishnamoorthi, D-Ill., Rep. Alexandria Ocasio-Cortez, D-N.Y., Rep. Matt Gaetz, R-Fla., and others in the House has a similar level of support.",
    "\"But then I called Ethics [committee] and I said, 'Wait a second, I'm beating them up now publicly, so if I unload it now it looks like I'm kind of gaming it while I'm trying to beat him up.'",
    "\"It's a chance for us to say ... when I'm working on legislation, when I'm taking a vote, when I'm in a briefing, I'm not thinking, oh, let me wonder how this could benefit me financially.",
    "\"We're seeing growing interest on both sides of the aisle in taking this issue on, and I'm hopeful that this is the moment in which we can finally get this issue on the floor and passed.",
    "Focus on how ban impacts families\nSpanberger and Roy's proposal, the Trust in Congress Act, would bar both lawmakers and their immediate family members from picking individual stocks.",
    "The Campaign Legal Center recently told NPR that in the last year roughly 50 members of Congress failed to disclose — or filed late reports on — their stock transactions.",
    "Merkley, who pressed for a ban on trading when Congress was debating the STOCK Act a decade ago, said in a written statement that an update to ethics laws is overdue.",
    "Pelosi declined to get into the details on which proposal would make it to the House floor, but said she wants to extend any reforms to the federal judiciary.",
    "Two House members from different parties push bill\nTexas Republican Chip Roy and Virginia Democrat Abigail Spanberger were elected in the same class in 2018.",
    "And both bemoan the fact that in the current political environment there is a tendency to avoid signing onto bills without 100% agreement on every detail.",
    "One proposal introduced years ago by Oregon Sen. Jeff Merkley, D-Ore., would ban lawmakers and senior staff from buying and selling individual stocks.",
    "Just because I'm in COVID briefings — ignore the fact that when a pandemic started, he's buying stocks and insert pharmaceutical company name, right?",
    "He had an investment in a pipeline that ran through his district, but he opposed something they were doing and was part of discussions to address it.",
    "\"None of this would stop you from being able to engage in free enterprise, in the free market, being able to continue to to hold your investments.",
    "Roy said lawmakers have an inherent conflict of interest because they attend briefings and sit on committees that impact corporate bottom lines.",
    "So I ended up kind of sitting on it, which I think was actually to my financial detriment, but that's neither here nor there to this point.",
    "\"It eludes me as a possibility that someone would say to the American people, 'Oh, no, no, no, no, my spouse makes all his own decisions.'",
    "They say making this reform is an easy way to make absolutely clear that lawmakers make decisions without any ulterior financial motive.",
    "At her weekly press conference on Wednesday, she added House committees were working on a proposal and a bill could move \"pretty soon.\"",
    "There's a 10-year-old law already on the books, called the STOCK Act, that requires lawmakers to disclose stock trades within 45 days.",
    "Sen. Jon Ossoff, D-Ga., and Sen. Mark Kelly, D-Ariz., have introduced the Senate companion bill to Roy and Spanberger's House bill.",
    "She said in December she didn't think a ban was necessary, but has reversed course as members in her caucus have pushed the issue.",
    "Top congressional Democrats are signaling Congress could vote soon on legislation to ban lawmakers from trading individual stocks.",
    "There's a number of things that we're trying to come together and sort of sit over beer — literally — and solve some problems.\"",
    "\"This is the one piece of legislation that people are coming up to me and saying, 'Oh, my gosh, I was reading about that bill.'",
    "\"It's not just enough to know what members are buying or selling, it's that they shouldn't be buying or selling,\" she said.",
    "The move comes amid pressure from rank and file members from both parties arguing that voters overwhelmingly back the idea.",
    "\"Of all the issues that I talk about, this one gets one of the most positive reactions across the ideological spectrum.",
    "\"People deserve to know that we are working for them first and foremost, and not our own financial stock portfolios.\"",
    "Grassroots calls for change\nBoth Spanberger and Roy said this is one issue that voters from both parties agree on.",
    "Whether I'm in downtown Austin or in fire breathing hill country ... 'Really, why hasn't that already been done?'",
    "I mean, we can just sit down, figure out a solution that we think works, and then you can always amend it later.\"",
    "He's been discussing proposals with Sen. Mitt Romney, R-Utah, and informal talks have picked up in recent weeks.",
    "During an interview with both lawmakers, Roy bristled a bit at the narrative they're political polar opposites.",
    "He thought maybe he should sell his shares, but immediately realized any transaction would raise questions.",
    "\"It is a confidence issue and if that's what members want to do then that's what we will do,\" Pelosi said.",
    "Their proposal does not cover spouses and dependent children, but does include a ban for senior staffers.",
    "The two introduced legislation in June 2020 to ban members of Congress from trading individual stocks.",
    "House Speaker Nancy Pelosi, D-Calif., doesn't personally trade individual stocks — her husband does.",
    "Spanberger added that change should be part of the process of entering federal public service.",
    "All we're saying is putit in a blind trust or be in broadly traded index funds,\" Roy said.",
    "Both Spanberger and Roy note their bill wouldn't prevent lawmakers from investing.",
    "Senate Majority Leader Chuck Schumer, D-N.Y., also signaled his support for a ban.",
    "Roy said if members have concerns, they are open to tweaks to the legislation.",
    "Roy recalled how this topic resonates with different constituencies back home.",
    "It's bad if you do it, it's bad if they do it,\" Spanberger told NPR.",
    "People are gonna say, 'You're insulting my intelligence,' right?",
    "It's time to end conflicted trading once and for all.\"",
    "I'm thinking about, how do I serve my constituents?\"",
    "Roy and Spanberger's bill has about 45 co-sponsors.",
    "The Texas Republican points to his own experience.",
    "But Spanberger says that approach doesn't work.",
    "My point is we shouldn't be in that box.\"",
    "This isn't curing cancer, right?",
    "That to me is really notable.\"",
    "\"I mean, we disagree on a lot.",
    "But we agree on a lot, too.",
    "\"We can solve this problem.",
    "Spanberger explained.",
    "\"\nSo does Spanberger.",
    "Roy asked.",
    "..."
  ]
}