{
  "id": 2514,
  "mediaId": 4067,
  "date": "2022-02-08",
  "headline": "The Democratic Campaign To Take Out Sen. Kyrsten Sinema Is Testing Out A Hero",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-02/9/18/campaign_images/85ce5b2efc20/the-democratic-campaign-to-take-out-sen-kyrsten-s-2-822-1644429900-11_dblbig.jpg",
  "link": "https://www.buzzfeednews.com/article/lissandravilla/kyrsten-sinema-ruben-gallego-arizona-senate",
  "mediaOutlet": "buzzfeednews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lissandra Villa",
  "authorUrl": "https://www.buzzfeednews.com/author/lissandravilla",
  "termIds": [
    0
  ],
  "sentences": [
    "But even if it didn’t, he added, “I’m just hoping the fact that she has someone else who’s pushing her will make her more beholden to her constituents, because I really feel like she doesn’t listen to us at all.”\nGallego may be the politician whose name gets brought up most often when talking about possible challengers, but activists on the ground are quick to point out that it’s quite early, a lot could change, and other Democrats might also make a run for it.",
    "From voting against including a raise to the minimum wage in a COVID-relief bill, which she did with a thumbs-down and a near curtsy as she cast her vote, to opposing a change to Senate rules that would have allowed Democrats to move forth on voting rights, to getting in the way of President Joe Biden’s signature social spending bill, Sinema has very much played the role of a roadblock (along with Sen. Joe Manchin) in the evenly split chamber.",
    "That’s your basic job.”\nIf you’re following the list of complaints that many Democrats in the state of Arizona and beyond have registered against Sinema — whom they first helped elect to the Senate in 2018 and have soured on substantially since the 2020 election for standing in the way of Democrats’ agenda — you’ll recognize that that last bit of what Gallego said is a subtweet: Sinema has been notoriously inaccessible.",
    "“I was surprised to see her on the plane didn’t know she came back.”\nWhen I asked if he meant this weekend specifically or generally, he responded: “Generally.”\n“Senator Sinema is too focused on delivering results, like her bipartisan infrastructure law, to respond to fake, infantile Washington drama such as these comments,” Hannah Hurley, a Sinema spokesperson, said in a statement responding to Gallego’s comments.",
    "“I think that there’s an opportunity for it to actually be like a primary where there will be candidates who challenge each other’s policies and points of view.”\nOne of the hurdles he would have to overcome is drastically building his campaign operation: For example, in 2020, he won his Maricopa County district easily but only brought in 165,452 votes.",
    "While he votes as a progressive, he’s crafted a profile in the House that has nurtured rather than alienated a relationship with the Democratic establishment: Currently, he is the chair of Bold Pac, the Congressional Hispanic Caucus’s campaign arm, and serves as an assistant whip of the House Democratic Caucus.",
    "“I think that the frustration comes from her stances and also from the fact that here we are now having to start talking and thinking about 2024 when so many of us would like to focus on what’s happening right now.”\nGallego, who was a member of a Marine Corps infantry in Iraq, speaks openly about his PTSD.",
    "And there’s a “Sinema Primary Pledge” that collected monetary pledges and then began converting them to donations to support a primary challenger once the Arizona senator voted against waiving the filibuster so the Senate could move forward on voting rights legislation with a simple majority.",
    "“As an ecosystem of coalition partners, we’re going to be in every single crevice of this state,” said Alejandra Gomez, co-executive director of Living United for Change in Arizona, or LUCHA, one of the biggest grassroots groups in the state and a beneficiary of the Primary Sinema Project.",
    "Outside of his own behavior teasing the possibility of a run, there’s a “Run Ruben Run” initiative raising money that it promises will go to him if he announces, a “Primary Sinema Project” raising money for grassroots groups focused on holding Sinema accountable.",
    "Recent polling has been bad news for her, Sen. Bernie Sanders said he is open to a primary and Gallego has said there are others, the Arizona Democratic Party has censured her, and major political players like EMILY’s List have started to distance themselves.",
    "“I don’t think she’s representing Arizona, … and she just wants to be her own little rock star.” Caglio, who said she was upset that Sinema is “aligning herself too much with the Republican agenda,” was the very first town hall attendee I spoke with.",
    "But it brings into stark terms the difference between the environment he’s used to running in and the immense resources he would have to build up to be competitive in what would be a closely watched race not just in the state, but nationally.",
    "Arizona was once seen as a stronghold for Republicans, but Democrats have built organizing infrastructure that culminated in narrowly winning control of both Senate seats in 2020 and flipping the state from Trump in 2016 to Joe Biden in 2020.",
    "It’s clear that many people are opposed to Sinema and are beginning to gather around Gallego as a possible foil, but there’s also a fair amount of frustration about the level of attention on a race that isn’t happening this election cycle.",
    "“The dynamic that I’m seeing is that there’s incredibly deep frustration with Sinema that ranges across the political spectrum in Arizona,” said Emily Kirkland, an ally of Primary Sinema Project and executive director of Progress Arizona.",
    "\"I know there is a potential for him to run for Senate, and so if he does I will absolutely back him over our current senator,” Johnathan Robinson, a music teacher in Phoenix, said when asked why he’d attended Gallego’s town hall.",
    "\"During three terms in the U.S. House, and now in the Senate, Kyrsten has always promised Arizonans she would be an independent voice for the state -- not for either political party,” said her office in a statement.",
    "“It is a shame on Sen. Manchin that they’re not recognizing the real threat that we’re seeing right now.”\nIt isn’t the first time he’s called out Sinema by name; he’s done it on the House floor, too.",
    "Some of her constituents, however, say they haven’t been able to get a hold of her, and she’s made little effort to speak with the national press at times when her vote has outsize influence.",
    "And if you’re at all familiar with Gallego’s growing national profile these days, it’s probably because his name gets tossed around most often as the Democrat most likely to primary Sinema.",
    "Recently, when a Russian politician called for his kidnapping, he responded: “Fuck around and find out.”\nDuring the Trump presidency, he was an outspoken critic of the administration.",
    "Whatever Gallego decides to do, it’s clear that for now he’s the canvas onto which many Democrats are projecting their hopes as their disappointment in Sinema continues to grow.",
    "“I don’t think that I would say that everything is in [Gallego’s] favor,” said Belén Sisa, a cofounder of Sinema Primary Pledge, which hasn’t endorsed any primary challenger.",
    "Much of their organizing involves working with the constituents who suffer the most from inaction on the federal level, putting the cost of Sinema’s votes in very real terms.",
    "It’s a more practical selection for the parade he’s going to directly after the outdoor town hall in Encanto Park he held on an unusually cold Saturday morning in Phoenix.",
    "All but two other winning congressional candidates in Arizona had more than 200,000 ballots cast for them; of all of them, Gallego had the fewest ballots cast for him.",
    "When I ask Robinson how he thinks that would translate to a statewide run, he’s candid: “The concern is, could he win statewide?” Robinson believes there is a chance.",
    "When talking about 2022, some organizers say they’re upset that she stood in the way of some of the initiatives that, if passed, Kelly could have touted on the trail.",
    "“Right now I’m really questioning things that she’s doing,” said Debbie Nez-Manuel, the Arizona Democratic National Committeewoman and a citizen of the Navajo Nation.",
    "“And so we have the opportunity to have very candid conversations to ensure that a candidate is absolutely value-aligned before we support them at the Senate level.”",
    "Her office disputes this and pointed to more than a dozen events she has done in recent months, most from November 2021 but a few as recently as January 2022.",
    "PHOENIX— Rep. Ruben Gallego, an Arizona Democrat, is propped against the driver’s seat of a vehicle and changing into tennis shoes at home in his district.",
    "He was also the winning congressional candidate in Arizona with the lowest number of votes in 2014, 2016, and 2018, or, his entire congressional career.",
    "Still, he made a point of texting me while he was en route to DC this week, noting he was on the same plane as Sinema, in which she sat in first class.",
    "During the town hall, he stood with palm trees in the background rustling in the wind as dozens of masked attendees sat in chairs and listened.",
    "Kyrsten Sinema, an influential Senate Democrat who has helped block major portions of the party's agenda, will be up for reelection in 2024.",
    "He also recently wrote a book, the type of move traditionally seen as a way for candidates to introduce themselves to a bigger audience.",
    "If they’re not happy, then I’ll have to make a decision.”\n“But from my experience having town halls, people want responsive government.",
    "That’s really important.”\nFor many Democrats, the hypothetical matchup between Gallego and Sinema has become a way to vent frustration.",
    "I’m really unhappy with her,” said Lynda Caglio, a retired paralegal from Phoenix, who said she supported previously supported Sinema.",
    "He seems like the type of candidate whom organizers could support in such a hypothetical run against Sinema, and they say as much.",
    "He attended Harvard, but retained an approachable mannerism: He knows what “IRL” stands for and tweets middle-finger emojis.",
    "The question of who would primary Sinema is a lot less settled on the ground than the national press implies, activists say.",
    "Lately, Gallego has been insisting that his focus is on running for reelection for his current seat and winning in 2022.",
    "It is a shame on Sen. Sinema because she participated,” he said, which elicited a round of applause from the audience.",
    "Gallego represents a safely Democratic district in Arizona, and his progressive brand of politics is at home here.",
    "The son of Colombian and Mexican immigrants, he grew up in a working-class family that he worked to help support.",
    "Other names that came up in conversations with me included Tucson Mayor Regina Romero and US Rep. Greg Stanton.",
    "“I agree with the decision to [censure her], and it’s really important to hold our elected leaders accountable.",
    "Gallego brought up Sinema on his own in the context of voting rights: “The Voting Rights Act needed to pass.",
    "Some of them, at the invitation of the representative, adjusted their place to sit in the warmer sunlight.",
    "On the day of the Jan. 6 insurrection, he was photographed instructing his colleagues on the House floor.",
    "Progressive organizers say they put aside personal preferences to get Sinema elected in the first place.",
    "And this is the context hanging over Gallego and nearly everything he does, including his town hall.",
    "He served in the Arizona House of Representatives before being elected to his House seat in 2014.",
    "“At the end of the day, it’s really a decision of the voters of Arizona and how they’re feeling.",
    "He has once before passed on a Senate run, ultimately deciding against it when Kelly jumped in.",
    "Running in a specific congressional district is not comparable to running a statewide campaign.",
    "Still, she seems to have even influenced races that should have little to do with her.",
    "Sinema won’t be up for reelection until 2024, but Sen. Mark Kelly is up this year.",
    "“She’s delivered for Arizonans and has always been honest about where she stands.\"",
    "He slips easily between English and Spanish in conversations with constituents.",
    "What would have to happen between now and then for him not to run for her job?",
    "If the voters are happy with what they’re getting, then I’ll be happy.",
    "And this is the kind of thing you’re supposed to be doing,” he added.",
    "The state always seems to find a way into the national spotlight.",
    "And that is a shame on the senators, and I don’t mind saying it.",
    "It remains an immensely competitive political battleground.",
    "Her office did not dispute that Sinema sat in first class.",
    "He thinks Gallego’s authenticity would break through.",
    "We need somebody who we elected to be there for us.",
    "I haven't made a decision myself,” Gallego told me.",
    "“There’s a lot of things that could happen.",
    "She brought up Sinema entirely on her own.",
    "I agree that we took the right steps.",
    "I’m hoping he’ll primary Sinema.",
    "“That’s not an abnormal thing.",
    "Nothing ever is concluded.",
    "She was not the only one.",
    "“I like Ruben a lot.",
    "It did not pass.",
    "I agree."
  ]
}