{
  "id": 2523,
  "mediaId": 2528,
  "date": "2022-02-10",
  "headline": "Why both Democrats and Republicans are politicizing their opponents' stock trades as a 2022 midterm campaign strategy",
  "image": "https://i.insider.com/62055bc83b86990018b2c2e5?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/stock-ban-congress-republicans-democrats-midterms-elections-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kimberly Leonard",
  "authorUrl": "https://www.businessinsider.com/author/kimberly-leonard",
  "termIds": [
    0
  ],
  "sentences": [
    "Tom Williams/CQ Roll Call/Getty Images\nDemocrats hitting Democrats on stocks\nAmong Democrats, several newcomers are specifically running on ethics reform promises, such as Mckayla Wilkes, who is trying to unseat Democratic Majority Leader Steny Hoyer, and Lucas Kunce, who is running for Republican Sen. Roy Blunt's seat in Missouri, which Blunt is vacating.",
    "Among them:\nRepublicans in New Jersey have taken to calling Democratic Rep. Tom Malinowski \"Trading Tom\" and \"The Wolf of Washington\" as the independent Office of Congressional Ethics found \"substantial reason to believe\" that he failed to properly disclose dozens of personal stock trades he made during 2019 and 2020.",
    "On Capitol Hill, a bipartisan group of lawmakers is actively pushing reforms, having introduced several different bills and resolutions that would, to one extent or another, curb the ability of lawmakers — and potentially, their family members and senior aides — from trading individual stocks.",
    "\"They smell blood in the water here, which in some ways is good,\" said Dylan Hedtler-Gaudette, government affairs manager at the nonprofit Project on Government Oversight, who said he hoped the political pressure and public outrage on the issue would result in Congress passing reforms.",
    "Wisconsin US Senate candidate Tom Nelson, a county executive running in a crowded Democratic primary to unseat vulnerable GOP Sen. Ron Johnson, released a political ad this week accusing members who trade stocks of \"taking advantage of insider information to enrich themselves.\"",
    "But as these candidates play politics with stock ban policy, irony lurks: Numerous members of both parties have been guilty of violating the decade-old Stop Trading on Congressional Knowledge Act, or STOCK Act, by failing to routinely report their stock trades.",
    "\"Voters will be informed of Cindy Axne, Tom Malinowski, Kim Schrier, and Sean Patrick Maloney's corrupt violations of federal law whether Congress passes a bill or not,\" said Mike Berg, spokesman for the National Republican Congressional Committee.",
    "Paras Griffin/Getty Images\nGeorgia races sparked interest in running on stock trading limits\nWhether it's Democrats or Republicans, minority parties often take on good government causes — at the expense of their opponents — to fire up voters.",
    "The Hawley fundraising email called it \"bad news for Pelosi, who has gained outrageous wealth during her time in Congress,\" in reference to the millions of dollars in stock trades that her venture-capitalist husband, Paul Pelosi, has made.",
    "\"What the 2020 runoff really showed us is that voters are in tune with the issues that matter,\" added Wartel, who is currently vice president for elections and advocacy at More Than a Vote and managing director at the Arc Initiatives.",
    "This week, Rep. Elaine Luria, a Democrat of Virginia who's running in a competitive district, told Punchbowl News that congressional stock ban proposals are \"bullshit\" — something that will likely open her up to Republican attacks.",
    "It allowed Democrats to achieve the fragile majority they needed to pass a $1.9 trillion coronavirus relief package, an infrastructure law, and confirm most of Biden's nominees with fewer concerns about GOP obstruction.",
    "It also has been fueled in part by \"Conflicted Congress,\" a 5-month investigation published in December by Insider that uncovered numerous financial conflicts of interest and widespread violations of the STOCK Act.",
    "The 2020 US Senate campaigns in Georgia showed that embracing a stock act ban was a winning political message, according to Insider interviews with more than a dozen congressional aides and political strategists.",
    "\"She has grown fantastically wealthy by leveraging insider information to game the markets, and has embraced reform only after viral news cycles observing the corruption she has embodied for decades,\" he said.",
    "Clockwise: Sen. Josh Hawley, a Republican of Missouri; House Speaker Nancy Pelosi, Democrat of California; Rep. Alexandria Ocasio-Cortez, Democrat of New York; and Rep. Tom Malinowski, Democrat of New Jersey.",
    "And campaigns on both sides of the aisle are salivating at the thought of bludgeoning their opponents for violating congressional stock trading laws or failing to support stock-specific government reforms.",
    "Others have held stock in companies that clash with their public responsibilities or stated orthodoxies, or sat on committees that directly oversee the activities of companies in which they hold shares.",
    "US Senate candidate Tom Nelson, a Democrat from Wisconsin, says party leaders in Washington have been hurting congressional hopefuls like him by not fully embracing a ban on lawmakers trading stocks.",
    "These days, the latest push on stock trading comes after Democrats have so far failed to fulfill their own government reform promises to expand voting access and reform campaign finance practices.",
    "Jon Ossoff and Rafael Warnock won their seats in Georgia after they repeatedly skewered their Republican opponents, then-Sen. Kelly Loeffler and David Perdue, over their personal stock portfolios.",
    "read a fundraising email from GOP Sen. Josh Hawley of Missouri after House Speaker Nancy Pelosi announced Wednesday that she'd reverse her defense of congressional stock trading and support a ban.",
    "That Democrat, Sen. Mark Kelly of Arizona, was late reporting a stock liquidation while he was in the process of moving his assets into a blind trust where he'd no longer have control over them.",
    "Reps. Diana Harshbarger of Tennessee, Blake Moore of Utah, Kevin Hern of Oklahoma, and Pat Fallon of Texas were among the Republicans who were late reporting numerous, high-dollar stock trades.",
    "The Democratic Congressional Campaign Committee did not respond to Insider's inquiries about how it might highlight the STOCK Act violations of Republicans or push back against GOP attacks.",
    "\"It's something we have been hitting on doors about and hitting voters with nonstop,\" John Henry Isemann, one of the Republicans running to unseat Malinowski, told Insider in an interview.",
    "Georgia Democratic Senate candidates Jon Ossoff and Raphael Warnock greet each other onstage during the \"Vote GA Blue\" on December 28, 2020, at New Birth Church in Stonecrest, Georgia.",
    "\"Everyone running from the minority knows good government sells,\" said one national GOP strategist who asked not to be named in order to speak candidly about the party's strategy.",
    "Ossoff and Warnock hammered a message that Perdue and Loeffler were more interested in their financial portfolios than in representing the people who had voted them into office.",
    "For example, House Republicans more than a decade ago campaigned against earmarks, which allow Congress to funnel federal dollars to specific projects in individual districts.",
    "After this story published, Naree Ketudat, Malinowski spokeswoman, said the Office of Congressional Ethics had found \"late paperwork filings\" to be his only improper conduct.",
    "\"For me it's been a really salient story every step of this race,\" he said of running on government ethics, adding: \"People are getting rich from being members of Congress.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Isemann wants Republicans to keep pushing for ethics changes even though he acknowledged Republican members of Congress also have been guilty of violating the STOCK Act.",
    "This was the clearest example that they could not,\" said Jonae Wartel, who was the runoff director for the Democratic Party as the Georgia Senate races came to a close.",
    "Congress' top bosses say they agree with a stock trading limit after rank-and-file members squeezed them on the issue and polling shows it's popular with most voters.",
    "Republicans also are angling to attack Reps. Kim Schrier of Washington, Brian Higgins of New York, Mikie Sherrill of New Jersey, and Susie Lee of Nevada in stocks.",
    "Rep. Alexandria Ocasio-Cortez, a Democrat of New York, sent a campaign fundraising email earlier this month asking her supporters to sign onto a stock trading ban.",
    "Republicans plan to keep hammering their opponents on STOCK Act violations regardless of whether Congress sends a stock-ban bill to President Joe Biden's desk.",
    "Candidates running in the 2022 midterms are banking that the very same tactics can be just as potent this round, regardless of which party is firing them off.",
    "Now he's not only urging users on Facebook to support a stock trading ban but has introduced legislation alongside Ossoff to prohibit individual stock trades.",
    "\"Instead of attempting to work within a system we know is broken, let's put in place simpler requirements that eliminate even the suggestion of impropriety.\"",
    "On the opposite end of the political spectrum, Shahid Buttar, a Democratic political activist and one of Pelosi's primary challengers, also pilloried Pelosi.",
    "The GOP has also hit Sean Patrick Maloney of New York, who's almost certain to win re-election, but chairs the Democratic Congressional Campaign Committee.",
    "Win McNamee/Getty Images, Ian Forsyth/Getty Images, Tom Williams/CQ-Roll Call via Getty Images\nThere’s a ton of momentum behind a congressional stock ban.",
    "Financial disclosures showed Loeffler and Perdue dumped millions of dollars in stocks after receiving private briefings about the coronavirus pandemic.",
    "\"The public needs to have trust in their representatives, and our current financial disclosure system is primed for partisan exploitation,\" she said.",
    "Only one Senate Democrat that's up for re-election this year has violated the STOCK Act — as has only one Republican, Sen. Rand Paul of Kentucky.",
    "\"And if it's happening because people see political opportunities and advantages of doing it, that's OK as long as we end up with strong policy.\"",
    "The congressman has placed his assets into a blind trust and supports legislation that would require other lawmakers to do the same, she added.",
    "Johnson himself hasn't violated the STOCK Act, though Insider reported one of his top aides wasn't properly filing mandatory disclosures.",
    "Republicans are campaigning as though they have an edge on the issue even though they haven't been any better about abiding by the law.",
    "Yet the political reality is that several Democratic STOCK Act scofflaws are running for re-election in vulnerable House districts.",
    "Johnson's office said he was wary of legislation that would dissuade people from the private sector from going into public office.",
    "Politico reported at the time that Democratic political action committees spent millions of dollars amplifying the same message.",
    "Both campaigns have paid for stock-ban-themed campaign ads on Facebook, according to Facebook's political advertising database.",
    "The signs that the issue is taking off not just on Capitol Hill but in candidates' home turfs are increasingly widespread.",
    "Now, Democrats also have the chance to confirm a Supreme Court justice without any Republican votes, should they so need.",
    "The National Republican Congressional Committee declared Malinowski will \"pay the price … with his job next November.\"",
    "But all of them are running for re-election in decidedly red districts where Democrats have little chance of winning.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "\"I'm glad this is happening,\" Hedtler-Gaudette said of all the Capitol Hill activity on congressional stock trades.",
    "Left unsaid in these district-level attacks is that Republicans have STOCK Act lawbreakers in their own ranks.",
    "\"This really came down to: Did voters trust the two senators in Washington who were there representing them?",
    "Nelson has also criticized Democratic leaders for what he considers to be their slow embrace of a stock ban.",
    "A push to restrict congressional stock trading has become a hot political weapon in the 2022 midterms.",
    "Several other members of Congress who trade individual stocks have pledged to support a limit or ban.",
    "Some politicians, especially House Republicans, see this policy debate as a potent political weapon.",
    "On Facebook, Nelson's campaign blasted the two-term senator's government position on stock trading.",
    "The Iowa Republican Party has chided Rep. Cindy Axne, a Democrat of Iowa, for her stock trading.",
    "He'll support a ban if elected, he said, because it would help \"change the culture of Congress.",
    "STOCK Act-related attacks, therefore, are unlikely to politically damage these lawmakers.",
    "\"Everyone running from the minority knows good government sells,\" a GOP operative said.",
    "It's providing fodder for press releases, fundraising, and opposition research.",
    "Representatives for Pelosi did not immediately respond to requests for comment.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It has inspired powerful attack ads and even spawned Trumpian nicknames.",
    "\"Very few people have clean hands on this stuff,\" Hedtler-Gaudette said.",
    "A battle over stock trading in Congress is consuming the 2022 midterms.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "This story has been updated to include Rep. Tom Malinowski's response.",
    "The messaging did more than deliver the seats to Ossoff and Warnock.",
    "Isemann called Malinowski the \"poster boy\" for the issue.",
    "That's a simple sentence for people to understand.\"",
    "\"They want ethical leaders that are transparent.",
    "Stay up to date with what you want to know.",
    "Clockwise: Tom Williams-Pool/Getty Images.",
    "Sign up for notifications from Insider!",
    "They want leaders to put them first.\"",
    "They include Malinowski and Axne.",
    "Loading Something is loading.",
    "Democratic Sens.",
    "\"Pelosi folds!\""
  ]
}