{
  "id": 2532,
  "mediaId": 2745,
  "date": "2022-02-10",
  "headline": "In campaign ad, GOP Senate candidate shoots gun at actors playing Biden, Pelosi and Sen. Mark Kelly",
  "image": "https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png",
  "link": "https://www.washingtonpost.com/politics/2022/02/10/campaign-ad-senate-candidate-shoots-gun-actors-playing-biden-pelosi-sen-mark-kelly-whose-wife-gabby-giffords-was-injured-arizona-rampage/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In 2016, the union endorsed a presidential candidate for the first time, backing Trump and praising him as someone who “doesn’t fear the media, doesn’t embrace political correctness and doesn’t need the money.” Judd has also been a sought-after surrogate for Republican campaigns, appearing in ads for Texas Gov.",
    "A Republican businessman seeking his party’s nomination to face Sen. Mark Kelly (D-Ariz.) in the fall has released a new Western-style TV ad in which the candidate, dressed as a sheriff, fires a gun at actors portraying Kelly, President Biden and House Speaker Nancy Pelosi (D-Calif.).",
    "They approach a dusty Old West town, where one onlooker calls them “the D.C. gang” another yells at them, “We’re tired of being pushed around!”\n“The good people of Arizona have had enough of you,” Lamon tells the actors playing Kelly, Biden and Pelosi in the ad.",
    "Gang drawing on Lamon and he merely shoots the weapons out of their hands.”\n“Unlike Kelly, Jim Lamon will shoot straight with Arizonans and take the fight to Biden — and he d--- sure won’t let the left bully him into backing down,” the spokesperson said.",
    "“I do not believe the people of Arizona will be upset by the commercial and will accept it for what it was meant to be … satire based upon Arizona’s history in which no one was depicted as being harmed,” Judd said.",
    "The Lamon campaign is spending “multiples of six figures” on the aid, which it said will air in Tucson during the Super Bowl and in Phoenix and statewide on cable and online thereafter.",
    "In November, Rep. Paul A. Gosar (R-Ariz.) shared an altered, animated video depicting him killing Rep. Alexandria Ocasio-Cortez (D-N.Y.) and swinging two swords at Biden.",
    "Kelly is the husband of former congresswoman Gabrielle Giffords (D-Ariz.), who was shot in the head while greeting constituents outside a Tucson supermarket in 2011.",
    "In the Lamon ad, the trio of Democrats is shown wearing cowboy hats and boots, toting guns and sporting bandannas on the lower half of their faces.",
    "A Lamon campaign spokesperson did not directly address criticism that the ad shows the candidate shooting at Giffords’s husband.",
    "pic.twitter.com/mJTbFuS0du\nThe ad is the latest video by a Republican raising the specter of violence against Democrats.",
    "Arizona has had enough of the DC Gang’s open borders, high gas prices, and shifty politicians pushing us around.",
    "Then Lamon draws his pistol and quickly shoots the weapons out of their hands, prompting the trio to run away.",
    "Judd has led the National Border Patrol Council since 2013, involving it more directly in electoral politics.",
    "Greg Abbott and for George P. Bush, a Texas railroad commissioner running for attorney general.",
    "The ad also includes an appearance by Brandon Judd, a longtime Border Patrol agent.",
    "@CaptMarkKelly @JoeBiden @TeamPelosi, it’s time for a good old-fashioned showdown.",
    "Six people were killed in the shooting rampage and many others were injured.",
    "The spokesperson, who did not provide a name, said the ad “shows the D.C.",
    "“It’s time for a showdown.”\nThe Democrats draw their weapons.",
    "The House later voted to censure Gosar over the video.",
    "Check out our new Super Bowl ad, The Showdown, here ??"
  ]
}