{
  "id": 2561,
  "mediaId": 2671,
  "date": "2022-02-10",
  "headline": "AZ Senate candidate releases Super Bowl campaign ad and liberals are losing their minds over it [VIDEO]",
  "image": "",
  "link": "https://therightscoop.com/az-senate-candidate-releases-super-bowl-campaign-ad-and-liberals-are-losing-their-minds-over-it-video/",
  "mediaOutlet": "Right Scoop",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Right Scoop",
  "authorUrl": "https://therightscoop.com/author/therightscoop/",
  "termIds": [
    0
  ],
  "sentences": [
    "But according to The Hill, liberals (and at least one Republican) are racing to condemn it:\nArizona Senate candidate Jim Lamon’s campaign released a Super Bowl ad on Thursday depicting him in armed “showdown” with Democratic leaders including incumbent Arizona Sen. Mark Kelly (D).",
    "Her husband’s Republican US Senate opponent, [Jim Lamon], just put out an ad in which he shoots Mark Kelly and other Democrat leaders,” tweeted Shannon Watts, founder of the gun control group Moms Demand Action.",
    "The ad immediately prompted backlash online, given that Kelly’s wife, former Rep. Gabby Giffords (D-Ariz.) was shot during an assassination attempt in 2011.",
    "Arizona’s Jim Lamon, who is running for the Senate, just released a new campaign ad for the Super Bowl and liberals are already losing their minds over it.",
    "Giffords suffered a severe brain injury as a result and has since become one of the most prominent gun-control activists in the country.",
    "The former executive director of the Arizona Republican Party, Brian Murray, called Lamon’s ad his “most pathetic ad” yet.",
    "“The good people of Arizona have had enough of you, it’s time for a showdown,” Lamon, who plays himself in the ad, says.",
    "I don’t know anything about Lamon, but I think it’s a fun ad and there’s nothing controversial about it in my opinion.",
    "Lamon doesn’t shoot ‘Biden’ or ‘Pelosi’ or ‘Kelly’, he simply shoots their weapons out of their hands in the ad.",
    "The 30-second ad features actors depicting Kelly, President Biden, and Speaker Nancy Pelosi (D-Calif.).",
    "The Democratic figures then draw their weapons and Lamon shoots at them, prompting them to run away.",
    "“DISGUSTING: Former Rep. Gabby Giffords was shot and seriously wounded 10 years ago.",
    "RT if you’re choosing #VotesOverViolence this Fall,” Swalwell said in his own tweet.",
    "It’s an old west style showdown and these idiots criticizing it need to get a life.",
    "He’s perfect for that, and that ain’t no bull!” Murray said in a tweet.",
    "“I think when he loses he should start producing used car commercials.",
    "So they’ve gone all in on using violence as a path to power.",
    "Rep. Eric Swalwell (D-Calif.) also reacted to the tweet.",
    "This has nothing to do with Gabby Giffords being shot.",
    "“Republicans don’t have any ideas to help you.",
    "It’s just a fun political metaphor.",
    "That’s my opinion, what’s yours?",
    "Watch:\nPersonally I love the ad.",
    "And they can’t win elections."
  ]
}