{
  "id": 2578,
  "mediaId": 2632,
  "date": "2022-02-10",
  "headline": "Crypto, China, Stocks and More: Democrats and Republicans Are Actually Working Together on Some Crucial Issues",
  "image": "https://media.nbcbayarea.com/2021/06/106895771-16234157702021-06-08t223902z_1659160172_rc2mwn9isimv_rtrmadp_0_usa-infrastructure-biden.jpeg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.nbcbayarea.com/news/business/money-report/crypto-china-stocks-and-more-democrats-and-republicans-are-actually-working-together-on-some-crucial-issues/2807447/",
  "mediaOutlet": "nbcbayarea.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thomas Franck",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Democrats, who hold narrow majorities in Congress, face an uphill battle this year given President Joe Biden's flagging polling numbers, the historical tendency for the president's party to lose seats in a first-term midterm campaign and the potential for alienating their liberal base by making concessions to Republicans.",
    "In three separate areas — a China-U.S. business bill, regulations on cryptocurrency and revisions to the Electoral Count Act of 1887 — Democrats and Republicans could find themselves championing similar legislation as they hit the campaign trail for the midterm elections this year.",
    "\"When you're elected, you're here to serve the people, not the elite, and [a stock trading ban], I think, is a step forward, an important step forward, to restore the faith and trust of the American people in this institution,\" Daines told CNBC on Wednesday.",
    "Spending, spending, spending\nElsewhere, geopolitical tensions between the U.S. and Russia have galvanized members of both parties to consider whether Congress should spend more on the American military as part of the next attempt to fund a government budget.",
    "The industry and regulators have asked Congress to offer guidance on which assets belong to varied asset classes, protections for retail investors and clarity on the jurisdiction of the SEC, the Commodity Futures Trading Commission and the Federal Reserve.",
    "The ex-president has a habit of lashing out at members of the GOP whom he deems disloyal, such as former ally and ex-Vice President Mike Pence, Senate Minority Leader Mitch McConnell of Kentucky and Republicans who backed the infrastructure bill.",
    "Biden, though, has traded his predecessor's openly bellicose language and tit-for-tat tariff exchanges for a more subtle strategy — one that seeks to check Beijing through global alliances and by reducing U.S. reliance on Chinese commerce.",
    "Still, the versions share similar core ambitions like enhancing domestic manufacturing and reducing reliance on foreign sources by reinforcing the U.S. supply chain, Morgan Stanley policy strategist Michael Zezas wrote in early February.",
    "\"There is widespread agreement that with changing geopolitical forces the U.S. needs to adjust its military spending and that will require decisions beyond the static spending that is inherent in a continuing resolution.\"",
    "Federal health officials briefed lawmakers on the virus and its potential impact before that intelligence was widely distributed to the public, raising questions whether legislators' subsequent stock trades were tainted.",
    "It's likely that progressives like Warren will want to make their own changes to the Lummis bill given well-documented disagreements about how much regulation the industry needs and how much risk it poses to investors.",
    "Rep. Patrick McHenry, a North Carolina Republican, stressed the bipartisan desire for more legislation over digital assets on Tuesday during a hearing to assess the Biden administration's recent report on stablecoins.",
    "The two sides also managed to reach a compromise in November on a $1 trillion infrastructure bill, which will pour hundreds of billions into roads, bridges and broadband across the country over the next several years.",
    "While the speaker herself does not typically disclose equities trading, her husband Paul Pelosi is an investment manager and frequently reports transactions worth hundreds of thousands — if not millions — of dollars.",
    "Their proposal would clarify that the vice president has no power to reject a state's electors, give states additional time to complete legitimate recounts and raise the threshold for Congress to consider objections.",
    "Specifically, the former president claims that then-Vice President Mike Pence could have acted unilaterally Jan. 6, 2021, as the presiding officer of the joint session of Congress to reject states' electoral votes.",
    "Democrats and Republicans are locked in talks about overall spending levels for the current fiscal year and are expected to pass a short-term stopgap bill to thwart a partial government shutdown later this month.",
    "Competition with China\nIf there's any subject that unifies the most conservative Republican and the most liberal Democrat, it's a deep skepticism of China and a motivation to ensure U.S. economic competitiveness.",
    "But the speaker did say she would like to see more aggressive fines for violating the STOCK Act, a 2012 statue that prohibits members of Congress from trading based on nonpublic information for private profit.",
    "House Speaker Nancy Pelosi, a Democrat, agrees with fellow Californian Rep. Kevin McCarthy, the top Republican in the House, in wondering whether stock-trading rules for members of Congress could be tightened.",
    "The majority had hoped to establish national standards for ballot access as a way to undermine new voting rules Republican state legislatures have imposed in the wake of the 2020 election and Trump's defeat.",
    "That bill was the product of almost every Senate committee with input from a range of Republicans and Democrats, and Majority Leader Chuck Schumer, D-N.Y., took the lead in guiding it through that chamber.",
    "One big bipartisan effort that could reach Biden's desk in 2022 is the pending legislation to modernize U.S. semiconductor manufacturing and otherwise bolster competitiveness with the communist superpower.",
    "While the details of the draft are not yet available, her legislation is expected to include input from a range of government agencies and tackle many currently unanswered questions faced by the industry.",
    "Read more of CNBC's politics coverage:\nMeanwhile, several senators are working on versions of a stock-trading ban, including a new effort from Warren, D-Mass., and Montana Republican Sen. Steve Daines.",
    "A bid to revise the Electoral Count Act of 1887 in the aftermath of the historic election two years ago has lawmakers on both sides of the aisle looking to tighten the rules around future contests.",
    "McCarthy, the House minority leader, and other top Republican lawmakers have in recent weeks discussed with donors ways they could campaign on the issue of limiting lawmakers' equity ownership.",
    "\"On Jan. 6 [2021], I was shocked to learn that it only took ONE Senator and ONE House member to object to a state's results,\" wrote Tom Block, a policy strategist at Fundstrat Global Advisors.",
    "\"As a China hawk and a fiscal hawk, I would have liked for this bill to take a more focused and aggressive approach to the China threat – but this is a strong start,\" he said in a statement.",
    "That measure, however, cleared the House almost entirely along party lines after the chamber's Democrats sought to use proposed changes to trade policy to add protections for U.S. workers.",
    "\"Conditions have long been conducive for enactment of a bill of this kind given the entrenched, bipartisan skepticism of the US-China relationship among voters and policymakers,\" he wrote.",
    "Washington and the broader American electorate are sharply divided along partisan lines, but there are still some places where Republicans and Democrats in Congress share common ground.",
    "For example, Senate Republicans may insist the final legislation add bolder language to confront Beijing and strip out proposed contributions to the United Nation's Green Climate Fund.",
    "Better guidelines, codified rules and regulations could at the very least work to protect investors from the price volatility that has thus far dogged many digital assets.",
    "Pelosi's support for tighter restrictions on congressional securities trading amounts to a pivot for the House speaker, who has long viewed stricter rules as unnecessary.",
    "Money Report\nOn the other side of the aisle, Republicans striking deals with Democrats could mean trouble for them in the primaries with former President Donald Trump.",
    "Democrats and Republicans are both eager to develop a framework in which the nation's many crypto investors, issuers, miners and exchanges can market digital assets.",
    "Democrats and Republicans — many of whom voted against the infrastructure legislation — have touted funding for local transportation projects stemming from the law.",
    "The market is like the \"Wild West,\" according to Securities and Exchange Commission Chair Gary Gensler, who has has repeatedly asked lawmakers for legislation.",
    "Pence, who last week disavowed Trump's claim, said there is \"no idea more un-American than the notion that any one person could choose the American president.\"",
    "With nearly a quarter of American adults now invested in crypto, we must move quickly to put in place a framework that clearly defines the rules of the road.\"",
    "All signs point to a major piece of legislation from Lummis, a Republican freshman senator from Wyoming and a crypto-industry supporter, in the coming weeks.",
    "That may be part of the reason the Biden administration has retained many of the hardline economic and national security measures first imposed under Trump.",
    "\"The biggest issue where a bipartisan agreement will need to be reached is funding a government budget for the remainder of fiscal year 2022,\" Block wrote.",
    "The House took months to review and pass its own version of the bill, but finally did so on Friday in a $350 billion bill titled the America Competes Act.",
    "Jon Ossoff of Georgia and Mark Kelly of Arizona, would require incoming members of Congress to place their stock portfolios in a traditional blind trust.",
    "In an effort to head off similar battles in the future, a bipartisan group of at least 15 senators have begun work on shoring up the language in the law.",
    "The Pentagon is urging Congress to reach a deal that would allow it greater flexibility and ability to respond to changing threats across the globe.",
    "Stock-trading clampdown\nA growing number of Democrats and Republicans are moving toward legislation to bar members of Congress from trading stocks.",
    "Sen. Ben Sasse, R-Neb., cheered the legislation's goals when the bill cleared and said he'd have liked an even-more-pointed piece of legislation.",
    "The White House has thus far called for a 15.9% increase in nondefense spending for fiscal 2022, but only a 1.7% bump to the armed forces budget.",
    "Even bitcoin, one of the world's most popular digital assets, isn't immune: Its value has declined by more than 33% over the last three months.",
    "\"The Chinese Communist Party is working overtime on cyber, AI, and machine learning so that they can become the world's preeminent superpower.\"",
    "Democrats and Republicans could find themselves championing similar legislation as they hit the campaign trail for the midterm elections.",
    "Senate Democrats failed in January to pass a voting rights bill to combat a wave of new ballot restrictions in states across the country.",
    "Several lawmakers, Republican and Democrat, came under fire in 2020 for transactions during the early stages of the Covid-19 pandemic.",
    "And, like all things in Washington, whether the two parties can unite behind any of these initiatives will depend on minute details.",
    "But Democrats and Republicans in Congress have found some common ground on crypto, China, lawmakers' stock trading and other issues.",
    "The House bill included language to help remedy racial disparities and inequalities; the Senate draft did not include this language.",
    "Small differences in the two bills have forced lawmakers from each chamber to form a conference committee to reconcile the versions.",
    "Pence refused to do that, and a mob of Trump supporters invaded the Capitol, delaying Congress's certification of Biden's victory.",
    "Trump and his allies tried to use the vague language in the law to overturn the results of the election and deny Biden's victory.",
    "The GOP has ridiculed that disparity in recent weeks as geopolitical tensions worsen between the U.S. and Russia over Ukraine.",
    "\"Plus, there is the confusion sowed by former President Trump on the role of the VP in counting electoral votes,\" Block added.",
    "Pelosi declined to say during her weekly press conference Wednesday morning whether she supports tighter spousal regulations.",
    "Democrats risk alienating their liberal base, while Republicans could run afoul of former President Trump and his supporters.",
    "Democratic Sen. Elizabeth Warren and Republican Sen. Cynthia Lummis both think Congress needs to step up on cryptocurrency.",
    "\"The two sides are talking about an omnibus spending bill with new funding split between defense and nondefense,\" he added.",
    "Americans' views on China are as frigid as they've ever been, according to survey results released by Gallup last year.",
    "Still, such a massive piece of legislation is likely to be debuted with the support of at least one moderate Democrat.",
    "Pelosi and Democratic leaders recently OK'd a plan to draft legislation at the Committee on House Administration.",
    "And almost all lawmakers in Congress think something ought to be done to bolster U.S. competitiveness with China.",
    "Blockchain buddies\nAnother potential area for bipartisan policy partnership is on cryptocurrency regulation.",
    "One of the most divisive issues facing Congress is whether — or how — to change the nation's voting laws.",
    "The push to limit lawmakers' stock trading is getting a boost from Democratic bigwigs in the House.",
    "Its polling found that some 79% of Americans view Beijing as \"very\" or \"mostly\" unfavorable.",
    "Whether Pelosi supports greater limitations for spousal trading remains an open question.",
    "\"There appears to be broad bipartisan support for taking action to update the 1887 Act.\"",
    "\"I think this may be the biggest bipartisan legislative accomplishment/need this year.\"",
    "But Zezas remains optimistic that lawmakers will ultimately come to a compromise.",
    "Many of the bills proposed so far, including one backed by Democratic Sens.",
    "Currently, a valid objection only requires one lawmaker from each chamber.",
    "And if that's what the members want to do, then that's what we will do.\"",
    "The Senate first passed a $250 billion version of the measure — the U.S.",
    "\"We have to tighten the fines on those who violate the STOCK Act.",
    "Innovation and Competition Act — in June on a bipartisan basis.",
    "\"Currently, there is no federal law to address digital assets.",
    "It's obviously not sufficient to deter behavior,\" she said.",
    "But such bipartisanship carries risks for both sides.",
    "— CNBC's Michael Bloom contributed to this article.",
    "But bipartisanship carries dangers for both sides.",
    "We agree on that,\" he said in prepared remarks.",
    "Voters and Washington are bitterly divided.",
    "But one area of bipartisanship remains.",
    "\"It's a confidence issue.",
    "\"We need legislation.",
    "Also on CNBC"
  ]
}