{
  "id": 2586,
  "mediaId": 2589,
  "date": "2022-02-10",
  "headline": "How the GOP got out ahead of inflation as a potent political issue (and why Dems are panicking)",
  "image": "https://media.townhall.com/townhall/reu/o/2021/344/8da57add-330b-485b-9da3-e52d90a30347-1110x740.jpg",
  "link": "https://hotair.com/john-s-2/2022/02/10/how-the-gop-got-out-ahead-of-inflation-as-a-potent-political-issue-and-why-dems-are-panicking-n447853",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Sexton",
  "authorUrl": "https://hotair.com/author/john-s-2",
  "termIds": [
    0
  ],
  "sentences": [
    "“Although price pressures are expected to ease as the year progresses, inflation will remain above the Fed’s 2% target for some time to come.”\nBut if Republicans were ahead of the curve on this, Democrats were behind it and are now very worried about what it might mean for their collective futures:\nOne Democrat who is not dismissive is William Galston, a senior fellow at the Brookings Institution who served as a domestic policy adviser to Bill Clinton.",
    "ABC News published a story this afternoon about when it might end:\nNow, many economists expect consumer inflation to remain elevated well into this year, with demand outstripping supplies in numerous areas of the economy.",
    "One thing that electing Republicans will do is prevent Democrats from passing any more multi-trillion dollar spending bills which seem likely to only make the current situation worse.",
    "As Ed pointed out this morning, inflation has now hit a 40-year high and interest rates will be going up several times this year, probably starting next month.",
    "“Inflation remains the single largest near-term challenge to the economy,” said Jim Baird, chief investment officer at Plante Moran Financial Advisors.",
    "“It seized the center of domestic politics and wouldn’t let go for years.”…\nThere are signs that some Democrats are beginning to panic.",
    "Back when economists were still promising inflation would be transitory, Stefanik thought this could become a big issue for the GOP.",
    "But an economist at the University of Maryland tells the Times that likely won’t make much difference even if its passed.",
    "“It was vividly etched in my memory,” Galston said, sounding over the phone as if he was wincing while recalling it all.",
    "“And I’ll tell you,” she added, “babies use a lot of diapers.”\nSince then, things have obviously changed quite a bit.",
    "The story credits Rep. Elise Stefanik for noticing last year that prices were creeping up at the grocery store.",
    "At the time, economists were still debating whether Biden’s rescue plan would set off an inflationary spiral.",
    "The White House and the Federal Reserve pushed back, insisting that inflation was a “transitory” phenomenon.",
    "The NY Times just published a story about how Republicans got out ahead of Democrats on the inflation issue.",
    "3 Republican in the House, began to notice that the prices of fruit, bacon, milk and eggs were creeping up.",
    "The savings from not charging people the 18.4 cents per gallon just wouldn’t add up to much over a year.",
    "Early last year, Representative Elise Stefanik of New York, who was then campaigning to become the No.",
    "That’s going to be a longer and likely painful process just as it was during the early 1980s.",
    "Of course electing Republicans to Congress won’t magically cause inflation to go away.",
    "Now 76, he lived through a time of high inflation in the late 1970s and early 1980s.",
    "“I’m the grocery shopper in my family, so I go by my gut,” Stefanik told us.",
    "As a new mother, she also saw diapers and formula growing more expensive.",
    "One sign of panic the story alludes to is a recent proposal by Sens.",
    "Mark Kelly and Maggie Hassan to suspend the federal gas tax.",
    "No one thinks this is transitory anymore either.",
    "But Stefanik had a hunch."
  ]
}