{
  "id": 2622,
  "mediaId": 2745,
  "date": "2022-02-10",
  "headline": "The Trailer: First, do no harm: The drug policy fight that explains the midterms",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MYT4NT2O6FHT3NSFJBCKLKFLHE.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/02/10/trailer-first-do-no-harm-drug-policy-fight-that-explains-midterms/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Do we want to send more liberal Democrats who will support Nancy Pelosi’s anti-gun, anti-life, anti-election integrity, pro-socialist radical agenda, or do we want to send more pro-life Republicans, pro-gun Republicans, Republicans who will support Donald J. Trump’s ‘make America great again’ agenda?”\nWhile not every member of the caucus has voted against the GOP leadership’s maps, their filibuster has frozen the state Senate, creating some risk that the legislature will run out of time and a court will end up drawing new maps.",
    "Two months later, the feds are scrambling to promise that “no federal funding” will be used for crack pipes or other pipes used to smoke drugs, after a conservative news site asked whether “safe smoking kits” would be eligible for grants — and, learning that they were, suggested that the government would be funding “the distribution of crack pipes to drug addicts.”\nSafe smoking kits typically include a rubber mouthpiece to prevent cuts and burns, brass screens to filter contaminants and disinfectant wipes, not pipes.",
    "Their response to most policy backlashes is shaped by what the liberal political analyst Ruy Teixeira calls the “Fox News Fallacy”: “The idea that if Fox News … criticizes the Democrats for X then there must be absolutely nothing to X and the job of Democrats is to assert that loudly and often.” The Biden administration wasn't setting up a crack pipe distribution program — but it never occurred to Democrats that they could even be accused of it.",
    "“While people in Washington fight each other,” Cuellar asks, “who will fight for us?” Cuellar's been in Congress since 2005, but that line is meant to portray his left-wing primary challengers as the sort of ideologues really ruining everything in D.C.\n“Do you approve of the way Joe Biden is handling his job as president?” (CNN/SSRS, 1257 adults)\nCNN’s Biden poll numbers had consistently been higher than their competitors — but no longer.",
    "At 5 a.m. on Monday, as the grant application period closed, the Washington Free Beacon, a conservative website, went live with a report on how the Biden administration was “set to fund the distribution of crack pipes to drug addicts as part of its plan to advance ‘racial equity.’”\nAn HHS spokesman had confirmed that the grants could fund smoking kits; the statement never mentioned pipes, and such kits typically do not include them.",
    "No group is more intense in that feeling than Americans over 65 — just 27 percent of them say their test of a good economy is something other than “prices.” Democrats and other supporters of the president are the most likely to focus on the unemployment rate, now 4 percent, which the White House has increasingly cited in statements, news conferences and charts designed to be pilloried on Twitter.",
    "“And they were endorsed this week by a bipartisan commission co-chaired by Senator Tom Cotton that examines steps we must take to address the devastating toll of overdoses.”\nCotton spokeswoman Caroline Tabler pointed out that the bipartisan opioid commission had recommended “fentanyl test strips and the use of Narcan by first responders,” not anything else that Psaki was talking about.",
    "The American Rescue Plan had just been signed into law, which meant that $30 million in grants would be available for “harm reduction” programs — policies designed to reduce the number of overdose deaths, and the spread of infectious diseases, by educating and counseling those with addictions and distributing overdose-reversal medications, fentanyl test strips and clean syringes.",
    "“Also, by the time we signed the employment contract, I had already abandoned the idea of running for reasons that had nothing to do with Rep. Newman’s job offer, and I informed her of that fact.”\n“During our policy conversations, Rep. Newman recognized that it was important to work to end Israel's egregious human rights violations against the Palestinians,” Chehade continued.",
    "“Which do you consider the best measure of how the national economy is doing?” (YouGov, 1500 adults)\nThe stock market index: 5%\nUnemployment rate/job reports: 18%\nPrice of goods/services: 51%\nPersonal finances: 12%\nHere's a useful and relatively new way of asking voters about inflation, which for the past six months has surpassed every other economic issue on voters' minds.",
    "“Not only did she sell us out, but she relied on President Trump to get to D.C. and turned her back on him the first opportunity she had.”\nArrington first drew Trump's attention when she challenged then-Rep. Mark Sanford (R) in a 2018 primary; Trump, who had been criticized by Sanford, endorsed Arrington in the race's final hours, when she was charging ahead.",
    "“During a violent crime surge nationwide, and city centers grappling with addicts camping on the street, how ‘free taxpayer-funded crack pipes’ made it past even one person at [the Department of Health and Human Services] is mind-boggling,” said Will Ritter, a Republican ad-maker who helped elect Virginia Gov.",
    "“I worked in seven different states across the country to get him elected.” Trump had backed away from Mace after she condemned his role in the Jan. 6 insurrection, and voted to hold Stephen K. Bannon in contempt of Congress as the ex-Trump adviser stonewalled the investigation into his role that day.",
    "Republicans had struggled to line up the votes at first, but they got them — and they crossed the override threshold when state Rep. Michael Houser (R), who had been sidelined by illness and is known to have refused to get vaccinated against the coronavirus, showed up for the vote with an oxygen tank.",
    "By Thursday morning, the White House and HHS were on record preventing federal funding for “crack pipes.” That did not end the story, which had taken a new shape as Republicans called for a ban on “crack pipes” ever being considered in government grants — whether or not that was ever going to happen.",
    "On Wednesday, HHS and the Office of National Drug Control Policy announced that “no federal funding will be used directly or through subsequent reimbursement of grantees to put pipes in safe smoking kits,” a clear position that White House press secretary Jen Psaki took into the briefing room.",
    "It did not get the same pickup outside conservative media, which added to the backlash, especially after the fact-checking website Snopes judged one version of the story — “Did Biden Admin ‘Fund Crack Pipes’ To ‘Advance Racial Equity’?” — to be false, before the HHS had clarified the policy.",
    "Dozens of candidates and members of Congress denounced federal funds potentially being used for safe smoking kits and other conservative news outlets aggregated the story, often emphasizing the “racial equity” component to ask whether the whole process, from intent to execution, was racist.",
    "It helps to restore hope and lets them know that we're here until they're ready to make changes.”\nThe events leading up to the “crack pipe” fury are easily repeatable, given the Biden administration's policy ideas, and the ways that Republicans and conservatives are approaching them.",
    "That's the setup for more than a dozen hits on Jones, from a rape allegation from the early 2000s to the fact that Jones's career has mostly been in DeKalb County, a deeply Democratic and majority-Black part of the Atlanta area that, to some Republicans, embodies bad-idea liberalism.",
    "Ivey, who's just two years younger than the president but has embraced her “Governor Meemaw” image while campaigning in Alabama, simply tells the viewer that she was taught not to say anything about people if she couldn't say something nice, then pauses after mentioning Joe Biden.",
    "“That work is completely separate from my work on my own campaign, and I do both simultaneously.”\nNewman’s opponents, including the Democratic Majority for Israel, had questioned whether the congresswoman’s advocacy for Palestinians was a result, entirely, of Chehade's hiring.",
    "Conservative activists trying to root racial politics out of school curriculums, government programs and corporate trainings search for mentions of “equity” or “DEI” (“diversity, equity and inclusion”) to make them infamous — and, where possible, eliminate them.",
    "“For example, I drafted policy papers on Israel/Palestine and Kashmir, two interlinked issues that her constituents and progressives care about because of the ongoing apartheid in Palestine and the human rights violations in both of those areas,” wrote Chehade.",
    "While running for Congress in the new 3rd Congressional District, Chehade continues to “advise Marie Newman’s campaign on foreign policy, an important topic for her district’s constituents, and draft policy papers on various foreign policy matters,” he wrote.",
    "Their opponents aren’t arguing for a boost to Democrats, warning instead that a too-ambitious map would risk Democrats flipping back a swing seat, and perhaps the Democratic-trending 2nd Congressional District outside St. Louis, before the end of the decade.",
    "In the 30-second version, Lamon shoots a gun out of Kelly's hand, which got an immediate reaction from the Democratic senator's allies — Lamon's political career began when Kelly's wife, former congresswoman Gabrielle Giffords, was shot and badly wounded.",
    "“It is pure insanity to think the federal government would fund crack pipe distribution.” And on Thursday, Sen. Charles E. Grassley (R-Iowa) announced that he would co-sponsor Rubio's bill — the Cutting off Rampant Access to Crack Kits Act, or CRACK.",
    "Accepting Jesus Christ as your personal savior does,” Republican state Sen. Sandy Crawford told the Missouri Independent this week, responding to an angry email that warned she would go to hell if she didn’t reduce Democrats from two seats to one.",
    "The cities most supportive of providing needles and other equipment were overwhelmingly Democratic, with momentum shifting from simply allowing supplies to be distributed, to New York City authorizing two supervised injection sites in November.",
    "Instead, the eight-member conservative caucus, a faction of the 24-member GOP supermajority, wanted a map that would replace the traditionally Democratic 5th Congressional District in Kansas City with a swing seat that Republicans could win.",
    "“Imagine thinking taxpayer-funded crack pipes is aiding ‘racial equity.’” Some Republicans characterized the entire program as $30 million for crack pipe distribution; some asked if Biden had a personal interest in distributing crack pipes.",
    "Chehade, who considered running in the same seat as Newman two years ago, was hired after writing a foreign policy memo laying out a low six-figure salary and some terms; Newman has denied that he was hired to remove a political obstacle.",
    "“Will Hunter Biden be running this program or will he just take his free crack pipe and head home?” asked Mike Collins, a Republican running for Congress in Georgia, referring to the well-publicized drug addiction of the president's son.",
    "On Tuesday, we wrote about a complicated scandal in Illinois’s 6th Congressional District, where Rep. Marie Newman (D-Ill.) is the subject of a House ethics investigation into her hiring of Iymen Chehade as a foreign policy adviser.",
    "“This position is consistent with the growing recognition of progressives and Democratic voters that our government should work to end apartheid, human rights violations, and settler colonialism in Palestine/Israel.”\nSouth Carolina.",
    "“It’s not a change in policy.” But there are numerous policies that fit under the “harm reduction” umbrella, eligible for grants, and when Psaki pointed out that even Republicans supported some of this, Republicans pushed back.",
    "Every Republican criticism, from the potential distribution of “smoking kits” to a requirement that grant applicants explain how they could advance racial “equity,” was based on something in the government's own announcements.",
    "“I’m going to change you like a remix, then I’ll raise you like a phoenix.”\nHoskins and the rest of the Senate’s conservative caucus were in the beginning stages of a filibuster that, as of this writing, has not ended yet.",
    "“Bless his heart,” Ivey says in a stinger, deploying a Southern expression that does not really mean “bless his heart.”\nTexans for Henry Cuellar, “Most Bipartisan.” Most candidates in party primaries run toward their base.",
    "Michael Collins, “Real Vernon Jones.” With his gubernatorial campaign going nowhere, former state legislator Vernon Jones, a Democrat-turned-Republican, switched parties to run for Georgia's 10th Congressional District.",
    "A battle over proposed supervised injection sites, between the city of Philadelphia and Trump-appointed U.S. Attorney William M. McSwain, unfolded in a crucial presidential swing state during the presidential election.",
    "Four years after losing a tight race in South Carolina's 1st Congressional District, former state representative Katie Arrington (R) announced a primary challenge to Rep. Nancy Mace (R-S.C.), who won the seat in 2020.",
    "In December, Biden was still above water on the question of “handling the coronavirus pandemic.” His rating on that issue has fallen by 9 points, with 54 percent of adults here disapproving of the pandemic response.",
    "Arrington went on to lose to Democrat Joe Cunningham, now a candidate for governor; Mace, who flipped the seat back, released a video Thursday, standing in front of Trump Tower and praising the ex-president.",
    "is doing the opposite in this spot, running right before the start of early voting, mentioning his support for “lowering health-care costs” alongside his support for tax cuts and law enforcement funding.",
    "Yet that's not a majority position, even among them, with fewer than 30 percent of Biden voters, Democrats and self-identified liberals saying the economy's health is best measured by unemployment rates.",
    "… four days until early voting starts in Texas primaries\n… five days until school board recall elections in San Francisco\n… 19 days until the first 2022 primaries\n… 271 days until the midterm elections",
    "We've been fighting for federal support for 30 years.”\nOn Dec. 8, the federal Substance Abuse and Mental Health Services Administration (SAMHSA) opened the grant program and published its conditions.",
    "This survey, conducted when the standoff between Russia and Ukraine was dominating the news, finds the lowest support for Biden of his presidency so far, with negative ratings on every tested issue.",
    "“I write ads all day, and I would struggle to invent something that would say more clearly that Democrats don’t understand the frustration of voters.”\nHarm reduction activists were used to this.",
    "Corman, who's hired ad-makers who worked for Youngkin, appears in a zip-up vest, then — to the sound of a record skip — introduces his daughter, who wanted him to avoid a generic campaign ad.",
    "“HHS put out the statement because there was inaccurate information out there, and we wanted to provide clarification on the allowable uses for the HHS Harm Reduction program,” said Psaki.",
    "In this edition: Dispatches from the crack pipe wars, the intense gerrymandering battles for Kansas City and a follow-up on the candidate/adviser at the center of an ethics investigation.",
    "The president's Inauguration Day order on “advancing racial equity” applied to every grant application, a fact that was uncontroversial among Democrats, but scandalous among Republicans.",
    "Republicans have a once-in-a-decade shot to squeeze Democrats out of a House seat, and Democrats in states they control — like Illinois, right next door — have done so unapologetically.",
    "“I am glad the Biden administration acknowledges sending crack pipes to our nation’s addicts is a bad idea,” Sen. Marco Rubio (R-Fla.) said in a statement after Psaki's clarification.",
    "“Hey, young blood, doesn’t it feel like our time is running out?” the Republican legislator said Monday, holding the Senate floor in Jefferson City by quoting the band Fall Out Boy.",
    "“I was one of his earliest supporters,” said Mace, who recorded a radio ad for Trump in early 2016, when most South Carolina Republicans had endorsed other presidential candidates.",
    "The Trump administration sued over it, but neither Trump nor Biden talked about it on the trail — and a year into Biden's presidency, only New York has opened safe injection sites.",
    "In 1998, when the Clinton administration was considering whether to reverse that policy, its own drug czar came out against it, smothering the idea for the rest of his presidency.",
    "Biden's opponents start with the premise that Democrats are willing to let cities, and civilization, fall apart, and that “racial equity” initiatives are paternalistic racism.",
    "Jim Lamon for Senate, “Super Bowl Ad.” Lamon's string of comedic ads continues with a spot the Arizona Republican is buying during the Super Bowl, previewed on Thursday.",
    "By the time the Biden administration was staffing up, and passing the American Rescue Plan, harm reduction policies were almost totally uncontroversial among liberals.",
    "In it, Lamon portrays a gunslinger defending a town from bandits representing his political foes: “Old Joe” Biden, “Shifty” Mark Kelly and “Crazyface” Nancy Pelosi.",
    "A flamboyant rock star with a guitar, not unlike the rock imp from a recent Dr. Pepper ad campaign, shreds whenever Corman describes away he battled outgoing Gov.",
    "The creation of the grants made little news outside of outlets that cover drug policy; even the Trump administration had embraced some aspects of harm reduction.",
    "A program that liberals saw as common-sensical, that few if anyone in their ideological space was opposed to, careened into the reality of conservative backlash.",
    "Kansas City, Kan., was at the center of the week’s other major red state redistricting battle, with Republicans going to extraordinary lengths to override Gov.",
    "Laura Kelly’s (D) veto of a map that removed Democratic precincts from the 3rd Congressional District, represented since 2019 by Rep. Sharice Davids (D-Kan.).",
    "And that makes it his third-strongest issue — Biden only tests better on handling education (46 approval) and “protecting democracy in America” (46 percent).",
    "“If Ms. Psaki is suggesting that safe smoking kits or safe injection sites are endorsed by the opioid commission, she is mistaken,” Tabler wrote in an email.",
    "“The racist, condescending view of non-Whites by the Biden Administration,” wrote Rep. Burgess Owens (R-Utah), one of three Black Republicans in Congress.",
    "“Missouri is a red state that voted for Donald Trump by 15 points,” state Sen. Bob Onder (R) said last month, before the debate and the filibuster began.",
    "“What do you get when you cross a con man, a carpetbagger and a Democrat with a rap sheet?” asks the narrator at the top of Collins's first attack ad.",
    "A proposal that no Republican had attacked since its passage became, suddenly, an issue that epitomized the craziness they were running against.",
    "Jake Corman, “Not Your Average Political Ad.” How does yet another Pennsylvania Republican break out in the overstuffed gubernatorial primary?",
    "Eleven months ago, before anyone was using “Biden administration” and “crack pipes” in the same sentence, Monique Tula was celebrating.",
    "Republicans who hadn't previously reacted to the harm reduction grants, part of a bill they'd voted against, reacted with disbelief.",
    "The ban didn't get lifted until 2016, when Republicans in states staggered by the opioid crisis saw a new virtue in harm reduction.",
    "“The reality is that abstinence is not for everyone all of the time, right?” said Tula of the National Harm Reduction Coalition.",
    "The goal: preventing the adoption of a new congressional map that would maintain the GOP’s 6-to-2 delegation advantage.",
    "The idea of giving drug users sterilized equipment dates back to the 1970s; the backlash grew up along beside it.",
    "The “crack pipe” story ran frequently on Fox News and its affiliates before the administration had a response.",
    "“I fought him in court, so we could audit the 2020 election,” says Corman, earning a very brief guitar solo.",
    "“Right now, we have a representative in this seat who sold us out to build her own brand,” Arrington said.",
    "Kay Ivey for Governor, “Nice.” Biden-bashing is becoming more and more common in Republican advertising.",
    "As the story was being published, Chehade answered some emailed questions about his work with Newman.",
    "Collins, the owner of a trucking company and son of a former congressman, was already running there.",
    "But the commission's proposals synced up with some of what harm reduction advocates were asking for.",
    "“That meant progress,” said Tula, the executive director of the National Harm Reduction Coalition.",
    "Newman's position on Palestine/Israel had nothing to do with my running or not running,” he said.",
    "Please check out Bolts, and please don't think that means you can stop reading this newsletter.",
    "But the story of SAMHSA's harm reduction funding was the 2022 midterm campaign at hyper-speed.",
    "Congress banned federal funding for needle exchange programs in 1988, with bipartisan support.",
    "“We know they save lives; they help connect people to treatment and recovery,” said Psaki.",
    "Every demographic group picks “prices” as their test of how the economy is performing.",
    "Trump endorsed Arrington immediately; the candidate put out a statement thanking him.",
    "It took just minutes for the gun control group Moms Demand Action to denounce it.",
    "If they were serious, he said, they could back legislation to prevent this.",
    "It doesn't just protect people who use drugs from overdose and disease.",
    "The politics changed dramatically in a few hours this week.",
    "Many Democrats aren't sure how anyone could believe that.",
    "(McSwain is now a Republican candidate for governor.)",
    "“Voting for a 7-1 map doesn’t get you to heaven.",
    "We're doing it again, only angrier this time.",
    "“What does a harm reduction program do?",
    "The conservatives’ argument is simple.",
    "Rep. Henry Cuellar (D-Tex.)",
    "Really, why wouldn't it?",
    "The adviser denied that.",
    "This is The Trailer.",
    "Glenn Youngkin (R).",
    "Remember May 2021?",
    "Tom Wolf (D).",
    "“Progress!",
    "Illinois.",
    "“Rep."
  ]
}