{
  "id": 2625,
  "mediaId": 8350,
  "date": "2022-02-04",
  "headline": "US House OKs version of semiconductor legislation pushed by Arizona Sen. Mark Kelly",
  "image": "https://ktar.com/wp-content/uploads/2022/02/biden-semiconductor-getty.jpg",
  "link": "https://ktar.com/story/4872236/us-house-oks-version-of-semiconductor-legislation-pushed-by-arizona-sen-mark-kelly/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KEVIN STONE",
  "authorUrl": "https://ktar.com/story/author/kstone/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’ll keep working to make sure Arizona continues to be a leader in manufacturing this technology that is critical to our economic and national security.”\nThe nearly 3,000-page House bill, not counting scores of amendments added this week, includes massive investments designed to boost semiconductor manufacturing in the U.S.\nDemocrats say it would position the United States to better compete with China economically and on the global stage.",
    "“This bill invests big time in domestic research and production, creating good-paying jobs and solidify our state’s reputation as destination for high-tech companies.”\nThe Taiwan Semiconductor Manufacturing Company and Intel are both in the process of building multibillion-dollar microchip production facilities in the Valley, spurring other companies in the industry to set up shop in the area.",
    "President Joe Biden urged lawmakers to reach a deal quickly, saying, “America can’t afford to wait.”\nThe bill gives Democrats a chance to address voter concerns about the economy at a time when a shortage of computer chips has led to higher prices for automobiles, electronics and medical devices.",
    "“There’s billions of dollars [in the Senate bill] that will go to TSMC, Intel, other companies to build these fabrication facilities,” Kelly told KTAR News 92.3 FM’s Arizona’s Morning News on Wednesday.",
    "“We’ve worked hard to make Arizona — and especially the East Valley — a major tech hub, anchored and supported by the semiconductor manufacturing industry,” Stanton said in the release.",
    "The big-ticket items include about $52 billion in grants and subsidies to help the semiconductor industry and $45 billion to strengthen supply chains for high-tech products.",
    "PHOENIX – The U.S. House on Friday passed its version of a bill that contains billions of dollars to supercharge the semiconductor industry, which is booming in Arizona.",
    "A press release from Rep. Greg Stanton’s office, citing the Semiconductor Industry Association, said that nearly 29,000 Arizonans work in the semiconductor industry.",
    "“Now it’s time for House and Senate leaders to begin bipartisan negotiations to get our legislation over the finish line,” Kelly said in a statement.",
    "“We’ve just got to work out some differences with the legislation in the House, which we’ll do,” Kelly said Wednesday.",
    "Democratic Sen. Mark Kelly of Arizona cosponsored and helped craft the Senate version, which passed in June 2020.",
    "The 222-210 House vote was nearly along party lines, with one Democrat opposing and one Republican supporting.",
    "The next step is for the Senate and House to negotiate to make the bills identical.",
    "The Senate version passed with bipartisan support 68-32.",
    "The Associated Press contributed to this report."
  ]
}