{
  "id": 263,
  "mediaId": 8350,
  "date": "2022-02-24",
  "headline": "Arizonans could soon see prices at pump climb above $4, gas expert says",
  "image": "https://ktar.com/wp-content/uploads/2022/02/getty-gas-pump-for-feb-24.jpg",
  "link": "https://ktar.com/story/4908570/arizonans-could-soon-see-prices-at-pump-climb-above-4-gas-expert-says/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KEVIN STONE",
  "authorUrl": "https://ktar.com/story/author/kstone/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I don’t think that there’s any risk of prices spiking overnight, but the … the slow and steady climb will likely continue for at least the next couple of weeks,” GasBuddy analyst Patrick De Haan told KTAR News 92.3 FM’s The Mike Broomhead Show on Thursday.",
    "… We may not get relief until the Russia situation is behind us.”\nHowever, De Haan said he doesn’t necessarily expect the high prices to have a significant impact on gas usage.",
    "“Obviously, we’re in the midst of a very strong economic recovery from COVID, and unfortunately I don’t think people are really going to slow down, even at $4 a gallon.",
    "He also said there might not be any relief at the pump until the end of the year, although Russia’s invasion of Ukraine is casting shadow over the fuel industry.",
    "PHOENIX – Arizonans might soon be facing record gas prices, and relief could be months or more away, according to a fuel industry expert.",
    "“Certainly some people may drop their plans a bit at $4 a gallon, but I think we’re going to power through that, unfortunately.”",
    "“Previously, before the Russian situation, I would have expected relief by year’s end,” he said.",
    "He said there’s a 50-50 chance it will soon surpass the record of more than $4 set in 2008.",
    "De Haan said he expects gas prices to rise 20 to 30 cents over the next two or three weeks.",
    "“I certainly think we have a strong potential to get there,” he said.",
    "De Haan said the current statewide average is about $3.82 per gallon.",
    "“Now that’s kind of up in the air.",
    "“It depends,” he said."
  ]
}