{
  "id": 2717,
  "mediaId": 8475,
  "date": "2022-02-01",
  "headline": "Sinema, Kelly urge Ducey to send Nat'l Guard to Az hospitals stressed by COVID",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/020122_natl_guard_arizona_ANG.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/020122_cv_kelly_sinema_guard/sinema-kelly-urge-ducey-send-natl-guard-az-hospitals-stressed-by-covid/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Ingram",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/6436",
  "termIds": [
    5879,
    4905,
    2915,
    2459,
    861,
    98,
    5949,
    6697,
    6517
  ],
  "sentences": [
    "The duo also asked Ducey to work with \"stakeholders across the state\" to \"appropriately deploy National Guard and other resources necessary to keep Arizonans safe and secure,\" adding that National Guard personnel have already helped with vaccine distribution, help support patients, distributed food and personal protective equipment, and bolstered contact tracing and COVID-19 testing.",
    "National Guard troops could help hospitals with a range of activities, including \"transport, biomedical waste removal, linen and laundry services, food preparation and delivery, perimeter fencing, professional cleaning, contracted security services, and other critical services necessary to keep health care facilities operating safely and securely,\" the senators wrote.",
    "\"Hospitals already are rationing critical care services,\" they wrote, adding that hospitals were straining to provide extracorporeal membrane oxygenation or ECMO—a procedure that helps COVID-19 patients by shunting blood around their lungs and heart, directly oxygenating the blood before sending it back—and continuous renal replacement therapy.",
    "\"The surge in hospitalizations is expected to peak in early-to-mid February, but without implementation of proactive mitigation measures in the state, this peak could necessitate more drastic use of crisis standards of care and triaging of patients for scarce hospital beds,\" they wrote.",
    "In an announcement published on Jan. 14, FEMA said that President Joe Biden had approved 48 state and three territorial National Guard requests for federal support to use the troops to help mitigate COVID-19, and that FEMA would cover 75 to 100 percent of the costs of those missions.",
    "The rise in cases prompted over 1,300 health care workers, including doctors, nurses, allied healthcare workers, public health professionals to declare the state's health care system in \"crisis,\" and called on elected officials, including Ducey, to implement mitigation efforts.",
    "\"If Arizona continues its current course of non-mitigation, we face collapse of our healthcare system, including further rationing of hospital resources, accelerated loss of life and long-term disability for all patients, and enduring severe healthcare workforce shortages.\"",
    "Biden admin announces funding for Guard COVID missions\nThe letter comes after the Federal Emergency Management Agency announced it will continue to cover funding for National Guard units to support the \"whole-of-America response\" to COVID-19 until April.",
    "\"The Governor's Office, the Arizona Department of Health Services and the Arizona Department of Emergency and Military Affairs work closely with our hospitals,\" Karamargin said Tuesday evening in response to the Sentinel's request for comment.",
    "More than 26,000 Arizona residents have died from COVID, and new infections continue to overwhelm hospitals — including in Pima County, where the number of open intensive-care beds remains in the single digits on most nights.",
    "Already, around 15,600 National Guard members are deployed to help with the pandemic around the country, including around 6,000 tasked to help hospitals in several states including Virginia, Ohio, Georgia, and Maryland.",
    "\"We ask that Arizona take full advantage of all available resources, including the 100 percent federal reimbursement provided through April 1, 2022 for National Guard activities in response to COVID-19,\" they wrote.",
    "While deaths have stayed lower, owing to vaccinations and Omicron's lower virulence relative to the number of cases, the state still lost at least 1,197 people in January, peaking on Jan. 11 when 69 people died.",
    "Ducey could send troops when hospitals are \"unable to address\" staffing shortages, and if the shortage \"impairs the ability of the primary medical care facility to provide services, wrote Sinema and Kelly.",
    "Data from ADHS shows that emergency rooms bore the brunt of the wave of Omicron cases, and that in mid-January, nearly three-quarters of beds were filled, the highest rate since the pandemic began.",
    "The sharp rise in cases has pushed health care workers hard, as they face thousands of new cases of COVID-19, and were hit even harder because of the relative virulence of the Omicron variant.",
    "In a letter Tuesday, Sinema and Kelly asked Ducey to authorize the state's National Guard to provide \"wraparound assistance\" to help \"sustain hospital operations,\" Kelly's office announced.",
    "In Arizona, there have been over 450,000 cases since the beginning of the year, averaging about 15,800 cases per day, according to figures from the Arizona Department of Health Services.",
    "And, FEMA officials added that federal assistance keeps states from incurring substantial costs for extended deployments during \"the economic uncertainty caused by the pandemic.\"",
    "\"Hospital systems, health care facilities, and those caring for Arizona’s most vulnerable populations are suffering from severe staffing shortages,\" wrote Arizona's senators.",
    "During a press conference on Jan. 24, Dr. Marjorie Bessel, chief clinical officer with Banner Health said the network's hospitals continued to face staffing shortages.",
    "On Jan. 11, nearly 2,600 COVID-19 positive or suspected COVID-19 patients sought care in the state's emergency departments, the highest rate ever during the pandemic.",
    "In-patient beds and ICU beds were less constrained, but nonetheless, as the Omicron wave peaked, just five percent of in-patient beds and ICU beds were available.",
    "\"Furthermore, several health systems have implemented\" crisis staffing \"permitting healthcare staff infected with COVID-19 to continue working in the hospital.\"",
    "This, along with \"relaxed visitor policies at some health systems\" increases the risk of COVID infections and \"may further prolong this surge,\" they wrote.",
    "Within weeks of its arrival in the United States, Omicron became the dominant form of COVID-19 and drove a massive increase in cases throughout the nation.",
    "Doug Ducey to send the Arizona National Guard to hospitals facing staffing shortages because of the surge in COVID-19 cases caused by the Omicron variant.",
    "\"This endangers their ability to care for Arizonans, worsening people’s health outcomes, increasing costs, and putting lives and livelihoods at risk.\"",
    "Hospital staffing continues to be a major issue for hospitals, especially following the outbreak of the newest variant of COVID-19, known as Omicron.",
    "Last week, FEMA began operating a drive-thru testing site on Pima Community College's West Campus, testing 3,629 people for COVID-19.",
    "\"Staffing continues to be a top priority for us as we respond to this current wave of COVID cases and hospitalizations,\" she said.",
    "When positivity rates and case counts increase in our communities, our team members are exposed and infected with the virus, too.\"",
    "However, this was far lower than the rates during the 2021 wave when COVID-19 patients took up more than two-thirds of ICU beds.",
    "Since December, Bessel has warned that Arizona hospitals would operate well beyond their capacity through the month of January.",
    "26,000 Arizonans dead from COVID\nOn Tuesday, ADHS reported another 7,567 cases, and said another 140 people died in the state.",
    "FEMA said that so far it has obligated $2.7 billion to the missions, deploying over 18,000 troops by December 2021.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "The Biden administration has said it will fund Guard deployments to assist hospitals for the next several months.",
    "That includes a commitment of $35 million late last year, as hospitals were dealing with the most recent surge.\"",
    "More importantly, we have not received a request from a single Arizona hospital for National Guard assistance.\"",
    "The Republican governor's spokesman downplayed the offer of federal support for Guard assistance at hospitals.",
    "Throughout the pandemic, we have invested more than $200 million to bolster staffing and other resources.",
    "\"As I have mentioned in previous press conferences, our team members are also members of the community.",
    "While FEMA has announced it will cover costs, the National Guard would have to be deployed by Ducey.",
    "This is below the peak of deaths in Arizona, when 176 people died on a single day in January 2021.",
    "\"Our current situation is unsustainable,\" they wrote in an open letter published on Jan. 25.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "In ICUs, COVID-19 patients took up nearly 40 percent of the available beds by January.",
    "\"This is why we have acted to boost hospital staffing on multiple occasions.",
    "\"Calling for National Guard support — at this point — seems off,\" said C.J.",
    "FEMA has also been involved in testing and vaccinations in Pima County.",
    "COVID-19 cases are dropping and hospitalizations are leveling off.",
    "Concerned about keeping quality reporting alive in Tucson?",
    "In total, the state has lost 26,345 people to COVID-19.",
    "Support TucsonSentinel.com with a contribution today!",
    "\"The timing of the senators' letter is curious.",
    "Kyrsten Sinema and Mark Kelly are pushing Gov.",
    "Karamargin, Ducey's spokesman.",
    "Like what you're reading?",
    "Local\nU.S. Sens.",
    "- 30 -"
  ]
}