{
  "id": 275,
  "mediaId": 2540,
  "date": "2022-02-22",
  "headline": "Arizona is ground zero for election changes",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220218122610-rusty-bowers-file-2019-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/22/politics/arizona-election-changes-ctzn/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fredreka Schouten and Kelly Mena",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He has described Trump and the then-President's lawyer Rudy Giuliani calling him after the 2020 election, asking Bowers to somehow inject the legislature into the certification process before the state sent its slate of 11 presidential electors to Congress.",
    "Even as headline-grabbing election bills falter in Arizona, Republican lawmakers still are weighing a raft of proposals that could alter voting practices in a battleground state that President Joe Biden won by fewer than 11,000 votes.",
    "Arizona Mirror journalist Jeremy Duda offered a colorful take -- describing Bowers' takedown as \"killing the bill, chopping it up, setting the pieces on fire, then digging up the ashes and throwing them into the ocean.\"",
    "Alex Gulotta, a voting rights activist who runs the Arizona branch of All Voting is Local, said he credits Bowers with \"holding the line\" to block some of the most blatantly undemocratic ideas floated in the state.",
    "A look from the New York Times at how the Wisconsin Republican party is being torn apart by election deniers in the party who still believe former President Donald Trump can be reinstalled in the White House.",
    "You've probably never heard of Republican Rep. Rusty Bowers, but the Arizona House speaker has quietly made a name for himself in the state as the stealth killer of his party's most extreme election ideas.",
    "Bowers, a professional painter and sculptor who represents a district east of Phoenix, has a contrarian history -- at least when it comes to some of his party's most outlandish maneuvers in recent years.",
    "Maine Sen. Susan Collins' recent op-ed in The New York Times, making the case for an overhaul of the arcane 1887 law that sets out procedures for Congress to count presidential electors.",
    "Finchem, a Republican running for secretary of state this year with Trump's endorsement, makes mostly debunked claims of fraud to call for the results to be set aside in three counties.",
    "Bowers' response to the proposal, per The Arizona Republic: \"Mr. Finchem's obviously unconstitutional and profoundly unwise proposal will receive all of the consideration it deserves.\"",
    "The state's full calendar, along with information on how to check your voter registration status if you live in Arizona, can be found here at the Arizona Secretary of State's Office.",
    "First up was a bill that would have ripped up most voting rules in this battleground state and handed the state legislature the power to reject election results it didn't like.",
    "CNN's Jamie Gangel and Jeremy Herb's \"Anatomy of a tweet\" piece, looking at how a retired judge and Twitter newbie strung together tweets to try to stop an insurrection.",
    "A database maintained by the National Conference of State Legislatures shows that Arizona accounts for nearly 10% of all the election-related bills in states this year.",
    "It includes Maricopa, the state's most populous county, targeted last year in a problem-plagued ballot review ordered by Republicans in the state Senate.",
    "\"I said, 'No, I won't,'\" Bowers recounted in a CNN interview last year, adding, \"'3.5 million people voted here, I'm not gonna unilaterally do that.'\"",
    "The governor's seat, six other statewide offices and an array of congressional and state legislative races are on the ballot.",
    "But, he said, \"there are actually a lot of bad things\" moving through the legislature \"that people are being silent about.\"",
    "Doug Ducey, and decide whether to return one of most vulnerable Senate incumbents, Democratic Sen. Mark Kelly, to Congress.",
    "Control of both chambers of Congress and a slew of governorships are on the line in upcoming primaries around the country.",
    "The Republican senator recounts the terror and chaos of that day as she argues for shoring up the Electoral Count Act.",
    "In a bit of parliamentary jiu jitsu, Bowers assigned the bill to 12 committees at once, ensuring it would go nowhere.",
    "Our colleague Chris Cillizza's take on an election denier announcing a run for Colorado secretary of state.",
    "The process was disrupted temporarily when pro-Trump supporters stormed the US Capitol on January 6, 2021.",
    "Bowers is term-limited in the Arizona House, and last week announced plans to run for the state Senate.",
    "Our colleagues Gregory Krieg and Ethan Cohen have the full rundown of key primary dates here.",
    "Bowers told CNN's Dianne Gallagher that he voted and campaigned for Trump but rebuffed that.",
    "Then came Rep. Mark Finchem's resolution this month on Arizona's 2020 election results.",
    "The last day of early, in-person voting in the Lone Star State is Friday, February 25.",
    "Voters will fill an open gubernatorial seat, now held by term-limited Republican Gov.",
    "The primary election for legislative and statewide offices is slated for August 2.",
    "Its sponsor, GOP state Rep. John Fillmore, called it a \"12-committee lynching.\"",
    "(CNN)A version of this story appeared in the CITIZEN BY CNN newsletter.",
    "The first statewide primary of the year is just a week away in Texas.",
    "The deadline to register to vote in that primary is July 5.",
    "The filing deadline for candidates in Arizona is April 4.",
    "To get it in your inbox, sign up for free here.",
    "Election day is March 1."
  ]
}