{
  "id": 277,
  "mediaId": 2606,
  "date": "2022-02-22",
  "headline": "Here’s why Nevadans won’t see relief from a federal gas tax holiday",
  "image": "https://www.reviewjournal.com/wp-content/uploads/2022/02/16187889_web1_GAS-PRICES-JUN21-19_002.jpg",
  "link": "https://www.reviewjournal.com/news/politics-and-government/nevada/heres-why-nevadans-wont-see-relief-from-a-federal-gas-tax-holiday-2533621/",
  "mediaOutlet": "Las Vegas Review-Journal ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Sebelius",
  "authorUrl": "https://www.reviewjournal.com/staff/steve-sebelius/",
  "termIds": [
    0
  ],
  "sentences": [
    "This unserious, cynical and incompetent politicking has unfortunately become the norm for her, and this latest episode further shows why we must defeat her in November.”\nIn addition, the National Republican Senatorial Committee called the proposal “gimmicky.”\n“It’s no surprise the Democrats’ solution to inflation is a gimmicky bill proposed by Senate Democrats that face rejection at the polls this November,” a statement from committee spokesman Keith Schipper reads.",
    "Further testimony indicated that insufficient funding is currently available for the necessary maintenance and repair of these roads.”\nThe specific language to allow for a state gas tax increase was suggested by the Nevada Taxpayers Association during a June 26, 1997 hearing in the Senate Taxation Committee, according to a legislative history.",
    "The amount of the tax so imposed by this State must be equal to the amount by which the federal tax is reduced.”\nThat means a proposal to reduce the federal gas tax of 18.4 cents per gallon sought by senators as a means of reducing gas prices that have been driven up by inflation wouldn’t change taxes in the Silver State.",
    "“Our office has been working closely with the Senators who drafted the bill to address any conflicts and make sure it will directly benefit Nevadans by saving them money at the pump.”\nRepublicans mock plan\nBut Republicans jumped on the state law to mock Cortez Masto’s stance on temporarily reducing the tax.",
    "“With the Intermodal Surface Transportation Efficiency Act re-authorization, the amendment will insure the counties will be able to pick up any or all of the gas-tax levy which might be lost through federal legislation.",
    "As a former state Attorney General who has spent nearly a full term in the Senate, it beggars belief that Cortez Masto would commit to such a brazen stunt to hide her record of weakening our domestic energy production.",
    "The law, NRS 365.185 is clear: “This (excise) tax (on motor vehicle fuel) must be imposed and will increase if the tax collected by the Federal Government pursuant to the provisions of 26 U.S.C.",
    "Martin Hefner, a lobbyist for the organization, said the amended language would allow rural counties in Nevada to remain whole if changes in federal law reduced or eliminated the U.S. gas tax.",
    "“Clearly vulnerable Democrats like Cortez Masto are more concerned about keeping their jobs than fixing the crisis they created.”\nSuspending the tax\nThe tax-relief bill — sponsored by Sens.",
    "In response to questions about the Nevada law, Cortez Masto’s office released a statement: “Senator Cortez Masto is focused on lowering costs for Nevadans – especially at the pump.",
    "A proposal sought by Democratic U.S. senators — including Nevada’s Catherine Cortez Masto and Jacky Rosen — to reduce federal gas taxes won’t bring relief for Nevada residents.",
    "“This report leaves us to wonder if Catherine Cortez Masto willfully misled the people of Nevada or did she simply not read the state’s laws as they pertain to her proposal.",
    "Mark Kelly, D-Ariz., and Maggie Hassan, D-N.H., both of whom are up for re-election this year — would suspend collection of the federal gasoline tax for the rest of 2022.",
    "In 1997, it was amended to eliminate the 4-cent cap, allowing the state’s tax to be raised to entirely cover any reduction or elimination of federal fuel taxes.",
    "That’s because a state law in place since at least 1973 and modified in 1997 raises Nevada’s fuel tax by the exact amount of any reduction in federal levies.",
    "Former Attorney General Adam Laxalt, who is running to unseat Cortez Masto, released a statement following a report on the issue that aired on Fox Business.",
    "“Testimony indicated that rural areas in Nevada need additional funding for road maintenance and repair because long stretches of roadway are in disrepair.",
    "“Assembly Bill 525 was introduced in response to the growing need for the maintenance and repair of local roads,” a legislative history of the bill says.",
    "She’ll continue to work to deliver this critical relief and make sure that Nevadans see it when they fill up their tank.”\nThis is a modal window.",
    "§ 4081 or any other tax collected by the Federal Government relating to motor vehicle fuel is reduced or discontinued in whole or in part.",
    "“Senator Rosen joined this legislation to swiftly lower costs for hardworking American families,” her office said in a statement.",
    "Hefner confirmed this; if the amendment is not passed, the rural counties will not be able to pick up those gas taxes.”",
    "First passed in 1973, the law originally imposed a tax of up to 4 cents per gallon if the federal levy was lowered.",
    "The average cost of regular unleaded gasoline in Clark County stood at $3.99 a gallon on Friday, according to AAA.",
    "(The Nevada Department of Transportation) concurred with this amendment,” according to the minutes.",
    "But the Nevada law would apparently moot any benefit from reducing the federal levy.",
    "Money raised from the tax is generally used for highway maintenance.",
    "Rosen’s office also said she’s working to resolve the issue.",
    "No compatible source was found for this media.",
    "This video is currently unavailable.",
    "“Mr."
  ]
}