{
  "id": 2772,
  "mediaId": 2602,
  "date": "2022-02-02",
  "headline": "Senate GOP Twitter account stops following virulently antisemitic account after reporter’s query",
  "image": "",
  "link": "https://www.jpost.com/diaspora/antisemitism/article-695343",
  "mediaOutlet": "Jerusalem Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "RON KAMPEAS/JTA",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“It may be we need to take another look at who we follow.”\nThe conference is currently chaired by John Barrasso of Wyoming, who brought his own staff to the office when he assumed the role in 2018.",
    "It would have been clear even from the abbreviated headlines on the Twitter feed, when the social media site was limited to 120 characters, that @jewishquestion was an antisemitic and racist feed.",
    "WASHINGTON — The official Twitter account of the Republican Senate conference stopped following a virulently antisemitic Twitter account after getting a question from a reporter about the account.",
    "The most recent tweet from Nov. 1 2016 reads, “Obnoxious Jews Cause Decline in Bud Light Sales.”\nThe Senate Republican Conference unfollowed the account on Wednesday as soon as JTA made a query.",
    "The site, apparently British-based, posted antisemitic screeds, including one in 2010 reading, “CHRISTIANS TAUGHT HOW NAZI-JEWS WORK IN AMERICA TO KILL OFF WHITES.”",
    "In 2010, around the time that Senate Republican account appeared to follow @jewishquestion, former Sen. Lamar Alexander of Tennessee was the chairman.",
    "Between 2010 and 2016, when it became dormant, the @jewishquestion account linked to postings on pro-Palestinian and antisemitic and racist websites.",
    "A reader alerted the Jewish Telegraphic Agency that @SenateGOP, the account of the Republican conference in the Senate, followed @jewishquestion.",
    "“Freaky Negro Burns Woman Alive in Elevator: Good thing the perp wasn’t some White guy and the woman an old Jewess,” said another the same year.",
    "An apologetic staffer for the conference said no one knew who made the decision to follow the account, and why.",
    ": American politics has become a lot like going to a Chinese restaurant,” one tweet said in 2011.",
    "The account’s biography page includes a link to a defunct website, The Jewish Question.",
    "JTA has asked Alexander who ran digital operations for the office at that time.",
    "“That’s not the kind of account we would follow,” said the staffer.",
    "The @SenateGOP account currently follows about 23,500 accounts.",
    "“Globalist Jewry has America by THE BALLS!"
  ]
}