{
  "id": 2900,
  "mediaId": 2746,
  "date": "2022-02-02",
  "headline": "Republicans fume after closed-door hearing on Afghan pullout",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/09/21/senate_homeland_security_27294_c0-424-7599-4856_s1200x700.jpg?1145f540cf7b2bc80b4a816d5298092aba1859c2",
  "link": "https://www.washingtontimes.com/news/2022/feb/2/republicans-fume-after-closed-door-hearing-afghan-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Clark",
  "authorUrl": "https://www.washingtontimes.com/staff/joseph-clark/",
  "termIds": [
    0
  ],
  "sentences": [
    "We keep talking about ‘lessons learned.’ We’re not going to learn lessons unless we’re able to have a conversation in public and people can actually learn stuff.”\nOklahoma Sen. Jim Inhofe, the ranking Republican on the Armed Services panel, said he found Mr. Blinken’s and Mr. Austin’s testimony “lacking” on key questions such as how interagency planning for the pullout was conducted and what the plans are now to prevent new terror threats from emerging in Afghanistan.",
    "The Biden administration is ducking accountability by refusing to publicly answer key questions about the disastrous U.S. and allied military withdrawal from Afghanistan, top Republicans charged Wednesday after a closed-door hearing that offered lawmakers the rare chance to grill senior U.S. officials about the events and policies behind last summer’s deadly pullout.",
    "Defense Secretary Lloyd Austin and Secretary of State Antony Blinken spent more than three hours before a joint hearing of the Senate Armed Services and Foreign Relations committees, though much of what was discussed will remain secret over the loud objections of GOP leaders, who argued there was no reason Wednesday’s event couldn’t have been public.",
    "The long-awaited hearing came just hours after a major report in The Atlantic magazine that claimed to offer new detail on how the administration was caught flat-footed by the rapidly deteriorating situation in Afghanistan in July and August, and by how quickly the insurgent Taliban would topple the U.S.-backed Afghan government.",
    "Lawmakers of both parties say they still haven’t heard good explanations for why the administration was unable to fulfill its promise to evacuate thousands of Afghan translators and interpreters who aided the 20-year American war effort as the summer-long pullout unfolded and now are likely Taliban targets.",
    "We are failing to rescue them from the increasingly imminent and dire danger that they face.”\nAt the Pentagon, officials tried to downplay reports that the administration was ill-prepared for last August’s rushed exit from Afghanistan, which marked the end of the longest war in American history.",
    "Republicans have zeroed in on questions about the number of U.S. citizens still left in Afghanistan, along with the administration’s plan to deal with the likely prospect that the country will once again become a regional base for al Qaeda and other Islamic terrorist groups to set up shop.",
    "What I can tell you is we were all working … throughout the summer but certainly in August to make sure we were best postured to conduct an evacuation if one was needed, and clearly one was needed,” Pentagon spokesman John Kirby told reporters.",
    "The Defense Department’s Office of the Special Inspector General for Afghanistan Reconstruction (SIGAR) on Wednesday released its latest quarterly report on Afghanistan and focused heavily on the large-scale food scarcity now on display.",
    "While the U.S. is providing hundreds of millions of dollars in aid to the Afghan people, the decision by most world governments to reject the Taliban as an official governing body has made it much more logistically difficult to help.",
    "“I am deeply dissatisfied, in fact downright upset, with the lagging, laggard efforts in evacuating at-risk Afghan allies from that country,” Sen. Richard Blumenthal, Connecticut Democrat, said just before the hearing.",
    "The scenes from that evacuation effort — and the deaths of 13 U.S. service members guarding the airport — enraged both Republicans and Democrats and so far is the defining foreign policy moment for President Biden.",
    "The report cited leaked meeting notes and charged that the administration was making pivotal decisions at the last minute, including how to handle mass evacuations from the Kabul airport.",
    "“I think it was a pretty transparent attempt to evade any kind of accountability or public scrutiny,” Sen. Josh Hawley, Missouri Republican, told The Washington Times after the hearing.",
    "Nearly 23 million will face “potentially life-threatening levels of hunger this winter,” the inspector general said, citing World Health Organization data and other figures.",
    "Meanwhile, the Afghanistan left behind by the U.S. and NATO withdrawal is quickly facing a massive humanitarian crisis under the inexperienced Taliban‘s new rule.",
    "He said in a statement he secured a promise from the administration witnesses to return to a public hearing on Afghanistan at a future date.",
    "“These men and women and their families put their lives on the line to protect our troops and diplomats.",
    "Nearly 19 million Afghans experienced acute shortages in September and October 2021, SIGAR said.",
    "Nearly six months later, critics say the public deserves answers but got none on Wednesday.",
    "“It’s a crisis,” Sen. Mark Kelly, Arizona Democrat, said after Wednesday’s hearing.",
    "I mean, this is the worst foreign policy debacle since the Vietnam War.",
    "“The public needs to be able to hear the answers to these questions.",
    "Lawmakers say the situation is deeply troubling.",
    "“I’m not going to speak to leaked documents."
  ]
}