{
  "id": 2969,
  "mediaId": 2634,
  "date": "2022-02-04",
  "headline": "The Political Wreckage of Kyrsten Sinema",
  "image": "https://images.newrepublic.com/05d1886fbb0177250328e65685d9a742ab05a227.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/165279/kyrsten-sinema-donors-mark-kelly",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Shephard",
  "authorUrl": "https://newrepublic.com/authors/alex-shephard",
  "termIds": [
    0
  ],
  "sentences": [
    "Perhaps she had some galaxy-brain motive for this—though it may also be that Sinema has simply decided that the only issues she cares about are high-proof deficit hawkery and a commitment to keeping the wealthy from paying taxes—but even if that were the case, it’s been clear for months that her lonely stance against social spending and voting rights is accomplishing nothing from a political or policy perspective.",
    "Joe Manchin, for all his faults, has been relatively clear about what he wanted from the Build Back Better Act: He didn’t want programs that were only funded for a few years; he insisted that social spending be means-tested and that it reduce the deficit; he said he wouldn’t support anything more than $1.5 trillion but showed some openness to a slightly higher number.",
    "If Manchin sees a political benefit in killing the version of the Build Back Better Act that was approved by Democratic leaders—however unconscionable doing so may be—there’s at least a case to be made that he’s making the correct call from a raw political perspective.",
    "Democrats need him to accomplish anything: Whenever he leaves the Senate, it’s likely that decades will pass before another West Virginia Democrat holds his seat; his approval rating in his home state is 60 percent, while Joe Biden’s is 32 percent.",
    "According to Politico, just over 2 percent—a meager $33,983—of the Arizona senator’s donations in the last quarter of 2021 came from small donors, while a PAC intent on primarying her when she’s up for reelection in 2024 raised a whopping $180,000.",
    "On the filibuster, she peddled a mix of lies and ahistorical myths, insisting, for instance, that the filibuster exists as a mechanism to encourage bipartisanship, when it is, in fact, a tool of obstruction and a product of the Jim Crow era.",
    "“It’s like a vacuum that’s taking away from the focus that needs to be on Mark Kelly right now … instead we’re fighting against ourselves here.”\nUltimately, this has been Sinema’s greatest, and perhaps only, accomplishment.",
    "The best guess was that her opposition was merely performative—that she was making a long-term bet that sinking the Democratic agenda was better for her politically in a purple state than helping to usher it through.",
    "She has claimed the center of attention for herself and, in doing so, has divided the Democratic Party, stymied its legislative agenda, and damaged the reelection chances of herself and her fellow Democrats.",
    "Her persistent opposition to the Democratic agenda, particularly her efforts to sink its twin centers, the Build Back Better Act and voting rights legislation, has dried up her grassroots donor support.",
    "At the same time, her net favorability among Arizona Democrats has plunged to negative-57; Mark Kelly, the state’s other senator, boasts a 72 percent approval rating, per a Data for Progress poll.",
    "Her Democratic colleagues are unhappy with her at the moment; her quixotic efforts have alienated her from Democratic organizers in her home state and helped fund efforts to unseat her.",
    "Sinema has opted to spend Biden’s first year in office repeatedly shooting herself in the foot, alienating the members of her party, and driving her stateside supporters away in droves.",
    "If her ultimate goal was some odd political end—to hoover up enough Republicans and independents to make up for her decline in support from progressives—she’s clearly failed miserably.",
    "One executive reported that he was “tremendously impressed” by Sinema’s opposition to the modest filibuster reform that would have allowed Democrats to pass their voting rights agenda.",
    "But lest you think she has some future as a party-switcher, recall that she voted to convict President Donald Trump in both of his impeachment trials—a certain deal-breaker.)",
    "The Democrats will almost certainly lose at least one house of Congress in the midterm elections, ensuring that Republicans will return to their obstructionist crouch.",
    "No such case can be made for Sinema: She has simply spent the last year acting like an inscrutable doofus while screwing things up for everyone around her.",
    "“I do think that Kyrsten Sinema is making it significantly more difficult for Mark Kelly to get re-elected,” one Arizona Democrat told Insider last month.",
    "While much of the focus of Democratic frustration has focused on Manchin, the West Virginia senator’s political considerations are easy to understand.",
    "For months, the Arizona senator has stymied the Democrats’ agenda, dragged down her party’s reelection hopes, and earned the ire of her supporters.",
    "Though popular, he will face a tough race later this year in an election that will almost certainly be a bloodbath for congressional Democrats.",
    "She has vociferously opposed raising taxes but has never offered a clue about what components of the measure she was interested in supporting.",
    "The same poll found that Ruben Gallego, a likely progressive primary challenger, was currently routing Sinema 72–18 in head-to-head polls.",
    "Whether oil money will be enough to protect her from a primary challenge—or bump that 18 percent number up a few notches—isn’t clear.",
    "But what choice does she have (besides, you know, helping to pass an agenda that’s popular among Arizona voters)?",
    "To make up for these shortfalls, Sinema was last seen wooing the fossil fuel industry at a Houston fundraiser.",
    "(A recent poll found that 55 percent of Arizona Republicans approve of her, versus 44 percent of Democrats.",
    "Sinema is not up for reelection until 2024—there’s more than enough time for her to get with the program.",
    "Kyrsten Sinema’s only friends, it seems, are Republican donors and executives from petrochemical firms.",
    "This contributed to the legislative morass that ultimately helped kill the bill altogether.",
    "Meanwhile, she’s done no small amount of damage to Kelly’s chances of reelection.",
    "The time to get things done is now—or, more accurately, was a few months ago.",
    "“This is not what we wanted to talk about right now,” they continued.",
    "The big question for Sinema is what she is trying to accomplish.",
    "But from a practical standpoint, it’s already too late.",
    "On the Build Back Better Act, she was even less clear.",
    "Theoretically, the situation is repairable.",
    "Sinema, on the other hand?",
    "We still don’t know why.",
    "Hope it was worth it."
  ]
}