{
  "id": 3069,
  "mediaId": 2741,
  "date": "2022-02-01",
  "headline": "A Year After Insurrection, Trump and Republicans Are Raking In Money Like It Never Happened",
  "image": "https://media.vanityfair.com/photos/60cf76ce32348de9d4c40d68/16:9/w_1280,c_limit/Donald-Trump.jpg",
  "link": "https://www.vanityfair.com/news/2022/02/a-year-after-insurrection-trump-and-republicans-are-raking-in-money-like-it-never-happened",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    0
  ],
  "sentences": [
    "— Inside Jerry Falwell Jr.’s Unlikely Rise and Precipitous Fall at Liberty University\n— Eric Adams Pulls Crypto-Paycheck Stunt Hours Before Bitcoin Crash\n— Dave Chappelle and “the Black Ass Lie” That Keeps Us Down\n— Trump’s January 6 Cover-Up Is Unraveling Fast\n— Florida Man Has Growing God Complex\n— In 2024, Mike Pence Is Gearing Up to Go Rogue\n— New York Attorney General to Trump, Ivanka, and Don Jr.: Don’t F--k With Us\n— Inside This Cable News Giant’s Streaming Dreams\n— From the Archive: It Came From Wasilla\n— Not a subscriber?",
    "“House Democrats’ record-breaking fundraising shows we’re ready to compete across the battleground,” Democratic Congressional Campaign Committee Spokesperson Chris Taylor added in a statement, “and make sure voters know just how dangerous Republicans’ extremist agenda is.”\nBut if Democrats are pulling in more money than they were before, Republicans are pulling in way more money than they were previously.",
    "But if the GOP had ever truly become a pariah to the donor class, that no longer appears to be the case: Both Trump and his party are raising money hand over fist, with Republicans outpacing Democrats in fundraising ahead of this fall’s crucial midterms where Republicans could not only regain control of Congress, but set the stage for the former president to launch another White House bid.",
    "Democrats, who have about $15 million more right now than they did at this point in the 2020 cycle, see good reason for optimism: They have deep pockets to draw from as they work to retain their congressional majorities, and already some vulnerable candidates, including Senators Raphael Warnock of Georgia and Mark Kelly of Arizona, have outstripped their GOP challengers.",
    "“While Republicans put forward flawed candidates that are locked in vicious primaries, this record-breaking fundraising quarter for Democrats shows the power of our grass roots support,” Jazmin Vargas, spokesperson for the Democratic Senatorial Campaign Committee, said in a statement, per the Washington Post.",
    "Donors were trying to distance themselves from the GOP around this time last year, and for good reason: Donald Trump had fomented a violent insurrection at the U.S. Capitol, and his allies in the House and Senate still voted to overturn the 2020 election results.",
    "Revelations about Trump’s efforts to subvert democracy — and the complicity of Republican lawmakers — have only multiplied in the 12 months since, thanks to the work of the congressional committee investigating January 6 and to Trump’s own cavalier admissions.",
    "Without largely atoning for any of that or changing course — indeed, while doubling down on it — the GOP is raking in more cash than ever and could, soon, capitalize on Joe Biden’s languishing approval ratings to retake Congress.",
    "Meanwhile, Trump himself entered 2022 with $122 million in cash on hand, having raised more than $50 million in the back half of last year alone — a haul that both reflects and cements his continued dominance over the GOP.",
    "“Republicans and their donors are excited to fire Nancy Pelosi and put a stop to the toxic Biden agenda,” said National Republican Congressional Campaign spokesperson Michael McAdams, per the Post.",
    "“President Trump is incredibly well positioned to look beyond November as the need for his leadership has never been more important,” Trump spokesperson Taylor Budowich said in a statement.",
    "But Republicans have out-raised their counterparts by a significant amount, disclosing close to $220 million in their campaign coffers compared with about $176 million for Democrats.",
    "Democrats’ fundraising was turbo-charged by disdain for Trump, who isn’t on the ballot in 2022, and the party not in power tends to be energized in the midterms.",
    "Democrats out-fundraised their opponents in the lead-up to both the 2018 midterms and the 2020 general, beating Republicans by more than $50 million in 2019.",
    "Both Democrats and Republicans have posted record fundraising totals this cycle, according to Federal Election Commission filings from Monday.",
    "Roughly a year ago, members of the Republican party flagrantly attempted to subvert democracy on behalf of its demagogic leader.",
    "If Republicans ride their massive fundraising to control of Capitol Hill in November’s election, it’ll be business as usual.",
    "That, of course, is the distressing thing: Typical political dynamics are prevailing in atypical times.",
    "The GOP has now reversed that and raised close to $45 million more than Democrats in 2021.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "It looks like we're experiencing playback issues.",
    "This isn’t necessarily surprising.",
    "Our bad!"
  ]
}