{
  "id": 308,
  "mediaId": 2520,
  "date": "2022-02-22",
  "headline": "Interior secretary outlines funding for Arizona tribal water settlements, other projects",
  "image": "https://www.gannett-cdn.com/presto/2021/12/09/PPHX/924187e2-f099-40f6-995f-6ae430b485c3-IMG_0217.jpg?crop=3599,2024,x0,y278&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/local/arizona/2022/02/22/interior-announces-arizona-tribal-water-settlement-funding/6894752001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Debra Utacia Krol",
  "authorUrl": "https://www.azcentral.com/staff/2684011001/debra-utacia-krol/",
  "termIds": [
    0
  ],
  "sentences": [
    "Funding for the tribal water settlements \"will benefit our entire state’s water supply while also completing water infrastructure projects needed for tribal communities to access clean, reliable drinking water now and for generations to come.”\nSinema said the infrastructure law “directly invests in tribes’ economic and water security by fully funding Indian water rights settlements in Arizona and across the country.",
    "She said the infrastructure act funding would enable the Interior Department to uphold its trust responsibilities to tribes and deliver water resources to tribal communities: “I am grateful that tribes, some of whom have been waiting for this funding for decades, are finally getting the resources they are owed.”\nKelly and Sen. Kyrsten Sinema released statements about the tribal funding.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nHaaland met with tribal leaders Monday at the Inter Tribal Council of Arizona's office in Phoenix to discuss how the infrastructure act would deliver funding to tribes.",
    "The funds are part of a more than $13 billion appropriation to tribes from the infrastructure law for new projects ranging from road construction, drought resiliency, natural resource management and building out broadband internet, along with efforts to provide drinking water and sanitation projects for tribal communities.",
    "During a meeting Tuesday afternoon with state officials, congressional officials, tribal leaders and community members, Rep. Greg Stanton, D-Ariz., said the most important issue facing the state of Arizona is the drought which some scientists are saying is the worst in 1,200 years.",
    "Stephen Roe Lewis outlined how the tribal water infrastructure funding would affect his 21,000-member tribe, saying the water rights funding is \"historic and will have an immediate impact in the community by accelerating irrigation projects that will create approximately 200 jobs.\"",
    "Officials said $224 million would come to Arizona to implement water infrastructure projects resulting from settlements for the Gila River Indian Community, the San Carlos Apache Tribe, the Tohono O'odham Nation and the White Mountain Apache Tribe.",
    "“For 39 years, the Inter Tribal Council of Arizona has operated the Tribal Water Systems Program, and yet every year the primary source of funding to provide critical clean water services under this program has been zeroed-out,\" Burnette said.",
    "Bernadine Burnette, president of the Inter Tribal Council of Arizona, said tribal leaders think the infrastructure act's provisions will remove barriers to tribes and provide the means for long-overdue improvements on infrastructure work.",
    "Members will include the Bureau of Reclamation commissioner, the director of the Bureau of Indian Affairs, assistant secretaries of water and science and Indian Affairs and the Interior Department solicitor, as well as other officials.",
    "Haaland said tribes across the United States would receive $2.5 billion to fund Indian water rights settlements, with the first $1.7 billion being allocated in 2022 to finalize settlements with existing federal obligations.",
    "During the meetings, she discussed water delivery projects, funding for the Drought Resilience Plan and tribal water projects such as fulfilling Indian water settlements, some of which have waited for funding for decades.",
    "The Indian Health Service, one of the other principal agency water project funders, had a $3.1 billion backlog in fulfilling water projects in 2021, according to backers of a bill proposed by Sens.",
    "Only by working together, he said, will Arizona weather a drought that has already resulted in an 18% decrease in Colorado River deliveries to the state due to the river's decreased flows.",
    "\"The infrastructure investments will assist tribes to fully realize self-determination and ensure sustainable, safe water supplies for their communities.”\nGila River Indian Community Gov.",
    "In her first visit to Arizona as secretary of the Interior, Deb Haaland touted water, drought resilience and other projects that will be funded by the recently passed infrastructure law.",
    "Gila River and the Colorado River Indian Tribes have contributed water from their settlements to keep Lake Mead levels high enough to prevent or postpone more cuts to river allocations.",
    "\"The Department of the Interior will uphold our trust responsibilities and ensure that tribal communities receive the water resources that they have long been promised,\" Haaland said.",
    "\"This funding can't make it rain or refill wells and reservoirs with water, but it can go a long way to build resilience and develop strategies that can help stretch water resources.\"",
    "Other officials echoed Stanton's sentiment, including Rep. Tom O'Halleran, Rep. Raúl Grijalva, U.S. Sen. Mark Kelly and Arizona Department of Water Resources Director Tom Buschatzke.",
    "\"If our tribal communities aren't doing great, if our rural areas aren't doing great, then the city of Phoenix and the other urban areas aren't going to do great as well,\" he said.",
    "Those plans include WaterSMART grants, rural water projects, water conservation and recycling, dam safety and protecting water supplies for communities and the environment.",
    "The statement also said tribes would be eligible for more funding for what the Interior Department called \"much-needed investments\" in tribal communities and economies.",
    "Our historic investments will strengthen water systems, update critical infrastructure and create jobs.”\nSinema was co-author and negotiator of the bipartisan measure.",
    "On her tour of the Gila River community, she saw shovel-ready projects, including well sites that will eventually make use of the water the tribe has been banking.",
    "\"Water is a sacred resource, and water rights are crucial to ensuring the health, safety and empowerment of tribal communities,\" Haaland said in the statement.",
    "\"The community looks forward to continuing to work together to address the water and drought conditions in Arizona and along the Colorado River,” he said.",
    "Several tribes in Arizona have long had to deal with inadequate water supplies, tainted waters from uranium or arsenic, and outdated sanitation systems.",
    "Nationwide, reports estimate that about 48% of homes in tribal lands lack access to clean drinking water, reliable water sources or adequate sanitation.",
    "The White Mountain Apache Tribe has waited about 40 years to build a new water system, while an estimated 30 to 40% of Navajo homes lack running water.",
    "They have also imposed or are in the process of imposing conservation measures to deal with a long-term drought that has shrunk the river's flow.",
    "“Securing Arizona’s water future means ensuring the federal government follows through on its commitment to our tribal communities,\" Kelly said.",
    "Lewis posted a recap of the meeting on his Facebook page:\nHaaland also announced a new Indian Water Rights Settlement completion fund committee.",
    "Haaland, a member of the Laguna Pueblo, met with Arizona tribal leaders Monday and visited the Gila River Indian Community Tuesday morning.",
    "Haaland laid out plans for using the infrastructure money to fund specific Indian water rights settlements, including several in Arizona.",
    "The funding applies to settlements enacted by Congress as of Nov. 15, when President Joe Biden signed the Bipartisan Infrastructure Law.",
    "Debra Krol reports on Indigenous communities at the confluence of climate, culture and commerce in Arizona and the Intermountain West.",
    "Coverage of Indigenous issues at the intersection of climate, culture and commerce is supported by the Catena Foundation.",
    "Haaland also said the Navajo-Utah Water Rights Settlement and Navajo-Gallup Water Supply Project would receive funding.",
    "She highlighted addressing drought and wildfires, strengthening the nation-to- nation relationship with Indian tribes.",
    "\"So much of what the Interior Department is working on is happening right here,\" said Haaland.",
    "Stanton also thanked Haaland for taking the time to learn about Arizona's water issues.",
    "The committee will recommend future allocations of the completion fund to Haaland.",
    "The measure would provide about $6.7 billion for water infrastructure projects.",
    "Michael Bennet of Colorado and Martin Heinrich of New Mexico.",
    "Reach Krol at debra.krol@azcentral.com.",
    "Gila River Indian Community Gov.",
    "Follow her on Twitter @debkrol."
  ]
}