{
  "id": 333,
  "mediaId": 2636,
  "date": "2022-02-21",
  "headline": "Your Monday Evening Briefing",
  "image": "https://static01.nyt.com/images/2022/02/21/world/21evening-PROMO-01/21ukraine-ledeall-02-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/21/briefing/russia-ahmaud-abery-winter-olympics.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He demanded that Ukraine “immediately cease military action” and warned that, “if not, the complete responsibility for the possibility of a continuation of bloodshed will be fully and wholly on the conscience of the regime ruling the territory of Ukraine.”\nIn response to Russia’s recognition, the Biden administration said it would impose limited sanctions on the two separatist regions, but it did not impose any penalties directly on Russia.",
    "President Vladimir Putin ordered Russian troops to be sent to Ukraine’s breakaway regions for “peacekeeping functions.”\nThe Kremlin published decrees shortly after Putin recognized the independence of Donetsk and Luhansk, the two territories in eastern Ukraine controlled by Moscow-backed separatists.",
    "Late last year, the government sent thousands of letters to minority farmers who were behind on their loan payments warning that they faced foreclosure, including about a third of the 15,000 socially disadvantaged farmers who applied for the debt relief, according to the Agriculture Department.",
    "The four Democratic senators most at risk — Raphael Warnock of Georgia, Mark Kelly of Arizona, Catherine Cortez Masto of Nevada and Maggie Hassan of New Hampshire — are facing tough campaigns because of inflation, voter anger and sinking approval of President Biden.",
    "The closing ceremony in the Chinese capital on Sunday was a display of theater, music and cultural traditions that did not dwell on the troubles surrounding the Games — concerns about China’s human rights record, a doping dispute and the coronavirus.",
    "An outright attack by Russian troops could cause dizzying spikes in energy and food prices, worsen inflation fears and spook investors, a combination that would threaten investment and growth in economies around the world.",
    "In this unique ecosystem, which encompasses the largest subtropical wilderness reserve on the North American continent, Hiltner saw wading birds, American alligators, dolphins, bull sharks and a wealth of colorful flora.",
    "Russia provides more than a third of Europe’s natural gas, which heats homes, generates electricity and powers factories, and the tensions are driving some energy prices up fivefold, upending people’s lives.",
    "In his closing argument today, a federal prosecutor said the “defendants didn’t show Ahmaud Arbery the dignity that a dog deserves when it gets hit by a car” and that the actions of the men were about race.",
    "Lawsuits from white farmers have blocked $4 billion of pandemic aid that was allocated to Black farmers, a group that has endured decades of discrimination from banks and the federal government.",
    "The ruling by Colombia’s Constitutional Court decriminalized abortions in the first 24 weeks of pregnancy and set the stage for the government in Bogotá to regulate the process further.",
    "A lawyer for one of the defendants argued that his client wanted to stop Arbery because he suspected him of being involved in crimes in his neighborhood, not because he was Black.",
    "Jurors in the hate crimes trial of Ahmaud Arbery’s murderers are deliberating over one question: Did the three white men kill the young Black man because of the color of his skin?",
    "President Biden’s promise of severe sanctions against Russia and the possibility of retaliation by Moscow have sent Russian stocks sinking and driven up gas and oil prices.",
    "Western leaders fear that the move could be a prelude to a full-scale invasion of Ukraine that would set off one of the biggest conflicts in Europe since World War II.",
    "In London, Prime Minister Boris Johnson said it was time to live with the coronavirus, announcing an end to England’s remaining restrictions and most free testing.",
    "Queen Elizabeth, who turns 96 in April, tested positive for Covid over the weekend, and was “experiencing mild, coldlike symptoms,” Buckingham Palace said Sunday.",
    "As people around the world grapple with the prospect of living with the virus, one question looms large: How soon before they need another Covid vaccine shot?",
    "Stephen Hiltner reworked his itinerary and planned for a less ambitious loop between remote campsites, with fewer miles and more time for close observation.",
    "The decision came as the U.S. has been moving in the opposite direction, with the U.S. Supreme Court considering a case that could overrule Roe v. Wade.",
    "After a storm disrupted plans for a 99-mile paddling tour of Florida’s Everglades, a Times journalist’s trip on the water took a more reflective turn.",
    "Now it’s 150,000 copies of a 626-page book called “Moon Witch, Spider King,” a fantastical epic that draws on African mythology, by Marlon James.",
    "But over the course of the trial, no evidence has been presented that shows that racist slurs and insults were aimed specifically at Arbery.",
    "A lot of attention around the November midterm elections has focused on the House, but the Democrats’ Senate majority is also in play.",
    "“I love seeing reactions from these young adults who grew up with Arthur,” Brown said of his character, an 8-year-old aardvark.",
    "We also spoke to Marc Brown, the creator of the beloved PBS children’s series “Arthur,” about the show’s end after 25 seasons.",
    "One of those maps creates an unlikely political marriage between conservative Staten Island and liberal Park Slope, Brooklyn.",
    "The result was a “transformational experience” in which he was able to look closely, listen intently and absorb the scenery.",
    "A top court decriminalized abortion in Colombia, the third major Latin American country to allow access to the procedure.",
    "In an address to the nation, Putin made the case that Ukraine was, by history and makeup, an integral part of Russia.",
    "Courts in Wisconsin and Florida sided with plaintiffs who argued that the debt relief amounted to discrimination.",
    "Mexico’s Supreme Court decriminalized abortion in September, and Argentina’s Congress legalized it in late 2020.",
    "It follows years of organizing by women across Latin America for more rights, including access to abortion.",
    "In horse racing: Medina Spirit was stripped of the 2021 Kentucky Derby win, and its trainer was suspended.",
    "State-by-state fights over redrawing districts will also play a central role in the midterms.",
    "A class-action lawsuit against the Agriculture Department is proceeding in Texas this year.",
    "The new map will aid Democratic efforts to win a Republican-held House seat in New York.",
    "He appeared to lay the groundwork for action beyond recognizing the breakaway republics.",
    "The jury spent hours listening to evidence that the defendants harbored racist beliefs.",
    "Not for many months, and perhaps not for years, according to a flurry of new studies.",
    "The countdown to the next edition — in Milan and Cortina, Italy, in 2026 — has begun.",
    "It started as a Word document, typed out letter by letter at a dining room table.",
    "Australia welcomed international visitors for the first time in nearly two years.",
    "This is how vats of ink and 800-pound rolls of paper become a printed book.",
    "After more than two weeks of competitions, the Beijing Olympics are over.",
    "These are our photographers’ favorite images from the Winter Olympics.",
    "The threat of war in Ukraine has already taken an economic toll.",
    "Israel will reopen to all foreign tourists, starting next week.",
    "If you’re in the mood to play more, find all our games here.",
    "also condemned Putin’s move and vowed to impose sanctions.",
    "Here are today’s Mini Crossword, Spelling Bee and Wordle.",
    "(About 1.8 million coronavirus tests were administered.)",
    "Here’s how U.S. abortion law compares to other nations.",
    "He also set the record straight on a few fan theories.",
    "And finally, a world of gators, dolphins and sharks.",
    "We followed one novel through the printing process.",
    "Your Evening Briefing is posted at 6 p.m. Eastern.",
    "Have you ever wondered how a book becomes a book?",
    "Eve Edelheit compiled photos for this briefing.",
    "(Want to get this newsletter in your inbox?",
    "These are seven Winter Olympians to watch.",
    "Black farmers were promised debt relief.",
    "Here’s the latest at the end of Monday.",
    "The colt failed a drug test last year.",
    "They got foreclosure notices instead.",
    "Let us know at briefing@nytimes.com.",
    "The world’s reopening continues.",
    "What do you want to see here?",
    "Have an unspoiled night.",
    "Here’s the sign-up.)",
    "Leaders of the E.U.",
    "It could get worse.",
    "What did you like?",
    "Good evening.",
    "10.",
    "9.",
    "8.",
    "3.",
    "4.",
    "7.",
    "6.",
    "5.",
    "1.",
    "2."
  ]
}