{
  "id": 3385,
  "mediaId": 2528,
  "date": "2022-01-29",
  "headline": "James Carville says Kyrsten Sinema won't win a Democratic primary against Ruben Gallego if she runs for reelection in 2024",
  "image": "https://i.insider.com/61f5afc1415c3f0018d394e1?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/carville-sinema-gallego-2024-arizona-democratic-senate-primary-strong-challenger-2022-1",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    0
  ],
  "sentences": [
    "As a Democrat representing one of the most conservative states in the country, Manchin's decision will be critical as the party's hopes to maintain and build on their majority will run through red states like West Virginia and Montana in an era where political polarization has become a huge part of the electoral landscape.",
    "In a recent Vox interview that was published on Thursday, Carville expressed confidence in Gallego's chances if he were to launch a primary run against the freshman senator, who was first elected in a 2018 race against then-Republican Rep. Martha McSally to great fanfare among state Democrats.",
    "Sinema has come under withering criticism by many Democratic voters and activists, with many Arizonans incensed that she declined to back filibuster reform to pass the party's marquee voting-rights bills and was critical of some elements of President Joe Biden's Build Back Better agenda.",
    "However, Carville was much more receptive to a 2024 reelection campaign by Democratic Sen. Joe Manchin of West Virginia, pointing to the senator's ability to win in 2018 despite representing a state that former President Donald Trump carried by overwhelming margins in 2016 and 2020.",
    "As the chief strategist of former President Bill Clinton's successful 1992 campaign, Carville helped the Democratic Party break a 12-year GOP lock on the White House and has expertise in crafting winning candidate messages.",
    "Last week, the Arizona Democratic Party censured Sinema for her vote to keep the 60-vote filibuster threshold in place in the upper chamber, arguing that voting rights were too important to fall by the wayside.",
    "The longtime Democratic strategist James Carville threw cold water on Sen. Kyrsten Sinema's chances for reelection if Rep. Ruben Gallego challenges her for the party's 2024 Senate nomination in Arizona.",
    "The only explanation people have given is that she wants to be the next John McCain,\" he said, referencing the late Arizona Republican senator and military war hero known for his political independence.",
    "However, Sinema represents a politically-competitive state that Biden won in 2020, and her seatmate is Democratic Sen. Mark Kelly, who is up for reelection this fall and backed filibuster reform.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "I've talked to people who know her and the only theory they have that makes any sense is that she views herself as some kind McCain-esque maverick.",
    "\"Understand that Joe Manchin is a Roman Catholic Democrat in a state in which not a single county has voted Democrat [for president] since 2008.",
    "During a recent CNN appearance, Gallego didn't say if he would run for the Senate but was critical of Sinema's tenure in office.",
    "AP Photo/Lynne Sladky\nCarville said Sinema won't defeat Rep. Gallego if he runs against her in a 2024 Democratic primary.",
    "\"She's not going to win a primary against Rep. Ruben Gallego, I'll tell you that damn much,\" he told the publication.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "The senator has come under fire for her refusal to change filibuster rules to pass voting-rights legislation.",
    "\"I've known Senator Sinema since we were both in our mid-20s and starting out in politics here in Arizona.",
    "\"And I will personally volunteer to help him fundraise because I think we can keep that seat if he runs.\"",
    "Manchin said last November that he was undecided on whether he'd run for the Senate again in 2024.",
    "But, he added, 'I think at this point right now she is really disappointing a lot of Arizonans.'\"",
    "When asked about Sinema, Carville told Vox that he has \"no idea what the hell she's thinking.\"",
    "The only consistency about Senator Sinema's roles and positions is inconsistency,\" he said.",
    "However, he was stumped when asked by Vox writer Sean Illing about Sinema's motivations.",
    "He continued: \"I've never met her, I have no idea what the hell she's thinking.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "He added: \"Politics is about choices, and he's up for reelection in 2024.",
    "If Manchin runs for reelection, I'll do everything I can to help him ...",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "I repeat: not a single county has voted Democrat since 2008,\" he said.",
    "Stay up to date with what you want to know.",
    "\"I can't explain it, and no one else can.",
    "The Democratic strategist James Carville.",
    "He added: \"2024 is a long time from now.",
    "Sign up for notifications from Insider!",
    "But look, I'm out of gas on this one.",
    "It ain't Joe Manchin or Ed Markey.",
    "It's really that damn simple.\"",
    "I never say no to the future.",
    "Loading Something is loading.",
    "You got to understand that.",
    "I'm focusing on 2022.",
    "I really am.\""
  ]
}