{
  "id": 3537,
  "mediaId": 8347,
  "date": "2022-01-27",
  "headline": "One-on-one with Senator Mark Kelly",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/74fc9d3/2147483647/strip/true/crop/2858x1500+0+51/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F18%2Fea%2F6357416d4437a0e8fe1657089d33%2Fscreen-shot-2022-01-27-at-8.54.01%20PM.png",
  "link": "https://www.kgun9.com/news/local-news/one-on-one-with-senator-mark-kelly",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bradbury",
  "authorUrl": "https://www.kgun9.com/greg-bradbury",
  "termIds": [
    0
  ],
  "sentences": [
    "\"As we come out of this pandemic, I think its important that we don't just bring back the jobs of the past but create the jobs of the future,\" Sen. Kelly said.",
    "Sen. Kelly recently met with the Secretary of Agriculture, Tom Vilsack, and farmers to discuss ways to keep the price at the grocery store down.",
    "During that time period gas prices were up 49.6%, energy costs were up 29.3%, and meats, poultry, fish, and eggs were up 12.5%.",
    "\"You can see a direct line between the education these students are getting here and the jobs of the future for our country.\"",
    "\"Families here in Arizona are paying over $3.50 a gallon for gas and you $5 a pound for ground beef,\" Sen. Kelly said.",
    "From December of 2020 to December of 2021, prices went up by 7%, according to the Bureau of Labor Statistics.",
    "Sen. Kelly said he is working with the Biden Administration to come up with solutions to the rising prices.",
    "TUCSON, Ariz. (KGUN) — On Thursday, Senator Mark Kelly toured the Pima JTED Bridges campus.",
    "We have issues at ports of entry getting containers off of cargo ships,\" Sen. Kelly said.",
    "During his visit he met with students and staff while discussing workforce development.",
    "He added that a labor shortage is a contributing factor to rising consumer prices.",
    "Sen. Kelly said that right now the workforce needs more people.",
    "\"That supply shortage creates an increase in price.\"",
    "----\nSTAY IN TOUCH WITH US ANYTIME, ANYWHERE",
    "\"We have a shortage of truck drivers.",
    "\"That's expensive.\""
  ]
}