{
  "id": 3573,
  "mediaId": 2658,
  "date": "2022-01-19",
  "headline": "Senate Dems' filibuster ambitions fall short",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1155968404/abd90c63-7272-46dd-b7f3-709bea73acbe/51652821-7235-4a84-ad45-ba5825b72292/1280x720/match/image.jpg",
  "link": "https://www.politico.com/news/2022/01/19/democrats-senate-rules-change-527366",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2005,
    4597,
    2976,
    5510,
    5381,
    5311,
    5879,
    388,
    1489
  ],
  "sentences": [
    "He also criticized Schumer for not allowing enough time to debate the elections legislation and accused his party of trying to take the “easy way out.”\n“I cannot support such a perilous course for this nation when elected leaders are sent to Washington to unite our country, not to divide our country,” Manchin said.",
    "Sen. Sheldon Whitehouse (D-R.I.) said the reasoning behind the failed vote “depends on whether you see this as the end of what we’re trying to accomplish or the beginning.”\n“If you see this as the beginning, it’s self-evident that you have to let everybody know where the votes are,” he said.",
    "By Marianne LeVine and Burgess Everett\n 01/19/2022 11:59 AM EST\nUpdated: 01/19/2022 10:43 PM EST\nSenate Democrats failed in a Wednesday night bid to weaken the filibuster to pass elections and voting reform thanks to opposition from centrists Joe Manchin and Kyrsten Sinema.",
    "Kelly said he’s discussed the matter with Sinema, though he arrived at the opposite conclusion about the filibuster: “I talk to her about this and other things a lot.”\n“Eighty percent of Arizonans vote by mail and this is going to be harder for them next election cycle.",
    "“Particularly when this rule was not always in existence and not envisioned by the founders.”\nThe day was marked by lengthy debate and speeches, including the occasional back-and-forth between Democrats and Republicans that’s not often seen in the modern Senate.",
    "Sinema has warned that watering down the 60-vote threshold will empower wild legislative swings when Republicans take back Congress and the White House, while Manchin says the higher threshold encourages compromise in an increasingly divisive environment.",
    "Senate Majority Leader Chuck Schumer acknowledged the difference of opinion within his caucus over keeping the 60-vote threshold required to pass most bills, but argued that the changes Democrats are “limited” and would only apply to election reform.",
    "It’s time to do the hard work to forge a difficult compromise that can stand the test of time.”\nPrior to the vote, Manchin probed Sen. Jeff Merkley (D-Ore.) about why Senate Democrats couldn’t move to a talking filibuster without the rules change.",
    "Collins reiterated she supports the Voting Rights Act of 1965 and highlighted her vote to reauthorize the legislation in 2006, noting that there are “enormous differences” between that bill and the elections reform Democrats are considering.",
    "She optimistically compared it to a scene in the movie “Princess Bride,” when Miracle Max helps bring a character back to life that he describes as “mostly dead” but also “slightly alive,” according to people familiar with her remarks.",
    "The update Democrats aim to pass would require that jurisdictions with a history of discriminatory voting laws receive approval from the Department of Justice or D.C.’s federal district court for any changes to election laws.",
    "In a 48-52 vote, the Senate rejected an effort to reinstate what’s known as the “talking filibuster” that would have specifically allowed the elections legislation to pass by a simple majority vote, after a lengthy debate.",
    "“Tonight, for the first time in history, almost an entire political party will write in permanent ink that they would shatter the soul of the Senate for short-term power,” McConnell said ahead of the rules change vote.",
    "In addition, Democrats have included a bill named after the late Rep. John Lewis (D-Ga.) in the voting reform package, which would restore a provision in the Voting Rights Act previously gutted by the Supreme Court.",
    "Senate Democrats are seeking to pass legislation that would end partisan gerrymandering, increase disclosure requirements on “dark money” donations, expand early voting and designate Election Day a federal holiday.",
    "Their Democratic colleagues strongly disagree, positing that a flurry of new, GOP-backed state laws regulating ballot access should prompt the 50-member majority to change the fabric of the Senate.",
    "In 2017, then-Senate Majority Leader Mitch McConnell used the nuclear option to take the rules change a step further, allowing Supreme Court nominees to be confirmed by simple majority.",
    "“Even if you think the filibuster is a good thing, isn’t protecting voting rights and preventing their diminution more important?” Schumer asked ahead of the final rules change vote.",
    "A bipartisan group of senators, which includes Manchin and Sinema, recently formed to discuss potential updates to the 1887 Electoral Count Act and other election-related proposals.",
    "McConnell resisted weakening the legislative filibuster under former President Donald Trump and publicly praised Manchin and Sinema’s defense of the 60-vote threshold on Wednesday.",
    "Speaking to her caucus on Wednesday morning, Speaker Nancy Pelosi said Democrats’ push on voting reforms was still ongoing, despite centrist opposition to changing the filibuster.",
    "Progressives had hoped the stalled elections bill would lead Manchin and Sinema to change their defense of the Senate’s 60-vote threshold, but the two centrists remained unmoved.",
    "Susan Collins (R-Maine) and Jon Ossoff (D-Ga.) engaged in a dispute after Ossoff suggested in a floor speech that Collins’ position on the Voting Rights Act was inconsistent.",
    "She added that had she been on the floor during the speech, she would have considered calling out Ossoff under Senate rules for singling out her and other Republicans.",
    "Meanwhile, the Congressional Black Caucus held a press conference outside the Senate chamber to pressure the 52 members who plan to vote against the rules change.",
    "Despite endorsing their own changes to the Senate rules on nominations, Republicans criticized the Democratic push to extend reform to the legislative filibuster.",
    "In 2013, then-Senate Majority Leader Harry Reid invoked the nuclear option to lower the threshold for executive branch and lower-court judicial nominees.",
    "Throughout the day, most Senate Democrats, including Manchin and Sinema, sat together on the Senate floor listening to one another’s speeches.",
    "The outcome of the rules change vote, while entirely predictable, was the culmination of several futile attempts to pass election reform.",
    "It is rare for majority leaders to lose a push to change the rules along simple majority lines, known as invoking the nuclear option.",
    "said if the GOP retakes the Senate, Democrats’ Wednesday vote won’t prompt the GOP to gut the legislative filibuster in the future.",
    "After saying last year that “failure is not an option,” Schumer said Wednesday that “inaction is not an option” for the party.",
    "Despite Manchin and Sinema’s opposition, Schumer won over some of the few remaining undecided Democrats on Wednesday.",
    "But Manchin reiterated on the floor that he would not vote to change the rules, sealing the fate of Wednesday’s vote.",
    "Sen. Mark Kelly (D-Ariz.) endorsed a rules change specific to elections legislation, and Sens.",
    "Manchin (D-W.Va.) and Sinema (D-Ariz.) joined all 50 Senate Republicans to block the change.",
    "After more than 12 hours in session, the Senate finally proceeded to the rules change vote.",
    "Merkley replied that it’s difficult to get to a final vote without changing Senate rules.",
    "Democrats, however, have not proposed a plan to overcome Manchin and Sinema’s opposition.",
    "And McConnell used it again in 2019 to speed up the confirmation of lower-level nominees.",
    "Some Democrats predicted the saga will play out far beyond Wednesday evening.",
    "And that’s not positive for our democracy,” Kelly said in an interview.",
    "“That contradicts everything we’ve said … that is not an option for us.",
    "“And putting politics and party aside is what we’re supposed to do.",
    "So far, Republicans have been receptive to only limited reforms.",
    "The path forward on elections and voting reform is unclear.",
    "He also accused Schumer of failing to protect the Senate.",
    "Dianne Feinstein (D-Calif.) and Chris Coons (D-Del.)",
    "If it were we would have done it,” Thune said.",
    "also announced that they’d back the effort.",
    "Senate Minority Whip John Thune (R-S.D.)",
    "At one point in the evening, Sens."
  ]
}