{
  "id": 3659,
  "mediaId": 8475,
  "date": "2022-01-21",
  "headline": "Ducey: I’m still not running for Senate",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/012122_011422_ducey_sots-2186.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/012122_ducey_senate/ducey-im-still-not-running-senate/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    1727,
    2459,
    2765,
    2915,
    4905,
    1489,
    392,
    1126,
    5949
  ],
  "sentences": [
    "“He will never have my endorsement or the support of MAGA Nation!”\nAttorney General Mark Brnovich, energy company founder Jim Lamon, former tech company executive Blake Masters, former Arizona National Guard head Mick McGuire and Corporation Commissioner Justin Olson are vying for the GOP nomination in the Senate race.",
    "The Politico article was based entirely on anonymous “state political insiders” who think the governor is planning a last-minute entry into the race, based largely on his pointed criticism of President Joe Biden and the federal government in his Jan. 10 State of the State speech.",
    "Most notably, former President Donald Trump, an erstwhile ally, has repeatedly castigated him for certifying the results of the 2020 presidential election in Arizona, in which Trump lost to President Joe Biden.",
    "“Rumors are that Doug Ducey, the weak RINO Governor from Arizona, is being pushed by Old Crow Mitch McConnell to run for the U.S. Senate,” the former president said in a statement.",
    "Ducey has long been a target of national Republicans, including Senate Majority Leader Mitch McConnell, but he has repeatedly refused entreaties to run for the Senate.",
    "Ducey on Thursday rebutted a recent Politico article that claimed he might join the Republican primary field for this year’s Senate race.",
    "The governor, who is term-limited and leaving office after this year, has repeatedly stated that he won’t run for the Senate this year.",
    "“To many Arizona Republicans, he didn’t sound like a man who believes his political career is winding down this year,” Politico wrote.",
    "This isn’t the first time Ducey’s name has come up as a potential GOP candidate against Democratic U.S. Sen. Mark Kelly.",
    "Ducey has publicly rejected the false and baseless claims that the election in Arizona was rigged against Trump.",
    "Were Ducey to run, he would bring high name ID and tremendous fundraising prowess to the race.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "Doug Ducey as a possible U.S. Senate candidate, and again, he’s shooting the rumors down.",
    "He has in the past definitively stated that he won’t run.",
    "Following the Politico story, Trump lashed out at Ducey.",
    "“The answer hasn’t changed,” Ducey said on Thursday.",
    "But he would come with liabilities as well.",
    "Again, national media are floating Gov.",
    "Like what you're reading?"
  ]
}