{
  "id": 3663,
  "mediaId": 8405,
  "date": "2022-01-16",
  "headline": "Trump rally in Arizona: Former president calls Biden 'a disaster' for the country",
  "image": "https://www.gannett-cdn.com/presto/2022/01/16/PPHX/a94bd343-c0fd-430b-8233-355b5cf85291-Former_President_Donald_Trump_at_Save_America_rally_in_Florence_Ariz._Jan_15_2022_Patrick_Breen.png?crop=1325,745,x0,y132&width=1325&height=745&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/01/14/trump-rally-arizona-live-updates-florence/6529316001/",
  "mediaOutlet": "Phoenix Arizona News: Breaking news, local headlines - azcentral.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Tonight's rally will serve as little more than a reminder of the chaos and extremism of today’s Republican Party, and why 81 million Americans rejected Donald Trump in 2020 to elect President Biden, Vice President Harris, and Democrats who have led the fastest economic recovery in history, delivered a Bipartisan Infrastructure Law to repair Arizona’s roads and bridges, gotten Americans vaccinated, and helped create over 6 million jobs.”\n— Kathy Tulumello\n7 p.m.: Kari Lake vows no COVID-19 mandates, calls out migrants, Biden\nRepublican gubernatorial candidate Kari Lake began her speech echoing the theme of some of the other speakers, praising America under Trump and listing its problems under Biden.",
    "It described the “undersigned” as the “duly elected and qualified Electors for President and Vice President of the United States of America from the State of Arizona …”\nReferring to complaints that he and those electors should be criminally charged, Kern said the “real criminals are the ones who stole the election.”\nSen. Wendy Rogers, R-Flagstaff, and Rep. Mark Finchem, R-Oro Valley, who’s running for Arizona secretary of state, continued that tack.",
    "Trump!” as the former president’s helicopter descended to the festival grounds shortly after 5:30 p.m. “Welcome to Arizona, Mr. President!”\nOn Dec. 14, 2020, Kern and 10 other Arizonans, including state GOP Chair Kelli Ward and Rep. Jake Hoffman, R-Queen Creek, signed a document that was sent to Congress with a false avowal that they constituted Arizona’s official vote in the Electoral College.",
    "Borrelli said that many of his peers in the Arizona House and Senate were behind him and other election deniers and that they were going to “tighten up the loopholes that these commie (expletive) have exploited.”\nThe crowd cheered as Borrelli claimed that the “shamestream media” were hiding facts like “ghost voters” he says were found to have voted in Pima County in 2020.",
    "PAST COVERAGE BY THE REPUBLIC\nARIZONA ELECTION REVIEW DISCREDITED: 'Results were meaningless': Analysts say they cannot validate or replicate Cyber Ninjas' hand count of votes\n10 p.m.: Speech hits mark with Florence crowd\nWearing a pink Trump cowboy hat and clutching several \"Let’s Go Brandon” hats, Kaia Sisk of Mesa clung on the former president’s every word.",
    "Borrelli pushed back on the fact that the belief in widespread election fraud that stole the presidency from Trump in 2020 was a “conspiracy theory.” He said there was indeed a conspiracy, but he claims \"it’s not a theory.”\nHe said the problem was “obstructionists” who oversee elections at the Arizona Secretary of State’s Office and in Maricopa County.",
    "Crowd: Trump\nMany — if not most — people in the crowd seemed to believe Trump’s insistence that he really won the election by “a lot.” A year of investigation, numerous courts throwing out lawsuits claiming they had evidence of fraud and the results of the audit authorized by the Arizona Senate did not seem to deter crowd members from their belief.",
    "“We are being invaded, and China is pushing deadly fentanyl through Mexico,” said Lake, who then addressed Biden: “It’s going to stop with me … We do not need your protection, your permission to defend our state.”\nShe vowed to finish building Trump’s border wall in Arizona, sparking crowd members to chant, “Build that wall!",
    "“To the people flooding across our border: When I’m governor, you will be arrested and sent back across the border.”\nIt’s unclear exactly how she would do that without federal cooperation, but her comments echoed those at a news conference on border security on Tuesday by state lawmakers and Ken Cuccinelli, a former U.S.",
    "Many topics will be discussed including the Rigged Presidential Election of 2020, the fake Big Lie, the corrupt LameStream Media, the Afghanistan disaster, Inflation, the sudden lack of respect for our Nation and its leaders, and much more,\" Trump said in a written statement Friday.",
    "That’s a baby.”\nPray said Lake represents Arizona, “she represents us.”\n— Robert Anglen\n7:20 p.m.: Democrats issue statement on Trump rally\nDemocratic National Committee spokesperson Adonna Biel released a statement before former President Donald Trump spoke in Florence.",
    "— Ray Stern and Richard Ruelas\n6:10 p.m.: State senators continue to claim election fraud\nState lawmakers Sen. Sonny Borrelli, R-Lake Havasu City, and Sen. Kelly Townsend, R-Mesa, told the crowd to stay committed to the election denial conspiracy, as they would.",
    "“Let’s restore integrity to our election.”\nMany of the people in the crowd wore colorful costumes, Trump apparel and shirts supporting Trump or Arizona Republican candidates for office such as gubernatorial candidate Kari Lake or U.S. Senate contender Jim Lamon.",
    "— Ray Stern\n4:45 p.m.: Speaker lineup includes Lake, 3 members of Congress\nBesides Trump, speakers were expected to include several politicians who have spread falsehoods about the 2020 election and supported rioters who invaded the U.S. Capitol on Jan. 6, 2021.",
    "“Ducey has been a terrible, terrible representative of your state.”\n— Ronald J. Hansen\n8:25 p.m.: Trump denounces prosecution of Jan. 6 rioters\nDonald Trump blasted the House of Representatives select committee investigating the Jan. 6 riot at the U.S. Capitol.",
    "Her wide-ranging comments touched on COVID-19 mandates that she said “people are no longer willing to put up with.”\nClaiming she was up “30 points” or more in polls of voters, Lake said, “There will be no mandates and no lockdowns” with her as governor.",
    "Seeming to address concerns by many Republicans about the election system, Ward urged people to “please, please go out and vote.”\nWard claimed that “cheating” also occurred in 2016, but “we overwhelmed their cheating algorithm.”\n“Get rid of Dominion!",
    "Tamera Rayl of Tucson, who was hanging out on a blanket with family members, said she believes Biden won through fraud and hopes Arizona lawmakers “get rid of the machines” used in elections and go back to paper ballots that would be hand-counted.",
    "“And I have found in the past, in my career, when I have focused on the work on my desk and done it with excellence, other opportunities present themselves.”\nAsked if Ducey would go to Trump’s rally on Saturday, governor’s spokesman C.J.",
    "Asked early last week what his future holds after his final year as governor, Ducey said he was focused on leading the state and running the Republican Governors Association, which seeks to elect Republican governors across the country.",
    "— Robert Anglen\nEarly Friday afternoon: Vendors gear up for Trump rally\nDays before Donald Trump's rally in Florence, merchandise vendors were staking out highway pullouts and setting up roadside stands more than 20 miles away.",
    "— Robert Anglen\n9:15 p.m.: Trump uses rally to bash Biden, Ducey\nFormer President Donald Trump used his 93-minute remarks at his rally in Florence to give a fresh blistering to his usual foils President Joe Biden, Arizona Gov.",
    "“He will never have my endorsement or the support of MAGA Nation!”\nDucey often bristles at any question about whether he will seek the GOP nomination to challenge U.S. Sen. Mark Kelly, D-Ariz., for his seat later this year.",
    "Trump called the officer who fatally shot Ashli Babbitt inside the Capitol a “dope.”\nTrump pointed to social protests during 2020 and asked why the Department of Justice wasn’t going after people who participated in them.",
    "But rumors abound nevertheless, in part thanks to high-ranking Republicans in Washington, D.C., including Senate Minority Leader Mitch McConnell, R-Ky., who are urging establishment Republicans including Ducey to run.",
    "— Stacey Barchenger\nFriday afternoon: ReAwaken America Tour leads to police calls at Dream City Church\nA conservative forum in Phoenix overlapping Donald Trump's return to Arizona opened Friday with calls to police.",
    "He called the U.S. prosecution of defendants charged with storming the Capitol an “appalling persecution of political prisoners.”\nHe said many of the people at the Capitol were FBI informants, not Trump supporters.",
    "Citizenship and Immigration Services official under Trump, who claimed that the “self-defense clause” in the U.S. Constitution allows states to take action even without the federal government in times of invasion.",
    "— Robert Anglen\n7:25 p.m.: Former President Trump takes the stage\nAfter more than two hours of speeches by other politicians, Trump took the stage at 7:17 p.m. with Lee Greenwood's \"God Bless the USA\" playing.",
    "Other topics include pinpointing where the world is on the Biblical timeline, communicating after the power grid is destroyed and \"Jesus is King & Donald Trump is the REAL president of the United States.\"",
    "— Robert Anglen\n5:15 p.m.: Spending time with 'thousands of people who feel the same way'\nTwo Arizona social workers said their biggest reason for attending the Trump rally is concern for their clients.",
    "As did others, she called Trump “president” and slammed the 2020 election as “rotten to the core.”\nShe vowed to “close every single loophole that allows them to cheat,” though she didn’t give details.",
    "“So many people have left their jobs at the state that we cannot get services for people.”\nThe \"Great Resignation\" has left the agency with such a backlog that workers are struggling to get to them.",
    "Dream City has hosted a number of conservative events, including a June movie premiere touting 2020 election conspiracies by key operatives in the Arizona Senate's largely discredited ballot review.",
    "“There is no way under this administration that I can move forward with my dreams.”\nLofgren said a year ago she was preparing to build a home in Mississippi but abandoned those plans as costs rose.",
    "Townsend and Borrelli were among 30 current and former Arizona lawmakers who signed a resolution asking for the 2020 election to be handed to Trump or for the election certification to be delayed.",
    "— Ray Stern\n3:55 p.m.: Crowd gathers for speeches, rally\nThousands of spectators began to gather Saturday afternoon at the Country Thunder festival grounds, with traffic backups on State Route 79.",
    "— Kathy Tulumello\n7:25 p.m.: Gubernatorial candidate captures hearts in crowd\nKari Lake took to the stage with a canned soundtrack of applause booming out of the speakers – but she didn’t need it.",
    "“Everything she said needs to happen … She’s going to get something done for Arizona.”\nHarless, who turned 70 last year, had never attended a political rally before coming to Florence Saturday.",
    "By state statute, the only electors who mattered were those pledged to cast their votes for President-elect Joe Biden and Vice President-elect Kamala Harris, as they did Dec. 14, 2020, at noon.",
    "“Let there be no mistake, the Republican Party has surrendered to Donald Trump’s stranglehold and fully embraced him no matter the cost to our democracy or Americans’ lives,\" it read in part.",
    "… He’s incapable.”\nTrump kept much of his speech focused on Biden, noting the president’s dismal approval ratings and accusing him of being clueless on tackling the nation’s current problems.",
    "At the same time, Trump described the supporters he spoke to from the Ellipse, near the White House, on Jan. 6 before the attack on the Capitol as one of the largest crowds he’s ever seen.",
    "And he said her criticisms of Dr. Anthony Fauci, the head of the National Institute of Allergy and Infectious Diseases and chief medical adviser to the president on COVID-19, were welcome.",
    "Trump's appearance Saturday will be his second in the state since leaving office and underscores his continued importance in GOP circles nearly one year after departing the White House.",
    "“We want indictments of the election workers so that they don’t continue to do this,” she said before going on to condemn “medical tyranny” she sees in COVID-19 emergency measures.",
    "She believes like-minded Republicans will still be “mad enough” over the 2020 election results to show up at the polls this year despite beliefs that the election system is broken.",
    "Early in his remarks, which ended at 8:51 p.m., Trump cast Biden's administration as an unfolding disaster and continued his baseless claims of widespread election fraud in 2020.",
    "The festival atmosphere included food trucks, loudspeakers blaring a mix of country and classic rock, long lines for the portable toilets and a stage with bleachers for VIPs.",
    "Flags and T-shirts fluttered around canopies in at least three spots within a mile of each other Friday on Hunt Highway just over the Maricopa County line in San Tan Valley.",
    "— Ray Stern\n5:30 p.m.: Traffic jams delay Trump fans outside venue\nTraffic for the Trump rally was backed up for more than an hour outside Country Thunder in Florence.",
    "Hunt Highway is one of the central routes for people driving from the East Valley to the Country Thunder venue, where Trump is scheduled to speak at 7 p.m. Saturday.",
    "“Rumors are that Doug Ducey, the weak RINO Governor from Arizona, is being pushed by Old Crow Mitch McConnell to run for the U.S. Senate,” Trump said in a statement.",
    "Election fraud and pandemic conspiracies dominate the itinerary, including a speech titled, \"It’s the COVID-19 Protocols That Are Mass Murdering COVID-19 Patients.\"",
    "Anthony Kern, a former state representative who’s running for state Senate and who was in Washington near the U.S. Capitol on Jan. 6, 2021, began yelling, “Trump!",
    "Attendees at the ReAwaken America Tour at Dream City Church taunted teachers from the nearby BASIS Phoenix charter school over masks, school officials confirmed.",
    "The tour, hosted by conservative podcaster Clay Clark and featuring Trump's former National Security Adviser Michael Flynn, is scheduled to run through Saturday.",
    "Arizona Rep. Mark Finchem, R-Oro Valley, state Sen. Wendy Rogers, R-Flagstaff, and Arizona Republican Party Chair Kelli Ward are among the scheduled speakers.",
    "She reminded them that state Attorney General Mark Brnovich is investigating findings from the Senate-led audit and led people in a chant:\n“What do we want?",
    "Trump said the past year under Biden has been a \"disaster\" but said there would be a good political end to the \"catastrophe\" at the outset of the new year.",
    "Arizona Republic\nFormer President Donald Trump's first rally of 2022 will be in Florence, where several Republican candidates will take the stage as well.",
    "But Ducey's standard reply includes touting his day job as Arizona’s governor and pointing to early 2021, when he said he was not running for the seat.",
    "Crowd members may have been Republicans, but they were firmly committed to one man, Donald Trump, and the idea that Biden stole the election from him.",
    "Build that wall!”\n— Ray Stern\n6:40 p.m.: Members of Congress, candidates cheer Trump, boo others\nThe crowd booed the news media, booed Republican Gov.",
    "“Fauci is crooked as hell.”\nFor Lisa Pray, a soon-to-be-grandma from Dewey, it was Lake’s message of pushing anti-abortion legislation that moved her.",
    "Bobby Parsons of Cottonwood said he and his wife arrived at 1 p.m. and waited for more than three hours and still hadn't made it into the main arena.",
    "Gates opened at 2 p.m. More than a dozen ATVs lined State Route 79 just before the entrance, waving flags and cheering those lined up in their cars.",
    "A pastor at Dream City Church confirmed about a dozen Phoenix police officers responded to the event Friday and the issue had been \"taken care of.\"",
    "They include:\nU.S. Rep. Andy Biggs, R-Ariz.\nU.S. Rep. Paul Gosar, R-Ariz.\nU.S. Rep. Debbie Lesko, R-Ariz.\nState Rep. Mark Finchem, R-Oro Valley.",
    "“Our country is being totally destroyed.”\nTrump called the COVID-19 response under Biden a disaster, from vaccine mandates to testing shortages.",
    "She said she is proud Lake is willing to push “heartbeat laws” and showed a sonogram picture of her daughter’s new child: “That’s not a fetus.",
    "The document the Republicans signed, obtained from the National Archives last year by the group American Oversight, overlooked that detail.",
    "Townsend asked how many in the crowd had volunteered for the 2020 election or the Senate-led audit — dozens or more raised their hands.",
    "A single protester stood across from a Mercedes sedan on the entry road to the venue, waving a sign with the United States code on it.",
    "Doug Ducey, who has become a frequent punching bag for the former president ever since Ducey signed off on the 2020 election results.",
    "She gave a brief speech that began by asking the crowd to respond to the question “Who won the election?”\n“Trump!” the crowd roared.",
    "U.S. House members Debbie Lesko, Andy Biggs and Paul Gosar ripped Biden and exhorted the crowd to get ready for the next elections.",
    "Ron DeSantis is my guy.”\nThough people attending the event left happy, when they got to their cars their mood may have turned sour.",
    "The existential threat to liberty is one of the reasons Foright said he is in the process of moving from the Northwest to Florida.",
    "Her message of cracking down on undocumented immigrants, canceling mask mandates and anti-abortion legislation resonated strongly.",
    "Especially when it comes to protecting Americans and “when he talks about the danger to democracy and our freedom,” Foright said.",
    "\"Biden has utterly humiliated our nation,\" Trump said, saying that Russia and China's leaders no longer respect or fear America.",
    "“The country is being destroyed,” he said, after citing rising inflation and the nation’s disastrous retreat from Afghanistan.",
    "Many people leaving the venue had to wait more than an hour before they could exit the dirt parking lots and get on the road.",
    "The speech was an updated version of Trump’s usual America-first rhetoric, long on personal boasts and lacking in subtlety.",
    "Trump also renewed his grievances and cast his four years in office as a period of unprecedented prosperity and security.",
    "The women both said the country’s economic situation, with inflation and supply-chain issues, have taken a personal toll.",
    "His first sentences mentioned a \"rigged election,\" \"The Big Lie is a lot of bullshit\" and \"I ran twice and I won twice.\"",
    "Trump gave a preview of the Saturday rally that suggests he will continue pushing baseless claims of election fraud.",
    "They said the Biden administration’s handling of the economy has put people who need government services at risk.",
    "Let’s go, Brandon!”\nMany in the crowd responded in kind with the veiled, obscene insult of President Joe Biden.",
    "Doug Ducey, a fellow Republican who is mulling a run for the U.S. Senate against incumbent Democrat Mark Kelly.",
    "Doug Ducey and the media to the resounding support of the thousands of diehard supporters at Canyon Moon Ranch.",
    "The crowd included many young people and senior citizens, though most in attendance seemed to be middle-aged.",
    "“I can be with good friends and be with thousands and thousands of people who feel the same way,” she said.",
    "The line to the front gate snaked back and forth and trailed far into a dirt parking lot as people waited.",
    "Both women said they want to support President Donald Trump, who is the rightful leader of the country.",
    "John LeTourneau of Mesa used the same words to describe his adulation for Lake: “I love her,” he said.",
    "“I work for the State of Arizona in the Disability Division, said Colette Lofgren of Apache Junction.",
    "He’s fun.”\nJonathan Foright of Washington said Trump’s message Saturday was important and engaging.",
    "He mentioned unseating U.S. Sen. Mark Kelly, D-Ariz., in 2022 and electing Kari Lake as governor.",
    "Passing cars gave the occasional honk as they zoomed past on Friday, earning waves from vendors.",
    "“You know what day it is,” a voice said over the loudspeaker at about 4 p.m. “It’s Trump Day!",
    "Ducey\nHours before his appearance in Florence, Trump took yet another shot at Republican Gov.",
    "Kelli Ward, chair of the Arizona Republican Party, who took the stage first, made that clear.",
    "Diehard belief in the falsehood that Trump actually won the 2020 election was a strong theme.",
    "And if there's one message he hopes Trump delivers, it is: \"Tell Biden to get the hell out.\"",
    "All 11 people were listed on the general election ballot as the would-be electors for Trump.",
    "He said ReAwaken America rented space from the church but is not affiliated with the church.",
    "Vendors dragged tents, tables and Trump gear from the backs of vehicles beginning Wednesday.",
    "Wilson works for the Department of Child Safety and said the same issues plague her office.",
    "He called Joe Biden, who defeated him in the 2020 election, \"a disaster for this country.\"",
    "Follow coverage of the Trump rally by Republic reporters here throughout the day Saturday.",
    "Lake joined Trump on stage briefly and pledged, \"We will finish your big beautiful wall.\"",
    "Pima County election officials deny there were any widespread problems with the election.",
    "“They attacked Donald Trump because he exposed them and their evil deeds!” Finchem said.",
    "Now!”\nShe referred to unnamed enemies who are “constantly scheming” to steal elections.",
    "“She’s honest, sincere and wants to fix things that are wrong with Arizona,” he said.",
    "Harless said she thought Lake’s stance on border security was tough and direct.",
    "Wilson said she has attended several Trump rallies and enjoys the camaraderie.",
    "Parsons said he loved the energy of the crowd and couldn't wait to see Trump.",
    "The politicians who warmed up the crowd for Trump hammered home the points.",
    "The crowd embraced the former TV New anchor turned gubernatorial candidate.",
    "Anthony Kern, former state representative and candidate for state Senate.",
    "Boris Epshteyn, Trump strategic adviser and 2020 campaign board member.",
    "“He’s trying to do everything he can to protect that freedom,” he said.",
    "He said several armed private security guards were hired by the event.",
    "— Robert Anglen\n10:30 a.m.: What's on Trump's list of talking points?",
    "“Why aren’t they doing it to Antifa and Black Lives Matter?” he said.",
    "LeTourneau said he will have no trouble voting for her for governor.",
    "He praised her stance on the border and keeping elections secure.",
    "“He’s not going to get my endorsement,” Trump said of Ducey.",
    "“We are so blessed to have Donald Trump with us here today.",
    "Ducey had certified the election results in late November.",
    "“I’m proud I was the anti-mandate president,” Trump said.",
    "And while Trump was the headliner, Lake stole her heart.",
    "“I was getting to the age of retirement,” Lofgren said.",
    "— Robert Anglen\n4:55 p.m.: Ward: Who won the election?",
    "Her friend Sandra Wilson of Mesa nodded in agreement.",
    "\"Look forward to seeing everyone in Arizona tomorrow!",
    "— Ronald J. Hansen\n9 a.m.: Trump takes a shot at Gov.",
    "“My plate is full,” Ducey told The Arizona Republic.",
    "Kelli Ward, chair of the Arizona Republican Party.",
    "Alveda King, 2020 campaign advisory board member.",
    "\"It's going to be good weekend,\" one seller said.",
    "“There was no way I can build a house,” she said.",
    "“If he decides not to run in 2024, (Florida Gov.)",
    "Trump repeated his criticism of former ally Gov.",
    "“Can you feel the storm building?” Gosar asked.",
    "Karamargin said Ducey had “no plans” to attend.",
    "We know the election was stolen,” Rogers said.",
    "And he hopes he will run again for president.",
    "She also called out migrants without papers.",
    "Kari Lake, candidate for Arizona governor.",
    "“I love her,” said Evelyn Harless of Mesa.",
    "“She is just true to her word,” she said.",
    "“I like people coming into this country.",
    "“We gave Biden every tool he could want.",
    "\"Big crowds, will also be covered on TV.",
    "I just want it done legally,” she said.",
    "Florence was Sisk’s third Trump rally.",
    "Doug Ducey and booed election workers.",
    "State Sen. Wendy Rogers, R-Flagstaff.",
    "Get rid of drop boxes!” she shouted.",
    "State Sen. Kelly Townsend, R-Mesa.",
    "Foright called Trump a good man.",
    "But he didn't mind, not at all.",
    "Mike Lindell, CEO of My Pillow.",
    "But Trump had lost Arizona.",
    "See you Saturday evening!\"",
    "“He’s awesome,” Sisk said.",
    "I love his personality.",
    "“I love it,” she said.",
    "“Absolutely,” he said.",
    "When do we want them?",
    "— Robert Anglen",
    "“He is funny.",
    "Indictments!",
    "Trump!"
  ]
}