{
  "id": 3706,
  "mediaId": 2658,
  "date": "2022-01-18",
  "headline": "Taiwan to finance $900K Ballard contract with Guatemala",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/01/18/taiwan-to-finance-900k-ballard-contract-with-guatemala-799913",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    ": Sanyo Corporation Of America\nCapitol Counsel, LLC: Electronic Funds Transfer Association\nCassidy & Associates, Inc.: American Rivers\nCassidy & Associates, Inc.: Guardant Health\nCassidy & Associates, Inc.: National Hydropower Association\nClark Street Associates: Echodyne Corp.\nCongressional Partners: Clinton College\nCongressional Solutions, Inc (Csi): Quad City Manufacturing Laboratory\nCornerstone Government Affairs, Inc.: Earth Day Network\nCornerstone Government Affairs, Inc.: General Dynamics Information Technology\nCornerstone Government Affairs, Inc.: Livestock Marketing Association\nCornerstone Government Affairs, Inc.: Octasic Inc.\nCypress Advocacy, LLC: Ir1 Group, LLC\nCypress Advocacy, LLC: Managed Funds Association\nDentons US LLP: Coalition To Advance Medical Resident Training In Community Hospitals\nDorsey & Whitney LLP: Purple Innovation, Inc.\nEfb Advocacy, LLC: National Korean American Service & Education Consortium\nEns Resources, Inc.: Monterey One Water\nFoley & Lardner, LLP: Cabot Cabot & Forbes Development Co\nFoley & Lardner, LLP: Canadian National Railway\nFoley & Lardner, LLP: Paladin Protective Equipment, LLC D/B/A American Papr, LLC\nForbes-Tate: Calypsoai\nForbes-Tate: Gen X Energy, LLC\nForbes-Tate: Lundbeck LLC\nForbes-Tate: Merck\nForbes-Tate: Orbital Effects\nForbes-Tate: Siemens Corporation\nForbes-Tate: The Partnership For Americas Health Care Future\nGuidepoststrategies, LLC: Ambac Assurance Corporation\nHammer Associates, LLC: Clean Energy Enterprises, Inc.\nHarbinger Strategies, LLC: Employment Policies Institute\nHogan Lovells US LLP: Fox Corporation (Formerly Known As 21St Century Fox)\nHogan Lovells US LLP: Gogo Inc.\nHogan Lovells US LLP: National Structured Settlements Trade Association\nHogan Lovells US LLP: University Of Mississippi Medical Center Research And Development Foundation\nHogan Lovells US LLP: Western Riverside County Regional Conservation Authority\nHolland & Knight LLP: City Innovate Inc.\nHurt, Norton & Associates, Inc.: E. I. Dupont Denemours & Company\nInvariant LLC: Blade Urban Air Mobility, Inc.\nJocelyn Hong & Associates: National Association Of Waterfront Employers\nJocelyn Hong & Associates: Park University\nJohn Dudinsky & Associates: Red Star Enterprises Limited Fzco\nKing & Spalding LLP: Mood Media Corporation\nK&L Gates LLP: Axiom Space, Inc.\nK&L Gates LLP: Compass Group USa, Inc.\nK&L Gates LLP: Cumberland County Hospital System D/B/A Cape Fear Valley Health System\nK&L Gates LLP: Grit Energy Services, LLC\nK&L Gates LLP: John Lefas\nK&L Gates LLP: Michael L. Taylor\nK&L Gates LLP: Sixteen Thirty Fund\nK&L Gates LLP: Topical Bio Medics Inc.\nLungren Lopina LLC: Medallia, Inc.\nMarshall Mclean LLC: Shared Services Leadership Coalition\nMchugh Lemay Assoc., LLC: Clark Street Associates On Behalf Of Movella\nMissy Edwards Strategies, LLC: Cabt\nMr. Gaylord Hughey: Eastern District Of Texas Bar Association\nMr. Gaylord Hughey: Kp Engineering, Lp\nNvg, LLC: (Isc)2\nO'Keeffe Shahmoradi Strategies, LLC: T. Y. Lin International\nOtt Bielitzki & O'Neill Pllc: Bioporto Diagnostics A/S\nPrasam: Birmingham Technologies\nPrasam: Brimrose Technology Corp\nPrasam: Icf Incorporated LLC\nPrasam: Sicamore Semi (Fka Silicon Power Corporation)\nPrasam: Stereovision Imaging, Inc.\nRichard J. Leidl, P.C.",
    "Green And Company: Modern Technology Solutions, Inc.\nKlein/Johnson Group: Consortium Of Leading Asylum & Refugee Service Providers (Informal Coalition)\nLiberty Partners Group, LLC: Boston Scientific (USpa-United Specialists For Patient Access)\nLobo Strategies: Signature Science LLC\nMcdermott Will & Emery LLP: Mro Corp.\nMonument Advocacy: Benton Mackaye Trail Association\nNvg, LLC: Southern Poverty Law Center\nPrasam: Capella Space\nPutalastrategies: Cresco Labs\nS-3 Group: Holistic Industries\nSorini, Samet & Associates, LLC: Fila USa, Inc.\nSquire Patton Boggs: Rad Power Bikes LLC\nStrategic Health Care: Covington County Hospital\nStrategic Health Care: Grand River Hospital District\nStrategic Health Care: Hills And Dales General Hospital\nStrategic Health Care: West Feliciana Hospital\nStrategic Marketing Innovations: Bki Engineering Services Behalf Inland Power & Light Company\nStrategic Marketing Innovations: Bki Engineering Services Behalf Missoula Electric Cooperative\nStrategic Marketing Innovations: East Penn Manufacturing Company\nStrategic Marketing Innovations: Fincantieri Marine Group LLC\nStrategic Marketing Innovations: Human System Integration, Inc.\nStrategic Marketing Innovations: Lubrizol Corporation\nThe Angle: Ndn Collective\nThe Joseph Group, LLC: Yelp\nThorn Run Partners: City Of Gulfport, Fl\nThorn Run Partners: Sonoma County\nThorn Run Partners: Transportation Agency For Monterey County\nVectis Dc: City Of Montebello, California\nVenn Strategies: Fastcap Systems Corporation Dba Nanoramic Laboratories\nVenn Strategies: Talon Nickel (USa) LLC\nWatershed Results LLC: State Action Coalition\nWheat Shroyer Government Relations LLC: American Association Of Colleges Of Nursing\nWheat Shroyer Government Relations LLC: American Association Of Nurse Anesthesiology\nWheat Shroyer Government Relations LLC: American Association Of Nurse Practitioners\nWheat Shroyer Government Relations LLC: American Nurses Association\nWheat Shroyer Government Relations LLC: American Society For Histocompatibility And Immunogenetics\nWheat Shroyer Government Relations LLC: American Society Of Hand Therapists\nWheat Shroyer Government Relations LLC: Foundation For Advancing Alcohol Responsibility (Responsibility.Org)\nWheat Shroyer Government Relations LLC: Naadac, The Association For Addiction Professionals\nWheat Shroyer Government Relations LLC: National Association Of Social Workers\nWheat Shroyer Government Relations LLC: Wallace Environmental Consulting, Inc.",
    "Active Policy Solutions, LLC: American College Health Association\nActive Policy Solutions, LLC: Kids Included Together\nAkin Gump Strauss Hauer & Feld: Blackrock, Inc.\nArent Fox LLP: Vantagescore Solutions, LLC\nArnold & Porter Kaye Scholer LLP: Robert Davidson\nAtlas Crossing LLC: Iqvia\nBose Public Affairs Group: Irg Erie, Inc.\nBose Public Affairs Group: River Heritage Conservancy\nBrownstein Hyatt Farber Schreck, LLP: Allen Barbarich\nBrownstein Hyatt Farber Schreck, LLP: Booth Creek Resort Properties, LLC\nBrownstein Hyatt Farber Schreck, LLP: I Am Ready\nBrownstein Hyatt Farber Schreck, LLP: Lg Chem, Ltd.\nCfm Strategic Communications (Conkling Fiskum & Mccormick): Discovery Clean Water Alliance\nCgcn Group, LLC (Formerly Known As Clark Geduldig Cranford & Nielsen, LLC): Change & Impact, Inc.\nCiee: Ciee\nCommonwealth Strategic Partners, LLC: City Of Aberdeen, Maryland\nCypress Advocacy, LLC: Red Rock Biofuels, LLC\nDentons US LLP: City Of Bloomington\nDentons US LLP: Corporate Environmental Risk Management\nEfrus Federal Advisors LLC: Eclypsium\nErvin Graves Strategy Group, LLC (F/K/A Ervin Hill Strategy): Rock Central LLC\nGorman Strategy Group: Gorman Strategy Group, Too On Behalf Of Conq\nJ.A.",
    ": City Of Midland, Texas\nRich Feuer Anderson: Moody'S Corporation\nSabiston Consultants, LLC: Brown-Taylor Development\nScf Consulting, LLC: Duane Morris Government Strategies On Behalf Of Septa\nShumaker Advisors Florida, LLC: The David A. Straz Jr. Center For The Performing Arts\nSmith Advocacy Group, LLC: Outpost Agriculture Inc.\nSmith Dawson & Andrews: San Mateo County\nSquire Patton Boggs: Barnard Construction Company, Inc\nStrategic Health Care: Avera Health Plans\nStrategic Health Care: Community Care Of Oklahoma\nStrategic Health Care: Firstcarolina Care Insurance Company\nStrategic Health Care: Health Alliance Medical Plans\nStrategic Health Care: Health New England, Inc.\nStrategic Marketing Innovations: Mabus Group On Behalf Of Fincantieri Marine Group LLC\nStrategics Consulting, LLC: The Hamm Consulting Group On Behalf Of City Of Chattanooga, Tn\nSummit Park LLC: Pmi Global Services Inc.",
    "Wheat Shroyer Government Relations LLC: Western Michigan University\nNew Lobbying Terminations\nAcceleron Pharma Inc: Acceleron Pharma Inc\nApco Worldwide LLC: Celdara Medical, LLC\nArent Fox LLP: Americans Standing For Simplification Of The Estate Tax, Inc. (Asset)\nBaker Donelson Bearman Caldwell & Berkowitz /The Daschle Group: Washington Spirit\nBay Bridge Strategies, Inc.: Kinsa, Inc.\nBerni Consulting, LLC: Plus Action Fund\nBose Public Affairs Group: International Medical Group, Inc.\nBose Public Affairs Group: Pca Advocacy Working Group\nBridge Public Affairs, LLC: Life Care Centers Of America\nBuchanan Ingersoll & Rooney, Pc: One Health Solutions\nBuchanan Ingersoll & Rooney, Pc: Prologis\nButzel Long, P.C.",
    "— In a statement provided by the firm, Guatemala said Ballard would deploy strategic communication to promote Guatemala’s interests in the U.S., including attracting investors to the country and promoting tourism and economic opportunities — among them, improving “the positioning of the country for the promotion of products of small producers.”\n— The statement also appeared to defend hiring lobbyists to begin with, contending that such contracts “are very effective for the promotion of countries and many hire them.” The statement thanked Taiwan “for the support that will allow us to strengthen the positioning of the country in the United States.”\nGood afternoon and welcome to PI.",
    "The project is primarily funded by the Omidyar Network, a philanthropic venture launched by eBay founder Pierre Omidyar that has called for greater regulation of the tech industry, and the advocacy arm of the Economic Security Project, a nonprofit organization led by Facebook co-founder Chris Hughes, who has called for the breakup of the social network he helped create.”\n— “The project sees itself as a direct response to Big Tech-funded groups such as NetChoice and the Connected Commerce Council, which have been flooding social media feeds and email newsletters with ads defending the industry against regulation.",
    "New Joint Fundraisers\nCarlos and Nicole Victory Committee (Reps. Carlos Gimenez, Nicole Malliotakis, Libertad, No Nonsense PAC)\nGeorgia Senate Victory 2022 (DSCC, Sen. Raphael Warnock)\nNick Mitchell for Congress (NICHOLAS MITCHELL COMMITTEE)\nNew PACs\nDemocratic Messaging Project (PAC)\nFree Ohio (Super PAC)\nLets Go Brandon (PAC)\nThe Political Action Committee (Super PAC)\nPrescription for Change PAC (Super PAC)\nNew Lobbying Registrations\n9B Group, Inc.: Land O'Lakes\n9B Group, Inc.: Theodore Roosevelt Conservation Partnership\nAccentcare, Inc.: Accentcare, Inc.",
    "Guatemala is among the so-called Northern Triangle countries in Central America where the Biden administration has sought to crack down on corruption and provide more economic opportunity in a bid to address the root causes of an influx in migrants to the U.S.\n— The contract comes after several of Guatemala’s neighbors in the region, most recently Nicaragua last month and El Salvador in 2018, switched their recognition of governments from Taiwan to the People’s Republic of China.",
    "Taiwan to finance $900K Ballard contract with Guatemala\nBy CAITLIN OPRYSKO\n01/18/2022 05:34 PM EST\n Updated 01/18/2022 08:46 PM EST\n 2022-01-18T08:46-0500\nWith Tanya Snyder and Daniel Lippman\nGUATEMALA HIRES BALLARD: The Taiwanese government is financing a nearly $1 million contract between Ballard Partners and the government of Guatemala, according to documents filed with the Justice Department over the weekend that disclosed the unusual funding arrangement.",
    "— Brian Ballard, a top fundraiser and former lobbyist for former President Donald Trump; former Florida legislator Jose Diaz; former Jeb Bush aide Justin Sayfie; and John O’Hanlon, a longtime Democratic lobbyist who joined Ballard last year, will work on the account for the country, which is one of only a few that maintains full diplomatic relations with Taiwan and recognizes the small island nation‘s sovereignty.",
    "Now organizations with ties to Omidyar and Hughes, who made their fortunes in the tech industry, are making the funding available for industry critics to adopt some of the more expensive tactics long deployed in defense of companies.”\nHYDROGEN ADVOCATES LAUNCH COALITION: Transit agencies, bus manufacturers and suppliers have come together to form the Hydrogen Fuel Cell Bus Council, which is launching today.",
    "The same bill has bipartisan support in the House.”\n— Party leaders have split in the issue, however, with House Minority Leader Kevin McCarthy “considering backing new limits on lawmaker stock ownership, according to an aide,” while House Speaker Nancy Pelosi opposes a ban on individual stock trades (a position New York Times editorial board member Michelle Cottle views as an unforced political error).",
    "The Picard Group, LLC: Ouachita Parish Police Jury\nThe Prenda Group LLC: Environmental Resource Management, LLC\nTiber Creek Group: Leon Medical Center\nTiber Creek Group: Uber Technologies, Inc.\nTiber Creek Group: Union Pacific Railroad Company\nVan Fleet Associates: Hoffenheim Geotechnik\nVan Fleet Associates: Society Of Glass & Ceramic Decorated Products\nVectis Dc: Parsons Corporation\nFollow Us",
    "Both of the freshman senators have put their holdings in such a vehicle, where control over their trades is given to a trustee.”\n— “The Senate bill, which would continue to allow lawmakers to directly control mutual-funds holdings and other diversified products, doesn’t have any Republican co-sponsors and isn’t expected to come up for a vote soon.",
    "‘Our aim is to be a direct counterweight to those organizations that have been lobbying for the status quo for years,’ said Sacha Haworth, the executive director of the Tech Oversight Project.”\n— “The launch highlights how Big Tech’s critics are becoming a more professionalized and coordinated force in Washington.",
    "— In an interview, Larkins said that while she’d been looking to strike out on her own for a while, she’ll continue working on some clients with her former firm, like POET Inc. and the National Association of Real Estate Investment Trusts, via a strategic partnership with Bockorny Group.",
    "Mark Kelly of Arizona and Jon Ossoff of Georgia introduced legislation that would prohibit all members of Congress, their spouses and dependent children from trading individual stocks and would require them to place their stock portfolios into a blind trust.",
    "NADLER’S LEGISLATIVE DIRECTOR HEADS DOWNTOWN: Melissa Connolly, an aide to House Judiciary Chair Jerry Nadler (D-N.Y.) for nearly a decade, is leaving the Hill to join the Association of American Railroads as assistant vice president for government affairs.",
    "The electrolysis process used to split water into hydrogen and oxygen takes a lot of energy, but some transit systems use solar power to do this, including the Champaign-Urbana Mass Transit District, whose CEO chairs the board of the new coalition.",
    "Raphael Warnock of Georgia and Jeff Merkley of Oregon reintroduced a bill that would bar members of Congress and senior staff from buying or selling individual stocks and other investments, and from serving on any corporate boards, while in office.",
    "TECH CRITICS LAUNCH PUSH TO COUNTER INDUSTRY’S LOBBYING MUSCLE: “Tech giants in the past decade have funneled hundreds of millions of dollars into lobbying, advertising, polling and research to advance their political interests in Washington.",
    "It’s part of an effort to make sure hydrogen isn’t left behind as the electrification revolution sweeps the country and Democrats push for investments in EV charging, tax credits for electric vehicles and expanded funding for clean transit.",
    "CURBING LAWMAKER STOCK TRADES WINS FANS ON THE HILL: “Federal judges and central bank officials have faced stepped-up scrutiny over stock trades, due to concerns about possible conflicts of interest or access to nonpublic information.",
    "— The firm told PI that it was not Ballard’s idea for Taiwan to foot the $75,000-a-month bill for its services for Guatemala, an arrangement the firm said will not dictate its work and which its counsel found is permitted under FARA.",
    "Now some of their top adversaries are forming a plan to use that same playbook to press Congress to pass bills that would place new limits on how they wield power over their rivals,” The Washington Post’s Cat Zakrzewski reports.",
    "She’ll also continue to represent existing clients, like Prime Therapeutics and student loan provider Navient, through Stumptown while adding other clients with a focus on telecom, health care, energy and financial services.",
    "LARKINS STRIKES OUT ON HER OWN: Blair Larkins is leaving the Bockorny Group, where she served as the firm’s chief liaison to House Republicans, after more than a decade to open her own lobbying shop, Stumptown Strategies.",
    "— While she plans to stay solo for the time being, Larkins didn’t rule out the possibility of bringing on extra hands, especially with Republicans appearing poised to take back the House in November’s midterms.",
    "In the House, Rep. Abigail Spanberger (D., Va.) and Rep. Chip Roy (R., Texas) have a similar bill with 15 sponsors.”\n— “Other bills have also been introduced that seek to limit conflicts of interest.",
    "— The Tech Oversight Project, which launched today, “plans to bring ‘campaign-style’ tactics to push lawmakers to pass competition legislation aimed at the tech industry.",
    "“I think after we get this up and going, next year is going to be filled with opportunities for someone like me, and so it's a good time to get up and started,” she said.",
    "Hydrogen advocates had to step in last year to make sure they weren’t inadvertently shut out of Democratic legislation aimed at advancing zero-emission transit.",
    "She joins from FCC’s Wireline Competition Bureau’s telecommunications access policy division, where she had been managing the Covid-19 telehealth program.",
    "He’s spent 21 years at House Appropriations, most recently as clerk for the Legislative Branch Subcommittee Dems, and is a State Department alum.",
    "— Aaron Whitehead and Rachel Pewitt are launching Resolve Campaigns, a new firm focused on general consulting and targeted advertising.",
    "He was most recently of counsel at Bryan Cave and was previously U.S. ambassador to the Netherlands during the Obama administration.",
    "— Hydrogen buses are zero-emission vehicles and can go as far as a traditional bus before refueling, unlike battery electric buses.",
    "Jobs Report\n— Christopher Brown has joined Forbes Tate Partners as a senior analyst on the research and policy analysis team.",
    "He most recently was communications director for Glenn Youngkin’s Virginia gubernatorial campaign and is a Trump 2020 alum.",
    "— Faith Vander Voort is joining TAG Strategies as managing director for their communications and public affairs shop.",
    "She’ll replace Jennifer MacDonald, who will retire at the end of this month after 20 years with the trade group.",
    "She most recently was communications director for Rep. David Valadao (R-Calif.) and is a Trump Interior alum.",
    "— Pace Bradshaw has been promoted to senior vice president and head of U.S. government engagement at Visa.",
    "He most recently was senior manager for government affairs and strategy at AECOM and is a Trump EPA alum.",
    "— Timothy Broas has joined Wilson Sonsini’s government investigations practice as senior of counsel.",
    "He was a regional political director for the NRCC during the 2020 cycle and is Kristi Noem alum.",
    "— John Konkus is now director of government affairs at engineering and geospatial firm Woolpert.",
    "— Steve Marchese is joining Cornerstone Government Affairs’ federal government relations team.",
    "Now, the spotlight is turning to Congress,” The Wall Street Journal’s Natalie Andrews reports.",
    "The name is an homage to her hometown of Portland, Ore., the former Greg Walden aide told PI.",
    "— Katelyn Snider is joining Amgen as senior manager for policy and value communications.",
    "He joined Visa in 2013 and most recently lead their federal lobbying team in Washington.",
    "Prior to Visa, he was head of congressional affairs at the Consumer Bankers Association.",
    "She was previously the public affairs and digital U.S. communications lead at UCB.",
    "— Tom Erickson is joining GOP consulting firm OnMessage Inc. as project manager.",
    "— Stephanie Minnock has joined Lumen Technologies as assistant general counsel.",
    "— Matt Wolking is now vice president of comms at Axiom Strategies.",
    "He was previously a manager at Global Strategy Group.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    ": Abilene Chamber Of Commerce\nRichard J. Leidl, P.C.",
    "Green And Company: Charter Communications Inc.\nJ.A.",
    "They previously were both at Majority Strategies.",
    "Send tips: coprysko@politico.com.",
    "— “Last week, Democratic Sens.",
    "Last year, Democratic Sens."
  ]
}