{
  "id": 3730,
  "mediaId": 2830,
  "date": "2022-01-26",
  "headline": "If You Want Clean Power, Go Fission",
  "image": "",
  "link": "https://www.wsj.com/articles/if-you-want-clean-power-go-fission-nuclear-radiation-energy-turbines-emissions-deaths-green-climate-change-11643236061",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Hargraves",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "WSJ Opinion: Hurricane Ida and a U.S. Infrastructure Success StoryPlay video: WSJ Opinion: Hurricane Ida and a U.S. Infrastructure Success Story\n Wonder Land (09/01/21): Following 2005’s Hurricane Katrina, Congress spent billions on a Hurricane and Storm Damage Risk Reduction System, a real infrastructure project that Democrats should learn from.",
    "Photo: Thierry Monasse/Bloomberg News\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (3 minutes)\nAD\nLoading advertisement...\n00:00 / 02:50\n1x\nThis article is in your queue.",
    "Radiation scientists now know that people can safely absorb that much radiation every day because DNA is repaired and cells are replaced constantly in living beings.",
    "The European Union is greenlighting new financing, while Boris Johnson in the U.K. and Emmanuel Macron in France have endorsed new domestic construction.",
    "Mr. Hargraves teaches at Dartmouth’s Osher Lifelong Learning Institute and is a co-founder of ThorCon International, a nuclear-engineering company.",
    "No one needed to be evacuated at Fukushima or around Chernobyl, places where thousands died from unwarranted fear and relocation stress.",
    "Regulatory limits on annual exposure around nuclear plants are less than a year’s background radiation from rocks and cosmic rays.",
    "WSJ Opinion: Hurricane Ida and a U.S. Infrastructure Success Story\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "As the new reactors come into operation, some accidents may leak radioactive materials, but the radiation won’t harm people.",
    "Up to 15 children died of thyroid cancer after drinking milk from cows that ate grass contaminated with radioactive iodine.",
    "Unless we tell the truth about nuclear power, the next nuclear accident may end mankind’s only hope for the energy we need.",
    "We need to educate the public so that mass hysteria doesn’t stop progress toward reliable, economical CO2-free energy.",
    "Images: USACE/AFP/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "A 2012 U.S. Nuclear Regulatory Commission report predicts an accident rate of only 1 per 300,000 reactor-years.",
    "At Ukraine’s Chernobyl in 1986, 134 emergency workers were treated for acute radiation poisoning, and 28 died.",
    "Yet regulators’ mandated limits, at a thousandth of what’s really harmful, create fright of all radiation.",
    "No one was harmed by radiation at Japan’s Fukushima in 2011 or Pennsylvania’s Three Mile Island in 1979.",
    "The public needs to know that accidents happen, but harm to the public from radiation is unlikely.",
    "But those cancers were preventable had authorities warned against drinking the milk for 90 days.",
    "Westinghouse, which built many of the plants, claims a rate of 1 per 4 million reactor-years.",
    "Open Queue\nFission is in fashion as drawbacks of intermittent wind and solar power emerge.",
    "The public understands that occasionally airplanes crash and kill hundreds of passengers.",
    "0:00 / 3:54\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Regulators try to assuage fears by reassuring the public that accidents won’t happen.",
    "Cooling towers at the Tihange nuclear power station in Huy, Belgium, Oct. 26, 2021.",
    "Fifty-seven nuclear plants are under construction around the world.",
    "The historical figure is 1 per 17,000 reactor-years.",
    "Airlines explain safety procedures on every flight.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "China promises 10 new plants a year.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "People still fly."
  ]
}