{
  "id": 3792,
  "mediaId": 2688,
  "date": "2022-01-23",
  "headline": "Arizona Democrats Censure Sinema Following Blow To Voting Rights Legislation",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/01/GettyImages-1365682308-scaled.jpg",
  "link": "https://talkingpointsmemo.com/news/arizona-democratic-party-sinema-censure?utm_source=rss&utm_medium=rss&utm_campaign=arizona-democratic-party-sinema-censure",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Cabrera",
  "authorUrl": "https://talkingpointsmemo.com/profile/cristina-cabrera",
  "termIds": [
    0
  ],
  "sentences": [
    "Last week, Teran issued a pointed statement that took aim at Sinema for having “fallen short” on voting rights, while highlighting the contrast between Sinema with her fellow Arizona senator, Mark Kelly (D-AZ), who “courageously voted to defend the voting rights of millions of Arizonans.”\nRep. Ruben Gallego (D-AZ) also told CNN last week that several unnamed senators privately reached out to him in recent days to urge a primary challenge against Sinema.",
    "Raquel Teran, the state party’s chair, said that although it “appreciates” Sinema’s involvement in the passage of COVID-19 relief and the bipartisan infrastructure bill in 2021, it disapproves of the senator’s loyalty to the filibuster that ultimately torpedoed Democrats’ year-long push for voting rights legislation.",
    "“However, we are also here to advocate for our constituents and the ramifications of failing to pass federal legislation that protects their right to vote are too large and far-reaching,” Teran said in a statement on Saturday following the state party’s vote.",
    "“Everything you can imagine under the sun.”\nGallego also clarified that among the senators who reached out to him, none of them was Sen. Bernie Sanders (I-VT), who previously stated his support for a primary challenger against Sinema.",
    "“While we take no pleasure in this announcement, the ADP Executive Board has decided to formally censure Senator Sinema as a result of her failure to do whatever it takes to ensure the health of our democracy,” Teran added.",
    "Political action committees such as EMILY’s List and NARAL cut off their financial support for Sinema after she continued to stand by the filibuster even for voting rights legislation that she said she supports.",
    "Sinema and Joe Manchin (D-WV) joined Republicans in voting last week against changing Senate rules such that voting rights legislation would be able to pass without bipartisan support.",
    "The party voted on Saturday to formally censure Sinema, following her refusal to support a filibuster carveout that would allow voting rights legislation to move through the Senate.",
    "“To be honest, I have gotten a lot of encouragement from elected officials, from senators, from unions, from your traditional Democratic groups, big donors,” Gallego told CNN.",
    "Fury from Democrats towards Sinema reached a crescendo with her refusal to back a filibuster carveout for voting rights.",
    "It’s official: The Arizona Democratic Party has had enough of Sen. Kyrsten Sinema’s (D-AZ) bold mavericking.",
    "Sinema is up for re-election in 2024.",
    "The vote comes after both Sens."
  ]
}