{
  "id": 3800,
  "mediaId": 2879,
  "date": "2022-01-20",
  "headline": "Schumer made Dems take hard vote he knew he’d lose",
  "image": "https://www.powerlineblog.com/ed-assets/2022/01/chuck_schumer_AP.jpg",
  "link": "https://www.powerlineblog.com/archives/2022/01/schumer-made-dems-take-hard-vote-he-knew-hed-lose.php",
  "mediaOutlet": "Power Line",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Mirengoff",
  "authorUrl": "https://www.powerlineblog.com/archives/author/paul",
  "termIds": [
    0
  ],
  "sentences": [
    "The Washington Post cites Emily’s List and the NAACP as particularly rabid (my characterization) when it comes to this legislation, which the latter organization absurdly describes as “what may be our last hope to save our democracy.”\nChuck Schumer appears to be a slave to these kinds of pressure groups.",
    "Thus, I would argue that Biden and Schumer have less reason to cave to their party’s hard left than Republican officials and legislators have for declining to distance themselves much from Trump when they might otherwise do so.",
    "Furthermore, to the extent that some GOP officials and legislators won’t defy Trump it’s because they believe, correctly I think, that Trump supporters are still the dominant force numerically in today’s Republican party.",
    "But Biden had to insist on the difference because, as his old colleague Joe Lieberman said on Fox News today, Biden’s agenda hasn’t been all that different from that of Sanders.",
    "Schumer than forced a vote on a proposed rule change to allow the voting legislation to advance with only a simple majority of votes — in other words, bypass the filibuster.",
    "One could add the two Georgia Democrats to the list, although Raphael Warnock was probably quite happy to cast his vote and Jon Ossoff isn’t up for reelection this year.",
    "Schumer may have contributed to its popularity by insisting during the Trump years that the filibuster plays an indispensable role in our system of checks and balances.",
    "Another possible explanation, and the two aren’t mutually exclusive, is that the left-wing donors on whom Democrats rely demanded that Schumer make a last stand.",
    "I have a difficult time imagining Ocasio-Cortez defeating Schumer in any scenario, but I don’t have a place in the Senate on the line.",
    "Charles Cooke suggests Schumer did it because he’s “terrified” of a challenge for his Senate seat by Alexandria Ocasio-Cortez.",
    "Not out of principle — Biden has never been that sort of politician — but because he simply won’t stand up to the far left.",
    "Schumer, McConnell’s Senate counterpart, won’t distance himself from the hard Democratic left on matters important to it.",
    "However, she’s probably finished at the end of her term in 2024 anyway, and I doubt Schumer wants to do her favors.)",
    "Last night, Chuck Schumer forced a vote on a motion to close debate on the Democrats’ voting legislation.",
    "No one would ever mistake the flip-flopping hack from Delaware with the committed socialist from Vermont.",
    "Joe Manchin and Kyrsten Sinema joined every Republican to vote “no,” as they had made clear they would.",
    "One is that Mitch McConnell has been willing to distance himself from Trump in important ways.",
    "During his press conference yesterday, Biden felt the need to say he’s not Bernie Sanders.",
    "The problem for vulnerable Dems is that the filibuster remains popular with the public.",
    "Democrats might counter that Republicans these days won’t stand up to Donald Trump.",
    "(Schumer also caused Sinema to vote for the filibuster, which did her no favors.",
    "Schumer forced a number of vulnerable Democrats to vote against the filibuster.",
    "Sanders supporters can’t make that claim with regard to the Democratic party.",
    "Mark Kelly, Maggie Hassan, Michael Bennet, and Catherine Cortez-Masto.",
    "That motion had nowhere near the support needed — 60 votes — to pass.",
    "Why did Schumer insist on putting vulnerable colleagues in a pickle?",
    "If they could, the Dems would have nominated Sanders, not Biden.",
    "In fact, I read this charge almost daily in the Washington Post.",
    "Nor do I know New York politics nearly as well as Schumer does.",
    "There’s some truth to it, but also some distinctions.",
    "Among the vulnerable Dems who did so were Sens.",
    "Schumer knew he would lose on both votes.",
    "That effort failed by a vote of 48-52.",
    "The same can be said of Joe Biden.",
    "Was there any harm in trying?",
    "Yet he held them anyway.",
    "Maybe Schumer is.",
    "Sens.",
    "Yes.",
    "Why?"
  ]
}