{
  "id": 3826,
  "mediaId": 2589,
  "date": "2022-01-21",
  "headline": "Arizona Dem: Some of Sinema's own Senate colleagues are pushing me to primary her",
  "image": "https://media.townhall.com/townhall/reu/o/2021/319/0f4dfd36-13e3-4a4e-a535-0f068544651b-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/01/21/arizona-dem-some-of-sinemas-own-senate-colleagues-are-pushing-me-to-primary-her-n443181",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    0
  ],
  "sentences": [
    "“Everything you can imagine under the sun.”\nHe called the last few weeks of gridlock over voting rights a “tipping point situation” for Dems, noting “a whole lot of frustration over a lot of things that have occurred in the past with Sen. Sinema, and this has kind of been the breaking point.” That’s a reference to Build Back Better, of course, which remained in limbo for months as the White House grappled with Sinema’s demand that the bill not hike taxes as part of its pay-fors.",
    "It’s hard for me to believe that Democrats, who’ve never shown a lick of consistency about the filibuster, will resolutely stick to principle going forward in opposing it if we end up with Roe being overturned next year and the GOP in total control of government in 2025, a highly plausible scenario.",
    "Gallego may be technically telling the truth when he says that Bernie Sanders hasn’t directly approached him about primarying Sinema, but (a) Bernie has already made his feelings about that public and (b) Bernie 2020 alumni are reportedly driving the grassroots efforts to primary Sinema in Arizona.",
    "At least one lefty congressman has accused her and others who voted to protect the filibuster of being “white nationalists.” And if you believe Ruben Gallego, the House Dem who’s thinking of challenging her in 2024, members of Sinema’s own caucus are whispering to him that it’s time for her to go.",
    "Sinema's favorable rating among AZ Dems at a whopping 8%, according to @Civiqs (and that was as of 1/14)https://t.co/fzsIqgbwx7 pic.twitter.com/81spZqN91N\n— Kerry Eleveld (@kerryeleveld) January 20, 2022\nHer rating among Arizona Republicans, however, was 44/31.",
    "“I hope other senators join him.”\nChuck Rocha, a strategist and former senior advisor on Sanders’ 2016 and 2020 presidential campaigns, is leading a different effort to draft Rep. Ruben Gallego of Arizona into the 2024 Democratic primary.",
    "The X factor in the effort to primary Sinema is Mark Kelly, who’s on the ballot this fall and who notably broke with her a few days by declaring that he’d support a carve-out to the filibuster for voting rights legislation.",
    "But it’s not an exaggeration to say that she’s taking more heat from the left at the moment than Mitt Romney took from the right when he voted to remove Trump at his first impeachment trial — which stands to reason.",
    "Along with Westbrook, Belen Sisa, Sander’s national Latino press secretary in 2020, and Dan O’Neal, a member of Our Revolution Arizona in the 2020 election, are all signatories of the Sinema Primary Pledge.",
    "“I commend him in saying that [Sinema should be primaried],” said Brianna Westbrook, a former Sanders surrogate now running for the Arizona legislature, and a leading organizer of the Sinema Primary Pledge.",
    "“To be honest, I have gotten a lot of encouragement from elected officials, from senators, from unions, from your traditional Democratic groups, big donors,” said Gallego, a seven-year House veteran.",
    "If Kelly wins in November in a national environment that should heavily favor Republicans, progressives will take it as proof that opposing the filibuster is no obstacle to victory in a swing state.",
    "I continue to believe that Democratic anger at Sinema will ease in time, replaced by a sense of urgency to hold her seat in 2024 by leveraging her incumbency (and her popularity among Republicans).",
    "Desperate to hold Sinema’s seat in 2024, they may decide grudgingly that they’re better off with a centrist incumbent whom the other party likes than gambling on a leftist like Gallego.",
    "“It wasn’t Bernie, I’ll tell you that,” Gallego told CNN, referring to Vermont independent Sen. Bernie Sanders, who has said he’s open to backing a primary challenge to Sinema.",
    "Crossing Democrats on that might have earned her a primary challenge in and of itself; blowing up the voting rights bills on top of it is basically daring them to primary her.",
    "“I think it is very likely they are the last two elected Democrats who support the filibuster,” said one anti-filibuster activist to Ron Brownstein of Manchin and Sinema.",
    "If you believe a new poll from Civiqs, Sinema’s favorable rating among Arizona Democrats a week ago, before she nuked the effort to nuke the filibuster, was … 8/80.",
    "At best, they might continue to support a filibuster carve-out for legislation dealing with voting rights, but I wouldn’t bet the mortgage on that either.",
    "“It’s more than one” senator, he added before declining to say which of Sinema’s colleagues are privately hoping she will face an intraparty fight.",
    "Sinema’s vote on the filibuster did matter, at least insofar as her siding with the left would have left Joe Manchin on a lonely island of one.",
    "Elizabeth Warren of Massachusetts and Amy Klobuchar of Minnesota, as well as President Joe Biden, had also signed onto the pledge.",
    "By the way, one common take in the aftermath of the Dems’ voting rights debacle is that they lost the battle but won the war.",
    "Imagine a Republican administration spearheading a drive to make photo ID for voting mandatory in all state elections.",
    "Would he have continued to hold out even if he were the only Democrat still willing to support the filibuster?",
    "But if Kelly goes down, Democrats will panic and wonder if Arizona isn’t trending as blue as they thought.",
    "Practically every component of the institutional left has turned against her bitterly over her vote.",
    "Which means, whatever she may say publicly, Sinema’s probably rooting for a Kelly defeat this year.",
    "If there’s anything CSPAN can do to livestream them, I’d be willing to pay a subscription fee.",
    "Where do we think the left would settle on the morality of the filibuster in that case?",
    "And he said that in the last several days the courtship has only intensified.",
    "As much as Romney’s vote angered Republicans, it didn’t matter in the end.",
    "Those closed-door Senate Dem caucus lunches must be zesty affairs lately.",
    "Democrats weren’t close to the 67-vote threshold needed to remove Trump.",
    "But there’s strength in numbers, and Sinema provided those numbers.",
    "Some of her wealthier donors are abandoning her too.",
    "Westbrook said that 2020 supporters of Sens.",
    "NARAL cut her loose yesterday.",
    "Is that right?",
    "Probably.",
    "Hmmm!"
  ]
}