{
  "id": 3850,
  "mediaId": 2553,
  "date": "2022-01-21",
  "headline": "Another Republican Joins Efforts To Ban Insider Trading, Introduces Legislation In The House",
  "image": "https://dw-wp-production.imgix.net/2022/01/Vicki-Hartzler-scaled-e1642799497183.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/another-republican-joins-efforts-to-ban-insider-trading-introduces-legislation-in-the-house",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Jewell",
  "authorUrl": "https://www.dailywire.com/author/zach-jewell",
  "termIds": [
    0
  ],
  "sentences": [
    "Hartzler introduced the “Banning Insider Trading Act” on Wednesday, stating, “It’s past time for Congress to crack down on this potential corruption.”\n“When Speaker Pelosi can trade millions of dollars in stocks per year, outperform the market, and receive classified briefings at the same time, it’s no wonder she defends the trading of individual stocks by Congress,” she said.",
    "No one – not even the Speaker of the House – should benefit from public service.”\nHartzler’s bill would “prohibit Members of Congress and their spouses from holding or trading individual stocks” and “require Members found in violation to return their profits to the American people.”\nHawley introduced similar legislation in the Senate last week.",
    "Give Members of Congress and their spouses six months, upon assuming office, to divest any prohibited holdings or place those holdings in a blind trust for the remainder of their tenure in office.",
    "“But if members want to do that, I’m okay with that.”\nHartzler’s legislation in the House shows there could be large support for banning insider trading from both parties and in both chambers.",
    "“Year after year, politicians somehow manage to outperform the market, buying and selling millions in stocks of companies they’re supposed to be regulating,” Hawley said in a statement.",
    "“Wall Street and Big Tech work hand-in-hand with elected officials to enrich each other at the expense of the country.”\nDemocrats in the Senate also introduced a ban on insider trading.",
    "Her bill would:\nProhibit Members of Congress and their spouses from holding, acquiring, or selling stocks or equivalent economic interests during their tenure in elected office.",
    "His bill would likewise stop members and their spouses from holding, buying, and selling stocks, but it would not ban mutual fund investments, according to The Daily Wire.",
    "Require that after two years of the Act’s implementation, the Government Accountability Office (GAO) will conduct an audit of Members’ compliance with the Act.",
    "Ensure Members or their spouses forfeit any investment profits to the American people via the U.S. Treasury if they are found to be in violation if the Act.",
    "“If the impression that is given by some that somebody is doing insider trading, that’s a Justice Department issue … and that has no place in any of this.",
    "But to give a blanket attitude of ‘we can’t do this and we can’t do that,’ because we can’t be trusted, I just don’t buy into that,” she continued.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "Ossoff and Kelly’s bill would go one step further by prohibiting dependent children of lawmakers from trading stock, according to Axios.",
    "“It’s past time for Congress to crack down on this potential corruption and work for the American people, instead of their own wallets.",
    "Members who violate the requirements will also lose the ability to deduct the losses of those investments on their income taxes.",
    "Rep. Vicky Hartzler (R-MO) joined fellow Missourian Sen. Josh Hawley (R) in pushing for a ban on insider trading in Congress.",
    "Any holdings in diversified mutual funds, exchange-traded funds, or U.S. Treasury bonds are exempt from the prohibition.",
    "And on Thursday, Pelosi stated she is open to the idea of legislation banning the practice for members of Congress.",
    "House Speaker Nancy Pelosi (D-CA) has been pressured in recent weeks to support a ban on insider trading.",
    "“I do come down always in favor of trusting our members,” she said during a press conference.",
    "I am pleased to join Senator Hawley in our fight to restore decency and truth to Washington.",
    "The ethics committees of Congress may levy additional fines and will publicize violations.",
    "Days later, reports surfaced of Pelosi’s husband trading large amounts of assets.",
    "John Ossoff (GA) and Mark Kelly (AZ) put forward similar legislation.",
    "Last month, she said members “should be able to” trade stock.",
    "Get inside access to The Daily Wire by becoming a member.",
    "Create a free account to join the conversation!",
    "Sens."
  ]
}