{
  "id": 3875,
  "mediaId": 2644,
  "date": "2022-01-26",
  "headline": "Steny Hoyer says he’s ‘not sure it’s necessary’ to pass stock trade ban for lawmakers",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/01/steny-hoyer-1.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/01/26/rep-steny-hoyer-says-congress-stock-trading-ban-unnecessary/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thomas Barrabi",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s criminal.”\nCalls to ban members of Congress from owning or trading stock have gathered bipartisan momentum in recent weeks, despite initial opposition from House Speaker Nancy Pelosi (D-Calif.), who argued lawmakers should be clear to participate in a “free market.”\nThe most recent effort came from Rep. Jared Golden (D-Maine), who led a group of 27 lawmakers, including “Squad” member Rashida Tlaib (D-Mich) and President Donald Trump ally Matt Gaetz (R-Fla.), in urging congressional leaders to “swiftly” introduce legislation banning the practice.",
    "“I’m not sure it’s necessary to do that because I think the current law covers what they want to preclude, and that is a member of Congress getting some information as a member of Congress that he or she uses to enrich themselves,” Hoyer said in an interview with Politico on Tuesday.",
    "“Having said that, however, I want to look carefully at legislation that takes away from members the ability to make investments that we encourage in every other sector.”\nThe Post previously reported that Sens.",
    "House Majority Leader Steny Hoyer expressed hesitancy this week about whether it’s “necessary” to pass proposed legislation banning federal lawmakers from trading and owning stocks while in office.",
    "Earlier this week, Pelosi softened her opposition to a ban, acknowledging she would be open to additional restrictions if they gained wide support in Congress.",
    "“To give a blanket attitude of ‘We can’t do this and we can’t do,’ because we can’t be trusted, I just don’t buy into that.",
    "The Maryland Democrat argued that existing insider trading laws are sufficient to prevent wrongdoing.",
    "I do not trade stock and therefore, this is not an issue that affects me or my family,” Hoyer added.",
    "Jon Ossoff (D-Ga.) and Mark Kelly (D-Ariz.) introduced legislation despite Pelosi’s opposition.",
    "Several other initiatives led by members of both parties are also in the works.",
    "Hoyer argued that other sectors outside of government aren’t subject to a ban.",
    "But if members want to do that, I’m okay with that,” Pelosi said.",
    "“I don’t trade stock, period.",
    "“That’s wrong."
  ]
}