{
  "id": 3967,
  "mediaId": 2830,
  "date": "2022-01-27",
  "headline": "Boris Johnson’s Partygate Is About the Economy",
  "image": "",
  "link": "https://www.wsj.com/articles/boris-johnson-partygate-about-economy-inflation-energy-crisis-shortage-green-tax-increase-leveling-up-11643296176",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph C. Sternberg",
  "authorUrl": "https://www.wsj.com/news/author/joseph-c-sternberg",
  "termIds": [
    0
  ],
  "sentences": [
    "Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nThe prime minister is in trouble now most immediately thanks to a monthslong trickle of revelations about parties in his office-and-residence complex on London’s Downing Street.",
    "Photo: jessica taylor/Agence France-Presse/Getty Images\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (5 minutes)\nAD\nLoading advertisement...\n00:00 / 05:12\n1x\nThis article is in your queue.",
    "That payroll-tax hike as well as higher taxes on business profits and capital gains and a stealth inflation tax increase on households (via frozen tax brackets) are dinging confidence at a particularly uncertain time.",
    "With Joe Biden reaffirming his campaign pledge to nominate a black woman to the Supreme Court, the panel takes a look at who could be up for the nomination, and what the confirmation process might look like.",
    "That vote resulted from a fragile alliance between the more libertarian wing of Mr. Johnson’s Conservative Party and working-class left-wing voters traditionally more at home in the opposition Labour Party.",
    "Yet a recent YouGov survey found most of those voters have little or no idea what that much-vaunted big-government leveling-up agenda is, and most don’t expect more money to flow into their regions.",
    "This strategy failed abjectly for Mr. Johnson’s predecessor, Theresa May, who temporized on taxation and co-opted left-wing desiderata such as a pledge to mandate diversity on corporate boards.",
    "Instead, it will be because Mr. Johnson was foolish enough to buy into a lot of trendy theories concerning how parties of the political right need to remake themselves to win elections.",
    "Missing is any convincing plan of the sort voters ordinarily expect from a Conservative administration to rev business investment, job creation and inflation-adjusted wage growth.",
    "He has promised more money to the socialized National Health Service—some £12 billion ($16.2 billion) a year—to be funded by a payroll-tax increase on workers and employers.",
    "WSJ Opinion: We Look at Joe Biden's First YearPlay video: WSJ Opinion: We Look at Joe Biden's First Year\n Journal Editorial Report: The president says he \"overperformed.\"",
    "If Boris Johnson’s tenure as U.K. prime minister comes to an abrupt end in the coming weeks or months—and it very well might—it won’t be because of a birthday bash.",
    "This view appeared to be vindicated when Mr. Johnson led the party to a historic victory in December 2019 after replacing Mrs. May on a pledge to get Brexit done.",
    "Mr. Johnson is supposed to be a sort of working-class-vote whisperer when it comes to the many seats the Tories snatched away from Labour in the 2019 election.",
    "Despite sometimes espousing more-libertarian views, by election day Mr. Johnson had become the big-government conservative Mrs. May always aspired to be.",
    "You survive if your allies and voters conclude you still serve some purpose of theirs, and you don’t survive once they conclude your usefulness is spent.",
    "Plus, a scandal involving \"lockdown parties\" has put Boris Johnson's job as Prime Minister in jeopardy, but that's not the only reason he's in trouble.",
    "He’s thrown himself into climate piety, committing the U.K. to a net-zero carbon-emission pledge that inevitably will drive energy prices even higher.",
    "A more functional economy undergirded by economic-growth policies from a less confused Conservative Party certainly wouldn’t have hurt.",
    "The country is in the grip of an energy crisis that is causing the prices households pay for electricity and natural gas to skyrocket.",
    "She squandered an impressive poll lead over a dysfunctional Labour Party in a snap 2017 election and never recovered politically.",
    "Mr. Johnson’s difficulty is that partygate has arrived at precisely the moment the wheels are falling off the British economy.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nWho Could Be Joe Biden's Supreme Court Nominee?",
    "They owe their jobs to the prime minister and yet apparently have concluded their voters no longer buy whatever he’s selling.",
    "Gavin Newsom, who survived a full-on recall election after attending a birthday celebration at a chichi French restaurant.",
    "Supermarkets still aren’t fully stocked, and parts of the country were paralyzed by gasoline lines for a week last autumn.",
    "Offering Covid as a catch-all excuse ignores the ways Mr. Johnson’s terrible policy instincts are hobbling the recovery.",
    "Voters don’t trust the sincerity of his leftward tilt, and he has no economic growth to offer them as an alternative.",
    "The leftward tack that was supposed to make a Conservative coalition more durable instead has made it more brittle.",
    "This is all the fruit of a strategic bet Conservatives made around Britain’s 2016 vote to leave the European Union.",
    "This is contributing to a cost-of-living crisis fueled by the fastest consumer-price inflation in nearly 30 years.",
    "Read More Political Economics\nThe Tories decided the solution was to transform into a party of big government.",
    "WSJ Opinion: We Look at Joe Biden's First Year\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Images: AFP/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "At least some of these get-togethers may have broken pandemic lockdown regulations in effect at the time.",
    "Which presents an irony worth noting in Britain and in corners of America’s Republican Party as well.",
    "The centerpiece was a “leveling up” agenda that would pour huge resources into the North of England.",
    "A conspicuous hub of the rebellion against Mr. Johnson is lawmakers from precisely these districts.",
    "A more coherent pro-growth agenda would have given voters more reasons to stick with a politician.",
    "0:00 / 5:49\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "But the Tories convinced themselves Mrs. May’s flaw was her failure to deliver Brexit.",
    "U.K. Prime Minister Boris Johnson speaks in the House of Commons in London, Jan. 26.",
    "The challenge became how to unite those factions into a durable coalition.",
    "Much of this results from Mr. Johnson’s leftward policy lurch.",
    "Might partygate have proved less dangerous to Mr. Johnson?",
    "Lockdown busting alone doesn’t bring down politicians.",
    "The pandemic scrambled things, but only somewhat.",
    "But understand what’s really going on here.",
    "Your browser does not support HTML5 video.",
    "Open Queue\nForget those infernal parties.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "The rule is simple and universal.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Ask California Gov.",
    "And for what?",
    "Did he?"
  ]
}