{
  "id": 3995,
  "mediaId": 2748,
  "date": "2022-01-20",
  "headline": "While Sen. Kyrsten Sinema stands firmly against targeting the filibuster, fellow Arizona Sen. Mark Kelly announces that he will support changing rules to pass voting legislation",
  "image": "http://www.tathasta.com/favicon.ico",
  "link": "http://www.tathasta.com/2022/01/while-sen-kyrsten-sinema-stands-firmly.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "News Kick",
  "authorUrl": "http://www.tathasta.com/2022/01/while-sen-kyrsten-sinema-stands-firmly.html",
  "termIds": [
    0
  ],
  "sentences": [
    "As Democrats plow ahead with a likely doomed attempt to change the filibuster rules in order to ram so-called \"voting rights\" legislation through the chamber, Democratic Sen. Mark Kelly of Arizona has issued a statement announcing that he will support changing the rules in order to pass the legislation.",
    "We're seeing that now, as voting rights legislation remains blocked while partisan politicians work to undermine Arizona's successful vote-by-mail system and create more barriers to vote,\" Kelly said in a statement.",
    "Sen. Bernie Sanders of Vermont, an independent who caucuses with the Democrats, reportedly indicated on Tuesday that if Manchin and Sinema face primary challengers he would be open to supporting their opponents.",
    "Protecting the vote-by-mail system used by a majority of Arizonans and getting dark money out of our elections is too important to let fall victim to Washington dysfunction,\" the senator declared.",
    "His announcement starkly contrasts with the position staked out by his colleague Sen. Kyrsten Sinema (D-Ariz.), who has firmly reiterated her opposition to targeting the filibuster.",
    "Kelly, a former astronaut who entered office in December 2020 after winning a special election in November of that year, is seeking re-election this year.",
    "\"If campaign finance and voting rights reforms are blocked again this week, I will support the proposed changes to pass them with a majority vote.",
    "\"My year in the Senate has shown me how dysfunctional this place can be, and how that prevents progress on issues that matter to Arizonans.",
    "Sen. Joe Manchin of West Virginia has also continued to stand his ground as a filibuster supporter."
  ]
}