{
  "id": 4000,
  "mediaId": 2718,
  "date": "2022-01-26",
  "headline": "Documentary ‘Gabby Giffords Won’t Back Down’ Set at CNN Films and TIME Studios From ‘RBG’ Directors",
  "image": "https://www.thewrap.com/wp-content/uploads/2022/01/GettyImages-1351090985.jpg",
  "link": "https://www.thewrap.com/gabby-giffords-wont-back-down-cnn-films-documentary/",
  "mediaOutlet": "The Wrap",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Welk",
  "authorUrl": "https://www.thewrap.com/author/brian-welk/",
  "termIds": [
    0
  ],
  "sentences": [
    "Betsy West and Julie Cohen, known for the films “RBG,” “Julia” and “My Name is Pauli Murray,” are directing the film that includes home movie footage of the 2011 shooting that left her partially paralyzed as well as tracking her U.S. Senate run for the state of Arizona in 2020.",
    "“The intelligence, humor, and toughness she brings to every personal and political challenge that comes her way makes Gabby not only an ideal documentary subject, but also a spectacular human being to spend time with,” they said of working with her for the film.",
    "The film will also include interviews with former President Barack Obama, U.S. Sen. Kirsten Gillibrand, and U.S. Rep. James Clyburn, as well as Giffords’ husband, astronaut Mark Kelly (now an Arizona Senator) and her two daughters Claudia and Claire.",
    "CNN Films and TIME Studios have announced a new documentary film about Gabrielle Giffords called “Gabby Giffords Won’t Back Down” that will trace the former Arizona Congresswoman’s political career following an assassination attempt on her life.",
    "“They have beautifully showcased Gabrielle Giffords’ journey, one of strength and resilience in the face of tragedy.”\n“’Gabby Giffords Won’t Back Down’ is a triumphant portrayal of resilience, courage, and the power of the human spirit.",
    "CNN Films previously partnered on West and Cohen’s “Julia,” about the TV chef Julia Child, for a film released by Sony Pictures Classics that has now been shortlisted in this year’s race for Best Documentary Feature at the Oscars.",
    "The deal for “Gabby Giffords Won’t Back Down” was negotiated by Stacey Wolf, senior vice president of business affairs, and Kelly MacLanahan, assistant general counsel, both of CNN Worldwide, on behalf of CNN Films.",
    "Amy Entelis and Courtney Sexton of CNN Films are executive producers for “Gabby Giffords Won’t Back Down,” alongside Ian Orefice and Alexandra Johnes of TIME Studios, and Oren Jacoby of Storyville Films.",
    "We could not be more thrilled to partner with the remarkable team of Betsy and Julie as they have created one of the most inspirational films of our time,” Orefice, president of TIME Studios, added.",
    "“We are so pleased to collaborate again with Betsy and Julie to tell the story of a remarkable woman,” Entelis, executive vice president for talent and content development for CNN Worldwide, said.",
    "Cohen and West are also producing the film under their Storyville Films banner, along with Lisa Erspamer of Lisa Erspamer Entertainment, and Sam Jinishian, of Storyville Films.",
    "On Jan. 8, 2011, U.S. Rep. Giffords was the target of an assassination attempt by a lone gunman while she was engaged in a constituency outreach event in Tucson, Arizona.",
    "And the film will also discuss Giffords’ efforts to push for gun safety following the Newtown, Connecticut shootings even as she remains a gun owner herself.",
    "CNN Films acquired worldwide television rights to “Gabby Giffords Won’t Back Down.” Other rights for the film remain available.",
    "“Within minutes of meeting Gabby Giffords, we knew we had to make a film about this phenomenal woman,” Cohen and West said.",
    "Giffords was shot in the head, and 13 people were wounded and six were killed, including a 9-year-old girl.",
    "Production on “Gabby Giffords Won’t Back Down” is near completion, but no release date was set.",
    "CAA Media Finance and UTA are co-representing the film’s worldwide rights.",
    "She’s also a leader with the nonprofit group Friends of Aphasia."
  ]
}