{
  "id": 4037,
  "mediaId": 8350,
  "date": "2022-01-27",
  "headline": "Here’s what Arizona’s Kyrsten Sinema, Mark Kelly say about Supreme Court vacancy",
  "image": "https://ktar.com/wp-content/uploads/2022/01/sinema-kelly-split-getty.jpg",
  "link": "https://ktar.com/story/4859906/heres-what-arizonas-kyrsten-sinema-mark-kelly-say-about-supreme-court-vacancy/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KEVIN STONE",
  "authorUrl": "https://ktar.com/story/author/kstone/",
  "termIds": [
    0
  ],
  "sentences": [
    "“As with all nominees and as I did during the 2020 Supreme Court nomination, I look forward to fulfilling my constitutional duty to provide advice and consent by thoughtfully examining the next nominee based on three criteria: whether the nominee is professionally qualified, believes in the role of an independent judiciary, and can be trusted to faithfully interpret and uphold the rule of law.”\nIn October 2020, Sinema voted against confirming Justice Amy Coney Barrett, who was nominated by then-President Donald Trump to the seat that opened when Ruth Bader Ginsburg died.",
    "Sinema explained her opposition by saying she was “concerned about Judge Barrett’s inconsistent views on legal precedent, and how those inconsistencies impact her obligation to interpret and uphold the rule of law.”\nRepublicans controlled the Senate at the time and were able to confirm Barrett with no Democratic support by a 52-48 margin.",
    "“Justice Breyer has long understood the impact of the Supreme Court on the lives of Americans, and he leaves behind a legacy of upholding the Constitution as well as health care protections, free speech, and reproductive rights for Arizonans,” Kelly said in a statement.",
    "I will evaluate the president’s nominee based on their qualifications and commitment to fairly interpret and uphold the Constitution.”\nBiden said Thursday he’ll make his pick by the end of February.",
    "“I take seriously the responsibility of evaluating nominees for lifetime appointments, and look forward to meeting with whomever the president puts forward to fill this vacancy.",
    "PHOENIX — With Supreme Court Justice Stephen Breyer retiring, Arizona’s U.S. senators said Thursday they are looking forward to the confirmation process.",
    "“I’ve made no decision except one: The person I will nominate will be somebody of extraordinary qualifications, character and integrity,” he said.",
    "If no Republicans support President Joe Biden’s selection, Democrats will need to be unanimous in their support to confirm the nominee.",
    "“I join all Arizonans in thanking him for his service and life-long commitment to American justice,” Sinema said in a statement.",
    "It will be the second time Sen. Kyrsten Sinema takes part in a Supreme Court confirmation, and the first for Sen. Mark Kelly.",
    "Sinema and Kelly are members of the party that now has control of the Senate, although by the slimmest of margins.",
    "“And that person will be the first Black woman ever nominated to the United States Supreme Court.",
    "It is long overdue.”\nThe Associated Press contributed to this report.",
    "Pass it along to the KTAR News team here.",
    "Have a story idea or tip?",
    "Share\nComments"
  ]
}