{
  "id": 4065,
  "mediaId": 2573,
  "date": "2022-01-26",
  "headline": "Supreme Court math: The Senate formulas for confirming or sinking Stephen Breyer's successor",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/justice-breyer-retires.jpg",
  "link": "https://www.foxnews.com/politics/supreme-court-math-users-manual-confirming-stephen-breyer-successor",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The nomination of a liberal could also help Democrats in the Senate race in Wisconsin against Sen. Ron Johnson, R-Wis.\nSources tell Fox News Digital that Americans might know the nominee well before Justice Breyer finishes his term.",
    "McConnell has held his cards close to his vest when it comes to his Supreme Court strategy if the GOP was in the majority and McConnell was the majority leader in the third year of President Biden’s term.",
    "Susan Collins, R-Maine, and Lisa Murkowski, R-Alaska, voted against breaking off debate on the nomination of Barrett because the nomination and vote dates fell so close to the 2020 presidential election.",
    "Supreme Court Justice Stephen Breyer's upcoming retirement will mark the first time a Democratic U.S. Senate has the chance to confirm a high-court justice in a post-nuclear-option world.",
    "— Senate Republican Leader Mitch McConnell\nBut if there were to be a nominee in 2024, McConnell told Hugh Hewitt that there would not be a confirmation in a presidential election year.",
    "Democrats will need all of their members to vote yes to confirm the nominee and break a filibuster under Nuclear Option II, with Vice President Kamala Harris breaking the tie.",
    "When it comes to filling a vacancy, the goal is usually to have the nominee confirmed before the first Monday in October, the historic start of the Supreme Court term.",
    "However, back in the 1960s Justice Abe Fortas, already on the Supreme Court, faced a filibuster when President Lyndon Johnson nominated him to become chief justice.",
    "Senate sources told Fox News Digital that it's possible Democrats could try to rush the nominee right before the midterms, like the Barrett nomination in 2020.",
    "Liberals will be looking to see who the nominee is - especially since the federal election takeover bill and the Build Back Better legislation are on ice.",
    "In spring 2017, then-Senate Majority Leader Mitch McConnell, R-Ky., detonated \"Nuclear Option II\" to lower the bar to confirm a Supreme Court justice.",
    "Note that McConnell withheld the confirmation of Attorney General Merrick Garland for the Supreme Court in 2016 – because it was an election year.",
    "Barrett's nomination, hearings, and confirmation only took about a month, while most nominees take 60-70 days from nomination to confirmation.",
    "(Photographer: Erin Schaff/The New York Times/Bloomberg via Getty Images)\nNever before had there been a filibuster of a Supreme Court nominee.",
    "Republicans then confirmed Trump picks Brett Kavanaugh and Amy Coney Barrett for the court with the lower threshold to stave off filibusters.",
    "\"I’m not going to start talking about what might happen if I’m the Majority Leader the last two years of [President Biden’s] current term.",
    "\"I’m not going to start talking about what might happen if I’m the Majority Leader the last two years of (President Biden’s) current term.",
    "SUPREME COURT JUSTICE STEPHEN BREYER TO RETIRE – PAVING WAY FOR BIDEN'S FIRST APPOINTMENT\nRush before midterms?",
    "A progressive or minority nominee could bolster Sen. Raphael Warnock, D-Ga., in his re-election bid this fall.",
    "Kavanaugh certainly helped Republicans in the Senate in 2018 - especially after a brutal confirmation fight.",
    "However, Republicans didn’t confirm Barrett until late October 2020, days before the presidential election.",
    "McConnell and Senate Republicans dropped the bar to end a filibuster from 60 yeas to a simple majority.",
    "Otherwise, former President Trump's nomination of Justice Neil Gorsuch would have faced a filibuster.",
    "By the same token, the nomination of a liberal could hurt the re-election of Sen. Mark Kelly, D-Ariz.",
    "Democrats may well need to court a GOP member or two to vote to confirm a Supreme Court nominee.",
    "That said, there has been some chatter that Harris could potentially be a Supreme Court nominee.",
    "But then McConnell rammed through Barrett’s confirmation just days before the 2020 election.",
    "The Senate could begin holding hearings on the nominee long before Breyer leaves the bench.",
    "Chad Pergram currently serves as a congressional correspondent for FOX News Channel (FNC).",
    "(Associated Press)\nDemocrats believe the confirmation could help them in the midterms.",
    "The Senate confirmed Kavanaugh in October 2018, about a month before the midterms.",
    "Collins ultimately voted nay on the nomination but Murkowski voted yes to confirm.",
    "He joined the network in September 2007 and is based out of Washington, D.C.",
    "So what might be the tactics of McConnell, now in the minority?",
    "I’m just not going to comment,\" he told Fox News Digital.",
    "That is UNLESS there are few GOP members willing to help.",
    "That raises a very interesting scenario in the Senate.",
    "The battle to replace him comes down to simple math.",
    "Fortas later resigned from the high court.",
    "As we say, this is always about the math.",
    "Only the vice president may break a tie.",
    "I’m just not going to comment.\"",
    "What might McConnell do?",
    "It’s a 50/50 Senate.",
    "Notably, both Sens.",
    "Period."
  ]
}