{
  "id": 4079,
  "mediaId": 8426,
  "date": "2022-01-22",
  "headline": "Psst: You Really Want to Know Why Manchin and Sinema Came Out Against Voting Rights?",
  "image": "https://blogger.googleusercontent.com/img/a/AVvXsEgE7aChIB2GWMrIywW_L3mTwPpcaEdcE6DyE_vBl5vTFAMMI8EQVCZYeOoXrDgXfPxpzlCrg-Kc9Ds8NTshq_tqLoGDiJTqum6O86YenvgNToP5TKmYGup02axL36b0xXj8EVuxjh6gJQxDJQA3Bo7LWVN1OOfkWyq2vQ5Ov1rMYbuFOsEqF8xEkKaK=w1200-h630-p-k-no-nu",
  "link": "http://rimcountrygazette.blogspot.com/2022/01/psst-you-really-want-to-know-why.html",
  "mediaOutlet": "rimcountrygazette.blogspot.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Keyworth",
  "authorUrl": "https://www.blogger.com/profile/16778065398076170813",
  "termIds": [
    0
  ],
  "sentences": [
    "Bill Clinton would talk to senators (or, for that matter, to almost anyone else) all the time, but Clinton had too much confidence in his own charm to give individual senators the ego boosts they wanted — thereby rubbing the most narcissistic of them the wrong way (Nebraska senator Bob Kerrey voted against Clinton’s healthcare plan because he wanted more attention; New York senator Daniel Patrick Moynihan was lukewarm on it because he felt he wasn’t adequately consulted).",
    "Again and again, I’ve watched worthy legislation sink because particular senators didn’t feel they were getting enough credit, or enough personal attention from a president, or insufficient press attention, or unwanted press attention, or that another senator (sometimes from the same party) was getting too much attention.",
    "Several people on the Hill who have watched Sinema at close range since she became a senator tell me she relished all the negative attention she got when she gave her very theatrical thumbs down to increasing the minimum wage, and since then has thrilled at her burgeoning role as a spoiler.",
    "“It’s because he’s so pissed off at Ron Klain [Biden’s chief of staff].” I’m also told that if Biden wants to restart negotiations with Manchin on “Build Back Better,” he’s got to rename the package because Manchin is so angry he won’t vote for anything going by that name.",
    "Why did they say they couldn’t support changing the filibuster rules when only last month they voted for an exception to the filibuster that allowed debt ceiling legislation to pass with only Democratic votes?",
    "Before February of last year, almost no one outside West Virginia had ever heard of Joe Manchin, and almost no one outside of Arizona (and probably few within the state) had ever heard of Kyrsten Sinema.",
    "I’m talking about narcissism – the primal force driving so much of modern America, but whose essence is concentrated in certain places such as Wall Street, Hollywood, and the United States Senate.",
    "Yet out of one hundred senators, only a handful are chosen for interviews on the Sunday talk shows, only one or two are lampooned on SNL, and very few get a realistic shot at the presidency.",
    "Then Trump directed a huge amp of national attention Graham’s way — transmogrifying Graham into a bizarro creature who’d say anything Trump wanted in order to keep the attention coming.",
    "But as I’ve watched the two senators closely and spoken about them with members of Congress as well as Hill staff, I’ve come to the conclusion this isn’t it – or at least not all of it.",
    "I’m told that Manchin asked Biden’s staff not to blame him for the delay of “Build Back Better,” and was then infuriated when Biden suggested Manchin bore some of the responsibility.",
    "They must have figured that the only way they could keep the spotlight focused on themselves was by threatening to do what they finally did this week — shafting American democracy.",
    "Barack Obama didn’t enjoy glad-handing senators, even though he got to the presidency through that august body — which proved a huge handicap when it came to legislating.",
    "Why did they create a false narrative that the legislation had to be “bipartisan” when everyone -- themselves included -- knew bipartisanship was impossible?",
    "I know several now serving who have their egos firmly in check — including Mark Kelly, Raphael Warnock, Sherrod Brown, Bernie Sanders, and Elizabeth Warren.",
    "I had the good fortune to work closely with the late Paul Wellstone, who was always eager to give others credit while being the first to take any blame.",
    "I’ve suggested that the answer to all these questions could be found in the giant wads of corporate cash flowing into their campaign coffers.",
    "The corporate money explanation leaves out the single biggest factor affecting almost all national politicians I’ve dealt with: Big egos.",
    "Once addicted, the pathologically narcissistic politician can become petty in the extreme, taking every slight as a deep personal insult.",
    "Paradoxically, a large enough slight played out on the national stage can also enthrall a pathologically narcissistic politician.",
    "The Senate is not the world’s greatest deliberative body, but it is the world’s greatest stew of egos battling for attention.",
    "“You want to understand why Manchin stabbed Biden in the back on voting rights?” one House member told me this week.",
    "Why did they co-sponsor voting rights legislation and then vote to kill the very same legislation?",
    "Some senators get so whacky in the national limelight that they can’t function without it.",
    "What can possibly explain Manchin’s and Sinema’s votes against voting rights this week?",
    "I’ve known politicians who have become permanently and irrevocably intoxicated by it.",
    "Why did Manchin vote for the “talking filibuster” in 2011 yet vote against it now?",
    "Most believe they’re far more competent than whoever occupies the Oval Office.",
    "Most of the rest lie on an ego spectrum ranging from inflated to pathological.",
    "As I said, neither had much national attention prior to the last February.",
    "But once they got a taste of the national spotlight, they couldn’t let go.",
    "I’m not talking simply about power, although that’s certainly part of it.",
    "Once it seeps into the bloodstream, it becomes an all-consuming force.",
    "Every senator believes he or she has what it takes to be president.",
    "By Robert Reich\n22 January 22\nIt wasn't just the corporate cash.",
    "Before Trump, Lindsay Graham was almost a normal human being.",
    "The result is intense competition for national attention.",
    "Their photos grace every major news outlet in America.",
    "Manchin’s and Sinema’s are now among the biggest.",
    "Not all senators are egomaniacs, of course.",
    "Manchin and Sinema are near the extreme.",
    "Trump had that effect on Republicans.",
    "This sort of attention is addictive.",
    "They’re Washington celebrities.",
    "Now, they’re notorious."
  ]
}