{
  "id": 4093,
  "mediaId": 2634,
  "date": "2022-01-20",
  "headline": "Hope and Despair on Capitol Hill as Democrats’ Voting Reforms Die by Republican Filibuster (and Manchinema)",
  "image": "https://images.newrepublic.com/833e2cb8410f96334114b8a6e21a68628a922aec.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/165075/voting-rights-manchin-sinema-filibuster",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grace Segers",
  "authorUrl": "https://newrepublic.com/authors/grace-segers",
  "termIds": [
    0
  ],
  "sentences": [
    "“It’s time we do the hard work to forge the difficult compromises that can stand the test of time.”\nSenator Raphael Warnock of Georgia, a staunch advocate for reforming the filibuster, countered in a speech later on Wednesday: “I believe that voting rights are more important than a procedural rule.” Warnock cited Senator Robert Byrd of West Virginia, whom Manchin has quoted as an inspiration in his desire to preserve the filibuster, noting that Byrd later regretted his decision to filibuster civil rights legislation.",
    "But despite their support of both the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act—Manchin helped to craft the former and shopped it to Republicans for months in an effort to garner support—the two opposed the rules change that would permit either or both to be enacted.",
    "“Senators’ job is to vote, and to vote on the most important issues facing us, and vote we will.”\nBoth of the voting rights measures had previously been blocked by Republicans last year, but Democrats used a procedural gambit to allow them to be debated for the first time this week.",
    "Schumer launched a long-shot effort to have the voting rights legislation subject to a “talking filibuster,” meaning that Republicans would have to hold the floor and speak in opposition to the bill, followed by a vote allowing the bill to advance with a simple majority.",
    "“It’s going to be harder to claim that these laws either violate the equal protection clause of the Constitution or that they violate section two of the Voting Rights Act,” said Rick Hasen, a law professor at the University of California, Irvine.",
    "The Supreme Court last June upheld voting laws in Arizona that critics contended disproportionately affected minority voters, in a ruling that would likely make it more difficult for challengers to prove that an election law is discriminatory.",
    "Just as the orchestra playing “Nearer My God to Thee” on the decks of the Titanic surely understood as it stoically sank into the murky depths of the Atlantic, Democrats knew well in advance of the two votes that they were doomed to fail.",
    "Senator Jeff Merkley, an ardent supporter of the talking filibuster who worked to craft the Freedom to Vote Act, said that it would be difficult to move forward with the component parts of the bills because they lack Republican support.",
    "“We know it’s an uphill fight, but whenever this chamber confronts a question this important—one so vital to our country—you don’t slide it off the table and say ‘never mind,’” Schumer said in a morning speech on the Senate floor.",
    "But Manchin has insisted that he would not support a change to the Senate rules unless it passed with a two-thirds threshold, and obtaining support from 17 Republicans is even more difficult than trying to get the votes of 10.",
    "I think the Senate, if the forefathers looked at the Senate today, they would sit there, and shake their heads, and say, ‘What has gone wrong?’” Senator Jon Tester said in his speech on the Senate floor ahead of the vote.",
    "Democrats’ hopes of passing federal legislation to counter a raft of measures restricting voting rights introduced in Republican-controlled states were dashed against the familiar rocks of Senate procedure on Wednesday.",
    "Senators from both parties delivered speeches for or against the bills on Wednesday, with most Democrats remaining seated on the Senate floor while their colleagues spoke throughout the day in a rare display of unity.",
    "The Freedom to Vote Act addresses elections and campaign finance reform, while the John Lewis Voting Rights Advancement Act would restore a provision of the 1965 Voting Rights Act gutted by the Supreme Court in 2013.",
    "“If Congress makes it clear that it cannot act to protect voting rights on a national level … then that gives a green light to states to do their worst,” said Michael Waldman, the president of the Brennan Center.",
    "“Protecting the vote-by-mail system used by a majority of Arizonans and getting dark money out of our elections is too important to let fall victim to Washington dysfunction,” Kelly said in a statement.)",
    "But despite appeals from both their fellow Democrats and President Joe Biden, Senators Joe Manchin and Kyrsten Sinema remained firm in their opposition to eliminating or even weakening the filibuster.",
    "Unable to muster sufficient Republican support, the Senate failed to advance a measure containing two voting rights bills, the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act.",
    "Sinema also reiterated her opposition to weakening the filibuster in a speech last week, before Biden traveled to the Capitol to make a personal appeal to Democrats to support a rules change.",
    "Most legislation requires 60 votes to advance, and Democrats only hold a 50-vote majority, meaning that even with unified majority support, passing the bill would be nigh impossible.",
    "Representative Joyce Beatty told reporters that “we will come back with a clear plan” to move forward with voting rights, highlighting such issues as redistricting and ballot access.",
    "A defiant Vice President Kamala Harris vowed that the fight to counter this voter suppression campaign would continue: “The president and I are not going to give up on this issue.",
    "After hours of impassioned remarks, the Senate first held an unsuccessful vote to advance the measure and then to change the rules to allow for it to pass with a simple majority.",
    "This is fundamental to our democracy, and it is nonnegotiable.”\nBut without federal action, those hoping to challenge restrictive state measures may have to opt for litigation.",
    "If Democrats wanted to work on separate bills on campaign finance or countering election subversion, he said, they would still be unlikely to garner Republican votes.",
    "(The junior senator from Arizona, Mark Kelly, who unlike Sinema is up for reelection this year, announced on Wednesday morning that he would support a rules change.",
    "Hasen also noted that the Justice Department had brought challenges to recent laws passed in Texas and Georgia but that these lawsuits were relatively narrow.",
    "A group of moderate Democrats, including Manchin, have engaged for months in conversations about modifying Senate rules to smooth the functioning of the body.",
    "He also noted that only one Republican, Murkowski, supported the John Lewis Voting Rights Advancement Act, meaning that its future in the Senate was also dim.",
    "They’re supporting a racist strategy for keeping people from voting, because it’s primarily Black precincts that are affected in this fashion,” Merkley said.",
    "She said that Common Cause would work to educate voters about their rights, recruiting poll monitors and support groups that are bringing forward litigation.",
    "And there’s every reason to think that this movement that is now mobilized and energized on this will continue and be stronger than before,” Waldman said.",
    "A subsequent attempt to change Senate rules to allow the bills to pass by a simple majority was stymied by opposition from two Democratic senators.",
    "So the majority of Democrats decided that the threat to voting rights necessitated a change in filibuster rules, if only to pass this one measure.",
    "Given that the Supreme Court has twice gutted provisions of the 1965 Voting Rights Act in recent years, these laws may be difficult to challenge.",
    "“There are going to be a lot of fronts to fight this battle at the state level, but in many ways it’s going to be a whack-a-mole,” Flynn said.",
    "With their concerns in mind, Democrats proposed a one-time carve-out that would ensure the bill could pass while allowing for robust debate.",
    "However, Waldman argued that activism from voting rights advocates did make a difference, even if restrictive measures ultimately passed.",
    "We’re going to continue to fight, as we are also fighting at the state level,” said Karen Hobert Flynn, the president of Common Cause.",
    "He slammed Republicans for supporting bills that limited ballot access with provisions such as reducing the number of polling places.",
    "In 2021, at least 19 states passed 34 laws restricting access to voting, according to the left-leaning Brennan Center for Justice.",
    "In Georgia, provisions that would have banned Sunday voting and no-excuse absentee voting were excluded from the final bills.",
    "“Just because this vote will most likely fail, it is not a defeat,” Booker told The New Republic ahead of the evening vote.",
    "I would say, pretty much, the knife has been put through the heart of fair elections in America if we fail,” Merkley said.",
    "“If it goes down, I see that as a setback, which is a setup for a comeback,” said Representative Terri Sewell.",
    "Members of the Congressional Black Caucus took a bullish tone in a press conference ahead of the Senate vote.",
    "“Eliminating the filibuster would be the easy way out,” Manchin said in a speech on the Senate floor.",
    "The party is left mulling the way forward, given the intransigence of Joe Manchin and Kyrsten Sinema.",
    "He said that the laws passed in Texas and Georgia were less extreme than the initial proposals.",
    "“The legal environment is such that many of these challenges will be hard to bring,” he said.",
    "More than 150 measures in 18 states will carry over into the 2022 legislative session.",
    "“There’s going to be continued discussions,” Senator Ben Cardin told The New Republic.",
    "Senator Cory Booker said that “the imperatives are too great” to give up on the issue.",
    "“It’s incredibly racial, despite my colleagues saying they’re not racist.",
    "Voting rights advocates insist that Wednesday’s failures are not the end.",
    "Some Democrats insisted that the fight was not over in the Senate.",
    "“We’re not going to give up and take our marbles and go home.",
    "“I don’t think this is blowing up the Senate at all.",
    "“Vigorous advocacy at the state level has an impact.",
    "“I really don’t know where we go from here.",
    "“Robert Byrd learned from history.",
    "Will we?” Warnock said."
  ]
}