{
  "id": 412,
  "mediaId": 8350,
  "date": "2022-02-24",
  "headline": "Arizona Sens. Sinema, Kelly bash Russia’s invasion of Ukraine",
  "image": "https://ktar.com/wp-content/uploads/2022/01/sinema-kelly-split-getty.jpg",
  "link": "https://ktar.com/story/4908008/arizona-sens-sinema-kelly-bash-russias-invasion-of-ukraine/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Sinema told KTAR News 92.3 FM’s Gaydos and Chad hours before the attack she has been “working closely with the Department of Defense and our folks down at Davis-Monthan Air Force Base [near Tucson], where we are mobilized and ready to join a NATO response force if called.”\nThe attack targeted a country the size of Texas that has increasingly tilted toward the democratic West and away from Moscow’s sway.",
    "“I support increased, aggressive sanctions, and call on NATO and other democratic, peaceful countries to stand united in swift, decisive action against Russia’s aggression.”\nKelly, who sits on the Senate Armed Services Committee, called the attack, “unprovoked and unjust” in a press release late Wednesday.",
    "“Russia’s illegal, unprovoked attacks on free and democratic Ukraine directly threaten American national security interests and the sovereignty of our allies,” Sinema said in press release Thursday.",
    "And we must work to quickly impose the maximum sanctions on Putin and the Russian government,” said Kelly, who also chairs the Senate Subcommittee on Emerging Threats and Capabilities.",
    "Russia launched a wide-ranging attack on Ukraine, hitting cities and bases with airstrikes or shelling, as civilians piled into trains and cars to flee.",
    "Kyrsten Sinema and Mark Kelly said they support Ukraine efforts to defend itself on the heels of an invasion by Russia.",
    "“The United States, alongside our NATO allies, must be resolute in our support for the Ukrainian people.",
    "He bears responsibility and must be held to account,” Kelly said.",
    "The Associated Press contributed to this report.",
    "“Putin has chosen a devastating and illegal war.",
    "PHOENIX – Arizona’s U.S. Sens.",
    "Share\nComments"
  ]
}