{
  "id": 4212,
  "mediaId": 2520,
  "date": "2022-01-26",
  "headline": "Arizona Democrats censuring Sen. Kyrsten Sinema was stupid and pointless",
  "image": "https://www.gannett-cdn.com/presto/2022/01/13/USAT/f0deaa3a-4c49-4a1a-8d1f-7dda7232744f-GTY_1235979395.jpg?crop=3999,2250,x0,y201&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/ej-montini/2022/01/26/arizona-democrats-censure-sen-kyrsten-sinema-stupid-pointless/9218657002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "EJ Montini",
  "authorUrl": "https://www.azcentral.com/staff/2646830001/ej-montini/",
  "termIds": [
    0
  ],
  "sentences": [
    "A statement from the group reads in part, “While we take no pleasure in this announcement, the ADP Executive Board has decided to formally censure Senator Sinema as a result of her failure to do whatever it takes to ensure the health of our democracy.”\nThey “take no pleasure.”\nThey also impose no real punishment.",
    "If they had been keeping tabs on state Republicans, even a little bit, they would have noted that censuring an elected official or other prominent member of your political party has become a completely pointless exercise.",
    "One that not only has no ill effect on the branded outlier, but in some ways actually enhances the person’s profile and can raise the censured politician’s popularity within the broader community.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Last weekend, members of the Arizona Democratic Party executive committee passed a resolution to censure Sen. Kyrsten Sinema over her vote to keep the filibuster.",
    "You can't shame the shameless, like Sinema\nThese days, there’s not a politician in Washington, D.C., or practically anywhere else, who can be shamed.",
    "Sinema can use the censure as proof that she, like McCain, isn’t afraid to go against the wishes of her party for something she believes in.",
    "Opinion: The notion of censure as a punitive measure comes from a time when politicians had a personal sense of honor and could be shamed.",
    "In other words, more often than not, slapping a politician with a censure does just the opposite of what was intended.",
    "Unlike Kelly, however, it seems that Arizona’s Democrats have not been paying attention – at all – to the other guys.",
    "He said through a campaign spokeswoman that he doesn’t support state Democrats censuring Sen. Kyrsten Sinema.",
    "The notion of censure as a punitive measure comes from a time when politicians had a personal sense of honor.",
    "With a censure, Gosar did not lose his title, his salary, his staff, his office or his ability to vote.",
    "He called the censure “kabuki theater” and probably won over more of his constituents than he lost.",
    "“For too long we have waited, hoping Senator McCain would return to our Party’s values on his own.",
    "The Arizona GOP also censured McCain’s wife, Cindy, along with former Sen. Jeff Flake and Gov.",
    "Arizona’s wackiest member of Congress, Rep. Paul Gosar, was censured by House members.",
    "Arizona Republicans have stupidly done this to their own over the past several years.",
    "The Arizona Republican Party censured the late Sen. John McCain.",
    "Republicans are dumb, Democrats are dumber\nIt is nonsensical.",
    "What once was a scarlet letter is now a badge of honor.",
    "They weren’t willing to expel him, which he deserved.",
    "That has not happened,” they said in a statement.",
    "Reach Montini at ed.montini@arizonarepublic.com.",
    "Does censuring an elected official do any good?",
    "For more opinions content, please subscribe.",
    "And now, Democrats have stupidly copied it.",
    "That wasn’t always the case, of course.",
    "That’s how censure works in the 2020s.",
    "McCain never lost an Arizona election.",
    "Censure was once a scarlet letter.",
    "Being censured was being shamed.",
    "No more\nDoes anyone remember?",
    "Sen. Mark Kelly is right.",
    "And it meant something.",
    "For the politician.",
    "Does anyone care?",
    "No consequences.",
    "No nothing.",
    "Doug Ducey.",
    "Publicly.",
    "Yes.",
    "No.",
    "Ha!",
    "No.",
    "Ha!"
  ]
}