{
  "id": 4237,
  "mediaId": 2883,
  "date": "2022-01-20",
  "headline": "House path toward bolstering stock rules is hazy",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/01/snow_BC_001_010322-1.jpg",
  "link": "https://rollcall.com/2022/01/20/house-path-toward-bolstering-stock-rules-is-hazy/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Marquette",
  "authorUrl": "https://www.rollcall.com/author/chris-marquette/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Office of Congressional Ethics found in its report that Victoria made an “uncharacteristic stock purchase” in Cleveland-Cliffs and profited from the buy, which occurred just after Kelly, “in the course of his official job duties, learned confidential information about the company.”\nCleveland-Cliffs owns a plant in Kelly’s western Pennsylvania district that employs 1,400 workers, a company that is the only remaining American producer of grain-oriented electrical steel used in domestic power grid transformers.",
    "Despite Pelosi’s comment in December, Drew Hammill, a spokesperson for the speaker, said she has tasked House Administration Chair Zoe Lofgren, D-Calif., with examining the “issue of Members’ unacceptable noncompliance with the reporting requirements in the STOCK Act, including the possibility of stiffening penalties.” Additionally, Pelosi has asked Lofgren’s panel to review existing legislative proposals in the House that seek to curb the ability of lawmakers to trade stocks.",
    "In a statement, Lofgren said Pelosi is “correct to observe the issue of some Members’ noncompliance with these important reporting requirements merits a fresh review of the law, including its enforcement requirements and penalties for noncompliance.”\nMembers of Congress have regular access to nonpublic information, for instance, company-specific news or knowledge of whether a specific business industry will receive a bailout that could move markets.",
    "“We’ll see what happens.”\nRep. Bryan Steil, a Wisconsin Republican who serves on both the House Administration and Financial Services committees, said the proposal of requiring members to put some assets in a blind trust is “absolutely worth exploring,” but he noted that there is a lot of nuance to the matter and raised questions about whether the problem would be solved by placing assets in a blind trust.",
    "Pete Aguilar, D-Calif., the caucus vice chair who also serves on the House Administration Committee, echoed Jeffries’ sentiment about stock ownership and said that “these members are going to be able to make their case to committees of jurisdiction.”\n“We’re going to be open to legislative solutions if it ensures compliance,” Aguilar added.",
    "Rep. Jason Crow, a Colorado Democrat, said he supports “anything that we can do to increase transparency and accountability and restore confidence in the institution.”\nUnder investigation\nRep. Mike Kelly is currently being investigated by the House Ethics Committee for a trade his wife, Victoria, made in Cleveland-Cliffs stock.",
    "Missouri Republican Rep. Blaine Luetkemeyer, a member of the Financial Services Committee, said McCarthy asked him and others on the panel to “look at ideas of ways to be more transparent or be more efficient in the way things are reported” and to “review the situation, the process.”\n“Take a look at it,” Luetkemeyer said.",
    "Responding to a question in December about whether members and their spouses should be banned from trading individual stocks, Speaker Nancy Pelosi said “no.” Periodic transaction reports that Pelosi has filed show her husband, Paul, trades large sums of individual company stocks such as Alphabet and Salesforce.",
    "A bipartisan measure from the 116th Congress that was reintroduced in January 2021, led by Reps. Abigail Spanberger, D-Va., and Chip Roy, R-Texas, would require members, spouses and dependent children to put certain investments, such as individual company stocks, into a qualified blind trust.",
    "Those questions have been reenergized by Insider’s reporting that found many members of Congress weren’t properly reporting their trades in violation of the Stop Trading on Congressional Knowledge (STOCK) Act of 2012, a law designed to prevent insider trading through disclosure requirements.",
    "You know, if somebody’s doing insider trading, obviously, that’s illegal.”\nFormer Rep. Chris Collins, R-N.Y., is the most recent instance of a member of Congress prosecuted for insider trading, although it was brought as a more traditional insider trading case and not under the STOCK Act.",
    "When senators sold off loads of stock at the beginning of the coronavirus pandemic after nonpublic briefings in early 2020, the perceived impropriety of those trades raised questions about whether members should be allowed to trade individual company stock and even beyond that.",
    "“And so I think we have a real opportunity to improve the rules to give the American people more confidence that members are being held accountable.”\nRep. Sean Patrick Maloney, D-N.Y., said he is open to requiring members to place their assets in a blind trust.",
    "“I’m happy with whatever reforms people have proposed,” adding it’s “OK with me.” Maloney, the chair of the Democratic Congressional Campaign Committee, was cited by Insider as a member who violated the STOCK Act for disclosing his stock sales late.",
    "'Ongoing discussions'\nHouse Democratic Caucus Chairman Hakeem Jeffries of New York said he doesn’t own individual stocks, nor does he intend to own individual stocks, but he didn’t say whether he supported a ban on members trading them.",
    "Ideas the California Republican has floated include prohibiting members from holding stocks in companies or industries their committees oversee or limiting portfolios to professionally managed mutual funds, according to Punchbowl.",
    "For instance, lawmakers who outsource their money management to a blind trust, or third party, could have influence on the strategy by warning their investment advisers of forthcoming large economic shutdowns or massive bailouts.",
    "“I look forward to working with members and stakeholders to determine whether new strategies to enhance transparency and accountability and to create public confidence in the United States Congress can be devised,” Lofgren added.",
    "He used material, nonpublic information gleaned from his position as a corporate director to tip off those close to him to sell the company’s stock before the public release of a failed drug trial that would tank the stock price.",
    "“As the Chair of the House Democratic Caucus, I don’t get out ahead of members when there are ongoing discussions about how to deal with issues of importance to them,” Jeffries said, noting there are several bills to consider.",
    "The next day, Victoria bought between $15,001 and $50,000 in Cleveland-Cliffs securities, a trade made shortly after the company decided against issuing termination notices to 13 percent of its workforce, the OCE report said.",
    "Some experts have even called for rules to go further and ban members from holding sector-specific exchange-traded funds that track the same markets their committees oversee, such as health care or energy.",
    "Debate on tighter restrictions for member stock trading has become a popular topic on Capitol Hill, but a lack of consensus in the House on how to proceed makes it unclear what, if anything, will be done.",
    "Steil, who said he spoke to McCarthy at a high-level, noted the challenge will be “getting the language right.”\n“The appearance of impropriety to the public damages the institution,” Steil said.",
    "Members are required to disclose certain securities transactions over $1,000 made by them, their dependent spouse or their children no later than 45 days after the trade execution.",
    "That bill is sponsored by Sen. Jeff Merkley, D-Ore., Rep. Raja Krishnamoorthi, D-Ill., and has support from Republican Reps. Matt Gaetz of Florida and Michael Cloud of Texas.",
    "Should they just completely disregard their future?”\nKelly said he didn’t have any opinion on whether members should be required to put their stocks in a blind trust.",
    "Kelly’s staff, the OCE report said, found out on April 28, 2020, that the Commerce Department intended to open an investigation that would benefit Cleveland-Cliffs.",
    "Another bipartisan bill, introduced in March 2021, would prohibit members and senior staff from trading individual stocks and from serving on corporate boards.",
    "That plant was at risk of being shut down if not for government action to address foreign steel companies circumventing tariffs and undercutting its business.",
    "Under the STOCK Act, members have a duty to refrain from using insider information to trade on material, nonpublic information they gather as officeholders.",
    "Rep. Tom Malinowski, a New Jersey Democrat, is also being investigated by the House Ethics Committee for failing to report many stock trades.",
    "House GOP leader Kevin McCarthy told Punchbowl News last week he is mulling over limiting what kinds of stocks members can hold and trade.",
    "These periodic transaction reports are not required for widely held investment funds such as mutual funds or exchange-traded funds.",
    "Collins was a corporate director for the company, Innate Immunotherapeutics, and had a fiduciary duty to the shareholders.",
    "In the wake of the Collins case, the House prohibited members from serving as officers or directors at public companies.",
    "Insider reported that Malinowski failed to disclose dozens of stock transactions worth hundreds of thousands of dollars.",
    "A similar bill was introduced last week in the Senate by Democrats Jon Ossoff of Georgia and Mark Kelly of Arizona.",
    "All these proposals, though, face the same challenge: There is not much certainty on how, specifically, to proceed.",
    "“Obviously, if there’s problems, frankly, some of the problems I’ve heard are things that are already illegal.",
    "House Republican Whip Steve Scalise of Louisiana didn’t say whether he supported further restrictions.",
    "Collins pleaded guilty, went to federal prison and then was pardoned by former President Donald Trump.",
    "If a transaction is not reported on time, the penalty for late transactions is $200.",
    "Should they take a vow of poverty before they run for Congress?” Kelly said.",
    "Widely held investment funds like mutual funds would be exempt.",
    "“I know there are already a lot of limitations,” Scalise said.",
    "“Should they just get rid of everything they own?",
    "Those he tipped off avoided $768,000 in losses.",
    "“So what is it that they’re allowed to do?"
  ]
}