{
  "id": 4251,
  "mediaId": 2574,
  "date": "2022-01-19",
  "headline": "Biden Uses Infrastructure Bill To Fulfill Ask from Hedge Fund Billionaire Donor’s Foundation",
  "image": "https://freebeacon.com/wp-content/uploads/2021/02/GettyImages-1185542993-e1642614146704.jpg",
  "link": "https://freebeacon.com/biden-administration/biden-uses-infrastructure-bill-to-boost-hedge-fund-billionaire-donors-foundation/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Collin Anderson",
  "authorUrl": "https://freebeacon.com/author/collin-anderson/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"The Biden-Harris administration will commit $5.5 billion through the President’s Bipartisan Infrastructure Law to better protect communities from climate change, and protect vital ecosystems and the people and businesses throughout the country that rely on them.\"",
    "Arizona senator Mark Kelly (D.), for example, assured reporters that he did not know Jones and \"of course disagrees with his comments\" after the Arizona Republic highlighted a 2017 paid speech he gave to the Everglades Foundation.",
    "President Joe Biden used his $1 trillion infrastructure bill to boost an environmental foundation run by a hedge fund billionaire who contributed tens of thousands of dollars to the Democrat's campaign.",
    "\"It's Washington's turn to help, with $725 million a year in matching dollars for Everglades restoration,\" Jones's foundation said in a national ad that aired shortly after Biden's inauguration.",
    "The move comes less than a year after billionaire investor and Everglades Foundation founder Paul Tudor Jones lobbied the Biden administration to commit $2.9 billion to the group's cause.",
    "In addition to Jones's status as a prominent Biden donor, Biden's Interior Department hired the foundation's former CEO, Shann Estenoz, to serve as its policy head for national parks.",
    "The White House touted the Everglades investment in a Wednesday fact sheet, saying the move will \"bolster our defenses against climate change\" and \"advance environmental justice.\"",
    "\"President Biden knows that down payments now to bolster the resilience of our infrastructure to climate change will save Americans money in the long run,\" the fact sheet states.",
    "The Biden campaign accepted Jones's money during the 2020 election cycle despite the billionaire's past support for disgraced Hollywood mogul Harvey Weinstein.",
    "The White House on Wednesday announced $1.1 billion in funding from Biden's infrastructure bill will go toward preserving the Everglades in southern Florida.",
    "Jones, who served on the Weinstein Company's board, emailed Weinstein in 2017 to console his longtime friend following allegations of sexual assault.",
    "Just months before making the ask, Jones contributed $50,000 to the Biden Victory Fund and an additional $2,800 to Biden's campaign.",
    "The foundation celebrated the move—Estenoz's successor said he was \"thrilled\" to see her join the administration.",
    "After the email's release, some prominent Democrats were forced to distance themselves from Jones.",
    "… The good news is, this will go away sooner than you think and it will be forgotten!\"",
    "Biden did not face criticism for his campaign's association with Jones.",
    "\"Focus on the future as America loves a great comeback story.",
    "The White House did not return a request for comment.",
    "\"I love you,\" Jones wrote in the message.",
    "\"President Biden, let's finish the job.\""
  ]
}