{
  "id": 4259,
  "mediaId": 2523,
  "date": "2022-01-26",
  "headline": "Matthew Stafford's Wife Kelly Says Ndamukong Suh 'Really Dislikes' Rams QB",
  "image": "https://media.bleacherreport.com/image/upload/v1643207602/liknladkpkaychbavc9q.jpg",
  "link": "https://bleacherreport.com/articles/10024996-matthew-staffords-wife-kelly-says-ndamukong-suh-really-dislikes-rams-qb",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Wells",
  "authorUrl": "https://bleacherreport.com/users/552fd1ff-4f15-4bf0-9b0c-8bdc7f6d25c3",
  "termIds": [
    0
  ],
  "sentences": [
    "Officials flagged Suh for taunting when he started jawing at Stafford after a quick pressure forced an incomplete pass, but the Bucs defensive tackle was heard telling the referee Stafford kicked him prior to the incident.",
    "\"And it has become this weird dynamic in the past couple years, like, Suh will come out in the media and stay stuff, whatever, it doesn't even matter, it doesn't faze Matthew ... it is what it is,\" she added.",
    "Suh and Stafford had a brief exchange on the field in the first quarter of Sunday's NFC Divisional Round game between the Los Angeles Rams and Tampa Bay Buccaneers at Raymond James Stadium.",
    "Stafford and the Rams got the last laugh Sunday with a 30-27 win over Suh and the Bucs to reach the NFC Championship Game for the second time in the past four seasons.",
    "He's been fined several times for dirty plays, including stepping on Aaron Rodgers' calf during a 2014 game between the Lions and Green Bay Packers.",
    "On The Morning After with Kelly Stafford (starts at 13:15 mark), Kelly Stafford, Matthew's wife, said Suh \"really doesn't like\" her husband.",
    "Despite spending five seasons together as teammates, Matthew Stafford and Ndamukong Suh apparently don't have a friendly relationship.",
    "There was a brief moment when Stafford extended his leg as Suh was rolling off him, though it didn't appear to be a kick.",
    "Since coming into the NFL in 2010, Suh's career has been defined as much by his reputation as his football performance.",
    "They had some success together with a playoff appearance in 2011 and '14.",
    "Suh and Stafford were teammates from 2010 to '14 with the Detroit Lions."
  ]
}