{
  "id": 4291,
  "mediaId": 2752,
  "date": "2022-01-19",
  "headline": "Mark Kelly Supports Filibuster Reform, So Don't Blame 'Arizona,' OK, KYRSTEN SINEMA?",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yODg2MjA0Ny9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY1MzgyNDA4OX0.4jEWym7-zkw0SABoczazN84rxDkv6hgzPrgc_nakXGM/img.jpg?width=1200&coordinates=0%2C0%2C0%2C133&height=600",
  "link": "https://www.wonkette.com/mark-kelly-supports-filibuster-reform-so-stop-blaming-arizona-ok-kyrsten",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Doktor Zoom",
  "authorUrl": "https://www.wonkette.com/u/doktor_zoom",
  "termIds": [
    0
  ],
  "sentences": [
    "“Whether the Senate fails or succeeds in passing this legislation, I will continue doing this job just as I promised Arizonans: delivering results by working with Republicans and Democrats to find common ground as we have on infrastructure, standing up to party politics, and staying focused on doing what is best for Arizona.”\nHe added that the Senate has largely become dysfunctional due to \"partisanship,\" although it's pretty clear Kelly didn't mean that in a both-sidesy kind of way:\n“We’re seeing that now, as voting rights legislation remains blocked while partisan politicians work to undermine Arizona’s successful vote-by-mail system and create more barriers to vote,” his statement said.",
    "He is a far-left senator who will do whatever Joe Biden and Washington Democrat leadership tell him to in order to pass a radically liberal agenda,\" Katharine Cooksey, a spokesperson for the Senate Republicans' campaign arm, the National Republican Senatorial Committee, said in a statement.",
    "Kelly, always happy to remind folks that he's an astronaut who has been to space, also said that if \"NASA or the Navy functioned like the United States Senate, we would never get the rocket off the launchpad and in combat we’d never complete the mission.\"",
    "With the Senate debating landmark voting rights legislation this evening, Sen. Mark Kelly (D-Arizona) will support changing the Senate's filibuster rule so the package of voting protections can be passed, the Arizona Republic reports.",
    "The former astronaut is in favor of passing a rule change for the voting rights bill that would require a \"talking\" filibuster, so that Republicans would have to keep talking as long as they want to block the bill's moving to a vote.",
    "The Republic reports that Kelly has previously defended the widespread use of voting by mail from attacks by Donald Trump and other Republicans, but until today, he hadn't taken a definite position on modifying the filibuster.",
    "Protecting the vote-by-mail system used by a majority of Arizonans and getting dark money out of our elections is too important to let fall victim to Washington dysfunction,” Kelly said in a statement to The Republic.",
    "In a statement also posted to his official website, Kelly said,\n“If campaign finance and voting rights reforms are blocked again this week, I will support the proposed changes to pass them with a majority vote.",
    "He called for the Senate to become \"more responsive to the challenges facing our country,\" and if rules changes are needed to accomplish that, well then let's change the rules and get stuff done.",
    "The legislation is still expected to fail to pass in the Senate because none of the 50 Republicans in the body will vote for it, and because changes to the filibuster are still opposed by Sens.",
    "No surprise, Republicans were quick to condemn Kelly's statement, because where does he get the idea that people should be able to vote without Republicans deciding who wins?",
    "Protecting the right to vote is so radical, especially if it means any old citizens are allowed to choose leaders who aren't Donald Trump.",
    "Kelly is up for reelection this fall, so what's YOUR excuse for not doing something that might be a bit politically risky, KYRSTEN SINEMA?",
    "Kelly had been among the few remaining Democrats in the Senate who hadn't already said they supported the rules change for voting rights.",
    "If you can, please give $5 or $10 a month to help us keep you up to date on whether we still have a democracy.",
    "Joe Manchin (D-West Virginia) and Arizona's other senator, Kyrsten Sinema.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "Yr Wonkette is funded entirely by reader donations.",
    "How often would you like to donate?",
    "“Kelly is no moderate.",
    "How true this is.",
    "So far, so good!",
    "OPEN THREAD."
  ]
}