{
  "id": 43,
  "mediaId": 2658,
  "date": "2022-02-21",
  "headline": "POLITICO Playbook: The reasons for optimism — but more pessimism — in Ukraine",
  "image": "https://static.politico.com/f9/3c/9d6ac9fa48c88a63e310c396b431/220221-wh-gty-nl-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/02/21/the-reasons-for-optimism-but-more-pessimism-in-ukraine-00010414",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4195,
    4591,
    4905,
    2859,
    2885,
    1063,
    6569,
    6672,
    6678
  ],
  "sentences": [
    "But in the meantime, in what Friedman calls “an ironic twist, the fallout from the judge’s ruling — at least initially — is that the federal government has stopped work on new oil and gas leases, as well as permits to drill on federal lands and waters.”\nANNALS OF INFLUENCE — Nonprofits are warning that the Justice Department’s enforcement of the Foreign Agents Registration Act risks chilling their behavior and punishing the likes of think tanks for their funding, Axios’ Lachlan Markay reports: “When the Koch network’s Americans for Prosperity goes in on a joint statement with the Natural Resources Defense Council and the American Civil Liberties Union it’s probably a five-alarm fire.”\nVALLEY TALK\nANTITRUST THE PROCESS — Other Big Tech behemoths bore the brunt of Washington’s antitrust fervor in years past.",
    "POLITICO Playbook: The reasons for optimism — but more pessimism — in Ukraine\nBy EUGENE DANIELS and ELI OKUN\n02/21/2022 09:05 AM EST\nPresented by\nDRIVING THE DAY\nRUSSIA-UKRAINE OVERNIGHT —Reuters: “Russia's FSB security service said on Monday a shell fired from Ukrainian territory had completely destroyed a border guard post in Russia's Rostov region but caused no casualties.Ukraine denied responsibility for the incident, which took place at a moment of extreme tension between the two countries as Russia continues to deny statements from the United States and its allies that it could invade Ukraine at any time.”\nFWIW: U.S. officials have been concerned for weeks that a false flag operation would be orchestrated by Russia to justify an invasion.",
    "“An invasion from multiple locations could essentially fence Ukraine in.”\n— NYT’s David Sanger has this sobering paragraph in his analysis of the Russian leader’s options: “If he strikes to take the whole country in a single blow — the approach that senior American military and intelligence officials and many outside analysts now think is the most likely — it could provoke the largest, most violent battle for European territory since the Nazi surrender in 1945.”\nTHE SANCTIONS PICTURE — If Russia invades, the U.S. is planning to bar “correspondent” banking relationships between key Russian banks and American financial institutions, Reuters’ Alexandra Alper and Karen Freifeld revealed.",
    "MEANWHILE, IN TEXAS — Ximena Bustillo puts it plainly in a feature on the political fate of SID MILLER, the Texas agriculture commissioner: “Miller has accumulated so many enemies and courted so much controversy in his two terms as commissioner that even his conservative credentials and Trump’s endorsement might not be enough to save him in the state’s March 1 GOP primary.”\nTHE WHITE HOUSE\nNARRATIVE WATCH — Team Biden is considering trying to find somebody other than Trump they can highlight as a “unifying Republican foil” to help shore up Democrats’ political fortunes in November, Axios’ Hans Nichols and Jonathan Swan report.",
    "), Phil Hare (D-Ill.) and John Shimkus (R-Ill.) … Ryan Rudominer of Red Horse Strategies … WaPo’s Lee Powell … Holland & Knight’s Beth Viola … Reuters’ Ross Colvin … Rebeccah Propp … POLITICO’s Mona Zhang and Lucas Gomez-Acebo … Kilmeny Duchardt ... Tricia Nixon Cox … LinkedIn’s Jeff Weiner … Ron Pollack … Purple Strategies’ Stephen Smith … Bob Chlopak … David Geffen … David Wessel … Jordan Zaslav … Scott Kelly … Daniel Yim of House Oversight … Shawn Reinschmiedt\nDid someone forward this email to you?",
    "“The United States will also wield its most powerful sanctioning tool against certain Russian individuals and companies by placing them on the Specially Designated Nationals (SDN) list, effectively kicking them out of the U.S. banking system, banning their trade with Americans and freezing their U.S. assets.”\nKNOWING JOHN SULLIVAN — Nahal Toosi has a must-read profile of the U.S. ambassador to Russia, a widely respected moderate Trump appointee whom Biden kept on in Moscow.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Now he’s a handy Kremlin enemy and lonely American interlocutor in the fog of impending war whose much-reduced staff is “likely to be pushed to their limits in the days ahead.” And his family history has quite a connection to his current predicament: His uncle WILLIAM SULLIVAN was an American diplomat who was taken hostage at the U.S. Embassy in Tehran on Valentine’s Day in 1979.",
    "… I found it hard, in my conversations with Biden officials, to get them to zoom out, to explain how our various policies fit into a sensible, humane whole.”\nALL POLITICS\nCASH DASH — He may be out of office, but DONALD TRUMP still leads the fundraising pack in the GOP: He raised $7.2 million in January, from more than 228,000 donations, Fox Business’ Paul Steinhauser reported.",
    "With Belarus, he did it without firing a shot,” by WaPo’s Robyn Dixon and Mary Ilyushina in Moscow\nGood Monday morning and happy Presidents Day, which John Harris says we should cancel in a new column this morning: It’s “an inane name for a dubious concept that is less a show of genuine respect for American history than an insult to it.” Thanks for reading Playbook.",
    "Based in Atlanta, the foundation “will ensure that future generations have the tools and support to create their own Good Trouble, realizing the Lewises’ dream that the power of individuals can reimagine and build a better society.” It will kick off with a gala May 17 at the Schuyler Ballroom in the Hamilton Hotel in Washington to remember Lewis and raise funds.",
    "He told Nahal that he “thinks about his uncle every day.”\nTOP-ED — “Leave Putin in no doubt: Russia will be economically crippled – and he may be tried for war crimes,” by former Ukrainian Defense Minister Andriy Zagorodnyuk in The Guardian: “We believe, even with the very short time available, that it is still possible to stop Putin from starting war.",
    "REASONS FOR PESSIMISM: There are many more and pretty obvious reasons why an invasion is looking more likely than not:\n— Russian forces are staying indefinitely in nearby Belarus after “military drills”\n— Russia currently has more than 150,000 troops set on the border of Ukraine and they show no sign of leaving, according to US intelligence.",
    "JUST POSTED — NYT: “Putin gathers his Security Council, with a warning of rising tensions.”\nDIPLOMATIC HAIL MARY: Presidents JOE BIDEN and VLADIMIR PUTIN have agreed “in principle” to a diplomatic summit, but Biden would only participate if there’s no invasion, which at this point U.S. officials say Russia is still planning.",
    "More from the AP\nPOLICY CORNER\nCLIMATE FILES — The Interior Department this weekend paused all decisions about new federal oil and gas drilling following a Trump-appointed judge’s injunction that blocked the administration’s efforts to consider the social cost of carbon in its decision-making, NYT’s Lisa Friedman reports.",
    "BIDEN’S WEEK AHEAD:\n— Tuesday: The president will convene “a virtual event announcing progress on securing critical mineral supply chains, powering clean energy manufacturing, and creating good-paying jobs.”\n— Thursday: Biden will take part in a virtual G-7 leaders’ meeting, focused largely on Russia/Ukraine.",
    "BEYOND THE BELTWAY\nRELIEF PACKAGE PERKS — After receiving money from Congress in its latest coronavirus relief package, some “governors and state legislators are contemplating a long list of tax cuts: in personal income taxes and corporate levies, in property taxes and grocery taxes,” our Brian Faler writes.",
    "— Video shows Russian forces moving closer to Ukraine’s border\nENVISIONING INVASION — The latest U.S. intelligence suggests Russia could target not just Kyiv but also other major Ukrainian cities like Kharkiv, Kherson and Odessa, Bloomberg’s Alberto Nardelli and Jennifer Jacobs report.",
    "“According to a citywide Washington Post poll, close to half of D.C. residents have a negative view of the team’s new name, with 32 percent disliking it and 17 percent saying they ‘hate’ it.”\nNEWS YOU CAN USE — NYT op-ed: “Ignoring a Text Message or Email Isn’t Always Rude.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nAMERICA AND THE WORLD\nHAVANA SYNDROME SIREN — Sunday’s episode of CBS’ “60 Minutes” unveiled quite a bombshell: several instances of people who believe they were hit by a mysterious weapon at home in Washington and on White House grounds.",
    "“Much of the withheld information could help state and local health officials better target their efforts to bring the virus under control,” she writes, and “public health experts were stunned to hear” about some of the data CDC has collected but not released.",
    "and Scott DesJarlais (R-Tenn.) … Ashley Etienne … FEC Chair Allen Dickerson … Maya MacGuineas … Paul Teller … Mark Smith … Jeremy Gaines … Kevin Sheridan ... Kristie Greco Johnson … former Sen. Olympia Snowe (R-Maine) … former Reps. Charles Boustany (R-La.",
    "Blinken and Lavrov will discuss further if the invasion hasn’t started by then – in which case it’s all off.”\nThe White House dispatched national security advisor JAKE SULLIVAN to the morning shows, where he continued the administration’s dire warnings.",
    "2022 WATCH — A new Southern California congressional district has yielded a high-profile contest between two well-known Latino Democrats, Long Beach Mayor ROBERT GARCIA and state Assemblymember CRISTINA GARCIA, the L.A. Times’ Seema Mehta reports.",
    "“We are also ready to impose swift and severe consequences should Russia instead choose war.”\n\"It's premature to talk about any specific plans for organizing any kind of summits,\" Dmitry Peskov, Kremlin spokesman told reporters this morning.",
    "But the contemplation is “sparking criticism Democrats in Washington gave too much money to states as part of their $1.9 trillion coronavirus relief package, signed into law one year ago next month.”\nPLAYBOOKERS\nHAIL TO THE COMMANDERS?",
    "The announcement first came from France’s readout of Biden and French President EMMANUEL MACRON’s Sunday call, which American officials quickly confirmed via a JEN PSAKI statement: “We are always ready for diplomacy,” she wrote.",
    "ENGAGED — Peter Hamby, host of Snapchat’s “Good Luck America” and founding partner of Puck News, on Friday proposed to Katie Warshaw, a former Marty Walsh aide who’s now an MBA candidate at UCLA Anderson School of Management.",
    "The full report from Scott Pelley … The children affected\nTOP-ED — “If Joe Biden Doesn’t Change Course, This Will Be His Worst Failure,” by NYT’s Ezra Klein: “Ninety-five percent of Afghans don’t have enough to eat.",
    "It left out info on booster shot effectiveness in 18- to 49-year-olds; it just started publishing wastewater data for the first time; it doesn’t break down hospitalization data by age, race and vaccination status.",
    "Now, in Ukraine, he’s poised to wage war.” by WaPo’s David Ignatius\n— “Bond Between China and Russia Alarms U.S. and Europe Amid Ukraine Crisis,” by NYT’s Edward Wong\n— “Putin may go to war to capture Ukraine.",
    "“We have seen just in the last 24 hours further moves of Russian units to the border with no other good explanation other than they’re getting into position to attack.” Also: His hit from NBC’s “Today”.",
    "But picking the right enemy is tricky: Dems have concerns about how effective it would be to elevate Trump, House Minority Leader KEVIN MCCARTHY, Senate Minority Leader MITCH MCCONNELL or Florida Gov.",
    "But the thinking in the Biden administration is that Russia already has all the forces it needs to conduct an invasion of Ukraine on a massive scale already so they don’t see it as a stalling tactic.",
    "THE BIG PICTURE — Coronavirus cases and Covid-19 hospitalizations are continuing to drop in the U.S., with new cases about one-eighth of what they were five weeks ago during the Omicron peak.",
    "WELCOME TO THE WORLD — Charlie Harding, the EP and host of Vox Media’s podcast “Switched on Pop,” and Bess Kalb, a television writer/producer and author, on Feb. 7 welcomed their second son.",
    "And though TIM COOK “has long used his public persona to personally influence those in power and guide the company through Washington entanglements,” he’s had less success this time around.",
    "While being very persistent with his end goals, Putin has adopted an agile approach: when he meets serious resistance, he will step back and adjust his actions.”\nFurther reading:\n— “U.S.",
    "Among the high-profile names speaking out: OLIVIA TROYE and MILES TAYLOR, the latter of whom says a “roughly” Cabinet member-level figure in the Trump administration was also affected.",
    "But now Apple is joining them in the hot seat, as two major bills that have sailed through Senate Judiciary make their way to the full chamber, report WSJ’s Ryan Tracy and Tim Higgins.",
    "Sometimes It’s Necessary.”\nNEWS YOU CAN USE, PART II — WSJ: “How to Delete Your Old Posts on Instagram, Facebook and Twitter.”\nIt appears the WMATA Twitter account has been hacked.",
    "claims Russia has list of Ukrainians ‘to be killed or sent to camps’ following a military occupation,” by WaPo’s John Hudson and Missy Ryan\n—“Putin warned the West 15 years ago.",
    "But there’s another effect, too: Progressives could have a better shot in some of the open safe seats, shifting the caucus to the left come 2023, reports NBC’s Alex Seitz-Wald.",
    "“All signs look like President Putin and the Russians are proceeding with a plan to execute a major military invasion of Ukraine,” Sullivan said on ABC’s “Good Morning America.",
    "— If Russia were to invade Ukraine, it has been made obvious by the U.S. and its allies that it will only pull the NATO countries closer and isolate Russia.",
    "SPEAKING OF APPLE’S APP STORE — Truth Social, Trump’s new social media platform, is set to launch there today, Reuters’ Julia Love and Helen Coster scooped.",
    "— But Trump isn’t spreading the love: None of Save America PAC’s January haul went to other candidates Trump is supporting, notes Bloomberg’s Bill Allison.",
    "THE NEW DEMS — The sky-high number of House Democratic retirements this cycle has drawn attention for putting the party’s majority in even greater danger.",
    "THE PANDEMIC\nPAGING ROCHELLE WALENSKY — The CDC hasn’t made public the vast majority of its Covid-19 data, NYT’s Apoorva Mandavilli revealed.",
    "The time for talking will be on Thursday when Secretary of State ANTONY BLINKEN and Russian Foreign Minister SERGEI LAVROV are set to meet.",
    "Could the agreement in principle for a meeting be a ruse to keep the sides talking while Russia makes more preparations for an invasion?",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "DOJ is appealing the controversial decision, which is a major setback for the administration’s attempts to curtail climate change.",
    "NEW — The John and Lillian Miles Lewis Foundation is being announced today on what would have been John Lewis’ 82nd birthday.",
    "The White House wants voters to see the election more as a choice than as a referendum on Democratic control of Washington.",
    "We know from studying the Russian decision-making process for years that they always choose from a few options available.",
    "She most recently was comms director for the Ohio Republican Party, and is a Trump State Department and Treasury alum.",
    "If Russia hasn’t invaded, those two will help hammer out the details of a possible meeting between the two leaders.",
    "As news of a possible summit made the rounds, an NSC official told Playbook last night: “Timing to be determined.",
    "Both are trying to pitch themselves as the most progressive, with Robert Garcia considered the frontrunner.",
    "His associated PACs/joint fundraising committee had $123.8 million in the bank at the end of the month.",
    "— U.S. intelligence suggests Putin has already given Russian military officials the order to invade.",
    "She most recently was deputy assistant DHS secretary for strategic comms, and is a Doug Jones alum.",
    "The agency says much of its data isn’t ready to be made public, and they fear misinterpretation.",
    "REASONS FOR OPTIMISM:\n— The fact that Russia still seems, at least publicly, open to diplomacy.",
    "… Heather Fluit has been named director of operational engagement and outreach at ICF Next.",
    "… Rachel Leppert is now political director for Katie Britt’s Alabama Senate campaign.",
    "But that largely depends on the steps made by world leaders in the next day or two.",
    "That means Trump could be back on social media just in time for Presidents Day.",
    "HAPPY BIRTHDAY: Sen. Mark Kelly (D-Ariz.) … Reps. Steven Palazzo (R-Miss.)",
    "FIRST IN PLAYBOOK — Tricia McLaughlin is now comms director for Ohio Gov.",
    "She previously was press secretary for Sen. Kevin Cramer (R-N.D.).",
    "BIDEN’S MONDAY — The president has nothing on his public schedule.",
    "They got engaged in her hometown of Manhattan Beach at sunset.",
    "She most recently was creative director for Virginia Gov.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "TRANSITIONS — Delanie Bomar is joining Florida Gov.",
    "Putin knows this and it’s not something he wants.",
    "Ron DeSantis’ reelect as deputy press secretary.",
    "Send Playbookers tips to playbook@politico.com.",
    "Nearly nine million are at risk of starvation.",
    "Glenn Youngkin after working on his campaign.",
    "(Others note that politics play a role too.)",
    "It’s all completely notional.",
    "Not so much, reports WaPo.",
    "Format to be determined.",
    "Mike DeWine’s reelect.",
    "Sign up here.",
    "RON DESANTIS.",
    "Possibly."
  ]
}