{
  "id": 4358,
  "mediaId": 2634,
  "date": "2022-01-22",
  "headline": "Let’s Oust Congress’s Stock Market Miscreants!",
  "image": "https://images.newrepublic.com/a4d8a3be6ac21841573a6f655084a30861f0ec78.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/165104/congress-ban-stock-market-trading-oust-miscreants",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Linkins",
  "authorUrl": "https://newrepublic.com/authors/jason-linkins",
  "termIds": [
    0
  ],
  "sentences": [
    "Among its superior virtues, Shaub cites the former measure’s more robust commitment to public transparency, stronger penalties for noncompliance, and fewer procedural hurdles that might allow scofflaws to dodge responsibility: The Ossoff-Kelly bill, Shaub tweeted, “says the ethics committee ‘shall’ impose a penalty on noncompliant members,” while Hawley’s “says the ethics committee ‘may’ impose a penalty” for such infractions.",
    "As Judd Legum noted in a recent edition of the Popular Information newsletter, these included several infamous instances of lawmakers making trades based on “non-public information about the COVID-19 pandemic they received during the course of their Senate duties.”\nAt the time of the Insider report, House Speaker Nancy Pelosi defended her colleagues, saying, “We’re a free-market economy.",
    "You don’t have to take my word for it: As one of the law’s creators, Tyler Gellasch, explained to Politico in March 2020, it “didn’t go far enough.”\nWalter Shaub, the former director of the Office of Government Ethics who is now a senior fellow at the Project on Government Oversight, has endorsed the Ossoff-Kelly bill over Hawley’s.",
    "The breakdown of the constitutional order (or if you prefer, its intended functioning) has created what writer Kelsey Atherton calls the “trifecta of failed governance,” in which the legislative branch’s dysfunction forces the president to rule by executive order, only to see those efforts spiked by the judiciary.",
    "Members of the House got in on the action, as well: namely Democratic Representative Abigail Spanberger and Republican Representative Chip Roy, who introduced a companion measure that would force lawmakers to stash their investment portfolio into a blind trust before taking office.",
    "The practice of what too few people dare to term “insider trading” among members of Congress made news a month ago after an Insider report documented scores of violations of the Stop Trading on Congressional Knowledge, or STOCK Act, implicating 49 lawmakers and 200 staffers.",
    "As the names of the competing Senate bills suggest, the operative word for reformers is “ban”—the very verb that should have been applied from the get-go to the practice of lawmakers using the scads of insider information at their disposal to make fast money.",
    "This week, as the push to pass a voting rights bill got ground up in the gears of the Senate filibuster like so many other worthy pieces of legislation before it, we have cause to wonder: Why do people even want to be in Congress?",
    "Last week, Democratic Senators Jon Ossoff and Mark Kelly, perhaps informed by their relative newness to the upper house, introduced the Ban Congressional Stock Trading Act.",
    "Regardless, the sooner we start forcing people to choose between being a stock market investor and being a public servant, the sooner we’ll have a better class of both.",
    "Regardless of whether you prefer one or the other, the big question is whether either of them can pass both houses of Congress and make its way to Joe Biden’s desk.",
    "But if either bill comes to the floor, it would still force the bad guys to take a tough vote, and reveal themselves to be enemies of this commonsense reform.",
    "Voters should have the opportunity to identify lawmakers who oppose bans on stock trading and find alternatives to send to Washington in their stead.",
    "And sure enough, every once in a while you hear about someone turning down a run for office because they recognize that it’s a pretty terrible job.",
    "And the answer is: of course not, because of the aforementioned filibuster-enabled dysfunction that currently grips the legislative branch.",
    "Republican Senator Josh Hawley also kicked in a piece of legislation of his own: the Banning Insider Trading in Congress Act.",
    "They should be able to participate in that.” As TNR’s Matt Ford wrote at the time, Pelosi’s was precisely the wrong answer.",
    "That law essentially requires lawmakers to police themselves, which largely accounts for why it has failed.",
    "This article first appeared in Power Mad, a weekly TNR newsletter authored by deputy editor Jason Linkins.",
    "It’s no way to run a country, and it looks like Congress has become a dreadful place to work as a result.",
    "Maybe the chance to use privileged nonpublic information to get rich in the stock market, that’s what!",
    "Both the Ossoff-Kelly and the Hawley bills would be a massive improvement on the STOCK Act.",
    "Fortunately, other lawmakers have stepped to the fore to try to offer the correct one.",
    "Senator Jon Ossoff is leading a push to ban lawmakers from playing the stock market.",
    "“That committee hasn’t imposed any penalty on anyone in over a decade,” Shaub notes.",
    "Maybe it’s possible to elect more lawmakers from outside the stock-owning class.",
    "But what are those who get elected into office getting out of the deal?",
    "Sorry for the bad news!",
    "Sign up here."
  ]
}