{
  "id": 4427,
  "mediaId": 2752,
  "date": "2022-01-22",
  "headline": "You Don't Need The Mark Of The Beast To Read Wonkette's Top Ten Stories Of The Week",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yODg4MjUzMC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY4OTkyNjk2MX0._qt7PlIaIUjyojSn-w6OUjjS8Ytup9H9GZks627sQtE/img.png?width=1200&coordinates=0%2C75%2C0%2C75&height=600",
  "link": "https://www.wonkette.com/wonkette-s-top-ten-1-22-22",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robyn Pennacchia",
  "authorUrl": "https://www.wonkette.com/u/robyn_pennacchia",
  "termIds": [
    0
  ],
  "sentences": [
    "Choice lyrics:\nI know there's a sale and a special on rice\nAnd you can buy beans at a giveaway price\nBut that's just their way to get you down there\nWhat you don't know is that they're everywhere\nAlso:\nThis isn't just a new craze\nThey want to make us their slaves\nTruly, it's a work of art.",
    "Robyn Pennacchia\nRobyn Pennacchia is a brilliant, fabulously talented and visually stunning angel of a human being, who shrugged off what she is pretty sure would have been a Tony Award-winning career in musical theater in order to write about stuff on the internet.",
    "It is a song, performed by a band called Heavenly Magic, which was associated with The Family International/Children of God cult, imploring a young woman not to go to the supermarket and buy food with the Mark of the Beast.",
    "If so, you can join our Patreon, or buy our merch, or do your Amazon shopping through our link, or even send a check in the mail to\nWonkette\nPO Box 361\nPolson MT 59860\nor use this handy widget below!",
    "Just click the amount you want to donate, click one-time or monthly, and then be sure to click \"Paypal\" if you are Paypal or \"Stripe\" if you are not Paypal, or your money will not go through!",
    "So I got you an extra special present this week, which I (again) found on the r/obscuremedia subreddit.",
    "Did reading these stories give you a sudden urge to shower us with money and jewels?",
    "And here are your top ten stories of the week!",
    "Though the choreography could use some work.",
    "Follow her on Twitter at @RobynElyse",
    "Rudely, it's kind of a bop.",
    "It's been a very long week.",
    "Too long, even.",
    "Happy weekend!"
  ]
}