{
  "id": 4445,
  "mediaId": 8251,
  "date": "2022-01-19",
  "headline": "Arizona Sen. Mark Kelly will support changing Senate filibuster rule just before voting",
  "image": "https://media.12news.com/assets/KPNX/images/83f79511-1150-42f1-abcf-c066fdacb168/83f79511-1150-42f1-abcf-c066fdacb168_1140x641.jpg",
  "link": "https://www.12news.com/article/news/politics/sen-mark-kelly-supports-changing-filibuster-rule-pass-voting-rights-bills/75-3d470ecf-fea0-4bd2-bc82-2e19d5efa1ce",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Read my full statement about why I support passing campaign finance and voting rights reforms with a majority vote: https://t.co/0w2zTIxOTX pic.twitter.com/nUUZ0BdWtF\n— Senator Mark Kelly (@SenMarkKelly) January 19, 2022\nKelly’s statement is significant in several ways:\nKelly’s support for the so-called \"talking filibuster\" comes after Senate Majority Leader Chuck Schumer announced his plan Tuesday night to implement the rule to try to pass the voting-rights bills.",
    "“Whether the Senate fails or succeeds in passing this legislation, I will continue doing this job just as I promised Arizonans: delivering results by working with Republicans and Democrats to find common ground as we have on infrastructure, standing up to party politics, and staying focused on doing what is best for Arizona.”\nTrack all of our current updates with Arizona politics on our 12 News YouTube channel.",
    "“Protecting the vote-by-mail system used by a majority of Arizonans and getting dark money out of our elections is too important to let fall victim to Washington dysfunction.”\nIf NASA functioned like the United States Senate, they would never get the rocket off the launchpad.",
    "It marks a break with Sen. Kyrsten Sinema's opposition to eliminating filibuster\nPHOENIX — Arizona Sen. Mark Kelly announced Wednesday he supports a limited change of the U.S. Senate’s filibuster rule in order to pass voting-rights legislation that he has co-sponsored.",
    "Arizonans deserve a Senate that is more responsive to the challenges facing our country, which is why I’ve spoken with Arizonans and my Republican and Democratic colleagues about their views on what can be done to make this place work better.",
    "“As an astronaut and a combat veteran, I can tell you that if NASA or the Navy functioned like the United States Senate, we would never get the rocket off the launchpad and in combat we’d never complete the mission.",
    "Yes, of course they can.”\nHere is Kelly’s full statement:\n“My year in the Senate has shown me how dysfunctional this place can be, and how that prevents progress on issues that matter to Arizonans.",
    "But Hurley pointed to this passage in Sinema’s floor speech last week on the filibuster: “Can two Americans of sharp intellect and good faith reach different conclusions to the same question?",
    "We’re seeing that now, as voting rights legislation remains blocked while partisan politicians work to undermine Arizona’s successful vote-by-mail system and create more barriers to vote.",
    "“If campaign finance and voting rights reforms are blocked again this week, I will support the proposed changes to pass them with a majority vote,” Kelly said in a prepared statement.",
    "Protecting the vote-by-mail system used by a majority of Arizonans and getting dark money out of our elections is too important to let fall victim to Washington dysfunction.",
    "Kelly has been under fire from Republicans, almost from the day he announced his first run for office three years ago, to state his position on the filibuster.",
    "Biden has endorsed changing Senate rules to allow for a simple majority vote - not the 60 votes needed to overcome a filibuster - to pass the legislation.",
    "As late as Tuesday, Kelly was giving reporters his stock answer: He’d wait to see the proposed filibuster reforms on a given piece of legislation.",
    "“If campaign finance and voting rights reforms are blocked again this week, I will support the proposed changes to pass them with a majority vote.",
    "That rule would allow Senate Democrats to end debate on legislation with a simple majority vote after Republicans have run out of turns to speak.",
    "(His defeat of GOP Sen. Martha McSally in November 2020 allowed him to finish out the remaining two years of the late Sen. John McCain’s term.)",
    "I’ve considered what rules changes would mean not just today, but years down the road, for both parties and all Arizonans.",
    "Sinema’s floor speech last week appeared to drive a nail through any hopes of Senate Democrats’ passing Biden’s agenda.",
    "Sinema has said she supports the voting-rights legislation, but not at the expense of doing away with the filibuster.",
    "It might help clear a path for the two voting-rights bills that are expected to come before the Senate this week.",
    "Sinema and West Virginia Sen. Joe Manchin who are the leading opponents of retaining the filibuster.",
    "Kelly’s statement marks a significant break with his Democratic seatmate, Sen. Kyrsten Sinema.",
    "Sinema spokeswoman Hannah Hurley said the senator wouldn’t comment on Kelly’s announcement.",
    "Campaigns are under way to recruit a primary challenger when her first term ends in 2024.",
    "At the same time, Kelly has seen the political backlash against Sinema among Democrats.",
    "But it remains unclear whether all 50 Democrats in the 50-50 Senate support the bills.",
    "Kelly announced his decision on the eve of votes on key pieces of Democratic agenda.",
    "Kelly is taking a political risk, even with his support of a limited filibuster.",
    "President Joe Biden announced his support for the talking filibuster last year.",
    "He’s up for re-election in November to a full six-year term in the Senate.",
    "Subscribe for updates on all of our new uploads.",
    "Yes."
  ]
}