{
  "id": 4472,
  "mediaId": 2658,
  "date": "2022-01-13",
  "headline": "Dems torpedo Cruz’s bid to sanction Russian pipeline",
  "image": "https://static.politico.com/2e/5e/15e7b11d468fbb8833c95a6b93ff/220112-ted-cruz-getty-773.jpg",
  "link": "https://www.politico.com/news/2022/01/13/dems-torpedo-cruz-sanction-russian-pipeline-527076",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2993,
    3925,
    4591,
    2765,
    1973,
    1495,
    6569,
    6672
  ],
  "sentences": [
    "The vote and the partisan divisions surrounding it served as the coda to a week of U.S.-Russia talks in Europe that left American officials delivering increasingly dire warnings about Russia’s intentions, with one senior diplomat emphasizing on Thursday that “the drumbeat of war is sounding loud, and the rhetoric has gotten rather shrill.”\nSen. Ted Cruz (R-Texas) secured the vote in December after months of holding up confirmation of President Joe Biden’s ambassador nominees.",
    "Despite their previous support for sanctioning Nord Stream 2, most Democrats sided with the Biden administration in opposing Cruz’s legislation, arguing it was a poorly-timed and politically motivated measure that would break the U.S. from its European partners at a time when unity is essential to deter Russia, which has amassed thousands of troops along the Ukrainian border.",
    "“Some of our Republican colleagues have consistently put their desire to politically harm President Biden ahead of their desire to protect the nation.”\nBut Republicans have been eager to have the fight with Biden, who waived congressionally mandatory sanctions last year on Nord Stream 2, drawing bipartisan rebukes.",
    "If Russia invades Ukraine, “the reason will be that the United States Senate heard the pleas of our Ukrainian allies and we turned a deaf ear to them.”\nRepublicans also disputed Democrats’ argument that immediately sanctioning the nearly-completed pipeline would drive a wedge between the U.S. and European partners.",
    "It was a tactic that drew harsh criticisms from Democrats, who complained about the Texas Republican’s blockade of foreign-policy nominees stemming from his push to sanction the Nord Stream 2 pipeline, the Russia-to-Germany energy project that the U.S. and bipartisan majorities oppose.",
    "The pipeline is completed but not yet operational as it awaits final certification; the Biden administration persuaded Germany to initiate the pause, therefore allowing the U.S. and its allies to use the pipeline as leverage to convince Russian President Vladimir Putin to back down.",
    "| Chip Somodevilla/Getty Images\nBy Andrew Desiderio\n 01/13/2022 09:51 PM EST\nSenate Democrats on Thursday blocked a GOP-led effort to impose sanctions on a Russian natural-gas pipeline amid deteriorating talks with Moscow over its military buildup along Ukraine’s eastern border.",
    "The tactic is one of the few that senators from the minority party can employ to extract concessions from the majority party or the executive branch, and Cruz has not hesitated to hold up dozens of Biden’s picks for critical diplomatic posts.",
    "The legislation, led by Menendez and backed by Majority Leader Chuck Schumer and more than three dozen Democrats, prescribes a set of harsh conditional sanctions, including on Nord Stream 2, that would be triggered if Russia invades Ukraine.",
    "The nearly party-line vote, 55-44, came after an aggressive effort by the Biden administration to limit Democratic defections on the legislation, which the White House viewed as a bid to undercut its strategy to deter a Russian invasion.",
    "And GOP senators were bolstered by public statements from Ukrainian President Volodymyr Zelenskyy, who came out in support of Cruz’s bill, as well as the fact that nearly all senators previously supported sanctioning the pipeline.",
    "Sen. Jeanne Shaheen (D-N.H.), seen as a bellwether for Democrats given her work on the issue over the years, said she opposed Cruz’s bill because the U.S. posture on sanctions should “reflect those changes” in Germany’s position.",
    "He added that Democrats were “more concerned about standing with Berlin than with Kyiv” — a reference to Germany’s long-standing support for the pipeline, which will provide cheap energy for the country.",
    "Senate Foreign Relations Chair Bob Menendez (D-N.J.) argued that sanctioning Nord Stream 2 immediately, as Cruz’s bill requires, “might even be the excuse Putin is looking for” to invade Ukraine.",
    "Another top Democrat said Cruz’s bill would be a “gift” to Russia “because it’s a signal of division at a moment when we need to be standing together.”\n“This bill isn’t going to help Ukraine.",
    "“I would suggest, if Joe Biden were not president, if Donald Trump were sitting in the Oval Office today, every single Democrat in this chamber would vote for these sanctions,” Cruz said.",
    "But Republicans have asserted that the legislation was only introduced to give Democrats political cover for opposing immediate sanctions on Nord Stream 2, as Cruz’s legislation requires.",
    "Menendez has referred to the punishments outlined in the bill as “the mother of all sanctions” and argued that it would preserve Biden’s ability to use the pipeline as leverage.",
    "In the end, six Democrats — many of them vulnerable to GOP challengers in November — and all Republicans but one backed the legislation, falling short of the requisite 60 votes.",
    "The conservative flame-thrower, known for his hard-line views and relentless desire to shake up the Senate, became the face of Republicans’ post-Trump posture toward Russia.",
    "Democrats have also pointed to Cruz’s desire to run for president again in 2024, contending that he’s hijacking the Senate for his own political ambitions.",
    "“During all of the Trump administration, Sen. Cruz did not hold one nominee because of Nord Stream 2,” Shaheen said on the Senate floor.",
    "It’s also not clear whether Cruz, fresh off his defeat, will continue blocking swift confirmation of Biden’s foreign-policy nominees.",
    "It’s designed to hurt the president of the United States,” said Sen. Chris Murphy (D-Conn.), a key White House ally on the effort.",
    "“It’s leverage that the West can use as Vladimir Putin is thinking about what he’s going to do with Ukraine,” Shaheen said.",
    "Raphael Warnock of Georgia, Maggie Hassan of New Hampshire, Catherine Cortez Masto of Nevada and Mark Kelly of Arizona.",
    "And on Wednesday night, Democratic leaders began the process to put the Menendez legislation on the Senate’s calendar.",
    "Democrats are hoping that Republicans would be willing to engage on Menendez’s bill now that the Cruz effort failed.",
    "Earlier this week, Democratic leaders unveiled a Russia sanctions bill intended to be an alternative to Cruz’s.",
    "But the new German government has since softened that position, spurred by Russia’s threats to invade Ukraine.",
    "Of the six Democrats who backed Cruz’s bill, four are facing difficult reelection fights in November: Sens.",
    "The path forward — on both the diplomatic talks as well as the legislative response — is unclear.",
    "Jacky Rosen of Nevada and Tammy Baldwin of Wisconsin also backed the legislation.",
    "That’s the whole point,” Senate Minority Leader Mitch McConnell said.",
    "Indeed, Cruz’s role in the saga has animated Democrats for months.",
    "Indeed, some Republicans have expressed support for it.",
    "Sen. Ted Cruz speaks during a hearing.",
    "“The pipeline itself is the wedge.",
    "Democratic Sens."
  ]
}