{
  "id": 4525,
  "mediaId": 8475,
  "date": "2022-01-13",
  "headline": "Tribal leaders voice concerns about water, voting, COVID-19 to Arizona lawmakers",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/011322_jonathan-nez-state-house.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/011322_tribal_concerns/tribal-leaders-voice-concerns-water-voting-covid-19-arizona-lawmakers/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Shondiin Silversmith",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/109016",
  "termIds": [
    0
  ],
  "sentences": [
    "“The river is a living being, and the protections must include the plants, animals, fish, and all of the people along the river, not just those who use its waters at distant locations.”\nFlores also referenced the Colorado River Indian Tribes Water Resiliency Act, federal legislation introduced by U.S. Sen. Mark Kelly in December 2021, which would authorize CRIT to lease portions of their federal Colorado River allocations for the first time, a move the tribe said would benefit both the river and tribal economies.",
    "“And three, take advantage of our opportunity to fund key infrastructure projects that cross our communities to improve our connections with one another.”\nNavajo Nation President Nez took to the podium talking about what the Navajo people have done during the COVID-19 pandemic, voting rights of Native American people, the importance of paying attention to missing and murdered Indigenous peoples, the Indian Child Welfare Act, highlighting infrastructure development and water rights.",
    "“We’re looking forward and we’re looking ahead to do some meaningful investments in our water, infrastructure, and broadband which will benefit the entire state of Arizona.”\nA variety of important topics and issues were brought to the forefront as Navajo Nation President Jonathan Nez, Colorado River Indian Tribes Chairwoman Amelia Flores, and Gila River Indian Community Governor Stephen Roe Lewis addressed legislative leaders on the Arizona House Floor on Wednesday.",
    "“We are proving once again that we can successfully work together to maintain the kinds of limited gaming that still produces meaningful revenues for tribal nations and the state of Arizona.”\nLewis said that, by coming together as tribal and state leaders, progress was made in a number of other important areas, including transportation to the recognition of traditional regalia during High School graduation ceremonies.",
    "“We should be making laws that expand access for all eligible voters, no matter their party affiliation and no matter the color of their skin.”\nFlores, Lewis and Nez thanked the Arizona State Legislature at the conclusion of their speeches and their hopes to continue working with legislative and tribal leaders to address issues that impact Indigenous communities and the state of Arizona.",
    "Local\nWater rights, the ongoing impacts of the COVID-19 pandemic, voting rights, and infrastructure needs were some of the common issues that several tribal leaders from across Arizona talked about during their visit to the Capitol to talk with legislative leaders about their respective sovereign nations as part of the 27th Annual Indian Nations and Tribes Legislative Day.",
    "“Since 1995, we have come together in this form here at the state capitol to address critical issues in tribal communities within the boundaries of Arizona,” Kristine Fire Thunder, executive director for the Governor’s Office on Tribal Relations, said in a video played for attendees who gathered in the state House of Representatives on Wednesday.",
    "“Through the CARES Act (coronavirus relief) funds that were received in 2020, we were able to extend water lines to some families and connect over 700 homes to the electric grid.”\nAs Nez continued his address to state leaders, he asked them to uphold and protect the voting rights of all citizens including Native Americans.",
    "Since then, through various partnerships, Flores said that the Colorado River Indian Tribes have been able to create “more than 200,000 acre-feet of system conservation water in Lake Mead and will create another 50,000 acre-feet this year, thus raising the lake levels by over three-and-a-half feet,” Flores said.",
    "“As we work to protect water and land, and to diversify our economy, it is with one purpose in mind, and that is the welfare of our people for generations to come.”\nGila River Indian Community Governor Lewis joined the conversation virtually and spoke about the impact COVID-19 has had on Indigenous communities.",
    "A variety of important topics and issues were brought to the forefront as Navajo Nation President Jonathan Nez, Colorado River Indian Tribes Chairwoman Amelia Flores, and Gila River Indian Community Governor Stephen Roe Lewis addressed legislative leaders on the Arizona House Floor on Wednesday.",
    "“We stood shoulder to shoulder with our frontline warriors and showed them that we love them, that we care for them, and that we are in this together.”\nNez highlighted that, despite all the hardships and losses the Navajo Nation has faced, the Navajo people have continued to fight back.",
    "Flores talked about how the Colorado River Indian Tribe has worked for the last two years to help Arizona battle the water crisis, noting that several tribal leaders were in the House gallery when the drought contingency plan was passed in 2019.",
    "The updated compact also allows tribes with compacts to transfer their gaming machine allocation to other federally recognized tribes, allowing tribes that do not have casinos, or that are located in rural areas, to receive gaming revenue.",
    "“We need voting laws that uphold and protect all citizens’ rights to vote, including Native Americans.”\nHe criticized Senate Bill 1133, which would bar cities, towns and school districts from conducting all-mail elections.",
    "“We were able to work cooperatively with the State of Arizona to coordinate several large vaccination events in our community,” Lewis said, and he is thankful for the assistance of the Arizona National Guard and Gov.",
    "“This mutual respect and collaboration brought forth progress in 2021, and I hope this continues in 2022,” Lewis said and the goals of his community and other tribal communities may not be that different in 2022.",
    "“Over the last several years, the Navajo Nation has invested hundreds of millions of our own dollars for water lines, water sanitation systems, and we’ve helped bring running water to our people,” Nez said.",
    "Speaker of the House Rusty Bowers and Senate President Karen Fann welcomed tribal leaders onto the Arizona House floor by thanking them for attending the event and their continued relationships.",
    "“Proposed laws such as the Arizona Senate Bill 1133, which would ban mail-in ballots in future elections, aim to disenfranchise certain groups of voters, including indigenous voters,” Nez said.",
    "When the vaccine became widely available, Lewis said it had a positive impact on health outcomes within the Gila River Indian Community, but not on the transmission of the virus.",
    "The compact was amended in April 2021, and it ensures gaming in Arizona remains limited and regulated while providing certainty for the future of the state and tribes.",
    "But 2021 also had its successes, Lewis noted: One of the biggest achievements was the conclusion of a five-year-long effort to modernize tribal gaming compacts.",
    "“Of our elders who are 65 years and older, 87% are fully vaccinated.”\nThe pandemic also made infrastructure needs in Indigenous communities starkly apparent.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "“The first and foremost priority for all the policies and plans being developed is to protect and save the life of the Colorado River,” Flores said.",
    "“When Tribal Nations prosper, the entire state of Arizona prospers.”\nSupport TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "She hopes that any policy and plans being brought forward addressing the water crisis impacting all of Arizona will prioritize the Colorado River.",
    "It is time for all of us to partner together, tribes and state, to develop solutions that benefit all the people in Arizona,” said Flores.",
    "“The Colorado River has supported our people along its banks since time immemorial, and others in the state of Arizona for 50 years.",
    "“We have 72.5% of our people fully vaccinated for COVID-19 – one of the highest vaccination rates in the entire world,” Nez said.",
    "“We are a major part of Arizona’s economy and communities,” Nez said of the Navajo Nation and other tribal nations in Arizona.",
    "“Indigenous peoples have been especially hard hit by this pandemic, and 2021 was a tough year for our community,” Lewis said.",
    "Each tribal leader touched on important topics such as water rights, voting rights, COVID-19, and infrastructure issues.",
    "Each tribal leader touched on important topics such as water rights, voting rights, COVID-19 and infrastructure issues.",
    "Two, continue our efforts together to save Lake Mead and keep our water supply secure for the future,” Lewis said.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "Doug Ducey’s office for making it possible to get these vaccinations in the arms of thousands of people.",
    "“Together we can create positive changes that help our people for many generations to come,” Nez said.",
    "Under the compact, a maximum of 1,400 gaming machines are authorized at each current gaming facility.",
    "“As leaders, when this pandemic began, we didn’t hide or shy away from the dangers,” Nez said.",
    "“Arizona is a much richer state because of our 22 federally recognized tribes,” Fann said.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "“First, beat back COVID and regain the normalcy in life we all crave.",
    "“The amended compacts have now been fully implemented,” Lewis said.",
    "Donate to TucsonSentinel.com today!",
    "- 30 -"
  ]
}