{
  "id": 454,
  "mediaId": 2641,
  "date": "2022-02-24",
  "headline": "Arizona AG Brnovich to Newsmax: Biden Admin Intentionally Undermining Law",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=1ef0f1c0-3128-4b1e-85b5-86a1d91ae37e&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/brnovich-arizona-illegal-immigration-welfare/2022/02/24/id/1058430/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Trusdell",
  "authorUrl": "",
  "termIds": [
    2368,
    2765,
    5802,
    4905,
    3401,
    910,
    5949,
    6239
  ],
  "sentences": [
    "''The Biden administration has decriminalized [illegal immigration] because they're not prosecuting or returning people to their countries of origin,'' Brnovich said on ''Spicer & Co.'' ''And now they are incentivizing, they're essentially wanting people to come here and become dependent on the federal government.''",
    "Appearing on Newsmax, Brnovich, a Republican, reiterated the argument he made to the Supreme Court on Wednesday in a case in which the justices were considering allowing Brnovich and 12 other state attorneys general to defend the policy because the Biden administration won't.",
    "''You look at the price of drugs like fentanyl, dramatically declining, that's affecting all of our neighborhoods, not just in Arizona, but this is coming to South Beach [Miami] and South Manassas, Virginia, and throughout this country,'' he said.",
    "Arizona Attorney General Mark Brnovich accused the Biden administration on Thursday of intentionally undermining the law by withdrawing a Trump-era policy that bars immigrants from permanent residency if they are likely to need public assistance.",
    "Even Department of Justice attorney Brian Fletcher on Wednesday argued that administrative law does not give a judge such as Feinerman the power to set aside nationwide policies.",
    "Brnovich pointed out that more than 2 million people entered the United States illegally in 2021, not counting the ones that evaded capture by Border Patrol agents.",
    "The Trump administration appealed the ruling, but the Biden administration rescinded the policy in March 2021 after it took office and withdrew its defense.",
    "The case was before the court because U.S. District Judge Gary Feinerman in Illinois, a Barack Obama appointee, voided the policy in November 2020.",
    "''This, to me … is just another attempt by the Biden administration to nationalize our elections and socialize our economy.",
    "Brnovich is one of nine candidates running for U.S. Senate in the GOP primary on Aug. 2, according to Ballotpedia.",
    "And they're trying to overwhelm the system because this is the progressive left dream.''",
    "The incumbent is Sen. Mark Kelly, a Democrat."
  ]
}