{
  "id": 4664,
  "mediaId": 2556,
  "date": "2022-04-19",
  "headline": "Briarcliff Entertainment Acquires Betsy West-Julie Cohen Documentary ‘Gabby Giffords Won’t Back Down’",
  "image": "https://deadline.com/wp-content/uploads/2022/03/gabby.jpg?w=1024",
  "link": "https://deadline.com/2022/04/gabby-giffords-documentary-briarcliff-entertainment-1235005579/",
  "mediaOutlet": "Deadline",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5244,
    5309,
    5802,
    5580,
    5410,
    2077,
    2056,
    2459,
    301,
    6006
  ],
  "sentences": [
    "Gabby Giffords’ story is one that needs to be seen by as many people as possible and we are honored to be partnering with the filmmakers, CNN and Time Studios in bringing it to audiences everywhere.”\nCohen and West’s RBG, about the life of Ruth Bader Ginsburg, was nominated for a Documentary Feature Oscar in 2019.",
    "I couldn’t be prouder to be associated with this entire team and looking forward to working with Briarcliff Entertainment to bring this film to the masses.”\nThe deal was negotiated by Ortenberg and by CAA Media Finance and UTA on behalf of the filmmakers.",
    "We can’t wait for audiences to fall in love with her as much as we have.”\nErspamer, who secured the project, said that “working alongside Gabby and Mark to bring their story to fruition has been a labor of love and one that fosters hope.",
    "Tom Ortenberg, CEO of Briarcliff, said in a statement that the project “is a motion picture for the ages and a more than worthy follow up to Julie and Betsy’s sward-winning film RBG.",
    "EXCLUSIVE: Briarcliff Entertainment has acquired North American rights to Gabby Giffords Won’t Back Down, the new documentary from directors Betsy West and Julie Cohen.",
    "As she recovered, she became a leading advocate for gun violence prevention, along with her husband, astronaut Mark Kelly, who was later elected to the Senate.",
    "The project tells the story of Giffords, who was seriously wounded in a 2011 assassination attempt and mass shooting while she was a congresswoman in Arizona.",
    "Lisa Erspamer is producer of the documentary, and Amy Entelis and Courtney Sexton of CNN Films are executive producers along with West and Cohen.",
    "The filmmakers said that Giffords “is the hardworking, dragon-slaying, 80’s hits-singing, recumbent bike-riding hero we all need right now.",
    "The film also features interviews with figures such as Barack Obama, and includes videos of Giffords in the weeks following the shootings.",
    "The doc, which premiered at SXSW last month, is viewed as an awards-season contender, with a 100% score so far on Rotten Tomatoes.",
    "The distributor plans to open the film nationwide July 15, with CNN Films planning to air it later in the year.",
    "Other EPs include Ian Orefice and Alexandra Johnes of Time Studios and Oren Jacoby of Storyville Films.",
    "Giffords also has promoted the understanding of aphasia, a language condition caused by brain damage.",
    "Subscribe to Deadline Breaking News Alerts and keep your inbox happy.",
    "No Comments"
  ]
}