{
  "id": 4671,
  "mediaId": 8350,
  "date": "2022-04-18",
  "headline": "Jim Lamon dominates GOP field financially in Arizona race for US Senate",
  "image": "https://ktar.com/wp-content/uploads/2022/04/lamon-and-money.jpg",
  "link": "https://ktar.com/story/5013498/jim-lamon-dominates-gop-field-financially-in-arizona-race-for-us-senate/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KEVIN STONE",
  "authorUrl": "https://ktar.com/story/author/kstone/",
  "termIds": [
    0
  ],
  "sentences": [
    "PHOENIX – Deep-pocketed businessman Jim Lamon spent nearly twice as much as Arizona’s four other Republican candidates for U.S. Senate combined over the first three months of the year, according to the latest campaign finance reports.",
    "Arizona Corporation Commissioner Justin Olson is the only candidate in the field trailing Brnovich in funding and the only one other than the Brnovich to see his war chest shrink over the first quarter.",
    "Lamon, who is closing the gap on Attorney General Mark Brnovich in the polls, loaned his campaign another $5 million in the first quarter of 2022, pushing his self-funding total to $13 million.",
    "The incumbent Democrat took in $11.3 million in the first quarter of 2022, his best fundraising segment since he amassed more than $36 million after the 2020 primaries, and spent $6.6 million.",
    "Brnovich twice won statewide elections and is campaigning while holding a high-profile office, but Lamon and two other political newcomers are beating him in the money game.",
    "The energy executive also reported about $275,000 in donations in his Federal Election Commission filing for January-March, bringing his quarterly haul to $5.3 million.",
    "The attorney general spent more than he raised in the Q1 ($736,000 in, $975,000 out) and saw his cash on hand fall to $529,000, a 31% decline from the end of 2021.",
    "Lamon spent $4 million in the first quarter and, with the primary election about four months off, dwarfed his GOP opposition with a $7.2 million war chest.",
    "According to OH Predictive Insights poll results released last week, Brnovich was still leading the field at 21%, but Lamon wasn’t far behind at 16%.",
    "McGuire spent $361,000 in January-March and was left with $994,000 on hand, about the same amount he’s loaned his campaign since its inception.",
    "Olson added $50,000 ($17,000 from a self-loan) and spent $98,000, leaving $144,000 cash on hand after starting the year with $192,000.",
    "Mick McGuire, former head of the Arizona National Guard, added $1.1 million to his coffers in Q1, including a self-loan of $750,000.",
    "He reported taking in $90,000 and spending $49,000 in his first full quarter of fundraising, leaving $41,000 on hand.",
    "Venture capitalist Blake Masters is the only candidate other than Lamon with more than seven figures in the bank.",
    "Meanwhile, Sen. Mark Kelly continued stacking up donations higher than all of the Republican hopefuls combined.",
    "Libertarian Marc Victor also collected enough signatures to qualify for the ballot as a U.S. Senate candidate.",
    "His rivals combined to spend about $2.2 million in Q1 and had about $4 million in cash on hand through March.",
    "Kelly was sitting on $23.3 million at the end of March and doesn’t have to worry about primary spending.",
    "Friday was the deadline for candidates to file first-quarter campaign finance reports.",
    "Masters was next at 9%, with McGuire at 6%, Olson at 3% and a whopping 44% unsure.",
    "He raised $1.2 million and spent $749,000 in Q1, leaving $2.3 million on hand."
  ]
}