{
  "id": 4685,
  "mediaId": 8416,
  "date": "2022-04-24",
  "headline": "Yavapai Big Brothers Big Sisters and APS presents The Power of Mentoring Symposium",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/04/24/yavapai-big-brothers-big-sisters-and-aps-presents-the-power-of-mentoring-symposium/?utm_source=rss&utm_medium=rss&utm_campaign=yavapai-big-brothers-big-sisters-and-aps-presents-the-power-of-mentoring-symposium",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Yavapai Big Brothers Big Sisters and APS have lined up local leading experts to share a day of friendship, networking, and seminars with you at The Power of Mentoring Symposium at Yavapai College, Saturday, May 7, 2022, 8 a.m. to 3 p.m.\nTickets are only $45 and include four sessions, breakfast, lunch, raffle tickets, goodie bags, and an invitation to the morning Keynote Speaker, Yavapai County Attorney Sheila Polk, with a video welcome from Sen. Mark Kelly.",
    "Seminar speakers include area leaders such as Yavapai County Superintendent Tim Carter, Cottonwood-Oak Creek School District’s Steve King, Arizona Community Foundation’s Lisa Sahady, Prescott Area Leadership’s Amore Cianciola, Chino Valley School District’s John Scholl, Yavapai College’s James Tobin, Verde Valley Area Leadership’s Brandon Echols, The Launch Pad’s Courtney Osterfelt, Just Men AZ’s Nick Lembo and many more.",
    "A special session includes the Education Round Table discussion involving Yavapai County Superintendents Steve King, Danny Brown, Dennis Dearden, John Scholl, John Pothast, and Tim Carter getting together to speak on all things mentorship within not only their districts and Yavapai County, but also their community, through COVID-19.",
    "How they mentor their staff, teachers, students, and community members through the challenging times of COVID-19 and continue to serve students and their academic needs, followed by a Q&A session",
    "All attendees will receive raffle tickets for chances to win an air fryer, a $100 gift certificate, or a VIZIO 58\" TV.",
    "Register now HERE before sessions fill up."
  ]
}