{
  "id": 4724,
  "mediaId": 2634,
  "date": "2022-04-20",
  "headline": "Jennifer Abruzzo Has Become One of the Quiet Heroes of the Biden Administration",
  "image": "https://images.newrepublic.com/55b382ef7974c3d5052c979fe78aa2a7694e1c9f.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/166143/jennifer-abruzzo-nlrb-quiet-hero-biden-administration",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Noah",
  "authorUrl": "https://newrepublic.com/authors/timothy-noah",
  "termIds": [
    4905,
    3226,
    5879,
    5802,
    2459,
    2598,
    2469,
    1489,
    868,
    6697
  ],
  "sentences": [
    "She was looking, she said, for\ncases in which an employer refuses to recognize and bargain with a union where the union presents evidence of a card majority, but where the employer is unable to establish a good faith doubt as to majority status; specifically, where the employer refusing to recognize has either engaged in unfair labor practices or where the employer is unable to explain its reason for doubting majority status in rejecting the union’s demand.",
    "I have written before that Abruzzo has “more power, arguably, than anybody else in government ... to carry out this administration’s labor policies.” Please allow me now to withdraw that qualifier, “arguably.” Earlier this month I praised her initiation of a process to outlaw “captive meetings,” the anti-union propaganda sessions that employers require workers to attend before a union vote.",
    "But reinstating Joy Silk would make it a lot easier for unions to organize workplaces—so much so that Mark Mix, president of the anti-union National Right to Work Legal Defense Foundation, took this week to the editorial pages of The Wall Street Journal to denounce Abruzzo as “extreme, even compared with the radical Obama NLRB.” I know no higher praise.",
    "Vice President Kamala Harris and Labor Secretary Martin Walsh reportedly have a fabulous rapport and speak every week on the phone, but they don’t have a lot to show for it apart from a February task force report on “worker organizing and empowerment” that, as I noted at the time, proposed a variety of laudable but far from sweeping changes.",
    "I didn’t grasp the importance of this at the time, but a brief that Abruzzo filed last week in an NLRB case concerning efforts by the Teamsters to organize 25 facilities of a company called Cemex Construction Materials Pacific, which manufactures concrete and cement, made her reasoning plain.",
    "Threats by employers to penalize workers who vote to unionize, by contrast, are much more common, mainly because there are no criminal penalties (assuming the threats don’t involve violence) and laughably mild civil penalties (consisting typically of the NLRB forcing another vote).",
    "In his 2017 article, Petruska argues quite persuasively that after the NLRB reversed Joy Silk—illegitimately in 1969 and then legitimately in 1971—filings alleging illegal firings and intimidation took off like a rocket, rising from about 8,000 to about 18,000 ten years later.",
    "According to Cooper and Nolan, the NLRB’s associate general counsel, Dominick L. Manoli, found himself in a tight corner defending Joy Silk against an employer’s First Amendment right to prefer a union election even if that employer knew the union had majority support.",
    "The high court believed this because, as it said in the decision, “The Board announced at oral argument that it had virtually abandoned the Joy Silk doctrine altogether.” An associate general counsel for the NLRB had indeed said that during oral arguments.",
    "As the report itself conceded, executive actions “do not and cannot take the place of the robust legislative change that is needed to fix our labor laws,” by which Harris and Walsh meant Senate passage of the Protecting the Right to Organize Act.",
    "In 2007, late in the presidency of George W. Bush, the Democratic House passed a bill 241–185 that would have reinstated card check, but a companion bill in the Democratic Senate fell nine votes short of beating a Republican filibuster.",
    "The volume of filings alleging illegal firings and intimidation fell off starting in the 1980s, but only because unions declined so steeply during that decade that there were many fewer union elections to occasion such abuses.",
    "Abruzzo affirmed that the NLRB was not barred legally from reimposing the Joy Silk standard, and that it ought to do so because Joy Silk provided an effective disincentive for employers to engage in unfair labor practices.",
    "The original version of the 1935 Wagner Act, which United Mine Workers President John L. Lewis famously dubbed labor’s Magna Carta, contained language that allowed unions to organize a workplace through card check.",
    "The passage in 1947 of the Taft-Hartley amendments to the Wagner Act eliminated that language, and today a workplace can organize through card check only if management responds by recognizing the union voluntarily.",
    "What’s important is that the Supreme Court believed, incorrectly, that the NLRB had itself abandoned the Joy Silk doctrine, and its decision said so by way of denying it was ruling one way or another on Joy Silk.",
    "There were ways to defend Joy Silk against this First Amendment claim, but Manoli chose instead simply to assert, falsely, that Joy Silk was a dead letter, even though the NLRB had never overturned it.",
    "In 1949 the NLRB ruled in Joy Silk Mills, Inc. v. NLRB that any employer that refused to recognize a union even though it knew that union enjoyed majority status was in violation of the Wagner Act.",
    "Today let’s discuss her even bolder initiation of a process that may effectively restore labor organizing by “card check,” the informal collection of authorization cards by union organizers.",
    "That interpretation remained in effect until 1969, when the Supreme Court ruled in NLRB v. Gissel Packing Co. that … well, never mind the substance of the ruling because it isn’t important.",
    "In discussing the Joy Silk blooper, Petruska relies on a 2005 essay titled “The Story of NLRB v. Gissel Packing: The Practical Limits of Paternalism” by Laura J. Cooper and Dennis R. Nolan.",
    "The story of how this odd misunderstanding occurred is related by Brian J. Petruska in a 2017 article for the Santa Clara Law Review, to which I’m indebted for the foregoing history.",
    "This obstacle in large part explains why it wasn’t until this month that an Amazon facility in the United States—the JFK8 warehouse in Staten Island—was able to unionize.",
    "Card check opponents like to complain that when there’s no secret ballot to organize, pro-union workers can threaten workers who oppose the union with physical violence.",
    "The appalling surprise defeat on the Senate floor of David Weil’s nomination for wage and hour administrator at the Labor Department was cause for additional pessimism.",
    "If it doesn’t, then the National Labor Relations Board supervises a formal election, a lengthy process that in various ways gives management the advantage.",
    "Abruzzo’s effort to revive unionization by card check through executive action rests on the fact that Taft-Hartley didn’t kill card check all at once.",
    "That isn’t likely to occur because Arizona Senators Kyrsten Sinema and Mark Kelly won’t vote for it and Virginia Senator Mark Warner may not either.",
    "But before you despair, take note of the strong leadership of Jennifer Abruzzo, general counsel at the National Labor Relations Board.",
    "Two years later, the NLRB cleaned up the mess Manoli made by overturning Joy Silk in Linden Lumber Division, Summer & Co. v. NLRB.",
    "The NLRB’s general counsel shows herself once again to be the Biden administration’s leading light on expanding labor rights.",
    "Candidate Barack Obama endorsed the card check bill in 2008 but didn’t press for it after he entered the White House.",
    "But such threats are fairly infrequent, mainly because the criminal penalties for such misbehavior are severe.",
    "Abruzzo’s brief in favor of restoring Joy Silk offers some hope that that labor’s decline can be reversed.",
    "The proportion of these filings that the NLRB deemed meritorious did not change during this period.",
    "Unfair labor practices are common today and committed most often during union elections.",
    "The Biden administration has been somewhat disappointing on the issue of labor rights.",
    "Abruzzo announced her intention to revive Joy Silk in an August memo to her staff.",
    "Card check has long been a point of contention between labor and management.",
    "It still would be much better if Congress passed the PRO Act.",
    "That’s the NLRB decision Abruzzo wants to overturn.",
    "But it wasn’t true."
  ]
}