{
  "id": 4759,
  "mediaId": 2790,
  "date": "2022-04-24",
  "headline": "What to know about Title 42, the Trump-era policy now central to the border debate",
  "image": "https://media.npr.org/assets/img/2022/04/22/ap22097141787733_wide-ea5fe16a0a67e67e83bc08029b5dff4ac0f34920.jpg?s=1400",
  "link": "https://www.npr.org/2022/04/24/1094070784/title-42-policy-meaning",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Deepa Shivaram",
  "authorUrl": "",
  "termIds": [
    4905,
    2765,
    1397,
    1474,
    1441,
    867,
    854,
    392,
    6678
  ],
  "sentences": [
    "Title 42 has also made it hard to get an accurate number of migrants who are attempting to cross into the U.S. That's because many migrants have been trying to cross multiple times in the same month, then get counted more than once, according to Mayorkas.",
    "To prepare, the Department of Homeland Security released an extensive plan that puts more law enforcement officials on the southern border, increases their capacity to process new arrivals and implements more COVID-19 vaccination efforts.",
    "While Democrats in Congress have been outspoken about ending Title 42 for months, the Biden administration repeatedly insisted — and continues to insist — that Title 42 is a public health order, and not immigration policy.",
    "With the midterm elections this year, some Democrats who face tight races are expressing concern that the White House doesn't have enough of a plan to tackle the likely influx of migrants at the border once Title 42 lifts.",
    "It's what essentially gave authority to the Centers for Disease Control and Prevention to take emergency action in March 2020, allowing immigration authorities to quickly expel migrants and denying entry to asylum seekers.",
    "The 1944 Public Health Service Act established an administrative structure for the country to deal with national and international health problems that could arise, both in war-time and in peace.",
    "\"Whenever Title 42 is lifted, there is likely, almost certainly, to be a surge,\" Doris Meissner, who leads the U.S. immigration policy program at the Migration Policy Institute, tells NPR.",
    "Theresa Cardinal Brown from the Bipartisan Policy Center calls Title 42 the \"primary tool\" of managing migration at the border under both the Trump and Biden administrations.",
    "It \"will likely cause a significant increase in arrivals\" at the southwest border, according to a strategic plan released last month by the Department of Homeland Security.",
    "With midterm elections coming up, there's concern that Republicans will once again make immigration and the border a hot-button issue, and it worries vulnerable Democrats.",
    "Back then, tuberculosis was a major public health threat to the nation, and the Public Health Service Act helped provide grants for research and treatment of the disease.",
    "Senators like Gary Peters of Michigan and Mark Kelly of Arizona say they want more of a plan from the White House on how to handle the surge of migrants at the border.",
    "But in 2020, President Trump's administration invoked the order to restrict migrants' entry into the U.S., including for those seeking asylum at the southern border.",
    "The order will be front and center when Department of Homeland Security Secretary Alejandro Mayorkas testifies before the House Judiciary Committee on Thursday.",
    "And some agency estimates say they'll see 18,000 border apprehensions per day, which is more than twice the average number of daily apprehensions last summer.",
    "But, despite promising fairer immigration practices, the administration has actually held up the Trump-era policy and defended the use of Title 42 in court.",
    "The public health order known as Title 42 — based on a decades-old and once obscure law — has captured attention recently as it's set to expire next month.",
    "As it sees renewed interest, here are some Title 42 basics and a look at how the federal health order became the center of the current immigration debate.",
    "Sen. Chris Coons of Delaware said recently he hoped lifting Title 42 would be \"reconsidered appropriately\" if there was a further rise in COVID-19 cases.",
    "Last month, the administration agreed to let unaccompanied migrant children cross the border but continues to block all other migrants, even families.",
    "Many immigration advocates and Democrats have been pressuring President Biden to lift it because it blocks migrants at the border from seeking asylum.",
    "That move was controversial, with many congressional Democrats decrying it as a harmful measure that dismantled the country's asylum system.",
    "Overall, it's pretty obscure — and definitely not a measure imagined to operate as central to the debate over immigration and asylum law.",
    "Since it was invoked under Trump, Customs and Border Protection has counted more than 1.7 million expulsions of migrants at the border.",
    "Many more Democrats and Democratic congressional candidates have been expressing some apprehension about lifting Title 42 next month.",
    "In March, when Ukrainians started to try crossing the U.S.-Mexico border after fleeing the war, pressure on Biden mounted even more.",
    "About half of those \"that were encountered at the border in the last year were expelled under Title 42,\" she told NPR in March.",
    "Mayorkas is expected to field questions about lifting it, and he's likely to get pushback from both Republicans and Democrats.",
    "Plus, there's a bipartisan bill that was introduced earlier this month that would push back the expiration of Title 42.",
    "\"It will, no matter what, be perceived by intending migrants, and most importantly by smugglers, as the time to come.\"",
    "White House press secretary Jen Psaki has said that any delay on lifting Title 42 would require congressional action.",
    "Title 42 comes from a federal law that dates back to 1944 meant to help prevent the spread of communicable disease.",
    "The Centers for Disease Control and Prevention announced earlier this month that Title 42 would expire on May 23.",
    "Immigration advocates have been critical of Biden for months and have long been pressuring him to lift Title 42.",
    "Kelly and others have signed onto a bill with Republicans to delay lifting Title 42 by at least 60 more days.",
    "It also did things like establish the National Cancer Institute under the National Institutes of Health.",
    "Lawmakers return this week and many are expected to resume their focus on trying to keep it in place.",
    "A COVID-19 aid package was held up in early April when Republicans attempted to extend the order.",
    "Government officials are bracing for a surge of migrants at the border once the order lifts.",
    "But if Congress wanted to change course on Title 42 and delay it legislatively, they could.",
    "Congress left for Easter recess before sorting it out, and the aid package did not pass.",
    "But some in Congress, including a few close Biden allies, are saying it's too soon.",
    "In fact, some Republican members of Congress attempted just that.",
    "Democrats were generally opposed to Title 42 in 2020.",
    "How has Title 42 impacted migrants at the border?",
    "Why are some now saying it shouldn't be lifted?",
    "What happens at the border once it is lifted?",
    "When is Title 42 set to be lifted?",
    "That's a welcome move to some.",
    "This is a Trump-era policy.",
    "What's been Biden's take?",
    "In a word: influx.",
    "What is Title 42?"
  ]
}