{
  "id": 4804,
  "mediaId": 8345,
  "date": "2022-04-19",
  "headline": "Opinion: Launch conditions continue to deteriorate at South Cove",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2022/04/19/South_Cove_launch_4-15-2022_web.jpg",
  "link": "https://kdminer.com/news/2022/apr/19/opinion-launch-conditions-continue-deteriorate-sou/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Don Martin",
  "authorUrl": "https://kdminer.com/staff/don-martin/",
  "termIds": [
    2459,
    5120,
    6403
  ],
  "sentences": [
    "I believe the only way we are going to see some real movement on this issue if for our elected officials get behind a movement to ensure that the appropriate amount of money and/or equipment and personnel are made available to the LMNRA to stay on top of this tragic situation.",
    "The northern Arizona representative for U.S. Sen. Mark Kelly (D-Arizona), Coral Evans, is very interested in the situation and has promised to be at a meeting that was held earlier today in Meadview with Pattison and others.",
    "I’m still trying to reach out to other elected officials including U.S. Rep. Paul Gosar (R-Bullhead City), who I believe will also become involved in this issue when he is made aware of the seriousness of the situation.",
    "While the fishing has been good this year at South Cove on Lake Mead, the launch situation continues to deteriorate, and for boaters and anglers who use this area to recreate, the situation is looking grim.",
    "She advised on Monday that she is organizing a meeting with the National Park Service and the Bureau of Reclamation at the county administration building auditorium to discuss the issue.",
    "I suggested putting in a rock base in what we call the “trough,” and then moving the old pipe mat from the old South Cove over to this dirt area so that launching could continue.",
    "Due the unprecedented lowering of the lake, which drops 2-3 inches a day, the place where boaters and anglers have been launching from for the past year is just about unusable.",
    "As you may be aware, I’ve been writing about this situation for a long time and up to now my pleas for help to do even a temporary fix there have largely fallen on deaf ears.",
    "To be fair, I have been in contact with Justin Pattison, the acting deputy superintendent at Lake Mead National Recreational Area, for almost a year regarding this issue.",
    "I have contacted local elected officials and the Mayor of Kingman has stepped up and provided information about how to contact our federal elected officials.",
    "Communities including Meadview are going to suffer greatly if the tourists and boaters can’t get a place to launch their watercraft.",
    "Pattison has improved the road and launch area at the new South Cove launch area, putting in toilets and designated parking areas.",
    "However, at this point pleas for improving the dirt launch areas has not produced any ideas that Pattison agrees with.",
    "Remember, South Cove is currently the only place where watercraft can be launched into Lake Mead from Mohave County.",
    "I spoke with Mohave County Supervisor Jean Bishop, whose district includes Meadview and South Cove.",
    "And even if the solution is only temporary, the citizens and visitors of Mohave County deserve it.",
    "Kingman businesses will also be affected as this is the starting point for trips to Lake Mead.",
    "Fuel, bait and equipment for fishing and boating trips at South Cove originate here.",
    "But in the meantime, it’s the start of the boating and fishing season at Lake Mead.",
    "Pattison has said that projections are that the lake level will stabilize in June.",
    "Boating and angling in Mohave County are multi-million-dollar industries.",
    "We need this issue addressed now!"
  ]
}