{
  "id": 4893,
  "mediaId": 8326,
  "date": "2022-04-20",
  "headline": "White House considering whether to keep COVID-19 border controls in place longer",
  "image": "https://www.gannett-cdn.com/presto/2022/03/22/PPHX/5d2279c2-6c8c-4d72-83f2-54ccb0b2c870-Rally_for_asylum_seekers_8.jpg?crop=3399,1912,x0,y237&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/04/20/white-house-considering-extension-title-42-border-restrictions/7383205001/",
  "mediaOutlet": "Gilbert Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    0
  ],
  "sentences": [
    "… They do not have a plan to deal with the increased numbers, and, to be honest, it’s going to be a crisis on top of a crisis.”\nJason Johnson, a spokesperson for Rep. Raúl Grijalva, D-Ariz., whose Tucson-based district is on the border, said the administration still has time to formulate a responsible process for managing the border and immigration ahead of the end of Title 42.",
    "Axios first reported that President Joe Biden's advisers are weighing whether the Centers for Disease Control and Prevention should extend the use of Title 42, a longstanding public health provision used beginning in March 2020 under then-President Donald Trump to rapidly expel migrants because of coronavirus concerns.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nHowever, it is unclear whether an extension of the policy would change the conditions on ground, Bolter said.",
    "Both of Arizona's Democratic senators, Kyrsten Sinema and Mark Kelly, have sponsored with some Senate Republican support a bill that would require the extension of Title 42 until the administration has a detailed plan to manage the immigration fallout.",
    "\"Even if the Biden administration itself doesn't make the decision to delay the termination, it's possible that judge will make the decision for them,\" said Jessica Bolter, associate policy analyst at the Migration Policy Institute.",
    "\"The fact that this message has already been put out there, that a restrictive policy will be lifting will likely lead to some uptick around the end of May, regardless of whether Title 42 is terminated or extended,\" Bolter added.",
    "Last week, Sinema said she had been calling on Biden to \"delay the end of Title 42 until/unless they have a workable plan in place to address what will be a massive increase of migrant flow to the southern part of our border.",
    "Rep. Ann Kirkpatrick, D-Ariz., whose district also includes the border, said in a written statement she recognizes the \"complexity of this issue, and it is more nuanced than just polarizing political ads.",
    "The White House reportedly is considering keeping in place at least temporarily COVID-19-related border restrictions that are set to expire next month in a move that would impact the influx of immigrants.",
    "It is a far-reaching policy decision that would affect public health, border and immigration enforcement and human services, and comes as the nation continues to dismantle COVID-19 restrictions.",
    "Title 42 is an issue that pits centrist Democrats who see it as political poison in an election year against the party's left wing, which views Title 42 as cover for anti-immigration policies.",
    "Stanton on Wednesday also wrote a letter to Biden reiterating that approach, which he said was necessary \"because the Administration's approach to the border has been largely reactionary.\"",
    "Shelter coordinators in Mexico have told The Arizona Republic about an increasing number of calls and arrivals from asylum-seeking migrants who heard about the end of the policy.",
    "On April 3, Arizona, Louisiana and Missouri's attorneys general filed a lawsuit against the federal government, challenging the \"abrupt elimination\" of the public health policy.",
    "\"There are a range of ideas out there in Congress — Democrats, Republicans, others — some who support a delay of Title 42 implementation, some who strongly oppose it,\" she said.",
    "Greg Abbott jointly announced the formation of the American Governors’ Border Strike Force, a multistate effort intended to blunt the flow drug-trafficking along the border.",
    "Many Republicans, meanwhile, have linked the ending of Title 42 for COVID to the effort to extend mandatory masking on public transportation, including flights.",
    "Title 42 “shouldn’t be around forever, but right now this administration does not have a plan,” Kelly told reporters last week during a tour of the border.",
    "The government's use of Title 42 has led to hundreds of thousands of people removed from the U.S., sometimes without even having a chance to seek asylum.",
    "That has helped mitigate border crossing numbers under the Biden administration that many congressional Republicans already view as overwhelming.",
    "Rep. Andy Biggs, R-Ariz., cast the matter this way last week in a tweet:\n\"Biden's CDC is extending the mask mandate on planes and public transit.",
    "The effect in Arizona, where border communities have strained for months to manage rising numbers of immigrants, could be even more pronounced.",
    "It's not a border policy,\" Grijalva said, adding that under Trump the policy was used to \"weaponize immigration and health policy.\"",
    "Misinformation, spreading through social media platforms and word-of-mouth, has already set many on the move, they suggested.",
    "White House press secretary Jen Psaki said Wednesday that any delay in ending Title 42 would require congressional approval.",
    "Kelly said the Biden administration should not end Title 42 without preparing for the immigrant swell that would ensue.",
    "Migrant flows typically spike in May to help meet labor demand in agriculture, construction and other industries.",
    "That includes safe shelter, transportation, staffing for asylum matters and Border Patrol officers, she said.",
    "Reps. Tom O'Halleran, D-Ariz., and Greg Stanton, D-Ariz., have co-sponsored a similar measure in the House.",
    "When Title 42 is lifted, we must be fully prepared for the influx of migrants seeking asylum.\"",
    "It is a Republican-led effort cast as an alternative to neglect on the border by Washington.",
    "Reach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "It's clear that Biden cares more about illegal aliens than American citizens.\"",
    "The timing of the policy shift also would figure to strain Arizona officials.",
    "Ending the use of Title 42 likely would send immigration numbers even higher.",
    "Yet, it is lifting the Title 42 public health order at the southern border.",
    "The administration announced earlier this month its plans to end Title 42.",
    "\"And there are a range of other ideas of reforming our immigration system.",
    "And of course what that means in plain language is Arizona and Texas.\"",
    "\"The fact remains that Title 42 is a health-care policy decision.",
    "Subscribe to our free political podcast, The Gaggle.",
    "A hearing on that matter is scheduled for May 13.",
    "We’re happy to have that conversation with them.\"",
    "This would all require congressional action.",
    "“I warned them about this months ago.",
    "Follow him on Twitter @ronaldjhansen.",
    "The order is set to expire May 23.",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "Doug Ducey and Texas Gov.",
    "On Tuesday, Arizona Gov."
  ]
}