{
  "id": 4922,
  "mediaId": 2562,
  "date": "2022-04-18",
  "headline": "Senate Homeland Security Chair Peters Says Plan to Drop Title 42 ‘Should Be Revisited’",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid7762E402-DF1A-4AA3-94CC-01DDF9210B38.jpg",
  "link": "https://donaldjtrumppolls.com/senate-homeland-security-chair-peters-says-plan-to-drop-title-42-should-be-revisited/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    2346,
    1799,
    2799,
    1489,
    1498,
    6657,
    5949,
    6150,
    5969
  ],
  "sentences": [
    "(Patrick T. Fallon/AFP via Getty)\nBy Charlie McCarthy | Monday, 18 April 2022 02:11 PM\nThe Democrat chairman of the Senate Homeland Security and Governmental Affairs Committee said Title 42 should not be ended unless the Biden administration develops \"a well thought-out plan.\"",
    "According to a court document filed Friday in a federal lawsuit between Texas and Missouri against President Joe Biden's administration, Customs and Border Protection agents encountered more than 221,000 illegal migrants along the southern border in March.",
    "The number of illegal individuals encountered is the highest for that month since March 2000, when 220,063 illegal migrants were encountered at the southwest border, according to the U.S. Border Patrol, and seven times higher than 2020.",
    "Moderate Sen. Kyrsten Sinema, D-Ariz., who is not up for reelection in November, spoke out against the Biden administration, saying the White House's decision to repeal Title 42 could be harmful to Arizona communities and migrants.",
    "Sen. Gary Peters, D-Mich., who also chairs the Democratic Senatorial Campaign Committee (DSCC), on Monday addressed Trump-era Title 42 — the order that allowed migrants to be denied entrance due to the COVID-19 pandemic.",
    "\"Unless we have a well thought out plan, I think it is something that should be revisited and perhaps delayed,\" Peters said Monday, Politico congressional bureau chief Burgess Everett tweeted.",
    "Everett also tweeted that Peters defended fellow Democrat lawmakers for criticizing the administration for not being prepared to handle the increase in migrants at the southern border.",
    "Senate Homeland Security Chair Peters Says Plan to Drop Title 42 'Should Be Revisited' Ukrainian refugees enter the U.S.-Mexico border in Tijuana and Baja California, on April 9, 2022.",
    "Senate Democrats running for reelection in November also are separating themselves from the Biden administration's southern border policies, which include the decision to end Title 42.",
    "Mark Kelly, D-Ariz., Catherine Cortez Masto, D-Nev., and Raphael Warnock, D-Ga. — all seeking reelection in swing states — have slammed the administration’s decision to end Title 42.",
    "Senate Judiciary Committee Republicans wrote Chairman Dick Durbin, D-Ill., to demand a hearing on the potential impact of the decision to rescind Title 42.",
    "The Centers for Disease Control and Prevention (CDC) announced April 1 that Title 42 order will end May 23.",
    "I’m asking those questions as well and we’ll look forward to hearing directly from the secretary.\"",
    "\"They’re right to raise questions,\" Peters said, Everett tweeted.",
    "\"This is a very serious issue, they need to be asking questions.",
    "Original Article",
    "Sens."
  ]
}