{
  "id": 4930,
  "mediaId": 8416,
  "date": "2022-04-19",
  "headline": "On Tax Day, GOP Holds Arizona Democrats Accountable For Biden Inflation Tax",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/04/19/on-tax-day-gop-holds-arizona-democrats-accountable-for-biden-inflation-tax/?utm_source=rss&utm_medium=rss&utm_campaign=on-tax-day-gop-holds-arizona-democrats-accountable-for-biden-inflation-tax",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "One Democrat, Tom O’Halleran, even said “inflation is not out of control.”\nArizona Democrats received invoices for “revenue lost as a result of enabling Joe Biden’s reckless economic agenda and relentlessly backing Joe Biden even as Arizonans lose a substantial amount of their income per month thanks to Bidenflation.” Biden’s massive spending sprees and the Arizona Democrats who voted for them caused this inflation.",
    "“Arizona Democrats including Mark Kelly, Tom O’Halleran, Greg Stanton and Ann Kirkpatrick are long past due to start blocking Joe Biden’s reckless agenda that has caused the worst inflation in the country, record-high gas prices and mounting financial pain for Arizona families.” – RNC Spokesperson Ben Petersen",
    "Photo: Republicans deliver a Tax Day invoice to Democrat Mark Kelly’s office in Phoenix\nToday on Tax Day, Republicans held Arizona Democrats accountable for backing Biden’s inflation tax on struggling Arizona families.",
    "These invoices are labeled “PAST DUE” because Arizona Democrats including Kelly, O’Halleran, Stanton and Kirkpatrick have repeatedly refused to stand up to Biden on behalf of Arizonans.",
    "Arizonans are stuck paying the price of the worst inflation in the country while simultaneously feeling the pain at the pump from the highest gas prices in state history.",
    "The Wall Street Journal recently covered the impact of Biden’s inflation tax on Arizonans and how inflation has been turning swing voters against Democrats.",
    "Republicans sent Tax Day invoices to Arizona Democrat incumbents including Mark Kelly, Tom O’Halleran, Greg Stanton and Ann Kirkpatrick.",
    "The GOP is drawing attention to Joe Biden’s mishandling of inflation by delivering invoices to the offices of Arizona Democrats.",
    "A new Joint Economic Committee report revealed how inflation sent prices surging since Biden took office in January 2021.",
    "It all adds up to a dose of economic pain for workers, families and businesses filing their taxes by today’s deadline.",
    "Arizonans are on track to pay $7,721 more for the things they buy on an annualized basis due to Bidenflation.",
    "Arizona Democrats need to foot the bill for $433/month, totaling $1,299 this year to date per household.",
    "Arizona Democrats have 30 days to submit payment to Arizonans.",
    "Inflation costs last month alone amounted to $643 in Arizona."
  ]
}