{
  "id": 4993,
  "mediaId": 8322,
  "date": "2022-04-22",
  "headline": "Colorado GOP Senate contender nicknamed ‘The Boss’ spotlights conservative credentials",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/Joe-ODea-April-9-2022-Colorado-Springs.jpg",
  "link": "https://www.foxnews.com/politics/colorado-gop-senate-contender-touts-conservative-credentials",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "O’Dea, a first-time candidate and the owner of Concrete Express, a Denver-based construction company that employs more than 300 people, is one of two Republicans who will face off for their party’s Senate nomination in Colorado’s June 28 primary.",
    "Hanks, who’s base is Freemont County, southwest of Colorado Springs, is a strong supporter of former President Donald Trump’s claims that his 2020 election loss to now-President Biden was due to massive voter fraud.",
    "O’Dea will face off in the June primary against Republican state Rep. Ron Hanks, who won the top line designation in the Republican primary ballot earlier this month at the GOP’s state assembly in Colorado Springs.",
    "O’Dea’s campaign tells Fox News they will spend a quarter of a million dollars to run the ad statewide for three weeks, in order to boost their candidate’s name recognition with Colorado primary voters.",
    "The winner will take on Democratic Sen. Michael Bennet in November, in a race that the GOP increasingly thinks it has a chance of winning in a state that’s leaned blue for nearly two decades.",
    "Republicans need a net gain of just one seat in November’s midterms to win back the Senate majority they lost when they were swept in Georgia’s twin runoff elections in January 2021.",
    "He built his construction company from the ground up, employing hundreds of Coloradans,\" the narrator says in the spot, which was shared first with Fox News on Friday.",
    "O’Dea brought in $410,000 during the January-Mach 2022 first quarter of fundraising — including $107,000 of his own money — compared to just $29,000 raised by Hanks.",
    "\"I fully expected Donald Trump to win in 2020, and he did,\" Hanks said to loud cheers by the GOP delegates gathered at the Republican state assembly.",
    "O’Dea landed his name on the primary ballot by getting at least 1,500 valid signatures from each of Colorado’s eight congressional districts.",
    "But ousting Bennet, who’s won two previous Senate elections, won’t be easy in a state Biden carried by 13 points in the 2020 election.",
    "On Saturday, O’Dea's campaign will begin a TV, radio, and digital ad blitz spotlighting his story and why he’s running for the Senate.",
    "Mark Kelly of Arizona, Raphael Warnock of Georgia, Catherine Cortez Masto of Nevada, and Maggie Hassan of New Hampshire.",
    "The Republicans top four targets this year are four first term Democratic senators in key battleground states — Sens.",
    "\"He’s running for the Senate to cut the debt, stop inflation, support the police and military, take on rampant crime.",
    "While Hanks may have an edge over his rival in name recognition, O’Dea has a massive lead in the fundraising fight.",
    "And Bennet hauled in $2.5 million in fundraising the past three months, bringing his cash on hand to $6.1 million.",
    "And O’Dea had $609,000 in his campaign coffers as of the end of March, compared to just $16,000 for Hanks.",
    "Five other Senate candidates who were running for the nomination were eliminated at the party gathering.",
    "FIRST ON FOX: Joe O’Dea wants Colorado voters to know that he’s \"not a politician.\"",
    "O’Dea has said he doesn’t agree with Trump’s claims regarding the 2020 election.",
    "GOP REELECTION ARM TAKES AIM AT ARIZONA'S KELLY IN NEW AD BLITZ\n\"Joe O’Dea.",
    "The boss, not a politician,\" the narrator continues.",
    "He’s a construction CEO and a Colorado leader.",
    "Topping their second-tier targets is Bennet.",
    "He’s a conservative running for U.S. Senate.",
    "Endorsed by conservatives.",
    "People call him the boss.",
    "He’s not a politician.",
    "Endorsed by police.",
    "Joe O’Dea."
  ]
}