{
  "id": 5064,
  "mediaId": 8450,
  "date": "2022-04-18",
  "headline": "Crece la cifra de cruces de migrantes en la frontera sur de EEUU, la más alta en 20 años",
  "image": "https://media.telemundoarizona.com/2022/04/TLMD-cruce-migrantes-frontera-eeuu.jpg?quality=85&strip=all&fit=1024%2C576",
  "link": "https://www.telemundoarizona.com/noticias/inmigracion/cruces-migrantes-frontera-sur-estados-unidos-detenciones-patrulla-fronteriza/2215990/",
  "mediaOutlet": "telemundoarizona.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    6680,
    6709
  ],
  "sentences": [
    "Las autoridades han expulsado a migrantes en más de 1.7 millones de ocasiones en apego a las facultades del Título 42, que lleva el nombre de una ley de salud pública de 1944 que usa la amenaza de propagación de COVID-19 como justificación para negarles a los migrantes la oportunidad de solicitar asilo tal como lo establecen la ley federal estadounidense y los tratados internacionales.",
    "LAS AUTORIDADES DETUVIERON A MIGRANTES EN MÁS DE 221,000 OCASIONES EN MARZO\nLa cifra de encuentros con migrantes ha aumentado casi todos los meses desde que Biden asumió la presidencia, convirtiéndose en un argumento para sus opositores políticos que destacan el aumento como evidencia de que su gobierno es más débil que el de su predecesor en materia de seguridad fronteriza.",
    "Las nuevas cifras se dieron a conocer en momentos en que la presión se acumula sobre el gobierno del presidente Joe Biden debido al inminente vencimiento de una orden de salud pública que les permitió a las autoridades federales enviar de regreso a la mayoría de los inmigrantes, incluyendo a aquellos que buscaban asilo argumentando persecución.",
    "WASHINGTON — El número de migrantes que intentaron cruzar la frontera sur de Estados Unidos el mes pasado alcanzó su mayor nivel de las últimas dos décadas, y el país se prepara para un número incluso mayor cuando se levante una orden relacionada con la pandemia que rechazaba a los solicitantes de asilo.",
    "Las autoridades migratorias de Estados Unidos detuvieron a migrantes en 221,303 ocasiones en la frontera con México durante marzo, un incremento del 33% respecto al mes anterior, según datos de la Oficina de Aduanas y Protección Fronteriza (CBP por sus iniciales en inglés) dados a conocer el lunes.",
    "Más de la mitad de los 221,303 detenidos fueron enviados rápidamente de regreso, ya fuera a México o a sus países de origen, según los datos presentados ante una corte federal en Texas como parte de la impugnación del estado a las políticas migratorias del gobierno de Biden.",
    "El total de cruces ilegales, o aquellos ocurridos fuera de los puertos oficiales de entrada, fue de 209,906 en marzo, rebasando el récord previo de la presidencia de Biden de 200,658 establecido en julio, y el nivel más alto de marzo de 2000, cuando llegó a 220,063.",
    "“Estados Unidos puede y debe recibir a las personas que buscan asilo porque así lo establece la ley, porque es lo correcto, y porque podemos”, manifestó la Catholic Legal Immigration Network en un comunicado difundido el lunes para conmemorar la Semana Santa.",
    "El rezago en la atención de personas que aguardan fuera del país para solicitar asilo, así como la complicada situación política y económica en buena parte de Latinoamérica y el Caribe, son en parte responsables del incremento de migrantes.",
    "Grupos defensores de los derechos humanos y otros activistas aseguran que Estados Unidos tiene la obligación legal de permitir que las personas soliciten asilo, y han hecho un llamado para el retiro de la orden de salud pública.",
    "El comisionado de la CBP, Chris Magnus, señaló en un comunicado que la agencia planeaba enviar personal adicional a la frontera suroeste para lidiar con el “posible” incremento que se prevé una vez que se levante el Título 42.",
    "El senador Mark Kelly, un demócrata por Arizona que buscará la reelección este año, recorrió la frontera la semana pasada y advirtió que el gobierno de Biden no está preparado para que se levanten las restricciones de asilo.",
    "En marzo de 2020, el gobierno previo invocó el Título 42, una orden de salud pública rara vez utilizada que permite la expulsión expedita de casi todas las personas que sean detenidas tras cruzar la frontera suroeste.",
    "La cifra de ucranianos, a los que en términos generales se les permite ingresar al país con un permiso condicional humanitario, aumentó a más de 200 durante marzo, en comparación con apenas 5 en noviembre pasado.",
    "Los críticos del gobierno culpan a Biden, argumentando que su decisión de revertir las políticas que se implementaron en la era del expresidente Donald Trump han alentado a las personas a venir a Estados Unidos.",
    "A cerca de 34,000 se les permitió permanecer en Estados Unidos con un permiso condicional humanitario, con el cual pueden intentar conseguir asilo o la residencia legal mediante otros recursos.",
    "Los migrantes son enviados de regreso sin consecuencias legales, y muchos simplemente vuelven a intentar cruzar, por lo que son contabilizados en más de una ocasión en el total.",
    "Ante el declive de casos de COVID-19, el gobierno de Biden ha dicho que pretende ponerle fin al uso del Título 42 en la frontera a partir del 23 de mayo.",
    "La CBP señaló que el número de encuentros de individuos únicos a nivel nacional durante marzo fue de 159,900, un aumento del 37% respecto al mes previo.",
    "Trump también enfrentó un marcado incremento de cruces fronterizos de migrantes, pero la cifra se desplomó con la llegada de la pandemia.",
    "La mayor parte del restante fue procesada bajo un mandato migratorio conocido como Título 8, y su destino final varía.",
    "Varios demócratas moderados se han sumado a los líderes republicanos en su llamado a una extensión del Título 42.",
    "Las expulsiones expeditas en virtud del Título 42 son un componente significativo de los aumentos recientes.",
    "Los mexicanos representan el mayor número de encuentros en la frontera, seguidos de los cubanos.",
    "De no tener éxito, podrían enfrentar la deportación."
  ]
}