{
  "id": 5112,
  "mediaId": 2522,
  "date": "2022-04-23",
  "headline": "Arizona AG tears into Dems suddenly recognizing border crisis, importance of Title 42",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/SG-Biden-Brnovich.jpg",
  "link": "https://www.bizpacreview.com/2022/04/23/arizona-ag-tears-into-dems-suddenly-recognizing-border-crisis-importance-of-title-42-1229208/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Haggerty",
  "authorUrl": "https://www.bizpacreview.com/author/kevin-haggerty/",
  "termIds": [
    5879,
    3401,
    4407,
    4905,
    2459,
    392,
    5949,
    6678
  ],
  "sentences": [
    "It’s going to be, to be honest, it’s going to be a crisis on top of a crisis.”\nSen. Kyrsten Sinema (D-Ariz.) also stated, “Arizona communities bear the brunt of the federal government’s failure at our border, so we’re stepping in and protecting border communities by ensuring the Administration works hand-in-hand with local leaders, law enforcement, and non-profits to put a comprehensive, workable plan in place before lifting Title 42.”\nThe flip from some Democrats on Title 42 has reportedly led the president to consider delaying the repeal of the deportation policy that, if lifted, could result in as many as 18,000 border-crossers per day.",
    "Now the last thing that we have in place that’s saving us from even more illegal immigration, even more crime and drugs flowing into our country, is Title 42.”\nMissouri Attorney General Eric Schmitt (R), who represents one of the states that filed for a temporary restraining order against the Centers for Disease Control and Prevention (CDC) in their capacity to terminate Title 42, stated, “The Biden Administration has utterly failed at securing our Southern border, and their continual termination of successful programs like the Migrant Protection Protocols and Title 42 are worsening the ongoing border crisis.",
    "(Video: Fox News)\nArizona attorney general and Senate hopeful Mark Brnovich (R) slammed middling Democrats for their change of heart on immigration policy out of political expedience when, until now, they’ve allowed President Joe Biden’s “neo-Marxist vision” to “basically destroy our country.”\nBrnovich joined “The Ingraham Angle” guest host, former Rep. Jason Chaffetz (R-Utah), on Fox News Friday to discuss the latest updates on legal recourse states have sought while the administration has remained negligent toward maintaining the sovereign borders of the United States.",
    "Missouri, Arizona, and Louisiana have led the charge to keep Title 42 in place – if the Biden Administration won’t take proactive steps to secure the Southern border, we will.”\n“We’re hoping to get a federal judge to say to the Biden Administration, ‘no, stop, you can’t do this because American lives are at risk'” while the policies of the president and his allies are seemingly governed by what will provide the best political outcome in November.",
    "“That already endangers Democratic incumbents in states that could decide the Senate majority in November.”\nIf Title 42 is lifted, Brnovich said it will only further the “man-made disaster” created by Biden “when he stopped building the border wall, when he stopped deporting people/deportation orders, when he tried to lift the Remain in Mexico policy.",
    "But shame on them, they have enabled Joe Biden to basically destroy our country in just a year and a half.”\nThe “political conversion” the Senate candidate referred to was reported Wednesday when, for instance, Kelly had gone on the record opposing ending Title 42 stating, in part, “Right now, we have a crisis on our southern border.",
    "“And the reality is, Joe Biden and ‘Cartel Kelly'” Brnovich said referring to incumbent Sen. Mark Kelly (D-Ariz.), “are trying to impose some neo-Marxist vision on this country and Americans are paying the price, not only at the gas pump and the grocery store, but literally with our lives and the lives of our children.",
    "“The reality is there is a political class in Washington, D.C. that’ll say or do anything to get elected and it’s the reason why we need responsible people in D.C. representing American values,” he explained.",
    "Before touching on the joint suit filed by 20 states’ attorneys general, Arizona’s top cop laid into Democrats who’ve flip-flopped on immigration enforcement to curry favor.",
    "“The White House is looking for ways to buy time to avoid a massive influx of migrants that would add to already-historic border numbers,” an inside source revealed.",
    "And it is a dangerous experiment that they are trying to impose and I think that there’s this political conversion with some Democrats nowadays.",
    "If Title 42 is terminated, there will undoubtedly be a tsunami of illegal immigrants that affects all states, including Missouri.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "Right now, this administration does not have a plan.",
    "The public will not see it and we do not share it.",
    "I warned them about this months ago.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!"
  ]
}