{
  "id": 5136,
  "mediaId": 2553,
  "date": "2022-04-24",
  "headline": "Texas AG Sues Biden For Lifting Title 42 Amid ‘Devastating’ Migrant Surge",
  "image": "https://dw-wp-production.imgix.net/2022/04/GettyImages-1240161287.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/texas-ag-sues-biden-for-lifting-title-42-amid-devastating-migrant-surge",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabe Kaminsky",
  "authorUrl": "https://www.dailywire.com/author/gabe-kaminsky",
  "termIds": [
    0
  ],
  "sentences": [
    "Without justification or concern for Texans, the Defendants unlawfully disregarded the APA’s notice-and-comment requirements, refused to consider numerous factors of crucial importance to their rulemaking, and laid bare the incoherence of their decision-making.”\nPaxton joins a bipartisan coalition of chief legal advisors and lawmakers that oppose Title 42’s rollback.",
    "“This is an open invitation for both of those from the Biden administration.”\nThe Daily Wire is one of America’s fastest-growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "Other Democrat senators who have joined Republicans in speaking critically of Biden’s repeal decision include West Virginia’s Joe Manchin, Delaware’s Chris Coons, New Hampshire’s Maggie Hassan, Georgia’s Raphael Warnock, Nevada’s Catherine Cortez Masto, and Montana’s Jon Tester.",
    "Texas Attorney General Ken Paxton filed a lawsuit against the Biden administration over its decision to end a public health order responsible for deporting millions of illegal aliens — telling The Daily Wire there will be a “completely open border” if this happens.",
    "One senior Democrat aide said “there’s a lot of lobbying” and that Biden should “extent it and move on.”\nSpeaking to The Daily Wire, Paxton said Title 42’s repeal will make worse an already ineffective border system under Biden.",
    "It alleges that the administration did not consider the possible consequences of ending the order and that it did not follow notice-and-comment requirements — wherein people may take part in considering a proposed rule.",
    "Roughly 500 migrants affiliated with gangs were apprehended by CBP officers during Biden’s first year in office, Department of Homeland Security data obtained by The Daily Caller shows.",
    "“The Defendants now seek to eliminate their Title 42 border-control measures, which are the only rules holding back a devastating flood of illegal immigration,” the complaint states.",
    "Paxton’s lawsuit is the latest Republican challenge to Biden’s scheduled rollback of Title 42, a Trump-era COVID-19 policy implemented in March 2020 that restricts asylum claims.",
    "The Trump-era policy allows the government to release migrants with asylum claims to Mexico as they await hearings in the U.S. and is being reviewed by the U.S. Supreme Court.",
    "“The cartels are going to be incentivized just to bring everybody to expand their network of human trafficking and drug trafficking,” the attorney general said.",
    "“This basically ends any kind of idea that there’s any border at all.”\nIn April, the Biden administration signaled that it will repeal Title 42 in May.",
    "The U.S. Customs and Border Protection has seized more than 88,800 pounds of meth at the border so far in fiscal year 2022, according to statistics.",
    "Paxton’s legal challenge comes after he succeeded in various others, such as making the administration enforce Remain in Mexico last year.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "We’re already overwhelmed given the fact that the Biden administration is ignoring federal law and every other aspect of immigration.",
    "Paxton also told The Daily Wire that Biden’s move will further send a message to drug cartels that the U.S. is prime territory.",
    "Michigan Democrat Sen. Gary Peters said Biden needs to “fully articulate” his plan and probably revisit or delay the repeal.",
    "An increasing number of Democrats have joined Republican members of Congress in urging Biden not to end the directive.",
    "Kelly has warned that, following its repeal, “it’s going to be a crisis on top of a crisis,” The Daily Wire reported.",
    "“But they failed to follow the Administrative Procedure Act in attempting this destructive rescission of Title 42.",
    "“Those two programs have been the most effective at stopping people from coming into the country,” said Paxton.",
    "He also said that the Migrant Protection Protocols, also known as “Remain in Mexico,” ought to remain in place.",
    "One Democrat who has been especially vocal about Biden’s decision on Title 42 is Arizona Sen. Mark Kelly.",
    "This is the only thing we have left.”\n“You know, they’re already pouring through,” he also said.",
    "Become a member now and join our mission.",
    "“This is huge for my state.",
    "Believe the same?"
  ]
}