{
  "id": 5152,
  "mediaId": 2721,
  "date": "2022-04-20",
  "headline": "Joe Biden’s immigration dilemma",
  "image": "https://thehornnews.com/wp-content/uploads/2022/03/biden_oil-600x315-cropped.jpg",
  "link": "https://thehornnews.com/joe-bidens-immigration-dilemma/",
  "mediaOutlet": "thehornnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5078,
    5510,
    4905,
    3653,
    1973,
    1882,
    128,
    253,
    392
  ],
  "sentences": [
    "Asylum and other legal migration pathways should remain available to those seeking protection, but those who don’t qualify will be promptly removed to their countries of origin.”\nIn the end, Biden may either comply with the C.D.C.’s recommendation to end Title 42 on May 23, or he can choose to defend the borders.",
    "“Now that mask mandates are ending across our country, it is even harder for those who support Title 42 to say this policy is a matter of public health.”\n“I hope the White House continues on its path to eliminating Title 42,” Rep. Veronica Escobar, D-Texas, told Axios.",
    "The one food you should NEVER put on your dinner plate [sponsored]\n“Title 42 is a public health authority from the CDC and we continue to defer to the CDC on its use and how long it will be in place,” White House representative Vedant Patel told Axios.",
    "On April 1, the Centers for Disease Control and Prevention announced its intention to end Title 42, a pandemic-era rule allowing Homeland Security to cite public health as a reason to deny asylum at the border.",
    "Sponsored: The truth about eggs and senior brains\nSome Democratic leaders in Congress want Biden to delay the repeal until November to minimize voter backlash for a worsening board situation.",
    "Title 42 shouldn’t be used as a substitute for real immigration policy.”\nThe Biden administration is reportedly going back and forth on the issue and has yet to voice its intent.",
    "They worry about a massive wave of asylum seekers — not only because of humanitarian concerns, but also because their dim prospects in the upcoming midterm election.",
    "He represents a border district, and he triggered a runoff election last month, after failing to win more 50 percent of the vote during the Democratic primary.",
    "“The Republicans are going to hit Democrats with those videos of people streaming into the United States.”\nDemocrats have voiced similar concerns in the past.",
    "However, other signatories include lesser-known Democrats in close fights for re-election, like Mark Kelly of Arizona and Maggie Hassan of New Hampshire.",
    "Former Sen. Claire McCaskill, D-Mo., lost an election in 2018, and she blamed a viral video of a migrant caravan, according to her remarks on The Daily.",
    "In the Senate, five Democrats and six Republicans have co-sponsored the Public Health and Border Security Act in order to extend Title 42.",
    "pic.twitter.com/KsrP04LSuw\n— John Roberts (@johnrobertsFox) April 13, 2022\nUrgent: Common prescription drug now linked to Alzheimer’s?",
    "“When it is no longer in place, migrants who attempt to enter the country unlawfully will be placed in immigration proceedings.",
    "“Asylum is a human right, and ending Title 42 is the right thing to do,” Rep. Chuy García, D-Ill., said, according to Axios.",
    "Take a look —\nTexas Governor @GregAbbott_TX carries out his pledge to transport illegal migrants to Washington, DC.",
    "Biden’s aides have been discussing whether or not to delay repealing the rules, one insider told Axios on Tuesday.",
    "is planning to lift the rule on May 23… but President Joe Biden suddenly doesn’t seem to be on board.",
    "Border Patrol agents have warned that the border would quickly be overwhelmed by illegal immigrants.",
    "The bus pulled up right in front of the building that houses @FoxNews , @NBCNews and ?@cspan?",
    "What’s more, he promised to send yet another bus, The Horn News reported earlier this month.",
    "However, the Democratic Party also includes immigration extremists bent on ending Title 42.",
    "The list of signatories includes a usual suspect, Democrat Joe Manchin of West Virginia.",
    "Greg Abbott, a Republican, has already created some viral videos of his own.",
    "“The politics are pretty simple,” Rep. Henry Cuellar, D-Texas, told Axios.",
    "[Sponsored]\nCuellar, in particular, faces a tough path to reelection.",
    "He apparently bused dozens of illegal immigrants to the Capitol.",
    "“Let’s work together on addressing this as lawmakers.",
    "Either way, he will anger someone in his own party.",
    "“Title 42 should be kept,” Cuellar told Axios.",
    "Many Senate Democrats agree.",
    "The Horn editorial team",
    "Texas Gov.",
    "The C.D.C."
  ]
}