{
  "id": 5168,
  "mediaId": 2522,
  "date": "2022-04-20",
  "headline": "Biden may delay lifting Title 42 as Democrats fret over looming midterm disaster: report",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/SG-Biden-Migrants.jpg",
  "link": "https://www.bizpacreview.com/2022/04/20/biden-may-delay-lifting-title-42-as-democrats-fret-over-looming-midterm-disaster-report-1227851/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Haggerty",
  "authorUrl": "https://www.bizpacreview.com/author/kevin-haggerty/",
  "termIds": [
    2459,
    3653,
    4905,
    4873,
    4063,
    5096,
    392,
    1126,
    1489
  ],
  "sentences": [
    "“That includes members of the Congressional Hispanic Caucus, who are scheduled to meet with the president next Monday.”\nMidterm reckoning forces ten Dems to turn on Biden, join GOP in opposing plan to end title 42 https://t.co/YowqOwcBCw pic.twitter.com/1GA7iOkZgb\n— Conservative News (@BIZPACReview) April 20, 2022\nSome of those so-called moderate Democrats have already aligned with Republicans on this issue and are calling out the failure of Biden to institute a plan to deal with the estimated 18,000 border-crossers per day before allowing the measure to end.",
    "At this point, it is absolutely clear that Secretary Mayorkas is working not only in violation of the law but against the security of the United States.”\nThese allegations hold new weight as Fox News national correspondent Bill Melugin reported today that Border Patrol has “already stopped enforcing Title 42 on migrants from Northern Triangle countries.”\nAgents in the field have been telling me the same, they’ve been told to no longer enforce Title 42 on Northern Triangle countries even though the May 23rd repeal date is still over a month away.",
    "who has been outspoken against Biden’s handling of the border crisis told Axios, “The Republicans are going to hit Democrats with those videos of people streaming into the United States.”\nThese issues have been further exacerbated by Department of Homeland Security (DHS) Secretary Alejandro Mayorkas whose resignation has already been demanded from state attorneys general for his failure to enforce the laws.",
    "That already endangers Democratic incumbents in states that could decide the Senate majority in November.”\n“Biden officials recognize they’re in a jam: moderate Democrats are pounding on them to delay the repeal but doing so would inflame the party’s progressive base,” the report continued.",
    "“I’m told only predominantly Mexican nationals are being Title 42’d now.”\nThis aligns with the objectives of progressive Democrats and the Hispanic Caucus as Axios reported Rep. Jesús García (D-Ill.) said, “Asylum is a human right, and ending Title 42 is the right thing to do.",
    "President Joe Biden’s reactionary leadership has continually highlighted the growing divide within his own party as he now faces a lose-lose scenario on the border crisis that may result in massive gains for Republicans in November no matter where he lands.",
    "With less than five weeks remaining until the scheduled end of Title 42, sources close to the president are now reporting that the administration is not prepared to repeal the discretionary health policy used to expedite deportations of illegal immigrants.",
    "@FoxNews\n— Bill Melugin (@BillFOXLA) April 20, 2022\n“Agents in the field have been telling me…they’ve been told to no longer enforce Title 42 on Northern Triangle countries even though the May 23rd repeal date is still over a month away,” Melugin added.",
    "I know there’s a debate inside the administration, but I don’t know who is going to win on this one.”\n“Some of us,” the Texas Democrat stated on the record, “are standing up and saying this is the right thing to do for the border.",
    "Now that mask mandates are ending across our country, it is even harder for those who support Title 42 to say this policy is a matter of public health.”\nCuellar objected to this notion and said, “Title 42 should be kept.",
    "“President Biden’s inner circle has been discussing delaying the repeal of Title 42 border restrictions, now set to end May 23, according to a source with direct knowledge of the internal discussion,” Axios reported.",
    "Of course, the trepidation is not out of a concern for the detriment the country will face over the ongoing border crisis, but for how it relates to the midterm elections.",
    "“The White House is looking for ways to buy time to avoid a massive influx of migrants that would add to already-historic border numbers.",
    "“In this case, the administration hasn’t even prepared, and they don’t have a plan for what to expect,” Sen. Mark Kelly (D-Ariz.) said.",
    "Let’s come up with a detailed plan and put it in place – and I just haven’t seen that.”\nRep. Henry Cuellar (D-Tx.)",
    "“We have been pleading with them to follow the law,” Attorney General Ashley Moody (R-Fla.) said in February.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "“Forget about the unexpected part, I’m just asking for the first part of this.",
    "We all believe in immigration reform, but we don’t want chaos at the border.",
    "We want law and order at the border.”\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "I’m told only predominantly Mexican nationals are being Title 42’d now.",
    "“We have been suing and demanding that they follow the law.",
    "We know what the situation on the ground is going to be.",
    "The public will not see it and we do not share it.",
    "Enough is enough."
  ]
}