{
  "id": 5184,
  "mediaId": 2699,
  "date": "2022-04-22",
  "headline": "Biden Admin’s Confusing COVID Response Has Experts Crying ‘WTF’",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1650614031/220421-biden-title-42-tease-01_eow8c4",
  "link": "https://www.thedailybeast.com/biden-admins-confusing-covid-response-has-experts-crying-wtf?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Bixby",
  "authorUrl": "https://www.thedailybeast.com/author/scott-bixby",
  "termIds": [
    2128,
    2765,
    5078,
    5018,
    4905,
    3896,
    128
  ],
  "sentences": [
    "“The intersection between politics and public health in this pandemic is something that historians will look back on and go, what the fuck.”\nRepublicans have accused the Biden administration of incoherence in its pandemic response, declaring that its decision to appeal the Monday ruling which ended the nationwide mask mandate aboard planes and public transit while preparing for the repeal of Title 42, which allows for the expedited removal of migrants at the U.S. southern border regardless of whether they are seeking asylum, is inconsistent at best.",
    "“We need a secure, orderly, and humane response at our southern border,” Kelly said in a statement, “and our bipartisan legislation holds the Biden administration accountable to that.”\nThe entire masks-versus-Title 42 farrago, public health experts believe, is just the latest chapter in a pandemic that has seen scientific expertise and epidemiological realities overtaken by the perceived desires of voters to be done with the virus entirely—and, lately, the Democrats’ desire to avoid an electoral wipeout in the midterm elections this fall.",
    "“Narrow definitions of allowed activities prevent that needed flexibility, and ultimately worsen the crisis by limiting options available to respond.”\nEpidemiologists, virologists, public health law experts and human rights advocates told The Daily Beast that the administration’s continued enforcement of Title 42—as well as its reported consideration of delaying the measure’s repeal—reeks of political consideration trumping medical science.",
    "It’s Congress's job to have a good immigration policy—it’s CDC’s job to protect the American public.”\nBut for an administration that vowed to follow the science, its unsure response to the mask ruling—and the wobbling on finally bringing Title 42 to an end—is disheartening to those who have spent the past two years trying to keep the pandemic at bay.",
    "That delay is deeply frustrating for public health authorities, both because of the recent uptick in cases due to the BA.2 Omicron variant, a more contagious version of the strain that swept through the United States over the holidays, and because they believe that the CDC needs the ability to implement mask mandates in the event of future waves.",
    "“‘Live Free and Die’ seems to be the motto now.”\nThe real architects of the politicization are largely still Republicans, Gostin said, who noted that party identity is now the most accurate predictor of a person’s vaccination status, booster status, and willingness to comply with public health orders about masking and group activities.",
    "“There’s no public health expert I know who would argue that sending asylum seekers back to their home country or keeping them in Mexico is in any way an effective response to COVID-19,” said Lawrence Gostin, director of the O’Neill Institute for National and Global Health Law at Georgetown Law Center.",
    "After Monday’s ruling by U.S. District Judge Kathryn Kimball Mizelle, who was appointed by former President Donald Trump, the White House said that the matter of appealing the decision was up to the Department of Justice, which in turn said that it would only pursue an appeal at the request of the CDC.",
    "COVID risk, as it exists today, shouldn’t be one of them.”\nThe administration’s reported interest in extending the measure comes as Republicans threaten to hold up $10 billion COVID-19 funding unless Title 42 is reinstated, and as more conservative Democrats in Congress push for Biden to do the same.",
    "“Pure hypocrisy.”\n“The Biden admin’s logic: Let’s roll back Title 42 at the border but force masks back on Americans on airplanes,” echoed Republican National Committee chair Ronna McDaniel, who has repeatedly accused the administration of impinging on personal freedom in the name of public safety.",
    "“If there’s a legal shadow hanging over the CDC, it’s not going to be able to act immediately and decisively.”\nTitle 42, however, is an entirely different animal, with the administration ignoring loud and consistent cries from public health experts that the measure had far outlived its utility.",
    "“Containing and mitigating a pandemic requires the ability to alter measures as data and knowledge are accumulated, and that necessitates flexibility as dynamic situations change,” said Dr. Timothy Brewer, a professor of epidemiology at UCLA’s Fielding School of Public Health and of Medicine.",
    "?clarifying that he was “referring to the CDC’s mask mandate and there is no Department of Justice action on Title 42.”\nBut scientists say that both sides have it backwards—and that there’s more than enough blame to go around when it comes to letting public opinion dictate pandemic policy.",
    "But on the other, an administration that has made adhering to scientific expertise its guiding star can’t be seen as letting a single district court judge overrule the CDC’s ability to mandate masking—particularly with the likelihood of new variants rising up and causing mayhem.",
    "“Policies that may have made sense in 2020 when an objective was to reduce or slow the introduction of SARS-CoV-2 into the U.S. make no sense in 2022 when COVID is ubiquitous,” said Dave O’Connor, a professor of pathology and laboratory medicine at the University of Wisconsin.",
    "Biden accidentally invited direct comparison between the two policies on Thursday, when in response to a question asking whether he was considering delaying the repeal of Title 42, as Axios reported on Tuesday, he began talking about appealing the mask mandate decision.",
    "“Limiting the tools the CDC has available to it to respond to the COVID-19 pandemic does exactly that.”\n“It’s likely that this winter there will be a new and dangerous COVID variant, and CDC needs to be able to have mask requirements in its toolbox,” said Gostin.",
    "The senators—Mark Kelly and Kyrsten Sinema of Arizona, Raphael Warnock of Georgia, Maggie Hassan of New Hampshire, and Joe Manchin of West Virginia—declare that the measure is intended to prevent “disorder” at the border once Title 42 ends.",
    "Biden’s apparent ambivalence regarding the Department of Justice’s potential appeal of the mask mandate ruling, too, demonstrates a similarly politicized response to a pandemic that has claimed just shy of one million lives nationwide.",
    "It took three days before the decision was announced that the Justice Department would appeal the ruling—in which time the Transportation Security Administration registered 6,296,620 check-ins at airports across the country.",
    "It’s politics.”\nMoore pointed to pandemic fatigue, both on the part of the government and the American people, as a potential motivator behind ending the mask mandate, which was already set to expire in 11 days.",
    "Earlier this month, five Democratic senators joined Republicans in introducing a bill that would keep Title 42 in place until 60 days after the end of the public health emergency first declared in January 2020.",
    "“So much of what is going on isn’t really about public health: it’s about the midterm elections,” said John P. Moore, a professor of microbiology and immunology at Cornell University’s Weill Cornell Medicine.",
    "But as he fights for the right to re-implement mask mandates on public transit and navigates the growing political opposition to the repeal of Title 42, it’s the public health experts who are the most upset.",
    "“No—what I’m considering is continuing to hear from my, well, first of all, there’s gonna be an appeal by the Justice Department,” Biden said following remarks in the Roosevelt Room of the White House.",
    "But there has been no decision on extending Title 42.”\n“We don’t make decisions in this country that are in the best interest of the public health of other people, and it’s going to get worse.",
    "“Because as a matter of principle, we want to be able to be in a position where if, in fact, it is strongly concluded by the scientists that we need Title 42, that we’d be able to do that.",
    "It’s based on the serious consideration of the public reaction.”\nThat delayed response to the mask mandate was due in part to conflicting feelings about the issue within the White House.",
    "On one hand, public masking on airplanes and public transportation remained the most conspicuous marker of the pandemic era that the Biden administration fervently wishes to move beyond.",
    "They’re just dressing up their arguments in the language of public health,” Gostin said of Republicans who are using the mask wars to push for Title 42’s continued enforcement.",
    "At the same time Biden says that COVID it is not serious enough to maintain the Title 42 expulsions of illegal immigrants crossing the border,” tweeted Gov.",
    "Ending the mask mandate, Moore continued, even on the administration’s timeline, “isn’t based on any serious consideration of the facts of the pandemic.",
    "“We don’t make decisions in this country that are in the best interest of the public health of other people, and it’s going to get worse,” said Moore.",
    "President Joe Biden is no stranger to attacks from Republicans who accuse his administration of ignoring public health in the name of politics.",
    "'Live Free and Die’ seems to be the motto now.”\nThe White House press office later released a statement attributed to the president ?",
    "The CDC mask mandate, meanwhile, is much, much more important because it can actually prevent transmission of infectious diseases.\"",
    "It’s got nothing to do with public health, because there is still a significant number of daily infections by Omicron,” said Moore.",
    "“Federal laws and regulations should not increase the likelihood of avoidable US citizens' deaths or serious disease,” Brewer said.",
    "“Everyone wants the virus to go away, but the virus goes away at its own time—a wish doesn’t make it happen,” Moore said.",
    "“The Biden administration says that COVID remains serious enough to require passengers on airplanes to wear face masks.",
    "“There are myriad complex considerations for something as challenging as setting immigration policy.",
    "“If there’s one thing that CDC shouldn't be doing, it’s trying to run American immigration policy.",
    "Greg Abbott (R-TX), one of the administration’s most aggressive critics on immigration policy.",
    "“It has everything to do with immigration politics and has nothing to deal with public health.",
    "“Why was the CDC considering eliminating the mask mandate for flights next month?",
    "“This is one fucked-up country, really, when you come down to it,” said Moore.",
    "“They’re not making a scientific or public health point.",
    "“So what is driving it?"
  ]
}