{
  "id": 5257,
  "mediaId": 2658,
  "date": "2022-04-21",
  "headline": "Biden’s dismal poll numbers imperil Dem Senate control",
  "image": "https://static.politico.com/69/62/8d7dc4f04f3f8eaeea21eeff862d/https-delivery.gettyimages.com/downloads/1330076716",
  "link": "https://www.politico.com/news/2022/04/21/senate-democrats-midterm-election-biden-00026781",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Carney joked that Republicans will need to list “President Biden and his policies as a massive in-kind contribution,” calling his presidency “the gift that keeps on giving” and likening his performance to a “‘Saturday Night Live’ parody.”\nAlluding to polling suggesting Biden’s erosion among key Democratic constituencies, Chris Wilson, CEO of the polling firm WPA Intelligence, said, “Democrats don’t have the ability to incite the minority vote like they used to.”\nWilson, the pollster for Republican Adam Laxalt’s campaign in Nevada, pointed to both internal and external surveys of likely voters that show he is maintaining a lead over Cortez Masto.",
    "“The path to a Senate majority in 2022 runs through a core set of highly competitive races in states where Democrats have been successful in the past,” said J.B. Poersch, president of the Democrats’ Senate Majority PAC, adding that those races include “this group of strong, battle-tested incumbents whose North Star is fighting for their constituents’ best interests.”\nGOP missteps are further fueling Democratic optimism about the party’s ability to weather the harsh midterm election environment.",
    "Acutely aware of the need to get distance from the president, the four most endangered Democratic incumbents — Arizona Sen. Mark Kelly, Georgia Sen. Raphael Warnock, Nevada Sen. Catherine Cortez Masto and New Hampshire Sen. Maggie Hassan — are increasingly taking steps to highlight their independence from the president and underscore their differences.",
    "“In these four states, these are senators just doing the work, keeping their head down, getting things done for their states while the Republicans are obviously tearing each other apart in these primaries,” said Martha McKenna, a Democratic ad maker who previously worked for the Democratic Senatorial Campaign Committee.",
    "Elsewhere, Republicans are playing defense in the swing states of Pennsylvania, Wisconsin and North Carolina, though the latter — as evidenced by Democrats’ Senate Majority PAC failure so far to book TV time in the state this fall — is believed to be a safer bet for Republicans.",
    "The event stood in stark contrast to Hassan’s recent visit to Texas and Arizona, where she filmed a video in front of the border wall, calling on the Biden administration to provide more resources to the Border Patrol and to improve “physical barriers” along the border.",
    "Democratic operatives involved in the four Senate races say internal polling shows their candidates are faring just fine — and are taking the right approach by distancing themselves from some Biden policies, even if it’s at the expense of alienating some progressives.",
    "“As you watch Republicans talk about education, when we used to run away from it, and Republicans run massive outreach campaigns to minorities when we’ve done a pretty pathetic job of it the last few cycles — those are going to be game-changers for us,” he said.",
    "Trump, who continues to try to shape the Arizona field, on Monday released a statement disparaging another top Arizona Senate candidate, state Attorney General Mark Brnovich, for not doing enough to overturn the results of the 2020 presidential election.",
    "Hassan has already reserved $14.8 million in television advertisements, getting ahead of what will become a competitive media market in Boston as Massachusetts has races on the ballot this fall for governor, attorney general and a rideshare referendum.",
    "They’re hard working senators willing to say, ‘Yes, I agree with Biden on child tax credits or health care, but look, I’ve got an issue on this issue, or that issue.’”\nLess than two years ago, Biden carried Arizona, Georgia, Nevada and New Hampshire.",
    "“It’s not that I think she’s in trouble or Republicans think she’s in trouble, she knows she’s in trouble.”\nHassan and the other battleground Democratic incumbents have significant fundraising advantages over their Republican challengers.",
    "But, when presented with the opportunity Tuesday, Hassan chose to welcome him, appearing with the president on Tuesday in Portsmouth, where he touted passage of the bipartisan infrastructure bill — and her role in passing it.",
    "On social media, where they shy away from praise of the president and instead focus on their efforts to prod the White House to action, it’s hard to tell they’ve voted in line with Biden no less than 96 percent of the time.",
    "Both the Democrats’ Senate Majority PAC and Republicans’ Senate Leadership Fund have so far declined to reserve ads in the New Hampshire race, despite doing so in recent weeks in other competitive states.",
    "Warnock and Kelly have $25.6 million and $23.3 million in cash on hand, respectively, while Cortez Masto and Hassan have amassed $11 million and $7.6 million, as of the end of the first quarter of 2022.",
    "In Nevada, when the Democratic super PAC American Bridge launched an ad Tuesday praising Biden’s accomplishments, there was no mention of Cortez Masto, the Democratic senator atop the ticket this year.",
    "Biden’s drag on swing-state incumbents is emerging as a pivotal factor in the midterm Senate elections, where the loss of just one Democratic-held seat in November could put Republicans in control.",
    "Their public pushback against Biden’s plan to lift the Trump-era border restriction known as Title 42 is the most visible expression of the effort to get distance from the president.",
    "Chris Sununu to run against Hassan in New Hampshire, leaving a growing field of little-known Republican candidates — none of whom have demonstrated impressive fundraising abilities.",
    "It shows the serious issues that she has with voters,” said Dave Carney, a Republican strategist in New Hampshire, who is working for Republican Chuck Morse’s Senate campaign.",
    "Doug Ducey — whom former President Donald Trump repeatedly ridiculed and cautioned not to enter the Senate race — also spurned recruitment efforts to challenge Kelly.",
    "“Her going to the Texas border, standing in front of Donald Trump’s wall and calling for more border infrastructure is a lot more than just concern for Title 42.",
    "A month before a Trump-appointed judge struck down Biden’s mask mandate on mass transit, three of the four voted in favor of a Republican bill to do just that.",
    "Polling earlier this year showed Ducey and Brnovich performing better in a general election against Kelly than GOP candidates Jim Lamon and Blake Masters.",
    "Afterward, Hassan tweeted that she would continue to work with Biden and her “colleagues on both sides of the aisle” to deliver results for constituents.",
    "Republicans remain confident that Biden will prove too much of a drag for vulnerable Democratic incumbents — or challengers — to overcome.",
    "Numbers like that explain why the four senators haven’t mentioned Biden or touted the Democratic brand in their ads this year.",
    "Both Warnock and Kelly have declined to answer questions about whether they would welcome Biden campaigning with them.",
    "In Nevada, a Suffolk University poll released last week put the president’s approval rating at an anemic 35 percent.",
    "Democrats’ path to saving their narrow Senate majority comes down to defending four states this fall.",
    "Nor have the liberal outside groups buying television spots on their behalf tied them to Biden.",
    "They are expected to duke it out for months to come ahead of the Sept. 13 primary.",
    "“They are not people who go looking for conflict, they’re not grandstanders.",
    "But the four Democrats are also finding other ways of signaling to voters.",
    "Today, however, his approval rating is dangerously low in each of them.",
    "And in all of them, President Joe Biden is underwater in the polls.",
    "They’ve visited the border wall and blocked his nominees.",
    "National Republicans failed to convince popular GOP Gov.",
    "In Arizona, GOP Gov."
  ]
}