{
  "id": 529,
  "mediaId": 2830,
  "date": "2022-02-22",
  "headline": "Containing Russia, Old School",
  "image": "",
  "link": "https://www.wsj.com/articles/containing-putin-old-school-ukraine-russia-invasion-tanks-biden-response-sanctions-syria-wagner-group-11645565313",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Holman W. Jenkins",
  "authorUrl": "https://www.wsj.com/news/author/holman-w-jenkinsjr",
  "termIds": [
    0
  ],
  "sentences": [
    "Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nIts intelligence made a laughingstock out of the opera of grievance Mr. Putin has been putting on, starting with his 5,000-word essay on the “historic unity” of the Russian and Ukrainian people.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nRussian Tanks Roll into Ukraine\nValidimir Putin sends his military forces over the border into Eastern Ukraine, after delivering a bellicose speech denying Ukraine's legitimacy and claiming that NATO might use it as a springboard to attack Russia.",
    "Outsiders have seen a Russian government that doesn’t mind murdering international air travelers, that murders journalists and opposition figures at home, that murdered hundreds of ordinary Russians in their beds in the never-mentioned, never-forgotten atrocity that inaugurated the Putin era.",
    "And if the unlikely summit with Joe Biden should come to pass, it shouldn’t be for the purpose of delivering any concessions, only to point out to Mr. Putin that the world knows the Ukrainian people have no desire to be part of Russia, that his claim that Kyiv threatens Moscow is ridiculous.",
    "It actually showed that, to a large part of the U.S. political class, Russia had become a joke, a country famous for its lurid corruption and fit only to be exploited by elites like Hillary Clinton in their own small-minded power games.",
    "That was the day U.S. ground and air forces in Syria destroyed an armored Russian mercenary column, killing an estimated 90 Russian citizens and 100 recruits of other nationalities, at a cost of zero injuries to U.S. service personnel.",
    "A delicate observation also needs to be made: He saved his Ukraine depredations for the Obama and then the Biden administrations, though his expectations of Mr. Biden so far seem to have been disappointed.",
    "Photo: /Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (5 minutes)\nAD\nLoading advertisement...\n00:00 / 04:55\n1x\nThis article is in your queue.",
    "Mr. Putin’s hysterical rhetoric about imaginary genocide is best understood in the light of the growing difficulty he will face in selling his self-defeating agenda to the Russian people.",
    "With its flow of “intelligence” emphasizing Mr. Putin’s military buildup and warning of an imminent attack, the U.S. seemed to imply easy access to internal Russian communications.",
    "You might wonder here whether the U.S. was waging information warfare or disinformation warfare, but it skillfully has played on a record the world long ago internalized.",
    "With pretenses now having fallen away, the U.S. and its allies shouldn’t be bashful about targeting out-of-theater opportunities to increase pressure on the Kremlin.",
    "It told a more realistic story—of false-flag operations, phony provocations and lists of Ukrainian citizens to be hunted down and liquidated after an invasion.",
    "His latest move recognizing the blasted, sterile “separatist” enclaves he created in eastern Ukraine only surrenders the last vestige of Russian deniability.",
    "Historians will naturally wonder what connection to draw between today’s events and the collusion folly that consumed U.S. politics for three years.",
    "And it was.” It was the bloodiest encounter between U.S. and Russian forces since Woodrow Wilson’s intervention in the Russian civil war in 1918.",
    "WSJ Opinion: How to Make Russia, China and Iran Take the U.S. SeriouslyPlay video: WSJ Opinion: How to Make Russia, China and Iran Take the U.S.",
    "When the effort failed, Defense Secretary Jim Mattis later told Congress, he gave the order that the advancing group “was to be annihilated.",
    "Mr. Putin’s misreading was vast to think NATO countries would somehow reconcile themselves to naked military aggression against Ukraine.",
    "Actually it was piling up costs for his regime regardless of whether he decided to slink away or proceed with a self-defeating invasion.",
    "Read More Business World\nThe U.S. and its allies can’t stop a Putin from doing what he believes necessary for his own survival.",
    "Not even the Chinese, when push comes to shove, want the ignominy of siding with such a government in an unprovoked war.",
    "Seriously\n Main Street: Critics warn that talk of military action will kill any hope of a diplomatic solution with Iran.",
    "Images: AFP/Getty Images Composite: Mark Kelly\nCopyright ©2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "A Russian bomber flies over the Mediterranean after taking off from the Hemeimeem air base in Syria, Feb. 19.",
    "Can the U.S. and its allies hang together on a sanctions regime strong enough to deter further invasion?",
    "If Mr. Putin had rightly understood what was going on, his calculations might well have been different.",
    "Russia’s Wagner Group mercenaries have been a nuisance to French antiterrorist efforts in the Sahara.",
    "He was testing a system of government and politics and global engagement that’s bigger than one man.",
    "Open Queue\nWhile it took 20 years, the West has got Vladimir Putin’s number and is locked in now.",
    "Mr. Putin may have thought it showed America’s elite weak and feckless and dancing to his tune.",
    "0:00 / 4:14\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "Using established “deconfliction” procedures, the Pentagon tried to warn the column off.",
    "They don’t want to live under the thieving, murdering regime Russians live under.",
    "The U.S. Navy knows how to make life uncomfortable for Russian sub commanders.",
    "Let Mr. Putin know he can’t count on any ceiling to the Western response.",
    "Russian deployments in northern Syria are a thorn to Turkey’s president.",
    "Seriously\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "His biggest misreading may have been of the events of Feb. 7, 2018.",
    "Mr. Putin may have thought he was testing the Trump administration.",
    "Any inhabitants who were productive and educated long ago fled.",
    "WSJ Opinion: How to Make Russia, China and Iran Take the U.S.",
    "Let Mr. Putin know that, to the world, he is now Hitler.",
    "The U.S. even seemed to be baiting the Russian leader.",
    "Ukrainians want a peaceful neighbor to trade with.",
    "They can only show him how badly he miscalculates.",
    "Your browser does not support HTML5 video.",
    "But the opposite is closer to the truth.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "The punches will never stop coming.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "This was another misreading.",
    "He erred."
  ]
}