{
  "id": 5483,
  "mediaId": 2650,
  "date": "2022-04-11",
  "headline": "The Morning Briefing: Do Republicans Have a Legit Shot at the Senate in November?",
  "image": "https://media.townhall.com/townhall/reu/o/2018/279/283adc90-ea86-44e8-9b1c-7fa8cec2b18d-1110x740.jpg",
  "link": "https://pjmedia.com/columns/stephen-kruiser/2022/04/11/the-morning-briefing-do-republicans-have-a-legit-shot-at-the-senate-in-november-n1588669",
  "mediaOutlet": "Pajamas Media ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Kruiser",
  "authorUrl": "https://pjmedia.com/columnist/stephen-kruiser",
  "termIds": [
    2081,
    2137,
    2072,
    2459,
    2593,
    3026,
    3401,
    1126,
    1489,
    6175
  ],
  "sentences": [
    "Florida Man Friday: Now That’s What I Call Getting Tased\nAround the Interwebz\nSam Elliott Apologizes For ‘Power Of The Dog’ Comments: “I Said Some Things That Hurt People And I Feel Terrible About That”\nSmells Like Onion\nCross Section Of Tree Suggests It May Have Gone Through Psychedelic Period During ’60s https://t.co/2re048b7pH pic.twitter.com/oja0ALP1eK\n— The Onion (@TheOnion) April 10, 2022\nThe Kruiser Kabana\nKabana Gallery\nStill Life with Roses and Knapweeds, 1880 #makovsky #konstantinmakovsky pic.twitter.com/xmb1nNiG2j\n— Konstantin Makovsky (@artist_makovsky) April 10, 2022\nKabana Tunes",
    "Rep. Eric Swalwell smears Richard Grenell claiming he hung out with Nazis and HOOBOY was that ever dumb\nVIP\n‘Unwoke’ With Kevin and Kruiser #36: Harmonic Cocktail Convergence and Maybe Some Obama Bashing\nVodkaPundit, Part Deux.",
    "Call Groomers ‘Groomers’ Because of Their Grooming and Because It Annoys David French\nChris Christie Has a Theory About Liz Cheney\nJanuary 6th defendant gets gun rights back\nSomeone should tell the MSM.",
    "Since he hasn’t distinguished himself in any way in the Senate yet, there isn’t much that his eventual opponent (probably Attorney General Mark Brnovich) can pin on him.",
    "Kelly isn’t polling well against “Generic Republican” at the moment but he’s going to have a massive fundraising advantage over anyone the GOP throws at him here.",
    "The real problem here is that Arizona Governor Doug Ducey is the candidate who would almost be a slam-dunk to beat Kelly but he’s not running.",
    "Their vulnerabilities in the House are probably impossible to overcome, even if the Republicans find a way to step all over themselves.",
    "At present, Herschel Walker does have a slight lead over Raphael Warnock, who never should have been elected in the first place.",
    "That was very nice of Freddie.” pic.twitter.com/QRBdIOzugq\n— Dodgers Nation (@DodgersNation) April 9, 2022\nPJ Media\nVodkaPundit.",
    "Dreaming about that is easier on the liver than the amount of vodka it takes to forget that Biden is in the Oval Office.",
    "Everything Isn’t Awful\nColorado's José Iglesias was in tears at first base following his first hit of the season.",
    "Rick wrote a story over the weekend about the mood of the electorate and it’s not looking good for the Democrats.",
    "At the rate the Democrats are going, they might not have any voters away from the coastal progressive bubbles.",
    "All the scenarios that have the GOP taking a majority in the Senate involve winning in Georgia and Arizona.",
    "There’s also the fact that thinking about November is more fun than thinking about this mess we’re in now.",
    "I’ve also written that there’s almost no way even they can blow the opportunity to take back the House.",
    "Jussie Smollett Hits New Low, Releases Painful Rap Song About His Innocence\nThey’re not going to.",
    "I’ve written on a couple of occasions that Republicans shouldn’t get cocky about the midterms.",
    "Mark Kelly has been flying under the radar as he finishes out the late John McCain’s term.",
    "For a variety of reasons, it’s difficult not to think about November’s midterm elections.",
    "When Freddie Freeman asked what was wrong, Iglesias told him he’d just lost his father.",
    "Former Ohio State Quarterback Dwayne Haskins Dies at 24\nTownhall Mothership\nSchlichter.",
    "Political predictions are a bit addictive when you’ve been doing them for a while.",
    "Hunter Biden’s kickbacks to “the Big Guy” are still turning up\nWho abandoned who?",
    "If I had to place a wager on this race right now, my money would be on Kelly.",
    "Most of his ads the last time he ran were of the “I’m an astronaut!” variety.",
    "Old clip of Hillary Clinton pushing her version of the ‘Big Lie’ goes viral.",
    "A lot of my conservative friends think that winning it back is looking good.",
    "After 2016, I don’t like to prognosticate much but it’s difficult to avoid.",
    "Top O’ the Briefing\nHappy Monday, dear Kruiser Morning Briefing friends.",
    "He hasn’t distinguished himself but he hasn’t really made many enemies.",
    "Palm Sunday reflection\nMajor move: Finland and Sweden to join NATO?",
    "Keeping it real involves a lot more sardines than you might think.",
    "“It was a beautiful moment, beyond baseball, we’re human beings.",
    "Because I write about politics, I get asked about it a lot.",
    "I’m covering my bases more than I am predicting anything.",
    "Then again, we have a lot of time until the election.",
    "What Will GOP Senators Do If They Win a Majority?",
    "Kelly gets a lot of donations from out of state.",
    "The House does look good for Republicans.",
    "I think they’re irrationally exuberant.",
    "YO villagers … we found your idiot!",
    "The Senate is a different story.",
    "Should Twitter ban her account?",
    "My home state is another story.",
    "Georgia is definitely in play.",
    "There, back to my happy place.",
    "What’s Going on in Shanghai?",
    "It’s tough to beat that.",
    "He wrote it at Subway.",
    "Sad, sad story.",
    "#RIP."
  ]
}