{
  "id": 563,
  "mediaId": 2658,
  "date": "2022-02-24",
  "headline": "Nord Stream 2 lobbyists flee",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/02/24/nord-stream-2-lobbyists-flee-00011536_1",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "New Joint Fundraisers\nAmerica Strong (Reps. Stephanie Bice, Jerry Carl, Patrick Fallon, Scott Franklin, Mark Green, Ronny Jackson, Lisa McClain and Blake Moore, and Mark Johnson, American Security PAC)\nNew PACs\nIowa First (Super PAC)\nNEW YORK FIRST (Super PAC)\nPatriots Against Tyranny (PAC)\nVoice of Immigrants PAC (Hybrid PAC)\nNew Lobbying Registrations\nC6 Strategies, LLC (Fka Ms. Dana W. Hudson): Crowdpulse LLC\nC6 Strategies, LLC (Fka Ms. Dana W. Hudson): Reveal Technology, Inc.\nC6 Strategies, LLC (Fka Ms. Dana W. Hudson): The Whiskey Project Group Ltd\nHartwell Capitol Consulting: Emp Shield\nJim Massie & Partners, LLC: American Exploration & Production Council\nJim Massie & Partners, LLC: Jera Americas, Inc.\nMiller & Chevalier Chartered: Netflix, Inc.\nMr. Kenneth Brown: City/County Association Of Governments Of San Mateo County\nO'Neill And Associates: Wellesley College\nStarzyk & Associates, LLC: Southern Ute Tribe Of Colorado\nStrategies 360: Hale Makua Health Services\nSummit Strategies Government Affairs LLC: Oregon Association Of Relief Nurseries\nT Cap Solutions, LLC: Chainalysis Inc.\nTwenty-First Century Group, Inc.: Global Alzheimers Platform Innovations Pbc\nNew Lobbying Terminations\nCdb Projx LLC: Mcallister & Quinn On Behalf Of Clemson University\nCroke Fairchild Morgan & Beres LLC: National Rural Electric Cooperative Association\nDonna M. Fiorentino, LLC: Capitol Counsel LLC On Behalf Of Amgen, Inc.\nMclarty Inbound LLC: Engie\nMclarty Inbound LLC: Omv Aktiengesellschaft\nMclarty Inbound LLC: Shell International B.V\nMclarty Inbound LLC: Uniper Se\nMclarty Inbound LLC: Wintershall Dea Gmbh (Formerly Wintershall Holding Gmbh)\nTwenty-First Century Group, Inc.: Global Alzheimer'S Platform Foundation\nFollow Us",
    "For the full year, the council increased its spending by 19 percent to $16.57 million, compared with $13.92 million in 2020,” an increase that spokesperson Jennifer Scott attributed to “the reimposition of Superfund Taxes on chemical manufacturers and a proposed tax on plastics.”\n— “‘Both proposals represent bad policy that penalize the very industry and creation of products that will make many of the Administration’s climate goals possible, while taking money out of the hands of consumers,’ Scott wrote.” The bipartisan infrastructure bill signed last year “reinstated taxes on chemicals to pay for the cleanup of toxic waste sites nationwide through the Superfund program.",
    "… At a minimum, FERC should require utilities to substantiate their requests for recovery of industry association dues with breakdowns of the trade groups' activities and clear connections showing how they benefit ratepayers, agencies from nine states said in joint comments.”\nCHEMICAL LOBBY SPENT BIG TO WARD OFF SUPERFUND TAXES: “A major lobbying arm for the chemical industry boosted its spending by nearly 92 percent at the end of last year, compared with the same period in 2020, as Congress considered and passed legislation raising taxes on 42 chemicals,” Roll Call’s Benjamin J. Hulac reports.",
    "Trade groups like the Edison Electric Institute (EEI), which represents investor-owned utilities, the American Gas Association (AGA) and Interstate Natural Gas Association of America said FERC's existing accounting rules provide enough transparency to prevent ratepayers from being charged for non-recoverable expenses like lobbying.”\n— “In response to a petition from the Center for Biological Diversity, FERC in December issued a \"notice of inquiry\" (NOI) to see if it should revise its accounting rules related to utility payments of trade association dues.",
    "Legislation from Sen. Sheldon Whitehouse, D-R.I., and Rep. Tom Suozzi, D-N.Y., would impose that tax, although neither has gotten a vote in committee.”\nJobs Report\n— Aspen Strategy Group, part of the Aspen Institute, has named 32 members for its Rising Leaders Program class of 2022, among them R Street's Mary Brooks, McLarty Associates' Alma Caballero, Carnegie Endowment for International Peace's Arthur Nelson, Asia Group's Anand Raghuraman, Paulson Institute's Andy Morimoto and PI's very own Daniel Lippman.",
    "The firm reported that two employees lobbied Congress on behalf of those companies’ “interests in the debate over natural gas as an element of European energy security.”\n— The Nord Stream sanctions reversed what appeared to be a lobbying coup for the pipeline’s representatives in Washington last year, when Biden moved to waive sanctions on its parent company and CEO in the name of U.S. national interests and the Senate failed to pass a bill reinstating those sanctions last month.",
    "WHAT K STREET IS WATCHING AS CHINA BILLS GO TO CONFERENCE: As lawmakers from the House and Senate prepare to head to conference to hash out the differences in a sprawling package meant to increase U.S. competitiveness with China, there are at least a dozen major issues that could gum up negotiations when they eventually start, Greenberg Traurig’s Robert Mangas wrote in a memo for clients on Wednesday.",
    "Nord Stream 2 lobbyists flee\nBy CAITLIN OPRYSKO\n02/24/2022 05:15 PM EST\nWith Daniel Lippman\nK STREET DITCHES NORD STREAM 2: Lobbyists representing the parent company behind the Nord Stream 2 pipeline and its financial partners have moved swiftly to sever ties with foreign stakeholders in the now-paused natural gas pipeline running from Russia to Europe, after Russia launched its invasion into Ukraine.",
    "STATES ASK FERC TO CRACK DOWN ON UTILITY LOBBYING MONEY: “Utility regulators, attorneys general and ratepayer advocates from 14 states on Tuesday urged the Federal Energy Regulatory Commission to tighten its accounting requirements so consumers aren't charged for expenses related to political and lobbying contributions,” Utility Dive’s Ethan Howland reports.",
    "The chemical industry opposed the taxes when lawmakers debated the bill and opposes them today, as Republicans are trying to exempt from the new taxes some or all of the chemicals that the infrastructure law covers.”\n— “Beyond the Superfund taxes, the council said it lobbied against a 20-cent-per-ton tax on virgin plastic resin.",
    "— Both Roberti Global and BGR Government Affairs have terminated their respective firms’ contracts with the pipeline developer Nord Stream 2 AG, our Hailey Fuchs reports, potentially passing on millions more dollars in lobbying fees, based on previously reported public earnings from the lucrative contracts.",
    "Jahries was most recently communications manager at the National Council for Mental Wellbeing, Modi was most recently marketing and communications assistant at the Global Resilience Institute and McCleary was most recently associate public relations manager at The ONE, Nutrition Just for You.",
    "— Other issues that could pose problems, per Mangas, are provisions in the House bill prioritizing climate change and a de minimis rule in the House version that would apply to imported goods from China and has drawn protests from business groups.",
    "Some provisions from the Senate version that could prove tricky to resolve are new sanctions authority relating to cybersecurity and trade secrets and instructions to create a new exclusion process for goods impacted by Section 301 tariffs.",
    "— Both terminations came after Biden unveiled an initial tranche of sanctions on Russian individuals and business interests designed to deter the Kremlin from carrying out the kind of military invasion currently taking place in Ukraine.",
    "One is restrictions in the House version on an infusion of funding for the semiconductor industry to “prevent CHIPS funding from being used on stock buybacks or dividend payments” and require data on applicants’ workforce diversity.",
    "— “In the last quarter of 2021, the American Chemistry Council, or ACC, spent $7.32 million lobbying Congress and federal agencies, up from $3.81 million in the fourth quarter of 2020, records show.",
    "— Meanwhile McLarty Inbound, an arm of McLarty Associates, filed termination notices Wednesday for each of the pipeline’s five financial investors: Wintershall Dea, Uniper, Shell, OMV and ENGIE.",
    "— Mangas notes for starters that the House’s version is more than 1,200 pages longer than the Senate bill, and was crafted by 12 different House committees, compared to eight Senate committees.",
    "— “The Ohio Public Utilities Commission, for example, told FERC it supports efforts to ‘clearly delineate’ the recoverability of utility spending on political, civic and charitable activities.",
    "— When all is said and done, the legislation “may turn out to be the most far-reaching legislation of 2022,” Mangas, a former chief of staff to then-Senate Majority Whip Wendell Ford, argued.",
    "But first it must survive a showdown to reconcile the differences between the House’s version, which passed mostly on party lines, and the Senate’s version, which received bipartisan support.",
    "Nord Stream 2 AG, which was in the process of constructing a natural gas pipeline to Germany that bypassed Ukraine, was included in the group of those sanctioned, as was its chief executive.",
    "— E.SK Strategies and People First are merging to form Village Square, a comms consultancy integrating paid political advertising with large-scale influencer campaigns.",
    "— “We are terminating our engagement on the Nord Stream 2 gas pipeline project in compliance with U.S. sanctions,” a spokesperson for Roberti Global told Hailey.",
    "BGR, which only registered to lobby for Nord Stream 2 AG in 2020, has received nearly $1.6 million from the pipeline developer in that time, disclosures show.",
    "Vin Roberti, a Democrat who was an unofficial adviser to President Joe Biden’s 2008 presidential campaign, is the sole lobbyist still on the account.",
    "Jeff Birnbaum, president of BGR Public Relations, also cited the U.S. sanctions in a statement confirming that BGR would part ways with its client.",
    "— Roberti Global has reported earning more than $9 million in lobbying revenues from Nord Stream 2 AG since 2017, according to disclosure filings.",
    "Though Nord Stream 2 AG is a Swiss company, the Russian-state controlled Gazprom owns 100 percent equity interest, Roberti said in filings.",
    "— Kivvit has promoted Mackenzie Shutler to associate director, Megan O’Leary to associate director and Colleen Frerichs to principal.",
    "Walker Roberts, a Reagan White House staffer and former Republican Hill aide, is the only lobbyist listed on the account for BGR.",
    "— Alan Yu is joining the Center for American Progress as senior vice president for national security and international policy.",
    "She previously was comms director for Rep. Teresa Leger Fernandez (D-N.M.), and is a Mark Kelly and Kirsten Gillibrand alum.",
    "He most recently was a senior adviser to White House climate envoy John Kerry, and is a State Department and DOE alum.",
    "?Kate Jahries is joining Glen Echo Group as a director and Isha Modi and Tricia McCleary are joining as associates.",
    "Richardson was previously a Democratic counsel for the House Ways and Means Committee’s health subcommittee.",
    "— Howard Alan Zucker has joined APCO Worldwide’s International Advisory Council as a senior counselor.",
    "— Tracey (Wehrfritz) Santilli has been promoted to president of the marketing and ad firm Tierney.",
    "— Alexandra McPhee is now director of government relations at Concerned Women for America.",
    "He identified 16 issues to watch as potential sticking points in the conference committee.",
    "He was most recently director of government relations and public affairs at Equinor.",
    "— Seth Levey has joined thredUP as head of public policy and sustainability.",
    "— Orriel Richardson is joining Morgan Health, JPMorgan’s health care arm.",
    "Is your firm or client making adjustments amid the crisis in Ukraine?",
    "She previously was legislative counsel for Sen. Roy Blunt (R-Mo.).",
    "— Maria Hurtado is now a vice president at Declaration Media.",
    "He was previously New York State’s health commissioner.",
    "She most recently was the firm's chief growth officer.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "— Amos Snead has been named president of Adfero.",
    "He currently is an executive vice president.",
    "Let me know: coprysko@politico.com.",
    "Good afternoon and welcome to PI.",
    "— ?"
  ]
}