{
  "id": 570,
  "mediaId": 8347,
  "date": "2022-02-23",
  "headline": "Sen. Kelly favors support for Ukraine but no U.S. troops there",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/14adf85/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fx-default-stgec.uplynk.com%2Fausw%2Fslices%2F829%2Ff0fe4276ab8344079f404f1ac9c377b7%2F82935b4b186444c49f2987c371259016%2Fposter_5ec81b44ec594d8485ed64aa58ef15f7.jpg",
  "link": "https://www.kgun9.com/news/local-news/sen-kelly-favors-support-for-ukraine-but-no-u-s-troops-there",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Craig Smith",
  "authorUrl": "https://www.kgun9.com/craig-smith",
  "termIds": [
    0
  ],
  "sentences": [
    "It's clearly an invasion, and it's his first step to trying to impose his will on a democratic nation right next door, and we can't accept that.”\nKelly expects the U.S. and its European allies to ramp up international penalties against Putin like restricting Russian banks that let Russia's economy draw strength from the world’s financial system.",
    "Kelly says the world understands how flimsy Putin’s pretense has been to move troops into two areas Russian sympathizers already control, declare those areas independent countries then send in Russian troops with the claim they’ll be peacekeepers.",
    "And we're also going to support our NATO partners by sending some forces into NATO countries, but not into Ukraine itself.”\nKelly worries a war in Ukraine could lead to a hundred thousand deaths and maybe a million refugees.",
    "The Senator says programs like that are critical to help ease worker shortages in construction trades but questions quickly turned to the building crisis in Ukraine.",
    "But Kelly says no treaty requires the U.S. to send troops to defend Ukraine in person as the U.S. is required to defend nearby countries that are part of NATO.",
    "Senator Kelly visited students at Sahuarita High School, to see the school’s program to train students for building careers.",
    "SAHUARITA, Ariz. (KGUN) — Arizona Senator Mark Kelly favors international sanctions against Putin and Russia.",
    "He says Putin must change his path or understand international pressure against him will get much worse.",
    "The Senator thinks the U.S. and its' allies will end up applying more pressure than they have so far.",
    "Instead the U.S. is helping Ukraine with intelligence information and sending weapons.",
    "Some of our allies, NATO allies, are sending Stinger surface to air missiles.",
    "It's important that we're providing military aid to Ukraine.",
    "----\nSTAY IN TOUCH WITH US ANYTIME, ANYWHERE",
    "“Including things like Javelin missiles.",
    "Kelly says, “It's not peacekeeping."
  ]
}