{
  "id": 5821,
  "mediaId": 2550,
  "date": "2022-04-14",
  "headline": "Morning Digest: The ugliest GOP primary might just be in Alabama's race for governor",
  "image": "https://images.dailykos.com/images/1058820/story_image/AP21031054127195.jpg?1649889485",
  "link": "https://www.dailykos.com/stories/2022/4/14/2091803/-Morning-Digest-The-ugliest-GOP-primary-might-just-be-in-Alabama-s-race-for-governor?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2153,
    1893,
    3388,
    3418,
    3214,
    4255,
    5917,
    1126,
    5928
  ],
  "sentences": [
    "1Q Fundraising\nMN-Gov: Tim Walz (D-inc): $1 million raised, $4.1 million cash-on-hand\nAZ-04: Greg Stanton (D-inc): $980,000 raised, $2.4 million cash-on-hand\nCA-03: Kevin Kiley (R): $1.1 million raised, $814,000 cash-on-hand\nCO-07: Tim Reichert (R): $339,000 raised, additional $500,000 self-funded, $712,000 cash-on-hand\nIN-09: Erin Houchin (R): $375,000 raised\nMI-07: Elissa Slotkin (D-inc): $1.3 million raised, $5.5 million cash-on-hand; Tom Barrett (R): $458,000 raised\nNH-01: Chris Pappas (D-inc): $500,000 raised, $2 million cash-on-hand\nNV-04: Steven Horsford (D-inc): $500,000 raised, $1.94 million cash-on-hand\nNY-16: Vedat Gashi (D): $470,000 raised (in one month)\nSenate\n?",
    "NE-Gov: The Nebraska Examiner has collected fundraising numbers from the first quarter for all the GOP candidates competing in the May 10 primary:\nUniversity of Nebraska Regent Jim Pillen: $2.4 million raised, $2.9 million cash-on-hand\nState Sen. Brett Lindstrom: $420,000 raised, $580,000 cash-on-hand\nFormer State Sen. Theresa Thibodeau: $159,000 raised, additional $10,000 self-funded, $62,000\nAgribusinessman Charles Herbster: $113,000 raised, additional $4.2 million self-funded, $543,000 cash-on-hand\nState Sen. Carol Blood, who has no serious opposition for the Democratic nod, took in $50,000 during this time and had $36,000 on hand.",
    "Co-hosts David Nir and David Beard also dig into a hard-to-explain decision by a major Democratic super PAC to take sides in an Oregon House primary; what the 2022 version of a well-established prediction model says about the midterms; New York's truly screwed-up system for electing and replacing lieutenant governors, and the results of the first round of France's presidential election.",
    "NM-Gov: Fundraising reports are in covering the period spanning Oct. 5 to April 4, and they give us our first look at the financial strength for the entire GOP primary field:\n2020 Senate nominee Mark Ronchetti: $2.1 million raised, $1.56 million cash-on-hand\nState Rep. Rebecca Dow: $711,000 raised, additional $40,000 self-funded, $684,000 cash-on-hand\nRetired Army National Guard Brig.",
    "Gen. Greg Zanetti: $169,000 raised, $172,000 cash-on-hand\nSandoval County Commissioner Jay Block: $119,000 raised, $20,000 cash-on-hand\nAnti-abortion activist Ethel Maharg: $13,000 raised, $800 cash-on-hand\nThe winner of the June nomination fight will take on Democratic incumbent Michelle Lujan Grisham, who raised $2.67 million and had $3.78 million on-hand.",
    "Rakich discusses how gerrymandering might have made for a more equal congressional playing field but not necessarily a fair one; what kind of redistricting commissions have actually worked best; and some of the key bellwether districts he'll be looking at to judge what sort of night Democrats can expect in November.",
    "One of the spots opens with King noting that it took his family \"three generations to travel 25 miles\" from the Maryland farm where his great-grandparents were enslaved to Silver Spring, where his daughter goes to public school, simultaneously highlighting King's deep roots in the state and links to education.",
    "Meanwhile, the ANCSA Regional Association, which the Anchorage Daily News' Nathaniel Herz says is made up of the leaders of the \"state's 12 regional Native corporations,\" has formed a super PAC called Alaskans for TARA to support another Republican, former state Interior Department official Tara Sweeney.",
    "PA-Gov: A day after Donald Trump unloaded on former U.S. Attorney Bill McSwain and told Republican primary voters not to vote for \"a coward, who let our Country down,\" McSwain's allies at the Commonwealth Leaders Fund say they are \"currently assessing what all this means for the primary election.\"",
    "A mid-March survey for the local media put the governor at 46%, which is just shy of the majority she needs to avoid a runoff, with James and Blanchard far back at 12% and 10%, respectively; Ivey's own internals from around that time, meanwhile, showed her taking about 60% of the vote.",
    "Kemp, though, maintains a massive financial edge heading into his May 24 Republican primary against Trump's candidate, former Sen. David Perdue: Isenstadt writes that the incumbent and his allies so far have spent $11.4 million on TV compared to just $2.7 million for Perdue's side.",
    "OR-05: Attorney Jamie McLeod-Skinner's opening ad for the May 17 Democratic primary begins with the candidate, who is shown working at a farm, asking what the difference is between her and moderate incumbent Kurt Schrader and answering, \"He takes millions in corporate PAC money.",
    "The group already spent roughly $6 million backing McSwain, who previously appeared to be a top contender in the crowded May 17 GOP primary until Trump issued his anti-endorsement of his one-time appointee over McSwain's supposedly insufficient zeal in promoting the Big Lie.",
    "The challenger's recent ad features him claiming that \"right here in Alabama, millions of your tax dollars are paying for the first transgender public school in the South\" as the on-screen text identifies the Magic City Acceptance Academy and features photos of its students.",
    "TX-28: An attorney for Democratic Rep. Henry Cuellar, in new comments provided exclusively to Fox News, says the congressman \"is not a target\" of a federal investigation that saw law enforcement officials raid Cuellar's home and campaign headquarters in January.",
    "Kay Ivey (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "The first one is a version of the generic spot that the Club has been running in other races, while the other opens with sirens blaring as the narrator informs the audience, \"Stand by for a Trump alert: Trump has endorsed Alex Mooney for Congress.\"",
    "Washington, D.C. Mayor: The Washington Teachers' Union is backing Councilmember Robert White's bid to deny renomination to Mayor Muriel Bowser in the June Democratic primary, a development that came days after AFSCME also endorsed White.",
    "The spot quotes Schmidt saying that Brownback \"delivered time and again\" for the state before reminding viewers that the former governor's draconian budget policies resulted in \"devastating cuts to our schools\" and \"dismal job growth.\"",
    "Kemp is also continuing to make use of his financial edge by running new ads where he praises himself for lifting Georgia's \"lockdown\" all the way back in April of 2020, a move even Trump said at the time was happening \"too soon.\"",
    "WV-02: The Club for Growth and its affiliate School Freedom Fund have announced a new $1.1 million TV, digital, and radio buy aiding Rep. Alex Mooney in his May 10 Republican primary fight against fellow incumbent David McKinley.",
    "AZ-Sen: Wealthy businessman Jim Lamon, who ran a commercial earlier this year that depicted him firing a gun at Democratic Sen. Mark Kelly, is now embracing Easter hope and optimism in his new ad for the August GOP primary.",
    "The institution, which describes itself as an \"LGBTQ-affirming learning environment,\" said it had to boost its own security measures after someone showed up and attempted to film pupils while quoting Bible verses at them.",
    "Beasley emphasizes her past career as a public defender, saying, \"I represented North Carolinians who couldn't afford a lawyer—because everyone has a right to representation, no matter who you are or where you're from.\"",
    "The other commercial relays how both of King's parents died when he was a child but his public school teachers helped him succeed and go on to become a teacher, principal, and education secretary under President Obama.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nNerding out on redistricting, with Nathaniel Rakich\nThe Downballot\nFollowShare\n0:0059:53\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n?",
    "NH-Sen: A newly hired consultant for Republican Vikram Mansharamani, who is an author and investor, confirms that his client is considering entering the September primary to take on Democratic Sen. Maggie Hassan.",
    "And former Ambassador to Slovenia Lindy Blanchard, who is the top spender in this race, made news earlier this month with a commercial of her own declaring, \"Lindy believes the election was stolen from Trump.",
    "AL-Gov: While Alabama's Republican Senate primary has attracted considerably more attention than any other race on the May 24 ballot, the expensive GOP contest for governor may beat it for sheer bigotry.",
    "CO-07: At least three Republicans will be on the June primary ballot to succeed retiring Democratic Rep. Ed Perlmutter following the results of the recent party convention, while two more are in limbo.",
    "Incumbent Kay Ivey's latest spot attempts to rally the party's xenophobic base, while a transphobic commercial from one of her challengers, businessman Tim James, forced a school to increase security.",
    "NY-04: Former Hempstead Supervisor Laura Gillen has publicized an Impact Research internal that gives her a 40-11 lead over Nassau County Legislator Carrié Solages in the June Democratic primary.",
    "OH-11: The crypto industry-aligned Protect Our Future PAC is spending at least $1 million to aid Rep. Shontel Brown in her May 3 Democratic primary rematch against former state Sen. Nina Turner.",
    "There won't be much to see, though, as Sen. John Hoeven faces only minor GOP primary opposition in this very red state while Rep. Kelly Armstrong, a fellow Republican, has no intra-party foe.",
    "This week on The Downballot, we nerd out with Nathaniel Rakich of FiveThirtyEight, whose path from hobbyist to full-time election analyst closely mirrors the Daily Kos Elections story.",
    "Whoever wins the GOP nod will go up against state Sen. Brittany Pettersen, who faces no Democratic primary opposition, for a suburban Denver seat that Biden would have carried 56-42.\n?",
    "Montgomery County, a jurisdiction in the D.C. suburbs where Perez also served on the County Council from 2002 to 2006, is the largest in the state at just over one million residents.",
    "What should scare mothers and fathers of these children is what the faculty is doing by presenting this ungodly display through the drag show to which the children were subjected.\"",
    "Laura Kelly's allies at the Kansas Values Institute have launched a new ad against state Attorney General Derek Schmidt that ties the likely Republican nominee to former GOP Gov.",
    "Lamon's spot, which is also available in Spanish, doesn't actually mention he's even running for any office, much less Senate, except at the very end as he approves his message.",
    "Ivey has been running a series of ads trying to cultivate the far-right vote by embracing the Big Lie and attacking \"[t]ransgender sports,\" but now she's hitting another topic.",
    "OH-Sen: Former GOP chair Jane Timken avoids going after any of her many intra-party rivals in her new spot for the May 3 primary and instead blames Joe Biden for inflation.",
    "Former oil and gas executive Erik Aadland took first place with 63% of the vote while Laurel Imer, who badly lost a 2020 race for state House, also advanced by taking 34%.",
    "AK-AL: Anne Garland Young, who is the widow of Rep. Don Young, has endorsed state Sen. Josh Revak in the special June top-four primary to succeed the longtime congressman.",
    "I'm running for Congress to tackle climate change,\" a statement that is accompanied by her shoveling manure into a wheelbarrow that contains a check from \"Big Oil & Gas.\"",
    "So far, polls have found that Ivey, who earned the NRA's endorsement this week, has largely been successful in outflanking both James and Blanchard on the far right.",
    "Meanwhile, former U.S. Education Secretary John King has launched his first ads in the Democratic primary, which the campaign says is backed by a six-figure buy.",
    "After faulting Schrader for having \"sold out to Big Pharma,\" the challenger shreds a huge check with her vehicle as she exclaims, \"Big Pharma can't buy my vote!\"",
    "MD-Gov: Montgomery County Executive Marc Elrich has endorsed former U.S. Labor Secretary Tom Perez ahead of the crowded July Democratic primary for governor.",
    "Both TV ads (here and here) make sure the audience knows that Mooney is Trump's man while McKinley supported the Biden administration's infrastructure bill.",
    "NBC reports that Blanchard, who has been self-funding her bid, has outspent Ivey $4.1 million to $3.2 million in ads, while James has deployed $2.2 million.",
    "Hoeven briefly faced a primary challenge from state Rep. Rick Becker, but Becker dropped out last month after he failed to win the state party endorsement.",
    "Finally, McLeod-Skinner tosses a folder labeled \"Congressional Stock Portfolio\" into a flaming barrel before feeding a \"Corporate PACs\" check to a goat.",
    "This time, the governor tells the audience, \"If Joe Biden keeps shipping illegal immigrants into our states, we're all going to have to learn Spanish.\"",
    "The narrator further quotes Brownback praising Schmidt as \"like minded\" and argues that electing the latter would \"take Kansas back to Brownback.\"",
    "However, we haven't seen more recent numbers, and the governor's opponents are hoping that their own heavy spending has helped them shift things.",
    "\"But we must never forget, even in our darkest days, Almighty God is in charge,\" says Lamon, continuing, \"With faith, he will show us the way.",
    "Construction company owner Carl Andersen and attorney Brad Dempsey, though, are still waiting to see if they turned in enough valid petitions.",
    "The head of the Hispanic Interest Coalition of Alabama blasted Ivey's message, though unsurprisingly, she hasn't backed off in the slightest.",
    "ND-Sen, ND-AL: Candidate filing closed Monday for North Dakota's June 14 primary, and the secretary of state has a list of contenders here.",
    "NC-Sen: Cheri Beasley is spending six figures on her first TV spot for the May 17 Democratic primary, where she faces little opposition.",
    "She continues, \"As a judge and chief justice of the North Carolina Supreme Court, I led with a commitment to justice and integrity.\"",
    "There's no corroboration of this claim, however, as Fox says the FBI and Department of Justice \"declined to comment\" on the matter.",
    "Brian Kemp, and Politico's Alex Isenstadt now reports that the organization received $500,000 from Trump's super PAC last month.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "You can listen to The Downballot on all major podcast platforms, and you'll find a transcript right here by noon Eastern Time.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "GA-Gov: Last week a group called Get Georgia Right began airing an ad that echoed Trump by using the Big Lie against Gov.",
    "But when asked about what happened, James blithely responded, \"The principal said that the TV ad scared the children.",
    "Neither has James, who is continuing to focus almost completely on anti-trans bigotry in his advertising campaign.",
    "WMUR says that Mansharamani \"is expected to make a decision about launching a campaign within the next two weeks.\"",
    "The principal blamed James' ad for the incident, as well as for \"a carload or two\" of people yelling at students.",
    "That endorsement happened in November, so clearly the Club's early warning system is badly in need of a refit.",
    "This is the first poll we've seen of the contest to replace retiring Rep. Kathleen Rice, who supports Gillen.",
    "Wealthy businessman Tim Reichert successfully collected enough signatures, so he was able to skip the event.",
    "She's none too happy with that (delusional) prospect, continuing, \"My message to Biden: no way, José.",
    "ANCSA's members, writes Herz, represent six of the state's eight largest companies by revenue.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "(Sweeney, who is Iñupiaq, would be the first Alaska Native to serve in Congress.)",
    "We don't have corporate backers that are only in it for the bottom line.",
    "That's why I sent national guard troops to protect the Southern border.\"",
    "Easter—when darkness and despair were transformed into life and hope.\"",
    "McLeod-Skinner continues, \"Oil and gas companies are bankrolling Kurt.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Sam Brownback, who left office deeply unpopular in 2018.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "(We explain Colorado's ballot access rules here.)",
    "Kay Ivey thinks Biden's victory was legitimate.\"",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "KS-Gov: Democratic Gov.",
    "I won't take a dime.\"",
    "Donate $5 monthly",
    "The Downballot\n?",
    "Please read it.",
    "Alabama Gov.",
    "Governors\n?",
    "Mayors\n?",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}