{
  "id": 6399,
  "mediaId": 2589,
  "date": "2022-04-11",
  "headline": "WaPo: Drowning Biden grabs onto gun control",
  "image": "https://media.townhall.com/townhall/reu/o/2022/39/184cd58b-19a5-4ade-b29e-0bc406f70a4d-1110x740.jpg",
  "link": "https://hotair.com/ed-morrissey/2022/04/11/wapo-drowning-biden-grabs-onto-gun-control-n461463",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Morrissey",
  "authorUrl": "https://hotair.com/author/ed-morrissey",
  "termIds": [
    0
  ],
  "sentences": [
    "At the very moment that Americans’ worry about crime has hit recent new highs, Joe Biden has decided that the best strategy will be to find more ways to burden law- abiding gun owners:\nToday, President Biden is wading back into the politically fraught politics of gun control, with plans to announce several actions in an event in the Rose Garden of the White House, including a continued crackdown on so-called “ghost guns” and the appointment of Steve Dettelbach, a former U.S. attorney in Ohio, to head the Bureau of Alcohol, Tobacco, Firearms and Explosives.",
    "Detttelbach has a track record of hard-progressive gun control positions, CBS notes, which is one reason why Dettelbach is available at the moment:\n“[Dettelbach] should be a noncontroversial candidate because he has a long record of working in law enforcement,” a senior administration official said.",
    "This is yet another pander to the progressive “defund the police” wing of the Democratic Party, and it will produce an even greater disconnect between a failing Biden and the electorate outside of the party’s academia and media-bubble bastions.",
    "During the campaign, he advocated for universal background checks for those who wish to purchase guns, reinstating the assault weapons ban, and restricting guns for people with serious mental health problems, according to WOSU.",
    "Biden’s unilateral actions on gun control underscore how little that Congress — now in a two-week recess — has been able to do on the issue, even in the aftermath of repeated mass shootings across the country.",
    "Neither Biden nor Dettelbach will address the real issues of resurgent violent crime, which is the misguided efforts to scale back policing and return to the days of revolving-door prisons for violent felons.",
    "Biden’s 15-month progressive project to become the next FDR to the LBJ power has collapsed, and has alienated the centrist voters that put him in office in the first place.",
    "That would entail substantive efforts to address issues that voters are prioritizing at the moment — inflation, crime, overall economic growth, and immigration enforcement.",
    "Biden’s announcements also come amid a midterm election year in which Republicans are eager to brand his party as soft on crime and Democrats are seeking to push back.",
    "I’d bet it does more to stoke turnout on the other side, as it hands Republicans yet another great messaging opportunity to paint Biden as radical and autocratic.",
    "You’d better believe that Senate Republicans will be seizing and/or pouncing on those previous positions, and perhaps a couple of Senate Democrats as well.",
    "Tom is still relieved that it wasn’t worse:\nThe truth of the matter is that Dettlebach is about the best we can expect from the Biden administration.",
    "The Washington Post, in a demonstration of understatement, calls this strategy “politically fraught.” The rest of us would call it political suicide.",
    "There’s no reason to believe he wouldn’t use the opportunity as director of the ATF to restrict them unilaterally, even if only on a smaller scale.",
    "How about Mark Kelly, who has suddenly discovered his inner Kyrsten Sinema as his re-elect prospects get sucked downward by Biden’s sinking ship?",
    "Tom Knighton points out that Chipman also had a long record of working in law enforcement in the ATF itself, and it didn’t do him any good.",
    "Biden must be betting that gun control will spark enthusiasm among progressive voters, a problem that has become critical in the midterms.",
    "I’m not saying he should be confirmed, mind you, only that because he’s not David Chipman, he’s a damn sight better than what we’ve seen.",
    "The State of the Union speech was his best opportunity to seek a reset, but it’s still not too late to try to shift back to the center.",
    "At least the WaPo doesn’t have them pouncing or seizing, although in this case they might have some reason to do so.",
    "Angus King helped torpedo David Chipman the first time around when Biden’s polling numbers looked a lot better.",
    "Yet the problem is that being as anti-gun as he is, there’s no reason he should be confirmed.",
    "After all, he’s called for legislation to restrict our Second Amendment rights.",
    "As such, this is another nominee that should find himself unconfirmed.",
    "The White House will paint this as a crime measure, but that’s absurd.",
    "Why name someone like Dettelbach at all in this political environment?",
    "That’s a lot more than “fraught” for midterm Democratic candidates.",
    "I half expected him to try and nominate Shannon Watts to the seat.",
    "The bureau has been without a Senate-confirmed leader since 2015.",
    "In 2018, Dettelbach lost his race to be Ohio’s attorney general.",
    "Oh, those Republicans … always seeking to “push back”!",
    "And likely will, given the dynamics involved.",
    "Will Joe Manchin give Dettelbach a pass?"
  ]
}