{
  "id": 6401,
  "mediaId": 2676,
  "date": "2022-04-13",
  "headline": "Possible challenger surges, as Sinema promises big donors she’ll protect their tax breaks",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2021/10/kyrsten-sinema-1028211.jpg",
  "link": "https://www.salon.com/2022/04/13/likely-primary-challenger-surges-as-sinema-promises-corporate-donors-shell-protect-their-breaks/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    0
  ],
  "sentences": [
    "Fellow holdout Sen. Joe Manchin, D-W.Va., who blew up negotiations entirely in December, last month floated a revised $1 trillion proposal that would provide $500 billion in funding for climate programs and lowering the cost of prescription drugs, as long as other Democrats agree to use the other $500 billion to reduce the deficit and approve new oil-drilling permits.",
    "Sinema, who has received more than $900,000 in donations from the U.S. Chamber of Commerce and other industry groups opposing Biden's plan, attended an event held by the Arizona Chamber of Commerce and Industry in Phoenix to assuage donors' concerns that the renewed spending negotiations may threaten their low tax rates.",
    "\"In the wake of her recent vote to preserve the filibuster and kill voting rights legislation — and after months of her repeated obstruction of the president's Build Back Better agenda — it's clear that Sinema's continued obstruction has only served to lower her support,\" the pollsters' analysis warned.",
    "\"You all know, the entire country knows, that I'm opposed to raising the corporate minimum tax rate,\" she said, adding that she opposes \"any tax policies that would put a brake on any type of economic growth or forestall business and personal growth for America's industries.\"",
    "Sinema told another industry group this week that she is \"always willing\" to engage in negotiations but is focused on making sure any spending proposal is \"responsibly offset and that new revenue provisions protect qualified small business income where possible.\"",
    "Rep. Ruben Gallego, D-Ariz., has emerged as a leading potential progressive primary foe after repeatedly calling out Sinema, though he would have to compete with a well-funded effort backed by Sinema's corporate supporters if he chooses to challenge her in 2024.",
    "But Manchin's proposal would be funded by allowing Medicare to negotiate drug prices — a provision Sinema and other pharma-backed Democrats dramatically watered down in talks last year — and rolling back Trump-era tax cuts on the wealthy and corporations.",
    "Along with her opposition to rolling back the Trump tax cuts, Sinema has opposed Democratic efforts to repeal the filibuster to pass legislation related to voting rights, LGBTQ protections, union protections and raising the minimum wage.",
    "Sen. Kyrsten Sinema, D-Ariz., assured corporate donors on Tuesday that she would fight her party's efforts to unwind tax breaks for America's elite as Democrats try to revive portions of President Biden's stalled Build Back Better plan.",
    "Sinema repeatedly held talks with donor groups that oppose key parts of Biden's proposal throughout the earlier round of negotiations, even as she largely avoided discussing the bill with journalists or constituents.",
    "\"I work every day to ensure any government spending is targeted and thoughtful because a lean, efficient government helps avoid price hikes,\" she said at a National Federation of Independent Business event.",
    "Sinema's role in the stalled Democratic agenda has also baffled supporters back home in Arizona, where numerous efforts have been launched to back a potential primary challenger to the first-term senator.",
    "Just 19% of Arizona Democratic primary voters have a favorable opinion of Sinema, according to a January Data for Progress poll, compared to 78% for fellow Sen. Mark Kelly, D-Ariz.",
    "\"And it may well be to the benefit of Rep. Gallego, who has been courting calls to run for Senate for months, that Arizona Democratic primary voters are so prepared to unseat her.\"",
    "Gallego raised more than $510,000, a personal record, in the first three months of the year — officially for his re-election bid in the House, which he is expected to win easily.",
    "Republicans who roundly opposed Biden's proposal have expressed confidence that Sinema will block any Democratic plans to undo the tax breaks for corporations and wealthy donors.",
    "Hopefully that will be enough to keep this thing underwater permanently,\" Senate Minority Leader Mitch McConnell, R-Ky., said at a Kentucky Chamber of Commerce event on Tuesday.",
    "Sinema has repeatedly opposed rolling back the Trump tax cuts despite her previous criticism of corporate tax breaks and her demand that big companies \"pay their fair share.\"",
    "Sinema's political future is in doubt: Prospective challenger Ruben Gallego is raking in donations, and holds a huge lead over her in polls of Arizona Democrats.",
    "\"The fact that we haven't been able to come up with something that we can agree on yet — it's just shocking to me,\" Sen. Tim Kaine, D-Va., told Insider.",
    "\"But what I can promise you is that I'll be the same person in negotiations if they start again that I was in negotiations last year.\"",
    "That number is more than four times the amount he raised during the same period last election cycle, according to Insider.",
    "Sinema assured the group that she would oppose raising taxes on corporations with her pivotal vote in the 50-50 Senate.",
    "Her latest remarks threaten to upend negotiations over a slimmed-down spending package before they even begin.",
    "She has privately told donors that a revival of the spending bill is \"unlikely,\" according to Axios.",
    "Groups backing a potential primary challenger have also reported hundreds of thousands in donations.",
    "\"What I can't tell you is if negotiations will start again or what they'll look like,\" she said.",
    "The poll showed Gallego with a 58% favorable rating and leading Sinema by a 74-16 margin.",
    "\"We'll just see if there's a pathway forward,\" Manchin told reporters on Tuesday.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Speculation about Sinema's political future has continued to mount.",
    "Subscribe to our morning newsletter, Crash Course.",
    "\"We don't know if there's a pathway forward yet.\"",
    "\"I'd like to smother it if I knew how to do it.\"",
    "The dynamic has frustrated Democrats for months.",
    "Read more from Salon on Sen. Kyrsten Sinema:",
    "\"I don't know if it's dead yet,\" he added.",
    "He raised a total of $1.8 million in 2020.",
    "\"Sinema is unenthusiastic about tax hikes.",
    "\"I think we need to get a deal.\""
  ]
}