{
  "id": 6645,
  "mediaId": 8378,
  "date": "2022-04-11",
  "headline": "‘A big win for Tuba City’: Kelly, Sinema add long-term care in omnibus budget bill",
  "image": "https://navajotimes.com/wp-content/uploads/2021/06/NT-Nameplate-2020-square.jpg",
  "link": "https://navajotimes.com/reznews/a-big-win-for-tuba-city-kelly-sinema-add-long-term-care-in-omnibus-budget-bill/?utm_source=rss&utm_medium=rss&utm_campaign=a-big-win-for-tuba-city-kelly-sinema-add-long-term-care-in-omnibus-budget-bill",
  "mediaOutlet": "Navajo Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Krista Allen",
  "authorUrl": "https://navajotimes.com/author/kallen/",
  "termIds": [
    5879,
    2459,
    3791,
    1389,
    5949
  ],
  "sentences": [
    "One of those projects is Tuba City Regional Health Care Corporation’s Long Term Care Facility, which would provide residential care for Diné with a disability, cancer, and for older men and women who cannot care for themselves.",
    "“The Tuba City Regional Health Care Corporation board, CEO, and staff members continue to do great work to help our communities.”\nTCRHCC CEO Lynette Bonar did not immediately respond to a request for comment.",
    "President Jonathan Nez said seniors who need nursing home care or assisted-living services often have to travel off-rez for care because there aren’t many in the Navajo Nation.",
    "“This’ll be the first long-term care facility in the Navajo Nation.”\nTCRHCC has its Specialty Care Center, which began offering chemotherapy in the summer of 2019.",
    "“Providing health care services our citizens need close to their homes is a very positive thing to do with the federal dollars that we have available,” Kelly said.",
    "Last month, the senators announced that they included some Arizona priorities in the bill that funds the federal government through the end of the fiscal year.",
    "Kelly said these projects would better equip law enforcement, invest in job-training programs, upgrade water infrastructure, and expand access to health care.",
    "Tribe’s first long-term care\nKelly said while he and Sinema secured $8 million to construct a long-term care facility in Tuba City, it would cost a lot more.",
    "Nez said he and his administrative staff are pleased about collaborating and combining support for the congressional delegation that secured the funding.",
    "Kelly said even though the $2 million center is still relatively new, it may not have the capacity to treat all the patients who need cancer treatment.",
    "Kelly said he’d been talking with Nez about the need for a long-term care and other health care facilities within the Nation for quite some time.",
    "And there was an urgent need of this kind of health/elder care.”\nKelly said Diné wouldn’t have to travel over 100 miles for their needed care.",
    "“That’s the folks – who are working on this project – on the Navajo Nation, and they have a plan to get this (facility) fully funded.",
    "The U.S. Congress passed the final omnibus budget bill that included Kelly’s and Sinema’s congressionally directed spending requests.",
    "“The process starts like this one did, with local leaders and tribal officials coming to my office to advocate for it,” Kelly added.",
    "“This long-term care facility in Tuba City is an example of a project that will directly help those who live in the Navajo Nation.",
    "He said without partnership with local leaders and from the Navajo Nation lawmakers, a project like this would not be possible.",
    "Mark Kelly and Kyrsten Sinema secured federal funding for dozens of projects across the state, including one in Tónaneesdizí.",
    "“The reason why we (he and Sinema) chose this project is because this is a high priority for Navajo leaders and families.",
    "“This historic funding allocation is the very first federal investment in tribal-based cancer care,” Nez told the Times.",
    "“When I came to D.C., it’s been a focus of mine,” Kelly said in an interview with the Navajo Times.",
    "“These projects are going to have a direct impact on communities across the state,” Kelly said.",
    "“This is a big win for Tuba City, the Navajo Nation, and the state of Arizona,” Kelly said.",
    "Kelly said he and Sinema secured $8 million for the long-term care facility.",
    "“It’ll also provide long-term care options for elders in the Navajo Nation.",
    "“The balance of the funds will come from other sources,” Kelly said.",
    "“This new facility will provide that extra capacity,” Kelly said.",
    "“We’re going to break ground in six months,” Kelly explained.",
    "TSÉBIGHÁHOODZÁNÍ\nSens."
  ]
}