{
  "id": 6705,
  "mediaId": 2562,
  "date": "2022-04-14",
  "headline": "Sen. Sinema: Repealing Title 42 Could Be Harmful To Arizona Communities",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid0FAE8E6B-E04C-4C01-A6FE-7C77772F342E.jpg",
  "link": "https://donaldjtrumppolls.com/sen-sinema-repealing-title-42-could-be-harmful-to-arizona-communities/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "(Bonnie Cash-Pool/Getty Images)\nBy Jay Clemons | Thursday, 14 April 2022 03:59 PM\nSen. Kyrsten Sinema, D-Ariz., spoke out against the Biden administration on Thursday, saying the White House's decision to repeal Title 42 — the pandemic-related migrant expulsion policy that essentially shut down the U.S. asylum system — could be harmful to Arizona communities and migrants.",
    "The list reportedly includes: Sen. Mark Kelly, D-Ariz., Sen. Maggie Hassan, D-N.H., and Sen. Joe Manchin, D-W.Va.\nSinema and Manchin are often viewed as \"swing\" senators by Republicans and Democrats, meaning they're not locks to side with their own party on certain hot-button issues or bill proposals.",
    "Back in 2020, the Trump administration, via the Centers of Disease Control and Prevention (CDC), imposed the Title 42 health order during the early days of the coronavirus outbreak in the United States, as a means of keeping the U.S-Mexico border safe from potential virus carriers.",
    "According to GovTrack.us, a website which tracks the voting records of House and Senate members, Sinema had a nearly balanced \"ideology score\" for 2020, meaning she, technically, sided with Democrats on the majority of votes, but the differences were essentially negligible.",
    "Last week, Sinema, Sen. James Lankford, R-Okla., and a bipartisan group of senators introduced legislation that would ensure \"the Administration coordinates and communicates with border communities and puts a comprehensive, workable plan in place before lifting Title 42.\"",
    "I'll keep pushing for transparency and accountability from the Administration to help secure the border, keep Arizona communities safe, and ensure migrants are treated fairly and humanely,\" said Sinema, who's also chair of the Border Management Subcommittee.",
    "Non-legal migration into the United States puts a strain on the Department of Homeland Security and U.S. Immigrations and Customs Enforcement (ICE), along with other officials dealing with the U.S.-Mexico border crisis, Sinema argues.",
    "According to Sinema's website, the Arizona senator recently sent a letter to President Joe Biden, seeking a delay to the Title 42 repeal — at least until an alternative program or comprehensive response could be put in place.",
    "Critics of Title 42 say it's no longer needed as a mandate, since American citizens have regular access to vaccines and therapeutics, designed to handle various strains of the coronavirus.",
    "Sen. Sinema: Repealing Title 42 Could Be Harmful To Arizona Communities Sen. Kyrsten Sinema, D-Ariz., speaks during a Senate Homeland Security and Governmental Affairs Committee hearing.",
    "In her letter to Biden, Sinema said Arizona communities could be the subject of harm, without the \"proper planning, coordination, and resources\" needed to patrol and control the border.",
    "At the end of that period, according to Sinema's website, Homeland Security would have \"30 days to submit to Congress a plan to address the impacts of the post-Title 42 migrant influx.\"",
    "\"The Administration's extension of public health emergency authorities proves the need to delay lifting Title 42 to protect the health and safety of Arizona communities and migrants.",
    "\"Right now, we have a crisis on our southern border,\" said Senator Kelly last week, after meeting with ICE officials at the Douglas Port of Entry along the U.S.-Mexico border.",
    "In other words, GovTrack assesses Sinema as a \"purple\" Democrat, someone who views her party favorably … but will also consider other viewpoints before rendering a vote.",
    "Other Senate Democrats have reportedly joined Sinema in her cause to delay the Title 42 repeal, or create a suitable alternative.",
    "There are also times when Sinema refuses to drop filibuster thresholds for crucial votes, despite her own party's objections.",
    "In essence, the bill would have placed a 60-day emergency hold on the repeal of Title 42.",
    "It shouldn't be around forever, but right now this administration does not have a plan.",
    "\"Title 42 was put in place because of a public health emergency.",
    "I warned them about this months ago,\" Kelly told reporters.",
    "Original Article"
  ]
}