{
  "id": 6744,
  "mediaId": 8295,
  "date": "2022-04-14",
  "headline": "Migrantes esperan en la frontera mientras políticos bloquean el levantamiento de la prohibición de solicitudes de asilo por COVID-19",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2022/04/Title.42.Nogales-Genesis.Alvarado1-1024x640-1.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/04/14/migrantes-esperan-en-la-frontera-mientras-politicos-bloquean-el-levantamiento-de-la-prohibicion-de-solicitudes-de-asilo-por-covid-19/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Por Brenda Muñoz Murguia/Cronkite Noticias",
  "authorUrl": "https://cronkitenews.azpbs.org/people/brenda-munoz-murguia/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Public Health and Border Security Act, un proyecto de ley presentado por un grupo bipartidista de senadores, incluidos los Arizona demócratas Mark Kelly y Kyrsten Sinema, lo que requeriría que el Título 42 permanezca vigente al menos hasta 60 días después de que el Cirujano General notifique al Congreso que se puede levantar la emergencia de salud pública declarada por COVID-19.",
    "Pero ha sido golpeado por todos lados, incluidos los miembros de su propio partido, que dicen que Homeland Security y Customs and Border Protection no están preparados para el embate de la gente que esperaba que Estados Unidos permitiera las solicitudes de asilo nuevamente después de dos años.",
    "Tales son las historias de miles de inmigrantes que esperan la rescisión del Título 42, una política promulgada por la administración Trump que cerró la frontera a los migrantes y solicitantes de asilo como medida de seguridad y salud pública durante la pandemia.",
    "“Al mismo tiempo, el caos en la frontera en un escenario posterior al Título 42 también afecta negativamente la seguridad de los migrantes y podría sobrecargar aún más un sistema de atención médica en la frontera que ya está abrumado”.",
    "Ahora, la familia ha estado esperando casi un año en Nogales, Sonora, en la frontera con Arizona, para solicitar asilo, un proceso cerrado casi por completo en marzo de 2020 debido a la pandemia de COVID-19.",
    "Courtney Smith, una voluntaria de 22 años en Kino, dijo que estaba emocionada y ansiosa por que Joe Biden fuera elegido por su promesa de trabajar con los migrantes, pero que no ha visto muchos cambios.",
    "(Foto por Genesis Alvarado/Cronkite Noticias)\nLa última cena es representada con inmigrantes dentro del comedor de la Iniciativa Kino Para La Frontera en Nogales, Sonora, México, el 13 de abril de 2022.",
    "(Foto por Genesis Alvarado/Cronkite Noticias)\nUna infográfica dentro de la Iniciativa Kino Para La Frontera explicando que significa pedir el asilo, en Nogales, Sonora, México, en 13 de abril de 2022.",
    "Afuera del refugio, pululando con otros solicitantes de asilo, la madre soltera Luz vio a sus tres hijos jugar con los nuevos conejitos de peluche que recibieron en sus canastas para Pascua, de Kino.",
    "Kino sirvió, en promedio, 1,000 comidas todos los días el verano pasado, cuando una oleada de migrantes en busca de asilo de Michoacán y Guerrero llegó a la frontera de Nogales, según Del Pino.",
    "La familia de Rosario vino a la Iniciativa Kino Para La Frontera a desayunar el miércoles y se quedó un rato después para recoger los juguetes de Pascua que se estaban entregando a los niños.",
    "?han estado esperando en el limbo durante meses o años en lugares peligrosos, haciéndolos vulnerables a la explotación”, escribieron los dos senadores de Arizona en una carta a Biden.",
    "(Foto por Genesis Alvarado/Cronkite Noticias)\nNOGALES, Sonora, México – Rosario, de 24 años, se casó cuando era adolescente, tuvo dos hijos y los crió mientras su esposo trabajaba.",
    "Un proyecto de ley bipartidista similar en la Cámara incluye a los representantes demócratas de Arizona Tom O’Halleran de Sedona y Greg Stanton de Phoenix como patrocinadores.",
    "Los ciudadanos de estos estados mexicanos se están convirtiendo en víctimas del desplazamiento debido a los grupos criminales que luchan por el control del territorio.",
    "Los fiscales generales argumentaron que Biden violó los procedimientos federales al finalizar la legislación sin publicar avisos en el Registro Federal de antemano.",
    "Después de eso, el Departamento de Seguridad Nacional tendría 30 días para presentar un plan al Congreso para abordar una oleada de migrantes en la frontera.",
    "El fiscal general de Arizona, Mark Brnovich, presentó una demanda contra la administración de Biden el 3 de abril por su decisión de rescindir el Título 42.",
    "Mientras tanto, familias como la de Rosario y Luz se ven obligadas a vivir las consecuencias de una lucha política que parece no encontrar una solución.",
    "Ella y sus hijos esperan solicitar asilo en Estados Unidos porque dijo que es el único lugar donde estarán a salvo de la violencia de los cárteles.",
    "(Foto por Genesis Alvarado/Cronkite Noticias)\nEl muro fronterizo que divide Nogales, Arizona de Nogales, Sonora enseñado aquí en abril 13, 2022.",
    "Brnovich, junto con los fiscales generales de Luisiana y Misuri, presentaron la demanda en el Tribunal del Distrito Oeste de Luisiana de EE.",
    "Max Landman, organiza ropa y zapatos dentro de la Iniciativa Kino Para La Frontera en Nogales, Sonora, México, el 13 de abril de 2022.",
    "Max Landman, organiza ropa y zapatos dentro de la Iniciativa Kino Para La Frontera en Nogales, Sonora, México, el 13 de abril de 2022.",
    "“Mi vida estaba bien y era estable donde yo estaba”, dijo Rosario, quien solo usa su primer nombre por miedo de ser identificada.",
    "También usando solo su primer nombre, dijo que su hijo fue amenazado y fue víctima de un tiroteo en su ciudad natal en Guerrero.",
    "“Estoy realmente decepcionada con la falta de atención y la falta de enfoque en la crisis humanitaria aquí”, dijo Smith.",
    "Las familias se sentaron en el comedor y también desayunaron, mientras los niños corrían y jugaban con los voluntarios.",
    "Sufren discriminación por parte de los residentes locales a la hora de buscar vivienda o una forma de subsistir.",
    "Es una población fluida, dijo Gia Del Pino, directora de comunicaciones de la Iniciativa Kino Para La Frontera.",
    "Según un artículo reciente del Washington Post, hasta 20,000 personas han huido de Michoacán en el último año.",
    "Junto a él están los dormitorios: varias literas colocadas una al lado de la otra, con vista al área común.",
    "“Pensé que las cosas iban a mejorar, pero se mantuvieron igual o empeoraron, y eso ha sido muy difícil”.",
    "Smith dijo que eligió ser voluntaria en Kino porque le abrió los ojos a la situación en la frontera.",
    "Algunos se van y prueban otros puertos de entrada, pero ninguno de ellos puede volver a casa, dijo.",
    "El 1 de abril, el presidente Joe Biden ordenó la eliminación del Título 42 a partir del 23 de mayo.",
    "Le tomó ocho años ganar suficiente dinero para amueblar su casa en el estado mexicano de Michoacán.",
    "Dijo que no está seguro en Nogales porque el cartel de su ciudad natal todavía puede localizarlo.",
    "Luz huyó del estado sureño de Guerrero luego de ser amenazada por una banda de narcotraficantes.",
    "“Al gobierno le gusta creer: ‘Bueno, huiste, estás aquí en la frontera, quédate en la frontera.",
    "No podemos esperar demasiado aquí porque aún podemos ser atacados mientras estamos aquí”.",
    "Si bien ha logrado encontrar trabajo, no gana lo suficiente para mantener a su familia.",
    "Desde entonces, más de 1,7 millones de migrantes han sido rechazados en la frontera.",
    "Mientras esperan, no pueden encontrar trabajo y sus hijos no pueden ir a la escuela.",
    "Smith es originaria de Connecticut y ha sido voluntaria en Kino desde septiembre.",
    "“Este no es un lugar sostenible para vivir para las personas”, dijo Del Pino.",
    "“No estamos aquí porque queramos o porque nos guste estar aquí”, dijo Víctor.",
    "“Pero a mí no me dieron a escoger si quería estar allá o quería estar aquí”.",
    "En el segundo piso, hay un armario lleno de mantas, almohadas y sábanas.",
    "(Foto por Genesis Alvarado/Cronkite Noticias)\nJesuita sacerdote, el Rev.",
    "No hay un número exacto de cuántas personas están esperando en Nogales.",
    "Víctor es otro migrante que huyó de la violencia de los cárteles.",
    "“Estamos aquí porque tenemos que estarlo para poder sobrevivir”.",
    "“Solo estamos esperando la decisión del presidente Biden.",
    "“De la noche a la mañana dejamos todo”, dijo Rosario.",
    "Si nosotros no hacemos nada?’ Pero así pasa a veces”.",
    "Luego, los cárteles en guerra los obligaron a huir.",
    "Ella también solo quería usar su primer nombre.",
    "“Yo lloraba mucho y dije ‘¿por qué a nosotros?",
    "“Estamos esperando con miedo”, dijo Luz.",
    "“Muchos migrantes expulsados ?",
    "Jesuita sacerdote, el Rev.",
    "Pero era una casa bonita.",
    "Y ese no es el caso”.",
    "No necesitas asilo’.",
    "Cumplieron su sueño.",
    "UU."
  ]
}