{
  "id": 6795,
  "mediaId": 2741,
  "date": "2022-04-13",
  "headline": "Beto O'Rourke Wants Biden To End Pandemic Border Restrictions. But Not Like This.",
  "image": "https://media.vanityfair.com/photos/6256f52aacafead081f33527/16:9/w_1280,c_limit/1384648644",
  "link": "https://www.vanityfair.com/news/2022/04/beto-orourke-knocks-biden-title-42",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    5518,
    5078,
    4846,
    4905,
    2765,
    2174,
    2459,
    1973,
    805,
    5949
  ],
  "sentences": [
    "“We should hold the federal government accountable for doing its job, and they’re not doing that.”\n— Inside the Virus-Hunting Nonprofit at the Center of the Lab-Leak Controversy\n— Jared Kushner and Donald Trump Probably Won’t Be Splitting a Milkshake Anytime Soon\n— CNN Leaves the Drama Behind With Focus on War in Ukraine\n— Trump’s Truth Social Is an Even Bigger Humiliation Than Previous Business Failures\n— The Clock Is Ticking on the January 6 Investigation\n— The Washington Post Checks In, Finds Trump Is Still a Lying Sociopath\n— A Ukrainian Woman Explains the War to Europe’s Skeptics\n— From the Archive: How Playboy Imran Khan Became the Prime Minister of Pakistan\n— Not a subscriber?",
    "Beto O’Rourke, who is challenging Republican incumbent Greg Abbott in the Texas governor’s race, had previously demanded Joe Biden end Title 42, arguing that the pandemic-era border restrictions create an “incentive to cross [the border] in between ports of entry.” But when the Biden administration announced it would do just that, the El Paso Democrat said the restrictions should stay in place until Biden's team produces a plan to deal with the anticipated surge at the border when it is lifted.",
    "Wisconsin Lieutenant Governor Mandela Barnes, the leading Democrat seeking to flip Republican Ron Johnson’s Senate seat in November, also urged Biden not to lift the restrictions May 23 without “a detailed plan in place so that we can keep asylum seekers and people in the country safe.”\n“I’d like to see Biden put forward a comprehensive plan that deals with an influx of asylum seekers before we lift Title 42,” Barnes told the Milwaukee Journal Sentinel in an interview Tuesday.",
    "“We need a secure, orderly, and humane response at our southern border and our bipartisan legislation holds the Biden administration accountable to that.” Conservative Democrat Joe Manchin seemingly went even further, and said Title 42 should stay in place until Congress passes “comprehensive, bipartisan immigration reform” — a policy area Republicans and Democrats have failed to reach consensus on for more than a decade and have only moved further apart on in recent years.",
    "“I have yet to hear a plan from the Biden administration to address the dynamic we will have on the border once Title 42 ends.”\nThe Biden administration’s decision last month to terminate the Title 42 border restrictions Donald Trump imposed at the beginning of the pandemic triggered predictable backlash from the right, where some prominent GOP leaders used the announcement as an opportunity to score political points with the base.",
    "The comments from O’Rourke and Barnes, who are taking on two of the most prominent Trumpists, came days after Arizona Senator Kyrsten Sinema, a conservative Democrat, and Oklahoma Senator James Lankford, a Republican, introduced legislation seeking a border plan before the Trump order is rescinded.",
    "He continued to say that the emergency public health order cannot be a substitute for “comprehensive legislation.”\nTo be sure, Republicans, like Abbott and Florida Governor Ron DeSantis, have taken a purely anti-immigrant posture to the Biden administration's announcement.",
    "Much of that criticism has come from the moderate and conservative Democrats, but O'Rourke, the former Texas representative and Democratic presidential hopeful, isn’t the only liberal pushing back on the administration.",
    "Abbott has followed through on that threat, ordering new vehicle inspections at the border that has blocked traffic in the state and sending a bus of migrants on Wednesday to D.C., near the United States Capitol.",
    "“It does not make sense to end this until there is a real plan and the capacity in place to handle those and address those that come over,” O’Rourke said in an interview with the Texas Tribune Tuesday.",
    "For vulnerable Democrats — and those like O’Rourke and Barnes hoping to unseat right-wing Republicans — that’s perhaps further incentive to distance themselves from what the administration is doing.",
    "Biden's Secretary of Homeland Security Alejandro Mayorkas said the administration has put forward a “whole-of-government strategy” to manage any potential influx in migrants at the border.",
    "Those Republicans have, respectively, vowed to bus undocumented migrants to Washington, D.C. and Biden’s home state of Delaware in a kind of protest against the Title 42 termination.",
    "“The Biden administration was wrong to set an end date for Title 42 without a comprehensive plan in place,” Kelly said in a statement as the legislation was introduced last week.",
    "Cosponsors on the legislation included two Democrats, Mark Kelly of Arizona and Maggie Hassan of New Hampshire, both of whom are facing uphill reelection battles this cycle.",
    "“We will increase personnel and resources as needed and have already redeployed more than 600 law enforcement officers to the border,\" he said in a statement.",
    "According to a recent Politico/Morning Consult poll, 55% of all voters, and 53% of independents, oppose the Biden administration’s decision to end Title 42.",
    "“Over the next two months, we are putting in place additional, appropriate COVID-19 protocols, including ramping up our vaccination program.\"",
    "But a number of Democrats, particularly ones in challenging races this year, have also made a point to express opposition in recent days.",
    "But the break does appear to reflect real concerns among a growing group of Democrats about the Biden administration's approach.",
    "O’Rourke, who criticized Abbott’s move as a “very expensive stunt,” was measured in his break with the Biden administration.",
    "“Everyone is legitimately concerned about the lack of a plan,” O’Rourke told the Texas Tribune.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "Only about a third of respondents expressed support for the move.",
    "It looks like we're experiencing playback issues.",
    "Our bad!"
  ]
}