{
  "id": 6863,
  "mediaId": 2572,
  "date": "2022-04-10",
  "headline": "NYT reporter: Dem backlash to Title 42 repeal 'shows anxiety' of what migrant influx would mean 'politically'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/GettyImages-1373741404-1.jpg",
  "link": "https://www.foxnews.com/media/new-york-times-reporter-says-dem-backlash-to-title-42-repeal-shows-anxiety-of-what-migrant-influx-would-mean-politically",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hanna Panreck",
  "authorUrl": "https://www.foxnews.com/person/p/hanna-panreck",
  "termIds": [
    0
  ],
  "sentences": [
    "ARIZONA DEM SENATORS WARN BIDEN AGAINST ‘SHARP’ END TO TITLE 42 BORDER RESTRICTIONS WITHOUT A PLAN\n\"We are now seeing more Dems than we've seen since Title 42 was implemented by the Trump administration that have come out in support of restoring this thing or have come out criticizing the Biden administration's plan to lift it,\" Kanno-Youngs said, noting that Sen. Raphael Warnock, D-GA., has even come out against the plan to lift it.",
    "\"After considering current public health conditions and an increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC Director has determined that an Order suspending the right to introduce migrants into the United States is no longer necessary,\" the Centers for Disease Control said in a statement.",
    "DEM SENATORS SOUND ALARM OVER REPORTS BIDEN ADMINISTRATION WILL END TITLE 42 BORDER POLICY\nThe New York Times' piece, written by Kanno-Youngs, Eileen Sullivan and Michael D. Shear, is headlined \"Disagreement and Delay: How Infighting over the Border Divided the White House.\"",
    "The New York Times reported that both Klain and Susan Rice, Director of the Domestic Policy Council, were worried that lifting Title 42 would increase the migrant surge at the border and that it might be seen as premature if a potential new COVID variant emerges.",
    "New York Times White House correspondent Zolan Kanno-Youngs said Sunday on CNN's \"Inside Politics\" that the Democratic backlash to the Biden administration's decision to lift Title 42 \"shows the anxiety of what high border crossings would mean politically.\"",
    "Host Abby Phillip asked Kanno-Youngs about his recent piece in the New York Times on the administration's move to repeal the Trump-era public health order and the resultant concerns that Democrats could get crushed in the midterms.",
    "The New York Times reporter said that President Biden's Chief of Staff Ron Klain in the Summer of 2021 was also approaching senior aides \"saying yes, this is something, this is an issue that could impact the midterms here.\"",
    "The paper reported that discussion over repealing the former president's immigration policies in the face of an infux of migrants at the southern border caused bickering among senior aides and White House officials.",
    "\"…As well as the entire team within the White House and DHS as well at times scrambling for to try to find a solution, even if it was embracing Trump-era policies at the border to try and deter illegal crossings.",
    "The policy was used by both the Trump and Biden administrations to immediately deter migrants from crossing the border in the wake of the COVID-19 pandemic.",
    "CLICK HERE TO GET THE FOX NEWS APP\nThe Biden administration announced on April 1 that Title 42, a public health order, would be lifted at the end of May.",
    "\"Mr. Biden grew so angry at their attempts to duck responsibility that he erupted,\" the piece said, noting that Biden asked who he needed to \"fire.\"",
    "Several Democrats have slammed the decision to lift Title 42 as they consider warnings of a migrant influx at the border in the coming months.",
    "\"Ending Title 42 without a comprehensive plan in place puts at risk the health and safety of migrants and Arizona communities,\" Sinema said.",
    "It really shows that deterrence, and it shows the anxiety of what high border crossings would mean politically,\" Kanno-Youngs continued.",
    "The piece also noted that almost all the aides that were brought on early in his presidency have left their positions.",
    "Rep. Henry Cuellar, D-Texas, recently signed on to legislation that would halt the lifting of the measure.",
    "Kyrsten Sinema and Mark Kelly are among other Democrats that have warned against ending Title 42.",
    "He said that the concern was \"reflected in the White House.\"",
    "Joe Manchin of West Virginia and Arizona Sens."
  ]
}