{
  "id": 6931,
  "mediaId": 2693,
  "date": "2022-04-11",
  "headline": "Biden Scares America, Media Sweats Elon Musk",
  "image": "https://149366087.v2.pressablecdn.com/wp-content/uploads/2022/04/51988931663_2d8f46635c_b.jpg",
  "link": "https://spectator.org/biden-scares-america-media-sweats-elon-musk/",
  "mediaOutlet": "The American Spectator",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Catron",
  "authorUrl": "https://spectator.org/author/dcatron/",
  "termIds": [
    0
  ],
  "sentences": [
    "The poll found that the proposal to eliminate Title 42, which allows immediate expulsion of illegal immigrants pursuant to their potential to spread COVID-19, is the least popular Biden initiative to date: “A majority of registered voters (56%) oppose the decision to remove the border controls implemented by the Trump administration, the largest backlash against a Biden administration policy among dozens tracked by Morning Consult since January 2021.” The voters clearly knew from the start that the proposal was nuts.",
    "The Washington Post reported, “Employees raged on internal message boards, expressing fears Musk will sabotage their culture and make it hard to do their jobs.” Late Sunday night CEO Parag Agrawal announced, “Elon has decided not to join our board.”\nIn closing, here’s something to consider: When the Russians invaded Ukraine, they initiated a cyberattack that took down internet access for most of the country.",
    "At NBC’s “Think,” Kara Alaimo fretted, “As we head into another election cycle and are still dealing with Covid, his record of spreading misinformation on the social media platform is worrisome.” At the Washington Post, Ellen K. Pao revealed the actual issue in a column titled, “Elon Musk’s vision of ‘free speech’ will be bad for Twitter.” Take note that she invariably encloses free speech in scare quotes.",
    "Representatives Tom O’Halleran of Arizona, Jared Golden of Maine, Stephanie Murphy of Florida, Chris Pappas of New Hampshire and Greg Stanton of Arizona … Meanwhile, Senators Krysten Sinema and Mark Kelly of Arizona, Maggie Hassan of New Hampshire, Joe Manchin of West Virginia and Jon Tester of Montana have signed onto similar legislation in Congress’ upper chamber.",
    "Musk calls himself a “free-speech absolutist,” but like many “free speech” advocates, he willfully ignores that private companies are free to establish some limits … As the company’s largest shareholder, Musk will no doubt have outsize influence, and his clout will be magnified by the board seat.",
    "He can bend the company toward his preferences, removing reasonable policies on hateful speech … Musk’s appointment to Twitter’s board shows that we need regulation of social-media platforms to prevent rich people from controlling our channels of communication.",
    "Pursuant to this and other such revelations, Rep. Claudia Tenney (R-N.Y.) and her colleagues in the House Election Integrity Caucus sent a letter to Twitter’s CEO last week posing questions about the platform’s censorship of the Hunter Biden laptop story.",
    "Do you believe Twitter rigorously adheres to this principle?” This elicited 2,035,924 responses, and 70.4 percent answered, “No.” And Pao certainly knows that, in 2020, Twitter censored damaging news about Hunter Biden’s infamous laptop.",
    "Musk has, after all, uttered such heretical remarks as this: “Given that Twitter serves as the de facto public town square, failing to adhere to free speech principles fundamentally undermines democracy.” This outraged Twitter’s staff.",
    "As Pao knows perfectly well, rich people already control our channels of communication and Twitter’s violation of its own “reasonable policies” was a major factor in Musk’s decision to buy such a large amount of the company’s stock.",
    "A survey conducted by the Media Research Center in 7 swing states found that, had they known about scandals suppressed by Twitter, enough Biden voters would have withheld their support to change the outcome of the 2020 election.",
    "While Biden and his advisers were discussing the administration’s public response, Ukrainian Vice Prime Minister Mykhailo Fedorov asked Elon Musk to use his Starlink network to restore connectivity for the besieged country.",
    "As Newsweek reports:\nCongressman Henry Cuellar signed onto legislation aimed at preventing the Biden administration from lifting Title 42 immigration limits … He joins other Democrats in backing the legislation.",
    "But the price of gas was rising well before Russia invaded Ukraine, and a new study from the Federal Reserve suggests that Biden’s $1.9 Trillion “American Rescue Plan” caused the inflation spike.",
    "Just over 10 hours later, Musk tweeted: @FedorovMykhailo “Starlink service is now active in Ukraine.” Compare that to the dilatory support and mixed messages Ukraine has been getting from Biden.",
    "On top of all this, the Biden administration proposes a revision to our border policy so crazy that it has resulted in bipartisan opposition in both houses of Congress.",
    "Public opinion polls indicate that most voters doubt his mental capacity to carry out his duties, and his public effusions confirm the accuracy of that assessment.",
    "Still, for the corporate media, neither Biden’s infirmities nor his irrational policy positions were as scary as Elon Musk sitting on Twitter’s board.",
    "Since his bizarre State of the Union address, Biden’s utterances have become less and less lucid and his few coherent statements are terrifying.",
    "He continues to make reckless statements about Putin while remaining in denial about the damage resulting from his own domestic policies.",
    "Musk was invited to join the Twitter board after he bought a 9.2 percent stake in the company, making him its largest shareholder.",
    "He has called for regime change in a country with a huge nuclear arsenal and denounced its president as a war criminal.",
    "The letter expressly asks if Twitter censorship was carried out in coordination with the Biden presidential campaign.",
    "He was initially welcomed by co-founder Jack Dorsey and CEO Parag Agrawal, but this did not allay media fears.",
    "According to a recent Morning Consult/Politico survey, a majority of the voters agree with these lawmakers.",
    "Prior to announcing that he would join its board, Musk polled Twitter’s users about this very issue.",
    "He insists that Putin is to blame for U.S. inflation and skyrocketing gasoline prices.",
    "Yet the corporate media are generally sanguine about Biden’s verbal incontinence.",
    "It is now impossible to ignore our president’s cognitive decline.",
    "He tweeted, “Free speech is essential to a functioning democracy.",
    "So, what would frighten the Fourth Estate?",
    "Elon Musk on Twitter’s board of directors.",
    "Twitter gave us the mushroom treatment.",
    "Perhaps these two should switch jobs.",
    "Meanwhile, Biden’s decline steepens.",
    "Indeed, they have applauded it.",
    "Just a thought."
  ]
}