{
  "id": 6936,
  "mediaId": 4032,
  "date": "2022-04-10",
  "headline": "Bipartisan Legislation in the House and Senate Seeks to Prevent Biden From Rescinding Title 42",
  "image": "https://thenewamerican.com/assets/sites/2/Southern-border.jpg",
  "link": "https://thenewamerican.com/bipartisan-legislation-in-the-house-and-senate-seeks-to-prevent-biden-from-rescinding-title-42/?pk_campaign=feed&pk_kwd=bipartisan-legislation-in-the-house-and-senate-seeks-to-prevent-biden-from-rescinding-title-42",
  "mediaOutlet": "New American",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Murphy",
  "authorUrl": "https://thenewamerican.com/contributor/james-murphy-2/",
  "termIds": [
    0
  ],
  "sentences": [
    "The cosponsors argued that “by simply doing away with Title 42, this Administration is pulling the rug out from under our Border Patrol agents and the communities they work to protect.”\nAmong others, Senator Manchin called the decision to drop the policy “frightening.” He said in a statement,\nTitle 42 has been an essential tool in combating the spread of COVID-19 and controlling the influx of migrants at our southern border.",
    "The bill, if passed, would stop the Biden administration from dropping an expulsion policy, formally known as Section 262 of U.S. Code Title 42, that prohibits entry into the United States when the Director of the Centers for Disease Control and Prevention (CDC) believes “there is serious danger of the introduction of [a communicable] disease into the United States.” The Covid-related policy took effect on March 21, 2020.",
    "At Wednesday’s White House press briefing, Press Secretary Jen Psaki claimed that Title 42 was “not an immigration policy,” but a “public health measure.” She insisted the administration has a plan in place to address the anticipated surge in migration, saying that the president is looking to increase the DHS (Department of Homeland Security) budget to address the issue.",
    "When the CDC officially announced it was lifting Title 42, Mayorkas claimed that the agency had “put in place a comprehensive, whole-of-government strategy to manage any potential increase in the number of migrants encountered at our border.”\nIf this strategy is as effective as the current one, then it is a cause for great concern.",
    "“After considering current public health conditions and increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC Director has determined that an order suspending the right to introduce migrants into the United States is no longer necessary,” said the agency.",
    "This is precisely what the lawmakers are trying to address, saying in the bill that Title 42 should only be ended no earlier than 60 days after the surgeon general submits written notification to Congress formally rescinding the Covid-19 public health emergency and the national emergency.",
    "A bipartisan bill that would prevent the Biden administration from ending the Title 42 emergency border order next month without a detailed plan in place to stop an expected surge of migrants at the United States’ southern border was introduced in both chambers of Congress on Thursday.",
    "This made little sense to the public and many lawmakers on both sides of the aisle — if “current public health conditions” have improved to the point where it is no longer “necessary” to keep immigrants out, why isn’t President Biden lifting the pandemic-related national emergency?",
    "Further, the bill states that during that 60-day window, and no later than 30 days after the written notification by the surgeon general is provided, the Biden administration must submit a plan to Congress on how it would address any possible influx of migrants.",
    "“It’s either a risk or it’s not a risk.”\nOn Wednesday, Senate Republicans voted against the spending bill, which would increase funding for Covid treatments, vaccines, and testing, demanding that it include an amendment keeping Title 42 in place.",
    "According to the outlet,\n“At the same time the administration is asking for $10 billion because COVID is a risk, they’re saying it’s not a risk on the border and we should open the border up,” Lankford told Axios.",
    "Psaki also said that “there will still be significant measures put in place for anyone who tries to irregularly migrate to the United States,” referring the reporters to the DHS for more details.",
    "On Tuesday, Republicans on the House Oversight Committee requested that DHS Secretary Alejandro Mayorkas detail his plans for dealing with an expected spike in migrants at the southern border.",
    "According to DHS estimates, as many as 18,000 illegal immigrants will be coming to America’s southern border every day as a result of the Title 42 reversal.",
    "We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy.",
    "Democratic cosponsors of the bill include Senators Mark Kelly (Ariz.) and Maggie Hassan (N.H.), both of whom are up for reelection this November.",
    "The order has allowed border officials to expel over 1.7 million migrants attempting to enter the United States without hearing asylum claims.",
    "The bill will be included in a larger amendment attached to the Senate’s $10 billion Covid-19 funding bill, said Senator Lankford to Axios.",
    "However, while the president has requested $56.7 billion in discretionary funding for DHS in 2023, the funds are not yet available.",
    "A practically identical bipartisan piece of legislation was introduced in the U.S. House of Representatives.",
    "In the U.S. Senate, the bill was drafted by Senators Kyrsten Sinema (D-Ariz.) and James Lankford (R-Okla.).",
    "That would be 100,000 people per week, or half a million people potentially crossing each month.",
    "That’s more than double the number of people the border agents are handling now.",
    "The legislation is backed by five Democrats and six Republicans, reported Axios.",
    "Republicans who signed on include Senators John Cornyn (Texas), John Thune (S.D.",
    "), Rob Portman (Ohio), Thom Tillis (N.C.), and Shelley Moore Capito (W.Va.).",
    "Fellow Democratic Senators Joe Manchin (W.Va.) and Jon Tester (Mont.)",
    "We are nowhere near prepared to deal with that influx.",
    "The order was rescinded by the CDC on April 1, 2022.",
    "are also on board."
  ]
}