{
  "id": 694,
  "mediaId": 2564,
  "date": "2022-02-22",
  "headline": "Republican and Democratic campaign committees are spending an average 700% MORE on security than in the last election cycle: Ted Cruz, AOC, Liz Cheney and Mark Kelly top lawmakers' $3 MILLION protection bill over increased threats",
  "image": "https://i.dailymail.co.uk/1s/2022/02/22/20/54520839-0-image-a-103_1645563402876.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10540227/Republicans-Democrats-spending-700-security-election-cycle.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Goodin",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Emily+Goodin,+Senior+U.S.+Political+Reporter",
  "termIds": [
    0
  ],
  "sentences": [
    "Rounding out the top for lawmakers' security expenses in the last year were:\nGeorgia Democratic Sen. Jon Ossoff at $240,000\nMissouri Democratic Rep. Cori Bush at $170,000\nPennsylvania Republican Sen. Patrick J. Toomey at $96,000\nDemocratic Rep. Eric Swalwell of California at $86,000\nDemocratic Rep. Mike Levin of California at $65,000\nWarnock and Osoff won special elections in Georgia in January that gave Democrats control of the Senate and sparked a wave of GOP fury.",
    "+5\nView gallery\nDemocratic Sen. Mark Kelly of Arizona had some of the highest security costs - $300,000 last year\n+5\nView gallery\nOn the Republican side, Senator Ted Cruz of Texas was the biggest spender on security - just shy of $250,000\nRounding out the top ten, Democratic Rep. Alexandria Ocasio-Cortez of New York spent $73,000 and Republican Rep. Liz Cheney of Wyoming came out at $59,000.",
    "+5\nView gallery\nDemocratic Rep. Alexandria Ocasio-Cortez was one of the top ten spenders on campaign security in 2021: coming in at $73,000\n+5\nView gallery\nRepublican Rep. Liz Cheney was also in top ten at $59,000\nDemocratic Sen. Mark Kelly of Arizona had some of the highest costs - $300,000 last year.",
    "Cheney has been a target of former President Donald Trump and his supporters since she voted for his second impeachment and joined the special committee investigating the January 6th insurrection at the Capitol.",
    "And Swalwell told the Daily Beast last year that: 'Threats to my and my family's safety intensified dramatically when I was named an impeachment manager in January, and have not abated since.'",
    "Some of the most prominent and high-profile names in politics were its top spenders on security: Senators Mark Kelly and Ted Cruz; and Representatives Liz Cheney and Alexandria Ocasio-Cortez.",
    "In 2021, the campaign committees for lawmakers from both parties noted nearly $3 million for security-related spending, according to a CQ Roll Call analysis of federal election records.",
    "Last year the Federal Election Commission changed regulations to allow lawmakers to use campaign funds to pay for security expenses to protect themselves and their immediate families.",
    "Additionally, Kelly is the husband of Gabby Giffords, the former member of Congress who was shot in the head while greeting constituents at a Tucson grocery market in 2011.",
    "Threats against lawmakers have reached an all-time high of 9,600 in 2021, according to U.S. Capitol Police data released last month, outpacing 2020 figures.",
    "Members of Congress from both parties saw a dramatic increase in security costs - both for personal protection and for cybersecurity measures.",
    "Both Democrats and Republicans increased spending on security last year by nearly 700% as lawmakers faced an unprecedented number of threats.",
    "Additionally, Republican lawmakers who supported Donald Trump's impeachment for his role in that day reported an increase in threats.",
    "One of Kelly's Republican opponents, Jim Lamon, ran a Western-style ad that shows him shooting various Democrats, including Kelly.",
    "That's up nearly 700% over the entire 2019-2020 cycle when congressional candidates listed security-related expenses of $385,000.",
    "His re-election contest is one of the most competative in the nation and the seat could be won by either party.",
    "But the biggest spender on security among Democrats was Georgia Senator Raphael Warnock, who dropped $665,000.",
    "Both Bush and Ocasio-Cortez are high-profile progressive Democrats who have been frequent targets of critics.",
    "The bill is expected to go up as campaigning begins in earnest ahead of the November midterm election.",
    "On the Republican side, Senator Ted Cruz of Texas spent just shy of $250,000.",
    "The increase came after the January 6, 2021 insurrection at the Capitol.",
    "Kelly is a target - literally."
  ]
}