{
  "id": 6967,
  "mediaId": 2589,
  "date": "2022-04-13",
  "headline": "Vulnerable Democrat turns border hawk: Biden \"really needs to step up\"",
  "image": "https://media.townhall.com/townhall/reu/o/2018/21/5ffc6764-df19-4dc0-9fcf-cf67834ea74c-1110x740.jpg",
  "link": "https://hotair.com/karen-townsend/2022/04/13/vulnerable-democrat-turns-border-hawk-biden-really-needs-to-step-up-n461995",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Townsend",
  "authorUrl": "https://hotair.com/author/karen-townsend",
  "termIds": [
    0
  ],
  "sentences": [
    "As Hassan tries to erase recent history with a bizarre border photo-op, many in New Hampshire and beyond are realizing that her and her team are in full-scale panic mode and know that their time in the Senate is coming to an end.”\nYesterday, MAGA @Maggie_Hassan said Biden needs to address gaps in the border wall.",
    "Most of the media only covers the Biden border crisis when it can no longer ignore it, as when tens of thousands of Haitian migrants crossed over the border via the Rio Grande River at Del Rio, Texas and had to be detained under the International Bridge due to a lack of housing for them.",
    "Hassan likely figures she has some cover from other vulnerable Democrats like Senator Mark Kelly in Arizona and Raphael Warnock in Georgia, who reliably vote with the progressives in the Senate and now have to move to more moderate positions in order to fight for their seats.",
    "Biden has never been near the southern border and Kamala has only taken one trip on the pretense of talking about border security and that was to El Paso, a very long way away from the Rio Grande Valley (RGV) which is the epicenter of the crisis.",
    "As she was stating the obvious, she determined that Border Patrol agents and other personnel on the ground at the border are already overwhelmed with Biden’s border crisis and the end of Title 42 will drastically exacerbate the situation.",
    "In order to turn in a more moderate direction, as opposed to siding with the progressives in the Senate as she has a record of doing, Hassan sees the writing on the wall and has turned into somewhat of a border hawk.",
    "But in 2019, she opposed the wall and said it “isn’t the best way to secure our border.”\n— NRSC Rapid Response (@NRSC_Rapid) April 12, 2022\nIn 2021 Hassan voted three times against border wall funding.",
    "The media suddenly became interested when a Democrat operative working for Julian Castro started the trope that Border Patrol agents in the horse patrol were whipping migrants.",
    "Otherwise, regular coverage of the southern border falls solely to FNC reporters who have done stellar work since the Biden border crisis began when Sleepy Joe took office.",
    "She came away from her listening tour with the conclusion that ending Title 42 will lead to more people trying to cross the southern border, both legally and illegally.",
    "However, there is no reason to believe that once the midterm election cycle is over and if Hassan wins re-election, she will remain in a common sense state of mind.",
    "She voted in 2008 to kill a bill in the New Hampshire State Senate that would prohibit the state from acting as a sanctuary for illegal migrants.",
    "“The administration really needs to step up here, develop a plan and get more resources to the southern border.”\nWelcome to the party, Maggie.",
    "She toured the southern border and met with U.S. Customs and Border Protection officials to learn about their needs to do their jobs safely.",
    "The National Republican Senatorial Committee, the national organization solely devoted to taking back the Republican Senate Majority.",
    "At least she’s done more than either Joe Biden or his border czar Kamala Harris has done so far – she actually toured the border.",
    "The poll shows that 53% of registered voters in New Hampshire want to elect someone to be a check on the Biden Administration.",
    "Let’s hope that changes in November and the coming red wave (or tsunami) in the House includes control of the Senate, too.",
    "Her history is one of votes against the border wall, the Remain in Mexico policy, and also in favor of ending Title 42.",
    "Vulnerable Democrats are running away from the Biden administration’s decision to end Title 42 in May.",
    "“Our frontline personnel need significant, additional numbers, people, on the ground at the border.",
    "She is obviously only now changing her mind because she is in fear of losing her re-election race.",
    "New Hampshire has a Republican governor and two Democrats as senators – Hassan and Jeanne Shaheen.",
    "The results of the most recent Saint Anselm College Survey Center poll shows Hassan underwater.",
    "She is frequently singled out as the most vulnerable incumbent running for re-election in 2022.",
    "The issue will only rise in importance as voters see the damage being done when Title 42 ends.",
    "New Hampshire Democrat Senator Maggie Hassan has a tough re-election campaign on her hands.",
    "They need access roads and, in some places, they need physical barriers,” Hassan said.",
    "reminds us of her election year conversion and labels her as “MAGA Maggie” now.",
    "Her open borders philosophy was not new during the Trump administration.",
    "We’ll see how this sudden conversion to border hawk works for Hassan.",
    "Illegal migration is one of the top five concerns for voters now.",
    "At least, not with the votes she’s taken in the Senate.",
    "Hassan took a trip to Texas and Arizona last weekend.",
    "Spokesperson released a statement on Hassan.",
    "Better late than never, I suppose.",
    "“It ain’t easy being MAGA Maggie.",
    "Add Maggie Hassan to that list.",
    "Joe Biden needs to step up.",
    "They need more technology."
  ]
}