{
  "id": 6993,
  "mediaId": 2632,
  "date": "2022-04-15",
  "headline": "Jamie Dimon, Other JP Morgan Executives Donated to Centrist Democrat Kyrsten Sinema",
  "image": "https://media.nbcbayarea.com/2022/01/106979925-1637757625901-106979925-16377575432021-11-23t224824z_842985140_rc2i0r9qefzm_rtrmadp_0_usa-jpmorgan-dimon.jpg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.nbcbayarea.com/news/business/money-report/jamie-dimon-other-jp-morgan-executives-donated-to-centrist-democrat-kyrsten-sinema/2864912/",
  "mediaOutlet": "nbcbayarea.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Schwartz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Tim Scott, R-S.C. and Patty Murray, D-Wash., along with Reps. Hakeem Jeffries, D-N.Y., and Patrick McHenry, R-N.C.\nJ.P. Morgan Chase CEO Jamie Dimon and other executives from the bank contributed to the campaign of centrist Democratic Sen. Kyrsten Sinema, who has opposed key pieces of her party's and President Joe Biden's agenda, during the first quarter.",
    "The donations from Dimon and the other J.P. Morgan executives came after Sinema reiterated in January that she would not support proposed changes to the Senate's filibuster rule.",
    "J.P. Morgan Chase CEO Jamie Dimon was among a group of executives from his bank to contribute to Sen. Kyrsten Sinema's reelection campaign in the first quarter of the year.",
    "Axios reported that the Wall Street executive pushed Biden for his administration to create a \"Marshall Plan\" to develop more domestic gas and other energy resources.",
    "The senator, who has received support from executives and corporate political action committees since pushing back on her own party, is up for re-election in 2024.",
    "Dimon, according to Sinema's latest Federal Election Commission filing, donated $2,900 to the lawmaker's political operation in February.",
    "Records indicate that Dimon gave to lawmakers on both sides of the aisle in the last quarter, which spanned from January to March 31.",
    "Mary Erdoes, the CEO of J.P. Morgan Chase's Asset & Wealth Management line of business, gave $2,900 to Sinema's campaign in February.",
    "Dimon has also said he's not against having higher taxes on the wealthy but believes any new legislation could target income.",
    "Sinema has opposed certain pieces of Biden's agenda, including the idea of raising the corporate tax rate to 28% from 21%.",
    "She has opposed certain pieces of President Biden's agenda, including the idea of raising corporate taxes from 21% to 28%.",
    "\"You all know the phrase the devil is in the details, well the details here are all that matter, not the top line of 28%.\"",
    "Tim Scott, R-S.C. and Patty Murray, D-Wash., along with Reps. Hakeem Jeffries, D-N.Y., and Patrick McHenry, R-N.C.",
    "Sinema's leadership PAC, which is called Getting Stuff Done, saw $5,000 from the bank's PAC late last year.",
    "The state also went for Biden in the 2020 election, the first time since 1996 that a Democrat won Arizona.",
    "She supports the proposed 15% minimum corporate tax on declared income of large corporations, meanwhile.",
    "\"The tax increase is actually four times what the tax decrease was from 2017,\" Dimon said at the time.",
    "Arizona is considered a swing state despite having two Democrats representing it in the U.S. Senate.",
    "A spokeswoman for J.P. Morgan told CNBC on Friday that Dimon also donated to the campaigns of Sens.",
    "A spokeswoman for J.P. Morgan told CNBC on Friday that Dimon also donated to the campaigns of Sens.",
    "Sinema raised over $1.6 million last quarter, and her campaign has just under $7 million on hand.",
    "At a House Financial Services hearing last year, Dimon took aim at Biden's proposed tax hikes.",
    "Many financiers within Sinema's own party have already been plotting a primary against her.",
    "Robert Baynard, a vice chairman at the bank, gave $2,000 to her campaign in late January.",
    "That amount is the most an individual can give directly to a candidate's campaign.",
    "Dimon has been vocal about various policy issues for years, including taxes.",
    "Since he's become president, Biden has met with Dimon several times.",
    "A representative for Sinema did not return a request for comment.",
    "[Sen. Mark Kelly is vying for re-election this year.]",
    "The spokeswoman declined to comment further."
  ]
}