{
  "id": 7075,
  "mediaId": 2572,
  "date": "2022-04-01",
  "headline": "Arizona AG warns of 'tidal wave' of migrants at southern border if Biden admin lifts Title 42",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/Mark-Brnovich-CC.jpg",
  "link": "https://www.foxnews.com/politics/arizona-ag-warns-tidal-wave-migration-biden-title-42",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    2459,
    2765,
    4873,
    3401,
    4905,
    5949
  ],
  "sentences": [
    "\"Our office is requesting that Title 42 remain as an official federal policy and that it be vigorously enforced,\"\nMultiple outlets reported Wednesday that the Biden administration is planning to announce that it will end Title 42 on May 23, giving the Department of Homeland Security time to prepare for an expected increase in migrants at the border.",
    "\"Your immigration policies have already led to the worst border crisis in our nation’s history, and now we understand that your administration is rolling back a vital policy, Title 42, which will further compromise public health and overwhelm law enforcement,\" Brnovich, who is running for Senate in Arizona, said in a letter to President Biden.",
    "FIRST ON FOX: Arizona Attorney General Mark Brnovich is warning the Biden administration that the U.S. will face a \"tidal wave\" of migration if it goes through with its reported plan to lift Title 42 in the coming months -- tapping into broad bipartisan concerns that the move will spark a massive migrant surge.",
    "While satisfying left-wing Democrats and immigrant activists, who called the order cruel and an excuse to deny people their right to claim asylum, Republicans and some Democrats have expressed concern about it encouraging even more migrants to make the journey to the border.",
    "DEM SENATORS SOUND ALARM OVER REPORTS BIDEN ADMINISTRATION WILL END TITLE 42 BORDER POLICY\nIn his letter, Brnovich tells President Biden that a sheriff told him that Border Patrol is estimated 20,000 a week could cross into his sector if Title 42 is ended.",
    "Brian Kemp, in a letter to Biden Thursday said that if he ends Title 42 \"we deserve to hear a detailed, actionable plan to stop mass illegal crossings, human trafficking and other crimes that will result from this decision.\"",
    "The order was implemented by the Trump administration in March 2020 due to the outbreak of COVID-19 and has since been used by both the Trump and Biden administrations to expel a majority of migrants at the border.",
    "The White House has not confirmed that Title 42 is ending, and has instead deferred to the Centers for Disease Control (CDC) – which is the agency that will make the decision on ending the public health order.",
    "\"This tidal wave of migrants would devastate both law enforcement and border towns, and would undermine efforts of public health officials to insulate communities from a rampant spread of COVID-19,\" he said.",
    "He warned that cartels use the migrant to distract border authorities from \"a rash of deadly drugs and dangerous ‘gotaways’ streaming across unmanned sectors.\"",
    "Mark Kelly and Kyrsten Sinema spoke to DHS Secretary Alejandro Mayorkas on Wednesday, days about their concerns about ending Title 42 without a plan in place.",
    "\"It spreads out across the country and brings increased crime, drug trafficking, human trafficking, and gang activity to communities far from the border.\"",
    "The White House on Wednesday acknowledged that \"there will be an influx of people to the border\" when the Centers for Disease Control lifts the order.",
    "Sinema, who is Chair of the Senate Subcommittee on Border Management, said she told Mayorkas she intends to hold a hearing on the matter.",
    "\"As the chief executive of Georgia, I can personally attest to the fact that this crisis does not stay on the border,\" he said.",
    "Brnovich’s letter comes as Democratic senators in the state have also expressed concern about the ending of Title 42.",
    "Meanwhile, DHS put out a fact sheet for its plans to deal with an increase in numbers.",
    "\"Border security is national security, and it must be treated as such,\" he wrote.",
    "Officials in other states have also expressed concern about the potential move.",
    "In February, approximately 55% of migrants were returned due to the order.",
    "Georgia Gov.",
    "Sens."
  ]
}