{
  "id": 73,
  "mediaId": 2584,
  "date": "2022-02-22",
  "headline": "Money unites: Republicans and Democrats find rare bipartisanship over trading stocks",
  "image": "https://i.guim.co.uk/img/media/cef04eae071d4ff409e39f25a7b5b906558f307f/0_162_4872_2923/master/4872.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6c1de3713fb59cda276ccc4b9fd0c05d",
  "link": "https://www.theguardian.com/us-news/2022/feb/22/us-politicians-trading-stocks-bipartisan-idea",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joan E Greve",
  "authorUrl": "https://www.theguardian.com/profile/joan-greve",
  "termIds": [
    0
  ],
  "sentences": [
    "Responding to Luria’s comments specifically, Miller added: “Members of Congress expecting that they don’t prioritize companies in which they’re invested is bullshit.”\nMiller’s group was one of 18 progressive organizations that signed on to a letter urging Congress to hold a hearing on banning stock trades, arguing that the Stock Act and other existing laws “have not served as a sufficient deterrent to this problem”.",
    "“They should be able to participate in that.”\nBut Pelosi’s comment sparked ire among government ethics experts and editorial boards, who argued that lawmakers’ ability to glean information from classified briefings and stakeholder meetings raised the possibility of insider trading.",
    "Despite wide public support for banning lawmakers from trading stocks, members of both parties have expressed anxiety about the idea: a rare moment of bipartisanship in a divided America, but one whose subject – stock-trading politicians – is unlikely to please many voters.",
    "“This would help rebut that appearance of double-dealing and go a long way toward restoring Americans’ trust in their leadership.”\nFor those members who are hesitant to give up their stocks, Hedtler-Gaudette suggested they should reconsider their chosen career.",
    "“We have seen countless examples of how members – not just as a body but individual members – can influence the stock market with a range of tools at their disposal,” said Donald Sherman, chief counsel for Citizens for Responsibility and Ethics in Washington.",
    "“Now we’re at a place in history and on the Hill where an individual member of Congress can influence the stock price with a tweet.”\nGroups like Crew are hopeful that the momentum for passing a stock-trading ban will soon translate into congressional action.",
    "Despite wide public support for banning lawmakers from trading stocks, members of both parties have expressed anxiety about the idea\nNancy Pelosi probably did not expect to set off such a firestorm with her use of three words: free market economy.",
    "“We’re seeing that reporting and disclosure do not actually act as any kind of a deterrent to doing things that look, at the very least, pretty sketchy.”\nGovernment watchdog groups also argue that the Stock Act is now somewhat outdated.",
    "“So I’m very strongly opposed to any legislation like that.”\nAdvocates for a stock-trading ban were quick to note that Luria and her husband own millions of dollars worth of stocks in Facebook, Netflix and Apple, among other companies.",
    "Over in the House, Democrat Abigail Spanberger and Republican Chip Roy have introduced a similar bill to the Ossoff-Kelly proposal, and more than 50 members have signed on as co-sponsors to the separate Ban Conflicted Trading Act.",
    "No one has ever been prosecuted under the law, and an investigation by Business Insider found that at least 55 members of Congress and 182 senior congressional staffers were late in filing their stock trades in 2020 and 2021.",
    "The justice department investigated Burr and three of his Senate colleagues – Republicans Kelly Loeffler and James Inhofe and Democrat Dianne Feinstein – for possible insider trading, but ultimately no charges were filed.",
    "One bill, introduced by Democratic senators Jon Ossoff and Mark Kelly, would require members, their spouses and their dependent children to place their stock portfolios in a blind trust controlled by an outside party.",
    "“It has really gotten to a point where it’s getting a little bit too difficult for the rest of Congress to ignore,” Alexandria Ocasio-Cortez, a co-sponsor of Krishnamoorthi’s bill, said at a town hall on Tuesday.",
    "“The fact of the matter is, we shouldn’t be able to day-trade the companies whose regulation and whose hearings and whose industries and business is before Congress.”\nA majority of Americans agree with her.",
    "A late filing is supposed to be punished with a $200 fine that increases with subsequent offenses, but Congress does not keep any public record of such fines, and it’s unclear how often they are collected.",
    "Another recent survey, conducted by the conservative advocacy group Convention of States Action, found that 76% of voters believe lawmakers and their spouses have an “unfair advantage” in the stock market.",
    "Republican senator Josh Hawley has proposed a similar bill, although his legislation does not cover dependent children and would not fine members’ salaries for violations, as the Ossoff-Kelly bill would.",
    "Despite her initial reluctance, Pelosi has now adopted a more open-minded tone about the proposals, and the Senate majority leader, Chuck Schumer, has said the upper chamber should address the issue.",
    "“Honestly, the stock trades by members of Congress just smell bad … Regardless of which party is doing it, it just doesn’t look good,” said RL Miller, the political director of Climate Hawks Vote.",
    "However, insider trading is very difficult to prove, so in 2012, Congress passed the Stop Trading on Congressional Knowledge (Stock) Act to address concerns about lawmakers’ financial activities.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "Government watchdog groups warn that if Congress fails to act on this issue, it will only intensify many Americans’ concern over how money has tainted their country’s political institutions.",
    "In the face of backlash, Pelosi has changed her tune on the stock-trading issue, but her hesitation highlighted an uncomfortable truth about how Congresshas responded to the proposal.",
    "They say the legislation does not properly account for how lawmakers can use the 24-hour news cycle and social media platforms to affect markets and specific companies’ share prices.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "“There are a number of sacrifices that you have to make to run for office … If this is a problem, then you are not required to run for Congress.”\n… we have a small favour to ask.",
    "The debate over banning members’ stock-trading has been reinvigorated in recent months, after a string of high-profile controversies at the start of the coronavirus pandemic.",
    "In February 2020, Republican senator Richard Burr sold hundreds of thousands of dollars’ worth of stock before the market suffered a severe setback the next month.",
    "Republican congressman Pete Sessions has described a ban as unnecessary, while one of his Democratic colleagues, Elaine Luria, attacked the proposal as “bullshit”.",
    "The law prohibits members from using information gained through work for their own personal profit, and it requires them to disclose stock trades within 45 days.",
    "“The teeth behind the Stock Act are basically non-existent,” said Dylan Hedtler-Gaudette, government affairs manager at the Project on Government Oversight.",
    "That bill, which was first introduced by Democrat Raja Krishnamoorthi, would ban members and senior congressional staffers from trading individual stocks.",
    "When the House speaker was asked in December whether she supports proposals to ban members and their spouses from trading individual stocks, she said no.",
    "The enactment of a stock-trading ban could have the additional benefit of boosting the public’s opinion of Congress, which has suffered in recent years.",
    "Advocates for the proposed stock-trading ban say the policy would bolster public confidence in one of America’s most important political institutions.",
    "Some critics also noted that Pelosi’s husband, Paul, recently netted a gain of more than $5m from trading stocks of Alphabet, Google’s parent company.",
    "In response to the outcry over those controversies, both Democrats and Republicans have proposed bills to crack down on members’ stock-trading.",
    "According to a January poll from the progressive firm Data for Progress, 67% of US voters say lawmakers should be banned from trading stocks.",
    "“I think this is sort of an easy win that will have a very positive impact on policy-making and on public-facing democracy,” Sherman said.",
    "Both Democratic and Republican lawmakers have pointed to the existing legislation to argue against banning members from trading stocks.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "We already have the Stock Act that requires people to report stock trades,” Luria told Punchbowl News earlier this month.",
    "While he was overseeing those valuable stock trades, Burr was also publicly downplaying the threat of the virus.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "According to Gallup’s January polling, only 18% of Americans approve of how Congress is handling its job.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "Enforcement of the Stock Act also appears to have been spotty at best over the past 10 years.",
    "“Why would you assume that members of Congress are going to be inherently bad or corrupt?",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "“Anything that can restore Americans’ trust in Congress is a good thing,” Miller said.",
    "It is illegal for members of Congress, or any American, to engage in insider trading.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "“To become a member of Congress is an extraordinarily prestigious thing.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "But it is not compulsory,” Hedtler-Gaudette said.",
    "If there were ever a time to join us, it is now.",
    "“We’re a free market economy,” Pelosi said.",
    "Thank you.",
    "?"
  ]
}