{
  "id": 7353,
  "mediaId": 2526,
  "date": "2022-04-08",
  "headline": "House Democrats Push Back on Joe Biden’s Ending of Title 42",
  "image": "https://media.breitbart.com/media/2021/04/GettyImages-1074718560-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/08/house-democrats-push-back-joe-bidens-ending-title-42/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sean Moran",
  "authorUrl": "https://www.breitbart.com/author/sean-moran/",
  "termIds": [
    4905,
    5688,
    4185,
    3942,
    3075,
    1973,
    2765,
    2459,
    2475,
    392,
    387
  ],
  "sentences": [
    "Golden, a swing district Democrat, said in a statement on Thursday, “The Biden Administration is not currently prepared for a large increase in border crossings.” The Maine Democrat said ending the Trump policy would be “irresponsible and could create crisis conditions that would be dangerous for both migrants coming to America and Americans themselves.”\nReps. Tom O’Halleran (D-AZ), August Pfluger (R-TX), Stephanie Murphy (D-FL), Brian Fitzpatrick (R-PA), Chris Pappas (D-NH), Don Bacon (D-NH), Greg Stanton (D-AZ), and Maria Elvira Salazar (R-FL) cosponsored the legislation.",
    "Kyrsten Sinema (D-AZ), Mark Kelly (D-AZ), James Lankford (R-OK), John Cornyn (R-TX), Joe Manchin (D-WV), Shelley Moore Capito (R-WV), Jon Tester (D-MT), Rob Portman (R-OH), Maggie Hassan (D-NH), Thom Tillis (R-NC), and John Thune (R-SD) sponsored the Senate version of the bill.",
    "House Democrats and Republicans unveiled legislation that would block President Joe Biden from ending Title 42, the regulation that makes it easier for the federal government to deport illegal aliens and border crossers.",
    "The broad public health authority serves as a border control measure which allows federal immigration officials to quickly return border crossers and illegal aliens to their native countries.",
    "A recent poll found that 55 percent of Americans oppose ending Title 42, including 37 percent of swing voters who strongly oppose Biden’s decision to end Title 42.",
    "This could result in potentially 500,000 people arriving at the border every month, more than double the current illegal immigration levels.",
    "Biden officials have admitted that ending Title 42 would likely lead to a wave of border crossers and illegal aliens at the border.",
    "Customs and Border Protection (CBP) Commissioner Chris Magnus said the move would “certainly” increase illegal immigration.",
    "“We are seeing thousands of migrants who are waiting to cross the border once Title 42 is rolled back,” Gonzalez said.",
    "Mark Kelly (D-AZ) and Kyrsten Sinema’s (D-AZ) legislation that would block the White House from ending Title 42.",
    "Reps. Jared Golden (D-ME) and Tony Gonzales (R-TX) introduced the House version of Sens.",
    "He cautioned that ending Title 42 would put a significant strain on border towns.",
    "Sens."
  ]
}