{
  "id": 7638,
  "mediaId": 2589,
  "date": "2022-04-06",
  "headline": "Midterm signals: Kelly looking to break out of Biden's orbit",
  "image": "https://media.townhall.com/townhall/reu/o/2011/182/9e0d4e74-7550-493c-9a75-53d2acc8d8e6@news.ap.org-1110x740.jpg",
  "link": "https://hotair.com/ed-morrissey/2022/04/06/midterm-signals-kelly-looking-to-break-out-of-bidens-orbit-n460450",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Morrissey",
  "authorUrl": "https://hotair.com/author/ed-morrissey",
  "termIds": [
    2765,
    2459,
    3401,
    5879,
    4905,
    5712,
    392,
    1444,
    1126,
    5949
  ],
  "sentences": [
    "After sixteen months of sucking up to progressives and even throwing his colleague Kyrsten Sinema under a bus or two along the way, the stench of Joe Biden won’t easily evaporate around Kelly’s re-elect bid:\nThe Arizona Democratic senator is breaking palpably with the president as he pursues a full six-year term this fall in a once-reliable red state that’s recently become fertile territory for Democrats.",
    "Though Kelly has at times sought distance from the president on the border and economic issues during his 16 months in Congress, his recent run of schisms with the White House demonstrates that it’s not just Sen. Kyrsten Sinema (D-Ariz.) calling her own shots in the Copper State.",
    "And his criticism of Biden’s approach to the southern border only grew louder after the White House reversed the Trump administration public-health order known as Title 42, potentially clearing the way for more immigrants seeking asylum to enter the country.",
    "Though Democrats are used to Sinema and Sen. Joe Manchin (D-W.Va.) bucking them, Kelly’s vote against David Weil to be wage administrator for the Labor Department shocked party leaders, according to one Democratic senator supportive of the nomination.",
    "Brnovich’s history as a former John McCain aide might not win him a lot of favor in the GOP primary, but Brnovich would likely make lots of reference to it in a general election in a state where McCain still remains a well-like figure.",
    "He’s trying to distance himself so much now that Politico has taken notice of it, and that spells doom for Biden’s attempts to push his progressive Build Back Better agenda under new branding in the next few weeks.",
    "Republicans have a primary fight that AG Mark Brnovich appears to be leading comfortably so far despite worries among the base that he might not be conservative/populist enough for the GOP at the moment.",
    "This kind of abandonment by Kelly and other endangered Democrats will make Biden either pull a Clintonesque triangulation or (more likely) end up a lame duck in the second year of his presidency.",
    "The GOP is almost certain to take control of the House anyway, and Kelly’s rebranding shows that Chuck Schumer should be worried about ending up as Senate Minority Leader again.",
    "Kelly tied himself to Biden and the progressive agenda when even Sinema resisted it, and that’s a track record that won’t get erased by Kelly’s sudden Biden remorse.",
    "Republicans have a 3.5-point lead on the generic congressional ballot in the RCP aggregation, a red-wave lead that they haven’t relinquished in five months.",
    "There hasn’t been much polling done in Arizona, and nothing at all for months (oddly), but what little there has been doesn’t look promising for Kelly.",
    "We can however assume, based on Kelly’s recent attempts to escape the Biden stench, that his internal polling hasn’t shown any improvement.",
    "Kelly’s trying to get ahead of the tsunami, but his belated embrace of the middle is almost certainly not going to fool Arizona voters.",
    "His incumbency didn’t do Kelly any favors even when Joe Biden’s job approval numbers looked considerably better than they do now.",
    "As Politico reports, that’s the emerging strategy for the Senate Democrat, but it’s almost certainly too little and too late.",
    "In fact, he didn’t get above 44% in head-to-head polling against any of the GOP’s primary candidates either.",
    "Kelly, however, didn’t get above 46% in head-to-head polling against Brnovich last year.",
    "There’s no plan,” Kelly said in an interview, referring to the Title 42 rollback.",
    "“I tell them when I think they’re not getting stuff right, like in this case.",
    "Can Mark Kelly run for re-election as a flinty independent in Arizona?",
    "It probably spells doom for Democrats in 2022 and 2024, too.",
    "Of course, those public polls were taken months ago."
  ]
}