{
  "id": 7683,
  "mediaId": 2572,
  "date": "2022-03-31",
  "headline": "'The Ingraham Angle' on midterm elections",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/50a47da1-6501-4ed0-b031-d163317eedc6/c0aee7af-94d6-4b01-92f4-64129e1d4375/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/the-ingraham-angle-on-midterm-elections",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "And even the dashing, and of course, the other thing that we just saw which is that transient immune suppression, the fact that your white blood cells are suppressed for seven days after getting the shot -- how many people do we know just in our own lives who got the shot and then got COVID right away in the next week, and the same people who said you need to be locked down in your house and hide for a year, year and a half, they didn't say you need to be super careful for a week after you get the shot.",
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "And, in fact, it's completely illegitimate to have issues with the 2020 election, problems - whether it's about the media corruption, or big tech censorship, or all of the changes to laws, the hundreds of changes of laws and processes that--\nINGRAHAM: Well, Wisconsin had some problems with the 2020 election.",
    "Or are we trying to say to them, black people steal, and they are also going to be able to get away with it, and you can't because you are white and we're held to a higher standard of care, they're held to a lower standard of care, because that's what they do.",
    "(END VIDEO CLIP)\nINGRAHAM: Perhaps more troubling, Senator Grassley presented an August 2017 wire transfer from a Chinese government-linked company through Wells Fargo Clearing Services for $100,000 that stated further credit to Owasco, a Hunter Biden firm.",
    "You already see what they've tried to unleash against Florida Governor Ron DeSantis, lie about his parental rights legislation, lie about his COVID record, even tried to criticize them when he was with his wife at her last chemotherapy appointment.",
    "They see the disasters of Biden's policies assaulting our constitutional liberties, including a very liberal Supreme Court Justice nominee who we can expect to undermine our free speech, undermine religious liberty, undermine the Second Amendment.",
    "But because Democrats are incapable of moderating their views or abandoning radicalism, they revert to their old strategy, try to ban their opposition or prevent Trump from running again, or disqualify anyone who ever agreed with him on anything.",
    "If not, his failure to disclose income from right-wing organizations, recuse himself from matters involving his wife, and his vote block the January 6th commission from key information must be investigated and conserve as grounds for impeachment.",
    "(BEGIN VIDEO CLIP)\nKATE BEDINGFIELD, WHITE HOUSE COMMUNICATIONS DIRECTOR: Obviously, President Biden is very focused on ensuring that we minimize fluctuations as much as possible at the gas pump and prices in general for American families.",
    "(COMMERCIAL BREAK)\nINGRAHAM: Now, at a time when Republicans are accused of being racist for even questioning Ketanji Brown Jackson judicial record, the left is launching another disgusting campaign to silence Justice Clarence Thomas.",
    "Speaking of outrageous scandals, I got to give props to NBC, because they're reporting that as much as $80 billion, or 10 percent of the $800 billion handed out in COVID cash known as the Paycheck Protection Program was stolen.",
    "So, yes, Hunter Biden took millions from folks in Russia, the wife of the mayor of Moscow, took millions from Ukrainian energy company and took millions of dollars from companies with connections to the Chinese Communist Party.",
    "JORDAN: Well, think of the - the obvious comparison, look what they're doing to the wife of a Supreme Court justice, who is simply engaging in her first amendment rights to advocate and talk about issues that she cares about.",
    "I mean, that is so - the country, again, is so much smarter than these Democrats in Washington and the press in Washington, who thinks they're just so much more smarter than the - than this folks across the flyover country.",
    "The first, that there's essentially little or no benefit for people who already were infected, which is the opposite of what they wanted the message to be, which is they wanted a simpler message rather than a true message.",
    "I will give the other side their argument that well, maybe this person was poor, wasn't this person wasn't loved enough, maybe this person this, maybe Will Smith really lost it and was dealing with a lot at the Oscars.",
    "JANE MAYER, NEW YORKER CHIEF WASHINGTON CORRESPONDENT: I - you know, I mean - the Hunter Biden story is - Hunter Biden is being investigated by the Justice Department and by the IRS, as I understand it at this point.",
    "Just big tech and big media and the Democrat party, all colluded along with 51 former Intel people, all colluded to keep this information from the American people just days before the most important election we have.",
    "First off, it's worth noting, speaking of the ACLU, that Judge Reinhardt in the Ninth Circuit in California, his wife was serving as Executive Director of the ACLU, while he was deciding cases that involved the ACLU.",
    "So the Democrats are in a complete pickle, and these leaves, what, Pete Buttigieg, as Ted Cruz just said, or maybe what's his face in Texas whose name I always forget who is running in Texas -- yes, Beto O'Rourke.",
    "And honestly, what I think is going on here makes me ask the question, are we really so stupid, or do they think we are so stupid as to believe that racial injustice is the way to achieve racial justice?",
    "If we allow them to see the unfair treatment of anyone, black, white, brown, any color, then they are going to grow up confused and in a world of division, and that's honestly what this party wants.",
    "A new Harvard-Harris poll finds her favorability at a putrid 38 percent, and with Democrat fears that Joe Biden wont' seek reelection in 2024, they are confronting perhaps an even bigger challenge.",
    "Joe Biden wants to spend $22 billion more, and that doesn't even count the $5.8 trillion budget he just introduced, which oh, by the way, had record tax - historic tax increases in that budget.",
    "Secondly, and perhaps more alarming given what we just heard from Pfizer's CEO, the vaccine was actually increasing the chances that you got COVID in the seven days following the inoculation.",
    "CYNTHIA GARRETT, EDUCATION ACTIVIST: Well, Laura, if you look at what is going on here in most of our Democrat-led cities, we've also introduced race-based prison and punishment and arrests.",
    "And for all their tough talk against autocrats like Putin, they prefer their own brand of autocracy, where only they and their big tech oligarchs, not the voters, get to decide who's worthy.",
    "Lying about him, continuing a campaign of attempted destruction, and it hasn't worked, and he's had a very successful time as a Supreme Court justice because he has resisted these attempts.",
    "D'SOUZA: The Democrats, in a sense here, are getting their own karma by not playing by the normal rules, had they essentially picked the second highest vote getter in the Democratic Party.",
    "They're all insurrectionist and racist and anti-LGBTQ, and just mean people who want to burn up the planet, gun nuts trying to drive their huge trucks to complain at school board meetings.",
    "(BEGIN VIDEO CLIP)\nSEN. CHUCK GRASSLEY (R-IA): Our report exposed extensive financial relationships between Hunter and James Biden and Chinese nationals connected to the communist regime.",
    "And seeing the writing on the wall, Pelosi knows that her party's about to get shellacked, because they're getting dragged down by a president who seems to be decomposing before our eyes.",
    "Adverse events were generally milder and less frequent in participants of the older group compared with the younger group, and overall tended to increase with the increasing vaccine dose.",
    "(BEGIN VIDEO CLIP)\nJOE BIDEN, PRESIDENT, UNITED STATES OF AMERICA: I'm going to stay on my message that I've started off saying, we have to restore the dignity and honor of the office.",
    "Joining me now, Mollie Hemingway, Fox News contributor, editor-in-chief of The Federalist; and Wendy Long, former New York Senate candidate and former clerk to Justice Clarence Thomas.",
    "Now, once again, Democrats are guilty of what they accuse Trump of, whether we're talking Stacey Abrams in the 2018, Georgia governor's race; or Hillary in the 2016 presidential race.",
    "10 different cases with people with child pornography--\nINGRAHAM: But how do these democrats go to their constituents, Senator, and say, I'm here for your vision of the Constitution?",
    "You know, one of the most powerful things is those little stickers that are appearing all over the country with a picture of Joe Biden pointing at the gas price saying, I did that.",
    "The holding back of the internal documents, if they want to be transparent and say we are doing our best, we are hoping for the best, here are the documents, let's talk about them.",
    "(BEGIN VIDEO CLIP)\nREP. HAKEEM JEFFRIES (D-NY): It is deeply troubling that the wife of a Supreme Court justice appears to have been intimately involved in peddling the big lie.",
    "Arguably Malcolm X is right, maybe they are extremely dangerous to cause of actually the elevation of black people, because what do they want us to tell little white children?",
    "(BEGIN VIDEO CLIP)\nBRIAN LAUBACH, ASSISTANT SUPERINTENDENT, CLOVER PARK PUBLIC SCHOOLS: -- dispersing discipline across the ethnicities, the racial groups, equitably, right.",
    "I think with Kamala Harris, that's a mystifying element to her because she has remarkability in which she can speak, and it's layers and layers and statement upon statement.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: What if, just saying, like my background, what if that type of rule that we broke was more acceptable at my house versus your house?",
    "(END VIDEO CLIP)\nINGRAHAM: Now, Democrats somehow think that pleasing the press, which is obviously obsessed with hating Trump, is the same thing as pleasing the voters.",
    "\"The L.A. Times\" reports that \"Harris, in her toughest hour, is keeping a, quote, \"tighter circle,\" one that occludes her husband Doug Emhoff, and sister Maya Harris.",
    "But I think with Kamala Harris, public incoherence has obviously now become -- we know with Biden, he can stumble and he can stutter, but you can pick up his meaning.",
    "(LAUGHTER)\n(END VIDEO CLIP)\nINGRAHAM: There you have it, Kamala's entire vice presidency distilled into a five-second stumble and then false expression of optimism.",
    "So there is a certain kind of dementia, I think, here, in not only doing this, but then patting yourself on the back as if you're taking a courageous moral stance.",
    "Unfortunately, it will affect the lives of others, and likely the lives of the people you love the most, which are the people that usually you are in contact with.",
    "Now, things are so bad for the White House that Donald Trump kicked off Twitter and Facebook is more influential in many ways than the Liberals currently in power.",
    "If he decides that he can't run or he's not going to run, probably won't run, it's going to be very difficult for them not to open the door to allow her to run.",
    "That's on top of the $90 billion to $400 billion, that's a big scam there, believed to have been stolen from the $900 billion COVID unemployment relief program.",
    "GARRETT: You know what, it's tragic, because honestly, when I looked at this story tonight, it made me think about Will and Chris Rock, and just what happened.",
    "(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nALBERT BOURLA, CHAIRMAN AND CEO OF PFIZER: The decision not to vaccinate will not affect only your health or your life.",
    "But never, under the federal statute or in any experience, had judges been forced to recuse for their own political beliefs, much less those of their spouse.",
    "PHIL KERPEN, PRESIDENT, THE COMMITTEE TO UNLEASH PROSPERITY: I think it's very embarrassing for them, particularly the two things that we just talked about.",
    "She's already laying the grain - groundwork for the possibility that her party may not accept the results of the midterms if Republicans take over Congress.",
    "And while Senator Cruz's colleagues are not slowing down their investigation to the Biden family's corrupt connections, here was Senator Grassley yesterday.",
    "On a question of life, in the next couple of months, the Supreme Court may well overturn Roe vs. Wade, sending the question of abortion back to the states.",
    "Congressman, not one more penny should be spent on the COVID issue until this fraud is fully investigated and the government claws some of this money back.",
    "INGRAHAM: And, Wendy, you just wrote a fantastic piece for The Federalist, noting that, \"Judges are never asked to recuse themselves over political views\".",
    "Look what they're trying to do to her compared to the son of the commander-in-chief who took money from companies connected to the Chinese Communist Party.",
    "Biden once (inaudible) Senate Judiciary chair for eight years, and he still thinks what the Justice Department, or Senate Judiciary can force a recusal.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: As an investigative reporter, do you look at the Hunter Biden story and say, there's a lot more to dig into here?",
    "I think he ruined -- if he was trying to build his career on being the great likeable guy, which I always saw him as, he kind of blew it in one night.",
    "Honestly, I've been amazed at social media because there are a lot of people who were saying hey, you know what, he actually needs to get in trouble.",
    "SEN. CORY BOOKER (D-NJ): And he has hurt the legitimacy of the court and he should resign - excuse me, he should recuse himself from future matters.",
    "KERPEN: I think we've done a very, very poor job of giving advice that's tailored to individuals and looking that risk and benefit for individuals.",
    "And not content with their efforts three decades ago, Democrats are once again engaging in a vicious takedown attempt of Justice Clarence Thomas.",
    "They - he bugs them more than anyone else out there really, because he's a strong black man who doesn't sing the song that they want him to sing.",
    "But to me, today, passing federal laws against lynching is like passing federal laws against which burning or federal laws against cannibalism.",
    "We all know, of course, the cases of young healthy men, athletes, having some cardiac issues, some transient issues, but some not, some fatal.",
    "It's tough to trust science, isn't it, when Pfizer won't release their internal findings to the public, but now that's beginning to change.",
    "MOLLIE HEMINGWAY, EDITOR-IN-CHIEF, THE FEDERALIST: Particularly with Clarence Thomas, they've been trying to destroy this man for 30 years.",
    "Mollie, these people will not stop until all their political opponents are silenced, destroyed, canceled, at least that's what they hope.",
    "Now, Wendy, here's how Joe Biden responded when asked if Justice Thomas should recuse himself from cases involving January 6th, or Trump?",
    "And now they have to live with the fact that here is someone politically in a sense unable to present herself before the American people.",
    "In fact, unless they're Republicans like, I don't know, Liz Cheney and Mitt Romney, Democrats don't really think you should exist at all.",
    "INGRAHAM: They know Kamala Harris is a disaster and we're going to get into more of that later, but they know she's a complete disaster.",
    "Those things get into legal issues that, in fact, I told you, I would not tell the Justice Department what position to take or not take.",
    "She told, House Democrats today, \"It's up to an individual justice to decide to recuse himself if his wife is participating in a coup.\"",
    "So now we are saying what, minority students, they are implying that they don't have rules at home, so they can break rules at school?",
    "So they're so desperate now for traction, they're even going back to the character assassination that Biden took part in 31 years ago.",
    "I can see that you're at the airport, and it's typically of you to not say no to joining us even when you're trying to catch a flight.",
    "The Wall Street Journal just did a big expose showing that the big problem is judges not recusing when there's a financial conflict.",
    "UNIDENTIFIED FEMALE: White House phone records that were given to the House January 6th committee show a more than seven-hour gap.",
    "But they think by sending the comms director out, they can spend their way out of high gas prices and call it Putin's price hike.",
    "And pharmaceutical giant Pfizer was forced by a federal judge to release internal docs related to the licensing of the vaccine.",
    "With Kamala Harris, you are able to listen with a sort of almost anthropological fascination and you're like, what did she say?",
    "INGRAHAM: Biden, Dinesh, signed a bill today making lynching of federal hate crime, and Kamala's comments, I'll let you react.",
    "It's so demeaning, Laura, it makes me so angry as a mom, as someone who mentors into the lives of children and their children.",
    "Hence, you're seeing all the hyperventilation in the regime media about possible Trump White House criminality around Jan 6th.",
    "Don't forget, USA made Freedom Matters gear on LauraIngraham.com, proceeds go to Samaritan's Purse, help the Ukrainian people.",
    "And so, the White House, you heard her there just say, Putin's inflation, because they think the American people are foolish.",
    "INGRAHAM: The numbers for Kamala Harris against Trump, if, let's say, they tried to jettison Biden, these are all ifs here.",
    "INGRAHAM: But this is why every time Fauci was asked about this, Phil, you remember he was very smart, he was very careful.",
    "Joining me now is Cynthia Garrett, education activist, founder of Cynthia Garrett Ministries, author of \"I Choose Victory.\"",
    "KERPEN: Because they didn't want -- because everything they've done for two years, it has not been about telling the truth.",
    "I suppose theoretically you could say it's occurring somewhere someplace, but this is hardly a national or social problem.",
    "If this had happened to any other black person who didn't have privilege and standing, they would be arrested for assault.",
    "All right, it's no secret that Kamala Harris has struggled in her VP role, but could it be even worse than we all thought?",
    "Cynthia, the year is 2022, and we are now, it seems, his own words, introducing race-based considerations in discipline.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: Are you dispersing discipline across the ethnicities, the racial groups equitably?",
    "The price of gas had risen over 50 percent before Putin invaded Ukraine, before Biden's weakness invited that invasion.",
    "More precisely, these were Chinese nationals connected to the Chinese government's military and intelligence's service.",
    "Remember, they wanted to release it in 75 years, but a federal judge came in and said no, no, we are forcing your hand.",
    "The whole basis for recusal for a judge, Laura, is whether there's a financial or a personal - it's usually financial.",
    "But I think this matters here, because in 2016 Trump led in just a handful of head-to-head match-ups against Clinton.",
    "And crime will get worse in the streets and the Democrats will claim, they didn't support that when she rules that.",
    "(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\n(APPLAUSE)\nKAMALA HARRIS, (D) VICE PRESIDENT OF THE UNITED STATES: All good.",
    "I thought it was fine to grab that piece of pizza before anybody else because at my house I'm allowed to do that.",
    "They don't like that he's such a constitutionalist that he cares about the original meaning of the Constitution.",
    "And people from Montana, Jon Tester; and Arizona, Mark Kelly, they all want their Second Amendment rights gone.",
    "Now, listen closely to House Speaker Nancy Pelosi because she's signaling Democrats very dark and devious turn.",
    "And if democracy didn't work, well, the logical conclusion would be to invalidate the election results, right?",
    "The disaster - we're seeing Jimmy Carter 2.0, hyperinflation, stagflation, disasters abroad, a weak president.",
    "Washington State officials pushing for school punishment to be judged on the basis of the race of the student.",
    "And I look at actually the administration of justice unfairly, and it brings up so much to think about, Laura.",
    "(BEGIN VIDEO CLIP)\nKAMALA HARRIS, (D) VICE PRESIDENT OF THE UNITED STATES: Lynching is not an act of the past.",
    "Dinesh, the article also notes that Harris believes that her race and gender are the reasons for unpopularity.",
    "So, are you paying attention to all of that data on what are their backgrounds, ethnicity, that sort of thing?",
    "AL SHARPTON, CIVIL RIGHTS LEADER: I think that it was hopeful to be able to see this legislation finally pass.",
    "And yet, she's wildly unpopular, and no sense that she's going to change course to make herself more popular.",
    "D'SOUZA: As far as I'm aware, there hasn't been a lynching in America in the old style for at least 40 years.",
    "But there's also this dangerous rhetoric that you're not allowed to have any problems with the 2020 election.",
    "Look, I think about $250 billion lost or stolen, $300 billion of COVID money that's out there that's unspent.",
    "Now if he doesn't run, they'll do the same to any Republican candidate who steps in to try to fill that void.",
    "A shocking story out of Washington state, where school officials are now pushing for disciplined reparations.",
    "CRUZ: Well, I think you're going to see Kamala and Pete Buttigieg in a death battle, Mad Max at Thunderdome.",
    "First, Pfizer's own trail showed that those who were previously infected were protected from severe disease.",
    "Joining me now is Phil Kerpen, president of the American Commitment and the Committee to Unleash Prosperity.",
    "(BEGIN VIDEO CLIP)\nJOY REID, MSNBC HOST: And we're learning now of a new gap in another White House record.",
    "FDR, for example, was able to cement his alliance with southern Democrats by blocking antilynching laws.",
    "In other words, natural immunity was known to these vaccine makers and still remained taboo to discuss.",
    "She signaled that and that soundbite on that whatever that was, podcast, they're a threat to democracy.",
    "I expect what you just played from Nancy Pelosi, it's going to get worse between now and Election Day.",
    "(BEGIN VIDEO CLIP)\nREP. NANCY PELOSI (D-CA): It is absolutely essential for our democracy that we win.",
    "INGRAHAM: And this is why I want to know what was really said in that phone call between Biden and Xi.",
    "INGRAHAM: Someone said it would've been more interesting if Jada had gone up there and done the slap.",
    "CRUZ: They ignore their constituents and they count on the court--\nINGRAHAM: Kick them out of office.",
    "Now, look, any poll is just a snapshot in time, and it will make too much of it and it's very early.",
    "Meanwhile, voters see now that everything Biden, Democrats and the media told you in 2020 was a lie.",
    "UNIDENTIFIED FEMALE: Jab at Biden's age, as if there is something wrong with being a senior citizen.",
    "Joining me now is Dinesh D'Souza, conservative commentator and host of \"The Dinesh D'Souza Podcast.\"",
    "(END VIDEO CLIP)\nINGRAHAM: Congressman, so that means that this shouldn't be discussed in the media?",
    "By the way, here's how the media thinks they're handling the coverage of the Hunter Biden scandals.",
    "They don't like what they see, and yet, you are right, the Democrats to a degree are done with her.",
    "We just passed another million illegal immigrants in this fiscal year and we're in March right now.",
    "(COMMERCIAL BREAK)\nINGRAHAM: It turns out that nothing can stop Al Sharpton from getting on camera.",
    "It's been about telling what they think you need to hear to behave the way they want you to behave.",
    "They wanted a simple message, everyone needs two shots, everyone needs --\nINGRAHAM: Four shots now.",
    "These polls are just showing us that Americans genuinely are regretting their votes for Joe Biden.",
    "(BEGIN VIDEO CLIP)\nDONALD TRUMP, FORMER PRESIDENT OF UNITED STATES OF AMERICA: Joe Biden is weak.",
    "And when they do, we must all have the courage to name them and hold the perpetrators to account.",
    "And I think as Senator Cruz just said, there's a good chance we take back the majority this fall.",
    "We just got to highlight it, because the American people are so fed up with this administration.",
    "(END VIDEO CLIP)\nINGRAHAM: In other words, similar transitions may not mean similar punishments.",
    "INGRAHAM: Because West Virginians want their Second Amendment rights totally turned upside down.",
    "It's a point of conversation, but it's not insignificant 15 months into Biden's administration.",
    "But what we have to do in Congress is exactly what Senator Grassley, Senator Johnson are doing.",
    "HEMINGWAY: The private takeover of government election offices through Mark Zuckerberg funding.",
    "And no one ever breeds a word of a suggestion that she should recuse herself on abortion cases.",
    "Kamala, that same poll has her losing to Donald Trump by 11 points in a hypothetical matchup.",
    "But you can listen for minutes on end, and then realize that she has done absolutely nothing.",
    "Everything about the situation is pretty much the same, except one is black and one is white.",
    "INGRAHAM: Cynthia, another Washington state school board member tried to justify this policy.",
    "INGRAHAM: Do you think, Romney is going to ultimately vote for Judge Jackson to confirm her?",
    "And how long will vulnerable Democrats in choppy waters tie themselves to the sinking anvil?",
    "How many Democrats talk about silencing free speech, or taking away your religious liberty?",
    "I got to tell you, the American people don't want if Judge Jackson becomes Justice Jackson.",
    "Their latest talking point - they've got a lot of hope on this, is it's all Putin's fault.",
    "And amazingly, their foreign policy is even worse than their domestic and economic policy.",
    "This is - this Rush Limbaugh had a book (inaudible) several years ago, See, I told you so.",
    "It wasn't really a slip, and Democrats are content with using AOC as their battering ram.",
    "I mean, I'm quite sure that Justice Thomas and his wife wouldn't agree with that concept.",
    "And there's this attempt to just make it, where you can't talk about those things at all.",
    "Like throwing away decades of what they know about coronaviruses and previous infections.",
    "(END VIDEO CLIP)\nINGRAHAM: Dinesh, they have a very, very dismal view of America in 2022.",
    "UNIDENTIFIED FEMALE: What exactly was ex president - the ex President doing on January 6?",
    "And when I'm talking to them, I'm like hey, you know what, actually, I thought I was OK.",
    "These people think that in this century, in 22 - 2022 wives are owned by their husbands?",
    "He's angry, he's cranky, he's illogical, but he's conveying what he's trying to convey.",
    "They just adopted a new policy which they are calling culturally responsive discipline.",
    "Almost everything Trump predicted would happen under a Biden presidency is coming true.",
    "And by the way, what she means by stolen is people showed up to vote against Democrats.",
    "They pretend, they don't believe it and then they try to ram that that agenda through.",
    "So are you disciplining African American boys more than you are discipling white boys?",
    "So, her plans for a course correction don't look like they're going to help with much.",
    "Not to mention all the bad things that have happened with policy decisions they made.",
    "INGRAHAM: Now, Biden's Communications Director made a rare appearance today, Senator.",
    "Everybody knew she was an activist, a pro-abortion activist for years with the ACLU.",
    "Normally, that wouldn't matter when it comes to being punished, right, it shouldn't.",
    "Justice in and of itself is about equality in administration, not about inequality.",
    "And picture this -- two students are punished for skipping, let's say, math class.",
    "That kind of spending, that kind of lack of oversight, big government going crazy.",
    "We knew that in the beginning that this was going to be a honeypot for scamsters.",
    "We just got our hands on the first document, and the details inside are shocking.",
    "INGRAHAM: Cynthia, I know everybody wants you to -- just one line on Will Smith.",
    "They want nine unelected lawyers to mandate every policy outcome in the country.",
    "Now, suddenly, the American people are seeing the price of everything skyrocket.",
    "And they were not going to say anything that would reduce uptake of the vaccine.",
    "KERPEN: Now we're up to three, now we're up to even five for immune suppressed.",
    "Joining me now in studio, it's so great to see him, is Texas Senator Ted Cruz.",
    "And Biden's team thought they'd boost his popularity by sending him to Poland.",
    "UNIDENTIFIED MALE: Learning of what appears to be a massive and blatant cover.",
    "I'm so tired of the whole story, but one line or a couple lines on Will Smith.",
    "And Will Packer, who produced the Oscars for I believe it was the first time.",
    "They deserve to steal because they come from something different than you do.",
    "The Ugly Truth is the self-proclaimed defenders of democracy hate our system.",
    "(END VIDEO CLIP)\nINGRAHAM: OK. We're going to have a lot more on that story.",
    "Joining me now is Congressman Jim Jordan, Ranking Member of House Judiciary.",
    "HEMINGWAY: Well, that's why I think--\nINGRAHAM: That's always been the case.",
    "And so it seems that there's no shortage of legal interest in Hunter Biden.",
    "They support justices who disregard the plain language of the Constitution.",
    "The Harvard Harris poll has them up by a significant margin of six points.",
    "They've run out of strategies, and they're going back to the old playbook.",
    "And at least, Nancy Pelosi, though, guys, knows how recusals kind of work.",
    "Plus, more from that story that we told you about at the top of the show.",
    "We have just taken a look at a brand-new Pfizer document from May, 2021.",
    "If something is a threat to democracy, you cannot accept it as a result.",
    "He is doing everything he can to combat Putin's price hike here at home.",
    "Now, this time, they're using his wife's personal activism against him.",
    "I fear for our democracy if the Republicans were ever to get the gavel.",
    "He's one of the most popular presidents we've had in the last 50 years.",
    "That's, again, why I think the American people are so fed up with this.",
    "She's already saying it's race and gender that's making her unpopular.",
    "Smear and try to, I guess, just cancel people with whom they disagree.",
    "You look at the White House in 15 months, their messages on inflation.",
    "Now, Nancy's twisted thinking, democracy only works if Democrats win.",
    "UNIDENTIFIED MALE: The public widely thinks Biden is better on COVID.",
    "Now, Biden, of course, isn't the adult in the room that he promised.",
    "This is a rush transcript of \"The Ingraham Angle\" on March 29, 2022.",
    "(END VIDEO CLIP)\nINGRAHAM: They still think this is a comms problem.",
    "You may see Elizabeth Warren jumping; you may see Hillary come back.",
    "So it looks like all the Democrats likely are going to vote for her.",
    "They're going to make a change hopefully in a big way this November.",
    "I mean, Mollie, again, but they're so obsessed with Clarence Thomas.",
    "Judge Ginsburg - Justice Ginsburg had tons of conflicts of interest.",
    "The country gets this and they know how ridiculous that all sounds.",
    "That's who the Democrats are dreaming will come out of retirements.",
    "And voters are seeing that there are worse things than mean tweets.",
    "But for 15 months now, voters have been witnessing Biden in action.",
    "Copy: Content and Programming Copyright 2022 Fox News Network, LLC.",
    "They will make every city look like Democrat-run Portland, Oregon.",
    "(END VIDEO CLIP)\nINGRAHAM: Democracy is on the ballot in November.",
    "INGRAHAM: What does that mean for the Democrats rolling into 2024?",
    "Not according to the Clover Park school board in Washington state.",
    "They wanted to keep these documents back from the American people.",
    "It makes me angry, because what are we really trying to say here?",
    "How it's possible to do that is itself a kind of talent, I guess.",
    "Imagine what they would do if this was one of the Trump children.",
    "INGRAHAM: Well, she even criticized President Trump, as I recall.",
    "SEN. TED CRUZ (R-TX): Well, they're doubling down on the extreme.",
    "And their ace in the hole, they're counting on as Michelle Obama.",
    "The American people get - you spend trillions, trillions in debt.",
    "He's too scared to stand up to the radical left of his own party.",
    "(END VIDEO CLIP)\nINGRAHAM: Wait a second, is he at the gift shop?",
    "UNIDENTIFIED MALE: Joe Biden will be way better for the economy.",
    "They want to say, you have no right to make decisions like that.",
    "One, the January 6th committee; and two, the Justice Department.",
    "The American people see inflation galloping across the country.",
    "The family on the laptop - he's gone into hiding for five days.",
    "But the better question is, how low could Joe go in the polls?",
    "And he loves the Constitution, and they hate the Constitution.",
    "INGRAHAM: Dinesh, think about what's going on with this poll.",
    "If you and I commit a crime, we deserve the same punishment.",
    "INGRAHAM: Don't you sense that that's what's going on there?",
    "Just how desperate is Al Sharpton want to get on television?",
    "I'll give you a quick last word if you have another minute.",
    "She's already preparing to scream, the election was stolen.",
    "No one really thinks inflation is going to go anytime soon.",
    "There could be a lot of people probably run, or even worse.",
    "Then they said, it was a sign of how great the economy was.",
    "INGRAHAM: Dinesh, this will be fascinating to watch unfold.",
    "(END VIDEO CLIP)\nINGRAHAM: OK. Wendy, I'm crying, laughing.",
    "The Congresswoman tweeting, \"Clarence Thomas should resign.",
    "All of this, of course, is completely swept under the rug.",
    "(END VIDEO CLIP)\nINGRAHAM: Again, I am speechless at this.",
    "The left has been trying to cancel Trump since about 2015.",
    "A second poll and as many weeks has Trump winning in 2024.",
    "This copy may not be in its final form and may be updated.",
    "Discipline differs across racial lines later in the hour.",
    "And in this document, we find some startling revelations.",
    "But the truth is the country's already figured this out.",
    "He's one of the most consistent--\nINGRAHAM: Amazing man.",
    "But it doesn't matter because their agenda is a failure.",
    "The Democrats don't want the voters to have that right.",
    "This is THE INGRAHAM ANGLE from Washington, DC tonight.",
    "And they're not living in the wreckage of his policies.",
    "UNIDENTIFIED MALE: Donald Trump is a Russian operative.",
    "Worthy of being heard and worthy of running for office.",
    "HEMINGWAY: --justices, and that's the problem for them.",
    "(BEGIN VIDEO CLIP)\nBIDEN: I leave that to two entities.",
    "Again, lowering the bar for people never lifts them up.",
    "But no, they rigged the rules to benefit Kamala Harris.",
    "And there are subjects and verbs and objects involved.",
    "They wanted the Ukraine call with Zelenskyy and Trump.",
    "It puts them at the end of four years in Jimmy Carter.",
    "And if you look, they know their ideas are unpopular.",
    "(END VIDEO CLIP)\nINGRAHAM: Now, all of that happened.",
    "China would own our country if Joe Biden got elected.",
    "DINESH D'SOUZA, CONSERVATIVE COMMENTATOR: Absolutely.",
    "KERPEN: And about the human immune system in general.",
    "By the way, the party of lynching was the Democrats.",
    "They basically anointed her to be Biden's successor.",
    "We got to make sure we get all the facts out there.",
    "Mollie, Wendy, so good to have you both on tonight.",
    "He is one of the greatest Americans we've ever had.",
    "And remember, Democrats don't believe in democracy.",
    "They're not stressed so much about climate change.",
    "CRUZ: Her record on crime--\nINGRAHAM: What a joke!",
    "She will be the most liberal of the nine justices.",
    "The constitutional rights that you need protected.",
    "LAURA INGRAHAM, FOX NEWS HOST: I'm Laura Ingraham.",
    "And I'm not going to instruct the Congress either.",
    "(END VIDEO CLIP)\nINGRAHAM: Oh, aren't they lovely?",
    "It seems to be that's what he is clearly implying.",
    "What nastiness are we trying to slide past people?",
    "He happens to be a black man, if I'm not mistaken.",
    "She's obviously going to claim racism and sexism.",
    "Nobody is going to trust these people ever again.",
    "Racial acts of terror still occur in our nation.",
    "That's why they have another reason to hate him.",
    "It's one of the biggest scandals I've ever seen.",
    "These people are always vindictive, sore losers.",
    "They want the entire Electoral College scrapped.",
    "Senator, where does that put the Democrat party?",
    "Perhaps fanning the flames of the insurrection.",
    "INGRAHAM: Phil, it's good to see you in studio.",
    "He wants to be on camera, he'll get on camera.",
    "Here's another nugget from Pfizer's documents.",
    "WENDY LONG, FORMER JUSTICE THOMAS CLERK: Sure.",
    "But we don't want anyone slapping anyone else.",
    "But, of course, the message remained the same.",
    "Then they said, it was a high- class problem.",
    "We'll see what the Justice Department may do.",
    "And Biden isn't sharper than ever at his age.",
    "This used to be a problem in America history.",
    "Kamala Harris is trailing Trump by 11 points.",
    "That is a threat to their progressive agenda.",
    "He's one of the greatest man who ever lived.",
    "REP. JIM JORDAN (R-OH): Well, we don't know.",
    "Spurious attacks on Justice Clarence Thomas.",
    "You and I both clerked at the Supreme Court.",
    "And Nancy Pelosi is not going to go quietly.",
    "They see the border complete in total chaos.",
    "So more adverse reactions to younger people.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED FEMALE: Rev.",
    "All of the policies they have are disaster.",
    "The voters are not worried about January 6.",
    "And so - the American people aren't stupid.",
    "America is not more respected in the world.",
    "He doesn't even know the federal standards.",
    "But it is just their latest in a long-term.",
    "That's the Democrat America that they want.",
    "I'm looking at a roomful of white liberals.",
    "Just be careful they don't steal from you.",
    "INGRAHAM: Sotomayor will look like Scalia.",
    "Senator, I think they've run out of ideas.",
    "They're paying $6 and $7 a gallon for gas.",
    "And so right now, Democrats are panicking.",
    "It's why they hide from what they believe.",
    "How many Democrats talk about gun control?",
    "We've seen what they want justices to do.",
    "It's five lawyers in robes in Washington.",
    "Middle class Americans aren't better off.",
    "That's OK, black people deserve to steal.",
    "(END VIDEO CLIP)\nINGRAHAM: Trust science.",
    "But she's never going to let that happen.",
    "We linked it on - I linked it on Twitter.",
    "Even if she kind of wants to misuse them.",
    "Now, that's just the tip of the iceberg.",
    "Could you explain that for the audience?",
    "So Beto O'Rourke, I guess Amy Klobuchar.",
    "They moved her to the front of the line.",
    "More on that travesty later in the show.",
    "Conservatives are a threat to democracy.",
    "I don't think Joe Biden will run in '24.",
    "They didn't think we deserved the truth.",
    "Is that Shannon Bream's book behind him?",
    "CRUZ: They keep spending more and more.",
    "Democracy is on the ballot in November.",
    "No one will be safe in Biden's America.",
    "And by the way, what century are we in?",
    "I mean, just look at Justice Ginsburg.",
    "So he is trailing Trump by six points.",
    "Well, we all know how that turned out.",
    "That's the focus of tonight's 'Angle'.",
    "(END VIDEO CLIP)\nINGRAHAM: Oh, my God.",
    "And they also hate most of the voters.",
    "None of it is landing with the public.",
    "They're worried about $6 a gallon gas.",
    "And to be incredibly lenient on crime.",
    "CRUZ: They know they're going to lose.",
    "INGRAHAM: We weren't told any of this.",
    "That's what stealing the election is.",
    "Their policy is crashing and burning.",
    "I think even they know he is too old.",
    "This is not a communications problem.",
    "We are going to bring it to you next.",
    "That would have been more theatrical.",
    "Who else told you that two years ago?",
    "And it's ridiculous to talk this way.",
    "Read Wendy's piece in The Federalist.",
    "UNIDENTIFIED FEMALE: That was a slip.",
    "The documents, the emails were real.",
    "10 percent for the big guy was real.",
    "He didn't close the door completely.",
    "He's like we're still studying this.",
    "And I can't wait to hear Chris Rock.",
    "This is both ludicrous and pathetic.",
    "Trump's puppets are Putin's puppets.",
    "Biden doesn't have a China strategy.",
    "You'll have gas prices of $6 and $7.",
    "They wanted to hide it for 75 years.",
    "Congressman, where could this lead?",
    "CRUZ: --in particular, is terrible.",
    "And what was really going on there?",
    "We all told him, this was the case.",
    "What on earth is he talking about?",
    "The reality is it does not matter.",
    "Cynthia, great to see you tonight.",
    "It produces the inflation we have.",
    "But first, the voters are roaring.",
    "So look, I don't know what to say.",
    "I don't know who they'll go with.",
    "What happened to hope and change?",
    "It's always great to have you on.",
    "And I'll even go you one further.",
    "That's why they hate him as well.",
    "That's their judgment, not mine.",
    "That is un-American to say that.",
    "They don't believe in democracy.",
    "And they're still trying today.",
    "And they said, it's transitory.",
    "Religious liberty rights, gone.",
    "Hunter Biden's laptop was real.",
    "There was no Russian collusion.",
    "They got to know all the facts.",
    "What on earth is going on here?",
    "I'm having a Joe Biden moment.",
    "It was an assault and battery.",
    "I want to know what they said.",
    "And we know they're miserable.",
    "They said, it's not happening.",
    "I think it puts them in 1980.",
    "They're stressed about crime.",
    "HEMINGWAY: It's unbelievable.",
    "Children mimic what they see.",
    "I will give you the argument.",
    "Phil, there is so much here.",
    "And that's very un-American.",
    "I want the whole transcript.",
    "It's all unraveling at home.",
    "They want to pack the court.",
    "The Last Bite explains next.",
    "They didn't tell the truth.",
    "Biden did not defeat COVID.",
    "Now, remember their mantra.",
    "CRUZ: Nobody's buying that.",
    "I am very worried about it.",
    "INGRAHAM: Voters roar back.",
    "We have details in moments.",
    "The shocking details next.",
    "No one's serious at least.",
    "INGRAHAM: It's disgusting.",
    "That's it for us tonight.",
    "Where does this put them?",
    "This is a policy problem.",
    "Well, obviously it's not.",
    "We can't let that happen.",
    "Mollie, this is so petty.",
    "So I think trust science.",
    "I always forget his name.",
    "But they are in a pickle.",
    "That's the Biden agenda.",
    "I don't want China spin.",
    "I don't want Biden spin.",
    "The eyewitness was real.",
    "Yes, you heard it right.",
    "Biden can't do it again.",
    "You look at her record.",
    "And that's the 'Angle'.",
    "What else would you do?",
    "I want that transcript.",
    "Congressman, thank you.",
    "The details in moments.",
    "Again, it's a snapshot.",
    "That didn't hurt Obama.",
    "I want the transcript.",
    "They found the laptop.",
    "She's going to scream.",
    "Senator, great to see.",
    "People aren't stupid.",
    "It's so it's insipid.",
    "It's an epic failure.",
    "LONG: He has no clue.",
    "And I think it's sad.",
    "It wants us divided.",
    "It's out of control.",
    "Thank you very much.",
    "The laptop was real.",
    "It was all accurate.",
    "How low can they go?",
    "And they know Biden.",
    "What is their bench?",
    "ALL RIGHTS RESERVED.",
    "Texans buying that?",
    "CRUZ: I don't know.",
    "I forgot about him.",
    "Everyone knew this.",
    "How do they do it?",
    "CRUZ: --for them.",
    "We all know that.",
    "HEMINGWAY: He is.",
    "That's a typical.",
    "INGRAHAM: Right.",
    "It was all true.",
    "It was all real.",
    "It was accurate.",
    "INGRAHAM: Well.",
    "GARRETT: Never.",
    "I can tell you.",
    "What a concept.",
    "It's so stale.",
    "INGRAHAM: Yes.",
    "INGRAHAM: Yes.",
    "She's got it.",
    "JORDAN: Yes.",
    "Stay there.",
    "He doesn't.",
    "It's sick.",
    "CRUZ: Yes.",
    "Thanks.",
    "Watch.",
    "Watch.",
    "Why?",
    "REV.",
    "Why?",
    "Why?"
  ]
}