{
  "id": 7979,
  "mediaId": 2573,
  "date": "2022-04-05",
  "headline": "Sen. Tester becomes latest Democrat to oppose Biden move to end Title 42",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/GettyImages-1358087851.jpg",
  "link": "https://www.foxnews.com/politics/sen-tester-democrat-oppose-biden-move-title-42",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    2459,
    2765,
    3443,
    4873,
    4905,
    392,
    1126,
    5949
  ],
  "sentences": [
    "Sen. Jon Tester, D-Mont., on Tuesday became the latest Democratic lawmaker to oppose the Biden administration’s move to end the use of Title 42 to expel migrants at the border, warning that doing so prematurely risks national security.",
    "The Centers for Disease Control (CDC) announced on Friday that it will be ending Title 42, which has been used by both the Biden and Trump administrations to quickly expel migrants at the border due to the COVID-19 pandemic, on May 23.",
    "Tester’s letter comes after Democratic lawmakers, including some in tight re-election races, have urged caution over ending Title 42 over fears of a border surge that could eclipse last year’s record numbers.",
    "A growing number of Democrats have joined Republicans and border officials in warning against the move, warning that it could quickly lead to a surge in migrants that authorities are ill-equipped to handle.",
    "\"I'm strongly opposed to the Administration's decision to let Title 42 expire next month – which will only add to the strain on our broken immigration system,\" Tester said in a statement.",
    "The Montana senator said lifting the order \"is expected to cause a significant increase of migration to the United States and put more pressure on an already broken system.\"",
    "Sen. Maggie Hassan, D-N.H., meanwhile, said that ending the order \"will likely lead to a migrant surge that the administration does not appear to be ready for.\"",
    "\"I'm urging [Homeland Security Secretary Alejandro] Mayorkas to provide a comprehensive plan to address the increased security needed when Title 42 expires.\"",
    "The senator also sent a letter to Mayorkas, warning that \"ending this policy without sufficient preparation risks undermining our national security.\"",
    "Kyrsten Sinema and Mark Kelly have both written to and spoke with Mayorkas to express their concerns about it being lifted without proper planning.",
    "\"These problems do not only affect the southern border, but put more strain on those working to secure the northern border as well,\" he wrote.",
    "While he says the emergency order cannot be in effect indefinitely, \"we should not end this policy without ample preparation.\"",
    "The Biden administration itself has acknowledged that it is expecting a significant increase in numbers in the coming months.",
    "Sen. Joe Manchin, D-W.Va., described the move as a \"frightening decision\" while Arizona Sens."
  ]
}