{
  "id": 7983,
  "mediaId": 2636,
  "date": "2022-04-05",
  "headline": "Pandemic Aid Bill Stalls Amid Dispute Over Immigration Restrictions",
  "image": "https://static01.nyt.com/images/2022/04/05/us/05virus-briefing-congress-covid-aid1/05virus-briefing-congress-covid-aid1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/05/us/politics/coronavirus-pandemic-aid-immigration.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“So if the majority leader tries to move forward, we’ll have to have a discussion about a reasonable amendment process.”\nWhile Republicans have pushed for other amendments, the most politically fraught provision they hoped to put to a vote would bar the Biden administration from ending the Trump-era pandemic restrictions at the border, which have granted officials the ability to turn away migrants, including those seeking asylum.",
    "On Tuesday, Senator Jon Tester of Montana became the latest Democrat to ask the administration to provide “a comprehensive plan on how it will address the increased strain on our immigration system and increased security needs.”\nSome of those Democrats, including Senators Mark Kelly of Arizona and Raphael Warnock of Georgia, declined to say whether they would support a Republican amendment, given that text has not been released.",
    "In announcing plans on Friday to end the order in late May, the Centers for Disease Control and Prevention cited “current public health conditions and an increased availability of tools to fight Covid-19.” But Republicans argued that it was contradictory for the administration to implement that policy change while asking Congress to approve more pandemic aid.",
    "“We will continue to work with the House and Senate to move this vital legislation forward.”\nWhile the Senate can try to take up the measure again, the unsuccessful vote on Tuesday signaled that final passage of aid that the Biden administration has said is urgently needed may slip until later this month, when Congress returns from a two-week break.",
    "“It’s clearly a big issue with our members.”\nMultiple Democrats, including senators facing tough re-election contests in November, have said they have concerns about the decision to roll back the policy, given that it is expected to draw thousands more migrants to the southwestern border, where stations are already backed up and overcrowded.",
    "While lawmakers in both parties have said they support the money for vaccines, testing and therapeutics, Republicans blocked action on it on Tuesday, insisting that the chamber first vote to maintain the immigration policy, known as Title 42, which has restricted immigration at U.S. land borders since the beginning of the pandemic.",
    "WASHINGTON — An election-year dispute over immigration policy emerged on Tuesday as the latest obstacle to quick approval of a $10 billion coronavirus response bill, as Senate Republicans refused to advance the measure without a vote to keep in place pandemic-era border restrictions that President Biden has moved to lift.",
    "“The decision should be made by C.D.C., which it has been, and that’s where it belongs.”\nMr. Wyden, the only Democrat to join Republicans in opposing the procedural vote on Tuesday, said he did so because the bill would claw back some pandemic response money that had been set aside for local communities and tribes.",
    "“Getting that money replenished is significantly complicated by announcing in the same week that you’re going to determine that Section 42 of this effort to fight this disease is no longer necessary because the disease is no longer the same kind of problem it was,” said Senator Roy Blunt, Republican of Missouri.",
    "“Usually things have kind of a normal life cycle, and you’d hate to have them delayed by two weeks.”\nSenate Democrats are also pushing to confirm Judge Ketanji Brown Jackson to the Supreme Court as early as Thursday, further complicating the prospects of salvaging a quick vote on the pandemic money.",
    "Asked about the Title 42 amendment, he told reporters that “it should remain independent of the urgently needed funding that we talked about today to sustain our Covid response here domestically and our global response.”\n“This should not be included on any funding bill,” he added.",
    "“I’d like to move as quickly as possible,” said Senator Mitt Romney, Republican of Utah, who helped lead negotiations over the plan but opposed moving forward without a commitment to vote on the immigration issue and others.",
    "Democrats in both chambers have also grumbled over the decision to jettison $5 billion for global vaccination efforts, which was removed from the funding package after senators could not agree on how to pay for it.",
    "Democratic leaders declined to hold such a vote, which would expose deep divisions in their ranks over the Biden administration’s decision to wind down the order, and jeopardize passage of the broader package.",
    "Still, some House Democrats signaled they would reluctantly support the package and move to approve the global aid separately, as top White House officials urged Congress to swiftly pass the bill.",
    "“I cannot support siphoning off essential resources for rural communities, tribes and small businesses in Oregon and nationwide just to pad drug companies’ profits,” Mr. Wyden said in a statement.",
    "Senator Chuck Schumer of New York, the majority leader, said the legislation “should not be held hostage to extraneous unrelated issues,” and instead tried to push ahead with the funding package.",
    "“There’s still some time — I hope my Republican colleagues change their tune quickly,” Mr. Schumer said after changing his vote to “no,” a maneuver that allows him to move to reconsider the bill.",
    "Any agreement to speed it through the Senate would require the support of all 100 senators, and Republicans said they were unwilling to do so without guaranteed votes on proposed additions.",
    "Republicans blocked a move to bring up a $10 billion Covid response package after Democrats refused to consider amendments, including one to keep in place pandemic-era immigration curbs.",
    "Republicans refused to back any new money for responding to the pandemic, so negotiators had to agree on repurposing funds Congress already approved in previous legislation.",
    "Undocumented Immigrants: As it ends contracts and looks to reduce bed capacity at detention facilities, the government appears to be moving away from incarcerations.",
    "That would most likely kill the funding package in the House, where most Democrats have cheered the Biden administration’s decision to end the immigration rule.",
    "New Asylum Policy: The Biden administration has finalized a plan that would radically change the process for people seeking asylum in the United States.",
    "It could also put some of their members at risk of a backlash from voters at a time when Republicans have tried to portray them as lax on immigration.",
    "“It’s pure politics that Republicans insisted vital Covid assistance be drained to pay for this bill.”\nIsabella Grullón Paz contributed reporting.",
    "It should pass immediately, but it’s exactly that — just a start,” said Jeffrey D. Zients, who leads the administration’s coronavirus response.",
    "“It will require, I think, several amendments in order to get across the floor,” said Senator Mitch McConnell of Kentucky, the minority leader.",
    "“Today’s Senate vote is a step backward for our ability to respond to this virus,” said Jen Psaki, the White House press secretary.",
    "The move failed on a vote of 52 to 47, with one Democrat, Senator Ron Wyden of Oregon, joining all Republicans in opposition.",
    "The package would allocate at least $5 billion for therapeutics, as well as money for testing and vaccines.",
    "But if even one Democrat were to back it, the amendment could pass the evenly divided Senate.",
    "Trump-Era Policies: President Biden vowed to unravel Trump-era immigration rules.",
    "Greg Abbott of Texas hoped to crack down on smuggling with safety inspections.",
    "Both chambers are scheduled to leave Washington at the end of the week.",
    "Facing snarled traffic and political backlash, he had to backtrack.",
    "Disagreements inside the White House have complicated that effort.",
    "Read More About U.S. Immigration\nAt the Border: Gov.",
    "“The bill is a start."
  ]
}