{
  "id": 7991,
  "mediaId": 2572,
  "date": "2022-04-06",
  "headline": "Hawley grills Biden admin on migrant surge, whether DHS plans to give phones to illegal immigrants",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/JOSH-HAWLEY-SENATE-HEARING-COVID.jpg",
  "link": "https://www.foxnews.com/politics/hawley-grills-biden-admin-migrant-surge-dhs-plans-phones-illegal-immigrants",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2459,
    4905,
    5879,
    3639,
    4873,
    1126,
    1441,
    1397,
    5949
  ],
  "sentences": [
    "The senator wrote that U.S. Customs and Border Protection (CBP) \"reported over two million encounters with aliens illegally crossing the southern border\" in 2021, which Hawley says is \"the highest number ever recorded,\" and pointed out some apprehended illegal migrants \"have been identified as previously deported MS-13 gang members.\"",
    "In his questions, Hawley asks Mayorkas if DHS is planning on diverting VA doctors to give treatment to illegal immigrants at the border and if the department plans to give illegal immigrants free phones, as well as how DHS is \"partnering with state and local officials to address the crisis at the southern border.\"",
    "Hawley probed DHS Secretary Alejandro Mayorkas in the Wednesday letter, pointing to reports that the department is pulling Department of Veterans Affairs (VA) doctors to treat sick illegal immigrants at the border and may provide migrants with free phones.",
    "FIRST ON FOX: Republican Sen. Josh Hawley of Missouri grilled the Biden administration on the predicted migrant surge this spring and whether the Department of Homeland Security (DHS) is planning to give free cellphones to illegal immigrants.",
    "\"I am particularly alarmed at new reports suggesting that DHS plans to divert doctors from the Department of Veterans Affairs to provide free medical resources to those crossing our border illegally,\" Hawley wrote.",
    "\"At the same time, new reports and leaked documents suggest that the Department of Homeland Security (DHS) plans to divert resources from our veterans so that it can provide free services to illegal immigrants.\"",
    "\"In addition, a leaked memorandum titled ‘DHS Southwest Border Mass Irregular Contingency Plan’ details your plan to maximize the ability of illegal immigrants to apply for relief.\"",
    "\"The Biden administration has announced that it intends to rescind its Title 42 order, which will only exacerbate the crisis at the southern border,\" Hawley wrote.",
    "The Missouri Republican demanded that Mayorkas answer his 10 questions, saying the recent reports \"deserve answers immediately.\"",
    "Title 42 is an executive order that turned away illegal immigrants carrying infectious diseases trying to enter the country.",
    "\"In the words of one CBP official, ‘We’re going to take medical services away from people that really deserve that.",
    "Mark Kelly and Kyrsten Sinema of Arizona, who objected to President Biden moving to end Title 42.",
    "\"There are also reports that DHS plans to provide migrants with free phones,\" Hawley continued.",
    "\"These reports demand answers,\" Hawley added in the letter first obtained by Fox News Digital.",
    "Who went to combat… to give free medical attention to illegal migrants,’\" he continued.",
    "DHS did not immediately respond to Fox News Digital’s request for comment.",
    "Hawley also pointed to his Democratic colleagues Sens.",
    "Biden announced he was ending the policy last week."
  ]
}