{
  "id": 8006,
  "mediaId": 2526,
  "date": "2022-04-07",
  "headline": "Bipartisan Lawmakers Hope to Slip Amendment to Delay End of Title 42 in Coronavirus Aid",
  "image": "https://media.breitbart.com/media/2021/07/migrants-caught-crossing-border-july2021-border-patrol-transport-getty-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/07/bipartisan-lawmakers-hope-to-slip-amendment-to-delay-end-of-title-42-in-coronavirus-aid/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sean Moran",
  "authorUrl": "https://www.breitbart.com/author/sean-moran/",
  "termIds": [
    5879,
    4905,
    5246,
    4784,
    3475,
    3443,
    2174,
    1973
  ],
  "sentences": [
    "“We are already facing an unprecedented increase in migrants this year and that will only get worse if the administration ends the Title 42 policy.”\nIn response to Axios’s reporting about the bill, the White House said, “On the president’s first day in office, he sent an immigration bill to Congress that invests in smart solutions, effectively manages the border, and addresses the root causes of migration.",
    "Sinema, the chair of the Border Management Subcommittee, said in a statement on Thursday:\nArizona communities bear the brunt of the federal government’s failure at our border, so we’re stepping in and protecting border communities by ensuring the Administration works hand-in-hand with local leaders, law enforcement, and non-profits to put a comprehensive, workable plan in place before lifting Title 42.",
    "Tester added, “These problems do not only affect the southern border but put more strain on those working to secure the northern border as well … we should not end this policy without ample preparation.”\n“Title 42 has been an essential tool in combatting the spread of COVID-19 and controlling the influx of migrants at our southern border,” Manchin said.",
    "“Ending this policy without sufficient preparation risks undermining our national security … ending Title 42 is expected to cause a significant increase of migration to the United States and put more pressure on an already broken system,” Tester wrote to Mayorkas.",
    "Kyrsten Sinema (D-AZ), Mark Kelly (D-AZ), James Lankford (R-OK), John Cornyn (R-TX), Joe Manchin (D-WV), Shelley Moore Capito (R-WV), Jon Tester (D-MT), Rob Portman (R-OH), Maggie Hassan (D-NH), Thom Tillis (R-NC), and John Thune (R-SD) sponsored the legislation.",
    "Those that are concerned about [the U.S.] immigration system that [are] holding up COVID funding should pass it.”\nThe bipartisan group of lawmakers plans to attach the legislation into the Senate’s $10 billion coronavirus aid bill.",
    "Sen. Jon Tester (D-MT), who is up for reelection in 2024, said ending Title 42 would certainly spur a “significant increase” in illegal immigration in a letter to Department of Homeland Security (DHS) Secretary Alejandro Mayorkas.",
    "Lankford said the proposal amounts to “COVID policy.”\n“At the same time the administration is asking for $10 billion because COVID is a risk, they’re saying it’s not a risk on the border and we should open the border up.",
    "It’s why today we are introducing bipartisan legislation requiring this administration to implement a plan before lifting Title 42 that protects the public health and safety of our border communities and migrants.",
    "The broad public health authority serves as a border control measure, which would allow federal immigration officials to quickly return border crossers and illegal aliens to their native countries.",
    "I’ll continue pushing for transparency and accountability from the Administration to help secure the border, keep Arizona communities safe, and ensure migrants are treated fairly and humanely.",
    "A bipartisan group of senators, including prominent swing-state Democrats, proposed legislation to delay President Joe Biden’s end of Title 42, which has been used to curb the border crisis.",
    "A recent poll found that 55 percent of Americans oppose ending Title 42, including 37 percent of swing voters who strongly oppose Biden’s decision to end Title 42.",
    "We need a secure, orderly, and humane response at our southern border and our bipartisan legislation holds the Biden administration accountable to that.",
    "The legislation would delay Biden’s ending of Title 42 for at least 60 days to ensure that there is a “workable plan” in place before lifting Title 42.",
    "This could result in potentially 500,000 people arriving at the border every month, more than double the recurrent illegal immigration levels.",
    "Kelly said in his statement:\nThe Biden administration was wrong to set an end date for Title 42 without a comprehensive plan in place.",
    "Biden officials have admitted that ending Title 42 would likely lead to a wave of border crossers and illegal aliens to the border.",
    "Customs and Border Protection (CBP) Commissioner Chris Magnus said the move would “certainly” increase illegal immigration.",
    "Many swing-state Democrats released states questioning the Biden decision to end Title 42.",
    "It’s either a risk or it’s not a risk,” Lankford said.",
    "Sens."
  ]
}