{
  "id": 8020,
  "mediaId": 8350,
  "date": "2022-04-07",
  "headline": "Ketanji Brown Jackson confirmed to Supreme Court; Arizona’s Sinema, Kelly vote yes",
  "image": "https://ktar.com/wp-content/uploads/2022/04/ap_4853ae5bbe4242e9b071d67d072ff3b0-10-1.jpg",
  "link": "https://ktar.com/story/4994403/ketanji-brown-jackson-confirmed-to-supreme-court-arizonas-sinema-kelly-vote-yes/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Judge Jackson brings to the bench a wealth of knowledge, more trial court experience than all other current Supreme Court Justices combined, a commitment to respect precedent and a proven independent, pragmatic approach to judicial decisions.”\nKelly said he also recently met with Jackson, a 51-year-old federal appeals court judge, in Washington, D.C.",
    "He said Jackson will give all Americans “a fair shot at justice.”\n“After speaking with Judge Jackson and reviewing her record and approach to deciding cases, I believe her to be very well qualified and having demonstrated a commitment to fairly interpret and uphold the Constitution on our nation’s highest court,” Kelly said.",
    "pic.twitter.com/yi8w59Xmp8\n— Kyrsten Sinema (@kyrstensinema) April 7, 2022\n“After meeting with Judge Jackson, reviewing her record and listening to her testimony, I’m proud to support her nomination to be our next Supreme Court Justice,” Sinema said in a statement.",
    "— Senator Mark Kelly (@SenMarkKelly) April 7, 2022\n“I look forward to voting to confirm Judge Jackson to serve on the Supreme Court.”\nJackson will be the third Black justice, after Thurgood Marshall and Clarence Thomas, and the sixth woman.",
    "Sinema, the state’s senior senator, said Jackson had “exceptional qualifications.”\nWe proudly confirmed Justice Jackson to the Supreme Court.",
    "Judge Ketanji Brown Jackson is very well-qualified and has demonstrated a commitment to fairly interpreting and upholding the Constitution.",
    "With Amy Coney Barrett sitting at the other end of the bench, four of the nine justices are women for the first time in history.",
    "PHOENIX — The Senate on Thursday confirmed Judge Ketanji Brown Jackson, making her the first Black woman on the Supreme Court.",
    "Three Republican senators supported Jackson, who will replace Justice Stephen Breyer when he retires this summer.",
    "She joins two other women, Sonia Sotomayor and Elena Kagan, on the liberal side of a 6-3 conservative court.",
    "Arizona’s two U.S. senators, Democrats Kyrsten Sinema and Mark Kelly, voted Jackson to the high court.",
    "Vice President Kamala Harris was present to preside, though her tie-breaking vote wasn’t necessary.",
    "She joins a court on which no one is yet 75, the first time that has happened in nearly 30 years.",
    "Once sworn in, Jackson would be the second youngest member of the court after Barrett, 50.",
    "A 53-47 vote to cut off debate Thursday morning came hours before Jackson’s confirmation.",
    "She is exceptionally qualified and can be trusted to uphold the law.",
    "Now we look forward to her service as a Supreme Court Justice.",
    "Her confirmation is a historic milestone for America.",
    "The Associated Press contributed to this report.",
    "It's a historic moment for our country.",
    "Share\nComments"
  ]
}