{
  "id": 8024,
  "mediaId": 2520,
  "date": "2022-04-07",
  "headline": "Sens. Sinema, Kelly vote to confirm Ketanji Brown Jackson to the Supreme Court",
  "image": "https://www.gannett-cdn.com/presto/2022/03/23/NSBT/533882e7-31fd-46bd-9029-886b8966d110-ketanji.jpeg?crop=799,450,x0,y0&width=799&height=450&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/elections/2022/04/07/sinema-kelly-vote-confirm-ketanji-brown-jackson-supreme-court/9500412002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yvonne Wingett Sanchez",
  "authorUrl": "https://www.azcentral.com/staff/2646083001/yvonne-wingett-sanchez/",
  "termIds": [
    0
  ],
  "sentences": [
    "Jackson’s confirmation came despite opposition from Republicans, who raised questions about her record sentencing defendants in child pornography cases and her record representing detainees at Guantanamo Bay when she served as a federal defender.",
    "“Judge Jackson brings to the bench a wealth of knowledge, more trial court experience than all other current Supreme Court Justices combined, a commitment to respect precedent, and a proven independent, pragmatic approach to judicial decisions.\"",
    "Kyrsten Sinema and Mark Kelly voted to confirm Ketanji Brown Jackson as the first Black woman to serve on the Supreme Court, joining with the rest of the Senate Democrats and three Republicans in support of the nomination.",
    "Three Republican senators — Mitt Romney of Utah, Susan Collins of Maine and Lisa Murkowski of Alaska — joined Democrats in voting for Jackson’s confirmation with Vice President Kamala Harris presiding over the chamber.",
    "Jackson’s ascent to the Supreme Court bench will maintain the current 6 to 3 majority-conservative makeup of the court when she takes the bench in nearly three months, when Associate Justice Stephen Breyer retires.",
    "“After meeting with Judge Jackson, reviewing her record, and listening to her testimony, I’m proud to support her nomination to be our next Supreme Court Justice,” Sinema said.",
    "Kelly announced his support for Jackson last week, citing her record and approach to deciding cases and evidence she would “fairly interpret and uphold” the Constitution.",
    "Sinema, D-Ariz., and Kelly, D-Ariz., both loudly voiced “aye” while sitting behind their desks on the Senate floor to confirm Jackson on a 53-47 vote.",
    "Sinema confirmed her support for Jackson in a written statement ahead of the vote, saying she will bring “exceptional qualifications” to the bench.",
    "Sinema and Kelly each met with Jackson in recent weeks to assess her credentials and issued enthusiastic statements about her nomination.",
    "“I look forward to voting to confirm Judge Jackson to serve on the Supreme Court.”\nHave news to share about Arizona politics?",
    "Subscribe for free to The Gaggle political podcast on Apple Podcasts, Overcast, or wherever you listen to audio content.",
    "Sinema previously voted to confirm Jackson to sit on the U.S. Court of Appeals for the District of Columbia.",
    "Contact her at yvonne.wingett@arizonarepublic.com and 602-444-4712.",
    "Reach the reporter on Twitter and Facebook.",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "Sens."
  ]
}