{
  "id": 8041,
  "mediaId": 2643,
  "date": "2022-04-09",
  "headline": "Henry Cuellar Becomes Sixth House Democrat to Oppose Biden Lifting Title 42",
  "image": "",
  "link": "https://www.newsweek.com/henry-cuellar-becomes-sixth-house-democrat-oppose-biden-lifting-title-42-1696667",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    2765,
    3712,
    3653,
    4885,
    4905,
    4185,
    1477,
    1126,
    392
  ],
  "sentences": [
    "Representatives Tom O'Halleran of Arizona, Jared Golden of Maine, Stephanie Murphy of Florida, Chris Pappas of New Hampshire and Greg Stanton of Arizona—all of whom represent potentially vulnerable districts—have signed onto the legislation.",
    "Congressman Henry Cuellar signed onto legislation aimed at preventing the Biden administration from lifting Title 42 immigration limits, becoming the latest House Democrat to push back against plans to repeal the controversial restrictions.",
    "Meanwhile, Senators Krysten Sinema and Mark Kelly of Arizona, Maggie Hassan of New Hampshire, Joe Manchin of West Virginia and Jon Tester of Montana have signed onto similar legislation in Congress' upper chamber.",
    "The CDC said when it announced it was lifting the measure that \"suspending the right to introduce migrants into the United States is no longer necessary\" in light of more \"tools to fight COVID-19.\"",
    "People who have been assigned up to the northern border for a period of time are suddenly getting pulled down there for short-term deployments, and that can really wear down a force over time.\"",
    "Progressives pushed for Biden to end the policy sooner, saying it could potentially be dangerous for migrants, who could be forced to return home if their asylum claims are rejected.",
    "The Centers for Disease Control and Prevention announced earlier in April a plan to repeal the order, a move that sparked criticism from Republicans and some moderate Democrats.",
    "He said in an interview with local news station WABI-TV: \"There's not enough people to secure the southern border, and therefore people are having to work overtime, repeatedly.",
    "He warned that if Democrats \"don't stand up and do the right thing, they're going to be hit hard by the Republicans\" during the midterm elections in November.",
    "In March, Cuellar was held to less than 50 percent of the total vote in the Democratic primary, winning only 48.6 percent of votes to Cisneros' 46.7 percent.",
    "Cuellar, representing a South Texas border district, has long been one of the most centrist Democrats in Congress, raising the ire of progressives.",
    "Title 42 allows for U.S. Customs and Border Protection to turn away migrants at the border to prevent the spread of the coronavirus.",
    "In November, Republicans will also hope to unseat Cuellar in the district President Joe Biden won by about seven points.",
    "Democratic Representative Jared Golden of Maine, who represents a district Trump won, introduced the bill in the House.",
    "He faces a serious primary threat from progressive Jessica Cisneros, who forced him into a May runoff last month.",
    "\"But some of us are standing up and saying this is the right thing to do for the border,\" Cuellar told Fox News.",
    "Cuellar explained his decision to oppose the repeal in an interview with Fox News published Saturday.",
    "The two are going head-to-head in a May 24 runoff election, when progressives hope to unseat him.",
    "The district includes parts of southern Texas, including Laredo and areas near San Antonio.",
    "\"We all believe in immigration reform, but we don't want chaos at the border.",
    "He has long faced criticism for his positions on abortion and immigration.",
    "He is also facing an investigation by the FBI over ties to Azerbaijan.",
    "He joins several other centrist Democrats in backing the legislation.",
    "The policy was first enacted by former President Donald Trump.",
    "Newsweek reached out to Cuellar's office for comment.",
    "We want law and order at the border.\""
  ]
}