{
  "id": 8053,
  "mediaId": 2590,
  "date": "2022-04-06",
  "headline": "Gov. Greg Abbott Says Texas Will Bus Undocumented Immigrants To D.C.",
  "image": "https://img.huffingtonpost.com/asset/624e27312100003b54505891.jpeg?cache=W1kPpl4sg5&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/greg-abbott-texas-immigrants-dc-bus_n_624e114ee4b007d3845eb543",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lydia O'Connor",
  "authorUrl": "",
  "termIds": [
    1900,
    4905,
    5078,
    1112,
    1305,
    6653
  ],
  "sentences": [
    "Others include directing the state’s Department of Public Safety to start stopping and inspecting commercial vehicles coming across the U.S-Mexico border - though that’s sure to slow traffic between Texas and its biggest trading partner - as well as increasing military activity in South Texas and installing razor wire in more easily crossed parts of the Rio Grande.",
    "TDEM estimates the plan will require 900 charter buses to take immigrants on the approximately 30-hour bus journey to D.C. Abbott did not elaborate in his directive or his press conference on how the program will be managed or funded, and opponents quickly decried what they characterized as attention-getting antics by someone angling to run for president in 2024.",
    "“Just because the state says that it is an invasion that doesn’t necessarily make it so, it is not clear to me what additional legal authority that conveys on them,” Emily Berman, an instructor on constitutional law at the University of Houston, told The Associated Press following Abbott’s announcement.",
    "Advertisement\nMigrants in Texas - many of whom are seeking asylum in the U.S. after fleeing government corruption, violence and crime in their home countries - will be given “voluntary transportation” to Washington and other undisclosed locations, the governor said in his directive.",
    "“We are sending them to the United States’ capital, where the Biden administration will be able to more immediately address the needs of the people that they are allowing to come across our border,” Abbott said at a press conference Wednesday in the border city of Weslaco.",
    "Advertisement\nRecent media investigations into Abbott’s “Operation Lone Star,” the moniker he’s given to his administration’s ongoing crackdown on immigration, have found that it’s both rife with corruption and ineffective at slowing border crossings into Texas.",
    "“Title 42 was a cruel and discriminatory policy that circumvented U.S. law, preventing people from accessing protections established by Congress,” Congressional Progressive Caucus Chair Rep. Pramila Jayapal (D-Wash.) said in a statement following the decision.",
    "https://t.co/4AduW1FBQF\n— RAICES (@RAICESTEXAS) April 6, 2022\nThe governor’s war on immigrants is sure to face court challenges from opponents who say he’s overstepping the federal government’s authority on immigration matters.",
    "Greg Abbott (R) ordered the state to start busing undocumented immigrants to Washington, D.C., on Wednesday in response to President Joe Biden’s lifting of a policy that turned away migrants because of the COVID-19 pandemic.",
    "Advertisement\n“If Abbott focused on solutions instead of stunts, then Texas could have made some real progress on this issue over the last seven years,” Democrat Beto O’Rourke said in a statement.",
    "“Texans cannot continue to shoulder the burdens imposed by open-border advocates in other parts of the country,” Abbott said in his order to the Texas Division of Emergency Management, or TDEM.",
    "Democrats have been divided on the decision to ditch the policy, with progressives championing it as long overdue and moderates saying the country wouldn’t be able to manage the sudden influx.",
    "The Department of Homeland Security said it’s preparing for around 18,000 migrant arrivals a day once Title 42 is lifted, up significantly from this week’s average of 7,100 arrivals.",
    "RAICES, a Texas-based organization that helps immigrants and refugees, called Abbott’s actions “disgusting.”\nWe see what you are doing here, and it's disgusting.",
    "Sen. Mark Kelly said it’s “unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border.”",
    "The architects of Abbot’s plan say states have the constitutional right to defend themselves from an “invasion,” but experts say that defense is shaky.",
    "Under the Trump-era policy, the U.S. asserted the authority to block migrants from entering the country due to the risk of COVID-19 contagion.",
    "The policy has been used to turn away asylum-seekers more than 1.7 million times in the past two years, but will now expire on May 23.",
    "Abbott’s latest orders follow Biden’s announcement that he’s lifting a public health measure next month called Title 42.",
    "O’Rourke, a former U.S. House member, is seeking to unseat Abbott in the Texas gubernatorial race later this year.",
    "The order is among several legally dubious actions Abbott announced Wednesday to target illegal border crossings.",
    "The two Democratic senators from Arizona, which also shares a border with Mexico, said they opposed the move.",
    "@GregAbbott_TX is trying to Make Texas White Again.",
    "It’s unclear what other choices they’ll have.",
    "Texas Gov."
  ]
}