{
  "id": 810,
  "mediaId": 2558,
  "date": "2022-02-25",
  "headline": "Hickenlooper picks center path in partisan Senate, mulls repeat run",
  "image": "https://www.denverpost.com/wp-content/uploads/2022/01/TDP-L-HICKENLOOPER_EVRAZ_299x.jpg?w=1024&h=702",
  "link": "https://www.denverpost.com/2022/02/25/hickenlooper-center-path-senate-mulls-repeat-run/",
  "mediaOutlet": "Denver Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bruce Finley",
  "authorUrl": "https://www.denverpost.com/author/bruce-finley/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Whether you’re far left, far right, or in the middle, nothing is working in this political climate.”\nAt the University of Colorado in Boulder, political scientist Srinivas Parinandi said that, unlike governors who function as managers overseeing work such as balancing budgets, “your biggest hurdle in the Senate is working with other members to get your policy goals that you’ve promised done and to achieve party goals.” Any action by a junior senator on their own priorities “is pre-conditioned on doing what Chuck Schumer would want.",
    "That’s where he’s at, and I don’t think he’s ever going to be a particularly effective senator.”\nIn contrast, Democratic consultant Steve Welchert called Hickenlooper’s first year “spectacular.” As governor, Hickenlooper showed a willingness to act independently, keeping a distance from Obama administration officials, and he often defies common political consultant playbooks, Welchert said, surprised to hear Hickenlooper openly contemplating a second term.",
    "It is going to be more the people in the center.”\nHickenlooper has focused increasingly on governance itself — navigating “conflict” and trying to end what he called “endless exaggeration of our differences.”\nHe said that in deadlocks where he reached to the other side, “the Republicans pretty much always have a point.”\nFor example, he cited the January battle over legislation to protect voting rights, which a blockade of Republicans defeated.",
    "And they all have real value.”\nAmong power brokers in Washington D.C., lobbyist and longtime supporter Norm Brownstein, a political independent who chairs the Denver-based firm Brownstein, Hyatt, Farber and Schreck, said he watched Hickenlooper carefully as he made a difficult shift from his executive position as governor where “you get the final word” to the seniority-oriented Senate.",
    "And for Hickenlooper, who introduced 24 bills and amendments — including measures to end non-competitive federal leasing of oil and gas drilling rights on public land and to make it cheaper to charge electric vehicles — the infrastructure deal stood out as tangible action, giving a glimpse of “how our democracy was designed to work” after the United States broke free from Britain.",
    "He was a businessman and businessmen are about getting things done.” Brownstein said Hickenlooper eventually could become “a powerful member of Senate commerce and health committees.”\nWhen Hickenlooper flew to Washington D.C. on Sunday, Nov. 8, 2020 for orientation, he’d received an invitation from Sen. Joe Manchin (D – W. Va.), a deciding vote in the often-split Senate.",
    "But we’ve got to show the Russian government we are going to stand up to threats from someone like Vladimir Putin.” If Russia invades Ukraine — he declared this “unacceptable” in a joint statement Jan. 23 with fellow senators who introduced a Ukraine Sovereignty Protection Act — he recommends intensifying sanctions to a level that forces the Russian economy to collapse.",
    "His ideas are getting heard by important people in the Senate.”\nWhile high-profile lawmakers Rep. Lauren Boebert (R-Colorado) and Rep. Alexandria Ocasio-Cortez (D-N.Y.) deliver flamboyant speeches amplified on social media, Hickenlooper has burrowed into building up power, said CU political economist Sven Steinmo, who teaches a course on American government.",
    "And people don’t have electric cars yet.”\nHis push for establishing a carbon tax — an idea around for four decades and implemented in several other countries — made him the target of an American Petroleum Institute ad last summer that accused him of putting the economy, national security and the environment at risk.",
    "He’s a real believer that the best decisions are bipartisan.”\nA month later, Senate colleagues on an existing bipartisan team picked Hickenlooper and Kelly to serve on an expanded team of 10 Democrats who would work with 10 Republicans negotiating what became the $1.2 trillion Infrastructure Investment and Jobs Act.",
    "Former state Sen. Joe Salazar, who has been fighting for environmental justice in north metro Denver and an end to fossil fuel development, said Hickenlooper’s been “trying to do the work he can” in a “dysfunctional” Senate where nobody fairly can be expected to push through significant legislation.",
    "He’s trying to find places, like the infrastructure bill, where he can make a difference — and be that pragmatic person who can help solve problems.”\nAfter two days of riding along across the prairie with Hickenlooper, Romer concluded he’s a capable politician who has embraced his new Senate job.",
    "To do that, he has focused on building relationships with both Republicans and Democrats.”\nBrownstein credited Hickenlooper with “keeping his head down and plowing” at a time when liberal progressives “talk out against things on the floor” and send tweets — “They accomplish nothing,” he said.",
    "LAMAR — Sen. John Hickenlooper on his latest home state swing pointed to what he sees as solutions for the world’s toughest problems, first during a stop at the Denver Brewing Company, where rooftop solar panels and a carbon dioxide capture system demonstrate climate-friendly production.",
    "But the Earth as we know it would cease to be the place we know and love.”\nHe had questioned the emerging Green New Deal, voted against a nonbinding resolution to ban hydraulic fracturing and, as governor, was seen as a collaborator with the oil and gas industry.",
    "Then upon arrival, seeing Senate grandeur in Washington D.C., he felt an unexpected “intensity of responsibility.”\nNow he’s advocating mostly Democratic party-line positions, though he’s also pushing with increasing urgency for action to contain climate warming.",
    "“He’s kind of hiding” and Democrat leaders “seem afraid of the next generation.”\nHickenlooper says he is settling into a role he envisions as a developer of ideas who draws strength by hearing and incorporating views of opponents, leading to practical action.",
    "Fourteen months into a job he didn’t initially seek, Hickenlooper, 70 — one of the longest-serving elected executives in state history who moved with no break through two terms as Denver mayor and two as governor — is feeling for his legislative footing.",
    "Colorado residents deserve tangible benefits, and a senator must prioritize Colorado interests over party demands — by fighting effectively and delivering, said Republican political consultant Dick Wadhams, a former chief of the state Republican Party.",
    "Denver Moms Clean Air Force and EcoMadres activist Shaina Oliver, a member of the Navajo Nation who backed Hickenlooper’s primary rival Andrew Romanoff, said she’ll give Hickenlooper a few years “to show his true colors” before reaching her verdict.",
    "This reflected his position as a relatively seasoned centrist — one of a dozen senators who’ve served as a governor, seven who’ve been a mayor, a handful who’ve run a small business, and the only scientist (he was trained as a petroleum geologist.)",
    "In the drafting, he worked in groups that focused on expanding internet access and improving airports, and he helped write provisions for research on how marijuana impairs driving and to help metro Denver’s Regional Transportation District.",
    "Then at the solar-powered Evraz steel plant in Pueblo, he checked out a $500 million expansion financed by Russian billionaires, a project to supply rail for a global shift away from gas-burning vehicles to high-speed train transport.",
    "Republicans demanded greater independence and accused Hickenlooper of failing to fight hard enough to keep the U.S. Space Command in Colorado Springs and to retain the federal Bureau of Land Management headquarters in Grand Junction.",
    "A recent poll found 64% of Americans consider Democracy in crisis and at risk of failing, with 32% of Trump voters and 22% of Biden voters calling political violence “sometimes justified” to protect U.S. self-rule, values or culture.",
    "“He gave us beer and pizza,” Hickenlooper said, recounting this visit as “the best introduction you can imagine.” For three hours, the men talked about the Senate and politics in West Virginia, Arizona, and Colorado.",
    "Not only are Space Command and BLM offices slipping away, but Hickenlooper’s voting record aligns almost totally with priorities of President Biden and Senate Majority leader Chuck Schumer (D-N.Y.), Wadhams said.",
    "Looking ahead, he’s mulling creation of a caucus of senators from the Rocky Mountain West to spur Senate attention to problems such as water depletion in the Colorado River Basin — a priority in eastern Colorado.",
    "“He’s just a reliable Chuck Schumer-Joe Biden soldier.”\nLeft-leaning progressives wanted bolder action to save Colorado’s natural environment and to end production of fossil fuels that worsen climate warming.",
    "But between those visits, he was wrestling with the rancor that has divided the nation and often leaves the Senate — a place Hickenlooper didn’t think he wanted to be — deadlocked in partisan strife.",
    "He also backs regulations to limit industrial methane pollution and, after attending the international climate summit in Scotland, has advocated reducing existing greenhouse gases in the atmosphere.",
    "Hickenlooper got a chance to meet and hear directly from key players: Susan Collins (R-Maine), Lisa Murkowski (R-Alaska), Mitt Romney (R-Utah), John Cornyn (R-Texas) and Cory Booker (D-New Jersey).",
    "Hickenlooper noted in a Post interview that, at one stage last year, “Joe Manchin was seriously considering a fee and dividend on carbon emissions.”\nDuring his first year, he voted 527 times.",
    "He voted for the legislation and fought hard, eventually calling publicly for limits on Senate use of the filibuster power that Republican opponents were threatening to block legislation.",
    "Overall, Hickenlooper gained influence during his first year by serving on a bipartisan team of 20 senators who negotiated the $1.2 trillion infrastructure bill that became law Nov. 15.",
    "“And there’s never a time where I don’t come out after that meal with a whole bunch of scribbles about things I hadn’t really considered from people who have a different perspective.",
    "And then, if the Democrats are in power – I doubt they’ll be in power a few years from now but a couple years after that they may well be back – he will be in a position.",
    "As a human, you think ‘my idea is better.’ But when you reflect, have a conversation, take the time to really dig in, you see the value in other, different perspectives.",
    "Manchin summoned Hickenlooper, along with fellow first-year Sen. Mark Kelly (D-Arizona), for an evening at the houseboat where Manchin lives on the Potomac River.",
    "“There aren’t many folks who can strike a centrist pose these days in Washington D.C. and, if you can dip your toes in that water, like John, that’s a good start.",
    "Back when he was the governor and owners were considering a shut-down of the plant amid Chinese competition for steel pipe, Hickenlooper helped rally investors.",
    "Hickenlooper “has a very good skill of balancing complexity with straight communication.” And his habit of talking with working people will pay off, Romer said.",
    "That’s the way you learn.”\nAs he spoke, Hickenlooper was standing in a snowstorm wearing a neon orange Evraz safety jacket at the steel mill construction site.",
    "He helped work out differences when senators hit snags, over matters such as how to handle oil and gas “orphan wells” left after drilling and pumping is done.",
    "You can have an improvement from your original idea.”\nHe “can easily see going two terms,” he told the Denver Post, which would extend his tenure until 2033.",
    "Hickenlooper during interviews in late January took the following positions:\nRussia’s military buildup on Ukraine: “We have cyber tools, weapons we can use.",
    "Beyond climate warming, staffers said he’s exploring “workplace modernization” legislation to expand apprenticeships and create portable retirement plans.",
    "Hickenlooper has proposed a carbon tax on polluters, with a dividend for consumers, to reduce emissions of carbon dioxide, the primary planet-heating gas.",
    "Hickenlooper advocates tax reform — raising the corporate tax rate above the current 21% and raising taxes for people who make more than $400,000 a year.",
    "An Exxon lobbyist visited his office, and Hickenlooper says they discussed Exxon’s professed support for a possible $100-a-ton tax on carbon emissions.",
    "But, looking back now, he said the bill had ballooned to 750 pages, too long, including costly burdens on states to conduct election system audits.",
    "You have to go along with what the party wants in order to get some of what you want to even have a shot at going into policy,” Parinandi said.",
    "As snow blew sideways, pelting him, Hickenlooper smiled beneath towering cranes, optimistic to see first steps toward a solution taking shape.",
    "These are rural communities where residents supported former Sen. Cory Gardner, the native son from Yuma that Hickenlooper displaced.",
    "“So many people are so angry,” leading to scenes such as armed groups parading around the Michigan state capitol, Hickenlooper said.",
    "How to reduce deficits from massive federal spending during the COVID-19 pandemic: “Everyone should pay their fair share of taxes.",
    "Some critics of Hickenlooper as governor held back, citing difficult circumstances in the Senate after the Jan. 6 attack.",
    "He sees hard listening — here at home and in Washington D.C. — as the key to tapping “collective wisdom” to benefit all.",
    "Whether to increase defense spending: “I suspect there are a lot of ways we could spend our defense budget more wisely.",
    "He served on four committees and chaired the Space and Science and the Employment and Workplace Safety subcommittees.",
    "He called the Senate, during his 18-month run for the presidency, a debating club that he, as a doer, wasn’t cut for.",
    "And now a new mill – the nation’s first solar-powered steel mill — will generate jobs and help meet global demand.",
    "“It may not be the pace of productivity the public expects, but he’s getting his name on influential committees.",
    "“In the Senate, you have to work with your bipartisan colleagues to get anything accomplished,” Brownstein said.",
    "Three days after Hickenlooper was sworn in, more than 2,000 rioters on Jan. 6 raided and ransacked the Capitol.",
    "This role entails carrying notecards, even to casual discussions with senate colleagues over meals, he said.",
    "He went driving through opposition territory, the predominantly Republican high plains of eastern Colorado.",
    "Hickenlooper said opponents had a point and that he would have preferred a more narrowly tailored bill.",
    "He was telling local TV crews how the $1.2 trillion infrastructure investment will require more steel.",
    "“You keep your bearings.”\nAmericans “have got to be open to learn more than we now know,” he said.",
    "“It was kind of like we were at an audition — to see whether we were really bipartisan,” he said.",
    "But Hickenlooper also has committed to renewable energy and reducing the use of fossil fuels.",
    "“It is a question of whether you attack supply or attack demand,” Hickenlooper told the Post.",
    "But I should probably pay more taxes.” Staffers declined to reveal his personal tax bracket.",
    "Evraz managers told him they’re exploring possibilities for a hydrogen energy facility, too.",
    "Well, all the states, all these communities, have their own slightly different genetic code.",
    "They herded about 150 senators and staffers, including Hickenlooper, to a large empty hall.",
    "“You can see it actually coming up out of the ground,” he said, “like a tree growing up.”",
    "Up to this point, there’s been no difference between Hickenlooper and Schumer and Biden.",
    "People have got to recognize there’s a consequence that the industry is not paying for.",
    "The staffers said he’s also working on legislation to improve forecasting of pandemics.",
    "It would be premature to make that decision” on raising the overall amount, he said.",
    "(By comparison, the Senate took 397 votes in the first year with President Obama.)",
    "Roy Romer, 93, seeking perspective (“I asked him to share whatever stories he has.",
    "In some cases, lawmakers wrestled with controversial matters such as immigration.",
    "The Senate runs very much by seniority, and a senator tries to build a career.",
    "On his swing through Colorado in late January, he rode with fellow former Gov.",
    "His main thing has been to focus on representing all the voters of Colorado.",
    "Containing climate warming: “I’m not going to help the oil and gas industry.",
    "Manchin “is a real believer in that, and he’s getting a lot of heat for it.",
    "That bill became the nation’s largest infrastructure measure in 75 years.",
    "At the start, he participated in talks about the overall dollar amount.",
    "He’s the first newcomer senator in 42 years to chair two subcommittees.",
    "“The proof will be in what kind of independent judgment he exercises.",
    "“You can’t do that unless you listen to people who disagree with you.",
    "Since 1887, hulking steel mills in Pueblo have helped build the West.",
    "It isn’t Democrat or Republican,” he said in a Denver Post interview.",
    "“And John has done a very good job at fitting into the U.S. Senate.",
    "It is not the radical who decides what our federal government does.",
    "'”) for navigating what both see as Democracy’s core challenge.",
    "Touring eastern Colorado to hear from conservatives “is great.",
    "He’s not supposed to have a lot of influence at this point.",
    "Some still fly the banner of former President Donald Trump.",
    "Critics on both sides of the political spectrum took aim.",
    "Suddenly security officials were directing an evacuation.",
    "At first, shaken senators focused on images and updates.",
    "If you are a bomb-thrower, who wants you on their team?",
    "“And that’s how you’re going to address climate change.",
    "But serving in the Senate seldom seemed so precarious.",
    "“If you attack supply, then everyone’s price goes up.",
    "Senators didn’t immediately know what was happening.",
    "They’ve got his vote and know they can depend on it.",
    "Then as they waited for five hours, they conversed.",
    "His net worth has been estimated around $9 million.",
    "It has the potential to change life as we know it.",
    "I worked 70 or 80-hour weeks for almost 20 years.",
    "No electronics are allowed on the Senate floor.",
    "But as a Senate newcomer, he has limited power.",
    "So we have got to do carbon capture,” he said.",
    "Nothing,” former state Sen. Greg Brophy said.",
    "“You know how we have genetic sequencing now?",
    "Colorado and Pueblo have provided incentives.",
    "They need to bide their time,” Steinmo said.",
    "“Hickenlooper is doing a good job,” he said.",
    "“There’s already too much carbon in the air.",
    "Taxing carbon would harness market forces.",
    "We have sophisticated economic sanctions.",
    "“That’s the way a senator has influence.",
    "“We have this stalemate,” Salazar said.",
    "“He’s a first-term, first-year senator.",
    "Even some Democrats weren’t satisfied.",
    "I’m not saying people will go extinct.",
    "“Accomplishing things makes him tick.",
    "We can find non-military solutions.",
    "Senators should do that,” he said.",
    "I feel like I earned my success.",
    "The issue is climate change.",
    "“What has Hickenlooper done?",
    "He laughed and said ‘sure.",
    "He co-sponsored 123 bills.",
    "He attended 111 hearings.",
    "….."
  ]
}