{
  "id": 8116,
  "mediaId": 8322,
  "date": "2022-04-07",
  "headline": "Georgia Sen. Warnock, other vulnerable Democrats oppose ending Title 42 border policy",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Raphael-Warnock-Inflation.jpg",
  "link": "https://www.foxnews.com/politics/georgia-sen-warnock-vulnerable-democrats-oppose-ending-title-42-border",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kyle Morris",
  "authorUrl": "https://www.foxnews.com/person/m/kyle-morris",
  "termIds": [
    5879,
    2459,
    3026,
    4905,
    4873,
    1489,
    392,
    6175
  ],
  "sentences": [
    "\"Senator Warnock believes in protecting the humanity of migrants at the border, but before this policy is rescinded, the Administration should present a plan for how it will ensure our border security has the manpower, infrastructure, humanitarian and legal resources they need to prevent this policy change from making an already dire humanitarian situation worse,\" the spokesperson said.",
    "\"After considering current public health conditions and an increased availability of tools to fight COVID-19 (such as highly effective vaccines and therapeutics), the CDC Director has determined that an Order suspending the right to introduce migrants into the United States is no longer necessary,\" the Centers for Disease Control said in a statement.",
    "Doubling down on prior remarks he made in opposition to ending Title 42, a spokesperson for Warnock said in a statement Thursday morning that he \"does not support lifting Title 42 at this time\" and recommended that the Biden administration release an outline for how it plans to deal with the crisis at the southern border once the policy is lifted.",
    "Georgia Democrat Sen. Raphael Warnock, who won a 2021 special election and is now seeking a full term, is part of a growing list of Democrats who are speaking out against the decision to end the policy which gave the administration the ability to bar people from entering the country during a health crisis such as the COVID-19 pandemic.",
    "\"Ending Title 42 is expected to cause a significant increase of migration to the United States and put more pressure on an already broken system,\" Tester wrote in a Tuesday letter to Homeland Security Secretary Alejandro Mayorkas.",
    "The Centers for Disease Control (CDC) announced on Friday that it will be ending Title 42, which has been used by both the Biden and Trump administrations to quickly expel migrants at the border due to the pandemic, on May 23.",
    "Despite her willingness to sign onto letters calling for a reversal to the policy when it was used under former President Trump's administration, Sen. Catherine Cortez Masto, D-Nev., has now changed her tune.",
    "Several Democrats, many who are up for reelection in their states, are pushing back against the Biden administration's decision to terminate the use of Title 42 to expel migrants at the border.",
    "Sen. Joe Manchin, D-W.Va., has described the move as a \"frightening decision\" and said last week that Title 42 has been \"essential\" in combating COVID-19 and controlling the migrant flows.",
    "Cortez Masto's office said the senator signed the letter \"condemning the Trump Administration for its harmful policies that have dismantled the United States’ asylum system.\"",
    "Cortez Masto's comments come after a 2020 letter she – along with several other congressional Democrats – signed which referred to the policy as the \"CDC asylum ban.\"",
    "Sen. Jon Tester, D-Mont., has also spoken out against the move, saying the decision to end the policy \"will only add to the strain on our broken immigration system.\"",
    "\"We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy,\" Manchin said.",
    "Sen. Maggie Hassan, D-N.H., meanwhile, said that ending the order \"will likely lead to a migrant surge that the administration does not appear to be ready for.\"",
    "Kyrsten Sinema and Mark Kelly have both written to and spoke with Mayorkas to express their concerns about the policy being lifted without proper planning.",
    "\"This is the wrong way to do this and it will leave the administration unprepared for a surge at the border,\" Cortez Masto said in a statement this week.",
    "\"We should be working to fix our immigration system by investing in border security and treating immigrant families with dignity,\" she added.",
    "\"These problems do not only affect the southern border, but put more strain on those working to secure the northern border as well.\"",
    "The letter also said the policy was \"designed to further an ongoing agenda to exclude asylum seekers.\"",
    "\"Instead, the administration is acting without a detailed plan.\"",
    "\"We are nowhere near prepared to deal with that influx.\"",
    "Fox News' Adam Shaw contributed to this article.",
    "Arizona Democrat Sens."
  ]
}