{
  "id": 8161,
  "mediaId": 2520,
  "date": "2022-04-08",
  "headline": "What is Title 42 and how does it affect the Arizona border? The immigration policy, explained",
  "image": "https://www.gannett-cdn.com/presto/2022/03/22/PPHX/50dae07a-cdea-4e1e-8f3f-82d362fc19f5-Rally_for_asylum_seekers_1.jpg?crop=3399,1912,x0,y210&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/border-issues/2022/04/07/what-title-42-and-how-used-border-under-covid-19/9499102002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clara Migoya",
  "authorUrl": "https://www.azcentral.com/staff/5394304001/clara-migoya/",
  "termIds": [
    5879,
    4905,
    2765,
    4185,
    3712,
    1487,
    5949,
    6667,
    6746
  ],
  "sentences": [
    "Under section 265 of the code, the surgeon general, or in this case the director of the Centers for Disease Control and Prevention, can prohibit the entry or \"introduction\" of non-citizens in the interest of public health if there is a \"quarantinable communicable disease\" in a foreign country and \"serious danger\" that it can be introduced into the United States.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nThe CDC announced it was lifting the restriction.",
    "Kyrsten Sinema, D-Ariz., and Mark Kelly, D-Ariz., oppose ending the policy without a \"comprehensive, workable plan in place,\" saying the would overwhelm Arizona border communities and stretch the resources of nonprofits that are already near capacity.",
    "\"There are a range of ideas out there in Congress — Democrats, Republicans, others — some who support a delay of Title 42 implementation, some who strongly oppose it,\" White House Press Secretary Jen Psaki said April 20.",
    "Nationals from Guatemala, El Salvador, Honduras and Mexico are sent back across the land border, while all other nationalities are flown back to their home country or to a country that has agreed to receive them.",
    "Because of operational reasons, migrants who could serve as material witnesses in a case or who have been previously convicted of a crime are processed under CBP’s Title 8 statutory immigration authority.",
    "Along with a bipartisan group of nine other senators, they introduced a bill to prevent the administration from ending Title 42 until it lifts the COVID-19 national emergency declaration.",
    "The CDC determined that the public health order is no longer necessary after considering the wide range of mitigation measures and the low community levels of COVID-19 nationwide.",
    "On March 20, 2020, the Department of Health and Human Services issued emergency regulations that allowed the Centers for Disease Control to implement Title 42 of the U.S. Code.",
    "President Joe Biden's administration is ending a controversial border health restriction that had been held over from the previous Trump administration.",
    "The ports of entry have turned away asylum-seeking migrants for the past two years, with very few exceptions granted through humanitarian parole.",
    "CDC officials announced Title 42 will be terminated to \"enable the Department of Homeland Security to implement appropriate COVID-19 protocols.\"",
    "Agents and officers have been immediately expelling people crossing the border illegally between ports of entry ever since, using that order.",
    "Stanton in a letter told Biden the approach was necessary \"because the Administration's approach to the border has been largely reactionary.\"",
    "The clause was enacted as part of the Public Health Service Act of 1944, but was rarely used before the COVID-19 pandemic that began in 2020.",
    "In the Tucson sector, which covers 262 miles between New Mexico and Yuma County, about 80% of encounters ended with a Title 42 expulsion.",
    "On the House side, Reps. Tom O'Halleran and Greg Stanton, both Arizona Democrats, have co-sponsored similar legislation.",
    "Title 42 has been used over 1.7 million times, about 27% of those times the individual had been expelled at least twice.",
    "Their public health assessment found that 97% of the U.S. population lives in counties with low levels of COVID-19.",
    "It remained in effect even as international flights resumed and the southern border opened for foreign visitors.",
    "Sometimes agents could not expel migrants to Mexico or their countries of origin under Title 42.",
    "Axios reported April 19 that the White House was weighing a possible delay in lifting Title 42.",
    "The differences are mainly related to the nationality of the migrants apprehended.",
    "Title 42 has rolled out differently in Arizona's two Border Patrol sectors.",
    "\"And there are a range of other ideas of reforming our immigration system.",
    "Title 42 is a U.S. Code that relates to public health and welfare.",
    "Republic reporter Ronald J. Hansen contributed to this story.",
    "Title 42 will end on May 23, 2022, unless Congress acts.",
    "Here are some answers to your questions about Title 42.",
    "In the Yuma sector, many fewer expulsions occurred.",
    "Why were some migrants not expelled under Title 42?",
    "How was Title 42 used during the COVID-19 pandemic?",
    "\"Encounters\" do not equal individuals apprehended.",
    "We’re happy to have that conversation with them.\"",
    "When will the immigration restriction be lifted?",
    "This would all require congressional action.",
    "How does Title 42 affect the Arizona border?",
    "Subscribe to azcentral today.",
    "Support local journalism.",
    "What is Title 42?",
    "What did it say?",
    "Sens."
  ]
}