{
  "id": 8169,
  "mediaId": 2550,
  "date": "2022-04-06",
  "headline": "Border Patrol union president goes on Fox News to spew white supremacist 'replacement theory'",
  "image": "https://images.dailykos.com/images/1056434/story_image/GettyImages-1317662481.jpg?1649274109",
  "link": "https://www.dailykos.com/stories/2022/4/6/2090450/-After-appearing-in-violent-ad-Border-Patrol-union-head-pushes-white-supremacist-conspiracy-theory?pm_campaign=blog&pm_medium=rss&pm_source=LatinoKos",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "But the union also makes no secrets of its despicable views, after union president Brandon Judd went onto Fox News to openly promote racist “replacement theory.”\nRELATED STORY: After Carlson spouts white nationalist ‘replacement theory,’ ADL chief says: ‘Tucker must go’\nIn the clip, both Fox News host Bill Hemmer and Judd are fuming over the Biden administration’s decision to terminate the Stephen Miller Title 42 order that for more than two years now has effectively stomped on U.S. asylum law.",
    "National Border Patrol Council President Brandon Judd: \"I believe that they're trying to change the demographics of the electorate, that's what I believe they’re doing\" pic.twitter.com/Jl9vdZ99CB\n— Justin Baragona (@justinbaragona) April 4, 2022\nBut it’s not like Judd hasn’t already exhibited worrying behavior, earlier this year appearing in an ad where a right-wing candidate from Arizona shot at actors portraying the president, Speaker Pelosi, and Sen. Mark Kelly.",
    "My colleague David Neiwert has previously described this “replacement” talk as “a conspiracy theory claiming that white people are selectively ‘replaced’ by nonwhite immigrants.” It’s white supremacist conspiracy theory, and it’s being promoted by the president of the union for border agents.",
    "“After national press attention condemning Stefanik's use of the white nationalist 'replacement theory' in her Fbook ads warning of an ‘election insurrection’ ... she has doubled down and is STILL running these ads,” America’s Voice Political Director Zachary Mueller noted last fall.",
    "But now that the administration is moving to restore asylum access—a just decision that we should celebrate—they’re acknowledging the presence of Title 42 as a border control measure (though the policy has been a failure in multiple ways, see why here).",
    "RELATED STORIES:\nArizona GOP candidate revels in outrage after releasing vile ad depicting political violence\nStefanik pushes racist ad that also claims undocumented immigrants are the real insurrectionists\nGOP teeing up racist ads going into midterms.",
    "National Republican Senatorial Committee chair Rick Scott has gotten very close to it, after claiming that he’s eager to welcome “immigrants who want to be Americans, not change America.”\nNor are they one bit sorry about running on racism.",
    "The two actually enjoy quite a cozy relationship, with a local chapter of the union awarding the racist outlet for its “reporting” back in 2015.",
    "\"I believe that they're trying to change the demographics of the electorate, that's what I believe they’re doing\" Judd responds to Hemmer.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Literally from the start of the Biden administration, they’ve lied and declared “open borders” as a political attack.",
    "Let’s also not pretend the white supremacist “replacement theory” spouted during this interview was an aberration.",
    "x\nFox News anchor Bill Hemmer: \"Sir, why do you think this administration has allowed virtually an open border?\"",
    "In just a couple of examples, it records its podcast in a studio owned by white supremacist rag Breitbart.",
    "Tucker Carlson has been a longtime fan, and has been echoed by top Republicans like Elise Stefanik.",
    "\"They want to stay in power and the only way to stay in power is to continue to get elected.\"",
    "Hemmer asks Judd, once again exposing the conundrum Republicans have created for themselves.",
    "Democrats can fight back by championing immigrants\nThis is a short blurb about Daily Kos.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "\"Sir, why do you think this administration has allowed virtually an open border?\"",
    "Brandon Judd\nThe Border Patrol’s union has consistently been up to no good.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "This is, to say the least, very worrying.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "I mean, it’s all they have.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Donate $5 monthly",
    "Please read it.",
    "But I digress."
  ]
}