{
  "id": 8229,
  "mediaId": 2540,
  "date": "2022-04-05",
  "headline": "Biden's immigration move divides Democrats as GOP plots election-year strategy",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220120115853-02-mccarthy-profile-super-tease.jpg",
  "link": "https://www.cnn.com/2022/04/05/politics/title-42-gop-election-strategy/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melanie Zanona, Manu Raju and Lauren Fox",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Michigan Sen. Gary Peters, who chairs the Senate Homeland Security and Governmental Affairs Committee, but also is in charge of the Senate Democratic campaign committee, said Tuesday, \"It's important that the administration has a plan to deal with what will happen as a result of lifting\" the policy even as he said he's \"confident\" it ultimately will.",
    "The GOP leadership has encouraged Republicans to participate in a so-called conga line on Wednesday, according to GOP sources, in which members will line up on the House floor and repeatedly ask for unanimous consent to consider a bill from Republican Rep. Yvette Herrell of New Mexico that would keep the Trump-era policy in place.",
    "Rep. Bennie Thompson, a Mississippi Democrat and the chairman of the House Homeland Security Committee, met Tuesday morning with Mayorkas to discuss the issue and warned that he still wanted to see a more robust plan for how the Homeland Security Department plans to combat a potential increase in border crossings this summer.",
    "Democrats in competitive reelection battles are now racing to distance themselves from President Joe Biden's decision-making and bracing for the possibility of a surge of migrants at the border, even as many acknowledge that the pandemic-era rule can't remain in perpetuity as a way to control the surge at the Southern border.",
    "The Title 42 move has upended efforts to pass a $10 billion Covid-19 relief bill, forced the Biden administration to quietly attempt to calm nerves on Capitol Hill and could lead to a series of tough questions for Health and Human Services Secretary Xavier Becerra on Wednesday when he goes before the House Budget Committee.",
    "Early Tuesday morning in the Capitol, Mayorkas walked into the lion's den, taking a meeting with House GOP members of the \"border security caucus\" -- a group of members particularly fired up over the announcement last week that the White House would lift Trump-era covid restrictions at the border, known as Title 42.",
    "The decision to end Title 42 -- which allowed migrants to be turned away at the border instead of processed under normal immigration rules during the global pandemic -- is already causing problems on the legislative front, potentially scuttling a push to pass $10 billion in long-sought aid to deal with the pandemic.",
    "As the thorny politics of immigration have caused a rift within the Democratic Party, with a number of the party's most vulnerable members revolting against the Title 42 move, Republicans see the matter as a rallying cry that will be central to their push to take back the House and the Senate in the fall.",
    "Republicans are confident that hammering Democrats over the border will not only energize their base, but also resonate with moderate and independent voters -- especially since they have linked border security to the fentanyl crisis that has impacted communities all around the country.",
    "\"It was a rough crowd, and you got to give him a lot of credit for picking the roughest crowd, going in, and listening to them,\" said Rep. Darrell Issa, a California Republican who attended the private briefing, where Mayorkas appeared voluntarily.",
    "One reason the GOP feels like it has the political upper hand: the National Republican Congressional Committee has shown members internal polling that shows the border is a salient issue in battleground districts, according to GOP sources.",
    "On Monday evening, the House Republican conference held a briefing with border patrol agents to hear how the end of Title 42 will impact their operations, then followed it up with a news conference in the Capitol afterward.",
    "This includes the increased use of technology, on-ground monitoring, use of drones and additional support personnel to supplement (Border Patrol) agents and free them up from processing duties whenever possible.\"",
    "Republicans have already taken dozens of trips to the southern border since last year, and there are more in the works in the near future: McCarthy said he will lead another border trip at the end of this month.",
    "Chris Magnus, commissioner of US Customs and Border Protection, said once the policy ends May 23, they have taken a number of steps to prepare for an influx of migrants and beef up security at the border.",
    "Conservative Rep. Chip Roy of Texas filed the petition last year, but has been steadily building support for it ever since; the effort picked up new steam in the wake of Biden's Title 42 announcement.",
    "And last week, sources said Republican leaders began officially whipping support for a \"discharge petition\" that would force a floor vote on that same bill if 218 lawmakers sign on to the effort.",
    "\"It's the right thing to do, but I don't know if it will be a political problem or not,\" Rep. Jerry Nadler, a Democrat from New York and chairman of the House Judiciary Committee, said Wednesday.",
    "Republicans say they're not done yet, planning theatrics this week to consume the House floor and try to force votes on the issue -- all an attempt to put the squeeze on vulnerable Democrats.",
    "\"We are doing everything we can to prepare for this increase, ensure we continue to process people humanely, and impose consequences on those who break the law,\" Magnus said in a statement.",
    "This is a national security issue that's gonna further get worse as time goes on this summer,\" said Rep. John Katko of New York, the top Republican on the House Homeland Security Committee.",
    "But unlike many vulnerable Democrats, Senate Majority Leader Chuck Schumer has backed the White House's move on Title 42, saying the current policy \"wreaked havoc on our asylum system.\"",
    "But both the House and Senate Democratic chairmen of the homeland security committees are not yet sold on the administration's plan -- even after getting briefed regularly by Mayorkas.",
    "Such an amendment would divide Democrats -- and could potentially pass the Senate -- and threaten the White House's immigration policies while embarrassing the President.",
    "Sen. Raphael Warnock, a Georgia Democrat who is close to the White House but who also faces voters this year, made clear his displeasure with the administration's move.",
    "\"This is a national security issue for the country, it's a public health issue as well -- not only for people in communities on the southern border, but for migrants.",
    "(CNN)Republicans had already been agitating over the Biden administration's policies at the border -- and then in came Homeland Security Secretary Alejandro Mayorkas.",
    "And the New York Democrat is rejecting calls for a vote on an amendment over the issue, a fight that could stall the package for vaccines and therapeutics for weeks.",
    "\"The bottom line is this is a bipartisan agreement that does a whole lot of important good for the American people: vaccines, testing, therapeutics,\" Schumer said.",
    "\"You know, President Biden, Vice President Kamala Harris, said they would do something about this and they have not,\" House Minority Leader Kevin McCarthy said.",
    "When asked if he would support the discharge petition, Rep. Dean Phillips, a Minnesota Democrat in a tough reelection race, said he would have to look at it.",
    "On Tuesday, Republicans blocked an effort to advance the Covid relief plan as they demanded votes on amendments -- namely one to target the Title 42 policy.",
    "In a private lunch on Tuesday, one Senate Democrat told CNN that the consensus among Democrats was to try and avoid holding a vote on the measure at all.",
    "But Phillips also made clear he has concerns with Biden's Title 42 decision, and said he has begun to express some of those worries to the White House.",
    "Asked if he was convinced that the administration's policies will be able to combat a surge, he said, \"Well, I will wait until I see the policy.\"",
    "GOP plots midterm plans\nHouse GOP leaders are eager to keep Title 42 in the spotlight, with a strategy that is largely centered around messaging.",
    "Added Rep. Brian Babin of Texas, the co-chairman of the caucus: \"We appreciated his courage to come in, knowing that we were opposed to him 100%.",
    "\"There are options,\" Sen. Mark Kelly, an Arizona Democrat up for reelection in the fall, said when asked if he'd back an amendment on the issue.",
    "Rep. Tom Emmer of Minnesota, the head of the House GOP's campaign arm, told CNN: \"Democrats will pay a political price for their incompetence.\"",
    "When asked if impeachment proceedings could be launched against Mayorkas in a GOP majority, Babin replied, \"Definitely on the table.\"",
    "While some leading Democrats say the policy must be lifted, they are uncertain about the political price they may pay for it.",
    "\"Obviously, the administration has to come with policies that would convince the public that this issue will be managed.",
    "But asked if he supports lifting Title 42, Peters said: \"I want to see the plan, but it's still a work in progress.\"",
    "So far, 211 members have signed the petition: every single House Republican besides Rep. Adam Kinzinger of Illinois.",
    "\"Nothing was really resolved, other than he made a promise to give a number of follow-up pieces of information.\"",
    "It appalled me, as it should appall any member of Congress, Democrat or Republican, and any American,\" he said.",
    "\"Security of the border is everything,\" said West Virginia Sen. Joe Manchin, a leading moderate Democrat.",
    "\"And I do concur that there should be a thoughtful, actionable plan in place before rescinding it.",
    "\"It's far more than just aliens coming across, it's far more than just the drugs coming across.",
    "\"At the same time, we will continue to use all available resources to secure our borders.",
    "The administration says it does have a plan to deal with the expected surge.",
    "And we have to get our head straight about this and get secured borders.\"",
    "I am being told those policies are being worked on as we speak.\"",
    "\"I would be shocked and dismayed if they don't,\" Phillips added.",
    "CNN's Ted Barrett and Morgan Rimmer contributed to this report.",
    "\"It's obvious that there's not a plan in place,\" Kelly said.",
    "\"It should not be held hostage for an extraneous issue.\"",
    "But we were not satisfied with the answers he gave us.\"",
    "\"I think this is the wrong time,\" Warnock told CNN.",
    "\"If you think it's bad policy, then put it up.\"",
    "Not controlled, but managed,\" Thompson said.",
    "Republicans said they gave him an earful.",
    "\"I've been to the southern border twice.",
    "Just put it on the floor,\" Roy said.",
    "\"They've only opened it up worse.\"",
    "\"The policies have to be clear.",
    "\"And I haven't seen a plan.\"",
    "We need an orderly process.\"",
    "\"What are they afraid of?",
    "Plain and simple.\"",
    "\"It's everything.",
    "\"Have I seen it?",
    "No.\"",
    "..."
  ]
}