{
  "id": 8255,
  "mediaId": 8350,
  "date": "2022-04-05",
  "headline": "Sinema has no confidence for safe, workable plan after ban lifted on asylum seekers at border",
  "image": "https://ktar.com/wp-content/uploads/2022/04/ap_88acb6df03b344829e2e6a87f13f8d6f-2.jpg",
  "link": "https://ktar.com/story/4991149/sinema-has-no-confidence-for-safe-workable-plan-after-ban-lifted-on-asylum-seekers-at-border/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DANNY SHAPIRO",
  "authorUrl": "https://ktar.com/story/author/dshapiro/",
  "termIds": [
    0
  ],
  "sentences": [
    "Sinema and Mark Kelly, Arizona’s other Democratic senator, have been vocal about their distaste for ending Title 42 — named for a 1944 public health law — by May 23 because a plan to safely manage asylum seekers hasn’t been communicated by the Biden administration.",
    "While officials said at the time that it was a way to keep COVID-19 out of the United States, there always has been criticism that the restrictions were used as an excuse to seal the border to migrants that Trump did not want to let in anyway.",
    "PHOENIX — U.S. Sen. Kyrsten Sinema of Arizona said Tuesday she has no confidence in the Biden administration to form a workable plan after it lifts the ban on asylum seekers at the U.S.-Mexico border next month.",
    "But Trump dramatically changed how the U.S. system functions, shrinking the number of asylum-seekers allowed into the U.S. and adding restrictions that caused the backlog of immigration court cases to explode.",
    "I am very concerned about the impact this will have on our border communities.”\nThe Title 42 restrictions went into place in March 2020 under the Trump administration as coronavirus cases soared.",
    "Biden came into office promising a return to more “humane” immigration policies after the Trump administration, which separated thousands of children from their parents at the border.",
    "Homeland Security Secretary Alejandro Mayorkas and will hold a hearing with him soon so he can explain how they will implement a fair, humane process for asylum seekers.",
    "The health order has caused migrants to be expelled from the United States more than 1.7 million times since March 2020 without a chance for them to request asylum.",
    "“We know what is coming … Arizona has been paying the price from the federal government’s failure to fix the system for years,” Sinema said.",
    "Sinema said she was briefed that as many as a million migrants could approach the southern border in the six weeks after the ban is ended.",
    "“The reality is they don’t have a plan in place,” Sinema, a Democrat, told KTAR News 92.3 FM’s Gaydos and Chad.",
    "But Sinema’s concerns are growing as the end date nears without affirmation of a new plan.",
    "“It’s difficult on DHS and the nonprofits in Arizona to keep people safe,” Sinema said.",
    "“What we’re facing is a crisis that is very challenging but is not new.",
    "The Associated Press contributed to this report.",
    "Sinema said she spoke directly with U.S."
  ]
}