{
  "id": 8299,
  "mediaId": 2562,
  "date": "2022-04-07",
  "headline": "Biden Move Lifting COVID Curbs on Migrants at Border Has Dems on Defensive",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid1550B3C5-24E4-47A2-A07E-56C9AB04FF2D.jpg",
  "link": "https://donaldjtrumppolls.com/biden-move-lifting-covid-curbs-on-migrants-at-border-has-dems-on-defensive/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "Biden Move Lifting COVID Curbs on Migrants at Border Has Dems on Defensive (Dreamstime)\nRichard Cowan Thursday, 07 April 2022 05:41 PM\nDemocrats in the U.S. Congress on Thursday pushed back against President Joe Biden's lifting of a pandemic-related rule expelling immigrants seeking asylum, with others supportive of the policy saying the administration needed to do more work to prepare for a surge in migrants.",
    "Republicans, who aim to recapture control of one if not both chambers of Congress in the Nov. 8 elections, seized on the move, which Senate Republican Leader Mitch McConnell said amounted to Democrats \"supercharging their border crisis.\"",
    "Biden has until May 23 to ensure federal agencies are prepared for a spike in immigrants trying to enter the United States from Mexico, where many have been forced to stay while awaiting action on their asylum claims.",
    "Rep. Ruben Gallego said he and his fellow Democrats must shift constituents' attention to the need for comprehensive immigration reform, which Republicans in Congress repeatedly have stymied.",
    "\"I want to see the plan that the administration has to address this, as a lot of my colleagues do,\" said Rep. Pete Aguilar, the vice chairman of the 221-member House Democratic Caucus.",
    "With apprehensions at the border already at high levels, there are estimates of those numbers more than doubling to around 18,000 per day, prompting a Republican outcry.",
    "Democratic Sen. Joe Manchin, who represents the Trump-loving state of West Virginia and who has challenged several Biden initiatives since last year, also has joined in.",
    "Former President Donald Trump imposed the ban, called the \"Title 42\" rule, in early 2020, which led to more than a million migrants and asylum-seekers being expelled.",
    "A handful of Democratic senators, most of them facing challenging re-election bids, proposed legislation delaying Biden's move.",
    "Their stance, alongside solid Republican opposition, has jeopardized a $10 billion COVID-19 aid bill Biden urgently is seeking.",
    "Maggie Hassan, Raphael Warnock, Mark Kelly and Catherine Cortez Masto want to stop the rule from being lifted.",
    "The Trump administration said at the time it would reduce coronavirus infections in the United States.",
    "They are in re-election campaigns in New Hampshire, Georgia, Arizona and Nevada, respectively.",
    "Greg Abbott on Wednesday said he would transport some of the migrants directly to Washington.",
    "\"There's a lot more that needs to be done.\"",
    "Original Article",
    "Texas Gov.",
    "Sens."
  ]
}