{
  "id": 8359,
  "mediaId": 2877,
  "date": "2022-04-06",
  "headline": "The Border Is About to Get Even Worse",
  "image": "https://img.patriotpost.us/01F99DYKCZZ9R7BJS5B5Q2M0HH.jpeg?w=1200&h=600",
  "link": "https://patriotpost.us/articles/87470-the-border-is-about-to-get-even-worse-2022-04-06",
  "mediaOutlet": "patriot post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nate Jackson /",
  "authorUrl": "https://patriotpost.us/contributors/294",
  "termIds": [
    1973,
    1929,
    2459,
    2765,
    5879,
    5844,
    5802,
    4905,
    392
  ],
  "sentences": [
    "Because Biden effectively shut down a Trump-era program called the Migrant Protection Protocols (also called Remain in Mexico) that forced migrants to wait in Mexico while their asylum cases were adjudicated, most migrants who claim asylum will be released into the United States pending the outcome of their cases, which on average take about three years.",
    "House Minority Leader Kevin McCarthy is opposed, of course, but so are several Democrat senators — Joe Manchin, Kyrsten Sinema, Mark Kelly, Mark Warner, and Maggie Hassan are warning that Biden’s decision to open the borders even further will result in nothing but a surge of new border crossers.",
    "To further illustrate the ideological “progress” Democrats have made, consider this 2019 statement from Barack Obama’s Homeland Security Secretary Jeh Johnson regarding his daily briefing: “If it was under 1,000 apprehensions the day before, that was a relatively good number.",
    "This will be done while ensuring that migrants can apply for any form of relief or protection for which they may be eligible, including asylum, withholding of removal, and protection from removal.”\nHow do you “prevent” a surge by opening the doors to all comers?",
    "Indeed, political analyst John Daniel Davidson succinctly sums it up:\nEnding Title 42 means a return to the pre-Covid process, which allows almost anyone who crosses the border, even those who cross illegally, to file a claim for asylum.",
    "“There are a significant number of individuals who were unable to access the asylum system for the past two years, and who may decide that now is the time to come.”\nDon’t miss that Magnus blames pent-up demand, not Biden’s open door.",
    "In other words, ending Title 42 under these circumstances means every migrant who gets over the border and claims asylum will get to remain in the United States, legally and with work authorization, for years.",
    "That all began to change when they realized what a huge pool of voters a massive immigrant population would one day be — Democrats believed it was their demographic destiny to be the permanent majority.",
    "In his February strategy, he said: “The purpose of this plan is to describe a proactive approach that humanely prevents and responds to surges in irregular migration across the U.S. [southern border].",
    "Yet with the border already in crisis, lifting the last meaningful protection against a full-blown border surge just ahead of summer hardly seems to be in America’s interest.",
    "And if it was above 1,000, that was a relatively bad number and I was going to be in a bad mood the whole day.” He went on: “On Tuesday, there were 4,000 apprehensions.",
    "“As a result of the CDC’s termination of its Title 42 public health order, we will likely face an increase in encounters above the current high levels,” Magnus said.",
    "And their plan is not to process and deport illegals, but to process and release them, all why relabeling them “asylum seekers” to generate compassion.",
    "To be fair, with the coronavirus finally fading into the rearview mirror, it’s not entirely unreasonable to do away with another pandemic restriction.",
    "It’s a public health order that essentially allowed the Border Patrol to immediately expel more migrants as a means to limit the spread of COVID-19.",
    "I cannot begin to imagine what 4,000 a day looks like, so we are truly in a crisis.”\nJohnson was trying to discredit Donald Trump.",
    "While putting a patina of enforcement on it, U.S. Customs and Border Protection Commissioner Chris Magnus says you don’t.",
    "They were pro-border security because they understood that illegal immigrants take American jobs and depress wages.",
    "Today’s Democrats have “progressed” even further and fundamentally eschew the idea of borders at all.",
    "That’s the background for Joe Biden’s move to end Title 42 provisions for border enforcement.",
    "But under Biden, there have been on average more than 5,000 apprehensions per day.",
    "As a matter of policy, it is effectively indistinguishable from open borders.",
    "Not that long ago, Democrats claimed to be the party of the working class.",
    "Biden’s DHS Secretary Alejandro Mayorkas practically admitted as much.",
    "The bigger problem is that, to Biden, a surge is a feature, not a bug.",
    "Biden’s answer is effectively to quit making apprehensions.",
    "Democrats never have understood supply and demand.",
    "I know that a thousand overwhelms the system.",
    "Several states are suing.",
    "(Now do airlines.)",
    "What is Title 42?"
  ]
}