{
  "id": 8381,
  "mediaId": 8309,
  "date": "2022-04-06",
  "headline": "Desert Lightning News Digital Edition – April 2022",
  "image": "https://www.aerotechnews.com/davis-monthanafb/wp-content/uploads/sites/6/2022/04/040122DLNAZFP.jpg",
  "link": "https://www.aerotechnews.com/davis-monthanafb/2022/04/06/desert-lightning-news-digital-edition-april-2022/",
  "mediaOutlet": "Desert Lightning News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aerotech News",
  "authorUrl": "",
  "termIds": [
    2459,
    410,
    6,
    24,
    370,
    6667
  ],
  "sentences": [
    "https://online.flipbuilder.com/vzwd/zkea/\nHere are some more highlights from our April issue:\nDavis-Monthan history highlights: page 2\nACC Leadership visits Lead Wing, certifies Heritage Flight Training Course: page 3\nDedication: Major George W. Biggs Integrated Resiliency Center: page 5\nPhoto Feature: Behind the scenes at 2022 Heritage Flight Training Course: pages 6 & 7\nDM’s Senior Master Sergeant selects announced: page 10\nAll this and much more, in this edition of Desert Lightning News!",
    "55th Wing, Detachment 1 will conduct IW training and research events to address the growing importance of operations in the information environment and the electromagnetic spectrum, as they relate to strategic power competition.",
    "“Like” our page for daily news updates – we now regularly cross-post news and features from the military bases we serve throughout the desert Southwest, as an extension of our military and defense community.",
    "This is a very timely development in view of continuing cybersecurity threats worldwide, and we have coverage for you, and much more news, in this month’s issue of Desert Lightning News.",
    "“Focusing our offensive and defensive capabilities in the digitally-enabled domain is critical to honing our lethality in strategic competition,” said Gen. Mark Kelly, commander of ACC.",
    "Big news out of D-M this month, as Air Combat Command stood up a new organization to accelerate Information Warfare training and research.",
    "Hard copies of the paper will be available at various distribution points on base and in surrounding communities starting April 1st.",
    "Pick one up when you’re out and about, or visit our website, www.aerotechnews.com, for much more military and defense industry news.",
    "Click on the link below for the latest digital edition of DLN, viewable on your computer or mobile device.",
    "Hello everyone, and welcome to the April 2022 edition of Davis-Monthan AFB Desert Lightning News!",
    "Digital and print publication serving Davis-Monthan AFB, Tucson AZ and surrounding communities.",
    "As always, THANK YOU for your support – it’s our privilege to serve you!",
    "#aerotechnews #dmafbnews #desertlightningnews",
    "An AerotechNews.com Publication.",
    "Be safe and be well."
  ]
}