{
  "id": 8481,
  "mediaId": 2668,
  "date": "2022-04-06",
  "headline": "Chip Roy Just Lights up Jerry Nadler in Heated Exchange About Title 42 and the Border Crisis",
  "image": "https://media.townhall.com/townhall/reu/o/2022/96/092bac4c-3388-4af0-9250-daa289d179ab-1110x740.jpg",
  "link": "https://redstate.com/sister-toldjah/2022/04/06/chip-roy-just-lights-up-jerry-nadler-in-heated-exchange-about-title-42-and-the-border-crisis-n546294",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sister Toldjah",
  "authorUrl": "https://redstate.com/author/sister-toldjah",
  "termIds": [
    0
  ],
  "sentences": [
    "If there’s one thing I can never get enough of from a political standpoint, it’s seeing House and Senate Democrats get their patooties handed to them and then some by their Republican colleagues over their notorious unwillingness to take Republican concerns about the ongoing border crisis seriously.",
    "Roy also noted that Democrats on the committee didn’t seem to care that ranchers on the border were in some cases losing their livelihoods because their fences were getting cut by illegal immigrants and sex traffickers, who would let out livestock the ranchers had worked years to build up.",
    "Joe Manchin (WV), Kyrsten Sinema (AZ), Mark Kelly (AZ), Maggie Hassan (NH), and Raphael Warnock (GA) expressed dismay over the news, with Warnock stating that “this is not the right time” and Manchin calling it “frightening” while indicating he’d support making Title 42 permanent.",
    "Not surprisingly, the CDC’s announcement enraged Republicans, especially those who represent the southern states hardest hit by the influx of illegal immigrants like Arizona and Texas and who will be hit again with a tidal wave of them once Title 42 expires.",
    "Rep. Chip Roy (R-Texas) was one, and during a House Judiciary Committee markup Wednesday, Roy absolutely lit into Chairman Jerry Nadler (D-N.Y.) who Roy said “scoffed” when he brought up the fact that young girls are being raped at drug cartel stash houses.",
    "Open borders Democrats and their affiliated special interest groups have of course opposed Title 42 from the start, calling it “unnecessary” and “inhumane.”\nFlashback: Chip Roy Goes Nuclear on Nancy Pelosi’s Mask Obsession in Scorching House Floor Speech",
    "What I found particularly noteworthy about their back and forth was Roy’s genuine emotion and how at one point he managed to make even Nadler appear contrite, getting him to admit he was aware of the rapes that were occurring at the stash houses.",
    "And Roy, as a representative of a Texas Congressional district, let them know it:\nWATCH: Rep. @chiproytx rips into Jerry Nadler and Democrats for ignoring the crisis on our border:\n\"Has the Chairman been in the last year to the border of Texas?",
    "In a heated exchange, Roy pointed a finger at Nadler and other Democrats on the panel, telling them that he was “sick and tired” of Democrats “scoffing at Texas,” one of the states that gets hit the worst when the border surges take place.",
    "Title 42 was implemented by the Trump administration at the start of the Wuhan virus pandemic in March 2020 to limit the spread of COVID-19 from illegal immigrants who came from countries with high rates of communicable diseases.",
    "In the aftermath of the CDC’s Friday statement noting they believed the policy was “no longer necessary,” even some Democrats – including Sens.",
    "According to various news reports, some 1.7 million illegal immigrants apprehended at the border have been deported under the policy.",
    "As we previously reported, the concern about the Biden administration’s stance has not been limited to Republicans.",
    "We are now into year two of Joe Biden’s border crisis, and not only has the situation not improved (thanks, Kamala!",
    "We need more of that type of sincere passion coming from Republicans and much less posturing on this issue.",
    "And met with border patrol agents, gone down and talked to the people seeing what is actually happening?\"",
    "This isn’t a laughing matter nor is it a can that Democrats should continue to kick down the road.",
    "), but the Biden administration is now making plans to let Title 42 expire at the end of May.",
    "pic.twitter.com/iPR5ReGP0s\n— X Strategies LLC (@XStrategiesLLC) April 6, 2022\nBravo."
  ]
}