{
  "id": 8488,
  "mediaId": 2658,
  "date": "2022-04-05",
  "headline": "‘Terrible’ messaging on lifting of Trump-era border restriction alarms Dems",
  "image": "https://static.politico.com/bc/f3/218ec5fe4cd3ae7837106bb34dee/nevada-senate-78606.jpg",
  "link": "https://www.politico.com/news/2022/04/05/messaging-trump-border-restriction-democrats-00023082",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We’re not offering any vigorous defense on the issue… and when Democrats just retreat from an issue like that, then you cede all of the ground to Republicans to fill headlines,” he said, adding that those criticizing the end of Title 42 have clearly calculated “it’s politically expedient for them to be mouthing off about open borders in a Senate race.”\nAmid the fractured Democratic response, the GOP has ramped up its criticism of Democrats’ position on immigration, arguing that the end of Title 42 will worsen the situation at the U.S. southern border.",
    "Instead, the administration is acting without a detailed plan.”\nKelly called it the “wrong decision,” adding that “it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities.”\nDemocrats criticizing the Title 42 announcement “are scared to death that Republicans are going to spend money saying they are for open borders and for letting in what Donald Trump called ‘bad people,’” said Chuck Rocha, a longtime Democratic consultant.",
    "“The people at the head of the Democratic Party… don’t have a desire to speak about immigration and when they do, don’t know how to speak about it effectively and simply don’t have an effective rebuff to what Republicans are attacking us on,” said Sawyer Hackett, executive director of former Democratic presidential candidate Julián Castro’s PAC People First Future.",
    "Senate Minority Leader Mitch McConnell summed up his party’s position, calling it an “unbelievably bad decision” that is “going to throw open the floodgates even wider.” Senate Republicans this week are also considering whether to put the issue front and center this week by linking the end of the policy with a Covid-19 deal.",
    "“Title 42 is a public health regulation that should never have been used as a border enforcement policy, and its misguided implementation put countless people in danger and wreaked havoc on our asylum system that desperately needs repair.”\nThe administration itself has seemingly sought to distance itself from the fallout.",
    "It doesn’t make political sense.”\nWhile progressives have largely called the rescission of Title 42 — which allowed border agents to quickly kick out thousands of migrants — long overdue, moderates have slammed the administration for proceeding without a plan to handle an expected surge of migrants.",
    "Republicans across the country have spent millions of dollars on ads painting President Joe Biden and the party as supporters of open borders, responsible for sowing chaos at the U.S. southern border — and that was before the administration announced its plan to end the rule in late May.",
    "Mark Kelly of Arizona, Raphael Warnock of Georgia, Catherine Cortez Masto of Nevada and Maggie Hassan of New Hampshire — have all spoken out against the Biden administration’s move, echoing GOP concerns about a coming spike in the number of migrants arriving at the border.",
    "A solution, however, remains out of sight — Biden, who campaigned largely on reversing Trump-era immigration policies, has repeatedly run up against legal, logistical and political challenges in his efforts to reform the U.S. immigration system.",
    "Officials, including Homeland Security Secretary Alejandro Mayorkas and White House communications director Kate Bedingfield, have emphasized that the decision to lift the order rests solely on the Centers for Disease Control and Prevention.",
    "Immigrant advocates and public health experts — and many top Democrats — for months have pushed back on the Biden administration’s continued use of Title 42, calling it unlawful, inhumane and not justified by public health considerations.",
    "In March alone, GOP candidates in races up and down the ballot ran more than 80 television ads — everywhere from Alabama to Nebraska to Ohio — that mention securing the U.S. southern border, according to AdImpact, an ad tracking service.",
    "“Republicans have flooded the zone with their message and we have an opportunity as Democrats to say, ‘OK, well, this is our vision for how we make the southwest border region better,’” said Kristian Ramos, a Democratic consultant.",
    "| Patrick Semansky/AP Photo\nBy Sabrina Rodriguez\n 04/05/2022 01:58 PM EDT\nDemocrats have long known that the Trump-era border restriction known as Title 42 would have to be lifted as other pandemic restrictions eased nationwide.",
    "“Title 42 is not an immigration authority, but rather a public health authority used by the Centers for Disease Control and Prevention to protect against the spread of communicable disease,” Mayorkas said in a statement.",
    "Had the administration opted to end the use of Title 42 months ago, it “could have dealt with this inevitable surge we’re talking about back then,” instead of in a midterm election year, said Hackett.",
    "They’ve argued that the policy, enacted in March 2020, has been utilized not to keep Covid-19 out of the U.S., but to keep migrants from seeking asylum, a legal right under U.S. and international law.",
    "“It’s not the policy they’re scared of — it’s the ads.”\nRocha added that Democrats are consistently “trying to play defense” on the issue — and he doesn’t see a widespread change of strategy in sight.",
    "Rather, the party has been unable to settle on a unified message on immigration and border policy — a disconnect the party cannot afford with their slim Senate majority hanging in the balance.",
    "\"This is the wrong way to do this and it will leave the administration unprepared for a surge at the border,” Sen. Catherine Cortez Masto (D-Nev.) said in a statement to POLITICO.",
    "“Our messaging has been terrible… and now we’re talking about a potential surge in a midterm year where they’re going to be attacked by Republicans and Democrats.",
    "“This is the wrong way to do this and it will leave the administration unprepared for a surge at the border,” Cortez Masto said in a statement to POLITICO.",
    "“It’s long overdue for Title 42 to end,” Senate Majority Leader Chuck Schumer and Sen. Alex Padilla (D-Calif.) said in a joint statement.",
    "“We should be working to fix our immigration system by investing in border security and treating immigrant families with dignity.",
    "Still, many were caught flat-footed last week by the Biden administration’s plan to lift the public health order.",
    "And lawmakers have failed for decades to reach any agreement to pass comprehensive immigration reform.",
    "“Because at the end of the day, this is the right thing to do… They’ve just gotta sell the vision.”",
    "The problem wasn’t that they were blindsided by the announcement.",
    "The four most vulnerable Senate Democrats — Sens.",
    "Other Democrats have said nothing at all."
  ]
}