{
  "id": 8499,
  "mediaId": 6461,
  "date": "2022-04-07",
  "headline": "Spiralling fuel prices add to Democrats’ woes",
  "image": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20220409_WOT104.png",
  "link": "https://www.economist.com/graphic-detail/2022/04/07/spiralling-fuel-prices-add-to-democrats-woes",
  "mediaOutlet": "Economist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2346,
    4905,
    392,
    46,
    5949,
    6026,
    6678,
    6569,
    6431
  ],
  "sentences": [
    "A gallon of petrol in California cost $5.80 as of April 7th, the most expensive of any state—but that is a distinction that it has long held, owing to the hefty environmental taxes the state levies.",
    "A full tank still costs far less than in Europe, but motorists now spend an average of $1.30 more a gallon than this time last year, according to the American Automobile Association.",
    "A recent poll by Emerson College finds that 39% blame Mr Biden’s administration, against 21% who fault sanctions on Russia and 18% who say oil and gas firms are responsible.",
    "THREE THINGS move the needle on public opinion in America, says Denton Cinquegrana of OPIS, an oil-price-reporting agency: “politics, religion and gas prices”.",
    "Mr Biden has tapped reserves to release 1m barrels of oil a day for six months; national prices have fallen marginally in the past three weeks.",
    "Unfortunately for Mr Biden, swing states including Arizona, Nevada and Pennsylvania have some of America’s next-highest petrol costs.",
    "In Nevada a Republican advertising campaign pins the blame on the state’s Democratic senator, Catherine Cortez Masto, and her party.",
    "Such cuts are wasteful and perverse: ultimately, governments should be reducing demand for fuel, not encouraging it.",
    "Bad news, then, for Democrats, who face record prices at the pump ahead of mid-term elections in November.",
    "Some states, including Arizona and Nevada, are cutting fuel duty in a bid to make petrol more affordable.",
    "For a look behind the scenes of our data journalism, sign up to Off the Charts, our weekly newsletter.",
    "In Arizona, where a Democratic senator, Mark Kelly, is vulnerable, prices are up by 50%.",
    "The price of petrol in the state has risen by 55% from a year ago, to $5.20 a gallon.",
    "But politicians hope a little populism will power them through crucial elections.",
    "Republicans are blaming the increase on President Joe Biden’s climate policies.",
    "In some states, higher prices have long been the norm for other reasons too.",
    "Our recent coverage of the Ukraine crisis can be found here."
  ]
}