{
  "id": 8516,
  "mediaId": 2627,
  "date": "2022-04-06",
  "headline": "The GOP's Title 42 blowup is holding up Covid funding",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220406-ROB-Title-42-jg-e75ae7.jpg",
  "link": "https://www.msnbc.com/the-reidout/reidout-blog/title-42-covid-bill-rcna23203",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ja'han Jones",
  "authorUrl": "https://www.msnbc.com/author/ja-jones-ncpn371241",
  "termIds": [
    0
  ],
  "sentences": [
    "That sliver of Democratic support for the policy is complicating things for Schumer, who on Tuesday said Covid relief “should not be held hostage for an extraneous issue.”\nThe Democratic leader needs 60 votes to overcome a filibuster, which he doesn’t currently have.",
    "Republican lawmakers, who have long called for an end to Covid safety measures in the United States, are almost uniformly opposed to more Covid funding unless it comes with an opportunity to target migrants with an unnecessary health measure.",
    "Senate Democrats like Manchin, Kelly and Sinema might vote in favor of a Title 42 amendment, endangering its passage in the House of Representatives, where there’s far less support for continuing the policy.",
    "The policy, known as Title 42, was introduced during the Trump administration and allows the government to use concerns over the spread of Covid as a rationale to turn migrants away at the border.",
    "Last week, the Centers for Disease Control and Prevention announced it was finally scrapping the policy all together, saying it was “no longer necessary” and would be phased out by May 23.",
    "Conservatives in the Senate are holding up much-needed Covid response funding unless Democratic leadership agrees to vote on additions that could tank the bill's chances of passing.",
    "And conservatives are effectively giving him and like-minded Democrats an ultimatum: If you want Covid funding, let us vote to include a measure that demonizes migrants.",
    "Sen. Mitt Romney, R-Utah, told reporters last week that he had reached a deal with Senate Majority Leader Chuck Schumer, D-N.Y., on a $10 billion Covid aid package.",
    "But Senate Republicans refused to advance the bill on Tuesday, vowing to block it unless there's a vote to reinstate a contentious immigration policy.",
    "Regardless, Senate Minority Leader Mitch McConnell, R-Ky., said the Covid bill wouldn't move forward without an amendment reinstating Title 42.",
    "Some conservative-leaning centrists in the Democratic Party, including Sen. Joe Manchin of West Virginia and Sens.",
    "Health officials have said the Covid funding is essential in combating current and new variants of the virus.",
    "Mark Kelly and Kyrsten Sinema of Arizona, also want Title 42 reinstated, despite the CDC’s guidance.",
    "But human rights experts still warn of the policy's unfair and dangerous impact on migrants.",
    "Republicans, hellbent on their anti-immigration stance, are trying to bring the policy back.",
    "The Biden administration phased out Title 42 for unaccompanied child migrants last month.",
    "So that’s the current state of affairs when it comes to Covid funding.",
    "And they may have help from Democrats."
  ]
}