{
  "id": 8561,
  "mediaId": 2640,
  "date": "2022-04-06",
  "headline": "Cosmonauts 'Blindsided' by Hubbub Over Spacesuits",
  "image": "https://img2-azrcdn.newser.com/image/1407197-12-20220406102708.jpeg",
  "link": "https://www.newser.com/story/318989/us-astronaut-cosmonauts-yellow-outfits-werent-ukraine-statement.html",
  "mediaOutlet": "newser.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jenn Gidman",
  "authorUrl": "https://www.newser.com/bio/83598875/jenn-gidman.html",
  "termIds": [
    5431,
    3604,
    4035,
    2459,
    652,
    1394,
    6569,
    6672
  ],
  "sentences": [
    "Speaking at a Tuesday presser, Vande Hei revealed that Oleg Artemyev, Denis Matveyev, and Sergey Korsakov were actually wearing the colors of Bauman Moscow State Technical University, the school they all attended, and were thrown by the hubbub that erupted over their uniforms.",
    "(Newser) – Last month, three Russian astronauts showed up at the International Space Station sporting bright yellow flight suits with blue accents—Ukraine's colors, leaving some wondering if the cosmonauts were making a statement on Russia's invasion of that country.",
    "ZDNet also reports on a recent Twitter tiff between retired astronaut Mark Kelly and Dmitry Rogozin, head of Russia's Roscosmos space agency, in which Kelly slammed Russia's invasion, while Rogozin seemed to threaten that cosmonauts would abandon Vande Hei in space.",
    "Vande Hei conceded he did talk with his \"very dear friends\" in space over what was happening in Ukraine, but he noted those conversations were short, and he's not saying how the Russians felt about the war.",
    "\"I never perceived those tweets as anything to take too seriously,\" Vande Hei said, calling the social media posts something \"meant for a different audience than myself.\"",
    "I think they were kind of blindsided by it,\" said Vande Hei, now back on Earth after spending a record-busting 355 days in space, per the Washington Post.",
    "Wonder no more, because that simply wasn't the case, American astronaut Mark Vande Hei now says, per CNN.",
    "The cosmonauts \"had no idea that people would perceive that as having to do with Ukraine ...",
    "He added, per CNN: \"I just didn't spend a lot of emotional energy paying attention to it.",
    "\"Our focus was on our mission together,\" he said.",
    "I kind of laughed it off and moved on.\"",
    "(Read more cosmonauts stories.)",
    "..."
  ]
}