{
  "id": 8617,
  "mediaId": 2877,
  "date": "2022-04-05",
  "headline": "Tuesday Short Cuts",
  "image": "https://img.patriotpost.us/01FZTKBF4T5BEMK7J9V02KJAHA.jpeg?w=1200&h=600",
  "link": "https://patriotpost.us/articles/87408-tuesday-short-cuts-2022-04-05",
  "mediaOutlet": "patriot post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Candler /",
  "authorUrl": "https://patriotpost.us/contributors/295",
  "termIds": [
    2459,
    2437,
    4905,
    5510,
    5949
  ],
  "sentences": [
    "I think we are a generous country, but we have to be a country of rule of law.” —Senator Mark Warner\nSacrilege\n“To everyone celebrating Transgender Day of Visibility, I want you to know that your president sees you … for who you are: made an image of God and deserving of dignity, respect and support.” —Joe Biden (“Biden appeared to be referring to Genesis 1:27, which states that ‘God created man in his own image’ — a reality that Christians have indeed pointed to throughout history as the foundation for human equality.",
    "However, the passage — which adds that ‘male and female he created them’ — also happens to be the foundation for the gender binary.” —Ben Zeisloft)\nVillage Idiot\n“I’d rather pay 20 bucks a gallon [for gas] than have Trump in office.” —former NFLer Shannon Sharpe\nAnd Last…\n“The full-scale meltdown on the Left at the prospect of losing its privilege to indoctrinate other people’s kids in Gender Ideology and CRT is a great indicator that, for the rest of us, this is the ground to fight on.” —Abigail Shrier",
    "From my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and non-profits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities.” —Senator Mark Kelly\n“Prematurely ending Title 42 without a comprehensive, workable plan would put at risk the health and safety of Arizona communities and migrants.",
    "Insight\n“Democracy, with its promise of international peace, has been no better guarantee against war than the old dynastic rule of kings.” —Jan C. Smuts (1870-1950)\nDemocrat Friendly Fire\n“We are already facing an unprecedented increase in migrants this year, and that will only get worse if the Administration ends the Title 42 policy.",
    "Until we have comprehensive, bipartisan immigration reform that commits to securing our borders and providing a pathway to citizenship for qualified immigrants, Title 42 must stay in place.” —Senator Joe Manchin\n“Ending Title 42 prematurely will likely lead to a migrant surge that the administration does not appear to be ready for.",
    "Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border.” —Senator Kyrsten Sinema\n“I would be very reluctant for the administration to end this Trump policy until we had a real plan in place.",
    "I’ll keep pushing the administration to strengthen border security & look forward to hearing directly from border agents during my upcoming trip to the border.” —Senator Maggie Hassan\n“This is the wrong decision.",
    "It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border.",
    "We are nowhere near prepared to deal with that influx."
  ]
}