{
  "id": 8690,
  "mediaId": 2724,
  "date": "2022-04-07",
  "headline": "Bipartisan Group Fighting Back Against Biden’s Effort to Lift Title 42, A Move Expected to Create Surge of Illegal Immigrants",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/04/2022.04.07-01.44-thepoliticalinsider-624eead16a4e4.jpg",
  "link": "https://thepoliticalinsider.com/bipartisan-group-fighting-back-against-bidens-effort-to-lift-title-42-a-move-expected-to-create-surge-of-illegal-immigrants/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rusty Weiss",
  "authorUrl": "https://thepoliticalinsider.com/author/rusty-weiss/",
  "termIds": [
    2459,
    2174,
    5879,
    4905,
    253
  ],
  "sentences": [
    "NEW: 5 Democratic & 6 GOP senators will introduce a new bill on Thursday that would prevent the Biden admin from lifting Title 42 without a detailed plan in place to stop an expected surge of migrants at the border\n— Alayna Treene (@alaynatreene) April 7, 2022\nRELATED: Border Agents Are Bracing For ‘Disaster,’ Expect 170,000 Illegal Immigrants In Just One Month\nBipartisan Pushback\nThe senators behind the new bill – five Democrat and six Republican – have indicated lifting the order would create a “mass migration event,” according to Axios.",
    "From my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and non-profits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities.”\nSinema and Kelly not happy w/ Biden on Title 42\nSinema: “Today’s decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border.”\nKelly: “This is the wrong decision.",
    "The New York Post reports that authorities “are bracing for an influx of up to 170,000 migrants and up to 13,000 unaccompanied children crossing the border in May alone.”\nBorder agents brace for surge, say Biden admin has ‘no plan’ with Title 42 set to be lifted https://t.co/nkTx6O3NwC pic.twitter.com/pGhro07l7d\n— New York Post (@nypost) March 31, 2022\nSeveral Democrats have expressed their own concerns about what could happen if Title 42 is eliminated.",
    "It’s unacceptable”\n— Burgess Everett (@burgessev) April 1, 2022\nRELATED: NY Rep. Calls For Biden To Be Impeached After Police Video Shows Feds Flying Illegal Immigrants Into NY\nLifting Title 42 Would Be a Disaster\nThe Political Insider reported late last week that federal officials have expressed concern that lifting Title 42 would create a “disaster” at the border.",
    "Senator Mark Warner (D-VA) said he thought it would be a “huge mistake” to do something that “might invite doubling, tripling, quadrupling of the numbers at the border.”\n“Just watch the news y’all put out every day, what’s coming across,” Senator Joe Manchin (D-WV) told reporters, adding that he opposed lifting Title 42.",
    "“Vulnerable Democrats,” they write, “worry it will create a political firestorm, and provide Republicans with fresh ammunition just months before the midterms.”\nThe bipartisan bill – known as the “Public Health and Border Security Act of 2022” – will be introduced by Sinema and Lankford on the Senate floor Thursday.",
    "Fox News reporter Hillary Vaughn recently relayed from a source at United States Customs and Border Protection (CBP) that the Department of Homeland Security (DHS) “is bracing for as many as 500,000 migrants in the six weeks following Title 42 being lifted.”\nHalf-a-million.",
    "A bipartisan group of senators is introducing legislation that would block the Biden administration’s efforts to lift Title 42, a move that is widely expected to create a massive surge of illegal immigrants at the border.",
    "“It seems highly unlikely it will be adequate by May 23, because of poor logistics.”\nSinema and fellow Arizona Democrat Mark Kelly issued statements about Biden’s move, with Kelly saying, “This is the wrong decision.",
    "“It is evident that the current preparations and plans for the end of Title 42 aren’t adequate,” said Senator Kyrsten Sinema who drafted the proposal along with Senator James Lankford (R-OK).",
    "(@TulsiGabbard) April 7, 2022\nStill, the Axios report indicates Democrat concerns about Title 42 may have more to do with the political landscape rather than the border security aspect.",
    "Multiple outlets have indicated the Biden administration is seeking to wind down the policy by May 23 following a Centers for Disease Control and Prevention (CDC) review.",
    "Title 42 is a pandemic-era order that allows border authorities to immediately expel illegal immigrants who attempt to cross the border on public health grounds.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly, and humane process at the border.",
    "Trump policy of having people wait on other side of the border worked & needs to be reinstated\n— Tulsi Gabbard ??",
    "Sign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "But they are doing so seemingly without a plan to combat the potential consequences.",
    "Rescinding Title 42 will make the massive flood of immigrants even worse.",
    "They are demanding a detailed plan to combat the expected surge.",
    "Main beneficiaries are gangs, cartels & human traffickers.",
    "Biden/Harris open-border policy has been a disaster."
  ]
}