{
  "id": 8780,
  "mediaId": 2605,
  "date": "2022-04-09",
  "headline": "Garcetti gave ‘unintentionally blended numbers’ on sex allegations involving advisor, rep says",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/7bdbfbb/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F20%2F57%2Ff75653d541e986150f99ee5df668%2Fla-photos-1staff-887418-na-pol-1214-capitol-hill-kkn-10145.JPG",
  "link": "https://www.latimes.com/california/story/2022-04-09/garcetti-unintentionally-blended-numbers-aide-harassment-investigation",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dakota Smith",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "While Democrats have raised questions about the allegations, leading to speculation that the mayor’s nomination could be withdrawn, Garcetti said in the interviews with Fox 11 and Spectrum that he expects to be confirmed by the Senate and that he hasn’t considered withdrawing.",
    "Garcetti made similar comments to Spectrum News 1 on Thursday, stating that “40 people under oath have been clear.”\n“This is a matter of unintentionally blended numbers,” said Dae Levine, Garcetti’s chief communications officer, when asked about Garcetti’s statement.",
    "As U.S. senators weigh the veracity of sexual harassment allegations lodged against Mayor Eric Garcetti’s former advisor and the mayor’s handling of the alleged claims, Garcetti twice made an inaccurate statement to reporters about witnesses in the case.",
    "When pressed by reporters about the Senate’s concerns, Garcetti told two television reporters on Thursday that 40 people “under oath” didn’t provide corroboration to bolster the sexual harassment allegations made against his former aide, Rick Jacobs.",
    "Overall, most of those questioned or deposed “including every member of the security detail besides Officer Garza, provided information supporting the truth — that Mayor Garcetti never saw or was informed about inappropriate behavior,” Levine said.",
    "Investigators from an outside law firm interviewed more than two dozen people, many of whom also gave deposition testimony in the lawsuit, for a report that concluded Garza was not sexually harassed and that Garcetti did nothing wrong.",
    "That speaks for itself.”\nThe mayor’s figure of 40 individuals “is inaccurate,” said Greg Smith, the attorney for Los Angeles Police Department Officer Matthew Garza, a former member of Garcetti’s security detail who is suing the city.",
    "Sen. Charles E. Grassley (R-Iowa), who has been conducting an investigation into Garcetti, reiterated Thursday that he doesn’t expect to come to a determination on the probe until after the Senate returns from recess on April 25.",
    "“I have nothing against him being ambassador to India, but I do have a responsibility when you get these sexual abuse things and sexual harassment things — they’re pretty serious charges,” Grassley said.",
    "“Several of [those senators] have subsequently read through a fairly thorough review of the allegations [and] the issues and have withdrawn their holds or concerns,” Coons said.",
    "At least seven of those witnesses, not including Garza and Jacobs, gave testimony that could bolster Garza’s claims, according to a Times review of the deposition statements.",
    "A Garcetti appointee and friend of Seligman’s testified that Seligman had called her after the alleged incident to say she had complained to Guerrero about Jacobs’ behavior.",
    "Becca MacLaren, Garcetti’s speechwriter, has disputed the account of another former Garcetti aide, Naomi Seligman, who alleges that Jacobs kissed her without her consent.",
    "), who is close to the White House, suggested that some of the senators who expressed reservations about Garcetti’s nomination have recently backed off that claim.",
    "“India is making major strategic choices with real consequences and we do not have an ambassador.”\nHaberkorn reported from Washington and Smith from Los Angeles.",
    "In all, 32 people have given deposition testimony under oath in the lawsuit brought by Garza, according Rob Wilcox, a spokesman for the city attorney’s office.",
    "“I wouldn’t be responsible if I didn’t look into it.”\nA Grassley aide said there has been some staff-level outreach between Garcetti’s and Grassley’s teams.",
    "Coons expressed worry that India still does not have an ambassador more than a year into Biden’s term and said he wants Garcetti confirmed soon.",
    "The Senate is scrutinizing the varying accounts of claims made by Jacobs, Garcetti and former staffers who accuse the former aide of misconduct.",
    "“Appropriate, due, thorough attention has been paid to allegations of misconduct in his office by people other than the nominee,” Coons said.",
    "However, several senators who previously publicly expressed concern about Garcetti’s nomination indicated Thursday that nothing has changed.",
    "The accusations have roiled Garcetti’s bid to become U.S. ambassador to India and have sparked an investigation by a Republican senator.",
    "“I think it’s crystal clear,” Garcetti told Fox 11 News at a ribbon-cutting event for a senior community development in Pico-Robertson.",
    "In his own deposition, Jacobs said that he might have hugged Garza and made sexual jokes in front of the mayor’s security detail.",
    "She cited a report done for the city attorney’s office for the city’s defense in the Garza lawsuit that also interviewed people.",
    "Garza’s attorney, Smith, said the report lacks credibility, in part because key individuals didn’t take part in the interviews.",
    "In this pivotal election year, we'll break down the ballot and tell you why it matters in our L.A. on the Record newsletter.",
    "The Garza case has spurred other accusations and counterclaims about Jacobs among current and former Garcetti staffers.",
    "And Seligman has said in her deposition that she complained about the kiss to Ana Guerrero, the mayor’s advisor.",
    "Garza sued the city in 2020, accusing Jacobs of subjecting him to crude comments and unwanted touches.",
    "Sen. Mazie Hirono (D-Hawaii) is “still contemplating it” and hasn’t yet reviewed the material on it.",
    "Garza has said some of the misconduct happened in front of Garcetti but the mayor didn’t intervene.",
    "Sen. Mark Kelly (D-Ariz.) has not heard from Garcetti or his team and said he still has concerns.",
    "Garcetti has denied witnessing anything improper and Jacobs has denied harassing Garza.",
    "You may occasionally receive promotional content from the Los Angeles Times.",
    "“Forty people interviewed under oath, who said there’s zero corroboration.",
    "None of those people were interviewed under oath, however.",
    "Guerrero has denied that Seligman complained to her.",
    "That figure includes Garza and Jacobs.",
    "Sen. Chris Coons (D-Del."
  ]
}