{
  "id": 8824,
  "mediaId": 2735,
  "date": "2022-04-06",
  "headline": "GOP Threatens to Hold COVID Funding Hostage to Preserve Trump Immigration Policy",
  "image": "https://truthout.org/wp-content/uploads/2022/04/2022_0406-Mcconnell-1200x675.jpg",
  "link": "https://truthout.org/articles/gop-threatens-to-hold-covid-funding-hostage-to-preserve-trump-immigration-policy/",
  "mediaOutlet": "Truthout",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Johnson",
  "authorUrl": "",
  "termIds": [
    2765,
    5732,
    4905,
    4267,
    2976,
    392,
    1126,
    1120,
    6678
  ],
  "sentences": [
    "Late Tuesday, the Congressional Hispanic Caucus (CHC) — which has dozens of members in the lower chamber — said it “opposes any amendment to the Covid relief package that would attempt to reinstate the Trump-initiated Title 42.”\n“The pandemic was used as an excuse to implement Title 42 and deny asylum-seekers their legal right to due process,” the CHC added.",
    "Politico reported Tuesday that Republican obstruction over Title 42 “could stall for weeks what Biden called much-needed coronavirus aid, unless senators can reach a deal before they plan to leave on Thursday or Friday.”\n“Without a breakthrough, the aid won’t be approved until late April or perhaps May,” the outlet noted.",
    "Senate Republicans on Tuesday threatened to tank a new $10 billion coronavirus relief package unless Democrats allow a vote on an amendment to preserve Title 42, a Trump-era border expulsion policy that the Biden administration is moving to end after months of sustained pressure from immigrant rights groups.",
    "“There’s several other amendments that we’re going to want to offer, and so we’ll need to enter into some kind of agreement to process these amendments in order to go forward with the bill.”\nUncompromised, uncompromising news\nGet reliable, independent news and commentary delivered to your inbox every day.",
    "First issued by the Centers for Disease Control and Prevention (CDC) in March 2020 despite internal objections from experts, the Title 42 order allows immigration authorities to quickly expel migrants and asylum seekers at the border, using the coronavirus pandemic as a justification.",
    "Senate Majority Leader Chuck Schumer (D-N.Y.) accused Republicans of holding coronavirus relief “hostage for an extraneous issue.”\nThe GOP’s stonewalling comes as the Biden White House is urgently requesting Covid-19 funding to keep critical pandemic response programs alive.",
    "For months, the Biden administration rebuffed calls from rights groups and legal experts to end Title 42, under which more than a million migrants have been turned away at the southern U.S. border and often sent back into dangerous conditions in their home countries.",
    "Instead, we must work to address the root causes of migration, border efficiency, legal pathways to citizenship, and update our outdated immigration laws through immigration reform to address cyclical migration patterns.”\nTime is running out.",
    "Late Tuesday, Republicans in the upper chamber blocked a procedural effort to begin consideration of the bipartisan Covid-19 aid measure, which includes money to help the U.S. purchase coronavirus test kits, therapeutics, and vaccines.",
    "One private testing company, Quest Diagnostics, quickly seized the opportunity to announce that patients without Medicare, Medicaid, or private insurance coverage will be charged $125 for one of its PCR kits.",
    "Last week, the CDC announced that Title 42 would no longer be in effect as of May 23, outraging anti-immigrant Republicans and drawing objections from some Democratic lawmakers, including Sens.",
    "“I think there’ll have to be an amendment on Title 42 in order to move the bill,” Senate Minority Leader Mitch McConnell (R-Ky.) told reporters ahead of Tuesday’s procedural vote.",
    "It’s not clear whether those Democrats would be willing to vote with Republicans to push a Title 42 amendment into the Covid-19 funding bill.",
    "The administration has already been forced to wind down a program that covered coronavirus testing and treatment for the uninsured.",
    "Such a policy was long advocated by Stephen Miller, former President Donald Trump’s xenophobic immigration adviser.",
    "Public health advocates have criticized the bill’s exclusion of funds to combat the pandemic globally.",
    "The inclusion of such an amendment would likely endanger the legislation’s prospects in the House.",
    "Joe Manchin (D-W.Va.), Mark Kelly (D-Ariz.), and Catherine Cortez Masto (D-Nev.).",
    "We only have 2 days left to raise $22,000 for Truthout.",
    "Every penny goes directly toward our publishing costs.",
    "“Title 42 should not be used as border policy.",
    "Will you take a few seconds to help?",
    "Donate Now"
  ]
}