{
  "id": 8835,
  "mediaId": 8251,
  "date": "2022-04-07",
  "headline": "Mark Kelly keeps up torrid Senate fundraising pace with $11.3 million haul in 1st quarter",
  "image": "https://media.12news.com/assets/KPNX/images/b0a5bf74-b363-4418-b2c5-7eb380cf5ff3/b0a5bf74-b363-4418-b2c5-7eb380cf5ff3_1140x641.jpg",
  "link": "https://www.12news.com/article/news/politics/az-senator-mark-kelly-keeps-up-torrid-senate-fund-raising-pace-with-11-million-haul-in-1st-quarter/75-5decee59-8a19-46e5-b203-9a35949213a0",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "According to Federal Election Commission reports, Masters has also benefited from more than $3.6 million in spending by the Saving America PAC, funded by a $10 million infusion from Masters' patron and former boss, tech billionaire Peter Thiel.",
    "Despite a fund-raising haul that dwarfs the cash raised by the Republican primary field, Kelly has to overcome voters' anxieties about the economy, fears of a new crisis at the Southwest border and low approval ratings for President Joe Biden.",
    "Some Republican candidates have also provided glimpses of their fund-raising:\n- Businessman Jim Lamon pledged to spend a million dollars a month of his own money on the campaign, and he appears to be stepping up that pace.",
    "According to the Washington Examiner, the first-time candidate has poured $13 million of his own money into his Senate campaign - $5 million during the first quarter of this year, on top of $8 million in 2021.",
    "U.S. Sen. Mark Kelly kept up his torrid fund-raising pace in the first three months of the year, bringing in $11.3 million and expanding his cash on hand to $23.2 million, the Kelly campaign reported Thursday.",
    "A poll released Thursday shows Kelly, who is unopposed in the Democratic primary, holding a four-point lead over a generic Republican nominee in the November general election, 45.3 percent to 41 percent.",
    "This week, Kelly is co-sponsoring a bill that would block the Biden Administration's decision to lift Title 42, a 2-year-old health care order at the border that's been used as a blunt deportation tool.",
    "According to pollster Paul Bentz at Phoenix-based HighGround Consulting, 58 percent of respondents to a Republican Senate primary survey hadn't made up their minds about which candidate they preferred.",
    "The three other candidates in the Republican Senate primary are Attorney General Mark Brnovich, former Arizona National Guard Commander Mick McGuire and Arizona Corporation Commissioner Justin Olson.",
    "Both Kelly and Democratic Sen. Kyrsten Sinema have warned that law enforcement and border communities aren't prepared to handle an anticipated surge of migrants when the order is lifted on May 23.",
    "\"Sen. Kelly has launched into 2022 delivering real results for hardworking families in Arizona, not big corporations or DC special interests,\" said Kelly campaign manager Emma Brown.",
    "- Investor and political newcomer Blake Masters reported raising $1.13 million from individual donors in the first quarter, according to a campaign news release.",
    "To date, the Kelly campaign has raised nearly $39 million, on its way to an anticipated $100 million in fund-raising for the senator's re-election bid.",
    "Arizona's emergence in 2018 as a swing state that could decide control of the U.S. Senate has fueled an exponential increase in campaign spending.",
    "Keeping Kelly's seat is vital to what are viewed as Democrats' slim chances of retaining control of the Senate in November's midterm elections.",
    "An independent poll released Wednesday showed that the five Republican candidates were all losing by a wide margin to \"Undecided.\"",
    "Outside groups, both Democratic and Republican, are expected to spend tens of millions of dollars more during the fall campaign.",
    "In recent months, the former space shuttle astronaut has worked to put some distance between himself and the Biden White House.",
    "Campaign finance reports for the first quarter of this year aren't due at the Federal Election Commission until April 15.",
    "In 2018, Kelly ousted Republican Sen. Martha McSally to fill the remaining two years of the late Sen. John McCain's term.",
    "Brnovich, who's won two statewide races, polled at 10.6 percent and Lamon won support from 10.2 percent of respondents.",
    "Early ballots for the primary will be mailed to Arizona voters by the first week of July, just three months away.",
    "Masters, however, has made more visits - a least two, one of them this week - than the other candidates.",
    "Kelly's first TV campaign ad, \"Paycheck to Paycheck,\" directly addressed Arizonans' economic concerns.",
    "The survey, by Phoenix-based HighGround Consulting, has a margin of error of 4.9 percentage points.",
    "The campaign reported receiving 1.1 million contributions during the current election cycle.",
    "He's toured the state promoting the popular bipartisan infrastructure law and its impact.",
    "\"Our grassroots donors are responding, fueling this campaign at an unprecedented rate.\"",
    "Track all of our current updates with Arizona politics on our 12 News YouTube channel.",
    "But he has to overcome voter anxieties, low approval for Biden to win re-election.",
    "Masters has raised more than $3.5 million since entering the race last summer.",
    "PHOENIX — Editor's note: The above video aired during a previous broadcast.",
    "During the first quarter, 97 percent of them were for $100 or less.",
    "They haven't provided previews of their first-quarter fundraising.",
    "This year Kelly is running for a full six-year term in the Senate.",
    "Former President Donald Trump hasn't endorsed a candidate yet.",
    "Arizona senator's fundraising dwarfs Republican primary field.",
    "None of the GOP candidates has won the \"Mar a Lago primary.\"",
    "Lamon has raised $1 million from donors, the Examiner said.",
    "The trio raised a combined $3 million last year.",
    "Subscribe for updates on all of our new uploads.",
    "The poll has a margin of error of 6 percent.",
    "Thiel has been a major supporter of Trump.",
    "He didn't disclose his cash on hand.",
    "Masters was third, at 6.4 percent.",
    "The primary election is Aug. 2."
  ]
}