{
  "id": 8842,
  "mediaId": 2532,
  "date": "2022-04-06",
  "headline": "GOP Senate campaign push focuses on Latinos with \"Vamos\" initiative as Title 42 impacts midterms",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/04/06/1c0ee450-0ff2-404b-a0e8-f6e2b5777d4e/thumbnail/1200x630/6aaee2dda9cbbc8b40ef2eadcd8d6d97/gettyimages-1229173934-1.jpg",
  "link": "https://www.cbsnews.com/news/republican-senate-latinos-title-42-midterm-elections-2022/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron Navarro, Camilo Montoya-Galvez",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n Anita Dunn returning to White House\n Warren urges Biden to cancel student loan debt ahead of midterms\n A test for Trump as Michigan GOP gathers\n McCarthy considered telling Trump to resign after Jan. 6, recording shows\n Bernie Sanders hasn't ruled out third run for presidency\n More\nIn:\nUnited States Senate\nRepublican Party\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "The NRSC will be working in tandem with the Republican National Committee, which is also heavily courting Latino voters, and has invested millions into targeting Republican-leaning Latino voters and organizing eight community centers in predominantly Latino areas, with four in Texas and others in Milwaukee, Las Vegas, Allentown, Pennsylvania; and Doral, Florida, which is located in the predominantly Latino Miami-Dade County.",
    "Several factors mentioned by Republicans and Democrats show a range of factors in the GOP making recent inroads with Latino voters, including a portrayal of Democrats as \"socialists\" that resonates with Cuban and Venezuelan communities, as well as a focused effort by the Trump campaign to highlight the economy as a top issue.",
    "Republican criticism of the Biden administration's policies at the U.S.-Mexico border intensified last week, when the Centers for Disease Control and Prevention (CDC) announced it would wind down a pandemic-era rule known as Title 42 that has allowed authorities to quickly expel migrants since March 2020.",
    "While top lawmakers like Senate Majority Leader Chuck Schumer have been advocating for Title 42's end, some centrist Democrats, many from border states and districts, have denounced its termination, set to take effect in late May, saying officials aren't prepared for a spike in migrant arrivals.",
    "She added that immigration hasn't been as much of a hot-button partisan issue among voters since 2010, when Arizona had a controversial law that made being an undocumented immigrant a state crime and required immigration papers to be shown when asked by law enforcement.",
    "Republicans are betting Latino voters will play a key role in their efforts to retake the Senate in November, and to that end, their Senate campaign arm announced a new multi-million-dollar outreach plan encompassing border policy, the economy and education.",
    "The National Republican Senatorial Committee's (NRSC) new \"Vamos\" initiative, first shared with CBS News, will target 2022 races in the battlegrounds of Arizona, Colorado, Georgia, Florida, Nevada, North Carolina, Pennsylvania, Washington and Wisconsin.",
    "The record number of migrant arrests along the U.S.-Mexico border during the Biden administration also opened up an opportunity for Republicans to contrast themselves with Democrats, whom they claim are \"soft\" on immigration and support open borders.",
    "In 2020, Donald Trump won 38% of the Hispanic vote, a 10-point uptick from 2016; the impact of his appeal was felt especially in South Texas and South Florida, where Republicans flipped or held predominantly Latino Congressional districts.",
    "Democratic Senate candidates in competitive races have also voiced concerns about lifting Title 42, including Raphael Warnock of Georgia, Maggie Hassan of New Hampshire, Catherine Cortez-Masto of Nevada and Mark Kelly of Arizona.",
    "In Arizona, Republican officials say their messaging will focus on the southern border, where an unprecedented number of migrants have arrived in the past year, posing major humanitarian, logistical and political challenges.",
    "Moran thinks migrant arrivals at the U.S. border will remain high because poverty, violence, natural disasters and COVID-19 are prompting record numbers of people in the Western Hemisphere to migrate.",
    "\"Donald Trump and the Republicans, for the last six years in particular, have used the fear of immigrants and immigrant bashing as their number one go-to political club against Democrats,\" he said.",
    "Tyler Moran, a former senior Biden adviser on migration, said Title 42 became more difficult to justify as a public health measure because of the relaxation of other pandemic-related restrictions.",
    "Lisa Magana, a political science professor at Arizona State University, said while Republicans have seen gains among Latino voters in other states, that hasn't been the case in Arizona.",
    "Moran says Democrats, including moderates skeptical of winding down Title 42, should be clear that they support a well-managed border, which includes allowing people to seek protection.",
    "He thinks rescinding the measure may hurt vulnerable House Democrats and says colleagues at a recent House leadership meeting told him they had hoped the rule would not be lifted.",
    "In a February CBS News poll, 60% of Latino respondents said they didn't believe Democrats and the Biden administration were focused enough on either immigration or inflation.",
    "Kyrsten Sinema of Arizona, Joe Manchin of West Virginia and Jon Tester of Montana are not up for re-election this November, but they, too, oppose lifting Title 42.",
    "\"I think most Republicans and I think most Hispanics would agree that we have to have a secure border, and we have to enforce our immigration laws,\" Scott said.",
    "Florida Senator Rick Scott and NRSC chairman, told CBS News he anticipates Republicans will see better Latino turnout this year than in past midterm elections.",
    "He argues that the current political environment favors Republicans and that the economy and immigration are issues that have moved voters away from Democrats.",
    "\"His problem is he's done nothing, and Biden's done nothing that's good for most people, not just Hispanics, but most people in Arizona,\" he told CBS News.",
    "He relayed his predictions of smugglers seizing on the policy change to bring more migrants to the border, and a border patrol that will be overwhelmed.",
    "He added, \"Latinos care about immigration, but they also want secure borders, and they want to make sure that we don't just have an open border policy.\"",
    "Texas Congressman Henry Cuellar, a centrist Democrat, said the White House reached out to him before lifting Title 42 in order to get his feedback.",
    "Scott's sense is that the same issues that resonate with any group will be winning issues for Latino voters — like inflation, energy and education.",
    "\"The most important thing to me that Republicans need to do is get out and talk to Hispanics across the country and listen to them,\" Scott said.",
    "A March CBS News poll found inflation and the economy are issues that rank high for Latino voters, a view shared by the general public.",
    "\"The border communities, the mayors, the county judges, the other folks on the ground, why are we not paying attention to them?",
    "Scott, the former governor of Florida, won 45% of the Latino vote in 2018, unseating the Democratic incumbent, Bill Nelson.",
    "Cuellar is locked in a runoff election with progressive immigration lawyer Jessica Cisneros, who supports lifting Title 42.",
    "Biden was favored by 61% of Latino voters in Arizona in 2020, compared to 37% for Trump according to a CBS News exit poll.",
    "Democratic Congressman Joaquin Castro of Texas views Title 42 as a \"Trump-era policy that had overstayed its usefulness.\"",
    "And then it ties into all of the images — you show people coming in, crossing the river in large numbers day after day.",
    "Castro added that Title 42 became \"more of a political tool\" for Republicans than \"an actual tool for public health.\"",
    "Consultant Jesus Marquez, who's advising GOP candidate Adam Laxalt in his Nevada race against Cortez-Masto, agrees.",
    "Ending the policy, she noted, will mean the government will be required to interview migrants asking for asylum.",
    "Why are we only paying attention to immigration activists that live thousands of miles away from the border?\"",
    "\"Most Latinos here are worrying about putting food on the table, about the education of their kids,\" he said.",
    "\"Vamos\" will focus on field operations such as door knocking, canvassing and other targeted programming.",
    "Scott claimed Kelly has \"put no effort in securing the border\" and thinks it may hurt him in November.",
    "Democrats also pointed to the spread of what they say is disinformation online and on Spanish radio.",
    "Everybody in our community knows somebody or maybe has a family member that is in that situation.",
    "\"Having said that, the immigration issue is a very emotional, sentimental part of our community.",
    "In March, U.S. border officials were directed to consider exempting Ukrainians from Title 42.",
    "\"The messaging can be terrible for Democrats if they don't play this or message this right.",
    "They'll fit into the narrative that Republicans say — that Democrats are for open borders.",
    "\"I told the White House, listen, I hope you have a plan in place,\" Cuellar told CBS News.",
    "Latino voters make up at least 20% of the electorate in Arizona, Nevada and Florida.",
    "And about 20 NRSC staffers will be deployed to these nine battleground states.",
    "\"And don't do it in the last four weeks of a race, but do it your entire race.",
    "\"They might be nuanced by state, but I think those issues are pretty similar.\"",
    "\"Everybody should get a fair shot for making their case for asylum,\" he said.",
    "The gap was similar in 2016 when Hillary Clinton was the Democratic nominee.",
    "I can tell you in my area — 80% Hispanic — [that image] resonates,\" he said.",
    "Still, illegal immigration is not at the top of concerns for Latino voters.",
    "\"Every candidate has to decide what's important to them,\" he told CBS News.",
    "So, we do care for immigration, but it's not at the top of the list.\"",
    "The issue is he ran as a moderate and he votes with Bernie Sanders.\"",
    "Now, he worries about unequal treatment of those who seek asylum.",
    "She argues the American public doesn't want a \"closed border.\"",
    "\"Numbers can't be a measure of success,\" Moran told CBS News.",
    "\"A measure of success is how orderly the process can be.\"",
    "\"Inflation, not being energy-independent, all this stuff.",
    "The Title 42 decision has also divided Democrats.",
    "And you'll hear what they care about.\"",
    "Illegal immigration ranked fourth.",
    "Twitter"
  ]
}