{
  "id": 8860,
  "mediaId": 8347,
  "date": "2022-04-06",
  "headline": "President Biden signs Shadow Wolves Enhancement Act into law",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/ecf9a40/2147483647/strip/true/crop/3520x1848+0+132/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F09%2F1c%2F4312f85d49e99461b302dd926963%2Fcopy-of-monument-hill-photo.JPG",
  "link": "https://www.kgun9.com/news/local-news/shadow-wolves-expansion-bill-signed-into-law",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bivian Contreras",
  "authorUrl": "https://www.kgun9.com/bivian-contreras",
  "termIds": [
    4905,
    5708,
    3570,
    814,
    695,
    1398,
    1374,
    5949,
    6453
  ],
  "sentences": [
    "This was the result of years of effort and the Nation is grateful to the many members of Congress who fought hard to get this legislation to President Biden’s desk.”\nTraditional tracking methods are used by these officers to help in disrupting and destroying drug trafficking groups.",
    "Bivian graduated from the University of Arizona School of Journalism with a Bachelor's degree in Journalism with an emphasis in Broadcast and is currently pursuing a degree in Broadcast Operational Meteorology at Mississippi State University.",
    "The Shadow Wolves are a U.S. Immigration and Customs Enforcement (ICE) all-Native American tactical patrol unit located on the Tohono O'odham Nation's reservation, which shares a 62-mile international border with Mexico.",
    "The Shadow Wolves have increasingly taken on investigation responsibilities, but they were still classified as tactical officers rather than special agents under the previous law.",
    "Tohono O’odham Nation Chairman Ned Norris, Jr. said “The signing of the Shadow Wolves Enhancement Act into law is a great step forward in protecting the Nation and the U.S.",
    "Fixing the disparity in classification will ensure the future of this unique unit and its role in protecting our people from cartels and other criminal activity.",
    "Share your story ideas and important issues with Bivian by emailing bivian.contreras@kgun9.com or by connecting on Instagram, and Twitter.",
    "The measure will improve recruitment and expand operations for the Shadow Wolves, the country’s only Native American tracking unit.",
    "5681 will reclassify the Shadow Wolves as ICE special agents, as well as encourage recruitment and program growth.",
    "She is an Arizona native from Nogales and looks forward to becoming a meteorologist one day or a news anchor.",
    "This will ensure that this one-of-a-kind unit can continue to protect the border for decades to come.",
    "For over 50 years, the Shadow Wolves have helped protect the United States homeland and nation.",
    "This classification has affected the Shadow Wolves program's efficiency and sustainability.",
    "——-\nBivian Contreras is a real-time editor for KGUN 9.",
    "TUCSON, Ariz. (KGUN — President Joe Biden signed H.R.",
    "5681, the Shadow Wolves Enhancement Act, into law.",
    "Homeland.",
    "H.R."
  ]
}