{
  "id": 901,
  "mediaId": 2641,
  "date": "2022-02-17",
  "headline": "Gas Could Hit $7 per Gallon",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=bda8379f-f935-4366-be0a-158c0e1c8e41&SiteName=Newsmax",
  "link": "https://www.newsmax.com/finance/streettalk/oil-and-gas-energy-prices-inflation-president-bide/2022/02/17/id/1057301/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maxwell Newman",
  "authorUrl": "",
  "termIds": [
    2232,
    1973,
    2976,
    4905,
    6159,
    6672,
    6569
  ],
  "sentences": [
    "One Pennsylvanian man says he sees no signs of declining gas prices in the future, telling the York Daily Record, “I think it’s going to become more of a problem for people as they’re traveling, and by the time summer comes, is it going to be even more?”\nGas prices are only slightly lower in nearby states of New York ($3.68 per gallon), and Connecticut ($3.62 per gallon), but Patrick De Haan, head of petroleum analysis at GasBuddy, expects prices to “increase dramatically” if Russia invades Ukraine, he tells ABC7 News.",
    "On February 10th, President Biden promised to “work like the devil” to lower gas prices, and Senate Majority Leader Chuck Schumer pledged on Wednesday, “You’re going to see a lot of activity from us on that issue [inflation].”\nDespite the Democrats’ repeated promises to act on rising prices, gas prices continue to hit record highs across the nation.",
    "When President Biden told Americans in November that “It will take time, but before long, you should see the price of gas drop where you fill up the tank,” few Americans imagined experts would not only predict an increase in gas prices, but the possibility of gas reaching $6 or $7 per gallon.",
    "Additionally, an analysis from the Committee for a Responsible Federal Budget (CRFB) showed suspending the gas tax in 2022 could worsen inflation in the future, and “would also reduce revenue by about $20 billion,” according to the CRFB.",
    "The gas prices have gotten so bad in Los Angeles County that they’ve hit record highs 11 times in the past 12 days, per ABC7 News, as new record highs being broken show gas prices continue to increase without relief in sight.",
    "Senators Mark Kelly, D- Ariz., and Maggie Hassan, D- NH, have proposed temporarily suspending the federal gas tax through the end of 2022 as a method to bring relief at the pump, but the plan has faced bipartisan pushback.",
    "Mark Jenkins, a spokesman for AAA’s Auto Club Group, notes, “The upward momentum in crude prices has been driven by geopolitical concerns related to Russia, cold weather, and underwhelming global crude output.",
    "The worst state of all is California, where gas prices have hit “a record high of $4.72 a gallon on average on Wednesday, and experts say five dollar a gallon will likely become the norm there,” per CNN.",
    "With oil prices steadily increasing, inflation hitting a 40-year high, and the possibility of war between Ukraine and oil rich Russia, $7 gas is not as far-fetched as it used to be, Dicker maintains.",
    "The latest gambit from Senators Kelly and Hassan comes after 11 Senate Democrats wrote a letter to President Biden in November, urging the Biden Administration to lower gas prices.",
    "After President Biden’s failed gamble to lower prices through the Strategic Petroleum Reserve, America’s emergency stockpile of petroleum, gas prices have continued to accelerate.",
    "The price of crude rose $6 last week, which if sustained, could trigger another 10-15 cent hike at the pump in the coming weeks.”\nFlorida is not the only state seeing new highs.",
    "Dicker’s warning is the latest evidence that despite President Biden’s attempts to lower gas prices, the latest being a gas tax holiday, the pain at the pump is set to continue.",
    "Dicker says it is inevitable that gas prices will rise to $5 a gallon—and possibly as high as $6.50 or $7—once crude brent oil reaches $100 a barrel.",
    "Gas prices in California are currently the highest in the nation, over a dollar per gallon higher than the national average if $3.51 a gallon.",
    "Energy markets expert and author Dan Dicker tells Yahoo Finance gas prices will continue to rise, even to as high as $7 per gallon.",
    "With war between Ukraine and one of the world’s most oil plentiful nations a possibility, little relief at the pump is in sight.",
    "In Florida, gas prices have hit their most expensive average price since July 2014, reaching an average of $3.47 per gallon.",
    "In Pennsylvania, gas prices hit an average of $3.70 per gallon as of Wednesday.",
    "If you think gas prices will fall anytime soon, think again.",
    "Brent crude is currently trading close to $96 a barrel.",
    "Special Links:",
    "U.S."
  ]
}