{
  "id": 923,
  "mediaId": 2641,
  "date": "2022-02-15",
  "headline": "Biden, Democrats Eye Suspension of 18-Cent Federal Gas Tax: Report",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=50445750-05d9-4b97-b572-284fcfe83460&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/federal-gasoline-tax-biden-suspend/2022/02/15/id/1056890/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    2459,
    1489,
    1477,
    388,
    392,
    6678
  ],
  "sentences": [
    "Rapidly escalating prices for oil and other commodities and consumer goods hang over economic concerns, including inflation, amid the ongoing COVID-19 pandemic, as U.S. lawmakers face prepare to face the electorate in November.",
    "Gasoline costs $3.49 per gallon on average in the United States, up from $2.50 on average a year ago, data from the automobile group AAA showed on Tuesday, with the West Coast and New England seeing the highest coasts.",
    "Citing unnamed sources, the Post said Senate Democrat leaders were privately exploring the idea and that their counterparts in the House had also expressed interest in a federal holiday to ease consumer gas prices.",
    "Crude oil prices hit a seven-year high in recent days, driven in part by the potential for conflict between Ukraine and Russia, one of the world' top oil producers, amid an ongoing tight supply and demand balance.",
    "Sen. Mark Kelly of Arizona and a group of five other Senate Democrats last week proposed temporarily suspending the federal 18.4 cent-a-gallon gas tax through the end of the year.",
    "The Biden White House and Democrat congressional leaders are weighing a pause on federal taxes on gasoline to help offset rising prices, The Washington Post reported Tuesday.",
    "While President Joe Biden has already released 50 million barrels from the nation's petroleum stockpile, \"all options are on the table looking ahead.\"",
    "The White House’s National Economic Council is reviewing the idea, a source confirmed to Reuters, adding that talks are continuing in Congress.",
    "Biden has also asked U.S. regulators to probe gasoline prices and last year met with U.S. oil and gas producers over the issue.",
    "\"Every tool is on the table to reduce prices,\" the White House said in a statement when asked about the report.",
    "Kelly plans to pitch the idea to fellow Senate Democrats at a meeting later on Tuesday, a source told Reuters.",
    "Representative for top Democrats in Congress could not be immediately reached for comment on the report.",
    "The debate mirrors some state efforts to also suspend state taxes at the gas pump this year, it added.",
    "Data last week showed U.S. consumer prices saw the biggest annual increase in inflation in 40 years.",
    "© 2022 Thomson/Reuters.",
    "All rights reserved."
  ]
}