{
  "id": 925,
  "mediaId": 2658,
  "date": "2022-02-11",
  "headline": "Dems' latest challenge: Draining the Hill's swamp (at least a little)",
  "image": "https://static.politico.com/33/a0/37856e774ab4a67fab8db8389fc2/biden-23294.jpg",
  "link": "https://www.politico.com/news/2022/02/11/democrats-clean-up-lawmaker-stock-trades-00007949",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2845,
    2765,
    2459,
    2346,
    4182,
    4456,
    4628,
    3883,
    3246,
    1126
  ],
  "sentences": [
    "Wisconsin Sen. Ron Johnson, the most vulnerable GOP senator, said he doesn’t trade stocks and wouldn’t stand in the way of changes but offered this warning: “I’m a little concerned about doing things that deter people from public service.”\n“It does get messy,” said Rep. Susan Wild (D-Pa.), who faces a competitive reelection campaign and has signed onto Spanberger’s bill, one of several percolating in Congress.",
    "are open to the idea but noncommittal, and Sen. John Cornyn (R-Texas) said he wanted to know why they couldn’t “provide the information and transparency people need” rather than a “blanket prohibition.”\nDemocrats will need at least 10 GOP votes to move anything through the Senate, although they are privately confident a trading ban would pass comfortably given the difficult optics of voting against it.",
    "“The more that we can restore trust and confidence with voters that we, here in Congress, are doing our jobs in the interest of what’s right, rather than what’s in our financial self interest, the better off we’ll all be,” said Rep. Mike Levin (D-Calif.), who said he and his wife divested their individual stocks when he first ran for office in 2017.",
    "“I have had people say, ‘Oh, well I didn’t vote for you, but — that stock bill!’”\nSpanberger is one of a growing number of Democrats seeking to capitalize on public fury over stock trades that have bedeviled members of both parties by appearing to give them a leg up based on privileged information.",
    "Still, he didn’t rule out “a measured approach that improves transparency.”\nAnd some are outright opposed: “For maybe a couple of people that do things the wrong way, they’re going to punish everybody else?” said Sen. Tommy Tuberville (R-Ala.), a former college football coach.",
    "Now some of their most politically vulnerable members are leading the charge to rein in lawmakers’ stock trades, arguing that voters will reward them for championing a different kind of accountability bill, even if it falls short this year in a narrowly divided Congress.",
    "I’m worried about people not being able to come up here and have a life and also have the opportunity to serve.”\nSen. Lindsey Graham (R-S.C.) endorsed a stock trade ban in an interview and said he’s been speaking to Sen. Elizabeth Warren (D-Mass.)",
    "And although vulnerable incumbent Senate Democrats such as Catherine Cortez Masto of Nevada and Mark Kelly of Arizona support banning lawmaker trades, they also say their constituents are far more concerned about the broader economy.",
    "“When I talked to my constituents about how we historically have had members of Congress that have traded on information and made money doing that, nobody’s happy with that,” said Kelly, adding he’s put his funds in a blind trust.",
    "| Alex Brandon/AP Photo\nBy Nicholas Wu, Burgess Everett and Sarah Ferris\n 02/11/2022 04:30 AM EST\nDemocrats are suddenly at a crossroads: Should they try to drain their own swamp — a little bit, at least — before the midterms?",
    "Several lawmakers behind the stock-trading ban said they were encouraged that Democratic leaders spotlighted the efforts this week, even if they fell far short of promising a floor vote or endorsing any specific bill.",
    "Still, she said Congress owes “transparency and accountability to the public and to the taxpayers who fund our salary every day.”\nCongress has dismal approval ratings and Democrats face huge headwinds in the midterms.",
    "While some depend on that salary alone while maintaining two homes in D.C. and back in their home states, and juggling student loans and other expenses, others’ net worth amounts to hundreds of millions of dollars.",
    "But I think we can handle those exceptions.”\nIn one sign of the potency of the issue, both Democratic leaders this week cracked open the door to passing a ban and have deferred to lawmakers to craft legislation.",
    "“I’ve been in rooms full of people who say, ‘Oh and I love that stock bill’ ... And everybody’s like, ‘yes!’” said Rep. Abigail Spanberger (D-Va.), a swing-district Democrat who has pushed the policy since 2020.",
    "Members of both parties — including in some of the most vulnerable seats — who are skeptical of the idea, and others who, like Johnson, are worried about alienating people from serving in Congress.",
    "That list includes two Georgia GOP senators whose losses in 2021 handed Democrats the Senate, as well as recent scrutiny of trades by Rep. Tom Malinowski (D-N.J.) and Sen. Richard Burr (R-N.C.).",
    "After all, a decade before Donald Trump won the White House vowing to “drain the swamp,” they swept back to power in Congress in part on a promise of ethics reform after GOP influence scandals.",
    "While roughly half of Americans hold stocks, according to a Gallup poll, many lawmakers are counting on something else to resonate with the American public: the lack of trust in government.",
    "Several of those bills have already attracted bipartisan support, since swing-district lawmakers from both sides have found limiting their own stock trades is a winning political message.",
    "), acknowledging the tricky details that any bill would need to address, such as how to handle stock trading by congressional spouses or how to approach lawmakers who own businesses.",
    "Rep. Abigail Spanberger arrives to speak on Thursday in Culpeper, Va. Spanberger is one of a growing number of Democrats seeking to capitalize on public fury over&nbsp;stock trades.",
    "But it could be difficult to resolve actual policy details of any trading restriction, especially amid the tangle of lawmakers’ holdings and vastly different financial backgrounds.",
    "Democrats themselves are split over how and whether to get something done, facing multiple different bills they have to reconcile and a potential Senate GOP filibuster.",
    "The party swept into full control of Washington, D.C., pledging to clean it up but have burned months on a failed bid for landmark ethics and voting legislation.",
    "Speaker Nancy Pelosi signaled she wants a bill passed by the end of the year, and Senate Majority Leader Chuck Schumer called it “an important issue” to address.",
    "Lawmakers are already banned from insider trading and are required to disclose securities transactions, though enforcement of that 2012 law is spotty.",
    "In interviews this week, a number of Republican senators professed interest in reform — suggesting there is a possible path to 60 votes in the Senate.",
    "Regardless of whether anything makes it into law, many vulnerable Democrats are already touting it as part of their reelection bids.",
    "While there’s increasing agreement that regulations could be stricter, members are offering a myriad of solutions for the next step.",
    "But Democratic and Republican leadership are likely to struggle to find a path forward, particularly in an election year.",
    "Nevadans ask about “kitchen table issues: Jobs, the economy, health care, prescription drug costs,” Cortez Masto said.",
    "The newest round of proposals would explicitly ban the ownership of individual stocks by lawmakers and their spouses.",
    "In interviews, several Democrats said they were unsure of the prospects for an actual vote in the coming months.",
    "“There would be a lot of other issues,” said House Ways and Means Committee Chair Richard Neal (D-Mass.",
    "All rank-and-file members are paid $174,000 per year, but their financial situations run the gamut.",
    "They’re hoping a bipartisan deal on banning stock trading, period, might give them a better shot.",
    "“In my opinion, it shouldn’t be an option.”\nAnthony Adragna contributed to this report.",
    "But if they get one, Democrats up for reelection know it can only help them back home.",
    "Spanberger and her fellow battleground-state reformers might be onto something.",
    "But the matter isn’t nearly as simple as writing and passing a ban.",
    "Plus, the idea isn’t universally embraced, even among Democrats.",
    "Other Senate Republicans like Sen. John Kennedy (R-La.)",
    "“There may have to be some exceptions carved out.",
    "“I’ve done well in my life.",
    "about reform."
  ]
}