{
  "id": 9303,
  "mediaId": 2660,
  "date": "2022-03-25",
  "headline": "Fact-checking false claim about Judge Ketanji Brown Jackson’s record on immigration",
  "image": "https://static.politifact.com/politifact/rulings/tom_ruling_pof.png",
  "link": "https://www.politifact.com/factchecks/2022/mar/25/mick-mcguire/claim-nominee-ketanji-brown-jackson-wants-defund-p/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    0
  ],
  "sentences": [
    "During the Senate Judiciary Committee hearings for U.S. Supreme Court nominee Ketanji Brown Jackson, Republican senators excoriated her as weak on law enforcement, sometimes by making misleading statements about her sentencing of child pornography offenders and the release of jail inmates.",
    "McGuire is running in the Aug. 2 primary against several other major Republican candidates: Arizona Attorney General Mark Brnovich, businessman Blake Masters, businessman Jim Lamon and Justin Olson, a member of the state utility commission.",
    "We found no evidence that Jackson has a record on defunding the police, abolishing ICE or supporting a completely open border — positions that undoubtedly would have drawn sharp criticism during the hearings.",
    "Jackson has been a judge on the U.S. Court of Appeals for the District of Columbia Circuit since 2021, having been nominated to that court by President Joe Biden, who also nominated her to the Supreme Court.",
    "Some activists called for eliminating police departments entirely, while others wanted to reexamine the functions of police departments and redirect some of their funding to other services.",
    "The Republican National Committee made no mention of police in its news release entitled, \"Biden’s Pick Is A Radical, Left-Wing Activist Who Will Rubberstamp His Failed Agenda.\"",
    "McGuire, the former head of the Arizona National Guard also called Jackson part of the \"radical left,\" a common theme in campaign ads on social media and among Republicans.",
    "Featured Fact-check\nBut that \"sample size is too small to support firm predictions about how she might approach immigration law matters more generally,\" the report said.",
    "Jackson has written three legal opinions considering challenges to the Department of Homeland Security’s expedited removal of immigrants illegally in the United States.",
    "In an ad posted on Facebook and Instagram on March 24, the final day of the hearings, McGuire shared excerpts of an interview he did two days earlier on Fox Business.",
    "After we published this fact-check, a campaign spokesperson said McGuire was \"referencing the movement of the Left, not a specific reference to Ms. Brown Jackson.\"",
    "That line of attack is one that we’ve fact-checked several times, usually deployed by Republican candidates for public office against their Democratic contenders.",
    "A final vote would then come from the full Senate, which is divided 50-50, but Vice President Kamala Harris, a Democrat, could break a tie vote.",
    "The Senate Judiciary Committee, divided 11-11 between Democrats and Republicans, is expected to vote on Jackson’s nomination on April 4.",
    "UPDATE, March 28, 2022: This fact-check has been updated to include a response we received from the McGuire campaign after publication.",
    "If Your Time is short\nWe found no evidence that Jackson has stated support for defunding the police, abolishing ICE, or open borders.",
    "After searching on Google and Nexis, a research database, we found no statements by Jackson showing support for defunding the police.",
    "There is no mention of defunding police in a 78-page review of Jackson’s record by the nonpartisan Congressional Research Service.",
    "Before that, she was a judge on the U.S. District Court for the District of Columbia, appointed by President Barack Obama in 2013.",
    "Calls to \"defund the police\" emerged following the 2020 murder by a white Minneapolis police officer of George Floyd, a Black man.",
    "Our ruling\nMcGuire said Jackson has \"a weak record — defund police, abolish ICE and now a completely open border policy.\"",
    "Some regard the term as no enforcement of immigration laws at U.S. borders, others apply it to lax immigration policies.",
    "None of the senators accused Jackson of wanting to defund the police or to abolish Immigration and Customs Enforcement.",
    "McGuire claimed that Jackson has \"a weak record — defund police, abolish ICE and now a completely open border policy.\"",
    "We’ve done several fact-checks debunking claims that Democrats want to abolish ICE or eliminate border enforcement.",
    "The International Association of Chiefs of Police and the Fraternal Order of Police have endorsed her nomination.",
    "In two of them, she ruled in favor of the challenges, according to the Congressional Research Service report.",
    "RELATED: GOP Ariz. Senate hopeful Lamon falsely claims that Biden wants to give ‘illegal immigrants’ $450,000",
    "He won the seat in a 2020 special election that was held to replace the late John McCain, a Republican.",
    "She also worked as a federal public defender, and would be the first Supreme Court justice to do so.",
    "But that was the attack made by Mick McGuire, a Republican candidate for U.S. Senate in Arizona.",
    "McGuire’s campaign did not respond by our deadline to our requests for evidence for the claim.",
    "Jackson has several family members, including a brother, who have served as police officers.",
    "The 2022 race is rated by campaign watchers as a toss-up and as \"battleground Democratic.\"",
    "We found no statements by Jackson indicating she wanted ICE abolished, or open borders.",
    "It’s one of the Nov. 8 contests that could determine which party controls the Senate.",
    "There is no evidence that Jackson has stated support for any of those measures.",
    "And we found no other statements by the committee related to McGuire’s claim.",
    "That contradicts McGuire’s own comments, which were directly about Jackson.",
    "PolitiFact staff researcher Caryn Baird contributed to this report.",
    "In any case, those rulings were on a specific immigration policy.",
    "It’s unclear what’s McGuire’s interpretation of \"open border.\"",
    "The winner will take on Democratic Sen. Mark Kelly.",
    "The baseless statement is false and ridiculous.",
    "ICE is part of the department.",
    "We rate it Pants on Fire!"
  ]
}