{
  "id": 955,
  "mediaId": 2578,
  "date": "2022-02-17",
  "headline": "COMEDY: Vulnerable Senate Democrats Are Trying To Run As Tax Cutters",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/Raphael-Warnock.jpg",
  "link": "https://www.thegatewaypundit.com/2022/02/comedy-vulnerable-senate-democrats-trying-run-tax-cutters/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike LaChance",
  "authorUrl": "https://www.thegatewaypundit.com/author/aleister/",
  "termIds": [
    4267,
    3026,
    2459,
    2346,
    1489,
    1477,
    388,
    392,
    5949
  ],
  "sentences": [
    "Politico reports:\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nVulnerable Senate Dems try to run as tax-cutters\nVulnerable Senate Democrats are attempting a bold strategy: Running for reelection as the real tax-cutters in Congress, even if it pits them against some of their caucus colleagues.",
    "A quartet of the chamber’s most endangered Democrats are backing a proposal to suspend the federal gas tax through the end of the year and urging their party to embrace it as a signature economic pitch ahead of the midterms.",
    "But Sen. Raphael Warnock (D-Ga.) is still pressing a proposal to suspend the state sales tax on essential goods, and other Democrats are mulling a new push to bring down drug prices, particularly insulin.",
    "The topic dominated Senate Democrats’ Tuesday lunch, suggesting a larger political move is underfoot as the caucus dodges harder GOP hits on rising inflation.",
    "After canceling pipelines, banning drilling on federal lands, and declaring war on energy companies, Democrats suddenly want to repeal the gas tax.",
    "But as inflation grips the economy and prices continue rising, those senators say they are merely responding to their constituents’ concerns.",
    "Yes, the party that never met a tax increase it didn’t like, now wants voters to believe they’re interested in cutting taxes.",
    "It’s no coincidence that the Democrats most involved in the new push hail from the toughest battlegrounds: Sens.",
    "— Tom Cotton (@TomCottonAR) February 15, 2022\nThis is simply a political play and it’s not going to work.",
    "This just goes to show how desperate they are and that they know how much trouble they are in this fall.",
    "Mark Kelly of Arizona, Maggie Hassan of New Hampshire, Catherine Cortez Masto of Nevada and Warnock.",
    "Tax holidays that slash government revenue aren’t universally popular in the party right now.",
    "So worried that some of them have decided to try to run on the idea of cutting taxes.",
    "How worried are Democrats about their prospects for the 2022 election?",
    "And more ideas are on the way to ease voters’ pocketbooks.",
    "Everyone knows exactly what’s going on here.",
    "Cross posted from American Lookout."
  ]
}