{
  "id": 9630,
  "mediaId": 2695,
  "date": "2022-03-22",
  "headline": "Arizona Republicans advance election bill to end mail-in voting — but it's likely dead on arrival",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTU3ODc0OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY5MzQ2NTc1Nn0.bjo5qyNt5txmUi0DlNllZQdy9D8uot6Gbwis9y1ebPA/img.jpg?width=1200&coordinates=0%2C85%2C0%2C86&height=600",
  "link": "https://www.theblaze.com/news/arizona-republicans-advance-election-bill-to-end-mail-voting-but-its-likely-dead-on-arrival",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Pandolfo",
  "authorUrl": "https://www.theblaze.com/u/christopherpandolfo",
  "termIds": [
    1690,
    2756,
    111,
    1126,
    1489,
    6360,
    5949
  ],
  "sentences": [
    "Mesnard (R), who supports returning to near-universal in-person voting, told the Associated Press that a bill passed by the Legislature can become a ballot referendum if supporters or critics collect enough signatures.",
    "The state Senate Government Committee advanced the bill in a party-line vote of 4-3 Monday, but according to the Associated Press, the bill is expected to fail if brought before the full Senate or in the state House.",
    "Those materials were cited in a \"forensic audit\" of the election conducted by supporters of former President Donald Trump on behalf of Senate GOP leaders that failed to show Trump's loss was illegitimate.",
    "Republican lawmakers in Arizona are attempting to resurrect a controversial election bill that would eliminate nearly all forms of early voting and require ballots to be counted by hand.",
    "An identical bill was defeated earlier this year when state House Speaker Rusty Bowers (R) assigned it to every House committee, ensuring that it would never reach the floor for a vote.",
    "Government Committee Republicans also voted to advance a bill that would require drop boxes to be monitored by an election worker or a security camera, the Associated Press reports.",
    "“If that were to happen here, it would go to the ballot and you have 85% of folks casting a mail in ballot on whether they get to continue casting mail-in ballot,” Mesnard said.",
    "Even supporters of the bill acknowledge there is an uphill battle to end mail-in voting in Arizona, a state where more than 80% of voters cast their ballots by mail.",
    "It would require voters to show up at a local precinct polling place to vote, and each location would be restricted to serve a maximum of 1,500 registered voters.",
    "State Sen. Kelly Townsend (R) said she intends to issue a new subpoena to Maricopa County for records related to the presidential election.",
    "This bill and others like it are supported by Republicans and activists who claim that 2020 presidential election was fraudulent.",
    "His bill would end early or absentee voting except for voters who have a disability or expect to be out of state on Election Day.",
    "In the immediate aftermath of the 2020 election, Republicans subpoenaed Maricopa County for ballots, voting machines, and data.",
    "“We have our work cut out for us.”\nStill, Arizona Republican efforts to revisit the results of the 2020 election continue.",
    "She asserts the county has not sufficiently cooperated with requests for records from Attorney General Mark Brnovich.",
    "Democrats say the measure would suppress the minority vote and are accusing Republicans carrying that intention.",
    "State Rep. John Fillmore, who sponsored the legislation, has said he wants to \"get back to 1958-style voting.\"",
    "Brnovich is a candidate for U.S. Senate running in the GOP primary to challenge Sen. Mark Kelly (D-Ariz.).",
    "The proposal requires votes to be counted by hand and the results reported within 24 hours.",
    "State Sen. J.D."
  ]
}