{
  "id": 978,
  "mediaId": 2641,
  "date": "2022-02-18",
  "headline": "This Will Be a Banner Year for Republicans",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=51ceb987-e4f7-4044-9c08-bf04784ac11b&SiteName=Newsmax",
  "link": "https://www.newsmax.com/michaeldorstewitz/republicans/2022/02/18/id/1057415/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Dorstewitz",
  "authorUrl": "https://www.newsmax.com/insiders/michaeldorstewitz/id-498",
  "termIds": [
    0
  ],
  "sentences": [
    "The visual may also prompt people to recall Biden’s oft-repeated phrase on the campaign trail: “I’m not gonna shut down the economy; I’m not gonna shut down the country; I’m gonna shut down the virus!”\nRep. Stephanie Murphy, a Florida Democrat and co-chair of the centrist Blue Dog Coalition, places the blame squarely on Biden’s shoulders.",
    "And God should be willing, after al it is written in Ecclesiastes 10:2 that “The heart of the wise inclines to the right, but the heart of the fool to the left.”\nIf nothing else, the 46th president is proof of the last half of that observation.",
    "“A sign of a good leader and a successful executive is to identify the policies or personnel choices that have not resulted in success and make necessary course corrections — because it’s too important not to,” she told NBC News.",
    "Chris Hartline, communications director for the National Republican Senatorial Committee, looked at the data for just the 12 key battleground states — those states where historically the election could go either way.",
    "These annual events are able to lift presidential ratings, but probably not this year\nThe Capitol physician announced that all members of Congress and the Supreme Court are invited to attend — but no guests.",
    "The look will be especially jarring coming right on the heels of Super Bowl Sunday, attended by more than 70,000 fans crammed into Los Angeles’ SoFi Stadium, and all but a handful were maskless.",
    "Barring something unexpected — like Biden discovering a cure for cancer or every member of the Republican Party dying of COVID — 2022 should go down as a very good year for the GOP.",
    "Requiring every attendee to be masked and socially distanced won’t be a good look on TV for the president, especially after everyone has already proved they’re COVID-free.",
    "And after each attendee has been vaccinated and proved that they’re disease-free, they’re still required to socially distance and wear a KN-95 mask throughout the event.",
    "November 8 Election Day is nearly nine months away, but the Biden administration is already bracing for a shellacking — worse than the one Barack Obama suffered in 2010.",
    "In addition, all attendees will need to present negative results on a PCR test \"within one day\" of event, and vaccine boosters are \"strongly\" recommended.",
    "“It feels like there is a wave coming and no one is doing anything to stop it,” the official said, and the color of that wave is Republican red.",
    "She will more-than-likely face Republican former Nevada Attorney General Adam Laxalt for the seat once held by his grandfather, Paul Laxalt.",
    "Biden is also below 50% approval in every single state, and is even underwater in California, with a 41%/49% approval/disapproval rating.",
    "This doesn’t bode well for Warnock’s survival, especially given that his rival may be former (and popular) NFL great Herschel Walker.",
    "And it’s quite possible that Biden’s ratings could slip even further after his State of the Union address scheduled for March 1.",
    "Of the states in play, Biden is underwater in all but three — Hawaii, Maryland and Vermont, according to a recent Civiqs poll.",
    "Merchant Marine officer and an enthusiastic Second Amendment supporter who can often be found honing his skills at the range.",
    "Michael Dorstewitz is a retired lawyer and has been a frequent contributor to BizPac Review and Liberty Unyielding.",
    "In Georgia, Democrat incumbent Sen. Raphael Warnock also won a special election in 2020, by taking 51% of the vote.",
    "A strong slate of Republicans announced their candidacy for the seat, including former North Carolina Gov.",
    "But now it’s looking more and more as though that chamber is also going to fall — and possibly fall hard.",
    "A White House official told NBC News that “everyone’s resigned” to Republicans dominating the midterms.",
    "North Carolina will be an open seat, as three-term GOP Sen. Richard Burr said he won’t seek reelection.",
    "In Nevada, one-term Democrat Catherine Cortez Masto was elected in 2016 with only 47.1% of the vote.",
    "He just ploughs on ahead until he invariably sails the ship of state smack dab into the doldrums.",
    "He’s only been in office two years, winning a special election in 2020 with 51.2% of the vote.",
    "Biden’s approval/disapproval in the Grand Canyon State is 32%/61%, a negative 29-point spread.",
    "Biden’s approval/disapproval un the Tar Heel State is 33%/58%, giving him a 25% disadvantage.",
    "Pat McCrory, and U.S. Rep. Ted Budd, who has the backing of former President Donald Trump.",
    "Biden’s approval/disapproval in the Silver State is 35%/57%, a negative 22% spread.",
    "Biden’s approval/disapproval in the Peach State is 31%/58%, a negative 27% spread.",
    "People may wonder if Biden is physically frail, or has an underlying health issue.",
    "But making “necessary course corrections” isn’t among Biden’s list of talents.",
    "For some time now the only question has been on the Senate side.",
    "In Arizona, Democratic Sen. Mark Kelly is seeking reelection.",
    "A total of 35 Senate seats are up for grabs in November.",
    "And God willing, 2024 will be even better.",
    "Read Dorstewitz's Reports — More Here.",
    "He’s only tied in Maryland, 44%/44%.",
    "Newsmax Blogs:\n© 2022 Newsmax.",
    "He is also a former U.S.",
    "All rights reserved.",
    "Special Links:"
  ]
}