{
  "id": 9797,
  "mediaId": 2572,
  "date": "2022-03-30",
  "headline": "House Freedom Caucus calls on House Dems to back vote on keeping Title 42 in place at border",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/AP21214605450831.jpg",
  "link": "https://www.foxnews.com/politics/house-freedom-caucus-house-dems-vote-keeping-title-42-border",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    1675,
    3516,
    520,
    392,
    387,
    1397,
    1126,
    6383
  ],
  "sentences": [
    "It has been used by both the Trump and Biden administrations to quickly expel more than half of all migrants coming to the border rather than allow them into the U.S.\n((AP Photo/Eugene Garcia, File))\nThe order is up for renewal in the coming days, and the Biden administration is believed to be considering revoking it -- despite fears that it will encourage even more migrants to attempt to cross the border, and quickly overwhelm authorities.",
    "HAGERTY INTRODUCES BILL TO ALLOW TITLE 42 TO BE USED TO PROTECT US FROM DRUG SMUGGLING\n\"Customs and Border Protection is already dangerously overwhelmed, halting the enforcement of Title 42 authority will prove disastrous for Americans and the migrants seeking to come here who will be preyed on by violent drug cartels and human smugglers,\" it says.",
    "FIRST ON FOX: The House Freedom Caucus is calling on House Democrats to back a discharge petition that would force a vote on Republican-penned legislation to keep Title 42 border protections in place for the near future -- just as the policy is up for renewal.",
    "That bill would keep Title 42 protections in place until all COVID-19 mandates and public health emergencies are ended and until the Centers for Disease Control (CDC) lowers the traveler health risk for Canada and Mexico to Level 1.",
    "The letter warns that ending Title 42, with migrant traffic still remaining over the 150,000 encounters-a-month mark, \"will devastate the southern border and cause irrevocable damage to the security of the United States.\"",
    "\"We, the House Freedom Caucus, are asking our Democrat colleagues to join us in signing the discharge petition to stand up and defend the health and the security of the United States,\" the letter says.",
    "The conservative group, in a letter to Democrats, is calling for them to sign Rep. Chip Roy’s, R-Texas, discharge petition that would force a vote on Rep. Yvette Herrell’s, R-N.M. \"PAUSE Act.\"",
    "\"We are on pace to encounter 200,000 people in March - which means DHS will release 100,000 people this month even with Title 42 being partially enforced,\" the letter says.",
    "There were 164,973 migrant encounters in February, up dramatically from 101,099 in Feb. 21 -- a month that preceded a massive surge in the spring and summer months.",
    "The Title 42 public health order was implemented by the Trump administration in March 2020 and allows for the rapid expulsion of migrants at the southern border.",
    "It cites early March data that in the first half of the month there were approximately 97,000 border crossers -- 51% of whom were expelled via Title 42.",
    "Roy had filed a discharge petition to force a vote on the bill, and the caucus letter says 203 current Republican members have signed onto it.",
    "Meanwhile, Border Patrol Chief Raul Ortiz said this week the U.S. is due to hit a million encounters at the southern border this fiscal year.",
    "Meanwhile, in the House, Rep. Henry Cuellar, D-Texas, this week signed on to a Republican letter calling for Title 42 to remain in place.",
    "A discharge petition requires 218 House members to sign, meaning it would need a number of Democrats to sign on to be successful.",
    "Mark Kelly, D-Ariz., and Kyrsten Sinema, D-Ariz., have recently expressed concern about such a move.",
    "A number of Democrats have warned the Biden administration against ending Title 42 immediately.",
    "Sen. Joe Manchin, D-W.Va., along with Sens."
  ]
}