{
  "id": 9799,
  "mediaId": 8322,
  "date": "2022-04-01",
  "headline": "Biden immigration decision could make midterm climate even tougher for Democrats",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/GettyImages-1358087851.jpg",
  "link": "https://www.foxnews.com/politics/biden-immigration-decision-could-make-midterm-climate-even-tougher-democrats",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    2459,
    2765,
    2976,
    3042,
    5810,
    4905,
    1489,
    1126,
    392
  ],
  "sentences": [
    "But the order from the Centers for Disease Control and Prevention (CDC) to lift on May 23 what’s known as Title 42 could become another liability for the president and congressional Democrats who already face historical headwinds and an unfavorable political climate partially fueled by soaring inflation and skyrocketing gas prices.",
    "The NRCC, the House GOP re-election arm, has long viewed border security as a winning issue not only in competitive House districts along the nation's southern border, but also across the country, not only with a GOP base that gets fired up over immigration and border security but among independent voters and even some Democrats.",
    "Minutes after President Biden’s administration rescinded Trump-era pandemic restrictions along the U.S.-Mexico border that effectively blocked migrants from entering the U.S. to seek asylum, Republicans warned it would worsen the border crisis and potentially help deliver a GOP victory in the midterms.",
    "\"Every Democrat will have to answer for the Biden administration’s decision to turn their border crisis into a border catastrophe,\" National Republican Congressional Committee (NRCC) spokeswoman Torunn Sinclair argued in a statement to Fox News minutes after the administration’s decision was reported.",
    "In February, approximately 55% of migrants were returned due to the order rather than being released into the U.S.\n\"Title 42 has been nothing short of disastrous for immigrant families seeking asylum from the horrors in their own countries,\" Senate Majority Leader Chuck Schumer said last month.",
    "DEM SENATORS SOUND ALARM OVER REPORTS BIDEN ADMINISTRATION WILL END TITLE 42 BORDER POLICY\nBut with border crossings over the past year at historical highs, the GOP sees Friday’s move by the Biden administration as fresh ammunition on the campaign trail.",
    "Republican Sen. Mitt Romney of Utah tweeted that Biden's move was the worst domestic news of the day and the best political news for the GOP, predicting that Democratic senators from border states Arizona and Nevada \"will lose their elections.\"",
    "\"Senate Democrats like Mark Kelly created this border crisis and have consistently voted against measures to secure the border,\" National Republican Senatorial Committee (NRSC) spokeswoman Katharine Cooksey claimed in a statement to Fox News.",
    "An average compiled by Real Clear Politics of all the most recent polls that asked about the president’s handling of border security and immigration put Biden’s approval at 34% and disapproval at 58%.",
    "The president’s move came after more than a year of pressure from fellow Democrats amid frustration with the inability to end a policy they view as illegal and cruel to those fleeing persecution.",
    "While it is a public health order, not an immigration policy, it has become one of the central border policies in place as the U.S. faces a continuing crisis of numbers at the border.",
    "REPUBLICANS SAY BORDER SECURITY ‘WILL PLAY EVERYWHERE IN MIDTERMS’\nSenate Republicans need a net gain of just one seat in the 100-member chamber to win back the majority.",
    "The president’s approval rating is a key barometer for his party in a midterm election cycle, and Biden’s standing with Americans has been well underwater for months.",
    "\"It is unacceptable that this policy continues to be used indiscriminately to remove migrants with valid refugee claims from our Southern border.\"",
    "Among the many targeted districts they’re hoping to flip are a handful of blue seats along the nation’s southern border in Texas and Arizona.",
    "The GOP needs a net gain of just five seats in the 435-member chamber in November to regain the House majority it lost in the 2018 midterms.",
    "The Democrats are trying to maintain their razor-thin majorities in the House of Representatives and Senate in November’s midterm elections.",
    "I think it’s going to play everywhere,\" NRCC chair Rep. Tom Emmer of Minnesota emphasized in an interview with Fox News in February.",
    "Biden stood at 37% approval and 58% disapproval on his handling of the issue in the most recent Fox News poll conducted March 18-21.",
    "The president’s approval on immigration has been at or below 40% for a year in Fox News' national polling.",
    "It was used by both the Trump and Biden administrations to expel a majority of migrants at the border.",
    "But his approval ratings on his handling of border security and immigration are even worse.",
    "And one of the Senate Democrats they view as vulnerable is freshman Mark Kelly of Arizona.",
    "American families are suffering because of Democrats’ reckless, open borders policies.\"",
    "Former President Trump's administration issued the order amid the coronavirus outbreak.",
    "\"Now they’re all powerless to stop Joe Biden from making the crisis even worse.",
    "\"This is an American issue."
  ]
}