{
  "id": 9818,
  "mediaId": 2572,
  "date": "2022-03-30",
  "headline": "Biden administration to end Title 42 border policy, despite fears of massive migrant surge: reports",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/04/GettyImages-1312682563.jpg",
  "link": "https://www.foxnews.com/politics/biden-administration-title-42-border-policy-migrant-surge",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    4905,
    5732,
    5510,
    2976,
    2765,
    2459,
    1356
  ],
  "sentences": [
    "The Wall Street Journal reports that the Centers for Disease Control plans to issue an order to end Title 42, which has been in place since March 2020, but its implementation will be delayed until May 23, in order to give the Department of Homeland Security time to prepare.",
    "The Biden administration is reportedly planning to end its use of the Title 42 public health order that allows for the rapid expulsion of migrants at the southern border, despite fears that it will spark another massive influx that will overwhelm officials.",
    "Biden administration officials have been reportedly planning for numbers of up to 18,000 migrants a day, while the White House on Wednesday said that \"there will be an influx of people to the border\" when the Centers for Disease Control lifts the order.",
    "DHS PUTS OUT CALL FOR EMPLOYEES TO VOLUNTEER AT SOUTHERN BORDER AMID ‘LARGE NUMBERS' OF MIGRANTS\nFormer Trump White House adviser Stephen Miller said that ending Title 42 would \"open the floodgates on a biblical scale.\"",
    "The order was implemented by the Trump administration due to the outbreak of COVID-19 and has since been used by both the Trump and Biden administrations to expel a majority of migrants at the border.",
    "\"Title 42 has been nothing short of disastrous for immigrant families seeking asylum from the horrors in their own countries,\" Senate Majority Leader Chuck Schumer said this month.",
    "But Republicans and border officials have warned that ending the policy will encourage more migrants to make the journey north -- and also result in more migrants being allowed in.",
    "The Department of Homeland Security, meanwhile, put out a fact sheet outlining what it intends to do to prepare for a \"potential increase in the number of border encounters.\"",
    "There were 164,973 migrant encounters in February, up dramatically from 101,099 in Feb. 21 -- a month that preceded a massive surge in the spring and summer months.",
    "Activists and top Democrats have been calling for the Biden administration to end the order for months, claiming it is cruel and denied migrants due process.",
    "So the decision on when to lift Title 42, we defer to the CDC,\" Communications Director Kate Bedingfield said about the potential lifting of the order.",
    "Manchin, in a letter CDC Director Rochelle Walensky, said that with the BA2 subvariant emerging \"now is not the time to throw caution to the wind.\"",
    "He also said that agents have encountered migrants from 157 different countries – an indication of the global character of the U.S. border crisis.",
    "\"It is unacceptable that this policy continues to be used indiscriminately to remove migrants with valid refugee claims from our Southern border.\"",
    "Meanwhile, Border Patrol Chief Raul Ortiz said this week the U.S. is due to hit a million encounters at the southern border this fiscal year.",
    "Mark Kelly and Kyrsten Sinema, as well as Sen. Joe Manchin, D-W.Va., had expressed concern about an imminent end to the policy.",
    "Border Patrol facilities in some parts of the border have already been releasing migrants due to being overcapacity.",
    "In February, approximately 55% of migrants were returned due to the order.",
    "He also said that \"every sector is busier than they were back in ‘21.\"",
    "That number is expected to rise dramatically in the coming months.",
    "It is not an immigration or migration enforcement measure.",
    "Fox News' Bill Melugin contributed to this report.",
    "\"Title 42 is a public health directive.",
    "Meanwhile, Arizona Democratic Sens."
  ]
}