{
  "id": 9841,
  "mediaId": 2625,
  "date": "2022-03-30",
  "headline": "Biden Expected to End Covid Border Policy Aimed at Keeping Out Refugees",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/03/2022-03-28-title42-prewrite.jpg?w=1200&h=630&crop=1",
  "link": "https://www.motherjones.com/politics/2022/03/biden-public-health-policy-asylum-covid-trump-migrants-border/",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fernanda Echavarri",
  "authorUrl": "https://www.motherjones.com/author/fernanda-echavarri/",
  "termIds": [
    0
  ],
  "sentences": [
    "I wrote about a court hearing in January that revealed the policy’s hypocrisy:\nACLU lead attorney Lee Gelernt, who represents the refuge-seeking migrant families suing the US government, argued that the people affected by Title 42 expulsions make up only 0.01 percent of the traffic coming in from Mexico—and that the other 99.9 percent is able to come and go between the two countries even as the pandemic continues.",
    "Former President Trump’s senior adviser on immigration, Stephen Miller, tweeted his reaction to the news Wednesday afternoon warning that the Biden administration is “on the precipice of unleashing one of history’s most spectacular travesties—the full-scale revocation of T42 would open the floodgates on a biblical scale.”\nTrump and Miller were always on the lookout for ways to close the border to migrants.",
    "“But some within DHS clearly prefer chaos.”\nOn one hand, the US is calling for the humane treatment of Ukrainian refugees, and at the same time it’s turning back mostly Black and Brown asylum seekers\nHours before the deadline to renew or rescind Title 42 Wednesday, a former Biden senior adviser on immigration provided much needed content in a tweet.",
    "Even some Democrats appear to think this way; three Democratic Senators, Mark Kelly and Kyrsten Sinema of Arizona, and Joe Manchin of West Virginia publicly urged Biden to extend the use of Title 42 to avoid an influx of migrants trying to enter the country and to wait until DHS is “completely ready” to process migrants in a humane and orderly way.",
    "On Wednesday, the Department of Homeland Security published a fact sheet and although there’s no mention of Title 42, it does detail its plans in “preparation for potential increase in migration.” DHS said it was expanding capacity at migrant processing facilities and with transportation companies to transfer migrants by bus and air.",
    "“And now more than a year since the Biden administration took office, it’s unacceptable that this policy continues to be used indiscriminately to remove migrants with valid refugee claims.”\nIt’s worth emphasizing that revoking Title 42 does not mean the border would now “open” to all migrants who want to enter the United States.",
    "Adding that the changes in demographics of who’s migrating and the factors that are causing forced displacement of millions of people is a bigger issue that the Biden administration and the United States “can’t solve alone.”\nSo yes, lifting Title 42 will put added strains on the US-Mexico border, as DHS officials have said.",
    "Immigration advocates and immigrant rights groups were quick to point out the double standards over the last month: On one hand, the US is calling for the humane treatment of Ukrainian refugees, and at the same time it’s turning back mostly Black and Brown asylum seekers at its own southern border.",
    "(Unaccompanied migrant children were at times not excluded from rapid expulsion under Trump, but a judge ruled Biden was right to have reversed that because of a decades-long settlement which says US officials must treat unaccompanied children and teens differently.)",
    "Shortly after the story came out, Erika Pinheiro co-director of Al Otro Lado tweeted that the administration had “failed to communicate with humanitarian groups on both sides of the border” to figure out the best and most humane way to transition out of Title 42.",
    "“We shouldn’t forget how this policy originated: It was a cynical effort by the Trump administration to use the pandemic as justification for expelling vulnerable migrants seeking refuge in this country,” he said in a call with reporters on March 10.",
    "He pointed out how many basketball arenas do not require proof of vaccination before allowing thousands to attend games; congregate settings that pose risks could include packed airports and flights, yet there are no restrictions on domestic travel.",
    "Top CDC officials first refused to comply with the Trump administration’s request, arguing there was no valid public health reason to use it, but the White House went ahead and ordered the border closed to those seeking refuge in the US.",
    "If the issue, as Sharon Swingle argued on behalf of the DOJ said, was to prevent infection in congregate settings like border detention facilities, the Department of Homeland Security could take mitigating measures to address that.",
    "President Biden and the Centers for Disease Control and Prevention are expected to put an end to a Trump-era policy that has kept the border essentially closed to migrants and asylum seekers since the beginning of the pandemic.",
    "But his administration had been facing growing pressures to not renew the policy that quickly turns most migrants back at the border without a fair chance to request asylum—a legal right under US and international law.",
    "As the nonprofit Human Rights First stated in a report: Title 42 was used “to evade refugee law.”\nThe policy made a huge bottleneck at the southern border—brought about by Trump’s previous policies—exponentially worse.",
    "In March 2020, at the start of the pandemic, Trump directed the CDC to invoke an obscure public health code known as Title 42 to close the border with the supposed goal of stopping the spread of Covid-19.",
    "“It’s unacceptable that this policy continues to be used indiscriminately to remove migrants with valid refugee claims.”\nSince last summer, the CDC has had to renew Title 42 every 60 days.",
    "Before the pandemic, Miller, a supporter of white nationalism, had unsuccessfully tried to use public health code and diseases before as a way to stop migration into the United States.",
    "The policy is partly the reason for the increase of apprehensions over the last two years along the US-Mexico border because so many people who are quickly turned back soon try again.",
    "“There will most likely be an initial increase of people when Title 42 is taken down because of pent-up demand and bc the smuggling networks will misrepresent US policy,” she wrote.",
    "As of March 15, 2022, the nonprofit had collected almost 10,000 cases of kidnapping, torture, rape, assault, and other violent attacks on people stuck in Mexico under this policy.",
    "Senate Majority Leader Chuck Schumer (D-NY) said in early March that Title 42 had been “nothing short of disastrous” for immigrant families seeking asylum in the United States.",
    "Plus, everyone in the United States—including CBP agents—who wanted to protect themselves by getting vaccinated against Covid has had the opportunity to do so for a year.",
    "Tyler Moran wrote that while some headlines say DHS officials are “bracing” for a “surge of migrants at the border,” it’s less about bracing and more about planning.",
    "An estimated 30,000 to 60,000 people are in northern Mexico waiting to cross and could “seek entry within hours if the CDC rule is repealed,” according to CNN.",
    "“The bottom line is that migration will likely remain high—not because of US policy—but because there are global factors at play,” Moran wrote in her tweet.",
    "Prior to Title 42, asylum seekers who turned themselves in to Border Patrol in between ports of entry were not immediately expelled without being screened.",
    "The department also said it would deploy additional agents, using a Southwest Border Coordination Center established in February and assistance from FEMA.",
    "Over the last year there had been speculation from anti-immigrant and Republican circles that if Biden ended Title 42, there would be chaos at the border.",
    "Since March 2020, border officials have used this policy more than 1.5 million times to swiftly expel migrants, often families with small children.",
    "The Biden administration plans to stop using the public health law by May 23, according to a draft of the order reported by multiple news outlets.",
    "He mentioned the availability now of Covid tests, protective masks, and vaccines that prevent severe illness and death from the virus.",
    "So, it’s hard not to ask: What makes this small percentage more of a risk to US residents than travelers with visas and US passports?",
    "Plus, unaccompanied underage migrants have been given an exemption and are processed in congregate settings at the border, he said.",
    "So while more people are migrating now, many of those at the border today are likely to have already been stuck there for a while.",
    "Now, they’re immediately sent back to Mexico, forcing more people to try to cross in more remote areas and avoid border officials.",
    "All ports of entry have been opened for travelers and tourists, and air travel between the two countries continues unrestricted.",
    "The hypocrisy of keeping the border closed only to undocumented migrants was not lost on the judges or the plaintiff’s lawyers.",
    "But human rights groups and many Democrats in Congress agree that his continuation of Title 42 expulsions broke that promise.",
    "Earlier this month Axios reported that Biden officials feared a “massive migration event” if or when Title 42 was lifted.",
    "But as immigration advocates have pointed out, the Biden administration has had more than a year to properly prepare.",
    "As the majority of the country lifts Covid restrictions, public pressure to stop using Title 42 has been growing.",
    "Human Rights First has documented extensive evidence of crimes against migrants quickly expelled under Title 42.",
    "Some migrants have been taken right back to the Mexico border; others have been flown to their home countries.",
    "As Covid-19 descended, Trump and Miller seized on the opportunity to invoke Title 42 to achieve their goals.",
    "Millions of migrants and asylum seekers from all over the world were left stranded in Mexican border cities.",
    "The Biden administration not only kept enforcing it for more than a year, it defended the policy in court.",
    "He faced public criticism from groups that helped elect him, and pushback from within the White House.",
    "The current order expires on Friday and the agency is expected to release its decision any minute now.",
    "A first, Ukrainian families seeking refuge at US ports of entry were also turned away under Title 42.",
    "The policy is also likely related to the increase of migrant deaths over the same time period.",
    "High-ranking Democrats joined immigrant rights activists in calling for an end to the policy.",
    "(It’s worth mentioning that historically, migration sees a spike during the spring months.)",
    "Public health experts have opposed the policy, calling it xenophobic, cruel, and unlawful.",
    "But the administration has since added Ukrainians to the short list of exempted groups.",
    "So, while Title 42 started out as a Trump policy, it very much became a Biden policy.",
    "“The CDC is saying, ‘Look, the whole country is open,’” Gelernt said Wednesday.",
    "Russia’s invasion of Ukraine has further revealed the policy’s hypocrisy.",
    "But that’s not what anti-immigration pundits and politicians are saying.",
    "“This isn’t March 2020,” said DC Circuit Court Judge Sri Srinivasan.",
    "When Biden took office, he chose to keep the policy in place.",
    "Biden had vowed to handle immigration in a more humane way.",
    "“It doesn’t have to be chaotic,” she said.",
    "And it has also been dangerous."
  ]
}