{
  "id": 9921,
  "mediaId": 8350,
  "date": "2022-04-03",
  "headline": "Weekend wrap-up: Here are the biggest Arizona stories from April 1-3",
  "image": "https://ktar.com/wp-content/uploads/2022/04/The-GOAT-MA-April-3-scaled-e1649027023615.jpg",
  "link": "https://ktar.com/story/4986515/weekend-wrap-up-here-are-the-biggest-arizona-stories-from-april-1-3/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    2681,
    2697,
    5879,
    4873,
    4905,
    6515,
    6381,
    6360,
    5949
  ],
  "sentences": [
    "In the letter, the DOJ said “a ban on gender-affirming procedures, therapy or medication may be a form of discrimination against transgender persons, which is impermissible unless it is ‘substantially related’ to a sufficiently important governmental interest.”\nSenate Bill 1138 restricts gender reassignment surgery until the age of 18.",
    "PHOENIX — A new restaurant and sports bar opened at Bell Bank Park in Mesa, Chief Deputy Rachel Mitchell will be on the ballot for Maricopa County attorney after getting the necessary signatures, and Arizona’s two Democratic senators criticized the Biden administration for ending asylum limits at the southern border.",
    "“Today’s (Friday) decision to announce an end to Title 42 despite not yet having a comprehensive plan ready shows a lack of understanding about the crisis at our border.”\nArizona Attorney General Mark Brnovich is prepared to go to court with the Biden administration over a bill signed Wednesday by Gov.",
    "“Bell Bank Park is the largest sports and entertainment complex in the country, so obviously we needed to follow that up with one of the largest restaurant and sports bars in the Valley,” Legacy Sports USA CEO Chad Miller said in the release.",
    "“Prematurely ending Title 42 without a comprehensive, workable plan would put at risk the health and safety of Arizona communities and migrants,” Sinema, who also serves as Chair of the Border Management Subcommittee, said in a statement.",
    "“We think their legal analysis is flawed and we are very confident what was signed into law was consistent with the constitution and all other federal statues,” Brnovich told KTAR News 92.3 FM on Friday.",
    "Thank you for your support and trust!”\nMitchell is well known for her role in U.S. Supreme Court Justice Brett Kavanaugh’s confirmation hearings and is currently leading the attorney’s office.",
    "Arizona’s two Democratic senators criticized the Biden administration on Friday for ending a public health policy limiting asylum at the southern border without a comprehensive plan in place.",
    "The U.S. Department of Justice’s Civil Rights Division sent a letter Thursday to state attorneys general warning that transgender-restricting legislation could break anti-discrimination laws.",
    "Officers responded to the area of 16th and Portland streets around 10:15 p.m. and learned a 63-year-old male bicyclist was hit by a sedan traveling northbound, authorities said.",
    "Another Republican is joining the race for Maricopa County attorney as Chief Deputy Rachel Mitchell announced Saturday that she got the necessary signatures to be on the ballot.",
    "In a letter sent to Biden last week, Kelly and Sinema said they have not seen evidence that the Department of Homeland Security has developed and implemented a sufficient plan.",
    "Homeland Security Secretary Alejandro Mayorkas in June 2021 to create a comprehensive plan in advance of the end of Title 42 and for them to be briefed on it.",
    "Mitchell becomes the second Republican to hit the mark of 4,528 signatures, joining fellow Republican Gina Godbehere who hit the number on Wednesday.",
    "Legacy Sports USA announced the opening of a new restaurant and sports bar at Bell Bank Park in Mesa on Friday, one of the largest in the state.",
    "The G.O.A.T will feature more than 100 televisions, 40+ beers on tap and sits on 17,000 square feet, according to a press release.",
    "The restaurant will feature its own unique menu with items such as Sun Devil Eggs, The G.O.A.T Burger and classic wings.",
    "Police were investigating a fatal collision involving a bicyclist that occurred in Phoenix on Friday night.",
    "Brnovich expects legal action to happen soon, whether its from his side or the Biden administration.",
    "The unknown sedan driver continued to travel northbound away from the collision, authorities said.",
    "Here are some of the biggest stories that headlined the Arizona news cycle over the weekend.",
    "“I’ve spent my career prosecuting violent crimes, sex offenders and child traffickers.",
    "The bicyclist was transported to a local hospital where he died from his injuries.",
    "“After being the last to enter this race for signatures, we hit a huge milestone.",
    "I’m humbled beyond words at the grassroots movement that made this happen.",
    "I now have enough signatures to qualify to be your next county attorney.",
    "Kyrsten Sinema and Mark Kelly said in a statement that they asked U.S.",
    "I’m ready to fight for you, our families, and our neighborhoods.",
    "Thank you Maricopa County,” Mitchell said in a press release.",
    "Doug Ducey that restrict transgender surgeries.",
    "Share\nComments",
    "“We did it!",
    "Sens."
  ]
}