{
  "id": 9954,
  "mediaId": 2855,
  "date": "2022-03-30",
  "headline": "Illegal Migrant Surge — 60 Miles from the Border",
  "image": "",
  "link": "https://cis.org/Arthur/Illegal-Migrant-Surge-60-Miles-Border",
  "mediaOutlet": "CIS",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew R. Arthur",
  "authorUrl": "https://cis.org/Arthur",
  "termIds": [
    0
  ],
  "sentences": [
    "We are aware of the updated Irregular Mass Migration Contingency Plan that DHS has developed, but — with potential changes to Title 42 coming as early as next week — that strategy contains unanswered questions and does not seem likely to allow DHS to secure the border, protect our communities, and ensure migrants are treated fairly and humanely.",
    "With tens of thousands of pent-up migrants in Tapachula, Title 42 on the (purported) verge of ending, and a Border Patrol sector so overwhelmed that agents are dumping aliens on the streets of veritable villages miles from the border, it is highly unlikely that there is any border security in the offing.",
    "I mean, the daily tally will change day-to-day once they start releasing them.”\nThe locals are not ready, and the mayor explains that, unlike other nearby areas where there are charities or churches to assist migrants, there is no such support in his town: “We’re starting from scratch, literally”.",
    "These were “got-aways”, migrants who did not want to be caught, either because they knew they were likely to be expelled under CDC orders issued under Title 42 of the U.S. Code in response to the Covid-19 pandemic, or because they were smuggling drugs or other contraband themselves.",
    "That year, by comparison, agents in Rio Grande Valley sector (“RGV”, on the far eastern stretch of the border, beginning at the Gulf of Mexico) caught more than 339,000 aliens who had entered illegally, and Border Patrol’s El Paso sector accounted for 182,000-plus apprehensions.",
    "Rep. Tony Gonzales (R-Texas), whose district includes Del Rio, Eagle Pass, Uvalde, and Carrizo Springs, put it most aptly when he tweeted:\nThis morning, with facilities in the area over capacity, Border Patrol was forced to release a group of migrants into the city of Uvalde.",
    "When I was there in August, Texas State troopers deployed to the border as part of Operation Lone Star cruised through from time to time, looking for migrants who were trying to hook up (after days of walking) with their smugglers, or to hop the freight trains north.",
    "Arizona’s two senators — both Democrats — wrote the White House last week to complain that:\nTo date, we have not yet seen evidence that DHS has developed and implemented a sufficient plan to maintain a humane and orderly process in the event of an end to Title 42.",
    "Bensman warned that this onslaught was coming when he reported on March 14:\nIn the far south of Mexico, the central government is about to release a sea of U.S.-bound migrants it has dammed up behind the bureaucratic barrier in the southernmost city of Tapachula.",
    "Recent reports from Texas suggest that Bensman was right, as the Border Patrol’s Del Rio sector is so overwhelmed it is releasing hundreds of migrants 60 miles away from the border to make their way into the interior of the United States.",
    "And this government has no regard for American citizens.”\nIt is a scene that is being replayed 50 miles south in the town of Carrizo Springs, Texas, which sits 40 miles southeast of the Eagle Pass Port of Entry.",
    "Uvalde Mayor Don McLaughlin complains: “People in our community are fed up with it,” explaining that the number of migrants Border Patrol is releasing exceeds the number of seats on the buses headed out of town.",
    "Agents in Del Rio sector are responsible for 245 miles of the 1,954-mile Southwest border, and the sector’s jurisdiction reaches 300 miles into Texas to account for an area of more than 55,000 square miles.",
    "The biggest town, Del Rio, is home to fewer than 35,000 residents (the population has dropped since the 2010 census), while the town of Eagle Pass, an hour down the road, has just over 28,000 residents.",
    "Last December:\nTapachula was experiencing much migrant indigestion as it is right now: 50,000 blocked and angry migrants brawling, fighting, demonstrating, and disrupting city life every day.",
    "Rep. Gonzales was correct: “This is the consequence of a broken immigration system and failed policies.” And that consequence is falling hardest on those towns least prepared to deal with it.",
    "Border Patrol detention facilities in Del Rio and Eagle Pass are so full that agents are transporting them — up to 150 per day — to Uvalde to drop them off to seek transit into the interior.",
    "There are fewer than 25,000 people in all of Uvalde County (which covers just over 1,600 square miles), and the city of Uvalde is home to most of them — just over 16,000 full-time residents.",
    "Unlike the Biden administration, officials on the other side of the border have policies and plans to block the northward movement of migrants from Central America and further abroad.",
    "Two weeks ago, my colleague Todd Bensman warned that the Mexican government was preparing to release tens of thousands of migrants it had caught making their way to the United States.",
    "Two facts to give you an idea of how remote Del Rio sector is: First, I took my son there when he was learning how to drive, figuring that there was not much that he could run into.",
    "Things were even slower in FY 2018: That year, there were just fewer than 400,000 Southwest border apprehensions, but Del Rio sector accounted for less than 4 percent of them.",
    "When it was all over, no one noticed that tens of thousands headed for the border in an “ant operation” exodus over about a week’s time between Christmas and New Year’s Day.",
    "For example, in FY 2019, when Border Patrol apprehensions exceeded 851,500 at the Southwest border, fewer than 57,300 illegal migrants were apprehended in Del Rio sector.",
    "That would be like Border Patrol dropping off more than 5,000 migrants in Tucson, Ariz. (population 542,000), every 24 hours and expecting them to move along.",
    "Worse, according to the Washington Examiner, there are no planes, trains, or buses the migrants can use to get out of Dimmit County, home to Carrizo Springs.",
    "The QR Code Visas required migrants to board hundreds of government-arranged buses that were heading to 14 different designated Mexican cities in the north.",
    "FEMA — the Federal Emergency Management Agency — is synonymous with “disaster”, and a man-made disaster is what the mayor and his town have on their hands.",
    "In the first five months of FY 2022, apprehensions in Del Rio sector are up more than 215 percent (to 153,271) compared to the same period in FY 2021.",
    "As Carrizo Springs Mayor Oscar Puente explained: “[The] agent in charge [said it] could be 10, could be 50, could be 150 [individuals released].",
    "Any place a New York stockbroker can squeeze off a hundred rounds at an Axis deer without worrying about hitting anything else is pretty rural.",
    "Del Rio sector hugs the banks of the Rio Grande between Laredo sector to the southeast and Big Bend (previously Marfa) sector to the northwest.",
    "And unlike the San Diego, El Paso, or Tucson sectors, or even the RGV, there are no cities nearby where migrants can be sent for processing.",
    "It has not, however, been a hot zone for illegal migration — at least not in comparison to other Southwest border sectors — until recently.",
    "RGV had twice as many agents in FY 2020, while Tucson sector’s strength was more than 140 percent larger than Del Rio sector’s.",
    "Mexico City is trying to discourage illegal migrants; Washington, D.C., on the other hand, has no answer, aside from Title 42.",
    "That means that the town grows about 1 percent per day in population until the released migrants leave and new ones show up.",
    "From a high of nearly 1,700 agents in the sector in FY 2010, the cadre there fell to just over 1,500 in FY 2020.",
    "The coming swell has risen to more than 73,000 angry, mobbing, rioting migrants from January 1 through March 8.",
    "Border Patrol informed that town (population 5,203) last week that it would be releasing migrants there, too.",
    "Apprehensions surged more than 542 percent in Del Rio sector between FY 2020 (40,342) and FY 2021 (259,294).",
    "pic.twitter.com/MuJanr7c5E\n— Rep. Tony Gonzales (@RepTonyGonzales) March 23, 2022\nThe Tapachula Connection.",
    "He is hoping to get FEMA funding “to be used for future transportation costs” to handle the surge.",
    "Mexico’s central government ordered that special “QR Code Visas” be made available to all 50,000.",
    "It is not the first time that the Mexican government has taken such steps, as Bensman explained.",
    "Agents in the RGV, by contrast, apprehended 10 times as many illegal migrants that fiscal year.",
    "Not surprisingly one of the pair, Sen. Mark Kelly (D-Ariz.), is in a tough reelection fight.",
    "Second, game ranches, where tourists can shoot exotic animals, are big business there.",
    "Which brings me first to Uvalde, a town 60 miles inland from the Rio Grande.",
    "This is the consequence of a broken immigration system and failed policies.",
    "It is difficult to think of a worse place for that surge to occur.",
    "The neighboring town of Carrizo Springs has had to do the same.",
    "Those towns are on the front line of Biden’s border debacle.",
    "As he explains: “It’s a powder keg that’s going to blow up.",
    "But the rumor mill suggests that Title 42 will end soon.",
    "The closest city, San Antonio, is about 160 miles away.",
    "Of course, Tucson is a city and could handle the flow.",
    "The Disaster in Uvalde and Carrizo Springs, Texas.",
    "Migrants are a lot easier to find there of late.",
    "And it looks like they are about to get worse.",
    "One can hardly blame the Mexican government.",
    "Uvalde is quaint but sparsely populated.",
    "Del Rio sector was staffed accordingly.",
    "Things change quickly at the border.",
    "Del Rio Sector.",
    "Not so much.",
    "Uvalde?"
  ]
}