{
  "id": 9982,
  "mediaId": 2520,
  "date": "2022-04-04",
  "headline": "Why Sen. Mark Kelly will vote to confirm Judge Ketanji Brown Jackson to the Supreme Court",
  "image": "https://www.gannett-cdn.com/presto/2022/02/23/PPHX/5ce67f12-45ed-4749-b7f5-8a19d484f022-_JAJ6013.jpg?crop=3599,2025,x0,y184&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/elections/2022/04/04/why-senator-mark-kelly-vote-confirm-judge-ketanji-brown-jackson/7269601001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Yvonne Wingett Sanchez",
  "authorUrl": "https://www.azcentral.com/staff/2646083001/yvonne-wingett-sanchez/",
  "termIds": [
    4905,
    5879,
    5590,
    5699,
    2459,
    1489,
    1269,
    392
  ],
  "sentences": [
    "“Today, we had a very productive meeting and I welcomed hearing directly her belief in the importance of an independent judiciary, her judicial philosophy, and her approach to precedent.”\nNeither Kelly nor Sinema sits on the Senate Judiciary Committee, which vets high-court nominees, and neither has played a central role in Jackson’s confirmation hearings.",
    "“After speaking with Judge Jackson and reviewing her record and approach to deciding cases, I believe her to be very well qualified and having demonstrated a commitment to fairly interpret and uphold the Constitution on our nation’s highest court,” Kelly said in the written statement.",
    "Sinema voted last year to confirm Jackson to sit on the U.S. Court of Appeals for the District of Columbia and has raised no concerns with aspects she deems most important when considering nominees, such as professional qualifications and an ability to fairly uphold the Constitution.",
    "Republicans on the Judiciary Committee have questioned Jackson on her record sentencing defendants in child pornography cases and picked apart her record representing detainees at Guantanamo Bay when she served as a federal defender.",
    "Kelly, D-Ariz., in a written statement ahead of the Judiciary Committee’s vote to advance Jackson’s nomination, said he believes she would “fairly interpret and uphold the Constitution” and is “well-qualified” for the lifetime post.",
    "Sen. Mark Kelly said Monday he will vote to confirm Judge Ketanji Brown Jackson to the U.S. Supreme Court when her nomination appears before the evenly-divided Senate, expected later this week.",
    "“I look forward to voting to confirm Judge Jackson to serve on the Supreme Court.”\nThis is Kelly’s first vote on a Supreme Court nominee and his support of Jackson was never in doubt.",
    "Sen. Kyrsten Sinema, D-Ariz., who almost never previews her votes on judicial and Cabinet-level nominations, also is expected to vote to confirm Jackson.",
    "“As I promised Arizonans, I am carefully considering Judge Jackson’s nomination,” Sinema said in a written statement on March 10.",
    "Some unsuccessfully sought her views on controversial political issues, from critical race theory to transgender rights.",
    "Subscribe for free to The Gaggle political podcast on Apple Podcasts, Overcast, or wherever you listen to audio content.",
    "All of the Democratic senators are expected to vote to confirm Jackson’s historic nomination by President Joe Biden.",
    "She is set to become the first Black woman to serve on the high court.",
    "Contact her at yvonne.wingett@arizonarepublic.com and 602-444-4712.",
    "Reach the reporter on Twitter and Facebook.",
    "Have news to share about Arizona politics?",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}