[
  {
    "id": 4186,
    "mediaId": 2716,
    "date": "2022-01-24",
    "sentence": "",
    "author": "Grayson Quay",
    "title": "Millionaire candidates make massive ad buys in Pennsylvania's GOP Senate primary"
  },
  {
    "id": 3095,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "",
    "author": "Dave Boyer",
    "title": "Pa. Democrats had vote-counting snag in attempt to endorse Senate candidate"
  },
  {
    "id": 3492,
    "mediaId": 2634,
    "date": "2022-02-02",
    "sentence": "The primary is divided among four Democrats: Congressman Conor Lamb, who won an intensely fought race for a swingy district in the western part of the state in 2018; Lieutenant Governor <span class='selected-term'>John Fetterman</span>, a six-foot-nine Democrat aligned with the progressive wing of the party; state Representative Malcolm Kenyatta, another progressive who is the only Black candidate in the primary; and Dr. Val Arkoosh, the chair of the Montgomery county commission—a crucial Philadelphia suburb.",
    "author": "Daniel Strauss",
    "title": "Democrats Can Win the Pennsylvania Senate Seat—if They Don’t Slaughter One Another First"
  },
  {
    "id": 1869,
    "mediaId": 2822,
    "date": "2022-02-04",
    "sentence": "",
    "author": "SAM METZ and MEAD GRUVER",
    "title": "GOP now looks to censure Cheney and Kinzinger, not oust them"
  },
  {
    "id": 1138,
    "mediaId": 2637,
    "date": "2022-02-16",
    "sentence": "Locked in a tight nominating race with the Northeastern state’s progressive lieutenant governor, <span class='selected-term'>John Fetterman</span>, the moderate Lamb has drawn comparisons to Manchin, a conservative Democratic Senator from neighboring West Virginia who has routinely acted as a roadblock to Democratic priorities in Congress.",
    "author": "Jarrett Renshaw",
    "title": "Pennsylvania's moderate Democrat Lamb distances himself from Manchin"
  },
  {
    "id": 1388,
    "mediaId": 2822,
    "date": "2022-02-17",
    "sentence": "",
    "author": "STEVE PEOPLES",
    "title": "'The brand is so toxic': Democrats fear extinction in rural America"
  },
  {
    "id": 942,
    "mediaId": 2746,
    "date": "2022-02-17",
    "sentence": "",
    "author": "Steve Peoples",
    "title": "Democrats ostracized in parts of rural U.S. as brand takes a hit"
  },
  {
    "id": 15225,
    "mediaId": 8254,
    "date": "2022-03-06",
    "sentence": "(WHTM) – A new poll conducted by Franklin & Marshall College shows Lieutenant Governor <span class='selected-term'>John Fetterman</span> ahead in the Democratic race for Pennsylvania’s U.S. Senate seat, while Republicans are widely undecided with a large number of candidates still in the race.",
    "author": "George Stockburger",
    "title": "Pa. Senate Race: Fetterman leads Democrats, Republicans knotted in latest poll"
  },
  {
    "id": 15758,
    "mediaId": 6570,
    "date": "2022-03-07",
    "sentence": "",
    "author": "Jennifer Sheehan",
    "title": "Muhlenberg College to host first Pennsylvania Senate Democratic debate; John Fetterman still 'under discussion' to attend"
  },
  {
    "id": 15500,
    "mediaId": 2746,
    "date": "2022-03-08",
    "sentence": "",
    "author": "Seth McLaughlin",
    "title": "Democratic candidate for Senate offers a fix for rising prices: ‘Make more s—- in America’"
  },
  {
    "id": 15339,
    "mediaId": 2746,
    "date": "2022-03-10",
    "sentence": "",
    "author": "Seth McLaughlin",
    "title": "Pennsylvania’s Conor Lamb hypes electability in first Senate campaign ad"
  },
  {
    "id": 11209,
    "mediaId": 2540,
    "date": "2022-03-17",
    "sentence": "",
    "author": "David Wright",
    "title": "Republicans hammer Democrats on inflation in midterms advertising"
  },
  {
    "id": 9103,
    "mediaId": 2732,
    "date": "2022-03-20",
    "sentence": "",
    "author": "Ryan Deto",
    "title": "Democratic Senate candidates square off in political forum at CMU"
  },
  {
    "id": 8893,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "But the fact that <span class='selected-term'>John Fetterman</span> thinks only Fox News Republicans oppose socialism, defunding the police, and banning all private health insurance shows how out of touch he is with reality and why the Republicans are dying to run against him in the fall.”\nA recent email promoting the pro-Lamb group to potential donors said the congressman would join an upcoming call, after which a leader of the super PAC would speak.",
    "author": "",
    "title": "Super PAC signals Pennsylvania primary could get rough"
  },
  {
    "id": 9469,
    "mediaId": 2659,
    "date": "2022-03-22",
    "sentence": "",
    "author": "Jason Easley",
    "title": "Trump Is Hinting At Meddling And Handing The Pennsylvania Senate Seat To Democrats By Supporting Dr. Oz"
  },
  {
    "id": 9036,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "\"To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent — <span class='selected-term'>John Fetterman</span> — not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. Mehmet Oz.\"",
    "author": "Matthew Chapman",
    "title": "Biden-snubbed Conor Lamb says 'the race is wide open' for Pennsylvania Senate — but is that what the numbers say?"
  },
  {
    "id": 11742,
    "mediaId": 8254,
    "date": "2022-03-28",
    "sentence": "",
    "author": "Max Greenwood",
    "title": "Pennsylvania Senate primaries get personal"
  },
  {
    "id": 9724,
    "mediaId": 2872,
    "date": "2022-03-30",
    "sentence": "Compared to Lamb, the sort of ur-centrist Dem perfectly suited to sit comfortably in the middle of the road until he’s flattened by a semi, <span class='selected-term'>John Fetterman</span> has stomped unapologetically onto the political scene as a legal weed-loving, union-boosting everyman who eschews suits and ties for shorts and hoodies.",
    "author": "",
    "title": "Pennsylvania is ground zero for 2022’s ugliest Senate races"
  },
  {
    "id": 9934,
    "mediaId": 8254,
    "date": "2022-03-31",
    "sentence": "HARRISBURG, Pa. (WHTM) — A new WHTM/Emerson College Polling/The Hill poll shows <span class='selected-term'>John Fetterman</span> leading Democrats ahead of the May 17 primary, but a majority still undecided.",
    "author": "Lauren Rude",
    "title": "Pa. Senate Primary: Fetterman leads in latest poll, majority undecided"
  },
  {
    "id": 10234,
    "mediaId": 2599,
    "date": "2022-03-31",
    "sentence": "",
    "author": "",
    "title": "THOSE WHO CANNOT REMEMBER THE PAST ARE CONDEMNED TO QUOTE SANTAYANA:"
  },
  {
    "id": 9926,
    "mediaId": 2594,
    "date": "2022-04-01",
    "sentence": "Conor Lamb is accusing rival <span class='selected-term'>John Fetterman</span> in Pennsylvania's Democratic U.S. Senate primary of skipping candidate forums to avoid talking about a 2013 incident when shotgun in hand, he confronted a Black man because he suspected the man was involved in gunfire nearby.",
    "author": "Via AP news wire",
    "title": "Lamb revives gun incident to attack Fetterman in Senate race"
  },
  {
    "id": 7295,
    "mediaId": 2660,
    "date": "2022-04-01",
    "sentence": "(Mostly True)\nDave McCormick: Campaign website\nMehmet Oz: Campaign website\nJeff Bartos: Campaign website\nCarla Sands: Campaign website\nGeorge Bochetto: Campaign website\nKathy Barnette: Campaign website\n<span class='selected-term'>John Fetterman</span>: Campaign website\nConor Lamb: Campaign website\nMalcolm Kenyatta: Campaign website\nPennsylvania Capital-Star, \"An early guide to Pennsylvania’s 2022 Senate and governor’s primary election,\" March 15, 2022\nFox Business, \"Pennsylvania is home to most expensive Senate race in nation,\" March 24, 2022\nCity & State Pennsylvania, \"Endorsements in Pennsylvania’s U.S. Senate race keep stacking up,\" March 28, 2022\nPhiladelphia Inquirer, \"Where the Pennsylvania Democratic Senate candidates do and don't agree,\" March 7, 2022\nNew York Times, \"Dr. Oz’s Heritage Is Targeted as Rivals Vie for Trump Backing,\" March 18, 2022\nThe Hill, \"Pennsylvania Senate primaries get personal,\" March 28, 2022\nDaily Beast, \"Inside Dr. Oz’s Shameless Flip-Flop on Abortion,\" Dec. 7, 2021\nAssociated Press, \"Oz vows to renounce Turkish citizenship if elected senator,\" March 17, 2022\nPittsburgh Post-Gazette, \"For GOP Senate candidate Jeff Bartos, front-runners for the job aren’t true Pennsylvanians,\" March 22, 2022\nWOLF-TV, \"Republican Senate hopeful Carla Sands,\" March 27, 2022\nPhiladelphia Inquirer, \"George Bochetto launches Pa. Republican Senate campaign,\" March 4, 2022\nCook Political Report with Amy Walter, \"Pennsylvania Senate: Which Candidate Is the Primary Prescription for Republicans?\"",
    "author": "",
    "title": "The race for the Pennsylvania U.S. Senate seat: A guide"
  },
  {
    "id": 10538,
    "mediaId": 2609,
    "date": "2022-04-03",
    "sentence": "",
    "author": "Mike LaChance",
    "title": "Democrat Candidates Suddenly Shying Away From the “Progressive” Label, Keep Toxic Policy Positions"
  },
  {
    "id": 10659,
    "mediaId": 2550,
    "date": "2022-04-04",
    "sentence": "",
    "author": "",
    "title": "Republicans are about to kill cannabis legalization. Could that help Democrats in the midterms?"
  },
  {
    "id": 9876,
    "mediaId": 8368,
    "date": "2022-04-04",
    "sentence": "By MARC LEVY, Associated Press\nConor Lamb is accusing rival <span class='selected-term'>John Fetterman</span> in Pennsylvania’s Democratic U.S. Senate primary of skipping candidate forums to avoid talking about a 2013 incident when, shotgun in hand, he confronted a Black man because he suspected the man was involved in gunfire nearby.",
    "author": "Associated Press",
    "title": "Lamb revives gun incident to attack Fetterman in Senate race"
  },
  {
    "id": 7997,
    "mediaId": 2550,
    "date": "2022-04-05",
    "sentence": "",
    "author": "",
    "title": "Fetterman campaign demands takedown of ads calling him a 'democratic socialist'"
  },
  {
    "id": 7891,
    "mediaId": 2934,
    "date": "2022-04-06",
    "sentence": "A super PAC supporting Rep. Conor Lamb for U.S. Senate in Pennsylvania made two misleading claims about the Democratic front-runner, <span class='selected-term'>John Fetterman</span>, one of which resulted in a Philadelphia TV station pulling the ad.",
    "author": "Robert Farley",
    "title": "Pro-Lamb Super PAC Misfires in Attack Ad Against Fetterman"
  },
  {
    "id": 7209,
    "mediaId": 2660,
    "date": "2022-04-06",
    "sentence": "US Senate candidate <span class='selected-term'>John Fetterman</span> has described himself as a democratic socialist\nIf Your Time is short\nThe ad alludes to a 2020 NPR story that called Fetterman a self-described democratic socialist.",
    "author": "Tom Kertscher",
    "title": "\"John Fetterman's a self-described democratic socialist.\""
  },
  {
    "id": 8434,
    "mediaId": 8489,
    "date": "2022-04-09",
    "sentence": "Voters are digesting a newly hostile Democratic primary race in Pennsylvania’s premier contest for U.S. Senate, as the leading candidates came together in a room Saturday, face to face, for the first time since Conor Lamb first attacked rival <span class='selected-term'>John Fetterman</span>.",
    "author": "Marc Levy",
    "title": "Fetterman, Democrats confront a newly hostile Pa. Senate primary"
  },
  {
    "id": 6512,
    "mediaId": 8489,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Domenico Montanaro",
    "title": "The top 10 Senate races that are most likely to flip to the other party"
  },
  {
    "id": 6811,
    "mediaId": 2548,
    "date": "2022-04-11",
    "sentence": "“I believe that the vote was misguided, and that is something that I would never be a part of.”\n<span class='selected-term'>John Fetterman</span> says he was “dismayed” by the Squad’s opposition of Iron Dome funding for Israel — and adds other choice words for the left wing of his party.",
    "author": "Michael Ginsberg",
    "title": "Pennsylvania Lt. Gov. John Fetterman Calls Out ‘Misguided’ ‘Squad’ For Anti-Israel Vote"
  },
  {
    "id": 6947,
    "mediaId": 2803,
    "date": "2022-04-12",
    "sentence": "Jonathan Tamari: Let’s start with <span class='selected-term'>John Fetterman</span>, who the lieutenant governor and, by all accounts, the significant front-runner at this point.",
    "author": "Mary Harris",
    "title": "The Senate Race That Could Decide Democrats’ Future"
  },
  {
    "id": 6205,
    "mediaId": 8254,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Lauren Rude",
    "title": "2022 United States Senate election in Pennsylvania: Where Democratic candidates stand on the issues"
  },
  {
    "id": 5926,
    "mediaId": 2659,
    "date": "2022-04-14",
    "sentence": "According to a new Franklin & Marshall College Poll:\n<span class='selected-term'>John Fetterman</span> has increased his advantage in the Democratic US Senate primary since March–Fetterman now leads Conor Lamb, 41% to 17%, with one in four (26%) still undecided about their preference.",
    "author": "Jason Easley",
    "title": "John Fetterman’s Support Grows 13 Points In A Month In PA Senate Primary"
  },
  {
    "id": 5186,
    "mediaId": 2589,
    "date": "2022-04-19",
    "sentence": "",
    "author": "Ed Morrissey",
    "title": "ABC, Punchbowl, Politico: Dems sure seem incoherent on immigration"
  },
  {
    "id": 4829,
    "mediaId": 2699,
    "date": "2022-04-19",
    "sentence": "",
    "author": "Ursula Perano",
    "title": "Progressives Go From Left Wing to Center Stage in Critical Senate Races"
  },
  {
    "id": 4791,
    "mediaId": 8393,
    "date": "2022-04-20",
    "sentence": "Ahead of the debate, catch up on the latest with each candidate who will be on abc27 Thursday night, below:\n<span class='selected-term'>John Fetterman</span>, Pennsylvania Lieutenant Governor\nWhile many of the polls recently conducted did not reveal a clear leader in the Republican primary, there has been a consistent frontrunner for the Democratic party — Pennsylvania’s Lt.",
    "author": "Lauren Rude",
    "title": "Pennsylvania Democratic Party Senate candidates set to debate Thursday"
  },
  {
    "id": 4781,
    "mediaId": 8404,
    "date": "2022-04-20",
    "sentence": "Governor <span class='selected-term'>John Fetterman</span>, Congressman Conor Lamb, and State State Representative Malcolm Kenyatta debated from the abc27 studio in Harrisburg.",
    "author": "George Stockburger",
    "title": "How to rewatch the Democratic Pennsylvania U.S. Senate debate"
  },
  {
    "id": 4652,
    "mediaId": 8254,
    "date": "2022-04-20",
    "sentence": "Governor <span class='selected-term'>John Fetterman</span>, Congressman Conor Lamb, and State State Representative Malcolm Kenyatta debated from the abc27 studio in Harrisburg.",
    "author": "George Stockburger",
    "title": "How to rewatch the Democratic Pennsylvania U.S. Senate debate"
  },
  {
    "id": 4720,
    "mediaId": 8504,
    "date": "2022-04-21",
    "sentence": "Plus, catch up on the latest with each candidate who attended:\n<span class='selected-term'>John Fetterman</span>, Pennsylvania Lieutenant Governor\nWhile many of the polls recently conducted did not reveal a clear leader in the Republican primary, there has been a consistent frontrunner for the Democratic party — Pennsylvania’s Lt.",
    "author": "Lauren Rude",
    "title": "Fetterman fends off attacks in Pennsylvania Democratic U.S. Senate Debate"
  },
  {
    "id": 4687,
    "mediaId": 2732,
    "date": "2022-04-21",
    "sentence": "",
    "author": "Associated Press",
    "title": "Live TV debate exposes Democrats' differences in Senate race"
  },
  {
    "id": 4882,
    "mediaId": 6570,
    "date": "2022-04-21",
    "sentence": "",
    "author": "Julian Routh",
    "title": "Front-runner Fetterman defends his platform, 2013 Braddock incident in Democratic U.S. Senate debate"
  },
  {
    "id": 5923,
    "mediaId": 2911,
    "date": "2022-04-21",
    "sentence": "",
    "author": "Geoffrey Skelley",
    "title": "The 13 Most Important Republican Senate Primaries To Watch"
  },
  {
    "id": 5774,
    "mediaId": 2730,
    "date": "2022-04-22",
    "sentence": "PA Lt. Gov <span class='selected-term'>John Fetterman</span> (who is running for US Senate) looks thrilled to be at the Easter Egg Roll.",
    "author": "Matt Vespa",
    "title": "Democrats Appear to Be Testing Progressive Populism In PA Senate Race"
  },
  {
    "id": 5080,
    "mediaId": 6526,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Julian Routh",
    "title": "Fetterman defends platform, 2013 Braddock incident in fiery Democratic U.S. Senate debate"
  },
  {
    "id": 4819,
    "mediaId": 8449,
    "date": "2022-04-22",
    "sentence": "",
    "author": "",
    "title": "Debate expone diferencias entre demócratas en la contienda por el Senado"
  },
  {
    "id": 4670,
    "mediaId": 2859,
    "date": "2022-04-24",
    "sentence": "The Democratic frontrunner is <span class='selected-term'>John Fetterman</span>, the lieutenant governor of Pennsylvania who sports a goatee, supports both state and federal legalization of marijuana and takes to the campaign trail in his gym shorts and black pickup truck.",
    "author": "Mya Jaradat",
    "title": "Races to watch in the 2022 midterms"
  }
]