[
  {
    "id": 81,
    "mediaId": 25,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "Four other congressional candidates also attended Trump's rally: Audra Johnson, who's challenging Republican <span class='selected-term'>Peter Meijer</span> in Michigan's 3rd District, Annie Black in Nevada's 4th District, Jo Rae Perkins, a Republican Senate candidate in Oregon linked to the QAnon conspiracy group and Colorado State Representative Ron Hanks, who's running for Colorado's U.S. Senate seat.",
    "author": "Aaron Navarro",
    "title": "Over 30 people who rallied in Washington on January 6, 2021 are running for state and federal offices",
    "sentiment": "0.0"
  },
  {
    "id": 80,
    "mediaId": 124,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Share this -\nAllan Smith\n9h ago / 8:32 PM UTC\nGOP Rep. who voted to impeach Trump shares video of House evacuation\nRep. <span class='selected-term'>Peter Meijer</span>, R-Mich., posted to Twitter a video he shot from the House gallery as the chamber was being evacuated during the Capitol riot.",
    "author": "",
    "title": "Jan. 6 Capitol riot: Full anniversary coverage",
    "sentiment": "0.0"
  },
  {
    "id": 79,
    "mediaId": 1546,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "While the U.S. military is no longer present in Afghanistan, our mission there is not over,\" said Republican Representative <span class='selected-term'>Peter Meijer</span>, who last year co-sponsored legislation that would expand the SIV program and ask the administration to prioritize the evacuation of P-2 applicants from Afghanistan.",
    "author": "Masood Farivar",
    "title": "Few Afghan Refugees Relocating to US Under 'P-2' Program",
    "sentiment": "0.0"
  },
  {
    "id": 68,
    "mediaId": 163,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "Scalise gave money in September to at least three House members who voted to impeach Trump: <span class='selected-term'>Peter Meijer</span> of Michigan and Jaime Herrera Beutler of Washington state - who are both facing Trump-endorsed challengers - as well as David Valadao of California.",
    "author": "Alexandra Ulmer",
    "title": "Republican U.S. lawmakers funnel money to colleagues who crossed Trump",
    "sentiment": "0.0"
  },
  {
    "id": 69,
    "mediaId": 323,
    "date": "2/1/2022 12:00:00 AM",
    "sentence": "My only hope is to live and help my children get to a better place.'?\n  Fahima, an Afghan mother with three teenagers now living illegally in Pakistan\nRep. <span class='selected-term'>Peter Meijer</span> (R., Mich.) said there was a tremendous amount of confusion? about which path Afghans should try to reach the U.S. We know there are these other programs that can take years.",
    "author": "Michelle Hackman",
    "title": "Thousands of Afghans Face Narrow Path to Gain Entry to U.S.",
    "sentiment": "0.0"
  },
  {
    "id": 3286,
    "mediaId": 187,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "From the January/February 2022 issue: Tim Alberta on <span class='selected-term'>Peter Meijer</span> and what the GOP does to its own dissenters\nThere are different truths in politicsTrumps truth, Bidens truth, whatever, B.J.",
    "author": "Tim Alberta",
    "title": "How Politics Poisoned the Evangelical Church",
    "sentiment": "0.0"
  }
]