{
  "id": 3442,
  "mediaId": 195,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Madison Cawthorn faces primary voters on Tuesday",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2020/06/cawthornmadison_nc11.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/house/3488650-madison-cawthorn-faces-primary-voters-on-tuesday/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    641,
    821,
    1025,
    1790,
    2303,
    3079
  ],
  "sentences": [
    "In the most recent and most fiery incident, the same PAC posted a video showing Cawthorn in the nude, which the congressman later deemed blackmail.?\nI'm NOT backing down,? Cawthorn tweeted after the release of the video, which he excused as depicting him and a friend acting foolish, and joking.?\nThese scandals follow a trail of others surrounding Cawthorn that have accumulated since the beginning of the year.",
    "House Minority Leader Kevin McCarthy (R-Calif.) said in response to Cawthorn's comments: He's got to turn himself around.?\nMcCarthy earlier called out Cawthorn for calling Ukrainian President Volodymyr Zelensky a thug? and the Ukrainian government incredibly corrupt andincredibly evil? just two weeks after Russia's invasion of the country.",
    "The anti-Cawthorn American Muckrakers PAC filed an ethics complaint against the North Carolina lawmaker the same week that raised concerns about gifts Cawthorn allegedly gave to his congressional office scheduler, a distant cousin the congressman claims is like a brother to him.",
    "The 26-year-old congressman was cited for attempting to take a loaded gun through security in a North Carolina airport on April 26, prompting Democrats to request a TSA crackdown on firearms and further gun regulations in the U.S. Capitol.",
    "In another controversy, a secretly recorded phone call was released in April in which a former Cawthorn staffer accused him of denying her medical and family leave while working for him and later firing her from her job improperly.",
    "Cawthorn is being challenged by state Sen. Chuck Edwards (R), who has been endorsed by North Carolina Sen. Thom Tillis (R), and several other candidates for the Republican nomination in the state's 11th congressional district.",
    "A day later, Sen. Thom Tillis (R-N.C.) called for the House Ethics Committee to investigate Cawthorn over allegations of insider trading related to the congressman's support for Let's Go Brandon cryptocurrency.",
    "The congressman was hit with a legal challenge in January that aimed to disqualify him from running for a second term over his participation in a rally preceding the Jan. 6, 2021, attack on the Capitol.",
    "Republican leadership took issue with Cawthorn publicly after he claimed in March that he had been invited to an orgy by fellow lawmakers and that he had seen other members of Congress doing cocaine.",
    "Cawthorn was charged with driving with a revoked license for the second time in March, and photos were leaked in April of the congressman dressed in women's lingerie at an apparent party.",
    "A poll commissioned by the Republican GOPAC Election Fund found found that Cawthorn dropped from 49 percent support among respondents in March to 38 percent in April.",
    "Rep. Madison Cawthorn (R-NC) will face primary voters on Tuesday amid a pileup of controversies that has built up around him in recent months.",
    "GOP candidates for the seat also include Rod Honeycutt, Michele Woodhouse, Matthew Burril, Wendy Navarez, Bruce O'Connell and Kristie Sluder.",
    "Insider trading by a member of Congress is a serious betrayal of their oath, and Congressman Cawthorn owes North Carolinians an explanation.",
    "If he secures that share of the votes in Tuesday's primary, Cawthorn would still clear the 30 percent threshold needed to avoid a runoff.",
    "However, the April polling, conducted on April 25 and 26, doesn't reflect the most recent controversies confronting Cawthorn.",
    "Their longtime personal friendship and other exceptions to House rules governing gifts make that situation murky, however.",
    "The winner of the May 17 GOP primary vote will face off against a Democrat for the seat in a November 8, 2022, election.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Recent polling has indicated that the incumbent Cawthorn has more support among primary voters than other candidates.",
    "There needs to be a thorough and bipartisan inquiry into the matter by the House Ethics Committee,? said Tillis.",
    "The ethics complaint was accompanied by a video of Cawthorn making sexual jokes with the same male staffer.",
    "The lawsuit was ultimately blocked by a federal judge in early March.",
    "The lawmaker and his office vehemently denied the allegations.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Madison is wrong,? McCarthy stated clearly."
  ]
}