{
  "id": 1929,
  "mediaId": 8260,
  "date": "2022-02-04",
  "headline": "Conservation activists say a proposed mine threatens water source in Arizona’s Sky Islands",
  "image": "https://www.gannett-cdn.com/presto/2021/08/23/PPHX/81e2111e-1887-4043-817e-404c8c9a302d-Patagonia_mining_1D.jpg?crop=1999,1125,x0,y101&width=1999&height=1125&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/local/arizona-environment/2022/02/04/conservation-activists-oppose-mine-in-arizonas-sky-islands/8238800002/",
  "mediaOutlet": "Arizona Business Gazette",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ian James",
  "authorUrl": "https://www.azcentral.com/staff/2647622001/ian-james/",
  "termIds": [
    6383,
    6587,
    6678,
    5949
  ],
  "sentences": [
    "Answering some of the concerns raised, the department said its permit program “protects human health and the environment by setting pollutant limits,” and that the limits in the permit “were written to be protective of the designated uses of Harshaw Creek.”\nThe department also said that for a facility such as a water treatment plant, “quarterly monitoring will provide adequate data.”\nResponding to a comment by resident John Nordstrom, who said he has grave concerns about how the drawdown of the aquifer could affect the well on his property, ADEQ said the permit program “as designed by state and federal law, regulates the discharge of pollutants into regulated waters” but “does not regulate dewatering.”\nRisner said South32 is offering a voluntary well-monitoring program, which would allow residents within 3 miles of the site to have samples from their private wells collected by the company and submitted to a lab for analysis.",
    "The groups said the proposed revisions in the permit are “inadequate to protect the existing water uses, human health, and the biologically diverse environment of the Patagonia region.” They raised objections on a list of points, saying quarterly water-sampling wouldn’t be nearly often enough, that the limits for metals in the water should be handled differently, and that no study has been done to examine the potential effects on aquifers downstream that are sources of drinking water.",
    "“We are ready to embark on this permitting process now and would like your assistance in bringing the following agencies together to discuss our project.”\nHunter Moore, a policy adviser for the governor, forwarded that email to the directors of ADEQ and the state Department of Water Resources, saying Ducey would soon be in southern Arizona and would meet with representatives of the Hermosa mine project.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nLast year, Shafer took an Arizona Republic reporter on a tour of the area while Robert Gay, her partner, drove the truck on unpaved roads through the mountains.",
    "“But it always come back to, no matter how well you mine, this is an area that needs to be protected for species survival.”\nShe pointed out that the late biologist Edward O. Wilson, who in his book “Half-Earth” suggested setting aside half the planet’s land and sea for nature, cited the Sky Islands mountains of Arizona as one important area to protect and preserve.",
    "Representatives of South32 say the company hasn't yet determined its processing approach to separate the desired minerals from ore.\n\"We are neither actively nor imminently mining — the dewatering is for underground exploration of the orebody,\" Jenny Fiore-Magaña, communications director for the Hermosa Project, wrote in an email.",
    "“We cannot continue to extract minerals from the Earth and think it will go on forever and ever.”\nShe noted that Barksdale Resources Corp., which is headquartered in Vancouver, British Columbia, is also pursuing exploratory projects to assess deposits of copper, silver and other metals in the Patagonia Mountains.",
    "\"We're basically shifting it away from the resource for safety reasons and then it re-enters the aquifer where it came from further downstream before Harshaw Creek gets into the town of Patagonia.”\nQuestions about permit\nPARA is in the process of appealing the aquifer protection permit.",
    "A lot of it's Forest Service, some of it private.”\nGroup sees itself as a 'watchdog'\nThe Hermosa Project is one of dozens of active mines and planned projects in Arizona where companies are either extracting or targeting deposits of copper, gold, silver and other metals.",
    "Shafer said she’s deeply concerned about what would happen to this creek, and surrounding water sources, if the Australian mining company South32 is allowed to conduct an exploratory operation nearby called the Hermosa Project.",
    "“The meetings have all gone well, but I would like to ask for any updates from your agencies.”\nADEQ Director Misael Cabrera emailed three officials in the agency to ask for background on the project and permit status.",
    "Pat Risner, president of the Hermosa Project, said South32 has conducted an extensive amount of monitoring and modeling, which shows that groundwater from the Santa Cruz basin would re-enter the aquifer it came from.",
    "They have asked for additional data collection and increased transparency, specifically demanding that before South32 dewaters the aquifer, the company builds the locations where ADEQ will monitor contamination.",
    "State officials see benefits in the Hermosa Project, said Laura Malone, the waste programs division director for the Arizona Department of Environmental Quality, which is in charge of environmental regulation.",
    "\"So it was a really sophisticated solution to taking this site that we knew we had some environmental issues, working with a responsible company that wanted to come in, and utilize that property for mining.\"",
    "“Fortunately, this area has a lot of very active citizens who are already organized and talking about water and how to protect it.”\nZayna Syed is an environmental reporter for The Arizona Republic/azcentral.",
    "PARA has also asked for baseline data of the streambed before any large discharge, minimum monthly monitoring and public release of compliance monitoring and background data, in addition to other requests.",
    "The Patagonia Area Resource Alliance and other conservation groups, together with the town of Patagonia, submitted a letter with comments in May on South32's pollutant discharge permit change application.",
    "The mountains rise to more than 7,000 feet in elevation, providing habitats where more than 300 species of birds are found, and where animals from jaguars to black bears roam through the rugged landscape.",
    "Shafer has voiced concerns that the mining industry identifies Arizona as one the friendliest jurisdictions in the world, and that state regulators appear to prioritize facilitating more mining projects.",
    "“There is a finite limit to this, and all the warning signals are blaring that it is time to think in different ways, human beings.”\nBeside the road, the hills gave way to terraces of disturbed ground.",
    "Trevor Baggiore, director of ADEQ’s water quality division, replied that the company had provided comments on a first draft of the permit and state officials had scheduled a follow-up meeting.",
    "I have seen so much wildlife out here, including mountain lion and bear and coatimundi.”\nThey stopped at the ruins of Harshaw, a town that bustled during its mining heyday in the late 1800s.",
    "The pumping and discharge of water into the creek would occur in the same watershed as the town of Patagonia, where Shafer lives and where residents rely on groundwater pumped from wells.",
    "It means the water flows continuously at every level.”\nThe Patagonia Mountains are recognized as a hotspot of biodiversity in the Sky Islands region straddling the Arizona-Mexico border.",
    "One revision, concerning pollutant discharges, would designate Harshaw Creek a discharge site, allowing South32 to release groundwater and treated mine drainage into the creek.",
    "The proposed new water treatment plant would be South32's second plant for the project and would discharge the extracted groundwater as well as mine drainage water and seepage.",
    "“As you may recall our ‘ask’ was to streamline the permitting process by congregating all state agencies we would be dealing with to move our project forward,” Lucero wrote.",
    "The group has raised several concerns about the Hermosa Project, including the drawdown of the aquifer and the treated wastewater that could flow into Harshaw Creek.",
    "PATAGONIA — Carolyn Shafer walked along a winding creek bed in the Patagonia Mountains, where oak trees and junipers dotted the grassy slopes of the canyon.",
    "“I believe up there is where they’re going to put in a second water treatment plant, and then discharge the water,” Shafer said, motioning to the creek bed.",
    "Treated water would be released continuously into the creek, ADEQ said, with a flow of up to 4,500 gallons per minute, or about 6.5 million gallons per day.",
    "We can't keep behaving like we can just continually pull, extract materials out of the planet,” she said after walking through the ruins of an adobe house.",
    "The company says these minerals will feed the United States' growing demand for base metals as the country moves toward producing more electric vehicles.",
    "When ASARCO, one of the companies that used to mine on the Hermosa Project site, declared bankruptcy, it left waste material for the state to clean up.",
    "Shafer and other members of PARA, which was founded in 2011, say they aim to preserve and protect the Patagonias from the risks of large-scale mining.",
    "And how does it disrupt people’s wells?”\nShafer is the board chair of a local conservation nonprofit called Patagonia Area Resource Alliance, or PARA.",
    "The company says the new treatment plant will rid the water of metal constituents natural to groundwater, like zinc and selenium, as well as sediment.",
    "“The highest flow rate is expected to occur in the first years of exploration activities, with flows declining over time,” ADEQ said in the document.",
    "The company wants to pump water from the aquifer — part of the Santa Cruz watershed — away from the mineral deposit, a process called \"dewatering.\"",
    "In the first of the emails on April 20, 2017, Greg Lucero, a vice president of the Hermosa Project, wrote Juan Ciscomani, a senior adviser to Gov.",
    "The groups also said South32's application fails to comply with state law or serve the regulatory purpose of protecting drinking-water aquifers.",
    "Because mining from the mid-1800s to 1960s depleted minerals closest to the surface, the company plans to drill 1,300 to 4,000 feet underground.",
    "Shafer has helped lead local opposition to these and other mining projects using slogans that warn of the consequences for water supplies.",
    "Environmental coverage on azcentral.com and in The Arizona Republic is supported by a grant from the Nina Mason Pulliam Charitable Trust.",
    "\"We're just trying to figure out where we can site those wells based on land ownership and where we can actually place them,\" he said.",
    "South32 has to pump groundwater away from the mineral deposit, but that water doesn't meet Arizona's surface water quality standards.",
    "Follow The Republic environmental reporting team at environment.azcentral.com and @azcenvironment on Facebook, Twitter and Instagram.",
    "The woman explained that she and several other people were walking along Harshaw Creek to survey the stretches that had some water.",
    "Follow her reporting on Twitter at @zaynasyed_ and send tips or other information about stories to zayna.syed@arizonarepublic.com.",
    "He said the draft permit “will be revised based on the discussion” to prepare for launching the process through a public notice.",
    "“It really was a win, because the state would have not had the amount of money needed to take care of this issue,\" Malone said.",
    "Zinc, silver and lead can be used for renewable energy infrastructure, including electric vehicles and solar-powered batteries.",
    "The revision would also authorize a new water treatment plant, where the treated water would be discharged into Harshaw Creek.",
    "She pointed to a series of 2017 emails between state officials, which her group obtained through a public records request.",
    "“If you’re moving that much water, what is happening to the area that you are removing all that water from?” Shafer said.",
    "What we can do is hold them to the highest level of accountability under those laws and regulations,” Shafer said.",
    "Company wants to revise two permits\nIn August 2020, South32 applied to ADEQ to revise two of its state permits.",
    "“We are the ground zero for the changes that need to happen on this planet in order to survive as human beings.",
    "And then it’d go down the Harshaw.”\nA woman approached holding a clipboard, and Shafer called out to greet her.",
    "She wore a T-shirt with the words “Water Matters More.” She’s also begun using another slogan — “Water is Life.",
    "South32, acting through its U.S. subsidiary Arizona Minerals, aims to extract silver, lead, zinc and manganese.",
    "Manganese, considered a critical mineral by the U.S. government, is important for electric vehicle batteries.",
    "There are hundreds of old mine sites scattered across the Patagonia Mountains from the 1800s and early 1900s.",
    "“My recollection is that we have met with them every time that they have requested a meeting,” Moore wrote.",
    "“If you remove that much water from one area … what happens to all of this plant life and to the wildlife?",
    "The operation would redirect some of that water, as much as 6.5 million gallons a day, to Harshaw Creek.",
    "In its November newsletter, PARA called these demands \"legally defensible and scientifically supported.\"",
    "He also said South32 is looking to add additional monitoring locations downstream of Harshaw Creek.",
    "At a dry stretch of the creek, Shafer got out and stood under the trees, where birds were singing.",
    "She added that mineral processing methods for a potential mine are still being tested and refined.",
    "The state wasn't given enough money to clean up the old mine, and was looking for a buyer to help.",
    "The Arizona Department of Environment Quality released a response to the public comments in July.",
    "Company officials say the water would re-enter the aquifer before reaching the town of Patagonia.",
    "Another revision, concerning South32's \"aquifer protection\" permit, stipulates discharge volume.",
    "And in recent years, companies have sought to once again carry out large mining projects.",
    "Stopping the truck, Gay and Shafer got out and looked up the road toward the mining area.",
    "“The mining companies are now talking about, they will mine in modern ways,” she said.",
    "Shafer said she thinks her group plays an important watchdog role in the process.",
    "“It is an active community that wants to protect the environment,” Shafer said.",
    "Above a fence topped with barbed wire, the top of a drilling rig was visible.",
    "ADEQ declined to provide any further information \"due to the ongoing appeal.\"",
    "At that depth, miners will tap into an aquifer, which will flood the shafts.",
    "“The existing federal and state laws are written to allow mining to happen.",
    "Don't Mine It Away.” — which she sometimes uses as a sign-off in emails.",
    "“The Patagonia Mountains have a highly fractured geology,\" Shafer said.",
    "The creek was mostly dry, except for a puddle in the rocky stream bed.",
    "A formal hearing on the aquifer protection permit was held last month.",
    "He said he was following up on a visit Ciscomani had made to the site.",
    "Shafer said she worries about the effects of dewatering the aquifer.",
    "\"It's not like you just drill down and down there, there's a lake.",
    "A sign announced the main entrance of South32’s Hermosa Project.",
    "We are in climate crisis, we are in megadrought,” Shafer said.",
    "\"We're not consuming or utilizing this water,\" Risner said.",
    "“This feeds my soul every time we're out here,” she said.",
    "“That’s part of what makes this area so special for me.",
    "“I believe this is where they intend to dump it in.",
    "“Fast forward now to the reality we live in.",
    "\"Obviously, we don't own all the land.",
    "You need to bring the water out of it.",
    "Doug Ducey."
  ]
}