{
  "id": 9793,
  "mediaId": 2520,
  "date": "2022-03-25",
  "headline": "Here are the candidates running in Arizona's new 6th Congressional District",
  "image": "https://www.gannett-cdn.com/presto/2022/03/24/USAT/565fc652-b97a-4ce2-afaf-dd9c42b717fc-GettyImages-1185155285.jpeg?crop=3599,2024,x0,y0&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/elections/2022/03/25/candidates-running-arizonas-new-6th-congressional-district/8826337002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Estrada",
  "authorUrl": "https://www.azcentral.com/staff/5819881001/melissa-estrada/",
  "termIds": [
    5309,
    3725,
    1477,
    392,
    5949,
    6070,
    6517,
    6667,
    6678
  ],
  "sentences": [
    "Free's campaign website lists the issues she is campaigning on, including education by helping community colleges and trade school students with skills to help them transfer to the workforce after graduation, stronger border control, ensuring the military has the proper resources, and business.",
    "Other issues include rebuilding the economy and focusing on physical infrastructure such as rural broadband, commerce and transportation along with social infrastructure like job training, child support, college and career readiness.",
    "Supreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage",
    "Here are the major candidates running to represent the district:\nDemocrats\nAvery Anderson\nAvery Anderson is a \"Young American representing young voters and Arizonans of District 6,\" according to his campaign website.",
    "Ciscomani's campaign website features issues he is campaigning on, including border security to stop drug smugglers and human traffickers through more personnel and technology and by finishing the border wall.",
    "Some of the issues listed on Martin's campaign website are election integrity, stronger physical barriers at the border, ending chain immigration and the lottery, national defense and the U.S government.",
    "Hernandez's campaign website states that he \"is running for Congress to continue to fight for progressive values while working across the aisle to get real results for the people of Southern Arizona.\"",
    "Ciscomani also names \"conservative values\" as a campaign issue, specifying his support for the First and Second Amendments, an anti-abortion-rights agenda, and his opposition to critical race theory.",
    "Election integrity is listed; he says he stands against efforts to undermine ID laws; register ineligible voters; felons voting; and using \"taxpayer money to fund campaign attack ads.\"",
    "Anderson's campaign has a focus on the younger generation, including campaign platforms such as brining a younger generation to congress to match America's younger demographic.",
    "Anderson previously worked in the energy field, advancing domestic wind energy implementation, and currently works as an engineer to advance America's technological defense.",
    "He aims to achieve this by increasing financial aid to increase access to postsecondary education, increase quality of K-12 education, and improving preschool programs.",
    "\"Kirsten is running for Congress to fight for access to quality affordable healthcare and protect our environment and natural resources,\" Engel's campaign website says.",
    "Expanding affordable health care, lowering prices of prescription drugs, fighting for reproductive rights, and supporting Medicare and Social Security also are listed.",
    "Republicans\nJuan Ciscomani\nJuan Ciscomani for the last seven years has been working as the senior adviser for regional and international affairs under Gov.",
    "Her website identifies her campaign issues as protecting the environment and advocating that Arizona should become the solar energy capital of the world.",
    "Other campaign issues include taking advantage of Arizona's potential to be a leader solar energy production and increasing educational attainment.",
    "Other campaign issues include lowering the United States national debt, balancing the budget and shrinking the powers of the federal government.",
    "Hernandez previously has served as a school board president and as the program manager for Planned Parenthood's Latino outreach program, RaÍz.",
    "Daniel Hernandez\nDaniel Hernandez, an aide to former U.S. Rep. Gabrielle Giffords, D-Ariz., assumed office as a state representative in 2017.",
    "Kirsten Engel\nFormer state Sen. Kirsten Engel, D-Tucson, is running to fill the seat as Arizona's 6th Congressional District representative.",
    "Mayberry states he is running for congress because, \"I can no longer sit by while the Socialist agenda threatens to destroy America.\"",
    "Kathleen Winn\nKathleen Winn previously served in the Arizona Attorney General's Office as community outreach and education director.",
    "Lucretia Free\nLucretia Free is the publisher and creator of the Vail Voice newspaper and the American Woman Shooter Gun Magazine.",
    "That district, currently Arizona's 2nd Congressional District, now has been reconfigured into the new 6th Congressional District.",
    "Winn's issues listed on her campaign website include securing the border, public safety, education and election integrity.",
    "His website states both of these jobs are \"key fields\" to qualify him to represent Arizona's 6th Congressional District.",
    "The congressional district currently covers Cochise County and part of Pima County, including the majority of Tucson.",
    "Engel formerly worked at the Massachusetts's Office of Attorney General and the U.S Environmental Protection Agency.",
    "In that role, Winn helped establish the Veteran's Court and helped create the Task Force Against Senior Abuse.",
    "However, it highlights his previous focus on health care, including efforts to expand affordable health care.",
    "Ciscomani formerly served as the vice president of the Tucson Hispanic Chamber of Commerce.",
    "Democratic incumbent Rep. Ann Kirkpatrick is retiring and leaving her U.S. House seat open.",
    "The website says he believes in issues such as limited government and securing the border.",
    "Mayberry states his support of the Second Amendment and his opposition of abortion rights.",
    "The Arizona Independent Redistricting Commission is finalizing the redistricting process.",
    "Winn is also a member of the Maricopa County Community College District Governing Board.",
    "Although he made it onto the ballot, Mayberry has yet to file paperwork with the FEC.",
    "Brandon Martin\nBrandon Martin served 11 years with the United States Army Reserve.",
    "Mayberry's campaign website issues are to defend the \"constitutional government.\"",
    "Young Mayberry\nYoung Mayberry served in the United States Air Force for 28 years.",
    "She announced in September her resignation from that office to run for Congress.",
    "Free currently is the chair of the Pima County Transportation Committee.",
    "Free has filed paperwork with the Federal Election Commission.",
    "His campaign website does not list any issues of his platform.",
    "Hernandez is the co-founder of the Arizona House LGBTQ Caucus.",
    "Engel assumed office in the state Senate in January 2021.",
    "Mayberry is a former farmer of 24 years and educator.",
    "He also aims to keep young voters involved.",
    "Winn has filed paperwork with the FEC.",
    "Doug Ducey."
  ]
}