[
  {
    "id": 3138,
    "mediaId": 2547,
    "date": "2022-01-28",
    "sentence": "It had support from lawmakers like Rep. Mo Brooks of Alabama, Matt Gaetz of Florida, Scott Perry of Pennsylvania, and <span class='selected-term'>Jim Jordan</span> of Ohio, just to name a few.",
    "author": "Brandi Buchman",
    "title": "Jan. 6 Committee Slams Trump's Fake 'Electors' With Raft Of Subpoenas"
  },
  {
    "id": 2524,
    "mediaId": 2550,
    "date": "2022-02-10",
    "sentence": "After his proposal to seat two staunch Trump allies on the committee, including Rep. <span class='selected-term'>Jim Jordan</span> of Ohio—who was, even then, considered to be a potential material witness to the overall probe—McCarthy took his ball and went home.",
    "author": "",
    "title": "Trump White House call record omissions raise eyebrows"
  },
  {
    "id": 920,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "Pic\nHAPPY BIRTHDAY: Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio), Suzan DelBene (D-Wash.) (6-0) and Jake LaTurner (R-Kan.) … Brian Jack … DHS’ Sam Vinograd … Betsy Fischer Martin … Axios’ Lachlan Markay … Keegan Goudiss … McClatchy’s Kristin Roberts … Ashley Berrang … CNN’s Dianna Heitz … Cara Camacho … Boeing’s Fred Schwien … Edith Honan … AARP’s Barbara Shipley … Danielle Most … POLITICO’s Kelsey Tamborrino and Baker Landon … Annamarie Rienzi … Mark Shriver of Save the Children … Drew Cantor … Frederick Hill of FTI Consulting … Steven Grossman … Preston Mizell of Rep. Darrell Issa’s (R-Calif.) office … James Lynch … Alison Kutler … Mike Sager of EMILY’s List … Allison Hunn … David Carreiro … NAICU’s Emmanual Guillory … Shana Marchio … Skyla Freeman … Stephanie Young of When We All Vote … Cliff Sims … Surya Gunasekara … former Rep. Randy Forbes (R-Va.) (7-0) … Robert Giuffra\nDid someone forward this email to you?",
    "author": "",
    "title": "POLITICO Playbook: Operation ‘Stop Greitens’ goes awry"
  },
  {
    "id": 12515,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Kerry Picket",
    "title": "Harris compares Republicans to 1960s Alabama state troopers on ‘Bloody Sunday’"
  },
  {
    "id": 13763,
    "mediaId": 8480,
    "date": "2022-03-18",
    "sentence": "It’s wrong if it happens,” said Rep. <span class='selected-term'>Jim Jordan</span> (Ohio), the top Republican on the House Judiciary Committee.",
    "author": "Cristina Marcos",
    "title": "House passes CROWN Act, banning race-based hair discrimination"
  },
  {
    "id": 9475,
    "mediaId": 2728,
    "date": "2022-03-23",
    "sentence": "Other Republicans involved in the effort to overturn the 2020 election — Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania — have refused requests from the panel for interviews.",
    "author": "Luke Broadwater",
    "title": "Mo Brooks says Donald Trump asked him to illegally ‘rescind’ the 2020 election"
  },
  {
    "id": 9613,
    "mediaId": 2636,
    "date": "2022-03-23",
    "sentence": "Other Republicans involved in the effort to overturn the 2020 election — Representatives <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania — have refused requests from the panel for interviews.",
    "author": "",
    "title": "House Republican Says Trump Asked Him to Illegally ‘Rescind’ 2020 Election"
  },
  {
    "id": 9594,
    "mediaId": 2688,
    "date": "2022-03-29",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>\nThe official call logs include one 10-minute call between Trump and Rep. Jim Jordan (R-OH) starting at 9:24 a.m. on Jan. 6.",
    "author": "Matt Shuham",
    "title": "Trump Was 100% Making Phone Calls During The Jan. 6 Attack: Here’s The List"
  },
  {
    "id": 9099,
    "mediaId": 2658,
    "date": "2022-03-29",
    "sentence": "The select committee has already attempted to secure voluntary cooperation from three Republican lawmakers: Rep. Scott Perry (Pa.), Rep. <span class='selected-term'>Jim Jordan</span> (Ohio) and GOP Leader Kevin McCarthy.",
    "author": "",
    "title": "The Jan. 6 panel had cooled focus on GOP lawmakers. Then Brooks happened."
  },
  {
    "id": 9304,
    "mediaId": 2627,
    "date": "2022-03-30",
    "sentence": "Late last year, the House select committee investigating the Jan. 6 attack took a bold step: The panel asked three Republican members of Congress — Pennsylvania’s Scott Perry, Ohio’s <span class='selected-term'>Jim Jordan</span>, and California’s Kevin McCarthy — to voluntarily cooperate with investigators.",
    "author": "Steve Benen",
    "title": "After being scorned by Trump, will Brooks answer Jan. 6 questions?"
  },
  {
    "id": 7816,
    "mediaId": 6687,
    "date": "2022-04-02",
    "sentence": "“People in Congress, from Senators Rand Paul and Ted Cruz to Congressmen Marjorie Taylor Greene, Brian Babin, Thomas Massie, <span class='selected-term'>Jim Jordan</span>, Scott Perry and many, many others know Alabama’s Senate race is a no-brainer.",
    "author": "Yaffee",
    "title": "Chairman of House Freedom Caucus endorses Mo Brooks – He ‘fights unwaveringly for our conservative values’"
  },
  {
    "id": 7165,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "In a new supercut video set to The Tings Tings hit “That’s Not My Name”, The Daily Show's Trevor Noah takes her to school, trotting out the list of Republicans who have been exposed for proven or alleged sexual liaisons with underage people: former House Speaker Dennis Hastert, Florida Rep. Matt Gaetz, former Rep. Mark Foley of Massachusetts, Alabama's Roy Moore and Rep. <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Timothy Evans",
    "title": "Marjorie Taylor Greene's latest screed about Democrats destroyed in 'Daily Show' supercut"
  },
  {
    "id": 6066,
    "mediaId": 6687,
    "date": "2022-04-18",
    "sentence": "“Congressmen like <span class='selected-term'>Jim Jordan</span>, Scott Perry, and others in the Freedom Caucus need conservative fighters to work with them in the House, and they know that Casey Wardynski is the only candidate in this race that will stand with them and further an America First agenda.”\n“The Freedom Fund endorsement is highly sought after, and we’re glad that after thoroughly vetting the AL-5 field they recognized Casey Wardynski as the true conservative in the race,” he added.",
    "author": "Dylan Smith",
    "title": "House Freedom Caucus political arm endorses Casey Wardynski in AL-5 race"
  }
]