[
  {
    "id": 4571,
    "mediaId": 2724,
    "date": "2022-01-12",
    "sentence": "pic.twitter.com/8AWWLhMxNy\n— Scott Morefield (@SKMorefield) January 12, 2022\nRELATED: GOP Senator Slams ‘Least Trusted Bureaucrat’ After Fauci Is Caught On Hot Mic Calling Him A ‘Moron’\nCarlson Excoriates ‘Filthy Little Demagogue’ Fauci\nCarlson said at the beginning of his monologue, “Turns out, Tony Fauci’s even more loathsome and complicit even than his toughest critics ever alleged.”\n“Today, two Republican congressmen, James Comer and <span class='selected-term'>Jim Jordan</span>, released emails that show Fauci was warned by scientists at the very beginning of the Corona pandemic this virus very likely leaked from the Wuhan Institute of Virology,” Carlson said.",
    "author": "John Hanson",
    "title": "Tucker Carlson Goes All In: Blasts Fauci As ‘Filthy Little Demagogue’"
  },
  {
    "id": 4069,
    "mediaId": 2614,
    "date": "2022-01-17",
    "sentence": "And with news of Fauci’s financial gains released, Ohio Representative <span class='selected-term'>Jim Jordan</span> promised to investigate the doctor right after the GOP wins back the House in November.",
    "author": "Red Voice Media",
    "title": "Jim Jordan Reveals What Happens To Dr. Fauci When The GOP Takes The House In 2022 Midterms [VIDEO]"
  },
  {
    "id": 3593,
    "mediaId": 2724,
    "date": "2022-01-18",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> warned that Republicans will “definitely” investigate Dr. Anthony Fauci should the GOP win back the House in 2022.",
    "author": "Rusty Weiss",
    "title": "Jim Jordan: We’re ‘Definitely’ Investigating Fauci If Republicans Win Back The House"
  },
  {
    "id": 4061,
    "mediaId": 2818,
    "date": "2022-01-20",
    "sentence": "In the older age brackets of 35-44, 45-64, and 65+, respondents favored Fauci, supporting him by 57.4%, 50.5%, and 53.6% respectively.”\nBad news for Fauci, who also may be facing an investigation should the GOP win back the House; <span class='selected-term'>Jim Jordan</span> (R-OH) has promised to go after the doctor.",
    "author": "",
    "title": "FAUCI’S FLAGGING SUPPORT: Poll Shows Four out of Five Young Americans Think Fauci Should Resign"
  },
  {
    "id": 4073,
    "mediaId": 6621,
    "date": "2022-01-24",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), ranking member of the House Judiciary Committee, has tipped his hand on what he will do if the GOP flips the House after midterms, making Jordan chairman.",
    "author": "",
    "title": "JORDAN’S HIT LIST: GOP Majority Going After Garland, Mayorkas, Fauci"
  },
  {
    "id": 3705,
    "mediaId": 2573,
    "date": "2022-01-25",
    "sentence": "In a letter to Health and Human Services Secretary Xavier Becerra, Reps. James Comer, R-Ky., and <span class='selected-term'>Jim Jordan</span>, R-Ohio, pointed to a Feb. 1, 2020, conference call that included Fauci and former National Institutes of Health Director Francis Collins in which the virus's origins were discussed.",
    "author": "Ronn Blitzer",
    "title": "Reps. Comer, Jordan expose new Fauci emails they say point to COVID-19 lab leak 'cover up'"
  },
  {
    "id": 3616,
    "mediaId": 2724,
    "date": "2022-01-25",
    "sentence": "Fauci’s home office features photos of himself, his own bobblehead https://t.co/o7PqEYeFXt pic.twitter.com/y2LDGyJVUd\nRepresentative <span class='selected-term'>Jim Jordan</span> (OH) recently warned that Republicans will “definitely” investigate Dr. Fauci should the GOP win back the House in 2022.",
    "author": "Rusty Weiss",
    "title": "New Poll Shows Majority Of Independents Want Fauci To Resign"
  },
  {
    "id": 3728,
    "mediaId": 2618,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Leslie Eastman",
    "title": "Sen. Ron Johnson Hosts “Second Opinion” Panel on America’s Problematic Pandemic Response"
  },
  {
    "id": 2817,
    "mediaId": 2572,
    "date": "2022-02-03",
    "sentence": "Reps. James Comer, R-Ky.,, a member of the Oversight and Reform Committee; Steve Scalise, R-La., the minority whip and ranking member of the Select Subcommittee on the Coronavirus Crisis; and <span class='selected-term'>Jim Jordan</span>, R-Ohio, ranking member of the Judiciary Committee, have questioned whether these scientists felt pressure from top health officials like Dr. Antony Fauci and Dr. Francis Collins.",
    "author": "Caitlin McFall",
    "title": "Top oversight Republicans call on 7 scientists to testify on COVID origins, Wuhan lab leak"
  },
  {
    "id": 2591,
    "mediaId": 2580,
    "date": "2022-02-05",
    "sentence": "This deep distrust includes two prominent members of Congress, Rep. <span class='selected-term'>Jim Jordan</span>, ranking member of the Committee on the Judiciary, and U.S. Sen. Roger Marshall, R-Kan., a scientist and physician I spoke with on Wednesday.",
    "author": "GOPUSA",
    "title": "Rep. Jim Jordan and Sen. Roger Marshall Expose Fauci’s Web of Deceit"
  },
  {
    "id": 1915,
    "mediaId": 2641,
    "date": "2022-02-06",
    "sentence": "Democrats have long claimed to be against gerrymandering, but they have no issue with the partisan redrawing of congressional districts when it suits them, according to Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Eric Mack",
    "title": "Rep. Jordan: Redistricting 'Only Gerrymandering' When GOP Does It"
  },
  {
    "id": 2081,
    "mediaId": 2636,
    "date": "2022-02-07",
    "sentence": "Another Republican from Ohio, Representative <span class='selected-term'>Jim Jordan</span>, who claims that Dr. Fauci knew the coronavirus “came from a lab,” has vowed that Republicans will investigate him if they win control of the House.",
    "author": "",
    "title": "Republicans, Wooing Trump Voters, Make Fauci Their Boogeyman"
  },
  {
    "id": 2411,
    "mediaId": 2679,
    "date": "2022-02-07",
    "sentence": "Another Republican from Ohio, Rep. <span class='selected-term'>Jim Jordan</span>, who claims that Fauci knew the coronavirus “came from a lab,” has vowed that Republicans will investigate him if they win control of the House.",
    "author": "SHERYL GAY STOLBERG",
    "title": "Republicans, wooing Trump voters, make Fauci their boogeyman"
  },
  {
    "id": 1995,
    "mediaId": 2625,
    "date": "2022-02-09",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 9, 2022",
    "author": "Matt Reynolds",
    "title": "Fauci Says “Full-Blown” Pandemic Is Almost Over"
  },
  {
    "id": 945,
    "mediaId": 8322,
    "date": "2022-02-11",
    "sentence": "Comer and Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, published portions of emails last month revealing Fauci knew that COVID-19 may have been intentionally modified and leaked from the Wuhan Institute of Virology.",
    "author": "",
    "title": "Rep. Comer accuses Fauci, CCP of covering up COVID origins 'from day one': 'Is he a mad scientist?'"
  },
  {
    "id": 12800,
    "mediaId": 2512,
    "date": "2022-03-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, on Tuesday said that investigating Dr. Anthony Fauci, the country's leading expert on infectious disease, will be one of his top priorities if the GOP retakes the House in this year's midterm elections.",
    "author": "Jon Skolnik",
    "title": "Jim Jordan vows to 'investigate' Anthony Fauci if GOP retakes Congress"
  },
  {
    "id": 12514,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, on Tuesday said that investigating Dr. Anthony Fauci, the country's leading expert on infectious disease, will be one of his top priorities if the GOP retakes the House in this year's midterm elections.",
    "author": "Jon Skolnik",
    "title": "Jim Jordan promises to investigate Dr. Fauci if GOP retakes the House this year"
  },
  {
    "id": 13001,
    "mediaId": 4024,
    "date": "2022-03-01",
    "sentence": "WASHINGTON, D.C. (LifeSiteNews) — Republican U.S. Rep. <span class='selected-term'>Jim Jordan</span> of Ohio says investigations into Dr. Anthony Fauci and the Centers for Disease Control (CDC) need to become a top priority if Republicans get control of the House after the 2022 midterm elections.",
    "author": "Jack\nBingham",
    "title": "Jim Jordan says investigating Fauci a priority if GOP controls House after midterm election"
  },
  {
    "id": 13228,
    "mediaId": 2548,
    "date": "2022-03-02",
    "sentence": "(RELATED: Rep. <span class='selected-term'>Jim Jordan</span> Says Biden Might Want To Change His Policies, But The ‘Radical Left’ In His Party Will Never Let Him)\nSanctioning Russian energy has gained bipartisan support from lawmakers, political commentators and elites.",
    "author": "Nicole Silverio",
    "title": "Gutfeld Says US Government Is ‘Acting Like White Knights’ As They Purchase Russian Oil"
  },
  {
    "id": 13310,
    "mediaId": 2609,
    "date": "2022-03-04",
    "sentence": "Ohio congressman <span class='selected-term'>Jim Jordan</span> (R) indicates an investigation into Fauci is a priority if they regain a majority in November’s midterms.",
    "author": "Leslie Eastman",
    "title": "Where in the World Has Dr. Anthony Fauci Gone?"
  },
  {
    "id": 13165,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "(Snip) Ohio congressman <span class='selected-term'>Jim Jordan</span> (R) indicates an investigation into Fauci is a priority if they regain a majority in November’s midterms.",
    "author": "Leslie Eastman",
    "title": "Where in the World Has Dr. Anthony Fauci Gone?"
  },
  {
    "id": 11374,
    "mediaId": 2754,
    "date": "2022-03-07",
    "sentence": "“And if you’re watching this, Dr. Fauci, look out because when the Americans give us control in the House of Representatives, God willing, we’re going to get some answers on behalf of the American people.”\nRoy’s remark came just a few days after Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), the ranking Republican on the House Judiciary Committee, confirmed to Just The News that the GOP will attempt to investigate Fauci and other federal health officials over how they responded to the COVID-19 pandemic.",
    "author": "Tyler Durden",
    "title": "GOP Says It'll Investigate Fauci If It Retakes House in 2022"
  },
  {
    "id": 10982,
    "mediaId": 2594,
    "date": "2022-03-17",
    "sentence": "Even <span class='selected-term'>Jim Jordan</span> got in on the action, asking on Twitter, \"where’s Fauci?\"",
    "author": "Justin Vallejo",
    "title": "Where’s Fauci? ‘Witness protection’ quip leads to internet conspiracy"
  },
  {
    "id": 10953,
    "mediaId": 2614,
    "date": "2022-03-18",
    "sentence": "Fauci is probably responding to House republicans like Texas REP Chip Roy or Ohio REP <span class='selected-term'>Jim Jordan</span> who have made comments that they’ll be coming after him.",
    "author": "SteveGruber.com",
    "title": "Fauci Running Scared"
  },
  {
    "id": 11400,
    "mediaId": 2642,
    "date": "2022-03-18",
    "sentence": "He can retire, and hope that things just “go away” and everyone forgets about him, but we will never forget, and I am pretty sure <span class='selected-term'>Jim Jordan</span> and Rand Paul will never forget either.",
    "author": "Missy Crane",
    "title": "Listen: Fauci Must’ve Had a Rough Nights Sleep…His Newest Move Today Suggests He’s Deeply Afraid of Midterms"
  },
  {
    "id": 9466,
    "mediaId": 6449,
    "date": "2022-03-23",
    "sentence": "It is worth recalling Fauci’s comments in response to questions from Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, about health measures amidst the pandemic: “I don’t look at this as a liberty thing … just as a public health thing.”\nHe was wrong.",
    "author": "Frank Yang",
    "title": "‘15 Days’ to 2 Years: How Power Corrupted Our Public Health Bureaucrats"
  },
  {
    "id": 8927,
    "mediaId": 2526,
    "date": "2022-03-28",
    "sentence": "When it came to the National School Board Association letter, those were questions that I asked on the House Intelligence Committee that <span class='selected-term'>Jim Jordan</span> then followed up with on the Committee on the Judiciary really probing.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Elise Stefanik on Biden Family Subpoenas: ‘I Would Support Those’"
  },
  {
    "id": 9370,
    "mediaId": 2748,
    "date": "2022-03-29",
    "sentence": "When it came to the National School Board Association letter, those were questions that I asked on the House Intelligence Committee that <span class='selected-term'>Jim Jordan</span> then followed up with on the Committee on the Judiciary really probing.",
    "author": "Blarp Blog",
    "title": "Exclusive — Elise Stefanik on Biden Family Subpoenas: ‘I Would Support Those’"
  },
  {
    "id": 9541,
    "mediaId": 2877,
    "date": "2022-03-31",
    "sentence": "Or it will be the story of how the people of the United States, the freest, most prosperous and successful nation in the history of the world, rallied around the truth the country was founded on and ushered in a century of liberty and justice and prosperity.” —Senator Marco Rubio\n“The Left will attack Ginni Thomas for exercising her political beliefs, but let Hunter Biden off the hook for his influence peddling.” —Congressman <span class='selected-term'>Jim Jordan</span>\nCOVID Swamp Doctor\n“I think the restrictions … certainly prevented a lot of infections, prevented a lot of hospitalizations, and prevented a lot of deaths.",
    "author": "Jordan Candler",
    "title": "Thursday Short Cuts"
  },
  {
    "id": 7178,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> speculated last week.",
    "author": "Wendell Husebø",
    "title": "Poll: 76 Percent Disapprove of Democrat-Controlled Congress"
  },
  {
    "id": 5596,
    "mediaId": 2642,
    "date": "2022-04-14",
    "sentence": "We’re going to look at all those issues because the American people deserve the truth.”\nYou can watch the video below:\nWe need someone like <span class='selected-term'>Jim Jordan</span> in the Speaker role.",
    "author": "Sophie O’Hara",
    "title": "[VIDEO] Jim Jordan Makes a Promise to Voters… Vows to Expose Joe’s Role in “Biden Crime Family Enterprise”"
  },
  {
    "id": 5479,
    "mediaId": 2532,
    "date": "2022-04-21",
    "sentence": "Following the court decision blocking the CDC's mask order in transportation, Ohio Republican Congressman <span class='selected-term'>Jim Jordan</span> tweeted that \"Fauci lost.",
    "author": "Alexander Tin",
    "title": "Fauci fears judge's ruling on travel mask mandate may set \"dangerous precedent\""
  }
]